{"organizations": ["BST Apple"], "uuid": "d633ea8f34a98ea90d702f8050b1752528d60ea4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ibtimes.co.uk", "main_image": "http://d.ibtimes.co.uk/en/full/1464221/iphone-app-tracks-menstrualcycle-sexual-health.jpg", "site_section": "http://www.ibtimes.co.uk/rss/technology", "section_title": "IBTimes.co.uk : Technology", "url": "http://www.ibtimes.co.uk/apple-ios-9-healthkit-will-track-duration-intensity-menstrual-cycles-1524568", "country": "US", "title": "Apple iOS 9 HealthKit will track duration and intensity of menstrual cycles", "performance_score": 0, "site": "ibtimes.co.uk", "participants_count": 0, "title_full": "Apple iOS 9 HealthKit will track duration and intensity of menstrual cycles", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T15:35:00.000+03:00", "replies_count": 0, "uuid": "d633ea8f34a98ea90d702f8050b1752528d60ea4"}, "author": "", "url": "http://www.ibtimes.co.uk/apple-ios-9-healthkit-will-track-duration-intensity-menstrual-cycles-1524568", "ord_in_thread": 0, "title": "Apple iOS 9 HealthKit will track duration and intensity of menstrual cycles", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Beck"], "text": "October 18, 2015 13:35 BST Apple's HealthKit app tracks menstrual cycle and sexual health Beck Diefenbach/Reuters \nApple's HealthKit app includes a new feature for women to log and track their sexual activity and menstrual cycles with the release of new operating system, iOS 9. Android's Google Fit and Samsung's S Health still lag behind, as their built-in health apps have yet to add this feature. \nApple, a company where only 30% of its employees are female, was criticised for ignoring women's health issues and overlooking period tracking as a key function. The app has the ability to monitor everything from Vitamin D, copper and selenium intake to Peripheral Perfusion Index, so why has this basic function been left out until now? \nMany other reproductive apps are available such as Clue, Bellabeat and Glow which are aimed at helping women get pregnant (or preventing it), which will also let you know when your period is coming. \nWith the latest iOS release, women can track include sexual activity on the HealthKit app, including whether protection was used, body temperature, cervical mucus quality, menstruation and spotting. HealthKit period tracker – it’s almost as if Apple just realized that women exist. #WWDC15 pic.twitter.com/NuJGy7cGJW — Tony Webster (@webster) June 8, 2015 \nWhile there are a lot of period tracker apps in the market, co-founder Ida Tin says Clue has a more ambitious aim than most — and talks in terms of building a \"platform for female health\". \n\"What we want to do is basically bringing this whole amazing field of female health into the whole age of data,\" Tin tells TechCrunch . \"Seeing how we can integrate all kinds of data streams from various sensors and so on and bring this all together and give women a really powerful way to understand what's going on in their bodies.\" \nMegan King, a New York-based user of women's reproductive health app, Clue, says that these apps are a good way to track menstrual cycle and fertility. \"Apple integrating is a huge step forward because it's showing its support of women being aware of what's going on in their own body, and they want it to be something important to everyone,\" she tells the BBC . \nHowever, conception is not the only reason why a period tracker can be useful. Awareness of an irregular menstrual cycle can indicate wider health issues including stress, hormone problems, and more. Cycle regularity can also be influenced by diet, travel, exercise, drug use, breast-feeding and other changes. \nTara Culp-Ressler, a US journalist who tracks reproductive health issues, says that reproductive organs are important to track along with heartbeat or sleep patterns. She tells the BBC that this app is a good step to see such a huge company, especially one that's been criticised in the past, is really stepping up and making a statement that women's health is an integral part of healthcare. More Health News", "external_links": [], "published": "2015-10-18T15:35:00.000+03:00", "crawled": "2015-10-18T16:29:53.035+03:00", "highlightTitle": ""}