{"organizations": [], "uuid": "63ba804cf933505e381fb07dd29610897b9ec389", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.retailtechnologyreview.com", "main_image": "", "site_section": "http://www.retailtechnologyreview.com/feed.rss", "section_title": "Retail Technology Review  RSS Feed", "url": "http://www.retailtechnologyreview.com/articles/2015/10/07/want-to-rank-higher-in-mobile-phone-searches-on-google-searchmetrics-provides-key-insights/", "country": "GB", "title": "Want to rank higher in mobile phone searches on Google? Searchmetrics provides key insights", "performance_score": 0, "site": "retailtechnologyreview.com", "participants_count": 1, "title_full": "Want to rank higher in mobile phone searches on Google? Searchmetrics provides key insights", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T11:51:00.000+03:00", "replies_count": 0, "uuid": "63ba804cf933505e381fb07dd29610897b9ec389"}, "author": "Retail Technology Review", "url": "http://www.retailtechnologyreview.com/articles/2015/10/07/want-to-rank-higher-in-mobile-phone-searches-on-google-searchmetrics-provides-key-insights/", "ord_in_thread": 0, "title": "Want to rank higher in mobile phone searches on Google? Searchmetrics provides key insights", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Send to friend \nNew research confirms that online marketers and website owners need to follow a separate strategy to help their pages rank higher in mobile phone searches on Google. It is essential to pay particular attention to the specific user experience and technical requirements for mobile visitors, while ensuring the underlying content on pages continues to be relevant and comprehensive. \nThe findings come from the Searchmetrics Mobile Ranking Factors US 2015 study, an analysis of the top 30 mobile phone search results for 10,000 relevant keywords on Google.com. Building on Searchmetrics' annual ranking factors study for desktop search, this is the company's first comprehensive study of ranking factors for U.S. mobile search results. It provides insights and benchmarks about mobile search results for marketers, webmasters and SEO professionals, particularly in the wake of the Google mobile-friendly update which downgraded the mobile search rankings of pages not considered user friendly for mobile phones. \n\"More Google searches now take place on mobile devices than on computers in 10 countries including the US¹ and with its mobile friendly update, Google has made it clear that search results presented to mobile phone users should provide a good experience,\" said Marcus Tober, CTO and founder of Searchmetrics. \"Our first detailed study of mobile ranking factors offers insights into what is commonly found in high ranking Google search results on mobile phones and how this differs from desktop results.\" \nThree important areas covered by the research are: 1) User experience – adjust font size and use fewer menus, buttons and images \nThe smaller screen size and touch-based navigation on mobile phones means marketers need to pay specific attention to the mobile user experience to help their pages rank higher. This is why one in five pages (22%) ranking in the top 30 mobile search results use responsive design that automatically adjusts the format to suit a mobile, tablet or desktop. Many also use dedicated mobile sites. \nIn high ranking mobile search results, the average font size above the fold (visible area without scrolling) is significantly larger than on high ranking desktop results. Yet when you scroll down, the fonts on mobile phone pages are found to be smaller than on desktop pages. The above the fold text has to be bigger because it often includes clickable navigation links that let visitors click through to different parts of the site. \nHigh ranking mobile pages generally have fewer interactive elements such as menus and buttons as well as images. 72% of mobile pages in the top 30 search results contain at least one unordered list (e.g. bullet points) to help structure information (around a quarter more than in desktop search results). However, the lists on mobile pages are usually much shorter, with fewer individual points. 2) Technical – minimise file size & load time and avoid Flash \nThe average mobile page file size was found to be around 25% smaller, allowing faster load times. Only 5% of mobile pages make use of flash design (mostly used for animation and video), which is not widely supported by mobile devices, compared with 14% of desktop pages. 3) Content - should be relevant, holistic and high quality \nHolistic and relevant content remains one of the most important factors for high Google rankings in both desktop and mobile searches according to the analysis. It is paramount that both mobile and desktop pages cover topics comprehensively. For example analysis of the words in high ranking pages in both desktop and mobile searches indicates that a high percentage (above 70%) contain important \"proof terms\" strongly related to the search topic, while around half also include slightly more distant \"relevant terms\". \nThe study found variations between mobile and desktop content in some areas. High ranking content on mobile pages tends to be shorter on average (867 words) than on desktop (1285 words). It also includes significantly fewer internal links to related content on the same site (probably because Google advises against placing links too close to each other on mobile pages).", "external_links": [], "published": "2015-10-07T11:51:00.000+03:00", "crawled": "2015-10-13T22:05:08.920+03:00", "highlightTitle": ""}