{"organizations": [], "uuid": "01b3a690e89612360f2ce64c7012e820c0244416", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.technology.org", "main_image": "http://www.technology.org/texorgwp/wp-content/uploads/2015/10/900px-20100911_232323_Yeast_Live-540x540.jpg", "site_section": "http://feeds.feedburner.com/TechnologyOrgLifeSciencesTechnologiesNews", "section_title": "Technology Org » Life sciences & technologies news", "url": "http://www.technology.org/2015/10/13/comprehensive-study-maps-238-genes-that-extend-lifespan-in-yeast-cells-by-60-when-deleted/", "country": "", "title": "Comprehensive Study Maps 238 Genes that Extend Lifespan in Yeast Cells by 60% When Deleted", "performance_score": 0, "site": "technology.org", "participants_count": 1, "title_full": "Comprehensive Study Maps 238 Genes that Extend Lifespan in Yeast Cells by 60% When Deleted", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T13:10:00.000+03:00", "replies_count": 0, "uuid": "01b3a690e89612360f2ce64c7012e820c0244416"}, "author": "Alius Noreika", "url": "http://www.technology.org/2015/10/13/comprehensive-study-maps-238-genes-that-extend-lifespan-in-yeast-cells-by-60-when-deleted/", "ord_in_thread": 0, "title": "Comprehensive Study Maps 238 Genes that Extend Lifespan in Yeast Cells by 60% When Deleted", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comprehensive Study Maps 238 Genes that Extend Lifespan in Yeast Cells by 60% When Deleted Posted Today \nResearchers at the Buck Institute for Research on Aging and the University of Washington have identified 238 genes that extend the lifespan of S. cerevisiae yeast cells when removed, with 189 of these being linked to aging for the first time. A study documenting the 10-year effort has been published online in the journal Cell Metabolism . Removing certain genes from yeast cells extends their reproductive lifespans by up to 60 percent. What’s more, these same genes – previously associated with caloric restriction and longer life – are also found in many other organisms, including our own species. Image credit: Bob Blaylock via Wikipedia.org , CC BY-SA 3.0. \n“This study looks at aging in the context of the whole genome and gives us a more complete picture of what aging is. It also sets up a framework to define the entire network that influences aging in this organism,” said lead researcher Brian Kennedy, PhD, who’s also the CEO of Buck Institute. \nIn the study, the two groups of scientists examined 4,698 strains of yeast strains, each with a single gene deletion. To determine which strains yielded increased lifespan, the researchers counted yeast cells, logging how many daughter cells a mother produced before it stopped dividing. \nThis process was carried out by attaching a small needle to a microscope, and then using it to tease out the daughter cells from the mother every time it divided, and counting how many times the mother cells divide. \nThese efforts yielded a wealth of information on the effects of genes and their pathways on aging. Of particular notice was the discovery that deleting a gene called LOS1 helps relocate transfer RNA (tRNA), which supply ribosomes with amino acids that are used to build proteins. The gene is influenced by mTOR, a genomic master switch long-associated with caloric restriction and increased lifespan. \nMoreover, LOS1 is also associated with Gcn4, a gene that helps govern DNA damage control. “Calorie restriction has been known to extend lifespan for a long time,” said Dr. Kennedy. “The DNA damage response is linked to aging as well. LOS1 may be connecting these different processes.” \nEven more intriguingly, the researchers also found that a number of these lifespan-extending genes and genomic pathways are preserved in many other, higher organisms – from roundworms to humans. \nApart from its fascinating results, Kennedy claims the study was also great for exposing emerging scientists to advanced lab techniques – many of the study participants were undergraduate students, who worked on dissecting the yeast cells a year at a time. \nExtensive as it was, this research project is only a small part of a greater effort to map the relationships between all the gene pathways that govern aging, illuminating this critical process in yeast, worms and mammals, with new therapeutic interventions being the ultimate goal. \n“Almost half of the genes we found that affect aging are conserved in mammals,” said Kennedy. “In theory, any of these factors could be therapeutic targets to extend health span. What we have to do now is figure out which ones are amenable to targeting.”", "external_links": [], "published": "2015-10-13T13:10:00.000+03:00", "crawled": "2015-10-13T13:35:42.682+03:00", "highlightTitle": ""}