{"organizations": [], "uuid": "aeae2bf25a07b518ca520d806d2b1a0d2a5762c1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1144378/ad-council-leading-digital-media-companies-corporate-and-non-profit-partners-and-socia", "country": "US", "title": "Ad Council, Leading Digital Media Companies, Corporate and Non-Profit Partners and Social Influencers Empower Teens with \"I Am A Witness\"", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "Ad Council, Leading Digital Media Companies, Corporate and Non-Profit Partners and Social Influencers Empower Teens with \"I Am A Witness\"", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T16:56:00.000+03:00", "replies_count": 0, "uuid": "aeae2bf25a07b518ca520d806d2b1a0d2a5762c1"}, "author": "admin", "url": "http://www.freshnews.com/news/1144378/ad-council-leading-digital-media-companies-corporate-and-non-profit-partners-and-socia", "ord_in_thread": 0, "title": "Ad Council, Leading Digital Media Companies, Corporate and Non-Profit Partners and Social Influencers Empower Teens with \"I Am A Witness\"", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Submitted by admin on 10/22/2015 @ 6:56 AM Companies mentioned in this article: Ad Council \nNEW YORK, Oct. 22, 2015 /PRNewswire/ -- In a groundbreaking effort to empower teens to speak up when they see bullying, the Ad Council and an unprecedented coalition of media, corporate and non-profit partners are launching I Am A Witness , a digital-focused campaign featuring a new eye emoji supported by the Unicode Standard, and is now available on iPhone running iOS 9.1. The emoji will also be featured in the I Am A Witness app, available on the App Store and on Google Play , which offers a downloadable keyboard developed pro bono by Snaps. The emoji, shaped like a speech bubble with an eye in the center, enables teens to take a stand against bullying and show support for someone who is being bullied. The campaign launch coincides with Bullying Prevention Month. \nExperience the interactive Multimedia News Release here: http://www.multivu.com/players/English/7658451-ad-council-anti-bullying-campaign/ \nThe I Am A Witness campaign was developed pro bono by Goodby Silverstein & Partners in collaboration with Adobe, Apple, Facebook, Google, YouTube, Johnson & Johnson and Twitter. Each partner will be providing significant exposure and customized content on their platforms. The campaign also includes activations on platforms including BuzzFeed, Instagram, Kik, Pandora, Snapchat, Tumblr, Vevo, We Heart It and Whisper. Additionally, non-profit partners have offered their expertise and resources, including The Bully Project, GLSEN, PACER's National Bullying Prevention Center and The Trevor Project. \nNinety percent of teens ages 12-17 who have witnessed some form of online cruelty say they have ignored mean behavior on social media, and more than a third (35 percent) have done this frequently.(1) Research has shown that the bystander can play a pivotal role in stopping bullying. The new campaign aims to activate the silent majority of kids who witness it each day, and empower them to use the new eye emoji and additional creative assets to speak up, be a friend and reject bullying. \n\"All teens are impacted by bullying and they often feel helpless when they witness it. Emojis have become a second language for teens, and they provide a relevant and easy way to get involved,\" said Lisa Sherman, President and CEO of the Ad Council. \"Through this extraordinary collaboration of media, non-profit, and corporate partners, along with influencers that teens look up to, we will transform witnesses from passive bystanders into a united, empowered and active collective that will speak up against bullying.\" \nPopular YouTube stars including the Fine Bros., Grace Helbig, Glozell Green, Megan Rienks, Joshua DTV, Ricky Dillon and celebrities Rachel Platten and Coy Stewart, along with anti-bullying activist Lizzie Velasquez, will generate awareness for the campaign and the emoji through a series of new videos and activations on their social platforms. Rachel Platten's new single, \"Stand By You,\" is featured in an online video and television PSA starring social influencers that will be distributed to stations nationwide today. The videos were produced pro bono by Andrew Vallentine. Production of several influencer videos was also made possible by Walmart. Top tier Snapchat creators are extending the campaign pro bono thanks to support from agency Delmondo. \nThe campaign directs audiences to IWitnessBullying.org , a new website built on Tumblr by ideas in digital, where users can find tips and resources on different ways they can take action to stop bullying. The site features step-by-step directions on accessing the I Am A Witness emoji and keyboard, and instructions on when and how to use it. The website also features a 'Send Kindness' section, a repository of campaign and user-generated, positive and uplifting images, GIFs and videos that visitors can send to anyone who's been bullied or needs support. \n\"Bullying is a cruel and devastating reality that has been made worse by technology,\" said Ann Lewnes, Senior Vice President and Chief Marketing Officer, Adobe. \"Adobe is proud to be working with the Ad Council and our peers in the tech industry on an initiative that will use technology to empower young people to speak up and put a stop to bullying.\" \nThe integrated campaign and the new emoji keyboard were tested with teens across the country. The vast majority said they were excited and likely to use the keyboard to take a stand against bullying . dscout donated their services to conduct the innovative research via teens' cell phones where they shared feedback and videos of their experiences with the campaign assets. \nThe campaign was also developed in consultation with experts in the bullying and youth space, including Dr. Catherine Bradshaw, Associate Director, Johns Hopkins Center for the Prevention of Youth Violence, Johns Hopkins University; Dr. Susan M. Swearer, Director of the Empowerment Initiative at the University of Nebraska - Lincoln and Chair of the Research Advisory Board for Lady Gaga's Born This Way Foundation; Lee Hirsch, The Bully Project; Sarah Piper-Goldberg, previously at Do Something; and Anne Collier, President of Net Family News Inc. and founder of a new social media helpline for schools, iCanHelpline.org. \nIn an effort to further awareness about the emoji, Goodby Silverstein & Partners also developed an interactive, animated video created by the Academy Award-winning Moonbot Studios and featuring music scored by famed composer Mark Mothersbaugh. The video tells the short story of a boy named Jack, who is bullied at school and online. Once the user intervenes and interacts with the video using the on-screen emoji, Jack's world is filled with more color, turning a sad day into a happy one. \n\"This just feels like the most important thing we could be working on right now,\" said Kate Baynham, Copywriter at Goodby Silverstein & Partners. \"It's incredible to work with a group of people who treat every aspect of this effort as a passion project. When the health and happiness of the children of our nation are on the line, it puts everything into sharp focus and makes us work harder.\" \nPer the Ad Council's model, the new creative assets will be distributed to media outlets nationwide and will be placed in donated time and space. Extreme Reach donated their services for the digital distribution. -- iHeartMedia will be supporting the campaign through the Discover section on Snapchat -- Screenvision and National CineMedia (NCM) will be running campaign creative on-screen and in-lobby in movie theaters nationwide in October and November. -- Kik will encourage teens to download the stickers through its rewards program Kik Points. -- Pandora is supporting the campaign with targeted media across mobile, tablet and web to reach a highly engaged teen audience. -- Snapchat has created two national geofilters for the campaign that are available nationwide. -- Whisper will support the campaign with a series of native-style ads on its main page. \nCarat will leverage this expertise to support the campaign through pro bono development and execution of a custom media strategy and communications plan to secure additional high profile targeted media. \nTo learn more about the campaign, visit IWitnessBullying.org , join the new social media communities on Twitter , Instagram , Tumblr and Snapchat (search 'I See Bullying'), and follow the hashtag #IAmAWitness . \n1 Pew Research Center's Internet & American Life Project in partnership with the Family Online Safety Institute and supported by Cable in the Classroom (2011)", "external_links": [], "published": "2015-10-22T16:56:00.000+03:00", "crawled": "2015-10-22T17:39:34.410+03:00", "highlightTitle": ""}