{"organizations": [], "uuid": "4324506a121c343b07113ccecf449a04f6713a90", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "phys.org", "main_image": "http://cdn.phys.org/tmpl/v5/img/phys_308px.png", "site_section": "http://www.physorg.com/rss-feed/", "section_title": "Phys.org - latest science and technology news stories", "url": "http://phys.org/news/2015-10-scholars-urge-future-colorado-river.html", "country": "US", "title": "Scholars urge more research on future of Colorado River", "performance_score": 0, "site": "phys.org", "participants_count": 0, "title_full": "Scholars urge more research on future of Colorado River", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T10:38:00.000+03:00", "replies_count": 0, "uuid": "4324506a121c343b07113ccecf449a04f6713a90"}, "author": "", "url": "http://phys.org/news/2015-10-scholars-urge-future-colorado-river.html", "ord_in_thread": 0, "title": "Scholars urge more research on future of Colorado River", "locations": ["Colorado River"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Scholars urge more research on future of Colorado River October 13, 2015 \nA coalition of scholars across the West is urging the federal government to partner with the National Academy of Sciences to study the future of the Colorado River, including if climate change is leading to reduced stream flow. \nTwenty-three scholars from Western universities sent a letter Tuesday to Interior Secretary Sally Jewell detailing their request for more scientific research on a host of issues related to the Colorado River. \nChief among the concerns is if there will be enough water in the river to support 36 million users in seven U.S. states and parts of Mexico over the next 50 years. \nThe scholars argue the federal government is relying on a projection of a 9-percent stream flow decline by 2060, while skimming over other estimates that suggest it could fall by as much as 45 percent by 2050 due to climate change . \nSecretary Jewell was expected to receive the letter early Wednesday. The Bureau of Reclamation this summer issued the results of a nearly three-year study that concluded that there will be significant shortfalls between water supply and demand on the Colorado River over the next 50 years. \nBut the scholars say in the letter that those conclusions \"may be insufficient to accommodate the full range of risks that lie ahead,\" the letter says. \nThe scholars who signed the letter include Robert Adler of the University of Utah law school; Victor Baker of the hydrology and water resources department at the University of Arizona; and Tim Barnett at the Scripps Institution of Oceanography in La Jolla, California. \nOwen Lammers, executive director of Living Rivers and Colorado Riverkeeper, said the federal government needs to pursue a wider breadth of scientific projections to ensure it is prepared for all water flow scenarios. His group supports the scholars' efforts. \n\"We're hoping for the best when we should be preparing for the worst,\" Lammers said. \"We are really putting society at risk without looking at some of these scenarios.\" Smaller Colorado River projected for coming decades, study says December 23, 2012 \n(Phys.org)—Some 40 million people depend on the Colorado River Basin for water but warmer weather from rising greenhouse gas levels and a growing population may signal water shortages ahead. In a new study in Nature Climate ... US urges conservation as Colorado River hit by drought May 28, 2013 \nAs a regional drought tightens its grip on the Colorado River, water agency officials, environmentalists, farmers and Indian tribal leaders from the seven states that depend on the river for survival are expected to gather ... Clearing up confusion on future of Colorado River flows June 25, 2013 \nThe Colorado River provides water for more than 30 million people, including those in the fast-growing cities of Las Vegas, Phoenix and Los Angeles. Increasing demand for that water combined with reduced flow and the looming ... Toxic spill from Colorado mine creeps through US southwest (Update) August 11, 2015 \nEnvironmental scientists tested a key US river Tuesday for signs of a toxic waste spill from a botched Colorado mine clean-up that prompted a state of emergency in the desert Southwest. Utah urges caution over toxic-spill river August 13, 2015 \nOutdoor enthusiasts in Utah were urged Wednesday to use caution along a river tainted by a toxic waste spill at an abandoned gold mine in Colorado a week ago. EPA says it will build temporary treatment plant for mine September 24, 2015 \nThe Environmental Protection Agency said Wednesday it will set up a temporary treatment plant for wastewater flowing from the Gold King Mine in southwestern Colorado after 3 million gallons surged out of the mine in August, ... Recommended for you Sea level rise will swallow Miami, New Orleans, study finds October 12, 2015 \nSay goodbye to Miami and New Orleans. No matter what we do to curb global warming, these and other beloved US cities will sink below rising seas, according to a study Monday. Global marine analysis suggests food chain collapse October 12, 2015 \nA world-first global analysis of marine responses to climbing human CO2 emissions has painted a grim picture of future fisheries and ocean ecosystems. Forecasters look higher for clues to winter weather October 12, 2015 \nLong-range winter weather forecasts could be twice as accurate by taking account of unusual winds miles up in the stratosphere, scientists have found. Scientists say vines strangle carbon storage in tropical forests October 12, 2015 \nAlthough useful to Tarzan, vines endanger tropical forests' capacity to store carbon. In a major experimental study in Panama, Smithsonian researchers showed that woody vines, or lianas, slow tropical forest tree growth and ... New study projects that melting of Antarctic ice shelves will intensify October 12, 2015 \nNew research published today projects a doubling of surface melting of Antarctic ice shelves by 2050 and that by 2100 melting may surpass intensities associated with ice shelf collapse, if greenhouse gas emissions from fossil ... More extreme weather projected in the Amazon could have global climate consequences October 12, 2015 \nA new paper co-authored by WHRC scientists Philip Duffy and Paulo Brando evaluates the accuracy of current climate models and uses them to project future drought and wet periods in the Amazon. They conclude that the whole ...", "external_links": [], "published": "2015-10-13T10:38:00.000+03:00", "crawled": "2015-10-13T10:48:54.201+03:00", "highlightTitle": ""}