{"organizations": ["Juli Clover Apple", "Financial Times", "Apple Acquires Speech Technology Startup VocalIQ", "General Motors", "Apple", "Mac Rumors Apple Acquires Speech Technology Startup", "Google"], "uuid": "ca31888ead2513e75dc7e3beac1bae89849c7bf4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.google.com", "main_image": "http://cdn.macrumors.com/article-new/2015/10/vocaliq-800x389.jpg?retina", "site_section": "http://news.google.com/news?hl=en&gl=us&q=technology&pws=0&bav=on.2,or.r_gc.r_pw.r_cp.r_qf.&bpcl=38093640&biw=1366&bih=653&um=1&ie=UTF-8&output=rss", "section_title": "technology - Google News", "url": "http://news.google.com/news/url?sa=t&fd=R&ct2=us&usg=AFQjCNGcO29ZbXXsqH6CNDEK2CTYcOyD9g&clid=c3a7d30bb8a4878e06b80cf16b898331&cid=52778962947356&ei=Cu0OVrjJGY3iaZ3ULQ&url=http://www.macrumors.com/2015/10/02/apple-acquires-speech-technology-startup-vocaliq/", "country": "IL", "title": "Apple Acquires Speech Technology Startup VocalIQ - Mac Rumors", "performance_score": 0, "site": "google.com", "participants_count": 0, "title_full": "Apple Acquires Speech Technology Startup VocalIQ - Mac Rumors", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T21:42:00.000+03:00", "replies_count": 0, "uuid": "ca31888ead2513e75dc7e3beac1bae89849c7bf4"}, "author": "", "url": "http://news.google.com/news/url?sa=t&fd=R&ct2=us&usg=AFQjCNGcO29ZbXXsqH6CNDEK2CTYcOyD9g&clid=c3a7d30bb8a4878e06b80cf16b898331&cid=52778962947356&ei=Cu0OVrjJGY3iaZ3ULQ&url=http://www.macrumors.com/2015/10/02/apple-acquires-speech-technology-startup-vocaliq/", "ord_in_thread": 0, "title": "Apple Acquires Speech Technology Startup VocalIQ - Mac Rumors", "locations": ["United Kingdom"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Siri"], "text": "Apple Acquires Speech Technology Startup VocalIQ Friday October 2, 2015 11:37 am PDT by Juli Clover Apple has purchased VocalIQ , a startup located in the United Kingdom that has developed a natural language API to allow computers and people to have a more natural dialogue, reports Financial Times . According to VocalIQ's website, the company has developed a self-learning dialogue API built on 10 years of natural language research, belief tracking, decision making, and message generation. It's not always clear how Apple uses the technology from companies that it purchases, but with this acquisition, it's likely Apple will use the API to improve its voice-based personal assistant, Siri. Financial Times also believes Apple could use the technology for its upcoming car project, as VocalIQ specialized in in-car applications among other things. While VocalIQ's speech processing and machine learning technology could be incorporated into devices from wearables to the connected home, the company was particularly focused on in-car applications. This included a collaboration with General Motors. In a blog earlier this year , VocalIQ described how a \"conversational voice-dialog system\" in a car's navigation system could prevent drivers from becoming distracted by looking at screens. Its \"self- learning\" technology allows \"real conversation between human and the internet of things\", VocalIQ wrote. VocalIQ has criticized Siri in a past blog post , calling the virtual assistant a \"toy\" unable to understand context. The difference between VocalIQ's system and traditional speech-recognition services like Siri and Cortana is its ability to learn. The reason for this state of affairs is that while Apple, Google and the some others have mastered how the use machine learning for speech-recognition, they are still stuck with medieval approach when it comes of conversational voice dialog. They are still using pre-programmed flow-chart based response that don't learn. The consumer demand for a self-learning multi-domain conversational voice system where consumers can freely talk about movies, restaurants, music, hotel bookings and the meaning of life, is huge and undeniable. The first one to meet that demand will rule the smartphone and wearables market for the next decade. Apple confirmed its purchase of VocalIQ with its usual statement: \"Apple buys smaller technology companies from time to time, and we generally do not discuss our purpose or plans.\"", "external_links": [], "published": "2015-10-02T21:42:00.000+03:00", "crawled": "2015-10-02T23:47:30.974+03:00", "highlightTitle": ""}