{"organizations": [], "uuid": "46e328847f4d65e6b8f0b98aeea8e4bb9bdcce5f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pr.com", "main_image": "", "site_section": "http://www.pr.com/news-by-category/189", "section_title": "Technology: Software Press Releases and News - PR.com", "url": "http://www.pr.com/press-release/642121", "country": "US", "title": "CIOReview Selects CMMS Data Group for 20 Most Promising EAM Solution Providers 2015", "performance_score": 0, "site": "pr.com", "participants_count": 1, "title_full": "CIOReview Selects CMMS Data Group for 20 Most Promising EAM Solution Providers 2015 - PR.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T03:00:00.000+03:00", "replies_count": 0, "uuid": "46e328847f4d65e6b8f0b98aeea8e4bb9bdcce5f"}, "author": "PR.com", "url": "http://www.pr.com/press-release/642121", "ord_in_thread": 0, "title": "CIOReview Selects CMMS Data Group for 20 Most Promising EAM Solution Providers 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CIOReview Selects CMMS Data Group for 20 Most Promising EAM Solution Providers 2015\nAnnual list showcases the 20 Most Promising EAM Solution Providers 2015. CMMS Data Group makes it to CIOReviews top EAM Solution Providers list for its expertise in delivering software and services, providing time- and money-saving solutions to maintenance and facilities professionals.\nFreemont, CA, October 17, 2015 --( PR.com )-- CIOReview (www.cioreview.com) has chosen CMMS Data Group (www.cmmsdatagroup.com) for its 20 Most Promising EAM Solution Providers 2015. The positioning is based on the evaluation of CMMS Data Group’s software and services, providing time- and money-saving solutions to maintenance and facility professionals to increase reliability, productivity, profitability, and customer satisfaction.\nThe annual list of companies is selected by a panel of experts and members of CIOReview’s editorial board to recognize and promote technology entrepreneurship. “CMMS Data Group has been on our radar for some time for stirring a revolution in the EAM space, and we are happy to showcase them this year due to their continuing excellence in delivering top-notch solutions,” said Jeevan George, Managing Editor, CIOReview. “CMMS Data Group’s solutions continued to break new ground within the past year, benefiting its customers around the globe, and we’re excited to have them featured on our top companies list.”\n“CMMS Data Group is honored to be recognized by CIOReview’s panel of experts and thought leaders,” said Ruth Hughes, Founder and President, CMMS Data Group.\nAbout CMMS Data Group\nThe company CMMS Data Group was founded to help Computerized Maintenance Management System (CMMS) users regardless of what CMMS they were using. The company marked its beginning in the year 2000 and has been offering CMMS software and services, providing time- and money-saving solutions to maintenance and facility professionals to increase reliability, productivity, profitability, and customer satisfaction. The firm’s flagship offering is the MVP Capture, a paperless and (online / offline) wireless barcode solution (mobile CMMS) for parts and work order tracking.\nAbout CIOReview\nCIOReview constantly endeavors to identify “The Best” in a variety of areas important to tech business. Through nominations and consultations with industry leaders, our editors choose the best in different domains. The EAM Special Edition is an annual listing of 20 Most Promising EAM Solution Providers in the U.S.", "external_links": [], "published": "2015-10-17T03:00:00.000+03:00", "crawled": "2015-10-22T20:55:46.079+03:00", "highlightTitle": ""}