{"organizations": [], "uuid": "c3e46498b7aa08a0383301621fe11badee7cd5e1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266385/technology-general", "section_title": "Technology Press Releases from PRWeb - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30324966/g-data-releases-h1-malware-report-for-the-first-half-of-2015", "country": "US", "title": "G DATA Releases H1 Malware Report for the First Half of 2015", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "G DATA Releases H1 Malware Report for the First Half of 2015 - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T17:11:00.000+03:00", "replies_count": 0, "uuid": "c3e46498b7aa08a0383301621fe11badee7cd5e1"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30324966/g-data-releases-h1-malware-report-for-the-first-half-of-2015", "ord_in_thread": 0, "title": "G DATA Releases H1 Malware Report for the First Half of 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Security Researchers Discover 12 New Malware Strains per Minute with the U.S., China and France Hosting the Most Malicious and Fraudulent Websites\nAtlanta, GA\nToday, global security firm, G DATA, is releasing their H1 2015 Malware Report , which looks at malware over the first half of 2015. Among the findings, researchers discovered a 64.8 percent spike of new malware strains as compared to the first half of 2014. This averages out to 12 new strains per minute. In all, the total number of malware strains this year is expected to be well above the level of 2014, with the U.S., China and France hosting the most malicious and fraudulent websites.\nIn looking more closely at the financial services industry, researchers found that several of the major banks were frequently targeted by banking Trojans, and the Swatbanker family was the mostly frequently seen banking Trojan in the 6 month period, followed by the ZeuS family.\n“About three-quarters of Internet users are conducting their financial transactions online, and cybercriminals have recognized this huge opportunity for malicious attacks,” said Andy Hayter, security evangelist for G DATA. “Not surprisingly, because of this, we’re seeing a significant increase in attacks from banking Trojans for the first time since 2012.”\nAdditionally, G DATA experts reported that for the first time, websites related to the healthcare industry were most frequently classified as malicious (26.6 percent), with technology and telecom a distant second. The most commonly seen malware campaign was “Money Rain,” promising various ways to easily acquire money. While this campaign was seen on websites for all of the categories researched, 37 percent of the websites that were clearly connected to Money Rain were in the healthcare industry. Also of note, a new category, personal ads and dating, was revealed to be in the top 10 list of most prevalent malicious and fraudulent websites.\nAdditional Key Findings Include:\n The \"Top 10\" list of prevented malware attacks is dominated by adware and Potentially Unwanted Programs (PUP).\n Ukraine is new to the Top 10 list of countries most frequently found to be hosting malicious websites with 5% of the activity, putting the country in fourth place. This could potentially be due to the political havoc occurring in this region.\n Exploits for vulnerabilities are now being integrated into exploit kits after just a few days. Users who do not keep their systems up-to-date will easily fall victim to cyber criminals.\nThe G DATA Malware Report for the first half of 2015 is available online: https://public.gdatasoftware.com/Presse/Publikationen/Malware_Reports/G_DATA_PCMWR_H1_2015_EN.pdf\nAbout G DATA\nIT security was invented in Germany: G DATA Software AG is the antivirus pioneer. It was more than 28 years ago that the company, founded in Bochum in 1985, developed the first program to combat computer viruses. These days, G DATA is one of the world's leading providers of IT security solutions.\nTest results prove that IT security \"Made in Germany\" offers Internet users the best possible protection. Stiftung Warentest has been testing Internet security products since 2005. In all seven tests performed between 2005 and 2014, G DATA achieved the best virus detection rate. In comparative tests by AV-TEST, G DATA regularly demonstrates the best results in the detection of computer malware. Internationally, G DATA INTERNET SECURITY has also been awarded best Internet security package by independent consumer magazines – in countries such as Australia, Austria, Belgium, France, Italy, the Netherlands, Spain and the USA.\nThe product range comprises security solutions for end customers as well as medium to large-sized enterprises. G DATA security solutions are available in more than 90 countries worldwide.\nFor more information about the company and G DATA security solutions, see http://www.gdata-software.com .\nU.S. Media Contact:\nJulia McGavran\nMerritt Group\n703.390.1512\ngdata@merrittgrp.com\n //www.prweb.com/releases/2015/10/prweb13037395.htm\n ", "external_links": ["http://www.prweb.com/releases/2015/10/prweb13037395.htm", "https://public.gdatasoftware.com/Presse/Publikationen/Malware_Reports/G_DATA_PCMWR_H1_2015_EN.pdf"], "published": "2015-10-22T17:11:00.000+03:00", "crawled": "2015-10-24T07:41:00.975+03:00", "highlightTitle": ""}