{"organizations": [], "uuid": "cbbfaa203757dd3f9cfa38ff00f07e58babe2537", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "science-technology.news-articles.net", "main_image": "", "site_section": "http://science-technology.news-articles.net/content/rss.php", "section_title": "Science and Technology @ News Articles Network", "url": "http://science-technology.news-articles.net/content/corelogic-reports-completed-foreclosures-august.xhtml", "country": "US", "title": "CoreLogic Reports 36,000 Completed Foreclosures in August 2015", "performance_score": 0, "site": "news-articles.net", "participants_count": 0, "title_full": "CoreLogic Reports 36,000 Completed Foreclosures in August 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T15:52:00.000+03:00", "replies_count": 0, "uuid": "cbbfaa203757dd3f9cfa38ff00f07e58babe2537"}, "author": "", "url": "http://science-technology.news-articles.net/content/corelogic-reports-completed-foreclosures-august.xhtml", "ord_in_thread": 0, "title": "CoreLogic Reports 36,000 Completed Foreclosures in August 2015", "locations": ["Calif.", "IRVINE"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CoreLogic Reports 36,000 Completed Foreclosures in August 2015   CoreLogic Reports 36,000 Completed Foreclosures in August 2015 -- IRVINE, Calif., Oct.   <- stripped tags -> Judicial Foreclosure States (Ranked by Completed Foreclosures) \n[[UEdFZ2NtVnNQVndpYm05bWIyeHNiM2RjSWlCb2NtVm1QVndpWENJZ2IyNWpiR2xqYXowbmNHOXpkRlJ2Um1WbFpDaGNJbWgwZEhBNkx5OTNkM2N1YlhWc2RHbDJkUzVqYjIwdmNHeGhlV1Z5Y3k5RmJtZHNhWE5vTHpjeE1qZ3dOVFE0TFdOdmNtVnNiMmRwWXkxaGRXZDFjM1F0Wm05eVpXTnNiM04xY21WekwyZGhiR3hsY25rdmFXMWhaMlV2WVRKak9UWmlNbVF0TnpFd09DMDBNVFEwTFRsa1pUSXRZelpqTW1FM1lUVTVOalF3TGtoU0xtcHdaMXdpS1RzZ2NtVjBkWEp1SUdaaGJITmxPeWMrUEdsdFp5QnpjbU05WENKb2RIUndjem92TDJGemMyVjBjekl1Y0hKdVpYZHpkMmx5WlM1amIyMHZaR1Z6YVdkdWFXMWhaMlZ6TDJaaVgzTm9ZWEpsTG5CdVoxd2lJQzgrUEM5aFBnPT18]] Non-Judicial Foreclosure States (Ranked by Completed Foreclosures) \n[[UEdFZ2NtVnNQVndpYm05bWIyeHNiM2RjSWlCb2NtVm1QVndpWENJZ2IyNWpiR2xqYXowbmNHOXpkRlJ2Um1WbFpDaGNJbWgwZEhBNkx5OTNkM2N1YlhWc2RHbDJkUzVqYjIwdmNHeGhlV1Z5Y3k5RmJtZHNhWE5vTHpjeE1qZ3dOVFE0TFdOdmNtVnNiMmRwWXkxaGRXZDFjM1F0Wm05eVpXTnNiM04xY21WekwyZGhiR3hsY25rdmFXMWhaMlV2TlRnMll6SmpZekV0TkRZeU1pMDBNV1UxTFRrMk5ETXRNVGd3T0RrNE5UVmpabVEyTGtoU0xtcHdaMXdpS1RzZ2NtVjBkWEp1SUdaaGJITmxPeWMrUEdsdFp5QnpjbU05WENKb2RIUndjem92TDJGemMyVjBjekl1Y0hKdVpYZHpkMmx5WlM1amIyMHZaR1Z6YVdkdWFXMWhaMlZ6TDJaaVgzTm9ZWEpsTG5CdVoxd2lJQzgrUEM5aFBnPT18]] Foreclosure Data for the Largest Core Based Statistical Areas (CBSAs) (Ranked by Completed Foreclosures) \n[[UEdFZ2NtVnNQVndpYm05bWIyeHNiM2RjSWlCb2NtVm1QVndpWENJZ2IyNWpiR2xqYXowbmNHOXpkRlJ2Um1WbFpDaGNJbWgwZEhBNkx5OTNkM2N1YlhWc2RHbDJkUzVqYjIwdmNHeGhlV1Z5Y3k5RmJtZHNhWE5vTHpjeE1qZ3dOVFE0TFdOdmNtVnNiMmRwWXkxaGRXZDFjM1F0Wm05eVpXTnNiM04xY21WekwyZGhiR3hsY25rdmFXMWhaMlV2WldZNE5tUmpPV1l0TnpnNE1DMDBNR0poTFRneU5HRXRZV1ppT0RnNVpqSTVNelF3TGtoU0xtcHdaMXdpS1RzZ2NtVjBkWEp1SUdaaGJITmxPeWMrUEdsdFp5QnpjbU05WENKb2RIUndjem92TDJGemMyVjBjekl1Y0hKdVpYZHpkMmx5WlM1amIyMHZaR1Z6YVdkdWFXMWhaMlZ6TDJaaVgzTm9ZWEpsTG5CdVoxd2lJQzgrUEM5aFBnPT18]] Figure 1: Number of Mortgaged Homes per Completed Foreclosure \n[[UEdFZ2NtVnNQVndpYm05bWIyeHNiM2RjSWlCb2NtVm1QVndpWENJZ2IyNWpiR2xqYXowbmNHOXpkRlJ2Um1WbFpDaGNJbWgwZEhBNkx5OTNkM2N1YlhWc2RHbDJkUzVqYjIwdmNHeGhlV1Z5Y3k5RmJtZHNhWE5vTHpjeE1qZ3dOVFE0TFdOdmNtVnNiMmRwWXkxaGRXZDFjM1F0Wm05eVpXTnNiM04xY21WekwyZGhiR3hsY25rdmFXMWhaMlV2TnpCak56RmpOVGN0TkRjNU1pMDBZemd3TFdKak5qWXRZV0ppTXpRMk1EVmxNak0xTGtoU0xtcHdaMXdpS1RzZ2NtVjBkWEp1SUdaaGJITmxPeWMrUEdsdFp5QnpjbU05WENKb2RIUndjem92TDJGemMyVjBjekl1Y0hKdVpYZHpkMmx5WlM1amIyMHZaR1Z6YVdkdWFXMWhaMlZ6TDJaaVgzTm9ZWEpsTG5CdVoxd2lJQzgrUEM5aFBnPT18]] Figure 2: Foreclosure Inventory as of August 2015 \n[[UEdFZ2NtVnNQVndpYm05bWIyeHNiM2RjSWlCb2NtVm1QVndpWENJZ2IyNWpiR2xqYXowbmNHOXpkRlJ2Um1WbFpDaGNJbWgwZEhBNkx5OTNkM2N1YlhWc2RHbDJkUzVqYjIwdmNHeGhlV1Z5Y3k5RmJtZHNhWE5vTHpjeE1qZ3dOVFE0TFdOdmNtVnNiMmRwWXkxaGRXZDFjM1F0Wm05eVpXTnNiM04xY21WelhDSXBPeUJ5WlhSMWNtNGdabUZzYzJVN0p6NDhhVzFuSUhOeVl6MWNJbWgwZEhCek9pOHZZWE56WlhSek1pNXdjbTVsZDNOM2FYSmxMbU52YlM5a1pYTnBaMjVwYldGblpYTXZabUpmYzJoaGNtVXVjRzVuWENJZ0x6NDhMMkUrfA==]] <- stripped tags -> <-  <-   IRVINE, Calif. , Oct.   CoreLogic ® (NYSE: [[UEdFZ2NtVnNQVndpYm05bWIyeHNiM2RjSWlCb2NtVm1QU2RvZEhSd09pOHZjM1IxWkdsdkxUVXVabWx1WVc1amFXRnNZMjl1ZEdWdWRDNWpiMjB2Y0hKdVpYZHpQMUJoWjJVOVVYVnZkR1VtVkdsamEyVnlQVU5NUjFnbklISmxiRDBuYm05bWIyeHNiM2NuSUhSaGNtZGxkRDBuWDJKc1lXNXJKeUIwYVhSc1pUMG5RMHhIV0NjZ2IyNWpiR2xqYXowbmJHbHVhMDl1UTJ4cFkyc29kR2hwY3lrbklISmxiRDBuYm05bWIyeHNiM2NuUGtOTVIxZzhMMkUrfA==]]), a leading global property information, analytics and data-enabled services provider, today released its [[UEdFZ2NtVnNQVndpYm05bWIyeHNiM2RjSWlCdmJtTnNhV05yUFNkc2FXNXJUMjVEYkdsamF5aDBhR2x6S1NjZ2FISmxaajFjSW1oMGRIQTZMeTkzZDNjdVkyOXlaV3h2WjJsakxtTnZiUzloWW05MWRDMTFjeTl5WlhObFlYSmphSFJ5Wlc1a2N5OXVZWFJwYjI1aGJDMW1iM0psWTJ4dmMzVnlaUzF5WlhCdmNuUXVZWE53ZUQ5WFZDNXRZMTlwWkQxd2NtNTNYekUxTVRBeE0xOXVRVVZDVUZ3aUlISmxiRDFjSW01dlptOXNiRzkzWENJZ2RHRnlaMlYwUFZ3aVgySnNZVzVyWENJK1FYVm5kWE4wSURJd01UVWdUbUYwYVc5dVlXd2dSbTl5WldOc2IzTjFjbVVnVW1Wd2IzSjBQQzloUGc9PXw=]] which shows the foreclosure inventory declined by 25.2 percent and completed foreclosures declined by 20.1 percent compared with August 2014 . The number of foreclosures nationwide decreased year over year from 46,000 in August 2014 to 36,000 in August 2015 , representing a decrease of 68.9 percent from the peak of 117,357 completed foreclosures in September 2010 . Experience the interactive Multimedia News Release here: [[UEdFZ2NtVnNQVndpYm05bWIyeHNiM2RjSWlCdmJtTnNhV05yUFNkc2FXNXJUMjVEYkdsamF5aDBhR2x6S1NjZ2FISmxaajFjSW1oMGRIQTZMeTkzZDNjdWJYVnNkR2wyZFM1amIyMHZjR3hoZVdWeWN5OUZibWRzYVhOb0x6Y3hNamd3TlRRNExXTnZjbVZzYjJkcFl5MWhkV2QxYzNRdFptOXlaV05zYjNOMWNtVnpMMXdpSUhKbGJEMWNJbTV2Wm05c2JHOTNYQ0lnZEdGeVoyVjBQVndpWDJKc1lXNXJYQ0krYUhSMGNEb3ZMM2QzZHk1dGRXeDBhWFoxTG1OdmJTOXdiR0Y1WlhKekwwVnVaMnhwYzJndk56RXlPREExTkRndFkyOXlaV3h2WjJsakxXRjFaM1Z6ZEMxbWIzSmxZMnh2YzNWeVpYTXZQQzloUGc9PXw=]] Completed foreclosures reflect the total number of homes lost to foreclosure. Since the financial crisis began in September 2008 , there have been approximately 5.9 million completed foreclosures across the country, and since homeownership rates peaked in the second quarter of 2004, there have been nearly 8 million homes lost to foreclosure. As of August 2015 , the national foreclosure inventory included approximately 470,000, or 1.2 percent, of all homes with a mortgage compared with 629,000 homes, or 1.6 percent, in August 2014 . CoreLogic also reports that the number of mortgages in serious delinquency (defined as 90 days or more past due, including those loans in foreclosure or REO) declined by 20.7 percent from August 2014 to August 2015 with 1.3 million mortgages, or 3.5 percent, in this category. This is the lowest serious delinquency rate since January 2008 . The foreclosure rate (defined as the share of all loans in the foreclosure process) was at 1.2 percent as of August 2015 , which is back to January 2008 levels. \"Mortgage performance continues to improve, however there is a dichotomy between the performance of recently originated loans and legacy loans. Newly delinquent loans are at the lowest rates during the last two decades. That reflects the tight underwriting and improved economy during the last few years,\" said Frank Nothaft , chief economist for CoreLogic. \"However, the foreclosure pipeline of legacy loans remains elevated. Over the last 12 months, there have been 500,000 completed foreclosures, more than double the number during normal periods.\" \"In August, the housing market experienced solid and steady increases in sales, prices and performance and our preview data indicates those trends will continue in September,\" said Anand Nallathambi , president and CEO of CoreLogic. \"Longer term, the recent increase in household formations and rapidly improving labor market for millennials will provide a demographic tailwind to the housing market and keep demand firm.\" Additional highlights as of August 2015 : On a month-over-month basis, completed foreclosures increased minimally, by less than 1 percent, from the 36,000 (rounded) reported in [[UEdFZ2NtVnNQVndpYm05bWIyeHNiM2RjSWlCdmJtTnNhV05yUFNkc2FXNXJUMjVEYkdsamF5aDBhR2x6S1NjZ2FISmxaajFjSW1oMGRIQTZMeTkzZDNjdVkyOXlaV3h2WjJsakxtTnZiUzloWW05MWRDMTFjeTl1WlhkekwyTnZjbVZzYjJkcFl5MXlaWEJ2Y25SekxUTTRMREF3TUMxamIyMXdiR1YwWldRdFptOXlaV05zYjNOMWNtVnpMV2x1TFdwMWJIa3RNakF4TlM1aGMzQjRQMWRVTG0xalgybGtQWEJ5Ym5kZk1UVXhNREV6WDI1QlJVSlFYQ0lnY21Wc1BWd2libTltYjJ4c2IzZGNJaUIwWVhKblpYUTlYQ0pmWW14aGJtdGNJajVLZFd4NUlESXdNVFU4TDJFK3w=]].* As a basis of comparison, before the decline in the housing market in 2007, completed foreclosures averaged 21,000 per month nationwide between 2000 and 2006. The five states with the highest number of completed foreclosures for the 12 months ending in August 2015 were: Florida (94,000), Michigan (47,000), Texas (32,000), California (27,000) and Georgia (26,000). These five states accounted for almost half of all completed foreclosures nationally. Four states and the District of Columbia had the lowest number of completed foreclosures for the 12 months ending in August 2015 : South Dakota (45), the District of Columbia (116), North Dakota (319), Wyoming (492) and West Virginia (544). Four states and the District of Columbia had the highest foreclosure inventory rate as a percentage of all mortgaged homes for the 12 months ending in August 2015 : New Jersey (4.6 percent), New York (3.7 percent), Florida (2.6 percent), Hawaii (2.5 percent) and the District of Columbia (2.4 percent). The five states with the lowest foreclosure inventory rate as a percentage of all mortgaged homes for the 12 months ending in August 2015 were: Alaska (0.3 percent), Minnesota (0.4 percent), Arizona (0.4 percent), Colorado (0.4 percent) and Nebraska (0.4 percent). * July 2015 data was revised. Revisions are standard, and to ensure accuracy CoreLogic incorporates newly released data to provide updated results. For ongoing housing trends and data, visit the CoreLogic Insights Blog: http://www.corelogic.com/blog . Methodology The data in this report represents foreclosure activity reported through August 2015 . This report separates state data into judicial versus non-judicial foreclosure state categories. In judicial foreclosure states, lenders must provide evidence to the courts of delinquency in order to move a borrower into foreclosure. In non-judicial foreclosure states, lenders can issue notices of default directly to the borrower without court intervention. This is an important distinction since judicial states, as a rule, have longer foreclosure timelines, thus affecting foreclosure statistics. A completed foreclosure occurs when a property is auctioned and results in the purchase of the home at auction by either a third party, such as an investor, or by the lender. If the home is purchased by the lender, it is moved into the lender's real estate-owned (REO) inventory. In \"foreclosure by advertisement\" states, a redemption period begins after the auction and runs for a statutory period, e.g., six months. During that period, the borrower may regain the foreclosed home by paying all amounts due as calculated under the statute. For purposes of this Foreclosure Report, because so few homes are actually redeemed following an auction, it is assumed that the foreclosure process ends in \"foreclosure by advertisement\" states at the completion of the auction. The foreclosure inventory represents the number and share of mortgaged homes that have been placed into the process of foreclosure by the mortgage servicer. Mortgage servicers start the foreclosure process when the mortgage reaches a specific level of serious delinquency as dictated by the investor for the mortgage loan. Once a foreclosure is \"started,\" and absent the borrower paying all amounts necessary to halt the foreclosure, the home remains in foreclosure until the completed foreclosure results in the sale to a third party at auction or the home enters the lender's REO inventory. The data in this report accounts for only first liens against a property and does not include secondary liens. The foreclosure inventory is measured only against homes that have an outstanding mortgage. Generally, homes with no mortgage liens are not subject to foreclosure and are, therefore, excluded from the analysis. Approximately one-third of homes nationally are owned outright and do not have a mortgage. CoreLogic has approximately 85 percent coverage of U.S. foreclosure data. Source: CoreLogic The data provided is for use only by the primary recipient or the primary recipient's publication or broadcast. This data may not be re-sold, republished or licensed to any other source, including publications and sources owned by the primary recipient's parent company without prior written permission from CoreLogic. Any CoreLogic data used for publication or broadcast, in whole or in part, must be sourced as coming from CoreLogic, a data and analytics company. For use with broadcast or web content, the citation must directly accompany first reference of the data. If the data is illustrated with maps, charts, graphs or other visual elements, the CoreLogic logo must be included on screen or website. For questions, analysis or interpretation of the data, contact Lori Guyton at lguyton@cvic.com or Bill Campbell at bill@campbelllewis.com . Data provided may not be modified without the prior written permission of CoreLogic. Do not use the data in any unlawful manner. This data is compiled from public records, contributory databases and proprietary analytics, and its accuracy is dependent upon these sources. About CoreLogic CoreLogic (NYSE: CLGX ) is a leading global property information, analytics and data-enabled services provider. The company's combined data from public, contributory and proprietary sources includes over 4.5 billion records spanning more than 50 years, providing detailed coverage of property, mortgages and other encumbrances, consumer credit, tenancy, location, hazard risk and related performance information. The markets CoreLogic serves include real estate and mortgage finance, insurance, capital markets, and the public sector. CoreLogic delivers value to clients through unique data, analytics, workflow technology, advisory and managed services. Clients rely on CoreLogic to help identify and manage growth opportunities, improve performance and mitigate risk. Headquartered in Irvine, Calif. , CoreLogic operates in North America , Western Europe and Asia Pacific . For more information, please visit www.corelogic.com . CORELOGIC and the CoreLogic logo are trademarks of CoreLogic, Inc. and/or its subsidiaries.", "external_links": [], "published": "2015-10-13T15:52:00.000+03:00", "crawled": "2015-10-13T15:37:30.799+03:00", "highlightTitle": ""}