{"organizations": ["SanDisk", "Western Digital"], "uuid": "d264f42ac3b3f831a02197750bf1053ca96b3593", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "http://s4.reutersmedia.net/resources/r/?m=02&d=20151021&t=2&i=1088734296&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXNPEB9K1CW", "site_section": "http://uk.mobile.reuters.com/reuters/rss/TECHUK.xml", "section_title": "Reuters: Technology News", "url": "http://uk.reuters.com/article/2015/10/21/us-sandisk-m-a-western-digital-idUKKCN0SF1C520151021?feedType=RSS&feedName=technologyNews", "country": "US", "title": "Western Digital to buy SanDisk in $19 billion deal", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "Western Digital to buy SanDisk in $19 billion deal", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T00:44:00.000+03:00", "replies_count": 0, "uuid": "d264f42ac3b3f831a02197750bf1053ca96b3593"}, "author": "", "url": "http://uk.reuters.com/article/2015/10/21/us-sandisk-m-a-western-digital-idUKKCN0SF1C520151021?feedType=RSS&feedName=technologyNews", "ord_in_thread": 0, "title": "Western Digital to buy SanDisk in $19 billion deal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Abhirup Roy", "Devika Krishna Kumar"], "text": "Western Digital to buy SanDisk in $19 billion deal By Devika Krishna Kumar and Abhirup Roy \nHard-disk drive maker Western Digital Corp ( WDC.O ) agreed to buy SanDisk Corp ( SNDK.O ) in a $19 billion deal that will increase its ability to make flash memory storage chips used in smartphones and tablets. \nSanDisk shares hit a high of $78.50 on Wednesday, but closed nearly $10 below the offer price of $86.50 in cash and stock, a fact that analysts attributed to the deal's complexity. \nWestern Digital said the value of the transaction hinges on the closing of an investment in the company by Unisplendour Corp Ltd, a unit of China's state-backed Tsinghua Holdings Co Ltd [TSHUAA.UL]. \nUnisplendour said in September it would buy 15 percent of Western Digital for $3.78 billion, a deal that is likely to face regulatory scrutiny amid national security concerns. \nWestern Digital Chief Executive Steve Milligan said in an interview that the Sandisk acquisition will ultimately dilute Unisplendor's stake and that he was highly confident it would be approved by regulators. \n\"There's always a risk and you're not done until you're done, but we were careful and consulted with U.S. government experts,\" he said. \nWestern Digital's move to buy SanDisk is the latest in a flurry of deals in the U.S. semiconductor industry, which has been hit by a supply glut and cheaper products from China that have driven down memory chip prices. \nEarlier on Wednesday, semiconductor equipment maker Lam Research ( LRCX.O ) agreed to buy rival KLA-Tencor Corp ( KLAC.O ) in a deal valued at about $10.6 billion. \nResearch firm Gartner said in October that worldwide semiconductor sales are expected to fall for the first time in three years in 2015, due partly to increasingly saturated market for smartphones. \nWestern Digital, a major player in the traditional storage industry, needs access to SanDisk's NAND technology to better compete in the market for solid-state drives used in cloud computing, data centers, smartphones and laptops. \nWestern Digital said it had the support of SanDisk partner Toshiba Corp ( 6502.T ), which has some rights that could block a deal. \nSanDisk has an intellectual property sharing joint venture with the Japanese company and uses its foundries to make chips. \nToshiba spokeswoman Midori Hara said in an email that the deal would not have a negative impact on that joint venture. \nShares of Western Digital, which also suspended its share buyback program, were down 1.4 percent at $73.85. \nBank of America Merrill Lynch ( BAC.N ) and J.P. Morgan ( JPM.N ) were lead financial advisers while Credit Suisse and Rothschild also advised Western Digital. Cleary Gottlieb Steen & Hamilton LLP and Baker & McKenzie are legal advisers to Western Digital. \nGoldman Sachs is the financial adviser to SanDisk. Skadden, Arps, Slate, Meagher & Flom LLP is its legal adviser. \n(Reporting by Abhirup Roy Devika Krishna Kumar in Bengaluru and Liana B. Baker in New York; Editing by Anil D'Silva and Alan Crosby) A variety of SanDisk memory cards are seen with a Western Digital hard drive box in Golden, Colorado in this photo illustration October 21, 2015. Hard-disk drive maker Western Digital Corp agreed to buy SanDisk Corp in a $19 billion deal that will greatly increase its... Reuters/Rick Wilking TPX IMAGES OF THE DAY left 1 of 2 right A variety of SanDisk memory cards are seen with a Western Digital hard drive box in Golden, Colorado in this photo illustration October 21, 2015. Hard-disk drive maker Western Digital Corp agreed to buy SanDisk Corp in a $19 billion deal that will greatly increase its... Reuters/Rick Wilking", "external_links": [], "published": "2015-10-22T00:44:00.000+03:00", "crawled": "2015-10-22T15:50:25.680+03:00", "highlightTitle": ""}