{"organizations": [], "uuid": "a655fb5630a4b9c642e0271e1fd44fc9955e6968", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.businesswire.com", "main_image": "", "site_section": "http://feed.businesswire.com/rss/home/?rss=G1QFDERJXkJeGVpSWw==", "section_title": "Business Wire Technology: Consumer Electronics News", "url": "http://www.businesswire.com/news/home/20151013005692/en/Apple-Updates-iMac-Family-Stunning-Retina-Displays", "country": "US", "title": "Apple Updates iMac Family with Stunning New Retina Displays", "performance_score": 0, "site": "businesswire.com", "participants_count": 0, "title_full": "Apple Updates iMac Family with Stunning New Retina Displays", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T15:30:00.000+03:00", "replies_count": 0, "uuid": "a655fb5630a4b9c642e0271e1fd44fc9955e6968"}, "author": "", "url": "http://www.businesswire.com/news/home/20151013005692/en/Apple-Updates-iMac-Family-Stunning-Retina-Displays", "ord_in_thread": 0, "title": "Apple Updates iMac Family with Stunning New Retina Displays", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Apple Updates iMac Family with Stunning New Retina Displays \nNew Wireless Accessories Bring Force Touch to the Desktop October 13, 2015 08:30 AM Eastern Daylight Time \nCUPERTINO, Calif.--( BUSINESS WIRE )--Apple® today updated the entire iMac® family, bringing a stunning new Retina® 4K display to the 21.5-inch iMac for the first time and the Retina 5K display to every 27-inch iMac. The new Retina displays make photos and videos more immersive and true-to-life thanks to a wider color gamut and spectacular image quality. The updated iMacs also feature more powerful processors and graphics, two Thunderbolt® 2 ports and new storage options that make the high-performance Fusion Drive even more affordable. \nApple today also introduced a new lineup of wireless accessories including the all-new Magic Keyboard™, Magic Mouse® 2 and Magic Trackpad® 2. The Magic devices have been redesigned to feel more comfortable than ever, and feature rechargeable batteries that completely eliminate the need for disposable batteries. The new Magic Trackpad 2 also brings Apple’s revolutionary Force Touch interface to the desktop, adding a new dimension to the iMac experience. \n“From the first iMac to today, the spirit of iMac has never wavered — deliver the ultimate desktop experience with the latest technologies, gorgeous displays and cutting-edge designs,” said Philip Schiller, Apple’s senior vice president of Worldwide Marketing. “These are the most stunning iMacs we’ve ever made. With our gorgeous new Retina displays, more powerful processors and graphics and all-new Magic accessories, the new iMac continues to redefine the ultimate desktop experience.” \nWith Retina display, text appears sharper than ever, videos are unbelievably lifelike and you can see new levels of detail in your photos. The 21.5-inch iMac is available with the all-new Retina 4K display featuring an amazing 4096 x 2304 resolution and 9.4 million pixels, 4.5 times more than the standard 21.5-inch iMac display. Every 27-inch iMac features a Retina 5K display, the world’s highest resolution all-in-one display with a stunning 14.7 million pixels, 7 times more pixels than an HD display. With a Retina display now on the 21.5-inch iMac and every 27-inch iMac, iMac with Retina display is more affordable than ever. \nThe new Retina displays feature a wider color gamut that brings more brilliant and true-to-life colors to your desktop. With standard sRGB-based displays, many of the colors you see in real life never make it to your screen. The new Retina 5K and 4K displays feature a wider P3-based color gamut that provides a 25 percent larger color space, and with more available colors, images are more vivid, reveal even greater detail and appear more lifelike than ever. \nFaster and more powerful than ever, the new 27-inch iMac with Retina 5K display now comes with sixth-generation Intel Core processors and the latest AMD high-performance graphics that deliver up to 3.7 teraflops of compute power. The new 21.5-inch iMac with Retina 4K display features a fifth-generation Intel Core processor and enhanced Intel Iris Pro Graphics. Two Thunderbolt 2 ports now come standard on all iMacs and deliver up to 20Gbps data transfer speeds for external drives and high-performance peripherals. And three stream 802.11ac Wi-Fi allows iMac to support up to 1.3Gbps wireless networking.* \nFusion Drive combines the large storage capacity of a hard drive with the high performance of flash to deliver shorter boot times and faster access to apps and files. Fusion Drive works in conjunction with OS X® to adapt to the way you use your iMac and automatically moves the files and apps you use most often to flash storage. The incredible performance of Fusion Drive is now more affordable with a new, lower-priced configuration that pairs a 1TB hard drive with 24GB of fast flash. Fusion Drive is also available with 2TB and 3TB configurations with 128GB of fast flash for more demanding workloads. For the ultimate in storage performance, optional all flash storage is available up to 1TB and is now up to 2.5 times faster.** \nThe all-new Magic Keyboard, Magic Mouse 2 and Magic Trackpad 2 are more comfortable, capable and environmentally friendly. Designed around a built-in rechargeable lithium-ion battery, all three accessories eliminate the need for disposable batteries and feature a noticeably more solid internal structure and quality feel. The new Magic Keyboard features a full-size keyboard in a sleek new design that takes up 13 percent less space on your desktop. With a new scissor mechanism and lower profile, the Magic Keyboard provides an incredibly stable, precise and comfortable typing experience. The new Magic Mouse 2 is lighter, sturdier and features an optimized foot design for a smoother glide. The new Magic Trackpad 2 features a 29 percent larger surface and brings Force Touch to the desktop for the first time. Force Touch enables a range of new ways to interact with your Mac®, including the new Force click to quickly look up a word, preview a file or bring up a map from an address. The new Magic devices pair instantly with your Mac as soon as they are plugged in via the Lightning®-to-USB charging cable, and can last about a month or more on a full charge.*** \nEvery new Mac comes with OS X El Capitan, the latest version of OS X that refines the Mac experience and improves system performance. El Capitan builds on the groundbreaking features and beautiful design of OS X Yosemite, with updates to window management, built-in apps and Spotlight® search, and performance improvements to make everyday activities — like launching and switching apps, opening PDFs and accessing email — faster and more responsive. El Capitan was specifically designed for the Retina display and features a new system font called San Francisco that has been fine-tuned for optimal readability on a Retina display. \niMovie®, GarageBand® and the suite of iWork® apps come free with every new iMac. iMovie, updated today to support 4K video, lets you easily create beautiful movies, and you can use GarageBand to make new music or learn to play piano or guitar. The iWork suite of Pages®, Numbers® and Keynote® makes it easy to create, edit and share stunning documents, spreadsheets and presentations. Pages, Numbers and Keynote for iCloud® let you create a document on iPhone® or iPad®, edit it on your Mac and collaborate with friends, even if they are on a PC. \nPricing & Availability \nThe 27-inch iMac with Retina 5K display is available today at Apple.com, Apple’s retail stores and select Apple Authorized Resellers. The 27-inch iMac comes in three models starting at $1,799 (US), $1,999 (US) and $2,299 (US). Additional technical specifications, configure-to-order options and accessories are available online at www.apple.com/imac . \nThe 21.5-inch iMac is available today at Apple.com, Apple’s retail stores and select Apple Authorized Resellers. The 21.5-inch iMac is available in three models starting at $1,099 (US) and $1,299 (US) and with a Retina 4K display starting at $1,499 (US). Additional technical specifications, configure-to-order options and accessories are available online at www.apple.com/imac . \nEvery new iMac comes standard with the new Magic Keyboard and Magic Mouse 2, and customers can order the new Magic Trackpad 2 as an option. The new Magic accessories are also available at Apple.com, Apple’s retail stores and select Apple Authorized Resellers. Magic Keyboard is available starting today for $99 (US). Magic Mouse 2 is available starting today for $79 (US). And the Magic Trackpad 2 is available starting today for $129 (US). \n*Actual speed will vary based on range, connection rate, site conditions, size of network and other factors. \n**Testing conducted by Apple in September 2015 using preproduction and shipping 27-inch iMac configurations. For more information visit www.apple.com/imac/features . \n***Testing conducted by Apple in September 2015 using preproduction Magic Keyboard, Magic Mouse 2 and Magic Trackpad 2 devices, firmware and software with shipping iMac systems. \nApple revolutionized personal technology with the introduction of the Macintosh in 1984. Today, Apple leads the world in innovation with iPhone, iPad, the Mac and Apple Watch. Apple’s three software platforms — iOS, OS X and watchOS — provide seamless experiences across all Apple devices and empower people with breakthrough services including the App Store, Apple Music, Apple Pay and iCloud. Apple’s 100,000 employees are dedicated to making the best products on earth, and to leaving the world better than we found it. \nNOTE TO EDITORS: For additional information visit Apple’s PR website ( www.apple.com/pr ), or call Apple’s Media Helpline at (408) 974-2042. \n© 2015 Apple Inc. All rights reserved. Apple, the Apple logo, iMac, Retina, Thunderbolt, Magic Keyboard, Magic Mouse, Magic Trackpad, OS X, Mac, Lightning, Spotlight, iMovie, GarageBand, iWork, Pages, Numbers, Keynote, iCloud, iPhone and iPad are trademarks of Apple. Other company and product names may be trademarks of their respective owners. Contacts", "external_links": [], "published": "2015-10-13T15:30:00.000+03:00", "crawled": "2015-10-13T15:50:16.680+03:00", "highlightTitle": ""}