{"organizations": ["Digital India", "Intel", "Intel India", "Intel Galileo"], "uuid": "39050c055e9eb4f454e2df6afac2071a60883704", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "cio.economictimes.indiatimes.com", "main_image": "http://economictimes.indiatimes.com/photo/Intel-to-set-up-100-Internet-of-Things-centres-in-India/49287264.cms", "site_section": "http://cio.economictimes.indiatimes.com/rss/internet-of-things", "section_title": "internet-of-things - Information Technology News | Latest IT Industry News, Information and Updates: ET CIO : ETCIO.com", "url": "http://cio.economictimes.indiatimes.com/news/internet-of-things/intel-to-set-up-100-internet-of-things-centres-in-india/49287264", "country": "IN", "title": "Intel to set up 100 Internet of Things centres in India", "performance_score": 0, "site": "indiatimes.com", "participants_count": 0, "title_full": "Intel to set up 100 Internet of Things centres in India", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T13:08:00.000+03:00", "replies_count": 0, "uuid": "39050c055e9eb4f454e2df6afac2071a60883704"}, "author": "", "url": "http://cio.economictimes.indiatimes.com/news/internet-of-things/intel-to-set-up-100-internet-of-things-centres-in-india/49287264", "ord_in_thread": 0, "title": "Intel to set up 100 Internet of Things centres in India", "locations": ["India"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kumud Srinivasan", "Modi", "Kumud"], "text": "#Intel Intel to set up 100 Internet of Things centres in India These centres are meant for students, educators and do-it-yourself electronic enthusiasts and will be supported by Intel Galileo boards to help build product prototypes. PTI | 09 October 2015, 3:38 PM IST Share NEW DELHI: Intel plans to set up 100 Internet of Things (IoT) centres as academic institutions across India. These centres are meant for students, educators and do-it-yourself electronic enthusiasts and will be supported by Intel Galileo boards to help build product prototypes.Intel also plans to award 'Intel India PhD fellowships' to five students for 2015. These announcements kick started the second Intel India Academic Forum 2015.As part of the Intel India PhD fellowship program 2015, the five selected PhD students will be awarded fellowships of upto Rs. 6,00,000 per annum, for a period of four years that includes student stipend, contingency research funds and travel expenses to attend conferences and research forums.The recipients of the fellowship will work at Intel to develop a deep understanding of the technological issues facing the industry and come up with breakthrough research in areas such as parallel computing, architecture, graphics, perceptual computing, sensing, power management, validation and communications.\"Innovation is in Intel's DNA. For over 15 years, Intel has been building an ecosystem in India, which enables innovation, research and skill development. Intel's India Academic Forum is a platform for fostering insights on technology trends and for triggering collaboration opportunities between academia, government and industry, thereby enabling impactful innovation and research,\" said Kumud Srinivasan, President, Intel India.Intel already has two Research and Development (R&D) centres and 70% of the employees in India are hired for R&D. Talking about Prime Minister Modi's smart cities and digital India plans, Kumud said, \"Collaboration and innovation are the keys for Digital India.\" Additionally, Intel aims to influence the curriculum to educate students as it collaborates with these institutions.", "external_links": [], "published": "2015-10-09T13:08:00.000+03:00", "crawled": "2015-10-10T03:22:10.454+03:00", "highlightTitle": ""}