{"organizations": [], "uuid": "4fc491650fc86acad3e8ecccffa4d7ce6a051393", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news24.com", "main_image": "http://cdn.24.co.za/files/Cms/General/d/2759/19f8660275844c1a93ec20a1025861ab.jpg", "site_section": "http://www.news24.com/", "section_title": "News24, South Africa's premier news source, provides breaking news on national, world, Africa, sport, entertainment, technology &amp; more. ", "url": "http://www.news24.com/SouthAfrica/News/FeesMustFall-My-debt-never-stops-growing-20151022", "country": "ZA", "title": "#FeesMustFall: My debt never stops growing", "performance_score": 0, "site": "news24.com", "participants_count": 1, "title_full": "#FeesMustFall: My debt never stops growing | News24", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T18:59:00.000+03:00", "replies_count": 0, "uuid": "4fc491650fc86acad3e8ecccffa4d7ce6a051393"}, "author": "news24.com", "url": "http://www.news24.com/SouthAfrica/News/FeesMustFall-My-debt-never-stops-growing-20151022", "ord_in_thread": 0, "title": "#FeesMustFall: My debt never stops growing", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Pretoria - “If I can’t graduate because of unpaid fees, how do I go out and get a job to pay my debt.”\nThis is the burden of final year University of Pretoria student Lulama Shongwe, 21, who remains in flux as her debt to the institution continues to mount.\nWhile she struggles with the compounding costs of printing, buying books and just living, she operates with an impending sense of dread, knowing how much she still needs to pay.\n“My mom had left her job in 2012 to start her own business and being a smart woman she had saved for my first two years of tuition. I was very lucky,” Shongwe said.\n“But the business didn’t really take off, we all know small businesses take time and now I sit indebted to the University. This is a debt that grows with an interest charged by the university every day. This year I have really struggled,” she said.\n“It is at the front of my mind that I am sitting with this debt that never stops growing and it worries me how this will affect my graduation next year. They could hold back my qualification and then I can’t get work to pay the debt and it becomes a catch 22 situation. Two days ago I got an SMS saying that my fees need to be paid otherwise I won’t see my results and it is pervasive,” Shongwe added.\nShe said that with the price of residence, which is upwards of R40 000, the little expenses begin to add up.\n“It is the small costs that just keep adding up, from printing to books. We just have to keep paying. My course is very reading intensive and it costs a lot of money if you need to print. Not everyone has a laptop so some are forced to print out the course work,” she said.\n“This is my story.”", "external_links": [], "published": "2015-10-22T18:59:00.000+03:00", "crawled": "2015-10-22T20:43:41.077+03:00", "highlightTitle": ""}