{"organizations": [], "uuid": "1aaf629442e37105897c08789ce5ec5143100869", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bio-medicine.org", "main_image": "", "site_section": "http://feeds.bio-medicine.org/latest-biology-technology", "section_title": "Latest Biology Technology from Bio-Medicine.Org", "url": "http://www.bio-medicine.org/biology-technology-1/CREATe-org-Launches--u201CCREATe-Leading-Practices-for-Trade-Secret-Protection-u201D---A-Service-to-Enable-Companies-to-Mitigate-Risks-from-Insiders---34407-1/", "country": "US", "title": "CREATe.org Launches “CREATe Leading Practices for Trade Secret Protection” - A Service to Enable Companies to Mitigate Risks from Insiders, Cyber Theft and Other Threats", "performance_score": 0, "site": "bio-medicine.org", "participants_count": 0, "title_full": "CREATe.org Launches “CREATe Leading Practices for Trade Secret Protection” - A Service to Enable Companies to Mitigate Risks from Insiders, Cyber Theft and Other Threats", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T13:49:00.000+03:00", "replies_count": 0, "uuid": "1aaf629442e37105897c08789ce5ec5143100869"}, "author": "", "url": "http://www.bio-medicine.org/biology-technology-1/CREATe-org-Launches--u201CCREATe-Leading-Practices-for-Trade-Secret-Protection-u201D---A-Service-to-Enable-Companies-to-Mitigate-Risks-from-Insiders---34407-1/", "ord_in_thread": 0, "title": "CREATe.org Launches “CREATe Leading Practices for Trade Secret Protection” - A Service to Enable Companies to Mitigate Risks from Insiders, Cyber Theft and Other Threats", "locations": ["Washington", "DC"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Pamela Passman"], "text": "Date:10/20/2015 Washington, DC (PRWEB) October 20, 2015 Companies concerned with the risks associated with the theft of trade secrets and other critical business information can now use CREATe Leading Practices for Trade Secret Protection , a three-step service designed to help companies benchmark and improve the business processes necessary to effectively protect company assets internally and among subsidiaries and third parties. Effective trade secret protection requires companies to think beyond technological solutions to address employee, contractor and third party behavior. The service – CREATe Leading Practices for Trade Secret Protection – features an initial online assessment measuring the maturity of existing systems in place to protect trade secrets. It poses questions relating to categories ranging from policies and procedures, security, risk assessments, third party management, training and dedicated employee resources to monitoring and corrective actions. The 90-minute assessment is followed by a discussion and independent evaluation by a CREATe.org expert. The final step is an improvement program including recommended actions to address top vulnerabilities. The new service complements two additional CREATe Leading Practices services – one addressing broader intellectual property protection; and the other focused on anti-corruption. The CREATe Leading Practices services are based on best practices from global companies, international guidelines, academics and other experts. The services take a ‘management systems’ approach and feature many of the same business process categories found in quality management, health and safety and other programs that companies have implemented over the years. “The rapid pace of innovation, digitization of corporate assets and today’s highly mobile workforce make protecting all forms of intellectual property a challenge,” stated Pamela Passman, President and CEO of CREATe.org. “In our work with global companies on IP protection, we identified a need to do a deeper dive on trade secret protection. This service, along with our eLearning course on Protection of Trade Secrets, offers companies a systematic way to ensure there are business processes in place to address not only security but also the human side of trade secret risks.” To learn more about CREATe Leading Practices and request a demo, email: info(at)CREATe(dot)org. About the Center for Responsible Enterprise And Trade (CREATe.org) The Center for Responsible Enterprise And Trade (CREATe.org) is a non-governmental organization dedicated to helping companies and their suppliers and business partners reduce counterfeiting, piracy, trade secret theft and corruption. To achieve our objectives, we have developed CREATe Leading Practices for IP Protection, CREATe Leading Practices for Trade Secret Protection, and CREATe Leading Practices for Anti-Corruption, services based on best practices drawn from companies around the world, academics, and other leading organizations. In addition to online assessments, CREATe offers practical, scalable and cost-effective independent evaluations, training and other resources designed to benchmark and improve practices for safeguarding IP, protecting trade secrets and preventing corruption. Companies around the world are using CREATe Leading Practices to measure and improve systems for IP protection and anti-corruption. The services are available in Chinese, English, Portuguese and Spanish. For more information, please email info(at)CREATe(dot)org or visit http://www.CREATe.org . \nRead the full story at http://www.prweb.com/releases/2015/10/prweb12993234.htm . '/>\"/>", "external_links": [], "published": "2015-10-20T13:49:00.000+03:00", "crawled": "2015-10-20T16:21:46.446+03:00", "highlightTitle": ""}