{"organizations": [], "uuid": "cb39051eb417ac943563ecb57090244b7b70a2db", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "phys.org", "main_image": "http://cdn.phys.org/tmpl/v5/img/phys_308px.png", "site_section": "http://www.physorg.com/rss/rssbycategory.php?categ=16", "section_title": "Phys.org - latest science and technology news stories", "url": "http://phys.org/news/2015-10-key-self-driving-cars-northern-virginia.html", "country": "US", "title": "Key test for self-driving cars: A northern Virginia highway", "performance_score": 0, "site": "phys.org", "participants_count": 0, "title_full": "Key test for self-driving cars: A northern Virginia highway", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T22:40:00.000+03:00", "replies_count": 0, "uuid": "cb39051eb417ac943563ecb57090244b7b70a2db"}, "author": "", "url": "http://phys.org/news/2015-10-key-self-driving-cars-northern-virginia.html", "ord_in_thread": 0, "title": "Key test for self-driving cars: A northern Virginia highway", "locations": ["Virginia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Key test for self-driving cars: A northern Virginia highway October 19, 2015 \nSelf-driving cars have faced one of their most rigorous tests yet: an interstate in busy northern Virginia. \nThe Virginia Tech Transportation Institute demonstrated its automated vehicle technology Monday on the I-95 Express Lanes. \nOfficials say it is the first time that driverless technology this advanced has been tested on an actual highway. \nStill, the demonstration was highly controlled: It occurred at midday, when the express lanes were otherwise empty, as they were in the midst of the reversal process from northbound to southbound. \nAnd the technology does not yet allow a driver to completely check out. A driver must remain behind the wheel, but the specially modified Cadillac SRX conducted lane changes on its own and adjusted speeds to account for simulated traffic and construction zones. 3 hours ago 0 GM to offer car that will almost drive itself (Update) September 7, 2014 \nCars that can talk to each other and almost drive themselves at freeway speeds are just two years away from the showroom, according to General Motors executives. Driverless cars are a catch 22—we do none of the driving, but take all of the responsibility June 17, 2015 \nThe utopian vision of the motor vehicle is an onboard autodriver much like that of the autopilot in aircraft which takes over the task of driving, freeing up the human driver to work, rest or play. This is becoming an engineering ... Majority prefer driverless technology July 22, 2015 \nWhile only a small percentage of drivers say they would be completely comfortable in a driverless car, a sizable amount would have no problem as long as they retain some control, according to a University of Michigan report. Driverless truck meant to improve safety in work zones August 24, 2015 \nRoving construction crews—the kind you see blacktopping a road, painting lines, inspecting a bridge or installing a traffic signal—are often protected from oncoming traffic by a specialized truck outfitted with a crash ... High-tech vest would protect workers, rescue personnel from highway hazards September 4, 2015 \nWorking at a construction site is loud, dirty, and often dangerous. Roadside construction workers deal with the added risk of being struck by car or truck as it passes through a work zone, its driver unaware or ignoring flags, ... Toyota shows self-driving technology being readied for 2020 (Update) October 6, 2015 \nToyota unveiled its vision for self-driving cars in a challenge to other automakers as well as industry newcomer Google Inc., promising to start selling such vehicles in Japan by 2020. Recommended for you Study urges optimization of solar energy development October 19, 2015 \nWith mounting vigor for combating global climate change, increasing the use of renewable energy resources such as solar, without compromising natural habitats, is a challenge to the traditional model of utility-scale solar ... Newly launched mobile eye-test device could lead to prescription virtual-reality screens October 19, 2015 \nAfter five years of development and about 40,000 tests worldwide, the mobile eye-test device developed by MIT spinout EyeNetra is coming to hospitals, optometric clinics, optical stores, and even homes nationwide. Flashlight powered by body heat sparks campaign dollars October 19, 2015 \nHow is this for hot response in a crowdfunding campaign. The project creator's goal was $5,000. So far the campaign has gathered $30,023 with 26 days to go. Google to give away software to Microsoft Office defectors October 19, 2015 \nGoogle is escalating an attack on Microsoft's lucrative Office software in an attempt to hit its longtime rival where it will hurt the most. Backyard photo of Lee Harvey Oswald is authentic, study shows October 19, 2015 \nA new Dartmouth study confirms the authenticity of the famous backyard photo of Lee Harvey Oswald holding the same type of rifle used to assassinate President John F. Kennedy. UK town residents to enjoy WiFi connected pavement October 18, 2015 \nUK pedestrians in Chesham will experience a first when they stroll around. Virgin Media is behind the initiative of a Smart WiFi Pavement, to provide people with Wi-Fi access. Residents will be able to \"streetsurf,\" according ...", "external_links": [], "published": "2015-10-19T22:40:00.000+03:00", "crawled": "2015-10-19T22:44:39.687+03:00", "highlightTitle": ""}