{"organizations": ["Water Industry Ensuring Defensible Data"], "uuid": "b5c0f631b8580a599a77ee914fe2c2e2b828ba90", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.waterworld.com", "main_image": "http://www.waterworld.com/content/ww/_jcr_content/brandingImage.img.jpg", "site_section": "http://feeds.feedburner.com/technologies-rss1", "section_title": "WaterWorld.com Technologies", "url": "http://www.waterworld.com/articles/print/volume-31/issue-10/features/ensuring-defensible-data-in-the-water-industry.html", "country": "US", "title": "Ensuring Defensible Data in the Water Industry", "performance_score": 0, "site": "waterworld.com", "participants_count": 0, "title_full": "Ensuring Defensible Data in the Water Industry", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T20:06:00.000+03:00", "replies_count": 0, "uuid": "b5c0f631b8580a599a77ee914fe2c2e2b828ba90"}, "author": "", "url": "http://www.waterworld.com/articles/print/volume-31/issue-10/features/ensuring-defensible-data-in-the-water-industry.html", "ord_in_thread": 0, "title": "Ensuring Defensible Data in the Water Industry", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ensuring Defensible Data in the Water Industry Sponsored by \nBy Trish Meek \nFrom National Environmental Laboratory Accreditation Program (NELAP) and EPA regulations in the U.S. to increasingly more stringent European Commission requirements, laboratories in the water industry rely heavily on accurate and well organized sample data collection, management and reporting. More importantly, water and wastewater labs must be able to demonstrate - at any time and with certainty - that their data is traceable and defensible. \nIn an environment with persistent and increasing regulatory reporting requirements, environmental and water testing labs must be able to prove data quality at all times, and they must do so without constraining productivity. Simply put, a lab’s findings must be defensible based on proven processes and robust supporting data. The Importance of Data Management \nA single laboratory test result doesn’t exist in vacuum: even a commonly executed gas chromatography result is the sum of many complementary parts, from supplier shipment data and staff training records to carrier gas and reagent quality checks. Ideally, all of these pieces of data work together to prevent errors and make results more defensible.   Integrated informatics enable labs to execute and manage all lab processes easily, with the data rigor and intelligence that lab managers require to drive efficiency and profitability - for the lab and for the business. \nHistorically, defending data has been a time- and labor-intensive process. Lab employees had to collect data from dozens of different sources - including the handwritten notes of other staff members - to build a case in support of a disputed result. Even today, many labs spend as many as 10 hours a week manually collecting and managing data. This represents a lot of time spent on manual and labor-intensive tasks and sometimes it leads to wasted effort because those lab personnel could be utilized for more important or revenue-generating activities. \nFortunately, comprehensive data management software makes it much easier for today’s labs to defend their data. Laboratory Information Management Systems (LIMS), which were first introduced over 30 years ago as basic sample management and data reporting tools, have today grown into comprehensive enterprise-level data management platforms that gather, monitor and manage all laboratory data and records. They also serve as the integration point for all lab instrumentation and, in some organizations, the electronic link to enterprise systems such as PIMS, MES and enterprise systems such as SAP. Having all this data well-organized and readily available makes the process of defending lab results much easier, allowing lab employees to redirect time to more productive work, and giving management the assurance that the lab data they’re relying on for key business metrics is defensible. Illustration: Gas Chromatography \nGas chromatography (GC), a common analytical technique in water laboratories, serves as a useful example of the sheer volume of data necessary to support the validity of a single lab result. In order to defend their results, labs must account for all the variables involved in an analysis and provide evidence that they were executed properly. A LIMS makes this much easier by automating the entire data collection and reporting process. Technical Quality \nTechnical quality data includes all variables that are involved in producing an accurate result from an instrument. A LIMS provides an entire suite of capabilities for managing this data and for demonstrating the reliability of the final result. \nSuppliers: Labs require many consumables to operate GC analyzers, from syringes to inject samples to carrier gases that slow the speed of the sample gases as they pass through the column. Rather than retest all of these consumables as they arrive at the facility, most labs find it easier to build a network of trusted suppliers. These suppliers likely have a well-earned reputation for quality which they can support with their own laboratory data. Transforming the lab into a tightly integrated paperless environment gives users real-time access to information, automates processes and reduces manual data handling, and improves regulatory compliance and data integrity. \nA LIMS can automate supplier data management by helping track materials as they enter the facility, associating them with their supplier. If a technician needs to defend the results from a test, she can reference the LIMS database to verify that all consumables used were from approved suppliers. If they are, she can partially rule out consumables as a fail point. \nConsumable Quality: Verifying that a consumable comes from an approved vendor is only part of the equation. Consumables can, after all, go out of specification during storage or use. Fortunately, a LIMS can help solve this problem as well: lab administrators can configure the LIMS to trigger periodic checks to ensure quality. Together with verification of supplier data, this capability can help labs avoid the inadvertent use of out-of-specification consumables in the vast majority of cases. \nInstrument Maintenance and Calibration: GC analyzers must be regularly maintained and calibrated to deliver consistently accurate results. To defend their results, labs must also be able to demonstrate adherence to proper maintenance procedures. Lab managers can organize and retrieve maintenance and calibration records by instrument, time period, and even staff member, directly from the LIMS, allowing them to quickly and easily demonstrate that an instrument in question is adhering to a pre-defined schedule. \nA LIMS adds additional value for calibrations that require certified reference materials. In addition to tracking the calibration itself, the LIMS can store reference material certificates that demonstrate the quality of the materials used. Staff Performance \nIn addition to instrument error, lab results can also be invalidated by human error. Human errors in the lab originate from issues in one of three broad categories: training, process and data management. A defensible lab result must be able to demonstrate that the lab staff that produced it did not inadvertently make errors in any of these areas. Data Visualization allows users outside the laboratory to monitor field collection sites quickly and easily within the LIMS. \nStaff Training: Training for each employee must be closely monitored to ensure that they’re up-to-date; otherwise results from any part of an analytical process in which they participate could be questioned. Maintaining accurate and up-to-date staff competency records is an onerous process that can be simplified by storing all personnel training records, certifications and permissions within the LIMS. \nProcess Quality Assurance: Human error is one of the most common causes of failure in any process: small errors in the execution of a GC analysis can render a result invalid. To prevent this, labs must be able to comprehensively monitor the execution of laboratory processes and reference them to individual results. \nA LIMS achieves this by storing and automating SOPs to walk staff through each analytical or operational process. As staff members progress through the steps of an SOP, they mark their progress in the system, creating real-time records to document that they executed everything correctly. Process errors can also be reported to a lab manager in real time, allowing them to correct problems before erroneous results are even reported. Dashboards provide graphical representations of information to allow laboratory management and analysts to visualize critical information in various forms. \nData Entry and Transcription: Manual data entry errors made by staff can significantly affect lab results. Even if a process is nearly entirely automated, a single manual data entry error can make the result indefensible. A LIMS helps alleviate data entry concerns by automatically collecting and aggregating lab instrument data where they can be accessed by staff or used by other instruments in the lab. A vendor-agnostic LIMS is particularly important here because it’s capable of interfacing with a broad range of instruments from multiple vendors. Conclusion: Complete Traceability \nThe areas covered above by no means comprise the exhaustive list of variables involved in a typical GC analysis, and this is just one of many analytical tests a water industry lab might undertake. But the example illustrates the point that there are many ways for a single experiment to go astray and lead to a disputed result. But defending results is about more than simply verifying inputs and outputs; it’s about documenting complicated processes rigorously at every step without pulling staff away from important work. \nA LIMS can provide complete visibility into processes and the staff that execute them. Moreover, it can direct processes in a manner consistent with SOP and, of course, quality. This complete traceability streamlines laboratory operations and provides the defensibility that’s so important to lab staff. For water industry labs, defending results is a way of life but the task is made much easier with software that looks over your shoulder, defending you every step of the way. \nAbout the Author: Trish Meek is Director of Strategy, Informatics, for Thermo Fisher Scientific. More WaterWorld Archives Issue Articles Sponsored by \nSponsored Content is made possible by our sponsor; it does not necessarily reflect the views of our editorial staff. More WaterWorld Archives Issue Articles Did You Like this Article? Get All the Water Industry News Delivered to Your Inbox or Mailbox \nSubscribe to one of our magazines or email newsletters today at no cost and receive the latest information. RELATED ARTICLES", "external_links": [], "published": "2015-10-16T20:06:00.000+03:00", "crawled": "2015-10-17T01:46:27.558+03:00", "highlightTitle": ""}