{"organizations": ["Deloitte Consulting LLP", "Deloitte and Tableau Alliance The Deloitte", "Deloitte and Tableau Software Form Alliance Deloitte and Tableau Software Form Alliance", "Deloitte", "Inc", "Tableau Software", "Deloitte and Tableau Software Form Alliance", "Deloitte LLP"], "uuid": "6379fbd4e9f4a586e6e855f9b213ea938152f7ea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "science-technology.news-articles.net", "main_image": "", "site_section": "http://science-technology.news-articles.net/content/rss.php", "section_title": "Science and Technology @ News Articles Network", "url": "http://science-technology.news-articles.net/content/deloitte-tableau-software-form-alliance.xhtml", "country": "US", "title": "Deloitte and Tableau Software Form Alliance", "performance_score": 0, "site": "news-articles.net", "participants_count": 0, "title_full": "Deloitte and Tableau Software Form Alliance", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T20:45:00.000+03:00", "replies_count": 0, "uuid": "6379fbd4e9f4a586e6e855f9b213ea938152f7ea"}, "author": "", "url": "http://science-technology.news-articles.net/content/deloitte-tableau-software-form-alliance.xhtml", "ord_in_thread": 0, "title": "Deloitte and Tableau Software Form Alliance", "locations": ["NEW YORK"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Deloitte", "Kelly Wright", "Richard Starnes"], "text": "Deloitte and Tableau Software Form Alliance   09:30:29 Deloitte and Tableau Software Form Alliance -- NEW YORK, Oct.   As used in this document, \"Deloitte\" means Deloitte LLP. Please see www.deloitte.com/us/about for a detailed description of the legal structure of Deloitte LLP and its subsidiaries. Certain services may not be available to attest clients ... × <- stripped tags -> As used in this document, \"Deloitte\" means Deloitte LLP. Please see www.deloitte.com/us/about for a detailed description of the legal structure of Deloitte LLP and its subsidiaries. Certain services may not be available to attest clients under the rules and regulations of public accounting. <-  <- stripped tags -> NEW YORK , Oct.   Deloitte Consulting LLP has signed an alliance with Tableau Software (NYSE: [[UEdFZ2NtVnNQVndpYm05bWIyeHNiM2RjSWlCb2NtVm1QU2RvZEhSd09pOHZjM1IxWkdsdkxUVXVabWx1WVc1amFXRnNZMjl1ZEdWdWRDNWpiMjB2Y0hKdVpYZHpQMUJoWjJVOVVYVnZkR1VtVkdsamEyVnlQVVJCVkVFbklISmxiRDBuYm05bWIyeHNiM2NuSUhSaGNtZGxkRDBuWDJKc1lXNXJKeUIwYVhSc1pUMG5SRUZVUVNjZ2IyNWpiR2xqYXowbmJHbHVhMDl1UTJ4cFkyc29kR2hwY3lrbklISmxiRDBuYm05bWIyeHNiM2NuUGtSQlZFRThMMkUrfA==]]), a global leader in rapid-fire, easy-to-use business analytics software. \"Tableau solutions will enhance Deloitte's ability to deliver self-service analytics capabilities to our enterprise customers,\" said Richard Starnes , principal, Deloitte Consulting LLP. \"With Deloitte's strategic advisory and industry experience, our joint customers can transform their businesses by implementing an agile, self-reliant data driven culture.\" The alliance will expand on Deloitte's breadth of information management services and go beyond the traditional business intelligence (BI) domain by addressing the emerging market needs for Deloitte clients in the self-service analytics and insights delivery domain. The alliance will incorporate a strategic and well defined go-to-market approach, as well as effective implementation methodologies and frameworks for Tableau to drive rapid value delivery opportunities for Deloitte clients. Tableau and Deloitte will use their respective strengths to deliver a self-service analytics culture to an extensive set of enterprise-level customers. Deloitte domain experience will complement the Tableau Drive methodology to support broader adoption of self-service and collaborative analytics across industries. Tableau Drive was developed by Tableau, drawing on leading practices of organizations that have seen high rates of self-service analytics adoption. \"As a long-standing Tableau customer, Deloitte has experienced the benefit of helping people to see and understand their data,\" said Kelly Wright , executive vice president at Tableau Software. \"We're excited to take our relationship to a new level with this strategic alliance, extending our reach and benefiting from Deloitte's passion for helping clients make better business decisions.\" About the Deloitte and Tableau Alliance The Deloitte and Tableau alliance delivers data insights that help lead to action. The organizations will work together to provide agile business intelligence (BI) solutions to help enterprise clients' gain a deeper understanding of their data. Deloitte and Tableau engage clients in data analysis, data exploration and data discovery to yield informed and differentiating business decisions. About Deloitte Consulting LLP Deloitte helps organizations grow their businesses and enhance value by identifying actionable insights. More than 23,000 professionals provide a broad range of capabilities across human capital, strategy and operations, innovation and technology that are aligned to the particular needs of specific sectors, businesses and organizations. Deloitte provides clients with leading business insights that can help generate a tangible and measurable impact. www.deloitte.com About Tableau Tableau Software (NYSE: DATA ) helps people see and understand data. Tableau helps anyone quickly analyze, visualize and share information. More than 26,000 customer accounts get rapid results with Tableau in the office and on-the-go. And tens of thousands of people use Tableau Public to share data in their blogs and websites. Learn more at http://www.tableau.com/ . As used in this document, \"Deloitte\" means Deloitte Consulting LLP, a subsidiary of Deloitte LLP. Please see www.deloitte.com/us/about for a detailed description of the legal structure of Deloitte LLP and its subsidiaries. Certain services may not be available to attest clients under the rules and regulations of public accounting. Tableau and Tableau Software are trademarks of Tableau Software, Inc. All other company and product names may be trademarks of the respective companies with which they are associated.", "external_links": [], "published": "2015-10-12T20:45:00.000+03:00", "crawled": "2015-10-12T20:31:47.554+03:00", "highlightTitle": ""}