{"organizations": [], "uuid": "01c6a812cb64ce795a898b6154a8a82f0b072cef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prnewswire.com", "main_image": "http://content.prnewswire.com/designimages/logo-prn-01_PRN.gif", "site_section": "http://rss.prnewswire.com/industry/technology/", "section_title": "PR Newswire: Business Technology", "url": "http://www.prnewswire.com/news-releases/blue-medora-releases-five-new-vmware-vrealize-operations-management-packs-300154075.html", "country": "IT", "title": "Blue Medora Releases Five New VMware vRealize Operations Ma", "performance_score": 0, "site": "prnewswire.com", "participants_count": 1, "title_full": "Blue Medora Releases Five New VMware vRealize Operations Ma", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T18:23:00.000+03:00", "replies_count": 0, "uuid": "01c6a812cb64ce795a898b6154a8a82f0b072cef"}, "author": "Blue Medora", "url": "http://www.prnewswire.com/news-releases/blue-medora-releases-five-new-vmware-vrealize-operations-management-packs-300154075.html", "ord_in_thread": 0, "title": "Blue Medora Releases Five New VMware vRealize Operations Ma", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "GRAND RAPIDS, Mich. , Oct. 5, 2015 /PRNewswire/ -- Blue Medora, an innovator in enterprise cloud systems management, recently released five new vRealize Operations Management Packs . The management packs, fully optimized for VMware vRealize Operations 6.x systems, provide comprehensive insight into the health, availability, performance, capacity and contextual relationships of the critical network and compute infrastructure of VMware vSphere. Blue Medora's new VMware vRealize Operations (vROps) Management Packs: \nManagement Pack for Lenovo Compute Management Pack for Lenovo Network Management Pack for IBM DB2 Management Pack for Cisco Nexus Management Pack for F5 BIG-IP \"Blue Medora brings best-of-breed software solutions to market that extend VMware vRealize beyond the virtualization layer to the business critical applications as well as the compute, network, and storage layers that VMware vSphere itself depends on,\" said Nathan Owen , CEO at Blue Medora. \"Our strategy is to continue to develop solutions that extend the reach of technologically innovative application performance management and cloud systems management platforms.\"\nOn the networking front, Blue Medora's new Management Packs for Cisco Nexus, Lenovo Network and F5 BIG-IP have been designed from the ground up to extend vRealize Operations' ability to actively monitor top-of-the-rack network fabrics to accurately pinpoint where abnormalities occur. These features allow service-impacting conditions to be uncovered before application performance is affected.\nThe Management Pack for Lenovo Compute expands vAdmins' visibility into the underlying server hardware that underpins every vSphere ESX deployment. Native Lenovo Compute alerts are imported into vRealize Operations, along with metrics displaying information about hardware status and environmental information.\nFinally, the Management Pack for IBM DB2 represents another step in Blue Medora's quest to provide end-to-end management and monitoring for market-leading databases running on both VMware and non-VMware platforms. The Management Pack introduces the ability to dive deeper into the SQL transactions themselves running within DB2.\nBlue Medora's newest releases extend the power of vRealize Operations Manager 6.x with key features such as:  \nMonitoring through a single pane of glass: View compute, network and storage infrastructure components as well the VMware-based virtual layer via a single pane of glass. Relationship mapping: End-to-end relationships between the app, storage, network, compute, storage, and virtual layers are automatically detected and created, making it easy to track issues through the system to their root cause. Predictive analytics: vROps' machine learning capabilities alert administrators to unusual metric activity, revealing potential issues before they occur. Out-of-the-box dashboards: Out-of-the-box dashboards display key metrics and relationships, allowing for immediate insight into health and performance. For more information on these management packs and Blue Medora's full line of products, visit Blue Medora's product page . To keep up on the latest news from Blue Medora, visit the Blue Medora blog and follow their Twitter and LinkedIn handles.\nAbout Blue Medora \nHeadquartered in Grand Rapids, Michigan , Blue Medora is the world's leading provider of value-added software solutions that extend VMware's vRealize Operations family of cloud systems management products. Blue Medora believes true visibility into business critical applications is only achieved when enterprise cloud management systems communicate without barriers.\nBlue Medora's rapidly growing portfolio of VMware-focused software solutions extend VMware's cloud management platform, vRealize Operations, by seamlessly integrating health, availability, performance and capacity management as well as predictive analytics for NetApp, Cisco, Oracle, IBM and SAP environments. For more information go to bluemedora.com .\n \n \n\nSOURCE Blue Medora\n\n\nRELATED LINKS\nhttp://www.bluemedora.com", "external_links": [], "published": "2015-10-05T18:23:00.000+03:00", "crawled": "2015-10-05T18:28:33.007+03:00", "highlightTitle": ""}