{"organizations": [], "uuid": "d7e6ea2e75a40c46442454baf0c09231a417dd52", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pharmaceutical-technology.com", "main_image": "", "site_section": "http://www.pharmaceutical-technology.com/news-rss.xml", "section_title": "Pharmaceutical Technology-Updates", "url": "http://www.pharmaceutical-technology.com/contractors/materials-handling/7psolutions/", "country": "", "title": "7PSolutions-Climate Control, Security and Quality Management", "performance_score": 0, "site": "pharmaceutical-technology.com", "participants_count": 0, "title_full": "7PSolutions-Climate Control, Security and Quality Management", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T13:57:00.000+03:00", "replies_count": 0, "uuid": "d7e6ea2e75a40c46442454baf0c09231a417dd52"}, "author": "", "url": "http://www.pharmaceutical-technology.com/contractors/materials-handling/7psolutions/", "ord_in_thread": 0, "title": "7PSolutions-Climate Control, Security and Quality Management", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Print Email \n7PSOLUTIONS provides global visual management to the pharmaceutical industry through cGMP compliant software, RouteWatch™. Built on the foundation of our cGMP-GDP quality management system (QMS), our GPS-GSM technologies not only manage the integrity of our clients' products but also secure their investments and brand. \nOur QMS with RouteWatch and our GL200 - Tracker™ and EMM Probe™ establish the standards and best practices that our cold chain services providers operate. Climate control and environmental monitoring \nWe understand the need to protect the integrity of your time and temperature-sensitive products. Our climate control and transportation management solutions have a variety of features to do just that, including tracking, monitoring and recording of cargo temperature, humidity, G-force (shock and vibration), air pressure, light exposure and 3D orientation using our GL200 - Tracker with Secure-Flight™ and our EMM Probe; preset temperature 'out-of-range' alarms; and 24/7/365 data monitoring. Security monitoring and protocols \nWith cargo theft on the rise, companies must now consider security when selecting a cold chain transportation logistics provider. 7PS offers the most sophisticated cargo security options available to protect your custom-critical, and often irreplaceable, cargo during transport and in-transit storage. \nOur shipment security capabilities are powered by RouteWatch, an innovative and proprietary technological platform that enables real-time shipment video surveillance, linear geo-fences, 24/7/365 GPS tracking and monitoring, security alerts and alarms, redundancies, and cargo insurance reductions. Quality management systems for cold chain shipment solutions \nWorking with your current transportation, logistics, security and quality management teams, 7PS will develop a customised and comprehensive cold chain shipment solution and standard operating procedures to fit your product's distribution, security, quality and compliance requirements. \nOur QMS can include proper temperature management, monitoring, cargo security and in-transit visibility, climate control audits. Allowing 7PS to perform GDP audits on your current climate control carriers will ensure they meet governmental regulations and your company's requirements. \nTransportation Environmental Monitoring System (TEMS) is our client-interfacing proprietary software module that allows clients to manage their time and temperature sensitive and high-value shipments through a secure web portal. This first-of-its-kind intelligent solution uses GPS and GSM communications to activate the required data within the platform, removing most of the human intervention. Tracking software for shipment security \nSecurity management service offerings are monitored using our software platform, RouteWatch, with our GC075 Vehicle Communicators, OBDII and GL200 - Trackers deliver the highest quality of shipment security by allowing our global command centre to watch your products regardless of where they are in the world. RouteWatch allows us to provide intelligent security protocols using GPS real-time positioning and predetermined client tables. \nRouteWatch is a sophisticated combination of hardware and software that provides clients with a unique menu of service offerings internally and externally. Our hardware and software platforms are developed, tested, and validated according to Good Automated Manufacturing Practices (GAMP) standards. \nThe solution provides our clients with return on investment (ROI) by improving shipment visibility, automated event communications, automated excursion communications, and the intelligence built into our platform removes most of the human role from the process. \nWe offer multiple layers of security solutions with GPS and GSM tracking and location, along with product data collection and transmission based upon intervals predetermined by the client. The entire trip history is stored in our data warehouse and includes temperature, humidity, pressure, light exposure, vibration and package orientation. Immediate real-time communication of data and location is available with no software or 'user' programming required. \nGL200-Tracker is the hardware used to protect the integrity of the product being monitored during transport. The GL200 - Tracker can be used separately when only security is of concern or when used with the EMM Probe we use the Light Sensor to alert if the package has been open prior to delivery. These devices are used for covert operations and cargo embedment with all modes of transportation. \nEMM Probe has been developed by 7PS and our technology partners Eurosat-MotoMon to measure temperature, humidity, G-force (vibration and shock), air pressure, light exposure and package 3D orientation. The EMM can be used for cargo data logging, to monitor the trailer and container temperatures, as well as the monitoring and alarming of facilities. Refrigerated shipping and in-transit climate controlled storage \n7PS is committed to patient safety and the pharmaceutical, biotech industries by providing compliant refrigerated shipping, in-transit climate-controlled storage and cargo theft prevention using RouteWatch, TEMS and our GPS tracking solutions. \nIn addition, we are partnered with integrity security personnel (ISP) who provide armed and unarmed escort services, route surveillance and cargo theft recovery. Climate controlled containers provides purpose-built temperature-controlled containers specifically for ground or air transport. The unique cargo containers ensure product integrity throughout the supply chain. Contact Details", "external_links": [], "published": "2015-10-09T13:57:00.000+03:00", "crawled": "2015-10-10T00:34:43.628+03:00", "highlightTitle": ""}