{"organizations": [], "uuid": "d8ebd56036e29c31d3dcef3191431da1737d3f6b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2014/09/Amadeus-Logo.png", "site_section": "http://www.travelandtourworld.com/news/article/category/travel-technology-news/", "section_title": "Travel Technology news | Travel and Tour World | Online technology news | distributive system | mobile application |travel trade professionalsTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/amadeus-helps-airlines-overcome-schedule-disruptions-with-first-in-class-data-analytics-tool/", "country": "US", "title": "Amadeus helps airlines overcome schedule disruptions with first-in-class data analytics toolTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Amadeus helps airlines overcome schedule disruptions with first-in-class data analytics toolTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T02:00:00.000+02:00", "replies_count": 0, "uuid": "d8ebd56036e29c31d3dcef3191431da1737d3f6b"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/amadeus-helps-airlines-overcome-schedule-disruptions-with-first-in-class-data-analytics-tool/", "ord_in_thread": 0, "title": "Amadeus helps airlines overcome schedule disruptions with first-in-class data analytics toolTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Amadeus helps airlines overcome schedule disruptions with first-in-class data analytics tool Published on : Sunday, October 25, 2015\nAmadeus today announces the launch of a cutting-edge Travel Intelligence solution for airlines, Amadeus Schedule Recovery, which minimises disruptions to operations caused by external events such as bad weather or air traffic control congestion. Amadeus Schedule Recovery serves as a recommendation engine, using data analytics to help quickly and efficiently identify the most critical issues, and act upon them.\nThis solution helps airlines make rapid choices such as whether to delay or cancel flights, swap aircraft, or reassign landing slots. Schedule Recovery reduces manual effort and improves the quality of decisions while closely controlling the strain on the airline operating costs and minimising the overall impact on passengers.\nThe launch customer of the solution, Qantas Airways – Australia’s largest carrier – has been using Schedule Recovery to improve operational efficiencies when dealing with disruptions.\n“At Qantas, we take the impact of disruptions on our customers very seriously. The Amadeus solution helps reduce the number of and length of delays, whether due to excessive traffic, operational delays, or weather conditions, leading to an overall improved experience for travellers,” said Paul Fraser, Head of Operations at Qantas. “Amadeus has developed a product that improves our efficiency and speed to ensure any delays to our services are minimised.”\nSchedule Recovery supports any airline where the size and organisational complexity of its operations, and the need to act quickly, makes it difficult for manual decision-making to take in the full operational and customer picture. It does not require an airline to use any other Amadeus solution, and can be integrated with any passenger service system.\nThe solution is divided into three modules: Airport Resource Tracker, Schedule Manager and Schedule Optimiser.\nAirport Resource Tracker, the first module, which is being launched today, provides unique capabilities to airlines at a time when growing air traffic is placing ever-increasing demands on airports and airspace capacity. The module enables airlines to interact more efficiently with air traffic control so that the best possible use can be made of available airport arrival and departure slots.\nCheck-in facilities, airport gates and luggage belts are other examples of airport capacity constraints, where poor operations control decisions could result in disruption to the passenger experience. Airport Resource Tracker allows these to be factored into airline decision-making to ensure a smooth journey.\nPascal Clement, Head of Travel Intelligence, Amadeus, said, “In today’s business, providing an excellent customer experience is essential to maintaining loyalty. One of the biggest pain points for travellers has been how airlines manage disruptions. Schedule Recovery has been designed to help airlines make quicker and more informed decisions about how to handle disruptions, regardless of their cause.” He added: “From a business perspective, operations control decisions are often difficult to measure and are kept in silos. Schedule Recovery drives a more integrated view of operations and ensures airlines can assess all aspects of the costs associated with any operations control decisions.”\nThe solution, which uses real-time business intelligence and very rich visualisation, can be readily adapted to the unique priorities of each airline as well as to their changing business needs.", "external_links": [], "published": "2015-10-25T02:00:00.000+02:00", "crawled": "2015-10-25T18:35:10.446+02:00", "highlightTitle": ""}