{"organizations": [], "uuid": "6c9babe63f8a332245b7cb9e300126afb7962fa4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://feeds.reuters.com/reuters/technologysectorNews", "section_title": "Reuters: Technology", "url": "http://www.reuters.com/article/2015/10/13/india-taxis-idUSL3N12D40X20151013", "country": "US", "title": "India drafts rules to regulate Uber, other ride-hailing firms", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "India drafts rules to regulate Uber, other ride-hailing firms | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T17:30:00.000+03:00", "replies_count": 0, "uuid": "6c9babe63f8a332245b7cb9e300126afb7962fa4"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/10/13/india-taxis-idUSL3N12D40X20151013", "ord_in_thread": 0, "title": "India drafts rules to regulate Uber, other ride-hailing firms", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW DELHI Oct 13 India has drafted guidelines to regulate ride-hailing companies, including U.S.-based Uber and its domestic rival Ola, for the first time laying down federal rules that could end months of uncertainty on how they operate in the country.\nThe federal transportation ministry has asked states to ensure companies operate with call centres and their taxis follow emission norms, according to a six-page advisory issued last week and reviewed by Reuters on Tuesday.\nThe guidelines also call for extensive background checks of drivers to ensure passenger safety. Any person who has in the past been convicted of any \"cognizable offence\" under India's criminal laws should not be allowed to become a driver.\nAlthough it is not yet clear whether the guidelines will be binding on the states and much uncertainty still remains, Uber and Ola both welcomed the move as a step in the right direction.\nOla, backed by Japan's Softbank, called the advisory a \"progressive directive\" that will help it work closely with different states. Uber said the guidelines were a \"big leap\" in recognising regulations for such companies.\nIn recent months, ride-hailing services have faced questions by authorities about their safety measures, especially in the capital Delhi, where an Uber driver was last December accused of raping a woman passenger.\nSuch services were banned in Delhi after the incident, but a court recently revoked the decision. It also led to widespread outrage against online taxi companies after it was found the accused driver had a past criminal record.\nIndia's federal transport ministry had voiced support in April, saying such firms were \"bringing value to the economy and the people\". (Reporting by Aditya Kalra ; Editing by Paritosh Bansal and Susan Thomas)", "external_links": [], "published": "2015-10-13T17:30:00.000+03:00", "crawled": "2015-10-13T18:17:23.840+03:00", "highlightTitle": ""}