{"organizations": [], "uuid": "fef961ba4423ffa8d76ade1b3f57163b57f6d8cf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theaustralian.com.au", "main_image": "http://resources2.news.com.au/images/2015/10/19/1227574/759546-89ef4714-7632-11e5-9022-b1fac89549f0.jpg", "site_section": "http://www.theaustralian.com.au/business/technology/special-reports", "section_title": "SPECIAL REPORTS | Technology | Special Reports IT &amp; Business | The Australian | The Australian", "url": "http://www.theaustralian.com.au/business/technology/classpass-promises-to-be-the-airbnb-of-boutique-fitness/story-e6frgakx-1227574759573", "country": "US", "title": "ClassPass promises to be the Airbnb of boutique fitness", "performance_score": 0, "site": "theaustralian.com.au", "participants_count": 1, "title_full": "ClassPass promises to be the Airbnb of boutique fitness | The Australian", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T08:00:00.000+03:00", "replies_count": 0, "uuid": "fef961ba4423ffa8d76ade1b3f57163b57f6d8cf"}, "author": "The Australian", "url": "http://www.theaustralian.com.au/business/technology/classpass-promises-to-be-the-airbnb-of-boutique-fitness/story-e6frgakx-1227574759573", "ord_in_thread": 0, "title": "ClassPass promises to be the Airbnb of boutique fitness", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ClassPass runs a membership program that allows users to choose from a number of gyms and studios for a set fee of $US99.\nIt provides a lot of flexibility to users and the early indications are that investors like the look of what Class Pass offers as well.\nThe New York-based company is a just a few years old, but is already valued at $US400 million ($549m) and has recorded revenue of more than $US60m.\nThat is a lot of money for a company that started life as a scheduling service that aggregated lots of different classes. That service, called Classtivity, was not a hit, but co-founder Payal ­Kadakia’s move to sharpen the focus on fitness has paid off.\nClassPass’s head of international operations, Raj Kapoor, says that combining that focus with a delivery model that gave customers plenty of options at a fixed price did the trick. There is also a sweetener for the gyms and the studios that are a crucial ingredient of the ClassPass model.\nIt may have started out as a Groupon for fitness, but Mr ­Kapoor said the model was more akin to what Airbnb is doing.\n“If you look at how it works in boutique fitness classes and speciality gyms, user utilisation rates are somewhere between 50 per cent and 60 per cent,” Mr ­Kapoor said. “That means almost half of the seats are left unsold and there haven’t been a lot of ways to monetise this unsold capacity.”\nClassPass will have to square off against the likes of Kfit and Classhopper that have already set up shop in Australia. But the start-up’s Australian general manager, Natasha Prasad, a former staff member at Atlassian, said there was plenty of untapped opportunity in the Australian market.\nThe Suncorp Bank Cost of Being Fit report, published in January, found that Australians spend a total of $8.5 billion on their fitness each year.\n“Australia is a leader in the boutique fitness space and there’s a holistic approach which is where we are going,” Ms Prasad said.\n“Companies like Uber, Airbnb and Spotify generate about 10 per cent of their revenue in Australia.”", "external_links": [], "published": "2015-10-20T08:00:00.000+03:00", "crawled": "2015-10-23T02:21:46.209+03:00", "highlightTitle": ""}