{"organizations": ["AOL", "CIA"], "uuid": "d48e56725847720e8ccb1cd85cd1fb0a33834931", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "phys.org", "main_image": "http://cdn.phys.org/newman/gfx/news/2015/ciadirectorj.jpg", "site_section": "http://www.physorg.com/rss-feed/technology-news/internet/", "section_title": "Internet News - Technology News, Internet, World Wide Web", "url": "http://phys.org/news/2015-10-wikileaks-leak-cia-chief-emails.html", "country": "US", "title": "Wikileaks warns is about to leak CIA chief's emails", "performance_score": 0, "site": "phys.org", "participants_count": 0, "title_full": "Wikileaks warns is about to leak CIA chief's emails", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T21:05:00.000+03:00", "replies_count": 0, "uuid": "d48e56725847720e8ccb1cd85cd1fb0a33834931"}, "author": "", "url": "http://phys.org/news/2015-10-wikileaks-leak-cia-chief-emails.html", "ord_in_thread": 0, "title": "Wikileaks warns is about to leak CIA chief's emails", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Wikileaks", "John Brennan"], "text": "Wikileaks warns is about to leak CIA chief's emails October 21, 2015 CIA director John Brennan, pictured on March 13, 2015, has an AOL email account hacked \nAnti-secrecy campaign Wikileaks boasted Wednesday that it had obtained CIA director John Brennan's personal emails and was about to make them public. \nThe claim came shortly after it was reported that a teenaged hacker had broken into the US spymaster's AOL account and had taken mails and personal data. \nThe FBI and Secret Service are investigating the claims, which, if true, would be a major humiliation for US intelligence after a string of major leaks. \n\"ANNOUNCE: We have obtained the contents of CIA Chief John Brennan's email account and will be releasing it shortly,\" the @Wikileaks Twitter account said. \nThe account has been verified by Twitter as belonging to the organization and is widely assumed to be controlled by Wikileaks' founder Julian Assange. \nThe announcement was made shortly after 1600 GMT and it was not clear when any material would go online, but Wikileaks has a track record of secret document dumps. \nEarlier this week the New York Post reported that a hacker, who described himself as an American high school student, had called reporters to describe his exploits. \nHe claimed Brennan's private email account held sensitive files, including his 47-page application for security clearance. \nThen, using his purported Twitter account—@phphax—the hacker taunted authorities with redacted images of what appeared to be government information. \nThe Twitter account claims the hacker is 13 years old, and expresses support for the Palestinian cause. \nThe US government has been dogged in recent years by high-profile leaks, including a trove of diplomatic cables published by Wikileaks. \nSenior officials have also been criticized for not properly protecting sensitive and classified documents. \nFormer CIA chief David Petraeus was forced to plead guilty to improperly handling documents after it emerged that he loaned his mistress his Afghan war diaries. \nAnd presidential candidate Hillary Clinton is under fire after she admitted that she only used a private email server during her time as Secretary of State. WikiLeaks releases mystery file September 1, 2011 \nWikiLeaks released a mysterious encrypted file on Wednesday after telling its followers on Twitter to stand by for \"an important announcement.\" WikiLeaks fundraising stunt draws Anonymous ire October 12, 2012 \n(AP)—A fundraising campaign by secret-busting website WikiLeaks drew the ire of many within the Anonymous movement Friday, sparking an online spat which suggests a rift between WikiLeaks chief Julian Assange and some of ... WikiLeaks dumps 276,000 more documents from Sony hack June 18, 2015 \nWikiLeaks on Thursday released 276,394 new documents from the hack of Sony Pictures in what could be a further embarrassment for the Japanese media and electronics group. State Dept. to release 7,000 pages of emails, 150 censored August 31, 2015 \nThe State Department will release roughly 7,000 pages of Hillary Rodham Clinton's emails Monday, including about 150 emails that have been censored because they contain information that is now deemed classified. \"Can you hear me now?\" Snowden joins Twitter, follows NSA September 29, 2015 \nEdward Snowden, who has confounded U.S. officials since his abrupt departure from the country two years ago, has just found a new megaphone in Twitter. Hacker claims to have breached CIA director's personal email October 19, 2015 \nAn anonymous hacker claims to have breached CIA Director John Brennan's personal email account and has posted documents online, including a list of email addresses purportedly from Brennan's contact file. Recommended for you Dive of the RoboBee: First insect-size robot capable of flying and swimming (w/ Video) October 21, 2015 \nIn 1939, a Russian engineer proposed a \"flying submarine\"—a vehicle that can seamlessly transition from air to water and back again. While it may sound like something out of a James Bond film, engineers have been trying ... YouTube to launch $10-a-month ad-free video, music plan Red October 21, 2015 \nYouTube on Wednesday unveiled a new $10-a-month subscription plan in the U.S. called Red that combines ad-free videos, new original series, movies from top YouTubers like PewDiePie, and on-demand unlimited streaming music. New device improves full-color image projection October 21, 2015 \nA team of researchers at Disney Research and Dartmouth College has developed a new way to display full-color images using only two black patterns printed on transparencies affixed to two sides of a prism. Review: Microsoft Surface Pro finally has laptop feel October 21, 2015 \nWith the new Surface Pro 4, typing on a Microsoft tablet finally feels like typing on a regular laptop. Friendly robot Pepper makes European debut in France October 21, 2015 \nA humanoid robot name Pepper designed as an upbeat companion made its European debut on Tuesday helping shoppers with wine, and more, in a major shop in France. Electric car charging put to test in Marshall Islands October 21, 2015 \nHonda is to test EV charging technologies in the Marshall Islands. Honda is doing this with the cooperation of the Marshall Islands government.", "external_links": [], "published": "2015-10-21T21:05:00.000+03:00", "crawled": "2015-10-22T04:26:07.954+03:00", "highlightTitle": ""}