{"organizations": [], "uuid": "5919ea515369b9d830f2d58e2508030f98d79b27", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/q/c/5/f/image.related.afrArticleLead.620x365.gkhiuw.png/1445654280640.jpg", "site_section": "http://www.afr.com/technology", "section_title": "Technology News | afr.com", "url": "http://www.afr.com/technology/uber-said-to-plan-another-1-billion-fundraising-20151024-gkhiuw", "country": "AU", "title": "Uber said to plan another $1 billion fundraising", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Uber said to plan another $1 billion fundraising | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T10:38:00.000+03:00", "replies_count": 0, "uuid": "5919ea515369b9d830f2d58e2508030f98d79b27"}, "author": "LESLIE PICKER and MIKE ISAAC", "url": "http://www.afr.com/technology/uber-said-to-plan-another-1-billion-fundraising-20151024-gkhiuw", "ord_in_thread": 0, "title": "Uber said to plan another $1 billion fundraising", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Such a fundraising round would make Uber the world's most valuable private startup by far. Getty Images by LESLIE PICKER and MIKE ISAAC Just three months after raising an enormous sum of money from investors, Uber is at it again.\nThe ride-hailing service is planning to raise close to $1 billion in new venture capital from investors, according to people with knowledge of the matter. Investors are looking at a valuation of $60 billion to $70 billion.\nSuch a fundraising round would make Uber the world's most valuable private startup by far. A round just this summer valued the company at more than $50 billion, a bit more than Facebook's last big private capital raise in 2011.\nNearly as eye-popping as its soaring valuations has been the furious pace at which Uber has been raising money. The latest round of financing will be the eighth that the company has sought over the last five years.\nTravis Kalanick, Uber's founder and chief executive, has little interest in going public in the near future. Facebook More precise targets on the size and the valuations will be determined after the company begins talks with investors in coming weeks, said the people, who spoke on the condition of anonymity. Executives at Uber and the company's board have approved another round, and the company plans to start holding official conversations in the next few weeks, they said.\nAn Uber spokeswoman declined to comment Friday.\nWhile Facebook's last big fundraising round took place a year before the social network went public, Travis Kalanick, Uber's founder and chief executive, has little interest in going public in the near future.\n\"We're like eighth-graders. We're in junior high and someone is telling us that we need to go to the prom, and it's just a little early,\" Kalanick said at The Wall Street Journal's WSJDLive Conference in Laguna Beach, California, on Tuesday. \"Let us get into high school before we start talking about these sorts of things.\"\n Lately, the stock market has not been hospitable to initial public offerings, encouraging many companies to stay private longer. Market volatility, in the face of worries over slower global economic growth, has led investors to become more critical of new offerings. Companies have waited a median of 7.7 years to go public this year, up from 5.8 years in 2011, according to data compiled by PitchBook.\nAnd as new technology companies stay private longer, their valuations continue to rise. There are currently more than 140 unicorns, private companies valued at $1 billion or more, according to CB Insights, a venture capital database.\nThat abundance of sky-high valuations, and a corresponding decline in the stock prices of many publicly traded tech companies, has caused some skepticism from investors and close watchers of the industry.\nFounded in San Francisco in 2009, Uber has swollen to operations in more than 300 cities across 63 countries around the globe. The company has recruited hundreds of thousands of drivers to work on a contract basis, and it has said that millions of rides are taken using its service every day.\nThroughout Uber's rapid expansion, investors have poured money into the company at a staggering rate. To date, the company has raised more than $8 billion from investors including Benchmark and Google Ventures, as well as large financial firms like Goldman Sachs and TPG Growth.\nAs Uber's war chest has increased, so has its ambitions. And much of the company's soaring valuations are contingent upon what investors see as huge potential in untapped new revenue streams like on-demand delivery services, according to people close to the company. Uber has just begun to stick its toe in those waters, with projects like Uber Eats, a food delivery service, and Uber Rush, a way for the company to power delivery of everyday goods for retailers.\nUber is also investing heavily in Uber Pool, the company's ride-sharing service, which matches multiple passengers who are traveling along the same routes to different destinations.\nInvestors also see potential in the company's international prospects. Over the last year and a half, Uber has taken aim at the Asia Pacific region, earmarking more than $1 billion to face regulatory fights in Thailand, Singapore and Vietnam.\nAnd of course there is China, Kalanick's prized territory, where the company is spending heavily to secure a strong foothold.\nIn China in particular, the company is spending hundreds of thousands of dollars a day offering discounted rides to passengers and better rates for drivers, according to two people with knowledge of the company's practices. The idea, these people said, is for Uber to become a household name in the country as quickly as possible.\nEarlier this week, Kalanick said roughly 30 percent of Uber trips were taken inside China.\nBeyond China, Uber is particularly focused on making inroads in India, as well as buttressing its existing operations in Europe, which have frequently come under attack from local regulators.\nIt will not be easy. Uber faces strong incumbents in many of the countries it wishes to establish a foothold. Didi Kuaidi, for instance, is far and away the most popular ride-hailing app in China. Uber also faces stiff competition from Ola in India, as well as BlaBlaCar in Europe.\nAnd then there is Lyft, the fast-moving competitor that operates in the United States. While Lyft is much smaller than Uber, the company has partnered with ride-hailing competitors in other countries ??? like China ??? in hopes of competing with Uber in its far-reaching quest to upend the global transportation industry.", "external_links": [], "published": "2015-10-24T10:38:00.000+03:00", "crawled": "2015-10-24T08:19:49.896+03:00", "highlightTitle": ""}