{"organizations": [], "uuid": "57ad9fc6c91a80ff2fb977c16cecb5bec2f172ba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.menafn.com", "main_image": "http://www.menafn.com/updates/pr/2015-10/GT_889004_032f535f-03c6-4988-8361-31ee4aa780cf.jpg", "site_section": "http://www.menafn.com/rss/menafn_Comm_Tech_Technologies.xml", "section_title": "MENAFN.com Comm_Tech_Technologies", "url": "http://www.menafn.com/1094395884/UK-TalkTalk-says-cyber-attack-could-affect-4mn-customers&src=RSS", "country": "", "title": "UK- TalkTalk says cyber attack could affect 4mn customers", "performance_score": 0, "site": "menafn.com", "participants_count": 1, "title_full": "UK- TalkTalk says cyber attack could affect 4mn customers | MENAFN.COM", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "57ad9fc6c91a80ff2fb977c16cecb5bec2f172ba"}, "author": "Gulf Times", "url": "http://www.menafn.com/1094395884/UK-TalkTalk-says-cyber-attack-could-affect-4mn-customers&src=RSS", "ord_in_thread": 0, "title": "UK- TalkTalk says cyber attack could affect 4mn customers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(MENAFN - Gulf Times) \n\nBritish broadband provider TalkTalk said a cyber attack on its website could have led to the theft of private data from its more than 4mn customers, in what would be one of the biggest such breaches of personal information in the country.\n\nThe firm said late on Thursday that investigations were ongoing, but there was a chance names, addresses, dates of birth, phone numbers, email addresses, TalkTalk account details, credit card details and/or bank details were compromised.\n\n\"Potentially this could affect all of our customers. I don't know for certain, which is why we are taking the precaution of reaching out to everyone,\" CEO Dido Harding told the BBC.\n\nThe attack is potentially one of the biggest and most damaging to hit a British company, and comes after several high profile cases in North America. The details of millions of customers of infidelity website Ashley Madison were leaked in August after a massive cyber assault, while Sony Corp's film studios were hit in November 2014.\n\nThe attack is the third to hit TalkTalk this year, and experts said it would damage the reputation of the company, which competes with bigger rivals BT, Virgin Media and Sky.\n\n\"Their brand will be damaged and their customers will say it is the final straw,\" said computer security expert Graham Cluley.\n\nShares in TalkTalk, which had fallen 7% since the group's websites went down on Wednesday, fell another 8.5% on Friday morning to a two-year low of 238 pence.\n\nSome customers took to Twitter to vent their anger.\n\n\"I see #talktalk has been hacked again, seriously need to go to another provider, especially as I find out via BBC and not TalkTalk,\" said Cardiff-based user Lan.\n\nThe Metropolitan Police said its cyber crime unit was investigating an alleged data theft from a telecommunications website, without giving details.\n\nPersonal data including names, addresses and phone numbers were stolen from TalkTalk at the start of the year, and in August servers owned by Carphone Warehouse, the retailer which founded TalkTalk, were attacked, potentially affecting 480,000 TalkTalk mobile customers.\n\nA spokeswoman said Wednesday's attack was the first time TalkTalk's own servers had been subjected to a sustained external attack.", "external_links": [], "published": "2015-10-23T03:00:00.000+03:00", "crawled": "2015-10-24T03:29:09.259+03:00", "highlightTitle": ""}