{"organizations": ["NASA"], "uuid": "9cfe5653da8542efab09ef91a835f784c4499f90", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "phys.org", "main_image": "http://cdn.phys.org/newman/gfx/news/hires/2015/blastwavesin.jpg", "site_section": "http://www.physorg.com/rss-feed/breaking/", "section_title": "Phys.org - latest science and technology news stories", "url": "http://phys.org/news/2015-10-blast-sun-atmosphere.html", "country": "US", "title": "Blast waves in the sun's atmosphere", "performance_score": 0, "site": "phys.org", "participants_count": 0, "title_full": "Blast waves in the sun's atmosphere", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T14:21:00.000+03:00", "replies_count": 0, "uuid": "9cfe5653da8542efab09ef91a835f784c4499f90"}, "author": "", "url": "http://phys.org/news/2015-10-blast-sun-atmosphere.html", "ord_in_thread": 0, "title": "Blast waves in the sun's atmosphere", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Blast waves in the sun's atmosphere October 14, 2015 A look at the Sun’s right limb on 26 January 2010. Within the marked red square a large-scale blast wave travels through the Sun’s atmosphere. These images were obtained with the help of NASA’s STERO A probe and show the Sun’s atmosphere in extreme ultraviolet light. Credit: NASA/STEREO A/MPS/AAS reproduced with permission \nTwo teams of researchers led by Nariaki Nitta from the Lockheed Martin Advanced Technology Center in the USA and by Radoslav Bucík from the Max Planck Institute for Solar System Research (MPS) in Germany have independently discovered a new solar phenomenon: large-scale waves in the star's atmosphere accompanied by energetic particle emissions rich in helium-3. Helium-3 is a light variety of the inert gas helium. The huge waves may contribute significantly to accelerate the particles into space, the MPS scientists now report in the Astrophysical Journal . Decisive for this discovery were the two spacecraft STEREO A and ACE making it possible to simultaneously observe the sun from two different directions. In the near future, no such opportunity will arise again. \nThe sun is a highly eruptive star: Again and again it emits energetic particles and radiation into space in violent outbursts. Examples of outbursts are the coronal mass ejections (CMEs) where a plasma of electrons, protons, and a few heavy atoms is hurled into space, as well as short, collimated X-ray flares. Both phenomena occur in connection with so-called solar eruptions. Two research groups have now independently discovered a completely new type of solar ejection in observational data: large wave fronts in the sun's atmosphere together with particle flows rich in helium-3. The waves could be tracked down by looking at the sun's atmosphere in extreme ultraviolet light. \nThe waves detected in data from 26 January and 2 February 2010 extended over at least half a million kilometers and propagated at a speed of approximately 300 kilometers per second. They occurred shortly after a weak X-ray flash, but differ significantly from this typical jet-like form of radiation. Coronal mass ejections as a trigger of the waves were not observed. \"The new phenomenon is like a kind of explosion,\" said Bucik, who headed the team of researchers at the MPS, the Johns Hopkins University, and the Jet Propulsion Laboratory in the US. \nSimultaneously with the blast waves, the sun hurls a particle stream rich in helium-3 into space. Particle emissions of this kind have been well-known for years, but could never be fully explained. \"We believe that the blast waves accelerate the helium-3\", says Davina Innes from the MPS. \"Our analysis shows that typical characteristics of the waves, such as their energy, influence the properties of the particles\", adds her colleague Lijia Guo, also stationed at the MPS. However, how exactly this works, is still unclear. \nIn order to observe both the wave phenomenon and the helium-3 ejections and so to recognize the connection between the two, a two-fold look at the sun was necessary. Since the sun rotates, ejected particles leaving the star travel on a curved trajectory similar to the water jets of a rotating lawn sprinkler. The particles reaching Earth have, therefore, originated on the right side of the sun (as seen from Earth). This region is not clearly visible from Earth. \n\"STEREO A is the only solar observatory in space, which does not remain close to Earth, but travels around the sun,\" explains Bucik. In early 2010, the spacecraft was located exactly above the right limb of the sun. While ACE orbiting close to Earth could detect the particle streams, STEREO A yielded recordings of the region where they originated – and thus of the EUV blast wave. \nThe researchers believe that the new phenomenon is not rare, but could so far not be well observed. \"Unfortunately, however, in the foreseeable future the necessary viewing geometry will not occur again\", says Bucik. \nSTEREO A is one of NASA'S twin space probes launched in 2006. The probes, called A and B, circle the sun in opposite directions thus allowing for a three-dimensional look at our star. Since the loss of communication with STEREO B last October, STEREO A has continued its observations alone. In 2025 it will reach the same favorable viewing position again as it had 2010. ACE (Advanced Composition Explorer) is a NASA spacecraft. Since 1997 it has been studying solar, cosmic, and interstellar particles from an observation site near Earth.", "external_links": [], "published": "2015-10-14T14:21:00.000+03:00", "crawled": "2015-10-14T14:33:58.956+03:00", "highlightTitle": ""}