{"organizations": [], "uuid": "347d592a4de96ff723cd8cc42219c7cda3244fec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266385/technology-general", "section_title": "Technology Press Releases from PRWeb - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30158447/qlik-to-brief-bbbt-on-its-latest-innovations", "country": "US", "title": "Qlik To Brief BBBT on Its Latest Innovations", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Qlik To Brief BBBT on Its Latest Innovations - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T09:01:00.000+03:00", "replies_count": 0, "uuid": "347d592a4de96ff723cd8cc42219c7cda3244fec"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30158447/qlik-to-brief-bbbt-on-its-latest-innovations", "ord_in_thread": 0, "title": "Qlik To Brief BBBT on Its Latest Innovations", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Qlik will brief many of the world’s leading Business Intelligence (BI) analysts this Friday at the Boulder BI Brain Trust (BBBT), the largest industry analyst consortium of its kind.\nBoulder, Colorado (PRWEB) September 30, 2015\nOn Friday, October 2, 2015, Qlik’s vice president of innovation and design, Donald Farmer, and senior solution architect, Todd Margolis, will brief BBBT on its latest technologies and provide some special insights into its research and innovation projects.\n“Not only do we have an exciting portfolio of products – including Qlik Sense, Qlik Cloud and Qlik Data Market, but we also have a unique team focused on research and innovation,” said Mr. Farmer. “In a market where global firms of analysts dominate the conversation for too many customers and partners, it’s a delight to share insights and to get feedback from such a diverse and knowledgeable group of independent experts.”\n“Qlik is one of a handful of companies that can successfully reinvent its core offerings while simultaneously developing new, cutting edge products,” said BBBT Founder, Claudia Imhoff. “Qlik’s BBBT sessions are always popular, and I look forward to hearing about their latest innovations.”\nA podcast summarizing the presentation will be available at the BBBT podcasts page and a video of the presentation will be available at the BBBT videos page .\nAbout BBBT\nThe Boulder Business Intelligence Brain Trust has served the BI industry since 2006. It is a consortium of over 185 industry analysts, experts, and practitioners from around the world. BBBT hosts BI industry vendors who provide extended, interactive briefings, streamed live as webinars exclusively to BBBT members. It's a reciprocal arrangement, the members receive the latest information on current and planned BI tools and technologies, and the vendors get valuable feedback on their offerings, marketing, and messaging.\nAbout Qlik\nQlik (NASDAQ: QLIK) is a leader in data discovery delivering intuitive solutions for self-service data visualization and guided analytics. Approximately 36,000 customers rely on Qlik solutions to gain meaning out of information from varied sources, exploring the hidden relationships within data that lead to insights that ignite good ideas.\n //www.prweb.com/releases/2015/10/prweb12991613.htm\n ", "external_links": ["http://www.bbbt.us/", "http://www.bbbt.us/resources/videos/2015-2/", "http://www.bbbt.us/resources/podcasts/2015-2/", "http://www.qlik.com/", "http://www.prweb.com/releases/2015/10/prweb12991613.htm"], "published": "2015-10-01T09:01:00.000+03:00", "crawled": "2015-10-01T11:06:57.861+03:00", "highlightTitle": ""}