{"organizations": ["Tech NY", "Reuters"], "uuid": "45b740e9ca2dcbb57d1061d8c1aafc751786f69e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "http://s4.reutersmedia.net/resources/r/?m=02&d=20151021&t=2&i=1088574260&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXNPEB9K07W", "site_section": "http://uk.mobile.reuters.com/reuters/rss/TECHUK.xml", "section_title": "Reuters: Technology News", "url": "http://uk.reuters.com/article/2015/10/21/us-sportsfantasy-probe-idUKKCN0SF0F220151021?feedType=RSS&feedName=technologyNews", "country": "US", "title": "NY federal prosecutor probes daily fantasy sports business: WSJ", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "NY federal prosecutor probes daily fantasy sports business: WSJ", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T10:17:00.000+03:00", "replies_count": 0, "uuid": "45b740e9ca2dcbb57d1061d8c1aafc751786f69e"}, "author": "", "url": "http://uk.reuters.com/article/2015/10/21/us-sportsfantasy-probe-idUKKCN0SF0F220151021?feedType=RSS&feedName=technologyNews", "ord_in_thread": 0, "title": "NY federal prosecutor probes daily fantasy sports business: WSJ", "locations": ["New York"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jason Robins", "Segar"], "text": "Related: Tech NY federal prosecutor probes daily fantasy sports business: WSJ DraftKings CEO Jason Robins speaks during an interview with Reuters in New York, September 9, 2015. Reuters/Mike Segar \nManhattan Attorney Preet Bharara is investigating whether the business model behind daily fantasy sports companies such as DraftKings Inc and FanDuel Inc violates federal law, the Wall Street Journal reported. \nThe investigation is at an early stage and senior Justice Department lawyers in Washington are undecided on whether daily fantasy sports betting violates federal gambling statutes, the newspaper reported, citing people familiar with the matter. \nThe newspaper reported earlier this month that the Federal Bureau of Investigation and the U.S. Justice Department were investigating the industry, but the central role of Bharara's office was not previously known. \nReuters could not immediately reach representatives at the prosecutor's office, DraftKings, and FanDuel for comment outside regular U.S business hours. \nDaily fantasy sports, which have developed in recent years, allow participants to draft teams in games played in just one day. They have allowed fans to bet with a frequency that some critics argue is akin to sports betting or gambling. \nThe fantasy sports industry has faced criticism since news broke that an employee at DraftKings won $350,000 from a $25 entry in an American football contest on the rival FanDuel site using what reports said appeared to be inside information. \nFanDuel and DraftKings are privately owned and both valued at more than $1 billion. \nDaily fantasy sports companies now operate in at least 45 U.S. states, though some are considering reviews on whether the activity should be treated as gambling. \n(Reporting by Supriya Kurane in Bengaluru; Editing by Anupama Dwivedi) Trending On Reuters", "external_links": [], "published": "2015-10-21T10:17:00.000+03:00", "crawled": "2015-10-21T10:34:23.745+03:00", "highlightTitle": ""}