{"organizations": ["Woodside", "Lens Envy", "IBM"], "uuid": "12cb8645030c719da9d43c54a5d61e03a903d087", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "phys.org", "main_image": "http://cdn.phys.org/newman/gfx/news/2015/woodsidetaps.jpg", "site_section": "http://phys.org/rss-feed/technology-news/hi-tech/", "section_title": "Hi-Tech Innovation News - Information Technology, Inventions News", "url": "http://phys.org/news/2015-10-woodside-ibm-supercomputer-bolster.html", "country": "US", "title": "Woodside taps IBM's supercomputer to bolster operations", "performance_score": 0, "site": "phys.org", "participants_count": 0, "title_full": "Woodside taps IBM's supercomputer to bolster operations", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T16:30:00.000+03:00", "replies_count": 0, "uuid": "12cb8645030c719da9d43c54a5d61e03a903d087"}, "author": "", "url": "http://phys.org/news/2015-10-woodside-ibm-supercomputer-bolster.html", "ord_in_thread": 0, "title": "Woodside taps IBM's supercomputer to bolster operations", "locations": ["Karratha"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Watson"], "text": "Woodside taps IBM's supercomputer to bolster operations October 13, 2015 by Blair Price Perth-based Woodside unveiled plans to use Watson in late May and has flagged entire value chain benefits— starting from exploration right through to final product marketing—at its projects which include the Pluto LNG operation off Karratha and the North West Shelf Project. Credit: Lens Envy \nWoodside Petroleum is hoping to maximise efficiency and cut down on unnecessary costs by utilising IBM's gameshow-winning Watson cognitive computer system as the oil and gas industry battles uncertainty from the prolonged oil price downturn. \nIn 2011 Watson famously beat two of the greatest champions of long-running American quiz show Jeopardy in an exhibition match. \nPerth-based Woodside unveiled plans to use Watson in late May and has flagged entire value chain benefits— starting from exploration right through to final product marketing—at its projects which include the Pluto LNG operation off Karratha and the North West Shelf Project. \nWatson uniquely operates on a question answering system and can process English language-based unstructured data from a variety of sources including PDF and Microsoft Word files plus HTML. \nWatson can consequently take in data ranging from peer-reviewed research reports to twitter feeds. \nOnce carefully prepared with relevant information and human input on how to interpret it, Watson can tackle complex questions and make evidence-based recommendations expressed through \"confidence\" score percentages. \nWatson can also find important patterns lost in the sea of big data. \nWoodside will specifically use Watson's Lessons Learned cognitive advisory service which is delivered online via an IBM cloud platform. \n\"Watson has the potential to lead to faster resolutions, improved process flow and operational outcomes,\" a Woodside spokesperson says. \n\"Cognitive computing will be used to support Lessons Learned Q&A [Question and Answer] systems on major capital projects and turnarounds.\" \nCurtin University senior lecturer and robotics and artificial intelligence specialist Dr Raymond Sheh says technologies like Watson are better able to see patterns both at the larger \"big picture\" scale as well as at the small scale. \n\"That's where the [competitive] edge lies,\" he says. \n\"Further, they are sometimes able to 'prove' why doing things a particular way might be better, even if it is only in the form of statistics. \n\"So while a human might have a 'hunch' that it might be better to do things a particular way, such systems can give decision makers greater confidence.\" \nDr Sheh says Watson has limitations in that it can't think outside of the box if there is not that much data relating to the topic at hand. \n\"Humans can do this, at least in part, because of our wide range of experiences through life. Of course, as these systems incorporate more and more information from other sources, they will also become better at this.\"", "external_links": [], "published": "2015-10-13T16:30:00.000+03:00", "crawled": "2015-10-13T20:37:13.807+03:00", "highlightTitle": ""}