{"organizations": [], "uuid": "10034f4c40759c4da35247f709bd2ae0cb531180", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.innovativeretailtechnologies.com", "main_image": "", "site_section": "http://www.retailsolutionsonline.com/rssfeeds/rssnews", "section_title": "Innovative Retail Technologies News", "url": "http://www.innovativeretailtechnologies.com/doc/store-tech-spending-reveals-a-focused-investment-in-omni-channel-0001?atc~c=771+s=773+r=001+l=a", "country": "US", "title": "Store Tech Spending Reveals A Focused Investment In Omni-Channel", "performance_score": 0, "site": "innovativeretailtechnologies.com", "participants_count": 1, "title_full": "Store Tech Spending Reveals A Focused Investment In Omni-Channel", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T13:06:00.000+03:00", "replies_count": 0, "uuid": "10034f4c40759c4da35247f709bd2ae0cb531180"}, "author": "MattPillar", "url": "http://www.innovativeretailtechnologies.com/doc/store-tech-spending-reveals-a-focused-investment-in-omni-channel-0001?atc~c=771+s=773+r=001+l=a", "ord_in_thread": 0, "title": "Store Tech Spending Reveals A Focused Investment In Omni-Channel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "From The Editor | October 22, 2015 Store Tech Spending Reveals A Focused Investment In Omni-Channel To access this content, please Register or Sign In. By Matt Pillar , senior executive editor, Innovative Retail Technologies \nOur 2016 Retail Tech Spending report is live here , and it’s quite revealing. Asked about their tech spending plans for the coming year, our sample of 500 retail executives provided the most abundantly clear evidence I’ve seen to date that discipline- and channel-specific silos are being actively dismantled. Based on our findings, stores and associates will be the biggest beneficiaries of recent and near-term tech investments. Here’s a recap of some of that evidence, and what it lends to the case for a transformative year in 2016: 62 percent of the retail execs we surveyed said their companies had inventory visibility across all channels. That’s up from just 50 percent last year. This is profoundly significant because inventory visibility is a prerequisite underpinning of omni-channel. This progress tells us that retailers are actively preparing their stores and store associates for a move from helpless —stores and their associates have for too long been disconnected islands in the stream of commerce—to engaged in the consumer’s pursuit of the right product in the right place at the right time. Enterprise inventory visibility paves the way for the execution of mobile devices beyond line busting. It enables associates to reach beyond the four walls on behalf of their customers and save sales on behalf of their employers. \nPlease log in or register below to read the full article. Like what you are reading? Sign up for our free newsletter SIGN ME UP By clicking Sign Me Up, you agree to our Terms and that you have read our Privacy Policy . Register Today. It's Fast And Free. \nThe content you requested is only available to registered users of Innovative Retail Technologies. By registering now, you'll get exclusive access to this piece of content and thousands of additional articles and product reviews across our entire network of sites. Already Registered? Sign In.", "external_links": [], "published": "2015-10-22T13:06:00.000+03:00", "crawled": "2015-10-23T03:19:34.412+03:00", "highlightTitle": ""}