{"organizations": ["Sadolin & Albæk"], "uuid": "aa1d515215627c2b3a7aea5bdd20f68d85677dfe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.legalsupportnetwork.co.uk", "main_image": "", "site_section": "http://www.legalsupportnetwork.co.uk/feed-rss/news/technology", "section_title": "News Technology - Legal Support Network", "url": "http://www.legalsupportnetwork.co.uk/knowledge-management/news/sadolin-albaek-chooses-highq-collaborate-data-rooms", "country": "IE", "title": "Sadolin & Albæk chooses HighQ Collaborate for data rooms", "performance_score": 0, "site": "legalsupportnetwork.co.uk", "participants_count": 0, "title_full": "Sadolin & Albæk chooses HighQ Collaborate for data rooms", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T18:08:00.000+03:00", "replies_count": 0, "uuid": "aa1d515215627c2b3a7aea5bdd20f68d85677dfe"}, "author": "", "url": "http://www.legalsupportnetwork.co.uk/knowledge-management/news/sadolin-albaek-chooses-highq-collaborate-data-rooms", "ord_in_thread": 0, "title": "Sadolin & Albæk chooses HighQ Collaborate for data rooms", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted: 15   \nMarket-leading commercial property adviser and agent, Sadolin & Albæk, has chosen HighQ Collaborate for its integrated virtual data room solution. \nChristian Fladeland, Partner and Director at the firm, explains how the firm came to use HighQ Collaborate: “We had used several different data room providers for different deals in the past, including Merrills and DataRooms.com, and we wanted to pick one provider to handle all our deals in one place.” \nAfter some research and hearing recommendations from those who had used HighQ’s platforms in previous roles, the team chose HighQ Collaborate for its flexibility and ease of use. “We knew that many of the largest law firms in Denmark were using HighQ Collaborate and we found it was the easiest platform to use,” explains Christian. “It’s intuitive and very flexible and doesn’t require any particular training to use the system.” \nHighQ Collaborate uniquely combines advanced document management and file sharing with enterprise social collaboration, personal productivity and project management tools that allow users to get their work done more efficiently and securely share information with internal and external users in one unified space. Virtual data room is just one solution of many that HighQ Collaborate can be used for. \nHighQ’s enterprise-grade security and flexibility was another key factor for Christian, and was vital for keeping sensitive real estate information safe: “One reason we chose HighQ was the choice of data centres it provided us with; it was important to us that we could have our data residing in our own country,” Christian explains. \nChristian says the team at HighQ have been a pleasure to work with. “They are very hands on and give a lot of support if you need it,” he says. “We are very excited to get everything set up. \nStefan Beishuizen, Sales and Business Development Manager Europe, at HighQ says: “We are truly excited about working with Sadolin & Albæk. The firm is leading from the front when it comes to deploying technology to facilitate value adding services for their clients. We are proud to be a part of this strategy and are looking forward to helping Sadolin & Albæk deliver on their plans. Sadolin & Albæk is a perfect example of a firm which understands the importance of secure client engagement within Professional Services and we look forward to see the adoption of Collaborate take flight at the firm after launch.” \nShare:", "external_links": [], "published": "2015-10-15T18:08:00.000+03:00", "crawled": "2015-10-16T06:11:52.749+03:00", "highlightTitle": ""}