{"organizations": [], "uuid": "5dbbc8ee5762cce3ec4bb7ec2bccbb1b58b61894", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "", "site_section": "http://www.bloomberg.com/technology", "section_title": "Technology - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-10-08/lyft-offers-car-rental-fuel-perks-to-keep-drivers-happy", "country": "US", "title": "Lyft Offers Car Rental, Fuel Perks to Keep Drivers Happy", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Lyft Offers Car Rental, Fuel Perks to Keep Drivers Happy - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:52:00.000+03:00", "replies_count": 0, "uuid": "5dbbc8ee5762cce3ec4bb7ec2bccbb1b58b61894"}, "author": "Eric Newcomer", "url": "http://www.bloomberg.com/news/articles/2015-10-08/lyft-offers-car-rental-fuel-perks-to-keep-drivers-happy", "ord_in_thread": 0, "title": "Lyft Offers Car Rental, Fuel Perks to Keep Drivers Happy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Lyft Inc. wants drivers for its ride-hailing service to be happy.\nLyft, which competes with Uber Technologies Inc., is offering its drivers a series of perks aimed at making it more attractive for them to work for the company.\nDrivers can earn Shell fuel rewards for driving for Lyft, get discounted Hertz car rentals and receive money they earn faster, the San Francisco-based startup said on Thursday.\nLyft, which is in a fierce competition for drivers with Uber, unveiled the benefits with the tag line: “We Treat You Better.” It’s a balancing act. While Lyft is seeking to offer incentives for people to work for the car-booking service, it’s also keeping them at arms length as independent contractors. Unlike employees, freelance workers aren’t entitled to minimum wage guarantee, company-funded social security benefits or mileage reimbursements. That issue came into stark relief in California, where Uber and Lyft drivers have filed separate lawsuits seeking reclassification as employees.\n“We want to make sure everything we do enforces that we are the company that treats you better than anybody else,” Lyft co-founder John Zimmer said at an event at the company’s headquarters. More than 100 drivers attended the event and cheered the announcements.\nA Lyft Inc. car drives behind a taxi in San Francisco, California.\nPhotographer: Justin Sullivan/Getty Images One benefit that Lyft already offers drivers is the ability to accept tips. Passengers can’t tip Uber drivers from within the mobile app used to hail rides. Lyft, which integrates tipping into its app, said drivers have earned more than $40 million in tips since the company was founded in 2012.\nLyft, which is backed by Founders Fund, Andreessen Horowitz and Alibaba Group Holding Ltd., was last valued at $2.5 billion. Uber has garnered a valuation of more than $50 billion.\nLyft’s partnership with Royal Dutch Shell Plc promises to save drivers anywhere from 3 cents a gallon to “several free tanks per week,” the startup said. For payments, Lyft is promising drivers that they can get their on the same day that they drive, once they reach $50 in earnings. The initiative, called Express Pay, will roll out in November as part of a pilot program, Lyft said.", "external_links": ["http://blog.lyft.com/posts/wetreatyoubetter\\"], "published": "2015-10-09T03:52:00.000+03:00", "crawled": "2015-10-09T00:13:07.136+03:00", "highlightTitle": ""}