{"organizations": [], "uuid": "c0187e7730ed596b4c10476e2aed352cb72b7e72", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.jobs.ac.uk", "main_image": "http://www.jobs.ac.uk/images/global/jobs_ac_uk-logo-with-strapline.jpg", "site_section": "http://www.jobs.ac.uk/jobs/medical-technology/?format=rss", "section_title": "Medical Technology Jobs - jobs.ac.uk", "url": "http://www.jobs.ac.uk/job/AMD922/post-doctoral-research-fellow-in-neuroimaging/", "country": "GB", "title": "Post-Doctoral Research Fellow in Neuroimaging", "performance_score": 0, "site": "jobs.ac.uk", "participants_count": 0, "title_full": "Post-Doctoral Research Fellow in Neuroimaging", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "c0187e7730ed596b4c10476e2aed352cb72b7e72"}, "author": "", "url": "http://www.jobs.ac.uk/job/AMD922/post-doctoral-research-fellow-in-neuroimaging/", "ord_in_thread": 0, "title": "Post-Doctoral Research Fellow in Neuroimaging", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "55267 \nThis post is offered on a temporary basis for 6 months \nA six-month Post-doctoral research assistant position is available on a joint project between the School of Psychology, University of Birmingham and School of Physics and Astronomy, University of Nottingham to optimise and develop simultaneous acquisition of EEG data with multiband fMRI data (EEG-mbfMRI). Candidates are sought with an interest in cutting-edge multimodal brain imaging and the initiative and interest to develop application areas of the optimised technique. \nThe successful candidate will have responsibilities including the design and implementation of initial experimental protocols to determine optimal data quality, data acquisition at both the University of Birmingham and Nottingham, development and application of fMRI data analysis, management of human participant protocols, manuscript preparation and dissemination of developed knowledge to other imaging users. \nThe Universities of Nottingham and Birmingham have a world-class reputation in neuroscience and multimodal neuroimaging and both house 3 T Philips systems allowing translation of imaging techniques between institutes. The candidate will work with a team of experts in these areas across the two universities to realise the aims of this project. \nCandidates must have experience with MATLAB programming and the ability to develop novel scripts for data analysis. Experience of MRI scanner operation, fMRI data acquisition and analysis with common packages (SPM or FSL) is essential. Experience with EEG setup and acquisition during fMRI is desirable though not required. Excellent written, oral, and interpersonal skills are essential. \nApplicants should hold a PhD in cognitive neuroscience, neuroimaging, MRI or a closely related field or be within a few months of thesis submission. \nThis post is funded for six months. \nInformal enquiries can be made to Dr Steve Mayhew s.d.mayhew@bham.ac.uk \nThe closing date for receipt of applications is 23 rd October, 2015. \nFor further information or to apply visit: www.hr.bham.ac.uk/jobs - reference 55267 \nValuing excellence; sustaining investment", "external_links": [], "published": "2015-10-09T03:00:00.000+03:00", "crawled": "2015-10-09T14:32:37.510+03:00", "highlightTitle": ""}