{"organizations": [], "uuid": "6a7a743577eec057cb1ba4bebcbfa69c58fe1156", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266385/technology-general", "section_title": "Technology Press Releases from PRWeb - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30234135/advidsco-scales-new-peaks-of-growth-signs-1000th-client", "country": "US", "title": "Advids.co scales new peaks of growth signs 1000th client", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Advids.co scales new peaks of growth signs 1000th client - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T18:02:00.000+03:00", "replies_count": 0, "uuid": "6a7a743577eec057cb1ba4bebcbfa69c58fe1156"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30234135/advidsco-scales-new-peaks-of-growth-signs-1000th-client", "ord_in_thread": 0, "title": "Advids.co scales new peaks of growth signs 1000th client", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Advids.co , a leading video content creation platform, today announced that it recently signed its 1000th client and has registered 8x growth over Q2 2015. Advids.co has delivered video content solutions to organizations of varying scales including brands like Mercedes-Benz, OLA, AdCash and several global brands and startups, which has contributed to the company's rapid expansion.\n(PRWEB) October 11, 2015\nInformation overload is a real problem today and the key to simplifying it is video content. Businesses of all sizes are increasingly looking to embrace video as a part of their internal & external communication strategy. Advids.co has re-imagined how businesses can meet this challenge by enabling them to remotely produce video content on-demand, in an easy and efficient manner.\nToday your audience, partners or investors want to learn about your offerings and value propositions in a fast and easy-to-digest way. You want to show a preview or communicate an idea, to get them connected with your vision - without drowning them in a sea of information. We are super excited to be part of the video revolution by enabling businesses to produce videos online with zero friction and without any learning curve,” said Alok Bhat,Founder & CEO Advids.co .\nAdvids.co has seen a strong adoption of videos in every domain of an organization, spread across Sales, Marketing, Accounts, Support, HR & Training.\nAdvids.co’s growth has been propelled by a complete solution approach – spanning idea to realization, guided scoping, seamless collaboration, high quality content and remote video production.\n“Advids Online Studio is powered by an ever-growing global network of video writers, directors and a thriving artist community. We are continuously looking to build an ecosystem where a large community of artists is connected, thus making Advids.co truly scalable and on-demand,” said Bhargav Chatterjee, Co-Founder, Advids.co.\nAbout Advids.co:\nAdvids.co is the world's first on-demand video creation platform that makes video creation easy and scalable. Advids is powered by an ever-growing global community of scriptwriters, directors, designers, artists, musicians and animators; all devoted to captivating the world through videos.\nFounded in 2011, the company provides a seamless way to produce videos remotely. Advids.co enables you to communicate directly with your video team, track dates, provide feedback and access all your files at one place.\nAdvids is trusted by some of the world's leading brands and startups to communicate their information, stories and messages via video.\nGetting started with Advids.co is easy. See for yourself how Advids.co can help you.\n //www.prweb.com/releases/advids/videos/prweb13002438.htm\n ", "external_links": ["http://www.prweb.com/releases/advids/videos/prweb13002438.htm", "http://www.advids.co/"], "published": "2015-10-11T18:02:00.000+03:00", "crawled": "2015-10-12T03:28:39.685+03:00", "highlightTitle": ""}