{"organizations": [], "uuid": "ba16a91730554a84701a42677135cb568e400ae2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.jdsupra.com", "main_image": "http://www.jdsupra.com/showThumbnail.aspx?img=12612_4830.jpg&size=og", "site_section": "http://www.jdsupra.com/resources/syndication/docsRSSfeed.aspx?ftype=ScienceComputersTechnology&premium=1", "section_title": "Science, Computers, & Technology RSS Feed | JD Supra Law News", "url": "http://www.jdsupra.com/legalnews/non-compliance-with-new-eu-data-privacy-53586/", "country": "US", "title": "Non-compliance with new EU data privacy rules can be costly", "performance_score": 0, "site": "jdsupra.com", "participants_count": 1, "title_full": "Non-compliance with new EU data privacy rules can be costly", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:21:00.000+03:00", "replies_count": 0, "uuid": "ba16a91730554a84701a42677135cb568e400ae2"}, "author": "Kirton McConkie PC", "url": "http://www.jdsupra.com/legalnews/non-compliance-with-new-eu-data-privacy-53586/", "ord_in_thread": 0, "title": "Non-compliance with new EU data privacy rules can be costly", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Contact \nTo embed, copy and paste the code into your website or blog: <iframe src=\"http://www.jdsupra.com/post/contentViewerEmbed.aspx?fid=5a06da3e-78a6-4d8f-badc-38366a4d41d6\" width=\"100%\" height=\"620\" frameborder=\"1\" style=\"border: 2px solid #ccc; overflow-x:hidden !important; overflow:hidden;\" scrolling=\"auto\"></iframe> \nOn October 6, Europe’s highest court, the Court of Justice of the European Union, struck down the “Safe Harbor Framework,” which existed between the United States and the EU for 15 years. This has an impact on companies collecting or processing personal data in EU nations for use in the United States. The Framework provided a method for over 4,000 U.S. companies to transfer personal information outside the European Union consistent with the EU’s strict Data Protection Directive. The Directive establishes the rules for protecting Europeans’ privacy rights. To take advantage of the Framework, U.S. companies have self-certified compliance with EU standards to the Department of Commerce. \nThe European court struck down this longstanding business arrangement after Austrian privacy activist Max Schrems alleged his personal information transmitted via Facebook or stored on Facebook’s servers in the U.S. was not, in fact, safe from intrusion from the prying eyes of the U.S. government. Schrems’ lawsuit arose after Edward J. Snowden, former contractor for the National Security Agency, divulged that American intelligence agencies were freely accessing data held by Facebook or transferred by emails and other means between the EU and the U.S. The European high court agreed, holding U.S. government actions invalidated the “Safe Harbor” provisions. \nAs a result, many multinational organizations, large and small, must now obtain prior approval from each EU member nation where the company has customers, suppliers, employees, or other relationships with EU residents who provide personal information, including names, contact information, or other “personally identifiable information” ranging from membership in clubs or trade unions to names of family members, insurance coverage, banking relationships, religious affiliation, employment information, and a host of other personal details. Entities engaged in collecting or processing any personal information from residents of an EU member nation are required to register as “data controllers” in each EU country where they do business or collect personal information. Failure to adhere to these European privacy norms can lead to investigations by data protection agencies and fines in the tens of thousands of dollars. In addition, Europeans tend to be highly protective of their privacy, and often reject companies that ignore traditional EU-mandated privacy protections. \nHow to ensure compliance with international data protection laws \nIf there are concerns about your organizations continuing capacity to carry on transglobal business arrangements in light of this new EU ruling and to ensure compliance with international data protection laws, contact a lawyer qualified to draft the appropriate documentation for submission to EU data protection agencies to obtain “registration” or “notification” for data collection and transmission strategy and practices with those national agencies. \nTo establish compliance and rights to receive and transmit personal information, a lawyer will: Prepare written transborder transfer agreements between European and American entities; “Prepare Informed Consent” agreements for use when receiving personal information from European residents; Counsel with the client in drafting “binding corporate rules” arrangements where advisable in order to satisfy European privacy agencies which must approve of systems for transferring personal data beyond EU borders; and Prepare and submit applications for registration/notification which must be approved by EU national data protection agencies. Many EU data protection agencies require applicants to submit for approval their transborder transfer agreements, Informed Consent Agreements, and company privacy policies as part of the registration process. \nAlthough the EU was the original privacy protection leader, many nations on multiple continents have now adopted unique laws restricting the collection of their citizens’ (and residents’) personal information. \n© \"My best business intelligence, in one easy email\" » * - hide Privacy Policy \nJD Supra provides users with access to its legal industry publishing services (the \"Service\") through its website the Website are set forth in this statement (\"Policy\"). By using the Service, you signify your acceptance of this Policy. Information Collection and Use by JD Supra \nJD Supra collects users' names, companies, titles, e-mail address and industry. JD Supra also tracks the pages that users visit, logs IP addresses and aggregates non-personally identifiable user data and browser type. This data is gathered using cookies and other technologies. \nThe information and data collected is used to authenticate users and to send notifications relating to the Service, including email alerts to which users have subscribed; to manage the Service and Website, to improve the Service and to customize the user's experience. This information is also provided to the authors of the content to give them insight into their readership and help them to improve their content, so that it is most useful for our users. \nJD Supra does not sell, rent or otherwise provide your details to third parties, other than to the authors of the content on JD Supra. \nIf you prefer not to enable cookies, you may change your browser settings to disable cookies; however, please note that rejecting cookies while visiting the Website may result in certain parts of the Website not operating correctly or as efficiently as if cookies were allowed. Email Choice/Opt-out \nUsers who opt in to receive emails may choose to no longer receive e-mail updates and newsletters by selecting the \"opt-out of future email\" option in the email they receive from JD Supra or in their JD Supra account management screen. Security \nperform their job functions, such as our third party email service, customer service personnel and technical staff. However, please note that no method of transmitting or storing data is completely secure and we cannot guarantee the security of user information. Unauthorized entry or use, hardware or software failure, and other factors may compromise the security of user information at any time. \nIf you have reason to believe that your interaction with us is no longer secure, you must immediately notify us of the problem by contacting us at . In the unlikely event that we believe that the security of your user information in our possession or control may have been compromised, we may seek to notify you of that development and, if so, will endeavor to do so as promptly as practicable under the circumstances. Sharing and Disclosure of Information JD Supra Collects \nExcept as otherwise described in this privacy statement, JD Supra will not disclose personal information to any third party unless we believe that disclosure is necessary to: (1) comply with applicable laws; (2) respond to governmental inquiries or requests; (3) comply with valid legal process; (4) protect the rights, privacy, safety or property of JD Supra, users of the Service, Website visitors or the public; (5) permit us to pursue available remedies or limit the damages that we may sustain; and (6) enforce our Terms Conditions of Use. \nIn the event there is a change in the corporate structure of JD Supra such as, but not limited to, merger, consolidation, sale, liquidation or transfer of substantial assets, JD Supra may, in its sole discretion, transfer, sell or assign information collected on and through the Service to one or more affiliated or unaffiliated third parties. Links to Other W Contacting JD Supra \ninfo@jdsupra.com", "external_links": [], "published": "2015-10-13T03:21:00.000+03:00", "crawled": "2015-10-13T03:39:48.828+03:00", "highlightTitle": ""}