{"organizations": [], "uuid": "ded93bd97ac00d9b4728c0ac97dd0b60eedc0b0b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.terradaily.com", "main_image": "http://www.spxdaily.com/images-bg/flea-amber-ancestral-strain-bubonic-plague-bg.jpg", "site_section": "http://www.terradaily.com/terradaily.xml", "section_title": "Earth News, Earth Science, Energy Technology, Environment News", "url": "http://www.terradaily.com/reports/Bacteria_in_ancient_flea_may_be_ancestor_of_the_Black_Death_999.html", "country": "US", "title": "Bacteria in ancient flea may be ancestor of the Black Death", "performance_score": 0, "site": "terradaily.com", "participants_count": 0, "title_full": "Bacteria in ancient flea may be ancestor of the Black Death", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T12:33:00.000+03:00", "replies_count": 0, "uuid": "ded93bd97ac00d9b4728c0ac97dd0b60eedc0b0b"}, "author": "", "url": "http://www.terradaily.com/reports/Bacteria_in_ancient_flea_may_be_ancestor_of_the_Black_Death_999.html", "ord_in_thread": 0, "title": "Bacteria in ancient flea may be ancestor of the Black Death", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bacteria in ancient flea may be ancestor of the Black Death by Staff Writers Corvallis OR (SPX) Oct 01, 2015 This flea preserved about 20 million years ago in amber may carry evidence of an ancestral strain of the bubonic plague. Image courtesy George Poinar, Jr. and Oregon State University. For a larger version of this image please go here. \nAbout 20 million years ago a single flea became entombed in amber with tiny bacteria attached to it, providing what researchers believe may be the oldest evidence on Earth of a dreaded and historic killer - an ancient strain of the bubonic plague. \nIf indeed the fossil bacteria are related to plague bacteria, Yersinia pestis, the discovery would show that this scourge, which killed more than half the population of Europe in the 14th century, actually had been around for millions of years before that, traveled around much of the world, and predates the human race. \nFindings on this extraordinary amber fossil have been published in the Journal of Medical Entomology by George Poinar, Jr., an entomology researcher in the College of Science at Oregon State University, and a leading expert on plant and animal life forms found preserved in this semi-precious stone. \nIt can't be determined with certainty that these bacteria, which were attached to the flea's proboscis in a dried droplet and compacted in its rectum, are related to Yersinia pestis, scientists say. But their size, shape and characteristics are consistent with modern forms of those bacteria. They are a coccobacillus bacteria; they are seen in both rod and nearly spherical shapes; and are similar to those of Yersinia pestis. Of the pathogenic bacteria transmitted by fleas today, only Yersinia has such shapes. \n\"Aside from physical characteristics of the fossil bacteria that are similar to plague bacteria, their location in the rectum of the flea is known to occur in modern plague bacteria,\" Poinar said. \"And in this fossil, the presence of similar bacteria in a dried droplet on the proboscis of the flea is consistent with the method of transmission of plague bacteria by modern fleas.\" \nThese findings are in conflict with modern genomic studies indicating that the flea-plague-vertebrate cycle evolved only in the past 20,000 years, rather than 20 million. However, today there are several strains of Yersinia pestis, and there is evidence that past outbreaks of this disease were caused by still different strains, some of which are extinct today. \nWhile human strains of Yersinia could well have evolved some 10,000 to 20,000 years ago, Poinar said, ancient Yersinia strains that evolved as rodent parasites could have appeared long before humans existed. These ancient strains would certainly be extinct by now, he said. \nThe complex mode of transmission of plague is also reflected in the flea seen in this fossil. \nWhen a flea feeds on a plague-infected animal, the Yersinia pestis bacteria taken up with the blood often form a viscous mass in the flea's proventriculus, located between the stomach and esophagus. When this happens, the fleas can't obtain enough blood, and as they attempt to feed again, bacteria are often forced back out through the proboscis and into the wound. \nThis blockage is in part what makes them effective vectors of the plague, and the dried droplets on the proboscis of the fossil flea could represent a sample of the sticky bacterial mass that was regurgitated. \n\"If this is an ancient strain of Yersinia, it would be extraordinary,\" Poinar said. \"It would show that plague is actually an ancient disease that no doubt was infecting and possibly causing some extinction of animals long before any humans existed. Plague may have played a larger role in the past than we imagined.\" \nThe fossil flea originated from amber mines in what is now the Dominican Republic, between Puerto Plata and Santiago. Millions of years ago the area was a tropical moist forest. \nVery few fleas of any type have been found preserved in amber, Poinar said, and none have been reported with associated microorganisms, as in this case. This specimen had some other unique morphological features that indicate it's a species that long ago went extinct. \nBut it was the associated bacteria that fascinated the researchers. \n\"Since the dried droplet with bacteria is still attached to the tip of the proboscis, the flea may have become entrapped in resin shortly after it had fed on an infected animal,\" Poinar said. \"This might have been one of the rodents that occurred in the Dominican amber forest. Rodent hair has been recovered from that amber source.\" \nFlea-like creatures found in conventional stone fossils date back to the time of the dinosaurs, Poinar said, and the role of insects in general, and as carriers of disease, may have played a role in the demise of the ancient reptiles. \nIn 2008, Poinar and his wife, Roberta Poinar, wrote a book \"What Bugged the Dinosaurs? Insects, Disease and Death in the Cretaceous.\" It explored the evolutionary rise of insects around the same time that dinosaurs went extinct. The thesis developed in the book added insect-borne diseases as a likely component, that, along with other biotic and abiotic factors such as climate change, asteroid impacts and volcanic eruptions, led to the extinction of the dinosaurs. Some modern diseases such as leishmaniasis and malaria clearly date to those times. \nBubonic plague in modern times can infect and kill a wide range of animals, in addition to humans. It is still endemic in many countries, including the United States where it's been found in prairie dogs and some other animals. Even though today it is treatable with antibiotics, in the U.S. four people have died from plague so far this year. \nDuring the Middle Ages, however, three phases of the disease - bubonic, septicemic and pneumonic plague - earned a feared reputation. Periodic waves of what was called the Black Death, for the gruesome condition in which it left its victims, swept through Europe and Asia, altogether killing an estimated 75 to 200 million people. \nScholars say that religious, social and economic changes caused by the plague altered the course of world history. .", "external_links": [], "published": "2015-10-01T12:33:00.000+03:00", "crawled": "2015-10-01T16:23:03.953+03:00", "highlightTitle": ""}