{"organizations": [], "uuid": "3570d922b56fe6a5c6e4cb08479a4a86244d1a0a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonexaminer.com", "main_image": "http://cdn.washingtonexaminer.biz/cache/r620-39412a0dcac5c8ff40153e04d279e07b.jpg", "site_section": "http://washingtonexaminer.com/rss/technology", "section_title": "WashingtonExaminer.com RSS - technology", "url": "http://www.washingtonexaminer.com/vw-official-blames-scheme-on-rogue-software-engineers/article/2573689?custom_click=rss", "country": "US", "title": "VW official blames scheme on 'rogue software engineers'", "performance_score": 0, "site": "washingtonexaminer.com", "participants_count": 1, "title_full": "VW official blames scheme on 'rogue software engineers' | Washington Examiner", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T16:00:00.000+03:00", "replies_count": 0, "uuid": "3570d922b56fe6a5c6e4cb08479a4a86244d1a0a"}, "author": "Kyle Feldscher", "url": "http://www.washingtonexaminer.com/vw-official-blames-scheme-on-rogue-software-engineers/article/2573689?custom_click=rss", "ord_in_thread": 0, "title": "VW official blames scheme on 'rogue software engineers'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Rogue software engineers are to blame for the software that has embroiled Volkswagen in a emissions cheating scandal, the company's top U.S. official said Thursday.\nMichael Horn, CEO of Volkswagen in the United States, told Congress that the decision to put 100 million lines of software code into computers in vehicles to cheat emissions tests was not made at the corporate level.\n\"This was not a corporate decision. No board meeting or supervisory meeting has authorized this,\" he said. \"This was a couple of rogue software engineers who put this in for whatever reason.\"\nMore from the Washington Examiner Carson: 'Kudos' to McCarthy for dropping out Carson praised the House majority leader, telling Wolf Blitzer that it was a \"very unselfish move.\"\nBy Al Weaver • 10/08/15 1:44 PM The Environmental Protection Agency is investigating Volkswagen for installing \"defeat devices\" that allow vehicles to skirt emissions tests. The devices allowed popular models, such as the Jetta, to tell when they were undergoing emissions testing.\nThe software could tell if a test was taking place based on the position of the vehicle's steering wheel, the speed the vehicle was traveling, how long the engine was being used and barometric pressure, according to the EPA. The vehicles would reduce emissions of nitrogen oxide during testing and then spew 40 times the legal limit during normal use.\nHorn told the House Energy and Commerce Committee's oversight subcommittee that three Volkswagen employees have been suspended and an investigation into the cheating scheme is ongoing.\nRep. Chris Collins, R-N.Y., said he believed Horn's testimony is a sign of Volkswagen's arrogance and called the response to the scandal inadequate.\n\"I am an engineer and I have a way of thinking. I cannot accept Volkswagen's portrayal as this is something by a couple of rogue software engineers,\" he said.\nAlso from the Washington Examiner Paris train hero in critical condition after stabbing Airman 1st Class Spencer Stone was stabbed \"repeatedly,\" according to a CBS news report.\nBy Jacqueline Klimas • 10/08/15 12:32 PM Volkswagen's engineers are working to fix the software, but Horn said he doesn't know when that will be finished. Once a fix is developed, it will take up to two years to fix all the vehicles affected in the United States.\nHorn disputed reports that he knew about the defeat devices in May 2014, when a West Virginia University study found major discrepancies between the stated emissions of the vehicles and what was actually coming out of them.\nHe said he found out about the defeat devices just days before a Sept. 3 meeting with the Environmental Protection Agency where the government first learned about the cheat.\nHorn said he felt personally deceived by the scandal.\n\"I work 25 years for this company … when I learned this, I'm as touched and moved as anyone,\" he said.\nAlso from the Washington Examiner Boehner may stick around for a while Rep. Darrell Issa says Boehner may be asked to postpone retirement while the GOP scrambles for a leader.\nBy Susan Ferrechio • 10/08/15 1:40 PM Committee members expressed concern about how much dealerships are being hurt by the scandal. The 2016 models of the \"clean diesel\" vehicles cannot be sold in the United States, which is costing some dealerships, according to lawmakers. Rep. Diana DeGette, D-Colo., said she talked to one dealer in Denver who said the \"clean diesel\" vehicles made up 25 percent of his sales.\nHorn said Volkswagen is financially compensating dealerships by making floor space free and making bonus payments to dealerships by waiving requirements. In addition, they are providing a discretionary fund to dealerships, which Horn wouldn't put a dollar figure on.\n\"We get them started and we don't let them dry out in the field,\" he said.\nHorn said he was stunned and saddened by the scandal. There will be a lot of soul searching at the automaker, he said.\n\"Six hundred thousand people worldwide, we have to be managed in a different way,\" he said. \"This is very clear.\"\n ", "external_links": [], "published": "2015-10-08T16:00:00.000+03:00", "crawled": "2015-10-08T21:04:36.464+03:00", "highlightTitle": ""}