{"organizations": [], "uuid": "d7e4773da4a6719de2d4fca00bd552dfd7d3d059", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "", "site_section": "http://www.bloomberg.com/technology", "section_title": "Technology - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-10-19/airport-for-drones-ferrying-e-commerce-goods-planned-for-rwanda", "country": "US", "title": "Airport for Drones Ferrying E-Commerce Goods Planned for Rwanda", "performance_score": 1, "site": "bloomberg.com", "participants_count": 1, "title_full": "Airport for Drones Ferrying E-Commerce Goods Planned for Rwanda - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T12:05:00.000+03:00", "replies_count": 0, "uuid": "d7e4773da4a6719de2d4fca00bd552dfd7d3d059"}, "author": "Helen Nyambura-Mwaura", "url": "http://www.bloomberg.com/news/articles/2015-10-19/airport-for-drones-ferrying-e-commerce-goods-planned-for-rwanda", "ord_in_thread": 0, "title": "Airport for Drones Ferrying E-Commerce Goods Planned for Rwanda", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Rwanda may become the base for a network of so-called droneports for remote-controlled aircraft to deliver urgent cargo to remote parts of the tiny country known as the Land of a Thousand Hills.\nThe project by London-based architecture firm Forster + Partners and Afrotech, an African technology initiative by Swiss research university Ecole Polytechnique Federale de Lausanne, envisages a program that could be replicated across a continent with a lack of adequate transport infrastructure. Africa needs sustained investment of $93 billion a year to fill its infrastructure gaps, according to Africa Development Bank estimates.\n“We want to pioneer ghost railways in the sky,” Jonathan Ledgard, a director at Afrotech, said in an e-mailed response to questions. “Larger loads going longer distances in quiet, beautiful, ultra-cheap craft is a different vision to Amazon’s insect approach of bristling tiny drones carrying small loads short distances.”\nAmazon.com Inc., the world’s largest e-commerce company, has been pressing for permission to deliver packages by drone in the U.S. but has run up against proposed regulations. In April, Amazon received a federal waiver allowing it to run tests in the U.S.\nConstruction of the first droneport in Rwanda, which the unmanned aerial vehicles can use for take offs and landings, may begin in the second half of 2016, Ledgard said. The companies involved in the project are working out regulatory details with civil aviation authorities, Rwanda Development Board Chief Executive Francis Gatare said by phone.\nAfrotech plans to initially deploy three-meter (10-foot) wingspan flying robots capable of conveying 10 kilograms (22 pounds) and then wider machines carrying a payload ten times bigger than that within a decade, according to a statement published on Foster + Partners’ website. Research, development and regulatory work is estimated to cost $6 million annually in the four years it will take to launch the first commercial drone, Ledgard said.\nThe project intends to have three droneports by 2020 creating a network that will cover about half the nation. That will gradually increase to 40 buildings across the country and allow expansion into neighbors such as the Democratic Republic of Congo, according to Foster + Partners. The United Nations already has drones gathering intelligence on rebel groups operating in eastern Congo.\nMAP: Rwanda & Neighors\nThe droneport project plans an urban service for commercial deliveries such as e-commerce goods that will be known as the Blue Line. It will subsidize a separate Red Line network ferrying medical and emergency supplies to remote regions at minimal cost, according to Foster + Partners.\nOnce the technology is proven to be safe, popular and affordable, it will then be easier to expand the service to cover Lake Victoria and Lake Tanganyika, and have flights down major rivers such as the Nile and the Congo, Ledgard said.\nWhile Rwanda’s rugged terrain is a good candidate for the pilot project, it is the nation’s progressive attitude toward advanced technology that lured the consortium, Ledgard said. The country has been positioning itself as a regional technology hub to attract Silicon Valley-type companies and multinationals.\n“Rwanda is not the country of highest need,” Ledgard said. “Remote parts of Angola, say, or Cameroon would have a larger effect, but we need a law code.”", "external_links": [], "published": "2015-10-19T12:05:00.000+03:00", "crawled": "2015-10-19T08:48:44.128+03:00", "highlightTitle": ""}