{"organizations": [], "uuid": "60f754173333370153a8121aabc3823192714ffe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "abcnews.go.com", "main_image": "", "site_section": "http://abcnews.go.com/xmldata/rss?id=79", "section_title": "ABC News: Technology", "url": "http://abcnews.go.com/Technology/wireStory/hawaii-longline-fishermen-allowed-resume-catching-tuna-34486817", "country": "US", "title": "Hawaii Longline Fishermen Allowed to Resume Catching Tuna", "performance_score": 1, "site": "go.com", "participants_count": 1, "title_full": "Hawaii Longline Fishermen Allowed to Resume Catching Tuna - ABC News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "60f754173333370153a8121aabc3823192714ffe"}, "author": "abcNEWS", "url": "http://abcnews.go.com/Technology/wireStory/hawaii-longline-fishermen-allowed-resume-catching-tuna-34486817", "ord_in_thread": 0, "title": "Hawaii Longline Fishermen Allowed to Resume Catching Tuna", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Hawaii fishermen are once again being allowed to catch a prized tuna species in the fleet's most productive fishing grounds west of the islands, sparking criticism that they are adding to overfishing.\nThe National Marine Fisheries Service closed the fishery in early August because Hawaii-based longline fishermen hit an annual bigeye tuna catch limit of about 3,500 metric tons set by international regulators.\nBut the agency on Friday created a rule allowing the fishermen to report up to 1,000 metric tons of bigeye as being caught by the Northern Mariana Islands , which is a U.S. territory. The change allows Hawaii fisherman to catch more bigeye tuna than the maximum set by the Western and Central Pacific Fisheries Commission.\nThe commission, which is an international body that regulates fishing by the U.S., Japan, China and other nations fishing the area, doesn't set limits on the catch of territories.\nThe two-month closure of fishing grounds affected 145 active vessels in the Hawaii longline fleet, said the Western Pacific Regional Fishery Management Council, which develops management plans for U.S. fisheries in Hawaii and other Pacific islands.\n\"Arbitrary quotas not linked to conservation objectives kept our boats tied at the docks,\" Kitty Simonds, the council's executive director, said in a statement. \"The struggling vessels and small businesses they support accumulated millions of dollars in debt each month, causing untold anxiety for our local fishing community and consumers.\"\nEnvironmentalists have sued the fisheries service to stop the attribution of bigeye catch to U.S. territories, arguing it undermines international agreements aimed at eliminating the overfishing of bigeye. The case is pending in federal court in Honolulu.\nDavid Henkin, an attorney for Earthjustice which is representing the plaintiffs in the lawsuit, called the agency's latest decision \"shortsighted.\" He said all developed fisheries — like Hawaii's longline fishery — need to reduce their catch to make sure bigeye is available for future generations.\n\"What the fisheries service has been doing in response to industry pressure is absolutely the wrong thing for consumers who want to have sustainable food, and food to put on the table for their children and their children's children,\" Henkin said. \"And really ultimately it's not the right thing to do for longliners themselves if they want to continue that tradition in their families.\"\nMike Tosatto, Pacific Islands regional administrator for the fisheries service, said the reopening will have a negligible impact on the status of bigeye stock. He said the fisheries service reassesses the catch attribution plan each year to make sure it addresses overfishing.\n\"The fisheries service obviously takes addressing overfishing seriously,\" Tosatto said.\nBigeye stocks in the area are down to about 20 percent of their unfished levels, according to data from the Western and Central Pacific Fisheries Commission.\nScientists advising the commission have warned about bigeye overfishing every year since the international body was established in 2005.\nBigeye is one of two types of tuna known as ahi. The other is yellowfin.\nThe longline fleet supplies a large portion of the ahi consumed in Hawaii, where bigeye is often eaten raw as sashimi and as poke, which is a dish featuring cubed tuna seasoned with soy sauce and other condiments. Bigeye is also frequently cut into steaks and grilled.\nFish landed by the Hawaii fleet is worth about $100 million a year, ranking Honolulu among the nation's top 10 ports in landed value, according to the Western Pacific Regional Fishery Management Council.\n  Hawaii Longline Fishermen Allowed to Resume Catching Tuna \" \nOscar   \n  \n ", "external_links": [], "published": "2015-10-15T03:00:00.000+03:00", "crawled": "2015-10-15T16:17:31.227+03:00", "highlightTitle": ""}