{"organizations": [], "uuid": "a4532c914958455e965633cf2f7774a0009acdb8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usatoday.com", "main_image": "http://www.gannett-cdn.com/-mm-/8daf34e60ad44ee0af167ebc522c024cc9a904d3/c=0-226-4464-2748&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/10/22/USATODAY/USATODAY/635811278014832299-AP-New-Credit-Cards-Subscription-Problems.jpg", "site_section": "http://www.usatoday.com/tech/", "section_title": "Technology and Electronics Reviews - USATODAY.com", "url": "http://www.usatoday.com/story/tech/columnist/komando/2015/10/23/q-why-theres-chip-your-credit-card/74410176/", "country": "US", "title": "Q&A: Why there's a chip on your credit card", "performance_score": 0, "site": "usatoday.com", "participants_count": 0, "title_full": "Q&A: Why there's a chip on your credit card", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T15:49:00.000+03:00", "replies_count": 0, "uuid": "a4532c914958455e965633cf2f7774a0009acdb8"}, "author": "", "url": "http://www.usatoday.com/story/tech/columnist/komando/2015/10/23/q-why-theres-chip-your-credit-card/74410176/", "ord_in_thread": 0, "title": "Q&A: Why there's a chip on your credit card", "locations": ["Philadelphia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Matt Rourke"], "text": "A chip-based credit card is shown in Philadelphia. (Photo: Matt Rourke, AP)\n2 CONNECT 4 TWEET LINKEDIN COMMENT EMAIL MORE Q. My bank just re-issued all my credit and debit cards and the new ones have a chip in them. What's that about?\nA. That chip is a security measure that's been in credit and debit cards around the world for a while now. It's finally arrived in the U.S. in response to the major data breaches that happened at retailers last year. The chip, working with newer model payment systems, creates a unique ID for that transaction. So even if a hacker broke into the retailer's systems, they wouldn't be able to use the information to drain your bank account. This all sounds great, but there are still a few obstacles. Find out why cards with chips aren't as secure as you would hope .\nGet the best price for airline tickets\nQ. I'm buying an airline ticket for Thanksgiving, and I'm worried the price is going to drop after I buy. Should I buy now or wait?\nA. First, head over to Kayak and look up your ticket. Then look at the Price Trend box on the left to see what prices have done historically and what price changes it thinks are coming up. You'll probably see that you should buy now. However, just in case the price does drop after you buy, head over to Yapta. It will keep an eye on ticket prices and alert you if there's enough of a drop to get you a partial refund. Want to save more? Learn two more secrets that help you get the lowest online airfare .\nHow to avoid malicious websites\nQ. I clicked on a link in an email saying I had won an iPad, but the site I went to wanted too much information so I left. Did I make the right decision?\nA. Yes, you were on a malicious site. This is a site hackers set up to trick you into giving away personal information, or to slip viruses onto your system. One key way you can tell is if it asks for information and there's no \"https://\" at the beginning of the Web address. That means the site isn't encrypted and anyone can see the information you're sending. Learn two more ways to tell you're on a malicious website and how to avoid emails that send you there . Also, read to the end to find out how hackers disguise malicious files so you don't spot them until it's too late.\nUpgrade to iOS 9?\nQ. I have an iPhone 6 and I'm wondering if I should take the free upgrade from iOS 8 to iOS 9?\nA. iOS 9 has several features that are worth the upgrade. It uses your hardware more efficiently, so you should see better battery life. Plus it has a Low Power Mode for those times when your battery is running on fumes and you aren't near an outlet. You also get a Siri upgrade that makes it easier to use and lets you change your phone settings with voice commands. Learn more about iOS 9, plus whether you should upgrade to Apple's newest Mac operating system and its latest iPhone .\nWebcam snoopers are real\nQ. I got a webcam so I could chat with my grandson, but now I'm worried about someone using it to snoop on me. Am I just being paranoid?\nA. Creeps do have ways to snoop on webcams in people's houses. In fact, there have been several arrests and court proceedings based around this kind of snooping. One precaution a lot of people take is to unplug or cover the webcam when it isn't in use. You can also avoid the programs that snoopers use, such as RATs or remote access tools. They generally get these on your system by posing as tech support calling about a problem with your computer. If you don't let them in, then they can't do anything. Get the full details on RATs, how to keep snoops from accessing your computer and webcam remotely, and how to deal with other gadgets in your home that have cameras .\nBonus: How safe is that file really?\nQ. I got an email from someone I don't know and there's a picture attached. I'm curious what it is, but don't want a virus. Pictures can't have viruses, right?\nA. They can if it's a disguised malicious file. Files are identified by their extension, which is the three letter \".xyz\" at the end of the file name. Most viruses are going to be \".exe\". However, thanks to a quirk of Windows, hackers can make it look like an image (.jpg), music file (.mp3) or something else. As a rule, you should never download or view unsolicited attachments. Still, find out how to spot a disguised file and change your Windows settings so it's easier to spot them .\nOn the Kim Komando Show , the nation's largest weekend radio talk show, Kim takes calls and dispenses advice on today's digital lifestyle, from smartphones and tablets to online privacy and data hacks. For her daily tips, free newsletters and more, visit her website at Komando.com . Email her at techcomments@usatoday.com .\n2 CONNECT 4 TWEET LINKEDIN //usat.ly/1S0wEvc TOP VIDEOS", "external_links": ["http://www.komando.com/tips/294711/3-ways-to-spot-a-malicious-website", "http://www.gannett-cdn.com/-mm-/86f125525eecdda990b3d8cc57acc07eec0b19bf/c=0-0-3957-2975&r=x404&c=534x401/local/-/media/2015/10/22/USATODAY/USATODAY/635811278014832299-AP-New-Credit-Cards-Subscription-Problems.jpg", "http://www.komando.com/", "http://www.gannett-cdn.com/media/2015/10/22/USATODAY/USATODAY/635811278014832299-AP-New-Credit-Cards-Subscription-Problems.jpg", "http://www.komando.com/tips/250064/3-secrets-to-getting-the-lowest-airfare-online", "http://www.gannett-cdn.com/-mm-/4044b1e7645488621f157de466cf1a990870caa2/r=500x333/local/-/media/2015/10/22/USATODAY/USATODAY/635811278014832299-AP-New-Credit-Cards-Subscription-Problems.jpg", "http://www.komando.com/tips/248604/is-your-webcam-open-to-peeping-toms", "http://usat.ly/1S0wEvc", "http://www.komando.com/tips/11980/how-to-spot-disguised-malicious-files-before-they-infect-your-computer", "http://www.linkedin.com/shareArticle?url=http%3A//usat.ly/1S0wEvc&mini=true", "https://twitter.com/intent/tweet?url=http%3A//usat.ly/1S0wEvc&text=Q%26A%3A%20Why%20there%27s%20a%20chip%20on%20your%20credit%20card&via=usatoday", "http://www.komando.com/tips/328980/why-theres-a-chip-in-your-new-credit-and-debit-cards", "http://www.komando.com/tips/328682/3-easy-upgrades-to-your-apple-gear"], "published": "2015-10-23T15:49:00.000+03:00", "crawled": "2015-10-23T15:15:45.536+03:00", "highlightTitle": ""}