{"organizations": ["ESRI", "Telefonica", "McDonald's Espana", "MicroStrategy Mobile", "APAC", "S.A.", "ING DIRECT Espana", "Facebook", "Caisse d'Epargne", "EMEA", "MicroStrategy Incorporated", "UAF", "Hilton Worldwide", "Weiler Corporation", "Ceva Sante", "Secure Enterprise", "MicroStrategy", "AIG", "Company", "MicroStrategy Desktop", "Ahold", "Securities and Exchange Commission", "MicroStrategy Analytics"], "uuid": "19a4495816c16b8cc4995beb0a37be07de9b03e6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prnewswire.com", "main_image": "http://photos.prnewswire.com/prnvar/20140226/CL73058LOGO", "site_section": "http://www.prnewswire.com/rss/consumer-technology/all-consumer-technology-news.rss", "section_title": "PR Newswire: Consumer Technology", "url": "http://www.prnewswire.com/news-releases/microstrategy-announces-third-quarter-2015-financial-results-300166213.html", "country": "US", "title": "MicroStrategy Announces Third Quarter 2015 Financial Results", "performance_score": 0, "site": "prnewswire.com", "participants_count": 0, "title_full": "MicroStrategy Announces Third Quarter 2015 Financial Results", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T22:05:00.000+02:00", "replies_count": 0, "uuid": "19a4495816c16b8cc4995beb0a37be07de9b03e6"}, "author": "", "url": "http://www.prnewswire.com/news-releases/microstrategy-announces-third-quarter-2015-financial-results-300166213.html", "ord_in_thread": 0, "title": "MicroStrategy Announces Third Quarter 2015 Financial Results", "locations": ["United States", "U.S.", "Va.", "UK", "Lottoland", "Zurich"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Paul Zolfaghari", "Ipsen", "Cassandra", "Tim Lang", "Jonathan Klein"], "text": "MicroStrategy Announces Third Quarter 2015 Financial Results -- TYSONS CORNER, Va., Oct. 26, 2015 /PRNewswire/ -- MicroStrategy Announces Third Quarter 2015 Financial Results 16:05 ET from MicroStrategy Incorporated TYSONS CORNER, Va. , Oct. 26, 2015 /PRNewswire/ -- MicroStrategy® Incorporated (Nasdaq: MSTR ), a leading worldwide provider of enterprise software platforms, today announced financial results for the three-month period ended September 30, 2015 (the third quarter of its 2015 fiscal year). Third quarter 2015 revenues were $129.5 million versus $151.2 million for the third quarter of 2014, a 14% decrease. Product licenses and subscription services revenues for the third quarter of 2015 were $34.1 million versus $40.0 million for the third quarter of 2014, a 15% decrease. Product support revenues for the third quarter of 2015 were $71.4 million versus $75.0 million for the third quarter of 2014, a 5% decrease. Other services revenues for the third quarter of 2015 were $24.1 million versus $36.2 million for the third quarter of 2014, a 33% decrease. Foreign currency headwinds continued to have a negative impact on revenues for the third quarter of 2015. Operating expenses for the third quarter of 2015 were $74.1 million versus $123.2 million for the third quarter of 2014, a 40% decrease. Third quarter 2015 operating expenses included $0.1 million in restructuring costs, as compared to $11.6 million in restructuring costs in the third quarter of 2014. In addition, MicroStrategy did not capitalize any software development costs during the third quarter of 2015, as compared to $2.3 million in software development costs capitalized during the third quarter of 2014. Income from operations for the third quarter of 2015 was $30.7 million , as compared to a loss from operations of $7.0 million for the third quarter of 2014. Net income for the third quarter of 2015 was $23.9 million , or $2.06 per share on a diluted basis, as compared to a net loss of $0.8 million , or $0.07 per share on a diluted basis, for the third quarter of 2014. Non-GAAP income from operations, which excludes share-based compensation expense and restructuring costs, was $35.4 million for the third quarter of 2015 versus $8.5 million for the third quarter of 2014. As of September 30, 2015 , MicroStrategy had cash and cash equivalents and short-term investments of $456.9 million , as compared to $345.5 million as of December 31, 2014 , an increase of $111.4 million . As of September 30, 2015 , MicroStrategy had 9.3 million shares of class A common stock and 2.0 million shares of class B common stock outstanding. The tables at the end of this press release include a reconciliation of income (loss) from operations to non-GAAP income (loss) from operations for the three and nine months ended September 30, 2015 and 2014. An explanation of this non-GAAP measure is also included under the heading \"Non-GAAP Financial Measure\" below. Conference Call MicroStrategy will be discussing its third quarter 2015 financial results on a conference call today beginning at approximately 6:00 p.m. EDT . To access the conference call, dial (844) 824-7425 (domestically) or (716) 220-9429 (internationally) and use conference ID 57551320. A live webcast and replay of the conference call will be available under the \"Events & Presentations\" section on MicroStrategy's investor relations website at http://ir.microstrategy.com/events.cfm . The replay will be available beginning approximately two hours after the call concludes until October 31, 2015 at (855) 859-2056 (domestically) or (404) 537-3406 (internationally) using the passcode 57551320. An archived webcast will also be available under the \"Events & Presentations\" section on MicroStrategy's investor relations website at http://ir.microstrategy.com/events.cfm . MicroStrategy's Worldwide Symposium Series Sets Record Attendance Throughout Q3 of 2015, MicroStrategy's Worldwide Symposium Series events set record attendance on their tour around the globe, demonstrating that business and IT audiences have a keen interest in learning about the powerful capabilities of MicroStrategy 10 Secure Enterprise™. MicroStrategy enthusiasts gathered for keynote presentations, hands-on enterprise data discovery workshops, and live Q&A and networking opportunities with innovators from MicroStrategy's leading customers, partners, and sponsors. More than 4,000 companies and organizations in the U.S., EMEA, and APAC rely on MicroStrategy to make sense of large data volumes, get answers in an instant, build stunning visualizations, and present a single version of the truth — securely, at scale, and on all standard devices. MicroStrategy's customers who presented at the 2015 Symposium Series included AGBAR; Ahold; AIG; Amadeus Travel; Caisse d'Epargne; Carphone; Ceva Sante ; Groupe BPCE; Hilton Worldwide; ING DIRECT Espana; Ipsen; Lottoland; McDonald's Espana; McDonald's UK; O2; Spar; Telefonica, S.A.; Weiler Corporation; and Zurich. MicroStrategy 10.1™ Delivers New Features and Enhancements that Bolster Performance for Enterprise Data Discovery, Analytics, and Mobile In September, MicroStrategy announced the general availability of MicroStrategy 10.1. The release included hundreds of new and improved features and a wide range of performance enhancements across the product platform. Further extending the self-service capabilities of MicroStrategy 10 Secure Enterprise, MicroStrategy Desktop™ 10.1 and MicroStrategy Web™ 10.1 added new enhancements for enterprise data discovery users, enabling data preparation and data wrangling across more data sources, while delivering a clean, new look with modern grid styles, navigation, and consolidated views and search. Other highlights included new capabilities for D3 visualizations, ESRI geospatial visualizations, and iOS 9 within MicroStrategy Mobile™ and custom Mobile Productivity Apps. To learn more about MicroStrategy Analytics™, visit: http://www.microstrategy.com/us/platform/whats-new . The MicroStrategy 10.1 release came shortly after the release of MicroStrategy 10 Secure Enterprise, a groundbreaking enterprise analytics solution that combines traditional business intelligence functionality with data discovery, mobile analytics, and powerful enterprise security. MicroStrategy 10.1 builds on the version 10 foundation with a significant collection of new capabilities in speed, flexibility, and performance. \"Our customer focus has guided the development of MicroStrategy 10.1, helping to ensure that we continue to bring cutting-edge technology to the market,\" said Paul Zolfaghari , President, MicroStrategy Incorporated. \"Our new agile engineering development methods are resulting in new features and enhancements being rolled out to our global customer base on a more frequent basis. We are confident that 10.1 delivers an even higher level of analytics value for organizations and institutions around the world.\" MicroStrategy Connector to Presto Opens Door to Fast, Interactive Analytics for Big Data Exploration In September, MicroStrategy announced that through its optimized Presto Connector, MicroStrategy 10 Secure Enterprise enables organizations with immense amounts of data to run thousands of quick, interactive analytic queries against multiple data stores. Developed by Facebook, Presto is an open source distributed SQL query engine for running interactive analytic queries against data sources of all sizes ranging from gigabytes to petabytes. \"The impact of having a JDBC connector to Presto is huge for the analytics community,\" said Tim Lang , Senior Executive Vice President and Chief Technology Officer, MicroStrategy Incorporated. \"MicroStrategy 10 Secure Enterprise's optimized Presto Connector empowers our Big Data customers to query into their data quickly, interactively, at petabyte scale. It enables users to query and explore their immense amounts of data, sometimes spread across multiple data sources, without performance constraints. Having this connector in MicroStrategy Desktop and Web opens the door to build quick analytics for the masses who typically access Presto pragmatically and dump results in files or databases to connect with additional visualization tools.\" Targeted at analysts who expect fast interactive response times, Presto allows querying data where it lives, including Hive, Cassandra, relational databases or even proprietary data stores. A single Presto query can combine data from multiple sources, and Presto supports data exploration across an entire organization. Presto breaks the false choice between having fast analytics using an expensive commercial solution or using a slow \"free\" solution that requires excessive hardware. Usher™ Achieves FIDO Alliance Certification for its Innovative Enterprise Mobile Security Solution In August, Usher, MicroStrategy's advanced enterprise security solution that is designed to replace vulnerable security measures such as passwords and keycards, was certified by The FIDO (Fast IDentity Online) Alliance . Usher passed a rigorous series of tests that measure compliance with the FIDO Universal Authentication Framework (UAF) and confirm interoperability with other FIDO Certified products and services that support FIDO 1.0 specifications. \"Achieving FIDO certification demonstrates MicroStrategy's dedication to providing our customers and the marketplace with an innovative mobile security solution that ends the password nightmare,\" said Jonathan Klein , President, MicroStrategy Incorporated. \"Our customers can now use Usher to adopt the FIDO UAF standard in a matter of minutes—quickly making great improvements to their security. We encourage governments, businesses, and organizations to move beyond the antiquated password model and try out Usher's robust and secure multi-factor authentication solution.\" Non-GAAP Financial Measure MicroStrategy is providing a supplemental financial measure for income from continuing operations that excludes the impact of share-based compensation arrangements and restructuring activities. This financial measure is not a measurement of financial performance under generally accepted accounting principles in the United States (\"GAAP\") and, as a result, this financial measure may not be comparable to similarly titled measures of other companies. Management uses this non-GAAP financial measure internally to help understand, manage, and evaluate business performance and to help make operating decisions. MicroStrategy believes that this non-GAAP financial measure is also useful to investors and analysts in comparing its performance across reporting periods on a consistent basis because it excludes a significant non-cash share-based compensation expense that MicroStrategy believes is not reflective of its general business performance and significant restructuring charges that we believe are not reflective of ongoing operating results. In addition, accounting for share-based compensation arrangements requires significant management judgment and the resulting expense could vary significantly in comparison to other companies. Therefore, MicroStrategy believes the use of this non-GAAP financial measure can also facilitate comparison of MicroStrategy's operating results to those of its competitors. About MicroStrategy Incorporated Founded in 1989, MicroStrategy (Nasdaq: MSTR ) is a leading worldwide provider of enterprise software platforms. The Company's mission is to provide enterprise analytics, mobility, and security platforms that are flexible, powerful, scalable, and user-friendly. To learn more, visit MicroStrategy online, and follow us on Facebook and Twitter . MicroStrategy, MicroStrategy 10, MicroStrategy 10 Secure Enterprise, MicroStrategy 10.1, MicroStrategy Mobile, MicroStrategy Analytics, MicroStrategy Desktop, MicroStrategy Web, and Usher are either trademarks or registered trademarks of MicroStrategy Incorporated in the United States and certain other countries. Other product and company names mentioned herein may be the trademarks of their respective owners. This press release may include statements that may constitute \"forward-looking statements,\" including estimates of future business prospects or financial results and statements containing the words \"believe,\" \"estimate,\" \"project,\" \"expect,\" or similar expressions. Forward-looking statements inherently involve risks and uncertainties that could cause actual results of MicroStrategy Incorporated and its subsidiaries (collectively, the \"Company\") to differ materially from the forward-looking statements. Factors that could contribute to such differences include: the extent and timing of market acceptance of MicroStrategy's new offerings, including MicroStrategy 10 Secure Enterprise; the impact on our business of the restructuring plan we adopted in the third quarter of 2014; the Company's ability to recognize revenue or deferred revenue through delivery of products or satisfactory performance of services; continued acceptance of the Company's other products in the marketplace; fluctuations in tax benefits or provisions; the timing of significant orders; delays in or the inability of the Company to develop or ship new products; competitive factors; general economic conditions, including economic uncertainty in the retail industry, in which the Company has a significant number of customers; currency fluctuations; and other risks detailed in the Company's registration statements and periodic reports filed with the Securities and Exchange Commission. By making these forward-looking statements, the Company undertakes no obligation to update these statements for revisions or changes after the date of this release. MSTR-F", "external_links": [], "published": "2015-10-26T22:05:00.000+02:00", "crawled": "2015-10-26T22:29:40.674+02:00", "highlightTitle": ""}