{"organizations": [], "uuid": "8a2852176d90020ea9d07ee84c0ff76f0b473508", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "medicalxpress.com", "main_image": "http://img.medicalxpress.com/newman/gfx/news/2015/patientsreas.jpg", "site_section": "http://medicalxpress.com/rss-feed/health-news/", "section_title": "Health News - Health, Health Technology", "url": "http://medicalxpress.com/news/2015-10-patients-er-differ.html", "country": "US", "title": "Patients' reasons for returning to ER differ from predicted", "performance_score": 0, "site": "medicalxpress.com", "participants_count": 0, "title_full": "Patients' reasons for returning to ER differ from predicted", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T21:50:00.000+03:00", "replies_count": 0, "uuid": "8a2852176d90020ea9d07ee84c0ff76f0b473508"}, "author": "", "url": "http://medicalxpress.com/news/2015-10-patients-er-differ.html", "ord_in_thread": 0, "title": "Patients' reasons for returning to ER differ from predicted", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Patients' reasons for returning to ER differ from predicted October 23, 2015 \n(HealthDay)—Patients' reasons for returning to the emergency department after discharge from an internal medicine unit include being discharged too soon and feeling weak, and these reasons differ from those predicted by the liaison nurse clinician's evaluation, according to a study published online Oct. 14 in the Journal of Clinical Nursing . \nMolywan Vat, R.N., from McGill University in Montreal, and colleagues conducted a qualitative, descriptive study to examine the reasons for returning to the emergency department soon after discharge from an internal medicine unit. They compared eight patients' reasons with data from the liaison nurse clinician's risk assessment tools used for discharge planning. \nThe researchers found that for most patients, being discharged too soon, feeling weak at discharge, having limited help at home with managing chronic illness , and inadequate discharge instructions accounted for the return to the emergency department . There was a difference between the participants' reasons for returning and those predicted by the liaison nurse clinician's evaluation. \n\"The findings suggest that health care professionals should adopt a standardized process to evaluate several components of the patients' health status before their discharge, such as physical autonomy, remission of symptoms and the patients' ability to manage their care,\" the authors write. Discharged patients return to the ER because 'better safe than sorry' September 2, 2014 \nPatients who return to the emergency department within a few days of discharge do so principally because they are anxious about their symptoms and have lost trust in other parts of the health care system, according to the ... Nurse follow-up by phone cuts problems post orthopedic Sx March 4, 2015 \n(HealthDay)—A program of phone follow-up by nurses can reduce problems that discharged patients may experience after undergoing orthopedic surgery, according to research published online Feb. 23 in the Journal of Clinical ... Patient status at ICU discharge, not timing, predicts survival March 19, 2015 \n(HealthDay)—For patients discharged from the intensive care unit (ICU), patient status, particularly the presence of limitations of medical therapy (LOMT) orders, strongly predicts mortality, according to a study published ... Risk factors can ID patients more likely to be readmitted August 19, 2015 \n(HealthDay)—Patients at greatest risk for an unplanned hospital readmission include those with chronic cardiovascular and pulmonary diseases, those discharged on Fridays, and those with a high number of previous emergency ... New clinical standards for emergency nurse practitioners August 19, 2015 \nDr Jane O'Connell, Australia's first endorsed nurse practitioner specialising in emergency care, is leading the way in re-defining the role specialty nurse practitioners play in the health system. Advances made against the deadly infection complication, sepsis October 21, 2015 \nSepsis is an inflammatory response to infection that's known to develop in hospital settings and can turn deadly when it's not discovered early on. In a new study, a hospital surveillance program focusing on reducing the ... Recommended for you Mediterranean diet may keep your mind healthier in old age October 21, 2015 \n(HealthDay)—In news that sounds a bit like it came straight from a sci-fi thriller, researchers say that eating too much meat might shrink your brain. Sitting no worse for health than standing, UK study claims October 12, 2015 \nSitting down is no worse for you than standing up as long as you take regular exercise, a British study said Monday, casting doubt on the health benefits of sit-stand work stations. Red wine with dinner can improve cardiovascular health of people with type 2 diabetes October 12, 2015 \nA glass of red wine every night may help people with type 2 diabetes manage their cholesterol and cardiac health, according to new findings from a two-year randomized controlled trial (RCT) led by researchers at Ben-Gurion ... Children born in the summer more likely to be healthy adults October 12, 2015 \nWomen who were born in the summer are more likely to be healthy adults, suggests new research published in the journal Heliyon. The authors of the study, which involved almost half a million people in the UK, say more sunlight ... Data scientists find connections between birth month and health June 8, 2015 \nColumbia University scientists have developed a computational method to investigate the relationship between birth month and disease risk. The researchers used this algorithm to examine New York City medical databases and ...", "external_links": [], "published": "2015-10-23T21:50:00.000+03:00", "crawled": "2015-10-25T06:40:49.460+02:00", "highlightTitle": ""}