{"organizations": ["NSA", "Islamic State", "Rogers", "Information Technology and Innovation Foundation", "Wall Street Journal Digital", "Apple", "Bloomberg", "National Security Agency"], "uuid": "1afecb1716563ffddf982736dd9a81ee783ece82", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "cio.economictimes.indiatimes.com", "main_image": "http://economictimes.indiatimes.com/photo/Apple-CEO-Tim-Cook-defends-encryption/49483008.cms", "site_section": "http://cio.economictimes.indiatimes.com/rss/recentstories", "section_title": "Latest Information Technology News | Latest IT Industry News, Information and Updates: ET CIO : ETCIO.com", "url": "http://cio.economictimes.indiatimes.com/news/digital-security/apple-ceo-tim-cook-defends-encryption/49483008", "country": "IN", "title": "Apple CEO Tim Cook defends encryption", "performance_score": 0, "site": "indiatimes.com", "participants_count": 0, "title_full": "Apple CEO Tim Cook defends encryption", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T15:28:00.000+03:00", "replies_count": 0, "uuid": "1afecb1716563ffddf982736dd9a81ee783ece82"}, "author": "", "url": "http://cio.economictimes.indiatimes.com/news/digital-security/apple-ceo-tim-cook-defends-encryption/49483008", "ord_in_thread": 0, "title": "Apple CEO Tim Cook defends encryption", "locations": ["California", "US", "Laguna Beach"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Rogers", "Cook", "Tim Cook", "Michael Rogers"], "text": "#Apple CEO Apple CEO Tim Cook defends encryption Apple's CEO and the director of the National Security Agency squared off in a debate over how much access technology companies should afford US intelligence agencies. Bloomberg | 21 October 2015, 5:58 PM IST Follow ETCIO Share Apple's chief executive officer and the director of the National Security Agency squared off in a debate over how much access technology companies should afford US intelligence agencies.Apple CEO Tim Cook asserted his opposition to back doors in data encryption meant to allow intelligence agencies to sneak through, minutes after NSA director Admiral Michael Rogers acknowledged a balance that needed to be struck between safeguarding user privacy and an ability to identify security threats.Law enforcement and intelligence agencies have argued that access to private data is essential for national security and fighting crime. Technology companies oppose so-called back doors because it compromises user information and may jeopardize their businesses.\"You can't have a back door in the software because you can't have a back door that's only for the good guys,\" Cook said at the Wall Street Journal Digital Live technology conference in Laguna Beach, California, speaking just after Rogers' on-stage interview.Revelations about US government surveillance programs have spurred an international backlash that may cost US technology companies an estimated $35 billion in lost sales and contracts by 2016, according to a June 9 report by the Information Technology and Innovation Foundation. Best interests On Monday, Rogers said \"strong encryption is in our nation's best interest.\" Asked at the conference whether he supported impenetrable encryption, Rogers replied: \"That's not what I said, strong encryption is in our nation's best interests.\"\"Security, encryption: Good. The ability to generate insights as to criminal behavior and threats to our nation's security, also good,\" he added.Taking the stage before Cook, Rogers also said that a cyberattack that hits critical infrastructure was \"only a matter of when.\"\"It's only a matter of time I believe until someone does something destructive,\" Rogers said. He said he worried that the Islamic State could begin to view cyberattacks as a \"weapons system.\" The Constitution Both Rogers and Cook discussed how to balance privacy and state-enforced security. The NSA director acknowledged the tension between the two while emphasizing threats he believed the US faced. Cook said there wasn't a trade-off to be made.\"Nobody should have to decide privacy and security. We should be smart enough to do both,\" Cook told the conference, calling any compromise a \"cop-out.\"\"Both of these things were essential parts of our Constitution. It didn't say prioritize this one above all of these,\" he said. \"I mean, these guys were really smart folks and they held all of these things and said all of these are what it means to be an American.\"And privacy would become increasingly important to consumers over time, Cook added.\"It will become increasingly more important to more and more people over time as they realize that intimate parts of their lives are in the open and being used for all sorts of things,\" Cook said.", "external_links": [], "published": "2015-10-21T15:28:00.000+03:00", "crawled": "2015-10-22T05:12:29.906+03:00", "highlightTitle": ""}