{"organizations": ["Pinney Associates", "Inc"], "uuid": "c23dd22ad8135fdfb16b112b8bbd69fddb316181", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bio-medicine.org", "main_image": "", "site_section": "http://www.bio-medicine.org/inc/biomed/medicine-technology.asp", "section_title": "Latest Medical Technology from Bio-Medicine.Org", "url": "http://www.bio-medicine.org/medicine-technology-1/Pinney-Associates--Inc--Welcomes-Dr--Michael-Hufford--Expert-in-Drug-Development-and-Behavioral-Science-49052-1/", "country": "US", "title": "Pinney Associates, Inc. Welcomes Dr. Michael Hufford, Expert in Drug Development and Behavioral Science", "performance_score": 0, "site": "bio-medicine.org", "participants_count": 0, "title_full": "Pinney Associates, Inc. Welcomes Dr. Michael Hufford, Expert in Drug Development and Behavioral Science", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T17:09:00.000+03:00", "replies_count": 0, "uuid": "c23dd22ad8135fdfb16b112b8bbd69fddb316181"}, "author": "", "url": "http://www.bio-medicine.org/medicine-technology-1/Pinney-Associates--Inc--Welcomes-Dr--Michael-Hufford--Expert-in-Drug-Development-and-Behavioral-Science-49052-1/", "ord_in_thread": 0, "title": "Pinney Associates, Inc. Welcomes Dr. Michael Hufford, Expert in Drug Development and Behavioral Science", "locations": ["BETHESDA"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hufford", "Michael Hufford"], "text": "RSS Navigation Links HOME >> MEDICINE >> TECHNOLOGY Pinney Associates, Inc. Welcomes Dr. Michael Hufford, Expert in Drug Development and Behavioral Science ... BETHESDA Md. Oct. 19 2015 /-... Michael Hufford's drug and device develo...Dr. Hufford's drug development experience includes serving as Cypress ...An entrepreneur Dr. Hufford co-founded multiple pharmaceutical devic... http://feeds.bio-medicine.org/latest-medical-technology Date:10/19/2015 \nBETHESDA, Md. , Oct. 19, 2015 /PRNewswire/ --- Pinney Associates , Inc. is pleased to welcome Michael Hufford , PhD, as Vice President for Regulatory Affairs, Behavioral Science, and Innovation. Dr. Hufford has more than 20 years of experience in clinical research, drug and medical device development, and behavioral science. \n\" Michael Hufford's drug and device development experience across a wide range of therapeutic areas strengthens our already robust team,\" said Joe Gitchell , President of PinneyAssociates, a science-based health consulting firm with unique resources and broad experience in scientific, medical, public health, regulatory and commercial aspects of prescription and consumer healthcare products. \"He brings an energy and commitment to creative problem-solving that our clients require in today's regulatory environment.\" \nDr. Hufford's drug development experience includes serving as Cypress Bioscience's Vice President of Corporate and Clinical Development, where he had responsibility for development of the drug and medical device portfolio for multiple CNS assets, including the FDA approval of Savella (milnacipran) for fibromyalgia. Before joining Cypress, he worked at Amylin Pharmaceuticals, leading drug development teams focused on orphan drug development for rare metabolic diseases, and combination peptide and protein therapies for obesity. Dr. Hufford has also consulted extensively with the pharmaceutical industry, including serving as Vice President of Scientific Affairs at invivodata, where he was responsible for scientific consulting on patient-reported outcome claim construction for more than 50 drug development programs. He also served as Chief Operating Officer for NeuroCog Trials, which specializes in providing clinical and neurocognitive assessment, experimental design and data analysis services for clinical trials. \nAn entrepreneur, Dr. Hufford co-founded multiple pharmaceutical, device, and mobile health companies. He is the co-founder of NQ Oncology, a clinical stage oncology drug company. He also co-founded and served as Chief Medical Officer of e-Nicotine Technology, a device company committed to reducing the harms associated with combustible tobacco products. He was also the co-founder and Chief Executive Officer of MindApps, a company that provides mobile electronic Cognitive Behavioral Therapy applications focusing on major depressive disorder, anxiety disorders, and PTSD. \nA graduate of Purdue University, Dr. Hufford earned his Master's and Doctoral degrees in Clinical Psychology from the University of Pittsburgh, where his research focused on smoking and other addictive behaviors. He completed his clinical internship at the McLean Hospital, where he was a Clinical and Research Fellow in the Department of Psychiatry at Harvard Medical School. He has more than 100 peer-reviewed publications, presentations and patents. \nPinneyAssociates' scientists include internationally respected leaders in the intersection of public health, behavioral science, and drugs. We help our clients to manage issues and enhance the scientific and policy environments to gain regulatory approval of, and maximize acceptance of, pharmaceutical and consumer healthcare products. PinneyAssociates' experts have extensive expertise and experience in medicines with abuse potential, Rx-to-OTC Switch and consumer healthcare products. \nFor more information, please visit the Pinney Associates website, at www.pinneyassociates.com . '/>\"/>", "external_links": [], "published": "2015-10-19T17:09:00.000+03:00", "crawled": "2015-10-19T20:36:48.966+03:00", "highlightTitle": ""}