{"organizations": [], "uuid": "96ab0922787315f9d2b13173f9b67f771f97b489", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "techxplore.com", "main_image": "http://img.techxplore.com/newman/gfx/news/2015/finlandteams.jpg", "site_section": "http://www.physorg.com/rss-feed/", "section_title": "Phys.org - latest science and technology news stories", "url": "http://techxplore.com/news/2015-10-finland-team-collaborative-device-farewell.html", "country": "US", "title": "Finland team's collaborative device could spark farewell to PCs", "performance_score": 0, "site": "techxplore.com", "participants_count": 0, "title_full": "Finland team's collaborative device could spark farewell to PCs", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T12:07:00.000+03:00", "replies_count": 0, "uuid": "96ab0922787315f9d2b13173f9b67f771f97b489"}, "author": "", "url": "http://techxplore.com/news/2015-10-finland-team-collaborative-device-farewell.html", "ord_in_thread": 0, "title": "Finland team's collaborative device could spark farewell to PCs", "locations": ["Finland"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Nancy Owano"], "text": "Finland team's collaborative device could spark farewell to PCs October 23, 2015 by Nancy Owano weblog \nThink of PC as standing for an innovative pocket computer not personal computer. This is a made-in-Finland computing rethink called Solu, now up on Kickstarter seeking funds. \nIt's a tiny box, made out of wood, that serves as a pocket computer which you can use independently but it can also be connected up to a screen at the office, becoming your full blown desktop computer. Softpedia 's Marius Nestor said they are using a Linux kernel based operating system, the SoluOS. \nNorth America technology reporter for the BBC, Dave Lee, reported on this attempt from Helsinki-based Solu Machines to reinvent the PC. \nComputing power is packed into the small touchscreen device. \"It can be hooked up to a bigger display at which point the handheld device is used as a controller. Various gestures - swiping, tapping, pinching - are used to control what happens on the bigger screen,\" said Lee. \nTypical folders become a thing of the past. The Solu software does away with many of the conventions we're used to in home computing. Taking the place of folders is an interface that Lee said \"looks like a mind map.\" \nProjects and ideas are grouped in orbs and clusters. The team decided to design it that way to create better focus. Forget about emailing documents back and forth. The system has been designed around social networking and collaboration. Solu uses cloud computing to help people work together on documents. Content is automatically stored in a multi-GB local cache of the Solu cloud. \nNestor provided a concise list of the tech specs. These include: NVIDIA 4-Plus-1 Quad-Core ARM Cortex-A15 CPU running at 2.3Ghz, NVIDIA Kepler GPU with 192 NVIDIA CUDA cores, 4GB LPDDR3 RAM, 32GB cache capacity, 1440x1440 with 450ppi display, USB Type C port, 1200mAh battery, s Bluetooth 4.0 and dual-band 2x2 MIMO Wi-Fi (802.11a/b/g/n) connectivity . \nWhat's the price for all this? They are to adopt a business model where customers pay for the software as a monthly subscription. Their current plan is such that the monthly fee would be about $22 to $23). Developers will get a slice of that fee if their program is used. Lee said, \"Think Spotify, but for software .\" \nThe team on their campaign page described the model as computer-as-a-service. \"For a fixed monthly fee, you, as a Solu user, get all the storage and apps you need, without any annoying in-app purchases or advertisements.\" \nAs for the Kickstarter price listing, the computer device Solu and charger costs about $398 and includes a three-month subscription. Estimated delivery is May 2016. \nNot everyone thinks the cloud-linked Solu is to change the personal computing landscape overnight. Lee said, \"The software subscription service is nice, but there's no word on whether major developers actually want to do business on Solu's terms.\" \nDmitri Sarle in ArcticStartup , a technology blog, remarked: \"To make it happen is a huge task and although we loved the initial demo, it is still difficult to imagine how exactly they will be able to pull it off. After all, they are going after the biggest companies in the world with a minuscule budget in comparison. Not only that, but we already have most of our data on the other platforms and switching might be difficult. They need to shift mindsets and that is not an easy task.\" \nNonetheless, Kristoffer Lawson, CEO and founder , has no illusions of instant acceptance for the concept. \"There will be people who will resist Solu; there will be people who disagree with what we are doing.\" \nThey have a $189,658 showing of pledges at the time of this writing with 22 days to go. Their goal: $227,812.", "external_links": [], "published": "2015-10-23T12:07:00.000+03:00", "crawled": "2015-10-23T12:11:04.255+03:00", "highlightTitle": ""}