{"organizations": [], "uuid": "bd711a698d1ec69e3c6b799509c0705630f5e3b8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.govtech.com", "main_image": "", "site_section": "http://www.govtech.com/rss/app_rss", "section_title": "Government Technology", "url": "http://www.govtech.com/fs/Smarter-Road-Weather-Sensor-Networks-Offer-Better-Safety-Forecasting.html", "country": "US", "title": "Smarter Road Weather Sensor Networks Offer Better Safety, Forecasting", "performance_score": 0, "site": "govtech.com", "participants_count": 1, "title_full": "Smarter Road Weather Sensor Networks Offer Better Safety, Forecasting", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T13:00:00.000+03:00", "replies_count": 0, "uuid": "bd711a698d1ec69e3c6b799509c0705630f5e3b8"}, "author": "Ben Miller", "url": "http://www.govtech.com/fs/Smarter-Road-Weather-Sensor-Networks-Offer-Better-Safety-Forecasting.html", "ord_in_thread": 0, "title": "Smarter Road Weather Sensor Networks Offer Better Safety, Forecasting", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Smarter Road Weather Sensor Networks Offer Better Safety, Forecasting Pennsylvania is installing high-quality roadside sensors that can help guide road safety efforts. by Ben Miller / October 16, 2015 A roadside sensor tower in Idaho watches for inclement weather and road conditions. Vaisala \nAfter a couple of decades with one of the oldest road weather sensor networks in the U.S., Pennsylvania is once again looking to jump ahead of the curve on technology meant to reduce accidents in bad weather. And that move, now a trend among states, is emblematic of a broader shift to bring new data and much broader insights into what the weather is doing at any given moment. \nIt used to be that state departments of transportation installed little hockey puck-like discs -- sensors that transmitted information through dial-up connections -- directly into the asphalt of roads. These days, states like Pennsylvania are augmenting those in-road sensors with roadside towers that can provide better information. Using lasers, heat sensors and other equipment, Pennsylvania’s new system will reveal things like the friction level on the roads. The network will consist of 64 stations, about half of which don’t involve any sensors placed directly into the roadway. \nThat system, set up by Vaisala, allows the state to better assess road conditions, which makes for better decision-making about how to treat the roads. RELATED Lexington, Ky., Assesses Road Conditions Using High-Tech SUVs \n“The new technology that Vaisala provides has the ability to monitor the friction of the pavement and it communicates with … GPS units in the trucks so that we can monitor our salt usage rates in real time and adjust our application rates in real time,” said Daryl St. Clair, chief of maintenance for the Pennsylvania Department of Transportation. \nThat means faster, more efficient safety improvements on the roads. Vaisala documented the safety benefits of enhanced road weather information systems (RWIS) after it installed a similar network in Idaho. The resulting report showed that accidents in the state dropped 10.1 percent after the installation of the RWIS despite a 33 percent increase in snowfall. Adjusting for snow, Vaisala and the Idaho Transportation Department theorized that the installation of the system prevented 2,366 crashes, 21 fatalities and nearly $240 million per year in property damage, injury and litigation costs. \nImproving technology also means a better warning system in the state, for the traveling public as well as for the people responsible for road safety. \n“Let’s say you have a storm that’s traveling from west to east, and let’s say we have a county that’s right on the border of Ohio and Pennsylvania, and we’re experiencing freezing road conditions,” St. Clair said. “Our [system] will send a message a couple of counties over saying, ‘Hey, there are freezing road conditions a couple counties west of you, you might want to get out and treat your roads so you don’t experience the same type of freezing conditions in your county.’” \nBecause the towers are on the side of the road, the DOT can also save money on maintenance, according to Vaisala Head of Transportation Marketing Jon Tarleton. \n“It’s easier to maintain, it’s safer for the maintenance person to repair … instead of having to do lane closures [or] traffic control,” Tarleton said. “And then every time you do an overlay, put on new asphalt, the sensor is essentially destroyed.” \nThough the technology in the new system might be among the best in the U.S., Pennsylvania is far from the only state to latch onto the trend of high-quality RWIS. According to Steve Pritchett, project lead for the National Weather Service’s Meteorological Assimilation Data Ingest System , many states started installing RWIS systems around the turn of the century. \nUsing MADIS, that information becomes even more useful to people both in and outside the states RWIS networks are installed in. MADIS takes both National Oceanic and Atmospheric Administration (NOAA) and non-NOAA data such as the Pennsylvania RWIS and offers the information to meteorologists and the general public. By allowing access to multiple datasets, system users can get a much clearer picture of what the weather is doing in any given area. \nRWIS networks in particular add a valuable dimension: surface data. Much of the information in MADIS is from sources like satellites, weather balloons and commercial airlines that share data from plane sensors. But all of that provides above-ground information. The in-road and roadside sensors allow meteorologists a look at what’s happening below all the flying objects. \n“This ground-level road information is all new technology, and it certainly enhances safety for the general public and it provides our forecasters that much better initialization data for developing their forecasts,” Pritchett said. \nIn the future, that data only promises to get better. Not only are states like Pennsylvania upgrading their RWIS networks, but there are also projects under way to add entirely new datasets to the asset base available to meteorologists. The Federal Highway Administration is experimenting with the idea of tapping into car sensors to add even more granular data to meteorological information sets. \n“If every car on [Interstate] 495 turns on their windshield wipers, one might assume that there’s precip occurring of some type,” Pritchett. “And if you were then able to access those cars’ temperature readings, you could then know — OK, it’s 70 degrees so it’s probably not snow, it’s likely rain.” Ben Miller | Staff Writer \nBen Miller is a staff writer for Government Technology and FutureStructure . His reporting experience includes breaking news, business, community features and technical subjects. He holds a Bachelor’s degree in journalism from the Reynolds School of Journalism at the University of Nevada, Reno, and lives in Sacramento, Calif. RELATED STORIES", "external_links": [], "published": "2015-10-16T13:00:00.000+03:00", "crawled": "2015-10-17T10:03:25.552+03:00", "highlightTitle": ""}