{"organizations": [], "uuid": "27ba16de3eff3760ae36110b94800aa3e6930e51", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/278881/technology", "section_title": "Technology - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30245563/mark-systems-unveils-over-600-system-enhancements-in-2015", "country": "US", "title": "Mark Systems Unveils over 600 System Enhancements in 2015", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Mark Systems Unveils over 600 System Enhancements in 2015 - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T11:46:00.000+03:00", "replies_count": 0, "uuid": "27ba16de3eff3760ae36110b94800aa3e6930e51"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30245563/mark-systems-unveils-over-600-system-enhancements-in-2015", "ord_in_thread": 0, "title": "Mark Systems Unveils over 600 System Enhancements in 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "For over 16 years Mark Systems has held Executive Roundtable meetings where they review top enhancements suggestions from customers.\n MT. HOLLY, NJ, October 13, At their 2015 Executive Roundtable , Mark Systems debuted over 600 separate system enhancements to their clients in attendance.\nFor over 16 years Mark Systems has held Executive Roundtable meetings where they review top enhancements suggestions from customers. These suggestions are then reviewed and prioritized quarterly by the Mark Systems executive team before making their way into product development. In fact, IHMS product development has been customer driven for over 30 years!\n\"2015 was once again a year of significant new development in virtually every aspect of Mark Systems' IHMS (Integrated Homebuilder Management System). As of September 1st, we've completed over 600 system enhancements, including 104 major new features, and 38 custom modules,\" said Don Scattergood, Vice President of Mark Systems.\nThese enhancements include:\nQuickBuild Reporting - A native report writer within IHMS that contains built-in views of the data, and allows users to easily create, save and modify custom reports.\nAdded Sizing Capability for High Definition Monitors - Lets users change the size of all IHMS screens with one scaling selection.\nPhoto Upload to VPO from any Device - Allows superintendents to attach a photo from their phone or tablet when creating a Variance Purchase Order (VPO). This technology will be extended into other areas (ie. home owner progress photos) in upcoming releases.\nA/P Invoice Import - This major enhancement allows the generation and maintenance of Accounts Payable invoices in Excel for import into A/P Data Entry. Similar to the Journal Entry Import process, it allows accounting departments to process large numbers of invoices quickly and accurately.\nDashboards - One of the initiatives that began in 2015 is a drive to deliver visual metrics based on the data within IHMS. Part of that process is the development of functional dashboards across the system, including Job Cost Variance, Sales Performance, and Warranty.\nMenu Search - allows users to type in any part of a program, process, or report name from the main IHMS menu and go right to that module without stepping through the menu system.\nMark Systems also announced they are increasing the volume of new features and enhancements to IHMS in 2016. In an extended effort to release a superior product to customers in a timely manner, Vincent Christiani transitioned from the Consulting and Support Department to Quality Assurance and Testing.\n\"The goal is for Vinny to use his IHMS experience and customer feedback to focus on system regression testing. We believe this will allow us to maintain the industry leading quality of IHMS and expedite the delivery of custom tasks and system enhancements,\" said Robert Cain, Vice President of Consulting Services.\nAbout Mark Systems\nMark Systems' Integrated Homebuilder Management System (IHMS) is the industry's only single-database, enterprise wide home builder software suite.\nNo other home builder software offers the power, flexibility, ease of use, and return on investment like IHMS. The premier residential construction accounting software on the market today, IHMS combines a proven track record of performance with cutting edge technology to provide the financial control today's tough business climate demands.\nOffering support for every home building activity, IHMS delivers full back-office and field operations functions directly to the desktop of every person in the building process.\nMark Systems' single-database architecture means that residential construction information is delivered instantly and transparently to every team member. Purchasing , scheduling , field operations , trade partners , sales office , and design center personnel all effortlessly share critical information.\nFor more information contact Kayla Ware at 609.702.9901 x124, email us at Info@MarkSystemsUSA.com , or visit us online at MarkSystemsUSA.com .\n release/mark-systems-unveils-over-600-system-enhancements-in-2015-414083.php", "external_links": ["http://www.marksystemsusa.com/ihms-components/sales-office-and-design-center/sales-a-customer-relationship-management.html", "http://purl.org/rss/1.0/modules/content/", "http://www.24-7pressrelease.com/press-release/mark-systems-unveils-over-600-system-enhancements-in-2015-414083.php", "http://www.marksystemsusa.com/ihms-components/internet-toolkit-itk/trade-partner-portal.html", "http://www.marksystemsusa.com/ihms-components/residential-construction-scheduling-software.html", "http://www.marksystemsusa.com/ihms-components/sales-office-and-design-center/design-center-a-selections.html", "https://youtu.be/Y41h9BnXQoU?list=PLm-Y3PHiQSJ12FdoJfTcOJnbVN2QUyCT1", "http://www.marksystemsusa.com/news-a-blog/latest-news-for-ihms-home-builder-software/events/item/192-2015-executive-roundtable-recap.html", "http://www.marksystemsusa.com/ihms-components/internet-toolkit-itk.html", "http://www.marksystemsusa.com/ihms-components.html", "http://www.marksystemsusa.com/ihms-components/material-purchasing.html"], "published": "2015-10-13T11:46:00.000+03:00", "crawled": "2015-10-13T15:27:57.448+03:00", "highlightTitle": ""}