{"organizations": ["New State Security Ops Center Purdue"], "uuid": "4a2ebf25b63221e6444de23f68d864fa0020ada8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "campustechnology.com", "main_image": "", "site_section": "http://campustechnology.com/rss-feeds/news.aspx", "section_title": "Campus Technology: News", "url": "https://campustechnology.com/articles/2015/10/14/purdue-students-interning-in-new-state-security-ops-center.aspx", "country": "US", "title": "Purdue Students Interning in New State Security Ops Center", "performance_score": 0, "site": "campustechnology.com", "participants_count": 0, "title_full": "Purdue Students Interning in New State Security Ops Center", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T14:00:00.000+03:00", "replies_count": 0, "uuid": "4a2ebf25b63221e6444de23f68d864fa0020ada8"}, "author": "", "url": "https://campustechnology.com/articles/2015/10/14/purdue-students-interning-in-new-state-security-ops-center.aspx", "ord_in_thread": 0, "title": "Purdue Students Interning in New State Security Ops Center", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Dian Schaffhauser"], "text": "Purdue Students Interning in New State Security Ops Center By Dian Schaffhauser 10/14/15 \nPurdue University students will have the chance to staff a new security and counter-terrorism center intended to protect people and assets in the state of Indiana. A joint initiative involving government, academia and the private sector will shortly open the Indiana Security Operations Center (SOC) near the Purdue campus. SOC will be part of the Indiana Information Sharing and Analysis Center , the primary hub for information sharing and analysis on cybersecurity issues, including network monitoring, vulnerability identification and threat warnings of state computer systems. \nSOC will be staffed by state employees and Purdue students, all of whom will monitor security incidents on Indiana's computer network. The students are part of Purdue's Pathmaker Internship Program , which gives them entry-level engineering and computer science job experience while still enrolled as full-time students. The jobs are either on campus, in the Purdue Research Park (which is next door to the university) or in company offices in West Lafayette. For these latest positions, the interns will have restricted access to information and resources, and students will be subject to \"rigorous\" security background checks. \nAt SOC, according to officials, the interns will help resolve lower-level issues under the supervision of managers, thereby freeing up the security specialists at the Indiana Office of Technology to focus on higher-priority and more sensitive issues. Initially, the center will have nearly a dozen employees and will operate only from 8 to 5. In the future, those hours are expected to expand to become a 24/7 operation. \n\"We have seen repeatedly over the last several years that data and network security are vitally important,\" said Lieutenant Governor Sue Ellspermann, who chairs the state's Counterterrorism and Security Council , in a prepared statement. \"While it's difficult to anticipate every potential threat to our networks, we must take every possible measure to be ready when attacks occur. This facility will significantly improve Indiana's ability to defend Hoosiers' information.\" \nNoting that the new jobs will give students experience \"that will help them in their careers for years to come while working part-time,\" added Purdue CIO Officer Gerry McCartney, \"Purdue is a recognized leader in cyber security and forensics, and this is a first step in using our expertise to serve the citizens of Indiana in new ways.\" About the Author \nDian Schaffhauser is a writer who covers technology and business for a number of publications. Contact her at dian@dischaffhauser.com .", "external_links": [], "published": "2015-10-14T14:00:00.000+03:00", "crawled": "2015-10-14T23:22:07.257+03:00", "highlightTitle": ""}