{"organizations": [], "uuid": "abfeb78526c192442c07544a707e8778042a3b71", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chron.com", "main_image": "http://ww1.hdnux.com/photos/37/74/72/8375940/7/rawImage.jpg", "site_section": "http://www.chron.com/rss/feed/AP-Technology-and-Science-266.php\r", "section_title": "AP Technology and Science", "url": "http://www.chron.com/business/technology/article/Twitter-purging-336-workers-as-new-CEO-slashes-6567983.php", "country": "US", "title": "Twitter purging up to 336 workers as new CEO slashes costs", "performance_score": 0, "site": "chron.com", "participants_count": 1, "title_full": "Twitter purging up to 336 workers as new CEO slashes costs", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T16:23:00.000+03:00", "replies_count": 0, "uuid": "abfeb78526c192442c07544a707e8778042a3b71"}, "author": "MICHAEL LIEDTKE, AP Technology Writer", "url": "http://www.chron.com/business/technology/article/Twitter-purging-336-workers-as-new-CEO-slashes-6567983.php", "ord_in_thread": 0, "title": "Twitter purging up to 336 workers as new CEO slashes costs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Twitter purging up to 336 workers as new CEO slashes costs Michael Liedtke, Ap Technology Writer Updated 8:26 am, Tuesday, October 13, 2015 Photo: David Paul Morris, Bloomberg Image 1 of / 13 Close Image 1 of 13 \nTwitter announced, Tuesday, Oct. 13, 2015, the company is laying off 336 employees, signaling CEO Jack Dorsey's resolve to slash costs while the company struggles to make money. Photo: David Paul Morris, Bloomberg Twitter announced, Tuesday, Oct. 13, 2015, the company is laying... Image 2 of 13 \nThis file photo shows the sign outside of Twitter headquarters in San Francisco. The company is laying off 336 employees, signaling CEO Jack Dorsey's resolve to slash costs while the company struggles to make money. Photo: Jeff Chiu, Associated Press This file photo shows the sign outside of Twitter headquarters in... Image 3 of 13 \nFILE - This Friday, Oct. 18, 2013, file photo, shows a Twitter app on an iPhone screen, in New York. Twitter announced, Tuesday, Oct. 13, 2015, the company is laying off 336 employees, signaling CEO Jack Dorsey's resolve to slash costs while the company struggles to make money. Photo: Richard Drew, AP FILE - This Friday, Oct. 18, 2013, file photo, shows a Twitter app... Image 4 of 13 \nOld and new the Merchandise Mart Building, (left) is home to Twitter along Market St. at 10th in San Francisco, Calif. on Thurs. September 24, 2015. Photo: Michael Macor, The Chronicle Old and new the Merchandise Mart Building, (left) is home to... Image 5 of 13 \nThe outdoor space behind the old Merchandise Mart Building which is home to Twitter along Stevenson St. at 10th in San Francisco, Calif. on Thurs. September 24, 2015. Photo: Michael Macor, The Chronicle The outdoor space behind the old Merchandise Mart Building which is... Image 6 of 13 \nOld and new the Merchandise Mart Building, (left) is home to Twitter along 10th St. and Market St. in San Francisco, Calif. on Thurs. September 24, 2015. Photo: Michael Macor, The Chronicle Old and new the Merchandise Mart Building, (left) is home to... Image 7 of 13 \nOld and new the Merchandise Mart Building, (top left) is home to Twitter along Market St. at 10th in San Francisco, Calif. on Thurs. September 24, 2015. Photo: Michael Macor, The Chronicle Old and new the Merchandise Mart Building, (top left) is home to... Image 8 of 13 \nOld and new the Merchandise Mart Building, (left) is home to Twitter along Market St. at 10th in San Francisco, Calif. on Thurs. September 24, 2015. Photo: Michael Macor, The Chronicle Old and new the Merchandise Mart Building, (left) is home to... Image 9 of 13 \nThe outdoor space behind the old Merchandise Mart Building which is home to Twitter along Stevenson St. at 10th in San Francisco, Calif. on Thurs. September 24, 2015. Photo: Michael Macor, The Chronicle The outdoor space behind the old Merchandise Mart Building which is... Image 10 of 13 \nThe outdoor space behind the old Merchandise Mart Building which is home to Twitter along Stevenson St. at 10th in San Francisco, Calif. on Thurs. September 24, 2015. Photo: Michael Macor, The Chronicle The outdoor space behind the old Merchandise Mart Building which is... Image 11 of 13 \nThe outdoor space behind the old Merchandise Mart Building which is home to Twitter along Stevenson St. at 10th in San Francisco, Calif. on Thurs. September 24, 2015. Photo: Michael Macor, The Chronicle The outdoor space behind the old Merchandise Mart Building which is... Image 12 of 13 \nThe outdoor space behind the old Merchandise Mart Building which is home to Twitter along Stevenson St. at 10th in San Francisco, Calif. on Thurs. September 24, 2015. Photo: Michael Macor, The Chronicle The outdoor space behind the old Merchandise Mart Building which is... Image 13 of 13 Twitter purging up to 336 workers as new CEO slashes costs 1 / 13 Back to Gallery SAN FRANCISCO (AP) — Twitter is laying off up to 336 employees, signaling CEO Jack Dorsey 's resolve to slash costs while the company struggles to make money. The cutbacks announced Tuesday could equate to about 8 percent of Twitter's workforce of 4,100 people. The purge comes two weeks after Twitter brought back one of its co-founders as permanent CEO in hopes that Dorsey would be able to resolve problems that have slowed user growth at the messaging service and compounded an uninterrupted cycle of financial losses. Cutting costs can boost profits but at Twitter, it has also raised uncertainty about the future and the company's desire for aggressive growth and the larger audience it has sought for so long. Related Stories", "external_links": [], "published": "2015-10-13T16:23:00.000+03:00", "crawled": "2015-10-13T16:31:27.443+03:00", "highlightTitle": ""}