{"organizations": ["ISG", "ISG Luxoft Named"], "uuid": "6e25faeaabbc671454c81e7ed8003d730690e9a9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tmcnet.com", "main_image": "", "site_section": "http://rss.tmcnet.com/rss/information%20technology", "section_title": "TMCnet.com RSS Service: information technology", "url": "http://www.tmcnet.com/usubmit/2015/10/19/8263455.htm", "country": "US", "title": "Luxoft Named a Top 10 Outsourcing Service Provider by ISG", "performance_score": 0, "site": "tmcnet.com", "participants_count": 0, "title_full": "Luxoft Named a Top 10 Outsourcing Service Provider by ISG", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T23:31:00.000+03:00", "replies_count": 0, "uuid": "6e25faeaabbc671454c81e7ed8003d730690e9a9"}, "author": "", "url": "http://www.tmcnet.com/usubmit/2015/10/19/8263455.htm", "ord_in_thread": 0, "title": "Luxoft Named a Top 10 Outsourcing Service Provider by ISG", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Luxoft Named a Top 10 Outsourcing Service Provider by ISG [October 19, 2015] Tweet \nLuxoft Holding, Inc (NYSE:LXFT), a leading provider of software development services and innovative IT solutions to a global client base, today announced it has been named a Top 10 Outsourcing Service Provider by Information Services Group (ISG), a leading technology insights, market intelligence and advisory services company. \nFor the third consecutive quarter, Luxoft was among the leading providers in The Breakthrough Sourcing Standouts category for the Americas and EMEA regions based on annual contract value (ACV) won over the last 12 months, according to the ISG Global Outsourcing Index®. Now in its 52 nd consecutive quarter, the ISG Outsourcing Index provides an independent quarterly review of the latest sourcing industry data and trends for enterprises, service providers, analysts and the media. Luxoft's inclusion in the ISG Outsourcing Index is based on data the company submits to ISG each quarter. \n\"We're very excited to have earned our third consecutive listing on ISG's Top 10 Sourcing Standouts list,\" said Luxoft President and CEO, Dmitry Loschinin. \"In line with the recent results from the ISG Outsourcing Index, business for Luxoft continues to grow within the North American marketplace and Western Europe, particularly within financial services. We are seeing tremendous opportunities within our key verticals - financial services, automotive, and telecommunications - driven by changing demands of the sourcing, information technology, and business stakeholders at these organizations. They want suppliers who can drive change, lower cost, and ultimately improve the business output. We see the results of the ISG Outsourcing Index speaking to these overall trends.\" \n\"For more than adecade, the ISG Outsourcing Index has been the authoritative source for marketplace intelligence related to outsourcing transaction structures and terms, industry adoption, geographic prevalence and service provider performance,\" said Paul Reynolds, chief research officer of ISG. \"Luxoft continues to establish itself as a leading and growing player in the global market for custom software development and product engineering services, based on its volume of business in relation to other industry providers.\" \nAbout Information Services Group \nInformation Services Group (ISG) (NASDAQ:III) is a leading technology insights, market intelligence and advisory services company, serving more than 500 clients around the world to help them achieve operational excellence. ISG supports private and public sector organizations to transform and optimize their operational environments through research, benchmarking, consulting and managed services, with a focus on information technology, business process transformation, program management services and enterprise resource planning. Clients look to ISG for unique insights and innovative solutions for leveraging technology, the deepest data source in the industry, and more than five decades of experience and global leadership in information and advisory services. Based in Stamford, Conn., the company has more than 900 employees and operates in 21 countries. For additional information, visit www.isg-one.com . \nAbout Luxoft \nLuxoft Holding, Inc. (NYSE:LXFT US) is a leading provider of software development services and innovative IT solutions to a global client base consisting primarily of large multinational corporations. Luxoft's software development services consist of core and mission critical custom software development and support, product engineering and testing, and technology consulting. Luxoft's solutions are based on its proprietary products and platforms that directly impact its clients' business outcomes and efficiently deliver continuous innovation. The Company develops its solutions and delivers its services from 24 dedicated delivery centers worldwide. It has over 10,000 employees across 27 offices in 15 countries in North America, Mexico, Western and Eastern Europe, Asia Pacific, and South Africa. Luxoft is incorporated in Tortola, British Virgin Islands, has its operating headquarters office in Zug, Switzerland and is listed on the New York Stock Exchange. For more information, please visit http://www.luxoft.com . View source version on businesswire.com: http://www.businesswire.com/news/home/20151019006540/en/", "external_links": [], "published": "2015-10-19T23:31:00.000+03:00", "crawled": "2015-10-20T04:25:30.077+03:00", "highlightTitle": ""}