{"organizations": [], "uuid": "c83eeb989476f272557bee44cca63490afb7c772", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.businesswire.com", "main_image": "", "site_section": "http://feed.businesswire.com/rss/home/?rss=G1QFDERJXkJeGVtQXg==", "section_title": "Business Wire Technology: Mobile/Wireless News", "url": "http://www.businesswire.com/news/home/20151005006061/en/Mobifone-Chooses-Synchronoss-Personal-Cloud-Activation-Services", "country": "US", "title": "Mobifone Chooses Synchronoss for Personal Cloud and Activation Services in Vietnam", "performance_score": 0, "site": "businesswire.com", "participants_count": 0, "title_full": "Mobifone Chooses Synchronoss for Personal Cloud and Activation Services in Vietnam", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T17:17:00.000+03:00", "replies_count": 0, "uuid": "c83eeb989476f272557bee44cca63490afb7c772"}, "author": "", "url": "http://www.businesswire.com/news/home/20151005006061/en/Mobifone-Chooses-Synchronoss-Personal-Cloud-Activation-Services", "ord_in_thread": 0, "title": "Mobifone Chooses Synchronoss for Personal Cloud and Activation Services in Vietnam", "locations": ["Vietnam Mobifone Chooses Synchronoss", "Vietnam Synchronoss"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Mobifone Chooses Synchronoss for Personal Cloud and Activation Services in Vietnam Synchronoss to deploy full suite of activation and cloud software to more than 40 million subscribers October 05, 2015 10:17 AM Eastern Daylight Time \nBRIDGEWATER, N.J.--( BUSINESS WIRE )--Synchronoss Technologies, Inc. (NASDAQ:SNCR), the mobile innovation leader that provides cloud solutions and software-based activation for mobile carriers, retailers and OEMs around the world, today announced that it has been chosen by Vietnamese mobile operator Mobifone to deploy a wide range of Synchronoss services and solutions with an estimated total contract value to exceed $80M over the next three years and will generate a significant return for both Mobifone and Synchronoss in this rapidly growing market. \nSynchronoss products and services will include: Synchronoss Mobile Content Transfer™ device activation and content transfer solution to easily provision subscribers with new smartphones containing the personal content from their old device Award-winning white label Synchronoss Personal Cloud™ solution to provide subscribers with their own secure personal cloud-based back-up and storage service for mobile data Synchronoss Network Activation solution to optimize the operations and financial performance of both the domestic and international roaming services \nIt is anticipated that Mobifone will launch the new Synchronoss-powered services to subscribers in Vietnam early in the new year, for use on the Apple iPhone and all popular Android devices. In addition, Mobifone will use the Synchronoss Network Activation solution as both an order gateway and analytics source to optimize the operations and financial performance of both the domestic and international roaming services with immediate effect. \nThe Vietnamese mobile market is one of the most dynamic and fast-growing in the Asia Pacific region. According to a June 2015 report from the General Statistics Office of Vietnam , the country has 136.9 million mobile subscriptions, including 29.1 million 3G subscriptions - a year-on-year increase of 29.6 per cent. According to international research firm IDC, Vietnam is the fastest growing smartphone market in Southeast Asia, and smartphone sales will continue to increase for at least the next five years . As of the end of 1Q2015, Mobifone had 42m subscribers (source: GSMA Intelligence). \nMr. Cao Duy Hai, General Director of Mobifone stated: “In line with Mobifone's strategic vision for 2015-2020 of being a pioneer in the development of the Vietnamese Posts and Telecommunications sector, Mobifone is pleased to sign a master services agreement with Synchronoss to optimize operations and to launch a branded Personal Cloud solution in early 2016, as a bridge to connect with the customers and thereby deploying television, retail and multimedia applications.” \n“The digitization of a high-growth, developing market like Vietnam represents an exciting opportunity for Synchronoss,” said Chris Halbard, EVP and President International at Synchronoss. “A large number of young and well educated subscribers are adopting smartphones for the first time courtesy of low-cost data plans. These consumers want and expect to access their own content and the latest mobile services on the device of their choice. We’re thrilled to be working with Mobifone and our regional service and distribution partner PostNet Pte. Ltd. (a joint venture between Sovico Holdings Ltd. Of Vietnam and TWS LLC of the USA).” \nThe Synchronoss Personal Cloud technology is used by some of the world’s leading mobile operators including AT&T, Verizon, Vodafone, Orange and Singtel, to offer subscribers a branded solution to automatically back-up, synchronize, store and protect all their personal contacts, content and data for accessing across a range of different devices. \nAbout Synchronoss Technologies, Inc. \nSynchronoss Technologies (NASDAQ: SNCR) is the mobile innovation leader that provides personal cloud solutions and software-based activation for connected devices across the globe. The company’s proven and scalable technology solutions allow customers to connect, synchronize and activate connected devices and services that empower enterprises and consumers to live in a connected world. For more information visit us at: www.synchronoss.com . \nThe Synchronoss logo and Synchronoss are trademarks of Synchronoss Technologies, Inc. All other trademarks are property of their respective owners. Contacts", "external_links": [], "published": "2015-10-05T17:17:00.000+03:00", "crawled": "2015-10-05T17:24:03.729+03:00", "highlightTitle": ""}