{"organizations": [], "uuid": "9b138b72029bcbba595ed1835224d7f71a1f95ce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1135440/cmtl-reaches-milestone-25-000-advanced-compatibility-memory-tests", "country": "US", "title": "CMTL Reaches Milestone of 25,000 Advanced Compatibility Memory Tests", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "CMTL Reaches Milestone of 25,000 Advanced Compatibility Memory Tests", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T21:05:00.000+03:00", "replies_count": 0, "uuid": "9b138b72029bcbba595ed1835224d7f71a1f95ce"}, "author": "admin", "url": "http://www.freshnews.com/news/1135440/cmtl-reaches-milestone-25-000-advanced-compatibility-memory-tests", "ord_in_thread": 0, "title": "CMTL Reaches Milestone of 25,000 Advanced Compatibility Memory Tests", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Submitted by admin on 10/1/2015 @ 11:05 AM   CMTL \nANAHEIM, Calif., Oct. 1, 2015 /PRNewswire/ -- CMTL , ( www.cmtlabs.com ), Computer Memory Test Labs, the industry's leading independent memory compatibility and functionality testing lab announced today that 25,000 test number was completed using a Dataram DTM64618A on a Intel NUC5i7RYH platform. \nCMTL President, John Deters stated \"CMTL is excited to have completed now over 25,000 advanced memory compatibility tests and before CMTL's 20th year anniversary in 2016. The number of tests performed is indicative of the value memory module customers especially Intel platform customers place on CMTL's independent memory compatibility and functionality. What makes this achievement even more satisfying is that Dataram was the first company to sign up for the CMTL/Intel Advanced memory compatibility and functionality testing program almost 20 years ago. Dataram immediately recognized the tremendous untapped opportunity to sell a lot of 3rd party memory to Intel platform customers. With 24/7 testing, Dataram products quickly appeared on just about every approved memory list on Intel's website. CMTL thanks Dataram for having the foresight and business opportunity recognition almost 20 years ago to be the first program participant. Without that first annual agreement, CMTL may never have gotten off the ground.\" \n\"Delivering memory solutions that exceed our customer's needs is, and always has been, critical to Dataram's success. For nearly 20 years CMTL's advanced testing has helped to ensure our memory products are of the highest quality and reliability, and functionally compatible with our customer's platforms,\" said Dave Moylan, Dataram's Chairman and Chief Executive Officer (CEO). \"We are proud to have the longest testing relationship of all participants and honored to have been a part of the 25,000th test which affirms our long-standing commitment to quality. We congratulate CMTL and its staff on achieving such an incredible milestone.\" \nCMTL was established in 1996, in cooperation with Intel, as a third party independent test lab to ensure memory module compatibility and functionality on Intel platforms. Memory successfully Intel advanced tested by CMTL is added to each Intel motherboard approved memory list. Modules not approved by Intel are not supported and may have a higher risk of experiencing sporadic errors, unstable functionality, performance issues and system crashes. \nIntel is a registered trademark of Intel Corporation; all others are the property of respective owners. \nContact: John Deters, CMTL , 770-238-2085, jdeters@cmtlabs.com \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/cmtl-reaches-milestone-of--25000-advanced-compatibility-memory-tests-300152720.html \nSOURCE CMTL", "external_links": [], "published": "2015-10-01T21:05:00.000+03:00", "crawled": "2015-10-01T22:38:36.093+03:00", "highlightTitle": ""}