{"organizations": [], "uuid": "55d58ffcd8a4bb451e8a2c9a9edc8c2b92af663c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.biosciencetechnology.com", "main_image": "http://www.biosciencetechnology.com/sites/biosciencetechnology.com/files/shutterstock_325369757.jpg", "site_section": "http://www.biosciencetechnology.com//rss-feeds/all/rss.xml/all", "section_title": "Bioscience Technology All", "url": "http://www.biosciencetechnology.com/news/2015/10/high-stress-jobs-may-be-linked-increased-stroke-risk", "country": "US", "title": "High Stress Jobs May be Linked to Increased Stroke Risk", "performance_score": 0, "site": "biosciencetechnology.com", "participants_count": 1, "title_full": "High Stress Jobs May be Linked to Increased Stroke Risk", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T23:21:00.000+03:00", "replies_count": 0, "uuid": "55d58ffcd8a4bb451e8a2c9a9edc8c2b92af663c"}, "author": "bfletcher", "url": "http://www.biosciencetechnology.com/news/2015/10/high-stress-jobs-may-be-linked-increased-stroke-risk", "ord_in_thread": 0, "title": "High Stress Jobs May be Linked to Increased Stroke Risk", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "High Stress Jobs May be Linked to Increased Stroke Risk Wed, 10/14/2015 - 4:21pm Get today's life science headlines and news - Sign up now! \nNew research found there may be a link between high stress jobs and an increased risk for stroke. \nThe study, published Oct. 14 in Neurology , found women with high stress jobs had a 33 percent higher risk of stroke than those with low stress jobs. \nResearchers led by Dingli Xu, M.D., Southern Medical University in Guangzhou, China, analyzed all of the available research on job strain and risk stroke. The team analyzed six studies, comprised of a total of 138,782 participants who were followed for three to 17 years. \nStudy author Yuli Huang, also from Southern Medical University, told Bioscience Technology that interestingly, the difference of risk of stroke in men are not statistically significant. “The harmful effect of work stress may be more significant in women,” Huang said. “As high stress jobs may lead to more unhealthy behaviors, such as poor eating habits, smoking and a lack of exercise, it is of vital importance for subjects with high stress occupations to be attune to it.” \nParticipants’ jobs fell into one of four categories, based on how much control workers had over their jobs and how hard they worked, or psychological demands of the job. Time pressure, mental load, and coordination burdens were included in job demands. \n“Job strain was measured with questions from the validated job-content questionnaire and demand-control questionnaire, which were included in the baseline self-report questionnaire of all studies,” Huang told Bioscience Technology. Read More: Infections May Temporarily Increase Children’s Risk of Stroke \nThe four job groups consist of passive jobs, low-stress jobs, high-stress jobs, and active jobs. \nPassive jobs, such as janitors, miners, and other manual labors were those with low demand and low control. Low stress jobs included natural scientists and architects, and were those with low demand and high control. High stress jobs are considered high demand and low control, and include jobs in the service industry such as waitresses and nursing aides. Finally, active jobs are those with high demand and high control, such as doctors, teachers and engineers. \nThe percentage of participants in the six studies with high stress jobs ranged from 11 to 27 percent. \nParticipants in active and passive jobs did not have any increased risk of stroke. \nPeople with high stress jobs were 58 percent more likely to have an ischemic stroke (the most common type of stroke) than those with low stress jobs. \n“Based on this study, it is reasonable to consider testing interventions aimed at increasing job control, such as decentralization of decision-making and flexibility in job structure, such as telecommuting. If effective, such workplace changes could have a major public health impact,” said Jennifer J. Majerski, M.D., M.S., at the University of Utah in Salt Lake City, who wrote a corresponding editorial . \nLimitations of the study include that job stress was measured at only one point in time and certain factors, such as high blood pressure, were not adequately adjusted for in the original studies. \nUp next, Huang said: “First, we think further studies are needed to evaluate whether job stress directly increases the risk of stroke or whether other concurrent risk factors are responsible for the increased risk observed. Second, whether psychotherapy methods coping with work stress will be of help in prevention of stroke is needed to be tested in random controlled trials.” Topics", "external_links": [], "published": "2015-10-14T23:21:00.000+03:00", "crawled": "2015-10-15T08:43:52.396+03:00", "highlightTitle": ""}