{"organizations": ["North Carolina State Bar", "Bar Associations LegalZoom", "North Carolina State Bar LegalZoom"], "uuid": "72ffe8430efdb8a60ace8ca16f1d1f5c20ebfaaa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.abajournal.com", "main_image": "http://www.abajournal.com/images/main_images/legalzoom_logo200px.jpg", "site_section": "http://www.abajournal.com/topics/rss/C543", "section_title": "ABA Journal Daily News - Legal Technology", "url": "http://www.abajournal.com/news/article/legalzoom_resolves_10.5m_antitrust_suit_against_north_carolina_state_bar/", "country": "US", "title": "LegalZoom resolves $10.5M antitrust suit against North Carolina State Bar", "performance_score": 0, "site": "abajournal.com", "participants_count": 0, "title_full": "LegalZoom resolves $10.5M antitrust suit against North Carolina State Bar", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T23:15:00.000+03:00", "replies_count": 0, "uuid": "72ffe8430efdb8a60ace8ca16f1d1f5c20ebfaaa"}, "author": "", "url": "http://www.abajournal.com/news/article/legalzoom_resolves_10.5m_antitrust_suit_against_north_carolina_state_bar/", "ord_in_thread": 0, "title": "LegalZoom resolves $10.5M antitrust suit against North Carolina State Bar", "locations": ["LegalZoom"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LegalZoom resolves $10.5M antitrust suit… Bar Associations LegalZoom resolves $10.5M antitrust suit against North Carolina State Bar Posted Oct 23, 2015 03:15 pm CDT Tweet \nLegalZoom has settled its protracted legal dispute with the North Carolina State Bar with a consent agreement that permits the company to continue operating there, Forbes reports. The online legal document company has been expanding quickly to provide other services, including prepaid legal services plans. \nThe agreement comes on the heels of a lawsuit against the bar filed in federal court in North Carolina in June , seeking $10.5 million in antitrust damages. LegalZoom’s suit was based on a U.S. Supreme Court antitrust ruling earlier this year against the state’s self-regulating body for dentists, which had come down on teeth whitening by non-dentists. \nThe state bar has battled the company since 2008, after first clearing it to operate there in 2003. Legal challenges in other states had fallen away over the years, with only North Carolina’s continuing. \nUnder the agreement, LegalZoom will vet its documents with North Carolina lawyers, and inform its customers that the blank templates aren’t a substitute for in-person advice from an attorney. The state bar also agrees to support proposed legislation that would clarify the definition of “unauthorized practice of law,” which currently is open to various interpretations and was used by the bar to challenge LegalZoom. Both parties agreed to support legislation permitting interactive legal-help websites, so long as they abide by the basic terms of the settlement agreement. \nLegalZoom says the agreement is on terms it sought in 2011, but claims that the bar wouldn’t budge at the time. “At the time, they said no, but in the past few months they kicked it up,” Kenneth Friedman, LegalZoom’s vice president for government relations, told Forbes. \nThe company is now looking to offer more services to consumers and small businesses, according to a feature in the ABA Journal last year, including routine legal advice using a mix of lawyers and non-lawyers. \nLegalZoom already has expanded from online documents and provides prepaid legal service plans in 42 states, according to the company’s news release . The company says it plans to launch more services in North Carolina and several other states this year. Previous: Baby born on China Airlines flight diverted to Alaska eligible for US citizenship, official says Filed under:", "external_links": [], "published": "2015-10-23T23:15:00.000+03:00", "crawled": "2015-10-24T00:12:41.190+03:00", "highlightTitle": ""}