{"organizations": [], "uuid": "4eda21fcd189f29b51e4d649b61db45ba6f7c707", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "abcnews.go.com", "main_image": "", "site_section": "http://abcnews.go.com/xmldata/rss?id=79", "section_title": "ABC News: Technology", "url": "http://abcnews.go.com/Technology/wireStory/cybersecurity-senate-takes-initial-step-bills-passage-34656087", "country": "US", "title": "Cybersecurity: Senate Takes Initial Step to Bill's Passage", "performance_score": 1, "site": "go.com", "participants_count": 1, "title_full": "Cybersecurity: Senate Takes Initial Step to Bill's Passage - ABC News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "4eda21fcd189f29b51e4d649b61db45ba6f7c707"}, "author": "abcNEWS", "url": "http://abcnews.go.com/Technology/wireStory/cybersecurity-senate-takes-initial-step-bills-passage-34656087", "ord_in_thread": 0, "title": "Cybersecurity: Senate Takes Initial Step to Bill's Passage", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Senate is set to pass a bill aimed at improving cybersecurity by encouraging the sharing of threat information among companies and the U.S. government.\nAn 83-14 procedural vote Thursday represented a healthy endorsement of a bill opposed by companies such as Apple and Dropbox, who said it lacks key privacy protections and may result in personal information ending up in the government's hands.\nThe Cybersecurity Information Sharing Act is co-sponsored by Sen. Dianne Feinstein, D-Calif., and Sen. Richard Burr , R-N.C., who said it was critical to limit increasingly high-profile cyberattacks, such as one suffered by Sony Pictures last year.\n\"This is a good bill. It is a first step. It's not going to prevent all cyberattacks or penetrations, but it will allow companies to share information about the cyber threats they see and the defensive measures to implement to protect their networks,\" Feinstein said. She said the same tactics are used repeatedly against different targets, which shouldn't happen.\nMore than 21 million Americans recently had their personal information stolen when the Office of Personnel Management was hacked in what that the U.S. believes was a Chinese espionage operation.\nCompanies would receive legal protections from antitrust and consumer privacy liabilities for participating in the voluntary program.\nSen. Ron Wyden , D-Ore., who opposed the bill, said it provides liability protection for companies, which are required to remove personal and unrelated information provided to the government only if they know it is personal and unrelated.\n\"How would they know? ...They're required to virtually do no looking. It is the most cursory review,\" Wyden said. He said Americans would call it \"another surveillance bill.\"\nThe U.S. and the technology industry already operate groups intended to improve sharing of information among the government and businesses, including the Homeland Security Department's U.S. Computer Emergency Readiness Team.\nThe White House said in a statement that it supports the bill, which is part of larger suite of legislation that's needed to provide necessary tools to fight cyber threats and create consistent notification standards for breaches of personal data.\n\"In addition to updating information sharing statutes, the Congress should incorporate privacy, confidentiality protection, and civil liberties safeguards into all aspects of cybersecurity legislation,\" the White House said.\nThe Senate's vote on final passage is expected next week. The House passed its version of the bill earlier this year with strong bipartisan support. If the Senate were to pass the bill on Tuesday, the two versions would need to be reconciled before being sent to the White House for the president's signature.\n———\nFollow Tami Abdollah on Twitter at http://www.twitter.com/latams .\n  Cybersecurity: Senate Takes Initial Step to Bill's Passage \" \n      FDA   \n ", "external_links": [], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-23T06:06:46.707+03:00", "highlightTitle": ""}