{"organizations": ["Dow"], "uuid": "5f82defa6148ee5ad3b9f01a6407431ad3db6380", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chemicals-technology.com", "main_image": "", "site_section": "http://www.chemicals-technology.com/news-rss.xml", "section_title": "Chemicals Technology-Updates", "url": "http://www.chemicals-technology.com/news/newsdow-to-sell-kuwait-joint-venture-me-global-to-equate-for-32-bn-4700683", "country": "", "title": "Dow to sell Kuwait joint-venture ME Global to EQUATE for $3.2 bn", "performance_score": 0, "site": "chemicals-technology.com", "participants_count": 0, "title_full": "Dow to sell Kuwait joint-venture ME Global to EQUATE for $3.2 bn", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T02:00:00.000+03:00", "replies_count": 0, "uuid": "5f82defa6148ee5ad3b9f01a6407431ad3db6380"}, "author": "", "url": "http://www.chemicals-technology.com/news/newsdow-to-sell-kuwait-joint-venture-me-global-to-equate-for-32-bn-4700683", "ord_in_thread": 0, "title": "Dow to sell Kuwait joint-venture ME Global to EQUATE for $3.2 bn", "locations": ["Kuwait"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Dow to sell Kuwait joint-venture ME Global to EQUATE for $3.2 bn 23 October 2015 \nDow Chemical is selling its stake in a petrochemical joint-venture with Petrochemical Industries, a unit of Kuwait Petroleum, called ME Global for $3.2bn. \nUnder the company's divestment plan, Dow aims to reduce its stake in, and consolidate its joint-ventures with Kuwait. \nFollowing the deal, Dow Chemical will get $1.5bn in pre-tax proceeds, and retain a 42.5% stake in MEGlobal through its ownership of Greater Equate. \nIt is part of Dow Chemical's asset optimisation strategy, and in the second phase it will further reduce its stake in Greater Equate. \nIn 2013, Dow started a massive restructuring plan, and cut its exposure to low-margin commodity businesses, including its century-old chlorine segment. \nDow chairman and chief executive officer Andrew N Liveris said: \"This announcement demonstrates Dow's commitment to evaluate our joint-venture portfolio to unlock value for shareholders and simultaneously expand our relationship with a key strategic partner. \"This transaction allows Dow to maximise shareholder value, while maintaining our commitment to these industry-leading joint-ventures.\" \n\"This transaction allows Dow to maximise shareholder value, while maintaining our commitment to these industry-leading joint-ventures.\" \nME Global plans to build an plant on the US Gulf Coast, which aims to allow its partners to expand their presence in a highly strategic region of the world. \nME Global is a joint-venture between Dow and Petrochemical Industries Company (PIC) of Kuwait involved in the manufacture and marketing of monoethylene glycol and diethylene glycol (EG). \nThe Dubai-based joint-venture was established in 2004. \nEquate was established in 1995, and operates an integrated manufacturing facility producing more than five million tonnes of high-quality petrochemical products anually, including polyethylene, ethylene, and EG for the Middle East, Asia, Africa and European markets. \nImage: Dow site at Texas, Freeport. Photo: courtsey of The Dow Chemical Company. Follow Us:", "external_links": [], "published": "2015-10-23T02:00:00.000+03:00", "crawled": "2015-10-25T13:17:40.896+02:00", "highlightTitle": ""}