{"organizations": [], "uuid": "8a61c63a0df4d83d1d663e4a17a656512f8cfe27", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dallasnews.com", "main_image": "http://www.dallasnews.com/business/technology/headlines/20151016-android_pay_googl.ece/BINARY/original/Android_Pay_GOOGL", "site_section": "http://www.dallasnews.com/business/technology/", "section_title": "Dallas-Fort Worth Personal Technology News - Business News for Dallas, Texas ", "url": "http://www.dallasnews.com/business/columnists/jim-rossman/20151016-do-we-gain-anything-by-paying-with-our-phones.ece", "country": "US", "title": "Do we gain anything by paying with our phones?", "performance_score": 0, "site": "dallasnews.com", "participants_count": 6, "title_full": "Do we gain anything by paying with our phones? | Dallas Morning News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T03:40:00.000+03:00", "replies_count": 8, "uuid": "8a61c63a0df4d83d1d663e4a17a656512f8cfe27"}, "author": "Rossman", "url": "http://www.dallasnews.com/business/columnists/jim-rossman/20151016-do-we-gain-anything-by-paying-with-our-phones.ece", "ord_in_thread": 0, "title": "Do we gain anything by paying with our phones?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "So I spent the last week trying to pay for everything with a cellphone, using Apple Pay, Android Pay or Samsung Pay, and it was mostly a success.\nI found only a few places where I couldn’t pay for my purchase with a phone.\nBut I couldn’t help thinking to myself, “Is this really just a solution in search of a problem?”\nIs the future of commerce going to be conducted on smartphones and smartwatches?\nDo we gain anything by paying with our phones?\nI’m struggling to find a reason I want to use my phone or watch over my debit card.\nI eased into Apple Pay by accident. I’m a techie, so when I acquired the right hardware to use Apple Pay, I set it up.\nBut I didn’t really go looking for places to pay with the phone — they just sort of sneaked up on me.\nI knew Whole Foods accepted Apple Pay, but I didn’t realize the vending machines at work did until I saw the tap-to-pay symbol and gave it a try.\nI have to admit, for vending machines, it is handy, but those vending machines also take my debit card.\nThat’s the thing about mobile pay systems — all the places you can pay with your phone will also take your credit or debit card.\nIs it really that hard to pull out your wallet and swipe your card?\nAfter the experience of the last week, just swiping a debit card at the grocery store seems a bit simpler.\nWow, I just realized I sound like my dad.\nMy dad worked in banking for decades but has never had a debit card. He pays cash or writes checks.\nI guess I’m getting to the point where I realize that just because a new technology exists, I don’t need to feel bad about not using it if I can’t see a good reason.\nEvery time I used the phone to pay, I asked myself if I was paying that way because it was easier or because I wanted to impress the clerk or the people behind me in line.\nThere were times when Apple Pay was absolutely faster, but there were an equal number of transactions where I was asked to try again because the terminal wasn’t ready or it just failed to complete the transmission.\nI suppose it’s a learning curve and as more places take phone payments, the clerks and customers will get better at it.\nI’ll keep using Apple Pay, but sparingly for now.\nPaying with my phone or watch makes me feel a bit like an explorer, out in some uncharted territory, but I kept wondering: Did I look cool or like an idiot?\nProbably a little of both.", "external_links": [], "published": "2015-10-17T03:40:00.000+03:00", "crawled": "2015-10-19T07:04:13.841+03:00", "highlightTitle": ""}