{"organizations": [], "uuid": "8ada5173b662a38f5b9f25ce95abde6dc60a9ceb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://www.freshnews.com/news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1141262/toggled-adds-international-development-llc-its-rapidly-growing-base-led-lighting-paten", "country": "US", "title": "TOGGLED® Adds International Development, LLC to its Rapidly Growing Base of LED Lighting Patent Licensees", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "TOGGLED® Adds International Development, LLC to its Rapidly Growing Base of LED Lighting Patent Licensees", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T17:00:00.000+03:00", "replies_count": 0, "uuid": "8ada5173b662a38f5b9f25ce95abde6dc60a9ceb"}, "author": "admin", "url": "http://www.freshnews.com/news/1141262/toggled-adds-international-development-llc-its-rapidly-growing-base-led-lighting-paten", "ord_in_thread": 0, "title": "TOGGLED® Adds International Development, LLC to its Rapidly Growing Base of LED Lighting Patent Licensees", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Submitted by admin on 10/15/2015 @ 7:00 AM Companies mentioned in this article: Altair \nTROY, Mich., Oct. 15, 2015 /PRNewswire/ -- TOGGLED ®, developer and producer of next-generation solid-state lighting technology and named in the Top 25 Most Innovative Companies in South East Michigan by Crain's Detroit, reported today the addition of International Development, LLC to its rapidly expanding Licensing Program. \nAs a licensee, International Development now has access to TOGGLED's broad portfolio of over 60 patents primarily related to LED replacements for fluorescent tubes, commonly referred to as TLEDs. \n\"The LED lighting market continues to grow rapidly, and we are truly excited at the selection and quality of products now available through our licensees,\" said TOGGLED President Dave Simon. \nTo learn more about TOGGLED's licensing program and to become a TOGGLED licensee, please visit www.toggled.com/patents or email licensingprogram@toggled.com . \nAbout TOGGLED TOGGLED® is a Michigan-based company and global manufacturer of commercial-grade LED lighting. TOGGLED products significantly lower electricity costs and deliver high-quality light in office settings, industrial environments and living spaces. Leveraging the design and engineering strength of its parent company, Altair, TOGGLED has expanded its intellectual property portfolio to become a leading patent holder in the LED lighting industry. TOGGLED products are available at The Home Depot®. To learn more or to become a TOGGLED licensee, visit www.toggled.com . \nAbout Altair Altair is focused on the development and broad application of simulation technology to synthesize and optimize designs, processes and decisions for improved business performance. Privately held with more than 2,600 employees, Altair is headquartered in Troy, Michigan, USA and operates more than 45 offices throughout 24 countries. Today, Altair serves more than 5,000 corporate clients across broad industry segments. To learn more, please visit www.altair.com . \nMedia contact:", "external_links": [], "published": "2015-10-15T17:00:00.000+03:00", "crawled": "2015-10-15T18:26:04.465+03:00", "highlightTitle": ""}