{"organizations": [], "uuid": "2535e65049f2fc42c84f1411505c3429be381fe9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "", "site_section": "http://www.prweb.com/rss2/techentsoftware.xml", "section_title": "Technology: Enterprise Software", "url": "http://www.prweb.com/releases/2015/10/prweb13034825.htm", "country": "US", "title": "Report From Capriza Finds IT Complexity Enemy Number One to Enterprise Productivity", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "New Report From Capriza Finds IT Complexity Enemy Number One to Enterprise Productivity", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "2535e65049f2fc42c84f1411505c3429be381fe9"}, "author": "Elliott Suthers", "url": "http://www.prweb.com/releases/2015/10/prweb13034825.htm", "ord_in_thread": 0, "title": "Report From Capriza Finds IT Complexity Enemy Number One to Enterprise Productivity", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Capriza , the leader in business application modernization, today announced the results of its Enterprise User-Experience Study . The polling found that complexity, mobile access and overall poor user experience are the three key factors inhibiting modernization efforts within large U.S. enterprises. In its survey of more than 1,200 enterprise application users and 300 IT decision makers from across the U.S., Capriza uncovered that nearly half of the end users polled (45 percent) were unlikely to use enterprise software due to complicated, poorly designed interfaces. IT managers concurred, with six in 10 admitting that their current applications were too complex. More telling, however, was that 63 percent of decision makers conceded that they did not have a plan in place to combat this.\n“Complexity is killing enterprise productivity,” said Yuval Scarlat, CEO and co-founder of Capriza. “Employees have more responsibility than ever, yet the legacy applications that they rely on aren’t built with them in mind and are making their lives at work more difficult. Unfortunately when it comes to removing this complexity, IT leaders have a number of huge challenges, namely cost, risk and lack of genuine options.”\nMobile still perplexing the enterprise\nCapriza’s survey also found that enterprises are facing significant challenges when it comes to mobility, which despite being a priority for many IT leaders, still fails to deliver for most employees. Only 38 percent of those polled considered their company to be “mobile friendly,” while six in 10 felt that enterprise apps took too long to complete a task.\nComplexity moving the enterprise into the shadows\nAnother key finding of the Capriza survey was the marked increase in the use of Shadow IT. More than half of the respondents had opted to use unsanctioned consumer apps (such as Box and Google Apps) in their day-to-day work life. Of these, 80 percent cited either better user experience or mobile-friendliness as their primary reason for doing so.\nThe prohibitive cost of ground-up replacement\nA major reason for this pervasive complexity are the huge costs associated with replacing traditional enterprise solutions. In a recent analysis from Oracle, the company found that a typical 1,500-licence system overhaul could range between $14 to $20 million, with even incremental updates costing millions of dollars. In its survey of enterprise IT leaders, Capriza found that nearly seven in 10 (67 percent) reported having the same or lower budgets than 2014, making the “rip and replace” option unpalatable for most companies.\n“What’s clear from this survey is that employees simply won’t tolerate subpar enterprise applications — whether mobile or desktop — the rise of Shadow IT and the continued poor adoption of suboptimal mobile apps prove this,” continued Scarlat. “But at the same time, IT leaders are facing internal budget pressures that make ground-up overhauls extremely difficult to justify. The answer lies in making existing systems relevant, simple and user friendly. Companies that fail to do this run a serious risk of becoming irrelevant in today’s increasingly sophisticated markets.”\nOther findings include:\n● 60 percent of workers would use a desktop application for up to five minutes before giving up, whereas 82 percent said they would expect the same task to take less than two minutes on a mobile app.\n● Two-thirds (66 percent) of enterprise application users still have to search in or navigate through an app to find the data they need for their job.\n● 35 percent of those questioned used an enterprise application multiple times a day. While nearly one in 10 reported using applications “as little as possible.”\nFor full analysis of the survey data, visit http://insights.capriza.com/complexity-enemy-white-paper\nAbout Capriza\nCapriza modernizes your business by simplifying and mobilizing your critical workflows. Capriza's end-to-end simplification platform enables IT and lines of business to mobile-enable critical business workflows in a matter of days without any coding, APIs, or integration. The solution is applicable for packaged applications such as SAP, Oracle, Salesforce as well as custom built solutions. Capriza disrupts the speed and economics of the journey by extending the capability of legacy applications, in a simple and useable way, onto any smartphone, tablet or desktop. Founded in 2011 by former executives of Mercury Interactive, Capriza is headquartered in Palo Alto, CA and is funded by Andreessen Horowitz, CRV, Tenaya Capital, Harmony Partners and Allen & Company. For more information, visit http://www.capriza.com\nMedia Contact:\nElliott Suthers\nHighwire PR for Capriza\nelliott@highwirepr.com\n(415) 963-4174 ex. 6", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5jYXByaXphLmNvbQ==", "http://insights.capriza.com/complexity-enemy-white-paper", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL2luc2lnaHRzLmNhcHJpemEuY29tL2NvbXBsZXhpdHktZW5lbXktd2hpdGUtcGFwZXI=", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL2NhcHJpemEuY29t"], "published": "2015-10-21T03:00:00.000+03:00", "crawled": "2015-10-21T18:10:57.078+03:00", "highlightTitle": ""}