{"organizations": [], "uuid": "fe72bf351bbd07c93334d4f344a3ff4a0ba9e2a6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.jdsupra.com", "main_image": "http://www.jdsupra.com/showThumbnail.aspx?img=15405_1711.jpg&size=og", "site_section": "http://www.jdsupra.com/resources/syndication/docsRSSfeed.aspx?ftype=ScienceComputersTechnology&premium=1", "section_title": "Science, Computers, & Technology RSS Feed | JD Supra Law News", "url": "http://www.jdsupra.com/legalnews/federal-circuit-holds-that-it-lacks-70549/", "country": "US", "title": "Federal Circuit Holds That It Lacks Jurisdiction To Review PTAB’s § 315 Time-Bar Determination", "performance_score": 0, "site": "jdsupra.com", "participants_count": 1, "title_full": "Federal Circuit Holds That It Lacks Jurisdiction To Review PTAB’s § 315 Time-Bar Determination", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T04:23:00.000+03:00", "replies_count": 0, "uuid": "fe72bf351bbd07c93334d4f344a3ff4a0ba9e2a6"}, "author": "Mintz Levin - Global IP Matters", "url": "http://www.jdsupra.com/legalnews/federal-circuit-holds-that-it-lacks-70549/", "ord_in_thread": 0, "title": "Federal Circuit Holds That It Lacks Jurisdiction To Review PTAB’s § 315 Time-Bar Determination", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Federal Circuit Holds That It Lacks Jurisdiction To Review PTAB’s § 315 Time-Bar Determination more+ Contact \nTo embed, copy and paste the code into your website or blog: <iframe src=\"http://www.jdsupra.com/post/contentViewerEmbed.aspx?fid=06dfceff-6512-4926-a82a-f8b1f815bfac\" width=\"100%\" height=\"620\" frameborder=\"1\" style=\"border: 2px solid #ccc; overflow-x:hidden !important; overflow:hidden;\" scrolling=\"auto\"></iframe> \nThe Federal Circuit has again held that it lacks jurisdiction to review certain decisions of the U.S. Patent Trial & Appeal Board in Inter Partes Reviews, continuing the Court’s apparent “hands off” approach to reviewing PTAB decisions in IPRs. This time, the Federal Circuit determined that it lacks jurisdiction to review a PTAB Board’s determination as to whether to initiate an Inter Partes Review proceeding based on the one year time bar of 35 U.S.C. § 315(b), “even if such assessment is reconsidered during the merits phase of proceedings and restated as part of the Board’s final written decision.” Achates Reference Publishing, Inc. v. Apple, Inc., No. 2014-1767 , at 13 (Fed. Cir. Sept. 30, 2015). \nSection 315(b) establishes a one year time bar prohibiting PTAB from instituting an IPR challenging the validity of a U.S. patent “if the petition requesting the proceeding is filed more than 1 year after the date on which the petitioner, real party in interest, or privy of the petitioner is served with a complaint alleging infringement of the patent.” When Apple filed petitions for Inter Partes Review of two Achates patents, Achates argued that Apple’s IPR petitions were time-barred under 35 U.S.C. § 315(b) because, according to Achates, Apple was in privity with one or more defendants who had been served with a complaint alleging infringement of those Achates patents more than a year prior to Apple’s petitions. Achates also argued that Apple’s IPR petitions were time-barred because those earlier defendants were real parties-in-interest to the petitions. \nThe Board disagreed and concluded that none of the earlier defendants were real parties-in-interest or privies of Apple, and accordingly, instituted the IPRs. Id. Achates continued to argue that Apple’s petitions were time-barred during the IPRs and the Board reaffirmed its earlier decision on this issue in the final written decision. Id. at 4-5. Achates appealed the final written decision, arguing that the Board erred in finding that Apple’s petitions were not time-barred. Id. at 5. \nOn appeal, the Federal Circuit examined whether it had jurisdiction over the PTAB Board’s conclusion that Apple’s petitions were not time-barred under § 315(b). Achates argued that the Court had jurisdiction under Versata Dev. Grp., Inc. v. SAP America, Inc. , 793 F.3d 1306 (Fed. Cir. 2015) (“ Versata II ”). In Versata II , the Patent Owner had opposed institution of a Covered Business Method Review, arguing that that the challenged patent was not a CBM patent and thus not eligible for CBM review. The PTAB Board disagreed, instituted the CBM review, and ultimately issued a final written decision finding the challenged patent claims unpatentable. On appeal, the Federal Circuit determined that it had jurisdiction to review PTAB’s determination of whether the challenged patent was a CBM patent, reasoning that the prohibition against reviewing a PTAB decision to institute did not bar review of whether PTAB exceeded its statutory limits on its authority to invalidate patents. \nAchates argued that “the question of whether Apple’s petition was time-barred goes to the Board’s ultimate authority to invalidate the patents, and therefore, under Versata II , is reviewable under § 319.” Id. at 10. The Federal Circuit disagreed, finding that “ Versata II is limited to the unique circumstances of CBMR and that…the Board’s determination to initiate the IPRs in this case is not subject to review by this court under 35 U.S.C. § 314(d).” Id. The Court reasoned that the one-year time bar does not impact the PTAB Board’s authority to invalidate a patent claim, but only bars particular petitioners from challenging a given claim. In other words, where one petitioner is time-barred from challenging a given patent, another petitioner who is not so barred could still challenge the patent’s validity through an IPR petition. Id. at 11. Further, a time-barred petitioner could also join a pending proceeding already challenging the patent. Id. \nThe Court attempted to further distinguish Versata II , reasoning that the determination of whether a patent covers a CBM is a “defining characteristic of the Board’s authority to invalidate a patent in the specialized CBMR process,” because it vests in the Board the power to invalidate a patent. Id. According to the Court in Achates , however, the one-year bar in an IPR is not such a characteristic because it does not give the Board the authority to invalidate a patent. Instead, the Court reasoned that the time bar sets out the procedure for seeking an IPR and is “merely a rule that seeks to promote the orderly progress of litigation by requiring that the parties take certain procedural steps at certain specified times.” Id. The Court further explained that the Board addressing the time-bar issue in its final written decision “does not mean the issue suddenly becomes available for review or that the issue goes to the Board’s ultimate authority to invalidate—the Board is always entitled to reconsider its own decisions.” Id. at 12. \nThe Federal Circuit’s Achates decision thus appears to confirm that the Federal Circuit will not review certain threshold issues in an IPR addressed at the time of institution, even if such issues are again later addressed in the final written decision. But we may not have heard the final word on these issues – a petition for an en banc rehearing has been filed in Versata II , and another may be imminent in Achates . \nDISCLAIMER: Because of the generality of this update, the information provided herein may not be applicable in all situations and should not be acted upon without specific legal advice based on particular situations. \n© Mintz Levin - Global IP Matters | Attorney Advertising Your first step to building a free, personalized, morning email brief covering pertinent authors and topics on JD Supra: Sign up to create your digest using LinkedIn * (Updated: October 8, 2015) \nJD Supra provides users with access to its legal industry publishing services (the \"Service\") through Information Collection and Use by JD Supra \nogs IP addresses and aggregates non-personally identifiable user data and browser type. This data is gathered using cookies and other technologies. \nThe information and data collected is used to authenticate users and to send notifications relating to the Service, including email alerts to which users have subscribed; to manage the Service and Website, to improve the Service and to customize the user's experience. This information is also provided to the authors of the content to give them insight into their readership and help them to improve their content, so that it is most useful for our users. \nof user information at any time. \nIf you have reason to believe that your interaction with us is no longer secure, you must immediately notify us of the problem by contacting us at info@jdsupra.com Sharing and Disclosure of Information JD Supra Collects \n& \nIn the event there is a change in the corporate structure of JD Supra such as, but not limited to, merger, consolidation, sale, liquidation or transfer of substantial assets, JD Supra may, in its sole discretion, transfer, sell or assign information collected on and through the Service to one or more affiliated or unaffiliated third parties. \nyour use of and activity on those other sites. We encourage you to read the legal notices posted on those sites, including their privacy policies. We shall have no responsibility or liability for your visitation to, and the data collection and use practices of, such other sites. This Policy applies solely to the information collected in connection with your use of this Website and does not apply to any practices conducted offline or in connection with any other websites. Changes in Our Privacy Policy \ninfo@jdsupra.com - hide Or, sign up using your email address. ×", "external_links": [], "published": "2015-10-10T04:23:00.000+03:00", "crawled": "2015-10-10T04:25:12.622+03:00", "highlightTitle": ""}