{"organizations": [], "uuid": "f3dd981d8b863db989c6005fa5c03ecf84208f8b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.technology.org", "main_image": "http://www.technology.org/texorgwp/wp-content/uploads/2015/10/laptop-the-port-720x480.jpg", "site_section": "http://feeds.feedburner.com/TechnologyOrg", "section_title": "Technology Org", "url": "http://www.technology.org/2015/10/19/hacking-for-peace-hi-tech-solutions-for-the-humanitarian-field/", "country": "", "title": "Hacking for peace: hi-tech solutions for the humanitarian field", "performance_score": 0, "site": "technology.org", "participants_count": 1, "title_full": "Hacking for peace: hi-tech solutions for the humanitarian field", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T14:05:00.000+03:00", "replies_count": 0, "uuid": "f3dd981d8b863db989c6005fa5c03ecf84208f8b"}, "author": "Alius Noreika", "url": "http://www.technology.org/2015/10/19/hacking-for-peace-hi-tech-solutions-for-the-humanitarian-field/", "ord_in_thread": 0, "title": "Hacking for peace: hi-tech solutions for the humanitarian field", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Hacking for peace: hi-tech solutions for the humanitarian field Posted Today \n“Hacking a rice bag” might seem like a lot of non-sense to you – but not the enthusiastic participants of THE Port Hackathon, who had been hacking for “peace and health” at CERN and Campus Biotech earlier this month. Image courtesy of THE Port and Light My Photo team . \nThe event (already reported in more detail here ) invited experts from a variety of disciplines to put their heads (and skills) together, and develop functioning tech-enabled tools ranging from a better airdrop bag for humanitarian cargo to explosion detector with forensic precision for conflict zones. \nHumanitarian food air delivery could be more efficient \nDelivering aid to crisis regions is not an easy task, especially where conflict and natural disasters leave large areas completely inaccessible by land. For this reason, humanitarian organizations, e.g. Red Cross, have recently come to use “airdrop bags” for delivering food and other goods by air. \nBags are dropped from as high as 125 metres so, quite naturally, have to be reliable and burst-free. The bags are therefore often folded up to 6 times, which makes their production a time-consuming, not to mention an environmentally unfriendly process. \nAfter three days of “tailoring and dropping” at THE Port, the team “Cargo Cult” has come up with an innovative design for an airdrop bag, which is easier to put together, yet withstands impact and leaves cargo unharmed. Rice airdrop bag test. Credit: THE Port and Cargo Cult. \nPerhaps unsurprisingly, the best results were achieved with more elastic materials. The ultimate “winner” in the end was ROLAMIT®, which, according to the manufacturers, is flexible and has tear resistance, as well as puncture and chemical resistance properties. The team also proposed an inspired idea to sow the bags in an accordion-like fashion to allow easy expansion. Another inspired idea including taping, rather than sowing the bags together, which proved to be reliable and saved valuable production minutes. \nWhile this may seem like small improvements in general, when 4 million bags like these are dropped per year, it is bound to make a big difference. Continuing experimentations and taking advantage of new high-tech materials that are increasingly becoming more affordable, could lead to even more economically and environmentally friendly solutions. \nEmpowering women in a crisis \nGoing beyond the basic needs of crisis refugees, the team “Bridge it” took up the task to reduce the technology gender gap that is prevalent in the developing countries. Be it cultural or economic circumstances (or both), men often dominate technology in more disadvantaged places of the world; however, an ability to use something as mundane to us as a mobile phone would enable women to express their needs and feel more secure, especially so in already adverse settings. \nUsing a case of internally displaced person (IDP) camps in Iraq, the team developed an easy-to-use application for women, which could run on tablets and smartphones allocated to women-friendly zones in IDP camps. The interface, based on icons (already familiar in humanitarian context), text and audio, allows to send and receive information regardless of the user’s literacy. Mock-up interface of “Bridge it” app for women in IDP camps. Credit: teambridgeit.com . \nWomen could use the app to submit specific requests for aid (e.g. food or diapers), anonymous complaints (e.g. reporting abuse) and receive important notifications from any NGO, which has access to the system. Gamified elements could extend the use of the technology to children as well. \nThe team has communicated with external advisors from the camps, to ensure the app is usable and acceptable in actual IDP settings. According to the members of “Bridge it”, this might be a small, but nevertheless significant step to bridging technology gender gap where it is most prevalent: “We won’t necessarily change the world, but if we can make even a small difference, then it is still a great start!” \nOne platform to collect and visualize humanitarian data real-time \nHumanitarian aid faces many challenges – first and foremost, it is essential to know where and what help is needed. Unfortunately, collecting and analysing humanitarian data can be a challenge; often there is a wide variety of sources, a range of data formats, and the amount of information can simply be overwhelming to individual humanitarian workers. \nTeam “Datasaurus” have proposed a universal way for integrating various types of data for just this purpose. Uploaded data would be organized and analysed automatically, while a powerful visualization engine would allow to create detailed 3D maps of disaster areas. These could further be overlaid with other desired information – e.g. logs of human right violations, status and feedback of humanitarian actions taken etc. \nMost importantly, such visualizations could be accessible real-time, which would help to allocate resources to regions that need them the most. Such “coordinated effort” would by all means exceed any isolated endeavours, and ensure that more people in crisis situations get at least their basic needs met, including access to food, water and safe shelter. \nForensic fingerprinting of explosions for 20$ \nArmed conflict did not go undetected at THE Port either – in fact, team Blastbusters.org have proposed a powerful solution for tracking explosions in warzones. According to the team, their constructed e3e Monitor (Explosion and Extreme Energy Event Monitor) could finally provide “data that bears witness”, as up until now, data on such extreme events have been limited to eye-witness reports or official statements, which can never tell the whole story. \nA 7-component system would cost less than 20$ to produce, yet be able to detect precise acoustic signature of any explosion, and track pre- and post-explosion acoustics. As armed forces tend to use unique explosives and delivery mechanisms, such data could help to get “forensically close” to the source (and culprit) of the explosion. Extra power of the system would come from making the data publically available as soon as it comes in. \nAcoustic signatures could be combined with other data as well, e.g. geolocated tweets and emotional mapping (Emo-mapping) of victims and witnesses. Such an approach would, for the first time, be able to generate precise empirical data around explosions, rather than relying on subjective reports. \ne3e Monitor can be easily disguised and parachuted into any area, and, according to the team, “keeps its secrets safe”, as all data is encrypted. Since it is so cheap to produce, it could be easily scaled up to track extreme events throughout the world. \n— \nThe prototypes have been developed in consultation with representatives of the humanitarian field, and have realistic potential to become functional tools that help maintain peace and equity in the world – all that in 60 hours of brainstorming and hacking at THE Port. \nWritten by Eglė Marija Ramanauskaitė Related Topics:", "external_links": [], "published": "2015-10-19T14:05:00.000+03:00", "crawled": "2015-10-19T14:47:15.656+03:00", "highlightTitle": ""}