{"organizations": [], "uuid": "f25ed3410f81fc429b37a3937413d945f2e080d0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.menafn.com", "main_image": "http://menafn.com/images/shared/menafnlogo_sm.gif", "site_section": "http://www.menafn.com/rss/menafn_Comm_Tech_Technologies.xml", "section_title": "MENAFN.com Comm_Tech_Technologies", "url": "http://www.menafn.com/1094388908/du-and-Geotabs-smart-vehicles-put-UAE-businesses-in-the-fast-lane&src=RSS", "country": "", "title": "du and Geotabs smart vehicles put UAE businesses in the fast lane", "performance_score": 0, "site": "menafn.com", "participants_count": 1, "title_full": "du and Geotabs smart vehicles put UAE businesses in the fast lane | MENAFN.COM", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "f25ed3410f81fc429b37a3937413d945f2e080d0"}, "author": "Press", "url": "http://www.menafn.com/1094388908/du-and-Geotabs-smart-vehicles-put-UAE-businesses-in-the-fast-lane&src=RSS", "ord_in_thread": 0, "title": "du and Geotabs smart vehicles put UAE businesses in the fast lane", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(MENAFN Press) du, in conjunction with Geotab, will use the latest Smart City technology to revolutionise the running of commercial vehicles in the UAE. Fleets of vehicles belonging to businesses will be fitted with Geotab's telematics hardware and special SIMs to share data on performance, opening up new levels of efficiency. Canadian firm Geotab will provide the hardware and software; supported by the du network and cloud infrastructure.\n\nWith roads being the primary method of transporting goods and staff in the UAE, the new technology stands to benefit many businesses of all sizes and sectors. Geotab's technology offers an almost infinite choice of sensor application and real-time insights into all manner of fleet performance. The smallest details of bad driver habits, such as speeding and harsh braking, can be identified to reduce maintenance costs, as well as who is leaving doors open on refrigerated food deliveries and ruining stock. Sensors will also report more detailed diagnostics to monitor condition and wear and tear on a fleet “ allowing for a more preventative and cost effective approach to repairs. \n\nFahad Al Hassawi, Chief Commercial Officer, du, said: \"For the first time businesses will really know what is happening with any of their vehicles at any time. We're always looking for Smart technologies like this to help businesses make better decisions and save money.\"\n\nThe new insights created by this technology will enable better informed decisions on many aspects of fleet management: route planning, delivery times, fuel savings, driver performance and safety. Having a real-time view of an entire fleet will also allow issues concerning the business owner to be identified immediately. Over time, these improvements can significantly boost service, reduce operating costs and increase efficiency for UAE firms “ bringing growth for them and the wider economy. \n\nStewart Somerville, Managing Director of Geotab Middle East said: \"From a business perspective we view our alliance with du as a perfect partnership. The market focus and energy that is an inherent part of the du DNA, coupled to our world-leading telematics technology allows us to become an integral part of the drive toward safer roads in the UAE.\"\nThe service is part of a growing list of Smart City technologies brought to the UAE by du. Recently du introduced the Middle East's first successful Internet of Things network, a future internet evolution that works by inserting technology into objects so they can relay data and interact with their surroundings - making every day things 'smart'. Last year du also introduced WiFi UAE to improve internet services for residents and visitors. \n\nAbout du \nWe started operating in 2007, offering mobile and fixed telephony, broadband connectivity and IPTV services. Today, we serve more than 7.5 million individual customers and over 80,000 businesses in the UAE. We also provide carrier services for businesses and satellite up/downlink services for TV broadcasters. We won the Gallup Great Workplace Award. Our recruitment strategy aims to provide fulfilling opportunities for quality talent in a cosmopolitan working environment where more than 60 nationalities work 35% of which are Emiratis. We are the first telecom company in the world to release a Sustainability Report based on GRI-G4 comprehensive guidelines. Among our other laurels, we also have the credit of being the first in the UAE to be awarded with prestigious LEED Platinum certification for 2 of our green retail outlet. du is 39.5 percent owned by Emirates Investment Authority, 20.08 percent by Mubadala Development Company PJSC, 19.5 percent by Emirates Communications and Technology LLC and the remaining by public shareholders. Listed on the Dubai Financial Market (DFM), the company trades under the name 'du'.", "external_links": [], "published": "2015-10-19T03:00:00.000+03:00", "crawled": "2015-10-19T12:50:51.635+03:00", "highlightTitle": ""}