{"organizations": [], "uuid": "e9642b0a6c7570811669d33560cb8dc22853b24d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266385/technology-general", "section_title": "Technology Press Releases from PRWeb - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30184259/fcpx-plugin-transplit-parallax-is-released-by-pixel-film-studios", "country": "US", "title": "FCPX Plugin TranSplit Parallax Is Released by Pixel Film Studios", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "FCPX Plugin TranSplit Parallax Is Released by Pixel Film Studios - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T12:01:00.000+03:00", "replies_count": 0, "uuid": "e9642b0a6c7570811669d33560cb8dc22853b24d"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30184259/fcpx-plugin-transplit-parallax-is-released-by-pixel-film-studios", "ord_in_thread": 0, "title": "FCPX Plugin TranSplit Parallax Is Released by Pixel Film Studios", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "TranSplit Parallax is a new Final Cut Pro X Effect released by Pixel Film Studios.\nAliso Viejo, CA (PRWEB) October 05, 2015\nPixel Film Studios brings FCPX users brand new styles of frame-splitting kinetic panel transitions with TranSplit Parallax for FCPX. TranSplit: Parallax contains over 30 preset styles with over 40 panel layouts to choose from, giving users limitless creative tools to make different transition styles. Simply drag & drop between desired clips, then style them in unique ways.\nTranSplit Parallax contains over 30 presets for the user to start from, including options with and without Motion Blur for added realism. FCPX users have the ability to select options with and without text and text masks, for added versatility and more style choices. Each preset contains color and blend mode control options, multiple panel selections, emitter options and more.\nTranSplit Parallax contains so many options for the user to mix and match that each transition can be unique from the last. Each preset includes up to 4 different masked layers with blend mode controls, along with full emitter controls to adjust particle color and size, as well as the random placement of each. Creating new and fresh styles is simple and easy.\nTranSplit Parallax presets include numerous style controls, including panel shadow options, editable text, emitter controls, and blend mode options. Users can combine all the effects for unlimited style options for each transition style. Each preset has all the controls the user could want to modify each transition independently.\nTranSplit Parallax is designed as a Drag & Drop Transition tool. FCPX users apply the transitions to the timline between the desired clips and stretch them to the appropriate length. All the style controls are located in the inspector window, while text on-screen controls are located in the master viewer.\nEstablished in 2006, Aliso Viejo, California-based Pixel Film Studios is an innovative developer of visual effects tools for the post-production and broadcast community. Their products are integrated with popular non-linear editing and compositing products from Apple FCPX . Apple, the Apple logo, Mac OS X, and Macintosh are registered trademarks of Apple Inc. in the U.S. and/or other countries. All other trademarks and trade names are the property of their respective owners.\n //www.prweb.com/releases/2015/10/prweb13002209.htm\n ", "external_links": ["http://www.prweb.com/releases/2015/10/prweb13002209.htm", "http://store.pixelfilmstudios.com/"], "published": "2015-10-05T12:01:00.000+03:00", "crawled": "2015-10-05T11:04:20.790+03:00", "highlightTitle": ""}