{"organizations": [], "uuid": "83f68cb5272a2bdef7e7766f1727a2fa4a336875", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.businessspectator.com.au", "main_image": "", "site_section": "http://www.businessspectator.com.au/technology", "section_title": "Technology | Business Spectator", "url": "https://www.businessspectator.com.au/news/2015/10/15/politics/govt-reapproves-adani-coal-mine", "country": "US", "title": "Govt reapproves Adani coal mine", "performance_score": 0, "site": "businessspectator.com.au", "participants_count": 1, "title_full": "Govt reapproves Adani coal mine | Business Spectator", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T23:31:00.000+03:00", "replies_count": 0, "uuid": "83f68cb5272a2bdef7e7766f1727a2fa4a336875"}, "author": "Dow Jones newswires", "url": "https://www.businessspectator.com.au/news/2015/10/15/politics/govt-reapproves-adani-coal-mine", "ord_in_thread": 0, "title": "Govt reapproves Adani coal mine", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The federal government reapproved Adani Group's plans for a major coal mine and rail line in eastern Australia, injecting momentum into a multibillion-dollar project that had snagged on environmental concerns and the global commodity price slump.\nEnvironment Minister Greg Hunt attached 36 conditions to his approval of Adani's Carmichael coal mine and associated infrastructure in the Galilee Basin of eastern Queensland.\nAdani aims to produce as much as 60 million tonnes of thermal coal annually for export to its power plants in India. Previous estimates have pegged the construction costs at $16.5 billion ($US12.1bn).\nMr Hunt also approved Adani's plans to build a rail line connecting the Carmichael mine with existing ports, which face the Great Barrier Reef.\nIt comes more than two months after a federal court in Sydney overturned the minister's earlier approval for Adani to build the Carmichael coal mine. Environmental activists had raised concerns about the project's impact on the yakka skink -- a native Australian lizard -- and another vulnerable species, the ornamental snake.\nAdani and Mr Hunt had blamed the August 5 court ruling on red tape. Mr Hunt approved the mining project last year, but it was overturned because of what the environment department termed a \"technical, administrative\" issue. It said its advice to Mr Hunt during the approval process may not have been provided in the correct manner.\nOn Thursday, Mr Hunt said several conditions attached to the latest approval were designed to protect the ornamental snake and yakka skink. Measures include limiting disturbance to identified tracks and the rehabilitation of impacted areas. Also, at least 135 hectares of ornamental snake habitat and at least 5,600 hectares of yakka skink habitat must be protected and managed by Adani.\nHowever, Adani still needs to arrange financing for construction of the mine while thermal-coal prices remain at multi-year lows, putting the viability of the project in doubt.\nEnvironmentalists have campaigned for global lenders such as Morgan Stanley and Deutsche Bank to rule out any financial support for Adani's proposed expansion of the Abbot Point coal port, seeking to undermine the Indian company's plans.", "external_links": [], "published": "2015-10-15T23:31:00.000+03:00", "crawled": "2015-10-15T07:48:00.106+03:00", "highlightTitle": ""}