{"organizations": [], "uuid": "fd568050be73487e04df4bba5547c3f916f72237", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bio-medicine.org", "main_image": "", "site_section": "http://www.bio-medicine.org/inc/biomed/medicine-technology.asp", "section_title": "Latest Medical Technology from Bio-Medicine.Org", "url": "http://www.bio-medicine.org/medicine-technology-1/Big-Data-Cost-and-Utilization-in-the-Pharmaceutical-Industry-Examined-in-Benchmarking-Study-49070-1/", "country": "US", "title": "Big Data Cost and Utilization in the Pharmaceutical Industry Examined in Benchmarking Study", "performance_score": 0, "site": "bio-medicine.org", "participants_count": 0, "title_full": "Big Data Cost and Utilization in the Pharmaceutical Industry Examined in Benchmarking Study", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T21:27:00.000+03:00", "replies_count": 0, "uuid": "fd568050be73487e04df4bba5547c3f916f72237"}, "author": "", "url": "http://www.bio-medicine.org/medicine-technology-1/Big-Data-Cost-and-Utilization-in-the-Pharmaceutical-Industry-Examined-in-Benchmarking-Study-49070-1/", "ord_in_thread": 0, "title": "Big Data Cost and Utilization in the Pharmaceutical Industry Examined in Benchmarking Study", "locations": ["CHAPEL HILL N.C."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "RSS Navigation Links HOME >> MEDICINE >> TECHNOLOGY Big Data Cost and Utilization in the Pharmaceutical Industry Examined in Benchmarking Study ... CHAPEL HILL N.C. Oct. 19 2015 /PRNewswire...However the inherent costs and challenges that come with harnessing l...Thus as pharma moves to develop Big Data capabilities they are wrestl...To inform these efforts and to probe current trends and best practices... http://feeds.bio-medicine.org/latest-medical-technology Date:10/19/2015 \nCHAPEL HILL, N.C. , Oct. 19, 2015 /PRNewswire/ -- The rapid evolution of Big Data is generating greater insights for both medical and commercial decisions within the biopharmaceutical industry. \nHowever, the inherent costs and challenges that come with harnessing large sets of information in varied formats have caused the pharmaceutical sector to embrace Big Data analytics slower than other industries, such as the consumer goods sector. \nThus, as pharma moves to develop Big Data capabilities they are wrestling with questions such as what is the appropriate budget level, and what data capabilities do we need? \nTo inform these efforts and to probe current trends and best practices in utilizing Big Data, Best Practices, LLC has published \" Analytics Excellence: Current and Future Trends for Big Data Utilization in Pharma .\" \nThe study, which has healthy amounts of both qualitative and quantitative data, addresses many issues that analytics leaders are wrestling with, including Big Data's price tag. \nData management - data acquisition and infrastructure - represents about 60 percent of study participants' Big Data non-labor budget. It also is expected to make up most of the future cost growth for companies as they expand their data capabilities and utilization of Big Data, according to the study. The average Big Data non-labor budget for all participants in the research project was just over $14 million. \nThe depth of insights in the study extends across the critical components of pharma-oriented Big Data programs and includes: The types of Big Data projects and data being used The types of data being used for specific medical and commercial Big Data projects The data types and sources that are most valuable How companies are organizing their Big Data efforts How much staffing and budgetary resources companies are investing in Big Data Who are the most useful partners for Big Data projects Big Data applications for Health Economics Outcomes Research studies \nBest Practices, LLC engaged 22 leaders from 18 pharmaceutical companies through a benchmarking survey. Research analysts also conducted seven deep-dive executive interviews with selected benchmark participants. \nTo learn more about this report, download a complimentary report excerpt at http://www3.best-in-class.com/rr1387.htm . \nFor related research, visit our Best Practices, LLC Web site at www.best-in-class.com/ . \nABOUT BEST PRACTICES, LLC \nBest Practices, LLC is a leading benchmarking and advisory services firm serving pharmaceutical and medical device companies worldwide. Best Practices, LLC's clients include all the top 10 and most of the top 50 pharmaceutical companies. The firm conducts primary research and uses its comprehensive benchmarking tools and executives interviews to form the basis for our Benchmarking Reports and advisory services utilized by top executives. Best Practices, LLC believes in the profound principle that organizations can chart a course to superior economic performance by studying the best business practices, operating tactics and winning strategies of world-class companies.", "external_links": [], "published": "2015-10-19T21:27:00.000+03:00", "crawled": "2015-10-19T22:17:49.907+03:00", "highlightTitle": ""}