{"organizations": ["EMEA", "Sabre Airline Solutions", "Sabre", "Securities and Exchange Commission", "Oman Air"], "uuid": "c89b201df2eefaf384bdf48ef8ad852acb51bf38", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "science-technology.news-articles.net", "main_image": "", "site_section": "http://science-technology.news-articles.net/content/rss.php", "section_title": "Science and Technology @ News Articles Network", "url": "http://science-technology.news-articles.net/content/oman-air-renews-sabresonic-passenger-services-system-agreement-sabre-drive-growth-enhance-traveler-experience.xhtml", "country": "US", "title": "Oman Air renews SabreSonic Passenger Services System agreement with Sabre to drive growth and enhance traveler experience", "performance_score": 0, "site": "news-articles.net", "participants_count": 0, "title_full": "Oman Air renews SabreSonic Passenger Services System agreement with Sabre to drive growth and enhance traveler experience", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T18:25:00.000+03:00", "replies_count": 0, "uuid": "c89b201df2eefaf384bdf48ef8ad852acb51bf38"}, "author": "", "url": "http://science-technology.news-articles.net/content/oman-air-renews-sabresonic-passenger-services-system-agreement-sabre-drive-growth-enhance-traveler-experience.xhtml", "ord_in_thread": 0, "title": "Oman Air renews SabreSonic Passenger Services System agreement with Sabre to drive growth and enhance traveler experience", "locations": ["Oman", "Texas", "MUSCAT", "SOUTHLAKE"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Dino Gelmetti", "Paul Gregorowitsch"], "text": "Oman Air renews SabreSonic Passenger Services System agreement with Sabre to drive growth and enhance traveler experience   Published on 2015-10-05 07:46:00 Oman Air renews SabreSonic Passenger Services System agreement with Sabre to drive... -- SOUTHLAKE, Texas and MUSCAT, Oman,   Sabre logo. Sabre logo.  ><- stripped tags -> SOUTHLAKE, Texas and MUSCAT, Oman,   Oman's flagship carrier, Oman Air, has signed an agreement with global technology provider, [[UEdFZ2NtVnNQVndpYm05bWIyeHNiM2RjSWlCdmJtTnNhV05yUFNkc2FXNXJUMjVEYkdsamF5aDBhR2x6S1NjZ2FISmxaajFjSW1oMGRIQTZMeTkzZDNjdWMyRmljbVV1WTI5dEwxd2lJSEpsYkQxY0ltNXZabTlzYkc5M1hDSWdkR0Z5WjJWMFBWd2lYMkpzWVc1clhDSStVMkZpY21VZ1EyOXljRzl5WVhScGIyNDhMMkUrfA==]] (NASDAQ: [[UEdFZ2NtVnNQVndpYm05bWIyeHNiM2RjSWlCb2NtVm1QU2RvZEhSd09pOHZjM1IxWkdsdkxUVXVabWx1WVc1amFXRnNZMjl1ZEdWdWRDNWpiMjB2Y0hKdVpYZHpQMUJoWjJVOVVYVnZkR1VtVkdsamEyVnlQVk5CUWxJbklISmxiRDBuYm05bWIyeHNiM2NuSUhSaGNtZGxkRDBuWDJKc1lXNXJKeUIwYVhSc1pUMG5VMEZDVWljZ2IyNWpiR2xqYXowbmJHbHVhMDl1UTJ4cFkyc29kR2hwY3lrbklISmxiRDBuYm05bWIyeHNiM2NuUGxOQlFsSThMMkUrfA==]]), to extend its Passenger Services System, [[UEdFZ2NtVnNQVndpYm05bWIyeHNiM2RjSWlCdmJtTnNhV05yUFNkc2FXNXJUMjVEYkdsamF5aDBhR2x6S1NjZ2FISmxaajFjSW1oMGRIQTZMeTkzZDNjdWMyRmljbVZoYVhKc2FXNWxjMjlzZFhScGIyNXpMbU52YlM5b2IyMWxMM052Wm5SM1lYSmxYM052YkhWMGFXOXVjeTlqZFhOMGIyMWxjbDl6WVd4bGMxOXpaWEoyYVdObFhDSWdjbVZzUFZ3aWJtOW1iMnhzYjNkY0lpQjBZWEpuWlhROVhDSmZZbXhoYm10Y0lqNVRZV0p5WlZOdmJtbGpKaU14TnpRN0lFTjFjM1J2YldWeUlGTmhiR1Z6SUNZZ1UyVnlkbWxqWlNBb1ExTlRLVHd2WVQ0PXw=]]. Under the agreement, Sabre will supply additional technology that enhances the shopping experience for customers and creates more meaningful and profitable interactions with passengers throughout their journeys. A SabreSonic customer for the past 13 years, Oman Air has steadily grown its presence, and has now embarked on a fleet and network expansion programme to increase its global footprint. To support this growth, the carrier has selected two key SabreSonic shopping solutions – Interline Branded Fares and Dynamic Rewards . Together, these simplify the shopping experience for the customer, driving sales and optimising partnership revenue streams. Over recent years, Oman Air has won a string of accolades for its customer service, catering and business and economy class seats at the Skytrax World Airline Awards. Now the airline will pioneer Sabre's shopping technology to further differentiate itself from its competitors, creating an enriched experience for passengers and promoting its strong brand to an international audience. \"We are pleased to be expanding our already successful relationship with Sabre. The company's highly advanced technology supports our vision for offering customers the best possible experience, from booking their tickets to arriving at their destinations,\" said Paul Gregorowitsch, CEO of Oman Air. \"We are currently engaged in an expansion programme that will see us increase our fleet to 70 aircraft by 2020. Our network will continue to grow correspondingly, and we will continue to add exciting destinations around the world. Employing the latest state-of-the-art technology from Sabre is an essential support for our ongoing expansion. In addition, Oman Air is already widely recognised for its high levels of customer service and outstanding passenger experience. Sabre's technology will further help to cement Oman Air's global reputation for quality and service.\" Oman Air joins a growing group of forward-thinking airlines that are using Sabre's flexible portfolio of shopping products to increase sales conversions, enable a single shopping display across all itineraries, create long-term customer loyalty through flexible reward pricing and empower customers to self-service their travel journeys. \"Oman Air is a fast-growing carrier and long-term customer of Sabre,\" said Dino Gelmetti , vice president EMEA at Sabre Airline Solutions. \"We are proud to expand our relationship to deliver innovative technology that helps meet the airline's critical business needs. Using our technology, Oman Air will look to transform its core offerings into new products and services that drive revenue growth and improve margins, while providing its customers with greater choice and a more seamless, personalised shopping experience.\" Sabre's technology is favoured by more than 225 airlines worldwide, including most of the world's largest carriers. Its flexible and scalable software allows airlines to operate how they want to, and adapt their business to changing needs and requirements. It optimises day-to-day airline operations and ultimately helps airlines solve their biggest challenges – to increase revenues, reduce costs and deliver better travel experiences. Cautionary Note Regarding Forward-Looking Statements Any statements in this release regarding Sabre that are not historical or current facts are forward-looking statements. Such forward-looking statements convey Sabre's current expectations or forecasts of future events. Forward-looking statements regarding Sabre involve known and unknown risks, uncertainties and other factors that may cause Sabre's actual results, performance or achievements to be materially different from any future results, performances or achievements expressed or implied by the forward-looking statements. Certain of these risks and uncertainties are described in the \"Risk Factors\" and \"Cautionary Note Regarding Forward-Looking Statements\" sections of Sabre's registration statement on Form S-1, the \"Risk Factors\" and \"Forward-Looking Statements\" sections of its Quarterly Report on Form 10-Q, and any of Sabre's other applicable filings with the Securities and Exchange Commission. Unless required by law, Sabre undertakes no obligation to publicly update or revise any forward-looking statements to reflect circumstances or events after the date of this press release. Media Contact:", "external_links": [], "published": "2015-10-05T18:25:00.000+03:00", "crawled": "2015-10-05T18:11:29.419+03:00", "highlightTitle": ""}