{"organizations": [], "uuid": "5e74bdaba62479d67fdda85f291bb57d4649c29f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266385/technology-general", "section_title": "Technology Press Releases from PRWeb - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30186078/headspring-hires-john-sarantakes-to-expand-the-impact-of-the-companys-unique-roi-driven-delivery-model", "country": "US", "title": "Headspring Hires John Sarantakes to Expand the Impact of the Companys Unique ROI-Driven Delivery Model", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Headspring Hires John Sarantakes to Expand the Impact of the Companys Unique ROI-Driven Delivery Model - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T17:01:00.000+03:00", "replies_count": 0, "uuid": "5e74bdaba62479d67fdda85f291bb57d4649c29f"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30186078/headspring-hires-john-sarantakes-to-expand-the-impact-of-the-companys-unique-roi-driven-delivery-model", "ord_in_thread": 0, "title": "Headspring Hires John Sarantakes to Expand the Impact of the Companys Unique ROI-Driven Delivery Model", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "New sales executive is part of Headspring’s continued fast paced growth and market share expansion\nAustin, TX (PRWEB) October 05, 2015\nHeadspring , a business transformation catalyst that aligns application portfolios to enterprise business goals, today announced the addition of John Sarantakes as the new director of sales and marketing.\nIn this position, Sarantakes will be responsible for leading the growth of Headspring, across all offices, in support of revenue growth and customer acquisition through new strategic marketing activities. In addition, he will spearhead the new roll out of Headspring’s innovative ROI-driven delivery model (RDDMTM) to Fortune 500 enterprise customers – effectively changing the very nature of how the industry views enterprise application development.\n“We are very proud to welcome John to our team,” said JT McCormick, President of Headspring. “We have provided the highest quality enterprise application development solutions and customer service for more than 14 years while largely flying just under the radar. John will change that for us and allow Headspring to help many more organizations gain competitive advantages and digital efficiencies through our ROI-driven delivery model.”\nPrior to joining Headspring, Sarantakes worked as senior vice-president of sales at Absolute Software and was responsible for global operational leadership, strategic direction, and sales management. In that role, he was able to deliver global revenue growth in an excess of 85 percent, while growing commercial customers by 150 percent.\nIn addition, Sarantakes lead the team that won the Visionary Vendor on Gartner’s Magic Quadrant for Client Management & Mobile Device Management; the National Leadership Award Deloitte Technology Fast 500; and the International Stevie Award for Best Sales Team. He holds a bachelor of business administration from Washington State University.\nAbout Headspring\nHeadspring is a business transformation catalyst with a unique and accelerated planning and delivery model that aligns software application portfolios to enterprise business goals — providing the best ROI in the industry. As a business transformation catalyst, Headspring defines a new category beyond traditional AD&D. Headspring’s unique value-based, fixed price model and 100% onshore technical teams deliver an industry-leading 98.2% project success rate and early ROI recovery. Enterprise clients include ExxonMobil, Dell, Whole Foods, Koch Industries, Caterpillar, and Wells Fargo. The company’s services include application portfolio rationalization, application development, mobility, and cloud applications. For more information, visit http://www.headspring.com or call (877) 459–2260.\n //www.prweb.com/releases/2015/10/prweb13001016.htm\n ", "external_links": ["http://www.prweb.com/releases/2015/10/prweb13001016.htm"], "published": "2015-10-05T17:01:00.000+03:00", "crawled": "2015-10-05T16:16:42.849+03:00", "highlightTitle": ""}