{"organizations": [], "uuid": "0d4ba5a568d4d1c40c7d2ecba53a6815ac9ed652", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1135409/visible-measures-receives-media-rating-council-mrc-accreditation-viewability", "country": "US", "title": "Visible Measures Receives Media Rating Council (MRC) Accreditation for Viewability", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "Visible Measures Receives Media Rating Council (MRC) Accreditation for Viewability", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T20:15:00.000+03:00", "replies_count": 0, "uuid": "0d4ba5a568d4d1c40c7d2ecba53a6815ac9ed652"}, "author": "admin", "url": "http://www.freshnews.com/news/1135409/visible-measures-receives-media-rating-council-mrc-accreditation-viewability", "ord_in_thread": 0, "title": "Visible Measures Receives Media Rating Council (MRC) Accreditation for Viewability", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Submitted by admin on 10/1/2015 @ 10:15 AM Companies mentioned in this article: Visible Measures \nBOSTON -- (BUSINESS WIRE) -- Visible Measures , the leader in content advertising technology, today announced that the Media Rating Council (MRC) has accredited desktop viewable impressions and related viewability metrics for the company’s SkipStream, ChoiceRoll and Pre-Roll video ad formats, as well as Total Display Impressions (served). This expands Visible Measures suite of accredited video metrics by adding to Total Video Impressions (served), Engagement Score and True Reach TM . The MRC is a non-profit industry association whose goal is to secure for the industry measurement services that are valid, reliable and effective. \n“We are pleased that the MRC has accredited the viewability metrics we are using to deliver outstanding campaign results to brands and agencies,” said Brian Shin, CEO of Visible Measures. “Our platform provides both MRC accredited data and 3 rd party viewability validation, combined with our comprehensive set of MRC accredited video metrics, ensuring quality and control for Visible Measures clients.” \nAccredited viewability metrics provide assurance that viewers of content advertising have a legitimate opportunity to see the videos. When combined with accredited video impression and engagement data, these metrics provide a path to unique campaign insights. \n“The MRC congratulates Visible Measures for achieving accreditation in the important viewability category for its in-stream video products,” said George W. Ivie, Executive Director and CEO of MRC. “The company continues to innovate while adhering to the rigorous MRC standards for quality and disclosure.” \nVisible Measures’ True Reach enables advertisers and agencies to track the performance of their paid, owned and earned media assets across the web. First accredited in 2012, True Reach combines these media assets into one overall metric for a campaign, providing a complete view of campaign performance. True Reach accounts for clips uploaded by the brands and their agencies as well as clips driven directly by audiences, resulting in a comprehensive measure of content advertising exposure. \nAbout the Media Rating Council (MRC) \nThe MRC is a non-profit industry association established in 1963 composed of leading television, radio, print and Internet companies, as well as advertisers, advertising agencies and trade associations whose goal is to ensure measurement services that are valid, reliable and effective. Measurement services desiring MRC Accreditation are required to disclose to their customers all methodological aspects of their service; comply with the MRC Minimum Standards for Media Rating Research and other standards MRC produces; and submit to MRC-designed audits to authenticate and illuminate their procedures. In addition, the MRC membership actively pursues research issues they consider priorities in an effort to improve the quality of research in the marketplace. Currently approximately 100 research products are audited by the MRC. \nAbout Visible Measures \nVisible Measures, the leading content advertising technology provider, enables brands to better compete for consumer engagement by maximizing their Share of Attention relative to media spend in video content advertising. The company’s platform is fueled by a massive proprietary dataset, as well as patented programmatic technology that combines five trillion data points to reach more than 500 million unique monthly users across 600,000 web and mobile properties. World class advertisers and brands successfully rely on Visible Measures’ video content advertising platform every day to drive unmatched consumer engagement worldwide. Visit us online at www.visiblemeasures.com or follow us on Twitter @visiblemeasures. \nTrue Reach and Visible Measures and the Visible Measures logo are registered marks owned by Visible Measures Corp. Other company and product names may be trademarks or servicemarks of their respective owners. View source version on businesswire.com: http://www.businesswire.com/news/home/20151001006584/en/ Copyright © Business Wire 2015", "external_links": [], "published": "2015-10-01T20:15:00.000+03:00", "crawled": "2015-10-01T21:04:51.476+03:00", "highlightTitle": ""}