{"organizations": [], "uuid": "5ee2ff0a1785009b3dcf75fa4900c2bc10bc81fd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "money.cnn.com", "main_image": "http://i2.cdn.turner.com/money/dam/assets/151014115925-target-card-780x439.jpg", "site_section": "http://rss.cnn.com/rss/money_technology.rss\r", "section_title": "Technology news - CNNMoney.com", "url": "http://money.cnn.com/2015/10/14/pf/target-pin-credit-card/index.html?section=money_technology", "country": "US", "title": "Target just made its credit card a lot safer", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Target just made its credit card a lot safer", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T19:56:00.000+03:00", "replies_count": 0, "uuid": "5ee2ff0a1785009b3dcf75fa4900c2bc10bc81fd"}, "author": "", "url": "http://money.cnn.com/2015/10/14/pf/target-pin-credit-card/index.html?section=money_technology", "ord_in_thread": 0, "title": "Target just made its credit card a lot safer", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kathryn Vasel"], "text": "Target just made its credit card a lot safer By Kathryn Vasel @KathrynVasel 5 Stunning stats about Target Target is taking a bold step with its store credit cards. \nThe retailer is in the process of reissuing all its REDcard credit and debit cards to chip and PIN cards. This means customers will have to enter a PIN and not just a signature to complete a transaction. \nTarget ( TGT ) suffered a massive date breach at the end of 2013, which exposed the personal information of up to 70 million shoppers. \nA company spokesperson said in an email to CNNMoney that requiring card holders to enter a PIN \"offers an additional layer of security to help protect against someone using the card if it is lost or stolen.\" Customers will be able to set their own PIN. \nRelated: Got a new credit card in the mail? Here's why \nThe retailer is in the process of sending out millions of new cards, and hopes to complete the process by next spring. The company offers three types of cards: credit and debit cards that are only accepted at Target, and a co-branded card through MasterCard ( MA ) that can be used outside the retailer. \nBanks and retail stores have been busy upgrading their credit cards and point-of-sale systems to meet an October 1 deadline that shifted the liability of fraudulent payments. In the past, banks tended to be on the hook for any fake charges, but starting this month, the entity with lesser protection will be responsible for covering the charges. \nChip-enabled cards are safer than what's been in Americans' wallets. The new credit cards contain a micro-chip that creates a unique code for each transaction. Old cards hold payment data in the magnetic stripe, which is easy for thieves to steal, duplicate and put on fake cards. \nRelated: Just how safe is your new credit card? \nBanks have been sending out new chip-enabled cards, but many Americans have still not received one. But even with the new cards, most issuers only require a signature upon check-out . Chip and PIN cards are common in Europe and are considered to be safer since the PIN helps protect a physically stolen card. \nTarget said all of its cash registers have been updated to accept chip-enabled cards and that the new process, which requires customers to insert their card instead of swiping it, has added just a couple of seconds to the check-out process as shoppers learn the new process.", "external_links": [], "published": "2015-10-14T19:56:00.000+03:00", "crawled": "2015-10-14T21:25:20.740+03:00", "highlightTitle": ""}