{"organizations": ["Healthcare Payer Business Intelligence Consulting and Outsourcing Services"], "uuid": "4c8f5440ced66c231e230de21693eec4f7417c70", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tmcnet.com", "main_image": "", "site_section": "http://rss.tmcnet.com/rss/information%20technology", "section_title": "TMCnet.com RSS Service: information technology", "url": "http://www.tmcnet.com/usubmit/2015/10/13/8259919.htm", "country": "US", "title": "Cognizant Named a Leader in Healthcare Payer Business Intelligence Consulting and Outsourcing Services in New IDC MarketScape Reports", "performance_score": 0, "site": "tmcnet.com", "participants_count": 0, "title_full": "Cognizant Named a Leader in Healthcare Payer Business Intelligence Consulting and Outsourcing Services in New IDC MarketScape Reports", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T12:58:00.000+03:00", "replies_count": 0, "uuid": "4c8f5440ced66c231e230de21693eec4f7417c70"}, "author": "", "url": "http://www.tmcnet.com/usubmit/2015/10/13/8259919.htm", "ord_in_thread": 0, "title": "Cognizant Named a Leader in Healthcare Payer Business Intelligence Consulting and Outsourcing Services in New IDC MarketScape Reports", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tweet [October 13, 2015] Cognizant Named a Leader in Healthcare Payer Business Intelligence Consulting and Outsourcing Services in New IDC MarketScape Reports \nTEANECK, N.J. , Oct. 13, 2015 /PRNewswire/ -- Cognizant (NASDAQ: CTSH) today announced that market intelligence and advisory services firm IDC Health Insights has named it a \"Leader\" in two newly released IDC MarketScape reports covering U.S. Healthcare Payer Business Intelligence (BI) Consulting Services and Outsourcing Services. * \nThe IDC MarketScape reports, the first of their kind on the healthcare payer BI services industry, assess seven distinctive service providers in the U.S. healthcare payer BI consulting and outsourcing services markets. Vendors were evaluated on 28 criteria, including growth strategy execution, innovation/R&D pace and productivity, financial/funding management, employee management, and account management/customer service. The reports leverage extensive industry research and customer references. Based on aggregate scores for their current and future capabilities, featured vendors are categorized by each IDC MarketScape as Leaders, Major Players , Contenders or Participants. \nCognizant's strengths as evaluated in both IDC MarketScape reports on the Healthcare Payer BI services industry included: Capacity to partner with clients over the long term; Expertise that is both broad and deep, particularly in terms of technical capabilities; Excellent account management, demonstrating speed in appreciating client needs and staffing its teams appropriately; High staff retention and reputation for recruiting quality employees; and Capability to innovate internally, as well as to import expertise from outside the healthcare vertical into payer BI projects. \nTo read the full reports, visit: http://cogniz.at/IDCHI2 \n\"Tectonic shifts in the U.S. healthcare industry are driving healthcare payers to invest at high rates in BI tools and services to respond effectively to their operational needs and competitive challenges,\" said Sven Lohse , Research Manager at IDC Insights. \"The IT service providers supporting BI at payers are playing a more strategic role. Successful vndors like Cognizant are providing deep expertise and technology capabilities, and are delivering hybrid offerings combining software tools and strategic consulting resources. For healthcare payers and for Cognizant, this is a win-win as these hybrid offerings make it possible to increase the value and ROI on payer consulting spend, while Cognizant is able to leverage insight that helps increase the value that each of its client-facing resources can provide.\" \n\"Healthcare payers are undergoing the most dynamic period of change they have ever experienced,\" said Krish Venkat , President, Healthcare and Life Sciences at Cognizant. \"We're committed to developing the capabilities and making the necessary investments like Trizetto to help our clients successfully navigate this journey. We believe that data and analytics will be a key enabler in delivering business transformations across both payer and provider organizations. We're pleased the IDC MarketScapes recognize Cognizant's ability to provide the advisory, technology consulting and healthcare analytics solutions that position our clients to make data driven decisions and deliver better business outcomes.\" \n* Sources: IDC MarketScape: U.S. Healthcare Payer Business Intelligence Consulting Services 2015 Vendor Assessment, doc #HI257349, September 2015 ; IDC MarketScape: U.S. Healthcare Payer Business Intelligence Outsourcing Services 2015 Vendor Assessment, doc #HI257358, September 2015 . \nAbout IDC MarketScape IDC MarketScape vendor analysis model is designed to provide an overview of the competitive fitness of ICT (information and communications technology) suppliers in a given market. The research methodology utilizes a rigorous scoring methodology based on both qualitative and quantitative criteria that results in a single graphical illustration of each vendor's position within a given market. IDC MarketScape provides a clear framework in which the product and service offerings, capabilities and strategies, and current and future market success factors of IT and telecommunications vendors can be meaningfully compared. The framework also provides technology buyers with a 360 degree assessment of the strengths and weaknesses of current and prospective vendors. \nAbout Cognizant's Healthcare and Life Sciences Practice Cognizant's Healthcare and Life Sciences practice, which includes the TriZetto software portfolio, is committed to helping change millions of lives for the better by partnering with clients to build solutions to healthcare challenges, continually improve the way they do business, set the pace in clinical development, strengthen their regulatory infrastructure, and increase competitiveness. With over $3.5 billion in annualized revenue, Cognizant's healthcare practice is ranked among the top 5 on the Healthcare Informatics Top 100. Cognizant serves 28 of the top 30 global pharmaceutical companies, 20 of the top 25 health plans in the U.S., 3 of the top 5 pharmacy benefit management companies in the U.S., 9 of the top 10 biotech companies, and 12 of the top 15 medical device companies. With a large team of dedicated professionals including doctors, pharmacologists, physicians, biomedical engineers, pharmacists, biostatisticians, medical writers, and GxP consultants, the practice provides domain-aligned consulting, IT, business process, software and as-a-service solutions globally. \nAbout Cognizant Cognizant (NASDAQ: CTSH) is a leading provider of information technology, consulting, and business process outsourcing services, dedicated to helping the world's leading companies build stronger businesses. Headquartered in Teaneck, New Jersey (U.S.), Cognizant combines a passion for client satisfaction, technology innovation, deep industry and business process expertise, and a global, collaborative workforce that embodies the future of work. With over 100 development and delivery centers worldwide and approximately 218,000 employees as of June 30, 2015 , Cognizant is a member of the NASDAQ-100, the S&P 500, the Forbes Global 2000, and the Fortune 500 and is ranked among the top performing and fastest growing companies in the world. Visit us online at www.cognizant.com or follow us on Twitter: Cognizant . To view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/cognizant-named-a-leader-in-healthcare-payer-business-intelligence-consulting-and-outsourcing-services-in-new-idc-marketscape-reports-300158129.html \nSOURCE Cognizant", "external_links": [], "published": "2015-10-13T12:58:00.000+03:00", "crawled": "2015-10-14T01:17:34.704+03:00", "highlightTitle": ""}