{"organizations": ["Apple"], "uuid": "ccd682162b6edc13c5ed8084eabcf8bc6113c71b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news8000.com", "main_image": "http://www.news8000.com/image/view/-/33843774/highRes/2/-/maxh/640/maxw/640/-/bsvpulz/-/Apple-music-logo.jpg", "site_section": "http://www.news8000.com/80198?format=rss_2.0&view=feed", "section_title": "Feed:Technology News", "url": "http://www.news8000.com/money/apples-new-billiondollar-business/35938562", "country": "US", "title": "Apple Music taking off", "performance_score": 0, "site": "news8000.com", "participants_count": 0, "title_full": "Apple Music taking off", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T17:21:00.000+03:00", "replies_count": 0, "uuid": "ccd682162b6edc13c5ed8084eabcf8bc6113c71b"}, "author": "", "url": "http://www.news8000.com/money/apples-new-billiondollar-business/35938562", "ord_in_thread": 0, "title": "Apple Music taking off", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Charles Riley", "Alanna Petroff"], "text": "Apple's iPhone 6S has officially launched By Charles Riley, Alanna Petroff and Hope King \nApple Music now has 15 million subscribers, Cook announced at a Wall Street Journal technology conference in Laguna Beach, California, on Monday evening. Of those 15 million, 6.5 million are paying customers (the other 8.5 million are still on Apple's free three-month trial). Subscribers pay Apple $10 a month for access to unlimited streaming music. \nDo the math: 6.5 million times $10 a month times 12 months in a year = $780 million. \nThat's not quite a billion, but Apple only needs to convert 1.8 million more of the free-trial subscribers to reach that mark. \nAnd Apple Music, which launched in June, would join the iPhone, iPad, Mac, iTunes and Apple TV as the company's billion dollar businesses. Apple Watch will likely reach that mark this year too. \nThat's not bad for a brand new streaming music service that is taking on a giant field of strong incumbents that includes Spotify, Pandora, Amazon, Google and a sea of other contenders. Apple Music's success is particularly impressive, considering the mixed reviews that Apple Music has received, particularly when compared with Spotify. \n\"This is completely at odds with the feedback that the service has received where Spotify offers a better experience with a much richer feature set at the same price,\" noted Richard Windsor, analyst at Edison Investment Research. \nThe appeal isn't hard to understand, though. \nApple Music automatically appears on the home screens of customers who have recently purchased new iPhones or iPads -- or upgraded to the new iOS 9 software. So it's hard to miss. And since Apple already has your credit card information, signing up is as simple as clicking a button). \n\"This is one of the clearest demonstrations yet of how important it can be to control the platform upon which a service is to be sold,\" Windsor said. \nCook's announcement implies that about 60% of Apple Music customers stick with the service after the free trial. Even if some people forgot to cancel the service (and will do so after they receive their first bill), it's a very good start for Apple Music. \nApple is one of the few brands in the world that can enter a market and create a billion-dollar business in a few months. \n ", "external_links": [], "published": "2015-10-20T17:21:00.000+03:00", "crawled": "2015-10-21T12:23:32.435+03:00", "highlightTitle": ""}