{"organizations": [], "uuid": "4f4834a1493e67dee51f4dfb157cdde782e5279d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266385/technology-general", "section_title": "Technology Press Releases from PRWeb - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30159085/dale-carnegie-microsoft-dell-and-stone-brewing-co-to-speak-at-nverge-2015-a-san-diego-technology-conference-hosted-by-fmt-consultants", "country": "US", "title": "Dale Carnegie, Microsoft, Dell and Stone Brewing Co. to Speak at nVerge 2015 a San Diego Technology Conference Hosted by FMT Consultants", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Dale Carnegie, Microsoft, Dell and Stone Brewing Co. to Speak at nVerge 2015 a San Diego Technology Conference Hosted by FMT Consultants - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T12:01:00.000+03:00", "replies_count": 0, "uuid": "4f4834a1493e67dee51f4dfb157cdde782e5279d"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30159085/dale-carnegie-microsoft-dell-and-stone-brewing-co-to-speak-at-nverge-2015-a-san-diego-technology-conference-hosted-by-fmt-consultants", "ord_in_thread": 0, "title": "Dale Carnegie, Microsoft, Dell and Stone Brewing Co. to Speak at nVerge 2015 a San Diego Technology Conference Hosted by FMT Consultants", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "nVerge 2015 takes place on October 27th in San Diego, CA, and offers over 35 educational sessions on Microsoft Dynamics GP, Dynamics CRM, Social Engagement, Dynamics Marketing, SharePoint, Office 365, Power BI, IT systems and management best practices.\nSan Diego, CA (PRWEB) October 01, 2015\nFMT Consultants, the company behind nVerge 2015, announces speakers from Dale Carnegie, Microsoft, Dell, Stone Brewing Co. and FMT Consultants as part of the one-day conference program.\nDuring nVerge the attendees can choose between 35+ different educational sessions on Microsoft Dynamics GP, Management Reporter, Dynamics CRM, Microsoft Social Engagement, Dynamics Marketing, third-party applications for the Dynamics product line, SharePoint, Office 365, IT systems and general business management.\nThe opening keynote will be delivered by Errol Schoenfish, Director of Product Marketing at Microsoft, Eric Casazza, CEO of FMT Consultants and Kevin De Pree, Senior Director of Business Development at FMT Consultants. Brittany Schmid, president of Dale Carnegie San Diego, will deliver a special keynote luncheon.\nPremiere local and national businesses, including Stone Brewing Co., Celldex Therapeutics and SurgiMetrix, will share real-life stories and experiences from their respective technology implementations, their impact and outcomes.\nTechnology experts from FMT Consultants, Dell, ReQlogic, Scribe and other leading software providers will deliver educational breakouts, workshops and roundtable sessions throughout the entire day.\nVisit http://www.nVerge2015.com for more information, detailed agenda and registration.\n“We’re thrilled to have so many dynamic speakers and partner organizations as part of the conference program, and we feel confident that the attendees will find great value in attending nVerge. Some sessions take a high level approach and focus on new features, trends and product roadmaps, while others will be more training oriented. At nVerge the attendees can design their own personal agendas and attend the sessions and activities they find the most relevant to their respective business needs, interests and organizational roles,” says Eric Casazza, CEO of FMT Consultants.\nnVerge was established with the purpose of providing education and technology insights to current and prospective users of Microsoft business solutions and related technologies. The conference runs for its third year in a row following its successful initial launch in May 2013.\n“The past two years we’ve seen tremendous interest for nVerge. Attendance has been outstanding and has grown by more than 65% from 2013 to 2014. nVerge 2014 was at full capacity and we’ve moved this year’s event to a larger venue to accommodate the growing number of attendees and exhibitors. This year, we have more sessions on the agenda than ever before, and we’re looking forward to an educational, fun and content rich conference,” says Jakob Bechgaard, Marketing Manager at FMT Consultants.\nnVerge 2015 takes place on Tuesday, October 27th, 7:30 AM – 5:30 PM at the Town and Country Resort & Convention Center in San Diego, CA.\nFor more information and registration, visit http://www.nVerge2015.com or contact Jakob Bechgaard at jbechgaard(at)fmtconsultants(dot)com or 760.930.6400.\nThe exhibitors and sponsors at nVerge 2015 include Microsoft, Dell, Myappsanywhere, eOne Solutions, ClickDimensions, Nodus Technologies, Solver BI360, RedTail Solutions, TitaniumGP, ReQlogic, Scribe, Vertex SMB, RoseASP, Adxstudio, Purely Cloud, Avalara, Altec, SPS Commerce, Dimension Funding, Infodynamics, Oasis Technology, HighJump, Integrity Data, AP Logic, Varonis and Pythian. Learn more about the exhibitors at http://www.nVerge2015.com.\nnVerge 2015 is hosted by FMT Consultants and is targeted at C-level executives, business owners, managers and technology end-users.\nAbout FMT Consultants\nLeveraging the expertise of a dedicated and growing team of technology professionals along with a wide array of software applications, including Microsoft Dynamics GP, Dynamics CRM, Microsoft SharePoint, Office 365, NetSuite and SAP Business ByDesign, FMT Consultants inspires greatness through technology. The company is headquartered in Carlsbad, CA and has an additional office is Los Angeles. Visit http://www.fmtconsultants.com or call (760) 930.6400 for more information.\n //www.prweb.com/releases/microsoft-dale-carnegie/stone-brewing-co-nverge/prweb12996564.htm\n ", "external_links": ["http://www.fmtconsultants.com/nverge", "http://sandiego.dalecarnegie.com/", "http://www.fmtconsultants.com/nverge/agenda/", "http://www.fmtconsultants.com/nverge/exhibitors/", "http://www.prweb.com/releases/microsoft-dale-carnegie/stone-brewing-co-nverge/prweb12996564.htm"], "published": "2015-10-01T12:01:00.000+03:00", "crawled": "2015-10-01T11:08:29.882+03:00", "highlightTitle": ""}