{"organizations": [], "uuid": "852efdd7c57d6f9e55d7d81190b37c2b7de17e31", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.philly.com", "main_image": "http://media.philly.com/images/101415_villanova_law_1024a.JPG", "site_section": "http://www.philly.com/philly/business/technology/", "section_title": "Technology and tech news - Philly.com", "url": "http://www.philly.com/philly/business/law/20151014_Villanova_law_school_paying_a_price_despite_doing_right.html", "country": "US", "title": "Law Review: Villanova law school paying a price despite doing right", "performance_score": 0, "site": "philly.com", "participants_count": 1, "title_full": "Law Review: Villanova law school paying a price despite doing right", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "852efdd7c57d6f9e55d7d81190b37c2b7de17e31"}, "author": "Chris Mondics,", "url": "http://www.philly.com/philly/business/law/20151014_Villanova_law_school_paying_a_price_despite_doing_right.html", "ord_in_thread": 0, "title": "Law Review: Villanova law school paying a price despite doing right", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Honesty is the best policy, goes the childhood refrain.\nBut it can come with a price. Just ask Villanova University School of Law, which is finding that the truth still hurts years after it acknowledged a handful of administrators secretly manipulated admissions data of incoming first-year students.\nBefore disclosure in early 2011 of the admissions fraud, which was perpetrated to boost the school's ranking in the U.S. News & World Report annual survey, Villanova was comfortably positioned among the nation's top 100 law schools. It was known for producing some of the region's best lawyers, and many of the leaders of Philadelphia's most influential firms had gotten their law degrees there.\nVillanova is still within the top 100, but its U.S. News ranking has plummeted 20 places since the disclosure to No. 87 in the newly released 2016 ranking.\nMore coverage Hillary and Bernie refine student loan debt plans during debate And it has had to spend lavishly to stay in the ratings game since it became known that the law school supplied falsified GPA and LSAT scores to both U.S. News and the American Bar Association for an unknown number of years before 2010.\nNearly 20 percent of Villanova law students now attend tuition-free, under a generous scholarship program that has been a big draw for top students. It has blunted some of the effects of the scandal, but has cost the school millions of dollars.\nVillanova is listed No. 10 in the nation among law schools that discount tuition with scholarship aid and grants, providing an average grant of $26,755 in the 2013-14 academic year, according to National Jurist magazine. In one sense, the law school has been lucky. It has a stable of loyal, deep-pocketed alumni who stepped up after the scandal broke, helping to fund curriculum enhancements and tuition assistance that bolstered the school during a time of extraordinary trouble. Law school dean John Gotanda said all of this has had a positive effect; applications are up and so are the grade-point averages of incoming students.\n\"We have been slowly building back up,\" Gotanda said.\nBut imagine what the university might have done with the added resources had more top students been willing to attend based on Villanova's reputation alone. Instead of discounting tuition for students with the highest earning potential - some big law firms in Philadelphia now start top graduates at $160,000 a year - and the greatest ability to repay loans, the university might have built on program additions already underway, hired even more faculty, or distributed more aid based on need than academic performance.\nThere is something deeply unfair about this, though.\nWhile Villanova's law school has been paying the price, the actual fraud was known only to a handful of administrators who are now gone.\nThe data manipulation took place under former dean Mark Sargent, who left the school in 2009, after it was disclosed he'd been cooperating with police in a Kennett Township investigation of a prostitution ring. Sargent had been a client of the ring. After Sargent departed, a new administrative team began examining the law school admissions data, discovered discrepancies, and self-reported the manipulation.\nThe university hired the Boston-founded law firm of Ropes & Gray to dig deeply into what happened. Once the investigation was complete, Gotanda, who took office after the fraud, was entirely forthright in acknowledging what had taken place.\nVillanova, in short, did everything right. Yet it continues to pay a steep price in terms of reputation damage, even as other colleges that engaged in deceptive practices, notably by providing misleading post-graduation employment statistics, have paid no price at all.\nAt the center of all of this is the U.S. News rankings.\nIt is commonly acknowledged that the motive for the Villanova data manipulation was to gain a few points on competitor law schools, the better to recruit students and faculty. Law school administrators and their universities obsess over rankings because they typically weigh heavily in decisions of prospective students about where to attend.\nHigher-ranked schools tend to receive applicants with higher GPAs and LSAT scores, bolstering the schools' rankings. But some legal educators think the U.S. News annual ranking does not accurately convey what is going on in their schools, or tell much about the quality of education.\n\"The criticism is that the ranking system is amateurish and invalid,\" said Robert Reinstein, the former dean of Temple University Beasley School of Law and a constitutional law professor there.\nGotanda said that one of the reasons the Villanova ranking has suffered is that ratings from administrators at other law schools, which factor in the U.S. News survey, plummeted following the scandal. No doubt many administrators at peer schools were mad at Villanova and bashed the school in the ratings. But is that any reason to punish a school after the perpetrators have left?\nMaybe it's time for law schools and prospective students to ignore the rankings and focus on the quality of the legal education day to day.\ncmondics@phillynews.com\n215-854-5957@cmondics", "external_links": [], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-15T09:54:06.877+03:00", "highlightTitle": ""}