{"organizations": [], "uuid": "2702500a48384dff7501efe8895e247f700d23a1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1137983/stealthbits-offers-varonis-customers-cost-free-license-swap-", "country": "US", "title": "STEALTHbits Offers Varonis Customers Cost-Free License Swap", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "STEALTHbits Offers Varonis Customers Cost-Free License Swap", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T13:00:00.000+03:00", "replies_count": 0, "uuid": "2702500a48384dff7501efe8895e247f700d23a1"}, "author": "admin", "url": "http://www.freshnews.com/news/1137983/stealthbits-offers-varonis-customers-cost-free-license-swap-", "ord_in_thread": 0, "title": "STEALTHbits Offers Varonis Customers Cost-Free License Swap", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Submitted by admin on 10/8/2015 @ 3:00 AM Companies mentioned in this article: STEALTHbits Technologies \nHAWTHORNE, NJ -- (Marketwired) -- 10/08/15 -- STEALTHbits Technologies Inc., a leading data security software company that ensures the right people have the right access to the right information, today announced it's offering Varonis customers a one-for-one license swap at no cost through the end of 2015. \n\"The difference between our solution and Varonis really boils down to design philosophy,\" offered Alex Berger, STEALTHbits Senior Product Marketing Manager. \"Our approach emphasizes lightweight data collectors, no requirement to deploy agents, minimal need for additional hardware as we scale to serve the largest enterprises, and an open architecture that enables clean integration with other enterprise security software like DLP, IAM, and PIM.\" \nThe STEALTHbits solution serves users interested in customizing their deployment, as well as those with limited resources interested in built-in, value-added reports. \n\"Our solution is delivered with a number of out-of-the-box reports and built-in analyses for customers less inclined to customize their solution,\" added Carol Volk, STEALTHbits' Senior Vice President of Marketing and Product Management. \"But for those customers with unique requirements and environments, our open schema gives them everything they need to build reports that maximize our product's value to each individual organization.\" \nSTEALTHbits is offering a one-for-one license swap. \"If you have 10,000 DatAdvantage or DataPrivilege licenses, we'll give you 10,000 StealthAUDIT licenses, no questions asked,\" added John Albanese, STEALTHbits Sales Operations Vice President. \"And, going forward, we're matching the cost of annual maintenance previously paid to Varonis. Bottom line: we're giving Varonis customers a much better product at zero incremental cost.\" \nTo learn more about the swap-out offer, or how STEALTHbits compares to Varonis, visit http://www.stealthbits.com/varonis-license-exchange-program . \nABOUT STEALTHbits Technologies \nIdentify threats. Secure data. Reduce risk. \nSTEALTHbits is a data security software company. We help organizations ensure the right people have the right access to the right information. By giving our customers insight into who has access and ownership of their unstructured data, and protecting against malicious access, we reduce security risk, fulfill compliance requirements and decrease operations expense. \nFor more information, visit http://www.stealthbits.com , email sales@stealthbits.com , or call +1-201-447-9300. \nThe STEALTHbits logo and all other STEALTHbits product or service names and slogans are registered trademarks or trademarks of STEALTHbits Technologies, Inc. All other trademarks and registered trademarks are property of their respective owners. \nRSA and EMC are either registered trademarks or trademarks of EMC Corporation in the United States and/or other countries. All other products and/or services are trademarks of their respective companies . Contact:", "external_links": [], "published": "2015-10-08T13:00:00.000+03:00", "crawled": "2015-10-08T14:45:30.166+03:00", "highlightTitle": ""}