{"organizations": [], "uuid": "b5e77fd5dce7f3ecee4932b89e0b2c157723ec95", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fcw.com", "main_image": "", "site_section": "http://fcw.com/rss-feeds/all.aspx", "section_title": "FCW: The business of federal technology", "url": "https://fcw.com/articles/2015/10/08/2020-census.aspx", "country": "US", "title": "Can tech streamline the 2020 Census and save $5B?", "performance_score": 0, "site": "fcw.com", "participants_count": 0, "title_full": "Can tech streamline the 2020 Census and save $5B?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T00:00:00.000+03:00", "replies_count": 0, "uuid": "b5e77fd5dce7f3ecee4932b89e0b2c157723ec95"}, "author": "", "url": "https://fcw.com/articles/2015/10/08/2020-census.aspx", "ord_in_thread": 0, "title": "Can tech streamline the 2020 Census and save $5B?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Bianca Spinosa"], "text": "Can tech streamline the 2020 Census and save $5B? By Bianca Spinosa Oct 08, 2015 \nThe Census Bureau is under pressure to save money and improve its use of technology in the 2020 population count. By leaning on technology, especially mobile, in a major way, the agency hopes to avoid the missteps that have doomed previous efforts to automate and mobilize data collection. \nThe plan , released Oct. 7, relies on outside data sources, mobile devices for enumerators, and an Internet response option for survey respondents. \nDirector John H. Thompson estimates that the Bureau can save $5 billion from the projected costs of $22 billion – the price of counting up and gathering demographic information on the 300 million-plus population. \nAmong the new wrinkles for 2020, the Bureau plans to add new addresses to the system using GPS and aerial imagery instead of sending Census employees to walk and physically check 11 million census blocks. \nThis is just one piece of a plan to incorporate existing government records and third-party data into the enumeration. The Bureau is hoping that data from state and local governments as well as commercial information will make the address list more accurate, support contact with the population, help validate addresses and reduce field activity. The IRS and the Centers for Medicare and Medicaid Services will be sharing data with the Census, primarily to help identify vacant housing and non-responsive addresses. The Census is also seeking data from National Directory of New Hires, the Supplemental Nutrition and Assistance Program as well as some state programs. \nOverall, the Census projects savings of as much as $1.4 billion from using qualified external data, according to their final operational plan. \nThe Bureau is projecting that 55 percent of respondents will key in their data over the Internet. To make this option attractive to users, the Census plans a mobile-optimized response website that is available in multiple languages, including many with non-Roman alphabets. \nThe biggest lift is a plan to let enumerators, who canvas door-to-door tallying up those who didn't respond online or using paper forms, use mobile devices. Some key decisions remain on this front. In 2017, the Bureau will decide whether to furnish enumerators with devices, work on a bring-your-own-device model, or go with some hybrid plan. \nIn any case, collection will be highly virtualized. Field staff will work over virtualized infrastructure, and a hybrid cloud design is planned to support the 2020 Census \"wherever possible,\" according to the plan. \nEnterprise IT remains a risk area. The plan notes that an enterprise-wide solution might not be ready, or meet the requirements for the Census. If an enterprise IT solution doesn't work, \"existing systems may require substantial modifications or entirely new systems may have to be developed,\" adding risk and complexity to an already complex undertaking. To mitigate risks, the Bureau is exploring to what extent 2010 systems can be repurposed for the 2020 enumeration if needed. Officials are also looking to avoid one-off or custom solutions, and to use commercial systems wherever possible. \n\"The automations and innovations that we'll use are truly groundbreaking for collecting statistics, and everyone here at the Census Bureau is excited to roll out these plans for the American public,\" Thompson wrote in a blog post . \nSen. Tom Carper (D-Del.), ranking member of the Senate committee that oversees the Bureau, is hoping that Congress will come through with the funding needed to implement the plan. \n\"Given that the 2010 Census was the costliest count in history and faced serious technology failures, it's critical that we learn from the last decade's mistakes and make sure that the 2020 Census is on time, on budget, and accurate,\" Carper said. \nAdam Mazmanian contributed to this report About the Author \nBianca Spinosa is an FCW editorial fellow. Connect with her on Twitter: @BSpinosa <>", "external_links": [], "published": "2015-10-09T00:00:00.000+03:00", "crawled": "2015-10-09T04:18:50.914+03:00", "highlightTitle": ""}