{"organizations": ["Libre Wireless Technologies Chosen as Technology Partner of PERI", "Launch Ground-Breaking Wireless Lifestyle Audio Products Libre Wireless Technologies Chosen as Technology Partner of PERI"], "uuid": "e0179914ad4ecfe560a86783640edd647f769901", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.businesswire.com", "main_image": "", "site_section": "http://feed.businesswire.com/rss/home/?rss=G1QFDERJXkJeGVtQXg==", "section_title": "Business Wire Technology: Mobile/Wireless News", "url": "http://www.businesswire.com/news/home/20151013005644/en/Libre-Wireless-Technologies-Chosen-Technology-Partner-PERI", "country": "US", "title": "Libre Wireless Technologies Chosen as Technology Partner of PERI to Launch Ground-Breaking Wireless Lifestyle Audio Products", "performance_score": 0, "site": "businesswire.com", "participants_count": 0, "title_full": "Libre Wireless Technologies Chosen as Technology Partner of PERI to Launch Ground-Breaking Wireless Lifestyle Audio Products", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T15:05:00.000+03:00", "replies_count": 0, "uuid": "e0179914ad4ecfe560a86783640edd647f769901"}, "author": "", "url": "http://www.businesswire.com/news/home/20151013005644/en/Libre-Wireless-Technologies-Chosen-Technology-Partner-PERI", "ord_in_thread": 0, "title": "Libre Wireless Technologies Chosen as Technology Partner of PERI to Launch Ground-Breaking Wireless Lifestyle Audio Products", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Libre Wireless Technologies Chosen as Technology Partner of PERI to Launch Ground-Breaking Wireless Lifestyle Audio Products October 13, 2015 08:05 AM Eastern Daylight Time \nIRVINE, Calif.--( BUSINESS WIRE )-- Libre Wireless Technologies, Inc. a leading embedded Wi-Fi and Wireless solutions provider, today announced a technology partnership with PERI ( www.myPERI.com ), a leading Wi-Fi audio technology and products company. PERI will integrate the LibreSync Wi-Fi media-streaming platform into its highly anticipated Duo product, a first-of-its-kind iPhone case with battery charging functionality and on-board high definition Wi-Fi and Bluetooth portable speakers, expected to ship in November of this year. \nAs connectivity, music streaming, and sharing become the new value proposition in consumer audio products, innovative companies like PERI take that value proposition to an entirely new level, enabling consumers to enjoy these features anywhere, any time. The PERI Duo will allow users to stream the same music to up to 64 speaker cases with or without a local area network, enabling an entirely new way for consumers to enjoy and share their music. This unique product takes advantage of Libre’s industry leading low power and small form factor Wi-Fi media and Bluetooth modules. \n“Wi-Fi functionality is at the core of our company’s value proposition and is a driver in how we differentiate ourselves in the crowded audio and mobile accessories market,” said Mohammad Tabatabai, CEO, PERI. “We are excited to partner with Libre to develop technology and products that will further drive innovation in the consumer audio market.” \n“The PERI team has combined great vision and technology to enable this breakthrough product,” says Jordan Watters, Chief Operating Officer at Libre Wireless Technologies . “By working closely together and leveraging the advanced LibreSync media streaming technology platform, PERI is changing the game for what’s possible and what will be expected in new mobile products. PERI is providing consumers with a feature rich and advanced mobile media player and wireless streaming system all in a compact mobile device case form factor. They have essentially created their own product category as there is nothing like the Duo on the market. We are very happy to have been selected as a key technology partner to help enable their innovative vision.\" \nAbout Libre Wireless Technologies, Inc. Libre Wireless Technologies has extensive expertise and experience in developing Wi-Fi, wireless and media streaming software and SDK platforms, electronic modules and RF/antenna design solutions. The Libre team has deep Wi-Fi technology and A/V system design experience combined with world wide sales, technical support and design partnerships. The LibreSync platform incorporates unique media streaming technology, broad mobile platform ecosystem support, seamless interoperability, scalable price/performance solution options, optimized and flexible Wi-Fi/Bluetooth options (1x1 11n, 2x2 11n, 11n/ac) and extensive system level features. Optimized for performance, power, size and cost, LibreSync solutions provide ODM’s and CE Brand customers with the most complete, flexible and ecosystem leading media streaming platform available. \nAbout PERI Founded in 2014, PERI ( www.myPERI.com ) is a leading Wi-Fi audio technology company developing cutting edge products and technologies in the mobile accessories, portable consumer electronics and automotive components markets. The company specializes in IC & Systems design,integrated into innovative audio and power consumer products. PERI is Portable Electronics Re-Invented! Stay in tune with PERI through Facebook , Twitter and Instagram . Contacts \nJordan Watters - Chief Operating Officer, Founder+1-512-757-9490", "external_links": [], "published": "2015-10-13T15:05:00.000+03:00", "crawled": "2015-10-13T15:10:50.680+03:00", "highlightTitle": ""}