{"organizations": ["Stanford"], "uuid": "7aa8fcfe2e76c586202b31db9b3875b7284f1c9d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tmcnet.com", "main_image": "", "site_section": "http://rss.tmcnet.com/rss/information%20technology", "section_title": "TMCnet.com RSS Service: information technology", "url": "http://www.tmcnet.com/usubmit/2015/10/12/8259560.htm", "country": "US", "title": "Stanford's Dr. Hau Lee to Discuss Significant Supply Chain Innovations during Oct. 28 Webinar", "performance_score": 0, "site": "tmcnet.com", "participants_count": 0, "title_full": "Stanford's Dr. Hau Lee to Discuss Significant Supply Chain Innovations during Oct. 28 Webinar", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T17:31:00.000+03:00", "replies_count": 0, "uuid": "7aa8fcfe2e76c586202b31db9b3875b7284f1c9d"}, "author": "", "url": "http://www.tmcnet.com/usubmit/2015/10/12/8259560.htm", "ord_in_thread": 0, "title": "Stanford's Dr. Hau Lee to Discuss Significant Supply Chain Innovations during Oct. 28 Webinar", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hau Lee"], "text": "[October 12, 2015] Stanford's Dr. Hau Lee to Discuss Significant Supply Chain Innovations during Oct. 28 Webinar \nAmber Road (NYSE: AMBR), a leading provider of global trade management (GTM) solutions, invites you to attend an exclusive and complimentary webinar broadcasting live on Wednesday, October 28, 2015 at 2:00pm featuring world renowned supply expert Dr. Hau Lee, Thoma professor of operations, information and technology at Stanford Business School. \nDuring the webinar, Dr. Lee will address strategies to significantly improve supply chain operations using the three S's of supply chain innovation: substitution, scale and structure. Dr. Lee has published countless articles and advised dozens of business leaders on improving supply chains. \nDr. Lee will also present specific examples from General Electric, Abercrombie & Fitch and Caleres on how these companies realized significant supply chain savings, streamlined supplier management, increased visibility, centralized operations, improved supply chain flexibility and reduced man hours. \n\"Dr. Lee is a leader in the field of supply chain operations. We are delighted to have this opportunity to share his knowledge and expertise with other supply chain and global trade professionals,\" said Amber Road's CEO Jim Preuninger. \nTo sign up for the webinar please click here . \nAbout Dr. Hau Lee \nDr. Lee specializes in supply chain management, information technology, global logistics, system design, inventory planning and manufacturing strategy. He is the Thoma professor of operations, information & technology at Stanford's Graduate School of Business, the founding director of the Stanford Global Supply Chain Management Forum and the faculty director of the Stanford Institute for Innovation in Developing Economies. In addition to his academic experience, Dr. Lee co-founded DemandTec, an optimization application that went public in 2007 and is chairman of SCM World. Dr. Lee holds a PhD in Operations Research from the Wharton School at the University of Pennsylvania and a Master of Science degree from the London School of Economics and Political Science. More information about Dr. Lee is available at https://www.gsb.stanford.edu/faculty-research/faculty/hau-l-lee . \nAbout Amber Road \nAmber Road's (NYSE: AMBR) mission is to improve the way companies manage their international supply chains and conduct global trade. As a leading provider of cloud based global trade management (GTM) solutions, we automate the global supply chain across sourcing, logistics, cross-border trade, and regulatory compliance activities to dramatically improve operating efficiencies and financial performance. This includes collaborating with suppliers on development, sourcing and quality assurance; executing import and export compliance checks and generating international shipping documentation; booking international carriers and tracking goods as they move around the world; and minimizing the associated duties through preferential trade agreements and foreign trade zones. Our solution combines enterprise-class software, trade content sourced from government agencies and transportation providers in 145 countries, and a global supply chain network connecting our customers with their trading partners, including suppliers, testing/auditing firms, freight forwarders, customs brokers and transportation carriers. We deliver our GTM solution using a Software-as-a-Service (SaaS ( News - Alert )) model and leverage a highly flexible technology framework to quickly and efficiently meet our customers' unique requirements around the world. \nFor more information, please visit www.AmberRoad.com , email Solutions@AmberRoad.com or call 201-935-8588. View source version on businesswire.com: http://www.businesswire.com/news/home/20151012005640/en/", "external_links": [], "published": "2015-10-12T17:31:00.000+03:00", "crawled": "2015-10-13T08:54:26.423+03:00", "highlightTitle": ""}