{"organizations": [], "uuid": "a0c999f8574aa4141399f1d7b6af00861cae9a41", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.gizmag.com", "main_image": "http://img.gizmag.com/audi-rs6-rs7-performance-22.jpg?fit=max&h=594&rect=190%2C181%2C1167%2C657&w=1060&s=6a45e2fadf0b5ab5a4ca31f71d89209f", "site_section": "http://gizmag.com/xml/", "section_title": "Gizmag Emerging Technology Magazine", "url": "http://www.gizmag.com/audi-rs-6-avant-rs-7-performance/40012/", "country": "US", "title": "Audi RS7 and RS6 get more power, new Performance badge", "performance_score": 0, "site": "gizmag.com", "participants_count": 1, "title_full": "Audi RS7 and RS6 get more power, new Performance badge", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T12:21:00.000+03:00", "replies_count": 0, "uuid": "a0c999f8574aa4141399f1d7b6af00861cae9a41"}, "author": "Scott Collie", "url": "http://www.gizmag.com/audi-rs-6-avant-rs-7-performance/40012/", "ord_in_thread": 0, "title": "Audi RS7 and RS6 get more power, new Performance badge", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Image Gallery (17 images) \nthe world of high-end super-sedans, there's always room for more power. The quest to outdo the rest of the crowd is why BMW felt the need to boost its M5 with the 30 Jahre Edition, or why Mercedes ' AMG cars are all available in more powerful \"S\" designations. It's also why Audi has felt the need to make its RS6 and RS7 faster, by introducing a more powerful \"Performance\" line. \nIn the transition from regular RS car to full-fledged members of the Performance line, the RS6 and RS7's twin-turbo V8 has gained an extra 33 kW (55 hp) and 50 Nm of extra torque on overboost, enough to send it from 0-100 km/h (62 mph) in just 3.7 seconds. Not only is that 0.2 seconds faster than the regular RS models they're based on, it's faster than the new turbocharged Porsche 911 Carrera can manage, and the latter won't seat five people or hold their luggage. \nThe acceleration doesn't relent at 100 km/h either, with the RS Performance cars able to top 200 km/h (124 mph) in just 12.1 seconds, an improvement of 1.4 seconds over the regular car. Keep your foot down and a derestricted RS6 will hit 280 km/h (174 mph), while the sleeker RS7 will reach 305 km/h (189 mph). \nAlthough they're more powerful than regular RS cars, the RS6 and 7 sip the same amount of fuel, with the wagon drinking 9.6 l/100 km (24.5 mpg) and the RS7 Sportback using 9.5 l/100 km (24.6 mpg) on the combined cycle test. This is thanks, in part at least, to a cylinder deactivation system that lets the RS' V8 run as a frugal four cylinder under light loads. \nAudi's quick cars set themselves apart from the other Germans with their quattro all-wheel drive system, and the RS6 and RS7 performance are no different. The system defaults to a 60/40 rear/front power split, but if owners tick the box for the rear differential it can also shuffle power between the rear wheels to make sure the wheel with the most grip gets the most power. Helping to keep all that power under control is a suspension setup that's 20 mm (0.8 in) lower than on regular RS cars, while owners can spec a \"sport plus\" system with three-mode adjustable dampers if they're keen for a sportier ride. \nAs well as running with a traditional Audi all-wheel drive system, the RS6 and RS7 Performance cars have been subjected to a set of typically subtle styling tweaks, including 21 inch wheels and upgrades to Alcantara kneepads and contrast stitching. \nSo, how much will these fast family haulers set you back? The RS6 Avant is priced at €117,000 (about US$130,000), while RS7 buyers will have to fork out €121,700 ($135,500).", "external_links": [], "published": "2015-10-23T12:21:00.000+03:00", "crawled": "2015-10-23T12:45:23.574+03:00", "highlightTitle": ""}