{"organizations": [], "uuid": "131d0ed804d5d9142f0e6864055e43422541ab96", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266385/technology-general", "section_title": "Technology Press Releases from PRWeb - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30348495/bitnami-coo-and-co-founder-erica-brescia-to-speak-at-openstack-summit-in-tokyo", "country": "US", "title": "Bitnami COO and Co-Founder Erica Brescia to Speak at OpenStack Summit in Tokyo", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Bitnami COO and Co-Founder Erica Brescia to Speak at OpenStack Summit in Tokyo - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T16:11:00.000+02:00", "replies_count": 0, "uuid": "131d0ed804d5d9142f0e6864055e43422541ab96"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30348495/bitnami-coo-and-co-founder-erica-brescia-to-speak-at-openstack-summit-in-tokyo", "ord_in_thread": 0, "title": "Bitnami COO and Co-Founder Erica Brescia to Speak at OpenStack Summit in Tokyo", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bitnami to lead the conversation on \"Banishing the Shadow Cloud\" at this year's OpenStack Summit.\nSan Francisco, CA (PRWEB) October 26, 2015\nBitnami, a leading provider of ready-to-run server applications and development environments, to lead the conversation on “ Banishing the Shadow Cloud ” at this year’s OpenStack Summit in Tokyo, Japan, October 27-30, 2015.\nBitnami COO and Co-Founder, Erica Brescia will share insights into the most important cloud features, rates of public cloud, application adoption and success behind banishing the shadow cloud during her session on October 27, 2015, at 10:00 a.m.\n\"Interest in both public clouds and private clouds like OpenStack is growing at a rapid pace. But many private cloud deployments are undermined by a user experience that doesn't match that provided by public clouds,\" said Erica Brescia, COO of Bitnami. \"By improving the experience, particularly the ease of cloud application deployment, OpenStack operators can reduce the leakage and banish the shadow cloud.\"\nAbout Bitnami\nBitnami is a library of popular server applications and development environments that can be installed in a click, either on your laptop, in a virtual machine or hosted in the cloud. With over a million deployments each month, Bitnami.com has become the world’s most popular destination for many of today’s most popular applications. Bitnami­-packaged apps provide a consistent, secure and up-­to-­date, optimized end ­user experience on any platform.\nWe take care of compiling and configuring the application and all of its dependencies (third­party libraries, language runtimes, databases) so it works out­of­the­box. The company is also the largest source of applications for the leading cloud marketplaces. Bitnami is headquartered in San Francisco, CA and has a major development center in Seville, Spain. For more information, visit http://www.Bitnami.com , or follow us on Twitter (@Bitnami) and Facebook.\nThe OpenStack® Word Mark and the OpenStack® logos are trademarks of the OpenStack Foundation.\n //www.prweb.com/releases/BitnamiOpenStackSummit/26/prweb13042680.htm\n ", "external_links": ["http://www.prweb.com/releases/BitnamiOpenStackSummit/26/prweb13042680.htm", "https://www.openstack.org/summit/tokyo-2015/schedule/main-conference", "https://twitter.com/ericabrescia"], "published": "2015-10-26T16:11:00.000+02:00", "crawled": "2015-10-26T15:33:52.942+02:00", "highlightTitle": ""}