{"organizations": [], "uuid": "6a07f6dc2daa5f9f5d89bf0aaf53bbf3161cee83", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266385/technology-general", "section_title": "Technology Press Releases from PRWeb - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30308121/horne-llp-gets-future-ready-becomes-nations-first-accounting-firm-to-train-its-staff-with-the-anticipatory-organization-accounting-and-finance-edition", "country": "US", "title": "HORNE LLP Gets Future-Ready, Becomes Nations First Accounting Firm to Train Its Staff With The Anticipatory Organization: Accounting and Finance Edition", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "HORNE LLP Gets Future-Ready, Becomes Nations First Accounting Firm to Train Its Staff With The Anticipatory Organization: Accounting and Finance Edition - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T22:11:00.000+03:00", "replies_count": 0, "uuid": "6a07f6dc2daa5f9f5d89bf0aaf53bbf3161cee83"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30308121/horne-llp-gets-future-ready-becomes-nations-first-accounting-firm-to-train-its-staff-with-the-anticipatory-organization-accounting-and-finance-edition", "ord_in_thread": 0, "title": "HORNE LLP Gets Future-Ready, Becomes Nations First Accounting Firm to Train Its Staff With The Anticipatory Organization: Accounting and Finance Edition", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "HORNE LLP tackles the challenge of anticipating disruptions, problems and game-changing opportunities\nRIDGELAND, Miss.\nIn a world defined by accelerating change and complexity, the ability to anticipate disruptions, problems, customer needs and new opportunities will be the most important skill any business person can possess.\nIt’s a skill the team members at HORNE have taken to heart.\nThe firm has become the first in the country to train its team members with a revolutionary new online learning system that teaches accounting and finance professionals how to anticipate future trends and take advantage of the game-changing opportunities those trends offer.\nKnown as “The Anticipatory Organization: Accounting and Finance Edition,” the learning system shows CPAs and finance executives how to become more future-ready at a time when that skill is in greater demand than ever. In a recent national survey, 76 percent of small business owners say their CPAs are not proactive, and 75 percent have changed firms because their CPAs are providing reactive services rather than proactive advice. Another recent survey found that only 6 percent of CFOs, controllers and management accountants say they are future-ready.\nIn fact, futurist and New York Times best-selling author Daniel Burrus, who developed The Anticipatory Organization Model and Learning System, says the ability to accurately predict future trends and new opportunities is the greatest missing competency in the business world today.\n“Instead of trying to meet your customers’ traditional expectations, you could predict their biggest future problems and help solve them,” said Burrus. “To create the best products and provide the best services, a company must correctly gauge what trends, environments, and situations will address their customers’ current and future unmet needs. With The Anticipatory Organization Model, the team members at HORNE are preparing to be relevant and to make a difference by boldly helping customers understand what is possible or needed before they need it – and provide them with a solution at just the right time.”\n“Reacting to change is no longer enough. Clients are starving for anticipatory guidance. In order to stay relevant to our clients, our firm must learn to anticipate change and help prepare for the opportunities before they arrive,” said Joey Havens, CPA, CGMA, executive partner of HORNE LLP. “We are thrilled to be able to offer our team the opportunity to learn anticipatory skills that make them future-ready and ensures that our firm will become more relevant as a trusted business advisor to our clients. The status quo of reporting as historians or simply reacting to change will only lead to the commoditization of our services, skills and knowledge.”\nHere’s how it works\nThe Anticipatory Organization Model teaches accounting and finance professionals to actively anticipate disruptions, problems, customer needs and their related opportunities, and take action to shape the future by becoming an “Anticipatory CPA.” By learning how to identify and take action on fully predictable “Hard Trends” (trends that will happen) and more easily manipulated “Soft Trends” (trends that might happen), we can elevate our relevancy in a world of transformational change.\nThe 28 lessons included in the learning series covers the following competencies:\n Strategic thinking\n External awareness\n Vision\n Continuous learning\n Innovation\n Creativity\n Problem-solving\n Prioritization\n Business acumen\n Decisiveness\n Influencing / persuading\n Emotional intelligence\n Consensus building\n Collaboration\n Inspiration\n Risk management\nBurrus has been helping stakeholders see and shape the future for more than 30 years. “The Anticipatory Organization: Accounting and Finance Edition” synthesizes his approach into an “accelerated learning system” that includes a series of short, single-concept videos featuring Burrus presenting the model’s core principles. Each video is followed by a job aid and rapid-application activities that teach the learner to apply the concept to everyday activities.\nThis exciting new approach to learning has been customized by Burrus with input from a customer co-creation group gathered by the Maryland Association of CPAs and the Business Learning Institute. The group – representing CPAs in small to large firms, CFOs, controllers, young professionals and other segments across the profession – has worked with the Burrus team to gather accounting- and finance-specific examples that have been built into the learning platform. This transformative learning approach will help CPAs be proactive and anticipatory in less time than traditional professional development programs.\nThe result is a powerful tool that will help everyone on your team know what’s next, develop opportunities, shape the future of the organization and accelerate its success.\nGet complete details about “The Anticipatory Organization: Accounting and Finance Edition” by visiting BLIonline.org/The-Anticipatory-Organization.\nHORNE is a decidedly different CPA and business advisory firm that is changing expectations about accounting. HORNE goes beyond traditional accounting to steer clients through uncertainties and opportunities. We focus our knowledge and experience in banking, construction, franchise, government, healthcare and public and middle market. HORNE Wealth Advisors is a fiduciary partner to high-net worth individuals. Visit us at hornellp.com .\n //www.prweb.com/releases/2015/10/prweb13032936.htm\n ", "external_links": ["http://hornellp.com/", "http://www.prweb.com/releases/2015/10/prweb13032936.htm", "http://blionline.org/The-Anticipatory-Organization/"], "published": "2015-10-20T22:11:00.000+03:00", "crawled": "2015-10-20T23:17:56.830+03:00", "highlightTitle": ""}