{"organizations": [], "uuid": "e2a799217c364292fca31895bc849c3126ff856c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.whatech.com", "main_image": "", "site_section": "http://www.whatech.com/?format=feed&type=rss", "section_title": "WhaTech -  Technology News | Supplier Sourcing |  Community - WhaTech", "url": "https://www.whatech.com/mobile/reviews/98663-01-lg-v10-5-7-inch-quad-hd-hexa-core-metal-smartphone-with-dual-selfie-camera", "country": "AU", "title": "LG V10: 5.7-inch Quad HD hexa-core metal smartphone with dual camera and duel screen", "performance_score": 0, "site": "whatech.com", "participants_count": 1, "title_full": "LG V10: 5.7-inch Quad HD hexa-core metal smartphone with dual camera and duel screen", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T08:52:00.000+03:00", "replies_count": 0, "uuid": "e2a799217c364292fca31895bc849c3126ff856c"}, "author": "webmaster@whatech.com.au (Eza Ezamie)", "url": "https://www.whatech.com/mobile/reviews/98663-01-lg-v10-5-7-inch-quad-hd-hexa-core-metal-smartphone-with-dual-selfie-camera", "ord_in_thread": 0, "title": "LG V10: 5.7-inch Quad HD hexa-core metal smartphone with dual camera and duel screen", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News from: Eza Ezamie Page views: 84 times What a long list of expensive features and this can easily be LG’s best bet yet for this year. Come let us meet the V10 which is expected to released very soon in South Korea followed by the rest of the major markets. - Advertisement - \nThe V10 marks the first smartphone by LG to have a full metal jacket. With the likes of Samsung Galaxy Note 5 and Sony Xperia Z5 all making their presence known in metal, it is good to see that LG finally jumped onto the bandwagon. \nIn fact, the V10 does more than just that. First of all, it has a tiny wee bit of screen right on top of its huge 5.7-inch screen. Then there're two secondary cameras that we will talk about in further detail, and finally a tough silicon cover that survived the military standard for a drop test. Read on… \nNow let’s talk about its look and feel first. Coming in with a body measurement of 159.6 x 79.3 x 8.6 mm (6.28 x 3.12 x 0.34 in) and weighing in at 192 g (6.77 oz), it sure is slim alright but not light by all means. With a metal body and steel at its side, the phablet is further backed by 2 panels of Gorilla Glass 4 which ensures top-notch performance. Still unconvinced? LG has decided to put it in a tough silicon cover that passes the MIL-STD-810G standard that makes it shock resistant and could easily survive a fall with no effect at all. All big and tough eh? \nScreen-wise, the V10 will be sporting a 5.7-inch Quad HD IPS LCD capacitive touchscreen with 1440 x 2560 pixels or ~515 ppi pixel density) which makes for some amazing images. And as mentioned earlier, it will also have a secondary display that is 2.1-inch and has 160 x 1040 pixels. According to them, both of them are working independently and the Second Screen can be set up as an “always on” display to enhance the V10’s productiveness without having an impact on battery life. You can also set the Second Screen to display the weather, time, date and battery icon when the main display is off. And when the main display is on, the Second Screen can be set to convert to a dedicated launching area for shortcuts or your favorite apps. What’s more, when you’re enjoying a movie or game on the V10, the Second Screen will notify you discreetly without blocking your view when a call or text comes in. Ignoring the notification won’t distract you from your enjoyment, or you can pause whatever you are currently doing to respond to it. Very cool eh? \nIn terms of performance, the V10 will be powered by the Qualcomm MSM8992 Snapdragon 808 chipset, a Hexa-core processor made up of Quad-core 1.44 GHz Cortex-A53 & Dual-core 1.82 GHz Cortex-A57, Adreno 418 graphics and 4GB RAM. That’s very high-end stuff by the way. Respect goes to LG all the way for making this phablet a beast indeed. - Advertisement - \nThe other innovation involved in making the V10 unique is in the camera department. There’s the 16 Megapixel primary camera with 5312 x 2988 pixels, laser autofocus, optical image stabilization, LED flash, 1/2.6'' sensor size, simultaneous video and image recording, geo-tagging, face detection and HDR which is pretty much what we would expect a flagship phone would offer. It is where the secondary camera – or two secondary cameras actually which this phablet has. Featuring two separate lenses that is able to capture the standard 80 degree selfies or for an even better wide angle selfie of 120 degrees, without the need to pan the smartphone which increases the likelihood of camera shake. For the wide angle shot, it employs a sophisticated software algorithm to combine images from the two separate lenses that are just far enough apart to provide two different points of view. The ability to take group selfies without a selfie-stick has never been easier. \nAs far as storage is concerned, there should be enough with its 64GB internal storage. But what’s the point of having the ability to take lots of high-resolution pictures and not utilizing it right? Should you need more space, just pop in a microSD card up to a maximum of 128GB. \nThere might be some concern though in the battery department, as the V10 will only be equipped with a Li-Ion 3000 mAh battery. Technically it should have no trouble powering up the device for at least a day. However, it does feature fast battery charging that can boost up to 50% in just 40 minutes with the Quick Charge 2.0 feature. \nIn terms of software, no worries here as it will be running on Android Lollipop 5.1.1. Being a flagship, it should be getting an update to the latest Marshmallow 6.0 in due time. - Advertisement - \nSeems like we can’t wait for the release of LG V10 as there’s so many things to look forward to. Thankfully the wait won’t be very long though. Plenty of innovations and a first of many for LG as well. Huge screen with secondary display concept is great, dual front camera for the best selfie shot is excellent; and everything else about this phablet points ton amazing device. The best-in-class in lots of things. \nThe LG V10 is said to be available by the end of October 2015 although there’s no information on the pricing just yet. It will be available in Space Black, Luxe White, Modern Beige, Ocean Blue and Opal Blue. News From", "external_links": [], "published": "2015-10-05T08:52:00.000+03:00", "crawled": "2015-10-08T03:34:07.981+03:00", "highlightTitle": ""}