{"organizations": [], "uuid": "92056f4ec6cadf2b4c4cf9dc936d338c679c930b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mdtmag.com", "main_image": "", "site_section": "http://www.mdtmag.com", "section_title": "Medical Design Technology | The Medical Design Engineer’s Resource for Products &amp; Technologies", "url": "http://www.mdtmag.com/news/2015/10/new-microscopic-imaging-technology-reveals-origins-leukemia", "country": "US", "title": "New Microscopic Imaging Technology Reveals Origins of Leukemia", "performance_score": 0, "site": "mdtmag.com", "participants_count": 1, "title_full": "New Microscopic Imaging Technology Reveals Origins of Leukemia", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "92056f4ec6cadf2b4c4cf9dc936d338c679c930b"}, "author": "University of Cambridge", "url": "http://www.mdtmag.com/news/2015/10/new-microscopic-imaging-technology-reveals-origins-leukemia", "ord_in_thread": 0, "title": "New Microscopic Imaging Technology Reveals Origins of Leukemia", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Scientists at the Cambridge Institute for Medical Research at the University of Cambridge and the Medical Research Council Laboratory of Molecular Biology have taken advantage of revolutionary developments in microscopic imaging to reveal the origins of leukemia.\nThe researchers studied tiny protein-producing factories, called ribosomes, isolated from cells. They capitalized on improvements made at the LMB to a high-powered imaging technique known as single particle cryo-electron microscopy.\nThe microscopes, capable of achieving detail near to the atomic level, enabled the team to link the molecular origins of a rare inherited leukemia predisposition disorder, ‘Shwachman-Diamond Syndrome’ and a more common form of acute leukemia to a common pathway involved in the construction of ribosomes.\nA Surprising New Path to Tumor Development (Credit: PLoS Biology) The research, funded by the blood cancer charity Bloodwise and the Medical Research Council (MRC), is published online in the journal Nature Structural and Molecular Biology.\nRibosomes are the molecular machinery in cells that produce proteins by ‘translating’ the instructions contained in DNA via an intermediary messenger molecule. Errors in this process are known to play a part in the development of some bone marrow disorders and leukemias. Until now scientists have been unable to study ribosomes at a high enough resolution to understand exactly what goes wrong.\nRibosomes are constructed in a series of discrete steps, like an assembly line. One of the final assembly steps involves the release of a key building block that allows the ribosome to become fully functional. The research team showed that a corrupted mechanism underlying this fundamental late step prevents proper assembly of the ribosome.\nThis provides an explanation for how cellular processes go awry in both Shwachman-Diamond syndrome and one in 10 cases of T-cell acute lymphoblastic leukemia. This form of leukemia, which affects around 60 children and young teenagers a year in the UK, is harder to treat than the more common B-cell form.\nThe findings from the Cambridge scientists, who worked in collaboration with scientists at the University of Rennes in France, open up the possibility that a single drug designed to target this molecular fault could be developed to treat both diseases.\nCryo-EM map showing the large ribosomal subunit (cyan), eIF6 (yellow) and the SBDS protein (magenta) that is deficient in the inherited leukaemia predisposition disorder Shwachman-Diamond syndrome. (Credit: Alan Warren, University of Cambridge) Professor Alan Warren, from the Cambridge Institute of Medical Research at the University of Cambridge, said: \"We are starting to find that many forms of blood cancer can be traced back to defects in the basic housekeeping processes in our cells' maturation. Pioneering improvements to electron microscopes pave the way for the creation of a detailed map of the how these diseases develop, in a way that was never possible before.\"\nSingle particle cryo-electron microscopy preserves the ribosomes at sub-zero temperatures to allow the collection and amalgamation of multiple images of maturing ribosomes in different orientations to ultimately provide more detail.\nThe technique has been refined in the MRC Laboratory of Molecular Biology by the development of new ‘direct electron detectors’ to better sense the electrons, yielding images of unprecedented quality. Methods to correct for beam-induced sample movements and new classification methods that can separate out several different structures within a single sample have also been developed.\nDr. Matt Kaiser, Head of Research at Bloodwise, said: “New insights into the biology of blood cancers and disorders that originate in the bone marrow have only been made possible by the latest advances in technology. While survival rates for childhood leukemia have improved dramatically over the years, this particular form of leukemia is harder to treat and still relies on toxic chemotherapy. These findings will offer hope that new, more targeted, treatments can be developed.”\nThe research received additional funding from a Federation of European Biochemical Societies (FEBS) Long term Fellowship, the SDS patient charity Ted’s Gang and the Cambridge NIHR Biomedical Research Centre.", "external_links": [], "published": "2015-10-20T03:00:00.000+03:00", "crawled": "2015-10-21T00:05:26.352+03:00", "highlightTitle": ""}