{"organizations": [], "uuid": "8b1a31b246bdc89a376a4ec0eb3c57ac495086d6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.gizmag.com", "main_image": "http://img.gizmag.com/architecturedesignfilmfestival-3.jpg?fit=max&h=594&rect=0%2C33%2C1623%2C913&w=1060&s=8f8e195899de2d4a8d4fe395247dcc94", "site_section": "http://gizmag.com/xml/", "section_title": "Gizmag Emerging Technology Magazine", "url": "http://www.gizmag.com/ar-vr-lounge-architect-design-film-festival/39936/", "country": "US", "title": "Film festival brings AR/VR to architects and designers", "performance_score": 0, "site": "gizmag.com", "participants_count": 1, "title_full": "Film festival brings AR/VR to architects and designers", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T10:40:00.000+03:00", "replies_count": 0, "uuid": "8b1a31b246bdc89a376a4ec0eb3c57ac495086d6"}, "author": "Aaron Heinrich", "url": "http://www.gizmag.com/ar-vr-lounge-architect-design-film-festival/39936/", "ord_in_thread": 0, "title": "Film festival brings AR/VR to architects and designers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Image Gallery (9 images) \nArchitects and designers who attended the Architecture and Design Film Festival (ADFF) in New York this past week got a first hand look at how augmented reality (AR) and virtual reality (VR) can be used in their respective industries. For the first time in the festival’s seven year history, an AR/VR lounge was set up separate from the traditional film screenings to showcase short films that illustrated the immersive abilities of both of these technologies. \nWearing either inexpensive Google Cardboard or the more pricey Oculus Rift headsets, attendees had their choice of watching three films: W57 that took the viewer through a tour of the high rise that’s under construction at West 57 th in New York (produced by Squint/Opera); The Digital Gyre which provided an interactive look at what happens to the physical architectural models that don’t get used in a design project (created by ParcOffice); and MAKOKO Life that presented a first person point of view of children canoeing to a new school built of bamboo on a river in Lagos, Nigeria (from the Azimyth Creation Studio). \nThere was also an invitation only demonstration presented by Trimble and Microsoft of a HoloLens system designed and built by Brooklyn-based SITU Studio that allowed users to immediately see the affects of changes they made to specific building elements and dimensions. Let’s say an architect wanted to add two stories on top of a high rise, for example. This HoloLens display would allow the designer to see how this would affect overall construction and the resulting shadows cast on nearby buildings at different times of the day. \nThe Azimyth Immersive Lounge wasn’t just focused on the visual. The Arup m| Lab featured the Arup SoundLab and showed how sounds can differ depending on location and environmental changes. For instance, by using a combination of sound measurement, computer modeling, predictive tools, and data analytics, the Arup SoundLab conveyed how the construction of berms of different heights would affect the sound of train traffic and a person’s view of the surrounding landscape. \nKyle Bergman, founder and festival program director, says the addition of the AR/VR lounge to this year’s event was meant to immerse attendees in the storytelling nature of architecture and design in a way most would not have been exposed to before. It was also meant to provide some idea of how AR and VR could be used in the design process. \n\"These technologies have the ability to greatly impact the future of architecture and design from modeling to construction management,\" explained Bergman. \"They will allow you to see and hear the impact of a design decision before you physically model it or begin constructing it. The technology is almost there and once it is, most of the big design firms will begin to adopt it.\"", "external_links": [], "published": "2015-10-20T10:40:00.000+03:00", "crawled": "2015-10-20T11:13:18.396+03:00", "highlightTitle": ""}