{"organizations": ["Army"], "uuid": "f6dd1b974ab9cd54f702d8a29c5540fcffb7f750", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fcw.com", "main_image": "", "site_section": "http://fcw.com/rss-feeds/all.aspx", "section_title": "FCW: The business of federal technology", "url": "https://fcw.com/articles/2015/10/13/army-cyber-strategy-lyngaas.aspx", "country": "US", "title": "Army readies new cyber strategy", "performance_score": 0, "site": "fcw.com", "participants_count": 0, "title_full": "Army readies new cyber strategy", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T00:51:00.000+03:00", "replies_count": 0, "uuid": "f6dd1b974ab9cd54f702d8a29c5540fcffb7f750"}, "author": "", "url": "https://fcw.com/articles/2015/10/13/army-cyber-strategy-lyngaas.aspx", "ord_in_thread": 0, "title": "Army readies new cyber strategy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Sean Lyngaas"], "text": "Army readies new cyber strategy By Sean Lyngaas Oct 13, 2015 \nThe Army is readying a new strategy for cyberspace that will span acquisition policy, command and control, and private sector outreach, Col. Carmine Cicalese, chief of cyberspace and information operations at Army headquarters, told FCW. \nThe strategy, which Cicalese said he expects the Army will publish by the end of November, reflects the service's effort to grapple with a cyber domain that affects a number of Army disciplines, including signals intelligence and electronic warfare. The strategy will help the Army \"be more proactive and be able to look forward across the enterprise where we're going as an institution,\" Cicalese said in an Oct. 13 interview. \nThe acquisition component of the strategy is designed to get offensive and defensive capabilities to the cyber protection teams being deployed by Army Cyber Command. \"How do we put the policies in place so that we can be as fast as possible, until if and when the laws are changed?\" Cicalese said. \nAs for private-sector outreach, the Army is following the Defense Department's cue and setting up its own outreach office in Silicon Valley, Cicalese said. The Army office will work in tandem with the Defense Innovation Unit Experimental, but will be housed at a separate location. \nThe purpose of the increased presence in Silicon Valley goes beyond looking for the latest software patch or technology fix, Cicalese continued. \"It's looking more, I think, at the technology trends, seeing where does the department need to go before it's already out in the commercial sector and it's old news in the commercial sector.\" \nArmy Secretary John McHugh in September 2014 established a new cyber-specific branch, equating cyber with more-traditional Army career paths such as infantry. Army Cyber Command Sgt. Maj. Rodney Harris has explained the need for this career branch by saying that the Army, more than the other services, has a unique need to \" push cyber capabilities down to the tactical level .\" \nAsked to reflect on the Army's distinct cyber challenge compared to other services, Cicalese noted that the Army operates \"in close proximity, perpetually, to people, and it's people who affect the network.\" \nCicalese also explained the three phases of developing cyber skills across the Army's workforce. The first saw hundreds of active-duty officers request to join the new cyber branch at the Army Cyber Center of Excellence in Fort Gordon, Ga. The second phase involves assessing how cyberspace affects related domains like electronic warfare. The third phase, according to Cicalese, entails thinking about \"enablers,\" such as information operations, that affect the Army's ability to operate in cyberspace. \n\"You do information operations in the land environment [and] you do it through cyber, but sometimes you're doing it at different targets for different purposes,\" he said. \"Sometimes you're doing it through the land command, sometimes you're doing it in cyber for the cyber commander.\" About the Author \nSean Lyngaas is an FCW staff writer covering defense, cybersecurity and intelligence issues. Follow him on Twitter: @snlyngaas", "external_links": [], "published": "2015-10-14T00:51:00.000+03:00", "crawled": "2015-10-14T06:30:53.689+03:00", "highlightTitle": ""}