{"organizations": ["Gulf News Gitex Technology Week", "Dubai Metro"], "uuid": "15d7521a28a9f8f36342d21784622c21c17e48e2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.google.com", "main_image": "http://static.gulfnews.com/polopoly_fs/1.1602580!/image/4236468214.jpg_gen/derivatives/box_475/4236468214.jpg", "site_section": "http://news.google.com/news?hl=en&gl=us&q=technology&pws=0&bav=on.2,or.r_gc.r_pw.r_cp.r_qf.&bpcl=38093640&biw=1366&bih=653&um=1&ie=UTF-8&output=rss", "section_title": "technology - Google News", "url": "http://news.google.com/news/url?sa=t&fd=R&ct2=us&usg=AFQjCNEelNnOLJUMU2LcdpHw4Uyw4uHHWA&clid=c3a7d30bb8a4878e06b80cf16b898331&cid=52778971082258&ei=M7UjVtDiDpzVa53KoagI&url=http://gulfnews.com/business/sectors/retail/gitex-technology-week-2015-live-coverage-1.1602147", "country": "IL", "title": "Gitex Technology Week 2015: Live coverage - gulfnews.com", "performance_score": 0, "site": "google.com", "participants_count": 0, "title_full": "Gitex Technology Week 2015: Live coverage - gulfnews.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T17:06:00.000+03:00", "replies_count": 0, "uuid": "15d7521a28a9f8f36342d21784622c21c17e48e2"}, "author": "", "url": "http://news.google.com/news/url?sa=t&fd=R&ct2=us&usg=AFQjCNEelNnOLJUMU2LcdpHw4Uyw4uHHWA&clid=c3a7d30bb8a4878e06b80cf16b898331&cid=52778971082258&ei=M7UjVtDiDpzVa53KoagI&url=http://gulfnews.com/business/sectors/retail/gitex-technology-week-2015-live-coverage-1.1602147", "ord_in_thread": 0, "title": "Gitex Technology Week 2015: Live coverage - gulfnews.com", "locations": ["Dubai"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Atiq", "Alexander Cornwell"], "text": "Gitex Technology Week 2015 is happening at Dubai World Trade Centre. Follow our live coverage Smart watches will soon replace Nol cards for some Dubai Metro commuters. Image Credit: Gulf News Gitex Technology Week this year is expected to welcome more than 140,000 visitors from over 140 countries Image Credit: Ahmed Ramzan/Gulf News More than 3,600 companies from over 62 countries are taking part in the five-day Gitex Technology Week Image Credit: Ahmed Ramzan/Gulf News Preparation for Gitex technology 2015 at Dubai World Trade Centre. The event will be themed around the key pil Image Credit: Atiq ur Rehman/Gulf News The Etisalat stand at Gitex. Image Credit: Alexander Cornwell ‹ › Published: 18:32 October 18, 2015 Gulf News Report share Gulf News reporters bring you the latest updates from Gitex. Follow our live coverage as Gitex Technology Week 2015 marks its 35th anniversary \n\n6.05pm: Pay for metro with Nol Watch \nCommuters will soon be able to have smart watches to replace Nol cards as the Roads and Transport Authority (RTA) is planning to introduce a series of NFC-enabled wrist watches that will help pay the public transport fares in Dubai, Gulf News can confirm. \nOn display at the 35th Gitex Technology Week, the wrist watches are currently being studied as one of the means of fare payment, just like the NFC-enabled smart phones. \n“We have tied up with a firm, Watch2pay, for the devices. We have tested the devices and they have received the pass certificate by our technical team. Currently, we are conducting a survey with the commuters to have their feedback on the product and to find out what prices and designs would be ideal,” said Khalid Al Awadhi, Director of Automated Fare Collection at RTA. \nMore to follow. \n5.29pm: Digital payments to outpace cash by 2020 \nUAE consumers, businesses, merchants, banks, forex exchanges and even government service providers will be handling far less cash by 2020, according to the digital payments service company, Trriple. \nAnnually, the UAE counts USD 230 billion in consumer payments to 170 government entities and more than 350,000 merchants. And yet cash accounts for more than 75% of all transactions in the Emirates, a number the company says is set to plunge as demand increases for a wide range of payment services, from mobile wallets and mobile point-of-sale to electronic payments and global money transfers. \n“We are poised to usher in the ‘cashless society’ here in the UAE,” says Ahmed Fasih Akhtar, Trriple co-founder. \nMore here. \n5.22pm: Alibaba's Dubai joint venture to start operations first half 2016 \nA new joint venture between China’s e-commerce company Alibaba and Dubai’s Meraas Holding will open a data centre in Dubai in the first half of 2016, Ethan Yu, vice-president of the Alibaba Group, told Gulf News on Sunday. \nAlibaba and Meraas are forming a joint-venture big data cloud computing services company called Yvolv to cover the Middle East region. The two companies signed a partnership deal earlier this year and announced it on Saturday ahead of Gitex Technology Week. \n“Dubai is the centre of Mena [the Middle East and North Africa], that is no doubt,” Yu said. “Dubai is the place to be if you want to get to the Mena area.” \nMore here. \n5.14pm: 5G network showcased at Gitex \nNow streaming high-capacity videos is going to become a piece of cake when 5G network is going to be implemented by 2020. \nBoth the telecom operators in the UAE are showcasing live 5G network demonstrations to achieve ultra-low latency and impressive peak data rates of 10Gbps. \nDu demonstrated that a 5GB Blu-ray movie can be downloaded in 0.5 seconds on a 5G network while it took 50 seconds to download the same movie size on a 4G network. In 3G network, with a maximum speed of 42Mbps, it took 108 seconds to download 1GB of data. So you can imagine the time taken to download a 5GB movie, it will take 540 seconds. \nHats off to 5G but we are still five years away. Many telecom operators are testing the 5G but the GSMA hasn’t come to an industry standard on 5G network. \n5.08pm: Lord of the Rings and The Hobbit films used dark fibre, Gitex audience told \nCelia Wade-Brown, Mayor of New Zealand City Wellington, tells an audience at Gitex Technology Week that the Lord of the Rings and The Hobbit films used dark fibre the city council had installed years earlier. \nWade-Brown says smart cities need to think ahead to the future, pointing that the City of Wellington never thought the bow famous film series would be using dark fibre when the council was installing it. \nDark fibre can be used for private networking and as infrastructure for Internet access. \nThe Lord of the Rings trilogy was filmed entirely in New Zealand including on Mount Victoria, which is within walking distance from Wellington city. The Hobbit was also filmed in New Zealand, including Wellington. \n4.56pm: TRA launches ‘Coverage’ to monitor mobile networks \nThe UAE Telecommunication Regulatory Authority is aiming to boost the competitiveness of the telcom operators and stimulate the mobile experience of the consumers as part of the Smart City initiative. \nSaif Bin Ghleita, director of technology development affairs at TRA, told Gulf News, that ‘Coverage’ is a smart and innovative system developed by the TRA for field scanning, testing and analysing the performance of operators’ networks. \n“We have tailor-made cars equipped with certain tools for monitoring and analysing the mobile networks that are available whenever needed. We monitor the social networking platforms and when we hear a complaint about an issue, we monitor the network issue and inform the concerned telco operators to rectify the issue. The issue can be electronically seen on our control room in Dubai immediately,” he said. \n4.48pm: MoF launches eD-Mobile/Wallet applications for smart mobile payments \nThe Ministry of Finance, MoF, has announced the launch of the eD-Mobile/Wallet smart phone applications which will enable eDirham customers to use auxiliary and stored value amounts for making payment transactions, without having to physically produce a card. \neD-Mobile/Wallet applications, which support the UAE’s national plan towards an electronic and smart government, enables users to make secure, easy, fast and convenient electronic payments for services via the internet and mobile phones. \nSaeed Rashid Al Yateem, Assistant Under-Secretary for Resources and Budget Sector at MoF, said, “Mobile payments are experiencing a fast-paced growth nowadays, and our launch today of eD-Mobile/Wallet applications is another milestone in the continuous rally to keep up with the latest technologies, in order to provide eDirham system users with a variety of feasible and convenient channels.” \nMore here. \n4.45pm: UAE number two for India’s electronics exports \nThe UAE has become India’s second top destination for export of electronics goods for the fiscal year 2014-15, said Kamal Vachani, regional director for Middle East at ESC (Electronics & Computer Software Export Promotion Council), an autonomous body under the Indian Ministry of Communications and IT. \nVachani said that the US is the top destination for electronics exports valued at $1.01 billion, followed by UAE at $440 million. He said the Middle East region continues to enjoy solid growth rates despite global slowdown and especially the Gulf countries. \n“India is making a number of efforts to enhance electronics manufacturing within the country,” he said. \nMore here. \n3.50pm: Etisalat stand draws curious visitors, Alexander Cornwell reports from Gitex \nWalking around Gitex on day one and it looks like telecom Etisalat has the grooviest stand out of everyone here this week. Curious visitors are passing by to check out the Formula 1 race car on display at the operators stand in Zabeel Hall. \nTheir stand, which is split in two with a public walkway down the middle, has the operators green branding floating above in a light display. We’re not sure what Etisalat is going for with their stand this year that includes Hospital, Smart Living, School and Transportation areas and people dressed up as nurses and school students but we will be sure to grab one of their executives this week to find out more about the concept. \n2.07pm: Panasonic unveils virtual mirror \nAmong the companies slated to unveil their latest innovations at Gitex, Japanese electronics giant Panasonic has launched its Interactive Mirror. \nUsing built-in high definition cameras, the virtual mirror is enabled with face analyzing feature to point out every flaw, such as age spots or fine lines, and suggestions on how to fix them. \nDubbed as the new professional health and beauty advisor, the interactive mirror has an oval \"augmented-reality portal\" that activates with a press of a button on the remote. This product can be easily used by all ages, with only minimal instruction. \n10.56am: Gitex Tech Week opens doors \nThe 35th edition of the Gitex Technology Week, which is taking place from October 18 to 22 at the Dubai World Trade Centre, has just been opened by Shaikh Hamdan Bin Mohammad Bin Rashid Al Maktoum, Crown Prince of Dubai and Chairman of Dubai Executive Council. \nThe five-day event is expected to draw more than 140,000 visitors from over 140 countries. More than 3,600 companies from over 62 countries have signed up for the event. \nThis year’s theme is ‘The Internet Future of Everything”, revolving around the pillars of innovation, connected cloud, big data, mobility and security, along with the return of the Google CSI Lab. \nThe event is also expected to welcome more than 140,000 visitors from over 140 countries including more than 20,000 C-level executives. \nOf the 3,600 participating companies, 30 per cent are from the UAE and around eight per cent are from the Gulf countries. \nWhat to expect at Gitex Tech Week \nMore than 3,600 companies from over 62 countries are taking part in the five-day Gitex Technology Week from October 18 to 22 at the Dubai World Trade Centre. The event is also expected to welcome more than 140,000 visitors from over 140 countries including more than 20,000 C-level executives. Here's what to expect \n\nWith inputs from Naushad K Cherrayil and Alexander Cornwell share", "external_links": [], "published": "2015-10-18T17:06:00.000+03:00", "crawled": "2015-10-18T18:05:57.748+03:00", "highlightTitle": ""}