{"organizations": [], "uuid": "6b37682f6cff3cb7e865699dd32d746edc1dc595", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.gizmag.com", "main_image": "http://img.gizmag.com/lumo-run-6.png?fit=max&h=594&rect=0%2C107%2C1019%2C573&w=1060&s=9ce6ea5dd84eadfd852bc3360bbe9c35", "site_section": "http://feeds.feedblitz.com/Gizmag", "section_title": "Gizmag Emerging Technology Magazine", "url": "http://www.gizmag.com/lumo-smart-shorts/39757/", "country": "US", "title": "Lumo smart shorts offer real-time feedback on your jogging technique", "performance_score": 0, "site": "gizmag.com", "participants_count": 1, "title_full": "Lumo smart shorts offer real-time feedback on your jogging technique", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T05:52:00.000+03:00", "replies_count": 0, "uuid": "6b37682f6cff3cb7e865699dd32d746edc1dc595"}, "author": "Nick Lavars", "url": "http://www.gizmag.com/lumo-smart-shorts/39757/", "ord_in_thread": 0, "title": "Lumo smart shorts offer real-time feedback on your jogging technique", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Image Gallery (9 images) \nWhile they do a fine job of keeping our dignity intact, the waistbands in our running shorts harbor more potential in the eyes of California-based Lumo. The wearables company believes there's some useful data to be gleaned by tracking movement in our hips and pelvis. Its Lumo Run smart shorts feature an array of sensors that tracks things like stride length, bounce and number of steps as you put one foot after the other, offering real-time advice on overall jogging performance and injury prevention. \nLumo has been slapping sensors on bodies to better people's well-being since 2012, when it debuted a waistband aimed at correcting posture. This was succeeded by a smaller, collar-worn device called the Lumo Lift that tracks posture, steps, distance, and calories burned. Buoyed by apparent success in this area the company is now spreading its wearable wings to cover new parts of the human body. \nLumo Run comes in the form of either capris pants for women or plain old running shorts for men. Hidden inside the waistband of both is a 9-axis inertia measurement unit (IMU) and a Bluetooth LE module that gathers and shares data with a paired smartphone app. This includes cadence (steps for minute), the amount your entire body bounces with each stride, how long your foot stays in contact with the ground, pelvic movement and stride length. \nHIdden inside the waistband of both is a 9-axis inertia measurement unit (IMU) and a Bluetooth LE unit that gathers and shares data with a paired smartphone app \nIn-app algorithms then assess this information and offer both audio cues through headphones mid-session for a more effective, injury-averse running style and then a summary once you're done. The device can still offer a post-run analysis if the user's phone is left at home, however, by gathering the same data and then synching once they return. \nThe fitness tracking craze has seen a number of systems developed with similar aims in mind. Back in 2013, Fraunhofer revealed it was working on a high-tech running shoe to monitor jogging technique, while the Altra Halo shoe on show at CES earlier this year is designed to serve a similar purpose. And more recently, the Sensoria Smart Running outfit is claimed to offer a complete head-to-toe solution. \nBut tucked away in otherwise plain old running gear, Lumo Run may well be the most discreet. It runs on a lithium polymer battery said to last for 25 hours with each charge and is machine washable. Colors are limited to black at this stage, and the app will work with Apple devices running iOS 9 or later (no mention of Android support). It is available for pre-order through Lumo's website for US$99 and is expected to cost $149 once it hits the shelves. \nYou can check out the promo video below.", "external_links": [], "published": "2015-10-08T05:52:00.000+03:00", "crawled": "2015-10-08T06:24:40.247+03:00", "highlightTitle": ""}