{"organizations": [], "uuid": "e3edecf946f436b6556ce377e507cdc3af2fadfe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.newswise.com", "main_image": "", "site_section": "http://www.newswise.com/legacy/feed/channels.php?channel=41", "section_title": "Newswise Feature Channel: Technology", "url": "http://www.newswise.com/articles/view/641496/?sc=c41", "country": "US", "title": "Affordable Camera Reveals Hidden Details Invisible to the Naked Eye", "performance_score": 0, "site": "newswise.com", "participants_count": 1, "title_full": "Affordable Camera Reveals Hidden Details Invisible to the Naked Eye", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T23:05:00.000+03:00", "replies_count": 0, "uuid": "e3edecf946f436b6556ce377e507cdc3af2fadfe"}, "author": "University of Washington", "url": "http://www.newswise.com/articles/view/641496/?sc=c41", "ord_in_thread": 0, "title": "Affordable Camera Reveals Hidden Details Invisible to the Naked Eye", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Affordable Camera Reveals Hidden Details Invisible to the Naked Eye Released: 15-Oct-2015 3:05 PM EDT \n  Citations \nhttp://www.washington.edu/news/2015/10/15/affordable-camera-reveals-hidden-details-invisible-to-the-naked-eye/ \nNewswise — Peering into a grocery store bin, it's hard to tell if a peach or tomato or avocado is starting to go bad underneath its skin. \nBut an affordable camera technology being developed by the University of Washington and Microsoft Research might enable consumers of the future to tell which piece of fruit is perfectly ripe or what food in the fridge is going rotten. \nThe team of computer science and electrical engineers developed HyperCam, a lower-cost hyperspectral camera that uses both visible and invisible near-infrared light to \"see\" beneath surfaces and capture unseen details. This type of camera is typically used in industrial applications and can cost between several thousand to tens of thousands of dollars. \nIn a paper presented at the UbiComp 2015 conference, the team detailed a hardware solution that costs roughly $800, or potentially as little as $50 to add to a mobile phone camera. They also developed intelligent software that easily finds \"hidden\" differences between what the hyperspectral camera captures and what can be seen with the naked eye. \nWhen HyperCam captured images of a person's hand, for instance, they revealed detailed vein and skin texture patterns that are unique to that individual. That can aid in everything from gesture recognition to biometrics to distinguishing between two different people playing the same video game. \nAs a preliminary investigation of HyperCam's utility as a biometric tool, in a test of 25 different users, the system was able differentiate between hand images of users with 99 percent accuracy. \nIn another test, the team also took hyperspectral images of 10 different fruits, from strawberries to mangoes to avocados, over the course of a week. The HyperCam images predicted the relative ripeness of the fruits with 94 percent accuracy, compared with only 62 percent for a typical camera. \n\"It's not there yet, but the way this hardware was built you can probably imagine putting it in a mobile phone,\" said Shwetak Patel, Washington Research Foundation Endowed Professor of Computer Science & Engineering and Electrical Engineering at the UW. \n\"With this kind of camera, you could go to the grocery store and know what produce to pick by looking underneath the skin and seeing if there's anything wrong inside. It's like having a food safety app in your pocket,\" Patel said. \nHyperspectral imaging is used today in everything from satellite imaging and energy monitoring to infrastructure and food safety inspections, but the technology's high cost has historically limited its use to industrial or commercial purposes. The UW and Microsoft Research team wanted to see if they could make a relatively simple and affordable hyperspectral camera for consumer uses. \n\"Existing systems are costly and hard to use, so we decided to create an inexpensive hyperspectral camera and explore these uses ourselves,\" said Neel Joshi, a Microsoft researcher who collaborated on the project. \"After building the camera we just started pointing it at everyday objects — really anything we could find in our homes and offices — and we were amazed at all the hidden information it revealed.\" \nA typical camera divides visible light into three bands — red, green and blue — and generates images using different combinations of those colors. But cameras that utilize other wavelengths in the electromagnetic spectrum can reveal invisible differences. \nNear-infrared cameras, for instance, can reveal whether crops are healthy or a work of art is genuine. Thermal infrared cameras can visualize where heat is escaping from leaky windows or an overloaded electrical circuit. \n\"When you look at a scene with a naked eye or a normal camera, you're mostly seeing colors. You can say, 'Oh, that's a pair of blue pants,'\" said lead author Mayank Goel, a UW computer science and engineering doctoral student and Microsoft Research graduate fellow. \"With a hyperspectral camera, you're looking at the actual material that something is made of. You can see the difference between blue denim and blue cotton.\" \nHyperCam, which uses the visible and near-infrared parts of the electromagnetic spectrum, illuminates a scene with 17 different wavelengths and generates an image for each. \nOne challenge in hyperspectral imaging is sorting through the sheer volume of frames produced. The UW software analyzes the images and finds ones that are most different from what the naked eye sees, essentially zeroing in on ones that the user is likely to find most revealing. \n\"It mines all the different possible images and compares it to what a normal camera or the human eye will see and tries to figure out what scenes look most different,\" Goel said. \nOne remaining challenge is that the technology doesn't work particularly well in bright light, Goel said. Next research steps will include addressing that problem and making the camera small enough to be incorporated into mobile phones and other devices, he said. \nThe project was funded by Microsoft Research. \nCo-authors include Eric Whitmire, Alex Mariakakis and the late Gaetano Borriello of the UW's Department of Computer Science & Engineering and T. Scott Saponas, Neel Joshi, Dan Morris, Brian Guenter and Marcel Gavriliu at Microsoft Research. \n###", "external_links": [], "published": "2015-10-15T23:05:00.000+03:00", "crawled": "2015-10-16T01:11:36.907+03:00", "highlightTitle": ""}