{"organizations": [], "uuid": "eafe6c80ebb0bc387a0ea267de958a13582f1568", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mercurynews.com", "main_image": "http://extras.mnginteractive.com/live/media/site568/2014/0220/20140220_050908_0221fiber1.jpg", "site_section": "http://feeds.mercurynews.com/mngi/rss/CustomRssServlet/568/200770.xml", "section_title": "Technology", "url": "http://www.mercurynews.com/bay-area-news/ci_28996963/", "country": "IL", "title": "San Jose could be first California city to get Google Fiber service", "performance_score": 0, "site": "mercurynews.com", "participants_count": 1, "title_full": "San Jose could be first California city to get Google Fiber service", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T06:17:00.000+03:00", "replies_count": 0, "uuid": "eafe6c80ebb0bc387a0ea267de958a13582f1568"}, "author": "Ramona Giwargis and Matt O'Brien\n\nStaff Writers", "url": "http://www.mercurynews.com/bay-area-news/ci_28996963/", "ord_in_thread": 0, "title": "San Jose could be first California city to get Google Fiber service", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "San Jose could be first California city to get Google Fiber service By Ramona Giwargis and Matt O'Brien Staff Writers Posted: 10/20/2015 02:20:00 PM PDT Updated: 10/20/2015 08:17:59 PM PDT SAN JOSE -- Google is moving forward with plans to expand Google Fiber into the heart of Silicon Valley, potentially making San Jose the first city in California and fourth in the nation to carry the Mountain View technology giant's lightning-fast fiber Internet and TV service. \nSan Jose leaders remained tight-lipped about the expansion plans Tuesday, but Google has applied for permits to build two of the shed-like shelters -- called \"Fiber Huts\" -- to house its fiber cables on Santa Teresa Boulevard, near Thornwood Drive, and Bird Avenue, near Virginia Street. The company plans to build at least eight more, city documents show. Installers for Google Fiber confer while working, March 19, 2013, in northwest Kansas City, Kansas. (Keith Myers/Kansas City Star/MCT) \nGoogle said installing the Fiber Huts is an important first step. \"We continue to make great progress working alongside city leaders, and hope to share an update soon,\" said Google Fiber spokeswoman Kelly Mason. \nCity Hall sources say an official announcement about Google Fiber's expansion into San Jose could come as early as late November or early December. It's not clear how soon Google Fiber will be available to consumers and at what prices, or whether it will initially roll out to all of San Jose or start with select neighborhoods that demand the service -- which Google calls \"fiberhoods.\" Advertisement \nGoogle's bid to bring Fiber to the city, which comes after more than a year of courtship between Google and City Hall, would make San Jose one of the largest cities to offer the fiber-optic service, which promises faster Internet with a connection of up to 1,000 megabits per second. Comcast's fastest Internet plan in most of San Jose reaches 250 megabits per second, and AT&T offers 18. Google Fiber also boasts a TV service with more than 150 channels, encroaching on a Silicon Valley market dominated by AT&T and Comcast. \nToday, Google Fiber is only available in Austin, Texas; Kansas City, Missouri; and Provo, Utah -- but rollout plans are underway in six other major cities, including Nashville, Atlanta and Salt Lake City. \nSan Jose long was considered a \"potential expansion city\" for the service but talks between Google officials and city leaders stalled at least twice. \nGoogle is also in talks with city officials in Palo Alto, Sunnyvale, Santa Clara and its home base of Mountain View about installing Fiber infrastructure. \n\"We are optimistic that there will be a decision soon, and we look forward to an announcement from Google,\" said Sunnyvale spokeswoman Jennifer Garnett. \nSan Diego and Irvine are the only two other California cities being considered for the service. A Google fiber hut in Kansas City, Kansas, 2012. ( (Chris O'Brien/staff)) \nAccording to the project proposal, Google plans to install 2,300 miles of fiber optic cables -- 1,340 miles below ground and 960 miles in the sky using existing utility poles. An environmental report released last week shows the construction of the huts has no adverse impact on the environment. Google will use existing roads, underground utility poles and water, gas and electricity lines to design and build the new network, according to the analysis. \nResidents have 30 days to comment on the proposal before it goes to the Planning Commission in November for adoption, said city Planning Director Harry Freitas. The commission is expected to approve the two conditional-use permits, and Google will apply for more permits in several stages. \nThe first \"Fiber Hut\" will be in Councilman Pierluigi Oliverio's district. He said District 6 residents have long demanded the fiber service. \n\"They think Google has panache, or they think the competition will provide lower price opportunity,\" Oliverio said. \"I've heard comments about AT&T and Comcast not being very friendly because they're the only providers in town.\" \nMayor Sam Liccardo said he's been a strong advocate for building out broadband access citywide. He said it's an important tool for economic development and for \"broadening opportunities in those parts of San Jose where too many families remain on the wrong side of digital divide.\" \nBut just as Google Fiber expands its footprint into San Jose, other providers are rallying to provide faster Internet, more broadband and their own fiber services. \nComcast in May launched a new 2-gigabit service, which the company says is \"more than double what anyone else provides.\" The service will be available to nearly all of Northern and Central California, said Jenny Gendron, a media relations manager, instead of \"selecting a few cities to launch in, like other providers.\" \nAT&T will bring GigaPower -- its fiber-optic network, which reaches up to 1 gigabit per second -- to San Jose within the next few months, company officials confirmed Tuesday. \n\"Even before Google Fiber took off, we've been wanting to expand to San Jose and other major cities,\" said AT&T spokesman Leland Kim, adding the company will reach 1 million customers by the end of the year. \"We welcome competition. It's good for our customers and pushes all of us to step up our game.\" \nOne gigabit amounts to 1,000 megabits, so AT&T's GigaPower would be as fast as Google Fiber, and Comcast's new 2-gig launch would be twice as fast. \nCouncilman Johnny Khamis said AT&T has approached him about its expansion plans and says the competition will give San Jose residents more choices -- including himself. \"I can't wait to get rid of the provider I have,\" he said. \"Competition should help the market become more customer-friendly.\" Follow Ramona Giwargis at Twitter.com/ramonagiwargis or contact her at 408-920-5705. Contact Matt O'Brien at 408-920-5011. Follow him at Twitter.com/Mattoyeah .", "external_links": [], "published": "2015-10-21T06:17:00.000+03:00", "crawled": "2015-10-21T13:30:44.802+03:00", "highlightTitle": ""}