{"organizations": [], "uuid": "25d329b6661a486af06be59763a2c6f4df6e00ed", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.deccanherald.com", "main_image": "http://www.deccanherald.com/page_images/original/2015/10/23/507849.jpg", "site_section": "http://www.deccanherald.com/", "section_title": "Deccan Herald: Latest News, Nation, World, Business, Technology, Karnataka News &amp; Headlines", "url": "http://www.deccanherald.com/content/507849/2-indians-arrested-smuggling-people.html", "country": "US", "title": "2 Indians arrested for smuggling people into the US", "performance_score": 0, "site": "deccanherald.com", "participants_count": 2, "title_full": "2 Indians arrested for smuggling people into the US", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T03:00:00.000+03:00", "replies_count": 1, "uuid": "25d329b6661a486af06be59763a2c6f4df6e00ed"}, "author": "New York", "url": "http://www.deccanherald.com/content/507849/2-indians-arrested-smuggling-people.html", "ord_in_thread": 0, "title": "2 Indians arrested for smuggling people into the US", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "2 Indians arrested for smuggling people into the US New York, Oct 23, 2015, PTI: Two Indians have been arrested in the US for their alleged involvement in smuggling people from India into America via Thailand.\nNileshkumar Patel, 41, and Harsad Mehta, 65 appeared in federal court yesterday to face charges that they conspired to use commercial airline flights to smuggle foreign nationals into the United States, US Attorney Paul J Fishman said.\nThe two are charged by criminal complaint with one count of conspiracy to bring in and harbor aliens. In addition, Patel is charged with six counts and Mehta is charged with four counts of smuggling foreign nationals into the United States for private financial gain.\nThey were arrested a day before by special agents of the US Department of Homeland Security when they arrived at New Jersey's Newark Liberty International Airport.\nThe conspiracy charge carries a maximum potential penalty of 10 years in prison and each substantive charge of smuggling carries a maximum potential penalty of five years in prison.\nAccording to the complaint, HSI received information that a smuggling operation run by Patel and Mehta was attempting to find methods to illegally smuggle foreign nationals from India into the US.\nThe investigation revealed that the smuggling organisation recruited Indian nationals and others to pay fees in exchange for passage to the US. Beginning in April 2014, an undercover law enforcement officer posing as a smuggler began meeting with Patel and Mehta in Bangkok.\nPatel and Mehta said they were involved in the smuggling business and had multiple Indian nationals that they were looking to smuggle into the US.\nMehta and Patel agreed to transport the Indian nationals from India to Thailand, at which point the undercover law enforcement officer would presumably use contacts to smuggle them into the US via commercial airline flights.\nPatel and Mehta agreed to wire a USD 10,000 down payment for each individual to be smuggled into the US and to pay a balance of tens of thousands of dollars for each individual once the foreign nationals arrive in America.\nOver the course of the scheme, the two paid between USD 10,000 to USD 50000 for each person they smuggled into the US. Over the ensuing months, Patel and Mehta arranged for six Indian nationals to be brought to Thailand for smuggling into the US via Newark airport.\nIn one of the meetings with the undercover officer, Mehta said they have some \"girls\" they were looking to get into the US. In another meeting, Patel told the agent that he had been smuggling people into the US since 1998, Special Agent Douglas Doherty said in the criminal complaint.", "external_links": ["http://web.ventunotech.com/plugins/cntplayer/ventuno_editorial_player.js"], "published": "2015-10-23T03:00:00.000+03:00", "crawled": "2015-10-23T06:48:55.957+03:00", "highlightTitle": ""}