{"organizations": [], "uuid": "c2134cf7601d928d0e42363029cbcb13f77fd634", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.menafn.com", "main_image": "http://menafn.com/images/shared/menafnlogo_sm.gif", "site_section": "http://www.menafn.com/rss/menafn_Comm_Tech_Technologies.xml", "section_title": "MENAFN.com Comm_Tech_Technologies", "url": "http://www.menafn.com/1094384547/Celebrities-Hari-DhillonGina-Beck-Among-Guests-At-Advanced-Vision-Cares-New-Clinic-Launch-Party&src=RSS", "country": "", "title": "Celebrities Hari DhillonGina Beck Among Guests At Advanced Vision Cares New Clinic Launch Party", "performance_score": 0, "site": "menafn.com", "participants_count": 1, "title_full": "Celebrities Hari DhillonGina Beck Among Guests At Advanced Vision Cares New Clinic Launch Party | MENAFN.COM", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "c2134cf7601d928d0e42363029cbcb13f77fd634"}, "author": "Press", "url": "http://www.menafn.com/1094384547/Celebrities-Hari-DhillonGina-Beck-Among-Guests-At-Advanced-Vision-Cares-New-Clinic-Launch-Party&src=RSS", "ord_in_thread": 0, "title": "Celebrities Hari DhillonGina Beck Among Guests At Advanced Vision Cares New Clinic Launch Party", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(MENAFN Press) Advanced Vision Care one of the most reputed vision correction specialists in the UK have held a launch party to celebrate the opening of their new cataract and lens exchange clinic. Celebrities including Hari Dhillon and Gina Beck were among the many guests to attend the party held at the company’s prestigious Harley Street clinic.\nAdvanced Vision Care a leading independent vision correction medical facility in London have recently invested heavily in new technology making them the most advanced cataract removal & lens exchange clinic in the nation. The new Alcon Suite has been widely publicized as the gold standard for these treatments and has even been featured by popular newspapers including the Daily Express.\nThe clinic established and run by the world renowned Dr CT Pillai is currently the only one in the United Kingdom which treats patients using three of the most advanced surgical technologies & equipments available today. Surgeons at Advanced Vision Care’s new Alcon suite are able to combine the Verion Image Guided System Centurion Vision System and Luxor LX3 for truly advanced cataract removal and clear lens exchange surgery. When applied together these technologies facilitate precision lens removal and microscopic controlled incisions which may be analysed in real time. In short surgeons are able to construct highly personalised surgical plans and execute them with the chance of errors all but eradicated.\nCelebrities Hari Dhillon (Holby City) and Gina Beck (Wicked) who both had their vision corrected by Advanced Vision Care attended the Alcon Suite launch party and made guest speeches along with others including vision correction industry specialists and AVC staff members. The evening was also celebrated by many AVC patients opticians and insurance company officials.\nAside from launching the prestigious Alcon Suite the company received further good news during the month after being confirmed as a Bupa approved facility.\nAbout Advanced Vision Care\nSet-up in 2003 Advanced Vision Care (AVC) is regarded as being the premier laser eye surgery clinic on Harley Street. The facility is commonly touted as being UK’s best vision correction clinic. AVC offer most advanced laser eye surgery cataract surgery and lens exchange treatments in the United Kingdom. Learn more about Advanced Vision Care at \nMedia Contact:\nTukshad Engineer \nAddress: 77 Harley Street Marylebone London W1G 8QN UK\nPhone: 020 7935 7497\nEmail: info@advancedvisioncare.co.uk\nCorporate Video: \n\n\nAbout PRBuzz.com \nPRBuzz.com is a press release distribution service that distributes press releases to online news sites and blogs to help customers with search engine optimization and create buzz about their web site, news or business.", "external_links": [], "published": "2015-10-15T03:00:00.000+03:00", "crawled": "2015-10-16T08:48:04.164+03:00", "highlightTitle": ""}