{"organizations": [], "uuid": "dee8138077592f50b144ea077e3c648b3eaff87a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1143810/nec-display-solutions-introduces-latest-feature-rich-monitor-multisync-e-series", "country": "US", "title": "NEC Display Solutions Introduces Latest Feature-Rich Monitor to MultiSync E Series", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "NEC Display Solutions Introduces Latest Feature-Rich Monitor to MultiSync E Series", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T19:00:00.000+03:00", "replies_count": 0, "uuid": "dee8138077592f50b144ea077e3c648b3eaff87a"}, "author": "admin", "url": "http://www.freshnews.com/news/1143810/nec-display-solutions-introduces-latest-feature-rich-monitor-multisync-e-series", "ord_in_thread": 0, "title": "NEC Display Solutions Introduces Latest Feature-Rich Monitor to MultiSync E Series", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  NEC Display Solutions of America, Inc. \nCHICAGO -- (BUSINESS WIRE) -- NEC Display Solutions of America , a leading provider of commercial LCD display and projector solutions, today announced the MultiSync ® E203Wi-BK wide-screen desktop monitor with LED backlighting. This feature-rich display gives corporate and small-to-medium-sized business users a key tool to enhance productivity. \nThe LCD display features a high-performance AH-IPS panel, which provides wide viewing angles, outstanding color consistency and image accuracy. It also includes DisplayPort for added connectivity options, as well as a full-function ergonomic stand. \nIn addition, the E203Wi display radiates less heat, uses less packaging and utilizes more recycled plastics in its production. Mercury-free LED backlighting improves energy efficiency, reducing power consumption by nearly a third compared to its predecessor, while enabling easy transport and a slim design for saving valuable desk space. The monitor also is compliant with ENERGY STAR ® 6.0; and includes ECO Mode ™ and carbon footprint meter tools. \n“Businesses, regardless of size, are looking for high-performance monitors that save them money,” said Kevin Christopherson, Director of Product Marketing for Desktop Displays at NEC Display Solutions. “The E203Wi display delivers an outstanding set of features, is environmentally friendly and comes at an affordable price.” \nThe E203Wi also features an attachment point for an optional mount to hold thin and zero client devices, giving businesses more options for their work environments. The optional mount will be available shortly through NEC Display Solutions. \nThe E203Wi-BK display includes the following features: 20-inch, 16:9, LED-backlit LCD wide-screen panel Fully ergonomic stand with height, pivot, tilt and swivel adjustability 1600 x 900 native resolution DisplayPort, VGA and DVI-D connectivity Compatibility with NEC’s NaViSet Administrator asset management system Intelligent Power Manager (IPM), off timer and ambient light sensor that automatically dims the screen to further reduce energy consumption ENERGY STAR 6.0 compliance ECO Mode and carbon footprint meter \nThe E203Wi-BK will be available in October 2015 at an estimated street price of $179, and ships with a standard three-year parts and labor warranty, including the backlight. \nAbout NEC Display Solutions of America, Inc. \nNEC Display Solutions of America, Inc., is a leading designer and provider of innovative desktop LCD monitors, commercial- and professional-grade large-screen LCD displays, a diverse line of multimedia and digital cinema projectors, and integrated display solutions. It develops leading-edge visual technology and customer-focused solutions for a wide variety of markets, including digital signage, education, graphics, healthcare, restaurants, retail, transportation, and many more. NEC is orchestrating a brighter world with the quality and reliability of its products and outstanding customer service. For additional information about NEC Display Solutions of America products, call (866) NEC-MORE, or visit the website at www.necdisplay.com . Follow us on our social media channels: Facebook , YouTube , Google+ , Twitter and LinkedIn . \nAbout VUKUNET \nVUKUNET powers growth in the digital out-of-home advertising business, and creates new revenue opportunities for DOOH network owners from trading desks, digital agencies and online companies. As the only global solution for online DOOH ad buying, VUKUNET automates campaign planning, inventory availability, flighting of ads and reporting of POP. For additional information on this ad serving platform from NEC Display Solutions of America, please visit www.vukunet.com , or call (877) 805-VUKU. View source version on businesswire.com: http://www.businesswire.com/news/home/20151021005094/en/ Copyright © Business Wire 2015 \nTech Image (for NEC Display Solutions)Philip Anast, (312) 673-6054", "external_links": [], "published": "2015-10-21T19:00:00.000+03:00", "crawled": "2015-10-21T20:13:26.237+03:00", "highlightTitle": ""}