{"organizations": [], "uuid": "213fa372340b87db97be9a1a5902d72372e66047", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.whatech.com", "main_image": "", "site_section": "http://www.whatech.com/?format=feed&type=rss", "section_title": "WhaTech -  Technology News | Supplier Sourcing |  Community - WhaTech", "url": "https://www.whatech.com/cloud-computing/news/91273-bit535-hybrid-cloud-high-on-cios-agendas", "country": "AU", "title": "Hybrid cloud high on CIOs' agendas", "performance_score": 0, "site": "whatech.com", "participants_count": 1, "title_full": "Hybrid cloud high on CIOs' agendas", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T09:34:00.000+03:00", "replies_count": 0, "uuid": "213fa372340b87db97be9a1a5902d72372e66047"}, "author": "webmaster@whatech.com.au (Stern Curator)", "url": "https://www.whatech.com/cloud-computing/news/91273-bit535-hybrid-cloud-high-on-cios-agendas", "ord_in_thread": 0, "title": "Hybrid cloud high on CIOs' agendas", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published on Monday, 05 October 2015 17:34 Submitted by Stern Curator Page views: 58 times IDC predicts that more than 65 percent of enterprise IT organisations will commit to hybrid cloud before 2016. “Faced with new digital business initiatives, IT organisations are looking for low-cost, low-risk opportunities to increase agility,” IDC says. Sixty four percent of organisations surveyed by IDC said that the cost efficiencies gained from consolidating IT systems and infrastructure were a key driver for cloud deployments. Fifty seven percent cited speed of deployment and improved agility as most important. “Although just 30 percent of workloads are cloud-based today, IT managers expect that number to rise to more than 50 percent within two years,” IDC says. “And IT services delivered on a hybrid cloud platform will quadruple over the same period, from 16 percent today to 44 percent in 2017.” However there are a number of issues to be considered when contemplating the move and ScienceLogic, a company offering IT monitoring systems, has helpfully come up with a list of 20 Hybrid Cloud Questions CIOs Must Ask . Perhaps not surprisingly, question number one is: “How much will this migration cost?” And the answer is not straightforward. “Moving to the cloud shifts budget from capex to opex but it won’t necessarily save you absolute dollars. When figuring your true costs, don’t overlook the fact that cloud applications often speed your time to market and therefore potentially speed your RoI,” ScienceLogic notes. And don’t expect to get the full benefit of cloud without some expert assistance. Moving workloads to the cloud “Often requires assistance from managed services providers and partners that understand performance management, orchestration and far more,” ScienceLogic says. Most of the questions in the list, and the answers offered, tend to deal with technical issues around hybrid cloud, but as one senior IT executive points out, business needs should be the overriding consideration. Rich Hillebrecht, vice president and CIO of the application performance monitoring software provider Riverbed Technologies, interviewed for the Harvard Business Review’s Enterprisers Project , said: “The hybrid enterprise is born out of business needs. In reality, customers and/or employees, who are people, determine business needs. “CIOs must take the human element into consideration when implementing technologies and develop a strategy that's based on an employee or customer understanding, appreciating and enjoying a particular technology or its results.” Axelera CEO, Vic Cinc, said: “It really shouldn’t need saying that the human factor should be always front of mind in any technological transformation, but all to often technical people get too focussed on the technology.” About Axelera Axelera’s Cloud Platform and Managed Services are a secure, flexible, cost effective solution supported by Australian specialists.", "external_links": [], "published": "2015-10-05T09:34:00.000+03:00", "crawled": "2015-10-08T20:50:53.219+03:00", "highlightTitle": ""}