{"organizations": [], "uuid": "52c4746a1d38503bdff836038828ca6caca15c0a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1142371/sigma-corporation-america-brings-world-s-first-20mm-f1-4-lens-photoplus-expo-2015", "country": "US", "title": "Sigma Corporation of America Brings World’s First 20mm F1.4 Lens to PhotoPlus Expo 2015", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "Sigma Corporation of America Brings World’s First 20mm F1.4 Lens to PhotoPlus Expo 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T23:35:00.000+03:00", "replies_count": 0, "uuid": "52c4746a1d38503bdff836038828ca6caca15c0a"}, "author": "admin", "url": "http://www.freshnews.com/news/1142371/sigma-corporation-america-brings-world-s-first-20mm-f1-4-lens-photoplus-expo-2015", "ord_in_thread": 0, "title": "Sigma Corporation of America Brings World’s First 20mm F1.4 Lens to PhotoPlus Expo 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Submitted by admin on 10/19/2015 @ 1:35 PM Companies mentioned in this article: Sigma Corporation \nRONKONKOMA, N.Y. -- (BUSINESS WIRE) -- Sigma Corporation of America will debut its new Sigma 20mm F1.4 DG HSM Art lens at PhotoPlus Expo this week, exhibiting in booth #337 at New York City’s Javits Convention Center from October 22-24, 2015. In addition to the lineup of impressive new Global Vision products on display, such as the Sigma 24-35mm F2 DG HSM Art lens and Sigma dp Quattro camera series, Sigma Pros will be presenting throughout the day at the booth. \n“Those attending PhotoPlus Expo this year will get an exclusive first look at the market’s first full-frame 20mm F1.4 lens,” said Mark Amir-Hamzeh, president of Sigma Corporation of America. “PhotoPlus Expo is the perfect time for us to share our new lens lineup as well as our proven favorites, giving photographers a chance to test the amazing image quality our lenses and cameras are capable of.” \nVisitors of Sigma’s booth #337 will also have an opportunity to see Sigma’s cameras , as well as take a look through Sigma Pro David FitzSimmons ’ Critter Gallery. Sigma Pros Jennifer Rozenbaum , Robert O’Toole , Roman Kurywczak and James Schmelzer will also be presenting at the booth. \nSigma Corporation of America’s activities at this year’s PPE show will include: Test Drive Event : Open to attendees with a PPE 3-day Expo pass, where they can visit Sigma at the Test Drive event October 21 from 6:00pm to 8:00pm to get an exclusive look at Sigma’s new and innovative products on display -- including the new 20mm F1.4. Product lineup on display: From Sigma’s Global Vision announcement of the new 20mm F1.4 DG HSM, the new 24-35mm F2 DG HSM Art , 50mm F1.4 DG HSM Art , and the wildly popular pair of 150-600mm F5-6.3 DG OS HSM Sport and Contemporary hyper telephoto lenses, Sigma will have the full lens lineup on display in the most popular camera mounts. In addition, Sigma will be showcasing the high-image quality compact dp Quattro series and SD1 Foveon Sensor cameras. Additionally, Sigma’s industry-unique USB Dock will also be available at the booth for attendees to learn how to calibrate, customize and update their Global Vision lenses. Jennifer Rozenbaum’s Seminar – Posing Fundamentals for Boudoir and Beyond: Spend two hours with Sigma Pro Jen Rozenbaum on her photo walk, Wednesday, October 21 from 10:00am to 12:00pm, to see how she works with women to make them look amazing. There will also be an opportunity to practice in order to step up your posing skills and communication. FitzSimmons Critter Gallery: Sigma Pro Dave FitzSimmons, an award-winning freelance photographer and writer, specializes in wildlife photography and will be on-hand to talk about his unique critter image photography. Sigma Pro Speakers: Roman Kurywczak – Fast Glass for Nighttime Photography, Thursday and Friday at 10:30am ET; Zoom Lenses for Todays Wildlife Photographers, Thursday, Friday and Saturday at 1:00pm ET; The Complete Nature Photographer, Thursday and Friday at 4:00pm ET and Saturday at 10:30am ET James Schmelzer – Fast Lens and Constant Light Solutions for Compelling Headshots, Thursday, Friday and Saturday at 11:00am ET; Creative Lens Choices and Lighting for Dramatic Glamour Photography, Thursday, Friday and Saturday at 1:30pm ET Jennifer Rozenbaum – Common Mistakes in Boudoir Photography and how to Fix Them!, Thursday and Saturday at 12:00pm ET and Friday at 2:30pm ET; Jen’s Greatest Hits!, Thursday and Saturday at 2:30pm ET and Friday at 12:00pm ET Robert O’Toole - Wild by Nature--Exciting Images with Sigma Lenses, Thursday and Saturday at 11:30 am ET and Friday at 3:00pm ET; The Dream Shot: Tips and Strategies for making memorable wildlife images, Thursday and Saturday at 3:00pm ET and Friday at 11:30am ET Expert Technical Representatives : Observe product demonstrations of the industry-renowned Global Vision line including Contemporary, Art and Sports lenses by Sigma’s technical representatives. Learn about long lens sports photography by Marc Farb, focusing on Sigma’s line of telephoto and super telephoto lenses, including the150-600mm F-5-6.3 DG OS HSM Contemporary and Sports models. Ryan Brown, PPA Master Photographer, will discuss creative environmental portrait photography, and feature a range Global Vision lenses. Brett Wells, will overview Sigma’s Global Vision concept, along with guidance for best lens choices and use of the USB Dock for lens optimization. Daily Giveaways: Sigma will offer daily raffles for Prime Art lenses including the 24mm F1.4 DG HSM on Thursday, the 35mm F1.4 DG HSM on Friday and the 50mm F1.4 DG HSM on Saturday. \nFor information about Sigma, go to www.sigmaphoto.com or follow the company on Twitter , Instagram and Facebook . \nAbout Sigma Corporation Since 1961, Sigma has worked toward a single, simple goal: To imagine and develop photographic technologies that push the envelope, empower photographers and produce unparalleled imagery. We’ve honored this commitment by maintaining control of our design, research and development, and manufacturing processes in our own Aizu Factory. Our products are built with premium materials and are known worldwide for quality and performance. Our family-owned organization is the largest, independent SLR lens manufacturer in the world, producing more than 45 lenses that are compatible with most manufacturers, including Sigma, Canon, Sony, Nikon, Olympus, Panasonic and Pentax. Sigma Corporation also produces digital SLR cameras and high-definition digital compact cameras. The company is headquartered in Japan, with offices strategically located throughout Europe, Asia and North America. Photography is all we do, and it’s all we’ve done. For information about Sigma and our products, please visit www.sigmaphoto.com . View source version on businesswire.com: http://www.businesswire.com/news/home/20151019006605/en/ Copyright © Business Wire 2015", "external_links": [], "published": "2015-10-19T23:35:00.000+03:00", "crawled": "2015-10-20T00:59:41.673+03:00", "highlightTitle": ""}