{"organizations": [], "uuid": "0dbcc0139195cf7414991d8d3380ea4dcd75f61e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1142356/rambus-reports-third-quarter-financial-results", "country": "US", "title": "Rambus Reports Third Quarter Financial Results", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "Rambus Reports Third Quarter Financial Results", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T23:15:00.000+03:00", "replies_count": 0, "uuid": "0dbcc0139195cf7414991d8d3380ea4dcd75f61e"}, "author": "admin", "url": "http://www.freshnews.com/news/1142356/rambus-reports-third-quarter-financial-results", "ord_in_thread": 0, "title": "Rambus Reports Third Quarter Financial Results", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Submitted by admin on 10/19/2015 @ 1:15 PM Companies mentioned in this article: Rambus Inc. \nSUNNYVALE, Calif. -- (BUSINESS WIRE) -- Rambus Inc. (NASDAQ:RMBS) today reported financial results for the third quarter ended September 30, 2015. \nGAAP Financial Results: \nRevenue for the third quarter of 2015 was $73.8 million, which was up 1% over the second quarter of 2015 primarily due to higher royalty revenue offset by lower sales of security products. As compared to the third quarter of 2014, revenue was up 6% primarily due to higher royalty revenue due to the extension of the license agreement with SK hynix in the second quarter of 2015 and higher revenue from a new license agreement signed with IBM during the first quarter of 2015, offset by lower royalty revenue from ST Microelectronics. \nRevenue for the nine months ended September 30, 2015 was $219.5 million, which was down 2% over the prior year period, primarily due to lower royalty revenue from ST Microelectronics and NVIDIA Corporation, offset by higher revenue from a new license agreement signed with IBM during the first quarter of 2015 as well as higher sales of security and lighting products. \nTotal operating costs and expenses for the third quarter of 2015 were $56.1 million, 2% lower than the previous quarter and 2% higher than the third quarter of 2014. Third quarter operating costs and expenses of $56.1 million included $3.6 million of stock-based compensation expenses and $6.3 million of amortization expenses. In comparison, total operating costs and expenses for the second quarter of 2015 of $57.3 million included $4.4 million of stock-based compensation expenses and $6.3 million of amortization expenses. Total operating costs and expenses for the third quarter of 2014 were $55.2 million, which included $3.4 million of stock-based compensation expenses and $6.7 million of amortization expenses. The change in total operating costs and expenses in the third quarter of 2015 as compared to the second quarter of 2015 was primarily due to lower prototyping costs, lower costs of sales due to lower sales of security and lighting products and lower stock-based compensation costs partially offset by lower gain from sale of intellectual property. The change in total operating costs and expenses in the third quarter of 2015 as compared to the third quarter of 2014 was primarily attributed to higher expenses related to software design tools, higher headcount related costs and higher cost of sales due to higher sales of security and lighting products offset by lower consulting costs. \nTotal operating costs and expenses for the nine months ended September 30, 2015 were $168.4 million, 1% higher than the nine months ended September 30, 2014. The operating costs and expenses for the first nine months of 2015 of $168.4 million included $11.7 million of stock-based compensation expenses and $18.9 million of amortization expenses. This is compared to total operating costs and expenses for the nine months ended September 30, 2014 of $166.8 million, which included $11.2 million of stock-based compensation expenses, $20.3 million of amortization expenses and $2.5 million of retention bonus expense from acquisitions. The change in total operating costs and expenses was primarily attributable to higher headcount related costs, higher expenses related to software design tools, higher cost of sales due to higher sales of security and lighting products and higher prototyping costs offset by higher gain from sale of intellectual property, lower retention bonus expense from acquisitions and lower consulting costs. \nNet income for the third quarter of 2015 was $182.0 million as compared to net income of $6.9 million in the second quarter of 2015 and net income of $5.5 million in the third quarter of 2014. Diluted net income per share for the third quarter of 2015 was $1.52 as compared to diluted net income per share of $0.06 in the second quarter of 2015 and diluted net income per share of $0.05 in the third quarter of 2014, respectively. The change in net income for the third quarter of 2015 as compared to the prior quarter and the third quarter of 2014 included a tax benefit of $174 million related to the release of the Company's deferred tax asset valuation allowance against its U.S. deferred tax assets. \nNet income for the nine months ended September 30, 2015 was $198.4 million as compared to a net income of $18.4 million for the same period of 2014. Diluted net income per share for the nine months ended September 30, 2015 was $1.67 as compared to a diluted net income per share of $0.16 for the same period of 2014. The change in net income is due to the same reason as indicated above. \nNon-GAAP Financial Results (1): \nTotal non-GAAP operating costs and expenses in the third quarter of 2015 were $46.3 million, which was relatively flat as compared to the previous quarter, and 3% higher than the third quarter of 2014. \nTotal non-GAAP operating costs and expenses for the nine months ended September 30, 2015 were $137.8 million as compared to $132.8 million in the same period of 2014 due primarily to higher headcount related costs, higher expenses related to software design tools, higher cost of sales due to the sale of security and lighting products and higher prototyping costs offset by higher gain from sale of intellectual property, lower retention bonus expense from acquisitions and lower consulting costs. \nNon-GAAP net income in the third quarter of 2015 was $17.0 million, 6% higher than the prior quarter and 14% higher than the third quarter of 2014. Non-GAAP diluted net income per share was $0.14 in the third quarter of 2015 as compared to $0.13 in the prior quarter and $0.13 in the third quarter of 2014. \nNon-GAAP net income for the nine months ended September 30, 2015 was $50.0 million as compared to $53.4 million in the same period of 2014. Non-GAAP diluted net income per share was $0.42 for the nine months ended September 30, 2015 as compared to non-GAAP diluted net income per share of $0.45 in the same period of 2014. \nOther Financial Highlights: \nCash, cash equivalents, and marketable securities as of September 30, 2015 were $362.9 million, an increase of $14.8 million from June 30, 2015. The increase in cash was driven by operating activities. \nDuring the third quarter of 2015, the Company recorded an income tax benefit of approximately $167.0 million. The Company's tax benefit includes $174 million tax benefit related to the release of its deferred tax asset valuation allowance against its U.S. deferred tax assets. \nDuring the third quarter of 2015, the Company did not repurchase any shares of its common stock under its share repurchase program that authorizes the repurchase of up to an aggregate of 20.0 million shares. \nAdditionally, the Company announced that on October 16, 2015, its Board of Directors approved the commitment for a restructuring and a plan of termination resulting in a reduction of 8% of the Company’s headcount. The restructuring is expected to save approximately $10 million in 2016, from the current run rate, and the reductions in expense and associated workforce are expected to be completed by the first quarter of 2016. The total estimated cash payout related to the reduction in force will be approximately $3.5 million, which is related to severance and termination benefits. The estimated non-cash expense is expected to be approximately $1 million. \nFourth Quarter 2015 Outlook: \nFor the fourth quarter of 2015, the Company expects revenue to be between $71 million and $77 million. Achieving revenue in this range will require that the Company sign new customer agreements for patent and solutions licensing among other matters. \nConference Call: \nThe Company will host a conference call at 2:00 p.m. PT today to discuss its financial results. The call, audio and slides will be available online at investor.rambus.com. A replay will be available following the call as a webcast on the Rambus Investor Relations website and for one week at the following numbers: (855) 859-2056 (domestic) or (404) 537-3406 (international) with ID# 55741229. \n(1) Non-GAAP Financial Information: \nIn the commentary set forth above and in the financial statements included in this earnings release, the Company presents the following non-GAAP financial measures: operating costs and expenses, operating income (loss) and net income (loss). In computing each of these non-GAAP financial measures, the following items were considered as discussed below: stock-based compensation expenses, acquisition-related transaction costs and retention bonus expense, amortization expenses, restructuring charges, non-cash interest expense and certain other one-time adjustments. The non-GAAP financial measures disclosed by the Company should not be considered a substitute for, or superior to, financial measures calculated in accordance with GAAP, and the financial results calculated in accordance with GAAP and reconciliations from these results should be carefully evaluated. Management believes the non-GAAP financial measures are appropriate for both its own assessment of, and to show investors, how the Company’s performance compares to other periods. The non-GAAP financial measures used by the Company may be calculated differently from, and therefore may not be comparable to, similarly titled measures used by other companies. Reconciliation from GAAP to non-GAAP results is included in the financial statements contained in this release. \nThe Company’s non-GAAP financial measures reflect adjustments based on the following items: \nStock-based compensation expense . These expenses primarily relate to employee stock options, employee stock purchase plans, and employee non-vested equity stock and non-vested stock units. The Company excludes stock-based compensation expense from its non-GAAP measures primarily because such expenses are non-cash expenses that the Company does not believe are reflective of ongoing operating results. Additionally, given the fact that other companies may grant different amounts and types of equity awards and may use different option valuation assumptions, excluding stock-based compensation expense permits more accurate comparisons of the Company’s results with peer companies. \nAcquisition-related transaction costs and retention bonus expense . These expenses include all direct costs of certain acquisitions and the current periods’ portion of any retention bonus expense associated with the acquisitions. The Company excludes these expenses in order to provide better comparability between periods. \nRestructuring charges. These charges may consist of severance, contractual retention payments, exit costs and other charges and are excluded because such charges are not directly related to ongoing business results and do not reflect expected future operating expenses. \nAmortization expense . The Company incurs expenses for the amortization of intangible assets acquired in acquisitions. The Company excludes these items because these expenses are not reflective of ongoing operating results in the period incurred. These amounts arise from the Company’s prior acquisitions and have no direct correlation to the operation of the Company’s core business. \nNon-cash interest expense on convertible notes. The Company incurs non-cash interest expense related to its convertible notes. The Company excludes non-cash interest expense related to its convertible notes to provide more accurate comparisons of the Company’s results with other peer companies and to more accurately reflect the Company’s ongoing operations. \nIncome tax adjustments . For purposes of internal forecasting, planning and analyzing future periods that assume net income from operations, the Company estimates a fixed, long-term projected tax rate of approximately 36 percent, which consists of estimated U.S. federal and state tax rates, and excludes tax rates associated with certain items such as withholding tax, tax credits, deferred tax asset valuation allowance and the release of any deferred tax asset valuation allowance. Accordingly, the Company has applied the 36 percent tax rate to its non-GAAP financial results for all periods to assist the Company’s planning for future periods. The Company has provided below a reconciliation of its GAAP provision for income taxes and GAAP effective tax rate to the assumed non-GAAP provision for income taxes and non-GAAP effective tax rate. \nOn occasion in the future, there may be other items, such as impairments and significant gains or losses from contingencies that the Company may exclude in deriving its non-GAAP financial measures if it believes that doing so is consistent with the goal of providing useful information to investors and management. \nForward-Looking Statements \nThis release contains forward-looking statements under the Private Securities Litigation Reform Act of 1995 including relating to Rambus’ restructuring and plan of termination and expectations regarding revenue for the fourth quarter of 2015 and estimated, fixed, long-term projected tax rates. Such forward-looking statements are based on current expectations, estimates and projections, management’s beliefs and certain assumptions made by Rambus’ management. Actual results may differ materially. Rambus’ business generally is subject to a number of risks which are described more fully in Rambus’ periodic reports filed with the Securities and Exchange Commission. Rambus undertakes no obligation to update forward-looking statements to reflect events or circumstances after the date hereof. \nAbout Rambus Inc. \nRambus brings invention to market. Our customizable IP cores, architecture licenses, tools, services, and training improve the competitive advantage of our customers’ products while accelerating their time-to-market. Rambus products and innovations capture, secure and move data. For more information, visit www.rambus.com . \nRMBSFN", "external_links": [], "published": "2015-10-19T23:15:00.000+03:00", "crawled": "2015-10-20T00:02:32.620+03:00", "highlightTitle": ""}