{"organizations": [], "uuid": "6c6e0adb3ae63538c5e15203b166e0319881e900", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/2015/09/23/0/0/092215_dcl_hoverboard8_1280.jpg?ve=1&tl=1", "site_section": "http://www.foxnews.com/tech/", "section_title": "Technology News | Internet, Mobile, and Social Media News | Fox News", "url": "http://www.foxnews.com/tech/2015/10/02/monorover-re-scooter-rolls-into-view.html", "country": "US", "title": "MonoRover R2 scooter rolls into view", "performance_score": 0, "site": "foxnews.com", "participants_count": 2, "title_full": "MonoRover R2 scooter rolls into view | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:00:00.000+03:00", "replies_count": 1, "uuid": "6c6e0adb3ae63538c5e15203b166e0319881e900"}, "author": "Molly Dodd", "url": "http://www.foxnews.com/tech/2015/10/02/monorover-re-scooter-rolls-into-view.html", "ord_in_thread": 0, "title": "MonoRover R2 scooter rolls into view", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Molly Dodd\nPublished September 30, 2015 FoxNews.com Facebook\nAre you ready to rove? A number of companies are selling a new breed of personal transportation devices. Dubbed 'hoverboards' by some, these devices, such as the MonoRover R2, are actually self-balancing scooters.\nDescribed by manufacturer MonoRover as \" a Segway without the bulk \" the R2, like a Segway, uses gyroscopic technology to maneuver, but has no handlebars, and is easier to manage, size-wise than a Segway. The board has sensors under each foot pad that detect micro-movements in your feet and ankles and relay the information to two powerful motors.\nSo, what is it like to ride a MonoRover R2? It looks easy, but, I felt very unbalanced when I first got onto the board. It is an interesting sensation - being somewhat out of control until I got my balance. My first few times, I clung to a wall and went a few feet at a time unassisted.\nRelated: 'Hoverboard' 'craze' hits Fox News\nThe trick, I discovered, is to place your dominant foot onto the device, quickly followed by your other foot. After several attempts on the MonoRover R2, I felt more confident. I could turn, go backwards, and rove without using the wall for support. I quickly realized that if you point your toes downward, you go forwards, and if you put your weight on your heels, you go in reverse. The rover is equipped with two blue LED lights that signal a turn when you shift your weight to one side.\nThe R2 can even hit speeds of about 8mph, according to the manufacturer.\nI found that after riding for a few minutes, and then dismounting, my legs felt like they got a workout. You are balancing on a moving board, and engaging your core and other muscles. I'm not a personal trainer, but I felt like I had been working out.\nThe MonoRover R2 thrives on flat surfaces, although it can also handle slopes such as speed bumps. I rode on carpet, which certainly made for a smooth ride.\nThe retail cost of the Monorover R2 is $599 .\n ", "external_links": ["http://www.monorover.com/monorover-r2-self-balancing-scooter.html", "https://www.facebook.com/FoxNewsSciTech"], "published": "2015-10-02T03:00:00.000+03:00", "crawled": "2015-10-20T03:03:54.281+03:00", "highlightTitle": ""}