{"organizations": ["Reuters", "Google"], "uuid": "014465acee39e702918b3c0ce9d34c56a2fbe789", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ibtimes.co.uk", "main_image": "http://d.ibtimes.co.uk/en/full/1463942/google-cardboard.jpg", "site_section": "http://ibtimes.co.uk//rss/technology", "section_title": "IBTimes.co.uk : Technology", "url": "http://www.ibtimes.co.uk/google-play-store-removes-cardboard-apps-1524297", "country": "US", "title": "Google Play Store removes 'Cardboard' apps", "performance_score": 0, "site": "ibtimes.co.uk", "participants_count": 0, "title_full": "Google Play Store removes 'Cardboard' apps", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T13:42:00.000+03:00", "replies_count": 0, "uuid": "014465acee39e702918b3c0ce9d34c56a2fbe789"}, "author": "", "url": "http://www.ibtimes.co.uk/google-play-store-removes-cardboard-apps-1524297", "ord_in_thread": 0, "title": "Google Play Store removes 'Cardboard' apps", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "October 16, 2015 11:42 BST Google on a move to promote its native Cardboard VR app Reuters \nGoogle Play Store has started removing apps with the term \"Cardboard\" in their names. The new development is being attributed to the company's move to promote the native Cardboard VR app on Android platform. \nAs spotted by Variety , Google started sending emails to developers to inform them that their VR apps have been removed from the Play Store. The email claims that the apps have been removed on the grounds of violating the \"spam provision of the Content Policy\", which is designed to remove apps that post repetitive content or use irrelevant, misleading or excessive keywords in app descriptions, titles or metadata. \nSome of the apps that were affected through the new development include Cardboard VNC, Cardboard Catapult and Cardboard Theater. \"The email mentions not using other brands as the start of the application name, so I'm guessing they don't want me to start the app name with Cardboard, but at the same time 'Cardboard Theater' which is a very well known movie player app is in the Play Store,\" the developer of Cardboard VNC wrote in a Google+ post. \n\"My plan is to rename it to 'VNC Client for Cardboard', but I wanted to check if this community had any input or experience first. I'd rather drop the app than have a 'strike against the good standing' of my developer account.\" \nA Google spokesperson was not immediately available for comment on the development. However, IBTimes UK has verified that all the third-party apps with word \"Cardboard\" had been removed from the Play Store. \nGoogle had unveiled Cardboard as its affordable VR headset at the I/O developer conference last year. Unlike VR headsets like Facebook's Oculus Rift or Samsung Gear VR, the Cardboard is made of an eco-friendly cardboard material and is compatible with most Android and iOS devices . Read more about Google Cardboard:", "external_links": [], "published": "2015-10-16T13:42:00.000+03:00", "crawled": "2015-10-16T14:05:34.380+03:00", "highlightTitle": ""}