{"organizations": ["Global Change Institute"], "uuid": "ef06523534a36499962bd4acca700215b1fc94b1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.terradaily.com", "main_image": "http://www.spxdaily.com/images-bg/mangrove-forest-high-tide-bg.jpg", "site_section": "http://www.terradaily.com/terradaily.xml", "section_title": "Earth News, Earth Science, Energy Technology, Environment News", "url": "http://www.terradaily.com/reports/Rising_seas_will_drown_mangrove_forests_999.html", "country": "US", "title": "Rising seas will drown mangrove forests", "performance_score": 0, "site": "terradaily.com", "participants_count": 0, "title_full": "Rising seas will drown mangrove forests", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T07:34:00.000+03:00", "replies_count": 0, "uuid": "ef06523534a36499962bd4acca700215b1fc94b1"}, "author": "", "url": "http://www.terradaily.com/reports/Rising_seas_will_drown_mangrove_forests_999.html", "ord_in_thread": 0, "title": "Rising seas will drown mangrove forests", "locations": ["Australia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Rising seas will drown mangrove forests by Staff Writers Brisbane, Australia (SPX) Oct 15, 2015 Mangrove forest at high tide. Image courtesy Global Change Institute. For a larger version of this image please go here . \nMangrove forests around the Indo-Pacific region could be submerged by 2070, international research published this week says. Even with relatively low sea-level rises, many mangrove forests had a poor outlook said Professor Catherine Lovelock, a University of Queensland ecologist. \n\"Mangrove forests are particularly vulnerable,\" she said. \"Mangroves are predicted to be submerged in parts of Thailand, Sumatra, Java, Papua New Guinea and the Solomon Islands.\" \nHowever the outlook in other parts of the world was more positive. \"Our modelling shows mangroves are likely to persist in east Africa, the Bay of Bengal, eastern Borneo and north-western Australia - areas where there are relatively large tidal ranges and/or higher sediment supply,\" said Professor Lovelock, who works in UQ's School of Biological Sciences and the Global Change Institute. \n\"Even in other areas though, the good news is that through accretion of sediment and maintenance of wetland soils, mangrove forests do have the capacity to avoid inundation and keep pace with sea-level rise.\" \nProfessor Lovelock said this was why there was an urgent need to plan for the maintenance of sediment supply in river systems that were likely to be dammed or heavily modified in future. \"The Indo-Pacific region holds most of the world's mangrove forests, but sediment delivery in this region is declining, due to activities such as dam construction,\" she said. \n\"This is of particular concern as this region is expected to have variable but high rates of future sea-level rise.\" \nForest degradation had to be reversed because it reduced organic inputs to soils that was vital for mangrove survival, Professor Lovelock said. Plans should be made for the landward migration of vulnerable mangrove forests to higher elevations. \n\"Intertidal mangrove forests occur on tropical and subtropical shorelines, and provide a wide range of ecosystem services - to fisheries, in coastal protection and in carbon sequestration - with an estimated value of $USD194,000 per hectare per year,\" she said. \"Sea-level rise could threaten the long-term sustainability of coastal communities and of valuable ecosystems such as coral reefs, salt marshes and mangroves. \nProfessor Lovelock said the researchers analysed trends based on data from an international network of 27 sites. \nThe vulnerability of Indo-Pacific mangrove forests to sea-level rise is published in Nature. Co-authors are from the US Geological Survey; National University of Singapore; Cambridge University; University of Wollongong; Ministry of Marine Affairs and Fisheries, Indonesia; National Institute of Water and Atmospheric Research, New Zealand; Macquarie University; Vietnam National University; and the International Crane Foundation, US. .", "external_links": [], "published": "2015-10-16T07:34:00.000+03:00", "crawled": "2015-10-16T10:22:18.936+03:00", "highlightTitle": ""}