{"organizations": [], "uuid": "ccc52fa6887e82e60e24dc071fb95139819c9e3f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "abcnews.go.com", "main_image": "", "site_section": "http://abcnews.go.com/xmldata/rss?id=79", "section_title": "ABC News: Technology", "url": "http://abcnews.go.com/Technology/wireStory/teslas-autopilot-lets-cars-change-lanes-34481032", "country": "US", "title": "Tesla's Autopilot Lets Cars Drive, Change Lanes Themselves", "performance_score": 0, "site": "go.com", "participants_count": 1, "title_full": "Tesla's Autopilot Lets Cars Drive, Change Lanes Themselves - ABC News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "ccc52fa6887e82e60e24dc071fb95139819c9e3f"}, "author": "abcNEWS", "url": "http://abcnews.go.com/Technology/wireStory/teslas-autopilot-lets-cars-change-lanes-34481032", "ord_in_thread": 0, "title": "Tesla's Autopilot Lets Cars Drive, Change Lanes Themselves", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Electric car maker Tesla Motors is leapfrogging competitors with a new autopilot system that lets cars change lanes by themselves.\nLike other semi-autonomous systems already available from Mercedes, Audi and Volvo, Tesla's system automatically keeps the car within its lane and maintains a certain distance from the car in front, both at highway speeds and on city streets. It can find a parking spot and parallel park itself. It also uses cameras and sensors to warn drivers about potential side impacts.\nBut analysts say the lane-changing feature is an industry first. Tesla CEO Elon Musk said the system is also unique because it will constantly collect data from actual drivers and improve itself. The system will note, for example, how quickly drivers can safely navigate a particular bend in the road or where stop signs are located.\n\"I think this is going to be quite a profound experience for people,\" Musk said Wednesday in a conference call with media. \"It will change people's perception of the future quite drastically.\"\nMusk also added a word of caution: Drivers need to keep their hands on the wheel, and the autopilot system will chime to remind them if they don't. Drivers — not Tesla — will be held liable if there's a crash, Musk said.\n\"We're being especially cautious at this early stage, so we're advising drivers to keep their hands on the wheel just in case,\" he said. \"The software is very new.\"\nMusk said fully autonomous, hands-free driving is still at least three years away from a technical standpoint, although it will probably take regulators longer than that to allow it.\nThe autopilot update will be added to around 60,000 vehicles worldwide, including Model S sedans made after September 2014 and Model X SUVs. Owners will get the system through a software update starting Wednesday evening in North America. Owners in Europe and Asia will get the software update in about a week. People with Model S sedans that were made earlier don't have the required sensors and won't be able to add them retroactively, Musk said.\nOnly owners who paid the $2,500 charge for the full autopilot system will be able to activate all of the autopilot features, but Musk said the side-impact warning is a safety feature and will be available to everyone. For the next update, Musk said, Tesla is working on having the car drive itself in and out of garages when it's summoned by the owner.\nKarl Brauer, a senior analyst with Kelley Blue Book, said Tesla's system appears to up the ante for the industry. General Motors ' Super Cruise system, for example, which is due out on the 2017 Cadillac CT6, will let drivers take their hands off the wheel at any speed on the highway, but it won't change lanes by itself.\n\"This is the game we're going to be playing, round and round, for the next five to ten years until there's fully autonomous driving,\" Brauer said. \"Each time there's a step by someone out there, everyone will have to match it.\"\nBrauer said there's a danger to that, because people may not know what the car they're driving is capable of.\n\"Having that kind of nebulous, blurry gray zone could introduce many more problems,\" he said.\nBut Musk is optimistic about the benefits of autopilot.\n\"In the long term, it will be safer than a person driving,\" he said.\n0 Shares Email Star Comments Tesla's Autopilot Lets Cars Drive, Change Lanes Themselves   \n  \n  \n$2   \nRestaurant   Prominent Astronomer Resigns Over Student Sexual Harassment Police:  ", "external_links": [], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-15T01:29:56.235+03:00", "highlightTitle": ""}