{"organizations": [], "uuid": "d95d21193833af07271547eabf651842a90b4f47", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "", "site_section": "http://www.financialexpress.com/section/lifestyle/science/", "section_title": "Science News:Latest Science News,Science News Today,Science and Technology News | The Financial Express", "url": "http://www.financialexpress.com/article/lifestyle/science/leukemia-created-in-a-dish/148612", "country": "IE", "title": "‘Leukemia’ created in a dish", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "‘Leukemia’ created in a dish | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T23:45:00.000+03:00", "replies_count": 0, "uuid": "d95d21193833af07271547eabf651842a90b4f47"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/lifestyle/science/leukemia-created-in-a-dish/148612", "ord_in_thread": 0, "title": "‘Leukemia’ created in a dish", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles James Blunt to be first-time father? Charlie Sheen thrown out of bar Stella McCartney sues Steve Madden for copyright A team of researchers have created ‘leukemia in a dish’ to better study it. Mount Sinai scientists engineered stem cells to better understand the mechanisms behind a form of leukemia caused by changes in a key gene.\nPast work had established that inherited changes in the DNA code for the gene PTPN11 cause Noonan syndrome, a genetic disease that comes with a high risk for the blood cancer called juvenile myelomonocytic leukemia (JMML). The mechanisms behind the disease, and what influences its severity, were unknown going into the current study.\nIn addition, the only current treatment for JMML, a bone marrow transplant to replace the hematopoietic stem cells that become blood cells, is effective in only 50 percent of patients. This has further spurred efforts to understand related disease mechanisms as a step toward designing better treatments.\nBy studying an inherited human cancer syndrome, our study clarified early events in the development of one kind of leukemia, said corresponding author Bruce D. Gelb.\nGelb added that more than just creating a model of a disease, they were able to prove that mechanisms seen in the model also happen in the bone marrow of people with this kind of leukemia. The work also provided new targets for the field to develop new drugs against in JMML.\nTo better understand diseases with a genetic component, a popular approach is to take skin cells from patients with a disease and use enzymes to coax the cells back along the differentiation pathway to become induced pluripotent stem cells or iPSCs. Such cells can then be programmed to mature into cells, including hematopoietic (blood) cells, which re-create a specific version of each person’s genetic disease in a petri dish for study.\nThe study is published online in the journal Cell Reports.\n 09, 2015 3:45 pm", "external_links": [], "published": "2015-10-09T23:45:00.000+03:00", "crawled": "2015-10-14T10:26:19.765+03:00", "highlightTitle": ""}