{"organizations": [], "uuid": "e49fc5fb70de7e7b8eccf74f0715b4493886ddac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mdtmag.com", "main_image": "", "site_section": "http://www.mdtmag.com", "section_title": "Medical Design Technology | The Medical Design Engineer’s Resource for Products &amp; Technologies", "url": "http://www.mdtmag.com/news/2015/10/optoelectronic-implantable-could-enable-two-way-communication-brain", "country": "US", "title": "Optoelectronic Implantable Could Enable Two-Way Communication with Brain", "performance_score": 0, "site": "mdtmag.com", "participants_count": 1, "title_full": "Optoelectronic Implantable Could Enable Two-Way Communication with Brain", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "e49fc5fb70de7e7b8eccf74f0715b4493886ddac"}, "author": "Brown University", "url": "http://www.mdtmag.com/news/2015/10/optoelectronic-implantable-could-enable-two-way-communication-brain", "ord_in_thread": 0, "title": "Optoelectronic Implantable Could Enable Two-Way Communication with Brain", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Brown University researchers have created a new type of optoelectronic implantable device to access brain microcircuits, synergizing a technique that enables scientists to control the activity of brains cells using pulses of light. The invention, described in the journal Nature Methods, is a cortical microprobe that can stimulate multiple neuronal targets optically by specific patterns on micrometer scale while simultaneously recording the effects of that stimulation in the underlying neural microcircuits of interest with millisecond precision.\n\"We think this is a window-opener,\" said Joonhee Lee, a senior research associate in Professor Arto Nurmikko's lab in the School of Engineering at Brown and one of the lead authors of the new paper. \"The ability to rapidly perturb neural circuits according specific spatial patterns and at the same time reconstruct how the circuits involved are perturbed, is in our view a substantial advance.\"\nFirst introduced around 2005, optogenetics has enriched ability of scientists seeking to understand brain function at the neuronal level. The technique involves genetically engineering neurons to express light-sensitive proteins on their membranes. With those proteins expressed, pulses of light can be used to either promote or suppress activity in those particular cells. The method gives researchers in principle unprecedented ability to control specific brain cells at specific times.\nBut until now, simultaneous optogenetic stimulation and recording of brain activity rapidly across multiple points within a brain microcircuit of interest has proven difficult. Doing it requires a device that can both generate a spatial pattern of light pulses and detect the dynamical patterns of electrical reverberations generated by excited cellular activity. Previous attempts to do this involved devices that cobbled together separate components for light emission and electrical sensing. Such probes were physically bulky, not ideal for insertion into a brain. And because the emitters and the sensors were necessarily a hundreds of micrometers apart, a sizable distance, the link between stimulation and recorded signal was ambiguous.\nThe new compact, integrated device developed by Nurmikko's lab begins with the unique advantages endowed by a so-called wide bandgap semiconductor called zinc oxide. It is optically transparent yet able readily to conduct an electrical current.\n\"Very few materials have that pair of physical properties,\" Lee said. \"The combination makes it possible to both stimulate and detect with the same material.\"\nJoonhee Lee, with Assistant Research Professor Ilker Ozden and Professor Yoon-Kyu Song at Seoul National University in Korea, co-developed a novel microfabrication method with Nurmikko to shape the material into a monolithic chip just a few millimeters square with sixteen micrometer sized pin-like \"optoelectrodes,\" each capable of both delivering light pulses and sensing electrical current. The array of optoelectrodes enables the device to couple to neural microcircuits composed of many neurons rather than single neurons.\nSuch ability to stimulate and record at the network level on spatial and time scales at which they operate is key, Nurmikko says. Brain functions are driven by neural circuits rather than single neurons.\n\"For example, when I move my hand, that's an example of action driven by specific network-level activity in the brain,\" he said. \"Our new device approach gives scientists and engineers a tool in applying the full power of optogenetics as a means of neural stimulation, while providing the means to read activity of perturbed networks at multiple points at high spatial precision and time resolution.\"\nOzden led the initial testing of the device in rodent models. The researchers looked at the extent to which different light intensities could stimulate network activity. The tests showed that increasing optical power led to distinct recruitment of neuronal circuits revealing functional connectivity in the targeted network.\n\"We went over a range of optical power that was large--over three orders of magnitude--and in so doing we got a range of network-related responses, in particular we could replicate an activity pattern naturally occurring in the brain.\" Ozden said. \"It gave us a new insight into how optogenetics operates on the network level. This gives us encouragement to go ahead and extend the repertoire and application of the device technology.\"\nNurmikko's group together with the Song lab in Seoul plan to continue further development of the device, ultimately include an access via wireless means. Their next steps anticipate the use of the new device technology as chronic implant in non-human primates at potentially hundreds of points and, depending on progress in worldwide research on optogenetics ahead, perhaps even one day in humans.\n\"At least, the initial building blocks are here,\" Nurmikko said, who conceived the idea with his Korean colleague Song.", "external_links": [], "published": "2015-10-12T03:00:00.000+03:00", "crawled": "2015-10-13T05:41:31.797+03:00", "highlightTitle": ""}