{"organizations": [], "uuid": "9c68b8089149d1799be4f6f20dd6d6177ec03d50", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.govtech.com", "main_image": "", "site_section": "http://www.govtech.com/rss/app_rss", "section_title": "Government Technology", "url": "http://www.govtech.com/dc/State-and-Local-IoT-Activity-Heats-Up.html", "country": "US", "title": "State and Local IoT Activity Heats Up", "performance_score": 0, "site": "govtech.com", "participants_count": 1, "title_full": "State and Local IoT Activity Heats Up", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T12:00:00.000+03:00", "replies_count": 0, "uuid": "9c68b8089149d1799be4f6f20dd6d6177ec03d50"}, "author": "Noelle Knell", "url": "http://www.govtech.com/dc/State-and-Local-IoT-Activity-Heats-Up.html", "ord_in_thread": 0, "title": "State and Local IoT Activity Heats Up", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Digital Counties State and Local IoT Activity Heats Up NASCIO poll and local efforts in Salt Lake City and Lexington, Ky., point to uptick in IoT planning. by Steve Towns / October 19, 2015 Lexington, Ky., CIO Aldona Valicenti notes that broadband infrastructure is key to the effective use of smart city technology. Noelle Knell \nOne takeaway from last week’s NASCIO conference is that state and local CIOs are beginning to think more about the Internet of Things as a tool for improving government performance. \nA formal survey released during the conference and informal polling conducted during the event showed similar results: A majority of CIOs are investigating how the emerging IoT will impact government operations, although most of that activity is in the preliminary stages. \nThe formal state CIO survey -- conducted by NASCIO, Grant Thornton and CompTIA – found that 53 percent of respondents are “investigating IoT in state government with informal discussions.” Eighteen percent said those discussions were occurring in a more formal way. The survey collected responses for 47 states, primarily from state CIOs. \nA quick poll of CIOs in the audience at the conference in Salt Lake City found that 52 percent are in the planning stage for IoT-powered smart government initiatives, while 27 percent said they’re already working on these types of projects. \nCIOs may not have the IoT fully figured out yet, but there’s growing interest in adopting the concept in innovative ways. \n“We want to leapfrog into smart state technology,” said Illinois CIO Hardik Bhatt, during a NASCIO panel discussion on smart cities and states. “In Illinois we have smart state projects that are spread out among agencies. We need to bring that all under one umbrella.” RELATED", "external_links": [], "published": "2015-10-19T12:00:00.000+03:00", "crawled": "2015-10-20T05:25:38.282+03:00", "highlightTitle": ""}