{"organizations": [], "uuid": "6b001eca541a88a55d6b4499e77735ede500ca08", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wcax.com", "main_image": "http://images.worldnow.com/AP/images/9049036_G.jpg", "site_section": "http://www.wcax.com/category/13536/technology-news", "section_title": "Technology &amp; Science News - WCAX.COM Local Vermont News, Weather and Sports-", "url": "http://www.wcax.com/story/30295455/eyeing-general-election-bush-team-builds-data-operation", "country": "US", "title": "Eyeing general election, Bush team builds data operation", "performance_score": 0, "site": "wcax.com", "participants_count": 1, "title_full": "Eyeing general election, Bush team builds data operation - WCAX.COM Local Vermont News, Weather and Sports-", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "6b001eca541a88a55d6b4499e77735ede500ca08"}, "author": "wcax.com", "url": "http://www.wcax.com/story/30295455/eyeing-general-election-bush-team-builds-data-operation", "ord_in_thread": 0, "title": "Eyeing general election, Bush team builds data operation", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By THOMAS BEAUMONT and JULIE PACE\nAssociated Press WASHINGTON (AP) - Months before the first primaries of the presidential campaign, Jeb Bush and his allies are deep into building a data-driven operation to turn out voters in the general election much later - spending heavily on the assumption he will overcome his sluggish start and win the Republican nomination.\nIt's a strategy aimed at avoiding a 2016 repeat of the GOP's deficiencies in using technology to get their supporters to vote four years ago, and evidence of both Bush's confidence and that of his financial backers.\nYet it's already hit an early roadblock.\nBush and his advisers have abandoned plans to link some of the technology efforts of his formal campaign and an allied super political action committee by contracting with a single company. That firm could have provided both groups with the same data on the electorate from which to work - everything from names and addresses of voters to their hobbies and number of children.\nTaken together, the plans and the backtracking illustrate both the ambitions and limitations of Bush's 2016 experiment to expand the role of his super PAC beyond just paying for television advertising and into work traditionally performed by campaigns.\nThe former Florida governor is trying to take full advantage of the dramatic changes in how campaigns are paid for in America, ushered in by the 2010 Supreme Court ruling known as Citizens United. While formal campaigns can raise no more than $2,700 from each individual donor per election, the law places no such contribution limits on what are known as super PACs.\nBut the law does prohibit super PACs from coordinating their activities with candidates' campaigns - they must be separate and distinct operations. The law does not prohibit a campaign and super PAC from contracting with the same vendor, but Bush aides decided the common-vendor concept would push the envelope too far.\nIn the first presidential campaign of the super PAC era, the group backing GOP nominee Mitt Romney in 2012 essentially did nothing with its money but run television ads.\nBut last April, The Associated Press first reported that Bush planned to build his super PAC, known as Right to Rise USA, into an operation that would do much more. Its data-targeting operation is the first clear sign that the group is carrying out functions traditionally performed by campaigns alone.\nBush's team and his supporters continue to point to his heavily funded super PAC as a difference-maker in the primaries, as his fundraising for his own campaign slows and he struggles to regain his early spot atop a crowded Republican field led by the unorthodox Donald Trump.\nThe data operations Bush and his allies are building will have value as GOP voters select their nominee. But their worth will grow significantly in the general election, when the number of voters Bush would need to motivate to cast ballots grows from tens of thousands to tens of millions.\nBefore he formally declared his candidacy in June, his would-be campaign officials and those at Right to Rise had decided to use the same digital data provider, according to Bush aides and others familiar with the operations. Declaring his candidacy marked the point at which Bush could no longer legally coordinate his activities with the super PAC.\nBy sharing the vendor, Right to Rise would have had a good idea who the campaign was trying to reach - and could complement that effort or expand on it.\nBut several Bush aides said they later grew concerned about the common-vendor concept, leading Bush and his allies to abandon it shortly after he got into the race. The aides and others familiar with the planning said campaign officials feared the setup would make it too easy for the two entities to trade information back and forth, and would have required a complicated firewall to keep the information separate.\nThe Bush aides and those familiar with the decisions spoke only on condition of anonymity, because they were not authorized to publicly discuss the campaign's strategy.\nRight to Rise USA spokesman Paul Lindsay told AP that one of the group's priorities is \"to locate, persuade and mobilize both primary and general election voters using traditional and innovative techniques,\" including a digital voter tracking system.\nSimilarly, Bush campaign spokesman Tim Miller said the campaign was setting the \"gold standard\" for Republicans in terms of investing in data and the targeting of voters.\nBarack Obama demonstrated the value of such a data-driven effort to get out the vote. His presidential campaign used its system to target online advertisements to specific voters and keep track of those voters through Election Day. After Obama's re-election, the Republican National Committee identified technological shortcomings as an area where the party needed to catch up with Democrats.\nA GOP post-mortem concluded, \"If the party wants to win, it must have better data, better access to data and better tools to make the most of that data.\"\nThe Bush campaign has already used its data system to run thousands of tests simulating the primary elections in the first four states to vote and is building detailed profiles of voters, campaign manager Danny Diaz said in a memo sent last week. The campaign's database includes about 3,000 data points on each of about 260 million individuals.\nThe vendor the Bush team selected to serve both the campaign and super PAC was Digital Core Campaign, run by a former Facebook engineer and Republican National Committee official, Andy Barkett.\nThe Bush campaign has spent just shy of $140,000 with the firm for \"web services.\" That includes payments in June, July and then $42,728 on Aug. 10, according to a report on the third quarter filed last week with the Federal Election Commission.\nThe super PAC, which is on a different disclosure schedule, paid the company about $426,000 for \"database management\" before July 1. Its next report will cover spending during the second half of 2015.\nWhile the Bush aides cited concerns about illegal coordination as the reason to abandon the shared-vendor concept, two people familiar with the separation also cited creative differences between campaign officials and Barkett. He is still working with Right to Rise.\nThey spoke on anonymity, because they were not authorized to discuss the developments publicly by name.\nIn an interview with AP, Barkett said he was contractually barred from discussing details of his work for the super PAC, but he pointed to his company's website for outlines of its offerings. It says the California-based company aims to \"drive election results with big data and integrated software systems\" and specializes in building voter database infrastructure, updating data in real time and improving ad targeting.\n\"You have to be really efficient in communicating with people and, to be efficient, you have to use all of your tools,\" Barkett said of his work for Right to Rise.\nThe Bush teams' focus on creating a data system designed to win the general election reflects their confidence after jointly raising more than $127 million through the end of September. That figure includes the $103 million brought in by the super PAC in the first six months of the year.\nAlong with the money spent with Barkett's firm before the split, Bush's campaign has also paid nearly $150,000 to Deep Root Analytics, a Washington-based data firm whose co-founder, Alex Lundry, is working for the campaign, as well as $62,000 to the research and data company Y2 Analytics and $40,000 in data-related software expenses.\nHillary Rodham Clinton has hired many of Obama's former data engineers, and her team is also deep in preparations for targeting voters in the general election. But she is the Democratic front-runner, while Bush is competing in a GOP race dominated in recent months by political novices favored by voters disenchanted with anyone with a history in office.\nBush aides are hoping that a television advertising campaign begun last month in Iowa, New Hampshire and South Carolina will show clear signs of movement in the early voting states by the end of this month.\nBut even with few guarantees about the campaign's future, they are mindful of the missteps by Romney, whose campaign was far behind the Obama team in building its voter outreach technology by the time he secured the nomination.\nWhile Romney's affiliated super PAC group was the best-funded of all the GOP candidates' in the campaign four years ago, it was focused only on the primary campaign at this point in the race.\nHis campaign advisers weighed having that super PAC do more than advertise, but it was an idea they considered too late to avoid violating the coordination restrictions.\nFor this election, Bush advisers vowed their super PAC would do more. At a retreat in South Florida for Right to Rise in April, donors were told their money would be used to create sophisticated data and voter targeting operations.\nBill Kunkler, a Chicago-area private equity company executive and Bush donor, was among those impressed with the plan to essentially share data between the campaign and super PAC.\nTold by the AP that the campaign had abandoned that plan, Kunkler said it did nothing to change his support for Bush.\n\"I think they were aggressive in what they did, but I can see if they were getting into a gray area that they would back off,\" Kunkler said.\n___\nBeaumont reported from Des Moines, Iowa.\n___\nFollow Thomas Beaumont at http://twitter.com/TomBeaumont and Julie Pace at http://twitter.com/jpaceDC\n ", "external_links": ["http://twitter.com/TomBeaumont", "http://twitter.com/jpaceDC"], "published": "2015-10-19T03:00:00.000+03:00", "crawled": "2015-10-22T05:17:18.426+03:00", "highlightTitle": ""}