{"organizations": ["Arizona State University If", "Biodesign Institute", "Nanowerk News", "Biodesign Center for Bioelectronics", "Arizona State University", "Daltons"], "uuid": "41f9927822219135ea327851b41f5ea92e52291b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nanowerk.com", "main_image": "http://www.nanowerk.com/images/NWlogo.gif", "site_section": "http://www.nanowerk.com/nwfeedcomplete.xml", "section_title": "Nanowerk Nanotechnology and Emerging Technologies News", "url": "http://www.nanowerk.com/nanotechnology-news/newsid=41671.php", "country": "US", "title": "Sensing small molecules may revolutionize drug design", "performance_score": 0, "site": "nanowerk.com", "participants_count": 0, "title_full": "Sensing small molecules may revolutionize drug design", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T21:08:00.000+03:00", "replies_count": 0, "uuid": "41f9927822219135ea327851b41f5ea92e52291b"}, "author": "", "url": "http://www.nanowerk.com/nanotechnology-news/newsid=41671.php", "ord_in_thread": 0, "title": "Sensing small molecules may revolutionize drug design", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Tao", "Dalton", "Kon", "Koff"], "text": "The latest news from academia, regulators research labs and other things of interest Posted: Oct 23, 2015 Sensing small molecules may revolutionize drug design ( Nanowerk News ) Most pharmaceutical drugs consist of tiny molecules, which target a class of proteins found on the surfaces of cell membranes. Studying these subtle interactions is essential for the design of effective drugs, but the task is extremely challenging. Now, Nongjian (NJ) Tao and his colleagues at Arizona State University's Biodesign Institute describe a new method for examining small molecules and their communication with membrane proteins. The research will allow scientists and clinicians to study these interactions at an astonishingly minute scale with unprecedented precision. Hunting small molecules: The graphic shows the experimental setup used to detect small molecules, like those used for most pharmaceutical drugs (green) and their binding interactions with membrane protein receptors (yellow). These events can be imaged using conventional or phase contrast microscopy through the process of differential optical detection. Subtle distortions in the cell membrane shape caused by the binding or dissociation of small molecules are translated into observable changes in light intensity. (Image: The Biodesign Institute at Arizona State University) The new work has broad implications for basic research into biological function at the cellular level as well as providing an efficient platform for new drug design, which can be carried out more rapidly and precisely, at lower cost. The method permits the first direct, real-time measurement of the binding kinetics of small molecules with membrane proteins on intact cells, without the use of molecular labeling. The study appears in the current issue of the journal Science Advances ( \"Kinetics of small molecule interactions with membrane proteins in single cells measured with mechanical amplification\" ). Targeted approach \"Most drugs are small molecules and most drug targets are membrane proteins,\" says Tao, who directs the Biodesign Center for Bioelectronics and Biosensors, which focuses on developing new detection technologies. \"Determining the binding between small molecules and membrane proteins is very important from a pharmaceutical point of view but also for the understanding of basic cellular processes.\" Accurate drug design requires an understanding not only of the small molecule drugs and the membrane proteins they bind to, but information about how the process develops over time -- the so-called binding kinetics of the system. The rates at which drugs bind with and dissociate from receptors have a direct impact on drug efficacy and safety. The optimization of binding kinetics allows drug designers to precisely control two critical parameters known as Kon and Koff. These represent the small molecule-protein binding event and the dissociation of the small molecule. Traditionally, such study has required proteins to be removed from their native environment on cell membranes. Once extracted from the cell, the membrane proteins are immobilized on a surface and their interactions with small molecules examined. Unfortunately the behavior of membrane proteins may be altered following extraction from the cellular environment. Small molecules used for most drugs are on the order of a few hundred Daltons in size, compared with biological molecules, which are often thousands of Daltons. (A Dalton is roughly equal to the mass of a single nucleon -- either a proton or neutron.) The minute size of small molecules makes accurate study of binding kinetics tricky. This fact has made the process of drug screening an arduous and costly affair. The path from drug discovery to eventual commercialization often requires 10-12 years of research and close to $1 billion for development of a single new drug. In addition to examining binding kinetics for membrane proteins immobilized on a surface, animal testing is often used to attempt to validate new drugs, though the costs are high, the methods are inefficient and ethical concerns come into play. Further, even successful results are not always applicable for human patients. A new look Increasingly, the field of drug discovery is moving toward cell-based, high-throughput screening methods, where interactions of small molecules and membrane proteins are examined in their native environment. With current technologies however, the sensitivity with which small molecules can be detected scales with the size. The smaller the sample molecule gets, the harder it is to detect. One popular means of detection involves florescent labeling of sample molecules. Here a dye particle is affixed to the molecule to be studied, but the labeling molecule can profoundly alter the properties of small molecules under scrutiny. The new technique provides a platform for cell-based assays using standard microscopy methods, without the use of florescent labeling. It offers the first opportunity to examine binding kinetics in real time with extremely high resolution. The method relies on the fact that binding and dissociation events change the shape of the cell membrane, deforming it. The imaging process is known as differential optical detection. As the small molecule impinges on the surface membrane protein, it changes the membrane's surface tension. \"That change is very tiny -- as small as a few nanometers or less,\" Tao says. \"We have a way to track that change with great precision -- down to a fraction of a nanometer.\" Further, the technique is compatible with simple optical microscopy, though techniques including phrase contrast imaging or surface plasmon resonance (SPR) may be used to enhance image contrast. On the edge To accomplish the delicate detection, two regions along the cell membrane's edge are selected. When the small molecule binds with the protein, the membrane deforms as a result. This mechanical deformation is detected optically as a change in light intensity. This indirect detection allows extremely small cell membrane variations to be imaged over time. Tao likens the process to techniques used to discover exoplanets -- new planets beyond our solar system. While such objects are far too faint and remote to detect directly, evidence of their presence can be inferred from fluctuations in starlight due to gravitational effects caused by the unseen exoplanets. In the current study, phase contrast imaging was used to detect both large and small molecule interactions with membrane proteins in real time in intact cells. While the central focus was on the detection of small molecules, large molecule interactions helped validate the results, as the observed binding kinetics could be compared with experimental data derived by conventional means of detection. For small molecule detection, Tao's team used membrane proteins that detect acetylcholine -- a model system that has been widely studied. The new method brings the investigation of membrane protein-small molecule interactions an important step closer to the behavior actually occurring in living systems. The platform is compatible with cell-based assays and holds the promise of faster, cheaper and more precise drug design while yielding new insights into foundational issues in cellular biology. \"We're very excited by this technology and are working to further develop it,\" Tao says, emphasizing the role for the new technique in both academic research settings and pharmaceutical laboratories. Source: Arizona State University If you liked this article, please give it a quick review on reddit or StumbleUpon . Thanks! Check out these other trending stories on Nanowerk: Subscribe to a free copy of one of our daily with a compilation of all of the day's news.", "external_links": [], "published": "2015-10-23T21:08:00.000+03:00", "crawled": "2015-10-24T00:15:11.400+03:00", "highlightTitle": ""}