{"organizations": [], "uuid": "25e64bfb2af7920be76cb45dabd880de55ea3fc9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/10/06/13006573/Citrix_ready_black.gif", "site_section": "http://www.prweb.com/rss2/techentsoftware.xml", "section_title": "Technology: Enterprise Software", "url": "http://www.prweb.com/releases/2015/10/prweb13006573.htm", "country": "US", "title": "WorksPad Is Verified as Citrix Ready", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "WorksPad Is Verified as Citrix Ready", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "25e64bfb2af7920be76cb45dabd880de55ea3fc9"}, "author": "Yana Frolova", "url": "http://www.prweb.com/releases/2015/10/prweb13006573.htm", "ord_in_thread": 0, "title": "WorksPad Is Verified as Citrix Ready", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MobilityLab LLC today announced that the integrated enterprise mobile workplace WorksPad has been verified as Citrix Ready®. The Citrix Ready program helps customers identify third-party solutions that are recommended to enhance mobility, virtualization, networking and cloud computing solutions from Citrix. WorksPad completed a rigorous verification process to ensure compatibility with Citrix XenMobile®, providing confidence in joint solution compatibility. WorksPad for Citrix provides secure access to corporate emails and corporate information assets with on-premise deployment and smooth integration into an existing enterprise IT and information security landscape. WorksPad for Citrix ensures a rich toolset for essential daily work on mobile devices, giving users familiar PC capabilities and providing rich functionality and security of using favorite devices in anyplace at any time.\nThe Citrix Ready program makes it easy for customers to identify complementary products and solutions that can enhance Citrix environments. Customers can be confident that WorksPad has successfully passed a series of tests established by Citrix, and can be trusted to work effectively with XenMobile® in order to boost employees’ mobile productivity, with regard the highest corporate security standards.\n“We welcome WorksPad to the Citrix Ready program,” said Siddharth Rabindran, senior manager, Citrix Ready at Citrix. “Citrix Ready makes it easier for customers to select the most suitable enterprise mobility products for their specific needs. By taking part in our program, MobilityLab has enabled enterprise customers to obtain the modern integrated productivity and collaboration tool with a set of features that before were only available on PCs and notebooks.”\n“We are excited that WorksPad becomes a part of the leading enterprise mobility ecosystem,” said Sergey Orlik, Managing Director of MobilityLab. “Powered by rich security capabilities of Citrix XenMobile® WorksPad helps its customers to enable their mobile workforce to be more efficient and provide better customer experience than ever before.”\nFor more details on WorksPad for Citrix, please visit the Citrix® Ready Marketplace at: https://citrixready.citrix.com/mobilitylab-llc/workspad-for-citrix-ios.html\nAbout the Citrix Ready Program\nThe Citrix Ready program identifies verified solutions that are trusted to enhance virtualization, networking and cloud computing solutions from Citrix, including XenDesktop®, XenApp®, XenServer®, and NetScaler®. The Citrix Ready designation is awarded to third-party products that have successfully met verification criteria set by Citrix, and gives customers an added confidence in the compatibility of the joint solution offering. The Citrix Ready program leverages industry-leading alliances across the Citrix partner eco-system to meet a wide variety of customer needs, and currently incorporates partners who have demonstrated more than 22,000 product verifications. It also includes the Citrix Ready Community Verified program, which allows customers to see thousands of products that have been verified by other customers to work in their production environments. More information about the Citrix Ready program can be found at http://www.citrix.com/ready . Reach Citrix Ready using social media via the Citrix Ready blog site and Twitter. Citrix®, Citrix Ready® and XenServer® are registered trademarks of Citrix Systems, Inc. and/or one or more of its subsidiaries, and may be registered in the U.S. Patent and Trademark Office and in other countries. All other trademarks and registered trademarks are property of their respective owners.\nAbout MobilityLab\nMobilityLab LLC is part of I.T. Group, which was established in 2011 as a research, development and commercialization center of technologies in the Enterprise Mobile Workplace segment on the basis of mobile devices. In 2012, MobilityLab obtained the status of a resident in the Skolkovo innovative project and was integrated in its IT cluster. In November 2014, the MobileSputnik solution won the CNews award as the best solution of the year in enterprise mobility. In February 2015, the MobileSputnik application (mobile satellite) has been renamed and is now distributed worldwide under the trademark WorksPad.\nGet more information at: http://www.workspad.com/", "external_links": ["http://www.workspad.com/", "http://www.citrix.com/ready", "https://citrixready.citrix.com/mobilitylab-llc/workspad-for-citrix-ios.html", "http://www.prweb.net/Redirect.aspx?id=aHR0cHM6Ly9jaXRyaXhyZWFkeS5jaXRyaXguY29tL21vYmlsaXR5bGFiLWxsYy93b3Jrc3BhZC1mb3ItY2l0cml4LWlvcy5odG1s", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy53b3Jrc3BhZC5jb20v", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5jaXRyaXguY29tL3JlYWR5"], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-08T19:02:12.191+03:00", "highlightTitle": ""}