{"organizations": [], "uuid": "a2cae9264502fdab2961855284c7b5c4c6d8477b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/04/21/13004536/paragon copy.jpg", "site_section": "http://www.prweb.com/rss2/techentsoftware.xml", "section_title": "Technology: Enterprise Software", "url": "http://www.prweb.com/releases/2015/10/prweb13004536.htm", "country": "US", "title": "Paragon Software Group Selected by Vision Research to Provide Seamless Data and File Sharing for Award-Winning Cameras", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Paragon Software Group Selected by Vision Research to Provide Seamless Data and File Sharing for Award-Winning Cameras", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "a2cae9264502fdab2961855284c7b5c4c6d8477b"}, "author": "Paula Johns", "url": "http://www.prweb.com/releases/2015/10/prweb13004536.htm", "ord_in_thread": 0, "title": "Paragon Software Group Selected by Vision Research to Provide Seamless Data and File Sharing for Award-Winning Cameras", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Paragon Software Group today announced that Vision Research Inc., a leading manufacturer of digital high-speed imaging systems, has selected Paragon’s Ext File System Driver (ExtFS) technology for its award-winning slow-motion cameras to enable quick and convenient image and file sharing. Vision Research , a business unit of AMETEK Inc., specializes in high-end, high-speed digital cameras for the entertainment, scientific, military, aerospace and automotive industries. The company has a unique removable flash storage system known as CineFlash® for its Linux-based Phantom® Miro® brand of cameras. A CineFlash module can hold up to 240GB of raw imagery. Customers can save some—or all—of any high-speed shots to CineFlash for secure storage, and then later retrieve it by plugging the module into a docking station connected to a computer via eSATA or USB.\n“Because our CineFlash storage is formatted to the Linux Ext file system, we chose Paragon’s cross-platform Universal File System Driver (UFSD) technology to give easy access to these stored image files,” said Rick Robinson, vice president of marketing, Vision Research Inc. “We’ll be providing the needed drivers for both our Windows and Mac customers with each CineFlash Dock at no cost.”\nParagon’s Ext file system drivers allow seamless data access and file sharing between the Linux-based CineFlash cameras and a Windows PC or Mac. Allowing full read/write access to Linux-formatted partitions on the hard disk drive, the ExtFS drivers are easy to install, easy to use and provide the highest level of performance.\n“This is a powerful use of our ExtFS technology and we’re excited to have Vision Research further differentiate its leading brand with the ease and convenience that Paragon delivers to its customers,” said Tom Fedro, president, Paragon Software Group Corp. “Our drivers offer the highest levels of performance to take the hassle out of data sharing, delivering an important value-add for Vision Research camera users across a wide range of vertical industries.”\nVision Research, a 60-year-old company based in Wayne, N.J., designs and manufactures a comprehensive line of digital high-speed cameras, delivering unsurpassed light-sensitivity, image resolution, acquisition speed and image quality.\nAbout Paragon Software Group\nParagon Software Group is an innovative software developer focused on two dynamic growth markets. The company’s comprehensive product line for the data storage market addresses the needs of data security, storage and management for PCs, servers and networks. A second portfolio of products focuses on mobile productivity applications for handheld devices. Founded in 1994, Paragon Software Group has offices in the USA, Germany, Japan, Poland, Russia and China, delivering its solutions to consumers, small business and enterprise clients worldwide through a network of Value Added Resellers, distributors and OEMs as well as online through the company website. Paragon Software Group provides technology to a host of world-class companies and partners, including Cisco Systems, Dell, HP, Western Digital Corp., ASUS, Seagate, Toshiba, LG Electronics, Logitech, Buffalo, Acer, EMC/Iomega, Siemens, Lenovo, Microsoft, Motorola, Nokia, and more. For more information, please visit the company website at http://www.paragon-software.com .\n###\nParagon Software is a trademark of Paragon Software Group. All other trademarks are the property of their respective owners.", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5wYXJhZ29uLXNvZnR3YXJlLmNvbQ==", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3BhcmFnb24tZG93bmxvYWRzLmNvbQ==", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy52aXNpb25yZXNlYXJjaC5jb20=", "http://www.prweb.net/Redirect.aspx?id=aHR0cHM6Ly93d3cucGFyYWdvbi1zb2Z0d2FyZS5jb20vaG9tZS9leHRmcy13aW5kb3dzLw=="], "published": "2015-10-06T03:00:00.000+03:00", "crawled": "2015-10-06T15:06:55.883+03:00", "highlightTitle": ""}