{"organizations": [], "uuid": "b043c5b57b91ae74b59a124a0ae2d430bb7648c3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nola.com", "main_image": "http://imgick.nola.com/home/nola-media/width620/img/crime_impact/photo/18922361-standard.jpg", "site_section": "http://www.nola.com/science/index.ssf/2015/10/", "section_title": "New Orleans Science &amp; Technology News - NOLA.com ", "url": "http://www.nola.com/crime/index.ssf/2015/10/metairie_woman_scammed_into_wi.html", "country": "US", "title": "Metairie woman scammed into wiring $195,000 to fake Facebook Romeo: JPSO", "performance_score": 0, "site": "nola.com", "participants_count": 29, "title_full": "Metairie woman scammed into wiring $195,000 to fake Facebook Romeo: JPSO | NOLA.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T02:30:00.000+03:00", "replies_count": 29, "uuid": "b043c5b57b91ae74b59a124a0ae2d430bb7648c3"}, "author": "Michelle Hunter, NOLA.com | The Times-Picayune", "url": "http://www.nola.com/crime/index.ssf/2015/10/metairie_woman_scammed_into_wi.html", "ord_in_thread": 0, "title": "Metairie woman scammed into wiring $195,000 to fake Facebook Romeo: JPSO", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A Metairie woman was duped into sending more than $195,000 to a man she knew only through Facebook, according to the Jefferson Parish Sheriff's Office. The 59-year-old woman fell victim to what authorities call a romance/confidence scam , an old-school scheme invigorated by the Internet in which swindlers take money from those looking for love or companionship.\nThe victim told deputies she had never met the man she knew as \"Derek Reork\" in person, nor had she ever spoken to him by phone. Yet he conned the women into sending a total of $195,212 dollars in 13 wire transfers between July 16 and Sept. 25, said Col., John Fortunato, spokesman for the department.\n\"The chances of her recovering her money are probably very slim,\" Fortunato said.\nThe woman contacted the Sheriff's Office to report the scam on Oct. 1. She told investigators she first met Reork on Facebook on July 5. He told her he was in the army and stationed in Syria, according to Fortunato.\nIt's not clear whether Reork identified himself as an American soldier. But the two exchanged Facebook messages daily. The woman believed they were in a relationship, according to an incident report.\nWithin two weeks, Reork told the woman he had found $50 million while out on a mission. He wanted to mail the money to her house and asked for $3,455 to cover the costs, Fortunato said. The woman wired the money to London on July 16.\nBut Reork soon told her that his general had learned of the $50 million and wanted a cut. He told her she needed to send more money. The woman complied, wiring $17,128 on July 21 and two additional transfers for $10,000 and $25,000 on July 31, the incident report said.\nOver the next two months, Reork requested even more money, providing excuse after excuse. The woman sent several more transfers to London, Dubai and Turkey, the incident report said.\nAt one point, a man purporting to be Reork's general asked her to provide copies of her wire transfer receipts, possibly a bid to keep the scam running.\nThe woman told Sheriff's Office investigators that she took out a total 15 loans to provide the money, but did so because she believed she would soon have a share of the $50 million, Fortunato said.\nThe Sheriff's Office has not been able to identify or find the person named Derek Reork. They had no further information on the case as of Wednesday (Oct. 6), Fortunato said.\nPredators who wield the romance scam offer love and affection to build up trust before soliciting cash from their targets with phony tales of hardship or tragedy.\nRomance scams are unfortunately common and usually cost victims more money than other Internet-facilitated crimes – on average, at least $100,000, according to the FBI.\n\"The FBI New Orleans Division is aware of these schemes and suggest that citizens should be wary of anyone soliciting money or personal identifiers over the Internet or telephone,\" FBI Spokesman Craig Betbeze said.\nThe agency received 5,883 complaints of confidence/romance scams in 2014, with victims losing a total of $86.7 million, according to the department's Internet Crime Complaint Center (IC3). About 76 percent of the victims were over the age of 40, and 69 percent were women.\nThe U.S. Army in 2012 warned of scammers posing as officers on dating websites or social media, asking for money to cover the costs of flights home, fictitious medical expenses, cars or other gifts. There's even a Facebook page, Military Romance Scams , devoted to warning others about such thievery.\nFortunato urged residents to use caution in these sorts of relationships. \"You should be careful when dealing with someone requesting large sums of money from you,\" he said.\nThe IC3 offered other tips to protect against falling victim to similar scams:\nBe cautious when dealing with individuals located outside the country. Be cautious of individuals who claim the romance was destiny or fate, and you are meant to be together. Be cautious if an individual tells you they are in love with you and they cannot live without you, but they need you to send them money so they can visit you. If you do not send them money or help them, they will claim you do not love them. Fraudsters typically claim to be originally from the United States (or your local region), but are currently overseas, or going overseas for business or family matters. Be cautious of individuals representing themselves as foreign government officials. Beware when asked to assist in placing large sums of money in overseas bank accounts. Do not believe the promise of large sums of money for your cooperation. Any one concerned about suspicious or fraudulent activity online can file a complaint with the FBI's Internet Crime Complaint Center, visit www.ic3.gov.", "external_links": ["http://www.army.mil/article/91823/Internet_romance_scams_use_Soldiers__identities/", "https://www.fbi.gov/news/podcasts/thisweek/romance-scams.mp3/view", "https://www.facebook.com/MilitaryRomances", "https://www.fbi.gov/news/news_blog/2014-ic3-annual-report"], "published": "2015-10-08T02:30:00.000+03:00", "crawled": "2015-10-14T11:53:42.879+03:00", "highlightTitle": ""}