{"organizations": [], "uuid": "e50b385887a32640eb60385a26890bf6847faf40", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonpost.com", "main_image": "http://www.washingtonpost.com/blogs/the-switch/files/2015/10/239941596.jpg", "site_section": "http://www.washingtonpost.com/rss/business/technology", "section_title": "Technology", "url": "https://www.washingtonpost.com/news/the-switch/wp/2015/10/07/volkswagens-pulling-the-plug-on-its-2016-american-diesel-cars/", "country": "US", "title": "Volkswagen's pulling the plug on its 2016 American diesel cars", "performance_score": 0, "site": "washingtonpost.com", "participants_count": 1, "title_full": "Volkswagen's pulling the plug on its 2016 American diesel cars", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T02:08:00.000+03:00", "replies_count": 0, "uuid": "e50b385887a32640eb60385a26890bf6847faf40"}, "author": "Brian Fung", "url": "https://www.washingtonpost.com/news/the-switch/wp/2015/10/07/volkswagens-pulling-the-plug-on-its-2016-american-diesel-cars/", "ord_in_thread": 0, "title": "Volkswagen's pulling the plug on its 2016 American diesel cars", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Volkswagen’s pulling the plug on its 2016 American diesel cars Resize Text By Brian Fung October 7 at 6:47 PM Follow @b_fung (Daniel Acker/Bloomberg) \nVolkswagen says it won't be selling its newest diesel-powered cars in the United States anytime soon. \nThe company will not seek emissions certification from U.S. regulators for model-year 2016 diesels, in the wake of a massive cheating scandal that's sent VW's stock price tumbling and prompted lawmakers to drag the company's U.S. chief executive, Michael Horn, to Washington on Thursday. \n\"On behalf of our company, and my colleagues in Germany, I would like to offer a sincere apology,\" Horn will say, according to his prepared remarks for a congressional hearing. \"These events are deeply troubling. I did not think that something like this was possible at the Volkswagen Group.\" \nEnvironmental Protection Agency officials are expected to weigh potential penalties for VW as part of its investigation into the company's efforts to circumvent emissions tests. Volkswagen last month admitted to putting special software in its diesel cars that instructed the vehicles to emit less pollution during testing. On the open roads, however, the cars created up to 40 times more nitrogen oxides than allowable by law. Untreated diesel exhaust has been identified as a significant contributor to respiratory illness, particularly among asthma patients, the elderly and children. \nThe crisis has already forced at least one high-profile resignation, with Volkswagen AG chief executive Martin Winterkorn stepping down days after the scandal broke. Since then, Volkswagen shares have plummeted 40 percent and resale values on VW diesels have dropped on average some 13 percent , or about $1,700 per car. \nAs many as 11 million Volkswagens around the world may be affected. The problem has dealt a severe blow to VW's credibility, and nearly 3 in 4 consumers believe the issue could spread beyond Volkswagen to other automakers, according to a Kelley Blue Book poll. More than half of the respondents said they have either lost \"complete\" faith in VW or now generally mistrust the company. \nRELATED: Brian Fung covers technology for The Washington Post, focusing on telecommunications and the Internet. Before joining the Post, he was the technology correspondent for National Journal and an associate editor at the Atlantic. business/technology Success! Check your inbox for details. You might also like: Please enter a valid email address Sign Up", "external_links": [], "published": "2015-10-08T02:08:00.000+03:00", "crawled": "2015-10-08T02:45:05.842+03:00", "highlightTitle": ""}