{"organizations": [], "uuid": "8df6dbc087cdb80da3cfe21d83bcf6734efad6c8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stockhouse.com", "main_image": "", "site_section": "http://www.stockhouse.com/discovery/information-technology-services", "section_title": "The Information-Technology-Services Report - Information-Technology-Services investor news and research center ", "url": "http://www.stockhouse.com/news/press-releases/2015/10/12/cgi-launches-new-offerings-to-help-transaction-banks-explore-transformational", "country": "CA", "title": "CGI launches new offerings to help transaction banks explore transformational change investments for reaching strategic goals", "performance_score": 0, "site": "stockhouse.com", "participants_count": 1, "title_full": "CGI launches new offerings to help transaction banks explore transformational change investments for reaching strategic goals", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "8df6dbc087cdb80da3cfe21d83bcf6734efad6c8"}, "author": "stockhouse.com", "url": "http://www.stockhouse.com/news/press-releases/2015/10/12/cgi-launches-new-offerings-to-help-transaction-banks-explore-transformational", "ord_in_thread": 0, "title": "CGI launches new offerings to help transaction banks explore transformational change investments for reaching strategic goals", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Disciplined strategy execution critical to realizing current and future market opportunities\nStock Market Symbols\nGIB.A (TSX)\nGIB (NYSE)\nhttp://www.cgi.com/newsroom\nMONTRÉAL, Oct. 12, 2015 /CNW Telbec/ - CGI (TSX: GIB.A) (NYSE: GIB) today launched a set of offerings designed to help banks leaders navigate technology investments in the dynamic, highly competitive, but increasingly important field of transaction banking. These offerings include a comprehensive Global Transaction Banking (GTB) vision paper, an online self-assessment tool, and a new GTB web section to help clients develop concrete GTB roadmaps that align with their strategic priorities and drive growth.\n\"Transaction banking is transforming, with clients and competition driving the rapid pace of change,\" said Penny Hembrow , Vice-President and Global Lead, Financial Services, CGI. \"Piecemeal IT investment to 'run the bank' will no longer enable strategic priorities to be met. To realize growth in this dynamic marketplace, business and IT leaders need to invest in transformational change to establish a concrete roadmap of service innovation, enhanced digital client servicing and highly efficient straight through processing. Navigating through these often contradicting priorities is critical to achieving improved return on equity.\"\nAlthough the opportunities in transaction banking are promising, CGI notes that, historically, there has been under investment in this line of business, resulting in low straight through processing rates and outdated, disjointed and costly services.\nTo succeed in this marketplace, leading banks are investing in strategies that:\nAddress the market's escalating expectations for transaction services Leverage the heightened performance benefits of standardization and technology-driven innovation Modernize legacy infrastructures to drive cost savings Based on the Banking International Architecture Network (BIAN) standards, CGI has developed an enterprise view of a transaction bank that allows business and IT leaders to discuss, challenge and align IT investments.\n\"CGI outlines GTB strategies and their appropriateness based on a bank's objectives and funding. We also describe the capabilities that have been proven, based on our extensive experience, to be critical in running an efficient, streamlined and profit-driving transaction banking line of business,\" said Penny. \"The future of transaction banking holds great promise and the time is now for making the right investments to build and grow a successful transaction banking business.\"\nRead CGI's GTB vision report and complete the self-assessment survey .\nCGI is a recognized IT leader in the financial services industry, with more than 16,000 finance professionals working with clients across 5 continents, including 23 of the top 25 banks in the Americas and 21 of the top 25 banks in Europe .\nCGI can be found at stand L19 during Sibos at the Marina Bay Sands Convention Centre in Singapore\nAbout CGI\nFounded in 1976, CGI Group Inc. is the fifth largest independent information technology and business process services firm in the world. Approximately 68,000 professionals serve thousands of global clients from offices and delivery centers across the Americas, Europe and Asia Pacific , leveraging a comprehensive portfolio of services, including high-end business and IT consulting, systems integration, application development and maintenance, infrastructure management, as well as a wide range of proprietary solutions. With annual revenue in excess of C$10 billion and an order backlog of approximately C$20 billion , CGI shares are listed on the TSX (GIB.A) and the NYSE (GIB). Website: www.cgi.com .\nSOURCE CGI Group Inc.\nInvestors, Lorne Gorber, Executive Vice-President, Global Communications and Investor Relations, [email protected] , +1 514-841-3355; Media, Steve Bosic, Director, Communications, [email protected] , + 1 978 569-6098Copyright CNW Group 2015\nCanada Newswire October 12, 2015 - 6:00 AM EDT Tags: INFORMATION TECHNOLOGY SERVICES TECHNOLOGY", "external_links": ["http://www.cgi.com/en/media-room", "http://www.cgi.com/en/financial-services/banking-and-financial-markets/gtb-maturity-self-assessment-tool", "http://www.cgi.com/newsroom", "http://www.cgi.com/", "http://www.cgi.com/en/financial-services/banking-and-financial-markets/gtb", "http://rt.newswire.ca/rt.gif?NewsItemId=C7026&Transmission_Id=201510120600CANADANWCANADAPR_C7026&DateId=20151012", "http://www.cgi.com/sites/default/files/white-papers/enterprise-framework-for-building-the-transaction-bank-of-the-future.pdf"], "published": "2015-10-12T03:00:00.000+03:00", "crawled": "2015-10-12T13:53:11.347+03:00", "highlightTitle": ""}