{"organizations": ["Security and Logistics Dahua Technology"], "uuid": "4fef4e930613f78edccbec0132f0fd4caab8bc2c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.porttechnology.org", "main_image": "https://www.porttechnology.org/images/made/images/uploads/news/arr-rest_1923375b_352_220.jpg", "site_section": "http://www.porttechnology.org/rss_feeds/news/", "section_title": "Port Technology International - News", "url": "http://www.porttechnology.org/news/dahua_providing_safer_cities/", "country": "GB", "title": "Dahua: Providing Safer Cities", "performance_score": 0, "site": "porttechnology.org", "participants_count": 0, "title_full": "Dahua: Providing Safer Cities", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T17:02:00.000+03:00", "replies_count": 0, "uuid": "4fef4e930613f78edccbec0132f0fd4caab8bc2c"}, "author": "", "url": "http://www.porttechnology.org/news/dahua_providing_safer_cities/", "ord_in_thread": 0, "title": "Dahua: Providing Safer Cities", "locations": ["Sucre", "Arezzo", "Hangzhou", "Italy", "China", "Bolivia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "22 Oct 2015 Going Places , Security and Logistics Dahua Technology, a world-leading manufacturer and supplier of video surveillance products headquartered in Hangzhou, China has successfully installed surveillance solutions to both Sucre, the constitutional Capital city of Bolivia, and the city of Arezzo in Italy. \nArezzo is a city located in Tuscany known for its churches, museums, sloping Piazza Grande, and gold item production. \nA highly innovative, reliable IP solution was tailored by Dahua’s specialists to ensure the safety of the city. \nDahua’s network camera features a 2-Megapixel progressive scan Exmor CMOS sensor, providing high quality images at25/30fps @1080P, and it supports H.264&MJPEG dual codec and smart detection. \nWith 30 metre IR range, the camera performs well in all lighting conditions, day and night. \nITC series cameras with a highly efficient algorithm provide intelligent surveillance for roads, streets, venues to monitor traffic conditions. \nSucre, as a developing city, is facing many problems such as traffic flow issues and crime. \nThe municipal government is determined to create a better and safer living environment for its citizens by launching safe city project with an urban surveillance deployment project. \nTherefore, Dahua, together with a local distributor, Digital Security System SRL, has enabled Sucre to meet its goals by offering a customised urban surveillance solution. \nThis Solution includes Network PTZ cameras (SD6A230N-HNI and SD59230S-HN) that are installed in different zones of the city, connected by wired and wireless IP communication. \n“We appreciate having Dahua, a responsible and professional company, as our partner,” said Harold Ribera, Line Manager at DSS SRL. “The clients were unfamiliar with the new system at first, but Dahua’s team help solve the bugs and problems with expertness and effectiveness.”", "external_links": [], "published": "2015-10-22T17:02:00.000+03:00", "crawled": "2015-10-23T02:25:26.231+03:00", "highlightTitle": ""}