{"organizations": [], "uuid": "6fc25a11363077b49c65bd4d6af3506a4f44ef57", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnet.com", "main_image": "http://cnet1.cbsistatic.com/hub/i/r/2015/10/22/78a22887-afd1-445b-9364-7ef77c0fd8a9/thumbnail/670x503/2d58fea4fb160890e11534315439f678/aasgraphic-distraction-chart.jpg", "site_section": "http://www.cnet.com/news/", "section_title": "Technology News - CNET News - CNET", "url": "http://www.cnet.com/news/hands-free-car-systems-still-distract-drivers-aaa-study-says/", "country": "US", "title": "Hands-free car systems still distract drivers, study says", "performance_score": 2, "site": "cnet.com", "participants_count": 1, "title_full": "Hands-free car systems still distract drivers, study says - CNET", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T20:44:00.000+03:00", "replies_count": 0, "uuid": "6fc25a11363077b49c65bd4d6af3506a4f44ef57"}, "author": "Andrew Krok", "url": "http://www.cnet.com/news/hands-free-car-systems-still-distract-drivers-aaa-study-says/", "ord_in_thread": 0, "title": "Hands-free car systems still distract drivers, study says", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Enlarge Image Guess all these fancy doodads aren't that much better for us, after all. AAA Foundation for Traffic Safety\nDistracted driving is a serious epidemic in the United States. To reduce accidents caused by distraction, many states have laws requiring drivers to use hands-free technology behind the wheel. However, a new study from the AAA Foundation for Traffic Safety found that many current voice-based systems are still a distraction.\nThe study, conducted by researchers at the University of Utah , looked at the use of smartphones and in-car infotainment systems while driving. The phone portion of the study, which had 65 participants, asked drivers to call contacts, change music, dial numbers and send text messages using voice commands. Drivers tested out three smartphone voice assistants, Apple's Siri, Microsoft's Cortana and Google Now.\nGoogle Now ranked as the least distracting system, while Cortana was the most distracting. All three voice assistants were \"highly distracting,\" said the AAA study.\nThe infotainment portion of the study, which had 257 participants, looked at 10 different 2015 model year vehicles, encompassing a wide range of systems. Drivers were asked to peruse phone contact lists, dial a phone number and select music using voice commands.\nThe three best performers were the Chevrolet Equinox with MyLink, the Buick LaCrosse with IntelliLink (the same system as MyLink, just reskinned for Buick) and the Toyota 4Runner with Entune. The most distracting system belonged the Mazda6 . It was the only system the AAA study ranked as \"very highly distracting.\"\nEnlarge Image Distraction lasts much longer than you think it might. AAA Foundation for Traffic Safety\nRankings aside, the study contained some very disconcerting findings. Even after disconnecting from a call, participants remained distracted for up to 27 seconds on some systems. The study also pointed out that additional practice with systems had no effect on improving distraction. Older drivers also had a harder time paying attention when dealing with new hands-free technology.\nHalf a minute might not seem like much time to be distracted, but it is when you're behind the wheel of a car. The US government's distracted-driving website points out that drivers travel the length of a football field in five seconds at 55 mph. At the 25 mph speed limit in the AAA study, drivers covered the length of nearly three football fields in 27 seconds. In 2013, more than 3,000 people in the US were killed in motor vehicle crashes involv­ing distracted drivers, according to the National Highway Traffic Safety Administration.\nThe head of Utah's research was quick to note that some new additions to car infotainment systems are making things worse for drivers. Partly in an effort to capture the money of younger drivers, automakers are throwing all sorts of Internet-based applications into their new cars. Drivers can browse news and weather reports and even post to social media, all from behind the wheel.\nThe study participants ranged in age from 21 to 70, and all had driving records lacking at-fault accidents in the last five years. The tests were conducted at 25 mph on a 2.7-mile loop in Salt Lake City. Distraction was measured by pushing a button when an LED light flashed in a participant's periphery. Video cameras were also used to tracked participants' eye movements.", "external_links": ["http://newsroom.aaa.com/2015/10/new-hands-free-technologies-pose-hidden-dangers-for-drivers/", "http://www.distraction.gov/stats-research-laws/facts-and-statistics.html", "http://cnet2.cbsistatic.com/hub/i/r/2015/10/22/5bd9d7b3-bc47-4c89-a858-f2126187eb28/resize/270xauto/37892fe03ee0521e3380aad2daf8785e/aaagraphic-27seconds.jpg", "http://unews.utah.edu/up-to-27-seconds-of-inattention-after-talking-to-your-car-or-smart-phone/", "http://cnet3.cbsistatic.com/hub/i/r/2015/10/22/78a22887-afd1-445b-9364-7ef77c0fd8a9/resize/570xauto/de8eca8c8b05b09c9080f2b1e8e243ff/aasgraphic-distraction-chart.jpg"], "published": "2015-10-22T20:44:00.000+03:00", "crawled": "2015-10-22T22:54:27.689+03:00", "highlightTitle": ""}