{"organizations": [], "uuid": "309b58660af03d649f1c4432b013132bd33657dd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.technology.org", "main_image": "", "site_section": "http://feeds.feedburner.com/TechnologyOrgLifeSciencesTechnologiesNews", "section_title": "Technology Org » Life sciences & technologies news", "url": "http://www.technology.org/2015/10/20/discrepancies-common-reported-medical-outcomes-trial-registry-data/", "country": "", "title": "Determining Accurate Life Expectancy of Older Adults Requires Provider, Patient Discussion", "performance_score": 0, "site": "technology.org", "participants_count": 1, "title_full": "Determining Accurate Life Expectancy of Older Adults Requires Provider, Patient Discussion", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T13:00:00.000+03:00", "replies_count": 0, "uuid": "309b58660af03d649f1c4432b013132bd33657dd"}, "author": "Raminta Šulskutė", "url": "http://www.technology.org/2015/10/20/discrepancies-common-reported-medical-outcomes-trial-registry-data/", "ord_in_thread": 0, "title": "Determining Accurate Life Expectancy of Older Adults Requires Provider, Patient Discussion", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Determining Accurate Life Expectancy of Older Adults Requires Provider, Patient Discussion Posted Today \nHealth care providers must have detailed discussions with their older adult patients to better determine their true life expectancy, as older adults do not accurately predict their own prognosis, a key factor in making decisions about future health interventions, according to researchers at UC San Francisco and San Francisco Veterans Affairs Medical Center. \nTheir research letter appears online Oct. 19, in JAMA Internal Medicine . \n“We thought older people would have a good sense of how long they had to live and have better estimates than a prognostic calculator that is based on things like age, gender and chronic diseases,” said lead author Rafael Romo, PhD, RN, doctoral graduate in the UCSF School of Nursing and VA Quality Scholars Nurse Fellow at the San Francisco VA Medical Center, “but we were wrong.” \n“It turns out that older people are not very good at predicting their prognosis compared to either their actual survival or a calculated estimate. Further, the older you are, the worse you are at predicting.” \nMany professional guidelines recommend using life expectancy in considering diagnostic or treatment interventions in cases where the time to benefit may exceed patient survival. Otherwise, the patient is at-risk for up-front harms with little chance of benefit. \nThe patients’ perceptions of prognosis also are important. Those who underestimate their survival may choose to forego interventions likely to help them, while those who overestimate may choose interventions more likely to cause harm. However, little is known about how well older adults estimate their survival. Soliciting Direct Input from Older Adults \nIn this JAMA Internal Medicine research letter, Romo and his colleagues drew a sample of 2,018 participants ages 64, 69, 74, 79, 84 and 89 from the 2000 wave of the Health and Retirement Study (HRS), a prospective cohort study of U.S. adults. They were asked the percentage chance they would live another 10 years or more. \nThe participants’ subjective estimates then were compared both to observed survival and the objective estimates determined from a best-fit analysis. Under- or overestimated survival occurred if the estimate was more than 25 percent less or greater than the calculated prediction. The final sample included 1,722 participants, with the 84-year-old and 89-year-old age groups combined due to small response size. \nOverall, 54.7 percent of the study participants had similar estimates to the objective calculation, with 32.7 percent underestimating and 11.5 percent overestimating. Underestimation was relatively similar across age groups, but overestimation increased significantly with age. \nFurther, those participants age 64 and 69 were moderately able to estimate survival, but older participants were no better than chance alone. \n“We were surprised to find that people tended to underestimate how long they have to live – not overestimate – compared to the clinical estimates,” Romo said. “This goes against common wisdom that says older people are more likely to overestimate.” \nAs a result of these findings, the discrepancy between older people’s perceived prognosis and their clinical circumstances may create conflict when clinicians make recommendations based on clinical indicators. \n“We need to understand how these differences impact patient-clinician communication and the type of treatments and care they receive,” Romo said. “Of particular interest is whether those who underestimate their prognosis forgo procedures and tests that may be beneficial to them. This is just as harmful to patients as receiving treatments that will not have a benefit, so we need to understand what is happening in both groups.” \nOther contributors to the JAMA Internal Medicine research letter were senior author Alexander Smith, MD, MS, MPH, associate professor of geriatrics at UCSF and the San Francisco VA Medical Center; Sei Lee, MD, MAS, associate professor of geriatrics at UCSF and the San Francisco VA Medical Center; John Boscardin, PhD, professor of medicine and epidemiology and biostatistics at UCSF; and Yinghui Miao, MPH, senior statistician in geriatrics at UCSF. Funding was provided by the National Institute on Aging, American Federation for Aging Research and the National Veterans Administration Quality Scholars program.", "external_links": [], "published": "2015-10-20T13:00:00.000+03:00", "crawled": "2015-10-20T13:37:38.300+03:00", "highlightTitle": ""}