{"organizations": [], "uuid": "f8a049cff741a9f83597665819b3287808c28845", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/news/technology", "section_title": "Technology News | Reuters.com", "url": "http://www.reuters.com/article/2015/10/22/us-sharp-robot-cellphone-idUSKCN0SG11J20151022", "country": "US", "title": "A smartphone that keeps getting smarter", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "A smartphone that keeps getting smarter | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T14:37:00.000+03:00", "replies_count": 0, "uuid": "f8a049cff741a9f83597665819b3287808c28845"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/10/22/us-sharp-robot-cellphone-idUSKCN0SG11J20151022", "ord_in_thread": 0, "title": "A smartphone that keeps getting smarter", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "With smartphones becoming ever more elaborate, one might think that there's little left to surprise users. But Japan's Sharp Corporation have brought us RoBoHoN, a robot smartphone that employs facial recognition and a two-inch touchscreen embedded in its back for making calls, sending texts, and surfing the web.\nIt was displayed at the recent CEATEC technology show on the outskirts of Tokyo.\nShaped like a humanoid communication robot, RoBoHoN is 19 centimeters tall and weighs around 390 grams. In addition to its smartphone functions, RoBoHoN can also dance and talk with people.\n\"We wanted to make a phone that felt closer to a user's life than the normal telephone. That idea led us to this humanoid robot phone,\" said Sharp representative Kuniyuki Maruyama.\nThe robot is also programmed to learn from interacting with users and thus become smarter, by accumulating users' data in its cloud system.\n\"Because the robot will learn about the user through the daily life they share together, I think it will offer people a much happier life,\" said Maruyama.\nTo answer a phone call, users must press the button on the robot's back screen and hold it to their cheek. The speaker is placed inside the robot's mouth.\nVisitors to CEATEC were impressed. \"It is capable of various things, such as responding to your speech. There are many kinds of way to use it. I think this is really a new idea that we have never seen before,\" said Naigi.\n\"I saw it on Twitter first, and then came to see the real thing. It's smaller than I thought and it's really cute,\" added Miwako Tang.\nRoBoHoN can also project images onto any surface from short distances with its in-built forehead projector and even call a cab for its user.\nSharp says the robot phone is expected to be available in Japan in the first half of 2016.", "external_links": [], "published": "2015-10-22T14:37:00.000+03:00", "crawled": "2015-10-22T14:46:31.133+03:00", "highlightTitle": ""}