{"organizations": ["First Fukushima"], "uuid": "a56572fc35410edf8c262b61500f3d168ec38ee8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.terradaily.com", "main_image": "http://www.spxdaily.com/images-bg/los-alamos-national-lab-muon-radiography-fukushima-daiichi-reactor-bg.jpg", "site_section": "http://www.terradaily.com/terradaily.xml", "section_title": "Earth News, Earth Science, Energy Technology, Environment News", "url": "http://www.terradaily.com/reports/First_Fukushima_worker_diagnosed_with_radiation-linked_cancer_Japan_official_999.html", "country": "US", "title": "First Fukushima worker diagnosed with radiation-linked cancer: Japan official", "performance_score": 0, "site": "terradaily.com", "participants_count": 0, "title_full": "First Fukushima worker diagnosed with radiation-linked cancer: Japan official", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T01:56:00.000+03:00", "replies_count": 0, "uuid": "a56572fc35410edf8c262b61500f3d168ec38ee8"}, "author": "", "url": "http://www.terradaily.com/reports/First_Fukushima_worker_diagnosed_with_radiation-linked_cancer_Japan_official_999.html", "ord_in_thread": 0, "title": "First Fukushima worker diagnosed with radiation-linked cancer: Japan official", "locations": ["Tokyo", "Japan"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "First Fukushima worker diagnosed with radiation-linked cancer: Japan official By Hiroshi HIYAMA Tokyo (AFP) Oct 20, 2015 \nA former Fukushima nuclear plant worker has been diagnosed with radiation-linked cancer, Japanese officials said Tuesday, and an expert said the first confirmed case since the 2011 accident could be just the \"tip of the iceberg\". \nA health ministry official said the unnamed man, who was in his thirties while working at the plant following the 2011 crisis, has leukaemia. He is now 41, local media reported. \nThe announcement will likely further inflame widespread public opposition to nuclear power, and could frustrate efforts to resettle evacuees in communities around the crippled Fukushima plant that have been deemed safe. \nIt also comes less than a week after the controversial restarting of a second reactor in Japan following the shutdown of all the country's reactors in the wake of the crisis. \n\"This person went to see a doctor because he was not feeling well. That was when he was diagnosed with leukaemia,\" the health ministry official told a press briefing on condition of anonymity, adding that other possible causes had been ruled out. \nThe official revealed few details about the man, but said he had worked at a destroyed building that housed one of the plant's crippled reactors. \nThe man, who wore protective equipment during more than a year spent at Fukushima, will be awarded compensation to pay for his medical costs and lost income, the official said, without elaborating on the amount. \nThree similar cases of cancer in plant workers are still awaiting confirmation of a link to the accident. \nPublic broadcaster NHK said about 45,000 people have worked at the Fukushima plant since the accident as part of a massive, multi-billion-dollar cleanup. \n- 'Tip of the iceberg' - \nThere has been hot debate about whether the accident would lead to a rise in cancer among plant employees and those who lived near Fukushima. \n\"This is a landmark decision from the viewpoint of workers' rights, and it's probably just the tip of the iceberg,\" Shinzo Kimura, associate professor of radiation and hygiene at Dokkyo Medical University, told AFP. \nThe man was thought to have been exposed to a \"relatively low\" amount of radiation -- less than what Tokyo has deemed as a safe level for Fukushima-area residents to move back to their homes, Kimura said. \n\"This is an alarm bell for that policy,\" he added. \nPlant operator Tokyo Electric Power Co (TEPCO) said it was not \"in a position to comment\" but expressed sympathy for the man and reiterated a pledge to cut workers' radiation exposure. \nNo deaths have been directly attributed to the radiation released during the 2011 accident, but it has displaced tens of thousands of people and left large areas uninhabitable, possibly for decades. \n\"This is a massive blow to the IAEA (International Atomic Energy Agency), which stated in September this year that no discernible health effects are to be expected due to the exposure of radiation released by the accident,\" Greenpeace said. \nA huge quake-sparked tsunami, which levelled Japan's northeast cost and killed more than 18,000 people, swamped cooling systems at the plant and sent some reactors into meltdown. \nRadiation was released into the air, sea and food chain in the worst nuclear accident since the 1986 Chernobyl disaster. \nFormer Fukushima plant manager Masao Yoshida died two years after the accident at the age of 58, but TEPCO has disputed whether his oesophageal cancer was linked to radiation. \nYoshida captured headlines after he stayed at his post in a desperate attempt to tame the runaway reactors, while his workers battled frequent aftershocks to try to prevent the disaster from worsening. \nLast week, utility Kyushu Electric Power said it restarted the number-two reactor at Sendai, about 1,000 kilometres (620 miles) southwest of Tokyo. \nThe same power plant's number-one reactor was restarted in August, ending a two-year nuclear power hiatus, despite widespread protests against returning to nuclear power. \nThe government temporarily restarted the Oi nuclear reactors in 2012 to prevent power shortages in the central Kansai region, but they stopped operations again in September 2013. \nTokyo has said it would continue to restart reactors that are deemed safe under strengthened regulatory standards. \noh-hih-kh-si/pb/sm", "external_links": [], "published": "2015-10-25T01:56:00.000+03:00", "crawled": "2015-10-25T02:58:42.716+02:00", "highlightTitle": ""}