{"organizations": ["Microdyn-Nadir", "MBR"], "uuid": "5f6dcfa3b7811adcec4103af86f735906374fbb1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.waterworld.com", "main_image": "http://www.waterworld.com/content/ww/_jcr_content/brandingImage.img.jpg", "site_section": "http://feeds.feedburner.com/technologies-rss1", "section_title": "WaterWorld.com Technologies", "url": "http://www.waterworld.com/articles/2015/10/ovivo-microdyn-nadir-form-strategic-partnership-to-lead-mbr-market.html", "country": "US", "title": "Ovivo, Microdyn-Nadir form strategic partnership to service national MBR market", "performance_score": 0, "site": "waterworld.com", "participants_count": 0, "title_full": "Ovivo, Microdyn-Nadir form strategic partnership to service national MBR market", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T18:46:00.000+03:00", "replies_count": 0, "uuid": "5f6dcfa3b7811adcec4103af86f735906374fbb1"}, "author": "", "url": "http://www.waterworld.com/articles/2015/10/ovivo-microdyn-nadir-form-strategic-partnership-to-lead-mbr-market.html", "ord_in_thread": 0, "title": "Ovivo, Microdyn-Nadir form strategic partnership to service national MBR market", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ovivo, Microdyn-Nadir form strategic partnership to service national MBR market Sponsored by \nMONTREAL, CANADA, Oct. 9, 2015 -- Ovivo Inc., a global company dedicated to water and wastewater treatment, recently signed an unprecedented, multi-year agreement with Microdyn-Nadir, a producer of micro-, ultra- and nano-filtration membranes and modules, to service the U.S. membrane bioreactor (MBR) market. The agreement secures access to BIO-CEL membrane technology and includes a collaborative venture to build private-label membrane equipment (OV). \nCombining Ovivo system integration expertise with the Microdyn membrane manufacturing knowledge is expected to rapidly drive innovation, increase quality, reduce costs, and improve delivery times. As part of the new partnership, Microdyn has agreed to build a second production line for BIO-CEL membranes. The new line will most likely be located in Austin, Texas, in cooperation with Ovivo U.S. operations, with production set to begin in January 2017. [Native Advertisement] \nMBR systems are considered an advanced available treatment for the wastewater industry. Likewise, Ovivo MBR Systems are routinely designed to produce high-quality reuse effluent (irrigation, water features, etc.) and meet stringent nutrient limits. The demand for MBR has steadily increased over the last 10 years; however, the rate of growth has been limited by misconceptions about cost of ownership and membrane life. The new Ovivo-Microdyn partnership will address both of these issues by offering BulletProof OV Membrane Units equipped with BIO-CEL technology and integrated into Ovivo MBR Systems. \nWhat makes BIO-CEL different than the flat-plate system previously used by Ovivo is the design. Microdyn flat sheets take 60-percent less raw material to make than plates and production is fully automated. From an operational standpoint, the flexible sheets are also less susceptible to damaging debris and clogging that can occur with plates. \nSee also: \n\" Ovivo awarded over $12M in contracts for water services in Asian markets \" \nAbout Ovivo Inc. Ovivo Inc. is a global company dedicated to water and wastewater treatment. It offers comprehensive technological solutions as well as services and equipment tailored to specific client needs. Ovivo operates in over 15 countries with more than 800 employees. It is a public company whose shares trade on the Toronto Stock Exchange under the ticker symbols OVI.A and OVI.B. For more information, visit www.ovivowater.com . \nAbout Microdyn-Nadir \nWith locations in Germany, Asia, the U.S., and South America, Microdyn-Nadir is an independent producer of micro-, ultra- and nano filtration membranes and modules. At its headquarters in Wiesbaden, the company pursues intensive research & development activities. For almost 50 years, Microdyn has been applying its products in various industrial and municipal applications in the field of water and wastewater treatment as well as in many process-integrated applications. For more information, visit www.microdyn-nadir.com \n### \nSponsored by \nSponsored Content is made possible by our sponsor; it does not necessarily reflect the views of our editorial staff. Did You Like this Article? Get All the Water Industry News Delivered to Your Inbox or Mailbox \nSubscribe to one of our magazines or email newsletters today at no cost and receive the latest information. RELATED ARTICLES", "external_links": [], "published": "2015-10-09T18:46:00.000+03:00", "crawled": "2015-10-09T23:50:10.236+03:00", "highlightTitle": ""}