{"organizations": [], "uuid": "7d5ff0bfffa38d7961b4f043b98db251045260e7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1140821/ellie-mae-acquire-mortgage-returns", "country": "US", "title": "Ellie Mae to Acquire Mortgage Returns", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "Ellie Mae to Acquire Mortgage Returns", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T00:00:00.000+03:00", "replies_count": 0, "uuid": "7d5ff0bfffa38d7961b4f043b98db251045260e7"}, "author": "admin", "url": "http://www.freshnews.com/news/1140821/ellie-mae-acquire-mortgage-returns", "ord_in_thread": 0, "title": "Ellie Mae to Acquire Mortgage Returns", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Submitted by admin on 10/14/2015 @ 2:00 PM Companies mentioned in this article: Ellie Mae \nPLEASANTON, Calif. -- (BUSINESS WIRE) -- Ellie Mae® (NYSE:ELLI), a leading provider of innovative on-demand software solutions and services for the residential mortgage industry, announced today that it has signed a definitive agreement to acquire Mortgage Returns, a leader in on-demand customer relationship management (CRM), and marketing automation solutions for the mortgage industry. \nMortgage Returns provides a database-driven automated marketing solution to help mortgage originators maximize profitability from clients, prospects and referral partners. Through the TRUE CRM® system, Mortgage Returns enables compliant and automated one-to-one marketing that delivers bottom-line results. \n“Mortgage Returns was founded to help mortgage originators improve their results through a truly automated solution and today they serve nearly 200 financial institutions,” said Jonathan Corr, president and CEO of Ellie Mae. “CRM and marketing automation remain a key value proposition in our industry and with the acquisition of Mortgage Returns we are responding to the needs of our customers by adding a robust CRM solution for lenders of all sizes. This acquisition enhances our marketing platform and furthers our mission of automating the entire end-to-end mortgage process for our customers.” \n“We’re thrilled to join Ellie Mae at such an exciting time and to come together to provide a CRM solution for mortgage lenders,” said Jim Blatt, president and co-founder of Mortgage Returns. “Together, we are poised to deliver a complete solution to our customers that will fuel change, enable massive efficiencies and provide a truly complete CRM offering.” \nThe transaction is expected to close in the fourth quarter of 2015. Ellie Mae will provide additional details on the expected synergies when the company reports its third quarter results. \nAbout Mortgage Returns: \nSt. Louis-based Mortgage Returns is an award-winning database management and automated marketing provider for loan originators nationwide. Mortgage Returns’ customized marketing solutions increase referrals, cross-sell opportunities and end-to-end prospect management for nearly 200 financial institutions. For more information about Mortgage Returns, visit www.mortgagereturns.com . \nAbout Ellie Mae: \nEllie Mae (NYSE:ELLI) is a leading provider of innovative on-demand software solutions and services for the residential mortgage industry. Mortgage lenders of all sizes use Ellie Mae’s Encompass ® all-in-one mortgage management solution, Mavent Compliance Service and AllRegs research, reference and education resources to improve compliance, loan quality and efficiency across the entire mortgage lifecycle. Visit EllieMae.com or call 877.355.4362 to learn more. \nForward-Looking Statements \nThis press release contains forward-looking statements under the safe harbor provisions under The Private Securities Litigation Reform Act of 1995. These forward-looking statements include statements regarding our ability to offer a robust and complete CRM solution to our customers and the timing of the acquisition of Mortgage Returns. These statements involve known and unknown risks, uncertainties and other factors, which may cause actual events to be materially different than those expressed or implied in such statements. The forward-looking statements included in this press release are made only as of the date hereof. Ellie Mae cannot guarantee future results, performance or achievements. Accordingly, you should not place undue reliance on these forward-looking statements. Finally, Ellie Mae expressly disclaims any intent or obligation to update any forward-looking statements to reflect subsequent events or circumstances. \n© 2015 Ellie Mae, Inc. Ellie Mae ® , Encompass ® , AllRegs®, DataTrac ® , Ellie Mae Network™, Mavent®, Total Quality Loan™, TQL™ and the Ellie Mae logo are trademarks of Ellie Mae, Inc. or its subsidiaries. All rights reserved. Other company and product names may be trademarks or copyrights of their respective owners. View source version on businesswire.com: http://www.businesswire.com/news/home/20151014006593/en/ Copyright © Business Wire 2015", "external_links": [], "published": "2015-10-15T00:00:00.000+03:00", "crawled": "2015-10-15T01:57:22.212+03:00", "highlightTitle": ""}