{"organizations": [], "uuid": "7d093f49e881d979c068d855188bd91ba649a127", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266385/technology-general", "section_title": "Technology Press Releases from PRWeb - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30236688/acer-showcases-new-windows-10-devices", "country": "US", "title": "Acer Showcases New Windows 10 Devices", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Acer Showcases New Windows 10 Devices - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T10:02:00.000+03:00", "replies_count": 0, "uuid": "7d093f49e881d979c068d855188bd91ba649a127"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30236688/acer-showcases-new-windows-10-devices", "ord_in_thread": 0, "title": "Acer Showcases New Windows 10 Devices", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "New Portfolio will Help Empower People to Connect and Interact in Whole New Ways\nTaipei (PRWEB) October 11, 2015\nEditor’s Summary\n-- Acer showcases its Windows 10 devices highlighting key features such as Cortana, Continuum, Microsoft Edge and Xbox, while announcing two new devices optimized for Windows 10\n-- New Aspire R 14 convertible notebook with diamond-cut edge design and a thinner 360-degree dual torque hinge offers incredible flexibility between four usage modes\n-- Aspire Z3-700 all-in-one PC features a built-in battery that will last for 5 hours, allowing desktop productivity or entertainment tasks anywhere around the house\nAcer today announced two new Windows 10 devices, the Aspire R 14 convertible notebook, and the Aspire Z3-700 portable all-in-one PC. Joining Acer’s extensive Windows 10 device portfolio, both of the new innovative Windows 10 devices will change how people interact and connect with what’s important in their world.\n“Acer has a heritage of delivering the best user experience through innovation in technology and design,” said Jason Chen, Corporate President and CEO, Acer. “With Windows 10, we can now deliver a unique and consistent experience across our comprehensive product portfolio, be it notebooks, desktops, tablets or smartphones, and empower users to do great things with more personal and human technology.”\n“We worked closely with Acer to help ensure their devices would make the most of Windows 10,” said Terry Myerson, Executive Vice President of the Windows and Devices Group, Microsoft. “With Cortana, the personal assistant that helps you get things done, Continuum, which enables Windows Phones to act like a PC when paired with a larger display, great gaming with Xbox, and our new browser Microsoft Edge, we are excited to welcome these Acer devices to the Windows 10 family.”\nOptimized for Windows 10\nAcer today announced two new devices that bring Windows 10 to life, namely the Aspire R 14 (R5-431T/471T) convertible notebook, and the Aspire Z3-700 portable all-in-one PC. Both devices with dual-digital microphones feature Acer Purified.Voice with enhanced digital signal processing (DSP) that cancel background noise and improve speech accuracy, allowing people to have an optimized Cortana experience.\nFor a better Windows 10 audio and visual experience, the Aspire R 14 and Aspire Z3-700 feature Acer TrueHarmony Plus technology with Dolby® Audio, providing powerful audio with immersive surround. Both devices also ship with Acer BluelightShield, with four professionally tuned modes to choose from, which can effectively reduce eye strain by reducing blue light emission from the screen.\nIn addition, Acer demonstrated the Liquid Jade Primo smartphone, since revealing it by showcasing Continuum on Windows 10 at IFA 2015. The 5.5-inch smartphone with Windows 10 mobile provides ultimate productivity for professionals through Continuum, allowing Windows 10 universal apps to provide a PC-like experience when the device is connected with a secondary display.\nUltimate Flexibility with the Aspire R 14\nThe Aspire R 14 has evolved with a new hairline-brush metallic finish, diamond-cut edge design, and a thinner 360-degree dual torque hinge for incredible flexibility between four usage modes. When paired with Continuum, this helps people switch easily between PC and tablet mode. People can maximize productivity with the most efficient method of keyboard input in classic Laptop mode, and switch to Display mode by hiding the keyboard at the back or laying 180 degrees flat, ideal for collaborating, sharing and entertainment. Converting to Tent mode gives users the option to use in a confined space, while a masterfully-crafted magnet design allows the device to be fully converted into Tablet mode – without any gaps whatsoever.\n\"The new lineup of Acer Aspire devices show the versatility of the latest Intel processors,\" said Kirk Skaugen, Senior Vice President and General Manager, Client Computing Group, Intel. \"Leveraging the power of Intel technology, these new devices are thin, light, fast and perfectly suited for productivity and entertainment at home or on the go.\"\nAt only 18.5mm thin and weighing in at just 1.9kg, the Aspire R 14 incorporates 6th Gen Intel® Core processors, up to 8GB DDR3L system memory, and SSD storage for powerful performance both at home or on the go. For faster connection speeds, the new Aspire R 14 includes MU-MIMO wireless technology, allowing up to three times faster downloads compared to other 802.11ac products, especially in crowded networks.\nAn All-in-One Made to Move, the Aspire Z3-700\nThe new Aspire Z3-700 all-in-one PC features a built-in battery that will last for 5 hours, allowing consumers to perform desktop productivity or entertainment tasks anywhere around the house. The 17.3-inch Aspire Z3-700 has a chassis of just 15.6 mm slim and 2 kg light, while two kick stands allow it to stand or lay flat like a jumbo tablet.\nPowered by Intel® Pentium® or Celeron® processors, up to 8GB of DDR3L system memory, and SSD or HDD storage options , the Aspire Z3-700 provides ample performance for infotainment tasks. It features a Full HD (1920 x 1080) 10-point capacitive multi-touch screen, which also supports input via a dedicated stylus for even more precise control.\nPricing and Availability\nThe Acer Aspire R 14 will be available in North America in late October with prices starting at US$699, in EMEA in late October with prices starting at 799.\nThe Acer Aspire Z3-700 will be available in EMEA by the end of the year with prices starting at 599.\nExact specifications, prices, and availability will vary by region. To find out about availability, product specifications and prices in specific markets, please contact your nearest Acer office or retailer via http://www.acer.com .\nThe new products were unveiled today at Acer’s Windows 10 press event in Taipei, where the company demonstrated how its latest Windows 10 devices change the way people interact and connect with the world. To learn more on why Windows 10 works better on Acer devices, please visit acer.com/readytosense .\nSpecial Promotions for U.S. Customers\nIn addition, several special offerings in the United States give customers a discount on new configurations in Acer’s most popular lines with Windows 10. The special offerings will be available Oct 12-18 through the Acer Store and include the following:\n The Acer Switch 11 V model SW5-173-65R3 is a 2-in-1 notebook PC with an 11.6-inch display that can be removed from the keyboard to be used in four different modes. This model has a full HD 1920x1200 display and is powered by an Intel Core M-5Y10c processor. Normally priced at $649, the Acer Switch 11 SW5-173-65R3 will be discounted $100 to only $549. The Aspire V3-574TG-749V notebook PC has a premium aluminum cover with nano-imprint patterning technology for a stylized texture that looks and feels great. It comes equipped with a spacious backlit keyboard and 5th generation Intel Core i7-5500U Processor. This model, normally priced at $899, will be discounted $100 to only $799. The Aspire R 13 R7-371T-70NY convertible notebook features the innovative Ezel Aero hingeTM with a U-frame structure which lets users fold it into six usage modes quickly and smoothly. This model, normally priced at $1499, will be discounted $200 to just $1299.\nAbout Acer\nEstablished in 1976, Acer is a hardware + software + services company dedicated to the research, design, marketing, sale, and support of innovative products that enhance people's lives. Acer's product offerings include PCs, displays, projectors, servers, tablets, smartphones, and wearables. The company is also developing cloud solutions to bring together the Internet of Things. Acer employs 7,000 people and ranks No. 4 for total PCs globally (IDC 2014). Revenues for 2014 reached US$10.39 billion. Please visit http://www.acer.com for more information.\n© 2015 Acer Inc. All rights reserved. Acer and the Acer logo are registered trademarks of Acer Inc. Other trademarks, registered trademarks, and/or service marks, indicated or otherwise, are the property of their respective owners.\n //www.prweb.com/releases/2015/10/prweb13016218.htm\n ", "external_links": ["http://us-store.acer.com/offers/windows-10x10-deals", "http://acer.com/readytosense", "http://www.prweb.com/releases/2015/10/prweb13016218.htm"], "published": "2015-10-12T10:02:00.000+03:00", "crawled": "2015-10-12T11:38:54.623+03:00", "highlightTitle": ""}