{"organizations": [], "uuid": "eaf7f616f7b138b94ea6e68c49bd9b807d649569", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1142022/vmax-smartplan-gives-advisors-new-view-into-1-6-billion-plan-participants-assets", "country": "US", "title": "VMAX SmartPlan Gives Advisors a New View Into $1.6 Billion in Plan Participants' Assets", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "VMAX SmartPlan Gives Advisors a New View Into $1.6 Billion in Plan Participants' Assets", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T15:40:00.000+03:00", "replies_count": 0, "uuid": "eaf7f616f7b138b94ea6e68c49bd9b807d649569"}, "author": "admin", "url": "http://www.freshnews.com/news/1142022/vmax-smartplan-gives-advisors-new-view-into-1-6-billion-plan-participants-assets", "ord_in_thread": 0, "title": "VMAX SmartPlan Gives Advisors a New View Into $1.6 Billion in Plan Participants' Assets", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Submitted by admin on 10/19/2015 @ 5:40 AM Companies mentioned in this article: vWise Inc. \nALISO VIEJO, Calif., Oct.19, 2015 /PRNewswire/ -- vWise Inc. , announced today that VMAX SmartPlan, its proprietary digital retirement plan engagement software platform, can help recordkeepers and third party administrators (TPAs) deliver comprehensive information to plan advisors on approximately $1.6 billion in participants' assets held outside their current qualified plan. The assets, including former employers' 401(k) plans, IRAs, CDs and bank and brokerage accounts, were self-reported by participants using SmartPlan. With access to an individual's complete financial portfolio, advisors can now deliver more personalized and targeted financial advice to help improve long-term financial results. \nLogo - http://photos.prnewswire.com/prnh/20151016/277927LOGO \nFor years, recordkeepers, TPAs and financial advisors have had limited views into the individual assets held outside the plans they administer and/or advise. The lack of a robust view of household assets has significantly hampered the ability of service providers to deliver more accurate, personalized, and targeted financial advice to help improve participant outcomes. \nSmartPlan's rich, interactive experience is the first digital retirement plan solution that captures information about each employee's total financial assets, as well their expected risk tolerance and target retirement date, and uses this data to deliver a customized online education, engagement, and enrollment experience. Information about each participant's financial portfolio and investment preferences is reported to plan sponsors and advisors associated with each plan. Advisors can now use this detailed insight into each participant's financial situation to create a targeted plan around current assets, optimize their business, and maximize time with each client. \n\"SmartPlan's ability to accurately capture employees' self-reported information about their outside assets is a breakthrough development for advisors, recordkeepers and TPAs,\" said Tony Mingo, President and CEO of vWise. \"Previously unavailable to service providers, the comprehensive and valuable information about each participant's total financial situation arms advisors to efficiently and cost-effectively bring participant advice to the level that, until now, has been reserved for only the most senior executives of American companies,\" he added. \nAbout VMAX SmartPlan Based on the principles of behavioral finance, VMAX SmartPlan is a comprehensive employee engagement solution that works seamlessly with a 401(k) plan provider's existing online presence, print, technology, tools and human resources staff. It delivers information in digestible, familiar formats for participants at all levels of reading comprehension and investment sophistication, thereby taking the guesswork and fear out of the education, enrollment and decision-making processes. \nAbout vWise vWise Inc. is a creator of software and solutions for the employee benefits industry. vWise's award-winning VMAX Solutions are a digital integrated communication ecosystem for the defined contribution market that maximize operational efficiency and increase effectiveness and profitability. VMAX Solutions include SmartPlan, the industry's most advanced platform for participant education, enrollment and analytics. \nFor more information, contact:", "external_links": [], "published": "2015-10-19T15:40:00.000+03:00", "crawled": "2015-10-19T16:38:26.498+03:00", "highlightTitle": ""}