{"organizations": [], "uuid": "3bd920d1cedf2c1850e9858c42bec7cbd2e69664", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.menafn.com", "main_image": "http://www.menafn.com/updates/pr/2015-10/AN_fab375742file231445607578079900200.jpg", "site_section": "http://www.menafn.com/rss/menafn_Comm_Tech_Technologies.xml", "section_title": "MENAFN.com Comm_Tech_Technologies", "url": "http://www.menafn.com/1094396424/We-create-jobs-in-US-Qatar-Airways-boss-says&src=RSS", "country": "", "title": "We create jobs in US Qatar Airways boss says", "performance_score": 0, "site": "menafn.com", "participants_count": 1, "title_full": "We create jobs in US Qatar Airways boss says | MENAFN.COM", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "3bd920d1cedf2c1850e9858c42bec7cbd2e69664"}, "author": "Arab News", "url": "http://www.menafn.com/1094396424/We-create-jobs-in-US-Qatar-Airways-boss-says&src=RSS", "ord_in_thread": 0, "title": "We create jobs in US Qatar Airways boss says", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(MENAFN - Arab News) DOHA: Qatar Airways CEO Akbar Al-Baker said his company is helping to create jobs in the US despite an ongoing war of words between Gulf and American carriers. \n\nAl-Baker speaking in Doha also said he trusted American regulators to put passengers' interests first as part of their investigation into the funding of the Gulf carriers. \nUS carriers have launched a complaint that Qatar Airways Etihad and Emirates break the so-called 'Open-Skies' agreement through receiving government subsidies. \nThe complaint is being investigated by the US departments of state commerce and transportation. \nThree US airlines Delta American and United claim that Qatar along with Etihad Airways and Emirates received 42 billion (37 billion euros) in 'unfair' subsidies to wrest business away from competitors. \nBaker though said his company is good for America. \n'Qatar Airways and the other Gulf carriers are constantly creating new jobs for the Americans by ordering more aeroplanes and expanding our network as we add frequencies into the United States' he told reporters. \n'We are also creating additional jobs and contributing to the American economy.' \nAsked what he thought the outcome of the Washington investigation would be Baker replied: 'I am not person that should answer this question... it's entirely up to the American administration.' \nBut he added that he had faith in the regulators. \n'The American administration is evaluating all the complaints of the three American carriers and the decision will be with the American administration' he said. \n'The American administration at the end will see what is in the best interest of the American public and not in the best interest of the three American carriers.' \nThe outspoken Al-Baker who earlier this year accused American competitors Delta of flying 'crap' older planes was speaking at an event to mark the launch of his company's first direct flights from Doha to Morocco. \nHe also said Qatar Airways would receive 11 new planes in the next two months.", "external_links": [], "published": "2015-10-23T03:00:00.000+03:00", "crawled": "2015-10-24T13:53:37.806+03:00", "highlightTitle": ""}