{"organizations": [], "uuid": "82fa89a24119dd37d501db69004431bcf274675a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.retailtechnologyreview.com", "main_image": "", "site_section": "http://www.retailtechnologyreview.com/feed.rss", "section_title": "Retail Technology Review  RSS Feed", "url": "http://www.retailtechnologyreview.com/articles/2015/10/07/box-technologies-enhances-instore-customer-engagement-with-cielo-tablets/", "country": "GB", "title": "Box Technologies enhances instore customer engagement with Cielo tablets and Cielo mOve docking station", "performance_score": 0, "site": "retailtechnologyreview.com", "participants_count": 1, "title_full": "Box Technologies enhances instore customer engagement with Cielo tablets and Cielo mOve docking station", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T11:57:00.000+03:00", "replies_count": 0, "uuid": "82fa89a24119dd37d501db69004431bcf274675a"}, "author": "Retail Technology Review", "url": "http://www.retailtechnologyreview.com/articles/2015/10/07/box-technologies-enhances-instore-customer-engagement-with-cielo-tablets/", "ord_in_thread": 0, "title": "Box Technologies enhances instore customer engagement with Cielo tablets and Cielo mOve docking station", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Send to friend \nBox Technologies reports that it is transforming the in-store customer experience with the launch of its Cielo mobile tablets and Cielo mOve docking system. \nDesigned to create a seamless in-store experience, the compact point of sale device gives retailers and other customer-facing organisations the flexibility to engage and interact with consumers throughout the sales process. This will provide an effective and flexible point of sale alternative to existing tablets, fixed tills as well as information points. \n\"The Cielo mOve re-imagines what a tablet and docking station should be,\" said Box Technologies Marketing Director Raj Parmar. \"Rather than having a single bank of till points where all customers need to queue, the detachable tablets and docking stations can be distributed around the store. This will help eliminate queues during busy periods and give customers the option to be served in more locations.\" \nDesigned to support both 8\" and 10\" Cielo Mobile Tablets, the new Cielo mOve MCX-100 and MCX-300 bring a new dimension and meaning to customer service. Staff are able to assist customers, whether they want to browse, review choices or purchase and pay. \nAs well as serving as point of sale and information devices, the detachable Cielo Mobile Tablets empower customer-facing staff with information about products and promotions. Advanced long-range WiFi and Bluetooth are available alongside near-field communications (NFC) – which allows for reading and writing of RFID tags such as loyalty cards, as well as pairing devices. \nThe docking solution features a secure lock and charge function with a sleek design which complements each store's unique environment. The ruggedised construction of the Cielo Mobile Tablet is able to withstand wear and tear, making it suitable for retail, showrooms, hospitality, travel agents, retail-banking, estate agents, VIP lounges, education and many other settings. \nThe Cielo mOve docking stations and Cielo Mobile Tablets act as a complete point of sale solution, providing mobile clienteling and fixed POS at a similar total cost of ownership as a traditional sales device. The Cielo Mobile Tablet serves as the screen and processor, while the Cielo mOve MCX-300 docking station allows connectivity for a range of peripherals such as scanners, cash drawers, customer displays and fingerprint readers. \nRunning a full version of Windows, the Cielo Mobile Tablet makes it easy to mobilise existing legacy retail and point of sale applications. This slashes the total cost of integration compared to developing new software for alternative tablet operating systems, making the Cielo Mobile Tablet a truly multi-functional device. \nThe tablets are also built with commercial settings in mind, featuring robust Gorilla Glass touch screens, dust and waterproof with the ability to withstand a one metre drop. This gives them greater longevity without the requirement for cumbersome covers or bulky components. Organisations also have the option to lock the tablets to the dock for removal by authorised staff. \n\"In our experience, many retailers and other organisations are put off by industrial-looking tablets,\" added Parmar. \"Conversely, regular consumer tablets are often easily broken and at risk of theft. The stylish design of the robust Cielo Mobile Tablets and Cielo mOve with its secure docking function gives peace of mind while complementing retail, hospitality and customer-facing settings.\"", "external_links": [], "published": "2015-10-07T11:57:00.000+03:00", "crawled": "2015-10-13T22:04:52.234+03:00", "highlightTitle": ""}