{"organizations": ["BST"], "uuid": "609262e362e2638cd59b2bd8b9db0caca91971d0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "http://yospace-cds1.reuters.com/u/resize~ad1~1200/0/f/~image_jpeg~9999-1/1/m/d/8/o/c/en8o/reuters04?videoId=112425448", "site_section": "http://uk.reuters.com/rssVideo?videoChannel=6", "section_title": "Reuters Video: Technology", "url": "http://uk.reuters.com/video/2015/10/09/scientists-probe-elephant-genes-for-canc?videoId=365883658&feedType=VideoRSS&feedName=Technology&videoChannel=6", "country": "IL", "title": "Scientists probe elephant genes for cancer clues", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "Scientists probe elephant genes for cancer clues", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T17:33:00.000+03:00", "replies_count": 0, "uuid": "609262e362e2638cd59b2bd8b9db0caca91971d0"}, "author": "", "url": "http://uk.reuters.com/video/2015/10/09/scientists-probe-elephant-genes-for-canc?videoId=365883658&feedType=VideoRSS&feedName=Technology&videoChannel=6", "ord_in_thread": 0, "title": "Scientists probe elephant genes for cancer clues", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Scientists probe elephant genes for cancer clues 3:33pm BST - 01:36 \nAs dozens of circus elephants prepare to retire at a Central Florida preserve, researches are studying their genes believed to be key to the species' low incidence of cancer. Zach Fagenson reports. ▲ Hide Transcript ▶ View Transcript \nSTORY: These elephants have spent their lives entertaining crowds across the United States. But now they are part of a research initiative examining the genetics of cancer. At a 200 acre property in Florida scientists are taking a closer look at a gene called P53 which is believed to play an important role in preventing cancer growth. Elephants are thought to have 20 sets of the gene while humans only have one. (SOUNDBITE) (ENGLISH) DR. WENDY KISO, RINGLING BROTHER CENTER FOR ELEPHANT CONSERVATION, SAYING: \"We're doing research on the P53 gene that helps to get to know how elephant has more copies of the gene and they have a low prevalence of cancer so by using that mechanism and learning from the elephants we hope to help children with cancer.\" The researchers say the abundance of gene P53 in elephants may be one reason why only 15 percent of elephants studied develop cancer compared to much higher rates in humans. For the Ringling Brothers company, which owns dozens of elephants, the decision to retire them from circus life ends more than a century of tradition. (SOUNDBITE) (ENGLISH) KENNETH FELD, CEO, FELD ENTERTAINMENT, SAYING: \"And the decision was made and I must say it was a bittersweet decision because there have been a lot of let's say vocal chorus and a lot of legislation that really didn't enable us to care for an manage our elephants on a consistent basis.\" But what it may enable is giving these elephants a new role, one in which they may not be entertaining children under the big top, but possibly giving clues to scientists to combat cancer in the future. Press CTRL+C (Windows), CMD+C (Mac), or long-press the URL below on your mobile device to copy the code http://reut.rs/1Zl8UXw", "external_links": [], "published": "2015-10-09T17:33:00.000+03:00", "crawled": "2015-10-09T21:39:13.754+03:00", "highlightTitle": ""}