{"organizations": [], "uuid": "235aa6434673d62b528e6a76eb5d38c7cfb07142", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.govtech.com", "main_image": "", "site_section": "http://www.govtech.com/rss/app_rss", "section_title": "Government Technology", "url": "http://www.govtech.com/dc/articles/Can-Cities-Crowdsource-the-Chief-Data-Officer-Position.html", "country": "US", "title": "Can Cities Crowdsource the Chief Data Officer Position?", "performance_score": 0, "site": "govtech.com", "participants_count": 1, "title_full": "Can Cities Crowdsource the Chief Data Officer Position?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T10:00:00.000+02:00", "replies_count": 0, "uuid": "235aa6434673d62b528e6a76eb5d38c7cfb07142"}, "author": "Jason Shueh", "url": "http://www.govtech.com/dc/articles/Can-Cities-Crowdsource-the-Chief-Data-Officer-Position.html", "ord_in_thread": 0, "title": "Can Cities Crowdsource the Chief Data Officer Position?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Digital Counties Can Cities Crowdsource the Chief Data Officer Position? The city of Long Beach, Calif., is launching an experiment to crowdsource three open data services typically conducted by an official chief a data officer. by Jason Shueh / October 26, 2015 Long Beach Mayor Robert Garcia inspects the Code for America app Address IQ that analyzes 911 calls to detect super users, callers with a high volume of costly emergency calls. Flickr/Code for America \nIn the rush to enact open data policies and dive into innovation projects, cities are seriously considering the value of chief data officers — and officials in Long Beach, Calif., are no different. But the city is taking a different approach: crowdsourcing. \nThe chief data officer role is an emerging one, encapsulated in a trichotomy of technical expertise, internal strategizing and community engagement. For cities, chief data officers often oversee the nuances in analytics projects and open data policies, coordinate department data initiatives, and vet potential tech partnerships in the private sector. For citizens, the role is most visible in their advocacy for civic apps and volunteer expertise. RELATED California Lawmaker Pushes for State Chief Data Officer \nMajor metropolitan cities often have them; San Francisco, New York, Chicago and Philadelphia are among this lot. They’re even at the state and federal levels too. \nBut despite the rise to prominence, there is unspoken majority of midsize to smaller jurisdictions still evaluating the cost-benefit ratios. \nIn Long Beach, where Mayor Robert Garcia has probed avenues to expand civic tech and open data, CIO Bryan Sastokas said the coastal city has opted to experiment with crowdsourcing — it intends to test whether members of its community can deliver on three duties of the chief data officer role: \n1. Identifying high-value data that benefits citizens; \n2. Supporting the cleaning and formatting of open data; and \n3. Presenting open data insights to citizens via mobile and Web apps. \n“I’m part of a municipality, we’re not really data wonks here,\" Sastokas said. \"But if other people can help, we’ll gladly publish data, we’ll gladly put it in the right area.\" \nAt more than 470,000 residents, Long Beach is a sizable city; however, it doesn’t have the numbers of cities like New York and the city and county of San Francisco. Nor does it pretend to have the same commercial composition of a tech hotbed like the Silicon Valley. So the question was whether the position, which costs at or above six figures, would be worth it. \nIn the short term, Sastokas said that answer is no, especially when factored against the city’s current tech initiatives that can spur part of the role’s crowdsourcing support. \nLong Beach, in partnership with Los Angeles County, hosts a series of innovation weeks to engage the local community. There are civic hackathons to drive apps, and Sastokas said a Long Beach Redevelopment Agency facility renovation will establish an open data and civic innovation space for civic hackers to collaborate. This support system will be coupled with an innovation site on Longbeach.gov to offer data updates and receive input. \nApart from these initiatives, Long Beach is well into a civic tech partnership with Bloomberg Philanthropies that awarded the city $3 million to install its own Innovation Team (i-Team), funded as an in-house research and development unit for three years to support economic development. A development team from the San Francisco-based civic tech group Code for America is also expected to partner with officials in January to complement the city’s economic work and launch an open data portal. \nSastokas said the data officer experiment will be a first for the city, and there are no expectations. If results are positive, Long Beach will scale the practice. The crowdsourced data position could also be packaged as a model for smaller and similarly sized cities. \n“I really hope that the community embraces this type of approach,” Sastokas said. “Because really we’re not going to lose anything if they don’t, but we have so much to gain if they do.” \nThe foreseeable barrier to the city’s plans might be crowdsourcing incentives. To cultivate ongoing crowdsourcing, the community will require ongoing outreach. Likewise, responsiveness to citizen suggestions and requests may need to be heightened. For example, participants contributing input may quickly disengage if feedback isn’t heeded quickly, data isn’t published or transparency falters. \nAdditionally, speed and efficiency aren’t likely to compare with a staffed position. Chief data officers toil in policy work and eliminating red tape, and can assign data leads in departments to bolster open data use and publishing. \nWhat the crowdsourced data officer may be, though, is a low-stakes option for cities to find data services that wouldn’t be had otherwise. Equally, it could act a way to test-drive such functions before investing in a full-time position. \nSastokas said he believes the civic tech community’s work for the public good may be an initial driver. But he guessed local entrepreneurship may be a big influencer as well, especially if new city data can stimulate business. On this front, Long beach is already partnering with procurement specialist Citymart to open its own contracts up to startups, and it has expedited its business license application process with the aid of Open Counter, a startup assisting cities with easy business registration. \nWhatever results from the attempt, Sastokas said he’s optimistic about the endeavor and eager to test its merits. \n“If it's successful,” Sastokas said, “it will just show the value of a collective and engaged society.” Jason Shueh | Staff Writer \nJason Shueh is a staff writer   magazine. His articles and writing have covered numerous subjects, from minute happenings to massive trends. A San Francisco Bay Area native, Shueh grew up in the east bay and Napa Valley, where his family is based. His writing has been published previously in the Tahoe Daily Tribune , Amazon Publishing , Bike Magazine , Diablo Magazine , The Sierra Sun , Nevada Appeal , The Union and the North Lake Tahoe Bonanza .", "external_links": [], "published": "2015-10-26T10:00:00.000+02:00", "crawled": "2015-10-26T22:38:12.860+02:00", "highlightTitle": ""}