{"organizations": ["DOD"], "uuid": "9b7693c0762c96a7e297129bc3abc91605f13e78", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fcw.com", "main_image": "", "site_section": "http://fcw.com/rss-feeds/all.aspx", "section_title": "FCW: The business of federal technology", "url": "https://fcw.com/articles/2015/10/05/key-defense-markets.aspx", "country": "US", "title": "DOD looks to predict key defense markets", "performance_score": 0, "site": "fcw.com", "participants_count": 0, "title_full": "DOD looks to predict key defense markets", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T22:13:00.000+03:00", "replies_count": 0, "uuid": "9b7693c0762c96a7e297129bc3abc91605f13e78"}, "author": "", "url": "https://fcw.com/articles/2015/10/05/key-defense-markets.aspx", "ord_in_thread": 0, "title": "DOD looks to predict key defense markets", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Sean Lyngaas"], "text": "DOD looks to predict key defense markets By Sean Lyngaas Oct 05, 2015 \nJerry McGinn, principal deputy director at the Office of the Secretary of Defense. \nThe Defense Department should take a \"more proactive and predictive approach\" to identifying key technologies in the defense industrial base for growth, a Pentagon official said Oct. 5. DOD would do well to use business intelligence and analytics to chart the courses of critical industries to figure out if those trajectories align with national security interests, said Jerry McGinn, Principal Deputy Director in the Office of the Undersecretary of Defense for Acquisitions, Technology and Logistics. \nThe impetus behind the latest iteration of acquisition reform led by McGinn's boss, Undersecretary Frank Kendall, is a fear that the United States is losing its edge in defense technology to competitors such as China and Russia. But not all of this anxiety is reserved for the acquisition system itself -- some extends to the technologies being churned out by defense firms. \nMcGinn singled out microelectronics as one of several \"fragile and critical\" sectors that his office has examined, noting that there is only one major domestic producer of microelectronic chips. Electronic warfare is another critical sector on his radar. \nMcGinn's remarks at the Heritage Foundation coincided with Kendall's release of the annual Performance of the Defense Acquisition System report , which noted broad progress in cutting cost growth on major defense programs. \nBut it was not all good news. \"There is evidence that we have been pursuing less complex systems with about the same or less risk since 2009,\" Kendall wrote in the report's foreword. \"This aligns with my concern that in some areas we may not be pushing the state-of-the-art enough in terms of technical performance. This endangers our military technical superiority.\" \nNot all cost growth is bad, Kendall went on, adding that it is difficult with available records to \"distinguish cost growth that is due to overly optimistic planning or poor execution from cost growth that is due to needed design changes that address evolving threats, technological opportunities or other prudent factors.\" \nThe report also took aim at defense spending caps, citing a study from the Institute for Defense Analyses that found a correlation between high acquisition costs and stringent budget environments. About the Author \nSean Lyngaas is an FCW staff writer covering defense, cybersecurity and intelligence issues. Follow him on Twitter: @snlyngaas", "external_links": [], "published": "2015-10-05T22:13:00.000+03:00", "crawled": "2015-10-06T11:30:13.476+03:00", "highlightTitle": ""}