{"organizations": [], "uuid": "8c9a89e098368b19668a2c0ca15e74eddf1ba55e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266385/technology-general", "section_title": "Technology Press Releases from PRWeb - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30343440/social-media-marketing-workbook-review-program-ends-october-31-announces-jm-internet-group", "country": "US", "title": "Social Media Marketing Workbook Review Program Ends October 31, Announces JM Internet Group", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Social Media Marketing Workbook Review Program Ends October 31, Announces JM Internet Group - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T10:11:00.000+02:00", "replies_count": 0, "uuid": "8c9a89e098368b19668a2c0ca15e74eddf1ba55e"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30343440/social-media-marketing-workbook-review-program-ends-october-31-announces-jm-internet-group", "ord_in_thread": 0, "title": "Social Media Marketing Workbook Review Program Ends October 31, Announces JM Internet Group", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The new Social Media Marketing Workbook has enjoyed intense readership interest. The innovative no cost review program will end, however, on October 31, 2015.\nSan Jose, CA (PRWEB) October 25, 2015\nThe JM Internet Group is issuing an alert on its blog and via online press release that the no cost book review program for the Social Media Marketing Workbook ends on October 31, 2015. Current promotional pricing of 99 cents for the Kindle edition, and just $8.25 for the paperback will end on that date. Prices will rise to $9.99 for the Kindle edition and $31.50 for the paperback effective November 1, 2015.\n“Our promotional pricing and our review program have been great successes for the social media book,” explained Dr. McDonald, Director of the JM Internet Group. “Interested parties can still get the book at no cost by taking our online courses in social media marketing, or acting before the October 31, 2015, deadline to participate in the review program.”\nTo learn more about the Social Media Marketing Workbook and request a review copy by October 31, 2015, please visit https://www.jm-seo.org/?p=2667 or on Amazon at http://bit.ly/smmworkbook for promotional pricing.\nInnovative Review Program for the Social Media Marketing Workbook\nThe Social Media Marketing Workbook is a first edition of ideas, tactics, tips, and tools used by Jason McDonald in his online classes as well as classes in the San Francisco Bay Area, including Stanford Continuing Studies. The reality, however, is that few people outside the San Francisco Bay Area were aware of Dr. McDonald's innovative techniques in social media marketing. By completing the book this summer and launching it on Amazon, Dr. McDonald sought to reach a wider audience of small business marketers and owners who want to understand how to market on Facebook, Twitter, YouTube, Pinterest and other social media networks. The no cost review program made this even more powerful, as participants could get no cost review programs on the website, or buy it on Amazon at deeply discounted promotional pricing. However, this program must end on October 31, 2015, so that the book can become revenue positive for the JM Internet Group.\nAbout JM Internet Group\nThe JM Internet Group of San Jose, California, provides SEO training online at https://www.jm-seo.org/ as well as courses in social media marketing and Google AdWords as well as consulting services. The classes are hands-on, delivered over the Internet, and available for one year to paid students. Its director, Jason McDonald, is a recognized expert in online marketing, with a Ph.D. from the University of California, Berkeley, and many of the top selling books on Amazon on the subject.\nMedia Relations, Tel. 800-298-4065\n //www.prweb.com/releases/book/social-media/prweb13023313.htm\n ", "external_links": ["http://www.prweb.com/releases/book/social-media/prweb13023313.htm", "https://www.jm-seo.org/", "http://bit.ly/smmworkbook", "https://www.jm-seo.org/?p=2667"], "published": "2015-10-25T10:11:00.000+02:00", "crawled": "2015-10-25T09:59:06.997+02:00", "highlightTitle": ""}