{"organizations": [], "uuid": "21c701cfb26cc944f89546e8dff637c92e6adf87", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.techradar.com", "main_image": "http://cdn.mos.techradar.com/art/laptops/HP/Elite%20x2/HP%20Elite%20x2-11-1200-80.jpg", "site_section": "http://www.techradar.com//rss/reviews", "section_title": "TechRadar: Technology reviews", "url": "http://www.techradar.com/us/reviews/pc-mac/tablets/hp-elite-x2-1011-1300493/review?src=rss&attr=all", "country": "GB", "title": "Review: HP Elite x2 1011", "performance_score": 0, "site": "techradar.com", "participants_count": 1, "title_full": "Review: HP Elite x2 1011", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T19:23:00.000+03:00", "replies_count": 0, "uuid": "21c701cfb26cc944f89546e8dff637c92e6adf87"}, "author": "Juan Martinez", "url": "http://www.techradar.com/us/reviews/pc-mac/tablets/hp-elite-x2-1011-1300493/review?src=rss&attr=all", "ord_in_thread": 0, "title": "Review: HP Elite x2 1011", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "HP Elite x2 1011 review HP Elite x2 1011 review A strong hybrid for tough environments Shares Comments Our Verdict \nThis isn't a bad hybrid if you need a portable device that can handle harsh environments. It has a stellar battery than can run for almost 8 hours. However, if you need something that can do more than web browse, you might want to look elsewhere. The Elite's Core M chip won't be able to perform on par with hybrids that run a Core i processor. For Verdict \nThe HP Elite x2 1011 (starting at $688, £437 and AU$800) is a business-grade hybrid laptop that is ideally suited for those who need durability and portability more than they require high-end performance and beauty. \nCompeting in the same class as the popular consumer hybrid, the Microsoft Surface Pro 3 , and the business-focused Dell Venue 11 Pro 7000 , the HP Elite x2 1011 is a capable device that can satisfy you as both a tablet and as a laptop. \nUnfortunately, in order to make this ultra-durable hybrid work in multiple form factors, sacrifices had to be made on both ends. As a result, you're getting a versatile and rock-solid machine that won't excel as a laptop or as a tablet. Design \nBuilt with a bead-blasted aluminum shell that can be found on the entire HP Elite lineup, the Elite x2 is noticeably heavier and thicker than the Surface Pro 3 and the Venue 11 Pro. Starting at 3.63 pounds (1.65kg) when attached to its accompanying power keyboard, and 1.71 pounds without a keyboard, there's no denying the Elite x2 is hefty, both as a tablet and as a laptop. \nFor reference, the Surface Pro 3 and Venue 11 Pro weigh 1.76 pounds (0.72kg) and 1.6 pounds (0.68kg) when attached to their keyboards, respectively. To be fair, neither of those keyboards will add four hours of battery life or USB ports to the device's capabilities, so a few extra ounces is to be expected here. \nAll of the Elite x2's bulk is specifically designed to withstand the rigors of outdoor work environments. The Elite series undergoes 115,000 hours of testing, all of which ensure that the Elite x2 can handle up to 26 drops on each corner and 18 mechanical shocks before it goes kaput. \nThe sturdy outer shell is attached to a magnesium alloy panel that houses the full HD-resolution display (FHD) 1,920 x 1080, which is much too dull and produces too much glare. The screen, which is 11.6 inches, occupies too little of the top panel's 11.73-inch width. As opposed to new devices like the Dell XPS 13, which features almost no screen border, the Elite x2's display is surrounded by a thick section of wasted material. \nCompared to the Surface Pro 3's 2,160x1,440 (FHD+) resolution screen, and the Dell Venue 11 Pro 7000's comparable 1,920x1,080 (FHD) screen, the Elite x2 is noticeably weaker. \nI took this device to the roof of my apartment building to take photographs. With even a hint of sun above the screen I found it difficult to make out colors, let alone text or images. This is a major issue, especially for a device that's so perfectly suited for outdoor and rugged use. \nThe tablet is built with a rounded base that is slightly awkward to handle, but sits nicely when mounted with the keyboard. Even after repetitive jiggles, rocks and shakes, the base showed no sign of give. \nUnfortunately, you won't be able to connect the tablet to the keyboard in the reverse display mode seen on Lenovo Yoga devices. Additionally, the Elite x2 will only bend back 130-degrees when mounted, so you'll have to detach the tablet from the keyboard if you want to do any show-and-tell. \nHowever, when the device sits on the dock, it's there to stay. The sturdy metallic connectors won't pop open unless you absolutely want them to. In order to remove the tablet from the keyboard, you simply press down on the center button and lift. Otherwise, the tablet itself is firmly mounted. \nThe mounting isn't a hindrance. Unlike flimsier hybrids, the hinges on the Elite x2 are both firm and fluid. This means you can press on the touchscreen without worrying about causing the tablet to wobble and wiggle. 1", "external_links": [], "published": "2015-10-08T19:23:00.000+03:00", "crawled": "2015-10-08T20:20:35.569+03:00", "highlightTitle": ""}