{"organizations": ["AmerisourceBergen"], "uuid": "57b3886fbf93291dfd28c5f4a4efe6641bd143a4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pharmaceutical-technology.com", "main_image": "", "site_section": "http://www.pharmaceutical-technology.com/news-rss.xml", "section_title": "Pharmaceutical Technology-Updates", "url": "http://www.pharmaceutical-technology.com/news/newsus-drug-distributor-amerisourcebergen-agrees-buy-pharmedium-25bn-4687242", "country": "", "title": "US drug distributor AmerisourceBergen agrees to buy PharMEDium for $2.5bn", "performance_score": 0, "site": "pharmaceutical-technology.com", "participants_count": 0, "title_full": "US drug distributor AmerisourceBergen agrees to buy PharMEDium for $2.5bn", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T02:00:00.000+03:00", "replies_count": 0, "uuid": "57b3886fbf93291dfd28c5f4a4efe6641bd143a4"}, "author": "", "url": "http://www.pharmaceutical-technology.com/news/newsus-drug-distributor-amerisourcebergen-agrees-buy-pharmedium-25bn-4687242", "ord_in_thread": 0, "title": "US drug distributor AmerisourceBergen agrees to buy PharMEDium for $2.5bn", "locations": ["US"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "US drug distributor AmerisourceBergen agrees to buy PharMEDium for $2.5bn 7 October 2015 \nUS-based drug distributor AmerisourceBergen has signed a definitive agreement to acquire PharMEDium Healthcare Holdings, a compounded sterile preparations (CSPs) provider, from Clayton, Dubilier & Rice for $2.575bn. \nAccording to the company, the acquisition is expected to generate around $30m in synergies by fiscal 2018. \nPharMEDium is a provider of customised outsourced CSPs that meet specific hospital and physician clinical needs and quality standards in formulations that are not otherwise commercially available. \nAmerisourceBergen president and CEO Steven Collis said: \"The acquisition of PharMEDium strengthens our core business and meaningfully expands our innovative service offerings for health systems. \"The acquisition will allow AmerisourceBergen to strengthen its business of supplying compounded drugs to hospitals.\" \n\"PharMEDium is a compelling addition to our business, which allows us to provide differentiated offerings and further increases our ability to drive both value and efficiency for our health systems customers in a way that enhances patient safety and helps improve patient outcomes.\" \nThe acquisition will allow AmerisourceBergen to strengthen its business of supplying compounded drugs to hospitals. \nPharMEDium CEO William Spalding said: \"We are excited about this transaction, which brings together two great brands built on the same strong foundation of patient safety and quality, service excellence and value to our customers.\" \nFollowing completion of the transaction, which is expected in the first quarter of fiscal 2016, PharMEDium will become a part of AmerisourceBergen Drug Corporation. \nThe transaction is subject to regulatory review and other customary closing conditions. \nThe sterile-to-sterile CSPs of PharMEDium are prepared in FDA and state board of pharmacy inspected facilities, using FDA-approved or allowed drugs in finished dosage form and FDA-approved diluents and containers. \nThese CSPs are in a ready to use form with improved safety, labelling, sterility assurance, and extended expiration dating supported by appropriate studies that often exceeds what hospital pharmacies can accomplish on their own. \nPharMEDium maintains four compounding facilities, provides a broad range of 2,000 SKUs and serves more than 3,000 hospital customers across all 50 states. Follow Us:", "external_links": [], "published": "2015-10-07T02:00:00.000+03:00", "crawled": "2015-10-08T08:15:27.234+03:00", "highlightTitle": ""}