{"organizations": [], "uuid": "ca669e526a58c2259e26a660d588dcfc26283729", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/58532/technology", "section_title": "Technology News | Cellphones, Social Media, Internet &amp; Gadgets - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30344435/crews-to-begin-hunt-for-leak-near-sunken-barge-in-lake-erie", "country": "US", "title": "Crews to begin hunt for leak near sunken barge in Lake Erie", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Crews to begin hunt for leak near sunken barge in Lake Erie - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T02:00:00.000+02:00", "replies_count": 0, "uuid": "ca669e526a58c2259e26a660d588dcfc26283729"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30344435/crews-to-begin-hunt-for-leak-near-sunken-barge-in-lake-erie", "ord_in_thread": 0, "title": "Crews to begin hunt for leak near sunken barge in Lake Erie", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By JOHN SEEWER\nAssociated Press TOLEDO, Ohio (AP) - Underwater contractors are being sent to Lake Erie to search for the source of what appears to be a petroleum leak coming from a century-old sunken barge recently found in the water near the U.S.-Canadian border, the U.S. Coast Guard said Sunday.\nShipwreck hunters think the leaking solvent is from a tanker barge that went down near Ohio's Kelleys Island during a storm nearly 80 years ago.\nIt would be a significant discovery if the vessel turns out to be the Argo, one of 87 shipwrecks on the federal registry created two years ago to identify the most serious pollution threats to U.S. waters.\nDivers plan to explore the wreckage on Monday to see if they can find and seal the leak, which appears to involve a colorless, petroleum-based solvent that evaporates quickly once it reaches the surface, said Coast Guard Lt. Cmdr. Anthony Migliorini.\n\"It's going to be a challenging operation for sure,\" said Migliorini, who leads a marine safety unit based on the lake.\nThe Coast Guard is warning boaters to stay away from the area, which is about two miles south of the Canadian border, because it could be dangerous to breathe in the fumes from the solvent.\nDivers with the Cleveland Underwater Explorers first noticed the leak on Friday, and a check using a Coast Guard helicopter confirmed there was an area of discoloration in the water on Saturday that was the length of about four football fields.\nA check of the area on Sunday did not show any signs of the leak, Migliorini said. \"It will not remain in the water long,\" he said.\nWhat officials don't know is whether this is an ongoing leak or exactly what type of cargo was on the barge. The mysterious leak has not affected aquatic life, Migliorini said.\nThe steel barge is about 45 feet below the lake's surface and largely intact. Sonar images show outlines of the pilot house, railings and pipes.\nShipwreck hunter Tom Kowalczk, who lives along the lake, discovered the barge in late August while he was searching for a wooden schooner that sunk in 1845.\nWhile the barge's identity hasn't been confirmed, researchers with the Cleveland Underwater Explorers are almost certain it is the Argo, said Christopher Gillcrist, executive director of the National Museum of the Great Lakes.\nThe barge's measurements match Argo's dimensions as listed in historical records and there are no reports of another tanker barge being lost in the same area, he said.\nThe Argo's exact whereabouts have been unknown since waves toppled it during a storm in 1937 in western Lake Erie - about midway between Toledo and Cleveland.\nShipwreck researcher Jim Paskert said the Argo, built in 1911, was not designed to travel on open water and was operating illegally when it sunk. \"The barge had no business being on the Great Lakes,\" he said.\nThe only two crew members on board were rescued by a tug boat after they stood on its side when it rolled over, he said.\nCopyright 2015 The Associated Press. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-10-25T02:00:00.000+02:00", "crawled": "2015-10-25T20:19:37.447+02:00", "highlightTitle": ""}