{"organizations": [], "uuid": "28ac9b5871385074e35a1cf959a3ceaf318b419a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bio-medicine.org", "main_image": "", "site_section": "http://www.bio-medicine.org/inc/biomed/medicine-technology.asp", "section_title": "Latest Medical Technology from Bio-Medicine.Org", "url": "http://www.bio-medicine.org/medicine-technology-1/Endo-Provides-Update-on-Use-of-Specialty-Pharmacies-49175-1/", "country": "US", "title": "Endo Provides Update on Use of Specialty Pharmacies", "performance_score": 0, "site": "bio-medicine.org", "participants_count": 0, "title_full": "Endo Provides Update on Use of Specialty Pharmacies", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T21:27:00.000+03:00", "replies_count": 0, "uuid": "28ac9b5871385074e35a1cf959a3ceaf318b419a"}, "author": "", "url": "http://www.bio-medicine.org/medicine-technology-1/Endo-Provides-Update-on-Use-of-Specialty-Pharmacies-49175-1/", "ord_in_thread": 0, "title": "Endo Provides Update on Use of Specialty Pharmacies", "locations": ["DUBLIN"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "RSS Navigation Links HOME >> MEDICINE >> TECHNOLOGY Endo Provides Update on Use of Specialty Pharmacies ... DUBLIN Oct. 21 2015 /- A...About Endo International plc Endo International plc (NASDAQ: !-- Paragraph before: This press relea...This press release contains forward-looking statements including but ... http://feeds.bio-medicine.org/latest-medical-technology Date:10/21/2015 \nDUBLIN , Oct. 21, 2015 /PRNewswire/ -- As a result of today's market speculation and inquiries, Endo International plc (NASDAQ: ENDP ) (TSX: ENL) provided an update on the company's use of specialty pharmacies: Endo utilizes specialty pharmacy services primarily for certain physician-administered branded products in the U.S., including: XIAFLEX®, AVEED®, TESTOPEL®, Supprelin® LA, Vantas® and Valstar®. The percentage of the company's projected U.S. Branded 2015 revenues (midpoint of 2015 guidance) that flow through specialty pharmacies is less than 10 percent, which represents approximately 3 percent of the company's projected overall 2015 revenues (midpoint of 2015 guidance). The specialty pharmacies used by Endo are fully independent of the company. Endo does not have any ownership interest in, consolidate financial results of or have affiliations with any specialty pharmacy. \nAbout Endo International plcEndo International plc (NASDAQ: ENDP ) (TSX: ENL) is a global specialty pharmaceutical company focused on improving patients' lives while creating shareholder value. Endo develops, manufactures, markets and distributes quality branded and generic pharmaceutical products as well as over-the-counter medications though its operating companies. Endo has global headquarters in Dublin, Ireland , and U.S. headquarters in Malvern, PA. Learn more at www.endo.com . \nSafe Harbor Statement \nThis press release contains forward-looking statements, including but not limited to statements relating to revenue forecasts and other statements that refer to Endo's expected, estimated or anticipated future results. Because forecasts are inherently estimates that cannot be made with precision, Endo's performance at times differs materially from its estimates and targets, and Endo often does not know what the actual results will be until after the end of the applicable reporting period. \nAll forward-looking statements in this press release reflect Endo's current analysis of existing trends and information and represent Endo's judgment only as of the date of this press release. Actual results may differ materially from current expectations based on a number of factors affecting Endo's businesses, including, among other things, the following: changing competitive, market and regulatory conditions; Endo's ability to obtain and maintain adequate protection for its intellectual property rights; the timing and uncertainty of the results of both the research and development and regulatory processes; domestic and foreign health care and cost containment reforms, including government pricing, tax and reimbursement policies; technological advances and patents obtained by competitors; the performance, including the approval, introduction, and consumer and physician acceptance of new products and the continuing acceptance of currently marketed products; the effectiveness of advertising and other promotional campaigns; the timely and successful implementation of strategic initiatives; the results of any pending or future litigation, investigations or claims; the uncertainty associated with the identification of and successful consummation and execution of external corporate development initiatives and strategic partnering transactions; and Endo's ability to obtain and successfully maintain a sufficient supply of products to meet market demand in a timely manner. In addition, U.S. and international economic conditions, including higher unemployment, political instability, financial hardship, consumer confidence and debt levels, taxation, changes in interest and currency exchange rates, international relations, capital and credit availability, the status of financial markets and institutions, fluctuations or devaluations in the value of sovereign government debt, as well as the general impact of continued economic volatility, can materially affect Endo's results. Therefore, the reader is cautioned not to rely on these forward-looking statements. Endo expressly disclaims any intent or obligation to update these forward-looking statements except as required to do so by law. \nAdditional information concerning the above-referenced risk factors and other risk factors can be found in press releases issued by Endo, as well as Endo's public periodic filings with the U.S. Securities and Exchange Commission and with securities regulators in Canada , including the discussion under the heading \"Risk Factors\" in Endo's 2014 Annual Report on Form 10-K and any subsequent Quarterly Reports on Form 10-Q. Copies of Endo's press releases and additional information about Endo are available at www.endo.com or you can contact the Endo Investor Relations Department by calling 484-216-0000. '/>\"/>", "external_links": [], "published": "2015-10-21T21:27:00.000+03:00", "crawled": "2015-10-22T08:37:39.063+03:00", "highlightTitle": ""}