{"organizations": [], "uuid": "e51979403ea740da6c08f848c445113c778d35cd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1144964/infoblox-enhances-carrier-grade-dns-protection-block-more-attacks-against-service-prov", "country": "US", "title": "Infoblox Enhances Carrier-Grade DNS Protection to Block More Attacks Against Service Providers", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "Infoblox Enhances Carrier-Grade DNS Protection to Block More Attacks Against Service Providers", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T09:01:00.000+02:00", "replies_count": 0, "uuid": "e51979403ea740da6c08f848c445113c778d35cd"}, "author": "admin", "url": "http://www.freshnews.com/news/1144964/infoblox-enhances-carrier-grade-dns-protection-block-more-attacks-against-service-prov", "ord_in_thread": 0, "title": "Infoblox Enhances Carrier-Grade DNS Protection to Block More Attacks Against Service Providers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Submitted by admin on 10/26/2015 @ 12:01 AM   Infoblox \nSANTA CLARA, CA--(Marketwired - October 26, 2015) - Infoblox Inc. (NYSE: BLOX), the network control company, today announced enhancements to its carrier-grade DNS solution portfolio to block more types of attacks against service providers and deliver a better subscriber experience. These attacks can reduce network performance or even disrupt subscriber services, damaging brand reputation and reducing revenue. \nThe Domain Name System (DNS) is tied for first place as the most frequently targeted application-layer service for distributed denial of service (DDoS) attacks, 1 and many service providers experience these attacks on a regular basis. Cybercriminals are also now using DNS to introduce malware and exfiltrate data. \nInfoblox is the industry leader in DNS, DHCP, and IP address management -- the category known as DDI -- and offers a portfolio of products specifically designed to meet the performance and security needs of mobile, cable, broadband, and managed service providers ( http://www.infoblox.com/sp ). \n\"The Infoblox solution helped Cable & Wireless Panama achieve its goal of being number one in customer satisfaction,\" said Hugo Aquino, vice president of customer support for Cable & Wireless Panama. \"Service incidents from DDoS attacks have been cut in half, and customer complaints about lengthy page load times have been significantly reduced. We were so pleased with the performance and manageability of the Infoblox system in our fixed network that we have expanded it to include our mobile network traffic as well.\" \nThe Infoblox 4030 series appliance, the company's most powerful device, can process millions of DNS queries per second with redundant RAID hard disks, hot-swappable power supplies, and hardware-based DNS attack detection and protection. When facing a DDoS attack, the Infoblox 4030 is capable of intelligently detecting the attack, and automatically dropping malicious DNS traffic while letting through legitimate queries. \nNew features for Infoblox carrier-grade appliances address even more DNS threats. Among the improvements are: Distributed NXDOMAIN attack protection. An NXDOMAIN attack sends a flood of queries to a DNS server seeking to resolve a non-existent domain name, a time-consuming process. A distributed NXDOMAIN attack comes from a large number of sources, no one of which might have sufficient volume to trigger typical threat protection rules, making these attacks harder to identify and mitigate. Infoblox now intelligently manages incoming DNS queries to protect against this type of distributed attack, helping to maintain availability for service providers' subscribers. Dual-engine DNS. The Infoblox Dual-Engine DNS feature provides the option to switch between BIND and Unbound DNS resolvers for better protection against vulnerabilities targeting DNS servers. By easily and immediately switching DNS engines, service providers can avoid the impact of a vulnerability facing one of the engines, until that vulnerability is resolved. Enhanced DNS tunneling protection. DNS tunneling attacks can provide cybercriminals with an always-available back channel to exfiltrate stolen data or bypass a service provider's billing system for free access to services such as premium Wi-Fi. With enhanced DNS tunneling, service provider DNS networks can identify and drop malicious tunneling response traffic without impacting legitimate DNS traffic. \n\"Our service provider customers tell us the service degradation and outages caused by DDoS and other DNS attacks are a significant cause of subscriber dissatisfaction and churn. Infoblox is committed to supporting service providers with secure DNS solutions to protect their rapidly evolving networks and growing traffic,\" said Dilip Pillaipakam, vice president of service provider products at Infoblox. \"With these new enhancements, Infoblox can help increase visibility and control across all DNS infrastructure, easing operational costs, increasing manageability, and maintaining the best possible subscriber experience.\" \nAbout Infoblox \nInfoblox (NYSE: BLOX) delivers critical network services that protect Domain Name System (DNS) infrastructure, automate cloud deployments, and increase the reliability of enterprise and service provider networks around the world. As the industry leader in DNS, DHCP, and IP address management, the category known as DDI, Infoblox ( www.infoblox.com ) reduces the risk and complexity of networking. \n1 Arbor Networks, Worldwide Infrastructure Security Report, January 2015 \nForward-looking and Cautionary Statements - Infoblox Certain statements in this release are forward-looking statements, which involve a number of risks and uncertainties that could cause actual results to differ materially from those in such forward-looking statements. As such, this release is subject to the safe harbors created by U.S. Federal Securities Laws. The risks and uncertainties relating to these statements include, but are not limited to, risks that there may be design flaws in the company's products, shifts in customer demand and the IT services market in general, shifts in strategic relationships, delays in the ability to deliver products, or announcements by competitors. These and other risks may be detailed from time to time in Infoblox's periodic reports filed with the Securities and Exchange Commission, copies of which may be obtained from www.sec.gov . Infoblox is under no obligation to (and expressly disclaims any such obligation to) update or alter its forward-looking statements whether as a result of new information, future events, or otherwise.", "external_links": [], "published": "2015-10-26T09:01:00.000+02:00", "crawled": "2015-10-26T10:11:46.064+02:00", "highlightTitle": ""}