{"organizations": [], "uuid": "73d6828804012f348aea307568710d41be70ff19", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.inquisitr.com", "main_image": "http://cdn.inquisitr.com/wp-content/uploads/2015/10/Yahoo-To-Kill-Email-Password.jpg", "site_section": "http://feeds.inquisitr.com/TheInquisitrTechnology", "section_title": "The Inquisitr News » Technology", "url": "http://www.inquisitr.com/2499284/yahoo-kills-email-password-option-what-you-need-to-know-video/", "country": "US", "title": "Yahoo Kills Email Password Option? What You Need To Know [Video]", "performance_score": 0, "site": "inquisitr.com", "participants_count": 1, "title_full": "Yahoo Kills Email Password Option? What You Need To Know [Video]", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T15:51:00.000+03:00", "replies_count": 0, "uuid": "73d6828804012f348aea307568710d41be70ff19"}, "author": "Toni Matthews", "url": "http://www.inquisitr.com/2499284/yahoo-kills-email-password-option-what-you-need-to-know-video/", "ord_in_thread": 0, "title": "Yahoo Kills Email Password Option? What You Need To Know [Video]", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Toni Matthews \nWhy would Yahoo kill the email password option? The company claims the decision is meant to make accounts more secure. Reuters reports that Yahoo is “beefing up cybersecurity” and that password elimination is a major part of this plan. So what does this all mean? Well, there are a few things to know. \nYahoo updates Mail app, intros password-free ‘Yahoo Account Key’ http://t.co/aUtAELzErb pic.twitter.com/X1YZh25By8 \n— Android Community (@androids) October 16, 2015 \nFirst and foremost, it’s important to understand exactly who will be affected by this change and how. Yahoo News (via the Associated Press ) reports that the change is primarily targeted at the company’s email app, which is used by iPhone and Android owners. The “renovated app” was released on Thursday according to the AP . Apparently, nearly half of those who enter passwords to get into Yahoo email accounts do so from a mobile device. This fact makes shoring up security on this front a matter of huge importance for Yahoo. \nIt also means that desktop users apparently aren’t affected by this update. Although, with an increased emphasis on eliminating passwords across the board, it probably won’t be long before computer users are offered similar options. \nYahoo’s New Mail App Features Account Key and Helps you bid Adieu to Passwords http://t.co/dGcRKb95Xh pic.twitter.com/8hBWgi8ks6 \n— Raju (@rajupp) October 16, 2015 \nSecond, the use of an alternative to passwords isn’t mandatory — yet. The new option will let Yahoo email owners use something called an “Account Key.” The email owner will respond to a particular notification to access their Yahoo email rather than type in a password. The company notes that people often create email passwords that are easily guessable to hackers, which leads to a massive security threat. \nIf some aren’t comfortable with this attempt to “kill” the Yahoo password, there’s good news. As of now, the old option to enter one’s password is still available. <noscript><iframe width=\"940\" height=\"529\" src=\"https://www.youtube.com/embed/KVMI7qO4sIc\" frameborder=\"0\" allowfullscreen></noscript> \nThere’s another reason that Yahoo is making such a drastic change to its email app: competition. It’s no secret that Gmail has surpassed Yahoo email and other rivals — such as MSN’s Hotmail — in recent years. The Associated Press wrote that as of August, Yahoo’s email has 119 million users. Gmail? Approximately 411 million. Google handily dwarfs Yahoo in this area, and unless the latter company acts quickly, it will continue to fall behind. \nOffering an advanced security option that doesn’t rely on passwords may give Yahoo a significant edge. At least, until their rivals begin to offer similar (or better) security options. \nYahoo Mail just killed the need for a password: http://t.co/JjwqiAwTXy pic.twitter.com/HcIPX0W6U7 \n— ABC News (@ABC) October 16, 2015 \nLastly, the move by Yahoo signals a shift in thinking (as previously mentioned) across the board about the necessity of passwords. The Inquisitr previously reported that with Windows 10 came the option for some users to forego usage of passwords altogether. Instead, a sort of recognition technology would be used. Also, some apps already allow for mobile phone users to unlock their devices through fingerprint recognition . \nThis type of security has typically been associated with top-notch government facilities and fictional movie accounts in the past. As security breaches become an increasingly regular problem, companies like Yahoo are looking for new ways to protect customers from hacking threats. The move to “kill passwords” seems like an inevitable step in that direction. \nWho knows? Within 10 years, passwords may be absolutely obsolete, and 10 years beyond that, kids may scratch their heads at the idea that anyone ever used passwords to access email addresses — assuming email accounts as we know it are still relevant a couple of decades from now. It just goes to show how much internet users take for granted; we always presume that certain forms of technology will always be around. \nYahoo Mail promises password-free access http://t.co/oHkBSqx4Ce pic.twitter.com/3UMON7A6mg \n— Hardware Newz (@HardwareNewz) October 16, 2015 \nDo you like the plan by Yahoo to “kill” the password option on mobile devices? Should there simply be better password options made available? Share your thoughts below! \n[Image Credit: Photo by Michael Smith/Newsmakers]", "external_links": [], "published": "2015-10-16T15:51:00.000+03:00", "crawled": "2015-10-17T01:06:57.786+03:00", "highlightTitle": ""}