{"organizations": [], "uuid": "3cb9c95c0d3be5fa93c16416c0f1ac48a407451a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "", "site_section": "http://www.prweb.com/rss2/techmobile.xml", "section_title": "Technology: Mobile", "url": "http://www.prweb.com/releases/2015/10/prweb13042131.htm", "country": "US", "title": "Manos Accelerator Announces 5 Startups for Its Fall 2015 Accelerator Class", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Manos Accelerator Announces 5 Startups for Its Fall 2015 Accelerator Class", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T02:00:00.000+02:00", "replies_count": 0, "uuid": "3cb9c95c0d3be5fa93c16416c0f1ac48a407451a"}, "author": "Edward Avila", "url": "http://www.prweb.com/releases/2015/10/prweb13042131.htm", "ord_in_thread": 0, "title": "Manos Accelerator Announces 5 Startups for Its Fall 2015 Accelerator Class", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Manos Accelerator, a startup accelerator with the vision to be recognized as an international hub in Silicon Valley where Latino entrepreneurs from across the globe can come to convert their big ideas into reality, has announced the selected startups that have joined the Manos Accelerator program for the 2015 fall batch. During this last round, a total of five companies were selected from approximately 85 applications received over a 60-day period. After a screening by a selection committee comprised of business and technical leaders in Silicon Valley, a total of five finalists were chosen. The 4th class of startups includes two international companies from Latin America and three from the United States.\nIn the last couple of years, Manos has reviewed over 200 applications of Latino-led early stage tech companies. \"What we are seeing is a wave for impressive Latino technologists and innovators who are creating cutting edge, game changer and technology solutions,” said Sylvia Flores, Co-Founder of Manos Accelerator.\n“We're deeply committed to supporting diverse tech communities and entrepreneurs around the world,” said Mary Grove, Director of Google for Entrepreneurs. “We share Manos’ vision and passion to support a diverse group of amazing founders build innovative companies that will change the world. We’re very excited to help Manos continue to grow as an organization and work with so many talented entrepreneurs to get to the next level.”\nHere are the five startup companies that make up the 4th class and how they describe themselves in alphabetical order:\nAbogadazo (New York, NY) connects Latinos to a network of vetted attorneys and allows clients to ask legal questions and receive answers from attorneys in Spanish.\nAerial Backup (Guadalajara, Mexico) builds customized solutions using Drones to get businesses to the next level.\nAmitee (San Francisco, CA) captures item-level purchase data from consumers, anonymizes it, aggregates it into market insights, and then sells this data to organizations in need of market research.\nMonkier (Mexico City, Mexico) is an on demand service platform that provides a quick and convenient solution to find, schedule and hire the right service for your needs.\nPeople Spread (Palo Alto, CA) provides an automated platform to connect advertisers directly with influencers.\nThe Fall Batch was officially introduced at our Kick-off Reception on October 1st at Galvanize coworking's rooftop in San Francisco, CA. Manos Accelerator is now accepting applications for the 2016 Spring cohort!\nAbout Manos Accelerator\nManos Accelerator, an organization that is supported by Google for Entrepreneurs, is a mentorship-driven accelerator that provides education, resources and guidance for promising startup companies led by Latinos/Latinas. Manos Accelerator works side-by-side with early stage entrepreneurs to enable them to build, launch, and finance their exceptional businesses, while helping to cultivate a more vibrant technology ecosystem among the Latino community. go to http://www.manosaccelerator.com .\nAbout Google for Entrepreneurs\nGoogle for Entrepreneurs provides financial support and the best of Google's resources to dozens of coworking spaces and community programs across 125 countries. We also create Campuses: physical hubs where entrepreneurs can learn, connect, and build companies that will change the world. To learn more about Google for Entrepreneurs, visit http://www.googleforentrepreneurs.com or follow us on G+ (+GoogleForEntrepreneurs) and Twitter (@GoogleForEntrep).\nContact:\nSylvia Flores\nsylvia(at)manosaccelerator(dot)com\nHana Yang\nhana(at)manosaccelerator(dot)com\nWinnie King\npress(at)google(dot)com", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5tYW5vc2FjY2VsZXJhdG9yLmNvbQ==", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5nb29nbGVmb3JlbnRyZXByZW5ldXJzLmNvbQ=="], "published": "2015-10-26T02:00:00.000+02:00", "crawled": "2015-10-26T10:34:13.704+02:00", "highlightTitle": ""}