{"organizations": ["Penn State"], "uuid": "d87cea496895e051ce34103785762a7bb473b799", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.psu.edu", "main_image": "", "site_section": "http://news.psu.edu/rss/college/information-sciences-and-technology", "section_title": "Penn State News - Information Sciences and Technology", "url": "http://news.psu.edu/story/376164/2015/10/20/academics/penn-state-develops-new-technology-create-robot-written-textbooks", "country": "US", "title": "Penn State develops new technology to create robot-written textbooks", "performance_score": 0, "site": "psu.edu", "participants_count": 0, "title_full": "Penn State develops new technology to create robot-written textbooks", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T21:00:00.000+03:00", "replies_count": 0, "uuid": "d87cea496895e051ce34103785762a7bb473b799"}, "author": "", "url": "http://news.psu.edu/story/376164/2015/10/20/academics/penn-state-develops-new-technology-create-robot-written-textbooks", "ord_in_thread": 0, "title": "Penn State develops new technology to create robot-written textbooks", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Katie Jacobs Bohn"], "text": "Penn State develops new technology to create robot-written textbooks Katie Jacobs Bohn October 20, 2015 Penn State develops new technology to create robot-written textbooks \nRobots can do a lot of things. They can play instruments, explore other planets and build cars. And one day soon, they will help us write textbooks. \nPenn State has developed a new technology that works with faculty to automatically build complete textbooks from open resources on the Web according to topics and keywords provided by a user. \nThe system is helping to usher in a new genre of media: the bionic book. \nThe tool, called BBookX, can be used to create many types of media ranging from study guides to textbooks. To begin, users fill in a digital table of contents — assigning each chapter a topic with text or as many related keywords or keyphrases as they’d like. Using matching algorithms, BBookX then returns text within moments, and users can keep the chapters as they are or mix with content of their own. \n“Faculty can create, edit, build upon and distribute textbooks free of charge, helping to make textbooks more open, affordable and up to date,” said C. Lee Giles, David Reese Professor in the College   Technology that helped create the system along with staff from Teaching and Learning with Technology (TLT). “BBookX can also be a powerful learning tool for students — creating their own books gives students a better sense of what they already know and what they still need to learn.” \nGiles says he wanted a way to help make the teaching and learning experience easier for both faculty and students. \n“In any rapidly changing field, such as information sciences and technology and computer science, it’s important that books stay up to date,” Giles said. “I wanted an easy, inexpensive way for faculty and students to have access to the latest knowledge and information.” \nGiles also says BBookX is an example of the synergy of human-assisted computing — it does something that neither a machine nor a human could do on their own. \nTraditionally, computers help people with everyday tasks like searching Google for a certain piece of information or using a calculator to complete a math problem. Human-assisted computing takes advantage of this: people and computers solve problems together. \nIn the case of BBookX, the computer is designed to create a book and has a method on how to do it — all it needs is a person to tell it what the desired content is. \nOne such person is Bart Pursel, an affiliate faculty member in the College of Information Science and Technology, who is using BBookX in his IST 110: Introduction to Information, People and Technology course. He built a textbook using BBookX and distributed it for free, saving the students a combined $16,000. \n“BBookX fit in really nicely with the course — we have to cover a lot, and it was helpful to know the textbook had updated info on everything I planned to teach,” said Pursel. “Plus, the tool was a good way for students to experience what IST is all about.” \nPursel says the tool can also help instructors “rapidly prototype” courses, or think through and evaluate a course before it begins. One way it can do this is through discovery — he says that because the system searches for all kinds of content related to the given keywords, it can help instructors find new information. \n“While building my textbook, I came across subjects and topics I hadn’t known about before,” said Pursel. “I was able to learn something new and then pass that along to my students.” \nBut the students in Pursel’s class won’t just be reading BBookX books; they’ll also be creating them. Because IST 110 is an introductory course, Pursel says a lot of his students come from many different majors, and he has planned a homework assignment that will take an interdisciplinary approach. \n“I’m going to ask them to build a small book about how IST impacts their chosen discipline,” said Pursel. “For example, communications students could create a book that talks about the latest broadcasting technologies.” \n  Kyle Bowen, director of Education Technology Services in TLT, says the students won’t just learn from the information they put in their books, but also from the process itself. \n“BBookX can inspire new experiences for our students,” Bowen said. “The person who learns the most from a textbook is the person who writes it. There are interesting opportunities for lifelong learning when students are able to actively create their own learning materials.” \nBowen says that while these types of assignments indeed create new learning opportunities for students, BBookX also marks the first step into a new genre of Open Educational Resources (OER) — freely accessible and open materials that can be used for teaching, learning and research. BBookX can reduce costs and encourage the use of OER while also introducing new bionic assessments and bionic learning aids. \n“A key challenge in adopting OER is discovering relevant material and publishing it in an accessible format. But using intelligence systems like BBookX can help not only uncover the material, but also provide new delivery options,\" said Bowen. “With BBookX, we’re introducing a new era of media that we haven’t seen before. Now it’s possible to produce accurate and remixable bionic books, created through the combined effort of creative people and intelligent machines.” \nFor more information, visit http://bbookx.psu.edu/. Share this story", "external_links": [], "published": "2015-10-20T21:00:00.000+03:00", "crawled": "2015-10-20T22:35:29.919+03:00", "highlightTitle": ""}