{"organizations": [], "uuid": "f823b148cfc3234861884a0f94086db1f3163452", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266385/technology-general", "section_title": "Technology Press Releases from PRWeb - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30247624/serta-telecom-selects-bridgewave-microwave-systems-to-suport-government-security-forces-network-in-lebanon", "country": "US", "title": "SERTA Telecom Selects BridgeWave Microwave Systems to Suport Government Security Forces Network in Lebanon", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "SERTA Telecom Selects BridgeWave Microwave Systems to Suport Government Security Forces Network in Lebanon - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T17:02:00.000+03:00", "replies_count": 0, "uuid": "f823b148cfc3234861884a0f94086db1f3163452"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30247624/serta-telecom-selects-bridgewave-microwave-systems-to-suport-government-security-forces-network-in-lebanon", "ord_in_thread": 0, "title": "SERTA Telecom Selects BridgeWave Microwave Systems to Suport Government Security Forces Network in Lebanon", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Etherflex all-outdoor systems to provide wireless connectivity for government intelligence forces' nationwide Tetra network\nSAN DIEGO, California\nBridgeWave Communications, a market leader in wireless backhaul systems, today announced that SERTA Telecom, an information and communication technology solutions provider serving customers in the Middle East, Africa, and Turkey, has selected BridgeWave Etherflex microwave systems for the new Tetra network supporting intelligence services of the General Directorate of General Security (GDGS) in Lebanon. The BridgeWave systems will provide connectivity among the Tetra network switching centers, dispatch locations, and transmission base stations supporting more than 3,000 subscribers who use the network for mission-critical communications across sensitive locations in Lebanon including airports, seaports, and borders.\nMore than 100 links of BridgeWave Etherflex systems supporting 6, 7, 13, 15, and 38GHz frequency bands will be deployed to serve as the transmission backbone infrastructure. “The microwave systems we considered to support Lebanon’s security forces had to undergo rigorous testing to meet our criteria for performance, reliability, availability, and security,” according to Mr. Paul Tohme, Chief Technical Officer of SERTA Telecom. “We tested radios from several manufacturers before selecting BridgeWave, and the BridgeWave systems not only met our strict requirements, but exceeded them.”\nThe EtherFlex family of microwave radio systems, which supports frequency bands from 6 – 38GHz, has been designed specifically to meet the requirements of customers requiring high speed connectivity in a single, compact, all-outdoor enclosure. EtherFlex is built on a highly reliable RF platform, used in more than 850,000 radio installations worldwide, which enables flexible field configurations and high link budgets. This helps ease installation and maintenance costs on the network by offering only one device to install and manage, providing the customer with a highly-reliable, fully integrated backhaul solution.\n“We are honored to have been chosen by SERTA Telecom to be a key part of Lebanon’s new Tetra communications network,” said Pamela Valentine, vice president of marketing, BridgeWave Communications. “Not only has SERTA Telecom validated the performance and capabilities of our Etherflex systems, they have also endorsed our role as a trusted provider of wireless backhaul systems for mission-critical applications.\"\nBridgeWave Communications offers a broad portfolio of backhaul solutions including licensed 6 - 38GHz microwave systems (Etherflex and FlexPort µWave); license-free 60GHz millimeter wave systems (AR60 and BW64); and lightly-licensed 80GHz millimeter wave systems (Flex4G-UHA, FlexPort80, and the BW-Eagle). These systems have been designed specifically to meet the backhaul needs of carriers, enterprises, and ISP customer networks worldwide.\n###\nAbout SERTA\nSerta is an Information and Communication Technology (ICT) solutions provider established in 2009. The company partners with leading vendors to offer a comprehensive portfolio of voice, data, secure communications, cyber security solutions and professional services. Clients include fixed and wireless carriers, government agencies and service providers in the Middle East, Africa and Turkey. http://www.sertatelecom.com/serta/home\nAbout BridgeWave\nBridgeWave Communications provides high-capacity microwave and millimeter wave backhaul and wireless connectivity solutions for operators, carriers, service providers, governments, and private enterprise networks. With over 30,000 systems deployed in over 60 countries, the company’s innovative solutions have been entrusted by customers all over the world to enable highly reliable and secure, high-capacity and gigabit connectivity while reducing operating costs relative to fiber and other land-based alternatives. Founded in 1999, BridgeWave is headquartered in San Diego, California. For more information, visit http://www.bridgewave.com .\n //www.prweb.com/releases/2015/10/prweb13015796.htm\n ", "external_links": ["http://www.sertatelecom.com/serta/home", "http://www.prweb.com/releases/2015/10/prweb13015796.htm"], "published": "2015-10-13T17:02:00.000+03:00", "crawled": "2015-10-15T14:06:21.123+03:00", "highlightTitle": ""}