{"organizations": [], "uuid": "d8a6311acd45c64d14136fb771d9c443949c26bf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "phys.org", "main_image": "http://cdn.phys.org/tmpl/v5/img/phys_308px.png", "site_section": "http://www.physorg.com/rss/rssbycategory.php?categ=16", "section_title": "Phys.org - latest science and technology news stories", "url": "http://phys.org/news/2015-10-psychology-religious-belief.html", "country": "US", "title": "The psychology behind religious belief", "performance_score": 0, "site": "phys.org", "participants_count": 0, "title_full": "The psychology behind religious belief", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T19:55:00.000+03:00", "replies_count": 0, "uuid": "d8a6311acd45c64d14136fb771d9c443949c26bf"}, "author": "", "url": "http://phys.org/news/2015-10-psychology-religious-belief.html", "ord_in_thread": 0, "title": "The psychology behind religious belief", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jeff Grabmeier"], "text": "The psychology behind religious belief October 5, 2015 by Jeff Grabmeier \nThroughout history, scholars and researchers have tried to identify the one key reason that people are attracted to religion. \nSome have said people seek religion to cope with a fear of death, others call it the basis for morality, and various other theories abound. \nBut in a new book, a psychologist who has studied human motivation for more than 20 years suggests that all these theories are too narrow. Religion, he says, attracts followers because it satisfies all of the 16 basic desires that humans share. \n\"It's not just about fear of death. Religion couldn't achieve mass acceptance if it only fulfilled one or two basic desires,\" said Steven Reiss, a professor emeritus of psychology at The Ohio State University and author of The 16 Strivings for God (Mercer University Press, 2016). \n\"People are attracted to religion because it provides believers the opportunity to satisfy all their basic desires over and over again. You can't boil religion down to one essence.\" \nReiss's theory of what attracts people to religion is based on his research in the 1990s on motivation. He and his colleagues surveyed thousands of people and asked them to rate the degree to which they embraced hundreds of different possible goals. \nIn the end, the researchers identified 16 basic desires that we all share: acceptance, curiosity, eating, family, honor, idealism, independence, order, physical activity, power, romance, saving, social contact, status, tranquility and vengeance. \nReiss then developed a questionnaire, called the Reiss Motivation Profile, that measures how much people value each of these 16 goals. More than 100,000 people have now completed the questionnaire. The research is described in Reiss's book Who Am I? The 16 Basic Desires that Motivate our Action and Define Our Personalities. \n\"We all share the same 16 goals, but what makes us different is how much we value each one,\" Reiss said. \n\"How much an individual values each of those 16 desires corresponds closely to what he or she likes and dislikes about religion.\" \nA key point is that each of the 16 desires motivates personality opposites and those opposites all have to find a home in a successful religion, Reiss said. \nFor example, there is the desire for social contact . \"Religion has to appeal to both introverts and extroverts,\" Reiss said. For extroverts, religion offers festivals and teaches that God blesses fellowship. For introverts, religion encourages meditation and private retreats and teaches that God blesses solitude. \nReligion even finds ways to deal with the desire for vengeance, Reiss said. While some religions preach of a God of peace and encourage followers to \"turn the other cheek,\" there is also the other side: the wrath of God and holy wars. \n\"Religion attracts all kinds, including peacemakers and those who want a vengeful God.\" \nAll religious beliefs and practices are designed to meet one or more of these 16 desires, Reiss explained. \nFor example, religious rituals fulfill the desire for order. Religious teachings about salvation and forgiveness tap into the basic human need for acceptance. Promises of an afterlife are designed to help people achieve tranquility. \nWhat about atheism? While all people need to fulfill the same basic desires, not everyone will turn to religion to satisfy them, Reiss said. Secular society offers alternatives to fulfill all of the basic desires. \n\"Religion competes with secular society to meet those 16 needs and can gain or lose popularity based on how well people believe it does compared to secular society,\" Reiss said. \nOne of the basic desires - independence - may separate religious and non-religious people. In a study published in 2000, Reiss found that religious people (the study included mostly Christians) expressed a strong desire for interdependence with others. Those who were not religious, however, showed a stronger need to be self-reliant and independent. \nReiss said one advantage of his theory is that, unlike many other theories of religion, it can be scientifically tested. \n\"In 16 Strivings for God, I discuss a mystical personality type - the kind of person who would likely find value and meaning in mystical experiences and would be attracted to religion for that reason,\" he said. \n\"We can test that and find out if there really is a mystical personality type.\" \nWhile the theory can tell us a lot about the types of people who are attracted to religion and different religious experiences, it cannot say anything about the truth of religious beliefs, Reiss said. \n\"I'm not trying to answer theological questions about the existence or nature of God,\" Reiss said. \"What I'm trying to answer is the nature of why people embrace religion and God.\"", "external_links": [], "published": "2015-10-05T19:55:00.000+03:00", "crawled": "2015-10-05T20:16:03.464+03:00", "highlightTitle": ""}