{"organizations": [], "uuid": "d528e578cc2abfe303b3066dbde6cd3209ac6ed4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1135814/oki-establishes-new-wide-format-printer-company", "country": "US", "title": "OKI Establishes New Wide Format Printer Company", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "OKI Establishes New Wide Format Printer Company", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T05:00:00.000+03:00", "replies_count": 0, "uuid": "d528e578cc2abfe303b3066dbde6cd3209ac6ed4"}, "author": "admin", "url": "http://www.freshnews.com/news/1135814/oki-establishes-new-wide-format-printer-company", "ord_in_thread": 0, "title": "OKI Establishes New Wide Format Printer Company", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Companies mentioned in this article: OKI Electric Industry \nTOKYO -- (BUSINESS WIRE) -- OKI Data Corporation, an OKI Group company specializing in the printer business, today announced that the company has completed the acquisition of the globally-deployed wide format printer business of Seiko I Infotech Inc. (“SIIT” hereinafter), a subsidiary of Seiko Instruments Inc. (“SII” hereinafter), from SII. \nOKI Data Corporation established OKI Data Infotech Corporation (“OKI Data Infotech” hereinafter) by acquiring all SIIT shares held by SII. The new company began operating as a member of the OKI Group on October 1, 2015. On the same day, OKI Data Corporation’s overseas subsidiaries in Europe and the US completed the acquisition of the wide format printer business and assets from SII’s European and US group companies. OKI Data Infotech will assume responsibility for all services and products in the wide format printer business currently provided by SII’s European and US group companies. \nOKI Data Corporation positions the high-value-added printer business as its major growth area with the professional printer market being an important sector. \n“We are pleased to have completed the acquisition of the wide format printer business from SII,\" said Takao Hiramoto, President of OKI Data Corporation. \"Through this acquisition, we have not only acquired a portfolio of wide format inkjet printers for signs and LED graphic plotters, but also the corresponding technologies, development resources, and sales channels. By offering one-stop printing solutions targeting the printing, distribution, and retail industry sectors, we will strengthen our printer business in the professional printer market.” \nOverview of OKI Data Infotech Company name:OKI Data Infotech CorporationRepresentative: Junichiro AzumaAddress: 8, Nakase 1-chome, Mihama-ku, Chiba, Chiba Prefecture, JapanEffective date: October 1, 2015Number of employees: 236Lines of business: Design, development, manufacturing, sales and maintenance of wide format printersCapital: 1 billion yen \nAbout OKI Data Corporation OKI Data Corporation specializes in the design, development, manufacture, and marketing of business printing solutions that empower organizations to communicate more effectively. A subsidiary of Tokyo-based OKI Electric Industry (established in 1881 as Japan’s first telecommunications manufacturer), OKI Data fields representatives in 100 countries to offer innovative, leading-edge products and services worldwide. For more information, please visit http://www.okiprintingsolutions.com/ \nNotes: The names of the companies and products mentioned in this document are the trademarks or registered trademarks of the respective companies and organizations. View source version on businesswire.com: http://www.businesswire.com/news/home/20151004005022/en/ Copyright © Business Wire 2015", "external_links": [], "published": "2015-10-05T05:00:00.000+03:00", "crawled": "2015-10-05T06:29:18.448+03:00", "highlightTitle": ""}