{"organizations": [], "uuid": "61dba6cad65c37663a4f863849fb68638a2e42a7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1141844/alta-devices-introduces-solar-uav-index-designed-aid-designers-unmanned-systems-with-c", "country": "US", "title": "Alta Devices Introduces a “Solar for UAV Index” Designed to Aid Designers of Unmanned Systems With Choosing the Right Solar Technology", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "Alta Devices Introduces a “Solar for UAV Index” Designed to Aid Designers of Unmanned Systems With Choosing the Right Solar Technology", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T13:00:00.000+03:00", "replies_count": 0, "uuid": "61dba6cad65c37663a4f863849fb68638a2e42a7"}, "author": "admin", "url": "http://www.freshnews.com/news/1141844/alta-devices-introduces-solar-uav-index-designed-aid-designers-unmanned-systems-with-c", "ord_in_thread": 0, "title": "Alta Devices Introduces a “Solar for UAV Index” Designed to Aid Designers of Unmanned Systems With Choosing the Right Solar Technology", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Commercial UAV Show (October 20-21, 2015)ExCeL London, One Western Gateway, Royal Victoria Dock, London Wednesday, October 21, 2015, 3:00pm Seminar Theater 2 “The World’s Most Efficient Solar meets UAV’s”Presented by Rob Parenti, Technical Marketing Engineer, Alta Devices Why Small UAVs and high-altitude, long-endurance UAVs, sometimes referred to as HALE or pseudo-satellites, are increasingly important for many applications ranging from agriculture, surveillance, inspection, communications, and many other civil uses. These all require flight times that can approach days, months, or be unlimited. In order to accomplish these long flight times, batteries installed as the primary power source must be able to be extended and recharged. But this extension needs to come without impairing the aerodynamics. Solar technology is perfect for this, if it meets the required integration, power to weight ratios, conversion efficiency, and energy yield needs. To date, the only standardized metric for solar power has focused on conversion efficiency. Alta Devices’ new proposed index creates a rating system based on a more representative complement of variables that must be considered in choosing a solar technology for these types of applications. \nAbout Alta Devices \nAlta Devices is (EM)POWERING THE UNPLUGGED WORLD™ by delivering the world’s most efficient, thin and flexible mobile power technology. By converting light of any kind into electricity, Alta Device’s AnyLight™ power technology extends the energy source of a system, and in many cases, completely cuts the traditional power cord. The solution can be completely integrated into the final system, and is ideal for use in unmanned systems, consumer electronics, sensors, automotive, remote exploration, wearables, or anywhere size, weight, and mobility matter. Alta Devices holds world records for energy conversion efficiency and is located in Sunnyvale, CA. For more information, visit http://www.altadevices.com . Alta Devices is a Hanergy company. All trademarks and registered trademarks are those of their respective companies. View source version on businesswire.com: http://www.businesswire.com/news/home/20151019005402/en/ Copyright © Business Wire 2015", "external_links": [], "published": "2015-10-19T13:00:00.000+03:00", "crawled": "2015-10-19T15:17:54.661+03:00", "highlightTitle": ""}