{"organizations": [], "uuid": "41638601d5d9d06ef5fe3a3f2b2606e52c8e7d9a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stockhouse.com", "main_image": "", "site_section": "http://www.stockhouse.com/discovery/technology", "section_title": "The Technology Report - Technology investor news and research center ", "url": "http://www.stockhouse.com/news/press-releases/2015/09/30/aviat-networks-announces-fourth-quarter-and-fiscal-year-2015-financial-results", "country": "US", "title": "Aviat Networks Announces Fourth Quarter and Fiscal Year 2015 Financial Results", "performance_score": 0, "site": "stockhouse.com", "participants_count": 1, "title_full": "Aviat Networks Announces Fourth Quarter and Fiscal Year 2015 Financial Results", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "41638601d5d9d06ef5fe3a3f2b2606e52c8e7d9a"}, "author": "stockhouse.com", "url": "http://www.stockhouse.com/news/press-releases/2015/09/30/aviat-networks-announces-fourth-quarter-and-fiscal-year-2015-financial-results", "ord_in_thread": 0, "title": "Aviat Networks Announces Fourth Quarter and Fiscal Year 2015 Financial Results", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SANTA CLARA, Calif. , Sept. 30, 2015 /PRNewswire/ -- Aviat Networks, Inc. (NASDAQ: AVNW), the leading expert in microwave networking solutions, today reported financial results for the fourth quarter and fiscal year 2015, which ended July 3, 2015.\nFinancial Highlights for Q4FY15\nRevenue at $87.8 million Book to bill was above 1 GAAP Gross Margin at 21.3%; Non-GAAP Gross Margin at 21.4% GAAP Operating Expense at $23.9 million ; Non-GAAP Operating Expense at $23.2 million GAAP Net Loss Attributable to Aviat Networks at $(1.6) million , or $(0.03) per share Non-GAAP Loss from Continuing Operations Attributable to Aviat Networks at $(5.0) million , or $(0.08) per share Financial Highlights for FY15\nRevenue at $335.9 million GAAP Gross Margin at 24.0%; non-GAAP Gross Margin at 24.1% Non-GAAP Operating Expense at $99.4 million GAAP Net Loss Attributable to Aviat Networks of $(24.7) million , or $(0.40) per share Non-GAAP Loss from Continuing Operations Attributable to Aviat Networks of $(20.6) million , or $(0.33) per share The first three quarters of fiscal 2015 and the quarterly and fiscal 2014 financial statements have been revised to reflect corrections to our accrued liability related to cost of services revenue in prior periods. A reconciliation of GAAP to non-GAAP financial measures for the fourth quarter and fiscal year along with the accompanying notes is provided on Table 4 below.\n\"Deployments with global tier-1 mobile operators, along with demand for our CTR product line and services portfolio drove revenue and bookings growth during the quarter. We continued to make significant progress implementing cost efficiencies and generating cash flow from operations,\" said Michael Pangia , president and CEO, Aviat Networks. \"These improvements set the foundation for stronger performance in fiscal 2016.\"\nGAAP Financial Results\nFor the fourth quarter of fiscal 2015, revenue was $87.8 million , compared with $85.4 million in the year-ago quarter. Aviat reported net loss attributable to Aviat Networks, including discontinued operations, of $(1.6) million , or $(0.03) per share, compared with a net loss of $(13.3) million , or $(0.21) per share, in the year-ago quarter. Loss from continuing operations attributable to Aviat Networks for the quarter was $(1.6) million , or $(0.03) per diluted share, compared with a loss from continuing operations of $(13.5) million , or $(0.22) per share, in the year-ago quarter.\nCash and cash equivalents were $34.7 million as of July 3, 2015 compared with $35.0 million as of the end of the third quarter of fiscal 2015.\nNon-GAAP Financial Results\nNon-GAAP loss from continuing operations attributable to Aviat Networks for the quarter was $(5.0) million , or $(0.08) per share, compared with a non-GAAP loss from continuing operations of $(8.7) million , or $(0.14) per diluted share, in the year-ago quarter.\nThe fourth quarter of fiscal 2015 non-GAAP income from continuing operations attributable to Aviat Networks excluded $0.8 million of pre-tax charges composed primarily of the following:\n$0.5 million of share-based compensation expense; $0.2 million of restructuring charges; and $0.1 million of amortization of purchased intangibles. Fourth quarter of fiscal 2015 Adjusted EBITDA attributable to Aviat Networks was $(2.5) million , or $(0.04) per share attributable to Aviat Networks shareholders, compared with $(6.3) million in the year ago quarter. In addition to the $0.8 million of pre-tax charges excluded from non-GAAP income from continuing operations noted above, fourth quarter of fiscal 2015 Adjusted EBITDA also excludes $2.0 million of pre-tax charges comprised of the following:\n$1.9 million of depreciation and amortization on property, plant and equipment; and $0.1 million of interest expense. A reconciliation of GAAP to non-GAAP financial measures for the fourth quarter and fiscal year along with accompanying notes is provided on Table 4 below.\nFourth Quarter of Fiscal 2015 Revenue by Region\nRevenue in the North America region was $38.5 million in the fourth quarter of fiscal 2015, compared with $37.2 million in the year-ago quarter. International revenue was $49.3 million , compared with $48.2 million in the year-ago quarter.\nFirst Quarter of Fiscal 2016 Outlook\nAviat Networks currently expects the following:\nRevenue in the range of $78 million to $83 million ; Breakeven to positive Adjusted EBITDA; and Cash breakeven to cash generation. Conference Call Details\nAviat Networks will host a conference call at 8:30 a.m. ET on October 1, 2015 to discuss its financial results. To listen to the live conference call, please dial toll free 888-395-3227 or 719-325-2402, access code 8371663, by 8:20 a.m. ET . Investors are invited to listen via webcast, which will be broadcast live and via replay approximately two hours after the call at http://investors.aviatnetworks.com/events.cfm .\nNon-GAAP Measures and Comparative Financial Information\nAviat Networks, Inc. reports information in accordance with U.S. Generally Accepted Accounting Principles (\"GAAP\"). Management of Aviat Networks monitors gross margin, research and development expenses, selling and administrative expenses, operating income or loss, income tax provision or benefit, income or loss from continuing operations attributable to Aviat Networks, basic and diluted income or loss per share from continuing operations attributable to Aviat Networks shareholders, adjusted earnings (losses) before interest, tax, depreciation and amortization (\"Adjusted EBITDA\") attributable to Aviat Networks shareholders adjusted to exclude certain costs, charges, gains and losses, on a non-GAAP basis for planning and forecasting results in future periods, and may use these measures for some management compensation purposes. These measures exclude certain costs, expenses, gains and losses as shown on the attached Reconciliation of Non-GAAP Financial Measures table (table 4). As a result, management is presenting these non-GAAP measures in addition to results reported in accordance with GAAP to better communicate underlying operational and financial performance in each period. Management believes these non-GAAP measures provide information that is useful to investors in understanding period-over-period operating results separate and apart from items that may, or could, have a disproportionate positive or negative impact on results in any given period. Management also believes that these non-GAAP measures enhance the ability of an investor to analyze trends in Aviat Networks' business and to better understand our performance.\nAviat Networks' management does not, nor does it suggest that investors should, consider such non-GAAP financial measures in isolation from, or as a substitute for, financial information prepared in accordance with GAAP. Aviat Networks presents these non-GAAP financial measures in reporting its financial results to provide investors with an additional tool to evaluate its financial performance. Reconciliations of these non-GAAP financial measures with the most directly comparable financial measures calculated in accordance with GAAP are included in the tables below.\nAbout Aviat Networks\nAviat Networks, Inc. (NASDAQ: AVNW) is a leading global provider of microwave networking solutions transforming communications networks to handle the exploding growth of IP-centric, multi-Gigabit data services. With more than one million systems sold over 140 countries, Aviat Networks provides LTE-proven microwave networking solutions to mobile operators, including some of the largest and most advanced 4G/LTE networks in the world. Public safety, utility, government and defense organizations also trust Aviat Networks' solutions for their mission-critical applications where reliability is paramount. In conjunction with its networking solutions, Aviat Networks provides a comprehensive suite of localized professional and support services enabling customers to effectively and seamlessly migrate to next generation Carrier Ethernet/IP networks. For more than 50 years, customers have relied on Aviat Networks' high performance and scalable solutions to help them maximize their investments and solve their most challenging network problems. Headquartered in Santa Clara, California , Aviat Networks operates in more than 100 countries around the world. For more information, visit www.aviatnetworks.com or connect with Aviat Networks on Twitter , Facebook and LinkedIn .\nForward-Looking Statements\nThe information contained in this document includes forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, Section 21E of the Securities Exchange Act and Section 27A of the Securities Act including expectations regarding cash generation, profitability and growth opportunities; and expectations and outlook regarding the first quarter of fiscal year 2016. All statements, trend analyses and other information contained herein about the markets for the services and products of Aviat Networks and trends in revenue, as well as other statements identified by the use of forward-looking terminology, including \"anticipate,\" \"believe,\" \"plan,\" \"estimate,\" \"expect,\" \"goal,\" \"will,\" \"see,\" \"continue,\" \"delivering,\" \"view,\" and \"intend,\" or the negative of these terms or other similar expressions, constitute forward-looking statements. These forward-looking statements are based on estimates reflecting the current beliefs of the senior management of Aviat Networks. These forward-looking statements involve a number of risks and uncertainties that could cause actual results to differ materially from those suggested by the forward-looking statements. Forward-looking statements should therefore be considered in light of various important factors, including those set forth in this document. Important factors that could cause actual results to differ materially from estimates or projections contained in the forward-looking statements include the following:\nmaterial weaknesses identified in our system of internal control and associated remediation efforts and investments and other actions needed to remedy those material weaknesses; continued price and margin erosion as a result of increased competition in the microwave transmission industry; the impact of the volume, timing and customer, product and geographic mix of our product orders; our ability to meet financial covenant requirements which could impact our liquidity; our ability to meet projected new product development dates or anticipated cost reductions of new products; our suppliers' inability to perform and deliver on time as a result of their financial condition, component shortages or other supply chain constraints; customer acceptance of new products; the ability of our subcontractors to timely perform; continued weakness in the global economy affecting customer spending; retention of our key personnel; our ability to manage and maintain key customer relationships; uncertain economic conditions in the telecommunications sector combined with operator and supplier consolidation; the timing of our receipt of payment for products or services from our customers; our failure to protect our intellectual property rights or defend against intellectual property infringement claims by others; the results of restructuring efforts; the effects of currency and interest rate risks; and the impact of political turmoil in countries where we have significant business. For more information regarding the risks and uncertainties for our business, see \"Risk Factors\" in our Form 10-K filed with the U.S. Securities and Exchange Commission (\"SEC\") on December 19, 2014 as well as other reports filed by Aviat Networks, Inc. with the SEC from time to time. Aviat Networks undertakes no obligation to update publicly any forward-looking statement for any reason, except as required by law, even as new information becomes available or other events occur in the future.\nFinancial Tables to Follow:\nTable 1\nAVIAT NETWORKS, INC.\nFiscal Year 2015 Fourth Quarter Summary\nCONDENSED CONSOLIDATED STATEMENTS OF OPERATIONS\n(Unaudited)\nQuarter Ended\nFiscal Year Ended\nJuly 3, 2015\nJune 27, 2014*\nJuly 3, 2015\nJune 27, 2014*\n(In millions, except per share amounts)\nRevenue from product sales and services\n$\n87.8\n$\n85.4\n$\n335.9\n$\n346.0\nCost of product sales and services\n69.1\n66.0\n255.2\n260.8\nGross margin\n18.7\n19.4\n80.7\n85.2\nResearch and development expenses\n6.0\n8.0\n25.4\n35.5\nSelling and administrative expenses\n17.6\n21.4\n76.0\n88.8\nAmortization of intangible assets\n0.1\n0.1\n0.4\n0.4\nRestructuring charges\n0.2\n2.1\n4.9\n11.1\nOperating loss\n(5.2)\n(12.2)\n(26.0)\n(50.6)\nInterest income\n0.1\n0.1\n0.4\n0.5\nInterest expense\n(0.1)\n(0.1)\n(0.4)\n(0.4)\nLoss from continuing operations before income taxes\n(5.2)\n(12.2)\n(26.0)\n(50.5)\nProvision for (benefit from) income taxes\n(3.7)\n1.3\n(1.3)\n1.5\nLoss from continuing operations\n(1.5)\n(13.5)\n(24.7)\n(52.0)\nIncome from discontinued operations, net of tax\n0.0\n0.2\n0.1\n0.9\nNet loss\n(1.5)\n(13.3)\n(24.6)\n(51.1)\nLess: Net income attributable to noncontrolling interests, net of tax\n0.1\n—\n0.1\n—\nNet loss attributable to Aviat Networks\n$\n(1.6)\n$\n(13.3)\n$\n(24.7)\n$\n(51.1)\nAmount attributable to Aviat Networks:\nNet loss from continuing operations, net of tax\n$\n(1.6)\n$\n(13.5)\n$\n(24.8)\n$\n(52.0)\nNet income from discontinued operations, net of tax\n$\n0.0\n$\n0.2\n$\n0.1\n$\n0.9\nLoss per share attributable to Aviat Networks stockholders, basic and diluted:\nContinuing operations\n$\n(0.03)\n$\n(0.22)\n$\n(0.40)\n$\n(0.84)\nDiscontinued operations\n$\n0.00\n$\n0.00\n$\n0.00\n$\n0.01\nNet loss\n$\n(0.03)\n$\n(0.21)\n$\n(0.40)\n$\n(0.83)\nWeighted average shares outstanding, basic and diluted\n62.4\n61.9\n62.2\n61.6\n* Revised to include a $0.4 million increase and a $0.1 million decrease in cost of services for the fourth quarter and fiscal year 2014, respectively, reflecting effects of the corrections to accrued cost of services revenue.\nTable 2\nAVIAT NETWORKS, INC.\nFiscal Year 2015 Fourth Quarter Summary\nCONDENSED CONSOLIDATED BALANCE SHEETS\n(Unaudited)\nJuly 3, 2015\nJune 27, 2014*\n(In millions)\nAssets\nCash and cash equivalents\n$\n34.7\n$\n48.8\nReceivables, net\n88.2\n77.2\nUnbilled costs\n17.3\n23.8\nInventories\n32.9\n38.1\nCustomer service inventories\n6.2\n11.4\nOther current assets\n16.5\n18.9\nProperty, plant and equipment, net\n24.3\n29.3\nIdentifiable intangible assets, net\n—\n0.4\nOther assets\n9.3\n5.3\n$\n229.4\n$\n253.2\nLiabilities and Stockholders' Equity\nShort-term debt\n$\n9.0\n$\n6.0\nAccounts payable\n46.6\n46.1\nAccrued expenses and other current liabilities\n31.3\n36.2\nAdvanced payments and unearned income\n41.7\n33.3\nLong-term liabilities\n16.9\n19.7\nStockholders' equity\n83.9\n111.9\n$\n229.4\n$\n253.2\n* Revised to include a $9.3 million decrease in accrued expenses and other current liabilities and stockholders' equity as of June 27, 2014, reflecting effects of the corrections to accrued cost of service revenue.\nTable 3\nAVIAT NETWORKS, INC.\nFiscal Year 2015 Fourth Quarter Summary\nCONDENSED CONSOLIDATED STATEMENTS OF CASH FLOWS\n(Unaudited)\nFiscal Year Ended\nJuly 3, 2015\nJune 27, 2014*\n(In millions)\nOperating Activities\nNet loss\n$\n(24.6)\n$\n(51.1)\nAdjustments to reconcile net loss to net cash used in operating activities:\nAmortization of identifiable intangible assets\n0.4\n0.4\nDepreciation and amortization of property, plant and equipment\n7.2\n7.1\nGoodwill impairment charges\n—\n—\nBad debt expense\n0.9\n0.8\nShare-based compensation expense\n2.2\n3.4\nDeferred income taxes benefit\n(4.7)\n(0.3)\nCharges for inventory and customer service inventory write-downs\n9.3\n7.2\nLoss (gain) on disposal of property, plant and equipment\n0.4\n(0.1)\nGain on disposition of the WiMAX business\n(0.1)\n—\nChanges in operating assets and liabilities:\nReceivables\n(13.5)\n8.2\nUnbilled costs\n6.1\n5.1\nInventories\n(1.9)\n(7.0)\nCustomer service inventories\n2.3\n1.5\nAccounts payable\n1.6\n(2.7)\nAccrued expenses\n(4.1)\n(6.5)\nAdvance payments and unearned income\n9.3\n14.6\nIncome taxes payable or receivable\n1.4\n(11.9)\nReserve for uncertain tax positions and deferred taxes\n—\n—\nOther assets and liabilities\n(1.2)\n2.0\nNet cash used in operating activities\n(9.0)\n(29.3)\nInvesting Activities\nAdditions of property, plant and equipment\n(3.7)\n(9.4)\nNet cash used in investing activities\n(3.7)\n(9.4)\nFinancing Activities\nProceeds from debt\n54.0\n—\nRepayments of debt\n(51.0)\n(2.8)\nIssuance of common stock under employee stock plans\n—\n0.1\nPayments on capital lease obligations\n(0.1)\n(0.1)\nNet cash provided by (used in) financing activities\n2.9\n(2.8)\nEffect of exchange rate changes on cash and cash equivalents\n(4.3)\n0.3\nNet Decrease in Cash and Cash Equivalents\n(14.1)\n(41.2)\nCash and Cash Equivalents, Beginning of Period\n48.8\n90.0\nCash and Cash Equivalents, End of Period\n$\n34.7\n$\n48.8\n* Revised to include $0.1 million increase in net loss and $0.1 million increase in changes in accrued expenses for fiscal 2014, reflecting effects of the corrections to accrued cost of service revenue. This had no impact on cash used in operating activities.\nAVIAT NETWORKS, INC.\nQuarter Ended July 3, 2015 Summaries\nRECONCILIATION OF NON-GAAP FINANCIAL MEASURES AND REGULATION G DISCLOSURE\nTo supplement the consolidated financial statements presented in accordance with accounting principles generally accepted in the United States (\"GAAP\"), we provide additional measures of gross margin, research and development expenses, selling and administrative expenses, operating income or loss, income tax provision or benefit, income or loss from continuing operations attributable to Aviat Networks, basic and diluted income or loss per share from continuing operations attributable to Aviat Networks' stockholders, and adjusted earnings before interest, tax, depreciation and amortization (\"Adjusted EBITDA\") attributable to Aviat Networks, adjusted to exclude certain costs, charges, gains and losses, as set forth below. We believe that these non-GAAP financial measures, when considered together with the GAAP financial measures provide information that is useful to investors in understanding period-over-period operating results separate and apart from items that may, or could, have a disproportionate positive or negative impact on results in any particular period. We also believe these non-GAAP measures enhance the ability of investors to analyze trends in our business and to understand our performance. In addition, we may utilize non-GAAP financial measures as a guide in our forecasting, budgeting and long-term planning process and to measure operating performance for some management compensation purposes. Any analysis of non-GAAP financial measures should be used only in conjunction with results presented in accordance with GAAP. Reconciliations of these non-GAAP financial measures with the most directly comparable financial measures calculated in accordance with GAAP follow.\nTable 4\nAVIAT NETWORKS, INC.\nFiscal Year 2015 Fourth Quarter Summary\nRECONCILIATIONS OF NON-GAAP FINANCIAL MEASURES (1)\nCondensed Consolidated Statements of Operations\n(Unaudited)\nQuarter Ended\nFiscal Year Ended\nJuly 3, 2015\n% of\nRevenue\nJune 27,\n2014 (2)\n% of\nRevenue\nJuly 3, 2015\n% of\nRevenue\nJune 27,\n2014 (2)\n% of\nRevenue\n(In millions, except percentages and per share amounts)\nGAAP gross margin\n$\n18.7\n21.3\n%\n$\n19.4\n22.7\n%\n$\n80.7\n24.0\n%\n$\n85.2\n24.6\n%\nShare-based compensation\n0.1\n—\n0.2\n0.1\nE&O inventory write down\n—\n1.2\n—\n1.2\nWarehouse consolidation costs\n—\n—\n—\n0.2\nNon-GAAP gross margin\n18.8\n21.4\n%\n20.6\n24.1\n%\n80.9\n24.1\n%\n86.7\n25.1\n%\nGAAP research and development expenses\n$\n6.0\n6.8\n%\n$\n8.0\n9.4\n%\n$\n25.4\n7.6\n%\n$\n35.5\n10.3\n%\nShare-based compensation\n—\n(0.1)\n(0.1)\n(0.3)\nNon-GAAP research and development expenses\n6.0\n6.8\n%\n7.9\n9.3\n%\n25.3\n7.5\n%\n35.2\n10.2\n%\nGAAP selling and administrative expenses\n$\n17.6\n20.0\n%\n$\n21.4\n25.1\n%\n$\n76.0\n22.6\n%\n$\n88.8\n25.7\n%\nShare-based compensation\n(0.4)\n(0.5)\n(1.9)\n(3.0)\nTransactional taxes assessments\n—\n—\n—\n(0.6)\nNon-GAAP selling and administrative expenses\n17.2\n19.6\n%\n20.9\n24.5\n%\n74.1\n22.1\n%\n85.2\n24.6\n%\nGAAP operating loss\n$\n(5.2)\n(5.9)\n%\n$\n(12.2)\n(14.3)\n%\n$\n(26.0)\n(7.7)\n%\n$\n(50.6)\n(14.6)\n%\nShare-based compensation\n0.5\n0.6\n2.2\n3.4\nE&O inventory write down\n—\n1.2\n—\n1.2\nWarehouse consolidation costs\n—\n—\n—\n0.2\nTransactional taxes assessments\n—\n—\n—\n0.6\nAmortization of intangible assets\n0.1\n0.1\n0.4\n0.4\nRestructuring charges\n0.2\n2.1\n4.9\n11.1\nNon-GAAP operating loss\n(4.4)\n(5.0)\n%\n(8.2)\n(9.6)\n%\n(18.5)\n(5.5)\n%\n(33.7)\n(9.7)\n%\nGAAP income tax provision (benefit)\n$\n(3.7)\n(4.2)\n%\n$\n1.3\n1.5\n%\n$\n(1.3)\n(0.4)\n%\n$\n1.5\n0.4\n%\nAdjustment to reflect pro forma tax rate\n4.2\n(0.8)\n3.3\n0.5\nNon-GAAP income tax provision\n0.5\n0.6\n%\n0.5\n0.6\n%\n2.0\n0.6\n%\n2.0\n0.6\n%\nGAAP loss from continuing operations\n attributable to Aviat Networks\n$\n(1.6)\n(1.8)\n%\n$\n(13.5)\n(15.8)\n%\n$\n(24.8)\n(7.4)\n%\n$\n(52.0)\n(15.0)\n%\nShare-based compensation\n0.5\n0.6\n2.2\n3.4\nE&O inventory write down\n—\n1.2\n—\n1.2\nWarehouse consolidation costs\n—\n—\n—\n0.2\nTransactional taxes assessments\n—\n—\n—\n0.6\nAmortization of intangible assets\n0.1\n0.1\n0.4\n0.4\nRestructuring charges\n0.2\n2.1\n4.9\n11.1\nAdjustment to reflect pro forma tax rate\n(4.2)\n0.8\n(3.3)\n(0.5)\nNon-GAAP loss from continuing operations\n attributable to Aviat Networks\n$\n(5.0)\n(5.7)\n%\n$\n(8.7)\n(10.2)\n%\n$\n(20.6)\n(6.1)\n%\n$\n(35.6)\n(10.3)\n%\nLoss per share from continuing operations attributable to Aviat Networks stockholders, basic and diluted:\nGAAP\n$\n(0.03)\n$\n(0.22)\n$\n(0.40)\n$\n(0.84)\nNon-GAAP\n$\n(0.08)\n$\n(0.14)\n$\n(0.33)\n$\n(0.58)\nWeighted average shares outstanding, basic and diluted:\nGAAP\n62.4\n61.9\n62.2\n61.6\nNon-GAAP\n62.4\n61.9\n62.2\n61.6\nADJUSTED EBITDA:\nGAAP loss from continuing operations\n attributable to Aviat Networks\n$\n(1.6)\n(1.8)\n%\n$\n(13.5)\n(15.8)\n%\n$\n(24.8)\n(7.4)\n%\n$\n(52.0)\n(15.0)\n%\nDepreciation and amortization of property, plant and\n equipment\n1.9\n1.8\n7.2\n7.1\nInterest expense\n0.1\n0.1\n0.4\n0.4\nShare-based compensation\n0.5\n0.6\n2.2\n3.4\nE&O inventory write down\n—\n1.2\n—\n1.2\nWarehouse consolidation costs\n—\n—\n—\n0.2\nTransactional taxes assessments\n—\n—\n—\n0.6\nAmortization of intangible assets\n0.1\n0.1\n0.4\n0.4\nRestructuring charges\n0.2\n2.1\n4.9\n11.1\nProvision for (benefit from) income taxes\n(3.7)\n1.3\n(1.3)\n1.5\nAdjusted EBITDA\n$\n(2.5)\n(2.8)\n%\n$\n(6.3)\n(7.4)\n%\n$\n(11.0)\n(3.3)\n%\n$\n(26.1)\n(7.5)\n%\n(1) The adjustments above reconcile our GAAP financial results to the non-GAAP financial measures used by us. Our non-GAAP income or loss from continuing operations attributable to Aviat Networks excluded share-based compensation, E&O inventory write down, warehouse consolidation costs, transactional taxes assessments, amortization of intangible assets, restructuring charges and adjustment to reflect pro forma tax rate. Adjusted EBITDA attributable to Aviat Networks was determined by excluding depreciation and amortization on property, plant and equipment, interest expense, provision for or benefit from income taxes, and non-GAAP pre-tax adjustments, as set forth above, from the GAAP income from continuing operations attributable to Aviat Networks. We believe that the presentation of these non-GAAP items provides meaningful supplemental information to investors, when viewed in conjunction with, and not in lieu of, our GAAP results. However, the non-GAAP financial measures have not been prepared under a comprehensive set of accounting rules or principles. Non-GAAP information should not be considered in isolation from, or as a substitute for, information prepared in accordance with GAAP. Moreover, there are material limitations associated with the use of non-GAAP financial measures.\n(2) Revised to include a $0.4 million increase and a $0.1 million decrease in cost of services for the fourth quarter and fiscal year 2014, respectively, reflecting effects of the corrections to accrued cost of services revenue.\nTable 5\nAVIAT NETWORKS, INC.\nFiscal Year 2015 Fourth Quarter Summary\nSUPPLEMENTAL SCHEDULE OF REVENUE BY GEOGRAPHICAL AREA\n(Unaudited)\nQuarter Ended\nFiscal Year Ended\nJuly 3, 2015\nJune 27, 2014\nJuly 3, 2015\nJune 27, 2014\n(In millions)\nNorth America\n$\n38.5\n$\n37.2\n$\n153.2\n$\n142.0\nInternational:\nAfrica and Middle East\n27.9\n24.2\n97.1\n108.9\nEurope and Russia\n7.9\n7.9\n36.0\n36.0\nLatin America and Asia Pacific\n13.5\n16.1\n49.6\n59.1\n49.3\n48.2\n182.7\n204.0\nTotal Revenue\n$\n87.8\n$\n85.4\n$\n335.9\n$\n346.0\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/aviat-networks-announces-fourth-quarter-and-fiscal-year-2015-financial-results-300152157.html\nSOURCE Aviat Networks\nPR Newswire September 30, 2015 - 7:00 PM EDT Tags: COMMUNICATION EQUIPMENT TECHNOLOGY", "external_links": ["http://rt.prnewswire.com/rt.gif?NewsItemId=FL16656&Transmission_Id=201509301900PR_NEWS_USPR_____FL16656&DateId=20150930", "https://www.facebook.com/AviatNet", "http://www.prnewswire.com/news-releases/aviat-networks-announces-fourth-quarter-and-fiscal-year-2015-financial-results-300152157.html", "https://twitter.com/AviatNetworks", "http://www.aviatnetworks.com/", "https://www.linkedin.com/company/779638?trk=tyah", "http://investors.aviatnetworks.com/events.cfm"], "published": "2015-09-30T03:00:00.000+03:00", "crawled": "2015-10-01T03:30:25.705+03:00", "highlightTitle": ""}