{"organizations": [], "uuid": "9f2e8aac59b7b262107c92934feaddafb5acf72d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bio-medicine.org", "main_image": "", "site_section": "http://feeds.bio-medicine.org/latest-biology-technology", "section_title": "Latest Biology Technology from Bio-Medicine.Org", "url": "http://www.bio-medicine.org/biology-technology-1/Savolitinib-Completes-Enrolment-for-Phase-II-Clinical-Trial-in-Papillary-Renal-Cell-Carcinoma-34317-1/", "country": "US", "title": "Savolitinib Completes Enrolment for Phase II Clinical Trial in Papillary Renal Cell Carcinoma", "performance_score": 0, "site": "bio-medicine.org", "participants_count": 0, "title_full": "Savolitinib Completes Enrolment for Phase II Clinical Trial in Papillary Renal Cell Carcinoma", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T22:53:00.000+03:00", "replies_count": 0, "uuid": "9f2e8aac59b7b262107c92934feaddafb5acf72d"}, "author": "", "url": "http://www.bio-medicine.org/biology-technology-1/Savolitinib-Completes-Enrolment-for-Phase-II-Clinical-Trial-in-Papillary-Renal-Cell-Carcinoma-34317-1/", "ord_in_thread": 0, "title": "Savolitinib Completes Enrolment for Phase II Clinical Trial in Papillary Renal Cell Carcinoma", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Date:10/13/2015 \nLONDON , October 13, 2015 /PRNewswire/ -- \nHutchison China MediTech Limited (\"Chi-Med\") (AIM: HCM) today announces that Hutchison MediPharma Limited (\"HMP\"), its drug R&D subsidiary, and AstraZeneca AB (publ) (\"AstraZeneca\") have completed enrolment in a global Phase II study of savolitinib (AZD6094), a potent and highly selective mesenchymal epithelial transition factor (\"c-Met\") inhibitor. This is a Phase II study to evaluate the efficacy and safety of savolitinib monotherapy (600 mg once daily) in papillary renal cell carcinoma (\"PRCC\") in the United States , Canada and Europe . PRCC represents about 14% of all new cases of kidney cancer. \nSavolitinib is a potential global first-in-class inhibitor of c-Met, receptor tyrosine kinase, an enzyme which exhibits aberrant behaviour (e.g. gene amplification, over-expression and mutation) in many types of solid tumours. Savolitinib was developed as a potent and highly selective oral c-Met inhibitor that was designed to address renal toxicity, the primary issue that has to-date prevented other selective c-Met inhibitors from gaining regulatory approval. In Phase I/Ib clinical studies, savolitinib has shown promising signs of clinical efficacy, causing tumour size reduction, in c-Met aberrant patients in PRCC, non-small cell lung cancer, colorectal cancer and gastric cancer. \nThis Phase II study is an open-label, single-arm, multicentre study designed to evaluate the efficacy and safety of savolitinib in patients with locally advanced or metastatic PRCC. A total of 90 patients have been enrolled in 22 centres, making it the largest prospective clinical study in PRCC ever conducted. The primary objective of this study is to assess the anti-tumour activity of savolitinib in patients with PRCC, with secondary assessment objectives including progression free survival, duration of response, safety and tolerability and pharmacokinetics and pharmacodynamics. Importantly, tumour samples from each patient are concurrently being subjected to molecular analysis to determine c-Met status in order to better understand the relationship between c-Met aberration and clinical outcome. \nThe interim data of the Phase II trial is expected to be published at the American Society of Clinical Oncology meeting in 2016. \nAbout PRCC \nIn 2014, approximately 356,000 new cases of kidney cancer were observed globally, which is expected to grow to approximately 413,000 by 2020. Renal cell carcinoma accounted for approximately 87% of all new cases of kidney cancer globally, including approximately 263,000 new cases of clear cell renal cell carcinoma and approximately 48,000 new cases of PRCC. \nNo targeted therapies for PRCC have been approved and there are no standard first-line treatments specifically for metastatic PRCC. Anti-angiogenic drugs have shown limited activity against PRCC in retrospective studies, but very few prospective studies in pure papillary histology have been reported. In a retrospective study, investigators collect data from past records without conducting follow-up with patients, as is the case with a prospective study. \nAbout savolitinib for PRCC and other indications \nDuring the Australian Phase I study of savolitinib, positive outcomes among PRCC patients had a strong correlation to c-Met gene status. Three of eight PRCC patients treated achieved a partial response. One of these patients has been on the drug for over 2 years and has had tumour measurement reduction of greater than 85%. A further three of these eight PRCC patients achieved stable disease. Importantly, the level of tumour response among these eight PRCC patients appeared to correlate with c-Met gene status. \nCurrently, we and AstraZeneca, our partners on savolitinib, are conducting nine clinical studies of savolitinib monotherapy treatment as well as savolitinib in combination treatments with other tyrosine kinase inhibitors and chemotherapy in kidney, lung and gastric cancers. Furthermore, by the end of 2015, we expect to initiate three further proof-of-concept studies for savolitinib, two of which will involve combinations with immunotherapies. \nAbout Chi-Med \nChi-Med is a China -based globally-focused healthcare group which researches, develops, manufactures and sells pharmaceuticals and health-related consumer products. Its Innovation Platform focuses on discovering and developing innovative therapeutics in oncology and autoimmune diseases for the global market. Its Commercial Platform manufactures, markets and distributes prescription drugs and consumer health products in China . \nChi-Med is majority owned by the multinational conglomerate CK Hutchison Holdings Limited (SEHK: 0001). For more information, please visit: http://www.chi-med.com . \nEnquiries", "external_links": [], "published": "2015-10-13T22:53:00.000+03:00", "crawled": "2015-10-13T16:16:05.358+03:00", "highlightTitle": ""}