{"organizations": [], "uuid": "af58893956876e4d026f2c95abff4052ee54f50c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1134864/stream-tv-receives-lumiere-award", "country": "US", "title": "Stream TV Receives Lumiere Award", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "Stream TV Receives Lumiere Award", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T03:18:00.000+03:00", "replies_count": 0, "uuid": "af58893956876e4d026f2c95abff4052ee54f50c"}, "author": "admin", "url": "http://www.freshnews.com/news/1134864/stream-tv-receives-lumiere-award", "ord_in_thread": 0, "title": "Stream TV Receives Lumiere Award", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  Stream TV Networks, Inc. \nHOLLYWOOD, Calif., Sept. 30, 2015 /PRNewswire/ -- Stream TV Networks, Inc. is pleased to announce that it has been honored by the Advanced Imaging Society for its Ultra-D glasses-free 3D technology. Presentation of the Lumiere Award, the Society's highest honor for technology innovation, comes as mass production of Ultra-D displays hits high gear with Taiwanese manufacturing partner Pegatron. The 65\" premiere product is currently being placed in high profile public installations and positioned for consumer and digital signage sale through various online and brick-and-mortar retailers in 2016. \nhttps://photos.prnewswire.com/prnvar/20150930/272794 \n\"Recognition from the Advanced Imaging Society is a great validation of what our team has worked hard to achieve,\" said Stream TV CEO Mathu Rajan. \"When your peers acknowledge you as best in class, it means a lot.\" \nBuilt on 4K panel technology, Ultra-D features a stunning 140-degree glasses-free 3D image without \"dead\" or \"sweet\" spots and offers real-time conversion from any 2D or 3D source using patented hardware, middleware and sophisticated-software algorithms. With adjustable depth that can be customized to their liking, viewers are transported into an unrivaled real-world 3D experience. \n\"Each year we honor breakthrough products which excite consumers and filmmakers alike,\" said Jim Chabin, President of the Advanced Imaging Society. \"Stream TV's Ultra-D brings high quality 3D TV and movies to life, glasses-free, and that excited our judges.\" \nStream TV received its Lumiere Award at the Advanced Imaging Society's annual Technology & New Product Awards ceremony held at Paramount Studios in Hollywood earlier today. \nABOUT STREAM TV NETWORKS, INC: Stream TV is a Philadelphia-based technology company founded to develop enhanced entertainment and communications experiences. Stream TV's breakthrough Ultra-D technology is the only proprietary glasses-free 3D solution that delivers both a stunning visual display as well content conversion from any 2D or 3D source. Learn more at www.ultra-d.com and www.movebeyond3D.com \nABOUT ADVANCED IMAGING SOCIETY: The International 3D & Advanced Imaging Society was founded by our industry's creative stakeholders in 2009 to advance the creative arts and sciences of the advanced imaging industry. The organization has more than 1,800 professional members in over 20 countries active in improving the arts and technologies of 3D & Advanced Imaging. Learn more at www.advancedimagingsociety.com . \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/stream-tv-receives-lumiere-award-300152228.html \nSOURCE Stream TV Networks, Inc.", "external_links": [], "published": "2015-10-01T03:18:00.000+03:00", "crawled": "2015-10-01T04:44:28.185+03:00", "highlightTitle": ""}