{"organizations": [], "uuid": "b1dfbba80ba91b881e2adf4a5c1de04aa90723b6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "campustechnology.com", "main_image": "", "site_section": "http://campustechnology.com/rss-feeds/news.aspx", "section_title": "Campus Technology: News", "url": "http://campustechnology.com/articles/2015/10/05/new-cloud-entrant-in-student-admissions-ties-to-financial-and-hr.aspx", "country": "US", "title": "New Cloud Entrant in Student Admissions Ties to Financial and HR", "performance_score": 0, "site": "campustechnology.com", "participants_count": 0, "title_full": "New Cloud Entrant in Student Admissions Ties to Financial and HR", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T16:15:00.000+03:00", "replies_count": 0, "uuid": "b1dfbba80ba91b881e2adf4a5c1de04aa90723b6"}, "author": "", "url": "http://campustechnology.com/articles/2015/10/05/new-cloud-entrant-in-student-admissions-ties-to-financial-and-hr.aspx", "ord_in_thread": 0, "title": "New Cloud Entrant in Student Admissions Ties to Financial and HR", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Dian Schaffhauser"], "text": "New Cloud Entrant in Student Admissions Ties to Financial and HR By Dian Schaffhauser 10/05/15 \nWorkday, a company better known for its cloud-based HR and financial systems software, is releasing Student Admissions, an application to help institutions with enrollment. This comes just about a year after the company kicked off its first \"mobile-first\" application for higher ed, Student Recruiting. Both programs integrate with Workday's Human Capital Management (HCM) and Financial Management software. \nThe announcement came during the company's user conference, which took place last week. During the same event, Workday also unveiled a learning application for managing career development. \nWorkday Student Admissions, as it's being called, is the second application available in the Student suite. \nFunctionality includes an eligibility framework that lets schools define a set of application requirements that can be further configured for specific academic divisions, departments and programs of study. \nInstitutions will be able to create \"applicant pools\" based on categories such as program, region and standardized test scores to allow admissions advisors to analyze data and identify trends. \nWorkday Student Admissions \nWith a tie-in to Workday HCM, applicant pools may also be assigned to specific counselors and their workloads managed. For example, those applicants for a particular program could be pooled and assigned to a set of advisors, who could coordinate response and track students as a group. That same integration would allow administrators to track admission staff performance against admission goals. \nThe program will enable automatic assignment of application rating values based on criteria such as readiness, demonstrated interest and the outcome of applicant interviews, including prerequisite coursework and standardized test scores derived through data from the Student Recruiting module. \nApplicants will be able to view the status of outstanding items tied to their application. And the program includes features to help schools communicate with individuals or groups of applicants electronically and by mail. \nThe director dashboard within Workday Student Admissions \nThe student admissions program is available as part of the company's latest release, Workday 25, which also has enhancements to its financial, HCM and recruiting modules. \nThe company said future components of the Student suite would address management of curriculum, student records, academic advising, financial aid and student financials. The portfolio in its entirety is expected to be completed by the end of next year. \nAccording to the company, 20 colleges and universities have provided feedback for the design of the program, which is also mobile enabled. \nFlorida's Tallahassee Community College , which was part of that feedback process, noted that participation was \"invaluable.\" \"Student success is at the core of what we do. We take that responsibility seriously, with more than 12,000 students selecting our college each year with the goal of transferring to a university or moving directly towards a career,\" said Shanna Autry, director of student success and retention, in a press release. \"It's invaluable to be part of the design process for Workday Student, because it helps us ensure that we have a system that supports future efforts, and enables our faculty and staff to efficiently and effectively recruit and admit the best students for our program.\" \nWorkday's new Learning program will use data taken from Workday HCM to understand where a person resides in the \"employee lifecycle\" — new to the organization, recently promoted or lacking specific skills for a current position — and make recommendations for training. The program was expected to be available in the second half of 2016. \nCalifornia College of the Arts , an institution that has evaluated the company's plans for Learning, said it appeared to have the \"potential\" to meet the training needs of its staff and faculty. \"Learning built into Workday HCM will serve as a community-wide tool that can help overcome many of the boundary limitations found in a traditional LMS where the line between community members are hardened, and social and collaboration components are bolted on rather than unified in one system,\" said CIO Mara Hancock in a prepared statement \nOther higher education customers of Workday include New York's Cornell University , California's Grossmont-Cuyamaca Community College District and Vermont's Champlain College . About the Author \nDian Schaffhauser is a writer who covers technology and business for a number of publications. Contact her at dian@dischaffhauser.com .", "external_links": [], "published": "2015-10-05T16:15:00.000+03:00", "crawled": "2015-10-06T14:23:57.654+03:00", "highlightTitle": ""}