{"organizations": [], "uuid": "24ae485c62cf6423f86b50ba21077fd2cd35ce5f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.marketwatch.com", "main_image": "http://s.marketwatch.com/public/resources/MWimages/MW-BQ446_deutsc_MG_20131205232945.jpg", "site_section": "http://www.marketwatch.com/companies/microchip-technology?prop=location&propval=europe", "section_title": "Microchip Technology - MarketWatch.com Topics", "url": "http://www.marketwatch.com/story/european-stocks-eye-third-straight-win-but-commodities-shares-take-china-hit-2015-10-19", "country": "US", "title": "European stocks eye third straight win, but commodities shares take China hit - MarketWatch", "performance_score": 0, "site": "marketwatch.com", "participants_count": 1, "title_full": "European stocks eye third straight win, but commodities shares take China hit - MarketWatch", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "24ae485c62cf6423f86b50ba21077fd2cd35ce5f"}, "author": "Carla Mozee", "url": "http://www.marketwatch.com/story/european-stocks-eye-third-straight-win-but-commodities-shares-take-china-hit-2015-10-19", "ord_in_thread": 0, "title": "European stocks eye third straight win, but commodities shares take China hit - MarketWatch", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Deutsche Bank’s management structure is undergoing a makeover. European stocks rose Monday, with Deutsche Bank AG shares higher after an overhaul at the banking heavyweight, but commodity stocks suffered after official data showed the slowest economic growth in China since 2009.\nThe Stoxx Europe 600 SXXP, +0.49% rose 0.6% to 365.26. All sectors headed higher except for the basic materials SXPP, -0.88% sector and the oil and gas group SXEP, +0.24% Those sectors fell after Chinese government data showed growth slowed to 6.9% in the third quarter , the first time since the financial crisis that the country’s gross domestic product has grown less than 7%.\nInvestors later this week will watch for any comments that European Central Bank President Mario Draghi may have about China and what impact its slowdown is having on the eurozone economy and companies. The ECB will release its monetary policy decision on Thursday.\nChina weighs: Commodity stocks were hurt after the report from China, a major market for metals and energy products. Oil prices CLX5, -1.29% were down 1% , and prices for gold GCZ5, -0.87% copper HGZ5, -0.71% and other metals were weighed by concerns about softer demand.\nAmong mining shares, Anglo American PLC AAL, -3.95% slumped 5.3%, Sweden’s Boliden AB BOL, -1.54% fell 2.4%, and Glencore PLC GLEN, -2.07% GLCNF, -2.07% lost 2.9%. Among oil and gas producers, Tullow Oil PLC TLW, -1.97% was down 1.7%, and OMV AG OMV, -1.49% declined 1.2%.\nThe commodity sector losses hurt the U.K.’s FTSE 100 UKX, -0.02% as that index is heavily weighted by resource stocks. The London index lagged other European benchmarks, off 0.2% at 6,365.90.\nChina’s 6.9% growth rate was better than the 6.8% rate expected in a Wall Street Journal poll of analysts, but the report showed China’s economy didn’t significantly strengthen even after a round of stimulus measures from Beijing.\nAsian markets were mixed after the data, “as the initial euphoria of a beat in Chinese Q3 GDP growth ... was replaced with the sobering reality of the challenges that remain in managing elevated debt and a declining working age population,” wrote Simon French, chief economist at Panmure Gordon & Co., in a note.\nThe Stoxx Europe 600 last week posted a small weekly rise of 0.1%.\nMovers: Deutsche Bank AG DBK, +3.23% shares were among the standouts in European trade Monday. Shares rose 3.7% after the German lender, under new co-CEO John Cryan, overhauled its senior management ranks and outlined a broad restructuring of key units.\n“The reorganization has Cryan’s footprint all over it. Another step in the right direction, in our view,” said Jefferies analyst Joseph Dickerson in a note.\nDeutsche Bank shares topped Germany’s DAX 30 DAX, +0.81% which itself rose 0.8% to 10,185.26.\nMeanwhile, shares of Metro AG MEO, +2.92% rose 3% after the German retailer said fiscal fourth-quarter sales fell because of currency losses and the costs of portfolio adjustments.\nDanone SA BN, +2.39% shares climbed 2.1% after the French dairy company posted a rise in third-quarter sales , boosted by a strong performance in Europe and growth in its units selling water and baby food.\nDanone was the best performing stock on France’s CAC 40 PX1, +0.40% The index gained 0.4% at 4,720.60.\nMore from MarketWatch", "external_links": [], "published": "2015-10-19T03:00:00.000+03:00", "crawled": "2015-10-19T12:17:25.703+03:00", "highlightTitle": ""}