{"organizations": ["Galway University", "Plymouth University", "Marine Institute Ireland"], "uuid": "bc9b405039c6743f1a5c6453251627d38b8f1db6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.terradaily.com", "main_image": "http://www.spxdaily.com/images-bg/cold-water-coral-reef-deep-ocean-floor-bg.jpg", "site_section": "http://www.terradaily.com/terradaily.xml", "section_title": "Earth News, Earth Science, Energy Technology, Environment News", "url": "http://www.terradaily.com/reports/Marine_mathematics_helps_to_map_undiscovered_deep_water_coral_reefs_999.html", "country": "US", "title": "Marine mathematics helps to map undiscovered deep-water coral reefs", "performance_score": 0, "site": "terradaily.com", "participants_count": 0, "title_full": "Marine mathematics helps to map undiscovered deep-water coral reefs", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T07:39:00.000+03:00", "replies_count": 0, "uuid": "bc9b405039c6743f1a5c6453251627d38b8f1db6"}, "author": "", "url": "http://www.terradaily.com/reports/Marine_mathematics_helps_to_map_undiscovered_deep_water_coral_reefs_999.html", "ord_in_thread": 0, "title": "Marine mathematics helps to map undiscovered deep-water coral reefs", "locations": ["UK"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Cefas"], "text": "Marine mathematics helps to map undiscovered deep-water coral reefs by Staff Writers Plymouth, UK (SPX) Oct 15, 2015 An image from one of the newly discovered cold water coral reefs at a depth of 813 meters. Image courtesy Plymouth University, Galway University, Cefas, Marine Institute Ireland. For a larger version of this image please go here . \nA team of marine scientists has discovered four new deep-water coral reefs in the Atlantic Ocean using the power of predictive mathematical models. Located at depths of up to 1.2km, in seas west of Ireland, the reefs were identified by a modelling system developed at Plymouth University that predicts occurrence according to conditions favourable to coral. \nResearchers from Plymouth, the Centre for Environment, Fisheries and Aquaculture Science (Cefas), and the National University of Ireland Galway (NUI Galway), then confirmed their existence during a two-week expedition, using an underwater robot to obtain video evidence. \nThe team has hailed the experiment as a breakthrough in pinpointing and potentially protecting these delicate habitats. Project lead Dr Kerry Howell, Associate Professor in the School of Marine Science and Engineering at Plymouth University, said: \"We're delighted with these results. It means we can now produce maps of where coral is likely to be for large areas of the deep-sea that we have not yet visited, and use them to identify high value ecological areas that might need protection from damaging activities.\" \n\"The models work by looking at where we know deep-water coral reefs are found, identifying what is favourable environment for the corals, for example their favourite depths, and then looking for areas with the same or similar conditions,\" added Dr Anthony Grehan, from NUI Galway. \"If conditions are very similar then there is a high likelihood we will find corals.\" \nFunded by the European Union 'Eurofleets' programme, and supported by the Marine Institute (MI) of Ireland's ship time fund, the team spent two weeks aboard the RV Celtic Explorer, and used its underwater robot, Holland I, to search at locations predicted as highly likely to support coral reefs. On each occasion it was deployed, Holland I found coral reefs. \nThe team also searched for deep-sea sponge fields, but found the models to be less accurate, with a 50% success rate. \nAnna Downie, from Cefas, said: \"We know much less about these important habitats and that limits the information upon which we can build our models. We need to do more work to better understand how deep-sea sponges live.\" \nThe production of accurate coral reef models has only been made possible by scientists having access to high resolution multibeam sonar maps of the seabed. Multibeam technology uses sound to 'visualise' the seafloor, and countries such as Ireland and Norway (in contrast to the UK) have mapped large areas of their territorial waters. \nExtensive use was made of the Irish National Seabed Survey high resolution bathymetric charts in developing the models tested during this survey. The team expect to publish their findings in the near future and make the maps available for all to use. Dr Howell said: \"Our cold water coral reef models are now good enough to be used to better target areas that have not previously been explored, and this can greatly reduce the cost of future survey work.\" .", "external_links": [], "published": "2015-10-15T07:39:00.000+03:00", "crawled": "2015-10-15T12:41:30.565+03:00", "highlightTitle": ""}