{"organizations": [], "uuid": "036e1d51b619562317c7d5cceed9b57c1b7209d3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com/news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1144703/wipro-taps-ibm-bluemix-speed-development-mobile-analytics-apps", "country": "US", "title": "Wipro Taps IBM Bluemix to Speed Development of Mobile, Analytics Apps", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "Wipro Taps IBM Bluemix to Speed Development of Mobile, Analytics Apps", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T13:00:00.000+03:00", "replies_count": 0, "uuid": "036e1d51b619562317c7d5cceed9b57c1b7209d3"}, "author": "admin", "url": "http://www.freshnews.com/news/1144703/wipro-taps-ibm-bluemix-speed-development-mobile-analytics-apps", "ord_in_thread": 0, "title": "Wipro Taps IBM Bluemix to Speed Development of Mobile, Analytics Apps", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Submitted by admin on 10/23/2015 @ 3:00 AM   IBM \nARMONK, N.Y. and BANGALORE, India, Oct. 23, 2015 /PRNewswire/ -- IBM (NYSE: IBM ) and Wipro Ltd. (NYSE: WIT), a global information technology, consulting and business process services company today announced a collaboration in which Wipro will use the IBM Bluemix cloud development platform for the agile creation and deployment of mobile, analytics and machine learning solutions for clients around the world. As part of the effort, Wipro has committed to train and engage 15,000 of its developers on the platform through a massive online open course across 58 countries. This team of developers will leverage Bluemix as a development platform, resulting in the introduction of new value-added services for the customers of Wipro through Wipro Analytics solutions. \nhttp://photos.prnewswire.com/prnvar/20090416/IBMLOGO \nBluemix leverages open technologies to give developers greater scalability and flexibility to build, deploy and manage cloud applications quickly and easily. \nWipro is already investing in solutions onboarding on the Bluemix platform. These include the Data Discovery Platform, an integrated solution capturing and managing data to generate actionable insights through advanced analytics; Big Data Ready Enterprise which optimizes and integrates various big data solutions; and Wipro Apollo, an anomaly detection platform for fraud, risk and compliance. \nWipro will leverage more than 100 services through IBM's public Bluemix catalog as well as Bluemix Dedicated - a private-cloud version that developers can use to build apps involving sensitive data. With a growing list of demands for scalability, security and capacity, IBM will tap into Wipro's global talent pool to accelerate the release of new Bluemix features. \n\"Today's developers need to quickly collect, analyze and make sense of massive data sets in ways that haven't been possible before in advanced analytics development practices,\" said Robert LeBlanc, Senior Vice President, IBM Cloud. \"The synergies that are created as a result of this collaboration will create competitive advantages for our customers by helping them leverage the IBM Cloud to speed data analysis, speed application deployment and speed time to market for their products and services.\" \nWipro and IBM will also host Wipro's developers and customers at IBM's Bluemix Garages in London, San Francisco or Toronto, where they will have an opportunity to learn agile development practices in a startup atmosphere. These garages serve as central locations for developers, product managers and designers from startups to enterprises to collaborate and learn from each other as they build cloud applications alongside Wipro developers using Bluemix. \n\"Wipro's objective is to be a premium partner to its customers and an industry technology leader through our expertise in Analytics Transformation,\" said Jeff Heenan-Jalil, Senior Vice President - Analytics, Wipro Ltd. \"This agreement with IBM provides a platform where Wipro can provide greater value to our clients.\" \nIBM launched Bluemix with a $1 billion investment in 2014, maturing quickly to become the largest Cloud Foundry deployment in the world. The developer-friendly platform provides access to over 120 tools as well as the services of the most prominent open-source technologies combined with IBM and third-party services, allowing developers to focus all of their energy on the creation of enterprise class cloud applications at consumer scale. \nAbout Wipro Ltd. Wipro Ltd. (NYSE:WIT) is a leading Information Technology, Consulting and Business Process Services company that delivers solutions to enable its clients do business better. Wipro delivers winning business outcomes through its deep industry experience and a 360 degree view of \"Business through Technology\" - helping clients create successful and adaptive businesses. A company recognized globally for its comprehensive portfolio of services, a practitioner's approach to delivering innovation, and an organization wide commitment to sustainability, Wipro has a workforce of over 150,000, serving clients in 175+ cities across 6 continents. For more information, please visit www.wipro.com. \nAbout IBM Cloud For more information on IBM Cloud visit: www.ibm.com/cloud-computing . \nWipro media contact:", "external_links": [], "published": "2015-10-23T13:00:00.000+03:00", "crawled": "2015-10-23T15:59:25.307+03:00", "highlightTitle": ""}