{"organizations": [], "uuid": "82d86cc45185a2521e55f30100e2590a5932b536", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.philly.com", "main_image": "http://media.philly.com/images/rrazz02z-a600101.JPG", "site_section": "http://www.philly.com/mld/philly/business/technology/rss.xml", "section_title": "Philly.com Technology", "url": "http://www.philly.com/philly/business/technology/20151002_Impresarios_make_a_hit_at_the_Prince.html", "country": "US", "title": "Impresarios make a hit at the Prince", "performance_score": 0, "site": "philly.com", "participants_count": 0, "title_full": "Impresarios make a hit at the Prince", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T08:36:00.000+03:00", "replies_count": 0, "uuid": "82d86cc45185a2521e55f30100e2590a5932b536"}, "author": "", "url": "http://www.philly.com/philly/business/technology/20151002_Impresarios_make_a_hit_at_the_Prince.html", "ord_in_thread": 0, "title": "Impresarios make a hit at the Prince", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jonathan Takiff"], "text": "Jonathan Takiff, Inquirer Staff Writer Posted: Friday, October 2, 2015, 1:08 AM \nLife is a cabaret for Robert Kotonly and Rory Paull, a show biz-lovin' team who have just opened the Rrazz Room at the Prince, and who also run a full-time Rrazz Room in New Hope, plus the \"Rrazz Room Presents\" series at arts centers in Coral Springs and South Miami-Dade, Fla. \nTheir Chestnut Street spot got off to a reasonable start two weekends ago with a near-sellout of the Prince's cozy 156-seat Black Box space for Broadway songstress Karen Mason. The next night, 160 paid to see two shows by the seriously divine drag queen singer and comedian Charles Busch. \n\"Not bad,\" said Kotonly, \"considering all the pope-visit concerns. And we didn't have our liquor license approved,\" an issue since resolved. \nAs of Thursday, there were \"five single tickets\" left to sell, collectively, for this weekend's two \"intimate evenings\" on Friday and Saturday with politically charged comedy legends Paul Mooney and Dick Gregory. \nAnd advance sales for upcoming Rrazz Shows at the Prince, announced through January, are \"looking quite good,\" Kotonly said. Big draws include song and dance man Tommy Tune (Oct. 9 and 10), a beefy boy band-cum-string quartet named Well-Strung (Nov. 6 and 7), jazzy thrush Storm Large (of Pink Martini) on Nov. 12, Diana Ross' torch soul offspring Rhonda Ross (Nov. 13), and old school cabaret chanteuse Andrea Marcovicci (Nov. 15). \nBetween their four venues, talent booker Kotonly and business-focused Paull are now putting on close to 200 shows a year with artists from the theater and club worlds, \"mixed with comedy and R&B talents in markets where that works, like Philadelphia.\" \nYes, it's a labor of love for both producers and their talent, \"but we wouldn't do it and the acts wouldn't leave home if it wasn't financially viable,\" Kotonly said. \nArtist demands are variable. \"Some want a fixed fee; others negotiate a percentage of the gate,\" he said, but even in the small Prince space, with tickets priced \"on different nights from $27 to $90,\" an act can \"easily walk away with several thousand dollars\" for a show. \nThe deals could be sweeter, Kotonly figures, if he and Paull can live out their fantasy of Rrazz Rooms popping all over the country. \n\"We talk about it a lot, franchising the name and concept: intimate spaces with quality artists, where the customer is treated well and really connects with the talent,\" Kotonly said. \"I'd block-book the talent, offering performers dates from coast to coast. In truth, that would make my job a whole lot easier.\" \nAnd it would please scene-makers like Busch, who cracked here that his/her \"tour\" demanded large leaps \"from San Francisco to Palm Beach with a stop along the way in the cultural capital of Three Oaks, Mich. . . . and now, Philadelphia.\" \nBest buds since college (University of Miami) and business partners first in a North Jersey travel agency, Kotonly and Paull shifted into promoting with guidance \"from a client/friend who was running the Apollo Theater and showed us the ropes.\" \nEverything started coming up roses after they moved to San Francisco, enjoyed a 10-year run of fun with Rrazz Rooms at two SF hotels, connecting with almost everyone working the glittery, glam, and often gay scene. \nBut after a falling-out with the Nikko Hotel (its cabaret room is now billed Feinstein's) and \"homesick for the East Coast,\" the Rrazzsters shifted operations a few years ago to nurture their show series in Florida and open a full-time Rrazz Room in New Hope, now at a Ramada Inn but moving soon to the Raven, an LGBT-friendly inn. \"They're starting us in a 90-seat space, pinching our booking budget. But they're building us a 350-400 seater we'll occupy by May. That will open up much bigger options for talent bookings,\" Kotonly said. \nTheir deal with the Prince is a one-hand- washes-the-other situation. Cabaret shows first became a staple in the cozy, third-floor \"Black Box\" space when Marjorie Samoff ran the complex as the American Music Theater Festival, from 1999 to its bankruptcy in 2012. \nShows continued under new management as Morgan's Cabaret in the 2013-14 season. After the death of a prime backer, the Philadelphia Film Society jumped in to buy the building, with support from the Wyncote Foundation. The Rrazz guys, long lusting for a Philly venue, pitched to take over the upstairs spot. \n\"We looked at their history, the room's history and the local club scene otherwise devoid of this kind of entertainment, and decided that they were the right guys with the right concept,\" Prince general manager Anthony Morrison said. takiffj@phillynews.com \n215-854-5960", "external_links": [], "published": "2015-10-02T08:36:00.000+03:00", "crawled": "2015-10-02T11:44:58.987+03:00", "highlightTitle": ""}