{"organizations": [], "uuid": "c03c19d8c4975897d583f24652dda4399fc3442f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.marketwatch.com", "main_image": "http://s.marketwatch.com/public/resources/MWimages/MW-DI270_allin__MG_20150324154208.jpg", "site_section": "http://www.marketwatch.com/companies/akamai_technologies_inc", "section_title": "Akamai Technologies Inc - MarketWatch.com Topics", "url": "http://www.marketwatch.com/story/the-market-in-a-minute-is-it-time-to-go-all-in-2015-10-12", "country": "US", "title": "The market in a minute: Is it time to go all in? - MarketWatch", "performance_score": 0, "site": "marketwatch.com", "participants_count": 1, "title_full": "The market in a minute: Is it time to go all in? - MarketWatch", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "c03c19d8c4975897d583f24652dda4399fc3442f"}, "author": "Oliver Pursche", "url": "http://www.marketwatch.com/story/the-market-in-a-minute-is-it-time-to-go-all-in-2015-10-12", "ord_in_thread": 0, "title": "The market in a minute: Is it time to go all in? - MarketWatch", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Shutterstock Earnings season kicks into high gear this week, and investors are hoping that stocks will follow through on last week's 3%-plus rally. The holiday-shortened week will have plenty of economic data, both domestic and international for market participants to analyze, and could be volatile. Wednesday's eurozone Industrial Production and Thursday's consumer comfort data are likely the most critical figures a \"global\" Fed will focus on as it entertains the possibility of raising U.S. interest rates, especially given the IMF's most recent downgrade of global GDP.\nThe trade\nI expect a strong earnings season and view the industrial, technology and banking sectors as potentially biggest gainers, so I'm going all in. Looking further ahead, I see some trouble after Thanksgiving when political matters will likely come to the forefront. Take advantage of the rally to purchase some December puts, pricing should be cheap.\nThis week' market-moving events\nMonday: Chinese and Indian economic data, Bank of Japan minutes Tuesday: Small-business optimism index, Redbook , Chinese inflation data. CSX Corp CSX, -2.13% Intel INTC, -0.05% Johnson & Johnson JNJ, +0.59% JP Morgan Chase JPM, -0.39% report Wednesday: EU industrial production, U.S. mortgage applications, producer-price index, retail sales, business inventories, beige book. Well Fargo WFC, +0.06% reports Thursday: Consumer price index, jobless claims, Empire State manufacturing survey, consumer-comfort index, Philly Fed business outlook. CitiGroup C, -0.58% Goldman Sachs GS, +0.26% Phillip Morris MO, +0.70% Slumberger SLB, -2.13% report. Friday: Industrial production, Job Opening and Labor Turnover Statistics (JOLTS), consumer sentiment, Atlanta Fed business inflation expectations. General Electric GE, -0.04% reports. More from MarketWatch", "external_links": [], "published": "2015-10-12T03:00:00.000+03:00", "crawled": "2015-10-12T18:21:44.666+03:00", "highlightTitle": ""}