{"organizations": [], "uuid": "b94efbfe12190a739ac7a345d649975b55dd0a03", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.morningstar.com", "main_image": "", "site_section": "http://news.morningstar.com/all/dow-jones/technology.aspx", "section_title": "News Archive: Technology", "url": "http://news.morningstar.com/all/dow-jones/technology/201510111211/with-market-on-their-side-electric-utilities-skip-fight-against-carbon-rule.aspx", "country": "US", "title": "With Market on Their Side, Electric Utilities Skip Fight Against Carbon Rule", "performance_score": 0, "site": "morningstar.com", "participants_count": 1, "title_full": "With Market on Their Side, Electric Utilities Skip Fight Against Carbon Rule", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T03:00:00.000+03:00", "replies_count": 0, "uuid": "b94efbfe12190a739ac7a345d649975b55dd0a03"}, "author": "morningstar.com", "url": "http://news.morningstar.com/all/dow-jones/technology/201510111211/with-market-on-their-side-electric-utilities-skip-fight-against-carbon-rule.aspx", "ord_in_thread": 0, "title": "With Market on Their Side, Electric Utilities Skip Fight Against Carbon Rule", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Rebecca Smith\nU.S. coal companies and at least 16 state governments are working on challenges to the Obama administration's new rule limiting carbon emissions from power plants. Most electric utilities have a different strategy: They are embracing it.\nFrom Dominion Resources Inc. in Virginia to Dynegy Inc. in Houston to Ohio's FirstEnergy Corp., electricity producers say they plan to comply rather than contest the regulation.\nThe main reason, executives and experts say, is that economic forces are pushing the power industry inexorably toward a lower-carbon future.\n\"Everybody is moving in this direction anyway,\" said Dominion Chief Executive Tom Farrell.\nThe new regulations just add certainty to companies' plans to move away from relying on coal to generate electricity, turning instead toward cheap natural gas as well as renewable energy, which is available at increasingly lower cost.\n\"Price is a larger force in electricity markets today than what Washington is doing with regulations,\" said Todd Carter, president of Panda Power Funds, a private-equity investor and generating-plant developer based in Dallas.\nPanda Power Funds is building a huge gas-fired power station in central Pennsylvania, adjacent to a 65-year-old coal plant that closed down last year. Building near the old facility means Panda can reuse existing infrastructure like transmission lines and an electrical substation to save money.\nSwitching from an old coal plant to a modern natural-gas one can cut carbon-dioxide emissions by between 50% and 60% for each megawatt hour of electricity produced, according to the Environmental Protection Agency.\nAnd although coal also remains a relatively cheap fuel, natural-gas plants can produce power at lower prices and are often much more profitable for the companies that own them.\n\"Our coal assets are still running but they're not making any money,\" said Bob Flexon, CEO of Dynegy, an independent supplier whose generating capacity is about 45% coal and 55% gas. \"All the earnings are coming from our gas portfolio.\"\nThat is partly because of the way electricity markets work. In much of the U.S., grid operators take bids from generators every day, tapping the lowest-cost resources first--often natural-gas plants.\nBut the market price is set by the last producer needed to meet that day's electricity demand, which tends to be a coal plant. So natural-gas plants can often offer electricity at prices lower than coal plants but collect the higher price set by coal units.\nIn the wake of the U.S. shale boom, natural gas has become so abundant and so inexpensive--and forecasters expect it to remain so for years--that the EPA's new carbon rule has provisions that prevent utilities from relying too much on a single fuel. Instead, the EPA regulation encourages development of renewable-energy projects.\nCoal consumption by utilities fell so much in the first four months of the year that it may be headed toward a 25-year low, according to data released in August by the U.S. Energy Information Administration.\n\"The bulk of utilities have already started to make the transition away from coal,\" said Jeremy Fago, PricewaterhouseCoopers LLP's power and utilities deals leader. He said the rule's emphasis on green electricity means \"it effectively creates a national renewable-energy policy.\"\nTo be sure, not every utility has agreed to go along with the EPA's 15-year plan to cut carbon dioxide emissions from the power industry by 32% compared with 2005. Implementation is being left to the states, which must come up with plans to comply or face direct regulation from Washington.\nSo far, at least 16 states have expressed opposition to the regulation, and some are likely to file a formal suit once the EPA publishes the carbon rule in the Federal Register, which is expected to happen this month.\nSome companies are testing the political winds in their states or are still analyzing the potential impact on customer bills and company earnings. Edison Electric Institute, which represents shareholder-owned utilities, is staying out of legal contests while working with utilities and states to plot a path forward.\nNorth Carolina-based Duke Energy Corp., with utilities in the Midwest and Carolinas, is undecided. Lynn Good, Duke's chief executive, recently told investors that her experts continue to analyze the plan, though she noted, \"I think there's flexibility there.\"\nSome utilities are hedging their bets. Ohio-based American Electric Power Co. is urging the 11 states in which it operates utilities to draft carbon-reduction plans. But it is also participating in the Utility Air Regulatory Group, a loose federation of energy companies that has challenged the low-carbon rule in the past and may do so again.\nRenewable energy is becoming more financially attractive for utilities. A recent survey by the Energy Department found that utilities paid 66% less for wind power purchased under long-term contracts in 2014 than 2009, making it extremely competitive with electricity from the latest gas-fired plants.\nSouthern Power, a unit of Atlanta-based Southern Co., recently installed its first wind turbine at a 299-megawatt project in Kay County, Okla. It also announced the purchase in August of controlling interest in the 200-megawatt Tranquility solar facility in Fresno County, Calif., from Recurrent Energy, a unit of Canadian Solar Inc.\nWhen combined with other existing and announced projects, these developments will boost Southern Power's green portfolio to a production amount equivalent to three big fossil-fuel plants, though production will be less because the wind doesn't always blow and the sun doesn't always shine.\nThe company made more electricity using natural gas than coal in the second quarter, something so unusual it was highlighted in an earnings call. Nevertheless, Southern said it is still studying the rule and deciding what its next steps will be.\nWrite to Rebecca Smith at rebecca.smith@wsj.com\n 11, 2015 19:48 ET (23:48 ", "external_links": ["http://im.mstar.com/Im/Mbr/Form_PremCheckbox_Checked.gif", "http://s7.addthis.com/static/btn/sm-share-en.gif", "http://www.addthis.com/bookmark.php?v=250", "http://im.mstar.com/Im/Mbr/Form_PremCheckbox_Unchecked.gif"], "published": "2015-10-11T03:00:00.000+03:00", "crawled": "2015-10-12T04:03:48.164+03:00", "highlightTitle": ""}