{"organizations": ["Qualcomm Technologies", "Xilinx Collaborate to Deliver Industry-Leading Heterogeneous Computing Solutions for Data Centers", "Xilinx, Inc.", "New Levels of Efficiency", "Xilinx", "Xilinx Collaborate", "Qualcomm Technologies, Inc.", "Facebook", "Qualcomm Incorporated", "New Levels of Efficiency and Performance Qualcomm", "Qualcomm"], "uuid": "658beedec5462c056de0e673c597c10343b49159", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "science-technology.news-articles.net", "main_image": "", "site_section": "http://science-technology.news-articles.net/content/rss.php", "section_title": "Science and Technology @ News Articles Network", "url": "http://science-technology.news-articles.net/content/qualcomm-xilinx-collaborate-deliver-industry-leading-heterogeneous-computing-solutions-data-centers-new-levels-efficiency-performance.xhtml", "country": "US", "title": "Qualcomm and Xilinx Collaborate to Deliver Industry-Leading Heterogeneous Computing Solutions for Data Centers with New Levels of Efficiency and Performance", "performance_score": 0, "site": "news-articles.net", "participants_count": 0, "title_full": "Qualcomm and Xilinx Collaborate to Deliver Industry-Leading Heterogeneous Computing Solutions for Data Centers with New Levels of Efficiency and Performance", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:34:00.000+03:00", "replies_count": 0, "uuid": "658beedec5462c056de0e673c597c10343b49159"}, "author": "", "url": "http://science-technology.news-articles.net/content/qualcomm-xilinx-collaborate-deliver-industry-leading-heterogeneous-computing-solutions-data-centers-new-levels-efficiency-performance.xhtml", "ord_in_thread": 0, "title": "Qualcomm and Xilinx Collaborate to Deliver Industry-Leading Heterogeneous Computing Solutions for Data Centers with New Levels of Efficiency and Performance", "locations": ["Calif", "SAN JOSE", "SAN DIEGO"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Victor Peng", "Anand Chandrasekher"], "text": "Qualcomm and Xilinx Collaborate to Deliver Industry-Leading Heterogeneous Computing Solutions for Data Centers with New Levels of Efficiency and Performance   Published on 2015-10-08 13:45:54 Qualcomm and Xilinx Collaborate to Deliver Industry-Leading Heterogeneous... -- SAN DIEGO and SAN JOSE, Calif.   > SAN DIEGO and SAN JOSE, Calif.   Qualcomm Incorporated (NASDAQ: QCOM ) through its subsidiary, Qualcomm Technologies, Inc., and Xilinx, Inc. (NASDAQ: XLNX ), today announced a strategic technical collaboration to deliver industry-leading heterogeneous computing solutions with new levels of efficiency and performance through FPGA-enabled dynamic workload acceleration on Qualcomm Technologies' server platforms. The strategic collaboration is designed to span multiple product generations, ranging from card level to highly-integrated solutions. Target applications include compute acceleration, big data analytics, machine learning, storage and CloudRAN. As workloads in cloud computing infrastructure demand higher compute capabilities, more power efficiency and greater flexibility, both companies are committed to delivering new high-performance solutions to exceed these industry needs. Qualcomm Technologies' 64-bit ARMv8-based server processor with Xilinx FPGAs should enable customers to gain compelling performance, performance/watt and lower total cost of ownership. Xilinx's All Programmable portfolio serves as a scalable reconfigurable acceleration platform that can be optimized on demand to any workload. \"We are enthusiastic about the growth that this collaboration will foster,\" said Anand Chandrasekher , senior vice president, Qualcomm Technologies, Inc. \"Xilinx's strengths in highly programmable workload acceleration, connectivity, and system-on-chip technologies will complement Qualcomm Technologies' leading processor solutions for the next generation of heterogeneous computing.\" \"Cloud computing is a strategic area of focus for Xilinx,\" said Victor Peng , executive vice president and general manager of the programmable products group at Xilinx. \"We are pleased to work with Qualcomm Technologies to deliver a very significant improvement in total cost of ownership, performance, and lower power to data centers worldwide.\" About Qualcomm Incorporated Qualcomm Incorporated (NASDAQ: QCOM ) is a world leader in 3G, 4G and next-generation wireless technologies. Qualcomm Incorporated includes Qualcomm's licensing business, QTL, and the vast majority of its patent portfolio. Qualcomm Technologies, Inc., a subsidiary of Qualcomm Incorporated, operates, along with its subsidiaries, substantially all of Qualcomm's engineering, research and development functions, and substantially all of its products and services businesses, including its semiconductor business, QCT. For more than 30 years, Qualcomm ideas and inventions have driven the evolution of digital communications, linking people everywhere more closely to information, entertainment and each other. For more information, visit Qualcomm's website , OnQ blog , Twitter and Facebook pages. About Xilinx in Data Center Only Xilinx provides a flexible, standards-based solution that combines software programmability with hardware optimization for acceleration of compute workloads, storage, and networking with the security needed for the next generation of cloud computing. Xilinx enables heterogeneous compute architecture with high throughput, low latency and best performance/watt relative to industry alternatives. To learn more visit www.xilinx.com . Qualcomm Contacts:", "external_links": [], "published": "2015-10-09T03:34:00.000+03:00", "crawled": "2015-10-09T03:20:21.873+03:00", "highlightTitle": ""}