{"organizations": [], "uuid": "6d2fdb2878f3dda60876fbdfb9d82d799c1538ad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mdtmag.com", "main_image": "", "site_section": "http://www.mdtmag.com", "section_title": "Medical Design Technology | The Medical Design Engineer’s Resource for Products &amp; Technologies", "url": "http://www.mdtmag.com/news/2015/10/doctors-use-ultrasound-waves-stop-hand-tremors", "country": "US", "title": "Doctors Use Ultrasound Waves to Stop Hand Tremors", "performance_score": 0, "site": "mdtmag.com", "participants_count": 1, "title_full": "Doctors Use Ultrasound Waves to Stop Hand Tremors", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "6d2fdb2878f3dda60876fbdfb9d82d799c1538ad"}, "author": "The Ohio State University Wexner Medical Center", "url": "http://www.mdtmag.com/news/2015/10/doctors-use-ultrasound-waves-stop-hand-tremors", "ord_in_thread": 0, "title": "Doctors Use Ultrasound Waves to Stop Hand Tremors", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bursts of focused ultrasound waves allow 'brain surgery without cutting the skin'\nThe Ohio State University Wexner Medical Center is one of six locations nationally - and the only one in the Midwest - studying the safety and effectiveness of a promising new technology using MR-guided focused ultrasound to treat patients suffering from essential tremor as part of a multi-center FDA trial.\nNationwide, 50 patients whose tremors cannot be controlled with medication will be treated with the Exablate Neuro by INSIGHTEC, which uses Magnetic Resonance-guided focused ultrasound to treat tissue deep in the brain without incisions or radiation. The clinical trial is scheduled to conclude in December 2016.\n\"This is brain surgery without cutting the skin,\" said neurosurgeon Dr. Ali Rezai, principal investigator at Ohio State's Wexner Medical Center and director of the Center for Neuromodulation at Ohio State's Neurological Institute. \"This is a highly innovative technology, also known as high-intensity focused ultrasound (HIFU). It allows us to deliver more than 1,000 ultrasound waves under MRI guidance to converge precisely on a pinpoint area of the brain to stop the tremor during a single treatment session.\"\nAn image taken by doctors at The Ohio State University Wexner Medical Center shows focused ultrasound rays converging deep in the brain of a patient during an investigational therapy. In order to stop hand tremor in this patient, more than one thousand rays converged, gradually heating up to 150 degrees, causing a tiny lesion in selected cells. That lesion short-circuits the part of the brain causing the tremor. (Credit: The Ohio State University Wexner Medical Center) Essential tremor is the most common movement disorder, affecting about 10 million people in the United States, and millions more worldwide, according to the International Essential Tremor Foundation. It's a progressive and debilitating neurological condition that causes a rhythmic trembling of the hands, head, voice, legs or trunk.\nCurrent treatment options include medications that aren't always effective or deep brain stimulation (DBS), said Ohio State neurosurgeon Dr. Vibhor Krishna, who performed these surgeries when he was working in Toronto, Canada.\n\"This therapy is very precise,\" Krishna said. \"Effective surgical therapies can mean a difference between living independently and living with significant disability. So working through these research studies, we're trying to establish that this is an effective treatment for these patients to improve their quality of life in terms of personal life, professional life and social life. Being able to take care of themselves; simple things we take for granted.\"\nLast month, Stephen Palovchik, 71, of Delaware, Ohio, became the first patient treated with this technology at Ohio State's Wexner Medical Center. His tremors started when he was in high school, and became progressively so bad that he had trouble putting a key into a door lock or writing on the blackboard. He struggled to sign checks, eat or brush his teeth.\n\"My father had it and my grandfather had it,\" Palovchik said. \"The medical community calls it benign essential tremors, but if you have it, it's not a benign condition. I saw my father's life end, and I said I don't want my life to end that way. I'll be forever indebted to the doctors and the University for being the first patient to try this here.\"\nDuring the four-hour surgery in the intraoperative MRI-surgical suite, Palovchik was awake and gave real-time feedback to the team of neurosurgeons, neuro-radiologists, neurologists and nurses. His feedback helped the team determine the exact brain cells to target with 1,024 beams of ultrasound focused on one spot deep in the brain that controls involuntary movements.\n\"Individual ultrasound beams pass through the scalp, skull and brain tissue without causing any harm, but at the target, the multiple beams converge to a precise focal point. This is a permanent treatment in which some brain cells causing the tremor are burned away. The patient has immediate results when surgery is done: the tremors are gone,\" said Krishna.\nPalovchik is pleased with how well he can now sign checks, feed himself and brush his teeth without assistance, and calls the focused ultrasound technology \"a gift from heaven.\"\n\"It's made a big difference in the tremor I had in my right hand,\" Palovchik said. \"It's virtually gone.\"\nThe technology is a new treatment option for older patients who are not good candidates for traditional DBS pacemaker surgery in which tiny electrodes are surgically implanted into the brain and connected to a small pacemaker-like device that has been implanted into the chest wall, Krishna said. The pacemaker delivers electrical signals that regulate abnormal brain activity, alleviating disabling symptoms, such as tremors, and restoring function.\n\"If these good results are sustained over time, then focused ultrasound therapy will become a more routine therapy for the future,\" Rezai said. \"In addition to treating essential tremor, we hope to use this technology in the future for Parkinson's disease, depression, obsessive compulsive disorder and epilepsy.\"", "external_links": ["https://www.youtube.com/embed/7PaQM-sp680"], "published": "2015-10-16T03:00:00.000+03:00", "crawled": "2015-10-16T23:48:55.743+03:00", "highlightTitle": ""}