{"organizations": [], "uuid": "e4e0f8eadb22880edffd921a3d672a6ad2dece4b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.barchart.com", "main_image": "", "site_section": "http://www.barchart.com/stocks/news.php?feed=AP,PRNW&subject=STK.TECH&date=20150921125959&section=tech", "section_title": "Stocks - News &amp; Commentary | Technology &amp; Comp", "url": "http://www.barchart.com/headlines/story/10934567/zebra-technologies-named-a-visionary-in-gartner-2015-wired-and-wireless-lan-access-infrastructure-magic-quadrant", "country": "US", "title": "Zebra Technologies Named a Visionary in Gartner 2015 Wired and Wireless LAN Access Infrastructure Magic Quadrant", "performance_score": 0, "site": "barchart.com", "participants_count": 1, "title_full": "Zebra Technologies Named a Visionary in Gartner 2015 Wired and Wireless LAN Access Infrastructure Magic Quadrant", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "e4e0f8eadb22880edffd921a3d672a6ad2dece4b"}, "author": "PRNW", "url": "http://www.barchart.com/headlines/story/10934567/zebra-technologies-named-a-visionary-in-gartner-2015-wired-and-wireless-lan-access-infrastructure-magic-quadrant", "ord_in_thread": 0, "title": "Zebra Technologies Named a Visionary in Gartner 2015 Wired and Wireless LAN Access Infrastructure Magic Quadrant", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LINCOLNSHIRE, Ill. , Sept. Zebra Technologies Corporation (NASDAQ: ZBRA), a global leader in solutions and services that provide real-time visibility into organizations' assets, people and transactions, today announced it has been named to the \"Visionaries\" quadrant of the 2015 Gartner Wired and Wireless Local Area Network (WLAN) Access Infrastructure Magic Quadrant [1] .\nRecently, GuestTek™ and Trump Hotel Collection™ implemented Zebra's WLAN solutions to allow guests to seamlessly stream content to and from personal devices. Additionally, Zebra implemented its T5 Power Broadband solution to connect 234 residential caravans in the remote desert of Al-Ruwais near Abu Dhabi on behalf of the UAE's National Catering Company (NCC) . Zebra's Zatar IoT platform helps businesses create apps, onboard devices, and easily collaborate within an IoT ecosystem.\nKEY FACTS\nThe Gartner Wired and Wireless LAN Magic Quadrant focuses on companies that provide the first connectivity to the infrastructure access layer, from the edge of the enterprise network to end users or connected devices. According to the report, \"A vendor in the Visionaries quadrant demonstrates an ability to increase features in its offering to provide a unique and differentiated approach to the market. Visionaries will have innovated in one or more of the key areas of access layer technologies within the enterprise (for example, convergence, security, management or operational efficiency). The ability to apply differentiating functionality across the entire access layer will affect their position.\" Gartner positions businesses in its Magic Quadrant according to criteria that fall into two categories: ability to execute and completeness of vision. SUPPORTING Quote:\nImran Akbar , vice president, Enterprise Network Communications, Zebra Technologies\n\"Operational visibility and reliable connectivity are increasingly competitive advantages that allow organizations to turn intelligence into action. Zebra Technologies is committed to providing businesses with the best WLAN solutions that translate the physical to digital and give mobile workers the tools to do their jobs more efficiently. We believe moving into the 'Visionaries' position shows this commitment is being recognized by the industry and meeting the needs of our customers.\"\nSUPPORTING RESOURCES\nWebsite: Zebra Technologies\nFacebook: Zebra Technologies\nTwitter : @ZebraTechnology\nDisclaimer\nGartner does not endorse any vendor, product or service depicted in its research publications, and does not advise technology users to select only those vendors with the highest ratings or other designation. Gartner research publications consist of the opinions of Gartner's research organization and should not be construed as statements of fact. Gartner disclaims all warranties, expressed or implied, with respect to this research, including any warranties of merchantability or fitness for a particular purpose .\nAbout Zebra Technologies\nZebra (NASDAQ: ZBRA) makes businesses as smart and connected as the world we live in. Zebra tracking and visibility solutions transform the physical to digital, creating the data streams enterprises need to simplify operations, know more about their businesses, and empower their mobile workforces. For more information, visit www.zebra.com .\nMedia Contact:\nTherese Van Ryne\nZebra Technologies\nPhone: +1- 847-370-2317\ntherese.vanryne@zebra.com\nIndustry Analyst Contact:\nCarolyn Buerger\nZebra Technologies\nPhone: +1-224-316-0066\ncarolyn.buerger@zebra.com\nZebra Technologies, Zebra and the Zebra logo are trademarks or registered trademarks of Zebra Technologies Corporation and are used under license. Third-party trademarks mentioned are the property of their respective owners. ©2015 Zebra Technologies Corporation. All rights reserved.\n[1] Gartner, Magic Quadrant for the Wired and Wireless LAN Access Infrastructure, Tim Zimmerman , Bill Menezes , Andrew Lerner , 01 September 2015\nLogo - http://photos.prnewswire.com/prnh/20140731/132232\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/zebra-technologies-named-a-visionary-in-gartner-2015-wired-and-wireless-lan-access-infrastructure-magic-quadrant-300145618.html\nSOURCE Zebra Technologies Corporation", "external_links": ["https://www.zebra.com/us/en.html", "https://www.zebra.com/us/en/about-zebra/newsroom/press-releases/2015/chicago-first-to-showcase-guestteks-hospitality-technology.html", "http://www.zatar.com/", "https://twitter.com/ZebraTechnology", "http://photos.prnewswire.com/prnvar/20140731/132232", "https://www.zebra.com/us/en/about-zebra/newsroom/press-releases/2015/zebra-technologies-brings-high-speed-wi-fi-to-remote-village-for.html", "https://www.facebook.com/ZebraTechnologiesGlobal", "http://www.zebra.com/", "http://www.prnewswire.com/news-releases/zebra-technologies-named-a-visionary-in-gartner-2015-wired-and-wireless-lan-access-infrastructure-magic-quadrant-300145618.html", "http://photos.prnewswire.com/prnh/20140731/132232"], "published": "2015-09-21T03:00:00.000+03:00", "crawled": "2015-10-11T20:53:33.742+03:00", "highlightTitle": ""}