{"organizations": [], "uuid": "965382725be759e2ee5533838632d88cd4872758", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266385/technology-general", "section_title": "Technology Press Releases from PRWeb - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30306074/calltower-expands-offering-with-cisco-jabber", "country": "US", "title": "CallTower Expands Offering with Cisco Jabber", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "CallTower Expands Offering with Cisco Jabber - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T19:11:00.000+03:00", "replies_count": 0, "uuid": "965382725be759e2ee5533838632d88cd4872758"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30306074/calltower-expands-offering-with-cisco-jabber", "ord_in_thread": 0, "title": "CallTower Expands Offering with Cisco Jabber", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Collaboration is possible anywhere, anytime, from any device with Cisco Jabber\nSouth Jordan, Utah\nOctober 20, 2015 – CallTower, the leader in cloud-based enterprise unified communication solutions, announced the addition of Cisco Jabber to their inclusive line of products and solutions. Cisco Jabber easily allows for access to voice, video, presence, instant messaging, desktop sharing and conference capabilities giving users insight into availability of other users and how to best contact them for instant collaboration.\nWith today’s remote and traveling workforce, it’s important to have flexibility with communications and Cisco Jabber provides a solution to do so. No longer is it a hassle to share content or to try to get in touch with those team members out of the office. For smaller businesses or those just starting to incorporate video but stressed with limited budgets to set up internal video conferencing capabilities, Cisco Jabber offers the opportunity to collaborate on a higher level and compete with larger organizations.\nUsing this intelligence in Cisco networks and Cisco Unified Communications Manager call control, Cisco Jabber delivers highly secure, clear, and reliable communications, allowing organizations to enjoy better user acceptance and less risk. Cisco Jabber also integrates with other Cisco Collaboration solutions, including TelePresence video and Cisco WebEx Meeting.\n“CallTower is delighted to have Cisco Jabber included in our line of products and solutions,” said Karen Fredrich, CallTower’s Director of Implementations and Products. “Our customers have always enjoyed the flexibility and mobility that our solutions offer. With the addition of Cisco Jabber, our customers now have more options to stay productive while maintaining their mobility.”\nVideo collaboration is growing rapidly. A recent study done by Cisco and Redshift Research found that 87% of younger executives believe video has a significant and positive impact on an organization. Video collaboration offers advantageous benefits, such as travel cost, employee productivity, enterprise communication, and innovation opportunities. Cisco Jabber paired with WebEx offers state-of-the-art video collaboration tools enabling businesses to acquire such advantages.\nCallTower has built its services based on best-of-breed technologies from leading providers in the communications industry for over 12 years. This experience has enable CallTower to grow its Cisco Unified Communications Manager (CUCM) platform to meet different organization’s needs. With CallTower’s upgrade to Cisco Jabber our customers have even more choices.\nContact us at 866.586.5900, at sales(at)calltower(dot)com or visit us http://www.calltower.com and discover how Cisco Jabber can benefit your organization today.\nAbout CallTower:\nCallTower exists to connect people and organizations. CallTower is a leading provider of cloud-based, enterprise-class unified communications solutions for growing organizations worldwide. We provide an innovative platform to deliver best-of-breed communication solutions with industry leading support. We enhance our clients’ strategic and operational capabilities by integrating best of breed business phone service, mobile applications, email hosting, unified messaging, instant messaging, audio, web and video conferencing, collaboration tools, contact center, cloud services and global networks into one reliable platform.\n //www.prweb.com/releases/2015/10/prweb13031186.htm\n ", "external_links": ["http://www.prweb.com/releases/2015/10/prweb13031186.htm"], "published": "2015-10-20T19:11:00.000+03:00", "crawled": "2015-10-20T23:18:13.973+03:00", "highlightTitle": ""}