{"organizations": [], "uuid": "3c25d909c4ebc9453eb530ce95021718a6b48578", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "abcnews.go.com", "main_image": "http://a.abcnews.go.com/images/Technology/WireAP_94cb27cb32e94105b2cc2a936ba69dcb_16x9_992.jpg", "site_section": "http://abcnews.go.com/xmldata/rss?id=79", "section_title": "ABC News: Technology", "url": "http://abcnews.go.com/Technology/wireStory/railroad-town-sparks-braces-tesla-switch-boom-34355970", "country": "US", "title": "Ex-Railroad Town, Sparks Braces for Tesla, Switch Boom", "performance_score": 0, "site": "go.com", "participants_count": 1, "title_full": "Ex-Railroad Town, Sparks Braces for Tesla, Switch Boom - ABC News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "3c25d909c4ebc9453eb530ce95021718a6b48578"}, "author": "abcNEWS", "url": "http://abcnews.go.com/Technology/wireStory/railroad-town-sparks-braces-tesla-switch-boom-34355970", "ord_in_thread": 0, "title": "Ex-Railroad Town, Sparks Braces for Tesla, Switch Boom", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Not since the Southern Pacific railroad rolled into this sleepy high desert town in Nevada more than a century ago has there been such excitement — Tesla Motors and other technology companies are coming, and along with them thousands of jobs.\nLong dwarfed by Reno, known as the Biggest Little City in the World, Sparks is anticipating an economic boom.\n\"We've always been in their shadow, but we are moving to where we have our own identity now,\" said Sparks Mayor Geno Martini, who has lived in the city since his birth in 1946.\nThat's an identity they hope will be built around the residents settling into huge new facilities at an expansive industrial park a few miles east, including Tesla, data-center developer Switch and legions of highly paid tech workers.\nNew housing and retail projects already underway in Sparks include the makeover of a shuttered casino that will house boutique shops, restaurants and offices, with loft apartments in the old hotel — all to appeal to \"younger hipsters,\" seniors and empty-nesters, the developer says.\nSome worry, however, that this city of nearly 100,000 is not ready to meet the needs of such sudden growth that will quickly bring demands for not only more houses but schools, police and other services.\nTesla alone is expected to eventually employ more than 6,000 at its $5 billion lithium battery plant on schedule to begin production next year.\nWashoe County, encompassing Reno and Sparks, expects to add 34,000 jobs to its 258,000 workforce by 2019, according to a report prepared for the Economic Development Authority of Western Nevada.\nThe report projects a 15-percent gain over a five-county area for a regional total of 52,000 new jobs.\n\"About 50,000 new jobs equals 5,000 new homes per year for the next five years,\" said Bruce Breslow, director of the Nevada Department of Business and Industry.\nBuilders share concerns about the sudden demand spurred by the park 10 miles east on Interstate 80. \"I don't believe we can build 5,000 homes a year,\" Di Loreto Homes president Perry Di Loreto told a housing forum in Reno in September.\nStill, the industrial park offers Sparks officials an opportunity to remake part of a downtown core dotted with small, shuttered casinos that they've longed to renovate for nearly two decades.\nThey celebrated groundbreakings the past two weeks for $60 million worth of housing projects and retail redevelopment in Victorian Square, a few blocks from where Southern Pacific moved its regional switching station in 1904.\nBordered by a pair of I-80 on-off ramps and the regional bus station, Victorian Square sits between a theater complex and the only high-rise hotel-casino in town, the Nugget.\nIt draws tens of thousands to special events like the Best in the West Rib Cook-off and Hot August Nights, but otherwise resembles more a rural Main Street than a city that's nearly doubled in size since 1990.\nA partnership between Reno-based Green Street Companies and the Southern California-based LandCap Investment Partners, which owns the old casino, has produced a $25 million project that aims to turn the dilapidated six-story hotel into 100 loft-style apartments.\nThe ex-casino will become \"The Yard\" — 112,000 square feet of commercial space in a three-story building with offices on top and a ground floor with an \"open-market feeling\" surrounded by shops and restaurants with indoor-outdoor patio dining.\n\"The guys to the west (in Reno) will be saying: 'What happened? How did Sparks do that?'\" said City Councilman Ed Lawson.\n  \" \nEx-Railroad Town, Sparks Braces for Tesla, Switch Boom  ", "external_links": [], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-09T06:15:01.240+03:00", "highlightTitle": ""}