{"organizations": [], "uuid": "51d890404ec32c3567d96d99813c09f0ac8a674a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.maritimeglobalnews.com", "main_image": "", "site_section": "http://www.maritimeglobalnews.com/technology", "section_title": "Technology - maritime global news ", "url": "http://www.maritimeglobalnews.com/news/krill-installs-vfmms-reuben-bx4hre", "country": "US", "title": "Krill Installs VFMMS on FRV Reuben Lasker", "performance_score": 0, "site": "maritimeglobalnews.com", "participants_count": 1, "title_full": "Krill Installs VFMMS on FRV Reuben Lasker - maritime global news", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "51d890404ec32c3567d96d99813c09f0ac8a674a"}, "author": "Joseph R. Fonseca", "url": "http://www.maritimeglobalnews.com/news/krill-installs-vfmms-reuben-bx4hre", "ord_in_thread": 0, "title": "Krill Installs VFMMS on FRV Reuben Lasker", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Krill Systems Inc., leader in advanced Vessel Fuel Measurement and Monitoring Systems (VFMMS), installated and conducted sea trial on-board the NOAA Ship Reuben Lasker.\nThe NOAA Ship Reuben Lasker is the fifth in a series of Fishery Survey Vessels (FSV) and one of the most technologically advanced fisheries vessels in the world. Funded under the American Recovery and Reinvestment Act and built by Marinette Marine Corporation in Wisconsin, the ship's primary objective is to support fish, marine mammal, and turtle surveys off the U.S. West Coast and in the eastern tropical Pacific Ocean.\nReuben Lasker is classed as a Fishery Survey Vessel (FSV). All FSVs are American Bureau of Shipping (ABS) Ice Classed \"C0\". The ship has a low sound signature to reduce reactions of fish to the presence of the ship and provides for a low signal-to-noise ratio for acoustic sensors. This allows scientists to study fish populations and collect oceanographic data with fewer effects on fish and marine mammal behavior. The multi-frequency scientific sonars provide the ability to conduct acoustic surveys that can distinguish fish types, estimate biomass, determine fish school shapes, and provide data on sea floor topography.\nThe ship is named after Dr. Reuben Lasker (1929-1988), who served as the Director of SWFSC's Coastal Fisheries Division and as adjunct professor at Scripps Institution of Oceanography, U.C. San Diego. Dr. Lasker built a renowned research group that focused on the recruitment of young fish to the adult population - a topic with implications for fisheries management throughout the world.\nInstallation of the Krill VFMMS system on Reuben Lasker took place in San Diego and was completed in June 2015. Successful sea-trials were subsequently conducted.\nKrill Systems collects fuel-consumption data via fuel-flow sensors fitted on each engine and uses Microsoft SQL server database technology to record fuel and other sensor data on board with 2-second resolution and storage capacity of at least one year, with unlimited roll-over capacity. The collected data is transmitted to shore using an on-board communication system (Cellular or Satellite) that provides internet access supporting standard SMTP email protocols. The Krill system transmits customizable reports and sensor data menus in Excel format, to any number of operators, anywhere. There are no monthly fees for the service.\n\"We are very proud to have been awarded this, the fifth, contract for the NOAA Fisheries Research Vessels program and to have brought the installation to a successful conclusion\" says Brian Staton, VP Sales & Marketing. \"NOAA's contribution to the health of our oceans and fish stocks is of vital importance to our future. We share their concern for our natural environment and are delighted to have been given an opportunity to contribute in this endeavor\".", "external_links": [], "published": "2015-10-21T03:00:00.000+03:00", "crawled": "2015-10-21T20:05:56.632+03:00", "highlightTitle": ""}