{"organizations": [], "uuid": "9fabe0a7e059d6101f12cb335980082dcbff47dc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.gizmag.com", "main_image": "http://img.gizmag.com/emperador-box-6.jpg?fit=max&h=594&rect=0%2C180%2C1228%2C691&w=1060&s=06251fc8eab10a44eb7663f563e64542", "site_section": "http://feeds.feedblitz.com/Gizmag", "section_title": "Gizmag Emerging Technology Magazine", "url": "http://www.gizmag.com/imperiali-geneve-emperador-cigar-box/40015/", "country": "US", "title": "Imperiali Genève's Emperador puts cardboard cigar boxes to shame", "performance_score": 0, "site": "gizmag.com", "participants_count": 1, "title_full": "Imperiali Genève's Emperador puts cardboard cigar boxes to shame", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T09:23:00.000+03:00", "replies_count": 0, "uuid": "9fabe0a7e059d6101f12cb335980082dcbff47dc"}, "author": "David Szondy", "url": "http://www.gizmag.com/imperiali-geneve-emperador-cigar-box/40015/", "ord_in_thread": 0, "title": "Imperiali Genève's Emperador puts cardboard cigar boxes to shame", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Image Gallery (17 images) \nMost cigar boxes are cheap cardboard affairs that are useful for keeping bits and pieces in or turning into an inexpensive guitar. Definitely not in the homespun musical category is the Emperador cigar chest from Imperiali Genève. This is a high-tech container that holds two dozen bespoke cigars and clocks in at a cool one million Swiss francs (US$1,048,000) – making this both one of the most expensive and technologically advanced cigar boxes in history. \nThe Emperador is more than just an expensive box. It's also an extremely upmarket conversation piece and a safe for cigars that are so pricey that they are literally wrapped in gold. Measuring 70 x 45 x 30 cm (27 x 18 x 12 in), the handcrafted black case combines 2,675 components with 33 microprocessors and a dash of Swiss watchmaking that does everything from tell the time to clean up the cigar ash. \nAccording to Imperiali, the Emperador departs from your average cigar chest in that there isn't any wood in it. Instead, it's made from glass, Alucobond, Alucore with laser-welded inserts, composite fibers, an aluminum alloy honeycomb structure sandwiched between two thin sheets of metal, high-resistance aluminum-zinc-copper alloy, expanded polyurethane, expanded polystyrene and Flexathene. There are also antibacterial and antifungal materials, aerogel for insulation, along with gold, nickel-palladium, and rhodium plating, with the lot finished off with black lacquer. \nThe reason behind this is that the Emperador relies on a complicated system of mechanics and electronics that require an extremely high degree of precision while retaining strength and light weight. This being a luxury item, the Emperador shows off its mechanical features while being careful to conceal all its electronic components, including sensors. \nAt first glance, it looks like a highly polished black box with an ornate locking mechanism and analog readouts for relative humidity and temperature inside the chest, power reserve, and the number of cigars remaining inside. However, beneath that apparent simplicity a computer processor monitors each individual cigar once a minute and adjusts the environment to preserve them at an optimal state. \nThe first tech feature that draws the eye on the Emperador is the bespoke flying tourbillon timepiece set in the middle of the lock mechanism. Built by a master watchmaker from the Swiss Jura, it has 323 parts, a \"Clous de Paris\" guilloché dial, and is \"manually\" wound, but the user doesn't wind it. Instead, an electric drive turns the concealed winding stem on a preprogrammed schedule. \nHowever, the Emperador's party piece is opening it. The letters of the company's name set in the lid are actually control buttons. Brushing these activates an integrated LCD display. The user then enters a personal secret code on the lock's gold numbered keys, the opening mechanism kicks in, and the lid rises automatically to reveal the cigars nested inside of what is less a humidor than a climate control unit set in a solid aluminium compartment that holds the cigars in a radial arrangement in two layers. \nAccording to Imperiali, the Emperador has the world’s first self-regulating humidity system that guarantees a constant humidity level of 70 percent and a temperature of 16º to 18º C (61 to 64° F) or whatever settings the user prefers. This is achieved by means of thermoelectric cooling cells, which use an electric current to set up a heat imbalance that warms one side of the cell and cools the other, causing water to condense on the latter. Two modules of these cells are used to regulate the temperature and to humidify the compartment with the aid of an air circulator, There's also a separate condenser to extract moisture if the humidity is too high. \nAs to the cigars themselves, these are 24 Grand Cru cigars made by Cuban emigrants from blends of selected tobaccos from the Jamastran Valley in south Honduras and the Jalapa Valley in north Nicaragua. They come wrapped in four beaten gold leaves, which apparently don't affect their taste or burning qualities, and are protected by individual glass tubes that are monitored by the chest's microprocessors. \nIn addition to housing cigars like they were gold bullion, the Emperador comes with three matching accessories housed in a special drawer – a cigar cutter, lighter, and ashtray. \nThe cigar cutter is as high tech as the chest itself. It can either cut the tip off the cigar or pierce it to a choice of depths using a complicated mechanism that's as much showpiece as rope snipper. The user inserts the cigar, lines it up using a laser level, then a guillotine or a punch goes into action. Clippings are automatically collected and ejected and as it goes through the cutting and cleaning. It's a bit overcomplicated, but appreciated by those of us who have on occasion stuck their thumb in the wrong hole of a more conventional cigar cutter. \nThe second accessory is the table lighter. Pressing a slider activates an opening mechanism that reveals a rotating burner. An electric motor opens the valve on a 25 ml gas reservoir and a spark ignites the flame. Not surprisingly, it also incorporates an infrared transceiver to monitor the liquified gas level in the tank. \nFinally, the ashtray also has a high-tech spin with a proximity sensor that recognizes when a cigar is approaching and automatically opens the diaphragm to accept the ash. \nThe Emperador is available in a limited run of 12 numbered units per year for one million Swiss francs (US$1,048,000). \nThe video below introduces the Emperador cigar chest.", "external_links": [], "published": "2015-10-24T09:23:00.000+03:00", "crawled": "2015-10-24T10:46:42.988+03:00", "highlightTitle": ""}