{"organizations": [], "uuid": "bbf429e50b75be16be8cfea6cd6357167770ccde", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.whatech.com", "main_image": "", "site_section": "http://www.whatech.com/?format=feed&type=rss", "section_title": "WhaTech -  Technology News | Supplier Sourcing |  Community - WhaTech", "url": "https://www.whatech.com/business-telephony/news/93808-mbv529-unified-communications-made-simple", "country": "AU", "title": "NBN + VoIP = Unified Communications made simple", "performance_score": 0, "site": "whatech.com", "participants_count": 1, "title_full": "NBN + VoIP = Unified Communications made simple", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T06:10:00.000+03:00", "replies_count": 0, "uuid": "bbf429e50b75be16be8cfea6cd6357167770ccde"}, "author": "webmaster@whatech.com.au (Claudette Pope)", "url": "https://www.whatech.com/business-telephony/news/93808-mbv529-unified-communications-made-simple", "ord_in_thread": 0, "title": "NBN + VoIP = Unified Communications made simple", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published on Monday, 12 October 2015 14:10 Submitted by Claudette Pope Page views: 38 times Technology today has some new buzz words – Unified Communications (UC) and collaboration among them. These two can go very effectively hand-in-hand. Unified communications put simply is integrated communications including voice, fax, email, instant messaging, data sharing and video all in one inbox managed with one set of controls. Collaborative software can be one feature of UC and allows, as the name suggests, sharing of documents, project management, brainstorming, coordination of schedules, instant messaging, online conferencing, integrated email and more, it will depend on the software selected. For a small business these tools may seem out of reach but put your computing in the cloud, use VoIP and hosted PBX and they can be part of your tool set. A hosted solution means your business doesn’t need the infrastructure, you don’t need anyone to maintain systems and usually hosting is a monthly subscription service, so you always know your costs. The efficiencies achieved using UC and/or collaboration tools are considerable with all communications stored together, “presence” allows staff to see immediately if a colleague is available, it can be done in real time so the results are immediate and so on. Staff who are travelling, work from home or in a remote office can feel like they are in the main office. Even contractors and freelancers can be part of UC with appropriate security and restrictions applied. Mobile devices are not excluded from the equation and can be used to stay in-touch with projects, get immediate updates and allows the user to be part of any conversation and decisions being made. The online storage of documents which can be co-edited is another bonus, no need for the parties to be in one physical location, they can all be present in the “virtual” room. Meetings can be recorded, so there is a permanent record of who said what, when and to who. Even better than being in the same physical location where most people wouldn’t think of recording the meeting, apart from minutes being taken. Pundits declare that hosted PBX and UC will be a $12 billion market by 2018 and in 2013 alone growth was 20%. Adoption is growing across the board but particularly with small to medium business. Flexibility and agility are achieved with UC. These are also new buzz words in the business world and if an organisation can achieve these, they are able to innovate and increase their chances of staying ahead of the competition. \nMy Business Voice \nOur VoiP and Hosted PBX services are dedicated for business customers only. We only sell the best business grade products We stand out from the rest because we have built a quality VoIP network for just business. \nVisit our website to start a free trial or take a tour of our VoIP Telephone System \n...", "external_links": [], "published": "2015-10-12T06:10:00.000+03:00", "crawled": "2015-10-13T15:07:18.086+03:00", "highlightTitle": ""}