{"organizations": [], "uuid": "9237844961cd7b9679a123b1cae6d3a9a2db63b9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.technologyvista.in", "main_image": "http://mycdn-technologyvista.netdna-ssl.com/wp-content/uploads/2015/10/mushroom.jpg", "site_section": "http://www.technologyvista.in/feed/", "section_title": "Technology Vista", "url": "http://www.technologyvista.in/pin/look-world-my-phone-has-a-portobello-mushroom-battery/", "country": "PA", "title": "Look world! My phone has a portobello mushroom battery!", "performance_score": 0, "site": "technologyvista.in", "participants_count": 1, "title_full": "Look world! My phone has a portobello mushroom battery!", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T07:49:00.000+03:00", "replies_count": 0, "uuid": "9237844961cd7b9679a123b1cae6d3a9a2db63b9"}, "author": "SuperAdmin", "url": "http://www.technologyvista.in/pin/look-world-my-phone-has-a-portobello-mushroom-battery/", "ord_in_thread": 0, "title": "Look world! My phone has a portobello mushroom battery!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Look world! My phone has a portobello mushroom battery! 5 Oct , 2015 Share We have had enough of the bio-diesel stuff. Every now and then we keep hearing about these new concepts of using plants or bio-degradable materials to be used as some kind of a fuel. And this is something good, because different people around the world are trying to find out ways to power our routine machines and gadgets in a way that tries to reduce our carbon footprint. Now, in a paper published in the journal Nature Scientific Reports , researchers from the university’s Bourns College of Engineering have described how they have created a new type of high-carbon lithium ion battery component using heat-treated nanoribbons from the skins of portobello mushrooms. Synthetic graphite is the current industry standard for anodes, or positive terminals and it has a high manufacturing cost because it requires significant chemical preparation and activation. Adding to this, the preparation process uses a series of acids and bases that are harmful to the environment. So in a bid to find an environment friendly and inexpensive substitute, the researchers stumbled upon this idea. They say that Portobello mushrooms are just the right kind of candidate for many reasons. The mushrooms become just the right kind of porous when heated to about 1,100 degrees Celsius (2,012 degrees Fahrenheit), giving them much more space for liquid and air to pass through. Related Posts:", "external_links": [], "published": "2015-10-05T07:49:00.000+03:00", "crawled": "2015-10-05T09:20:19.993+03:00", "highlightTitle": ""}