{"organizations": [], "uuid": "82bbe04e48338e42e5f7ac5042c2ca6824ada63c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chron.com", "main_image": "http://www.chron.com/img/pages/article/opengraph_default.jpg", "site_section": "http://www.chron.com/rss/feed/AP-Technology-and-Science-266.php", "section_title": "AP Technology and Science", "url": "http://www.chron.com/news/medical/article/Court-Yoga-sequence-not-entitled-to-copyright-6559160.php", "country": "US", "title": "Court: Hot yoga's sequence of poses can't be copyrighted", "performance_score": 0, "site": "chron.com", "participants_count": 1, "title_full": "Court: Hot yoga's sequence of poses can't be copyrighted - Houston Chronicle", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T01:04:00.000+03:00", "replies_count": 0, "uuid": "82bbe04e48338e42e5f7ac5042c2ca6824ada63c"}, "author": "chron.com", "url": "http://www.chron.com/news/medical/article/Court-Yoga-sequence-not-entitled-to-copyright-6559160.php", "ord_in_thread": 0, "title": "Court: Hot yoga's sequence of poses can't be copyrighted", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SAN FRANCISCO (AP) — The founder of a popular form of yoga that is performed in a room heated to more than 100 degrees lost a court appeal Thursday to copyright a sequence of 26 poses and two breathing exercises.\nThe 9th U.S. Circuit Court of Appeals ruled that the sequence used in hot yoga classes is a process intended to improve people's health, so copyright law does not cover it. A copyright on the yoga sequence would be akin to giving a surgeon the exclusive right to perform a complicated surgery, the court said.\nThe ruling came in a lawsuit filed by Bikram Choudhury , considered the founder of Bikram yoga. The classes take place in a room that is more than 100 degrees and are supposed to provide health and fitness benefits. Choudhury has said he extended the careers of Kareem Abdul Jabbar and John McEnroe , among other professional athletes, according to the 9th Circuit decision.\nThe court rejected Choudhury's arguments that he was entitled to copyright protection because his arrangement of the poses constituted a compilation. A call to Choudhury's attorneys was not immediately returned.\n\"Though Choudhury emphasizes the aesthetic attributes of the Sequence's 'graceful flow,' at bottom, the Sequence is an idea, process, or system designed to improve health,\" Judge Kim Wardlaw said. \"Copyright protects only the expression of this idea — the words and pictures used to describe the Sequence — and not the idea of the Sequence itself.\"\nChoudhury sued the Evolation Yoga studio in 2011, accusing it of copyright infringement for using his sequence in its classes. The studio was founded by Mark Drost and Zefea Samson in New York after they completed a Bikram yoga teacher-training course developed by Choudhury.\nThe 9th Circuit upheld a lower court decision in favor of Evolation Yoga. Eric Maier , an attorney for the studio, said his clients should be commended for \"standing up\" to Choudhury.", "external_links": ["http://ap.org/schemas/03/2005/apcm", "http://ap.org/schemas/03/2005/apnm"], "published": "2015-10-09T01:04:00.000+03:00", "crawled": "2015-10-09T01:26:22.892+03:00", "highlightTitle": ""}