{"organizations": [], "uuid": "ede93e466b7c8106acebe5d9b9e04d3b1af1caf6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mdtmag.com", "main_image": "", "site_section": "http://www.mdtmag.com", "section_title": "Medical Design Technology | The Medical Design Engineer’s Resource for Products &amp; Technologies", "url": "http://www.mdtmag.com/news/2015/10/scientists-create-leukemia-dish-better-understand-it", "country": "US", "title": "Scientists Create ‘Leukemia in a Dish’ to Better Understand It", "performance_score": 0, "site": "mdtmag.com", "participants_count": 1, "title_full": "Scientists Create ‘Leukemia in a Dish’ to Better Understand It", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "ede93e466b7c8106acebe5d9b9e04d3b1af1caf6"}, "author": "Mount Sinai Medical Center", "url": "http://www.mdtmag.com/news/2015/10/scientists-create-leukemia-dish-better-understand-it", "ord_in_thread": 0, "title": "Scientists Create ‘Leukemia in a Dish’ to Better Understand It", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Scientists engineered stem cells to better understand the mechanisms behind a form of leukemia caused by changes in a key gene, according to a study led by Mount Sinai researchers and published online today in the journal Cell Reports.\nPast work had established that inherited changes in the DNA code for the gene PTPN11 cause Noonan syndrome, a genetic disease that comes with a high risk for the blood cancer called juvenile myelomonocytic leukemia (JMML). The mechanisms behind the disease, and what influences its severity, were unknown going into the current study.\nIn addition, the only current treatment for JMML, a bone marrow transplant to replace the hematopoietic stem cells that become blood cells, is effective in only 50 percent of patients. This has further spurred efforts to understand related disease mechanisms as a step toward designing better treatments.\n“By studying an inherited human cancer syndrome, our study clarified early events in the development of one kind of leukemia,” said corresponding study author Bruce D. Gelb, MD, Gogel Family Chair and Director of The Mindich Child Health and Development Institute, Icahn School of Medicine at Mount Sinai. “More than just creating a model of a disease, we were able to prove that mechanisms seen in our model also happen in the bone marrow of people with this kind of leukemia. The work also provided new targets for the field to develop new drugs against in JMML.”\nTo better understand diseases with a genetic component, a popular approach is to take skin cells from patients with a disease and use enzymes to coax the cells back along the differentiation pathway to become induced pluripotent stem cells or iPSCs. Such cells can then be programmed to mature into cells, including hematopoietic (blood) cells, which re-create a specific version of each person’s genetic disease in a petri dish for study.\nIn the current publication, the study authors report that hematopoietic cells produced from induced stem cells with PTPN11 mutations known to cause JMML indeed act like cells seen in these patients. Researchers found that “gain of function” genetic changes that happen to increase this protein’s expression were enough to cause leukemia-related changes in cells.\n“Going into the current study, experts in the field had tended to lump all forms of JMML together, but the new study was able to isolate biological changes specific to hematopoietic cells with PTPN11 mutations, which causes more severe JMML,” said Dr. Gelb. “These findings provide a toe-hold in efforts to design specific treatments for this form of the disease.”\niPSCs used to model cancers are often created from cancer cells, a process with comes with a great many mutations (changes in the gene code) in genes that are part of the unstable, frequent cell division and multiplication seen in cancer. By starting with skin cells of JMML patients with inherited PTPN11 mutations, researchers were able to create JMML cells with only these mutations, screening out the “genetic noise” that can obscure disease mechanisms.\n“Our results provide further evidence that the severity of this form of leukemia arises from the degree of changes in the gene PTPN11, altering the protein it codes for, SHP-2, and biologic pathways related to it,” said Dr. Gelb. “These proteins promise to become a focus of future drug design efforts.”", "external_links": [], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-09T03:12:56.330+03:00", "highlightTitle": ""}