{"organizations": ["Incorgnito Publishing Press", "Ovation Incorgnito Publishing Press"], "uuid": "ba21a18032ecf16dc2241d6c348cab23a72e26e7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.consumerelectronicsnet.com", "main_image": "", "site_section": "http://feeds2.feedburner.com/Cen-ConsumerElectronicsNet-technologyNews", "section_title": "CEN - Consumer Electronics Net-Technology News", "url": "http://www.consumerelectronicsnet.com/articles/viewarticle.jsp?id=4134214", "country": "US", "title": "Incorgnito Publishing Press Announces, 'Chronicles of Ara' Miniseries in the Works at Ovation", "performance_score": 0, "site": "consumerelectronicsnet.com", "participants_count": 0, "title_full": "Incorgnito Publishing Press Announces, 'Chronicles of Ara' Miniseries in the Works at Ovation", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T21:00:00.000+02:00", "replies_count": 0, "uuid": "ba21a18032ecf16dc2241d6c348cab23a72e26e7"}, "author": "", "url": "http://www.consumerelectronicsnet.com/articles/viewarticle.jsp?id=4134214", "ord_in_thread": 0, "title": "Incorgnito Publishing Press Announces, 'Chronicles of Ara' Miniseries in the Works at Ovation", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Incorgnito Publishing Press Announces, 'Chronicles of Ara' Miniseries in the Works at Ovation October 26, 2015 -- \nPASADENA, Calif. , Oct. 26, 2015 /PRNewswire/ -- Incorgnito Publishing Press congratulates our authors, Joel Eisenberg and Stephen Hillard authors of Chronicles of Ara series, on signing a development deal for their series with Ovation TV. \nAs Reported on Variety Online - \n\"The comprehensive pact includes an eight-hour miniseries based on the first two novels of the duo's eight-volume 'Chronicles of Ara' book series, with an option to explore the remaining books for a possible ongoing series and further spinoffs.\" \n\"' The Chronicles of Ara ' is a fantastically imaginative series that explores the origins and repercussions of artistic creation. Its theme, of course, is perfectly suited for the only television network dedicated to the arts, but the story itself is so engaging and visual in its telling that it seems destined for a series,\" said Scott Woodward , Ovation's exec VP of programming and production. \"We're looking forward to working with Joel and Steve to bring their stories to Ovation viewers.\" \nThe books center on Ara, a muse who inspires all of art and invention, but who is corrupted upon a tragic loss. Using parallel storylines, the characters include some of history's more renowned \"darker authors\" J.R.R. Tolkien, Mary Shelley , Lewis Carroll , H.G. Wells , Edgar Allan Poe as they are writing their greatest creations. \n\"Our logline springs from there,\" says Eisenberg. \"The end of the world begins when man is betrayed by his greatest creation: his art. What better outlet than Ovation, a network devoted to the arts and culture, to explore this concept?\" \nHillard adds that \"we run with the concept of dangerous art all those video games, novels, music, lyrics and so on that parents and teachers say are bad for you and we respond, 'Okay, we agree. All art is dangerous. Now what? What of the wars and cultures art inspires. What then?'\" \nBoth Eisenberg and Hillard are repped by Jon Levin at CAA. \nThe eight volume series is published by Incorgnito Publishing Press under our Topos Books imprint. http://www.incorgnitobooks.com \nContact", "external_links": [], "published": "2015-10-26T21:00:00.000+02:00", "crawled": "2015-10-26T20:28:23.009+02:00", "highlightTitle": ""}