{"organizations": [], "uuid": "2cc67981a9031aea999794985082e0f975886548", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.technology.org", "main_image": "http://www.technology.org/texorgwp/wp-content/uploads/2015/10/Curacao-oil-spill-151002-400x225.jpg", "site_section": "http://feeds.feedburner.com/TechnologyOrgGeoscienceEnvironmentNews", "section_title": "Technology Org » Geoscience & Environment news", "url": "http://www.technology.org/2015/10/03/corals-delayed-reaction-devastating-effects-oil-spill/", "country": "", "title": "Coral’s Delayed Reaction to Devastating Effects of an Oil Spill", "performance_score": 0, "site": "technology.org", "participants_count": 1, "title_full": "Coral’s Delayed Reaction to Devastating Effects of an Oil Spill", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T23:10:00.000+03:00", "replies_count": 0, "uuid": "2cc67981a9031aea999794985082e0f975886548"}, "author": "Paulina Dautartaitė", "url": "http://www.technology.org/2015/10/03/corals-delayed-reaction-devastating-effects-oil-spill/", "ord_in_thread": 0, "title": "Coral’s Delayed Reaction to Devastating Effects of an Oil Spill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Coral’s Delayed Reaction to Devastating Effects of an Oil Spill Posted Yesterday \nCoral reefs in the Caribbean have been declining for decades, largely as a result of development, overfishing, and disease. An April 2012 oil spill threatened to further harm this fragile ecosystem on the island of Curaçao, as oil blanketed an area roughly the size of thirty soccer fields. Photo of shore line after oil spill. Image courtesy of the UCSD. \nAaron Hartmann, then a graduate student at the Scripps Institution of Oceanography at UC San Diego, was in Curaçao finishing his final field season when the oil spill happened. The spill occurred weeks prior to the annual spawning season for many corals, prompting Hartmann and colleagues to test how lingering oil contamination affects corals during their earliest life stages. Their research concludes that the oil spill most affected the ability of coral larvae to transition to their adult stage, and that this response became apparent after, rather than during, the time larvae were swimming in oil-contaminated water. \nThe study, “Crude oil contamination interrupts settlement of coral larvae after direct exposure ends,” appears in the publication Marine Ecology Progress Series . \nWhen corals reproduce, their eggs amass at the sea surface and, after fertilization, larvae swim for days near the surface before moving down to the reef and going through metamorphosis. Through this process, coral larvae “settle” and become adults. Given this mobility, and that larvae may move away from oil contamination, Hartmann and colleagues examined the response of larvae during and after exposure, in contrast to the common practice of testing the immediate and direct effects that toxins have on animals. Surprisingly, they found that the larvae showed strong latent (delayed) effects, indicating that the impact on the coral population was not immediately observed. \n“A human analogy to these so-called latent effects would be if a person had a seemingly healthy childhood in a city with smog issues, moved away to somewhere with fresh air as an adult, then developed smog-related respiratory issues years after they moved,” said Hartmann, now a researcher at San Diego State University and the Smithsonian National Museum of Natural History. \nThe latent effects of oil exposure manifest as higher larval death rates and arose more than a week after exposure to oil had ended. In addition to killing larvae, oil exposure dramatically hindered the ability of larvae to settle on the seafloor, causing added stress to an already endangered species. \n“The greatest limitation of environmental impact assessments following catastrophic events is that most aren’t designed to measure damage to ecosystems beyond the immediate aftermath,” said Hartmann. “We found that long-term ill effects of oil contamination on coral larvae can be quite large. Thus, by not including post-event or post-exposure harm in environmental impact assessments, we miss much of the damage done by events like oil spills.” \n“This study highlights the fact that there are multi-layered effects of oil spills,” said Stuart Sandin, an associate professor of marine ecology at Scripps Oceanography and study co-author. “Over time, it will be important to understand how pollution from oil – whether it is from an oil spill or other recreational activities, such as boating – affects the way marine animals move throughout the ocean, and especially on the spawning patterns of corals.”", "external_links": [], "published": "2015-10-03T23:10:00.000+03:00", "crawled": "2015-10-04T08:32:55.268+03:00", "highlightTitle": ""}