{"organizations": [], "uuid": "841e7d440df56b2ddbb57c8c54ac00ff4e53c616", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.iol.co.za", "main_image": "http://www.iol.co.za/polopoly_fs/iol-12-jan-scitech-pn-ces-curve-phone-1.1803996!/image/2977414783.jpg_gen/derivatives/box_600/2977414783.jpg", "site_section": "http://www.iol.co.za/cmlink/scitech-technology-rss-1.847487", "section_title": "Scitech Technology RSS", "url": "http://www.iol.co.za/we-don-t-need-apps-to-judge-1.1927038", "country": "US", "title": "We don’t need apps to judge", "performance_score": 0, "site": "iol.co.za", "participants_count": 0, "title_full": "We don’t need apps to judge", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T16:00:00.000+03:00", "replies_count": 0, "uuid": "841e7d440df56b2ddbb57c8c54ac00ff4e53c616"}, "author": "", "url": "http://www.iol.co.za/we-don-t-need-apps-to-judge-1.1927038", "ord_in_thread": 0, "title": "We don’t need apps to judge", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Rhodri Marsden"], "text": "We don’t need apps to judge October 8 2015 at 03:00pm By Rhodri Marsden Comment on this story Bloomberg Apps. \nThis time last week, barely anyone had heard of a new service called Peeple. Today, however, we can stand back and survey the smouldering wreckage of an idea that crashed hard and then burnt ferociously. Its seven-day story is almost a parable for the social media age, managing to neatly showcase eight human failings that seem to recur relentlessly these days. So let's begin with ONE: Having a monumentally bad idea for an app. \nPeeple, if you hadn't heard, is meant to be a service we can use to rate other human beings on a personal, professional or romantic level. We can leave comments, assign them a number of stars from one to five, and then read what other people think about us. \nPrecisely how this was supposed to work was never clear; we had nothing to go on aside from a few screenshots. But anyone who spends even the smallest amount of time online will know that this kind of idea is deeply flawed - and it's not even new. It's been tried a number of times, as long ago as 2005, and all attempts either failed miserably or were watered down substantially. There's just no demand for it. The two co-founders had no background in apps, and it showed. \nTWO: Boundless outrage. The vagueness of how Peeple actually worked allowed everyone to just make it up and then become horrified at the scenarios unfolding in their own imagination. “Imagine every interaction you've ever had suddenly open to the scrutiny of the internet public,” said one description. “Rate your friends like they are restaurants,” said another. (Questionable hygiene... can get rather loud on Friday evenings, two stars.) \nThis quickly led to THREE: Compulsive amplification. When people are cross, we urge people to take a look at all the crossness in order to make even more people cross, like an unstoppable, shrieking snowball picking up hapless men and women as it hurtles around the internet. \nFOUR: Woefully misjudged hubris. Co-founder Julia Cordray uploaded a video to YouTube in which she excitedly told a friend how Peeple was now “on the front page of every major media outlet! We made it!” But the old adage of all publicity being good publicity doesn't hold true any more, mainly because of FIVE: Shaming. Within hours, Cordray was asking if anyone knew how to stop people posting comments on a company Facebook page; Peeple was now being subjected to precisely the kind of systematic disembowelling that we feared it would subject us to - and Cordray was next, leading neatly to SIX: Rampant misogyny. (“Why does her face look so punchable?” was one of the few printable examples.) \nA service that supposedly aimed to “find the good in you” was now managing to coax out the polar opposite. On LinkedIn, Cordray bemoaned the fact that she couldn't delete the offending comments. “They're there forever for the world to see,” she said. “But we won't be shamed into submission. We are bold innovators… sending big waves into motion.” \nShe then neatly executed SEVEN: Back-pedalling and furious deletion of most of the online evidence, which prompted EIGHT: conspiracy theorists advising us that the whole thing had been a hoax. So there you have it. An incandescent explosion of online activity, over a product that was never even released. This time next week, we won't even remember what it was called. Sometimes I wonder where we get all this energy from.", "external_links": [], "published": "2015-10-08T16:00:00.000+03:00", "crawled": "2015-10-08T16:28:26.142+03:00", "highlightTitle": ""}