{"organizations": [], "uuid": "4cf40bb9879fb3add1bddcf47704b024ec7d50b1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1144990/kbace-technologies-inc-wins-prestigious-oracle-excellence-award-specialized-partner-ye", "country": "US", "title": "KBACE Technologies, Inc. Wins Prestigious Oracle Excellence Award for Specialized Partner of the Year – North America in Regional System Integrator HCM Applications", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "KBACE Technologies, Inc. Wins Prestigious Oracle Excellence Award for Specialized Partner of the Year – North America in Regional System Integrator HCM Applications", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T12:00:00.000+02:00", "replies_count": 0, "uuid": "4cf40bb9879fb3add1bddcf47704b024ec7d50b1"}, "author": "admin", "url": "http://www.freshnews.com/news/1144990/kbace-technologies-inc-wins-prestigious-oracle-excellence-award-specialized-partner-ye", "ord_in_thread": 0, "title": "KBACE Technologies, Inc. Wins Prestigious Oracle Excellence Award for Specialized Partner of the Year – North America in Regional System Integrator HCM Applications", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Submitted by admin on 10/26/2015 @ 3:00 AM Companies mentioned in this article: KBACE \nSAN FRANCISCO -- (BUSINESS WIRE) -- Oracle today awarded KBACE with its 2015 Oracle Excellence Award for Specialized Partner of the Year – North America in Regional System Integrator HCM Applications for the third consecutive year. The award recognizes KBACE for their commitment to deliver innovative, Specialized solutions and services based on Oracle software and hardware. \nThe Oracle Excellence Awards for Specialized Partner of the Year encourage innovation by Oracle PartnerNetwork (OPN) members, who use Oracle’s products and technology to create value for customers and generate new business potential. \n“KBACE continues to make considerable investments to support our customers on Oracle Cloud applications. In 2015, we expanded our range of value add services, achieved additional Oracle PartnerNetwork Specializations, further refined our quick time-to-value methodology, and developed even more Oracle Cloud applications delivery accelerators. We couldn’t be more proud to receive the Oracle Excellence Award for North America for the third consecutive year,” said Mike Peterson, COO & President at KBACE. \n“KBACE has demonstrated an outstanding level of innovation in delivering proven, Oracle-based solutions that can solve our joint customers’ most critical business challenges,” said Terri Hall, Group Vice President, North America Applications Alliances and Channels Sales, Oracle. “We congratulate KBACE in achieving the 2015 Oracle Excellence Award for Specialized Partner of the Year – North America in Regional System Integrator HCM Applications. This achievement is a testament to their dedication to excellence and to providing customers solutions and services that drive real business value and results.” \nAbout KBACE KBACE Technologies, Inc. is a global consulting and technology services company dedicated to helping customers maximize their investment in Oracle solutions. KBACE’s full-service approach and unparalleled experience in all areas of Oracle Cloud Applications and Oracle Fusion Middleware has helped the Company build one of the largest reference bases of Oracle Cloud customers in the world. KBACE is known for its functional and technical depth across industry and business functions for human capital management, enterprise resource planning, and customer experience. \nLearn more about KBACE at www.kbace.com . \nAbout Oracle OpenWorld Oracle OpenWorld 2015 delivers the ultimate cloud experience. The industry’s most important business conference includes thousands of educational sessions and features demos and exhibitions from hundreds of partners and customers from around the world showcasing Oracle’s comprehensive cloud offerings, including an integrated stack of applications, platform and infrastructure services, as well as converged systems and industry solutions. Tens of thousands of in-person attendees and millions online gain valuable product and industry-specific insight to help them transform their businesses with Oracle. Oracle OpenWorld 2015 is being held October 25 through October 29 at the Moscone Center in San Francisco. For more information; to register; or to watch Oracle OpenWorld keynotes, sessions, and more, visit Oracle OpenWorld 2015 . Join the Oracle OpenWorld discussion on Twitter #oow15, Facebook , and the Oracle OpenWorld blog . \nAbout Oracle PartnerNetwork Oracle PartnerNetwork (OPN) Specialized is the latest version of Oracle's partner program that provides partners with tools to better develop, sell and implement Oracle solutions. OPN Specialized offers resources to train and support specialized knowledge of Oracle products and solutions and has evolved to recognize Oracle's growing product portfolio, partner base and business opportunity. Key to the latest enhancements to OPN is the ability for partners to differentiate through Specializations. Specializations are achieved through competency development, business results, expertise and proven success. \nTo find out more visit http://www.oracle.com/partners . \nTrademarks Oracle is a registered trademark of Oracle and/or its affiliates. View source version on businesswire.com: http://www.businesswire.com/news/home/20151026005100/en/ Copyright © Business Wire 2015", "external_links": [], "published": "2015-10-26T12:00:00.000+02:00", "crawled": "2015-10-26T14:20:00.385+02:00", "highlightTitle": ""}