{"organizations": ["Inc."], "uuid": "0e4f7003df2dad5933a1532cf12ed4b993520307", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eurekalert.org", "main_image": "http://media.eurekalert.org/multimedia_prod/pub/web/101788_web.jpg", "site_section": "http://www.eurekalert.org/rss/technology_engineering.xml", "section_title": "EurekAlert! - Technology, Engineering and Computer Science", "url": "http://www.eurekalert.org/pub_releases/2015-10/mali-dts102215.php", "country": "US", "title": "Discovering the secret to success and innovation in commercializing biotechnology", "performance_score": 0, "site": "eurekalert.org", "participants_count": 0, "title_full": "Discovering the secret to success and innovation in commercializing biotechnology", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T07:00:00.000+03:00", "replies_count": 0, "uuid": "0e4f7003df2dad5933a1532cf12ed4b993520307"}, "author": "", "url": "http://www.eurekalert.org/pub_releases/2015-10/mali-dts102215.php", "ord_in_thread": 0, "title": "Discovering the secret to success and innovation in commercializing biotechnology", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mary Ann Liebert"], "text": "Discovering the secret to success and innovation in commercializing biotechnology Mary Ann Liebert, Inc./Genetic Engineering News Print E-Mail \nIMAGE: \nHuman Gene Therapy , the official journal of the European Society of Gene and Cell Therapy, British Society for Gene and Cell Therapy, French Society of Cell and Gene... view more Credit: ©Mary Ann Liebert, Inc., publishers \nNew Rochelle, NY, October 22, 2015--Mitchell Finer, PhD, a scientist with expertise in biochemistry and molecular biology, who has had an integral role in the success of numerous biotechnology companies, including most recently as chief scientific officer of gene therapy innovator bluebird bio, shares insights on his experiences and what it takes to shepherd a biotech start-up to commercial success in an interview recently published in Human Gene Therapy Clinical Development , a peer-reviewed journal from Mary Ann Liebert, Inc., publishers . The article is available free on the Human Gene Therapy Clinical Development website until November 22, 2015. \nIn \" There and Back Again: Mitch Finer on the Journey of Biotech from Start-up to Success ,\" Human Gene Therapy Clinical Development Editor James M. Wilson, MD, PhD, Director of the Gene Therapy Program, Department of Pathology and Laboratory Medicine, University of Pennsylvania Perelman School of Medicine, Philadelphia, asks Dr. Finer about the technology, timing, and other factors that contributed to the growth of companies such as bluebird bio and Cell Genesys. \nRecounting the turbulent history surrounding the field of gene therapy, the recent early success of CAR-T therapy in treating leukemia with results indicative of the potential for long-term therapeutic benefit, and what Dr. Wilson describes as the \"gene therapy renaissance,\" Dr. Finer states, \"I think we are just starting to enter the mainstream with great clinical data from multiple vectors and clinical indications, and starting to be able to access capital like any other biomedical venture activity.\" \n\"Mitch has been a true pioneer in gene therapy beginning 30 years ago when he and I were postdoctoral fellows in Richard Mulligan's laboratory,\" says Dr. Wilson. \"His perspectives and the state of gene therapy in current day biotechnology are incredibly important.\" ### \nAbout the Journal \nHuman Gene Therapy , the official journal of the European Society of Gene and Cell Therapy, British Society for Gene and Cell Therapy, French Society of Cell and Gene Therapy, German Society of Gene Therapy, and five other gene therapy societies, is an authoritative peer-reviewed journal published monthly in print and online. Led by Editor-in-Chief Terence R. Flotte, MD, Celia and Isaac Haidak Professor of Medical Education and Dean, Provost, and Executive Deputy Chancellor, University of Massachusetts Medical School, Worcester, MA, Human Gene Therapy presents reports on the transfer and expression of genes in mammals, including humans. Related topics include improvements in vector development, delivery systems, and animal models, particularly in the areas of cancer, heart disease, viral disease, genetic disease, and neurological disease, as well as ethical, legal, and regulatory issues related to the gene transfer in humans. Its companion journals, Human Gene Therapy Methods , published bimonthly, focuses on the application of gene therapy to product testing and development, and Human Gene Therapy Clinical Development , published quarterly, features data relevant to the regulatory review and commercial development of cell and gene therapy products. Tables of contents for all three publications and a free sample issue may be viewed on the Human Gene Therapy website. \nAbout the Publisher \nMary Ann Liebert, Inc., publishers is a privately held, fully integrated media company known for establishing authoritative peer-reviewed journals in many promising areas of science and biomedical research, including Nucleic Acid Therapeutics, Tissue Engineering, Stem Cells and Development, and Cellular Reprogramming. Its biotechnology trade magazine, Genetic Engineering & Biotechnology News (GEN), was the first in its field and is today the industry's most widely read publication worldwide. A complete list of the firm's 80 journals, books, and newsmagazines is available on the Mary Ann Liebert, Inc., publishers website. \nDisclaimer: AAAS and EurekAlert! are not responsible for the accuracy of news releases posted to EurekAlert! by contributing institutions or for the use of any information through the EurekAlert system.", "external_links": [], "published": "2015-10-22T07:00:00.000+03:00", "crawled": "2015-10-22T18:52:32.349+03:00", "highlightTitle": ""}