{"organizations": [], "uuid": "1c3a1af73d95516b13c738784c609d88c3525c96", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stockhouse.com", "main_image": "", "site_section": "http://www.stockhouse.com/discovery/information-technology-services", "section_title": "The Information-Technology-Services Report - Information-Technology-Services investor news and research center ", "url": "http://www.stockhouse.com/news/press-releases/2015/10/19/new-workforce-solutions-from-ibm-help-recruiters-find-attract-and-nurture", "country": "CA", "title": "New Workforce Solutions from IBM Help Recruiters Find, Attract and Nurture Talent", "performance_score": 0, "site": "stockhouse.com", "participants_count": 1, "title_full": "New Workforce Solutions from IBM Help Recruiters Find, Attract and Nurture Talent", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "1c3a1af73d95516b13c738784c609d88c3525c96"}, "author": "stockhouse.com", "url": "http://www.stockhouse.com/news/press-releases/2015/10/19/new-workforce-solutions-from-ibm-help-recruiters-find-attract-and-nurture", "ord_in_thread": 0, "title": "New Workforce Solutions from IBM Help Recruiters Find, Attract and Nurture Talent", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ARMONK, N.Y. , Oct. 19, 2015 /PRNewswire/ -- Today, IBM (NYSE: IBM ) is introducing a set of talent acquisition tools designed to help recruiters build more personal relationships with active and passive candidates by helping them attract, hire, nurture and retain the best talent. The new solutions integrate email marketing, marketing automation, candidate relationship management and web traffic analytics technology from IBM Commerce into IBM Kenexa talent acquisition services to allow recruiters to gather more data on potential candidates and engage in personalized discussions before extending an offer.\nWith these tools, companies can compete for top talent in a world where 83 percent of recruiters report that the power of the job search has shifted to the candidate 1 . While today's prospects search for jobs in the same ways they approach a purchase – researching potential employers over an extended period of time – 60 percent of companies only recruit reactively, which means they are missing out on top talent 2 .\n\"Over the last five years, we've seen a shift in recruitment where it is no longer about the position, it is now about the brand. Before someone is interested in a specific job, we at first want them to fall in love with Fossil and want to work here,\" said Ellen Pickle , senior director talent, Fossil. \"Recruiting is all about marketing and we try to create an emotional appeal with our brand. This marketing-led approach is focused on building our capability for the future, not just filling a job.\"\n\"The recruiting landscape is more complex, more dynamic, and more demanding than ever,\" said Jim Hughes , senior director human resources, Red Lobster. \"The traditional methods of job marketing and candidate correspondence just aren't sufficient to be competitive in the labor market anymore. Treating recruitment in a manner similar to marketing is an evolution that companies must undertake to reach talented candidates. Similar to marketers, recruiters need to meet potential candidates where they are, in the channels they use, with messages they are seeking.\"\nTo capture the best talent, organizations need to engage candidates early and often across a variety of channels in the same way that marketers engage with potential customers. By increasing the number of touch points with potential hires, recruiters can increase their appeal while also gathering vital data that they can use to adjust and reset their recruiting strategies in real-time.\nIBM's new solutions can help recruiters extend their outreach across a variety of channels, while also providing analytics to help them track and understand job searching behavior. With access to marketing technology from IBM Commerce –including IBM Marketing Cloud , IBM Digital Analytics and IBM MobileFirst – - through IBM Kenexa , recruiters can build a complete profile of a candidate throughout the job search and proactively engage with top talent to help build lasting candidate relationships. Specifically, the new solutions include:\nCandidate relationship management , which enables recruiters to automate personalized experiences with prospects; IBM Kenexa Lead Manager proactively tracks and engages with internal and external candidates and tracks the success of their recruitment tactics Candidate Web Traffic Analytics, which allows recruiters to measure and monitor talent acquisition traffic to gain insight that they can use to improve candidate engagement and experience, and recruitment effectiveness. Mobile Recruitmen t, which enables recruiters to build a single unified recruitment experience across a variety of channels to help streamline and simplify the application process \"Today, top candidates expect a high-quality recruitment process—the same quality experience they receive as a consumer. They want more feedback and transparency – from the time they start considering a career change to when they submit an application and accept a job,\" said Debbie Landers , general manager, IBM Kenexa and Smarter Workforce. \"IBM's new solution helps companies redefine the recruitment experience and ultimately target the right candidates and improve the experience for everyone involved.\"\nMore details on the new Smarter Workforce solutions can be found at www.ibm.com/recruitment-marketing .\n1 Recruiter Sentiment Study by MRI Network, First Half 2015. http://www.mrinetwork.com/recruitersentiment\n2 Aberdeen Group, \"Talent Acquisition Technology: Today, Tomorrow, and Beyond\" https://www-01.ibm.com/marketing/iwm/dre/signup?source=swg-US_Lotus_WebMerch&S_PKG=ov36740&S_TACT=C28004HW&dynform=19007\nMedia Contact:\nNicholas Smith\nIBM Communications\n[email protected]\n(212) 671-9653\nLogo - http://photos.prnewswire.com/prnh/20090416/IBMLOGO\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/new-workforce-solutions-from-ibm-help-recruiters-find-attract-and-nurture-talent-300161141.html\nSOURCE IBM\nPR Newswire October 19, 2015 - 9:00 AM EDT Tags: INFORMATION TECHNOLOGY SERVICES TECHNOLOGY", "external_links": ["http://www.mrinetwork.com/recruitersentiment", "https://www-01.ibm.com/marketing/iwm/dre/signup?source=swg-US_Lotus_WebMerch&S_PKG=ov36740&S_TACT=C28004HW&dynform=19007", "http://photos.prnewswire.com/prnh/20090416/IBMLOGO", "http://www.ibm.com/mobilefirst/us/en/", "http://www.youtube.com/watch?v=zbQfklsvNtU", "http://www.ibm.com/investor", "http://photos.prnewswire.com/prnvar/20090416/IBMLOGO", "http://rt.prnewswire.com/rt.gif?NewsItemId=NY29964&Transmission_Id=201510190900PR_NEWS_USPR_____NY29964&DateId=20151019", "http://www.ibm.com/commerce/us-en/", "https://welcome.coremetrics.com/analyticswebapp/jsp/login.jsp", "http://www.ibm.com/recruitment-marketing", "http://www.prnewswire.com/news-releases/new-workforce-solutions-from-ibm-help-recruiters-find-attract-and-nurture-talent-300161141.html", "http://www.ibm.com/analytics/us/en/", "http://www.silverpop.com/marketing-cloud/ibm-marketing-cloud/", "http://www-01.ibm.com/software/smarterworkforce/"], "published": "2015-10-19T03:00:00.000+03:00", "crawled": "2015-10-19T23:50:59.054+03:00", "highlightTitle": ""}