{"organizations": [], "uuid": "94e81849d40af9c4c9683ead31d3dcd7d450cdad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "phys.org", "main_image": "http://cdn.phys.org/newman/gfx/news/hires/2014/iphone6.jpg", "site_section": "http://www.physorg.com/rss/rssbycategory.php?categ=16", "section_title": "Phys.org - latest science and technology news stories", "url": "http://phys.org/news/2015-10-iphone-6s-great.html", "country": "US", "title": "Review: IPhone 6s is an upgrade to an already great phone", "performance_score": 0, "site": "phys.org", "participants_count": 0, "title_full": "Review: IPhone 6s is an upgrade to an already great phone", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T02:30:00.000+03:00", "replies_count": 0, "uuid": "94e81849d40af9c4c9683ead31d3dcd7d450cdad"}, "author": "", "url": "http://phys.org/news/2015-10-iphone-6s-great.html", "ord_in_thread": 0, "title": "Review: IPhone 6s is an upgrade to an already great phone", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Review: IPhone 6s is an upgrade to an already great phone October 8, 2015 by Jim Rossman, The Dallas Morning News \nThe end of summer means different things to different people. \nJust as some are excited about the start of a new school year or the promise of cooler temperatures, others (like me) have come to know the end of summer as \"new iPhone time.\" \nKeeping with the release schedule of the last few years, this is an \"S\" year. Last year, Apple introduced iPhone 6 and 6 Plus, while this year we get the 6s and 6s Plus. \nI've come to like the S years best because the phone's design doesn't change, but features inside get an upgrade. \nThis year, the sizes of the phones - 4.7 inches for the 6s and 5.5 inches for the 6s Plus - remain the same, but there are some pretty nice upgrades to the screen, cameras and overall speed of every function. \n3D TOUCH \nThe iPhone has always been a leader in multi-touch technology. Gestures like the tap, swipe and pinch are quite familiar, but now Apple would like to add peek and pop to your gesture vocabulary. \nThe technology behind the 3D Touch screens can sense differing amounts of touch pressure. The system knows the difference between a light press and a heavier touch. \nFor example, when looking at email on the 6s, you can lightly press on a message in the list to bring up a preview. You are not opening the message, just peeking at its first page. If you let go, the message preview disappears, but if you press harder, the message will pop open so you can read the whole thing. \nFirst you peek, then you pop. \nThe peek in mail is a bit more powerful because once you have the preview open, swiping up brings buttons to reply, forward, mark or file the message. Swiping the preview to the left sends the message to the trash (or an archive for Gmail). \nYou can now lightly press some app icons to bring up a menu of handy commands before you open the apps. \nFor instance, lightly pressing the Camera app brings up a menu to Take Photo, Record Slo-Mo, Record Video or Take Selfie. \nSelecting one of these choices quickly brings up the camera app ready to shoot a photo, video or a selfie. \nThese app icon menus are only available on Apple apps at launch, but other app developers will be adding the functionality soon. \nThe peek and pop are already some of my most used gestures during my week with the new iPhone 6s. \nThere's a new Taptic Engine, which makes the small vibrations when you touch the screen. The harder you touch, the harder the vibration. It almost feels like the screen is clicking like a trackpad. It's quite cool. \nCAMERA UPGRADES \nThe last few iPhone models have included 8-megapixel cameras, but the 6s jumps the resolution to 12 megapixels. \nApple likes to say it's not in a megapixel race, but rather it wants the iPhone to shoot the best photos. I think it has accomplished that feat with the 6s and especially the 6s Plus. \nThe larger sensor takes bigger pictures (duh), but Apple has improved the image signal processor and tweaked the local tone mapping so you get photos that are more accurate to what your eye sees. \nThe selfie camera also gets a boost to 5 megapixels and now the screen lights up brightly when taking a selfie to improve the images in low-light situations. It sounds cheesy, but it works great for arm's-length photos. \nI have to say the selfie I took in a completely dark room came out great. \nLIVE PHOTOS \nIf you've been watching any TV in the last two weeks, you've probably seen a commercial for the iPhone's new Live Photos feature, which Apple says \"brings your pictures to life.\" \nLive Photos look like regular pictures, but they're really short video clips. Touching the screen starts the motion. About three seconds of video (with sound) is captured when you press the shutter. This means when you have Live Photos enabled, the phone is constantly recording video, so I'd recommend keeping it off until you're ready to shoot one. \nYou can turn the feature on by pressing the Live Photos icon on the screen right next to where you turn on the flash. \nBe aware that Live Photos takes up a lot more space on your phone, but I can see they're going to be fun. \nYou can set a live photo as your lock screen, and Facebook will support Live Photos in a future update. \n4K VIDEO \nThe iPhone 6 could shoot 1080p video at 1920 x 1080 pixels. The iPhone 6s and 6s Plus can shoot 4K video at 3840 x 2160 pixels. \nI realize 4K is not available everywhere just yet, but I suppose you could show them on your 4K TV, if you have one, or upload them to YouTube, which can accept 4K video. \nIf you do anticipate shooting a lot of 4K HD, you'll want to spring for an iPhone with more internal storage (64gb or 128gb). \nAnd if you're a serious videographer, the 6s Plus is the only model with optical image stabilization, which means your handheld videos will look a lot smoother. \nYou don't have to shoot video in 4K. You have the option to shoot in 720p or 1080p to suit your needs. Smaller videos also take up less space. \nOTHER IMPROVEMENTS \nSo what else is new? \nThe 6s iPhones are made from 7000 series aluminum, which Apple says is the strongest alloy ever used in an iPhone. Let's hope this results in no more bent iPhones. I've been carrying mine in my back pocket, and it has not been a problem. \nApple also says the Retina displays are made from the strongest cover glass used on any smartphone in the world. \nI'm going to take Apple's word for it; I'm not about to put the phone through a torture test. \nRose gold is a new color this year. It's a bit warmer than the regular gold iPhone. Some might even call it pinkish. \nThe processor gets an upgrade to Apple's new A9, which is its fastest phone CPU to date. According to Apple, the A9 is 70 percent faster than the A8, and graphics performance is 90 percent faster. \nThe 6s iPhones also get a bump to 2 gigabytes of RAM. \nStorage options are the same this year - 16Gb, 64Gb and 128 Gb for $649, $749 and $849 for the 4.7-inch iPhone 6S. \nThe 5.5-inch 6S 6s Plus costs $100 more for each configuration ($749, $849 and $949). \nScreen resolution is the same as last year - 1334 x 750 pixels for the 6s and 1920 x 1080 pixels for the 6s Plus. \nHEY, SIRI \nApple's intelligent assistant, Siri, gets an upgrade where Siri is always listening for its activation phrase (Hey, Siri) for hands-free use. \nPrevious phones needed to be connected to power for Hey, Siri to work; it's a power drain on the battery to be constantly listening. \nApple redesigned the M9 motion coprocessor for greater efficiency so now Siri is always listening for her name without a big drain on the battery. \nSpeaking of battery, the 6s battery is a bit smaller than the one on last year's iPhone, but through efficiencies, battery life is largely the same. \nTouch ID (fingerprint unlocking) and Apple Pay remain easy to use. I did notice the unlock passcodes are now six digits instead of four for increased security. \nTouch ID is so fast that I find myself missing notifications on the lock screen because the system reads my fingerprint and unlocks the phone almost instantaneously. \nWATERPROOF? \nA video surfaced last week from YouTube user Zach Straley showing him immersing the iPhone 6s and 6s Plus in water for more than an hour. \nThe phones are up and running during the video, and the phones didn't stop working. \nAfter 48 hours, the only sign of trouble was a light diagonal line across one of the displays. \nTeardowns of the new iPhone do indeed show a small gasket around the inside of the phone's case seam. \nApple hasn't said a word about waterproofing, and I'm sure it will void the warranty, but it's an interesting development. \nLEASING FROM APPLE \nFinally, with big phone companies moving away from subsidized phones, Apple decided to jump into the leasing business by offering unlocked versions of the iPhone 6s and 6s Plus for 24 monthly payments starting at $32.41. \nAppleCare+ is included with the lease. The warranty program covers everything but theft for two years and includes up to two incidents of accidental damage, which only require a $99 service fee to replace the phone. \nYou can also turn in the 6s next year for the new iPhone model and begin a new 24-month lease. \nCONCLUSIONS \nI've been carrying an iPhone 5s for the last two years. I sat out the iPhone 6, but I've been planning and saving to buy the iPhone 6s, and I'm glad I waited. \nThe iPhone 6 and 6 Plus are great phones, but it's interesting to see what tweaks and additions Apple came up with for the 6s iPhones. \nThe newest iPhones seem more refined. \nSometimes change comes just for the sake of change. Apple brought upgrades for the 6s phones that add functionality, convenience and better security. The iPhone 6s and 6s Plus are faster and more powerful than any previous iPhone. \nGeekbench is a popular speed test app, and the iPhone 6s beats out last year's iPhone 6 by over 1,000 points. \nThe iPhone 6s is a great phone, and users of the iPhone 5s and prior models will really notice a big difference. \niPhone 6 users won't see as much benefit to upgrading, but some of the features, like 3D Touch, Live Photos and 4K video, make it at least a phone to be envied. \nLastly, I don't want you to think Apple is out in front on all these features. \nSamsung has offered 4K HD video capture in its last few Galaxy models. \nWe are to the point now where the best features from each company's phones are getting copied - a good thing for all of us. \nThere's room for more than a few good operating systems. There are things to love about Android phones, iPhones and even Windows phones. \nIt's a great time to be a consumer. \n—- \nPros: Super fast, 3D Touch, Live Photos \nCons: Expensive, 16gb is too small for the low-end model. \nBottom Line: Apple keeps making the iPhone better, and this year's models set the bar very high.", "external_links": [], "published": "2015-10-09T02:30:00.000+03:00", "crawled": "2015-10-09T02:40:26.653+03:00", "highlightTitle": ""}