{"organizations": ["Puget Sound Business Journal", "Pacific Northwest"], "uuid": "81d3bec3033c5e730802a4162bdb576b97e371c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tmcnet.com", "main_image": "", "site_section": "http://rss.tmcnet.com/rss/information%20technology", "section_title": "TMCnet.com RSS Service: information technology", "url": "http://www.tmcnet.com/usubmit/2015/10/12/8259484.htm", "country": "US", "title": "Edifecs Honored by Puget Sound Business Journal for Exceptional Revenue Growth in the Pacific Northwest", "performance_score": 0, "site": "tmcnet.com", "participants_count": 0, "title_full": "Edifecs Honored by Puget Sound Business Journal for Exceptional Revenue Growth in the Pacific Northwest", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T16:01:00.000+03:00", "replies_count": 0, "uuid": "81d3bec3033c5e730802a4162bdb576b97e371c9"}, "author": "", "url": "http://www.tmcnet.com/usubmit/2015/10/12/8259484.htm", "ord_in_thread": 0, "title": "Edifecs Honored by Puget Sound Business Journal for Exceptional Revenue Growth in the Pacific Northwest", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Edifecs Honored by Puget Sound Business Journal for Exceptional Revenue Growth in the Pacific Northwest [October 12, 2015] Tweet \nEdifecs, a global health information technology solutions company, ranked 87 on this year's Puget Sound Business Journal 100 Fastest-Growing Private Companies located in the Puget Sound. This honor reflects the company's continued revenue growth and innovation in the healthcare marketplace . \nThe rankings were announced at an award ceremony on Thursday, Oct. 8, at the Westin Hotel Seattle. This is the sixth year Edifecs has been recognized by the Puget Sound Business Journal for its growth and success. \n\"At Edifecs we encorage our team to bring innovative ideas and solutions to our work, and Edifecs' continued growth and success is a direct result of our team,\" said Sunny Singh, CEO of Edifecs. \"We are honored to be recognized for the sixth year, and we look forward to continuing to solve the healthcare industry's most challenging problems.\" \nTogether, the companies on the top 100 list have recorded revenue of nearly $3.74 billion in 2014 - a 158 percent increase over what the companies collectively recorded in 2012. To make the list, companies must have recorded revenue of at least $500,000 in 2012 and demonstrated revenue growth through 2014. The firms are all privately held and headquartered in Washington state. The Business Journal then calculates the revenue growth percentages by which the companies are ranked. \nEdifecs has received several notable awards in 2015, including: GeekWire included Edifecs as a finalist for its \"Geekiest Office\" award. The award program recognizes office spaces that represent the culture and style of the company while inspiring its creative workforce. (May 2015) Healthcare Informatics ( News - Alert ) ranked Edifecs No. 84 in its annual \"HCI 100,\" a list which recognizes the 100 vendors with the highest revenues derived from healthcare IT products and services earned in the U.S. based on revenue information from the previous year. (July 2015) In addition to being ranked as one of the fastest-growing private companies in Washington State, the Puget Sound Business Journal also ranked Edifecs No. 43 on its annual \"Eastside Fastest-Growing Private Companies\" list. (July 2015) Healthcare IT Leaders named the Edifecs blog as one of the \"Best HIT Blogs of 2015.\" The blog highlights pressing issues in the health IT industry, including providing insights into administration simplification, risk adjustment, population health, value-based care and interoperability. (October 2015) \nAbout Edifecs \nEdifecs develops innovative, cost-cutting information technology solutions to transform the global healthcare marketplace. Edifecs is based in Bellevue, WA, with operations internationally. Learn more about us at www.edifecs.com . View source version on businesswire.com: http://www.businesswire.com/news/home/20151012005174/en/", "external_links": [], "published": "2015-10-12T16:01:00.000+03:00", "crawled": "2015-10-12T19:34:07.984+03:00", "highlightTitle": ""}