{"organizations": [], "uuid": "6023f5c4488b0ddc0187b9a89ed2d271a93ebc89", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/k/a/h/f/c/image.related.afrArticleLead.620x365.gkah9f.png/1444945861397.jpg", "site_section": "http://www.afr.com/technology", "section_title": "Technology News | afr.com", "url": "http://www.afr.com/technology/software-upgrade-lets-teslas-model-s-car-drive-itself-20151015-gkah9f", "country": "AU", "title": "Software upgrade lets Tesla's Model S car drive itself", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Software upgrade lets Tesla's Model S car drive itself | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T04:45:00.000+03:00", "replies_count": 0, "uuid": "6023f5c4488b0ddc0187b9a89ed2d271a93ebc89"}, "author": "Marco della Cava", "url": "http://www.afr.com/technology/software-upgrade-lets-teslas-model-s-car-drive-itself-20151015-gkah9f", "ord_in_thread": 0, "title": "Software upgrade lets Tesla's Model S car drive itself", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tesla's Version 7 software upgrade includes an Autopilot feature, which means the Model S will be capable of taking over some of the driving duties from its human masters. Jasper Juinen by Marco della Cava Many owners of Tesla's rakish Model S sedan will wake up with a wildly new car in their garage.\nThe star of Tesla's Version 7 software upgrade, which gets pushed out to U.S. owners overnight, is Autopilot, the company's suite of semi-autonomous tech that teams software tweaks with cameras, radar, ultrasonic sensors. The result is a Model S that is capable of taking over some of the driving duties from its human masters.\n\"We tried to make (Autopilot) work like it's a really good chauffeur, not too conservative, not too aggressive,\" Tesla founder Elon Musk said during a press conference at the company's headquarters here. \"Long term, it'll be way better than a person. It never gets tired, never has something to drink, never argues with someone in the car.\"\nMusk noted that drivers should exercise caution in the initial months of the rollout. \"We're advising drivers to keep their hands on the wheel at this early stage,\" he said, pointing out that the car's dash alerts drivers when they need to take the wheel. \"We describe (the software) as still being in beta.\"\nElon Musk announces Tesla's Version 7 software upgrade, which includes the Autopilot feature. David Paul Morris If there's an accident, the fault will remain the driver of the Tesla, Musk said.\nAutopilot features Autopilot's key features - autosteer, auto lane change and auto park - help move the pioneering electric vehicle manufacturer one step ahead in a race toward semi-autonomy that's now been joined by virtually even major automaker.\nWhile Google gets lots of attention for its fully autonomous vehicle project, the more immediate leap will be to traditional cars that share responsibilities with drivers. Audi has been particularly aggressive with its Pilot Assist research, but the German company has yet to roll out it top developments into cars yet.\nA member of the media test drives a Tesla Motors Model S car equipped with Autopilot. David Paul Morris Musk said Tesla could have a car capable of \"taking you from home to work with you asleep\" in about three years, \"but the regulatory issues are another thing. When the data says it's much safer to have autonomous cars, that's when regulators will be comfortable with it.\"\nNot all owners of Model S sedans, which start at $US70,000, will benefit from this technological leap. Only cars built from late September of last year forward -- about 60,000 of the 90,000 Model Ss on the road to date - have the requisite sensors pre-installed for Autopilot, which costs $US2,500 to activate.\nOwners of older models cannot get their cars retrofitted. But the new Version 7 software will give all Model S models upgrades such as a redesigned user interface on the massive central screen, as well as an improved climate control (the system hits your desired temperature more quickly using less power) and a tweaked vehicle hold feature (which now operates on a flat surface as well as a hill).\nMusk has been in a crowing mood of late. He told a German reporter recently that Apple, which is rumoured to be building a car, needed to realise that making an automobile wasn't as easy as outsourcing a smartwatch. He later took to Twitter to say, \"Yo, I love Apple ...I'm glad they're doing an (electric vehicle).\"\nMusk took a veiled shot at Google when he noted that his own personal vision of the automotive future does not involve sitting in \"a pod going from one place to the other, that sounds boring.\" JUSTIN SULLIVAN Road test Tesla, which launched the Model S in 2012 (after its initial two-seat Roadster) and now has 14,000 employees, recently unveiled its long anticipated second four-door model. The Model X is an SUV with four-wheel drive with distinctive rear \"falcon\" doors that open upward. It will have the same Autopilot capability. The car is expected to cost more than $US100,000.\nMusk's company has yet to turn a profit despite its branding success, a fact that the founder has acknowledged will need to change soon in order for Tesla to succeed in the long term.\nUSA TODAY spent time driving an Autopilot-equipped car on Wednesday, using a nearby freeway to test autosteer and auto lane change. We were not able to test auto park, which admittedly is a feature already offered on a variety of vehicles.\nAutosteer worked seamlessly. A quick toggle on a steering-column mounted stalk activated the system, which simultaneously kicked on cruise control. The Model S stayed within the marked lanes without a fuss.\nTaking your hands off the wheel would occasionally throw up a dashboard message to touch the wheel again, but it was more a suggestion than a demand. Flicking on the turn signal resulted in the car moving into the adjacent lane. Once, the request was made while another car was nearby, and the Model S ignored the command and stayed in its lane.\nGrabbing the wheel and moving it or tapping the brakes disengages the system.\nMusk was keen to highlight the learning nature of Autopilot, which will input all the road data collected by Model S drivers into a central databank that will, over time, provide refined driving-assist data on everything from the ideal speed to take a specific turn to when to break when a pedestrian or cyclist is detected.\n\"The system learns over time,\" Musk said. \"The more people enable Autopilot, the more information is uploaded onto the network. In that sense, each driver is an expert trainer on how Autopilot should work. This can only be done as a connected vehicle.\"\nMusk took a veiled shot at Google when he noted that his own personal vision of the automotive future does not involve sitting in \"a pod going from one place to the other, that sounds boring.\" Google's self-driving car prototype is a pod-like two seater with no steering wheel or pedals.\nNext up for Musk and his Teslas? Pulling into your garage all by themselves.\n\"Version 7.1 of our software will allow our cars to put themselves to bed,\" he said, smiling.", "external_links": [], "published": "2015-10-16T04:45:00.000+03:00", "crawled": "2015-10-16T06:20:49.713+03:00", "highlightTitle": ""}