{"organizations": [], "uuid": "685162a9fdcc0c0ee27e65e0fef3b84f07f9b913", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.gizmag.com", "main_image": "http://img.gizmag.com/powerup-fpv-1.jpg?fit=max&h=594&rect=0%2C155%2C1499%2C844&w=1060&s=95a7fba43713a2aae32c76da77b7ff34", "site_section": "http://feeds.feedburner.com/feedburner/AmkRS", "section_title": "Gizmag Emerging Technology Magazine", "url": "http://www.gizmag.com/powerup-fpv/39877/", "country": "US", "title": "PowerUp FPV lets you see the world from a paper plane's point of view", "performance_score": 0, "site": "gizmag.com", "participants_count": 1, "title_full": "PowerUp FPV lets you see the world from a paper plane's point of view", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T23:42:00.000+03:00", "replies_count": 0, "uuid": "685162a9fdcc0c0ee27e65e0fef3b84f07f9b913"}, "author": "Ben Coxworth", "url": "http://www.gizmag.com/powerup-fpv/39877/", "ord_in_thread": 0, "title": "PowerUp FPV lets you see the world from a paper plane's point of view", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Image Gallery (5 images) \nNot that long ago, it would have been hard to believe that a paper airplane could be electrically powered and remotely-controlled. That was before the original PowerUp kit was launched, however. New features been added since, culminating in today's announcement of the upcoming PowerUp FPV – a kit that will equip your paper planes with motorized propellers and a first-person-view video camera. \nDeveloped in partnership with consumer drone manufacturer Parrot , the FPV consists of a front-located electronics module, a nylon/carbon fiber frame, and two props in the rear, all of which are attached to the top surface of a user-folded paper plane. Turning is achieved by varying the thrust between the props, while climbing and descending are managed simply by changing the flying speed. \nAlong with a VGA-resolution 30fps camera, the front module also contains a 3-axis gyroscope, compass and accelerometer, plus a barometer, Wi-Fi antenna, MicroSD card for recording video, and a removable 550-mAh lithium-polymer battery that should be good for up to 10 minutes of flight time per charge. \nThe user controls the plane and views its real-time video via a smartphone app, from a maximum distance of 300 ft (91 m). This can be done either via a touchscreen interface, or by tilting the phone from side to side. The latter option means that the phone could be mounted in a VR device such as Google Cardboard , with the user then steering simply by moving their head. \nAs an added bonus, the camera can be panned relative to the plane before taking off, so users aren't stuck with only forward-facing video. \nPowerUp will be launching a Kickstarter campaign in November, to raise production funds for the FPV. Assuming it's successful, the kit should be available next summer (Northern Hemisphere), priced at US$199. You can see a prototype in action, in the video below. \nThe Carbon Flyer is based on a similar concept, although it simply records video without streaming it live.", "external_links": [], "published": "2015-10-15T23:42:00.000+03:00", "crawled": "2015-10-16T00:13:25.090+03:00", "highlightTitle": ""}