{"organizations": [], "uuid": "e2673071086e4eebf18612708257f0f7c1a9d865", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "feeds.reuters.com", "main_image": "", "site_section": "http://feeds.reuters.com/reuters/technologysectorNews", "section_title": "Reuters: Technology", "url": "http://feeds.reuters.com/~r/reuters/technologysectorNews/~3/2x5Nb0O5JqE/story01.htm", "country": "US", "title": "Fitch Plans to Withdraw Acer Inc.'s Ratings", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Fitch Plans to Withdraw Acer Inc.'s Ratings | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T07:02:00.000+03:00", "replies_count": 0, "uuid": "e2673071086e4eebf18612708257f0f7c1a9d865"}, "author": "Reuters", "url": "http://feeds.reuters.com/~r/reuters/technologysectorNews/~3/2x5Nb0O5JqE/story01.htm", "ord_in_thread": 0, "title": "Fitch Plans to Withdraw Acer Inc.'s Ratings", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(The following statement was released by the rating agency) HONG KONG/SINGAPORE, October 08 (Fitch) Fitch Ratings expects to withdraw its ratings of Acer Inc. (Acer) after a 30-day period beginning today as they are no longer considered by Fitch to be relevant to the agency's coverage. Fitch will continue to maintain coverage of Acer prior to withdrawal. Fitch currently rates Acer as follows: Long-Term Foreign- and Local-Currency Issuer Default Ratings (IDRs): 'BB-'; Outlook Stable National Long-Term Rating: 'BBB(twn)'; Outlook Stable Fitch reserves the right in its sole discretion to withdraw or maintain any rating at any time for any reason it deems sufficient. Fitch believes that investors benefit from increased rating coverage by Fitch and is providing approximately 30 days' notice to the market on the withdrawal. Ratings are subject to analytical review and change up to the time Fitch withdraws the ratings. Fitch's last rating action on the IDRs was on 4 May 2015 when the ratings were affirmed with a Stable Outlook. On 13 November 2014, the IDRs and the National Long-Term Rating were affirmed and all of the Outlooks revised to Stable from Negative. Contact: Kelvin Ho Director +852 2263 9940 Fitch (Hong Kong) Limited 19/F Man Yee Building 68 Des Voeux Road Central, Hong Kong Janice Chong Director +65 6796 7241 Media Relations: Wai-Lun Wan, Hong Kong, Tel: +852 2263 9935, Email: wailun.wan@fitchratings.com. Note to editors: Fitch's National ratings provide a relative measure of creditworthiness for rated entities in countries with relatively low international sovereign ratings and where there is demand for such ratings. The best risk within a country is rated 'AAA' and other credits are rated only relative to this risk. National ratings are designed for use mainly by local investors in local markets and are signified by the addition of an identifier for the country concerned, such as 'AAA(twn)' for National ratings in Taiwan. Specific letter grades are not therefore internationally comparable. Additional information is available on www.fitchratings.com ALL FITCH CREDIT RATINGS ARE SUBJECT TO CERTAIN LIMITATIONS AND DISCLAIMERS. PLEASE READ THESE LIMITATIONS AND DISCLAIMERS BY FOLLOWING THIS LINK: here . IN ADDITION, RATING DEFINITIONS AND THE TERMS OF USE OF SUCH RATINGS ARE AVAILABLE ON THE AGENCY'S PUBLIC WEBSITE 'WWW.FITCHRATINGS.COM'. PUBLISHED RATINGS, CRITERIA AND METHODOLOGIES ARE AVAILABLE FROM THIS SITE AT ALL TIMES. FITCH'S CODE OF CONDUCT, CONFIDENTIALITY, CONFLICTS OF INTEREST, AFFILIATE FIREWALL, COMPLIANCE AND OTHER RELEVANT POLICIES AND PROCEDURES ARE ALSO AVAILABLE FROM THE 'CODE OF CONDUCT' SECTION OF THIS SITE. FITCH MAY HAVE PROVIDED ANOTHER PERMISSIBLE SERVICE TO THE RATED ENTITY OR ITS RELATED THIRD PARTIES. DETAILS OF THIS SERVICE FOR RATINGS FOR WHICH THE LEAD ANALYST IS BASED IN AN EU-REGISTERED ENTITY CAN BE FOUND ON THE ENTITY SUMMARY PAGE FOR THIS ISSUER ON THE FITCH WEBSITE.", "external_links": ["HTTP://FITCHRATINGS.COM/UNDERSTANDINGCREDITRATINGS"], "published": "2015-10-09T07:02:00.000+03:00", "crawled": "2015-10-09T08:23:52.544+03:00", "highlightTitle": ""}