{"organizations": ["Google"], "uuid": "e3ce2c069815b525bd29d07d8ea2e430e21e090b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "phys.org", "main_image": "http://cdn.phys.org/newman/gfx/news/2015/theadditiono.jpg", "site_section": "http://phys.org/rss-feed/technology-news/business-tech/", "section_title": "Technology Business News - Technology News, Technology Companies, Technology Business", "url": "http://phys.org/news/2015-10-google-funding-messaging-symphony.html", "country": "US", "title": "Google joins funding round for secure messaging service Symphony", "performance_score": 0, "site": "phys.org", "participants_count": 0, "title_full": "Google joins funding round for secure messaging service Symphony", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T23:06:00.000+03:00", "replies_count": 0, "uuid": "e3ce2c069815b525bd29d07d8ea2e430e21e090b"}, "author": "", "url": "http://phys.org/news/2015-10-google-funding-messaging-symphony.html", "ord_in_thread": 0, "title": "Google joins funding round for secure messaging service Symphony", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Google joins funding round for secure messaging service Symphony October 12, 2015 The addition of tech giant Google to the largely finance- and venture capital-dominated pool of backers was seen as opening the possibility for Symphony to broaden beyond the financial industry \nSymphony, a financial industry messaging startup, announced Monday that it has raised $100 million in a new round of funding from backers that included Google. \nAn encrypted messaging platform launched by the year-old company has become a fast-growing rival to a service offered by Bloomberg. \nGoogle was joined in the new funding round by Swiss bank UBS, French banks Natixis and Societe Generale, and venture capital firms Lakestar and Merus Capital, an existing investor, according to Symphony. \nThe new funding was reported to up Symphony's value to $650 million. \nThe Silicon Valley-based company expected the cash infusion to power worldwide expansion and efforts to win more users, which the startup says currently number more than 40,000 in 100 countries. \n\"$100+ million is more than what we anticipated to raise!\" Symphony CEO David Gurle said in a blog post on the company website. \n\"This amount gives us the runway to stay focused on our vision of becoming the standard for business communications and allow us to accelerate our growth globally.\" \nThe rise of Symphony poses a lower-cost challenge to the messaging service on Bloomberg's terminals, which have long been an industry-standard communications tool for financial institutions, traders and clients. \nPrior to the new funding round, Symphony had been backed by some of the biggest global financial firms, which gained access to the messaging service through their investment. \nSilicon Valley-based Symphony had made the service publicly available September 15. \nThe addition of tech giant Google to the largely finance- and venture capital-dominated pool of backers, was seen as opening the possibility for Symphony to broaden beyond the financial industry Monday. \nIn his blog post, Gurle attributed investor interest in his company to \"a unique architectural approach,\" that is cloud-based, designed to protect against cyber threats and in which customers own the encryption infrastructure. \n\"Symphony is built for highly regulated businesses and enterprises that need to meet regulatory compliance requirements, with a passion for intuitive user experience and engaging design,\" he added. \nHe said the company has booked more than $10 million in service contracts in recent months. World Bank invests in online education July 10, 2013 \nOnline education service Coursera on Wednesday announced a fresh round of funding from the investment arm of the World Bank and other backers. SurveyMonkey valued at $2 bn after funding round December 15, 2014 \nSurveyMonkey, a popular online survey service, announced Monday it has raised $250 million in capital to help fund expansion plans. With $15 billion valuation, Palantir looks to raise more money January 20, 2015 \nPalantir Technologies, the big data company founded by entrepreneur and billionaire investor Peter Thiel, is looking to raise yet another round of capital, after landing $500 million from investors last year, according to ... End of story at Oyster, e-book subscription startup September 22, 2015 \nOyster, the startup seeking to be the \"Netflix for e-books\" by offering unlimited reading for a monthly fee, says its story is coming to an end. Uber launches new commute sharing, starting in China September 23, 2015 \nRide-sharing giant Uber has unveiled a new car-sharing service for commuters, which will be launched first in Chengdu, China. Google targets investment Symphony secure messaging October 6, 2015 \nGoogle is set to invest in secure messaging start up Symphony, primarily used by major financial entities and valued at $650 million, the Wall Street Journal said Tuesday. Recommended for you Facebook to test mobile app shopping tab October 12, 2015 \nFacebook said Monday that it will begin testing a shopping tab for its mobile app as it works to ramp up advertising and online commerce offerings. Vehicle fuel economy standards as global climate policy: How much can they deliver and at what cost? October 12, 2015 \nOver the past decade, many countries and regions seeking to reduce climate-warming carbon dioxide emissions have adopted more aggressive fuel economy standards designed to boost the efficiency of new, light-duty cars and ... Dell buying EMC in $67 billion bet on data storage October 12, 2015 \nDell is buying data storage company EMC for $67 billion in a huge bet on a segment of technology that has proven to be more profitable than the slumping personal computer market. Electronics that better mimic natural light promise more vivid, healthy illumination October 12, 2015 \nDespite technological leaps in modern electronics, the quality of lighting they provide still leaves much room for improvement. Discovery about new battery overturns decades of false assumptions October 6, 2015 \nNew findings at Oregon State University have overturned a scientific dogma that stood for decades, by showing that potassium can work with graphite in a potassium-ion battery - a discovery that could pose a challenge and ... Scientists convert harmful algal blooms into high-performance battery electrodes October 9, 2015 \nLast August, the seasonal harmful algal blooms (HABs) in Lake Erie grew so extreme that they poisoned the water system in Toledo, Ohio, leaving nearly half a million residents without drinking water. But a few researchers ...", "external_links": [], "published": "2015-10-12T23:06:00.000+03:00", "crawled": "2015-10-13T02:30:00.660+03:00", "highlightTitle": ""}