{"organizations": [], "uuid": "63dfc445bc378a5290c96ec91e8352eea83ad3f8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/13536/technology-news", "section_title": "Technology &amp; Science News - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30318833/biologists-fly-drone-to-track-health-of-endangered-orcas", "country": "US", "title": "Biologists fly drone to track health of endangered orcas", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Biologists fly drone to track health of endangered orcas - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "63dfc445bc378a5290c96ec91e8352eea83ad3f8"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30318833/biologists-fly-drone-to-track-health-of-endangered-orcas", "ord_in_thread": 0, "title": "Biologists fly drone to track health of endangered orcas", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By PHUONG LE\nAssociated Press SEATTLE (AP) - Federal biologists flying a drone have taken thousands of rich images of endangered Puget Sound orcas showing the whales are in good condition this year and that several appear to be pregnant.\nThe drone flights over Washington's San Juan Islands captured striking photographs of all 81 members of the small population of orcas that spend much of their time in the state's inland waters. They also documented endangered killer whales that spend time in Canada's waters.\nResearchers with the National Oceanic and Atmospheric Administration and Vancouver Aquarium in British Columbia are using those images to measure and track the health and growth of individual whales over time.\n\"We're really answering a simple question. Are these killer whales getting enough to eat?\" said John Durban, a marine mammal biologist with NOAA's Southwest Fisheries Science Center in La Jolla, California.\nThis year it appears that the population is in good shape, even experiencing a baby boom with five new calves born in the past 12 months or so. It suggests that feeding has been good, Durban said.\nResearchers want to know how fat or long the whales are from year to year, how well they are reproducing, how their body conditions change and how those factors might correlate with the amount of salmon they have to eat.\nSeveral appeared to be pregnant, but Durban said they won't know how many until they do more analysis.\nScientists are using drones to track and monitor wildlife in the U.S. and elsewhere. They have used drones to count penguins and seals in Antarctica, stellar sea lions in Alaska's Aleutian Islands and to take breath samples of humpback whales off New England.\nSome say drones can be a cost-effective, efficient tool to monitor birds, whales and other wildlife in places that are hard to reach and where a quiet, small device can prevent wildlife disturbance.\nScientists previously use helicopters to photograph killer whales in the Pacific Northwest, but those flights were more expensive and the aircraft flew at much higher altitudes.\nNOAA's Durban said the drone they used this summer hovered about 100 feet over the whales, offering crisp, detailed views that they previously have not been able to obtain. He and others said it didn't appear to disturb the whales.\nSome of the images revealed the close family relationships between the orca, including a baby orca nursing with its mother and another of two whales bringing salmon to a mother and her calf. In one case, the scientists captured images of a pregnant whale and then later of that whale with a newborn orca.\nOver several weeks in September, Durban and his colleagues remotely operated a drone from a boat. It weighed about 4 ½ pounds equipped with a specialized camera and other equipment.\nThe idea is to measure the whales over time to see how fat or thin they are in good or bad years for salmon runs. The southern resident killer whales primarily eat Chinook salmon. A decline in prey, along with contaminants and disturbance from vessel traffic, are among the reasons the animals are declining.\n\"What we're interested in is change over time that we can attribute to environmental conditions,\" said Lance Barrett-Lennard, a senior marine mammal scientist at the Vancouver Aquarium.\n ", "external_links": [], "published": "2015-10-21T03:00:00.000+03:00", "crawled": "2015-10-21T23:39:13.963+03:00", "highlightTitle": ""}