{"organizations": ["Ofcom"], "uuid": "83536fc6c46618f82e16b402f036061b34b28d23", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.rapidtvnews.com", "main_image": "http://www.rapidtvnews.com/templates/rapidtvnews2014/images/touch-icon-ipad-retinabig.png", "site_section": "http://rapidtvnews.com//feed/rss.html", "section_title": "Rapid TV News - Broadcast Technology Daily", "url": "http://www.rapidtvnews.com/2015101540282/ofcom-brings-uk-vod-regulation-in-house.html", "country": "FR", "title": "Ofcom brings UK VOD regulation in house", "performance_score": 0, "site": "rapidtvnews.com", "participants_count": 0, "title_full": "Ofcom brings UK VOD regulation in house", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T10:28:00.000+03:00", "replies_count": 0, "uuid": "83536fc6c46618f82e16b402f036061b34b28d23"}, "author": "", "url": "http://www.rapidtvnews.com/2015101540282/ofcom-brings-uk-vod-regulation-in-house.html", "ord_in_thread": 0, "title": "Ofcom brings UK VOD regulation in house", "locations": ["UK"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "VOD Editor 15-10-2015 \nAfter a spate of legal cases involving a separate adjudication body, the regulation of UK video-on-demand programme services will now be controlled by Ofcom. Online Video Joseph O'Halloran 15-10-2015 \nAs it 'solves' what it calls deficiencies in the mobile video supply market, AerServ has reported significant gains in company momentum. Programmatic video advertising spending to triple in 2015 Michelle Clancy 15-10-2015 \neMarketer forecasts that 59% of the $26.15 billion spent on US digital display ads this year will be transacted programmatically, but just 39% of US digital video ad dollars will be. MoCA 2.0 delivers 400Mbps in field tests Cable Michelle Clancy 15-10-2015 \nThe Multimedia over Coax Alliance has completed MoCA 2.0 field tests in the US, demonstrating better than 400Mbps net data rates. 300MN 4K TVs to be sold by end of 2019 4K/UltraHD Michelle Clancy 15-10-2015 \nMore than 330 million 4K Ultra HD TVs will be sold globally by the end of 2019 according to connected CE research from Parks Associates. Netflix US subscriber additions flag, mulls news content OTT Michelle Clancy 15-10-2015 \nThe wheels on the Netflix juggernaut seem to be slowing as the subscription video-on-demand (SVOD) leader added only 880,000 net subscribers in the US during the third quarter. Rovi signs Summit Broadband for Passport Guide HD Pay-TV Michelle Clancy 15-10-2015 \nRovi has announced its first customer for Passport Guide HD as Summit Broadband while also introducing i-Guide HD, to its line of interactive programme guides. Online Video Michelle Clancy 15-10-2015 \nBroadcast giant CBS' content discussions with Apple will probably lead to a deal, according to CEO Les Moonves. Second Screen Editor 15-10-2015 \nMultiscreen users spend the same amount of time viewing video on TV as they do on digital platforms globally says a report from Millward Brown. Online Video Editor 15-10-2015 \nContent marketing and media platform provider AnyClip is to partner with ad serving firm LKQD to develop a screen-agnostic premium video monetisation solution. Vubiquity, TV2U eye VOD markets in Asia, Middle East VOD Rebecca Hawkes 15-10-2015 \nContent service provider Vubiquity and TV2U are joining forces to deliver transactional video-on-demand (VOD) services in Indonesia, UAE, Qatar, Oman, and Kuwait.", "external_links": [], "published": "2015-10-15T10:28:00.000+03:00", "crawled": "2015-10-15T10:38:46.119+03:00", "highlightTitle": ""}