{"organizations": [], "uuid": "ecf03e252eb4676df67b3deb2b292c6405d9862c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com/news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1140192/lifeline-software-inc-today-announces-a-new-collaboration-with-radyalis-llc-an-austin-", "country": "US", "title": "LifeLine Software, Inc. Today Announces A New Collaboration With Radyalis LLC, An Austin, Texas Based Radiotherapy Technology Software Company", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "LifeLine Software, Inc. Today Announces A New Collaboration With Radyalis LLC, An Austin, Texas Based Radiotherapy Technology Software Company", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T12:57:00.000+03:00", "replies_count": 0, "uuid": "ecf03e252eb4676df67b3deb2b292c6405d9862c"}, "author": "admin", "url": "http://www.freshnews.com/news/1140192/lifeline-software-inc-today-announces-a-new-collaboration-with-radyalis-llc-an-austin-", "ord_in_thread": 0, "title": "LifeLine Software, Inc. Today Announces A New Collaboration With Radyalis LLC, An Austin, Texas Based Radiotherapy Technology Software Company", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  LifeLine Software, Inc. \nAUSTIN, Texas, Oct. 14, 2015 /PRNewswire/ -- LifeLine Software, Inc., a quality assurance software company servicing radiation oncology centers worldwide, and Radyalis LLC, a leader in advanced particle therapy software, have formed a long-term collaborative relationship to allow LifeLine Software to bring to market the next-generation portfolio of industry-changing quality assurance solutions. \nThe flagship offering currently in development will be the first 3D Dose Volume Independent Dosimetric Verification software package that utilizes Radyalis' revolutionary Monte Carlo dose calculation engine for photons and electrons. Radyalis' technology has shown to be the fastest and most accurate method for Monte Carlo proton dose simulation. This unique expertise is being applied to photon and electron dose simulation with the potential of making practical today the significant advantage of Monte Carlo accuracy for clinical usage. In contrast to today's approximate analytic methods, Monte Carlo is widely recognized as the precise gold standard dose calculation method. \nUnder the terms of the agreement, LifeLine Software, Inc. has worldwide rights to Radyalis' Monte Carlo technology exclusively for secondary independent dosimetric photon and electron quality assurance applications. \nRadyalis' technology utilizes cutting-edge algorithmic and software architecture advances for unparalleled verification performance and accuracy on customers' existing computing hardware. GPU or additional hardware acceleration is not required or necessary. \nRadyalis Monte Carlo technology precisely models all relevant particle physics and physical transport including machine head and beam-limiting devices such as jaws, MLCs, and wedges. This capability allows the potential for challenging clinical cases to be analyzed with the highest accuracy and confidence such as inhomogeneous head, neck, and lung regions; critical structures; and metal implants. Intended flexible deployment options will allow users to combine the precise accuracy of a Monte Carlo dose calculation algorithm with the levels of speed and productivity that allow busy radiation departments to meet their needs. \n\"We are excited to be working with the Radyalis team to deliver world-class quality assurance software benefiting potentially millions of cancer patients worldwide. The goal with this collaboration is to provide both accuracy and speed that has been unimaginable until now,\" said LifeLine Software's Co-Founder and President, Jim Dube. \nThis agreement also provides both companies future collaborative opportunities for more advanced modalities and capabilities. \n\"Our goal at Radyalis is to provide leadership software technologies for radiation treatment planning and particle-therapy roadmaps. We are delighted to partner with LifeLine Software, a clear leader in the quality assurance marketplace, to bring our unique Monte Carlo technologies to the RadCalc software offering. By working with LifeLine on advanced software solutions, together we have the opportunity to fundamentally impact the radiotherapy arena and, ultimately, clinician treatment confidence,\" said Radyalis' Co-Founder and CEO, Dr. Sani Nassif. \nLSI's CEO and Co-Founder Craig Laughton said, \"At LifeLine Software, we have always strived to meet and exceed our customers' expectations and to listen to their needs. With the increasing complexity of treatment delivery, the demand for sophisticated quality assurance tools has grown. This partnership with Radyalis represents our commitment to our customers to bring the best 3D dose validation tools to the market. We believe the Monte Carlo dose calculation technology provided by Radyalis will not only meet our customers' needs but exceed their expectations.\" \nAbout LifeLine Software, Inc. \nFounded in 1999 by Craig Laughton (CEO) and James Dube (President), Lifeline Software Inc. is a privately held software company headquartered in Tyler, Texas servicing over 2,000 radiation oncology centers worldwide. RadCalc® was developed to provide the most comprehensive QA software program FDA 510(k) cleared to perform independent dosimetric validation calculations including 2D/3D, IMRT, Compensator IMRT, VMAT, 3D Dose Volume-Brachytherapy, Superficial, CyberKnife, Diode, and EDW support. \nPress Contact LifeLine Software, Inc. \nJim Dube", "external_links": [], "published": "2015-10-14T12:57:00.000+03:00", "crawled": "2015-10-14T13:47:05.898+03:00", "highlightTitle": ""}