{"organizations": [], "uuid": "1e505cb057451826aaaaa6bce3fb977e009d48d2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.clarionledger.com", "main_image": "http://www.gannett-cdn.com/-mm-/9743a23810a474510862ce05c8c721e9b6024bb8/c=0-243-1129-881&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/13/JacksonMS/JacksonMS/635803578205726219-Tony-Jeff.JPG", "site_section": "http://news.google.com/news?hl=en&gl=us&q=technology&pws=0&bav=on.2,or.r_gc.r_pw.r_cp.r_qf.&bpcl=38093640&biw=1366&bih=653&um=1&ie=UTF-8&output=rss", "section_title": "technology - Google News", "url": "http://www.clarionledger.com/story/business/2015/10/14/jeff-technology-evolving-too-fast/73893232/", "country": "IL", "title": "Jeff: Is technology evolving too fast? - Jackson Clarion Ledger", "performance_score": 0, "site": "clarionledger.com", "participants_count": 0, "title_full": "Jeff: Is technology evolving too fast? - Jackson Clarion Ledger", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T00:28:00.000+03:00", "replies_count": 0, "uuid": "1e505cb057451826aaaaa6bce3fb977e009d48d2"}, "author": "", "url": "http://www.clarionledger.com/story/business/2015/10/14/jeff-technology-evolving-too-fast/73893232/", "ord_in_thread": 0, "title": "Jeff: Is technology evolving too fast? - Jackson Clarion Ledger", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Tony Jeff", "Jackson", "Jeff"], "text": "Jeff: Is technology evolving too fast? Tony Jeff, Contributing columnist 4:28 p.m. CDT October 14, 2015 Tony Jeff 8 CONNECT 9 TWEET LINKEDIN 1 COMMENT EMAIL MORE \nI have a question I shouldn’t be asking. At Innovate Mississippi, we work to drive innovation and technology in Mississippi. I’m also a self-proclaimed technology evangelist. Even so, I have actually found myself wondering lately: Is technology evolving too fast? \nGranted, technologies like cloning, genetically modified crops or even intentional selection for genetic traits may be advancing beyond our ability to understand their ramifications. What I’ve really been thinking about lately, though, is whether or not simple technologies have evolved past the point that they fit our evolution as humans and the social norms that we have developed over many centuries. In other words, are humans evolving fast enough for technology, or are the ways we are wired being disrupted by technology? \nIn many ways, the compelling pull to stay constantly connected and the overwhelming amount of information that is available all the time seem to be replacing human interaction. Consider, for example, how social norms have been disrupted with the introduction of the smartphone. That type of information, videos and apps is a compelling reason to focus on that machine — and not on the world happening around us. How many times have you seen a group of young people all hanging out but looking at their phones and not at each other? This screen time has come to replace human interactions in a way that isn’t just bad for the individual; it also seems to break with our much evolved social structure. \nWhile the idea of the family sitting around the dinner table talking about the day’s events may have been more of a goal than a reality over the past few decades, that ritual has been transformed by the smartphone. I can’t tell you how many times I’ve witnessed a family at dinner and every single family member is looking at their phone. My kids are too young to have a smartphone, but just getting them unplugged from the world around them to enjoy dinner with the family is already something I’m starting to think about how we can do one day. \nJust as disturbing to me is the lack of any semblance of alone time. Not to be too old-fashioned, but are expressions like “quiet time alone” or “alone with a good book” even relevant in a “fear of missing out” world? I first heard the expression “cocooning” in a marketing class 20 years ago, which was used to describe how people use technology to not interact with others — but even though they are physically alone, they aren’t actually alone in thought because they are always connected. Should we be worried that spending quality time alone and unconnected, which seemed so important to so many generations earlier, has practically disappeared in just the last 10 years? \nI also think that the innovative internet and technology that does now connect us to the outside world in unprecedented ways can trigger fears and emotions that become over stimulated. The evolution of our emotions was based on events near to us, and the very real emotions of love, fear, happiness and closeness have been wired to cause us to react to nearby events in the right way. While events on the other side of the world shouldn’t be hidden from us, our ability to obsessively follow every activity — to feel everything as it happens — may trigger some emotions that should be reserved for near and real dangers. It’s not just a desensitization that I fear, but at a time when someone in middle America is paralyzed with guilt over the Syrian refugee crisis, I simply fear that the emotions triggered won’t really match the reality they should. \nAs we all must sort through these questions of how emotional and social triggers will be affected by technology, the prospect of a mismatch between technology and long-established and hard-wired evolutionary traits does concern me. Realistically, I’m not going to stop or even slow down using technology, but I do plan to make sure that I’m responsibly controlling how I and my family uses it — and not the other way around. As a society, we need to continue to try to make sure that technology is a blessing and not something that disrupts our important social and emotional norms. \nTony Jeff is the president and CEO of Innovate Mississippi. He can be reached at tjeff@innovate.ms. 8 CONNECT 9 TWEET LINKEDIN 1 COMMENT EMAIL MORE Read or Share this story: http://on.thec-l.com/1Lupyhi MORE STORIES", "external_links": [], "published": "2015-10-15T00:28:00.000+03:00", "crawled": "2015-10-15T17:21:54.467+03:00", "highlightTitle": ""}