{"organizations": ["MTTS Tactical Troposcatter Solution Provides High Bandwidth Datalink for NATO", "Comtech Systems", "Comtech Systems, Inc."], "uuid": "bb002f4b857919db71a837924fe30c6081f7a678", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "globenewswire.com", "main_image": "http://globenewswire.com/Attachment/LogoDisplay/361634?filename=361634.png&amp;size=1", "site_section": "http://globenewswire.com//Rss/industry/9000/Technology", "section_title": "GlobeNewswire: Industry News on Technology", "url": "http://globenewswire.com/news-release/2015/10/20/778025/0/en/Comtech-Systems-Inc-s-MTTS-Tactical-Troposcatter-Solution-Provides-High-Bandwidth-Datalink-for-NATO-Trident-Juncture-2015-Exercise.html?f=22&fvtc=3&fvtv=9000", "country": "US", "title": "Comtech Systems, Inc.’s MTTS Tactical Troposcatter Solution Provides High Bandwidth Datalink for NATO Trident Juncture 2015 Exercise", "performance_score": 0, "site": "globenewswire.com", "participants_count": 0, "title_full": "Comtech Systems, Inc.’s MTTS Tactical Troposcatter Solution Provides High Bandwidth Datalink for NATO Trident Juncture 2015 Exercise", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T22:03:00.000+03:00", "replies_count": 0, "uuid": "bb002f4b857919db71a837924fe30c6081f7a678"}, "author": "", "url": "http://globenewswire.com/news-release/2015/10/20/778025/0/en/Comtech-Systems-Inc-s-MTTS-Tactical-Troposcatter-Solution-Provides-High-Bandwidth-Datalink-for-NATO-Trident-Juncture-2015-Exercise.html?f=22&fvtc=3&fvtv=9000", "ord_in_thread": 0, "title": "Comtech Systems, Inc.’s MTTS Tactical Troposcatter Solution Provides High Bandwidth Datalink for NATO Trident Juncture 2015 Exercise", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comtech Systems, Inc.’s MTTS Tactical Troposcatter Solution Provides High Bandwidth Datalink for NATO Trident Juncture 2015 Exercise ET | Source: The Comtech Systems photo-release Comtech Systems MTTS Tactical Troposcatter solution was used in a recent NATO Trident Juncture 2015 exercise. \nOrlando, FL , Oct. 20, 2015 (GLOBE NEWSWIRE) -- Comtech Systems, Inc., a world leader in creating customized Beyond Line-of-Sight and troposcatter communications networks, has provided a high data rate troposcatter (tropo) link for NATO’s Trident Juncture 2015 Exercise (TJRE15), utilizing its advanced MTTS Tactical Troposcatter Solution. \nThe link was provided in partnership with NATO Communications and Information Agency (NCI Agency), to enable highly resilient, low-latency communications between the Land Component Command Headquarters at San Gregorio, and the Joint Task Force Headquarters at Zaragoza Air Force Base, in Spain. The troposcatter system was selected to create a non-satellite link between two locations, over a path that precluded the use of Line-of-Sight (LOS) communications due to blockage by an intermediate mountain. \nHigh data rate communications over an obstructed link operating in diffraction mode provides an additional capability for NATO, with the added advantage that the capability is obtained using the same equipment/terminals used for long-haul troposcatter communications. These systems meet operational scenarios requiring high throughput communications without the need for relays in areas with difficult terrain and obstructed communication paths. A further benefit is that these terminals provide a saving over the cost of satellite communications as well as eliminating the need for high towers to try to establish LOS links. \n“The troposcatter terminals deployed at TJRE15 provided the expected high-capacity connection between Zaragoza and San Gregorio sites. The demonstration link not only provided low transmission delay wide-area network capacity to the exercise community, it also validated the findings of the NATO Scientific Program of Work for transmission systems in support of future deployable operations,” said Hermann Wietgrefe, NCIA lead DCIS Scientist. “The link was set to 12 Mb/s to maximize its resiliency in a particularly radio noisy area such as Zaragoza Air Base. Despite the challenging nature of the wireless link, which was blocked by a large intermediate flat mountain causing double diffraction, the radio link performance was on par with SATCOM standards, in terms of bit error rates.” added Luis Bastos, NCIA lead Wireless Communications Scientist. \nNATO CIS Group TJRE15 SSG Lead Engineer Chand Ghei stated that “the troposcatter link was vital for the success of the exercise” and that “such advanced troposcatter solutions have large potential for usage in NATO tactical scenarios, as the offered low transmission delay between two deployed HQs is of key value. At TJRE15, users were benefitting from the low delay to run client-based applications between the two locations, therefore avoiding being affected by the transmission delay typical of SATCOM links.” \nComtech Systems is pleased to have been able to support the NATO Trident Juncture 2015 Exercise. “The Tactical BLOS/Troposcatter Solution being used effectively demonstrates the capabilities of Comtech System’s best-in-class, high data rate digital systems being supplied worldwide,” said Richard Burt, President of Comtech Systems, Inc. “Our ability to greatly increase the bandwidth available to NATO forces, during this exercise and in difficult terrain, demonstrates the great progress in over-the-horizon technology pioneered by Comtech Systems. \nAbout Comtech Systems Comtech Systems, Inc. ( www.comtechsystems.com ) specializes in system design, integration, supply and commissioning of turnkey communication systems including over-the-horizon microwave, line-of-sight microwave and satellite. \nComtech Systems is a wholly owned subsidiary of Comtech Telecommunications Corp. which designs, develops, produces and supplies innovative products, systems and services for advanced communications solutions Brian Burt, Vice President of International Marketing Comtech Systems 407-854-1950 Related Articles", "external_links": [], "published": "2015-10-20T22:03:00.000+03:00", "crawled": "2015-10-20T22:45:35.245+03:00", "highlightTitle": ""}