{"organizations": [], "uuid": "e368def51612b8b1b5bcdd69c22e86fa009f039c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.businessspectator.com.au", "main_image": "", "site_section": "http://www.businessspectator.com.au/technology", "section_title": "Technology | Business Spectator", "url": "https://www.businessspectator.com.au/news/2015/10/15/financial-markets/european-stocks-weaken-close", "country": "US", "title": "European stocks weaken at close", "performance_score": 0, "site": "businessspectator.com.au", "participants_count": 1, "title_full": "European stocks weaken at close | Business Spectator", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T15:00:00.000+03:00", "replies_count": 0, "uuid": "e368def51612b8b1b5bcdd69c22e86fa009f039c"}, "author": "AFP with a staff reporter", "url": "https://www.businessspectator.com.au/news/2015/10/15/financial-markets/european-stocks-weaken-close", "ord_in_thread": 0, "title": "European stocks weaken at close", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Resurgent worries over China's slowdown have sent European stocks lower, while disappointing US data rekindling hopes for a delay in an interest rate hike failed to revive the markets.\nEuropean stocks, after briefly paring their losses in afternoon trading, ended the day down considerably.\nFrankfurt's DAX 30 fell 1.2 per cent to close at 9,915.85 points, while the Paris CAC 40 shed 0.7 per cent to 4,609.03.\nDespite news that Britain's jobless total has struck a seven-year low, London's benchmark FTSE 100 index slumped 1.2 per cent to 6,269.61.\nIn foreign exchange trading, the euro climbed to $US1.1440 from $US1.1381 late on Tuesday on the US data.\n\"The US dollar has been the worst performer, not surprising given that this afternoon's weak US data raises expectations that the Fed may well remain on hold for longer,\" Michael Hewson, chief market analyst at CMC Markets UK, said.\nEarly European trading was dominated by the Chinese data, but share indices briefly recovered in the wake of disappointing US data being seen as a sign the US Federal Reserve may hold off raising interest rates further.\nThe Commerce Department said US retail sales edged up in September by just 0.1 per cent from the previous month, and August was revised down to flat, as low petrol prices pull down the value of sales.\nRetail sales are a sign of the strength of consumer spending, which drives about two thirds of the US economy's activity.\nMeanwhile sinking energy costs pushed US producer prices 0.5 per cent lower in September in another sign of deflationary pressures in the economy, Labor Department data showed.\nMarkets have been tracking economic data closely for signs when the US Federal Reserve may finally start raising interest rates given concerns about persistent low inflation and recent global volatility slowing economic growth.\nIn midday trade the Dow Jones Industrial Average was down 0.5 per cent to 16,992.19 points.\nMeanwhile, the broad-based S&P 500 shed 0.4 per cent to 1,995.84 points and tech-rich Nasdaq Composite Index gave up 0.3 per cent to 4,782.04.", "external_links": [], "published": "2015-10-15T15:00:00.000+03:00", "crawled": "2015-10-14T23:54:56.663+03:00", "highlightTitle": ""}