{"organizations": [], "uuid": "f65b28bce180d7483ef3b5d9bd887702f72c2ed7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "http://s4.reutersmedia.net/resources/r/?m=02&d=20151012&t=2&i=1086520067&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXNPEB9B11S", "site_section": "http://www.reuters.com/news/technology", "section_title": "Technology News | Reuters.com", "url": "http://www.reuters.com/article/2015/10/12/us-hedgefunds-fortress-novogratz-idUSKCN0S629Y20151012", "country": "US", "title": "Investment firm Fortress to shutter its macro hedge fund", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Investment firm Fortress to shutter its macro hedge fund | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:24:00.000+03:00", "replies_count": 0, "uuid": "f65b28bce180d7483ef3b5d9bd887702f72c2ed7"}, "author": "Svea Herbst-Bayliss and Lawrence Delevingne", "url": "http://www.reuters.com/article/2015/10/12/us-hedgefunds-fortress-novogratz-idUSKCN0S629Y20151012", "ord_in_thread": 0, "title": "Investment firm Fortress to shutter its macro hedge fund", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BOSTON/NEW YORK Fortress Investment Group is planning to close its global macro hedge fund after suffering heavy losses and Michael Novogratz, the fund's portfolio manager, is expected to leave the hedge fund and private equity company, two people familiar with the matter said on Monday.\nThe news comes just three months after Fortress reshuffled the senior ranks at its macro fund, making Novogratz, 50, the sole chief investment officer.\nThe Fortress fund is the latest in a series of macro hedge funds - which bet on interest rates, currencies, commodities, fixed income and stocks - to shut down lately. Bain Capital and Armored Wolf also announced last week that they would be returning outside capital.\nFortress' stock price fell 5.3 percent to $5.15 in after hours trading on the news.\nThe fund started the year off with heavy losses after being wrong-footed on a bet on the Swiss franc and it has been unable to recover since, losing 17 percent this year through September, according to a regulatory filing.\nNovogratz did not immediately respond to an email sent to his business address. A spokesman for the company declined to comment.\nThe news was first reported by Bloomberg.\nThe fund, launched in 2002, had $2.3 billion in assets at the end of the second quarter, down from $8 billion in 2007, the year Fortress went public. Assets have been hovering between $3 billion and $4.2 billion since 2009, according to figures on Fortress' website. The latest figure does not include redemptions requests that investors had put in as performance suffered this year.\nFor months, the fund has been losing key staff amid fears they would be phased out, according to an investor source.\nNovogratz, a former college wrestler and Army helicopter pilot, is called \"Novo\" and cuts a colorful figure on Wall Street with his blunt market calls and sometimes salty language. Shortly after becoming the fund's sole portfolio manager, he told investors that conditions were as rich as he'd ever seen.\nAlthough he acknowledged that investors were unhappy with returns, he said in July that they were comfortable with the personnel changes and would likely not ask for more money back.\nIn July Jeff Feig, who had been co-chief investment officer of the macro fund, left the firm after less than one year there. In January chief risk officer Sherif Sweillam and portfolio manager Tye Schlegelmilch left the firm.\nStuart Bohart, the president of Fortress' liquid markets unit - which oversaw the macro fund - left earlier this year.\nThis year follows on the heels of a disappointing 2014 when the macro fund lost 1.6 percent while its peers gained 5.7 percent, according to the Hedge Fund Research. This year the average global macro fund is off 0.64 percent.\n(Reporting by Svea Herbst-Bayliss; Editing by Christian Plumb )", "external_links": [], "published": "2015-10-13T03:24:00.000+03:00", "crawled": "2015-10-13T02:35:38.988+03:00", "highlightTitle": ""}