{"organizations": [], "uuid": "32ddd587ae5eb08556369d4c099e692c8b116437", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sfgate.com", "main_image": "http://www.sfgate.com/img/pages/article/opengraph_default.png", "site_section": "http://sfgate.com//rss/feed/Business-and-Technology-News-448.php", "section_title": "Business and Technology News", "url": "http://www.sfgate.com/business/article/Twitter-expands-e-commerce-to-attract-more-6541204.php", "country": "US", "title": "Twitter expands e-commerce to attract more retailers", "performance_score": 0, "site": "sfgate.com", "participants_count": 1, "title_full": "Twitter expands e-commerce to attract more retailers - SFGate", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T19:43:00.000+03:00", "replies_count": 0, "uuid": "32ddd587ae5eb08556369d4c099e692c8b116437"}, "author": "sfgate.com", "url": "http://www.sfgate.com/business/article/Twitter-expands-e-commerce-to-attract-more-6541204.php", "ord_in_thread": 0, "title": "Twitter expands e-commerce to attract more retailers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Twitter Inc. is ready to throw open its e-commerce platform to millions of businesses to make it easier for users to buy while they tweet — just as the busy holiday shopping season nears.\nThe company has struck deals to integrate three major e-commerce service providers — Shopify Inc., Bigcommerce Inc. and Demandware Inc. — that retailers often use to help manage orders, said Nathan Hubbard , Twitter vice president of commerce. \nThe partnerships announced Wednesday, which build on the deal this month with payment provider Stripe Inc., will enable retailers large and small to place their wares on Twitter, after a test phase that lasted about a year and included just hundreds of clients, he said.\nTwitter, looking for ways to stoke growth while it searches for a full-time CEO, is betting on e-commerce as another tool to keep users engaged on the service and generate revenue. \nLast week, the social media company introduced user-generated polls and earlier this year it began a service for collecting political donations. During the second quarter, Twitter reported 316 million users, an increase of just 2.6 percent from the previous quarter, and a fraction of rival Facebook Inc.\n“Twitter’s now open for business,” Hubbard said. “We think that people are going to be able to buy things in the place where they spend the majority of their time on their phones, and that is in-app — and for us, that’s on Twitter.”\nDuring the test phase of the Buy Now feature, the company sold everything from Katy Perry ’s line of perfume to tickets to National Basketball Association games. During the earlier phase, the company worked with smaller platforms, and Twitter limited the number of participants. \nWith the service, users can buy products right from a tweet or browse a collection of items — without leaving Twitter. The feature is available to U.S. merchants for now.\n“We are executing and broadening what we’ve been working on,” Hubbard said. “This now enables merchants of all sizes to be able to sell direct to consumers on Twitter.”\nBrian Womack is a Bloomberg writer. E-mail: bwomack1@bloomberg.net .", "external_links": [], "published": "2015-09-30T19:43:00.000+03:00", "crawled": "2015-10-01T13:00:28.853+03:00", "highlightTitle": ""}