{"organizations": [], "uuid": "36d923d56767c8673ed88fba67f234225dd447e6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mb.com.ph", "main_image": "http://www.mb.com.ph/wp-content/themes/city-desk/images/fb-image_200x200.jpg", "site_section": "http://www.mb.com.ph/category/technews/technology-news/", "section_title": "mb.com.ph | Philippine News | Archive | Technology", "url": "http://www.mb.com.ph/globe-platinum-offers-new-mobile-experience-for-samsung-galaxy-note-5-s6-edge/", "country": "CA", "title": "Globe Platinum offers new mobile experience for Samsung Galaxy Note 5, S6 Edge+", "performance_score": 0, "site": "mb.com.ph", "participants_count": 1, "title_full": "Globe Platinum offers new mobile experience for Samsung Galaxy Note 5, S6 Edge+ | mb.com.ph | Philippine News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "36d923d56767c8673ed88fba67f234225dd447e6"}, "author": "October 12, 2015", "url": "http://www.mb.com.ph/globe-platinum-offers-new-mobile-experience-for-samsung-galaxy-note-5-s6-edge/", "ord_in_thread": 0, "title": "Globe Platinum offers new mobile experience for Samsung Galaxy Note 5, S6 Edge+", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "October 12, 2015 Globe Platinum, Globe Telecom’s premium postpaid brand, is set to give customers a premium experience when they avail of Samsung’s latest mobile marvels, the Galaxy Note 5 and Galaxy S6 Edge+, with the new Platinum Lifestyle Plans.\n“With the Platinum Lifestyle Plans, customers get access to superior and first-class servicing as well as enhanced lifestyle plan options that can’t be found anywhere else. The Platinum Lifestyle Plans are specifically designed to address customer needs and passions for a richer and more relevant digital mobile experience. Maximize the new Samsung Galaxy Note 5 or the S6 Edge+ and all its amazing features with the new Platinum Lifestyle Plans and start living the “Platinum lifestyle” today,” shares Globe Platinum director Kaisie del Carmen.\nThe Samsung Galaxy Note 5 or S6 Edge+ is available for free with Platinum Lifestyle Plans 3799, 4999, and 7999. These plans let users enjoy unlimited calls and texts to all networks, consumable roaming with unlimited data roaming service on the highest Platinum Lifestyle Plan, worry-free mobile data (up to 20GB every month), a built-in productivity pack for free use of Facebook, Viber, Gmail, Yahoo Mail and Evernote without using up one’s data allocation, and a choice of access to Spotify Premium, HOOQ or NBA that’s already built in the plan.\nAside from a wide variety of call, text, and data services included in the plan, the Platinum experience is made even more personal and exclusive with VIP privileges such as access to Personal Relationship Managers, priority in Globe stores, 24/7 Worldwide concierge and a dedicated Platinum hotline.\n“Globe Platinum is certainly setting the bar once again in providing its signature premium customer experience to complement the arrival of Samsung’s coveted mobile phones,” adds del Carmen.\nLauded as “the best big phone Samsung has ever made” and arguably the best-looking to date, the Note 5 has been receiving raves for its cutting-edge design aesthetic and power packed specs. The popular Samsung S6 Edge, on the other hand, gets a new incarnation and the “plus” treatment, with a significantly larger display, a bigger footprint and a bump up in specifications and features.", "external_links": ["http://i.po.st/static/v3/post-widget.js#publisherKey=4qcr4d26tnrf260rqrda&retina=true"], "published": "2015-10-12T03:00:00.000+03:00", "crawled": "2015-10-11T20:57:05.613+03:00", "highlightTitle": ""}