{"organizations": ["ISSA", "ISSA International", "Chicago Marriott", "ISSA International Conference", "CIA", "Google"], "uuid": "68c7e0d64a1135352716291577fc18d2691330be", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "globenewswire.com", "main_image": "", "site_section": "http://globenewswire.com//Rss/industry/9000/Technology", "section_title": "GlobeNewswire: Industry News on Technology", "url": "http://globenewswire.com/news-release/2015/10/02/773044/10151497/en/What-Google-the-CIA-and-ISSA-Have-in-Common.html?f=22&fvtc=3&fvtv=9000", "country": "US", "title": "What Google, the CIA, and ISSA Have in Common", "performance_score": 0, "site": "globenewswire.com", "participants_count": 0, "title_full": "What Google, the CIA, and ISSA Have in Common", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T14:02:00.000+03:00", "replies_count": 0, "uuid": "68c7e0d64a1135352716291577fc18d2691330be"}, "author": "", "url": "http://globenewswire.com/news-release/2015/10/02/773044/10151497/en/What-Google-the-CIA-and-ISSA-Have-in-Common.html?f=22&fvtc=3&fvtv=9000", "ord_in_thread": 0, "title": "What Google, the CIA, and ISSA Have in Common", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Dan Geer", "Vint Cerf"], "text": "What Google, the CIA, and ISSA Have in Common Vint Cerf, Dan Geer to Keynote 2015 ISSA International Conference, October 12-13, at Chicago Marriott Downtown October 02, 2015 07:02 ET | Source: ISSA International \nRESTON, Va., Oct. 2, 2015 (GLOBE NEWSWIRE) -- via PRWEB - Vinton G. Cerf, Vice President and Chief Internet Evangelist for Google and one of the \"Fathers of the Internet,\" will address the nation's cybersecurity professionals when he kicks off the annual Information Systems Security Association (ISSA) International Conference (#ISSAConf) to be held October 12-13, 2015 at the Chicago Marriott Downtown Magnificent Mile, Chicago, IL. Cerf will be followed on Tuesday by a keynote presentation from cybersecurity pioneer and icon Dan Geer, CISO of the CIA's In-Q-Tel arm. These prestigious information security leaders will share sobering insights on the future of security, speaking to the Conference theme: Advancing the Culture of Security. \nISSA will also deliver on its groundbreaking Cybersecurity Career Lifecycle™ (CSCL) program with its first CSCL Working Group Sessions. Based on the five stages of the career lifecycle, the sessions will enable professionals to steer their individual career paths with guidance and resources needed to achieve their long-term career goals. The CSCL is an industry-wide ISSA initiative that was developed to address the growing global cybersecurity workforce gap, now estimated by many to be somewhere between 1.5 million and 3 million skilled professionals. \nFor the conference, ISSA experts have identified and will showcase the most pressing issues in information security and career development that \"Advance the Culture of Security,\" including: Forensics, Malware, Breach Response and Incident Response IoT and Industrial Controls Systems (ICS) Application Security, Cloud Security, Physical Security and Mobile Platforms End User Security and Security Awareness Auditing, Risk Management and GRC Architecture, Big Data, Encryption and Remote Access Net Neutrality The Business Case for Information Security The Empowered and Highly Effective CISO Demetrios Lazarikos, CISO, vArmour Jeff Reich, Chief Security Officer, Barricade James Trainor, Jr., Assistant Director, Cyber Division, FBI Dave Ostertag, Global Investigations Manager, Verizon DBIR \nSecurity luminaries representing a broad range of industries will present, including Department of Homeland Security, S&T - Cyber Security Division; Purdue Healthcare Advisors; California State University Office of the Chancellor; Emblem Health, New York State Office of Information Technology Services; Texas.gov; Berkeley Research Group; University of Chicago Medical Center; Bechtel Corporation; Battelle; 2BSecure; TDAmeritrade, and more. \n\"Cybersecurity is vital to the national economy and security as well as to business success. Cybersecurity professionals are experiencing a culture shift in mapping to these business objectives while increasingly being put in the trenches of protecting strategic assets – with little peer or formal guidance. The ISSA is in a unique position to bring the industry together to solve these critical career issues and help a new generation of professionals grow both personally and professionally,\" said Stefano Zanero, Director, ISSA International and Chair, ISSA International Conference. \nIn addition, this year's new ISSA Cyber Defense Center will demonstrate live cyber attacks and defense strategies. \nPopular returning sessions include: the CISO Panel Discussion, Women in Security SIG, ISSA Chapter Leaders Summit, and the quarterly CISO Executive Forum that offers special CISO education opportunities. \nEvery year during the conference, ISSA honors the winners of the ISSA International Awards . These influential leaders have demonstrated a superior level of expertise, effectiveness, and dedication to the advancement of the cybersecurity profession. The 2015 winners are: Hall of Fame (Shon Harris - posthumously, Jeff Reich, Kevin Richards); Honor Roll (Alex Grohmann, Mark Williams, Dave Reed); Volunteers of the Year (David Vaughn, Jordan Lombard); President's Award for Public Service (Hacking Exposed: Stuart McClure, Joel Scambray, George Kurtz), Organization of the Year (Microsoft's Trustworthy Computing group); and Chapters of the Year (ISSA Phoenix Chapter and ISSA Puerto Rico Chapter). \nDownload Conference Guide: http://www.issa.org/resource/resmgr/2015_International_Conference/ConferenceGuide10_01_2015.pdf \nMedia Interviews and Registration: publicrelations(at)issa(dot)org \nAbout the ISSA \nThe Information Systems Security Association (ISSA)™ is the community of choice for international cybersecurity professionals dedicated to advancing individual growth, managing technology risk, and protecting critical information and infrastructure. ISSA members and award winners include many of the industry's notable luminaries and represents a broad range of industries - from communications, education, healthcare, manufacturing, financial and consulting to IT - as well as federal, state and local government departments and agencies. Through regional chapter meetings, conferences, networking events and content, members tap into a wealth of shared knowledge and expertise. Visit ISSA on the web at http://www.issa.org and follow us on Twitter at @ISSAINTL. \nThis article was originally distributed on PRWeb. For the original version including any supplementary images or video, visit http://www.prweb.com/releases/2015/10/prweb12999715.htm Kesselring Communications Leslie Kesselring +1 503-358-1012 Related Articles", "external_links": [], "published": "2015-10-02T14:02:00.000+03:00", "crawled": "2015-10-02T15:01:43.322+03:00", "highlightTitle": ""}