{"organizations": [], "uuid": "d348232d931d8def0b1b0c026422fa97efd1a913", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mdtmag.com", "main_image": "", "site_section": "http://www.mdtmag.com", "section_title": "Medical Design Technology | The Medical Design Engineer’s Resource for Products &amp; Technologies", "url": "http://www.mdtmag.com/news/2015/10/mini-kidney-organoids-re-create-disease-lab-dishes", "country": "US", "title": "Mini-Kidney Organoids Re-Create Disease in Lab Dishes", "performance_score": 0, "site": "mdtmag.com", "participants_count": 1, "title_full": "Mini-Kidney Organoids Re-Create Disease in Lab Dishes", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "d348232d931d8def0b1b0c026422fa97efd1a913"}, "author": "University of Washington Health Sciences/UW Medicine", "url": "http://www.mdtmag.com/news/2015/10/mini-kidney-organoids-re-create-disease-lab-dishes", "ord_in_thread": 0, "title": "Mini-Kidney Organoids Re-Create Disease in Lab Dishes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Mini-kidney organoids have now been grown in a laboratory by using genome editing to re-create human kidney disease in petri dishes.\nThe achievement, believed to be the first of its kind, resulted from combining stem cell biology with leading-edge gene-editing techniques.\nThe journal Nature Communications reports the findings today, Oct. 23. The work paves the way for personalized drug discovery for kidney disease.\nThe mini-kidney organoids were grown from pluripotent stem cells. These are human cells that have turned back the clock to a time when they could develop into any type of organ in the body. When treated with a chemical cocktail, these stem cells matured into structures that resemble miniature kidneys.\nThese organoids contain tubules, filtering cells and blood vessel cells. They transport chemicals and respond to toxic injury in ways that are similar to kidney tubules in people.\n\"A major unanswered question was whether we could re-create human kidney disease in a lab petri dish using this technology,\" said Benjamin Freedman, who led the studies at Brigham and Women's Hospital in Boston. He is now an assistant professor of medicine in the Division of Nephrology at the University of Washington and a UW Medicine researcher.\n\"Answering this question,\" he said, \"was important for understanding the potential of mini-kidneys for clinical kidney regeneration and drug discovery.\"\nTo re-create human disease, Freedman and his colleagues used the gene-editing technique called CRISPR. They engineered mini-kidneys with genetic changes linked to two common kidney diseases, polycystic kidney disease and glomerulonephritis.\nThe organoids developed characteristics of these diseases. Those with mutations in polycystic kidney disease genes formed balloon like, fluid filled sacks, called cysts, from kidney tubules. The organoids with mutations in podocalyxin, a gene linked to glomerulonephritis, lost connections between filtering cells.\n\"Mutation of a single gene results in changes kidney structures associated with human disease, thereby allowing better understand of the disease and serving as models to develop therapeutic agents to treat these diseases,\" explained Joseph Bonventre, senior author of the study. He is chief of the Renal Division at Brigham and Women's Hospital and a principal faculty member at Harvard Stem Cell Institute.\n\"These genetically engineered mini-kidneys,\" Freedman added, \"have taught us that human disease boils down to simple components that can be re-created in a petri dish. This provides us with faster, better ways to perform 'clinical trials in a dish' to test drugs and therapies that might work in humans.\"\nThe researchers found that genetically matched kidney organoids without disease-linked mutations showed no signs of either disease.\n\"CRISPR can be used to correct gene mutations,\" explained Freedman. \"Our findings suggest that gene correction using CRISPR may be a promising therapeutic strategy.\"\nIn the United States, costs for kidney disease are about 40 billion dollars per year. Kidney disease affects approximately 700 million people worldwide. Twelve million patients have polycystic kidney disease and two million gave complete kidney failure. Dialysis and kidney transplantation, the only options for patients in kidney failure, can cause harmful side effects and poor quality-of-life.\n\"As a result of this new technology,\" Freedman said, \"we can now grow, on demand, new kidney tissue that is 100 percent immunocompatible with an individual's own body.\"\nHe added, \"We have shown that these tissues can mimic both healthy and diseased kidneys, and that the organoids can survive in mice after being transplanted. The next question is whether the organoids can perform the functions of kidneys after transplantation.\"", "external_links": [], "published": "2015-10-23T03:00:00.000+03:00", "crawled": "2015-10-24T00:41:29.921+03:00", "highlightTitle": ""}