{"organizations": [], "uuid": "ad958851f529d7620019b0a5805062b4779734cf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1145320/sonus-and-dorado-deliver-orchestration-and-management-benefits-service-providers-migra", "country": "US", "title": "Sonus and Dorado Deliver Orchestration and Management Benefits to Service Providers Migrating to the Cloud", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "Sonus and Dorado Deliver Orchestration and Management Benefits to Service Providers Migrating to the Cloud", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T16:06:00.000+02:00", "replies_count": 0, "uuid": "ad958851f529d7620019b0a5805062b4779734cf"}, "author": "admin", "url": "http://www.freshnews.com/news/1145320/sonus-and-dorado-deliver-orchestration-and-management-benefits-service-providers-migra", "ord_in_thread": 0, "title": "Sonus and Dorado Deliver Orchestration and Management Benefits to Service Providers Migrating to the Cloud", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  Sonus Networks, Inc. \nWESTFORD, Mass. and EL DORADO HILLS, Calif., Oct. 26, 2015 /PRNewswire/ -- \nKey Takeaways: -- Sonus' Session Border Controller Software Edition (SBC SWe) and Dorado's Redcell product suite enable service providers to centrally manage, provision and automate the SBC SWe in virtual Cloud-based networks. -- Partnership benefits service providers by providing orchestration tools that extend across legacy and virtual network infrastructures. -- Sonus is the first SBC vendor to validate its solution with the Redcell platform and is the only fully featured software SBC available on the market. \nhttp://photos.prnewswire.com/prnvar/20150630/227189LOGO \nSonus Networks , Inc. (Nasdaq: SONS), a global leader in secure and intelligent Cloud communications , and Dorado Software , Inc., a global provider of resource, performance management and service orchestration solutions for service providers, announced today the integration of the SBC SWe with Dorado's Redcell, its integrated service orchestration, network management and closed-loop automation suite. Service providers can now centrally manage, activate and orchestrate Sonus' virtual SBC SWe through the Redcell portfolio. \nAs service providers embrace Software Defined Networking (SDN) and Network Functions Virtualization (NFV), it has created a converged network environment of legacy and virtual devices. The Redcell product suite provides a single, seamless management, automation and service orchestration layer that simplifies network management and accelerates service deployment in these networks. Redcell also manages OpenStack as a resource and utilizes its capabilities to bring virtual network functions (VNF) under full resource management. \nThe SBC SWe provides customers a virtual option that uses the same software as the award-winning SBC 5000 series and SBC 7000, delivering the same advanced feature functionality. The SBC SWe architecture allows customers a simple migration from today's appliance-based networks to NFV/Cloud solutions, permitting customers to cost-effectively scale their networks to meet the growing demand for secure, real-time voice and video traffic. \nQuotes: \n\"With the Dorado partnership, Sonus is able to expand its Cloud orchestration ecosystem,\" said John J. Grana, vice president, Business Development, Sonus. \"It is critical for service providers to operate and automate their networks to maximize value and improve service delivery. With Redcell, service providers can successfully extend visibility and management across legacy and virtual elements, which now include Sonus' virtual SBCs.\" \n\"Bringing Sonus into our partner ecosystem extends our value proposition for service providers, many of whom have deployed or are looking to deploy virtual SBCs in their network,\" said Chris Simon, vice president, Service Providers and NFV Business Unit, Dorado Software. \"Our shared commitment to open standards like ETSI NFV and OPNFV, and joint involvement with solutions such as Juniper Network's Contrail cloud platform, mean that service providers can deploy Sonus-Dorado solutions without fear of broader integration issues in the future.\" \nOther Fact: -- Sonus will continue to integrate its product portfolio into Redcell, expanding NFV choices for customers, including Diameter Signaling Controller (DSC) and VellOS, formerly branded under the name NaaS IQ. \nTags/Keywords: \nSonus, SONS, Dorado, Redcell, session border controller, SBC, Cloud, network functions virtualization, NFV, software defined networking, SDN, SWe, service orchestration, OpenStack, VNF, MANO, VNFM, NFVO, OPNFV \nAbout Sonus: \nSonus brings the next generation of Cloud-based SIP and 4G/VoLTE solutions to its customers by enabling and securing mission critical traffic for VoIP, video, IM and online collaboration. With Sonus, enterprises can intelligently secure and prioritize real-time communications, while service providers can deliver reliable, secure real-time services for mobile, UC and social applications. Sonus offers an award-winning portfolio of hardware-based and virtualized Session Border Controllers (SBCs), Diameter Signaling Controllers (DSCs), Cloud Exchange Networking Platform, Policy/Routing servers and media/signaling gateways. Visit www.sonus.net or call 1-855-GO-SONUS. \nAbout Dorado: \nDorado Software, Inc. is a leading provider of integrated Resource Management, Performance Monitoring and Service Orchestration software that helps communications service providers, NFV Infrastructure and network function vendors accelerate their time to benefits of their virtualized cloud-based networks. Dorado provides an integrated end-to-end solution with packaged and extensible capabilities to orchestrate, monitor and provide closed loop automation of both physical and virtual network functions in a multi-vendor and evolving ecosystem. Ultimately, Dorado lets communication service providers manage end-to-end network services across hybrid virtual and physical networks and realize their critical NFV objectives, now and in the future. For more information about Dorado Software, visit http://www.doradosoftware.com or send an email to info@doradosoftware.com . \nDorado and Redcell are trademarks of Dorado Software, Inc. All other trademarks are the property of their respective owners. \nImportant Information Regarding Forward-Looking Statements: \nThe information in this release contains forward-looking statements regarding future events that involve risks and uncertainties. All statements other than statements of historical facts contained in this release are forward-looking statements. Our actual results may differ materially from those contemplated by the forward-looking statements. For further information regarding risks and uncertainties associated with Sonus' business, please refer to the \"Risk Factors\" section of Sonus' most recent annual or quarterly report filed with the SEC. Any forward-looking statements represent Sonus' views only as of the date on which such statement is made and should not be relied upon as representing Sonus' views as of any subsequent date. While Sonus may elect to update forward-looking statements at some point, Sonus specifically disclaims any obligation to do so. \nContacts:", "external_links": [], "published": "2015-10-26T16:06:00.000+02:00", "crawled": "2015-10-26T17:42:59.352+02:00", "highlightTitle": ""}