{"organizations": [], "uuid": "4a4a2eee7c881b3644ca0b1d83f9627705d2304d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thestar.com", "main_image": "http://www.thestar.com/content/dam/thestar/sports/bluejays/2015/09/30/toronto-blue-jays-fans-countdown-to-al-east-title/jays-fans.jpg", "site_section": "http://www.thestar.com/life/technology.html", "section_title": "Technology | Gadgets, Tech Toys &amp; Trends | Toronto Star", "url": "http://www.thestar.com/sports/bluejays/2015/09/30/toronto-blue-jays-fans-countdown-to-al-east-title.html", "country": "CA", "title": "Toronto Blue Jays fans countdown to AL East title", "performance_score": 0, "site": "thestar.com", "participants_count": 1, "title_full": "Toronto Blue Jays fans countdown to AL East title | Toronto Star", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "4a4a2eee7c881b3644ca0b1d83f9627705d2304d"}, "author": "Robin Levinson King", "url": "http://www.thestar.com/sports/bluejays/2015/09/30/toronto-blue-jays-fans-countdown-to-al-east-title.html", "ord_in_thread": 0, "title": "Toronto Blue Jays fans countdown to AL East title", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "An hour before 5 o’clock and office workers in khakis and button downs were already rolling up their shirtsleeves and hunkering down for what might be the game that gives the Toronto Blue Jays their first American League East title in 22 years.\nLuke Thorn’s train got delayed so he and his colleagues are watching the game at the Real Sports Bar instead of from the comfort of their own homes.\n“I guess it’s just something that we grew up with, our family, our dads passed it down,” he said.\nExpectations remain high.\n“This games over. It was over before it started,” Thorn said.\nOne unlucky woman found herself in enemy territory. Gillian Budd, a Baltimore native, is a lifelong Orioles fan but in Toronto for business.\n\"I like a good competition,\" she said. \"It's a little more blue than I would prefer, I'd like to see more orange.\"\nShe warns Jays fans not to count their chickens before they're hatched. The Orioles could give them a run for their money.\n\"They're a team that likes to show up at the game,\" she said.\nMarcus Stroman was characteristically enthusiastic on Twitter on Wednesday, posting “GAMEDAY!” for his 100,000 Twitter followers.\nStroman shone last Wednesday in pitching seven shutout innings in a 4-0 win over the Yankees. Dickey allowed just four hits in seven innings while beating the Tampa Bay Rays on Friday.\nThe Jays’ game against the Orioles on Tuesday night was postponed because of rain, setting up the Wednesday double-header.\nAs fans awaited Wednesday’s games, the Blue Jays magic number to secure the American League East title dropped to one game.\nThat means any combination of Jays’ wins and Yankee losses adding up to one clinches the title for the Jays.\nThe Jays also have a shot at being the top seed in the American League, which would give them a home-field advantage throughout the playoffs.\nThe Jays have three games left against Baltimore and three against the Tampa Bay Rays.\nJays’ ace pitcher David Price (18-5, 2.45) is scheduled to be the starting pitcher on Thursday in his final start of the regular season.\nThe Orioles were officially eliminated from the playoffs on Tuesday. It’s a hard fall for Baltimore, who won 96 games last year and won the American League East championship. They must now win their final six games just to have a winning season.\nFor the Jays, injured shortstop Troy Tulowitzki appears close to returning to the roster after colliding with centre fielder Kevin Pillar on Sept. 12.\nTulowitzki took live batting practice on Tuesday.\nThe Jays were 30-8 when Tulowitzki played and 9-5 since his injury.\nMore on thestar.com\nNASCAR’s Tony Stewart announces retirement from Sprint Cup racing\nNFL: Ravens vs. Steelers ain’t what it used to be", "external_links": ["http://torontostar.stats.com/shs.css", "http://hosted.stats.com/config/multidefault.css", "http://hosted.stats.com/config/shsdefault.css", "http://torontostar.stats.com/multisport/today-byteam.js.asp?sport=mlb&type=mast&team=14&lang=en", "http://static.freeskreen.com/publisher/52/freeskreen.min.js", "http://embed.scribblelive.com/Embed/v7.aspx?Id=1531649&ThemeId=16875", "http://torontostar.stats.com/multi.css"], "published": "2015-09-30T03:00:00.000+03:00", "crawled": "2015-10-01T00:31:05.346+03:00", "highlightTitle": ""}