{"organizations": [], "uuid": "31d40b59caed6f53da73fbc9954aa1f73d2f0d3e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266385/technology-general", "section_title": "Technology Press Releases from PRWeb - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30225307/purify-blocker-captures-strong-sales-and-user-excitement", "country": "US", "title": "Purify Blocker Captures Strong Sales and User Excitement", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Purify Blocker Captures Strong Sales and User Excitement - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T19:02:00.000+03:00", "replies_count": 0, "uuid": "31d40b59caed6f53da73fbc9954aa1f73d2f0d3e"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30225307/purify-blocker-captures-strong-sales-and-user-excitement", "ord_in_thread": 0, "title": "Purify Blocker Captures Strong Sales and User Excitement", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Highly ranked, simple to use app saves time and money for iPhone® and iPad® users by blocking intrusive content and tracking by advertisers\nColorado Springs, Colo. (PRWEB) October 09, 2015\nPurify Blocker , the fastest ad and tracking blocker for Safari on iOS 9, announced strong sales, ranking as a top paid app on the Apple App Store (SM). Once installed, the popular ad blocker blocks all ads and tracking on Apple’s Safari web browsing app. Purify Blocker was released to the public as a paid app on September 16, 2015 and has topped the Productivity charts ever since.\nSaves time and money\nThe easy to install, simple to use app was designed to allow iPhone and iPad users with iOS 9 to Browse in Peace. Once installed, the Purify Blocker stops unwanted advertisements and all tracking from being downloaded to the user’s device. Web pages load 4x faster on average, allowing users to enjoy browsing at lightning-fast speeds.\nPurify Blocker not only saves users time, it also saves them money. Users routinely see their web browsing data usage cut in half—allowing them to double their browsing without incurring expensive data overages.\nExtends battery life, easy to use\nBattery life is also extended with Purify. Because unwanted and power-hungry content is automatically blocked, the typical battery life of a device is prolonged by approximately 21 percent — as measured by The New York Times .\n“Purify does all the hard work behind the scenes. You get a simple, painless interface that puts you in control with unprecedented ease—right out of the box,” explained Chris Aljoudi, Purify’s lead developer. “Purify is a breeze to install; we even provide a brief tutorial to guide you through every step of the process.”\nCustomizable, feature-rich\nPurify is also easy to customize, allowing you to “whitelist” any website with a quick, effortless tap without interrupting your browsing. On whitelisted websites, Purify won’t filter content, allowing the user to enjoy complete control over website ads.\nAdditional features include easy options to block social share button, scripts, custom fonts, and more. Purify has been rolling out innovative features, with multiple upgrades in the three weeks since the Sep. 16 release.\n“Purify has phenomenal momentum that is driving its innovation forward quickly,” explained Aljoudi. “We’re well on our way to the next generation of iOS blockers.”\nAlong with strong sales, Purify also enjoys excellent reviews. “We’ve received an average of four and a half stars on the Apple App Store from hundreds of user ratings,” continued Aljoudi. “Professional reviewers and editors from leading publications such as The New York Times and CIO.com have also ranked us high—they love the Purify Blocker’s effectiveness, thoughtful design and ease of use.”\nPurify Blocker is currently priced at $0.99 and is available from the Apple App Store. https://appsto.re/us/R-Uz9.i\nAbout Purify\nLaunched on September 16, 2015, Purify Blocker is the fastest ad and tracking blocker for people using iOS 9 devices and Safari to browse the web. The highly ranked, simple to use app saves iPhone® and iPad® users time and money by blocking intrusive content and tracking by advertisers. Purify Blocker’s development is led by Chris Aljoudi and is based in Colorado Springs, Colo. Follow us on Twitter .\nAll trademarks are the property of their respective owner. and ® denote registered trademarks in the United States and other countries.\n //www.prweb.com/releases/PurifyBlocker/StrongSales/prweb13013232.htm\n ", "external_links": ["http://www.prweb.com/releases/PurifyBlocker/StrongSales/prweb13013232.htm", "http://www.cio.com/article/2984277/ios/ios-9-how-to-use-the-purify-ad-blocker.html", "https://appsto.re/us/R-Uz9.i", "http://www.nytimes.com/2015/10/01/technology/personaltech/ad-blockers-mobile-iphone-browsers.html?_r=1", "https://twitter.com/purify_app", "https://www.purify-app.com/"], "published": "2015-10-09T19:02:00.000+03:00", "crawled": "2015-10-11T11:33:30.149+03:00", "highlightTitle": ""}