{"organizations": [], "uuid": "36e150c150c4a9afa19572290a0abe141317cb9d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266385/technology-general", "section_title": "Technology Press Releases from PRWeb - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30248389/offsite-vision-launches-emergenz-evacuation-helps-emergency-responders-access-critical-real-time-location-data", "country": "US", "title": "OffSite Vision Launches EmergenZ Evacuation; Helps Emergency Responders Access Critical Real-time Location Data", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "OffSite Vision Launches EmergenZ Evacuation; Helps Emergency Responders Access Critical Real-time Location Data - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T18:02:00.000+03:00", "replies_count": 0, "uuid": "36e150c150c4a9afa19572290a0abe141317cb9d"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30248389/offsite-vision-launches-emergenz-evacuation-helps-emergency-responders-access-critical-real-time-location-data", "ord_in_thread": 0, "title": "OffSite Vision Launches EmergenZ Evacuation; Helps Emergency Responders Access Critical Real-time Location Data", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Leading New Jersey-based security & safety specialists helps emergency responders save lives by providing situational awareness needed to mitigate exposure during emergency events\nRed Bank, NJ\nOffSite Vision Holdings, Inc. (OSVH), specialists in real-time security and safety solutions, today announced the launch of EmergenZ Evacuation , a new product that allows emergency responders and security personnel the ability to account for people during evacuation events by knowing who is left in the building and their location. EmergenZ Evacuation allows responders to access real-time location data 24/7 that is never static. Responders can quickly identify and account for everyone that has exited the facility by reviewing real-time reports for every designated entrance/exit location. It continues to provide emergency data in the event of a power outage. The EmergenZ Evacuation solution is a critical piece of the puzzle to gain more effective situational awareness in any crisis situation.\nThis cost-effective solution is part of the EmergenZ real-time security and safety solutions product suite, which provides the vital information that first stand emergency response teams and security personnel need to gain immediate and accurate data to identify, respond and mitigate the situation quickly and effectively.\n“We are very excited to be launching EmergenZ Evacuation to help facilities throughout the world prepare for an emergency situation. Unfortunately, with the increase in workplace violence and active shooter incidents over the last few years, facilities need to be prepared now more than ever in the event of an emergency situation. The key to saving lives is being prepared,” states William Lenahan, OSVH’s CEO.\nOSVH is committed to delivering real-time security solutions that enhance effective decision-making during complex emergency and security events by connecting technology, people, and data. For further information on EmergenZ Evacuation go to http://www.offsitevision.com.\nAbout OffSite Vision Holdings, Inc.\nFounded in 2013, OffSite Vision Holdings, Inc. (OSVH) offers real-time security and safety solutions for organizations looking to protect their employees, assets and intellectual properties. With a focus on data collection and analytics, OSVH has developed a unique platform that offers first-of-their-kind solutions for crucial, perennial security issues. OSVH clients span many vertical markets, including commercial enterprises, federal and state governments, utilities, pharmaceutical, and schools. OSVH helps companies and emergency responders “see what cannot be seen” and quickly identifies a situation for quick response and mitigation. With 24/7 situational awareness capabilities in place, lives can be saved by being prepared.\nThe OSVH executive team has been in the security industry for over 30 years and brings a wealth of knowledge gained by delivering open and scalable B2B mission-critical security and safety solutions to organizations around the world. With this leadership in place, the company is the first to offer a live monitoring and tracking solution that can feed directly into a customer’s current VMS and access control systems.\nOSVH offers optimized technologies for dynamic IoT cloud-based environments including mobile and wireless communications, web-based data delivery services, cutting-edge sensor and RFID technologies, location intelligence, GPS, and video surveillance. Flagship products include EmergenZ Evacuation & Response Solutions, EmergenZ Asset Secure and EmergenZ Outdoor Secure. All solutions provide cloud-based, highly scalable security options that identify the location of people and high-value assets, from anywhere at any time. For further information on OSVH, please visit http://www.offsitevision.com\nPR Contact:\nMonique Merhige, President\nInfusion Direct Marketing & Advertising, Inc.\nPhone: 631-846-1558\nEmail: monique(at)infusiondirect(dot)com\n //www.prweb.com/releases/2015/10/prweb13014806.htm\n ", "external_links": ["http://offsitevision.com/emergenz-evac/", "http://www.prweb.com/releases/2015/10/prweb13014806.htm"], "published": "2015-10-13T18:02:00.000+03:00", "crawled": "2015-10-15T14:06:45.139+03:00", "highlightTitle": ""}