{"organizations": [], "uuid": "e45ee54dcb433387f92952b43fd3a026942c75ea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wcax.com", "main_image": "http://images.worldnow.com/AP/images/9049257_G.jpg", "site_section": "http://www.wcax.com/category/13536/technology-news", "section_title": "Technology &amp; Science News - WCAX.COM Local Vermont News, Weather and Sports-", "url": "http://www.wcax.com/story/30295641/google-to-give-away-software-to-microsoft-office-defectors", "country": "US", "title": "Google to give away software to Microsoft Office defectors", "performance_score": 0, "site": "wcax.com", "participants_count": 1, "title_full": "Google to give away software to Microsoft Office defectors - WCAX.COM Local Vermont News, Weather and Sports-", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "e45ee54dcb433387f92952b43fd3a026942c75ea"}, "author": "wcax.com", "url": "http://www.wcax.com/story/30295641/google-to-give-away-software-to-microsoft-office-defectors", "ord_in_thread": 0, "title": "Google to give away software to Microsoft Office defectors", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By MICHAEL LIEDTKE\nAP Technology Writer SAN FRANCISCO (AP) - Google is escalating an attack on Microsoft's lucrative Office software in an attempt to hit its longtime rival where it will hurt the most.\nThe assault is targeting companies and government agencies paying for Microsoft's suite of word processing, email, calendar, spreadsheet and other Office programs. If they dump Microsoft, Google will give them free use of a package of its competing software that normally costs $5 or $10 per user each month.\nThe price for the \"Google for Work\" software will be waived for the duration of the defecting customers' existing contracts with Microsoft or any other supplier. The offer is open for the next six months in the U.S. and will eventually be extended to other countries.\nGoogle is limiting the free usage to 3,000 people per defecting customer. Even with that restriction, Google will be foregoing $180,000 to $360,000 in annual revenue if a company with 3,000 people signs up for the offer. As an additional incentive, Google will pay up to $75,000 to each company switching to its software to cover the costs of making the change.\nGoogle, now owned by a newly formed company called Alphabet Inc., declined to say how much it has budgeted for its latest assault on Microsoft Corp. Google says more than 600 companies have at least 10,000 employees using Work software.\nThe offer underscores Google's confidence in the quality of its software and its resolve to undercut one of Microsoft's most valuable franchises, said Aragon Research analyst Jim Lundy said. He estimated Microsoft's current customers are paying $12 to $20 per user under contracts that typically run for several years.\nMicrosoft's Office division generated $23.5 billion, or roughly one-quarter of the software maker's revenue during its last fiscal year ending in June. The revenue includes sales of Office to consumers, too.\nDigital advertising still accounts for nearly all of Google's revenue, which totaled $66 billion last year. But the Mountain View, California, company has diverting some of the money it makes from advertising to chip away at Microsoft's dominance in office software since it introduced a suite of competing programs nearly a decade ago.\nAt that time, Google was trying a different approach by requiring an Internet connection to use its software instead of installing the programs on the hard drives of individual programs. Now, Microsoft and most other software makers sell subscriptions that allow online access to their programs so they can be opened on personal computers, tablets and smartphones.\nMicrosoft, which is based in Redmond, Washington, also has been trying to chip away at Google's dominance in Internet search and advertising for the past decade, with little success.\nGoogle's new business software offer \"represents a continuing saga in the battle with Microsoft for control of the desktop and mobile devices,\" Lundy said.\n ", "external_links": [], "published": "2015-10-19T03:00:00.000+03:00", "crawled": "2015-10-20T17:33:38.208+03:00", "highlightTitle": ""}