{"organizations": [], "uuid": "4f2625b39cc8bd20e970c0c41a0ea8e50831a4b4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prnewswire.com", "main_image": "https://photos.prnewswire.com/prnvar/20151014/276695LOGO", "site_section": "http://rss.prnewswire.com/industry/technology/", "section_title": "PR Newswire: Business Technology", "url": "http://www.prnewswire.com/news-releases/imvu-launches-3d-stickers-new-and-innovative-messaging-feature-300159375.html", "country": "IT", "title": "IMVU Launches 3D Stickers, New and Innovative Messaging Fea", "performance_score": 0, "site": "prnewswire.com", "participants_count": 1, "title_full": "IMVU Launches 3D Stickers, New and Innovative Messaging Fea", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T16:24:00.000+03:00", "replies_count": 0, "uuid": "4f2625b39cc8bd20e970c0c41a0ea8e50831a4b4"}, "author": "IMVU", "url": "http://www.prnewswire.com/news-releases/imvu-launches-3d-stickers-new-and-innovative-messaging-feature-300159375.html", "ord_in_thread": 0, "title": "IMVU Launches 3D Stickers, New and Innovative Messaging Fea", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MOUNTAIN VIEW, Calif. , Oct. 14, 2015 /PRNewswire/ -- IMVU , the leading avatar-based social network, now offers users an even richer and more expressive messaging experience with the launch of  3D Stickers . A game changer in the messenger category, 3D Stickers take traditional emojis to the next level by enabling users' own fully customized avatars to perform popular actions and emotions (as .gifs). The stickers add an entirely new dimension of emotion to messaging by bringing users' conversations to life. As a result, users are able to connect on a deeper level with people from anywhere in the world. Text-based messaging has evolved into its own language as a simple, fast, and efficient method of communication.  However, limited intent, tone, and emotion suggest some meaning is lost on the recipient, even with added emphasis using static or animated emojis. With the launch of 3D Stickers, IMVU has set out to give its millions of users a free and easy way to embed themselves in their own personalized .gifs to express what they are stating in a fun and visual manner. On top of basic messaging functionality, the new feature has a simple and intuitive user interface.  Within IMVU's Messaging function, a user has the ability to text their friends, add one of today's 20+ different emotion icons, and bring their avatar and conversation to life.\n\" IMVU avatars are the vehicle for users to uniquely express themselves to make emotional connections,\" says Stewart Bonn , SVP of Product, IMVU. \"Now with 3D Stickers, users can communicate with friends in a new way that uses their personalized avatar to express what they're saying visually.\"\nIMVU's 3D Stickers are now available on IMVU Next and IMVU Mobile ( iOS and Android ). For more information about 3D Stickers, visit the IMVU website .\nAbout IMVU\nIMVU , the #1 avatar-based social network welcomes users to join a never-ending world where anything is possible, including connecting with people from all over the world. It's here that the fun is infinite and reality is limitless. The IMVU Virtual Shop is the largest of its kind, with an inventory of more than 20 million user-generated, VR-ready goods and growing everyday. From collections that include the hottest trends and throwback sneakers to fairy wings and couture gowns, the marketplace allows our users to personalize, customize and stylize their 3D avatars and environments to their hearts' content. With over three million unique users every month, our platform is poised for future growth and available on desktop, tablet and mobile devices.\nFounded in 2004 and based in the heart of Silicon Valley, IMVU is led by a team that's dedicated to pioneering the virtual reality industry. IMVU is backed by venture investors Menlo Ventures, Allegis Capital, Bridgescale Partners and Best Buy Capital.\nContact: Lindsay Anne Aamodt , laamodt@imvu.com \n \nLogo - http://photos.prnewswire.com/prnh/20151014/276695LOGO \nPhoto - http://photos.prnewswire.com/prnh/20151014/276694 \nPhoto - http://photos.prnewswire.com/prnh/20151014/276693 \n \n\nSOURCE IMVU\n\n\nRELATED LINKS\nhttp://im.vu/next", "external_links": [], "published": "2015-10-14T16:24:00.000+03:00", "crawled": "2015-10-14T16:40:44.588+03:00", "highlightTitle": ""}