{"organizations": [], "uuid": "4a5a07ff6dbc9b3b627cb7f1653a050b78b43167", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.deccanherald.com", "main_image": "http://www.deccanherald.com/page_images/original/2015/10/13/506174.jpg", "site_section": "http://www.deccanherald.com/", "section_title": "Deccan Herald: Latest News, Nation, World, Business, Technology, Karnataka News &amp; Headlines", "url": "http://www.deccanherald.com/content/506174/led-sahgal-indian-writers-protest.html", "country": "US", "title": "Led by Sahgal, Indian writers protest intolerance", "performance_score": 0, "site": "deccanherald.com", "participants_count": 1, "title_full": "Led by Sahgal, Indian writers protest intolerance", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "4a5a07ff6dbc9b3b627cb7f1653a050b78b43167"}, "author": "New Delhi", "url": "http://www.deccanherald.com/content/506174/led-sahgal-indian-writers-protest.html", "ord_in_thread": 0, "title": "Led by Sahgal, Indian writers protest intolerance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Led by Sahgal, Indian writers protest intolerance New Delhi, Oct 13, 2015 (IANS) Public lynching over a slab of meat, cold blooded murders of writers, rationalists and a wave of crimes of intolerance has led well-known Indian writers and winners of the prestigious Sahitya Akademi award, to innovatively script their dissent.\nTheir protest is against what they call the growing intolerance within the country and the muted response of the establishment, including the Akademi, to the series of hate crimes.\nNoted writer Nayantara Sahgal's decision last week to return her Sahitya Akademi award over the public lynching in Dadri last month and the murder of rationalists in Maharashtra and Karnataka has triggered a wave of similar reactions from other awardees across the country.\nSahgal, a 1986 Sahitya Akademi awardee, said she was disturbed at the lynching of Mohammad Akhlaq,52, by a public mob at Dadri last month, after accusing him of storing beef at his home and the murder of rationalists like Narendra Dabolkar, Govind Pansare and Kannadiga writer M.M. Kalburgi over the last couple of years.\n\"I have decided to return the award as I felt that it's time to speak up. I am disturbed at the Dadri killing and the killing of rationalists,\" Sahgal told IANS, adding that she was upset over Prime Minister Narendra Modi's silence on the issue.\nSince her renouncement, nearly two dozen winners of the Sahitya Akademi award have emulated Sahgal, a niece of India' first prime minister, Jawaharlal Nehru.\nIn Modi's home state of Gujarat, poet writer Anil Joshi joined another Vadodara-based writer Ganesh Devy, in returning his award.\n\"There is no breathing space and no freedom of expression for literary writers. It is like losing oxygen because we are writers who wish for free breathing space. I do not need an oxygen cylinder in the form of awards to live. The attack on the brood of literarians is unfortunate and has taken away the freedom of expression,\" Joshi said in a statement.\nIn Punjab, as many as seven writers and poets Surjit Patar, Jaswinder Singh, Baldev Singh Sadaknama Darshan Bhuttar, Ajmer Singh Aulakh, Atamjit Singh, Gurbachan Bhullar and Canada-based writer Waryam Sandhu also gave up their respective awards, which were instituted in 1955.\nIn the southern state of Kerala too, poet Satchidanandan, writers P.K. Parakkadavu and K.S. Ravikumar quit all posts in the Akademi over Kalburgi's killing, while Malayalam writer Sara Joseph, who also returned the award, said that India was passing through a phase \"worse than the black days of the (1975-77) emergency\".\n\"There is a fear that has engulfed in what one eats, when one expresses love, and there is some sort of curb on what one wants to write and speak. This does not augur wella Our prime minister is a frequent flyer and gives big speeches on his trips abroad. The sad thing is that while he was away a man was beaten to death because he ate beef,\" Joseph said, referring to the Dadri lynching.\nIn New Delhi, former head of the Lalit Kala Akademi Ashok Vajpayi also returned his award, in Kashmir poet-writer Ghulam Nabi Khayal also followed suit, while in Bengaluru, well known author Shashi Deshpande has resigned from the Sahitya Akademi general council.\nIn Goa too, over 30 winners of the Award are expected to deliberate on Wednesday over the issue of mass renunciation.\nAkademi president V.P. Tiwari, who has been criticised by the writer fraternity for his silence, insists that the situation is unprecedented.\n\"We are facing an unprecedented situation. At present, we do not know how to respond to those wanting to give back their awards,\" Tiwari said, adding that a meeting of the Akademi's council would be held on October 23 to discuss the issue.\nAdding to the fire, as it were, Culture Minister Mahesh Sharma, who is emerging as the\ngovernment's stormy petrel, told the Indian Express on Monday: \"This is an award given by writers to writers. It has nothing to do with the government. It is their personal choice to return it...we accept it.\"\nOne thing is for sure: this is an issue that is unlikely to die down soon.", "external_links": ["http://web.ventunotech.com/plugins/cntplayer/ventuno_editorial_player.js"], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-13T16:42:23.723+03:00", "highlightTitle": ""}