{"organizations": [], "uuid": "f71cc0bb4dff5968fbacb762de7bfbc13363ec55", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "phys.org", "main_image": "http://cdn.phys.org/newman/gfx/news/hires/2015/ancientalgak.png", "site_section": "http://www.physorg.com/rss/physorg-appl.xml", "section_title": "Phys.org - latest science and technology news stories", "url": "http://phys.org/news/2015-10-ancestors-wired-shore.html", "country": "US", "title": "Ancestors of land plants were wired to make the leap to shore", "performance_score": 0, "site": "phys.org", "participants_count": 0, "title_full": "Ancestors of land plants were wired to make the leap to shore", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T22:00:00.000+03:00", "replies_count": 0, "uuid": "f71cc0bb4dff5968fbacb762de7bfbc13363ec55"}, "author": "", "url": "http://phys.org/news/2015-10-ancestors-wired-shore.html", "ord_in_thread": 0, "title": "Ancestors of land plants were wired to make the leap to shore", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Terry Devitt Closterium", "Michael Melkonian"], "text": "Ancestors of land plants were wired to make the leap to shore October 5, 2015 by Terry Devitt Closterium strigosum is one of the green algae the scientists analyzed. Credit: Michael Melkonian \nWhen the algal ancestor of modern land plants first succeeded in making the transition from aquatic environments to an inhospitable shore 450 million years ago, it changed the world by dramatically altering climate and setting the stage for the vast array of terrestrial life. \nBut the genetic and developmental innovations plants used to make the leap to land have been enduring secrets of nature. Now, an international team of researchers, writing this week (Oct. 5, 2015) in the Proceedings of the National Academy of Sciences ( PNAS ), reveals that the aquatic algae from which terrestrial plant life first arose were genetically pre-adapted to form the symbiotic relationships with microorganisms that most land plants need to acquire nutrients from the soil. \nThe finding is important because it begins to flesh out the story of how the first land plants evolved from freshwater algae, formed critical symbiotic partnerships with microorganisms like fungi and bacteria, and made the world's land masses habitable. What's more, understanding the genetic pathways involved could ultimately help agronomists unlock similar genes that are likely conserved in plants such as cereals and the green algae that is the most promising biofuel stock but that now require substantial amounts of chemical fertilizer. \n\"We were expecting that these mechanisms arose with land plants,\" explains Jean-Michel Ane, a University of Wisconsin-Madison professor of bacteriology and agronomy and the senior author of the PNAS report. \"The surprise was finding in algae the mechanisms we know allow plants to interact with symbiotic fungi.\" \nThe discovery shows for the first time that the algae already knew how to interact with beneficial microbes while it was still in the water, observes Pierre-Marc Delaux, who conducted the research as a postdoctoral fellow at UW-Madison and is now at the John Innes Centre in the U.K. \"Without the development of this pre-adapted capability in algae, the Earth would be a very different place today,\" says Delaux. \nMany extant plant species depend on symbiotic relationships with microorganisms to thrive. The most famous are legumes and their beneficial association with nitrogen-fixing bacteria. But many other plant species, notes Ane, depend on relationships with fungi to chemically convert minerals in soil to forms that benefit the plant. \nThe efficient acquisition of mineral nutrients, says Ane, was likely one of the primary challenges for the earliest land plants. \n\"The association between plants, algae and fungi probably played a really important role in the ability of plants to colonize land,\" according to the Wisconsin researcher. \"In fact, many of us think early plants were able to colonize lands because they evolved the ability to associate with beneficial fungi.\" \nThe genes required to abet symbiosis between plants and microbes likely arose in a common ancestor of green algae and land plants, says Ane. \nPrior to the new study, little was know about the associations between algae and fungi. The genetic pathways plants use to form a symbiosis with fungi were known in land plants called liverworts and hornworts, ancient lineages sister to all other land plant lineages. Liverworts thrive in damp environments worldwide and the oldest known liverwort fossils provide the earliest evidence of plants colonizing land. \n\"We had found these mechanisms in liverworts, but not algae previously,\" explains Ane. \nAnd while microorganisms had been found before in association with algae, they were believed to be pathogens, not symbionts. \"Nobody had studied associations in these freshwater algae. We think some of these associations may be beneficial.\" \nGenetic features in plants, animals and microbes tend to be preserved and repurposed through evolutionary history. Discovering these pathways allowing associations with beneficial microbes in green algae and in cereals, which now require significant amounts of chemical fertilizer, could enable the engineering in plants of more efficient nutrient acquisition—significantly reducing the need for chemical fertilizers for food and bioenergy production.", "external_links": [], "published": "2015-10-05T22:00:00.000+03:00", "crawled": "2015-10-05T22:14:44.346+03:00", "highlightTitle": ""}