{"organizations": [], "uuid": "e6ba452b495c19ee1616c6c8a0a3ca5772732cfc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ghacks.net", "main_image": "http://cdn.ghacks.net/wp-content/uploads/2015/10/google-voice-search.jpg", "site_section": "http://feeds.feedburner.com/Ghacksnet", "section_title": "gHacks Technology News", "url": "http://www.ghacks.net/2015/10/18/say-goodbye-to-native-ok-google-voice-integration-in-chrome-on-the-desktop/", "country": "US", "title": "Say Goodbye to native “OK Google” voice integration in Chrome on the desktop", "performance_score": 0, "site": "ghacks.net", "participants_count": 1, "title_full": "Say Goodbye to native “OK Google” voice integration in Chrome on the desktop", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T09:15:00.000+03:00", "replies_count": 0, "uuid": "e6ba452b495c19ee1616c6c8a0a3ca5772732cfc"}, "author": "Martin Brinkmann", "url": "http://www.ghacks.net/2015/10/18/say-goodbye-to-native-ok-google-voice-integration-in-chrome-on-the-desktop/", "ord_in_thread": 0, "title": "Say Goodbye to native “OK Google” voice integration in Chrome on the desktop", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Say Goodbye to native “OK Google” voice integration in Chrome on the desktop By Martin Brinkmann on October 18, 2015 in Google Chrome - Last Update: October 18, 2015 0 \nTalking to Google while using Chrome on the desktop has become a tad harder in Chrome 46 as the company has removed the native integration of its voice control service Ok, Google from the web browser. \nThat does not mean that Chrome users cannot use their voice anymore to search on google as the option to do so is still baked in to the web service. The main difference is that you need to click or tap on the microphone icon first on pages supporting it before you can fire off voice searches or commands. \nGoogle started to roll out voice search back in 2011 for the first time on Google.com, then in 2013 as a browser extension for Google Chrome, in 2014 as a native feature in Chrome, and rather recently also as a binary component in Chromium on Linux . \nThe integration allowed users to initiate voice commands with the words \"OK Google\" followed by the command itself, for instance to find something on Google Search or open popular websites. The browser listened to user commands when new tabs were opened in the browser or on Google.com. \nGoogle was criticized by privacy advocates for integrating the \"eavesdropping extension\" natively into the Chrome browser. One concern that users expressed over and over again was that everything you said after using the hotword activation was sent to Google. \nThe company stores all voice interaction with its service on company servers, and we recently showed you how to open that archive and play back all of your voice interactions with Google on it. \nA bug discovered in 2014 that allowed websites to listen in to everything said even after closing them did not instill confidence either. \nThe reason for the removal is lack of use according to Venturebeat which should not come as a surprise. While it may be beneficial at times to talk to mobile phones, considering that typing requests is not as comfortable as on a desktop, the same cannot be said for desktop use. \nOther reasons include privacy, the lack of microphones on some setups to the list and that it feels less natural to speak to your computer than speaking to a mobile device. \nGoogle removed \"OK Google\" voice search from Chrome for the desktop only. This means that the feature remains part on Android and on Chromebooks Summary Say Goodbye to native \"OK Google\" voice integration in Chrome on the desktop Author", "external_links": [], "published": "2015-10-18T09:15:00.000+03:00", "crawled": "2015-10-18T17:13:53.616+03:00", "highlightTitle": ""}