{"organizations": [], "uuid": "e60051c1d029e8986a62858eb7da66755b534941", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266385/technology-general", "section_title": "Technology Press Releases from PRWeb - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30239731/etymotic-brings-its-newest-companion-mics-and-insert-earphones-for-audiometry-to-the-60th-euha-congress-in-nuremberg-germany", "country": "US", "title": "Etymotic Brings Its Newest Companion Mics and Insert Earphones for Audiometry to the 60th EUHA Congress in Nuremberg, Germany", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Etymotic Brings Its Newest Companion Mics and Insert Earphones for Audiometry to the 60th EUHA Congress in Nuremberg, Germany - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T19:02:00.000+03:00", "replies_count": 0, "uuid": "e60051c1d029e8986a62858eb7da66755b534941"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30239731/etymotic-brings-its-newest-companion-mics-and-insert-earphones-for-audiometry-to-the-60th-euha-congress-in-nuremberg-germany", "ord_in_thread": 0, "title": "Etymotic Brings Its Newest Companion Mics and Insert Earphones for Audiometry to the 60th EUHA Congress in Nuremberg, Germany", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Product Debuts Featured Among Etymotic’s Industry Leading Earphones and Earplugs at Annual European Acousticians Meeting\nElk Grove Village, IL, USA (PRWEB) October 12, 2015\nEtymotic Research, manufacturer of hearing wellness solutions and high-fidelity personal audio products, will present the latest version of Companion Mics, the CM4 Multi-Talker Noise Reduction System, as well as its new ER-3CTM insert earphones for audiometry, at the European Union of Hearing Aid Acousticians’ (EUHA) 60th Annual Congress in Nuremberg, Germany.\nThe conference and exhibition runs from October 14-16, 2015. Etymotic will demonstrate The BEAN® Quiet Sound Amplifier, a high-quality, low-cost personal sound amplifier, which amplifies only soft sounds and is transparent for loud sounds. Etymotic’s full line of high-fidelity earplugs and earphones will also be displayed.\nThe CM4 Companion Mics system enables up to four persons to listen and speak to each other. Directional microphones give up to a 10:1 decrease in the relative noise level heard by each listener. The units use lithium polymer rechargeable batteries. Battery life is 6-10 hours, which gives ample use time for most applications. “We are especially pleased to present the next generation of Companion Mics,” said Mead Killion, PhD, founder and CTO of Etymotic. “This system will reduce the isolation many hearing-impaired persons experience when they are unable to fully engage with family and friends because background noise makes communication so difficult.”\nWith Companion Mics, those who have been struggling in social and business situations can participate more easily. Like its predecessor launched in 2006, the new CM4 establishes a direct communication among all active units, bypassing the noise and reverberation of the local acoustic environment. Companion Mics use the 2.4 GHz band.\nEtymotic’s new ER-3C earphones are the next generation of insert earphones designed to replace Etymotic’s ER-3A® Tubephone earphones, which have been the worldwide standard for audiometric insert earphones since 1985. ER-3 Series earphones are intended for use with audiometric equipment used in hearing testing at audiology clinics, auditory research and screening in industrial and educational settings. They are well suited for unfavorable test environments that may have high ambient noise levels. The frequency response and performance characteristics of ER-3C earphones are virtually identical to the original ER3-A earphones at all audiometric frequencies and approximate those of Telephonics® TDH 39, 49 and 50 supra-aural earphones. ER-3C earphones incorporate “touch-proof” electrical connection for safety.\nThe annual EUHA Congress is presented by the European Union of Hearing Aid Acousticians and offers lectures, workshops and the biggest European trade exhibition showcasing technological developments and innovations. The exhibition is presented by the German Association of the Hearing Instruments Industry (BVHI).\nAbout Etymotic Research\nEtymotic is a research, development and manufacturing company that designs high-fidelity personal audio products and hearing wellness solutions to assess, enhance and protect hearing. For over 30 years, innovation and education have been central to Etymotic’s mission. Etymotic is one of the most respected leaders in high-fidelity audio, hearing conservation and hearing enhancement devices. For more information about Etymotic, its hearing wellness mission and its products, please visit http://www.etymotic.com\n //www.prweb.com/releases/2015/10/prweb13006649.htm\n ", "external_links": ["http://www.prweb.com/releases/2015/10/prweb13006649.htm"], "published": "2015-10-12T19:02:00.000+03:00", "crawled": "2015-10-12T19:31:46.025+03:00", "highlightTitle": ""}