{"organizations": [], "uuid": "9763be7f59a095eb82bf24616bdc03b161c9a56f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.marketwatch.com", "main_image": "http://s.marketwatch.com/public/resources/MWimages/MW-CB353_inflat_MG_20140429095321.jpg", "site_section": "http://www.marketwatch.com/companies/akamai-technologies-inc?prop=industry&propval=mining%20and%20metals", "section_title": "Akamai Technologies Inc - MarketWatch.com Topics", "url": "http://www.marketwatch.com/story/worry-about-myflation-not-inflation-or-deflation-2015-10-23", "country": "US", "title": "Worry about ‘myflation’ not inflation or deflation - MarketWatch", "performance_score": 0, "site": "marketwatch.com", "participants_count": 1, "title_full": "Worry about ‘myflation’ not inflation or deflation - MarketWatch", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "9763be7f59a095eb82bf24616bdc03b161c9a56f"}, "author": "Elizabeth O'Brien", "url": "http://www.marketwatch.com/story/worry-about-myflation-not-inflation-or-deflation-2015-10-23", "ord_in_thread": 0, "title": "Worry about ‘myflation’ not inflation or deflation - MarketWatch", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The breathless media coverage of the Federal Reserve’s decision last month to leave a key interest rate unchanged fueled the perception among investors that when the Fed finally does raise that rate off its historic lows, the move will have a big impact on their portfolios.\nPundits predict that the Fed will raise the federal-funds rate to some degree by the end of the year, reversing the near-zero level that has been in place since the end of 2008. The federal-funds rate influences rates offered by bonds, mortgages, student and car loans and other debt. Smart people can — and do — debate the extent to which the Fed’s action will hit home for ordinary investors by spurring inflation and putting a damper on market returns.\nWe can’t control what the Fed does, nor can we control the ensuing market reaction. But we can take steps to insulate our financial lives from whatever the impact will be, said participants in a recent MarketWatch panel discussion on interest-rate concerns for those saving for retirement.\nBond-fund investors: Know what you own (3:40) If you're saving for retirement, you need to know about bond duration, time horizon and liquidity in the bond market. MarketWatch panelists say these are the challenges investors will need to focus on as interest rates rise.\nThe title of the MarketWatch event was “Rate Quake: How to manage retirement investments in a rising-interest-rate environment.” See the full special report.\nThese insulating moves may be especially critical for those nearing and in retirement, whose comparatively shorter time horizon — coupled with a likely need to draw down from their portfolio — leaves little room for error. The investment portfolio falls on the asset side of the family balance sheet and yet, “the liabilities side of the equation is more important for retirees,” said panelist Michael Falk, partner at Focus Consulting Group in Long Grove, Ill. and chief strategist for Mauka Capital in Chicago. “If you have a higher degree of control over your spending, you’re less dependent on markets, so they can’t be as disruptive in your financial plan,” Falk said.\nFalk was joined by Kathy Jones, chief fixed income strategist at the Schwab Center for Financial Research, and Joseph M. Jennings, Jr., wealth director and senior vice president at PNC Wealth Management.\nRetirees who live off investment income and have high fixed monthly costs will sweat market fluctuations more than those who have low fixed costs. Getting rid of debt lowers fixed costs: paying off the mortgage or downsizing to a home with no mortgage, paying off the credit cards, getting rid of a car. Falk said the last option is never popular when he raises it with retired couples, but add up the annual costs of gas, insurance, maintenance and depreciation and it’s hard to argue with the logic that a retired couple would do well to share a vehicle.\nThe “bucket” method can also help insulate portfolios from day-to-day market movements, Falk said. This approach involves putting about three years’ worth of expenses into cash and short term bonds so market shocks won’t affect a planned vacation or other near-term spending goals. Expenses for years four through eight can go into a mixed portfolio of stocks and bonds, whereas long-term funds can go into stocks for growth.\nBond ladders are another good strategy to “take the timing out of your portfolio,” said Schwab’s Jones. “You can stop worrying about Janet Yellen.”\nThe strategy involves buying bonds of staggered maturities and rolling them over as they mature. In one common application, an investor would divide the total ladder allocation among bonds maturing in two, four, six, eight and 10 years. As the two-year bond matures, the investor rolls the proceeds into a new 10-year bond. This approach allows investors to benefit from rising interest rates, rather than locking up all funds in a low-yielding bond.\nRising interest rates will also benefit savers, who have earned next to nothing on their cash for the better part of a decade, Jones said.\nAt the same time, many investors worry that rising interest rates will spur inflation. Yet it’s not likely we’ll see a dramatic spike, Jones said. The aging world population is a long-term deflationary force that will temper inflation well into the future, she said.\nInstead of fretting about inflation or deflation in the macro economy, investors should concern themselves with “myflation,” Falk said. That’s a term he coined for the price trajectory of goods and services that we personally consume.\nThose who need a lot of health care will have to contend with an inflationary rate that’s consistently above the overall consumer-price index, the government benchmark for inflation that measures price changes in a basket of goods, of which medical care is one component. Those who are funding their children’s college educations will also have to contend with a higher-than-average rate of inflation, as tuition costs have soared.\nThe Holy Grail of retirement planning is to “get to a place where you’re not worried about outliving your money,” Jones said. This means controlling the expenses we can, to save money for those we can’t.\nSee the other stories in the Rate Quake special report:\nPay off your mortgage or save more?\nDon’t worry about the Fed, worry about your long-term investment strategy\nHow to use a bond-laddering strategy\nMore from MarketWatch", "external_links": [], "published": "2015-10-23T03:00:00.000+03:00", "crawled": "2015-10-23T07:41:20.711+03:00", "highlightTitle": ""}