{"organizations": [], "uuid": "4a1387212556afe904a4feb217dc19742e70b3a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1137928/anonabox-announces-alliance-with-ingram-micro", "country": "US", "title": "Anonabox Announces Alliance With Ingram Micro", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "Anonabox Announces Alliance With Ingram Micro", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T00:08:00.000+03:00", "replies_count": 0, "uuid": "4a1387212556afe904a4feb217dc19742e70b3a3"}, "author": "admin", "url": "http://www.freshnews.com/news/1137928/anonabox-announces-alliance-with-ingram-micro", "ord_in_thread": 0, "title": "Anonabox Announces Alliance With Ingram Micro", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Submitted by admin on 10/7/2015 @ 2:08 PM   Anonabox \nCHICO, Calif., Oct. 7, 2015 /PRNewswire/ -- Consumers interested in Anonabox can currently purchase a privacy device on its revamped website--and soon at nearby retailers. Anonabox (which supplies Tor and VPN routers to maintain online privacy) today announced an agreement with Ingram Micro Inc., a Fortune 100 company that delivers a full spectrum of global technology and supply chain services to businesses around the world, opening the door for Anonabox devices to be sold in retail stores across the United States and abroad. \nLogo - http://photos.prnewswire.com/prnh/20151007/275026LOGO \nThe announcement comes two weeks after Anonabox released details about its three new privacy devices: Fawkes, Tunneler and the Anonabox PRO. The Anonabox Original is also still available. \n\"The Ingram Micro agreement will help expand our reach and product availability, while elevating Anonabox's brand recognition as a privacy tool for the everyman, as well as those with a deeper knowledge of technology,\" said Anonabox CEO Marc Lewis. \nIngram Micro represents approximately 1,700 suppliers in the tech industry, including industry brands such as Apple, Cisco, HP, IBM, Microsoft, Samsung and Symantec, among others. Ingram Micro rose to No. 62 this year on the annual FORTUNE 500 list, reporting $46.5 billion in revenue in 2014. \nThe Anonabox privacy devices add a robust layer of privacy, encryption and anonymity to online browsing by routing the user's Internet traffic through the Tor network, over VPN services or both depending on the model of the device. The portable devices require no installation, and can cloak the user's physical location, offer easy access to the deep web, avert content filters, deter big data collection and bypass censorship blocks. \nAnonabox also recently announced its partnership with HideMyAss!, employing its HMA! VPN Pro services to provide an added layer of privacy, encryption and anonymity for the end user of the devices. \nFor more information, contact Marc Lewis at marcpreston@anonabox.com, or for media outreach contact Sean Murphy at sean@anonabox.com. \nAbout Anonabox \nAnonabox Privacy Routers bring a robust layer of anonymity and privacy to your web browsing by routing your Internet traffic over the Tor network or via built in VPN services. Easily access the deep web, bypass censorship and much more.To learn more about Anonabox, visit our website , or find us on Facebook, Instagram and Twitter. \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/anonabox-announces-alliance-with-ingram-micro-300156146.html \nSOURCE Anonabox", "external_links": [], "published": "2015-10-08T00:08:00.000+03:00", "crawled": "2015-10-08T01:03:43.932+03:00", "highlightTitle": ""}