{"organizations": ["Daimler"], "uuid": "9b0b9338ef697580710c8ad02ad86f363fb1f15a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "nz.news.yahoo.com", "main_image": "https://s.yimg.com/iu/api/res/1.2/UUTIKTjPD1cRWeIB.IBIHQ--/YXBwaWQ9eXZpZGVvO2ZpPXVsY3JvcDt3PTY5NjtoPTM1NDtkeD0xO2R5PTE7Y3c9NTExO2NoPTI4ODtxPTcwO249MTtyb3RhdGU9YXV0bw--/https://s.yimg.com/ea/img/-/151003/35b50fabfdb9fc2009b8729a306f473a20aea613-1b0tuop.jpg", "site_section": "https://nz.rss.news.yahoo.com/technology.xml", "section_title": "Technology News - Yahoo New Zealand News", "url": "https://nz.news.yahoo.com/technology/a/29711182/daimler-tests-self-driving-truck-on-german-highway/", "country": "AU", "title": "Daimler tests self-driving truck on German highway (AFP)", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Daimler tests self-driving truck on German highway (AFP)", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T03:41:00.000+03:00", "replies_count": 0, "uuid": "9b0b9338ef697580710c8ad02ad86f363fb1f15a"}, "author": "", "url": "https://nz.news.yahoo.com/technology/a/29711182/daimler-tests-self-driving-truck-on-german-highway/", "ord_in_thread": 0, "title": "Daimler tests self-driving truck on German highway (AFP)", "locations": ["Berlin", "Germany"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tumblr Daimler tests self-driving truck on German highway Berlin (AFP) - German automaker Daimler said it trialled a self-driving truck under real traffic conditions for the first time Friday, on a motorway in southern Germany. \nThe truck has smart systems including radars, cameras and active speed regulators and works without a human driver -- although one has to be in the driver's seat and take the wheel if necessary. \nThe standard Mercedes-Benz Actros, fitted with the intelligent \"Highway Pilot\" system, travelled 14 kilometres (about nine miles) on the A8 motorway, with a driver in the cabin but his hands off the wheel. \n\"Today's premiere is a further important step towards the market maturity of autonomously driving trucks -? and towards the safe, sustainable road freight transport of the future,\" said Wolfgang Bernhard, board member responsible for Daimler Trucks and Buses. \n\"Safe testing in real traffic is absolutely decisive for the development of this technology to market maturity. We are now able to proceed with this,\" said Bernhard, who sat in the driver's seat for the test. \nDaimler unveiled the technology in May in the US state of Nevada, on the iconic Hoover Dam, an hour's drive from Las Vegas. \nThe truck in Friday's trial, the world's first series-production autonomous truck, drove between Stuttgart and the town of Denkendorf in the southwestern state of Baden-Wuerttemberg, where Daimler is headquartered. \nA totally self-driving truck, without the need for human monitoring, is still a long way off. \nDaimler compared the Highway Pilot to a plane's autopilot. It is able to steer the truck by itself, while the driver \"retains full responsibility, needs to monitor the traffic at all times and must be able to intervene at any time\". \nThe system includes front-mounted radar and a stereo camera, as well as Daimler's Adaptive Cruise Control system. \nShould the weather or the road markings deteriorate badly, the system prompts the driver to take over the controls with audible and visual signals and, if the driver fails to respond, brings the truck to a stop automatically. \nThe Highway Pilot has already driven around 20,000 kilometres on test routes in Germany and the United States, said Daimler. \nState premier Winfried Kretschmann of the Greens party, who was also along for the ride, said \"partially autonomous and autonomous driving indicates that a new age of mobility is dawning\". \n\"Autonomously driving and networked vehicles improve the flow of traffic and can play a decisive role in helping to avoid traffic jams and relieving the strain on drivers,\" he said in a statement. \"They also boost traffic safety.\" \nDaimler says autonomous trucks improve efficiency and cut carbon emissions. Thanks to optimised gear shifting, acceleration and braking, they generate at least five percent fewer CO2 emissions, said the company. \nDaimler, whose vehicles include the high-end Mercedes-Benz range and compact Smart cars, is also the world's biggest maker of trucks with brands including Mercedes-Benz, Freightliner, Fuso and BharatBenz.", "external_links": [], "published": "2015-10-03T03:41:00.000+03:00", "crawled": "2015-10-03T03:01:18.386+03:00", "highlightTitle": ""}