{"organizations": [], "uuid": "a0cb531e0cef6a2ba8061d84d3256e52ad9aab5a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "techon.nikkeibp.co.jp", "main_image": "http://techon.nikkeibp.co.jp/atclen/news_en/15mk/100300075/3.jpg}", "site_section": "http://techon.nikkeibp.co.jp/english/index.rdf", "section_title": "Nikkei Technology Online : tech news - straight from Asia.", "url": "http://techon.nikkeibp.co.jp/atclen/news_en/15mk/100300075/?n_cid=nbptec_tecrs", "country": "JP", "title": "Toyota to Commercialize Inter-vehicle Communication System in 2015", "performance_score": 0, "site": "nikkeibp.co.jp", "participants_count": 0, "title_full": "Toyota to Commercialize Inter-vehicle Communication System in 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T02:36:00.000+03:00", "replies_count": 0, "uuid": "a0cb531e0cef6a2ba8061d84d3256e52ad9aab5a"}, "author": "", "url": "http://techon.nikkeibp.co.jp/atclen/news_en/15mk/100300075/?n_cid=nbptec_tecrs", "ord_in_thread": 0, "title": "Toyota to Commercialize Inter-vehicle Communication System in 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "[Click to enlarge image] [Click to enlarge image] \nToyota Motor Corp announced Sept 30, 2015, that it will commercialize an inter-vehicle communication system using the 760MHz band for the first time in the world. \nThe company will release three kinds of vehicles equipped with the system within 2015. \nThe inter-vehicle communication system, \"ITS Connect,\" wirelessly exchanges data among multiple vehicles. It wirelessly receives the location information of a vehicle, pedestrian, etc in a blind spot and uses the information for safe driving. \nThis time, Toyota developed two services. One is a service that improves the function of following a preceding vehicle. It controls inter-vehicle distance and vehicle speed based on the acceleration/deceleration of a preceding vehicle capable of inter-vehicle communication. Compared with the case where they are controlled based only on data collected by sensors of the user's vehicle, the new system enables to follow a preceding vehicle more smoothly. \nThe other is a service that notifies the user of the existence of an emergency vehicle running near the user's vehicle. When an emergency vehicle (ambulance) capable of inter-vehicle communication sounds a siren, vehicles running near the ambulance are notified of the direction, distance and traveling direction of the ambulance. \nThe inter-vehicle communication system using the 760MHz band is based on \"ARIB STD-T109,\" a standard that was established in Japan in 2012. OFDM and CSMA/CA are used as modulation and access methods, respectively, for the standard so that it becomes similar to wireless LAN standards such as IEEE802.11a/g. The 760MHz band was assigned to ITS (intelligent transportation system) when terrestrial analog TV broadcasting ended in Japan in 2011. \nITS Connect also enables road-to-vehicle communication. By communicating with roadside infrastructure, it notifies the user of signal waiting time, existence of a vehicle or pedestrian in a blind spot at an intersection, etc.", "external_links": [], "published": "2015-10-05T02:36:00.000+03:00", "crawled": "2015-10-05T06:07:22.728+03:00", "highlightTitle": ""}