{"organizations": ["Vodafone"], "uuid": "aded9f9bd1201a79bb9df0bbdab755d8377c69be", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.itnews.com.au", "main_image": "http://i.nextmedia.com.au/News/Berroeta -690.jpg", "site_section": "http://itnews.com.au//RSS/rss.ashx?type=Category&ID=406", "section_title": "iTnews - Technology", "url": "http://www.itnews.com.au/news/vodafone-calls-for-tougher-backhaul-regulations-410856", "country": "AU", "title": "Vodafone calls for tougher backhaul regulations", "performance_score": 0, "site": "itnews.com.au", "participants_count": 0, "title_full": "Vodafone calls for tougher backhaul regulations", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T09:19:00.000+03:00", "replies_count": 0, "uuid": "aded9f9bd1201a79bb9df0bbdab755d8377c69be"}, "author": "", "url": "http://www.itnews.com.au/news/vodafone-calls-for-tougher-backhaul-regulations-410856", "ord_in_thread": 0, "title": "Vodafone calls for tougher backhaul regulations", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Iñaki Berroeta", "Andrew Sadauskas"], "text": "Vodafone calls for tougher backhaul regulations By Andrew Sadauskas on Oct 21, 2015 4:19PM Iñaki Berroeta. Predicts 5G will lead to a massive increase in data use. \nVodafone chief executive Iñaki Berroeta has argued for the federal government to take further steps to regulate the backhaul market in order to promote competition in rural and regional areas, ahead of the rollout of 5G networks. \nThe comments come after Vodafone signed two deals with TPG worth more than $1 billion, which will see TPG build a dark fibre network for Vodafone and migrate its own wholesale mobile customer base away from Optus to Vodafone . \nIn a speech delivered at an American Chamber of Commerce lunch in Sydney, Berroeta claimed end users in rural and regional areas were paying a $3.1 billion price premium because of a lack of competition. \n\"The majority of transmission infrastructure in regional Australia is owned by one provider, which has received more than one billion dollars in public funding over the years,\" Berroeta said. \n“If Vodafone, or any other provider, wishes to operate in those markets where it is unviable to duplicate infrastructure, it needs to pay astronomical prices to a competitor to access those transmission services.” \nOver the past 12 months, data consumption on Vodafone’s network has doubled to 94 petabytes of data, according to Berroeta. \nThis “explosion in data usage” is likely to continue in light of the rollout of 5G networks, machine-to-machine communications and the internet of things. \nBerroeta said he was “delighted” by a recent draft decision, handed down by the ACCC , that set lower backhaul link prices on routes where a single provider holds a monopoly. \nHowever, he argued the federal government needed to take further action on the issue considering the rollout of 5G services, the internet of things and machine-to-machine communications. \n“The proposed new [backhaul] pricing regime will improve our ability to make investments in regional Australia and, in turn, deliver increased coverage and competition,” Berroeta said. \n“But while there has been good progress in some policy and regulatory areas recently, more needs to be done.\" \nThe Vodafone chief used the opportunity to again call for the universal service obligation to be dumped, describing the program as being “unnecessary, wasteful duplication” in the wake of NBN investments in satellite and fixed wireless. \n\"I think there's a future for fixed line as a connectivity media, as broadband. But the thing that doesn't make sense is investing in fixed-line voice. [Yet] this is what the USO is going for,\" he said. \n“USO is not investing in broadband, USO is investing in voice. And voice is a functionality you can use on any technology, on any media.\" \nCopyright © iTnews.com.au . All rights reserved. Tags:", "external_links": [], "published": "2015-10-21T09:19:00.000+03:00", "crawled": "2015-10-21T21:44:19.897+03:00", "highlightTitle": ""}