{"organizations": [], "uuid": "30e92bc8aa9616338c6f5cb24f816b367bdc84da", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com/news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1141812/middle-east-already-embracing-five-technology-trends-affecting-digital-transformation-", "country": "US", "title": "Middle East Already Embracing Five Technology Trends Affecting the Digital Transformation of Public and Private Sectors, Accenture Finds", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "Middle East Already Embracing Five Technology Trends Affecting the Digital Transformation of Public and Private Sectors, Accenture Finds", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T11:03:00.000+03:00", "replies_count": 0, "uuid": "30e92bc8aa9616338c6f5cb24f816b367bdc84da"}, "author": "admin", "url": "http://www.freshnews.com/news/1141812/middle-east-already-embracing-five-technology-trends-affecting-digital-transformation-", "ord_in_thread": 0, "title": "Middle East Already Embracing Five Technology Trends Affecting the Digital Transformation of Public and Private Sectors, Accenture Finds", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Submitted by admin on 10/18/2015 @ 1:03 AM   Accenture \nDUBAI, United Arab Emirates -- (BUSINESS WIRE) -- In its annual global technology outlook, Accenture (NYSE:ACN) has identified five technology trends that will re-shape markets by creating new digital ‘ecosystems’ and found that leading businesses and governments in the Middle East have new strategies and projects in place to capitalize on digital transformation opportunities. This Smart News Release features multimedia. View the full release here: http://www.businesswire.com/news/home/20151018005007/en/ \nThe five trends identified in the Accenture Technology Vision 2015 report include the personalization of the internet – Internet of Me ; a shift in focus from selling things to selling results in an Outcome Economy ; digital platforms that help build next-generation products and services in the Platform (R)evolution ; intelligent software embedded across the enterprise, creating the Intelligent Enterprise ; and intelligent machines and devices working alongside employees as a Workforce Reimagined . \nTo supplement this report, Accenture interviewed more than 200 senior decision-makers in the public and private sectors of the United Arab Emirates (UAE) and the Kingdom of Saudi Arabia (KSA). A majority of respondents – 62 percent in UAE and 83 percent in KSA – have seen the pace of technology adoption in their organization increase over the past two years. About half the organizations in the Middle East (48 percent in UAE and 53 percent in KSA) are actively investing in digital technologies, while another four in 10 are assessing them (41 percent in UAE and 43 percent in KSA). \n“Now that digital has become part of the fabric of many organizations’ operating DNA, they are stretching their boundaries to leverage a broader digital ecosystem as they shape the next generation of their products, services and business models to effect change on a much broader scale,” said Paul Daugherty, Accenture’s chief technology officer. “Leading organizations in the Middle East are already planning and executing on their digital transformation goals in response to the fast-changing needs of this digitally-savvy population.” \nAll (100 percent) of the survey respondents from UAE and 97 percent from KSA are already using or experimenting with mobile technologies to engage with customers, employees or business partners, compared with an average of 94 percent in other countries. \nSome additional findings from the survey of Middle East respondents, broken out by the five emerging technology trends, are: The Internet of Me is changing the way people around the world interact through technology, placing the end user at the center of every digital experience.More than three-quarters of Middle East survey respondents (87 percent in UAE and 82 percent in KSA) said that having a personalized customer experience fits within their top three business priorities, and almost half (46 percent in UAE and 49 percent in KSA) said they are already seeing positive returns on their investments in technologies that enable this personalization. With the exception of mobiles and tablets, respondents from KSA are more bullish than their UAE counterparts on adopting digital technologies within the next four years, including wearables, connected TVs, connected cars, interactive kiosks and smart objects. When asked to identify the leading barrier to adopting personalization technologies, respondents in UAE cited a lack of technology maturity, while those in KSA cited security concerns. Digital devices on the edge are powering an Outcome Economy and enabling a new business model that shifts the focus from selling things to selling results.More than nine in 10 Middle East respondents (96 percent in UAE and 91 percent in KSA) expect that with more intelligent hardware, sensors and devices, organizations will increasingly shift from selling products or services to selling outcomes. While respondents from both UAE and KSA said that mobile, tablet and smart technologies are three of the most influential technologies, they differ widely in their views on the impact of wearable technologies, with more than three-quarters (76 percent) of KSA respondents – but less than half (45 percent) in UAE – identifying wearables as highly influential. The Platform (R)evolution reflects how digital platforms are becoming the tools of choice for building next-generation products and services, and entire ecosystems in the digital and physical worlds.The vast majority of Middle East respondents – 97 percent in UAE and 90 percent in KSA, higher than in any other country surveyed – believe that industry boundaries will dramatically blur as technology platforms reshape industries into more interconnected ecosystems. It is not surprising, therefore, that Middle East respondents were more likely than their global counterparts to say they plan to engage with business partners from outside their own industry on digital initiatives like joint online or mobile solutions – 49 percent in UAE, 50 percent in KSA, while only 40 percent in other countries, on average. The Intelligent Enterprise is making its machines smarter – embedding software intelligence into every aspect of its business to drive new levels of operational efficiency, evolution, and innovation.More than two-thirds (69 percent) of the respondents in KSA – and more than nine in 10 (95 percent) of those in UAE – reported that managing the volume, variety and velocity of data being generated today is very or extremely challenging, compared with 55 percent in other countries, on average. At the same time, approximately 80 percent of all Middle East respondents said they believe that software will soon be able to learn and adapt to our changing world and make decisions based on learned experiences, with applications taking on human-like intelligence. In a Workforce Reimagined, advances in more natural human interfaces, wearable devices, and smart machines are extending intelligent technology to interact as a “team member,” working alongside employees.The vast majority of Middle East respondents (93 percent in UAE and 86 percent in KSA) believe that we have reached a tipping point in the talent shortage for IT skills that will require companies to look at emerging technology solutions to augment their workforces. About two-thirds (60 percent in UAE and 66 percent in KSA) are considering using technologies that enable business users to complete tasks that previously required IT experts. However, about four in five (82 percent in UAE and 79 percent in KSA) believe that successful organizations will manage employees alongside intelligent machines, ensuring collaboration between the two. More than half the respondents (56 percent in UAE and 54 percent in KSA) said they are already using augmentation technologies, like wearables, to better train their workforce, and more than four in 10 (45 percent in UAE and 42 percent in KSA) said they are implementing training to improve human-robot collaboration. \n“The pace of innovation and technology adoption that is beginning to transform companies and governments across the Middle East is only going to increase,” said Omar Boulos, regional managing director of Accenture in the Middle East and North Africa. “Pioneering organizations will focus on creating and becoming part of the broader digital ecosystems that now extend to customers, business partners, employees and other industries.” \nMethodology \nAccenture’s Technology Vision is developed annually by the Accenture Technology Labs . For the 2015 report, the research process included gathering input from the Technology Vision External Advisory Board, a group comprising more than two dozen executives and entrepreneurs from the public and private sectors, academia, venture capital firms and startup companies. In addition, the Technology Vision team conducted nearly 100 interviews with technology luminaries, industry experts and Accenture business leaders. The team also tapped into the vast pool of knowledge and innovative ideas from professionals across Accenture, using Accenture’s collaboration technologies and a crowdsourcing approach to launch and run an online contest to uncover the most-interesting emerging technology themes. More than 1,700 Accenture professionals participated in the contest, contributing valuable ideas and voting on others’ input. \nIn parallel, to capture insights into the adoption of emerging technologies, Accenture Research conducted a global survey of 2,204 business and IT executives across 11 countries, including 103 respondents from UAE and 101 from KSA. Respondents in UAE and KSA represented 10 industries and were mostly C-level executives and directors, with some functional and line-of-business leads, at companies with annual revenues of at least US$500 million, with 98 companies having annual revenues greater than US$6 billion. \nAbout Accenture \nAccenture is a global management consulting, technology services and outsourcing company, with more than 358,000 people serving clients in more than 120 countries. Combining unparalleled experience, comprehensive capabilities across all industries and business functions, and extensive research on the world’s most successful companies, Accenture collaborates with clients to help them become high-performance businesses and governments. The company generated net revenues of US$31.0 billion for the fiscal year ended Aug. 31, 2015. Its home page is www.accenture.com . View source version on businesswire.com: http://www.businesswire.com/news/home/20151018005007/en/ Copyright © Business Wire 2015", "external_links": [], "published": "2015-10-18T11:03:00.000+03:00", "crawled": "2015-10-18T16:15:58.208+03:00", "highlightTitle": ""}