{"organizations": [], "uuid": "d9dc5aaa465b079bdde16e22e92995089dda1751", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theguardian.com", "main_image": "https://i.guim.co.uk/img/static/sys-images/Guardian/Pix/pictures/2015/10/9/1444406979657/542ad595-bac2-4cdf-8adb-ce26c4b9ed4c-1020x612.jpeg?w=1200&amp;q=85&amp;auto=format&amp;sharp=10&amp;s=c95efb40d55562ae7070aeacc5fb041a", "site_section": "http://www.theguardian.com/technology/all", "section_title": "Technology | The Guardian", "url": "http://www.theguardian.com/media-network/2015/oct/13/empathy-human-machine-artificial-intelligence-google", "country": "GB", "title": "What will become of empathy in a world of smart machines? | Media Network", "performance_score": 0, "site": "theguardian.com", "participants_count": 2, "title_full": "What will become of empathy in a world of smart machines? | Media Network | The Guardian", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T16:45:00.000+03:00", "replies_count": 1, "uuid": "d9dc5aaa465b079bdde16e22e92995089dda1751"}, "author": "Colin Nagy", "url": "http://www.theguardian.com/media-network/2015/oct/13/empathy-human-machine-artificial-intelligence-google", "ord_in_thread": 0, "title": "What will become of empathy in a world of smart machines? | Media Network", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "At a recent conference in Malmö, Sweden , in front of a keynote-sized audience, two speakers presented a strange video. It was of a recently developed cybernetic dog , that moved, acted and gestured like the real thing. In an odd twist, people in the video shoved and kicked it.\nIt reacted, predictably, as a real dog would: moving, rebalancing, even flinching perceptibly. The system was determining what movements were necessary to stay upright. But the emotional magnitude was entirely on us, the humans.\nThe entire audience gasped. Then they realised that it was, in fact, odd to gasp. Another kick came. The same thing happened. Everyone felt something vivid, and disturbing.\nIt was one of these strange examples of two blurring worlds, playing out in front of us. Empathy flooded towards what actually was an unfeeling, man-made object.\nWe’re in a very interesting, in-between moment in technology. We can see the seams on the fastball: the connected home, previously idle devices now able to communicate with one another, artificial intelligence (AI) and the ability to sift data for big correlations. And of course, the virtual assistant embedded within your mobile phone.\nRelated: ​Positive PR is needed to show there’s nothing to fear from human-friendly AI\nBut as we increasingly interact with software and interfaces to do many of the recurring things we do every day, it is interesting to think about the idea of empathy in interactions, and how the software layer we use will gradually start becoming empathetic to our needs.\nOne glitch in the matrix that portends larger things was revealed in a recent incident with Google’s self-driving car. One of Google’s experimental vehicles was at a four-way stop. A cyclist on a fixed-gear bike arrived just behind it at the intersection. While waiting for the car to go he performed a track stand, balancing the bike by rocking back with its own momentum.\nIn a post on roadbikereview.com user OxTox said:\n“It apparently detected my presence (it’s covered in GoPros) and stayed stationary for several seconds. It finally began to proceed, but as it did, I rolled forward an inch while still standing. The car immediately stopped … I continued to stand, it continued to stay stopped. Then as it began to move again, I had to rock the bike to maintain balance. It stopped abruptly. We repeated this little dance for about two full minutes and the car never made it past the middle of the intersection.”\nIt was a telling short-circuit. The car didn’t know how to process this behaviour.\nWe’re seeing baby steps towards this idea of empathy in interactions. The interface is exhibiting empathy, as well as its designer. Anyone who has used the language-learning application Duolingo knows that it quickly adjusts based on what area you need practice in, seemingly on the fly. Rusty on the subjuntivo in Spanish? You’re going to get peppered with it.\nBut can machines be expected to be fully empathetic? Signs point to no. It is relatively easy to create a learning brain but we don’t yet know how to create a heart or a soul. In a recent talk at the New Yorker festival MIT Media Lab director Joi Ito asserted that “humans are really good at things computers are not.”\nSo perhaps the future lies not in sensational rise-of-the machines style narratives, but in the meaningful interplay between smarter software and capable humans.\nWe’re already starting to see it occur in hospitality, with services such as Alfred , where a human being orchestrates the growing number of on-demand services ( Uber , Instacart etc) to get things done for you quickly, and in one place. Some airlines are arming their flight attendants with relevant customer data on mobile that will allow them to employ better service and recognition of frequent fliers in-person.\nMachine learning may be the thing that defines “the next wave” of apps and services. It might take the form of a virtual assistant or just really good suggestions. Eventually we may not even notice as it’s a part of every major platform and mobile operating system.\nBut it would also appear that the human touch of warmth, empathy, and service still has a very welcome and important place in our lives. And when coupled with the software that’s “eating the world” it will lead to very interesting – and unexpected – places.\nColin Nagy is executive director at The Barbarian Group . Follow him on Twitter @CJN\nTo get weekly news analysis, job alerts and event notifications direct to your inbox, sign up free for Media and Tech Network membership .\nAll Guardian Media and Tech Network content is editorially independent except for pieces labelled “Brought to you by” – find out more here .", "external_links": ["https://twitter.com/CJN", "http://barbariangroup.com/", "https://www.uber.com/", "http://www.helloalfred.com/", "https://en.duolingo.com/", "http://forums.roadbikereview.com/general-cycling-discussion/encounter-google-car-today-349240.html", "https://www.instacart.com/store", "http://2015.theconference.se/", "http://www.mobilemarketer.com/cms/news/software-technology/20173.html", "http://www.youtube.com/watch?v=aR5Z6AoMh6U", "https://www.youtube.com/embed/aR5Z6AoMh6U?wmode=opaque&feature=oembed", "https://www.media.mit.edu/"], "published": "2015-10-13T16:45:00.000+03:00", "crawled": "2015-10-13T16:26:53.504+03:00", "highlightTitle": ""}