{"organizations": [], "uuid": "7cd4f71e095c08680f7c030959b3ba0dac3250e1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bio-medicine.org", "main_image": "", "site_section": "http://feeds.bio-medicine.org/latest-biology-technology", "section_title": "Latest Biology Technology from Bio-Medicine.Org", "url": "http://www.bio-medicine.org/biology-technology-1/BioAmber-Announces-Webcast-of-Fiscal-Third-Quarter-2015-Financial-Results-34402-1/", "country": "US", "title": "BioAmber Announces Webcast of Fiscal Third Quarter 2015 Financial Results", "performance_score": 0, "site": "bio-medicine.org", "participants_count": 0, "title_full": "BioAmber Announces Webcast of Fiscal Third Quarter 2015 Financial Results", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T14:25:00.000+03:00", "replies_count": 0, "uuid": "7cd4f71e095c08680f7c030959b3ba0dac3250e1"}, "author": "", "url": "http://www.bio-medicine.org/biology-technology-1/BioAmber-Announces-Webcast-of-Fiscal-Third-Quarter-2015-Financial-Results-34402-1/", "ord_in_thread": 0, "title": "BioAmber Announces Webcast of Fiscal Third Quarter 2015 Financial Results", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BioAmber Announces Webcast of Fiscal Third Quarter 2015 Financial Results ... MONTREAL Oct. 19 2015 / BioAm...North American Callers: 1-888-390-0546 ...International Callers: 416-764-8688 -- ... http://feeds.bio-medicine.org/latest-biology-technology Date:10/19/2015 \nMONTREAL , Oct. 19, 2015 /PRNewswire/ - BioAmber Inc. (NYSE and EURONEXT Paris:BIOA) today announced that it will report financial results for the third quarter 2015 on Wednesday, November 4, 2015 after the close of the market. The company has scheduled a webcast and conference call for 4.30 pm ET (1.30 pm PT) to discuss the results. \nLive audio of the conference call will be webcast over the internet and will be available to investors, members of the news media and the general public. To access the webcast of the call, go to the company's website, www.bio-amber.com . Audio of the teleconference is also available by dialing: \nNorth American Callers: 1-888-390-0546 \nInternational Callers: 416-764-8688 \nAn audio replay of the call will be available approximately two hours after the conclusion of the live call, and will remain available on BioAmber's website for 30 days. An audio of the repay is also available by dialing: \nNorth American Callers: 1-888-390-0541 \nPasscode: 917126 # \nAbout BioAmberBioAmber (NYSE: BIOA ) is a sustainable chemicals company. Its proprietary technology platform combines industrial biotechnology and chemical catalysis to convert renewable feedstock into chemicals for use in a wide variety of everyday products including plastics, resins, food additives and personal care products. For more information about BioAmber visit www.bio-amber.com \nForward-Looking Statements This press release contains forward-looking statements, which are subject to substantial risks, uncertainties and assumptions. These statements often include words such as \"believe,\" \"expect,\" \"anticipate,\" \"intend,\" \"plan,\" \"estimate,\" \"seek,\" \"will,\" \"may\" or similar expressions. Although we believe that the expectations reflected in the forward-looking statements are reasonable, we cannot guarantee that the events and circumstances reflected in the forward-looking statements will be achieved or occur and the timing of events and circumstances and actual results could differ materially from those projected in the forward- looking statements. Accordingly, you should not place undue reliance on these forward-looking statements. All such statements speak only as of the date made, and we undertake no obligation to update or revise publicly any forward-looking statements, whether as a result of new information, future events or otherwise.", "external_links": [], "published": "2015-10-19T14:25:00.000+03:00", "crawled": "2015-10-20T16:21:49.903+03:00", "highlightTitle": ""}