{"organizations": [], "uuid": "7ff01e2ace80321455d3da731052637c2044deb7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266385/technology-general", "section_title": "Technology Press Releases from PRWeb - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30288176/clearfit-named-most-innovative-cloud-based-recruitment-solution", "country": "US", "title": "ClearFit Named Most Innovative Cloud-Based Recruitment Solution", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "ClearFit Named Most Innovative Cloud-Based Recruitment Solution - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T11:11:00.000+03:00", "replies_count": 0, "uuid": "7ff01e2ace80321455d3da731052637c2044deb7"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30288176/clearfit-named-most-innovative-cloud-based-recruitment-solution", "ord_in_thread": 0, "title": "ClearFit Named Most Innovative Cloud-Based Recruitment Solution", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ClearFit was named Most Innovative Cloud-Based Solution at the Recruiting ServiceInnovation (ReSI) Awards in Las Vegas during the annual gala awards ceremony on October 15, 2015.\n(PRWEB) October 18, 2015\nToronto, ON: ClearFit was named Most Innovative Cloud-Based Solution at the Recruiting Service Innovation (ReSI) Awards in Las Vegas during the annual gala awards ceremony on October 15, 2015.\nClearFit brings powerful, objective data to the table in support of talent acquisition, career path development, leadership development, internal mobility, and other vital people decisions.\nEvery company has a tremendous amount of data on WHAT their people do and WHAT they have done—their skills, experience, education, performance and results. This is valuable data, but it is limited, and doesn’t enable optimal decisions. This results in high rates of hiring mistakes, low engagement on the job, high turnover rates, and underperforming teams.\nWhat’s missing, and what ClearFit is uniquely able to provide, is a new type of data called WHY data, which provides insights into who people are, what jobs they are built to enjoy and excel at, and why they perform at the level they do.\nJamie Schneiderman, ClearFit CEO and author of the recently released “What to Why – The Fundamental Shift in the Way Leaders Build High-Performing Teams” explains: “WHAT data provides 50% of the information we need to make good decisions about people. Lack of the whole picture prevents many organizations from moving the needle on hiring and developing the right people. WHY data provides the other 50%. WHY data is such a powerful addition to the human capital marketplace that it allows us to envision a world where the right people are in the right jobs, resulting in happier employees and more productive organizations.”\nAbout ClearFit: ClearFit delivers the WHY information that drives today's top performing teams. ClearFit makes it easy to get the right people into the right roles, ensuring each person is set up to succeed, and to easily identify new candidates that are built like the organization’s proven top performers.\nAbout the ReSI Awards: The Recruiting Service Innovation (ReSI) Awards are designed to recognize the individuals, organizations, products and services that are having a significant and beneficial impact on talent acquisition. The ReSIs are presented by the International Association of Employment Web Sites, the trade association for the global talent acquisition solutions industry.\nFree Download: For a free download of “What to Why – The Fundamental Shift in the Way Leaders Build High-Performing Teams”, visit clearfit.com/what-to-why\n //www.prweb.com/releases/2015/10/prweb13027886.htm\n ", "external_links": ["http://www.clearfit.com/what-to-why/", "http://www.prweb.com/releases/2015/10/prweb13027886.htm"], "published": "2015-10-18T11:11:00.000+03:00", "crawled": "2015-10-18T11:17:08.729+03:00", "highlightTitle": ""}