{"organizations": ["TASER"], "uuid": "76c7c49d3fb8bf34aac83b0c027075d2de68f89a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "science-technology.news-articles.net", "main_image": "", "site_section": "http://science-technology.news-articles.net/content/rss.php", "section_title": "Science and Technology @ News Articles Network", "url": "http://science-technology.news-articles.net/content/taser-introduces-next-generation-axon-body-camera-unlimited.xhtml", "country": "US", "title": "TASER Introduces Next Generation Axon Body 2 Camera with Unlimited HD", "performance_score": 0, "site": "news-articles.net", "participants_count": 0, "title_full": "TASER Introduces Next Generation Axon Body 2 Camera with Unlimited HD", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T17:08:00.000+03:00", "replies_count": 0, "uuid": "76c7c49d3fb8bf34aac83b0c027075d2de68f89a"}, "author": "", "url": "http://science-technology.news-articles.net/content/taser-introduces-next-generation-axon-body-camera-unlimited.xhtml", "ord_in_thread": 0, "title": "TASER Introduces Next Generation Axon Body 2 Camera with Unlimited HD", "locations": ["SEATTLE"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "TASER Introduces Next Generation Axon Body 2 Camera with Unlimited HD   Published on 2015-10-23 04:59:34 TASER Introduces Next Generation Axon Body 2 Camera with Unlimited HD -- SEATTLE, Oct. 23,   TASER's Axon Body 2 On-Officer Camera TASER's Axon Body 2 On-Officer Camera \n[[UEdFZ2NtVnNQVndpYm05bWIyeHNiM2RjSWlCb2NtVm1QVndpWENJZ2IyNWpiR2xqYXowbmNHOXpkRlJ2Um1WbFpDaGNJbWgwZEhBNkx5OXdhRzkwYjNNdWNISnVaWGR6ZDJseVpTNWpiMjB2Y0hKdVpuVnNiQzh5TURFMU1EY3dOeTh5TXpFME5qWk1UMGRQWENJcE95QnlaWFIxY200Z1ptRnNjMlU3Sno0OGFXMW5JSE55WXoxY0ltaDBkSEJ6T2k4dllYTnpaWFJ6TWk1d2NtNWxkM04zYVhKbExtTnZiUzlrWlhOcFoyNXBiV0ZuWlhNdlptSmZjMmhoY21VdWNHNW5YQ0lnTHo0OEwyRSt8]] [[UEdFZ2NtVnNQVndpYm05bWIyeHNiM2RjSWlCb2NtVm1QVndpYW1GMllYTmpjbWx3ZERwMmIybGtLREFwTzF3aUlHTnNZWE56UFZ3aWNHbHVMV2wwTFdKMWRIUnZibHdpSUdOdmRXNTBMV3hoZVc5MWREMWNJbWh2Y21sNmIyNTBZV3hjSWlCdmJtTnNhV05yUFZ3aWFtRjJZWE5qY21sd2REcGpZV3hzY0dsdWFYUk5iMlJoYkNnbmFIUjBjRG92TDNkM2R5NXdjbTVsZDNOM2FYSmxMbU52YlM5dVpYZHpMWEpsYkdWaGMyVnpMM1JoYzJWeUxXbHVkSEp2WkhWalpYTXRibVY0ZEMxblpXNWxjbUYwYVc5dUxXRjRiMjR0WW05a2VTMHlMV05oYldWeVlTMTNhWFJvTFhWdWJHbHRhWFJsWkMxb1pDMHpNREF4TmpVeU9UZ3VhSFJ0YkNjc0oyaDBkSEE2THk5d2FHOTBiM011Y0hKdVpYZHpkMmx5WlM1amIyMHZjSEp1Wm5Wc2JDOHlNREUxTURjd055OHlNekUwTmpaTVQwZFBKeXduVkVGVFJWSWxNallsTWpNek9TVXpRbk1yUVhodmJpdGljbUZ1WkN0cGJtTnNkV1JsY3l0aEsyZHliM2RwYm1jcmMzVnBkR1VyYjJZclkyOXVibVZqZEdWa0szQnliMlIxWTNSeksyRnVaQ3R6WlhKMmFXTmxjeXRtY205dEsySnZaSGtyWTJGdFpYSmhjeXRoYm1RclpHbG5hWFJoYkN0bGRtbGtaVzVqWlN0dFlXNWhaMlZ0Wlc1MEszUnZiMnh6SzNSdksyMXZZbWxzWlhNcllYQndjeTRuS1Z3aUlISmxiRDFjSW01dlptOXNiRzkzWENJK1BHbHRaeUJ6Y21NOVhDSm9kSFJ3T2k4dlkyOXVkR1Z1ZEM1d2NtNWxkM04zYVhKbExtTnZiUzlrWlhOcFoyNXBiV0ZuWlhNdmNHbHVkR1Z5WlhOMExuQnVaMXdpSUhScGRHeGxQVndpVUdsdUlFbDBYQ0lnYjI1amJHbGphejFjSW1waGRtRnpZM0pwY0hRNlkyRnNiRTl0Ym1sMGRYSmxLQ2xjSWlBK1BDOWhQZz09fA==]] <- stripped tags -> TASER's Axon brand includes a growing suite of connected products and services from body cameras and digital evidence management tools to mobiles apps.  ><- stripped tags -> SEATTLE , Oct. 23,   TASER International, Inc. (NASDAQ: TASR), the global leader in body-worn camera and evidence management technology, today announced its new Axon Body 2 camera for $399 with unlimited HD storage included in the Unlimited pricing tier for $79 per month. Agencies can now capture great HD video evidence without worrying about the cost. TASER anticipates availability for shipment and trials in Q4 2015. \"The big challenge with HD video has been the significant increase in cost of storage - typically 5x the cost of standard definition,\" said Rick Smith , CEO and Founder of TASER. \"Because of the scale of our platform and our ability to drive down costs, we are now able to make unlimited HD video plans available to our customers at the same cost as standard definition, something unprecedented in our industry.\" The Axon Body 2 camera is part of the growing Axon platform that connects cloud, mobile and wearable technologies to give police agencies a true end-to-end solution. Axon Body 2 takes the powerful simplicity of its predecessor to the next level with a single-unit design equipped with even greater capabilities like unlimited HD video and industry-leading security enhancements. TASER built Axon Body 2 on an Ambarella (NASDAQ: AMBA ) HD camera System-On-Chip (SoC). Ambarella is a market leader in wearable, sports, flying, automotive and IP security camera SoCs. \"Ambarella is thrilled to partner with TASER to deliver this state-of-the-art on-officer video camera design,\" said Fermi Wang, CEO of Ambarella. \"We look forward to partnering with TASER on future products.\" TASER will be showcasing Axon Body 2 at this year's International Association of Chiefs of Police annual conference in Chicago, IL. Visit booth #5038 to experience the latest in body-worn video technology. Axon Body 2 Features & Benefits Retina HD Video: The industry's best low-light video now records in HD. Full-Shift Battery: 12+ hours Pre-Event Buffer: Capture up to 2 minutes before an event. Wireless Activation: Axon Signal turns the camera on with lightbar and other sensor activation. Mobile App: Stream, tag, and replay videos right on your phone with Axon View. Optional Mute: Ability to disable audio in the field to support dual party consent. In-Field Tagging: Officers can add a marker to important points in their video. Unmatched Durability: Built to withstand extreme weather and brutal conditions. Dock and Walk Workflow: Evidence uploads automatically while recharging. Advanced Security: Evidence is encrypted on the camera to protect data at all times. RapidLock Mounts: Versatile mounts keep the camera steady during tough situations. To learn more about Axon Body 2 visit: Axon.io/Body2 There have been several studies conducted recently on the positive effects body-worn cameras can have on a police force and community. These studies include a year-long University of South Florida study conducted at the Orlando Police Department that showed a 53% reduction in use of force and 65% drop in civilian complaints when the Axon body cameras were in use. The San Diego Police Department also released a report showing the use of Axon body-worn cameras resulted in a 41% drop in complaints, 60% drop in total allegations and a 47% decline in \"personal body\" force by officers. In a study by Arizona State University , the Mesa Police Department's use of Axon cameras revealed a 48% reduction in citizen complaints against camera officers for misconduct during the study period, and a 75% decline in use of force complaints. About Axon & Evidence.com Platform : Thousands of law enforcement agencies to date are now utilizing the Axon platform, allowing them to seamlessly integrate software and hardware to enable powerful capabilities. The Axon platform connects technology and people in order to create safer communities. Powerful Simplicity: Our hardware and software products work together seamlessly and are easy to use, with software upgrades every 30 days that continually expand law enforcement capabilities. Security Beyond CJIS. Our security practices go above and beyond CJIS requirements to keep law enforcement's most sensitive data safe. Connected Mobile App Suite . The Axon suite of mobile applications augments the body camera experience and allows officers to Capture, View, and stream Live video from their smartphone. Infinite Capabilities from Capture to Courtroom : From body cameras to digital evidence management tools we arm law enforcement with great capabilities to help them focus on policing. CAD/RMS Integration - Automates Axon video tagging by pulling in the correct metadata from existing systems. Interview room - Axon now supports an enterprise interview room solution, unifying an agencies digital evidence Automated redaction - Smart Tracker is an expanded suite of redaction tools that streamlines the fulfillment of public records requests Prosecutor Solution - Secure digital collaboration with the prosecutor saves time and money Follow the TASER and Axon brand here : Axon on Facebook: https://www.facebook.com/pages/Axon/117780381886687", "external_links": [], "published": "2015-10-23T17:08:00.000+03:00", "crawled": "2015-10-23T16:52:45.732+03:00", "highlightTitle": ""}