{"organizations": ["Agilent Technologies Redesigns Sulfur"], "uuid": "6e21ee5015519c3a591cd8112857fa12fb69e09a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.enhancedonlinenews.com", "main_image": "", "site_section": "http://feed.businesswire.com/rss/eon/company/Agilent+Technologies+Inc./AeLDITGUr20wUmosXb17QA==", "section_title": "EON: Enhanced Online News - News by Company: Agilent Technologies Inc.", "url": "http://www.enhancedonlinenews.com/portal/site/eon/permalink/?ndmViewId=news_view&newsId=20151001005119&newsLang=en&permalinkExtra=TRADE-NEWS-Agilent-Technologies-Redesigns-Sulfur-Nitrogen", "country": "", "title": "TRADE NEWS: Agilent Technologies Redesigns Sulfur and Nitrogen Chemiluminescence Detectors", "performance_score": 0, "site": "enhancedonlinenews.com", "participants_count": 0, "title_full": "TRADE NEWS: Agilent Technologies Redesigns Sulfur and Nitrogen Chemiluminescence Detectors", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T18:00:00.000+03:00", "replies_count": 0, "uuid": "6e21ee5015519c3a591cd8112857fa12fb69e09a"}, "author": "", "url": "http://www.enhancedonlinenews.com/portal/site/eon/permalink/?ndmViewId=news_view&newsId=20151001005119&newsLang=en&permalinkExtra=TRADE-NEWS-Agilent-Technologies-Redesigns-Sulfur-Nitrogen", "ord_in_thread": 0, "title": "TRADE NEWS: Agilent Technologies Redesigns Sulfur and Nitrogen Chemiluminescence Detectors", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "TRADE NEWS: Agilent Technologies Redesigns Sulfur and Nitrogen Chemiluminescence Detectors October 01, 2015 11:00 AM Eastern Daylight Time \nSANTA CLARA, Calif.--( EON: Enhanced Online News )--Agilent Technologies Inc. (NYSE:A) today introduced completely redesigned versions of its industry-leading sulfur and nitrogen chemiluminescence detectors. \n“In today’s labs, where time is critical and accurate results are vital, our new sulfur and nitrogen detectors will deliver.” \nOil refineries, petrochemical producers, and food and beverage companies all depend on precise sulfur and nitrogen testing to meet tightening global regulations on pollution and product quality. \nThe new Agilent 8355 sulfur chemiluminescence detector and 8255 nitrogen chemiluminescence detector are the only solutions to provide complete integration of the gas chromatograph, detector and software for fast, reliable low-level analyses. \n“With sulfur and nitrogen testing gaining importance for both upstream and downstream activities, we took a close look at our gold-standard products and reimagined them, making them significantly better,” said Shanya Kane, Agilent vice president and general manager of the Gas Phase Separations Divisions. “In today’s labs, where time is critical and accurate results are vital, our new sulfur and nitrogen detectors will deliver.” \nHighly sensitive and highly specific, the redesigned detectors are also easier to maintain, thanks to a simplified burner design with 50 percent fewer components. The most common service routine, which used to take one hour, now takes only 10 minutes. \nThe new detectors are fully integrated with the Agilent 7890B gas chromatograph. They are also available as standalone units that can be connected to any gas chromatograph. \nThe Agilent 8355 and 8255 represent a major advance in sulfur and nitrogen chemiluminescence detection, making the technology more reliable and easier to use. \nAbout Agilent Technologies \nAgilent Technologies Inc. (NYSE:A), a global leader in life sciences, diagnostics and applied chemical markets, is the premier laboratory partner for a better world. Agilent works with customers in more than 100 countries, providing instruments, software, services and consumables for the entire laboratory workflow. The company generated revenues of $4.0 billion in fiscal 2014 and employs about 12,000 people worldwide. Agilent marks its 50 th anniversary in analytical instrumentation this year. Information about Agilent is available at www.agilent.com . \nNOTE TO EDITORS: Further technology, corporate citizenship and executive news is available at www.agilent.com/go/news . Contacts", "external_links": [], "published": "2015-10-01T18:00:00.000+03:00", "crawled": "2015-10-02T04:14:40.544+03:00", "highlightTitle": ""}