{"organizations": [], "uuid": "315c46ebb8c284e63b16340c3da534ab65eb917d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ogfj.com", "main_image": "http://www.ogfj.com/content/ogfj/_jcr_content/brandingImage.img.jpg", "site_section": "http://www.ogfj.com/rssfeed/ogfj-analysis.html", "section_title": "Software & Technology News", "url": "http://www.ogfj.com/articles/print/volume-12/issue-10/features/optimizing-business-processes.html", "country": "US", "title": "Optimizing business processes", "performance_score": 0, "site": "ogfj.com", "participants_count": 0, "title_full": "Optimizing business processes", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T16:53:00.000+03:00", "replies_count": 0, "uuid": "315c46ebb8c284e63b16340c3da534ab65eb917d"}, "author": "", "url": "http://www.ogfj.com/articles/print/volume-12/issue-10/features/optimizing-business-processes.html", "ord_in_thread": 0, "title": "Optimizing business processes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "AUTOMATING THE FINANCIAL SUPPLY CHAIN DELIVERS END-TO-END BENEFITS \nRICHARD SLACK, OILDEX, DENVER \nTHE OIL AND GAS INDUSTRY are leaders in technology innovation when it comes to the extraction, production, and pipeline delivery of fuel for energy. However, many oil and gas producers are still catching up when it comes to optimizing business processes. \nDelivering crude to downstream producers seems simple compared to the complexities of dealing with special contract terms, payments, government regulations, and other paperwork. The financial supply chain, like the physical supply chain, has many moving parts, and the more of those parts you can automate the more it benefits every partner in the value chain. \nIt has become an accepted fact that paper processes waste time and resources. Using manual data entry for gas plant statements, joint interest billing (JIB), invoices, and run tickets, for example, not only slows operations but also introduces more opportunities for human error. The numbers have to be entered manually, checked, double-checked, then reconciled when payments are made, and the result is unnecessary time and labor, and slower payments for midstream processors, upstream producers, and everyone else in the production chain. \nWhere other industries have learned the lesson of automation, but the oil and gas industry still lags behind. Ardent Partners reports that 76% of oil and gas producers and suppliers agree that adopting eInvoices to improve operations, but most suppliers are still using paper billing processes. \nThe concept of eInvoicing is far from new. Accounts Payable (AP) departments in various industries have been using eInvoicing for years to automate financial transactions. They have found that automating the invoicing process improves efficiency, facilitates early payment discounts, and can substantially reduce processing time and fees. More importantly, it eliminates paper. \nThe benefits of automating the accounts payable are well understood. PayStream Advisors, a consulting firm that specializes in financial automation software, conducted a survey of managers across various industries to compile its 2014 eInvoicing Benchmark Report. They found: More than 25% of companies receive no electronic invoices. Most companies believe their current accounts payable processes work and don't want to change. The average time it takes to for a company to approve a paper invoice is from five to 10 days. The greatest challenges cited for switching to eInvoicing was manager and supplier adoption. Manual routing and lengthy approval time for invoices were the greatest causes cited for late payments, missed discounts. The greatest benefit cited for automated invoicing was fewer lost invoices, faster approval times, and lower FTE/processing costs. \nClearly, the adoption of paperless processes benefits companies at both ends of the supply chain. Electronic invoicing and transaction processing helps eliminate billing errors, makes it easier to address special contracts and pricing, speeds time to invoice processing, and improves cash flow. When buyers and suppliers implement a paperless transaction process, everyone wins. FIRST, ELIMINATE THE PAPER \nThe first step in any paperless process is to convert paper into machine-readable data. \nMany oil and gas companies still use manual data entry. However, consider the cost of paying an employee who earns $55,000 per year to enter invoice data manually. If that employee can process 400 invoices in three days, then the cost of data entry is $228 per day or $684 for a three-day billing cycle, which means $1.71 of added cost per billing statement, as well as the delay in sending out invoices. \nThe best strategy, of course, is to eliminate the paper from the outset and used digital processes throughout, but that's not always practical. Faxed invoices, mailed bills, and paper receipts are always part of the process. Digitizing the financial supply chain starts with converting and coding paper documents for processing. \nIntelligent capture or optical character recognition (OCR) has been around for some time, and the software has improved enormously since the early days. Today's intelligent capture technology is extremely accurate and speed information transfer while reducing the need for paper processing and storage. \nMost intelligent capture systems start by mapping paper documents to structured data fields. An invoice or document comes into the system, is scanned and recorded, and the data is mapped to fields in the ERP system. Some companies handle this capture process in-house while others outsource it, but the end result is that all accounts payable data become machine readable. Financial data also can be accepted as email, web data, electronic files, or using file uploaders and processed in a similar manner. \nMost intelligent capture systems are easy to install and easy to use. The system can be configured to prioritize invoices based on potential savings, discounts, outstanding P.O.s, contract terms, or other criteria. Software developed for the oil and gas industry is designed to handle industry-specific functions such as billing costs, JIBs, and three-way P.O. matching to ensure error-free transactions. You want to be sure the intelligence capture system delivers clean information that can be mapped to customizable terms and conditions so it's ready to move to the next step in the accounting workflow. OPTIMIZING WORKFLOW AND DISPUTE RESOLUTION \nIn addition to eliminating paper, eInvoicing simplifies workflow. Once the data is entered into the ERP system it can be processed automatically, and the process can be easily modified. Many oil and gas producers are able to eliminate unnecessary steps once they digitize their financial supply chain. \nOne energy company adopted a paperless workflow and was able to reduce the time to process supplier invoices from 30 days to three days or less. The company also was able to optimize the workflow to issue an invoice from 60 steps to 12 steps, and was able to triple the volume of invoices it could handle. \nAdopting a digitized workflow also simplifies dispute management. Automated workflow can sort issues with specific contracts, identify vendor differences or matching failures, and alert management to potential problems before they can escalate into a supplier issue. Having all the necessary data in digital form also makes it easier to isolate and resolve disputes between buyer and supplier. AUTOMATING PROCUREMENT \nBypassing the paper conversion process altogether is even more efficient for business-to-business transactions. eProcurement automates purchases and transactions using networked systems to exchange machine-to-machine data. \nThe beauty of eProcurement is that all the terms of a contract or JIB are preconfigured into the system to handle the exchange of invoices and payments seamlessly, including integrating with financial tracking systems, scheduling payments, and maintaining an auditable search history. Requisitions are automatically incorporated into workflows for approvals, P.O.s issued and delivered to suppliers electronically, then returned and matched by the system for verification. \nReporting is one of the greatest benefits from eProcurement. Tracking all transactions through the ERP system provides visibility across all transactions. Many vendors provide customizable reporting templates that allow you to draft and drop any data into easily readable reports, complete with graphing capabilities. It's the best way to gain a comprehensive overview of operations and the financial health of the company with sufficient detail to go from a macro view of overall performance to an audit of individual transactions and partnerships. Accounts payable and eInvoicing systems with benchmarks and analytical capabilities can deliver insight into financial performance that were not previously available. INTEGRATING SUPPLIERS WITH AN ONLINE EXCHANGE \nOf course, automating your own financial supply chain systems is only half the battle. To maximize the benefit from eProcurement and eInvoicing, everyone in the value chain should be able to exchange transactions and billing information electronically. The PayStream Advisors survey shows that 10% or less of suppliers are currently sending electronic invoices. The greatest barrier to maximizing automation of the financial supply chain is an inability to get suppliers to automate their own financial workflows. \nTo remove these barriers and gain supplier buy-in to automate their own business processes, oil and gas producers are increasingly using cloud-based transaction exchanges to handle transactions. The exchange model allows partners to share invoices and JIBs using a common online platform. No matter what the native file format or data platform, the exchange translates the billing or JIB data format to match billing codes and services on the receiving end. A third-party exchange service streamlines financial processes by giving users a single location to manage all its transactions, including data translation, storing data directly into the accounting systems, and providing complete backup and reporting services. \nThere are other advantages to adopting a third-party exchange model to power the financial supply chain. Since the portal is online it requires little internal IT support, although the exchange should be able to integrate with existing ERP systems to handle data without much human intervention. Once the exchange is set up, additional suppliers, partners, and products can be added easily. The exchange model is also extensible and can be expanded to accommodate as many different and different types of vendors as desired. And the exchange offers complete transaction tracking, reporting, and analytics. \nThe more paper you can eliminate from business processes, the more everyone in financial operations, both internal and external, will benefit. Adopting automated eInvoicing and eProcurement strategies streamlines internal operations, speeds business processes, and makes functions like invoice generation and processing much more efficient. In addition to improving cash flow, automation also will create savings by eliminating unnecessary steps in the workflow, and allow you to work more closely with partners and suppliers to streamline transactions. \nRemoving paper from your workflow removes the friction from business transactions. By automating the financial supply chain, everyone in the value chain wins. \nABOUT THE AUTHOR \nRichard Slack is founder and CEO of Oildex, a cloud-based software-as-a-service provider that simplifies financial and operational processes for oil and gas companies. He has more than 30 years of experience development and marketing technology products for the oil and gas industry.", "external_links": [], "published": "2015-10-15T16:53:00.000+03:00", "crawled": "2015-10-15T23:23:25.759+03:00", "highlightTitle": ""}