{"organizations": [], "uuid": "4a63721f7cd185f1068756ec5a137c60937e566a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/10/07/13010099/mt-logo.jpg", "site_section": "http://www.prweb.com/rss2/internet.xml", "section_title": "Technology: Internet", "url": "http://www.prweb.com/releases/2015/10/prweb13010099.htm", "country": "US", "title": "Media Temple Launches Powerful New Shared Hosting Solution", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Media Temple Launches Powerful New Shared Hosting Solution", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "4a63721f7cd185f1068756ec5a137c60937e566a"}, "author": "Pascale Marchand", "url": "http://www.prweb.com/releases/2015/10/prweb13010099.htm", "ord_in_thread": 0, "title": "Media Temple Launches Powerful New Shared Hosting Solution", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Media Temple, a Los Angeles-based company that provides premium web and cloud hosting solutions, today announced that it has transformed its shared hosting platform, Grid, into a robust managed shared hosting solution. Adding to Grid’s unique, state-of-the-art clustered architecture (which boasts scalable bandwidth and auto-burst capabilities that keep users’ sites and web apps up 24/7, regardless of any traffic spikes), the new solution set offers enhanced ease of use, increased reliability and extra speed. In order to better serve freelance web designers, developers, small and medium agencies, Media Temple is rolling out three different plans: Grid Pro, Grid Agency and Grid Agency+. Additionally, the company is introducing Booster Packs, which customers can leverage to cost-effectively expand their resources, without having to switch plans. Enhanced simplicity: Media Temple has made it simpler for customers to activate the new features of its new shared hosting solution. Among other upgrades, customers can now enjoy: an improved control panel and streamlined onboarding experience; a brand new, user-friendly file manager to quickly upload, edit and organize their files and folders; a new, one-click application installer that provides an easy and time-efficient way to install and manage apps; as well as Google Apps for Work ’s professional-grade email and collaboration toolkit.\nMore speed: Faster than Grid, the new shared hosting solution boasts Solid State Drive (SSD) for storage and databases. It also leverages TrueSpeed CDN (Content Delivery Network), a global CDN powered by industry leader in website security, SiteLock, that increases website speed up to 40% .\nManaged shared hosting: Media Temple is one of the first web hosting companies to offer a truly software-managed shared hosting solution, i.e. providing application updates, malware scanning and automated removal, performance monitoring and backups. With its new shared hosting solution, the company is taking the definition of managed to the next level by adding an expanded catalog of 20 one-click apps that are automatically managed and updated by the new app installer; SiteLock’s Secure Malware Alert & Removal Tool (SMART), which automatically scans websites for vulnerabilities and removes any detected malware; as well as built-in 30-day file and database backups that come with the ability to restore individual files with one click via the new file manager.\n“We’ve taken one of the industry’s most robust shared hosting platforms and made it even more powerful by re-designing it to be easier to use, more reliable, faster and managed,” said Brian Kuhn, VP of Product at Media Temple. “Our new managed shared hosting solution is set up for continuous 24/7 operation, ensuring that no traffic bursts impact our customers’ websites/apps while also enabling them to securely scale up resources as they grow their business.”\nMedia Temple’s unveiling of its new shared hosting offering comes on the heels of other managed hosting-related announcements, as the company recently expanded its managed WordPress hosting solution and launched new managed cloud hosting services for AWS .\nThe three managed shared hosting plans start at $30 per month for Grid Pro, which includes 20GB SSD storage, 1TB bandwidth and 10 sites. All of the plans are backed by Media Temple’s premium 24/7 customer support ‒ with the company’s award-winning team of certified engineers, CloudTech, providing proactive site monitoring and managed priority care to Grid Agency+ users.\nMore information about the new plans’ features and benefits is available at https://mediatemple.net/webhosting/shared/ .\n# # #\nABOUT MEDIA TEMPLE\nFrom its inception in 1998, Media Temple has been on a mission to help web developers, designers, and creative agencies of all sizes run and scale their business online. Media Temple was founded on the premise of hosting our customers' great ideas, and we have been the hosting choice of creative professionals and enterprises ever since. Over 125,000 people and businesses in 100 countries rely on our easy-to-use tools for web and cloud hosting, one-click WordPress installs, virtual servers, domain registration, business applications, and other services to power 1.5 million websites. Our premium service model combined with our scalable technology allows us to focus on delivering only exceptional quality solutions and best-in-class, award-winning 24/7/365 customer support. Our clients range from top tier designers, popular blogs and online design communities, to global advertising agencies, artistic ecommerce meccas and major brands like Red Bull, Nike, Diesel and Under Armour. With 230 dedicated, U.S.-based employees, Media Temple has been repeatedly recognized as one of the best places to work in Los Angeles.\nFind us anytime at http://www.mediatemple.net , on Twitter @MediaTemple or on Facebook.", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5tZWRpYXRlbXBsZS5uZXQ=", "http://www.prweb.net/Redirect.aspx?id=aHR0cHM6Ly9tZWRpYXRlbXBsZS5uZXQvc2VydmljZXMvZ29vZ2xlYXBwcy8=", "https://mediatemple.net/webhosting/shared/", "http://www.prweb.net/Redirect.aspx?id=aHR0cHM6Ly9tZWRpYXRlbXBsZS5uZXQvbWFuYWdlZGNsb3VkLw==", "http://www.prweb.net/Redirect.aspx?id=aHR0cHM6Ly93d3cuc2l0ZWxvY2suY29tL3NlY3VyZXN0b3JlLnBocA==", "http://www.prweb.net/Redirect.aspx?id=aHR0cHM6Ly9tZWRpYXRlbXBsZS5uZXQvd2ViaG9zdGluZy9zaGFyZWQv", "http://www.prweb.net/Redirect.aspx?id=aHR0cHM6Ly9tZWRpYXRlbXBsZS5uZXQvd2ViaG9zdGluZy93b3JkcHJlc3Mv"], "published": "2015-10-15T03:00:00.000+03:00", "crawled": "2015-10-15T19:27:48.515+03:00", "highlightTitle": ""}