{"organizations": [], "uuid": "c5956ac44ed59c7d079c9c2b5c3c7f51d07a53e2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.technologyreview.com", "main_image": "http://www.technologyreview.com/sites/default/files/images/lyft.gradientx392.png", "site_section": "http://www.technologyreview.com/stream/rss/", "section_title": "New on MIT Technology Review", "url": "http://www.technologyreview.com/featuredstory/541791/lyfts-search-for-a-new-mode-of-transport/", "country": "US", "title": "Lyft’s Search for a New Mode of Transport", "performance_score": 6, "site": "technologyreview.com", "participants_count": 0, "title_full": "Lyft’s Search for a New Mode of Transport", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T07:00:00.000+03:00", "replies_count": 0, "uuid": "c5956ac44ed59c7d079c9c2b5c3c7f51d07a53e2"}, "author": "", "url": "http://www.technologyreview.com/featuredstory/541791/lyfts-search-for-a-new-mode-of-transport/", "ord_in_thread": 0, "title": "Lyft’s Search for a New Mode of Transport", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Print We were all in the car with Alexandr, listening to techno, which was his choice. He was driving; it was his car. As we crawled east across Los Angeles, through Hollywood, the two strangers seated behind me argued about whether you could call yourself a photographer if you only posted your photos on Instagram. None of us had met until five minutes before, and after Alexandr dropped us in the different places we were going, we’d probably never see each other again. \nLogan Green, CEO of Lyft, the company whose app brought us four strangers together, thinks encounters like this are the future of urban transport. They’re going to make it greener and more efficient while saving Lyft from being crushed by its competitor Uber, which has more than eight times Lyft’s $1 billion in funding and several times Lyft’s roughly 100,000 active drivers. \nLyft and Uber use the geolocation functions of smartphones to link car owners willing to play cab driver with people willing to hop in a stranger’s car. Millions of people do it every day, even though the services launched only a few years ago. By sidestepping taxi regulations, making payment automatic, and finding a way to precisely locate drivers and customers, Lyft and Uber were able to uncover an astonishing untapped demand for a better way to get around urban areas. When asked to explain the secret, Green takes a characteristically long pause and describes it as “optimizing around the two things that are most important to you: time and money.” \nThis optimization has been most dramatic in San Francisco, where Green and I met, and where both Lyft and Uber are headquartered. Here many people routinely ignore cabs, buses, trains, and even car ownership and instead Uber or Lyft—both are now verbs—everywhere they go. Uber is trying to make all the world’s cities, from Bangkok to Bogotá, like San Francisco: it already operates in 61 countries. Lyft only just made its first overseas venture, a partnership with a leading Chinese ride-hailing company, but Green’s strategy is ambitious in another way. He’s trying to reinvent the taxi-replacement model that has powered the swift rise of his company and its dominant competitor. According to Green, Lyft’s future—and that of urban transport itself—involves many more rides like my techno-soundtracked trip across Hollywood. That journey was made using a carpooling service that the company calls Lyft Line. Green envisions drivers using it to pick up passengers along their own commutes, school runs, or trips to the store. “This idea that every car on the road can be a Lyft, that becoming a driver is as easy as requesting a Lyft—that’s core to our mission,” he says. If that mission succeeds, people might get to where they’re going much more cheaply than they can with a regular Lyft ride, or even a car of their own, because every seat in every car might be filled. As a bonus, congestion and pollution would be slashed. He predicts that car ownership will plummet. \nRegular Lyft rides can be two-thirds of a taxi fare or less, but a Lyft Line ride is even cheaper, and the company aims to shrink the price further. Green says this makes Lyft something new: a third category of transportation somewhere between public and private. That afternoon in Hollywood, sharing a stranger’s car with other strangers because we all needed to get across town, it cost me $15.67 to make the 35-minute trip. I saved $1.63 by sharing with the Instagram argument guys, though I tipped Alexandr $1 of that because I’d put in the wrong destination, making him drive a minute or two out of the way. An online taxi fare estimator for Los Angeles says I would have paid more than $33 in a cab. \nLyft remains tiny compared with Uber. At a hearing in New York in June, the company revealed that it provided 7 percent of rides summoned over the Internet in that city, compared with Uber’s 90 percent. Uber also has an equivalent to Lyft Line, called UberPool, although it doesn’t yet offer an easy way for drivers to pick up passengers during a journey of their own. Green argues that Uber isn’t friendly enough to its drivers to make sharing your car attractive to a broad audience. (A year of using Lyft in Los Angeles and San Francisco suggests to me that Lyft drivers, many of whom have driven for Uber, do feel more respected.) And there is evidence that Lyft’s strategy is working. In San Francisco, the company’s biggest market and one it says is already profitable, most Lyft rides are Lyft Lines. In San Antonio, where Uber, Lyft, and similar services were kicked out by city legislators, Lyft won its way back in this August and is, for now, sole operator after lobbying the mayor to embrace Green’s vision for an efficient and democratic form of transport. Now Green must convince other officials, and millions more customers, that sharing rides with strangers in private cars is something everyone should do, any time. \nTransit obsessive \nGreen, now 31, grew up in Los Angeles, the only child of a veterinarian mother and a physician father. His formative transit experience, like that of many L.A. children of the 1980s and ’90s, was sitting in gridlocked traffic to and from school, three hours every weekday. By his teens, he ran a small tech tutoring and troubleshooting business for “old folks” (a.k.a. adults) and worked summers at a startup run by Nolan Bushnell, the man behind Atari and Chuck E. Cheese’s. Green was on its engineering team. He administered a rewards program that connected arcade games in different locations and piped user data back to company headquarters. The work nurtured his natural urge to optimize, which gnawed at him as he sat in traffic. Most cars had only one person inside, despite the fact that many of those lone drivers were headed to pretty much the same place. “This has got to be the worst way of organizing people,” he recalls thinking. \nGreen studied business economics at the University of California, Santa Barbara, but he effectively majored in transportation. To force himself to understand the alternatives to driving, he left his 1989 Volvo back in Culver City with his folks, putting himself at the mercy of the bus system. “Let me use it and let me get frustrated by how bad the service is,” he resolved. \nSanta Barbara is a preposterously beautiful and wealthy little city. It does not seem like a very good bus town, but it is, or was. I grew up there, and I rode the bus to junior high occasionally. Summers in college I took the bus downtown, to my job at the local alt weekly, where we spent a little time covering the improbable election of a UCSB senior to the city transportation board. That senior was Green, who by then had already spent years trying to improve how people got around. By sitting in on city planning meetings as a sophomore, he had learned about the then-new idea of car-sharing schemes, where people rent communal vehicles by the hour. Green launched one on the UCSB campus: six Priuses, used by a few thousand students and faculty members. He also came to chair the UCSB Parking Rate Payers Board, a group organized to oversee campus policies on parking. Green immediately launched a bold, and ultimately unsuccessful, effort to significantly increase campus parking fees, which had historically been very low. “I think that was the first and last time a student became chair,” recalls Marc Fisher, the vice chancellor at the university. \n“This has got to be the worst way of organizing people,” he recalls thinking. \nGreen ruffled feathers on the city transportation board, too, trying and failing to pass a measure that would have increased taxes to fund buses. By his early 20s he had already reached two positions of real authority, and yet both times he had failed to deliver the jolt to public transportation planning he thought it needed. People wanted cheap parking, and they didn’t want their tax money going to improve buses. The convenience of owning and driving a car dwarfed any other consideration, and bus lines and subway stops could never be numerous enough to rival it. But maybe there was a better, different way, outside the public transit system. Green found it on a vacation through Africa, in Zimbabwe. \nIn Harare, Zimbabwe’s traffic-choked capital, he discovered a public transportation system that was more or less the inverse of Santa Barbara’s—large private cars took the place of city buses. The drivers were self-organizing and set their own routes; if more people needed to travel, someone with a car would join the informal bus fleet to add capacity or a new route. “It was a highly efficient free-market solution to their transit problems,” Green recalls. This, he thought, could also be the answer to the transit problems that plague Los Angeles and so many other cities. It might offer most of the convenience of traveling by car without the costs of having to own and park one or paying for taxis all the time. When Green returned to the United States, he quit the transportation board and began working on a company that would allow car owners to take part in an American version of what he’d seen in Zimbabwe, becoming self-employed drivers who found passengers through the Internet. Green called his startup Zimride—“Zim” for Zimbabwe. \nGreen launched Zimride in 2007 with John Zimmer, an analyst at Lehman Brothers he’d met through a mutual friend. The echo of his last name in Zimride at first freaked Zimmer out, but then he took it as a good omen and moved from New York to start work in a tiny shared office in Palo Alto. In the early days, Zimride was simple. A driver would post on Facebook that he or she was going from point A to point B at such-and-such time, and if you were making the same trip you’d reply. These were usually long-range trips between cities, and on average, it took eight messages back and forth before a successful ride took place. \nGreen thinks ride-sharing can be cheaper and more convenient than car ownership. \nLyft emerged as a side project within Zimride to provide quick intra-city rides. It started in 2012, when smartphones had become common enough to make the process of matching passengers and riders more or less instant. That same year Uber, which had launched in 2010 but offered only limo rides in higher-end town cars, opened up to ordinary car owners with a service called UberX. Both Lyft and UberX grew fast. In 2013, Green sold Zimride—then operating, among other places, on more than 150 college campuses, and with several hundred thousand users—to the company that owns Enterprise Rent-A-Car. He and Zimmer made Lyft their main project. \nIt began as a cuddlier Uber. Drivers fixed fluffy pink mustaches to their cars. Passengers were asked to greet their driver with a fist bump before climbing into the front seat, not the back. Otherwise, Lyft functioned like a cut-rate taxi service. Green wanted to differentiate by getting multiple passengers into each vehicle, the idea he’d picked up in Zimbabwe, but he found himself preoccupied by what he calls “immediate business issues to solve.” One was city and state regulators who tried to block this new, unregulated form of ride-sharing, egged on by entrenched interests like taxi companies. Another was Uber, which was getting hundreds of millions, then billions, in funding, entering new markets with elbows out, and luring drivers away from Lyft. (Several Lyft drivers told me they’d picked up passengers who turned out to be Uber recruiters.) Lyft responded by raising its own war chest and beginning its own pell-mell expansion, albeit only in the U.S. \nToday, both rivals have large, growing customer bases. But they both need to figure out a way to turn a profit. Uber seems most focused on using its network of drivers to move more than just people—for example, to deliver packages or takeout orders. Green has shunned that approach. With the Lyft Line option, introduced in 2014, he has chosen a different path—the one he has been on for years. Thanks to the “destinations” feature added not long after, drivers can not only pick up multiple passengers but find riders along the way to somewhere they’re already going. Green says this is the start of his new, third form of transport. In some ways it’s also very old. Nearly as old as the automobile. \nDriver optional \n“It’s like the jitney,” says Juan Matute , associate director of UCLA’s Institute of Transportation Studies. “The only innovation is the smartphone, and being tracked in real time. This idea’s been around for a century.” Jitneys sprang up with the private automobile as a kind of free-market alternative to the streetcar. They ran popular routes, often mirroring those of public streetcars and subways, but for an extra tip drivers would drop you off at your doorstep. Much like Uber and Lyft, they were stunningly, and to some worryingly, popular. In 1915, 62,000 jitneys operated nationwide, and eventually far more people were riding them than streetcars. Streetcar companies successfully lobbied states and the federal government to shut the “jitney menace” down. \nJitneys didn’t go extinct: a fleet of vans ply their trade along Brooklyn’s Flatbush Avenue, for example. But they survive only by remaining small enough, and far enough underground, not to draw the eye of regulators or the ire of less legally dubious competitors. \nLyft’s government relations team is tasked with preventing a similar fate. It’s headed by David Estrada, a lawyer who came to Lyft from Google. His strategy is to tell cities that Lyft can help manage their congestion and transportation problems, that it must not be seen and regulated as simply a new variety of taxi service, and that it’s at least as safe as cabs and other private car services. He lays out rosy scenarios such as one in which car manufacturers add a dashboard button that transforms you into a Lyft driver with the prod of a finger, making it easy to consolidate the commuters who clog the streets today into fewer vehicles. “That is how simple it should be,” Estrada says. “That is what we can achieve. But we are not going to get there if that driver is looked at as a taxi driver.” \nThe San Antonio deal shows that this strategy is not entirely fanciful. Jitneys survive thanks to the widespread gaps between public and private transit, Matute says. Indeed, there is evidence that Lyft customers are spontaneously using the service to fill them. Ever since Lyft Line launched last year, “a really big chunk of rides” have originated from transit stations, says Green. People use shared Lyft rides to make the crucial transfers between home and station, station and home, that often present a barrier to using public transportation. To capitalize on that trend, late in 2014 Lyft launched Lyft for Work, wherein a business pays the company to get its employees to and from transit stations. The home-rental company Airbnb has tested the scheme to cover the costs of its employees’ “last mile” to both the office and their homes, for example. Lyft is also trying to sign up municipalities, colleges, and school systems. \nFor Lyft to play that kind of role in daily commutes, it must find ways to get as many drivers on the road as possible, with as many people as possible inside each vehicle. Better software for things like scheduling routes is a part of that. Managing the behavior of both drivers and passengers is another. This summer Lyft expanded a program that mentors new drivers to get them on the road faster. And when I joined Green for his weekly meeting with two of his top engineers, one topic of discussion was how to train passengers to tolerate the uncertain wait times that come with putting people going different places in the same vehicle. Lyft is testing the idea of directing people to walk a short distance to a specific spot for a pickup—a kind of smartphone-enabled virtual bus stop. More than a few times, after I summoned a Lyft Line, the driver called me to ask if I could walk a block or two to make for a more efficient pickup. Other times the app would suggest waiting another 10 minutes in exchange for a fare reduction of about a third, buying time until Lyft could put me in a car with as many other riders as possible. \nIn time, Green believes, some of these human challenges will go away—he thinks autonomous vehicles are inevitable. Google, Uber, and carmakers including Tesla Motors and Audi are spending heavily to develop the technology. But when self-driving cars are finally mature, they will need a killer app. Green argues he will have it ready and waiting, in the form of a system that can efficiently get as many people as possible where they need to go using the vehicles on hand. Whether there’s a human in the driver’s seat or not, Lyft is the same, he says. “We’re the replacement, the alternative, to car ownership.” \nRyan Bradley is a journalist in Los Angeles whose work has appeared in Fortune , Popular Science , and the New York Times Magazine .", "external_links": [], "published": "2015-10-13T07:00:00.000+03:00", "crawled": "2015-10-13T12:24:16.975+03:00", "highlightTitle": ""}