{"organizations": [], "uuid": "6b7e3ca35fafd4f7eb490eb009452284b64beffb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/tech/2015/10/23/samsung-unveils-new-stripe-batteries-representing-major-breakthrough-for-mobile-devices/_jcr_content/par/featured-media/media-0.img.jpg/0/0/1445630145300.jpg?ve=1&tl=1", "site_section": "http://www.foxnews.com/tech/", "section_title": "Technology News | Internet, Mobile, and Social Media News | Fox News", "url": "http://www.foxnews.com/tech/2015/10/23/samsung-unveils-new-stripe-batteries-representing-major-breakthrough-for-mobile-devices.html", "country": "US", "title": "Samsung unveils new 'Stripe' batteries, representing a major breakthrough for mobile devices", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Samsung unveils new 'Stripe' batteries, representing a major breakthrough for mobile devices | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "6b7e3ca35fafd4f7eb490eb009452284b64beffb"}, "author": "BGR", "url": "http://www.foxnews.com/tech/2015/10/23/samsung-unveils-new-stripe-batteries-representing-major-breakthrough-for-mobile-devices.html", "ord_in_thread": 0, "title": "Samsung unveils new 'Stripe' batteries, representing a major breakthrough for mobile devices", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Zach Epstein\nPublished October 23, 2015 BGR (younseck)\nAs advances continue in the realm of mobile devices and wearable gadgets, we always come back to the same handful of barriers that impede progress. Chief among them, of course, is battery technology. Component makers spend millions on research and development in an effort to make the most power-efficient parts possible, but the majority of smartphones still only last a day at most per charge. Where wearables are concerned, these tiny devices come in a wide range of flexible shapes that often severely limit vendors’ options when it comes to battery size and placement.\nBattery technology has never been able to keep pace with other components, but a new breakthrough unveiled this week by Samsung could represent one of the most important advancements in mobile battery tech we’ve seen in quite some time.\nMUST READ: HTC exec responds to iPhone copycat claims: No, Apple copied us\nSamsung is known most widely by consumers as a smartphone maker. The company’s Galaxy brand Android phones helped propel Samsung to the top of the industry where shipment volume is concerned, and Samsung is still the world’s No. 1 phone vendor despite recent struggles.\nBut the South Korean electronics giant is much more than just a phone maker. Samsung has a number of other high-profile businesses, and components may be chief among them. In fact, Samsung bucked a seven-quarter earnings slide in the third quarter this year thanks largely to its component business, which counts Apple among its largest customers.\nSamsung makes a portion of the new A9 chipsets that power Apple’s iPhone 6s and iPhone 6s Plus, and the company also manufactures a wide range of other components, including batteries. This past week at the annual InterBattery 2015 expo in Seoul, South Korea, Samsung showed off two new batteries that represent major steps forward in battery tech for mobile devices.\nDubbed “Stripe” and “Band,” these new Samsung batteries are thin and flexible, allowing them to fit into spaces and components that could otherwise not house a battery.\nThe new batteries are still in the prototype phase, but testing appears to be going quite well. According to Samsung, its new battery tech has the potential to increase battery life in some mobile devices by as much as 50%. Also of note, these new flexible batteries were able to withstand 50,000 bends during Samsung’s tests, suggesting durability will not be a concern.\nSamsung’s Band battery is designed to be housed in the flexible band of a smartwatch or fitness tracker, though its applications could certainly extend beyond those categories. Meanwhile, the Stripe battery can “bend and conform freely as a fiber and is equipped with innovative energy density,” according to Samsung .\nThe company continued, “Since it is adaptable to various forms – such as a necklace, hairband, t-shirt accessories, and more – it will in result fuel the growth of battery application market including wearables.”\n ", "external_links": ["http://www.businesswire.com/news/home/20151020005692/en/Samsung-SDI%E2%80%99s-Next-Gen-Wearable-Battery-Unpack%E2%80%A6Showing-Next-Generation", "https://www.facebook.com/FoxNewsSciTech", "http://bgr.com/tag/iphone-6s", "http://bgr.com/2015/10/22/iphone-6s-copy-htc-one-a9-statement/", "http://bgr.com/tag/samsung", "http://www.bgr.com/"], "published": "2015-10-23T03:00:00.000+03:00", "crawled": "2015-10-24T02:38:04.215+03:00", "highlightTitle": ""}