{"organizations": [], "uuid": "72891ad7fafc89ddb6d2ff8b81760506076bc2ef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "phys.org", "main_image": "http://cdn.phys.org/tmpl/v5/img/phys_308px.png", "site_section": "http://www.physorg.com/rss/rssbycategory.php?categ=16", "section_title": "Phys.org - latest science and technology news stories", "url": "http://phys.org/news/2015-10-big.html", "country": "US", "title": "How big data helps first responders", "performance_score": 0, "site": "phys.org", "participants_count": 0, "title_full": "How big data helps first responders", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T18:10:00.000+03:00", "replies_count": 0, "uuid": "72891ad7fafc89ddb6d2ff8b81760506076bc2ef"}, "author": "", "url": "http://phys.org/news/2015-10-big.html", "ord_in_thread": 0, "title": "How big data helps first responders", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Michael C. Powell"], "text": "How big data helps first responders October 6, 2015 by Michael C. Powell \nPolice officers and firefighters are leveraging big data to do their jobs more efficiently and more accurately. \nIn a life or death situation, it's discouraging to think that emergency services might not be able to locate someone in distress. According to a New York Times article, \"The Federal Communications Commission estimates more than 70 percent of 240 million annual 911 calls come from cellphones and 60 percent of those callers could not be accurately located.\" \nIn order to assist those in need, first responders need technology that won't fail them when it matters most. \nFire fighters and police officers can focus on solutions faster when they have almost instant access to traffic conditions, precise GPS data and visuals of locations, weather conditions, criminal records and other related information. \nFortunately, new apps help first responders leverage big data to do just that. \nOne such app is Incident Aware, which accesses GPS information to help law enforcement officers understand their location quickly—especially in confusing or dangerous situations. It even references crime history and escalation risks to help an officer better judge the most appropriate response. \nThe app logs incidents, number of nearby officers and a silent request for backup; it also presents real-time video feeds and information on a victim's status, as well as quick video scanning via Apple Watch. \nAnother first responder app is Active911, a digital messaging system that delivers alarms, maps and other essential information to first responders. Details such as the fastest traffic route, building floor plans or fire hydrant location are easily accessible; the app also allows a situation to be monitored in real time. \nNew apps are assisting law enforcement in other ways too. \nMutualink, is a communications platform that allows everyone from the NATO Special Operations Force to police and fire departments to share radio, voice, text, video, data files and telephone communications in a secure environment. The platform uses a private cloud that was instituted for first responders after the 9/11 attacks to avoid future communication issues like the ones firefighters had in 2001. \nIn a paperwork-heavy field, DroidLaw offers quick cloud access to a library of knowledge so officers don't need to slow down proceedings by pulling out a \"code book.\" The app, currently available in 18 states, also allows a user to search state penal codes for the right law or statute by keywords. \nTo help first responders detect chemical or biological threats, WISER (the Wireless Information System for Emergency Responders) provides a handheld library of indexed information for quick decision-making. The free app helps identify hazardous substances via physical characteristics and provides immediate health information, as well as best practices for containment. \nWhile instantly accessible information is helping law enforcement be more productive, new applications improve accuracy on the fly. Considering recent police controversies about the use of force, this technology provides an even more poignant purpose—helping officers make better decisions with better, quicker planning. \nImproving Community Communication \nEffective communication between law enforcement and the people they serve is crucial to keep everyone safe. \nMobile Patrol offers an app environment for regular people and police. \nCitizens can search recent bookings, sex offender registries, relevant social media and news stories, as well as submit anonymous tips and alerts in their neighborhood. Officers can quickly access records, solicit crime tips and broadcast photos or information on a wanted individual. \nUsing big data for law enforcement is a priority for the federal government. The Police Data Initiative , part of President Obama's Task Force on 21st Century Policing, aims to develop \"data-driven ways of improving community policing efforts and reducing uses of force.\" \nEfforts are already underway in 21 jurisdictions including Louisville, KY, Austin, TX, Atlanta, Charlotte, NC, and Camden, NJ. \nDespite the progress, some technological obstacles still get in the way. \nThe Camden County police department, for example, uses 41 different systems that have individual value but are not designed to work together, creating inefficiencies for both beat officers and data analysts. \nMaking Big Data Accessible and Transparent \nAnother data initiative city, Indianapolis, plans to address this technical issue head-on. The goal of the Code for America Indianapolis team is improve relationships between police departments and citizens. \n\"It's tough for police departments to be transparent about their work because they don't have the tools easily available to open up their data,\" said Indianapolis team member Laura Ellena. \n\"We're hoping by sharing this data about their interactions with the community, the conversation can be improved from arguing about what's happening to discussing solutions to the problems that everyone understand.\" \nCode for America plans to work with the city to develop a website that can provide context so that community groups who are not data experts can understand the information. \nEllena said they have measured specific metrics brought up by the President's task force, including response time, use of force, complaints against an officer and geolocation trends, among others. Both communities and police departments see great value in this data. \nOne area where the website can help is in use-of-force incidents. By determining the reason for the incident, Ellena explained, police departments can identify trends and implement training and education programs accordingly. \nStreamlining the cloud for police on the ground, however, is a little trickier, said team member Chris Reade. \n\"There are hundreds of radio and dispatch solutions out there,\" he said, noting that with so many departments, cross-country coordination is always a challenge. \"But with the accountability data that we're working on releasing with the city, there's a grip on the internal affairs market who use similar tools and databases to track information.\" \nUltimately, the Indianapolis police force hopes to provide a national model for data transparency and support for other cities. \n\"We can make it easier for more cities to embrace transparency around their policing so cities can understand how they're doing in relation to each other,\" Ellena said. \n\"This information can help [police] do their jobs better and see their departments succeed.\"", "external_links": [], "published": "2015-10-06T18:10:00.000+03:00", "crawled": "2015-10-06T18:20:14.381+03:00", "highlightTitle": ""}