{"organizations": ["U.S. Forest Service", "Lockheed Martin K-MAX"], "uuid": "b87ba83d805a9f7a54c5fc8a0b646c10fe13e7a5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "phys.org", "main_image": "http://cdn.phys.org/newman/gfx/news/2015/fedseyepilot.jpg", "site_section": "http://www.physorg.com/rss-feed/", "section_title": "Phys.org - latest science and technology news stories", "url": "http://phys.org/news/2015-10-feds-eye-pilotless-helicopters-wildfires.html", "country": "US", "title": "Feds eye pilotless helicopters to battle wildfires", "performance_score": 0, "site": "phys.org", "participants_count": 0, "title_full": "Feds eye pilotless helicopters to battle wildfires", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T01:53:00.000+03:00", "replies_count": 0, "uuid": "b87ba83d805a9f7a54c5fc8a0b646c10fe13e7a5"}, "author": "", "url": "http://phys.org/news/2015-10-feds-eye-pilotless-helicopters-wildfires.html", "ord_in_thread": 0, "title": "Feds eye pilotless helicopters to battle wildfires", "locations": ["Idaho", "Boise"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ridler", "Keith Ridler"], "text": "Feds eye pilotless helicopters to battle wildfires October 14, 2015 by By Keith Ridler A remote-controlled Lockheed Martin K-MAX helicopter takes off Wednesday, Oct. 14, 2015, from the U.S. Forest Service's Lucky Peak Helibase about 20 miles east of Boise, Idaho, with a water drop bucket during a successful demonstration of firefighting tasks. Federal officials say the helicopters that can operate without a pilot can fly in conditions too dangerous for manned flights and are needed to battle increasingly ferocious wildfires. (AP Photo/Keith Ridler) \nThe future of wildland firefighting launched Wednesday morning in Idaho. \nA Lockheed Martin helicopter capable of flying autonomously with no human control did so as it scooped up water, dropped it on targets and delivered supplies to a distant ridge in a demonstration in front of top federal decision makers 20 miles east of Boise. \n\"Wildland fires are a huge problem, particularly here in the West,\" said Mark Bathrick, director of the Interior Department's Office of Aviation Services. \"I'm a believer in the technology that could be put on other helicopters, that eventually could be put on fixed-wing aircraft—scoopers and air tankers.\" \nThe Lockheed Martin K-MAX put through its paces on Wednesday completed seven tasks in about an hour and a half. A safety pilot was aboard, often holding his hands aloft to indicate to about 200 observers that he wasn't using the controls. \nFederal officials, who are also considering other aeronautic companies for the choppers, say having an optionally manned aircraft has advantages in that a pilot can fly it from fire to fire. A pilot could also fly it on fires during the day when conditions are safe. \nThe problem is that firefighting from the air stops at night or when smoke reduces visibility to unsafe distances. A remote-controlled Lockheed Martin K-MAX sits Wednesday, Oct. 14, 2015, at the U.S. Forest Service's Lucky Peak Helibase about 20 miles east of Boise, Idaho, following a successful demonstration of firefighting tasks performed by the helicopter. Federal officials say the helicopters that can operate without a pilot can be flown in conditions too dangerous for manned flights and are needed to battle increasingly ferocious wildfires. (AP Photo/Keith Ridler) \nThe unmanned helicopter, though, has high-tech sensors allowing it to fly at night and in smoky conditions too dangerous for manned flights. That means at least tripling the amount of time aircraft could be attacking blazes. \n\"I'm highly confident (the helicopter) has the technology to be able to do that,\" said Dan Spoor, Lockheed Martin's vice president and general manager for Aviation and Unmanned Systems. \"If they bring in unmanned aircraft, they'll be able to do 24-7 flights. So it could be impressive in terms of helping fight fires.\" \nThe K-MAX demonstrated Wednesday has three communication methods, using line of sight and two different satellite links. The craft can be remotely controlled, but it also flies autonomously after being told what to do. \nEven if it loses contact with ground controllers, it can complete a task, officials said. It can also be programmed to fly to a specific landing zone on its own if it loses communication for a pre-set amount of time, such as 10 minutes. \n\"The technology of the auto-control for the aircraft is not really the hard part,\" Bathrick said. \"It's all this sensor technology that integrates with the autopilot to tell the helicopter where it's at.\" \nThe K-MAX itself is battle-tested, literally, having flown for three years in Afghanistan moving supplies so ground troops wouldn't have to risk traveling roads possibly rigged with improvised explosive devices. The flights covered as much as 85 miles. \nWildfires could possibly be more dynamic, with the helicopters tasked to make accurate water drops in multiple locations in short periods of time, often in areas with homes. If successful, Bathrick said, wildfires could be contained faster and losses to wildfires decreased. \n\"It will improve the safety of not only our ground firefighters, but the communities they're out there to protect,\" he said. \nThe K-MAX is considered comparatively inexpensive to fly at about $1,400 per hour, and Lockheed Martin officials said it also requires low maintenance time. \nBathrick said federal officials are still analyzing information, which will include results from Wednesday's demonstration. But he said pilotless aircraft could be flying above fire lines next summer.", "external_links": [], "published": "2015-10-15T01:53:00.000+03:00", "crawled": "2015-10-15T02:11:09.252+03:00", "highlightTitle": ""}