{"organizations": [], "uuid": "e871aba1911dbad7c8940e5617252322c5bd929c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eurekalert.org", "main_image": "http://media.eurekalert.org/multimedia_prod/pub/web/101810_web.jpg", "site_section": "http://www.eurekalert.org/rss/technology_engineering.xml", "section_title": "EurekAlert! - Technology, Engineering and Computer Science", "url": "http://www.eurekalert.org/pub_releases/2015-10/mtu-sml102215.php", "country": "US", "title": "Shining more light on solar panels", "performance_score": 0, "site": "eurekalert.org", "participants_count": 0, "title_full": "Shining more light on solar panels", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T07:00:00.000+03:00", "replies_count": 0, "uuid": "e871aba1911dbad7c8940e5617252322c5bd929c"}, "author": "", "url": "http://www.eurekalert.org/pub_releases/2015-10/mtu-sml102215.php", "ord_in_thread": 0, "title": "Shining more light on solar panels", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Shining more light on solar panels Improving low concentration photovoltaics \nIMAGE: Thermal radiation readings on panels help Joshua Pearce and his research team better understand ways to improve low-concentration photovoltaic systems. view more Credit: Joshua Pearce, Michigan Tech \nSolar panels are the beacon of renewable energy, yet they are not getting as much light as they could be. Joshua Pearce from Michigan Technological University and a team from Queen's University in Canada have found a way to get more sun to shine on the panels and crank up the output by 30 percent or more. \n\"We expend a lot of blood, sweat and tears to make solar panels as efficient as possible,\" Pearce says. \"We work so hard to get a fraction of a percent increase on the module level; double digit returns on the systems level was relatively easy.\" \nSuch a large increase of efficiency at the system level then could greatly change how solar panels are installed, and with the economic payback, it could even mean major retrofits for existing solar farms. \n\"We're looking at this from a systems perspective,\" Pearce says, who is an associate professor of materials science and engineering and electrical and computing engineering. He explains that the research focused on the system rather than individual panels mostly because the current set up for ground-mounted solar panel arrays is \"wasting space.\" \nThe iconic flat-faced solar panels installed in large-scale utility solar farms are spaced apart to prevent shading. As the sun shines on a photovoltaic system, sending electricity into the grid, a fair amount of that potential energy is lost as the light hits the ground between rows of panels. The solution is simple, says Pearce: Fill the space with a reflector to bounce sunlight back onto the panels and use the light-reflecting mathematical models of videogames and action movies to avoid temperature swings. ### \nThe work is published in Institute of Electrical and Electronics Engineers (IEEE) Journal of Photovoltaics and funded by Canada's National Sciences and Engineering Research Council. \nDisclaimer: AAAS and EurekAlert! are not responsible for the accuracy of news releases posted to EurekAlert! by contributing institutions or for the use of any information through the EurekAlert system.", "external_links": [], "published": "2015-10-22T07:00:00.000+03:00", "crawled": "2015-10-22T20:03:55.012+03:00", "highlightTitle": ""}