{"organizations": [], "uuid": "d824e155a6d70be3a243bb6518a2aec59c6410da", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.technology.org", "main_image": "http://www.technology.org/texorgwp/wp-content/uploads/2015/09/Arctic_Ice_2-720x479.jpg", "site_section": "http://feeds.feedburner.com/TechnologyOrgGeoscienceEnvironmentNews", "section_title": "Technology Org » Geoscience & Environment news", "url": "http://www.technology.org/2015/10/23/chipping-away-at-the-secrets-of-ice-formation/", "country": "", "title": "Chipping away at the secrets of ice formation", "performance_score": 0, "site": "technology.org", "participants_count": 1, "title_full": "Chipping away at the secrets of ice formation", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T09:05:00.000+03:00", "replies_count": 0, "uuid": "d824e155a6d70be3a243bb6518a2aec59c6410da"}, "author": "Alius Noreika", "url": "http://www.technology.org/2015/10/23/chipping-away-at-the-secrets-of-ice-formation/", "ord_in_thread": 0, "title": "Chipping away at the secrets of ice formation", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Chipping away at the secrets of ice formation Posted Today \nMaking ice to chill our drinks is easy enough, but surprisingly, the details of that seemingly simple process are still not well understood. Now scientists report in the Journal of the American Chemical Society that they have unlocked some of ice’s mysteries while debunking a major assumption about the process. The findings could help us better understand how water freezes, which has significant implications for climate science, air travel and cryopreservation. Arctic Ice. Image credit: Wikimedia Commons \nWhen it comes to water for drinking and cooking, cleaner is better. But when it comes to cloud formation and rain and snow, impurities are a big help. Tiny particles such as dust, soot, pollen and even bacteria give water a seed to crystalize around. Without them, water can remain liquid even at temperatures below its freezing point. So what kinds of particles work best to promote ice formation? Angelos Michaelides and colleagues searched for an answer. \nUsing computer models of simple crystalline particle surfaces, the researchers pinpointed how their structures and their interactions with water on a molecular level impact ice crystallization. A commonly held assumption was that if a particle’s surface structure is similar to that of ice, it acts as a template for water molecules and encourages ice to form. \nBut the team found that a surface that acts as a template for one ice face will not necessarily act as a template for another. And two identical surfaces can result in ice crystals in three different orientations. In addition to informing the more obvious fields of climate science and cryopreservation, the researchers say their results could help guide the future design of materials to prevent ice formation, for example, on airplane wings.", "external_links": [], "published": "2015-10-23T09:05:00.000+03:00", "crawled": "2015-10-23T09:42:28.625+03:00", "highlightTitle": ""}