{"organizations": [], "uuid": "cc28b5949f5465e8f7f592562fa042ea3f7661e0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweek.com", "main_image": "http://cached.imagescaler.hbpl.co.uk/resize/scaleHeight/150/offlinehbpl.hbpl.co.uk/news/ORP/StarWars-20151019095227851.png", "site_section": "http://www.prweekus.com/rss/us/technology", "section_title": "PR Week Global 2014 Technology RSS Feed", "url": "http://www.prweek.com/article/1368832/star-wars-episode-vii-pr-activity-ramps-official-posters-teasers-tickets", "country": "US", "title": "Star Wars: Episode VII PR activity ramps up with official posters, teasers and tickets", "performance_score": 0, "site": "prweek.com", "participants_count": 0, "title_full": "Star Wars: Episode VII PR activity ramps up with official posters, teasers and tickets", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T11:33:00.000+03:00", "replies_count": 0, "uuid": "cc28b5949f5465e8f7f592562fa042ea3f7661e0"}, "author": "", "url": "http://www.prweek.com/article/1368832/star-wars-episode-vii-pr-activity-ramps-official-posters-teasers-tickets", "ord_in_thread": 0, "title": "Star Wars: Episode VII PR activity ramps up with official posters, teasers and tickets", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tweet \nDisney has unveiled the official poster for The Force Awakens and has given cinemas across the UK the green light to put tickets on sale, generating plenty of buzz on social media. \nThe Star Wars hashtag has nearly 200,000 mentions and counting on Twitter, with fans also eagerly awaiting the third teaser trailer. \nDisney has received a helping hand from the parody Death Star PR account, which has posted one of the most popular tweets so far. We're b ck! Death Star 3.0 - because if at first you don't succeed, try, try again. #StarWars #TheForceAwakens pic.twitter.com/wcr9opf92f — Death Star PR (@DeathStarPR) October 19, 2015 \nThe omission of Luke Skywalker from the official poster has been a major talking point. #StarWarsTheForceAwakens poster reveals the new Death Star, but where's Luke? http://t.co/CX5IiISoEu pic.twitter.com/NWNkfJa2Nf — Radio Times (@RadioTimes) October 19, 2015 Star Wars released this official poster, with new characters, but missing Luke Skywalker pic.twitter.com/g57vP4inis — BBC Newsbeat (@BBCNewsbeat) October 19, 2015 I guess I can rant about the new @StarWars icon tags and why is Luke not on the poster? #thatFisherwomannodoubt — William Shatner (@WilliamShatner) October 19, 2015 \nThere has been huge demand for tickets with UK cinema chains Odeon, Cineworld and Vue all experiencing website difficulties this morning. Apologies to all Star Wars fans. A problem affecting all Cineworld sites means times aren't online yet. They should be very shortly... — Cineworld Telford (@Cine_Telford) October 19, 2015 Odeon cinemas online servers this morning as Star Wars tickets go on sale #starwars #forceawakens #tickets pic.twitter.com/Dr6T7KYTpO — Phil (@philnewts) October 19, 2015 \nIn a statement, an Odeon spokesperson told PRWeek that it had experienced a peak in traffic, with customers booking tickets for the latest James Bond film Spectre as well as The Force Awakens. \n\"Having removed our online booking fees earlier this year, we knew this morning would be very busy and did as much as we could to prepare. Thousands of guests have already successfully bought their tickets,\" the spokesperson said. \n\"There have been some booking delays in the initial peak, but our website is now returning to normal speed. Odeon will become a 24-hour operation for Spectre and Star Wars: The Force Awakens, with films shown throughout the night in dozens of our cinemas – so there will be lots of opportunities for our guests to book ahead and see the films as soon as they're launched.\" \nFans still have more to look out for – Disney will premiere the official trailer for the film to a US audience later today during ESPN's Monday Night Football. Teasers of the trailer have already been released. Battle approaches in the latest #StarWars teaser trailer http://t.co/nhcup489WD pic.twitter.com/y4Spy91edN", "external_links": [], "published": "2015-10-19T11:33:00.000+03:00", "crawled": "2015-10-20T01:17:32.961+03:00", "highlightTitle": ""}