{"organizations": [], "uuid": "deee35d71508b4c804a765499439ed92e7f9d57f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "phys.org", "main_image": "http://cdn.phys.org/tmpl/v5/img/phys_308px.png", "site_section": "http://www.physorg.com/rss/rssbycategory.php?categ=16", "section_title": "Phys.org - latest science and technology news stories", "url": "http://phys.org/news/2015-10-vice-media-eyes-tv-channels.html", "country": "US", "title": "Vice Media eyes TV channels in latest expansion", "performance_score": 0, "site": "phys.org", "participants_count": 0, "title_full": "Vice Media eyes TV channels in latest expansion", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T02:50:00.000+03:00", "replies_count": 0, "uuid": "deee35d71508b4c804a765499439ed92e7f9d57f"}, "author": "", "url": "http://phys.org/news/2015-10-vice-media-eyes-tv-channels.html", "ord_in_thread": 0, "title": "Vice Media eyes TV channels in latest expansion", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Vice Media eyes TV channels in latest expansion October 23, 2015 \nVice Media is readying plans to launch a US TV network, and a dozen in Europe next year, as the fast-growing digital video news network moves in on traditional media. \nCo-founder Shane Smith said Vice is in expansion mode, now is in 28 countries, and is connecting with viewers on various platforms. \n\"We want to be able to go to our brands and say we can do TV, we can do mobile, we can do online...we can do everything,\" Smith told CNBC in an interview this week. \nSmith offered no details on the plans. But the New York Post reported this year that Vice was set to acquire the History Channel's H2 cable channel from A&E for its own programming. \nVice declined to respond to an AFP query on its expansion plans. \nVice, which traces its origins to a magazine in Canada, earlier this year launched its own channel in partnership with Canadian-based Rogers Communications, which is producing news , drama, documentaries and programming aimed at the 18-to-34 viewer. \nSmith said Vice's revenue is on track to hit $1 billion this year and to double over the next two years. He said acquisition talks have been held \"at a valuation of $5 billion\" for the Brooklyn-based media group \n\"We're sort of topping out the valuation that a media company could buy us,\" he told CNBC. \n\"And once you get into the next wave it's either the major telco or Apple or Google. Then you have to look at well if we become to expensive for media, do we go public?\" \nEven though moving into television will be expensive, Smith said it makes sense because that its still a major source of ad revenue. \nHe said the company could be a \"content creation engine\" for many platforms. \n\"So you can actually take money from TV and put it into mobile, which is quite frankly more difficult to monetize,\" he added. \nVice, which has raised more than $500 million in funding, gained notoriety for sending former NBA star Dennis Rodman to North Korea in 2013. \nIt also won praise for a five-part documentary on the inner workings of IS, the militant Islamist group in the Middle East. \nVice operates a popular YouTube channel and also produces news programming for Time Warner's HBO. In France it produces a daily news segment for France 4 television. \n'It's vindication' \nWhile Vice has cultivated a \"bad boy\" image, its success has captured the attention of the media world as it connects with young audiences. \n\"When we first started with news everyone said, 'oh, Vice is doing news' and sort of look down their nose at us and now Netflix is saying, well, we're going to do a Vice News, The New York Times is saying we're going to do Vice News,\" Smith said. \n\"A year ago, everybody was laughing at us. It's vindication.\" \nInvestors in Vice include the Murdoch family's 21st Century Fox, cable channel A&E and the Technology Crossover Venture fund.", "external_links": [], "published": "2015-10-24T02:50:00.000+03:00", "crawled": "2015-10-24T03:03:14.825+03:00", "highlightTitle": ""}