{"organizations": [], "uuid": "c5bdb96dd71b5f6db466e1ae119f38894ef05585", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1142259/frequency540-names-tom-quish-creative-director", "country": "US", "title": "Frequency540 Names Tom Quish Creative Director", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "Frequency540 Names Tom Quish Creative Director", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T19:37:00.000+03:00", "replies_count": 0, "uuid": "c5bdb96dd71b5f6db466e1ae119f38894ef05585"}, "author": "admin", "url": "http://www.freshnews.com/news/1142259/frequency540-names-tom-quish-creative-director", "ord_in_thread": 0, "title": "Frequency540 Names Tom Quish Creative Director", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Submitted by admin on 10/19/2015 @ 9:37 AM   Frequency540 \nCHICAGO, Oct. 19, 2015 /PRNewswire/ -- Independent digital marketing agency Frequency540 (FQ540) has hired veteran creative talent Tom Quish to oversee creative content and campaign development for a number of its ambitious clients. \nhttps://photos.prnewswire.com/prnvar/20151019/278182 \nQuish, former Razorfish creative director, will lead all creative for the Chicago-based agency's work with Lincoln Park Zoo and Jackson Hewitt, focusing on custom content creation and acquisition efforts. He will also oversee creative campaign development for the agency's social impact portfolio, driving attention to issues related to global poverty, education and equality. \nIn his more than 15 years of experience, Quish has led award-winning digital work for leading brands including Oreo, Kellogg's, AT&T and Caterpillar. \n\"Tom is known for inspiring and motivating cross-functional teams to create experiences that resonate with people. His skills are a great fit with the work we do here,\" said FQ540 CEO Andrew Swinand. \nQuish touts the opportunity as a chance to create highly targeted content designed to build relevance with discrete audiences. \"I chose Frequency540 because they understand that customized content is the future of digital marketing.\" \nQuish's experience includes nearly a decade at Razorfish, where he began as a senior designer before working his way up to creative director. Prior to Razorfish, he worked as a graphic designer for Slattery Design Group and Cagney + Dowell. Quish attended Valparaiso University, where he studied art and English. \nFREQUENCY540Frequency540 (FQ540) is a digital marketing agency dedicated to helping brands matter more. FQ540 uses behavioral analytics to pinpoint what really matters to people, and then creates personalized experiences that give them a reason to care. FQ540 is part of the Abundant Venture Partners portfolio--an organization that believes doing well and doing good in business are not mutually exclusive. For more information, visit www.fq540.com . \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/frequency540-names-tom-quish-creative-director-300161990.html \nSOURCE Frequency540", "external_links": [], "published": "2015-10-19T19:37:00.000+03:00", "crawled": "2015-10-19T21:15:55.940+03:00", "highlightTitle": ""}