{"organizations": [], "uuid": "224b678d907222b1358ee56dac452400db0cb782", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1143468/renewable-energy-uncaps-power-atmospheric-water-generation", "country": "US", "title": "Renewable Energy Uncaps the Power of Atmospheric Water Generation", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "Renewable Energy Uncaps the Power of Atmospheric Water Generation", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T15:25:00.000+03:00", "replies_count": 0, "uuid": "224b678d907222b1358ee56dac452400db0cb782"}, "author": "admin", "url": "http://www.freshnews.com/news/1143468/renewable-energy-uncaps-power-atmospheric-water-generation", "ord_in_thread": 0, "title": "Renewable Energy Uncaps the Power of Atmospheric Water Generation", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Submitted by admin on 10/21/2015 @ 5:25 AM Companies mentioned in this article: Frost & Sullivan \nMOUNTAIN VIEW, Calif., Oct. 21, 2015 /PRNewswire/ -- The looming global water crisis and the rapid pace of climate change has heightened interest in atmospheric water generation (AWG) technology. Where water purification is not a practical solution and in places with little access to conventional water sources, AWG is a 'magic solution.' \nPhoto - http://photos.prnewswire.com/prnh/20151020/278848 \nRecent analysis from Frost & Sullivan, Technology Breakthroughs Shaping the Future of Atmospheric Water Generation ( http://www.frost.com/d64e ), finds that harvesting water from the air using solar energy will go a long way in mitigating the main consequences of climate change. \nFor complimentary access to more information on this research, please visit: http://bit.ly/1VQrbwD \nThe key to the success of AWG technology is the total use of renewable energy. One of the most impactful applications is large-scale solar AWG for desert re-vegetation and agriculture. \nAWG can produce water where there is none at all, so it comes as no surprise that the Middle East is one of its adoption hotspots. Furthermore, as it eliminates the burden of transporting water, it finds significant application in the army, areas that need disaster relief, offshore oil rigs, and in all water-scare regions, irrespective of their economic status. \nHowever, AWG systems are notoriously energy-hungry. The vast amounts of energy required to generate water from the atmosphere puts it at odds with the current trend of energy conservation. \n\"Recent breakthroughs in energy-efficient technologies promise a brighter future for this once-ancient practice of obtaining water,\" noted TechVision Research Analyst Jennifer Tan . \"Other processes and technologies that have given a boost to AWG adoption are advanced controls, effective disinfection, materials replacement and commercial water production machines.\" \nAnother issue that is dampening the sales of AWG systems is the skepticism of end users, who are still largely ignorant of the technology. Moreover, its capital costs are higher than those of conventional and familiar water purification technologies. As people are used to having water free, they are unwilling to install and maintain a machine to obtain water. \nTo enhance technology uptake, industry participants are developing AWG systems that can be run on renewable energy for both large-scale (farms, communities and municipalities) and small-scale (for households and offices) applications. This will make the technology more environmentally sustainable, at lower operating costs, while meeting the need for clean water. \n\"Key industry participants believe that as the market acceptance increases, the costs of AWG systems will reduce, making it a commercially feasible technology,\" observed Tan . \nTechnology Breakthroughs Shaping the Future of Atmospheric Water Generation , a part of the TechVision ( http://ww2.frost.com/research/technology/sustainable-energy ) subscription, provides value chain analysis, market size and potential, technology developers and regional footprint, the gaps in the AWG industry, innovations enabling the future of the AWG technology, a technology roadmap and market impact analysis. TechVision is an international technology analysis business that produces a variety of technical news alerts, newsletters, and studies. \nFrost & Sullivan's global TechVision practice is focused on innovation, disruption and convergence that provides a variety of technology-based alerts, newsletters and research services as well as growth consulting services. Its premier offering, the TechVision program, identifies and evaluates the most valuable emerging and disruptive technologies-enabling products with near-term potential. A unique feature of the TechVision program is an annual selection of 50 technologies that can generate convergence scenarios, possibly disrupt the innovation landscape, and drive transformational growth. View a summary of our TechVision program by clicking on the following link: http://ifrost.frost.com/TechVision_Demo . \nAbout Frost & Sullivan \nFrost & Sullivan, the Growth Partnership Company, works in collaboration with clients to leverage visionary innovation that addresses the global challenges and related growth opportunities that will make or break today's market participants. \nOur \"Growth Partnership\" supports clients by addressing these opportunities and incorporating two key elements driving visionary innovation: The Integrated Value Proposition and The Partnership Infrastructure. -- The Integrated Value Proposition provides support to our clients throughout all phases of their journey to visionary innovation including: research, analysis, strategy, vision, innovation and implementation. -- The Partnership Infrastructure is entirely unique as it constructs the foundation upon which visionary innovation becomes possible. This includes our 360 degree research, comprehensive industry coverage, career best practices as well as our global footprint of more than 40 offices. \nFor more than 50 years, we have been developing growth strategies for the global 1000, emerging businesses, the public sector and the investment community. Is your organization prepared for the next profound wave of industry convergence, disruptive technologies, increasing competitive intensity, Mega Trends, breakthrough best practices, changing customer dynamics and emerging economies?", "external_links": [], "published": "2015-10-21T15:25:00.000+03:00", "crawled": "2015-10-21T16:11:59.737+03:00", "highlightTitle": ""}