{"organizations": [], "uuid": "8fb74df6f356b9813e05d6ca0ab7c11fa90b7ae9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.morningstar.com", "main_image": "", "site_section": "http://news.morningstar.com/all/dow-jones/technology.aspx", "section_title": "News Archive: Technology", "url": "http://news.morningstar.com/all/dow-jones/technology/201510123278/dell-to-buy-emc-for-67-billion-2nd-update.aspx", "country": "US", "title": "Dell to Buy EMC for $67 Billion --2nd Update", "performance_score": 0, "site": "morningstar.com", "participants_count": 1, "title_full": "Dell to Buy EMC for $67 Billion --2nd Update", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "8fb74df6f356b9813e05d6ca0ab7c11fa90b7ae9"}, "author": "morningstar.com", "url": "http://news.morningstar.com/all/dow-jones/technology/201510123278/dell-to-buy-emc-for-67-billion-2nd-update.aspx", "ord_in_thread": 0, "title": "Dell to Buy EMC for $67 Billion --2nd Update", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Lisa Beilfuss\nDell Inc. and private-equity firm Silver Lake will buy EMC Corp. for roughly $67 billion in cash and stock, marking one of the largest technology-industry takeovers ever.\nThe $33.15 a share price tag represents a 19% premium over Friday's closing price for EMC.\nDell said it expects to fund the deal through a combination of new common equity from Chief Executive Michael Dell, Silver Lake and other, the issuance of tracking stock, as well as new debt financing and cash on hand. There are no financing conditions to the closing of the transaction, Dell said. Dell recently reported that it had about $12 billion of debt.\nThe companies expect to complete the transaction between May and October of 2016. Dell said the combined company \"will focus on rapidly de-levering\" in the first 18 to 24 months after the deal closes.\nThe Wall Street Journal had reported last week that the companies were in talks to merge.\nJoe Tucci, EMC's long-time Chief Executive, will be chairman and CEO of EMC until the transaction closes. Upon completion, Mr. Dell will lead the combined company as chairman and CEO. Mr. Tucci, 68 years old, has considered giving up the CEO spot for several years and had previously said he and fellow directors might settle the succession question by February 2015.\nVMware, in which EMC owns about 80%, will remain a publicly traded company. EMC holders will receive $24.05 a share in cash and in addition to tracking stock linked to a portion of EMC's economic interest in the VMware business. VMware has a market value of about $33 billion. Dell said EMC shareholders are expected to receive about 0.111 shares of new tracking stock for each EMC share. Shares of VMware closed at $78.65 Friday.\nThe value of the tracking stock may vary from the market price of VMware given the different characteristics and rights of the two stocks, Dell said.\nEMC said late last year that it was exploring strategic options. The company has been under pressure to boost its stock price since last year, when activist hedge fund Elliott Management Corp. took a roughly 2% stake in the company and urged it to spin off VMware, which has a market value of $34 billion. An arrangement struck in January between Elliott and EMC that had barred the fund from publicly pressuring EMC expired last month.\nThe tie up comes about two years after Dell went private in a roughly $25 billion buyout by its founder, Mr. Dell, and Silver Lake. Dell has since pivoted from personal computers, pinched by demand for tablets and smartphones, toward more-profitable areas like storage and security. The EMC acquisition helps cement Dell's transition from a consumer-facing company to one focused on technology for large companies, and it gives it the breadth to compete more effectively with larger companies such as International Business Machines Corp., Hewlett-Packard Co., Cisco Systems Inc. and Oracle Corp.\nEMC had earlier been in talks with Dell, The Wall Street Journal reported last September. The Hopkinton, Mass., company also had been in discussions about a merger with Hewlett-Packard Co., which ended before H-P announced plans to split itself in two in October 2014.\nWrite to Lisa Beilfuss at lisa.beilfuss@wsj.com\nSubscribe to WSJ: http://online.wsj.com?mod=djnwires\n 12, 2015 07:51 ET (11:51 ", "external_links": ["http://im.mstar.com/Im/Mbr/Form_PremCheckbox_Checked.gif", "http://s7.addthis.com/static/btn/sm-share-en.gif", "http://www.addthis.com/bookmark.php?v=250", "http://im.mstar.com/Im/Mbr/Form_PremCheckbox_Unchecked.gif"], "published": "2015-10-12T03:00:00.000+03:00", "crawled": "2015-10-12T17:00:52.610+03:00", "highlightTitle": ""}