{"organizations": [], "uuid": "773b982521ce6748ba48bb09b81c5c78ad2954d3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.gizmag.com", "main_image": "http://img.gizmag.com/youtube-red-1.jpg?fit=max&h=594&rect=0%2C0%2C1919%2C1079&w=1060&s=be79aed7e3aff8037655dae5d399aab5", "site_section": "http://feeds.feedblitz.com/Gizmag", "section_title": "Gizmag Emerging Technology Magazine", "url": "http://www.gizmag.com/youtube-red/39997/", "country": "US", "title": "YouTube Red ditches ads, offers original content – for a monthly fee", "performance_score": 0, "site": "gizmag.com", "participants_count": 1, "title_full": "YouTube Red ditches ads, offers original content – for a monthly fee", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T14:40:00.000+03:00", "replies_count": 0, "uuid": "773b982521ce6748ba48bb09b81c5c78ad2954d3"}, "author": "Stu Robarts", "url": "http://www.gizmag.com/youtube-red/39997/", "ord_in_thread": 0, "title": "YouTube Red ditches ads, offers original content – for a monthly fee", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "October 22, 2015 \nYouTube Red will allow users to watch videos without ads, but there's a cost \nYouTube has announced a new paid service call YouTube Red. It will allow users to watch videos without adverts, save videos for watching offline later, continue playing videos in the background when viewing other mobile apps and will also feature original YouTube content. \nDespite its size, Google-owned YouTube has found it somewhat difficult to monetize its content and the launch of YouTube Red is an attempt to improve this. The service appears to be the offspring of Google Music Key , which never left beta, and is another example of Google using the removal of ads as an incentive for paid subscription sign-up. \nYouTube also has its eye on competing with the likes of Netflix, but needs to produce high-quality original content that it can offer to paying members in order to do that. Not only will the new service be a means of monetizing videos on YouTube, but it will help to fund the production of the original content that YouTube needs in order to position itself as a premium video channel. \nTo whet the appetite of potential subscribers, YouTube has announced a first wave of original content that will be available via YouTube Red from next year. It includes series and movies from some of \"YouTube’s biggest creators.\" \nAmong the newly-announced fodder is Scare PewDiePie , a reality-adventure series in which YouTube star PewDiePie encounters terrifying situations inspired by his favorite video games; Sing It! , a scripted comedy satirizing reality singing competitions; and Lazer Team , a feature-length action-comedy about four small-town losers who stumble upon an alien ship carrying a mysterious cargo and become embroiled in a battle to save Earth as a result. \nYouTube Red will cost subscribers $9.99 a month and the membership extend across YouTube services to include its recently announced YouTube Gaming app and a new YouTube Music app. Red subscribers will also gain access to Google Play for Music, and vice versa. \nA one-month free trial of YouTube Red will be available in the US from Oct. 28, with YouTube promising to bring the service to other countries soon. \nThe video below provides an introduction to YouTube Red.", "external_links": [], "published": "2015-10-22T14:40:00.000+03:00", "crawled": "2015-10-22T15:41:44.296+03:00", "highlightTitle": ""}