{"organizations": [], "uuid": "414de3d85e61e028f3810e366a98d7dc8bfad014", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1143291/violin-memory-kicks-off-oracle-openworld-showcasing-its-flash-storage-platform-with-sp", "country": "US", "title": "Violin Memory Kicks Off Oracle OpenWorld Showcasing Its Flash Storage Platform With Special Appearances By 49ers Football Legends", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "Violin Memory Kicks Off Oracle OpenWorld Showcasing Its Flash Storage Platform With Special Appearances By 49ers Football Legends", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T13:00:00.000+03:00", "replies_count": 0, "uuid": "414de3d85e61e028f3810e366a98d7dc8bfad014"}, "author": "admin", "url": "http://www.freshnews.com/news/1143291/violin-memory-kicks-off-oracle-openworld-showcasing-its-flash-storage-platform-with-sp", "ord_in_thread": 0, "title": "Violin Memory Kicks Off Oracle OpenWorld Showcasing Its Flash Storage Platform With Special Appearances By 49ers Football Legends", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  Violin Memory, Inc. \nSANTA CLARA, CA--(Marketwired - October 21, 2015) - Violin Memory®, Inc. , (NYSE: VMEM) a global pioneer of award-winning all flash storage platform solutions for primary storage and active workloads, will showcase its game changing Flash Storage Platform™ (FSP) at the 2015 Oracle OpenWorld Conference and Exhibition October 25-29, at the San Francisco Moscone Center, South Hall, Booth #1531. The company will be joined by its customer -- The San Francisco 49ers with football greats Guy McIntyre, Jerry Rice, and Bubba Paris. What: 49ers Alumni Meet and Greet with Autographs The Violin Memory 7300 FSP is currently installed in the team's data center at Levi's® Stadium to optimize and protect the organization's digital assets. Hear from 49ers Alumni as they recount team successes and talk about the superior fan experience offered at the NFL's most advanced-technology stadium and 2016 Super Bowl host. Who/When: -- Guy McIntyre -- Monday, October 26, 1:00-2:00 pm -- Jerry Rice -- Tuesday, October 27, 1:30-2:30 pm -- Bubba Paris -- Wednesday, October 28,1:00-2:00 pm Where: Mascone Center, South Hall, Booth #1531 What: In-Booth Demonstrations Company experts show new techniques that improve data center storage, security and management leveraging Violin FSP solutions. -- Heavy Write Workload with Oracle Database See how the Violin FSP performs under a heavy write workload. This demonstration also showcases the Violin Symphony Management UI illustrating the simplicity with which customers can manage their Violin installations. -- The Value of Consistent Application Backup and Recovery with Flash Featuring Violin Memory host agents for Oracle databases for application consistent snapshots on Violin's FSP. Application consistency means no lost transactions in your database when snapshots are taken -- there is no interruption, no pause, nothing to flush -- come see why. When: October 26-27, 10:15 am -- 6:00 pm, and October 28, 10:15 am -- 4:15 pm. What: In-Booth Presentations Game on -- discover the value that an all-flash data center can deliver to your organization. -- Disk is Dead: Why A Purpose Built Flash Architecture Matters Examine the business impact when disk and hybrid arrays fail to deliver the requisite I/O performance and data protection today's workloads demand. Explore the ability of purpose-built, fully integrated flash storage platforms to meet the challenge. Who: Steve Bohac, Director, Product Marketing When: Monday, October 26, 3:00 pm, and Tuesday, October 27, 1:00 pm. -- The Value of Consistent Application Backup and Recovery with Flash Hear about Violin Memory host agents for Oracle databases. Application consistency means no lost transactions in your database when snapshots are taken -- there is no interruption, no pause, nothing to flush -- come see why. Who: Nathan Fuzi, Systems Engineer When: Monday, October 26, 11:00 am, and Tuesday, October 27, 11:00 am. Contact:", "external_links": [], "published": "2015-10-21T13:00:00.000+03:00", "crawled": "2015-10-21T14:00:55.757+03:00", "highlightTitle": ""}