{"organizations": ["Toshiba"], "uuid": "c8c0eda23a05fe0dabb0bab00e503764c5c8b194", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "techon.nikkeibp.co.jp", "main_image": "", "site_section": "http://techon.nikkeibp.co.jp/english/index.rdf", "section_title": "Nikkei Technology Online : tech news - straight from Asia.", "url": "http://techon.nikkeibp.co.jp/atclen/news_en/15mk/100900091/?n_cid=nbptec_tecrs", "country": "JP", "title": "Hydrogen Production/storage System Realizes Energy Self-sufficiency at Hotel", "performance_score": 0, "site": "nikkeibp.co.jp", "participants_count": 0, "title_full": "Hydrogen Production/storage System Realizes Energy Self-sufficiency at Hotel", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T02:18:00.000+03:00", "replies_count": 0, "uuid": "c8c0eda23a05fe0dabb0bab00e503764c5c8b194"}, "author": "", "url": "http://techon.nikkeibp.co.jp/atclen/news_en/15mk/100900091/?n_cid=nbptec_tecrs", "ord_in_thread": 0, "title": "Hydrogen Production/storage System Realizes Energy Self-sufficiency at Hotel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kenji Kaneko"], "text": "Hydrogen Production/storage System Realizes Energy Self-sufficiency at Hotel Hydrogen Production/storage System Realizes Energy Self-sufficiency at Hotel 2015/10/09 23:18 Kenji Kaneko, Nikkei BP CleanTech Institute An image of the H2One's container (source: Toshiba) \nToshiba Corp announced that it has received an order for its \"H2One\" stand-alone hydrogen energy supply system from Huis Ten Bosch (theme park). \nThe system will be installed at the \"second-phase building\" of the \"Henna (Weird) Hotel\" smart hotel scheduled to open in March 2016. This is the first order for the system. \nThe H2One stores surplus solar electricity as hydrogen and converts it to electricity by using a fuel cell as necessary to absorb the output fluctuation of a solar power generation system caused by changes in the amount of sunlight. \nThis time, Toshiba designed the hydrogen energy supply system for use in resort facilities. It realizes energy self-sufficiency in hotel/resort facilities by using renewable energy and hydrogen even in areas where there are not enough energy infrastructures. \nFor example, the H2One can produce hydrogen by using surplus solar electricity during summer, when there are long hours of sunlight, and store it in a hydrogen tank. The stored hydrogen can be used during winter, when the amount of sunlight decreases, to generate electricity by using a fuel cell in the aim of stably supplying the amount of electricity consumed by a hotel building throughout a year. \nThe H2One to be introduced this time is equipped with a hydrogen absorbing alloy, which can store hydrogen with a high density, as a hydrogen tank. The size of the alloy is about 1/10 that of conventional hydrogen tanks, making it easy to introduce the system even in places with a limited area, Toshiba said. \nThe \"first-phase building\" of the \"Henna Hotel\" opened July 17, 2015, and the second-phase building is scheduled to open in March 2016. Cutting-edge technologies have been actively employed for the hotel by, for example, using robot receptionist, porter, cloakroom attendant, etc. Also, it is environmentally conscious. \nToshiba intends to design the H2One in accordance with use situation such as \"BCP (business continuity plan) model,\" \"resort model,\" \"isolated island model\" and \"office model,\" planning to sell it as solutions that use hydrogen for storing renewable energy to realize local production for local consumption ( See related article ).", "external_links": [], "published": "2015-10-10T02:18:00.000+03:00", "crawled": "2015-10-10T10:21:03.645+03:00", "highlightTitle": ""}