{"organizations": [], "uuid": "ee779165e6ef2378c1da8506010924b5b79e01cf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theaustralian.com.au", "main_image": "http://resources0.news.com.au/images/2015/10/16/1227571/765552-2c398242-73bc-11e5-9022-b1fac89549f0.jpg", "site_section": "http://www.theaustralian.com.au/business/technology", "section_title": "TECHNOLOGY | Australian IT News &amp; Technology | The Australian | The Australian", "url": "http://www.theaustralian.com.au/life/weekend-australian-magazine/id-waited-all-my-life-to-see-angkor-and-it-was-worth-it/story-e6frg8h6-1227571765579", "country": "US", "title": "I’d waited all my life to see Angkor – and it was worth it | Executive Living | The", "performance_score": 0, "site": "theaustralian.com.au", "participants_count": 1, "title_full": "I’d waited all my life to see Angkor – and it was worth it | Executive Living | The Australian", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T08:00:00.000+03:00", "replies_count": 0, "uuid": "ee779165e6ef2378c1da8506010924b5b79e01cf"}, "author": "The Australian", "url": "http://www.theaustralian.com.au/life/weekend-australian-magazine/id-waited-all-my-life-to-see-angkor-and-it-was-worth-it/story-e6frg8h6-1227571765579", "ord_in_thread": 0, "title": "I’d waited all my life to see Angkor – and it was worth it | Executive Living | The", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The lengthily bit being particularly important as HM is now in his 60s, unmarried and unlikely to sire a princeling. Countdown to a constitutional crisis.\nKings reign supreme in Khmer history and mythology, particularly those who built the temples at Angkor, as in Wat. Next to foreign aid (including dubious and derided deals involving refugees from Nauru), Angkor is the nation’s biggest source of income. Two million tourists a year fly directly to nearby Siem Reap, which is now a Vegas-style city of lurid four- and five-star hotels.\nFew bother to visit the unlovely and fear-filled capital Phnom Penh, where the air is more polluted by the toxicity of corruption than the halitosis of industry – dramatised by automotive exhibitionism. One expects the odd Porsche or Mercedes, but not the fact that literally every second car in the gridlocked traffic is a top-of-the-line Lexus. And the country is led by a despicable government, helmed for the past 30 years by Prime Minister Hun Sen, a former Khmer Rouge thug.\nSo Cambodia ceaselessly throws out the Angkor to steady the leaking ship of state. It’s on the currency, the stamps and the flag. It’s the name of an airline, the top-selling beer. I’ve been waiting to see Angkor all my life – and it was worth the wait.\nThe Pharaohs piled up well over 100 pyramids – with hundreds more in the upstream Kingdom of Kush. And you could fit the lot of them into the vast precincts of Angkor, along with scores more contemporaneous efforts in Mesoamerica. The Khmer building boom peaked after the 12th century – when the Gothic cathedrals were soaring in Europe. As Khmer kings sought to honour the gods and themselves, Angkor became the mightiest city on Earth, much more than a place of royal and religious hubris, with a million people working the ingeniously irrigated paddies. Until the jungle ate it alive – as a result of what? War? Disease? Climate change? Probably all of the above.\nSoon filaments of foliage found their way into every fissure, every nook and cranny of lovingly sculptured stone, growing into vast Jack-style beanstalks. And if there are giants atop they’re in good company – Angkor is a place of and for giants. Its temples writhe in the grip of roots like boa constrictors that swallow statues and suffocate stupas. Some trees have entirely consumed temples from within – now simultaneously holding them together and tearing them apart. Only Angkor Wat, the main temple complex, has been largely restored. Many of the others – and these are my favourites – are beyond repair. But even lovelier in their defeat. The same poignancy you see in a sinking Venice. Egypt is better off with the dry sand that protects what it buries.\nAngkor’s temples were built to Shiva, Vishnu, Buddha and human ego. Sometimes the pendulum of faith stopped swinging as temples blended, blurring and balancing beliefs to achieve both architectural and cultural harmony. More recently, the Khmer Rouge sent its dehumanised automatons into the place to use it for target practice. And, anticipating the archaeological atrocities of the Taliban and ISIS, the KR decapitated every accessible Buddha head. For fun and profit – flogging them to foreign collectors.\nYes, it’s time to return the Parthenon marbles to Athens – and for the heads of Angkor to be reunited with the corpses. Dealers of the world beware. You’re as bad as the KR. Or ISIS.", "external_links": [], "published": "2015-10-17T08:00:00.000+03:00", "crawled": "2015-10-19T08:17:06.319+03:00", "highlightTitle": ""}