{"organizations": [], "uuid": "5859d5ac0d7dd7b4de6097424120ed8c2f99210a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1139106/netapp-and-softlayer-demonstrate-superior-economics-cloud-dr-powered-catalogic-softwar", "country": "US", "title": "NetApp and SoftLayer Demonstrate Superior Economics of Cloud DR Powered by Catalogic Software", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "NetApp and SoftLayer Demonstrate Superior Economics of Cloud DR Powered by Catalogic Software", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T16:46:00.000+03:00", "replies_count": 0, "uuid": "5859d5ac0d7dd7b4de6097424120ed8c2f99210a"}, "author": "admin", "url": "http://www.freshnews.com/news/1139106/netapp-and-softlayer-demonstrate-superior-economics-cloud-dr-powered-catalogic-softwar", "ord_in_thread": 0, "title": "NetApp and SoftLayer Demonstrate Superior Economics of Cloud DR Powered by Catalogic Software", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Submitted by admin on 10/12/2015 @ 6:46 AM   Catalogic Software \nWOODCLIFF LAKE, NJ -- (Marketwired) -- 10/12/15 -- A new report published by NetApp is sparking significant interest from customers and industry observers alike. The report follows extensive validation testing with IBM Softlayer, Catalogic Software and NetApp, which demonstrates the superior value of a cloud disaster recovery (DR) strategy when managed by a software-defined copy data management platform. The report, titled Copy Data Management for a Hybrid Cloud (NetApp TR-4447 ) shows how customers can drive dramatic CAPEX and OPEX savings by leveraging this joint solution for automated disaster recovery. The report is available in the NetApp Knowledgebase . \nThis report is the first of its kind to demonstrate the significant value that a software-defined copy data management platform can deliver to organizations responsible for DR, particularly DR to the Cloud. The report reveals that by utilizing Catalogic Software's ECX platform in combination with SoftLayer cloud compute and NetApp storage, IT organizations have a powerful way to manage and orchestrate the overall DR operation, including DR testing, while dramatically reducing complexity, cost and required expertise. \nThe testing and validation was performed with the NetApp Private Storage (NPS) for SoftLayer. NPS for SoftLayer is designed for clients who wish to take advantage of SoftLayer cloud compute, but due to data sovereignty laws, or compliance mandates, are not allowed to store their data, or customers' data in the cloud. The customer's storage resides in a single tenant cage in an Equinix data center. It interfaces with SoftLayer bare metal or virtual servers via SoftLayer's Direct Link, high speed, secure private network. NPS for SoftLayer also supports Equinix Cloud Exchange, for multi-cloud support. \n\"What struck me about the report is the degree to which automation of processes within the DR operation can deliver tremendous value to IT teams,\" commented George Crump, President and Founder of Storage Switzerland. \"Combining NetApp Snapshot and replication technologies with the management and orchestration layer provided by Catalogic's ECX dramatically reduces the complexity of daily DR operations and DR testing, and can free up significant resources to work on higher level activities.\" \nThe report shows how easy it is to perform DR with this combined solution, in contrast to a status quo DR operation that relies on traditional methods. It shows that the joint Catalogic-NetApp-SoftLayer solution takes minutes to set up and then automates DR testing such that it can be run every single day, enabling IT resources to focus on more pressing needs as they rest easier knowing that their company's data is well protected should a disaster hit. \n\"This validation report demonstrates that by utilizing the combination of NetApp, Catalogic, and SoftLayer, IT has a new, more powerful way of harnessing the value of hybrid cloud without adding complexity or requiring additional expertise,\" said Scott L. Winters, Director, Cloud Infrastructure Center of Competency, Softlayer, an IBM company. \"The solution dramatically simplifies operations, minimizes risks, and reduces the required labor to manage the flow of data to and from the cloud. In this cookbook we have demonstrated how to manage, orchestrate and analyze Copy Data in a Hybrid IT deployed on the SoftLayer cloud infrastructure using Catalogic Software's intelligent Copy Data management platform, ECX, and leveraging NetApp Private Storage and VMware vSphere Infrastructure.\" \n\"NetApp has been a leader in disaster recovery solutions since its beginning, based on our superior Snapshot® and data replication technologies,\" said Phil Brotherton, the Vice President of the Data Fabric Solutions Group at NetApp. \"NetApp and partners now use these core competencies to extend NetApp's value not only within the data center, but across a Data Fabric that connects private, hybrid and public cloud. The validation effort conducted with SoftLayer, Catalogic and Equinix highlights the significant advantages of Cloud DR, for global organizations with data sovereignty or compliance mandates. It's a great example of how NetApp and its partners will continue to lead the market for DR solutions.\" \nCloud DR implementations based on this validated solution are available today to customers and business partners, and executives at all three firms involved in the report are seeing demand for hybrid cloud solutions skyrocket. \"Leveraging the Cloud for DR is a logical step for all IT organizations, but they need the right technologies in order to capture the value that the Cloud can offer,\" commented Ed Walsh, CEO of Catalogic Software. \"The testing we conducted, and the report that resulted, demonstrate how Catalogic's ECX can leverage the underlying technologies of NetApp and SoftLayer to deliver a superior DR solution.\" \nThe report also highlights the extensibility of the solution. While the focus of the report was specifically on DR operations, the paper demonstrates that the joint SoftLayer, NetApp, Catalogic solution dramatically simplifies any operation that depends on the management of the flow of copy data to and from the cloud. It shows that Catalogic's ECX in conjunction with NetApp's Data Fabric and the SoftLayer cloud, can automate and orchestrate all of the IT organization's key operations that rely on copy data, such as automated DR, Dev/Test or DevOps, and business analytics. \nAbout NetApp Leading organizations worldwide count on NetApp for software, systems and services to manage and store their data. Customers value our teamwork, expertise and passion for helping them succeed now and into the future. To learn more visit www.netapp.com . \nAbout SoftLayer /About IBM Cloud IBM Cloud offers one of the industry's largest portfolio of software, services, data center solutions and consulting for private, public and hybrid cloud environments. Total revenue for IBM Cloud was $8.7 billion, for the second quarter, ending June 30, 2015, $4.5 billion of which was attributed to XaaS. IBM is helping organizations large and small adopt, manage, scale and benefit from open cloud technologies. \nAbout Catalogic Software Catalogic Software is the market's leading software provider of intelligent Copy Data solutions. Founded in 1996 and with thousands of customers worldwide, Catalogic's mission is to enable IT organizations to leverage their copy data, delivering significant reductions to CAPEX and OPEX while providing superior services to the business. With its software products, Catalogic helps clients Manage, Orchestrate and Analyze their Copy Data across their enterprise and cloud in support of mission critical IT functions including disaster recovery, test/dev, DevOps, next generation data protection, and business analytics. Learn more at www.catalogicsoftware.com Contact:", "external_links": [], "published": "2015-10-12T16:46:00.000+03:00", "crawled": "2015-10-12T17:37:00.036+03:00", "highlightTitle": ""}