{"organizations": [], "uuid": "342753655d7b750a2dced34d5fb541e4898220b8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1138729/glamsquad-announces-15-million-series-b-funding-led-new-enterprise-associates-nea-", "country": "US", "title": "GLAMSQUAD Announces $15 Million Series B Funding Led by New Enterprise Associates (NEA)", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "GLAMSQUAD Announces $15 Million Series B Funding Led by New Enterprise Associates (NEA)", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T16:00:00.000+03:00", "replies_count": 0, "uuid": "342753655d7b750a2dced34d5fb541e4898220b8"}, "author": "admin", "url": "http://www.freshnews.com/news/1138729/glamsquad-announces-15-million-series-b-funding-led-new-enterprise-associates-nea-", "ord_in_thread": 0, "title": "GLAMSQUAD Announces $15 Million Series B Funding Led by New Enterprise Associates (NEA)", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Submitted by admin on 10/9/2015 @ 6:00 AM   GLAMSQUAD \nNEW YORK, Oct. 9, 2015 /PRNewswire/ -- GLAMSQUAD , the market leader in mobile beauty services, today announced that New Enterprise Associates (\"NEA\") has led a $15 million Series B financing round, with participation from existing investors SoftBank Capital, Lerer Hippeau Ventures, Montage Ventures and AOL's BBG Ventures. \nhttps://photos.prnewswire.com/prnvar/20151008/275456LOGO \nGLAMSQUAD, which launched in January 2014, has rocketed to success bringing elite independent beauty professionals directly to clients' homes, offices, hotels and other locations. Known for quality, consistency and convenience, GLAMSQUAD delivers an unparalleled beauty experience and confidence to thousands of time-starved women in New York, Los Angeles and Miami each week. In total, GLAMSQUAD has raised $24 million to date. As part of this Series B round, Dayna Grayson, a general partner of NEA, has joined the GLAMSQUAD Board of Directors. \nGLAMSQUAD intends to use the proceeds of this round to accelerate its growth nationwide, expand its engineering and marketing capabilities and explore preliminary development of new products and services. Areas of focus will include bridal services, GLAMSQUAD-branded products and e-commerce capabilities. \n\"This financing is the result of continued, record-setting growth,\" says Alexandra Wilkis Wilson, Co-founder and CEO of GLAMSQUAD. \"Each week, we hit new appointment count and revenue records. We have quintupled our run-rate revenue from just one year ago and are looking ahead to expansion in Washington, D.C., Dallas, Chicago and many more cities.\" \n\"NEA is a perfect partner for GLAMSQUAD as the Company continues to build a powerful new distribution system for beauty services and products,\" says Jason Perri, the Company's Co-founder and Chairman. \"The team is excited to leverage NEA's expertise in building and scaling consumer brands and marketplaces.\" \nDayna Grayson, general partner of NEA, added, \"GLAMSQUAD has developed a unique and powerful brand in less than two years and is poised to take increasing share of the massive $100 billion market for beauty services and products. I'm thrilled to partner with this team as they build on their rapid growth and begin to execute on a national scale.\" \nAbout GLAMSQUAD \nGLAMSQUAD is the market leader in the growing mobile beauty industry, serving thousands of clients weekly in New York, Miami and Los Angeles. Making getting ready a whole lot easier, GLAMSQUAD coordinates the delivery of professional and affordable beauty services to your home, office or hotel. The team of independent hair stylists, makeup artists and nail technicians is meticulously selected and curated to guarantee consistent, high quality results and a superior experience during every appointment. With personalized, one-on-one consultations and a signature range of inspirational looks, GLAMSQUAD offers clients the full celebrity-experience, helping them look and feel their best. Currently operating in New York, Los Angeles and Miami, the company plans to debut in other cities soon. \nGLAMSQUAD services are easily booked through the GLAMSQUAD app or website . Simply select a service, choose a date and time, provide your location and enjoy the convenience, confidence and quality of GLAMSQUAD hair, makeup or nail services. \nAbout NEA \nNew Enterprise Associates, Inc. (NEA) is a global venture capital firm focused on helping entrepreneurs build transformational businesses across multiple stages, sectors and geographies. With nearly $17 billion in cumulative committed capital since inception NEA invests in technology and healthcare companies at all stages in a company's lifecycle, from seed stage through IPO. The firm's long track record of successful investing includes more than 200 portfolio company IPOs and more than 320 acquisitions. www.nea.com . \nCONTACT: Allison Dent, dent@sunshinesachs.com \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/glamsquad-announces-15-million-series-b-funding-led-by-new-enterprise-associates-nea-300157128.html \nSOURCE GLAMSQUAD", "external_links": [], "published": "2015-10-09T16:00:00.000+03:00", "crawled": "2015-10-09T18:39:44.576+03:00", "highlightTitle": ""}