{"organizations": ["Smithsonian Environmental Research"], "uuid": "b90b9144aa828622055ed42fb7fa69192b540027", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.terradaily.com", "main_image": "http://www.spxdaily.com/images-bg/coastal-wetland-waterway-reeds-bg.jpg", "site_section": "http://www.terradaily.com/terradaily.xml", "section_title": "Earth News, Earth Science, Energy Technology, Environment News", "url": "http://www.terradaily.com/reports/Field_widens_for_environments_microbes_that_produce_toxic_form_of_mercury_999.html", "country": "US", "title": "Field widens for environments, microbes that produce toxic form of mercury", "performance_score": 0, "site": "terradaily.com", "participants_count": 0, "title_full": "Field widens for environments, microbes that produce toxic form of mercury", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T04:11:00.000+03:00", "replies_count": 0, "uuid": "b90b9144aa828622055ed42fb7fa69192b540027"}, "author": "", "url": "http://www.terradaily.com/reports/Field_widens_for_environments_microbes_that_produce_toxic_form_of_mercury_999.html", "ord_in_thread": 0, "title": "Field widens for environments, microbes that produce toxic form of mercury", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Schwartz"], "text": "Field widens for environments, microbes that produce toxic form of mercury by Staff Writers Oak Ridge TN (SPX) Oct 13, 2015 Coastal wetlands are just one of dozens of environments where scientists found genes that transform mercury into the neurotoxin methylmercury. Image courtesy of Smithsonian Environmental Research Center/Grace Schwartz. For a larger version of this image please go here . \nThawing permafrost and contaminated sediment in marine coastal areas pose some of the greatest risks for the production of highly toxic methylmercury, according to findings published in the journal Science Advances. \nThe discovery of these newly identified locations for methylmercury production builds on previous work in which scientists from the Department of Energy's Oak Ridge National Laboratory reported on two genes in bacteria that convert inorganic mercury into the organic form. This variety, called methylmercury, is far more dangerous to humans and the environment. Now, scientists from ORNL and the Smithsonian Environmental Research Center have found that these genes are present in microbes from many of the 3,500 environments they examined. \n\"We looked for genes that we know are involved in microbial mercury methylation - from deep in the ocean to Arctic permafrost to the human gut,\" said corresponding author Dwayne Elias of ORNL's Biosciences Division. \"Using new computational methods, we examined data from thousands of sites around the globe where other scientists had sequenced every gene in that environment.\" \nElias noted that many of the metagenomes used in the study were obtained from the Joint Genome Institute, and tools from the Integrated Microbial Genomes System aided in the analysis. \nWhile researchers confirmed the presence of the genes of bacteria they suspected could methylate mercury, they found several new and novel bacteria to add to the list. Researchers also looked at 1,500 human and mammalian metagenomes and concluded that there is an extremely low risk of microbial methylation of mercury within the human body. This essentially put to rest concerns raised in their work published in Environmental Science and Technology in 2013 in which they reported this possibility. \nWith the exception of the mammalian gut, the team found that the mercury methylation genes are abundant in nearly every oxygen-free environment, including rice paddies and marshes, aquatic sediments and certain types of bioreactors. The genes are also abundant in invertebrate digestive tracts and extreme environments. The genes were not typically found in aerated habitats such as the open ocean. \nMercury is a global pollutant released to the atmosphere through coal burning, artisanal (small-scale) mining, industrial uses and some natural processes. Most of the harm comes from methylmercury bioaccumulation, which is the buildup of the element in tissue that occurs when moving up the food chain. Ocean fish are the primary source of methylmercury in human diets worldwide. \n\"Understanding the source of methylmercury to marine food webs was one of our primary goals in doing this metagenomic analysis,\" said co-author Cynthia Gilmour of the Smithsonian Environmental Research Center. \"We found an abundance of the microbial mercury methylation genes in coastal sediments such as the San Francisco Bay delta and marshes.\" \nOther regions potentially at risk for increased methylmercury production include coastal \"dead zones\" like the bottom of the Chesapeake Bay and the Mississippi River plume in the Gulf of Mexico. \nElias and colleagues are looking for other microbes able to methylate mercury and are developing a universal model to further explain where this process happens - and ways to minimize risk to humans and animals. \n\"While our findings still leave the source of methylmercury acquirement in open ocean fish as a bit of a mystery, it is clear that the primary source of methylmercury to humans is not from making it in our bodies,\" Elias said. \n\"It is also quite clear that as the permafrost of today becomes the thawed sediment of tomorrow due to climate change, the risk for substantial levels of methylmercury generation is high given the high gene counts and the continued emission and deposition of mercury in the Arctic.\" \nThis finding and previous work by ORNL and the Smithsonian Environmental Research Center explains why methylated mercury is produced in areas where the neurotoxin's presence had puzzled researchers for decades. The toxin, which is the most dangerous form of mercury, damages the brain and immune system and is especially harmful to developing embryos. \nOther authors of the paper, titled \"Global Prevalence and Distribution of Genes and Microorganism involved in Mercury Methylation,\" are Mircea Podar, Craig Brandt, Steven Brown, Bryan Crable, Anthony Palumbo and Anil Somenahally of ORNL and Allyson Soren of the Smithsonian Environmental Research Center. .", "external_links": [], "published": "2015-10-14T04:11:00.000+03:00", "crawled": "2015-10-14T06:17:37.917+03:00", "highlightTitle": ""}