{"organizations": [], "uuid": "6adb05aa97d289b248f0ecfd15ee68e155bb7987", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbc.ca", "main_image": "http://i.cbc.ca/1.3256785.1444051282!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_1180/kimbetopsalis-simmonsae.jpg", "site_section": "http://rss.cbc.ca/lineup/technology.xml", "section_title": "CBC | Technology News", "url": "http://www.cbc.ca/news/technology/kimbetopsalis-mammal-1.3256783?cmp=rss", "country": "IL", "title": "Post-apocalyptic 'beaver' thrived after dinosaurs died", "performance_score": 0, "site": "cbc.ca", "participants_count": 1, "title_full": "Post-apocalyptic 'beaver' thrived after dinosaurs died", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T16:43:00.000+03:00", "replies_count": 0, "uuid": "6adb05aa97d289b248f0ecfd15ee68e155bb7987"}, "author": "Reuters", "url": "http://www.cbc.ca/news/technology/kimbetopsalis-mammal-1.3256783?cmp=rss", "ord_in_thread": 0, "title": "Post-apocalyptic 'beaver' thrived after dinosaurs died", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Summary of the paper in Zoological Journal of the Linnean Society (Note: CBC does not endorse and is not responsible for the content of external links.) \nThe world had been wrecked. An asteroid impact in Mexico compounded by colossal volcanism in India 66 million years ago had killed about three-quarters of Earth's species including the dinosaurs. \nBut relatively soon afterward, a plucky critter that looked like a beaver was thriving, exemplifying the resilience of the mammals that would arise from the margins of the animal kingdom to become Earth's dominant land creatures. Big 'groundhog' fossil from age of dinosaurs rewrites mammal history \nScientists on Monday announced the discovery in northwestern New Mexico's badlands of the fossil remains of Kimbetopsalis simmonsae , a plant-eating, rodent-like mammal boasting buck-toothed incisors like a beaver that lived just a few hundred thousand years after the mass extinction, a blink of the eye in geological time. Members of the group that discovered Kimbetopsalis simmonsae in the badlands of New Mexico are (from left) Sarah Shelley, graduate student from the University of Edinburgh; Erik Davidson, former UNL undergraduate student; Carissa Raymond, UNL undergraduate student; Steve Brusatte of the University of Edinburgh and Ross Secord of UNL. (Thomas E. Williamson/New Mexico Museum of Natural History and Science) \nKimbetopsalis, estimated at one metre (3 feet long), would have been covered in fur and possessed large molar teeth with rows of cusps used to grind down plants. \nAsked what someone's impression of Kimbetopsalis might be, New Mexico Museum of Natural History and Science curator of paleontology Thomas Williamson said, \"They would probably think something like, 'Hey, look at that little beaver! Why doesn't it have a flat tail?\" \nIt lived in a lush area of forests, rivers, streams and lakes as Earth's ecosystems began to recover from the catastrophe that ended the Cretaceous Period and opened the Paleocene Epoch. Undergraduate student Carissa Raymond holds fossilized teeth of small rodent-like creature that lived at the end of the dinosaur’s era. In summer 2014, she found a similar fossil, later identified as a previously unknown species, Kimbetopsalis simmonsae, while on a dig in New Mexico under the supervision of Professor Ross Secord. (Craig Chandler/University Communications) \n\"It's larger than almost all of the mammals that lived with the dinosaurs, and also had a plant-eating diet, which few if any dinosaur-living mammals had. It shows just how quickly mammals were evolving in that brave new world after the asteroid cleared out the dinosaurs,\" said paleontologist Steve Brusatte of Scotland's University of Edinburgh. \n\"Mammals, which actually originated hundreds of millions of years earlier at the same time as the dinosaurs, now found themselves in an empty world, and they took advantage,\" Brusatte added. Not closely related to rodents \nKimbetopsalis was a member of a mammalian group called multituberculates that resembled rodents although they were not closely related. Although now extinct, disappearing about 35 million years ago, multituberculates were extremely successful, having lived for 120 million years. \n\"Mammals survived the mass extinction, but they did not pass through unscathed,\" Williamson said. \"I think it would be better to describe those survivors as being lucky. A few just happened to have been adapted to survive the catastrophe, probably because they were small, could hide in burrows and eat bugs.\"", "external_links": [], "published": "2015-10-05T16:43:00.000+03:00", "crawled": "2015-10-05T21:05:41.582+03:00", "highlightTitle": ""}