{"organizations": [], "uuid": "5a3792e0ab138c50cf3d9c684304c7af06e4e998", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.myrtlebeachonline.com", "main_image": "http://www.myrtlebeachonline.com/static/images/myrtlebeachonline/facebook.jpg", "site_section": "http://www.myrtlebeachonline.com/news/business/technology/?widgetName=rssfeed&widgetContentId=712015&getXmlFeed=true", "section_title": "Technology News | MyrtleBeachOnline.com &", "url": "http://www.myrtlebeachonline.com/news/business/technology/article39373623.html", "country": "US", "title": "Malaysia arrests hacker linked to Islamic State group", "performance_score": 0, "site": "myrtlebeachonline.com", "participants_count": 1, "title_full": "Malaysia arrests hacker linked to Islamic State group", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T07:07:00.000+03:00", "replies_count": 0, "uuid": "5a3792e0ab138c50cf3d9c684304c7af06e4e998"}, "author": "The Associated Press", "url": "http://www.myrtlebeachonline.com/news/business/technology/article39373623.html", "ord_in_thread": 0, "title": "Malaysia arrests hacker linked to Islamic State group", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Malaysia arrests hacker linked to Islamic State group The Associated Press Order Reprint of this Story KUALA LUMPUR, Malaysia \nA Kosovo citizen has been arrested in Kuala Lumpur for computer hacking and allegedly providing information about U.S. service members to the Islamic State group, Malaysian and U.S. authorities said. \nMalaysian national police chief Khalid Abu Bakar said in a statement late Thursday that the man, in his 20s, was arrested Sept. 15. Khalid said investigations showed the man was in contact with a senior Islamic State group leader in Syria, and is accused of providing information on U.S. service members after hacking several servers. \nKhalid said the man, who entered Malaysia in August 2014 to study computer science at a private institution, would be extradited to the U.S. \nIn a separate statement, the U.S. Department of Justice identified the man as Ardit Ferizi, believed to be leader of an Internet hacking group called Kosova Hacker's Security. It said he will stand trial on charges of computer hacking and identity theft violations. \nIt said Ferizi, known by his hacking moniker \"Th3Dir3ctorY,\" allegedly hacked into the computer system of a U.S.-based company and stole the personal information on 1,351 U.S. military and other government personnel. \nBetween June and August 2015, Ferizi allegedly provided the information to Islamic State group member Junaid Hussain, also known as Abu Hussain al-Britani. On Aug. 11, Hussain posted a tweet titled \"NEW: U.S. Military and Government HACKED by the Islamic State Hacking Division!\" which contained a link to a 30-page document, the U.S. statement said. \nThe post was intended to provide Islamic State supporters in the U.S. and elsewhere with the information for the purpose of encouraging terrorist attacks against those individuals, it said. \n\"This case is a first of its kind and with these charges, we seek to hold Ferizi accountable for his theft of this information and his role in (Islamic State's) targeting of U.S. government employees,\" Assistant Attorney General for National Security John P.Carlin said in the U.S. statement. \nIf convicted, he faces up to 35 years in jail, it said. Related content", "external_links": [], "published": "2015-10-16T07:07:00.000+03:00", "crawled": "2015-10-16T07:38:28.547+03:00", "highlightTitle": ""}