{"organizations": [], "uuid": "4b5fb38e01a11d2c140fa35e9ec37864cfe5f04b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.innovativeretailtechnologies.com", "main_image": "", "site_section": "http://www.retailsolutionsonline.com/rssfeeds/rssnews", "section_title": "Innovative Retail Technologies News", "url": "http://www.innovativeretailtechnologies.com/doc/with-emv-deadline-upon-us-visa-continues-to-assert-that-pins-are-not-necessary-for-security-0001?atc~c=771+s=773+r=001+l=a", "country": "US", "title": "With EMV Deadline Upon Us, Visa Continues To Assert That PINS are Not Necessary For Security", "performance_score": 0, "site": "innovativeretailtechnologies.com", "participants_count": 1, "title_full": "With EMV Deadline Upon Us, Visa Continues To Assert That PINS are Not Necessary For Security", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T12:05:00.000+03:00", "replies_count": 0, "uuid": "4b5fb38e01a11d2c140fa35e9ec37864cfe5f04b"}, "author": "ChristineKern", "url": "http://www.innovativeretailtechnologies.com/doc/with-emv-deadline-upon-us-visa-continues-to-assert-that-pins-are-not-necessary-for-security-0001?atc~c=771+s=773+r=001+l=a", "ord_in_thread": 0, "title": "With EMV Deadline Upon Us, Visa Continues To Assert That PINS are Not Necessary For Security", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News Feature | October 8, 2015 With EMV Deadline Upon Us, Visa Continues To Assert That PINS are Not Necessary For Security By Christine Kern , contributing writer Visa says it’s the chip, not the PIN that secures the card. \nAs the initial push for EMV transition emerged in 2012, Visa worked diligently to dispel the myth that EMV was tied directly to the use of personal identification numbers (PINS). Now, as the EMV deadline has arrived and merchants and retailers scramble to comply with new regulatory guidelines, Visa is still emphasizing that “it’s the chip, not the PIN” that is essential for card security. \n\"There's a lot of confusion around the myth that EMV means 'chip-and-PIN,'\" Stephanie Ericksen, Visa Head of Authentication Product Integration, said in a blog published Jan. 13, 2012 . \"It doesn't in many countries, including the U.S. That's because, in the U.S., we can rely on online processing where transactions are transmitted in real time to the issuer for approval. With that in place, there's no need for the offline authentication that was the genesis of chip-and-PIN.\" \nOne benefit that the United States has as a late adopter of EMV is learning from mistakes and successes of other nations. Erickson noted, “\"Our telecommunications system means we can rely on online processing that is fast, and where transactions are routinely analyzed with our real-time fraud scoring system prior to issuer review. By adding the dynamic cryptogram of the EMV chip to online authorization, we'll increase transaction safety even more, yet without the more complex and expensive cards, terminals and processing capabilities that are needed to support offline authorization.\" \nFast-forward three years, and Visa is still touting the benefits of chip without PIN. “More than 60% of U.S. payment card transactions do not use any signature or PIN, and we expect that trend to continue,” said Stephanie Ericksen, VP of risk products for Visa , in a conference call with Chain Store Age . \nCiting supporting figures from other countries that already use chip-and-PIN authentication, Ericksen explained that for transactions under a certain amount (for example $25 in retail and $50 in grocery categories), not only is PIN verification not required, but neither is a customer signature. \nMark Nelson, senior vice president of risk products and business intelligence at Visa, explained that biometrics are replacing PIN or signature verifications of many chip card transactions. “Biometrics add incremental security,” said Nelsen. “It’s more convenient way to verify you are the genuine cardholder.” \nTokenization and encryption of data are also being employed by many retailers as a means to reduce card fraud, and Nelson explained, “Security is being enabled more and more easily by mobile devices.” \nAnd, of course, implementation does not happen overnight. “It takes time for encryption to be built out on the card side and the enablement side,” said Ericksen. “That’s why we initially announced the 2015 deadline in 2011, to streamline adoption and ensure clarity of the requirements.” \nEricksen estimated that 30%-40% of POS terminals on the market are equipped with EMV-compliant hardware, meaning they may still need a hardware upgrade and software installation. Thanks to the availability of devices like an EMV-compliant $49 Square reader and desktop POS terminals that cost $100-$200 each, she said the hardware implementation cost in the U.S. is “negligible” compared to the cost in previous EMV rollouts. Like what you are reading? Sign up for our free newsletter SIGN ME UP By clicking Sign Me Up, you agree to our Terms and that you have read our Privacy Policy .", "external_links": [], "published": "2015-10-06T12:05:00.000+03:00", "crawled": "2015-10-09T04:48:40.061+03:00", "highlightTitle": ""}