{"organizations": [], "uuid": "785ea799e9c63182ef2b188404a306f825eec145", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/02/13/13004544/QosmosLogo.png", "site_section": "http://www.prweb.com/rss2/techmobile.xml", "section_title": "Technology: Mobile", "url": "http://www.prweb.com/releases/Qosmos/HP-OpenSwitch/prweb13004544.htm", "country": "US", "title": "Qosmos Joins OpenSwitch Community as Initial Charter Contributor", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Qosmos Joins OpenSwitch Community as Initial Charter Contributor", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "785ea799e9c63182ef2b188404a306f825eec145"}, "author": "Madeleine Renouard", "url": "http://www.prweb.com/releases/Qosmos/HP-OpenSwitch/prweb13004544.htm", "ord_in_thread": 0, "title": "Qosmos Joins OpenSwitch Community as Initial Charter Contributor", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Qosmos® , the market leader in Deep Packet Inspection (DPI) and network intelligence technology for use in physical, SDN and NFV architectures, today announced that it has joined the OpenSwitch community as an initial charter contributor. The OpenSwitch community and a new open source network operating system (NOS) were launched by HP, supported by Accton, Arista, Broadcom, Intel, Qosmos and VMware. The OpenSwitch Platform is an open source, Linux-based network operating system (NOS) platform. Built under the open source model, OpenSwitch offers the freedom of innovation while maintaining stability and limiting vulnerability. OpenSwitch is an extensible NOS that utilizes modern development tools and offers extensive APIs and management interfaces. Developers can build on the reliable and modern architecture to create unique networking features and applications using an agile development approach for faster development and more stable applications with fewer post-release defects.\nThe OpenSwitch community was initiated by seven charter contributors with the goal of advancing the state of the art of open networking. Charter contributors to OpenSwitch are Hewlett Packard, Accton, Arista, Broadcom, Intel, Qosmos and VMWare.\nQuote: :\nThibaut Bechetoille, CEO at Qosmos: “We are pleased to be part of this new open source initiative which will accelerate innovation and improve overall quality of future networks. Qosmos will play a key role by providing the application-level traffic visibility required to optimize and protect networked assets in virtualized environments.”\nFor more about OpenSwitch: http://www.openswitch.net/\nAbout Qosmos\nQosmos leads the market for Deep Packet Inspection (DPI) and network intelligence technology used in physical, SDN and NFV architectures. The company supplies software to vendors who embed real-time application awareness in their products for traffic optimization, service chaining, quality of service, analytics, cyber security and more. Qosmos brings fast time to market for network intelligence and continuous protocol signature updates inside physical, SDN and NFV networking products. As the leading supplier of network intelligence software, Qosmos contributes actively to open source projects and international standards, and serves 75% of the market.\nFor more information, please visit http://www.qosmos.com\nSocial Media: Twitter | LinkedIn | YouTube", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cHM6Ly90d2l0dGVyLmNvbS9xb3Ntb3NfbmV3cw==", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5vcGVuc3dpdGNoLm5ldC8=", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5xb3Ntb3MuY29t", "http://www.prweb.net/Redirect.aspx?id=aHR0cHM6Ly93d3cubGlua2VkaW4uY29tL2NvbXBhbnkvcW9zbW9z", "http://www.openswitch.net/", "http://www.prweb.net/Redirect.aspx?id=aHR0cHM6Ly93d3cueW91dHViZS5jb20vdXNlci9xb3Ntb3NUVj9mZWF0dXJlPXdhdGNo"], "published": "2015-10-09T03:00:00.000+03:00", "crawled": "2015-10-09T10:15:44.786+03:00", "highlightTitle": ""}