{"organizations": [], "uuid": "6d00101789e65d3ff848e50c3b16cc0d27a36a4a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266385/technology-general", "section_title": "Technology Press Releases from PRWeb - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30326688/linkage-design-revs-up-high-end-car-animations-with-vred-and-pipelinefxs-qube", "country": "US", "title": "Linkage Design Revs Up High-End Car Animations with VRED and PipelineFX's Qube!", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Linkage Design Revs Up High-End Car Animations with VRED and PipelineFX's Qube! - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T20:11:00.000+03:00", "replies_count": 0, "uuid": "6d00101789e65d3ff848e50c3b16cc0d27a36a4a"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30326688/linkage-design-revs-up-high-end-car-animations-with-vred-and-pipelinefxs-qube", "ord_in_thread": 0, "title": "Linkage Design Revs Up High-End Car Animations with VRED and PipelineFX's Qube!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "3D Design Firm Automates Training and Visualization Queue with Stable Render Farm Manager\nLos Angeles, CA (PRWEB) October 22, 2015\nToday, PipelineFX announced that Linkage Design , a global automotive design and training studio, has tapped Qube! to manage all VRED rendering projects in their US and UK offices.\nWith a service list that includes digital modeling, Class-A surface creation, concept designs, and scan-based reverse engineering, Linkage Design can not only create assets, they can show artists how to make them too. Training programs for VRED Professional , Autodesk’s 3D automotive visualization tool, have already been big hits for the studio. Now with the addition of Qube!, Linkage has found a way to automate the rendering process, bringing projects in faster for top automotive clients.\n“We depend on Qube! to be ready and waiting, not only upon completion of a project, but also for motion tests at stop points during the creation process,” said Dawn McArdle, Senior Visualization Specialist at Linkage Design. “Exterior driving shots and moving parts never look 100% correct the first time around, which means we need our render farm to pump out overnight tests that will be ready to re-work the next morning. Qube! is made for that.”\nAt a firm like Linkage, individual computers aren’t able to keep up with the sheer number of frames slated for test runs. Before Qube!, the team was manually routing renders from their desktops. Already an inefficient use of time, this process led to even more trouble during the night, as render errors sidelined jobs and added hours to their shots.\n“Manually setting up renders on multiple machines at the end of the day is time consuming,” added McArdle. “With Qube!, you can select which computers receive jobs, and then go home knowing your final passes will be shepherded as you sleep. It maximizes your resources.”\nWhen in office, the team found themselves delighted by the instantaneous updates Qube! gives on jobs currently in progress. “The UI is easy to use, and easy to decipher,” said Michael Check, CEO of Linkage Design. “We like the numerous monitoring features like the ability to understand which workers are responsible for specific frames, and performance comparisons that tell us which workers are our fastest. Adding more speed into our routines also gave us the desire to re-render all of our early VRED content, and finally tackle our reel.”\nAnother benefit was access to PipelineFX’s dedicated support team. From the start, they were there to help Linkage Design write scripts during the initial install, a factor Linkage now attributes to the reliability they’ve seen in the last few months.\n“The way Qube! works with VRED is going to be huge for the design viz industry, as many auto suppliers and small design shops have desktops sitting idle during parts of the day and night,” said Check. “Most firms aren’t going to make the jump to a dedicated render rack just yet, so tapping into these idle computers is an excellent source of added efficiency. Qube! is how we get there.”\nAbout Qube! and Smart Farming\nQube! is an intelligent, mature and highly scalable render management solution that can be quickly integrated into any production workflow, and is backed by world-class technical support. Smart Farming delivers intelligence to production pipelines by providing business-critical insight into render pipelines, maximizing investment in rendering infrastructure and automating manual processes. Qube! works out of the box with all leading content creation applications and is truly cross-platform with all software components available on Windows®, Linux®, and Mac OS®X operating systems.\nAbout PipelineFX\nAs the leading provider of intelligent render farm management solutions for digital content creation, PipelineFX provides software, support, consulting and training services worldwide. Qube! runs on more than 30,000 render nodes at over 700 customers in 51 countries and is used to render film and visual effects, post production, broadcast, design, games and education media. Clients include Apple, Arc Productions, Base FX, BBC, Deluxe, Dyson, Electronic Arts, Google, HBO, Hasbro, L’Atelier Animation, L.M.U., Lockheed Martin, Mackevision, Method Studios, MPC, NBC Sports, Next Media Animation, Nvidia, NHK, NYU, Original Force, Pratt Institute, Procter & Gamble, ReelFX, South Park Studios, SVA, Target, Technicolor and many others. PipelineFX is headquartered in Honolulu, HI, and has offices in Los Angeles, London, Portland, Las Vegas, and Vancouver.\nAbout Linkage Design\nLinkage Design is one of the leading providers of design resources and training that put an emphasis on utilizing advanced digital design tools like: Autodesk Alias, VRED, MODO, Qube! and others. Linkage recruits and employs an elite mix of degreed industrial designers and digital sculptors who work in our customer’s design studios or in one of our three worldwide studios. Linkage Design has offices in Detroit, Greensboro, NC and the UK.\n //www.prweb.com/releases/2015/10/prweb13037170.htm\n ", "external_links": ["http://www.autodesk.com/products/vred/features/vred/all/gallery-view", "http://www.pipelinefx.com/", "http://www.pipelinefx.com/features/", "http://www.linkage-d.com/", "http://www.prweb.com/releases/2015/10/prweb13037170.htm"], "published": "2015-10-22T20:11:00.000+03:00", "crawled": "2015-10-22T21:25:24.291+03:00", "highlightTitle": ""}