{"organizations": ["Tata Consultancy Services", "Jochelle Mendonca & Neha Alawadhi | ET Bureau |", "Nasscom", "TCS", "National Association of Software and Services Companies"], "uuid": "e5ac17db08b86f0bdb6e5033a00c69f79ec79cab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "cio.economictimes.indiatimes.com", "main_image": "http://economictimes.indiatimes.com/photo/Why-IT-cos-are-spending-millions-to-train-workforce/49476329.cms", "site_section": "http://cio.economictimes.indiatimes.com/rss/recentstories", "section_title": "Latest Information Technology News | Latest IT Industry News, Information and Updates: ET CIO : ETCIO.com", "url": "http://cio.economictimes.indiatimes.com/news/strategy-and-management/why-it-cos-are-spending-millions-to-train-workforce/49476329", "country": "IN", "title": "Why IT cos are spending millions to train workforce", "performance_score": 0, "site": "indiatimes.com", "participants_count": 0, "title_full": "Why IT cos are spending millions to train workforce", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T06:45:00.000+03:00", "replies_count": 0, "uuid": "e5ac17db08b86f0bdb6e5033a00c69f79ec79cab"}, "author": "", "url": "http://cio.economictimes.indiatimes.com/news/strategy-and-management/why-it-cos-are-spending-millions-to-train-workforce/49476329", "ord_in_thread": 0, "title": "Why IT cos are spending millions to train workforce", "locations": ["New York"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Pierre Nanterme", "Sangeeta Gupta", "Ajoyendra Mukherjee", "Gupta"], "text": "#Accenture Why IT cos are spending millions to train workforce IT firms are spending ever larger sums of money as they enter a skilling arms race to keep pace with the increasing demand for digital services. Jochelle Mendonca & Neha Alawadhi | ET Bureau | 21 October 2015, 8:36 AM IST Follow ETCIO Share MUMBAI | NEW DELHI: IT firms are spending ever larger sums of money as they enter a skilling arms race to train their workforce to keep pace with the increasing demand for digital services.Training has always been a key part of Indian IT's strategy they take in hundreds of thousands of freshers and train them for three months to create the armies of IT engineers that powered growth for over a decade. But the onslaught of digital technologies is forcing them to retrain and reskill the entire organisation. And it comes at a cost. At its investor day in New York, Accenture broke out how much its training programme had cost.\"In fiscal year 2015, we invested more than $800 million in training and development by leveraging the latest digital technologies including virtual classrooms to deliver highly relevant training to our people at the point of need. We are investing at scale to build industry skills to be industry relevant,\" Pierre Nanterme, chairman and CEO of Accenture, told investors two weeks ago. Accenture has over 3,50,000 employees across the globe, with more than 1,00,000 from India.Even for Indian companies, the costs are growing. The National Association of Software and Services Companies had said that five years ago training costs were about 1-2% of the overall cost of an IT company, but that has changed.\"The current number would definitely be higher. The 1-2% was the percentage of fresher training cost.Now, companies are doing mid-career training, design thinking, product management and some of those newer things which would be through the employee life cycle and not entry level where the bulk of training costs were earlier concentrated,\" Sangeeta Gupta, vice president with Nasscom, told ET. Gupta added that the industry body did not have figure for the revised costs.Training is also taking up an ever larger part of an IT company's time. \"We need to provide anytime, anywhere learning because at our scale, it is not possible to train everyone in a classroom. So we have online learning management platforms, iClass, an online instructorled learning program. All of these take investment. It is like running an internal online university,\" Ajoyendra Mukherjee, executive vice president and head - global human resources at Tata Consultancy Services, told ET.TCS has about 3,35,000 employees. In FY15, TCS' recruitment and training costs rose 19% to Rs 360.9 crore from a year ago, its annual report showed.That number excludes the cost of the technology TCS builds to train employees and the cost of the time spent in training.", "external_links": [], "published": "2015-10-21T06:45:00.000+03:00", "crawled": "2015-10-21T08:23:33.124+03:00", "highlightTitle": ""}