{"organizations": ["Hepatology Advisory Board", "Benitec Forms Hepatology Clinical Advisory Board", "Benitec Forms Hepatology Clinical Advisory Board RSS Navigation Links HOME"], "uuid": "1ae42b1d12f720266eab171ff334f46577c860d3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bio-medicine.org", "main_image": "", "site_section": "http://feeds.bio-medicine.org/latest-biology-technology", "section_title": "Latest Biology Technology from Bio-Medicine.Org", "url": "http://www.bio-medicine.org/biology-technology-1/Benitec-Forms-Hepatology-Clinical-Advisory-Board-34393-1/", "country": "US", "title": "Benitec Forms Hepatology Clinical Advisory Board", "performance_score": 0, "site": "bio-medicine.org", "participants_count": 0, "title_full": "Benitec Forms Hepatology Clinical Advisory Board", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T15:00:00.000+03:00", "replies_count": 0, "uuid": "1ae42b1d12f720266eab171ff334f46577c860d3"}, "author": "", "url": "http://www.bio-medicine.org/biology-technology-1/Benitec-Forms-Hepatology-Clinical-Advisory-Board-34393-1/", "ord_in_thread": 0, "title": "Benitec Forms Hepatology Clinical Advisory Board", "locations": ["SYDNEY"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Geoffrey McCaughan"], "text": "RSS Navigation Links HOME >> BIOLOGY >> TECHNOLOGY Benitec Forms Hepatology Clinical Advisory Board ... SYDNEY Oct. 19 2015 /- Benite...Benitec CEO and Managing Director Dr French said We are proud to hav...The inaugural members of the Hepatology Advisory Board include: Geoffrey McCaughan PhD MD MBBS FRACP... http://feeds.bio-medicine.org/latest-biology-technology Date:10/19/2015 \nSYDNEY , Oct. 19, 2015 /PRNewswire/ -- Benitec Biopharma Limited (NASDAQ: BNTC ; ASX: BLT), a clinical-stage biotechnology company developing innovative therapeutics based on its patented gene-silencing technology called ddRNAi or 'expressed RNAi', today announced the formation of its Hepatology Clinical Advisory Board. The newly appointed Clinical Advisory Board will serve as a strategic resource to Benitec as it continues to develop therapies for the treatment of hepatitis B and C. \nBenitec CEO and Managing Director Dr French said, \"We are proud to have assembled such a Board of world experts in hepatology. The insight and guidance provided by our Clinical Advisors is a major asset in promoting the successful development of our RNAi-based therapeutics for the treatment of hepatitis B and C.\" \nThe inaugural members of the Hepatology Advisory Board include: \nGeoffrey McCaughan , PhD, MD, MBBS, FRACP, AW Morrow Professor of Medicine at the Royal Prince Alfred Hospital and the University of Sydney, and Head of the Liver Injury & Cancer Program at the Centenary Institute, Sydney, Australia \nHarry Janssen , PhD, MD, Professor of Medicine, Francis Family Chair in Liver Research and Head of Liver Clinic at Toronto Western and Toronto General Hospital, University Health Network, Toronto, Canada \nKeyur Patel , MD, Associate Professor of Medicine, Toronto Western Liver Clinic, University Health Network, Toronto, Canada \nAbout Benitec Biopharma Limited:Benitec Biopharma Limited (NASDAQ: BNTC ; ASX: BLT) is a clinical-stage biotechnology company developing innovative therapeutics based on its patented gene-silencing technology called ddRNAi or 'expressed RNAi'. Based in Sydney, Australia with labs in Hayward, CA (USA) and collaborators and licensees around the world, the company is developing ddRNAi-based therapeutics for chronic and life-threatening human conditions including hepatitis C and B, wet age-related macular degeneration and OPMD. Benitec has also licensed ddRNAi to other biopharmaceutical companies for applications including HIV/AIDS, Huntington's disease, chronic neuropathic pain and retinitis pigmentosa. For further information regarding Benitec and its activities, please contact the persons below, or visit the Benitec website at www.benitec.com .Contacts: Company Investor relations United States Carl Stubbings \nChief Business Officer", "external_links": [], "published": "2015-10-19T15:00:00.000+03:00", "crawled": "2015-10-19T16:21:36.284+03:00", "highlightTitle": ""}