{"organizations": [], "uuid": "18837bc08e0b115d1d9f6b0de90311b23995d4e4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.deccanherald.com", "main_image": "http://www.deccanherald.com/page_images/original/2015/10/13/506176.gif", "site_section": "http://www.deccanherald.com/", "section_title": "Deccan Herald: Latest News, Nation, World, Business, Technology, Karnataka News &amp; Headlines", "url": "http://www.deccanherald.com/content/506176/punjabi-author-returns-padma-shri.html", "country": "US", "title": "Punjabi author returns Padma Shri, more writers protest", "performance_score": 0, "site": "deccanherald.com", "participants_count": 1, "title_full": "Punjabi author returns Padma Shri, more writers protest", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "18837bc08e0b115d1d9f6b0de90311b23995d4e4"}, "author": "Chandigarh/New Delhi", "url": "http://www.deccanherald.com/content/506176/punjabi-author-returns-padma-shri.html", "ord_in_thread": 0, "title": "Punjabi author returns Padma Shri, more writers protest", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Punjabi author returns Padma Shri, more writers protest Chandigarh/New Delhi, Oct 13, 2015 (PTI) Eminent Punjabi writer and Padma Shri winner Dalip Kaur Tiwana today decided to return her award protesting \"recurrent atrocities\" on Muslims in the country as another Kannada writer joined authors giving up their Sahitya Akademi Awards against \"growing intolerance\".\nIn a related development, Booker Prize winning author Salman Rushdie came out strongly against \"thuggish violence\" while dismissing criticism by \"Modi Toadies\", saying he supported no political party.\nIn a letter to the Centre, Tiwana said, \"In this land of Gautama Buddha and Guru Nanak Dev, the atrocities committed on the Sikhs in 1984 and on the Muslims recurrently because of communalism are an utter disgrace to our state and society.\n\"And to kill those who stand for truth and justice put us to shame in the eyes of the world and God. In protest, therefore, I return the Padma Shri award\", said the author who received the honour in 2004.\nJoining the bandwagon of writers and poets protesting \"growing intolerance\", Kannada writer Prof Rahamat Tarikeri today said he has returned his Sahitya Akademi award in protest against the killing of scholar M M Kalburgi and rationalists Narendra Dabholkar and Govind Pansare.\nWith writers Krishna Sobti and Arun Joshi following suit, at least 25 authors including Nayantara Sahgal and Ashok Vajpeyi have decided to return their Akademi awards and five writers have stepped down from official positions of the literary body, which in turn has convened an emergency meeting on October 23 to discuss the developments.\nRushdie was flooded with a barrage of hate messages following his tweet in support of Nayantara Sahgal and other writers who returned their Sahitya Akademi awards protesting against its silence over killings of writer M M Kalburgi and rationalists Narendra Dabolkar and Govind Pansare.\nThe 68-year-old author responded in another tweet, \"Here come the Modi Toadies. FYI (for your information), Toadies: I support no Indian political party and oppose all attacks on free speech. Liberty is my only party.\"\nToady, is a term referred to person who praises and helps powerful people in order to get their approval.\nHis tweets came after Shiv Sena activists in Mumbai blackened the face of ORF chief Sudheendra Kulkarni over his refusal to cancel the book launch function on Monday of former Pakistan foreign minister Khurshid Mahmud Kasuri, prompting strong condemnation from political parties.\n\"I think what's crept into Indian life now is a degree of thuggish violence which is new,\" Rushdie told NDTV.\n\"Mr (Narendra) Modi is a very talkative gentleman, he has a lot to say on a lot of subjects and it would be very good to hear what he has to say about all this,\" Rushdie said.\nThe Mumbai-born author was in 2012, forced to pull out from the Jaipur Literature Festival citing death threats after some authors used the platform to read out portions from his 1989 novel, \"The Satanic Verses,\" which was the target of a fatwa, for allegedly hurting Muslim sentiments.\nTiwana said, \"What I am doing is just like planting a seed. You have to plant seeds so that trees will grow. If you look at the revolution in Russia 100 years ago it was influenced by Karl Marx's writings.\"\nIn a letter addressed to the President of the Akademi, Tarikeri said, \"It is sad that the Sahitya Akademi has not condemned the brutal murder of Kalburgi, an eminent scholar and Akademi award recipient. The killing of Pansare, Dabholkar and Kalburgi, is an attempt to create an intolerant society\".\nThe recent Dadri lynching over beef eating rumours is also part of \"this intolerance\", said Tarikeri, Professor at Hampi Kannada University.\n\"As a protest to the attack on free thinking and food liberty, I am herewith returning the award,\" said the author who was conferred the award in 2010.\nSobti said, \"I have returned my award due to various issues like the Ghar Wapsi, the Dadri lynching, Church attacks and more recently the Shiv Sena incident yesterday. All these are shocking and disturbing.\"\nMeanwhile, author Chetan Bhagat took to twitter to term as posturing and politics the decision of authors who had announced they were returning the Sahitya Akademi award.\n\"Accepting an award and then returning it demeans the award and the jury. It's posturing. It's politics,\" Bhagat wrote.\nIn another tweet, he questioned the decision of the authors, saying if someone did not like the government in power would they return their passports or their government college degrees? \"Why just an award?\" he asked.\nBhagat had earned the ire of social media for his tweets \"Ok so am I also supposed to return my Sahitya Academy award? Oh wait. Haven't got it yet.\"\nAttempting to be humorous he said, \"Is there an award return office? And do they then zap you men in black style so you forget you ever got an award.\"\n\"Men in Black\" was a sci-fiction film where the alien fighting protagonists used devices to erase memories of the public.\nThe popular author also said, \"Politicians not protesting Dadri play to their vote bank. But those protesting it are also playing to theirs. Nothing more. Nothing less.\"\nPolitical parties have also condemned the \"silence\" of the Centre over the issue with DMK chief M Karunanidhi today stating that the \"nonchalant\" attitude was an injustice and a black chapter in history.\nCongress dubbed Union Minister Mahesh Sharma as \"arrogance personified\" for making light of writers returning their awards in protest against alleged stifling of freedom of speech by the Modi government.", "external_links": ["http://web.ventunotech.com/plugins/cntplayer/ventuno_editorial_player.js"], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-13T16:40:20.415+03:00", "highlightTitle": ""}