{"organizations": [], "uuid": "838b0b07e75ce76cf627206830cd3b4db7309a08", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/10/14/13022917/PR_Image.jpg", "site_section": "http://www.prweb.com/rss2/techmobile.xml", "section_title": "Technology: Mobile", "url": "http://www.prweb.com/releases/2015/10/prweb13022917.htm", "country": "US", "title": "Carta Introduces Ground-Breaking Token Processing Appliance for Cloud-Based Payments", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Carta Introduces Ground-Breaking Token Processing Appliance for Cloud-Based Payments", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "838b0b07e75ce76cf627206830cd3b4db7309a08"}, "author": "Paul Brandner", "url": "http://www.prweb.com/releases/2015/10/prweb13022917.htm", "ord_in_thread": 0, "title": "Carta Introduces Ground-Breaking Token Processing Appliance for Cloud-Based Payments", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Carta Worldwide is pleased to introduce a new product that dramatically expedites speed to market for large banks, processors and domestic networks looking to implement secure mobile payments. Carta’s Token Processing Appliance (TPA) enables HCE and tokenization-based mobile payments deployment with a turn-key solution. It simplifies on-premises implementation using a highly configurable and easily integrated set of hardware and software modules.\nThe TPA is the first ever product available in market that delivers a complete package of requisite components for cloud based payments—including tokenization—for in-house deployment.\nThe combined software/hardware bundle blends the speed and flexibility of cloud-based software as a service (SaaS) models with the security and control of on-premises deployment. Mobile wallet providers can overcome challenges associated with system upgrades, custom software development and ongoing updates with a simplified, scalable offering.\nCarta is already one of the world’s leading providers of digital transaction processing, offering custom and hosted solutions for partners in more than 20 countries. This new solution opens up their award-winning hosted approach to hundreds of issuers operating through a domestic network and to large issuers that want to keep solutions in-house.\nThe TPA changes the mobile payments game—offering an unprecedented combination of flexibility and security. The TPA streamlines testing, certification and on-going updates associated with in-house implementation. For a large issuer, domestic network or processor it means minimized risk, fastest time to market and lower overall total-cost-of-ownership.\nThe TPA is compliant with specifications for cloud-based payments and tokenization from EMVCo and the payment networks (schemes). TPA core functions include Tokenization Management, Token Transaction Processing and Management, Credential Management and Provisioning along with SDK- or API-driven Mobile Payment Application integration. The tested and market-ready solution simplifies what is typically a lengthy and complex process.\nThe TPA offers multi-tenant architecture allowing multiple programs to cost-effectively share a common private infrastructure in a segregated virtual environment. Whether housed internally within an issuing bank, or offered as a service on-behalf of banks, all tenants benefit from a flexible long term roadmap—a future-proof solution that can adapt with ever-shifting user needs and technology advances.\n\"Mobile payments and particularly mobile payment security are critical and complex,” explained Carta CEO Brian Semkiw. “The TPA introduces maximum security with minimum complexity. This disruptive new product aligns with our corporate motto: ‘complexity made simple.’”\nRui Mendes, Carta’s CTO commented, “Processors and the banks that depend on older platforms have the challenge of adapting legacy code to modern payment requirements. TPA provides an effective bridge to address those challenges.”\nAbout Carta Worldwide\nCarta is an award-winning leader in digital transaction processing and enablement technologies, delivering new and innovative financial products for the digital world. Carta empowers banks, MNOs, OEMs, merchants and others to enable existing cardholder accounts or issue new financial products for proximity and cloud-based transactions quickly and easily.\nCarta is the only platform in the world that offers end-to-end issuance, processing and enablement for digital accounts, including tokenization, digital credential management and provisioning. Carta simplifies payments, delivering fastest time to market and lowest total cost of ownership.\nhttp://www.cartaworldwide.com", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5jYXJ0YXdvcmxkd2lkZS5jb20="], "published": "2015-10-15T03:00:00.000+03:00", "crawled": "2015-10-15T07:24:25.574+03:00", "highlightTitle": ""}