{"organizations": [], "uuid": "c3a56f1a3e8c3514e717dbf65908bb08b0c6d804", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.gizmag.com", "main_image": "http://img.gizmag.com/airdonkey-bike-sharing-1.jpg?fit=max&h=594&rect=0%2C0%2C1399%2C787&w=1060&s=0bb507251b45ee64156de730d8611ea5", "site_section": "http://gizmag.com/xml/", "section_title": "Gizmag Emerging Technology Magazine", "url": "http://www.gizmag.com/airdonkey-bike-sharing/39921/?AirDonkey-takes-the-sharing-economy-to-two-wheels/", "country": "US", "title": "​AirDonkey takes the sharing economy to two wheels", "performance_score": 0, "site": "gizmag.com", "participants_count": 1, "title_full": "​AirDonkey takes the sharing economy to two wheels", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T17:58:00.000+03:00", "replies_count": 0, "uuid": "c3a56f1a3e8c3514e717dbf65908bb08b0c6d804"}, "author": "Stu Robarts", "url": "http://www.gizmag.com/airdonkey-bike-sharing/39921/?AirDonkey-takes-the-sharing-economy-to-two-wheels/", "ord_in_thread": 0, "title": "​AirDonkey takes the sharing economy to two wheels", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Image Gallery (7 images) \nIf you only cycle occasionally, a bike will just sit gathering dust or not be worth buying in the first place. A new service called AirDonkey provides a third option – a sharing system that lets people rent out their bikes when they're not using them or hire one just when they need to. \nAirDonkey isn't the first service of this kind. Spinlister , for example, has been operating since 2012. Nonetheless, it joins a burgeoning list of sharing economy services. \nIndividuals who want to rent out their bikes will be able to order an AirDonkey kit online. This includes an instruction panel to be mounted on the handlebars and a Bluetooth-enabled \"Donkey lock,\" which tracks the bike. \nOnce the owner has \"donkified\" their bike, they just need to take a photo of it, list it on the AirDonkey mobile app and leave it locked up in a public location. It's then possible to indicate when the bike is available to rent. If a bike owner needs to use their bike at some point, they can simply indicate that it is not available to rent at that time. \nIndividuals looking for a bike to rent must be signed up to AirDonkey and can view available bikes using the app. Once they have booked a bike to rent, it is unlocked via Bluetooth using their smartphone. The lock's integrated battery is said to last for up to 500 days between charges and the system requires no interaction between the bike owner and the renter. \nRenters pay a daily fee for a bike through the app, of which AirDonkey takes a small percentage and the owner gets the rest. Once they have finished using the bike, they need only lock it back up in a zone set by the bike owner and shown on a map in the app. \nThe AirDonkey system has been trialed in Copenhagen and a Kickstarter campaign to fund the venture is due to launch tomorrow. \nThe video below provides an introduction to AirDonkey.", "external_links": [], "published": "2015-10-19T17:58:00.000+03:00", "crawled": "2015-10-19T18:50:59.422+03:00", "highlightTitle": ""}