{"organizations": [], "uuid": "5a095cab5f6c74e232d7cfa0037c713bd641256b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "", "site_section": "http://www.prweb.com/rss2/technetworking.xml", "section_title": "Technology: Networking", "url": "http://www.prweb.com/releases/2015/10/prweb13029054.htm", "country": "US", "title": "Formation Data Systems CEO to Speak on Entrepreneurship Panel “From Idea to Acquisition” at Dell World 2015", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Formation Data Systems CEO to Speak on Entrepreneurship Panel “From Idea to Acquisition” at Dell World 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "5a095cab5f6c74e232d7cfa0037c713bd641256b"}, "author": "John Vu", "url": "http://www.prweb.com/releases/2015/10/prweb13029054.htm", "ord_in_thread": 0, "title": "Formation Data Systems CEO to Speak on Entrepreneurship Panel “From Idea to Acquisition” at Dell World 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "October 19, 2015 – Formation Data Systems, a disruptive company revolutionizing the enterprise storage market, today announced that its CEO, Mark Lewis, will join other industry leaders to speak on the panel “From Idea to Acquisition” on October 21 at Dell World 2015 in Austin, Texas. At the conference, Formation will showcase the company’s hyper-scale FormationOne dynamic storage platform in the Dell Ventures Exhibit Area within the Solutions Showcase. Invited to be a guest speaker on the panel, Lewis draws upon a deep understanding of the startup development, investment and acquisition process. He also brings expertise driving strategy and business growth within large enterprise organizations. As CTO at EMC, Lewis led more than thirty major acquisitions for the company, including its acquisition of VMware. In addition, as the co-founder and CEO of Formation, Lewis has taken the company from an idea to a leading provider of hyper-scale software-defined storage solutions, securing investment from Dell Ventures and other leading venture capital firms along the way..\nFormation will also exhibit within the Dell Solutions Showcase at Dell World 2015, offering demonstrations of its flagship FormationOne storage platform to attendees. The FormationOne platform launched this past August and combines the agility, flexibility and simplicity of public cloud with the control and security of private datacenter storage, while at the same time doing something that gives back to communities in need. FormationOne offers the ideal combination of private cloud control and public cloud scale to transform enterprise infrastructure and solve the challenges faced by businesses today.\nIn conjunction with OxFam America, the company will also continue its successful “ See-a-Demo-Get-a-Goat ” campaign while at Dell World, which since August 2015 has seen over 40 technology enthusiasts donate a goat to families in impoverished countries to help fight hunger and poverty.\nWhat: Formation Data Systems CEO to speak about entrepreneurship at Dell World 2015, also showcasing the company’s revolutionary platform and donating goats to impoverished families in need when attendees see a demo.\nFormation Exhibit\nWhen: October 20-22, 2015\nWhere: Dell Solution Showcase Exhibit Area Booth 3030\nPanel Session\nWhen: October 21, 2015\nTime: 2:15 PM - 3:00 PM CDT\nWhere: Expo theatre within the Dell World Live communications hub in the Solutions Showcase for both live and virtual audiences. Tune into Dell World Live to see live streaming\nRELATED LINKS\n Visit our press room Follow Formation on our blog , Twitter , LinkedIn and Facebook CEO Mark Lewis’ Twitter\n--- Ends ---\nFor more information, please contact Ryan Mattison at Eastwick – FDS(at)eastwick(dot)com | 415-820-4484\nAbout Formation Data Systems\nFormation Data Systems' mission is to help IT organizations realize the transformative benefits of modern storage technology. Formation has developed the revolutionary FormationOne™ Dynamic Storage Platform that combines the agility, flexibility and simplicity of public cloud web-scale approaches with the control, security and customization capabilities of private datacenter storage. FormationOne has been built for Enterprise IT, SaaS application providers, and service providers, seeking ways to transform the agility and economics of their storage and data management environment. The platform is currently in beta and available by request from customers who are looking for a better approach to today’s enterprise storage offerings.", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cHM6Ly93d3cubGlua2VkaW4uY29tL2NvbXBhbnkvMzEwNjAyNj90cms9dHlhaCZ0cmtJbmZvPWNsaWNrZWRWZXJ0aWNhbCUzQWNvbXBhbnklMkNpZHglM0ExLTEtMSUyQ3RhcklkJTNBMTQzNDczMjcxNDcxOSUyQ3RhcyUzQWZvcm1hdGlvbiUyMGRhdGElMjBz", "http://www.prweb.net/Redirect.aspx?id=aHR0cHM6Ly90d2l0dGVyLmNvbS9mb3JtYXRpb25kcw==", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5mb3JtYXRpb25kcy5jb20vZ29hdA==", "http://www.prweb.net/Redirect.aspx?id=aHR0cHM6Ly93d3cuZmFjZWJvb2suY29tL0Zvcm1hdGlvbkRhdGFTeXN0ZW1zP2ZyZWY9dHM=", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5mb3JtYXRpb25kcy5jb20vbWVkaWE=", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5mb3JtYXRpb25kcy5jb20vYmxvZw=="], "published": "2015-10-19T03:00:00.000+03:00", "crawled": "2015-10-19T16:13:30.251+03:00", "highlightTitle": ""}