{"organizations": [], "uuid": "cadc54bf638d5a3e1b9e00c627500c78046ef00e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.barchart.com", "main_image": "", "site_section": "http://www.barchart.com/stocks/news.php?feed=AP,PRNW&subject=STK.TECH&date=20150922135959&section=tech", "section_title": "Stocks - News &amp; Commentary | Technology &amp; Comp", "url": "http://www.barchart.com/headlines/story/10955403/ruckus-wireless-delivers-carrier-class-wi-fi-to-world-class-event-with-alcatel-lucent", "country": "US", "title": "Ruckus Wireless Delivers Carrier-Class Wi-Fi to World-Class Event with Alcatel-Lucent", "performance_score": 0, "site": "barchart.com", "participants_count": 1, "title_full": "Ruckus Wireless Delivers Carrier-Class Wi-Fi to World-Class Event with Alcatel-Lucent", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "cadc54bf638d5a3e1b9e00c627500c78046ef00e"}, "author": "PRNW", "url": "http://www.barchart.com/headlines/story/10955403/ruckus-wireless-delivers-carrier-class-wi-fi-to-world-class-event-with-alcatel-lucent", "ord_in_thread": 0, "title": "Ruckus Wireless Delivers Carrier-Class Wi-Fi to World-Class Event with Alcatel-Lucent", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SAN DIEGO , Sept. 22, 2015 /PRNewswire/ -- Ruckus Wireless, Inc. (NYSE: RKUS) is delivering superior, high-performance Wi-Fi experience for attendees of this year's SReXperts conferences – hosted over the last four months by Alcatel-Lucent for their service provider and other customers in Madrid , Tokyo and now San Diego .\nSReXperts is the flagship education, training and networking event organized by Alcatel-Lucent's IP routing and transport division, designed to help service providers leverage product investments and advance new IP-based services, including Carrier Wi-Fi and Voice over Wi-Fi. Attendees have enjoyed free, carrier-class Wi-Fi throughout event venues – from ballrooms and meeting rooms to restaurants and networking functions – based on Ruckus' best-in-class 802.11ac and 802.11n indoor Wi-Fi access points along with Ruckus' Virtual SmartZone TM controller (vSZ) and Alcatel-Lucent's 7750 Service Router.\n\"We're thrilled to offer our customers hands-on experience with the latest Wi-Fi gear, while making it easier to learn and network,\" said Lindsay Newell , vice president portfolio marketing at Alcatel-Lucent. \"With hundreds of technical delegates, we've seen heavy use of web applications, multimedia streaming and voice calls across multiple device types and the Ruckus and Alcatel-Lucent solution has provided flawless, high performance Wi-Fi, together with strong Voice over Wi-Fi quality. The partnership between Ruckus and Alcatel-Lucent has enabled us to develop, test and deploy innovative new services to meet new and existing customer requirements.\"\n\"Alcatel-Lucent and Ruckus have a strong relationship that brings together best-in-class technology from Alcatel-Lucent's IP routing and transport division and Smart Wi-Fi from Ruckus to deliver a complete Carrier-Class Wi-Fi solution,\" said Bart Burstein , Ruckus' senior vice president of corporate development. \"Alcatel-Lucent and Ruckus have jointly deployed some of the world's most complex packet core and access networks for major carriers worldwide and the SReXperts events provide a great forum to showcase these solutions to even more customers.\nAlcatel-Lucent has delivered Ruckus Carrier Wi-Fi solutions to operators globally. Ruckus Smart Wi-Fi infrastructure is ideally suited for service provider deployments due to its unique scalability and patented smart antenna technologies that deliver superior connectivity, simplifying deployment and management and reducing CapEx requirements for comparable coverage and user density support.\nWi-Fi access traffic is managed by Alcatel-Lucent's 7750 Service Router, which provides support for Wi-Fi interworking based on S2a (3GPP SaMOG), extending its routing and gateway capabilities to Wi-Fi. The ability of the 7750 SR to scale to support millions of users and connected devices translates into the ability for massive delivery of high quality wireless broadband. At the same time, the 7750 SR is able to ensure the highest QoS on a per-user, per-flow or per-application/service basis, significantly improving and enhancing the quality of end-user experience.\nAlcatel-Lucent's 7750 SR is an ideal platform for integrating Ruckus Smart Wi-Fi as both are market leaders in Carrier-Class Wi-Fi and access networks globally. Ruckus Smart Wi-Fi has over 38% market share for Carrier Wi-Fi based on 2Q 2015 Dell'Oro Group result. Ruckus is also the only Wi-Fi vendor ranked as a Leader, the highest ranking, in the 2015 Infonetics Carrier Wi-Fi Vendor Scorecard report. Similarly, Alcatel-Lucent's 7750 SR is the leading service provider edge routing platform.\nRuckus continues to work closely with Alcatel-Lucent on ways to improve the overall wireless experience for end-users. Through a strategy called Wireless Unified Networks , Ruckus and Alcatel-Lucent look to combine 4G LTE cellular with Wi-Fi. By offloading uplink traffic to LTE and by aggregating the Wi-Fi and LTE downlink traffic paths, Wi-Fi range can be increased by a factor of two, downlink speed can increase 70%, and uplink speed can increase as much as 55X. Referred to as Wi-Fi boost, Ruckus and Alcatel-Lucent are moving beyond the simple LTE-U/LAA co-existence of cellular and Wi-Fi by truly blending the best of both technologies for higher capacity and a more consistent mobile voice, data and video experience.\nFollow Ruckus Wireless on Linkedin and Twitter for all the latest on #SimplyBetterWireless.\nABOUT RUCKUS WIRELESS\nHeadquartered in Sunnyvale, CA , Ruckus Wireless, Inc. (NYSE: RKUS) is a global supplier of advanced wireless systems for the rapidly expanding mobile Internet infrastructure market. The company offers a wide range of indoor and outdoor \" Smart Wi-Fi \" products to mobile carriers, broadband service providers, and corporate enterprises, and has approximately 56,000 end-customers worldwide. Ruckus technology addresses Wi-Fi capacity and coverage challenges caused by the ever-increasing amount of traffic on wireless networks due to accelerated adoption of mobile devices such as smartphones and tablets. Ruckus invented and has patented state-of-the-art wireless voice, video, and data technology innovations, such as adaptive antenna arrays that extend signal range, increase client data rates, and avoid interference, providing consistent and reliable distribution of delay-sensitive multimedia content and services over standard 802.11 Wi-Fi. For more information, visit http://www.ruckuswireless.com .\nRuckus, Ruckus Wireless and SmartZone are trademarks of Ruckus Wireless, Inc. in the United States and other countries. All other product or company names may be trademarks of their respective owners.\nMedia Contact\nChristine Kerst\nBig Valley Marketing (for Ruckus Wireless)\nchristine.kerst@bigvalley.co\n949-705-8144\nLogo - http://photos.prnewswire.com/prnh/20121120/MM17393LOGO\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/ruckus-wireless-delivers-carrier-class-wi-fi-to-world-class-event-with-alcatel-lucent-300146806.html\nSOURCE Ruckus Wireless, Inc.", "external_links": ["http://photos.prnewswire.com/prnh/20121120/MM17393LOGO", "http://www.ruckuswireless.com/", "http://www.ruckuswireless.com/technology", "http://photos.prnewswire.com/prnvar/20121120/MM17393LOGO", "https://www.alcatel-lucent.com/solutions/wireless-unified-networks", "http://www.prnewswire.com/news-releases/ruckus-wireless-delivers-carrier-class-wi-fi-to-world-class-event-with-alcatel-lucent-300146806.html", "https://www.linkedin.com/company/ruckus-wireless", "https://twitter.com/ruckuswireless"], "published": "2015-09-22T03:00:00.000+03:00", "crawled": "2015-10-06T02:32:53.485+03:00", "highlightTitle": ""}