{"organizations": [], "uuid": "8cb379822bc0894371f93ca27514968db3b81b44", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.technology.org", "main_image": "http://www.technology.org/texorgwp/wp-content/uploads/2015/10/THE-Port.-hackspace-initiative-720x480.jpg", "site_section": "http://feeds.feedburner.com/TechnologyOrgInformationProcessingNews", "section_title": "Technology Org » Information processing news", "url": "http://www.technology.org/2015/10/09/ideas-to-reality-in-60-hours-the-port-humanitarian-hackathon/", "country": "", "title": "Ideas to reality in 60 hours – THE Port humanitarian hackathon", "performance_score": 0, "site": "technology.org", "participants_count": 1, "title_full": "Ideas to reality in 60 hours – THE Port humanitarian hackathon", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T13:12:00.000+03:00", "replies_count": 0, "uuid": "8cb379822bc0894371f93ca27514968db3b81b44"}, "author": "Alius Noreika", "url": "http://www.technology.org/2015/10/09/ideas-to-reality-in-60-hours-the-port-humanitarian-hackathon/", "ord_in_thread": 0, "title": "Ideas to reality in 60 hours – THE Port humanitarian hackathon", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ideas to reality in 60 hours – THE Port humanitarian hackathon Posted Today \nHacking? Not simply a synonym of criminal computing behaviour. In fact, hackspaces & hack initiatives are sparking all over the world, aiming for quite an opposite – to make the world a better place. And maybe even have a little friendly competition in the process? THE Port. Image courtesy of THE Port and Light My Photo team. \nLast weekend (2 nd -4 th Oct), humanitarian and health issues were tackled at THE Port Hackathon event at CERN and Campus Biotech in Geneva, where 13 teams met to hack, build, and develop functional tools for technology-enabled future. \nAfter 6 weeks of virtual preparations, the teams met on Friday and had 60 hours to take their ideas into vision. Believe it or not, fully functional prototypes were presented by groups at the Final Review on Sunday, including a patient-empowering app for hospitals, new and improved rice-filled airdrop bags or a 20 Dollar explosion monitor, sensitive enough to track unique signatures of explosives in warzones. \nNot your ordinary hackathon \nUsually at hackathons, project ideas are pitched and teams form spontaneously at the big kickoff of the event, followed by hours or days of intense work to make their projects work. THE Port is quite unique in this sense, as teams were put together by organisers 6 weeks in advance. Multidisciplinary talents were chosen carefully for each project idea, which were pitched by NGOs and other idea generators. \nRegardless of the unconventional set up, the success of THE Port Hackathon, which was born barely a year ago, is astonishing. For example, a few ideas developed at THE Port 2014 have already been picked up by private companies and NGOs, e.g. a reinvented body bag by “Team Bodybag”, or a “SmartDOG” system to improve mine detection in tricky landscapes. © 2014-2015 THE Port Association \nInspired by last year’s success, THE Port kept the same setup – teams were put together such, that each had it all: scientists, coders, designers, artists, communicators and so on. Experts-on-call, including healthcare specialists and humanitarian fieldworkers, offered their knowledge and support for the teams throughout the event. \n“At the frontier there are no rules of thinking” \nExperts also expressed their specific needs in the field, e.g. tools which require development or improvement, and provided a level of sanity-check to make sure the participants ideas (of which there were plenty) stayed applicable to reality. \nHowever, the “no rules of thinking” rule was evident throughout the event, as was the passionate commitment of all the participants. And the result seemed to have impressed all – organizers, guests and the teams themselves. \nSolar collector for the poorest \nFor example, “The Sunshine Crew” aimed to upset some of the harmful effects that reliance on firewood has in the developing countries by building a simple, yet effective solar collector. As people living in poorest areas of the world, e.g. Nepal or El Salvador, rely heavily on firewood, deforestation is a major issue, while respiratory diseases are considered one of the leading causes of death. \nThe idea was to have a 3-in-1 system adapted for water boiling, cooking and heating, which would otherwise be carried out the old fashion way – by burning wood in chimney-less fireplaces and inhaling the dangerous fumes. \nAfter experimenting with several solar collector prototypes, the team came up with a model that uses some firewood, however can collect sunlight efficiently for cooking, heating and a variety of other uses, such as sterilization, distilling etc. \nDuring the 6 week preparation period, the team was working with advisors in Nepal to make sure their model is applicable and culturally acceptable in the area. Moreover, the team aimed for the collector to be adaptable for a variety of different settings, from private homes to schools or hospitals, as well as a range of climatic conditions. \nWhile this does not solve the problem of wood fuels entirely, it could help reduce the daily usage of firewood by as much as 40%, which would be a strong start. As put by one of the team members, Jose-Luis Preza, “If we make a difference for at least a single person in the world, then we have to do it.” Sphere incubator by Come-on-Baby! team. Image courtesy of THE Port and Light My Photo team. \nPreemie incubator re-imagined \nConventional baby incubators are fine – in hospitals that have them, whose staff is fully trained in maintaining all the equipment, and doctors have the knowledge of how to use the incubators safely and effectively. Unfortunately this is often not the case in rural hospitals of developing countries. Donated incubators here (if any) usually end up unused or used inappropriately, e.g. by sharing one incubator between several babies. \nDetermined to find a more applicable and sustainable solution, Come-on-Baby! team, working hard in the CERN’s IdeaSquare workshop for three days, have built a functional “sphere” incubator prototype. \nSimple (yet innovative) design allows to see the baby from all angles, is easy to open without introducing too much environmental influence (e.g. temperature changes), and, perhaps most importantly – does not permit to cram too many babies inside. \nConductive mattress ensures maximum comfort, correct position and reduced temperature changes, while multiple temperature probes inside and outside the incubator, as well as trunk and feet of the baby, allow to track and maintain optimal conditions for the baby’s development. \nOver 1 million babies a year die on their first day of life – most of which in underequipped hospitals in disadvantaged areas of the world. However, a sustainable-design incubator, easy to build and use, yet hi-tech and long-lasting, makes usability of baby-saving equipment in such areas a lot more realistic. \nTech-enabled relief for refugees? \nAs the refugee crisis continues to shake Europe, enough people become empathetic and willing to lend support or even take in those fleeing war and conflict zones. However, those who have made it to their perceived countries of safety are often far away from getting actual shelter, e.g. due to painstakingly long registration routines. \n“We believe shelter is more than just walls and a roof”, said team ShelterX on their final presentation on Sunday. “It is a place of recovery, and access to information that allows recovery.” \nTheir proposed solution includes a simple DIY registering station, which would promote links between newly arrived migrants and the local community. At one end, any community members willing to donate their time and resources or take refugees into their homes would enter their information, while portable kiosks at, e.g. in big stations, would help migrants to access this information as soon as possible after arrival. \nThe prototype app has thus the potential to help facilitate rapid communication in a crisis situation, and introduce social links between the refugees and the community, fast-forwarding their adaptation and recovery process. \n— \nAfter an inspiring weekend “at the frontier”, where more ideas and working solutions were proposed than could possibly be presented, the hope is that most projects will continue to develop and become functional aids for real-life humanitarian, health and social issues. \nWritten by Eglė Marija Ramanauskaitė Related Topics:", "external_links": [], "published": "2015-10-09T13:12:00.000+03:00", "crawled": "2015-10-09T13:57:45.678+03:00", "highlightTitle": ""}