{"organizations": [], "uuid": "7c89515e0dc3f56d362e12a1f603f60214dad629", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com/news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1143257/toshiba-and-sandisk-announce-start-equipment-installation-yokkaichi-s-new-fab-2", "country": "US", "title": "Toshiba and SanDisk Announce Start of Equipment Installation at Yokkaichi's New Fab 2", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "Toshiba and SanDisk Announce Start of Equipment Installation at Yokkaichi's New Fab 2", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T04:10:00.000+03:00", "replies_count": 0, "uuid": "7c89515e0dc3f56d362e12a1f603f60214dad629"}, "author": "admin", "url": "http://www.freshnews.com/news/1143257/toshiba-and-sandisk-announce-start-equipment-installation-yokkaichi-s-new-fab-2", "ord_in_thread": 0, "title": "Toshiba and SanDisk Announce Start of Equipment Installation at Yokkaichi's New Fab 2", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  Toshiba Semiconductor & Storage Products Company \nTOKYO & MILPITAS, Calif. -- (BUSINESS WIRE) -- Toshiba Corporation (TOKYO:6502) and SanDisk Corporation (NASDAQ:SNDK) today announced the start of equipment installation in the New Fab 2 facility at Yokkaichi Operations. New Fab 2 is primarily intended to provide the clean room space necessary to transition a significant portion of the current Yokkaichi 2D NAND capacity to 3D flash memory. The companies also signed definitive agreements for joint manufacturing of 3D flash memory and investment in New Fab 2. This Smart News Release features multimedia. View the full release here: http://www.businesswire.com/news/home/20151020006921/en/ New Fab2 at Toshiba Yokkaichi Operations (Photo: Business Wire) \nSeiichi Mori, Corporate Senior Vice President of Toshiba Corporation and President and CEO of Semiconductor & Storage Products Company, said, “The partnership of SanDisk and Toshiba has consistently pioneered advances in the memory industry through our technology leadership and commitment to innovation and excellence. We look forward to fabricating 3D flash memory, BiCS FLASH™, in New Fab 2.” \n“These agreements pave the way for the highly successful SanDisk-Toshiba partnership to seamlessly transition into the 3D NAND era,” said Sanjay Mehrotra, president and chief executive officer of SanDisk. “3D NAND enables new levels of density, scalability and performance across a broad set of customer applications. We look forward to our continued leadership in NAND flash technology and solutions.” \nEquipment installation started in New Fab 2 in October 2015 and the facility is expected to be ready for production in the first calendar quarter of 2016. Toshiba and SanDisk will each determine the extent and timing of their respective conversions to 3D flash memory based on their own requirements. \n*BiCS FLASH is a trademark of Toshiba Corporation. \nAbout Toshiba \nToshiba Corporation, a Fortune Global 500 company, channels world-class capabilities in advanced electronic and electrical product and systems into five strategic business domains: Energy & Infrastructure, Community Solutions, Healthcare Systems & Services, Electronic Devices & Components, and Lifestyles Products & Services. Guided by the principles of The Basic Commitment of the Toshiba Group, “Committed to People, Committed to the Future”, Toshiba promotes global operations and is contributing to the realization of a world where generations to come can live better lives. \nFounded in Tokyo in 1875, today’s Toshiba is at the heart of a global network of over 580 consolidated companies employing 199,000 people worldwide, with annual sales surpassing 6.6 trillion yen (US$55 billion). \nTo find out more about Toshiba, visit www.toshiba.co.jp/index.htm \nAbout SanDisk \nSanDisk Corporation (NASDAQ:SNDK), a Fortune 500 and S&P 500 company, is a global leader in flash storage solutions. For more than 25 years, SanDisk has expanded the possibilities of storage, providing trusted and innovative products that have transformed the electronics industry. Today, SanDisk’s quality, state-of-the-art solutions are at the heart of many of the world's largest data centers, and embedded in advanced smart phones, tablets and PCs. SanDisk’s consumer products are available at hundreds of thousands of retail stores worldwide. For more information, visit www.sandisk.com . \nThis news release contains certain forward-looking statements, including expectations relating to construction, equipment installation and production schedules, production focus in New Fab 2, technology transitions, capabilities and performance improvements, anticipated product applications and continued leadership in NAND flash technology and solutions, that are based on current expectations and involve numerous risks and uncertainties that may cause these forward-looking statements to be inaccurate. Risks that may cause these forward-looking statements to be inaccurate include among others: general business and economic conditions; construction, installation, production and transition difficulties or delays; failure of 3D NANDto perform as expected; failure to manage risks associated with Toshiba’s and SanDisk’s ventures and strategic partnership; inability to continue to develop and manufacture leading NAND flash technology or solutions; or the other risks detailed from time-to-time in SanDisk’s Securities and Exchange Commission filings and reports, including, but not limited to, its most recent Quarterly Report on Form 10-Q. SanDisk does not intend to update the information contained in this news release. \n© 2015 SanDisk Corporation. All rights reserved. SanDisk and the SanDisk logo are trademarks of SanDisk Corporation, registered in the United States and other countries. Other brand names mentioned herein are for identification purposes only and may be the trademarks of their respective holder(s). View source version on businesswire.com: http://www.businesswire.com/news/home/20151020006921/en/ Copyright © Business Wire 2015", "external_links": [], "published": "2015-10-21T04:10:00.000+03:00", "crawled": "2015-10-21T09:00:18.928+03:00", "highlightTitle": ""}