{"organizations": ["Shipping Abu Dhabi Ports", "SACE"], "uuid": "35a5366a222aa606adff52327cb4a645f80d1645", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.porttechnology.org", "main_image": "https://www.porttechnology.org/images/uploads/news/khalifa_captain.JPG", "site_section": "http://www.porttechnology.org/rss_feeds/news/", "section_title": "Port Technology International - News", "url": "http://www.porttechnology.org/news/abu_dhabi_ports_strike_big_italian_deal/", "country": "GB", "title": "Abu Dhabi Ports Strike Big Italian Deal", "performance_score": 0, "site": "porttechnology.org", "participants_count": 0, "title_full": "Abu Dhabi Ports Strike Big Italian Deal", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T12:14:00.000+03:00", "replies_count": 0, "uuid": "35a5366a222aa606adff52327cb4a645f80d1645"}, "author": "", "url": "http://www.porttechnology.org/news/abu_dhabi_ports_strike_big_italian_deal/", "ord_in_thread": 0, "title": "Abu Dhabi Ports Strike Big Italian Deal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "22 Oct 2015 Cargo Volumes and Throughput , Container Handling , Containers , Going Places , Port Planning , Ports , Shipping Abu Dhabi Ports has signed a Memorandum of Understanding (MoU) with Italian export credit company SACE for enhancing business relations between both parties. \nThe MoU aims to formalise a common base for the purpose of exploring, strengthening and enhancing the trade and economic cooperation between UAE and Italy, through the exchange of information and business opportunities between the two organisations. \nAbu Dhabi Ports and SACE intend to collaborate on developing and strengthening their business relationships. Both parties will provide information on ongoing or potential new projects offering new business opportunities for Italian companies. \nCaptain Mohamed Juma Al Shamisi, CEO of Abu Dhabi Ports, said: “Khalifa Industrial Zone Abu Dhabi (Kizad), the industrial and logistics hub integrated with our flagship Khalifa Port has tailored offerings for Italian companies looking to expand their business into Abu Dhabi and the region. \n“By facilitating initiatives of mutual interest and expanding opportunities for trade and investment, Abu Dhabi Ports, the enabler of Abu Dhabi’s maritime business, is supporting our mission to realise the Emirate’s economic diversification.” \nAlessandro Castellano, CEO of SACE, said:\"Khalifa Port is an expression of the economic and industrial diversification strategy of the Emirate of Abu Dhabi, to which Italian companies can contribute with their know-how in key sectors for the Emirate economy. The agreement signed today with Abu Dhabi Ports opens important new growth opportunities for Made in Italy in the UAE, where our companies export US$5.65 billion in goods and services.\" \nAbu Dhabi Ports’ latest efforts are building on the robust trade relations between the UAE and Italy. Italy is the UAE’s second largest trade partner in Europe. \nFact File: SACE facilitates the access to credit lines to support companies and banks in their internationalisation process, in addition to its traditional business of export credit and investment protection.", "external_links": [], "published": "2015-10-22T12:14:00.000+03:00", "crawled": "2015-10-23T02:25:34.482+03:00", "highlightTitle": ""}