{"organizations": [], "uuid": "177c0a1198a4029e3e10c0fb7fe61971f926e7b6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.businessspectator.com.au", "main_image": "", "site_section": "http://www.businessspectator.com.au/technology", "section_title": "Technology | Business Spectator", "url": "https://www.businessspectator.com.au/news/2015/10/15/technology/netflix-releases-mixed-q3-results", "country": "US", "title": "Netflix releases mixed Q3 results", "performance_score": 0, "site": "businessspectator.com.au", "participants_count": 1, "title_full": "Netflix releases mixed Q3 results | Business Spectator", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T16:54:00.000+03:00", "replies_count": 0, "uuid": "177c0a1198a4029e3e10c0fb7fe61971f926e7b6"}, "author": "Dow Jones newswires", "url": "https://www.businessspectator.com.au/news/2015/10/15/technology/netflix-releases-mixed-q3-results", "ord_in_thread": 0, "title": "Netflix releases mixed Q3 results", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Netflix reported disappointing subscriber growth in the US and saw its profit fall amid higher costs for content and expansion.\nOverall, the video company added 3.62 million streaming subscribers in the September quarter, better than the 3.55 million that Netflix projected in July. Netflix said it added more international subscribers than expected but fewer in the US.\nIn the US, Netflix added 880,000 subscribers, below the 1.15 million subscribers that the company projected in July. Overseas, the company added 2.74 million users, above Netflix's 2.4 million forecast.\nNetflix attributed the weak US additions to involuntary churn partly tied to the company's inability to process payments from subscribers whose credit and debit cards were changed to chip-based technology.\nShares of Netflix fell 6.6 per cent in after-hours trading.\nNetflix plans to complete its global rollout by the end of 2016, with service in South Korea, Singapore, Hong Kong and Taiwan slated to begin early in the year. Netflix's expansion, however, has come with higher costs and greater exposure to currency volatility.\nMeanwhile, as the television industry contends with falling ratings and a weak TV ad market, media executives are raising questions about whether licensing past seasons of shows to Netflix is the best strategy in the long run for the pay-TV industry.\nSeveral television companies have struck big library deals with the TV-industry-owned Hulu, citing in part the smaller streaming service's openness to allowing networks greater flexibility to \"stack\" current seasons of shows in their own streaming apps and its licensing of just domestic rights, as opposed to Netflix's global demands.\nNetflix has said it is becoming less reliant on acquired series from media companies, focussing more on developing its own original shows and movies. In the letter to shareholders Wednesday, Netflix said \"some studios will choose to license content to [subscription video on demand] services like Hulu, Amazon Prime Instant video and Netflix. Other may not. We have a lot of content to select from.\"\nAmong Netflix's original programming are \"Orange is the New Black\"; \"Narcos,\" a 10-episode series on Colombian cocaine king Pablo Escobar; and \"Beasts of No Nation,\" the company's first feature film that will be released on October 16 on Netflix and in select US theaters.\nTo help offset rising costs, Netflix has occasionally raised prices. Last week, it raised the price of its plan allowing two simultaneous streams to $US9.99 a month in the US, Canada and Latin America, a $US1 increase, mirroring a similar increase in Europe over the summer.\nOverall, Netflix's profit in the September quarter was cut in half to $US29.4 million ($A40.3m), or US7c a share, from $US59.3m, or US14c a share. Revenue rose 23 per cent to $US1.74 billion.\nIn July, Netflix projected earnings of US7c a share on revenue of $US1.59bn. Analysts surveyed by Thomson Reuters had projected earnings of US8c a share and revenue of $US1.75bn.\nInternational operations again weighed on profit, as the segment's third-quarter loss more than doubled to $US68m, compared with a loss of $US31m in the year-ago period, but better than the company's projection of a $US77m loss. Netflix projects a loss of $US117m in the fourth quarter.\nThe segment has operated at a loss since Netflix expanded service to Canada in 2010, but company officials said they expect to \"run around break-even\" in 2016 and turn a profit after that as they complete the international expansion.\nIn the latest period, Netflix said currency fluctuations lowered its international revenue by $US96m.\nIncluding customers signed up for free trials, Netflix had 69.17 million streaming members worldwide as of September 30.\nNetflix expects to add another 1.65 million customers in the US in the fourth quarter and 3.50 million abroad and projects profit of US2ca share. Analysts surveyed by Thomson Reuters expected earnings of US3c a share.\nLong-term debt stood at $US2.4bn at the end of the quarter; while free cash flow, the amount of money left after operating and capital expenses, already negative, widened to $US252m, from $US229m in the second quarter.\nMeanwhile, film, series and other programming spending under contract rose nearly 17 per cent to $US10.4bn from the year-ago period, with more than $US4bn due in less than a year.", "external_links": [], "published": "2015-10-15T16:54:00.000+03:00", "crawled": "2015-10-15T02:08:04.916+03:00", "highlightTitle": ""}