{"organizations": [], "uuid": "c44bdb73bf1a6055308fe5d05ecd7e64bc3289e8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mdtmag.com", "main_image": "", "site_section": "http://www.mdtmag.com", "section_title": "Medical Design Technology | The Medical Design Engineer’s Resource for Products &amp; Technologies", "url": "http://www.mdtmag.com/news/2015/10/8-finalists-announced-pediatric-medical-device-competition", "country": "US", "title": "8 Finalists Announced for Pediatric Medical Device Competition", "performance_score": 0, "site": "mdtmag.com", "participants_count": 1, "title_full": "8 Finalists Announced for Pediatric Medical Device Competition", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "c44bdb73bf1a6055308fe5d05ecd7e64bc3289e8"}, "author": "Children's National Health System", "url": "http://www.mdtmag.com/news/2015/10/8-finalists-announced-pediatric-medical-device-competition", "ord_in_thread": 0, "title": "8 Finalists Announced for Pediatric Medical Device Competition", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Eight finalists, representing outstanding pediatric medical device innovations, have been selected to pitch their device concept for a chance to receive one of two $50,000 awards at the Third Annual Pediatric Surgical Innovation Symposium hosted by the Sheikh Zayed Institute for Pediatric Surgical Innovation at Children’s National Health System on Friday, Oct. 23, 2015. Selected from a competitive field of 53 entries received from across the US and internationally, the finalists are:\nHealthcare Unbound, San Francisco, Calif. – noninvasive therapy for chest deformities in children Massachusetts Institute of Technology and Media Lab, Cambridge, Mass. – device that provides improved sensitivity and accuracy of ear infection diagnostics Texas Tech University Health Science Center, El Paso, Texas – internal, motorized bone lengthener device for children Stanford University, Stanford, Calif. – neonatal umbilical catheter stabilization and infection protection device AventaMed, Cork, Ireland – pediatric ear tube device that does not require full general anesthesia Children’s National Health System, Washington, DC – real-time, non-invasive fetal electrocardiogram to diagnose fetal arrhythmias Prospiria, Inc., Galveston, Texas – noninvasive device using optoacoustic imaging to monitor endotracheal tube positioning for pediatric life support patients Actuated Medical, Bellefonte, Pa. – controlled, micron-scale needle oscillation system to enable oblique access as well as reduce insertion force, anesthesia exposure, and reoperation rates for pediatric bone biopsies and bone marrow aspirations. “We received so many stellar entries this year that truly address a significant unmet need within the pediatric population – it was quite difficult for the committee to narrow down the top eight finalists,” said Kolaleh Eskandanian, PhD, MBA, PMP, Executive Director of the Sheikh Zayed Institute for Pediatric Surgical Innovation. “This impressive line-up features eight inspiring ideas that can make a major difference in the care of pediatric patients and we look forward to providing funding support to two of these innovators in the hopes of bringing their device to market faster.”\nEach finalist will have five minutes to present their proposal to the judging panel, which includes Bryan Vartabedian, MD, of Texas Children’s Hospital , who will also serve as moderator; Charles Berul, MD, of Children’s National ; Martha Connolly, PhD, of Mtech Baltimore ; Mark Fitzgerald of Wilson Sonsini Goodrich & Rosati ; Tiffany Karp of Global Center for Medical Innovation ; Peyvand Khaleghian, MD, PhD, of Avicenna Partners Investment Company ; and one of the 2014 competition winners, Justin G. Shaka, MBA, of REBIScan . The format includes a five-minute question-and-answer period following the oral presentation.\nThe “Make your Medical Device Pitch for Kids!” competition is a part of the Sheikh Zayed Institute’s Third Annual Pediatric Surgical Innovation Symposium, “Children’s Need Must Drive Market Speed,” on Friday, Oct. 23, 2015 at the Newseum in Washington, DC. The one-day forum will bring together patient advocates, researchers, innovators, venture capitalists, regulators, and policy makers, including key leaders from the Food and Drug Administration (FDA), to examine and discuss the challenges surrounding the pediatric market and the need for incentives and legislation to stimulate pediatric surgical and device innovation. Keynote speakers include Robert M. Califf, MD, MACC, Deputy Commissioner for Medical Products and Tobacco at the FDA, who was recently nominated for FDA Commissioner, and Geoffrey Ling, MD, PhD, leading innovator and Director of DARPA Biological Technologies.\nFor symposium details and registration, visit www.pediatric-surgery-symposium.org .", "external_links": ["http://childrensnational.org/", "http://devices.net/gcmi.htm", "https://www.wsgr.com/WSGR/Default.aspx", "http://www.mtech.umd.edu/index.html", "http://rebiscan.com/", "http://www.pediatric-surgery-symposium.org/", "http://childrensnational.org/research-and-education/sheikh-zayed", "http://www.texaschildrens.org/", "http://www.avicennapartners.com/"], "published": "2015-10-01T03:00:00.000+03:00", "crawled": "2015-10-02T01:37:25.017+03:00", "highlightTitle": ""}