{"organizations": [], "uuid": "a9dcc3ea16ba9534b3becd87f3225336667c9605", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.rocketnews.com", "main_image": "", "site_section": "http://www.rocketnews.com/category/technology/feed/", "section_title": "» Technology", "url": "http://www.rocketnews.com/2015/10/geek-deals-save-big-on-a-moto-e-lte-smartphone-with-free-talk-text-and-data/", "country": "US", "title": "Geek deals: Save big on a Moto E LTE smartphone with free talk, text, and data", "performance_score": 0, "site": "rocketnews.com", "participants_count": 1, "title_full": "Geek deals: Save big on a Moto E LTE smartphone with free talk, text, and data", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T17:40:00.000+03:00", "replies_count": 0, "uuid": "a9dcc3ea16ba9534b3becd87f3225336667c9605"}, "author": "Editor - Technology News", "url": "http://www.rocketnews.com/2015/10/geek-deals-save-big-on-a-moto-e-lte-smartphone-with-free-talk-text-and-data/", "ord_in_thread": 0, "title": "Geek deals: Save big on a Moto E LTE smartphone with free talk, text, and data", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted on October 13, 2015 by Editor - Technology News \nToday, FreedomPop is offering up a pre-owned Moto E Android smartphone for just $49.99. And since it comes with free text messages, voice minutes, and LTE data every single month, you can save big when you leave your old cell service behind. Pre-owned Moto E LTE smartphone for $49.99 with free talk, text, and data \nAs for the phone itself, the Moto E features a Snapdragon 410 system on a chip, a quad-core 1.2GHz processor, a 4.3-inch touchscreen, 8GB of internal storage, a MicroSD slot, a 5 megapixel rear-facing camera, and a VGA front-facing camera. And since it ships with Android 5 Lollipop, you’ll have access to countless apps in the Google Play app store. \nFor free, you’ll get 500 texts, 200 voice minutes, and 500MB of data every month for the life of the device. Need a bit more? The $10.99 plan gets you unlimited talk, unlimited texts, and 500MB of data. If that’s still not enough, you can step up to 1GB of data for $19.99 per month. And if you want premium features like visual voicemail and wireless tethering, the Premium Plus service is an additional $5.99 monthly fee. \nWith your purchase, you’ll also get free shipping, a one-month trial of the $19.99 package, and a one-month trial of the Premium Plus service. If you don’t want to pay any monthly fees, make sure to cancel the $19.99 mobile plan and the Premium Plus service before your trial period is over. And regardless of which plan you decide to use, you should always keep track of your usage. There are caps on how many texts and voice minutes you can use, and the automatic top-up feature will charge your card if you go over your data allotment. Just keep an eye on your stats, and you’ll be good to go. \nOur commerce group sources the best deals and products for the Geek Deals posts. We operate independently of Editorial and Advertising and may earn a percentage of the sale, if you buy something via a link on the post. If you are interested in promoting your deals, please contact us at commerce@ziffdavis.com. \nFor more great deals head over to TechBargains .", "external_links": [], "published": "2015-10-13T17:40:00.000+03:00", "crawled": "2015-10-13T19:10:01.006+03:00", "highlightTitle": ""}