{"organizations": [], "uuid": "73f869f3875ad14404dc98992a5c712c8e9ad1dc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "money.cnn.com", "main_image": "http://i2.cdn.turner.com/money/dam/assets/150930170608-tinder-super-like-620xa.jpg", "site_section": "http://rss.cnn.com/rss/money_technology.rss", "section_title": "Technology news - CNNMoney.com", "url": "http://money.cnn.com/2015/10/01/technology/tinder-super-like/index.html", "country": "US", "title": "Dating app Tinder adds new Super Like option - Oct. 1,", "performance_score": 0, "site": "cnn.com", "participants_count": 4, "title_full": "Dating app Tinder adds new Super Like option - Oct. 1, 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T11:02:00.000+03:00", "replies_count": 3, "uuid": "00169f10984b0a72ffaa5cf581f999fb6f2f28d8"}, "author": "Heather Kelly", "url": "http://money.cnn.com/2015/10/01/technology/tinder-super-like/index.html#post-0", "ord_in_thread": 0, "title": "Dating app Tinder adds new Super Like option - Oct. 1,", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Are apps making in-person dating harder? As any sixth grader can tell you, sometimes you like someone, and sometimes you like like them. Dating app Tinder is adding a new way to show interest in potential dates. It's called a Super Like. Swipe up on a person's Tinder profile to indicate that you are extra into them and they will receive a notification of your affections in the form of a blue shooting star.\nTinder has been testing out the feature for the past three weeks in Australia, where women have used more than a million Super Likes. Starting today, it's available to all users around the world.\nAccording to Tinder, conversations that start with a Super Like last 70% longer. Longer chats mean there's a higher likelihood the two people will meet in the real world, and even potentially fall in Super Love.\nCNNMoney Special: Love, Inc.\nTraditionally, there are only two options on Tinder. Swipe right if you like someone, swipe left if you don't. You can only talk to someone if you've both indicated interest, decreasing unwanted attention that can plague other online dating services.\nTo insure a Super Like isn't wasted, your profile will pop to the top of that person's list of potential matches. To make sure that Super Likes don't lose all meaning and become a cheap ploy to get more replies from hotties, Tinder limits users to one per day. Well, free users. Tinder Plus accounts get five Super Likes a day.\nLaunched in March for \"power users,\" Tinder Plus accounts in the U.S. are $10 for people under 30 and $20 for all the lonely senior citizens over 30. In addition to unlimited Likes, Tinder Plus users can take back a swipe if they change their mind and cruise users located in other cities.\nCNNMoney Special: Sex, Drugs & Silicon Valley\nThere's the chance that a Super Like could make you appear too eager, according to this analysis by psychology researchers Eileen Chu and Stefano Verrelli. \"While Tinder's Super Like was designed to help users avoid beating around the bush, according to the science, it may actually be better to hold back and appear more aloof,\" they say.\nRelated: 10 alternatives to Tinder\nCNNMoney (San Francisco) October 1, 2015: 3:02 AM ET", "external_links": ["http://i2.cdn.turner.com/money/dam/assets/150210143029-spurlock-in-person-dating-1024x576.png", "http://blog.gotinder.com/post/128712169906/introducing-super-like-a-new-type-of-swipe", "https://theconversation.com/does-tinders-new-super-like-make-you-look-too-keen-47426"], "published": "2015-10-01T11:02:00.000+03:00", "crawled": "2015-10-02T02:00:01.314+03:00", "highlightTitle": ""}