{"organizations": ["ET Bureau", "Cigital", "Facebook", "Oxford Internet Institute"], "uuid": "f099b26144ba73e1faebe0116058fd123f680b29", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "cio.economictimes.indiatimes.com", "main_image": "http://economictimes.indiatimes.com/photo/More-Indians-are-logging-on-anonymously-using-browsers-like-Tor-Freenet-I2P-and-Tails/49331506.cms", "site_section": "http://cio.economictimes.indiatimes.com/rss/internet", "section_title": "internet - Information Technology News | Latest IT Industry News, Information and Updates: ET CIO : ETCIO.com", "url": "http://cio.economictimes.indiatimes.com/news/internet/more-indians-are-logging-on-anonymously-using-browsers-like-tor-freenet-i2p-and-tails/49331506", "country": "IN", "title": "More Indians are logging on anonymously using browsers like Tor, Freenet, I2P and Tails", "performance_score": 0, "site": "indiatimes.com", "participants_count": 0, "title_full": "More Indians are logging on anonymously using browsers like Tor, Freenet, I2P and Tails", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T06:06:00.000+03:00", "replies_count": 0, "uuid": "f099b26144ba73e1faebe0116058fd123f680b29"}, "author": "", "url": "http://cio.economictimes.indiatimes.com/news/internet/more-indians-are-logging-on-anonymously-using-browsers-like-tor-freenet-i2p-and-tails/49331506", "ord_in_thread": 0, "title": "More Indians are logging on anonymously using browsers like Tor, Freenet, I2P and Tails", "locations": ["US", "Germany", "Asia", "India"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Akash Mahajan", "Bikash Barai", "Barai", "Zoha", "Zoha Khan", "Paul Budnitz"], "text": "#anonymous More Indians are logging on anonymously using browsers like Tor, Freenet, I2P and Tails According to the Oxford Internet Institute, the Tor browser is estimated to have between 500,000 to 1 million daily users from India. ET Bureau | 13 October 2015, 8:36 AM IST Share BENGALURU: Every evening, once she's home from work, Zoha Khan (name changed) logs into her computer to scroll through discussion forums about extraterrestrial life or upload pictures on Facebook's sister site found on the 'dark' side of the Internet.In an age where newage Internet firms are engaging in grabbing user data, more people like Zoha are logging on to browsers such as Tor, Freenet, I2P and Tails to surf the net anonymously. \"The numbers are increasing. The governments are trying to push local laws to prevent this,\" says Bikash Barai, founder of iViz, which sold its security testing firm to Cigital in late October 2014. Free from censorship and interference, the dark netis gradually transforming into a sheltered space for privacy conscious users.As it becomes mainstream among middle-aged folks, the dark net is shedding its negative connotation and its association as a hideout for whistle-blowers,a den for drug dealers and a go-to source for hacking services is slowly washing off. Ello, an ad-free social networking site that refrains from selling user data to third parties or enforcing a real-name policy, has attracted a high number of Indian users.Its creators refuse to divulge the numbers. \"More than half of Ello's users are outside the US. The largest user group in Asia is in India,\" said Paul Budnitz, CEO and cofounder of Ello. Top artists, designers, musicians, storytellers and other creators gather on this network. According to the Oxford Internet Institute, the Tor browser is estimated to have between 500,000 to 1 million daily users from India. The development of this trend in India is still nascent compared with the US or European countries such as Germany, which constitute 18.74% and 10.09%, respectively, of the mean daily Tor browser users.\"Users of the dark net predominantly use search engines like DuckDuckGo which runs a Tor hidden service,\" said Akash Mahajan, cofounder of Null, an Indian ethical hacking community.\"Other commonly used dark net websites would be Facebook and The Hidden Wiki.\" Besides social media and search engine uses, privacy conscious civilians also access the dark net to update personal blogs, communicate on discussion forums, religioussites, contributetocontentsharing sites or find new music.As the number of users that access the dark net continues to rise, hundreds of activists are emerging with new techniques and tools to keep online privacy intact.Ethereum, a platform that was crowdfunded during August 2014, attempts to link the connected and unused hard drives of millions of computers around the world to create a distributed Internet that no one controls.The dark net - any part of the Internet that is inaccessible to search engines -- could eventually face retaliation from governments in the near future, if the number of users escalates, said Barai of iViz. \"It's tough to predict who will win -- more likely that Tor or sim- i l a r solutions in different form are here to stay,\" he said.", "external_links": [], "published": "2015-10-13T06:06:00.000+03:00", "crawled": "2015-10-13T06:45:53.440+03:00", "highlightTitle": ""}