{"organizations": ["Wikipedia"], "uuid": "271801a76c6a503f04e51dcae5dbc87f1f7ce33c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "phys.org", "main_image": "http://cdn.phys.org/newman/gfx/news/hires/2014/drosophila.jpg", "site_section": "http://www.physorg.com/rss/rssbycategory.php?categ=16", "section_title": "Phys.org - latest science and technology news stories", "url": "http://phys.org/news/2015-10-logistics-drosophila-chromosome.html", "country": "US", "title": "The logistics on the drosophila X chromosome", "performance_score": 0, "site": "phys.org", "participants_count": 0, "title_full": "The logistics on the drosophila X chromosome", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T15:40:00.000+03:00", "replies_count": 0, "uuid": "271801a76c6a503f04e51dcae5dbc87f1f7ce33c"}, "author": "", "url": "http://phys.org/news/2015-10-logistics-drosophila-chromosome.html", "ord_in_thread": 0, "title": "The logistics on the drosophila X chromosome", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The logistics on the drosophila X chromosome October 2, 2015 Drosophila. Credit: Wikipedia \nIf we place an order in an online store we are often thrilled how fast the parcel is delivered to our doorstep. This is possible because logistic companies have established a very reliable and efficient system to distribute goods. Scientists at the Max Planck Institute of Immunobiology and Epigenetics in Freiburg now uncovered a similar distribution system in flies to achieve dosage compensation. By combining state-of-the-art molecular and imaging techniques the researchers revealed a molecular mechanism that allows the protein complexes that regulate dosage compensation to spread over the entire X chromosome. They observed that the so-called high affinity sites (HAS), which are binding regions for the protein complexes, often occur at X chromosomal regions with enriched long-range contacts to each other and further positions on the X chromosome. These central logistics hubs then facilitate the distribution of the dosage compensation machinery towards nearby locations. \nThe formation of the sex in mammals and other species is controlled by two special chromosomes – X and Y. Females (XX) have two X chromosomes, whereas males (XY) only possess one X chromosome. To ensure an equal amount of X-linked gene products in both sexes, dosage compensation has emerged as a molecular balancing mechanism. In mammals, for instance, female cells randomly inactivate one of the two copies of the X chromosome ('X-inactivation'). In flies the process is inverted: male cells up-regulate the transcription of the single chromosome X by two-fold to generate the same gene output as females. \nThe dosage compensation process in Drosophila melanogaster has been extensively studied. It is mediated by a special set of proteins and non-coding RNAs that form the so-called dosage compensation complex. This 'package' needs to be distributed over the entire X chromosome to achieve dosage compensation. For this, the complex first binds to specific locations, the so-called high-affinity sites (HAS). They are thought to serve as central hubs, from which the complex spreads over the chromosome. \"Even though we knew the packages, the central hubs and the delivery destinations, we still did not understand the logistics. In other words, we wondered whether HAS provide spatial information that might be important for the regulation of the X chromosome\", says senior author Asifa Akhtar. \nThe new study, devised by the Akhtar Lab at the Max Planck Institute of Immunobiology and Epigenetics, deepens the understandig of HAS and dosage compensation by literally adding a new dimension. To map HAS to the 3D organization of the male X chromosome, the Akthar lab teamed up with the Dekker Lab (UMass Medical School, Worcester, USA) and the de Laat Lab (Hubrecht Institute, Utrecht, Netherlands) – both experts for genome-wide analysis of 3D conformation. \"We had to start from scratch. There were no good tools to process and analyze the chromosome conformation data when we started the project three years ago. We had to develop new ultra-fast algorithms and visualization techniques to make sense of the data\", says co-first author Fidel Ramírez. The combination of these 3D data together with state-of-the-art imaging techniques and fly genetics revealed that HAS are in close spatial proximity to each other and well-connected to the rest of the chromosome. \"These results suggest that Drosophila melanogaster has evolved an elegant two-step mechanism to efficiently first target and then distribute the dosage compensation complex over the entire male X chromosome. The placement of HAS at tactical sites in the X chromosome 3D architecture makes it easy to distribute the complex to nearby active genes\", says Asifa Akhtar. \nThis novel mechanism proposed by the researchers reminds co-first author Sarah Toscano of a modern parcel delivery service: \"The distribution of the dosage compensation complex is like an express delivery system. HAS can be understood as central logistics hubs located at strategic and easy to reach locations in each city from which the parcel is then delivered to its final destination.\" \nThese new results by the researchers of the Max Planck Institute in Freiburg open many exciting avenues for future research. The authors envision that the mechanism proposed for the delivery of the dosage compensation complex could be a general mechanism for other regulatory elements to exert their functions over spatially close chromatin. For example, one big question is whether a similar distribution mechanism operates at the human X chromosome. While the package and the location of the central hubs might be different in human cells, the logistics itself could be conserved from flies to humans.", "external_links": [], "published": "2015-10-02T15:40:00.000+03:00", "crawled": "2015-10-02T15:44:02.194+03:00", "highlightTitle": ""}