{"organizations": [], "uuid": "82b394914d93abb7b722e58e104df665852e77a1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foodprocessing-technology.com", "main_image": "", "site_section": "http://www.foodprocessing-technology.com/news-atom.xml", "section_title": "Food Processing Technology-Updates", "url": "http://www.foodprocessing-technology.com/contractors/ingredients/palsgaard/pressemulsifiers-stabilisers-food-ingredients-europe-2015.html", "country": "", "title": "Emulsifiers, Stabilisers and Know-How at Food Ingredients Europe 2015", "performance_score": 0, "site": "foodprocessing-technology.com", "participants_count": 0, "title_full": "Emulsifiers, Stabilisers and Know-How at Food Ingredients Europe 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T02:00:00.000+03:00", "replies_count": 0, "uuid": "82b394914d93abb7b722e58e104df665852e77a1"}, "author": "", "url": "http://www.foodprocessing-technology.com/contractors/ingredients/palsgaard/pressemulsifiers-stabilisers-food-ingredients-europe-2015.html", "ord_in_thread": 0, "title": "Emulsifiers, Stabilisers and Know-How at Food Ingredients Europe 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Make An Enquiry \nPalsgaard will share its expertise with food manufacturers at FIE in booth #6P14. \nThe company will showcase its emulsifiers and emulsifier/stabiliser blends, each custom designed for use within cake mixes, chocolate, dairy, ice cream, mayonnaise, dressings and margarine. \nIn addition, Palsgaard will present new inspiration for finished products based on the company's emulsifiers. \nMake successful low-fat mayonnaise with a flexible stabiliser compound \nThe market for low-fat or fat-reduced mayonnaise continues to grow. The market in the US for this product alone doubled from 2005 to 2013, but that doesn't mean that consumers are entirely happy with the quality of products currently on the market. \nA quick search of online food reviews of light mayonnaise products uncovers a challenging reality for many fine foods manufacturers. \nEven the most complimentary remarks, such as \"tastes good for a low-fat product\" or \"it's a lot like the real thing\" still point to a quality gap that holds many people back from trying lower-fat products, and which stops others coming back for more. \nAt FIE, Palsgaard's Fine Foods division will present its most flexible stabiliser compound to date, the Palsgaard 1-2-3. This carefully designed combination of guar and xanthan gum, as well as modified starch is suitable for mayonnaise and dressings with fat contents ranging from zero to 60%. \nAnders Mølbak Jensen said: \"We have tested the stabiliser compound in various mayonnaises and dressings within this broad spectrum and can see that it delivers products with a texture, viscosity and mouth-feel similar to that of mayonnaises and dressings made with a much higher fat content.\" \nManufacturers usually need to use stabiliser blends or compounds designed for the particular fat content they wish to produce, needing a large logistics apparatus to keep track of it all. With Palsgaard 1-2-3, this is no longer necessary. Follow Us:", "external_links": [], "published": "2015-10-19T02:00:00.000+03:00", "crawled": "2015-10-20T04:08:44.948+03:00", "highlightTitle": ""}