{"organizations": [], "uuid": "88d1707675a471659d56c08c84569ee56a50581c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "saudigazette.com.sa", "main_image": "http://saudigazette.com.sa/wp-content/uploads/2015/09/852308-01-08.jpg", "site_section": "http://saudigazette.com.sa/technology/", "section_title": "Technology - Saudi Gazette", "url": "http://saudigazette.com.sa/technology/google-launches-online-it-degrees-in-india/", "country": "US", "title": "Google launches online IT degrees in India", "performance_score": 0, "site": "saudigazette.com.sa", "participants_count": 1, "title_full": "Google launches online IT degrees in India", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T23:48:00.000+03:00", "replies_count": 0, "uuid": "88d1707675a471659d56c08c84569ee56a50581c"}, "author": "saudigazette.com.sa", "url": "http://saudigazette.com.sa/technology/google-launches-online-it-degrees-in-india/", "ord_in_thread": 0, "title": "Google launches online IT degrees in India", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(L-R), Senior Program Manager (Developer Relations) for Google Peter Lubbers, Development Manager for Tata Trusts Ganesh Neelam, Founder and CEO of Udacity Sebastian Thrun and Managing Director for Google South East Asia and India Rajan Anandan attend the launch of Android Nanodegree in India, in Bangalore on September 21, 2015. Google along with Tata Trusts launched a program to offer Android Nanodegrees in India in partnership with Udacity. AFP PHOTO/Manjunath KIRAN Bangalore — Search engine giant Google and online education company Udacity on Monday launched IT courses in India, branching outside the US to tap the country’s millions of software developers scrambling for jobs.\nThe pair teamed with Indian conglomerate Tata to offer online technical training courses, focusing on teaching software developers to build apps for Android, the Google-backed mobile operating system.\nCosting 9,800 rupees ($148) a month, the degrees will take between six and nine months to complete, with lessons from Google instructors based in the United States. Students will get 50 percent of tuition costs back on graduation.\nGoogle is looking to cash in on skilling up many of India’s 3.6 million developers, the second largest number worldwide, while at the same time seeking more developers who can programme for Android devices.\n“While India has millions of software developers, we still lag behind in creating world-class apps,” Google India managing director Rajan Anandan told reporters in India’s IT hub of Bangalore.\nThe companies will also offer 1,000 scholarships and all graduates will be invited to a job fair next year hosted by Google in India.\nThe launch comes as Indian Prime Minister Narendra Modi heads to Silicon Valley this weekend as part of a visit to the US, seeking foreign investment in India’s plethora of start-ups as well as financial tieups with US tech giants.\nModi, who will meet Facebook chief Mark Zuckerberg, is expected to reassure IT CEOs of efforts to reduce red tape and make it easier to do business in India, a massive market of 1.26 billion people.\nIndia also boasts a large number of engineering and IT specialists who have left the country to rise to the top of the US corporate world, including Google’s new chief executive Sundar Pichai and Microsoft boss Satya Nadella.", "external_links": [], "published": "2015-09-21T23:48:00.000+03:00", "crawled": "2015-10-11T17:04:13.947+03:00", "highlightTitle": ""}