{"organizations": [], "uuid": "9b6221640bcab4b00e8d6e847172264f8b3b856c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "phys.org", "main_image": "http://cdn.phys.org/newman/gfx/news/2015/61-researchersu.jpg", "site_section": "http://www.physorg.com/rss/rssbycategory.php?categ=16", "section_title": "Phys.org - latest science and technology news stories", "url": "http://phys.org/news/2015-10-human-technology-underserved-populations.html", "country": "US", "title": "Researchers using human sensing technology to study underserved populations", "performance_score": 0, "site": "phys.org", "participants_count": 0, "title_full": "Researchers using human sensing technology to study underserved populations", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T14:22:00.000+03:00", "replies_count": 0, "uuid": "9b6221640bcab4b00e8d6e847172264f8b3b856c"}, "author": "", "url": "http://phys.org/news/2015-10-human-technology-underserved-populations.html", "ord_in_thread": 0, "title": "Researchers using human sensing technology to study underserved populations", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Amy Mccaig"], "text": "Researchers using human sensing technology to study underserved populations October 15, 2015 by Amy Mccaig \nAs its first year wraps up, the Center of Excellence for Mobile Sensor Data-to-Knowledge (MD2K) has made significant progress toward its goal of using mobile sensor data to realize precision medicine. Through their involvement with MD2K, researchers at Rice University are using human sensing technology to study underserved populations. \nThe MD2K Center is tasked with developing the means to gather, analyze, visualize and interpret health-related mobile sensor data. This capability is critical to discovering new insights on the role of behavioral and environmental context in the onset and progression of disease. The ultimate goal is to develop timely and personalized mobile health interventions for early detection and prevention of disease, which will help realize President Barack Obama's vision of precision medicine . \nAn example of the MD2K team's progress in converting mobile sensor data into markers of poor health and risk factors is a computational model that automatically detects when a newly abstinent smoker lapses for the first time in a smoking-cessation attempt. Called \"puffMarker,\" the model uses hand gestures from smartwatches and breathing signature from a respiration sensor. \n\"Development of the puffMarker model has fulfilled a long-standing need in smoking cessation research to precisely pinpoint the timing of first lapse,\" said Santosh Kumar, director of MD2K. \"This work has opened the doors to discover potent markers in the data collected by mobile sensors that can be used to deliver just-in-time mHealth intervention to improve smoking-cessation rates.\" (mHealth is a term used for the practice of medicine and public health supported by mobile devices.) \nDavid Wetter, professor and the Elma W. Schneider Chair of Psychology at Rice and MD2K director of innovation in behavioral health, and Cho Lam, senior faculty fellow of psychology at Rice and an MD2K investigator, made significant contributions to various projects of the center. They helped with the development and refinement of puffMarker to detect smoking lapses. Working with their MD2K colleagues, Wetter and Lam applied for and received a new five-year grant from the National Cancer Institute to use puffMarker and other mobile sensors developed by MD2K to examine the pathways linking socioeconomic status to stress, smoking lapse and abstinence among smokers trying to quit. \nAccording to Wetter and Lam, the new award puts Rice at the forefront of applying mobile technologies in behavioral health research. They have also initiated a collaboration between MD2K and another National Institutes of Health (NIH) Big Data to Knowledge Center of Excellence to combine neuroimaging data with real-time, real-world data generated by on-body sensing technologies to better understand drug abuse. \nAll the models and markers developed by MD2K will be included in the open-source software (for mobile phone and cloud) soon to be released by MD2K that can be used widely by researchers, industry professionals and individuals to collect, analyze, visualize and interpret mobile sensor data for health. \nThe MD2K team comprises 20-plus faculty, 20-plus students, four staff and three software engineers from 12 institutions and the nonprofit Open mHealth. In its first year, the team has published nearly 60 papers in prominent data science research journals and health research journals, and the team has spoken at more than 60 professional meetings. \nThe center is one of 11 national Centers of Excellence funded through the NIH Big Data to Knowledge initiative, designed to support advances in research, policy and training needed for the effective use of big data in biomedical research.", "external_links": [], "published": "2015-10-15T14:22:00.000+03:00", "crawled": "2015-10-15T14:30:46.334+03:00", "highlightTitle": ""}