{"organizations": [], "uuid": "c6ac0b19ba81078edb0e3f0a26d6c99d82fa83d1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ajc.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/10/04/9c/89/100515_falcons_photos_CC18.JPG", "site_section": "http://www.ajc.com/s/news/technology/", "section_title": "Technology | Top News Page | AJC | www.ajc.com", "url": "http://www.ajc.com/news/sports/has-quinn-equaled-wins-falcons/nnt7R/", "country": "US", "title": "Has Quinn equaled wins for Falcons?", "performance_score": 0, "site": "ajc.com", "participants_count": 1, "title_full": "Has Quinn equaled wins for Falcons? | www.ajc.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T20:55:00.000+03:00", "replies_count": 0, "uuid": "c6ac0b19ba81078edb0e3f0a26d6c99d82fa83d1"}, "author": "Michael Cunningham", "url": "http://www.ajc.com/news/sports/has-quinn-equaled-wins-falcons/nnt7R/", "ord_in_thread": 0, "title": "Has Quinn equaled wins for Falcons?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "You know the old saying about correlation and causation but the Falcons, last seen in 2014 folding against the Panthers to finish 6-10, are 4-0 in 2015 after waylaying the Texans. And so it must be asked: Is new coach Dan Quinn responsible for the turnaround?\nIt’s a difficult question to answer with certainty because of the many variables at work, but Tony Dungy believes he has the answer.\n“It’s Dan Quinn, the new head coach,” Dungy said on NBC last night in explaining the difference between the 2014 and 2015 Falcons. “He’s brought an attitude to this team.”\nCoaches like Dungy love to say that other coaches can create something intangible like “attitude” and that it makes all of the difference. Maybe it does, and maybe Quinn really has done it for the Falcons, but it’s impossible to measure.\nI think there are more tangible reasons why the Falcons are better. For one, credit Quinn and GM Thomas Dimitroff for assembling an effective offensive line on the fly in the days before the season. The group appeared cohesive and dominant against the Cowboys and Texans.\nThe defense was awful in 2014. It’s been better this year, though there were issues before shutting down the short-handed Cowboys in the second half and bludgeoning the hapless Texans. The Falcons play a more basic defensive style under Quinn and Richard Smith and maybe that plus some personnel changes have helped.\nBut the most obvious difference for the Falcons, at least in my view, is offensive coordinator Kyle Shanahan’s work in replacement of Dirk Koetter.\nI’m not talking about play calling. That’s a silly thing to criticize or praise for anyone who is not an expert in offensive design and who does not have all of the information that goes into play selection. Real football is not like “Madden.” Most people blast play-calling after the fact.\nInstead, I think it's clear that Shanahan has made better use of his personnel than Koetter.\nThe Falcons had two running backs better than over-the-hill Steven Jackson on the roster last season: Devonta Freeman and Antone Smith. Yet Koetter kept force-feeding the ball to Jackson for reasons that were always mysterious because neither Koetter nor Mike Smith answered queries about the matter with any clarity.\nContrast that with Shanahan, who also force feeds a player but has the good sense to do it with his best one: Julio Jones. More than one Falcons opponent this season has pointed out how Shanahan makes it difficult to double-team Jones because he moves him all around the formation. Jones gushes about Shanahan's offense.\nThe Texans took away Jones, so the Falcons went to Freeman on the ground and Leonard Hankerson through the air. Hankerson was considered a bust with the Redskins but Shanahan thought enough of him to endorse bringing him to the Falcons for a reclamation. If Hankerson is getting his chances at the expense of all-time Falcons great Roddy White, then so be it.\nNow Shanahan also has the good sense to make Freeman the featured back. It’s true that Freeman’s chance came when Tevin Coleman went down but it may have come before then if not for injuries.\n“We had him back in OTAs and mini camps and we were real excited,” Shanahan said of Freeman last week. “Then he got hurt in training camp and we didn’t get to see him much. He just got healthy in those first two weeks of the year and he was still coming (strong).”\nI don’t know if Quinn has brought a new attitude to the Falcons. I do know that the Falcons are making better use of their personnel with Quinn and Shanahan, and kudos to them for that.", "external_links": ["https://en.wikipedia.org/wiki/Correlation_does_not_imply_causation"], "published": "2015-10-05T20:55:00.000+03:00", "crawled": "2015-10-05T20:28:28.165+03:00", "highlightTitle": ""}