{"organizations": ["Mega Port Infrastructure Drive Port Lighting Solutions Nigeria in Mega Port Infrastructure Drive", "Federal Government"], "uuid": "b93ddaec6566ef72c5a2ae8cbd9ebe5eb41db611", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.porttechnology.org", "main_image": "http://www.porttechnology.org/images/made/images/uploads/news/nigeria_in_mega_port_infrasructure_drive_330_220.jpg", "site_section": "http://www.porttechnology.org/rss_feeds/news/", "section_title": "Port Technology International - News", "url": "http://www.porttechnology.org/news/nigeria_in_mega_port_infrastructure_drive/", "country": "GB", "title": "Nigeria in Mega Port Infrastructure Drive", "performance_score": 0, "site": "porttechnology.org", "participants_count": 0, "title_full": "Nigeria in Mega Port Infrastructure Drive", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T11:29:00.000+03:00", "replies_count": 0, "uuid": "b93ddaec6566ef72c5a2ae8cbd9ebe5eb41db611"}, "author": "", "url": "http://www.porttechnology.org/news/nigeria_in_mega_port_infrastructure_drive/", "ord_in_thread": 0, "title": "Nigeria in Mega Port Infrastructure Drive", "locations": ["Nigeria"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mallam Habib Abdulahi"], "text": "Port Lighting Solutions Nigeria in Mega Port Infrastructure Drive 09 Oct 2015 Cargo Volumes and Throughput , Container   Global Economy/Trade , Going Places , Port Planning , Ports , Shipping Mallam Habib Abdulahi, Managing Director of Nigerian Ports Authority (NPA) has supported the provision of adequate port infrastructure by the Federal Government and the private-sector to facilitate export activities through the nation’s seaports. \nMr Abdulahi said that other factors which might be irrelevant to the authority are also critical towards achieving enhanced export activities in the nation’s seaports. \nMalam Habib assured that the NPA would encourage any effort designed to change the trade orientation of the nation from import dependent to export. \nHe reiterated that as globally accepted seaports account for over 80% by volume of international trade and commerce, emphasising that for a seaport to be competitive, it must have a robust infrastructural base amongst other requirements. \nTo read a Technical Paper on the benefits of offshore ports in the US and Africa, click here \nHe argued that with the major infrastructural improvements embarked upon by the authority in its ports and harbour in all its four pilotage districts, coupled with the impending 25 year port master plan which has reached an advanced stage, the organisation is being positioned to properly meet the demand of all categories of port users for both imports and exports. \nThe NPA is also consolidating and entrenching the gains of the port reform by facilitating and synergising the activities of the private terminal operators, shipping lines, freight forwarders and other stakeholders, as well as improving the existing port infrastructure. \nThe projects are intending to add efficiency to the nation’s seaports as well as to make the system competitive, effective and user friendly.", "external_links": [], "published": "2015-10-09T11:29:00.000+03:00", "crawled": "2015-10-09T16:57:12.968+03:00", "highlightTitle": ""}