{"organizations": [], "uuid": "5a0ba5fda393554130cf305fc837e078ddf81aa7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.techradar.com", "main_image": "http://cdn.mos.techradar.com/art/software/Adobe/Photoshop%20Elements%2014/Screenshots/elements14-feature-1200-80.jpg", "site_section": "http://www.techradar.com/rss/reviews", "section_title": "TechRadar: Technology reviews", "url": "http://www.techradar.com/reviews/pc-mac/software/graphics-and-media-software/image-editing-software/adobe-photoshop-elements-14-1306398/review", "country": "GB", "title": "Adobe Photoshop Elements 14", "performance_score": 0, "site": "techradar.com", "participants_count": 2, "title_full": "Adobe Photoshop Elements 14 review | TechRadar", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T16:00:00.000+03:00", "replies_count": 1, "uuid": "04de9ad75906bac39446a8541b398991d584fb05"}, "author": "James Paterson", "url": "http://www.techradar.com/reviews/pc-mac/software/graphics-and-media-software/image-editing-software/adobe-photoshop-elements-14-1306398/review#post-0", "ord_in_thread": 0, "title": "Adobe Photoshop Elements 14", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photoshop Elements is Adobe's cut-price consumer version of Photoshop CC. Although it doesn't offer the full feature set of its bigger brother, there's plenty of depth to this beginner-friendly photo editor. Unlike CC, a monthly subscription isn't required, so it's worth considering if you prefer to pay up front for your software. If you're into video editing, you can also choose to buy it bundled with Adobe Premiere Elements.\nThis is the 14th version of Photoshop Elements. With new features such as shake reduction and dehaze, as well as improvements to facial recognition and guided edits, the photo editor has much to offer for both beginners and experienced users.\nElements comes in two parts, the organizer and the editor. The editor also includes a pared-down version of Adobe Camera Raw for processing images taken in the raw format.\nThe Elements organizer The organizer is for sorting your image library, with intelligent modes that help to divide your photos into categories based on People, Places and Events. All three categories have been improved since Elements 13. Facial recognition is the biggest revelation. Tasked with pulling out faces from a set of 200 wedding photos, the new organizer's success rate was about a third better than the old Elements 13 organizer, with fewer mistakes. What's more, as you add new photos Elements will recognise faces and automatically add them to a person's stack. If you like to organise your photos by faces, the improvements are very welcome.\nQuick Edits Elements' photo editor is split into three editing modes, Quick, Guided and Expert. Alongside this is eLive, which gives access to a curated selection of online tutorials. Each of the three editing modes cater for different levels of expertise. In the Quick mode, settings and menus are kept to a minimum, with access to simple tonal adjustments and one-click effects. Along with the 50 or so useful ready-made effects, new to Elements 14 are 'Smart Looks'. This feature pulls out five effects from a database of over 2500, based on analysis of the image in question. It's an interesting approach to the current craze for retro effects that says, rather than just adding a generic preset, we'll instead tailor that preset to a particular image. However, in practice the five effects it offers can often seem rather random.\nNew Guided edits For those who want to take their image-editing further, the Guided mode offers 40 step-by-step guides for tasks like creating composites, spot color effects and restoring old photos. The interface has been improved in Elements 14, with interactive sliders that show before/after images for each effect.\nThere are also two new guided edits. The first addresses one of the most frequent questions posed by beginners – How do I resize my photo for web/print? The solution is a step by step tutorial with quick access to all the relevant tools. This may not be offering anything new in terms of tools, but it's an astute feature that helpfully guides beginners through a perplexing process. The other new guided edit is for adding motion blur to suggest subject movement, which, although fun, is more of a gimmick.\nOne of the clever things about the three editing modes is that you can switch between them as you go. For example, if you use a guided edit to add a zoom burst effect and then switch to the Expert mode, you can peek under the hood of the guided edit to see how the effect takes shape on different layers. It's a useful learning device that will help beginners to get to grips with Photoshop fundamentals like layers and masks. Then once you're ready to make the move, the Expert Mode gives you full access to all the wonderful tools, filters, layer styles, blend modes, and other features that Elements offers.", "external_links": ["http://cdn0.mos.techradar.futurecdn.net//art/software/Adobe/Photoshop%20Elements%2014/Screenshots/pse14_4b_guided_resize-320-80.jpg", "http://cdn1.mos.techradar.futurecdn.net//art/software/Adobe/Photoshop%20Elements%2014/Screenshots/pse14_4a_guided__home-320-80.jpg", "http://cdn1.mos.techradar.futurecdn.net//art/software/Adobe/Photoshop%20Elements%2014/Screenshots/pse14_4a_guided__home-650-80.jpg", "http://cdn4.mos.techradar.futurecdn.net//art/software/Adobe/Photoshop%20Elements%2014/Screenshots/pse14_3_quick_mode_smart_looks-650-80.jpg", "http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg", "http://cdn4.mos.techradar.futurecdn.net//art/software/Adobe/Photoshop%20Elements%2014/Screenshots/pse14_3_quick_mode_smart_looks-320-80.jpg", "http://cdn0.mos.techradar.futurecdn.net//art/software/Adobe/Photoshop%20Elements%2014/Screenshots/pse14_4b_guided_resize-650-80.jpg"], "published": "2015-10-09T16:00:00.000+03:00", "crawled": "2015-10-11T10:58:08.393+03:00", "highlightTitle": ""}