{"organizations": [], "uuid": "cb2448d3c98db84c565ff8910d45d713dad7c863", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.scoopasia.com", "main_image": "", "site_section": "http://scoopasia.com/index.php/syndication/news/C12/", "section_title": "Press Releases - Enterprise Technology", "url": "http://news.scoopasia.com/index.php/news/gemalto_first_to_achieve_the_highest_security_standards_at_all_its_id_docum/", "country": "US", "title": "Gemalto First to Achieve the Highest Security Standards at All Its ID Document Production Sites", "performance_score": 0, "site": "scoopasia.com", "participants_count": 0, "title_full": "Gemalto First to Achieve the Highest Security Standards at All Its ID Document Production Sites", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T01:14:00.000+03:00", "replies_count": 0, "uuid": "cb2448d3c98db84c565ff8910d45d713dad7c863"}, "author": "", "url": "http://news.scoopasia.com/index.php/news/gemalto_first_to_achieve_the_highest_security_standards_at_all_its_id_docum/", "ord_in_thread": 0, "title": "Gemalto First to Achieve the Highest Security Standards at All Its ID Document Production Sites", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Gemalto First to Achieve the Highest Security Standards at All Its ID Document Production Sites AMSTERDAM, 15 October 2015 -- (ACN Newswire) -- Gemalto, the world leader in digital security, has been awarded the Intergraf ISO 14298 certification for its operation in Gdansk, Poland. This official recognition by Intergraf, the Federation for Print and Digital Communication, places Gemalto in the unique position of having all its five ID document production sites formally certified. As a result, the company can offer clients unrivaled business continuity and global supply chain integrity for the production of a wide range of innovative documents including ePassports and eID cards.This new certification is an international standard that specifies requirements for an organization's security management system. Intergraf provides confidential Implementation Guidelines and Intergraf Certification Requirements (ICR), exclusively developed for the high security printing industry and the specific needs of this market. Gemalto's clients now benefit from this uncompromising level of performance, ensuring that ID manufacturing programs enjoy outstanding protection against the risk of disruption. This facility in Poland joins other Gemalto sites in Brazil, Finland and Switzerland that have successfully completed the lengthy and exacting process of certification by Intergraf's inspection team. \"Counterfeiting is a serious and critical issue for national security printers, end users and authorities. Intergraf's mission is to protect this highly secure industry and contribute to the fight against fraud with the help of certifications,\" said Patricia Engler, Customer Relations & Certification Director at Intergraf. \"Intergraf is extremely pleased that Gemalto has met our stringent criteria. This certification reinforces Gemalto's positioning as a recognized reference for governments that rely on essential security management procedures.\" \"Achieving ISO 14298 certification at Gdansk is the latest stage in a business strategy that combines innovative document design with optimum production strength,\" said Youzec Kurp, Vice President of Government Programs at Gemalto. \"Having all our production sites certified enables Gemalto to even better serve its customers. It's a commitment to continuous delivery of national documents. We strongly support business continuity planning as it provides an opportunity to not only plan for, respond to, and recover from specific events, but also improve overall operations and processes.\" Press release (PDF): http://hugin.info/159293/R/1958788/713840.pdf About Gemalto Gemalto (Euronext NL0000400653 GTO) is the world leader in digital security, with 2014 annual revenues of EUR 2.5 billion and blue-chip customers in over 180 countries. Gemalto helps people trust one another in an increasingly connected digital world. Billions of people want better lifestyles, smarter living environments, and the freedom to communicate, shop, travel, bank, entertain and work - anytime, everywhere - in ways that are enjoyable and safe. In this fast moving mobile and digital environment, we enable companies and administrations to offer a wide range of trusted and convenient services by securing financial transactions, mobile services, public and private clouds, eHealthcare systems, access to eGovernment services, the Internet and internet-of-things and transport ticketing systems. Gemalto's unique technology portfolio - from advanced cryptographic software embedded in a variety of familiar objects, to highly robust and scalable back-office platforms for authentication, encryption and digital credential management - is delivered by our world-class service teams. Our 14,000 employees operate out of 99 offices, 34 personalization and data centers, and 24 research and software development centers located in 46 countries. For more information visit http://www.gemalto.com , http://www.justaskgemalto.com, blog.gemalto.com, or follow @gemalto on Twitter. Gemalto media contacts:", "external_links": [], "published": "2015-10-15T01:14:00.000+03:00", "crawled": "2015-10-16T16:23:22.560+03:00", "highlightTitle": ""}