{"organizations": [], "uuid": "7e9d01184eb8206b83cfe4f09845943ccd076305", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1135803/launch-disney-s-playmation-heralds-new-way-play-kids-and-families", "country": "US", "title": "Launch of Disney’s Playmation Heralds a New Way to Play for Kids and Families", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "Launch of Disney’s Playmation Heralds a New Way to Play for Kids and Families", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T16:01:00.000+03:00", "replies_count": 0, "uuid": "7e9d01184eb8206b83cfe4f09845943ccd076305"}, "author": "admin", "url": "http://www.freshnews.com/news/1135803/launch-disney-s-playmation-heralds-new-way-play-kids-and-families", "ord_in_thread": 0, "title": "Launch of Disney’s Playmation Heralds a New Way to Play for Kids and Families", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Companies mentioned in this article: Disney Consumer Products and Interactive Media \nGLENDALE, Calif. -- (BUSINESS WIRE) -- Disney Consumer Products and Interactive Media (DCPI) and Hasbro, Inc. today launched Playmation Marvel’s Avengers – the next step in the evolution of play. The groundbreaking system of connected toys and wearables fuses technology and digital storytelling to create a completely new category of play. Hitting shelves across the U.S. and Canada for the first time today, the new toy/game hybrid aims to inspire both kids and parents to get active and creative at playtime. This Smart News Release features multimedia. View the full release here: http://www.businesswire.com/news/home/20151004005069/en/ A family plays with Playmation Marvel’s Avengers - the ground breaking new system of connected toys and wearables fuses technology and digital storytelling to create a completely new category of play product, from Disney Consumer Products & Interactive Media. Playmation Marvel’s Avengers is now available for purchase across the US and Canada (Photo by Dan Steinberg/Invision for Disney Consumer Products/AP Images) \nDreamed up by a team of technologists, Imagineers and storytellers from across The Walt Disney Company, Playmation is the culmination of extensive research into the world of play, highlighting the opportunity for a new type of experience that combines digital technology and physical, real-world play. \nThe online study of 2,000 families across the country confirms that almost all parents believe active playtime is essential to their child’s healthy development, and three say that using technology is a favorite way for their child to play. Four out of five parents say their children are more likely to engage with a game if technology is involved, and nine out of ten are open to new technologies that encourage their kids to be more active. \n“Playmation blends technology, storytelling and imagination in a way that’s made for today’s digitally-savvy kids. Our research shows families are looking for a new way to play that’s active, creative and technology-infused – and Playmation is just that,” said Nitin Chawla, Vice President, Strategy and Business Development, DCPI. \nThe study also revealed the potential of Playmation as a new way for families to play together, with 67% of kids and 79% of parents saying they would like more playtime as a family. While active play is the type of play parents enjoy the most with their kids, currently only one in five finds time for it every day, and three quarters would like to do more of it. Nearly all parents (98%) also believe it is important that their children engage in imaginative play. \nRecently added to Time To Play Magazine’s “Most Wanted” list for the holidays, along with other holiday “hot toy” accolades from Parents magazine, Toys “R” Us , The Toy Insider and the National Parenting Publication Awards , the Playmation Marvel’s Avengers Starter Pack includes five connected toys: one piece of Avenger Gear (Repulsor), two Power Activators and two Smart Figures – a Super Hero (Captain America) and a Super Villain (Iron Skull), as well as 25 missions. Getting started is easy, strap the high-tech Repulsor Gear onto your arm (it fits adults, too!) and listen closely to JARVIS as he takes you through the tutorial on how to control your new Gear, inspired by Iron Man technology. \n“This is classic play re-imagined for the tech-savvy world. It's narrative-based, imaginative play that allows kids to play as their heroes and imagine themselves in battles alongside their favorite Marvel Avengers characters. The immersive play experience is active and exciting for kids of all ages and represents a completely new category of toys,” said Jim Silver, Editor in Chief and CEO of TTPM. \nAdditional connected toys available now include: Smart Figures – Iron Man, Black Widow, HULK, M.O.D.O.K., Ultron Bot, and Hulkbuster – which help players unlock new storylines and abilities when placed on the Power Activator and connected with Avenger Gear; and the Prowler Bot – a robotic villain – who can find and hunt your Avenger Gear with 360 degree movement, while taking on dozens of enemy personas and abilities making game play even more challenging. \nAlong with the Starter Pack and other connected toys, fans can download and access the AvengersNet App where you can register your Avenger Gear to see progress, explore additional locations and characters, check out and test Avenger Gear upgrades, gain access to new missions and more. The AvengersNet App is available in the Apple App Store. An Android version of the app is currently in development. \nPlaymation Marvel’s Avengers uses familiar technologies including smart toys, wearables, wireless technology, motion sensors and more, but applies them in ways that are completely new to create a compelling play experience. Playmation is purposely not tethered to an Internet connection so players can run around and explore each adventure from anywhere they want – a bedroom, living room or yard. With multiplayer modes, players can sync their Avenger Gear to tackle missions and combat arenas together, or face-off in competitive play. \n“With the launch of Playmation, we are not only creating a new play experience for today’s kids but celebrating a new chapter in our long-term partnership with Disney,” said Jerry Perez, SVP Global Brand Marketing, Hasbro. “Playmation has been a true collaboration, from global consumer research to product design and development, and we look forward to sharing this amazing new system of play with kids and families around the world.” \nThe Playmation Marvel’s Avengers Starter Pack has a suggested retail price of $119.99 and is available in the United States and Canada at mass and specialty retailers, such as Amazon.com, Best Buy, Game Stop, Target, Toys “R” Us, and Walmart, as well as select Disney Store locations and DisneyStore.com. Additional Playmation Marvel’s Avengers connected toys compatible with the Starter Pack, such as Smart Figures and the Prowler Bot are also sold separately. \nOffered by PowerA, families can also choose from a selection of Playmation recharging solutions and accessories now available, including:Playmation Home Base – to store your gear in between battles; Playmation Avengers Lab Gear Bag – for taking your gear on-the-go; Playmation Repulsor Recharge Pack – provides up to five hours of play on a single charge and fits securely onto the bottom of the Repulsor; and Playmation Activator Recharge Pack –fits securely onto the bottom of the Power Activator and provides up to 10 hours of play on a single charge. \nFamilies that are coming to the Disney Store to pick up Playmation Marvel’s Avengers (either from pre-orders or to purchase that day), will be given the opportunity to participate in a personalized pick-up ceremony taking place in select Disney Stores across the United States and Canada beginning now through the holidays. When guests purchase Playmation Marvel’s Avengers, JARVIS will make an announcement in-store thanking guests for choosing to help the Avengers in their fight against Ultron. \nASSETS:", "external_links": [], "published": "2015-10-04T16:01:00.000+03:00", "crawled": "2015-10-04T20:51:00.145+03:00", "highlightTitle": ""}