{"organizations": [], "uuid": "0027c87aba5219f3b47d2b2450cf7725345b3536", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theatlantic.com", "main_image": "http://cdn.theatlantic.com/assets/media/img/mt/2015/10/crimson-1/facebook.jpg?1444968316", "site_section": "http://www.theatlantic.com/writers/", "section_title": "The Atlantic — News and analysis on politics, business, culture, technology, national, international, and life – TheAtlantic.com", "url": "http://www.theatlantic.com/entertainment/archive/2015/10/crimson-peak-aims-for-the-jugular/410887/", "country": "US", "title": "'Crimson Peak': Guillermo del Toro's Gothic Romance Is Bloody Entertaining", "performance_score": 0, "site": "theatlantic.com", "participants_count": 16, "title_full": "'Crimson Peak': Guillermo del Toro's Gothic Romance Is Bloody Entertaining - The Atlantic", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T18:54:00.000+03:00", "replies_count": 42, "uuid": "0027c87aba5219f3b47d2b2450cf7725345b3536"}, "author": "David Sims", "url": "http://www.theatlantic.com/entertainment/archive/2015/10/crimson-peak-aims-for-the-jugular/410887/", "ord_in_thread": 0, "title": "'Crimson Peak': Guillermo del Toro's Gothic Romance Is Bloody Entertaining", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "During a tense, pivotal moment in Guillermo del Toro’s new thriller, Crimson Peak , Lady Lucille Sharpe (Jessica Chastain) serves a young bride, Edith Cushing, (Mia Wasikowska) a cup of tea. Every moment is infused with as much drama as possible; as Lucille spoons sugar into the tea, she scrapes it along the rim, towards Edith, with what can only be described as murderous intent. That’s the kind of movie Crimson Peak is: Del Toro won’t let a scene pass without smashing the audience in the face with it, but you can’t help but admire his audacity.\nRelated Story The Enduring Creepiness of Haunted-House Films\nThe director has shied away from describing Crimson Peak as a horror film, though it contains many ghosts, a few jump scares, and as many suspenseful creaks and groans as can fit in its two-hour running time. Instead, he’s billed it as a “Gothic romance” in the vein of Alfred Hitchcock’s Rebecca or George Cukor’s Gaslight. In terms of dialogue and acting, the film certainly has that 1940s Old Hollywood style: The dialogue is either nakedly emotional or thuddingly symbolic, and the eventual plot twists are easy to get. Though Crimson Peak ’s tone is arch enough that it won’t be for everyone, there’s definitely a gory, beating heart at its core.\nThe characters are straight out of a romance novel. Edith is the plucky heroine, an aspiring novelist patronized at every turn by 19th-century misogyny; her only defender is her industrialist father (Jim Beaver), who meets a nasty and suspicious end when he objects to her new suitor, the penniless English lord Thomas Sharpe (Tom Hiddleston). Thomas whisks Edith off to his family home, a crumbling manse nicknamed Crimson Peak that is, without hyperbole, the most-haunted house in the history of the world.", "external_links": [], "published": "2015-10-16T18:54:00.000+03:00", "crawled": "2015-10-16T18:13:43.369+03:00", "highlightTitle": ""}