{"organizations": [], "uuid": "236a564dbeb1df06b9a3514e247286893208a845", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.morningstar.com", "main_image": "", "site_section": "http://news.morningstar.com/all/dow-jones/technology.aspx", "section_title": "News Archive: Technology", "url": "http://news.morningstar.com/all/dow-jones/technology/2015101410093/payments-startup-square-discloses-ipo-plans.aspx", "country": "US", "title": "Payments Startup Square Discloses IPO Plans", "performance_score": 0, "site": "morningstar.com", "participants_count": 1, "title_full": "Payments Startup Square Discloses IPO Plans", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "236a564dbeb1df06b9a3514e247286893208a845"}, "author": "morningstar.com", "url": "http://news.morningstar.com/all/dow-jones/technology/2015101410093/payments-startup-square-discloses-ipo-plans.aspx", "ord_in_thread": 0, "title": "Payments Startup Square Discloses IPO Plans", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Payments startup Square Inc. officially filed to go public Wednesday, a move that comes as the market for initial public offerings remains shaky.\nWith a roughly $6 billion valuation primarily from venture-capital firms, Square's entry into public markets is one of the most anticipated in technology and could give a boost to a tepid IPO season so far this year.\nThe San Francisco maker of credit card-reading devices filed to offer up to $275 million in stock, but that amount may be a placeholder used to calculate registration fees and is subject to change. The company plans to trade on the New York Stock Exchange under the symbol SQ.\nSquare's filing follows The Wall Street Journal's report in July that the company filed for an offering under the Jumpstart Our Business Startups Act, which permits companies with under $1 billion in annual revenue to file their IPO paperwork confidentially.\nThe sharp stock-market swings of late August and September have deterred some companies from pursuing public listings. Luxury retailer Neiman Marcus Group Inc. on Tuesday said it would delay its planned IPO and supermarket operator Albertsons Cos., which was due to price Wednesday evening, followed suit. Albertsons and payment-processing company First Data Corp., whose offering priced below expectations Wednesday, were expected to be two of the largest offerings of the year.\nSquare has been in the spotlight because of Jack Dorsey's dual role as Square's chief executive and his recent return to the top spot at Twitter Inc. Mr. Dorsey, who is 38 years old, co-founded Square after leaving Twitter in 2008.\nHe owns 24.4% of Square, according to Wednesday's filing, while venture-capital firm Khosla Ventures holds a 17.3% stake.\nMr. Dorsey will likely face questions about his willingness and availability to ensure Square gets the highest possible value from public investors. Several Wall Street money managers have said Square's IPO valuation may need to be discounted as a result.\nLast year, Square's loss widened to $154.1 million from $104.5 million. But revenue totaled $850.2 million, up sharply from 2013's $552.4 million. Transaction revenue provided $707.8 million of the total.\nStarbucks Corp. has been a prominent venue for Square, which has a line in its financial statements singling out Starbucks transaction revenue, a figure totaling $123 million last year.\nHowever, Square warns in the risk factors section of the filing that it anticipates Starbucks will transition to another payment processor and will cease using its payment processing services before the scheduled expiration of their processing agreement next year. It added its revenue may decrease meaningfully in the future.\nFor its part, the coffee retailer has said it would begin accepting Apple Pay in some U.S. stores this year.\nThe road to an IPO could answer some of the questions hanging over Square, a six-year-old company which takes its name from the shape of its small gadgets that plug into smartphones and tablets to process credit cards.\nSquare has turned more of its focus to small-business lending and peer-to-peer payments after projects like its digital wallet and e-commerce marketplace failed to gain traction. Square's credit-card readers are commonly seen in coffee shops and taco trucks where merchants attach them to their smartphones or tablets, allowing them to accept credit or debit-card payments anywhere.\nSquare gives its devices away and charges 2.75% of each transaction.\nThe recent spinout of PayPal Holdings Inc. from its former parent eBay Inc. could set a bar for investors trying to assign a public-market value for Square.\nGoldman Sachs, Morgan Stanley, and J.P. Morgan are lead joint book-running managers for the proposed IPO.\nProceeds will be used for purposes include working capital. The company said it may use some of the funds for acquisitions but hasn't entered any specific agreements or commitments.\nU.S. listings had raised about $30 billion through the end of Tuesday, compared with $82 billion by that point last year and $42 billion in that periodof 2013, according to Dealogic.\nWrite to Josh Beckerman at josh.beckerman@wsj.com\nAccess Investor Kit for \"Apple, Inc.\"\nVisit http://www.companyspotlight.com/partner?cp_code=P479&isin=US0378331005\n 14, 2015 16:45 ET (20:45 ", "external_links": ["http://im.mstar.com/Im/Mbr/Form_PremCheckbox_Checked.gif", "http://www.companyspotlight.com/partner?cp_code=P479&isin=US0378331005", "http://www.addthis.com/bookmark.php?v=250", "http://im.mstar.com/Im/Mbr/Form_PremCheckbox_Unchecked.gif", "http://s7.addthis.com/static/btn/sm-share-en.gif"], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-15T03:40:31.444+03:00", "highlightTitle": ""}