{"organizations": ["Canon U.S.A."], "uuid": "5b3139238e894e08a8d48bd2329638c9cab90c31", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.businesswire.com", "main_image": "", "site_section": "http://feed.businesswire.com/rss/home/?rss=G1QFDERJXkJeGVpSWw==", "section_title": "Business Wire Technology: Consumer Electronics News", "url": "http://www.businesswire.com/news/home/20151014006003/en/Canon-U.S.A.-Receives-U.S.-EPA-2015-SmartWay%C2%AE", "country": "US", "title": "Canon U.S.A. Receives U.S. EPA 2015 SmartWay® Excellence Award", "performance_score": 0, "site": "businesswire.com", "participants_count": 0, "title_full": "Canon U.S.A. Receives U.S. EPA 2015 SmartWay® Excellence Award", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T17:01:00.000+03:00", "replies_count": 0, "uuid": "5b3139238e894e08a8d48bd2329638c9cab90c31"}, "author": "", "url": "http://www.businesswire.com/news/home/20151014006003/en/Canon-U.S.A.-Receives-U.S.-EPA-2015-SmartWay%C2%AE", "ord_in_thread": 0, "title": "Canon U.S.A. Receives U.S. EPA 2015 SmartWay® Excellence Award", "locations": ["U.S."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Canon U.S.A. Receives U.S. EPA 2015 SmartWay® Excellence Award Company Recognized as a Top Environmental Performer and Leader for Freight Supply Chain Efficiency October 14, 2015 10:01 AM   \nMELVILLE, N.Y.- Canon U.S.A., Inc., a leader in digital imaging, today announced the Company has been honored with a SmartWay® Excellence Award from the U.S. Environmental Protection Agency for serving as an industry leader in freight supply chain environmental performance and energy efficiency. Canon’s proactive measures to reduce transportation-related greenhouse gas emissions, including strategies such as modal shifting, load efficiency and encouraging carriers to join the SmartWay Transport Partnership, have earned the Company this esteemed distinction. \n“We are proud to be recognized for our efforts to minimize our environmental footprint,” said Kazuhiko Sasahara, general manager, Logistics Division, Canon U.S.A., Inc. “Canon’s high regard for resource conservation is reflected throughout each stage of the product life cycle, including shipping. This respect for our planet drives us to help preserve our resources for generations to come, and we look forward to continuing this great tradition.” \nCanon U.S.A., Inc. was one of nine companies representing the best environmental performers among SmartWay’s nearly 250 Shipper partners, to receive this distinction. The shipper and logistics Excellence Awardees were honored at U.S. EPA’s Technology Showcase held at the National Vehicle and Fuels Emissions Laboratory in Ann Arbor, Michigan on October 13, 2015. \n“EPA is pleased to honor these SmartWay Partners with a 2015 Excellence Award,\" said Chris Grundler, director, EPA Office of Transportation & Air Quality. “Through their environmental leadership in greener goods movement, each of these companies is demonstrating its commitment to our shared goal of a healthier, more sustainable future for the communities and families we serve.” \nFor more information about the Canon USA visit www.usa.canon.com . \nAbout Canon U.S.A., Inc. \nCanon U.S.A., Inc., is a leading provider of consumer, business-to-business, and industrial digital imaging solutions to the United States and to Latin America and the Caribbean (excluding Mexico) markets. With approximately $31 billion in global revenue, its parent company, Canon Inc. (NYSE:CAJ), ranked third overall in U.S. patents granted in 2014† and is one of Fortune Magazine's World’s Most Admired Companies in 2015. Canon U.S.A. is committed to the highest level of customer satisfaction and loyalty, providing 100 percent U.S.-based consumer service and support for all of the products it distributes. Canon U.S.A. is dedicated to its Kyosei philosophy of social and environmental responsibility. In 2014, the Canon Americas Headquarters secured LEED® Gold certification, a recognition for the design, construction, operations and maintenance of high-performance green buildings. To keep apprised of the latest news from Canon U.S.A., sign up for the Company's RSS news feed by visiting www.usa.canon.com/rss and follow us on Twitter @CanonUSA. \nAbout SmartWay \nEPA’s SmartWay Transport Partnership is a market-driven initiative that empowers businesses to move goods in the cleanest, most energy-efficient way possible, while protecting public health and reducing the impacts of climate change. Demonstration of a commitment to corporate sustainability and social responsibility through SmartWay provides for a more competitive and environmentally-friendly business environment. Since 2004, SmartWay Partners have saved 144.3 million barrels of oil and $20.6 billion in fuel costs. SmartWay’s clean air achievements (61.7 million metric tons of carbon dioxide, 1,070,000 tons of nitrogen oxides, and 43,000 tons of particulate matter emissions avoided) help to protect the well-being of citizens. \nMore information on SmartWay in general: http://www.epa.gov/smartway/ \nList of Excellence Award recipients: http://epa.gov/smartway/about/sw-awards.htm#aboutawards \n†Based on weekly patent counts issued by United States Patent and Trademark Office. \nAll referenced product names, and other marks, are trademarks of their respective owners. Contacts", "external_links": [], "published": "2015-10-14T17:01:00.000+03:00", "crawled": "2015-10-14T17:57:37.899+03:00", "highlightTitle": ""}