{"organizations": [], "uuid": "fe690792636e9f315fb5b7d395ffb270751662f3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.digitaltrends.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/0/0/JapanFireStreaming.jpg", "site_section": "http://www.foxnews.com/tech/", "section_title": "Technology News | Internet, Mobile, and Social Media News | Fox News", "url": "http://www.digitaltrends.com/web/man-accidentally-sets-fire-to-home-during-live-stream/", "country": "US", "title": "Japanese man accidentally sets fire to his home during live stream", "performance_score": 0, "site": "digitaltrends.com", "participants_count": 2, "title_full": "Japanese man accidentally sets fire to his home during live stream | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 1, "uuid": "74b5b7c936985d55ba060f8f5e4fcf343240efc9"}, "author": "Trevor Mogg", "url": "http://www.digitaltrends.com/web/man-accidentally-sets-fire-to-home-during-live-stream/#post-0", "ord_in_thread": 0, "title": "Japanese man accidentally sets fire to his home during live stream", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Trevor Mogg\nPublished October 05, 2015 Facebook 0 Twitter 0 livefyre Email Print Screenshot from YouTube video (みっと)\nIf you really must do a live stream about your newly acquired lighter, best you don't smoke a cigarette while you're doing it. And maybe put aside your regular lighter. And take a bit more care with flammable liquids. You might want to remove nearby trash bags full of paper, too.\nBroadcasting from his bedroom over the weekend, a guy in Japan ignored all of the above, his foolish attitude resulting in a live stream as spectacular as it was disastrous.\nInferno After four-and-a-half minutes spent fiddling about with his new gadget, the star of the stream finally manages to light the permanent match, a contraption that, as its name suggests, makes regular matches a thing of the past. Trouble is, because he failed to fully clear up an earlier oil spill, the lit flame is bigger than expected, causing him to drop the burning lighter on the floor.\nAs he tries to deal with the blaze to his left, he fails to notice another fire in a garbage bag to his right. At this point, members of his audience can be heard trying to alert him to the garbage fire behind him, with text-to-speech messages urging the unfortunate streamer to turn around.\nFrom here the situation develops very quickly from bad to downright scary. For the next six minutes we witness the guy's futile, and quite frankly abysmal, efforts to extinguish the growing fire using anything he can lay his hands on. Half a bottle of water. Cardboard boxes (yes, cardboard boxes ), a blanket, more water. The audience sensibly suggests grabbing a fire extinguisher, or, here's a good one: calling the fire department .\nRelated: Lamborghini Gallardo catches fire at 207 mph\nAs the fire continues to rage, smoke fills the room and the stream finally cuts, presumably because the computer and all its innards melted.\nWhile currently unconfirmed, some websites have linked the fire to an incident on Sunday on the island of Shikoku, about 350 miles south-west of Tokyo. Reports suggest the fire occurred on the second floor of a family home , and while no one died, three people are believed to have been treated for burns.\nAs for the hapless streamer, we suggest he stays well away from this particular contraption for his next live demo.", "external_links": ["http://global.fncstatic.com/static/managed/JapanFireStreaming.jpg", "http://www.digitaltrends.com/", "https://www.youtube.com/embed/c_orOT3Prwg", "http://www.digitaltrends.com/cool-tech/xmatter-flamethrower-now-for-sale/", "http://global.fncstatic.com/static/managed/img/share/source/156-digital-trends.png", "http://www.digitaltrends.com/home/", "http://www.digitaltrends.com/cars/video-sweet-balls-fire-thats-flaming-lamborghini-gallardo/"], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-06T05:48:00.252+03:00", "highlightTitle": ""}