{"organizations": [], "uuid": "b74b7a6767ab5c623e6889da6b8ae55909fa5be2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/10/15/13022610/Press-Release---Phone-Screen.gif", "site_section": "http://www.prweb.com/rss2/techmobile.xml", "section_title": "Technology: Mobile", "url": "http://www.prweb.com/releases/beerbugnewprice/oct2015/prweb13022610.htm", "country": "US", "title": "Industry Leading BeerBug is Now Available to Brewers for Just $199", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Industry Leading BeerBug is Now Available to Brewers for Just $199", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "b74b7a6767ab5c623e6889da6b8ae55909fa5be2"}, "author": "Taylor McClenny", "url": "http://www.prweb.com/releases/beerbugnewprice/oct2015/prweb13022610.htm", "ord_in_thread": 0, "title": "Industry Leading BeerBug is Now Available to Brewers for Just $199", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ParasitX, the manufacturer of BeerBug, today announced that its has lowered the price on its industry leading BeerBug product. Taylor McClenny, CTO of Parasitx, says, “A perfect brew is now within the reach of every home brewer with the BeerBug now available at $199. At this new price, the never seen before data provided by the BeerBug is affordable to the entire brewing community.” The introduction of the BeerBug sensor to home brewing changed the ability of brewers to truly monitor beer during the fermentation process. Using proprietary technology, a beer’s fermentation progress can be tracked in real time at the brewer’s convenience from the web, iOS, or Android app. Transforming the brewing process, the BeerBug give brewers the detailed data necessary for close monitoring and control of their brew for better tasting results. Minute by minute readings give brewers the ability to track their brew’s fermentation to ensure the appropriate final gravity is reached, which is key to a successful brew.\nWith the BeerBug, brewers now have exact, real time measurements that allow for continual monitoring throughout the brewing process and better tasting beer. The BeerBug has ended the age of guessing within the brewing community and provides all brewers with the opportunity to fully monitor and understand their brew during the fermentation process. At such an affordable price, data and knowledge is accessible to all, and brewing practices will be revolutionized across the community.\nIn addition to revolutionizing the individual brewer’s process, the BeerBug connects users across the world through the sharing of brew data. A new global brewing community has been created across 45 countries through users’ ability to view fermentation graphs of any current brew.\n“The BeerBug provides the brewing community with a level of detail that has never existed before in fermentation data,” Taylor added. “Specific gravity, temperature and alcohol percentage readings are continually taken and then sent to the cloud. With real time fermentation data, brewers are able to detect temperature changes and adjust before the beer’s flavor is impacted.”\nThe new lower price is effective immediately for orders received from the BeerBug website.\nAbout ParasitX\nParasitX designs and manufactures sensors and actuators for the “Internet of Things” and with them, authentically engages its customers, weaving its products into their everyday lives through embedded social networking software tools. Through its flagship product, the BeerBug, ParasitX is transforming the way brewers around the world pursue their passion of brewing beer. ParasitX is based in Newport News, Virginia. To learn more, visit http://www.thebeerbug.com .", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy50aGViZWVyYnVnLmNvbQ=="], "published": "2015-10-20T03:00:00.000+03:00", "crawled": "2015-10-20T10:41:47.688+03:00", "highlightTitle": ""}