{"organizations": [], "uuid": "de729b3c532c0559b0d46645fa183c12940b5c51", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mercurynews.com", "main_image": "http://extras.mnginteractive.com/live/media/site568/2015/1019/20151019__1020reses~2.JPG", "site_section": "http://feeds.mercurynews.com/mngi/rss/CustomRssServlet/568/200770.xml", "section_title": "Technology", "url": "http://www.mercurynews.com/business/ci_28992309/yahoo-executive-jacqueline-reses-among-string-high-level?source=rss", "country": "IL", "title": "Yahoo executive Jacqueline Reses among a string of high-level departures", "performance_score": 0, "site": "mercurynews.com", "participants_count": 1, "title_full": "Yahoo executive Jacqueline Reses among a string of high-level departures", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T03:37:00.000+03:00", "replies_count": 0, "uuid": "de729b3c532c0559b0d46645fa183c12940b5c51"}, "author": "Queenie Wong\n\nqwong@mercurynews.com", "url": "http://www.mercurynews.com/business/ci_28992309/yahoo-executive-jacqueline-reses-among-string-high-level?source=rss", "ord_in_thread": 0, "title": "Yahoo executive Jacqueline Reses among a string of high-level departures", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Company profile: Yahoo A growing number of Yahoo's high-ranking executives are heading straight for the exit door, a challenge analysts say could throw a wrench into CEO Marissa Mayer's plans to turn around the struggling search engine giant. \nThe latest departure came Monday when mobile payment company Square, which filed plans last week for its public debut, said it hired Yahoo Chief Development Officer Jacqueline Reses to lead the startup's business financing arm. In September, Yahoo's media and marketing chief, Kathy Savitt, left the Internet company for a job as president of digital operations at film and television studio STX Entertainment. \nWhile there are many reasons employees leave their jobs, including personal relationships, professional goals, pay and more, Yahoo's turnaround efforts still clearly need work, said Brian Wieser, a senior analyst at Pivotal Research Group. \n\"The fact that (Yahoo) hasn't figured out the right approach to turn the business around or produce a satisfactory strategy, frankly, would cause some people to look for greener pastures,\" Wieser said. \"I think there were a lot of people who were attracted to the company by Marissa Mayer's presence, but it's safe to say that very little has gone right for the company.\" \nYahoo did not immediately respond to a request for comment. Advertisement \nIn July, Yahoo beat Wall Street's low expectations for sales but missed earnings projections after spending more than $200 million on partnerships to drive more users to click on its websites in the second quarter. \nServing as Yahoo CEO since 2012, Mayer has faced criticism during her tenure, including from Jeff Smith, who heads the activist hedge fund Starboard Value. Smith has been pushing for a \"major overhaul\" at Yahoo, an effort that he said in a letter to Mayer in March should include cutting costs, deliver a tax-free spinoff of Yahoo Japan and other changes. \nBob Peck, an analyst with SunTrust Robinson Humphrey said in a note Monday that a total of 12 \"key\" employees have left Yahoo this year, up from the four people the firm counted in 2014. \n\"As a stand-alone company, the company needs to begin showing traction in the turnaround or we'd expect leadership changes as well,\" Peck wrote. \nSome of Yahoo's high-ranking employees have been snatched up by tech firms that compete with the Sunnyvale Internet company for online ad dollars including social media giant Facebook. That includes its former security chief Alex Stamos and VP of engineering James Everingham, who left for similar jobs at Facebook and Instagram, respectively. In March, research firm eMarketer also forecast that Twitter will surpass Yahoo in total U.S. digital display ad revenue for the first time in 2015. \nYahoo's loss Monday, though, was Square's gain. \n\"Jackie's understanding of the financial services industry and her background in tech and investing make her the perfect fit to lead Square Capital, and I'm thrilled she is joining our leadership team,\" Square CEO Jack Dorsey, who is also chief executive of Twitter, said in a statement. \nReses first joined Yahoo in 2012 and helped oversee efforts at the company to spin off its multibillion-dollar stake in Chinese e-commerce giant Alibaba. She also worked in mergers and acquisitions, human resources and other roles within the company. Before Yahoo, she headed the U.S. media group at global private equity firm Apax Partners, served as CEO of software services company iBuilding and spent seven years at Goldman Sachs. \nOn Monday, Yahoo's stock closed up 0.39 percent at $33.50 a share. The company is scheduled to report its third-quarter earnings Tuesday. Contact Queenie Wong at 408-920-2706. Follow her at Twitter.com/QwongSJ .", "external_links": [], "published": "2015-10-20T03:37:00.000+03:00", "crawled": "2015-10-20T04:02:59.489+03:00", "highlightTitle": ""}