{"organizations": [], "uuid": "92ca8ccc8344fc45dcd802e573f4d4217e6fef08", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theaustralian.com.au", "main_image": "http://resources.news.com.au/cs/theaustralian/images/placeholders/story-thumb-large.jpg", "site_section": "http://www.theaustralian.com.au/business/technology", "section_title": "TECHNOLOGY | Australian IT News &amp; Technology | The Australian | The Australian", "url": "http://www.theaustralian.com.au/business/financial-services/why-a-robot-could-become-your-new-best-friend/story-fn91wd6x-1227567293919", "country": "US", "title": "Why a robot could become your new best friend", "performance_score": 0, "site": "theaustralian.com.au", "participants_count": 1, "title_full": "Why a robot could become your new best friend | The Australian", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T08:00:00.000+03:00", "replies_count": 0, "uuid": "92ca8ccc8344fc45dcd802e573f4d4217e6fef08"}, "author": "The Australian", "url": "http://www.theaustralian.com.au/business/financial-services/why-a-robot-could-become-your-new-best-friend/story-fn91wd6x-1227567293919", "ord_in_thread": 0, "title": "Why a robot could become your new best friend", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Every business needs a helping hand with menial, rote tasks. REUTERS/Fabian Bimmer Source: Reuters\nWhile some feel this will put people out of work -- the Committee for Economic Development of Australia has forecast that almost 40 per cent of Australian jobs could be replaced by technology by 2025 -- the reality is it’s about finding areas of the business that can be done more efficiently and will free people up to make money. It’s not so much about automating people out of a job as it is about automating them into a better and more responsible position.\nKwanghui Lim, an associate professor at Melbourne Business School, says it’s a case of identifying how machines can complement the work of humans.\n“The question for a manager is how to make the human capital valuable in a way that a machine cannot,” he says.\nRobot farming technology like Ladybird can deliver 0.01% of the herbicides to used to kill weeds than blanket spraying. Picture: The Australian Centre for Field Robotics, The University of Sydney Source: Supplied\nThere are some great examples of how it can be done. Australian farmers, burdened with paying a minimum wage of $15.96 per hour and a limited workforce, have taken to drones and technology in a big way, using robots to harvest fruit and drones to survey property and track livestock.\nAnother example is Woodside using the cognitive computing of IBM’s Watson to go through decades of data to pick out patterns and better forecast future trends.\nFor small and medium-sized businesses, it’s about identifying repetitive processes like sending out invoices and running follow-ups.\nThe key here is to pick rote tasks where humans cannot add value. Indeed, what automation does here is eliminate the possibility of human error which will save a lot of time and expense. Start small and think of repetitive functions.\nCloud accounting through outfits like Xero, MYOB and Quickbooks is a perfect way to deal with the most repetitive tasks that businesses face managing their books. These include mind-numbing functions like invoice creation, expense classification and bank reconciliation.\nOf course, this won’t replace accountants any more than massive open online courses (MOOCs) have replaced universities or software as a service (SAAS) has replaced IT departments.\nFor small businesses, it reduces the amount of grunt work that costs a good part of the budget, particularly for start-ups. The accountants will still have a role conducting audits, sorting through regulatory issues and providing financial advice -- at a premium, of course.\nInvoice2go founder Chris Strode. Invoice2Go will launch its Apple Watch app which enables users to start timing a job from the moment you walk through the door. Source: Supplied\nEmail marketing can be done through handy and simple to use free tools like MailChimp, which creates a chain of emails you have crafted (no, there are some things you can’t automate) that you can send customers on a regular basis, say once a week or once a month. All you need are the customers’ email addresses.\nRostering, which can be complicated for companies with dispersed staff, can be automated easily with tools like Microkeeper, ZenShift and Findmyshift. These tools handle everything from automatic payroll and employee leave, overtime, breaks, multiple roster templates for different locations and departments, GPS on smartphones and fingerprint scanning, SMS notifications and email alerts.\nThe best way to start is to focus on what’s small. Along the way, companies can look at what the big outfits do well and learn from them. Automation will allow them to focus on what’s important.\nThis content was produced in association with the Commonwealth Bank of Australia. Read our policy on commercial content here.", "external_links": ["http://resources3.news.com.au/images/2015/10/13/1227567/293151-a61ce4f0-7137-11e5-ae14-397f78372f89.jpg", "http://resources3.news.com.au/images/2015/10/13/1227567/293095-4d201368-7137-11e5-ae14-397f78372f89.jpg", "http://resources2.news.com.au/images/2015/10/13/1227567/293178-2cf5190c-7138-11e5-ae14-397f78372f89.jpg"], "published": "2015-10-13T08:00:00.000+03:00", "crawled": "2015-10-14T00:48:11.407+03:00", "highlightTitle": ""}