{"organizations": ["Google"], "uuid": "8e35349a35fcc91bca0189e1bd9a15d357280c98", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news8000.com", "main_image": "http://www.news8000.com/image/view/-/31593000/highRes/2/-/maxh/640/maxw/640/-/bp987mz/-/Google-headquarters-sign.jpg", "site_section": "http://www.news8000.com/80198?format=rss_2.0&view=feed", "section_title": "Feed:Technology News", "url": "http://www.news8000.com/money/google-will-become-alphabet-today/35619434", "country": "US", "title": "Google will become Alphabet today", "performance_score": 0, "site": "news8000.com", "participants_count": 0, "title_full": "Google will become Alphabet today", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T00:32:00.000+03:00", "replies_count": 0, "uuid": "8e35349a35fcc91bca0189e1bd9a15d357280c98"}, "author": "", "url": "http://www.news8000.com/money/google-will-become-alphabet-today/35619434", "ord_in_thread": 0, "title": "Google will become Alphabet today", "locations": ["NEW YORK"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["David Goldman Justin"], "text": "Google will become Alphabet today Complicated restructuring happening end of Friday Author: By David Goldman Justin Sullivan/Getty Images NEW YORK (CNNMoney) - \nGoogle said that its long-awaited -- and complicated -- restructuring will happen at the end of the day on Friday. Related Content \nFor the uninitiated, Google will become Alphabet, which will own Google. \nHuh? \nGive us two minutes, and we'll explain. \n1) Google announced in August that it will restructure its business. At the end of the day on Friday, it will spin out its exotic projects like driverless cars and anti-aging research into separate companies. Alphabet will become the parent company of all of those smaller companies, one of which is Google. \n2) Don't worry, you won't notice any changes -- at least for now. At its most basic level, Google is just renaming itself \"Alphabet\" and creating a subsidiary business called \"Google.\" The new Google will continue as the consumer-facing brand and will run all the products you've heard of, including search, Android, YouTube, Maps and Google Apps. \n3) Don't expect to hear much from Alphabet itself. It will be a holding company, with no consumer products of its own. Alphabet doesn't own the rights to Alphabet.com. Its website is abc.xyz, and it's as bare-bones as they come. \n4) Alphabet will be organized like Warren Buffett's Berkshire Hathaway. Each business, including Google, will have its own CEO. They will all report to Alphabet CEO (former Google chief) Larry Page, who has been a longtime admirer of Buffett's managing style. \n5) Page and fellow Google co-founder Sergey Brin are giving up their reins at Google to take over Alphabet. Page will be CEO and Brin will be president of Alphabet. \n6) The new CEO of Google is Sundar Pichai. He's a well-liked executive who's had a meteoric rise since he joined Google in 2004. He led the Google Toolbar team, then Chrome. He was then given control of Android and eventually every Google product not named YouTube. As CEO, he'll oversee YouTube too, although Susan Wojcicki will remain YouTube's chief executive. \n7) Alphabet's structure is designed to give each separate business more independence and freedom to grow. In a memo to investors, Page said he wants to make the company \"cleaner and more accountable.\" Since smart home company Nest, the experimental Google X, and age-fighting Calico don't really have much to do with Google's core search business, spinning them off makes a good deal of sense. \n8) Google hired a big-time chief financial officer from Wall Street a few months ago. Ruth Porat, now the CFO of Alphabet, had said that she wanted to add more transparency to Google's business. Alphabet's new structure will give investors a better understanding of how well each of Google's former \"side projects\" (now Alphabet subsidiaries) are performing, as well as more clarity about Google's core business. \n9) The Alphabet move was done in part to appease investors. Shareholders had been growing increasingly anxious about Google's funding of \"moonshot\" investments that may never pay off. Since 90% of Google's sales came from advertising, Page was criticized for not devoting more of his time to search. Now, Google will be a separately run company without its CEO worrying about those \"side projects.\" \n10) Shares of Google will begin trading as Alphabet under the same \"GOOGL\" ticker beginning on Monday, October 5. \nCopyright 2015 by CNN NewSource . All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-10-03T00:32:00.000+03:00", "crawled": "2015-10-03T08:43:04.304+03:00", "highlightTitle": ""}