{"organizations": ["VW"], "uuid": "0ced4f1d3ea90eb956536cf7aa45d9ae5d0a1533", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.therepublic.com", "main_image": "http://d1bdhkmqqz901h.cloudfront.net/1200x630/smart/s3.amazonaws.com/hne-smedia/2/c/2c3a7bfcb87e47b09eddd60359dab09b/web_full_963883250424.jpg", "site_section": "http://www.therepublic.com/feed/subject/455ef2b87df7100483d8df092526b43e", "section_title": "Technology News from TheRepublic.com", "url": "http://www.therepublic.com/view/story/2c3a7bfcb87e47b09eddd60359dab09b/AS--China-Volkswagen", "country": "US", "title": "VW recalls diesel vehicles in China to correct emissions", "performance_score": 0, "site": "therepublic.com", "participants_count": 0, "title_full": "VW recalls diesel vehicles in China to correct emissions", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T08:21:00.000+03:00", "replies_count": 0, "uuid": "0ced4f1d3ea90eb956536cf7aa45d9ae5d0a1533"}, "author": "", "url": "http://www.therepublic.com/view/story/2c3a7bfcb87e47b09eddd60359dab09b/AS--China-Volkswagen", "ord_in_thread": 0, "title": "VW recalls diesel vehicles in China to correct emissions", "locations": ["China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "VW recalls diesel vehicles in China to correct engine software that cheats on emissions tests \nBy JOE McDONALD - AP Business Writer Published: 10/12/15 1:21 am EDT - Updated: 10/12/15 1:21 am EDT \nBEIJING — Volkswagen is recalling 1,950 diesel vehicles in China to correct engine software that the automaker has admitted cheats on emissions tests. \nThe recall applies to 1,946 Tiguan sport utility vehicles and four Passat B6 sedans, all of them imported, the company said Monday. It said technical solutions are being developed and have yet to be submitted to Chinese authorities for approval. \nVolkswagen's business in China, the largest auto market by number of vehicles sold, has suffered little impact from the global emissions scandal due to the lack of popularity of diesel cars among Chinese drivers. But foreign companies are closely watched by Chinese authorities, and state media publicize suggestions of misconduct. \nEurope's biggest automaker has acknowledged it installed software dubbed \"defeat devices\" on diesel vehicles. They switch on pollution controls when cars undergo emissions tests, but switch off during driving to improve performance. \n\"Volkswagen would like to sincerely apologize for any inconvenience caused to our customers,\" the company said in a statement. \"We would like to assure that we will do everything humanly possible to win back trust and take care of any concerns.\" \nDiesel is widely used in trucks in the world's second-largest economy, but powered just 0.3 percent of autos sold last year in China, or a few thousand units. \nVolkswagen is, along with General Motors Co., one of the most popular vehicle brands in China, but is struggling with an unexpectedly sharp downturn in the market and fast-changing consumer tastes. \nAuto sales in China declined in August for a third straight month, contracting by 3.4 percent from a year earlier. \nVW blamed weakness in China for a 16 percent decline in its second-quarter global profit. First-half sales in China were off 0.5 percent. \nThe president of VW China, Jochem Heizmann, told reporters in April that the company lagged overall market growth because it lacked products in the budget SUV segment, where sales are surging. \nIn 2013, Volkswagen recalled 384,000 vehicles in China to fix gearboxes after state television publicized complaints about them. \nVolkswagen China: http://www.vw.com.cn/en.html FILE - In this Sept. 22, 2015, file photo, the logo of Volkswagen at a car is photographed during the Car Show in Frankfurt, Germany. Volkswagen is recalling 1,950 diesel vehicles in China to correct engine software that the automaker has admitted cheats on emissions tests. The recall applies to 1,946 Tiguan sport utility vehicles and four Passat B6 sedans, all of them imported, the company said Monday, Oct. 12, 2015. It said technical solutions are being developed and have yet to be submitted to Chinese authorities for approval. (AP Photo/Michael Probst, File) \n   ", "external_links": [], "published": "2015-10-12T08:21:00.000+03:00", "crawled": "2015-10-12T09:29:48.429+03:00", "highlightTitle": ""}