{"organizations": [], "uuid": "3d8ba7b04efe205b918f48f79f0d3d92b567d8dd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266385/technology-general", "section_title": "Technology Press Releases from PRWeb - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30267513/andiamo-iq-smart-luggage-comes-equipped-with-wi-fi-mobile-charger-and-built-in-scale-to-make-traveling-more-convenient", "country": "US", "title": "Andiamo iQ Smart Luggage Comes Equipped with Wi-Fi, Mobile Charger and Built-In Scale to Make Traveling More Convenient", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Andiamo iQ Smart Luggage Comes Equipped with Wi-Fi, Mobile Charger and Built-In Scale to Make Traveling More Convenient - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T17:02:00.000+03:00", "replies_count": 0, "uuid": "3d8ba7b04efe205b918f48f79f0d3d92b567d8dd"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30267513/andiamo-iq-smart-luggage-comes-equipped-with-wi-fi-mobile-charger-and-built-in-scale-to-make-traveling-more-convenient", "ord_in_thread": 0, "title": "Andiamo iQ Smart Luggage Comes Equipped with Wi-Fi, Mobile Charger and Built-In Scale to Make Traveling More Convenient", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "iQ’s anti-theft alerts, travel info and USB port make traveling more convenient and help eliminate excess baggage fees and other traveling hassles\nPine Brook, NJ (PRWEB) October 15, 2015\nAndiamo Luggage , the company that seeks to make traveling more convenient, will be launching an Indiegogo campaign this October to raise a minimum of $50K that will go towards furthering technology development for future collection additions and advancements, as well as 2016 iQ products. This smart luggage connects with travelers via smartphones, sends alerts about luggage and travel plans and also serves as a Wi-Fi hotspot.\nThose who travel often know the struggles that come with waiting at the airport or traveling in remote areas. Finding an available plug is always a hassle and Wi-Fi can often be spotty at times. Andiamo’s iQ Smart Luggage offers travelers a chic, stylish and smart suitcase that helps solve these common problems. This high-tech suitcase provides global Wi-Fi access so users don’t have to stop working or waste time seeking out the nearest coffee shop. It also comes equipped with a mobile power pack, so travelers can stay charged and connected anywhere.\n“Luxury luggage is something that we’ve spent years perfecting, and now we’re ready to take traveling to an entirely different level,” said spokesperson Marcy Schackne. “We’re taking our knowledge of quality luggage manufacturing and combining it with current technology, to make a line of smart luggage that will make people wonder how they ever traveled without it.”\niQ can connect with both iOS and Android smart devices. The Andiamo iQ app allows travelers to get anti-theft notifications, view how much their luggage weighs and know how to pack smart for their next destination. These features help users avoid any extra overweight charges at the airport and pack accordingly for each new destination. Andiamo’s iQ contains a multitude of high-tech features including:\nGlobal Wi-Fi Access Mobile Power Pack Built-In Scale Anti-Theft Distance Alerts Multi-Functional App Lightweight Aluminum Frame\nAndiamo Luggage not only provides users with a suitcase that surpasses the technology of an average carry on, but is also sleek, stylish and lightweight. The aluminum frame with 360-degree wheel turning functionality makes moving through the airport and security easier than ever before. Andiamo iQ also includes built-in TSA-approved locks.\nThe earliest backers will soon be able to purchase Andiamo’s iQ on Indiegogo for $199, which is almost 70% off of the market retail value. For more information about iQ, visit http://bit.ly/WinAndiamoLuggage or email stephanie@andiamoluggage.com.\nABOUT ANDIAMO LUGGAGE, LLC\nTravel has changed so much in the last few years and Andiamo Luggage, LLC keeps pace with those changes to maintain its long-standing reputation as “luggage that is engineered to take on the world.” It is Andiamo’s goal to maintain the integrity and consistency of Andiamo Luggage in order preserve the foundation upon which this brand was built. The iQ has been designed and manufactured to exceed the expectations of most travelers and consumers. Andiamo Luggage consistently seeks the latest in travel innovation and works with the top material and component suppliers in order to provide a product that customers will not only be proud of, but insist on using. For more information, visit http://www.andiamoluggage.com .\n //www.prweb.com/releases/AndiamoiQ/PLRelease/prweb13016661.htm\n ", "external_links": ["http://www.prweb.com/releases/AndiamoiQ/PLRelease/prweb13016661.htm", "http://bit.ly/WinAndiamoLuggage"], "published": "2015-10-15T17:02:00.000+03:00", "crawled": "2015-10-15T18:23:52.822+03:00", "highlightTitle": ""}