{"organizations": [], "uuid": "82fcb02ec94d7c86dc1c2fa8c8de6eb22228cf47", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1139222/telemundo-s-luis-silberwasser-interviewed-maria-celeste-arraras-during-special-present", "country": "US", "title": "Telemundo's Luis Silberwasser Interviewed by Maria Celeste Arraras During Special Presentation at 13th Annual Hispanic Television Summit", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "Telemundo's Luis Silberwasser Interviewed by Maria Celeste Arraras During Special Presentation at 13th Annual Hispanic Television Summit", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T21:48:00.000+03:00", "replies_count": 0, "uuid": "82fcb02ec94d7c86dc1c2fa8c8de6eb22228cf47"}, "author": "admin", "url": "http://www.freshnews.com/news/1139222/telemundo-s-luis-silberwasser-interviewed-maria-celeste-arraras-during-special-present", "ord_in_thread": 0, "title": "Telemundo's Luis Silberwasser Interviewed by Maria Celeste Arraras During Special Presentation at 13th Annual Hispanic Television Summit", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Companies mentioned in this article: Broadcasting & Cable and Multichannel News \nNEW YORK, Oct. 12, 2015 /PRNewswire/ -- Broadcasting & Cable and Multichannel News today announced that Luis Silberwasser, President, Telemundo Network will be interviewed by María Celeste Arrarás, Co-anchor, \"Noticiero Telemundo\" and Host, \"Al Rojo Vivo con María Celeste,\" in a special presentation session that was recently added to the agenda for the 13(th) Annual Hispanic Television Summit. The one-day conference covering the business of Hispanic television in the United States, Latin America and around the world is set for Thursday, October 22 at the Park Central Hotel New York. \nPhoto - http://photos.prnewswire.com/prnh/20151012/276096 \nThis year, for the first time, the Hispanic Television Summit will be one of the signature events that make up New York City Television Week, which also includes The Next TV Summit & Expo, The Content Show, Advanced Advertising and the Broadcasting & Cable Hall of Fame. \n\"Telemundo's continued participation in the Hispanic Television Summit is extremely gratifying,\" said Louis Hillelson, VP/Group Publisher, Broadcasting & Cable / Multichannel News . \"The high profile participation of both Luis and Maria Celeste - two of the most noteworthy and influential figures in all of Hispanic television - underscores the Summit's position as the premiere industry conference of its kind.\" \nEntitled The Importance of Creating Original Content for Today's Hispanic Audiences , the session will look at why original content is critical for the Hispanic media market as audience tastes change in today's cross-cultural environment from traditional telenovela formats to faster paced super series, the evolution of live music and sports events, as well as the trans-adaptation of popular general market reality series for Spanish speaking audiences. \nLuis Silberwasser was named President of Telemundo in August 2014. He has overall responsibility for the Telemundo broadcast network, including Telemundo Studios, the leading producer of original Spanish-language primetime content for U.S. Hispanics. Working closely with NBCUniversal's Hispanic Group senior team and Telemundo's leadership, Silberwasser is responsible for developing and executing the Spanish-language network's entertainment, sports and news growth strategy. Prior to joining Telemundo, he was Executive Vice President and Chief Content Officer for Discovery Networks International. \nMaría Celeste Arrarás, an Emmy® award-winning journalist and investigative reporter, is one of the most popular Spanish-language television news personalities. She has been a guest host for NBC's \"Today\" show and has collaborated with \"Dateline\" and \"NBC Nightly News with Brian Williams.\" She is a past recipient of the Award for Outstanding Achievement in Hispanic Television presented to her at the third annual Hispanic Television Summit. \nThe Hispanic Television Summit is the premier event for those in the business of television for Hispanic audiences and covers programming, advertising, online distribution technology and this year will especially feature the genre of telenovelas. Over 500 executives attend from the U.S., Latin America, Europe and other territories, representing broadcasters, pay TV providers, over-the-top digital providers, programming networks, production companies, advertisers, ad agencies, technology suppliers, research firms, investors and more. \nThe Summit includes the presentation of the Leadership in Hispanic Television Award as well as the Award for Achievement in Hispanic Television. This year's award goes to Verizon. Previous recipients of the Leadership Award include Comcast, Time Warner Cable, Dish Latino and Major League Soccer, and the Achievement Award will go to Lucero, the popular actress, TV host and singer. Past recipients of the Achievement Award include on-air personalities Don Francisco, Andrés Cantor, and Cristina Saralegui; network news anchors Jorge Ramos, Maria Celeste Arrarás, María Elena Salinas and José Díaz-Balart; sports celebrity Oscar De La Hoya and advertising executives Monica Gadsby of SMG and Edgar Sandoval of P&G. \nThe Summit is produced by The Schramm Marketing Group, based in New York City. \nTo inquire about speaking opportunities, contact Joseph Schramm at 212-983-0219 or jschramm@schrammnyc.com . \nFor registration, please contact Rebecca Shottland at rshottland@nbmedia.com or 917-281-4782 or visit http://hispanictvsummit.com/# . \nFor sponsorship opportunities, please contact Charlie Weiss at cweiss@nbmedia.com or 212-378-0478. \nAbout Broadcasting & Cable and Multichannel News \nBroadcasting & Cable and Multichannel News serve the television industry with respected, industry-leading websites, weekly print publications, daily e-newsletters and events. Broadcasting & Cable covers the broadcast, cable and syndication markets, while Multichannel News focuses on programming, marketing, finance and more for the cable and telecommunications industries. \nPress Contacts:", "external_links": [], "published": "2015-10-12T21:48:00.000+03:00", "crawled": "2015-10-12T23:11:44.263+03:00", "highlightTitle": ""}