{"organizations": [], "uuid": "d2960db58100021e404b664a098810950b023736", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bio-medicine.org", "main_image": "", "site_section": "http://www.bio-medicine.org/inc/biomed/medicine-technology.asp", "section_title": "Latest Medical Technology from Bio-Medicine.Org", "url": "http://www.bio-medicine.org/medicine-technology-1/Gene-Therapy-Market--2015---2025-49244-1/", "country": "US", "title": "Gene Therapy Market, 2015 - 2025", "performance_score": 0, "site": "bio-medicine.org", "participants_count": 0, "title_full": "Gene Therapy Market, 2015 - 2025", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T14:17:00.000+03:00", "replies_count": 0, "uuid": "d2960db58100021e404b664a098810950b023736"}, "author": "", "url": "http://www.bio-medicine.org/medicine-technology-1/Gene-Therapy-Market--2015---2025-49244-1/", "ord_in_thread": 0, "title": "Gene Therapy Market, 2015 - 2025", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Date:10/22/2015 \nLONDON ,   -- INTRODUCTION \nSeveral disorders that arise inside the body are a result of either a direct genetic aberration or a dysfunctional/non-functional protein. The attempt to use nucleic acids to correct or delete the genes causing a particular disease is known as gene therapy. Although gene therapy has not contributed significantly to the global pharmaceutical market yet, it is anticipated to grow at a fast pace over the next decade. \nGendicine, developed by SiBionoGeneTech, was the foremost gene therapy that entered market in 2004 in China . Since then four more therapies have received approval in China , Philippines , Russia and the EU. This number for approved / marketed therapies seems weak at present; however, the strong and highly populated pipeline holds tremendous potential. There are 12 gene therapies in late stage of clinical development for the treatment of cancer, ocular and cardiovascular disorders. There are several concerns that remain to be answered; examples include insertional mutagenesis, treatment of multigene disorders, curbing the risk of immune reactions, eugenics, high cost of therapy and ethical concerns related to making alterations at the genetic level. Despite this, gene therapy does offer a ray of hope for patients who either have no treatment options or show no benefits with drugs that are currently available. Such a benefit far outweighs any disadvantages that may be associated with this upcoming therapeutic field.There is a lot research underway for the first generation of controlled gene therapy, gene expression cassettes which deliver optimised gene expression and vectors which minimise the risk of immunogenicity. These research efforts have received strong support from various venture capital firms and institutional investors. With the expected launch of several new gene therapies in the US and EU, we expect the market to witness significant growth in the coming decade.SCOPE OF THE REPORTThe 'Gene Therapy Market, 2015-2025' report provides an extensive study on the marketed and pipeline gene therapies. A lot of research has been carried out in this field for over a decade but there are only five approved therapies (four available in Asian markets; one approved in the EU). There are many promising therapies which are currently being developed worldwide; the approach is likely to result in several commercial success stories in the foreseen future. The report covers various aspects, such as key players, marketed gene therapy products, products in clinical / pre-clinical research, associated ethical issues, likely future developments and upcoming opportunities for a variety of stakeholders. As pharma companies continue to expand their research programs in this area, one of the key objectives outlined for this report is to understand the future potential of the market. This is done by analysing:- The gene therapy pipeline in terms of phase of development, therapeutic area, target indications, types of vectors, gene types, etc.- Interest of venture capital firms and recent funding rounds that have taken place in the gene therapy space.- Development and sales potential based on target consumer segments, likely adoption rate and expected pricing.- The constraints of gene therapy and future developments planned to overcome these.The study provides an estimate of the short-midterm and long term market forecast for the period 2015 - 2025. The research, analysis and insights presented in this report include potential sales of the five approved gene therapies and 12gene therapy products in late phases of development.Owing to niche nature of the market, with most products in the pipeline, we have provided three market forecast scenarios to add robustness to our model. The conservative, base and optimistic scenarios represent three different tracks of industry evolution. All actual figures have been sourced and analysed from publicly available information and discussions with industry experts. The figures mentioned in this report are in USD, unless otherwise specified.EXAMPLE HIGHLIGHTS1. Gendicinebecame the first approved gene therapy in China in 2004. So far, there have been three more marketed gene therapies:Rexin-G, Oncorine and Neovasculgen. All of these have been made commercially available in Asian countries. Glybera was the first gene therapy to be approved in the EU in 2012. 2. We have identified a total of 483 gene therapy molecules in the marketed and the clinical pipeline which are designed for different therapeutic areas. Except a few which are in advanced stages of development, majority of the gene therapies are in early development stages.3. There are several challenges and ethical issues associated with this field; germline gene therapy is one of the important issues. The existing gene therapies use somatic cells. However, research is in progress to introduce germline gene therapy in the market since some of the serious inherited genetic diseases, such as Lecsh-Nyhan Syndrome, can only be treated by germline gene therapy.4. There has been a growing interest from Venture Capital firms in the gene therapy space. In fact, in 2013 / 2014, several companies were involved in investment in gene therapies; during January 2013 to April 2014, a total USD 600 million was raised by the US companies alone. This activity is likely to increase further and will help companies, especially start-ups, drive their respective products to commercialisation.5. We expect the genetherapymarket to be worth USD 11 billion by 2025, representing a healthy annual growth rate of 48.9%; specific therapies such as Prostavac, ProstAtak and TroVax are likely to achieve blockbuster status.RESEARCH METHODOLOGYMost of the data presented in this report has been gathered via secondary and primary research. For all our projects, we conduct interviews with experts in the area (academia, industry, medical practice and other associations) to solicit their opinions on emerging trends in the market. This is primarily useful for us to draw out our own opinion on how the market will evolve across different regions and technology segments. Where possible, the available data has been checked for accuracy from multiple sources of information.The secondary sources of information include - Annual reports", "external_links": [], "published": "2015-10-22T14:17:00.000+03:00", "crawled": "2015-10-23T05:40:57.067+03:00", "highlightTitle": ""}