{"organizations": [], "uuid": "98e59ddab8f8ed19a77d7b89e5ee26ad55b61625", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266385/technology-general", "section_title": "Technology Press Releases from PRWeb - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30255879/biznet-software-joins-blackbaud-partner-network-as-a-blackbaud-technology-partner", "country": "US", "title": "BizNet Software Joins Blackbaud Partner Network as a Blackbaud Technology Partner", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "BizNet Software Joins Blackbaud Partner Network as a Blackbaud Technology Partner - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T12:03:00.000+03:00", "replies_count": 0, "uuid": "98e59ddab8f8ed19a77d7b89e5ee26ad55b61625"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30255879/biznet-software-joins-blackbaud-partner-network-as-a-blackbaud-technology-partner", "ord_in_thread": 0, "title": "BizNet Software Joins Blackbaud Partner Network as a Blackbaud Technology Partner", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Firm Joins Network of Companies Providing Applications and Solutions that Complement Blackbaud Products\nDALLAS, TX\nBizNet Software, the market leader for Microsoft Excel® in memory business reporting and analytics, today announced that the company has joined the Blackbaud Partner Network as a Blackbaud Technology Partner. With this partnership, BizNet Software joins a network of companies that provide applications and solutions that extend Blackbaud (NASDAQ: BLKB) product functionality in new ways.\n“The BizNet solution enables customers to create complete reports faster and more accurately in Excel,” said Chris Clinton, vice president, Global Channels and Partner Ecosystem. For Blackbaud customers, this makes gathering and arranging nonprofit information in Excel simple and fast and ideal for day-in/day-out usability by accounting staff, line-level managers, and executives through Excel.\nThe partnership allows BizNet Software’s BizInsight to leverage Blackbaud’s Raiser’s Edge and Financial Edge to enable more nonprofits to generate live reports within Excel. BizInsight leverages the power of Excel to aggregate data in real time, design and create up to the minute reports, and send them in a multitude of formats.\n“Our industry standards for reporting solutions help enable nonprofits’ business processes to work at peak efficiency and be aligned with their strategic goals,” said George McMann, founder & CEO of BizNet Software. “Blackbaud customers will benefit from accessing a reporting solution that is both highly intuitive and powerful and developed specifically for distributing and transferring data in the most widely used reporting solution – Microsoft Excel.”\nTo learn more about BizNet Software’s BizInsight, visit: http://www.biznetsoftware.com\nThe Blackbaud Partner Network is a group of leading technology and services firms providing nonprofits with the solutions, applications and strategies they need to make a difference in their local communities and worldwide.\nTo learn more about Blackbaud’s Technology Partner program, visit: http://www.blackbaud.com/partners .\nThe Blackbaud Partner Marketplace is the world’s first marketplace dedicated to the nonprofit community with products that extend and enhance Blackbaud solutions. To learn more about the Blackbaud Partner Marketplace http://www.blackbaud.com/marketplace\nAbout BizNet Software\nBizNet Software, Inc. is a market leader for Microsoft Excel in-memory, cloud-enabled reporting and business intelligence. Founded in 1996 to take the mystery out of databases, BizNet focuses on Microsoft Excel reporting solutions guided by financial and business professionals with a real-world understanding of corporate financial, operational and technical requirements. The BizNet Excel Suite is the most innovative and intuitive reporting solution on the market. It creates a user-friendly, drag and drop environment with real time access to the most accurate and current data. Built upon fundamental business disciplines and controls, BizNet solutions make it easy for Microsoft Excel users to connect, analyze, and share real time information. BizNet Software is endorsed by more than 200 partners, 15 software publishers, and currently has 20,000+ users in more than 2,100 companies in 30 different countries.\nMicrosoft® and Excel® are either registered trademarks or trademarks of Microsoft Corporation in the United States and/or other countries. For more information, visit http://www.biznetsoftware.com or call 888-803-5227.\nAbout Blackbaud\nServing the worldwide philanthropic community for more than 30 years, Blackbaud (NASDAQ: BLKB) combines innovative software and services, and expertise to help organizations achieve their missions. Blackbaud works in over 60 countries to power the passions of more than 30,000 clients, including nonprofits, K-12 private and higher education institutions, healthcare organizations, foundations and other charitable giving entities, and corporations. The company offers a full spectrum of cloud and on-premise solutions, as well as a resource network that empowers and connects organizations of all sizes. Blackbaud's portfolio of software and services support nonprofit fundraising and relationship management, eMarketing, advocacy, accounting, payments and analytics, as well as grant management, corporate social responsibility, and education. Using Blackbaud technology, these organizations raise, invest, manage and award more than $100 billion each year. Recognized as a top company, Blackbaud is headquartered in Charleston, South Carolina and has operations in the United States, Australia, Canada, Ireland and the United Kingdom. For more information, visit http://www.blackbaud.com .\n //www.prweb.com/releases/2015/10/prweb12997848.htm\n ", "external_links": ["http://www.blackbaud.com/marketplace", "http://www.prweb.com/releases/2015/10/prweb12997848.htm", "http://www.blackbaud.com/partners"], "published": "2015-10-14T12:03:00.000+03:00", "crawled": "2015-10-16T08:30:30.204+03:00", "highlightTitle": ""}