{"organizations": [], "uuid": "62b04333a672241e3ebabb72f09b59f4c3bc3851", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.terradaily.com", "main_image": "http://www.spxdaily.com/images-bg/chesapeake-bay-surface-water-temp-map-bg.jpg", "site_section": "http://www.terradaily.com/terradaily.xml", "section_title": "Earth News, Earth Science, Energy Technology, Environment News", "url": "http://www.terradaily.com/reports/Chesapeake_Bay_surface_water_temperature_is_increasing_over_time_999.html", "country": "US", "title": "Chesapeake Bay surface water temperature is increasing over time", "performance_score": 0, "site": "terradaily.com", "participants_count": 0, "title_full": "Chesapeake Bay surface water temperature is increasing over time", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T07:39:00.000+03:00", "replies_count": 0, "uuid": "62b04333a672241e3ebabb72f09b59f4c3bc3851"}, "author": "", "url": "http://www.terradaily.com/reports/Chesapeake_Bay_surface_water_temperature_is_increasing_over_time_999.html", "ord_in_thread": 0, "title": "Chesapeake Bay surface water temperature is increasing over time", "locations": ["Chesapeake Bay", "Bay"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Chesapeake Bay surface water temperature is increasing over time by Staff Writers Frostsburg MD (SPX) Oct 15, 2015 Increasing water temperatures can be driven by climate change, coastal urbanization (since 1975, urban land cover has increased by more than 100% in portions of the coastal plain adjacent to the Bay), runoff from impervious surfaces (imagine the stormwater during a hot afternoon thunderstorm running into a stream at bath-water temperatures), and discharges from industrial processes, such as power plants that use water from the Bay and its tributaries for cooling. \nA new study shows that surface water temperature in the Chesapeake Bay is increasing more rapidly than air temperature, signaling a need to look at the impact of warming waters on one of the largest and most productive estuaries in the world. The study, completed by Haiyong Ding and Andrew Elmore of the University of Maryland Center for Environmental Science's Appalachian Laboratory, was published in the October issue of Remote Sensing of Environment. \n\"I was surprised that the pattern of increasing water temperature was so clear,\" said study co-author Andrew Elmore. \"If you take any group of five years, they are generally warmer than the previous five years. A consistent warming trend happening over a really large portion of the Bay.\" \nTrends of increasing water temperature were found for more than 92% of the Chesapeake Bay. Water temperature has been increasing more rapidly than air temperature in some areas, particularly in the main stem of the Bay and in the Potomac estuary. The Patapsco River in Baltimore showed the fastest warming of any area of the Bay, implicating urbanization of the watershed and use of the Bay's waters to cool power plants along its shore. \nWater temperature is one of the most important factors in understanding the functioning of an aquatic ecosystem. It signals spawning time for fish and warmer water holds less dissolved oxygen than colder water, thereby making estuarine ecosystems experiencing eutrophication or algal blooms more susceptible to dead zones. Many aspects of estuarine management and restoration are dependent on good temperature data. \nWhile warming water temperature in the Bay is not a novel finding, the study used satellite remote sensing data to map a 30-year average minimum and maximum temperatures across the Bay north of the Potomac River. For decades, measurements have been taken from piers, stationary buoys and mobile platforms, which is expensive and time consuming to deploy over large bodies of water. \nElmore and his research team used data from satellites that orbit the earth taking a picture of the Chesapeake Bay every 16 days. Because water emits electromagnetic radiation characteristic of its temperature, each satellite image can be converted to a map of water surface temperature. By analyzing images in consecutive 5-year groups, the researchers were able to separate seasonal variation from long-term trends. \nIncreasing water temperatures can be driven by climate change, coastal urbanization (since 1975, urban land cover has increased by more than 100% in portions of the coastal plain adjacent to the Bay), runoff from impervious surfaces (imagine the stormwater during a hot afternoon thunderstorm running into a stream at bath-water temperatures), and discharges from industrial processes, such as power plants that use water from the Bay and its tributaries for cooling. \nThe study compared annual average water surface temperatures for the past 30 years against air temperature records. Increasing trends in air and water temperature were found at all of the stations studied, with rates generally ranging between 0.5 and 1 degree C every ten years. \n\"Spatio-temporal patterns in water surface temperature from Landsat time series data in the Chesapeake Bay, U.S.A.,\" by Haiyong Ding of Nanjing University of Information Science and Technology and Andrew Elmore of the University of Maryland Center for Environmental Science was published in the October issues of Remote Sensing of Environment. .", "external_links": [], "published": "2015-10-15T07:39:00.000+03:00", "crawled": "2015-10-15T12:41:31.176+03:00", "highlightTitle": ""}