{"organizations": [], "uuid": "68fff7af55a34536f738767b71e4a0795fff0671", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.businesswire.com", "main_image": "", "site_section": "http://feed.businesswire.com/rss/home/?rss=G1QFDERJXkJeGVtQXg==", "section_title": "Business Wire Technology: Mobile/Wireless News", "url": "http://www.businesswire.com/news/home/20151013006766/en/Engrain-Launches-Interactive-Online-Marketing-Tool-SightMap%E2%84%A2", "country": "US", "title": "Engrain Launches Interactive Online Marketing Tool SightMap™", "performance_score": 0, "site": "businesswire.com", "participants_count": 0, "title_full": "Engrain Launches Interactive Online Marketing Tool SightMap™", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T22:35:00.000+03:00", "replies_count": 0, "uuid": "68fff7af55a34536f738767b71e4a0795fff0671"}, "author": "", "url": "http://www.businesswire.com/news/home/20151013006766/en/Engrain-Launches-Interactive-Online-Marketing-Tool-SightMap%E2%84%A2", "ord_in_thread": 0, "title": "Engrain Launches Interactive Online Marketing Tool SightMap™", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Engrain Launches Interactive Online Marketing Tool SightMap™ Innovative Product Introduces a New Level of Engagement for Leasing and Sales Websites October 13, 2015 03:35 PM Eastern Daylight Time \nDENVER--( BUSINESS WIRE )--Engrain ( www.engrain.com ) the leader in touch technology for the real estate industry, has launched an online product for homebuilders, master planned communities, condominium sales companies, student housing and multifamily communities. SightMap™ ( http://engrain.com/sightmap.php ) brings a powerful interactive component to websites by offering responsive community maps that clearly display unit specific information from any device. \nDeveloped by Engrain of Littleton, Colo., SightMap incorporates fully responsive interactive community maps into any website. The new online technology filters home and unit availability by client outlined search criteria and effectively showcases unit specific marketing content, including 2D and 3D floor plans, views, optional finishes and virtual tours. SightMap also provides vital outbound call to action options including integrated appointment scheduling, online applications and online chat. \n\"We’re excited to be able to offer this effective new option to our clients,” said Engrain President and CEO Brent Steiner. “Our clients have been asking for the ability to port interactive maps to their websites and we are now able to deliver. SightMap opens the door to outside partnerships which will allow us to extend map functionality on any device and for any business application.” \nLast month, Engrain was named one of America’s fastest-growing private companies by Inc. magazine. The firm ranked 1,423 on the magazine’s 34 th annual Inc. 5000, an exclusive ranking of the nation’s fastest-growing private companies. Engrain has had an exceptional yet strategic expansion of its employee base by doubling the size of its team during the last 18 months; an expansion that has been supported by a remarkable three-year sales growth of 292%. This year’s ranking was the firm’s first appearance on the annual listing. \nEngrain is at the forefront of emerging technology, developing software for both large-screen and portable touch technology. The firm works with real estate developers, property management companies and other organizations in the industry to craft systems that make information more visual, more meaningful and more accessible for their prospects, residents, visitors and staff. Its award-winning TouchTour® systems serve as the focal point of an \"information ecosystem\" that includes custom-branded websites, email- and SMS-based information sharing and integrations with property management, lead tracking and other software. \nAbout Engrain: \nEngrain is a leading provider of immersive touchscreen technology and award-winning digital branding and design services within the real estate market. Its TouchTour® system is used at some of the most respected properties in the country. Based in Denver, the company works with clients throughout the U.S. and Canada. For more information, visit www.engrain.com . Contacts", "external_links": [], "published": "2015-10-13T22:35:00.000+03:00", "crawled": "2015-10-13T22:43:29.035+03:00", "highlightTitle": ""}