{"organizations": [], "uuid": "c05422e0b1da9c5fdd64aa65421834d16deac1b4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com/news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1142973/zend-celebrates-php-renaissance-leads-way-php-7-release-zendcon-2015", "country": "US", "title": "Zend Celebrates PHP Renaissance, Leads the Way to PHP 7 Release at ZendCon 2015", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "Zend Celebrates PHP Renaissance, Leads the Way to PHP 7 Release at ZendCon 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T18:00:00.000+03:00", "replies_count": 0, "uuid": "c05422e0b1da9c5fdd64aa65421834d16deac1b4"}, "author": "admin", "url": "http://www.freshnews.com/news/1142973/zend-celebrates-php-renaissance-leads-way-php-7-release-zendcon-2015", "ord_in_thread": 0, "title": "Zend Celebrates PHP Renaissance, Leads the Way to PHP 7 Release at ZendCon 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Submitted by admin on 10/20/2015 @ 8:00 AM   Zend Technologies \nLOUISVILLE, CO--(Marketwired - October 20, 2015) - Zend Technologies , the PHP company, part of Rogue Wave Software , today announced a full suite of products and services to empower companies and developers to harness the power of the soon-to-be released PHP 7. The open source architects at Zend have taken a leading role in developing PHP 7, and developers are poised to reap the optimized performance and efficiency benefits. The announcement was made at ZendCon 2015 , the world's premier PHP conference, in Las Vegas. \n\"Our team has been working incredibly hard to make PHP 7 satisfy industry expectations of performance and functionality,\" said Andi Gutmans, Rogue Wave executive VP, strategic partnerships and Zend co-founder. \"This is the 'year of PHP' and we are enjoying a PHP renaissance. The entire PHP ecosystem is evolving so quickly, and the differences between PHP 5.6 and 7.0 are simply staggering. Zend engineers have achieved performance gains ranging from 25 percent to 70 percent on real-world apps -- and all from simply upgrading PHP, without having to change a single line of code.\" \nZend is launching a suite of products that are crafted specifically to leverage the benefits of PHP 7. Zend Server , Zend Studio , and the Zend Professional Services offerings are available for companies that are migrating from PHP 5.4 and earlier, or that are building new applications to capture the power of PHP 7. \nZend Server 8.5 for PHP 7 technology preview \nThe technology preview of Zend Server 8.5 adds support for PHP 7, ensuring that companies are able to migrate their applications to realize the performance benefits of PHP 7. As the leading professional PHP distribution offering with advanced value-add capabilities, Zend Server optimizes productivity, performance, scalability, and reliability of PHP applications. Access it here: http://www.zend.com/en/products/server/php-7-tech-preview \nZend Studio 13 with PHP 7 Express migration assistant \nThis unprecedented release of Zend Studio takes PHP development to a new realm and includes support for PHP 7 with PHP 7 Express migration assistant. PHP 7 Express helps get a precise picture of what needs to be fixed in code to be able to run it smoothly on PHP 7. It scans code for compatibility issues -- such as new reserved words and deprecated usages in PHP 7 -- and then displays any issue it identifies in a list in a dedicated new view. This view displays what the issue is and then opens the exact corresponding file and line in the project. \nZend Professional Services and Training for PHP 7 \nThe renowned team of experts at Zend have some of the deepest PHP knowledge in the world. Fortune 2000 companies worldwide are able to tap the knowledge powerhouse to migrate their applications to PHP 7. Zend is announcing the availability of professional service engagements as well as formal and custom training for PHP 7. For more details on Zend professional services, visit the services and support area as well as the training area at http://www.zend.com . \nFor additional information about Zend products, visit the products and solutions page at http://www.zend.com . \nAbout Zend Technologies \nZend Technologies, the PHP company, part of Rogue Wave Software, was founded by the co-authors of PHP and continues as a dominant entity behind PHP, with open source contributions such as Zend Framework, Apigility and most recently, PHPNG, the engine of PHP 7. Zend is also the leading provider of enterprise-grade PHP solutions and support for development leaders, DevOps and developers. Our customers use Zend Server with Z-Ray, Zend Studio and Zend Guard to improve application performance and quality, speed up their release cycles and mitigate risk. We let you focus on innovation rather than using cycles to manage the stack and troubleshoot issues. Join Zend leading customers such as BNP Paribas, Best Buy, GE, Prada and other leading brands worldwide. Visit us at www.zend.com . Contact:", "external_links": [], "published": "2015-10-20T18:00:00.000+03:00", "crawled": "2015-10-20T18:43:17.372+03:00", "highlightTitle": ""}