{"organizations": ["Boulder CO", "North America GSA Today", "GSA Today", "Pangea"], "uuid": "cdc4f5223450f1d85cc71323827ada7808d03435", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.spacedaily.com", "main_image": "http://www.spxdaily.com/images-bg/paleogeographical-map-pangea-reefs-late-triassic-blue-early-jurassic-red-bg.jpg", "site_section": "http://www.terradaily.com/terradaily.xml", "section_title": "Earth News, Earth Science, Energy Technology, Environment News", "url": "http://www.spacedaily.com/reports/GSA_Today_study_documents_rare_early_Jurassic_corals_from_North_America_999.html", "country": "US", "title": "GSA Today study documents rare early Jurassic corals from North America", "performance_score": 0, "site": "spacedaily.com", "participants_count": 0, "title_full": "GSA Today study documents rare early Jurassic corals from North America", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T05:25:00.000+03:00", "replies_count": 0, "uuid": "cdc4f5223450f1d85cc71323827ada7808d03435"}, "author": "", "url": "http://www.spacedaily.com/reports/GSA_Today_study_documents_rare_early_Jurassic_corals_from_North_America_999.html", "ord_in_thread": 0, "title": "GSA Today study documents rare early Jurassic corals from North America", "locations": ["Lathuiliere", "North America"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hodges", "Marchal", "Stanley"], "text": "GSA Today study documents rare early Jurassic corals from North America by Staff Writers Boulder CO (SPX) Oct 06, 2015 This image is from Hodges and Stanley: Paleogeographical map of Pangea (gray) showing reefs of the Late Triassic (blue boxes) and the Early Jurassic (red circles). The star represents Ferguson Hill Member corals. Data derived from the Palaeoreef database. Map modified from Lathuiliere and Marchal, 2009. Image courtesy Hodges and Stanley, 2015, GSA Today, and Lathuiliere and Marchal, 2009. For a larger version of this image please go here . \nMass extinction events punctuate the evolution of marine environments, and recovery biotas paved the way for major biotic changes. Understanding the responses of marine organisms in the post-extinction recovery phase is paramount to gaining insight into the dynamics of these changes, many of which brought sweeping biotic reorganizations. \nIn the October issue of GSA Today, Montana Hodges and George Stanley Jr. of the University of Montana Paleontology Center report on coral recovery after the end-Triassic mass extinction event at the Triassic-Jurassic (T/J) mass extinction boundary. The authors examined Jurassic corals in a continuous depositional section of the Gabbs and Sunrise Formations near New York Canyon in west-central Nevada, USA. \nBecause Early Jurassic corals from North America are so rare, newly discovered occurrences are vital to understanding biotic responses in the post-mass extinction interval. In this paper, Hodges and Stanley make a preliminary report of the earliest Jurassic corals from the U.S., which are also some of the earliest in North America. These examples occur at New York Canyon in west-central Nevada's Sunrise Formation. \nThis site has attracted international attention because it is among the best-documented T/J sections in North America. The coral occurrences in this section are near the T/J boundary, making the Nevada site ideal for understanding the dynamics of coral recovery and comparing them with the Tethys. \nThe authors write that these New York Canyon corals offer additional information on recovery in eastern Panthalassa along the craton of North America. \"Paleogeographically, the New York Canyon corals show a strong connection with the Tethys, but in contrast are exclusively solitary and exclusively stylophyllid taxa. Hettangian corals are unknown from North America, so for the present, the New York Canyon site may be the earliest North American Jurassic example.\" \nAccording to Hodges and Stanley, analysis of these corals fills a neglected but important part of the T/J recovery phase in North America, while lending support for an earlier opening of the Hispanic Corridor. \nNorth American coral recovery after the end-Triassic mass extinction, New York Canyon, Nevada Montana S. Hodges and George D. Stanley Jr., University of Montana Paleontology Center, 32 Campus Drive, Missoula, Montana 59812, USA. Pages 4-9; doi: 10.1130/GSATG249A.1. .", "external_links": [], "published": "2015-10-06T05:25:00.000+03:00", "crawled": "2015-10-06T10:38:56.458+03:00", "highlightTitle": ""}