{"organizations": [], "uuid": "3daf77fe8eb26fe94cc7ed075531cb420a81caed", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.whatech.com", "main_image": "", "site_section": "http://www.whatech.com/?format=feed&type=rss", "section_title": "WhaTech -  Technology News | Supplier Sourcing |  Community - WhaTech", "url": "https://www.whatech.com/infrastructure-protection/news/97938-pel538-all-australia-s-spatial-data-brought-together", "country": "AU", "title": "All Australia’s spatial data, brought together", "performance_score": 0, "site": "whatech.com", "participants_count": 1, "title_full": "All Australia’s spatial data, brought together", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T06:27:00.000+03:00", "replies_count": 0, "uuid": "3daf77fe8eb26fe94cc7ed075531cb420a81caed"}, "author": "webmaster@whatech.com.au (Stern Curator)", "url": "https://www.whatech.com/infrastructure-protection/news/97938-pel538-all-australia-s-spatial-data-brought-together", "ord_in_thread": 0, "title": "All Australia’s spatial data, brought together", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published on Monday, 12 October 2015 14:27 Submitted by Stern Curator Page views: 18 times The Federal Government is expected to launch in February 2016 a database that will eventually contain information on every property in Australia, and much more, in standardised form and freely accessible. The Foundation Spatial Data Framework (FSDF) project is being run by ANZLIC, the Spatial Information Council, the peak intergovernmental organisation providing leadership in the collection, management and use of spatial information in Australia and New Zealand. According to ANZLIC, FSDF will “deliver a national coverage of the best available, most current, authoritative source of foundation spatial data which is standardised and quality controlled.” It will include: geocoded addressing data; administrative boundaries; positioning; place names; land parcel and property; imagery; transport; water; elevation and depth and land cover data. The chair of ANZLIC, Drew Clarke, said in a guide to the new system published in 2014: “The real and tangible benefits of the framework will become self-evident as we progress from the current state of our national foundation spatial data towards the desired state. “Some of the benefits to be realised include improving supply chains, realising efficiencies and reducing the duplication of effort in the Australian, state and territory governments. This will be achieved through strong leadership from ANZLIC. By leveraging its extensive networks of expertise throughout the jurisdictions and the Intergovernmental Committee on Surveying and Mapping, I remain confident that this can all be achieved.” He expressed great hopes for the system, saying: “I have absolutely no doubt that by making the data described in the framework as accessible and useable as possible we will have contributed significantly to the economy, society and the environment through innovation, competition, productivity and job creation.” He suggested it would be “an enabler for a wide range of other information activities, in a similar way that the internet has been an enabler for business and social interaction.” Helen Owen, assistant secretary of data policy in the Department of Communications, told a parliamentary committee in August that Australian governments spent around $200 million each year on geospatial data collection and that because their efforts were duplicated across a number of federal, state and territory government, taxpayers were effectively paying multiple times for access to the same geospatial data. She added that if the amount spent by the Department of Defence were included, the figure would be considerably higher. PelicanCorp PelicanCorp’s technology and service suite has been designed and built around the network and asset design and construction processes. Civil contractors operating in the ‘before you dig’ sector, use PelicanCorp’s services to locate and protect the essential infrastructure of public and private sector organisations including those providing telecommunications, power, water and other services. PelicanCorp operates in Australia, New Zealand, UK, North America, Europe and Singapore. It was established in 2000 and is headquartered in Melbourne, Australia. For further information please visit www.pelicancorp.com ...", "external_links": [], "published": "2015-10-12T06:27:00.000+03:00", "crawled": "2015-10-13T15:07:05.269+03:00", "highlightTitle": ""}