{"organizations": [], "uuid": "45b4c55265996adcc25bc7e61f64351015b8a7ae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://www.freshnews.com/news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1135820/bolstered-250k-nih-grant-prometheus-research-announces-novel-edc-interoperability-stan", "country": "US", "title": "Bolstered by $250K NIH Grant, Prometheus Research Announces Novel EDC Interoperability Standard, Accelerates Biomedical and Behavioral Research", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "Bolstered by $250K NIH Grant, Prometheus Research Announces Novel EDC Interoperability Standard, Accelerates Biomedical and Behavioral Research", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T10:00:00.000+03:00", "replies_count": 0, "uuid": "45b4c55265996adcc25bc7e61f64351015b8a7ae"}, "author": "admin", "url": "http://www.freshnews.com/news/1135820/bolstered-250k-nih-grant-prometheus-research-announces-novel-edc-interoperability-stan", "ord_in_thread": 0, "title": "Bolstered by $250K NIH Grant, Prometheus Research Announces Novel EDC Interoperability Standard, Accelerates Biomedical and Behavioral Research", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Submitted by admin on 10/5/2015 @ 12:00 AM   Prometheus Research \nNEW HAVEN, Conn., Oct. 5, 2015 /PRNewswire/ -- Prometheus Research has been awarded over $250,000 from the National Institutes of Health (NIH) to transform the way electronic data capture (EDC) forms are configured, integrated, and shared for biomedical and behavioral health research. The grant, part of NIH's Small Business Innovation Research (SBIR) program, seeks to empower mental health researchers to easily share, reuse, and locate electronic data capture forms across a variety of EDC platforms. \nThe outcome of the grant is expected to have an impact on research areas well beyond mental and behavioral health. The increased popularity of patient reported outcomes, hospital- and provider-based quality improvement initiatives, and multisite collaborations have only exacerbated the prevalent research issue of EDC interoperability. \n\"Many EDC tools, and especially those used by mental health researchers, are dead-ends from an interoperability standpoint,\" shared Dr. Frank Farach, Staff Scientist and Director of Program Management at Prometheus Research. \"In an ideal world, each research instrument would need to be configured only once, would be stored in an easily accessible place for others to use, and would work seamlessly with any EDC tool.\" \nPrometheus is utilizing the grant funds to create the Research Instrument Open Standard (RIOS). RIOS is a publicly-available, rigorous standard for representing research instruments and eliminates the need for redundant EDC form configuration. As part of the NIH grant, Prometheus Research is also developing a set of adapters to translate instrument configurations between RIOS and the formats used by other popular EDC systems: Research Electronic Data Capture (REDCap), Qualtrics, and Prometheus' RexEntry and RexSurvey applications. \nUsing RIOS, an instrument that was configured for form data entry in RexSurvey, for example, could immediately be used in RedCap, Qualtrics, or RexEntry -- and vice versa. This eliminates the need to reconfigure the instrument in each tool, accelerating research, and mitigating troublesome data quality issues that normally appear downstream. \nPrometheus Research is collaborating with the Center for Open Science (COS) to bundle RIOS and the format conversion tools into an \"add-on\" module for the COS's free, web-based scientific collaboration platform, the Open Science Framework (OSF). \nMore information is available at https://bitbucket.org/prometheus/rios.core and https://rios.readthedocs.org/en/latest/ . \nResearch reported in this publication was supported by the National Institute of Mental Health of the National Institutes of Health under Award Number R43MH106225. The content is solely the responsibility of the authors and does not necessarily represent the official views of the National Institutes of Health. \nAbout Prometheus Research \nPrometheus builds state-of-the-art integrated registry solutions for its international portfolio of health-focused partners. Existing at the intersection of open source technology and clinical research informatics, our mission is to enable extraordinary outcomes in biomedical research, quality improvement, education, and advocacy by making data integration more efficient and repeatable. Learn more by visiting www.PrometheusResearch.com. \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/bolstered-by-250k-nih-grant-prometheus-research-announces-novel-edc-interoperability-standard-accelerates-biomedical-and-behavioral-research-300153566.html \nSOURCE Prometheus Research", "external_links": [], "published": "2015-10-05T10:00:00.000+03:00", "crawled": "2015-10-05T12:48:34.068+03:00", "highlightTitle": ""}