{"organizations": [], "uuid": "94d1128280ca139968a163f9535a0cbf60b87276", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "science-technology.news-articles.net", "main_image": "", "site_section": "http://science-technology.news-articles.net/content/rss.php", "section_title": "Science and Technology @ News Articles Network", "url": "http://science-technology.news-articles.net/content/intersils-new-ldo-regulators-provide-best-class-dropout-transient-performance-sensitive-loads.xhtml", "country": "US", "title": "Intersil's New LDO Regulators Provide Best-in-Class Dropout and Transient Performance for Sensitive Loads", "performance_score": 0, "site": "news-articles.net", "participants_count": 0, "title_full": "Intersil's New LDO Regulators Provide Best-in-Class Dropout and Transient Performance for Sensitive Loads", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T16:23:00.000+03:00", "replies_count": 0, "uuid": "94d1128280ca139968a163f9535a0cbf60b87276"}, "author": "", "url": "http://science-technology.news-articles.net/content/intersils-new-ldo-regulators-provide-best-class-dropout-transient-performance-sensitive-loads.xhtml", "ord_in_thread": 0, "title": "Intersil's New LDO Regulators Provide Best-in-Class Dropout and Transient Performance for Sensitive Loads", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Intersil's New LDO Regulators Provide Best-in-Class Dropout and Transient Performance for Sensitive Loads   Published on 2015-10-05 05:30:52 Intersil's New LDO Regulators Provide Best-in-Class Dropout and Transient Performance for Sensitive... -- MILPITAS, Calif., Oct. 5,   Intersil's new ISL80510 and ISL80505 LDO regulators deliver clean output voltage to CPUs, DSPs and MCUs. × <- stripped tags -> Intersil's new ISL80510 and ISL80505 LDO regulators deliver clean output voltage to CPUs, DSPs and MCUs. \n[[UEdFZ2NtVnNQVndpYm05bWIyeHNiM2RjSWlCb2NtVm1QVndpWENJZ2IyNWpiR2xqYXowbmNHOXpkRlJ2Um1WbFpDaGNJbWgwZEhBNkx5OXdhRzkwYjNNdWNISnVaWGR6ZDJseVpTNWpiMjB2Y0hKdVpuVnNiQzh5TURFME1Ea3lOaTh4TkRnMk9UaGNJaWs3SUhKbGRIVnliaUJtWVd4elpUc25QanhwYldjZ2MzSmpQVndpYUhSMGNITTZMeTloYzNObGRITXlMbkJ5Ym1WM2MzZHBjbVV1WTI5dEwyUmxjMmxuYm1sdFlXZGxjeTltWWw5emFHRnlaUzV3Ym1kY0lpQXZQand2WVQ0PXw=]] Intersil Corporation Logo  ><- stripped tags -> MILPITAS, Calif. , Oct. 5,   Intersil Corporation (NASDAQ: ISIL ), a leading provider of innovative power management and precision analog solutions, today announced two new high performance, single output low-dropout (LDO) voltage regulators that provide best-in-class dropout and transient performance for noise sensitive loads. The ISL80510 and ISL80505 deliver 1A and 0.5A of continuous output current and ultra-low dropout of 130mV and 45mV at full load, respectively. The ISL80510's maximum dropout is nearly 50% lower than the nearest competitor, which enables lower power dissipation in industrial, wired and wireless equipment. Intersil's ISL80510/05 LDOs also provide better transient performance with peak-to-peak excursions up to nine times lower than competitive LDOs. This transient performance level and DC accuracy of 1.8% safeguards against voltage undershoots and overshoots to deliver clean point-of-load voltage to CPUs, DSPs and MCUs, which require tight voltage accuracy and low noise. The ISL80510/05's compensation loop provides excellent noise filtering by maintaining a flat power supply rejection ratio (PSRR) response over a wide range of frequencies. The ISL80510 operates from input voltages of 2.2V to 6V, and the ISL80505 supports 1.8V to 6V. The output voltage of these LDOs can be adjusted from 0.8V to 5.5V, which enables designers to cover a broad range of applications including low power RF amplifiers, communications equipment, industrial process control systems, test instruments, medical equipment, and consumer network routers. An adjustable soft-start feature allows designers to control the input inrush current and program the startup time to accommodate any power-up sequencing requirement. \"We increasingly see a broad range of applications that need a cost-effective, yet high performance LDO solution to address noise sensitive loads,\" said Mark Downing , senior vice president of Infrastructure and Industrial Power Products at Intersil. \"The pin-compatible ISL80510 and ISL80505 easily satisfy this requirement with best-in-class dropout and transient response, and programmable soft-start features at the right price point.\" Key Features and Specifications of ISL80510 and ISL80505 ISL80510 single-output LDO voltage regulator enables best-in-class dropout of 130mV at Vout of 2.5V with a 1A load current ISL80505 single-output LDO voltage regulator enables ultra-low dropout of 45mV at Vout of 2.5V with a 500mA load current Stable operation with a small 4.7μF output ceramic capacitor Delivers ±1.8% Vout accuracy guaranteed over line, load and junction temperature range of -40°C to +125°C Programmable output soft-start supports sequencing and helps power supply designer control inrush current Current limit protection and thermal shutdown function safeguards against excessive load current or operating temperature The ISL80510 and ISL80505 LDOs can be combined with the ISL80136 40V/50mA linear regulator, ISL80138 40V/150mA linear regulator, and synchronous step-down DC/DC converters, such as the ISL8117A and ISL8026 , to support the bulk power rails in a typical process control industrial application. Pricing and Availability The ISL80510 and ISL80505 are available now and priced at $0.39 USD in 1k quantities. Both LDOs are pin-to-pin compatible and supplied in thermally enhanced 8-lead, 3mm x 3mm DFN packages. The ISL80510EVAL1Z evaluation board is available now and priced at $20 USD . Designers can use it to quickly evaluate the features and performance of the 1A ISL80510 and 500mA ISL80505. For more information on the ISL80510 and ISL80505 LDO voltage regulators and evaluation board, please visit: www.intersil.com/products/isl80510 and www.intersil.com/products/isl80505 . About Intersil Intersil Corporation is a leading provider of innovative power management and precision analog solutions. The company's products form the building blocks of increasingly intelligent, mobile and power hungry electronics, enabling advances in power management to improve efficiency and extend battery life. With a deep portfolio of intellectual property and a rich history of design and process innovation, Intersil is the trusted partner to leading companies in some of the world's largest markets, including industrial and infrastructure, mobile computing, automotive and aerospace. For more information about Intersil, visit our website at www.intersil.com . Intersil and the Intersil logo are trademarks or registered trademarks of Intersil Corporation. All other brands, product names and marks are or may be trademarks or registered trademarks used to identify products or services of their respective owners. Join the Conversation", "external_links": [], "published": "2015-10-05T16:23:00.000+03:00", "crawled": "2015-10-05T16:11:01.444+03:00", "highlightTitle": ""}