{"organizations": ["Revenue Cycle Management Solutions"], "uuid": "7f02bbe2769f5b91a9c07ca2f497b8aed1df1cc7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tmcnet.com", "main_image": "", "site_section": "http://rss.tmcnet.com/rss/information%20technology", "section_title": "TMCnet.com RSS Service: information technology", "url": "http://www.tmcnet.com/usubmit/2015/10/07/8257788.htm", "country": "US", "title": "In Fourth Consecutive Win, ZirMed Ranks First for Revenue Cycle Management Solutions in Black Book™ Report", "performance_score": 0, "site": "tmcnet.com", "participants_count": 0, "title_full": "In Fourth Consecutive Win, ZirMed Ranks First for Revenue Cycle Management Solutions in Black Book™ Report", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T17:23:00.000+03:00", "replies_count": 0, "uuid": "7f02bbe2769f5b91a9c07ca2f497b8aed1df1cc7"}, "author": "", "url": "http://www.tmcnet.com/usubmit/2015/10/07/8257788.htm", "ord_in_thread": 0, "title": "In Fourth Consecutive Win, ZirMed Ranks First for Revenue Cycle Management Solutions in Black Book™ Report", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "In Fourth Consecutive Win, ZirMed Ranks First for Revenue Cycle Management Solutions in Black Book™ Report [October 07, 2015] Tweet \nLOUISVILLE, Ky. , Oct. 7, 2015 /PRNewswire/ -- ZirMed ®, which empowers healthcare organizations to optimize revenue and population health with the nation's only comprehensive end-to-end platform of cloud-based financial and clinical performance management solutions, today announced the results of Black Book ™ Rankings 2015 User Survey . In the report, ZirMed was recognized as the top-ranked comprehensive revenue cycle management (RCM) solution for small and community hospitals under 200 beds. ZirMed also received a second place ranking as the RCM software system for large hospitals and academic medical centers over 200 beds. \nBlack Book Rankings, a full-service healthcare-centric market research company, annually surveys information technology and service users on the trends and directions of hospitals, chains and physician practices. The report analyzes customer satisfaction across 18 client experience-based key performance indicators to determine top performing RCM software providers. This year's report marks the fourth consecutive year that ZirMed has received a first place ranking, which is demonstrative of the company's commitment to helping provider organizations improve clinical and financial outcomes in an ever-changing healthcare landscape. \n\"While the list of challenges that healthcare finance leaders face continues to grow, we've remained steadfast in our commitment to helping providers get paid,\" said Tom Butts , chief executive officer, ZirMed. \"The results of this report not only highlight ZirMed's outstanding client service, but also how our technology is helpig providers shift to value-based reimbursement. We're honored to receive top marks yet again.\" \nOver 8,000 administrative/financial/technology support staff of hospitals and physician practices contributed to this year's Black Book™ survey. The report is one of a series of four research segments that Black Book™ is compiling to share RCM trends at hospitals and physician practices, as well as rank the top technology vendors in customer satisfaction. \nZirMed's cloud-based solutions help over 300,000 providers and more than 8,000 healthcare organizations manage major financial challenges, such as uncompensated care, patient responsibility and the shift to fee-for-value. ZirMed's comprehensive end-to-end platform encompasses patient access, charge integrity, claims management, AR management, patient responsibility, and population health management. \nAbout Black Book™ Black Book Rankings, a division of Black Book Market Research LLC, provides healthcare IT users, media, investors, analysts, quality minded vendors, and prospective software system buyers, pharmaceutical manufacturers, and other interested sectors of the clinical technology industry with comprehensive comparison data of the industry's top respected and competitively performing technology vendors. \nThe largest user opinion poll of its kind in healthcare IT, Black Book™ collects over 600,000 viewpoints on information technology and outsourced services vendor performance annually. For methodology, auditing, resources, comprehensive research and ranking data see http://www.blackbookmarketresearch.com . \nAbout ZirMed® ZirMed empowers healthcare organizations of all sizes and types to optimize revenue and population health with the nation's only comprehensive end-to-end platform of cloud-based financial and clinical performance management solutions—including patient access, charge integrity, claims management, AR management, patient responsibility, and population health management. By combining breakthrough predictive analytics technology with innovative software development and the industry's most advanced transactional network, ZirMed solutions extract actionable insights that improve our clients' revenue cycles and support effective management of population health—while streamlining workflows, increasing operating efficiencies, and driving bottom-line performance. ZirMed's technology and client support continue to be honored with top industry awards, including KLAS®, Healthcare Informatics, Best of SaaS Showplace (BoSS), and Black Book Rankings. To learn how ZirMed can help your healthcare organization boost its financial and clinical performance in an era of changing reimbursement models and rising operating costs, visit www.ZirMed.com . \nMedia Contact:", "external_links": [], "published": "2015-10-07T17:23:00.000+03:00", "crawled": "2015-10-08T06:32:40.379+03:00", "highlightTitle": ""}