{"organizations": [], "uuid": "19a9fc3437f2a37c64ecca0082c4eefba0c8ac3a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/z/s/0/m/image.related.afrArticleLead.620x365.gjzr8j.png/1444007517242.jpg", "site_section": "http://www.afr.com/technology", "section_title": "Technology News | afr.com", "url": "http://www.afr.com/business/sport/entrepreneur-launches-g1x-digital-media-horse-racing-business-20151002-gjzr8j", "country": "AU", "title": "Entrepreneur launches G1X digital media horse racing business", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Entrepreneur launches G1X digital media horse racing business | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T21:15:00.000+03:00", "replies_count": 0, "uuid": "19a9fc3437f2a37c64ecca0082c4eefba0c8ac3a"}, "author": "Post to Linkedin", "url": "http://www.afr.com/business/sport/entrepreneur-launches-g1x-digital-media-horse-racing-business-20151002-gjzr8j", "ord_in_thread": 0, "title": "Entrepreneur launches G1X digital media horse racing business", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Acquire Learning boss John Wall (left) has formed his own digital horse racing media business G1X. Patrick Scala Share on twitter by John Stensholt Entrepreneur John Wall will this week launch a new digital horse racing media business, employing several racing identities formerly employed by the now defunct ThoroughVision Network (TVN).\nWall, the group managing director and majority owner of fast-growing education and job network business Acquire Learning , has ploughed several million dollars into the G1X.com.au digital media venture that will launch this week.\nThe free website and video content service will feature racing media identities Bruce Clark, Mick Sharkie, Richie Callander, Adrian Dunn, who have all either appeared on racing television or radio networks in the past or written for mainstream media organisations.\nG1X will also compete with established racing media, including the Racing Victoria and Seven West Media joint venture racing.com and Tabcorp's Sky Racing network and Sky Sports Radio.\nGap in the market Wall said he believes he has spotted a gap in the market to provide coverage across all racing jurisdictions after the TVN network joint venture between racing authorities in Victoria and NSW was abandoned earlier this year.\n\"I'm passionate about racing and I race horses in Perth, Melbourne and Sydney and there isn't a one-stop stop for information about all of those. So what we want to do is help promote racing to digital audiences. We've had a look at what the likes of Vice are doing online and we want to appeal to millennials and women as well as racing fans.\"\nThe site will be a mixture of video content and written articles, according to Wall. There will be longer-form video content on Monday, Thursday and Friday, which will include a mixture of analysis, entertainment and racing tips. \"It will be an online TV station in effect, with TV quality content for people to enjoy,\" said Wall.\n He would not reveal the exact amount he has pour into the venture, but said it was \"a significant amount\" and that the site would carry advertising from bookmakers to offset costs.\nWall said it would be primarily funded by him and the G1X media talent, thought there would be scope for other Acquire Learning executives such as chairman and horse racing enthusiast Andrew Demetriou to also put money into the venture.", "external_links": ["https://twitter.com/JohnStensholt"], "published": "2015-10-04T21:15:00.000+03:00", "crawled": "2015-10-05T08:28:13.905+03:00", "highlightTitle": ""}