{"organizations": [], "uuid": "a5e924bddffcbd9188ea0c7341e95f697703cd4b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theatlantic.com", "main_image": "http://cdn.theatlantic.com/assets/media/img/mt/2015/10/RTS116L/facebook.jpg?1443752999", "site_section": "http://www.theatlantic.com/writers/", "section_title": "The Atlantic — News and analysis on politics, business, culture, technology, national, international, and life – TheAtlantic.com", "url": "http://www.theatlantic.com/politics/archive/2015/10/lynch-wif-tk/408604/", "country": "US", "title": "Loretta Lynch Announces $53 Million in Anti-Recidivism Grants", "performance_score": 0, "site": "theatlantic.com", "participants_count": 1, "title_full": "Loretta Lynch Announces $53 Million in Anti-Recidivism Grants - The Atlantic", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T14:07:00.000+03:00", "replies_count": 0, "uuid": "a5e924bddffcbd9188ea0c7341e95f697703cd4b"}, "author": "Matt Ford", "url": "http://www.theatlantic.com/politics/archive/2015/10/lynch-wif-tk/408604/", "ord_in_thread": 0, "title": "Loretta Lynch Announces $53 Million in Anti-Recidivism Grants", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "U.S. Attorney General Loretta Lynch announced Thursday that the Justice Department will award $53 million in “second-chance” grants to organizations that help prevent recidivism.\n“This is an important part of the Department's work in making sure that people coming out of prisons have an opportunity to rebuild their lives and that their communities also stay safe,” she said during an interview with NBC reporter Chuck Todd at the Washington Ideas Forum.\nIn our September cover story, my colleague Ta-Nehisi Coates described the psychic and physical geography of mass incarceration as “ the Grey Wastes .” Lynch acknowledged seeing “entrenched pockets” like this in Brooklyn and Queens during her time there as a federal prosecutor.\nOne neighborhood was Brownsville. It's about a mile square. And many of its residents are young people who literally never leave that neighborhood unfortunately except when the young men go to jail. So we saw this cycle over and over again, and we were involved very directly in re-entry programs in that community in conjunction with the DA's office where it wasn't just the U.S. attorney's office, the DA's office talking to returning offenders about the costs of re-offending, it was also providing them with educational services, with family management services and information on housing and things that are such real barriers.\nDispatches from The Atlantic 's two-day conference in the U.S. capital\nRead More During the discussion, which touched on topics ranging from statistics on police killings to a bipartisan criminal-justice bill proposed Thursday in the Senate, Todd brought up a recent study about recidivism in New Orleans . In the study, researchers tracked 5,400 parolees in Louisiana after their release in the immediate aftermath of Hurricane Katrina.\nTypically, a person released from prison goes back to the home neighborhood where they committed a crime in the first place. But some post-Katrina parolees had no home neighborhood to return to after the storm. Instead, they joined family members in the diaspora of New Orleans residents to towns and cities throughout the United States. The study found that parolees were less likely to reoffend when they moved to new neighborhoods.\nLynch offered a possible explanation why:\nIt matters because of your access to services. It matters because of your access to education. It matters because of your access to a certain quality of life. And certainly post-Katrina, the Ninth Ward suffered so tremendously both during the storm, after the storm and, frankly, even still today, that I think many residents returning were working so hard just to get the basics of life and hold it together that people would not have had access to that.\nSo individuals who went to different locations were plugged into networks of support that were stronger than they would have found in the Ninth Ward. So our goal is not to move people from their neighborhoods, our goal is to strengthen neighborhoods to support people coming back into them.\nThese second-chance grants and programs, if successful, would offer a promising chance for former inmates to break the carceral cycle.", "external_links": ["https://www.themarshallproject.org/2015/06/04/you-can-t-go-home-again"], "published": "2015-10-02T14:07:00.000+03:00", "crawled": "2015-10-02T13:12:17.965+03:00", "highlightTitle": ""}