{"organizations": [], "uuid": "b3aa0d0cc24dc299812d2fd870a4d16cb6f7d162", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.computerweekly.com", "main_image": "http://cdn.ttgtmedia.com/rms/onlineImages/Editorial Logos/cw_379x201.png", "site_section": "http://www.computerweekly.com/feed/abbb85bc-f3a3-43e4-baf8-00c3270dfe6c/CW360/eBusiness-from-ComputerWeekly.xml", "section_title": "ComputerWeekly: Internet technology", "url": "http://www.computerweekly.com/news/4500255615/CIO-interview-Christina-Scott-CIO-Financial-Times", "country": "US", "title": "CIO interview: Christina Scott, CIO, Financial Times", "performance_score": 0, "site": "computerweekly.com", "participants_count": 1, "title_full": "CIO interview: Christina Scott, CIO, Financial Times", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T18:30:00.000+03:00", "replies_count": 0, "uuid": "b3aa0d0cc24dc299812d2fd870a4d16cb6f7d162"}, "author": "ComputerWeekly.com(editor@www.com)", "url": "http://www.computerweekly.com/news/4500255615/CIO-interview-Christina-Scott-CIO-Financial-Times", "ord_in_thread": 0, "title": "CIO interview: Christina Scott, CIO, Financial Times", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  Download Current Issue \nChristina Scott, CIO at the Financial Times ( FT ), recognises that modern technology leaders must create a strong partnership between digital systems and consumer services. So much so, in fact, that she has created the role of chief product and information officer at the FT to deliver benefits to both the business and its customers. \n“It’s great working for a company with a strong business model and a clear idea of where it wants to move at a strategic level,” she tells Computer Weekly. Scott certainly has a broad range of priorities to keep her team busy, from making the most of data to building a new subscription platform and preparing for new owners. \n“We’ve put in place some important IT foundations on which to grow the business,” she says. “There are not many news organisations that are profitable. Having done all the groundwork, I find that people across the organisation are pretty open to thinking about how the business can move forwards.” Accepting the challenge of working in a fast-moving sector \nScott joined the FT as CIO in 2012 after working for BT, BBC and ITV Digital. She jumped at the chance to move back into the fast-moving world of media. “I had experience of working with journalists at the BBC and I loved being in a news environment,” she says. \n“As a technologist, media offers a really great stage upon which to be involved in the business. Media organisations tend to understand the importance of technology more than other companies.” \nIT, says Scott, is intrinsically linked to the products and services that the FT sells . “People buy the FT to be better informed,” she says. “We’re selling the content and insight, and a large proportion of our interactions with our customers today involve the use of digital platforms.” \nThe close interaction between the technology the FT uses and the products it sells led Scott to expand her management portfolio last year. She now holds the role of chief product and information officer. As product manager, Scott is responsible for understanding the market, the customer and the various requirements of users across the organisation. \n“I wanted to recognise that product is an important discipline,” says Scott. “In the media sector, the product management role is about understanding the roadmap for digital services, and balancing the requirements of the editorial side with the commercial side of the business.” \n“ My team is not just seen as a cost to the business; my department is viewed as absolutely core to revenue generation ” \nChristina Scott, FT \nThe combination of product and information, says Scott, helps to create an extremely strong customer focus at an executive level. The FT might be renowned globally for creating great content, but it is still possible to deliver the wrong type of experience to customers. \n“If our readers can’t find what they’re looking for, then there’s no point in us producing the best content in the world,” says Scott. “Technologies, and the products we help to deliver, are absolutely core to the business. My team is not just seen as a cost to the business; my department is viewed as absolutely core to revenue generation.” Creating a collaborative approach to make the most of data \nScott says her team’s number one priority is the redesign of FT.com. The aim is to produce the highest quality customer experience possible, and this concentration has pushed a commensurate change in culture across the business. “We want to work very collaboratively and be data driven,” she says. \nThe initiative includes a number of developments. Scott says the team is using A/B testing to compare different versions of the website. The developers are also working with the FT ’s in-house data analytics team to help inform product decisions. Scott says the FT is using semantic metadata to ensure that content is discoverable and that the right recommendations are made to customers. \nInformation, then, is crucial to the website redesign. But Scott says the project is much more than another big data initiative. “A lot of people just think you need to build a data warehouse ,” she says. “Our approach is the exact opposite – we look at the data we have, prove its value alongside the rest of the business, and then worry about the technology afterwards.” \nScott says data analysts at the FT were initially focused on advertising and marketing. These specialists developed a close working relationship with functional chiefs. Now, having proven the value in two areas of the company, everybody across the organisation is keen to receive more data-led insight. \n“We’ve expanded out into all parts of the business. The challenge is that you don’t have a very scalable approach if you also expect your analysts to carry on dealing with normal report-type queries,” says Scott. \n“So, on the technology side, we focused on developing a new data platform. And having done that, we have looked at usability and democratising data to make sure that all parts of the organisation can get to the information they need to complete their day-to-day jobs.” Moving to new systems and personalising services \nThe FT has also refreshed its membership platform, using Zuora’s cloud billing platform and Salesforce’s customer relationship management system . Scott says the platform, which will replace a legacy eRights publishing system at the end of 2015, will provide a strong foundation for the next phase of business growth. \n“We might look at different payment systems and currencies, and different ways of packaging the content,” she says. One big step forward has already taken place. Earlier this year, the FT moved from a tiered paywall – where visitors could read eight articles a month without full subscription – to a new pay-trial system, where readers pay a nominal fee for a month’s access to all content prior to a full subscription. \n“That transition was possible because of our work on the new platform,” says Scott. On joining the business, Scott and her team spent a prolonged period of time working alongside Zuora to work out how to make the most of the technology. Read more CIO interviews Aviva’s CIO, Monique Shivanandan , talks agile working, digital disruption and changing the culture of a complex 300-year-old company. Elizabeth Eastaugh, director of technology at Expedia , is on a mission to add diversity to the software engineering community. RSPCA CIO Billie Laidlaw explains how the charity ’ s cloud-first approach to IT procurement benefits the animals in its care. \nThe business began moving data across from its mix of legacy and in-house billing systems in 2012, going live with some customer data the following year. Since then, Scott and her team have worked hard to ensure the business has been able to make the most of its existing legacy platform, while also continuing its careful and staged transition to the new Zuora system. \n“It’s difficult to let the business progress while you’re implementing new technology,” she says. “You either stop them working completely, which is going to prove very unpopular, or you work on both systems in parallel, which is what we’ve tried to do.” \nCertain areas have proved challenging, particularly in regards to data migration. Scott says the legacy eRights system provided no standard system for the classification of customer information. Linking Zuora to Salesforce allows the FT to take a more integrated approach and to potentially deliver personalised services to its customers across newspapers, magazines and events. Supporting the transition to a new way of working \nScott says the introduction of new platforms is part of a wider shift towards business-focused outcomes. In the past, the IT team would state that it would deliver a specific set of systems and services with an expected return on investment. This model would involve multi-page business cases. \nThe new model states clearly from the outset how much money the business is prepared to invest in IT. “It’s quite a different approach,” she says, adding the aims for a project might involve, for example, a rise in customer engagement . She says this new way of working represents a significant shift, particularly for those working outside the technology department. \n“Empowering teams to find solutions based on defined outcomes creates a model where some senior managers can feel as if they are losing control,” says Scott. She says the shift towards this new way of working remains a work in progress, but the signs are positive. \n“Sometimes it can be harder than you might have anticipated, particularly when it comes to financial processes and budgeting,” says Scott. “You just have to make sure you have the right skills and the right people in your team to deliver to the desired outcomes.” \nShe recognises that attracting and retaining top talent remains a challenge for all businesses, particularly in a highly competitive location like London. Scott says that, while wages are important, CIOs must think in a more holistic way about some of the benefits their staff members are likely to receive, specifically in regard to the technologies they are able to use and the flexible working methods they are able to practice. Keeping one eye fixed firmly on the future \nScott says the FT is now at a particularly important point in its history. Former owner Pearson recently sold the company to Japanese media group Nikkei, and Scott says the deal presents an opportunity for senior leaders at the firm to think about where they want to take the FT during the next few years. \nShe says her immediate focus for the next 12 months is, first, to create a clear agenda of priorities and, second, to develop the stepping stones to achieve those aims through the technologies and products her team supports. “Strategically, we’re at a very important juncture,” she says. \n“We’re disentangling ourselves carefully from some of the systems that Pearson runs on our behalf and bringing those platforms back in-house. We’re thinking about how we might support that transition, including through the use of the cloud. There are some great opportunities for us to exploit.” CW+ Enjoy the benefits of CW+ membership, learn more and join. E-Zine", "external_links": [], "published": "2015-10-23T18:30:00.000+03:00", "crawled": "2015-10-23T20:51:25.347+03:00", "highlightTitle": ""}