{"organizations": [], "uuid": "6c5df75274b0e076ad888f7f1bb3f5bd24383f9f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com/news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1139991/verisae-positioned-independent-analyst-firm-leader-building-energy-management-software", "country": "US", "title": "Verisae Positioned by Independent Analyst Firm as a Leader in Building Energy Management Software", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "Verisae Positioned by Independent Analyst Firm as a Leader in Building Energy Management Software", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T19:51:00.000+03:00", "replies_count": 0, "uuid": "6c5df75274b0e076ad888f7f1bb3f5bd24383f9f"}, "author": "admin", "url": "http://www.freshnews.com/news/1139991/verisae-positioned-independent-analyst-firm-leader-building-energy-management-software", "ord_in_thread": 0, "title": "Verisae Positioned by Independent Analyst Firm as a Leader in Building Energy Management Software", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Submitted by admin on 10/13/2015 @ 9:51 AM Companies mentioned in this article: Verisae \nMINNEAPOLIS -- (BUSINESS WIRE) -- Verisae , the leading global provider of maintenance, machine to machine monitoring, energy, and sustainability solutions, has been recognized as a leader in Building Energy Management Software for the fifth consecutive year by independent analyst firm Verdantix. The Verdantix Green Quadrant® Building Energy Management Software 2015 (Global) report highlights the strengths of Verisae’s vx Conserve and vx Maintain platforms, and comes as Verisae users from across the globe fly in to Minneapolis for the company’s annual user conference, EFFICIENCY 2015. \nFor the 2015 report, Verdantix compared 27 building energy management software applications based on benchmark data from product demonstrations and independent customer research. Based on this analysis, and the performance of Verisae’s platform, Verdantix highlights Verisae as the pacesetter for Asset Lifecycle Management with vx Maintain. Verdantix also scored vx Conserve highly (2.5 out of 3.0) for its ability to integrate with client IT systems and capturing utility bill data through a variety of methods. \n“Verisae continues to achieve best-in-class scores for building maintenance and asset management functionalities,” says Derrek Clarke, Verdantix Industry Analyst. “We were impressed by vx Maintain’s predictive maintenance functionality, helping companies to determine when maintenance should be performed – before costly equipment failure occurs. For buyers in asset-intensive sectors, such as retail, hotels and leisure, as well as owners of dispersed global building portfolios and building owners in regions offering demand response, Verdantix believes Verisae should be included on shortlists.” \n“It’s exciting to maintain our position as a leader in the top-right of Verdantix’s Green Quadrant,” says Jerry Dolinsky, CEO of Verisae. “This recognition is the result of our continuing investment and development of our platforms, as well as the ongoing engagement we have with our customers, such as through our EFFICIENCY 2015 user conference, to ensure we are providing the very best in building energy management software.” \nEFFICIENCY 2015, Verisae’s annual user conference, takes place from October 11-14 in Minneapolis, Minnesota. During the conference, Verisae users will meet product experts, software developers, technical and training staff, and customer service support teams to build and share their knowledge of Verisae’s industry-leading systems. For more information, visit the event page for EFFICIENCY 2015 . \nAbout Verisae \nVerisae’s software technology brings together the concepts of Big Data, machine-to-machine communications and mobile technology to deliver solutions for companies in retail, utilities, telecommunications, and service management industries. Verisae analyzes data to provide predictive, prescriptive and proactive maintenance and management. Operating on an open API technology platform, Verisae’s solutions are simple, integrated and mobile. Backed by Marlin Equity Partners, a $3 billion private equity firm, Verisae has a network of more than 180,000 registered users managing in excess of three million assets at more than 370,000 sites in North America, Europe, and Asia. For more information, please visit www.verisae.com or follow Verisae on LinkedIn and Twitter . View source version on businesswire.com: http://www.businesswire.com/news/home/20151013006562/en/ Copyright © Business Wire 2015", "external_links": [], "published": "2015-10-13T19:51:00.000+03:00", "crawled": "2015-10-13T21:34:39.700+03:00", "highlightTitle": ""}