{"organizations": [], "uuid": "4d802b66540a85268351f10c66b545b488938c9b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/10/12/13018298/InfoTrends_Logosm.gif", "site_section": "http://www.prweb.com/rss2/technology.xml", "section_title": "Technology", "url": "http://www.prweb.com/releases/2015/10/prweb13018298.htm", "country": "US", "title": "Buyers Lab Strengthens its Leadership Role as a Provider of Critical Intelligence Solutions to the Digital Imaging Industry with the Acquisition of InfoTrends", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Buyers Lab Strengthens its Leadership Role as a Provider of Critical Intelligence Solutions to the Digital Imaging Industry with the Acquisition of InfoTrends", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "4d802b66540a85268351f10c66b545b488938c9b"}, "author": "Scott Phinney", "url": "http://www.prweb.com/releases/2015/10/prweb13018298.htm", "ord_in_thread": 0, "title": "Buyers Lab Strengthens its Leadership Role as a Provider of Critical Intelligence Solutions to the Digital Imaging Industry with the Acquisition of InfoTrends", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Buyers Laboratory, LLC (BLI) announced that it has acquired InfoTrends, a division of Questex, LLC. BLI is the leading provider of independent test based analytical information, competitive intelligence, sales enablement and related services to the global digital imaging industry. InfoTrends is the leading provider of strategic market analysis, research and advisory services to the global digital imaging industry with deep specializations in the production printing & digital media, office technology & services, and consumer & pro imaging segments. The business combination will create a global team of over 125 subject matter experts and a portfolio of products and services covering the industry’s strategic planning, competitive intelligence and research, sales enablement and productivity, customer engagement and product development needs.\n“We’ve long held that BLI and InfoTrends are highly complementary businesses with a shared focus on the global digital imaging industry,” said Gerry Stoia, President and Chief Executive Officer of Buyers Laboratory, LLC. “Combining BLI’s independent testing capabilities and exhaustive product knowledge with InfoTrends strategic market and research expertise is a powerful combination and will allow us to innovate across a broader portfolio of products and services and ultimately deliver greater value to our customers across the globe. We’re thrilled to be joining forces with the talented professionals at InfoTrends.”\n“InfoTrends and BLI have many shared values around client service, quality research, and the excellence of our professional staff,” commented Jeff Hayes, President of InfoTrends. “We are excited about the many opportunities created by the combination of these two great companies.”\nAbout Buyers Lab\nBLI is the authoritative provider of test based analytical information, competitive intelligence and sales enablement to the digital imaging industry with a portfolio of products and services covering hardware, software, consumables and document management. BLI supports all of the industry’s leading Original Equipment Manufacturers, Independent Software Vendors and more than a 3,000 dealers and leasing companies active in the digital imaging industry. BLI’s core platform, based on its sophisticated and proprietary analytical testing capabilities, powers a product offering that includes field and laboratory test reports, product evaluations and outsourced testing services. In addition, the Company is widely recognized for its “Awards” that distinguish OEMs, products and solutions for outstanding performance. BLI is headquartered in Fairfield NJ with country offices in the United Kingdom, Hong Kong and Japan.\nBuyers Laboratory LLC, is an investment of SFW Capital Partners ( http://www.sfwcap.com ), the leading investor in analytical tools and related services companies. SFW is a specialized private equity firm that exclusively invests in analytical instrumentation, information, software and related services businesses, where its 20+ years of knowledge of the relevant business models, technology, competitive dynamics and services requirements gives it confidence in its ability to support management teams in growing their companies and creating value.\nAbout InfoTrends\nInfoTrends, founded in 1991, helps technology vendors, their channels, and end customers understand market trends, grow their business, and improve their operations through a combination of deep subject matter expertise, innovative tools and data, and exceptional customer service. InfoTrends provides clients with a wide portfolio of market data, advisory services, private consulting, and custom content. InfoTrends focuses on how digital technology is transforming a variety of industry sectors including consumer and professional imaging, office document technology and services, customer communications & bill payment, commercial printing, signage & graphics, labels & packaging, and textiles & décor. World headquarters are located in Weymouth, Massachusetts with country offices and analysts residing in Japan, United Kingdom, Netherlands, Germany, China, and Israel.", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5zZndjYXAuY29t"], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-13T19:09:41.030+03:00", "highlightTitle": ""}