{"organizations": [], "uuid": "d2f8dddc8ad2f880cddedc4dd9b4498b64b5258a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.technology.org", "main_image": "", "site_section": "http://feeds.feedburner.com/TechnologyOrgSocialSciencesAndEconomicsNews", "section_title": "Technology Org » Social sciences and economics news", "url": "http://www.technology.org/2015/10/08/online-advertising-can-deliver-targeted-cancer-prevention-messages-ucsf-study-finds/", "country": "", "title": "Online Advertising Can Deliver Targeted Cancer Prevention Messages, Study Finds", "performance_score": 0, "site": "technology.org", "participants_count": 1, "title_full": "Online Advertising Can Deliver Targeted Cancer Prevention Messages, Study Finds", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T13:40:00.000+03:00", "replies_count": 0, "uuid": "d2f8dddc8ad2f880cddedc4dd9b4498b64b5258a"}, "author": "Raminta Šulskutė", "url": "http://www.technology.org/2015/10/08/online-advertising-can-deliver-targeted-cancer-prevention-messages-ucsf-study-finds/", "ord_in_thread": 0, "title": "Online Advertising Can Deliver Targeted Cancer Prevention Messages, Study Finds", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Online Advertising Can Deliver Targeted Cancer Prevention Messages, Study Finds Posted Today \nOnline advertising based on Google search terms is a potentially effective way to deliver targeted cancer prevention education, according to a study led by Eleni Linos, MD, DrPH, an assistant professor of dermatology at UC San Francisco. \nIndoor tanning is a preventable risk factor for skin cancer that accounts for almost half a million new malignancies per year, said Linos. “More than one in five adolescents and more than half of all college students use tanning beds, which makes them especially vulnerable,” she said. \nLinos and her research team created a series of brief advertisements about indoor tanning and skin cancer that appeared when Google users searched for information about tanning beds. The most successful ad was viewed by almost 200,000 users, about 1 percent of whom clicked on it for more information. A one percent “click-through” rate is considered commercially viable for online advertising, noted the study authors. \n“Google handles three and half billion searches a day,” said Linos. “This is an incredible opportunity for targeted, cost-effective public health messages. Even beyond skin cancer, our approach could be used for other major public health issues such as tobacco control or mental health problems.” \nThe study was published in JAMA Dermatology on October 7. \nTo test the concept of targeted online public health messages, the research team used Google AdWords, a pay-per-click online advertising service that places three-line, 105-character advertisements next to Google search results. These targeted ads appear in response to search terms entered by users. \nThe researchers created a series of ads about the health risks of indoor tanning, based on common search terms related to tanning beds. Clicking on an ad took users to a UCSF site with information from the Centers for Disease Control about the health risks of indoor tanning. \nAfter a year of online testing and refinement, the researchers selected nine ads that appeared between April 2 and June 2 – the time of year when the volume of searches for online tanning beds is highest. \nThe most effective advertisement read, “The Truth of Tanning Beds/Do you know what you are doing to your skin?/Educate yourself!” It was displayed 198,276 times and clicked on by 2,062 visitors, for a click-through rate of 1.04 percent. \n“Using online advertising for prevention is a brand new approach, and potentially a game-changer, for public health, but we still have a lot to learn,” said Linos. “Partnering with technology companies and social media is key. We need to figure out how to best reach large audiences and deliver messages that are relevant and meaningful to them. And the ultimate question is how these interventions will actually shift behaviors.”", "external_links": [], "published": "2015-10-08T13:40:00.000+03:00", "crawled": "2015-10-08T14:03:31.128+03:00", "highlightTitle": ""}