{"organizations": [], "uuid": "9d4424f91176ef85f28bd394534b4eb64986e456", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1145155/lowe-s-names-2015-innovation-and-vendor-partners-of-the-year", "country": "US", "title": "Lowe's Names 2015 Innovation And Vendor Partners Of The Year", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "Lowe's Names 2015 Innovation And Vendor Partners Of The Year", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T14:32:00.000+02:00", "replies_count": 0, "uuid": "9d4424f91176ef85f28bd394534b4eb64986e456"}, "author": "admin", "url": "http://www.freshnews.com/news/1145155/lowe-s-names-2015-innovation-and-vendor-partners-of-the-year", "ord_in_thread": 0, "title": "Lowe's Names 2015 Innovation And Vendor Partners Of The Year", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Companies mentioned in this article: Lowe's Companies, Inc. \nMOORESVILLE, N.C., Oct. 26, 2015 /PRNewswire/ -- Lowe's Companies Inc. announced this week it has named Hitachi, Pergo and Sunrise Global as the company's 2015 Vendor Partners of the Year. The companies were selected for their commitment to product quality, innovation and customer service. \nhttp://photos.prnewswire.com/prnvar/20131007/MM93272LOGO \nHitachi's exclusive relationship with Lowe's provides a broadened selection of best-in-class products with the latest innovations. Pergo developed several exclusive programs to differentiate the flooring experience by providing stylish yet affordable options. Continued collaboration with Sunrise Global has set the industry standard for 40-volt and 80-volt cordless outdoor power equipment allowing customers to better enjoy their outdoor spaces. \n\"We celebrate our vendor partners who are committed to putting the customer first, drawing on their team's creativity to find new and innovative ways to help people love where they live,\" said Mike McDermott, Lowe's Chief Merchandising Officer. \nIn addition to the overall vendor partners of the year, the following vendor partners were honored for setting the highest bar in innovation: -- All Strong Industry for the Style Selections and allen + roth cordless blinds -- Blue Rhino for refined technology to minimize environmental impact -- GE Appliances for the Cafe/Keurig Refrigerator and Edge-to-Edge Freestanding Range -- Nicolas Holiday for technology improvements to the Trim a Tree program -- MasterBrand Cabinets for style and DIY friendly options -- MTD for the Troy-Bilt FLEX line and Troy-Bilt Pivot Zero Turn Mower -- PLI Pak Lite for Pergo Gold and Floor Comfort XPS foam underlayment -- Positec for the Rockwell Bladerunner and the WORX Switch Drive 20V Drill and Drive -- Samsung for the ActiveWash Washing machine and the Flex Duo -- Skydrop for the Smart Sprinkler Controller -- Stanley Black & Decker for the DeWalt line of 40V Lithium outdoor power equipment -- Sunrise Global for the Lowe's-exclusive Kobalt 80-volt outdoor power equipment -- Teknor Apex for the Neverkink MAX garden hose \nABOUT LOWE'S Lowe's Companies Inc. (NYSE: LOW) is a FORTUNE® 50 home improvement company serving approximately 16 million customers a week in the United States, Canada and Mexico through its stores and online at Lowes.com, Lowes.ca and Lowes.com.mx. With fiscal year 2014 sales of $56.2 billion, Lowe's has more than 1,845 home improvement and hardware stores and 265,000 employees. Founded in 1946 and based in Mooresville, North Carolina, Lowe's supports the communities it serves through programs that focus on K-12 public education and community improvement projects. For more information, visit Lowes.com. \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/lowes-names-2015-innovation-and-vendor-partners-of-the-year-300165744.html \nSOURCE Lowe's Companies, Inc.", "external_links": [], "published": "2015-10-26T14:32:00.000+02:00", "crawled": "2015-10-26T15:46:02.421+02:00", "highlightTitle": ""}