{"organizations": [], "uuid": "ca2a72a34b68bbb2f26e43a4b9618480f5077db1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://www.freshnews.com/news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1137186/law-washington-f-i-library-forms-released-reynolds-document-services", "country": "US", "title": "LAW® Washington F&I Library of Forms Released by Reynolds Document Services", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "LAW® Washington F&I Library of Forms Released by Reynolds Document Services", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T21:33:00.000+03:00", "replies_count": 0, "uuid": "ca2a72a34b68bbb2f26e43a4b9618480f5077db1"}, "author": "admin", "url": "http://www.freshnews.com/news/1137186/law-washington-f-i-library-forms-released-reynolds-document-services", "ord_in_thread": 0, "title": "LAW® Washington F&I Library of Forms Released by Reynolds Document Services", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Companies mentioned in this article: The Reynolds and Reynolds Company \nDAYTON, Ohio, Oct. 6, 2015 /PRNewswire/ -- The Reynolds and Reynolds Company today announced that Reynolds Document Services has released the Reynolds LAW(®) Washington F&I Library, a comprehensive catalog of standardized, legally reviewed finance and insurance (F&I) documents available to new car and truck dealers in the state of Washington. \n\"Despite the improving economy, automobile retailers continue to face a number of pressures that impact the success of their business,\" said Jerry Kirwan, senior vice president and general manager of Reynolds Document Services. \"Among those pressures are increasing levels of regulatory scrutiny as well as higher expectations from consumers for a more rewarding car-buying experience. Part of Reynolds' response is to develop document services that help dealers address those pressures and prepare them for the future. This library of standardized documents is designed to help dealers better manage risk, improve the customer experience in F&I, and prepare for the age of electronic transactions ahead.\" \nLAW brand documents can help dealers reduce their litigation risk. The documents in the LAW Washington F&I Library are regularly reviewed for compliance with the latest regulations. Reynolds' industry-leading forms specialists lead the review alongside Reynolds' outside legal partners. \nIn addition, by using the standardized vehicle deal documents in the LAW Washington F&I Library, dealers can achieve a more consistent and effective F&I process in every transaction, which can improve the effectiveness of the F&I manager as well as improve the car-buying experience for the customer. \nThe printed documents in the LAW Washington F&I Library are also available in digital format, which helps facilitate the conversion to laser-printed transactions or e-contracting. Reynolds Document Services maintains licensing agreements with all major providers of electronic F&I solutions. \nAbout Reynolds LAW Brand Documents The Reynolds LAW brand is well established as one of the most trusted brands in the automotive industry. LAW documents are available in all 50 states and Washington, D.C., and have been endorsed by a number of state automobile dealers associations and leading automotive finance institutions. \nThe flagship product of the LAW brand is the Reynolds LAW(®) 553 Universal Retail Sale Contract , the most widely accepted document in auto finance. The Reynolds LAW 553 is available in a variety of languages and is regularly reviewed by industry experts to help keep pace with new legislative and regulatory developments. \nReynolds and Reynolds was founded in 1866 as a business forms printing company. Since the 1920s, Reynolds has been known as the leader in serving automobile dealerships nationwide with standard and custom business and vehicle sales documents to help dealers manage their operations more efficiently and serve their customers more effectively. \nAbout Reynolds Reynolds and Reynolds is a leading provider of automobile dealership software, services, and forms to help dealerships deliver better business results and transform the customer experience. ( www.reyrey.com ) \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/law-washington-fi-library-of-forms-released-by-reynolds-document-services-300155133.html \nSOURCE The Reynolds and Reynolds Company", "external_links": [], "published": "2015-10-06T21:33:00.000+03:00", "crawled": "2015-10-06T23:02:22.225+03:00", "highlightTitle": ""}