{"organizations": [], "uuid": "7d7bc17cd523ce3c967b3ef6464e08bf8b326c0c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.menafn.com", "main_image": "http://www.menafn.com/updates/pr/2015-10/PR_81953104.jpg", "site_section": "http://www.menafn.com/rss/menafn_Comm_Tech_Technologies.xml", "section_title": "MENAFN.com Comm_Tech_Technologies", "url": "http://www.menafn.com/1094388912/Huawei-Selects-Salam-Technology-as-Strategic-Channel-Partner-Extending-ICT-Excellence-in-Qatar&src=RSS", "country": "", "title": "Huawei Selects Salam Technology as Strategic Channel Partner Extending ICT Excellence in Qatar", "performance_score": 0, "site": "menafn.com", "participants_count": 1, "title_full": "Huawei Selects Salam Technology as Strategic Channel Partner Extending ICT Excellence in Qatar | MENAFN.COM", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "7d7bc17cd523ce3c967b3ef6464e08bf8b326c0c"}, "author": "Press", "url": "http://www.menafn.com/1094388912/Huawei-Selects-Salam-Technology-as-Strategic-Channel-Partner-Extending-ICT-Excellence-in-Qatar&src=RSS", "ord_in_thread": 0, "title": "Huawei Selects Salam Technology as Strategic Channel Partner Extending ICT Excellence in Qatar", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(MENAFN Press) Huawei announced at GITEX Technology Week that it signed a partnership agreement with Salam Technology, a digital infrastructure systems integrator and IT solutions provider based in Qatar. \n\nThe agreement appoints Salam Technology as a tier 1 Value Added Partner (VAP) with a focus to offer Huawei's Enterprise product portfolio to its customers and deliver post-sales professional services and support. Salam Technology will provide Huawei's range of Servers, Storage, Unified Communications solution and data center facilities through its wide network across Qatar. Within its date center solutions, the Value Added Partner will showcase Huawei's expertise in power, cooling, design and building of modular container data centers. \n\nAs part of the partnership, Salam Technology will deliver support services in Qatar, on behalf of Huawei, in cooperation with Huawei's Support and Installation delivery teams.\n\nWith over 30 years of cumulative experience, Salam Technology specializes in IT, audiovisual, security, office automation and telecommunications. Its expertise ensures it is well-positioned to provide cutting-edge technology solutions to help enterprises maintain their competitive edge and be more innovative. As a Value Added Partner, Salam Technology will utilize Huawei's training and development services to focus on delivering tailored solutions for regional safe city and smart city infrastructure mega projects. \n\nThe signing also highlighted Huawei's commitment to its new Value Added Partner with the investment in the development of a large scale Tier 3 data center at Salam Technology's HQ in Qatar. \n\nIn the enterprise ICT domain, Huawei's market strategy is to focus on close co-operation and integration with partners to deliver a wide range of highly efficient, customer-centric solutions based on a deep understanding of customer needs. Since launching its renewed strategy earlier this year Huawei has worked to extend its network, partnering with best-of-breed providers. \n\nMahmoud El Deeb, Managing Director of Salam Technology said: \"Salam Technology is pleased to have been chosen as a strategic Value Added Partner for one of the fastest growing ICT giants in the Middle East. We recognize that our customers demand better value and more flexibility from the technology industry and this partnership helps us to work with our customers to provide the best possible tailored solution. Huawei's commitment to the regional Enterprise ICT sector is impressive and its wide product portfolio makes it a perfect partner for Salam Technology's growth, due to our reputation and expertise in delivering customer centric IT technologies for enterprises across the GCC. We look forward to learning from Huawei's specialized training initiatives that will help us better sell its converged ICT solutions to our customer network.\"\n\nA core element of Huawei's channel strategy involves building upon the strength of its partner network in the Middle East, extending the availability of specialized training and technical knowledge transfer, which empower its partners to identify new opportunities for growth. These initiatives ensure that partners are equipped with the knowledge necessary to showcase how Huawei's solutions can offer greater flexibility, drive efficiency and reduce CAPEX and OPEX for businesses.\n\nDue to its strategic significance in the region, Huawei has also announced that Salam Technology will be a 'Named Channel Partner', which will see more resources allocated in an effort to provide the highest levels of support and knowledge. \n\nHany Hussein, Channel Vice President for Huawei Enterprise Middle East said: \"Salam Technology is a great addition to our strategic Value Added Partner network because of its stellar reputation as a leading technology systems integrator in the Middle East. Working together on this new collaboration is mutually beneficial and will enable Salam Technology to extend Huawei's Enterprise product portfolio to its customers across the region. In order to help enterprises address the challenges of a digital economy, we believe that we need to strengthen the support network that we offer to our partners. We are dedicated to provide the right tools, training and expertise that will empower them to grow our ICT offering in the region and help shape the enterprise landscape, driving further adoption of innovative emerging technology.\"\n\nAs Huawei's Tier 1 Value Added Partner, Salam Technology will enhance Huawei's presence in the region through its robust channel network, which will be supported in the entire cycle of sales and technical support: right from pre-sales consultancy, solutions architecture & design, through post sales implementation and support.\n\n\"We can provide the right training and knowledge platforms for our partners to deliver exceptional value to their end-users within businesses and government. Through a close-knit, focused channel network, Huawei can create stronger incentives and provide partners with greater opportunities to maximize their profitability,\" adds Hussein.\n\nFind out more about Huawei at GITEX Technology Week by visiting our microsite.\nFollow Huawei on Twitter “ @Huawei_ME \n\nAbout Huawei \nHuawei is a leading global information and communications technology (ICT) solutions provider. Our aim is to enrich life and improve efficiency through a better connected world, acting as a responsible corporate citizen, innovative enabler for the information society, and collaborative contributor to the industry. Driven by customer-centric innovation and open partnerships, Huawei has established an end-to-end ICT solutions portfolio that gives customers competitive advantages in telecom and enterprise networks, devices and cloud computing. Huawei's 170,000 employees worldwide are committed to creating maximum value for telecom operators, enterprises and consumers. Our innovative ICT solutions, products and services are used in more than 170 countries and regions, serving over one-third of the world's population. Founded in 1987, Huawei is a private company fully owned by its employees. For more information, please visit Huawei online at www.huawei.com or follow us on:http://www.linkedin.com/company/Huawei http://www.twitter.com/Huawei http://www.facebook.com/Huawei http://www.google.com/Huawei http://www.youtube.com/Huawei Huawei Enterprise Business GroupThe Enterprise Business Group service offerings focus on the enterprise infrastructure, enterprise communications, data centers, and industry applications. To support the cloud computing era and innovative new business models, the Enterprise Business Group also provides cloud computing-based data center and enterprise applications. The Enterprise Business Group has set up departmental organizations in over 100 countries and regions. By leveraging its years of technical expertise and unmatched R&D capabilities, the Enterprise Business group is well-positioned to grow together with customers and partners for the future cloud computing and ICT convergence era. Salam TechnologySalam Technology is a leading digital infrastructure systems integrator and IT solutions provider in Qatar, owned and managed by Salam International Investment Limited, a conglomerate operating within diverse business sectors.With over 30 years of cumulative experience, Salam Technology specializes in IT, audiovisual, security, office automation and telecommunications. It's well-positioned to provide cutting-edge technology solutions to help clients maintain their competitive edge and be more innovative. Through its four divisions: ICT, Digital Infrastructure, Managed Services and Resources and Network Division, Salam Technology designs, supplies, tests commissions, supports and maintains integrated solutions to clients in different business sectors: Government, Telco and Utility, Banking and Finance, Industry and Petrochemicals, and to a multitude of commercial, private and public businesses. Driven by its corporate vision and values, Salam Technology has a multi-national, highly-trained team of 150 professionals with technology expertise, unique perspectives and diverse backgrounds in management, engineering, design and sales. They execute and deliver complex projects on-time and on-budget and provide a quality after-sales support service to companies of all sizes. In order to stay true to its slogan \"Your Trusted Integration Partner\", Salam Technology has partnered with top, world-renowned solution providers and industry-leading vendors in order to provide cost-effective services and turnkey solutions built on a firm foundation of experience, steady personalized customer service and a lasting provider relationship.", "external_links": [], "published": "2015-10-19T03:00:00.000+03:00", "crawled": "2015-10-19T12:50:39.555+03:00", "highlightTitle": ""}