{"organizations": [], "uuid": "5c4d2a051546dfacdddee7e539a65ae3b8b56afb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1141765/nextech-debut-analytics-module-and-scheduling-enhancements-asps-2015", "country": "US", "title": "Nextech to Debut Analytics Module and Scheduling Enhancements at ASPS 2015", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "Nextech to Debut Analytics Module and Scheduling Enhancements at ASPS 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T23:01:00.000+03:00", "replies_count": 0, "uuid": "5c4d2a051546dfacdddee7e539a65ae3b8b56afb"}, "author": "admin", "url": "http://www.freshnews.com/news/1141765/nextech-debut-analytics-module-and-scheduling-enhancements-asps-2015", "ord_in_thread": 0, "title": "Nextech to Debut Analytics Module and Scheduling Enhancements at ASPS 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Submitted by admin on 10/16/2015 @ 1:01 PM   NexTech \nTAMPA, FL--(Marketwired - October 16, 2015) - Nextech, the market leader in Plastic Surgery software, announces they will be attending the American Society of Plastic Surgeons 2015 Meeting in Boston, MA, Friday, October 16 -- Tuesday, October 20. \nNextech will showcase its fully integrated EMR and Practice Management software and many of their cutting-edge technologies. Additionally, Nextech will be unveiling enhancements to its iPad application and debuting the brand-new Analytics module that will equip Plastic Surgeons with an instant visual dashboard of the health of their practice while consolidating hundreds of reports into a few snapshots. \n\"The latest product enhancements further prove our commitment to providing Plastic Surgeons with the premier plastic surgery software,\" said Christina Majeed, chief product officer at Nextech. \"Our Analytics technology will empower greater visualization of the health of the practice and driver better decision making to maximize patient retention and profitability.\" \nMore than 60 percent of Plastic Surgeons start their day with Nextech and users can begin their day in the Nextech booth by attending Coffee Talks at 9:30 a.m. on October 17 and October 18, where they can exchange usability ideas and tips with each other. \n\"Nextech has integrated our office operations and increased our efficiency to grow our practice,\" said Dr. Frank Lista of The Plastic Surgery Clinic. \nFor a live demonstration of Nextech's market leading plastic surgery software and its latest innovations click here or visit Nextech at ASPS The Meeting 2015 at Booth #541. \nAbout Nextech \nNextech deploys specialty-focused, intelligent, all-in-one electronic medical records and practice management software and services for physician practices. In 2013, Nextech acquired MDIntelleSys, the cloud-based solution provider of Intellechart. Dedicated to specialty providers since 1997, Nextech delivers consultative guidance, professional services and innovative tools that enable clients to increase efficiencies while meeting their long-term business goals. The company's combined portfolio integrates seamlessly with value-added modules to create a single, intelligent, intuitive platform that streamlines clinical, administrative, financial and marketing workflows. To learn how Nextech's advanced offerings help specialty providers succeed in a fast-changing healthcare environment, visit www.nextech.com . Contact:", "external_links": [], "published": "2015-10-16T23:01:00.000+03:00", "crawled": "2015-10-17T00:51:08.206+03:00", "highlightTitle": ""}