{"organizations": [], "uuid": "a0ef5dbcd9a4fcf8ea2646824f9f631f2fba4720", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.porttechnology.org", "main_image": "https://www.porttechnology.org/images/made/images/uploads/news/gold_oil_275_220.jpg", "site_section": "http://www.porttechnology.org/rss_feeds/news/", "section_title": "Port Technology International - News", "url": "http://www.porttechnology.org/news/big_rise_as_rotterdam_strikes_oil/", "country": "GB", "title": "Big Rise as Rotterdam Strikes Oil", "performance_score": 0, "site": "porttechnology.org", "participants_count": 0, "title_full": "Big Rise as Rotterdam Strikes Oil", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T12:16:00.000+03:00", "replies_count": 0, "uuid": "a0ef5dbcd9a4fcf8ea2646824f9f631f2fba4720"}, "author": "", "url": "http://www.porttechnology.org/news/big_rise_as_rotterdam_strikes_oil/", "ord_in_thread": 0, "title": "Big Rise as Rotterdam Strikes Oil", "locations": ["Rotterdam"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bollard Load Testing Big Rise as Rotterdam Strikes Oil 15 Oct 2015 Cargo Volumes and Throughput , Container Handling , Global Economy/Trade , Going Places , Mega Ship Ready , Port Governance , Port Planning , Ports , Shipping The handling of goods at the Port of Rotterdam increased by 5.4% in the first nine months of 2015, with the growth largely attributed to oil products. \nAllard Castelein, CEO Port of Rotterdam Authority, said: \"The growth is almost entirely due to the increase in the handling of crude oil and oil products. Most other types of goods were handled in similar quantities as last year. \n“Since oil represents about half of the throughput, the port achieved a good growth rate. Dry bulk is usually a fairly stable industry, but currently the handling of iron ore and agri-bulk is lagging behind somewhat. \n“In the container sector, growth opportunities are currently still limited because the new terminals are not yet operating at full speed.\" \nRead a Technical Paper written by the Port of Rotterdam on its operational philosophy and how it’s a ‘port of pioneers’ \nThe throughput of crude oil increased by 8.5% in the first nine months of 2015, the main reason is most likely the low price of oil, which ensures good margins as a result of which refineries are processing more crude oil than in 2014. \nThe handling of containers in the first nine months of 2015 has also risen; figures show a 1.0% increase on 2014. \nRotterdam’s new flagship terminals Maasvlakte II has not yet operating hit its full potential quite yet, although records have been broken there recently , signalling an auspicious future for the APMT terminal. \nWithin Rotterdam’s container sector, it is mainly the short sea traffic to the British Isles that has witnessed increases due to a strong UK economy. \nThe news comes shortly after the Port of Antwerp stated it had witnessed a freight surge in the first nine months of 2015 also, potentially signifying a rejuvenated European economy. /exp:pti_find_replace}", "external_links": [], "published": "2015-10-15T12:16:00.000+03:00", "crawled": "2015-10-15T16:54:34.444+03:00", "highlightTitle": ""}