{"organizations": ["NSA", "Wikimedia"], "uuid": "0fc8065b12af2f2127ae68b80b05f4a8b6f8707d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://feeds.reuters.com/reuters/technologysectorNews\r", "section_title": "Reuters: Technology", "url": "http://www.reuters.com/article/2015/10/24/usa-nsa-wikipedia-idUSL1N12O0FM20151024?feedType=RSS&feedName=technologySector", "country": "US", "title": "Judge dismisses Wikimedia lawsuit over NSA surveillance - report", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "Judge dismisses Wikimedia lawsuit over NSA surveillance - report", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T21:40:00.000+03:00", "replies_count": 0, "uuid": "0fc8065b12af2f2127ae68b80b05f4a8b6f8707d"}, "author": "", "url": "http://www.reuters.com/article/2015/10/24/usa-nsa-wikipedia-idUSL1N12O0FM20151024?feedType=RSS&feedName=technologySector", "ord_in_thread": 0, "title": "Judge dismisses Wikimedia lawsuit over NSA surveillance - report", "locations": ["WASHINGTON"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Judge dismisses Wikimedia lawsuit over NSA surveillance - report WASHINGTON \nWASHINGTON Oct 24 A federal judge has dismissed a lawsuit by Wikimedia and other groups challenging one of the U.S. National Security Agency's mass surveillance programs, the Baltimore Sun reported. \nThe newspaper said Judge T.S. Ellis III on Friday dismissed the suit filed in March over what is often called \"upstream\" collection because it happens along the so-called backbone of the Internet and away from individual users. \nThe lawsuit filed in federal court in Maryland, where the spy agency is based, said the NSA is violating U.S. constitutional protections and the law by tapping into high-capacity cables, switches and routers that move Internet traffic through the United States. \nThe case is one of a number of challenges made by privacy advocates against U.S. spying programs since 2013, when documents leaked by former NSA contractor Edward Snowden revealed the long reach of secret government surveillance. \nThe judge \"concluded that the plaintiffs had to speculate about key elements of the spy system. So under a 2013 Supreme Court ruling on a similar challenge, he wrote, their case could not go forward,\" the Sun said. \n\"Plaintiffs provide no factual basis to support the allegation that the NSA is using its surveillance equipment at full throttle,\" Ellis wrote, according to the newspaper. \nThe plaintiffs include the Wikimedia Foundation, which runs the online encyclopedia Wikipedia; the conservative Rutherford Institute; Amnesty International USA and the National Association of Criminal Defense Lawyers, among other groups. \nThe groups said in the lawsuit that upstream surveillance \"reduces the likelihood\" that clients, journalists, foreign government officials, victims of human rights abuses and other individuals will share sensitive information with them. \nThe American Civil Liberties Union, which represented the plaintiffs, said it is considering an appeal, the paper said. \n\"The decision turns a blind eye to the fact that the government is tapping into the Internet's backbone to spy on millions of Americans,\" it quoted ACLU lawyer Patrick Toomey as saying in a statement. \"The dismissal of the lawsuit's claims as 'speculative' is at odds with an overwhelming public record of warrantless surveillance.\" (Reporting by Mohammad Zargham ; Editing by Marguerita Choy) Trending On Reuters", "external_links": [], "published": "2015-10-24T21:40:00.000+03:00", "crawled": "2015-10-25T00:36:06.753+03:00", "highlightTitle": ""}