{"organizations": [], "uuid": "faa77081d32058165f60e675c20c6c8cd8604d41", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1141539/iot-developer-loopd-wins-global-event-technology-competition", "country": "US", "title": "IoT Developer Loopd Wins Global Event Technology Competition", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "IoT Developer Loopd Wins Global Event Technology Competition", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:05:00.000+03:00", "replies_count": 0, "uuid": "faa77081d32058165f60e675c20c6c8cd8604d41"}, "author": "admin", "url": "http://www.freshnews.com/news/1141539/iot-developer-loopd-wins-global-event-technology-competition", "ord_in_thread": 0, "title": "IoT Developer Loopd Wins Global Event Technology Competition", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Submitted by admin on 10/15/2015 @ 5:05 PM   Loopd Inc. \nLAS VEGAS, Oct. 15, 2015 /PRNewswire/ -- San Francisco-based Loopd has been voted as the winner of the #IMEXpitch competition, the second annual showcase of up-and-coming events technology companies held at IMEX America this week. \nhttp://photos.prnewswire.com/prnvar/20150222/176970LOGO \nThe corporate events-focused company helps executive attendees to exchange valuable contact information and content, and organizers to gather rich engagement and marketing data through a wearable badge and app. \nUsing Bluetooth Low Energy wireless technology, it also works independently of Wi-Fi availability, a major factor cited as a key differentiator by a distinguished panel of judges who are all event technology industry experts. Each finalist in this techno 'battle of the bands' vied for victory by delivering a live pitch to the judges and an audience of more than 60 attendees at the show's Inspiration Hub. \nShortly after winning the IMEX competition, Loopd released its new website at www.loopd.com , which addresses specifically how Loopd has optimized its Bluetooth badge, app, and Cloud-based relational analytics for the corporate events environment. \n\"I'm really excited to win the #IMEXpitch,\" said Loopd CEO Brian Friedman. \"Engagement is getting a lot of attention at IMEX America, and that's really good to see and hear.\" \n#IMEXpitch enables event technology start-ups to showcase their products at no cost to an audience of event professionals while giving IMEX America attendees the opportunity to learn about new event technology products. Following its successful launch last year, the competition attracted crowds of people keen to discover the technology hotshots of the future. \nThe panel of judges included: Greg Bogue of Maritz Travel; Brandt Krueger of brandtkrueger.com; James Morgan PhD, CSEP Event Tech Lab; Julius Solaris, Event MB and IMEX Group's Miguel Neves, CMP. \nJulius Solaris commented, \"The attention on event technology in the industry is unprecedented. Our commitment at EventMB is to foster innovation and give a chance to innovative start-ups to showcase their technology. The role that IMEX has in giving such a platform for recognition is inspiring. IMEXpitch has become the de facto event to learn about innovation in the industry.\" \nPhotos of Loopd CEO Brian Friedman (second from the left), with the judges can be found at: \nhttp://photos.imexexhibitions.com/IMEXAmerica2015/i-7RgrM6w/0/O/_UPA4974.jpg \nAbout Loopd Inc. \nLoopd Inc. provides physical intelligence to corporate events. We help corporate marketers learn how people interact with each other, with the company, and with the company's products. The Loopd relational analytics solution is the industry's only bi-directional solution that enables the exchange of content and contact information automatically. It gathers rich data so that marketers have a more sophisticated understanding of their most valuable business relationships. Headquartered in San Francisco, Loopd has raised $2.5 million in seed investment from Marc Benioff (founder of Salesforce), Tim Draper (founding partner of DFJ Ventures) and others. Our first customers include Box, Xero, Panasonic, fi360 and Systemax. To learn more, visit www.loopd.com . \nAbout IMEX America \nIMEX America is a worldwide exhibition for incentive, meetings and events held annually. The fifth annual American event was held in Las Vegas, Oct. 13 thru 15. A total of 3,100 companies representing 150 countries exhibited, including 80 new booths and 56 expanded booths, while the IMEX hosted buyer program brought a record 3,000 buyers from 54 countries to the show. Over 10,600 people participated in the event. There were 66,000 business appointments of which over 57,000 were one-to-one appointments and booth presentations. To learn more, visit www.imexamerica.com \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/iot-developer-loopd-wins-global-event-technology-competition-300160981.html \nSOURCE Loopd Inc.", "external_links": [], "published": "2015-10-16T03:05:00.000+03:00", "crawled": "2015-10-16T06:16:08.687+03:00", "highlightTitle": ""}