{"organizations": ["IBM", "Million Technology Services"], "uuid": "95453658f6aaaa5c914be4b7bccaf1b851bef8be", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tmcnet.com", "main_image": "", "site_section": "http://rss.tmcnet.com/rss/information%20technology", "section_title": "TMCnet.com RSS Service: information technology", "url": "http://www.tmcnet.com/usubmit/2015/10/13/8259925.htm", "country": "US", "title": "Etihad Airways Signs US$700 Million Technology Services, Cloud Collaboration with IBM to Transform Global Operations", "performance_score": 0, "site": "tmcnet.com", "participants_count": 0, "title_full": "Etihad Airways Signs US$700 Million Technology Services, Cloud Collaboration with IBM to Transform Global Operations", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T12:58:00.000+03:00", "replies_count": 0, "uuid": "95453658f6aaaa5c914be4b7bccaf1b851bef8be"}, "author": "", "url": "http://www.tmcnet.com/usubmit/2015/10/13/8259925.htm", "ord_in_thread": 0, "title": "Etihad Airways Signs US$700 Million Technology Services, Cloud Collaboration with IBM to Transform Global Operations", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "[October 13, 2015] Etihad Airways Signs US$700 Million Technology Services, Cloud Collaboration with IBM to Transform Global Operations \nABU DHABI, United Arab Emirates and ARMONK, N.Y. , Oct. 13, 2015 /PRNewswire/ -- Etihad Airways and IBM (NYSE: IBM ) today announced a ten-year technology services agreement worth approximately US$700 million . This will allow the airline to enhance guest experience, develop world-class infrastructure and security, and improve efficiency. \nThe transformational agreement, one of the most important strategic collaborations by Etihad Airways, will provide access to the latest cloud-based technologies and services for the airline, its group companies and equity partners. Etihad Airways, one of the fastest-growing airlines in the world, carried 14.8 million passengers in 2014, and serves 113 passenger and cargo destinations. \nIBM will deliver a range of secure and efficient technology services, allowing Etihad Airways and its partners to transform their IT infrastructure into global, flexible and agile cloud-based platforms to better serve their guests and employees. \nThe agreement includes plans for the creation of a new cloud data center in Abu Dhabi . The center, to be developed and operated by IBM, will be one of the most sophisticated technology facilities in the Middle East . \nJames Hogan , Etihad Airways' President and Chief Executive Officer, said: \"This is a long-term, strategic partnership which will allow Etihad Airways and its partners to harness the latest technologies as we deliver our award-winning services. This is a game-changing agreement for Etihad Airways, for our partners and employees, and for Abu Dhabi .\" \nIBM was selected due its global reach, its experience and alignment with Etihad Airways' technology and innovation strategy of deploying cloud-first initiatives to simplify its technology systems, while offering greater capabilities for lower operational costs. The cloud, analytics, mobile, security and cognitive technologies will drive increased efficiencies and effectiveness for all Etihad Airways businesses, as well as for the Etihad Airways Partners. \nThrough IBM's mobile solutions, developed under the Apple-IBM alliance, the airline will provide enhanced mobile capabilities to its employees and guests. Other solutions will enable airport operations to run more efficiently, which will improve the guest experience as a result of an enhanced end-to-end process. \nIBM and Etihad Airways will create a joint technology and innovation council in Abu Dhabi to develop more personalised travel solutions using IBM's global research capabilities and the airline's industry expertise. The council will focus on value creation for Etihad Airways and its guests, as well as bringing technological innovation and benefits to Abu Dhabi and its people. \nRobert Webb , Etihad Airways' Chief Information and Technology Officer, said: \"This landmark agreement, a fundamental part of our technology and innovation strategy, will bring us a global IT delivery platform that is secure, resilient and future-ready for Etihad Airways' companies and equity partner airlines. \n\"We have chosen IBM as a global technology partner due to its commitment to its people, its experience in delivering such transformations, and its history of leadership and innovation in the airline industry. We are confident that this collaboration will ultimately enhance our guest experience and reinforce our competitive position further within the industry.\" \nMartin Jetter , Senior Vice President, IBM Global Technology Services, said: \"By partnering with IBM in this transformation journey, Etihad Airways is accelerating the move to new technologies such as cloud computing and cognitive. These technologies will help the airline to improve efficiencies and achieve its ambitious growth plans as a globally integrated aviation group.\" \nEtihad Airways' current data center, IT infrastructure, applications and security operations will be migrated to the new data center in Abu Dhabi , and disaster recovery will be managed at an IBM Cloud data center in Europe . This approach will allow the airline to scale and manage its IT resources more efficiently, while ensuring business continuity. \nAs part of the agreement, around 100 Etihad Airways information technology employees will transition to IBM, where they will have access to further IT skills development opportunities. IBM will manage the entire data center operation, including individual infrastructure services and IT helpdesk for Etihad Airways. \nThe collaboration provides a global framework for technology service delivery for Etihad Airways and its Etihad Airways Partner airlines, including Alitalia, airberlin, Jet Airways, Air Serbia, Air Seychelles and Etihad Regional. \nThe agreement was signed at the end of September 2015 . \nAbout Etihad Airways \nEtihad Airways began operations in 2003, and in 2014 carried 14.8 million passengers. From its Abu Dhabi base, Etihad Airways flies to or has announced plans to serve 113 passenger and cargo destinations in the Middle East , Africa , Europe , Asia , Australia and the Americas. The airline has a fleet of 119 Airbus and Boeing aircraft, and more than 200 aircraft on firm order, including 66 Boeing 787s, 25 Boeing 777-X, 62 Airbus A350s and six Airbus A380s. \nEtihad Airways holds equity investments in airberlin, Air Serbia, Air Seychelles, Alitalia, Jet Airways, Virgin Australia, and Swiss-based Darwin Airline, trading as Etihad Regional. Etihad Airways, along with airberlin, Air Serbia, Air Seychelles, Alitalia, Etihad Regional, Jet Airways and NIKI, also participate in Etihad Airways Partners, a new brand that brings together like-minded airlines to offer customers more choice through improved networks and schedules and enhanced frequent flyer benefits. For more information, please visit: www.etihad.com \nAbout IBM: \nFor more information about IBM Infrastructure Services, visit: ibm.com/services \nFor more information contact:", "external_links": [], "published": "2015-10-13T12:58:00.000+03:00", "crawled": "2015-10-14T01:17:26.834+03:00", "highlightTitle": ""}