{"organizations": ["Facebook & Twitter", "The Home Depot", "Securities and Exchange Commission"], "uuid": "fb0d8a16fd30a07f77e71ec3ce8a149b282cfd4e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "science-technology.news-articles.net", "main_image": "", "site_section": "http://science-technology.news-articles.net/content/rss.php", "section_title": "Science and Technology @ News Articles Network", "url": "http://science-technology.news-articles.net/content/solarcity-awarded-home-depots-environmental-partner-the-year-award.xhtml", "country": "US", "title": "SolarCity Awarded Home Depot's Environmental Partner of the Year Award", "performance_score": 0, "site": "news-articles.net", "participants_count": 0, "title_full": "SolarCity Awarded Home Depot's Environmental Partner of the Year Award", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T19:16:00.000+03:00", "replies_count": 0, "uuid": "fb0d8a16fd30a07f77e71ec3ce8a149b282cfd4e"}, "author": "", "url": "http://science-technology.news-articles.net/content/solarcity-awarded-home-depots-environmental-partner-the-year-award.xhtml", "ord_in_thread": 0, "title": "SolarCity Awarded Home Depot's Environmental Partner of the Year Award", "locations": ["America", "Calif", "SAN MATEO"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ron Jarvis", "Lyndon Rive"], "text": "SolarCity Awarded Home Depot's Environmental Partner of the Year Award   Published on 2015-10-15 07:30:24 SolarCity Awarded Home Depot's Environmental Partner of the Year Award -- SAN MATEO, Calif.   > SAN MATEO, Calif.   SolarCity® (NASDAQ: SCTY ), America's #1 solar power provider, has won The Home Depot's 2015 Environmental Partner of the Year Award. Since 2013, SolarCity has partnered with Home Depot to help customers go solar and save money and energy. Under the partnership, SolarCity consultants in Home Depot stores across the nation explain how homeowners can take control of their energy costs. \"SolarCity's partnership with Home Depot has helped consumers understand the process and full benefit of going solar, and provided an outstanding business opportunity,\" said SolarCity CEO Lyndon Rive . \"We are honored to receive this award and look forward to raising even greater awareness of the environmental and economic value of home solar power.\" \"The Home Depot is actively involved in pursing environmental excellence through our stores and our vendors,\" said Ron Jarvis , Vice President Environmental, The Home Depot. \"SolarCity partnered with Home Depot early on to ensure we are a leader in the residential solar marketplace.\" The honor was one of the Home Depot's top three annual Innovations Awards, which recognizes the most revolutionary new products and services that provide true benefits to consumers and the companies that exceeded expectations in sales, service and program execution. SolarCity allows homeowners to go solar with no upfront cost and pay less for electricity than they pay for utility power, with installation, production guarantee, monitoring and repair service included at no additional cost. For more information about SolarCity Services go to www.solarcity.com . About SolarCity SolarCity® (NASDAQ: SCTY ) provides clean energy. The company has disrupted the century-old energy industry by providing renewable electricity directly to homeowners, businesses and government organizations for less than they spend on utility bills. SolarCity gives customers control of their energy costs to protect them from rising rates. The company makes solar energy easy by taking care of everything from design and permitting to monitoring and maintenance. Visit the company online at www.solarcity.com and follow the company on Facebook & Twitter . This release contains forward-looking statements including, but not limited to, statements regarding cost savings. Forward-looking statements should not be read as a guarantee of future performance or results, and will not necessarily be accurate indications of the times at, or by, which such performance or results will be achieved, if at all. Forward-looking statements are subject to risks and uncertainties that could cause actual performance or results to differ materially from those expressed in or suggested by the forward looking statements. You should read the section entitled \"Risk Factors\" in SolarCity's quarterly report on Form 10-Q, which has been filed with the Securities and Exchange Commission and identifies certain of these and additional risks and uncertainties. We do not undertake any obligation to publicly update or revise any forward-looking statement, whether as a result of new information, future developments or otherwise.", "external_links": [], "published": "2015-10-15T19:16:00.000+03:00", "crawled": "2015-10-15T19:02:32.641+03:00", "highlightTitle": ""}