{"organizations": [], "uuid": "4b1fd2730289ca9e459f5bc320ba4116f2db1f03", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mirror.co.uk", "main_image": "http://i1.mirror.co.uk/news/technology-science/technology/article6692216.ece/ALTERNATES/s1200/illustartoin-main.jpg", "site_section": "http://www.mirror.co.uk/news/technology-science/", "section_title": "Technology &amp; Science: news, rumours &amp; reviews - Mirror Online", "url": "http://www.mirror.co.uk/news/technology-science/technology/revealed-americas-top-secret-plans-6692031", "country": "US", "title": "Revealed: America's top secret plans to put a manned spy base in space", "performance_score": 0, "site": "mirror.co.uk", "participants_count": 1, "title_full": "Revealed: America's top secret plans to put a manned spy base in space - Mirror Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T01:49:00.000+03:00", "replies_count": 0, "uuid": "4b1fd2730289ca9e459f5bc320ba4116f2db1f03"}, "author": "Jasper Hamill", "url": "http://www.mirror.co.uk/news/technology-science/technology/revealed-americas-top-secret-plans-6692031", "ord_in_thread": 0, "title": "Revealed: America's top secret plans to put a manned spy base in space", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "America's plans to put a manned spy satellite in space have been laid bare in an astonishing declassified cache of images, films and documents.\nDating back to the heyday of the 1960s space race, the top secret files demonstrate the claustrophobic conditions eagle-eyed astronauts would have endured whilst carrying out their Cold War surveillance mission.\nAlthough the top secret project was called the Manned Orbiting Laboratory , it was an attempt to use humans to carry out the sort of spy campaigns primitive computers could not have managed at that stage of technological evolution.\nHuman spies would have have used the craft to take photographs of enemy targets, with particular attention paid to Soviet Russia.\nDetails of this classified mission have leaked out ever since, but the new information is perhaps the most significant insight into the mysterious orbital surveillance base.\nFloating in a tin can: This would not have been a comfortable home\nThe scheme was launched by the US Airforce and ran for more than five years, racking up costs of $1.56 billion before it was scrapped in 1969.\n\"The actual, classified, mission of the MOL program was to place a manned surveillance satellite into orbit,\" wrote the National Reconnaissance Office, who released the images, pictures and film today.\nSpaceman: Spies would have lived in orbit for long stretches of time\n\"At the time, several military and contractor studies estimated that manned surveillance satellites could acquire photographic coverage of the Soviet Union with resolution better than the best system at the time.\n\"Additionally, the Air Force billed the MOL as a reconnaissance system that could more efficiently and quickly adjust coverage for crises and targets of opportunity than unmanned systems.\"\nSpace age: The photographs have a distinctly retro feel\nA huge number of top secrets documents have also been declassified, although they are heavily redacted.\nThese include details of the \"candidate experiments\" to find people capable of enduring long periods orbiting Earth in a giant tin can.\nIn a document likely to drive conspiracy theorists wild, it was also revealed that Easter Island would due to be used as a staging post for test flights of the craft carrying the MOL , providing a suitably eerie and mysterious setting for a very secret mission.\nThe US Airforce started work on the orbiting spy base in 1963 and continued throughout the decade.\nMen's room: This would not have been a nice place following a long mission However, by 1969 the Vietnam War and the Apollo moon mission program were seen as more of a budgetary priority.\nWork on the project was abandoned and Russia became the first nation to put a non-secret base in space in 1971.\nThe Salyut 1 spent a total of 175 days in orbit and a crew spent 23 days aboard it, before dying during the perilous journey back to Earth.\nPoll loading …\nDailyMirror\n<div", "external_links": ["http://www.nro.gov/foia/declass/MOL.html", "https://www.facebook.com/DailyMirror", "http://www.nro.gov/foia/declass/mol/305.pdf", "https://twitter.com/MirrorTech", "https://plus.google.com/u/0/+Mirror/posts", "https://twitter.com/jasperhamill", "https://www.facebook.com/MirrorSciTech"], "published": "2015-10-24T01:49:00.000+03:00", "crawled": "2015-10-24T05:17:51.026+03:00", "highlightTitle": ""}