{"organizations": [], "uuid": "07aeb497a45d6ee8bb4769dcffaa6d32ce74cfd7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1135759/rapiscan-scores-victory-court", "country": "US", "title": "Rapiscan Scores Victory in Court", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "Rapiscan Scores Victory in Court", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T22:32:00.000+03:00", "replies_count": 0, "uuid": "07aeb497a45d6ee8bb4769dcffaa6d32ce74cfd7"}, "author": "admin", "url": "http://www.freshnews.com/news/1135759/rapiscan-scores-victory-court", "ord_in_thread": 0, "title": "Rapiscan Scores Victory in Court", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Companies mentioned in this article: Rapiscan Systems Ltd. \nTORRANCE, Calif. -- (BUSINESS WIRE) -- Rapiscan Systems Ltd. has announced that, in the High Court of Justice in London, American Science & Engineering, Inc. (AS&E) has discontinued its patent infringement case as the case relates to the Rapiscan RXV Reflexion Vehicle (RXV). AS&E had brought suit claiming infringement of a UK patent, but discontinued its case against the RXV on the basis of a description of the RXV and the way in which it works. \nWith the discontinuation of its case against the RXV, Rapiscan reports that AS&E’s case is now reduced to allegations of infringement that are apparently directed against a historical non-working prototype that was never completed and never sold. \nThe RXV is a rapid deployment mobile inspection platform that utilizes backscatter X-rays to identify certain threats and contraband items such as explosives, narcotics, stowaways, tobacco and currency. Jules Anderson, Sales Director at Rapiscan Systems Ltd., stated, “The RXV was designed to be unlike any other product of its type. We designed the RXV from the ground up to meet the needs of today’s customers, and tailored the RXV to suit modern methods of inspection.” \nAbout Rapiscan Systems \nRapiscan Systems, a division of OSI Systems, Inc., is a leading global supplier of security inspection solutions utilizing advanced threat identification techniques. The company's products are sold into the following market segments: Baggage and Parcel Inspection; Cargo and Vehicle Inspection; Hold (checked) Baggage Screening; People Screening; Explosive and Narcotics Trace Detection; and Radiation Detection. The Rapiscan Systems product lines are supported by a global service network. As the world's leading security screening provider, Rapiscan Systems provides state-of-the-art products, solutions and services to meet our customers' most demanding threat detection needs. For more information, visit www.rapiscansystems.com \nThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. Forward-looking statements relate to the Company’s current expectations, beliefs, projections and similar expressions concerning matters that are not historical facts and are not guarantees of future performance. Forward-looking statements involve uncertainties, risks, assumptions and contingencies, many of which are outside the Company’s control that may cause actual results to differ materially from those described in or implied by any forward-looking statements, including, but not limited to, statements regarding the outcome of litigation matters. All forward-looking statements are based on currently available information and speak only as of the date on which they are made. The Company assumes no obligation to update any forward-looking statement made in this press release that becomes untrue because of subsequent events, new information or otherwise, except to the extent it is required to do so in connection with its ongoing requirements under Federal securities laws. For a further discussion of these and other factors that could cause the Company’s future results to differ materially from any forward-looking statements, see the section entitled “Risk Factors” in the Annual Report of OSI Systems, Inc. on Form 10-K for the year ended June 30, 2015 and other risks described in documents filed by OSI Systems, Inc. from time to time with the U.S. Securities and Exchange Commission. View source version on businesswire.com: http://www.businesswire.com/news/home/20151002005729/en/ Copyright © Business Wire 2015 \nSpeakerBox Communications for Rapiscan SystemsJennifer Edgerly, 703-287-7809", "external_links": [], "published": "2015-10-02T22:32:00.000+03:00", "crawled": "2015-10-03T00:54:42.034+03:00", "highlightTitle": ""}