{"organizations": ["OSIA", "Olympus"], "uuid": "cb6a8e0df2e30cc4b78eaa0433b11611411a4b69", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.azosensors.com", "main_image": "", "site_section": "http://www.azosensors.com/syndication.axd", "section_title": "AZoSensors.com - Sensors and Sensing Technology News Feed", "url": "http://www.azosensors.com/News.aspx?newsID=10342", "country": "US", "title": "Olympus introduces 4K UHD to microscopy with its UC90 microscope camera", "performance_score": 0, "site": "azosensors.com", "participants_count": 0, "title_full": "Olympus introduces 4K UHD to microscopy with its UC90 microscope camera", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T15:11:00.000+03:00", "replies_count": 0, "uuid": "cb6a8e0df2e30cc4b78eaa0433b11611411a4b69"}, "author": "", "url": "http://www.azosensors.com/News.aspx?newsID=10342", "ord_in_thread": 0, "title": "Olympus introduces 4K UHD to microscopy with its UC90 microscope camera", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Olympus introduces 4K UHD to microscopy with its UC90 microscope camera   21, 2015 at 8:11 AM The new noise-free UC90 microscope camera from Olympus features a large Field-of-View 9 megapixel CCD sensor, creating highly detailed images for on-screen evaluation and discussions with unprecedented clarity. The UC90 Microscope Camera Maximising the information captured from life and materials science samples is now possible with ease and simplicity, with the new Olympus UC90 microscope camera. Thanks to a range of innovative features, the UC90 excels in capturing and documenting real-life details, while a 4K UHD mode supports scientists in overcoming the limitations of the oculars with the many benefits of complete on-screen operation. In-depth sample analysis is achieved without compromise, with the 1 inch CCD colour sensor of the Olympus UC90 camera containing 9 megapixels. This not only provides a large Field of View to cover nearly all the sample area normally observed through the oculars, but the high resolution in combination with perfect colour reproduction also retains the sample’s every detail. Without the need to switch objectives to capture large sample structures, operation at the monitor is fast and efficient, allowing the quick creation of fully detailed images that are ideal for documentation and accurate retrospective analysis. Stepping into the digital future, these high-quality images can now be clearly observed on-screen thanks to the new 4K UHD imaging mode, ensuring compatibility with 4K UHD monitors, large-screen TVs and projectors. Presenting large, detailed images vastly improves sharing and discussions, and lessens the need to verify observations on the oculars. Fast frame rates (26 fps) at 4K UHD resolution also allows fluid and accurate on-screen evaluation and clear presentations, in some cases even highlighting details missed through the oculars. These advanced capabilities are complemented by ease of use and convenience. For example, simplifying the acquisition of sharp images, Focus Peaking directly highlights all focussed areas in the live image, while Olympus Smart Image Averaging (OSIA) cancels noise in low light conditions or high zoom levels and avoids trailing artefacts during sample movement. Unlike active sensor cooling, which only becomes evident under low light conditions and long exposure times, OSIA benefits normal everyday working conditions. In addition, panning and focusing on-screen are easier than ever before with “Fast Live” mode. In contrast to conventional cameras, which can show a ‘choppy’ and slow live image, this mode keeps the live image fast and fluid under the most challenging imaging conditions. Merging quality with convenience, the UC90 makes it easier than ever to acquire accurate and detailed images throughout life and materials science, with its 4K UHD capabilities providing the next step in digital microscopy.", "external_links": [], "published": "2015-10-21T15:11:00.000+03:00", "crawled": "2015-10-21T17:16:44.406+03:00", "highlightTitle": ""}