{"organizations": [], "uuid": "59970ed9963551b01df22d92ae5c86bc17575450", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chemicals-technology.com", "main_image": "", "site_section": "http://www.chemicals-technology.com/feeds/site-feed.xml", "section_title": "Chemicals Technology-Updates", "url": "http://www.chemicals-technology.com/news/newscelanese-starts-production-at-methanol-plant-in-texas-4696884", "country": "", "title": "Celanese starts production at methanol plant in Texas", "performance_score": 0, "site": "chemicals-technology.com", "participants_count": 0, "title_full": "Celanese starts production at methanol plant in Texas", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T02:00:00.000+03:00", "replies_count": 0, "uuid": "59970ed9963551b01df22d92ae5c86bc17575450"}, "author": "", "url": "http://www.chemicals-technology.com/news/newscelanese-starts-production-at-methanol-plant-in-texas-4696884", "ord_in_thread": 0, "title": "Celanese starts production at methanol plant in Texas", "locations": ["Texas"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Celanese starts production at methanol plant in Texas 19 October 2015 \nUS-based specialty materials company Celanese has completed construction of its Clear Lake, Texas, methanol unit, and is now operating at full capacity. \nThis new plant is a joint-venture between Celanese and Japanese company Mitsui, and was built at an investment of around $800m. \nApart from the existing plant located at Clear Lake, Celanese has invested around $300m in the expansion activities. \"By leveraging our existing infrastructure and executing a very aggressive project plan, we were able to complete the methanol unit in 19 months.\" \nThe Clear Lake facility has an annual production capacity of 1.3 million tonnes. \nCelanese chairman and chief executive officer Mark Rohr said: \"This investment provides us with supply certainty for a critical raw material and allows the Acetyl Chain to gain the economic benefit of abundant low-cost US natural gas. \n\"By leveraging our existing infrastructure and executing a very aggressive project plan, we were able to complete the methanol unit in 19 months and have it fully operational in 21 months, with a capital cost of less than $700 per tonne. \nLast May, Celanese and Mitsui announced a methanol production joint-venture in Texas. \nThe unit will use abundant, low-cost natural gas in the US gulf coast region as a feedstock, and the existing infrastructure at Celanese's Clear Lake facility will be upgraded for the purpose. \nMitsui chief executive officer and president Masami Iijima said: \"Mitsui will be able to generate additional value in the gas product chain starting from our shale gas reserve we possess in the US to methanol with Celanese's state-of-the-art capabilities in manufacturing, operations and safety. \n\"This partnership should be long-term and be expanded towards further joint projects in the future.\" Follow Us:", "external_links": [], "published": "2015-10-19T02:00:00.000+03:00", "crawled": "2015-10-19T16:05:26.054+03:00", "highlightTitle": ""}