{"organizations": [], "uuid": "7e1788267095f2714d4e1e50c7306c3e9c08a5f7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prnewswire.com", "main_image": "http://content.prnewswire.com/designimages/logo-prn-01_PRN.gif", "site_section": "http://rss.prnewswire.com/industry/technology/", "section_title": "PR Newswire: Business Technology", "url": "http://www.prnewswire.com/news-releases/azumio-takes-the-guesswork-out-of-weight-management-with-a-new-food-calorie-counter-300162781.html", "country": "IT", "title": "Azumio Takes the Guesswork out of Weight Management with a", "performance_score": 0, "site": "prnewswire.com", "participants_count": 1, "title_full": "Azumio Takes the Guesswork out of Weight Management with a", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T17:05:00.000+03:00", "replies_count": 0, "uuid": "7e1788267095f2714d4e1e50c7306c3e9c08a5f7"}, "author": "Azumio", "url": "http://www.prnewswire.com/news-releases/azumio-takes-the-guesswork-out-of-weight-management-with-a-new-food-calorie-counter-300162781.html", "ord_in_thread": 0, "title": "Azumio Takes the Guesswork out of Weight Management with a", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "PALO ALTO, Calif. , Oct.   Azumio today introduced a new food calorie counter and proprietary food database into Argus , the company's all-in-one health and fitness platform on mobile and web. These new features are essential to the weight management program that helps users achieve and maintain their ideal weight. Users simply enter their information and target weight into Argus , which calculates a daily calorie budget based on metabolic rates and lifestyle. The daily calorie budget is dynamically updated whereas consumed food is subtracted and GPS-tracked activities and video guided workouts are incorporated in real-time. This daily calorie budget, along with other health and activity information, is displayed inside the beautifully designed UI to help users stay informed and on target. Users can log food by searching Argus' proprietary food database or by scanning barcodes. This highly accurate, verified and independently sourced food database includes menu items from popular restaurant chains and allows users to create and save custom foods and recipes. In addition to tracking calories, Argus also records macronutrients enabling users to focus on the quantity and quality of the food they eat. Furthermore, Argus allows users to complement the food calorie counter with visual information by snapping photos of their meal, tagging restaurants and adding food groups.   \nVideo guided workouts, step counter, and more than 30 GPS trackable activities are calculated into users' daily calorie budget within the new calorie counter. This creates a simple and more accurate weight management system based on your diet and activities.\n\"Current calorie counters are incomplete and hopelessly impersonal,\" says Azumio's Chief Product Officer Tom Xu . \" Argus takes weight management to a whole new level, encouraging people to do more and sharing achievements within a vibrant healthy global community of Argonauts\".\nBy using advanced sensor technologies on your smartphone, Argus is the only all-in-one mobile platform that provides a holistic picture of a user's lifestyle. Weight management programs and the new food calorie counter leverages all key features of Argus - GPS activity and sleep tracking, biofeedback data like heart rate, stress and orthostatic test, new food database, video guided workouts, group challenges and social community dedicated to health and fitness. Argus also connects with several third party wearable devices, Withings smart scale and Apple HealthKit.\nArgus is available as a free app on App Store and Google Play . Learn more at Azumio . \nAbout Azumio\nAzumio is a leading global health company that empowers millions across the world to achieve their happiest and healthiest selves. The company has pioneered a platform of advanced mobile health and fitness apps that measure and build health insights to help people reach their goals.  A global community of millions encourage each other daily by sharing their personal activities, feats, and stories on Azumio's platform. Based in Palo Alto, California , Azumio is venture-backed by Founders Fund, Felicis Ventures, and Accel Partners. Join the community at\nwww.azumio.com .\n \n\nSOURCE Azumio\n\n\nRELATED LINKS\nhttp://www.azumio.com", "external_links": [], "published": "2015-10-20T17:05:00.000+03:00", "crawled": "2015-10-20T17:13:20.692+03:00", "highlightTitle": ""}