{"organizations": [], "uuid": "f6cb46bb9e0fdccc879fad68d539849d172223da", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/13536/technology-news", "section_title": "Technology &amp; Science News - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30207438/study-mammals-thrive-in-chernobyl-exclusion-zone", "country": "US", "title": "Study: Mammals thrive in Chernobyl exclusion zone", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Study: Mammals thrive in Chernobyl exclusion zone - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T03:00:00.000+03:00", "replies_count": 0, "uuid": "f6cb46bb9e0fdccc879fad68d539849d172223da"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30207438/study-mammals-thrive-in-chernobyl-exclusion-zone", "ord_in_thread": 0, "title": "Study: Mammals thrive in Chernobyl exclusion zone", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By KATHERINE JACOBSEN\nAssociated Press MOSCOW (AP) - Nearly 30 years after a nuclear reactor caught fire and spewed a lethal cloud of radiation, some species of mammals are thriving in the zone around the Chernobyl nuclear power plant, a new study says.\nThe study, published in the journal Current Biology, found that elk, deer, wild boar and wolves are abundant in the 2,160-square-kilometer (835-square-mile) Polesie reserve in Belarus, which was established after the 1986 disaster. More than 20,000 people once lived in what is now the reserve.\n\"We're not saying radiation is good for animals, but we are saying that human interference can be more harmful to certain animal populations than radiation,\" said Jim Smith, an environmental scientist at Britain's University of Portsmouth who led the study.\nTo track the mammals, researchers used aerial surveys and examined animal tracks in the snow.\nSmith and his team found there was no difference in the number of large mammals living in the Polesie reserve and in other Belarusian nature reserves. The prevalence of wolves is seven times higher than in nearby non-contaminated nature reserves, which Smith attributed to the lack of hunting in contaminated areas.\nBiologist Timothy Mousseau at the University of South Carolina said Smith's research presents an overly optimistic view of the situation around Chernobyl.\n\"There is no evidence to suggest this area is teeming with wildlife,\" said Mousseau, whose research has focused on how radiation has affected reptile, insect and small mammal populations. These animals have struggled to make a comeback in the wake of Chernobyl and have suffered from a range of nuclear-related diseases, according to Mousseau's research.\nThe mammals in Smith's research are constantly dispersing and have high fertility rates, factors that could also explain a robust population of certain mammal species in the Polesie nature reserve.\nThe 1986 explosion and fire sent a cloud of radiation drifting over much of Europe and forced the evacuation of tens of thousands of people. Along with the Belarusian Polesie preserve, a 2,600-square-kilometer (1,000-square-mile) \"exclusion zone\" was established in Ukraine around the plant. That zone is almost entirely abandoned except for about 200 mostly elderly people who returned to their homes. Some workers building a protective shelter around the reactor and cleaning up the waste live in the zone, but only for two weeks at a time.\n ", "external_links": [], "published": "2015-10-07T03:00:00.000+03:00", "crawled": "2015-10-08T03:30:39.190+03:00", "highlightTitle": ""}