{"organizations": [], "uuid": "74ce356de4f62f9d9e88d5f74b651d841b2c1219", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "phys.org", "main_image": "http://cdn.phys.org/newman/gfx/news/2015/carsmustbeco.jpg", "site_section": "http://www.physorg.com/xml-feed/technology-news/engineering/", "section_title": "Engineering Technology News - Engineering News, Technology News, Technology, Engineering", "url": "http://phys.org/news/2015-10-cars-considerate-driver.html", "country": "US", "title": "Cars must be considerate of the driver when talking", "performance_score": 0, "site": "phys.org", "participants_count": 0, "title_full": "Cars must be considerate of the driver when talking", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T15:50:00.000+02:00", "replies_count": 0, "uuid": "74ce356de4f62f9d9e88d5f74b651d841b2c1219"}, "author": "", "url": "http://phys.org/news/2015-10-cars-considerate-driver.html", "ord_in_thread": 0, "title": "Cars must be considerate of the driver when talking", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Cars must be considerate of the driver when talking October 26, 2015 \nSmart telephones and TVs are well-established technical gadgets in today's society. The same cannot be said about smart cars with dialogue systems that can understand you and communicate as if they were a person sitting in the seat next to you. A PhD thesis in linguistics from the University of Gothenburg presents the theory that cars should consider both the driver and the traffic situation when communicating. \nBy putting real persons in regular cars and letting them drive around in Gothenburg while talking to each other, Jessica Villing has explored how the interaction between the driver and modern in-vehicle dialogue systems, such as navigation systems, can be improved in order to reduce the driver's cognitive workload and therefore increase traffic safety . \nMost experiments of this type are conducted in simulators, where drivers are given mathematical problems to solve while driving . But since this is not how it happens in real life, Villing wanted to know how a real conversation with a passenger affects us when driving a car. \n'Humans are good at reading people they're talking to, so looking at how passengers and drivers interact provides a perfect model for tomorrow's dialogue systems,' she says. \nThe Dico project (dico is Latin for 'I speak') is a collaboration between the University of Gothenburg, Volvo, Telia Sonera and Veridict. In her research, Villing has looked specifically at how Dico can be made aware of and understand the cognitive burden imposed on a person while driving a car. As well as whether the burden can be attributed to the driving task as such or something else, like the driver's interaction with a dialogue system. \n'The theory I propose is that it should be possible to interact with a dialogue system as if it were a passenger in your car who is able to see what you see and therefore can take external factors into account when communicating. Such as keeping quiet if heavy traffic makes the driver notably stressed and having a good feel for when it is a good time to talk and give instructions.' \nThe current systems are unaware of the traffic situation and will keep talking regardless of how ready the driver is to listen. Navigation directions are blurted out with a certain frequency but should perhaps instead be given when the driver actually needs the information, which can vary depending on both traffic and the driver. \n'When driving a car, you shouldn't have to focus on anything but the actual driving task,' says Villing, who often turns off the sound of the navigation system in her own car because she feels it can be distracting. \n'I would like to do the opposite, turn off the screen and only listen to the sound, if the interaction feels natural and the information is given when I'm ready to listen.' \nVillings hopes that her study will help improve the voice control in cars by making it more intuitive and safer to use. \n'So that drivers will want to use the system and feel that it helps them, instead of forcing them to push buttons and look at a screen. This type of safety-oriented system would lead to fewer accidents,' says Villing. 3 hours ago 1 Talking while driving safest with someone who can see what you see, study finds October 8, 2014 \nA new study offers fresh insights into how talking on a cell phone or to a passenger while driving affects one's performance behind the wheel. The study used a driving simulator and videophone to assess how a driver's conversation ... Virtual driver can increase confidence in self-driving car April 23, 2015 \nSelf-driving cars are what we can all expect to see in the future. But will drivers be willing to leave control to technology? Behavioral scientist Frank Verberne at Eindhoven University of Technology (TU/e) believes a virtual ... A virtual twin: Can virtual drivers resembling the user increase trust in smart cars? May 19, 2015 \nHuman error is estimated to cause more than 90% of traffic accidents, a percentage that might be drastically reduced by the implementation of self-driving cars featuring smart systems that control most aspects of driving. ... Majority prefer driverless technology July 22, 2015 \nWhile only a small percentage of drivers say they would be completely comfortable in a driverless car, a sizable amount would have no problem as long as they retain some control, according to a University of Michigan report. Scientists discuss opportunities of autonomous driving September 22, 2015 \nProfessor Hermann Winner and Walther Wachenfeld from the Automotive Engineering research group illustrate the opportunities, risks and challenges of autonomous driving. Up to 27 seconds of inattention after talking to your car or smartphone October 22, 2015 \nIf you think it is okay to talk to your car infotainment system or smartphone while driving or even when stopped at a red light, think again. It takes up to 27 seconds to regain full attention after issuing voice commands, ... Recommended for you Digital-savvy, eco-conscious drivers targeted at Tokyo Motor Show October 26, 2015 \nToyota's three-seater exoskeleton car and an electric vehicle with touch screens that turn it into a \"digital space\" are among the concept models that will be on display at the Tokyo Motor Show this week. When self-driving cars drive the ethical questions October 24, 2015 \nDriverless cars are due to be part of day to day highway travel. Beyond their technologies and safety reports lies a newer wrinkle posed by three researchers, in the form of ethical questions which policy makers and vendors ... Shining more light on solar panels October 22, 2015 \nSolar panels are the beacon of renewable energy, yet they are not getting as much light as they could be. Joshua Pearce from Michigan Technological University and a team from Queen's University in Canada have found a way ... Finland team's collaborative device could spark farewell to PCs October 23, 2015 \nThink of PC as standing for an innovative pocket computer not personal computer. This is a made-in-Finland computing rethink called Solu, now up on Kickstarter seeking funds. Tech spats spark US fears of 'digital protectionism' October 24, 2015 \nAs American tech giants extend their global reach, fears are growing on their side of the Atlantic over trade barriers some see as \"digital protectionism.\" Consumer Reports hits reliability of 'best car' Tesla October 20, 2015 \nTwo months after the influential Consumer Reports called Tesla's Model S the best-performing car ever, it pulled back slightly Tuesday, saying the luxury electric has more than average repair issues.", "external_links": [], "published": "2015-10-26T15:50:00.000+02:00", "crawled": "2015-10-26T19:11:22.192+02:00", "highlightTitle": ""}