{"organizations": ["Power Plant Simulators for Safe Operations Today"], "uuid": "28dd28ff2363f3cd33c63f74c78bd165d601f165", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.power-technology.com", "main_image": "", "site_section": "http://www.power-technology.com/news-rss.xml", "section_title": "Power Technology-Updates", "url": "http://www.power-technology.com/contractors/training/l-3-mapps1/", "country": "", "title": "L-3 MAPPS-High-fidelity Power Plant Simulators for Safe Operations Today and Tomorrow", "performance_score": 0, "site": "power-technology.com", "participants_count": 0, "title_full": "L-3 MAPPS-High-fidelity Power Plant Simulators for Safe Operations Today and Tomorrow", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T13:46:00.000+03:00", "replies_count": 0, "uuid": "28dd28ff2363f3cd33c63f74c78bd165d601f165"}, "author": "", "url": "http://www.power-technology.com/contractors/training/l-3-mapps1/", "ord_in_thread": 0, "title": "L-3 MAPPS-High-fidelity Power Plant Simulators for Safe Operations Today and Tomorrow", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Print Email \nWhen you're looking for improving your power plant's performance and reliability, you'll want the right simulation experience to get you there. One company has the dedication to produce true-to-life power plant simulators that ensure that your personnel have the knowledge required to safely and efficiently operate your power plant. \nFor more than 40 years, L-3 MAPPS has worked with leading utilities, plant designers and research organisations to create superior training and engineering systems and has established itself as the world's pre-eminent manufacturer of power plant simulators. L-3 MAPPS is a company of people with ideas and vision, with a desire to create value through innovation and with the experience to achieve success. Doing it right \nProviding more than just training devices, L-3 MAPPS' simulator solutions - powered by the unparalleled Orchid® suite of simulation products - will elevate your operation and engineering teams to new heights in addressing plant design issues, procedural deficiencies and reliability improvements. L-3 MAPPS simulators provide superior real-world power plant training. L-3 MAPPS offers a variety of products and services, including full scope simulators, classroom simulators, engineering simulators, part-task trainers, severe accident simulation, simulator retrofits and upgrades and more. L-3 MAPPS provides everything from design to complete turnkey systems, specific components and simulator design tools as required by the customer. The company's simulators offer the highest quality in modeling fidelity and training to provide trainees and instructors with user-friendly tools for learning, operating and mastering complex power plant systems. \nThe superior training environments of L-3 MAPPS simulators provide clear advantages for obtaining operator licences / certification, optimising plant operating procedures and reducing costs. Operators trained on L-3 MAPPS simulator environments acquire the skills necessary to increase plant performance, minimise downtime and provide confident emergency response. Real-time responses to operator actions and interactive instructor controls ensure maximum training effectiveness and adaptability. \nSimulator uses include interactive team training, severe incident management, plant design testing, and start-up / shutdown optimisation. Any scenario, no matter how complex or dangerous in a real plant, can be reproduced, monitored and varied in real time, providing a highly valuable tool for training, plant engineering and emergency response. You're in control \nL-3 MAPPS' unique knowledge transfer programme allows customers to gain expertise and total confidence in the operation, modification and maintenance of the simulator, using a state-of-the-art simulation environment. Users can directly implement simulator changes to reflect plant modifications, evolve their training programmes and expand simulator use into other areas, such as engineering training and emergency response organisation training. Uses and advantages \nL-3 MAPPS provides cost-effective training for: Experienced operators and new recruits Overall plant and individual system operation and control Improving soft skills such as \"command and control,\" three-way communication, team interaction and performance in the most realistic simulator control room environment Emergency plan implementation and incident management Skilled response to equipment malfunction and plant transients I&C familiarisation through DCS and plant process computer operation \nMore benefits: Full visual implementation of whole plant simulation, allowing users to have complete control over simulated plant design in an intuitive, easy-to-use manner State-of-the-art simulation environment for development, operation and management of your simulator with a fully visual, interactive graphic user interface including control room soft panels and plant system models Operations optimisation with just-in-time training on plant start-up, shutdown and infrequently performed evolutions, etc. Fewer unplanned outages due to operator error or equipment malfunction Improved plant safety Analysis of plant response to equipment and / or instrument failure Efficient plant design planning and testing DCS and plant process computer verification and validation Ease of simulator upgrade and ability to keep current with plant Multiple configurations on one simulator Portability of simulation for classroom training Contact Details", "external_links": [], "published": "2015-10-06T13:46:00.000+03:00", "crawled": "2015-10-06T15:05:51.532+03:00", "highlightTitle": ""}