{"organizations": [], "uuid": "e6bd21f817bb56e59565b454d016365d9540a771", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.iol.co.za", "main_image": "http://www.iol.co.za/polopoly_fs/3d-teeth-beacef84-7749-11e5-b9c1-f03c48c96ac2-1.1934073!/image/1856373614.jpg_gen/derivatives/box_600/1856373614.jpg", "site_section": "http://www.iol.co.za/cmlink/scitech-technology-rss-1.847487", "section_title": "Scitech Technology RSS", "url": "http://www.iol.co.za/need-a-replacement-tooth-print-it-1.1934074", "country": "US", "title": "Need a replacement tooth? Print it", "performance_score": 0, "site": "iol.co.za", "participants_count": 0, "title_full": "Need a replacement tooth? Print it", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T12:51:00.000+03:00", "replies_count": 0, "uuid": "e6bd21f817bb56e59565b454d016365d9540a771"}, "author": "", "url": "http://www.iol.co.za/need-a-replacement-tooth-print-it-1.1934074", "ord_in_thread": 0, "title": "Need a replacement tooth? Print it", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Dominic Basulto"], "text": "Need a replacement tooth? Print it October 22 2015 at 11:51am By Dominic Basulto This dental replica was made using a 3D printer. Researchers are now working on ways to make those 3D-printed teeth resistant to bacteria. \nThe latest 3-D printing innovation could change the way you think about your annual visit to the dentist. That's because Dutch researchers at the University of Groningen are working on the creation of a 3-D-printed tooth made of an antimicrobial plastic that kills the type of bacteria responsible for tooth decay on contact. \nImagine teeth that remain white and pristine over time, without all the accumulation of bacteria that cause dental problems. While the thought of having a 3-D-printed tooth inside your mouth might not sound so great, is it really any worse than dealing with the constant toothache from a decaying tooth? \nFor the Dutch researchers, the key step in developing the bacteria-fighting tooth was being able to find the right material to put inside the 3-D printer. In this case, the researchers embedded antimicrobial quaternary ammonium salts inside existing dental resin polymers. Once this mix is put into a 3-D printer, it can be hardened with ultraviolet light and used to print out 3-D replacement teeth. \nTo test the bacteria-fighting tooth in a lab environment, the researchers coated the material with human saliva and exposed it to the bacterium that causes tooth decay. The anti-bacterial tooth killed over 99 percent of all bacteria and showed no signs of being harmful to human cells. \nHowever, there is still a long way to go before this 3-D-printing scenario becomes a reality. The Dutch 3-D-printing innovation, for example, is still not ready for clinical trials and has not yet been tested inside a human mouth. Moreover, it's not clear how the tooth might react to constant brushing and the application of something as simple as toothpaste. \nDespite these obstacles, Andreas Herrmann of the University of Groningen in the Netherlands suggests that, “It's a medical product with a foreseeable application in the near future, much less time than developing a new drug.” \nThere's room for optimism because the role of 3-D printing within the field of dentistry shows signs of taking off. In early March, 3-D printing company Stratasys unveiled a high-end dental 3-D printer, called the Objet260 Dental Selection, capable of printing out realistic teeth, gums and nerves in order to create life-like models for dental specialists. The printer uses the company's proprietary PolyJet dental materials, promising “gum-like softness and color,” a “range of natural tooth shades” and even nerve canals for dental models so realistic that practitioners can use them to model complicated dental procedures. \nYes, those are just dental models and not intended for clinical trials. However, it's hard to deny the growing role of 3-D printers in medicine and dentistry. Using 3-D printers, there are ongoing attempts to “bio-print” human bone, skin, tissue and even organs (think kidneys and livers). According to research firm IDTechEx, the dental and medical market for 3-D printers could grow in size to $867 million by 2025. \nThe bigger (albeit highly futuristic) context is that 3-D printers are leading to what can only be called a “replacement parts for humans” model. Just as cars have parts that need to be replaced after a certain number of miles, humans also have parts that need to be replaced after a certain number of years. That's especially true as people live longer than ever before. Think of 3-D-printed teeth as just small replacement parts that can be customized for your mouth. \nAt the March 2015 TED Conference in Vancouver, there was even a suggestion that the ability to 3-D-print replacement teeth within minutes - while you wait in the dentist chair - might be soon possible. Joseph DeSimone, the chief executive of the 3-D printing company Carbon3D and a professor of chemistry at the University of North Carolina at Chapel Hill, suggested in his TED Talk it might be possible to 3-D-print a tooth in less than 10 minutes. He refers to this innovation as “point-of-sale manufacturing” for dentists. \nThat's the promise, in many ways, of an exponential digital technology such as 3-D printing. As the technology improves, it's possible to see 10x, even 100x, improvements in speed. What once took hours or more, can now be accomplished within the space of a few minutes. That increase of speed, coupled with the promise of being able to make perfectly-fitted teeth that have been customized for each person's mouth, makes it almost a certainty that you might one day see a 3-D printer next to all the other tools and instruments in your dentist's office. – Washington Post", "external_links": [], "published": "2015-10-22T12:51:00.000+03:00", "crawled": "2015-10-22T13:49:33.176+03:00", "highlightTitle": ""}