{"organizations": [], "uuid": "dd79935c97092af25c614050a25dc8be3aaa9ef6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266385/technology-general", "section_title": "Technology Press Releases from PRWeb - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30301516/university-of-electro-communications-research-tuneable-electronic-characteristics-for-nanometer-sized-carbon-cages-containing-metal-atoms-known-as", "country": "US", "title": "University of Electro-Communications research: Tuneable electronic characteristics for nanometer sized carbon cages containing metal atoms known as metallofullerenes", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "University of Electro-Communications research: Tuneable electronic characteristics for nanometer sized carbon cages containing metal atoms known as metallofullerenes - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T07:11:00.000+03:00", "replies_count": 0, "uuid": "dd79935c97092af25c614050a25dc8be3aaa9ef6"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30301516/university-of-electro-communications-research-tuneable-electronic-characteristics-for-nanometer-sized-carbon-cages-containing-metal-atoms-known-as", "ord_in_thread": 0, "title": "University of Electro-Communications research: Tuneable electronic characteristics for nanometer sized carbon cages containing metal atoms known as metallofullerenes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Scientists at the University of Electro-Communications, Tokyo, report in the journal Chemistry on the development of novel tuneable metallofullerenes with potential applications in molecular electronics.\nTokyo, Japan (PRWEB UK) 20 October 2015\nPRESS RELEASE\nSource: University of Electro-Communications, Tokyo\nFor immediate release:\nUniversity of Electro-Communications, Tokyo research: Tuneable electronic characteristics for nanometer sized carbon cages containing metal atoms known as metallofullerenes\n(Tokyo, 20 Sept 2015) Novel tuneable metallofullerenes (metal atoms enclosed in carbon cages) are developed by a research team including scientists from the University of Electro-Communications, Tokyo. This ability to ‘fine-tune’ metallofullerene could find applications as functional materials in molecular electronics, such as organic photovoltaic devices. The results are reported in the journal, Chemistry – A European Journal .\nTiny nanoscale molecules in the form of spherical carbon cages, or ‘fullerenes’, have received considerable attention in recent years. Individual or small groups of atoms can be trapped inside fullerenes, creating stable molecules with unique electronic structures and unusual properties that can be exploited in the field of nanomaterials and biomedical science.\nEndohedral metallofullerenes (EMFs) are one such class of molecules, in which one or more metal atoms are encapsulated inside many kinds of carbon cages. Crucially, the metal atom(s) are not chemically bonded with the carbon surrounds, but they do donate electrons to the carbon cage. Scientists have recently begun to understand how to control the movement, behavior and positioning of the enclosed atoms by adding other atoms, such as silicon or germanium (in their silyl or germyl groups), to the fullerene surface. This allows for the manipulation and fine-tuning of the EMF’s properties.\nNow, Masahiro Kako and co-workers at the University of Electro-Communications ,Tokyo, together with scientists across Japan and the USA, have created and analyzed the effects of silylation and germylation on an EMF called Lu3N@Ih-C80 (three lutetium atoms bonded to a nitrogen atom encased inside a carbon 80 cage).\nUsing X-ray crystallography, electrochemical analyses and theoretical calculations, the team discovered that adding silyl groups or germyl groups to the fullerene structure was a versatile way of controlling the EMF’s electronic properties. The exact positioning of the silyl or germyl groups in bonding to the carbon structure determined the energy gaps present in the EMF, and determined the orientation of the bonded metal atoms inside the cage.\nThe germyl groups donated more electrons and the process worked slightly more efficiently than the silyl groups, but Kako and his team believe that both provide an effective way of fine-tuning EMF electronic characteristics.\nBackground\nA brief history of fullerenes\nFullerenes are carbon molecules that take the shape of spheres. The most famous and abundant fullerene is the buckminsterfullerene, or ‘buckyball’, C60, which resembles a soccer ball in shape with a bonded carbon atom at each point of every polygon.\nEndohedral metallofullerenes, or EMFs, are created by trapping a metal atom or atoms inside a fullerene cage, rather like a hamster in a ball. The trapped atom(s) are not chemically-bonded to the carbon, but they do interact with it by donating electrons, thus creating unique and very useful molecules for nanomaterial science and biomedicine.\nSilylation and germylation\nThe addition of other atoms to fullerene surfaces can affect EMF properties, by regulating the behavior of the metal atoms inside the fullerene cage. In one EMF, the movement of lanthanum atoms is restricted to two dimensions by the addition of silyl groups to the carbon cage. This alters the electrostatic potentials inside the cage and restricts the lanthanum atoms’ mobility, and thus changes the overall properties of the whole molecule.\nThis study by Masahiro Kako and co-workers further enhances understanding of the effects of silylation and germalytion (the addition of silicon-based and germanium-based groups) on lutetium-based EMFs. The team have shown that the exact positioning of the additional atoms in the carbon structure can influence the energy gaps across the molecule, thereby allowing them to tune the electronic properties of the EMF. This ability to ‘fine-tune’ EMFs could have some applications for functional materials in molecular electronics, such as acceptors in organic photovoltaic devices.\nFurther work\nKako and his team hope to carry out further investigations into the addition of alternative groups of atoms to fullerenes, to add to the tuning properties of silicon- and germanium-based groups. This could expand on the versatility of EMFs and their potential applications in future.\nReference\nM. Kako, K. Miyabe, K. Sato, M. Suzuki, N. Mizorogi, W.-W. Wang, M. Yamada, Y. Maeda, M. M. Olmstead, A. L. Balch, S. Nagase, & T. Akasaka. Preparation, structural determination, and characterization of electronic properties of bis-silylated and bis-germylated Lu3N@Ih-C80. Chemistry – A European Journal 21 (2015)\nCorrespondence to: Masahiro Kato – kako(at)e-one.uec.ac.jp\nFurther information:\nInternational Public Relations\nThe University of Electro-Communications, Tokyo\n1-5-1 Chofugaoka, Chofu, Tokyo 182-8585\nE-mail: ru-info-ml(at)uec.ac.jp\nWebsite: http://www.uec.ac.jp/\nAbout The University of Electro-Communications, Tokyo\nThe University of Electro-Communications (UEC) in Tokyo is a small, luminous university at the forefront of applied sciences, engineering, and technology research. Its roots go back to the Technical Institute for Wireless Commutations, which was established in 1918 by the Wireless Association to train so-called wireless engineers in maritime communications in response to the Titanic disaster in 1912. In 1949, the UEC was established as a national university by the Japanese Ministry of Education, and moved in 1957 from Meguro to its current Chofu campus Tokyo.\nWith approximately 4,000 students and 350 faculty, UEC is regarded as a small university, but with particular expertise in wireless communications, laser science, robotics, informatics, and material science, to name just a few areas of research.\nThe UEC was selected for the Ministry of Education, Culture, Sports, Science and Technology (MEXT) Program for Promoting the Enhancement of Research Universities as a result of its strengths in three main areas: optics and photonics research, where we are number one for the number of joint publications with foreign researchers; wireless communications, which reflects our roots; and materials-based research, particularly on fuel cells.\nWebsite: http://www.uec.ac.jp/\n //www.prweb.com/releases/2015/10/prweb13029216.htm\n ", "external_links": ["http://www.prweb.com/releases/2015/10/prweb13029216.htm", "http://www.uec.ac.jp/"], "published": "2015-10-20T07:11:00.000+03:00", "crawled": "2015-10-20T07:34:36.655+03:00", "highlightTitle": ""}