{"organizations": [], "uuid": "819aa5df2d1c80991d8ead3244fcd5167b6a661d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266385/technology-general", "section_title": "Technology Press Releases from PRWeb - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30318610/hcmworks-announces-launch-of-hcmmarketplace", "country": "US", "title": "HCMWorks Announces Launch of HCMMarketplace", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "HCMWorks Announces Launch of HCMMarketplace - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T23:11:00.000+03:00", "replies_count": 0, "uuid": "819aa5df2d1c80991d8ead3244fcd5167b6a661d"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30318610/hcmworks-announces-launch-of-hcmmarketplace", "ord_in_thread": 0, "title": "HCMWorks Announces Launch of HCMMarketplace", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Leading provider of contingent workforce solutions in North America adds new simple, on-demand tool to the market.\nNew York, NY\nHCMWorks is excited to announce the release of their new plug-and-play managed service provider (MSP), HCMMarketplace. HCMMarketplace is designed to provide many of the same benefits of a full-service MSP program, but without all the hassle and complexities associated with most overwhelming systems and on an on-demand basis. With zero pre- and post-implementation costs, HCMMarketplace is a turnkey MSP that can immediately help businesses or organization gain administrative control over their contingent workforce and benefit from the savings associated with it.\nThis new vendor-funded tool will help human resource directors, recruiting specialists, and anyone in charge of procurement processes who are otherwise unsure about the daunting task of transitioning from contingent labor management to a complete MSP. Julia Fournier, President and CEO, spoke about the company's new program in a statement.\n“We are pleased to announce the launch of HCMMarketplace, which is designed to address those challenges that midsize companies have in managing their contingent workforce,\" Fournier said. \"Truly disruptive in nature, it gives companies that visibility, control and cost reduction in an all-in-one, simple to use solution. HCMMarketplace fills that gap or challenge for those companies.”\nHCMMarketplace has been shown to improve fill ratios by 53% and lower the cost of hire by 17–31% on average. It effectively gives businesses visibility and control over their contingent labor and allows them to take all of their staffing vendors and put them into one single tool at no cost.\nThe best feature about the new tool is its ease and simplicity. It's essentially a plug-and-play system as it comes pre-built, doesn’t require a lot of attention to get implemented within an organization, and interfaces with virtually any back end system a company currently has.\nDespite its very recent emergence into the market, HCMMarketplace has seen great results and has been rated positively by the companies already using it. It's expected to continue to grow and evolve as more and more companies realize the benefits that can be achieved with this new tool.\nAbout HCMWorks\nHCMWorks provides custom workforce management solutions, helping businesses with contract negotiating, payment processing, and risk mitigation. Companies can get the most value out of their workforce, while reducing the costs of talent acquisition. To learn more about their payroll and contingent labor solutions, visit http://www.hcmworks.com .\n //www.prweb.com/releases/2015/10/prweb13034351.htm\n ", "external_links": ["http://www.prweb.com/releases/2015/10/prweb13034351.htm"], "published": "2015-10-21T23:11:00.000+03:00", "crawled": "2015-10-23T08:02:01.691+03:00", "highlightTitle": ""}