{"organizations": [], "uuid": "7f7512a40c5541889163d6e103d2f3384e1f4b21", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://www.freshnews.com/news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1135732/canvas-partnership-clever-shows-early-signs-success", "country": "US", "title": "Canvas Partnership with Clever Shows Early Signs of Success", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "Canvas Partnership with Clever Shows Early Signs of Success", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T20:00:00.000+03:00", "replies_count": 0, "uuid": "7f7512a40c5541889163d6e103d2f3384e1f4b21"}, "author": "admin", "url": "http://www.freshnews.com/news/1135732/canvas-partnership-clever-shows-early-signs-success", "ord_in_thread": 0, "title": "Canvas Partnership with Clever Shows Early Signs of Success", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Submitted by admin on 10/2/2015 @ 10:00 AM   Instructure \nSALT LAKE CITY, Oct. 2, 2015 /PRNewswire/ -- Instructure, a SaaS company and creator of the Canvas learning management system (LMS), today announced promising back-to-school results from its data integration partnership with Clever. In three months, Instructure integrated more than 300,000 student accounts in Canvas with schools' student information systems (SIS). This enables schools using Canvas and Clever to provide a single sign-on experience for both systems. \nhttp://photos.prnewswire.com/prnvar/20121101/SF04201LOGO \nCanvas is a cloud-based LMS that connects all of the digital tools and resources K-12 teachers and students use into one simple place. Teachers use Canvas to create digital assignments, to make grading simple and to stay in touch with parents. Schools use Canvas to create a digital learning environment for their teachers and students. By working with Clever, Instructure is making it easier for schools to integrate their SIS with Canvas. \n\"Our teachers and students interact with Canvas every day. It's important to us that they can use that platform for direct and easy access to adaptive software programs and digital curriculum without having to memorize different passwords for each product,\" said Allison Pilley, director of Curriculum, Instruction and Assessment at Springfield Public Schools. \"Clever is the bridge that allows us to do that so the end user has a seamless entry into programs.\" \nInstructure partnered with Clever in 2015 to simplify and speed these integrations for its growing customer base. Clever specializes in helping schools integrate and deploy educational technology at scale in today's classrooms. More than 44,000 K-12 schools in the U.S. use Clever today. \n\"Clever is working with us to make it easier for schools to focus on teaching and learning rather than on integrating software,\" said Melissa Loble, vice president of Partners and Programs at Instructure. \"Canvas is an open platform that aims to work with any SIS whether via Clever or through a direct integration.\" \nABOUT CLEVER \nClever was founded in 2012 by educators and technologists who knew that widely available educational apps could improve both teaching and learning, but that tools to deploy and secure the applications were simply unavailable. Today, more than 44,000 K-12 schools in the U.S. trust Clever to secure their student data as they adopt learning apps in the classroom. Visit www.clever.com to learn more. \nABOUT INSTRUCTURE \nInstructure, Inc. is the software-as-a-service (SaaS) technology company that makes software that makes people smarter. With a vision to help maximize the potential of people through technology, Instructure created Canvas and Bridge to enable organizations everywhere to easily develop, deliver and manage engaging face-to-face and online learning experiences. To date, Instructure has connected millions of teachers and learners at more than 1,400 educational institutions and corporations throughout the world. Learn more about Canvas for higher ed and K-12, and Bridge for the corporate market at www.Instructure.com . \nInstructure contact:", "external_links": [], "published": "2015-10-02T20:00:00.000+03:00", "crawled": "2015-10-02T22:05:37.893+03:00", "highlightTitle": ""}