{"organizations": [], "uuid": "db1d90da7dd5c9df3dc6b0d1ff365c5ca5762be0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://www.freshnews.com/news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1143519/majesco-announces-new-release-majesco-distribution-management", "country": "US", "title": "Majesco Announces New Release of Majesco Distribution Management", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "Majesco Announces New Release of Majesco Distribution Management", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T15:45:00.000+03:00", "replies_count": 0, "uuid": "db1d90da7dd5c9df3dc6b0d1ff365c5ca5762be0"}, "author": "admin", "url": "http://www.freshnews.com/news/1143519/majesco-announces-new-release-majesco-distribution-management", "ord_in_thread": 0, "title": "Majesco Announces New Release of Majesco Distribution Management", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Submitted by admin on 10/21/2015 @ 5:45 AM Companies mentioned in this article: Majesco \nMORRISTOWN, N.J. -- (BUSINESS WIRE) -- Majesco (NYSE MKT:MJCO), a global provider of core insurance software, consulting and services for insurance business transformation, today announced the next release of the Majesco Distribution Management solution. Majesco Distribution Management is designed to uniquely support all lines of business across P&C and L&A (Individual and Group) as well as all channels and is pre-integrated with Majesco Business Analytics and Majesco’s digital portal and mobile capabilities. \nThis new release, built on the Majesco Configuration Toolset, expands configuration and integration areas within distribution management. In addition, the release includes expanded capabilities that are designed to improve insurers’ ability to manage productive channel relationships including enhanced contracting and appointments and hierarchy management. These expanded capabilities are expected to enable insurers to design, develop, maintain and manage the expanding array of channel relationships to enhance their competitive advantage. \nMike Fitzgerald, Senior Analyst at Celent commented, “This is a very exciting time in the distribution management solution space. Not too long ago, the only option for carriers was to build their own in-house solution or purchase vendor solutions with limited concentration on administration tasks such as licensing, contracting and commissions for traditional channels like agents. In today’s rapidly changing market and expanding channels, distribution management solutions must have broader capabilities to support any channel from an administrative and strategic perspective including integrated digital and data capabilities and business configuration that meets the broader market needs and opportunities. Majesco’s solution certainly fits this evolution and is an example of how the solution market is responding to the evolving needs in distribution management.” \nPrateek Kumar, EVP P&C for Majesco commented, “The expanding and changing distribution channels and complexity of channel management requires insurers to have more robust distribution management systems to optimize their operation. With rapidly changing and increased complexity of distribution channel ecosystems, Majesco Distribution Management is designed to enable insurers to manage their channels strategically through access to more data, insights, new distribution channels, and enhanced capabilities to efficiently manage compensation and channel productivity aspects.” \nMajesco has over 15 insurers globally using the distribution management solution across an array of traditional and new channels. It can be implemented on-premise, hosted or on a cloud environment. Majesco recently announced that Majesco Distribution Management was selected by Westfield Insurance. \nMajesco Distribution Management is a standalone, modern solution that is designed to enable insurance carriers to manage the entire distribution landscape with comprehensive business capabilities that enable diverse channel options, supports the increasing need of an multi-channel environment, effectively administer a range of distribution channels and producers from registration to termination, compensation and performance management, and launch innovative contests and personalize payment schedules for producers to help drive business growth. The highly configurable platform is designed to enable ease of integration within the insurance carrier’s business system landscape. It is pre-integrated with Majesco Policy for P&C and Majesco Policy for L&A and Group, which are Majesco’s industry leading policy management solutions. \nAbout Majesco \nMajesco enables insurance business transformation for approximately 140 insurance customers by providing solutions which include software, consulting and services. \nOur customers are insurers, MGA’s and other risk providers from the Property and Casualty, Life, Annuity and Group insurance segments worldwide. Majesco delivers proven software solutions, consulting and services in the core insurance areas such as policy, billing, claims, distribution management, BI/ analytics, digital, application management, cloud and more. For more details on Majesco, please visit www.majesco.com . \nCautionary Language Concerning Forward-Looking Statements \nThis press release contains forward-looking statements within the meaning of the “safe harbor” provisions of the Private Securities Litigation Reform Act. These forward-looking statements are made on the basis of the current beliefs, expectations and assumptions of management, are not guarantees of performance and are subject to significant risks and uncertainty. These forward-looking statements should, therefore, be considered in light of various important factors, including those set forth in Majesco’s reports that it files from time to time with the Securities and Exchange Commission and which you should review, including those statements under “Item 1A – Risk Factors” in Majesco’s Annual Report on Form 10-K. \nImportant factors that could cause actual results to differ materially from those described in forward-looking statements contained in this press release include, but are not limited to: integration risks; changes in economic conditions, political conditions, trade protection measures, licensing requirements and tax matters; technology development risks; intellectual property rights risks; competition risks; additional scrutiny and increased expenses as a result of being a public company; the financial condition, financing requirements, prospects and cash flow of Majesco; loss of strategic relationships; changes in laws or regulations affecting the insurance industry in particular; restrictions on immigration; the ability and cost of retaining and recruiting key personnel; the ability to attract new clients and retain them and the risk of loss of large customers; continued compliance with evolving laws; customer data and cybersecurity risk; and Majesco’s ability to raise capital to fund future growth. \nThese forward-looking statements should not be relied upon as predictions of future events and Majesco cannot assure you that the events or circumstances discussed or reflected in these statements will be achieved or will occur. If such forward-looking statements prove to be inaccurate, the inaccuracy may be material. You should not regard these statements as a representation or warranty by Majesco or any other person that we will achieve our objectives and plans in any specified timeframe, or at all. You are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date of this presentation. Majesco disclaims any obligation to publicly update or release any revisions to these forward-looking statements, whether as a result of new information, future events or otherwise, after the date of this press release or to reflect the occurrence of unanticipated events, except as required by law. View source version on businesswire.com: http://www.businesswire.com/news/home/20151021005789/en/ Copyright © Business Wire 2015", "external_links": [], "published": "2015-10-21T15:45:00.000+03:00", "crawled": "2015-10-21T17:12:40.580+03:00", "highlightTitle": ""}