{"organizations": [], "uuid": "77590244b7273c0dd6a524e47ae44f0570ebaa1d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fcw.com", "main_image": "", "site_section": "http://fcw.com/rss-feeds/all.aspx", "section_title": "FCW: The business of federal technology", "url": "https://fcw.com/articles/2015/10/08/cyber-port-pirates.aspx", "country": "US", "title": "Are our ports protected from cyber pirates?", "performance_score": 0, "site": "fcw.com", "participants_count": 0, "title_full": "Are our ports protected from cyber pirates?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T22:11:00.000+03:00", "replies_count": 0, "uuid": "77590244b7273c0dd6a524e47ae44f0570ebaa1d"}, "author": "", "url": "https://fcw.com/articles/2015/10/08/cyber-port-pirates.aspx", "ord_in_thread": 0, "title": "Are our ports protected from cyber pirates?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Zach Noble"], "text": "Are our ports protected from cyber pirates? By Zach Noble \n( Sarah Marchant / Shutterstock) \nWhen Edward Teach blockaded Charleston, South Carolina, in 1718, he had an easy go of it as the port lacked guard ships – but word spread among colonial governors, and the pirate known as Blackbeard would be hunted down and killed within the year. \nToday, cyber pirates have the potential to take control of ships' navigations systems, industrial control systems at ports, or steal financial information from shipping firms. And while there are guard ships on watch, technically speaking, they may never find out what pirates are up to. \nThe Coast Guard, unsurprisingly, would like to fix that. \nSince 2002, the Coast Guard has been tasked with addressing cyber threats to American ports. \"We don't view this as a new mission, said RADM Paul Thomas, the Coast Guard's Assistant Commandant for Prevention Policy, at an Oct. 8 hearing of the Subcommittee on Border and Maritime Security of the House Homeland Security Committee. \"We view this as a natural extension of our mission.\" \nThe Coast Guard is \"perfectly positioned\" to handle port cybersecurity, agreed Randy Parsons, who heads security at the Port of Long Beach in California, \nPort pros are sharing information, but there isn't a formal platform for ports to share specific threats among one another \nJonathan Sawicki, who leads security at the Texas ports of Brownsville and Harlingen, said that reporting transportation security incidents to the Coast Guard currently is kind of a muddle. \n\"We have not reported any cybersecurity incidents because we have not had any that are significant enough to report,\" Sawicki told the subcommittee. Most reporting criteria are based on physical breaches instead of cyber-specific threats. \nLoss of access control, cargo control or perimeter control are all reportable cyber issues, Thomas noted, while a cyber breach of a port's financial information isn't. \n“The confusion comes because cyber touches all aspects of a port['s operations],” he noted. “It's very confusing to figure out which type of incident gets reported.” \nWhat's next? \nIn the interest of furthering its cyber expertise, Thomas said the Coast Guard has a permanent presence in the Homeland Security Department's National Cybersecurity and Communications Integration Center. \nBut he also said he wouldn't rush to impose \"hard\" cyber standards on ports until other, related industries develop standards, since the infrastructure systems (rail, trucking, etc.) are so interrelated. \nIn these early stages of laying out concerns, building information sharing networks and establishing the rules of the road, Thomas said, the Coast Guard doesn't really need additional funding for cyber. But funding needs will grow in the compliance stage of the game. \nThe Coast Guard should look to break down barriers to info sharing, develop a secure mechanism for companies to share threat information with the government and perhaps anonymize information shared, so shipping companies don't suffer reputational damage when they disclose breaches, said Gregory Wilshusen, Information Security Issues Director at the Government Accountability Office.While praising voluntary info sharing and risk-based assessments, Long Beach's Parsons also noted issues, such as a lack of backup systems, plaguing national ports. \n\"I think there's gotta be some regulation,\" he said. \"Left to our own devices, we don't seem to have done very well.\" About the Author \nZach Noble is a staff writer covering cloud, big data and workforce issues. Connect with him on Twitter: @thezachnoble . <>", "external_links": [], "published": "2015-10-08T22:11:00.000+03:00", "crawled": "2015-10-09T04:18:51.171+03:00", "highlightTitle": ""}