{"organizations": [], "uuid": "d6eda16ce0c87beabaaf1e621099fd3b5add4224", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1139221/rsi-leads-cpg-industry-ongoing-education-and-knowledge-sharing-leading-events", "country": "US", "title": "RSi Leads CPG Industry with Ongoing Education and Knowledge Sharing at Leading Events", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "RSi Leads CPG Industry with Ongoing Education and Knowledge Sharing at Leading Events", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T21:44:00.000+03:00", "replies_count": 0, "uuid": "d6eda16ce0c87beabaaf1e621099fd3b5add4224"}, "author": "admin", "url": "http://www.freshnews.com/news/1139221/rsi-leads-cpg-industry-ongoing-education-and-knowledge-sharing-leading-events", "ord_in_thread": 0, "title": "RSi Leads CPG Industry with Ongoing Education and Knowledge Sharing at Leading Events", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Companies mentioned in this article: Retail Solutions Inc. \nMOUNTAIN VIEW, Calif., Oct. 12, 2015 /PRNewswire/ -- Retail Solutions Inc. (RSi), continues to demonstrate its unwavering support for the consumer packaged goods (CPG) industry through its ongoing participation at industry events and on webinars designed to educate, inspire and encourage the advancement of the industry using real-time actionable intelligence in the store and on the shelf. \nRSi first will return as a Platinum sponsor of the Consumer Goods Business & Technology Leadership Conference between October 19(th )and 22(nd). The company will host a thought leadership session where attendees will hear Andy Matthews, VP of Sales, share first-hand knowledge and expertise on how consumer goods manufacturers build and optimize a best-in-class retail execution program. Designed for senior executives in business and IT roles, the Consumer Goods Business & Technology Conference provides a leadership forum for networking with peers, sharing ideas and experiences, and analyzing industry trends. \nOn November 12(th), RSi's CEO Jonathan Golovin will join Laura York, Director of Supply Chain for Walgreens, and Amy Mayo, Customer Service Manager for Mondelez, for a webinar moderated by Kara Romanow, Executive Editor of CGT Magazine. \"The Power of Trust: Walgreens and Mondelez Share Success\" webinar will highlight a joint collaboration project focusing on promotion forecasting and store allocation. It will also feature a deep dive into the analyses and takeaways from the Shared Data Strategy Report. This benchmark study, conducted jointly by CGT and RIS News, outlines the efficiencies, improvements and roadblocks to collaboration in the retail and consumer goods industry. \nRSi was one of the first solution providers to take advantage of shared data to drive value and differentiation for both retailers and suppliers. Today, RSi operates the largest number of dedicated Retailer Collaboration programs globally. More than 500 leading suppliers use its platform to turn data into actionable insights for immediate decision making, ensuring the right products are on the shelf in every store, every day. \nAbout Retail Solutions Inc. Retail Solutions Inc. (RSi) turns daily POS data into opportunity - online, in the store, and on the shelf. Designed to automate the path to purchase, drive value across the supply chain and ensure measurement of store-level impact, RSi's proprietary algorithms, suite of intelligent, cloud-based applications, and digital-to-store ROI platform help the world's leading consumer goods manufacturers listen and respond quickly to consumer demand - ensuring the right product is in the right store, at the right time. Each day, RSi processes billions of records from over 120 major retailers, in more than 150,000 locations throughout the world, and turns the data into actionable insights for immediate decision-making. From solving out-of-stocks and identifying inaccuracies in the supply chain, to optimizing and measuring digital marketing efforts with ansa, RSi maximizes product availability, uncovers new business opportunities and drives sales. The company is trusted by more than 500 global CPG companies including household names such as Colgate-Palmolive, Nestle and Procter & Gamble. You can find RSi's ansa inside top ad networks and digital marketing platforms including MaxPoint, OwnerIQ and News America Marketing. To learn more about the company, visit: http://www.retailsolutions.com/ \nMedia Contact: Director of Marketing, Retail Solutions Inc.650.390.6143", "external_links": [], "published": "2015-10-12T21:44:00.000+03:00", "crawled": "2015-10-12T23:11:44.622+03:00", "highlightTitle": ""}