{"organizations": [], "uuid": "34ff16efac5c9f75c1b79b6854d45076826bc11b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com/news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1144701/business-wire-s-bizwiretv-launches-new-episode", "country": "US", "title": "Business Wire’s BizWireTV Launches New Episode", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "Business Wire’s BizWireTV Launches New Episode", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T13:00:00.000+03:00", "replies_count": 0, "uuid": "34ff16efac5c9f75c1b79b6854d45076826bc11b"}, "author": "admin", "url": "http://www.freshnews.com/news/1144701/business-wire-s-bizwiretv-launches-new-episode", "ord_in_thread": 0, "title": "Business Wire’s BizWireTV Launches New Episode", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Submitted by admin on 10/23/2015 @ 3:00 AM   Business Wire \nNEW YORK -- (BUSINESS WIRE) -- Business Wire announces the newest episode of BizWireTV today, a weekly series covering trending news stories published over the newswire’s distribution network. The show spotlights stories on disruptive startups and technologies, entrepreneurs and funding announcements, hot business trends and companies to watch. This Smart News Release features multimedia. View the full release here: http://www.businesswire.com/news/home/20151023005244/en/ \nThis week’s episode features: Tommy Hilfiger becomes the first retailer to bring 3D to its stores. Tweet this! Google and The New York Times collaborate to launch NYT VR. Tweet this! Apple’s ResearchKit is a software toolkit used to create apps for clinical studies. Tweet this! Time Inc. acquires Zooey Deschanel’s mobile and social lifestyle brand HelloGiggles. Tweet this! Founders of VEEV Spirits named one of Goldman Sachs’ 100 Most Intriguing Entrepreneurs of 2015. Tweet this! Microsoft, HP, Lenovo, Dell and Intel collaborate on first joint ad campaign showcasing PC innovation. Tweet this! Scoot Networks and Nissan team up to launch Scoot Quad Tweet this! \nA core component of the video programming is news-related data analysis powered by Business Wire’s NewsTrak reports and NUVI social media tracking. BizWireTV is hosted by Erin Ade , watch for new episodes each Friday available on www.BusinessWire.com \nThe weekly schedule for BizWireTV episodes: \nBizWireTV: Friday at 6:00am \nBizWireTV Accelerator Report: Sunday at 3:00pm \nClick here to share BizWireTV’s latest episode on Twitter: http://ctt.ec/1A58f \nAbout Business Wire \nBusiness Wire, a Berkshire Hathaway company, is the global leader in press release distribution and regulatory disclosure . Investor relations, public relations, public policy and marketing professionals rely on Business Wire to accurately distribute market-moving news and multimedia , host online newsrooms and IR websites , build content marketing platforms , generate social engagements and provide audience analysis that improves interaction with specified target markets. Founded in 1961, Business Wire is a trusted source for news organizations, journalists, investment professionals and regulatory authorities, delivering news directly into editorial systems and leading online news sources via its multi-patented simultaneous NX Network. Business Wire has 32 offices worldwide to securely meet the varying needs of communications professionals and news consumers. \nLearn more at BusinessWire.com and the BusinessWired blog ; follow updates on Twitter: @businesswire or on Facebook . View source version on businesswire.com: http://www.businesswire.com/news/home/20151023005244/en/ Copyright © Business Wire 2015", "external_links": [], "published": "2015-10-23T13:00:00.000+03:00", "crawled": "2015-10-23T15:59:47.936+03:00", "highlightTitle": ""}