{"organizations": [], "uuid": "a58719a997d456a83395ccbf7d3b57984c2d98bb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.iol.co.za", "main_image": "http://www.iol.co.za/polopoly_fs/iol-pic-dado-twitter-logo-on-phone-with-market-graph-background-1.1934070!/image/2248586914.jpg_gen/derivatives/box_600/2248586914.jpg", "site_section": "http://www.iol.co.za/cmlink/science-technology-business-rss-1.847516", "section_title": "Science Technology Business RSS", "url": "http://www.iol.co.za/twitter-aims-to-improve-relationships-1.1934071", "country": "US", "title": "Twitter aims to improve relationships", "performance_score": 0, "site": "iol.co.za", "participants_count": 0, "title_full": "Twitter aims to improve relationships", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T12:49:00.000+03:00", "replies_count": 0, "uuid": "a58719a997d456a83395ccbf7d3b57984c2d98bb"}, "author": "", "url": "http://www.iol.co.za/twitter-aims-to-improve-relationships-1.1934071", "ord_in_thread": 0, "title": "Twitter aims to improve relationships", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Yasmeen Abutaleb"], "text": "Twitter aims to improve relationships October 22 2015 at 11:49am By Yasmeen Abutaleb REUTERS File picture: Dado Ruvic \nSan Francisco - In his second public appearance since being named Twitter’s permanent chief executive earlier this month, Jack Dorsey on Wednesday apologised to the developers who work with the social media company to create apps. \nHis admission came as he begins a turnaround effort at Twitter, which has struggled with user growth and attracting advertising dollars, while taking public his mobile payments company, Square, by the end of this year. \n“Somewhere along the line our relationship with the developers got a little complicated,” Dorsey said at the company's annual developer conference in San Francisco. “We are going to reset our relations and we want to make sure that we are learning, that we are listening and that we are rebooting.” \nOne key to the effort at Twitter is to work more closely with developers who use software tools from the company to create their own apps, and Dorsey's apology appeared to be an attempt to set a new tone with them. \nHe also needs to increase the company's revenue from ads and promoted tweets. At Wednesday's event the company appealed to potential advertisers by highlighting Twitter's ability to determine what people are talking about in any given moment, such as a major news event. \nAs part of that effort, Chris Moody, the company's vice-president of data strategy, announced two new software tools that should provide deeper insights into how the audience on Twitter is responding to an event and how engaged users are. \nAt the event, the company also described some of the tools developers have access to in order to see who is using their apps, which Twitter said can help programmers improve their products. \nThe company also unveiled more ways for advertisers to use data from the company and more tools to let publishers embed tweets in apps and websites. \nREUTERS", "external_links": [], "published": "2015-10-22T12:49:00.000+03:00", "crawled": "2015-10-22T13:13:47.832+03:00", "highlightTitle": ""}