{"organizations": ["AWS", "Thomson Reuters", "Amazon Web Services", "Reuters", "BGC Partners", "Amazon.com", "Amazon"], "uuid": "13b421755827f8ec191ae688728f4844de01f22e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "cio.economictimes.indiatimes.com", "main_image": "http://economictimes.indiatimes.com/photo/Cloud-services-help-Amazon-post-surprise-Q2-profit/49502220.cms", "site_section": "http://cio.economictimes.indiatimes.com/rss/recentstories", "section_title": "Latest Information Technology News | Latest IT Industry News, Information and Updates: ET CIO : ETCIO.com", "url": "http://cio.economictimes.indiatimes.com/news/cloud-computing/cloud-services-help-amazon-post-surprise-q2-profit/49502220", "country": "IN", "title": "Cloud services help Amazon post surprise Q2 profit", "performance_score": 0, "site": "indiatimes.com", "participants_count": 0, "title_full": "Cloud services help Amazon post surprise Q2 profit", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T11:26:00.000+03:00", "replies_count": 0, "uuid": "13b421755827f8ec191ae688728f4844de01f22e"}, "author": "", "url": "http://cio.economictimes.indiatimes.com/news/cloud-computing/cloud-services-help-amazon-post-surprise-q2-profit/49502220", "ord_in_thread": 0, "title": "Cloud services help Amazon post surprise Q2 profit", "locations": ["North America"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Brian Olsavsky", "Olsavsky", "Colin Gillis.Analysts"], "text": "#Amazon Cloud services help Amazon post surprise Q2 profit Cloud computing is the fastest growing business for Amazon, and the new services in which it is investing will help it capitalize on rising demand to store and manage large amounts of information. Reuters | 23 October 2015, 1:56 PM IST Follow ETCIO Share E-commerce company Amazon.com on Thursday recorded a surprise profit for the second quarter in a row, propelled by higher sales in North America and its cloud computing business, and its shares rose 11%.Amazon, which has historically struggled with profitability while spending to expand beyond its core online marketplace offerings, reined in costs and was helped to profitability by growth at its Amazon Web Services (AWS) segment.Chief financial officer Brian Olsavsky told reporters on a conference call that the balance between investing and cost controls \"will be lumpy over time.\"Olsavsky said the company would continue to invest in areas that work with customers, adding that even though investments would \"remain very high\" Amazon would be looking for ways to cut costs.Net sales from Amazon Web Services, which has more than 1 million active customers in 190 countries, rose more than 78% in the quarter to $2.09 billion.\"There are questions about what's the sustainable margin for this? Are we seeing just a hyper growth phase now? But for right now, AWS is driving the train, and it's going to for the near future,\" said BGC Partners analyst Colin Gillis.Analysts on a separate conference call asked Amazon about its forecast for long-term margins on AWS, but the company provided no figures.Cloud computing is the fastest growing business for Amazon, and the new services in which it is investing, such as Internet of Things, will help the company capitalize on rising demand to store and manage large amounts of information.Sales in North America, the largest market for the world's biggest retailer, rose 28.3% to $15.01 billion in the third quarter ended September 30, on robust Prime Day sales and demand for electronics and general merchandise.In July, Amazon said customers had ordered 34.4 million items worldwide during the one-day sale for members of its $99 per year Prime subscription service.The company forecast net sales growth of 14% to 25%, to a range of $33.50 billion and $36.75 billion, for the holiday shopping quarter.Analysts, on average, had been expecting revenue of $35.16 billion, according to Thomson Reuters I/B/E/S.For the latest quarter, Amazon reported a profit of $79 million, or 17 cents per share, compared with a loss of $437 million, or 95 cents per share, a year ago.Total net sales rose 23.2% to $25.36 billion. Analysts, on average, had expected a loss of 13 cents per share on revenue of $24.91 billion, according to Thomson Reuters I/B/E/S.Amazon's shares rose to $625 in late trade after closing at $563.91 on Thursday.", "external_links": [], "published": "2015-10-23T11:26:00.000+03:00", "crawled": "2015-10-23T14:51:50.873+03:00", "highlightTitle": ""}