{"organizations": [], "uuid": "d8a9e57cbbcb010561cab6218286a8ecc82c34bb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wcax.com", "main_image": "http://images.worldnow.com/AP/images/9055213_G.jpg", "site_section": "http://www.wcax.com/category/13536/technology-news", "section_title": "Technology &amp; Science News - WCAX.COM Local Vermont News, Weather and Sports-", "url": "http://www.wcax.com/story/30302412/monarchs-get-help-from-unlikely-source-californias-drought", "country": "US", "title": "Monarchs get help from unlikely source: California's drought", "performance_score": 0, "site": "wcax.com", "participants_count": 1, "title_full": "Monarchs get help from unlikely source: California's drought - WCAX.COM Local Vermont News, Weather and Sports-", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "d8a9e57cbbcb010561cab6218286a8ecc82c34bb"}, "author": "wcax.com", "url": "http://www.wcax.com/story/30302412/monarchs-get-help-from-unlikely-source-californias-drought", "ord_in_thread": 0, "title": "Monarchs get help from unlikely source: California's drought", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By GILLIAN FLACCUS\nAssociated Press VISTA, Calif. (AP) - In California's drought, the struggling monarch butterfly may have found a sprinkling of hope.\nSuburban homeowners ripping out thirsty lawns are dotting their new drought-tolerant landscapes with milkweed native to California's deserts and chaparral - plants that have the potential to help save water and monarchs at the same time, because the female monarch will only lay her eggs on milkweed.\nOverall numbers of the majestic black-and-orange butterflies have dropped from 1 billion to fewer than 60 million over the past two decades as milkweed nationwide has fallen prey to development and pesticides.\nEarlier this year, the U.S. Fish and Wildlife Service announced $1.2 million starter investment to restore habitat; other national projects aim to distribute milkweed seeds by mail and build databases of breeding habitats as alarm grows. Whether by choice or by chance, ecologists hope California gardeners looking to save water can provide a boost to the butterflies on the West Coast.\n\"This is a really important way to provide really important habitat for a really important butterfly,\" said Greg Rubin, president of California's Own Native Landscape Design, Inc.\nNurseries are increasingly stocking multiple varieties of native milkweed and catering to customers who want to be drought savvy but also want to attract butterflies.\nBusiness was up 50 percent this season at Tom Merriman's native plants nursery in Vista, California. Five years ago, Merriman didn't sell milkweed at all; this summer, he sold more than 14,000 plants and is shipping truckloads of seedlings all over California and other bone-dry Western states like Arizona, New Mexico and Utah.\nDozens of monarchs flit through a butterfly atrium he built next to his greenhouses and sometimes sneak inside his greenhouses to lay eggs on plants awaiting sale.\n\"If you plant it, they will come,\" said Merriman, who has a greenhouse stuffed with 8,000 milkweed of a dozen types. \"We had chrysalises on shovels, we had them on wheelbarrows. They were up in the nursery on palm trees. They were everywhere, under tables. We were releasing 500 caterpillars a week on native milkweed.\"\nAnya Shortridge bought a few milkweed plants last year for her drought garden.\nNow, she grows more than 100 milkweeds and carefully scans them for microscopic monarch eggs. When the eggs hatch, she feeds the tiny black-, gold- and white-striped caterpillars until they disappear into a shimmering, light green chrysalis where the mysterious transformation into a butterfly occurs.\nThis season, she and her husband have released more than 100 butterflies into the wild.\nA sign in front of her house on a San Diego hilltop designates her garden as a \"monarch waystation.\"\n\"We're finding eggs - monarch eggs - on the underside of our milkweed leaves all the time, so if I wanted to I could probably raise thousands,\" said Shortridge, who coos and cajoles the butterflies as if they were her children.\nSome experts, however, are worried that California homeowners who plant milkweed might actually do harm by trying to do good.\nThat's because many gardeners unwittingly choose tropical - or so-called \"exotic\" - milkweed because of its colorful pink and yellow flowers.\nThe plants are more attractive than the desert varieties but could interfere with the monarch's famed migration.\nNative milkweeds go dormant in the winter, leaving the butterflies no choice but to complete their migratory journey. But the tropical varieties bloom - and provide a place to lay eggs - all year, distracting the females and interrupting migration patterns.\nMillions of North American monarchs travel from the eastern and central United States and Canada to Mexico each winter, while a smaller number travel through the western U.S. to winter along California's Central Coast. These Western monarchs co-evolved with native milkweeds and eating plants from another region might make them more vulnerable, said Hei-ock Kim, of the California Native Plants Society.\n\"When you take plants and animals from where they originated, you're going to change chemistry, climate, biology,\" she said. \"You're changing all their habits, and so things work best when they are where they're supposed to be.\"\n___\nFollow Gillian Flaccus on Twitter at http://www.twitter.com/gflaccus\n ", "external_links": ["http://www.twitter.com/gflaccus"], "published": "2015-10-20T03:00:00.000+03:00", "crawled": "2015-10-20T17:36:24.012+03:00", "highlightTitle": ""}