{"organizations": [], "uuid": "917da8e1c6f80e92942fd7e2a2166c85ad7dd004", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "", "site_section": "http://www.bloomberg.com/technology", "section_title": "Technology - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-10-22/softbank-expects-to-invest-several-billion-dollars-a-year-son", "country": "US", "title": "Softbank Expects to Invest `Several Billion' Dollars a Year: Son", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Softbank Expects to Invest `Several Billion' Dollars a Year: Son - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T19:57:00.000+03:00", "replies_count": 0, "uuid": "917da8e1c6f80e92942fd7e2a2166c85ad7dd004"}, "author": "Pavel Alpeyev", "url": "http://www.bloomberg.com/news/articles/2015-10-22/softbank-expects-to-invest-several-billion-dollars-a-year-son", "ord_in_thread": 0, "title": "Softbank Expects to Invest `Several Billion' Dollars a Year: Son", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Softbank Group Corp. expects to invest “several billions” of dollars a year in promising startups and established businesses as the Japanese company tries to evolve into a truly global corporation and identify its next generation of leaders, Chairman Masayoshi Son said.\nSoftBank is searching for passionate entrepreneurs with good ideas who are targeting the right markets -- someone like Alibaba Group Holding Ltd. co-founder Jack Ma, Son said Thursday during a two-hour broadcast streamed live on the Internet. SoftBank owns a stake of more than 30 percent in Alibaba.\nSoftBank is particularly interested in India, a nation that -- like China -- has been on a technological upswing during the past decade, Son said during a conversation with company President Nikesh Arora. SoftBank led investments of $627 million in Snapdeal.com , an Indian e-commerce provider, and $210 million in the owner of Indian taxi booking service Ola Cabs.\n“In services, in content, there is a local championship,” Son said at an event for Softbank Academia, a program designed to groom future company leaders.\nThe SoftBank founder again identified Arora as a potential successor who shared his broader vision for the company. Arora has said SoftBank is developing a new model for investing in technology startups, shifting its focus to larger, long-term deals where it sees a competitive advantage.\nIn July, the former Google Inc. executive said SoftBank can write checks for $100 million to $500 million, or even $1 billion, and then wait a decade or longer for returns.\nArora’s duties include overseeing global expansion and the turnaround of Sprint Corp., which has slipped to fourth place by users in the U.S. wireless market. SoftBank this month increased its stake in Sprint to about 83 percent. Since Arora joined SoftBank, the company also put $1 billion into Korean e-commerce operator Coupang.", "external_links": ["http://www.softbank.jp/en/corp/irinfo/stock/performance/\\"], "published": "2015-10-22T19:57:00.000+03:00", "crawled": "2015-10-22T15:23:57.097+03:00", "highlightTitle": ""}