{"organizations": [], "uuid": "b8500dda399d5c06a23a3510d652575bc0976e9f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tmcnet.com", "main_image": "", "site_section": "http://rss.tmcnet.com/rss/information%20technology", "section_title": "TMCnet.com RSS Service: information technology", "url": "http://www.tmcnet.com/usubmit/2015/10/13/8260280.htm", "country": "US", "title": "CRA & Fair Lending Colloquium to Focus on Home Mortgage Disclosure Act Data Collection Rules", "performance_score": 0, "site": "tmcnet.com", "participants_count": 0, "title_full": "CRA & Fair Lending Colloquium to Focus on Home Mortgage Disclosure Act Data Collection Rules", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T16:31:00.000+03:00", "replies_count": 0, "uuid": "b8500dda399d5c06a23a3510d652575bc0976e9f"}, "author": "", "url": "http://www.tmcnet.com/usubmit/2015/10/13/8260280.htm", "ord_in_thread": 0, "title": "CRA & Fair Lending Colloquium to Focus on Home Mortgage Disclosure Act Data Collection Rules", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "[October 13, 2015] CRA & Fair Lending Colloquium to Focus on Home Mortgage Disclosure Act Data Collection Rules \nWith finalization of the new Home Mortgage Disclosure Act (HMDA) data collection rules expected soon, lenders are waiting to learn the extent of their regulatory impact. To help better prepare lenders for these upcoming challenges, Wolters Kluwer Financial Services today announced the addition of several HMDA-focused sessions to the 19 th annual CRA & Fair Lending Colloquium Nov. 1-4 at the Hyatt Regency Grand Cypress Hotel in Orlando, Fla. \nThe HMDA sessions include: \"Operationalize the Expanded HMDA Regulations.\" Experts from the Consumer Financial Protection Bureau and the American Bankers Association, as well as other bank compliance professionals, will provide attendees with an update on the proposed new rules and expected impacts in helping lay the groundwork for further sessions on HMDA during the Colloquium (Monday, Nov. 2, 10:45 a.m. - 12:00 p.m. EST). \"First Manage the Data, Then Marshal the Message: A HMDA Regulatory Change Management Formula for Success.\" In this breakfast session, Wolters Kluwer regulatory compliance experts will dig deeply into how to best prepare for, manage, and implement the anticipated regulatory changes. Additional discussion will focus on how the HMDA changes will impact organizations and how the data is likely to be analyzed by peers, regulators and community groups (Tuesday, Nov. 3, 7:30 - 8:30 a.m. EST). \"Accuracy in a New HMDA Data World: Best Practices for HMDA Data Integrity Risk Management.\" Compliance and fair banking officers from three financial institutions will cover best practices for adjusting data quality processes, with special consideration of internal controls, testing and corrective action plans-as well as the consequences of getting it wrong (Tuesday, Nov. 3, 11:00 - 12:15 p.m. EST). \"When the HMDA Data Speak, What Will They Say and Who Will Be Listening?\" Experts from the academic, legal and banking fields will discuss proactive testing measures to protect customer privacy and offer suggestions for using data to tell your business story to senior management and the Board, as well as external audiences, including examiners and community groups (Tuesday, Nov. 3, 3:15 - 4:45 p.m. EST). \n\"Each year, the Colloquium deliberates on issues that are top-of-mind in the industry. With finalization of the new HMDA rules expected imminently, it is a topic of keen interest,\" said Timothy R. Burniston , executive vice president, Wolters Kluwer Financial Services. \"Our intent with these sessions is to help lenders understand the breadth of potential HMDA changes, the possible regulatory compliance and information technology challenges, and to provide resources and guidance on what they can do now to prepare for the upcoming changes.\" \nFor more information on the HMDA sessions, please visit www.CRAColloquium.com . \nAbout Wolters Kluwer Financial Services Wolters Kluwer Financial Services provides customers worldwide with risk management, compliance, finance and audit solutions that help them successfully navigate regulatory complexity, optimize risk and financial performance, and manage data to support critical decisions. With more than 30 offices in 20 countries, our prominent brands include: AppOne® , AuthenticWeb™ , Bankers Systems®, Capital Changes , CASH Suite™ , GainsKeeper® , NILS® , OneSumX® , TeamMate® , Uniform Forms™ , VMP® Mortgage Solutions and Wiz ® . Wolters Kluwer Financial Services is part of Wolters Kluwer , which had 2014 annual revenues of €3.7 billion ($4.9 billion), employs 19,000 employees worldwide, and maintains operations in over 170 countries across Europe, North America, Asia Pacific, and Latin America. Wolters Kluwer is headquartered in Alphen aan den Rijn, the Netherlands. Its shares are quoted on Euronext Amsterdam (WKL) and are included in the AEX and Euronext 100 indices. View source version on businesswire.com: http://www.businesswire.com/news/home/20151013005105/en/", "external_links": [], "published": "2015-10-13T16:31:00.000+03:00", "crawled": "2015-10-14T01:16:47.300+03:00", "highlightTitle": ""}