{"organizations": [], "uuid": "14f25fc7dd1a15b0ff8794e66874c395a8f6c8ba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266385/technology-general", "section_title": "Technology Press Releases from PRWeb - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30255834/clm-matrix-proclaimed-as-silver-sponsor-for-sharepoint-fest-chicago", "country": "US", "title": "CLM Matrix Proclaimed as Silver Sponsor for SharePoint Fest - Chicago", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "CLM Matrix Proclaimed as Silver Sponsor for SharePoint Fest - Chicago - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T12:02:00.000+03:00", "replies_count": 0, "uuid": "14f25fc7dd1a15b0ff8794e66874c395a8f6c8ba"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30255834/clm-matrix-proclaimed-as-silver-sponsor-for-sharepoint-fest-chicago", "ord_in_thread": 0, "title": "CLM Matrix Proclaimed as Silver Sponsor for SharePoint Fest - Chicago", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SharePoint Fest - Chicago will take place December 8-10, 2015 and will be held in Chicago, Illinois at McCormick Place - South.\nChicago, Illinois\nCLM Matrix, along with several other sponsors, will help bring this annual technology conference to Chicago, Illinois December 8-10, 2015 at McCormick Place - South.\nAbout CLM Matrix\nCLM Matrix is a Microsoft Gold Partner and a leading global innovator of SharePoint-based contract lifecycle management software products that transform the way organizations manage contracts, trade agreements and other important documents that contain valuable strategic information. CLM Matrix products are used by customers worldwide across more than 21 unique industry verticals to standardize, streamline and automate their document centric collaborative processes. The company focuses on building intuitive software that leverages and extends existing Microsoft Office/SharePoint technology in three key areas: enhanced rule and policy based workflow, dynamic server-side document generation and no-code configuration. CLM Matrix is headquartered in Dallas, Texas and maintains a global network of experienced deployment and support specialists.\nWeb Site: http://www.clmmatrix.com\nAbout SharePoint Fest\nSharePoint Fest is in its fifth year. It offers a two-day conference (with an optional workshop day) that brings together SharePoint enthusiasts and practitioners, with many of the leading SharePoint experts and solution providers in the country.\nAttend SharePoint Fest – Chicago where attendees will be able to attend workshops and seminars – taught by Microsoft Certified Trainers, Microsoft engineers, and Microsoft MCM's and MVPs – covering Enterprise Content Management, Implementation/Administration, Business Value, Search, Business Intelligence, Office 365 and SharePoint Development. Attendees will be able to choose one complete learning track or mix and match based on what content best meets their current needs.\nAt SharePoint Fest - Chicago, there will be sessions created for SharePoint administrators, software developers, business analysts, information architects, and knowledge workers, which will ensure that attendees walk away with as much knowledge as they desire to truly leverage SharePoint in their current environment.\nWeb Site: http://www.sharepointfest.com/Chicago\n //www.prweb.com/releases/2015/07/prweb12859478.htm\n ", "external_links": ["http://www.sharepointfest.com/Chicago", "http://www.prweb.com/releases/2015/07/prweb12859478.htm"], "published": "2015-10-14T12:02:00.000+03:00", "crawled": "2015-10-16T08:30:35.853+03:00", "highlightTitle": ""}