{"organizations": [], "uuid": "1a97d5efc1fc6090e12265f82d01f8c102e8c0a0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "", "site_section": "http://www.prweb.com/rss2/techmobile.xml", "section_title": "Technology: Mobile", "url": "http://www.prweb.com/releases/2015/10/prweb13010891.htm", "country": "US", "title": "Colligo Expands Global Reach through Partnership with Empired", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Colligo Expands Global Reach through Partnership with Empired", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "1a97d5efc1fc6090e12265f82d01f8c102e8c0a0"}, "author": "Asa Zanatta", "url": "http://www.prweb.com/releases/2015/10/prweb13010891.htm", "ord_in_thread": 0, "title": "Colligo Expands Global Reach through Partnership with Empired", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Colligo, a leader in mobile content management solutions for Microsoft SharePoint, Office 365 and OneDrive for Business, today announces Empired, a leading Microsoft systems integrator with 926 employees across Australia, New Zealand and the US, will resell Colligo’s suite of products as part of Empired’s solutions to customers worldwide. Empired General Manager – Business & Productivity Solutions, Mike Morgan said, “We have a history with Colligo. We have a number of client success stories in Australia and as part of our broader solutions we have implemented Colligo into some of the largest government agencies in New Zealand.”\n“Our teams are impressed with the evolution of Colligo Engage and the variety of email management, mobility and collaboration solutions the company is building on the platform. There is definitely strong demand for Colligo products and we look forward to a long partnership with Colligo.”\nEmpired boasts a broad array of business and technology services capability and is recognised as one of the largest Microsoft systems integrators in Asia Pacific with skills across collaboration, social, systems management, information management, BI, CRM, ERP and Cloud.\n“We’re committed to ensuring Empired is successful in delivering the solutions that will help their customers gain greater user adoption of SharePoint and Office 365,” says Paula Catoira, Global Partner Channel Manager at Colligo. “Our vision to provide comprehensive mobile content management solutions to organizations of all sizes, combined with our proven track record, will provide Empired’s customers with the services and tools needed for a successful SharePoint and Office 365 experience.”\nAn Enterprise Mobile Content Management Solution\nThe Colligo Engage platform improves worker engagement and productivity with an organization’s SharePoint, Office 365 and OneDrive for Business systems. The platform features a family of specialized applications that are built around everyday tools that employees already use, such as Outlook, Windows Explorer, Mac Finder, phones and tablets, to ensure high user adoption. Colligo Engage also includes powerful administrative tools for IT. The cloud-based Colligo Engage Console provides greater control to configure settings and enforce compliance with corporate information management policies. The solution is built to meet the security demands of enterprises and fully compatible with MDM systems from leading vendors such as MobileIron, Good Technology, IBM, Citrix and Oracle.\nEnds\nAbout Colligo\nColligo is the leading provider of data synchronization solutions for Microsoft SharePoint. The company’s award-winning, unified solution suite is used by over 5,000 organizations worldwide to increase productivity, streamline collaboration, and improve compliance, by delivering a consistent, secure experience across desktop and mobile devices. Colligo is a Microsoft Gold Application Development Partner with Global 500 customers including 4 of the top 5 global oil and gas companies, Microsoft, EDF Energy, Bayer and the US Department of Energy. For more information, please visit http://www.colligo.com .", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5jb2xsaWdvLmNvbQ=="], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-08T13:22:40.595+03:00", "highlightTitle": ""}