{"organizations": [], "uuid": "02f2bc652858da9a19c7b9eb875eac5daca4f6d1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "http://s3.reutersmedia.net/resources/r/?m=02&d=20151023&t=2&i=1089250971&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXNPEB9M0WM", "site_section": "http://www.reuters.com/news/technology", "section_title": "Technology News | Reuters.com", "url": "http://www.reuters.com/article/2015/10/23/us-inditex-ortega-profile-idUSKCN0SH22G20151023", "country": "US", "title": "Spanish recluse behind Zara briefly becomes world's richest man", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Spanish recluse behind Zara briefly becomes world's richest man | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T20:41:00.000+03:00", "replies_count": 0, "uuid": "02f2bc652858da9a19c7b9eb875eac5daca4f6d1"}, "author": "Elisabeth O'Leary", "url": "http://www.reuters.com/article/2015/10/23/us-inditex-ortega-profile-idUSKCN0SH22G20151023", "ord_in_thread": 0, "title": "Spanish recluse behind Zara briefly becomes world's richest man", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MADRID Amancio Ortega, who transformed clothing group Inditex from a tiny family dressmaker into Spain's biggest company, briefly overtook Bill Gates on Friday to become the world's richest man.\nAlthough a 10 percent surge in the share price of Microsoft later on Friday put the software firm's founder Gates back on top, the brief appearance of Ortega at the summit of the Forbes \"real time\" global rich list was hailed in Spain as a milestone.\nOrtega has turned Zara into a byword in chic for the money-conscious, transforming the apparel business with its \"fast fashion\" model. Affordable imitations of catwalk designs can move from drawing-board to stores within two weeks, and poor sellers are pulled off the shop floor even quicker.\nAt one point on Friday, Forbes put Ortega's fortune at $79.9 billion, pipping Gates. Later in the day, thanks to fluctuations in the euro as well as the surge in Microsoft, Gates had $79.3 billion and Ortega a mere $78.5 billion.\nBut whether or not he can hold on to the title of world's richest man, the 79-year-old's fortunes are blossoming as Inditex shares have risen nearly 40 percent this year.\nHe holds a 59.3 percent stake in what is now the world's biggest fashion retailer, ahead of Gap ( GPS.N ) and Hennes & Mauritz ( HMb.ST ). It grew from humble beginnings in the rainy northern region of Galicia to more than 6,000 stores in some 90 countries with a stable of brands from high-end label Massimo Dutti to homewear chain Zara Home.\nWith a capitalization of 104 billion euros ($110 billion), the group is only the third Spanish firm ever to be valued above 100 billion euros, after bank Santander ( SAN.MC ) and telecoms giant Telefonica ( TEF.MC ), both of which now lag well behind.\nSELF-MADE\nIn a country recently emerged from a recession that destroyed businesses and jobs, Ortega is a rare self-made mogul.\nThe son of a railway worker started his professional life at 14 as a delivery boy with a shirtmaker in the wind-swept northern city of Coruna. Within a few years he had set up a workshop making nightgowns, lingerie and babywear, and the first Zara opened in Spain in 1975.\nOrtega never gives interviews and is rarely photographed. He did not even attend the inaugural ringing of the stock market bell at the Madrid exchange when Inditex floated in 2001.\nIn person, Ortega is a persuasive and enthusiastic businessman, who despite progressively handing over the day-to-day management of the company over the last decade continues as an active part of it, people familiar with Inditex say.\nHe is known for selecting designs based on feedback from shop assistants who zero in on shoppers' reactions.\n\"If he speaks to a shop assistant and he likes what they had to say, he will pay more attention to that than to any of his managers,\" a former Inditex director told Reuters.\nSince his ex-wife and Inditex co-founder Rosalia Mera died suddenly in August 2013, there has been intense speculation over the succession.\nHis second wife Flora Perez, 61, sits on the board of Inditex and their daughter Marta, 31, who has undergone training at the firm, including working in a store, is widely expected to take over, although the firm won't confirm her as successor.\nOrtega's majority stake in Inditex is held through another company, Pontegadea Inversiones, which Ortega has also used to channel the steady flow of dividends and build up a real estate portfolio with assets worth 8 billion euros at end-2014.\nThis, as well as favorable inheritance laws in the Galician region, means that his heirs are likely to keep a tight control over the fashion empire.\n(Writing by Sonya Dowsett; Editing by Julien Toyer )", "external_links": [], "published": "2015-10-23T20:41:00.000+03:00", "crawled": "2015-10-23T20:08:24.477+03:00", "highlightTitle": ""}