{"organizations": [], "uuid": "78215d257230219ada385a5679ba7c9529755df4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.innovativeretailtechnologies.com", "main_image": "", "site_section": "http://www.retailsolutionsonline.com/rssfeeds/rssnews", "section_title": "Innovative Retail Technologies News", "url": "http://www.innovativeretailtechnologies.com/doc/apple-s-new-ad-blocker-app-is-creating-big-headaches-for-retailers-0001?atc~c=771+s=773+r=001+l=a", "country": "US", "title": "Apple's New Ad Blocker App Is Creating Big Headaches For Retailers", "performance_score": 0, "site": "innovativeretailtechnologies.com", "participants_count": 1, "title_full": "Apple's New Ad Blocker App Is Creating Big Headaches For Retailers", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T11:22:00.000+03:00", "replies_count": 0, "uuid": "78215d257230219ada385a5679ba7c9529755df4"}, "author": "ChristineKern", "url": "http://www.innovativeretailtechnologies.com/doc/apple-s-new-ad-blocker-app-is-creating-big-headaches-for-retailers-0001?atc~c=771+s=773+r=001+l=a", "ord_in_thread": 0, "title": "Apple's New Ad Blocker App Is Creating Big Headaches For Retailers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News Feature | October 1, 2015 Apple's New Ad Blocker App Is Creating Big Headaches For Retailers By Christine Kern , contributing writer Ad blockers like Crystal can systematically interfere with retailers’ mobile sites. \nWhile consumers have been clamoring for the ad blocking technology, retailers who rely on ad networks as a vehicle to connect with customers to make a sale are not quite as ecstatic about the new apps. \nApple has released one such ad blocking app, called Crystal, and consumers are excited about it because blocking ads will enable mobile web pages to load faster and remove annoying clutter, according to the Wall Street Journal . Other ad-blockers are also available from the App Store. \nAccording to Fortune magazine , some ad blockers have been proven to systematically interfere with certain retailers’ mobile sites in iOS 9. Chris Mason, CEO of Branding Brand, tipped Fortune off to the problems, and a subsequent investigation found that the ad-blocker Crystal routinely erases product pictures from retailers’ mobile sites, refuses to allow customers to add items to baskets and sometimes whites out the entire screen. \nA report by Dan Primack at the outlet shows that iPhones enabled with content blocking apps are unable to fully load the e-commerce sites of major retailers like Wal-Mart Stores, Inc., Lululemon and Sears. Crystal apparently cases glitches that block scripts that display important information to web site users. \nAd blockers are particularly troubling to retailers because they derive 60 percent of traffic through online ads that such apps are designed to keep out, according to Learn Bonds . \n\"This upcoming holiday season the vast majority of e-commerce dollars will come through mobile devices. But content-blockers are going to cause a lot of problems,\" Branding Brand CEO Chris Mason told Fortune . \n“First, the experience for customers will be lessened. Lots of sites will be missing content, have broken links or customers won’t be able to add certain items to their shopping carts. They’ll probably just think the site is broken, but it’s really their content blocker. Second, retailers will be data-blind, or at least data-dark. It will really impact their ability to make quick judgements.” \nThe apps could hamper the ability of retailers to use analytics platforms like Google Analytics and Adobe Omniture, which have become essential to monitoring consumer activity in the e-commerce business. Like what you are reading? Sign up for our free newsletter SIGN ME UP By clicking Sign Me Up, you agree to our Terms and that you have read our Privacy Policy .", "external_links": [], "published": "2015-09-30T11:22:00.000+03:00", "crawled": "2015-10-02T14:17:05.276+03:00", "highlightTitle": ""}