{"organizations": [], "uuid": "49456ca1dd290dbcd7166b46ef54a9d83ecb0847", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/n/k/7/e/image.related.afrArticleLead.620x365.gk3t93.png/1444274702235.jpg", "site_section": "http://www.afr.com/technology", "section_title": "Technology News | afr.com", "url": "http://www.afr.com/technology/amazon-considering-online-tv-service-20151007-gk3t93", "country": "AU", "title": "Amazon considering online TV service", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Amazon considering online TV service | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T04:08:00.000+03:00", "replies_count": 0, "uuid": "49456ca1dd290dbcd7166b46ef54a9d83ecb0847"}, "author": "Lucas Shaw", "url": "http://www.afr.com/technology/amazon-considering-online-tv-service-20151007-gk3t93", "ord_in_thread": 0, "title": "Amazon considering online TV service", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Jeff Bezos: Amazon already offers an on-demand video service akin to Netflix's popular streaming service. Bloomberg by Lucas Shaw Amazon.com is exploring the creation of an online pay-TV service to complement its existing video offerings and has reached out to major media companies including CBS and Comcast's NBCUniversal about carrying their channels, according to people familiar with the matter.\nAmazon's deliberations are preliminary, said the individuals, who asked not to be identified discussing negotiations. Some of the talks date back several months, according to one of the people.\nA live service would expand the online retailer's role in video entertainment and bring it into direct competition with pay-TV providers like Comcast and AT&T. Other companies are offering or experimenting with bundles of channels delivered over the Internet, including Sony, Dish Network and Apple.\nAmazon already offers an on-demand video service akin to the one offered by Netflix. Frost & Sullivan analyst Dan Rayburn wrote Tuesday on his StreamingMediaBlog that content owners were approached by the company, without identifying any. Amazon's recent agreement to acquire Elemental Technologies provides a platform to deliver live TV over the Web, he wrote.\n\"Those I have spoken with haven't disclosed how far along Amazon is with regards to a live OTT service,\" Mr Rayburn wrote. \"It's possible Amazon is simply looking at the economics of the business, which would involve them talking with content owners about costs.\"\nCraig Berman, a spokesman for Seattle-based Amazon, declined to comment.\nAmazon, the world's largest online retailer, has made entertainment a bigger part of its pitch to customers over the past few years, attracting viewers from conventional TV services.\nThe company created Prime Instant Video to lure more subscribers to its delivery service, offering movies and TV shows from major Hollywood studios. It also funds its own TV shows and movies.\n Pay-TV providers like Verizon Communications and Dish Network are responding with \"skinny bundles,\" cheaper services offering fewer channels than the typical pay-TV package. Apple is working on a similar project.\nAmazon has been considering offering live TV as far back as January 2014, when the Wall Street Journal reported an approach to media companies.", "external_links": [], "published": "2015-10-08T04:08:00.000+03:00", "crawled": "2015-10-09T00:20:52.233+03:00", "highlightTitle": ""}