{"organizations": [], "uuid": "aa5df21b9261e972c4bcf31a454cbd4312ff56a0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1145475/oracle-announces-new-oracle-hcm-cloud-capabilities-power-hr-transformation-", "country": "US", "title": "Oracle Announces New Oracle HCM Cloud Capabilities to Power HR Transformation", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "Oracle Announces New Oracle HCM Cloud Capabilities to Power HR Transformation", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T20:05:00.000+02:00", "replies_count": 0, "uuid": "aa5df21b9261e972c4bcf31a454cbd4312ff56a0"}, "author": "admin", "url": "http://www.freshnews.com/news/1145475/oracle-announces-new-oracle-hcm-cloud-capabilities-power-hr-transformation-", "ord_in_thread": 0, "title": "Oracle Announces New Oracle HCM Cloud Capabilities to Power HR Transformation", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Submitted by admin on 10/26/2015 @ 11:05 AM   Oracle Corporation \nSAN FRANCISCO, CA -- (Marketwired) -- 10/26/15 -- ORACLE OPENWORLD -- Oracle (NYSE: ORCL) \nThis week at Oracle OpenWorld, executives will showcase new capabilities in Oracle Human Capital Management (HCM) Cloud that are helping its customers drive HR transformation. Oracle's more than 5,000 HCM cloud customers are true modern HR leaders, using Oracle HCM Cloud to help transform their companies' HR operations to help their companies grow and be successful. \nBased on input from customers, Oracle is unveiling new and improved capabilities in Oracle HCM Cloud across the entire product suite that are designed to support digital transformation, extend global and industry functionality, and provide deep product enhancements. \n\"Oracle HCM Cloud continues to deliver features and functionality to help HR leaders and their teams address challenges of the modern workforce and support digital transformation within HCM,\" said Chris Leone, senior vice president, Oracle HCM Development. \"We not only enjoy sharing them with our customers at Oracle OpenWorld, but we also take time there to talk to our customers, learn what they need to be successful, and hear their suggestions for future improvements to Oracle HCM Cloud.\" \nSupporting Digital Transformation Throughout Oracle HCM Cloud users will benefit from digital enablers such as personalization, recommendations, embedded multi-media options, and community engagement capabilities to support a digital transformation of HR. \nNew investments in Oracle Learning cloud expand beyond social learning to embed learning throughout enterprise. The addition of tutorials and compliance learning allow customers to support various types of learning at any point within the Oracle cloud suite. \nOracle has improved the user experience throughout the entire Oracle HCM Cloud product suite, particularly in benefits self-service and a new work area for time management. Smart Navigation, a new, personalized method for navigating the application helps guide users to their most frequently used actions or recommended actions taken by others. And, users will find updated designs provide a consistent look and feel as they move between mobile and desktop. \nGlobal and Industry Expansion Global and industry extensions in the latest version of Oracle HCM Cloud make it easier for multi-national companies to deploy and configure the solution with out-of-the-box configuration and expanded localizations for 99 countries. It also includes enhancements to support HR transformation in specific industries Grade-Step progression supports companies with standardized grade scales such as manufacturing and retail. Additional capabilities include enhanced seniority rules and collective agreements to extend support for represented workers. \nProduct-specific enhancements Within Oracle HCM Cloud, updates are planned across several functional areas: Global Human Resources: Oracle is expecting to deliver a Global HR integration for customers who start their implementations with recruiting, simplifying high volume and complex recruiting scenarios. Oracle HCM Cloud also expects to offer support for ACA 2015 Compliance reporting along with audit reports and dashboards to support functionality. Talent Management: A new recruiting integration with LinkedIn mobile adds more flexibility to help recruit ideal candidates to help a company grow. Sub competency support in profiles and succession organization charts help map talent and plan for future growth or attrition. Workforce Rewards: Updates to Workforce Rewards include adding multiple components of pay, and predefined extracts to specific in-country third-party payrolls. Workforce Management: Integration of timeclock and webclock, mass approvals for time management, and easier exception clearing enable quicker workforce management actions. \nHCM Central @ OpenWorld This week during Oracle OpenWorld, Oracle is again holding HCM Central @ OpenWorld, a completely dedicated HR program located at The Palace hotel. In addition to product-focused sessions and hands-on labs, HCM Central features: Keynote : Chris Leone, senior vice president, Oracle HCM Development, will deliver a keynote Monday, October 26 at 11 a.m. PT, highlighting the digital enablers needed to support a true digital transformation of HR. Customer Panel : Gretchen Alarcon, group vice president, Oracle HCM Strategy, will host a panel of customers discussing their HR transformations. This session on Monday, October 26 at 1:30 p.m. PT features savvy modern HR leaders from Ruby Tuesday and Overhead Door, who will share details about their journey to the cloud. HCM Thought Leaders Panel : The \"Stay for Thursday\" closing keynote at HCM Central @ OpenWorld will include key industry thought leaders Vinnie Mirchandani, Holger Mueller, Mike Fauscette, and Mark Smith in what is sure to be a lively discussion on digital transformation for HR. \nAdditional Information", "external_links": [], "published": "2015-10-26T20:05:00.000+02:00", "crawled": "2015-10-26T21:59:51.734+02:00", "highlightTitle": ""}