{"organizations": ["University of Massachusetts", "UMass Amherst", "Northeast"], "uuid": "9ebf1db1d607ca9bb7f2f00cc481c84cf7facba2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eurekalert.org", "main_image": "http://media.eurekalert.org/multimedia_prod/pub/web/101809_web.jpg", "site_section": "http://www.eurekalert.org/rss/technology_engineering.xml", "section_title": "EurekAlert! - Technology, Engineering and Computer Science", "url": "http://www.eurekalert.org/pub_releases/2015-10/uoma-can102215.php", "country": "US", "title": "Creating a new market for Northeast forest products", "performance_score": 0, "site": "eurekalert.org", "participants_count": 0, "title_full": "Creating a new market for Northeast forest products", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T07:00:00.000+03:00", "replies_count": 0, "uuid": "9ebf1db1d607ca9bb7f2f00cc481c84cf7facba2"}, "author": "", "url": "http://www.eurekalert.org/pub_releases/2015-10/uoma-can102215.php", "ord_in_thread": 0, "title": "Creating a new market for Northeast forest products", "locations": ["Amherst"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Creating a new market for Northeast forest products UMass Amherst study to show viability of underused wood in construction timber panels University of Massachusetts at Amherst \nIMAGE: Clouston says cross laminated timber is revolutionizing the way wood is used in construction. These large slabs form floors, walls and roofs that can be used in structures one would... view more Credit: UMass Amherst \nAMHERST, Mass. - A new three-year study funded by a $390,000 National Science Foundation grant to researchers at the University of Massachusetts Amherst is expected to show that a strong new building material known as cross laminated timber (CLT) can incorporate currently underused wood species grown in the northeast United States, creating a market for local trees and opening jobs in rural communities. \nCLT is made from layers of dimension lumber laid crosswise, then glued and laminated together. Because it is a composite, it is forgiving of defects, which means that small-diameter and lower quality woods that are abundant in the Northeast offer real potential as source materials for CLT, says lead investigator Peggi Clouston, associate professor of environmental conservation at UMass Amherst. \nOne of her study goals is to show the structural viability of using underused, low-value woods in CLT panels. Clouston explains, \"This project will create a market for the trees, and by doing so defray the costs of thinning to help secure the future health of local forests. It will also create green jobs and spur economic development for the forest industry in the Northeast.\" \nFor this work, Clouston, with co-investigators Alexander Schreyer, also of UMass Amherst environmental conservation, and Sanjay Arwade of civil and environmental engineering, plan to demonstrate CLT processing and fabrication procedures that mix species and grades of lumber, experimentally characterize material properties and implement computer models for use in advanced engineering analysis and design. \nClouston says CLT is revolutionizing the way wood is used in construction. These large slabs of wood form floors, walls and roofs that can be used in structures one would never expect to be framed in wood, such as 10-story and even taller apartment buildings. \"It is poised to compete with steel and concrete,\" she notes \"I am proud that UMass Amherst recently broke ground for a new campus building that will employ CLT floors.\" \nShe adds that the campus's new Design Building will be one of the first CLT structures of its size in North America. It was designed as a demonstration of the university's commitment to sustainable practices. \"CLT offers significant environmental benefits,\" says Clouston. \"It stores carbon and creates far less pollution in manufacturing than steel or concrete, which is normally used to frame institutional structures.\" \nThe researchers say this work will set the stage for broader market development activities such as scaling up the manufacturing process, developing design specifications and reaching out to builders and architects so they are aware of CLT and its attributes. \"We hope our research will lead to one or more CLT production facilities in the Northeast,\" Clouston says. ### \nDisclaimer: AAAS and EurekAlert! are not responsible for the accuracy of news releases posted to EurekAlert! by contributing institutions or for the use of any information through the EurekAlert system.", "external_links": [], "published": "2015-10-22T07:00:00.000+03:00", "crawled": "2015-10-22T20:03:43.415+03:00", "highlightTitle": ""}