{"organizations": [], "uuid": "a372aff3ad52e34e97b55f300eac72c5da915470", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.businessspectator.com.au", "main_image": "", "site_section": "http://www.businessspectator.com.au/technology", "section_title": "Technology | Business Spectator", "url": "https://www.businessspectator.com.au/article/2015/10/15/dataroom/dataroom-am-nabs-insurance-moves", "country": "US", "title": "DataRoom AM: NAB's insurance moves", "performance_score": 0, "site": "businessspectator.com.au", "participants_count": 1, "title_full": "DataRoom AM: NAB's insurance moves | Business Spectator", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T14:50:00.000+03:00", "replies_count": 0, "uuid": "a372aff3ad52e34e97b55f300eac72c5da915470"}, "author": "Daniel Palmer", "url": "https://www.businessspectator.com.au/article/2015/10/15/dataroom/dataroom-am-nabs-insurance-moves", "ord_in_thread": 0, "title": "DataRoom AM: NAB's insurance moves", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NAB’s life insurance unit is again the subject of plenty of speculation, with the latest reports suggesting a long-awaited deal is now close.\nElsewhere, the race for Arrium’s Moly-Cop business narrows to five, Woodside Petroleum mulls a lift to its Oil Search bid and a favourite emerges in the auction of GE Capital’s local commercial loan portfolio.\nNational Australia Bank is seen edging close to terms for a sale of its life insurance arm to Japan’s Nippon Life . According to The Australian Financial Review , a transaction could be completed this month, a year after it first emerged that the unit -- which falls within the MLC operation -- was on the chopping block.\nThe on-again, off-again auction has seen analysts dish up valuations around $1.5 billion, but it has long been thought NAB is looking for something more in the order of $2bn-$2.5bn.\nIt’s potentially the latest move in a string of actions from the nation’s big banks to boost their capital ratios, with NAB rival Westpac on Wednesday finally yielding to pressure to raise cash. The big four member will tap investors for $3.5bn, with the raising to be carried out at a 13.6 per cent discount to its last traded price.\nAnother major deal in the works in the finance sector is the sale of the remainder of GE Capital’s local portfolio, with the AFR reporting Sankaty Advisors assuming favouritism from rival bidder Lonestar Capital ahead of an expected decision this week.\nMeanwhile, the brakes have been put on the auction of Fisher & Paykel Finance in New Zealand as the plans of preferred bidder Flexigroup are hit by a sharp drop in its share price over the past month. The weaker valuation impacts its ability to raise capital.\nStaying across the Tasman, the $900m-plus sale of Vector Energy assets has also been slowed as the seller offers more time for the final two bidders to develop their final offers. The race is between Hong Kong’s Cheung Kong Infrastructure and Powerco -- an AMP and QIC venture.\nCloser to home, Chile’s Sigdo Koppers has emerged as a suitor for Arrium’s Moly-Cop unit after Sigdo’s subsidiary recently abandoned plans to buy Bradken .\nThe field of suitors for the $1.5bn-$2bn mining consumables business has narrowed to five after eight were seen in the running at the start of the week. Blackstone and TPG Capital are other parties confirmed in the mix, with the identity of the remaining two parties unclear at this stage.\nIn energy, the AFR reports Woodside Petroleum is mulling a minor boost to its informal $11.6bn takeover offer for Oil Search . The WA-based predator has been rumoured to be raising its bid on several occasions since it was snubbed last month, but commentary from Woodside has suggested a significant lift to the offer is unlikely.\nIn beverages, Treasury Wine Estates will spend about $820 million to secure control of the majority of Diageo’s US and UK wine operations. The deal will be predominantly funded through a planned $486m capital raising.\nElsewhere, takeover target iSelect has confirmed Providence Equity Partners as its suitor. This week’s declaration of an informal bid is seen as a push to draw more interest from the market, with the AFR reporting investment bankers working double-time to drum up more prospective buyers.\nFinally, Domino’s Pizza Enterprises has paid around $50m to buy a French pizza chain, retailer Baby Bunting has delivered a shot in the arm to IPO candidates after surging 30 per cent on its ASX debut, while Link Group has acquired German-based Haubrok for less than $50m as a management roadshow continues ahead of its $2bn-plus float later this year.", "external_links": [], "published": "2015-10-15T14:50:00.000+03:00", "crawled": "2015-10-14T23:55:35.793+03:00", "highlightTitle": ""}