{"organizations": ["MasterCard", "Financial Technology Boom Spurs Rapid Rise", "Financial Technology Boom Spurs Rapid Rise in Use of fintech Products London & Partners"], "uuid": "f24d26bbb3f75db6661c23336d9fddd4e40336c3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.businesswire.com", "main_image": "", "site_section": "http://feed.businesswire.com/rss/home/?rss=G1QFDERJXkJeGVtQXg==", "section_title": "Business Wire Technology: Mobile/Wireless News", "url": "http://www.businesswire.com/news/home/20151014006282/en/London-Partners-Londons-Financial-Technology-Boom-Spurs", "country": "US", "title": "London & Partners: London's Financial Technology Boom Spurs Rapid Rise in Use of fintech Products", "performance_score": 0, "site": "businesswire.com", "participants_count": 0, "title_full": "London & Partners: London's Financial Technology Boom Spurs Rapid Rise in Use of fintech Products", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T06:00:00.000+03:00", "replies_count": 0, "uuid": "f24d26bbb3f75db6661c23336d9fddd4e40336c3"}, "author": "", "url": "http://www.businesswire.com/news/home/20151014006282/en/London-Partners-Londons-Financial-Technology-Boom-Spurs", "ord_in_thread": 0, "title": "London & Partners: London's Financial Technology Boom Spurs Rapid Rise in Use of fintech Products", "locations": ["Japan UK", "Tokyo", "UK", "Japan", "London"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Boris Johnson"], "text": "London & Partners: London's Financial Technology Boom Spurs Rapid Rise in Use of fintech Products London experiences fintech boom with investment in sector rocketing Wealthy, young Brits adopting financial technologies at a rapid rate making UK an attractive market for investment, says report by global accounting firm EY During trade mission to Japan, Mayor of London Boris Johnson MP, says London and Tokyo to collaborate in rapidly expanding financial technology sector as Japan prepares for 2020 Olympics London-based money transfer service WorldRemit announces expansion into Japan UK one of most advanced countries in world for cashless payments. Japan ready to embrace cashless payment technology, says new report by MasterCard October 14, 2015 11:00 PM Eastern Daylight Time \nLONDON--( BUSINESS WIRE )-- The capital’s booming financial technology sector is being driven by record levels of investment and the rapid adoption of fintech products by young and wealthy internet users, according to new research compiled by London & Partners, The Mayor of London’s promotional company, and EY. \nVenture capital investment in London fintech has rocketed from £24m in the whole of 2010 to £312m in the first six months of this year alone 1 . Over the last 10 years London has attracted 1000 international tech investment projects – which is not only more than any city, but more than any other country in Europe 2 . \nWhile investment is increasing, data being made available by global professional services firm EY, which is due to be released in full next year, shows that wealthy young Brits are adopting new fintech products at a rapid rate. In the last six months, 35 per cent of the United Kingdom’s online population has used at least one fintech product, and people’s usage increases in line with their income. The highest rate of fintech use is amongst those aged between 25 and 44 and earning over £50,000. \nUse of fintech products is growing rapidly - an additional 8% of the UK’s online population is set to start using fintech products over the next 12 months, in particular online payments and investment products - making the UK one of the most advanced and attractive fintech markets in Europe. \nFurther analysis by MasterCard shows the UK is one of the world’s leading economies for cashless transactions, being driven by financial technologies such as contactless payments on the London Underground. Spending by British consumers on their contactless cards has increased more than five-fold (560%) in the last 12 months 3 . \nMayor of London Boris Johnson, who is on a three-day trade mission to Japan, where he is meeting with senior politicians, business leaders and investors to foster collaboration between London and Japan, said: “Londoners are embracing financial technology as the use of contactless on the London Underground and mobile payments used throughout the city shows. As our expertise flourishes in this area, I am delighted companies based in London are taking their goods to Japan and we are now sharing that knowledge and experience with our Japanese counterparts to further fuel this innovation and growth.” \nImran Gulamhuseinwala, EY’s head of fintech in EMEIA, comments: “At approximately £20bn of revenues, the UK has a world leading fintech footprint. Crucially we estimate that as much as 20 per cent is generated from the high growth \"emergent\" fintech segment including online payments, online security and marketplace lending. Our analysis found that the UK is a very attractive location for fintech startups and that international fintech startups, founded outside of the UK often move here to use the UK market as a platform for internationalisation. We think there’s potential for the UK fintech industry to generate an additional £16bn of revenues by 2020.” \nDuring an event attended by the Mayor, at the British Ambassador’s residence in Tokyo, WorldRemit, a London-based money transfer service, also announced plans to make its mobile payment services available to the Japanese market later this year. The event was held to demonstrate that Japanese firms are ideally placed to collaborate with London’s growing financial technology sector in the run up to the Tokyo 2020 Olympic, particularly when it comes to embracing the latest in contactless payment methods that have been pioneered in London. \nIsmail Ahmed, founder and CEO of WorldRemit, which raised £65 million in venture capital funding earlier this year, said: “There is a tremendous opportunity in Japan for fintech to transform financial services for the better. \n“We’re offering Japan – which so far has been ill-served by the remittance market - a money transfer app that makes sending money abroad as easy as sending an instant message. As an early adopter of mobile technology, Japan is now poised to be a leader in mobile financial services.” \nFive of London’s 14 tech start-ups with over £65m of total funding are in the fintech sector and the city has been growing start-ups into global brands, such as Funding Circle and WorldRemit. London also has one of the most talented work forces in the world, with more skilled fintech workers than traditional giants such as Silicon Valley 4 , to support this rapid growth. \nEileen Burbidge MBE, Partner at Passion Capital and technology ambassador for London, added: “ London is rapidly becoming one of the most exciting cities in the world for fintech. Collaboration between London and Tokyo, two tech powerhouses, will accelerate engagement with financial technology ahead of the 2020 Olympics, spurring an opportunity for growth in other sectors.” \nGordon Innes, CEO at London & Partners added: “London’s status as the leading global financial centre and its world-class tech hub makes it an ideal destination for international fintech entrepreneurs and investors. London leads the way in the development of financial technologies such as mobile payments and digital currencies and is home to some of the world’s fastest growing fintech businesses such as TransferWise and WorldRemit. With a number of leading Japanese banks and technology companies already with a presence in London, Tokyo is a natural partner for London to share our fintech success and to collaborate on growing the sector in both countries ahead of events such as the 2020 Olympics.” \nThere is already a strong relationship between Japan and London, with Japanese banks, telecoms and pharmaceutical companies already well established in the city. The United Kingdom is the favourite place in Europe, and second only to the USA, for Japanese companies looking to invest worldwide. Japanese outbound M & A to the UK has reached a record £8 billion so far this year a figure which has doubled over the last five years 5 . \nSince 2010 Japanese companies have invested over £14 billion in over 630 worldwide tech companies, which is by far the most popular industry sector by number of deals. Japanese companies have invested £115million in 19 UK 6 tech start-ups in the last five years. \nRakuten, Japan’s largest internet services company, has invested in a number of European tech companies, including joining a £12m round of investment in London-based fintech company, Currency Cloud. \nHiroshi Mikitani, CEO Rakuten, Inc, said: “London’s standing as a leading global financial center is undisputed. Rakuten has already made a strategic investment in London fintech with Currency Cloud and we are closely watching London as a source of compelling investment opportunities, innovative technology and great people.” \nInvestment in Japan-based fintech companies has also increased rapidly by 106 per cent between 2013 and 2014 7 alone. While purchases on credit cards in Japan are expected to pass £328 billion in 2020 8 due to increased uptake from residents and also foreign visitors who prefer cashless payment solutions for the Tokyo Olympics. \nMasterCard analysishas predicted that Japan, with its leading financial services centre in Tokyo and increasing support from the government for new technologies, is one of the Asian countries most ready to embrace advances in cashless payment technology 9 . \nMark Barnett, President of MasterCard UK and Ireland, commented : “The UK and Japan have great similarities as developed economies with urban areas of population density, but differ when it comes to the usage of cash and electronic payments. In the UK, MasterCard has partnered with the likes of Transport for London to bring payment innovation to the public. However, our analysis suggests that the two nations are not so different when it comes to readiness to evolve payment choices, so there is a huge opportunity to work together and increase electronic payments in Japan, especially ahead of premier international sporting events such as the 2020 Tokyo Olympics and Rugby World Cup 2019.” ENDS \nNotes to Editors \nAbout London & Partners. \nLondon & Partners is the official promotional company for London. We promote London and attract businesses, events, congresses, students and visitors to the capital. Our aims are to build London’s international reputation and to attract investment and visitor spend, which create jobs and growth. \nLondon & Partners is a not-for-profit public private partnership, funded by the Mayor of London and our network of commercial partners. For more information visit www.londonandpartners.com \nAbout EY \nEY is a global leader in assurance, tax, transaction and advisory services. The insights and quality services we deliver help build trust and confidence in the capital markets and in economies the world over. We develop outstanding leaders who team to deliver on our promises to all of our stakeholders. In so doing, we play a critical role in building a better working world for our people, for our clients and for our communities. \nEY refers to the global organization, and may refer to one or more, of the member firms of Ernst & Young Global Limited, each of which is a separate legal entity. Ernst & Young Global Limited, a UK company limited by guarantee, does not provide services to clients. For more information about our organization, please visit ey.com. \nAbout WorldRemit \nThe company was founded in 2010 by Ismail Ahmed, a remittance specialist and former compliance advisor to the United Nations. Personal experience of using money transfer agents convinced Ismail that technology could improve the sending process, enhance compliance and reduce costs to the customer. \nIn addition to offering bank deposit and cash pick-up options, WorldRemit is the leading provider of instant transfers to Mobile Money wallets. In January 2015, the company announced a partnership with telecoms giant MTN, enabling transfers to all 16 of the company’s Mobile Money services. Customers can also send mobile airtime top-ups. More than 50% of all WorldRemit transfers to Africa are currently received as Mobile Money or mobile airtime top-up. \nWorldRemit’s London headquarters have grown from around 40 staff in early 2014, to its current headcount of more than 150. Denver, Colorado was unveiled as WorldRemit’s U.S. base in December 2014, with plans to recruit more than 200 staff. WorldRemit is a member of the Future Fifty, a group of high-growth technology companies, and part of the Tech City UK organization. \nAbout Dealogic \nDealogic offers integrated content, analytics, and technology via targeted products and services to top financial firms worldwide. Whether working in capital markets, sales and trading, banking, or compliance, firms rely on the Dealogic platform to connect and more effectively identify opportunities, execute deals, and manage risk. With more than 30 years’ experience and a deep understanding of financial markets, Dealogic is a trusted global partner. \nDealogic provides the most timely and accurate data available and is relied on by more than 100 of the world’s financial publications for the most insightful analysis of investment banking. \nAbout Rakuten \nRakuten, Inc. (TOKYO: 4755) is one of the world's leading Internet services companies, offering a wide variety of services for consumers and businesses with a focus on e-commerce, finance, and digital content. Since 2012, Rakuten has been ranked among the world’s ‘Top 20 Most Innovative Companies’ in Forbes magazine’s annual list. Rakuten is expanding worldwide and currently operates throughout Asia, Europe, the Americas and Oceania. Founded in 1997, Rakuten is headquartered in Tokyo, with nearly 12,000 employees worldwide. \nRakuten internet finance is one of three key strategic pillars and a major contributor to the Rakuten Group. Rakuten Card has been ranked number one in Japan in customer satisfaction for six consecutive years* and has recently expanded to the US and Taiwan. Rakuten Bank holds the highest number of accounts among internet banks in Japan, while Rakuten Securities is dynamically developing best-in-class net-based securities services. In 2013, Rakuten expanded into the rapidly growing online life insurance market. \n*Service Productivity & Innovation for Growth (SPRING), 2014 Japanese Customer Satisfaction Index \n1 London & Partners and CB Insights \n2 EY – Tech Sector Analysis June 2015 \n3 MasterCard August 2015 \n4 South Mountain Economics 2014 \n5 Dealogic analysis Oct 2015 \n6 Dealogic analysis Oct 2015 \n7 Accenture Fintech Report Oct 2015 \n8 Accenture Fintech Report Oct 2015 \n9 MasterCard Cashless Journey Oct 2015 Contacts", "external_links": [], "published": "2015-10-15T06:00:00.000+03:00", "crawled": "2015-10-15T06:11:14.378+03:00", "highlightTitle": ""}