{"organizations": [], "uuid": "50045dd1d7c782febe007ad071579a9903ebf020", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fcw.com", "main_image": "", "site_section": "http://fcw.com/rss-feeds/all.aspx", "section_title": "FCW: The business of federal technology", "url": "https://fcw.com/articles/2015/10/26/it-budget-funding.aspx", "country": "US", "title": "Funding IT projects in an era of constrained budgets", "performance_score": 0, "site": "fcw.com", "participants_count": 0, "title_full": "Funding IT projects in an era of constrained budgets", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T21:12:00.000+02:00", "replies_count": 0, "uuid": "50045dd1d7c782febe007ad071579a9903ebf020"}, "author": "", "url": "https://fcw.com/articles/2015/10/26/it-budget-funding.aspx", "ord_in_thread": 0, "title": "Funding IT projects in an era of constrained budgets", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mark Rockwell"], "text": "Funding IT projects in an era of constrained budgets By Mark Rockwell Oct 26, 2015 \nMeeting federal agencies' IT needs takes creative, shrewd thinking, according to top IT managers who spoke at ACT-IAC's Executive Leadership Conference in Williamsburg, Va. \n\"We have to do things differently,\" said Anne Rung, administrator of the Office of Federal Procurement Policy, in a keynote panel discussion on Oct. 26. Going through 2,000 pages of federal acquisition regulations, spending a year developing an IT solution, then another year putting together a contract \"won't work anymore.\" \nWith budgets and appropriations tight, getting funding for specific IT projects is a particular challenge for agencies, according to other panel participants. However, involving financial executives earlier in the process can help. \n\"Get the budget people upfront,\" said Kathleen Turco, chief financial officer at the Veterans Health Administration. Financial officers can sometimes find money for a project if they are included in discussions, she added, and the new acquisition law should be fostering closer collaboration between financial officers and CIOs to determine how to fund the most pressing projects. \nRung said another strategy for keeping costs down and efficiently completing projects is using existing governmentwide IT contracts instead of issuing expensive one-off contracts. \nIdentifying where agencies have the biggest issues with procurement will also help, she said. OFPP expects to hear back from contractors about their experiences with federal procurement in November, under the agency's Acquisition 360 program . Rung unveiled that tool in March as a way to get transaction-based feedback for major IT acquisitions. The program solicits feedback in several directions: from contractors to the government, from the program office to the contracting office and from the contracting office to the program office. \nThe goal is to aggregate data to learn what is working and where improvements are needed, she said. \nMary Davie, assistant commissioner of the General Services Administration's Office of Integrated Technology Services, said the agency's category management initiative is also a key part of the effort to make all government procurement more efficient. One of the most important components of category management -- the Acquisition Gateway -- is growing fast, GSA officials said at the conference. \nThe gateway aggregates a wide array of information on products and services bought by the federal government. Laura Stanton, acting assistant commissioner of GSA's Office of Strategy Management, said the gateway has 17 product categories, up from only three (IT hardware, IT software and administrative support) last October. \nGetting and retaining new IT workers can be as tricky as acquiring and using new technology. In another panel discussion, Federal Communications Commission CIO David Bray said attracting new talent could involve tapping pools of workers with particular skills for particular projects rather than hiring a specific person for a specific job. \nFor example, Bray said, the Taiwanese government hires several thousand workers to help write code for projects. \nHe added that another approach could be to hire workers for federal service in general, and then workers with a particular set of skills could be assigned to agencies that need them. About the Author \nMark Rockwell is a staff writer covering acquisition, procurement and homeland security. Contact him at mrockwell@fcw.com or follow him on Twitter at @MRockwell4 . <>", "external_links": [], "published": "2015-10-26T21:12:00.000+02:00", "crawled": "2015-10-26T23:01:34.789+02:00", "highlightTitle": ""}