{"organizations": [], "uuid": "d1fc4d72b613a768ee6a83186867d8b71f6da0f0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.innovativeretailtechnologies.com", "main_image": "", "site_section": "http://www.retailsolutionsonline.com/rssfeeds/rssnews", "section_title": "Innovative Retail Technologies News", "url": "http://www.innovativeretailtechnologies.com/doc/the-store-altering-impact-of-omni-channel-0001?atc~c=771+s=773+r=001+l=a", "country": "US", "title": "The Store-Altering Impact Of Omni-Channel", "performance_score": 0, "site": "innovativeretailtechnologies.com", "participants_count": 1, "title_full": "The Store-Altering Impact Of Omni-Channel", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T18:11:00.000+03:00", "replies_count": 0, "uuid": "d1fc4d72b613a768ee6a83186867d8b71f6da0f0"}, "author": "MattPillar", "url": "http://www.innovativeretailtechnologies.com/doc/the-store-altering-impact-of-omni-channel-0001?atc~c=771+s=773+r=001+l=a", "ord_in_thread": 0, "title": "The Store-Altering Impact Of Omni-Channel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Magazine Article | October 20, 2015 The Store-Altering Impact Of Omni-Channel To access this content, please Register or Sign In. By Matt Pillar , senior executive editor, Innovative Retail Technologies \nNovember 2015 Innovative Retail Technologies \nAssociate responsibilities, commerce design are ripe for change at the hands of omni-channel demand. \nThe consumer appetite for a channel-agnostic retail experience is forcing big change on the store, and according to Brian Kinsella, VP of order management at Manhattan Associates, the in-store associate sits at the nucleus of that change. They’ve always had to multitask, he says, but the advent of omni-channel and the customer expectations that come with it have considerably exacerbated the situation. “What differs in the future is that store associates will need to toggle between, for example, handling an exchange of an order bought online, picking an item off the store floor and readying it for a same-day delivery driver, checking someone out on the store floor, and perhaps applying a coupon stored in her customer profile,” says Kinsella. “That’s in addition to other tasks which will need to be interleaved smoothly into the store associate’s typical day, including corresponding with a customer prior to a fitting appointment, batch picking two dozen orders before the parcel shipment deadline at the end of the day, or looking through a customer’s entire purchase history to answer a question or make a recommendation.” The point, he says, is that store associates need not just to be more proficient at more things, but that none of these activities should feel like an exception or “edge case.” That’s where technology shines as the enabler. “The technologies that store associates use, whether mobile or at a fixed station, have to build sales, service, inventory, and fulfillment capabilities in at their very core, and they have to allow for adaptation and experimentation.” Register Today. It's Fast And Free. \nThe content you requested is only available to registered users of Innovative Retail Technologies. By registering now, you'll get exclusive access to this piece of content and thousands of additional articles and product reviews across our entire network of sites. Already Registered? Sign In.", "external_links": [], "published": "2015-10-20T18:11:00.000+03:00", "crawled": "2015-10-21T03:00:23.242+03:00", "highlightTitle": ""}