{"organizations": [], "uuid": "cad8919f7c5955ea9fd9763a634a3af421b836c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.barchart.com", "main_image": "", "site_section": "http://www.barchart.com/stocks/news.php?feed=AP,PRNW&subject=STK.TECH&date=20150916115959&section=tech", "section_title": "Stocks - News &amp; Commentary | Technology &amp; Comp", "url": "http://www.barchart.com/headlines/story/10833846/intermap-2-1m-mapping-services-solutions-contract-expanded-to-3-2m", "country": "US", "title": "Intermap $2.1M Mapping Services Solutions Contract Expanded to $3.2M", "performance_score": 0, "site": "barchart.com", "participants_count": 1, "title_full": "Intermap $2.1M Mapping Services Solutions Contract Expanded to $3.2M", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "cad8919f7c5955ea9fd9763a634a3af421b836c9"}, "author": "PRNW", "url": "http://www.barchart.com/headlines/story/10833846/intermap-2-1m-mapping-services-solutions-contract-expanded-to-3-2m", "ord_in_thread": 0, "title": "Intermap $2.1M Mapping Services Solutions Contract Expanded to $3.2M", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "DENVER, CO , Sept. 16, 2015 /PRNewswire/ - Intermap (TSX: IMP), (ITMSF:BB) , a leading provider of location-based solutions, today announced that the Company has received a US$1.1 million expansion to a US$2.1 million airborne radar mapping services solution contract previously announced on June 5, 2015 , increasing the total value of the contract to $3.2 million .\nIntermap is using its proprietary Interferometric Synthetic Aperture Radar (IFSAR) technology to collect orthorectified radar imagery and high resolution elevation data to enhance the customer's existing geospatial map database. This new dataset will be used for improved disaster planning, resource management, security interests, and infrastructure planning. The final deliveries of the dataset are expected to be substantially complete by the end of the third quarter 2015.\n\"Because of its unique capabilities, Intermap's Orion Platform ® based IFSAR radar mapping technology is considered to be the best and most reliable approach for the customer's requirements,\" said Todd Oseth , president and CEO of Intermap. \"This expansion contract is a great endorsement for the quality of product that Intermap's unique solutions approach is able to deliver.\"\nAbout Intermap\nHeadquartered in Denver, Colorado - Intermap ( www.intermap.com ) is an industry leader in geospatial solutions on demand with its secure, cloud based Orion Platform™. Through its powerful suite of 3DBI applications and proprietary development of contiguous databases that fuse volumes of geospatial data into a single source, the Orion Platform is able to provide location- based solutions for customers in diverse markets around the world. For more information please visit www.intermap.com .\nIntermap Reader Advisory\nCertain information provided in this news release constitutes forward-looking statements. The words \"anticipate\", \"expect\", \"project\", \"estimate\", \"forecast\" and similar expressions are intended to identify such forward-looking statements. Although Intermap believes that these statements are based on information and assumptions which are current, reasonable and complete, these statements are necessarily subject to a variety of known and unknown risks and uncertainties. You can find a discussion of such risks and uncertainties in our Annual Information Form and other securities filings. While the Company makes these forward-looking statements in good faith, should one or more of these risks or uncertainties materialize, or should underlying assumptions prove incorrect, actual results may vary significantly from those expected. Accordingly, no assurances can be given that any of the events anticipated by the forward-looking statements will transpire or occur, or if any of them do so, what benefits that the Company will derive therefrom. All subsequent forward-looking statements, whether written or oral, attributable to Intermap or persons acting on its behalf are expressly qualified in their entirety by these cautionary statements. The forward-looking statements contained in this news release are made as at the date of this news release and the Company does not undertake any obligation to update publicly or to revise any of the forward-looking statements made herein, whether as a result of new information, future events or otherwise, except as may be required by applicable securities law.\nSOURCE Intermap Technologies Corporation", "external_links": [], "published": "2015-09-16T03:00:00.000+03:00", "crawled": "2015-10-11T21:53:40.282+03:00", "highlightTitle": ""}