{"organizations": ["EPA"], "uuid": "ed4702b29cc34bba7af0ae581bc42b4810ec9524", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "phys.org", "main_image": "http://cdn.phys.org/tmpl/v5/img/phys_308px.png", "site_section": "http://www.physorg.com/rss-feed/", "section_title": "Phys.org - latest science and technology news stories", "url": "http://phys.org/news/2015-10-court-epa-ship-ballast-dumping.html", "country": "US", "title": "Court orders EPA to revise ship ballast dumping regulations", "performance_score": 0, "site": "phys.org", "participants_count": 0, "title_full": "Court orders EPA to revise ship ballast dumping regulations", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T10:40:00.000+03:00", "replies_count": 0, "uuid": "ed4702b29cc34bba7af0ae581bc42b4810ec9524"}, "author": "", "url": "http://phys.org/news/2015-10-court-epa-ship-ballast-dumping.html", "ord_in_thread": 0, "title": "Court orders EPA to revise ship ballast dumping regulations", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["John Flesher"], "text": "Court orders EPA to revise ship ballast dumping regulations October 6, 2015 by By John Flesher \nA federal appeals court ordered the government Monday to rewrite its regulations on ballast water discharges from ships, one of the leading culprits in the spread of invasive species across U.S. waterways. \nEnvironmental groups contended in a lawsuit that an industry-wide permit issued by the U.S. Environmental Protection Agency two years ago wasn't tough enough to prevent vessels from introducing additional harmful organisms such as zebra and quagga mussels, which have caused heavy economic and ecological damage in the Great Lakes and spread as far as the West Coast. \nThe 2nd U.S. Circuit Court of Appeals sided mostly with the environmentalists, saying the EPA erred in numerous ways, including settling for international limits on live organisms in ballast water when technology was available to meet tougher standards. \nThe court also faulted the agency for failing to consider onshore treatment of ballast water, exempting vessels built before 2009 that operate only in the Great Lakes from the discharge limits, and requiring inadequate monitoring of discarded water to make sure it complies with the rules. \n\"This decision is welcome news for the millions of families, anglers, hunters, paddlers, beach-goers, and business owners, who have borne the brunt of damages from aquatic invasive species for far too long,\" said Marc Smith, policy director for the National Wildlife Federation, one of the groups that had sued. \nThe EPA referred a request for comment to the U.S. Department of Justice, where spokesman Wyn Hornbuckle said the decision was under review. \nShips take on ballast water to maintain stability in rough seas, or as cargo is loaded and unloaded. Water sucked into ballast tanks while vessels are in port can habor fish, mussels, aquatic plants and other organisms, which are hauled to distant locations and released. More than 21 billion gallons of ballast water are dumped in the U.S. each year. \nSome of the organisms have no natural predators in their new environments, allowing them to multiply rapidly, out-compete native species for food and habitat, spread disease and destabilize ecosystems. \nBallast was long exempt from regulation under the Clean Water Act, a policy the EPA abandoned in response to environmentalists' lawsuits. \nIts permit issued in 2013 put ceilings on the concentration of live organisms in ballast water using standards proposed by the International Maritime Organization and adopted by the U.S. Coast Guard in 2012. Additionally, it required transoceanic commercial vessels to exchange their ballast water 200 miles from the U.S. shoreline or rinse their tanks if empty, in hopes that the salty water would kill any freshwater organisms left behind. \nIn its 3-0 ruling Monday, a panel of the New York-based appeals court agreed with the National Resources Defense Council, Northwest Environmental Advocates, the Center for Biological Diversity and the National Wildlife Federation that the EPA \"acted arbitrarily and capriciously\" in crafting the permit. \nInstead of adopting the international standards, the agency could have based its live-organism limits on what the best available technology could achieve, the judges said. Systems for killing creatures in ballast water have been devised using methods such as filtration, removing oxygen from the water, zapping it with ultraviolet light or adding chlorine. \nThe EPA's Science Advisory Board found that while no system existed for completely sterilizing ballast water, those technologies potentially could be lethal enough to meet standards 10 times stronger than the international ones, the judges said. \nOn another issue, the EPA said it didn't consider using onshore facilities such as sewage and drinking water treatment plants for cleansing ballast water because it knew of none capable of meeting the discharge standards. But the judges said the agency had \"turned a blind eye\" to the possibility and had discouraged the science board from exploring it. \nThe board's report said the use of onshore facilities \"appears to be technically feasible\" and could have numerous advantages over shipboard systems, the judges said. \nThe appeals panel said the existing permit will remain in place until the EPA produces a new one. The panel set no deadline, but the existing permit expires in 2018.", "external_links": [], "published": "2015-10-06T10:40:00.000+03:00", "crawled": "2015-10-06T10:41:38.626+03:00", "highlightTitle": ""}