{"organizations": ["MOL", "Hapag-Lloyd", "APL", "OOCL"], "uuid": "7fb03efd484f9980d43c717296a2be97ad39c76d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.porttechnology.org", "main_image": "http://www.porttechnology.org/images/made/images/uploads/news/drewry_budgeting_essential_to_optimise_ship_utilisation_331_220.jpg", "site_section": "http://www.porttechnology.org/rss_feeds/news/", "section_title": "Port Technology International - News", "url": "http://www.porttechnology.org/news/drewry_budgeting_essential_to_optimise_ship_utilisation/", "country": "GB", "title": "Drewry: Budgeting Essential to Optimise Ship Utilisation", "performance_score": 0, "site": "porttechnology.org", "participants_count": 0, "title_full": "Drewry: Budgeting Essential to Optimise Ship Utilisation", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T11:02:00.000+03:00", "replies_count": 0, "uuid": "7fb03efd484f9980d43c717296a2be97ad39c76d"}, "author": "", "url": "http://www.porttechnology.org/news/drewry_budgeting_essential_to_optimise_ship_utilisation/", "ord_in_thread": 0, "title": "Drewry: Budgeting Essential to Optimise Ship Utilisation", "locations": ["North America", "Asia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "05 Oct 2015 Cargo Volumes and Throughput , Container Handling , Containers , Going Places , Port Planning , Ports , Shipping The G6 Alliance carriers (APL, Hapag-Lloyd, HMM, MOL, NYK and OOCL) announced their ‘Winter Program’ recently for the Asia to North America trade, that will ultimately see two services – one each to the West and East coasts – suspended for an indefinite period. \nThe only difference this time around is the timing as this year the alliance has brought forward the suspension of its Asia-West Coast North America CC2 loop by a couple of weeks. \nHow long the carriers decide to mothball the services will depend on how buoyant volumes are looking in the early part of 2016, but recent history suggests that they will not be reactivated for a few months at least as both the CC2 and merged SCE and NYE loops of the G6 alliance were not restarted until May, 2015. \nThe difficulty in matching supply with demand is made even harder for carriers by virtue of the lumpy nature of volumes that tend to peak and trough throughout the year. \nThe conundrum for carriers is therefore how best to accommodate the anticipated peak demand on any given route with sufficient capacity and then avoid costly overcapacity during non-peak periods. \nDrewry believes that while volumes may be patchy throughout the year, the seasonality is at least relatively predictable, which has enabled these so-called ‘slack season’ capacity cut-back programmes to become a regular feature for the industry. \nPreviously, these winter cut-backs were largely the preserve of the Transpacific alone, but since the global financial crash it has spread to other major East-West trades. \nThe severity of the capacity reductions in any given year is a sign of how far the supply-demand balance had gone out of kilter and also an early indication of carriers’ expectations for the year ahead. \nDrewry’s capacity forecast for the 2016 slack season is much the same as it was last year at approximately -2% for each trade. The G6 alliance’s Transpacific announcements were already factored in, such was our expectation that history would be repeated. \nIt should be noted that Drewry’s forecast is based on an expectation of what will happen (taking into account new deliveries, cascading and a general reluctance to idle certain size ships) rather than what is needed for carriers to turn things around.", "external_links": [], "published": "2015-10-05T11:02:00.000+03:00", "crawled": "2015-10-05T13:41:31.291+03:00", "highlightTitle": ""}