{"organizations": [], "uuid": "bf7f6b1e5b007c0940f34ca52cd500ecdbc7a609", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "cio.economictimes.indiatimes.com", "main_image": "http://economictimes.indiatimes.com/photo/How-a-techie-gave-up-a-cushy-business-in-San-Jose-offered-distressed-farmers-a-new-lease-of-life-in-Mandya/49524308.cms", "site_section": "http://cio.economictimes.indiatimes.com/rss/corporate-news", "section_title": "corporate - Information Technology News | Latest IT Industry News, Information and Updates: ET CIO : ETCIO.com", "url": "http://cio.economictimes.indiatimes.com/news/corporate-news/how-a-techie-gave-up-a-cushy-business-in-san-jose-offered-distressed-farmers-a-new-lease-of-life-in-mandya/49524308", "country": "IN", "title": "How a techie gave up a cushy business in San Jose & offered distressed farmers a new lease of life in Mandya", "performance_score": 0, "site": "indiatimes.com", "participants_count": 0, "title_full": "How a techie gave up a cushy business in San Jose & offered distressed farmers a new lease of life in Mandya", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T07:45:00.000+02:00", "replies_count": 0, "uuid": "bf7f6b1e5b007c0940f34ca52cd500ecdbc7a609"}, "author": "", "url": "http://cio.economictimes.indiatimes.com/news/corporate-news/how-a-techie-gave-up-a-cushy-business-in-san-jose-offered-distressed-farmers-a-new-lease-of-life-in-mandya/49524308", "ord_in_thread": 0, "title": "How a techie gave up a cushy business in San Jose & offered distressed farmers a new lease of life in Mandya", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "#farmers How a techie gave up a cushy business in San Jose & offered distressed farmers a new lease of life in Mandya Rustling up the rural cooperative was not hard. Madhuchandan had the eager support of progressive farmer Venkatesh from Panakanahalli in Mandya. | ET Bureau | 25 October 2015, 11:15 AM IST Follow ETCIO Share The story begins with a 37-year-old software developer who decided to give back to what he came from. In 13 months, this decision has rippled and changed the lives of 300 farmers in his home district of Mandya in Karnataka, through a rural cooperative and an enterprise that will generate annual turnover of at least Rs 36 crore for them.The green Mandya district has seen the highest number of farmer suicides in Karnataka this year, mainly due to debt. With his arrival, the local boy's farmer-friends see a glimmer of hope, a means to better their lives and pull the district's agriculture sector out of the morass it is in. They want to propagate his ideas, scale up his model and spread the goodies to the whole region.Meet Madhuchandan SC, \"Madhuanna\" to the Mandya farmers. Till August 2014, he was living up the American dream, a life of comfort and ease with his wife and daughter in San Jose, California. He travelled the world, worked with various companies and became the cofounder of a company in San Jose. He had the world at his feet, as the product he designed for this company has become the leader in the field.\nAt that point in time, MC as he signs himself was on a high. \"A very big IT company had junked their own product and replaced it with the one I developed,\" he recalled to ET Magazine.With the high came the anti-climax. \"I felt I had already done all that I wanted to in the software field. What more was left? Be chief executive of yet another company? That was not fun, anymore.\"Epiphany struck on the morning of August 1, 2014. MC told his wife, Archana, his classmate from their engineering college in Mandya: \"I want to go back to Mandya and live the life of an organic farmer. Do you want to go live that life only after we are old, or can we do it when we still have some energy left?\" Return to Roots Archana and their daughter, 11-year-old Aditi, thought about it for the whole day. Aditi's school year was to begin in 15 days. By evening, Archana and Aditi gave MC a 'yes' for the move. And just like that he snapped all links: booked tickets to leave for Bengaluru, within 10 days, on August 10; paid thousands of dollars against the pending mortgage for his house and SUV; left behind or gave away all that he owned and returned to his roots.\"I was always crazy about farming. Now I wanted to live that dream in a small farmhouse on our land in our village,\" he said. When he came back, though, the son of a former University of Agricultural Sciences vice - chancellor (S Chikkadevaiah) found that everything was not as simple as he had planned. He nosed around in Mandya, realised that farmers were distressed despite owning irrigated land and that there was no marketing mechanism for organic or even for the district's major crops of sugarcane and paddy.That set aside his immediate plans of a small farmhouse near his village Sunaganahalli in Mandya. He settled his daughter and wife in Bengaluru and determinedly began working on a solution to the situation in Mandya an out-of-government one. He activated the strong roots and ground-level network that he has in Mandya, which was represented by his late maternal uncle SD Jayaram, a minister in the Janata Dal government in Karnataka in the late '90s.Then came a year of hard work, endless conceptualising, brainstorming with friends, reaching out to farmers. The germ of an idea surfaced: that there was a big market for organic products in Bengaluru, just two hours away. Several farmers, influenced by zero budget natural farming pioneer Subhash Palekar's workshops in the region, were already practising it.All that was necessary was an intermediary to supply the product to the consumer. MC didn't let any grass grow under his feet. A friend in Mandya suggested he consult Narayana A, a professor at the Azim Premji University in Bengaluru, a London School of Economics alumnus. Narayana suggested that a cooperative society to source and market organic farm products would be the best business model. Set the Ball Rolling Rustling up the rural cooperative was not hard. MC had the eager support of progressive farmer Venkatesh from Panakanahalli in Mandya. Panakanahalli had witnessed a suicide by a 35-year-old farmer, Mahesh, on June 30, and was also visited by Congress vice-president Rahul Gandhi on October 9. Venkatesh, nicknamed \"Sakkare\" (sugar) Venkatesh, has been growing sugarcane the organic way from over a decade. He is aware of all the ground level problems and his solution is: \"We need to go organic, use natural methods to retain fertility of our soil, generate useful byproducts and ensure that it goes to the right market,\" he told ET Magazine.Venkatesh and MC teamed up to put together the Mandya Organic Farmers Cooperative Society comprising progressive farmers, ayurvedic doctors and agriculture scientists. The youngest member is 22-year-old Sachin from Maddur taluk, and the oldest is 62-year-old Doddalingaiah, both equally enthusiastic on the subject. Simultaneously, MC got four friends from Mandya, all leading lights in the IT sector, to pool together Rs 1 crore in a company, Organic Mandya, which took on the job of planning how to reach the 22 products grown in the district to customers.With the bubbling enthusiasm of a 10-yearold, MC translated the dream into action by setting up an integrated organic zone at Budanur, Mandya, on the Bengaluru-Mysuru state highway. This is the second-most passenger-heavy highway in India after Pune-Mumbai MC did a study and the location was ideal to generate a lot of eyeballs. The zone has a supermarket, with a farm growing organic sugarcane, vegetables, coconut, pulses and oilseeds planned right next to it. There is a restaurant selling only organic food, shops selling organic juice, a one-stop-shop for terrace gardening. There is even equipment set up to churn out fresh oil: the shopkeeper puts groundnut or sunflower seeds into it and the customer gets fresh oil instantly. Opened on October 1, this integrated zone has generated a turnover of over Rs 12 lakh so far.\"It is all about design and packaging,\" MC pointed out. He applied his corporate knowledge to the farm marketing field. \"If you call jaggery as just that, it won't sell. We worked on promoting joni bella, a liquid form of jaggery. This is a stage just before the jaggery solidifies. We figured out how to preserve it in this form and sell it as a new product. It has high calcium and iron content, tastes better than honey and can be used in any dish.\" The unique product, priced at Rs 65 for 250 grams, has sold like hot cakes, with customers coming back for more. More in the Making MC also set up a Facebook page for the company and a mail order catalogue in May, with an initial base of 1,000 customers, prior to opening the supermarket. He sent out mails to his friends, offering 32 organic items including organic rice, pulses, millets, a healthy malt drink, sea salt, sweets and joni bella, as a monthly dinasi (grocery) package for Rs 3,000. The response has been overwhelming. \"All I need to do is get 10,000 families on this platform and we will generate Rs 36 crore a year, more than enough to support a taluk of farmers,\" MC contended. \"We will do it,\" he added, with careless confidence.The farmers' cooperative has set off the ground work to fulfil the orders that are pouring in. They bid for and won the rights to operate an organic jaggery farm at the state government's VC farm in Mandya to make the jaggery byproducts. This farm is buying sugarcane from organic farmers at an unheard-of Rs 3,501 per tonne, about twice the amount they get from the state's sugarcane factories and not paid anywhere in India. \"My fellow directors at the cooperative asked me how we can pay this much and still work it out. But the market is there, we are earning that money with profit and just passing on some of it to the farmers. We are showing practically that it can be done,\" MC said.MC's work and ideation, however, have just begun. He is building bigger dreams from this platform. He has set up another company, Just Power, to figure out how to generate solar power and how to water the fields from pumps that don't use electricity. \"We can do it with power generated from flowing water; we don't have to invent, there are existing models. We just have to apply them,\" he said.At the farm level, he has worked out a project for agri-tourism and agri-fitness, aimed at the software crowd that has never seen or been on a farm. \"We have tied up with three corporate teams already for agri-tourism. Software firms take their employees to spend the day at resorts as a break and money is set aside for this. Instead, we want them to come to our organic farms, eat farm-fresh food, breathe clean air and see how and where their food comes from,\" MC said. This, he pointed out, automatically created a community and a future market for the farmers' organic produce.MC took his own tremendous enjoyment in the experience of sowing paddy in his fields and gave it a package form. \"People spend huge amounts on fitness, to build muscles, to gain better balance or to just de-stress. All of that is possible with just digging holes in the field or harvesting the crop. You feel a oneness with the land which is more enervating than any exercise in any gym. I have also calculated the number of calories that can be burnt this way. We will offer this experience to our friends in the IT sector.\" Naturally, his farmer friends are smiling all the way to the bank and are riding, blissfully, on the Organic Mandya theme: \"Don't eat anything that your grandmother wouldn't recognise as food.\"", "external_links": [], "published": "2015-10-25T07:45:00.000+02:00", "crawled": "2015-10-25T22:46:36.391+02:00", "highlightTitle": ""}