{"organizations": [], "uuid": "e670f86510722b3b6790d8660ef84999962d2148", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "", "site_section": "http://www.bloomberg.com/technology", "section_title": "Technology - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-10-19/auto-parts-retailers-immunity-to-amazon-com-drives-stock-surge", "country": "US", "title": "Auto-Parts Retailers' Immunity to Amazon.com Drives Stock Surge", "performance_score": 1, "site": "bloomberg.com", "participants_count": 1, "title_full": "Auto-Parts Retailers' Immunity to Amazon.com Drives Stock Surge - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T12:01:00.000+03:00", "replies_count": 0, "uuid": "e670f86510722b3b6790d8660ef84999962d2148"}, "author": "Christie Boyden", "url": "http://www.bloomberg.com/news/articles/2015-10-19/auto-parts-retailers-immunity-to-amazon-com-drives-stock-surge", "ord_in_thread": 0, "title": "Auto-Parts Retailers' Immunity to Amazon.com Drives Stock Surge", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Not all brick-and-mortar retailers are running in fear from Amazon.com Inc. Just look at the auto-parts industry.\nThe three largest U.S. sellers of replacement parts are seeing sales surge, sending their stock prices on a roll. AutoZone Inc., Advance Auto Parts Inc. and O’Reilly Automotive Inc. have all gained at least about 20 percent this year. That trounces the 1.3 percent decline for the Standard & Poor’s 500 Index.\nThe retailers are benefiting from the fact that Americans’ cars are aging, as well as a new wave of technologically advanced cars that’s boosting sales to professional mechanics. Auto-parts sellers also have so far proven immune to the e-commerce threat that has plagued other merchants.\n\"The auto-repair industry is well-positioned because it’s not being disrupted by places like Amazon,\" said Bret Jordan, an analyst at Jefferies LLC. \"When you need a part, you can’t wait for tomorrow’s delivery. You need it today.\"\nThere are currently about 250 million vehicles on U.S. roads, a record. That’s partly due to the lingering effects of the most recent recession, which has caused the average age of vehicles to climb to 11.4 years, the highest ever, according to data compiled by Bloomberg.\nAt the same time, lower gas prices and higher employment have drivers putting more miles on their cars, creating a booming market for oil and replacement tires. That trend may cause auto-part consumption to grow 3 percent to 4 percent for the next four years, according to Michael Montani, an analyst at Evercore ISI.\n‘Huge Surge’ \"With so many old cars on the road, there will be a huge surge for repairs, most of which need immediate parts,\" he said.\nCoinciding with the aging fleet is an influx of newer, technologically advanced vehicles. New-vehicle sales accelerated to an annual rate of 18.2 million vehicles in September, according to Autodata Corp., which adjusts the figures for seasonal trends. That’s the fastest pace in more than 10 years.\nThe more advanced cars are increasingly difficult for vehicle owners to repair and maintain without professional help, shifting retailers’ sales to repair shops and service centers. O’Reilly, AutoZone and Advance Auto Parts all said their professional businesses are growing faster than their do-it-yourself businesses in their most recent earnings reports.\nO’Reilly’s Advantage Shares of O’Reilly, based in Springfield, Missouri, have gained 32 percent this year, leading its peers. Roanoke, Virginia-based Advance Auto Parts and Memphis-based AutoZone aren’t far behind, both with increases of about 20 percent.\nO’Reilly has a better distribution system than its rivals and operates more efficiently, Jordan said. Last year, Advance bought General Parts International Inc., adding the Carquest chain to its distribution network in an attempt to bulk up.\n\"O’Reilly’s advantage comes down to two things: better positioning and stronger execution,” Jordan said. \"Everyone else is trying to grow to look like O’Reilly.\"\nO’Reilly’s leadership has even attracted the attention of activist investor Starboard Value, which announced a stake in Advance Auto Parts last month. The hedge fund thinks Advance Auto Parts is undervalued and could fuel further gains by cutting overhead and improving product sourcing to catch up to its rivals.\nOne retailer that has missed out on the rally is Atlanta-based Genuine Parts Co. While the rest of the industry has profited from favorable auto-industry dynamics, Genuine Parts’ shares have fallen 22 percent this year, hurt by exposure to industrial markets and declining oil prices.\nAmazon’s Niche Amazon could eventually start targeting local repair-shop operators to take commercial business from the parts retailers, said Jon Hedges, principal at Hedges & Co. That would echo the strategy it has employed in selling to small businesses to chip away at office-supply retailers such as Staples Inc.\nSo far, the only place Amazon, EBay Inc., and auto sites such as Summitracing.com and Jegs.com have found a foothold is in performance accessories, he said.\nThe DIY market may grow to about $54 billion in 2017 from $49 billion in 2014, according to Auto Care Association data used in a General Parts presentation. The do-it-for-me market -- using professional mechanics to handle the work -- is almost twice that size. It was about $91 billion last year and expected to expand to $102 billion in 2017.\n\"Amazon attracts a very niche market of weekend car enthusiasts,\" said Brian Sponheimer, an analyst at Gabelli & Co. \"For general consumers needing repair parts, I don’t see Amazon as a big threat.\"\nAuto-part retailers may see trouble if the economy worsens and oil prices go up, squeezing consumer spending and decreasing miles driven. Higher interest rates could slow car-buying and have a trickle-down effect on auto-part retailers, but Adam Fleck, an analyst at Morningstar Inc., said that effect would be minimal. Even a bad economy can be good because people will keep their old cars rather than buy new ones, increasing the need for repairs, he said.\n\"Auto-part retailers tend to be pretty recession-resistant,\" Fleck said.", "external_links": [], "published": "2015-10-19T12:01:00.000+03:00", "crawled": "2015-10-19T10:00:07.326+03:00", "highlightTitle": ""}