{"organizations": [], "uuid": "c742f5d87573bcfeb10c92c6d7c848948108f513", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.innovativeretailtechnologies.com", "main_image": "", "site_section": "http://www.retailsolutionsonline.com/rssfeeds/rssnews", "section_title": "Innovative Retail Technologies News", "url": "http://www.innovativeretailtechnologies.com/doc/grid-dynamics-and-fujitsu-deliver-oracle-commerce-platform-on-fujitsu-m-servers-as-a-fully-managed-cloud-service-0001?atc~c=771+s=773+r=001+l=a", "country": "US", "title": "Grid Dynamics And Fujitsu Deliver Oracle Commerce Platform On Fujitsu M10 Servers As A Fully-Managed Cloud Service", "performance_score": 0, "site": "innovativeretailtechnologies.com", "participants_count": 0, "title_full": "Grid Dynamics And Fujitsu Deliver Oracle Commerce Platform On Fujitsu M10 Servers As A Fully-Managed Cloud Service", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T15:59:00.000+03:00", "replies_count": 0, "uuid": "c742f5d87573bcfeb10c92c6d7c848948108f513"}, "author": "", "url": "http://www.innovativeretailtechnologies.com/doc/grid-dynamics-and-fujitsu-deliver-oracle-commerce-platform-on-fujitsu-m-servers-as-a-fully-managed-cloud-service-0001?atc~c=771+s=773+r=001+l=a", "ord_in_thread": 0, "title": "Grid Dynamics And Fujitsu Deliver Oracle Commerce Platform On Fujitsu M10 Servers As A Fully-Managed Cloud Service", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News | October 20, 2015 Grid Dynamics And Fujitsu Deliver Oracle Commerce Platform On Fujitsu M10 Servers As A Fully-Managed Cloud Service \nComprehensive, joint solution delivers push-button provisioning, development, testing, deployment and continuous delivery with high-performance infrastructure to retailers as-a-service \nGrid Dynamics, a leading provider of scalable eCommerce technology solutions, and Fujitsu Technology and Business of America, Inc. announced today a fully-managed cloud service based on Oracle Commerce Platform with Fujitsu M10 servers running Oracle Solaris. Optimized for scalability and performance, the solution combines the Tonomi autonomic application delivery platform and managed services from Grid Dynamics with the flexible Fujitsu M10 server infrastructure to deliver push-button provisioning, deployment and continuous delivery. \nIntegrated development, testing and production environment management with database and data schema management give retailers the ability to handle the heaviest of eCommerce workloads and more rapidly evolve their omnichannel services. As a fully-managed, cloud-based delivery service, the solution can help eliminate the costs, risks, time and complexities associated with acquiring, building and managing infrastructure and hiring new DevOps teams to automate application environment management. \nComplete eCommerce Solution Delivered as-a-Service \nThe Grid Dynamics on Fujitsu M10 server solution combines ideal infrastructure, software, automation tools and best practices in continuous delivery. Using the solution, retailers can rapidly develop, test and push to production new digital services and features in a fully-managed application environment, optimized for the Oracle Commerce Platform. The integrated solution includes four powerful components: Oracle Commerce Platform - This industry-leading eCommerce software delivers a personalized and optimized omnichannel experience for the world’s most successful brands. Fujitsu M10 Servers - Fujitsu M10 servers are optimized for Oracle Database to deliver high-volume transactions and real-time analytic processing. Fujitsu M10 servers combine Software on Chip innovations with extreme reliability and scalability from entry point systems to the highest capacity deployments. These flexible and scalable systems deliver top performance and mission-critical reliability suitable to handle the heaviest eCommerce workloads and spikes in retail demand due to holidays or seasonal sales. Tonomi Autonomic Application Delivery Platform — Tonomi , from Grid Dynamics, is an award-winning automation, orchestration and configuration management technology for self-service management of cloud applications. Managed Continuous Delivery Pipeline - The service includes a complete set of managed development, testing, staging and production environments that connect to the customer’s internal development and testing environment. Customers can rapidly develop, automatically test and push to production new digital services and features to deliver always-relevant experiences to buyers at any touch point in their purchase journey. \nDelivered as a subscription service, customers pay a monthly fee for fully-managed infrastructure, applications and continuous delivery pipeline environments. \n“eCommerce customers are finally ready for the cloud,” said Victoria Livschitz, founder and chairman of Grid Dynamics. “They want a faster time-to-market with new features, push-button reconfiguration of infrastructure, dynamic scaling, self-service and pay-per-use. What they don't want is the complexity of integrating cloud APIs with application stacks and third-party packages, and supporting these environments. Grid Dynamics and Fujitsu have removed the complexity and left retailers with all the benefits.” \n“Fujitsu is pleased to join forces with Grid Dynamics to deliver this powerful platform for extreme online transaction workloads leveraging the Fujitsu M10 server,” said Masaya Nakahara, executive vice president of the Fujitsu Oracle Center of Excellence (FOrCE) at Fujitsu Technology and Business of America, Inc. “With world-class performance, Software on Chip innovations, and a proven track record of reliability, Fujitsu M10 servers with Grid Dynamics provide mission-critical data infrastructure to handle the heaviest eCommerce workloads.” \nGrid Dynamics and Fujitsu will demonstrate the solution at Oracle OpenWorld 2015 in San Francisco on October 25-29, 2015 at the Fujitsu Booth (#901 Moscone South). \nAbout Grid Dynamics \nGrid Dynamics is a leading provider of open, scalable, next-generation commerce technology solutions in the areas of omnichannel digital platforms, cloud enablement and continuous delivery. To learn more about Grid Dynamics, find us at www.griddynamics.com or by following us on Twitter @GridDynamics. \nAbout Tonomi \nTonomi is one of the first autonomic application management platforms for cloud applications and empowers developers and operations teams to turn their applications into self-managed entities that adapt, configure, heal and protect themselves in response to changes within dynamic cloud environments. Tonomi is a product of Grid Dynamics. \nAbout Fujitsu \nFujitsu is the leading Japanese information and communication technology (ICT) company, offering a full range of technology products, solutions and services. Approximately 159,000 Fujitsu people support customers in more than 100 countries. We use our experience and the power of ICT to shape the future of society with our customers. Fujitsu Limited (TSE: 6702) reported consolidated revenues of 4.8 trillion yen (US$40 billion) for the fiscal year ended March 31, 2015. For more information, please see http://www.fujitsu.com . \nAbout Fujitsu Technology and Business of America, Inc. \nFujitsu Technology and Business of America, Inc. (FTBA) is part of the family of Fujitsu companies in North America providing customers in the United States and Canada with comprehensive information technology solutions based on an unparalleled lineup of quality computer, communications, and semiconductor products and services. Fujitsu Technology and Business of America, Inc. offers its services to Fujitsu group companies. We provide services and support in Tax, Treasury, Risk Management, HR, Benefits, Finance and Accounting, Procurement, and Facilities. Fujitsu Technology and Business of America also provides services and support to Fujitsu Limited in Patent, R&D, and Procurement and to SUBARU Telescope facilities in Hawaii, the National Astronomical Observatory of Japan. \nAbout Fujitsu M10 Servers \nFujitsu M10 SPARC servers are flexible and scalable systems that deliver high performance and mission-critical reliability for enterprise-class workloads. These high-performance servers are based on Fujitsu SPARC64 X+/X processors and run Oracle Solaris. Fujitsu M10 servers are available as single-socket 1RU Fujitsu M10-1, 4-socket 4RU M10-4 and scalable M10-4S models. Fujitsu M10 servers feature key technologies such as CPU core activation and building block architecture to lower the Total Cost of Ownership (TCO). Fujitsu M10 servers are sold as SPARC M10 by Fujitsu in Japan. Fujitsu M10 and SPARC M10 are identical products. For more information, please visit: http://www.fujitsu.com/sparc/ \nTrademarks \nFujitsu, the Fujitsu logo and \"shaping tomorrow with you\" are trademarks or registered trademarks of Fujitsu Limited in the United States and other countries. SPARC and SPARC64 are trademarks or registered trademarks of SPARC International, Inc. in the United States and other countries. Oracle and Java are trademarks or registered trademarks of Oracle Corporation in the United States and other countries. All other trademarks and product names are the property of their respective owners. \nInformation provided in this press release is accurate at time of publication and is subject to change without advance notice. Like what you are reading? Sign up for our free newsletter SIGN ME UP By clicking Sign Me Up, you agree to our Terms and that you have read our Privacy Policy .", "external_links": [], "published": "2015-10-20T15:59:00.000+03:00", "crawled": "2015-10-21T03:00:25.597+03:00", "highlightTitle": ""}