{"organizations": [], "uuid": "fbd5682417cf8e12a6baaac50dd1543e6bbde880", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1144032/new-hands-free-technologies-pose-hidden-dangers-drivers", "country": "US", "title": "New Hands-Free Technologies Pose Hidden Dangers for Drivers", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "New Hands-Free Technologies Pose Hidden Dangers for Drivers", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T07:01:00.000+03:00", "replies_count": 0, "uuid": "fbd5682417cf8e12a6baaac50dd1543e6bbde880"}, "author": "admin", "url": "http://www.freshnews.com/news/1144032/new-hands-free-technologies-pose-hidden-dangers-drivers", "ord_in_thread": 0, "title": "New Hands-Free Technologies Pose Hidden Dangers for Drivers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Submitted by admin on 10/21/2015 @ 9:01 PM Companies mentioned in this article: AAA \nWASHINGTON, Oct. 22, 2015 /PRNewswire-USNewswire/ -- Potentially unsafe mental distractions can persist for as long as 27 seconds after dialing, changing music or sending a text using voice commands, according to surprising new research by the AAA Foundation for Traffic Safety. The results raise new and unexpected concerns regarding the use of phones and vehicle information systems while driving. This research represents the third phase of the Foundation's comprehensive investigation into cognitive distraction, which shows that new hands-free technologies can mentally distract drivers even if their eyes are on the road and their hands are on the wheel. \nhttps://photos.prnewswire.com/prnvar/20151021/279202-INFO \n\"The lasting effects of mental distraction pose a hidden and pervasive danger that would likely come as a surprise to most drivers,\" said Peter Kissinger, President and CEO of the AAA Foundation for Traffic Safety. \"The results indicate that motorists could miss stop signs, pedestrians and other vehicles while the mind is readjusting to the task of driving.\" \nResearchers found that potentially unsafe levels of mental distraction can last for as long as 27 seconds after completing a distracting task in the worst-performing systems studied. At the 25 MPH speed limit in the study, drivers traveled the length of nearly three football fields during this time. When using the least distracting systems, drivers remained impaired for more than 15 seconds after completing a task. \n\"Drivers should use caution while using voice-activated systems, even at seemingly safe moments when there is a lull in traffic or the car is stopped at an intersection,\" said Marshall Doney, AAA's President and CEO. \"The reality is that mental distractions persist and can affect driver attention even after the light turns green.\" \nThe researchers discovered the residual effects of mental distraction while comparing new hands-free technologies in ten 2015 vehicles and three types of smart phones. The analysis found that all systems studied increased mental distraction to potentially unsafe levels. The systems that performed best generally had fewer errors, required less time on task and were relatively easy to use. \nThe researchers rated mental distraction on a five-point scale. Category one represents a mild level of distraction and category five represents the maximum. AAA considers a mental distraction rating of two and higher to be potentially dangerous while driving. \nThe best performing system was the Chevy Equinox with a cognitive distraction rating of 2.4, while the worst performing system was the Mazda 6 with a cognitive distraction rating of 4.6. Among phone systems, Google Now performed best with a distraction rating of 3.0, while Apple Siri and Microsoft Cortana earned ratings of 3.4 and 3.8. Using the phones to send texts significantly increased the level of mental distraction. While sending voice-activated texts, Google Now rated as a category 3.3 distraction, while Apple Siri and Microsoft Cortana rated as category 3.7 and category 4.1 distractions. \n\"The massive increase in voice-activated technologies in cars and phones represents a growing safety problem for drivers,\" continued Doney. \"We are concerned that these new systems may invite driver distraction, even as overwhelming scientific evidence concludes that hands-free is not risk free.\" \nPrevious AAA Foundation research established that a category 1 mental distraction is about the same as listening to the radio or an audio book. A category 2 distraction is about the same as talking on the phone, while category 3 is equivalent to sending voice-activated texts on a perfect, error-free system. Category 4 is similar to updating social media while driving, while category 5 corresponds to a highly-challenging, scientific test designed to overload a driver's attention. \nOver the last two weeks, AAA has used the findings to continue our collaborative work with policymakers, safety advocates and manufacturers to improve the safety of future technology. \n\"Developers should reduce mental distractions by designing systems that are no more demanding than listening to the radio or an audiobook,\" continued Doney. \"Given that the impairing effects of distraction may last much longer than people realize, AAA advises consumers to use caution when interacting with these technologies while behind the wheel.\" \nSelect b-roll video of the research is available to download and for news media purposes. The complete research reports, photos and other graphics are on AAA's website . The previous findings from Phase I and Phase II of the Foundation's research into cognitive distraction also are available. \nDr. David Strayer and Dr. Joel Cooper of the University of Utah conducted the research. A total of 257 drivers ages 21-70 participated in the study of 2015 model-year vehicles, while 65 additional drivers ages 21-68 tested the three phone systems. \nEstablished by AAA in 1947, the AAA Foundation for Traffic Safety is a 501(c)(3) not-for-profit, publicly-supported charitable educational and research organization. Dedicated to saving lives and reducing injuries on our roads, the Foundation's mission is to prevent crashes and save lives through research and education about traffic safety. The Foundation has funded over 200 research projects designed to discover the causes of traffic crashes, prevent them and minimize injuries when they do occur. Visit www.AAAFoundation.org for more information on this and other research. \nAs North America's largest motoring and leisure travel organization, AAA provides more than 55 million members with travel, insurance, financial and automotive-related services. Since its founding in 1902, the not-for-profit, fully tax-paying AAA has been a leader and advocate for the safety and security of all travelers. AAA clubs can be visited on the Internet at AAA.com . \nAAA news releases, high-resolution images, broadcast-quality video, fact sheets and podcasts are available on the AAA NewsRoom at NewsRoom.AAA.com", "external_links": [], "published": "2015-10-22T07:01:00.000+03:00", "crawled": "2015-10-22T10:36:54.291+03:00", "highlightTitle": ""}