{"organizations": [], "uuid": "9bf414ef85ae069ec7c12c1b722d7f58e19ed382", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.techradar.com", "main_image": "http://cdn.mos.techradar.com/art/cameras/DxO/One/Hands%20on%20shots/DXO_One__DSF4667_-1200-80.jpg", "site_section": "http://www.techradar.com/rss/reviews", "section_title": "TechRadar: Technology reviews", "url": "http://www.techradar.com/us/reviews/cameras-and-camcorders/cameras/compact-cameras/dxo-one-1297172/review?src=rss&attr=all", "country": "GB", "title": "Review: DxO One", "performance_score": 0, "site": "techradar.com", "participants_count": 1, "title_full": "Review: DxO One", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T14:00:00.000+03:00", "replies_count": 0, "uuid": "9bf414ef85ae069ec7c12c1b722d7f58e19ed382"}, "author": "Angela Nicholson", "url": "http://www.techradar.com/us/reviews/cameras-and-camcorders/cameras/compact-cameras/dxo-one-1297172/review?src=rss&attr=all", "ord_in_thread": 0, "title": "Review: DxO One", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Verdict \nDXO has a background in creating software for correcting optical and digital imperfections in images. As well as offering desktop software to make these corrections, the company's technology is found in around 300 million imaging devices – including many popular mobile phones. \nDXO is also the company that produces the software that we use to analyse camera performance. This means that it has an in-depth understanding of optics and image quality, as well as how to correct image problems. \nAs DXO has only produced software to date, it comes as a surprise that it has decided to branch out into camera production. But rather than producing a 'me-too' type compact, or adding to the long line of GoPro wannabes, the company has decided to produce a camera that is specifically designed for use with an iPhone or iPad with a Lightning Connector. It also has the level of control that enthusiast photographers want. \nThe DxO One is about the same size as a GoPro action camera. \nThe DXO One is about the same size as a GoPro Hero 4 without its waterproof housing and it has an internal frame made from aluminium with a half aluminium, half plastic shell to give it a premium feel. Inside is a 1-inch type 20.2-million-pixel backside-illuminated (BSI) CMOS sensor. DXO doesn't state where it has sourced the sensor from, but it's pretty clear from the references to the 'best 20Mp backside-illuminated 1-inch sensor around' that it has come from Sony. Lens and sensor \nThe lens uses an unusual 6 element design with no flange depth (meaning there's no space between the final element and the sensor), has an equivalent focal length of 32mm and a maximum aperture of f/1.8, making it possible to control depth of field for creative images. This aperture can be closed to f/11 when you need to get a wide area sharp. \nThe lens also has a closest focusing distance of 20cm but, judging by the hints being dropped by DXO's representatives, there will be a macro adaptor coming in the near future. There's a thread around the lens that would allow adaptors to be screwed on. \nThe lens is a 32mm f/1.8. Combined with the 1-inch sensor, this should give some nice shallow depth of field effects. The maximum ISO is 12,800, so the DxO One should be much better in low light than the in-built iPhone or iPad camera. \nAlthough there is Wi-Fi technology built-in, this is does not currently operate and there will be a firmware update, probably around Christmas, to activate it. However, the One also has a Lightning Connector to enable it to be connected to an iPhone. DXO has gone down this route for the ease of making a connection and the faster transfer speed. According to DXO, the connector surpasses Apple's requirements and has been tested to 38,000 actuations. Apparently, it didn't fail at this point, the engineers just stopped testing. \nOnce the camera is connected to an iPhone or iPad, DXO's app opens to allow you to take control of the camera. In addition to a fully automatic setting and a small collection of scene modes, it's possible to shoot in program, shutter priority, aperture priority and manual exposure mode. \nSensitivity may be set in the native range ISO 100-12,800 with two expansion settings giving the equivalent of ISO 25,600 and 51,200. Shutter speed can be varied between 15 and 1/8,000sec and exposure compensation is available to +/-3EV. There are five preset white balance settings along with an automatic setting and a choice of Full, Centre-weighted and Spot metering. File formats and video \nImages are saved as raw (DNG) and JPEG files with raw files being saved to the microSD card in the camera and JPEGs to either the card or the iPhone as you choose. Another file format, SuperRaw, uses DXO technology and takes four raw images at a rate of 22fps (frames per second) with one press of the shutter release. These images are composited into one raw file that can be edited in DXO Optics Pro (a licence for the Elite version of this software is supplied with the camera). This compositing is claimed to enable greater control over noise and better dynamic range. \nWhile the One is designed with connected shooting in mind, it can shoot in fully automatic mode without an iPhone. \nIt's designed to be used while plugged into an iPhone, but the DxO One can also work as a standalone camera in full auto mode. \nAs well as stills, the One can be used to shoot 1080p video at 30fps or 720 at 120fps (for slow motion playback) in MOV (H.264) format. However, DXO is keen to point out that the One is aimed at serious photographers rather than action cam users. \nThe camera comes with DXO Connect, which is used to import and automatically optimise images as well as Optics Pro Elite for bespoke processing and FilmPack for adding creative effects. \nFirmware upgrades will be made via the App Store when the camera is connected to an iPhone. 1", "external_links": [], "published": "2015-10-08T14:00:00.000+03:00", "crawled": "2015-10-08T17:41:03.123+03:00", "highlightTitle": ""}