{"organizations": [], "uuid": "1d4d06a0fbc51f0af3924aeccf9e2c31457cf5f0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.aceshowbiz.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Aceshowbizcom-EntertainmentNews\r", "section_title": "Aceshowbiz.com - Entertainment News", "url": "http://www.aceshowbiz.com/news/view/00089869.html", "country": "US", "title": "Justin Bieber and Selena Gomez's Surprise Duet Leaks Online", "performance_score": 0, "site": "aceshowbiz.com", "participants_count": 1, "title_full": "Justin Bieber and Selena Gomez's Surprise Duet Leaks Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T06:26:00.000+03:00", "replies_count": 0, "uuid": "1d4d06a0fbc51f0af3924aeccf9e2c31457cf5f0"}, "author": "AceShowbiz.com", "url": "http://www.aceshowbiz.com/news/view/00089869.html", "ord_in_thread": 0, "title": "Justin Bieber and Selena Gomez's Surprise Duet Leaks Online", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments In 'Strong', the former couple sang about the past, wishing that they were better at the relationship. \nJustin Bieber and Selena Gomez go from lovers to ex-lovers to collaborators. A surprise duet between the two leaked online on Saturday, October 17 evening titled \"Strong\". The unexpected track appeared on OVO Sound Radio. Gomez begins first, singing \"There's no sophistication in my lack of patience/ I'm just wishing you were better at communication/As I sit here steady waiting/ Wishing that you would call my name in/ Wishing I was better with the distance.\" Bieber and Gomez' status as former lovers would give big meaning to the lyrics and have people speculating. \"It's cause you're the only one I'm really missing/ Nobody else would be forgiving/ Cause of all the love that you give me/ All of the love that you give me,\" Bieber croons. They both take turns in singing the hook, \"Wishing I was better at this damn thing/ Cause it's just been too long and I can't change.\" There is no information about the track and neither Bieber nor Gomez had spoken about it. Bieber is releasing a new album titled \" Purpose \" on November 13 and it's unclear whether \"Strong\" is one of the tracks. Gomez released her second studio album \" Revival \" on October 9. The singers confirmed they were dating in 2011 but broke up in late 2012. The couple went on and off for a couple of years before ending the relationship for good in late 2014. \"We were so in love. Nothing else mattered,\" Bieber told Complex magazine. \"We were all about each other. But when it's like that and you get your value from that, people will always disappoint you. Your girl or your dude, they're always going to disappoint you.\" \n© AceShowbiz.com", "external_links": [], "published": "2015-10-18T06:26:00.000+03:00", "crawled": "2015-10-18T10:46:18.319+03:00", "highlightTitle": ""}