{"organizations": ["Catholic Charities", "Salvation Army", "Nevada Homeless Alliance"], "uuid": "8eda80f3b47a3e1b138afaf787511fe6d4fc2432", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "globenewswire.com", "main_image": "http://globenewswire.com/Attachment/LogoDisplay/360217?filename=360217.jpg&amp;size=1", "site_section": "http://globenewswire.com//Rss/subjectcode/4/Arts%2026%20Entertainment", "section_title": "GlobeNewswire: Arts & Entertainment", "url": "http://globenewswire.com/news-release/2015/10/08/774813/10152122/en/Sunrise-Health-System-Supports-STAND.html?f=22&fvtc=1&fvtv=Arts%2026%20Entertainment", "country": "US", "title": "Sunrise Health System Supports STAND", "performance_score": 0, "site": "globenewswire.com", "participants_count": 0, "title_full": "Sunrise Health System Supports STAND", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T02:04:00.000+03:00", "replies_count": 0, "uuid": "8eda80f3b47a3e1b138afaf787511fe6d4fc2432"}, "author": "", "url": "http://globenewswire.com/news-release/2015/10/08/774813/10152122/en/Sunrise-Health-System-Supports-STAND.html?f=22&fvtc=1&fvtv=Arts%2026%20Entertainment", "ord_in_thread": 0, "title": "Sunrise Health System Supports STAND", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sunrise Health System Supports STAND Catholic Charities, Salvation Army, Nevada Homeless Alliance and STAND Tour Raise Funds and Awareness for Local Homeless October 08, 2015 19:04 ET | Source: Sunrise Health \nLAS VEGAS, Oct. 8,   Sunrise Health System, along with Catholic Charities of Southern Nevada , The Salvation Army, Serving Southern Nevada and Nevada Homeless Alliance , are excited to announce the premier of theater sensation STAND , written by Jim Reyland, on Oct. 16 and 17 at the Clark County Library's Theater. Named best new play by the Nashville Scene, STAND raises funds and awareness countrywide for communities and organizations working with the homeless. \n\" STAND is an inspired play that will benefit those that struggle with homelessness in our Las Vegas community,\" said Phillip Hollon, Director of Social Services for The Salvation Army. \"The production sparks conversation, putting a face to those that are sometimes invisible. Our veterans, our students, our neighbors are all among those in our community struggling with homelessness.\" \nSTAND is the true story of Johnny \"JJ\" Ellis, who spent two drug-addicted decades on the streets of Nashville, and a Good Samaritan who helped him through the struggles and trials homeless individuals endure. David Compton, award-winning director and actor, directs the play and renowned stage actors Barry Scott and Henry Arnold star in this heartfelt production. \n\"We are fortunate and excited to be a part of this national initiative with the play STAND, said Deacon Tom Roberts, President and CEO of Catholic Charities of Southern Nevada. \"The funds raised by these performances allow us to continue to serve the many men, women and children who are homeless in our community.\" \nThe Las Vegas performances of STAND take place Friday, Oct. 16 at 7:30 p.m. and Saturday, Oct. 17 at 2:00 p.m. and 7:30 p.m. To purchase tickets, visit www.showtix4u.com or call 866-976-8167. Catholic Charities of Southern Nevada, The Salvation Army of Southern Nevada and Nevada Homeless Alliance will have booths set up inside the theater lobby with information about how to donate and volunteer. \n\"We are hoping that through this event we can increase support of local service programs that assist these vulnerable community members,\" said Stacy Sutton Pollard, Executive Director of the Nevada Homeless Alliance. \nSTAND Las Vegas is sponsored by the Sunrise Health System and the Las Vegas-Clark County Library District Foundation. An additional performance will be donated to Valley High School, with curtains set to rise Oct. 16 at noon. \nAbout Sunrise Health: \nSunrise Health is the most technologically advanced hospital network in the Southwest. Committed to providing the finest healthcare, Sunrise Health includes Sunrise Hospital & Medical Center, MountainView Hospital, Southern Hills Hospital and Medical Center and Sunrise Children's Hospital, as well as outpatient diagnostic, imaging and surgical centers. Specialty services include a suite of the latest diagnostic and surgical technologies, advanced cardiovascular services, comprehensive neurological services, a designated Comprehensive Cancer Center, The Nevada Neurosciences Institute, The Breast Center at Sunrise, MountainView Cardiovascular & Thoracic Surgery Associates, the state's most comprehensive Children's Hospital and women's healthcare services and Las Vegas' first network of certified Stroke Centers and Accredited Chest Pain Centers. For more information on Sunrise Health, visit SunriseHealthInfo.com . \nNeed a Physician, Nurse Advice or Health Information? Call our free 24/7 Consult-A-Nurse line at 702.233.5300. In case of emergency, dial 9-1-1. \nAbout Catholic Charities of Southern Nevada \nCatholic Charities of Southern Nevada (CCSN) is one of the largest nonprofit social service providers in the state. In operation since 1941, CCSN provides over 20 diverse services and programs designed to help people of all ages. CCSN's mission aims to provide services based on basic Catholic teachings of charity and social justice and serves all Southern Nevadans, regardless of race, religion or creed. \nCCSN strives toward the goal of allowing each individual the chance to gain self-sufficiency, independence, and dignity. For more information, please visit CatholicCharities.com , or visit us on Facebook or Twitter . \nAbout Nevada Homeless Alliance \nThe Nevada Homeless Alliance was established in 1992, under the name \"Southern Nevada Homeless Coalition.\" The Nevada Homeless Alliance (NHA) is a 501 (C) (3) non-profit organization and works to advocate, educate and coordinate on issues of homelessness. Our goal is to convene the community, providers and companies to have higher level conversations so we can collaborate, and become more effective and efficient through working together. The Nevada Homeless Alliance is responsible for seeking out funding and corporate sponsors for Project Homeless Connect, Nevada's largest collaborative event. Since establishment, the NHA has convened community partners in the planning and execution of 24 Project Homeless Connects. Over the last five years alone, these events have assisted over 15,000 homeless clients in the accessing of resources and services. For more information, go to www.nevadahomelessalliance.org \nAbout The Salvation Army, Serving Southern Nevada \nThe Salvation Army, an evangelical part of the universal Christian church established in London in 1865, has been supporting those in need in His name without discrimination for 130 years in the United States. Nearly 30 million Americans receive assistance from The Salvation Army each year through the broadest array of social services that range from providing food for the hungry, relief for disaster victims, assistance for the disabled, outreach to the elderly and ill, clothing and shelter to the homeless and opportunities for underprivileged children. 82 cents of every dollar The Salvation Army spends is used to support those services in 5,000 communities nationwide. For more information, go to salvationarmyusa.org . \nThe Salvation Army, Serving Southern Nevada has been serving the Southern Nevada community since 1948. The Salvation Army is one of the largest direct providers of social services in Southern Nevada with a broad spectrum of services. For more information about The Salvation Army serving Southern Nevada, go to salvationarmysouthernnevada.org . Jennifer McDonnell Vice President, Marketing & Communications MountainView Hospital 702.562.5633 office Related Articles", "external_links": [], "published": "2015-10-09T02:04:00.000+03:00", "crawled": "2015-10-09T08:16:25.246+03:00", "highlightTitle": ""}