{"organizations": [], "uuid": "96898f32113002e31294ea45d16c0bcf3cec4677", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.floridatoday.com", "main_image": "http://www.gannett-cdn.com/-mm-/8744f6f80b0760280c8737936c01f88745bc4059/c=0-81-2097-1266&amp;r=x633&amp;c=1200x630/local/-/media/2015/09/30/Brevard/B9319076876Z.1_20150930163509_000_GF7C3IHAH.1-0.jpg", "site_section": "http://rssfeeds.floridatoday.com/brevard/entertainment", "section_title": "Brevard - Entertainment", "url": "http://www.floridatoday.com/story/entertainment/dining/toast-of-the-coast/2015/09/30/case-traveling-tiramisu/73108358/", "country": "US", "title": "The case of the traveling tiramisu", "performance_score": 0, "site": "floridatoday.com", "participants_count": 0, "title_full": "The case of the traveling tiramisu", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T23:50:00.000+03:00", "replies_count": 0, "uuid": "96898f32113002e31294ea45d16c0bcf3cec4677"}, "author": "", "url": "http://www.floridatoday.com/story/entertainment/dining/toast-of-the-coast/2015/09/30/case-traveling-tiramisu/73108358/", "ord_in_thread": 0, "title": "The case of the traveling tiramisu", "locations": ["FLORIDA"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Maria Sonnenberg"], "text": "The case of the traveling tiramisu Maria Sonnenberg, For FLORIDA TODAY 4:50 p.m. EDT September 30, 2015 Goodie-licious Custom Baking’s Traveling Tiramisu enables the iconic Italian treat to fare well on the go. (Photo: Marjorie Johnson/Submitted photo) \nFor many, tiramisu may well be the perfect dessert, but even its legions of fans will admit that the dessert just doesn’t travel well — at least until now. \nMarjorie Johnson, baker-in-chief at Goodie-licious Custom Baking pondered the problem of tiramisu on the go, since the creamy mascarpone custard holding layers of cake and espresso together, with just a dusting of cocoa powder in between, fares best when nestled in a large deep dish while awaiting scooping onto a serving plate. \nAfter serious experimenting, Johnson developed the Traveling Tiramisu, featured along with other Goodie-licious pastries at the Sun Shoppe, 540 E. New Haven Ave., in downtown Melbourne. The dessert sells for $3.95 at the café. Chef opens fine dining place in Satellite Beach \nJohnson serves the iconic Italian treat wrapped in its own crystal coffee cup. Well, the cup isn’t really crystal, but it looks nice and, better yet, is disposable and even recyclable for a splash of java at work or home once the dessert is history. \n“Amazingly enough, the cup performs even when filled with super-hot beverages,” said Johnson, who also notes that just remembering the luscious flavor of the cup’s previous occupant is enough to perk up the drinker’s mood. \nThe gluten intolerant will be happy to hear the tiramisu is gluten-free. \nGoodie-licious is taking holiday orders for its line of cakes and desserts. Call 321-305-2828 or visit goodie-licious.com. \nIn good company \nPlayalinda Brewing Company is among only 10 Florida breweries handpicked to exhibit at the 2015 Shelton Brothers’ The Festival, considered by beer enthusiasts as one of the country’s best international celebrations of beer and cider. \nThe Festival, which takes place Oct. 16 and 17 at the Coliseum in St. Petersburg, showcases the works of close to 100 of the world’s greatest and smallest artisanal beer, cider and mead purveyors. The event features not just U.S. breweries, but also the finest beers from Europe, Australia, New Zealand and Asia. \nBeer importers Shelton Brothers scrutinize exhibitors as thoroughly as they do the beers they import. \n“It’s going to be a lot of fun having the festival in Florida this year,” said Playalinda brewmaster Ron Raike in a news release. \n“All of the state’s brewers exhibiting know each other, and we often collaborate together on beers. We’re definitely looking forward to showing the other brewers from around the world how much is happening in Florida right now in terms of craft beer.” Inaugural VegFest keeps it healthy \nRaike plans to showcase Playalinda’s Barrel-Aged Farmhouse Saison and its Bring It IPA at The Festival. \nOther Florida breweries joining Playalinda at the event are 7venth Sun, Cigar City, Coppertail, Cycle Brewing, Funky Buddha, Gravity Brewlab, Green Bench, Redlight Redlight and Saint Somewhere. \nAn all-weekend festival pass is $175. Admission to individual sessions is $65 per session. Admission to the festival gets participants a special-edition sample glass, plus the opportunity to meet the best beer and cider makers in the world. \nFor a complete list of participating breweries or to purchase tickets, visit sheltonbrothers.com/festival. \nFor more information on Playalinda Brewing Co., see playalindabrewingcompany.com. \nCelebrating October \nHeidelberg Restaurant nods to its roots with its Oktoberfest menu this month. \nGet into the proper fall mood with the Cocoa Beach restaurant’s butternut squash-pumpkin soup ($7), wurst salad ($12) with knackwurst and Swiss cheese dumpling ($12) with gruyere served with kraut salad before heading to the main event, which includes entrees such as roulade, Angus beef steak stuffed with caramelized onion, carrots, pickle and spices served with Swiss spätzle red cabbage ($29); Bavarian roast duckling with Bohemian potato dumpling and red cabbage ($29); tender roasted pork loin with potato dumpling and red cabbage ($24) and the Oktoberfest platter for two ($49), the whole Bavarian kit and caboodle with bratwurst, knackwurst, wiener schnitzel, roasted pork loin, red cabbage, sauerkraut, spaetzli and roasted potatoes. \nHeidelberg is also hosting a five-course wine dinner on Oct. 22. \nHeidelberg is at 7 N. Orlando Ave., Cocoa Beach. For reservations and information, call 321-783-4559 or visit heidelbergcocoabeach.com. \nKnow of a chef or restaurant we should feature? Email toastofthecoast@cfl.rr.com. Read or Share this story: http://on.flatoday.com/1FFw7NQ TOP VIDEOS", "external_links": [], "published": "2015-09-30T23:50:00.000+03:00", "crawled": "2015-10-01T03:32:24.507+03:00", "highlightTitle": ""}