{"organizations": [], "uuid": "9e927da8201eef69d9aa0df775145b9b06f1cbb2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.inquisitr.com", "main_image": "http://cdn.inquisitr.com/wp-content/uploads/2015/10/JohnnyAmberGetty.jpg", "site_section": "http://feeds.inquisitr.com/TheInquisitrEntertainment", "section_title": "The Inquisitr News » Entertainment", "url": "http://www.inquisitr.com/2503636/johnny-depp-and-amber-heard-heading-for-divorce-or-rock-solid/", "country": "US", "title": "Johnny Depp And Amber Heard: Heading For Divorce Or Rock Solid?", "performance_score": 0, "site": "inquisitr.com", "participants_count": 1, "title_full": "Johnny Depp And Amber Heard: Heading For Divorce Or Rock Solid?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T18:43:00.000+03:00", "replies_count": 0, "uuid": "9e927da8201eef69d9aa0df775145b9b06f1cbb2"}, "author": "Jessica Dafoe", "url": "http://www.inquisitr.com/2503636/johnny-depp-and-amber-heard-heading-for-divorce-or-rock-solid/", "ord_in_thread": 0, "title": "Johnny Depp And Amber Heard: Heading For Divorce Or Rock Solid?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Jessica Dafoe \nReports have been rampant that Johnny Depp and Amber Heard have experienced a rocky relationship right from the get go of their marriage. Earlier this year the couple tied the knot in a quiet ceremony, which temporarily shut down break up rumors that had already been swirling around the pair. \nThe celebrity site Celebrity Dirty Laundry has done nothing but perpetuate this rumor and continues to mention quotes from sources who are sure that Johnny and Amber are finding married life difficult. The most recent report involves Amber’s dislike of Johnny’s decision to start up a new band, which has him away a lot and means that he spends time with band members who Amber reportedly is not fond of. The site relays the source’s words on the matter. \n“She finds these guys really boring and doesn’t even like the music. This was supposed to be one of Johnny’s pet projects, but it is starting to take over both of their lives. He constantly invites the band and crew over for jam sessions after shows, and Amber winds up just sitting there and watching them until she can’t take it anymore .” \nHowever, the two appear to be as happy as ever when in the public eye. The number of witnessed PDA’s between the couple have climbed since the two wed, and it’s clear that certain sources are not always entirely credible. Just as many claims in regards to Johnny and Amber’s rocky relationship have been made in regards to the couple’s steady and rock-solid relationship. \nPeople Magazine recently reported about the witnessed love the couple evidently shares when interviewing legendary rocker Alice Cooper. The rock icon has spent time in the company of Johnny and Amber while all handed out hearing aids on a recent trip to Brazil. He ensured to let it be known that all the rumors of struggle and pending divorce are ridiculous. VENICE, ITALY – SEPTEMBER 05, Johnny Depp and Amber Heard (Photo by Tristan Fewings/Getty Images) \n“They were very, very much in love. They’re doing great. Johnny and Amber were in there putting hearing aids in. Johnny, Joe Perry, Sheryl my wife, and I are actually putting these things in their ears. People are hearing for the first time, and there was not a dry eye in the house. It was little kids, I mean, we got to put the hearing aids in and go, ‘Hello,’ and the kids go like this,” [says Cooper, widening his eyes in wonder]. \nAfter sharing just how loving Amber and Johnny clearly are towards one another, Cooper couldn’t help but gush over his own wife of 39 years. \n“I love her. We never get any publicity because we never get divorced.” \nAlice was also sure to note that Amber and Johnny are going strong in their relationship, musical endeavors and travel schedule aside. The pair are continuing to find success in their acting careers as well. Johnny’s run for his first Oscar continues and many critics and film buffs believe that his latest role as Whitey Bulger in Black Mass is just the ticket to get the Academy Award finally hand. \nHowever, there are also mixed reviews coming from a number of notable critics who say that it perhaps still isn’t a strong enough performance to snatch the trophy away from those who Depp is sure to go up against for best actor. The fault seems to be left more with script writers and production/direction cues as opposed to Johnny’s performance, as What Culture notes. Mainly, the negative commentary focuses on Johnny’s occasional portrayal of Whitey that sees him as a “normal” and somewhat decent human being, which is reportedly far from the truth, seeing as Bulger was a psychopathic, heartless murderer. <noscript><iframe src=\"https://www.youtube.com/embed/CE3e3hGF2jc\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></noscript> As noted, Johnny still gives a commendable performance and can celebrate the “comeback” achievement next to his lovely wife Amber. \n(Feature Photo by Fred Duval/Getty Images for BFI)", "external_links": [], "published": "2015-10-18T18:43:00.000+03:00", "crawled": "2015-10-18T18:51:40.882+03:00", "highlightTitle": ""}