{"organizations": [], "uuid": "7b4bc9a878554849940fd974ac2854cfc4c7438b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.vindy.com", "main_image": "http://media.vindy.com/content/image/a/5/logo/v5logo.gif", "site_section": "http://www.vindy.com/rss/headlines/entertainment", "section_title": "Vindy.com stories: Entertainment", "url": "http://www.vindy.com/news/2015/oct/25/television-qampa/", "country": "US", "title": "Television Q&A", "performance_score": 0, "site": "vindy.com", "participants_count": 0, "title_full": "Television Q&A", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T06:00:00.000+02:00", "replies_count": 0, "uuid": "7b4bc9a878554849940fd974ac2854cfc4c7438b"}, "author": "", "url": "http://www.vindy.com/news/2015/oct/25/television-qampa/", "ord_in_thread": 0, "title": "Television Q&A", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published: Sun, October 25, 2015 @ 12:00 a.m. \nTelevision Q&A \nBy Rich Heldenfels \nQ. Is Paul on “Cedar Cove” the same guy in the Maytag commercial? \nA. Yes. Paul Watson on “Cedar Cove” is played by Canadian actor Colin Ferguson, previously known as Sheriff Jack Carter on Syfy’s “Eureka.” And he has been seen a lot since 2014 in a series of Maytag commercials. \nThose of us with long TV memories believe that the true commercial representative of Maytag is Jesse White, who appeared in 68 ads from 1967 to 1989. (White died in 1997.) \nUnlike that repairman – who was lonely because Maytag appliances never needed fixing – Ferguson’s Maytag character acts like the appliances and praises them before morphing into the appliance itself. In an oven ad, for example, a little girl watches him sitting and holding a cookie sheet, waiting for the cookies to be done. While the character is different, a Maytag rep told The New York Times, “The beauty of the Maytag repairman is that he’s been out there for 50 years, and he is a great asset because he helps differentiate us.” \nQ. Could you please tell me why Len Goodman from “Dancing With the Stars” is no longer a judge on the show? \nA. Goodman announced in December 2014 that he would end his involvement in the American dance competition after the spring 2015 run. He was tired of commuting between the U.S. and England, where he’s a judge on “Strictly Come Dancing,” the show that “DWTS” is based on. \nOverseas, he said, according to Digital Spy, “I’ve got my wife, I’ve got my son, my mother is still alive and she’s in hospital – I’ve had virtually no time to go and visit her. So, I just need a bit of time off to get on with a normal life. And it was either ‘Strictly’ went or the American one went.” \n“DWTS” seemed fully prepared for Goodman’s departure, bringing in Julianne Hough as a judge before he left. \nQ. Do you know where I can purchase a complete set of the old TV series “Hill Street Blues”? \nA. Shout!Factory released the authorized, complete-series DVD box in April 2014. If your local retailer cannot get it for you, I have seen the set for sale on Amazon.com, Bestbuy.com, Walmart.com and other sites. “Hill Street Blues” originally aired on NBC from 1981 to 1987 and still is remembered for its rules-changing approach to police drama. \nQ. CBS recently pre-empted “CBS Sunday Morning” to show football. The LAST thing I want to do on Sunday morning is watch NFL football. Has CBS lost its mind? Or is it a sick contract demand by the NFL? I plan on letting the NFL, CBS and my local affiliate know my feelings. \nA. On the weekend in question, CBS was televising a Jets-Dolphins NFL game live from London as part of an International Series of overseas contests dating back to 2007. Because of the time difference, the game aired in the morning here, not unlike what happens with tennis and other sports events the networks want to carry live from faraway time zones. \nMore than 83,000 people attended the game and, in the U.S., about 9.9 million people tuned in, according to the NFL. That’s a smaller audience than network showings of NFL games get in other parts of the day – but far more than the 5.84 million viewers “CBS Sunday Morning” averaged last season. \nTwo more overseas games are planned in 2015, today (nationwide via online service Yahoo) and next Sunday (on Fox). More such contests are likely as the NFL expands its global reach. Not long ago, the NFL said it would plan on regular-season international games for at least the next decade, and look at other countries besides England in which to play them. \nDo you have a question or comment for the mailbag? Write to the Akron Beacon Journal, 44 E. Exchange St., Akron, OH 44309 or email rheldenfels@thebeaconjournal.com . Please mark the email or envelope with “mailbag.” Letters may be edited for publication. Please do not phone in questions. Individual replies cannot be guaranteed. \n2015 Akron Beacon Journal \nDistributed by Tribune Content Agency, LLC. Other stories of interest", "external_links": [], "published": "2015-10-25T06:00:00.000+02:00", "crawled": "2015-10-25T11:20:52.516+02:00", "highlightTitle": ""}