{"organizations": [], "uuid": "1ff33768fcae956d53c225ffbc24faad4ae992ef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.680news.com", "main_image": "", "site_section": "http://www.680news.com/category/entertainment/feed/", "section_title": "680 NEWS » Entertainment", "url": "http://www.680news.com/2015/10/14/anne-michaels-selected-as-torontos-fifth-poet-laureate/", "country": "CA", "title": "Anne Michaels selected as Toronto’s fifth poet laureate", "performance_score": 0, "site": "680news.com", "participants_count": 1, "title_full": "Anne Michaels selected as Toronto’s fifth poet laureate", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T20:47:00.000+03:00", "replies_count": 0, "uuid": "1ff33768fcae956d53c225ffbc24faad4ae992ef"}, "author": "News Staff", "url": "http://www.680news.com/2015/10/14/anne-michaels-selected-as-torontos-fifth-poet-laureate/", "ord_in_thread": 0, "title": "Anne Michaels selected as Toronto’s fifth poet laureate", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted Oct 14, 2015 1:47 pm EDT Last Updated Oct 14, 2015 at 2:40 pm EDT \nTORONTO – Renowned writer Anne Michaels says she’s looking forward to celebrating Toronto’s “many voices” as the city’s fifth poet laureate. \nToronto announced Michaels as its new poet laureate on Wednesday, noting the appointment is pending approval by city council in November. \nA native of Toronto, Michaels is well known for her 1996 debut novel “Fugitive Pieces,” which was made into a film and won the Trillium Book Award, Orange Prize for Fiction and the Guardian Fiction Prize. \nHer second novel, “The Winter Vault,” was a finalist for the 2009 Scotiabank Giller Prize, the Trillium Book Award and the Commonwealth Writers’ Prize. \nShe’s also been lauded for her poetry collections — “The Weight of Oranges” won a Commonwealth Prize and “Miner’s Pond” was a finalist for a Governor General’s Literary Award. \nHer other collections include “Correspondences,” which was a finalist for last year’s Griffin Poetry Prize. \nMichaels replaces former laureate George Elliott Clarke for the title, which comes with an annual honorarium of $10,000 for three years. \n“I am very honoured by this appointment and eager to serve our wonderful city in all its diversity,” Michaels said in a statement. \n“Toronto is fortunate to embrace dozens of languages and has an invaluable literary history. I am looking forward to celebrating our many voices, old and new.” Join the conversation Sign in to comment (not connected to your Insider Club login). You're logged in as Loading profile... Unexpected error. Please try again. Notice: Your email may not yet have been verified. Please check your email, click the link to verify your address, and then submit your comment. If you can't find this email, access your profile editor to re-send the confirmation email. You must have a verified email to submit a comment. Once you have done so, check again .", "external_links": [], "published": "2015-10-14T20:47:00.000+03:00", "crawled": "2015-10-14T21:43:16.813+03:00", "highlightTitle": ""}