{"organizations": [], "uuid": "55fb3752771dabfa7eadd9f51714e95d99a89b45", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "http://s1.reutersmedia.net/resources/r/?m=02&d=20151009&t=2&i=1085790504&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXNPEB980W2", "site_section": "http://www.reuters.com/news/entertainment/arts", "section_title": "Arts - Entertainment | Reuters.com", "url": "http://www.reuters.com/article/2015/10/09/us-lebanon-museum-idUSKCN0S31VH20151009", "country": "US", "title": "Beirut art museum reopens to tell a troubled city's history", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Beirut art museum reopens to tell a troubled city's history | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T19:38:00.000+03:00", "replies_count": 0, "uuid": "55fb3752771dabfa7eadd9f51714e95d99a89b45"}, "author": "Laila Bassam", "url": "http://www.reuters.com/article/2015/10/09/us-lebanon-museum-idUSKCN0S31VH20151009", "ord_in_thread": 0, "title": "Beirut art museum reopens to tell a troubled city's history", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BEIRUT A stone's throw from dramatic street protests shaking central Beirut, art lovers gathered to celebrate the reopening of a museum of modern art which they hailed as a symbol of the Lebanese capital's resilience through conflict and turmoil.\nThe Sursock Museum, an Italianate mansion built for an Ottoman aristocrat, first opened to the public when he bequeathed it to the city more than 60 years ago.\nIn the 1960s, when Beirut flourished as the Middle East's capital of culture, the Sursock galleries boasted paintings and sculptures by artists from Lebanon and across the world.\nThe country's 1975-1990 civil war all but shut down the museum, and it closed again in 2008 for extensive renovation, before finally opening this week for a third time.\n\"Sursock museum is a part of Lebanon’s modern history, a history that the war of 1975 tried to erase,\" said Rafic Chlala, a former presidential adviser attending a reception to mark its latest reincarnation. \"But this museum resisted and stayed a cultural landmark in Lebanon.\"\nFor the next three months, the museum is displaying 200 works of art tracing Beirut's evolution from a provincial Ottoman town in 1800 to a booming national capital in the 1960s - including late 19th century photographs, a watercolor by Lebanese artist Amine el Bacha and a 1966 piece by British artist David Hockney.\nA more permanent exhibition shows the development of Lebanese modern art over the last two centuries.\nMingling with the artists at Thursday's reopening were government ministers, whose resignation was being demanded by scores of demonstrators chanting the refrain of the Arab Spring uprisings: \"The people demand the overthrow of the regime\".\nRiot police fired teargas and water cannon to disperse the demonstrators, some of whom threw rocks and water bottles back at them. The confrontation took place on the edge of Martyrs Square, less than 1 km (1 mile) from the Sursock.\nBeirut has been hit by a series of protests in recent months against Lebanon's politicians, who bickered over the summer months while rubbish lay uncollected across the city.\nThe political deadlock is one fallout of the four-year civil war in neighboring Syria, which has also brought bombings, economic slowdown and more than 1 million refugees to Lebanon.\nEnvironment Minister Mohammad al-Mashnouk, a focus of the protesters' anger, said the Sursock Museum was a home to the country's artistic and cultural treasures.\n\"Lebanese people need this space, in the midst of the sadness and tragedies we are living through,\" he told Reuters.\nUniversity professor Mona Fawaz drew a link between the protests in Beirut and the revival of the Sursock Museum.\n\"They both work in the same direction,\" she said. \"Both say there is still hope and will in Beirut, and people are working to make the city better.\"\n(Writing by Dominic Evans ; Editing by Alison Williams )", "external_links": [], "published": "2015-10-09T19:38:00.000+03:00", "crawled": "2015-10-09T19:14:51.055+03:00", "highlightTitle": ""}