{"organizations": [], "uuid": "cbf8789adb76b54e118c135b22766b2767267028", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.democratandchronicle.com", "main_image": "http://www.gannett-cdn.com/-mm-/2f16dab8f47c1e34aa08b38b0c1c9a53bb6a6c05/c=0-76-533-377&amp;r=x633&amp;c=1200x630/local/-/media/2015/02/25/Rochester/Rochester/635604460193375543-christophercarlssonrROCDrink.jpg", "site_section": "http://www.democratandchronicle.com/", "section_title": "Democrat and Chronicle | Rochester news, community, entertainment, yellow pages and classifieds. Serving Rochester, New York | democratandchronicle.com", "url": "http://www.democratandchronicle.com/story/lifestyle/food-and-drink/blogs/roc-flavors/2015/10/02/october-4th-is-national-vodka-day/73190402", "country": "US", "title": "October 4th is National Vodka Day", "performance_score": 0, "site": "democratandchronicle.com", "participants_count": 1, "title_full": "October 4th is National Vodka Day", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T08:59:00.000+03:00", "replies_count": 0, "uuid": "cbf8789adb76b54e118c135b22766b2767267028"}, "author": "democratandchronicle.com", "url": "http://www.democratandchronicle.com/story/lifestyle/food-and-drink/blogs/roc-flavors/2015/10/02/october-4th-is-national-vodka-day/73190402", "ord_in_thread": 0, "title": "October 4th is National Vodka Day", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Vodka - that much reviled spirit that is best known as simply being a delivery vehicle for ethanol with as little taste or flavor impact as possible, is having it's own holiday on October 4th. Despite the fact that the drinks industry wisdom is \"Vodka pays the Bills\" as it is the most ordered and in many cases the highest margin cocktail spirit, it is not held in a lot of respect by many bartenders . But vodka itself is starting to evolve. Vodka has a long and interesting history in Europe. While its exact origins are in some dispute, Poland and Russia , both claiming it, it cane dated back into the 1400's .From the 1400's till roughly 1900 all the worlds vodkas (and almost every other distilled spirit) was made in a pot still of some sort. A pot still is only really capable of 130 to 150 proof most of the time, leaving in a lot of flavor and character, such as one finds in whiskies or rum. It was not till the early 1900's when column stills were the fast and low cost option for making spirits that what we now call vodka was possible. By distilling in a column still you can easily reach a proof of 190 (95 % pure alcohol) where there was no flavor or character left - just the pure alcohol. Prior to this, and still to be found in European vodkas and homemade Russian moonshine known as Samogon, are spirit with lots of character and flavor from the material it was made from (usually rye, wheat or potato, corn being used by the bulk of American vodkas in their pursuit of cheap and bland).\nThe American definition or standard of identity for vodka was promulgated in 1949 by the ATF (Alcohol, Tobacco and Firearms Department of the Treasury) without distinctive character, aroma, or taste. Although no explicit definition of the term \"distinctive\" could be found in the hearing record, the testimony indicates that vodka is to be as tasteless and odorless as possible.\"\nIt is because of these fundamental differences that we now refer to vodkas as either a \"European Style\" an essentially older more traditional style with more flavor and characteristics and American Style, which is the the without distinctive character, aroma or taste beyond ethanol itself. These new definitions are much in the same way that Dutch and Belgian Genevers (Gins) make the distinction between the \"Vieux Systeme\" (Old system pot distilled) and \"Jonge Systeme \" ( new system, column distilled).\nExamples of this style can be found here in the United States under the brand names Polugar made in Poland and Pervak from the Ukraine among others including a number of smaller craft distilled vodkas and spirits that decided not to sacrifice taste to appease the fear of flavor crowd.\nChristopher Carlsson Blogger: RocFlavors: MORE FROM RocFlavorsBlog Auburn’s Prison City medals at GABF Will Cleveland, @WillCleveland13 | 2:01 PM Sep 30, 2015 Healthy football party snacks Joy Auch, blogger | 3:48 PM Sep 14, 2015 Fill the Bus to fill children's bellies Kimberly Montinarello, blogger | 10:27 AM Sep 11, 2015 See all posts from Blogs Extra", "external_links": ["http://www.gannett-cdn.com/-mm-/57c92c0645581467bb37efa4ea86910364ff12b1/c=19-0-420-401&r=1024x1024&r=103&c=0-0-100-100/local/-/media/2015/02/25/Rochester/Rochester/635604460193375543-christophercarlssonrROCDrink.jpg"], "published": "2015-10-02T08:59:00.000+03:00", "crawled": "2015-10-02T10:12:43.696+03:00", "highlightTitle": ""}