{"organizations": [], "uuid": "3eb4f9164a6ae49029e97f340f61ece9a1f8c3d8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ctvnews.ca", "main_image": "http://www.ctvnews.ca/polopoly_fs/1.2212401.1422571458!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "site_section": "http://www.ctvnews.ca/rss/ctvnews-ca-entertainment-public-rss-1.822292", "section_title": "CTVNews.ca - Entertainment - Public RSS", "url": "http://www.ctvnews.ca/entertainment/humans-of-new-york-stories-shares-poignant-tales-from-big-apple-1.2607024", "country": "CA", "title": "'Humans of New York: Stories' shares poignant tales from Big Apple | Entertainment & Showbiz", "performance_score": 0, "site": "ctvnews.ca", "participants_count": 1, "title_full": "'Humans of New York: Stories' shares poignant tales from Big Apple | Entertainment & Showbiz from CTV News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "3eb4f9164a6ae49029e97f340f61ece9a1f8c3d8"}, "author": "Lauren La Rose,  The Canadian Press", "url": "http://www.ctvnews.ca/entertainment/humans-of-new-york-stories-shares-poignant-tales-from-big-apple-1.2607024", "ord_in_thread": 0, "title": "'Humans of New York: Stories' shares poignant tales from Big Apple | Entertainment & Showbiz", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "TORONTO -- In the first two years of photographing people on the streets of New York City, Brandon Stanton mostly allowed the powerful images to speak for themselves.\nBut as he devoted more time to interviewing his subjects, hearing their stories delivered an extra emotional wallop.\n\"A lot of the time, the very first question out of my mouth is: 'What is your biggest challenge right now?\"' said Stanton.\n\"I find that if you just ask, people are willing to share, because I think there's a validation of sharing your story\".\nStanton shares his slice-of-life snapshots alongside humorous and heartwrenching anecdotes on his popular blog Humans of New York . He's amassed a sizable social media following with a combined total of more than 19 million followers on Facebook, Instagram and Twitter, and has even inspired imitators of the format in Toronto, Dublin and Mumbai.\nIn \"Humans of New York: Stories\" (St. Martin's Press), Stanton, 31, shares a few of his favourites as well as newer entries from his rapidly expanding catalogue. Whether it's a brief quote or a longer story, the text adds poignancy and greater insight into the individual before the lens.\nIn one photo, a man's hand is seen resting atop a Braille-embossed page. \"I hated God for a long time,\" reads the accompanying caption.\nIn another, a young man appears to use sign language to communicate with a young girl. The text reads: \"I worry that one day she'll get separated from me, and nobody will understand she's deaf.\"\nStanton has broadened the blog beyond the Big Apple with visits to Pakistan and Iran. He also recently teamed with the UN High Commissioner for Refugees to speak with displaced people in Croatia, Austria and Greece.\n\"All of the stories were sad, but it seems like there would be one every single day that completely punched me in the stomach and I was just carrying it around with me all day long,\" said Stanton.\n\"You know that you're leaving and there's not necessarily a solution for them, and you're leaving them behind in the same situation that you found them -- and that is very tough.\"\nThe former bond trader turned photographer said he's able to support himself from speeches and book sales. But through the blog's popularity, he's been able to generate attention and funds for notable causes -- including his photo subjects.\nIn January, Stanton met a teen boy named Vidal who cited his principal, Nadia Lopez, as his greatest influence. Stanton documented the students and educators at the school, and launched a crowdfunding campaign to help send the youngsters to Harvard for a visit.\nMore than US$1 million was raised, with money also set aside for a scholarship fund. The campaign even caught the attention of the White House. Vidal, Lopez and Stanton met U.S. President Barack Obama, who is also featured in the new book speaking about his greatest influence.\nBoth Obama and current presidential contender Hillary Clinton have also commented on HONY's Facebook page . In Clinton's case, she responded to a post about a young boy afraid for his future and worried people won't like him because he is gay.\n\"Prediction from a grown-up: Your future is going to be amazing,\" Clinton wrote. \"You will surprise yourself with what you're capable of and the incredible things you go on to do. Find the people who love and believe in you -- there will be lots of them.\"\nStanton said it's exciting to see the high-profile response to his blog, but he tries to stay grounded.\n\"The bigger it gets and the more exciting things happen ... the more I try to narrow my focus for my own sanity and just focus on going out there every single day and having conversations with strangers.\"\nRelated Stories Frankfurt Book Fair: Preview of hot titles by HONY photog, Orhan Pamuk, Lauren Weisberger Humans of New York photographer helps raise $1M for inner-city kids", "external_links": [], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-13T14:42:28.640+03:00", "highlightTitle": ""}