{"organizations": [], "uuid": "eb5b2aa86b396c4d869ccc88872fc8bd7869450d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://www.canberratimes.com.au/content/dam/images/g/k/7/e/l/s/image.related.articleLeadwide.620x349.gk7e97.png/1444674907302.jpg", "site_section": "http://feeds.canberratimes.com.au/rssheadlines/entertainment.xml#", "section_title": "Canberra Times Entertainment Headlines", "url": "http://www.canberratimes.com.au/federal-politics/political-news/please-dont-let-my-son-say-isis-muslim-parents-fear-radicalisation-paranoia-20151012-gk7e97", "country": "AU", "title": "Q&A: Muslim parents fear radicalisation paranoia", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "Q&A: Muslim parents fear radicalisation paranoia", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T21:35:00.000+03:00", "replies_count": 0, "uuid": "eb5b2aa86b396c4d869ccc88872fc8bd7869450d"}, "author": "", "url": "http://www.canberratimes.com.au/federal-politics/political-news/please-dont-let-my-son-say-isis-muslim-parents-fear-radicalisation-paranoia-20151012-gk7e97", "ord_in_thread": 0, "title": "Q&A: Muslim parents fear radicalisation paranoia", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Return to video Video settings Please Log in to update your video settings\nVideo will begin in 5 seconds.\nDon't play Play now More video Recommended Q&A tackles radicalisation\n'The Walking Dead' premieres in New York \nAmy Schumer's serious SNL message\nFans treated to 'The Walking Dead' premiere in NY\nObama offers words of advice for Kanye\nReplay video Return to video Video settings Please Log in to update your video settings\nQ&A tackles radicalisation The radicalisation of Muslim youth dominated discussion on ABC program Q&A, with school chaplain Sheikh Wesam Charkawi revealing parents fear their children will be punished for mentioning ISIS in the playground. \nPT1M47S 620 349 Autoplay On Off Video feedback Video settings Muslim leaders in heated argument Push for anti-terror powers over 14-year-olds Muslim parents are terrified their young sons will become unwitting victims of radicalisation \"paranoia\", an Islamic chaplain has revealed just hours after the federal government announced plans to target children as young as 14-years-old with new counter-terrorism laws.\nOn Monday night's Q&A , school chaplain Sheikh Wesam Charkawi said he was often begged by Muslim families to prevent their sons from uttering red flag phrases that could link them to Islamic extremism.\nThe Muslim community fears scrutiny: Sheikh Wesam Charkawi. Photo: Supplied \n\"I come across families all the time, mothers, fathers, where they tell me 'please make sure my son doesn't say the word 'ISIS', the word 'terrorism', or 'extremism'. They have so much fear,\" Mr Charkawi said.\nAdvertisement \"Mind you, this child doesn't have any inclination whatsoever but there's such a fear at the moment. When they go to a school, they are under such scrutiny.\n\"You can literally be a young Muslim boy and say the word ISIS and end up in the principal's office and led away in handcuffs. Society is very paranoid,\" he said.\nMr Charkawi said his job was to provide a safe space for young people to \"air their grievances\" without fearing they could be hauled away in handcuffs.\nHis comments came the same night Attorney-General George Brandis announced the Turnbull government would introduce legislation to Parliament that would seek to lower the age threshold for control orders from 16 to 14 under an overhaul of anti-terrorism laws.\nThe change would mean terrorism suspects as young as 14 would be subject to control orders that restricted their movements and activities.\nThe move follows the murder of police accountant Curtis Cheng by 15-year-old Farhad Jabar outside police headquarters in Parramatta earlier this month. \n\"The one message that I advocate to these children is that violence is never the answer,\" Mr Charkawi said. \n\"I mean, they see injustice in the world and they see inequality in the world, and we all see it, but violence is never the way,\" he said.\nIn July NSW Premier Mike Baird announced a state-wide audit of student prayer groups and urged school staff to contact a dedicated hotline if they suspected extremist behaviour among students following allegations a teenager at Epping Boys High School was spouting extremist views.\nMr Charkawi congratulated Mr Turnbull on his call for calm immediately after the attack, while seeming to criticise former Prime Minster Tony Abbott's response to the Lindt Cafe siege late last year.\n\"When somebody like the Prime Minister comes out and says, 'You know, we shouldn't discriminate and so on and so forth', and speaks about respect, that makes my job far more easy and effective',\" Mr Charkawi said.\n\"When you look at the opposite of that, when you have somebody who says 'We want Muslims to talk about peace and mean it', it's very, very hurtful and it makes my job far more difficult and these are the differences,\" he said.\nDuring his national security statement in February , then Prime Minister Abbott said he wished more muslim leaders would speak of peace and \"mean it\".", "external_links": [], "published": "2015-10-12T21:35:00.000+03:00", "crawled": "2015-10-12T22:20:09.378+03:00", "highlightTitle": ""}