{"organizations": [], "uuid": "2a461797d5bd7d2dc2e6c4354f004895e2f51d23", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news.com.au", "main_image": "http://cdn.newsapi.com.au/image/v1/1a0be7967b44ca1806b8f700bafb9e19", "site_section": "http://feeds.news.com.au/public/rss/2.0/news_ent_3169.xml", "section_title": "NEWS.com.au | Entertainment", "url": "http://www.news.com.au/entertainment/books-magazines/robert-pattinsons-fiance-fka-twigs-reveals-her-desire-to-be-traditional-and-have-children/story-fnk84xng-1227561464774?from=public_rss", "country": "IL", "title": "FKA Twigs wants kids with R-Patz", "performance_score": 0, "site": "news.com.au", "participants_count": 0, "title_full": "FKA Twigs wants kids with R-Patz", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:14:00.000+03:00", "replies_count": 0, "uuid": "2a461797d5bd7d2dc2e6c4354f004895e2f51d23"}, "author": "", "url": "http://www.news.com.au/entertainment/books-magazines/robert-pattinsons-fiance-fka-twigs-reveals-her-desire-to-be-traditional-and-have-children/story-fnk84xng-1227561464774?from=public_rss", "ord_in_thread": 0, "title": "FKA Twigs wants kids with R-Patz", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Email a friend \nTRADITIONAL isn’t normally the first word used to describe FKA Twigs. \nThe usually avant garde British singer, also known as the fiance of Twilight star Robert Pattinson, has revealed her desire to get married and have children in an interview with Paper Magazine . \n“I’m quite traditional. You know that saying, ‘You can take the girl out of the country but you can’t take the country out of the girl’? I grew up in Gloucestershire, and there’s a certain format that people fit into. \n“I’m actually quite happy with the format. I’m quite happy to say, ‘Go to school, work hard on your GCSEs, do your A-Levels, get married, have children. Send your kids to a nice school. Make sure you’re in the right catchment area.’ FKA Twigs on the October cover of Paper Magazine. Picture: Paola Kudacki for Paper Source: Supplied \nPattinson, 29, and FKA Twigs (real name Tahliah Barnett), 27, have been engaged since April this year, which no doubt broke the hearts of females the world over. \nTwigs also explains how her relationship to her fans is somewhat different to how Taylor Swift relates to her fans. \n“I think Taylor Swift is great, but I wouldn’t necessarily think, ‘Oh my god, I have to be friends with her.’ When I meet fans, they’re quite creative and intelligent, kind, sensitive. Some are old ladies, witch doctors from Louisiana, kids that have just left art school. Gay or lesbian couples, straight middle-aged couples …” The happy couple. Picture: by Astrid Stawiarz Source: Getty Images \nShe also goes on to reveal her insights on herself as a performer. \n“I throb. Do you know what I mean? I have that throbbing energy, and I accept it, and I harness it when I need to. It’s not even a conscious thing.” \n“To write things that are like, ‘F**k, that was made, now it’s out,’ you have to be so brave, because ultimately you’re going to get people throwing rocks at your babies — throwing rocks at your songs, your feelings.” FKA Twigs is usually known for being outside the norm. Picture: Matt Cowan Source: Getty Images", "external_links": [], "published": "2015-10-08T03:14:00.000+03:00", "crawled": "2015-10-08T03:23:52.568+03:00", "highlightTitle": ""}