{"organizations": [], "uuid": "086ad05c666c307d220773386338979af199da00", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "lasvegasmagazine.com", "main_image": "", "site_section": "http://www.lasvegassun.com/feeds/headlines/ae/", "section_title": "Las Vegas Sun Stories: Arts & Entertainment", "url": "http://lasvegasmagazine.com/entertainment/2015/oct/16/madonna-mgm-grand/", "country": "CR", "title": "There are pop stars, and then there’s Madonna", "performance_score": 0, "site": "lasvegasmagazine.com", "participants_count": 0, "title_full": "There are pop stars, and then there’s Madonna", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T10:00:00.000+03:00", "replies_count": 0, "uuid": "086ad05c666c307d220773386338979af199da00"}, "author": "", "url": "http://lasvegasmagazine.com/entertainment/2015/oct/16/madonna-mgm-grand/", "ord_in_thread": 0, "title": "There are pop stars, and then there’s Madonna", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Josh Bell"], "text": "There are pop stars, and then there’s Madonna By Josh Bell October 16, 2015 \nAs pop stars go, there’s Madonna, and then there’s everyone else. No other pop singer in the last 30 years has come close to the longevity and continual reinvention of Madonna, who now lands singles on the charts alongside artists decades younger than her. Madonna’s latest album, Rebel Heart , features the singles “Living for Love,” “Ghosttown” and “Bitch I’m Madonna,” all of which topped Billboard’s dance club charts, giving Madonna a record-setting 46 No. 1 singles on that chart, the most for any artist on any Billboard chart. Not only does she continue to create hit singles, but she’s also in demand to collaborate with hot young artists. Both Nicki Minaj and Chance the Rapper make guest appearances on Rebel Heart , and Madonna’s appeared onstage with artists ranging from Miley Cyrus to Macklemore in the past year. \nMadonna’s current tour for Rebel Heart includes songs from the album and a mix of older hits. Never one to simply play through the classics, Madonna typically reimagines and remixes past songs on her tours, and the setlist for this latest outing, in Vegas Oct. 24, includes a medley of early hits (“Dress You Up,” “Into the Groove,” “Everybody,” “Lucky Star”), plus mash-ups of older songs with new ones (“S.E.X.” with “Justify My Love,” “HeartBreakCity” with “Love Don’t Live Here Anymore”). Critics have praised the tour for its positive vibes and playful attitude, another sign of Madonna’s confidence that she can always reach her audience on her own terms. \nMGM Grand, 8 p.m. Oct. 24, ticket prices vary. 800.745.3000 Ticketmaster More to Read", "external_links": [], "published": "2015-10-16T10:00:00.000+03:00", "crawled": "2015-10-16T10:17:01.947+03:00", "highlightTitle": ""}