{"organizations": [], "uuid": "702d70adfd9939fc4b6c4b6b9514c4bc78c0fb4c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/49340334.cms", "site_section": "http://timesofindia.indiatimes.com/entertainment/english/hollywood/news/articlelist/2040742717.cms", "section_title": "Hollywood News, Hollywood Movies, Celebrities, Actress, Actors, Films, Stars | Entertainment - Times of India", "url": "http://timesofindia.indiatimes.com/city/kolkata/Durga-puja-shoppers-make-a-beeline-at-malls-in-Kolkata/articleshow/49340212.cms", "country": "IL", "title": "Durga puja shoppers make a beeline at malls in Kolkata", "performance_score": 0, "site": "indiatimes.com", "participants_count": 1, "title_full": "Durga puja shoppers make a beeline at malls in Kolkata - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:43:00.000+03:00", "replies_count": 0, "uuid": "702d70adfd9939fc4b6c4b6b9514c4bc78c0fb4c"}, "author": "Sumati Yengkhom", "url": "http://timesofindia.indiatimes.com/city/kolkata/Durga-puja-shoppers-make-a-beeline-at-malls-in-Kolkata/articleshow/49340212.cms", "ord_in_thread": 0, "title": "Durga puja shoppers make a beeline at malls in Kolkata", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "KOLKATA: With the biggest festival of Bengal only about a week away, shoppers have been thronging malls and market places in Kolkata. Despite Tuesday being a weekday, shops in different malls saw a surge in footfall. The next few days will see shops, specially ones selling garments and shoes brimming with all roads leading to Kolkata's shopping destinations.\nDurga puja begins from October 19. This is one festival when people in Kolkata splurge on new clothes, shoes and good food in addition to pandal hopping.\n\"I had done some shopping last weekend. Now I cannot wait for the next weekend. With the weekend being only two days ahead of the festival, entering malls itself would be so difficult as thousands will troop in for last minute shopping,\" said Shreyashi Das, employee of a private firm. Das was seen shopping for relatives at a mall here on Tuesday.\nDue to the huge crowd rushing to market places, cops have been having a tough time managing traffic. But the locals are not complaining.\nEven though the festival is still a week away, many puja pandals have been inaugurated in advance as puja committees want to avoid clash of date for their chief guests, some of whom have to inaugurate other pandals. With many stretches being already lit up , the puja fever has already gripped the city.\n\"I love the decked-up city roads with different kind of lightings. I cannot wait to visit the big puja pandals,\" said college student Tanya Sen. Stay updated on the go with Times of India News App. Click here to download it for your device.", "external_links": ["https://play.google.com/store/apps/details?id=com.toi.reader.activities"], "published": "2015-10-14T03:43:00.000+03:00", "crawled": "2015-10-13T18:04:50.346+03:00", "highlightTitle": ""}