{"organizations": [], "uuid": "d96f5689a96403a634a477cde3f3c17ec9703a8c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pjstar.com", "main_image": "http://www.pjstar.com/storyimage/IP/20151014/NEWS/151019671/AR/0/AR-151019671.jpg", "site_section": "http://www.pjstar.com/entertainment?template=rss&mime=xml", "section_title": "Entertainment - Journal Star", "url": "http://www.pjstar.com/article/20151014/NEWS/151019671/2052/ENTERTAINMENT?rssfeed=true", "country": "US", "title": "Comedian Josh Blue opens up about cerebral palsy, 'Last Comic Standing'", "performance_score": 0, "site": "pjstar.com", "participants_count": 1, "title_full": "Comedian Josh Blue opens up about cerebral palsy, 'Last Comic Standing'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T00:29:00.000+03:00", "replies_count": 0, "uuid": "d96f5689a96403a634a477cde3f3c17ec9703a8c"}, "author": "Thomas Bruch", "url": "http://www.pjstar.com/article/20151014/NEWS/151019671/2052/ENTERTAINMENT?rssfeed=true", "ord_in_thread": 0, "title": "Comedian Josh Blue opens up about cerebral palsy, 'Last Comic Standing'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comedian Josh Blue opens up about cerebral palsy, 'Last Comic Standing' Comment Follow @@thomasbruch Posted Oct. 14, 2015 at 4:29 PM PEORIA — One of the best stand-up comedians in the business, Josh Blue , will be performing at the Jukebox Comedy Club this weekend. Blue, 36, won Season Four of “Last Comic Standing” in 2006 and has since been a staple on the stand-up comedy circuit. Though he has earned many plaudits and has been featured frequently in stand-up specials, he might be best known for having cerebral palsy — something he pokes fun at in a self-deprecating manner in his performances. Yet he also talks about it to highlight what you can accomplish while living with the disorder. Blue will appear at the Jukebox at 8 p.m. Thursday, and at 8 p.m. and 10:30 p.m. Friday and Saturday. Tickets cost $20 except for the Thursday show and the late Friday show, which are $15. Tickets can be purchased at the comedy club or online at www.jukeboxcomedy.com . The Journal Star talked to Blue recently about his career, “Last Comic Standing” and another one of his successful endeavors. Q: In retrospect, what’s your opinion on “Last Comic Standing” for younger comedians or comedians who haven’t gotten a shot yet? A: I have mixed feelings about it. Obviously it really helped me blow into the scene. But it’s still a dumb reality show. Any chance a comic can get to get on TV is huge, so it’s definitely something comics look at as a serious way of getting out onto the road. The other side of that is that it doesn’t mean success. After I won, I had to work like five times harder. Q: Your cerebral palsy plays a big role in your jokes and show. When did you become comfortable with doing that? A: I still don’t (long pause). No, I’m just kidding. You know, I didn’t really talk about it much when I first started doing comedy. I was more of a storyteller, talking about experiences. Pretty early on I realized when I started getting personal, I found that people could really relate to it. Not just cerebral palsy but any disability. I really believe everyone has some type of disability. I’m just lucky that mine is on the outside. Q: I thought it was cool to see you were a soccer guy who competed on the Paralympic National Team. What was that experience like? A: I got to be on the National Team for eight years in the Paralympics. Before that, I had very limited play. I love the sport, but in junior high I was cut from the team. Which is pretty heartbreaking. In my humble opinion in junior high, no one should be cut. But that didn’t stop me from kicking the ball around and playing when I could. And I’m so happy I did because I went on to be not a great soccer player, but a pretty good one. Lots of caps and a bunch of international play and 15 goals scored in my career. Page 2 of 2 - Thomas Bruch can be reached at 686-3262 or tbruch@pjstar.com. Follow him on Twitter.com/ThomasBruch .", "external_links": [], "published": "2015-10-15T00:29:00.000+03:00", "crawled": "2015-10-15T08:22:08.311+03:00", "highlightTitle": ""}