{"organizations": [], "uuid": "7e98eec27425a1ad58b05267655c7a18ef725828", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "", "site_section": "http://www.prweb.com/rss2/entertainment.xml", "section_title": "Arts &amp; Entertainment", "url": "http://www.prweb.com/releases/2015/10/prweb13018774.htm", "country": "US", "title": "Animation Indie Crowdfunds to Produce Animated Feature, Games and Miniseries", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Animation Indie Crowdfunds to Produce Animated Feature, Games and Miniseries", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "7e98eec27425a1ad58b05267655c7a18ef725828"}, "author": "Deane Taylor", "url": "http://www.prweb.com/releases/2015/10/prweb13018774.htm", "ord_in_thread": 0, "title": "Animation Indie Crowdfunds to Produce Animated Feature, Games and Miniseries", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Jinko, is a multi-platform animated project which will be produced as a game series, a feature film and a television miniseries.This is a non-combatant fantasy adventure of epic proportions—a modern day fairytale aimed at the 15 and over audience. The central theme of the story is the power of positive thought, seen reflected in young Jinko’s battle against the futility of greed, embodied in the form of a three-headed witch. The theme’s strength is in its simplicity and, importantly, the portrayal of a genuine conscience. Jinko’s animation style employs 2-D and 3-D animation as well as stop-motion and puppetry. The project is currently being crowd-funded through INDIEGOGO to finance the production of a teaser to take out to market. Taylor confirms the initial response has been strong.\n“Jinko is a richly detailed project whose story is almost entirely driven by visual development, so the demand on design is high. It thrills me that even at this early stage we’re getting so many enquiries and offers of involvement from the international animation community as well as voice talent and musicians.”\nThough unable to reveal the specifics at this time, there has already been genuine interest expressed in relation to casting the central character of Jinko. “Suffice to say the actor in discussion is highly experienced, uniquely talented and spirited. She’s the perfect Jinko.”\n“I can announce with great pride that we’ve confirmed Michael Lira as the composer. Sound is a critical element and Mikey’s work brings a sense of madness, genuine emotion, and skillfully woven atmospherics.”\nThe Indiegogo funding campaign for Jinko is scheduled to end on October 23rd.\nhttps://www.indiegogo.com/projects/jinko#/\nhttp://www.michaellira.net/", "external_links": ["https://www.indiegogo.com/projects/jinko#/", "http://www.michaellira.net/", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5taWNoYWVsbGlyYS5uZXQv", "http://www.prweb.net/Redirect.aspx?id=aHR0cHM6Ly93d3cuaW5kaWVnb2dvLmNvbS9wcm9qZWN0cy9qaW5rbyMv"], "published": "2015-10-15T03:00:00.000+03:00", "crawled": "2015-10-15T11:31:06.209+03:00", "highlightTitle": ""}