{"organizations": [], "uuid": "1e4415046b09fbc874bd514de8d31e5aa1dbda2b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kptv.com", "main_image": "", "site_section": "http://kptv.com/category/13540/entertainment?clienttype=rss", "section_title": "KPTV.com - Entertainment - Headline", "url": "http://www.kptv.com/story/30251594/a-look-at-famous-models-from-playboys-naked-past", "country": "US", "title": "A look at famous models from Playboy's naked past", "performance_score": 0, "site": "kptv.com", "participants_count": 1, "title_full": "A look at famous models from Playboy's naked past - KPTV - FOX 12", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "1e4415046b09fbc874bd514de8d31e5aa1dbda2b"}, "author": "cbs8", "url": "http://www.kptv.com/story/30251594/a-look-at-famous-models-from-playboys-naked-past", "ord_in_thread": 0, "title": "A look at famous models from Playboy's naked past", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By CHRISTOPHER WEBER\nAssociated Press LOS ANGELES (AP) - It's the end of an au naturel era. Deciding that less skin is the key to future success, Playboy says it will no longer run photos of completely naked women. Here's a look back at some of the most famous models who have bared all - or most - in the magazine's pages.\n- Marilyn Monroe. The first issue - December 1953 - featured the former Norma Jeane Mortenson on the cover, and sold more than 50,000 copies.\n- Bettie Page. With her trademark brunette bangs, the \"Queen of the Pinups\" was Miss January 1955. None other than Hugh Hefner called her \"an iconic figure in pop culture.\"\n- Jayne Mansfied. Her career was launched when she became one of the first Playmates in February 1955. Mansfield played the blonde bombshell in movies and went on to become a tabloid staple for her off-screen romances. She appeared in the pages of Playboy many times and was on the cover again in June 1963.\n- Ursula Andress. The Bond girl made the June 1965 issue a best-seller and then returned to pose again at age 45 in December 1981.\n- Chyna Lee. The Louisiana native was the first Asian American to pose. Lee titillated film fans with a striptease at the end of Woody Allen's \"What's Up, Tiger Lily?\" She went on to marry - and divorce - comedian Mort Sahl.\n- Barbi Benton. Modeling by age 16, by 18 she was a regular on TV's \"Playboy After Dark.\" Before long she began dating the show's host, Hugh Hefner. She appeared on the cover four times between 1969 and 1985, though she was never a Playmate of the Month.\n- Raquel Welch. The sex symbol and movie star left plenty to the imagination as she posed in a swimsuit for the December 1979 issue. The magazine dubbed Welch the \"Most Desirable Woman\" of the 1970s and went on to rank her number 3 on their \"100 Sexiest Stars of the Twentieth Century\" list.\n- Cindy Crawford. The supermodel came off the runway to pose nude for fashion photographer Herb Ritts in July 1988. A decade later she and Ritts teamed up again for an October 1998 cover shoot. Playboy ranked Crawford number 5 on its list of the \"100 Sexiest Stars of the 20th Century.\"\n- Pamela Anderson. The all-time covers champ, with a total of 13 appearances between 1989 and 2011. The \"Baywatch\" babe was the subject of tabloid obsession for her multiple marriages and a leaked sex tape with husband Tommy Lee. She penned the foreword to the coffee table book \"Playboy's Greatest Covers.\"\n___\nThis story has been corrected to fix the spelling of Mort Sahl's name.\nCopyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-14T00:08:27.162+03:00", "highlightTitle": ""}