{"organizations": [], "uuid": "5a589cf2c7706cd77b0cb5ea2643944f0f22f886", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://images.canberratimes.com.au/2015/10/08/6910297/Thumbnail1001240373gi8n25image.related.thumbnail.320x214.gk420l.png1444270847675.jpg.jpg", "site_section": "http://feeds.canberratimes.com.au/rssheadlines/entertainment.xml#", "section_title": "Canberra Times Entertainment Headlines", "url": "http://www.canberratimes.com.au/entertainment/tv-and-radio/australia-to-officially-compete-in-junior-eurovision-song-contest-2015-20151008-gk420l.html", "country": "AU", "title": "Australia to officially compete in Junior Eurovision Song Contest 2015", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "Australia to officially compete in Junior Eurovision Song Contest 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T05:20:00.000+03:00", "replies_count": 0, "uuid": "5a589cf2c7706cd77b0cb5ea2643944f0f22f886"}, "author": "Ebony Bowden", "url": "http://www.canberratimes.com.au/entertainment/tv-and-radio/australia-to-officially-compete-in-junior-eurovision-song-contest-2015-20151008-gk420l.html", "ord_in_thread": 0, "title": "Australia to officially compete in Junior Eurovision Song Contest 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play video Return to video Video settings Please Log in to update your video settings\nVideo will begin in 5 seconds.\nDon't play Play now More video Recommended Replay video Return to video Video settings Please Log in to update your video settings\nEurovision 2015: Guy Sebastian takes centre stage Making world history, Guy Sebastian represents Australia in the Eurovision finals with his performance of Tonight Again .\nPT0M51S http://www.canberratimes.com.au/action/externalEmbeddedPlayer?id=d-3wj5j 620 349 May 24, 2015 Autoplay On Off Video feedback Video settings Inside the politics of Eurovision Guy Sebastian finishes fifth at Eurovision The Eurovision gods have smiled upon Australia once again, giving the nation a second chance to compete in the famed song contest - with a twist.\nFor the first time ever, a pint-sized Australian will compete in the 13th Junior Eurovision Song Contest taking place in Bulgaria in November, SBS have announced.\nGuy Sebastian of Australia performs on stage during rehearsals ahead of the Eurovision Song Contest 2015. Photo: Getty Images \nAustralians have a long-running obsession with the gaudy yearly event despite living on the other side of the world, and were given a special one-off entry to the Eurovision Song Contest in May.\nAdvertisement Entrant Guy Sebastian finished in the top five but failed to win the contest. Australia would only have been allowed to compete for a second time if we had won the competition.\nThe announcement means Australia will be given a second tilt at the Eurovision crown, albeit on a smaller stage.\nSBS's Eurovision hosts Julia Zemiro and Sam Pang with Guy Sebastian. \nThe junior contest is open to 10 - 15 year olds, with SBS announcing Australia's entrant on Friday.\nThe winner will be given the chance to perform at the 2016 Eurovision Song Contest in Stockholm, which means Europe may not have seen the last of Australians yet.\nAccording to the broadcaster, the song has been co-written by one of the country's \"greatest artists\" and the young singer already has somewhat of a following.\nThe winner of the 2014 Junior Eurovision contest was 14-year-old Naples-born Vincenzo Cantiello. Photo: European Broadcasting Union \nJunior Eurovision Executive Supervisor Vladislav Yakovlev said the franchise was \"thrilled\" Australia was returning after Sebastian's impressive performance.\n \"Australia were so well received in Vienna at the 'big' contest in May this year, and we are thrilled to help them continue this story by coming to Bulgaria in November.\"\nThe annual grown-up version is watched by nearly 200 million people and has been broadcast on SBS for more than 30 years.\nSBS director Michael Ebeid said he was looking forward to giving Australians \"a surprise second dose of Eurovision fun this year\".\n\"We're delighted to have secured another opportunity to showcase Australia's amazing vocal and song writing talent to the world, this time through an incredibly talented young artist.\" \nBust out the glitter and start planning the Eurovision party!\nSBS will broadcast the Junior Eurovision Song Contest at 7.30pm Saturday 28 November.", "external_links": [], "published": "2015-10-08T05:20:00.000+03:00", "crawled": "2015-10-08T15:50:53.044+03:00", "highlightTitle": ""}