{"organizations": [], "uuid": "e203e9a31535a29a05335e5fea2527f4011ff6e8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48524/entertainment", "section_title": "Entertainment - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30172436/nbcuniversal-international-studios-signs-partnership-deal-with-quebecor-content-to-devlop-new-formats", "country": "US", "title": "NBCUniversal International Studios signs partnership deal with Quebecor Content to devlop new formats", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "NBCUniversal International Studios signs partnership deal with Quebecor Content to devlop new formats - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "e203e9a31535a29a05335e5fea2527f4011ff6e8"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30172436/nbcuniversal-international-studios-signs-partnership-deal-with-quebecor-content-to-devlop-new-formats", "ord_in_thread": 0, "title": "NBCUniversal International Studios signs partnership deal with Quebecor Content to devlop new formats", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Quebecor Content\nMajor strategic development partnership agreed to cultivate new global formats\nMONTREAL , Oct. 2, 2015 /CNW Telbec/ - NBCUniversal International Studios and Quebecor Content today announce a major strategic development partnership to co-develop new factual entertainment and studio-based formats suitable for global audiences.\nNBCUniversal International Studios' creative conversations with Quebecor Content will be driven by its London based in-house format lab, Tellycopter. Quebecor Content and NBCUniversal International Studios will share all IP created through the partnership, and NBCUniversal has been granted the rights to exploit the format and distribution rights internationally.\n\"We are pleased to continue our collaborative creative development approach with leading partner, NBCUniversal International Studios. For Quebecor Content, this is another very important step towards globalizing our activities and exporting Quebec -made television\" says France Lauzière, Senior Vice-President, Quebecor Content.\nDavid Mortimer , SVP, Factual & Entertainment, NBCUniversal International Studios adds: \"It is great to be partnering with such a well-established international content provider like Quebecor Content. We are hoping our experience in developing successful and globally renowned entertainment shows, teamed with their invaluable knowledge of the French Canadian TV market, will result in the development of some great new formats that will boast international appeal\".\nNBCUniversal International Studios recently agreed a similar co-development agreement with TV3 in Ireland . Quebecor Content also has strategic partnership deals with TF1 Production, Armoza Formats and French production company, Kabo.\nNBCUniversal International Studios develops and produces high-quality scripted and non-scripted programming in all genres. Tellycopter was launched in Feb 2014 ; tasked with developing the next generation of high impact, large scale, returnable formats for the international market. The unit consists of two complementary teams – one focused on shiny floor entertainment shows, and the other on returnable high-end factual entertainment formats.\nInternational Studio's factual entertainment and entertainment formats include Made in Chelsea for E4 and Newlyweds for Bravo, both produced by its production company, Monkey, The 21 st Question for ITV and Driving School of Mum and Dad for Sky 1, produced by the company's factual entertainment label, Chocolate Media and Matchbox Pictures' The Real Housewives of Melbourne .\nLark Productions, which NBCUniversal International Studios owns an equity stake in, will produce all English language versions of the formats developed for Canada .\nQuebecor Content's latest projects include By Invitation Only , Live From My Home , Only One Knows; all of which are available in the international format market.\nAbout Quebecor Content\nA division of Quebecor Media Inc., Quebecor Content is a leading provider of distinctive, top-quality audio-visual content. Its goal is to offer customers a multi-platform experience, particularly via Videotron and the TVA Group, while showcasing local artists, both here in Quebec and internationally.\nAbout NBCUniversal International Studios\nNBCUniversal International Studios delivers award winning international television to millions across the globe. Based in London , NBCUniversal International Studio's in-house production labels include: Carnival Films, makers of the forthcoming drama The Last Kingdom for BBC Two and creators of the Emmy and Golden Globe award-winning drama sensation Downton Abbey ; Monkey Kingdom, which produces Newlyweds: The First Year, and Channel 4's hit UK reality series, Made in Chelsea ; factual entertainment label Chocolate Media, makers of The 21 st Question for ITV, Driving School of Mum and Dad for Sky 1 and Restoring Britain's Landmarks for Channel 4; Lucky Giant, which specializes in comedy and most recently produced Christopher Guest comedy Family Tree , for both BBC2 and HBO; and Australian-based Matchbox Pictures, makers of critically-acclaimed drama series The Nowhere Boys , The Slap and The Real Housewives of Melbourne .\nAdditionally, NBCUniversal International Studios operates a joint production venture with Working Title Television, owns an equity stake in LARK Productions in Canada ( Motive ) and has a first look deal with Hardy Son & Baker and 87 Films. It also operates a prolific global formats business, and owns Tellycopter, a research and development resource that sits alongside its production companies.\n ", "external_links": ["http://rt.prnewswire.com/rt.gif?NewsItemId=C6964&Transmission_Id=201510021145CANADANWWEB______C6964&DateId=20151002", "http://www.xmlnews.org/ns/"], "published": "2015-10-02T03:00:00.000+03:00", "crawled": "2015-10-03T07:59:12.917+03:00", "highlightTitle": ""}