{"organizations": [], "uuid": "e93d8a597460ec9cd34b13d3a861f9bcad88689a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-560ad8a1/turbine/sc-99-homes-mov-review-20150929-20150929", "site_section": "http://www.chicagotribune.com/entertainment/rss2.0.xml", "section_title": "Arts &amp; Entertainment - Chicago Tribune", "url": "http://www.chicagotribune.com/lifestyles/home/sc-99-homes-mov-review-20150929-20150929-column.html", "country": "US", "title": "'99 Homes' review: Real estate gets devastatingly personal", "performance_score": 0, "site": "chicagotribune.com", "participants_count": 1, "title_full": "'99 Homes' review: Real estate gets devastatingly personal", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T13:00:00.000+03:00", "replies_count": 0, "uuid": "e93d8a597460ec9cd34b13d3a861f9bcad88689a"}, "author": "Michael Phillips", "url": "http://www.chicagotribune.com/lifestyles/home/sc-99-homes-mov-review-20150929-20150929-column.html", "ord_in_thread": 0, "title": "'99 Homes' review: Real estate gets devastatingly personal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "'99 Homes' review: Real estate gets devastatingly personal '99 Homes' Hooman Bahrani / Broad Green Pictures \nAndrew Garfield, left, plays a construction worker, and Michael Shannon a real estate operator in \"99 Homes.\" \nAndrew Garfield, left, plays a construction worker, and Michael Shannon a real estate operator in \"99 Homes.\" (Hooman Bahrani / Broad Green Pictures) Michael Phillips Contact Reporter Would you flip a house with this man? \nWell before 1925, when the Marx Brothers cavorted through a story about the Florida real estate craze in \"The Cocoanuts\" on Broadway, the Sunshine State real estate explosion became the boom heard around the world. But explosions go both ways, semantically speaking. When a housing market \"blows up,\" it can mean success or failure, money or disaster. Or money made on the backs of other people's disaster. \nThe storyline in the tense new drama \"99 Homes,\" set in 2010, wasn't and isn't strictly a Florida phenomenon. But the movie wouldn't work as well situated anywhere else. Michael Shannon, probably the busiest good actor in movies today, plays Rick Carver, the master house-flipper and real estate exploiter whose money is made on bank foreclosure properties, of which there is a scary supply in the wake of the worst recession since the '30s. \nWhen we first see Carver, he's in his element: inside a foreclosed house. But this home's former owner is a bloody mess, dead in the bathroom by a self-inflicted gunshot. Berating the police, his own workers and whoever's on the other end of the cellphone, Carver barrels through his own life, evicting this one, flipping that one. Real estate isn't personal, he says. \nOne of the unlucky soon-to-be-ex-homeowners is construction worker Dennis Nash, played by Andrew Garfield, who lives with his son (Noah Lomax) and his mother (Laura Dern) in a home they're about to lose. \"99 Homes\" establishes its stakes vividly and well in its opening passages. Almost immediately Nash goes to work for the very man, Carver, responsible for (or at least symbolic of) his no-win circumstance. He needs the money. Nash is a smart man, and the Faustian bargain he cuts with Carver lifts Nash's family out of their lousy temporary housing at a motel populated largely by the evicted. \nFor a long time, Nash lies to his loved ones about Carver, his newfound employer/mentor/corrupter. It's a delayed-secret film, in other words, in addition to being an angry, topical study in what it means to game a cynically unreliable system. \nThe movie comes from co-writer and director Ramin Bahrani, and it's a change-up in tone and rhythm from his earlier work, a lot of which is terrific. In \"Man Push Cart,\"\"Chop Shop\" and \"Goodbye Solo,\" Bahrani created lovely, patient character studies grounded in concrete, shrewdly detailed sociological detail. Before \"99 Homes,\" Bahrani made a more conventionally plotted family-farm potboiler, \"At Any Price,\" with Dennis Quaid and Zac Efron. Compared with Bahrani's earlier work, the narrative felt awkwardly developed. \"99 Homes\" basically works in a way that \"At Any Price\" didn't quite. \nThere are some lurches in the final third of the film, written by Bahrani and Amir Naderi, when Nash bottoms out before his moral reckoning. It's not a subtle film, though the reason it succeeds has everything to do with the skill and nuance the actors playing the devil and Faust bring to the project. \nAt this point in his career, Shannon could play a wolf such as Carver in his sleep and he'd still be effective. He takes pains, however, not to depict this hollow, e-cig-wielding destroyer of people's souls as a subhuman character. He gets things done; he doesn't kick the nearest dog. He's too busy kicking the nearest human out onto the curb. Carver needs a foil, and even a bit of a conscience, and he finds both in Nash, played by Garfield as a wily, adaptable but increasingly haunted good man. The movie sometimes has the air of a thesis statement about greed and wanton economic destruction. But at its best, \"99 Homes\" finds Bahrani tightening the screws on his own style, going for speed, concision and an agitating rhythm where his previous films took their time. I hope he'll go on to make movies combining the vital aspects of all his work. \nMichael Phillips is a Tribune critic.", "external_links": [], "published": "2015-10-01T13:00:00.000+03:00", "crawled": "2015-10-01T14:20:55.929+03:00", "highlightTitle": ""}