{"organizations": [], "uuid": "6f13917f3b6aa22e6b52b085d7edc88511e588d2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.examiner.com", "main_image": "http://cdn2-b.examiner.com/sites/default/files/styles/image_content_width/hash/cd/5b/cd5b2996e98521de0ef267fc6564a347.jpg?itok=JcuRzu71", "site_section": "http://www.examiner.com/arts-and-entertainment", "section_title": "Arts &amp; Entertainment | Examiner.com", "url": "http://www.examiner.com/article/amir-khan-mentions-floyd-mayweather-and-says-manny-pacquiao-isn-t-playing-ball-1", "country": "US", "title": "Amir Khan mentions Floyd Mayweather and says Manny Pacquiao isn’t ‘playing ball’", "performance_score": 0, "site": "examiner.com", "participants_count": 1, "title_full": "Amir Khan mentions Floyd Mayweather and says Manny Pacquiao isn’t ‘playing ball’ | Examiner.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:52:00.000+03:00", "replies_count": 0, "uuid": "6f13917f3b6aa22e6b52b085d7edc88511e588d2"}, "author": "Colin Linneweber", "url": "http://www.examiner.com/article/amir-khan-mentions-floyd-mayweather-and-says-manny-pacquiao-isn-t-playing-ball-1", "ord_in_thread": 0, "title": "Amir Khan mentions Floyd Mayweather and says Manny Pacquiao isn’t ‘playing ball’", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Play Bolton welterweight Amir Khan is waiting in the wings to fight either Floyd Mayweather or Manny Pacquiao should the pair's planned blockbuster bout fall through. on.aol.com Former IBF and WBA light-welterweight titleholder Amir Khan told The National that he is “no longer fighting Manny Pacquiao.”\nPhoto by Al Bello/Getty Images Because the Filipino slugger is still recovering from arthroscopic surgery on his right shoulder, Khan (31-3, 19 KOs) had hoped to battle the 36-year-old Pacquiao (57-6-2, 38 KOs) in either February or March.\n“I’m really disappointed in Manny and his team,” said Khan , 28, who captured silver as a 17-year-old lightweight at the 2004 Olympic Games in Athens, Greece. “They aren’t playing ball. All that was left to do is to sign the contract. But they are stalling. I have pulled out of the negotiations. I am no longer fighting Manny Pacquiao…I am not going to wait around for Manny like I did for (Floyd) Mayweather.”\nPacquiao, who tore his rotator cuff roughly three weeks before getting outclassed by the 38-year-old Mayweather (49-0, 26 KOs) on May 2, failed to properly inform the Nevada State Athletic Commission about his injury. Pacquiao was subsequently prohibited from taking an anti-inflammatory shot, fought timidly, and was outscored by Mayweather by embarrassing counts of 116-112, 116-112 and 118-110.\nApproximately four weeks after the Pacquiao debacle, Khan won an exciting unanimous decision over ballsy New Yorker Chris Algieri in their welterweight clash on May 29. Khan, who became one of the most youthful British champs ever at the age of 22, officially defeated the 31-year-old Algieri (20-2, 8 KOs) by scores of 115-113, 117-111 and 117-111. Using deft footwork and an effective jab, the 5-foot-11 Algieri frequently rocked the 5-foot-8 Khan with flush shots. Fortunately for the 8-1 favorite, Algieri possesses feathery fists and his punches couldn’t even floor the delicate Khan. “King Khan” ultimately escaped by leaning on his elite speed and pinpoint accuracy.\nPacquiao is an eight-division titleholder who the Boxing Writers Association of America named its “Fighter of the Decade for the 2000s.” The speedy southpaw used his superior quickness to land blistering combinations and become one the world’s premier pound-for pounders.\nComparatively, Khan is also extremely quick and his punches are consistently launched with tremendous precision. However, although gifted, Khan is a human chandelier whose glass jaw will prevent him from ever becoming an elite prizefighter. If the brittle Khan had thrown fists with the shopworn Filipino, Pacquiao would have secured his first knockout since November 2009 when he finished Miguel Cotto in the 12th.\nFortunately for Amir Khan, Manny Pacquiao and his team “aren’t playing ball.”", "external_links": ["http://boxrec.com/boxer/314558", "http://boxrec.com/boxer/6129", "http://www.thenational.ae/sport/boxing/amir-khan-says-of-hoped-for-pacquiao-fight-i-have-pulled-out-of-negotiations"], "published": "2015-10-16T03:52:00.000+03:00", "crawled": "2015-10-16T05:23:37.380+03:00", "highlightTitle": ""}