{"organizations": [], "uuid": "a301f767fc1519c503382d78138517f5415417e6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbsnews.com", "main_image": "http://cbsnews1.cbsistatic.com/hub/i/r/2015/04/22/0a735c39-ce4f-4719-abbb-6e69d57b2b5d/thumbnail/620x350/824fa415b5a215e51a708016d813847a/476574965.jpg", "site_section": "http://www.cbsnews.com/entertainment/", "section_title": "Entertainment News, Headlines and Video - CBS News ", "url": "http://www.cbsnews.com/news/has-sandra-bullock-adopted-a-second-child/", "country": "US", "title": "Has Sandra Bullock adopted a second child?", "performance_score": 0, "site": "cbsnews.com", "participants_count": 1, "title_full": "Has Sandra Bullock adopted a second child? - CBS News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T17:45:00.000+03:00", "replies_count": 0, "uuid": "a301f767fc1519c503382d78138517f5415417e6"}, "author": "Antoinette Bueno ET Online", "url": "http://www.cbsnews.com/news/has-sandra-bullock-adopted-a-second-child/", "ord_in_thread": 0, "title": "Has Sandra Bullock adopted a second child?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sandra Bullock has reportedly adopted a second child.\nThe 51-year-old actress has chosen to expand her family, according to RadarOnline.com .\nA source tells ET that there have been recent sightings of Bullock out and about with a toddler. The \"Gravity\"star previously adopted her son, Louis Bardo Bullock, now 5 years old, in 2010.\nWatch: Sandra Bullock's rumored new man Bryan Randall goes shirtless, shows off abs A rep for Bullock previously declined to comment on reports of the adoption, and could not be reached on Thursday.\nSandra gushed about Louis in June, telling ET at the \"Minions\" premiere in London that her son is constantly surprising her . \"Louis has no idea that I'm in this film,\" Bullock smiled. \"He won't put two and two together -- at least not anytime soon. If he does, I'll be shocked. The kid surprises me all the time.\"\nThe actress also stressed just how much she loves her little boy. \"I mean, like people go, 'Your adopted son.' I go, 'Please don't say that. He is my son!' I would give my life for him,\" she told ET's Kevin Frazier in June.\nWhen she was crowned People magazine's \"Most Beautiful Woman\" in April, the Oscar-winning actress also gushed that it's her role as mom that actually makes her feel the most beautiful. \"I was putting [Louis] to bed and told him that even when I'm old and gray and more wrinkly than I am now, I'll still love him and want to tuck him in,\" she recalled to the magazine. \"And he asked why I have wrinkles, and I said, 'Well, I hope some of them are from laughing so much.' And he touched my face and said, 'You're not old, you're just happy.'\"\nWatch: Sandra Bullock plays coy about new boyfriend These days, things couldn't be looking better for Sandra, who also appears to be in a new relationship. The actress has been spotted on multiple dinner dates with 49-year-old model and photographer Bryan Randall , including one double date with her pals Jennifer Aniston and Justin Theroux last month in Austin, Texas. The two weren't shy about showing some PDA , with Bryan seen caressing Sandra's back, an onlooker told ET.\nThis would mark her first public relationship since divorcing her ex-husband, Jesse James , in 2010.\nSandra was coy about her reported new relationship when ET caught up with her in September at the Toronto Film Festival. where she premiered her film \"Our Brand Is Crisis.\" \"Who says I have a new boyfriend?\" she teased. \"Everything in my life is great right now.\"", "external_links": ["http://www.etonline.com/news/171731_sandra_bullock_plays_coy_about_new_boyfriend_everything_my_life_is_great/", "http://www.etonline.com/news/172716_sandra_bullock_ex_husband_jesse_james_ays_losing_my_son_was_the_hardest_part_of_the_split/", "http://radaronline.com/celebrity-news/sandra-bullock-adopts-baby-girl-sister-louis/", "http://www.etonline.com/news/171539_inside_sandra_bullock_and_bryan_randall_romantic_double_date_with_jennifer_aniston_and_justin_theroux/", "http://www.etonline.com/news/171016_sandra_bullock_new_man_bryan_randall_shows_off_his_impressive_shirtless_bod/", "http://www.etonline.com/movies/166061_sandra_bullock_son_louis_has_no_idea_his_mom_is_an_actress/"], "published": "2015-10-02T17:45:00.000+03:00", "crawled": "2015-10-03T07:48:06.207+03:00", "highlightTitle": ""}