{"organizations": [], "uuid": "d7800c1c08c94376f7e92836b07f2946796f5e1a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.huffingtonpost.co.uk", "main_image": "http://i.huffpost.com/gen/3575258/images/o-DAVID-BECKHAM-facebook.jpg", "site_section": "http://www.huffingtonpost.co.uk/feeds/verticals/uk-entertainment/index.xml", "section_title": "UK Entertainment - The Huffington Post", "url": "http://www.huffingtonpost.co.uk/2015/10/23/david-beckham-tattoos-rose-neck-pictures_n_8366924.html", "country": "US", "title": "David Beckham Has A New Tattoo On His Neck. Let's Hope He Stops At The Face.", "performance_score": 0, "site": "huffingtonpost.co.uk", "participants_count": 1, "title_full": "David Beckham Has A New Tattoo On His Neck. Let's Hope He Stops At The Face.", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T13:36:00.000+03:00", "replies_count": 0, "uuid": "d7800c1c08c94376f7e92836b07f2946796f5e1a"}, "author": "Matt Bagwell", "url": "http://www.huffingtonpost.co.uk/2015/10/23/david-beckham-tattoos-rose-neck-pictures_n_8366924.html", "ord_in_thread": 0, "title": "David Beckham Has A New Tattoo On His Neck. Let's Hope He Stops At The Face.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Previous Story Next Story David Beckham Has A New Tattoo On His Neck. Let's Hope He Stops At The Face. The Huffington Post UK | By Matt Bagwell \nDavid Beckham will have a tattooed face in approximately three years time. This is a fact. READ MORE: David Beckham's Kids Tell Him What They Really Think Of His Acting \nOK, maybe we don’t know that’s a foregone conclusion BUT if the former footballer carries on inking his body then that beautiful face of his will be the only option left, given that he’s rapidly running out of room elsewhere. \nCase in point being the latest addition to his vast collection - a rose. High up on his neck. A photo posted by Victoria Beckham (@victoriabeckham) on Oct 22, 2015 at 7:47pm PDT \nS ? Things are slowly creeping up. \nDavid’s wife, Victoria Beckham, shared a snap of her hubby showing off his new tat as he caught some rays in LA on Thursday. \nBeck’s latest inking is just above his ‘Pretty Lady Harper’ tattoo that he had done in honour of his four-year-old daughter. \nThe retired footballer now has more than 40 tattoos covering his body, including a giant guardian angel as well as tributes to his other children – Brooklyn, Romeo, Cruz and Harper – and wife Victoria. \nSpeaking of Victoria, earlier this month the former Spice Girl turned fashion designer finally broke her silence over rumours that her marriage to David is on the rocks, stating that the couple ‘have nothing to prove’. \nThe 41-year-old maintained that she doesn’t ‘listen to rumours’ but set the record straight about her marriage in an interview with Grazia magazine. \n“I have never listened to, or commented on, the rumours about any aspect of my life,\" she tells the magazine. \n“I am blessed to have a wonderful husband and beautiful, healthy, happy children. Yes, we travel a lot with our respective businesses and charitable commitments, but we always make time for each other as a couple and as a family. \n“David and I have nothing to prove. We love each other, look out for each other and are strong as both partners and parents.” Close", "external_links": [], "published": "2015-10-23T13:36:00.000+03:00", "crawled": "2015-10-23T15:18:41.189+03:00", "highlightTitle": ""}