{"organizations": [], "uuid": "f1cb3df77fedea4fbbb744e86ce9afd8d80f7894", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.deseretnews.com", "main_image": "http://img.deseretnews.com/images/article/hires/1609113/1609113.jpg", "site_section": "http://www.deseretnews.com/family/arts-entertainment/index.rss", "section_title": "The latest entertainment, arts, movie reviews, music reviews, video game reviews and book reviews - Deseret News", "url": "http://www.deseretnews.com/article/865638682/YA-author-Margaret-Stohl-helps-create-new-Marvel-superhero-in-Black-Widow-Forever-Red.html", "country": "US", "title": "YA author Margaret Stohl helps create new Marvel superhero in 'Black Widow: Forever Red'", "performance_score": 0, "site": "deseretnews.com", "participants_count": 1, "title_full": "YA author Margaret Stohl helps create new Marvel superhero in 'Black Widow: Forever Red' | Deseret News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T03:00:00.000+03:00", "replies_count": 0, "uuid": "f1cb3df77fedea4fbbb744e86ce9afd8d80f7894"}, "author": "Hikari Loftus", "url": "http://www.deseretnews.com/article/865638682/YA-author-Margaret-Stohl-helps-create-new-Marvel-superhero-in-Black-Widow-Forever-Red.html", "ord_in_thread": 0, "title": "YA author Margaret Stohl helps create new Marvel superhero in 'Black Widow: Forever Red'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "When author Margaret Stohl signed on to write the first young adult prose novel about the famous comic book super spy Black Widow, she didn’t realize it would lead to her involvement in creating an entirely new canonized Marvel hero, Red Widow.\nWhen author Margaret Stohl signed on to write the first young adult prose novel about the famous comic book super spy Black Widow, she didn’t realize it would lead to her involvement in creating an entirely new canonized Marvel hero.\n“In the course of writing the story for Black Widow, Red Widow was almost accidentally born,” said Stohl, the co-author of the Beautiful Creatures series and author of the Icons series. “I worked so closely with Sana Amanat from Marvel and Emily Meehan from Disney that we were able to really evolve her.\"\nStohl, who grew up in a Marvel-loving family, said taking on the project was both the greatest and the scariest thing she’s done in her writing career. Taking on Black Widow's 50-year history and various depictions, then consolidating them, was nothing short of monumental.\n“There are so many versions of (Black Widow) to reconcile, and she’s had so many iterations,” said Stohl, a part-time Park City resident. “So many creators, so many artists, screenwriters, film directors, colorists, going back to Stan Lee  plus all the comic cons, so I was paralyzed.”\nStohl decided “Black Widow: Forever Red” (Marvel, $17.99, ages 13 and up), which will be released Tuesday, Oct. 13, would be an origin story, allowing her the flexibility to tell backstories on the characters and tell a version of Black Widow’s history that hadn’t yet been told.\n“I wanted to get as emotionally as I could in her head, which was tricky for a character who has a lot of secrets,” Stohl said.\nStohl said she immersed herself in comics, reading every single one she could get her hands on, in roughly the right chronology, to pinpoint the basic history and what would work for teen readers and the Marvel fandom.\n“The key when you are working on a fandom property like that is respect,” Stohl said. “You really have to respect the character you are working on, you have to respect the fans, you have to respect the 50 years of history, you have to respect the fact that she’s a woman, you have to respect the teen readers and the teens in the book.”\n“Forever Red” tells two stories that merge into one: the story of how Natasha Romanoff became the lethal spy and assassin known as Black Widow in the Red Room — Moscow’s infamous academy for operatives — and the story of Ava Orlova, a young girl trying to survive on the streets of Brooklyn years after Black Widow saved her from horrible military experiments and placed her under the protection of S.H.I.E.L.D.\nWhen the Red Room tech starts appearing again, followed by the disappearance of children all over Eastern Europe, Natasha and Ava discover their lives are more connected than they thought. Together, they must learn to trust and open up to each other in ways that will allow them to search their pasts and find the key to destroying their old tormentor. There is some generally described violence throughout the book but no swearing or sexual content.\n“I started working on these teen characters (in Black Widow’s story),” Stohl said. “And when it became clear what was going on with our new character, the Red Widow, Marvel stepped up and said, ‘We want to do a comic with her.’”\nIn September, Marvel took the character Red Widow, created in Stohl’s novel, and revealed her in a short story as part of “Mockingbird: S.H.I.E.L.D. 50th Anniversary No. 1,” one of four female-led celebratory one-shot comics that were released for the S.H.I.E.L.D. 50th anniversary. Red Widow’s full identity and origin story will be revealed in “Black Widow: Forever Red” this month.", "external_links": ["http://books.disney.com/book/black-widow-forever-red/"], "published": "2015-10-11T03:00:00.000+03:00", "crawled": "2015-10-11T10:25:15.166+03:00", "highlightTitle": ""}