{"organizations": [], "uuid": "01bc96eecfc575b783bc84374a31f44fefd3d52c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.yahoo.com", "main_image": "http://l1.yimg.com/bt/api/res/1.2/MTZy4FiISaXeYxjl1tcScQ--/YXBwaWQ9eW5ld3NfbGVnbztpbD1wbGFuZTtxPTc1O3c9NjAw/http://media.zenfs.com/en_us/News/ap_webfeeds/a227c20b2130ec30850f6a706700f852.jpg", "site_section": "http://news.yahoo.com/rss/entertainment", "section_title": "Entertainment News Headlines — Yahoo! News", "url": "http://news.yahoo.com/bolshoi-theater-names-la-scalas-vaziev-ballet-director-124426197.html", "country": "US", "title": "Bolshoi Theater names La Scala's Vaziev as ballet director", "performance_score": 0, "site": "yahoo.com", "participants_count": 1, "title_full": "Bolshoi Theater names La Scala's Vaziev as ballet director - Yahoo News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T02:00:00.000+02:00", "replies_count": 0, "uuid": "01bc96eecfc575b783bc84374a31f44fefd3d52c"}, "author": "KATHERINE JACOBSEN", "url": "http://news.yahoo.com/bolshoi-theater-names-la-scalas-vaziev-ballet-director-124426197.html", "ord_in_thread": 0, "title": "Bolshoi Theater names La Scala's Vaziev as ballet director", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MOSCOW (AP) — The Bolshoi Theater announced Monday that Makhar Vaziev, the Russian ballet director at Italy's La Scala, will join the renowned Moscow theater early next year.\nVaziev will replace Sergei Filin, who lost much of his sight as the result of an acid attack organized by a disgruntled dancer in January 2012. The attack shocked the international ballet world and exposed infighting within the theater.\nIn presenting Vaziev, Bolshoi general director Vladimir Urin said he would officially take up his new post on March 18 when Filin's contract ends.\n\"Vaziev will come as soon as the opportunity arises to discuss plans for the next season and decide organizational and artistic questions. I hope everything will go well,\" Urin said.\nFilin's future was unclear. Urin said he hoped he would stay with the Bolshoi, but did not say what Filin's new role might be.\nAfter the Bolshoi announced in July that his contract would not be renewed, Filin told the news agency Tass that he had \"no grounds for hard feelings.\" He did not say what his next step would be, only that he \"needed to go further to fulfill his professional goals and do something new.\"\nVaziev was director of the Kirov Ballet of the Mariinsky Theater in St. Petersburg from 1995 to 2008, before moving to La Scala in early 2009.\nHis tenure at the Mariinsky Theater \"marked the advent of outstanding performers and new choreographers,\" said Urin.\nOriginally from Alagir, a small town in North Ossetia in the Caucasus Mountains of southern Russia, Vaziev was accepted in 1973 at age 12 to the Vaganova Academy in St. Petersburg, then Leningrad. After graduation, he stayed on at the Mariinsky, becoming a principle dancer.\nVaziev on Monday expressed gratitude for everything the Mariinsky Theater had done for him.\nDance Performing Arts Sergei Filin Bolshoi Theater Vladimir Urin La Scala Mariinsky Theater Russian ballet", "external_links": [], "published": "2015-10-26T02:00:00.000+02:00", "crawled": "2015-10-26T20:27:16.955+02:00", "highlightTitle": ""}