{"organizations": [], "uuid": "52c3d96a338c1a9e6e0d93e5470e23f81f2d3507", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chron.com", "main_image": "http://ww2.hdnux.com/photos/41/51/23/8819961/3/rawImage.jpg", "site_section": "http://www.chron.com/rss/feed/Entertainment-293.php", "section_title": "Entertainment", "url": "http://www.chron.com/entertainment/restaurants-bars/article/James-Beard-Award-winning-chef-to-visit-Houston-6579356.php", "country": "US", "title": "James Beard Award-winning chef to visit Houston -", "performance_score": 0, "site": "chron.com", "participants_count": 1, "title_full": "James Beard Award-winning chef to visit Houston - Houston Chronicle", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T18:52:00.000+03:00", "replies_count": 0, "uuid": "52c3d96a338c1a9e6e0d93e5470e23f81f2d3507"}, "author": "chron.com", "url": "http://www.chron.com/entertainment/restaurants-bars/article/James-Beard-Award-winning-chef-to-visit-Houston-6579356.php", "ord_in_thread": 0, "title": "James Beard Award-winning chef to visit Houston -", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photo: Macy's Culinary Council Image 1 of / 5 5 Chicago chef Stephanie Izard will visit Houston on Oct. 28 to hold a Halloween-themed children's cooking class at Macy's Memorial City. Chicago chef Stephanie Izard will visit Houston on Oct. 28 to hold a Halloween-themed children's cooking class at Macy's Memorial City. Photo: Macy's Culinary Council Image 2 of 5 Sunchoke Soup with Olives and Grapefruit from \"Girl in the Kitchen: How a Top Chef Cooks, Thinks, Shops, Eats, and Drinks\" by Stephanie Izard with Heather Shouse (Chronicle Books, $24.95). Sunchoke Soup with Olives and Grapefruit from \"Girl in the Kitchen: How a Top Chef Cooks, Thinks, Shops, Eats, and Drinks\" by Stephanie Izard with Heather Shouse (Chronicle Books, $24.95). Photo: Dan Goldberg Image 3 of 5 Clams Steamed with Corn, Bacon and Fingerlings from \"Girl in the Kitchen: How a Top Chef Cooks, Thinks, Shops, Eats, and Drinks\" by Stephanie Izard with Heather Shouse (Chronicle Books, $24.95). Clams Steamed with Corn, Bacon and Fingerlings from \"Girl in the Kitchen: How a Top Chef Cooks, Thinks, Shops, Eats, and Drinks\" by Stephanie Izard with Heather Shouse (Chronicle Books, $24.95). Photo: Dan Goldberg Image 4 of 5 Cover: \"Girl in the Kitchen: How a Top Chef Cooks, Thinks, Shops, Eats, and Drinks\" by Stephanie Izard with Heather Shouse (Chronicle Books, $24.95). Cover: \"Girl in the Kitchen: How a Top Chef Cooks, Thinks, Shops, Eats, and Drinks\" by Stephanie Izard with Heather Shouse (Chronicle Books, $24.95). Photo: Dan Goldberg Image 5 of 5 In this image released by Bravo, \"Top Chef\" contestant Stephanie Izard is shown. Izard, 31, won the title of Top Chef during the season finale of \"Top Chef\", Bravo's reality cooking competition on Wednesday, June 11, 2008.\nIn this image released by Bravo, \"Top Chef\" contestant Stephanie Izard is shown. Izard, 31, won the title of Top Chef during the season finale of \"Top Chef\", Bravo's reality cooking competition on Wednesday, ... more Photo: Chuck Hodes, AP James Beard Award-winning chef to visit Houston 1 / 5 Back to Gallery Any foodie who plans vacations by making restaurant reservations has no doubt put Stephanie Izard 's Girl & the Goat on their must-eat list when traveling to Chicago.\nOn Oct. 28 the Girl is coming to Houston. If you have any budding gourmands in your household, Izard's appearance at Macy's Memorial City will be of interest. The chef, who won Season 4 of Bravo's \"Top Chef\" in 2008, will hold a Halloween-themed children's cooking class at store's Home Department on Level 2 at 5 p.m. on Oct. 28. She will share Halloween tips, tricks and treats. Yes, there will be samples to taste. Yes, parents and their children are invited to wear Halloween costumes.\nSeats may be pre-purchased for the class for $35 by calling 877-556-2297 through Oct. 28 from 9 a.m. to 5 p.m. CST. With any purchase of $35 or more in the Home Department at Macy's Memorial City before the event will receive a reserved seat to the class, a $10 Macy's gift card, and a copy of \"Girl in the Kitchen\" which Izard will sign after the event, time permitting. The gift card is valid from Oct. 8 to Nov. 4. Izard's appearance is part of Macy's Culinary Council.\nIzard opened Girl & the Goat in 2010 and won the James Beard Foundation award for Best Chef, Great Lakes in 2013. Two years after opening Girl & the Goat she opened Little Goat. She is close to opening the Chinese-influenced restaurant, Duck Duck Goat.", "external_links": ["http://ww2.hdnux.com/photos/41/51/23/8819961/3/square_gallery_thumb.jpg", "http://www.stephanieizard.com/", "http://ww3.hdnux.com/photos/41/51/23/8819962/3/920x920.jpg", "http://ww3.hdnux.com/photos/41/51/23/8819966/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/41/51/23/8819962/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/41/51/23/8819965/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/41/51/24/8819969/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/41/51/23/8819966/3/920x920.jpg", "http://ww2.hdnux.com/photos/41/51/24/8819969/3/920x920.jpg", "http://ww2.hdnux.com/photos/41/51/23/8819961/3/920x920.jpg", "http://ww2.hdnux.com/photos/41/51/23/8819965/3/920x920.jpg"], "published": "2015-10-20T18:52:00.000+03:00", "crawled": "2015-10-20T23:15:16.784+03:00", "highlightTitle": ""}