{"organizations": [], "uuid": "fa119f56dc39965fc020c0dc33b3f2190105bb5d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.edmontonsun.com", "main_image": "http://storage.edmontonsun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297756765654_LARGE_BOX.jpg?quality=80&stmp=1444074368846&size=100x", "site_section": "http://www.edmontonsun.com/entertainment/rss.xml", "section_title": "Top Entertainment stories", "url": "http://www.edmontonsun.com/2015/10/05/the-sheepdogs-make-their-next-move-with-future-nostalgia", "country": "CA", "title": "The Sheepdogs make their next move with 'Future Nostalgia'", "performance_score": 0, "site": "edmontonsun.com", "participants_count": 0, "title_full": "The Sheepdogs make their next move with 'Future Nostalgia'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T22:36:00.000+03:00", "replies_count": 0, "uuid": "fa119f56dc39965fc020c0dc33b3f2190105bb5d"}, "author": "", "url": "http://www.edmontonsun.com/2015/10/05/the-sheepdogs-make-their-next-move-with-future-nostalgia", "ord_in_thread": 0, "title": "The Sheepdogs make their next move with 'Future Nostalgia'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "So say Saskatoon retro-rockers The Sheepdogs . \nThe group’s just-released latest album, Future Nostalgia, is the follow-up to their 2012 self-titled major label release (co-produced by the Black Keys’ Pat Carney in Nashville), and comes four years after winning an unsigned band contest to get on the RS cover. They previously self-released three albums before that. \n“We’re trying to hit the ground running,” said Sheepdogs lead singer-songwriter Ewan Currie, who also co-produced Future Nostalgia in a rented house in Stony Lake, Ont., where they recorded for three weeks. \n“The reality is no band can coast off a Rolling Stone competition forever. We were pretty aware of that even back then.” \nSo, was the RS cover a blessing or a curse? \n“I think it was mostly a blessing,” said bassist Ryan Gullen. \n“Looking back on it, retrospectively, some things about it, obviously being associated with a contest or something like that is a little bit of a weird thing. We are a band. We’ve been a band for a long time. But at the same time it afforded us so many opportunities and put us in a position where it put us in the spotlight. So it’s always going to be a part of our story... This is kind of our next step to step away from that.” \nWe caught up with Currie and Gullen, now both Toronto-based, to talk Future Nostalgia, long hair vs. short, and having a new guitarist. \nWas the new album’s title a play on your retro-rock sound? \nEwan: I think there’s no doubt that our music definitely sort of harkens back to an older time. And music is a very powerful, nostalgic force. Other than smell it might be the No. 1 nostalgic trigger. \nEwan, is there something you wanted to accomplish as co-producer? \nEwan: I always say you try to sound like your heroes up here (points to his head), and you get part of the way and fail, and wherever you land is kind of how you sound. Like we’re never going to sound like The Beatles or the Allman Brothers or the Stones or whatever but we’re going to sound like our version of whatever they’re doing. \nFuture Nostalgia features new players in the form of Winnipeg guitarist Rusty Matyas, who replaced Leot Hanson who left in 2014, and Ewan’s brother Shamus on keyboards-horns, who has been onstage with you since 2012. What was that like? \nRyan: Rusty is someone we’ve known for eight or nine years, something like that. He used to play in a band called The Waking Eyes and Imaginary Cities, but he was also the fifth Weakerthans guy. It came to a point where we needed to have a new guitar player. We had a whole new string of shows coming up. We called on him because he’s great musician. \nSo it worked out obviously since you’re playing the U.S. in October and November plus you have a Grey Cup Festival date at Winnipeg’s RBC Convention Centre on Nov. 27 before a January-February Canadian tour? \nRyan: Bringing somebody into the fold of something’s that existed for as long as it has can be a little bit weird and in this situation we already knew that we were pals and it was a very positive force. So it was great to have him in there. \nAnd what happened with Leot Hanson? \nRyan: We’re not really supposed to chat about that if that’s okay. It comes up. It’s just kind of weird (question) for us. \nOkay, easier question. Ewan, you cut your long hair – a Sheepdogs trademark – how come? \nEwan: I don’t mind having a beard. It’s just the long hair. It’s hot and sweaty. \nSo are you next Ryan? \nRyan: I don’t know. I kind of like having long hair even though it’s a pain in the ass. I like it. I’m definitely envious of like having a shower and go out immediately. My hair, if I don’t let it dry a little bit before I go outside, it’s gigantic.", "external_links": [], "published": "2015-10-05T22:36:00.000+03:00", "crawled": "2015-10-05T23:33:54.041+03:00", "highlightTitle": ""}