{"organizations": [], "uuid": "0faaf20236c77af56f8ce25fb4ecd6c3546e6c0d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "", "site_section": "http://www.financialexpress.com/section/lifestyle/", "section_title": "Lifestyle News:Entertainment News,Bollywood Latest News,Box Office Collection Report,Movie Reviews | The Financial Express", "url": "http://www.financialexpress.com/article/lifestyle/health/armed-malaria-protein-provides-hope-for-general-cancer-cure/151006", "country": "IE", "title": "Armed malaria protein provides hope for general cancer cure", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Armed malaria protein provides hope for general cancer cure | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T08:10:00.000+03:00", "replies_count": 0, "uuid": "0faaf20236c77af56f8ce25fb4ecd6c3546e6c0d"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/lifestyle/health/armed-malaria-protein-provides-hope-for-general-cancer-cure/151006", "ord_in_thread": 0, "title": "Armed malaria protein provides hope for general cancer cure", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Your Facebook, Twitter posts may hold clues to your health Sitting for long periods not bad for health: study Enjoy black coffee? You may be a psychopath A new type of cancer therapy based on seemingly unrelated elements of malaria and cancer is showing promise for development.\nKairos Therapeutics, a Vancouver-based biotech company spun-out of The Centre for Drug Research and Development (CDRD), has partnered with VAR2 Pharmaceuticals to advance the technology into clinical trials.\nWhile looking into why pregnant women are particularly susceptible to malaria, researchers from the University of British Columbia, BC Cancer Agency, University of Copenhagen and VAR2 Pharmaceuticals discovered that the mosquito-borne parasite produces a protein “VAR2CSA” that binds to a particular type of sugar molecule found in the placenta.\nFurther studies showed that the same sugar molecule is also found on the majority of cancer cell types. This commonality is understandable because both tumours and placentas share a number of characteristics, such as rapid growth and tissue invasion.\nJohn Babcook, President and CSO of Kairos Therapeutics, said that he has worked for more than 25 years developing therapeutics for the treatment of cancer and he has never seen a target so broadly expressed on different forms of cancer as VAR2CSA.\nJohn and a team of scientists at Kairos Therapeutics have developed a novel technology to arm antibodies and other targeting proteins with high potency toxins that could be used to specifically kill cancer cells.\nKairos teamed up with scientists at VAR2 Pharmaceuticals, led by Drs. Mads Daugaard and Ali Salanti, and together they demonstrated that the sugar molecule could be a target for anti-cancer drugs, and that the VAR2CSA malarial protein could provide the tool for delivering Kairos’ potent cancer killing toxins to tumours.\nBy attaching Kairos’ novel toxins to VAR2CSA, the results showed that over 95 per cent of tumour cell lines were successfully treated across a broad array of cancer types, including pancreatic, brain, blood, ovarian, gastric, lung, bladder, skin, prostate, and breast.\nThe drug was then tested on mice that were implanted with human tumours. In models of non-Hodgkin’s lymphoma, castration-resistant prostate cancer, and metastatic breast cancer, the Kairos-VAR2 therapeutic demonstrated the ability to prevent tumour growth, regress established tumours and cure metastatic disease.\nThe study appears in Cancer Cell.\n 15, 2015 12:10 am", "external_links": [], "published": "2015-10-15T08:10:00.000+03:00", "crawled": "2015-10-15T00:24:29.276+03:00", "highlightTitle": ""}