{"organizations": ["ABC", "CW", "Associated Press", "NBC", "DC", "Warner Bros.", "CBS"], "uuid": "b0cb5110b62bace79df456aa6a13cb3b3cfdf82a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.goerie.com", "main_image": "http://www.goerie.com/storyimage/GE/20151025/ENTERTAINMENT04/310259974/AR/0/AR-310259974.jpg", "site_section": "http://www.goerie.com/apps/pbcs.dll/section?category=RSS04&mime=xml&omniture=0", "section_title": "GoErie.com Entertainment Headlines", "url": "http://www.goerie.com/cbs-supergirl-set-to-take-off-oct-26", "country": "US", "title": "CBS' 'Supergirl' set to take off Oct. 26", "performance_score": 0, "site": "goerie.com", "participants_count": 0, "title_full": "CBS' 'Supergirl' set to take off Oct. 26", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T06:19:00.000+02:00", "replies_count": 0, "uuid": "b0cb5110b62bace79df456aa6a13cb3b3cfdf82a"}, "author": "", "url": "http://www.goerie.com/cbs-supergirl-set-to-take-off-oct-26", "ord_in_thread": 0, "title": "CBS' 'Supergirl' set to take off Oct. 26", "locations": ["Gotham"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Benoist", "Spider-Man", "Berlanti", "David Harewood", "Carter", "Batman", "Greg Berlanti", "Melissa Benoist", "Richard Donner", "Leigh", "Fox", "Superman", "Marly Rose", "Ali Adler"], "text": "CBS' 'Supergirl' set to take off Oct. 26 Associated Press October 25, 2015 01:01 AM Chyler Leigh, Melissa Benoist and David Harewood in \"Supergirl.\" (Photo courtesy CBS/TNS)CBS Associated Press October 25, 2015 01:01 AM \"Supergirl,\" probably the most-talked about new show of the fall, arrives Monday on CBS. And when she gets here, that will put all of the big broadcast networks in the comic-book business. ABC delivers \"Marvel's Agents of S.H.I.E.L.D.,\" a series that is a spinoff from \"The Avengers\" movies, and its summer counterpart, \"Marvel's Agent Carter.\" Fox counters with \"Gotham,\" a prequel story to the Batman saga. NBC offers its homegrown superstory, \"Heroes: Reborn.\" The CW serves up two interconnected superhero shows, \"Arrow\" and \"Flash,\" and is developing a third, \"The Atom.\" And that's not counting two series based on comic books sans superpowers, The CW's \"iZombie\" and the 600-pound gorilla of Sunday nights, \"The Walking Dead.\" This is not the first time we've seen superheroes in prime time. Over the years, we've seen Superman and Batman, Spider-Man and the Hulk, Wonder Woman and an earlier version of the Flash. But those tended to be rare and perform poorly. Greg Berlanti, executive producer of \"Supergirl,\" \"Arrow\" and \"Flash,\" told a group of television critics recently that special effects and fight scenes work best when they are secondary. \"In terms of the superpowers and action set pieces, for me, they're worth spending all that money on when they really demonstrate something about the person's character,\" Berlanti said. \"So whether it's the emotional thing they're kind of struggling with in that episode or whatever it is they have to kind of overcome, so that's where we try and stay focused on the character.\" In \"Supergirl,\" this takes the form of a 24-year-old woman struggling to launch her career who finds a personal awakening through her superpowers. In contrast with the darker, more brooding \"Arrow\" and \"Flash,\" \"Supergirl\" is a brightly lit ode to empowerment -- one that owes a debt to director Richard Donner's \"Superman\" films of the 1970s and '80s. \"I grew up really worshipping the Donner films and their magic and their wonder and their joy and their fun,\" Berlanti said. \"When we went in last year to talk to Warner Bros. and DC and they mentioned the possibility of us working on a show like 'Supergirl,' our real hope was to bring just a smidgen of that magic that those films had.\" That puts much of the onus for the show's success on its star, Melissa Benoist, a 27-year-old actress previously known best for her work as Marly Rose on a season of \"Glee.\" Despite her lack of name recognition, the show's producers are high on Benoist. \"She was the first person we saw,\" executive producer Ali Adler said, \"and we looked at each other and were blown away, and we were like, 'We have to get a diamond ring for that girl.'\" What do you think?", "external_links": [], "published": "2015-10-25T06:19:00.000+02:00", "crawled": "2015-10-25T10:15:04.892+02:00", "highlightTitle": ""}