{"organizations": [], "uuid": "7dd67f0acc97a4a79f6748a929e42da6d3a31abf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sagmart.com", "main_image": "http://www.sagmart.com/uploads/2015/10/16/news_image1/honda-cbr500r-racing.jpg", "site_section": "http://www.sagmart.com/news_rss", "section_title": "SAG Mart News - General, Entertainment, Mobile, Fashion, Health", "url": "http://www.sagmart.com/news/Automobiles/new-honda-cbr500r-unveiled", "country": "US", "title": "New Honda CBR500R Unveiled", "performance_score": 0, "site": "sagmart.com", "participants_count": 0, "title_full": "New Honda CBR500R Unveiled", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T14:25:00.000+03:00", "replies_count": 0, "uuid": "7dd67f0acc97a4a79f6748a929e42da6d3a31abf"}, "author": "", "url": "http://www.sagmart.com/news/Automobiles/new-honda-cbr500r-unveiled", "ord_in_thread": 0, "title": "New Honda CBR500R Unveiled", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "16th, Oct 2015 4:55 PM SAGMart Team View: 0 0 \nThe Japanese bike maker, Honda has created a lot of buzz in the market by unveiling 2016 Honda CBR500R in the global market. The company wants to launch the next generation CBR500R at the famed American auto show, 2015 AIMExpo that will be organized in California. \nSee Also: Honda Releases a Teaser Video 'Africa Twin ' \nIn terms of design, the new CBR500R comes with razor sharp edges and more aggressive look is compared with its previous version. It also gets rectified LED headlamps and taillights. The middleweight motorcycle refinements, many other changes that include a new muffler, seat bag, high windshield, seat cowl, tank pad and 12 accessory socket. The full faired bike offers a legendary performance as it is added with a great curb. \nSee Related : Honda Company Become Number one Brand in Sevaral States \nMoreover, the bike is designed with limited major updates. It is also featured with an adjustable front brake lever that enhances your braking experience. The motorcycle gives a dynamic balancing power as it is featured with adjustable preload suspensions at the front. It gets a muscular fuel tank that has a larger fuel capacity as Honda claims. \nTalking about the power of the bike, the Japanese giant has not made any changes in mechanical and chassis. The motorcycle gains the power by the same liquid-cooled, parallel twin and 471cc mill. The liquid-cooled motor is able to produce a maximum power of close to 47 BHP . The flagship bike will be sold in three paint shades including Matte Black, Millennium Red and Pearl White. While, the price tag is not fixed yet. But expecting the new model will be hackneyed costlier than existing bike.", "external_links": [], "published": "2015-10-16T14:25:00.000+03:00", "crawled": "2015-10-16T14:32:33.607+03:00", "highlightTitle": ""}