{"organizations": [], "uuid": "3fd0881fb076143dc6cbf5f0403480ffdf8c9a60", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48524/c", "section_title": "Entertainment - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30348720/maksim-chmerkovskiy-will-proudly-serve-as-the-celebrity-ambassador-for-livon-laboratories", "country": "US", "title": "Maksim Chmerkovskiy Will Proudly Serve as the Celebrity Ambassador for LivOn Laboratories", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Maksim Chmerkovskiy Will Proudly Serve as the Celebrity Ambassador for LivOn Laboratories - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T02:00:00.000+02:00", "replies_count": 0, "uuid": "3fd0881fb076143dc6cbf5f0403480ffdf8c9a60"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30348720/maksim-chmerkovskiy-will-proudly-serve-as-the-celebrity-ambassador-for-livon-laboratories", "ord_in_thread": 0, "title": "Maksim Chmerkovskiy Will Proudly Serve as the Celebrity Ambassador for LivOn Laboratories", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " LivOn Labs\nHENDERSON, Nev. , Oct. 26, 2015 /PRNewswire/ -- Dancer, choreographer, and television personality Maksim Chmerkovskiy is the new celebrity ambassador for LivOn Laboratories' Lypo-Spheric™ line of high-performance nutritional supplements.\n\"I'm proud to be working with the team at LivOn Labs,\" said Maksim Chmerkovskiy.\n\"After my personal physician recommended their product to me a few years ago, I turned my family and friends on to it. Taking LivOn Labs supplements is a part of my daily routine, and now I am happy to share one of my secrets to a healthy life with everyone.\"\n\"Maks has been taking, and personally recommending, Lypo-Spheric™ products for years,\" says Cindy Nachman , CEO of LivOn Labs . \"Inviting him to serve as our brand ambassador was a natural fit! We are thrilled to have him involved and are confident he will carry our message about the importance of using high-quality dietary supplements to promote good health and longevity.\"\nAll of LivOn products use a proprietary Liposome Encapsulated Technology (LET) system to transport essential nutrients throughout the body. LET is considered one of the most effective methods of delivering oral nutrients with optimal bioavailability. (The LivOn Labs website explains the science behind the system.)\n\"Until recently, LET had been used almost exclusively by doctors and researchers for administering a relatively small number of esoteric therapies,\" Nachman says. \"Now, LivOn puts the power of LET in the hands of health-savvy consumers.\"\n\"We're excited to be living in a time where there is much emphasis on organic foods, dietary supplements, natural living, and just good health in general,\" says Nachman. \"There has never been a better time for the LivOn message. With Maks on board, we expect to skyrocket the visibility of these amazing high-performance products.\"\nUkrainian-American ballroom dance champion, choreographer, and instructor, Maksim Chmerkovskiy, was born in Odessa , Ukraine . He began dancing at the age of four, and by his teenage years, he had competed around the world. Maks danced his way into the hearts of America on the #1 hit television show Dancing with the Stars . Maks and his celebrity partner Olympic gold medalist Meryl Davis were crowned Season 18 champions.\nMaks' passion for dance inspired him to launch one of the nation's leading Latin and ballroom dance studios, Dance with Me, which currently has locations throughout the country. Maks has contributed his expertise and choreography skills to shows including \" Le Rêve -The Dream\" at Wynn Las Vegas, Broadway's \"Burn the Floor,\" a special television spot for AOL aired in 2013, as well as a two-month run in Broadway's \"Forever Tango.\" Maks was honored to dance a beautiful waltz during music legends Andrea Bocelli and David Foster's live performance at The Governors Ball following the 2015 Emmy Awards.\nMaks always involves himself in charitable work. Maks has implemented and spearheaded an Art Therapy program at Childhelp, the longest-running national nonprofit dedicated to meeting the physical, emotional, educational, and spiritual needs of abused and neglected children. Maks is also proud to support Alfalit International, a non-profit that works to eradicate illiteracy around the world.\nMaks joined forces with his brother, Valentin Chmerkovskiy, and their friend and fellow Dancing with the Stars castmate Tony Dovolani to create and star in the live dance spectacular \"SWAY: A Dance Trilogy.\" Maks, Val, and Tony assembled an all-star cast of the best dancers in the world to headline three installments of \"SWAY.\" The show was a massive, sold-out success in June 2015 at the Hammerstein Ballroom in New York City . \"SWAY\" will be bringing the heat to Miami, Florida , during Art Basel in December 2015 .\nCindy Nachman , CPA, President & CEO -Mrs. Nachman's experience includes over 30 years in accounting, and she has spent the last 15 years accounting for dietary supplement businesses. As a cofounder of LivOn, she has acted as the president and CEO since its inception in June 2004 .\nAbout LivOn Labs:\nLivOn Labs has continuously manufactured products using its propriety Liposome Encapsulated Technology (LET) system since 2004. The current product line includes Lypo-Spheric™ Vitamin C, Lypo-Spheric™ B Complex Plus, Lypo-Spheric™ R- ALA and Lypo-Spheric™ GSH. All of LivOn's Lypo-Spheric™ Supplements are vegan, gluten-free, and non-GMO and contain no sugar, no starch, no artificial flavors or colors. For more information on the company and its products, visit www.LivOnLabs.com or call 1-866-790-2107.\nInterviews with Maksim Chmerkovskiy and Cindy Nachman are available upon request.\nMedia Only Contact:\nFor LivOn Labs:\nDavid McGreavy\nEmail or 702-255-0265 x 116\nFor Maksim Chmerkovskiy:\nAmy Malin\nEmail or 818-672-1268\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/maksim-chmerkovskiy-will-proudly-serve-as-the-celebrity-ambassador-for-livon-laboratories-300165745.html\n ", "external_links": ["http://www.xmlnews.org/ns/", "http://rt.prnewswire.com/rt.gif?NewsItemId=PH37430&Transmission_Id=201510260845PR_NEWS_USPR_____PH37430&DateId=20151026", "http://en.wikipedia.org/wiki/Le_R%C3%AAve_(show)", "http://www.prnewswire.com/news-releases/maksim-chmerkovskiy-will-proudly-serve-as-the-celebrity-ambassador-for-livon-laboratories-300165745.html", "http://pressreleaseheadlines.com/contact?pid=293110", "http://www.livonlabs.com/"], "published": "2015-10-26T02:00:00.000+02:00", "crawled": "2015-10-26T15:45:02.003+02:00", "highlightTitle": ""}