{"organizations": [], "uuid": "c6e4d32f4b58a35b14b99d0398c3b8993802bb5b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kptv.com", "main_image": "", "site_section": "http://kptv.com/category/13540/entertainment?clienttype=rss", "section_title": "KPTV.com - Entertainment - Headline", "url": "http://www.kptv.com/story/30331888/keith-richards-joins-all-star-gathering-at-apollo-theater", "country": "US", "title": "Keith Richards joins all-star gathering at Apollo Theater", "performance_score": 0, "site": "kptv.com", "participants_count": 1, "title_full": "Keith Richards joins all-star gathering at Apollo Theater - KPTV - FOX 12", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "c6e4d32f4b58a35b14b99d0398c3b8993802bb5b"}, "author": "cbs8", "url": "http://www.kptv.com/story/30331888/keith-richards-joins-all-star-gathering-at-apollo-theater", "ord_in_thread": 0, "title": "Keith Richards joins all-star gathering at Apollo Theater", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By HILLEL ITALIE\nAP National Writer NEW YORK (AP) - From Keith Richards saluting vocalist Merry Clayton of \"Gimme Shelter\" fame to an all-star gathering of jazz musicians paying tribute to saxophonist Sonny Rollins, the stage of the Apollo Theater was a showcase for friends stepping up on behalf of honored and absent guests.\nThe 85-year-old Rollins spoke, but did not play, Thursday night as he received a lifetime achievement prize from the Jazz Foundation of America, which held its 14th annual benefit gala \"A Great Night in Harlem.\"\nClayton, one of the top backup singers of the 1960s and '70s, appeared only by video as she recovers from a 2014 auto accident that cost her both her legs. She was the first recipient of the Clark & Gwen Terry Courage Award and in her taped remarks showed that she had lost none of her range and power, singing a few lines of the old Joe Cocker hit \"You Are So Beautiful\" and hitting high notes in easy and rising succession.\nThe foundation provides a wide range of support for jazz musicians, from rent money to medical care.\nThe event began with actor-activist Danny Glover leading a tribute to civil rights leader Julian Bond, who died earlier this year. Glover called Bond a \"freedom fighter\" and inspiration for the \"young black adults who give life\" to the Black Lives Matter movement.\nFor much of the night, the stage was filled to capacity with jazz, rock and rhythm and blues artists. Ravi Coltrane, Donald Fagen and Jack DeJohnette were among the many performers playing some of Rollins' best known work, including a relaxed and joyous run-through of \"Paul's Pal,\" a fierce update of the Rollins-John Coltrane duet \"Tenor Madness\" and the Rollins standard \"St. Thomas.\"\nRollins was praised by the son of his old friend, pianist and composer Thelonious Monk. T.S. Monk remembered the saxophonist as one of many famous musicians he knew as a child and called Rollins \"one of the absolute kings of melody.\"\nRollins appeared briefly on stage, walking uneasily and with a cane, but full of spirit as audience members shouted \"Sonny!\" and he chanted a litany of heroes from Coltrane to Charlie Parker and praised them as \"the people that set our world in motion with the music.\"\nRollins and Clayton each have a history with Richards, Thursday's final act. Rollins' wistful solo was featured on the Rolling Stones ballad \"Waiting On a Friend\" while Clayton's ringing, ominous shouts of \"Rape! Murder!\" on \"Gimme Shelter\" remain one of rock n' roll's all-time guest shots.\nRichards' two-song set of \"Gimme Shelter\" and his personal anthem \"Happy\" was a mini-version of some of his solo concerts, featuring singer Sarah Dash, Steve Jordan on drums and Waddy Wachtel on guitar. With neither Clayton nor Mick Jagger in house, Richards took turns on vocals for \"Gimme Shelter\" with Dash and longtime Stones backup singers Bernard Fowler and Lisa Fischer.\n\"Great room,\" Richards, who was light on his feet in dark pants and sneakers, said with a grin between songs. \"And (with) all the other cats that are under this roof at the moment you probably have just about the creme de la creme.\"\nA raspy cackle.\n\"And all that jazz.\"\nCopyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-10-23T03:00:00.000+03:00", "crawled": "2015-10-23T16:59:47.284+03:00", "highlightTitle": ""}