{"organizations": [], "uuid": "238a9ef8e932d8ec4a7a98ed3fdc08849d4c1fcc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "lancasteronline.com", "main_image": "http://bloximages.newyork1.vip.townnews.com/lancasteronline.com/content/tncms/assets/v3/editorial/d/ce/dce8e070-66e6-11e5-bda9-1bb116f6e00a/560af21201892.image.jpg?crop=908%2C769%2C0%2C30&amp;resize=620%2C526&amp;order=crop%2Cresize", "site_section": "http://lancasteronline.com/search/?q=&t=article&l=25&d=&d1=&d2=&s=start_time&sd=desc&c[]=lancaster/entertainment_and_lifestyle*&f=rss", "section_title": "lancasteronline.com - RSS Results in lancaster/entertainment_and_lifestyle* of type article", "url": "http://lancasteronline.com/features/food/ask-an-expert-how-to-eat-like-an-mma-fighter/article_0a715e2e-66e6-11e5-92eb-abdad9c806e0.html", "country": "US", "title": "Ask an Expert: How to eat like an MMA fighter", "performance_score": 0, "site": "lancasteronline.com", "participants_count": 1, "title_full": "Ask an Expert: How to eat like an MMA fighter", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T15:00:00.000+03:00", "replies_count": 0, "uuid": "238a9ef8e932d8ec4a7a98ed3fdc08849d4c1fcc"}, "author": "JENNIFER KOPF | Staff Writer", "url": "http://lancasteronline.com/features/food/ask-an-expert-how-to-eat-like-an-mma-fighter/article_0a715e2e-66e6-11e5-92eb-abdad9c806e0.html", "ord_in_thread": 0, "title": "Ask an Expert: How to eat like an MMA fighter", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "John Brennan raises his arm in victory after a mixed martial arts bout. JOHN BRENNAN \nGame time in the press box at Clipper Stadium. John Brennan, who competes as an amateur mixed martial arts fighter, is creative services coordinator for the Lancaster Barnstormers. \nIt’s a far cry from the midnight “Sheetz Runs” he made with friends: \nA careful diet of healthy foods, timed to mix with intense training, socializing with his fiancee and Lancaster Barnstormers work responsibilities. \nThe discipline pays off. According to tapology.com , John Brennan, the Barnstormers’ creative services coordinator, is ranked 7th of 69 active amateur mixed martial arts featherweights in Pennsylvania. He’ll defend his WCC featherweight championship Dec. 5 at the Lancaster Host Resort & Conference Center. \nBrennan has long been an athlete — but it’s only been since his freshman year of college that he’s really paid attention to how he’s fueling all that activity. \nSo how does Brennan eat to balance that relatively low-impact 9-to-5 routine with his exhaustive MMA training? \nWhat is a typical day of food for you? \nI usually eat every three to four hours. I usually wake up around 6:30 a.m. and take my dog for a 1- to 2-mile run, or go to the YMCA or BA Athletics for some strength and conditioning. I’ll eat my first meal (after my workout), a bowl of steel-cut oats with peanut butter and chia and hemp seeds. Lunch (with my fiancee) usually consists of a salad of spinach, mixed greens, bell peppers, tomatoes and a little feta cheese. With the salad I usually have some sort of lean meat (chicken, fish, shrimp, turkey breast, etc.). The next meal is usually some sort of homemade trail mix with cashews, almonds, dried fruit and some dark chocolate chips. \nMy pre-training meal is always an apple an hour before training starts. After two to three hours of training at Gracie 717, post-training meals usually consist of a smoothie with frozen fruit, carrots, spinach, protein powder, powdered peanut butter and almond milk. \nHow has your food regimen evolved? \nWhen I was in high school I was an offensive lineman and weighed anywhere between 190-200 pounds. Once I got to college, I knew I didn’t need to be that heavy, so I started watching what I ate. Instead of gaining the “freshman 15,” I lost the freshman 30. I have energy throughout the day, and I rarely get sick since I’ve started eating better. \nDid your current diet come before you started in MMA? \nIt started before I got into MMA, but I had to make a lot of changes once I got serious about MMA because of how strenuous it is on my body. I need to eat a lot to maintain a healthy weight, but still have energy to go through my workouts and training sessions each day. \nGo back to when you were a high school athlete: Where you as disciplined then about food? \nIn high school I ate whatever I wanted whenever I wanted it. I would make “Sheetz Runs” at midnight with my friends; every day at lunch I would eat double portions. My nickname when I was really young was “Chunky,” but I kind of outgrew that by the time I got to high school. \nI was always a heavier kid growing up, but the information about how important a clean diet is was not as readily available when I was growing up as it is now, and that was only a few years ago. \nWhat’s your go-to “grab it when I’m in a hurry” choice? What are your food weaknesses? \nMy go-to would have to be Quest Bars. They’re easy to grab and throw in my gym bag. I have a few food weaknesses, but none more than pizza, burgers and ice cream. My fiancee and I have a tradition of “Pizza Sunday” every Sunday. We’ve been doing it since we were in college. ... It’s my weekly cheat meal. I’ll eat a few slices of pizza and always top it off with a nice bowl of ice cream. \nAfter every fight I always get a huge cheeseburger with sweet potato fries. Extra barbecue sauce.¶ Dining out with John Brennan \nWe asked MMA fighter John Brennan what his go-to local dining spots are. Here's his list: Rachel's Creperie.", "external_links": [], "published": "2015-09-30T15:00:00.000+03:00", "crawled": "2015-10-02T12:49:14.102+03:00", "highlightTitle": ""}