{"organizations": [], "uuid": "56ffe063cbbf7224af7eb709419749c5b3fffc08", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://images.canberratimes.com.au/2015/10/20/6943945/Thumbnail100168063212gtbaimage.related.thumbnail.320x214.gkdhq0.png1445308696837.jpg.jpg", "site_section": "http://feeds.canberratimes.com.au/rssheadlines/entertainment.xml#", "section_title": "Canberra Times Entertainment Headlines", "url": "http://www.canberratimes.com.au/entertainment/tv-and-radio/four-corners-on-michael-lawler-and-kathy-jackson-and-other-great-tv-confessions-20151020-gkdhq0.html", "country": "AU", "title": "Four Corners on Michael Lawler and Kathy Jackson and other great TV confessions", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "Four Corners on Michael Lawler and Kathy Jackson and other great TV confessions", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T05:38:00.000+03:00", "replies_count": 0, "uuid": "56ffe063cbbf7224af7eb709419749c5b3fffc08"}, "author": "Nick Galvin", "url": "http://www.canberratimes.com.au/entertainment/tv-and-radio/four-corners-on-michael-lawler-and-kathy-jackson-and-other-great-tv-confessions-20151020-gkdhq0.html", "ord_in_thread": 0, "title": "Four Corners on Michael Lawler and Kathy Jackson and other great TV confessions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play video Return to video Video settings Please Log in to update your video settings\nVideo will begin in 5 seconds.\nDon't play Play now More video Recommended Replay video Return to video Video settings Please Log in to update your video settings\nChopper's violent final testimony In this vision from 2013, Mark \"Chopper\" Read reenacts the shooting Desmond Costello, committed at age 17, and the murder of Reginald Edward Isaacs in his final interview. Vision: 60 Minutes, Channel Nine .\nPT4M28S http://www.canberratimes.com.au/action/externalEmbeddedPlayer?id=d-2vvxs 620 349 October 21, 2013 Autoplay On Off Video feedback Video settings ABC justifies C-bomb Jackson and Lawler explained As the nation gleefully picks over the bones of last night's Four Corners interview with Michael Lawler and Kathy Jackson, pondering the implications of what must surely by now be called \"c---struckgate\", we're reminded of other great confessional TV interviews.\nFrom TV anchor David Frost hectoring a confession from former president Richard Nixon to pop star Michael Jackson's unsettling admissions to journalist Martin Bashir about his sleeping arrangements, there are many moments to choose from.\nA screen grab from Kathy Jackson and Michael Lawler on Four Corners as Lawler interrupts Jackson’s interview. Photo: Four Corners \nHere then are five of the most gobsmacking, revelatory or just plain weird TV confessions of all time.\n \nAdvertisement Bill Clinton\n​ When it comes to looking straight down the barrel of the camera and flat out admitting you did the wrong thing, it's hard to beat Bill Clinton's 1998 effort. This abject admission of guilt follows his earlier masterpiece of sophistry in which he denied \"having relations with that woman\". Finally he comes clean (unlike the infamous blue dress) and 'fesses up - \"I did have a relationship with Miss Lewinsky that was not appropriate\" – and the world would never again be able to view the Oval Office in the same light.\n\n\nDiana Spencer \nOne can only imagine the scene at Buckingham Palace as the rest of the Royal Family sat down to watch Lady Diana's bombshell interview with the BBC's Martin Bashir in 1995. In the extensive and extraordinarily candid interview, she laid bare the details of her battle with depression and bulimia. And then came the big admission – that she had had a long-running affair with cavalry officer James Hewitt – and nothing the monarchy did or said after that could ever be the same again.\n\n\nLance Armstrong \nWas there ever a hero who proved more conclusively to have feet of clay than Lance? The hype leading up to this two-parter with Oprah Winfrey was extraordinary but no one could have predicted the extent to which the seven-time Tour de France champion would outline his astonishing lifetime of deceit. In a key part of the interview lasting less than a minute, Armstrong permanently trashed his career and his legacy with with five simple \"yeses\" to Oprah's questions about drug use.\n\n\nChopper Read \nCuriously personable and charming, the late Mark \"Chopper\" Read, sat down with 60 Minutes' Tara Brown to give a broad-ranging interview that involved confessing to four separate murders. Read was jailed for pretty much every violent crime imaginable, but never convicted of murder. He told Brown his did his first killing when he was just 17 and his last in 2002. Desperately ill with liver cancer, Read died shortly after the interview. Notorious for spinning a yarn, there remains doubt even now whether Read was telling the truth in the dramatic encounter.\n\n\nTom Cruise \nWhile not strictly a confession in the conventional sense, for general whacked-out, career-limiting nuttiness, it's impossible to go past Tom Cruise's loopy couch-jumping performance on Oprah. Variously striking a series of strange poses, almost wrestling with his host and, most famously, springing up on to the coach, it was a deeply disturbing display all supposedly inspired by the new love of his life, Katie Holmes.", "external_links": [], "published": "2015-10-20T05:38:00.000+03:00", "crawled": "2015-10-21T17:31:01.007+03:00", "highlightTitle": ""}