{"organizations": ["First Children's Museum Opens"], "uuid": "6191b86d7dc2edcdc5dabb328bf69932cdaa6ab7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dnainfo.com", "main_image": "http://assets.dnainfo.com/generated/photo/2015/10/img9068-1443737204.JPG/extralarge.jpg", "site_section": "http://www.dnainfo.com/new-york/topics/arts-entertainment.rss", "section_title": "Arts & Entertainment Top Stories on DNAINFO.com - Friday, October 2, 2015 | 3:37pm", "url": "http://www.dnainfo.com/new-york/20151002/sugar-hill/harlems-first-childrens-museum-opens-sugar-hill-this-weekend", "country": "US", "title": "Harlem's First Children's Museum Opens in Sugar Hill This Weekend", "performance_score": 0, "site": "dnainfo.com", "participants_count": 0, "title_full": "Harlem's First Children's Museum Opens in Sugar Hill This Weekend", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T17:27:00.000+03:00", "replies_count": 0, "uuid": "6191b86d7dc2edcdc5dabb328bf69932cdaa6ab7"}, "author": "", "url": "http://www.dnainfo.com/new-york/20151002/sugar-hill/harlems-first-childrens-museum-opens-sugar-hill-this-weekend", "ord_in_thread": 0, "title": "Harlem's First Children's Museum Opens in Sugar Hill This Weekend", "locations": ["Sugar Hill", "Harlem"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Gustavo Solis"], "text": "Harlem's First Children's Museum Opens in Sugar Hill This Weekend By Gustavo Solis | October 2, 2015 10:27am View Full Caption \nHARLEM — Uptown’s first children’s museum will celebrate its grand opening in Sugar Hill Saturday. \nIf the weather holds, festivities will include an outdoor stoop party with food trucks, a free open house that includes a buffet of interactive art workshops and a storytelling marathon that features live music at the Sugar Hill Children’s Museum of Art & Storytelling on 898 Saint Nicholas Ave. \n“It’s going to be an incredible party uptown,” said Lauren Kelley, the museum’s curator. “We really look forward to having a lot of little people here.” \nThe 17,000-square-foot space has three galleries, a studio and a stage. Each exhibit is designed to stimulate the creativity of children aged 3 to 8 and help them develop language, literacy and critical thinking skills. \nThe art is also designed to appeal to older siblings, cousins and parents who visit the museum with the little ones. \nFor example, there is a colorful crochet rug made from recycled paper bags. Some of the tiles have letters hidden in them and, if you know where to look, you can find a message written in the rug. \n“What is critical here is just planting the seed,” Kelley said. “It will be something families will experience together and then the conversation can continue when they go home.” \nThe museum is part of the Broadway Housing Communities' Sugar Hill development, which opened in November 2014 and has 124 affordable housing units and a pre-k program. \nThe pre-k, as well as three other neighboring programs, has a partnership with the museum that allows it to share resources and create a specific curriculum with the museum’s staff. The museum also has a partnership with El Museo Del Barrio and the Studio Museum in Harlem , both of which helped with the inaugural exhibits. \n“It is unique because it is a community based museum,” said director Susan Delvalle. \n“It is part of the Broadway Housing Communities model. It really focuses on the idea of addressing poverty with addressing housing, education and the arts.” \nEvery child 8 or younger will be able to enter the museum for free. Parents will be charged $7 and children over 8 and seniors $4. \nThe inaugural exhibits include People, Places and Things , a collection from the Studio Museum in Harlem that explores artwork created in the 1930s and 1980s, and Txt: art, language, media , which looks at new forms of literacy and its visual impact on everyday life.", "external_links": [], "published": "2015-10-02T17:27:00.000+03:00", "crawled": "2015-10-02T22:32:22.818+03:00", "highlightTitle": ""}