{"organizations": ["Famous Chefs", "New Times", "Miami Herald", "Popular Baby Green Mix", "Bed & Breakfast"], "uuid": "242423c1047aa6797150c41d1efee021cb2383a4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.globalbx.com", "main_image": "", "site_section": "http://www.globalbx.com/rss/Global/byIndustry/Entertainment.rss", "section_title": "Entertainment and Leisure Businesses For Sale", "url": "http://www.globalbx.com/listing.asp?bId=235592", "country": "US", "title": "Certified Organic Farm With Dining & Overnight Bungalows", "performance_score": 0, "site": "globalbx.com", "participants_count": 0, "title_full": "Certified Organic Farm With Dining & Overnight Bungalows", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T07:51:00.000+03:00", "replies_count": 0, "uuid": "242423c1047aa6797150c41d1efee021cb2383a4"}, "author": "", "url": "http://www.globalbx.com/listing.asp?bId=235592", "ord_in_thread": 0, "title": "Certified Organic Farm With Dining & Overnight Bungalows", "locations": ["Miami", "Miami-Dade County", "Fl", "South Florida", "Florida"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Rare Opportunity to acquire Famous Certified Organic Farm/groves Operation selling its harvest to Whole Foods, Local Farmers Markets and Famous Chefs at Highend S Florida Restaurants. The Farm is located in Homestead/S Miami-Dade County, Fl includes 7.5 acres with a two story 3/3 Main House surrounded by lush tropical foliage, natural 40' tropical Pool, Office, Production Buildings, equipment, outdoor kitchen, Greenhouses, open air Gazebo, Botanical Garden, Fountain, Tropical Fruit Trees. Variety of Production/Planting products include: Micro greens, Popular Baby Green Mix, Assorted Basil tops, Baby Root Vegetables, Oyster Mushrooms, over 52 varieties of edible flowers, Honey and a variety of Tropical Fruits including Mango, Avocado, Bananas, Papaya, carambola, Jackfruit,Cotton Candy Fruit. During Season (October-April)the Farm creates a local Farm to table Series of Lunch/Dinners in collaboration with some of the Best Chefs in Miami who are all customers of the Farm. This annual tradition has become one of South Florida Season's hottest tickets! Property also offers several accommodation options for Bed & Breakfast guests in one of (4) separate outdoor Bungalows nestled in vibrant tropical beauty. In addition the B & B Guests are encouraged to stroll the trails, swing on the hammocks, swim in the serene natural pool or read a book while listening to the sounds of a nearby fountain. As if this was not enough, The Farm also converts into the perfect setting for many wedding celebrations. This includes an open air Gazebo, Dinner service for 120 guests, a reception area, a circle with a fountain, and a flower lined arbor. In addition to weddings the farm hosts engagement parties, rehearsal dinners, bridal showers, corporate events, anniversary dinners, yoga classes and photo shoots. The Farm has received numerous awards and accolades in social media, Yelp, Miami Herald, New Times magazine. Financials", "external_links": [], "published": "2015-10-23T07:51:00.000+03:00", "crawled": "2015-10-23T12:17:50.091+03:00", "highlightTitle": ""}