{"organizations": [], "uuid": "ddbed317d9921b11ac2cfda3da10ba9079335119", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-56193e8b/turbine/ct-joan-benoit-samuelson-marathon-spt-1011-20151010", "site_section": "http://www.chicagotribune.com/", "section_title": "Chicago Tribune: Chicago breaking news, sports, business, entertainment, weather and traffic - Chicago Tribune", "url": "http://www.chicagotribune.com/sports/chicagomarathon/ct-joan-benoit-samuelson-marathon-spt-1011-20151010-column.html", "country": "US", "title": "For Deena Kastor and Joan Samuelson, a marathon run down memory lane", "performance_score": 0, "site": "chicagotribune.com", "participants_count": 1, "title_full": "For Deena Kastor and Joan Samuelson, a marathon run down memory lane - Chicago Tribune", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T16:38:00.000+03:00", "replies_count": 0, "uuid": "ddbed317d9921b11ac2cfda3da10ba9079335119"}, "author": "Philip Hersh", "url": "http://www.chicagotribune.com/sports/chicagomarathon/ct-joan-benoit-samuelson-marathon-spt-1011-20151010-column.html", "ord_in_thread": 0, "title": "For Deena Kastor and Joan Samuelson, a marathon run down memory lane", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Joan Benoit Samuelson and Deena Kastor envisioned special ways to mark major anniversaries of their victories in the Bank of America Chicago Marathon.\nFor Samuelson, the 1984 Olympic champion, it was to finish Sunday's race within 30 minutes of the U.S. record time with which she won 30 years ago.\nFor Kastor, 2004 Olympic bronze medalist and 2005 Chicago winner, it was to go after the U.S. Masters (40 and over) record Colleen DeReuck set here in 2009.\nSamuelson, 58, had to shelve her goal after a lengthy stomach virus affected her training. She was to wait until Sunday morning to decide about running at all.\n\"My heart says yes, and my gut says no,\" Samuelson said.\nKastor, 42, knows DeReuck's time of 2 hours, 28 minutes, 40 seconds is a stretch for someone who has not ran below 2:30 in six years.\n\"It was very important for me to put out this unreachable goal to get the best out of myself,\" said Kastor, the only U.S. woman ever to break 2:20 (2:19:36). \"It made me committed this summer to push my limits on a daily basis.\"\nSome wonder why Kastor chose to run Chicago instead of focusing on the Feb. 13 U.S. Olympic trials, where a time near DeReuck's record might be good enough to earn one of the three U.S. spots at the 2016 Rio Summer Games.\nJoan Benoit winning the 1984 Olympic marathon Joe Kennedy / TFW Los Angeles Times Joan Benoit comes into the Coliseum as she wins the inaugural Olympic women's marathon in 1984.\nJoan Benoit comes into the Coliseum as she wins the inaugural Olympic women's marathon in 1984.\n(Joe Kennedy / TFW Los Angeles Times) \"I'm going to train to get my (club) teammates ready for the Olympic trials and if I feel I'm in good enough shape come January, I'll be on the starting line,\" Kastor said.\nFor Samuelson, Sunday's race was to be the latest chapter in a marathon career that has become what she calls an exercise in storytelling.\n\"All runners walk or run this fine line leading up to a marathon,\" she said. \"My husband (Scott) was saying, `You're playing with fire, you're pushing it so much.' And I was, because I really wanted to tell the story of 30 minutes, 30 years later.\"\nSamuelson remembers not understanding what it meant when Nike used her after the 1984 Olympics in a publicity campaign titled, \"There is no finish line.\"\n\"Now I'm living that,\" she said.\nShe thought the end would be the 2008 Olympic trials in Boston, home turf for a woman from southern Maine and the place where she had debuted at the distance by winning her first of three Boston Marathon titles.\nDeena Kastor in record run ADRIAN DENNIS / Agence France Presse/Getty Image Deena Kastor wins the 2006 London Marathon in 2 hours, 19 minutes, 36 seconds, making her the only U.S. woman ever to break 2:20.\nDeena Kastor wins the 2006 London Marathon in 2 hours, 19 minutes, 36 seconds, making her the only U.S. woman ever to break 2:20.\n(ADRIAN DENNIS / Agence France Presse/Getty Image) A year later, she was unable to resist the story line of the New York Marathon's 40th running and 25th anniversary of her Olympic triumph. Asked to explain the change of heart, she told the media, \"I said I was ending my competitive career, but I never said what constitutes competitive.\"\nThe next year, she liked the numerical resonance of celebrating the 25th anniversary of her Chicago victory and its record time (2:21:21) in a race taking place on 10-10-10. She finished with the fastest time ever (2:47:50) by a woman older than 51.\nThree weeks after that, Samuelson was on the starting line in Marathon, Greece, marking the 2,500th anniversary of the Greek messenger's legendary run that would gave the event its name.\n\"What I'd like to do is run a sub-3-hour marathon at the age of 60, and then be done with it,\" she said.\nUnless she does that before the 40th anniversary of the Chicago Marathon two years from now, because she would like to run it with Chicago race director Carey Pinkowski, who also turns 60 in 2017.\nNo finish line, indeed.\nphersh@tribpub.com\nTwitter @olyphil\n Chicago Marathon Boston Marathon Philip Hersh", "external_links": ["http://www.trbimg.com/img-56193e8b/turbine/ct-joan-benoit-samuelson-marathon-spt-1011-20151010", "http://www.trbimg.com/img-561940d1/turbine/ct-joan-benoit-samuelson-marathon-spt-1011-201-004", "http://www.trbimg.com/img-56193f97/turbine/ct-joan-benoit-samuelson-marathon-spt-1011-201-003"], "published": "2015-10-10T16:38:00.000+03:00", "crawled": "2015-10-10T21:18:23.474+03:00", "highlightTitle": ""}