{"organizations": [], "uuid": "8859badcfc4ea72d9ee04a59a97b18a94eee7351", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.hollandsentinel.com", "main_image": "http://www.hollandsentinel.com/storyimage/MI/20151008/ENTERTAINMENTLIFE/151009218/AR/0/AR-151009218.jpg", "site_section": "http://www.hollandsentinel.com/entertainment?template=rss&mime=xml", "section_title": "Entertainment - Holland Sentinel", "url": "http://www.hollandsentinel.com/article/20151008/ENTERTAINMENTLIFE/151009218/2052/ENTERTAINMENT?rssfeed=true", "country": "US", "title": "Billy Strings & Don Julin: An unlikely pairing, bluegrass duo is impressive and fiery", "performance_score": 0, "site": "hollandsentinel.com", "participants_count": 1, "title_full": "Billy Strings & Don Julin: An unlikely pairing, bluegrass duo is impressive and fiery", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T22:01:00.000+03:00", "replies_count": 0, "uuid": "8859badcfc4ea72d9ee04a59a97b18a94eee7351"}, "author": "John Sinkevics LocalSpins.com LocalSpins.com", "url": "http://www.hollandsentinel.com/article/20151008/ENTERTAINMENTLIFE/151009218/2052/ENTERTAINMENT?rssfeed=true", "ord_in_thread": 0, "title": "Billy Strings & Don Julin: An unlikely pairing, bluegrass duo is impressive and fiery", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WHEN 9 p.m. Friday (doors open at 8 p.m.) \nWHERE Park Theatre, 248 S. River Ave. \nCOST $10 advance, $12 day of show The grimaces, the grins and the goofy facial expressions often tell the story of a particularly rousing Billy Strings & Don Julin performance, with audiences roaring and screaming their approval as the Traverse City bluegrass duo careens breathtakingly through another rapid-fire, extended jam. “We say ‘One, two, three, four, here we go,’ and just hang on,” said 22-year-old guitarist Billy Strings, aka William Apostol, referring to the group’s fiery, foot-stomping, flat-picking spectacles. “The thing is we’re listening to each other. It’s kind of a conversation we’re having.” As mandolinist Julin, 54, put it: “We kind of take a jazz approach maybe to bluegrass material. Some of the songs are the same every time. But if you’ve seen us enough times, you know that … anything can happen in any song and at any moment could be this big long jam that lasts 10 minutes and ends up in a different song than where we started. That kind of freedom to improvise, that’s what really attracted me to playing with Billy.” For a little more than two years, that uncommon chemistry has generated some of the most memorable acoustic performances and one of the most impressive pairings of bluegrass musicians that West Michigan has ever spawned. Billy Strings and Don Julin, now accompanied by Traverse City standup bassist Kevin Gills, quickly have become one of the country’s most sought-after bluegrass outfits, releasing two highly praised albums and touring with the likes of the legendary Del McCoury and David Grisman, aka Del & Dawg. On Friday, they’ll bring that dynamic, lighting-quick acoustic power to Holland’s Park Theatre. And after performing in Traverse City on Saturday for a Michigan Land Use Institute benefit, the band will be crisscrossing the country for much of the rest of year, with tour stops as far-flung as New York, California and Minnesota. This comes after the group played a host of high-profile, bluegrass-driven festivals such as Grey Fox, Wintergrass, DelFest, Rockygrass, Romp and others. Apostol, who started playing his first “real” guitar at age 4 — growing up in Ionia, and reared on the music of Doc Watson and Bill Monroe — said it’s been exciting playing these events with iconic bluegrass music stars. “Looking at our names on the flyers with all of our heroes is just like, ‘Whoa, really?’ It’s kind of bizarre to think I’m friends with some of these guys I worshiped from when I was 10 years old,” he said. The trio regularly demonstrates its eye-popping virtuosity on old classics such as “Little Maggie” and original barn-burners “Albino Skunk” and “Dust in a Baggie.” Page 2 of 2 - “Ever since I was a little kid, that’s all I wanted to do was play,” Apostol said of his devotion to the acoustic guitar. “To me, bluegrass is a music that’s earthy and organic. You can learn it from a book, maybe you could learn the tunes. But if you don’t have the soul and feeling to it, to me, you’re not playing it. There’s a whole feeling behind it. It’s lonesome and it’s really special music to me.” — Find more listings and news about West Michigan’s music scene at John Sinkevics’ LocalSpins.com . By John Sinkevics", "external_links": [], "published": "2015-10-08T22:01:00.000+03:00", "crawled": "2015-10-09T01:53:16.268+03:00", "highlightTitle": ""}