{"organizations": [], "uuid": "65b95c88cb81dc988171e4c24e6ef8a7409d2e11", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.democratandchronicle.com", "main_image": "http://www.gannett-cdn.com/-mm-/adb807e3f4d7cabe40a3f137ea1f72c54671661d/c=0-125-2167-1349&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/18/Rochester/Rochester/635807773365457132-TY-101815-CASA-LARGA-MRS-C-A.jpg", "site_section": "http://www.democratandchronicle.com/", "section_title": "Democrat and Chronicle | Rochester news, community, entertainment, yellow pages and classifieds. Serving Rochester, New York | democratandchronicle.com", "url": "http://www.democratandchronicle.com/story/news/2015/10/18/mrs-c-remembered-casa-larga/74055106", "country": "US", "title": "Mrs. C remembered at Casa Larga", "performance_score": 0, "site": "democratandchronicle.com", "participants_count": 1, "title_full": "Mrs. C remembered at Casa Larga", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T23:50:00.000+03:00", "replies_count": 0, "uuid": "65b95c88cb81dc988171e4c24e6ef8a7409d2e11"}, "author": "democratandchronicle.com", "url": "http://www.democratandchronicle.com/story/news/2015/10/18/mrs-c-remembered-casa-larga/74055106", "ord_in_thread": 0, "title": "Mrs. C remembered at Casa Larga", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Dozens of people gathered at Casa Larga Vineyards on Sunday afternoon for an annual event that was missing its leader. Each fall since 2004, Ann Colaruotolo would host \"The Three Rs with Mrs. C\", serving up her \"more than famous\" radicchio, ravioli and Riesling.\nThis year, the event took place without the vineyard's matriarch, who died in September at the age of 81 .\nColaruotolo, known affectionately as \"Mrs. C,\" created the event as a way to share some of her favorite foods with the winery's customers. She served up dishes that were popular in coastal Italy but less well known here, like radicchio salad or sauteed rappi .\n\"She just loved to be here, serving food and talking to people,\" said her daughter, Andrea Colaruotolo O'Neill. \"She'd even print out some of her recipes on little cards to hand out.\"\nThe Perinton winery started as a hobby in the mid-1970s when Ann and her husband Andrew decided to try making wines like those produced by his family's vineyard in Italy.\nAndrew, who died in 2004, moved to Rochester from Gaeta, Italy, as a teenager. Ann was born in Rochester, the daughter of immigrant parents.\nIn the decades that followed, Casa Laga Vineyards has been recognized for producing some of the best wines in the Finger Lakes region. The Colaruotolo family always remained at the heart of the operation, and it was a reflection of their daily life.\n\"My father had a big garden at the bottom of the hill where he planted tomatoes and radicchio and rappi,\" said O'Neill. \"These were all things that we ate at home.\"\nThe rappis were originally one of the three Rs Mrs. C offered up, but a bad crop one year forced them to substitute raviolis — a decision that seems to have been a popular one.\n\"These raviolis are delicious,\" said Matt Silverman, 33, of Canandaigua, one of those who visited Casa Larga on Sunday.\n\"Good food and good wine are just a way to help bring people together,\" Silverman added. \"They clearly understand that here.\"\nO'Neill agreed with that assessment.\n\"Food and family are what we're all about,\" she said. \"We try to extend that into everything we do, whether you're here for a wine tasting or a wedding or some other event. We want to make everyone feel welcome.\"\nSunday's event was an opportunity for friends and family, staff and customers to share their memories of Mrs. C, to talk about her warm heart, her generosity, and her love for her extended family.\nIt was clear from those who came on this afternoon that she was loved and will be missed.\nBut it's also clear that her spirit remains, both in the business she helped to build and in the hearts of those she touched.\nSLAHMAN@Gannett.com\nBuy Photo The parking spot for Mrs. C, Ann Colaruotolo, remains by the Casa Larga office in Perinton. Mrs. Colaruotolo died in September. (Photo: TINA MACINTYRE-YEE/@tyee23/staff photographer)", "external_links": ["http://www.gannett-cdn.com/-mm-/39cbd610e1dbc49a336f33efcdedfdb00509b372/c=109-0-2057-1465&r=x408&c=540x405/local/-/media/2015/10/18/Rochester/Rochester/635807773329732674-TY-101815-CASA-LARGA-MRS-C.jpg", "http://www.gannett-cdn.com/-mm-/a57cb87523081f89514984f1cf4f0c13e0b2f571/r=500x338/local/-/media/2015/10/18/Rochester/Rochester/635807773329732674-TY-101815-CASA-LARGA-MRS-C.jpg", "http://www.gannett-cdn.com/media/2015/10/18/Rochester/Rochester/635807773329732674-TY-101815-CASA-LARGA-MRS-C.jpg", "http://www.casalarga.com/Recipes/FoodRecipes"], "published": "2015-10-18T23:50:00.000+03:00", "crawled": "2015-10-19T02:03:55.938+03:00", "highlightTitle": ""}