{"organizations": [], "uuid": "463e494cd7a35eea65f3be540b50d8069238d8be", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news.com.au", "main_image": "http://cdn.newsapi.com.au/image/v1/7dd27059e68e3b8a0019db3c56b36f27", "site_section": "http://www.news.com.au/entertainment/movies", "section_title": "Movies | Movie Reviews &amp; Entertainment | News.com.au", "url": "http://www.news.com.au/entertainment/movies/chook-farmer-and-koala-take-on-major-us-studios-at-the-australian-box-office-these-school-holidays/story-fnk853hr-1227544261987", "country": "AU", "title": "Australian family movies Oddball and Blinky Bill are box office hits", "performance_score": 0, "site": "news.com.au", "participants_count": 1, "title_full": "Australian family movies Oddball and Blinky Bill are box office hits", "spam_score": 0.0, "site_type": "news", "published": "2015-09-26T03:22:00.000+03:00", "replies_count": 0, "uuid": "463e494cd7a35eea65f3be540b50d8069238d8be"}, "author": "VICKY ROACH", "url": "http://www.news.com.au/entertainment/movies/chook-farmer-and-koala-take-on-major-us-studios-at-the-australian-box-office-these-school-holidays/story-fnk853hr-1227544261987", "ord_in_thread": 0, "title": "Australian family movies Oddball and Blinky Bill are box office hits", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Video Image Blinky Bill trailer 2:05 Blinky discovers a mysterious marker that hints at his Dad?s whereabouts so he embarks on a journey that takes him beyond the boundary of Green Patch and into the wild and dangerous Outback\nJanuary 1st 1970 46 years ago /video/video.news.com.au/Entertainment/ Blinky Bill the Movie ... A result of Aussie filmmakers rewriting their rule book.\nBy VICKY ROACH News Corp Australia Network TWO homegrown productions — Oddball and Blinky Bill The Movie — have opened in the current, crowded school holiday market, perhaps the clearest sign yet of a blossoming renaissance in the Australian film industry.\n“It’s almost unprecedented,’’ said Screen Australia’s chief operating officer Fiona Cameron.\n“Historically, family and children’s cinema has been really under-represented in Australia and you can understand why.\n“(American studios) such as Pixar, Disney and DreamWorks are powerhouses. They blow away the competition.’’\nTrue story ... Jacobson in Oddball. Picture: Village Roadshow. Source: Supplied\nThe breakaway success of Red Dog, which took a whopping $21.3 million at the box office in 2011, rewrote the Australian producer’s rule book.\n“That was an unashamedly family film. It did a great outreach campaign and basically gave filmmakers the confidence (to believe that) Australian family movies could work,” said Cameron.\nYOUR CINEMA GUIDE: EVERY CURRENT MOVIE RELEASE RATED\nPaper Planes similarly upset set expectations early this year with a $9.65 million box office tally.\n“For Australian films to work in that (competitive children’s) market, they have to be really compelling. And the ones that have been released in the last 12 months have really hit the mark,” said Cameron.\nTrail-blazer ... A scene from Red Dog, which was a great Aussie success story. Source: Supplied\nVillage Roadshow Pictures, the distribution company behind both Red Dog and Paper Planes, has so much faith in its latest family release, it’s opening it on almost 300 screens.\nStarring much-loved actor/comedian Shane Jacobson, Oddball is based on the true story of Swampy Marsh, the Warrnambool chook farmer who used his Maremma guard dog to save a colony of fairly penguins.\nSUCCESS STORIES: AUSSIE FILMGOERS ARE WILD ABOUT ANIMALS\nAlso opening on Thursday was Flying Bark’s animated, preschool-skewing Blinky Bill the Movie, which aims to introduced Dorothy Wall’s mischievous marsupial to a whole new generation of cinemas goers.\n“Blinky has got so much heritage. Animation is a tough market but it should really cut through,’’ said Cameron.\n“And it’s nice to hear animation with Australian accents.”\nAussie icon ... Beloved Blinky Bill returns to our screens. Source: Supplied\nBoth films have the added bonus of a G rating.\n“All children are different., but if your kid is five or six, you have to think twice about whether or not PG is going to be right for them. A G rating, on the other hand, is a no-brainer,” said Cameron.\nJacobson agreed . “The feedback we have been getting, what people are loving about it, is that grandparents and parents and kids are going together,” he said. “It’s a shared experience.\n“There is no swearing, no drug references. There is no dark plot. It’s not suggesting there is anything wrong with the world. It’s a bit of family entertainment.”\nThe two films are opening the same week Australian productions posted a 6.1 per cent share of the overall box office — the best result in 14 years.\nSleeper hit ... Sam Worthington and Ed Oxenbould in Paper Planes. Source: Supplied\nCrowd-pleasers such as Mad Max: Fury Road ($21.65 million), The Water Diviner ($10.18 million), Paper Planes ($9.65 million) and Last Cab to Darwin ($6.21 million) have contributed to the current $50-million plus tally.\nCameron believes films such as Oddball and upcoming tragicomedy The Dressmaker, starring Kate Winslet, Judy Davis and Liam Hemsworth, could push that figure closer to $60 million.\n“Hopefully we are seeing a bit of a renaissance for Australian stories,” she said.\nWHAT’S ON THIS HOLIDAYS — FOR LITTLE KIDS AND BIG\nMaze Runner: Scorch Trials (M)\nThis dystopian thriller got off to a cracking start at the box office last weekend, earning $1.3 million more than its nearest competitor — and the coveted No 1 spot. Although Thomas (Dylan O’Brien) and his mates have escaped the original film’s claustrophobic labyrinth, the sequel has plenty more nasty surprises in store.\nPixels (PG)\nA decent premise targeted at the wrong audience — Chris ( Mrs Doubtfire ) Columbus’s nostalgic reboot of classic, ‘80s video game culture looked better on paper. Harmless, forgettable, family entertainment from a solid comedic cast, including Adam Sandler, Kevin James, Josh Gad, Michelle Monahan and Peter Dinklage.\nOddball (G)\nWarm, sweet, and thoroughly engaging, this homegrown crowd-pleaser is actually based a true story. Shane Jacobson steps into the very large gumboots of one-of-a-kind chicken farmer Swampy Marsh, who used his beloved Mareemba guard dogs to save a colony of fairy penguins from marauding foxes.\nBlinky Bill The Movie (G)\nThe mischief-making marsupial leaves home in search of his missing father in this animated reboot featuring the vocal talents of a top-shelf cast that included Ryan Kwanten, Toni Collette and Richard Roxburgh. An overarching, Joseph Campbell-style hero’s journey ensures Dorothy Wall’s iconic character, created in 1933, still resonates in a modern multiplex environment.\nPan (PG)\nReviews of this Peter Pan origin story, starring Hugh Jackman as the evil Blackbeard and Rooney Mara as Tiger Lily, are still under wraps. But the signs are promising. Jason Fuchs’s blueprint made the annual Black List of the best unproduced screenplays. And Joe Wright ( Pride and Prejudice, Atonement) signed up to direct. Opens next Thursday (Sep 24).\nEverest (M)\nAdventure movie experiences don’t come much more intense than this one. Based on the tragic, 1996 summit expedition, during which eight climbers died, director Baltasar Kormakur takes us as close to the edge as any ordinary person would ever want to go. To keep it real, the actors, including Jason Clarke, Josh Brolin and Jake Gyllenhaal, shot much of their footage in oxygen deprived, subzero conditions.\nMission Impossible — Rogue Nation (M)\nThrills, spills and increasingly spectacular action sequences ... Tom Cruise has the formula down pat by now. The sight of Ethan Hunt hanging off the side of a plane as it takes off is worth the price of admission alone. Thanks in no small part to its leading man’s adrenaline addiction, this franchise would appear to have plenty of life left in it yet.\nThe Visit (M)\nTwo siblings (Olivia DeJong and Ed Oxenbould) get more than they bargain for when they travel to Pennsylvania to meet their grandparents for the first time. A modestly return to form for director M Night Shyamalan. The $US5 million film has just posted the strongest US horror opening of the year.\nStraight Outta Compton (MA15+)\nStrictly for older teens. While it glosses over some of the more unpleasant historical truths, there’s still plenty to recommend in F. Gary Gray’s muscular musical biopic which charts the meteoric rise and fall of N.W.A. Strong performances from Jason Mitchell, as Eazy-E, and Ice Cube’s son O’Shea Jackson Jr, seal the deal.\nMe and Earl and the Dying Girl (M)\nFor a film about cancer, this Sundance award winner is surprisingly upbeat. Thomas Mann is terrific as the teenage outsider whose world is flipped on its head when he befriends a young woman with leukaemia. And the short films our protagonist makes with his childhood friend Earl add a whole other dimension to the story.\nOriginally published as Aussie family flicks in the box seat", "external_links": ["http://cdn.newsapi.com.au/image/v1/7dd27059e68e3b8a0019db3c56b36f27", "http://www.cairnspost.com.au/entertainment/movies/chook-farmer-and-koala-take-on-major-us-studios-at-the-australian-box-office-these-school-holidays/story-fnki15zo-1227544261987", "http://cdn.newsapi.com.au/image/v1/origin:fatwire.", "http://cdn.newsapi.com.au/image/v1/aaf3c7401bdb65e87936d7969aabae91", "http://cdn.newsapi.com.au/image/v1/37d8f34761fd2e573f5e26d93e796781", "http://cdn.newsapi.com.au/image/v1/c8e75e47b5905c60a7c8aa8c6806d05d", "http://cdn.newsapi.com.au/image/v1/05548f713bd03d5caa07548fe578dc55", "http://cdn.newsapi.com.au/image/v1/external?url=http%3A%2F%2Fcontent6.video.news.com.au%2FJ3cHBqdzo0jPf6IaTynUZDIwlRsnAqTD%2Fpromo266634501&width=650&api_key=kq7wnrk4eun47vz9c5xuj3mc", "http://widgets.outbrain.com/outbrain.js"], "published": "2015-09-26T03:22:00.000+03:00", "crawled": "2015-10-20T14:09:43.282+03:00", "highlightTitle": ""}