{"organizations": [], "uuid": "d4a44376c76d385de4d9744c1978c85fb665d064", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mysanantonio.com", "main_image": "http://ww4.hdnux.com/photos/41/42/67/8793595/3/rawImage.jpg", "site_section": "http://www.mysanantonio.com/rss/feed/mySA-Entertainment-923.php", "section_title": "mySA Entertainment", "url": "http://www.mysanantonio.com/entertainment/movies-tv/article/Bridge-of-Spies-Spielberg-does-everything-6571843.php", "country": "US", "title": "‘Bridge of Spies’: Spielberg does everything right in this Cold War thriller", "performance_score": 0, "site": "mysanantonio.com", "participants_count": 1, "title_full": "‘Bridge of Spies’: Spielberg does everything right in this Cold War thriller - San Antonio Express-News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T13:01:00.000+03:00", "replies_count": 0, "uuid": "d4a44376c76d385de4d9744c1978c85fb665d064"}, "author": "Mick LaSalle, San Francisco Chronicle", "url": "http://www.mysanantonio.com/entertainment/movies-tv/article/Bridge-of-Spies-Spielberg-does-everything-6571843.php", "ord_in_thread": 0, "title": "‘Bridge of Spies’: Spielberg does everything right in this Cold War thriller", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photo: Jaap Buitendijk, HONS / Associated Press Image 1 of / 9 9 In this image released by Disney, Tom Hanks, from right, Mark Rylance and Billy Magnusson appear in a scene from \"Bridge of Spies.\" (Jaap Buitendijk/DreamWorks Pictures/Fox 2000 PIctures via AP) In this image released by Disney, Tom Hanks, from right, Mark Rylance and Billy Magnusson appear in a scene from \"Bridge of Spies.\" (Jaap Buitendijk/DreamWorks Pictures/Fox 2000 PIctures via AP) Photo: Jaap Buitendijk, HONS / Associated Press Image 2 of 9 In this image released by Disney, Tom Hanks appears in a scene from \"Bridge of Spies.\" (Jaap Buitendijk/DreamWorks Pictures/Fox 2000 PIctures via AP) In this image released by Disney, Tom Hanks appears in a scene from \"Bridge of Spies.\" (Jaap Buitendijk/DreamWorks Pictures/Fox 2000 PIctures via AP) Photo: Jaap Buitendijk, HONS / Associated Press Image 3 of 9 Tom Hanks stars as a lawyer in Steven Spielberg’s cold war thriller “Bridge of Spies.” Tom Hanks stars as a lawyer in Steven Spielberg’s cold war thriller “Bridge of Spies.” Photo: DreamWorks Pictures /Fox 2000 Pictures Image 4 of 9 In this image released by Disney, Tom Hanks appears in a scene from \"Bridge of Spies.\" (Jaap Buitendijk/DreamWorks Pictures/Fox 2000 PIctures via AP) In this image released by Disney, Tom Hanks appears in a scene from \"Bridge of Spies.\" (Jaap Buitendijk/DreamWorks Pictures/Fox 2000 PIctures via AP) Photo: Jaap Buitendijk, HONS / Associated Press Image 5 of 9 In this image released by Disney, Mark Rylance appears in a scene from \"Bridge of Spies.\" (Jaap Buitendijk/DreamWorks Pictures/Fox 2000 PIctures via AP) In this image released by Disney, Mark Rylance appears in a scene from \"Bridge of Spies.\" (Jaap Buitendijk/DreamWorks Pictures/Fox 2000 PIctures via AP) Photo: Jaap Buitendijk, HONS / Associated Press Image 6 of 9 In this image released by Disney, Mark Rylance, left, and Tom Hanks appear in a scene from \"Bridge of Spies.\" (Jaap Buitendijk/DreamWorks Pictures/Fox 2000 PIctures via AP) In this image released by Disney, Mark Rylance, left, and Tom Hanks appear in a scene from \"Bridge of Spies.\" (Jaap Buitendijk/DreamWorks Pictures/Fox 2000 PIctures via AP) Photo: Jaap Buitendijk, HONS / Associated Press Image 7 of 9 Kate Capshaw, left, and Steven Spielberg, right, attend the New York Film Festival \"Bridge of Spies\" premiere at Alice Tully Hall on Sunday, Oct. 4, 2015, in New York. (Photo by Andy Kropa/Invision/AP) Kate Capshaw, left, and Steven Spielberg, right, attend the New York Film Festival \"Bridge of Spies\" premiere at Alice Tully Hall on Sunday, Oct. 4, 2015, in New York. (Photo by Andy Kropa/Invision/AP) Photo: Andy Kropa, INVL / Associated Press Image 8 of 9 In this image released by DreamWorks II Distribution Co., Tom Hanks portrays Brooklyn lawyer James Donovan in a scene from the Steven Spielberg film, \"Bridge of Spies.\" The movie is due to open in U.S. theaters on Oct. 16, 2015. (Jaap Buitendijk/DreamWorks II Distribution Co. via AP) In this image released by DreamWorks II Distribution Co., Tom Hanks portrays Brooklyn lawyer James Donovan in a scene from the Steven Spielberg film, \"Bridge of Spies.\" The movie is due to open in U.S. ... more Photo: Jaap Buitendijk, HONS / Associated Press Image 9 of 9 ‘Bridge of Spies’: Spielberg does everything right in this Cold War thriller 1 / 9 Back to Gallery Watching a Spielberg movie is like riding in the back of an old Town Car. There’s plenty of room, the construction is solid, you know you’re heading somewhere, and even if there are bumps, the ride is always smooth.\nIndeed, Steven Spielberg is so smooth, so good at what he does, his best movies have a way of seeming inevitable, when they’re the farthest thing from it.\nCase in point, “Bridge of Spies,” which is the product of some thousand (or ten thousand) decisions that all happened to be right, from the casting, to the choice of shots, to the direction of the actors, to the costumes and art direction. There is a gift for story at work here, which is more than instinctive but has instinct at its core, that can be described but not fully explained.\nMore Information Bridge of Spies\n★★★★\nQuick take: Don’t take Spielberg’s artistry for granted\nEvery filmmaker takes you by the hand, but only some make you forget all about letting go — and they’re never the ones that grip the tightest.\nThe story of “Bridge of Spies” can be talked about in a number of ways, as a story about espionage or the Cold War, but at its heart it’s a character portrait. Specifically, it’s the story of a man of principal, who, when confronted by the biggest drama of his life got bigger instead of smaller.\nJames B. Donovan , a New York lawyer in the 1950s, is played by Tom Hanks , who is the acting equivalent of Spielberg. He doesn’t do anything fancy. He just does the right thing from moment to moment, with his uncanny way of always knowing what the right thing is.\nThe movie begins with what could almost be a silent sequence, in which we encounter Rudolf Abel (Mark Rylance), a whimsical, unassuming man, who is soon revealed to be a Soviet spy. These early scenes are set in New York in 1957, and you could hope for no better transport to an earlier era outside a time machine.\nIt’s not just the cars and the costumes that are perfect, but the font on the signs, and the kinds of businesses shown on the street, not to mention a bridge in the distance that looks newer than it does now, and the use of film stock that evokes a Technicolor newsreel.\nWhen we first meet Donovan, he is negotiating on behalf of a client in his capacity as an insurance lawyer. We notice two things right away: He knows how to win, even while negotiating from a weak position. He can argue vigorously, while alienating no one. These abilities will come into play later in the film.\nHistory finds Donovan, and the movie kicks into gear, when he is enlisted to defend Abel, who is accused of espionage. The American government wants Abel to have a good lawyer, in order to demonstrate to the world that Abel is being treated fairly.\nWhat they don’t expect is for Donovan to mount an actual defense. Some of the best scenes involve Donovan’s clashes with the presiding judge ( Dakin Matthews ), who assumes a superior air, even as his manner suggests the unease of a proud man taking orders from upstairs.\nSpielberg and the screenwriters ( Matt Charman and the Coen brothers) present Donovan as a kind of ideal combination of geniality and perception. Before anyone, he has the notion that a foreign spy should be treated differently from a domestic traitor, bearing in mind that America has spies working in other countries.\nThis becomes important as “Bridge of Spies” transmutes from the story of a court case into one involving the U-2 incident and the crash of Francis Gary Powers .\nSpielberg being Spielberg, the scene in which the U-2 is shot down, from altitude of 70,000 feet, is harrowing in its execution. But then all the details of this film feel right, whether it’s the glazed look of people on a New York subway, or the soul-sick frenzy of Berlin just as the wall was going up.\nSpielberg throws away nothing, so that a single scene involving CIA director Allen Dulles isn’t merely functional, but has reverberations to it. Without seeming to be doing much in particular, actor Peter McRobbie makes you think that everything you’ve ever heard about Dulles is true, especially the bad things.\nIn the end, most movies about history are in some way about the times in which they were made. “Bridge of Spies” is not a direct allegory for our times, but rather a useful reminder that at all the pressure points of our history, there have always been people ready to do an end-run around the Constitution, either out of fear or convenience.\n“Bridge of Spies” tells us that the Constitution is not some quaint national luxury but the roadmap out of the darkness.\nRunning time: 135 minutes\nMPAA rating: PG-13 (violence, profanity)", "external_links": ["http://ww2.hdnux.com/photos/41/42/70/8793601/3/920x920.jpg", "http://ww3.hdnux.com/photos/41/42/67/8793598/3/920x920.jpg", "http://ww4.hdnux.com/photos/41/42/67/8793595/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/41/42/67/8793597/3/920x920.jpg", "http://ww4.hdnux.com/photos/41/42/67/8793599/3/920x920.jpg", "http://ww2.hdnux.com/photos/41/42/70/8793601/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/41/42/67/8793598/3/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/41/42/67/8793596/3/920x920.jpg", "http://ww4.hdnux.com/photos/41/42/67/8793599/3/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/41/30/66/8752548/6/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/41/42/67/8793597/3/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/41/42/67/8793595/3/920x920.jpg", "http://ww1.hdnux.com/photos/41/42/70/8793600/3/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/41/42/67/8793596/3/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/41/42/70/8793600/3/920x920.jpg", "http://ww1.hdnux.com/photos/41/30/66/8752548/6/920x920.jpg"], "published": "2015-10-15T13:01:00.000+03:00", "crawled": "2015-10-15T13:44:25.231+03:00", "highlightTitle": ""}