{"organizations": [], "uuid": "19b0374970042fd8f5f8766322c226a2c88d9df1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wopular.com", "main_image": "", "site_section": "http://www.wopular.com/rss/sections/11331", "section_title": "RSS: entertainment", "url": "http://www.wopular.com/lupita-nyongo-take-play-eclipsed-broadway-0", "country": "US", "title": "Lupita Nyong'o to take play 'Eclipsed' to Broadway", "performance_score": 0, "site": "wopular.com", "participants_count": 1, "title_full": "Lupita Nyong'o to take play 'Eclipsed' to Broadway", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T17:09:00.000+03:00", "replies_count": 0, "uuid": "19b0374970042fd8f5f8766322c226a2c88d9df1"}, "author": "senh", "url": "http://www.wopular.com/lupita-nyongo-take-play-eclipsed-broadway-0", "ord_in_thread": 0, "title": "Lupita Nyong'o to take play 'Eclipsed' to Broadway", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BING NEWS: Public Theater's Eclipsed to transfer to Broadway The Public Theater has announced that its current production of Eclipsed, written by Danai Gurira, directed by Liesl Tommy and starring Oscar winner Lupita Nyong'o, will transfer to ... this magnificent and powerful play to Broadway after its sold-out ... 10/20/2015 - 3:24 am | View Link Lupita Nyong'o to take play 'Eclipsed' to Broadway NEW YORK (AP) — Oscar-winner Lupita Nyong'o will make the leap to Broadway this winter, bringing the harrowing play \"Eclipsed\" to the Great White Way. The play by Danai Gurira about how some women might endure captivity and regular rape in squalid ... 10/20/2015 - 3:16 am | View Link 'Eclipsed' to transfer to Broadway, with Lupita Nyong'o Pascale Armand, Lupita Nyong’o and Saycon Sengbloh play \"wives\" of a Liberian warlord in 'Eclipsed.' (Photo: Joan Marcus) Anyone who can't catch Lupita Nyong'o in her off-Broadway debut this fall need only wait for her Broadway bow next year. It was ... 10/20/2015 - 3:14 am | View Link Video: Lupita Nyong'o glows at 'Eclipsed' opening The opening of ECLIPSED, the stunning ... Pascale Armand (Bessie), Akosua Busia (Rita), Zainab Jah (Maima), Lupita Nyong’o (Girl), and Saycon Sengbloh (Helena). The play will run through Sunday, November 15. Amid the chaos of the Liberian Civil War ... 10/18/2015 - 4:04 am | View Link Lupita Nyong'o makes New York stage debut in powerful 'Eclipsed' A one-hit wonder she is not — though Nyong'o groupies might also want to adjust their expectations. \"Eclipsed\" is a harrowing, glamour-free play about women struggling for freedom in war-torn Liberia. Nyong'o is one of a five-person ensemble, and none of ... BING SEARCH: Lupita Nyong’o News, Photos, and Videos | Just Jared Lupita Nyong’o makes her grand entrance at the opening night of her new Off-Broadway play Eclipsed held at The Public Theater on Wednesday (October 14 ... 10/19/2015 - 5:56 pm | View Website Lupita Nyong'o to Make Her New York Stage Debut in 'Eclipsed' Lupita Nyong'o is soaring to the stage. ... The Oscar winner will star in the Public Theater's war drama this fall. 10/19/2015 - 4:01 pm | View Website Lupita Nyong’o on Star Wars, Couture, and Conquering ... The dazzling Kenyan actress Lupita Nyong’o samples the fall couture collections and talks to Plum Sykes about fame, family, and her four new acting projects. 10/19/2015 - 8:02 am | View Website Lupita Nyong'o In 2013, her father was elected to represent Kisumu County in the Kenyan Senate Nyong'o's mother is the managing director of the Africa Cancer Foundation and her own ... 10/18/2015 - 10:40 am | View Website Lupita Nyong'o Lupita Nyong'o, Self: The Oscars. Lupita Amondi Nyong'o was born March 1, 1983 in Mexico City, Mexico, to Kenyan parents, Dorothy and Peter Anyang' Nyong'o. Her ... NEXT Welcome to Wopular \nWopular is an online newspaper rack , giving you a summary view of the top headlines from the top news sites. Senh Duong (Founder) Los Angeles Times , Tuesday - 10/20/2015 - 09:55 PM \nElle’s 22nd annual Women in Hollywood bash had been on the books for months, but it seemed presciently timely Monday night, given recent headlines sparked by Jennifer Lawrence's essay about equal pay for women performers and the passage of California's Fair Pay. The magazine honored eight of the Los Angeles Times , Tuesday - 10/20/2015 - 09:55 PM \nEditor's note: Oct. 21, 2015 is the official Back to the Future Day. It is the exact date that Marty McFly traveled to the future in \"Back to the Future II\" in hopes of saving his family from themselves yet again. To celebrate we have rolled out the 1985 review of the first film for a look at the past Los Angeles Times , Tuesday - 10/20/2015 - 09:55 PM \nIt’s fitting that Simon Goodman, a Los Angeles man who’s spent the past 21 years tracking down brilliant works of art that the Nazis looted from his doomed grandparents, fixed on a gold timepiece made more than 450 years ago for the title of “The Orpheus Clock,\" his new book about his quest. Fallout: Lanius Director to Reveal New IP at PAX Aus IGN , Tuesday - 10/20/2015 - 09:52 PM \nBoutique studio Encryption has announced that its new IP, Skourge Legacy, will be revealed at PAX Australia 2015. Described to IGN as \"Pokemon meets Fallout with a '90s vibe,\" this ambitious new IP will include a sidescrolling brawler video game, an animated TV series, and a line of toys. After an apocalyptic event unleashes a horde of amazing new \"Skourge\" creatures onto the planet, three kids must traverse a ruined land, protecting each other as they travel in search of something better. Continue reading… ‘The Flash': Barry Allen Earns A Cold Welcome From A ‘Family Of Rogues’ MTV , Tuesday - 10/20/2015 - 09:51 PM \nCaptain Cold's equally frigid father entered the snowy mix in the latest episode of 'The Flash' season two. Here's how it played out. Queen Latifah, Shakim Compere and Carl Weber Team on Producing Deal Variety , Tuesday - 10/20/2015 - 09:40 PM \nQueen Latifah and Shakim Compere’s One Unit is partnering with Carl Weber’s Urban Books Media for a multi-year co-production agreement that will cover both film and TV projects, Variety has learned exclusively. The projects will be based on books from Weber’s publishing unit of more than 2,500 titles. Weber has written 26 novels. “The deal unites two amazing teams", "external_links": [], "published": "2015-10-20T17:09:00.000+03:00", "crawled": "2015-10-21T05:04:34.000+03:00", "highlightTitle": ""}