{"organizations": [], "uuid": "55ebfcf5646752ea9cfa3dd6d5ab482087e58e71", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48524/entertainment", "section_title": "Entertainment - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30210597/the-donny-hathaway-legacy-project-launches-on-artists-70th-birthday", "country": "US", "title": "The Donny Hathaway Legacy Project Launches on Artist's 70th Birthday", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "The Donny Hathaway Legacy Project Launches on Artist's 70th Birthday - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T03:00:00.000+03:00", "replies_count": 0, "uuid": "55ebfcf5646752ea9cfa3dd6d5ab482087e58e71"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30210597/the-donny-hathaway-legacy-project-launches-on-artists-70th-birthday", "ord_in_thread": 0, "title": "The Donny Hathaway Legacy Project Launches on Artist's 70th Birthday", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Information contained on this page is provided by an independent third-party content provider. WorldNow and this Station make no warranties or representations in connection therewith. If you have any questions or comments about this page please contact pressreleases@worldnow.com .\nSOURCE The Donny Hathaway Legacy Project\nThe launch of The Donny Hathaway Legacy Project (DHLP) aims to celebrate his life and legacy with events planned in major cities around the world to celebrate his birthday and pay tribute to his legacy.\nNASHVILLE, Tenn. , Oct. 7, 2015 /PRNewswire/ -- Donny Hathaway , arguably one of the most important voices of the 20th century, would have been 70 years old on October 1 . With some of the most culturally impactful music of the 1970's, Hathaway's songs, along with his story as a prolific singer, songwriter, pianist and composer still resonates in the hearts of people all over the world.\n\"Our father was a prolific musician admired by many for his creativity and musicianship,\" said Donnita Hathaway, daughter and chair of the DHLP board of directors. \"It's an honor that people like Roberta Flack [honorary co-chair] and Lindsey Aaron [advisory board member] have said yes to helping us solidify his legacy with this effort.\"\nThe launch of The Donny Hathaway Legacy Project (DHLP) aims to celebrate his life and legacy with events planned in major cities around the world to celebrate his birthday and pay tribute to his legacy. Designed to honor the legacy of a visionary gone too soon, The Donny Hathaway Legacy Project will present special projects, notable honors and charitable programs to share the music that filled his life and support those artists who share his illness.\n\"We are honored to launch this effort for the Hathaway family,\" said Anasa Troutman, president of Eloveate. \"The magnitude and body of work that Donny Hathaway produced still has a significant impact on music, even today. I was pleasantly surprised that Hungarian Pop Star Viktor Kiraly, just this week, sang Donny's version of \" What's Going On \" on The Voice .\"\nTribute concert events in Atlanta and New York City , as well as radio stations, around the world, are dedicating entire shows to his music today. In addition to these events, The Donny Hathaway Legacy Project will organize on social media to celebrate with the hashtag #Donny70 encouraging friends and followers to post a picture, video or story to tell the world what Donny and his music means to them.\nDHLP is also pleased to announce that The National Museum of African American Music , based in Nashville, TN , has partnered with the project to collect artifacts from Donny Hathaway's life and music. This partnership will result in a permanent collection for DHLP and a permanent display in the museum space. Additionally, MusiCares , a program of The Recording Academy, has partnered with the project to manage and distribute funds to support emergency and ongoing care for artists with mental health diagnoses.\nTo learn more about The Donny Hathaway Legacy Project, visit The Donny Hathaway Legacy Project on Facebook .\nAbout The National Museum of African American Music\nAs the only museum dedicated to the many offerings African Americans have made in music, the National Museum of African American Music serves a global landscape by commemorating and honoring the legacy, impact and influence of rhythm on over 50 music genres and styles. Detailing the many dimensions of all types of music, NMAAM focuses on the musical impact on musicians and consumers around the world. For more information, visit NMAAM.org.\nAbout MusiCares\nMusiCares provides a safety net of critical assistance for music people in times of need. MusiCares' services and resources cover a wide range of financial, medical and personal emergencies, and each case is treated with integrity and confidentiality. MusiCares also focuses the resources and attention of the music industry on human service issues that directly impact the health and welfare of the music community. For more information, visit Grammy.org/musicares.\nAbout Eloveate\nA collective of artists devoted to creating a culture of love on the planet. Led by founder and CEO, Anasa Troutman, The Eloveate Team works to educate, incubate and innovate using the power of art, culture and creativity. Eloveate produces its own work and supports the work of others to create a robust line up of creative projects meant to increase opportunities to each of us to reflect beauty, heal separation, serve humanity and transform to become our best selves. For more information, visit Elovate.net .\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/the-donny-hathaway-legacy-project-launches-on-artists-70th-birthday-300155992.html\n©2015 PR Newswire. All Rights Reserved.", "external_links": ["http://www.nmaam.org/", "https://www.grammy.org/musicares", "http://www.xmlnews.org/ns/", "http://www.youtube.com/watch?v=iehrFzQDBZY", "http://www.eloveate.net/", "https://www.facebook.com/DonnyHathawayLP?fref=ts", "http://www.prnewswire.com/news-releases/the-donny-hathaway-legacy-project-launches-on-artists-70th-birthday-300155992.html", "http://rt.prnewswire.com/rt.gif?NewsItemId=NY22611&Transmission_Id=201510071656PR_NEWS_USPR_____NY22611&DateId=20151007"], "published": "2015-10-07T03:00:00.000+03:00", "crawled": "2015-10-08T01:08:49.565+03:00", "highlightTitle": ""}