{"organizations": [], "uuid": "66de3143658d777f8b2d7487fda4a8f68d8ccf9b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "http://www.bostonherald.com/sites/default/files/media/ap/2f915996f59644b6a9a012cb8241cdbd.jpg", "site_section": "http://bostonherald.com/entertainment/books", "section_title": "Entertainment: Books | Boston Herald", "url": "http://bostonherald.com/entertainment/books/2015/10/the_latest_free_speech_group_praises_alexievich_nobel_honor", "country": "US", "title": "The Latest: Free-speech group praises Alexievich Nobel honor", "performance_score": 0, "site": "bostonherald.com", "participants_count": 1, "title_full": "The Latest: Free-speech group praises Alexievich Nobel honor | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "66de3143658d777f8b2d7487fda4a8f68d8ccf9b"}, "author": "Associated Press", "url": "http://bostonherald.com/entertainment/books/2015/10/the_latest_free_speech_group_praises_alexievich_nobel_honor", "ord_in_thread": 0, "title": "The Latest: Free-speech group praises Alexievich Nobel honor", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "STOCKHOLM — Latest news from the awarding of the Nobel Prize in literature.\n___\n2:45 p.m.\nWriters' free-speech group English PEN called Nobel literature laureate Svetlana Alexievich \"a tireless chronicler of voices which might not otherwise be heard,\" and said it hoped her victory would encourage the Belarus government to improve its human rights record.\nThe group's deputy director, Catherine Taylor, said she hoped the Nobel Prize \"will further highlight the civil and political injustices in Belarus and go some way to bringing about the restitution of free speech and freedom of expression for all Belarusians.\"\nAlexievich spent several years living outside Belarus after criticizing the country's authoritarian President Alexander Lukashenko, who is up for re-election on Sunday.\nAlexievich has called the 2011 elections that returned Lukashenko to power \"a humanitarian catastrophe for the entire Belarus society.\"\n___\n2:20 p.m.\nThe permanent secretary of the Swedish Academy says this year's winner of the Nobel Prize in literature has developed \"a new literary genre.\"\nSara Danius says Svetlana Alexievich \"is offering us new and interesting historical material and she has developed a particular writing style, as well a new literary genre\".\nShe adds that the works \"amount to a vast literary chronicle of the emotional life, the inner life of the Soviet individual, as well as the post-Soviet individual.\"\nAlexievich is the first a journalist to win the Nobel Prize in literature, but Danius says she is \"a very unusual journalist\" and \"her literary qualities are very striking.\"\n___\n2:10 p.m.\nThe permanent secretary of the Swedish Academy says Svetlana Alexievich spoke only one word when she learned she had won the Nobel Prize in literature: \"Fantastic.\"\nSara Danius says she called Alexievich some 15 minutes before she announced the winner to the world.\nThe Belarusian journalist was awarded the prize by the Swedish Academy Thursday.\n___\n1:45 p.m.\nSpeaking by phone to Swedish broadcaster SVT, Svetlana Alexievich said winning the Nobel Prize in literature left her with a \"complicated\" feeling.\n\"It immediately evokes such great names as (Ivan) Bunin, (Boris) Pasternak, she said, referring to other Russian writers who have won the prize. \"On the one hand, it's such a fantastic feeling, but it's also a bit disturbing.\"\nShe said she was at home \"doing chores, I was doing the ironing,\" when the academy called her.\nAsked what she was going to do with the 8 million Swedish kronor (about $960,000) prize money, she said: \"I do only one thing: I buy freedom for myself. It takes me a long time to write my books, from five to 10 years.\n\"I have two ideas for new books so I'm pleased that I will now have the freedom to work on them.\"\n___\n1:35 p.m.\nThe new permanent secretary of the Swedish Academy recommends readers unfamiliar with this year's winner of the Nobel Prize in literature to start with her book \"The Unwomanly Face of War.\"\nSara Danius says the work by Svetlana Alexievich is a \"a large, thick book that is based on hundreds of deep interviews with female participants in the Second World War, in the Red Army. She says it is an \"absolutely brilliant book\" that is makes for a captivating, but sometimes also dark read.\nShe says \"it is about women who voluntarily headed to the front line, pretty much the same conditions as the men.\"\n___\n1:20 p.m.\nThe new permanent secretary of the Swedish Academy says this year's winner of the Nobel Prize in literature \"has mapped the soul\" of the Soviet and post-Soviet people.\nSara Danius says Belarusian journalist Svetlana Alexievich has spent nearly 40 years studying the people of the former Soviet Union, but says her work isn't only about history, it is also about \"something eternal, a glimpse of eternity.\"\nDanius adds she is very pleased that Alexievich has won the prize, calling her work \"absolutely brilliant.\"\n___\n1 p.m.\nBelarusian writer Svetlana Alexievich has won the 2015 Nobel Prize in literature.\nThe Swedish Academy cited the 67-year-old writer \"for her polyphonic writings, a monument to suffering and courage in our time\".\n___\n10:20 a.m.\nThe announcements of the science awards are over and now the Nobel Prize spotlight turns to literature.\nThe permanent secretary of the Swedish Academy, Sara Danius, is expected to announce the winner of the 2015 Nobel Prize in literature at 1100 GMT in the academy's Grand Hall in Stockholm's Old Town district.\nMany of the names rumored to be among the top candidates in previous years are back in the buzz for this year's award, with betting firm Ladbrokes giving the lowest odds to Belarusian journalist Svetlana Alexievich, Haruki Murakami of Japan, Kenya's Ngugi Wa Thiong'o, Norwegian playwright Jon Fosse and American writer Joyce Carol Oates.\nThe secretive academy has dropped no hints before the announcement.", "external_links": [], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-08T16:28:08.570+03:00", "highlightTitle": ""}