{"organizations": [], "uuid": "46b8a20ae926cf32bebb569601bb74f5addd9a77", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wiltshiretimes.co.uk", "main_image": "http://www.wiltshiretimes.co.uk/resources/images/4302415/", "site_section": "http://www.wiltshiretimes.co.uk/leisure/showbiz/rss/", "section_title": "Wiltshire Times | National Entertainment News", "url": "http://www.wiltshiretimes.co.uk/leisure/showbiz/13810714.Renee_Zellweger_shows_off_her_fake_baby_bump_as_she_shoots_scenes_for_Bridget_Jones_s_Baby/?ref=rss", "country": "GB", "title": "Renee Zellweger shows off her fake baby bump as she shoots scenes for Bridget Jones's Baby", "performance_score": 0, "site": "wiltshiretimes.co.uk", "participants_count": 0, "title_full": "Renee Zellweger shows off her fake baby bump as she shoots scenes for Bridget Jones's Baby", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T20:40:00.000+03:00", "replies_count": 0, "uuid": "46b8a20ae926cf32bebb569601bb74f5addd9a77"}, "author": "", "url": "http://www.wiltshiretimes.co.uk/leisure/showbiz/13810714.Renee_Zellweger_shows_off_her_fake_baby_bump_as_she_shoots_scenes_for_Bridget_Jones_s_Baby/?ref=rss", "ord_in_thread": 0, "title": "Renee Zellweger shows off her fake baby bump as she shoots scenes for Bridget Jones's Baby", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Renee Zellweger", "Zellweger", "Bridget Jones"], "text": "Renee Zellweger shows off her fake baby bump as she shoots scenes for Bridget Jones's Baby Renee Zellweger shows off her fake baby bump as she shoots scenes for Bridget Jones's Baby \nPress Association 2014 / / National Entertainment News Share \nIf the title hadn’t given it away, then these new pictures from the set of the new Bridget Jones movie have. \nRenee Zellweger was back in character as Bridget and sporting a large prosthetic bump for scenes in the upcoming movie Bridget Jones’s Baby. (Daniel Leal-Olivas/PA) \nZellweger wrapped up warm in a fluffy blue coat, striped top, blue jeans and black boots on set outside Sainsbury’s supermarket in Woolwich, south London. \nThe store’s famous orange bag hung heavy in her hand as she reprised her eponymous character for Bridget Jones’s Baby, the third instalment of the franchise, 14 years after the first was released. (Daniel Leal-Olivas/PA) \nThe full extent of her fake bump was obvious from the side and gave away at least one big plot spoiler. \nThe second, we assume, is that Bridget is an avid collector of Nectar card points. (Daniel Leal-Olivas/PA) \nThe actress had her blonde hair messily tied up, showing off her slimmer face and indicating that Bridget no longer needs to worry about having a bottom the “size of Brazil”. \nRenee gained 30lb to play Bridget in the first two films, but looked slim underneath the coat and prosthetic bump on set. (Daniel Leal-Olivas/PA) \nColin Firth will return as Mark Darcy, whom Bridget became engaged to at the end of the second film, Bridget Jones: The Edge Of Reason. \nUS actor Patrick Dempsey confirmed his involvement in the film with an Instagram shot in September, and he is rumoured to play a new love interest. \nThe first official image from the movie was released by Working Title last week showing the actress smiling and having traded in her diary for a modern iPad. \nAuthor Helen Fielding released her third Bridget Jones novel, Mad About The Boy, in October 2013, although it is not known if the new film will follow the same plot. Share article \nAccording to IMDb, it is slated for release in the UK in September next year. Promoted Stories", "external_links": [], "published": "2015-10-07T20:40:00.000+03:00", "crawled": "2015-10-09T07:28:05.545+03:00", "highlightTitle": ""}