{"organizations": [], "uuid": "befa6a2d1c4ebb5d2f12a039430b50953b843eed", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.huffingtonpost.co.uk", "main_image": "http://i.huffpost.com/gen/3554582/images/o-ANTON-STEPHANS-X-FACTOR-facebook.jpg", "site_section": "http://www.huffingtonpost.co.uk/feeds/verticals/uk-entertainment/news.xml", "section_title": "UK Entertainment News on The Huffington Post", "url": "http://www.huffingtonpost.co.uk/2015/10/19/x-factor-2015-anton-stephans-drugs-ecstasy-addiction_n_8328770.html", "country": "US", "title": "'X Factor' Contestant Anton Stephans Reveals Eight-Year Ecstasy Addiction", "performance_score": 0, "site": "huffingtonpost.co.uk", "participants_count": 1, "title_full": "'X Factor' Contestant Anton Stephans Reveals Eight-Year Ecstasy Addiction", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T10:20:00.000+03:00", "replies_count": 0, "uuid": "befa6a2d1c4ebb5d2f12a039430b50953b843eed"}, "author": "Ashley Percival", "url": "http://www.huffingtonpost.co.uk/2015/10/19/x-factor-2015-anton-stephans-drugs-ecstasy-addiction_n_8328770.html", "ord_in_thread": 0, "title": "'X Factor' Contestant Anton Stephans Reveals Eight-Year Ecstasy Addiction", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "'X Factor' Contestant Anton Stephans Reveals Eight-Year Ecstasy Addiction   Ashley Percival \n‘ X Factor ’ favourite Anton Stephans has revealed an eight-year addiction to ecstasy. MORE 'X FACTOR': \nThe 45-year-old singer has admitted he was hooked on the class A drug during his 20s and 30s, claiming it robbed him of “everything” he loved. \nAnton Stephans \nSpeaking to The Sun, Anton said he began taking ecstasy after being “seduced” by friends he partied with. \n“Have I smoked marijuana? Yes. Have I popped pills? Yes, I have. There’s very little I haven’t done, and I have to own up to doing those things. \n“But do I do them now? Absolutely not.” \nHe now teaches children about the dangers of drugs so that they can learn from his errors. \nHe previously opened up about his battle with a rare form of cancer , revealing doctors gave him six weeks to live during his six-year illness. \n\"I had tumours on my pituitary glands and my adrenal glands,” he said during an appearance on ‘Good Morning Britain’. \n“At one stage I was given six weeks to live. Thankfully they didn't tell me that at the time.\" \nHe continued: “I pretty much thought that if I get through this I’m going to do all the things that I've been frightened of doing. \n“You kind of know with your body and I decided ‘I’m going to beat this and do ‘The X Factor'.” ‘The X Factor’ continues on Saturday (24 October) at 8pm on ITV. Close 'X Factor': Most Controversial Moments of   'X Factor' has been known for its outrageous moments even from series one - when Sharon Osbourne closed the series with this notorious attack on eventual winner, Steve Brookstein, branding him \"full of crap\" and \"an average singer\". In his book, 'Getting Over The X', Steve also made various accusations about Sharon's conduct on the show, claiming she also tried to sabotage one of his live interviews by banging on his dressing room wall. Shirlena made it through the first round of auditions, thanks to her interesting and original take on Duffy's 'Mercy', but was ultimately axed from Boot Camp after fears were raised for her mental well-being. The aspiring singer criticised the decision, insisting: \"This is why people hide mental illnesses and don't get help, because it's on their records and then something like this happens. \"Do people with any history of mental illness just have to stay where they are - doing what they're doing?\" Back in series four, 15-year-old Emily Nakanda was one of the early favourites to win the show, but had to back out, after a video emerged showing her violently attacking another teenage girl. Reports at the time said Emily was asked to leave the competition by producers, or risk being axed. Louis' decision to 'take it to deadlock' rather than save Carolynne Poole - who he literally says seconds earlier he wants to keep in the competition - was met with a backlash in series eight, particularly as during her 'save me' performance, a producer was seen whispering in his ear. Hmmm... Frankie's hard partying during his time on 'X Factor' in 2011 was well-documented, but it ended up costing him his place in the competition, when he broke one of producers' \"golden rules\", later reported to have been the use of class-A drugs. The addition of Nick Grimshaw and Rita Ora was - at least initially - a controversial one, with some critics wondering whether either of them had the relevant experience to find the UK's hottest talent. The 'Six Chair Challenge' has been a sticking point with 'X Factor' viewers since its debut in 2013. Many have branded the final stage of Bootcamp cruel, with some hopefuls gaining a place at Judges' Houses only to have to give it up later, but Simon Cowell clearly doesn't mind, as it's back for 2015. The Take That singer was heavily criticised, when he responded to Tulisa's critique of his contestant, Christopher Maloney, with a comment about her \"fag ash breath\". Classy, Gary. Real classy. Misha B was forced to defend herself on 'The Xtra Factor', when Louis Walsh and Tulisa accused her of \"bullying\" fellow contestants, during a live critique of her performance. Awks. Louis repeatedly accused Dannii of stealing one of his acts' songs back in 2008, resulting in the 'Put The Needle On It' singer breaking down in tears live on air, and having to vacate the panel at one point to gather herself. Simon jumped to Dannii's defence, telling Louis: \"Dannii made the right choice, Louis, if you don't like it, tough. \"You're always whining and complaining. You two have to kiss and make up.\" The judge was met with a stunned silence from the panel and the audience, when she made a comment about Danyl Johnson's sexuality, following a performance. Matt Cardle might not seem like a controversy magnet, but this steamy performance with Rihanna managed to spark almost 3000 complaints to Ofcom, thanks to their on-stage tension and her provocative outfit. Christina Aguilera also performed that night, with some of the complaints being made about her routine, taken from the (Oscar bait) film, 'Burlesque'. A turning point for Cheryl's popularity with the British public came when she was met with a backlash for putting both Cher Lloyd and Katie Waissel through to the live shows, over viewers' favourite Gamu, despite neither of them finishing their performances at judges' houses. Reports later suggested that Gamu could be facing deportation from the UK - adding to the backlash against Cheryl - though the aspiring singer was later insistent this was not the case. Proving it's not just the UK 'X Factor' that finds itself facing a backlash... SERIOUSLY - WHAT WAS THIS ABOUT?! And speaking of international 'X Factors', 13-year-old Rachel Crow's discovery she had been booted out of the American version of the competition, with Nicole Scherzinger making the final decision, is widely regarded as a low point for reality TV in general. And yes, that is Steve Jones presenting, by the way. HARRY!! The rock group pipped Joe McElderry to the coveted Christmas number-pone spot, thanks to a Facebook campaign from one anti-'X Factor' music fan, who wanted real music back on the Christmas number one spot. Because that's a title that's always gone to such credible acts, isn't it? Look at Westlife. And Cliff Richard. AND MR BLOBBY. *disgruntled exhale*  Share", "external_links": [], "published": "2015-10-19T10:20:00.000+03:00", "crawled": "2015-10-19T10:56:38.030+03:00", "highlightTitle": ""}