{"organizations": [], "uuid": "a80a1349a4ca720c1f362bb069721dba92db5f81", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.newsherald.com", "main_image": "http://www.newsherald.com/storyimage/DA/20151010/ENTERTAINMENT/151019974/AR/0/AR-151019974.jpg", "site_section": "http://www.newsherald.com/entertainment?template=rss&mime=xml", "section_title": "Entertainment - Panama City News Herald", "url": "http://www.newsherald.com/article/20151010/ENTERTAINMENT/151019974/15776/ENTERTAINMENT?rssfeed=true", "country": "US", "title": "Pirates plunder Panama City Beach", "performance_score": 0, "site": "newsherald.com", "participants_count": 1, "title_full": "Pirates plunder Panama City Beach", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T02:46:00.000+03:00", "replies_count": 0, "uuid": "a80a1349a4ca720c1f362bb069721dba92db5f81"}, "author": "COLLIN BREAUX", "url": "http://www.newsherald.com/article/20151010/ENTERTAINMENT/151019974/15776/ENTERTAINMENT?rssfeed=true", "ord_in_thread": 0, "title": "Pirates plunder Panama City Beach", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Pirates plunder Panama City Beach Pier Park was under attack Saturday. Posted Oct. 10, 2015 at 6:43 PM Updated Oct 10, 2015 at 6:46 PM Mayor Gayle Oberst is kidnapped by naughty pirates during the Pirates of the High Seas Festival in Pier Park. Posted Oct. 10, 2015 at 6:43 PM Updated Oct 10, 2015 at 6:46 PM » RELATED CONTENT • Pirate Fest PANAMA CITY BEACH — Pier Park was under attack Saturday. Pirates seized the town square as they brandished their swords and called for Panama City Beach Mayor Gayle Oberst to come down. There were flags with the crossbones symbol, vests and eye patches. “Open fire!” a pirate yelled. Cannon fire erupted. A crowd gathered and some captured the moment on their phones. “Where’s the mayor? Bring me the keys to the city!” The pirates traveled to the other end of Pier Park where a swordfight erupted. Eventually the outlaws who vowed to take control of the area were defeated and hauled off to the county jail. The crowd clapped as they learned the local militia defended Bay County. This was the “Invasion of Panama City Beach” in which the Pirates of Dominique Youx defended PCB. Saturday’s invasion was part of the fifth annual Pirates of the High Seas Fest. The event began Friday, with a treasure drop and second line parade among the festivities that kicked off the three-day event. Along with the invasion, Saturday’s sights included live music provided by Tom Mason and the Blue Buccaneers and an adult costume contest. At one point during their performance, the guitarist for Tom Mason and the Blue Buccaneers stepped off the stage and played while he wandered into the crowd. A few people up at the front danced, some of them dressed as pirates. Those outfitted as the sea renegades of the past ranged from adults to young children. “It’s just fun. You can act like a kid again,” Mike Andel said. Andel was with the Krewe of Lafitte, which had floats in the parade that rode Saturday. He came down from Pensacola for the occasion. The Krewe of Lafitte is the largest all-male Mardi Gras Krewe in the Florida Panhandle, according to their website. The organization was founded in 1954 to promote a means to celebrate Carnival. It was Andel’s fourth year attending the Pirates of the High Seas Fest. Pirates were popular because they were swashbuckling figures that had a mystique to them, Andel said. Mike and Wanda Cavender came from Georgia. They attended the event dressed as pirates for their grandson, they said. “He thinks he is Captain Hook so we have to dress accordingly,” Wanda Cavender said. It was their first time at the event and they thought Pier Park did a good job producing the annual attraction. Wanda Cavender said she was not sure why pirates were popular but thought the show “Jake and the Never Land Pirates” had something to with pirates’ place in pop culture. The Cavenders had their costumes for a couple of years and have dressed as pirates before. They even attended a pirate-themed wedding for their son, they said. Page 2 of 2 - Locals partook in the Saturday fun as well. Sarah and Waylon Register from PCB walked about Saturday with their son Quinn. The three were all dressed as pirates. The outfit Quinn Register wore was one of three pirate costumes he owned, Sarah Register said. “We’re all pirate fans,” Sarah Register said. It was their first time. There were a variety of activities and the event seemed like a fun thing to do, Waylon Register said. Saturday seemed well-attended, Sarah Register said. The event is free and continues Sunday.", "external_links": [], "published": "2015-10-11T02:46:00.000+03:00", "crawled": "2015-10-11T16:23:55.760+03:00", "highlightTitle": ""}