{"organizations": ["ABC", "Associated Press", "T-Mobile USA, Inc."], "uuid": "0dd3d0359320aa2771fbf4fe421d514acfe5be16", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kpho.com", "main_image": "http://tvguide.images.worldnow.com/images/9074123_G.jpg", "site_section": "http://www.kpho.com/category/73801/entertainment?clienttype=rss", "section_title": "KPHO Phoenix - Entertainment", "url": "http://www.kpho.com/story/30318728/report-khloe-kardashian-and-lamar-odom-call-off-their-divorce", "country": "US", "title": "Khloe Kardashian and Lamar Odom call off their divorce", "performance_score": 0, "site": "kpho.com", "participants_count": 0, "title_full": "Khloe Kardashian and Lamar Odom call off their divorce", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T17:49:00.000+03:00", "replies_count": 0, "uuid": "0dd3d0359320aa2771fbf4fe421d514acfe5be16"}, "author": "", "url": "http://www.kpho.com/story/30318728/report-khloe-kardashian-and-lamar-odom-call-off-their-divorce", "ord_in_thread": 0, "title": "Khloe Kardashian and Lamar Odom call off their divorce", "locations": ["Miami", "Calif.", "Fallbrook", "Hollywood Hills"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Tracy Morgan", "Chris Rock", "Hashim Pew", "Bobbie Jo Bradley", "Kardashian", "Lamar Odom", "Bob Barker", "Rock", "Khloe Kardashian", "Theo Wargo", "Pat Woodell", "Peter Billingsley", "Kim", "Ralphie", "Kevin Pew"], "text": "Khloe Kardashian and Lamar Odom call off their divorce Updated: © PRNewsFoto / T-Mobile USA, Inc., Theo Wargo / WireImage.com TVGuide Photo Galleries More>> We're guessing Kim's not going to be too happy about this. More > We're guessing Kim's not going to be too happy about this. More > Bob Barker taken to hospital after falling near his home Bob Barker was hospitalized Tuesday after he tripped and fell while taking a walk near his home in the Hollywood Hills, TMZ reports. More > Bob Barker was hospitalized Tuesday after he tripped and fell while taking a walk near his home in the Hollywood Hills, TMZ reports. More > Chris Rock is hosting the Oscars Chris Rock will host the 2016 Oscars, ABC announced Wednesday. This will be Rock's second time hosting the awards show, which he previously emceed in 2005. More > Chris Rock will host the 2016 Oscars, ABC announced Wednesday. This will be Rock's second time hosting the awards show, which he previously emceed in 2005. More > Petticoat Junction star Pat Woodell dies at 71 Pat Woodell, who played Bobbie Jo Bradley on the 1960s sitcom Petticoat Junction, died of cancer on Sept. 29 at her home in Fallbrook, Calif., The Associated Press reports. She was 71. More > Pat Woodell, who played Bobbie Jo Bradley on the 1960s sitcom Petticoat Junction, died of cancer on Sept. 29 at her home in Fallbrook, Calif., The Associated Press reports. She was 71. More > Khloe Kardashian has finally broken her silence about her estranged husband Lamar Odom's recent hospitalization. More > Khloe Kardashian has finally broken her silence about her estranged husband Lamar Odom's recent hospitalization. More > Tracy Morgan is continuing his comeback by launching a full-scale stand-up tour next year. More > Tracy Morgan is continuing his comeback by launching a full-scale stand-up tour next year. More > Son of Storage Wars: Miami star charged with murdering a family friend during viewing party Hashim Pew, the son of Storage Wars: Miami star Kevin Pew, has been charged with first-degree murder after he allegedly shot and killed a family friend during a viewing party, the Sun Sentinel reports. More > Hashim Pew, the son of Storage Wars: Miami star Kevin Pew, has been charged with first-degree murder after he allegedly shot and killed a family friend during a viewing party, the Sun Sentinel reports. More > A Christmas Story star Peter Billingsley is engaged Peter Billingsley, who played Ralphie in the 1983 holiday classic A Christmas Story, is engaged, Us Weekly reports. More > Peter Billingsley, who played Ralphie in the 1983 holiday classic A Christmas Story, is engaged, Us Weekly reports. More > Lamar Odom is taking his first steps on the road to recovery. More > Lamar Odom is taking his first steps on the road to recovery. More > \nBy Liz Raftery, \nWe're guessing Kim 's not going to be too happy about this. \nAfter Lamar Odom 's near-death experience last week, he and estranged wife Khloe Kardashian are going to give their marriage another shot, TMZ reports. \nKardashian's lawyer asked a judge on Wednesday to throw out their divorce papers, according to the report. \nKardashian filed for divorce in December 2013, but their split was never finalized. Because the couple were still legally married, Kardashian was responsible for decisions regarding Odom's medical care during his recent hospital stint. \nOn Oct. 13, Odom was rushed to a hospital after he was found unconscious at a Nevada brothel, where he had reportedly spent $75,000 over the course of three days. Odom had allegedly consumed drugs including crack cocaine, and herbal sexual enhancements. After three days in a coma, Odom regained consciousness and was moved to Cedars-Sinai Medical Center in Los Angeles earlier this week. The incident is under investigation . \nKardashian, who had been dating NBA player James Harden, said earlier this week that she was putting their relationship on hold so that she could be by Odom's side during his recovery. \nOther Links From TVGuide.com", "external_links": [], "published": "2015-10-22T17:49:00.000+03:00", "crawled": "2015-10-22T18:31:43.745+03:00", "highlightTitle": ""}