{"organizations": [], "uuid": "f7126b8af73abac847dd3e1d8f46d70a2e9dc256", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.aceshowbiz.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Aceshowbizcom-EntertainmentNews\r", "section_title": "Aceshowbiz.com - Entertainment News", "url": "http://www.aceshowbiz.com/news/view/00090151.html", "country": "US", "title": "Louis Tomlinson and Simon Cowell 'Trying to Put a Girl Band Together'", "performance_score": 0, "site": "aceshowbiz.com", "participants_count": 1, "title_full": "Louis Tomlinson and Simon Cowell 'Trying to Put a Girl Band Together'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T01:57:00.000+03:00", "replies_count": 0, "uuid": "f7126b8af73abac847dd3e1d8f46d70a2e9dc256"}, "author": "AceShowbiz.com", "url": "http://www.aceshowbiz.com/news/view/00090151.html", "ord_in_thread": 0, "title": "Louis Tomlinson and Simon Cowell 'Trying to Put a Girl Band Together'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments Louis revealed that he and the music mogul are working 'to put a girl band together' and he is really excited about it. \nAs One Direction 's much-deserved break is coming closer, Louis Tomlinson has revealed that he is working with Simon Cowell to \"put a girl band together.\" Louis shared about the future project with the music mogul during an interview with \"X Factor\"'s YouTube channel. \"I've got a little label in print so I'm trying to work with that at the moment,\" Louis opened up. \"I'm lucky enough to be working with Simon. We've got a few different projects going on at the moment one of which is we're trying to put a girl band together.\" He went on adding, \"It's really exciting to be involved in the different side of it, the background.\" During the interview, Louis also opened up about making his return to \" The X Factor \", which jump-started his rise to fame, as a guest judge. \"It's such an honor to come back and obviously we started here so to be asked to come back is an incredible honor,\" he stated. \"I've always been such a massive 'X Factor' fan I've always watched it with the family for years, It'll be a proud moment for my mum.\" Previously, Louis revealed in an interview with Entertainment Weekly that by the time One Direction has its extended hiatus, he would be still writing songs with fellow band member Liam Payne . \"I enjoy that, with Liam. But it's all kind of up in the air at the moment,\" he said and added, \"We definitely will. I'm sure we will.\" \n© AceShowbiz.com", "external_links": [], "published": "2015-10-24T01:57:00.000+03:00", "crawled": "2015-10-24T11:08:16.709+03:00", "highlightTitle": ""}