{"organizations": [], "uuid": "c3e74602383ba58d1261d0bca84c61c416b18220", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.filmibeat.com", "main_image": "http://www.filmibeat.com/img/2015/10/05-1444048415-vijay-s-puli-before-amp.jpg", "site_section": "http://www.filmibeat.com/rss/filmibeat-tamil-fb.xml", "section_title": "Filmibeat - Tamil Entertainment", "url": "http://www.filmibeat.com/tamil/news/2015/when-expectations-killed-the-cat-did-vijay-s-puli-really-fail-to-impress-200628.html", "country": "CA", "title": "When Expectations Killed The Cat: Did Vijay's Puli Really Fail To Impress?", "performance_score": 0, "site": "filmibeat.com", "participants_count": 0, "title_full": "When Expectations Killed The Cat: Did Vijay's Puli Really Fail To Impress?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T15:46:00.000+03:00", "replies_count": 0, "uuid": "c3e74602383ba58d1261d0bca84c61c416b18220"}, "author": "", "url": "http://www.filmibeat.com/tamil/news/2015/when-expectations-killed-the-cat-did-vijay-s-puli-really-fail-to-impress-200628.html", "ord_in_thread": 0, "title": "When Expectations Killed The Cat: Did Vijay's Puli Really Fail To Impress?", "locations": ["Puli"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Receive all updates via Facebook. Just Click the Like Button Below Don't ask Again \nRajinikanth in his latest speech hailed Ilayathalapathy Vijay 's Puli for its visual brilliance and even claimed that the film is on par with Hollywood standards. No the Superstar wasn't exaggerating, for Puli is a film to be experienced just for its visuals. Puli (U): Book Your Tickets Right Away! \nWhen I sat down in a theatre (with high resolution display), I couldn't believe I was watching a Tamil movie made just over a budget of 100 crore rupees. Such was the visual quality of this film; sleek, dazzling and awe-inspiring. \nYes, the film did not live up to its pre-release hype and expectations nor did it have a scintillating screenplay. But, Puli would've been a different film altogether had it not accumulated tons of hype and hoopla prior to its release. \nIn fact, the film might've attracted serious panegyrics for its neatly executed VFX and CG works. From minute graphics like the severed hand of Prabhu to the intimidating edifices of 'Vedhala Kotai' , Puli was a visual treat right from the word go. \nNot to mention creatures like the black jaguar, the huge tortoise and the one-eyed monster. Honestly, I have not seen any other Indian movie possessing these type of fictional characters with such effectuality. \nPerhaps, less expectations from Puli would've helped us realize the film's visual brilliance. But, in this case, it can be safely said that expectations did kill the cat. \nCheck out the slides below to realize the gravity of Puli 's VFX: When Expectations Killed The Cat: Did Vijay's Puli Really Fail To Impress? 1/7 Left And Right \nThe huge palace on the left and an entire village on the right was created using only computer graphics. When Expectations Killed The Cat: Did Vijay's Puli Really Fail To Impress? 2/7 The Palace \nThe detailing of the palace that has been generated using CG and VFX works was spellbinding. When Expectations Killed The Cat: Did Vijay's Puli Really Fail To Impress? 3/7 The Detailing In Detail \nNot only this particular palace, but many such edifices were created effectively in Puli , ensuring a visual treat. When Expectations Killed The Cat: Did Vijay's Puli Really Fail To Impress? 4/7 The Inside Story \nThis picture shows how the queen's throne was created using computer graphics. These shots looked as real as it can get in the theatre. When Expectations Killed The Cat: Did Vijay's Puli Really Fail To Impress? 5/7 A Closer Look \nAs you can see, just the basement of the palace was erected by the art directed. When Expectations Killed The Cat: Did Vijay's Puli Really Fail To Impress? 6/7 More VFX \nAll these shots looked amazingly spectacular for an Indian movie, let alone a Tamil flick. Surely, Puli is a film that can be hailed only for its visual brilliance. You might like", "external_links": [], "published": "2015-10-05T15:46:00.000+03:00", "crawled": "2015-10-06T05:58:13.804+03:00", "highlightTitle": ""}