{"organizations": [], "uuid": "73ade2dc685a52d788ce544cda82d9c18e5660d6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dallasnews.com", "main_image": "http://www.dallasnews.com/lifestyles/books/20150919-fates-and-furies-cover-image.ece/BINARY/original/Fates+and+Furies+Cover+Image", "site_section": "http://www.dallasnews.com/lifestyles/books/", "section_title": "Dallas-Fort Worth Book Reviews and News - Entertainment News for Dallas Texas - GuideLive ", "url": "http://www.dallasnews.com/lifestyles/books/20150919-fiction-review-fates-and-furies-by-lauren-groff.ece", "country": "US", "title": "Fiction review: “Fates and Furies,” by Lauren Groff", "performance_score": 0, "site": "dallasnews.com", "participants_count": 1, "title_full": "Fiction review: “Fates and Furies,” by Lauren Groff | Dallas Morning News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-20T01:14:00.000+03:00", "replies_count": 0, "uuid": "73ade2dc685a52d788ce544cda82d9c18e5660d6"}, "author": "CECILY SAILER", "url": "http://www.dallasnews.com/lifestyles/books/20150919-fiction-review-fates-and-furies-by-lauren-groff.ece", "ord_in_thread": 0, "title": "Fiction review: “Fates and Furies,” by Lauren Groff", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Lauren Groff’s latest novel, Fates and Furies , is the beautiful but anguished autopsy of a marriage rendered in a ballet of sentences. It tells the story of playboy-turned-playwright Lancelot “Lotto” Satterwhite and his fierce, calculating beloved, Mathilde.\nThis monumental love excavation begins appropriately with wedding-day whoopee on the dunes of a Maine beach. “He longed for something wordless and potent: what? To wear her. He imagined living in her warmth forever. People in his life had fallen away from him one by one like dominoes; every movement pinned her further so that she could not abandon him.”\nWith this opening scene, Groff sets in motion an aching love story, one steaming with devotion and belonging but tainted by the unbridgeable gaps of togetherness. “Between his skin and hers, there was the smallest of spaces, barely enough for air. … Even still, a third person, their marriage, had slid in.”\nThis third person, the marriage itself — both joiner and divider — provides the novel’s expanse. As Lotto and Mathilde combine forces, both are transformed, enhanced and wounded by their partnership. The story’s intrigue stems as much from their solidarity as it does from what they conceal and withhold, their transgressions and missteps, what they know and don’t know about each other.\nInitially, Mathilde believes she’s matched herself to a wealthy heir, but their rushed elopement is an affront to Lotto’s mother, who holds the purse strings and quickly disowns Lotto for marrying below his perceived grandeur. Instead, Mathilde supports Lotto through his stint as a failed actor and later becomes his undetected editor, sharpening the scripts that launch his theatrical career.\nMathilde works behind the curtain, perfecting Lotto’s work, managing unruly bit players, and ultimately engineering his success. As Lotto grows legendary, Mathilde increasingly becomes the sun he orbits; she provides the light illuminating a planet others bend to worship.\nIn her distinct, lyrical prose, Groff structures the novel in two parts — “Fates” followed by “Furies” — giving Lotto (“Fates”) and Mathilde (“Furies”) his-and-hers stage time for the telling of their lives together and apart. These narrative halves depict a marriage from competing points of view, both orchestrated by a narrator that reads like the couple’s appointed guardian.\nIn “Fates,” we follow Lotto from his fateful birth in the eye of a Florida hurricane through his wild and libidinous youth. This origin story tracks alongside the early years of the couple’s marriage, filled with a string of parties that, in moments, feel rote and redundant. Lotto finally hits his artistic stride, but the marriage is tested when Lotto holes up to collaborate with a young musician. Lotto’s half of the story concludes with a revelation that leaves him devastated, convinced he’s been betrayed.\n“Furies” is the complex, compelling answer to Lotto’s tale. As Mathilde’s version of events unfolds, we discover the extent of her personal losses, what she’s hidden from Lotto and her otherwise unnoticed effort to elevate and align herself with her husband. (We discover other juicy details intentionally omitted here.)\n“Fates” functions as a slow prelude, but the novel gathers momentum as it hands the baton to Mathilde, whose perspective alters and clarifies what’s already been told, including the suspicion of her disloyalty. “Furies” elucidates Mathilde’s insatiable loneliness, both pitiable and endearing; her calculated acts of manipulation and requital are equally admirable and disturbing.\nAs the reader weaves together the divided/shared narratives, what emerges is a deep sense of longing and the assertion that love, to some extent, is always unrequited. As Groff stated in a July interview with The New Yorker , “Total intimacy is a myth; that said, a particular kind of loneliness can be both beautiful and fruitful. All this to say that I tried to put that mystery into Fates and Furies , but also the deep ambiguity and flux of marriage.”\nGroff wholly fulfills her intention, raising an unanswerable question: Is marriage an equation of addition, multiplication or something more twisty — a formula of variables within parentheses capped by exponents?\nFates and Furies, which just made the longlist for the National Book Award, is tinged with Shakespearean tragedy revived in modern America (it helps that playwright Lotto Quote: s the Bard while drunk). Ultimately, the truth arrives late, revenge is partial (if sufficient), and love is our doting slave master. Groff’s opus will leave you smarting and aggrieved, reaching for the body beside you.\nCecily Sailer is a freelance writer living in Austin and manager for creative writing and literary programs at the Austin Public Library Friends Foundation.\nPlan your life Lauren Groff will be among the 300 authors at the Texas Book Festival, Oct. 17-18 in Austin. Details at texasbookfestival.org .\nFates and Furies Lauren Groff (Riverhead Books, $27.95)", "external_links": [], "published": "2015-09-20T01:14:00.000+03:00", "crawled": "2015-10-09T20:51:37.336+03:00", "highlightTitle": ""}