{"organizations": [], "uuid": "9949060bcfedd804a66d4880fc5b0a0cb9ac6ad5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.india.com", "main_image": "http://s3.india.com/wp-content/uploads/2015/10/air-france.jpg", "site_section": "http://www.india.com/feed/", "section_title": "India | Latest India News | Get Free India.com Email | Live Cricket and Entertainment News at India.Com", "url": "http://www.india.com/news/world/air-france-turbulence-doesnt-reflect-state-of-country-643167/", "country": "US", "title": "Air France turbulence doesn’t reflect state of country", "performance_score": 0, "site": "india.com", "participants_count": 1, "title_full": "Air France turbulence doesn’t reflect state of country", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T12:22:00.000+03:00", "replies_count": 0, "uuid": "9949060bcfedd804a66d4880fc5b0a0cb9ac6ad5"}, "author": "Wires English | Press Trust of India", "url": "http://www.india.com/news/world/air-france-turbulence-doesnt-reflect-state-of-country-643167/", "ord_in_thread": 0, "title": "Air France turbulence doesn’t reflect state of country", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments Paris, Oct 19: French President Francois Hollande said today the social turbulence currently gripping Air France, which was rocked by violent protests over job cuts, was not a reflection of the state of the country. The struggling airline’s restructuring plan made headlines around the world earlier this month when executives were manhandled by furious workers, sparking concerns that the violence was just one of the symptoms of France’s overall economic and social malaise. (Read: Middle East set to become world leader in Internet devices) “Some observers always want the pot to boil over and explode. No! The conflict at Air France does not sum up the state of France,” Hollande told RTL radio. Speaking just hours before the launch of a much-watched annual gathering of unions, employers and government members, a defensive Hollande said the Air France case must not be generalised. ”We must live in a peaceful society. There are always conflictsHow do we overcome them By violence Definitely not. By appeasement, and therefore by dialogue.” On October 5, Air France announced plans to cut 2,900 jobs over 2016 and 2017 after pilots rejected a proposal to work longer hours, sparking fury among employees. Human resources manager Xavier Broseta had his shirt ripped off as he clambered over barriers to escape, helped by security guards, while another executive had his shirt and jacket torn in the scrum. Five employees at the airline — which merged with Dutch national carrier KLM in 2004 — were detained and will face trial on December 2 for their alleged role in the violence. Hollande said layoffs at the airline could still be avoided “if pilots do what is needed, if management makes proposals, if the ground personnel wakes up to certain realities.” \n  2:52 PM Topics:", "external_links": [], "published": "2015-10-19T12:22:00.000+03:00", "crawled": "2015-10-19T12:50:39.820+03:00", "highlightTitle": ""}