{"organizations": [], "uuid": "014cbdb220a398c8f61bc07a44c82c1c0dfd0a89", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.aceshowbiz.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Aceshowbizcom-EntertainmentNews", "section_title": "Aceshowbiz.com - Entertainment News", "url": "http://www.aceshowbiz.com/news/view/00090029.html", "country": "US", "title": "Adele Announces New Album '25', Calls It 'Make-Up Record'", "performance_score": 0, "site": "aceshowbiz.com", "participants_count": 1, "title_full": "Adele Announces New Album '25', Calls It 'Make-Up Record'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T15:27:00.000+03:00", "replies_count": 0, "uuid": "014cbdb220a398c8f61bc07a44c82c1c0dfd0a89"}, "author": "AceShowbiz.com", "url": "http://www.aceshowbiz.com/news/view/00090029.html", "ord_in_thread": 0, "title": "Adele Announces New Album '25', Calls It 'Make-Up Record'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments The 'Someone Like You' crooner says her next studio installment is about 'making up for everything I ever did and never did.' \nAdele finally confirms her new studio album. In a message to her Twitter followers, the 27-year-old Grammy winner announces that her upcoming CD is titled \" 25 \". The mother of one calls the follow-up to her 2001's \" 21 \" a \"make-up record.\" \"When I was 7, I wanted to be 8. When I was 8, I wanted to be 12. When I turned 12 I just wanted to be 18. Then after that I stopped wanting to be older. Now I'm ticking 16-24 boxes just to see if I can blag it! I feel like I've spent my whole life so far wishing it away,\" Adele began in her note. \"Always wishing I was older, wishing I was somewhere else, wishing I could remember and wishing I could forget too. Wishing I hadn't ruined so many good things because I was scared or bored,\" she added. \"Wishing I wasn't so matter of fact all the time. Wishing I'd gotten to know my great grandmother more, and wishing I didn't know myself so well, because it means I always know what's going to happen. Wishing I hadn't cut my hair off, wishing I was 5'7\". Wishing I'd waited and wishing I'd hurried up as well.\" The British star went on, \"My last record was a break-up record and if I had to label this one I would call it a make-up record. I'm making up with myself. Making up for lost time. Making up for everything I ever did and never did. But I haven't got time to hold onto the crumbs of my past like I used to. What's done is done.\" \"Turning 25 was a turning point for me, slap bang in the middle of my twenties. Teetering on the edge of being an old adolescent and a fully-fledged adult, I made the decision to go into becoming who I'm going to be forever without a removal van full of my old junk.\" \"I miss everything about my past, the good and the bad, but only because it won't come back. When I was in it I wanted out! So typical. I'm on about being a teenager, sitting around and chatting shit, not caring about the future because it didn't matter then like it does now. \" \"The ability to be flippant about everything and there be no consequences. Even following and breaking rules ... is better than making the rules,\" she concluded. \"25 is about getting to know who I've become without realising. And I'm so sorry it took so long, but you know, life happened.\"", "external_links": [], "published": "2015-10-21T15:27:00.000+03:00", "crawled": "2015-10-21T21:52:56.824+03:00", "highlightTitle": ""}