{"organizations": [], "uuid": "66989a90875e5e134e2406915dabb133dbc74bf4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266353/arts-entertainment-television", "section_title": "Arts &amp; Entertainment: Television - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30255872/comefuse-is-a-new-social-networking-app-with-built-in-chat", "country": "US", "title": "ComeFuse is a New Social Networking App with Built-In Chat", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "ComeFuse is a New Social Networking App with Built-In Chat - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T12:03:00.000+03:00", "replies_count": 0, "uuid": "66989a90875e5e134e2406915dabb133dbc74bf4"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30255872/comefuse-is-a-new-social-networking-app-with-built-in-chat", "ord_in_thread": 0, "title": "ComeFuse is a New Social Networking App with Built-In Chat", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A new mobile app ComeFuse helps people connect with nearby like-minded people across numerous interests. It is a one-stop shop for many social networking needs. It facilitates meeting of people in person, who share a common interest.\n(PRWEB) October 14, 2015\n\"Come-on, let’s fuse!\" - ComeFuse, a free social networking chat app, emphasizes on a real-time non-virtual social networking. ComeFuse helps people connect with other nearby like-minded people, across numerous interests within Sports, Outdoor, Hobbies, Hangouts, Community, and so on. With ComeFuse offering over 40 interest-categories, now there is no need of multiple social apps for different social needs.\nThis app is meant for a diversified population, in terms of age-range and interests. Moods vary and people look to perform different activities - say find a company for hiking or biking, meet someone for a coffee-break, or say, find some sports-company - like a tennis partner or for playing basketball. Or maybe, meet someone for a dinner, and so on. This app offers all that.\nIt is easy to navigate, elegant and yet, simple to use. Navigate to a category and express interest in an activity. That presents a list of nearby people who are interested in performing the same activity, coinciding in time. This is where a real-time feature comes in. It presents a list of people with brief information such as gender, age and their distance.\nPoke others or accept their Fuse requests to get connected via a built-in Chat mechanism. This is where the emphasis on the non-virtual aspect is - people are connected not just virtually but they actually go out and meet others at public place, and go social! It has never been so easy to get connected with nearby like-minded people, in just three easy steps.\nApp has a de-register feature that allows users to go offline and not seen by others, if one is no longer interested in a particular activity.\nComeFuse is a free app available on Apple AppStore and GooglePlay . There is no registration cost and requires no credit-card information.\nFor more information and latest updates:\nVisit us on Facebook or follow us on Twitter (@ComeFuse). Visit our website to learn more.\n //www.prweb.com/releases/2015/10/prweb13017127.htm\n ", "external_links": ["https://twitter.com/ComeFuse", "http://www.prweb.com/releases/2015/10/prweb13017127.htm", "https://itunes.apple.com/us/app/comefuse/id977842445?mt=8", "https://play.google.com/store/apps/details?id=com.ars.comefuse", "https://www.facebook.com/comefuse"], "published": "2015-10-14T12:03:00.000+03:00", "crawled": "2015-10-14T14:31:33.019+03:00", "highlightTitle": ""}