{"organizations": [], "uuid": "f1f50f2534572766a9e9ab02099895402e97643f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-5530052e/turbine/chi-default-open-graph-ct-logo/", "site_section": "http://www.chicagotribune.com/entertainment/rss2.0.xml", "section_title": "Arts &amp; Entertainment - Chicago Tribune", "url": "http://www.chicagotribune.com/entertainment/theater/ct-treasure-island-lookingglass-review-ent-1019-20151018-column.html", "country": "US", "title": "Lookingglass 'Treasure Island' goes hunting for gold", "performance_score": 0, "site": "chicagotribune.com", "participants_count": 1, "title_full": "Lookingglass 'Treasure Island' goes hunting for gold", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T23:05:00.000+03:00", "replies_count": 0, "uuid": "f1f50f2534572766a9e9ab02099895402e97643f"}, "author": "Chris Jones", "url": "http://www.chicagotribune.com/entertainment/theater/ct-treasure-island-lookingglass-review-ent-1019-20151018-column.html", "ord_in_thread": 0, "title": "Lookingglass 'Treasure Island' goes hunting for gold", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Lookingglass 'Treasure Island' goes hunting for gold Treasure Island on stage Liz Lauren \n(left to right): Andrew White, Philip R. Smith and Matt DeCaro in Treasure Island at Lookingglass Theatre. \n(left to right): Andrew White, Philip R. Smith and Matt DeCaro in Treasure Island at Lookingglass Theatre. (Liz Lauren) Chris Jones Contact Reporter Mary Zimmerman takes on Treasure Island. Any riches here? \n\"Did you read 'Treasure Island' as a child?\" the woman in the seat next to me asked her companion before the Saturday opening of writer-director Mary Zimmerman's new show at the Lookingglass Theatre. \"No,\" was the reply, \"but I live across the street from the grocery store .\" \nRim shot. I'll be here all week at the Treasure Island Hotel and Casino. Yo-ho-ho and a bottle of rum! \nThat latter phrase (along with the immortal truth \"Dead men don't bite\") did not, dear landlubbing reader, emanate from Disney's \"Pirates of the Caribbean.\" Nor, for that matter did the linguistically delicious: \"This is a handy cove, and a pleasant sittyated grog-shop. Much company, mate?\" \nBoth fine phrases — along with the equally famous \"AAARRR! Jim lad!\"— come from \"Treasure Island,\" that classic of the fine art of swashbuckling, as penned, initially in serialized form, in 1881 and 1882 by Robert Louis Stevenson, that canniest of Scots, whose only mistake was living before the Disney years, when a fleet of lawyers might have prevented his work's entry into the public domain. Then the plentiful dramatic adaptations, including this new one from Zimmerman, might have been more lucrative for his descendants. \nAside from the Las Vegas casino that has taken my money in the past, the story of mutiny on the Hispaniola has entered popular culture in all kinds of ways. I've always been partial to the infamous chicken planks at Long John Silver's. You can stay at the Admiral Benbow Inn in both Cornwall and Nashville. You can drink at the Black Dog Tavern on Martha's Vineyard. The Black Spot — death sentence for a pirate — has shown up everywhere from \"Doctor Who\" to \"30 Rock.\" \nBut if you're really logging Stevenson's biggest cultural influence, you'd have to say it's old Long John Silver himself, who pretty much established the nomenclature of the pirate — chatty feathered shoulder accessory and all. LJS really is the uber-pirate. Whether you're telling a tale of scandalous buccaneers of the high seas, or taking a pirate cruise off Fort Myers Beach, you're either impersonating him or running away from him. Treasure Island on stage \nJohn Babbo stars in Treasure Island at Lookingglass Theatre. \nJohn Babbo stars in Treasure Island at Lookingglass Theatre. (Liz Lauren) \nAARRRR! \nThis is unusually traditional territory for Zimmerman, whose adaptive career to date has mostly consisted of dramatizing works that have not previously been wrought for the theater. I've always, and still, think of that as her great strength. But titles like \"The Jungle Book\" and \"Treasure Island\" certainly offer more box-office potential and the chance for more licensed productions. Each time I see her adapt one, though, I feel nostalgia for the days when she would bring to dramatic life to the strange and unfamiliar, even though those stories from other cultures are riskier now, when accusations of cultural appropriation are common. \nZimmerman's version of \"Treasure Island\" does not contain any great surprises for those familiar with her work. The visual design for this production, from Todd Rosenthal, is in the form of a ship, not unlike the ride you can find at Six Flags — except that we're all too cool for standard pirate ship accouterments, and this vessel rocks from side to side, not back and forth. That works well for the scenes at the nautically themed Admiral Benbow Inn, certainly, and for the onboard scenes of mutiny, but it does not solve the requisite need to stage the scenes on the titular island; the arrival of a little tropical foliage doesn't cut it any more than the fluttery encapsulation of the appearance of the treasure. This is not first \"TI\" adaptation I've seen that struggles and loses momentum in the middle of Act 2; the 2009 version at Lifeline Theatre had much the same issue. Treasure Island on stage Liz Lauren \n(left to right): Matt DeCaro, John Babbo and Andrew White in Treasure Island at Lookingglass Theatre. \n(left to right): Matt DeCaro, John Babbo and Andrew White in Treasure Island at Lookingglass Theatre. (Liz Lauren) \n\"Treasure Island\" was written as a story for boys, or so said its author, plain and simple, explaining his plethora of colorful males. Some of the most interesting theatrical versions have turned that on its head: One recent British production turned Jim Hawkins into a girl and killed off the gender stereotypes, and why not? Zimmerman's more cautious version is caught between not fully embracing the Johnny Depp-like world of the piece — which is actually its world — and not wanting to deliver an unrecognizable \"Treasure Island.\" It's a thin needle to thread, and it handicaps the show. The freer Zimmerman allows herself to be, the better her work. \nHaving said all that, even when the work is far from seminal, Zimmerman remains a superior storyteller. Add the proven bona fides of the source, and the pleasures of the piece are not inconsiderable. She has a fleet of fabulous actors here — I was especially taken with Christopher Donahue's truly creepy and yet emotionally wrought Billy Bones, and when Steve Pickering shows up at the Admiral Benbow in the form of Black Dog, well, my timbers surely shivered. Anthony Irons, an ideal choice for this crew, is similarly robust as old Blind Pew, while Lawrence DiStasi manages to make LJS entertaining and honest without the cliches (and, frankly, without some of the usual fun). Most amusing, perhaps, is Philip R. Smith's Captain Smollett, the very embodiment of \"Keep calm and carry on,\" as the T-shirts now say. Smith allows himself just a note of parody, as does Andrew White, who plays the elitist Dr. Livesey. That pair has the style down. \nThe best scene of the lot, though, is the one that departs the most from the expected. It's the typically throwaway scene when Jim (John Babbo) is allowed back home to see his mother (played by Kasey Foster) before shipping out from Bristol. Zimmerman and Foster, who is both the only woman in this show and the actor who turns in the most complex performance, show us a rich picture of what it was like to be a widow in a world where your boy, and co-worker, could just be taken from you and sent into adventure for him, danger for you. \nAt one point in Act 2, Foster shows up on the Hispaniola playing a treasure-seeker, hidden behind a beard. It is as if Jim's mother found a way to keep track of her own treasure, far more valuable than any doubloon. It reveals a great truth about Zimmerman's work all these years: The farther away from the familiar she travels, the better the artistic treasure. \nAnd there's more to life than gold. \nChris Jones is a Tribune critic.", "external_links": [], "published": "2015-10-18T23:05:00.000+03:00", "crawled": "2015-10-18T23:38:59.084+03:00", "highlightTitle": ""}