{"organizations": [], "uuid": "9e630cfd3f5aaf3829574836c9611b62c263c309", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegram.com", "main_image": "http://www.telegram.com/Global/images/head/nameplate/telegram_logo.png", "site_section": "http://www.telegram.com/living/entertainment", "section_title": "Entertainment - telegram.com - Worcester, MA", "url": "http://www.telegram.com/article/20151017/NEWS/151019252/101397", "country": "US", "title": "Theater Review: Angriest of '12 Jurors' dominates Barre Players' production - News", "performance_score": 0, "site": "telegram.com", "participants_count": 1, "title_full": "Theater Review: Angriest of '12 Jurors' dominates Barre Players' production - News - telegram.com - Worcester, MA", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T03:00:00.000+03:00", "replies_count": 0, "uuid": "9e630cfd3f5aaf3829574836c9611b62c263c309"}, "author": "Paul Kolas Telegram & Gazette Reviewer", "url": "http://www.telegram.com/article/20151017/NEWS/151019252/101397", "ord_in_thread": 0, "title": "Theater Review: Angriest of '12 Jurors' dominates Barre Players' production - News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BARRE - A more apt title for Barre Players’ production of Reginald Rose’s “Twelve Angry Jurors” would be “One Extremely Angry Juror, Ten Irritated Jurors and One Skeptical Juror.” An updated adaptation of Rose’s 1954 teleplay, “Twelve Angry Men,” and the highly regarded 1957 film that followed, it’s a dramatic examination of the judicial system, and the tensions that flare up in the jury room when a unanimous vote of guilty or not guilty is needed to reach a verdict. By far the most volatile tension in director Robert Hawkins’ generally well-acted, but sometimes curiously interpreted staging, is supplied by Kristen King’s incendiary performance as Juror 3. King dominates the show with his towering presence and unchained emotion. He’s obdurately convinced that the 19-year-old boy on trial for stabbing his father to death is guilty beyond a reasonable doubt. So are 10 other jurors. The lone holdout is Juror 8 (Matt Lee), a mild-mannered architect who has his doubts, and spends the entire duration of the play trying to convince his fellow jurors that the so called “facts” of the evidence just don’t add up, and therefore cause for reasonable doubt. The cast of 12 are merely numbers with varied personalities. Juror 4 (Dave Piperno) is allied with Juror 3, but handles himself in a more civil, officious manner, claiming that the reason he feels the boy’s alibi is shaky – he was at a movie with his friends – is because he can’t remember the name of the movie. Most everyone wants to rush things along because they have better things to do. Juror 12 (Chelsey Patriss) is an ad agent who’s worried she’ll lose her job because of jury duty. Juror 9 (Nancy Anderson) is a compassionate teacher who is swayed by Juror 8 to change her vote to not guilty. That’s the only spoiler you’re going to get, but it’s hardly a big reveal in the eventual outcome. As Juror 8 indefatigably makes a strong case for reasonable doubt, second thoughts emerge, recede and re-emerge among the jurors. Some jurors are more open-minded than others. Juror 5 (Cindy Graber) knows what it’s like to grow up in a slum and empathizes with the boy’s rough upbringing. Juror 11 (Ben Gawlik) is a thoughtful immigrant who questions the logic of the boy running from the scene of the crime before wiping his fingerprints, then returning three hours later to remove the knife from his father’s chest. The youngest of the group, Juror 2 (Mary LePage), observantly questions how the boy, who is 5 feet 8 inches tall, could inflict a downward stab with a knife on his 6-foot-2-inch father. When a demonstration proves the possibility, Juror 5 shows everyone the proper way to hold a switchblade in a slum knife fight, and that a shorter person would thrust upward into a taller victim. Juror 6 (Sandy Crompton) has doubts about an elderly witness’s testimony that he heard a body fall to the floor, and ran to the door of his apartment in 15 seconds to see the boy running from his building. The man is a stroke victim and can’t possibly have made it to his door in 15 seconds. Even when Juror 8 demonstrates in the jury room that it would have taken him 42 seconds to make it to his door, Juror 3 remains vehemently unconvinced. Gum-chewing Juror 7 (Hannah Hall) is the most seemingly frivolous of the jury, more bored than truly invested in deciding the fate of a young boy’s life, and anxious to just get it over with. And even though we don’t know the ethnicity of the boy, Juror 10 (Emily Grandone) erupts into a disturbingly bigoted tirade about how everyone in the slums can’t be trusted, how “they” are all violent animals. It’s so full of hateful invective that it makes everyone disgustedly walk away from her. It’s King who reigns over this jury room with a performance of bludgeoning conviction, screaming “he’s got to burn!” When Juror 8 accuses him of being a sadist, more interested in fulfilling personal desire than rationally examining the facts, the two nearly come to blows averted by several others pulling No. 3 away from No. 8. Lee is quite good as No. 8, persuasively offering his arguments to reconsider a knee-jerk, let’s-get-it-over-with verdict. Colleen Kelley Norton quietly enacts the peacekeeping, role of Juror 1, diplomatically trying to forge unanimity with her fellow jurors. Other standouts in the capable ensemble include Gawlik’s Juror 11, portrayed with a nicely intoned Eastern European accent; Grandone’s eye-rolling bigoted Juror 10, although she needs to work on steadying her Southern accent; and Hall’s insouciant Juror 7. What comes into question is Hawkins’ sometimes seemingly arbitrary directorial and blocking choices, as when Juror 10 (Grandone) wanders off into the stage left bathroom (why is there a bathroom to begin with?) and takes a swig out of a bottle. Also worth argument is having a juror occasionally step forth from the others to deliver a private, spotlight-illuminated conversation with the audience. It’s a surreal touch that only serves to momentarily dispel the realistic tone of the play. On the whole, though, the verdict is not guilty.", "external_links": [], "published": "2015-10-17T03:00:00.000+03:00", "crawled": "2015-10-18T02:52:05.010+03:00", "highlightTitle": ""}