{"organizations": [], "uuid": "7699cb67e0ca6c43963544918b1d160b75b9542f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://images.canberratimes.com.au/2015/10/21/6947929/Thumbnail1001740000gkemv4image.related.thumbnail.320x214.gkerj4.png1445407874220.jpg.jpg", "site_section": "http://feeds.canberratimes.com.au/rssheadlines/entertainment.xml#", "section_title": "Canberra Times Entertainment Headlines", "url": "http://www.canberratimes.com.au/entertainment/tv-and-radio/seven-network-unveils-its-show-highlights-for-2016-with-less-reality-tv-and-more-local-drama-20151021-gkerj4.html", "country": "AU", "title": "Seven Network unveils its show highlights for 2016, with less reality TV and more local drama", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "Seven Network unveils its show highlights for 2016, with less reality TV and more local drama", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T09:04:00.000+03:00", "replies_count": 0, "uuid": "7699cb67e0ca6c43963544918b1d160b75b9542f"}, "author": "Michael Lallo", "url": "http://www.canberratimes.com.au/entertainment/tv-and-radio/seven-network-unveils-its-show-highlights-for-2016-with-less-reality-tv-and-more-local-drama-20151021-gkerj4.html", "ord_in_thread": 0, "title": "Seven Network unveils its show highlights for 2016, with less reality TV and more local drama", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Jessica Mauboy has her first major TV role in The Secret Daughter , written especially for her. Photo: Daniel Munoz \nThe Seven network will screen more local drama than ever next year, live stream all its channels, and allow viewers to watch every session of every sport of the Rio Olympics. \nIn unveiling Seven's plans for 2016 on Wednesday, CEO Tim Worner acknowledged that traditional television audiences continued to decline. But he said the broadcaster \"has changed more in the last 18 months than in the last 18 years\" - and promised further evolution.  \nRelief is in sight for viewers feeling overwhelmed by wall-to-wall reality shows. While the top-rating My Kitchen Rules will return - as will its successful spin-off House Rules - each will air for one season only. Last year Seven announced two full seasons of  House Rules would air in 2015 but later opted to broadcast only one. More recently, the network's much hyped new reality program  Restaurant Revolution fell flat and was quietly burned off in inglorious timeslots.  \nChannel Seven unveils its 2016 programs and sporting highlights. Photo: Michael Lallo \nNine has already hinted at an end to running big-budget reality shows head-to-head with Seven's chiefly to spoil them. Often, both networks ended up battered and bruised. \nAdvertisement Brad Lyons, Seven's director of network production, believes the truce is a good idea. Reality programs are still an essential component of commercial channels, he said, but viewers are hungry for local stories. \nThe network will screen 308 hours of fresh Australian drama next year, a record high. \nSamuel Johnson will play Molly Meldrum in a new mini-series. Photo: Freedom Stories \nIts trans-Tasman hit 800 Words , starring Packed to the Rafters patriarch Erik Thomson, is currently the most-watched program in the country. \n\"It firmly dispels the myth that no one watches drama on TV,\" Lyons said, before announcing a slate of new dramas including:\nWanted : A mini-series starring Seven's favourite daughter, Rebecca Gibney. There's no trace of Julie Rafter, though. Gibney plays a fugitive, on the run with a stranger, Chelsea (Geraldine Hakewill) after they intervened in a car-jacking. It also stars Home and Away 's Stephen Peacocke, Holding the Man 's Ryan Corr and Newstopia's Nicholas Bell. \nRebecca Gibney will play a fugitive in Wanted . \nThe Secret Daughter : In her first major TV role, award-winning singer, songwriter and actor Jessica Mauboy plays a part-time country pub singer whose chance meeting with a wealthy hotelier changes her life. Written especially for Mauboy, the series begins production next year. \nMolly : Seven struck gold with mini-series inspired by INXS, Ivan Milat and Peter Allen. Now comes a two-parter about music guru Ian \"Molly\" Meldrum, chronicling the celebrities, lavish parties, international trips and behind-the-scenes politicking required to bring Countdown to air. Samuel Johnson plays Meldrum; with Tom O'Sullivan, TJ Power, Aaron Glenane, Rebecca Breeds and Krew Boylan, who played Schapelle Corby in Nine's telemovie. \nDirector of programming, Angus Ross, suggested more Australian dramas, to be screened next year, may be announced later. He confirmed local hits including Home and Away , Winners & Losers and 800 Words are returning. \nWith subscription video-on-demand services such Netflix, Stan* and Presto using quality drama to lure viewers, Worner emphasised the importance of scripted Australian programs. \n\"We are a content company,\" he said. \"We pride ourselves on the telling of Australian stories.\"\nWhen it comes to new reality and game shows, none involve cooking, renovating or singing. \nKiss Bang Love : The provocatively-titled program, from the creators of Married at First Sight , hinges on a simple claim. Kissing, we're told, is a \"perfect tool\" to find a partner. So why not skip the dating and get a bunch of strangers to kiss each other? The show features 10 Aussies who pash 15 partners, helping them decide who to take on a romantic weekend getaway. (Lyons assured an intrigued group of journalists that the second word in the show's title does not refer to what the couples do during their weekends away. Rather, it describes the \"champagne corks popping\" feeling they get when falling in love.)\nThe Day the Cash Came : Two families get a briefcase full of cash. They can spend it as they wish - but they will be monitored. Based on a UK format, it tests the theory that people should be trusted to make their own decisions about how they're helped financially, and whether a large sum of cash is the most effective solution.\nSunday Night Takeaway : A family variety show involving stunts, surprises and shocks. Based on a UK show hosted by the popular Ant and Dec, a hook is that that one audience member can play to win all the products in the ad break, including cars and holidays. \n﻿ Among the other shows returning next year are The X Factor and Dancing with the Stars ; and international dramas Criminal Minds , The Blacklist and Downton Abbey. \nWorner said new research shows Australians are watching more TV than ever before - but they're watching it differently. A survey called \"Share of Eye\", commissioned by Seven and its partners, showed Australians view an average of four hours of video (television and online) each day. Around 85 per cent of this is traditional television; for the 14-24 age group its 61 per cent. \nViewers simply expect to watch what they want, when they want, Worner said. \nOn Melbourne Cup Day this year, Seven will make all its channels - Seven, 7Two and 7Mate - available for streaming online and through the 7Plus app. Ratings provider OzTam will measure the audiences on each platform. \nIf viewers opt to give the network basic information about themselves, they will be shown targeted advertisements during the ad breaks.\nSeven Sport's Hamish McLachlan said next year's Rio Olympic would be \"the first unavoidable Olympics\". A special app will give viewers the scores, and more than 200 medals will be broadcast live in Australian daylight hours. All 28 sports can be viewed on demand by purchasing a subscription, though prices were not released. \nAustralian wheelchair tennis player Dylan Alcott said that 140 hours of the Paralympic Games would be broadcast on Seven. In previous years, viewers had to watch whichever Olympic event happened to be on television at that moment. \nBut Seven's recent overhaul of its tennis coverage has informed its approach to everything else, explained chief revenue officer Kurt Burnette.\nViewers often complained about two things in particular, he said: Seven not showing the match they wanted, or showing too many Australian matches. In response, the network streamed every moment of every match on every court, giving fans control.\n\"There were no more complaints after that,\" Burnette said. \nmlallo@fairfaxmedia.com.au \n* Stan is part-owned by Fairfax Media, owner of this masthead.", "external_links": [], "published": "2015-10-21T09:04:00.000+03:00", "crawled": "2015-10-21T17:26:53.248+03:00", "highlightTitle": ""}