{"organizations": ["Killarney Hotel"], "uuid": "e60054a12a0c26a41449bedc9fc2477f2079a556", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ipswichadvertiser.com.au", "main_image": "http://media.apnarm.net.au/img/media/images/2015/10/20/WDN_21-10-2015_WEATHER_PAGE_01_WAR201015Gibney_ct300x300.jpg", "site_section": "http://feeds2.feedburner.com/IpswichadvertisercomauTv", "section_title": "ipswichadvertiser.com.au: entertainment tv stories", "url": "http://www.ipswichadvertiser.com.au/news/a-star-at-the-bar/2813714/", "country": "AU", "title": "Killarney Hotel to be a big star on the small screen", "performance_score": 0, "site": "ipswichadvertiser.com.au", "participants_count": 0, "title_full": "Killarney Hotel to be a big star on the small screen", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T17:00:00.000+03:00", "replies_count": 0, "uuid": "e60054a12a0c26a41449bedc9fc2477f2079a556"}, "author": "", "url": "http://www.ipswichadvertiser.com.au/news/a-star-at-the-bar/2813714/", "ord_in_thread": 0, "title": "Killarney Hotel to be a big star on the small screen", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Gold Logie", "Jayden Brown", "Kathy McGregor", "Rebecca Gibney"], "text": "Killarney Hotel to be a big star on the small screen Jayden Brown | 21st Oct 2015 5:00 AM Jayden Brown STARSTRUCK: Kathy McGregor met Gold Logie winner Rebecca Gibney on the set of Wanted at the Killarney Hotel yesterday. Contributed Local Real Estate Cars For Sale \nKILLARNEY Hotel will be thrust into television screens across the country next year, making an appearance in the Channel 7 drama Wanted. \nThe country town's pub will keep its name in the television series, with Gold Logie winner Rebecca Gibney shooting scenes at the bar yesterday. \nWillow St has been transformed into a busy film set this week as shooting for Wanted enters its second week. \nThe usually quiet CWA Hall has been turned into a police station, with busy film crews taking over Canning Park for several days. \nThe police sign at the front of the CWA Hall had tongues wagging about a possible appearance from Home and Away heartthrob Steve Peacocke. \nWhile Peacocke, who will play a police officer in Channel 7 series didn't appear - Gibney stole fans' hearts once again. \nThe queen of Australian television greeted starstruck locals on set at the Killarney Hotel. \nPublican Jan Moir said she was thrilled to be hosting the film crew in her pub. \n\"It was very good - they worked hard all day and there were a lot of locals involved in it,\" she said. \n\"I think it's lovely that they're going to keep the pub's name as Killarney Hotel in the show.\" \nFilming will continue in Killarney and Spring Creek today, with eager fans keeping watch for any sign of Peacocke. \nThe Australian actor is still rumoured to make an appearance before filming wraps next week. \nHave you been lucky enough to star in the television series? \nDid you meet the actors?", "external_links": [], "published": "2015-10-20T17:00:00.000+03:00", "crawled": "2015-10-25T17:03:27.536+02:00", "highlightTitle": ""}