{"organizations": [], "uuid": "faab3c7cf5edd9b09b842ad68995d20c4d1a28ab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailyherald.com", "main_image": "http://www.dailyherald.com/storyimage/DA/20151026/entlife/151029573/AR/0/AR-151029573.jpg&amp;updated=201510231746&amp;imageversion=Facebook&amp;exactH=630&amp;exactW=1200&amp;exactfit=crop&amp;noborder", "site_section": "http://www.dailyherald.com/rss/feed/?feed=entlife", "section_title": "DailyHerald.com &gt; Life &amp; Entertainment", "url": "http://www.dailyherald.com/article/20151026/entlife/151029573/", "country": "US", "title": "Detectives pursue a charming serial killer in ABC's 'Wicked City'", "performance_score": 0, "site": "dailyherald.com", "participants_count": 1, "title_full": "Detectives pursue a charming serial killer in ABC's 'Wicked City'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T13:15:00.000+02:00", "replies_count": 0, "uuid": "faab3c7cf5edd9b09b842ad68995d20c4d1a28ab"}, "author": "Jay Bobbin Zap2it", "url": "http://www.dailyherald.com/article/20151026/entlife/151029573/", "ord_in_thread": 0, "title": "Detectives pursue a charming serial killer in ABC's 'Wicked City'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "You can tell just from its title that \"Wicked City\" isn't going to paint early-1980s Los Angeles in a particularly pretty way.\nPremiering at 9 p.m. Tuesday, Oct. 27, the ABC melodrama has a moody look and tone befitting the series' theme. As two homicide detectives (played by Jeremy Sisto and Gabriel Luna) pursue a serial killer (\"Gossip Girl\" veteran Ed Westwick) and his new cohort (Erika Christensen) along the Sunset Strip, journalists (Evan Ross and Taissa Farmiga) and others become involved in the chase.\nrelated advertisement \"Wicked City\"\nPremieres at 9 p.m. Tuesday, Oct. 27, on ABC The actual Sunset Strip is a major filming location for \"Wicked City,\" and creator and executive producer Steven Baigelman reports that more than 30 years later, \"There's a lot of the strip that does look the same, actually. We have to be very, very careful about how we shoot things, and we have great visual effects working for us, so we are able to really re-create the era pretty much down to the way it was.\n\"I think you are going to find that when you watch the show, you are not going to watch it from a place of nostalgia,\" Baigelman adds. \"You are actually going to feel like you are there,\" in an era the producer cites as a time when L.A. was \"the murder capital of the country and also the serial-killer capital of the country.\"\nIn having a pivotal role in \"Wicked City,\" a huge departure from her recent \"Parenthood\" role, Christensen notes she's grateful to have \"found a good variety\" of parts. \"What really struck me about (playing) Ms. Betty Beaumont,\" the actress reflects, \"is how quickly she might change from the outset to the end of the pilot. Right away, you get the sense that she's all in for whatever this is with Kent (played by Westwick). I'm betting she goes down the rabbit hole with him, and I find that really interesting from where she starts ... a nurse and single mom, kind of a cowed person, not super-confident, not super-comfortable in her own skin. And she may blossom.\"\nA relative of Westwick has been \"a great resource\" for his \"Wicked City\" work, he reveals: \"My mother is a psychologist, so I was able to have some quite interesting conversations with her. I think there is an individual here who is living multiple personalities. It's one of the ways we see him manipulate so easily, and so well, the people that he interacts with.\n\"I did research into the serial killers that we all know. Ted Bundy, his charm was notorious. For me, that kind of resonates when thinking about how Kent would be, so there was all of that that came into my thinking and my process. And as the story develops and as I learn more as the scripts come in, I will be informed more, and that journey will continue for me.\"\nMusic also has a big role (and \"a very healthy budget,\" Baigelman confirms) in \"Wicked City,\" to the extent that such talents as Joe Walsh, Ratt's Stephen Pearcy and the All-American Rejects' Tyson Ritter have guest spots.\n\"I have two older brothers,\" Westwick says, \"so they kind of grew up in that era, although not in Los Angeles (but) in the U.K. I feel like we were flooded with images of Los Angeles and the music of that time and everything like that. It didn't work out for me being a rock star; I would have liked to have done that, but I'll watch it on TV instead.\"\nGet great articles like this sent to your inbox! Click here to sign up for the Entertainment Newsletter No Thanks Life & Entertainment Television Entertainment", "external_links": ["https://twitter.com/share"], "published": "2015-10-26T13:15:00.000+02:00", "crawled": "2015-10-26T21:07:23.168+02:00", "highlightTitle": ""}