{"organizations": [], "uuid": "1cc33582b61fc940596246b2893bdb03583bf3f1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.aceshowbiz.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Aceshowbizcom-EntertainmentNews", "section_title": "Aceshowbiz.com - Entertainment News", "url": "http://www.aceshowbiz.com/news/view/00089753.html", "country": "US", "title": "Showrunner Reacts to 'Homeland Is Racist' Graffiti Snuck into Latest Episode", "performance_score": 0, "site": "aceshowbiz.com", "participants_count": 1, "title_full": "Showrunner Reacts to 'Homeland Is Racist' Graffiti Snuck into Latest Episode", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T16:08:00.000+03:00", "replies_count": 0, "uuid": "1cc33582b61fc940596246b2893bdb03583bf3f1"}, "author": "AceShowbiz.com", "url": "http://www.aceshowbiz.com/news/view/00089753.html", "ord_in_thread": 0, "title": "Showrunner Reacts to 'Homeland Is Racist' Graffiti Snuck into Latest Episode", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments Alex Gansa admires the 'act of artistic sabotage' by three graffiti artists who slipped numerous criticisms directed at the Showtime series in the Sunday episode. \n\" Homeland \" showrunner Alex Gansa responds to the graffiti criticizing the show in the latest episode. \"We wish we'd caught these images before they made it to air. However, as Homeland always strives to be subversive in its own right and a stimulus for conversation, we can't help but admire this act of artistic sabotage,\" he told Deadline. One Arabic writing on the wall read, \"Homeland is racist.\" Another said, \"Homeland is a joke and it didn't make us laugh.\" There was also a \"Homeland is watermelon\" note, which means that the show shouldn't be trusted. \"Homeland is NOT a series\" was also seen scrawled on the wall during the episode airing Sunday, October 10. Those criticisms were snuck into the Claire Danes -starring show by three graffiti artists, Heba Amin, Caram Kapp, and Stone. They were hired this summer by \"Homeland\" production company to \"lend graffiti authenticity to a film set of a Syrian refugee camp on the Lebanese/Syrian border for their new season.\" Angered by the show's \"highly biased\" portrayals of Arab world as well as its \"gross misrepresentations of the cities of Beirut, Islamabad and the so-called Muslim world in general,\" the artists decided to fire back. \"It was our moment to make our point by subverting the message using the show itself,\" they explained in a statement . The trio was ordered to write apolitical messages but, due to the approaching deadline, the set designers were \"too frantic to pay any attention\" to them. \"The content of what was written on the walls, was of no concern. In their eyes, Arabic script is merely a supplementary visual that completes the horror-fantasy of the Middle East,\" they said. \n© AceShowbiz.com", "external_links": [], "published": "2015-10-15T16:08:00.000+03:00", "crawled": "2015-10-15T21:46:49.432+03:00", "highlightTitle": ""}