{"organizations": ["News Corp Australia Network Anne Hathaway", "News Corp Australia Network"], "uuid": "ffb2db6e09f05adc2c51a77eb73deee5a2e35120", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.couriermail.com.au", "main_image": "http://cdn.newsapi.com.au/image/v1/e90856fe5ca16a31b9912bb5a4eeb830", "site_section": "http://feeds.news.com.au/public/rss/2.0/bcm_entertainment_news_256.xml", "section_title": "The Courier Mail | Entertainment News", "url": "http://www.couriermail.com.au/entertainment/movies/anne-hathaway-and-robert-de-niros-chemistry-save-the-intern/story-fnihm796-1227550879320?from=public_rss", "country": "IL", "title": "Hathaway’s latest turns out wafer-thin", "performance_score": 0, "site": "couriermail.com.au", "participants_count": 0, "title_full": "Hathaway’s latest turns out wafer-thin", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T06:56:00.000+03:00", "replies_count": 0, "uuid": "ffb2db6e09f05adc2c51a77eb73deee5a2e35120"}, "author": "", "url": "http://www.couriermail.com.au/entertainment/movies/anne-hathaway-and-robert-de-niros-chemistry-save-the-intern/story-fnihm796-1227550879320?from=public_rss", "ord_in_thread": 0, "title": "Hathaway’s latest turns out wafer-thin", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Robert De Niro", "Hathaway", "Anne Hathaway"], "text": "Anne Hathaway and Robert De Niro’s chemistry save The Intern Leigh Paatsch National film critic News Corp Australia Network Anne Hathaway and Robert De Niro’s chemistry save The Intern Leigh Paatsch National film critic News Corp Australia Network Film Trailer: 'The Intern' 2:18 \nWatch the film trailer for \"The Intern,\" starring Robert De Niro, Anne Hathaway and Rene Russo. Photo: Warner Bros. September 18th 2015 \nDirector: Nancy Meyers (It’s Complicated) \nStarring: Anne Hathaway, Robert De Niro, Rene Russo, JoJo Kushner. \nRating: 2.5/5 \nAnne and Bob complete job, but situation remains vacant Other Stories 0 comments \nHey, world! Old folks have employment prospects too! \nEspecially if they’re lucky enough to land a post-retirement gig as silver-haired sensei to the CEO of a booming internet startup. \nThat is pretty much it for insightful takeaways from The Intern , a sugar-sweet, wafer-thin comedy hoping to inspire many hugs across the generation gap. \nDUMMY SPIT: De Niro terminates interview \nOn first impressions, the perfumed premise powering The Intern gives off a faint whiff of potential. That soon leaves the room without a trace. \nIt is only the comfortable chemistry of leads Anne Hathaway and Robert De Niro that prevents a less pleasant fragrance from entering the cinema. \nHathaway plays Jules, the brilliant, but scatty head of a boutique fashion sales website that has gone from zero to gazillions in turnover in a matter of months. Middle of the road ... Rene Russo and Robert De Niro in The Intern. \nThe script spends a lot of energy building up Jules as a lovably eccentric, perpetually distracted tycoonette. (Largely via hitting us with regular reminders of her love of riding her bike around the office.) \nWhich kind of explains why she doesn’t immediately notice her every move is being ghosted by a nice, squinty-smiley old man. \nHis name is Ben Whittaker (De Niro). He is 70 years of age, and the newest employee of Jules’ company. \nA can-do-can’t-stay-still-for-long kinda guy, Ben has been stair-lifted into Jules Inc. by a worthy scheme that turns senior citizens into junior work-experience interns. \nIn his original career, Ben was a big-shot in the phone-book business. Now he’s the obliging, unpaid slave of a nice, but nutty lass less than half his age. Wafer thin ... Anne Hathaway and Robert De Niro’s comfortable chemistry save The Intern. \nThe rest of the movie appears to have written itself. Ben’s old-school acumen wows his newbie superiors, and wins over his age-ist hipster colleagues. \nMeanwhile, his boss is having a few marital problems at home. Wouldn’t you just know it? Ben was married once. This wise old widower knows just what it takes to mend poor Jules’ flaky, breaky heart. \nThis is one of those middle-of-the-road affairs that is neither good nor bad. Can get quite funny once in a while. Can also take you to the brink of completely nodding off twice in a while. \nThis movie will make a lot of people ever-so-slightly happy. And just as many people a teeny bit nauseous. \nWriter-director Nancy Meyers has been down this road many times before. The success she has enjoyed with the likes of It’s Complicated and Something’s Gotta Give suggests there’s an audience always prepared to follow her.", "external_links": [], "published": "2015-10-08T06:56:00.000+03:00", "crawled": "2015-10-08T08:16:11.205+03:00", "highlightTitle": ""}