{"organizations": [], "uuid": "fabea3e97c928803e3ecf142091a4cfa7a273c7c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.palmbeachpost.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/10/12/3f/86/wigners-visiting-alcatraz.jpg", "site_section": "http://www.pbpulse.com/feeds/categories/entertainment/", "section_title": "News | Entertainment", "url": "http://www.palmbeachpost.com/news/news/national/alcatraz-special-georgia-men-say-they-have-proof-e/nnznx/", "country": "US", "title": "In Alcatraz special, Georgia men say they have proof escapees survived", "performance_score": 0, "site": "palmbeachpost.com", "participants_count": 0, "title_full": "In Alcatraz special, Georgia men say they have proof escapees survived", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T11:24:00.000+03:00", "replies_count": 0, "uuid": "fabea3e97c928803e3ecf142091a4cfa7a273c7c"}, "author": "", "url": "http://www.palmbeachpost.com/news/news/national/alcatraz-special-georgia-men-say-they-have-proof-e/nnznx/", "ord_in_thread": 0, "title": "In Alcatraz special, Georgia men say they have proof escapees survived", "locations": ["Alcatraz", "Georgia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "In Alcatraz special, Georgia men say they have proof escapees survived 4:24 a.m. Monday, Oct. 12, 2015 | Filed in: Nation & World Comments 0 ﻿ \nOfficials theorize the trio died in the waters. But many believe John Anglin, his brother Clarence Anglin and Frank Morris survived. David S. Holloway / A&E Ken and David Widner during the filming of the History Channel program \"Alcatraz: Search for the Truth\" at Alcatraz Prison in San Francisco on June 23, 2015. \n>> RELATED: History Channel could help solve infamous Alcatraz escape \nOn a History Channel special airing Monday called “Alcatraz: Search for the Truth,” the Georgia nephews of the Anglin brothers, Ken and David Widner, reveal what they think is definitive proof that their uncles made it to shore and escaped FBI and U.S. Marshal detection for years. \nDuring the special, the nephews shared photographic and audio evidence they have collected from family members with retired U.S. Marshal Art Roderick, former lead investigator on the Alcatraz case. The U.S. Marshals have never closed the case and would capture the brothers if they were still alive. (They’d be in their 80s in 2015.) \n>> Read more trending stories \n“David and I have been exposed to this story all our lives,” said Ken, a 54-year-old Flowery Branch resident who works at Georgia Pacific, in an interview earlier this month. “We’d hear about it every time we visited our grandmother’s home in Florida at family reunions.” \n“We had visits from the FBI on a regular basis growing up,” said David, 51, a quality control contractor who lives in Leesburg. “It was hard for us. We had to explain to our friends why the FBI was at our house. Our family didn’t trust them or the U.S. Marshals.” \nDavid said he has been infatuated with his uncles’ escape since he was 11. “I always told my mom [Marie Anglin Widner], “I’d love to figure out what happened.’ ” \n“I’m doing this for her,” David added. “She wants to know what happened.” \nThe Anglin brothers robbed a bank in 1958 with a toy gun. “They weren’t murderers,” David noted. But they escaped other prisons, which ultimately landed them in Alcatraz, mixing with infamous criminals such as Al Capone and Whitey Bulger. \nKen said their uncles were painted as “dumb farm hicks” in the 1979 Clint Eastwood film “Escape From Alcatraz,” that the third escapee Frank Morris was the smart one. But he believes his uncles were the “masterminds,” not Morris. \nThe Anglins took up painting so they would have flesh-colored paint for dummy heads they left behind in their cells. Clarence took a job in the barber shop and used the hair. They conjured a plan to make it to shore that didn’t involve swimming. \nFor the special, the nephews visited Alcatraz, which is now a popular tourist attraction where the story of their uncles is told to thousands of visitors every day. “The government makes millions of dollars off what our uncles did,” David said. \nDavid watched the recent New York prison escape closely. Those two prisoners “used some of the same elements” to escape as the Anglin brothers, he noted, before one was killed and another was captured several weeks later. \nHe doubts his uncles could have escaped detection as easily if this had happened in 2015 given the tools the FBI have at their disposal now. But in 1962, “the government just weren’t clever enough. They were always a step behind” the Anglins. \nDavid believes the key behind their success as fugitives, presuming they survived, was never directly contacting the family via phone or letters. Instead, they used messengers and intermediaries. \nTV PREVIEW", "external_links": [], "published": "2015-10-12T11:24:00.000+03:00", "crawled": "2015-10-12T11:48:22.474+03:00", "highlightTitle": ""}