{"organizations": [], "uuid": "6faa574c21e880bc93f1e9cb09e06c179af6c088", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.torontosun.com", "main_image": "http://storage.torontosun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297758607136_LARGE_BOX.jpg?quality=80&stmp=1444436054553&size=100x", "site_section": "http://www.torontosun.com/entertainment/rss.xml", "section_title": "Top Entertainment stories", "url": "http://www.torontosun.com/2015/10/09/ellen-degeneres-addresses-kim-kardashian-diva-rumours", "country": "CA", "title": "Ellen Degeneres addresses Kim Kardashian diva rumours", "performance_score": 0, "site": "torontosun.com", "participants_count": 0, "title_full": "Ellen Degeneres addresses Kim Kardashian diva rumours", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T23:37:00.000+03:00", "replies_count": 0, "uuid": "6faa574c21e880bc93f1e9cb09e06c179af6c088"}, "author": "", "url": "http://www.torontosun.com/2015/10/09/ellen-degeneres-addresses-kim-kardashian-diva-rumours", "ord_in_thread": 0, "title": "Ellen Degeneres addresses Kim Kardashian diva rumours", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Easton", "Kim Kardashian", "Ellen Degeneres"], "text": "Kim Kardashian on baby name: 'I do like Easton' \nEllen Degeneres has spoken out in defence of Kim Kardashian amid rumours the reality TV star was difficult and demanding during a recent TV appearance. \nKim was a guest on Ellen's U.S. chat show last week, and subsequent reports suggested the Keeping Up With The Kardashians star had proved to be a handful on-set. \nShe was rumoured to have shown up late, requested three dressing rooms for an entourage of 20, and made a series of outrageous demands. \nHowever, the gossip has riled host Ellen, who has now spoken out to defend Kim, insisting the bubbly brunette was a dream guest who was incredibly well-behaved. \n\"There are rumours floating around that (Kim) was very difficult while she was here, and that is flat out not true,\" Ellen says on her TV show. \"Kim was not over the top, and if you look at her book, Kim doesn't wear tops. Hardly ever... Guest from hell? That's Betty White... \n\"Truly, she (Kim) could not be nicer. She was lovely. She was nothing but gracious and sweet while she was here. Thank you, Kim.\" \nDuring her appearance on The Ellen DeGeneres Show, Kim opened up about her husband Kanye West and the rapper's planned presidential run in 2020, which he announced during the MTV Video Music Awards in August. \n\"I did not (know about his announcement). That was news to me,\" she revealed. \"That was not a discussion in our household... He is serious and I believe he is serious and I know that if he puts his mind to something he will do his best... I don't know if that was planned and I just didn't know about it or if he came up with that idea right then and there (at the awards show)... It's a big thing not to talk to your wife about, but I think it would be so much fun to be in the White House.\" Sponsored Links", "external_links": [], "published": "2015-10-09T23:37:00.000+03:00", "crawled": "2015-10-10T04:07:26.398+03:00", "highlightTitle": ""}