{"organizations": [], "uuid": "8ba06b35b3b9a44da98e2c65bebf29a6f21de6f0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.newindianexpress.com", "main_image": "http://www.newindianexpress.com/skins/eb/gfx/group-logo.jpg", "site_section": "http://www.newindianexpress.com/entertainment/telugu/?widgetName=rssfeed&widgetId=276210&getXmlFeed=true", "section_title": "The New Indian Express - Telugu - http://www.newindianexpress.com/entertainment/telugu/", "url": "http://www.newindianexpress.com/entertainment/telugu/Tollywoods-Queen-Conquers-New-Territory/2015/10/24/article3092439.ece", "country": "IN", "title": "Tollywood's Queen Conquers New Territory", "performance_score": 0, "site": "newindianexpress.com", "participants_count": 0, "title_full": "Tollywood's Queen Conquers New Territory", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T19:30:00.000+03:00", "replies_count": 0, "uuid": "8ba06b35b3b9a44da98e2c65bebf29a6f21de6f0"}, "author": "", "url": "http://www.newindianexpress.com/entertainment/telugu/Tollywoods-Queen-Conquers-New-Territory/2015/10/24/article3092439.ece", "ord_in_thread": 0, "title": "Tollywood's Queen Conquers New Territory", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Email 3 \nThe woman who broke the shackles and created a space for actresses in the male-dominated world of Telugu cinema, Anushka Shetty is back with yet another woman-centric film Rudhramadevi. \nAnushka Shetty in Rudhramadevi The film, which released two weeks ago, is India’s first stereoscopic 3D historical film, based on the Kakatiya dynasty in the 13th century. It has opened to packed cinema halls across the country and grossed Rs 32 crore in its opening weekend worldwide. \nAnushka, who also featured in 2006 blockbuster Arundhati and more recently in SS Rajamouli’s magnum opus Baahubali, says it’s unfair to draw parallels between these films. “Arundhati was a period fiction and Baahubali a folklore, while Rudhramadevi is a historical film. We studied the story of Rudhramadevi in our history books and there are a number of emotions that she went through during the Kakatiya rule. Director Gunasekhar has tried to bring all those emotions on to the screen,” she says. \nOne of the major draws for the movie is that it was shot entirely in 3D, a format the audience is not used to while watching regional films. Anushka says exciting as it was to shoot in 3D, it was an immense challenge for them. “Even a slight change in alignment needs to be done carefully. Changing lens takes at least 45 minutes, which is hard. We had to be careful even while delivering dialogues and did it keeping 3D in mind,” says the actress, who was a yoga instructor in Bengaluru before joining films in 2005. \nBaahubali Rudhramadevi’s release was marred by constant delays due to financial crunch. The film was initially supposed to release in September 2014, but was postponed multiple times, much to the chagrin of the distributors and fans. Playing down the delay, Anushka, who made her Tollywood debut opposite Nagarjuna in Super, says, “It was visual graphics that took a lot of time. Visual effects mean business in crores and you can never predict what might happen. \nA lot of time went in research. Kakatiya rulers belonged to Telangana but there was no information available. Then to bring everything to the canvas, we spent months in discussions. It was only after we went through everything in detail that we proceeded to the sets,” she clarifies. \nThe actress is seen romancing the tall and bulky Rana Daggubati and says they hit it off almost instantly. “I have known Rana since the time I joined the industry. On screen, we are a refreshing pair. Rana generally is bulky, but in this film he plays a romantic character,” she says. \nAnushka has emerged as the reigning queen of Tollywood and has become a symbol for women-centric roles. Humble as ever, the actress says she had a bit of luck to get to where she is. “I always got good opportunities. Arundhati, Baahubali and Rudhramadevi came to me not only because of talent but also because I am lucky,” she quips. \nA major highlight of the film has been Allu Arjun, who has received widespread appreciation for his role as Gona Ganna Reddy. Heaping praise on her co-star, Anushka says, “The character required a screen presence, where crowds chant his name even when he’s not around. I came to know that Bunny (Arjun) will be doing it. We thought he was best suited for the role. He is an actor who appreciates good cinema and encourages new ideas. He came forward for the role in Vedam (2010) and now again in Rudhramadevi.” \nHaving completed a decade, Anushka admits to have missed out on a few films. “I missed out on Vishwaroopam 1 opposite Kamal Haasan as well as Seethamma Vaakitlo Sirimalle Chettu opposite Venkatesh. I liked it a lot but couldn’t do it. Anjali did a great job, however,” she adds. \nAnushka now gears up for the release of Tamil-Telugu film Size Zero opposite Tamil star Arya. Directed by Prakash Kovelamudi, the film revolves around the issue of weight loss.", "external_links": [], "published": "2015-10-24T19:30:00.000+03:00", "crawled": "2015-10-24T20:59:14.974+03:00", "highlightTitle": ""}