{"organizations": [], "uuid": "daa3b5a22340058c0259662d8190e730387f80cc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.examiner.com", "main_image": "http://cdn2-b.examiner.com/sites/default/files/styles/image_content_width/hash/28/71/287104952e39c6380347f9782e1ddd35.jpg?itok=i6NSm2eX", "site_section": "http://www.examiner.com/arts-and-entertainment", "section_title": "Arts &amp; Entertainment | Examiner.com", "url": "http://www.examiner.com/article/the-foods-of-october-offer-something-for-everyone", "country": "US", "title": "The foods of October offer something for everyone", "performance_score": 0, "site": "examiner.com", "participants_count": 1, "title_full": "The foods of October offer something for everyone | Examiner.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T12:49:00.000+03:00", "replies_count": 0, "uuid": "daa3b5a22340058c0259662d8190e730387f80cc"}, "author": "Sandy Wallace", "url": "http://www.examiner.com/article/the-foods-of-october-offer-something-for-everyone", "ord_in_thread": 0, "title": "The foods of October offer something for everyone", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The month of October presents many food delights, including Apple Crisp for National Apple Month Country Crock Spread View all 11 photos The month of October is filled with special foods. According to Apples4theteacher.com , October is National Chili Month, Apple Month, National Caramel Month, Pizza Month, Sausage Month and Vegetarian Month, just to name a few. October is also National Pasta Month and National Cookie Month.\nSandy Wallace There are lots of special food days near the end of October too, including World Pasta Day on Oct. 25, National Chocolate Day on Oct. 28, National Candy Corn Day on Oct. 30 and National Caramel Apple Day on Halloween.\nMake your favorite tried and true recipes or create something new with the recipes below. From Fresh & Light Chicken-Veggie Chili and Apple Crisp to four unique pasta dishes from Ronzoni Pasta, enjoy the delicious flavors of October.\nAccording to 2014 Google Trends, chili and apple pie recipes were among the top 10 recipes searched in October. And, it looks like the trend continues in 2015, as Google Trend data indicates these two same recipes top Google searches during the first week in October.\nEnjoy a bowl of chili and a delish apple dessert during October. Fresh & Light Chicken-Veggie Chili and Apple Crisp are easy to make with a little help from Country Crock Spread .\nFresh & Light Chicken-Veggie Chili\nIngredients\n5 Tbsp. Country Crock Spread, divided\n2 corn tortillas, cut into small wedges\n12 ounces boneless, skinless chicken breasts, cut into small chunks\n1 1/4 cups fresh corn kernels\n1 small red bell pepper, chopped (1 cup)\n1/2 cup chopped onion\n1 1/2 lbs. plum tomatoes, chopped (about 3 1/2 cups)\n2 tsp. chili powder\n1/2 tsp. salt\n1/2 cup chopped fresh cilantro leaves\nDirections\nMelt 1 tablespoon Country Crock Spread in large nonstick skillet over medium-high heat. Add tortillas and cook, stirring frequently, until lightly browned and crisp, about 4 minutes; remove and set aside.\nMelt 1 tablespoon Spread in same skillet over medium-high heat and cook chicken, stirring frequently, until thoroughly cooked, about 3 minutes; remove and set aside. Melt remaining 2 tablespoons Spread in same skillet over medium-high heat and cook corn, red pepper and onion, stirring occasionally, until crisp-tender, about 4 minutes.\nStir in tomatoes, 1/2 cup water, chili powder and salt and bring to a boil over high heat. Reduce heat and cook covered until tomatoes cook down and vegetables are tender, about 5 minutes. Stir in chicken and cilantro; top servings with tortilla wedges.\nTip: For a vegetarian chili to enjoy during National Vegetarian Month, omit the chicken and stir in a drained 15 to 16-oz. can black beans instead.\nApple Crisp\n2 Tbsp. whole wheat flour\n2 Tbsp. quick-cooking oats\n2 Tbsp. firmly packed brown sugar\n2 Tbsp. Country Crock Spread\n4 medium Granny Smith apple, cored, peeled and sliced\n1/2 tsp. ground cinnamon\nDirections\nPreheat oven to 350 F. Grease 1-1/2-quart baking dish; set aside.\nCombine flour, oats and brown sugar in medium bowl. Cut in Country Crock Spread with pastry blender or two knives until mixture is size of small peas; set aside.\nCombine apples with cinnamon in large bowl. Arrange fruit mixture in prepared baking dish, then evenly sprinkle with crumb topping. Bake 40 minutes or until fruit is tender and topping is golden.\nTip: For individual serving size bake in 8 ramekins.\nNational Pasta Month\nCelebrate National Pasta Month and the 100th anniversary of Ronzoni Pasta during October with four unique recipes that were crowd sourced on the Ronzoni Pasta Facebook page and created by four notable New York area chefs.\nDiners can experience each one-of-a-kind meal at the respective chef's New York area restaurant or make them at home. Best of all, whether you try these meals at the restaurant or “like” or share the recipes on Facebook , Ronzoni will donate funds to one of four chef-selected nonprofits.\nSmoked Salmon Lasagna\nChef Chris Jaeckle of All'onda in Manhattan created Smoked Salmon Lasagna, with donations to Food and Finance High School.\nCook Time: 1 hour 45 minutes\nMakes 12 servings\nIngredients:\n4 lbs sunchokes\n4 quarts water\n1 lemon\n5 Tbsp salt\n1 cup of butter\n1 cup of mascarpone\n5 large (11 oz.) green zucchini\n1/4 cup of extra virgin olive oil\n1 package (16 oz.) RONZONI Lasagna, uncooked\n1/2 fillet of smoked salmon\n6 Tbsp Parmigiano cheese, grated\n1/2 cup parsley, chopped\nDirections:\nPeel the sunchokes and store them in water, along with the juice from one lemon. Add the sunchokes, water and 4 Tbsp of salt to a pot and bring to a simmer, cooking until the sunchokes are tender (approximately 20 minutes).\nIn a food processor, add the sunchokes while still hot to the butter, mascarpone and remaining salt, pulsing until the mixture is chunky smooth. Slice the zucchini lengthwise into ¼ inch thick slices and toss with olive oil. Cook pasta according to package directions. Rinse pasta with cool water.\nGrease a baking pan with butter and place one (1) layer of pasta in the pan, spreading the sunchoke puree over the noodles. Layer the smoked salmon over the noodles, being sure not to overlap. Layer the Parmigiano cheese, parsley and zucchini and repeat the process at least three (3) times. Bake at 350 F for 45 minutes. Remove from oven, plate dish and garnish with parsley.\nStaten Island Mac & Cheese\nChef Biagio Settepani of Pasticceria Bruno in Staten Island created Staten Island Mac & Cheese, with donations to March of Dimes.\nCook Time: 25 minutes\nMakes 6 Servings\nBéchamel Sauce:\n4 Tbsp butter\n1/2 cup Spanish onions, diced\n4 Tbsp flour\n1 qt. whole milk\n4 oz. fontina cheese, shredded\n4 oz. mozzarella, shredded\nOther Ingredients:\n2 Tbsp olive oil\n4 oz. imported prosciutto, diced\n6 oz. Roma tomatoes, diced\n6 oz. portobello mushrooms, pre-cooked & sliced\n1 package (16 oz.) RONZONI Rotini pasta, uncooked\n2 Tbsp truffle oil\n6 Tbsp panko bread crumbs\nDirections:\nBéchamel Sauce: In a large pot over medium heat, melt butter; add onions. Cook 3-4 minutes or until clear and tender; add flour and whisk well to prevent any lumps. Whisk in the milk, a little at a time. Let milk moisture come to a simmer and continue to stir for 5 minutes. Slowly add fontina and mozzarella cheeses in three stages; stirring constantly. Set aside.\nIn separate saucepan over medium heat, add olive oil. Add diced prosciutto, cook for 1 minute; add diced tomato and portobello mushrooms. Cook over medium heat 3-5 minutes. Add prosciutto, mushrooms, tomato mixture into béchamel sauce, mix well.\nMeanwhile, cook pasta according to package directions. Drain and add to béchamel sauce. Mix well, pour into 6 round buttered ramekins, sprinkle each with truffle oil and panko bread crumbs. Optional, may add more shredded fontina cheese. Place ramekins into preheated 350oF oven, cook 20-25 minutes. Take out of oven and serve.\nRigatoni with Pancetta and Porcinis\nChef Samantha Diaz and the Pirolo family of The Saint Austere in Brooklyn created Rigatoni with Pancetta and Porcinis, with donations to Part of the Solution (POTS).\nCook Time: 30 minutes\nMakes 4 Servings\nIngredients:\n5 Tbsp salt\n3 Tbsp olive oil\n6 medium sized porcini mushrooms, sliced\n3 sprigs of thyme\n2 Tbsp pepperoncino (red pepper flakes)\n2 cups butternut squash, diced\n1 package (16 oz.) RONZONI Rigatoni, uncooked\n8 oz. good quality smoked pancetta\n1 large shallot, sliced\n2 cups flat leaf parsley, chopped\n1 cup Parmigiano Reggiano, grated\nDirections:\nPut a large pot of water on the stove and add 4 Tbsp of salt. Bring water to a boil. In a large sauce pan, heat 1 Tbsp olive oil on medium heat and sauté the porcini mushrooms with 1 ½ sprigs of thyme, a pinch of salt, and a pinch of pepperoncino until cooked; set aside.\nIn another large sauce pan, heat 1 Tbsp olive oil on medium heat and sauté the diced squash with 1 ½ sprigs of thyme, a pinch of salt, and a pinch of pepperoncino until cooked and reserve. Place the RONZONI Rigatoni in the large pot of boiling water.\nIn a large sauté pan, heat 1 Tbsp of olive oil and add the pancetta to the pan. When the pancetta is almost crispy, add the sliced shallots and continue to stir until they caramelize lightly. After the shallots have caramelized, take ¼ cup of the water from the pasta pot and add to the pan. Take the pan with the shallots and pancetta off the heat and add mushrooms and squash.\nWhen the RONZONI Rigatoni are 3/4 of the way cooked, drain and add them to the sauce with another ¼ cup of the pasta cooking water. Place the pan back on the heat and continue to cook the pasta in the pan until al dente, adding water if it starts to become too dry. Once the pasta is cooked, take the pan off the heat add in the parsley, Parmigiano Reggiano, and the remainder of the pepperoncino. Distribute evenly between four deep bowls.\nGemelli E Gamberi\nChef Gianna Cerbone of Manducatis Rustica in Long Island City created Gemelli E Gamberi, with donations to Long Island City YMCA.\nCook time: 30 Minutes\nMakes 8 servings\nIngredients:\n3 Tbsp extra virgin olive oil\n6 cloves garlic, sliced\n6 leaves fresh basil, whole\n1 lb Madagascar Shrimp (butterflied)\n2 cups heirloom tomatoes, diced\n1/2 cup dry white wine (optional)\n3/4 tsp red pepper flakes\n3/4 tsp salt\n1/2 tsp oregano\n1 package (16 oz.) RONZONI Gemelli pasta (uncooked)\n1 Tbsp fresh parsley, chopped\nDirections:\nIn a large saucepan on medium heat, heat oil; add garlic and basil. Cook 5 minutes or until browned. Add butterflied Madagascar shrimp. Cook until firm and pink. Stir in tomatoes, white wine, red pepper flakes, salt and oregano and bring to a boil. Reduce heat. Simmer uncovered until thoroughly cooked. Meanwhile, cook pasta according to package directions. Stir pasta into the sauce and sprinkle with fresh parsley.\nNational Cookie Month and National Chocolate Day\nEnjoy delicious chocolatey and all-natural cookies during National Cookie Month and celebrate National Chocolate Day on October 28. Dessert enthusiasts can enjoy ready-to-eat treats with Lucy's gluten free foods and allergy friendly snacks and cookies.\nTry Lucy's rich Chocolate Chocolate Chunk Cookie, the perfect quick chocolate fix. As with all Lucy's snacks and cookies, they are made without milk, eggs, peanuts or tree nuts.\nYou'll also love Lucy's newest decadent treat, Triple Chocolate Brownie Crisp, which features a delicious mix of 72 percent dark chocolate chunks, chocolate chips, cocoa and organic Madagascar vanilla for a rich chocolate flavor. Triple Chocolate Brownie Crisps are light and crispy with only 100 calories for three crisps.\nNational Caramel Month\nGet your favorite caramels just in time for National Caramel Month at Annie B's . Each individually wrapped caramel is made using local ingredients like brown sugar, water, corn starch, butter, corn syrup, sweetened condensed milk, inverted sugar and natural flavor.\nEnjoy these yummy goodies straight from the box or pair with your favorite fall recipes like caramel apples, pear crisp or apple pie. Try fall flavor with pumpkin spice, maple or apple or savor the original caramel flavor. Annie B's Caramel Apple Kits make it easy to create caramel apples in your own kitchen to enjoy on National Caramel Apple Day too.\nYou'll find lots more delicious recipes to enjoy during October in the articles below, including Halloween recipes, apple recipes, chocolate recipes, pizza recipes and pumpkin recipes. Let the flavors of October fill your home with the scents of autumn.", "external_links": ["http://www.allondanyc.com/", "https://www.ronzoni.com/", "http://www.manducatisrustica.com/", "http://www.thesaintaustere.com/", "http://www.anniebscandy.com/", "http://www.drlucys.com/", "http://www.countrycrock.com/", "http://www.apples4theteacher.com/holidays/october-2015.html", "http://pasticceriabruno.com/", "https://www.facebook.com/ronzoni.pasta?_rdr=p"], "published": "2015-10-22T12:49:00.000+03:00", "crawled": "2015-10-22T14:37:29.955+03:00", "highlightTitle": ""}