{"organizations": [], "uuid": "07863054ec6d5bef8c0091ae1a260d4107b6faa8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266347/arts-entertainment-general", "section_title": "Arts &amp; Entertainment: General - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30258933/bullseye-announces-super-bowl-2016-travel-package-at-the-buchanan-hotel-in-san-francisco", "country": "US", "title": "Bullseye Announces Super Bowl 2016 Travel Package at The Buchanan Hotel in San Francisco", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Bullseye Announces Super Bowl 2016 Travel Package at The Buchanan Hotel in San Francisco - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T19:02:00.000+03:00", "replies_count": 0, "uuid": "07863054ec6d5bef8c0091ae1a260d4107b6faa8"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30258933/bullseye-announces-super-bowl-2016-travel-package-at-the-buchanan-hotel-in-san-francisco", "ord_in_thread": 0, "title": "Bullseye Announces Super Bowl 2016 Travel Package at The Buchanan Hotel in San Francisco", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bullseye Event Group is proud to announce its Super Bowl 2016 Package at The Buchanan Hotel, a Kimpton Hotel, in San Francisco.\nIndianapolis, INdiana (PRWEB) October 14, 2015\nBullseye Event Group is proud to announce its Super Bowl 2016 Package at The Buchanan Hotel, a Kimpton Hotel, in San Francisco.\nKimpton Hotels have earned an incredible reputation for passion, bold and playful design, award-winning dining and incredible amenities. Boasting 58 boutique hotels in the US, with Kimpton Hotels you have the ultimate boutique hotel stay and a top choice for Super Bowl Weekend.\nThe Buchanan is ideally situated in one of the most exciting pulse-points in the entire city of San Francisco. You’ll find The Buchanan where three dynamic neighborhoods – Japantown, the Fillmore District and Lower Pacific Heights – all converge in one intoxicating travel trifecta. Boutiques. Michelin-starred restaurants. Indie cinemas. Live jazz joints where the legends played. The Buchanan, your haute haven here, oozes personality with touches like chandeliers rendered from vintage whiskey bottles and private spaces, including the intimate patio.\nSan Francisco is a foodie’s best friend, and The Buchanan’s neighborhood is where the authentic flavors and ingredients of Asia mix with contemporary California culinary sizzle to create a tasty experience you’ll never forget. And a neighborhood favorite – Mum’s Restaurant + Bar – is located inside the Buchanan San Francisco.\nThe Buchanan Hotel Package Includes:\nDeluxe accommodations at The Buchanan hotel for three (3) nights: Friday, February 5 – Sunday February 7, 2016. Upper Level End Zone to Corner Ticket to Super Bowl 50, February 7th 2016 (ticket upgrades available). Admission into The Players Super Bowl Tailgate pre-game party with 20+ current /active NFL players in attendance. Pre-game Super Bowl Tailgate party held Sunday, 11:00am – 4:00pm, with open premium bar and a 5-star food menu prepared by Guy Fiere. The Super Bowl Players Tailgate is located outside of the stadium, within walking distance to the game. Super Bowl gift bag. Private motor coach round trip game day transportation to Levi Stadium. Don’t wait until it’s too late to book this travel experience. Call Bullseye Event Group today at 317-800-3280 for pricing and insider information about The Buchanan Hotel.\nAbout Bullseye Event Group\nBullseye Event Group is the Official Events and Travel Partner of the Indianapolis Colts. As a secure, official source for travel, hotel, pre-game parties and tickets, Bullseye Event Group is a direct and dependable source for The Colts VIP Tailgate, Super Bowl XLIX packages, The Players Super Bowl Tailgate, the Masters and event tickets, delivering unforgettable experiences to fans. To learn more, visit BullseyeEventGroup.com\n //www.prweb.com/releases/2015/09/prweb12934695.htm\n ", "external_links": ["http://www.prweb.com/releases/2015/09/prweb12934695.htm"], "published": "2015-10-14T19:02:00.000+03:00", "crawled": "2015-10-14T20:38:41.634+03:00", "highlightTitle": ""}