{"organizations": [], "uuid": "ee83bb28ce1f883404a3476c22bfac9e9342bd12", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wlox.com", "main_image": "", "site_section": "http://www.wlox.com/Global/category.asp?C=13540&nav=DYFw&clienttype=rss", "section_title": "WLOX - Entertainment - Headline", "url": "http://www.wlox.com/story/30332136/analysis-clinton-turns-benghazi-hearing-into-plus-for-bid", "country": "US", "title": "Analysis: Clinton turns Benghazi hearing into plus for bid", "performance_score": 0, "site": "wlox.com", "participants_count": 0, "title_full": "Analysis: Clinton turns Benghazi hearing into plus for bid", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T11:25:00.000+03:00", "replies_count": 0, "uuid": "ee83bb28ce1f883404a3476c22bfac9e9342bd12"}, "author": "", "url": "http://www.wlox.com/story/30332136/analysis-clinton-turns-benghazi-hearing-into-plus-for-bid", "ord_in_thread": 0, "title": "Analysis: Clinton turns Benghazi hearing into plus for bid", "locations": ["Benghazi"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Clinton", "LISA", "KEN THOMAS"], "text": "Analysis: Clinton turns Benghazi hearing into plus for bid - WLOX.com - The News for South Mississippi Member Center: Analysis: Clinton turns Benghazi hearing into plus for bid By KEN THOMAS and LISA LERERAssociated Press \nWASHINGTON (AP) - Hillary Rodham Clinton turned an 11-hour congressional grilling into a campaign call to action on foreign policy, using a make-or-break appearance before the Republican-led Benghazi committee to display a commanding, presidential presence under a barrage of questions. \nFor months, Clinton's campaign had circled Thursday's hearing on the calendar as a key hurdle for a candidate who has struggled to fend off a flood of criticism over her use of a private email system as secretary of state. Instead, amid questioning that often bordered on a courtroom-style interrogation, Clinton avoided any major gaffes, and sought to portray herself above the partisan fray as committee members bickered. At points, she dipped into her campaign arguments, declaring that the U.S. must promote American exceptionalism around the globe. \n\"Retreat from the world is not an option. America cannot shrink from our responsibility to lead,\" said Clinton, seated before the House panel investigating the September 2012 attack at the diplomatic outpost in Benghazi, Libya, in which four people were killed, including Ambassador Chris Stevens. \nYet the hearing likely did nothing to change the minds of Republicans or other voters who already distrusted and disliked Clinton. But there were some early signs that it may have helped Clinton solidify support within her party, with some donors and activists who were backing other primary candidates pledging their support for Clinton after the hearing. \nClinton's hearing came at an important juncture in her campaign, a day after Vice President Joe Biden announced he would not challenge her for the party's nomination and a week after a solid performance during the first Democratic debate. \nWith those obstacles behind her, Clinton turns her focus back to the campaign, addressing Democratic women on Friday and then holding a rally with Virginia Gov. Terry McAuliffe, her longtime friend and 2008 campaign chairman. She gets a big stage in Iowa Saturday, where more than 6,000 activists are gathering for an annual Jefferson-Jackson dinner that will feature the four major Democratic candidates. \nThe upcoming events have a celebratory feel, packed with appearances by celebrity backers and longtime allies. Former President Bill Clinton will make a rare appearance on the campaign trail, attending a kickoff concert in Des Moines on Saturday with pop star Katy Perry. On Sunday, Hillary Clinton will attend a fundraising bash in New York with comedian Amy Schumer and singers John Legend and Demi Lovato to mark her 68th birthday Monday. \nDuring Thursday's hearing, Clinton watched with a bemused smile as the committee's Republican chairman and top Democratic member heatedly argued about making public the panel's earlier private hearings. She repeatedly urged the lawmakers to honor the memories of the four Americans killed in the attacks. \n\"I will continue to speak out and do everything I can from whatever position I'm in to honor the memory of those we lost,\" Clinton said. \nRepublicans touched on a wide range of issues, from the U.S. role in Libya and how the Obama administration initially portrayed the attacks, to the dozens of emails Clinton received from longtime political confidant Sidney Blumenthal. \nBut the hearing surfaced little new information and landed no blows to Clinton's presidential aspirations, leaving Republicans without a memorable moment to promote as Clinton approaches the first primary contests. \n\"There's no one simple takeaway,\" said Rep. Mike Pompeo, R-Kansas, one of members of the panel. \"I want the American people to know the truth about all the actions. Not just hers. We're going to conduct many more interviews.\" \nIn the moments after the hearing concluded, chairman Trey Gowdy struggled to explain what the committee - and the American public - learned from the marathon hearing. \n\"In terms of her testimony, I don't know that she testified that much differently than she has the previous times that she's testified,\" he told reporters gathered in the Capitol. \nRep. Jim Jordan, R-Ohio, revived questions about the administration's shifting accounts of what happened at the diplomatic outpost in Benghazi and nearby CIA compound, arguing that the White House was eager to avoid political damage from a terror attack less than two months before President Barack Obama faced re-election. \n\"I'm sorry it doesn't fit your narrative, congressman,\" Clinton said in response. \"I can only tell you what the facts are.\" \nClinton's daylong testimony was unlikely to end Republicans' quest to use the heavily scrutinized Benghazi attack to question her judgment and leadership. Revelations that Clinton relied on personal email and a private Internet server during her tenure at the State Department have only heightened the GOP's interest in determining whether more information exists about the attack that killed Stevens and three other Americans. \nClinton's competent performance was also unlikely to drastically affect her standing in the Democratic race, where she faces a challenge from Vermont Sen. Bernie Sanders. Nearly half of Democrats and a majority of independents said they don't have strong feelings about the Benghazi investigation, according to a new AP-GfK poll. \nClinton's team saw the hearing as an opportunity to present herself as a seasoned diplomat and harken back to her days in the State Department, when her popularity soared and she won accolades from some of the Republicans now running against her in the White House contest. \nWhile the Clinton campaign stopped short of explicit fundraising tied to her congressional appearance, it mounted an aggressive effort - through email, Twitter and Facebook - to promote her remarks and undercut her GOP adversaries. \nThroughout her testimony, Clinton was slipped notes from longtime aide Cheryl Mills, prompting Rep. Peter Roskam, R-Ill., to say he could pause his questioning so she could read the messages. \nAppearing to find Roskam's offer condescending, Clinton replied coolly, \"I can do more than one thing at a time.\" Copyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-10-23T11:25:00.000+03:00", "crawled": "2015-10-23T11:54:09.561+03:00", "highlightTitle": ""}