{"organizations": [], "uuid": "b24b5628faccebe3d463a060b222d045050288de", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.timesunion.com", "main_image": "http://ww1.hdnux.com/photos/41/55/11/8835696/3/rawImage.jpg", "site_section": "http://timesunion.com//home/collectionRss/Homepage-HCat-Entertainment-Living-6985.php", "section_title": "Entertainment and Living Stories", "url": "http://www.timesunion.com/entertainment/article/Review-Broadway-s-Dames-at-Sea-all-at-sea-6585399.php", "country": "US", "title": "Review: Broadway's 'Dames at Sea' all at sea — in the past", "performance_score": 0, "site": "timesunion.com", "participants_count": 1, "title_full": "Review: Broadway's 'Dames at Sea' all at sea — in the past - Times Union", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T23:05:00.000+03:00", "replies_count": 0, "uuid": "b24b5628faccebe3d463a060b222d045050288de"}, "author": "timesunion.com", "url": "http://www.timesunion.com/entertainment/article/Review-Broadway-s-Dames-at-Sea-all-at-sea-6585399.php", "ord_in_thread": 0, "title": "Review: Broadway's 'Dames at Sea' all at sea — in the past", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photo: Jeremy Daniel, AP Image 1 of / 3   3 In this image released by Polk & Co., Lesli Margherita appears during a performance of \"Dames at Sea,\" at the Helen Hays Theatre in New York. (Jeremy Daniel/Polk & Co. via AP) In this image released by Polk & Co., Lesli Margherita appears during a performance of \"Dames at Sea,\" at the Helen Hays Theatre in New York. (Jeremy Daniel/Polk & Co. via AP) Photo: Jeremy Daniel, AP Image 2 of 3 In this image released by Polk & Co., John Bolton, from left, Cary Tedder, Eloise Kropp, Mara Davi and Danny Gardner appear during a performance of \"Dames at Sea,\" at the Helen Hays Theatre in New York. (Jeremy Daniel/Polk & Co. via AP) In this image released by Polk & Co., John Bolton, from left, Cary Tedder, Eloise Kropp, Mara Davi and Danny Gardner appear during a performance of \"Dames at Sea,\" at the Helen Hays Theatre in New York. (Jeremy ... more Image 3 of 3 In this image released by Polk & Co., John Bolton, left, and Mara Davi appear during a performance of \"Dames at Sea,\" at the Helen Hays Theatre in New York. (Jeremy Daniel/Polk & Co. via AP) In this image released by Polk & Co., John Bolton, left, and Mara Davi appear during a performance of \"Dames at Sea,\" at the Helen Hays Theatre in New York. (Jeremy Daniel/Polk & Co. via AP) Photo: Jeremy Daniel, AP Review: Broadway's 'Dames at Sea' all at sea — in the past 1  /  3 Back to Gallery NEW YORK (AP) — It's taken almost half a century for \"Dames at Sea\" to come to Broadway. There really was no rush.\nThis insubstantial musical, which sits awkwardly between celebration and parody, opened Thursday at the Helen Hays Theatre like a riff off a long-forgotten joke. And its bad identity crisis lets down one of the most hard-working casts in the business.\n\"Dames at Sea\" is supposed to be a fizzy celebration of Busby Berkeley films and Cole Porter musicals, but comes across more like a warmed-over, sweaty cabaret act. It's not funny enough to be satire and yet too earnest to be believed. It's the 1960s laughing at the 1930s, but in this century, it comes off as hopelessly hidebound.\nThe music by Jim Wise is so light and derivative that it leaves no mark on the brain or heart, just bubbles fleeing the Champagne flute. At one point, it references Porter, which is unfortunate since it sounds even smaller and weaker by comparison.\nThe story and lyrics by George Haimsohn and Robin Miller are a pastiche of well-worn musical ideas, but not put together in a new or interesting way, as they were in \"Nice Work If You Can Get It.\"\nThere's a wide-eyed ingénue just off the bus hoping for stardom, plenty of dancing sailors, an older star stealing away a younger woman's love interest, an understudy going on in place of the star, a scramble for a new venue after the theater is bulldozed, a dance with twirling umbrellas and even a group wedding at the end. If there's a point to just rehashing these old ideas, it's lost.\nThe show is weighed down by references to old stars like Sarah Bernhardt , Jack Benny and Dolores del Río that may have been relevant in 1966, but will leave most people excluded. It's got vague sex jokes — a lyric reads, \"I was lost and sunk/until she winked and begged me/to inspect her junk\" — that never seem to land.\nWorst, the thing about clichés is that they can come back and embarrass you, something even the ravishing Broadway revival of \"Anything Goes\" had to recently confront with its atrocious Asian stereotypes.\n\"Dames at Sea\" blithely and pointlessly resurrects those same terrible clichés in the song \"Singapore Sue\" and later turns one character into a sexy-mad \"Consuelo\" with a heavy Latin accent and a \"gypsy heart.\" It's uncomfortable to watch. It's 2015.\nIf the original off-off-Broadway production in 1966 helped make a star of Bernadette Peters , this one should cement the reputation of Lesli Margherita , who almost steals the show as the aging diva. She's needy, her lips quiver, she's relentless and she's awesome.\nBut Eloise Kropp , as the fresh-off-the-bus Ruby, and Mara Davi , as the veteran Joan, are ferociously talented tappers and singers. Danny Gardner and Cary Tedder, as the male love interests, are first-rate. John Bolton delivers another exceptional comic master class in the dual roles of The Captain and Hennesey.\nRandy Skinner directs and choreographs very tidily, keeping the hijinks bright, the hoofing electric and the \"Golly gee willickers\" delivered at a rosy, Technicolor level. The nice sets by Anna Louizos and snazzy costumes by David C. Woolard capture the sexy optimism of a past era. But while everyone is sweating up a storm, the purpose is unclear. The dames are all at sea.\nSent out an S.O.S.\n___\nOnline: http://damesatseabroadway.com", "external_links": [], "published": "2015-10-22T23:05:00.000+03:00", "crawled": "2015-10-23T04:33:46.299+03:00", "highlightTitle": ""}