{"organizations": [], "uuid": "d62f61095aa86c1b5fc50bf402b663520380d12b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.crainsnewyork.com", "main_image": "http://www.crainsnewyork.com/apps/pbcsi.dll/storyimage/CN/20151001/MEDIA_ENTERTAINMENT/151009994/AR/0/Ellen-Pollock.jpg?maxw=800&imageversion=widescreen&q=70&cci_ts=20151001113128", "site_section": "http://feeds.crainsnewyork.com/crainsnewyork/media", "section_title": "Media & Entertainment - Crain's New York Business News Feed", "url": "http://www.crainsnewyork.com/article/20151001/MEDIA_ENTERTAINMENT/151009994", "country": "US", "title": "Bloomberg Businessweek gets its first woman editor", "performance_score": 0, "site": "crainsnewyork.com", "participants_count": 1, "title_full": "Bloomberg Businessweek gets its first woman editor", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T17:33:00.000+03:00", "replies_count": 0, "uuid": "d62f61095aa86c1b5fc50bf402b663520380d12b"}, "author": "Matthew Flamm", "url": "http://www.crainsnewyork.com/article/20151001/MEDIA_ENTERTAINMENT/151009994", "ord_in_thread": 0, "title": "Bloomberg Businessweek gets its first woman editor", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photo: Courtesy of BloombergBusinessweek Ellen Pollock became the first woman editor of BloombergBusinessweek. \nBloomberg Businessweek , the print crown jewel in the Bloomberg Media portfolio, has appointed its first woman editor since the magazine's founding in 1929. \nEllen Pollock, who joined the magazine two years prior to its 2009 purchase by the financial information giant, will take the helm immediately. She succeeds Josh Tyrangiel, a Crain's 40 Under 40 honoree, who has been widely credited with revivifying the magazine with an irreverent tone and in-depth business coverage. He is leaving the company. \nBloomberg Editor-in-Chief John Micklethwait announced the change Thursday morning. Ms. Pollock, who spent 18 years at The Wall Street Journal and is the author of two books, was most recently deputy editor of the magazine. \nThe shake-up is one of many that have taken place at the global business news operation since founder and former Mayor Michael Bloomberg returned to run the company. Those changes have included bringing in John Mickelthwait, former editor of The Economist , as editor-in-chief, to replace Matthew Winkler , who had held that role since the news division's founding. That led to a reshuffling of other roles and questions about the direction of the media operations under Bloomberg Media CEO Justin Smith and Mr. Tyrangiel. \nMr. Bloomberg reportedly wanted more focus on the kind of core business news coverage that would better serve the company's customers—the more than 300,000 subscribers who pay more than $20,000 a year for access to its terminals. \nAs part of a restructuring in March , Mr. Tyrangiel became chief content officer for all of editorial, in addition to his role as editor of Businessweek . (He had been senior executive editor for consumer products.) A spokeswoman said Thursday that the company would not immediately fill the chief content officer role. \n\"Tomorrow will be my last day at Bloomberg,\" Mr. Tyrangiel wrote in a farewell email Thursday morning. \"I’ve spent six years working with some of the smartest and most creative people in journalism, and it's time for me to take my chips off the table, reflect on my criminal good luck, and think about what comes next.\" \nHe praised Ms. Pollock as \"an inspiration—and the best editor I've ever worked with.\" \n\"Right from the beginning,\" Mr. Mickelthwait wrote in a memo Thursday morning, \"Josh told me that he was a restless soul and that at some time in the next year or so he would move on. I am sad that it will be tomorrow, but we should all be extremely grateful for all that he has done for Bloomberg, across all our platforms.\"", "external_links": [], "published": "2015-10-01T17:33:00.000+03:00", "crawled": "2015-10-02T11:16:23.681+03:00", "highlightTitle": ""}