{"organizations": [], "uuid": "65ff5797613ec9e5d102cda0a60142406076af6f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.india.com", "main_image": "http://s3.india.com/wp-content/uploads/2015/10/Tata-Steel.jpg", "site_section": "http://www.india.com/feed/", "section_title": "India | Latest India News | Get Free India.com Email | Live Cricket and Entertainment News at India.Com", "url": "http://www.india.com/business/tata-steel-announce-9-million-pound-support-package-in-uk-654567/", "country": "US", "title": "Tata Steel announce 9 million pound support package in UK", "performance_score": 0, "site": "india.com", "participants_count": 1, "title_full": "Tata Steel announce 9 million pound support package in UK", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T19:36:00.000+03:00", "replies_count": 0, "uuid": "65ff5797613ec9e5d102cda0a60142406076af6f"}, "author": "Wires English | Press Trust of India", "url": "http://www.india.com/business/tata-steel-announce-9-million-pound-support-package-in-uk-654567/", "ord_in_thread": 0, "title": "Tata Steel announce 9 million pound support package in UK", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments \nLondon, Oct 23: The 1,200 Tata Steel workers in the UK facing job cuts have been thrown a lifeline with a 9 million pound support package put together by the British government and the Indian steel giant. The government will provide 6 million pounds of the total 9 million pound package, the UK government and Tata Steel said in a joint statement today, days after Britain’s biggest steelmaker announced the lay-off under a restructuring deal to cope with a “flood of cheap imports” mainly from China .(read: Tata Motors launches bus dealership BusZone) \nIt will give 3 million pounds to match Tata Steel’s funds to provide support for more start-up businesses and companies that are looking to expand and create jobs.In addition, it is separately providing up to 3 million pounds specifically for training of affected employees through local Further Education (FE) colleges to help the employees up-skill for the wider job market, according to the statement. \n“Tata Steel’s regeneration arm UK Steel Enterprise has pledged 3 million pounds to support job creation in Scunthorpe, on top of 10 million pounds it has already earmarked to help regenerate UK steel communities over the next five years,” it said.UK Steel Enterprise, a subsidiary of Tata Steel, has pledged 3 million pounds to support workers in Scunthorpe in the West?Midlands region of England where its steel plant is to restructure. \n“This is a very difficult time for the workforce, so it is important that the government and the company come together to support people and the local economy,” UK business secretary Sajid Javid announced here. \nHe said: “The government has no intention of simply standing aside whilst the steel industry faces global challenges on a scale unprecedented in recent years. We will do everything we can to help workers and to ensure a level- playing field for the industry. ”Tata Steel has a strong track record of creating jobs and supporting local communities right across the country, and its commitment to this package today is to be commended.” \nModified Date: October 23, 2015 9:10 PM Topics:", "external_links": [], "published": "2015-10-23T19:36:00.000+03:00", "crawled": "2015-10-23T19:58:30.852+03:00", "highlightTitle": ""}