{"organizations": [], "uuid": "07bd4c75a9191b6e1973e552bec99f16823dc4d9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chron.com", "main_image": "http://ww3.hdnux.com/photos/41/37/10/8778286/4/rawImage.jpg", "site_section": "http://www.chron.com/rss/feed/Entertainment-293.php", "section_title": "Entertainment", "url": "http://www.chron.com/entertainment/restaurants-bars/article/Southern-Smoke-culinary-blowout-scores-big-6566506.php", "country": "US", "title": "Southern Smoke culinary blowout scores big", "performance_score": 0, "site": "chron.com", "participants_count": 1, "title_full": "Southern Smoke culinary blowout scores big - Houston Chronicle", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T21:22:00.000+03:00", "replies_count": 0, "uuid": "07bd4c75a9191b6e1973e552bec99f16823dc4d9"}, "author": "chron.com", "url": "http://www.chron.com/entertainment/restaurants-bars/article/Southern-Smoke-culinary-blowout-scores-big-6566506.php", "ord_in_thread": 0, "title": "Southern Smoke culinary blowout scores big", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photo: Gary Fountain, Gary Fountain/For The Chronicle Image 1 of / 38 38 Chris Bednorz slicing beef shoulder quad at Southern Smoke, a huge barbecue event sponsored by Underbelly. (For the Chronicle/Gary Fountain, October 11, 2015)\nPhoto: Gary Fountain, Gary Fountain/For The Chronicle Chris Bednorz slicing beef shoulder quad at Southern Smoke, a huge... Image 2 of 38 Ryan Perra's smoked sausage, at Southern Smoke, a huge barbecue event sponsored by Underbelly. (For the Chronicle/Gary Fountain, October 11, 2015)\nPhoto: Gary Fountain, Gary Fountain/For The Chronicle Ryan Perra's smoked sausage, at Southern Smoke, a huge barbecue... Image 3 of 38 Ryan Perra's smoked sausage, at Southern Smoke, a huge barbecue event sponsored by Underbelly.\nPhoto: Gary Fountain, Gary Fountain/For The Chronicle Ryan Perra's smoked sausage, at Southern Smoke, a huge barbecue... Image 4 of 38 Sean Brock, left, and Aaron Franklin at Southern Smoke, a huge barbecue event sponsored by Underbelly.\nPhoto: Gary Fountain, Gary Fountain/For The Chronicle Sean Brock, left, and Aaron Franklin at Southern Smoke, a huge... Image 5 of 38 Rachel DeVries and Grant Yeargain at Southern Smoke, a huge barbecue event sponsored by Underbelly.\nPhoto: Gary Fountain, Gary Fountain/For The Chronicle Rachel DeVries and Grant Yeargain at Southern Smoke, a huge... Image 6 of 38 Nick Deere, from left, Liz Andrasi, Walter Deere, Rachel Deere and David Roberts at Southern Smoke, a huge barbecue event sponsored by Underbelly.\nPhoto: Gary Fountain, Gary Fountain/For The Chronicle Nick Deere, from left, Liz Andrasi, Walter Deere, Rachel Deere and... Image 7 of 38 Chris Bednorz slicing beef shoulder quad at Southern Smoke, a huge barbecue event sponsored by Underbelly.\nPhoto: Gary Fountain, Gary Fountain/For The Chronicle Chris Bednorz slicing beef shoulder quad at Southern Smoke, a huge... Image 8 of 38 Delicia Shyu and Greg McQueen at Southern Smoke, a huge barbecue event sponsored by Underbelly.\nPhoto: Gary Fountain, Gary Fountain/For The Chronicle Delicia Shyu and Greg McQueen at Southern Smoke, a huge barbecue... Image 9 of 38 Logan Ely putting duck over the fire at Southern Smoke, a huge barbecue event sponsored by Underbelly.\nPhoto: Gary Fountain, Gary Fountain/For The Chronicle Logan Ely putting duck over the fire at Southern Smoke, a huge... Image 10 of 38 Ryan Pera preparing sausage at Southern Smoke, a huge barbecue event sponsored by Underbelly.\nPhoto: Gary Fountain, Gary Fountain/For The Chronicle Ryan Pera preparing sausage at Southern Smoke, a huge barbecue... Image 11 of 38 Melanie Fraser, left, and Susan Dabkowski at Southern Smoke, a huge barbecue event sponsored by Underbelly.\nPhoto: Gary Fountain, Gary Fountain/For The Chronicle Melanie Fraser, left, and Susan Dabkowski at Southern Smoke, a huge... Image 12 of 38 St. Arnold's 1959 Cadillac art car outside their tent at Southern Smoke, a huge barbecue event sponsored by Underbelly.\nPhoto: Gary Fountain, Gary Fountain/For The Chronicle St. Arnold's 1959 Cadillac art car outside their tent at Southern... Image 13 of 38 Rachel Deere and David Roberts\nPhoto: Gary Fountain, Gary Fountain/For The Chronicle Rachel Deere and David Roberts Image 14 of 38 Janice Robertson and Doug Williams\nPhoto: Gary Fountain, Gary Fountain/For The Chronicle Janice Robertson and Doug Williams Image 15 of 38 People in line for Aaron Franklin Barbecue at Southern Smoke, a huge barbecue event sponsored by Underbelly.\nPhoto: Gary Fountain, Gary Fountain/For The Chronicle People in line for Aaron Franklin Barbecue at Southern Smoke, a... Image 16 of 38 Sisters Stephanie Boullt, left, and Kerrie Boullt\nPhoto: Gary Fountain, Gary Fountain/For The Chronicle Sisters Stephanie Boullt, left, and Kerrie Boullt Image 17 of 38 Rodney Scott seasoning a whole hog at Southern Smoke, a huge barbecue event sponsored by Underbelly.\nPhoto: Gary Fountain, Gary Fountain/For The Chronicle Rodney Scott seasoning a whole hog at Southern Smoke, a huge... Image 18 of 38 Snapper on a half shell with remoulade butter, prepared by Sean Brock at Southern Smoke.\nPhoto: Gary Fountain, Gary Fountain/For The Chronicle Snapper on a half shell with remoulade butter, prepared by Sean... Image 19 of 38 William Meznarich, from left, Michael and Sandra Burnett, and Natalie Vaclavik\nPhoto: Gary Fountain, Gary Fountain/For The Chronicle William Meznarich, from left, Michael and Sandra Burnett, and... Image 20 of 38 Bradley Clark, from left, Michael SoRelle, Mona Sabzevari and Andrew Sarofim\nPhoto: Gary Fountain, Gary Fountain/For The Chronicle Bradley Clark, from left, Michael SoRelle, Mona Sabzevari and... Image 21 of 38 Mason Lankford of \"Folk Family Revival\" performing at Southern Smoke.\nPhoto: Gary Fountain, Gary Fountain/For The Chronicle Mason Lankford of \"Folk Family Revival\" performing at Southern Smoke. Image 22 of 38 Gwen Gistarb and Richard Julian Joseph\nPhoto: Gary Fountain, Gary Fountain/For The Chronicle Gwen Gistarb and Richard Julian Joseph Image 23 of 38 Tony Brown, from left, with Tara and Scott MacLaren\nPhoto: Gary Fountain, Gary Fountain/For The Chronicle Tony Brown, from left, with Tara and Scott MacLaren Image 24 of 38 Antonio Gianola, from left, Liz Fenton and John Kim\nPhoto: Gary Fountain, Gary Fountain/For The Chronicle Antonio Gianola, from left, Liz Fenton and John Kim Image 25 of 38 Lindsey Mitton, from left, Michelle Fenati and Lauren Briscoe\nPhoto: Gary Fountain, Gary Fountain/For The Chronicle Lindsey Mitton, from left, Michelle Fenati and Lauren Briscoe Image 26 of 38 Janet Byatt, from left, Brittony Byatt and David Byatt\nPhoto: Gary Fountain, Gary Fountain/For The Chronicle Janet Byatt, from left, Brittony Byatt and David Byatt Image 27 of 38 Erin Smith and Greg Peters serving \"Rodney Scott whole hog barbecue\" at Southern Smoke.\nPhoto: Gary Fountain, Gary Fountain/For The Chronicle Erin Smith and Greg Peters serving \"Rodney Scott whole hog... Image 28 of 38 Terrence Gallivan, from left, Ryan Pera and Seth Siegel-Gardner\nPhoto: Gary Fountain, Gary Fountain/For The Chronicle Terrence Gallivan, from left, Ryan Pera and Seth Siegel-Gardner Image 29 of 38 People lined up for barbecue at Southern Smoke.\nPhoto: Gary Fountain, Gary Fountain/For The Chronicle People lined up for barbecue at Southern Smoke. Image 30 of 38 Beverly Crocker and Jason Aston\nPhoto: Gary Fountain, Gary Fountain/For The Chronicle Beverly Crocker and Jason Aston Image 31 of 38 Ducks roasting at Terrence Gallivan and Seth Siegel-Gardner's tent at Southern Smoke.\nPhoto: Gary Fountain, Gary Fountain/For The Chronicle Ducks roasting at Terrence Gallivan and Seth Siegel-Gardner's tent... Image 32 of 38 Barbecue pork with cracklings from Rodney Scott.\nPhoto: Greg Morago Barbecue pork with cracklings from Rodney Scott. Image 33 of 38 Smoked red snapper on the half shell from Sean Brock at Southern Smoke.\nPhoto: Greg Morago Smoked red snapper on the half shell from Sean Brock at Southern... Image 34 of 38 Volunteers at Southern Smoke.\nPhoto: Greg Morago Volunteers at Southern Smoke. Image 35 of 38 Scenes from Southern Smoke\nPhoto: Greg Morago Scenes from Southern Smoke Image 36 of 38 Scenes from Southern Smoke\nPhoto: Greg Morago Scenes from Southern Smoke Image 37 of 38 Scenes from Southern Smoke.\nPhoto: Greg Morago Scenes from Southern Smoke. Image 38 of 38 Southern Smoke culinary blowout scores big 1 / 38 Back to Gallery When the smoke cleared, Underbelly chef Chris Shepherd was proud, grateful and astonished.\nHe hoped that the Southern Smoke fundraiser he organized to benefit the National Multiple Sclerosis Society on Oct. 11 would raise $100,000. At the end of the day the check was $183,989. Standing on a stage at the barbecue playground created between Underbelly, the Hay Merchant and Blacksmith restaurants, Shepherd thanked everyone involved and made a pledge: \"Just so you know, this is going to be an annual event.\"\nAbout 1,000 people attended the event that brought three of the country's best smoked meats and Southern foods practitioners to Houston: Aaron Franklin (famed Austin pitmaster at Franklin Barbecue , who this year won the James Beard Award for Best Chef: Southwest); Sean Brock (of Husk and McCrady's in Charleston, S.C., and a two-time James Beard Award winner); and Rodney Scott (the whole-hog pitmaster who has made Scott's Bar-B-Que in Hemingway, S.C., one of the country's most beloved smoked meat meccas). The event also marks the debut of HOUBBQ Collective, a group of local chefs, including Shepherd, Seth Siegel-Gardner and Terrence Gallivan of the Pass & Provisions , Ryan Pera of Coltivare and Justin Yu of Oxheart .\nShepherd organized the smoky extravaganza after learning that his friend, Antonio Gianola, one of the city's top wine experts, had been diagnosed with MS.\n\"When I told Chris he said, let's not do a dinner, let's do a party,\" Gianola recalled.\nAnd what a party. The sold-out event (tickets were $200 general admission; $300 VIP) featured unlimited tastings, wine (Underbelly sommelier Matthew Pridgen and Camerata wine director David Keck oversaw the donations), beer from Saint Arnold's and Karbach, and live music from Folk Family Revival. Silent auction items helped push the event over its goal.\nGianola said he was glad he confided in Shepherd about his medical condition. \"I thought the only way to make a difference is to tell people and show that you can still be successful in your field and have a life,\" Gianola said. He called the event \"overwhelming and wonderful.\"\nFor barbecue fans it was that, indeed. The HOUBBQ Collective brought its A-game. Pera served a \"tongue and cheek\" dog (smoked tongue and cheek bratwurst) with Texas chow-chow and smoked cheddar cheese. Yu served smoked sticky rice with crispy chicken skin. And Gallivan and Siegel-Gardner served smoked Peking duck on a steamed bun with hoisin sauce and sweet and sour pickles.\nThe three visiting chefs said they were honored to be part of the event.\nScott, second-generation owner of Scott's Bar-B-Que in Hemingway, S.C., is known for whole hog cooking over wood-burning pits. He brought that technique to the event where who big hogs (162 pounds, 148 pounds) fed Southern Smoke attendees. The splayed pigs were first cooked skin-side down for 12 hours then flipped and mopped with Carolina-style vinegar and pepper sauce. The meat bubbled in its own juices on the pits, which Southern Goods pitmaster Patrick Feges helped build.\nBefore Southern Smoke Scott said he'd never been to Houston except to change planes. But he was given a royal tour by Shepherd, hitting Chinatown, Coltivare, and the Pass & Provisions. He also ate banh mi and kolaches.\n\"Texas gave me a lot of love since I've been here. It's the true South,\" he said. \"It's a whole new world out here. It's very Southern and very metropolitan at the same time.\"\nBrock of Charleston also had never been to Houston before coming out for Southern Smoke. He said he immediately felt a great vibe from the city. \"There's a sense of pride people have here and it's contagious,\" he said, adding that events like Southern Smoke are what make the city tick. \"This is what makes communities amazing. You create a singular thing in your community that you're proud of and it's amazing.\"\nBrock said he spent hours talking to Franklin about Central Texas-style barbecue. \"It's just a completely different way of thinking. But it reminds us of what makes barbecue amazing; it's such a regional, distinctive thing. We can all learn from each other.\"\nBrock diverted from the smoked meat route by serving red snapper on a tomato and cucumber salad. The Snapper was cooked skin-on and swabbed with a butter sauce enriched with 'nduja (a spicy pork spread) and chopped lovage.\nThe pitmaster with the longest line for food belonged to Franklin. It was a chance for Houston to sample his style of smoked brisket without enduring the even longer lines at Franklin Barbecue in Austin.\nFranklin doesn't often bring his pits out for barbecue events but he said that when Shepherd asked him to be part of the fundraiser he said, \"What day? What time? I'll be there.\"\nFranklin, who served brisket on white bread with espresso barbecue sauce and dill pickle chips, praised the local barbecue scene. \"I think it's awesome. It's about time for the next-level stuff,\" he said.", "external_links": ["http://ww3.hdnux.com/photos/41/37/10/8778270/3/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/41/36/74/8777519/3/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/41/37/10/8778283/4/920x920.jpg", "http://ww3.hdnux.com/photos/41/37/10/8778286/4/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/41/37/10/8778282/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/41/37/10/8778277/3/920x920.jpg", "http://coltivarehouston.com/", "http://ww4.hdnux.com/photos/41/37/11/8778311/3/920x920.jpg", "http://ww1.hdnux.com/photos/41/37/10/8778292/3/square_gallery_thumb.jpg", "http://oxhearthouston.com/", "http://ww2.hdnux.com/photos/41/37/11/8778305/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/41/37/11/8778305/3/920x920.jpg", "http://ww4.hdnux.com/photos/41/37/10/8778275/3/920x920.jpg", "http://ww2.hdnux.com/photos/41/36/74/8777517/3/920x920.jpg", "http://ww1.hdnux.com/photos/41/36/74/8777520/3/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/41/37/11/8778316/3/920x920.jpg", "http://southerngoodshouston.com/", "http://ww4.hdnux.com/photos/41/37/11/8778307/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/41/37/10/8778294/3/square_gallery_thumb.jpg", "http://mccradysrestaurant.com/", "http://ww2.hdnux.com/photos/41/37/10/8778285/3/920x920.jpg", "http://ww1.hdnux.com/photos/41/37/10/8778292/3/920x920.jpg", "http://ww2.hdnux.com/photos/41/37/10/8778281/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/41/37/11/8778306/3/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/41/37/10/8778287/3/920x920.jpg", "http://ww2.hdnux.com/photos/41/37/11/8778317/3/920x920.jpg", "http://ww4.hdnux.com/photos/41/37/10/8778283/4/square_gallery_thumb.jpg", "http://southernsmoke.org/", "http://ww2.hdnux.com/photos/41/37/10/8778281/3/920x920.jpg", "http://ww1.hdnux.com/photos/41/36/74/8777520/3/920x920.jpg", "http://ww4.hdnux.com/photos/41/37/10/8778287/3/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/41/37/10/8778299/3/square_gallery_thumb.jpg", "http://www.underbellyhouston.com/", "http://ww4.hdnux.com/photos/41/37/10/8778271/3/920x920.jpg", "http://ww1.hdnux.com/photos/41/37/10/8778288/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/41/37/10/8778297/3/920x920.jpg", "http://ww1.hdnux.com/photos/41/37/11/8778316/3/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/41/37/11/8778304/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/41/37/10/8778294/3/920x920.jpg", "http://ww1.hdnux.com/photos/41/37/10/8778284/4/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/41/36/74/8777517/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/41/37/10/8778298/3/920x920.jpg", "http://ww1.hdnux.com/photos/41/37/10/8778288/3/920x920.jpg", "http://ww2.hdnux.com/photos/41/36/74/8777521/3/920x920.jpg", "http://ww2.hdnux.com/photos/41/37/10/8778301/3/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/41/36/74/8777515/3/920x920.jpg", "http://ww2.hdnux.com/photos/41/37/11/8778317/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/41/37/10/8778273/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/41/36/74/8777521/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/41/37/10/8778282/3/920x920.jpg", "http://ww2.hdnux.com/photos/41/37/10/8778301/3/920x920.jpg", "http://ww3.hdnux.com/photos/41/37/10/8778302/3/square_gallery_thumb.jpg", "http://www.huskrestaurant.com/", "http://ww1.hdnux.com/photos/41/37/10/8778284/4/920x920.jpg", "http://ww4.hdnux.com/photos/41/37/10/8778275/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/41/37/10/8778286/4/920x920.jpg", "http://ww4.hdnux.com/photos/41/36/74/8777515/3/square_gallery_thumb.jpg", "http://passandprovisions.com/", "http://ww3.hdnux.com/photos/41/37/10/8778270/3/920x920.jpg", "http://ww2.hdnux.com/photos/41/37/10/8778273/3/920x920.jpg", "http://ww3.hdnux.com/photos/41/37/11/8778306/3/920x920.jpg", "http://ww2.hdnux.com/photos/41/37/11/8778313/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/41/37/10/8778269/3/square_gallery_thumb.jpg", "http://thescottsbbq.com/", "http://ww1.hdnux.com/photos/41/37/11/8778304/3/920x920.jpg", "http://ww4.hdnux.com/photos/41/37/11/8778311/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/41/36/74/8777518/3/920x920.jpg", "http://ww3.hdnux.com/photos/41/37/10/8778302/3/920x920.jpg", "http://ww3.hdnux.com/photos/41/36/74/8777518/3/square_gallery_thumb.jpg", "https://franklinbarbecue.com/", "http://ww2.hdnux.com/photos/41/37/10/8778269/3/920x920.jpg", "http://ww4.hdnux.com/photos/41/37/10/8778299/3/920x920.jpg", "http://ww4.hdnux.com/photos/41/37/11/8778307/3/920x920.jpg", "http://ww1.hdnux.com/photos/41/37/11/8778312/3/920x920.jpg", "http://ww4.hdnux.com/photos/41/36/74/8777519/3/920x920.jpg", "http://ww2.hdnux.com/photos/41/37/10/8778277/3/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/41/37/10/8778271/3/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/41/37/10/8778267/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/41/37/10/8778297/3/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/41/37/11/8778312/3/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/41/37/10/8778267/3/920x920.jpg", "http://ww2.hdnux.com/photos/41/37/11/8778313/3/920x920.jpg", "http://ww3.hdnux.com/photos/41/37/10/8778298/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/41/37/10/8778285/3/square_gallery_thumb.jpg"], "published": "2015-10-12T21:22:00.000+03:00", "crawled": "2015-10-12T21:27:08.100+03:00", "highlightTitle": ""}