{"organizations": [], "uuid": "3094f529c7159a90c76c4a0b6af61bf06fe44a30", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailytelegraph.com.au", "main_image": "http://cdn.newsapi.com.au/image/v1/dd9ef69231f6dfcb1da86bf9985fef45", "site_section": "http://www.dailytelegraph.com.au/entertainment/arts", "section_title": "Arts | Arts and Culture | Sydney Arts Entertainment | dailytelegraph.com.au", "url": "http://www.dailytelegraph.com.au/entertainment/arts/imaginations-take-flight-at-sculpture-by-the-sea/story-fniv7r7y-1227577420998", "country": "US", "title": "Imaginations take flight at Sculpture By The Sea", "performance_score": 0, "site": "dailytelegraph.com.au", "participants_count": 1, "title_full": "Imaginations take flight at Sculpture By The Sea | DailyTelegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T21:00:00.000+03:00", "replies_count": 0, "uuid": "3094f529c7159a90c76c4a0b6af61bf06fe44a30"}, "author": "Elizabeth Fortescue", "url": "http://www.dailytelegraph.com.au/entertainment/arts/imaginations-take-flight-at-sculpture-by-the-sea/story-fniv7r7y-1227577420998", "ord_in_thread": 0, "title": "Imaginations take flight at Sculpture By The Sea", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "With Sculpture By The Sea to be officially opened this morning, artists yesterday prepared their works to be viewed by the 500,000 people who will take the clifftop walk between Bondi and Tamarama.\nJeremy Sheehan’s birds were home from their migration, and Kate Carroll’s riotously coloured tent was up.\nMichael Purdy’s sandstone totems looked majestically out to sea, and Ben Fasham’s stainless steel curve graced the rock shelf just above the tide line.\nMore than 100 artists have come from all over the world to show their work at the free event.\nKings And Queens by Michael Purdy. Picture: Jonathan Ng They will vie for the $60,000 Macquarie Group Sculpture Prize. Failing that, they will hope their sculpture finds a buyer. Even if neither happens, the artists will savour the chance to swap notes and make connections.\n“Sculpture By The Sea has given me contacts to exhibit in China, Europe and New Caledonia,” says veteran exhibitor Ron Gomboc.\n Jeremy Sheehan, a Coffs Harbour TAFE art teacher, is in Sculpture By The Sea for the first time. He’s just relieved his artwork arrived back to him on time and in one piece.\nJeremy Sheehan with his artwork Trans Migration. Picture: Jonathan Ng The 22 model birds that make up his work, Trans Migration, are perched on the handrail outside Tamarama Surf Life Saving Club.\nEach one started life as an armature with a steel-wool covering shaped like a mutton bird.\nSheehan sent one bird to each of 22 Pacific Island nations, where local artists and scientists filled the insides of the birds with plastic debris from the ocean and decorated their exteriors.\n“The Marshall Islands guy wanted to use pandanus because it’s a traditional material and carries the spirit of the island with it,” Sheehan says.\nThe 22 birds were posted back to Sheehan, who couldn’t relax until all his babies were home.\nOver the course of Sculpture By The Sea, the 22 birds will break down naturally until only their plastic gizzards remain.\nKate Carroll’s tent, called Open Home, is made of glass and polystyrene blocks and lit with solar power.\nIt questions the need for walls and boundaries between ­co-habitants.\nOpen Home by Kate Carroll. Picture: Jonathan Ng Michael Purdy this year presents a cluster of totemic sandstone shapes that celebrate the “natural carving of the sandstone cliffs”, the artist says.\n“(Humans) are insignificant compared to the grandeur of the cliffs,” Purdy says.\n“Our consumerism will destroy us, but I am sure the cliffs will bounce back happily.”\nBen Fasham’s elegant stainless steel and bronze curve lays no claim to being conceptual art, unlike Annette Thas’s crashing wave made of 6000 Barbie dolls.\nThas’s work expresses the idea of “being overwhelmed by childhood”, and also talks about bio-science and cloning.\nSculpture By The Sea, Bondi to Tamarama pathway; until November 8, free, sculpturebythesea.com\nArtists put their final touches on the outdoor gallery. Picture: Jonathan Ng", "external_links": ["http://cdn.newsapi.com.au/image/v1/d013b61afa3dd07df6c3fffecc4c4f85", "http://cdn.newsapi.com.au/image/v1/f74f134d6c51f0782a99eda21f73e6ca?width=650", "http://cdn.newsapi.com.au/image/v1/d00cbd0cd81a9bf4c7f4da66c8911277", "http://cdn.newsapi.com.au/image/v1/c72bc460f0cb926fdddb1241a7e85f4a", "http://cdn.newsapi.com.au/image/v1/9ef7354e739b53ae2eb6d6a7528f10cd?width=650", "http://cdn.newsapi.com.au/image/v1/e3b31a057c1204e4cac5e1dad662dbb4?width=650", "http://cdn.newsapi.com.au/image/v1/2b34476e9bf985edaf43a927b79979b7", "http://cdn.newsapi.com.au/image/v1/edb58a0300d15fea5d01e4bf8948db0e?width=650", "http://cdn.newsapi.com.au/image/v1/77dfd1e8a93bbb19c1bf6c765c006342", "http://cdn.newsapi.com.au/image/v1/879fe04d7025a96b1806c04473ea5f29", "http://pixel.tcog.cp1.news.com.au/track/news/content/v1/?category=/section/dailytelegraph.com.au/collection/popular-content/all/24hours/&t_product=most-popular-mobile&td_standfirst=false&td_kicker=false&td_byline=false&td_resultSize=6&maxRelated=20&display:footer=true&origin=omniture&t_template=s3/chronicle-component/otherstories/templates/index&domain=dailytelegraph.com.au"], "published": "2015-10-21T21:00:00.000+03:00", "crawled": "2015-10-24T05:10:57.990+03:00", "highlightTitle": ""}