{"organizations": [], "uuid": "dda5750a6ed1a82ad0a2e6eac5d2e66d4ec21f7c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.brandonsun.com", "main_image": "http://media.winnipegfreepress.com/images/NY120-915_2015_194715_high.jpg", "site_section": "http://www.brandonsun.com/rss?path=/entertainment/breaking-news", "section_title": "Entertainment Breaking News", "url": "http://www.brandonsun.com/entertainment/breaking-news/austin-police-arrest-actor-shia-labeouf-charge-him-with-public-intoxication-331851921.html", "country": "US", "title": "Austin police arrest actor Shia LaBeouf, charge him with public intoxication", "performance_score": 0, "site": "brandonsun.com", "participants_count": 0, "title_full": "Austin police arrest actor Shia LaBeouf, charge him with public intoxication", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T06:07:00.000+03:00", "replies_count": 0, "uuid": "dda5750a6ed1a82ad0a2e6eac5d2e66d4ec21f7c"}, "author": "", "url": "http://www.brandonsun.com/entertainment/breaking-news/austin-police-arrest-actor-shia-labeouf-charge-him-with-public-intoxication-331851921.html", "ord_in_thread": 0, "title": "Austin police arrest actor Shia LaBeouf, charge him with public intoxication", "locations": ["Austin"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Shia LaBeouf"], "text": "The Canadian Press - ONLINE EDITION Austin police arrest actor Shia LaBeouf, charge him with public intoxication By: The Associated Press Enlarge Image \nFILE - In this Sept. 15, 2015, file photo, Actor Shia LaBeouf attends a premiere for \"Man Down\" on day 6 of the Toronto International Film Festival at Roy Thomson Hall in Toronto. The actor was arrested and charged with public intoxication after an incident in Austin, Texas. Jail records show LaBeouf was booked Friday, Oct. 9, 2015, night into the Travis County Jail and released on his own recognizance. (Photo by Richard Shotwell/Invision/AP, File) \nAUSTIN, Texas - Actor Shia LaBeouf has been arrested and charged with public intoxication after an incident in Austin, Texas. \nJail records show LaBeouf was booked Friday night into the Travis County Jail and released on his own recognizance. No attorney was listed on the record. \nHe was arrested in the city's Sixth Street entertainment district. The Austin City Limits music festival is taking place there through Sunday. \nPolice have not responded to a request from The Associated Press for additional details. His publicist did not immediately respond to a request for comment on the arrest. Rate this This article has not yet been rated. We want you to tell us what you think of our articles. If the story moves you, compels you to act or tells you something you didn’t know, mark it high. If you thought it was well written, do the same. If it doesn’t meet your standards, mark it accordingly. \nYou can also register and/or login to the site and join the conversation by leaving a comment. \nRate it yourself by rolling over the stars and clicking when you reach your desired rating. We want you to tell us what you think of our articles. If the story moves you, compels you to act or tells you something you didn’t know, mark it high. Sort by: Newest to Oldest | Oldest to Newest | Most Popular 0 Comments You can comment on most stories on brandonsun.com . You can also agree or disagree with other comments. All you need to do is register and/or login and you can join the conversation and give your feedback. There are no comments at the moment. Be the first to post a comment below. Post Your Comment", "external_links": [], "published": "2015-10-10T06:07:00.000+03:00", "crawled": "2015-10-10T15:18:00.459+03:00", "highlightTitle": ""}