{"organizations": ["University College Dublin Ulysses Medal", "AP"], "uuid": "bebf1e6afdd146f526c7650231c206bdeef730d4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.actionnewsjax.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/10/02/e7/42/f7589aa46ebc4a3a90c6d438332e4435-d15464649cd54f15ba4261d4fa7b8c43-0.jpg", "site_section": "http://www.actionnewsjax.com/list/rss/ap/entertainment/latest-entertainment-news/atk/", "section_title": "Latest in Entertainment", "url": "http://www.actionnewsjax.com/ap/ap/entertainment/tony-winning-irish-playwright-brian-friel-dies-at-/nnsds/", "country": "US", "title": "Tony-winning Irish playwright Brian Friel dies at 86", "performance_score": 0, "site": "actionnewsjax.com", "participants_count": 0, "title_full": "Tony-winning Irish playwright Brian Friel dies at 86", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T14:19:00.000+03:00", "replies_count": 0, "uuid": "bebf1e6afdd146f526c7650231c206bdeef730d4"}, "author": "", "url": "http://www.actionnewsjax.com/ap/ap/entertainment/tony-winning-irish-playwright-brian-friel-dies-at-/nnsds/", "ord_in_thread": 0, "title": "Tony-winning Irish playwright Brian Friel dies at 86", "locations": ["Ireland", "Dublin", "DUBLIN"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Brian Friel", "Julien Behal/PA", "Friel", "Seamus Heaney", "Niall Carson/PA"], "text": "Updated: 7:19 a.m. Friday, Oct. 2, 2015 | Posted: 7:19 a.m. Friday, Oct. 2, 2015 Tony-winning Irish playwright Brian Friel dies at 86 Related View Larger FILE - This is a Sept. 11, 2009 file photo of playwright Brian Friel sitting in a theatre in Dublin. Authorities say Brian Friel, the Tony Award-winning playwright who created ``Dancing at Lughnasa’’ and more than 30 other plays, has died at the age of 86. The Arts Council of Ireland says in a statement that Friel died Friday Oct. 2, 2015. The cause of death was not given. (Niall Carson/PA , File via AP) View Larger FILE - This is a June 16, 2009 file photo of playwright Brian Friel, right, holding his University College Dublin Ulysses Medal, with Irish poet Seamus Heaney in Dublin. Authorities say Brian Friel, the Tony Award-winning playwright who created ``Dancing at Lughnasa’’ and more than 30 other plays, has died at the age of 86. The Arts Council of Ireland says in a statement that Friel died Friday Oct. 2, 2015. The cause of death was not given. (Julien Behal/PA, File via AP) Sponsored Links The Associated Press DUBLIN — \nBrian Friel, the Tony Award-winning playwright who created \"Dancing at Lughnasa\" and more than 30 other plays, has died in Ireland at the age of 86. \nThe government and the Arts Council of Ireland said Friel died Friday in his seaside home in County Donegal, northwest Ireland, the setting for most of his five decades of work. No cause of death was given. \n\"His mythical stories from Ballybeg reached all corners of the world from Dublin to London to Broadway and onto the silver screen,\" said Prime Minister Enda Kenny, who praised Friel as \"the consummate Irish storyteller. His work spoke to each of us with humor, emotion and authenticity.\" \nBallybeg, which means \"little town\" in Gaelic, was the fictional Donegal setting for much of Friel's work. \nTrained as a teacher, Friel turned to writing plays full time after the international success of his debut 1964 play about an Irishman contemplating imminent emigation, \"Philadelphia, Here I Come!\" \nHe collaborated with actor Stephen Rea in founding Ireland's Field Day Theatre Company to produce its inaugural work, \"Translations,\" in 1980. Their company attracted many of Ireland's leading literary lights, including future Nobel Prize-winning poet Seamus Heaney. \nFriel received his greatest acclaim for his 1990 play \"Dancing at Lughnasa,\" which won three Tonys in 1992. It was turned into a 1998 film starring Meryl Streep. \nThe play recalled, through the memory of an adult man, his boyhood memories of spending a summer in 1936 in the company of his five unmarried aunts. \nHe rarely gave interviews, preferring the solitude of Donegal with its barren hills and wind-swept beaches. \n\"Brian was a giant of the theater, and a humble and quiet man, who enjoyed the private company of family, friends and colleagues, but who shunned the spotlight,\" said Sheila Pratschke, chairwoman of the Arts Council. \"He had a natural, easy and profound understanding of the actor's craft, and he spoke about how the actor's public utterance of the playwright's private words was what made the experience of theater so unique.\" \nFuneral arrangements were not announced. Friel is survived by his wife, Anne Morrison, four daughters and a son. Copyright The Associated Press Sign up for our Daily Headlines Newsletter Sign Up", "external_links": [], "published": "2015-10-02T14:19:00.000+03:00", "crawled": "2015-10-02T20:32:54.860+03:00", "highlightTitle": ""}