{"organizations": [], "uuid": "bacf6bf83b905a622309d903b1fa7b383da86d2d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48524/c", "section_title": "Entertainment - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30252368/european-tv-production-market-profile-and-forecast-2014", "country": "US", "title": "European TV Production: Market Profile and Forecast 2014", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "European TV Production: Market Profile and Forecast 2014 - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "bacf6bf83b905a622309d903b1fa7b383da86d2d"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30252368/european-tv-production-market-profile-and-forecast-2014", "ord_in_thread": 0, "title": "European TV Production: Market Profile and Forecast 2014", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " ReportBuyer\nLONDON The report covers TV Production in Europe . There is particular focus on eight of the largest markets: France , Germany , Italy , Poland , Netherlands , Spain , Sweden and the United Kingdom with other markets covered in overview.\nThe price includes a follow-up conference call with the Apex Insight team to discuss findings and go through any questions you may have on areas such as report methodology, definitions, inputs to our forecast model and alternative scenarios.\nWhy is it important?\nThe TV production industry has been forced to evolve as the television and entertainment industries have changed. New TV viewing platforms, such as IPTV have emerged alongside other forms of entertainment using tablets, smartphones and other fast-growing platforms.\nAt the same time, Europe , in particular southern countries such as Italy and Spain , has weathered an economic crisis which has put great pressure on industry revenues.\nTV production has responded by becoming more international and more creative in exploring ways to derive revenue from its content – while maintaining creativity in producing new hit shows.\nThe industry is currently going through a wave of consolidation, both within production and between production companies and broader media groups. Recent deals, such as the acquisitions of All3Media and Eyeworks, and those under consideration, such as the potential Endemol/21st Century Fox joint venture are likely to pave the way for more tie-ups in future as the leaders strive to match each others' reach and capabilities.\nThe report aims to analyse these and other trends to produce estimates of current market sizes, forecasts of likely growth and a view of how the key trends might play out.\nWe quantify the size of the market across Europe and in each of the leading countries as well as historical growth rates and the factors which drive these figures. This includes analysis of television industry revenue and the factors driving it such as advertising spending, TV licence trends and pay-TV revenues – setting out historical trends and forecasts.\nWe also review and evaluate the impact of key industry trends such as development of new platforms such as IPTV, market consolidation and the growth of the super-indies, development of content distribution models, deficit funding and exploitation of new revenue sources such as digital rights.\nOur forecast for industry growth by segment is based on this analysis of historical trends and our understanding of growth drivers.\nWho is the report useful for?\nTV production companies\nBroadcasters and television networks\nOther media groups\nInvestors in these sectors\nBanks, analysts, consultants and other advisors\nMarket regulators and policymakers\nWhat are the sources and methodology?\nThis report is based on\n- Interviews with senior-level contacts in the TV and TV production indsutries\n- In-depth analysis of the macroeconomic and legislative environments and relevant industry drivers\n- Analysis of information on the leading TV production groups\n- Our own experience of advising both companies and investors in the TV and TV production industries and the wider media sector.\nInformation from these sources has been synthesised and presented clearly and concisely with extensive use of charts and tables to illuminate points and support conclusions.\nWe have developed our own model of the market to evaluate the impact of trends and changes and underpin our market forecasts\nDownload the full report: https://www.reportbuyer.com/product/2211972/\nAbout Reportbuyer\nReportbuyer is a leading industry intelligence solution that provides all market research reports from top publishers\nhttp://www.reportbuyer.com\nFor more information:\nSarah Smith\nResearch Advisor at Reportbuyer.com\nEmail: query@reportbuyer.com\nTel: +44 208 816 85 48\nWebsite: www.reportbuyer.com\n releases/european-tv-production-market-profile-and-forecast-2014-300159058.html\n ", "external_links": ["http://www.xmlnews.org/ns/", "https://www.reportbuyer.com/product/2211972/", "http://rt.prnewswire.com/rt.gif?NewsItemId=BR26780&Transmission_Id=201510131629PR_NEWS_USPR_____BR26780&DateId=20151013", "http://www.prnewswire.com/news-releases/european-tv-production-market-profile-and-forecast-2014-300159058.html", "http://www.reportbuyer.com/"], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-13T23:49:00.507+03:00", "highlightTitle": ""}