{"organizations": ["Cinemax Kevin Winter"], "uuid": "ff71a4eeee3a4679bdfa6c68ae922bcc4837c93e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ibtimes.co.uk", "main_image": "http://d.ibtimes.co.uk/en/full/1463326/george-rr-martin.jpg", "site_section": "http://www.ibtimes.co.uk/rss/entertainment", "section_title": "IBTimes.co.uk : Entertainment", "url": "http://www.ibtimes.co.uk/george-rr-martins-werewolf-novella-skin-trade-be-developed-tv-series-1523791", "country": "US", "title": "George RR Martin's werewolf novella The Skin Trade to be developed for TV series", "performance_score": 0, "site": "ibtimes.co.uk", "participants_count": 0, "title_full": "George RR Martin's werewolf novella The Skin Trade to be developed for TV series", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T18:29:00.000+03:00", "replies_count": 0, "uuid": "ff71a4eeee3a4679bdfa6c68ae922bcc4837c93e"}, "author": "", "url": "http://www.ibtimes.co.uk/george-rr-martins-werewolf-novella-skin-trade-be-developed-tv-series-1523791", "ord_in_thread": 0, "title": "George RR Martin's werewolf novella The Skin Trade to be developed for TV series", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["George RR Martin"], "text": "By Amy West October 13, 2015 16:29 BST George RR Martin could be adding another television series to his growing filmography now that his 1989 werewolf novella The Skin Trade has been optioned by network Cinemax Kevin Winter / Getty \nHe's the man behind one of the biggest television shows in the world, and now it looks as if Game Of Thrones author George RR Martin is set to add another small-screen series to his filmography. The 67-year-old took to his personal blog over the weekend to announce that American cable network Cinemax had optioned his \"werewolf noir novella\" The Skin Trade, with plans to adapt it into a fantasy TV show. \nOriginally published in 1989, Skin Trade was part of a horror fiction compilation entitled Dark Visions, which was made up of three short stories by iconic genre-writer Stephen King , three by Dan Simmons and one by Martin. It follows the life and adventures of private investigator Randi Wade, who befriends a collections agent named Willie Flambeaux, who just happens to be a werewolf. (Anybody else thinking this series is going to be a lot like NBC's Grimm ?) \nScreenwriter Kalinda Vasquez, who has worked on series such as Prison Break and Once Upon A Time, has reportedly been hired to develop a script for the pilot, and it seems that work on the first episode is already well under way, with Martin sharing his admiration for Vasquez's vision for his story on his website. \"Kalinda's take on the story and the characters blew me away,\" wrote Martin. \"She loves the story and the world, and really seems to get Willie and Randi.\" \nThis isn't the first time the story, which won the World Fantasy Award for Best Novella in 1989 and has been hailed as one of the best pieces of werewolf fiction ever written, has been optioned, however. Several years ago, the rights were acquired by moviemakers Mike The Pike Productions with the intention of using it as a basis for a feature-length film, but their plans never went ahead. \nThey're still on board as executive producers, and with HBO's sister company Cinemax signed up, it looks as if things will be different this time. If anyone knows how successful Martin's tales can be on screen, it's HBO, who have broadcast Emmy award-winning show Game Of Thrones since its first season in 2011. More entertainment news", "external_links": [], "published": "2015-10-13T18:29:00.000+03:00", "crawled": "2015-10-13T18:54:46.644+03:00", "highlightTitle": ""}