{"organizations": [], "uuid": "ad5dc1e9197d38f278967a1894d50e4463de6d28", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.themercury.com.au", "main_image": "http://content.video.news.com.au/NDM_-_Daily_Telegraph/852/255/ete1_648x365_1969866028-hero__504163.jpg", "site_section": "http://feeds.news.com.au/public/rss/2.0/The%20Mercury%20|%20Entertainment_3306.xml", "section_title": "The Mercury | Entertainment", "url": "http://www.themercury.com.au/entertainment/pete-murray-will-farewell-fan-favourites-on-massive-national-acoustic-tour-ahead-of-new-album/story-fnj3tycr-1227565163987?from=public_rss", "country": "IL", "title": "Pete Murray retiring his hits", "performance_score": 0, "site": "themercury.com.au", "participants_count": 0, "title_full": "Pete Murray retiring his hits", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T09:18:00.000+03:00", "replies_count": 0, "uuid": "ad5dc1e9197d38f278967a1894d50e4463de6d28"}, "author": "", "url": "http://www.themercury.com.au/entertainment/pete-murray-will-farewell-fan-favourites-on-massive-national-acoustic-tour-ahead-of-new-album/story-fnj3tycr-1227565163987?from=public_rss", "ord_in_thread": 0, "title": "Pete Murray retiring his hits", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Pete Murray"], "text": "End of sidebar. Return to start of sidebar. \n“The reason I am doing this is to put some of the old songs to bed,” Murray says. \n“When I put out the next album, I want to play the new songs. When I was doing the Blue Sky Blue acoustic tour, I was doing a combination of everything and it occurred to me that it was a greatest hits set, I didn’t feel I was focused on the album. \n“This tour is about going back to the fans who have supported me over the last few years and doing whatever they want to hear. \n“I still enjoy playing them and I will still play them in the future but for the next tour, I want to focus on new songs.” \nAnother hint that Murray is keen to close this chapter of his career is signalled by who he is working with on the new stuff which he expects to release next year. \nTrials, a member of Funkoars and respected hip hop producer, has been constructing the beats for Murray’s next project. \n“And I want to try other producers too, to get the sonics right,” he says. \n“You get such a big sound working with him, it gives what I do a very different flavour.” \nMurray is one of an increasing number of Australian artists from pop king Guy Sebastian to rising hip hop star Seth Sentry who have booked three-month long tours which include as many regional gigs as capital city shows. \nEven veteran rockers Cold Chisel have added regional gigs to their arena schedule including last weekend’s Deni Ute Muster and upcoming outdoor concerts in Townsville and Geraldton. Lyric blank ... Murray loves asking the crowd to help when he forgets his own songs Source: Supplied \nEvery artist will tell the audiences outside of the major cities are not only grateful for the entertainment but fiercely loyal to those acts who keep coming back to their towns. \nMurray said he has a strong following in rural and coastal towns because “I keep going back”. \n“As long as you are good live and make them feel a part of it, people will come back to see you,” he said. \nHe isn’t a fan of the Pavlovian call-and-response crowd interaction but the crowd often proves to be a gig lifesaver to an artist who admits he occasionally forgets lyrics. \nAs any regular gig goer knows, an artist stuff-up can often be the highlight of a memorable show. \n“Yeah, sometimes I forget the lyrics because during a song I will be thinking I have something to say at the end of the song,” he says. \n“I will make a big deal out of that because people love it when you make a mistake. \n“I’ve actually had to ask people to Google my lyrics for me; that happened with Happy Ground in London one time when someone requested it and I had a crack at it but halfway through, I couldn’t remember the rest of the song. \n“Another time in Geelong, I got a girl on stage who had looked them up and she was so nervous she was shaking. \n“It turned out it was the first gig she had ever been to and here she was on stage and I was making her sing a song.” Family singalong ... Murray’s sons Pedro and Charlie compete to sing along to Always A Winner. Picture: Jerad Williams. Source: News Corp Australia \nJoining him on the road for some of his Australian acoustic adventure will be his sons Charlie and Pedro who love to sing along to his single Always A Winner . \nAlthough the family singalong can end in a fight. \n“They were singing along when I was on tour in Western Australia and Pedro wasn’t keeping up. Charlie wouldn’t wait for him so they had a blue. Come on, boys, settle down, it’s just a song,” he says. \n“If I sing that one and they are there at the gig, watch out for the punch-up.” \nPete Murray will perform at Country Club Tasmania in Launceston on November 13 and Wrest Point Hobart on November 14. Tickets at tixtas.com.au", "external_links": [], "published": "2015-10-11T09:18:00.000+03:00", "crawled": "2015-10-11T19:54:47.321+03:00", "highlightTitle": ""}