{"organizations": [], "uuid": "bc90340983b5a9bf32a702f48a02c78a10426eba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/49223334.cms", "site_section": "http://timesofindia.indiatimes.com/entertainment/kannada/movies/news/articlelist/12245853.cms", "section_title": "News - Movies - Kannada - Entertainment - The Times of India", "url": "http://timesofindia.indiatimes.com/entertainment/kannada/movies/news/Miss-India-to-create-awareness-on-cancer/articleshow/49223308.cms", "country": "IL", "title": "Miss India to create awareness on cancer", "performance_score": 0, "site": "indiatimes.com", "participants_count": 2, "title_full": "Miss India to create awareness on cancer - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 1, "uuid": "bc90340983b5a9bf32a702f48a02c78a10426eba"}, "author": "timesofindia.indiatimes.com", "url": "http://timesofindia.indiatimes.com/entertainment/kannada/movies/news/Miss-India-to-create-awareness-on-cancer/articleshow/49223308.cms", "ord_in_thread": 0, "title": "Miss India to create awareness on cancer", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Aafreen Rachel Vaz, first runner up at Femina Miss India 2015 who will be representing India at the Miss Supranational 2015 at Poland in December, is excited about her fundraiser event that's happening in Mangaluru on October 2. She is all set to launch her Maharashtra registered NGO -Early Detection for Better Future (EDBF) with a 5-km `Run 4 Health' that will focus on breast cancer and other diseases. This event will also serve as a fund raiser for the NGO.\nSpeaking to reporters in Mangaluru on Thursday, Aafreen (in pic) said EDBF aims to build a family of volun teers that will undergo training on the importance of early detection of common diseases specific to the rural region of interest and then to go on to educating the respective rural community through creative health education camps. They aim to create an urban-for-rural health movement that is friendly, fresh and energetic.\nAafreen, who is in the midst of preparations for the international pageant, said there was no specific list of diseases that would be covered. A certified first aid provider by St John New Zealand, Aafreen said the NGO will also strive to train volunteers -boys and girls in first aid. The breast cancer initiative will involve women volunteers, there will be awareness on dengue and then basic hygiene practices for boys and girls. Since she is familiar with Dakshina Kannada and parts of Maharashtra, initially, the NGO will plan its activities in these regions.EDBF will hold the first of its checkup camp for breast cancer in Dakshina Kannada in January next year once she is back from the international beauty pageant, she said.\nAafreen was born and brought up in Mumbai and moved to New Zealand for higher studies. She completed her Bachelors in Science with majors in Physiology from the University of Otago, New Zealand. She has also done her one year radiation therapy from the University of Otago and has also been awarded a scholarship from the Royal Society of Breast Cancer. Currently, she is pursuing Bachelors in Medicine and Surgery (MBBS) from the AJ Institute of Medical Science, Mangaluru.\nShe said, \"I lost a loved one at a very young age in Mumbai simply because it was misdiagnosed. I do not think misdiagnosis about something like cancer that has been around for so long should be an excuse for someone to lose their life. In New Zealand, the Royal Society of Breast Cancer awarded me a scholarship and I worked in the cancer field for a year. Miss India came my way much later. This work I have been doing for years without even knowing that I would be here.For me, I want to make people not just aware but self-sufficient. I have the power to detect it. They do not have the power to control it. That is the nature of the disease. But if they can detect it for themselves, it gives them some amount of control and when they do they will definitely be more proactive about approaching the medical field,\" she said.", "external_links": [], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-13T19:23:30.264+03:00", "highlightTitle": ""}