{"organizations": [], "uuid": "00dd149712a418c110c6d6cc99e70ceeeddb0b1d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.latinospost.com", "main_image": "", "site_section": "http://www.latinospost.com/rss/sections/entertainment.xml", "section_title": "Latinos Post : Entertainment", "url": "http://www.latinospost.com/articles/76050/20151020/back-to-the-futures-pepsi-perfect-bottle-for-sale-on-oct-21-2015-cost-packaging-and-how-to-get-it.htm", "country": "US", "title": "'Back To The Future's' Pepsi Perfect Bottle For Sale on Oct. 21, 2015 - Cost, Packaging, and How To Get It", "performance_score": 0, "site": "latinospost.com", "participants_count": 0, "title_full": "'Back To The Future's' Pepsi Perfect Bottle For Sale on Oct. 21, 2015 - Cost, Packaging, and How To Get It", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T01:18:00.000+03:00", "replies_count": 0, "uuid": "00dd149712a418c110c6d6cc99e70ceeeddb0b1d"}, "author": "", "url": "http://www.latinospost.com/articles/76050/20151020/back-to-the-futures-pepsi-perfect-bottle-for-sale-on-oct-21-2015-cost-packaging-and-how-to-get-it.htm", "ord_in_thread": 0, "title": "'Back To The Future's' Pepsi Perfect Bottle For Sale on Oct. 21, 2015 - Cost, Packaging, and How To Get It", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "'Back To The Future's' Pepsi Perfect Bottle For Sale on Oct. 21, 2015 - Cost, Packaging, and How To Get It Comment 0 Subscribe to Newsletter! \nIn honor of \"Back To The Future\" Day, Pepsi is honoring the classic film by bringing one of its staple beverages to life. \n\"Pepsi fans asked and we heard them loud and clear,\" said Lou Arbetter, Senior Director of Marketing, PepsiCo in a statement . 'The Back to the Future' trilogy was as big a moment in pop culture history then as it is now, 30 years later. We are excited to be part of this moment and to bring fans something only Pepsi could deliver - and there's no need to wait - the future is now!\" Like Us on Facebook \nIn the movie Marty McFly, played by Michael J. Fox, arrived in the future on Oct. 21 2015. In the second installment of the futuristic film he also drank Pepsi Perfect. The beverage, \"which contains Pepsi made with Real Sugar,\" will be sold to fans in identical packaging as the 80's movie at $20.15 for a 16.9 ounce bottle. Fans be advised, there are only 6,500 for sale in the U.S., so be prepared to grab your Oct. 21 online at Pepsi.com, if you were not able to snag yours at New York Comic Con earlier this month. \nThe futuristic beverage is not the only iconic piece of the film coming to life. Lyft has partnered with Verizon for a \"Back To The Future\" experience like no other, truly bringing the movie to life. Fans of the futuristic DeLorean DMC-12 will get a chance to ride around the streets of New York in futuristic style. Lyft's patrons will be able to order a 20-minute ride in a DeLorean straight from the ride-sharing app using the \"McFly Mode.\" This enables fan to order a spin in the infamous whip from 11 a.m. to 5 p.m. tomorrow. Now throw a crisp Pepsi Perfect into the mix and it sounds like a day well spent. \nFor fans that live in Virginia, the city of Reston will officially change its name for the day to \"Hill Valley\" the fictional town from the movie. The city will host a special screening of \"Back to the Future Part II\" with actor Christopher Lloyd and screenwriter Bob Gale in attendance as part of the Washington West International Film Festival. Contribute to this Story:", "external_links": [], "published": "2015-10-21T01:18:00.000+03:00", "crawled": "2015-10-21T04:00:42.255+03:00", "highlightTitle": ""}