{"organizations": [], "uuid": "90428ff21a2e02e94fbfd333d0cc3aa14455e2ce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.digitalspy.co.uk", "main_image": "http://i2.cdnds.net/15/39/300x225/uktv-scrictly-come-dancing-daniel-odonnell.jpg?1242338796", "site_section": "http://www.digitalspy.co.uk/rss/zones/gb/all.xml#", "section_title": "All - Digital Spy - Entertainment and Media News", "url": "http://www.digitalspy.co.uk/tv/s104/strictly-come-dancing/news/a674292/strictly-come-dancing-daniel-odonnell-defends-kristina-rihanoff-from-negativity-in-the-media.html?rss", "country": "US", "title": "Strictly Come Dancing: Daniel O'Donnell defends Kristina Rihanoff from negativity in the media - Strictly Come Dancing Reality TV", "performance_score": 0, "site": "digitalspy.co.uk", "participants_count": 1, "title_full": "Strictly Come Dancing: Daniel O'Donnell defends Kristina Rihanoff from negativity in the media - Strictly Come Dancing News - Reality TV - Digital Spy", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T03:00:00.000+03:00", "replies_count": 0, "uuid": "90428ff21a2e02e94fbfd333d0cc3aa14455e2ce"}, "author": "Harry Fletcher", "url": "http://www.digitalspy.co.uk/tv/s104/strictly-come-dancing/news/a674292/strictly-come-dancing-daniel-odonnell-defends-kristina-rihanoff-from-negativity-in-the-media.html?rss", "ord_in_thread": 0, "title": "Strictly Come Dancing: Daniel O'Donnell defends Kristina Rihanoff from negativity in the media - Strictly Come Dancing Reality TV", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Strictly Come Dancing's Daniel O'Donnell has defended dancing partner Kristina Rihanoff from negativity in the media after leaving the show this evening (October 18).Rihanoff received negative press after confirming recently that she and ex-Strictly partner Ben Cohen are in a relationship. © Twitter / @bbcstrictly Speaking to Digital Spy and others, O'Donnell considered whether Rihanoff's negative coverage affected his own popularity, saying: \"Oh, not at all. No. And I think if people knew Kristina and knew the type of person she is – and just the fact of the wonderful work she does for charity.\"He added: \"I think if that was written about it would give a very balanced view of the good person she is.\"I hope [my wife] Majella and myself, yes, will be able to keep in touch with her and Ben [Cohen] yes.\"O'Donnell also said he wasn't at all fazed by the speculation that Kristina was \"gutted\" to be paired with him, and that she called him an 'old man'. © BBC / Guy Levy Strictly's Daniel O'Donnell: \"It would have been nice for Kristina to get a young sports star\"Speaking about the stories, he said: \"I did see it. Kristina told me that she didn't say that at all. But you know, sure, what can you do. Things are going to be written. \"It certainly didn't affect Kristina and myself at all. We just enjoyed what we did and enjoyed learning the dance and doing the dance. I suppose I would have loved to have been able to do better, but that's the way it is.\"The singer added: \"Somebody has to go every week and this week it was my turn, that's all that has to be said. But that didn't affect me at all, the thing of being an old man. I don't think I'm old anyway!\"", "external_links": [], "published": "2015-10-18T03:00:00.000+03:00", "crawled": "2015-10-19T00:22:15.969+03:00", "highlightTitle": ""}