{"organizations": [], "uuid": "7905164712b106f64f81735deb783eb9336ca524", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "abcnewsradioonline.com", "main_image": "http://abcnewsradioonline.com/storage/news-images/112113_HughJackman.jpg?__SQUARESPACE_CACHEVERSION=1385069719664", "site_section": "http://abcnewsradioonline.com/entertainment-news/rss.xml", "section_title": "Entertainment News - ABC News Radio", "url": "http://abcnewsradioonline.com/entertainment-news/hugh-jackman-almost-passed-on-an-acting-career.html", "country": "US", "title": "Hugh Jackman Almost Passed on an Acting Career", "performance_score": 0, "site": "abcnewsradioonline.com", "participants_count": 1, "title_full": "Hugh Jackman Almost Passed on an Acting Career", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T18:30:00.000+03:00", "replies_count": 0, "uuid": "7905164712b106f64f81735deb783eb9336ca524"}, "author": "Joi-Marie McKenzie", "url": "http://abcnewsradioonline.com/entertainment-news/hugh-jackman-almost-passed-on-an-acting-career.html", "ord_in_thread": 0, "title": "Hugh Jackman Almost Passed on an Acting Career", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Share Article \nABC/Randy Holmes (LOS ANGELES) -- Hugh Jackman's acting career has yielded an Oscar nomination, two Tony Awards, an Emmy and a Golden Globe, but in the new edition of Parade magazine, the X-Men star reveals that he originally chose a different career path. \nJackman, 46, always had a passion for acting, but the journalism major figured he had a better shot at making it as a news reporter. \n\"For me, the goal was to become a stringer, travel the world and file reports,\" he says. \"At the same time, I was also doing a lot of amateur theater. It was a hobby. I didn’t think that I could make a living acting.\" \n\"I realized it’s not really who I am. I didn’t have the drive. I felt a bit of a fake,\" the Sydney, Australia, native continues. \"The [other] students were more passionate. When I went off to drama school for three years, that was it for me. I was acting like 10 to 12 hours a day. I was so happy!\" \nJackman, whose theater credits include The Boy from Oz , for which he won a Tony Award, notes that hearing the applause night after night was his confirmation that he made the right choice. \"The moment before the applause really exults you when you realize, with complete strangers, that you know each other, completely,\" he explains. \"It was a moment of honesty. I’d feel as intimate with an audience as with my wife. 'This is who I am!' When it happens, it’s thrilling. Sometimes I feel more myself on a stage than I do off the stage.” \nIn the interview, Jackman also discusses how his painful childhood affected his performance in the upcoming film Pan , in which he plays the titular character's archenemy, Blackbeard. Like Peter Pan, Hugh was abandoned by his mother at eight years old. \n\"From the moment Mum left, I was a fearful kid who felt powerless,\" adds Jackman, who was the youngest of four children. \"...I used to be the first one home and I was frightened to go inside. I couldn’t go into the house on my own. I’d wait outside, scared, frustrated. Growing up I was scared of the dark. I was scared of heights. It limited me. I hated it...It emanates from some kind of powerlessness. I was really feeling that.\" \nJackman tells Parade that as with every one of his acting roles, his two adopted children with Deborra-Lee Furness, his wife of 19 years, affected his decision to accept the part. \n\"I want to make sure that this movie is not something my kids are going to feel weird about,” he says. \"Every movie I do, I think, My kids are going to see this. When it’s a movie about adoption, I want to make sure that they don’t feel uncomfortable. \n\" Peter Pan is a classic tale, but now we live in a different world where we’re more sensitive about adoption,\" adds Jackman. \"I’m completely comfortable [with Pan ]. If I wasn’t, I wouldn’t have done the film.\" \nPan , also starring Garrett Hedlund, Rooney Mara, Amanda Seyfried and Cara Delevingne, opens nationwide October 9. \nCopyright © 2015, ABC Radio. All rights reserved. Friday, October 2, 2015 at 11:30AM by", "external_links": [], "published": "2015-10-02T18:30:00.000+03:00", "crawled": "2015-10-02T22:19:46.362+03:00", "highlightTitle": ""}