{"organizations": [], "uuid": "856e04e55158c9173a2e0f4f9dccbae11fa8afd8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "", "site_section": "http://www.prweb.com/rss2/9910celebrities.xml", "section_title": "Arts &amp; Entertainment: Celebrities", "url": "http://www.prweb.com/releases/2015/10/prweb13007511.htm", "country": "US", "title": "Andrew Lincoln Autographed Photo And “Walking Dead” Trading Cards To Be Given Away By PSA", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Andrew Lincoln Autographed Photo And “Walking Dead” Trading Cards To Be Given Away By PSA", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "856e04e55158c9173a2e0f4f9dccbae11fa8afd8"}, "author": "Donn Pearlman", "url": "http://www.prweb.com/releases/2015/10/prweb13007511.htm", "ord_in_thread": 0, "title": "Andrew Lincoln Autographed Photo And “Walking Dead” Trading Cards To Be Given Away By PSA", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Fans of “The Walking Dead” have a chance to win an autographed photo of actor Andrew Lincoln who plays the role of Rick Grimes on the popular television program. The framed 11X14 full-color, certified-authentic autographed photo and a complete set of Walking Dead season 3, part 1 trading cards will be given away by PSA ( http://www.PSAcard.com ) in conjunction with the New York Comic Con™ convention, October 8 – 11, 2015. Visitors to the show will also have the opportunity to have their celebrity and historical figures’ autographs certified for authenticity by PSA/DNA experts.\n“You can enter the sweepstakes for the Andrew Lincoln autograph either in person at the show or by registering online. You can enter to win the trading card set simply by following PSA on social media with Facebook, Instagram or Twitter. No purchase is necessary to be eligible for either prize,” explained Joe Orlando, President of PSA, the world’s largest trading card certification and autograph authentication service.\nPSA will be at booth #2828 during New York Comic Con at the Javitz Center, located at 655 West 34th Street (between 11th and 12th Streets) in New York City.\nTo enter the sweepstakes for the Lincoln photo, scan your New York Comic Con badge at the PSA booth during the convention or register online at http://www.PSAcard.com/ComicConNY . The autograph has been certified authentic by PSA/DNA, the autograph authentication division of PSA.\nTo enter the sweepstakes for The Walking Dead trading card set, follow PSA on Facebook at http://www.facebook.com/PSAcard , on Instagram at https://instagram.com/PSAcard or on Twitter at https://twitter.com/PSAcard/ .\nEach card in the set has been authenticated, certified for grade and encapsulated in a protective PSA holder.\nPSA/DNA autograph experts will be available on-site, Thursday through Saturday, October 8 through 10, to authenticate collectors’ previously-signed autographs at New York Comic Con.\n“Bring your Star Wars, Walking Dead and other entertainment autographs for PSA/DNA experts to examine. Autographs signed at the show can be authenticated for a show special price of only $10. Our regular authentication fees will apply to submissions of all other previously-signed items,” said Orlando.\n“For the convenience of collectors and dealers attending New York Comic Con, we’ll be accepting submissions in all of our authentication categories, including sports. Remember that PSA-certified collectibles often sell for premium prices because of the strength and credibility of the PSA brand,\" Orlando stated.\nWhile supplies last, visitors to the PSA booth can receive complimentary copies of a special Comic Con edition of SMR magazine with feature stories about Star Wars collectibles. SMR is a monthly magazine filled with useful information about trading cards, autographs and other entertainment, sports and historical memorabilia and collectibles.\nSince 1991, PSA experts have examined and certified more than 25 million trading cards, autographs and other entertainment and sports memorabilia with an estimated cumulative value of more than $1 billion.\nFor additional information about PSA and PSA/DNA services, call Customer Service at (800) 325-1121 or go to http://www.PSAcard.com .", "external_links": ["http://www.PSAcard.com/ComicConNY", "http://www.prweb.net/Redirect.aspx?id=aHR0cHM6Ly9pbnN0YWdyYW0uY29tL1BTQWNhcmQ=", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5mYWNlYm9vay5jb20vUFNBY2FyZA==", "https://twitter.com/PSAcard/", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5QU0FjYXJkLmNvbQ==", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5QU0FjYXJkLmNvbS9Db21pY0Nvbk5Z", "https://instagram.com/PSAcard", "http://www.prweb.net/Redirect.aspx?id=aHR0cHM6Ly90d2l0dGVyLmNvbS9QU0FjYXJkLw==", "http://www.facebook.com/PSAcard"], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-08T11:38:45.734+03:00", "highlightTitle": ""}