{"organizations": [], "uuid": "d8de7fb004d5c9eb8793ebe4c92c2183d6799284", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/10/15/13026686/ResizeImageHandler.jpg", "site_section": "http://www.prweb.com/rss2/artbooks.xml", "section_title": "Arts &amp; Entertainment: Books", "url": "http://www.prweb.com/releases/ZoltanABalogh/10/prweb13026686.htm", "country": "US", "title": "Zoltan A Balogh Releases ‘To My Children's, Children's, Children’", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Zoltan A Balogh Releases ‘To My Children's, Children's, Children’", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "d8de7fb004d5c9eb8793ebe4c92c2183d6799284"}, "author": "Marketing Services", "url": "http://www.prweb.com/releases/ZoltanABalogh/10/prweb13026686.htm", "ord_in_thread": 0, "title": "Zoltan A Balogh Releases ‘To My Children's, Children's, Children’", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "First time author Zoltan A Balogh addresses his new book “ To My Children's, Children's, Children ” (published by Xlibris) as he explores the reason and purpose of man’s existence here on earth. His philosophical thoughts reach out to readers and prompt them to also question and seek for explanation of things often asked but always left unanswered. This book delves into topics pertinent to real life and those considerations that are needed to promote success both within the practical reality of man’s worldly existence as well as those pertinent to the spiritual reality of man’s eternal lives. It candidly explores politics, religion, science and philosophy, emphasizing the importance of self-determination and the intrinsic motivation required to be able to decide and determine one's own eternal destiny.\nBalogh’s free-flowing prose analyzes topics often considered taboo for discussion purposes and truthfully addresses topics without consideration for political correctness or religious separation, emphasizing inclusiveness rather than divisiveness to achieve success, within the context of every individual's own exclusive eternal reality.\n“Everyone is searching for their own reality and find why,” Balogh on what inspired him to write. “[This book] emphasizes individual motivation to effectively create one’s eternal destiny.”\nArrestingly thought-provoking, this literary piece is a fitting gift to the future generation; a narrative “To My Children's, Children's, Children.”\n“To My Children's, Children's, Children”\nBy Zoltan A Balogh\nHardcover | 6 x 9in | 280 pages | ISBN 9781503599253\nSoftcover | 6 x 9in | 280 pages | ISBN 9781503599260\nE-Book | 280 pages | ISBN 9781503599277\nThe author is a graduate of The William Patterson University of New Jersey. He was awarded a bachelor's degree in political science in 1975, with supporting class interests in philosophy, leading to a life long journey to seek answers to questions raised about the reason and purpose for existence itself, seeking answers to questions that arise merely because of man’s acknowledgement of his own self-awareness as well as the perceptions of what he believes to constitute his own reality.\nXlibris Publishing, LLC imprint, is a self-publishing services provider created in 1997 by authors, for authors. By focusing on the needs of creative writers and artists and adopting the latest print-on-demand publishing technology and strategies, we provide expert publishing services with direct and personal access to quality publication in hardcover, trade paperback, custom leather-bound and full-color formats. To date, Xlibris has helped to publish more than 60,000 titles. For more information, visit xlibris.com or call 1-888-795-4274 to receive a free publishing guide. Follow us @XlibrisPub on Twitter for the latest news.", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL2V4aWxlbGlmZXN0eWxlLmNvbS9yZWFsaXR5LXByYWN0aWNhbC1yZWFsaXR5Lw==", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL2luNWQuY29tL3NwaXJpdHVhbC1yZWFsaXR5LWV2ZXJ5dGhpbmcteW91LW5lZWQtdG8ta25vdy1hYm91dC1uZWFyLWRlYXRoLWV4cGVyaWVuY2VzLw==", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL2Jvb2tzdG9yZS54bGlicmlzLmNvbS9Qcm9kdWN0cy9TS1UtMDAwOTkwNjYyL1RvLU15LUNoaWxkcmVucy1DaGlsZHJlbnMtQ2hpbGRyZW4uYXNweA==", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL2Jvb2tzdG9yZS54bGlicmlzLmNvbS9BdXRob3IvRGVmYXVsdC5hc3B4P0Jvb2t3b3Jrc1NJZD1TS1UtMDAwOTkwNjYy", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3BzeWNob2xvZ3kuYWJvdXQuY29tL29kL21vdGl2YXRpb24vZi9kaWZmZXJlbmNlLWJldHdlZW4tZXh0cmluc2ljLWFuZC1pbnRyaW5zaWMtbW90aXZhdGlvbi5odG0="], "published": "2015-10-16T03:00:00.000+03:00", "crawled": "2015-10-16T08:35:18.942+03:00", "highlightTitle": ""}