{"organizations": [], "uuid": "a38a094c6b32ba8f4258ee8cb737f086b1b7184a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "prmac.com", "main_image": "", "site_section": "http://prmac.com/rss-channel-50.htm", "section_title": "prMac: Entertainment", "url": "http://prmac.com/release-id-77079.htm", "country": "US", "title": "Make Art You Can Animate with WizArt App for iPhone", "performance_score": 0, "site": "prmac.com", "participants_count": 0, "title_full": "Make Art You Can Animate with WizArt App for iPhone", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T17:00:00.000+03:00", "replies_count": 0, "uuid": "a38a094c6b32ba8f4258ee8cb737f086b1b7184a"}, "author": "", "url": "http://prmac.com/release-id-77079.htm", "ord_in_thread": 0, "title": "Make Art You Can Animate with WizArt App for iPhone", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Make Art You Can Animate with WizArt App for iPhone October 12,   Mountain View, California - What if you could draw, sketch, make fancy objects, and create collages on your iPhone, and then push a button to animate your creation and even save a video of the animation? That is what WizArt allows you to do! Just like a wizard who transforms a pumpkin into a golden carriage with the swing of a baton, WizArt transforms your still drawings into animated artworks, with the push of a button. A novel drawing, painting, sketch, and collage app for iPhone, WizArt is the simplest and most magical way for creating animated art, packed with magical wands and tools, made for grown ups and kids alike. With WizArt, you create objects using three basic drawing tools, a line tool, a shape tool, and a scissors tool for cutting out pieces from your drawing or imported photos. What gives WizArt its magical powers though is that you can select any object you create, at any time, and move/rotate/scale/copy/delete it. Thus WizArt is more than just a drawing app, it is also a collage app, one which allows you to edit, assemble, and compose your artwork. WizArt lets you animate your drawing/collage/composition with the push of a special Animation button. You get to choose among more than 25 different combinations of animation modes and color variations whenever you run animation. Some modes make objects move slightly, and some make objects fly all around. The milder modes are best for animating portraits and natural scenes (picture a breezy version of Van Gogh's Starry Night), and the wilder one are great for creating abstract compositions from your artwork. You can take snapshots of animation with the push of a Save button, or save a video of the animation to share a smile and surprise with your family and friends. You can also choose and play a song from your iTunes collection while watching your animated art play. And one of the coolest features of WizArt's animation is that while it is happening, you can move the canvas and zoom in and out on it, much like what a cinematographer or director does! So, draw something, direct its animation, and then take its video to iMovie and add your voice over or sound track; tell a story and share! With WizArt, the possibilities are endless. Another powerful feature of WizArt is its Copy/Multiplication feature. In WizArt's copy mode you can create identical copies of a selected object, with different colors as you wish, by tapping on the screen. But there's more; you can also create multiple consecutive copies of the selected object by moving one or two fingers (touches) on WizArt's canvas. In WizArt's lingo, this action is called 'Multiplication'. One-finger Multiplication lets you create your own paint brushes; simply create and select an object as the tip of your brush, and then paint with it using one finger/touch. Two-finger Multiplication lets you create complex objects and patterns from simpler objects (lines or shapes). In two-finger multiplication you use two fingers to control the size and orientation of the consecutive copies of the selected object. Using your thumb and index finger is the most intuitive choice for two-finger Multiplication. But if you use one finger from each hand, and since they can move more freely around each other, you can create more interesting multiplications. On larger iPhones you can even perform Circular Multiplication: hold your left (non-dominant) index finger on the screen and move your right (dominant) index finger around it (much like drawing a circle with a math compass). With circular multiplication and its variants you can create fascinating organic objects and patterns that the creator of WizArt thinks were not previously possible! She reasons: the absolute majority of digital art application (and traditional drawing tools as well) have been using just one active touch (e.g., mouse with a desktop computer, bristle brush on a real canvas, and single finger or stylus on tablets), but WizArt exploits the true power of Multi-Touch through two-finger multiplication for creating brand new forms of 2D art. WizArt is the second major app created and developed by Escadapps LLC. Escadapps' TwoToJazz App for iPad is even more powerful than WizArt, as it additionally includes a set of two-finger brushes, including a broad-edge calligraphy brush that claims to be the best and most articulate of any application, on any platform or device out there. Escadapps is also the creator of a simple, non-competitive, but potentially addictive color mixing and matching game called Mixacolor, which is based on how colors are mixed in both WizArt and TwoToJazz; by rubbing 8 main color buttons, just like traditional painters mix colors on their painter's palettes! Escadapps' founder, Vida, has a PhD degree in computer engineering. She has gotten to express her artistic side through developing these creativity apps, and making artworks with them, and along the way has connected to a wonderful community of friends and artists who create digital art on iPad, iPhone and other mobile devices. WizArt and TwoToJazz have most active presence on Facebook. You can also find TwoToJazz on Flickr.   8.1 or later * 22.8   WizArt 1.2 is $2.99 USD (or equivalent amount in other currencies)  ", "external_links": [], "published": "2015-10-12T17:00:00.000+03:00", "crawled": "2015-10-12T16:13:08.266+03:00", "highlightTitle": ""}