{"organizations": [], "uuid": "41f772a127c44e5319ecc627103f79a175b9ee8a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "", "site_section": "http://www.prweb.com/rss2/entertainment.xml", "section_title": "Arts &amp; Entertainment", "url": "http://www.prweb.com/releases/2015/10/prweb13023775.htm", "country": "US", "title": "LNB Announces Grand Opening of New Ontario Office", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "LNB Announces Grand Opening of New Ontario Office", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T03:00:00.000+03:00", "replies_count": 0, "uuid": "41f772a127c44e5319ecc627103f79a175b9ee8a"}, "author": "Lauren Sformo", "url": "http://www.prweb.com/releases/2015/10/prweb13023775.htm", "ord_in_thread": 0, "title": "LNB Announces Grand Opening of New Ontario Office", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Lyons National Bank (LNB) is excited to announce the grand opening of its new Ontario office, located at the corner of Route 104 and Furnace Road. While the branch will officially open on October 19th, LNB will be celebrating all week long with food, giveaways and weekly drawings. “We are so excited to open the new, modern office that is located only about 500 feet from our old space in the Tops Plaza,” says Jean Tsepas, Branch Manager, LNB Ontario. “The enhanced office space will help us to better serve our customers and the greater community.”\nThe new 3,400-square foot facility will be a full-service branch, with a dedicated mortgage lender, financial service representative and commercial banking specialist. Customers will enjoy a spacious lobby area, new meeting spaces and a convenient drive-through banking window.\nThe new branch will also feature a Community Room, a boardroom-style, Wi-Fi-enabled meeting area equipped with presentation capabilities. The space also includes access to new restrooms and a kitchen.\nLocal organizations interested in using the space can reserve it during and after banking hours by contacting Jean Tsepas at (315) 524-9661.\nFor more information on LNB’s new Ontario office, please contact, Barb Taney.\nLNB is an $840 million independent, community bank with now thirteen branch offices located throughout Wayne, Monroe, Onondaga, Ontario, Seneca, and Yates Counties. LNB has a long-standing tradition of excellence, dating back to their beginning in 1852. As its mission, LNB safely and profitably serves all of its customers and communities with unmatched professional service. They offer an extensive variety of products within the personal and business banking realms, including direct deposit, online banking, Cash Management Services, Remote Deposit Capture and much more. LNB also provides financial services, including investments and insurance. For a complete listing of products and services, as well as branch locations, please visit BankwithLNB.com.", "external_links": [], "published": "2015-10-17T03:00:00.000+03:00", "crawled": "2015-10-17T10:24:00.103+03:00", "highlightTitle": ""}