{"organizations": [], "uuid": "67df81495aa7b55e8455886ad06220c33d9733e9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prnewswire.com", "main_image": "http://content.prnewswire.com/designimages/logo-prn-01_PRN.gif", "site_section": "http://www.prnewswire.com/rss/entertainment-media/all-entertainment-media-news.rss", "section_title": "PR Newswire: Entertainment &amp; Media", "url": "http://www.prnewswire.com/news-releases/wftv-channel-9-and-the-trust-for-public-land-name-chuck-oneal-as-central-floridas-cox-conserves-hero-300152456.html", "country": "US", "title": "WFTV Channel 9 and The Trust for Public Land Name Chuck O'N", "performance_score": 0, "site": "prnewswire.com", "participants_count": 1, "title_full": "WFTV Channel 9 and The Trust for Public Land Name Chuck O'N", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T21:32:00.000+03:00", "replies_count": 0, "uuid": "67df81495aa7b55e8455886ad06220c33d9733e9"}, "author": "WFTV Channel 9", "url": "http://www.prnewswire.com/news-releases/wftv-channel-9-and-the-trust-for-public-land-name-chuck-oneal-as-central-floridas-cox-conserves-hero-300152456.html", "ord_in_thread": 0, "title": "WFTV Channel 9 and The Trust for Public Land Name Chuck O'N", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ORLANDO, Fla. WFTV Channel 9 Family Connection and The Trust for Public Land today named Chuck O'Neal as Central Florida's 2015 Cox Conserves Hero. O'Neal's nonprofit of choice, League of Women Voters of Florida Education Fund, will receive $10,000 on his behalf. The three finalists were chosen by a judging panel and then competed in an online public vote to be named Central Florida's Cox Conserves Hero. Chuck O'Neal has advocated for Florida's natural resources for more than 15 years. An entrepreneur and lifelong Florida resident, Chuck has volunteered hundreds of hours educating voters and lawmakers on the importance of conserving Florida's unique ecosystem. He organized \"Speak up Wekiva,\" which engaged community leaders and the public at large in the need to protect the aquifer and created greater awareness about the ill effects of groundwater pollution on people and wildlife. Chuck also leads advocacy efforts for the protection of the Florida black bear and played a vital role in the passing of the Florida Land and Water Conservation Initiative in 2014.\nThe two runners-up each receive $5,000 for their nonprofits of choice. Cathy Brown selected The Florida Scrub-Jay Consortium and Jim Thomas chose Oakland Nature Preserve.\nThe national Cox Conserves Heroes program was created in 2008 through a partnership between The Trust for Public Land and Cox Enterprises, the parent company of WFTV Channel 9. The partnership stems from Cox Enterprises' national Cox Conserves sustainability program that focuses on reducing waste and energy consumption, conserving water and inspiring eco-friendly behavior.\nThrough the national Cox Conserves Heroes program, nearly $550,000 has been donated to environmental nonprofits and more than 150 volunteers have been honored. Cox Conserves Heroes also takes place in Arizona , California , Georgia , Louisiana , Massachusetts and Virginia .\nFor more information, visit CoxConservesHeroes.com or Facebook .\nSocial Media: #CoxConservesHeroes and #CoxConservesHero\nAbout WFTV Channel 9:\nPart of Cox Media Group, WFTV Channel 9 is an ABC affiliate serving Central Florida . Cox Media Group is an integrated broadcasting, publishing, direct marketing and digital media company that includes the national advertising rep firms of CoxReps. Additionally, CMG owns Cox Target Media, which operates Valpak, one of North America's leading direct marketing companies, and Savings.com, a leading online source for savings. The company's operations currently include 14 broadcast television stations and one local cable channel, 59 radio stations, seven daily newspapers and more than a dozen non-daily publications, and more than 100 digital services. CMG currently operates in more than 20 media markets and reaches approximately 52 million Americans weekly, including more than 31 million TV viewers, more than 3.5 million print and online newspaper readers, and more than 14 million radio listeners. For more information about Cox Media Group, please check us out online at www.coxmediagroup.com .\nAbout The Trust for Public Land:\nThe Trust for Public Land creates parks and protects land for people, ensuring healthy, livable communities for generations to come. Nearly ten million people live within a ten-minute walk of a Trust for Public Land park, garden, or natural area, and millions more visit these sites every year. Learn more at tpl.org .\nAbout Cox Conserves:\nLaunched in 2007 by Chairman Jim Kennedy , Cox Conserves is Cox Enterprises' national sustainability program. Cox Conserves focuses on reducing waste and energy consumption, as well as conserving water. The program engages each of the company's major subsidiaries (Cox Communications, Cox Automotive and Cox Media Group) and encourages Cox Enterprises' 50,000 employees and their families to engage in eco-friendly practices.\nThe company's sustainability goals are to send zero waste to landfill by 2024 and become carbon and water neutral by 2044. The company also presents the Cox Conserves Sustainability Survey , a nationwide survey that examines sustainability opportunities and challenges for small and medium-sized businesses.\nSOURCE WFTV Channel 9\nRELATED LINKS\nhttp://www.coxmediagroup.com", "external_links": ["http://www.coxmediagroup.com/", "http://www.9family.com/", "http://www.facebook.com/pages/Cox-Conserves-Heroes/64927689571", "http://www.tpl.org/", "http://coxenterprises.com/about-cox/corporate-leadership/james-c-kennedy.aspx", "http://www.coxconserves.com/survey", "http://www.coxconservesheroes.com/"], "published": "2015-10-01T21:32:00.000+03:00", "crawled": "2015-10-01T16:32:32.702+03:00", "highlightTitle": ""}