{"organizations": [], "uuid": "511308712c28bce3e504be66df24546e7cc7ed02", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.myjoyonline.com", "main_image": "http://photos.myjoyonline.com/photos/news/201506/7055854275719_2407282859914.jpg", "site_section": "http://www.myjoyonline.com/pages/rss/site_entertainment.xml", "section_title": "Ghana Entertainment HomePage", "url": "http://www.myjoyonline.com/entertainment/2015/October-8th/car-theft-saga-i-sold-the-car-to-sarkodie-but-dosty-dee.php", "country": "US", "title": "Car theft saga: I sold the car to Sarkodie but... - Dosty Dee", "performance_score": 0, "site": "myjoyonline.com", "participants_count": 0, "title_full": "Car theft saga: I sold the car to Sarkodie but... - Dosty Dee", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T10:10:00.000+03:00", "replies_count": 0, "uuid": "511308712c28bce3e504be66df24546e7cc7ed02"}, "author": "", "url": "http://www.myjoyonline.com/entertainment/2015/October-8th/car-theft-saga-i-sold-the-car-to-sarkodie-but-dosty-dee.php", "ord_in_thread": 0, "title": "Car theft saga: I sold the car to Sarkodie but... - Dosty Dee", "locations": ["Ghana", "Sarkodie"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Sarkodie", "Ernest Dela Aglanu"], "text": "Source: Ghana | Myjoyonline.com | Ernest Dela Aglanu (Twitter: @delaXdela / Instagram: citizendela) Date: 08-10-2015 Time: 07:10:33:pm Sarkodie \nA man by name Dosty Dee is claiming that he sold the Infiniti saloon car to rapper Sarkodie which has become a subject of a police case. \nAccording to Dosty, Sarkodie is a victim of a disagreement between him and his brother-in-law. \nMyjoyonline.com revealed Thursday that, the Criminal Investigation Department (CID) of the Police Service was investigating rapper Sarkodie for trying to register a stolen vehicle . \nThe rapper was picked up by the police when he went to the Driver and Vehicle Licensing Authority (DVLA) in Accra to register an Infiniti car they said had been reported stolen. \nASP Joseph Obinifo Darkwah, Public Relations Officer of the CID, who confirmed the arrest to Myjoyonline.com, said the rapper has been granted bail and is assisting the police with investigations. \nReacting to the reports, Dosty explained on his instagram page that he sold the car to the rapper who was unaware of the problems in his family. \nRead his explanation below: \n“First of all I will like to apologize to sarkodie for whatever is going on…I didn’t know it will end this way ..okay having said I will like to take this opportunity to set the record straight so that Ghanaians will let sark be..look in that picture, what u see ?the right car is the infinity they are talking about .1 sold that car to sark ..to make a long story short ..my uncle bought that car for my brother in law and when the car got to Ghana my brother in law didn’t like it so my sister asked me to buy it instead of letting the government impound the car ..I sent her money to clear it and later we talk business when I get to Ghana ..so I got to Ghana and my sister told me things had changed cos my in-law said he like the car now ..(FOUL PLAY) was cool about it ..later my brother in-law said he will buy my Range Rover when am returning to the states ..so he gave me the car which I had already paid 10k $$ and said he will take my Range Rover and give me the difference ..he was aware that I sold the car to sark ..a stolen car doesn’t have two keys and all documents ..okay it was time to come to the states my in law was like his money is not right so it’s better I sell the Range and balance him ..so I was like it’s time for me to teach him a lesson too lol ..I sold the Range Rover and didn’t pay him the difference cos technically the infinity is mine ..so he was also smart about it and reported the case to the police that the car has been stolen ..Didn’t know until sark called me fewdays ago that he was trying to register the car and he was told the car is a stolen car ..#Familylssues #LifeNLessons #RealityCheck ” \n\nFollow me on Twitter: @delaXdela and Instagram: citizendela", "external_links": [], "published": "2015-10-08T10:10:00.000+03:00", "crawled": "2015-10-09T06:35:16.574+03:00", "highlightTitle": ""}