{"organizations": [], "uuid": "44c49b0641f63f1669ad957f6cc3881f14149d28", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mcall.com", "main_image": "http://www.trbimg.com/img-561835b9/turbine/mc-garden-garlic-fall-planting-shallots-20151009", "site_section": "http://www.mcall.com//entertainment/rss2.0.xml", "section_title": "Entertainment - The Morning Call", "url": "http://www.mcall.com/features/home/mc-garden-garlic-fall-planting-shallots-20151009-story.html", "country": "US", "title": "It&apos;s time to plant the garlic or shallots", "performance_score": 0, "site": "mcall.com", "participants_count": 1, "title_full": "It&apos;s time to plant the garlic or shallots - The Morning Call", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T01:44:00.000+03:00", "replies_count": 0, "uuid": "44c49b0641f63f1669ad957f6cc3881f14149d28"}, "author": "mcall.com", "url": "http://www.mcall.com/features/home/mc-garden-garlic-fall-planting-shallots-20151009-story.html", "ord_in_thread": 0, "title": "It&apos;s time to plant the garlic or shallots", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "It's time to plant the garlic, or if you prefer, shallots. Garlic (Allium sativum) and shallots (Allium cepa or A. ascalonicum) are two of the easiest plants to grow if you give them the right conditions. Note that as members of the allium family, browsing deer, groundhogs, rabbits and other garden visitors do not usually bother it. Both crops do best with a cold period (vernalization), which is virtually guaranteed with fall planting. So what are the ideal conditions for growing garlic/shallots?\n•If the shallots are in bunches, divide into individual bulbs for planting.\n•Select garlic appropriate to your conditions. Soft neck varieties, used for braiding, need very well drained soil. Select hard neck if your conditions are less than ideal. Do not use supermarket garlic as your planting stock. It is often treated to delay sprouting. Untreated bulbs from local markets or planting stock from nurseries will give you better results. Select the largest and best looking cloves, or for shallots, bulbs, for planting.\n•Loamy soil, high in organic matter or anywhere you have successfully grown onions. A soil pH between 6.0 and 7.0 is best. Shallots still do well in a soil with a pH as low as 5.5. Supplement the soil with compost to increase the soil's organic content.\n•Full sun, six to eight hours of sunlight is a minimum.\n•Don't separate cloves until right before you are ready to plant.\n•Plant single cloves, pointed end up, about three to five inches apart and about a half to an inch deep.\n•Rotate your planting location on a three-year cycle to avoid problems, five years is better but difficult to manage in most backyard gardens. Count garlic or shallots in the same group as onions and leeks.\n•Keep the bed weed free. Consider mulching with clean straw after the ground freezes.\n•Plan on regular watering from April to harvest. Ideally, plants need one to two inches of water per week. Always include rainfall in your water calculation and do not overwater.\nI've received a bit more mail than usual. So the rest of the column is dedicated to the readers who took the time to write in with their comments and suggestions:\nCleanup surprise\nCarole Mebus wrote about a surprise she found while cleaning up her plants to bring them in for the winter:\nI was working to get many of my plants into the greenhouse this morning before the deluge, the tropical storm and the cool weather coming at week's end. While hosing down the clivia, I noticed eyes staring up at me. A green frog, I believe! We returned the frog back to the frog pond, but isn't this a good lesson to clean off and inspect plants before they're brought into the house for the winter?!\nAster success\nBetsy Mescavage reported:\nSeveral weeks ago I sent an email in regards to the aphids that destroyed my asters and that I had cut the plants down to the ground. I have to tell you that they rebounded beautifully and now I have buds and some are beginning to blossom. They're short things, from 8 to 10 inches but I kind of like them that size! So it looks like I will have asters this fall in spite of the aphid devastation weeks ago. Amazing to see them come back from where they were.\nStiltgrass\nScott Quote: :\nI am a wetland delineator and stiltgrass is often found on the edges of wetlands in moist soil. During my wetland training many years ago, the U.S. Fish and Wildlife Service called it \"packgrass\" because they said it came into this country used as packing material for Asian goods. I have never heard of it being imported as an ornamental. I have noticed, and I am a long-time avid gardener, that microstegium only seems to take over where soil or native vegetation has been disturbed. I have wetland on my property and I mowed a path through it and stiltgrass took over the pathway, but it has never been able to get a foothold in the rest of the dense wetland plant community. (Wetland experts say our temperate wetlands have plant masses as high as the most dense tropics. It is often hard going through real wetlands.) I also have noticed that it often takes over where I have dug up the soil for edging around trees or for planting something. Also see it at the edges of farm fields where the soil has been disturbed by the cultivation but crop is not planted there. The only removal method I know is to pull it, and like you say, it pulls out easily. Or if it covers larger area of lawn, just mow it and learn to accept it.\nBut worse invasives in my opinion are Japanese knotweed and multiflora rose, both of which have strong roots and can gradually take over large swaths of moist soil and floodplains. I am also starting to have a problem with mile-a-minute vine dominating my wetland. It can grow up over shrubs and small trees during late summer and fall and bend them over to the point of permanently disfiguring them if not removed.\nI found Scott's story of stiltgrass (Microstegium vimineum) escaping from packing material to be well substantiated. It first appeared in Tennessee, about 1919.\nSue Kittek is a freelance garden columnist, writer, and lecturer. Send questions to Garden Keeper at grdnkpr@gmail.com or mail: Garden Keeper, The Morning Call, P.O. Box 1260, Allentown, PA 18105.\nThis Week in the Garden\n•Planting:\n•Plant spring-flowering bulbs, garlic and shallots, asparagus and rhubarb, perennials, trees and shrubs.\n•Sow seeds that require a cold period for germination. Poppies are one example.\n•Use asters, kale, mums, winter pansies and other fall garden favorites to brighten the fall landscape.\n•Seasonal:\n•Dig up and store gladiolus bulbs. Dig and store other tender bulbs as the foliage is killed off by cold weather or frosts.\n•Allow the final flush of flowers to go to seed.\n•Pot up plants you want to winter over indoors. Herbs, favorite annuals, tender perennial are all candidates.\n•Cut back peony greens as they die back.\n•Lawns:\n•Purchase seed for fall lawn projects. Seed, overseed, dethatch and aerate lawns through mid-October\n•Sod as the weather cools through October; fertilize, if desired, now until mid October\n•Treat for grub, chinch bugs and sod webworms\n•Apply broadleaf weed control, through mid October\n•Chores:\n•Start watching for frosts. A simple cover, an old sheet, can protect your tender plants and give you a few more weeks of color.\n•Allow amaryllis bulbs to die back and go dormant in preparation for winter bloom.\n•Order or buy mulch for winter but do not apply until the ground freezes.\n•Easing plants indoors: be sure to get them inside before you turn on heating system for the season.\n•Check, repair and replace gutters, down spouting, storm windows and doors.\n•Dump standing water.\n•Provide deer, rabbit and groundhog protection for vulnerable plants. Reapply taste or scent deterrents.\n• Tools, equipment, and supplies:\n•Clean and store summer equipment as you no longer need it this year— service and/or purchase replacements. Schedule service or plan for replacements.\n•Check fall/winter equipment and replace or repair as needed.\n•Clean, sharpen and oil hand tools.\n•Clean and store seed starting containers and other pots as you finish using them for the season. Check supplies for next spring and note or purchase as needed.\n•Safety:\n•Stop pruning; plants are winding down now and pruning will often cause new growth that will freeze and weaken the plant. Don't prune anything that can't be reached from the ground.\n•Check for ticks after every outing.", "external_links": [], "published": "2015-10-10T01:44:00.000+03:00", "crawled": "2015-10-10T13:02:12.345+03:00", "highlightTitle": ""}