{"organizations": [], "uuid": "e96c3f3da7354994faae4095cb421d4fbe192384", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "http://www.bostonherald.com/sites/default/files/media/2014/10/01/100914gretta2.1.jpg", "site_section": "http://bostonherald.com/entertainment/lifestyle", "section_title": "Entertainment: Lifestyle | Boston Herald", "url": "http://bostonherald.com/entertainment/lifestyle/2015/10/support_breast_cancer_research_at_local_galas", "country": "US", "title": "Support breast cancer research at local galas", "performance_score": 0, "site": "bostonherald.com", "participants_count": 1, "title_full": "Support breast cancer research at local galas | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "e96c3f3da7354994faae4095cb421d4fbe192384"}, "author": "Gretta Monahan", "url": "http://bostonherald.com/entertainment/lifestyle/2015/10/support_breast_cancer_research_at_local_galas", "ord_in_thread": 0, "title": "Support breast cancer research at local galas", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Breast Cancer Awareness Month is in full swing and our beloved city is buzzing with events to support the cause. As New Englanders, we’re so fortunate to have such a focused and talented medical and philanthropic community devoted to find the cure. They continue every year to raise awareness and the money needed to put this disease behind us once and for all.\nLet’s start with one of the best of the month: On Oct. 14 at the Seaport Hotel, Art BeCause (artbecause.org) will celebrate our heroes in fighting the disease. Their gala will spotlight WBZ-TV news anchor Paula Ebben and honor the wonderful Dr. Elsie Levin, as well as William Schawbel and state Rep. Chris Walsh, for their support of breast cancer prevention. I’m on the committee of this incredible Framingham-based nonprofit organization because I seriously believe in what they’re doing. They focus not just on giving to causes that support breast cancer research, but highlighting the environmental reasons that may contribute to the disease.\nOn Oct. 16, come with me to celebrate the 20th Anniversary of ESSCO-MGH Benefit at the Pine Brook Country Club in Weston (esscomgh.org). The organization is dedicated to fundraising for vital, high-risk breast cancer research at the Massachusetts General Hospital in Boston.\nOn Oct. 27, the Hard Rock Cafe is uniting musicians, supporters and survivors in honor of the 16th annual PINKTOBER campaign. It will be a wrap party for the restaurant’s month-long campaign, which lets guests buy an Ellie Fund bracelet for a $2 donation.\nI’m unbelievably grateful for the ongoing support I’ve been given by the big-hearted experts from the ESSCO-MGH Breast Cancer Research Fund who show their dedication every day. Events like theirs aren’t just a way to donate, but also a way to connect with our community and to thank our city’s best-in-class doctors, caregivers and hospitals.\nThey’re also a way to pay tribute to the memory of loved ones we have lost to the disease while fighting for a future that’s breast cancer-free.", "external_links": [], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-08T11:41:59.593+03:00", "highlightTitle": ""}