{"organizations": [], "uuid": "8cfe04413eab1ebf7632929e750a3a9991b3f2bb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailynews.com", "main_image": "http://www.dailynews.com/apps/pbcsi.dll/storyimage/LA/20151020/FEATURES/151029988/AR/0/AR-151029988.jpg?Maxh=1500&Maxw=1500", "site_section": "http://www.dailynews.com/entertainment", "section_title": "Coverage and breaking news of entertainment in Hollywood and Los Angeles", "url": "http://www.dailynews.com/arts-and-entertainment/20151020/how-sarah-silverman-joined-2015s-best-actress-ranks-with-i-smile-back", "country": "US", "title": "How Sarah Silverman joined 2015’s best actress ranks with ‘I Smile Back’", "performance_score": 0, "site": "dailynews.com", "participants_count": 1, "title_full": "How Sarah Silverman joined 2015’s best actress ranks with ‘I Smile Back’", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "8cfe04413eab1ebf7632929e750a3a9991b3f2bb"}, "author": "Bob Strauss", "url": "http://www.dailynews.com/arts-and-entertainment/20151020/how-sarah-silverman-joined-2015s-best-actress-ranks-with-i-smile-back", "ord_in_thread": 0, "title": "How Sarah Silverman joined 2015’s best actress ranks with ‘I Smile Back’", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sarah Silverman, Terry Kinney and Director Adam Salky review a scene on the set of their new film \"I Smile Back,\" a Broad Green Pictures release. Credit: Jeong Park / Broad Green Pictures\nIt’s been a great year for great actresses doing challenging, deeply dramatic work: Brie Larson in the devastating “Room,” Kristen Wiig in “Welcome to Me,” “Diary of a Teenage Girl” and, in theaters this week, “Nasty Baby,” Cate Blanchett and Rooney Mara in the upcoming “Carol” . . .\nAdd to that list Sarah Silverman in “I Smile Back.”\nRelocate your jaw (you’ll have to do it again when you see her in this movie). The raunchy comedian is heartbreakingly on the money as a housewife from a well-off New York suburb who goes on wild jags of drug and alcohol indulgence, promiscuous rough sex and inappropriate verbal outbursts.\nLaney Brooks also loves her children and her husband of many years, Bruce (Josh Charles), and not just during the sporadic stretches when she agrees to take her mood-leveling meds. There’s also an abandonment issue from childhood that could explain some of her compulsive destructiveness if the movie was more interested in explanations than in credible, moment-to-moment behavior.\nBut it’s the latter agenda that director Adam Salky (“Dare”) brought to this low-budget yet riveting adaptation of Amy Koppelman’s novel. And Silverman was fearlessly tuned in to Laney’s emotional reality in every shot. It’s one of the best performances of the year.\n“I tried to keep it open and just do an honest version of this person,” says Silverman, who’s tried her hand at drama in the movie “Take This Waltz” and on Showtime’s “Masters of Sex.” “Just kind of see all sides of it because I’ve had depression and I understand it. I haven’t had addiction in my life, but I’ve studied it and I’ve been around it a lot; I’m a comedian, right?\n“I have an interest in what the confused perception of self-hatred is,” Silverman says of her attraction to the project. “The truth is, it’s self-obsession; there’s no room for anyone else. To that degree I see the negative side of it. Oh poor you, you’re abandoning your kids or you’re doing everything you’re so afraid that you’re going to do and you’re so self-obsessed about it that there’s no room to actually care for anyone else.”\nHow the author met the comedian\nKoppelman was driving to pick one of her own kids from school while listening to Howard Stern’s show (Mom!) when she heard guest Silverman talk about her memoir “The Bedwetter.”\n“I just thought her heart would understand my heart and so I just wanted to get the book to her,” Koppelman recalls. “I wasn’t thinking she could star in a movie about it.”\nSilverman’s people were contacted. She loved the book and met with Koppelman in Lower Manhattan. Koppelman and her spec script-writing partner Paige Dylan worked out a screenplay, and the author’s producer husband Brian Koppelman (“The Illusionist”) teamed with a number of others to get the production going.\nAdvertisement\nSilverman knew who she wanted to play Laney’s husband and contacted Charles, her buddy from well before they both started appearing on “Masters of Sex.”\n“I was just really flattered that she reached out to me to be a part of this with her,” says Charles, who plays cards with Silverman and worked with her previously on an episode of his former series, “The Good Wife.” “I love taking risks as an actor, doing things that maybe people don’t perceive me as. I was excited for her and wanted to be on that journey with her.”\nCharles is so charged up about Silverman’s dramatic breakthrough that he all but refuses to talk about his own character Bruce, a poignant fellow who goes to great lengths to be supportive for the love of his life ­— except when he just can’t.\n“The way that Josh performs that role is so hard,” Koppelman provides. “When you’re watching the movie, you think it’s all about Sarah. But what humanizes her, what makes you see anything redemptive about Laney, is the ability to look at her through Josh’s eyes.”\nHow a non-addict portrays detox\nFor Silverman, the challenges involved being as honest as she could imagine for Laney’s altered states — though the comic likes a few puffs of pot before bed, the actress has never been much into harder drugs and credits having “the palate of a 10-year-old” for a lifelong distaste for alcohol. Equally as important was staying true to life when Laney sobers up.\n“It was challenging because we wanted to see shades of her detoxing,” Silverman frets. “I didn’t want it to look like it was all what I’ve seen from other movies and TV shows. I’m not saying that my performance wasn’t that, but I was conscious of that and I had a very close friend that I was with a lot at the time who went through the exact same thing and told me the broad and detailed strokes of it.”\nSounds like the kind of thing great actresses do. Charles put it another way.\n“Sarah dove into this head first and buck naked,” he says.\nA revelation to audiences at January’s Sundance Film Festival, Silverman’s performance left a very specific impression on one concerned individual.\n“I don’t remember, anymore, that Laney in my book,” Koppelman says. “Sarah is Laney now to me.”\nNot for everyone\nSilverman isn’t expecting praise from all quarters, if only because the things Laney does will likely repulse some viewers to the point where they won’t appreciate the craft of the performance.\n“I feel like people’s reactions will be very varied, and that’s kind of the best reaction you can hope for for something that you put out,” Silverman shrugs.\nShe’s also made it abundantly clear that comedy remains and will continue to be her first love. Maybe her commitment to it, though, explains why her work in “I Smile Back” came out so well.\n“I’m not the first one to say there are parallels between comedy and tragedy,” Silverman says. “They’re best friends. But it’s not really some kind of decision I’m making, like ‘I’m going to go this way with my career.’ ”\nAbout the Author Reach the author at bob.strauss@dailynews.com or follow Bob on Twitter: @bscritic .\nFull bio and more articles by Bob Strauss Back to top", "external_links": ["http://mn1-laweb.newscyclecloud.com/apps/pbcsi.dll/storyimage/LA/20151020/FEATURES/151029988/EP/1/1/EP-151029988.jpg&maxh=400&maxw=667", "http://twitter.com/bscritic", "http://mn1-laweb.newscyclecloud.com/apps/pbcsi.dll/persbilde?Avis=LA&ID=22", "http://widgets.outbrain.com/outbrain.js"], "published": "2015-10-20T03:00:00.000+03:00", "crawled": "2015-10-22T02:33:25.909+03:00", "highlightTitle": ""}