{"organizations": [], "uuid": "3e11765ef80cc0b8dab5376694b634fd12737bbe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2011/09/02/13030183/IngramContentGrouplogo.jpg", "site_section": "http://www.prweb.com/rss2/aemagazines.xml", "section_title": "Arts &amp; Entertainment: Magazines", "url": "http://www.prweb.com/releases/2015/10/prweb13030183.htm", "country": "US", "title": "Demand Surge for Nobel Prize Winner’s Books Handled with Ease by Ingram", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Demand Surge for Nobel Prize Winner’s Books Handled with Ease by Ingram", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "3e11765ef80cc0b8dab5376694b634fd12737bbe"}, "author": "Elizabeth Fielding", "url": "http://www.prweb.com/releases/2015/10/prweb13030183.htm", "ord_in_thread": 0, "title": "Demand Surge for Nobel Prize Winner’s Books Handled with Ease by Ingram", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "There’s no better way for a writer to receive an impressive boost in book orders than to win a Nobel Prize. That’s what happened last week to Russian writer Svetlana Alexievich. Alexievich won the Nobel Prize for Literature. Instantly, her books surged in popularity, prompting publishers with a few units on hand to provide quick and innovative distribution solutions for the unexpected spike in orders.\n“This was the kind of situation Lightning Source, Ingram Content Group’s print-on-demand service, is perfect for,” said W.W. Norton & Company President Drake McFeely. “We were caught short on stock when the splendid news arrived about Svetlana Alexievich’s Nobel Prize. Ingram filled the gap seamlessly, getting books into the marketplace while we hurried together our reprint.”\nAlexievich’s book “Zinky Boys” was written in 1992 and published by W.W. Norton & Company. Once Alexievich was named the winner of the Nobel Prize for Literature, demand skyrocketed to thousands in one day. Since the publisher was already using Ingram’s Lightning Source print-on-demand service, Ingram was able to manage the order surge in stride. All orders were filled. Readers were happy. No sales were missed.\nAlexievich’s 2005 release “Voices of Chernobyl” also saw a surge in sales. The cloth edition is published by Dalkey Archive Press, an Ingram Publisher Services client. Dalkey had one unit on hand and sent it to Ingram to scan, which provided the metadata to reproduce the title. “Voices of Chernobyl” was ready to ship to libraries, booksellers and customer in less than 36 hours.\n“In the case of a spike in demand, the first order of business is re-stocking the book as quickly as possible,” said John O’Brien, publisher, Dalkey Archive Press. “Ingram is the perfect connection at a time like this because of its scope, the ability to get the cloth edition back into stock, and its ability to get copies of books to accounts.”\nO’Brien added that without Ingram, they would have had to reprint the books on their own, and then get the book out to their accounts.\n“Ingram has been able to do so much and do it quickly,” O’Brien said. “Print-on-demand allowed us to get the book out in a matter of days.”\nDalkey Archive Press joined Ingram Publisher Services this summer, and O’Brien mentioned that getting a decade-old title back into the market has been a true test case of what Ingram can do for publishers.\n“This is beyond the reach of any other distributor I know,” he added. “Neither Dalkey nor Ingram was expecting something like this so early on in our new relationship. Everyone at Ingram has been great to work with, and both of us have had to meet some very tight deadlines.”\nABOUT INGRAM\nIngram Content Group Inc. is a subsidiary of Nashville-based Ingram Industries Inc. The company got its start in 1964 as a textbook depository and has since grown and transformed into a comprehensive publishing industry services company that offers numerous solutions, including physical book distribution, print-on-demand and digital services. Committed to the success of its partners, Ingram works closely with publishers, retailers, libraries and schools around the world to provide them with the right products and services to help them succeed in the dynamic and increasingly complex world of content publishing. Ingram’s operating units are Ingram Book Company, Lightning Source Inc., VitalSource Technologies Inc., Ingram Periodicals Inc., Ingram International Inc., Ingram Library Services Inc., Spring Arbor Distributors Inc., Ingram Publisher Services Inc., Tennessee Book Company LLC, and ICG Ventures Inc. Learn more about Ingram Content Group at http://www.ingramcontent.com .\nContact: Elizabeth Fielding 615.321.3110 / elizabeth(at)tsgnashville(dot)com", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5pbmdyYW1jb250ZW50LmNvbS8="], "published": "2015-10-19T03:00:00.000+03:00", "crawled": "2015-10-19T21:52:23.699+03:00", "highlightTitle": ""}