{"organizations": ["British Film Institute"], "uuid": "90d2c477c588c077b0ce636e9479db01a79d162d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stalbansreview.co.uk", "main_image": "http://www.stalbansreview.co.uk/resources/images/4298068/", "site_section": "http://www.stalbansreview.co.uk/uk_national_entertainment/rss/", "section_title": "St Albans & Harpenden Review | National Entertainment News", "url": "http://www.stalbansreview.co.uk/uk_national_entertainment/13807047.Tom_Hiddleston_named_British_Film_Institute_ambassador/?ref=rss", "country": "GB", "title": "Tom Hiddleston named British Film Institute ambassador", "performance_score": 0, "site": "stalbansreview.co.uk", "participants_count": 0, "title_full": "Tom Hiddleston named British Film Institute ambassador", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T18:21:00.000+03:00", "replies_count": 0, "uuid": "90d2c477c588c077b0ce636e9479db01a79d162d"}, "author": "", "url": "http://www.stalbansreview.co.uk/uk_national_entertainment/13807047.Tom_Hiddleston_named_British_Film_Institute_ambassador/?ref=rss", "ord_in_thread": 0, "title": "Tom Hiddleston named British Film Institute ambassador", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Tom Hiddleston"], "text": "Tom Hiddleston named British Film Institute ambassador Tom Hiddleston named British Film Institute ambassador Share \nTom Hiddleston has been named the first official ambassador of the British Film Institute. \nThe 34-year-old Thor actor, whose other screen credits include Steven Spielberg’s War Horse, Avengers Assemble and Woody Allen’s Midnight In Paris, said he is “committed” to his new role, which will see him championing the British film-making industry. \nHe has also worked with British filmmakers such as Joanna Hogg on Archipelago, Terence Davies on The Deep Blue Sea and Ben Wheatley on High Rise, the latter of which will premiere at the BFI London Film Festival on October 9. (Evan Agostini/AP) \nDescribing film as “one of the most powerful, accessible, democratic and transformative” art forms in our society, Hiddleston, back on the big screen this month in Guillermo del Toro’s Crimson Peak, said: “The BFI looks after the most significant collection of film and television in the world. \n“It should be treasured and protected, in the same way we treasure and protect all our great cultural collections, from art and music, to libraries and museums. \n“The BFI’s mission is to ensure that our film culture is kept alive, and to inspire the next generation of film talent. It’s the reason the BFI exists and why I am committed to being a BFI ambassador.” \nBFI CEO Amanda Nevill added: “Tom is a hugely admired and influential actor who understands the full breadth of film culture. He moves fluidly from starring in the world’s most successful blockbusters to remaining engaged with – and loyal to – emerging British filmmakers where he is admiringly bold and risk taking in his choices. \n“This potent combination demonstrates Tom’s innate understanding that greatness in film rests upon deep cultural foundations – something that Britain is exporting to the world. \n“Tom will be an enormous boost to the BFI and I want to thank him for taking on this extremely important role on behalf of British film.” Share article \nHiddleston will make his debut as the BFI ambassador at the Luminous fundraising gala, where he will be joined by guests such as Emilia Clarke, Guy Ritchie, Terry Gilliam and John Hurt. Promoted Stories", "external_links": [], "published": "2015-10-06T18:21:00.000+03:00", "crawled": "2015-10-06T23:05:08.627+03:00", "highlightTitle": ""}