{"organizations": [], "uuid": "cd17fd33bbd81c7c5e72e82054aa32c223cdfea9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mb.com.ph", "main_image": "http://www.mb.com.ph/wp-content/uploads/2015/10/ernest-cu.jpg", "site_section": "http://www.mb.com.ph/category/entertainment/", "section_title": "mb.com.ph | Philippine News | Archive | Entertainment", "url": "http://www.mb.com.ph/for-your-viewing-pleasure/", "country": "CA", "title": "For your viewing pleasure", "performance_score": 0, "site": "mb.com.ph", "participants_count": 1, "title_full": "For your viewing pleasure | mb.com.ph | Philippine News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "cd17fd33bbd81c7c5e72e82054aa32c223cdfea9"}, "author": "Maan D’Asis Pamaran", "url": "http://www.mb.com.ph/for-your-viewing-pleasure/", "ord_in_thread": 0, "title": "For your viewing pleasure", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "by Maan D’Asis Pamaran\nOctober 15, 2015 Dan James Horan\nTechnology has allowed the latest phones to multitask. Whereas a hand-held phone was previously a tool for communication, it has evolved to offer entertainment by way of games, music and even watching the latest TV shows and movies. HOOQ has had viewers, well, hooked on their fave blockbusters but the caveat was one has had to squint to enjoy the show.\nThere’s now a solution to it. Globe recently unveiled a new piece of tech which allows subscribers maximum entertainment enjoyment of their HOOQ programs, right in the comfort of their homes. “Home is very important to Globe. We’ve created entertainment in the smartphone and we want to make our customers enjoy a truly rich digital home experience,” shared Globe President and CEO Ernest Cu.\nGlobe Senior Adviser for Consumer Business Dan James Horan added, “After offering quality music streaming through Spotify and the exciting basketball games in real time via the NBA League Pass on Globe Tattoo, we are excited to be working closely with Google to bring the Chromecast to Filipinos who are huge fans of everything entertainment – from movies, TV shows, games, sports, to photos and videos. With Chromecast, our customers get instant access to quality entertainment experience at home as they get to see their favorite content and apps from the small screen to the big screen.”\nThe thumb-sized device, which attaches to the TV’s HDMI port lets viewers enjoy HOOQ’s more than 10,000 foreign and local movies and series on their home screen, making it possible to enjoy a great bonding activity with friends and family.\nErnest Cu\nJane Cruz-Walker, HOOQ Philippines Country Manager said TV watching is still a shared experience among Filipinos.“The family bonds in front of the TV, and shares the laughter, action, or drama of a great story, so we are all looking forward to the arrival of Chromecast in the country through Globe. As long as you have Chromecast, at the press of a button, you can instantly ‘cast’ your favorite HOOQ show from your mobile or tablet to your TV screen.”\nAccording to HOOQ figures, the top 5 most watched series are “Flash,” “Gotham,” “Arrow,” “Friends” and “Imortal.” For movies, the top 5 are “Captain America,” “Thor,” “Iron Man,” “One More Chance” and “Diary Ng Panget.”\nOther new and exciting innovations for online shopping, healthcare, and advertising were unveiled at the event, which was capped by a stunning performance by Sarah Geronimo.", "external_links": ["http://i.po.st/static/v3/post-widget.js#publisherKey=4qcr4d26tnrf260rqrda&retina=true"], "published": "2015-10-15T03:00:00.000+03:00", "crawled": "2015-10-14T19:08:57.424+03:00", "highlightTitle": ""}