{"organizations": [], "uuid": "97d5306a14a559eef19b527d29b2ff79f26f19c6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nydailynews.com", "main_image": "http://assets.nydailynews.com/polopoly_fs/1.2399310!/img/httpImage/image.jpg_gen/derivatives/landscape_1200/humancover.jpg", "site_section": "http://www.nydailynews.com/entertainment/index.html", "section_title": "Entertainment News &amp; Reviews - NY Daily News", "url": "http://www.nydailynews.com/entertainment/theater-arts/pass-human-quirky-humorous-guide-robots-article-1.2399309", "country": "US", "title": "‘How to Pass as Human’ is quirky, humorous guide for robots", "performance_score": 0, "site": "nydailynews.com", "participants_count": 1, "title_full": "‘How to Pass as Human’ is quirky, humorous guide for robots - NY Daily News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "97d5306a14a559eef19b527d29b2ff79f26f19c6"}, "author": "NEW YORK DAILY NEWS", "url": "http://www.nydailynews.com/entertainment/theater-arts/pass-human-quirky-humorous-guide-robots-article-1.2399309", "ord_in_thread": 0, "title": "‘How to Pass as Human’ is quirky, humorous guide for robots", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "dark horse books \"How to Pass as Human\" by Nic Kelman is out Oct. 20. It’s a concept we’re all already familiar with, yet it manages to shed light on the issue in a unique, quirky and very comical way.\n“How to Pass as Human: A Guide to Assimilation for Future Androids” tells the story of an android, known as Android 0, and his quest to fit his highly technical and logical mind into our human world. It is told in the form of a notebook log, documented in an attempt to help future androids adjust to human society.\nThe plot of the book deals with an issue we tackle every day, finding a balance between technology and humanity. It just takes a look at the issue at hand from a different point of view, actually going inside the mind (if you can call it a mind) of Android 0, who has chosen to go by the human name of “Zach.”\nThe novel, which mixes Android 0’s journal entries with charts, graphs and keen observations of human interactions and thought processes, was penned by novelist and screenwriter Nic Kelman. He's also an MIT grad, and it becomes very clear in the novel that Kelman has a unique take on what makes us human, from our unique individual habits to our not-so-effective societal norms.\nAndroid 0 dissects basic human functions from how clean we keep our cars to gender roles to the very human phenomenon of desiring what you can’t have. As he notes, “if you are to pass as human one of the earliest paradoxes you must accept as an essential part of human existence is the desire for occurrences you know are impossible.”\nWhen I first picked up the book, I was a little overwhelmed by how it was put together. The collection of charts mixed with a log of Android 0’s everyday life felt a bit confusing and almost like a textbook.\nKelman has a unique take on what makes us human.\nBut it quickly becomes an enjoyable read — the observations the robot makes about humans are at times brutally honest but do still accurately point out how many of the things we do would, in fact, seem ridiculous to an outsider. There’s the thin line between what we find funny and what we find offensive, for example.\nThe storyline that accompanies Android 0’s thoughts and observations is what really makes the novel. It’s a bit of a sci-fi thriller with a bit of a graphic novel-esque feel.\nAn illustration attempts to explain how eye contact and facial expressions communicate the desire for sex. Another page tries to teach androids the distinction between funny and serious. Previous Next Enlarge\nAnd the best part is, we get to see what it would really be like if an Android happened to find himself falling in love. Considering it’s an emotion that still leaves most of humanity stumped, it’s undeniably hysterical to look at the process from the viewpoint of a highly logical machine.\nFOLLOW PAGE VIEWS ON TWITTER\nAnd although he leads the future readers of his notebook to believe he is still unsure if androids are capable of loving humans, or anything for that matter, a major plot twist at the end of Android 0’s story will allow you to draw your own conclusion.\nIn the end, “How to Pass as Human” comes down to a robot’s ability to deal with very human feelings: love, hate and the ability to gauge right from wrong. And how he handles each new emotion is really quite enticing.\n\"How to Pass as Human\" will be out Oct. 20 from Dark Horse.\nTitle: How to Pass as Human Publisher: Dark Horse Genre: Science Fiction Related Stories 'Katherine Carlyle' review: Dazzling journey leaves us lost 'Lightless' offers sci-fi fun with a science twist: review Tags: book reviews", "external_links": ["http://www.penguinrandomhouse.com/books/251243/how-to-pass-as-human-by-nic-kelman/", "http://nkelman.com/", "http://www.twitter.com/nydnbooks"], "published": "2015-10-16T03:00:00.000+03:00", "crawled": "2015-10-16T21:41:21.580+03:00", "highlightTitle": ""}