{"organizations": [], "uuid": "71c19671cbd3df44fd63ab6b498b4d8043ba2d2b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prestwichandwhitefieldguide.co.uk", "main_image": "http://www.prestwichandwhitefieldguide.co.uk/resources/images/4323291/", "site_section": "http://www.prestwichandwhitefieldguide.co.uk/uk_national_entertainment/rss/", "section_title": "Prestwich and Whitefield Guide | National Entertainment News", "url": "http://www.prestwichandwhitefieldguide.co.uk/uk_national_entertainment/13848996.Lamar_Odom__was_using_drugs_at_Nevada_brothel_/?ref=rss", "country": "GB", "title": "Lamar Odom 'was using drugs at Nevada brothel'", "performance_score": 0, "site": "prestwichandwhitefieldguide.co.uk", "participants_count": 0, "title_full": "Lamar Odom 'was using drugs at Nevada brothel'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T09:17:00.000+03:00", "replies_count": 0, "uuid": "71c19671cbd3df44fd63ab6b498b4d8043ba2d2b"}, "author": "", "url": "http://www.prestwichandwhitefieldguide.co.uk/uk_national_entertainment/13848996.Lamar_Odom__was_using_drugs_at_Nevada_brothel_/?ref=rss", "ord_in_thread": 0, "title": "Lamar Odom 'was using drugs at Nevada brothel'", "locations": ["Nevada"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Lamar Odom"], "text": "Lamar Odom 'was using drugs at Nevada brothel' Lamar Odom 'was using drugs at Nevada brothel' \nPress Association 2014 / / National Entertainment News Share \nFormer basketball star and estranged husband of Khloe Kardashian, Lamar Odom, had been using cocaine and sexual performance-enhancing pills before he was found unresponsive in a brothel, according to 911 calls. \nOdom was rushed to hospital on Tuesday after being found by staff at the Love Ranch legal brothel in Crystal, Nevada. \nHe had been using cocaine on Saturday and had taken as many as 10 performance-enhancing tablets over the three days before his collapse, brothel employees told emergency services. Odom used to be an NBA star (Mark J. Terrill/AP) \nKhloe and her sisters Kim and Kourtney, her mother Kris Jenner and half-sister Kendall Jenner are reportedly at Odom’s bedside at Sunrise Hospital in Las Vegas. \nNye County Sheriff Sharon Wehrly told a press conference in Pahrump, Nevada: “At approximately 3.15pm on October 13 2015, a call came into the Nye County Dispatch Centre first from Mitsie John, a Love Ranch employee, and the second caller Richard Hunter, media director for Dennis Hof’s Bunny Ranch, requesting an ambulance for an unresponsive male experiencing a medical emergency at the Love Ranch in Crystal, Nevada, approximately 20 miles north of Pahrump, Nevada, in Nye County. Promoted stories A sign for the Love Ranch brothel where Odom was found unconscious (Chris Carlson/AP) \n“During that call the reporting parties informed the Nye County Sheriff’s Office Dispatch the male had been using cocaine. They confirmed his usage on Saturday, but were unsure if it had continued. They also informed dispatch he had used up to 10 tabs of sexual performance enhancer supplements over the three-day period. He was unconscious, but breathing. He had blood coming from his nose and mouth along with a white substance.” \nSamples of Odom’s blood are yet to be tested by the Las Vegas Metropolitan Police Laboratory, she added. \nMembers of the sheriff’s department were unable to provide information about Odom’s condition but Detective Michael Eisenloffel said contact has been made with one member of the Kardashian family and that the person was “understandably distraught in the circumstances”. Nye County Sheriff Sharon Wehrly spoke at a news conference (Chris Carlson/AP) \nOfficers played the recordings of three 911 calls for the press. In one, Hunter can be heard telling the emergency services dispatcher that Odom is whimpering but appears to be in a deep sleep with white fluids coming out of his nose and mouth. \nRev Jesse Jackson, Los Angeles Lakers star Kobe Bryant and former Chicago Bulls player Mike Brown were among those visiting the hospital on Wednesday. \nBrown told the Press Association: “It is heartbreaking, I couldn’t believe it when I heard, he is just so young. It happens, you’re struggling and fighting for your life and my heart goes out to him.” A room at the Love Ranch brothel and owner Dennis Hof (Chris Carlson/AP) \nHe added: “I didn’t actually see him but I hear from the NBA he’s stable and on a ventilator. The NBA feels real sorrow, it was a situation with Lamar and the things that he was going through lately in his life. You reach out and help him but it was almost something you could see happening but couldn’t prevent. Basically all we can do now is pray for him and hope he bounces back.” \nOdom was suspended during the 2000-01 season for violating the NBA’s anti-drug policy for the second time in eight months. During the 2010-11 season, a cousin he was close to died and Odom was a passenger in a vehicle involved in an accident in New York that killed a cyclist. \nHe was raised by his grandmother after his mother died of cancer when he was 12 and his father was a drug addict. Khloe Kardashian and Lamar Odom in 2012 (Evan Agostini/AP) \nIn 2006, Odom’s six-month-old son Jayden died from sudden infant death syndrome while sleeping in his cot in New York. \nBrown said: “He lost a lot of people, he has more tragedy in his life than normal people, from losing a parent, a grandparent, losing a child early on, losing best friends this summer. It’s a lot to go through and weighs on you. \n“I saw him play as a senior in high school. I was an NBA veteran then and watched a young guy and saw his potential when he was here possibly going to the University of Nevada Las Vegas. I played with him so seeing him in this position so young is heartbreaking. The Kardashian family have rushed to his bedside (Jordan Strauss/Invision) \n“You expect when guys are older to be sick enough to pass away but he’s in that situation and it’s really tough when you’re in your 30s.” \nOdom won two NBA championships with the Lakers in 2009 and 2010 but last played in the NBA in 2013. Share article \nKardashian filed for divorce in 2013, citing irreconcilable differences but it has reportedly not yet been finalised. The two were married in 2009 in a televised ceremony. Promoted Stories", "external_links": [], "published": "2015-10-15T09:17:00.000+03:00", "crawled": "2015-10-15T16:05:05.859+03:00", "highlightTitle": ""}