{"organizations": [], "uuid": "57f5dcbe56e0a471609cf92655de94cda12a79d9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-561c1a52/turbine/ct-abbott-heart-attack-test-1013-biz-20151012", "site_section": "http://www.chicagotribune.com/", "section_title": "Chicago Tribune: Chicago breaking news, sports, business, entertainment, weather and traffic - Chicago Tribune", "url": "http://www.chicagotribune.com/business/ct-abbott-heart-attack-test-1013-biz-20151012-story.html", "country": "US", "title": "Having chest pain? New Abbott test could rule out heart attack faster - Chicago Tribune", "performance_score": 0, "site": "chicagotribune.com", "participants_count": 1, "title_full": "Having chest pain? New Abbott test could rule out heart attack faster - Chicago Tribune", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T23:29:00.000+03:00", "replies_count": 0, "uuid": "57f5dcbe56e0a471609cf92655de94cda12a79d9"}, "author": "John Russell", "url": "http://www.chicagotribune.com/business/ct-abbott-heart-attack-test-1013-biz-20151012-story.html", "ord_in_thread": 0, "title": "Having chest pain? New Abbott test could rule out heart attack faster - Chicago Tribune", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A new blood test developed by Abbott Laboratories in Chicago could help emergency room doctors determine more quickly whether someone suffering from chest pains is having a heart attack, a new study says.\nChest pains account for about 6 million visits to emergency rooms in the U.S. annually. But doctors often have to run multiple blood tests, requiring 12 hours, to rule out a heart attack, and sometimes admit patients unnecessarily.\nA study published in the British medical journal The Lancet says a new, high-sensitivity blood test made by Abbott could rule out a diagnosis of heart attack for two-thirds of people showing up in emergency rooms with chest pains. That could double the number of patients suitable for immediate discharge, the study says.\n\"These findings could dramatically reduce unnecessary hospital admissions and provide substantial cost savings for healthcare providers,\" the study's authors wrote.\nOver the past two decades, the number of hospital admissions due to chest pain has tripled, the study said, but the overwhelming majority of patients did not have a heart attack.\nCurrently, doctors order a blood test when patients show up with chest pains to measure the level of a protein called troponin. The body releases high levels of troponin into the bloodstream during a heart attack.\nFinding high levels of troponin in blood tests means a patient needs to be admitted. Low levels mean the patient is at low risk of a heart attack and can be discharged.\nBut blood tests now on the market do not measure low levels well, and doctors often order repeat tests to make sure the patient is not at risk for a heart attack, said Dr. David Spindell, vice president of medical affairs for Abbott's diagnostics division.\n\"If the test is positive, meaning above the cutoff for heart attacks, then the doctors know what's going on,\" Spindell said. \"If it's below, because it doesn't measure low values that well, you'd have to get a repeat blood test, usually in around six hours, and in some cases, another blood test in 12 hours, to make sure that patient isn't having a heart attack.\"\nThe new test is similar to the existing tests but can measure lower levels with greater precision, he said.\nThe test is being sold in Europe and Canada, but not yet in the U.S., where it is still awaiting FDA approval, he said.\nThe study tested troponin levels in more than 6,000 patients with chest pains admitted to four hospitals in Scotland and the United States. The study was funded by a grant from the British Heart Foundation.\nAbbott said it helped fund the study and provided test equipment but did not set up the testing protocols or analyze the data.\njrussell@tribpub.com\nTwitter @johnrussell99\nCopyright © 2015, Chicago Tribune Medical Research Healthcare Providers Business", "external_links": ["http://www.trbimg.com/img-561c1a52/turbine/ct-abbott-heart-attack-test-1013-biz-20151012"], "published": "2015-10-12T23:29:00.000+03:00", "crawled": "2015-10-13T14:09:42.818+03:00", "highlightTitle": ""}