{"organizations": [], "uuid": "89d19fae403f0d3e3ccb6baaa525f7bfef52e261", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.examiner.com", "main_image": "http://cdn2-b.examiner.com/sites/default/files/styles/image_content_width/hash/c5/d3/c5d3fc7b31dcb221d8d822714a6b4139.jpg?itok=q8C3Lnl6", "site_section": "http://www.examiner.com/arts-and-entertainment", "section_title": "Arts &amp; Entertainment | Examiner.com", "url": "http://www.examiner.com/article/black-fly-lands-on-itunes-canada", "country": "US", "title": "'Black Fly' lands on iTunes Canada", "performance_score": 0, "site": "examiner.com", "participants_count": 1, "title_full": "'Black Fly' lands on iTunes Canada | Examiner.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T19:21:00.000+03:00", "replies_count": 0, "uuid": "89d19fae403f0d3e3ccb6baaa525f7bfef52e261"}, "author": "Ed Moy", "url": "http://www.examiner.com/article/black-fly-lands-on-itunes-canada", "ord_in_thread": 0, "title": "'Black Fly' lands on iTunes Canada", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Play Black Fly official movie trailer Gold Star Productions Inc. A troubled teenager reconnects with his older brother, setting off a powder keg of buried secrets, paranoia and murder in \" Black Fly \" from writer-director Jason Bourque.\nGold Star Productions Inc. Inspired by true events, \"Black Fly\" was inspired by Bourque’s experiences growing up close to a serial killer in rural New Brunswick.\n“My parents were convinced the quiet, picturesque Kingston Peninsula was the ideal place to raise a family. They were horribly mistaken. Our neighbor, Noel Winters, was a serial killer,” Bourque states.\n\"Black Fly\" is Bourque’s first feature script, written after he completed the Vancouver Film School’s one year foundation program back in 1996.\nIronically it was one of the first scripts read by producer Ken Frith (Music For Mandela) who met Bourque while taking the same program. With a long resume of international documentaries, series and television movies , the film marks Bourque’s first foray into theatrical feature films as a writer and director.\nProduced by Ken Frith and Robyn Wiener (Lawrence and Holloman, American Mary), the film stars Matthew MacCaull (Tomorrowland) as Noel, Dakota Daulby (Falling Skies) as Jake and Christie Burke (Twilight: Breaking Dawn) as Paula. The film production team includes award-winning cinematographer Mahlon Todd Williams (Vendetta, See No Evil 2 and Leprechaun: Origins) and production designer Paul McCulloch (Grave Encounters 1 and 2).\nProduced with the generous participation of Telefilm Canada and Rogers Telefund and in association with Super Channel, the film was recently nominated for 10 Leo Awards and won Best Male Performance in a Feature for Matthew MacCaull.\nHere's the synopsis:\nSet in 1984, Jake and Noel are estranged brothers haunted by a troubled past. In the years since their father died in a hunting accident, they’ve lost touch with one another. After escaping from his abusive uncle, Jake seeks refuge with Noel who now lives with his girlfriend Paula in the old family farmhouse. Located on an isolated island, it’s the perfect place to find solace and reconnect after years of separation. Or so Jake thinks… Soon after his arrival, Jake is propelled into a nail-biting nightmare of buried secrets, paranoia and murder. In director Jason Bourque’s visceral backwoods thriller, blood is indeed thicker than water. And it’s messy as hell.\nTo see the film visit iTunes: http://apple.co/1QlSnwH\nFor more details visit: http://www.blackflythemovie.com", "external_links": ["http://apple.co/1QlSnwH"], "published": "2015-10-18T19:21:00.000+03:00", "crawled": "2015-10-18T20:52:47.554+03:00", "highlightTitle": ""}