{"organizations": [], "uuid": "9324f19e4d81004c255194c00a4f712e054e2116", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.india.com", "main_image": "http://s3.india.com/wp-content/uploads/2015/10/ghulam-ali4.jpg", "site_section": "http://www.india.com/feed/", "section_title": "India | Latest India News | Get Free India.com Email | Live Cricket and Entertainment News at India.Com", "url": "http://www.india.com/news/india/ghulam-ali-refused-in-mumbai-invited-by-delhi-10-latest-developments-613647/", "country": "US", "title": "Ghulam Ali refused in Mumbai, invited by Delhi: 10 latest developments", "performance_score": 0, "site": "india.com", "participants_count": 1, "title_full": "Ghulam Ali refused in Mumbai, invited by Delhi: 10 latest developments", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T16:52:00.000+03:00", "replies_count": 0, "uuid": "9324f19e4d81004c255194c00a4f712e054e2116"}, "author": "Mohammed Uzair Shaikh", "url": "http://www.india.com/news/india/ghulam-ali-refused-in-mumbai-invited-by-delhi-10-latest-developments-613647/", "ord_in_thread": 0, "title": "Ghulam Ali refused in Mumbai, invited by Delhi: 10 latest developments", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ghulam Ali refused in Mumbai, invited by Delhi: 10 latest developments By Mohammed Uzair Shaikh on October 8, 2015 at 7:22 PM Comments \nNew Delhi, Oct 8: Gazal maestro Ghulam Ali’s much awaited concert was called off in Mumbai following strong objection raised by Shiv Sena. The far-right political outfit intimidated the organizers, sternly warning them not to invite the ‘Pakistani’ artist for the event. The concert planned to be held in Mumbai and Pune was subsequently called off. Justifying its actions, Shiv Sena maintained that their disapproval to host the legendary singer was an act of expressing solidarity with the Indian soldiers who are recipient of unprovoked aggression from the other side of the border. \n(ALSO READ: Ghulam Ali open to AAP government’s offer; agrees to perform in Delhi if invited) \nHere are the 10 latest developments of the day: \n1. Following cancellation of the concert in Mumbai, organizer Randhir Roy decided to call off the event in Pune as well. It was scheduled to be held on Saturday. \n2. After receiving flak from the civil society, Shiv Sena deployed its youth face Aditya Thackeray to justify their actions. Addressing media earlier in the day, Aditya said, “We all love to hear Ghulam Ali’s gazals. But we also need to show some sensitivity towards our soldiers who are killed at the borders. When there are constant ceasefire violations, our jawans are beheaded; we cannot be having fun with them.” \n3. Aam Aadmi Party condemned the actions of Shiv Sena and invited Ghulam Ali to the national capital. “Sad that Ghulam Ali is not being allowed in Mumbai, I invite him to come to Delhi and do the concert. Music has no boundaries,” said Delhi’s cabinet minister Kapil Mishra. \n4. Ghulam Ali responds to invitation from AAP. The Pakistani singer said that he would love to perform in the Indian national capital. He also expressed disappointment over the cancellation of events, saying, “Artists should not be turned victims of politics.” \n5. Members of film fraternity made their dissent known against the actions of Shiv Sena. Veteran actress Shabana Azmi, music composers Vishal Dadlani and Shekhar Ravjiani have criticised the cancellation of Pakistani singer Ghulam Ali’s concert here following Shiv Sena’s threat to disrupt it. \n6. “Are we at war with Pakistan? Have we severed diplomatic relations? Have we closed down our Embassies? Then what justification is there to ban Ghulam Ali? “Ghulam Ali was to perform in commemoration of India’s beloved Jagjit Singh in a gesture of goodwill,” said Shabana Azmi. \n7. Shiv Sena said they will continue to oppose Pakistani actors, artists and cricketers and ensure they are not allowed to participate in any cultural, sport or artistic event. \n8. “There have been changes in Chitrapat Sena’s (Shiv Sena cinema wing) working committee recently and the newly formed team will be more active in opposing Pakistani actors, cricketers, singer and other artists till Islamabad stops sponsoring terrorism against India from its soil,” said Akshay Bardapurkar, while speaking to India.com. \n9. Following invitation from Delhi government, West Bengal chief minister Mamata Banerjee too offered to host a concert in Kolkata. “Music has no boundaries. Music is the rhythm of the heart. Ghulam Ali concert can be held in Kolkata. We will make arrangements for that,” she added. \n10. At the centre of controversy, Ghulam Ali has responded in a positive manner. Although, he did not make any commitment, he assured that he would come to India and perform, if people would want so. “Wherever I am called, I will come.” \n 22 PM Topics:", "external_links": [], "published": "2015-10-08T16:52:00.000+03:00", "crawled": "2015-10-08T17:18:06.321+03:00", "highlightTitle": ""}