{"organizations": ["The New York Times", "Playboy", "UNITED KINGDOM"], "uuid": "3fde78820998d1625ee5b843627aed6dc3604952", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.actionnewsjax.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/10/13/87/3a/7035541618a542c8a807a9970748f7f1-cbd9bf8dfae441a8964b5566f039e39d-0.jpg", "site_section": "http://www.actionnewsjax.com/list/rss/ap/entertainment/latest-entertainment-news/atk/", "section_title": "Latest in Entertainment", "url": "http://www.actionnewsjax.com/ap/ap/entertainment/report-playboy-to-end-publishing-fully-nude-female/nn2Lq/", "country": "US", "title": "Playboy to stop running pictures of completely naked women", "performance_score": 0, "site": "actionnewsjax.com", "participants_count": 0, "title_full": "Playboy to stop running pictures of completely naked women", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T19:22:00.000+03:00", "replies_count": 0, "uuid": "3fde78820998d1625ee5b843627aed6dc3604952"}, "author": "", "url": "http://www.actionnewsjax.com/ap/ap/entertainment/report-playboy-to-end-publishing-fully-nude-female/nn2Lq/", "ord_in_thread": 0, "title": "Playboy to stop running pictures of completely naked women", "locations": ["Los Angeles"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hugh Hefner", "Cory Jones"], "text": "Updated: 12:22 p.m. Tuesday, Oct. 13, 2015 | Posted: 12:22 p.m. Tuesday, Oct. 13, 2015 Playboy to stop running pictures of completely naked women View Larger In this Nov. 15, 2007 photo, Hugh Hefner smiles while signing copies of the Playboy calendar and Playboy Cover To Cover: The 50's DVD box set in Los Angeles. Playboy will no longer publish photos of nude women as part of a redesign of the decades-old magazine, according to a news report Monday, Oct. 12, 2015. Executives for the magazine company told The New York Times that the change will take place in March 2016. Playboy editor Cory Jones contacted founder and current editor in chief Hugh Hefner recently about dropping nude photos from the print edition and he agreed, the Times reported. (Ian West/PA via AP) UNITED KINGDOM OUT Sponsored Links The Associated Press NEW YORK — \nPlayboy is about to find out how many people really do read it for the articles. \nThe magazine that helped usher in the sexual revolution in the 1950s and '60s by bringing nudity into living rooms — or at least sock drawers — all over America announced Tuesday that it will no longer run photos of completely naked women. \nPlayboy has seen an extreme drop in circulation over the past few decades, falling victim to some of the very forces it helped set in motion. First it had to deal with competition from more sexually explicit magazines like Penthouse and Hustler. Now the Internet is awash in high-definition porn. \nThe magazine has decided that the answer is less skin, not more. \n\"You're now one click away from every sex act imaginable for free. And so it's just passé at this juncture,\" Playboy Enterprises CEO Scott Flanders told The New York Times. \nStarting in March, Playboy's print edition will still feature women in provocative poses, but they will no longer be fully nude. It will become more like Esquire and other magazines with PG-13-type pictures. \nPlayboy has not yet decided whether it will still have a centerfold, according to the Times. \nThe change represents a major shift for the magazine, which broke new ground when Hugh Hefner created it and featured Marilyn Monroe on its debut cover in 1953. It marks the latest step away from depictions of full nudity, which were banned from the magazine's website in August 2014. \nThe magazine said its website audience soared with that move, averaging a fourfold increase in monthly unique visitors. \n\"The political and sexual climate of 1953 ... bears almost no resemblance to today,\" Flanders said. \"We are more free to express ourselves politically, sexually and culturally today, and that's in large part thanks to Hef's heroic mission to expand those freedoms.\" \nPlayboy editor Cory Jones recently contacted Hefner about dropping nude photos from the print edition and he agreed, the Times reported. \nPlayboy's print circulation, measured at 5.6 million in the 1975, is now about 800,000, according to Alliance for Audited Media, the newspaper reported. \nThe shift from nudity will be accompanied by other changes in the magazine, including a slightly larger size and a heavier, higher quality of paper meant to give the magazine a more collectible feel. Copyright The Associated Press Sign up for our Daily Headlines Newsletter Sign Up", "external_links": [], "published": "2015-10-13T19:22:00.000+03:00", "crawled": "2015-10-13T20:16:26.306+03:00", "highlightTitle": ""}