{"organizations": [], "uuid": "0f3dea012c1ed4fa45e14f05d4c95bd7d42fa88a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.democratandchronicle.com", "main_image": "http://www.gannett-cdn.com/-mm-/91031da0f9c01b13d402717175e8c9c7f18fa013/c=0-110-2397-1464&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/16/USATODAY/USATODAY/635805974775461004-XXX-David-Muir001.jpg", "site_section": "http://www.democratandchronicle.com/", "section_title": "Democrat and Chronicle | Rochester news, community, entertainment, yellow pages and classifieds. Serving Rochester, New York | democratandchronicle.com", "url": "http://www.democratandchronicle.com/story/money/2015/10/18/abc-news-evolves-anchor-muir-amid-stiff-competition/74003184", "country": "US", "title": "ABC News evolves with anchor Muir amid stiff competition", "performance_score": 0, "site": "democratandchronicle.com", "participants_count": 1, "title_full": "ABC News evolves with anchor Muir amid stiff competition", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T17:04:00.000+03:00", "replies_count": 0, "uuid": "0f3dea012c1ed4fa45e14f05d4c95bd7d42fa88a"}, "author": "democratandchronicle.com", "url": "http://www.democratandchronicle.com/story/money/2015/10/18/abc-news-evolves-anchor-muir-amid-stiff-competition/74003184", "ord_in_thread": 0, "title": "ABC News evolves with anchor Muir amid stiff competition", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK — Earlier this year, David Muir spent weeks studying Spanish in anticipation of his August interview with Pope Francis, sitting down with a tutor several hours a week and practicing the language while strolling the streets of Manhattan. The 41-year-old anchor of ABC's World News Tonight spent a semester in Salamanca, Spain, as a college student, and a rusty bit of the language was still rattling around in his head. But being able to make small talk in the pope’s native tongue more proficiently, Muir figured, might trigger flashes of clarity about the man who had never before given an interview to a U.S. TV network.\nGood thing, too. The pope wasn’t about to conduct an interview without a quick measure of the man who would query him for an hour. “We're inside the Vatican walls and they send me outside to this courtyard and tell me the pope is going to emerge any second,\" Muir tells me in his Manhattan office. \"I'm standing there. And about 20 minutes go by, and the door opens. Instead of the pope, I get one hand that waves me in. So I walk through the door and standing right behind the door was Pope Francis. He simply wanted to meet me before we get in front of all these cameras. I knew I had only those few moments to put him at ease.”\nMuir’s first words: “Su santidad. Es un honor concerlo.” (Your Holiness, it’s an honor to meet you.)\nMuir’s preparation for the interview — a big coup for the network before the pope’s visit to the U.S. in September — is characteristic of the all-consuming ardor with which he approaches his job, colleagues and current and former bosses say.\nThe dapper newsman was named anchor of World News Tonight a year ago, slipping into the august chair once occupied by the likes of Peter Jennings, Diane Sawyer and Frank Reynolds. And the show, colleagues and bosses say, has shifted to reflect Muir’s restless pace, love of storytelling and penchant for on-site reporting.\n“He’s the epitome of what a modern anchor needs to be,\" says James Goldston, president of ABC News, who appointed Muir to the job. \"He’s happy shooting on his little camera or cellphone.”\nThe Syracuse native was clearly groomed for the job, anchoring on weekends for nearly three years and racking up frequent-flier miles with reporting assignments around the globe. But his appointment also speaks volumes about ABC bosses’ desire to reinvigorate the program, attract younger viewers and increase its audience through social media and compelling video — an approach that may appeal to fast-churn audiences but alarm traditionalists.\n“He was a natural choice,” Goldston says. “He’s been preparing for this a long time. It wasn’t a difficult decision.”\nUSA TODAY\nABC News beats rivals for first time in five years\nWorld News Tonight has gained about 500,000 viewers since Muir’s arrival, a metric that the Disney-owned network likes to trumpet as Muir enters his second year in the job. But the program still trails perennial leader NBC News, even as NBC had to introduce a new anchor, Lester Holt, in July after Brian Williams was demoted for lying.\n“I’d be lying if I didn’t acknowledge that I feel personally some of that pressure,” Muir says. “But this is the most competitive evening news race in a decade, and it’s upping everyone’s game.”\nNews junkie from Upstate New York\nGreeting a reporter in a pair of desert boots and straight-fit jeans, Muir looks every part the youthful, smartphone-era news anchor he’s been marketed to be. References to his bountiful hair and central-casting looks are plastered all over the Internet. Talk-show host Bill Maher once called him the “Ken Doll” anchor.\nBut he’s no broadcasting ingenue. Like Jennings, Muir’s interest in TV journalism was sparked early. As a kid, he watched local news religiously and liked to play reporter, interviewing his sister’s friends. He wrote to local TV stations, and CBS affiliate WTVH gave him an internship after he turned 13. He continued to work there during school breaks and was hazed by staffers with a growth chart, he says.\n“What drew me to that was the notion that these journalists were out there seeing the world,” Muir says. “I did see the power in the storytelling and that they were seeing it firsthand.”\nAnd he’s always been a storyteller. “When she’d get home from work, my mom would say, ‘Can you just give me 5 minutes?’ because I’d be waiting at the door with a million stories.”\nMuir was hired by the station before he graduated from Ithaca College. After five years there, WCVB in Boston hired him as weekend anchor. Candy Altman, vice president at Hearst Television who hired Muir at WCVB, recalls reviewing piles of tapes but not being satisfied with the candidates. Muir’s tape caught her eye because it “didn’t look like it was prepared by an agent.” (Muir says he didn’t have an agent at the time.)\n“As soon as I started looking at it, wow,” she says. “He was still not polished yet as an anchor. But there was just something about the way he communicates and his reporting.”\n“David knows how to get people to talk to him,\" Altman adds. \"Getting people to trust you and open up to you is a skill, and David has that skill.”\nDavid Muir is the anchor of ABC World News Tonight. (Photo: Todd Plitt, USA TODAY)\nHis ambition was evident early on. He was a “go-getter,” Altman says. His work covering the wars in Iraq and Afghanistan — Muir was reporting from Doha, Qatar — was noticed by ABC network officials and was likely a catalyst in his jump to the network, Altman says.\n“I'm sure I was being watched and scrutinized,” Muir says.\nABC hired him in August 2003, and he soon became one of the network's most highly traveled correspondents, reporting from all the hot spots — New Orleans during Katrina, Mogadishu, Fukushima, Tahrir Square in Egypt.\nSawyer, who preceded Muir, says Muir’s deep and wide involvement in story production stood out. “I see his energy everywhere,” she says. “He has an unequal stamina.”\nMuir’s rapid ascent at ABC News at a relatively young age has raised some eyebrows among media critics. “The reductio ad absurdum of the good-looking white-male anchor is David Muir,” wrote media critic Frank Rich in a New York magazine piece that lamented the decline of network evening news. “His relatively modest reporting résumé didn’t even include a stint as a White House correspondent.”\n“Muir’s World News Tonight takes the network anchor’s role back full circle to its origins — a smooth newscaster hopscotching the world for headlines,” he wrote.\nKate O’Brian, president of Al Jazeera America who worked with Muir in her prior job as senior vice president of ABC News, doesn’t buy that interpretation. Muir’s on-camera cool belies his immersive style, she says. “If he weren’t interested (in being) on camera, he’d be an unbelievable executive producer,” she says. “When he was a reporter, he’d never turn down an assignment.”\nAs the anchor, Muir is stuck to his desk more often now, a job requirement that has not been easy for him. When asked to self-assess what he has uniquely brought to the show, he replies his desire and ability \"to relate and connect with people,\" mentioning the 'Made in America' series — profiles of manufacturers with products made here — as an example. He says he tweets during commercial breaks to solicit comments.\nMore broadly, ABC News’ quickened style also feeds into the traditionalists’ fears that the network evening newscasts — the profession’s standard-bearer — are, as a group, taking a video and social media-centric turn that softens the definition of news.\nAndrew Tyndall, an analyst who watches evening news programs and sells content data to TV networks, says World News Tonight is now airing a “non-traditional newscast” under Muir. (Tyndall’s customers include NBC News and CBS News, but not ABC News.)\n“It has a different sense of what news is,” he says. “They’re not using TV to cover general stories. They’re looking for what has most TV appeal and downplaying the stories that don’t. If you want to get major stories of the day, you don’t go to ABC.”\nMuir scoffs at such criticism, citing his reports from the Hungarian border covering Syrian refugees and the work of ABC colleagues who were recently in Damascus. “I think you’d be hard-pressed to tell them what they're doing is soft news,” he says. “I think it's easy for people to say that because they are not the ones out there putting their lives in danger.”\nStill, the criticism hurled at ABC News and its competitors underscores the agitated state of the journalistic institution that is battling irrelevance even as millions of viewers tune in. Anchors' relatability and accessible social media habits won't sway the weakened fundamentals of the business — that younger viewers are increasingly getting their news elsewhere. Muir will get his shot to defy the notion. Time, his boss says, will be on his side.\n\"He's there for the long haul,\" Goldston says.", "external_links": ["http://www.gannett-cdn.com/media/2015/10/16/USATODAY/USATODAY/635805974776397010-XXX-David-Muir014.jpg", "http://www.usatoday.com/story/money/2015/04/07/abc-world-news-beats-nbc-news/25407361/", "http://nymag.com/daily/intelligencer/2015/04/anchors-network-news.html", "http://www.gannett-cdn.com/-mm-/b2e9b23cd767d8a10443c055f0220c24d0200e88/r=266x400/local/-/media/2015/10/16/USATODAY/USATODAY/635805974776397010-XXX-David-Muir014.jpg", "http://www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/45591ae623658833fd47a8ddbf4453acdde8bed0/c=0-0-1992-1992/local/-/media/2015/04/07/USATODAY/USATODAY/635640036373913211-AP-TV-ABC-DAVID-MUIR-66821756.JPG", "http://www.gannett-cdn.com/-mm-/3ba563c2b9ac363c17f8883eda8b61bb95abb472/c=0-125-1500-2125&r=183&c=0-0-180-240/local/-/media/2015/10/16/USATODAY/USATODAY/635805974776397010-XXX-David-Muir014.jpg"], "published": "2015-10-18T17:04:00.000+03:00", "crawled": "2015-10-19T02:08:21.752+03:00", "highlightTitle": ""}