{"organizations": ["Arlington Heights Historical Society"], "uuid": "115a7864f1b84a94ff79b12eb7a4be9c131e7375", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailyherald.com", "main_image": "http://www.dailyherald.com/storyimage/DA/20151011/entlife/151019983/AR/0/AR-151019983.jpg&amp;updated=201510091407&amp;imageversion=Facebook&amp;exactH=630&amp;exactW=1200&amp;exactfit=crop&amp;noborder", "site_section": "http://www.dailyherald.com/rss/feed/?feed=entlife", "section_title": "DailyHerald.com &gt; Life &amp; Entertainment", "url": "http://www.dailyherald.com/article/20151011/entlife/151019983/", "country": "US", "title": "Show off your artistic skills at Festival of Wreaths", "performance_score": 0, "site": "dailyherald.com", "participants_count": 0, "title_full": "Show off your artistic skills at Festival of Wreaths - DailyHerald.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T15:00:00.000+03:00", "replies_count": 0, "uuid": "115a7864f1b84a94ff79b12eb7a4be9c131e7375"}, "author": "", "url": "http://www.dailyherald.com/article/20151011/entlife/151019983/", "ord_in_thread": 0, "title": "Show off your artistic skills at Festival of Wreaths", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "If you want to show off your artistic skills, the Arlington Heights Historical Society invites everyone, regardless of residence, to enter its first Festival of the Wreaths.\nYour entry does not have to be holiday inspired. In fact, the wreath that the historical society displays as an example -- called Quintessential Arlington Heights -- shows framed pictures of the village in different seasons. And it is square, not round.\nThe deadline for registering is Friday, Oct. 16; visit www.ahmuseum.org/festivalofwreaths.htm.\nCompleted wreaths must be delivered to the Arlington Heights Historical Museum, 110 W. Fremont St., by Friday, Oct. 30.\nThere is no entry fee; the wreaths will be judged for gift certificate prizes and auctioned to benefit the society.\nTo get your creative juices flowing, Barbara Ottolino of The Cultivated Choice in Arlington Heights will present \"Seasonal Wreaths\" at 2 p.m. today, Sunday, Oct. 11, at the Arlington Heights Memorial Library, 500 N. Dunton Ave. Advance registration appreciated but not required; Visit www.ahml.info/content/adult-tbd-123.\nOn Tuesday, Oct. 13, the society invites you to bring your materials to the museum from 7 to 8:30 p.m., and volunteers will help you get started with your wreath.\nA selection of wreaths entered in the festival will be displayed at the library for about 10 days in early November. Entrants will be invited to a preview party on Saturday, Nov. 21.\nThe public will be invited to see the wreaths and drink hot cider at the museum after the village's traditional tree-lighting ceremony Friday, Nov. 27, in North School Park, Eastman Street and Arlington Heights Road. The silent auction for the wreaths will start that night and continue Saturday, Nov. 28, and Sunday, Nov. 29, at the museum. As the weekend approaches, the society will post more information on its website, www.ahmuseum.org.\nRelated Article\nWreaths a natural decor item for autumn, holidays Life & Entertainment Arlington Heights Decor", "external_links": ["https://twitter.com/share"], "published": "2015-10-11T15:00:00.000+03:00", "crawled": "2015-10-11T20:31:24.959+03:00", "highlightTitle": ""}