{"organizations": [], "uuid": "466188ff52723e8263809023bdef84dceb8df32e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailytelegraph.com.au", "main_image": "http://cdn.newsapi.com.au/image/v1/866bc17547cdd618671a1336917809fb", "site_section": "http://www.dailytelegraph.com.au/entertainment/arts", "section_title": "Arts | Arts and Culture | Sydney Arts Entertainment | dailytelegraph.com.au", "url": "http://www.dailytelegraph.com.au/entertainment/sydney-confidential/i-can-switch-off-and-be-a-good-mother-cate-blanchett-on-juggling-her-hollywood-career-with-motherhood/story-fni0cvc9-1227580805698", "country": "US", "title": "Cate Blanchett stars in Carol lesbian film and Truth", "performance_score": 0, "site": "dailytelegraph.com.au", "participants_count": 1, "title_full": "Cate Blanchett stars in Carol lesbian film and Truth | DailyTelegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T08:30:00.000+03:00", "replies_count": 0, "uuid": "466188ff52723e8263809023bdef84dceb8df32e"}, "author": "VERONICA PARKER", "url": "http://www.dailytelegraph.com.au/entertainment/sydney-confidential/i-can-switch-off-and-be-a-good-mother-cate-blanchett-on-juggling-her-hollywood-career-with-motherhood/story-fni0cvc9-1227580805698", "ord_in_thread": 0, "title": "Cate Blanchett stars in Carol lesbian film and Truth", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SHE’S just been honoured for outstanding contributions to film, but Cate Blanchett says acting is still giving her the same kind of kicks it did when she started in the business.\n“I’m almost afraid to admit that I love it more than ever,” Blanchett says.\n“Being able to create and play characters and let my imagination flow is something I have always enjoyed. Acting fulfils me in so many ways and it gives my life the kind of balance I need so that when I come home I can switch off and be a good mother.\n“I’ve always been able to maintain a certain distance from my work and I never bring home my work and those intense emotions you often experience on the set. I leave that for audiences.”\nRooney Mara and Cate Blanchett attend the Carol premiere during the BFI London Film Festival. Picture: John Phillips/Getty Images The 46-year-old is proving herself to be one of the most gifted actors alive. Last weekend she was awarded the British Film Institute fellowship for outstanding contributions to film — the latest in a long line of prominent actors to receive the honour.\nThe Melbourne-born actor also has two new movies set for release this year — Carol and Truth. There is now intriguing speculation as to which of Blanchett’s performances may eventually have her in the running for a third Oscar, with Academy Awards rules only allowing for one nomination per category.\n In addition, she has two new Terence Malick films in the pipeline — Knight Of Cups, co-starring Christian Bale and Natalie Portman and another as yet untitled project in a complex love story opposite Michael Fassbender and her Carol co-star, Rooney Mara.\nCate Blanchett with husband Andrew Upton and son Dashiell, participating in the Walk Against Warming from Martin Place to the Royal Botanical Gardens in Sydney in 2006. Picture: Supplied There have also been reports Blanchett will play Lucille Ball in a new film. But she says discussions are still in their early stages.\nTruth — a drama centred around the notorious 2004 CBS news report that questioned then US president George W Bush’s National Guard service record — premiered recently at the Toronto and New York film festivals. In the film, Blanchett plays 60 Minutes producer Mary Mapes who, along with respected news anchor Dan Rather, was dismissed in the fallout from the scandal.\nMORE STORIES\nWHY STELLAR KELLER’S STAR IS STILL RISING\nROSE BYRNE SHOWS BABY BUMP\nCarol — a romantic drama that sees Blanchett play a married woman in the 1950s who risks everything when she falls in love with a female department store clerk (Mara) — received rave reviews at the Cannes Film Festival.\nBlanchett, who attended premieres for both films last week, says she is enjoying “one of the best times” in her life.\nShe and her writer/director husband of 17 years, Andrew Upton, 49, now live in New York, having recently sold their home in Hunters Hill, an exclusive Sydney neighbourhood, for a reported $20 million. They have four children — sons Dashiell, 13, Roman, 11, and Ignatius, 7, and newly adopted baby daughter Edith.\n“I’ve taken them on set with me and they know about Mummy’s job,” Blanchett says.\n“What they love most is watching the crew and all the people running about on a set. Their understanding of films is from watching all the work and organisation that goes into the process, rather than just seeing things from the view point of the actors and the final product.”\nThe actor says she has turned down roles to maintain a balance between her career and duties as a mother. Picture: Getty Like all working mums, Blanchett juggles her career with raising children. “It’s always going to be a matter of deciding which film you feel you absolutely need to do and how sometimes you may be involved in other things, like when Andrew and I were running the (Sydney) Theatre Company and I had to turn down certain roles,” she says.\n“You also want to spend as much time as you can enjoying your life with your family and watching your kids grow up. My children are always surprising me and they will come up and say incredible things that just make me see how fast they’re learning and much more aware than you imagine.”\nBlanchett is taking a break from the Sydney Theatre Company, where Upton will finish up next year as artistic director, freeing up her time to “enjoy daily life more”.\n“My days are free when I’m not making a film and I can spend time doing very ordinary things at home like cooking and reading or preparing dinner for the children,” she says. “It’s very important to me to be able to have that kind of life away from my work.”\nBlanchett admits she tries not to spoil her children and credits them with having developed a good sense of what’s important in life.\n“Our eldest, Dashiell, is often carrying a backpack filled with heavy school books. Last Christmas we decided to give him an ebook reader so he can read his textbooks in digital format. But he didn’t want it. He told me that he prefers to have the physical book because he loves the smell of the paper.”\nCate Blanchett with her Truth co-star Robert Redford. Picture: Getty Carol is based on the 1952 novel The Price Of Salt, by Patricia Highsmith, more famous for Strangers On A Train, adapted for the screen by Alfred Hitchcock.\nThe scandalous novel about a lesbian relationship was originally published under a pseudonym. Blanchett dropped a bombshell in an interview with Variety magazine in May when she revealed she’d had intimate relationships with women in the past.\nBlanchett was asked whether this was her “first turn as a lesbian” when she gave interviewer Ramin Setoodeh a coy smile.\n“On film, or in real life?” she replied. Clearly not expecting the candid revelation, Setoodeh asked if she’d had relationships with women.\nBlanchett replied, “Yes. Many times.” She declined to elaborate.\nIn August, Quentin Tarantino, the outspoken director of Pulp Fiction and Reservoir Dogs, took aim at Blanchett’s film choices in an interview with New York magazine. “Half of these Cate Blanchett movies, they’re all just like these arty things,” Tarantino said. “I’m not saying they’re bad movies, but I don’t think most of them have a shelf life.”\nBlanchett poses for photographers as she attends the BFI London Film Festival Awards in London last week. Picture: AFP Blanchett says she relies on instinct as much as ever when choosing roles.\n“It’s something very visceral with me. Whenever I play a character, I need to make it mine,” she says. “But the process involved in that also still terrifies me, but it’s the only way I know.\n“It was the same thing when I met my husband Andrew. We had known each other only three weeks when he asked me to marry him. But I said yes because I knew it was the right thing. And 18 years later we’re still together. We both believe in destiny and the kind of adventure that comes from a decision taken very quickly.”\nBlanchett says that in the case of living characters, like that of Mary Mapes in Truth, she wants to play them as honestly and fairly as possible.\nNot only does Blanchett revel in this kind of role, but the intensity of her work even manages to overshadow her legendary co-star Robert Redford (who plays Dan Rather).\n“I was anxious to reveal how Mary was an incredibly dynamic and courageous woman. She was an acclaimed producer who had previously done a major story on Abu Ghraib and had produced many other groundbreaking reports,” Blanchett says.\n“What shocked and horrified me was the level of vicious personal attacks made against her after the (Bush National Guard) story had aired and was later retracted. When I watched some of the interviews she gave in the aftermath, she looked very hurt and worried. She had lost her job and went into free fall. That was the kind of journey I had to take in portraying her.\n“I admired her courage and strength of character in the face of very severe criticism.\n“I am constantly drawn to playing women who stand up for themselves and especially those who rebel against injustice and in many cases the unfair treatment and extreme pressure they face as women.”\nTruth opens December 3.\nCarol opens Boxing Day.", "external_links": ["http://cdn.newsapi.com.au/image/v1/817940d5a1817da9a5247995cd74ad39?width=650", "http://cdn.newsapi.com.au/image/v1/d07fb35244d38b4376121ae1a539a45d?width=650", "http://cdn.newsapi.com.au/image/v1/b0dd685dcf7fbce746f28859c5d82af5?width=650", "http://cdn.newsapi.com.au/image/v1/d00cbd0cd81a9bf4c7f4da66c8911277", "http://cdn.newsapi.com.au/image/v1/c72bc460f0cb926fdddb1241a7e85f4a", "http://cdn.newsapi.com.au/image/v1/d013b61afa3dd07df6c3fffecc4c4f85", "http://cdn.newsapi.com.au/image/v1/a97850806d3cee12c68ca4352a00377a?width=650", "http://cdn.newsapi.com.au/image/v1/2b34476e9bf985edaf43a927b79979b7", "http://cdn.newsapi.com.au/image/v1/1733338418dd41d258e16fcb012c0380?width=650", "http://cdn.newsapi.com.au/image/v1/77dfd1e8a93bbb19c1bf6c765c006342", "http://cdn.newsapi.com.au/image/v1/879fe04d7025a96b1806c04473ea5f29", "http://pixel.tcog.cp1.news.com.au/track/news/content/v1/?category=/section/dailytelegraph.com.au/collection/popular-content/all/24hours/&t_product=most-popular-mobile&td_standfirst=false&td_kicker=false&td_byline=false&td_resultSize=6&maxRelated=20&display:footer=true&origin=omniture&t_template=s3/chronicle-component/otherstories/templates/index&domain=dailytelegraph.com.au"], "published": "2015-10-24T08:30:00.000+03:00", "crawled": "2015-10-24T04:51:22.806+03:00", "highlightTitle": ""}