{"organizations": [], "uuid": "f5f1ae140944c5fc4c133d424afa9ed5c00a6893", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.jsonline.com", "main_image": "http://media.jrn.com/images/taplogo_2048.jpg", "site_section": "http://www.jsonline.com/rss?c=y&path=%2Fentertainment%2Fnational&atom=y", "section_title": "JSOnline.com National Entertainment", "url": "http://www.jsonline.com/entertainment/national/asian-cinema-masterpieces-ferry-tragedy-at-korean-film-fest-mjsurnpublicidaporg4344825128d04c28870de-330817641.html", "country": "US", "title": "Asian cinema masterpieces, ferry tragedy at Korean film fest", "performance_score": 0, "site": "jsonline.com", "participants_count": 1, "title_full": "Asian cinema masterpieces, ferry tragedy at Korean film fest", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T13:01:00.000+03:00", "replies_count": 0, "uuid": "f5f1ae140944c5fc4c133d424afa9ed5c00a6893"}, "author": "Youkyung Lee,", "url": "http://www.jsonline.com/entertainment/national/asian-cinema-masterpieces-ferry-tragedy-at-korean-film-fest-mjsurnpublicidaporg4344825128d04c28870de-330817641.html", "ord_in_thread": 0, "title": "Asian cinema masterpieces, ferry tragedy at Korean film fest", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BUSAN, South Korea (AP) - South Korea's second-largest city is in a festive mood as the Busan Film Festival passes the midpoint.\nThe latter half of Asia's largest film festival will be spiced up with French celebrities in celebration of this year's special section, My French Cinema. The section screens 10 movies recommended by French directors, actors and festival organizers including Leos Carax.\nSophie Marceau will promote her movie \"Jailbirds\" on Haeundae beach on Friday evening, and Fleur Pellerin, the South Korea-born French culture minister, will also attend the festival's final days.\nSome highlights from the festival so far:\n-100 ASIAN MASTERPIECES\nTo mark the Busan festival's 20th anniversary, the 100 greatest Asian films of all time were selected.\nThe list announced this week is based on the survey of 73 film professionals, including critics, festival executives and directors Mohsen Makhmalbaf from Iran, Bong Joon-ho from South Korea, and Apichatpong Weerasethakul from Thailand. The list will be updated every five years.\nYasujiro Ozu's 1953 drama \"Tokyo Story\" was their top selection, followed by Akira Kurosawa's 1950 work \"Rashomon\" and Wong Kar Wai's \"In the Mood for Love.\"\nOthers in the top 10 include: Indian director Satyajit Ray's \"The Apu Trilogy\"; \"A City of Sadness\" by Hou Hsiao-hsien; \"Seven Samurai\" by Akira Kurosawa; \"A Brighter Summer Day\" by Edward Yang; \"Spring in a Small Town\" by Fei Mu; \"Still Life\" by Jia Zhang Ke; \"The Housemaid\" by Kim Ki-young; and \"Close up\" by Abbas Kiarostami.\nExecutive Programmer Kim Jiseok said the list was a meaningful work at a time when few studies are available on Asian cinema history. The vote puts light on directors and works that were previously hidden and is expected to give more attention to the history of Asian cinema.\nNine of the top 10 selections are being screened at the festival that runs until Saturday.\nThe Busan Cinema Center, which helped compile the list, plans to complete a library of the films and open the resources to scholars and researchers.\nTo see the full list of the 100 greatest movie Asian films: http://www.biff.kr/Template/Builder/ 1/page.asp?page_num=5865\n-FERRY TRAGEDY AT FILM FESTIVAL\nThe 2014 ferry sinking in South Korea that killed more than 300 people, mostly teenagers on a school trip, was at the center of a festival scandal last year. The festival screened a documentary criticizing the botched rescue during the ferry disaster, apparently leading the government to decide to cut its financial support to the festival.\nWhile none of this year's film selections appear directly related to the ferry tragedy, one South Korean director called his work a requiem for those who died on the ferry.\nO Muel, who visited Busan for the world premiere of his feature film \"Eyelids,\" said he felt so \"frustrated and powerless\" watching the news in the aftermath of the ferry disaster.\n\"I felt so low and unprepared. I took that feeling and wrote a script in three days, and immediately thought about where to shoot it,\" O told the Screen International magazine.\n\"Eyelids\" follows an old man living a monk-like ascetic life on an island. A phone rings, followed by a visitor for whom the man prepares rice cakes, the last meal before the visitor journeys to the next world.\nO said his movie does not put forth the Sewol ferry tragedy but he wanted to offer a way to console the souls of the dead.\n\"I was approaching it from the side of salvation for those who have died at sea.\"\nO, who won a top prize at the Sundance Film Festival with 2013 work \"Jiseul,\" often uses cinema to put dead soul at rest. O took elements from Korea's traditional ceremony paid to dead family or relatives in \"Jiseul,\" allowing audiences to send consolations to the dead souls by watching the movie. \"Jiseul\" was based on a true story of residents on Jeju island who were massacred by government forces in 1948.\n-GOVERNMENT BUDGET CUT\nFor Busan visitors the impact of the government's budget cut was not apparent. Festival's co-director Kang Soo-yeon said corporate sponsors and film professionals stepped up in its place.\n\"Help from the sponsors and film professionals was literally just so moving,\" she told the Associated Press. Kang said such outpouring of support from those who love Asian cinema allowed the festival to stand against external pressure.\n\"The reason that Busan International Film Festival could be established in just 20 years is that aside from any political or social situation, censorship or director's background, we have selected the movies only based on the film.\"\nBahman Ghobadi, an award-winning Kurdish director born in Iran, said he was \"shocked\" to hear the news of the budget cut. He urged the government and others in South Korea not just to support the economy or military but also artists.\n\"I don't like to see Korea just because of LG or Samsung,\" said Ghobadi, who visited Busan for the world premiere of \"A Flag Without A Country.\" ''I want to see South Korea as the key, or the one leading the culture in this area.\"\n___\nLee can be reached on Twitter: www.twitter.com/YKLeeAP\n ", "external_links": ["http://analytics.apnewsregistry.com/analytics/v2/image.svc/AP/RWS/jsonline.com/MAI/330817641/E/prod/PC/Basic/AT/A", "http://www.biff.kr/Template/Builder/00000001/page.asp?page_num=5865"], "published": "2015-10-06T13:01:00.000+03:00", "crawled": "2015-10-06T21:25:51.917+03:00", "highlightTitle": ""}