{"organizations": [], "uuid": "d4b6e7d7572afde87eef2bb913eedfb158f30f00", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://images.canberratimes.com.au/2015/10/16/6935998/Thumbnail1000972172gkb6lyimage.related.thumbnail.320x214.gjyb2k.png1445002081007.jpg.jpg", "site_section": "http://feeds.canberratimes.com.au/rssheadlines/entertainment.xml", "section_title": "Canberra Times Entertainment Headlines", "url": "http://www.canberratimes.com.au/entertainment/comedy/lunch-with-josh-thomas-please-like-me-the-future-and-what-people-think-20151015-gjyb2k.html", "country": "AU", "title": "Lunch with Josh Thomas: Please Like Me, the future and what people think", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "Lunch with Josh Thomas: Please Like Me, the future and what people think", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T16:28:00.000+03:00", "replies_count": 0, "uuid": "d4b6e7d7572afde87eef2bb913eedfb158f30f00"}, "author": "Michael Harry", "url": "http://www.canberratimes.com.au/entertainment/comedy/lunch-with-josh-thomas-please-like-me-the-future-and-what-people-think-20151015-gjyb2k.html", "ord_in_thread": 0, "title": "Lunch with Josh Thomas: Please Like Me, the future and what people think", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Well-liked: Creator and star of Please Like Me Josh Thomas. Photo: Luis Ascui \nThe Farm Cafe\n18 St Heliers Street, Abbotsford, 9415 6581\nOpen 7 days 9am to 4pm, 8am on the second Saturday of the month \nJosh Thomas is worried. He's worried about Please Like Me , the comedy drama he created, co-wrote and stars in, moving to ABC1 for its third season. He's worried that he's becoming more forgetful by the day. But mostly, he's worried that our lunch bill isn't going to be impressive enough.\n\"Maybe I'll get a sausage roll,\" he muses, before almost choking with anxious laughter. \"That's not what you're meant to eat when you're being interviewed, and then talking about the lunch you're having. Maybe I'll get a super salad? I'll just look like a more reasonable guy.\"\nThe super salad. Photo: Luis Ascui \nFor someone who has grown up in the spotlight, he's surprisingly concerned about what people think. Now 28, Thomas has been our official \"voice of Gen Y\" for more than a decade, skipping from stand-up to reality TV to acting (though he insists he's hardly acting in his largely autobiographical show). He has also become a somewhat reluctant voice of gay Australia, after casually coming out in 2009 via a podcast and a text message to his dad. \"I have a boyfriend. See ya.\"\nAdvertisement Meeting him for lunch at the outdoor Collingwood Children's Farm on a day like today is the kind of recipe for disaster that would happen on Please Like Me . It's the chilliest day in spring, and icy rain blasts the corrugated roof as peacocks go flying in the wind. We're here because the comedian lives just down the road, and his arrival with almost equally recognisable cavoodle John in tow causes the cafe to come to a minor standstill. A table full of mums with mugaccinos stare at him open-mouthed. Thomas pretends not to notice as we huddle under a heater, and John barks occasionally with unexpected ferocity. \"He's turned into a real s... lately,\" Thomas explains tenderly, stroking the dog's glossy head. \"He's so cute and then he just flips. It's a new thing, I think I'll have to find a dog whisperer.\"\nOur food arrives quickly, Thomas' reasonable bowl of quinoa heaped with leafy greens, chunky seeds and avocado, my thick toast laden with juicy beetroot relish and goats curd. \"Do you know I've lost 14 kilograms since the first season?\" he says picking up his fork. \"I lost 10, put on 4, then lost it again ... but I was pretty chubby.\"\nGoat's cheese toast dish at The Farm Cafe at the Collingwood Children's Farm. Photo: Luis Ascui \nToday he looks fit, if a little tired from too many late nights in the post-production suite. We're here to talk about the show, but Thomas doesn't seem particularly interested in discussing it. After toiling on the new episodes all year, and even directing one of them for the first time, he fears he has lost all perspective. \"Now I just sort of watch it and see continuity errors with hands,\" he says. \"Like I'll just think 'That hand's not in the right spot' … I need other people to watch it to remember what it actually is.\"\nThe low-key story follows Josh, a part-time coffee cart vendor who lives in Thornbury with his hapless best mate Tom, as they navigate the mental health issues of Josh's bipolar mother, depressed father and anxious boyfriend. The 25-minute episodes are painfully funny, quietly profound and increasingly assured, with liberal doses of pop culture kitsch (the first new episode features knowing tributes to Love Actually and Dawson's Creek ).\nThomas admits he controls almost every aspect of the show – \"Any decision, I have my claws in it\" – and many of the storylines are lifted from real life. \"My mum has been in a psychiatric hospital but it was very different to the Melbourne Clinic [which we used for research] or the one that was in series two of the show,\" he says. \"I've seen my mum manic but never supermanic to the point where she's in intensive care.\"\nComedian, writer and actor Josh Thomas at The Farm Cafe at the Collingwood Children's Farm. Photo: Luis Ascui \nThe series also stars his real-life best friend, Thomas Ward, who landed the role after casting agents sent a string of wildly inappropriate Aussie hunks to read for the part. \"He had to audition and he was very good,\" Thomas says. \"In season one we were really editing around me and Tom, finding the moments where [we] looked like real people, but this year we could use pretty much any take. We just know what we're doing by now, hopefully.\"\nThis season will be the first on ABC1. \"I was quite worried about [that], because it's been on ABC2 for two seasons – who is going to start watching it for the third season?\"\nMysteriously, it's a much bigger hit overseas, with US network Pivot broadcasting it to huge acclaim, leading to an International Emmy nomination for best comedy last year (it lost to a Belgian show called Wat als 2? ). It's also massive in China. \"Apparently it's pirated a lot. People subtitle it themselves, like they translate it themselves, which is a bit concerning, because I can't imagine they've done a very good job.\"\nThe bill, please. Photo: Supplied \nIt is often compared to Lena Dunham's hit Girls , another star vehicle that treads a barely fictional line between comedy and tragedy. In June, Dunham told her 2 million Twitter followers how much she digs the show. \"All I ever want is to be curled in bed watching Please Like Me ,\" she wrote. \"This show soothes my existential unrest. I love you.\"\nThomas replied quickly, complete with cringeworthy typo: \"I loved you too! OMG can we tweet each other compliments then meet up and become best friends like you did with Taylor Swift?\"\nThomas curls his lip when I ask about it. \"She never replied to my response, so ...\" he says, playing up to being offended. \"Then I sent her a DM [direct message]. But the same day she did have Sarah Palin call her a paedophile, so maybe she was busy.\"\nHe has 327,000 Twitter followers, though he rarely tweets these days. \"It got boring, don't you think? No one is talking about their lives any more, everyone is just banging on about 'issues' all the time. Everyone's just outraged about everything.\"\nSpeaking of outrage, we discuss his infamous appearance on Q&A last year, where he skewered politician Bob Katter on homophobia and encouraged him to download a gay dating app called Grindr. It was a terrifically awkward moment that people still bring up, but Thomas finds it a bit embarrassing. \"I don't think it's very impressive to back Bob Katter into a corner on gay issues,\" he splutters. \"Yeah, it was fun, it was good fun. You don't have to be very talented, though. You just have to be furious, like a bit furious. I forgot I was on television.\"\nThe plates are cleared, and Thomas orders two lamington cubes and a peppermint tea (\"We're not going to have a very thrilling receipt, are we?\") He checks the calendar on his iPhone 6 and realises he has a session with his personal trainer, Andy, this afternoon.\nIn a few days he's flying to the US for a much-needed holiday. \"I'm going to, err, Disneyworld?\" he says, as if I might not have heard of it. \"I'm a bit obsessed with Disney parks. We're going for, ahh, eight nights.\" He squeals with spontaneous laughter. \"My boyfriend [ Twentysomething actor Josh Schmidt] thinks it's a bit much, but I actually don't think it's enough.\"\nBefore we leave, a hip woman in a knitted hat approaches our table to say hello – she landscaped Thomas' garden and has been sitting next to us the whole time, unnoticed. \"I didn't recognise you in your beanie!\" Thomas exclaims.\n\"Oh, well, I just put it on,\" she says flatly. \"But you're doing well. Congratulations!\"\nThomas looks like he wants to hide. \"I'm doing fine,\" he mutters.\nIndeed, he is. In fact, it seems that far from wanting people to like him, as per the title's instructions, everyone wants Thomas to like them. If only he could remember their names. \"I'm the most vague person, I've just got a really bad memory.\"\nLunch is over, and we part outside the Convent under swirling grey skies. I wave to John, who barks loudly. \"I've picked such a crap lunch,\" Thomas says as they walk off together. \"I'm really worried about the bill now.\"\nI tell him it's been a great lunch. He really has nothing to worry about.\nSeries three of Please Like Me premieres on ABC1 on October 15 at 9.30pm.", "external_links": [], "published": "2015-10-16T16:28:00.000+03:00", "crawled": "2015-10-17T03:19:41.367+03:00", "highlightTitle": ""}