{"organizations": [], "uuid": "704634aa8beb39e12b2281e9b59e6d07b490e0ef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.heraldscotland.com", "main_image": "http://www.heraldscotland.com/resources/images/4295276/", "site_section": "http://www.heraldscotland.com/arts_ents/", "section_title": "Arts and Entertainment | Herald Scotland", "url": "http://www.heraldscotland.com/arts_ents/13805093.Downton_Abbey_creator_Julian_Fellowes_to_pick_up_Emmy_special_award/", "country": "GB", "title": "Downton Abbey creator Julian Fellowes to pick up Emmy special award", "performance_score": 0, "site": "heraldscotland.com", "participants_count": 1, "title_full": "Downton Abbey creator Julian Fellowes to pick up Emmy special award (From Herald Scotland)", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T01:24:00.000+03:00", "replies_count": 0, "uuid": "704634aa8beb39e12b2281e9b59e6d07b490e0ef"}, "author": "heraldscotland.com", "url": "http://www.heraldscotland.com/arts_ents/13805093.Downton_Abbey_creator_Julian_Fellowes_to_pick_up_Emmy_special_award/", "ord_in_thread": 0, "title": "Downton Abbey creator Julian Fellowes to pick up Emmy special award", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Downton Abbey will receive a special award at this year's International Emmys.\nThe Academy will present the 2015 International Emmy Founders Award to writer and creator Julian Fellowes.\nThe award is given to individuals whose creative accomplishments have contributed in some way to the quality of global television production.\nThe very first International Emmy Founders Award was given in 1980 to the late Jim Henson, creator of The Muppets.\nBritain is leading the International Emmys nominations list, competing for seven accolades at the black-tie ceremony on November 23 in New York City.\nThe UK nominations include Sheridan Smith, who is up for a best actress International Emmy for her role in popular ITV drama Cilla.\nThe 34-year-old portrayed the late singer and entertainer Cilla Black and has already won a number of awards for the part, including best actress at the TV Choice Awards and best drama performance at the National TV Awards.\nRafe Spall has received an International Emmy nomination as best actor for Charlie Brooker's Black Mirror White Christmas, broadcast on Channel 4 in December 2014.\nIn the Christmas special, he starred alongside Jon Hamm and Oona Chaplin.\nThe rest of the British nominees are: Common (TV movie/mini-series), 50 Ways To Kill Your Mammy (non-scripted entertainment), My Mad Fat Diary (drama) Growing Up Down's (documentary) and Messiah at the Foundling Hospital (arts programming).\nCountries ranging from the US to Brazil, France, Japan, South Korea and Angola have been recognised by the Academy for their 2015 television programming.\nShare article A total of 40 nominees from 19 countries will be competing in 10 categories for International Emmys, established to honour excellence in TV programming outside the US.\nBruce L. Paisner, president and chief executive of the International Academy of Television Arts & Sciences, said: \"Every year, the international television community competes to be recognised for excellence on the International Emmy's global stage. We congratulate the 2015 nominees for their outstanding programmes and performances.\"", "external_links": ["https://twitter.com/share?url=", "https://www.facebook.com/sharer/sharer.php?u="], "published": "2015-10-06T01:24:00.000+03:00", "crawled": "2015-10-05T23:56:57.584+03:00", "highlightTitle": ""}