{"organizations": [], "uuid": "7be1bb05b7498481fd4e3964d8094c7fd01d59b6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.heraldscotland.com", "main_image": "http://www.heraldscotland.com/resources/images/4290365/", "site_section": "http://www.heraldscotland.com/arts_ents/", "section_title": "Arts and Entertainment | Herald Scotland", "url": "http://www.heraldscotland.com/arts_ents/13802132.Three_rock_chick_memoirs/", "country": "GB", "title": "Three rock chick memoirs", "performance_score": 0, "site": "heraldscotland.com", "participants_count": 1, "title_full": "Three rock chick memoirs (From Herald Scotland)", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T07:09:00.000+03:00", "replies_count": 0, "uuid": "7be1bb05b7498481fd4e3964d8094c7fd01d59b6"}, "author": "Teddy Jamieson", "url": "http://www.heraldscotland.com/arts_ents/13802132.Three_rock_chick_memoirs/", "ord_in_thread": 0, "title": "Three rock chick memoirs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "“And now, ladies and gentlemen, h re’s Grace!”\nI think my favourite line in Grace Jones’s memoir comes when Trevor Horn phones to ask her to pop into the studio to do a vocal line for the track Slave To The Rhythm. “He called just when I was setting fire to Dolph’s trousers,” Jones writes. “I was in a very bad mood.”\nThen again, there’s also the moment when she runs up against Hollywood’s casual contempt for actors. “You realise that you are easily replaceable as well, even if you are the only person on the planet who seems qualified to play the horny, eerie, vampiric, stripping, singing, alien, semi-naked, bloodthirsty character with funny hair.”\nActually, I could Quote: another half dozen favourite lines. The best possible compliment I can give I’ll Never Write My Memoirs is that, even though it’s been ghosted by music journalist Paul Morley, it’s very, very Grace.\nJones is one of three women pop stars who have just published new books. All three are celebrated for their refusal to collude with the music industry’s sexist (and in Jones’s case racist) caricatures of women in pop. And all three have written books that are as much about the person as the pop star positioning. As such, there is more vulnerability on display than there ever was on the record covers.\nJones’s is the most entertaining of them. I’ll Never Write My Memoirs is both a catalogue and a celebration of excess. Whether that be hitting Russell Harty (possibly the least interesting thing she’s ever done, frankly), taking copious drugs (she would give parties in which you could visit the Quaalude room, the marijuana room or take cocaine from a silver platter with a gold spoon), or having sex with anyone and everyone. (There are extended descriptions of at least two orgasms in its pages and intimations of many more.) There’s even some mention of the music she made, some of it magnificent, but that’s mostly in passing.\nPromoted stories What this is, in reality, is an account of a young Jamaican girl, mistreated and abused by a fundamentalist Christian guardian, who grows up to take, as she puts it, “revenge on reality”. Jamaica in the early pages is a Gothic nightmare of beatings, religious paranoia and homophobic intolerance, with a side order of burning mongooses. Mas P, her grandmother’s husband was “cruel, because he was cruel, for no reason.”\nEverything that follows then is, the book suggests, in response to that childhood. Morley frames it as something of a distaff Jekyll and Hyde story, one in which Hyde is the heroine. Jones grew up in Jamaica being called Bev. When she moved to America she became Grace. She was running from her past and she never stopped or slowed down.\nHers is a life lived in defiance of the damage she felt was done to her as a child. There’s no sense in these pages – with the exception of an acknowledgement of the deaths that hit the Studio 54 generation because of the Aids virus – that there was any cost to living like this. Living like this was the point.\nThere’s a similar greed for experience on display in Chrissie Hynde’s memoir Reckless, which lives up to the title. Hynde wanted to escape the conservative ordinariness of Akron, Ohio, or maybe just childhood innocence. It was a journey that took her via Kent State as the National Guard opened fire, to London at the height of the punk era (and, no, she never married Sid Vicious. But she did get Johnny Rotten the odd cleaning job) and eventually to a level of fame that appalled her from the get go.\nRock 'n' roll was to be the delivery system for all this. Rock 'n' roll, fuelled by sex and drugs. Mostly drugs. At one point in Reckless she runs into Johnny Thunders, the patron saint of punky junkies and he tells her to get her act together. “I knew I was in trouble if he, of all people, thought I was,” she writes.\nUnlike Jones, Hynde is more willing to own up to the costs of the lifestyle. The book is already infamous for revealing that when she was young Hynde was raped by a biker (though it’s more the fact that she blamed herself for this that has caused ructions). But it also catalogues a rash of drug deaths, most notably Pete Farndon and James Honeyman-Scott, the members of her band The Pretenders. As a result, it’s often a painful read. But that’s offset by Hynde’s mordant humour (on Mick Jones: “Mick was having a bad hair year, and his hair knew it too.”)\nIt’s a more conventional rock memoir than Jones’s – with the usual stuff about the tediousness of touring – and yet when it flies it really flies. And if you want to live vicariously you’ll have no shortage of experience here. But where Jones’s book makes you feel you’ve just been to the best party on the planet, you come away from Reckless grinding your teeth with a nasty chemical taste in your mouth. Image or reality? The choice is yours.\nThen again, you could opt for drinking coffee with Patti Smith. M Train is the follow-up to her fine memoir Just Kids, but it’s not really in the same class. It’s a travel book of sorts, framed by Smith’s descriptions of trying to write. That’s write with a capital W, I’m afraid. (“Somnabulistic fruit”? No, me neither.) It can feel as much of an effort to read at times as we keep being told it is to create.\nShare article Buried in it, though, there are sweet pen portraits of her late husband Fred Sonic Smith and hymns to Frida Kahlo and Sylvia Plath. And for those of us long past being seduced by sex and drugs and rock and roll, you might share Smith’s love of crime fiction and TV crime drama.\nAnd so possibly my favourite line in this case might concern her stay in a London hotel. “I am not here to work, I told myself, but to watch ITV3 mystery dramas, one after another late into the night.” Turns out even Patti Smith watches Midsummer Murders. Now there’s a confession for you.", "external_links": ["https://twitter.com/share?url=", "https://www.facebook.com/sharer/sharer.php?u="], "published": "2015-10-04T07:09:00.000+03:00", "crawled": "2015-10-04T05:15:52.722+03:00", "highlightTitle": ""}