{"organizations": [], "uuid": "0bf5668fbc41e4a18a7e9119b0b6418d20cff479", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.huffingtonpost.co.uk", "main_image": "http://i.huffpost.com/gen/3556496/images/o-EASTENDERS-SPOILER-facebook.jpg", "site_section": "http://www.huffingtonpost.co.uk/feeds/verticals/uk-entertainment/news.xml", "section_title": "UK Entertainment News on The Huffington Post", "url": "http://www.huffingtonpost.co.uk/2015/10/19/eastenders-les-coker-secret-affair-dressing-woman_n_8330956.html", "country": "US", "title": "‘EastEnders' Reveal Les Coker's Secret As He Makes 'I Am Christine' Admission", "performance_score": 0, "site": "huffingtonpost.co.uk", "participants_count": 1, "title_full": "‘EastEnders' Reveal Les Coker's Secret As He Makes 'I Am Christine' Admission", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T22:28:00.000+03:00", "replies_count": 0, "uuid": "0bf5668fbc41e4a18a7e9119b0b6418d20cff479"}, "author": "Rachel McGrath", "url": "http://www.huffingtonpost.co.uk/2015/10/19/eastenders-les-coker-secret-affair-dressing-woman_n_8330956.html", "ord_in_thread": 0, "title": "‘EastEnders' Reveal Les Coker's Secret As He Makes 'I Am Christine' Admission", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "‘EastEnders' Reveal Les Coker's Secret As He Makes 'I Am Christine' Admission The Huffington Post UK | By Rachel McGrath reddit \n‘EastEnders’ bosses stunned fans on Monday night, when it was revealed that Les Coker’s big secret isn’t an affair after all - he’s actually been dressing as a woman, called Christine. \nFor weeks, fans have seen Roger Sloman’s character spending time with Claudette Hubbard and last week, viewers were left with a cliff-hanger, as Claudette urged Pam: “Ask Les who Christine is.” Monday's episode opened with a frantic Pam making calls and attempting to work out who Christine is, before the big reveal as Les declared, \"I'm Christine. Christine is me\", and it’s fair to say the news stunned soap fans: Les is Christine!!! #EastEnders \n— josh edmonds (@joshedmonds1997) October 19, 2015 Les is \"Christine\"? - Well i never saw that coming!! #OMG #EastEnders \n— Alex King (@AlexKingPhotos) October 19, 2015 LES IS CHRISTINE AND CLAUDETTE HELPED HIM I TAKE IT ALL BACK Claudette you babe #EastEnders \n— nom (@nahhhman) October 19, 2015 \nIn an emotional conversation, Les then told Pam that he has dressed as Christine since he was seven years old. \nIn the coming weeks, fans will see Pam attempt to digest the news, while deciding whether to stand by her husband or not. \nThere’s plenty of drama to come for the residents of Albert Square in the run-up to Christmas, and it’s not just the Cokers who will face problems. \nPam will struggle to cope \nThe soap’s executive producer Dominic Treadwell-Collins previously teased upcoming storylines, revealing that Bobby Beale is among the ones to watch . \nCatch up on all the latest 'EastEnders' news and spoilers here . Close 'EastEnders': The Most Iconic Storylines of   There's nothing quite like a Christmas Day revelation to shake things up is there? This classic clip is still tough to watch. From the classic Slater family row to Zoe' priceless reaction, everything about this clip screams \"legendary TV moment\". Angie was dealt a blow when Den handed her divorce papers for Christmas. Goodbye, Martin Kemp! With Big Mo's guidance, Sonia Jackson gave birth, just minutes after the Slaters worked out that she was pregnant. This New Year's Eve death scene stunned 'EastEnders' fans. Matthew Rose was wrongly convicted of manslaughter, after helping Steve Owen cover up his own crime. This storyline was the greatest mystery in soap - until Lucy Beale's murder, obviously... Their romance was a major event in soap, and to this day it remains a landmark moment for the depiction of gay relationships on TV. Of course, not everyone was pleased... (Dot, we mean you) Shirley Carter gave Kat Slater a run for her money with this one... Mel walked out on her husband just hours after getting hitched to Ian Beale, when she found out that he'd lied about Lucy having cancer. The Fowlers were left stunned when their son Mark revealed his diagnosis. It's always good to see a baddie get their comeuppance, isn't it? Once again, the show kicked up a huge debate on a topical issue with this storyline. After months of torture, Little Mo fought back and attacked her husband. When Grant discovered Sharon's affair with Phil his reaction was, well.. see for yourself. Well, the first one... This Christmas episode was heartbreaking and shocking in equal measure. There are no words.", "external_links": [], "published": "2015-10-19T22:28:00.000+03:00", "crawled": "2015-10-20T00:26:36.464+03:00", "highlightTitle": ""}