{"organizations": [], "uuid": "0d32be7834b2ff8ec7b86d6609f6067fb8a3224a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.visaliatimesdelta.com", "main_image": "http://www.gannett-cdn.com/-mm-/24b0581b72013fa06f76eb5cd119a4e7a2e8d222/c=0-48-1252-755&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/14/Visalia/Visalia/635804233220342887-maxresdefault.jpeg", "site_section": "http://rssfeeds.visaliatimesdelta.com/visalia/entertainment", "section_title": "Visalia - Entertainment", "url": "http://www.visaliatimesdelta.com/story/entertainment/movies/2015/10/14/stylish-crimson-peak-creepy-fun/73942002/", "country": "US", "title": "Spanspek Art & Music Festival returns to Orosi", "performance_score": 0, "site": "visaliatimesdelta.com", "participants_count": 0, "title_full": "Spanspek Art & Music Festival returns to Orosi", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T21:49:00.000+03:00", "replies_count": 0, "uuid": "0d32be7834b2ff8ec7b86d6609f6067fb8a3224a"}, "author": "", "url": "http://www.visaliatimesdelta.com/story/entertainment/movies/2015/10/14/stylish-crimson-peak-creepy-fun/73942002/", "ord_in_thread": 0, "title": "Spanspek Art & Music Festival returns to Orosi", "locations": ["Los Gatos"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Lance Canales", "Orosi Zachary Newcott"], "text": "Spanspek Art & Music Festival returns to Orosi Zachary Newcott , znewcott@visaliatimesdelta.com 11:49 a.m. PDT October 14, 2015 Lance Canales and the Flood received much acclaim for their song \"Plane Wreck at Los Gatos.\" The band headlines Spanspek Saturday, Oct. 24. (Photo: Submitted) CONNECT TWEET LINKEDIN COMMENT EMAIL MORE \nWhen the most acclaimed independent films only last a mere week in theaters, the most art sold comes off of the shelves of Target and music is not heard from the musicians themselves but rather from repeatedly skipping CDs, it becomes clear that a drought in art appreciation in a community is dismal. \nAnd yet, the Central Valley is rife with talented artists who continually question why in the world Hobby Lobby even needs to sell pre-made \"Man Cave\" signs when there are perfectly fine supplies on the neighboring shelves directly on hand to do it themselves. Tastemakers spices up local music scene \nChristobal Carrillo, event organizer of the Spanspek Music and Arts Festival is dedicated to spread that artistically inclined mentality through Spanspek 2015, which celebrates its 15 years of bringing art, music, and food to the Orosi community 5:30 p.m. Saturday, Oct. 24, at the Orosi Memorial Hall. \n\"We were all in local bands just looking for places to perform,\" Carrillo said of the first year he took part in organizing the event along with co-organizer Israel Flores. \nHis intention with assisting in the creation of Spanspek wasn't just to wait for the opportunity for a venue to open its doors, but rather create one from the ground up. \nHis Latin band, continues to tour, but as an organizer Christobal wants Spanspek to allow others to take the spotlight. \n\"Since it's the 10th year for Spanspek, we decided to take a step back,\" he said. \nInstead Spanspek has assembled the biggest misfit group of independent artists this side of the valley with musical acts including Fresno favorites Light Theives who continually pioneer the newest sounds on the progressive/experimental rock scene, the recently NPR featured Sanger rapper Kooleidoscope , the Dinuba hip-hop collective Roach Collection, Reedley instrumental band Tokyo Death March, and last but not least, the roots-rock trio Lance Canales & the Flood. \n\"He's an Orosi boy, a real roots rocker,\" Carrillo said. \"He just had a CD release show in Fresno that attracted more than 400 people.\" \nThe latest album from the Americano Fresno group Lance Canales & the Flood, \"The Blessing & the Curse,\" is quickly rising on the European music charts and continues to make its way through the streaming speakers of radios in the United States through outlets like XM radio and NPR. \nThe band made waves by coordinating a with the Nora Guthrie and the Guthrie Foundation to organizing a concert on behalf of the four Americans and 28 \"deportees\" who perished in the 1948 plane crash in Los Gatos Canyon. \nNevertheless, for Carrillo the most exciting headliners are those who are still emerging into the limelight. \n\"Personally, one of my favorites is a Tulare County punk band out of Porterville. They're called The Gilligans. They actually contacted us to perform and they have a really cool Misfits kind of punk sound,\" Carillo said. \nAlthough Spanspek occasionally strikes it big by having bands contact them, in other cases the festival is forced to great efforts to make music come alive. In the case of Tokyo Death March, Spanspek had to go so far to resurrect the band entirely by reassembling the original performers. \n\"Since it's our 10th year we wanted to bring back a band that was with us from the beginning,\" Carilo said. \"I'm still in contact with most of the band members but one was actually pretty difficult to get a hold of. This will actually be the only time they perform this year.\" \nDespite the efforts in assembling a talented musical lineup, some of the real highlights are the exhibiting artists including Visalia's Urbanist Collective, Fresno's Abigail Janzen who recently participated in collaborative murals for the Arte America's Dia de los", "external_links": [], "published": "2015-10-14T21:49:00.000+03:00", "crawled": "2015-10-15T03:04:18.329+03:00", "highlightTitle": ""}