{"organizations": [], "uuid": "3cb6ea12bb906fd504dcec4d8b506898625a910f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mcall.com", "main_image": "http://www.trbimg.com/img-561fd9f1/turbine/ct-project-greenlight-learn-mov-1016-20151016", "site_section": "http://www.mcall.com/rss/all-rss-entertainment-movies,0,7968136.hyperlink", "section_title": "Entertainment: Movie News", "url": "http://www.mcall.com/ct-project-greenlight-learn-mov-1016-20151016-column.html", "country": "US", "title": "What 'Project Greenlight' reveals about moviemaking", "performance_score": 0, "site": "mcall.com", "participants_count": 1, "title_full": "What 'Project Greenlight' reveals about moviemaking", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T19:51:00.000+03:00", "replies_count": 0, "uuid": "3cb6ea12bb906fd504dcec4d8b506898625a910f"}, "author": "Nina Metz", "url": "http://www.mcall.com/ct-project-greenlight-learn-mov-1016-20151016-column.html", "ord_in_thread": 0, "title": "What 'Project Greenlight' reveals about moviemaking", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "What 'Project Greenlight' reveals about moviemaking Ben Afflect and Matt Damon Frak Masi/HBO \n(left to right): Ben Affleck and Matt Damon from the HBO series Project Greenlight. \n(left to right): Ben Affleck and Matt Damon from the HBO series Project Greenlight. (Frak Masi/HBO) Nina Metz Contact Reporter Chicago Closeup Behind-the-scenes look focuses on line producer and director \nWriting about the movie \"Steve Jobs\" last week in the New York Times, columnist Farhad Manjoo concluded that the film \"ultimately suggests that the deeply unpleasant behavior of people in the tech industry may be worth putting up with because of what they sometimes manage to create, often in spite of themselves.\" \nThat same cliche has long shadowed a number of personalities in Hollywood, and there's a certain amount of it on display in the current season of the HBO series \"Project Greenlight\" (airing 9 p.m. Sundays this month) which documents — or, purports to document — the behind-the-scenes process of making a movie. \nWhat can we, as TV viewers, learn about moviemaking when we watch a reality show like this? Is it really accurate? Not everyone is convinced. Consider a recent tweet from director and screenwriter Craig Mazin, whose writing credits include \"The Hangover\" sequels: \"This has been coming up a bit lately. Questions starting with, 'Well, on Project Greenlight …' to which the answer is: NO. FAKE. STOP. NEXT.\" \n(There is yet another recent TV series, the satirical “Documentary Now” from IFC, that also offers a unique glimpse into the world of movies; I write more about that this week here .) \nOn \"Project Greenlight,\" Matt Damon and Ben Affleck are the executive producers who select, with a small group of executives, an unknown, unseasoned director from a pile of submissions. The winner this year was Jason Mann, who is quietly precise and particular and possibly very talented but also passive-aggressive and seemingly quite willing to fail on his own terms while driving everyone around him bonkers. Unlike past seasons, HBO has committed to broadcasting the finished product, which will air next month at the conclusion of the series. Project Greenlight: Inside the Episode #1 \nA look at episode one of \"Project Greenlight.\" \nA look at episode one of \"Project Greenlight.\" See more videos \n\"It's a chance for an audience to see first-hand what somebody goes through when they direct a big movie,\" Damon says in the opening credits. Actually, no. The budget is $3 million (later bumped to $3.3 million to accommodate Mann's insistence to shoot on film rather than digital). Is the film a big deal for the director? Yes. The guarantee that HBO will air it? Also big. But no matter how you slice it, $3 million is not a \"big movie.\" \nIt's actually a weird hybrid, a quasi-studio film (the producers and director are answerable to a studio executive at HBO) with the budget of an indie (and a hefty budget at that; many independent films are made for $1 million or substantially less). Nina Metz \nLike HBO's \"Project Greenlight,\" IFC's \"Documentary Now!\" has plenty to say about moviemaking, but in a completely different way and focused specifically on the world of nonfiction films. The first season, co-created by \"Saturday Night Live\" alums Fred Armisen, Bill Hader and Seth Meyers, concluded... \nLike HBO's \"Project Greenlight,\" IFC's \"Documentary Now!\" has plenty to say about moviemaking, but in a completely different way and focused specifically on the world of nonfiction films. The first season, co-created by \"Saturday Night Live\" alums Fred Armisen, Bill Hader and Seth Meyers, concluded... (Nina Metz)", "external_links": [], "published": "2015-10-15T19:51:00.000+03:00", "crawled": "2015-10-16T19:16:17.273+03:00", "highlightTitle": ""}