{"organizations": [], "uuid": "2ac631af1d92aaac9cc4e6fc40fd7f4b3d0e3deb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/278850/arts-entertainment", "section_title": "Arts &amp; Entertainment - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30275160/cincinnatis-yung-double-drops-geeky-single-and-music-video", "country": "US", "title": "Cincinnati's Yung Double drops \"Geeky\" Single and Music Video", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Cincinnati's Yung Double drops \"Geeky\" Single and Music Video - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T11:18:00.000+03:00", "replies_count": 0, "uuid": "2ac631af1d92aaac9cc4e6fc40fd7f4b3d0e3deb"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30275160/cincinnatis-yung-double-drops-geeky-single-and-music-video", "ord_in_thread": 0, "title": "Cincinnati's Yung Double drops \"Geeky\" Single and Music Video", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Rapper Yung Double causes a stir with new hip hop club track\n LOS ANGELES, CA, October 16, Following the release of his latest single \"Scale\" featuring Gucci Mane Cincinnati rapper Marcus Crooms aka Yung Double has released his single \"Geeky.\" Written by Crooms and produced by Young X, the new track has become a popular must-have among Yung Double fans. \"Geeky\" is available on iTunes; A special DJ Pack featuring the Instrumental, Acapella, Club Version, and Radio Version of the single are available at YungDouble.net\nDirected by Bangout Films, the official \"Geeky\" music video has also been released on Youtube and Yung Double's website. With its bass rattling beat and street-infused rap vocals, Double's new effort has quickly become a playlist must. His business-minded and street-styled charisma is what makes him stand out.\nBorn and bred in Cincinnati, Ohio, Yung Double is ready to prove that his hard work will pay off. Making his own path and forging his way into the industry is no small feat. His mixtape series \"Bout That Life\" has put his name on the tips of some of the hip hop industry leaders' tongues; WorldStar Hip Hop and Allhiphop.com among other major hip hop blogs have featured Yung Double's music. He is definitely on the come up and ready to make his presence known.\nAbout Yung Double\n\"It's the same old struggle trying to get money, so when you get money, ain't shit funny,\" words that Marcus \"Yung Double\" Crooms lives by. What happens when the tribulations of life seem to dictate and conquer your triumphs? There's only so much that a person can take before they're overwhelmed with turmoil and long for the desire to have peace and tranquility. It is at this crossroads where there are only two ways to go: one way leads to failure and one way to success. However, no matter which route you choose, there will always be many lessons to learn. For Marcus, while on the road to failure, he found a shortcut to those successes.\nOfficial website: http://yungdouble.net/\n release/cincinnatis-yung-double-drops-geeky-single-and-music-video-414261.php", "external_links": ["http://www.24-7pressrelease.com/press-release/cincinnatis-yung-double-drops-geeky-single-and-music-video-414261.php", "http://purl.org/rss/1.0/modules/content/", "http://yungdouble.net/"], "published": "2015-10-16T11:18:00.000+03:00", "crawled": "2015-10-16T14:27:56.714+03:00", "highlightTitle": ""}