{"organizations": [], "uuid": "23ba43d6cfbe30346296f95fa6bd150f62e6766d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.onenewspage.com", "main_image": "http://cdn.newsserve.net/ONPglobe256.jpg", "site_section": "http://www.onenewspage.com/rss/latest/Entertainment.rss", "section_title": "Latest Entertainment News on One News Page", "url": "http://www.onenewspage.com/n/Entertainment/7559xsk2w/Dancing-with-the-Stars-Maks-Is-Back-for.htm", "country": "US", "title": "Dancing with the Stars: Maks Is Back for Switch-Up Week!", "performance_score": 0, "site": "onenewspage.com", "participants_count": 0, "title_full": "Dancing with the Stars: Maks Is Back for Switch-Up Week!", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T06:42:00.000+03:00", "replies_count": 0, "uuid": "23ba43d6cfbe30346296f95fa6bd150f62e6766d"}, "author": "", "url": "http://www.onenewspage.com/n/Entertainment/7559xsk2w/Dancing-with-the-Stars-Maks-Is-Back-for.htm", "ord_in_thread": 0, "title": "Dancing with the Stars: Maks Is Back for Switch-Up Week!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Alek Skarlatos", "Stephen", "Erin Andrews", "Bindi Irwin", "Valentin Chmerkovskiy", "Emma Slater", "Witney Carson", "Carlos PenaVega", "Alexa PenaVega", "Allison Holker", "Andy Grammer", "Lindsay Arnold", "Nick Carter", "Sharna Burgess", "Derek Hough"], "text": "Dancing With the Stars Pro Allison Holker Is Pregnant! 00:43 Congratulations are in order for Allison Holker! The Dancing With the Stars pro revealed some huge news on tonight's episode. Spoiler alert: She's expecting a baby with Stephen \"tWitch\" Boss. While with her family, she shared with Erin Andrews when discussing this week's theme, \"This is my daughter... Recent related news Happy Switch-Up night! It was the nuttiest week of the Dancing with the Stars season as all of the stars traded partners for one night of total insanity. Or at... E! Online 1 hour ago - Entertainment Who was voted off Dancing with the Stars on Week 5? This week's \"Switch-Up Challenge\" was nerve-wracking for the nine remaining celebrities who had to change... Starpulse.com 1 hour ago - Entertainment Tonight on ABC Dancing With The Stars returns for a fifth week and Nick Carter and his Switch Up dancing partner Witney Carson danced a Paso... Celeb Dirty Laundry 2 hours ago - Celebrities Tonight on ABC Dancing With The Stars returns for a fifth week and Andy Grammer and his Switch Up dancing partner Sharna Burgess danced a Argentine Tango... Celeb Dirty Laundry 2 hours ago - Celebrities Tonight on ABC Dancing With The Stars returns for a fifth week and Alexa PenaVega and his Switch Up dancing partner Derek Hough danced a Tango routine. On... Celeb Dirty Laundry 2 hours ago - Celebrities Tonight on ABC Dancing With The Stars returns for a fifth week and Carlos PenaVega and his Switch Up dancing partner Lindsay Arnold danced a Quickstep... Celeb Dirty Laundry 2 hours ago - Celebrities Tonight on ABC Dancing With The Stars returns for a fifth week and Bindi Irwin and his Switch Up dancing partner Valentin Chmerkovskiy danced a Cha... Celeb Dirty Laundry 2 hours ago - Celebrities Tonight on ABC Dancing With The Stars returns for a fifth week and Alek Skarlatos and his Switch Up dancing partner Emma Slater danced a Rumba routine. On... Celeb Dirty Laundry 2 hours ago - Celebrities You Might Like", "external_links": [], "published": "2015-10-13T06:42:00.000+03:00", "crawled": "2015-10-13T06:47:49.314+03:00", "highlightTitle": ""}