{"organizations": [], "uuid": "65ed0c18e1d07fd20ff3b53f788ad8de095d6380", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48524/c", "section_title": "Entertainment - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30226128/disneys-the-lion-guard-return-of-the-roar-primetime-television-movie-event-premieres-sunday-november-22-on-disney-channel", "country": "US", "title": "Disney's The Lion Guard: Return Of The Roar Primetime Television Movie Event Premieres Sunday, November 22 on Disney Channel -", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Disney's The Lion Guard: Return Of The Roar Primetime Television Movie Event Premieres Sunday, November 22 on Disney Channel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "65ed0c18e1d07fd20ff3b53f788ad8de095d6380"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30226128/disneys-the-lion-guard-return-of-the-roar-primetime-television-movie-event-premieres-sunday-november-22-on-disney-channel", "ord_in_thread": 0, "title": "Disney's The Lion Guard: Return Of The Roar Primetime Television Movie Event Premieres Sunday, November 22 on Disney Channel -", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Corus Entertainment Inc.\nVoice Cast includes Rob Lowe , Gabrielle Union , Max Charles , Atticus Shaffer and Sarah Hyland\nJames Earl Jones and Ernie Sabella Reprise their roles as Mufasa and Pumbaa, Respectively\nTORONTO , Oct. 9, 2015 /CNW/ - The epic storytelling of Disney's The Lion King continues with The Lion Guard: Return of the Roar , a primetime television movie event premiering Sunday, November 22 at 7 p.m. ET /PT on Corus Entertainment 's Disney Channel . The movie will be available on the WATCH Disney Channel app and Disney Channel On Demand the following day, Monday, November 23. The Lion Guard television series will premiere in early 2016.\nSet in the African savanna, The Lion Guard: Return of the Roar introduces Kion, the second-born cub of Simba and Nala, who is destined to become leader of the Lion Guard, a team of animals comprised of the Pride Lands' fiercest, bravest, fastest, strongest and keenest of sight. As Kion looks to assemble the members of the new Lion Guard, he does not call upon a group of lions to serve with him as tradition dictates, but instead chooses some of his friends whom he believes best exemplify these heroic qualities – Bunga, a fearless honey badger; Fuli, a confident cheetah; Beshte, a friendly and good-spirited hippo; and Ono, an intellectual egret.\nThroughout the movie and subsequent series, the diverse team of young animals will learn how to utilize each of their unique abilities to solve problems and accomplish tasks to protect the Pride Lands and maintain balance within the Circle of Life.\nThe Education and Science experts at Disney's Animal Kingdom theme park serve as consultants, advising on the characteristics, behaviors and habitats of the African animal species featured and inspiring original stories based on their first-hand experiences. Author and Swahili expert Sarah Mirza is the language and cultural advisor.\nMany of the beloved characters from The Lion King will appear in the movie including Mufasa and Pumbaa, voiced by James Earl Jones and Ernie Sabella who reprise their original roles. Rob Lowe ( The Grinder ) and Gabrielle Union ( Being Mary Jane ) star as Simba and Nala, respectively; Max Charles ( The Strain ) as Kion; Joshua Rush ( The Adventures of Puss in Boots ) as Bunga; Atticus Shaffer ( The Middle ) as Ono; Diamond White ( Sofia the First ) as Fuli; and Dusan Brown ( Blaze and the Monster Machines ) as Beshte.\nAdditional cast members include: Eden Riegel ( All My Children ) as Kiara; Sarah Hyland ( Modern Family ) as Tiifu; Madison Pettis ( Jake and the Never Land Pirates ) as Zuri; Khary Payton ( Teen Titans ) as Rafiki; Jeff Bennett as Zazu ( Jake and the Never Land Pirates ); Jonny Rees ( Star Wars Rebels ) as Mzingo; Andrew Kishino ( Star Wars: The Clone Wars ) as Janja; Vargus Mason ( Sofia the First ) as Cheezi; and Kevin Schon ( The Lion King's Timon and Pumbaa ) as Chungu and Timon.\nBoth the movie and series were developed by Ford Riley ( Special Agent Oso ) who also serves as executive producer. Howy Parkins ( Jake and the Never Land Pirates ) is director. Christopher Willis ( Mickey Mouse ) is the composer and Beau Black ( Miles from Tomorrowland ) is singer/songwriter. The Lion Guard: Return of the Roar is a production of Disney Television Animation.\nAbout Disney Channel ( Canada )\nDisney Channel is a 24-hour kid-driven, family-inclusive television network that taps into the world of kids and families through original series and movies. Disney Channel is available in Canada through a license agreement between Canadian-based media and entertainment company Corus Entertainment Inc. and Disney/ABC Television Group. For more information, please visit DisneyChannel.ca and corusent.com .\nFacebook: Facebook.com/DisneyChannelCanada\nInstagram: https://instagram.com/disneychannelcanada\nYoutube: Youtube.com/DisneyChannelCanada\nTwitter : https://twitter.com/DisneyChannelCA\nDownload hi-res images from The Lion Guard: Return of the Roar , here.\n ", "external_links": ["http://rt.prnewswire.com/rt.gif?NewsItemId=C4926&Transmission_Id=201510091215CANADANWWEB______C4926&DateId=20151009", "http://www.xmlnews.org/ns/", "http://corusent.com/", "http://youtube.com/DisneyChannelCanada", "http://facebook.com/DisneyChannelCanada", "https://instagram.com/disneychannelcanada", "https://twitter.com/DisneyChannelCA", "http://disneychannel.ca/", "http://www.corusent.com/properties/lion-guard-return-of-the-roar/"], "published": "2015-10-09T03:00:00.000+03:00", "crawled": "2015-10-10T01:21:13.419+03:00", "highlightTitle": ""}