{"organizations": [], "uuid": "45958ccde1e79ea7e7752381f706fcf78042fb94", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "entertainment.ie", "main_image": "http://images.entertainment.ie/images_content/rectangle/620x372/office_2209341b20151021545705.jpg", "site_section": "http://entertainment.ie/life", "section_title": "Life photo galleries premieres interviews videos rumours news stories - entertainment.ie ", "url": "http://entertainment.ie/cinema/news/The-six-best-Dublin-restaurants-near-your-local-cinema/371060.htm", "country": "IE", "title": "MovieNews | The six best Dublin restaurants near your local cinema", "performance_score": 0, "site": "entertainment.ie", "participants_count": 1, "title_full": "MovieNews | The six best Dublin restaurants near your local cinema - entertainment.ie", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T23:45:00.000+03:00", "replies_count": 0, "uuid": "45958ccde1e79ea7e7752381f706fcf78042fb94"}, "author": "Brian Lloyd", "url": "http://entertainment.ie/cinema/news/The-six-best-Dublin-restaurants-near-your-local-cinema/371060.htm", "ord_in_thread": 0, "title": "MovieNews | The six best Dublin restaurants near your local cinema", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "There really is nothing like dinner and a movie, is there?\nA good, hearty meal followed by a decent flick can be the perfect way to finish off a long week or can be the perfect first date, if you're lucky. There's a wide range of restaurants near cinemas because the two just go together.\nWe've teamed up with the folks at Meteor who have just launched Meteor Extras , extra little gifts to say thanks, to compile a list of some of the best restaurants near your local cinema.\n6. MANIFESTO / Omniplex Rathmines\nDepending on who you ask, Manifesto is the pizza in the greater Dublin area. With their menu, it's hard to argue with it. As well as having gorgeous pasta dishes, they've also got a very decent wine selection as well. If you're planning on going there during the peak hours, you'd better book ahead because the place is usually at capacity.\n5. RUBY'S / Movies At Swords\nIf you're looking for some spicy BBQ ribs and a wide range of cocktails, you can't go wrong with Ruby's. Located in the Pavillion in Swords, Ruby's also has a fantastic Aubergine and Chickpea Burger if you're looking for a vegetarian option. The chargrilled Atlantic Tuna is also pretty delicious, too.\n4. CAPTAIN AMERICA'S / ODEON Blanchardstown\nCaptain America's has been around forever, but when you consider how long it's been around and how quickly restaurants open and close , it's no surprise it's been there. Consistently good food's always been the hallmark of Captain America's and, thankfully, little's changed in the intervening years since it opened.\n3. MILANO'S / Movies At Dundrum\nAlthough Milano's do a very good pizza, we find their Pollo Pesto dish to be pretty damn spectacular. The chicken and mushroom, mixed with a lovely pesto sauce, is very good. Of course, the wealth of variety when it comes to their pizzas is just as good. The Sloppy Guiseppe, which is hot spicy beef, peppers and mozzarella, is particularly tasty.\n2. MY MEAT WAGON / Lighthouse Cinema\nJust recently opened and literally next door to the Lighthouse, My Meat Wagon is a chilled, laid-back experience that offers meat lovers a slap-up meal before the cinema. Their Monday deals are of particular note, but we're also fans of their no-nonsense meat boards.\n1. IFI CAFÉ BAR / Irish Film Institute\nA Dublin institution, the IFI Café Bar is a great little cafe-restaurant that serves gorgeous coffee and great sandwiches. The dinner menu is just as good, which includes the French Lentil Stew or Bacon and Creamy Colcannon being our two highlights. What's more, it's right in the IFI so once you've got your tickets, you won't need to worry too much about queues or rushing to the cinema screen.\nMeteor Extras are extra little gifts to say thanks for choosing Meteor. As a way of saying thanks to their customers, all Meteor customers can go free to the cinema every month and enjoy 2 for 1 dining at selected restaurants. Visit www.meteor.ie/extras to find out more!\nMORE: Ten movies you need to see before the end of 2015\nMORE: Podcast: The Insider talks to Brian Quinn, student director in Filmbase's Masters Programme\nMORE: Yes, that Movies On The Beach thing on Facebook definitely ISN'T happening", "external_links": ["http://www.meteor.ie/extras"], "published": "2015-10-15T23:45:00.000+03:00", "crawled": "2015-10-15T15:58:15.657+03:00", "highlightTitle": ""}