{"organizations": [], "uuid": "49f75871201b030d9798607214c20e6aa269a3cd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.philly.com", "main_image": "http://media.philly.com/images/artmuseum800.jpg", "site_section": "http://www.philly.com/philly/entertainment", "section_title": "Philly.com guide to entertainment news, music, nightlife and things to do in the Philadelphia area", "url": "http://www.philly.com/philly/entertainment/arts/20151022_Exhibition_sparks_surprise_reunion_for_Peale_artistic_family.html", "country": "US", "title": "Exhibition sparks surprise reunion for Peale artistic family", "performance_score": 0, "site": "philly.com", "participants_count": 1, "title_full": "Exhibition sparks surprise reunion for Peale artistic family", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "49f75871201b030d9798607214c20e6aa269a3cd"}, "author": "Samantha Melamed,", "url": "http://www.philly.com/philly/entertainment/arts/20151022_Exhibition_sparks_surprise_reunion_for_Peale_artistic_family.html", "ord_in_thread": 0, "title": "Exhibition sparks surprise reunion for Peale artistic family", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Earlier this year, Philadelphia Museum of Art curator Mark Mitchell called art consultant Nan Chisholm to ask a favor: that she persuade a client to lend a painting for \"Audubon to Warhol: The Art of American Still Life,\" the major survey exhibition set to open Tuesday.\nTo add weight to his request, he listed the impressive works he already had secured - particularly those by the Peales, America's first family of still-life painters.\nThere was The Peale Family , a masterpiece begun in 1773 by Charles Willson Peale, patriarch of the Philadelphia clan, and iconic works by sons Rembrandt and Raphaelle. There were also pieces by James Peale, Charles' brother, and by James' daughters, Sarah Miriam and Margaretta Angelica.\nChisholm was impressed. A specialist in traditional American art, she'd worked at Sotheby's in the 1980s, when the auction house handled the sale of Rembrandt Peale's best-known painting, Rubens Peale With a Geranium . (It's in the show, too, on loan from the National Gallery of Art.)\nBut six weeks later, Chisholm, who is adopted, on a whim did a search via the DNA ancestry site 23andMe.com and learned she was descended from both Charles and James Peale (cousins had intermarried along the way). She was stunned.\nOn Wednesday afternoon, she stood amid the partly installed \"Audubon to Warhol\" exhibition, in front of The Peale Family - gazing in amazement at what she now knew to be her own family's portrait.\nAnd Thursday, she'll be back at the museum to join about 20 other Peale descendants to celebrate the opening of the show, the centrality of the Peales' place in the evolution of American art, and the strength of even unknown family ties.\nExamining the painting, Chisholm pointed to an infant at the center.\n\"I have a baby picture of myself, and my friends tell me I look just like that baby,\" she said. As to what it all means to her, she added, \"I'm still figuring it out.\"\nThere's a lot to decode in The Peale Family . The painting, 36 years in the making, captures four generations of Peale luminaries, with a still life of fruit at its center.\nIt's a centerpiece of the exhibition; the Peale family would yield generations of artists, and Charles Willson Peale's fascinations with painting and natural history laid the groundwork for the genre of American still-life painting.\n\"Still life gets rolling out of the scientific impulse,\" said Mitchell, who recently moved on to a post at the Yale University Art Gallery. \"It exists at the threshold between art and wider culture and life.\"\nSo the exhibition includes, for example, bird paintings by John James Audubon from his opus, The Birds of America , and an image of a honeybee by Titian Ramsay Peale II, who spent his life studying and painting North American butterflies.\nBut it's the influence of Raphaelle Peale that echoes throughout the show - and American art in general, Mitchell said. \"Everyone looks at Raphaelle Peale, from then to now. He is a constant font of inspiration to artists. He's one of our masters, and it's amazing that someone who worked so small can be so important.\"\nFrom those intimate still-life works, the exhibition proceeds into the 19th and 20th centuries, telling the story of 200 years of shifting social and economic forces through portrayals of material culture.\nThere are rooms abloom with flowers reflecting evolving tastes, from depictions of impossibly rich bounty in the mid-1800s to an appreciation for the more refined beauty of a single, spectacularly rendered blossom in the troubled post-Civil War years. The show concludes with modernism, from Jasper Johns' can of paintbrushes to Andy Warhol's Brillo Boxes , self-conscious renderings of the mundane.\nOf the 90 artists represented, 45 lived in Philadelphia (for better or worse). Their paintings offer windows into those lives. Samuel Lewis' 1805 trompe l'oeil bulletin board, A Deception , shows a collection of ephemera, such as newspaper clippings, tickets, and invitations. And Charles Bird King paints a visual memoir of privation in The Poor Artist's Cupboard , topped with a notice of sheriff's sale.\nMitchell said it makes sense that the story of the American still life is a Philadelphia story. This city was the locus for artists, thinkers, and scientists in the Peales' heyday.\nAnd their legacy still lives in the minds of their descendants, said Lucy Bell Jarka-Sellers, a relative who lives in Mount Airy. She stood in the gallery surrounded by the works of her great-uncles and grandparents, and tried to explain what it means to be a Peale.\n\"I grew up with Peale paintings on the walls, and lots of stories about the Peales,\" said Jarka-Sellers, who recently quit her teaching job to focus on a career as an illustrator.\n\"I value this connection because, in my family, if you say you're going to be an artist, everyone is like, 'Oh, good!' \"\n\"Audubon to Warhol: The Art of American Still Life\" will run from Tuesday to Jan. 10 at the Philadelphia Museum of Art. 215-763-8100, philamuseum.org\nsmelamed@phillynews.com\n215-854-5053\n@samanthamelamed\nMore coverage Philly artists take aim at Trump - using his former tour bus EgoPo explores Hellman's dark 'The Children's Hour'", "external_links": ["http://www.philamuseum.org/exhibitions/818.html?page=1"], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-22T12:12:43.695+03:00", "highlightTitle": ""}