{"organizations": [], "uuid": "44c962718d6ab115a6e75185b37946c638a47675", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-561c21ee/turbine/ct-house-draft-paul-ryan-edit-1013-20151012", "site_section": "http://www.chicagotribune.com/", "section_title": "Chicago Tribune: Chicago breaking news, sports, business, entertainment, weather and traffic - Chicago Tribune", "url": "http://www.chicagotribune.com/news/opinion/editorials/ct-house-draft-paul-ryan-edit-1013-20151012-story.html", "country": "US", "title": "Want to draft Paul Ryan for House speaker? Promise he can lead. - Chicago", "performance_score": 0, "site": "chicagotribune.com", "participants_count": 1, "title_full": "Want to draft Paul Ryan for House speaker? Promise he can lead. - Chicago Tribune", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T00:14:00.000+03:00", "replies_count": 0, "uuid": "44c962718d6ab115a6e75185b37946c638a47675"}, "author": "Editorial Board", "url": "http://www.chicagotribune.com/news/opinion/editorials/ct-house-draft-paul-ryan-edit-1013-20151012-story.html", "ord_in_thread": 0, "title": "Want to draft Paul Ryan for House speaker? Promise he can lead. - Chicago", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Lately, House Republicans have been massing in a formation that many political groups use in times of trouble: a circular firing squad. They seem more intent on targeting each other than their Democratic opponents, and the casualties are mounting.\nInternal strife drove out Speaker John Boehner, who got tired of tangling with a conservative faction that feels it gets short shrift from the GOP leadership. He apparently wasn't willing to go along with a repeat of the 2013 government shutdown. That time, the goal was to kill Obamacare. This year, the goal was defunding Planned Parenthood.\nBoehner's heir apparent, Majority Leader Kevin McCarthy of California, withdrew from the race after the Freedom Caucus, which has about 40 members, endorsed Rep. Daniel Webster of Florida. McCarthy apparently wasn't willing to grant some of their demands on House procedures. As The New York Times reported, he concluded \"that to secure the votes to become speaker, he would face the same battles that repeatedly bloodied Boehner, his far more seasoned predecessor.\"\nIn the aftermath of that shock, eyes have turned to one of the few people in the House who can appeal to Republican members of all stripes: Paul Ryan of Wisconsin. He is respected for his conservative convictions, his seriousness on substance, his political courage and even his ability to work with Democrats.\nHe's part of the House GOP leadership, but he made his name as a tea party champion. One possible candidate for the job, Lynn Westmoreland of Georgia, has called Ryan \"the only guy who can unite us right now.\"\nHouse Republicans would be wise to do their best to persuade Ryan to accept a draft. Said the conservative National Review, \"House Republicans need both unity and direction. Ryan can supply more of each than they have had in some time.\"\nRyan, who was Mitt Romney's running mate in 2012, would be an excellent spokesman for the party, a positive influence on policy and a savvy tactician who knows what the GOP can accomplish with its current control of Congress — and what it can't.\nDo Republicans want to govern? Editorial Board The coming months are shaping up to be fateful ones for the national Republican Party. Among GOP voters, Donald Trump continues to lead other presidential contenders, followed by Ben Carson and Carly Fiorina. When John Boehner announced he would step down as House speaker and resign from Congress,...\nThe coming months are shaping up to be fateful ones for the national Republican Party. Among GOP voters, Donald Trump continues to lead other presidential contenders, followed by Ben Carson and Carly Fiorina. When John Boehner announced he would step down as House speaker and resign from Congress,...\n(Editorial Board) But why would Ryan take the job? He nixed the idea as soon as Boehner announced his departure, and though he is said to be reconsidering, he's taking his time. It would mean giving up his dream job, his current post as chairman of the tax-writing Ways and Means Committee. It would also deprive him of time with his school-age children.\nBesides, the gavel doesn't confer the formidable power it once did. In a government divided between a Democratic president and a GOP Congress, polarized by stark disagreements on a range of issues, the speaker functions less as a quarterback than a javelin catcher. He has limited ability to force anyone to do what he wants. But he bears the responsibility when his members fall short of their legislative goals.\nWhether Ryan can actually win is not a sure thing. Though he wants to defund Planned Parenthood, he's shrewd enough to understand that shutting down the government will not achieve the goal. That view will disqualify him with some on the right. If he has to concede too much to restive members, he will have even less leverage than Boehner had.\nOur advice to Ryan would be to accept the job only if GOP members are willing to trust him with the power needed for him to be effective. Our advice to those members: Do whatever it takes.\nCopyright © 2015, Chicago Tribune Paul Ryan Republican Party U.S. House of Representatives John Boehner Kevin McCarthy Tea Party Movement Opinion", "external_links": ["http://www.trbimg.com/img-5605c69a/turbine/ct-john-boehner-rubio-defund-planned-parenthood-edit-0926-jm-20150925", "http://www.trbimg.com/img-561c21ee/turbine/ct-house-draft-paul-ryan-edit-1013-20151012"], "published": "2015-10-13T00:14:00.000+03:00", "crawled": "2015-10-13T01:07:02.006+03:00", "highlightTitle": ""}