{"organizations": [], "uuid": "79565affd2f903c7dfc0eb3ab76ab31b32b8a70a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nydailynews.com", "main_image": "http://assets.nydailynews.com/polopoly_fs/1.2389917!/img/httpImage/image.jpg_gen/derivatives/landscape_1200/poetry9n-3-web.jpg", "site_section": "http://www.nydailynews.com/entertainment/index.html", "section_title": "Entertainment News &amp; Reviews - NY Daily News", "url": "http://www.nydailynews.com/entertainment/theater-arts/poets-profs-pick-influential-poems-natl-poetry-day-article-1.2389920", "country": "US", "title": "Poets and profs pick influential poems for Natl. Poetry Day", "performance_score": 0, "site": "nydailynews.com", "participants_count": 1, "title_full": "Poets and profs pick influential poems for Natl. Poetry Day - NY Daily News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "79565affd2f903c7dfc0eb3ab76ab31b32b8a70a"}, "author": "NEW YORK DAILY NEWS", "url": "http://www.nydailynews.com/entertainment/theater-arts/poets-profs-pick-influential-poems-natl-poetry-day-article-1.2389920", "ord_in_thread": 0, "title": "Poets and profs pick influential poems for Natl. Poetry Day", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Stock Montage/Getty Images Not surprisingly, one prof named a Shakespeare work as one of the most influential poems. Thursday is National Poetry Day, the day to fly on the “viewless wings of Poesy” (if you’re a Keats fan).\nFor anyone who’s not a Keats fan, here’s a list of poets’ and professors’ picks for influential poems to peruse in honor of the national day.\n1. “Howl” by Allen Ginsberg\nThe most famous Beat poet’s 1955 work is a three-part poem about the “minds of a generation destroyed by madness.”\nIt is considered groundbreaking and Susan Schultz, a poet and University of Hawaii professor, singled it out as influential because it “ushered in the 60s and much else beyond that, everything from political oppression to gay liberation to mental health issues — and was also somehow a funny, beautiful stretch of language.”\n2. . “Daddy” by Sylvia Plath\nOne of the confessional poet’s most celebrated works, “Daddy” has a playful-sounding rhyme scheme but is in fact — like most of Plath’s work — really depressing.\nPoet Ed Skoog suggested the damning poem about Plath’s father was influential because it “turns an instantly memorable nursery rhyme form into an onslaught of repetitions against the father and patriarchy.”\nAP Poet Allen Ginsberg Beat authored “Howl,” an influential Beat poem. 3. “Sonnet 116” by Shakespeare\nAny number of the Bard’s sonnets could be apt for this list, but Harvard University English Professor Stephen Burt singled out 116, which includes the famous line, “Love is not love/ Which alters when it alteration finds.”\n“Sonnet 116” Burt said, “is influential and wonderful and scary because it turns out to mean the opposite of what many people think it means: it's about the persistence of erotic love, but also about the way doubt can eat you up inside and never goes away.”\n4. “Death Fugue” by Paul Celan\nChristopher Kennedy, director of the MFA program in creative writing at Syracuse University, called Celan’s piece, originally published in German, a “beautifully disturbing poem about a Nazi death camp.”\nIt was written at a time when “unthinkably inhumane behavior threatened to drag us down as a species,” he said. “Poetry can be its most effective when it confronts these instances.”\n5. \"The Road Not Taken\" by Robert Frost\nRobert Frost is probably best known for ‘The Road Not Taken.’ Rutgers University creative writing professor and poet Rachel Hadas said this 1951 poem is just one of many \"technically superb\" Frost poems.\n\"This poem has added a now indispensable phrase to our language: 'the road less travelled by,' and is influential if only for that reason alone,\" she said.\n6. “The Waste Land” by T.S. Eliot\nAt more than 400 lines, the 1922 Modernist manifesto is not a short read.\nDouglas Mao, an English professor at Johns Hopkins University, picked it for this list because of its influence on contemporary poets.\n“It helped to make Eliot an international literary celebrity and permanently changed readers’ views of what poetry could (or should) look like,” he said.\n7. “Song of Myself” by Walt Whitman\nAP Emily Dickinson (left) was an influential, if strange, poet. Even longer than “The Waste Land,” Whitman’s 1855 poem clocks in at more than 1,300 lines.\nSyracuse University English professor Bruce Smith singled out the last section — section 52 — for this list.\n“Whitman’s songs are American, barbaric as our music and politics. He offers an intimacy of a lover,” Smith said.\n8. “I Died for Beauty” by Emily Dickinson\nThe reclusive New Englander’s poems are visually notable for their strange use of punctuation and use of links breaks, and it’s partly that unique use of form and syntax that has made a mark in poetic history.\nThis short poem responds to an earlier work by John Keats, “Ode on a Grecian Urn,” which ruminates on the relationship between truth and beauty.\nDennis Doherty, director of the creative writing program at SUNY New Paltz, named this 1890 work as influential, saying, “Dickinson's eerie morbidness tends to startled us into thought.”\nkblakinger@nydailynews.com\nRelated Stories T.S. Eliot really liked cats according to his wife Stars spill about jealousy at Met Opera 'Otello' premiere ‘Hamlet in Bed’ review: For $35, you’ll get a nice nap Tags: news break , lists", "external_links": ["http://www.poetryfoundation.org/poem/179381", "https://www.poets.org/poetsorg/poem/death-fugue", "http://www.poetryfoundation.org/poem/178960", "http://www.shakespeare-online.com/sonnets/116.html", "http://www.poetryfoundation.org/poem/173536", "http://www.poetryfoundation.org/poem/176735", "http://www.online-literature.com/dickinson/445/", "http://depts.washington.edu/lsearlec/TEXTS/WHITMAN/SONGSELF.HTM"], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-08T19:26:17.567+03:00", "highlightTitle": ""}