{"organizations": [], "uuid": "5a25b814d3759c1c56dacd5a7110b27450d7e090", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pe.com", "main_image": "http://images.onset.freedom.com/pressenterprise/thumb/nvxifq-pereverest0507001.jpg", "site_section": "http://www.pe.com/", "section_title": "Press Enterprise : Riverside County California News, Sports and Entertainment", "url": "http://www.pe.com/articles/brown-782908-students-legislation.html", "country": "US", "title": "EDUCATION: Brown vetoes bill to aid Corinthian students", "performance_score": 0, "site": "pe.com", "participants_count": 3, "title_full": "EDUCATION: Brown vetoes bill to aid Corinthian students - Press Enterprise", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 2, "uuid": "bccc718482e68b0bd5f2820431886d6a15707d06"}, "author": "STAFF AND WIRE REPORTS", "url": "http://www.pe.com/articles/brown-782908-students-legislation.html#post-0", "ord_in_thread": 0, "title": "EDUCATION: Brown vetoes bill to aid Corinthian students", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "STAFF AND WIRE REPORTS\nPublished: Oct. 8, 2015 Updated: 11:08 p.m. EDUCATION: Brown vetoes bill to aid Corinthian students Print Photo Share Pin It More Galleries ADVERTISEMENT Everest College in San Bernardino was among the Inland campuses that shuttered when Santa Ana-based chain Corinthian Colleges closed its doors. STAN LIM, FILE PHOTO Related article » PREVIOUS COVERAGE • State tells Everest campuses to cease enrollments\n• Corinthian Colleges closes remaining campuses\n• Shock as Everest colleges close doors\n• Corinthian bankruptcy caps yearlong meltdown\n• Locked out students try to move on\n• Students hurt by Everest get federal help\nGov. Jerry Brown on Thursday vetoed legislation from an Inland assemblyman that would have provided financial relief and legal aid for thousands of students affected by the abrupt closure this spring of the for-profit, Santa Ana-based chain Corinthian Colleges.\nIn his message, Brown expressed reservations about the cost associated with AB 573, which would have offered tuition recovery and assistance for those seeking loan forgiveness, waived fees for students transferring to community colleges, and restored Cal Grant financial aid eligibility.\nThe legislation was sponsored by Assemblyman Jose Medina, D-Riverside.\nWhile “well-intentioned,” he wrote, “I am not comfortable creating new General Fund costs outside of the budget process, particularly given the Cal Grant augmentations already included in this year’s budget.”\nCorinthian Colleges, which had been under fire from federal regulators, shut all 28 of its campuses April 26, including three Everest colleges in the Inland area – one in San Bernardino and two in Ontario. In addition to Everest, Corinthian also operated Heald and WyoTech colleges in California, Arizona, Oregon, Hawaii and New York.\nBrown, however, signed a bill by Sen. Janet Nguyen, R-Garden Grove, eliminating state income tax liability on forgiven student loan debt for former Corinthian students.\n“These students now possess a resource that will help put the past behind them while creating a clean slate from which they can achieve higher education,” Nguyen said in a statement.\nThe Sacramento Bee and staff writers contributed to this report.", "external_links": ["http://common.onset.freedom.com/images/gallery/twitter-ico.jpg", "http://images.onset.freedom.com/pressenterprise/gallery/nvxifq-pereverest0507001.jpg", "http://common.onset.freedom.com/images/gallery/fb-ico.jpg", "http://assets.pinterest.com/js/pinmarklet.js?r=", "http://s7.addthis.com/js/250/addthis_widget.js#username=YOUR-ACCOUNT-ID", "http://images.onset.freedom.com/pressenterprise/thumb/nvxifq-pereverest0507001.jpg", "http://common.onset.freedom.com/images/gallery/mail-ico.jpg"], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-10T04:17:24.344+03:00", "highlightTitle": ""}