{"organizations": [], "uuid": "153416e69c1e1f54afa0f5b7a4f4deb61e63495c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.coloradoan.com", "main_image": "http://www.gannett-cdn.com/-mm-/ca6f148d8e0be9124b4cf856a6c7c940c843fad0/c=0-376-3000-2064&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/19/FortCollins/B9319303928Z.1_20151019192027_000_G5CC8VNK6.1-0.jpg", "site_section": "http://rssfeeds.coloradoan.com/fortcollins/entertainment", "section_title": "Fort Collins - Entertainment", "url": "http://www.coloradoan.com/story/entertainment/2015/10/20/nights-halloween-fort-collins/74242850/", "country": "US", "title": "9 nights of Halloween", "performance_score": 0, "site": "coloradoan.com", "participants_count": 0, "title_full": "9 nights of Halloween", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T07:06:00.000+03:00", "replies_count": 0, "uuid": "153416e69c1e1f54afa0f5b7a4f4deb61e63495c"}, "author": "", "url": "http://www.coloradoan.com/story/entertainment/2015/10/20/nights-halloween-fort-collins/74242850/", "ord_in_thread": 0, "title": "9 nights of Halloween", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Erin Udell", "Evan Jones"], "text": "Erin Udell, erinudell@coloradoan.com 10:06 p.m. MDT October 19, 2015 Evan Jones, 10, slashes the air with his sickle during the 2013 Zombie Crawl. (Photo: Coloradoan library) CONNECT 1 TWEET LINKEDIN COMMENT EMAIL MORE \nWith Oct. 31 getting closer ( creepy organ music plays), climb aboard the Halloween Express and try out some spooky and family fun with the Coloradoan’s 9 Nights of Halloween. \nSpooky movies, creepy art and a zombie version of a high school dance? ( Lighting cracks, illuminating creepy hilltop graveyard) \nSign me up, y’all! \nFRIDAY \nTake a walk on the terrifying side \nRun screaming through a haunted corn maze this Halloween season with these three spots open Friday night in Northern Colorado: \n• Creepy Walk in the Woods, 1750 Savage Road, Loveland, 7 to 11 p.m. \n• Harrington Arts Alliance’s Haunted House of Horrors, 130 N Cleveland Ave., Loveland \n• Scream Acres Haunted Corn Maze, 20861 County Road 33, LaSalle \nSATURDAY \nA night of the living dead \nIs watching “Walking Dead” not enough for you? See the real-life (but not actually real, thank God!) version at Old Town Halloween Zombie Fest. This Old Town event features a family-friendly “Kidz Crawl” at 2 p.m., followed by the classic Zombie Crawl at 5 p.m. and a Zombie Ball at 10. \nTo take part in the Zombie Crawl, meet in Old Town Square dressed as the undead and snatch up a wristband ($16 for pre-sale, $20 the day of). Wristbands entitle you to specials from featured businesses in Old Town. \nWhen the crawl is finished, head to the Aggie Theatre around 10 p.m., where The Burroughs and Mama Lenny & The Remedy will be playing. The event (21 and older) features floors of “undead nightmares,” libations and the crowning of a Zombie Ball king and queen. Tickets for the ball are $17. \nSUNDAY \nPick a pumpkin \nIt’s getting time to get to carving. Head to one of Northern Colorado’s pumpkin patches for your pick of the Halloween doorstep decoration. Try: \n• The Bartels Farm, 3424 E. Douglas Road, Fort Collins \n• The Fritzler Corn Maze Pumpkin Patch, 20861 County Road 33, LaSalle \n• Harvest Farm, 4240 E. County Road 66, Wellington \n• Northern Colorado Corn Maze, 2318 S. County Road 5, Fort Collins \n• Osborn Farm, 1230 S. Boise Ave., Loveland \n• Something From the Farm, 8020 S. Timberline Road, Fort Collins \n• Tigges Farm, 12404 WCR 64 1 / 2 , Greeley \nMONDAY \nFind your costume \nIf you’re a normal person and haven’t had your costume planned since late Summer, head to some local costume shops for a little inspiration. Try: \n• Life of the Party, 4025 S. Mason St., Fort Collins \n• Costume Castle, 215 Cattail Bay, Windsor (call 970-576-8970 to set up an appointment, no walk-ins) \n• Princess Paradise, 1833 E. Harmony Road, No. 7, Fort Collins \n• Wear it Again, Sam, 140 S. College Ave., Fort Collins \n• Spirit, 3617 S. College Ave., Fort Collins \nTUESDAY \nGrab a slice \nFor the entire month of October, Totally 80s Pizza, 1717 S. College Ave., is paying homage to 1980s horror movies because somebody has to. Go in to see some creepy decorations and memorabilia from your favorite slasher flicks. Hours are 11 a.m. to 9 p.m. \nWEDNESDAY \nGet (creepy) cultured \nRunning until Nov. 4, check out a Halloween art exhibit with Halloween horror-themed pieces from Parabrahma Tattoo Collective. Check it out at 325 E. Mulberry St. \nTHURSDAY \nGo to sleep, if you dare \nIf you read the Coloradoan, you know by now that Lyric Cinema Cafe, 300 E. Mountain Ave., is hosting a Halloween movie month, complete with classic — and goofy — Halloween flicks. Um, hello, “Dude Bro Party Massacre III”! \nCatch one of the possibly most iconic films for the Halloween season, “A Nightmare on Elm Street,” which stops running Oct. 29. So head to the Lyric with $9 ($7 if you’re a student!) and get ready to see Freddy Krueger in your dreams, er, nightmares. \nOCT. 30 \nBabies in costumes! \nOne of the cutest Old Town events is back for another year. If you have a little one, head to Old Town Square for Tiny Tot Halloween, a family-friendly, safe trick-or-treating event to participating downtown businesses. \nThe event goes from 10 a.m. to 1 p.m. and is free for children 7 and under. \nOCT. 31 \nAll this build-up for one ghoulish night? Better make it count, Fort Collins. \nTry these local parties: \n• Halloween party at the Lyric \nWhen: Starting at 10 p.m. \nWhere: Lyric Cinema Cafe, 300 E. Mountain Ave. \nCost: $10, includes beer and pizza from Totally 80s \n• Halloween Monster Mash Ball (feat. Pep*Squad, Stella Luce, Senorita Sometimes and Harpoon, the Whale) \nWhen: Starts at 8 p.m. \nWhere: The Downtown Artery, 252 Linden St. \nCost: $10-12", "external_links": [], "published": "2015-10-20T07:06:00.000+03:00", "crawled": "2015-10-20T07:48:07.077+03:00", "highlightTitle": ""}