{"organizations": [], "uuid": "8933d02efa031f1a1c79950c88e210cdef5418ac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.philly.com", "main_image": "http://media.philly.com/images/paranormal-activity-paramount-600.jpg", "site_section": "http://www.philly.com/philly_entertainment.rss", "section_title": "Philly.com Entertainment", "url": "http://www.philly.com/philly/entertainment/20151023_Reuters_MT1VRT1201624963_Film_Review___Paranormal_Activity__The_Ghost_Dimension_.html", "country": "US", "title": "Film Review: 'Paranormal Activity: The Ghost Dimension'", "performance_score": 0, "site": "philly.com", "participants_count": 1, "title_full": "Film Review: 'Paranormal Activity: The Ghost Dimension'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T01:31:00.000+03:00", "replies_count": 0, "uuid": "8933d02efa031f1a1c79950c88e210cdef5418ac"}, "author": "Andrew Barker", "url": "http://www.philly.com/philly/entertainment/20151023_Reuters_MT1VRT1201624963_Film_Review___Paranormal_Activity__The_Ghost_Dimension_.html", "ord_in_thread": 0, "title": "Film Review: 'Paranormal Activity: The Ghost Dimension'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Film Review: 'Paranormal Activity: The Ghost Dimension' Paramount Pictures. Andrew Barker, Variety Media, LLC Posted: Friday, October 23, 2015, 6:22 PM \nBy Andrew Barker \nLOS ANGELES (Variety.com) - So this is the way a franchise ends. The sixth and allegedly final installment of the massively money-minting found-footage horror series, \"Paranormal Activity: The Ghost Dimension\" offers little more than a distant, whimpering echo of a film property that once made such a bang. Distinguished mostly by the addition of 3D and an unusual distribution window, the film is scheduled to hit VOD less than three weeks after leaving cinemas, to the chagrin of a few theater chains. It will be interesting to see if the experimental release strategy pays off in the long run, and it's not hard to imagine the \"Paranormal\" series living on thanks to the multiplicity of new digital content platforms. For all the memorable scares it manages to cook up, \"The Ghost Dimension\" might have actually worked better as a series of GIFs. \nThough it hardly invented the found-footage conceit, the original \"Paranormal Activity\" certainly helped elevate it to the status of a proper and profitable subgenre, with its own unique tropes and cinematic language. Subsequent sequels might have diminished its legacy a bit -- though last year's oft-maligned Latino-themed offshoot, \"The Marked Ones,\" was refreshingly unserious -- yet nothing compares to the feature-length shrug that director Gregory Plotkin offers this time around. There may well be new and novel ways to spark audience shivers from not-so-bright homeowners inexplicably using their cameraphones to check out bumps in the night, but this series clearly has neither the patience nor the inclination to look for them anymore. \nWhile it does answer some lingering questions about the franchise's overarching mythology, \"The Ghost Dimension\" spends most of its running time dully retracing old steps, introducing yet another suburban family -- father Ryan Fleege (Chris J. Murray), mother Emily Fleege (Brit Shaw), and 7-year-old daughter Leila (Ivy George) -- as they prepare for Christmas in their enormous new Santa Rosa house. Joining them for a few weeks is Ryan's brother Mike (Dan Gill), a commodiously mustached hipster recovering from a breakup, and Skylar (Olivia Taylor Dudley), a young blonde woman of unclear relation to the family, in town for some sort of yoga retreat that allows her to abruptly disappear from the film for long stretches. \nLike all \"Paranormal\" subjects, the Fleeges are chronic videographers, and Ryan gets to flex some new photographic muscles when he finds a old-school camcorder stashed in the garage, along with a collection of old family videos. In addition to looking charmingly retro, the camera also picks up a strange number of odd vibrations and apparitions around the house that are invisible to the naked eye, as well as more modern devices. (Not only are these Ghost-o-Vision sequences the film's most creative, they also provide it with its only non-financial reason to employ 3D.) \nAt first, the camera only shows Rorschach-like blobs of debris floating through the air, but it's not long before everything starts to go haywire. Young Leila develops a sudden allergy to Christian iconography and begins talking to an imaginary friend named Toby; Ryan and Mike pop in the old home movies only to discover footage of a strange cult with two telepathic children; and since even malevolent demons have a soft spot for vintage arcade games, the pinball machine starts turning on by itself. \nA certain degree of character stupidity is to be expected in a paint-by-numbers horror pic, so of course Ryan progresses through his collection of Sinister Mystery Videos That Might Explain Everything at a seeming rate of one per day, and of course the family lets Leila continue to sleep alone in her room even after she draws pagan symbols on her wall and icily intones, \"He's going to take me away ... \" But at times the film's multiple scripters almost seem to forget what has transpired in the scene previous: Characters can observe multiple instances of supernatural activity one night, then immediately revert into \"It's probably just a coincidence!\"-skeptics the next morning. \nWithout much spark to the jump scares, the film turns to hoary exorcism tropes and CGI fantasias in the later going, undoing much of the low-key believability that was essential to \"Paranormal's\" appeal in the first place. Youngster George makes for a very effective creepy kid when called upon, though her adult counterparts fail to leave much of an impression. The below-the-line crew doesn't have a whole lot to work with, considering the film never once leaves the family's property, yet the environs are as bland as can be, and one would have to trawl through the deepest recesses of Romanian art cinema to find a film with as many static, silent shots of empty rooms and unfurnished hallways.", "external_links": [], "published": "2015-10-24T01:31:00.000+03:00", "crawled": "2015-10-24T03:25:24.968+03:00", "highlightTitle": ""}