{"organizations": [], "uuid": "13fb8e3c5fb07b8e7c0e81a7bc4523e34a69ba13", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://images.canberratimes.com.au/2015/10/26/6959562/Thumbnail1001916032gkijgrimage.related.thumbnail.320x214.gkijcw.png1445828277057.jpg.jpg", "site_section": "http://feeds.canberratimes.com.au/rssheadlines/entertainment.xml#", "section_title": "Canberra Times Entertainment Headlines", "url": "http://www.canberratimes.com.au/entertainment/tv-and-radio/the-bachelorette-sam-frost-tipped-to-join-rove-as-cohost-of-2dayfm-breakfast-show-20151026-gkijcw.html", "country": "AU", "title": "The Bachelorette Sam Frost tipped to join Rove as co-host of 2DayFM breakfast show", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "The Bachelorette Sam Frost tipped to join Rove as co-host of 2DayFM breakfast show", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T04:58:00.000+02:00", "replies_count": 0, "uuid": "13fb8e3c5fb07b8e7c0e81a7bc4523e34a69ba13"}, "author": "Andrew Hornery", "url": "http://www.canberratimes.com.au/entertainment/tv-and-radio/the-bachelorette-sam-frost-tipped-to-join-rove-as-cohost-of-2dayfm-breakfast-show-20151026-gkijcw.html", "ord_in_thread": 0, "title": "The Bachelorette Sam Frost tipped to join Rove as co-host of 2DayFM breakfast show", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play video Return to video Video settings Please Log in to update your video settings\nVideo will begin in 5 seconds.\nDon't play Play now More video Recommended Replay video Return to video Video settings Please Log in to update your video settings\nBachelorette Sam Frost chooses Sasha Sam Frost reveals she has finally found love after picking builder Sasha Mielczarek.\nPT0M42S http://www.canberratimes.com.au/action/externalEmbeddedPlayer?id=d-4508a 620 349 October 22, 2015 Autoplay On Off Video feedback Video settings She's apparently just found the love of her life on The Bachelorette , but Sam Frost is about to undertake what ranks as one of the great passion killers: waking up at ungodly hours to work on breakfast radio.\nStrong rumours circulating the Sydney radio market indicate that Frost will join Rove McManus as co-host of the embattled FM radio station 2DayFM's ailing breakfast show following the ousting of previous breakfast hosts Maz Compton and Dan Debuf.\nHowever verifying the rumours with 2DayFM owners, Southern Cross Austereo, has proven difficult as the network's head publicist, Heidi Virtue, has left the media company just five weeks after starting in the gig. Another spokesperson for the network declined to comment on whether Frost will be joining McManus in the studio.\nNew lovers Sam Frost and Sasha Mielczarek after The Bachelorette finale last week. Photo: Instagram \n​PS understands McManus, who is being paid a reported $350,000 worth of shares every six months for the duration of his three year contract, will launch the new show on Sydney airwaves next Monday with Frost by his side.\nAdvertisement The move is the latest attempt by 2DayFM to regain the FM breakfast ratings crown in Sydney which was ripped away when its former star personalities, Kyle Sandilands and Jackie O, were  poached by rival KIISFM, taking their huge audience and advertising revenue with them.\nSince then the station has experimented with a long line of personalities, including former Spice Girl Melanie Brown, Sophie Monk, Jules Lund and Merrick Watts.\nRove McManus will front 2DayFM's new breakfast radio show in 2016. Photo: Simon Schluter \nThe jury is out on how McManus will fair in the gig, with 2DayFM suddenly removing a 10 minute teaser podcast featuring McManus and his breakfast executive producer Tim Dunlop, described as \"horrible and amateurish\" in the News Corp press on Sunday.\nLast week Frost chose Sasha Mielczarek  as her man on The Bachelorette series, the pair reportedly house hunting in Sydney for a new home.\nFrost told Monday's edition of New Idea magazine: \"He's the one for me, signed, sealed, delivered, I'm done.\"", "external_links": [], "published": "2015-10-26T04:58:00.000+02:00", "crawled": "2015-10-26T16:45:05.358+02:00", "highlightTitle": ""}