{"organizations": [], "uuid": "9c5762edd38844ae369c9cce35f91a4082cccc49", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.aceshowbiz.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Aceshowbizcom-EntertainmentNews\r", "section_title": "Aceshowbiz.com - Entertainment News", "url": "http://www.aceshowbiz.com/news/view/00090152.html", "country": "US", "title": "Kim Kardashian 'Nervous About' Introducing North to Her Unborn Child", "performance_score": 0, "site": "aceshowbiz.com", "participants_count": 1, "title_full": "Kim Kardashian 'Nervous About' Introducing North to Her Unborn Child", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T02:29:00.000+03:00", "replies_count": 0, "uuid": "9c5762edd38844ae369c9cce35f91a4082cccc49"}, "author": "AceShowbiz.com", "url": "http://www.aceshowbiz.com/news/view/00090152.html", "ord_in_thread": 0, "title": "Kim Kardashian 'Nervous About' Introducing North to Her Unborn Child", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments 'Not going to lie, I'm a little nervous about bringing baby No. 2 into the mix,' Kim admitted, adding, 'I'm nervous about how North will react.' \nAs her due date for baby number two is fast approaching, Kim Kardashian has revealed her anxiety of introducing daughter North West to her little brother. The pregnant \" Keeping Up with the Kardashians \" star got candid in a new blog post published on her website on Friday, October 23, admitting she is \"a little nervous\" about bringing him into the mix. \"Not going to lie, I'm a little nervous about bringing baby No. 2 into the mix,\" wrote the 35-year-old entertainer. \"I'm nervous about how North will react, but I know she'll be such a good big sister and I can't wait to have this addition to our family. I know it it won't be easy - North even has a hard time adjusting when I hold other babies!\" Though so, Kim revealed she and husband Kanye West are doing the best they can to prepare their firstborn. \"We read books with her about getting a baby brother and a new sibling all the time!\" the reality star wrote. \"We always say goodnight to baby brother.\" Besides, Kourtney Kardashian 's daughter, Penelope, helped, too. \"Right now anything her cousin Penelope does, she does,\" Kim admitted in the post (via PEOPLE). \"So it's really helpful that P has a little baby brother!!!\" Kim revealed further in the blog post that she is \"just trying to spend as much time as possible with North\" in the meantime. \"I don't have that many more nights with just me and her before the baby comes and changes her world completely. I'm really trying to spend most of my time at home so we have this special bonding time,\" she explained. Above all, Kim made sure she spent time with Kanye too. \"I'm busy preparing for the baby but it's still SO important to me to make time for my husband. Our schedules are already so busy and I know that the first few months when the baby comes will be harder and more hectic. I know how important it is to do things on our own. We'll definitely go on a movie night and go out to dinner ... He really is the best partner,\" she gushed. \"I wouldn't want to go through any of this without him by my side!\" \n© AceShowbiz.com", "external_links": [], "published": "2015-10-24T02:29:00.000+03:00", "crawled": "2015-10-24T11:08:02.849+03:00", "highlightTitle": ""}