{"organizations": [], "uuid": "44f0d1ad454abc897af3b897986f2aa49e71deba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.vindy.com", "main_image": "http://media.vindy.com/content/image/a/5/logo/v5logo.gif", "site_section": "http://www.vindy.com/rss/headlines/entertainment", "section_title": "Vindy.com stories: Entertainment", "url": "http://www.vindy.com/news/2015/oct/14/record-reviews/", "country": "US", "title": "RECORD REVIEWS", "performance_score": 0, "site": "vindy.com", "participants_count": 0, "title_full": "RECORD REVIEWS", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T07:00:00.000+03:00", "replies_count": 0, "uuid": "44f0d1ad454abc897af3b897986f2aa49e71deba"}, "author": "", "url": "http://www.vindy.com/news/2015/oct/14/record-reviews/", "ord_in_thread": 0, "title": "RECORD REVIEWS", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published: Wed, October 14, 2015 @ 12:00 a.m. \nSelena Gomez \nAlbum: “Revival” \nGrade: A \nSophomore albums are notoriously tricky propositions, but Selena Gomez’s second solo venture, “Revival,” breezes through to the finish line – the dance floor – with 11 nearly impeccable tracks that skip from the 1960s to the ‘80s to right this minute. \nOn “Revival,” Gomez continues her foray into a heady mix of electronic dance music pop accessorized with rapping from A$AP Rocky, writing from Charli XCX, soulful pianos, steel drums, and her own chameleon voice, showcasing her pipes in the piano-accompanied “Hands to Myself” and with warm, rich vocals in the serious yet jubilant “Revival.” \nThe first single from the album, “Good for You,” her biggest hit to date, is a subtle electro tune. But the song’s flow suffers with A$AP Rocky’s bewildering (if trendy) interlude – a minor hiccup on an otherwise seamless album. “Same Old Love” starts off with a whimsical ‘60s feel, but morphs into a punchy bass dance track. \n“Body Heat” is on odd saxophone infused Latino drum dance floor scorcher, but it’s “Survivors” that true trance-house addicts will fall for. “Kill Them With Kindness” is an approachable dance track with added bells and whistles (literally), while “Sober” brings ’80s synthesizers to the fore. \n—Cristina Jaleru, Associated Press \nAlbum: “35 mph Town” \nGrade: A \nFor the first time in a decade, Toby Keith let two years pass between albums. As prolific as he is consistent, Keith took time off from recording – and returns “35 mph Town,” an album as entertaining as his best. \nConsidering he writes nearly all of his material – including nine of 10 new songs – a break allowed him to cherry-pick the top tunes. Not that the veteran country star has been slipping: 2013’s “Drinks After Work” and 2010’s “Bullets In The Gun” also were high-water marks in his 22-year career. \n“35 mph Town” highlights Keith’s playful side: “Good Gets Here” and “Every Time I Drink I Fall In Love” poke fun at his foibles, while “Drunk Americans” joins a long list of Keith tunes addressing blue-collar workers’ tendency to blow off steam by tipping back a few. \nKeith continues country music’s fixation with island rhythms on “Rum Is The Reason” and “Sailboat For Sale,” the latter a duet with Jimmy Buffett, the man responsible for country’s tropical obsession. Even when walking on familiar ground, though, Keith’s clever lyrical twists and narratives make the trek fresh and fun. Long may he keep cruising, at whatever speed he wants. \n—Michael McCall, Associated Press \nAlbum: “Fast Forward” \nGrade: B+ \nJoe Jackson knows it’s a big world and on “Fast Forward,” his return to pop songwriting, he has bridged the Atlantic Ocean to record four songs each in New York, Amsterdam, Berlin and New Orleans. \nBacked by different musicians in each city, “Fast Forward” is held together by Jackson’s still-clear voice, congenial piano-playing and sharp compositions. \nThe longest song on the album, the six-minute “Fast Forward” muses about generation gaps and modern life, how “Everyone is a genius, but no one has any friends,” all amid a yearning Regina Carter violin solo. \nIn the New York section, a cover of Television’s “See No Evil” has Bill Frisell’s torrid solo masterfully evoking Tom Verlaine’s original, adding his own twists. The returning Graham Maby, Jackson’s longtime bass player, and drummer Brian Blade complete a dream team. \nIn Berlin, Jackson turns to his angry not-so-young man persona on “Junkie Diva” and “If I Could See Your Face.” In contrast, the tunes recorded in New Orleans with members of Galactic glides by with power and plenty of local zest. \n—Pablo Gorondi, Associated Press", "external_links": [], "published": "2015-10-14T07:00:00.000+03:00", "crawled": "2015-10-14T07:26:42.425+03:00", "highlightTitle": ""}