{"organizations": [], "uuid": "273c1abbeb45a9ede4133538a55fe5e2811af6f6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "theadvocate.com", "main_image": "http://theadvocate.com/csp/mediapool/sites/dt.common.streams.StreamServer.cls?STREAMOID=ZRHyXc5kmUW3Z$HkYHoOjs$daE2N3K4ZzOUsqbU5sYtzOxaeABZRBdXcQ$$TUStbWCsjLu883Ygn4B49Lvm9bPe2QeMKQdVeZmXF$9l$4uCZ8QDXhaHEp3rvzXRJFdy0KqPHLoMevcTLo3h8xh70Y6N_U_CryOsw6FTOdKL_jpQ-&CONTENTTYPE=image/jpeg", "site_section": "http://theadvocate.com/feed?feedName=Entertainment&feedURL=http://theadvocate.com/entertainment/&publication=Advocate&sections=/entertainment/&areas=AllEntertainment&counts=20&feedContentPage=/shared/templates/feeds/rss2.csp", "section_title": "The Advocate: Entertainment", "url": "http://theadvocate.com/entertainment/allentertainment/13690589-31/outlying-areas-calendar-for-oct", "country": "US", "title": "Outlying Areas calendar for Oct. 16-22, 2015", "performance_score": 0, "site": "theadvocate.com", "participants_count": 0, "title_full": "Outlying Areas calendar for Oct. 16-22, 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:11:00.000+03:00", "replies_count": 0, "uuid": "273c1abbeb45a9ede4133538a55fe5e2811af6f6"}, "author": "", "url": "http://theadvocate.com/entertainment/allentertainment/13690589-31/outlying-areas-calendar-for-oct", "ord_in_thread": 0, "title": "Outlying Areas calendar for Oct. 16-22, 2015", "locations": ["Lafayette", "La"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Boudin", "LESLIE WESTBROOK", "Menard", "Don Menard"], "text": "Outlying Areas calendar for Oct. 16-22, 2015 Outlying Areas calendar for Oct. 16-22, 2015 Advocate story Comments Advocate staff photo by LESLIE WESTBROOK -- Don Menard, manager of Menard's Cajun Grocery, slices boudin links Tuesday, October 13, 2015, at the store in Duson, La. Menard's will be serving boudin, boudin balls, boudin wraps and boudin nachos during the Boudin Cook-off this weekend in Lafayette. FRIDAY \nSOUTHEASTERN DANCE PERFORMANCE PROJECT: 9:30 a.m. and 12:30 p.m., Vonnie Borden Theatre, 1220 SGA, Hammond. General admission tickets are $5 and will be available one hour prior to the performance. SATURDAY \nBOUDIN COOKOFF: 10 a.m.-4 p.m., Parc Sans Souci, Lafayette. This annual event features music from The Specklers and Zydeco Radio, and, oh yes, boudin, tons of boudin. Free, but sample tickets are 8 for $5. For more information, visit boudincookoff.com . JEANERETTE LIVE: 10 A.M. TO 10 P.M., MAIN ST., JEANERETTE. THIS EVENT WILL FEATURE BOOTHS WITH HAND CRAFTED ITEMS, A KIDS ZONE, FOOD AND LIVE MUSIC THROUGHOUT THE DAY. WILD THINGS YOUTH ART CONTEST AND EXHIBITION: 10 A.M., BAYOU LACOMBE VISITOR CENTER, 61389 LA. 434, LACOMBE. THE COMPETITION SPOTLIGHTS THE RICHNESS OF SOUTHEAST LOUISIANA’S NATIVE WILDLIFE AND HABITATS THROUGH DRAWING AND PAINTING MEDIUMS, AND ENCOURAGES AREA YOUTH TO LEARN MORE ABOUT THEIR NATURAL HERITAGE. LIGO LIVINGSTON OBSERVATORY: 1 P.M. TO 5 P.M., LIGO SCIENCE EDUCATION CENTER, 19100 LIGO ROAD, LIVINGSTON. SATURDAY-SUNDAY \nVOICES FROM OUR PAST: St. Landry Catholic Church Cemetery Tours: 6 p.m., 7 p.m. and 8 p.m. Saturday, and 2 p.m. and 3 p.m. on Sunday, St. Landry Catholic Church, Valentin Hall, 1020 N. Main St., Opelousas. \nLOUISIANA COMIC CON: 10 a.m.-6 p.m. Saturday, 11 a.m.-5 p.m. Sunday, Cajundome, 444 Cajundome Blvd., Lafayette. Enjoy art, cosplay and games at this event. louisianacomiccon.com SUNDAY \nSILVERBACKS IMPROV THEATRE PRESENTS “HORRORSHOW”: 7:30 p.m., Theatre 810, 810 Jefferson St., Lafayette. The improv group will present an improvised take on psychological horror. The show is pay-what-you-can. To make reservations and more information, call (337) 484-0172. WEDNESDAY \nBACK TO THE FUTURE PARTY: 6:30 p.m.-10 p.m. Parc International, Lafayette. Enjoy live music, a selfie station and more at this “Back to the Future”-tinged party. ONGOING \nBAYOU TECHE MUSEUM: 131 W. Main St., New Iberia. \nHALLOWEEN AT CAJUN RVERA: 3:30 p.m. to 5:30 p.m., Cajun RVera/SugArena, 713 Northwest Bypass, New Iberia. Trick or treat every Saturday in October. Costume contests also will be held. \nTHE HAUNTED THEATRE HAUNTED HOUSE: 7 p.m. to 10 p.m., The Teche Theatre for the Performing Arts, 501 Main St., Franklin. Every Friday and Saturday in Oct. Admission is $5. \nSLU STUDENT ARTWORK: The Hammond Regional Arts Center, at 217 E. Thomas St., Hammond. The HRAC invites the public to stop by and see work currently being produced by SLU’s art and design students. Exhibit will run through Oct. 30. \nJAM SESSION: 7 p.m.-11 p.m. Fridays, Cajun Campground, 5552 U.S. 190, Eunice. A Cajun tradition in which both amateur and seasoned musicians take turns playing a tune. \nJEANERETTE MUSEUM: 500 E. Main St., Jeanerette. Learn about the last 200 years of the sugarcane industry, the cypress lumber industry and the days of the steamboat. Hours are 10 a.m.-4 p.m. Tuesday-Friday. (337) 276-4408 or jeanerettemuseum.com \nLE VIEUX VILLAGE: 828 E. Landry St., Opelousas. Hours are 8 a.m.-4:30 p.m. Monday-Friday, and 9 a.m.-4 p.m. Saturday. cityofopelousas.com/le-vieux-village \nROSEDOWN PLANTATION STATE HISTORIC SITE: La. 10, St. Francisville. (225) 635-3110 or lastateparks.com \nLA TABLE FRANÇAISE AT JAVA SQUARE CAFE: 4 p.m. Fridays, Java Square Cafe, 103 W. Landry St., Opelousas. Grab a cup of coffee and share conversation and fun with other French speakers. Free admission. \nUNIVERSITY ART MUSEUM UNIVERSITY OF LOUISIANA AT LAFAYETTE: 710 E. St. Mary Blvd., Lafayette. “Selections from the UL College of Art Faculty” will be on display through Dec. 12. Also, the museum’s exhibits “Art Under the Big Sky” and “Imprinting the West” will run through Jan. 2. Hours are 9 a.m.-5 p.m. Tuesday and Thursday, 9 a.m.-8 p.m. Wednesday, 10 a.m.-5 p.m. Saturday. (337) 482-2278 or hilliardmuseum.org \nWASHINGTON ART GALLERY: Corner of Veterans Boulevard and Church Street, Washington. Hours are 9 a.m.-4 p.m. Friday-Sunday. See “Washington Historic,” an exhibit of paintings, including colorful, abstract Louisiana landscapes. (337) 351-3043 or artworkbybertrand@yahoo.com \nCompiled by Marchaund Jones", "external_links": [], "published": "2015-10-16T03:11:00.000+03:00", "crawled": "2015-10-16T21:15:29.875+03:00", "highlightTitle": ""}