{"organizations": [], "uuid": "310301ddc144fb92c4c614446262a71b04572ffe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266347/arts-entertainment-general", "section_title": "Arts &amp; Entertainment: General - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30327701/craft-hobby-association-industry-awards-announced", "country": "US", "title": "Craft & Hobby Association Industry Awards Announced", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Craft & Hobby Association Industry Awards Announced - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T22:11:00.000+03:00", "replies_count": 0, "uuid": "310301ddc144fb92c4c614446262a71b04572ffe"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30327701/craft-hobby-association-industry-awards-announced", "ord_in_thread": 0, "title": "Craft & Hobby Association Industry Awards Announced", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Craft & Hobby Association (CHA) is pleased to announce the recipients of the industry's most prestigious service awards: the Meritorious Award of Honor, the Industry Achievement Award and the Special Recognition Award.\nElmwood Park, NJ (PRWEB) October 22, 2015\nThe Craft & Hobby Association (CHA) is pleased to announce the recipients of the industry's most prestigious service awards: the Meritorious Award of Honor, the Industry Achievement Award and the Special Recognition Award. All awards recognize exceptional contributions to the craft industry as well as philanthropy efforts and community activity. These awards will be presented during the CHA Foundation Gala Celebration on Sunday, January 10, 2016 during the CHA MEGA Conference & Trade Show (CHA MEGA Show) in Anaheim, California.\nThe Meritorious Award is the highest honor that CHA bestows, and acknowledges an individual or group that has made a significant contribution to the Association and industry. This year’s recipient is Larry Olliges.\nA well-respected and successful independent craft retailer, Larry oversees Dee’s Crafts, which has been celebrating over 40 years in business. Larry has tirelessly dedicated his time to serve the Association and craft industry. Larry served on a variety of CHA and ACCI committees, including Chairing the CHA Membership and Dues Committee. From 2004-2009, he served on the CHA Board of Directors and held the position of CHA Board Chairman in 2011 and 2012. His numerous accomplishments as a business professional and CHA leader have been positively influential in shaping the direction of the Association and crafting industry.\nThe Industry Achievement Award is awarded to a CHA member (individual, group and/or company) that has made a significant contribution to the growth and vitality of the craft and hobby industry as a whole. This year’s recipient is Katherine (Kathie) Stull, Owner and President of KS Productions.\nFor over 24 years, KS Productions has been the leading supplier of how-to programming for public television. Kathie and KS Productions set a standard for high quality and are at the forefront in developing programming that attracts and inspires the how-to audience. Kathie has produced over 17 titles and 2,800 episodes along with hundreds of product videos for many manufacturers. Most recently, Kathie has worked with Amazon Prime to offer the first online subscription for the show, It’s Sew Easy, making access easily available to sewing fans.\nThe CHA Special Recognition Award is given to individuals or groups for their extraordinary contributions in positively showcasing the craft and hobby industry. This year’s recipients are Chip Purkey, Spinrite’s Caron United and Elena Lai Etcheverry.\nChip has been involved with crafts his entire life, but currently serves as Director of Production and Warehouse Management for Help Hospitalized Veterans (HHV), whose mission is to provide therapeutic arts and crafts to military and veteran patients across the United States, and around the world. In his role, Chip is responsible for not only selecting crafts for injured patients, but also adapting crafts based on the nature of their injuries and individual skills. He has supplied over 140,000 craft kits to service members and veterans this past year and had a hand in every single one. His heartfelt, unwavering commitment to military and veteran patients and the therapeutic craft products that he has personally developed, produced and distributed have truly enhanced thousands of lives.\nIn 2014, Spinrite LP, North America’s largest craft yarn producer, announced its campaign to support Children of Fallen Patriots Foundation (Fallen Patriots), whose mission is to provide college scholarships and educational counseling to military children who have lost a parent in the line of duty. From every ball of Caron United yarn that is purchased, 15 cents is donated to Fallen Patriots. Caron United’s awareness efforts and support of Fallen Patriots has resulted in over $100,000 in donations.\nElena Lai Etcheverry is the Executive Director of the Charity Wings Art & Craft Center, a 6,000 square foot space that provides art classes and events for other non-profit organizations and members of the San Marcos, California community. The Center is a gathering place that cultivates creativity, team work, self-expression and healing. Charity Wings also fundraises for other non-profits through creative arts events. Since 2006, it has helped over 70 worthy causes raise over $300,000. In addition, Elena spreads the joys of crafting to enthusiastic consumers through her live webcasts.\n“Everyone honored is passionate, dedicated, confident and committed, all of which are traits of successful leaders. They are prime examples of how people’s actions can have a positive and profound impact on the craft industry, and beyond. Congratulations to each of them,” stated Mark Hill, Interim President and CEO, Craft & Hobby Association.\n“The CHA Awards Committee is proud to present this year’s award winners. These are people who've worked tirelessly behind-the-scenes, making a major impact on our creative industry, and on the individuals who benefit from their work. We appreciate their dedication and service to the Craft & Hobby Association and are proud to give them these awards,” stated Roseann Meehan Kermes, CHA Board Member & Awards Committee Chair.\nThe awards will be presented to the recipients or their representatives at the 75th Annual CHA MEGA Show in Anaheim, California, on January 10, 2016 during the CHA Foundation Gala Celebration. Visit http://www.chamegashow.org for more information on the CHA MEGA Show and Gala.\nABOUT THE CRAFT & HOBBY ASSOCIATION\nThe Craft & Hobby Association (CHA) is an international non-profit trade association consisting of thousands of member companies engaged in design, manufacture, distribution and retail sales of products worldwide in the U.S. craft and hobby industry. For more information about CHA, membership or its award-winning CHA Conference & Trade Show, visit http://www.craftandhobby.org .\n //www.prweb.com/releases/2015/10/prweb13038261.htm\n ", "external_links": ["http://www.prweb.com/releases/2015/10/prweb13038261.htm"], "published": "2015-10-22T22:11:00.000+03:00", "crawled": "2015-10-22T21:55:41.705+03:00", "highlightTitle": ""}