{"organizations": [], "uuid": "feb852a70565f7dd8785cdaf344c8b74f5038015", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.arcamax.com", "main_image": "http://www.arcamax.com/newspics/131/13133/1313333.jpg", "site_section": "http://www.arcamax.com/", "section_title": "News &amp; Entertainment by Email | ArcaMax Publishing", "url": "http://www.arcamax.com/currentnews/newsheadlines/s-1734115?fs", "country": "US", "title": "Poll: Ben Carson leading Hillary Clinton, Joe Biden and Bernie Sanders in Ohio, Pennsylvania | & Features", "performance_score": 0, "site": "arcamax.com", "participants_count": 2, "title_full": "Poll: Ben Carson leading Hillary Clinton, Joe Biden and Bernie Sanders in Ohio, Pennsylvania | News & Features | ArcaMax Publishing", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T03:00:00.000+03:00", "replies_count": 1, "uuid": "1e0d8e2d579e26b86163f285e41b0fb3622a54ab"}, "author": "arcamax.com", "url": "http://www.arcamax.com/currentnews/newsheadlines/s-1734115?fs#post-0", "ord_in_thread": 0, "title": "Poll: Ben Carson leading Hillary Clinton, Joe Biden and Bernie Sanders in Ohio, Pennsylvania | & Features", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK -- Hillary Clinton is still leading the Democratic primary in three key swing states -- Florida, Ohio, and Pennsylvania -- but a new poll suggests she may have more to worry about than whether Vice President Joe Biden enters the race: Neurosurgeon Ben Carson could potentially pose a threat to the entire Democratic field.\nIf the election were held today and Carson were the Republican nominee, he would beat Clinton, Biden and Sen. Bernie Sanders in the battleground states of Ohio and Pennsylvania and also best the Vermont independent in Florida, according to a new Quinnipiac poll. No president has won the general election since 1960 without carrying two out of those three swing states.\nIn Ohio, Carson would defeat Biden by 4 percentage points (46 percent to 42 percent), Clinton by 9 points (49 percent to 40 percent) and Sanders by 12 points (48 percent to 36 percent), according to the poll. In Pennsylvania, the retired neurosurgeon would beat Clinton by 9 points (49 percent to 40 percent) and Sanders by 10 points (47 percent to 37 percent). And while Biden, who was born in Pennsylvania, is often called the state's third senator, Carson would best him by 5 points there, 47 percent to 42 percent, according to the poll. In Florida, Carson would defeat Sanders 46 percent to 40 percent, but trails Biden by a margin of 45 percent to 42 percent, and Clinton by 45 to 42 percent.\nThe poll is the latest evidence that the political outsider is on an upswing, at least for now. Carson enjoyed a rise in the polls following the first Republican primary debate in August and raised $20 million during the third quarter. His primary numbers are not quite as encouraging. He still trails Donald Trump by a margin of 28 percent to 16 percent in Florida, by 23 percent to 18 percent in Ohio, and by 23 percent to 17 percent in Pennsylvania, but is the stronger of the two men against the top Democrats.\n\"Trump, despite his strong showing in mock Republican primaries, fares worst among the GOP candidates matched against the three Democratic aspirants -- giving some credence to pundits who say the billionaire could be every Democrats' favorite GOP nominee.\" Peter A. Brown, assistant director of the Quinnipiac University poll, said in a statement.\nThe poll also shows more good news for Biden, who has yet to announce whether he will mount a campaign. While Clinton would lose to former Florida Gov. Jeb Bush (43 percent to his 44 percent) and Sen. Marco Rubio (44 percent to his 45 percent) in Florida if the election were held today, Biden would defeat both Republicans by 3 percentage points, according to the poll. In Ohio and Pennsylvania, Biden would beat Bush, Rubio, and former Hewlett-Packard CEO Carly Fiorina while Clinton trails all three.\n\"When we get past the playoffs to the World Series, the general election face-off, Biden does better against leading Republicans than does Clinton or Sanders,\" Brown said.\nThe swing state poll was conducted from Sept. 25 to Oct. 5. The Florida portion surveyed 1,173 voters and has a margin of error of plus or minus 2.9 percent. In Ohio, Qunnipiac questioned 1.180 voters and the poll had a margin of error of plus or minus 2.9 percent. In Pennsylvania, 1,049 voters were surveyed, and the poll had a margin of plus or minus 3 percent.\n(c)2015 Bloomberg News\nVisit Bloomberg News at www.bloomberg.com\nDistributed by Tribune Content Agency, LLC.\nShare Comment", "external_links": ["http://www.facebook.com/sharer.php?u=http://www.arcamax.com/currentnews/newsheadlines/s-1734115&h=Poll%3A+Ben+Carson+leading+Hillary+Clinton%2C+Joe+Biden+and+Bernie+Sanders+in+Ohio%2C+Pennsylvania", "https://plus.google.com/share?url=http://www.arcamax.com/currentnews/newsheadlines/s-1734115", "http://twitter.com/share?url=http://www.arcamax.com/currentnews/newsheadlines/s-1734115&hashtags=ArcaMax"], "published": "2015-10-07T03:00:00.000+03:00", "crawled": "2015-10-08T12:02:20.515+03:00", "highlightTitle": ""}