{"organizations": [], "uuid": "fb807d3f41fe53eb0d49e3f190d6d6f372459a5f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.myjoyonline.com", "main_image": "http://photos.myjoyonline.com/photos/news/201510/9238601617618_6713125649373.png", "site_section": "http://www.myjoyonline.com/pages/rss/site_entertainment.xml", "section_title": "Ghana Entertainment HomePage", "url": "http://www.myjoyonline.com/entertainment/2015/October-12th/12-things-about-mike-tysons-sex-life.php", "country": "US", "title": "12 things about Mike Tyson's sex life", "performance_score": 0, "site": "myjoyonline.com", "participants_count": 0, "title_full": "12 things about Mike Tyson's sex life", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T08:10:00.000+03:00", "replies_count": 0, "uuid": "fb807d3f41fe53eb0d49e3f190d6d6f372459a5f"}, "author": "", "url": "http://www.myjoyonline.com/entertainment/2015/October-12th/12-things-about-mike-tysons-sex-life.php", "ord_in_thread": 0, "title": "12 things about Mike Tyson's sex life", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mike Tyson", "Robin Givens"], "text": "Date: 12-10-2015 Time: 05:10:36:pm Mike Tyson married actress Robin Givens \nEarly this year, Mike Tyson made an appearance on Jimmy Kimmel Live and talked at length about why he lost to Buster Douglas in stunning fashion 25 years ago. But he didn't talk about it in technical boxing terms. In fact, he didn't talk about the match much at all. Instead, he blamed the loss on—get this—his inability to stop having sex with hotel maids in the days leading up to the fight.\"I had to hit all the maids,\" he said. It was a funny moment. But after we got done laughing, it also made us think, \"Why does it feel like we know so much about Mike Tyson's sex life?\" Or better yet, \"Why does Iron Mike seem to enjoy sharing so many details about his sex life?\" Over the years, we've heard all about it from both Tyson himself and people who have known him in the past—with more strange, over-the-top sexcapades than we've been able to handle. \nSo with that in mind, here are 12 Things We Really Wish We Didn't Know About Mike Tyson's Sex Life. TMI, Mike! \n1. He routinely had sex with female visitors who came to see him while he was locked up in jail. From April 1992 through March 1995, Tyson was incarcerated at the Indiana Youth Center in Indianapolis after being convicted on a rape charge stemming from an incident that took place in July 1991 (he has steadfastly maintained his innocence in that case). But strangely enough, he didn't let that stop him from seeing women. According to his autobiography, Undisputed Truth, he got plenty of action behind bars.\"I was having so much sex that I was too tired to even go to the gym and work out,\" he wrote. \"I'd just stay in my cell all day.\" 2. He claimed that he had sex with a drug counselor in prison after paying $10,000 to have the roof of her house fixed. In addition to having sex with random women who visited him while he was in jail from 1992 through 1995, Tyson also reportedly carried on an affair with his drug counselor. After he paid $10,000 to fix her roof, Tyson says the two began having sex and carried on a sexual affair while he was locked up. 3. He was sleeping with about 15 women every day before going to prison in 1992. Want to know why Tyson needed to sleep with a ton of women during his time in prison? Look no further than this. At the height of his popularity, Tyson was sleeping with about 15 women per day prior to his prison stint. How is that even possible? 4. He allegedly used a Wizard pocket computer to keep track of the names and sexual preferences of the women he slept with in the early 1990s. In August 1992, while Tyson was locked up, one of his former bodyguards Rudy Gonzalez did an interview with the New York Post and revealed that Tyson was meticulous when it came to keeping track of his sexual escapades. Gonzalez claimed that Tyson went as far as to keep the names of more than 1,300 women in a handheld computer alongside notes about each of their preferences in bed.\"A lot of them are women whose names you'd recognize,\" he said. \"But the 1,300 doesn't count the one-night stands, the groupies.\" 5. He continued having sex with his ex-wife Robin Givens while they were going through a divorce—before eventually catching her in bed with Brad Pitt In 1989, less than two years after marrying Givens, Tyson parted ways with her. However, during an interview with Yahoo! Sports reporter Graham Bensinger in December 2012, he claimed that he was still having sex with her at that time. But he also revealed that she was sleeping with Pitt as well.\"I was getting a divorce, but…every day, before I would go to my lawyer's office to say, 'She's a pig and stealing,' I would go to her house to have sex with her,\" he said. \"This particular day, someone beat me to the punch. And I guess Brad got there earlier than I did. I was mad as hell…You should have seen his face when he saw me.\" 6. He once had sex with Naomi Campbell inside of a bathroom at a party in New York City while his manager stood outside. Tyson's volatile relationship with the model isn't exactly a secret. But in his book, Taming the Beast: The Untold Story of Mike Tyson, Tyson's former manager Rory Holloway claimed that Tyson and Campbell's relationship started with a romp in a restroom in the middle of a party.\"I was there to keep Mike out of trouble, doing my usual babysitting job, and when I looked over, he was talking to this girl,\" Holloway wrote. \"I had to rub my eyes. It was Naomi Campbell. Mike says he's got to use the restroom. Next thing, Naomi's following him and I'm outside holding their drinks. Guests are walking up and I'm telling them, 'Bathroom's taken.'\" 7. He used to have 24-hour security guards posted outside his hotel rooms before fights who were instructed to prevent him from having sex. Tyson's former manager Rory Holloway expressed a real concern for the boxing champ during his time with him. He thought that Tyson suffered from sex addiction, so he tried to do whatever he could to limit Tyson's sexual activity. And before big fights, that included positioning security guards outside of his hotel rooms so that girls couldn't come in and Tyson couldn't go out. 8. He slept with a 50-something-year-old cashier that he met during a trip to K-mart in the middle of one particularly promiscuous period of his life. \n\nBy now, you've probably noticed that Tyson has slept with a lot of women. But it's worth noting that he didn't have many standards when it came to having sex by the late 1990s. He's even admitted that he once picked up a K-mart cashier simply because she was the closest woman to him at the time. 9. He confessed to sleeping with women while wearing his championship belts. After becoming the youngest heavyweight boxing champion ever at the age of just 20, Tyson thought he could do whatever he wanted. So he slept with a lot of women and, at times, got out of control.\"In my mind, I had no peers,\" he wrote in his autobiography, Undisputed Truth. \"I was the youngest heavyweight champion in the history of boxing. I was a titan, the reincarnation of Alexander the Great. Sometimes, I'd get naked and put the championship belt on and have sex with a girl.\" 10. He once had a cocaine-fueled orgy interrupted by a surprise visit from his probation officer. During a November 2013 appearance on Jimmy Kimmel Live (Tyson seems to enjoy telling all to Jimmy Kimmel, huh?), Tyson talked about the time that his probation officer caught him doing the dirty with drugs nearby.\"It wasn't good because cocaine was on the property,\" he said. \"You never saw an erection [lost] so quickly.\" 11. He admitted to having nothing but orgies at one point in his life. When you have it as much as Tyson was allegedly having it, regular sex gets boring. So in the mid-1990s, Tyson started to see a sex therapist because he found that he was engaging in nothing but group sex.\"At one point,\" he wrote in his autobiography, Undisputed Truth, \"everything I did sexually consisted of orgies…It makes you feel like shit.\" 12. He beat up seven prostitutes in a hotel room while high on morphine and cocaine during his \"lowest point\". Tyson has done a lot of incredibly crazy things in his life, but this is (probably) the craziest. In 2009, after receiving a morphine drip in his arm and using a large amount of cocaine, he started to feel paranoid (ya think?!). So he started to beat up a group of prostitutes that he had summoned to his room.\"That's when I realized it wasn't just demons—it was the devil himself,\" he told Las Vegas Weekly later. \"It was the lowest point of a very low life, but it was my own knockout punch to clean up my life, get whole, get well—and I haven't done anything in three years now. I'm clean. I'm sober\". SHARE THIS STORY", "external_links": [], "published": "2015-10-12T08:10:00.000+03:00", "crawled": "2015-10-13T05:00:29.185+03:00", "highlightTitle": ""}