{"organizations": [], "uuid": "f15631594726b69428d9aebca272e21f21ba3d88", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "phuketwan.com", "main_image": "", "site_section": "http://feeds2.feedburner.com/PhuketWan-Entertainment", "section_title": "Phuket Wan - Entertainment", "url": "http://phuketwan.com/entertainment/patong-festival-highlight-seafood-whats-changed-bangla-23356/", "country": "US", "title": "Patong Festival to Highlight Seafood: What's Changed in Bangla", "performance_score": 0, "site": "phuketwan.com", "participants_count": 1, "title_full": "Patong Festival to Highlight Seafood: What's Changed in Bangla", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T01:52:00.000+03:00", "replies_count": 0, "uuid": "f15631594726b69428d9aebca272e21f21ba3d88"}, "author": "Keryn Reynolds and Chutima Sidasathian", "url": "http://phuketwan.com/entertainment/patong-festival-highlight-seafood-whats-changed-bangla-23356/", "ord_in_thread": 0, "title": "Patong Festival to Highlight Seafood: What's Changed in Bangla", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Patong is always ready to greet visitors for a new high season Photo by phuketwan.com Click a thumbnail to view more photographs Patong Festival to Highlight Seafood: What's Changed in Bangla By Keryn Reynolds and Chutima Sidasathian Monday, October 12, 2015 PHUKET: Patong's annual festival runs from November 1-3 and this year's funding of five million baht will emphasise the destination as a good place for seafood. The festival usually marks the start of the high season, with the procession of floats a highlight. Tweet As usual, Patong is different from one year to the next, with efforts by the local administration to tame some of the popular tourist hub's problems sometimes working . . . and sometimes not. A Phuketwan preview stroll around Patong at the weekend showed serious attention is being paid to time share touts, with a large billboard on the popular tourist walking street, Soi Bangla, declaring ''WARNING! Some offers for time share or holiday clubs may be misrepresentation or bogus products.'' Time share touts have been a problem in the walking street. They were not so evident in the stroll, but there were plenty of touts seeking patrons for lewd ping pong shows of the kind that demean women. Some of the restaurants and bars along Soi Bangla have also expanded their businesses onto the public footpath. It's difficult to understand how this can be tolerated under Thai law, but it's certainly the case that sidewalk dining works well when properly controlled in other cities. The word that doesn't appear to be applicable in Patong is ''controlled.'' Having seats and tables along footpaths will not improve stampedes of the kind that can happen on New Year's Eve when everyone suddenly gets caught in the crush to see the fireworks at the beach. That's the nightmare for tourists and businesses, and it means that footpaths should be kept clear at all times. Anything that narrows the space for walking in the walking street can pose a danger when Soi Bangla is really packed. A couple of new indulgences are also occupying space actually on the road. A 3D show where tourists don headgear, and a death ray adventure - 15 shots for 100 baht. People love a sideshow but if Patong is to have sideshows, then the side sois are the place for them, not Bangla Road. The festival will produce the first real influx of visitors for the high season and local authorities will need to ensure the safety and security of all visitors, tourists and locals, as always.", "external_links": [], "published": "2015-10-12T01:52:00.000+03:00", "crawled": "2015-10-12T18:45:18.149+03:00", "highlightTitle": ""}