{"organizations": [], "uuid": "637b3f09bf556be2725a034d50eed8ade30fe9a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266347/arts-entertainment-general", "section_title": "Arts &amp; Entertainment: General - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30304590/introducing-distinct-a-new-mobile-app-supporting-independent-thinkers-and-creators-and-inspiring-them-to-action", "country": "US", "title": "Introducing DISTINCT: A New Mobile App Supporting Independent Thinkers and Creators and Inspiring Them to Action", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Introducing DISTINCT: A New Mobile App Supporting Independent Thinkers and Creators and Inspiring Them to Action - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T17:11:00.000+03:00", "replies_count": 0, "uuid": "637b3f09bf556be2725a034d50eed8ade30fe9a3"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30304590/introducing-distinct-a-new-mobile-app-supporting-independent-thinkers-and-creators-and-inspiring-them-to-action", "ord_in_thread": 0, "title": "Introducing DISTINCT: A New Mobile App Supporting Independent Thinkers and Creators and Inspiring Them to Action", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Now Available for Free Download in the App Store\nNew York, NY (PRWEB) October 20, 2015\nMeet the DISTINCT app, a new collaborative social networking and multimedia platform streamlining the process of connecting with influential creators and taking action on your creative passion. DISTINCT is the turning point in the dynamic of mobile culture, connecting and supporting an ever-growing network of trailblazers and entrepreneurs across art, architecture, cuisine, dance, design, fashion, music, philanthropy, and technology. DISTINCT offers its users the opportunity to “take action” along with and inspired by leading contemporary culture creators.\nDISTINCT’s users have access both in app and online to exclusive original content which highlights the unique paths of makers from inspiration to action through imaginative films, immersive photography, exclusive interviews, practical advice, and momentum-building challenges.\nDISTINCT enables users to build their own profiles and connect to and follow one another, sharing their work, inspirations, and aspirations with fellow artists, creative thinkers, and makers, while also inspiring to action a wider audience in search of ways to tap into and launch their own creativity. Through creative challenges, the app also offers users the chance to share their own work and connect with iconic artists, creatives, and entrepreneurs. These challenge images are archived in users’ DISTINCT galleries and can also be shared on Facebook and Twitter, to be followed by Instagram.\nThrough DISTINCT, everyone gets the luxury of indulging in creative dreams and having access to creative mentors. DISTINCT is egalitarian, abolishing the “us and them” approach, with original content and app features in a motivational tone that demystify the creative life, going behind the scenes and into the private worlds of creative luminaries. DISTINCT aspires to help inspire and launch the careers of tomorrow’s creative influencers.\nDISTINCT launches with jewelry designer Bliss Lau, a favorite of Beyoncé, Rosamund Pike, and Emma Watson; artist and graphic designer Kenzo Minami, whose work has been commissioned by Raf Simons, MTV, Nike, Reebok, Microsoft, Kidrobot, and The Ace Hotel; musician (Soft Circle/Boredoms), visual artist, and photographer Hisham Bharoocha, who has collaborated with artist Doug Aitken, had his own work exhibited at galleries such as Deitch Projects in New York and Gallerie Frank Elbazl in Paris, and collaborated with Saint Heron for a PUMA Fall 2015 collection creative directed by Solange Knowles, and Loliware, a product design duo creating biodegradable/edible/vegan tableware who recently won on ABC’s Shark Tank.\nUpcoming DISTINCT feature creatives include Emmy-award winning illustrator, contemporary artist, and recent Coach Spring and Fall 2015 collaborator Gary Baseman; surfer, photographer, designer and ocean conservation advocate Kassia Meador; and legendary rock n’ roll photographer Mick Rock, who recently launched his own TV show on Ovation, On the Record with Mick Rock, and has a new limited edition Taschen book out with David Bowie.\nDISTINCT is available for free download now in The App Store.\nThe DISTINCT app was developed by Distinct Media, Inc founded in 2012.\nFor more information, visit http://www.distinctdaily.com , and follow Distinct on Facebook, Instagram and Twitter.\n //www.prweb.com/releases/2015/10/prweb13030851.htm\n ", "external_links": ["http://www.prweb.com/releases/2015/10/prweb13030851.htm"], "published": "2015-10-20T17:11:00.000+03:00", "crawled": "2015-10-20T18:28:32.492+03:00", "highlightTitle": ""}