{"organizations": [], "uuid": "ffacd4c6a032dd3915f47a06be9a16f42b080d83", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-562e6b99/turbine/sc-one-simple-thing-volume-earbuds-health-1104-20151026", "site_section": "http://www.chicagotribune.com/", "section_title": "Chicago Tribune: Chicago breaking news, sports, business, entertainment, weather and traffic - Chicago Tribune", "url": "http://www.chicagotribune.com/lifestyles/health/sc-one-simple-thing-volume-earbuds-health-1104-20151026-story.html", "country": "US", "title": "Doctor recommends 60/60 rule for music listening to prevent hearing loss", "performance_score": 0, "site": "chicagotribune.com", "participants_count": 1, "title_full": "Doctor recommends 60/60 rule for music listening to prevent hearing loss - Chicago Tribune", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T20:03:00.000+02:00", "replies_count": 0, "uuid": "ffacd4c6a032dd3915f47a06be9a16f42b080d83"}, "author": "Alison Bowen", "url": "http://www.chicagotribune.com/lifestyles/health/sc-one-simple-thing-volume-earbuds-health-1104-20151026-story.html", "ord_in_thread": 0, "title": "Doctor recommends 60/60 rule for music listening to prevent hearing loss", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Now that the days of the Walkman — and its limited battery and volume — are behind us, a hearing-loss epidemic could be ahead.\nDoctors who attend to ears, like Dr. Sreekant Cherukuri, an ear, nose and throat doctor in northwest Indiana, are encountering hearing problems earlier than ever.\nIn the past, music listening consisted of a \"Walkman with a cassette player and over-the-ear headphones and two double-A batteries,\" Cherukuri noted.\n\"Nowadays you've got a fully rechargeable, all-day battery, and in-the-ear-canal earbuds,\" he said. \"These new devices get much louder and can play for much longer.\"\nPaying attention to the volume and time you're pumping music into your ears is more important than ever.\nCherukuri recommends the 60/60 rule. That is, listening at 60 percent volume for a maximum of 60 minutes.\nGetting teens to hear earplug advice is a challenge Karen Ann Cullotta For New Trier High School sophomore Sophia Pellar, a pair of special earplugs recently donated by a North Shore audiologist has put an end to the pain she suffered when playing flute in the pep band.\nStill, the Mozart-loving Kenilworth teen giggles nervously when she explains that the earplugs...\nFor New Trier High School sophomore Sophia Pellar, a pair of special earplugs recently donated by a North Shore audiologist has put an end to the pain she suffered when playing flute in the pep band.\nStill, the Mozart-loving Kenilworth teen giggles nervously when she explains that the earplugs...\n(Karen Ann Cullotta) In other words, monitor the volume bars on your device, and make sure they are never edging too far over the halfway mark.\nAfter that, take a breather.\n\"Ears that get a break from the loud, continuous noise or sound are less likely to suffer continuous damage,\" Cherukuri said.\nCherukuri sees problems in an increasingly young demographic, he said. He fears an \"epidemic\" of hearing loss.\"\n\"We're seeing hearing loss in teens and 20-somethings that we wouldn't see before until age 50,\" he said.\nEarbuds in particular can be problematic, he said, because the sound is placed so much closer to the eardrum.\n\"They can actually get to very damaging levels,\" he said.\nIdeally, the sound should be under 85 decibels, which he said is always safe — about the same volume as city traffic.\nHis company, MDHearingAid started selling more affordable hearing aids after he realized how expensive the devices were.\nCherukuri — a music lover and former DJ — uses over-the-ear, noise-canceling headphones.\nThese reduce ambient sound, which takes away the need to make the volume compete with the surroundings.\nAlso, he said, \"the sound is so much better.\"\nUnlike other medical problems, Cherukuri warned, there is no fix for hearing loss.\n\"Once there's damage, it's permanent,\" he said.\nThe One Simple Thing series appears weekly, offering specific and small ways to improve health.\nabowen@tribpub.com\nTwitter @byalisonbowen\n ", "external_links": ["http://www.trbimg.com/img-562e6b99/turbine/sc-one-simple-thing-volume-earbuds-health-1104-20151026", "http://www.trbimg.com/img-553588cc/turbine/ct-teen-hearing-loss-met-20150421"], "published": "2015-10-26T20:03:00.000+02:00", "crawled": "2015-10-26T21:19:57.347+02:00", "highlightTitle": ""}