{"organizations": [], "uuid": "1bd465a621f44640796d71a661aff5c98f937d8a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sfgate.com", "main_image": "http://ww4.hdnux.com/photos/41/53/02/8827031/3/rawImage.jpg", "site_section": "http://sfgate.com//rss/feed/Entertainment-530.php", "section_title": "Entertainment", "url": "http://www.sfgate.com/entertainment/article/Dear-Abby-Old-habits-die-hard-during-woman-s-6581920.php", "country": "US", "title": "Dear Abby: Old habits die hard during woman’s transition to a man", "performance_score": 0, "site": "sfgate.com", "participants_count": 1, "title_full": "Dear Abby: Old habits die hard during woman’s transition to a man - SFGate", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:05:00.000+03:00", "replies_count": 0, "uuid": "1bd465a621f44640796d71a661aff5c98f937d8a"}, "author": "sfgate.com", "url": "http://www.sfgate.com/entertainment/article/Dear-Abby-Old-habits-die-hard-during-woman-s-6581920.php", "ord_in_thread": 0, "title": "Dear Abby: Old habits die hard during woman’s transition to a man", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photo: Patryce Bak, Getty Images A mother has had problems correctly calling her daughter's transgender partner the correct name.\n\nA mother has had problems correctly calling her daughter's... Dear Abby : My daughter has been in a lesbian relationship for 14 years. They recently took me to lunch and informed me that her partner, “Nicole,” is in the process of transitioning to a male. Nicole has now legally changed her name to “Nick” and has begun hormone treatments. They have been going to counseling for the past six months. Since Nick began the transition, I have seen him three times. Last week when I was visiting, I accidentally called Nick by the wrong pronoun, “she” instead of “he,” a couple of times. I was either immediately corrected or ignored until I realized I had used the wrong word. It hurt my feelings. After I got home I sent Nick a text to apologize and explain that\nRelated Stories Dear Abby: Ex-wife of cheater seeks way to cope with anger Documentary about LGBT History on Home Movies Premieres in New York With teachers coming out as transgender, districts struggle it would take time for me to get used to saying “Nick” and referring to him as a he. I told them their correcting me bothered me. All weekend I could tell they were irritated with me, and I felt it was uncalled for. What do you say? Am I wrong to feel hurt that they haven’t given me a chance to get used to the new name?\nMargaret in Mississippi \nDear Margaret : Adjusting to gender reassignment takes time for all concerned. As your letter illustrates, there are often more people involved than the individual making the change. It seems only natural that you would need some time to adjust. However, it also seems to me that you are being overly sensitive about what happened. Your daughter and her partner were right to correct you for your slip of the tongue, and it wasn’t rude for them to do so. How else is a person to learn that a mistake was made if it isn’t pointed out?\nDear Abby: Recently, 12 of us women from a retirement home in Dayton were having lunch at a local steakhouse. As we were digging in our purses for money and coupons, our server informed us that we did not owe anything for our bills! He said a gentleman who had been seated nearby had taken care of what we owed. It seems the day we were there was his late mother’s birthday. There are some very good people in this world. We want him to know how very much we appreciated his kind gesture, and we have pledged to “pay it forward” whenever we can.\nBlessed in Ohio \nDear Blessed: I don’t know who originated this saying, but your letter certainly proves the truth of it: A good deed is like a pebble thrown into a pond; its ripples continue ever outward. Thank you for an upper of a letter.\n  \nPhoto: Digital Vision. Image 1 of / 11 Caption\nClose\nImage 1 of 11 Want to read some more advice from Dear Abby? \n\nDear Abby : I'm 63, worried that 28-year-old is after my money Want to read some more advice from Dear Abby? \n\nDear Abby : I'm 63, worried that 28-year-old is after my money Photo: Digital Vision. Image 2 of 11 Dear Abby : My husband likes to sit around nude Dear Abby : My husband likes to sit around nude Image 3 of 11 Dear Abby : Stepchildren too flirty, but husband doesn't notice Dear Abby : Stepchildren too flirty, but husband doesn't notice Photo: Digital Vision. Image 4 of 11 Dear Abby : I lost it and hit my dying dog Dear Abby : I lost it and hit my dying dog Photo: GK Hart/Vikki Hart Image 5 of 11 Dear Abby : My mom got home after a date at 5:30 am, drunk Dear Abby : My mom got home after a date at 5:30 am, drunk Photo: Peter Dazeley, Getty Images Image 6 of 11 Dear Abby : 88-year-old wants to say goodbye just in case Dear Abby : 88-year-old wants to say goodbye just in case Photo: Keith Brofsky Image 7 of 11 Dear Abby : Girlfriend refuses to meet the parents Dear Abby : Girlfriend refuses to meet the parents Photo: Doble.d, Getty Images/Moment Open Image 8 of 11 Dear Abby : I had an affair with my husband's uncle Dear Abby : I had an affair with my husband's uncle Photo: Ullstein Bild Image 9 of 11 Dear Abby : Don't adopt a child because your kid needs a playmate Dear Abby : Don't adopt a child because your kid needs a playmate Photo: Steve Dunwell Image 10 of 11 Dear Abby : Bride-to-be upset when ex gets job at wedding venue Dear Abby : Bride-to-be upset when ex gets job at wedding venue Photo: Coloroftime Image 11 of 11 Dear Abby: Old habits die hard during woman’s transition to a man 1  /  11 Back to Gallery Dear Abby: We were visiting our son and daughter-in-law last weekend. When I had to use the facilities downstairs, I told her the hand towel was missing. I had used that bathroom the day before. Guess what she said? “Well, that’s what pants are for.” Abby, she wasn’t joking! We see them only twice a year because we live five hours away. Could they be short of money or what? Should I send her some hand towels?\nWet Hands in Wisconsin \nDear Wet Hands: By all means. And don’t forget a short, sweet note thanking her for her “hospitality.”", "external_links": [], "published": "2015-10-22T03:05:00.000+03:00", "crawled": "2015-10-22T14:21:13.391+03:00", "highlightTitle": ""}