{"organizations": [], "uuid": "747f0c088370c8e2c04067f1fc2644a23e5eed28", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-561d2e6f/turbine/ct-barbara-byrd-bennett-dawn-turner-20151013", "site_section": "http://www.chicagotribune.com/", "section_title": "Chicago Tribune: Chicago breaking news, sports, business, entertainment, weather and traffic - Chicago Tribune", "url": "http://www.chicagotribune.com/news/columnists/ct-barbara-byrd-bennett-dawn-turner-20151013-column.html", "country": "US", "title": "Barbara Byrd-Bennett&apos;s lesson before the fall", "performance_score": 0, "site": "chicagotribune.com", "participants_count": 1, "title_full": "Barbara Byrd-Bennett&apos;s lesson before the fall - Chicago Tribune", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T18:58:00.000+03:00", "replies_count": 0, "uuid": "747f0c088370c8e2c04067f1fc2644a23e5eed28"}, "author": "Dawn M. Turner", "url": "http://www.chicagotribune.com/news/columnists/ct-barbara-byrd-bennett-dawn-turner-20151013-column.html", "ord_in_thread": 0, "title": "Barbara Byrd-Bennett&apos;s lesson before the fall", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "When I was growing up in the Chicago Public Schools system, at least one of my parents would go to school every fall to introduce themselves to their two daughters' new crop of teachers.\nMy mother would tell them that she believed parents were a child's first educators. What happened in the school system was supposed to augment and supplement the work done first at home.\nJust as important as anything we learned in a book, we were expected to be honest, to work hard, to not scam or cheat or steal. Building character was on par with building intellect.\nMy father would tell our teachers, \"I know what my daughters will do while I'm looking, but I can only hope what they'll do when I'm not.\"\nHe knew we weren't perfect and that we'd sometimes fall short. But he said it's what a person does and who she is when people aren't looking that defines her.\nThat's why the charges against former Chicago Public Schools CEO Barbara Byrd-Bennett are both sad and disappointing.\nShe pleaded guilty Tuesday morning to her role in helping an education consulting firm she used to work for win multimillion-dollar no-bid contracts that would net her at least $2.3 million in kickbacks and perks. SUPES Academy co-owners Gary Solomon and Thomas Vranas also have been charged in a 23-count indictment.\nEx-CPS chief Barbara Byrd-Bennett pleads guilty in kickbacks scheme Jason Meisner Former Chicago Public Schools CEO Barbara Byrd-Bennett pleaded guilty Tuesday to her role in steering multimillion-dollar no-bid contracts to an education consulting firm in exchange for promises of lucrative kickbacks and other perks.\nByrd-Bennett appeared before U.S. District Judge Edmond Chang...\nFormer Chicago Public Schools CEO Barbara Byrd-Bennett pleaded guilty Tuesday to her role in steering multimillion-dollar no-bid contracts to an education consulting firm in exchange for promises of lucrative kickbacks and other perks.\nByrd-Bennett appeared before U.S. District Judge Edmond Chang...\n(Jason Meisner) Byrd-Bennett's alleged quid pro quo deal is horrible on its face. That she did it in an environment where student need is great makes it even worse. Indeed, CPS has pension problems and a massive budget shortfall.\nBut too many of CPS's students come from home environments that are less than optimal to say the least, and too many are accustomed to disappointment from grown-ups. And when one in particular has the awesome responsibility of trying to turn around a school district awash in grim news, it feels like an even bigger letdown when she falls.\nIt feels too much like the same-old, same-old.\nByrd-Bennett allowed her greed to get ahead of her, as detailed by the outlandish (and even juvenile) emails she's accused of sending. According to the charges, one email implied she needed the money, which was to be placed in trust accounts, because she had \"tuition to pay and casinos to visit.\" She even added a smiley-face emoticon.\nI'm blown away by people who think they can get away with something this huge.\nTribune coverage: CPS, Barbara Byrd-Bennett and SUPES Academy See ongoing Chicago Tribune reports on Chicago Public Schools, former schools CEO Barbara Byrd-Bennett and the education consulting firm where she once worked.\nSee ongoing Chicago Tribune reports on Chicago Public Schools, former schools CEO Barbara Byrd-Bennett and the education consulting firm where she once worked.\nRead more stories But Byrd-Bennett thought nobody was looking. How she could think that in a city where corruption seems to re-emerge like a stain in carpeting is beyond my understanding.\nThis not only speaks to her character. It may say more about her intellect and ego.\nIt's too bad because so many teachers and students are working hard and tirelessly to turn around the Chicago school system.\nThey deserve a person at the helm who can help them in their efforts. What they got from Byrd-Bennett, instead, was a lesson in pride and hubris.\ndmturner@tribpub.com\n Barbara Byrd-Bennett Chicago Public Schools Opinion Commentary", "external_links": ["http://www.trbimg.com/img-5616b562/turbine/ct-cps-barbara-byrd-bennett-supes-academy-20151008", "http://www.trbimg.com/img-561d1ac5/turbine/ct-barbara-byrd-bennett-plea-met-1013-20151012", "http://www.trbimg.com/img-561d2e6f/turbine/ct-barbara-byrd-bennett-dawn-turner-20151013"], "published": "2015-10-13T18:58:00.000+03:00", "crawled": "2015-10-13T19:19:07.796+03:00", "highlightTitle": ""}