{"organizations": [], "uuid": "a6bcd14eb29e9eaa871d31dbd1b6859beaca0f06", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.heraldscotland.com", "main_image": "http://www.heraldscotland.com/resources/images/4361442/", "site_section": "http://www.heraldscotland.com/arts_ents/", "section_title": "Arts and Entertainment | Herald Scotland", "url": "http://www.heraldscotland.com/arts_ents/13892280.Colm_Toibin_on_new_film_Brooklyn__and_why_you_ll_not_find_him_in_a_gay_disco/", "country": "GB", "title": "Colm Toibin on new film Brooklyn, and why you'll not find him in a gay disco", "performance_score": 0, "site": "heraldscotland.com", "participants_count": 1, "title_full": "Colm Toibin on new film Brooklyn, and why you'll not find him in a gay disco (From Herald Scotland)", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T07:10:00.000+03:00", "replies_count": 0, "uuid": "a6bcd14eb29e9eaa871d31dbd1b6859beaca0f06"}, "author": "Teddy Jamieson", "url": "http://www.heraldscotland.com/arts_ents/13892280.Colm_Toibin_on_new_film_Brooklyn__and_why_you_ll_not_find_him_in_a_gay_disco/", "ord_in_thread": 0, "title": "Colm Toibin on new film Brooklyn, and why you'll not find him in a gay disco", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "THIS world is a terrible place. I know that. You know that. We are as a species generally thoughtless, selfish and too often cruel. And then we die.\nBut. But there are saving graces. Things that make living worthwhile. Things that make you happy to have seen and heard them. Sunrise, sunset (cliches are only cliches because they are true), the dirty guitar riff on T.Rex's 20th Century Boy, the films of Preston Sturges, watching David Silva play football.\nToday, it's hearing Colm Toibin saying the words \"gay disco\" in the manner of Wilde's Lady Augusta Bracknell. And it's only 10 in the morning too.\nThe Irish novelist and I are sitting at breakfast in an upmarket Edinburgh hotel. He is happily demolishing a full Scottish as we speak. Yellowy streaks of fried egg splatter his plate, globs of sausage meat stick to the rim. \"This has got to keep me going all day,\" he says as he works his knife and fork.\nYou join us as we are discussing life in Ireland in the wake of last year's same-sex marriage referendum, in which he played his part. I've been wondering if he feels jealous of gay men and women now in their teens who are growing up in a very different Ireland to the one he grew up in (earlier this year, before the vote, Quote: : \"As gay people … we grew up alone.\") But actually he's not so sure of the underlying assumptions of the question. He's not sure gay teenagers are the only ones benefitting, frankly. This is a different world. This is a different Ireland.\nPromoted stories\n\"There was a time in the gay world when it was too late to start, when it was a youth culture,\" he says, \"but that seems to have changed. I think the internet has helped enormously. It's never too late to start. It is possible for somebody – no matter what age you are – to find love, and there was a time when that wasn't possible. You could be the loneliest guy in the world. Well, there's no excuse for that now.\"\nEven so. There are ways to find love and there are ways to find love. \"I wouldn't wish a gay disco on anyone, you know,\" he adds, as he brings the fork to his mouth. \"All that dancing and sweating. I don't envy anyone that.\" The tone in which he says that is as delicious as the driest gin and tonic. I have a vision of Toibin dancing and sweating on the floor of a gay disco. In my vision he's graceful for a big man. Making tiny but elegant movements. I like to imagine he dances like he writes. \"I'm just being an old fogey about it,\" he adds.\nMaybe, but he's qualified to be. Toibin is 60 now and a glory of a man. That magnificent, sculptural head, the soft Irish voice, the pleasure he takes in life and the seriousness with which he takes the work he does, work that has resulted in 16 books, including seven novels and one novella, a couple of short story collections; work that has won him two Booker nominations, a fellowship of the Royal Society of Literature and the Irish PEN Award for contribution to Irish literature (and I'm just skimming here).\nHe's in town for the book festival. Later this afternoon he will talk about his latest book Nora Webster (which won him the Hawthornden Prize this year), a book about grief that draws on his own backstory.\nAnd then there's the film of his last novel Brooklyn. Adapted by Nick Hornby, and starring a predictably radiant Saoirshe Ronan, it's a decent, worthy, rather old-fashioned drama that speaks sweetly and beautifully of an old Ireland.\nToibin sounds rather thrilled by it. \"There was no downside for me,\" he says, talking about the first time he saw it in a London cinema. \"It's very faithful to the story. It's been just great. And people cried watching it. It's very emotional, the whole business.\"\nThe fact the Irish scenes were shot in his home town of Eniscorthy in Wexford adds a huge resonance for him, of course. \"It was shot on those very streets so anyone watching can literally see where it is and that's an extraordinary thing for me to watch. Because suddenly it's coming back to me as itself which it can't do in paragraphs. So that was quite touching.\"\nBrooklyn is an old Irish story; a story of family leave-taking, of emigration. In a way that's Toibin's story too. He was once the Irish boy who left home to find his way in the world. In 1975 – fresh from his studies at University College Dublin – he left Ireland to go to Barcelona. He became part of that old Irish story.\nWell, that's how I frame it when asking him about his own emigration. Again, he's not sure that's the way it was though.\n\"The old Irish story is one of economic need; people leaving because they couldn't get work. And that certainly happened in the 1980s. But in 1975 the problem was you could easily get work because they were expanding the civil service so hugely because of EU membership. They needed people like me really badly. Honours graduates coming out with arts degrees. They wanted us.\"\nWould that it had ever been thus. \"An amazing idea,\" he agrees. But it wasn't for him.\nWas it a case of running away or running towards, then? He laughs at the question. \"I was certainly running anyway. It was just day to day. There was no … That would have been a very grand concept. I wouldn't have had that in my mind. I wouldn't have had a clue.\"\nWhat he is clear on is that he was leaving behind his past and a place stuck in the past. \"Certainly there was a sense that Dublin in 1975 was a backwater. And certainly the north seemed intractable. And the south in every way was a really deeply conservative, strange place.\"\nWhy Barcelona? \"Some friends had lived there and they said you could always get work teaching English. That turned out to be true. I thought it was beautiful. I'd never been anywhere like it.\"\nHe arrived two months before General Franco's death. That led to the cultural upsurge that was the Movida in Madrid from which the film director Pedro Almodovar emerged. Did Barcelona have anything similar? He mishears the question, thinking I'm asking if he knew the Spanish director. \"No, we didn't have anything to do with those guys. I was never in Madrid in those years. I've got to know Almodovar since and we realised we were possibly in the same room on the same night in 1970-something. But he was making Super 8s and I was just being drunk.\"\nFrom his childhood he had been a writer. That stopped in Barcelona. He has said in the past that life there was \"too exciting to write\". You can imagine what a young gay man might have got up to. Still, he found his way back to writing and through writing he found himself drawn back to Ireland.\nOn the page to begin with. \"I was surprised when I wrote my first novel that there was a chapter about Wexford in it,\" he says now. \"I didn't think I had enough in it to work with. And then the second novel was all set there.\"\nWriting became his way to discover his homeland. \"I probably wouldn't have got to know it without the novels, that [Wexford] landscape of the coast and the town. All of that was embedded in me and mattered to me and had an enormous emotional resonance that I wouldn't have known.\n\"But it started to emerge in the rhythms of the novels unexpectedly.\"\nWe can't escape our past. Now Toibin doesn't try to. Although he spends time in New York and Barcelona he has also found a place for himself on the Wexford coast. (He also has a place in Dublin.) And on the page he writes of Ireland and the Irish for the most part. He is very good at it. Indeed, in terms of reputation, he is, in a country ripe with writers, the first among literary equals.\nHe once wrote that he couldn't really \"see\" English characters. Could he imagine writing Scottish characters, I wonder? \"On no, and I can't really see American. Somebody said: 'You should write a sequel to Brooklyn.' But I would get the names wrong of things in the house. I wouldn't know if they called it a fridge or a refrigerator or an icebox. I wouldn't know. And then I wouldn't know how the schools would work, even the grades in school. There are so many things I wouldn't know. They sound like small things but if you add them all up they are actually what you get in a novel.\"\nIn his books, certainly. His novels are full of small things. Of detail. Of the smallest registers of the tiniest temperature fluctuations of emotion. And yet they go deep.\nPerhaps Nora Webster, his most recent novel, goes deepest of all. It is a fictional take on his own childhood situation. When Toibin was 12, his father died. Four years earlier, when his dad had become ill, Toibin and his younger brother Niall – the youngest of five siblings – had been sent away to stay with relatives for months not knowing what was happening. Their mother never got in touch in all that time. The figure of the emotionally distant mother recurs again and again for a reason in his work.\nMore than 40 years later (not far short of 50, in fact), his novel Nora Webster is Toibin's response to all the grief and incomprehension of that time. Did writing a book about a woman based on his mother help him understand the real woman better? Help him understand her own grief?\n\"No. The problem is it's a literary exercise, in a way. And you can never really capture someone in a book because there's so much affect people have. You can't put all of it into a book. I think my mother was much more engaging personally than Nora Webster, who has retreated in certain ways. My mother was much more forthcoming, talked more, was more openly and unembarrassedly intelligent in the way she proceeded. Nora Webster is a much gentler figure.\"\nOK then, did writing the novel help him understand the shy, stuttering boy he had been? \"No, no.\"\nFiction doesn't work that way? \"Well, it can. There are times when you can realise something.\"\nBut, he says, by the time he came to write the novel he thinks he had had all the realisations about the boy he'd been and the pain and grief he'd been in. \"There's a lovely thing that Thomas Mann's daughter said. 'By 30 you have a duty to stop blaming your parents for anything.' And that seems to me about right.\"\nI tell him the Scottish poet and novelist John Burnside once suggested to me that grief should almost be allowed as a defence in a court of law because it can be so disorientating.\n\"Yeah,\" agrees Toibin, \"but it can also go underground. And at that time there was no name for it. The word 'grief'. There was no such thing as a counsellor. All those concepts came much later. All of that was alien in a way. What you did was get on with things. And people wanted you to get on with things; get up on the following Monday morning.\"\nThat was Ireland then, of course. The Celtic Tiger has since roared and coughed itself to death, Ireland has repealed its claims on the north, been horrified with the revelations of clerical abuse and now accepted same-sex marriage. It's hard, I think, of another country in western Europe that has changed so much.\nBut has it, he wonders. \"I'm not sure about the change. The campaign wasn't about change. It was about keeping things the same. It was run on the basis of family. It was run on the basis of 'Do you want your son or daughter to be included?' Rather than 'Do you want your son or daughter to be in some marginalised group?'\n\"So the entire language of the campaign was the language of inclusion. It was done in the softest way imaginable. So I'm not sure it did change. I think some abiding principles that have been operating in Ireland just got an energy from the campaign. In America it wouldn't have been possible. The gay organisations had moved so far from notions of family, community. But in Ireland they hadn't.\"\nToibin has been alive for more than half that Irish century. He's 60, a number that makes the maths easy, he says. \"You can add things to 60 so easily. I went to Barcelona in 1975. That's 40 years ago. It doesn't seem like yesterday, but it is easily traceable for me. So if I were to go somewhere now, in 40 years I'd be 100. You end up at some point every day adding something to 60 and getting a frighteningly high number. You go, 'Okaaay. I think we're in the last stretch.'\"\nBut he sees no reason for it to be an empty stretch. He teaches, he travels, he swims in the sea and he writes. He has another book almost written. Another scalpel-sharp incision into the small detail of life, no doubt.\nShare article I leave him to it. He gets up and moves away. So gracefully for such a big man, I think. Just as he writes. Maybe, for all I know, just as he dances. That's what I want to think anyway. Another vision to take comfort from in this cold, cold world.\nBrooklyn (12a) goes on general release on November 6. Nora Webster is available in paperback from Penguin, priced £7.99.", "external_links": ["https://twitter.com/share?url=", "https://www.facebook.com/sharer/sharer.php?u="], "published": "2015-10-24T07:10:00.000+03:00", "crawled": "2015-10-24T02:49:41.540+03:00", "highlightTitle": ""}