{"organizations": [], "uuid": "76efb6d26fa310d971212ef9f3f45c4bd5b70cc5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.albawaba.com", "main_image": "http://www.albawaba.com/sites/default/files/im/Ent_English/morgan-freeman-purple.jpg", "site_section": "http://albawaba.com//rss/entertainment", "section_title": "Al Bawaba - Entertainment", "url": "http://www.albawaba.com/entertainment/morgan-freeman-about-be-kicked-out-egypt-757902", "country": "US", "title": "Is Morgan Freeman about to be kicked out of Egypt?", "performance_score": 0, "site": "albawaba.com", "participants_count": 0, "title_full": "Is Morgan Freeman about to be kicked out of Egypt?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T09:30:00.000+03:00", "replies_count": 0, "uuid": "76efb6d26fa310d971212ef9f3f45c4bd5b70cc5"}, "author": "", "url": "http://www.albawaba.com/entertainment/morgan-freeman-about-be-kicked-out-egypt-757902", "ord_in_thread": 0, "title": "Is Morgan Freeman about to be kicked out of Egypt?", "locations": ["Egypt"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Morgan Freeman"], "text": "Is Morgan Freeman about to be kicked out of Egypt? Is Morgan Freeman about to be kicked out of Egypt? 2.5 5 \nPublished October 22nd, 2015 - 07:30   The actor has been spotted touring the old market Khan al-Khalili and filming in a cafe in Cairo. (Facebook) Follow > Click here to add Abd El-Sadek as an alert Click here to remove the Abd El-Sadek alert Disable alert for Abd El-Sadek , Click here to add Abdel Sattar Fathy as an alert Click here to remove the Abdel Sattar Fathy alert Disable alert for Abdel Sattar Fathy , Click here to add Al-Watan as an alert Click here to remove the Al-Watan alert Disable alert for Al-Watan Click here to add Cairo as an alert Click here to remove the Cairo alert Disable alert for Cairo Click here to add Din Abd El-Sadek as an alert Click here to remove the Din Abd El-Sadek alert Disable alert for Din Abd El-Sadek , Click here to add Egypt’s Censorship Authority as an alert Click here to remove the Egypt’s Censorship Authority alert Click here to add Egypt’s National Security Agency as an alert Click here to remove the Egypt’s National Security Agency alert Click here to add Morgan Freeman as an alert Click here to remove the Morgan Freeman alert Disable alert for Morgan Freeman , Click here to add Salah El-Din as an alert Click here to remove the Salah El-Din alert Disable alert for Salah El-Din , Click here to add State Information Service as an alert Click here to remove the State Information Service alert Disable alert for State Information Service \nEgypt’s Censorship Authority contacted the Egypt’s National Security Agency asking to clarify the legal status of the Story of God crew’s presence in Cairo. \nThe film is produced by National Geographic Channel with renowned American actor Morgan Freeman as its executive producer and host. \n“If the film was focused on a social topic, it would have probably been a different matter, but the film is related to our national security,” Abdel Sattar Fathy, head of Egypt’s Censorship Authority, told Al-Ahram Arabic. \nFathy asserted that he asked the Egypt’s National Security Agency whether the film’s crew advised about their trip and film plans, prior to their arrival. Fathy is yet to receive a reply. \n\"The problem isn’t with Freeman, but rather that service agencies [facilitating filming in Cairo] should have applied for a filming permit, especially given that the film includes content related to Egypt’s image, and also given that the film will be translated into 42 languages, and screened in a number of foreign countries,” Fathy explained. \n\"But unfortunately, they [service agencies] did not address the Censorship Authority regarding this matter, which they should have done according to the Egyptian law.\" \n\"Even if the State Information Service had an idea regarding the visit, it is the Censorship Authority’s role to issue filming permits.\" \n\"While the State Information Service must give its consent to the film crew’s presence in Cairo, our role is to issue a permit for the film to be shot in Egypt. \n\"We were informed that the actor filmed in El-Moez Street, that he visited El-Hussein area, in addition to a [scheduled] Luxor trip,\" Fathy continued pointing to the fact that many details related to the shooting remain to be verified. \nAs for critique directed to the Censorship Authority regarding its stance on the matter, Fathy explained that “the issue is not related to Freeman per se, for he is an actor loved by many. But rather relates to a country’s image, which [the protection of] is amongst my responsibilities, and that the issue should not spur a debate.” \nHowever according to head of the State Information Service, Salah El-Din Abd El-Sadek, everything has been cleared by the film’s crew. \nAbd El-Sadek told Al-Watan, one of Egypt’s daily papers that “National Geographic Channel [the film’s production company] has indeed applied for a permit and has received it about four months ago.” \nEl-Sadek also stressed on the fact that the State Information Service is the sole body in Egypt tasked with issuing permits for documentary films, while Egypt’s Censorship Authority is responsible for issuing permits to fiction films. \nThe 78-year old actor arrived in Cairo from Turkey on Sunday. \nLast June, National Geographic Channel announced that Freeman would host and be the executive producer of The Story of God that explores religions and religious rituals. The documentary will be released in 2016. Advertisement", "external_links": [], "published": "2015-10-22T09:30:00.000+03:00", "crawled": "2015-10-22T14:03:12.108+03:00", "highlightTitle": ""}