{"organizations": [], "uuid": "9afe9c9fccd2938728c10d31d4a3f1778f78021f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/49313943.cms", "site_section": "http://timesofindia.indiatimes.com/Entertainment/Hindi/Music/News/articlelist/4724976.cms", "section_title": "News - Music - Hindi - Entertainment - The Times of India", "url": "http://timesofindia.indiatimes.com/entertainment/hindi/music/news/Chhattisgarh-woman-takes-states-own-Sasural-Genda-Phool-song-to-Switzerland/articleshow/49313845.cms", "country": "IL", "title": "Chhattisgarh woman takes state's own 'Sasural Genda Phool' song to Switzerland", "performance_score": 0, "site": "indiatimes.com", "participants_count": 1, "title_full": "Chhattisgarh woman takes state's own 'Sasural Genda Phool' song to Switzerland - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T03:00:00.000+03:00", "replies_count": 0, "uuid": "9afe9c9fccd2938728c10d31d4a3f1778f78021f"}, "author": "Rashmi Drolia", "url": "http://timesofindia.indiatimes.com/entertainment/hindi/music/news/Chhattisgarh-woman-takes-states-own-Sasural-Genda-Phool-song-to-Switzerland/articleshow/49313845.cms", "ord_in_thread": 0, "title": "Chhattisgarh woman takes state's own 'Sasural Genda Phool' song to Switzerland", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "RAIPUR: Taking a Chhattisgarhi song on a foreign land where people resist talking in English and prefer German, a Chhattisgarh woman in Switzerland made 45 people of 22 nations sing state-originated famous Hindi Bollywood number 'Sasural Genda Phool' at integrated musical concert of Switzerland's Khor Der Nationen (Choir of nations) group aided by Swiss government.\nKhor Der Nationen is an integrated programme supported by Switzerland government formed for migrants with a concept for world peace and integration of several nations through music.\nShobhna Yaduvanshi Prakash of Raipur, now a citizen of Switzerland since 12 years is too patriotic to let German take over her native language. Her journey with German language began when she realized that to interact with people there, German was mandatory and now she's well versed in it.\nEnthusiastic Shobhna who loves to interact with people, refused to reserve herself inside home and she learnt German to connect to the people.\n\"As a gesture of remembering my country and sharing the culture of her state with foreigners, I and the core leader Luca took three months' time to teach the song 'Sasural Genda Phool' and explain its meaning to 45 members of group from 22 different countries,\" Shobhna told TOI during her visit to Raipur.\nFamous 'Saas gari deve-Genda Phool' is a song of Bollywood movie Delhi-6, which was originally sung by Joshi sisters of Chhattisgarh.\n\"It was two years ago when I connected to Khor der Nationen wherein people from numerous countries contribute something or the other from their native places and join others to send a message of brotherhood and through the cultural exchange between different nations,\" she said.\nShobhna says that in absence of Indian musical instruments, her Italian music director Luca Fironi took three weeks to make notations on piano.\n\"I had written the Hindi lyrics in German language to make them understand and pronounce them correctly,\" she added.\nThe video recording of the concert that took place in September at Park Theatre, Grenchen at Solothurn in Switzerland, shows the group of excited faces from different countries playing instrument and singing the Hindi song on Indian tune.\nShobhna was given special opportunity to explain the detail of song about the Indian culture and the system of arranged marriage, to the audience of hundreds.\nThis group of Choir of Nations has brought together many such citizens of which I am the only Indian, on one platform and help them feel at home with patriotism, Shobhna concludes saying that she loves to wear Sari on several such concerts and represent her culture.", "external_links": [], "published": "2015-10-11T03:00:00.000+03:00", "crawled": "2015-10-17T15:28:46.980+03:00", "highlightTitle": ""}