{"organizations": [], "uuid": "c84fb681611402fd21f4ac8f07e2a316d0f5e182", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.baltimoresun.com", "main_image": "http://www.trbimg.com/img-561d4581/turbine/la-et-mg-jennifer-lawrence-hollywood-pay-gender-gap-lenny-20151013", "site_section": "http://www.baltimoresun.com/entertainment/rss2.0.xml#", "section_title": "Entertainment - Baltimore Sun", "url": "http://www.baltimoresun.com/entertainment/la-et-mg-jennifer-lawrence-hollywood-pay-gender-gap-lenny-20151013-story.html", "country": "US", "title": "Jennifer Lawrence: Hollywood's gender gap on pay has her 'over' trying to be 'likable'", "performance_score": 0, "site": "baltimoresun.com", "participants_count": 1, "title_full": "Jennifer Lawrence: Hollywood's gender gap on pay has her 'over' trying to be 'likable'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T21:03:00.000+03:00", "replies_count": 0, "uuid": "c84fb681611402fd21f4ac8f07e2a316d0f5e182"}, "author": "Christie D&amp;apos;Zurilla", "url": "http://www.baltimoresun.com/entertainment/la-et-mg-jennifer-lawrence-hollywood-pay-gender-gap-lenny-20151013-story.html", "ord_in_thread": 0, "title": "Jennifer Lawrence: Hollywood's gender gap on pay has her 'over' trying to be 'likable'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "\"If Donald Trump becomes president, that will be the end of the world,\" the 25-year-old actress told Entertainment Weekly during a group interview with costars Liam... \nAs the Mockingjay, Jennifer Lawrence isn't afraid of anything. But as Jennifer Lawrence, she's apparently afraid of Donald Trump. \n\"If Donald Trump becomes president, that will be the end of the world,\" the 25-year-old actress told Entertainment Weekly during a group interview with costars Liam... (Christie D'Zurilla) \n\"When the Sony hack happened and I found out how much less I was being paid than the lucky people [who were male], I didn't get mad at Sony. I got mad at myself. I failed as a negotiator because I gave up early. I didn't want to keep fighting over millions of dollars that, frankly, due to two franchises, I don't need. (I told you it wasn't relatable, don't hate me).\" \nSee the most-read stories in Entertainment this hour >> \nLawrence and Amy Adams got less on the back end than Bradley Cooper, Christian Bale and Jeremy Renner -- the Daily Beast had the emails -- even though J. Law was the white-hot one at the time, coming off \"The Hunger Games.\" And apparently the \"Silver Linings Playbook\" Oscar-winner started out getting even less than Adams, until a late change was made in her deal. \n\"I would be lying if I didn't say there was an element of wanting to be liked that influenced my decision to close the deal without a real fight,\" she admits. \"I didn't want to seem 'difficult' or 'spoiled.' At the time, that seemed like a fine idea, until I saw the payroll on the Internet and realized every man I was working with definitely didn't worry about being 'difficult' or 'spoiled.'\" \nTo make her point, she notes there was another actress who in one Sony email about another negotiation was called a \"spoiled brat.\" Says Lawrence, \"For some reason, I just can't picture someone saying that about a man.\" (The 25-year-old doesn't name the other actress, but it was Angelina Jolie, and the phrase was actually \"a marginally talented spoiled brat.\") (By Christy Khoshaba) \n\"I'm over trying to find the 'adorable' way to state my opinion and still be likable!\" Lawrence declares, but she gives an example that shows -- equal-pay act or not -- just how steep that hill might be. \n\"A few weeks ago at work, I spoke my mind and gave my opinion in a clear ... way; no aggression, just blunt,\" Lawrence writes. \"The man I was working with (actually, he was working for me) said, 'Whoa! We're all on the same team here!' As if I was yelling at him. I was so shocked because nothing that I said was personal, offensive, or, to be honest, wrong. \n\"All I hear and see all day are men speaking their opinions, and I give mine in the same exact manner, and you would have thought I had said something offensive.\" \nIt's OK, Jennifer, you're hard to hate. And your arguments are far from offensive -- or wrong. Just pick up the tab if we ever go to lunch, OK? We could relate to that. \nFollow Christie D'Zurilla on Twitter @theCDZ and Google+ . Follow the Ministry of Gossip on Twitter @LATcelebs . \nALSO", "external_links": [], "published": "2015-10-13T21:03:00.000+03:00", "crawled": "2015-10-13T22:59:53.015+03:00", "highlightTitle": ""}