{"organizations": ["WXIA-TV", "Facebook Email Twitter Google", "Tri-Star Pictures", "Grauman"], "uuid": "acab132f32722ad66820f8cd7a353d0d89497427", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wtsp.com", "main_image": "http://www.gannett-cdn.com/-mm-/4b9ede3820a54fc558b9aa527e18601b331caee4/c=0-50-534-352&amp;r=x633&amp;c=1200x630/local/-/media/2015/06/25/WTSP/WTSP/635708070640763015-635583063120850821-150408955.jpg", "site_section": "http://rssfeeds.wtsp.com/_/20/109814578/wtsp/entertainmentnews", "section_title": "WTSP - Entertainment", "url": "http://www.wtsp.com/story/entertainment/2015/10/09/docs-nick-gordon-injected-bobbi-kristina-toxic-mixture/73679310/", "country": "US", "title": "Docs: Nick Gordon injected Bobbi Kristina with toxic mixture", "performance_score": 0, "site": "wtsp.com", "participants_count": 0, "title_full": "Docs: Nick Gordon injected Bobbi Kristina with toxic mixture", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T00:13:00.000+03:00", "replies_count": 0, "uuid": "acab132f32722ad66820f8cd7a353d0d89497427"}, "author": "", "url": "http://www.wtsp.com/story/entertainment/2015/10/09/docs-nick-gordon-injected-bobbi-kristina-toxic-mixture/73679310/", "ord_in_thread": 0, "title": "Docs: Nick Gordon injected Bobbi Kristina with toxic mixture", "locations": ["California", "Atlanta", "Hollywood", "CA"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Bobbi Kristina Brown", "Bobbi Kristina", "Nick Gordon", "Frazer Harrison", "Brown"], "text": "Facebook Email Twitter Google+ LinkedIn Pinterest Docs: Nick Gordon injected Bobbi Kristina with toxic mixture The new allegations are made in response to Nick Gordon’s motion to stay discovery proceedings in the civil lawsuit filed by Brown’s conservator. Post to Facebook Docs: Nick Gordon injected Bobbi Kristina with toxic mixture The new allegations are made in response to Nick Gordon’s motion to stay discovery proceedings in the civil lawsuit filed by Brown’s conservator. Check out this story on wtsp.com: http://on.wtsp.com/1LmreJD Cancel Send A link has been sent to your friend's email address. Posted! A link has been posted to your Facebook feed. Join the Conversation To find out more about Facebook commenting please read the Conversation Guidelines and FAQs Docs: Nick Gordon injected Bobbi Kristina with toxic mixture WXIA-TV, Atlanta 5:13 p.m. EDT October 9, 2015 HOLLYWOOD, CA - AUGUST 16: Bobbi Kristina Brown (R) and Nick Gordon arrive at Tri-Star Pictures'\"Sparkle\" premiere at Grauman's Chinese Theatre on August 16, 2012 in Hollywood, California. (Photo: Frazer Harrison, Getty Images) CONNECT TWEET LINKEDIN COMMENT EMAIL MORE \nFULTON COUNTY, Ga. — Bobbi Kristina Brown died after Nick Gordon injected her with a \"toxic mixture \" before placing her unconscious in a bathtub, new documents in a civil lawsuit allege. \nThe new allegations are made in response to Nick Gordon’s motion to stay discovery proceedings in the civil lawsuit filed by Brown’s conservator. Discovery is the legal procedures used to gather evidence for a lawsuit. \nBrown, the 22-year-old daughter of the late Whitney Houston and Bobby Brown, died on July 26 — months after being found unresponsive in the tub of her Roswell, Ga., home on Jan. 31. Brown never regained consciousness. \nThe suit, which was originally filed in June and amended in August after Brown’s death, accused Gordon of assault, battery, intentional infliction of emotional distress, and transferring money from her account into his own without authorization. \nGordon has denied all allegations. \nThe response to Gordon’s motion goes into more details of the alleged abuse Brown suffered before the incident that led to her death. According to the documents, Brown “died following a particularly violent altercation with (Gordon) that left her battered and bruised, with a tooth knocked out...” \nLawyers for Brown’s conservator say that Gordon had “no problem giving an interview to Dr. Phil, but asks this court to relieve him of his legal responsibility to participate in discovery in this case.” The response goes on to state Gordon has waged “a public relations war with” Brown’s family. It also states that Gordon reportedly received $40,000 to allow a magazine to photograph him at Brown’s grave. \nAccording to the response, lawyers say Gordon is arguing that continuing discovery, \"his Fifth Amendment rights 'are being implicated,' \" and \"seeks a blanket prohibition against Plaintiff asking him any questions in discovery.\" The documents state that Gordon and his lawyers have made a number of statements to the press, discussed the case on TV and admits to some of the allegations in the lawsuit. \nGordon \"never sought court intervention to preserve any purported Fifth Amendment privilege nor sought to avail himself of any of the court process which would have delayed or preventing his having to answer any questions\" regarding Brown's injuries and subsequent death. \"Now, some 4 months following the filing of the Complaint ... the Defendant brazenly requests the court to block discovery.\" \nLawyers for Brown's conservator refute assertions that Gordon doesn't have the funds to pay for legal proceedings, saying he \"clearly has assets since has multiple counsel and is selling photographs to the highest bidder. Discovery may reveal a cache of other resources to pay the judgment against him if one is obtained.\" A view of an attendee at the Bobbi Kristina Brown public candlelight vigil at Riverdale Town Center on February 9, 2015 in Riverdale, Georgia. John E. Davidson/Getty Images A view of attendees at the Bobbi Kristina Brown public candlelight vigil at Riverdale Town Center on February 9, 2015 in Riverdale, Georgia. John E. Davidson/Getty Images Rapper Da Brat at Bobbi Kristina Brown Public Candlelight Vigil at Riverdale Town Center on February 9, 2015 in Riverdale, Georgia. John E. Davidson/Getty Images Bobby Browns brother Tommy Brown at Riverdale Town Center on February 9, 2015 in Riverdale, Georgia. John E. Davidson/Getty Images Media covering the Bobbi Kristina Brown Public Candleight Vigil at Riverdale Town Center on February 9, 2015 in Riverdale, Georgia. John E. Davidson/Getty Images A view of attendees at the Bobbi Kristina Brown public candlelight vigil at Riverdale Town Center on February 9, 2015 in Riverdale, Georgia. John E. Davidson/Getty Images Supporters attend the Bobbi Kristina Brown Candlelight Vigil at Riverdale Town Center on February 9, 2015 in Riverdale, Georgia. John E. Davidson/Getty Images Supporters attend the Bobbi Kristina Brown Candlelight Vigil at Riverdale Town Center on February 9, 2015 in Riverdale, Georgia. John E. Davidson/Getty Images Supporters attend the Bobbi Kristina Brown Candlelight Vigil at Riverdale Town Center on February 9, 2015 in Riverdale, Georgia. John E. Davidson/Getty Images Supporters attend the Bobbi Kristina Brown Candlelight Vigil at Riverdale Town Center on February 9, 2015 in Riverdale, Georgia. John E. Davidson/Getty Images Supporters attend the Bobbi Kristina Brown Candlelight Vigil at Riverdale Town Center on February 9, 2015 in Riverdale, Georgia. John E. Davidson/Getty Images Supporters attend the Bobbi Kristina Brown Candlelight Vigil at Riverdale Town Center on February 9, 2015 in Riverdale, Georgia. John E. Davidson/Getty Images Like this topic? You may also like these photo galleries: Replay", "external_links": [], "published": "2015-10-10T00:13:00.000+03:00", "crawled": "2015-10-10T00:26:56.719+03:00", "highlightTitle": ""}