{"organizations": [], "uuid": "4a829ef5a770eca403abaa1aed16fd9949355805", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailyjournal.net", "main_image": "http://d1bdhkmqqz901h.cloudfront.net/1200x630/smart/s3.amazonaws.com/hne-smedia/2/4/243f3f577df9425482b5dc6acbed7acd/web_full_95698585839.jpg", "site_section": "http://dailyjournal.net//feed/sec/7000/", "section_title": "Entertainment News from dailyjournal.net", "url": "http://www.dailyjournal.net/view/story/243f3f577df9425482b5dc6acbed7acd/US--Theater-Actors-Equity-President", "country": "US", "title": "Kate Shindle, the young head of Actors' Equity, reaches out", "performance_score": 0, "site": "dailyjournal.net", "participants_count": 0, "title_full": "Kate Shindle, the young head of Actors' Equity, reaches out", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T17:20:00.000+03:00", "replies_count": 0, "uuid": "4a829ef5a770eca403abaa1aed16fd9949355805"}, "author": "", "url": "http://www.dailyjournal.net/view/story/243f3f577df9425482b5dc6acbed7acd/US--Theater-Actors-Equity-President", "ord_in_thread": 0, "title": "Kate Shindle, the young head of Actors' Equity, reaches out", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kate Shindle"], "text": "'Once an activist, always an activist' - Kate Shindle, new head of Actors' Equity \nBy MARK KENNEDY AP Drama WriterOctober 06, 2015 - 8:54 am EDT \nNEW YORK — One of the most powerful people on Broadway has a corner office with a stunning view of Times Square. But there's a catch: The salary is lousy. \nKate Shindle, the newly elected president of the Actors' Equity Association, leads a 50,000-strong union, but she'll need to find a day job. The president isn't paid. \n\"I will have to remind myself to make a living. As to how it will shake out, it just will,\" said Shindle, who has appeared on Broadway in \"Legally Blonde\" and \"Wonderland.\" \nThat optimism is one reason Shindle has become, at 38, the youngest president in Equity's history. She won a three-way race in May, even getting the backing of people who have grown frustrated by the union. \n\"If we are disparate and we're infighting and if we present a nonunified front to employers — or a fake unified front — then it doesn't help anybody,\" she said. \"Really, we're all in it together.\" \nA graduate of Northwestern University, the 5-foot-11 Shindle won the Miss America crown in 1998 and advocated for HIV prevention and education. \nShe got her Equity card the next year doing \"Into the Woods\" in Sullivan, Illinois. Even with a busy acting career, she rose through the union's ranks, serving on several committees, and was a regional vice president from 2009-2012. \n\"Once an activist, always an activist,\" she said. \"When I see problems that need solving, I want to be part of helping to solve them.\" \nHer election to lead the union of stage actors and stage managers comes at a time when Equity faces contentious issues like nonunion tours, gender equality and the role of digital media. \nIn one of her first steps, Shindle helped launch a Facebook page for members under 40, arguing that younger actors often face different issues than older members. It attracted 1,300 followers in a week. \nWhile she adores Broadway's past — on a wall is a framed copy of Equity's first contract with the Shubert Organization — Shindle embraces new technology. She encourages members to reach out on Instagram or snap selfies posing with their Equity cards. \n\"Right now, how we communicate with our membership, how we help our membership to feel connected with us, I think that's a big glaring thing,\" she said. In this Sept. 30, 2015 photo, Actors' Equity President Kate Shindle poses for a portrait in New York. At just 38, Shindle is the youngest president in Equity's history. (Photo by Amy Sussman/Invision/AP) \n\"There are all kinds of opportunities for entry. Our standard response to people who want to get involved has always been, 'You should join a committee.' It doesn't work that way.\" \nOne member who likes her approach is actor Gavin Creel, whose Broadway credits include \"Thoroughly Modern Millie\" and \"Hair.\" He won an Olivier Award for \"The Book of Mormon.\" \n\"I see her as young blood and young energy,\" he said. \"I'm hoping that she can ignite an interest in what I see as a growing population of apathetic union members — and I definitely include myself in that population.\" \nOne of the most pressing issues facing Shindle will be to repair relationships with members in Los Angeles who objected to Equity's plan to force small theaters to pay actors minimum wages. The Los Angeles membership voted 66 percent against the plan. \nLeo Marks, an Obie-Award-winning stage actor and co-founder of the acclaimed Elevator Repair Service theater company, helped lead activists against the plan but is hopeful about the new president. \n\"My impression of Kate Shindle and her direction for the union is very positive. I think she is sincere — and pretty passionate — about hearing our voices and finding out what she can do to help LA,\" he said. \n\"I feel like she is serious about not just personally hearing what members want but steering the union in a way that is more institutionally able to listen to membership voices.\" \nOne early achievement Shindle can point to is a new tentative, four-year production contract between Equity and The Broadway League, which represents producers. In part, it raises the minimum Broadway pay for actors, which is currently at $1,861 a week. \nAlso on Shindle's agenda is backing a new \"Ask If It's Equity!\" campaign to raise awareness of union tours and getting Equity audition lists online. (\"We're like 10 years behind the curve. I can sign up for any yoga studio in Manhattan on an app in 2 seconds.\") \nDuring her three-year term, she vows to strengthen the relationships with other unions and says she's not afraid to ask for advice from people who might know more than she does about specific issues. \n\"My general thought is, 'This is not that hard.' Humanity has split the atom. We've sent something to Pluto and it sent back a lot of pictures. We've walked on the moon,\" she said. \"We can figure out how to do plays and musicals better.\" \nOnline: \nhttp://www.actorsequity.org \nThink your friends should see this? Share it with them! \nStory copyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. \nFeedback, Corrections and Other Requests: AP welcomes feedback and comments from readers. Send an email to info@ap.org and it will be forwarded to the appropriate editor or reporter. We also have more stories about: (click the phrases to see a list) \nCategory:", "external_links": [], "published": "2015-10-06T17:20:00.000+03:00", "crawled": "2015-10-06T18:06:04.876+03:00", "highlightTitle": ""}