{"organizations": [], "uuid": "d702e4723fe12d99dcf12c5f0b66ef683c4fe8c3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266353/arts-entertainment-television", "section_title": "Arts &amp; Entertainment: Television - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30338785/the-changing-face-of-mobile-gaming", "country": "US", "title": "The Changing Face of Mobile Gaming", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "The Changing Face of Mobile Gaming - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T05:11:00.000+03:00", "replies_count": 0, "uuid": "d702e4723fe12d99dcf12c5f0b66ef683c4fe8c3"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30338785/the-changing-face-of-mobile-gaming", "ord_in_thread": 0, "title": "The Changing Face of Mobile Gaming", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A brand new mobile game will change everything we know about using phones in social settings. Let’s Be Honest - a party game which gives a scary and hilarious look into what friends really think about us - wants to challenge the idea that technology is pushing us apart by making our phones the ultimate social lubricant.\nSydney, Australia (PRWEB) October 23, 2015\nLet’s Be Honest is leading a new wave of apps that merge digital and party games, bringing friends together in ways that couldn’t be imagined without the smartphone. Smartphones are a lifeblood in the modern world but criticisms for their disruption to real world, person-to-person interaction are never far away.\nThe creators of Let's Be Honest wanted to challenge those misconceptions. Co-creator Harry Cominos said, \"We set out to create a group gaming experience which perfectly balanced group interaction with the added dynamic and enjoyment of gameplay on an individual's device. We also wanted this to be a game for adults so taking it into a space which is a little bit cheeky, fun and inappropriate has made it something people love playing on a night with friends\".\nOne of Cominos' co-creators Rob d'Apice added \"In the least, we hope we can inspire a few other developers to think about how to get phones playing a bigger role in adult, social gaming. There's so much potential out there and this really is just the start.\"\nAvailable to download from Google Play and Apple App Store from today. Visit letsbehonest.co for more information.\nLet’s Be Honest is a party game that isn’t afraid to get inappropriate - it’s as though Cards Against Humanity and Heads Up had a mutated love-child. The game takes on one of the eternal questions - what do my friends really think of me?! Its premise is simple: A group of friends chooses a dangerously honest question and then secretly votes for who they think will be the most popular answer.\nThere are different themed decks for different occasions. Although, players can pay to find out how everyone voted after the game is finished - so answer carefully. With over 500 pre-loaded questions, no two games will ever be the same.\nAbout the Let’s Be Honest developers:\nLet’s Be Honest was developed by Sydney friends, Rob, Lewis, Harry and Josh. It’s the first app they’ve created after they set out initially to make a game that they could play with their friends. In the spirit of honesty, they admit that when they started this they had no idea what they were doing (and still don’t).\nAdditional information and files can be downloaded from: http://www.letsbehonest.co/press\nFor any additional information please contact Josh or Rob:\nJosh - +61 413948101 josh(at)letsbehonest.co\nRob - +61 403905818 rob(at)letsbehonest.co\n //www.prweb.com/releases/2015/10/prweb13037583.htm\n ", "external_links": ["http://www.prweb.com/releases/2015/10/prweb13037583.htm", "http://www.letsbehonest.co/press"], "published": "2015-10-24T05:11:00.000+03:00", "crawled": "2015-10-24T08:52:35.532+03:00", "highlightTitle": ""}