{"organizations": [], "uuid": "34eb20a01ac272ce4277a446cff188cfccb8eb73", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbsnews.com", "main_image": "http://cbsnews1.cbsistatic.com/hub/i/r/2015/01/21/24f546af-f9d2-49db-94b2-ea9dcd90b947/thumbnail/620x350/4aeecc0597ee903276884be00e264710/468496651.jpg", "site_section": "http://www.cbsnews.com/entertainment/", "section_title": "Entertainment News, Headlines and Video - CBS News ", "url": "http://www.cbsnews.com/news/malcolm-jamal-warner-opens-up-about-cosby-allegations/", "country": "US", "title": "Malcolm-Jamal Warner opens up about Cosby allegations", "performance_score": 0, "site": "cbsnews.com", "participants_count": 5, "title_full": "Malcolm-Jamal Warner opens up about Cosby allegations - CBS News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T16:36:00.000+03:00", "replies_count": 4, "uuid": "074e04a6aedbbb8919bfc54367664c0e6b01b5a3"}, "author": "AP", "url": "http://www.cbsnews.com/news/malcolm-jamal-warner-opens-up-about-cosby-allegations/#post-0", "ord_in_thread": 0, "title": "Malcolm-Jamal Warner opens up about Cosby allegations", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES -- \"The Cosby Show\" alum Malcolm-Jamal Warner says the series' legacy is \"tarnished\" by the sexual assault allegations made against Bill Cosby.\n\"My biggest concern is when it comes to images of people of color on television and film, no matter what ... negative stereotypes of people of color, we've always had 'The Cosby Show' to hold up against that. And the fact that we no longer have that, that's the thing that saddens me the most because in a few generations the Huxtables will have been just a fairy tale,\" said Warner, who starred as Cosby's son, Theo Huxtable, on the long-running NBC sitcom.\nPlay Video CBS This Morning Bill Cosby to give deposition amid new sexual assault claim The civil lawsuit by Judy Huth claims the comedian assaulted her at the Playboy Mansion in 1974 when she was 15. It’s Cosby’s first deposition si...\nWarner said he has been in touch with Cosby, but he would not comment on their conversations.\n\"I think the things that we discussed really have to stay private between us. But it's just a bad situation all around -- for him, for his family, the women, their families, the legacy of the show,\" said Warner during an interview Thursday.\nCosby admitted having extramarital relationships with several women, including some who now accuse him of sexual assault. He has never been charged with a crime.\nPlay Video Entertainment Another Cosby event postponed in fallout of rape allegations Foxwoods Resort Casino in Connecticut has postponed Bill Cosby's January appearance indefinitely. Also, President Obama awarded the Medal of Free...\nWarner, who won his first Grammy earlier this year for his work on Robert Glasper's \"Jesus Children,\" is currently promoting his new album, \"Selfless,\" out now.\nHe describes the third record with his band Miles Long as \"funky passionate vulnerability.\"\nWarner is also filming \"American Crime Story: The People vs. O.J. Simpson,\" directed by Ryan Murphy. He plays Simpson's friend Al \"A.C.\" Cowlings.\n\"I grew up with a maniacal obsession with not wanting to be one of those 'Where Are They Now Kids,' \" said Warner of his busy year. \"I feel very blessed to be able to have all of these avenues of expression ... to be where I am now and finally at a place where I can let go of that worry about having a life after 'Cosby.'\"", "external_links": ["http://cbsnews1.cbsistatic.com/hub/i/r/2014/11/25/33fc8d5e-6f4c-4831-968d-1705023b690a/thumbnail/220x140/5505f7bc5c2de731f0b527573536ac39/web1125ent1312934640x360.jpg", "http://cbsnews1.cbsistatic.com/hub/i/r/2015/10/09/d4d1d1cf-b53a-4a29-8a85-d0691ba42c30/thumbnail/220x140/a8a7d4871ea44cfdb6a9ff81f4c373bf/ctm1009cosbydeposition453244640x360.jpg"], "published": "2015-10-09T16:36:00.000+03:00", "crawled": "2015-10-10T03:31:48.068+03:00", "highlightTitle": ""}