{"organizations": [], "uuid": "8a3cd3265f8eb747c6a4ef901de65019818ebad1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.itv.com", "main_image": "http://www.itv.com/news/assets/branding/fb.png", "site_section": "http://www.itv.com/news/granada/entertainment/", "section_title": "Entertainment | Granada - ITV News", "url": "http://www.itv.com/news/granada/2015-10-16/new-single-from-take-that/", "country": "GB", "title": "New single from Take That", "performance_score": 0, "site": "itv.com", "participants_count": 1, "title_full": "New single from Take That | Granada - ITV News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T20:29:00.000+03:00", "replies_count": 0, "uuid": "8a3cd3265f8eb747c6a4ef901de65019818ebad1"}, "author": "itv.com", "url": "http://www.itv.com/news/granada/2015-10-16/new-single-from-take-that/", "ord_in_thread": 0, "title": "New single from Take That", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tonight Manchester band Take That will perform their brand new single HEY BOY for the very first time on the opener of Channel 4's brand new series TFI Friday at 9pm. The single is an addition to their number one album III and will be out on November 20th.\nAlongside the new single, Take That – III – 2015 Edition will include three new studio tracks together with the live DVD of their recent UK tour Take That Live 2015, giving fans a front row seat perspective to relive the experience.\nTake That’s tour DVD’s are an event in themselves with their previous releases having broken every sales record going in the UK. Their latest DVD of their most recent UK Tour ‘III', which ended earlier this week in Milan, was filmed at the O2 earlier this year and shows their spectacular live production in its full glory; a wonderful, colourful explosion with everything from dancing jellyfish, beautifully choreographed puppetry and a contemporary dance routine performed by Mark and Howard to a flying tandem sidecar that soars out over the crowd, a burning globe, pyros, fireworks and indoor rain.\n‘III’ which went straight to Number One at the end of 2014 marked another poignant moment in the band's legacy as a newly created three-piece. The album includes the band’s most recent hits including ‘Get Ready For It' written for the blockbuster Kingsman and ?No.1 hit 'These Days'\nTake That have had seven UK Number One albums, 12 UK Number One singles, sold over 45 million records, won six Ivor Novellos, eight BRITs and sold over seven and a half million concert tickets in their lifetime.\nLast updated Fri 16 Oct 2015 Entertainment", "external_links": [], "published": "2015-10-16T20:29:00.000+03:00", "crawled": "2015-10-20T16:21:53.594+03:00", "highlightTitle": ""}