{"organizations": [], "uuid": "998bccde34957583e94e11df56fc7069d9d2e5eb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.forbes.com", "main_image": "{{meta.image}}", "site_section": "http://www.forbes.com/media-entertainment/", "section_title": "Forbes - Media Information and Entertainment News - Forbes.com", "url": "http://www.forbes.com/sites/franktherber/2015/09/30/dollars-longevity-hint-vick-is-subtly-making-a-run-at-nfl-history/", "country": "US", "title": "Dollars, Longevity Hint Vick Is Subtly Making A Run At NFL History", "performance_score": 1, "site": "forbes.com", "participants_count": 1, "title_full": "Dollars, Longevity Hint Vick Is Subtly Making A Run At NFL History", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T06:41:00.000+03:00", "replies_count": 0, "uuid": "998bccde34957583e94e11df56fc7069d9d2e5eb"}, "author": "Frank Therber", "url": "http://www.forbes.com/sites/franktherber/2015/09/30/dollars-longevity-hint-vick-is-subtly-making-a-run-at-nfl-history/", "ord_in_thread": 0, "title": "Dollars, Longevity Hint Vick Is Subtly Making A Run At NFL History", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The evolution to the spread and zone-read offense at the college level has presented a high-risk scenario for NFL general managers, scouts and coaches over the last 15-20 years, specifically with the quarterback in mind. As fantasy owners know better than anyone, there have been productive dual-threat quarterbacks in the NFL to varying degrees, such as Cam Newton and Tim Tebow who are at opposite ends of the success spectrum in this regard. But, for each of those players whose skill set transfers over for either a short or extended time period, there are probably at least two Johnny Manziel or Eric Crouch stories, marked by an inability to resort to arm rather than legs and make NFL-caliber throws on a consistent basis. One exception to the rule, now 13 seasons and counting, is Michael Vick. That number could have eclipsed 15 had Vick stayed clear of legal troubles dating back to his dog fighting convictions in 2007. Quarterback aside, there have been numerous players whose collegiate careers hinted at a promising transition to the NFL but, for various reasons, spent time out of football and could never experience or sustain success in the professional ranks. Three of the more notable cases include Maurice Clarett, Mike Williams and, to a lesser degree, Ricky Williams. Vick’s two years out of the NFL during incarceration in addition to his dual-threat nature on the field are what make him one of the more interesting stories around the league. This Sunday at Heinz Field, the current Steeler will make his first start since week 12 of last season due to Ben Roethlisberger’s MCL injury sustained last week. He will also come one week closer to exceeding $107-million in career earnings, should he remain on Pittsburgh’s roster at least half of the year. The 34-year old is subtly making his case as one of the most pure athletes in NFL history. Consider the following:•tMore than 56%, or $60-million, of his $106.5-million in career earnings to date, came after both his time in prison and turning 28 years old. •tThe former Virginia Tech quarterback accounted for 71 touchdowns in 74 games prior to his two-year hiatus, and has notched 60 scores while appearing in 66 games since. •tVick has appeared in at least 10 games five times since his return in 2009, something he accomplished only four times during his career in Atlanta. Regardless of the whether or not Vick wins a Super Bowl or how long he continues to play, his numbers are not consistent enough, among other factors, to garner consideration as an all-time great quarterback. However, his ability to continually warrant a roster spot, by-and-large remain healthy and pose a potent dual-threat to defenses should classify him as one of the best athletes to ever play the game.", "external_links": [], "published": "2015-10-01T06:41:00.000+03:00", "crawled": "2015-10-01T01:47:29.862+03:00", "highlightTitle": ""}