{"organizations": [], "uuid": "bf1b124870bc59272eedb501ea76a8e44f6eb44e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.aceshowbiz.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Aceshowbizcom-EntertainmentNews", "section_title": "Aceshowbiz.com - Entertainment News", "url": "http://www.aceshowbiz.com/news/view/00090223.html", "country": "US", "title": "Police Union Calls for Boycott of Quentin Tarantino Movies After His Anti-Cop Rally", "performance_score": 0, "site": "aceshowbiz.com", "participants_count": 1, "title_full": "Police Union Calls for Boycott of Quentin Tarantino Movies After His Anti-Cop Rally", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T04:29:00.000+02:00", "replies_count": 0, "uuid": "bf1b124870bc59272eedb501ea76a8e44f6eb44e"}, "author": "AceShowbiz.com", "url": "http://www.aceshowbiz.com/news/view/00090223.html", "ord_in_thread": 0, "title": "Police Union Calls for Boycott of Quentin Tarantino Movies After His Anti-Cop Rally", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments The 'Hateful Eight' director referred to police as 'murderers' during a rally against police brutality at Washington Square Park on Saturday, October 24. \nNew York's police union is calling for a boycott of Quentin Tarantino movies following his anti-police brutality rally. Patrolmen's Benevolent Association's president Patrick Lynch said in a statement on Sunday, October 25, \"It's no surprise that someone who makes a living glorifying crime and violence is a cop-hater, too.\" \"The police officers that Quentin Tarantino calls 'murderers' aren't living in one of his depraved big-screen fantasies - they're risking and sometimes sacrificing their lives to protect communities from real crime and mayhem,\" Patrick continued, \"New Yorkers need to send a message to this purveyor of degeneracy that he has no business coming to our city to peddle his slanderous 'Cop Fiction.' \" On Saturday, Quentin addressed hundreds of protesters in a rally held less than a week after an officer was killed on the job. The \" Django Unchained \" director fired up the crowd with a speech which was accompanied by pictures of those who have been killed by police including Justin Smith. \"I'm a human being with a conscience,\" Quentin said, \"And if you believe there's murder going on then you need to rise up and stand up against it. I'm here to say I'm on the side of the murdered. This is not being dealt with in anyway at all. That's why we are out here. If it was being dealt with, then these murdering cops would be in jail or at least be facing charges.\" Quentin's upcoming movie \" The Hateful Eight \" starring Samuel L. Jackson , Kurt Russell , Jennifer Jason Leigh , Walton Goggins , Demian Bichir , Tim Roth , Michael Madsen and Bruce Dern is slated to hit U.S. theaters on December 25. During a recent AFM, the director announced he would retire after his tenth movie . \n© AceShowbiz.com", "external_links": [], "published": "2015-10-26T04:29:00.000+02:00", "crawled": "2015-10-26T22:01:03.566+02:00", "highlightTitle": ""}