{"organizations": ["Paley Center For Media", "Plot & Rumors"], "uuid": "588dc62054f47ab858998f1bedd1daaeb4c6e834", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.latinospost.com", "main_image": "", "site_section": "http://www.latinospost.com/rss/sections/entertainment.xml", "section_title": "Latinos Post : Entertainment", "url": "http://www.latinospost.com/articles/74554/20151004/girls-2-more-seasons-spoilers-release-date-cast-plot-rumors.htm", "country": "US", "title": "‘Girls’ to Get 2 More Seasons [Spoilers, Release Date, Cast, Plot & Rumors]", "performance_score": 0, "site": "latinospost.com", "participants_count": 0, "title_full": "‘Girls’ to Get 2 More Seasons [Spoilers, Release Date, Cast, Plot & Rumors]", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T06:14:00.000+03:00", "replies_count": 0, "uuid": "588dc62054f47ab858998f1bedd1daaeb4c6e834"}, "author": "", "url": "http://www.latinospost.com/articles/74554/20151004/girls-2-more-seasons-spoilers-release-date-cast-plot-rumors.htm", "ord_in_thread": 0, "title": "‘Girls’ to Get 2 More Seasons [Spoilers, Release Date, Cast, Plot & Rumors]", "locations": ["California", "Hollywood", "CA"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Allison Williams", "Lena Dunham", "Frazer Harrison", "Frazer", "Jennifer Konner"], "text": "‘Girls’ to Get 2 More Seasons [Spoilers, Release Date, Cast, Plot & Rumors] Comment Tags Lena Dunham , Girls season 6 , Girls HOLLYWOOD, CA - MARCH 08: (L-R) Executive producer Jennifer Konner, creator/executive producer Lena Dunham and actress Allison Williams speak onstage at The Paley Center For Media's 32nd Annual PALEYFEST LA - 'Girls' at Dolby Theatre on March 8, 2015 in Hollywood, California. (Photo by Frazer Harrison/Getty Images) (Photo : Frazer Harrison / Staff) 0   \n\"Girls\" season 4 premiere and finale saw dramatic dip in the ratings. But unlike other TV series, which abruptly went off the air due to low ratings, \"Girls\" fans will still get to see them for two more seasons! \nIn January, Deadline reported that \"Girls\" season 4 had recorded a season-premiere low as compared to the opening of season 3 and the opening of seasons 1 and 2. It is also interesting to note the 35 percent drop among the 18-49 demographics. Only 390,000 from the target demo watched the season premiere. Come March, Deadline reported that the season 4 finale also saw a dramatic drop among the target demo. Only 326,000 18-49 adults watched the finale, a 33 percent fall from the season 3 finale in 2014. Like Us on Facebook \nBut the series has wrapped up production for season 5 in August, which means it will be shown as expected in January 2016. \"Girls Season 5: that's a wrap. We love our cast, our crew, our new extended family. And we love you! See you in January,\" Lena Dunham posted on Instagram . \nNow Dunham has said that the right time to end the girls' stories is in season 6. \"Never say never, but that is the way that we're thinking about it right now and we're starting to think about sort of how to wrap up the storylines of these particular young women,\" Dunham told Elvis Duran And The Morning Show. \"I started working on this show when I was 23, and now I'm going to be 30 so it kind of feels right that this show kind of sandwiched my 20s and then I go off into the world,\" she said further. \nAnd off to the world Hannah would go. In a recent interview with The Hollywood Reporter , showrunner Jenni Konner said that season 5 will see more of Fran and Hannah's relationship. With regard to Hannah's career, she will figure things out whether teaching is the perfect career for her. Hence, season 5 will have a school setting that's much like the high school Lena went to. \nSeason 5 will also explore more of Tad and Loreen's story. Konner said they want a realistic version of Tad; peel the character more in terms of what he wants, what he is afraid of and how brave he is. Elijah's character will also be explored in depth in the next season, as well as the characters of Laird and Marnie's mom. \nAsked whether there is an end game for the series, Konner said the show may run for another year and will wrap up by season 6. \"We would like to end in a graceful place. And we'd like to tell a complete story. What that means is that we really have to start building towards an end soon, creatively,\" she said.", "external_links": [], "published": "2015-10-05T06:14:00.000+03:00", "crawled": "2015-10-05T08:32:21.636+03:00", "highlightTitle": ""}