{"organizations": [], "uuid": "ddf965c1b6e55a57a35e3fd245529a6c6c2b932e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.digitalspy.co.uk", "main_image": "http://i2.cdnds.net/14/30/300x225/movies-xxx-vin-diesel.jpg?1102498793", "site_section": "http://www.digitalspy.co.uk/rss/zones/gb/all.xml#", "section_title": "All - Digital Spy - Entertainment and Media News", "url": "http://www.digitalspy.co.uk/movies/news/a673133/vin-diesel-reveals-dj-caruso-to-direct-third-xxx-movie.html?rss", "country": "US", "title": "Vin Diesel reveals DJ Caruso to direct third XXX movie - Movies", "performance_score": 0, "site": "digitalspy.co.uk", "participants_count": 1, "title_full": "Vin Diesel reveals DJ Caruso to direct third XXX movie - Movies News - Digital Spy", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T03:00:00.000+03:00", "replies_count": 0, "uuid": "ddf965c1b6e55a57a35e3fd245529a6c6c2b932e"}, "author": "Kristina Bustos", "url": "http://www.digitalspy.co.uk/movies/news/a673133/vin-diesel-reveals-dj-caruso-to-direct-third-xxx-movie.html?rss", "ord_in_thread": 0, "title": "Vin Diesel reveals DJ Caruso to direct third XXX movie - Movies", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "More details about the upcoming third XXX movie have come out.Diesel told io9 that DJ Caruso will be the director of XXX 3 Vin Diesel in xXx (2002) Caruso is best known for directing Disturbia and Eagle Eye.\"I'm excited as hell about XXX. DJ Caruso is directing it, which is exciting,\" Diesel said. \"The big question now is which will race to production first now that F Gary Gray is on [Furious 8]? Will XXX race to production first or will Fast race to production first?\"While Diesel may not know which movie of his will go into production first, a release date of Fast & Furious 8 was already announced - April 14th, 2017. Straight Outta Compton's F Gary Gray will also be directing Fast & Furious 8.Back in August, Diesel announced on his Instagram that he will be reprising his role as Xander Cage, a rebellious extreme sports enthusiast turned undercover spy. The film will start shooting in December. Diesel also added how much fun he has playing Cage on the big screens, which he first played in 2002. A sequel was made in 2005 but starred Ice Cube instead of Diesel.\"XXX is one of those films you do when you need to have a little fun,\" Diesel said. \"When the weight and pressures of all the other things have gone so far that you need to have a character that you can just have fun and more comment on life and comment on the outcome than being in it like Dom Torretto [from Fast and Furious]. \"Dom is very much the centre of the storm, Xander is more the guide to something else and you're just with him.\"", "external_links": [], "published": "2015-10-11T03:00:00.000+03:00", "crawled": "2015-10-12T02:00:19.897+03:00", "highlightTitle": ""}