{"organizations": [], "uuid": "a46787bc35f74c5741f329e01a861477459e4b3b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattletimes.com", "main_image": "http://static.seattletimes.com/wp-content/uploads/2015/10/Deerhunter_2015-1200x630.jpg", "site_section": "http://seattletimes.com/rss/artsentertainment.xml", "section_title": "The Seattle Times » Sections » Entertainment", "url": "http://www.seattletimes.com/entertainment/music/your-week-in-seattle-music-florence-and-the-machine-2-chainz-and-more/?utm_source=RSS&utm_medium=Referral&utm_campaign=RSS_entertainment", "country": "US", "title": "Your week in Seattle music: Florence and the Machine, 2 Chainz and more", "performance_score": 0, "site": "seattletimes.com", "participants_count": 1, "title_full": "Your week in Seattle music: Florence and the Machine, 2 Chainz and more | The Seattle Times", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T19:12:00.000+03:00", "replies_count": 0, "uuid": "226c26103b7b50c365cb6548c57788d4383ad145"}, "author": "Andrew Gospe", "url": "http://www.seattletimes.com/entertainment/music/your-week-in-seattle-music-florence-and-the-machine-2-chainz-and-more/", "ord_in_thread": 0, "title": "Your week in Seattle music: Florence and the Machine, 2 Chainz and more", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Deafheaven 8 p.m. Wednesday, Oct. 21, at Neumos, 925 E. Pike St., Seattle; $18 (206-709-9442 or www.neumos.com). With Tribulation \nMetal fans in general, and black-metal fans in particular, are prone to fret over authenticity. With its slickly coiffed singer , bright-pink album art and positive coverage from the mainstream music press, Deafheaven has earned scorn from some of the genre’s devotees, who resent the group’s crossover appeal. Second album “New Bermuda,” comprising five meandering, atmospheric metal epics, should appease them at least somewhat. \nDeerhunter 7:30 p.m. Wednesday, Oct. 21, at the Showbox, 1426 First Ave., Seattle; $20–$23 (206-628-3151 or www.showboxpresents.com). With Atlas Sound \nI don’t remember much about Spoon’s set at the Moore in April 2010, but I’ll never forget Deerhunter making people uncomfortable. Bradford Cox ended his band’s opening set with a seemingly impromptu monologue where he riffed on body image, bullying and Kurt Cobain for nearly 15 minutes as his band made a bunch of noise behind him. It was a rare live-music show where a band went off script. \nLido Most Read Stories Pair split; now can she divorce nickname? Next Air Force One will fly faster, farther with advanced technology What’s really wrong with the Seahawks? They’re just not as good Take 2: Oregon alum to abusive Huskies fans - this rivalry doesn't need you Seattle Seahawks to lift suspension on fullback Derrick Coleman Unlimited Digital Access. $1 for 4 weeks. 8 p.m. Wednesday, Oct. 21, at the Crocodile, 2200 Second Ave., Seattle; $15 (206-441-7416 or www.thecrocodile.com). With Brass Tacks, Maia Avalon \nLido is the alias of 21-year-old Norwegian producer Peder Losnegård, whose forward-thinking club music quickly became popular on Soundcloud over the course of a year or so. Cashmere Cat (a countryman and friend) is a close referent, as is future hip-hop maven Rustie, and Losnegård’s work shares a playful, antiseptic quality with those artists. \nThe Zombies 8 p.m. Wednesday, Oct. 21, at Benaroya Hall, 200 University St., Seattle; $40–$250 (206-215-4800 or www.seattlesymphony.org). \nThe Zombies went into the studio to record “Odessey and Oracle” shortly after The Beatles released “Sgt. Pepper’s” in summer of 1967, the first of many ways it would live in the shadow of perhaps the most-acclaimed album of all time. The rose-colored psych-pop of “Odessey” has aged gracefully—it’s now deservedly considered a classic—and the band will perform it in its entirely at this show. \nFIDLAR 8 p.m. Friday, Oct. 23, at the Showbox, 1426 First Ave., Seattle; $16–$18 (206-628-3151 or www.showboxpresents.com). With Dune Rats \nLos Angeles garage-punk band FIDLAR’s live shows are known for catharsis, with the audience often ending up onstage. But this run of dates should be cathartic for a different reason: it comes, along with new album “Too,” after Zac Carper kicked a heroin habit (apparently with Green Day’s help ). \nMutemath 8 p.m. Friday, Oct. 23, at the Tractor Tavern, 5231 Ballard Ave. N.W., Seattle; $20 (206-789-3599 or www.tractortavern.com). With Quiet Entertainer \nIf the first single from forthcoming album “Vitals” is any indication, this New Orleans group is heading in a more electronic direction (not an uncommon choice for alternative rock bands these days). “Light Up” is full of twinkling synths and funk-guitar rhythms, and its chorus does the half-time breakdown thing found on so many EDM tracks. \n2 Chainz 8 p.m. Saturday, Oct. 24, at Showbox SoDo, 1700 First Ave. S., Seattle; $57.50–$67.50 (360-652-0444 or www.showboxpresents.com). \nThough he’s not one of Atlanta rap’s leading stylists (that’s probably Young Thug, who played the Showbox SoDo two weeks ago), 2 Chainz is coming to Seattle fresh off a headlining slot at Atlanta hip-hop festival A3C. Aside from a mixtape in August, there hasn’t been a lot of music from 2 Chainz in 2015, but he did start his own record label The Real University. \nAlbert Hammond Jr. 8 p.m. Sunday, Oct. 25, at the Crocodile, 2200 Second Ave., Seattle; $13 (206-441-7416 or www.thecrocodile.com). With Walking Shapes \n“Momentary Masters” is the latest work from Albert Hammond Jr., and its title projects a sense of existentialism that was rarely found in the guitarist and keyboardist’s primary band The Strokes. The album is named for a phrase coined by astronomer Carl Sagan and, unsurprisingly, waxes philosophical, though it’s buoyed by Hammond Jr.’s spry guitar playing that should sound familiar to Strokes fans. \nAWOLNATION 8 p.m. Tuesday, Oct. 27, at the Paramount Theatre, 911 Pine St., Seattle; $28.75–$31.25 (360-467-5520 or www.stgpresents.org). With Irontom, Meg Myers \nMuch of AWOLNATION’s music is the sort of blandly aspirational modern rock that L.A. seems to produce like nowhere else. (His two records being released on Red Bull’s record label should clue you into the target audience.) But I’ll still vouch for “Sail,” the project’s biggest hit, as a clever pop song and a breath of fresh air compared to the usual fare on rock radio. \nFlorence + the Machine 8 p.m. Tuesday, Oct. 27, at KeyArena, 305 Harrison St., Seattle; $26.50–$66.50 (206-684-7200 or www.keyarena.com). \nFlorence and the Machine don’t write songs so much as they write epics. The British band’s orchestral rock is driven by Florence Welch’s powerful vocals, which often strain to wring the meaning out of every syllable. Welch and her band are touring behind third album “How Big, How Blue, How Beautiful.” \n \n \nAndrew Gospe : gospea@gmail.com ; on Twitter: @andrewgospe . Andrew Gospe is a freelance writer and electronic musician who has called Seattle home since 2009.", "external_links": [], "published": "2015-10-20T19:12:00.000+03:00", "crawled": "2015-10-21T05:41:42.177+03:00", "highlightTitle": ""}