{"organizations": [], "uuid": "9fc79dd5e7a0ca8cbac932679259d32726a2495d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "610kvnu.com", "main_image": "http://abcnewsradioonline.com/storage/news-images/041015_EddieMurphyNBC.jpg?__SQUARESPACE_CACHEVERSION=1428688605493", "site_section": "http://www.610kvnu.com/entertainment/feed.xml", "section_title": "Entertainment", "url": "http://610kvnu.com/entertainment/5e54d9a2dec50c566275847b6f286098", "country": "US", "title": "Is Eddie Murphy Contemplating a Return to Stand-Up Comedy?", "performance_score": 0, "site": "610kvnu.com", "participants_count": 0, "title_full": "Is Eddie Murphy Contemplating a Return to Stand-Up Comedy?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T07:00:00.000+03:00", "replies_count": 0, "uuid": "9fc79dd5e7a0ca8cbac932679259d32726a2495d"}, "author": "", "url": "http://610kvnu.com/entertainment/5e54d9a2dec50c566275847b6f286098", "ord_in_thread": 0, "title": "Is Eddie Murphy Contemplating a Return to Stand-Up Comedy?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Eddie Murphy"], "text": "Is Eddie Murphy Contemplating a Return to Stand-Up Comedy? Posted just a moment ago \nChris Haston/NBC (WASHINGTON) -- Eddie Murphy did something while accepting the Mark Twain Prize for American Humor at the Kennedy Center in Washington, D.C. on Sunday that he hasn't done in nearly three decades -- tell a joke. \nThe Washington Post reports Murphy performed a brief stand-up routine during his acceptance speech. And after refusing to to poke fun at Bill Cosby's sexual assault allegations at Saturday Night Live 's 40th anniversary special earlier this year, Murphy went after the embattled comic with a spot-on impersonation. \n\"You may have heard recently that I allegedly put the pill in the people’s stomach,” said the 54-year-old actor/comedian. \"If I ever see or meet this Hannibal Buress in person I am going to try and kill this man!” \nMurphy first revealed his plan to tell a few jokes during the speech to his Coming to America co-star Arsenio Hall a couple of weeks ago, Hall tells the newspaper. On Saturday, Murphy tried out the routine on Hall and fellow comedian Chris Rock. \n\"[Eddie] said, ‘Because Cosby gonna get sick of this soon, he’s gonna get sick of people hating, and eventually he’s gonna have to say something,’” Hall recalls Murphy explaining to them. “And we were like, ‘That is funny, man. Are you willing?'” \nWhen asked if the seven-minute routine is an indication Murphy is ready to make a return to the stage, Hall replied, \"It's a glimpse of a man who has one foot on a stand-up stage and another foot on a banana peel, and I just hope he can get to the stage.” \nAdds Hall, “I said the only problem now is from now on when you do stand-up, you’re gonna have to hold Mark Twain’s head because you were awful comfortable in that position…Take the Mark Twain head on the road, even though Mark Twain would not have liked it.” \nCopyright © 2015, ABC Radio. All rights reserved.", "external_links": [], "published": "2015-10-20T07:00:00.000+03:00", "crawled": "2015-10-20T02:31:00.708+03:00", "highlightTitle": ""}