{"organizations": [], "uuid": "15096ba3b4b202068a4dd2ccb8f8240b070aa335", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.jsonline.com", "main_image": "http://media.jrn.com/images/b99600357z.1_20151023151518_000_gd4d1sef.1-0.jpg", "site_section": "http://www.jsonline.com/rss?c=y&path=%2Fentertainment%2Ftopstories&atom=y", "section_title": "JSOnline.com HL - Entertainment Top Stories", "url": "http://www.jsonline.com/entertainment/books/humor-a-main-ingredient-in-new-books-by-jaimee-hills-ronald-wallace-b99600357z1-336384841.html", "country": "US", "title": "Book Reviews - Humor a main ingredient in new books by Jaimee Hills, Ronald Wallace", "performance_score": 0, "site": "jsonline.com", "participants_count": 1, "title_full": "Book Reviews - Humor a main ingredient in new books by Jaimee Hills, Ronald Wallace", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T16:40:00.000+03:00", "replies_count": 0, "uuid": "15096ba3b4b202068a4dd2ccb8f8240b070aa335"}, "author": "Jim Higgins", "url": "http://www.jsonline.com/entertainment/books/humor-a-main-ingredient-in-new-books-by-jaimee-hills-ronald-wallace-b99600357z1-336384841.html", "ord_in_thread": 0, "title": "Book Reviews - Humor a main ingredient in new books by Jaimee Hills, Ronald Wallace", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Two Wisconsin poets have recently published collections notable for their wit, humor, technique and playful engagement with earlier texts.\nHow to Avoid Speaking. By Jaimee Hills. Waywiser Press. 96 pages. $19.\nJaimee Hills signals her intelligence, intensity and puckishness from the outset with \"Synaesthesia,\" a sonnet suggesting that multisensory experience is a child's prelapsarian state, and \"Chlamydia,\" which finds the \"melody cloaked in the malady\" of that euphoniously named STD.\nSeveral alphabet-driven poems build on pairs of words that include and exclude the key letter, such as vie and vile in \"Lo Lee Ta,\" anger and danger in \"On D,\" sifter and swifter in \"Wonder Woman's Résumé.\" \"On Z\" imagines the future of Henrietta Lacks from the inside: \"My cervix, the color of rose quartz, / contained my children, cancer, a quart / of immortality, shiny and purple.\" \"Andy Warhol's Wig\" concludes brilliantly: \"I am floating now, / in that small gulf between a person and a persona.\"\nYou may see semiotics in a new light after reading \"Derrida Eats a Dorito\": \"...from the moment I open my mouth / I have already promised; or rather, and sooner, / the promise has seized the I which promises / to eat the Dorito.\"\nBut if such discourse makes you shudder, fear not: Hills offers a pair of poems starring Brad Pitt, too.\nTwo suggestions for reading Hills: Take your time, these are high-calorie poems that can take a little while to digest; have a dictionary handy — I had to look up glabella and suint, among other words. But props to the poet — Hills had a specific reason for each obscure word choice in this volume.\nShe teaches English at Marquette University. \"How to Avoid Speaking\" won the annual Anthony Hecht Poetry Prize in 2014.\nFor Dear Life. By Ronald Wallace. University of Pittsburgh Press. 88 pages. $15.95.\nOpening \"For Dear Life\" at a random page, I encountered Ronald Wallace's ode to the unnameable, \"In the Name of God\": \"How must I address You? / You of the Improbable Moniker, / Utmost, Unlikely Entity, / Enormous Essence....\" Humor is the chloroplast of his poetry, converting life experience painful and pleasant into poetic energy.\nI found Wallace's poems about his father, who had multiple sclerosis, compelling. In \"Catching My Father\" he remembers playing catch with his wheelchair-bound father and misses him now. \"Scrabble\" offers his father's declining board skills, or bad luck in letters, as a metaphor for his health. In \"Wolf Pack,\" the young Wallace revises his opinion of his old man after discovering his deck of nudie cards: \"Who was this man I'd stripped of / love? Outside, the moon removed its blouse of cloud.\"\nMany of this collections' poems are sonnets that incorporate acrostic riffs on great haiku masters, including Basho and Issa. For example, in \"Turnips,\" Wallace remembers a neighboring farmer he once regarded warily. But now the farmer has dementia, and Wallace misses their encounters. The last word of each line of Wallace's poem, read from top to bottom, form a classical Japanese haiku. In the case of \"Turnips,\" it's one from Issa: \"The turnip farmer rose / and with a fresh-pulled turnip ... / pointed to my road.\"\nSo, \"You Bet Your Life\" encodes a Basho haiku in the midst of Groucho Marxisms; the meta-meta \"After Basho\" ponders the challenge of translating Basho's famous frog haiku while also incorporating that haiku.\nWallace is a professor of poetry and co-director of the creative writing program at the University of Wisconsin-Madison. His earlier books include \"For a Limited Time Only\" and \"God Be With the Clown: Humor in American Poetry.\"\n ", "external_links": ["http://www.english.wisc.edu/faculty-wallace.htm", "https://jaimeehills.wordpress.com/", "http://waywiser-press.com/hills.html", "http://english.wisc.edu/wallace/", "http://analytics.apnewsregistry.com/analytics/v2/image.svc/JSI/RWS/jsonline.com/CAI/336384841/E/prod/PC/Basic/AT/A"], "published": "2015-10-23T16:40:00.000+03:00", "crawled": "2015-10-25T02:49:53.808+02:00", "highlightTitle": ""}