{"organizations": [], "uuid": "80ca47d90e9342a5d997b542bfbf23026c1d27b3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/151009105134-malcolm-jamal-warner-2015-large-169.jpg", "site_section": "http://rss.cnn.com/rss/edition_entertainment.rss", "section_title": "CNN.com - Entertainment", "url": "http://edition.cnn.com/2015/10/09/entertainment/malcolm-jamal-warner-cosby-allegations-feat/index.html", "country": "US", "title": "Malcolm-Jamal Warner: 'Cosby Show' is 'tarnished'", "performance_score": 0, "site": "cnn.com", "participants_count": 1, "title_full": "Malcolm-Jamal Warner: 'Cosby Show' is 'tarnished' - CNN.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T01:45:00.000+03:00", "replies_count": 0, "uuid": "80ca47d90e9342a5d997b542bfbf23026c1d27b3"}, "author": "Brandon Griggs", "url": "http://edition.cnn.com/2015/10/09/entertainment/malcolm-jamal-warner-cosby-allegations-feat/index.html", "ord_in_thread": 0, "title": "Malcolm-Jamal Warner: 'Cosby Show' is 'tarnished'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Story highlights Malcolm-Jamal Warner says \"Cosby Show's\" legacy is \"tarnished\" by allegations against star Warner is latest cast member of the hit TV show to weigh in on the ongoing scandal (CNN) Malcolm-Jamal Warner, who played son Theo Huxtable on \"The Cosby Show,\" says the sitcom's legacy has been \"tarnished\" by the torrent of sexual allegations against its star, Bill Cosby.\n\"My biggest concern is when it comes to images of people of color on television and film, no matter what ... negative stereotypes of people of color, we've always had 'The Cosby Show' to hold up against that,\" Warner told The Associated Press in an interview this week.\n\"And the fact that we no longer have that, that's the thing that saddens me the most because in a few generations the Huxtables will have been just a fairy tale.\"\nWarner became the latest cast member of the long-running hit show -- praised by many for its depiction of a wholesome, successful African-American family -- to weigh in on the mushrooming scandal that has dogged Cosby over the past year and forced fans to reconsider his image as an avuncular father figure.\nActor Malcolm-Jamal Warner appears at the Grammys in February. The veteran comedian and actor has been accused of sexual misconduct spanning decades by more than 40 women. In a court deposition 10 years ago, Cosby said he had sexual relationships with at least five women outside his marriage and gave prescription sedatives to women with whom he wanted to have sex.\nRead More Cosby, 78, has never been criminally charged and has vehemently denied wrongdoing. He was tentatively scheduled to give a sworn deposition Friday in a civil suit alleging he sexually assaulted a 15-year-old girl at the Playboy Mansion in 1974.\nNBC's \"Dateline\" was scheduled to air a joint interview Friday with 27 of Cosby's accusers. And just last week three more women came forward to accuse Cosby of sexually inappropriate behavior, including sexual assault, dating back to the 1970s.\nAs fellow entertainers have increasingly denounced Cosby, his \"Cosby Show\" co-stars have expressed a range of more muted responses.\nPhylicia Rashad, Cosby's TV wife, expressed support for him in January , saying the allegations were \"orchestrated\" as part of an effort to keep him off television. Since then she has said little about the scandal.\nBill Cosby as Dr. Cliff Huxtable with his \"Cosby Show\" co-stars, from left: Tempestt Bledsoe, Lisa Bonet, Malcolm-Jamal Warner, Phylicia Rashad, Keshia Knight Pulliam and Sabrina Le Beauf. Keshia Knight Pulliam, who played the youngest Huxtable daughter, defended the show's legacy in an interview published this week.\n\"You can't take back the impact that it's had on generations of kids, and it's continuing to have such a positive impact on them,\" the actress told the Grio. As for the accusations against Cosby, Pulliam said, \"That's just not the man I know.\"\nCosby's other TV daughters, actresses Sabrina Le Beauf, Lisa Bonet and Tempestt Bledsoe, have not commented publicly on the allegations.\nBut actor Joseph C. Phillips, who played Cosby's son-in-law for three seasons on the show, posted an online essay in July headlined, \"Of course Bill Cosby is guilty!\"\n\"As the accusations began to increase, I became increasingly disturbed,\" he wrote. \"I was fairly certain that some of the women were lying through their teeth, but certainly not all of them.\"\nPulliam, the youngest daughter on \"The Cosby Show,\" has defended the program's legacy. In comments in January about the Cosby accusations, Warner expressed cautious support for his former TV dad.\n\"I can't really speak on any of the allegations because obviously, I was not there. The Bill Cosby I know has been great to me and great for a lot of people. What he's done for comedy and television has been legendary and history-making. What he's done for the black community and education has been invaluable. That's the Bill Cosby I know. I can't speak on the other stuff,\" Warner told Billboard .\nAfter \"The Cosby Show\" ended in 1992, Warner has had a successful second career as a director and Grammy-winning musician.\nHe told the AP this week that he has been in touch with Cosby, but he declined to comment on their conversations.\n\"I think the things that we discussed really have to stay private between us,\" said Warner, 45. \"But it's just a bad situation all around -- for him, for his family, the women, their families, the legacy of the show.\"", "external_links": ["http://i2.cdn.turner.com/cnnnext/dam/assets/130710062200-01-cosby-sweater-0710-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/130710062200-01-cosby-sweater-0710-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/151009105134-malcolm-jamal-warner-2015-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/130710062200-01-cosby-sweater-0710-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150826145414-01-keshia-knight-pulliam-now-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/130710062200-01-cosby-sweater-0710-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150826145414-01-keshia-knight-pulliam-now-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/151009105134-malcolm-jamal-warner-2015-exlarge-169.jpg", "http://www.billboard.com/articles/6443836/malcolm-jamal-warner-bill-cosby", "http://i2.cdn.turner.com/cnnnext/dam/assets/150826145414-01-keshia-knight-pulliam-now-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/130710062200-01-cosby-sweater-0710-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/151009105134-malcolm-jamal-warner-2015-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150826145414-01-keshia-knight-pulliam-now-large-169.jpg", "http://bigstory.ap.org/article/a4dc344c8313491cb699833340459cdd/malcolm-jamal-warner-opens-about-cosby-allegations", "http://i2.cdn.turner.com/cnnnext/dam/assets/130710062200-01-cosby-sweater-0710-full-169.jpg", "http://variety.com/2015/tv/news/nbc-dateline-bill-cosby-accusers-1201611307/", "http://i2.cdn.turner.com/cnnnext/dam/assets/150826145414-01-keshia-knight-pulliam-now-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/151009105134-malcolm-jamal-warner-2015-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/151009105134-malcolm-jamal-warner-2015-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/130710062200-01-cosby-sweater-0710-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150826145414-01-keshia-knight-pulliam-now-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150826145414-01-keshia-knight-pulliam-now-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/151009105134-malcolm-jamal-warner-2015-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/151009105134-malcolm-jamal-warner-2015-full-169.jpg"], "published": "2015-10-10T01:45:00.000+03:00", "crawled": "2015-10-09T21:41:41.266+03:00", "highlightTitle": ""}