{"organizations": [], "uuid": "8516856bfccd76e384c686f531c28a1bee87fe48", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mid-day.com", "main_image": "http://images.mid-day.com/images/2015/oct/Rochelle-Rao_l.jpg", "site_section": "http://www.mid-day.com/Resources/midday/rss/entertainment.xml#", "section_title": "entertainment", "url": "http://www.mid-day.com/articles/rochelle-maria-rao-want-to-connect-with-hindi-audience-with-bigg-boss9/16607190", "country": "IN", "title": "Rochelle Maria Rao: Want to connect with Hindi audience with 'Bigg Boss 9'", "performance_score": 0, "site": "mid-day.com", "participants_count": 1, "title_full": "Rochelle Maria Rao: Want to connect with Hindi audience with 'Bigg Boss 9' - Entertainment", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "8516856bfccd76e384c686f531c28a1bee87fe48"}, "author": "IANS", "url": "http://www.mid-day.com/articles/rochelle-maria-rao-want-to-connect-with-hindi-audience-with-bigg-boss9/16607190", "ord_in_thread": 0, "title": "Rochelle Maria Rao: Want to connect with Hindi audience with 'Bigg Boss 9'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Model Rochelle Rao, who has created a steady pitch for herself in the world of cricket as a host, says she wants to 'connect with Hindi audience' through the popular reality TV show 'Bigg Boss Nau'.\n\nRochelle Rao \n“I want to connect with my Hindi audience so I will be focusing on that. The reality show makes you a household name and as an anchor that is the best thing one can hope for,” Rochelle told IANS over phone from Lonavla before entering the 'Bigg Boss' house.\nShe added: “I hope I break into Hindi market as well as and if it leads to fictions shows and movies then it is well and good. I'm not well versed with Hindi language, so my goal is to only speak in Hindi once inside the house”.\nThe former beauty queen, who also participated in action-adventure show “Khatron Ke Khiladi Darr ka Blockbuster” and hosted the sixth season of Indian Premier League, has entered the ninth season of the reality show with 13 other celebrities including Roopal Tyagi, Ankit Gera, Kishwar Merchant, Aman Verma and Prince.\nRochelle's boyfriend Keith Sequeira is also in the show, which is yet again hosted by superstar Salman Khan. With the theme 'double trouble', the season went on air on Sunday on Colors channel.\nRochelle feels it's a good and positive thing to have Keith around in the show.\nThe reality show, an Indian version of international series \"Celebrity Big Brother\", is known for its notorious qualities like fuelling controversies and constant brickbats.\nBut Rochelle is not “bothered about controversies” as she said that she won't get “too involved in them”.\nTalking about getting locked inside a house for three months under constant camera surveillance, Rochelle said she will miss her regular dose of coffee, her cats and loved ones.", "external_links": [], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-14T09:01:09.622+03:00", "highlightTitle": ""}