{"organizations": [], "uuid": "b9a2ff340b111c9ebe829f61d9381b8138038827", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wdef.com", "main_image": "http://www.wdef.com/media/lib/53/d/1/9/d1926b53-dfca-45af-a8b2-2803dadfe8a0/Original.jpg", "site_section": "http://www.wdef.com/rss/3480.rss", "section_title": "WDEF News 12 - Entertainment News", "url": "http://www.wdef.com/entertainment/story/McCarthy-wants-final-nude-Playboy-shoot/4Y2FfeTe-0Cwbv5ri7csvw.cspx?rss=3480", "country": "US", "title": "McCarthy wants final nude Playboy shoot", "performance_score": 0, "site": "wdef.com", "participants_count": 0, "title_full": "McCarthy wants final nude Playboy shoot", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T19:02:00.000+03:00", "replies_count": 0, "uuid": "b9a2ff340b111c9ebe829f61d9381b8138038827"}, "author": "", "url": "http://www.wdef.com/entertainment/story/McCarthy-wants-final-nude-Playboy-shoot/4Y2FfeTe-0Cwbv5ri7csvw.cspx?rss=3480", "ord_in_thread": 0, "title": "McCarthy wants final nude Playboy shoot", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["McCarthy"], "text": "Share Updated: 12:02 pm \nModel-turned-actress Jenny McCarthy is happy to strip off for Playboy magazine one more time for its last ever nude shoot. \nExecutives at the saucy magazine, which launched in 1953, announced this week that naked photographs of models will no longer appear in the publication from March 2016 onwards. \nJenny, who launched her career posing nude for Playboy in 1993, insists the decision is a shame because she always considered the shots to be \"classy\", and she is even willing to bare all for the last nude issue. \n\"There was nothing (in my photoshoot) I felt was too embarrassing, or gross, and nothing that I'm not proud of today so it kind of breaks my heart that it's the end of that era,\" Jenny says during her SiriusXM radio show. \n\"That we have to lose what I would consider very classy nudity in a magazine... In solidarity, I will be wearing my panties at half-mast... and have maybe one more for the road. I would be totally willing just to take it all off one more time, just to say I'll be in the last one.\" \nJenny is also adamant Playboy founder Hugh Hefner did not create a lewd publication, adding, \"He worked really hard on trying to find the girl next door. They weren't the girls that had just got off Monday nights on the poles... Even when I went to Playboy, they went through a huge slew of questions making sure I never did anything like that... Then when I did my test shoot there I had one uni-brow and a giant bush to my knees, and they were like, 'You're in! You're a girl next door!' They really capture that innocence in the women... there was nothing ever skanky about the photos, I never felt like I was posing in a way that would make my mum disown me.\" Copyright WENN.com", "external_links": [], "published": "2015-10-15T19:02:00.000+03:00", "crawled": "2015-10-15T22:03:58.879+03:00", "highlightTitle": ""}