{"organizations": ["Associated Press", "The Canadian Press"], "uuid": "9b2a12cc2bcd76921b6ce04f476618d84f3f398e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.brandonsun.com", "main_image": "http://media.winnipegfreepress.com/images/NYCS101-1019_2015_201703_high.jpg", "site_section": "http://brandonsun.com//rss?path=/entertainment/breaking-news", "section_title": "Entertainment Breaking News", "url": "http://www.brandonsun.com/entertainment/breaking-news/herbie-hancock-put-himself-on-lockdown-to-finish-album-he-started-4-years-ago-334778911.html", "country": "US", "title": "Herbie Hancock put himself on 'lockdown' to finish album he started 4 years ago", "performance_score": 0, "site": "brandonsun.com", "participants_count": 0, "title_full": "Herbie Hancock put himself on 'lockdown' to finish album he started 4 years ago", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T23:29:00.000+03:00", "replies_count": 0, "uuid": "9b2a12cc2bcd76921b6ce04f476618d84f3f398e"}, "author": "", "url": "http://www.brandonsun.com/entertainment/breaking-news/herbie-hancock-put-himself-on-lockdown-to-finish-album-he-started-4-years-ago-334778911.html", "ord_in_thread": 0, "title": "Herbie Hancock put himself on 'lockdown' to finish album he started 4 years ago", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Herbie Hancock", "Leanne Italie"], "text": "The Canadian Press - ONLINE EDITION Herbie Hancock put himself on 'lockdown' to finish album he started 4 years ago By: Leanne Italie, The Associated Press Tuesday, Oct. 20, 2015 at 3:29 PM | Comments: 0 Enlarge Image \nHerbie Hancock attends the Americans for the Arts 2015 National Arts Awards at Cipriani 42nd Street on Monday, Oct. 19, 2015, in New York. (Photo by Charles Sykes/Invision/AP) \nNEW YORK, N.Y. - Jazz great Herbie Hancock has the heart of an artist but the self-imposed lifestyle of a hermit, at least for now. \nHe said Monday night before he picked up an award from the non-profit Americans for the Arts that he needed to make a change to move along the album he's been working on for the last four years. \n\"Because I keep saying yes to everything, I haven't been able to do it. So finally I put myself on lockdown.\" \nHouse arrest for Hancock began at the beginning of October, \"But am I home doing my record? No,\" he laughed. \nWhat else has he been doing? Well, campaigning against nuclear technology, for starters. Hancock has just returned from an energy conference in Mumbai and also has toured a reactor site near Oslo, meeting with politicians and nuclear scientists there. \n\"There's a place for the arts in order to be able to change the hearts and minds of people who are very much misinformed about the safety of nuclear technology,\" he said from the red carpet before collecting the National Arts Award for outstanding contributions to the arts. \nSophia Loren and Lady Gaga were among honorees at a start-studded event that drew arts and entertainment stars who included Tony Bennett, Paul Simon, Jeff Koons and Chuck Close. \nSo, as technology has revolutionized the world, including the music business, exactly what does it mean to be an artist today? \n\"The heart of the artist is still the same,\" Hancock offered. \"We play our music, we create our art, in order to share something about our humanity with other people. It's to encourage people not to be afraid of being outside the box because that's what innovation is about.\" \n___", "external_links": [], "published": "2015-10-20T23:29:00.000+03:00", "crawled": "2015-10-20T23:56:44.688+03:00", "highlightTitle": ""}