{"organizations": [], "uuid": "b84f2f0de4dbe8acad487ff6746765d3c32d7a79", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266353/arts-entertainment-television", "section_title": "Arts &amp; Entertainment: Television - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30169950/saturday-night-live-the-exhibition-celebrates-the-original-episode-of-snl-and-every-40-year-old-born-on-october-11-1975", "country": "US", "title": "Saturday Night Live: The Exhibition Celebrates The Original Episode of SNL And Every 40 year old Born On October 11, 1975", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Saturday Night Live: The Exhibition Celebrates The Original Episode of SNL And Every 40 year old Born On October 11, 1975 - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T14:01:00.000+03:00", "replies_count": 0, "uuid": "b84f2f0de4dbe8acad487ff6746765d3c32d7a79"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30169950/saturday-night-live-the-exhibition-celebrates-the-original-episode-of-snl-and-every-40-year-old-born-on-october-11-1975", "ord_in_thread": 0, "title": "Saturday Night Live: The Exhibition Celebrates The Original Episode of SNL And Every 40 year old Born On October 11, 1975", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The 40th anniversary celebration continues as Saturday Night Live: The Exhibition celebrates the airdate of the very first episode of the iconic TV show by throwing a birthday party for everyone born on October 11, 1975, the night that SNL first exploded into American pop culture. Everyone turning 40 on that date is invited to share their birthday with us at the exhibition and view the original first episode of SNL, hosted by George Carlin.\nNew York, NY (PRWEB) October 02, 2015\nLet’s Celebrate our Birthdays Together at a 40th Birthday Party Bash!\nThe 40th anniversary celebration continues. Saturday Night Live: The Exhibition will celebrate the airdate of the very first episode of the iconic TV show by throwing a birthday party for everyone born on October 11, 1975, the night that SNL first exploded into American pop culture. Everyone turning 40 on that date is invited to share their birthday with us at the exhibition and view the original first episode of SNL, hosted by George Carlin.\nThose who can show a valid ID that their birthday is October 11, 1975 will receive one free ticket to Saturday Night Live: The Exhibition to explore the four decade evolution of the iconic comedy show. All those turning 40 will be celebrated by the exhibition and part of a group photo at 11:35 a.m. at the exhibit’s recreation of the very first “home base” stage to commemorate the special occasion.\n“We are so excited to be part of SNL’s 40th anniversary and wanted to recognize the milestone in a unique way” said Mark Lach, Creative Director for Saturday Night Live: The Exhibition. “To be able share the celebration with others who actually turn 40 on that date is going to make this a very special event.”\nSaturday Night Live: The Exhibition at Premier Exhibitions 5th Avenue (417 5th Avenue, NYC) is an immersive, interactive retrospective about the 40 year history of the groundbreaking show. In addition to a recreation of the original “home base” set, the exhibition features iconic costumes, props and other one-of-a-kind artifacts. For tickets, location, and hours, please visit http://www.snltheexhibition.com .\n###\nAbout Saturday Night Live: The Exhibition\nSaturday Night Live: The Exhibition takes visitors behind the scenes to experience a week in the life of the cast and crew of the late night comedy sensation and pop cultural phenomenon that has transformed American television. Become immersed in the fast-paced creative processes and see how ideas become reality in just days. Interact with sets, original props, and costumes – take selfies on the Jeopardy set, rock out on the Wayne’s World couch, and deliver the ‘news’ from behind the Weekend Update desk. Visit us at http://www.snltheexhibition.com and follow us on Facebook, on Twitter and on Instagram.\nAbout Premier Exhibitions, Inc. -- Premier Exhibitions, Inc. located in Atlanta, Georgia, is a foremost presenter of museum quality exhibitions throughout the world. Premier is a recognized leader in developing and displaying unique exhibitions for education and entertainment including Titanic: The Artifact Exhibition, BODIES...The Exhibition, Tutankhamun: The Golden King and the Great Pharaohs, Pompeii The Exhibition, Extreme Dinosaurs and Real Pirates in partnership with National Geographic as well as Saturday Night Live: The Exhibition. The success of Premier Exhibitions, Inc. lies in its ability to produce, manage, and market exhibitions. Additional information about Premier Exhibitions, Inc. is available at the Company's web site http://www.PremierExhibitions.com .\n //www.prweb.com/releases/2015SNLcelebrates40thBday/10/prweb12998788.htm\n ", "external_links": ["http://www.prweb.com/releases/2015SNLcelebrates40thBday/10/prweb12998788.htm"], "published": "2015-10-02T14:01:00.000+03:00", "crawled": "2015-10-02T13:14:57.458+03:00", "highlightTitle": ""}