{"organizations": [], "uuid": "48121c4dd2dc4e924f8c6e0845dbf62dae8befe8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pr.com", "main_image": "", "site_section": "http://www.pr.com/news-by-category/8", "section_title": "Arts &amp; Entertainment: Music Press Releases and News - PR.com", "url": "http://www.pr.com/press-release/636238", "country": "US", "title": "LymeBuddies Proudly Present the 5th Annual Lyme-Aid Music Festival  a Two-Day, Musical Extravaganza", "performance_score": 0, "site": "pr.com", "participants_count": 1, "title_full": "LymeBuddies Proudly Present the 5th Annual Lyme-Aid Music Festival  a Two-Day, Musical Extravaganza - PR.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-11T03:00:00.000+03:00", "replies_count": 0, "uuid": "48121c4dd2dc4e924f8c6e0845dbf62dae8befe8"}, "author": "PR.com", "url": "http://www.pr.com/press-release/636238", "ord_in_thread": 0, "title": "LymeBuddies Proudly Present the 5th Annual Lyme-Aid Music Festival  a Two-Day, Musical Extravaganza", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LymeBuddies Proudly Present the 5th Annual Lyme-Aid Music Festival  a Two-Day, Musical Extravaganza\nPortland, ME, September 11, 2015 --( PR.com )-- To celebrate the fifth anniversary of Lyme-Aid Music Festival, and a desire from more local musicians to take part in the event, LymeBuddies announce that for this year, the Lyme-Aid Music Festival will be expanded to a two-day event.\nSaturday, September 12, 2015, “Lemon-Aid” will be dedicated to Kinzie, a local 6-year old who is battling neuroblastoma, a rare form of childhood cancer. Sunday, September 13, 2015, \"Lyme-Aid\" will focus on raising awareness about Lyme Disease. There will be information for both causes at each event.\nLymeBuddies (www.lymebuddies.com), the brainchild of Amie Levasseur and Angela Coulombe, two “moms from Maine,” offers support to those affected by Lyme disease and holds events to help raise awareness about the disease.\nLymeBuddies co-founder Amie Levasseur, is the mastermind behind this two-day music event and a friend of Kinzie’s. \"Sometimes life hands us a 'lemon' in the form of an illness, loss, or some other sort of hardship. Neuroblastoma is a 'lemon.' Kinzie is currently receiving chemotherapy at Barbara Bush Children’s Hospital. Knowing how difficult being handed such a lemon can be, LymeBuddies want to dedicate Saturday’s activities to raising funds to aid this courageous young lady and her family as she battles her way back to health. At the same time many among us have been handed a 'lime'... Lyme Disease is the fastest growing infectious disease in the country. It, and other tick-borne illnesses, can be debilitating, and have been frequently misdiagnosed, leading to unnecessary suffering. The need to raise public awareness and support is tremendous.\"\n“Over the years, Amie has done an amazing job connecting with local musicians who want to be involved in this event,” said Angela Coulombe, of LymeBuddies. “This year, so many musicians wanted to give of their time to perform that we didn’t want to say no or turn anyone away. Being extremely moved by Kinzie’s plight sealed the deal. Holding a two-day, family-orientated event, that not only focuses on raising awareness about Lyme Disease, but will also help out a family in need, makes the most sense to us.”\nThis year’s lineup includes:\nSaturday\nAmy Johnson\nCharlotte Levasseur\nJeff Kilton\nBrazen Cane\nDoug Morgan\nBrian Patricks\nRob Duquette\nSruli & Lisa\nSunday\nJustin Lindsay & Emma Ivy – “Toast”\nCharlotte Levasseur\nOctober Road\nThe Grumps\nThe Blues Mafia\nThe Tom Towler Band\nRumor Has It\nRipple Effect\nThere will also be vendors, kid’s activities, food, carriage rides, apple picking, an artisan/farmers market and a tenting option for those who want to camp out overnight on Saturday.\nCome for one or both days, and remember to bring your lawn chairs and picnic to enjoy great local Maine talent while supporting Kinzie and helping to raise awareness of Lyme Disease !\nLyme-Aid Details:\nThompson's Orchard\nSaturday - Sunday, September 12-13, 2015\n11am – 6pm,\n276 Gloucester Hill Rd,\nNew Gloucester, ME 04260\nSuggested donation $10 for adults and 5 for kids and students.\nAbout LymeBuddies: LymeBuddies was started by two Maine Moms who have both struggled with advanced Lyme Disease. We seek to provide information and support for Lyme Disease and other tick borne illnesses. Please visit www.lymebuddies.com for more info.\nContact: Amie Levasseur / Angela Coulombe LymeBuddies\n1-207-272-2091\ninfo@lymebuddies.com\nwww.lymebuddies.com\nwww.facebook.com/lymeaidmusicfestival", "external_links": [], "published": "2015-09-11T03:00:00.000+03:00", "crawled": "2015-10-01T07:56:23.225+03:00", "highlightTitle": ""}