{"organizations": [], "uuid": "f3c3c346695eb66049e97401f63fc65dba7268e9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "ezinearticles.com", "main_image": "//ezinearticles.com/members/mem_pics/John-Powell_854023.jpg", "site_section": "http://feeds.ezinearticles.com/category/Arts-and-Entertainment:Short-Fiction.xml", "section_title": "Arts and Entertainment:Short Fiction Articles from EzineArticles.com", "url": "http://EzineArticles.com/?Succeeding-With-the-Help-of-His-Estranged-Wife&id=9205355", "country": "US", "title": "Succeeding With the Help of His Estranged Wife", "performance_score": 0, "site": "ezinearticles.com", "participants_count": 0, "title_full": "Succeeding With the Help of His Estranged Wife", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T14:57:00.000+03:00", "replies_count": 0, "uuid": "f3c3c346695eb66049e97401f63fc65dba7268e9"}, "author": "", "url": "http://EzineArticles.com/?Succeeding-With-the-Help-of-His-Estranged-Wife&id=9205355", "ord_in_thread": 0, "title": "Succeeding With the Help of His Estranged Wife", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["John Powell"], "text": "Succeeding With the Help of His Estranged Wife By John Powell   22, 2015 \nKwame Mainu's mission in Kumasi had been greatly helped by his now not so estranged wife, Comfort. Together they had sought the intervention of the Asantehene, King of Ashanti, in persuading the remnants of a drugs cartel to stop their illegal activities. This meant that in future, junior academics from Kumasi coming to Warwick University on short assignments would no longer be approached by strangers offering money in exchange for carrying parcels to London. Immediately on his return to Coventry, Kwame was asked to report to his boss, Professor Tom Arthur. \n'I hope what you told me at the airport is the whole truth,' Tom said as soon as they were seated. 'I've had no end of trouble from Professor Thomas and the other doubters since you left. The den of thieves has become the nest of vipers or worst in some of the rhetoric that's been thrown at me. They've set up a review meeting of the management committee in two days' time, and you are ordered to attend.' Kwame had not expected the situation to become so serious but he realised that he should not be surprised. As he had pointed out in Kumasi, of five visitors to date, two were suspected of having carried drugs, one had been arrested and one had overstayed her visa. These were the blunt statistics the professors had seen. Who could blame them for thinking that the university's reputation was in danger of being seriously damaged? \nKwame hurried to tell Tom what had transpired in Kumasi, explaining that the Ghanaian command and control centre had been disbanded and no more university visitors would be approached and asked to carry drugs to the UK. He realised that not all the details about the drugs cartel and its demise could be given to the management committee and he asked Tom's view on how best to present their case. \n'You could say that the person within the university who was contacting the visitors has been identified and prevented from repeating his actions.' \n'Don't you think that sounds rather weak? They will ask for more details.' \n'Then say that you took the matter to the Asatehene and he used his traditional authority to have the man arrested.' \n'That is near enough to the truth to be convincing.' \n'That's a big relief, Kwame,' Tom said, 'You did really well to bring about this outcome. The master sleuth must be very pleased with you.' \n'I've not reported to Leon directly but I guess he's heard most of it from Auntie Rose and Tam Gordon.' \n'Were they both in Kumasi? - You're like a magnet dragging iron filings!' \n'That's what it felt like most of the time.' \n'Did they help much?' \n'Not much, it was Comfort who helped me more.' \n'Rekindling old flames, eh?' \n'I'm trying not to get burned.' \nMy novels set in Ghana: The Colonial Gentleman's Son and Return to the Garden City, as well as my children's book: Saint George: Rusty Knight and Monster Tamer, together with many pictures of Ghana are featured on the website http://www.ghanabooksjwp.com and the books are available on amazon at http://www.amazon.co.uk/Return-Garden-City-John-Powell/dp/184624949X/ref=sr_1_1?ie=UTF8&qid=1442856892&sr=8-1&keywords=Return+to+the+Garden+City and other booksellers.", "external_links": [], "published": "2015-10-22T14:57:00.000+03:00", "crawled": "2015-10-23T08:10:02.730+03:00", "highlightTitle": ""}