{"organizations": ["LAPD"], "uuid": "943ae5f9b4f11188c96f1a862e4719eb95639771", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.jsonline.com", "main_image": "http://media.jrn.com/images/taplogo_2048.jpg", "site_section": "http://www.jsonline.com/rss?c=y&path=%2Fentertainment%2Fnational&atom=y", "section_title": "JSOnline.com National Entertainment", "url": "http://www.jsonline.com/entertainment/national/main-suspect-arrested-in-video-of-gun-flashed-near-police-mjsurnpublicidaporg05ca56183d8a4292992a616-331173221.html", "country": "US", "title": "Attorney: LAPD officers feared ambush after rap video", "performance_score": 0, "site": "jsonline.com", "participants_count": 0, "title_full": "Attorney: LAPD officers feared ambush after rap video", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:45:00.000+03:00", "replies_count": 0, "uuid": "943ae5f9b4f11188c96f1a862e4719eb95639771"}, "author": "", "url": "http://www.jsonline.com/entertainment/national/main-suspect-arrested-in-video-of-gun-flashed-near-police-mjsurnpublicidaporg05ca56183d8a4292992a616-331173221.html", "ord_in_thread": 0, "title": "Attorney: LAPD officers feared ambush after rap video", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Amanda Lee Myers"], "text": "Attorney: LAPD officers feared ambush after rap video By Amanda Lee Myers,   Updated: 7:43 p.m. (0) Comments \nLOS ANGELES (AP) - Two Los Angeles police officers who shot and killed a man after a beer bottle shattered their patrol car's rear window thought they were under attack because of an online video that turned out to be a publicity stunt, the lawmen's attorneys said Wednesday. \nAttorney Gary Fullerton said the officers involved in Saturday's shooting had seen the video, which shows someone flashing a gun inside a parked car while filming an LAPD officer from behind. The officers also attended at least two roll-call meetings where the video was discussed, including on the day of the shooting, Fullerton told The Los Angeles Times. \nThough police at first considered the video a serious threat, an investigation later revealed it was made by a 1990s rap group looking to ignite a comeback, police said. \nThe primary suspect in the video was arrested Wednesday, though no details were immediately available, Officer Matthew Ludwig said. Another man was arrested over the weekend on a property-crime warrant in connection with the video. \nPolice haven't named the suspects or the name of their rap group. \n\"Both officers were very focused on that (the video),\" Fullerton told the Times. \"When the window got blown out, they looked at each other and said, 'We're being shot at.' \" \nNo gun was found at the scene. \nPolice Chief Charlie Beck said Tuesday that he couldn't say whether the video may have had an effect on the officers involved in the shooting. \nBut \"anybody that has any empathy whatsoever can certainly see where this set of circumstances would cause great concern,\" Beck said. \"You're seated in your car, you're aware that there are threats outstanding against police officers, and the rear window explodes.\" \nBeck said he will demand that the officers \"reasonably articulate why they were afraid for their lives.\" \n\"There will be considerable investigation, and we will make judgments upon whether or not they were justifiable in their use of force,\" he said. \"That is a tough standard to meet.\" \nAfter police first saw the video last week, the threat appeared serious enough that one-person police cars were restricted over the weekend, Beck said. \nThough police are accustomed to threats, it's unusual to restrict one-person patrols, a department spokesman said. \n\"To get something this specific with the video attached, I think it's unusual, and to make the move to put the officers in two-person cars exclusively, that demonstrates how serious we took this threat,\" Cmdr. Andrew Smith said. \nThe brief, soundless video, believed to be taken early last month, was posted to Instagram and widely circulated on Twitter last week. It's shot from inside a car parked behind a police cruiser in downtown Los Angeles. It shows the police car, then moves to the person's lap and shows the gun, which the person then hides under a bag or piece of clothing. It then moves back to the police car, where it shows a uniformed officer get out and walk away. \nBeck said \"it's pretty obvious\" the gun was loaded because rounds were visible in the chamber. © 2015 , Journal Sentinel Inc. All rights reserved.", "external_links": [], "published": "2015-10-08T03:45:00.000+03:00", "crawled": "2015-10-08T03:55:29.138+03:00", "highlightTitle": ""}