{"organizations": [], "uuid": "db8f7f3989d4cb6b2203cf5b200620f97322d5db", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nydailynews.com", "main_image": "http://assets.nydailynews.com/polopoly_fs/1.2381933!/img/httpImage/image.jpg_gen/derivatives/landscape_1200/vkaplan4f-2-web.jpg", "site_section": "http://www.nydailynews.com/entertainment/index.html", "section_title": "Entertainment News &amp; Reviews - NY Daily News", "url": "http://www.nydailynews.com/entertainment/tv/robert-redford-truth-article-1.2381935", "country": "US", "title": "Robert Redford's `Truth' is anything but...", "performance_score": 0, "site": "nydailynews.com", "participants_count": 1, "title_full": "Robert Redford's `Truth' is anything but... - NY Daily News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "db8f7f3989d4cb6b2203cf5b200620f97322d5db"}, "author": "NEW YORK DAILY NEWS", "url": "http://www.nydailynews.com/entertainment/tv/robert-redford-truth-article-1.2381935", "ord_in_thread": 0, "title": "Robert Redford's `Truth' is anything but...", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "PETER MORGAN/REUTERS Dan Rather's final days at CBS News are painfully reinacted in the film \"Truth\" For a movie that calls itself “Truth,” Robert Redford’s new film sure plays fast and loose with some of the facts.\n“Truth” is the new film starring Redford and Cate Blanchett. There’s also a vastly underused collection of A-listers, including Topher Grace, Elisabeth Moss and Dennis Quaid. They help tell the saga of Rather’s final days at CBS News. That Redford doesn't even try to portray Rather with any degree of accuracy is the least of the film's problems.\nRather famously broadcast a Sept. 8, 2004 “60 Minutes” report alleging that President George W. Bush relied on privilege and family connections to avoid fighting in the Vietnam War. The flawed report relied on what are now generally considered to be forged memos from 1972 — from then-Lt. Bush’s National Guard squad commander.\nThe CBS News report ended Rather’s incredible, decades-long journalism career with CBS. Mary Mapes, who produced the piece and was one of the most celebrated news producers of her generation, has not worked in the industry since the debacle.\nBut “Memogate” remains a curious subject to try and carve into a Hollywood blockbuster. This “Truth” comes off more like a passion project for its stars, especially Redford. The film could have been an honest exploration of the most humiliating chapter of history at CBS News — but it’s not.\n“Truth” opens the Hamptons International Film Festival on Oct. 8 and arrives in theater on Oct. 16. But it arrives with its biggest problem, which is being based on Mapes’ 2005 book, “Truth and Duty: The Press, The President And The Privilege of Power.” Her account of the scandal seems one-sided.\nIt’s not as if Mapes doesn’t know how to tell a balanced story. As a producer, she was among the most respected investigators in network news. Just prior to the “Memogate” events, she and the New Yorker were credited with breaking the Abu Ghraib torture and prisoner abuse scandal.\nBut her perspective in “Truth” makes it seem like she has an ax to grind with CBS. In her version of the tale, Mapes, Rather and her team of investigators are elevated into journalistic martyrs.\nSony Pictures Classics Cate Blanchett as CBS News producer Mary Mapes and Robert Redford as Dan Rather in \"Truth\" But in reality they screwed up. They were snookered by a collection of false documents and should have known better. They used bad evidence during an election year to try and convince millions of potential voters that the man running for a second term in the White House was a Vietnam shirker.\nMaybe he was. But with so much at stake, seasoned professionals like Mapes and Rather knew better and should have been more careful.\nThey so badly mishandled the situation that numerous witnesses who could poke holes in their reporting suddenly became available to others — especially rival news outlets like ABC, NBC and USA Today.\nMuch of that is glossed over or missing in the movie, which hurts credibility.\nWith Mapes and Rather portrayed as martyrs, the film becomes the predictable. CBS executives coldly turn on Mapes and her team. Indeed that mostly happened, but in the movie it’s all part of a blatant attempt to show corporate greed crushing earnest journalism.\nThe truth is that it was far more complicated than that.\nIn the movie, a sneering panel of conservative lawyers, hired by CBS, investigate the segment’s reporting. This predictably leads to a preachy monologue by Mapes (Blanchett) about seeking the truth.\nDAVID J. PHILLIP/AP Mary Mapes was a producer at CBS News until she was fired in 2004 for her role in an faulty \"60 Minutes\" report. In reality, while there was a panel of conservative lawyers hired to investigate the incident, there was also much hand-wringing in the halls of CBS News as the scandal unfolded. Many seasoned journalists and executives working at the network were at a loss to explain how Mapes and Rather had ignored such obvious red flags.\nSome have suggested that had Rather immediately accepted the blame for the incident, many of those who lost their jobs would still be working at CBS. Instead, he extended his reign as the anchor of “CBS Evening News” to 24 years until March 2005, and left the network more than a year later.\nTo this day, more than a decade after the scandal, conservative pundits still argue that nothing but a fanatical drive to bring down Bush could have led Mapes and others at CBS to embrace the faulty evidence.\nCBS’ internal investigation did not discover any validity to those claims, but did find that Mapes and Rather failed to follow basic journalistic principles in the preparation and reporting of the segment.\nThe documents seemed too good to be true, and that should have been the biggest warning of all. Because in reality, such evidence almost never arrives arranged in such explicit detail.\nMapes and Rather knew better — and the makers of “Truth” should have too.", "external_links": [], "published": "2015-10-02T03:00:00.000+03:00", "crawled": "2015-10-02T00:06:19.304+03:00", "highlightTitle": ""}