{"organizations": [], "uuid": "c4066417b07515d9283337a6aeaa92350ca493ae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattletimes.com", "main_image": "http://static.seattletimes.com/wp-content/uploads/2015/10/1ea9adbe-71c8-11e5-a09b-c7989da14a88-1200x630.jpg", "site_section": "http://seattletimes.com/rss/artsentertainment.xml", "section_title": "The Seattle Times » Sections » Entertainment", "url": "http://www.seattletimes.com/entertainment/music/special-challenges-in-a-family-band-says-echosmiths-sydney-sierota-concert-preview/?utm_source=RSS&utm_medium=Referral&utm_campaign=RSS_entertainment", "country": "US", "title": "Special challenges in a family band, says Echosmith’s Sydney Sierota | Concert preview", "performance_score": 0, "site": "seattletimes.com", "participants_count": 1, "title_full": "Special challenges in a family band, says Echosmith’s Sydney Sierota | Concert preview | The Seattle Times", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T10:00:00.000+03:00", "replies_count": 0, "uuid": "b8a23932fe62a3ea42f33bf3215d2677871e4fd4"}, "author": "Gene Stout", "url": "http://www.seattletimes.com/entertainment/music/special-challenges-in-a-family-band-says-echosmiths-sydney-sierota-concert-preview/", "ord_in_thread": 0, "title": "Special challenges in a family band, says Echosmith’s Sydney Sierota | Concert preview", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Echosmith lead singer Sydney Sierota was only 2 years old when she sang for the first time in church.\n“I don’t even remember it,” the 18-year-old said with a laugh this week from Atlanta. \nThe sibling indie pop-rock group is known for such recent hits as the angst-filled back-to-school anthem “Cool Kids,” the sunshiny “Bright” and the bouncy, optimistic “Let’s Love” from the band’s 2013 debut album, “Talking Dreams,” on Warner Bros. Records. Sydney Sierota’s voice is alternately poppy and effervescent or dreamy and wistful. “Cool Kids” was Warner’s fifth-highest-selling digital song of 2014, with 1.3 million downloads.\nConcert preview Twenty One Pilots, Echosmith, Finish Ticket 7:30 p.m. Thursday, Oct. 22, at the Paramount Theatre, 911 Pine St., Seattle; sold out (877-784-4849 or stgpresents.org ).\nIt was a “crazy busy” summer for the band, which performed a lot of festivals, among them Governors Ball and Firefly, and did two surprise performances of “Cool Kids” as part of Taylor Swift’s 1989 tour.\n  On Thursday (Oct. 22), Echosmith will perform with Finish Ticket and headliner Twenty One Pilots (known for its hit album “Blurryface”) at the Paramount Theatre. It’s Echosmith’s biggest trek to date, with the exception of the Vans Warped Tour.\nBand members Sydney, Jamie, Noah and Graham Sierota range in age from 16 to 22. It’s truly a family affair, with the siblings’ dad, Jeffery Davis, acting as manager.\nEncouraged by their music-loving parents, Sydney and her siblings began performing together as kids.\n“It was something that came naturally,” she said.\nBeing in a family group has its advantages. “You learn to just get along, and you’re also OK with all the little quirks that everyone has,” she said.\n“If someone’s chewing with their mouth open, you can say, ‘Hey, stop doing that, please.’ There are times when we get sick of each other, but generally we get along well.”\nEchosmith, which will begin work on a new album next winter, first performed with Twenty One Pilots several years ago.\n“We’ve both come a long way since then and we’ve stayed in touch,” she said.\nThis month, Echosmith will be working with State Farm Insurance to raise awareness about National Teen Driver Safety Week Oct. 18-24. The goal is to help reduce the number of teen deaths due to distracted driving, driving under the influence, excessive speed, not wearing seat belts and other hazards.\n“It’s really a prime thing for us to be involved with because we represent the demographics they’re trying to reach,” Sierota said.\nThe singer has come a long way since her first performance as a child.\n“I feel the most confident I’ve ever felt on stage during this tour,” she said. “It’s the band’s job to grow. And we definitely have grown in the last three years.”\nGene Stout: gene@genestout.com", "external_links": [], "published": "2015-10-16T10:00:00.000+03:00", "crawled": "2015-10-17T00:34:09.178+03:00", "highlightTitle": ""}