{"organizations": [], "uuid": "a9e2ef2d46fbe328fb5a177e42b7aa68a6a914d9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.aceshowbiz.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Aceshowbizcom-EntertainmentNews", "section_title": "Aceshowbiz.com - Entertainment News", "url": "http://www.aceshowbiz.com/news/view/00090248.html", "country": "US", "title": "'Zootopia' Photos Feature New Major Characters", "performance_score": 0, "site": "aceshowbiz.com", "participants_count": 1, "title_full": "'Zootopia' Photos Feature New Major Characters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T11:11:00.000+02:00", "replies_count": 0, "uuid": "a9e2ef2d46fbe328fb5a177e42b7aa68a6a914d9"}, "author": "AceShowbiz.com", "url": "http://www.aceshowbiz.com/news/view/00090248.html", "ord_in_thread": 0, "title": "'Zootopia' Photos Feature New Major Characters", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments Walt Disney Animation Studios releases some new photos which feature the movie's new characters while also announcing the rest of the voice cast. \nWalt Disney Animation Studios has released some photos of its upcoming animated feature \" Zootopia \". The images offer a look at some new characters such as a cape buffalo police Chief Bogo, Mayor Lionheart and other animal characters who reside in the fictional animal city. One of the photos shows Lionheart giving speech in podium while another one features Bogo in a rage. Besides releasing the new pictures, Disney announces the other voice cast members who will join previously-announced actors Jason Bateman , Ginnifer Goodwin and Shakira . Idris Elba voices Bogo, head of the Zootopian Police Department, Octavia Spencer lends her voice for Mrs. Otterton, an otter struggling to find his missing husband, J.K. Simmons is on board to voice Lionhearted, Tommy Chong voices Yax the Yak, \"a most enlightened, laid-back bovine,\" and Nate Torrence is Benjamin Clawhauser. Other voice cast members are Jenny Slate , who voices Assistant Mayor Bellwether, \"a sweet sheep with a little voice and a lot of wool,\" Alan Tudyk , who voices Duke Weaselton, \"a small-time weasel crook with a big-time mouth,\" and Raymond Persi, who voices Flash, \"the fastest sloth working at Zootopia's DMV.\" There are also Bonny Hunt and Don Lake, who are the voices of Judy Hopps' mother and father Bonnie and Stu, \"a carrot farmer couple from Bunnyburrow.\" Directed by Byron Howard (\" Tangled \"), \"Zootopia\" centers on two main characters, Wilde (Bateman) and Hopps (Goodwin), who don't get along at first but must work together when Wilde needs Hopp's help getting out of a jam as she's trying to crack a big case. The animated comedy is scheduled for a release in the U.S. on March 4, 2016. \n© AceShowbiz.com", "external_links": [], "published": "2015-10-26T11:11:00.000+02:00", "crawled": "2015-10-26T22:00:57.253+02:00", "highlightTitle": ""}