{"organizations": [], "uuid": "c9a7db42752854f14a985a253b1f14c35601a0d7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.india.com", "main_image": "http://s3.india.com/wp-content/uploads/2015/10/c8b6bfca99141bef8ca735e7f3ded355.jpg", "site_section": "http://www.india.com/feed/", "section_title": "India | Latest India News | Get Free India.com Email | Live Cricket and Entertainment News at India.Com", "url": "http://www.india.com/news/india/shatrughan-sinha-embarrasses-bjp-backs-mohan-bhagwats-reservation-call-640754/", "country": "US", "title": "Shatrughan Sinha embarrasses BJP, backs Mohan Bhagwat’s reservation call", "performance_score": 0, "site": "india.com", "participants_count": 1, "title_full": "Shatrughan Sinha embarrasses BJP, backs Mohan Bhagwat’s reservation call", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T10:57:00.000+03:00", "replies_count": 0, "uuid": "c9a7db42752854f14a985a253b1f14c35601a0d7"}, "author": "Wires English | ANI", "url": "http://www.india.com/news/india/shatrughan-sinha-embarrasses-bjp-backs-mohan-bhagwats-reservation-call-640754/", "ord_in_thread": 0, "title": "Shatrughan Sinha embarrasses BJP, backs Mohan Bhagwat’s reservation call", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Shatrughan Sinha embarrasses BJP, backs Mohan Bhagwat’s reservation call By ANI on October 18, 2015 at 1:27 PM Comments New Delhi, Oct. 18: Continuing his rebellious streak, veteran actor and Bharatiya Janata Party (BJP) leader Shatrughan Sinha on Sunday backed RSS chief Mohan Bhagwat’s call for a panel to “decide which categories require reservation and for how long”. (Read: Geeta, deaf-mute girl stranded in Pakistan, denies she is married ) “Sri Mohan Bhagwat’s views on review of reservations should be taken seriously. We hold the views of the RSS supremo in high esteem,” Sinha tweeted. He added that he was ‘sad and disheartened’ by the attempts to ridicule and make fun of this ‘highly learned, father figure of RSS/BJP’. Bhagwat had last month pitched for a review of the reservation policy, contending it has been used for political ends and suggesting setting up of an ‘apolitical’ committee to examine who needs the facility and for how long. ”Interest groups are formed because we have certain aspirations in democracy. At the same time, we should remember that through interest groups we should not strive to address those aspirations at the cost of others,” Bhagwat told Sangh mouthpiece ‘Organiser’ and ‘Panchjanya’ in an interview. “We should have integral approach of welfare for all. It is sensible to realize that my interest lies in larger national interest. Government also has to be sensitive to these issues that there should not be any agitation for them,” he added. However, the BJP, in a quick move asserted that it ‘very clearly does not support any reconsideration of the existing constitutional provision of reservation for the SC, ST, OBC and Extremely Backward Classes’. Bhagwat’s timing could not have been at a more inopportune time for the BJP as the Bihar polls were around the corner and the OBC factor continues to be the biggest challenge in the elections. \n  1:45 PM Topics:", "external_links": [], "published": "2015-10-18T10:57:00.000+03:00", "crawled": "2015-10-18T12:14:00.759+03:00", "highlightTitle": ""}