{"organizations": [], "uuid": "28ffe96612eb7a493c2dd47ea32005fa54b5db99", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.winnipegsun.com", "main_image": "http://storage.winnipegsun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297760030008_LARGE_BOX.jpg?quality=80&stmp=1445191549505&size=100x", "site_section": "http://www.winnipegsun.com/entertainment/rss.xml", "section_title": "Top Entertainment stories", "url": "http://www.winnipegsun.com/2015/10/18/goosebumps-tops-the-martian-at-box-office-while-crimson-peak-falls-flat", "country": "CA", "title": "'Goosebumps' tops 'The Martian,' at box office while 'Crimson Peak' falls flat", "performance_score": 0, "site": "winnipegsun.com", "participants_count": 0, "title_full": "'Goosebumps' tops 'The Martian,' at box office while 'Crimson Peak' falls flat", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T21:03:00.000+03:00", "replies_count": 0, "uuid": "28ffe96612eb7a493c2dd47ea32005fa54b5db99"}, "author": "", "url": "http://www.winnipegsun.com/2015/10/18/goosebumps-tops-the-martian-at-box-office-while-crimson-peak-falls-flat", "ord_in_thread": 0, "title": "'Goosebumps' tops 'The Martian,' at box office while 'Crimson Peak' falls flat", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Box Office \nLOS ANGELES - \"Goosebumps\" rode a wave of Clinton era nostalgia to the top of the box office charts, as the adaptation of the popular children's book series earned $23.5 million in its opening weekend. \nThat just edged out Fox's \"The Martian,\" the science-fiction smash that was trying to be the number one picture for a third week in a row. The story of a stranded astronaut added $21.5 million to its $143.8 million haul. \nIt was a crowded time at the multiplexes, as four new releases faced off for audiences' attention. That may have cannibalized grosses, analysts say. \n\"It's like a literal traffic jam on the freeway and everyone is just jockeying for position,\" said Paul Dergarabedian, senior media analyst at Rentrak. \"Every weekend it seems like four new movies are opening and there's a cumulative effect of adding movie after movie. The box office pie can only be split so many ways.\" \nAside from \"Goosebumps,\" the weekend's best performer was \"Bridge of Spies,\" the Steven Spielberg Cold War drama that capitalized on good reviews and Oscar buzz by nabbing $15.4 million. Disney is distributing the true story of an attorney (Tom Hanks) who defends a Russian spy (Mark Rylance). DreamWorks produced the $40 million production. Its look at prisoner rights resonates in the post-Guantanamo age and positions \"Bridge of Spies\" to remain part of the conversation in coming weeks, Disney executives argued. \n\"It's overwhelmingly applicable to today,\" said Dave Hollis, Walt Disney Studios' executive vice president of theatrical distribution. \"But that's Steven Spielberg. He's able to do that with almost every single story.\" \n\"Crimson Peak\" fared less well. The Gothic Romance from Guillermo del Toro proved too niche for mainstream crowds, falling flat with a $12.6 million debut. The story about a virginal bride (Mia Wasikowska) who moves into a haunted mansion cost $55 million to bring to the screen. Legendary Pictures fully financed the picture and Universal is distributing the film. The studio believes that \"Crimson Peak\" struggled to break out in part because of the wealth of fare such as \"Bridge of Spies\" and \"Sicario\" aimed at older crowds. It also was more of a romance than a straight scare machine, which may have disappointed ticket buyers looking for a more traditional horror film. \n\"This is a challenging play time for adult-oriented films,\" said Nick Carpou, Universal's domestic distribution chief. \"The film is definitely a throwback to an old fashioned way of creating atmosphere and layering tension. It's visually stunning and genuinely creepy.\" \n\"Goosebumps\" takes its names from the spooky children's books by R.L. Stine, but provided a meta-twist by having the author play a role in the movie. Jack Black, who played Stine, injected some humor into the proceedings, and a PG-rating made the film family friendly. Sony Pictures backed the $58 million production. \n\"Our marketing was able to convey just how fun this movie is,\" said Rory Bruer, Sony's distribution chief. \"This is an all-audience movie. It works for teens, as well as adults and younger kids.\" \nThat left faith-based drama \"Woodlawn,\" the story of a high school football team that makes a playoff run after finding religion, as the weekend's other major wide release. It debuted across 1,553 to a stronger than expected $4.1 million. Pure Flix, the film's distributor, declined to provide a budget. \nIn limited release, A24's abduction drama \"Room\" leveraged awards chatter into a very strong start, earning $120,000 from four screens for a per-screen average of $30,000. \"Truth,\" another Oscar hopeful, was less successful. Sony Pictures Classics bowed the story of \"60 Minutes'\" controversial report on George W. Bush's National Guard service across six screens where it brought in $76,646, for a per screen average of $12,774. \n\"People are responding to it like it's a journalistic thriller,\" said Michael Barker, Sony Pictures Classics co-president. \"We believe this one of our movies that's going to have a really long run and growth potential heading into awards season.\" \nAnd \"Beasts of No Nation,\" Cary Fukunaga's drama about child soldiers in Africa, made headlines when Netflix bested all bidders by offering $12 million for rights to the movie. It debuted simultaneously on the company's streaming service and in 31 theaters, but barely registered at the box office, eking out $50,699 for a per-screen average of $1,635. It's difficult to call the picture a failure, however, given that Netflix is more interested in offering up something exclusive to its subscribers that differentiates itself from other subscription video services. A theatrical release is being launched primarily to qualify \"Beasts\" for awards. \n\"We want to make sure we're where people are,\" said Stephen Bruno, vice president of originals marketing at Netflix. \"This gives people a chance to see it on the big screen if they'd like. We want to make this beautiful, critically acclaimed film ubiquitous.\" \n\"Steve Jobs,\" a biopic about the Apple co-founder, impressed in its expansion after scoring the year's highest per-screen average last weekend. It moved from four theaters to 60 locations, where it earned $1.5 million for a per-screen average of $25,831. It goes wide next weekend, a prospect that may alarm the scores of films trying to appeal to older ticket buyers. Sponsored Links", "external_links": [], "published": "2015-10-18T21:03:00.000+03:00", "crawled": "2015-10-18T21:33:10.418+03:00", "highlightTitle": ""}