{"organizations": ["Ladbrokes"], "uuid": "994216bfd432438f097e88912d4994d244abf9b1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chardandilminsternews.co.uk", "main_image": "http://www.chardandilminsternews.co.uk/resources/images/4126810/", "site_section": "http://www.chardandilminsternews.co.uk/uk_national_entertainment/rss/", "section_title": "Chard & Ilminster News | National Entertainment News", "url": "http://www.chardandilminsternews.co.uk/uk_national_entertainment/13806674.Ladbrokes_investigates_Great_British_Bake_Off_betting_claims/?ref=rss", "country": "GB", "title": "Ladbrokes investigates Great British Bake Off betting claims", "performance_score": 0, "site": "chardandilminsternews.co.uk", "participants_count": 0, "title_full": "Ladbrokes investigates Great British Bake Off betting claims", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T16:11:00.000+03:00", "replies_count": 0, "uuid": "994216bfd432438f097e88912d4994d244abf9b1"}, "author": "", "url": "http://www.chardandilminsternews.co.uk/uk_national_entertainment/13806674.Ladbrokes_investigates_Great_British_Bake_Off_betting_claims/?ref=rss", "ord_in_thread": 0, "title": "Ladbrokes investigates Great British Bake Off betting claims", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ladbrokes investigates Great British Bake Off betting claims Ladbrokes investigates Great British Bake Off betting claims \nPress Association 2014 / / National Entertainment News Share \nLadbrokes have said it will consider whether to allow betting on future series of The Great British Bake Off after claims that workers linked to the show were placing bets on this year’s winner. \nThe bookmaker is investigating wagers from 42 gambling accounts with alleged links to BBC staff and Love Productions, the company behind the hit series, according to the Sun. \nA total of 529 bets – potentially worth about £10,000 – were placed through the accounts that were created ahead of the pre-recorded final, which airs on BBC One on October 7, the newspaper reported. The Great British Bake Off finalists: Tamal, Nadiya, and Ian (Mark Bourdillon/Love Productions) \nA Ladbrokes spokesman said: “We flagged at the start of the series that we thought something smelled a bit strange. We are looking into it further. \n“If we feel we’ve had the equivalent of a custard pie thrown in our faces we will think twice about whether we should bet on markets like this again in the future.” \nA BBC spokesman said: “We have no knowledge of these claims and have asked The Sun to provide us with details to be able to look into it. We are still waiting.” Paul Hollywood and Mary Berry (Mark Bourdillon/BBC) \nBets placed on the outcome of television events such as The Great British Bake Off are often restricted to £20 at any one time, but punters are able to bet more than once over a period of days. \nThe final will see contestants Ian Cumming, Nadiya Hussain and Tamal Ray battle it out for the Bake Off crown. Bets were suspended in August amid fears the winner’s name had been leaked. \nLadbrokes announced it had stopped taking wagers after it noticed suspicious play on one contestant, whose odds started at 12/1 and were reduced to 6/1, 3/1 and then evens. Several of the wagers were the maximum the bookies would take for the show, and 90 per cent were placed on one contestant. Share article \nA spokesman for Love Productions told the Sun: “We take any allegation of breach extremely seriously.” Promoted Stories", "external_links": [], "published": "2015-10-06T16:11:00.000+03:00", "crawled": "2015-10-06T22:14:38.326+03:00", "highlightTitle": ""}