{"organizations": [], "uuid": "cc9bbaafbb8a8ee6f0ab2120317471dfd9d495c3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://www.canberratimes.com.au/content/dam/images/g/k/5/p/g/m/image.related.articleLeadwide.620x349.gk5pek.png/1444384052874.jpg", "site_section": "http://www.canberratimes.com.au/act-news/canberra-life", "section_title": "Canberra Life | Lifestyle, Food, Entertainment, Arts, Theatre &amp; Music", "url": "http://www.canberratimes.com.au/act-news/canberra-life/fright-fest-set-to-spook-at-nfsa-20151009-gk5pek.html", "country": "AU", "title": "Fright Fest set to spook at NFSA", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "Fright Fest set to spook at NFSA", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T17:47:00.000+03:00", "replies_count": 0, "uuid": "cc9bbaafbb8a8ee6f0ab2120317471dfd9d495c3"}, "author": "Gemma Varcoe", "url": "http://www.canberratimes.com.au/act-news/canberra-life/fright-fest-set-to-spook-at-nfsa-20151009-gk5pek.html", "ord_in_thread": 0, "title": "Fright Fest set to spook at NFSA", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NSFA Fright Fest programmer Cris Kennedy has selected a spooky selection of homegrown horror films. Photo: Daniel Spellman\nIn the City Issue 23: full edition\n​ This Halloween one of Australia's most haunted sites will open its doors to punters looking for a classic all night horror-thon. Screening six scary movies in swift succession, the National Film and Sound Archive invites guests to attend Fright Fest – All Nite Late Show.\nThe venue itself is more than appropriate for the spooky subtext of the night. As the former Institute of Anatomy, the NFSA was once home to a somewhat gorier collection of items. Hundreds of human skulls reportedly lined the downstairs corridor of the building and this area is now purported to be a hot-spot for paranormal activity with many an urban legend borne.\nThe National Film and Sound Archive. Photo: supplied\nThe NFSA has pulled the six films from its two million strong collection in order to frighten and thrill. Fright Fest programmer Cris Kennedy has chosen the six films based on their fear factor and relevance to Australian film culture.\nAdvertisement Shivers will run up spines as gasps echo throughout the corridors when Razorback, Road Games, The Loved Ones, The Babadook, Wyrmwood: Road of the Dead and 100 Bloody Acres grace the screen at Arc cinema.\n\"What a lot of these films have in common is that while they are horror films they all have quite a comedic element to them,\" Kennedy says.\n\" Razorback for instance, I remember seeing as a kid and being terrified. What were parents thinking in the 1980's? A horror film about an enormous killer pig?\"\nThe films are all home grown with Road Games featuring the great and lonely expanse of the Nullarbor as a killing ground for a crazed murderer intent on ending the life of '80s 'scream queen' Jamie Lee Curtis. As for The Babadook, it has been so well received and critically acclaimed that the creator of The Exorcist has deemed it the most terrifying movie he has ever seen.\n\"People love to be scared, which is one reason for programming this,\" Kennedy says.\nOn the night the double door entrance at the front of the building will be locked and Kennedy has invited cinema-goers to attend in their pyjamas and to bring a pillow.\n\"It will be a nice, safe environment to be scared in,\" he says.\n\"It's been lucky that Halloween has fallen on a Saturday this year. When our audiences go out blinking in to the glaring sunlight of the Sunday…I mean it's the day of the dead. Halloween doesn't have to end when the nights over.\"\nFright Fest – All Nite Late Show will be screening on October 31 from 10pm at the Arc cinema, NFSA\nW: nfsa.gov.au", "external_links": ["http://inthecity.realviewtechnologies.com/?iid=129573"], "published": "2015-10-09T17:47:00.000+03:00", "crawled": "2015-10-12T22:15:27.432+03:00", "highlightTitle": ""}