{"organizations": [], "uuid": "22378e319500f9bf8f90a95e1218d04684e6bb4d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbsnews.com", "main_image": "http://cbsnews1.cbsistatic.com/hub/i/r/2015/10/02/38b890e5-3204-4d75-a3f2-f1b9e482ab1a/thumbnail/620x350/5e83e83d57b1e60b46d14b0119d31f71/oregon-suspected-shooter.jpg", "site_section": "http://www.cbsnews.com/", "section_title": "CBS News - Breaking News, U.S., World, Business, Entertainment &amp; Video ", "url": "http://www.cbsnews.com/news/oregon-shooting-umpqua-community-college-gunman-chris-harper-mercers-family-speaks-out/", "country": "US", "title": "Umpqua Community College shooting: Gunamn Chris Harper-Mercer's family speaks out", "performance_score": 0, "site": "cbsnews.com", "participants_count": 4, "title_full": "Umpqua Community College shooting: Gunamn Chris Harper-Mercer's family speaks out - CBS News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T18:20:00.000+03:00", "replies_count": 3, "uuid": "d8947f9cf5c7882f4a12d8df341a95dc542efbf7"}, "author": "CBS News", "url": "http://www.cbsnews.com/news/oregon-shooting-umpqua-community-college-gunman-chris-harper-mercers-family-speaks-out/#post-0", "ord_in_thread": 0, "title": "Umpqua Community College shooting: Gunamn Chris Harper-Mercer's family speaks out", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "TORRANCE, Calif. -- The man suspected of opening fire on a college campus and killing nine people in Oregon had ties to Torrance and relatives in Tarzana, California, CBS Los Angeles reported .\nTwo law enforcement sources told CBS News that Chris Harper Mercer , 26, was the man who opened fire at Umpqua Community College. He died after exchanging gunfire with responding officers.\nPlay Video CBSN 26-year-old Chris Harper Mercer identified as college shooting suspect Law enforcement sources have identified 26-year-old Chris Harper Mercer as the gunman in a shooting that killed at least 10 at Umpqua Community C...\nCarmen Nesnick, the stepsister of Mercer, said he was born in the United Kingdom and traveled to the United States as a young boy.\n\"I'm actually still shaking and my mom is in there crying. I don't know what to do,\" said Nesnick, who said that Mercer's father, who lives in Tarzana, married her mother a few years ago.\nShe says the last time she spoke with Mercer was about a year ago. Even though they had met only a few times, Nesnick described him as \"caring and supportive.\"\n\"All he ever did was put everybody before himself. He wanted everyone to be happy. No matter if he was sad or mad, he would always try to cheer up everybody,\" she said.\nNesnick said her stepbrother was not a religious nor anti-religious person and that her family is Christian.\n29 Photos Umpqua Community College shooting A deadly shooting took place on an Oregon community college campus October 1, 2015\n\"I am just as shocked as anybody at what happened today,\" said Ian Mercer, the suspect's father.\n\"I can't answer any questions right now. I don't want to answer any questions right now. Obviously, it's been a devastating day, devastating for me and my family,\" he said.\nMeanwhile, Bronte Hart, who lived below Mercer in the community of Winchester, told the Associated Press that Mercer would \"sit by himself in the dark in the balcony with this little light.\"\nHart, who said Mercer \"seemed really unfriendly,\" told the AP that a woman she believed to be Mercer's mother also lived upstairs and was \"crying her eyes out\" Thursday night.\nPosts on an online blog that appears to belong to Mercer reference multiple shootings, including one in Virginia in August that left a television news reporter and cameraman dead. The last upload on the blog was Wednesday. when a documentary about the Newtown shooting was posted.\nIn one post on the blog about Vester Flanagan, the man who killed the reporter and cameraman in Virginia, Mercer apparently wrote, \"I have noticed that so many people like [Flanagan] are alone and unknown, yet when they spill a little blood, the whole world knows who they are. A man who was known by no one, is now known by everyone. His face splashed across every screen, his name across the lips of every person on the planet, all in the course of one day. Seems like the more people you kill, the more you're in the limelight.\"", "external_links": ["http://cbsnews1.cbsistatic.com/hub/i/r/2015/10/02/b452e47d-d02b-4723-89b3-570c1917150f/thumbnail/620x350/33c645f87996dc97c2a3c2ddcf2c430e/2015-10-02t042632z2128833110tm3eba200u001rtrmadp3usa-shooting-oregon.jpg", "http://losangeles.cbslocal.com/2015/10/01/man-suspected-in-school-shooting-massacre-in-oregon-had-ties-to-torrance-relatives-in-tarzana/", "http://cbsnews2.cbsistatic.com/hub/i/r/2015/10/02/78c8cd82-fb41-4e71-a240-5af423b380bb/thumbnail/220x140/14dfdf9b15f451543ad5c8fa3bd2f98f/cbsnsuspectidentified450761640x360.jpg"], "published": "2015-10-02T18:20:00.000+03:00", "crawled": "2015-10-02T20:07:01.077+03:00", "highlightTitle": ""}