{"organizations": [], "uuid": "4afaab195ea9063916df9013b1777f77a1275698", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266353/arts-entertainment-television", "section_title": "Arts &amp; Entertainment: Television - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30177761/unique-new-no-cost-adventure-app-tum-tums-by-emboldman-features-endless-gameplay-unforgettable-characters-in-game-power-ups-more", "country": "US", "title": "Unique New No-Cost Adventure App Tum Tums by Emboldman Features Endless Gameplay, Unforgettable Characters, In-Game Power Ups & More", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Unique New No-Cost Adventure App Tum Tums by Emboldman Features Endless Gameplay, Unforgettable Characters, In-Game Power Ups & More - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T19:01:00.000+03:00", "replies_count": 0, "uuid": "4afaab195ea9063916df9013b1777f77a1275698"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30177761/unique-new-no-cost-adventure-app-tum-tums-by-emboldman-features-endless-gameplay-unforgettable-characters-in-game-power-ups-more", "ord_in_thread": 0, "title": "Unique New No-Cost Adventure App Tum Tums by Emboldman Features Endless Gameplay, Unforgettable Characters, In-Game Power Ups & More", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tum Tums from Emboldman is a refreshingly original and fun adventure game in which users must solve levels by skillfully avoiding obstacles, collecting stars, by activating various power-ups. The new no-cost app features 22 unforgettable characters and beautiful graphics, and is available now from the App Store.\nCupertino, CA (PRWEB) October 03, 2015\nAdventure game lovers looking for their next conquest have reason to celebrate, because Emboldman’s highly addictive new app Tum Tums is now available at no-cost from the App Store.\nDesigned to be enjoyed by users of all ages – from kids to adults to seniors – Tum Tums is a refreshingly original and creative game that is easy to understand, but challenging to master.\nThe game’s inventive and amusing back story goes like this: deep in the forest lives the Tum Tums Tribe, which is made up of 22 unique creatures that each have their own look, color and name. They also live with a friendly panda named Huan, who occasionally\nprovides helpful tips and hints for solving levels – and at other times, plays tricks and jokes. It’s up to users to decide when Huan is being helpful, and when he’s just being silly.\nUsers must solve each level by skillfully avoiding obstacles such as a sheep on a rocket, collecting stars, and activating various power-ups, like Invincibility, Star Magnet, Gravity Challenge, and more. Currently, there are 96 unique levels, and more will be added in future updates.\nIn addition, Tum Tums has been designed with beautiful graphics, which enhances the virtually endless gameplay experience. Regardless of their current triumph, users can look forward to another level to conquer, more points to collect, and more interesting\ncharacters to unlock.\nOther Tum Tums special features include:\nOne-touch game controls, which means that instead of trying to figure out how to play, users will be having fun within seconds of installing the app. Leaderboard integration so users can compete against their friends, and other users around the world.\n“Tum Tums is both fun and challenging, and features unique characters that are unlike anything users have ever seen before!” commented Andrej Selan of Emboldman. “All it takes is a few minutes of playing and users will be hooked – there’s always a fun new challenge ahead”.\nTum Tums, the unique new adventure app that features endless gameplay, unforgettable characters, in-game power ups and more, is available now at no-cost from the App Store at https://itunes.apple.com/app/tum-tums/id1038942258 . A dedicated Android version is also available at: https://play.google.com/store/apps/details?id=com.andrejselan.tumtums\nMore information on Tum Tums, including screenshots and a video trailer, is available at http://www.enboldman.com .\nFor all other information or media inquiries, contact Mark Johnson on behalf of Emboldman at +1 408 757 0156 or press (at)appshout(dot)com.\nAbout Embolden\nBased in Slovenia, Andrej Selan is a passionate indie game developer who creates games under the banner Enboldman. With a philosophy of creating games that everyone can play and enjoy, Andrej has realized a childhood dream to become a game developer and believes indie game development drives the future of gaming.\nA skilled programmer and designer, Andrej is working on a portfolio of indie game projects, with \"Tums Tums\" being his first major project.\nLearn more: http://www.enboldman.com\n //www.prweb.com/releases/appshout/tum-tums/prweb13001637.htm\n ", "external_links": ["http://www.prweb.com/releases/appshout/tum-tums/prweb13001637.htm", "https://play.google.com/store/apps/details?id=com.andrejselan.tumtums", "https://itunes.apple.com/app/tum-tums/id1038942258"], "published": "2015-10-03T19:01:00.000+03:00", "crawled": "2015-10-03T18:25:53.691+03:00", "highlightTitle": ""}