{"organizations": [], "uuid": "d43c72d98f4d3b7b749dde3b778153d0a4b2c0c2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reviewjournal.com", "main_image": "http://www.reviewjournal.com/sites/default/files/field/media/ryan.JPG", "site_section": "http://feeds.feedburner.com/Reviewjournalcom-Neon", "section_title": "Entertainment", "url": "http://www.reviewjournal.com/entertainment/the-reel/ryan-adams-performs-taylor-swift-song-jimmy-kimmel-live", "country": "US", "title": "Ryan Adams performs Taylor Swift song on 'Jimmy Kimmel Live'", "performance_score": 0, "site": "reviewjournal.com", "participants_count": 1, "title_full": "Ryan Adams performs Taylor Swift song on 'Jimmy Kimmel Live' | Las Vegas Review-Journal", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T14:04:00.000+03:00", "replies_count": 0, "uuid": "d43c72d98f4d3b7b749dde3b778153d0a4b2c0c2"}, "author": "Dave Herrera", "url": "http://www.reviewjournal.com/entertainment/the-reel/ryan-adams-performs-taylor-swift-song-jimmy-kimmel-live", "ord_in_thread": 0, "title": "Ryan Adams performs Taylor Swift song on 'Jimmy Kimmel Live'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "In case you missed it, Ryan Adams appeared on \"Jimmy Kimmel Live\" show last night and performed his version of Taylor Swift's tune \"Welcome to New York,\" from his re-imagined version of her \"1989\" album. Live, Adams rarely disappoints, and so unsurprisingly, his rendition of the Swift song was dependably solid. \nThe two songwriters recently had a chat about their pop culture convergence for GQ Magazine , which documented the exchange. In the video, Swift clearly seems taken by Adams' interpretation of her tunes and how he re-contextualized her sentiments, which ultimately ended up making the song more heartrending, when she meant it more dismissively.\n\"When you take a song like 'All You Had to Do Was Stay,' my version of it is, 'All you had to do was stay,\" Swift tells him in the GQ clip posted on YouTube. \"Sorry about it. I don't miss you, but now you're back.' Yours is like, 'All you had to do was stay. You broke my heart. That's all you had to do.'\" \nWhile there are arguably other of his renderings that are more striking that he could have chosen to perform, \"Welcome to New York\" obviously made the most sense, since Swift wrote the record while living in New York, and Kimmel is taping his show there this week at the Brooklyn Academy of Music. \nFunny thing about that whole thing is Adams and Kimmel are virtually neighbors back at home in Los Angeles, at least in terms of where they put in a day's work. When he's holed up in Hollywood, the songwriter's headquarters at Pax-Am Studios on Sunset Boulevard is less than a mile away from the El Capitan Theatre on Hollywood and Highland, where \"Jimmy Kimmel Live\" is filmed every day. So it's novel that the two had to take a trip across the country to the opposite coast for this memorable moment to be captured for posterity. \nAdams was Kimmel's first musical guest this week. Other guests include Jay Z, slated for tonight, followed by Big Grams (Big Boi and Phantogram), Esperanza Spalding and Public Enemy, which will close the week out. \n10 best 'Hotline Bling'... Get grossed out by 'Brain...   Comment section guidelines The below comment section contains thoughts and opinions from users that in no way represent the views of the Las Vegas Review-Journal or GateHouse Media. This public platform is intended to provide a forum for users of reviewjournal.com to share ideas, express thoughtful opinions and carry the conversation beyond the article. Users must follow the guidelines under our Commenting Policy and are encouraged to use the moderation tools to help maintain civility and keep discussions on topic.\nView the discussion thread.", "external_links": [], "published": "2015-10-20T14:04:00.000+03:00", "crawled": "2015-10-21T07:52:03.784+03:00", "highlightTitle": ""}