{"organizations": [], "uuid": "dd37654cdb34cfc1f8dbd8b91822f29181d2226e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ign.com", "main_image": "http://assets2.ignimgs.com/2015/10/14/dragonquest1012151280jpg-b6a802_1280w.jpg", "site_section": "http://feeds.ign.com/IGNPS4Reviews", "section_title": "IGN Entertainment Articles", "url": "http://www.ign.com/articles/2015/10/14/dragon-quest-heroes-the-world-trees-woe-and-the-blight-below-review", "country": "US", "title": "Dragon Quest Heroes Review", "performance_score": 0, "site": "ign.com", "participants_count": 1, "title_full": "Dragon Quest Heroes Review", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T00:51:00.000+03:00", "replies_count": 0, "uuid": "dd37654cdb34cfc1f8dbd8b91822f29181d2226e"}, "author": "Tom Mc Shea", "url": "http://www.ign.com/articles/2015/10/14/dragon-quest-heroes-the-world-trees-woe-and-the-blight-below-review", "ord_in_thread": 0, "title": "Dragon Quest Heroes Review", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "“ \nWhen all of these elements converge, the action becomes a chaotic explosion. \nIt's those tougher battles that bring a cerebral bent to the mindless killings. No longer can you just blindly mash buttons until the victory music plays. Rather, you must roam across the arena to close portals and slay enemies. There's usually a precious object that must be protected (or else you fail the mission), and so you repeatedly circle back to ensure no one is taking potshots at it. By killing enemies you earn monster cards that let you plant sentries to guard your backside. When all of these elements converge, the action becomes a chaotic explosion in which you feverishly sprint from one objective to the next while trying to read the cluttered map. \nOther heroes join you in your quest as you venture forth, and these, too, force you to make strategic choices. When you form your four-person team, you need to make sure everyone can contribute. Do you want an archer to provide long-distance attacks? A brute to swing his axe recklessly? A mage to fill the battlefield with colorful bubbles? These are important choices that make it seem like a misstep could spell failure, though I found that success came no matter who I teamed up with. There are also weapons to buy, items to craft, and baubles to build, but running from shop to shop between missions is, unfortunately, as shallow as the fighting. There aren't many choices and it's pretty obvious which of the three whips, for instance, is best. The Verdict \nDragon Quest Heroes occupies a similar place as games like Hyrule Warriors and Middle-earth: Shadow of Mordor. The combat that makes up the majority of gameplay is fun but forgettable, and there's little else to keep you engaged unless you're sufficiently attached to the license. In that regard, Dragon Quest Heroes looks delightful and is bursting with characters and creatures from the history of the franchise, so anyone who has been glued to each new release since the heyday of Enix will find enough familiar sights to stay invested. However, if you're still puzzling over the differences between Dragon Quest and Dragon Warrior, there are much better fights to seek out. IN THIS ARTICLE", "external_links": [], "published": "2015-10-15T00:51:00.000+03:00", "crawled": "2015-10-15T21:30:43.674+03:00", "highlightTitle": ""}