{"organizations": [], "uuid": "4b15c49870eff9d6dd665923d0e1946b429d1ca9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "http://s4.reutersmedia.net/resources/r/?m=02&d=20151013&t=2&i=1086763139&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXNPEB9C169", "site_section": "http://www.reuters.com/news/entertainment/arts", "section_title": "Arts - Entertainment | Reuters.com", "url": "http://www.reuters.com/article/2015/10/13/us-books-manbooker-idUSKCN0S72RP20151013", "country": "US", "title": "Jamaican Marlon James's Bob Marley novel wins Man Booker prize", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Jamaican Marlon James's Bob Marley novel wins Man Booker prize | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T01:02:00.000+03:00", "replies_count": 0, "uuid": "4b15c49870eff9d6dd665923d0e1946b429d1ca9"}, "author": "Michael Roddy", "url": "http://www.reuters.com/article/2015/10/13/us-books-manbooker-idUSKCN0S72RP20151013", "ord_in_thread": 0, "title": "Jamaican Marlon James's Bob Marley novel wins Man Booker prize", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON Marlon James was named as the first Jamaican winner of the Man Booker prize for fiction on Tuesday for his reggae- and drug-infused novel \"A Brief History of Seven Killings\" inspired by an attempt to kill reggae star Bob Marley in 1976.\nThe 686-page novel, which uses Jamaican patois, Harlem slang and liberal doses of scatological language, tells the story of a gang of cocaine-fuelled ghetto kids armed with automatic weapons who tried but failed to kill Marley in the Jamaican capital Kingston before he gave a peace concert.\n\"The excitement of the book kept coming, I think, and we just felt it didn't flag, and on re-reading it just got better,\" author and academic Michael Wood, chair of the five-person panel of judges, told reporters.\n\"This book is startling in its range of voices and registers, running from the patois of the street posse to The Book of Revelation,\" Wood said in a statement.\n\"It is a representation of political times and places, from the CIA intervention in Jamaica to the early years of crack gangs in New York and Miami.\"\nThe panel selected the third novel by James, 44, who now lives in Minneapolis and teaches writing, from a shortlist of six titles.\nJames has been Quote: d, in an online interview with the Gawker Review of Books website, as saying the book breaks a lot of the rules he teaches his students at Macalester College in St. Paul.\n\"Half of the stuff in that book I don’t allow my students to do,\" James said. \"There’s a seven-page sentence in the book. Even when the book ends, it just stops.\"\nWood told reporters he was sure his mother would not have been able to get through even a few pages of the book, but he recommended it to readers who want to try something different.\n\"It may be controversial but only if you simply extract the swearing and drugs and stuff from the context,\" he said. \"It could well be that it's not so controversial.\"\nThe prize, which in its 47-year history previously has gone to Salman Rushdie, Hilary Mantel, Margaret Atwood and J.M. Coetzee, carries a top cash award of 50,000 pounds ($76,000), but more importantly can be a huge shot in the arm for book sales.\nLast year's winner, Australian writer Richard Flanagan's \"The Narrow Road to the Deep North\", has sold 800,000 copies worldwide, a statement announcing the prize results said.\nJames's book has won high critical acclaim, with the New York Times saying it was \"like a (Quentin) Tarantino remake of 'The Harder They Come', but with a soundtrack by Bob Marley and a script by Oliver Stone and William Faulkner\".\nWood noted that James calls his novel - which opens with a dead man speaking, describes events that occurred in Jamaica from the viewpoints of dozens of characters, and closes in New York City - \"Dickensian\" in its scope.\nHe said a rule change two years ago which allowed American writers to compete for the Man Booker, previously limited for the most part to the Commonwealth, had no impact on this year's choice, since Jamaica is a Commonwealth country. But he said the change had broadened the types of books under consideration.\n\"The sheer range of what we read was amazing,\" he said.\n(Writing by Michael Roddy; Editing by Hugh Lawson )", "external_links": [], "published": "2015-10-14T01:02:00.000+03:00", "crawled": "2015-10-14T00:14:20.047+03:00", "highlightTitle": ""}