{"organizations": ["Facebook Malcolm-Jamal Warner", "Associated Press", "Warner", "Malcolm-Jamal Warner", "Facebook Email Twitter Google", "LinkedIn Pinterest Malcolm-Jamal Warner"], "uuid": "6c03f4d317817d435ee2a1c24cb1b9bc79878cf1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wtsp.com", "main_image": "http://www.gannett-cdn.com/-mm-/de2e29a716ce6e34923df262cfc76691ee75bbdf/c=0-461-2363-1796&amp;r=x633&amp;c=1200x630/local/-/media/2015/01/21/WTSP/WTSP/635574642353162705-468566985.jpg", "site_section": "http://rssfeeds.wtsp.com/_/20/110077714/wtsp/entertainmentnews", "section_title": "WTSP - Entertainment", "url": "http://www.wtsp.com/story/entertainment/2015/10/09/malcolm-jamal-warner-opens-up-cosby-allegations/73660602/", "country": "US", "title": "Malcolm-Jamal Warner opens up about Cosby allegations", "performance_score": 0, "site": "wtsp.com", "participants_count": 0, "title_full": "Malcolm-Jamal Warner opens up about Cosby allegations", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T20:42:00.000+03:00", "replies_count": 0, "uuid": "6c03f4d317817d435ee2a1c24cb1b9bc79878cf1"}, "author": "", "url": "http://www.wtsp.com/story/entertainment/2015/10/09/malcolm-jamal-warner-opens-up-cosby-allegations/73660602/", "ord_in_thread": 0, "title": "Malcolm-Jamal Warner opens up about Cosby allegations", "locations": ["California", "Beverly Hills"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Malcolm-Jamal Warner", "Bill Cosby"], "text": "Facebook Email Twitter Google+ LinkedIn Pinterest Malcolm-Jamal Warner opens up about Cosby allegations \"The Cosby Show\" alum Malcolm-Jamal Warner says the series' legacy is \"tarnished\" by the sexual assault allegations made against Bill Cosby. Post to Facebook Malcolm-Jamal Warner opens up about Cosby allegations \"The Cosby Show\" alum Malcolm-Jamal Warner says the series' legacy is \"tarnished\" by the sexual assault allegations made against Bill Cosby. Check out this story on wtsp.com: http://on.wtsp.com/1Lm0xoH Cancel Send A link has been sent to your friend's email address. Posted! A link has been posted to your Facebook feed. Join the Conversation To find out more about Facebook commenting please read the Conversation Guidelines and FAQs Malcolm-Jamal Warner opens up about Cosby allegations Associated Press, AP 1:51 p.m. EDT October 9, 2015 Actor Malcolm-Jamal Warner attends the 13th Annual AARP's Movies For Grownups Awards Gala at Regent Beverly Wilshire Hotel on February 10, 2014 in Beverly Hills, California. (Photo: Imeh Akpanudosen, Getty Images) CONNECT TWEET LINKEDIN COMMENT EMAIL MORE \nLOS ANGELES -- \"The Cosby Show\" alum Malcolm-Jamal Warner says the series' legacy is \"tarnished\" by the sexual assault allegations made against Bill Cosby. \n\"My biggest concern is when it comes to images of people of color on television and film, no matter what ... negative stereotypes of people of color, we've always had 'The Cosby Show' to hold up against that. And the fact that we no longer have that, that's the thing that saddens me the most because in a few generations the Huxtables will have been just a fairy tale,\" said Warner, who starred as Cosby's son, Theo Huxtable, on the long-running NBC sitcom. \nWarner said he has been in touch with Cosby, but he would not comment on their conversations. \n\"I think the things that we discussed really have to stay private between us. But it's just a bad situation all around -- for him, for his family, the women, their families, the legacy of the show,\" said Warner during an interview Thursday. \nCosby admitted having extramarital relationships with several women, including some who now accuse him of sexual assault. He has never been charged with a crime. \nWarner, who won his first Grammy earlier this year for his work on Robert Glasper's \"Jesus Children,\" is currently promoting his new album, \"Selfless,\" out now. \nHe describes the third record with his band Miles Long as \"funky passionate vulnerability.\" \nWarner is also filming \"American Crime Story: The People vs. O.J. Simpson,\" directed by Ryan Murphy. He plays Simpson's friend Al \"A.C.\" Cowlings. \n\"I grew up with a maniacal obsession with not wanting to be one of those 'Where Are They Now Kids,' \" said Warner of his busy year. \"I feel very blessed to be able to have all of these avenues of expression ... to be where I am now and finally at a place where I can let go of that worry about having a life after 'Cosby.'\" YOU MAY ALSO LIKE...", "external_links": [], "published": "2015-10-09T20:42:00.000+03:00", "crawled": "2015-10-09T21:09:03.837+03:00", "highlightTitle": ""}