{"organizations": [], "uuid": "65abea793c3abd9c8ebceeb60f4ce3d1172ad0f2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.charlotteobserver.com", "main_image": "http://www.charlotteobserver.com/entertainment/ktee52/picture41185119/ALTERNATES/LANDSCAPE_1140/K10-300_King_captioned", "site_section": "http://www.charlotteobserver.com/entertainment/?widgetName=rssfeed&widgetContentId=8167599&getXmlFeed=true", "section_title": "Entertainment News | CharlotteObserver.com &", "url": "http://www.charlotteobserver.com/entertainment/article41185125.html", "country": "US", "title": "Charlotte’s Hoon Lee has become Broadway royalty", "performance_score": 0, "site": "charlotteobserver.com", "participants_count": 1, "title_full": "Charlotte’s Hoon Lee has become Broadway royalty", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T19:26:00.000+03:00", "replies_count": 0, "uuid": "65abea793c3abd9c8ebceeb60f4ce3d1172ad0f2"}, "author": "Lawrence Toppman", "url": "http://www.charlotteobserver.com/entertainment/article41185125.html", "ord_in_thread": 0, "title": "Charlotte’s Hoon Lee has become Broadway royalty", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Charlotte’s Hoon Lee has become Broadway royalty \nStar of TV’s ‘Banshee’ steps into famous slippers in ‘The King and I’ \nHe appears opposite Kelli O’Hara in acclaimed revival Charlotte-based actor Hoon Lee, seen here with Tony-winner Kelli O’Hara, has taken over the title role in the revival of “The King and I” on Broadway. Paul Kolnik Paul Kolnik To avoid thinking about the iconic Yul Brynner, Hoon Lee has never watched the 1956 film of “The King and I.” Paul Kolnik Paul Kolnik 1 of 2 \nHoon Lee always figured he’d be king someday. Through his years as a transvestite hacker, a resident of Urinetown and a Danish courtier (where the closest he got to royalty was a doomed prince), Siam beckoned in the distance. \nNow he lives there six times each week. \nHis family may still be in Charlotte’s South End, but the 42-year-old actor went north three weeks ago to take the title role in the Tony-winning revival of “The King and I.”  ; \nHis biggest fame to date came in “Banshee,” which shot in Charlotte for three years before moving to Pittsburgh. (Season four begins in January on Cinemax.) But destiny sent him to Rodgers and Hammerstein’s Thailand. \nIn his first brush with the show, he played the King’s prime minister at New Jersey’s Paper Mill Playhouse in 2002. He was asked to head a touring production in China but didn’t go. And last month, Broadway called. \n“If you’re going to cast the King, there’s not that wide a range of contenders,” he says. “Given the age appropriateness, I thought it would really be only a matter of time before I was asked. I wanted to wait until the show would be a good fit for me, a production where I’d work with people at the top of their game. And I have a bit of life experience under my belt now.” \nLife took him in other directions until he was 28. He studied visual art and English literature at Harvard and became a graphic designer/creative director for a Web consultancy firm until 2001. \nA friend asked him to help record a demo CD for a musical, then offered him a part in the show, then coaxed him into a tour of Taiwan. When he came back, the choreographer told him about Paper Mill. Then he made his Broadway debut in 2002 in a small part in the musical “Urinetown.” \n“Coming to acting late in the game forced me to play catch-up and be as resourceful as possible in becoming competitive,” he recalls. “I didn’t have a lot of acting technique, so I looked for ways to apply what my training had taught me. I’d had to think my way past obstacles. I’d felt very comfortable brainstorming with design teams, and that helped with theater, which is incredibly collaborative.” \nReally? Even when you join a supremely well-oiled machine where two stars (Kelli O’Hara and RuthieAnn Miles) had won Tonys and director Bartlett Sher had been nominated? Even when you have just one rehearsal with O’Hara and one work session with Sher? \n“I am a big believer in creative constraint,” he said. “I feel the most satisfaction when someone puts me a straitjacket, and I have to try to get out. But that wasn’t the case here; they gave me a lot more freedom. Kelli and Ruthie and everyone else were looking forward to looking at the piece in a new way. \n“You can shade things differently, change the momentum, and subtle details add up over the course of the show. Your partner takes a beat where she wouldn’t normally, and that reconfigures the rest of the scene. If an actor’s receptive to that, it can be very exciting.” \nHis career has worked that way, as an accumulation of small roles that begins to reveal wide range as an actor. But though he’s been cast in roles that didn’t demand an Asian-American, such as Rosencrantz to Michael Stuhlbarg’s “Hamlet” in Central Park or a French nobleman in an adaptation of Moliere’s “The Misanthrope,” he has more easily gotten work in “Flower Drum Song” and “Pacific Overtures.” \n“In the past couple of years, it seems like there’s been a shift toward colorblind casting,” he said. “But there have been shifts in the past, and they haven’t been an indication of long-lasting change. You’re asking people to change beliefs that they’ve grown up with and don’t hold with any hint of malice. They have a perception of what a romantic lead looks like, and that doesn’t mean they’re evil. \n“I just have to make sure, when I’m given the opportunity, that I crush it as well as I’m able. My job is to make people walk away from a TV set or a movie screen and say, ‘That guy was amazing,’ not ‘That Asian guy is terrific.’ I don’t think we’re there yet.” Related content", "external_links": [], "published": "2015-10-23T19:26:00.000+03:00", "crawled": "2015-10-23T19:53:22.626+03:00", "highlightTitle": ""}