{"organizations": [], "uuid": "1707fa7d10fc3856647adde0485b52cf83f68da4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tcpalm.com", "main_image": "http://sharing.tcpalm.com/sharescnn/photo/2015/10/08/1444325908_24967883_ver1.0_640_480.jpg", "site_section": "http://www.tcpalm.com/feeds/rssFeed?obfType=RSS_FEED&siteId=100111&categoryId=10008", "section_title": "Entertainment | TCP", "url": "http://www.tcpalm.com/newsy/daniel-craig-is-a-flipflopper-on-shooting-more-bond-films", "country": "US", "title": "Daniel Craig is a flip-flopper on Bond films", "performance_score": 0, "site": "tcpalm.com", "participants_count": 0, "title_full": "Daniel Craig is a flip-flopper on Bond films", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T22:35:00.000+03:00", "replies_count": 0, "uuid": "1707fa7d10fc3856647adde0485b52cf83f68da4"}, "author": "", "url": "http://www.tcpalm.com/newsy/daniel-craig-is-a-flipflopper-on-shooting-more-bond-films", "ord_in_thread": 0, "title": "Daniel Craig is a flip-flopper on Bond films", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Daniel Craig", "Lexie Hammesfahr"], "text": "Daniel Craig Is A Flip-Flopper On Shooting More Bond Films Lexie Hammesfahr entertainment news | celebrity news | newsy videos | movie news | spectre \nPhoto Credit: Sony Pictures Entertainment / 'Spectre' \nTo be or not to be — that is the question for one Daniel Craig, who seems unable to make up his mind on whether he wants to continue playing James Bond. (Video via Sony Pictures Releasing / \"Skyfall\" ) \nWe've noticed that in the past few months, the actor seems to be all over the place on his decision. (Video via Sony Pictures Releasing / \"Casino Royale\" ) \nIn the past, Craig has said he couldn't imagine doing another Bond film. After all, \"Spectre\" will be the fourth Bond film for the star since his 007 debut in 2006's \"Casino Royale.\" But he's also gushed about the once-in-a-lifetime role. (Video via Sony Pictures Releasing / \"Casino Royale\" ) \n\"I literally have to pinch myself,\" he told NBC in a March interview. \nAnd in an interview with Event Magazine in September, he could only say great things. He told the magazine he gets a \"kick out of doing it.\" \nAmong the gushing, he discussed his future with the franchise, noting he's contracted for one more film after \"Spectre,\" but he's \"not going to make predictions\" because \"if you don't get excited about making a movie of this size ... then go home.\" (Video via Sony Pictures Entertainment / \"Spectre\" ) \nHuh, interesting. Because not even two weeks after that story was published, Craig is singing a different tune. He told Time Out London in an article published Oct. 7 he would \"rather break this glass and slash [his] wrists\" than do another Bond movie. \nOkay, those are some pretty intense emotions. We should also note he spoke about his five-film obligation in the past tense, saying he was contracted for a fifth film . He makes it seem like that might be up in the air since Sony wanted to film it back-to-back with \"Spectre,\" and he didn't. (Video via Sony Pictures Entertainment / \"Spectre\" ) \nCraig also said if he starred in the 25th installment of the franchise, \"It would only be for the money.\" That's quite the flip-flop from his Event Magazine interview . (Video via Sony Pictures Releasing / \"Skyfall\" ) \nWe should also probably point out that he's been down this \"I'm totally over Bond\" road before. He told Rolling Stone in 2012 he's \"been trying to get out of this from the very moment [he] got into it.\" \nBut he also had this exchange with a reporter in 2012: \n\"Is it still as cool as the first time?\" the reporter asked him . \n\"Yeah, it's better in fact. I think. I'm enjoying it much more,\" Craig replied. \nSo maybe this is just a phase he goes through after finishing a Bond film. After all, he did just wreck $37 million worth of Aston Martins during filming — would you want to dive back into another action film after that? \nThis video includes images from Getty Images.", "external_links": [], "published": "2015-10-08T22:35:00.000+03:00", "crawled": "2015-10-09T02:37:30.681+03:00", "highlightTitle": ""}