{"organizations": [], "uuid": "904dc18384e6f0f7dc2d0601b3b24c8970d47781", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/10/06/13005219/ResizeImageHandler.jpg", "site_section": "http://www.prweb.com/rss2/aemagazines.xml", "section_title": "Arts &amp; Entertainment: Magazines", "url": "http://www.prweb.com/releases/KimberlyKolb/Lindsey/prweb13005219.htm", "country": "US", "title": "Kimberly Kolb’s Novel, ‘Lindsey’, Receives Praise From ‘Presumed Innocent’ Writer Scott Turow", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Kimberly Kolb’s Novel, ‘Lindsey’, Receives Praise From ‘Presumed Innocent’ Writer Scott Turow", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "904dc18384e6f0f7dc2d0601b3b24c8970d47781"}, "author": "Marketing Services", "url": "http://www.prweb.com/releases/KimberlyKolb/Lindsey/prweb13005219.htm", "ord_in_thread": 0, "title": "Kimberly Kolb’s Novel, ‘Lindsey’, Receives Praise From ‘Presumed Innocent’ Writer Scott Turow", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A teenage girl learns important lessons about the value of friendship while navigating the daily challenges of high school life in “Lindsey: Love and Intrigue” (published by iUniverse). The young adult novel by Kimberly Kolb recently received praise from celebrated best-selling author Scott Turow. Lindsey Morgan Brooks, a hard-working high school junior from Emit, Mich., still sees herself as the new kid in school. Even though Lindsey considers a few of her classmates as friends, she lacks self-confidence. To complicate matters, her crush on fellow junior Chris Buckley seems to be unrequited.\nLindsey battles her insecurities while building friendships and steering clear of the many landmines encountered in high school, like the “Neanderthal” jocks, or a group of popular girls she has dubbed the “Fab Five.” Between homework and gymnastics, Lindsey is so consumed with thoughts of Chris, she is unaware that she is the target of prying eyes.\nTurow is the author of ten works of fiction, two works of nonfiction and numerous book reviews for the New York Times. In 2010, he was elected president of the Authors Guild.\nIn a personal email to Kolb, Turow writes:\n\"‘Lindsey’ is a lovely (young adult) tale of young love and deep intrigue. Lindsey Brooks faces a peril all the more invisible because of the seemingly normal veneer of popular girls and teen crushes she deals with at high school every day.\"\n“Lindsey”\nBy Kimberly Kolb\nHardcover | 6 x 9 in | 410 pages | ISBN 9781475987911\nSoftcover | 6 x 9 in | 410 pages | ISBN 9781475987904\nE-Book | 410 pages | ISBN 9781475987928\nAbout the Author\nKimberly Kolb was born in Brooklyn, N.Y., and has a bachelor’s degree in industrial organizational psychology from the University of Illinois. She resides with her husband and three children north of Chicago and finds writing to be both relaxing and compelling. This is her first published book.\niUniverse is an Author Solutions, LLC, supported self-publishing services provider that partners with Berrett-Koehler to offer Open Book Editions and True Directions – in partnership with Tarcher – a division of Penguin Books. Additionally, iUniverse maintains a strategic alliance with leading Canadian Book retailer Indigo Chapters. To recognize excellence in publishing, iUniverse offers select authors the Star Award, Reader’s Choice, and Editor’s Choice designations based on specific criteria. To learn more about iUniverse’s publishing services, please visit iuniverse.com or call 1-800-AUTHORS. For the latest, follow @iuniverse on Twitter and “Like” us on Facebook at facebook.com/iuniverseselfpublishing.", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5raW1iZXJseWtvbGIuY29tLw==", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3RlZW5zYW5kdHdlbnRpZXMuY29tL2xpbmRzZXktaGFzLWVub3VnaC1vbi1oZXItcGxhdGUv", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5raW1iZXJseWtvbGIuY29tL2Jvb2sv", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5hbWF6b24uY29tL0xpbmRzZXktTG92ZS1JbnRyaWd1ZS1LaW1iZXJseS1Lb2xiLWVib29rL2RwL0IwMERGWThCWTAv"], "published": "2015-10-06T03:00:00.000+03:00", "crawled": "2015-10-06T12:52:59.268+03:00", "highlightTitle": ""}