{"organizations": [], "uuid": "cd45e2fa42770f7b0dc409cc9cf1369540a69036", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news24.com", "main_image": "http://graph.facebook.com/10227041841/picture", "site_section": "http://www.news24.com/", "section_title": "News24, South Africa's premier news source, provides breaking news on national, world, Africa, sport, entertainment, technology &amp; more. ", "url": "http://www.news24.com/MyNews24/Lets-talk-about-Gaddafi-20151008", "country": "ZA", "title": "Let's talk about Gaddafi", "performance_score": 0, "site": "news24.com", "participants_count": 1, "title_full": "Let's talk about Gaddafi | News24", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T17:10:00.000+03:00", "replies_count": 0, "uuid": "cd45e2fa42770f7b0dc409cc9cf1369540a69036"}, "author": "news24.com", "url": "http://www.news24.com/MyNews24/Lets-talk-about-Gaddafi-20151008", "ord_in_thread": 0, "title": "Let's talk about Gaddafi", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "What crimes did Muammar Gaddafi actually commit? Besides claims by the Western countries of the Lockerby Bombings for which Libya was harassed and an \"innocent\" man spending years in jail.\nWell it's also a well known fact that he came to power in a coup, suppressed political opponents, funded armed groups that the USA categorised as terrorist and attempted to obtain weapons of mass destruction (hash tag according to who: the West again?)...None if this is seriously disputed. Crimes? Others have done the same and not been punished. The USA protected General Franco, and numerous similar people around the world. Nothing was done about Saddam Hussein until after the end of the Cold War, when he became inconvenient. You can't speak of crimes without some sort of impartial judgement, which is lacking.\nAnd by the way he was also rumored to be worth over 200 Billion USD ( so much so for forbes claiming for years that Bill gates is the richest man in the planet, which I personally believe the richest man is in the middle East, probably the Sheik Mohammad Bin Rashid Al Makhthaum, but that's a topic for another day). The real question is what happened to Muammar Gaddafi's money? When someone out there freezes accounts of the so called dictators what eventually happens to the money once it gets liquidated again, if it does become liquid?\nWhat are we being fed here and by who?.. We are bombarded by so much Western media propaganda that we begin to drink the cool aid.. I still choose to not drink the cool aid!", "external_links": [], "published": "2015-10-08T17:10:00.000+03:00", "crawled": "2015-10-08T15:03:03.777+03:00", "highlightTitle": ""}