{"organizations": [], "uuid": "15ca02cf504566a1a1b39f3b2a8542b80e998023", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bangaloremirror.com", "main_image": "http://www.bangaloremirror.com/photo/49529220.cms", "site_section": "http://www.bangaloremirror.com/entertainment/section/20970473.cms", "section_title": "Entertainment News: Bollywood, Hollywood News, South Movie News &amp; Reviews – Bangalore Mirror", "url": "http://www.bangaloremirror.com/entertainment/bollywood/Crime-Master-Gogo-naam-hai-mera/articleshow/49529194.cms", "country": "IN", "title": "In Focus: Crime Master Gogo’s hul fight with Sallu", "performance_score": 0, "site": "bangaloremirror.com", "participants_count": 1, "title_full": "In Focus: Crime Master Gogo’s hul fight with Sallu - Bangalore Mirror", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T03:38:00.000+02:00", "replies_count": 0, "uuid": "15ca02cf504566a1a1b39f3b2a8542b80e998023"}, "author": "Roshmila Bhattacharya", "url": "http://www.bangaloremirror.com/entertainment/bollywood/Crime-Master-Gogo-naam-hai-mera/articleshow/49529194.cms", "ord_in_thread": 0, "title": "In Focus: Crime Master Gogo’s hul fight with Sallu", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "In which we look at the little things that make for the big picture\nCrime Master Gogo naam hai mera, aankhen nikal ke gotiyan khelta hoon main,\" that's how Shakti Kapoor introduces himself in Rajkumar Santoshi's 1994 comic caper, Andaz Apna Apna. Twenty-one years later, the veteran actor reveals that the iconic dialogue was penned by Tinnu Anand, who was initially to play the character but had to opt out owing to a date clash.\n\"That's when the makers approached me and I pointed out that dates were a problem with me as well since I was doing three-four shifts a day. They stated that Tinnu was going off on a month-and-a-half-long outdoor project, they had erected a set at Film City and needed to shoot Gogo's scenes before they dismantled it. They were willing to adjust to my schedule,\" reminisces Shakti.\nHowever, he told Santoshi that he could only start filming late in the evening after he wrapped up his other commitments. And after taking Tinnu's permission to step into his shoes, Shakti as 'Mogambo ka bhatija', Gogo, sprang into action with the threat, \"Aaya hoon, kuch to loot kar jaunga ... Khandani chor hoon main, khandani.\"\nHe remembers that they shot through the night, wrapping up with breakfast at a five-star hotel. Many of his lines were improvised on the sets. For instance, in one shot, the cloak he is wearing gets entangled in Amar Manohar's foot. And Aamir Khan, who plays Amar, deadpans, \"Gogoji, aapka ghagra...\" The quip had everyone in splits... And stayed on.\nShakti's favourite scene from the film is the hilarious 'hul' fight in the climax between Salman Khan and him, which again happened spontaneously during rehearsals. Salman would throw a punch from a distance, Shakti would react by falling to the ground, then respond with a 'hul' of his own, which would fell Salman's Prem. When Santoshi saw the pantomime going on between the two actors, he burst out laughing, and incorporated it into the script.\nProd him on Salman, and Shakti recalls a cute, friendly, really good-looking actor who had yet to become the 'dabangg' hero of today. He guffaws when he remembers the scene where Prem, who's down with an upset stomach, keeps marching to and fro from the loo, to accompanying sound effects. Aamir, he remembers, as an always smiling, Mr Perfectionist. \"Till today, I have never seen Aamir get angry on the sets,\" he marvels.\nDirector Santoshi was an easygoing, soft-spoken man, who only got intense and loud when he was 'performing' for his actors. \"Santoshiji is one of the finest actors I have come across. He would act out every scene for me, and watching him nervously, I would wonder if I'd be able to match up when I aped him in front of the camera,\" admits Shakti, still laughing over the memory of the scene where, wielding a gun, he orders Amar and Prem to follow him, marching ahead of them, gun pointing to no one in particular, the two trailing in his footsteps. Silly, but that's what made Andaz Apna Apna, which opened to an average response back in the '90s, a cult movie today.\nTwo months ago, en route to Hong Kong for a family vacation, Shakti ran into Aamir at the lounge of the international airport. The 50-year-old actor told him that he was looking for a Crime Master Gogo T-shirt. Shakti's son Siddhath strolled to one of the shops at the airport and got him four. \"The next thing I know, he's wearing one of them at an event,\" exults Shakti, who distributed another half-a-dozen Tees among friends, with wife Shivangi getting one too. \"The Crime Master Gogo mementoes also include mugs, bedsheets, towels and aprons, which came into the market three years ago and quickly became popular. The film turned bad man Shakti into a comic superhero. It's a short role with a long shelf life,\" he insists.\nThe actor admits he watches the film every time it plays on TV. And is thrilled that despite being a two decade old movie, it connects with the GenX. \"My children love it. My daughter Shraddha wants to do a film which has me returning as Crime Master Gogo and her playing Crime Master Gogi. Now, that should be fun,\" he chuckles. About two years ago, he was approached for a live animation action feature revolving around the character. It was supposed to have an animated Crime Master Gogo flying on a broomstick which turns into a machine gun when he lands and has Shakti Kapoor firing it. But the film didn't pan out.\nShakti has been waiting for the sequel for the last 20 years, waiting to work with Santoshi again. \"I hope to fly with one of my most popular character before I die,\" he asserts, adding, \"Jab koi bachcha nahin sota, to uski maa kehti hai ki ... soja soja soja nahin toh Gogo aa jayega...\"", "external_links": [], "published": "2015-10-26T03:38:00.000+02:00", "crawled": "2015-10-25T22:28:41.415+02:00", "highlightTitle": ""}