{"organizations": [], "uuid": "0eb77100833af5122caf4c11c9b480d3774d48d9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.aceshowbiz.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Aceshowbizcom-EntertainmentNews\r", "section_title": "Aceshowbiz.com - Entertainment News", "url": "http://www.aceshowbiz.com/news/view/00089257.html", "country": "US", "title": "Kim Kardashian Wants a Boob Job After Seeing Caitlyn Jenner's Bare Breasts", "performance_score": 0, "site": "aceshowbiz.com", "participants_count": 1, "title_full": "Kim Kardashian Wants a Boob Job After Seeing Caitlyn Jenner's Bare Breasts", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T07:58:00.000+03:00", "replies_count": 0, "uuid": "0eb77100833af5122caf4c11c9b480d3774d48d9"}, "author": "AceShowbiz.com", "url": "http://www.aceshowbiz.com/news/view/00089257.html", "ord_in_thread": 0, "title": "Kim Kardashian Wants a Boob Job After Seeing Caitlyn Jenner's Bare Breasts", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments The pregnant reality TV star tells her younger sister Khloe Kardashian that Caitlyn's 'boobs were like... made me want a boob job. Like, the best boobs.' \nKim Kardashian saw Caitlyn Jenner taking off her top and the pregnant reality TV star was excited by Caitlyn's bare breasts. In a sneak-peek of Sunday, October 4 episode of \" Keeping Up with the Kardashians \" obtained by E! News , Kim told her younger sister Khloe Kardashian that Caitlyn's breasts made her \"want a boob job.\" \"I went to Caitlyn's photo shoot and she was pretty, like, a really pretty. I walked in the first shot and she was in like... a gown,\" Kim told Khloe who reacted with disbelief. Kim then said to the camera, \"I was with Caitlyn at her Vanity Fair shoot, it was so good to just see how comfortable she is in her own skin. I'm so excited to see these pictures and to see the article and just for people to get to know Caitlyn.\" \"So then I went into the closet and she went to change and she was like, 'You can stay in,' and took off top. Her boobs were like... Kourtney's like when she first got hers done,\" Kim said to Khloe. \"Like, it made me want a boob job. Like, the best boobs.\" \"Let's reverse for one second. She has full implants?\" Khloe asked for clarification. Kim replied while chewing a snack, \"A full boob job. Like a C.\" Shocked Khloe then said, \"O.K. Cool She's just comfortable enough to take her top off in front of you? Good for her!\" \n© AceShowbiz.com", "external_links": [], "published": "2015-10-03T07:58:00.000+03:00", "crawled": "2015-10-03T09:23:17.366+03:00", "highlightTitle": ""}