{"organizations": [], "uuid": "161593f290d01b5e35a95a28a1b6a5ade9b6d812", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.torontosun.com", "main_image": "http://storage.torontosun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297467980650_ORIGINAL.jpg?quality=80&size=100x", "site_section": "http://www.torontosun.com/entertainment/rss.xml", "section_title": "Top Entertainment stories", "url": "http://www.torontosun.com/2015/10/14/jerry-seinfeld-wants-a-jays-mets-world-series", "country": "CA", "title": "Jerry Seinfeld wants a Jays-Mets World Series", "performance_score": 0, "site": "torontosun.com", "participants_count": 0, "title_full": "Jerry Seinfeld wants a Jays-Mets World Series", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T20:41:00.000+03:00", "replies_count": 0, "uuid": "161593f290d01b5e35a95a28a1b6a5ade9b6d812"}, "author": "", "url": "http://www.torontosun.com/2015/10/14/jerry-seinfeld-wants-a-jays-mets-world-series", "ord_in_thread": 0, "title": "Jerry Seinfeld wants a Jays-Mets World Series", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jerry Seinfeld"], "text": "Blue Jays top Rangers to force decisive Game 5 \nJerry Seinfeld would look forward to a Mets-Jays World Series for one reason only – to see Blue Jays’ knuckleballer R.A. Dickey return to the ballpark where he won a Cy Young. \n“I’d love it,\" Seinfeld said on Tuesday before headlining Humour Me, a charity event at Toronto’s Elgin Theatre in which Canada’s most influential CEOs perform standup comedy to raise cash. \n“I love the Mets and I loved Dickey when he was with us. We kind of found him and made him a star.” \nNo hard feelings about the trade that sent him to Toronto though. \n“We did pretty well with (ex-Jays catcher Travis) d’Arnaud and (pitcher Noah) Syndergaard.” Both became everyday players with the Mets and are in the lineup of the NLDS series between New York and Los Angeles. \nOther than that, he has no idea what to expect of the Jays or any other American League team. Seinfeld says he has avoided watching any AL game on principle for years, “because of the designated hitter rule.” \nSeinfeld did a meet-and-greet at Humour Me, posing for pictures with the likes of Canadian Tire CEO Maureen Sabia (the daughter of activist, feminist and erstwhile Toronto Sun columnist Laura Sabia), Barclay’s Canada CEO Michael Wilson (Finance Minister of Canada under PM Brian Mulroney), host Sean Cullen and yours truly, who was a judge alongside ex-CBC host Amanda Lang and Yuk Yuk’s comedy chain owner Mark Breslin. \nAfter it was over, Seinfeld confined himself to his dressing room until called upon to perform his set – privately watching the Mets lose to the Dodgers 3-1.", "external_links": [], "published": "2015-10-14T20:41:00.000+03:00", "crawled": "2015-10-14T22:11:18.019+03:00", "highlightTitle": ""}