{"organizations": [], "uuid": "f50db7ec97e678504ef72b13ff9e503474bfe6d8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.palmbeachpost.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/10/13/d0/60/38ba6e89c92b4d4b97e339d59cdb0fc5-e2be299f5257466e984928b83da26398-0.jpg", "site_section": "http://www.pbpulse.com/feeds/categories/entertainment/", "section_title": "News | Entertainment", "url": "http://www.palmbeachpost.com/ap/ap/entertainment/us-writer-hanya-yanigahara-favorite-for-booker-pri/nn2Pj/", "country": "US", "title": "US writer Hanya Yanigahara favorite for Booker Prize", "performance_score": 0, "site": "palmbeachpost.com", "participants_count": 0, "title_full": "US writer Hanya Yanigahara favorite for Booker Prize", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T13:27:00.000+03:00", "replies_count": 0, "uuid": "f50db7ec97e678504ef72b13ff9e503474bfe6d8"}, "author": "", "url": "http://www.palmbeachpost.com/ap/ap/entertainment/us-writer-hanya-yanigahara-favorite-for-booker-pri/nn2Pj/", "ord_in_thread": 0, "title": "US writer Hanya Yanigahara favorite for Booker Prize", "locations": ["US"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hanya Yanigahara"], "text": "US writer Hanya Yanigahara favorite for Booker Prize 6:28 a.m. Tuesday, Oct. 13, 2015 | Filed in: Celebrity news Comments 0 ﻿ \nStories of global migration, digital dislocation and the bonds of friendship are up for the prestigious Booker Prize for fiction, which could name its first American winner. \nJudges will select a victor of the 50,000-pound ($77,000) award Tuesday from six books that include Pulitzer Prize-winner Anne Tyler's multigenerational family saga \"A Spool of Blue Thread\" and Hawaiian writer Hanya Yanagihara's friendship tale \"A Little Life.\" Authors nominated for the 2015 Man Booker Prize; from left, Sunjeev Sahota, Chigozie Obioma, Hanya Yanagihara, Anne Tyler, Tom McCarthy and Marlon James pose with their books on stage at the Royal Festival Hall in London, Monday, Oct. 12, 2015. The six authors are short-listed for the 2015 Man Booker Prize for Fiction, and the winner will be announced Tuesday Oct. 13. (AP Photo/Frank Augstein) \nBritish bookmakers say Yanagihara is favorite for the prize, which expanded entries to English-language writers of all nationalities two years ago. \nOther contenders are British writer Sunjeev Sahota's immigrants' story \"The Year of the Runaways\"; Jamaican writer Marlon James' Bob Marley-inspired \"A Brief History of Seven Killings\"; British writer Tom McCarthy's digital drama \"Satin Island\"; and brothers-at-odds story \"The Fishermen,\" by Nigeria's Chigozie Obioma. Author Hanya Yanagihara poses with her book 'A Little Life' on stage at the Royal Festival Hall in London, Monday, Oct. 12, 2015. Yanagihara is one of six short-listed authors for the 2015 Man Booker Prize for Fiction. The winner will be announced Tuesday Oct. 13. (AP Photo/Frank Augstein) Author Anne Tyler poses with her book 'A Spool of Blue Thread' on stage at the Royal Festival Hall in London, Monday, Oct. 12, 2015. Tyler is one of six short-listed authors of the 2015 Man Booker Prize for Fiction, and the winner will be announced Tuesday Oct. 13. (AP Photo/Frank Augstein) Author Sunjeev Sahota poses with his book 'The Year of The Runaways' on stage at the Royal Festival Hall in London, Monday, Oct. 12, 2015. Sahota is one of six short-listed authors of the 2015 Man Booker Prize for Fiction, and the winner will be announced Tuesday Oct. 13. (AP Photo/Frank Augstein) Author Tom McCarthy poses with his book 'Satin Island' on stage at the Royal Festival Hall in London, Monday, Oct. 12, 2015. McCarthy is one of six short-listed authors of the 2015 Man Booker Prize for Fiction, and the winner will be announced Tuesday Oct. 13. (AP Photo/Frank Augstein) Author Chigozie Obioma poses with his book 'The Fishermen' on stage at the Royal Festival Hall in London, Monday, Oct. 12, 2015. Obioma is one of six shortlisted authors of the 2015 Man Booker Prize for Fiction, and the winner will be announced Tuesday Oct. 13. (AP Photo/Frank Augstein) Author Marlon James poses with his book 'A Brief History of Seven Killings' on stage at the Royal Festival Hall in London, Monday, Oct. 12, 2015. James is one of six short-listed authors of the 2015 Man Booker Prize for Fiction. The winner will be announced Tuesday Oct. 13. (AP Photo/Frank Augstein)", "external_links": [], "published": "2015-10-13T13:27:00.000+03:00", "crawled": "2015-10-13T13:55:27.183+03:00", "highlightTitle": ""}