{"organizations": [], "uuid": "c27d6d8ca394284131ec95ef9bbedd4951677bba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dnainfo.com", "main_image": "http://assets.dnainfo.com/generated/photo/2015/10/tompkins-square-park-halloween-dog-parade-1444754580.jpg/extralarge.jpg", "site_section": "http://www.dnainfo.com/new-york/topics/arts-entertainment.rss", "section_title": "Arts & Entertainment Top Stories on DNAINFO.com - Tuesday, October 20, 2015 | 2:00am", "url": "http://www.dnainfo.com/new-york/20151019/lower-east-side/11-ways-celebrate-halloween-east-village-lower-east-side", "country": "US", "title": "11 Ways to Celebrate Halloween in the East Village and the Lower East Side", "performance_score": 0, "site": "dnainfo.com", "participants_count": 0, "title_full": "11 Ways to Celebrate Halloween in the East Village and the Lower East Side", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T02:13:00.000+03:00", "replies_count": 0, "uuid": "c27d6d8ca394284131ec95ef9bbedd4951677bba"}, "author": "", "url": "http://www.dnainfo.com/new-york/20151019/lower-east-side/11-ways-celebrate-halloween-east-village-lower-east-side", "ord_in_thread": 0, "title": "11 Ways to Celebrate Halloween in the East Village and the Lower East Side", "locations": ["East Village"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Lisha Arino"], "text": "11 Ways to Celebrate Halloween in the East Village and the Lower East Side By Lisha Arino | October 19, 2015 7:13pm View Full Caption Flickr / istolethetv \nLOWER EAST SIDE — There’s more than one way to enjoy Halloween in the neighborhood, ranging from fun, family-friendly activities to events better suited for adults who like a good scare. \nHere are a few events taking place in the neighborhood the week of Halloween. \nWhen: Through Oct. 31, various times \nWhere: Clemente Soto Velez Cultural and Educational Center, 107 Suffolk St. \nDubbed the “most terrifying theater festival,” Nightmare Horror Show features seven mini-horror theatrical productions created by Psycho Clan, the artistic team behind the Nightmare haunted house. Tickets start at $25. \n► Tompkins Square Park Dog Parade \nWhen: Oct. 24, from noon to 3 p.m. \nWhere: Tompkins Square Park Dog Run in Tompkins Square Park on East 9th Street between Avenues A and B. \nHundreds of dressed-up dogs are expected to strut their stuff for thousands of dollars in prizes, including an Apple iWatch for the “Best in Show” winner and gift cards and Broadway tickets for two first-prize winners. To enter, owners are asked to pay a $5 suggested raffle ticket purchase. \nWhen: Oct. 24, Oct. 31 and Nov. 1 at 3 p.m. \nWhere: Clemente Soto Velez Cultural and Educational Center, 107 Suffolk St. \nThe family-friendly comedy produced by Teatro Sea tells the story of a boy dealing with the loss of his grandfather, who returns on the eve of Day of the Dead for an evening of adventures that help Jimmy gain self-confidence. Adult tickets are $20 and children’s tickets are $10. \n► Classic Horror Films at Local Theaters \nTwo neighborhood theaters are screening classic horror and thriller flicks just before or on Halloween. \nWhen: Oct. 30 and 31, midnight \nWhere: Landmark Sunshine Cinema, 143 E. Houston St. \nWhatever you do, don’t fall asleep — or you might miss Sunshine Cinema’s midnight screenings of the Wes Craven classic “Nightmare on Elm Street.” Tickets are $10 each. \nWhen: Oct. 29, 8 p.m. \nWhere: Village East Cinema, 181-189 Second Ave. \nVillage East Cinema wraps up its month-long “Hitchcock-tober” series with a screening of the acclaimed auteur’s “Rear Window,” starring James Stewart and Grace Kelly. Tickets are $10. \n► Trick-or-Treating at Neighborhood Businesses \nWhen: Oct. 31, various times \nWhere: Various locations \nNeighborhood children can trick-or-treat at various locations in the neighborhood, including Economy Candy at 108 Rivington St., which will continue its annual Halloween tradition of handing out candy outside its store from noon to 2 to 5:30 p.m. \nThe Sweet Life, located at 63 Hester St., will also give away Halloween candy outside its store from 3 to 6 p.m. on Oct. 31. \nWhen: Oct. 31, various times \nWhere: La Plaza Cultural Community Garden, East 9th Street and Avenue C \nThe community garden will host two events on Halloween for neighborhood children. From 4 to 5 p.m. kids can hear stories from the garden’s resident “witch” in the gazebo, decorated to look like a witch’s house. \nAt 5 p.m., the garden will host a “Ghostbusters”-themed party with a haunted maze, fortune-teller, themed “Laboratory of Horror” and garden members dressed up as the ghost-catchers. \n► Public Library Film Screenings", "external_links": [], "published": "2015-10-20T02:13:00.000+03:00", "crawled": "2015-10-20T09:02:09.739+03:00", "highlightTitle": ""}