{"organizations": ["Netflix"], "uuid": "c8665ee4ce7e6f25e536d09db788ec08bcf80619", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.torontosun.com", "main_image": "http://storage.torontosun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297763128688_LARGE_BOX.jpg?quality=80&stmp=1445529648292&size=100x", "site_section": "http://www.torontosun.com/entertainment/rss.xml", "section_title": "Top Entertainment stories", "url": "http://www.torontosun.com/2015/10/22/rock-the-kasbah-review-bill-murray-cant-save-afghan-war-comedy", "country": "CA", "title": "'Rock The Kasbah' review: Bill Murray can't save Afghan war comedy [Video]", "performance_score": 0, "site": "torontosun.com", "participants_count": 0, "title_full": "'Rock The Kasbah' review: Bill Murray can't save Afghan war comedy [Video]", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T18:54:00.000+03:00", "replies_count": 0, "uuid": "c8665ee4ce7e6f25e536d09db788ec08bcf80619"}, "author": "", "url": "http://www.torontosun.com/2015/10/22/rock-the-kasbah-review-bill-murray-cant-save-afghan-war-comedy", "ord_in_thread": 0, "title": "'Rock The Kasbah' review: Bill Murray can't save Afghan war comedy [Video]", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Bill Murray"], "text": "Bill Murray Christmas special headed to Netflix \nBill Murray’s immediate post-SNL career was so long ago, people tend to forget how many of his hit comedies consisted of him riffing his way through paper-thin plots. \nStripes, Caddyshack and Meatballs. Aaaand action! Okay Bill, give us some attitude. Sing like a lounge lizard. Give someone a noogie. Make hilarity ensue. He could hold a movie together just by sassing The Man in scene after scene. It was of its time, and it worked. \nThe Bill Murray of 2015 is a different beast, someone who can add sad-eyed pathos and dry sarcasm to a good script (Lost in Translation, Moonrise Kingdom, St. Vincent). \nHow times have changed becomes clear when you see him go retro in the weirdly-conceived Rock the Kasbah – a paper-thin war movie Murray attempts to hold together with comic riffs, wisecracks and, yes, lounge-lizardy singing breaks. That it trivializes the tragedy of the U.S. involvement in Afghanistan makes it even more bizarre. \nBeyond that, it’s a movie that’s half-over before it tells us what it’s really about. \nIn Rock the Kasbah, Murray plays Richie Lanz, a shyster West Coast “rock promoter” whose biography-of-lies includes masterminding the careers of the likes of Jimi Hendrix, Fleetwood Mac and Madonna. The spiel is the grease he uses to con talentless people into giving him money (and to keep his last remaining real client, played by Zooey Deschanel, on board on the promise of stardom). \nIn a beyond-improbable series of events, a drunk military officer checks her out in a cheesy lounge and offers the two of them a trip to Kabul for a USO show. \nFrom that point on, Rock the Kasbah (a title born of Richie’s geographical confusion, there are no “Kasbahs” in Afghanistan) becomes a parade of comic relief characters. \nThere’s a couple of crooked, pot-smoking, hard-partying munitions dealers (Danny McBride and Scott Caan), a mercenary named Bombay Brian (Bruce Willis) who aims to kill Richie after the agent is robbed and abandoned by his talent and saddled with a debt. \nAnd there’s that hoary trope, the hooker-with-a-heart-of-gold. Merci (Kate Hudson) gives our double-talking hero the time of his life in exchange for a watch, and is his co-conspirator in the movie’s subsequent events. \nAre we there yet? Nope. It’s only after a botched arms exchange in the desert with a Pashtun warlord that we meet Salima (Leem Lubany) a girl in a niqab with a song in her heart. Her dream is to be the first woman to compete on Afghan Star (a real-life talent show that is Afghanistan’s answer to American Idol, and whose participants risk death at the hands of the Taliban). \nSalima represents, of course, Richie’s redemption. \nDespite the fact that it takes place in the present, Rock the Kasbah is oddly anachronistic. Barry Levinson – once a director of classic comedies – seems unfamiliar with contemporary pop culture. Like Richie, his movie is out-of-time, awash in ‘70s references (Salima wins over the crowd singing Cat Stevens songs in English). When Richie breaks into song, it’s a mangled-lyric rendition of Smoke on the Water. \nWhat Levinson has created is the equivalent of putting 1970s Bill Murray in a coma, and waking him up to make a comedy in 2015. That would be wrong. And so is Rock the Kasbah. \nTwitter: @jimslotek", "external_links": [], "published": "2015-10-22T18:54:00.000+03:00", "crawled": "2015-10-22T19:38:34.660+03:00", "highlightTitle": ""}