{"organizations": [], "uuid": "2cf44803b2456380290d1e4d6f28af2d79cdae1d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usatoday.com", "main_image": "http://www.gannett-cdn.com/-mm-/2e825422d99b065043d645d903d6d93366701d6d/c=0-185-3600-2219&amp;r=x633&amp;c=1600x630/local/-/media/2015/10/26/USATODAY/USATODAY/635814461713169273-TWD-603-GP-0602-0282gn.jpg", "site_section": "http://rssfeeds.king5.com/_/20/109190022/king5/entertainment", "section_title": "KING 5 - Entertainment", "url": "http://www.usatoday.com/story/life/entertainthis/2015/10/26/the-walking-dead-season-6-episode-3-thank-you-death/74615180/", "country": "US", "title": "Did 'The Walking Dead' actually kill (Spoiler)?", "performance_score": 0, "site": "usatoday.com", "participants_count": 0, "title_full": "Did 'The Walking Dead' actually kill (Spoiler)?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T15:33:00.000+02:00", "replies_count": 0, "uuid": "2cf44803b2456380290d1e4d6f28af2d79cdae1d"}, "author": "", "url": "http://www.usatoday.com/story/life/entertainthis/2015/10/26/the-walking-dead-season-6-episode-3-thank-you-death/74615180/", "ord_in_thread": 0, "title": "Did 'The Walking Dead' actually kill (Spoiler)?", "locations": ["USA"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kelly Lawler"], "text": "Did 'The Walking Dead' actually kill (Spoiler)? Kelly Lawler , USA TODAY 9:33 a.m. EDT October 26, 2015 Spoiler alert! The following contains massive spoiler for The Walking Dead season 6 episode 3. Do not keep reading if you haven't seen it. Seriously. The spoilers start after this picture of Walkers trying to say hi to you. \nDo not keep reading if you haven't watched this episode. (Photo: Gene Page, AMC) \nWhat. Just. Happened. \nNo seriously, what actually happened on The Walking Dead Sunday night? The episode, which was all about survival in one way or another , gave us one of the most ambiguous (and disgusting) death scenes in awhile. When Nicholas shot himself in the head and he and Glenn toppled into a waiting mob of walkers, that was the end for our fair Glenn wasn't it? Well, wasn't it? \nMaybe, but maybe not. \nThe scene is raising eyebrows among fans and critics alike who are just not convinced that Glenn was actually killed. There are just a few too many hokey things going on here for this to be a standard dead-and-gone situation. And to be honest, the evidence is actually pretty convincing. Let's lay it out. 1. The death scene was shot ambiguously and occurred at a weird moment in the episode \nThis, potentially, is the strongest evidence that Glenn is still alive. There was some seriously shady camera work going on as Glenn and Nicholas fell into the walkers and they started tearing ... someone apart. It was impossible to tell from the camera angles if it was Nicholas's body or Glenn's that they were getting at, and it looked to us like Nicholas was falling on top of Glenn, but we didn't necessarily see where he landed. All of this seems very, very pointed. \nIn addition, this scene took place with a solid 10 minutes left in the episode. Traditionally, in most TV storytelling, not just The Walking Dead , these huge developments are held until the final seconds of the episode -- think Ned Stark on Game of Thrones or any number of previous deaths on Dead . Cutting from Glenn's supposed demise to Michonne, Heath and a random Alexandrian is not an arc that gives any particular emotional weight to the death. It's almost as if the show didn't want you to feel anything. 2. Fans have potentially spotted Steven Yeun on set Imgur \nCall it Jon Snow syndrome. Intrepid Walking Dead fans have gotten some spy shots of the show filming that seem to indicate that Yeun is around on set after this episode. Now these photos have to be taken with a grain of salt, because they're a little sketchy and we don't actually know what date they were taken or if that's Yeun at all. And even if he is there, he might be filming a flashback or just saying hi. But barring measuring the length of his hair, it's what we've got. 3. This does not happen in the comics \nIf you don't want any potentially spoilers from the comics, skip this point. But if you do, it's worth noting that Glenn does NOT die this way in the books. Unfortunately, he does die, but it's a really big moment that occurs later (but still kind of soon). In the comics a new villain named Negan kills Glenn by, um, bashing his head in with a barbed-wire-covered baseball bat named Lucille (the comics are just as cheerful as the show). It's a pretty big moment in the comics, occurring in the 100th issue. \nValidly, the show has veered significantly away from its source material (for instance, in the comics Carol is long dead, Andrea is alive and Darryl doesn't exist), but this moment is so iconic in the series, it might be hard to pass up. 4. The show has been unwillingly to kill season 1 characters lately \nWhen was the last time the show killed off members of the original crew? While plenty of new members of the gang (and even more redshirts) have died in the past few seasons, it's been awhile since we lost one of the characters who originated in season one. Now that might just be setting us up for a huge death (like Glenn's) but, considering on how the episode harped on the idea of survival, it also might be an indication that the show is trying to say that what's left of the original crew are the best survivors. \nBut to be honest, all of this could just be misdirection on the part of the show, taunting us and giving us a week to revel in the denial stage of our grief. \nAll we can say for sure is that if Glenn is really 100% for sure dead, this is will be us for the rest of the year: \nRIP Glenn ... maybe. Read or Share this story: http://usat.ly/1S63uuH Most Popular", "external_links": [], "published": "2015-10-26T15:33:00.000+02:00", "crawled": "2015-10-26T17:59:25.455+02:00", "highlightTitle": ""}