{"organizations": [], "uuid": "f9b3680ca0cf9590214c82be426da2aa6d1e3ea0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "lubbockonline.com", "main_image": "http://lubbockonline.com/sites/default/files/14771916.jpg", "site_section": "http://lubbockonline.com/taxonomy/term/8/2/feed", "section_title": "Entertainment", "url": "http://lubbockonline.com/filed-online/2015-10-01/buckcherry-out-show-rock-n-roll-alive-and-well", "country": "US", "title": "Buckcherry is out to show 'Rock n' Roll' is alive and well", "performance_score": 0, "site": "lubbockonline.com", "participants_count": 1, "title_full": "Buckcherry is out to show 'Rock n' Roll' is alive and well", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T00:10:00.000+03:00", "replies_count": 0, "uuid": "f9b3680ca0cf9590214c82be426da2aa6d1e3ea0"}, "author": "ERIC WOODS FOR A-J MEDIA", "url": "http://lubbockonline.com/filed-online/2015-10-01/buckcherry-out-show-rock-n-roll-alive-and-well", "ord_in_thread": 0, "title": "Buckcherry is out to show 'Rock n' Roll' is alive and well", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Buckcherry is out to show 'Rock n' Roll' is alive and well Band performs Wednesday at Jake's Posted: October 1, 2015 - 4:10pm Photos Provided by Buckcherry Buckcherry is scheduled to bring its brand of rock to Jake's Cafe and Backroom at 7 p.m. Wednesday. By ERIC WOODS FOR A-J MEDIA \nBuckcherry is out to show ‘Rock N Roll’ is alive and well \nThe name of the album is simple and to the point, but it is also a statement to those who think rock ’n’ roll is dead. \n“Rock N Roll” is Buckcherry’s take on the music scene today. \nAccording to Buckcherry frontman Keith Nelson, rock is alive and well, but living somewhere other that where it used to. \nBuckcherry is scheduled to perform at 7 p.m. Wednesday at Jake’s Sports Café and Backroom, 5025 50th St. \n“People have been saying rock is dead for awhile,” said Nelson. “There are some pretty well-known musicians who have been going on about how rock is dead. I just think it is live and well because we go out every night and the house is full of people wanting to hear rock ’n’ roll. This is just our way of planting the flag and saying we are here and we are a rock band.” \nNelson said rock fans exist, and they are in just about every town in America. \nBut the biggest selling artists in the United States aren’t rock bands, Nelson said. “At the top of the charts are pop artists and hip-hop artists. I think they are missing the point because people are coming out everywhere except for L.A. and New York to enjoy music. We tour all over the country and in all of these towns, people still want to rock.” \nNelson said it’s no surprise that rock fans are looking to downloaded music and to independent artists for their music. The important thing for rock ’n’ roll to stay alive is for the fans to hear the music any way they can, he said. \n“I think music and the way it is consumed has been changing for awhile now,” he said. “That’s not news to anybody. I think a lot of people stream music now instead of buying it and I’m all for it, as long as they are getting it and enjoying it.” \nSince Buckcherry has a large arsenal of songs to choose from, the band has no problem pleasing their fans with both old and new hits. The real issue is not being able to play all of them in one night. \n“We have seven albums to choose from now, so the set list is ever evolving,” said Nelson. “Every night it is a new set list and we are playing stuff off of the new record and off of every record. Actually it’s an interesting set list. No matter what we play fans still say they want to hear this or that. We can’t play them all, but we try to mix it up, and really have fun with it.” \nNelson said the band has been performing in Lubbock for the last several years, and they always enjoy coming to the Hub City for another live performance. \n“Lubbock is such a great rock town and the people keep showing up, and it feels really good to be there. It is a rock town for sure. We are definitely excited about getting back to Lubbock, Texas.” In Concert", "external_links": [], "published": "2015-10-02T00:10:00.000+03:00", "crawled": "2015-10-02T00:22:50.541+03:00", "highlightTitle": ""}