{"organizations": [], "uuid": "3326c17650ee5ad41dd5e2780f6409b50fd50803", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48524/c", "section_title": "Entertainment - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30172439/simply-color-lab-welcomes-shootq-to-their-team", "country": "US", "title": "Simply Color Lab Welcomes ShootQ to their Team", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Simply Color Lab Welcomes ShootQ to their Team - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "3326c17650ee5ad41dd5e2780f6409b50fd50803"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30172439/simply-color-lab-welcomes-shootq-to-their-team", "ord_in_thread": 0, "title": "Simply Color Lab Welcomes ShootQ to their Team", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Simply Color Lab\nAKRON, Ohio , Oct. 2, 2015 /PRNewswire/ -- Simply Color Lab, one of the nation's top professional photography printers, recently welcomed ShootQ and their staff to the Simply Color team.\n\"We are very excited to bring a top name like ShootQ into the Simply Color Lab family!\"\n- Adam Fried , CEO Simply Color Industries\nThe acquisition positions ShootQ as the only lab-owned business management software available. ShootQ is a complete studio management system made especially for photographers, by photographers. Simply Color Lab will maintain the ShootQ staff that its users have grown to know and love, and work quickly to make updates and improvements to the product.\n\"Joining forces with Simply Color Lab will allow us to give our clients the kind of innovative software development they have been asking for. I am excited for what the future holds for ShootQ!\"\n- Katie Van Buren Glymin , Product Manager ShootQ\nWith the addition of ShootQ, Simply Color Lab can now offer ShootQ subscribers not only a quality management program that will create more efficient and convenient business practices, but also substantial Simply Color Lab product discounts and exclusive ShootQ loyalty programs. Being lab-owned allows ShootQ subscribers to take advantage of a collaboration that will further simplify the professional photographer's life.\nAs a virtual management software, ShootQ assists its professional photography partners in every step of their business. From tracking prospective clients, contract and payment management, to client product delivery, ShootQ keeps a photographer's workflow organized so that they can spend more time doing what they love - being creative!\n\"As a Simply Color and ShootQ customer for many years, I couldn't be more excited that they have now joined forces! Simply Color has always been the leader in bringing new and trendsetting products to our industry, and by pairing with ShootQ, I can't wait to see how Simply Color will modernize this process and make an already fantastic organizational and booking software even better!\"\n- Nicki Hufford , Photographer, Owner, Nicki Hufford Photography\nTop features of ShootQ's all-in-one software include: invoices, contracts and questionnaires that can all be sent and received electronically, client and lead management, schedule management, and the ability to automate scheduled emails as part of a shoot's workflow. As a bonus, ShootQ integrates nicely with products photographers are already using, like Paypal, Pro Select, and a new integration with ShootProof, an interactive soft proofing site that allows for photo proofing and sales.\n\"I look forward to carrying ShootQ's commitment to excellence forward and bringing innovation that will benefit our customers.\"\n- Jeremy Jones , Software Architect ShootQ\nTo find out more about ShootQ and Simply Color Lab, visit www.ShootQ.com and www.SimplyColorLab.com .\n releases/simply-color-lab-welcomes-shootq-to-their-team-300153366.html\n ", "external_links": ["http://www.simplycolorlab.com/", "http://rt.prnewswire.com/rt.gif?NewsItemId=CL17651&Transmission_Id=201510021204PR_NEWS_USPR_____CL17651&DateId=20151002", "http://www.shootq.com/", "http://www.xmlnews.org/ns/", "http://www.prnewswire.com/news-releases/simply-color-lab-welcomes-shootq-to-their-team-300153366.html"], "published": "2015-10-02T03:00:00.000+03:00", "crawled": "2015-10-03T05:27:43.536+03:00", "highlightTitle": ""}