{"organizations": [], "uuid": "98a73dfa0e02b189bcadebe31b78f036d6887944", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.democratandchronicle.com", "main_image": "http://www.gannett-cdn.com/-mm-/f1d7efd117ad8b629c8fb52e1efd659043f41960/c=0-205-534-507&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/13/Rochester/Rochester/635803280766098942-635802869445547283-Tammy-and-Micheal-1-2-.jpg", "site_section": "http://www.democratandchronicle.com/", "section_title": "Democrat and Chronicle | Rochester news, community, entertainment, yellow pages and classifieds. Serving Rochester, New York | democratandchronicle.com", "url": "http://www.democratandchronicle.com/story/news/2015/10/13/widow-files-suit-after-husband-dies-twice/73855710", "country": "US", "title": "Husband declared dead twice; wife sues", "performance_score": 0, "site": "democratandchronicle.com", "participants_count": 1, "title_full": "Husband declared dead twice; wife sues", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T15:05:00.000+03:00", "replies_count": 0, "uuid": "98a73dfa0e02b189bcadebe31b78f036d6887944"}, "author": "democratandchronicle.com", "url": "http://www.democratandchronicle.com/story/news/2015/10/13/widow-files-suit-after-husband-dies-twice/73855710", "ord_in_thread": 0, "title": "Husband declared dead twice; wife sues", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Michael Cleveland was visibly breathing. His eyes were open. He was kicking his legs, raising his knees and fighting with a tube in his throat. Was he alive? The doctor said no, but it turns out he was wrong.\nA year ago this week, Cleveland died once — but was pronounced dead twice — at DeGraff Memorial Hospital near Buffalo after suffering a heart attack at a Tops grocery store. According to a lawsuit by his widow, a doctor there erroneously declared him dead then ignored his family's pleas for help for nearly two hours as Cleveland fought for air through a punctured lung.\nThree times, Dr. Gregory Perry and nurses assured Tammy Cleveland, of Webster, that her husband was in fact dead and that he just \"had a lot of energy to expel from his body,\" according to a lawsuit filed by Cleveland earlier this year.\n\"A part of me was thinking, '(the doctor) should know what he's doing better than me,'\" she said. \"But he kept showing more and more signs, so we just kept trying to get help.\"\n\"The doctor told me that it would appear like he was breathing, but he really wasn't,\" Tammy Cleveland said. \"I said, 'But he's responding to me. ... He (tried) to hug me.' \"\nTwice, the coroner entered the hospital room to conduct a postmortem examination, but told the doctor to call him back when Cleveland had died.\n\"My son and I walked in the room and looked at him and said, 'This guy is definitely not dead,' \" said Lynn Ferrera, Tammy Cleveland's father. \"I've seen dead bodies before, and this wasn't it.\"\nAccording to the lawsuit, it was not until the fourth time Perry came into the room that he finally checked the 46-year-old man's vital signs and concluded: \"My God, he has a pulse!\"\nBy then, 100 minutes had elapsed since the premature declaration of death.\nCleveland was then taken overnight to Buffalo General Medical Center for further care. In the ambulance on the way there, Michael Cleveland was responsive and moving his arms and legs. He tried to hold a paramedic's hand.\nUpon examination there, Dr. William Morris concluded that Cleveland's life was threatened not by the heart attack but by respiratory struggles owing to a collapsed lung. While getting CPR immediately after the heart attack, Cleveland had suffered several broken ribs and one apparently punctured his lung.\nTammy Cleveland said Morris told her that her husband likely would have lived if the collapsed lung had been treated sooner. Instead, he died later that morning.\nThe family is seeking damages from both doctors and hospitals. The lawsuit, filed by attorney Charles Burkwit, alleges their actions \"transcend the bounds of human decency and constitute shocking and outrageous conduct.\"\nKaleida Health, which owns both hospitals, would not comment on the case. In the responses to the lawsuit, their lawyers denied the charges and asked a judge to dismiss the case due to procedural flaws.\nThe Clevelands had been together since 2001 and married in 2009. Michael Cleveland leaves behind a 14-year-old son from a previous relationship.\nHe worked in customer relations, his wife said, and the couple was planning a move to Webster from the Buffalo area at the time of the incident. He was originally from Pennsylvania.\n\"He was brilliant,\" she said. \"He was someone you could talk to on any subject. He treated me like gold; he never let me worry about anything.\"\nHer primary motive is to make sure the same thing doesn't happen to someone else, and to have an apology from Perry.\n\"I wonder if he's having nightmares like I am,\" she said. \"He's got to have some kind of a conscience. I just want him to be sorry for what he did and not do it to anyone else again.\"\nJMURPHY7@Gannett.com\nIncludes reporting from Kelly Dudzik of WGRZ-TV in Buffalo.", "external_links": ["https://www.scribd.com/embeds/284770817/content", "https://www.scribd.com/doc/284771776/Michael-Cleveland-lawsuit", "https://www.scribd.com/javascripts/embed_code/inject.js"], "published": "2015-10-13T15:05:00.000+03:00", "crawled": "2015-10-14T06:23:03.210+03:00", "highlightTitle": ""}