{"organizations": [], "uuid": "1b71724a7c78f3994d7e5346606fc1ca876d62e8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.arcamax.com", "main_image": "http://www.arcamax.com/newspics/132/13217/1321727.jpg", "site_section": "http://www.arcamax.com/", "section_title": "News &amp; Entertainment by Email | ArcaMax Publishing", "url": "http://www.arcamax.com/currentnews/newsheadlines/s-1738987?fs", "country": "US", "title": "At Jerusalem landmark, Palestinians, Jews and a kitchen full of knives | & Features", "performance_score": 0, "site": "arcamax.com", "participants_count": 1, "title_full": "At Jerusalem landmark, Palestinians, Jews and a kitchen full of knives | News & Features | ArcaMax Publishing", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "1b71724a7c78f3994d7e5346606fc1ca876d62e8"}, "author": "arcamax.com", "url": "http://www.arcamax.com/currentnews/newsheadlines/s-1738987?fs", "ord_in_thread": 0, "title": "At Jerusalem landmark, Palestinians, Jews and a kitchen full of knives | & Features", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "JERUSALEM -- In a hot kitchen in Jerusalem's bustling vegetable market, Omar Abu Sbitan took a break from washing knives and forks to check the constant stream of notifications on his phone.\n\"We are under occupation. It's not normal,\" said Abu Sbitan, 17, a baby-faced Palestinian from the Mount of Olives neighborhood near Jerusalem's Old City. \"They just closed a road in Hebron.\"\n\"Where are the grape leaves?\" demanded waitress Natalie Geva, 23, from the Rahavia quarter in west Jerusalem.\nAzura restaurant, founded in 1952, is a Jerusalem landmark that reflects the city's chaotic charm: colorful, aromatic Kurdish stews bubble in battered wide aluminum pots, teetering over undersized kerosene burners for hours.\nBut as the recent wave of violence has engulfed the city, the restaurant reveals Jerusalem's deeply interwoven character that both defies and encapsulates the frustrations of both Israelis and Palestinians.\nOn Wednesday, Moshe Shrefler, 39, the restaurant's owner, smoked Camel cigarettes at a vinyl-topped table. With few customers, the loudest noise came from two dozen old men playing backgammon and dominoes. Clientele has shriveled, and Shrefler said he's taken six dishes off the menu and cut back hours to adjust.\n\"The situation is not good,\" Shrefler said. \"People are not coming to the market.\"\nThis month Palestinians have killed seven Israelis in a string of stabbings and shootings; Israelis killed at least 31 Palestinians, including suspected assailants. To quell the violence, Israeli forces on Wednesday dragged roadblocks across the entrances to several east Jerusalem neighborhoods that have been hotbeds of violence.\nThe divisions belie a more complex reality. Two-thirds of Jerusalem's residents are Jewish Israelis; the other third are Palestinians who claim east Jerusalem, captured by Israel in the 1967 Six-Day War, as the capital of a future state. Although Israelis and Palestinians live in segregated neighborhoods, half of all employed Palestinians work in the western section of the city or in Israel, according to Marik Shtern, a researcher at the Jerusalem Institute for Israel Studies. The 35,000 Palestinian workers in the capital dominate the hotel and construction industries and comprise more than half of transportation workers.\nHagai Agmon-Snir, director of the Jerusalem Intercultural Center, which promotes civic engagement, said Israeli employers rely on Palestinians for inexpensive labor. Palestinians, separated from the West Bank by the Israeli-built separation barrier, depend for work on Israelis.\nAgmon-Snir recalled an Arab bus driver strike in 2014 sparked by a mysterious hanging of a Palestinian driver.\n\"Jerusalem collapsed in terms of transportation,\" he said.\nAt Azura, Palestinians do most of the cooking and cleaning. Waiters are young Israelis fresh from military service. Clientele ranges from local vegetable sellers to tourists to prime ministers.\n\"No Israelis will do the work Palestinians will do,\" Shrefler said. He said his cooks have worked with him for years.\nMosab Almator, 31, said he started working at Azura 15 years ago and trained with Shrefler's father, Ezra. Almator, from the Shuafat refugee camp, said he learned Hebrew while cooking. It took three years before he could roll the delicate semolina-encrusted meatball dumplings known as kubbeh, cooked in beet or zucchini stews.\nAlmator said Moshe Shrefler attended his wedding; Ezra came to his father's funeral. He said Palestinian employers had offered him work.\n\"I said no. Here I feel respect,\" Almator said.\nOthers in the kitchen had more conflicted loyalties. Abu Sbitan, the teenage dishwasher, said he sympathized with Palestinians who attacked Israelis.\n\"I am with them. Without them we will not liberate the homeland,\" he said, and turned back to washing forks and knives. \"I am satisfied with this job. The bosses are good.\"\nRami Frukh, 28, said he works in west Jerusalem because he could not find a job with equal pay at a Palestinian restaurant. He said Israeli security forces stopped him three times Tuesday as he took the train from his home in east Jerusalem to Azura.\n\"The third time the soldier was OK,\" Frukh said. \"He didn't keep me for 20 minutes.\"\nOutside, Israeli locksmith Eitan Ben-Aharon, 56, ate stewed cow lung and said he could not understand the Palestinians' anger.\n\"In Jerusalem, they are Israelis,\" Ben-Aharon said. \"They have the Israeli identity. They have all the rights, and still they throw stones.\"\nNatalie Geva, the waitress, said that as a Jew she felt uneasy walking to work recently. She said the restaurant atmosphere was mostly jovial, but she admitted there was tension. She said she interrogated the kitchen staff herself on Tuesday.\n\"Yesterday I went one by one and asked, 'Do you throw stones?' \" Geva said. \"Usually they say no, but I know who does it.\"\nShe said the kitchen workers told her about the searches they endured in Jerusalem.\n\"On the one hand, you say it's racist, and my fear is racist, too,\" she said. \"But on the other hand, there isn't really another way.\"\nShrefler said he often thought about the many knives in his kitchen as he worked. Many of the attacks have been stabbings.\n\"Every morning it's me and another Palestinian guy in the kitchen. Every day I turn my back to him and every day he turns his back to me,\" Shrefler said. \"And we are still alive.\"\n(Cheslow is a McClatchy special correspondent.)\n(c)2015 McClatchy Washington Bureau\nVisit the McClatchy Washington Bureau at www.mcclatchydc.com\nDistributed by Tribune Content Agency, LLC.\nShare Comment", "external_links": ["http://www.facebook.com/sharer.php?u=http://www.arcamax.com/currentnews/newsheadlines/s-1738987&h=At+Jerusalem+landmark%2C+Palestinians%2C+Jews+and+a+kitchen+full+of+knives", "http://twitter.com/share?url=http://www.arcamax.com/currentnews/newsheadlines/s-1738987&hashtags=ArcaMax", "https://plus.google.com/share?url=http://www.arcamax.com/currentnews/newsheadlines/s-1738987"], "published": "2015-10-16T03:00:00.000+03:00", "crawled": "2015-10-16T22:02:56.109+03:00", "highlightTitle": ""}