{"organizations": [], "uuid": "31c7580fcc5f37afe76951e0dd73858c554c23db", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-5616bd2f/turbine/sc-celebrity-nanny-family-1013-20151006", "site_section": "http://www.chicagotribune.com/", "section_title": "Chicago Tribune: Chicago breaking news, sports, business, entertainment, weather and traffic - Chicago Tribune", "url": "http://www.chicagotribune.com/lifestyles/sc-celebrity-nanny-family-1013-20151006-story.html", "country": "US", "title": "Infant do&apos;s and don&apos;ts from Cindy Crawford&apos;s baby nurse", "performance_score": 0, "site": "chicagotribune.com", "participants_count": 1, "title_full": "Infant do&apos;s and don&apos;ts from Cindy Crawford&apos;s baby nurse - Chicago Tribune", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T22:01:00.000+03:00", "replies_count": 0, "uuid": "31c7580fcc5f37afe76951e0dd73858c554c23db"}, "author": "Nara Schoenberg", "url": "http://www.chicagotribune.com/lifestyles/sc-celebrity-nanny-family-1013-20151006-story.html", "ord_in_thread": 0, "title": "Infant do&apos;s and don&apos;ts from Cindy Crawford&apos;s baby nurse", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "You may not be able to afford Cindy Crawford's former baby nurse, but you can still benefit from her advice.\nLuiza DeSouza began writing \"Eat Play Sleep: The Essential Guide to Your Baby's First 3 Months\" (Atria) after parents and nannies told her how much they liked the detailed baby journals she handed off to them when she left to care for a new baby. The information about the children's routines was really helpful, her readers said; maybe she should write a baby care manual.\nOver the course of years, the manual morphed into a book with everything from a list of what to pack for your trip to the hospital to tips on how to establish sleeping routines, and feeding and bathing basics; the book also includes real-life stories drawn from decades of experience.\nDeSouza has strong feelings about the importance of introducing very simple and flexible routines, interacting with your baby consistently and meaningfully, and avoiding bad habits rather than trying to break them.\n\"I believe in the internal clock; I believe in metabolism programming,\" she says. \"I believe if you have a routine, if you have order in the life of the baby, everything falls into place. It's just like us — if we get used to a certain bedtime, half an hour before (that) we get tired.\"\nIn the first days, she tries to make sure that babies eat enough at each feeding, which allows them to get proper nutrition and sleep longer. When babies can stay awake longer — often in the second week — she brings a little play into the routine, in the form of cuddling, massage and bathing. She also phases in a sleep routine that includes burping, swaddling, holding the baby upright to aid digestion, and putting her down in her crib while she's still awake.\n'Eat Play Sleep' Atria Books / HANDOUT \"Eat Play Sleep: The Essential Guide to Your Baby's First 3 Months\" by Luiza DeSouza. Cindy Crawford wrote the foreword. \"Eat Play Sleep: The Essential Guide to Your Baby's First 3 Months\" by Luiza DeSouza. Cindy Crawford wrote the foreword. (Atria Books / HANDOUT) But DeSouza doesn't put infants on schedules, and she's big on using common sense and responding to each child's unique situation and temperament.\n\"When the baby's colicky, when the baby's not feeling well, when they're in need, of course, as a baby nurse I get my babies and I cuddle them and I comfort them,\" she says. \"I don't leave them alone when they need me.\"\nAmong Luiza DeSouza's infant do's and don'ts:\n•Do wake up a breast-feeding newborn every three hours in the first few days, and a formula-fed newborn every 3 1/2 hours. He needs to eat frequently.\nDo wake a newborn who falls asleep before he's taken in enough milk or formula; you don't want him to become a \"snacker\" who wakes every 30 minutes.\nDon't get nervous when your newborn cries; you'll make her nervous too. Instead, try feeding her, talking to her and observing what triggers fussing.\nDo make sure your newborn gets enough sleep. Parents tend to keep newborns up because everyone wants to hold and rock them, but an overtired baby is a fussy baby.\nDon't let sick friends and relatives visit your newborn until they've recovered. Her immune system isn't fully developed yet, and she could get sick.\nDo start to establish a flexible routine (not a rigid schedule) in the first month. Once your baby is staying up for a while after feeding, spend some time interacting.\nDo repeat the eat-play-sleep routine throughout the day; maybe every three hours or so.\nDon't let your baby get into the habit of falling asleep in your arms. If she begins to fuss when you put her in the crib, don't \"rescue\" her immediately. If she actually cries, try to calm her in the crib before picking her up or giving her a pacifier. Stay calm, hold her if necessary until she calms down, and try putting her down again.\nDo consider a pacifier. There are different views on the topic, and DeSouza honors the wishes of her clients, but she finds pacifiers soothe babies, and the habit is easier to break than thumb-sucking. DeSouza typically introduces the pacifier in the second week, once breast-feeding is going well.\nDon't lose your perspective. If your infant is having trouble with sleeping, breastfeeding or indigestion, it's not going to last forever.\nnschoenberg@tribpub.com\nTwitter @nschoenberg\n ", "external_links": ["http://www.trbimg.com/img-5616bd2f/turbine/sc-celebrity-nanny-family-1013-20151006", "http://www.trbimg.com/img-5616bce8/turbine/ct-celeb-1-jpg-20150930"], "published": "2015-10-08T22:01:00.000+03:00", "crawled": "2015-10-09T00:52:56.453+03:00", "highlightTitle": ""}