{"organizations": [], "uuid": "6d41d4d67812425b619a3dc1f71a5c5d2a7db2d7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://images.canberratimes.com.au/2015/10/06/6904733/Thumbnail1001019357gjzbcdimage.related.thumbnail.320x214.gjzbh9.png1444346629278.jpg.jpg", "site_section": "http://feeds.canberratimes.com.au/rssheadlines/entertainment.xml#", "section_title": "Canberra Times Entertainment Headlines", "url": "http://www.canberratimes.com.au/entertainment/books/books-that-changed-me-tara-lal-20151006-gjzbh9.html", "country": "AU", "title": "Books that changed me: Tara Lal", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "Books that changed me: Tara Lal", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T16:15:00.000+03:00", "replies_count": 0, "uuid": "6d41d4d67812425b619a3dc1f71a5c5d2a7db2d7"}, "author": "canberratimes.com.au", "url": "http://www.canberratimes.com.au/entertainment/books/books-that-changed-me-tara-lal-20151006-gjzbh9.html", "ord_in_thread": 0, "title": "Books that changed me: Tara Lal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Author Tara Lal. \nTara Lal is a firefighter in Sydney trained in suicide prevention, mental health, first aid and crisis intervention. She is also a registered physiotherapist. Tara's first book, Standing On My Brother's Shoulders (Watkins), is a memoir written as a dialogue with her late brother, who suffered from depression.\nThe Road Less Travelled\nM. Scott Peck \nWhen I first started reading this book, it was a case of right book,  wrong time. I read the first few chapters and all I took from it was that if you didn't have two loving parents throughout your childhood you were pretty much stuffed. Two years later I picked it up again and found something completely different. It taught me many things, but most profoundly it showed me what love is and what it is not.\nMan's Search for Meaning \nViktor Frankl \nAdvertisement This was most definitely right time, right book. I was 43 and facing childlessness. Everyone around me seemed to find their meaning through their children. I'd finished writing my book, had faced multiple rejections and found myself wondering where I was going and why. A friend gave me this book and the answer shone through in neon lights. My meaning was my book – to help others through sharing my story and my brother's. \nBallet Shoes\nNoel Streatfeild​ \nI loved everything about Gum and the unconventional family of fossils he created. I wished often that someone would put me in a bag and take me away, just like Gum did. The book took me to a place of love and belonging. When I was a kid, I did ballet lessons but I always felt big, awkward and unco-ordinated, so I dreamed of being like Posy, graceful and feminine. I still love ballet even though I'm a muscle-clad firefighter.\nThe Dance of Anger\nHarriet Lerner \nI always hated anger. Instead of shouting, I cried. It frustrated me, but I never thought it was a problem. Then I read this book and I saw all my patterns as if the author had just taken an unruly pile of sticks and neatly ordered them for me. I cried when angry so that I would be comforted. That way no one left me. They also never heard me. Now, I joyfully shout and express my anger in all its magnificent colour!", "external_links": [], "published": "2015-10-10T16:15:00.000+03:00", "crawled": "2015-10-10T19:51:21.205+03:00", "highlightTitle": ""}