{"organizations": ["Lily Bar & Lounge VIP"], "uuid": "ede4eb0e50bf6cd1b8607b5fe594eb0c9114585c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "lasvegasmagazine.com", "main_image": "", "site_section": "http://www.lasvegassun.com/feeds/headlines/ae/", "section_title": "Las Vegas Sun Stories: Arts & Entertainment", "url": "http://lasvegasmagazine.com/interviews/friends-with-benefits/2015/oct/16/friends-with-benefits-lily-bar-lounge-bellagio/", "country": "CR", "title": "Lily Bar & Lounge VIP cocktail hostess makes every delivery fulfilling", "performance_score": 0, "site": "lasvegasmagazine.com", "participants_count": 0, "title_full": "Lily Bar & Lounge VIP cocktail hostess makes every delivery fulfilling", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T10:00:00.000+03:00", "replies_count": 0, "uuid": "ede4eb0e50bf6cd1b8607b5fe594eb0c9114585c"}, "author": "", "url": "http://lasvegasmagazine.com/interviews/friends-with-benefits/2015/oct/16/friends-with-benefits-lily-bar-lounge-bellagio/", "ord_in_thread": 0, "title": "Lily Bar & Lounge VIP cocktail hostess makes every delivery fulfilling", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kiko Miyasato"], "text": "Lily Bar & Lounge VIP cocktail hostess makes every delivery fulfilling By Kiko Miyasato October 16, 2015 \nCharm and southern hospitality are two things that define Michelle Moya, VIP cocktail hostess at Lily Bar & Lounge at Bellagio. \n“I had one of the most memorable compliments from a guest—they said I have a naturally engaging energy,” said the Austin, Texas native. “That made a big impact on me.” With Moya’s qualities it’s no surprise that she works in an industry that caters to the guest experience. And for Moya, Lily is a must-try. \nThe intimate, upscale space is both beautiful and welcoming, and the cocktail list is quite impressive. “It’s a beautiful list of cocktails,” Moya said. “You can’t just try one.” She said she loves guiding her guests through Lily’s cocktail offerings, but she’s also a great source of knowledge for guests wanting to explore what else the city offers, too. “I love to give show, restaurant and nightclub recommendations,” she said. With five years of living in this city, Moya is fully versed in all things Vegas. And, she makes sure to give back to the city that she loves. Photo: Christopher DeVargas The Heat of the Moment \n“I wanted to get involved in the community I was living in,” she explained. For the past few years, Moya has volunteered several days a week at Helping Hands of Vegas Valley, a nonprofit that offers services to seniors; she also volunteers for the Three Square food bank. \n“Volunteering and working with charities is very rewarding,” she said. It seems whether at work or on her personal time, Moya’s congeniality never wavers. \nHeat of the Moment \nWhile Lily does offer bottle service, what you’ll want to make sure to check out is the lounge’s cocktails. The selection from both the signature and classic cocktails list won’t disappoint. One of the best tequila cocktails ever concocted (seriously!) is The Heat of the Moment. Served martini-style, it mixes Patron silver tequila, passion fruit purée, fresh-squeezed lime juice, agave nectar and red jalapeño chili peppers; it’s finished with a cinnamon sugar rim. More to Read", "external_links": [], "published": "2015-10-16T10:00:00.000+03:00", "crawled": "2015-10-16T10:17:03.458+03:00", "highlightTitle": ""}