{"organizations": [], "uuid": "1c31d65f297943ee55e394722db72f0db36fe3e0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.syracuse.com", "main_image": "http://imgick.syracuse.com/home/syr-media/width620/img/entertainment_impact/photo/18998075-standard.jpg", "site_section": "http://impact.syracuse.com/entertainment/atom.xml", "section_title": "Central NY Entertainment", "url": "http://www.syracuse.com/entertainment/index.ssf/2015/10/bill_cosby_suffers_series_of_setbacks_in_sex_assault_cases.html", "country": "US", "title": "Bill Cosby suffers series of setbacks in sex assault cases", "performance_score": 0, "site": "syracuse.com", "participants_count": 1, "title_full": "Bill Cosby suffers series of setbacks in sex assault cases", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T21:45:00.000+03:00", "replies_count": 0, "uuid": "1c31d65f297943ee55e394722db72f0db36fe3e0"}, "author": "The Associated Press", "url": "http://www.syracuse.com/entertainment/index.ssf/2015/10/bill_cosby_suffers_series_of_setbacks_in_sex_assault_cases.html", "ord_in_thread": 0, "title": "Bill Cosby suffers series of setbacks in sex assault cases", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bill Cosby suffers series of setbacks in sex assault cases Bill Cosby In this Jan. 17, 2015, file photo, comedian Bill Cosby salutes the crowd as he begins a performance at the Buell Theater in Denver. (Brennan Linsley | The Associated Press) Comments \nBOSTON (AP) — In both the court of law and the court of public opinion, the case is growing against Bill Cosby. \nA year after allegations of sexual assault resurfaced and snowballed, women who've accused him of sexual assault are giving emotional interviews en masse, judges are ruling against him and colleges are continuing to revoke honorary degrees bestowed upon him when he was one of the country's most admired entertainers. \nCosby, 78, now faces five separate lawsuits, including one filed last week by a woman who says Cosby repeatedly sexually assaulted her beginning when she was 16. Earlier this month, a judge in California refused to throw out a lawsuit filed by a woman who accuses Cosby of molesting her when she was 15. Days later, a federal judge in Massachusetts rejected Cosby's bid to dismiss a defamation lawsuit brought by three women who've accused him of sexually abusing them decades ago. He spent a day being deposed in Boston in connection with a lawsuit by attorney Gloria Allred. And more depositions are likely in the weeks ahead. \nIf that weren't enough, 27 of the women who say Cosby sexually assaulted them were interviewed together on \"Dateline NBC.\" Ebony magazine ran a cover with a photo of \"The Cosby Show\" cast under broken glass. And at least three more universities rescinded honorary degrees in the past week. \nTufts University in Massachusetts delivered a double blow, withdrawing both an honorary doctorate of arts and an award for excellence in children's media, saying Cosby has \"demonstrated a lack of character and integrity.\" It joined a growing list of schools — including Fordham, Marquette and Brown University — that have sought to erase any affiliation with Cosby. \nAll this comes after a year of Cosby and his attorneys denying or refusing to comment as dozens of women went public with stories of sexual assault dating back to the 1960s. Cosby, a comedian and actor who first rose to fame in the '60s, starred as Dr. Cliff Huxtable on \"The Cosby Show\" from 1984 to 1992, a role that cemented his image as an upright family man. \n\"It appears it's catching up to him now. There's a tsunami of women who have allegedly been affected by Mr. Cosby and are wanting to be heard,\" said Joseph Cammarata, who represents the three women in the federal defamation suit filed in Massachusetts, where Cosby has a house in Shelburne Falls. \nThings could get even worse for Cosby in the next few months. Prosecutors in Pennsylvania and California could still bring criminal charges. \nAlthough the statute of limitations has expired in most of the cases, the release this year of Cosby's deposition in a 2005 sex-assault lawsuit in Pennsylvania seemingly prompted the current prosecutor to reopen the criminal case. \nMontgomery County District Attorney Risa Vetri Ferman won't confirm her office is reinvestigating the complaint by Andrea Constand, a former director of women's basketball operations at Temple University, where Cosby was a longtime trustee. However, Ferman said in a recent statement that prosecutors must review prior decisions if new evidence comes to light. And a well-known Philadelphia defense lawyer confirmed that Cosby's camp asked him to represent the actor in a Montgomery County criminal probe. \nThe statute of limitations for felony sexual assault in Pennsylvania is 12 years, which means Ferman has until January — the same month she leaves office — to file charges. \nIn California, Los Angeles County prosecutors are reviewing allegations by model Chloe Goins, who sued Cosby this month, claiming he drugged and sexually assaulted her in 2008. \nCosby's lawyer, Martin Singer, has denied Goins' allegations, saying Cosby wasn't in Los Angeles on the date originally provided by her attorneys. \nAnother lawsuit was filed on Wednesday. Renita Hill accuses Cosby of drugging her drinks and assaulting her at hotels in several cities in the 1980s, beginning when she was still in high school. Her lawsuit alleges that Cosby defamed her when he, his wife, Camille, and his attorney made statements portraying her as a liar. None of the statements mentioned Hill by name. \nSinger did not return calls or emails for comment, and Monique Pressley, another Cosby attorney, declined to comment. They have repeatedly denied some of the women's allegations. Cosby has never been charged with a crime. \n\"What I am saying is that Mr. Cosby has denied the accusations that have been lodged thus far. The sheer volume or number of people who are saying a particular thing does not make it true,\" Pressley said on \"Good Morning America\" in July. \nCosby's accusers say his once-impeccable image has been shattered. \n\"He has created his legacy, and his legacy has taken a shift,\" said Barbara Bowman, who was a 17-year-old aspiring actress in 1985 when she says Cosby sexually assaulted her. \nBowman was one of 13 women who had planned to testify for Constand in a civil suit Cosby settled in 2006 before it went to trial. \nIn a deposition in that case, Cosby acknowledged he gave Quaaludes to young women he wanted to have sex with, \"the same as a person would say, 'Have a drink.'\" He maintained that the sexual activities were consensual and that none of the women took Quaaludes unknowingly. \nThe lawsuits against Cosby are in the early stages and have a long way to go before they go to trial. Cosby's attorneys will still have additional opportunities to try to get them dismissed. \nTamara Rice Lave, an associate professor at the University of Miami School of Law who was written extensively about sex offenders, said she expects Cosby \"is going to be paying a lot of money\" in civil judgments. But she said she is concerned that the current climate against Cosby could pressure prosecutors to file criminal charges. \n\"I think prosecutors might be less careful in reviewing criminal charges because they're so happy to have a case that falls within the statute of limitations and they also know that they're very likely to get a conviction because they have all of this propensity evidence,\" Lave said.", "external_links": [], "published": "2015-10-18T21:45:00.000+03:00", "crawled": "2015-10-19T07:16:45.252+03:00", "highlightTitle": ""}