{"organizations": [], "uuid": "050b4eb4c4183914d5faac8cfdca3fadaa210920", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48524/entertainment", "section_title": "Entertainment - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30247902/can-music-help-prevent-gun-violence", "country": "US", "title": "Can Music Help Prevent Gun Violence?", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Can Music Help Prevent Gun Violence? - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "050b4eb4c4183914d5faac8cfdca3fadaa210920"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30247902/can-music-help-prevent-gun-violence", "ord_in_thread": 0, "title": "Can Music Help Prevent Gun Violence?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Chicago Ideas\nNew hip hop and rap artist-led movement tells Chicago's youth to #PutTheGunsDown\nCHICAGO , Oct. 13, This year, shootings in Chicago have broken records with more than 2,300 incidents to date, exceeding those in New York and Los Angeles combined.\nExperience the interactive Multimedia News Release here: http://www.multivu.com/players/English/7658551-chicago-ideas-music-vs-gun-violence/\nOn Tuesday, Chicago Ideas debuted \"Music Vs Gun Violence\" at MusicVsGunViolence.com . It's a social movement that aims to prevent gun violence through music.\nMusic can often be blamed for glorifying or inciting gun violence, but can it inspire people to put the guns down? With this question, Music Vs Gun Violence was born, featuring \"Put the Guns Down,\" an interactive music video that includes a string of performances from some of Chicago's best-known hip-hop and rap artists such as Academy and Grammy winning artist Common, Lil Herb and King Louie .\n\"At Chicago Ideas, we strive to build bridges, inspire action and amplify the voices that most need to be heard-and often are not,\" said Jessica Malkin , executive director of Chicago Ideas. \"We wanted to do our small part to give a platform to the activists, families and communities who are fighting against gun violence every day.\"\nTo reach the people most affected by Chicago's gun violence, Chicago Ideas' advertising partner Leo Burnett enlisted the help of some of the biggest names in Chicago's hip hop and rap communities. Artists featured in the video include Common, King Louie , Katie Got Bandz, Saba, Nick Jr., Tree, Mic Terror, Lil Herb and Noname Gypsy.\n\"This initiative needed to accomplish two things: It had to have a broad impact and it had to provide a means for people to speak with a unified voice against one of the largest issues facing the city of Chicago ,\" said Brian Shembeda , EVP, creative director at Leo Burnett Chicago. \"This is a problem that no single person nor organization can solve. It's something we have to address together.\"\nPeople will have the opportunity to join the movement by lending their own anti-gun violence lyrics to the music video. With each new submission, the video and support for the initiative grows.\nChicago Ideas formally unveiled this initiative during a Chicago Ideas Week talk \" Keeping the Peace: Music, Art and the End of Violence \" where Common joined host Marc Lamont Hill and artists, community leaders, activists and practitioners for a discussion of art's potential to positively impact one of the most important, intractable issues facing the United States today: gun violence.\n\"Put the Guns Down\" was executive produced and co-written by Chicago's Grammy-nominated, award winning Anthony \"The Twilite Tone\" Khan, a critically acclaimed producer/songwriter born and raised in Southside Chicago. Khan collaborated with John Monopoly to galvanize the ensemble cast of artists.\nHow Can You Support the Movement?\nShow your support by adding a verse to the video at MusicVsGunViolence.com , and join the discussion using #PutTheGunsDown.\nAbout Chicago Ideas\nChicago Ideas is a year-round platform featuring globally recognized speakers and interactive experiences designed to turn ideas into actionable results. It's a platform for ideas, created for innovators, thinkers, doers and interested citizens from across Chicago , the greater Midwest and the world. Its goal is to stimulate new initiatives and ventures, create new connections and collaborations, and establish a Community of Curiosity. Chicago Ideas is a 501(c)(3) organization. Follow Chicago Ideas on Twitter @ chicagoideas and on Facebook for updates.\nAbout Leo Burnett Worldwide\nLeo Burnett Worldwide believes in using creativity to drive dynamic business change for its clients. Through a HumanKind approach to marketing, the agency puts a brand's purpose at the center of communications to transform human behavior. Part of the Publicis Groupe , Leo Burnett Worldwide is one of the world's largest agency networks with 85 offices and more than 8,000 employees. The global agency works with some of the world's most valued brands including Coca-Cola, Fiat, Kellogg's, Kraft, McDonald's, Nintendo, P&G, Samsung and Tata among others. For the past six years, Leo Burnett has been ranked #1 in \"New World Thinking\" by The Gunn Report and was named an Agency to Watch on Advertising Age's 2015 A-List. In 2015, Leo Burnett was named \"Network of the Year\" at the International ANDY Awards, Art Directors Club, AdFest, Dubai Lynx, International YoungGuns Awards and AWARD Awards. To learn more about Leo Burnett Worldwide and its rich, 80-year history of creating iconic brands, visit our site , Facebook page and follow us via @leoburnett .\n releases/can-music-help-prevent-gun-violence-300158490.html\n ", "external_links": ["http://rt.prnewswire.com/rt.gif?NewsItemId=MM26233&Transmission_Id=201510130900PR_NEWS_USPR_____MM26233&DateId=20151013", "http://www.youtube.com/watch?v=4mCuIcZPWVU?version=3", "http://leoburnett.com/", "http://www.multivu.com/players/English/7658551-chicago-ideas-music-vs-gun-violence/", "http://www.leoburnett.com/", "http://www.xmlnews.org/ns/", "https://www.chicagoideas.com/", "https://twitter.com/chicagoideas", "https://www.facebook.com/leoburnett", "http://www.prnewswire.com/news-releases/can-music-help-prevent-gun-violence-300158490.html", "http://www.multivu.com/players/English/7658551-chicago-ideas-music-vs-gun-violence/gallery/image/046cd967-43ab-4d88-a904-471103d15a72.HR.jpg", "http://www.multivu.com/players/English/7658551-chicago-ideas-music-vs-gun-violence/gallery/image/17124f4a-86d1-40f5-ae8a-82eed7ea7984.HR.jpg", "https://twitter.com/leoburnett", "http://www.multivu.com/players/English/7658551-chicago-ideas-music-vs-gun-violence/gallery/image/af327623-867e-4e17-bbf7-c4da515734c5.HR.jpg", "https://www.facebook.com/ChicagoIdeasWeek/", "http://www.publicisgroupe.com/", "https://www.chicagoideas.com/talks/139", "https://www.musicvsgunviolence.com/", "http://www.multivu.com/players/English/7658551-chicago-ideas-music-vs-gun-violence/gallery/image/1c93d36e-fc5e-4534-9f8f-1fb10b8f30e9.HR.jpg"], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-13T16:37:52.152+03:00", "highlightTitle": ""}