{"organizations": [], "uuid": "4bce35bec9eed460754c16a3da07eaff06bd1979", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48524/entertainment", "section_title": "Entertainment - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30171508/ftc-college-president-david-ruggieri-climbs-to-the-top-of-amazons-best-seller-lists", "country": "US", "title": "FTC College President, David Ruggieri, Climbs to the Top of Amazon's Best-Seller Lists", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "FTC College President, David Ruggieri, Climbs to the Top of Amazon's Best-Seller Lists - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "4bce35bec9eed460754c16a3da07eaff06bd1979"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30171508/ftc-college-president-david-ruggieri-climbs-to-the-top-of-amazons-best-seller-lists", "ord_in_thread": 0, "title": "FTC College President, David Ruggieri, Climbs to the Top of Amazon's Best-Seller Lists", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Florida Technical College\nThe Soul of Success, co-written with author Jack Canfield of Chicken Soup for the Soul, is a favorite among book buyers in the U.S. and Canada.\nORLANDO, Fla. , Oct. 2, 2015 /PRNewswire/ -- Soul of Success , a book co-written by Florida Technical College President and CEO, David Ruggieri , reached best-seller status in several U.S. and Canada Amazon categories upon hitting the bookstands earlier this month.\nThe book is a collaboration between author Jack Canfield , of the famed Chicken Soup for the Soul series, and a selected group of business leaders and entrepreneurs. It was released Sept. 10 by CelebrityPress, immediately reaching the number one spot in Amazon in the Direct Marketing and Marketing for Small Businesses categories. It also placed near the top in the Entrepreneurship, Marketing and Sales, and Business Management categories.\nRuggieri is an education advocate and a community leader who has championed many social causes like the fight against hunger, homelessness and better access to education. He empowers individuals to become the best version possible of themselves, using education as a tool to achieve just that.\n\"To succeed today, it is useful, perhaps even essential, to have a good education,\" Ruggieri said. \"Without education you are at the mercy of good luck to succeed. With education, you get opportunities to advance. Pay attention and learn to identify and take advantage of them.\"\nRuggieri said he chose to participate in the writing of the book to share his personal path to success. He hopes that readers will learn something that helps them in their own journeys.\n\"We all want success,\" he said. \"But success doesn't happen. Success is forged one step at a time. It is important to set short-term and long-term goals to help us gauge progress and evaluate the strategies we're employing. That has being key to my personal and professional growth. It is humbling and very rewarding to be able to share that with others.\"\nSoul of Success is widely available in U.S. bookstores an online in Amazon.com.\nAbout Florida Technical College : FTC offers associate and bachelor's degrees and diploma programs in a range of professions, including healthcare, computer networking, graphic design, criminal justice, culinary arts and cosmetology. FTC's campuses are located in Orlando, Lakeland, DeLand, Kissimmee, Pembroke Pines and Cutler Bay. Founded in 1982 to provide private, post-secondary education in specialized fields, FTC is accredited by the Accrediting Council for Independent Colleges and Schools. Program availability varies by campus. For graduation rates, median debt of students who completed the program and other important information please visit www.ftccollege.edu/disclosures.html\nC ontact: Maria Isabel Sanquirico\nEleven 11 Communications\nMobile: 813-420-2922\nPhoto - http://photos.prnewswire.com/prnh/20151002/273391\nLogo - http://photos.prnewswire.com/prnh/20151002/273402LOGO\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/ftc-college-president-david-ruggieri-climbs-to-the-top-of-amazons-best-seller-lists-300153341.html\n ", "external_links": ["http://photos.prnewswire.com/prnh/20151002/273391", "http://photos.prnewswire.com/prnh/20151002/273402LOGO", "http://www.xmlnews.org/ns/", "https://photos.prnewswire.com/prnvar/20151002/273391", "http://www.ftccollege.edu/disclosures.html", "http://rt.prnewswire.com/rt.gif?NewsItemId=FL18418&Transmission_Id=201510021015PR_NEWS_USPR_____FL18418&DateId=20151002", "https://photos.prnewswire.com/prnvar/20151002/273402LOGO", "http://www.prnewswire.com/news-releases/ftc-college-president-david-ruggieri-climbs-to-the-top-of-amazons-best-seller-lists-300153341.html"], "published": "2015-10-02T03:00:00.000+03:00", "crawled": "2015-10-03T07:53:11.408+03:00", "highlightTitle": ""}