{"organizations": [], "uuid": "7a0ab33cea3615cc868ca835c3507ab8f701d979", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chardandilminsternews.co.uk", "main_image": "http://www.chardandilminsternews.co.uk/resources/images/4345312/", "site_section": "http://www.chardandilminsternews.co.uk/uk_national_entertainment/rss/", "section_title": "Chard & Ilminster News | National Entertainment News", "url": "http://www.chardandilminsternews.co.uk/uk_national_entertainment/13876867.Simon_Cowell_is_deeply__deeply_unimpressed_at_being__stuck__with_the_Overs/?ref=rss", "country": "GB", "title": "Simon Cowell is deeply, deeply unimpressed at being \"stuck\" with the Overs", "performance_score": 0, "site": "chardandilminsternews.co.uk", "participants_count": 0, "title_full": "Simon Cowell is deeply, deeply unimpressed at being \"stuck\" with the Overs", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T02:11:00.000+03:00", "replies_count": 0, "uuid": "7a0ab33cea3615cc868ca835c3507ab8f701d979"}, "author": "", "url": "http://www.chardandilminsternews.co.uk/uk_national_entertainment/13876867.Simon_Cowell_is_deeply__deeply_unimpressed_at_being__stuck__with_the_Overs/?ref=rss", "ord_in_thread": 0, "title": "Simon Cowell is deeply, deeply unimpressed at being \"stuck\" with the Overs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Simon Cowell"], "text": "Simon Cowell is deeply, deeply unimpressed at being \"stuck\" with the Overs Simon Cowell is deeply, deeply unimpressed at being \"stuck\" with the Overs \nPress Association 2014 / / National Entertainment News Share \nMusic mogul Simon Cowell lashed out against being “stuck” with his X Factor category, the Overs, during the Six Chair Challenge. \nWhen Cheryl Fernandez-Versini asked her grumpy co-judge during Sunday’s episode: “What is wrong with you today?” Simon fired back: “I can’t believe I’m stuck with this category.” \nThis year, audiences were able to vote on which judge should lead each category – and when Simon found out he had the over-25s earlier in the series, he reacted with horror, asking: “Are you fucking kidding me?” (ITV) \nHe later apologised to the contestants in his category, pledging his full support – but during the Six Chair Challenge he made it clear he was not impressed with the talent on display. \nWelcoming contestant Max Stone, 27, to the stage, he said: “Max, you look, if you don’t mind me saying so, like you’re half dead. I’ve never really got anything from your personality. Tell me something fun you’ve done in your life… I’m trying to make you fun but I’m failing.” \nAddressing Max, who went on to sing Bob Marley’s Turn Your Lights Down, he said: “I just don’t think people are going to like you very much.” Promoted stories Max Stone (ITV) \nVicky Ann Nash, 35, who sang Lisa Loeb’s Stay, was told by the judge: “Vicky, I like working with people who are ambitious, focused, and I don’t really get that from you.” \nHe added: “I really don’t like losing, and having heard the Girls category I’m really not in a great mood.” Vicky Ann Nash (ITV) \nAt this stage of boot camp, each judge whittles their category down to six acts by granting the singers a seat on stage if they’re going through to the next level. When all six seats are taken, the judge can choose to swap out an act if a better choice comes along. \nNick Grimshaw has already chosen his final six Boys and Rita Ora has her six Girls. Cheryl finished choosing her Groups in Sunday’s episode, while it was finally Simon’s turn to choose who to take through from the Overs. \nAs Joseph McCaul, a 27-year-old singer from Ireland, prepared to sing Duffy’s Mercy, Simon complained: “Why am I hating this category even more now?” \nAnd as theatre worker Zen Blythe, 29, prepared to take the stage to perform Lenny Kravitz’s Fly Away, Simon commented to the other judges: “Oh god, I hate this guy.” Zen Blythe (ITV) \nCheryl told Stephanie McCourt, 27, that she lacked a “connection” with the audience after performing Aretha Franklin’s Never Loved A Man – but Simon added: “What she’s saying, Stephanie, is people don’t like you at the moment… and I think it’s just the way that you are is not very friendly, not very warm.” \nOne of the only contestants to fire back against the judge’s harsh words was Anton Stephens, a 44-year-old backing singer from London, who sang Luther Vandross’s A House Is Not A Home. \nSimon, 56, said: “I’m going to give you some advice now Anton. You do pull weird faces when you sing.” Anton Stephens (ITV) \nAnton replied: “Can I talk about that? If you’re in an environment, I think, where lots of people have Botox, so your face doesn’t move, that becomes your normal. But if you’re a bit poor like me, and your friends are poor, and you can’t afford Botox, your face kind of moves.” \nThe quip left Simon in fits of laughter, alongside Cheryl, Nick and Rita. \nAfter the performance, Simon told him: “The audience believe in you, and you know what, I believe in you.” Share article \nThe X Factor airs on ITV on Sunday at 7pm. Promoted Stories", "external_links": [], "published": "2015-10-18T02:11:00.000+03:00", "crawled": "2015-10-18T09:28:51.151+03:00", "highlightTitle": ""}