{"organizations": [], "uuid": "79bb172f0b729e61b5c061b55d73bf1d431c0cd0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.southbendtribune.com", "main_image": "http://bloximages.newyork1.vip.townnews.com/southbendtribune.com/content/tncms/assets/v3/editorial/3/c4/3c4853ae-7324-11e5-b635-a35cf5ac8609/561f7ac67d15e.image.jpg?resize=760%2C507", "site_section": "http://www.southbendtribune.com//search/?q=&t=article&l=100&d=&d1=&d2=&s=start_time&sd=desc&nsa=eedition&c[]=entertainment/inthebend/eventnews,entertainment/inthebend/eventnews/*&f=rss", "section_title": "South Bend Tribune - entertainment/inthebend/eventnews,entertainment/inthebend/eventnews/", "url": "http://www.southbendtribune.com/entertainment/inthebend/eventnews/constellations-applies-string-theory-to-boy-meets-girl-story/article_ba9de8a0-7323-11e5-b7f6-93660e37ce3a.html", "country": "US", "title": "'Constellations' applies string theory to boy-meets-girl story", "performance_score": 0, "site": "southbendtribune.com", "participants_count": 1, "title_full": "'Constellations' applies string theory to boy-meets-girl story", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T13:00:00.000+03:00", "replies_count": 0, "uuid": "79bb172f0b729e61b5c061b55d73bf1d431c0cd0"}, "author": "ahughes@sbtinfo.com(Andrew Hughes)", "url": "http://www.southbendtribune.com/entertainment/inthebend/eventnews/constellations-applies-string-theory-to-boy-meets-girl-story/article_ba9de8a0-7323-11e5-b7f6-93660e37ce3a.html", "ord_in_thread": 0, "title": "'Constellations' applies string theory to boy-meets-girl story", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Previous Next 'Constellations' applies string theory to boy-meets-girl story \nSteven Cole and Christy Burgess rehearse a scene for The Acting Ensemble Stage Company’s production of Nick Payne’s “Constellations” that opens Friday. SBT Photo/ BECKY MALEWITZ Onstage \n• What: Nick Payne’s “Constellations” \n• Where: The Acting Ensemble Stage Company, Studio 217, 217 S. Michigan St., South Bend \n• When: 7:30 p.m. Friday, Saturday and Oct. 22-24 and at 2 p.m. Sunday and Oct. 25 \n• Cost: $15-$12 \n• For more information: Call 574-807-0108, email info@actingensemble.com or visit the website actingensemble  10   'Constellations' applies string theory to boy-meets-girl story By Andrew S. Hughes South Bend Tribune SouthBendTribune.com Posted on Oct 15, 2015 \nScience is empirical. \nLove is emotional. \nThe two meet in Nick Payne's \"Constellations,\" which opens Friday at The Acting Ensemble Stage Company. \n\"The plot of the play is based on string theory, this idea that at any given point, there are multiple futures,\" Christy Burgess says about playing Marianne, a quantum physicist. \"Based on the choices we make, that determines which future we end up in.\" \nIn Payne's 2012 play, Marianne meets Roland, a beekeeper, at a barbecue. \nFive times. \nAnd each time, a different word or gesture or vocal inflection changes the outcome as the audience watches their multiple timelines play out from that meeting at the barbecue. \n\"I think it's this idea that we want to believe there's a world where we haven't made our biggest mistake and a world with the best outcomes and we want to believe this world is that universe,\" Burgess says. \"There's a universe where you didn't say something and one where you wanted to and did.\" \nFor Steven Cole, the play's humor attracted him to it and the role of Roland. \n\"I think just the way it unfolds has a humorous element,\" he says. \"It's not a comedy, not a farce, but the humor comes from the narrative structure and the humor it takes to start a relationship. You look at people on a first date, and on the outside it's humorous, but when it's you, it's very serious.\" \n\"The story really brings out how fragile communication is and how the best communication doesn't always happen at the best times,\" director Melissa Gard says. \"It can be mundane. At first, the communication between the beekeeper and the physicist is awkward. They don't understand each other. Given plenty of chances they finally get it right.\" \nIn one scene, Marianne and Roland use sign language. \n\"I think it's another way to show communication happens with spoken words but most of our communication doesn't happen that way,\" Gard says. \"Most of it happens with the look, the tone, gesture, and meaning can change from that.\" \nIn one timeline, Roland has a girlfriend and the relationship goes nowhere. Other meetings lead to first dates, and in some of those timelines, first dates lead to dating. Sometimes, the relationship ends with sorrow. Other times, it doesn't. \n\"It can be the same scene, but there's just a glitch in the matrix,\" Burgess says. \"I like to think about it as the universe is trying to get them together.\" \n\"Constellations,\" Cole says, is both the most thrilling and difficult thing he's done as an actor. \n\"You're doing a scene one way and then the same scene, to some extent, differently,\" he says. \"It's not that your character changes, but you're forced to deal with the situation in a different way.\" \nBut although their basic characters remain the same from timeline to timeline, Marianne and Roland each have minute differences about them that cause the responses they give in specific timelines. \n\"I think she's grounded in the same foundation, but I think different things have happened to her in these parallel universes,\" Burgess says about Marianne. \"In one, she's very warm; in another, she's very cold; and in another, she adores Roland -- puppy-dog-eyes-in-love. Finding those motivations has been a challenge.\" \n\"Constellations,\" Cole says, allows the audience to see how the outcome for Marianne and Roland can be different, that there isn't one result of their meeting. \n\"Every little detail means something,\" he says. \"The words can be the same, but the meaning is different with the tone of voice. ... I think it's really about the way we feel we need to maximize our time, especially our time with other people.\" \nIn the end, all the timelines continue. \n\"You don't know how things end,\" Gard says, \"because it doesn't end with the ending.\"", "external_links": [], "published": "2015-10-15T13:00:00.000+03:00", "crawled": "2015-10-17T11:25:51.880+03:00", "highlightTitle": ""}