{"organizations": [], "uuid": "65be38517e6bc19cf6344cecce37f4c25fb7fa29", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48524/c", "section_title": "Entertainment - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30298329/clevelands-newest-museum-collection-achieves-international-status-thanks-to-an-important-acquisition-by-its-major-benefactor", "country": "US", "title": "Cleveland's newest museum collection achieves international status thanks to an important acquisition by its major benefactor", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Cleveland's newest museum collection achieves international status thanks to an important acquisition by its major benefactor - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "65be38517e6bc19cf6344cecce37f4c25fb7fa29"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30298329/clevelands-newest-museum-collection-achieves-international-status-thanks-to-an-important-acquisition-by-its-major-benefactor", "ord_in_thread": 0, "title": "Cleveland's newest museum collection achieves international status thanks to an important acquisition by its major benefactor", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Museum of American Porcelain Art\nCleveland businessman and Museum of American Porcelain Art founder Richard A. Barone acquires New Jersey-based Edward Marshall Boehm Porcelain Company\nCLEVELAND , Oct. 19, Cleveland businessman Richard A. Barone announced the acquisition of the Edward Marshall Boehm Porcelain Company, the most widely renowned creator of porcelain art in the world. Boehm operations are expected to remain in Trenton, New Jersey under new leadership, but further terms of the purchase are not being disclosed.\nAs an avid porcelain art enthusiast, Barone has always admired Boehm's work. \"The company's creations are more than art,\" Barone said. \"This work is beloved and represents a deep appreciation for tradition and iconography.\"\nBoehm, an iconic American brand, is included in the permanent collections of prestigious institutions around the world, including the White House in Washington, D.C. , Buckingham Palace in London , the Metropolitan Museum of Art in New York City and the Smithsonian Institution in Washington, D.C.\nTwo United States Presidents shared Boehm sculptures with foreign dignitaries as signs of international cooperation. President Richard Nixon gifted the famous Boehm \"Birds of Peace\" sculpture to China in 1972. Fifteen years later, President Ronald Reagan presented Boehm's \"Global Peace\" sculpture to Soviet leader Mikhail Gorbachev.\nBoehm's art is so influential that in 1992, a wing in one of the Vatican Museums in Rome was named in honor of E. M. Boehm , marking the first time in history an American citizen was bestowed that honor.\n\"Porcelain is not something that many people appreciate,\" Barone added. \"I want to change that. I want people to see the meticulous nature of beautiful work and be inspired by it.\"\nAs part of the Boehm acquisition, Barone intends to move all of the company's valuable showroom pieces and archives to the recently acquired Telling Mansion, future home of the Museum of American Porcelain Art in South Euclid, Ohio , which is being exquisitely restored in anticipation of the museum's pre-opening events in late 2016 with doors opening to the public in 2017.\nAbout Edward Marshall Boehm Porcelain Company\nBorn in a basement studio in Trenton, New Jersey , the E. M. Boehm Porcelain Company is a legacy for American porcelain art. The company, founded in 1950, began as a way for Edward Boehm to use his artistic ability to create appreciation for nature and wildlife causes. Today, Boehm porcelain is undisputed in quality with artwork in 134 institutions globally. For more information, please visit http://boehmporcelain.com .\nAbout Museum of American Porcelain Art\nThe Museum of American Porcelain Art, founded in September 2014 , will showcase rare and priceless American porcelain donated by Richard A. Barone . In addition to Barone's generous gift, the museum will feature valuable pieces from the Edward Marshall Boehm Porcelain Company collection. The Museum of American Porcelain Art is scheduled to open in 2017 in the historic Telling Mansion in South Euclid, Ohio .\nContact:\nSusan Johnson\nTel: (216) 839-5116\nEmail: susan@archeagle.com\n releases/clevelands-newest-museum-collection-achieves-international-status-thanks-to-an-important-acquisition-by-its-major-benefactor-300162000.html\n ", "external_links": ["http://boehmporcelain.com/", "http://www.prnewswire.com/news-releases/clevelands-newest-museum-collection-achieves-international-status-thanks-to-an-important-acquisition-by-its-major-benefactor-300162000.html", "http://rt.prnewswire.com/rt.gif?NewsItemId=CL31788&Transmission_Id=201510191500PR_NEWS_USPR_____CL31788&DateId=20151019", "http://www.xmlnews.org/ns/"], "published": "2015-10-19T03:00:00.000+03:00", "crawled": "2015-10-20T00:55:42.325+03:00", "highlightTitle": ""}