{"organizations": [], "uuid": "55dded2e58ae4e693c37f420144774338ac3ac7a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-56252fca/turbine/ct-cubs-bullpens-spt-1026-20151019", "site_section": "http://www.chicagotribune.com/", "section_title": "Chicago Tribune: Chicago breaking news, sports, business, entertainment, weather and traffic - Chicago Tribune", "url": "http://www.chicagotribune.com/sports/baseball/cubs/ct-cubs-bullpens-spt-1026-20151019-story.html", "country": "US", "title": "Wrigley Field&apos;s bullpens: An underappreciated and endangered pleasure - Chicago", "performance_score": 0, "site": "chicagotribune.com", "participants_count": 1, "title_full": "Wrigley Field&apos;s bullpens: An underappreciated and endangered pleasure - Chicago Tribune", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T21:01:00.000+03:00", "replies_count": 0, "uuid": "55dded2e58ae4e693c37f420144774338ac3ac7a"}, "author": "Paul Sullivan", "url": "http://www.chicagotribune.com/sports/baseball/cubs/ct-cubs-bullpens-spt-1026-20151019-story.html", "ord_in_thread": 0, "title": "Wrigley Field&apos;s bullpens: An underappreciated and endangered pleasure - Chicago", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "As Jake Arrieta warmed up before his start against the Cardinals last week in Game 3 of the National League Division Series, Cubs' fans were practically breathing down his neck.\nThey were watching every pitch, shouting words of encouragement and anxiously waiting for the game to begin.\nIt wasn't much different than watching Greg Maddux, Fergie Jenkins or Kerry Wood get ready for games during their Cubs' careers.\nOne of the unappreciated pleasures of watching a game at Wrigley Field is the up-close and personal view of the pitchers when they get up on the on bullpen mounds down the left and right field lines.\nBut that tradition will end after the 2016 season, when the Cubs move the bullpens under the bleachers as part of the ballpark renovation plan.\nThe move was put off until 2017 because the Cubs will not be finished with the construction of new batting cages next April, meaning the current cages under the bleachers have to remain where they are for one more year.\nThe starters, of course, only make cameos in the pen before the start of the games, while the relievers make it their home. The majority of the bullpen members I polled this year either prefer the current set-up or didn't have a strong opinion one way or another.\nFrom bleachers to structural details, work to renovate Wrigley Field continues.\n\"I kind of like it,\" reliever Jason Motte said. \"It kind of adds to the old school feel at Wrigley. I've always liked that about it. Being down the line, it's one of those things I've never really minded.\n\"You get to joke around with the fans, talk to them a little. They're not crazy bad. If you're getting loose on the home side, you hear them cheering you on.\"\nBut being subject to the elements in Chicago in spring and fall takes some getting used to, which is why Justin Grimm endorsed the change.\n\"I think it's probably obviously going to be for the better,\" Grimm said. \"When it's cold it's going to be a little warmer, and when it's hot it's going to be a little cooler. I think they're doing everything they can to help the fan base get into the games more, as well as helping the players be as comfortable as possible.\"\nOnly three parks — Wrigley, AT&T Park and Tropicana Field — still have their bullpens along the foul lines. Ironically, when the Giants built AT&T Park in 2000, they wanted to replicate Wrigley.\nThe 1969 Cubs Ex-Cubs Ernie Banks, Glenn Beckert and Ron Santo look back on the ill-fated 1969 Chicago Cubs team, which led the NL East for most of the year, only to lose out to the New York Mets.\nEx-Cubs Ernie Banks, Glenn Beckert and Ron Santo look back on the ill-fated 1969 Chicago Cubs team, which led the NL East for most of the year, only to lose out to the New York Mets.\nSee more videos \"We wanted all the seats to face the pitcher, like at Wrigley and at Seals Stadium,\" former owner Peter Magowen told the San Francisco Chronicle when the park opened. \"We wanted bullpens on the field, like in Wrigley. Wrigley Field was built in 1912, but it had it all: green seats, seats that faced the pitcher, quirky features.\"\nWhen the bleacher bullpens are ready in 2017, fans won't see the players warm up, and players will have a limited view of the field. They'll be sitting or standing behind a small opening in the double doors, which will be removed and replaced by a chain-link mesh fence.\nGiants pitching coach Dave Righetti speculated the move \"probably has got something to do with money,\" which is partially correct.\nBut the Cubs also believe having bullpens on the field endangers the players. When left fielder Kyle Schwarber stumbled and fell on the bullpen mound while pursuing a pop-up in a late-season game at Wrigley, it served as \"Exhibit A\" in their argument.\nFormer Cubs great Billy Williams was watching in one of the Cubs' front office suites when Schwarber tumbled after stepping on the bullpen pitching rubber.\n\"Yeah, now you know what it feels like,\" the former left-fielder cracked, yelling out toward the field.\nWilliams, of course, had that happen to him a time or two during his Cubs career. It's an occupational hazard for left and right fielders, which is why general manager Jed Hoyer said it's imperative to move the bullpens.\n\"First of all, it's got to be brutal for the bullpen guys,\" Hoyer said. \"No modern amenities whatsoever. I think you can be inside (under the bleachers), have a heater, be able to watch the game on TV a little bit, stay warm, ride (an exercise) bike. … I don't think sitting where they are being really cold, or hot, is great for either team. No one is benefiting from that set-up.\"\nCubs spokesman Julian Green called moving the bullpens a \"safety\" issue the Cubs decided to implement after getting \"feedback from (Cubs) players.\" Green said the switch also will add four new rows of seats on each side of the field where the bullpens are currently located.\nThe Cubs initially incurred problems securing the bullpen move after failing to divulge details to City Hall of the planned expansion of the outfield doors so the relievers could get a more expansive view of the field. The doors would've doubled from 12 to 24 feet to accommodate the new bullpen, but that meant some of the ivy on the outfield wall would have to be removed.\nSince the ivy is protected by the city's landmark ordinance, Mayor Rahm Emanuel rejected the revised plan, forcing the Cubs to go with the smaller doors.\nThe Cubs offered Emanuel a mea culpa and decided not to expand the doors, leaving a smaller opening for the relievers to protect their ivy. The team sent an official letter withdrawing their proposal, but reserved the right to revisit the issue.\nRighetti called the \"safety\" issue a cop-out, and believes it should be left as is because of its uniqueness.\n\"There are only a couple left,\" Righetti said of the three bullpens on the field. \"The biggest problem is they don't plan for enough room so they can keep it on the field.\n\"You've literally got to move the pen so it can fit the spot. It always makes you feel like you're throwing off-line. Ask anyone, and they always feel like you're throwing cockeyed, so to speak.\"\nMany players and coaches said they prefer the status quo because of it's openness and proximity to the fans.\n\"Places like Houston, you're in a dungeon,\" Motte said. \"This is one of the only places you can interact with the fans, whether it's at home or on the visiting side. You get to know the people. There's Phil who sits behind me.\"\nThat would be 78-year-old Phil Grinstead, a season ticket holder since 1978. Former Cubs reliever James Russell became a good friend with Grinstead over the years, and when he was traded to the Braves during a game in 2014, Russell reached into the stands and shook Grinstead's hand before leaving for his new team.\nRussell returned in 2015, and though he was let go on Aug. 30, the two remain texting friends. Grinstead said having relationships with players like Russell are why he'll always be a Cubs' fan.\nBefore he left the Cubs, Russell was one of the biggest proponents for keeping the bullpen down the lines.\n\"You get to meet some cool people,\" Russell said. \"Phil comes to mind. He's been there for a while. You build some relationships with people. It's going to be different when they move. On the other hand, you do get some drunken idiots down there and that gets annoying after a little bit. We're not trying to throw balls past the catcher warming up.\"\nOf course, when relievers aren't performing well it can get touchy. Former closer Carlos Marmol was booed almost every time he warmed up in 2013. The seats in right around the opposing bullpen can get nasty, too, as Motte learned when he was pitching for the Cardinals.\n\"It depends on the day, how much the beers were flowing,\" Motte said. \"But for the most part, people who sit down by the bullpen are season ticket holders. They know the game. Some may give their tickets away and there may be some people who get on you pretty good every now and then. But it was all in good fun.\n\"I think nowadays with the security guards and all the rest, you don't see anyone dropping F-bombs. There are too many kids around, so for the most part people are somewhat contained.\"\nThe Cubs are adamant the move under the bleachers will be made in 2017, so there will be no turning back.\nSo enjoy the up-close-and-personal view of the Cubs' pitchers while you can.\nThe end of an era is coming.\npsullivan@tribpub.com\nTwitter @PWSullivan\nPrivacy Policy Copyright © 2015, Chicago Tribune Chicago Cubs Baseball Sports", "external_links": ["http://www.tribpub.com/privacy-policy-and-your-privacy-rights/", "http://www.trbimg.com/img-533b7c56/turbine/chi-the-1969-cubs-20140401", "http://www.trbimg.com/img-56252fca/turbine/ct-cubs-bullpens-spt-1026-20151019", "http://www.trbimg.com/img-55d49f7e/turbine/chi-wrigley-field-rehab-underway-20140925"], "published": "2015-10-19T21:01:00.000+03:00", "crawled": "2015-10-19T21:55:11.742+03:00", "highlightTitle": ""}