{"organizations": [], "uuid": "24ef8f5ad76841aa0b7fd497f7385bc03408c97f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.sky.com", "main_image": "http://media.skynews.com/media/images/generated/2015/9/29/421341/default/v1/untitled-1-1600x900.jpg", "site_section": "http://news.sky.com/feeds/rss/entertainment.xml", "section_title": "Entertainment News - Latest Celebrity & Showbiz News | Sky News", "url": "http://news.sky.com/story/1561044/rob-lowe-heads-to-slough-for-end-of-the-world", "country": "IL", "title": "Rob Lowe Heads To Slough For End Of The World", "performance_score": 0, "site": "sky.com", "participants_count": 2, "title_full": "Rob Lowe Heads To Slough For End Of The World", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T03:44:00.000+03:00", "replies_count": 1, "uuid": "ba540c0dcd4ffc33d20ea619a8fe82a2acbfdacf"}, "author": "news.sky", "url": "http://news.sky.com/story/1561044/rob-lowe-heads-to-slough-for-end-of-the-world#post-0", "ord_in_thread": 0, "title": "Rob Lowe Heads To Slough For End Of The World", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Rob Lowe's latest role takes him to Slough - a place made famous in another television series - where he plays a chain-smoking, swearing priest who is facing the end of the world. The Hollywood actor is one of the stars of You, Me And The Apocalypse, a new Sky 1 drama which Lowe says is one of the most original he has ever seen.\n\"In an era of television where every year it gets more and more derivative ... this was truly original.\n\"Everything from the tone to the storytelling, I've seen a lot of end of the world shows in my time and I happen to like that genre anyway, but this was so weird, and so unexpected and the characters so different that I just loved it.\n\"I play a Vatican priest who is the devil’s advocate so that's a very serious, real job.\n\"In normal times the devil's advocate's job is to disprove the miracles before the potential new saints, and at the end of times his job would be to find the new Messiah, so Father Jude has a very important task to find the new Messiah and there are a lot of candidates and most of them are quacks and most of them are insane.\"\nThe comedy starts in a bunker with the world facing destruction and also stars Pauline Quirke, Jenna Fischer and Mathew Baynton.\nSome of the action is set in Slough, a town made world famous by Ricky Gervais and The Office.\nFischer starred in the American version of Gervais' comedy.\nSpeaking about her new show, she told Sky News the end of the world can translate easily into comedy.\n\"I think some of the best humour comes when stakes are high and yet people are reacting in a realistic way and so that's where a lot of the humour comes out.\n\"Also it's the end of the world so you can break rules.\n\"There aren't the same consequences so my character can do things that under other circumstances might be considered immoral or illegal but you're actually rooting for this character.\"\n:: You, Me And The Apocalypse is on Sky 1 tonight at 9pm.", "external_links": [], "published": "2015-09-30T03:44:00.000+03:00", "crawled": "2015-10-01T00:13:53.405+03:00", "highlightTitle": ""}