{"organizations": [], "uuid": "6c5b5c97381db680dae064cd8b52d0deb402e9c4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mid-day.com", "main_image": "http://images.mid-day.com/images/2015/oct/19-Neetu-Chandra_l.jpg", "site_section": "http://www.mid-day.com/Resources/midday/rss/entertainment.xml#", "section_title": "entertainment", "url": "http://www.mid-day.com/articles/neetu-chandras-upcoming-production-faces-censor-woes/16618153", "country": "IN", "title": "Neetu Chandra's upcoming production faces Censor woes", "performance_score": 0, "site": "mid-day.com", "participants_count": 1, "title_full": "Neetu Chandra's upcoming production faces Censor woes - Entertainment", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "6c5b5c97381db680dae064cd8b52d0deb402e9c4"}, "author": "Shaheen Parkar", "url": "http://www.mid-day.com/articles/neetu-chandras-upcoming-production-faces-censor-woes/16618153", "ord_in_thread": 0, "title": "Neetu Chandra's upcoming production faces Censor woes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Censor Board demands that references to Raj Thackeray and Rabri Devi in Neetu Chandra's upcoming production 'Once Upon A Time in Bihar' be lopped off\nActress-turned-producer Neetu Chandra's upcoming project, 'Once Upon A Time in Bihar', is having a tough time securing certification. The socio-political drama, written and directed by the actress' brother Nitin Chandra, revolves around the 2008 attacks on migrants from Uttar Pradesh and Bihar in Mumbai.\n\nNeetu Chandra \nHowever, the Censor Board wants references to Maharashtra Navnirman Sena chief Raj Thackeray and former Bihar chief minister Rabri Devi to be deleted. It has also asked the makers to mute cuss words and dialogues that apparently project politicians in poor light.\nLast week, Nitin had met Censor Board chief Pahlaj Nihalani, but was asked to either send the film to the revising committee or follow the suggestions to obtain certification.\nSays Neetu, \"I am surprised that the Censor Board had no objection to a film like 'Kaminey' where the title is an expletive, but the use of 'saala' in our film. How do we show the political scenario if we do not use names of Raj Thackeray and Rabri Devi? The film is based on real-life incidents. I feel the censor folk should reevaluate the film and help us make an impact on society.\"\nNitin says the two scenes that the Board is objecting to includes a newsreader quoting Thackeray after the attacks and the other is an insinuation to Rabri Devi's literacy level. \"I do not understand the logic behind expunging what political leaders had said at that time since all that was reported and widely discussed,\" he adds.", "external_links": [], "published": "2015-10-19T03:00:00.000+03:00", "crawled": "2015-10-19T12:00:08.597+03:00", "highlightTitle": ""}