{"organizations": [], "uuid": "201f30a5f44f645466d195741b200f704bfcc36e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48524/entertainment", "section_title": "Entertainment - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30171507/tve2-startup-companies-inviscid-software-llc-rankedfame-inc-celebrate-success", "country": "US", "title": "TVE2 startup companies Inviscid Software, LLC. & RankedFame, Inc. Celebrate Success.", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "TVE2 startup companies Inviscid Software, LLC. & RankedFame, Inc. Celebrate Success. - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "201f30a5f44f645466d195741b200f704bfcc36e"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30171507/tve2-startup-companies-inviscid-software-llc-rankedfame-inc-celebrate-success", "ord_in_thread": 0, "title": "TVE2 startup companies Inviscid Software, LLC. & RankedFame, Inc. Celebrate Success.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Information contained on this page is provided by an independent third-party content provider. WorldNow and this Station make no warranties or representations in connection therewith. If you have any questions or comments about this page please contact pressreleases@worldnow.com .\nSOURCE City of Temecula\nTEMECULA, Calif. , Oct. 2, 2015 /PRNewswire/ -- The City of Temecula is pleased to recognize successes of two technology startup companies at the Temecula Valley Entrepreneur's Exchange (TVE 2 ) incubator. Inviscid Software, LLC, recently completed the InSoCal Connect Springboard program and was chosen as a San Diego Venture Group (SDVG) 2015 'Cool Company'. RankedFame, Inc. was selected to pitch at the Riverside Tech Coast Angels event, showcasing talented entrepreneurs looking for funding for their products and/or ideas.\nInviscid Software developed TotalABA, a cloud-based solution that automates the billing, scheduling, and clinical documentation for clinics that provide autism therapy, called Applied Behavioral Analysis (ABA) clinics. Their mission is to simplify the business side of running an ABA clinic, so that therapists can concentrate on helping children, not the paperwork. Inviscid's most recent accomplishments include completing the InSoCal Connect Springboard program and selected as a SDVG 2015 Cool Company. SDVG is a non-profit business association with a mission to support and promote the venture capital and start-up company eco-system in the San Diego region. InSoCal Connect's Springboard program is designed to help promising young companies by offering mentorship and investor connections to help them to grow to their full potential.\nInviscid Software CEO Mark Adams stated \"TVE 2 really embodies the concept of an Incubator for us. We have soaked up knowledge from mentors, community speakers, vendors, and of course, other entrepreneurs, and used it all to transform ourselves from a fragile startup into a strong and growing company with big plans for the future.\"\nRankedFame, Inc. is a video sharing platform for aspiring talent to gain exposure and recognition on a local and national level. RankedFame's platform brings a new dynamic connection between users and local and national companies through local community support and sponsorships. They have been selected through a competitive application process to \"Pitch the Angels\" in Riverside , an opportunity to present RankedFame to angel investors. \"Feels great, very exciting to be one of the few that gets to pitch at TCA. RankedFame has come a long way since our inception at the beginning of 2015. Much of our trajectory is owed to the resources, connections, and networking gained through TVE 2 . I know we wouldn't be where we are today without this invaluable startup incubator,\" says Mike Chapman , CEO of RankedFame, Inc.\nTVE 2 is the City of Temecula's business incubator and regional resource center that fosters business growth and economic vitality for entrepreneurs. These programs provide their client companies with business support services and resources. Business incubators nurture the development of entrepreneurial companies, helping them survive and grow during the starting up period, when they are most vulnerable. These programs provide their client companies with business support services and resources.\nCongratulations to Inviscid Software and RankedFame!\nFor more info about TVE 2 visit www.Tve2.org . For more info about RankedFame, Inc. visit http://www.rankedfame.com/ . For more information about Inviscid Software, LLC, visit http://www.inviscidsoftware.com/ .\nCity of Temecula Media Contact:\nCheryl Kitzerow , Economic Development Analyst\nCheryl.kitzerow@cityoftemecula.org\n(951) 694-6409\nwww.tve2.org\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/tve2-startup-companies-inviscid-software-llc--rankedfame-inc-celebrate-success-300153087.html\n©2015 PR Newswire. All Rights Reserved.", "external_links": ["http://www.prnewswire.com/news-releases/tve2-startup-companies-inviscid-software-llc--rankedfame-inc-celebrate-success-300153087.html", "http://www.xmlnews.org/ns/", "http://rt.prnewswire.com/rt.gif?NewsItemId=SF18130&Transmission_Id=201510021006PR_NEWS_USPR_____SF18130&DateId=20151002", "http://www.tve2.org/", "http://www.inviscidsoftware.com/", "http://www.rankedfame.com/"], "published": "2015-10-02T03:00:00.000+03:00", "crawled": "2015-10-03T07:27:04.302+03:00", "highlightTitle": ""}