{"organizations": [], "uuid": "28b31b0802e1443aa3bfec903411fb8119d837d9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.capecodtimes.com", "main_image": "http://www.capecodtimes.com/storyimage/CC/20151015/ENTERTAINMENTLIFE/151019779/AR/0/AR-151019779.jpg", "site_section": "http://www.capecodtimes.com/entertainment?template=rss&mime=xml", "section_title": "Entertainment - capecodtimes.com", "url": "http://www.capecodtimes.com/article/20151015/ENTERTAINMENTLIFE/151019779/101018/ENTERTAINMENT?rssfeed=true", "country": "US", "title": "OysterFest is fun, but also helps Wellfleet", "performance_score": 0, "site": "capecodtimes.com", "participants_count": 1, "title_full": "OysterFest is fun, but also helps Wellfleet", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T02:38:00.000+03:00", "replies_count": 0, "uuid": "28b31b0802e1443aa3bfec903411fb8119d837d9"}, "author": "Haley Cote Contributing writer", "url": "http://www.capecodtimes.com/article/20151015/ENTERTAINMENTLIFE/151019779/101018/ENTERTAINMENT?rssfeed=true", "ord_in_thread": 0, "title": "OysterFest is fun, but also helps Wellfleet", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "FALL FESTIVALS OysterFest is fun, but also helps Wellfleet Wellfleet OysterFest, in its 15th year, is a fun weekend, but also supports and educates people about the town's shellfishing and aquaculture industries. Comment Posted Oct. 15, 2015 at 2:00 AM Updated Oct 15, 2015 at 6:38 PM By Haley Cote Posted Oct. 15, 2015 at 2:00 AM Updated Oct 15, 2015 at 6:38 PM If you go \nWhat: 15th Annual Wellfleet OysterFest. \nWhen: 10 a.m. to 5 p.m. Saturday and Sunday \nWhere: Main Street, Wellfleet \nWhat: 15th Annual Wellfleet OysterFest. \nWhen: 10 a.m. to 5 p.m. Saturday and Sunday \nWhere: Main Street, Wellfleet \nAdmission: $5 per day, $8 for two days, and free for children 12 and under \nParking: Shuttle services available from designated beach parking lots and the town pier; walk-in parking from Cove Corner Parking Lot and Wellfleet Elementary School; handicapped-accessible parking offered at the Mayo Beach lot with wheelchair-accessible shuttle bus. \nCaution: No pets or outside alcohol permitted \nInformation: wellfleetoysterfest.org \n\nOther oyster-related events this week \n-- The Oyster Grand Tasting from 6:30 - 8:30 p.m. Thursday, Oct. 22 at The Sea Crest Beach Hotel, 350 Quaker Road, North Falmouth will involve executive and master chefs from around the U.S. and Japan presenting 15 different types of oysters, each in its raw form and in a cooked dish. Tickets: $55 in advance at www.oystergrandtasting.com and $65 at the door if tickets remain. \n-- The 6th Annual International Oyster Symposium , a meeting of oyster experts from around the globe taking place in the U.S. for the first time, will be held Wednesday through Oct. 23 at the Sea Crest hotel and Marine Biological Lab. Representatives from 18 countries in the fields of academia, cuisine, government, business, conservation and culture will discuss and try to advance oyster aquaculture and regeneration. \n» Social News For 15 years, Wellfleet OysterFest has been a staple fall event – one of the largest in the area – not only for the town of Wellfleet, but for visitors from all over Cape Cod. But OysterFest is bigger than the two-day event itself. “It’s a great time, we’re all coming together, but it’s for a purpose,” says Michele Insley, executive director of Wellfleet’s Shellfish Promotion and Tasting, the non-profit organization that produces the annual event. (The group’s acronym, SPAT, is also the term for an oyster seed.) That purpose, Insley says, is to give back to the community and support its shellfishing industry – an industry, she asserts, that directly benefits the community in more ways than one. “We can have this really great industry to have a livelihood for people to help the local economy and provide a sustainable food source,” she explains. “And the oysters themselves are these little filter feeders, so they help to clear the water. So it’s like a win-win.” Meanwhile, proceeds from the festival that celebrates the oyster fund SPAT’s educational mission, which includes a college scholarship program through Nauset Regional High School, community grant awards, and initiatives to support Wellfleet’s shellfishing and aquaculture industries. Since 2004, Insley says, SPAT has given more than $360,000 back to the community. OysterFest “is really a community event,” she says. And it’s an event, she adds, at which there’s something for everyone. This year’s OysterFest will feature 10 raw bars operated by Wellfleet shellfishermen, 11 food vendors, 85 craft vendors, educational presentations and film screenings, a Tennis Round Robin, walking tours, live music, a 5k road race and 1.4-mile Children’s Fun Run, and the annual Oyster Shuck-Off competition. “You can’t even believe how much fun it is to watch that,” Insley says of the Shuck-Off, which has preliminary competition on Saturday and finals on Sunday on the Main Stage behind Wellfleet Town Hall. In this adrenaline-pumping competition, contestants are given 24 oysters to open as fast as possible – and as perfectly as possible on the half shell, as penalties are given for broken shells, butchered oysters and blood shed from fingers caught in the crossfire. (The fastest a winner has shucked in OysterFest history? 1.47 minutes when James Gray won in 2008.) The winner of the Shuck-Off receives $1,000 and qualifies to compete in the National U.S. Oyster Shucking Championship Contest in Maryland. This weekend’s fest will also feature cooking demonstrations at Wellfleet Preservation Hall by Chef Philippe Rispole on Saturday and local cookbook author Sarah Leah Chase – who is a recipe consultant to The Barefoot Contessa Ina Garten – on Sunday. There will also be a special tasting event on Saturday at Preservation Hall, “Taste the Terroir and the Merroir,” where attendees can sample Wellfleet oysters paired with wine from Truro. Between 11 a.m. and 4 p.m. each day, there will be a family fun area set up at Wellfleet Preservation Hall’s garden. Featured will be a fortune teller, the Cape Cod African Dance and Drum troupe on Saturdayl Trevor the Juggler and music by The Elbows both days; and The Keltic Kids on Sunday. “I think (festival attendees) will have fun on every level,” Insley says. “It’s a great atmosphere; everybody’s super friendly. It feels like you’re coming to a party.” By Haley Cote", "external_links": [], "published": "2015-10-16T02:38:00.000+03:00", "crawled": "2015-10-18T18:56:14.716+03:00", "highlightTitle": ""}