{"organizations": [], "uuid": "a9650ec572ee8ceb368cacc77b414e784bd2f044", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.yahoo.com", "main_image": "http://l3.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "http://news.yahoo.com/rss/entertainment", "section_title": "Entertainment News Headlines — Yahoo! News", "url": "http://news.yahoo.com/newscast-airs-lawn-bomb-threat-building-234245792.html", "country": "US", "title": "Newscast airs from lawn after bomb threat on building", "performance_score": 0, "site": "yahoo.com", "participants_count": 2, "title_full": "Newscast airs from lawn after bomb threat on building - Yahoo News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T03:00:00.000+03:00", "replies_count": 1, "uuid": "a59b7af4ba186135fb142b5b4691804034f53c3b"}, "author": "news.yahoo.com", "url": "http://news.yahoo.com/newscast-airs-lawn-bomb-threat-building-234245792.html#post-0", "ord_in_thread": 0, "title": "Newscast airs from lawn after bomb threat on building", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "GLENDALE, Calif. (AP) — Southern California TV station KABC-TV had to air its Wednesday afternoon newscast — weather, sports and all — from the building's front lawn after a bomb threat.\nAnchors David Ono and Ellen Leyva stood on the grass and were dressed more casually than usual on a 90-degree day, using trucks to broadcast as though they were reporters in the field.\n\"In 20 years, David, I've never had this before,\" Leyva said.\n\"It's a highly unique situation,\" Ono replied.\nGlendale police said they received a call from an anonymous man who said there were multiple bombs inside the building, though none was found.\nThe KABC newscast included shots of the empty newsroom from an unmanned camera. The station's helicopter hovered overhead and showed the surreal scene of the makeshift newsroom on the grass.\nWith limited resources, the newscast focused mainly on the threat itself and included interviews with police and a dog-wrangling member of the bomb squad.\nStill, the mood was largely light-hearted.\nMeteorologist Dallas Raines, whose slick hair and sunny personality have made him a local celebrity, wore sunglasses and used an iPad to show his five-day forecast.\n\"It's neat not to just forecast the weather, but to be in it,\" Raines said.\nThe station's sports and entertainment reporters also appeared on the lawn in their usual timeslots.\nKABC's offices are also the home of West Coast operations for ABC national news. The building, along with several others in the area, is owned by Disney, though no others were evacuated.\nAfter the bomb squad gave the all clear, the station's news staff could be seen pouring back into the building to pull together the rest of the evening's newscasts.\nDavid Ono", "external_links": [], "published": "2015-10-01T03:00:00.000+03:00", "crawled": "2015-10-01T04:53:54.239+03:00", "highlightTitle": ""}