{"organizations": [], "uuid": "62d19191e2b274d5da9613a3b4207d77ba0d7a33", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.timesunion.com", "main_image": "http://ww3.hdnux.com/photos/41/31/63/8756478/3/rawImage.jpg", "site_section": "http://www.timesunion.com/default/feed/entertainment/feed/Entertainment-News-214.php", "section_title": "Entertainment News", "url": "http://www.timesunion.com/entertainment/article/AP-PHOTOS-Bosnian-promoting-slow-way-of-life-6558137.php", "country": "US", "title": "AP PHOTOS: Bosnian promoting 'slow way of life' to artists", "performance_score": 0, "site": "timesunion.com", "participants_count": 1, "title_full": "AP PHOTOS: Bosnian promoting 'slow way of life' to artists - Times Union", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T14:54:00.000+03:00", "replies_count": 0, "uuid": "62d19191e2b274d5da9613a3b4207d77ba0d7a33"}, "author": "timesunion.com", "url": "http://www.timesunion.com/entertainment/article/AP-PHOTOS-Bosnian-promoting-slow-way-of-life-6558137.php", "ord_in_thread": 0, "title": "AP PHOTOS: Bosnian promoting 'slow way of life' to artists", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photo: Amel Emric, AP Image 1 of / 13 13 In this photo taken on Saturday, Oct. 3, 2015, amateur painter Safet Berber puts final touches to a painting during a weekend gathering of artist in the village of Dzafici, 100 kms north of Sarajevo. To allow people a break from their busy lives, Bosnian man Rasim Hamidovic, 60, is organising weekend gatherings of various artists in his home in Dzafici to remind them and other villagers of the old way of life in harmony with nature.\nPhoto: Amel Emric, AP In this photo taken on Saturday, Oct. 3, 2015, amateur painter... Image 2 of 13 In this photo taken on Saturday, Oct. 3, 2015, amateur painter Mehmedalija Mehmedovic works on a painting during a weekend gathering of artists in the village of Dzafici, 100 kms north of Sarajevo. To allow people a break from their busy lives, Bosnian man Rasim Hamidovic, 60, is organising weekend gatherings of various artists in his home in Dzafici to remind them and other villagers of the old way of life in harmony with nature.\nPhoto: Amel Emric, AP In this photo taken on Saturday, Oct. 3, 2015, amateur painter... Image 3 of 13 In this photo taken on Saturday, Oct. 3, 2015, a group of boys paint in a meadow during a weekend gathering of artists in the village of Dzafici, 100 kms north of Sarajevo. To allow people a break from their busy lives, Bosnian Rasim Hamidovic, 60, is organising weekend gatherings of various artists in his home in Dzafici to remind them and other villagers of the old way of life in harmony with nature.\nPhoto: Amel Emric, AP In this photo taken on Saturday, Oct. 3, 2015, a group of boys... Image 4 of 13 In this photo taken on Saturday, Oct. 3, 2015, a group of people look at paintings on easels in a meadow in the village of Dzafici, 100 kms north of Sarajevo. To allow people a break from their busy lives, Bosnian Rasim Hamidovic, 60, is organising weekend gatherings of various artists in his home in Dzafici to remind them and other villagers of the old way of life in harmony with nature.\nPhoto: Amel Emric, AP In this photo taken on Saturday, Oct. 3, 2015, a group of people... Image 5 of 13 In this photo taken on Saturday, Oct. 3, 2015, Muhamed Mustafa Hamidovic poses for a photo inside an old Bosnian house used for weekend gatherings of artists in the village of Dzafici, 100 kms north of Sarajevo. To allow people a break from their busy lives, Bosnian Rasim Hamidovic, 60, is organising weekend gatherings of various artists in his home in Dzafici to remind them and other villagers of the old way of life in harmony with nature.\nPhoto: Amel Emric, AP In this photo taken on Saturday, Oct. 3, 2015, Muhamed Mustafa... Image 6 of 13 In this photo taken on Saturday, Oct. 3, 2015, women paint during a weekend gathering of artists in the village of Dzafici, 100 kms north of Sarajevo. To allow people a break from their busy lives, Bosnian man Rasim Hamidovic, 60, is organising weekend gatherings of various artists in his home in Dzafici to remind them and other villagers of the old way of life in harmony with nature.\nPhoto: Amel Emric, AP In this photo taken on Saturday, Oct. 3, 2015, women paint during a... Image 7 of 13 In this photo taken on Saturday, Oct. 3, 2015, amateur painter Vesna Suljic mixes colours on her hand as she participates in a weekend gathering of artists in the village of Dzafici, 100 kms north of Sarajevo. To allow people a break from their busy lives, Bosnian man Rasim Hamidovic, 60, is organising weekend gatherings of various artists in his home in Dzafici to remind them and other villagers of the old way of life in harmony with nature.\nPhoto: Amel Emric, AP In this photo taken on Saturday, Oct. 3, 2015, amateur painter... Image 8 of 13 In this photo taken on Saturday, Oct. 3, 2015, Tarik Ascic carries a painting and runs past an old house during a weekend gathering of artists in the village of Dzafici, 100 kms north of Sarajevo. To allow people a break from their busy lives, Bosnian man Rasim Hamidovic, 60, is organising weekend gatherings of various artists in his home in Dzafici to remind them and other villagers of the old way of life in harmony with nature.\nPhoto: Amel Emric, AP In this photo taken on Saturday, Oct. 3, 2015, Tarik Ascic carries... Image 9 of 13 In this photo taken on Saturday, Oct. 3, 2015, amateur painter Vesna Suljic works on a painting during a weekend gathering of artists in the village of Dzafici, 100 kms north of Sarajevo. To allow people a break from their busy lives, Bosnian man Rasim Hamidovic, 60, is organising weekend gatherings of various artists in his home in Dzafici to remind them and other villagers of the old way of life in harmony with nature.\nPhoto: Amel Emric, AP In this photo taken on Saturday, Oct. 3, 2015, amateur painter... Image 10 of 13 In this photo taken on Saturday, Oct. 3, 2015, amateur writer Safet Salkanovic learns how to play a traditional handmade flute while taking part in the weekend art colony in the village of Dzafici, 100 kms north of Sarajevo. To allow people a break from their busy lives, Bosnian Rasim Hamidovic, 60, is organising weekend gatherings of various artists in his home in Dzafici to remind them and other villagers of the old way of life in harmony with nature.\nPhoto: Amel Emric, AP In this photo taken on Saturday, Oct. 3, 2015, amateur writer Safet... Image 11 of 13 In this photo taken on Saturday, Oct. 3, 2015, Sead Ascic, an amateur novelist, poses for a photo in his old Yugoslav made car during a weekend gathering of various artists in the village of Dzafici, 100 kms north of Sarajevo. To allow people a break from their busy lives, Bosnian man Rasim Hamidovic, 60, is organising weekend gatherings of various artists in his home in Dzafici to remind them and other villagers of the old way of life in harmony with nature.\nPhoto: Amel Emric, AP In this photo taken on Saturday, Oct. 3, 2015, Sead Ascic, an... Image 12 of 13 In this photo taken on Saturday Oct. 3, 2015, Bosnian amateur painter Fikret Curic works on a drawing while participating in a weekend art colony in the village of Dzafici, 100 kms north of Sarajevo. To allow people a break from their busy lives, Bosnian man Rasim Hamidovic, 60, is organising weekend gatherings of various artists in his home in Dzafici to remind them and other villagers of the old way of life in harmony with nature.\nPhoto: Amel Emric, AP In this photo taken on Saturday Oct. 3, 2015, Bosnian amateur... Image 13 of 13 AP PHOTOS: Bosnian promoting 'slow way of life' to artists 1 / 13 Back to Gallery DZAFICI, Bosnia-Herzegovina (AP) — A carpenter who builds traditional Bosnian houses wants to remind people of the old way of life in harmony with nature — far from the hubbub of city life, TV and computers.\nSo Rasim Hamidovic , 60, invited 26 artists to this quiet village last weekend to paint, write or just hang out and rediscover traditional Bosnian \"slowness.\"\n\"We promote art, friendship, nature, to people who spend their lives working all day long, watching TV or starring at computer screens,\" said Hamidovic, who has staged the weekend \"art colony\" event for the past five years.\nApart from enjoying the breathtaking October scenery, the artists painted or wrote poems while enjoying traditional food, laughter, dancing and singing.\nVillagers joined the project, offering cooking and accommodation, and organizing village parties.\n\"We all need to get back to nature,\" said Hamidovic. \"We need friendship, we need children playing outside ... We all need a break.\"", "external_links": ["http://ww2.hdnux.com/photos/41/31/64/8756481/3/920x920.jpg", "http://ww2.hdnux.com/photos/41/31/63/8756477/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/41/31/64/8756482/3/920x920.jpg", "http://ww3.hdnux.com/photos/41/31/64/8756486/3/920x920.jpg", "http://ww2.hdnux.com/photos/41/31/64/8756489/3/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/41/31/63/8756479/3/920x920.jpg", "http://ap.org/schemas/03/2005/apcm", "http://ww3.hdnux.com/photos/41/31/64/8756482/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/41/31/63/8756478/3/920x920.jpg", "http://ww4.hdnux.com/photos/41/31/64/8756487/3/920x920.jpg", "http://ww2.hdnux.com/photos/41/31/64/8756485/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/41/31/64/8756481/3/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/41/31/64/8756480/3/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/41/31/64/8756483/3/920x920.jpg", "http://ww3.hdnux.com/photos/41/31/64/8756486/3/square_gallery_thumb.jpg", "http://ap.org/schemas/03/2005/apnm", "http://ww4.hdnux.com/photos/41/31/64/8756483/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/41/31/64/8756489/3/920x920.jpg", "http://ww1.hdnux.com/photos/41/31/64/8756484/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/41/31/63/8756477/3/920x920.jpg", "http://ww3.hdnux.com/photos/41/31/63/8756478/3/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/41/31/64/8756487/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/41/31/64/8756485/3/920x920.jpg", "http://ww1.hdnux.com/photos/41/31/64/8756480/3/920x920.jpg", "http://ww4.hdnux.com/photos/41/31/63/8756479/3/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/41/31/64/8756484/3/920x920.jpg"], "published": "2015-10-08T14:54:00.000+03:00", "crawled": "2015-10-08T14:19:08.335+03:00", "highlightTitle": ""}