{"organizations": [], "uuid": "65080d62527622a6dabea4ec2f20dcc08f459b25", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wiltshiretimes.co.uk", "main_image": "http://www.wiltshiretimes.co.uk/resources/images/4361695/", "site_section": "http://www.wiltshiretimes.co.uk/leisure/showbiz/rss/", "section_title": "Wiltshire Times | National Entertainment News", "url": "http://www.wiltshiretimes.co.uk/leisure/showbiz/13892432.Matt_Di_Angelo_confirmed_to_be_leaving_EastEnders_in__explosive__storyline/?ref=rss", "country": "GB", "title": "Matt Di Angelo confirmed to be leaving EastEnders in \"explosive\" storyline", "performance_score": 0, "site": "wiltshiretimes.co.uk", "participants_count": 0, "title_full": "Matt Di Angelo confirmed to be leaving EastEnders in \"explosive\" storyline", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T15:16:00.000+03:00", "replies_count": 0, "uuid": "65080d62527622a6dabea4ec2f20dcc08f459b25"}, "author": "", "url": "http://www.wiltshiretimes.co.uk/leisure/showbiz/13892432.Matt_Di_Angelo_confirmed_to_be_leaving_EastEnders_in__explosive__storyline/?ref=rss", "ord_in_thread": 0, "title": "Matt Di Angelo confirmed to be leaving EastEnders in \"explosive\" storyline", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Matt Di Angelo"], "text": "Matt Di Angelo confirmed to be leaving EastEnders in \"explosive\" storyline Matt Di Angelo confirmed to be leaving EastEnders in \"explosive\" storyline Share \nEastEnders star Matt Di Angelo will be leaving the show in a gripping new storyline. \nMatt returned to the show last year as character Dean Wicks, who, in shocking scenes, viewers saw rape his brother’s wife, Linda Carter. (Jack Barnes/Kieron McCarron/BBC) \nA BBC spokesperson said, “We can confirm Matt will be leaving and wish him all the best.” \nThe Mirror reported that Dean “gets his comeuppance” for the rape, with a source adding, “Matt’s exit will be explosive. Viewers are in for a nail-biting treat.” \nThe show’s executive producer Dominic Treadwell-Collins had previously promised fans that justice would be done. The Carter/Wicks clan, with Dean, second left, and Linda, centre (Des Willie/BBC) \n“There is justice. And how it’s meted out will be satisfying but shocking too,” he said. \nMatt has yet to face any punishment for raping Linda, played by Kellie Bright, after authorities dropped the case against him. \nHis dark side emerged again recently when he deliberately burned his girlfriend Roxy Mitchell with hair straighteners. Dean with mother Shirley (Linda Henry) and father Buster (Karl Howman) (Jack Barnes/BBC) \nMatt first joined EastEnders in 2006, but left just two years later. He returned in April 2014 and signed a year’s contract, which has since been extended for another 12 months. \nAt the moment it isn’t known when Matt will be leaving the show. \nHe is currently involved in another major storyline that sees Dean pursuing custody of a daughter he never knew existed from a past one-night-stand. Matt previously played Sean in Hustle (BBC/Indiria Cesarine/Kudos) Share article \nMatt became runner-up on Strictly Come Dancing in 2007 and has starred in Hustle and Borgia. Promoted Stories", "external_links": [], "published": "2015-10-23T15:16:00.000+03:00", "crawled": "2015-10-23T22:09:10.319+03:00", "highlightTitle": ""}