{"organizations": [], "uuid": "cb49f442390a1ce32fcb91110fe999d12a864980", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "", "site_section": "http://bostonherald.com/entertainment/lifestyle", "section_title": "Entertainment: Lifestyle | Boston Herald", "url": "http://bostonherald.com/entertainment/lifestyle/2015/10/facebook_testing_6_reactions_emojis_for_love_anger_sadness_and_more", "country": "US", "title": "Facebook testing 6 'reactions' emojis for love, anger, sadness and more", "performance_score": 0, "site": "bostonherald.com", "participants_count": 1, "title_full": "Facebook testing 6 'reactions' emojis for love, anger, sadness and more | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "cb49f442390a1ce32fcb91110fe999d12a864980"}, "author": "Todd Spangler", "url": "http://bostonherald.com/entertainment/lifestyle/2015/10/facebook_testing_6_reactions_emojis_for_love_anger_sadness_and_more", "ord_in_thread": 0, "title": "Facebook testing 6 'reactions' emojis for love, anger, sadness and more", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "While it's not exactly the \"dislike\" button many Facebook users have clamored for, the social giant has launched a limited test of Reactions: six additional emoji icons for expressing feelings beyond the trademark \"like\" thumbs-up.\nThe new options, which Facebook is testing initially in Ireland and Spain , will pop up above the \"like\" icon in posts. The emojis are: love; haha; yay; wow; sad; and angry.\nFacebook chief Mark Zuckerberg\n, in a webcast last month, revealed the company's plans to test better ways for users to share their emotional response to a post or comment on the service. \"I do think that it's important to give people more options than just 'like' as a quick way to emote and share what they're feeling on a post, so we've been working on this for a while,\" Zuckerberg said in the webcast. He added, \"It's surprisingly complicated to make an interaction that you want to be that simple.\"\nNeither partners nor individual users will be able to disable the Reactions feature, according to Facebook -- which means marketers must steel themselves for \"angry\" or \"sad\" reactions, alongside \"likes,\" \"loves\" and \"wows,\" to material they share on the world's biggest social network. The emojis will be available on Facebook web and mobile clients, across all News Feed and Pages posts.\nInterestingly, Facebook's move comes after summer smash hit Disney-Pixar's \"Inside Out,\" which featured multi-hued characters personifying such emotions as joy, anger, fear and sadness. For mobile text messages, the Unicode standard has long included a range of gestures, including a thumbs-up, thumbs-down, an \"OK\" sign and a pair of hands clapping.\n© 2015 Variety Media, LLC, a subsidiary of Penske Business Media; Distributed by Tribune Content Agency, LLC", "external_links": ["https://pmcvariety.files.wordpress.com/2015/10/facebook-reactions.jpg?w=670"], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-08T19:56:49.291+03:00", "highlightTitle": ""}