{"organizations": [], "uuid": "146807fd4de820577766c039aafc38cc1f81aec6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wccbcharlotte.com", "main_image": "http://media.wccbcharlotte.com/designimages/WCCBDefaultStoryImage2014.jpg", "site_section": "http://www.wccbcharlotte.com/entertainment/entertainment-news/index.rss2", "section_title": "WCCB - Entertainment - Entertainment News", "url": "http://www.wccbcharlotte.com/entertainment/entertainment-news/331510661.html", "country": "US", "title": "Update on the latest religion news", "performance_score": 0, "site": "wccbcharlotte.com", "participants_count": 0, "title_full": "Update on the latest religion news", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T13:00:00.000+03:00", "replies_count": 0, "uuid": "146807fd4de820577766c039aafc38cc1f81aec6"}, "author": "", "url": "http://www.wccbcharlotte.com/entertainment/entertainment-news/331510661.html", "ord_in_thread": 0, "title": "Update on the latest religion news", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Update on the latest religion news Tools \nStory Created: Oct 9, 2015 at 4:00 AM   9, 2015 at 6:00 AM EDT \nUS MUSLIMS-RUSSIA-SYRIA \nAmerican Muslims protest Russia's Syrian intervention \nWASHINGTON (AP) — American Muslim leaders say Russia's intervention in Syria threatens to prolong that country's civil war and strengthen the Islamic State group. \nAt a news conference Thursday outside the Russian Embassy in Washington, officials with the Council on American-Islamic Relations and the Muslim Public Affairs Council expressed particular concern over the Russian Orthodox Church's support for the intervention. \nCAIR's National Executive Director Nihad Awad warned that making Russia appear to be fighting for Syrian Christians only fans religious extremism. He said, \"ISIS could not get a better way to recruit more people.\" \nHoda Hawa, policy director for the Muslim Public Affairs Council, said Russian officials are \"entering a danger zone by bringing about a rhetorical religious war using Russia's Orthodox church.\" \nOnline: https://youtu.be/EWYOe09kQWI \nSound: \n275-a-10-(Nihad Awad, national executive director of the Council on American-Islamic Relations, at news conference outside Russian embassy)-\"in this intervention\"-Nihad Awad, national executive director of the Council on American-Islamic Relations, says Orthodox church support for Russia's intervention in Syria threatens to make it a religious war. (8 Oct 2015) \n<<CUT *275 (10/08/15)££ 00:10 \"in this intervention\" \n274-a-10-(Hoda Hawa, director of policy and advocacy for the Muslim Public Affairs Council, at news conference outside Russian embassy)-\"Russia's Orthodox church\"-Hoda Hawa, director of policy and advocacy for the Muslim Public Affairs Council, says Russia's intervention in Syria is getting church support. (8 Oct 2015) \n<<CUT *274 (10/08/15)££ 00:10 \"Russia's Orthodox church\" \n276-a-08-(Nihad Awad, national executive director of the Council on American-Islamic Relations, at news conference outside Russian embassy)-\"recruit more people\"-Nihad Awad, national executive director of the Council on American-Islamic Relations, says the Russian intervention in Syria has been endorsed by the Russian Orthodox Church. (8 Oct 2015) \n<<CUT *276 (10/08/15)££ 00:08 \"recruit more people\" \nISLAMIC STATE \nActivists: IS group kills 3 Syrian Christian captives \nBEIRUT (AP) — Activists say Islamic State militants have shot and killed three Assyrians from among nearly 200 members of the Syrian Christian minority abducted in February. \nThe Assyrian Human Rights Network said in a statement on Facebook Thursday that the three were killed last month on the first day of the Muslim Eid al-Adha (eed ahl-AHD'-hah) holiday. \nA video circulated by Islamic State supporters on Wednesday showed militants shooting three men in orange jumpsuits in the back of their heads. Three other captives then introduce themselves, with one asking that \"appropriate measures\" be taken for their release. \nThe Islamic State group kidnapped nearly 200 Assyrians in February. At least 45 have been released through negotiations. \nMIGRANTS-RELIGION \nUN official rejects religious criteria for migrants \nLUXEMBOURG (AP) — A U.N. official says a wish expressed by some European countries or communities to accept only Christians fleeing war in countries such as Syria could be very \"dangerous\" because it would lead to divisiveness and breed hostility toward anyone deemed as not belonging there. \nHeiner Bielefeldt, a U.N. special rapporteur on freedom of religion or belief, says equating religion with territory could lead to a kind of \"religious cleansing\" where long-time inhabitants of a country who aren't adherents to the dominant religion could be labelled as \"outsiders at best.\" \nHe says that could, in turn, plant \"the seed of violence\" and ultimately undermine the messages of peace that religion aims to transmit. \nBielefeldt was speaking Thursday after the end of a regional conference on ways of preventing religious violence. \nISRAEL-PALESTINIANS \nNetanyahu bars ministers from visiting Jerusalem holy site \nJERUSALEM (AP) — An Israeli government official says Prime Minister Benjamin Netanyahu has barred all Cabinet ministers and Jewish lawmakers from visiting a sensitive Jerusalem holy site. \nThe official says Netanyahu imposed the ban because of concerns that any high profile visits there could spark further violence. \nThe Jerusalem hilltop compound lies at the heart of recent tensions. It's revered by Muslims as the spot where Prophet Muhammad ascended to heaven and by Jews as the site of the two biblical Jewish Temples. \nMany Palestinians believe Israel is trying to expand Jewish presence at the site, a claim Israel adamantly denies. \nUnder a longstanding arrangement administered by Islamic authorities, Jews are allowed to visit the site during certain hours but not pray there. \nSound: \n230-a-15-(Jerusalem Mayor Nir Barkat, in AP interview)-\"a total lie\"-Jerusalem Mayor Nir Barkat says rumors about a site that's holy to both Jews and Muslims are behind much of the recent violence. (8 Oct 2015) \n<<CUT *230 (10/08/15)££ 00:15 \"a total lie\" \n231-a-11-(Jerusalem Mayor Nir Barkat, in AP interview)-\"the Temple Mount\"-Jerusalem Mayor Nir Barkat says Israel isn't changing regulations surrounding the hilltop revered by Muslims and Jews. (8 Oct 2015) \n<<CUT *231 (10/08/15)££ 00:11 \"the Temple Mount\" \nSAUDI-HAJJ \nAssociated Press count shows over 1,360 pilgrims killed in Saudi hajj crush, stampede in Mina \nDUBAI, United Arab Emirates (AP) — An Associated Press count shows more than 1,360 pilgrims were killed in a crush and stampede during the hajj pilgrimage in Saudi Arabia last month. \nThe AP count of dead is nearly 600 more than the official death toll. Saudi officials have so far stuck by their total of 769 killed, and 934 injured. \nThe higher count comes from tolls offered by 17 countries through their officials or state media broadcasts. The tolls are said to only include those killed in the disaster at Mina, near Mecca. Authorities have said the Mina crush and stampede happened as two waves of pilgrims converged on a narrow road, causing hundreds of people to suffocate or be trampled to death. \nIran has blamed the disaster on the kingdom's \"mismanagement\" and accused the Saudis of a cover-up. \nLEGISLATURE-EQUAL RIGHTS \nPatrick wants Texas lawmakers to focus on religious liberty \nAUSTIN, Texas (AP) — Lt. Gov. Dan Patrick wants the Texas Legislature to better protect religious liberty by examining whether local anti-discrimination ordinances violate state and federal law. \nA tea party favorite, Patrick oversees the Texas Senate. On Thursday, he unveiled issues he'd like emphasized before the next legislative session begins in January 2017. \nPatrick wants senators to find ways to ensure the government doesn't \"force individuals, organizations or businesses to violate their sincerely held religious beliefs.\" \nSimilar religious protection measures caused national outcry when they were approved in some other states, sparking fears they could promote discrimination. Such proposals also stalled in Texas last session, despite GOP-control of the Legislature. \nPatrick hails from Houston, where a local anti-discrimination ordinance is up for voter approval next month. Opponents especially object to its sexual orientation protections. \nVATICAN-FAMILIES \nVatican defends reports of synod after pope's words disputed \nVATICAN CITY (AP) — The Vatican press office is defending its reporting on a big meeting on family issues after a dispute arose over what Pope Francis told bishops behind closed doors about his hopes for a free and open debate. \nOne of the participants in the synod, the Rev. Antonio Spadaro, tweeted earlier this week that Francis had warned the prelates against falling into a \"conspiracy\" mindset as they discuss how the church can better minister to Catholic families, gays, divorcees and couples in civil unions. \nBut in his briefing to reporters Tuesday, the Vatican spokesman, the Rev. Federico Lombardi, didn't quote Francis as making such a pointed admonition. Lombardi later confirmed that Francis did indeed say it, but insisted he is not obliged to quote everything that everyone says. \nBRITAIN-BISHOP-ABUSE \nFormer Anglican bishop sentenced for sex assaults on teens \nLONDON (AP) — A former Anglican bishop has been jailed in Britain for sexually assaulting teenagers and young men, two decades after he was first accused. At the time, powerful figures in Britain spoke out in support of the bishop, Peter Ball, and he was not charged. \nThe former Bishop of Lewes, Ball pleaded guilty last month to misconduct in a public office and indecent assault. Prosecutors say he abused 18 victims between the 1970s and the 1990s, all religious young men or aspiring priests. \nThe first victim came forward in 1992, but Ball, now 83, denied the allegation. Prosecutors say lawmakers, a British lord and an unidentified member of the royal family phoned police or wrote letters of support. Ball was given a police caution — an official warning — and resigned his post, but was later allowed to resume clerical duties. \nPolice reopened the case in 2012 after more victims came forward. \nHIKING TRAIL KILLING \nGun found during drifters' arrest in tantra yoga teacher's death \nSAN RAFAEL, Calif. (AP) — Authorities say they recovered the gun thought to be the one used to kill popular tantra yoga teacher Steve Carter when they arrested three drifters in Oregon traveling in Carter's car. \nMarin County Sheriff's Lt. Doug Pittman said the three young suspects will be extradited to California after investigators tracked them from the homicide scene on a scenic hiking trail 20 miles north of San Francisco to a community dining hall 600 miles away in Portland, Oregon. \nA hiker found Carter's body about 6 p.m. Monday. Carter was still holding the leash of his dog, which was also shot but is expected to recover. \nFollowers credited Carter with improving their romantic relationships by teaching tantra, a philosophy of meditation, yoga and sexuality. Carter and his wife held workshops nearby at the clothing-optional Harbin Hot Springs, which was destroyed last month in a wildfire. \nKASHMIR-BEEF DISPUTE \nLawmakers in Kashmir punch colleague for serving beef \nSRINAGAR, India (AP) — Lawmakers from India's ruling Hindu nationalist party in Kashmir have kicked and punched an independent member of the state assembly for hosting a party where he served beef. \nHindus consider cows to be sacred, and slaughtering the animals is banned in most Indian states. \nDifferences have deepened within Kashmir's ruling coalition, with the Hindu nationalist party demanding a ban on slaughtering cows and selling beef in the Muslim-majority state. Since Prime Minister Narendra Modi, a Hindu nationalist, took office last year, hard-line Hindus have been demanding that India ban beef sales. \nThere has been outrage across India after a 50-year-old Muslim man was beaten to death by a mob last week over rumors that his family had eaten beef for dinner.", "external_links": [], "published": "2015-10-09T13:00:00.000+03:00", "crawled": "2015-10-09T17:58:02.549+03:00", "highlightTitle": ""}