{"organizations": [], "uuid": "fe0647f1a512b9c258d9f02fbddbe2887287acd1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266347/arts-entertainment-general", "section_title": "Arts &amp; Entertainment: General - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30333553/interrel-to-host-four-sessions-at-oracle-openworld-2015", "country": "US", "title": "InterRel to Host Four Sessions at Oracle OpenWorld 2015", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "InterRel to Host Four Sessions at Oracle OpenWorld 2015 - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T16:11:00.000+03:00", "replies_count": 0, "uuid": "fe0647f1a512b9c258d9f02fbddbe2887287acd1"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30333553/interrel-to-host-four-sessions-at-oracle-openworld-2015", "ord_in_thread": 0, "title": "InterRel to Host Four Sessions at Oracle OpenWorld 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "For the eighth consecutive year, interRel will host multiple Oracle EPM/Business Intelligence-focused presentations at the highly anticipated Oracle OpenWorld conference, the largest educational and networking event for Oracle technologists, customers, and partners.\nSan Francisco, CA (PRWEB) October 23, 2015\nFor the eighth consecutive year, interRel will host multiple Oracle EPM/Business Intelligence-focused presentations at the highly anticipated Oracle OpenWorld conference, the largest educational and networking event for Oracle technologists, customers, and partners. The conference will feature education and insight into Oracle's strategy and roadmap, including targeted sessions on Oracle’s engineered systems, cloud computing, business analytics, big data, and customer experience initiatives.\nThree of interRel’s sessions are in conjunction with ODTUG Sunday Symposium] and one with IOUG User Forum Sunday. Oracle ACE Director Edward Roske will host two sessions, “Creative Oracle Hyperion Planning Design: With Planning, There is No Box,” as well as “Getting Value from Big Data with Analytics.” Oracle ACE Director Sarah Zumbrum will be presenting for the first time at an Oracle OpenWorld conference with her session, “BSO to ASO: Can We? Should We? How do We?” Also delivering a session for the first time at an OpenWorld conference is Oracle ACE Associate Wayne Van Sluys, who will present, “Oracle Business Intelligence Enterprise Edition the Oracle Smart View Way.” In addition to attending interRel’s sessions , visit booth 3209 in Moscone West to speak with an Oracle ACE Director or Associate, pick up information on interRel’s educational materials, including the first-ever Oracle Essbase 11.1.2.4 book, and enter to win daily prizes.\nAbout Oracle OpenWorld\nOracle OpenWorld San Francisco is the most important educational and networking event of the year for Oracle technologists, customers, and partners. This information technology event is dedicated to helping businesses optimize existing systems and understand upcoming technology breakthroughs. The conference, which is expected to draw more than 60,000 attendees from 145 countries, offers more than 2,500 educational sessions, 400 product demos, exhibitions from 500 partners and customers showcasing applications, middleware, database, server and storage systems, industries, management, and infrastructure – all engineered for innovation. Oracle OpenWorld 2015 is taking place October 25 - October 29 at The Moscone Center in San Francisco.\nFor more information, to register, or to watch live Oracle OpenWorld keynotes and sessions, visit http://www.oracle.com .\nAbout interRel Consulting\nFounded in 1997, interRel Consulting is the longest-standing Hyperion partner dedicated solely to implementing Oracle EPM/BI solutions for Fortune 500 and mid-size companies, and is the only multiple-time winner of Oracle’s specialized Partner of the Year for BI and EPM. The company is an eight-time Inc. 5000 honoree committed to education with a platform that includes 10+ books in its best-selling technical reference series “Look Smarter Than You Are with Hyperion,” free, twice-weekly webcasts , and multi-track Oracle EPM/BI Solutions Conferences across the U.S. and Canada. Home to four Oracle ACE Directors and one Oracle ACE Associate, interRel frequently participates in Oracle Technology Network international tours in developing markets. To learn more about interRel Consulting, please visit http://www.interRel.com .\nContact\nDanielle White, Director of Marketing\n(214) 864-8586\ndwhite(at)interrel(dot)com\n //www.prweb.com/releases/interRelatOpenWorld/2015/prweb13034185.htm\n ", "external_links": ["http://www.prweb.com/releases/interRelatOpenWorld/2015/prweb13034185.htm", "http://www.interrel.com/", "http://www.interrel.com/educations/publishings", "http://www.oracle.com/openworld/index.html", "https://events.rainfocus.com/oow15/catalog/oracle.jsp?search=interRel&search.event=openworldEvent", "https://www.oracle.com/us/assets/oow-moscone-west-fp2015-2322087.pdf", "http://bit.ly/IRCwebcasts"], "published": "2015-10-23T16:11:00.000+03:00", "crawled": "2015-10-23T15:21:04.269+03:00", "highlightTitle": ""}