{"organizations": [], "uuid": "28fbd1715f1db4a143ce8bbb0194297ac83c7306", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.india.com", "main_image": "http://s3.india.com/wp-content/uploads/2015/10/udhav-fadnvid.jpg", "site_section": "http://www.india.com/feed/", "section_title": "India | Latest India News | Get Free India.com Email | Live Cricket and Entertainment News at India.Com", "url": "http://www.india.com/news/cities/ghulam-ali-concert-cancelled-shiv-sena-shows-devendra-fadnavis-who-is-the-real-boss-611500/", "country": "US", "title": "Ghulam Ali concert cancelled: Shiv Sena shows Devendra Fadnavis who is the real boss", "performance_score": 0, "site": "india.com", "participants_count": 1, "title_full": "Ghulam Ali concert cancelled: Shiv Sena shows Devendra Fadnavis who is the real boss", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T07:29:00.000+03:00", "replies_count": 0, "uuid": "28fbd1715f1db4a143ce8bbb0194297ac83c7306"}, "author": "Aadil Ikram Zaki Iqbal", "url": "http://www.india.com/news/cities/ghulam-ali-concert-cancelled-shiv-sena-shows-devendra-fadnavis-who-is-the-real-boss-611500/", "ord_in_thread": 0, "title": "Ghulam Ali concert cancelled: Shiv Sena shows Devendra Fadnavis who is the real boss", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments Mumbai, Oct 8: The cancellation of renowned Pakistani ghazal maestro Ghulam Ali’s Mumbai and Pune concert after strong opposition by Shiv Sena shows just how helpless Maharashtra chief minister Devendra Fadnavis is. The fact that organisers cancelled the show even after Fadnavis said his government would provide adequate security to the singer just proves Fadnavis’ words carry no weight. The 75-year-old singer was scheduled to perform in Mumbai and Pune this week as part of the fourth death anniversary tribute to late singer Jagjit Singh. Shiv Sena has been opposing Pakistan and staging protest against performers from across the border. “We are not opposing Ghulam Ali but opposing terrorism by Pakistan. Shiv Sena is against keeping any relations with Pakistan till the time they stop terrorism,” Sena leader Sanjay Raut told ANI. While it may look Shiv Sena had its way but chief minister Devendra Fadnavis is far more responsible. Fadnavis, who also hold Home Department, failed to convince the organisers of the concert. Does it mean that Shiv Sena’s diktat has more supremacy than the assurance given by Fadnavis? Does it mean Fadnavi’s words have no value before Sena’s judgement? Moreover, the cancellation of the concert is also a political defeat for Fadnavis as the Shiv Sena once again proved its political supremacy on the BJP. Fadnavis has all the control over the police department and administration but surrendered before Sena. (ALSO READ: Shiv Sena has its way; Pakistani Ghazal maestro Ghulam Ali’s concert cancelled) When it come to Shiv Sena, it has been acting as extra constitutional authority in Maharashtra. However, Shiv Sena has all the rights to boycott the concert but doesn’t have any authority to stop people who want to attend it. Ghulam Ali is not responsible for the deaths of Indian soldier at border. If Shiv Sena believes that the Islamabad will stop sponsoring terrorism because they stopped a music concert then the saffron outfit is living in a fool’s paradise. Shiv Sena’s atrocity has tarnished the image of Mumbaikars who accepts people from every nook and corner overwhelmingly. Music and art has no boundary. By creating such ruckus, Shiv Sena is restricting freedom of people. The rising intolerance in country is damaging the foundation of the country and its secular fabric too. It’s time for we people to stand against such divisive politics. \nModified Date: October 8, 2015 10:06 AM Topics:", "external_links": [], "published": "2015-10-08T07:29:00.000+03:00", "crawled": "2015-10-08T08:05:32.174+03:00", "highlightTitle": ""}