{"organizations": [], "uuid": "b1e324bfc4413ca86f8bd01d1e6d5873799618e0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nydailynews.com", "main_image": "http://assets.nydailynews.com/polopoly_fs/1.2403951!/img/httpImage/image.jpg_gen/derivatives/landscape_1200/star-wars-force-awakens.jpg", "site_section": "http://www.nydailynews.com/entertainment/index.html", "section_title": "Entertainment News &amp; Reviews - NY Daily News", "url": "http://www.nydailynews.com/entertainment/movies/watch-star-wars-force-awakens-stars-react-trailer-article-1.2403952", "country": "US", "title": "WATCH: ‘Star Wars: The Force Awakens’ stars react to trailer", "performance_score": 0, "site": "nydailynews.com", "participants_count": 1, "title_full": "WATCH: ‘Star Wars: The Force Awakens’ stars react to trailer - NY Daily News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "b1e324bfc4413ca86f8bd01d1e6d5873799618e0"}, "author": "NEW YORK DAILY NEWS", "url": "http://www.nydailynews.com/entertainment/movies/watch-star-wars-force-awakens-stars-react-trailer-article-1.2403952", "ord_in_thread": 0, "title": "WATCH: ‘Star Wars: The Force Awakens’ stars react to trailer", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Watching the latest \"Star Wars: The Force Awakens\" trailer even had the cast excited enough to pull the ears off a gundark.\nTwo of the film's stars, Daisy Ridley and John Boyega, had their friends film their candid reactions to seeing themselves front and center Monday night in the two-minutes and 30-seconds of mostly new footage.\nRidley, 23, who was staying in a bed and breakfast with a friend at the time, set her alarm because of the time difference and posted her teary, squealing response over seeing her character Rey dominate the first part of the trailer to Instagram.\nLucasfilm John Boyega and Daisy Ridley had much less staid reactions off-screen to the new \"Star Wars: The Force Awakens\" trailer For the 23-year-old Boyega, who relocated to Los Angeles, he returned from watching a Lakers pre-season game at the Staples Center in time to catch the big event on television. And boy was boyega excited over the sight of his Finn being conscripted into battle, pumping his fists and bopping up and down on his couch as the trailer unspooled.\n\"THE TRAILER IS JUST EEEE ! Star Wars is back! g d l rd! You know what! Let me just relax because this kind God oooo! Lmao! Seriously congrats to everyone ! December 18th!,\" he wrote in the caption of his Instagram post.\ndaisyridley via Instagram Daisy Ridley reacts to the 'Star Wars: The Force Awakens' trailer. Enlarge john_boyega via Instagram John Boyega reacts to the 'Star Wars: The Force Awakens' trailer. Enlarge Actors Daisy Ridley (l.) and John Boyega (r.) react to the \"Star Wars: The Force Awakens\" trailer.\nThe actors may have spent months on the set of the latest installment of the sci-fi franchise, but this was the first time they had gotten to see the footage with complete special effects and buttressed by the John Williams score.\nChances are that they won't get to see that much more of director J.J. Abrams' opus until a lot closer to the Dec. 18 release of the most anticipated movie in the galaxy.\n\"Totally emotional seeing it for the first time and so so so incredibly awed to be part of this incredible legacy,\" Ridley wrote on Instagram.\nesacks@nydailynews.com\nRelated Stories 'Star Wars: The Force Awakens' trailer scores big on 'MNF' 'Star Wars' ticket demand crashes British theater sites", "external_links": ["http://launch.newsinc.com/js/embed.js"], "published": "2015-10-20T03:00:00.000+03:00", "crawled": "2015-10-20T19:16:13.264+03:00", "highlightTitle": ""}