{"organizations": [], "uuid": "9996444bbbf46e237042b41492936832f33b7970", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kpho.com", "main_image": "http://tvguide.images.worldnow.com/images/8973007_G.jpg", "site_section": "http://kpho.com/category/73801/entertainment?clienttype=rss", "section_title": "KPHO Phoenix - Entertainment", "url": "http://www.kpho.com/story/30216265/daniel-craig-would-rather-kill-himself-than-play-james-bond-again", "country": "US", "title": "Daniel Craig would rather kill himself than play James Bond again", "performance_score": 0, "site": "kpho.com", "participants_count": 0, "title_full": "Daniel Craig would rather kill himself than play James Bond again", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T21:30:00.000+03:00", "replies_count": 0, "uuid": "9996444bbbf46e237042b41492936832f33b7970"}, "author": "", "url": "http://www.kpho.com/story/30216265/daniel-craig-would-rather-kill-himself-than-play-james-bond-again", "ord_in_thread": 0, "title": "Daniel Craig would rather kill himself than play James Bond again", "locations": ["Kanye West"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Nicole Kidman", "Bobbi Kristina Brown", "Nick Gordon", "James Bond", "Daniel Craig", "Archie Panjabi", "Isabella Cruise", "Max Parker", "Tom Cruise", "Ashley Judd", "Selena Gomez", "Kanye West", "Julianna Margulies"], "text": "Selena Gomez is done letting the media tell her story. More > Selena Gomez is done letting the media tell her story. More > Daniel Craig would rather kill himself than play James Bond again Only a few weeks before Spectre hits theaters, Daniel Craig said he would prefer suicide to doing a fifth James Bond movie. More > Only a few weeks before Spectre hits theaters, Daniel Craig said he would prefer suicide to doing a fifth James Bond movie. More > Ashley Judd says she was once sexually harassed by a studio executive For the first time Ashley Judd is speaking out about being sexually harassed by a studio mogul. More > For the first time Ashley Judd is speaking out about being sexually harassed by a studio mogul. More > Kanye West thinks the fashion world discriminates against him because he's not gay Kanye West says that he has faced discrimination in his career, but it's not because he's black -- it's because he's not gay. More > Kanye West says that he has faced discrimination in his career, but it's not because he's black -- it's because he's not gay. More > Nick Gordon could face murder charges for Bobbi Kristina Brown's death Nick Gordon could be facing more serious charges in connection to Bobbi Kristina Brown's death in addition to the civil wrongful death suit currently being held against him. More > Nick Gordon could be facing more serious charges in connection to Bobbi Kristina Brown's death in addition to the civil wrongful death suit currently being held against him. More > Tom Cruise and Nicole Kidman's daughter Isabella Cruise secretly married her boyfriend Max Parker. More > Tom Cruise and Nicole Kidman's daughter Isabella Cruise secretly married her boyfriend Max Parker. More > Archie Panjabi basically called Julianna Margulies a liar on Twitter Maybe \"The truth is out there\" should be the tag line for The Good Wife, and not The X-Files. More > Maybe \"The truth is out there\" should be the tag line for The Good Wife, and not The X-Files. More > \nBy Sadie Gennis, \nOnly a few weeks before Spectre hits theaters, Daniel Craig said he would prefer suicide to doing a fifth James Bond movie. \n\"I'd rather break this glass and slash my wrists,\" Craig told Time Out London. \"No, not at the moment. Not at all. That's fine. I'm over it at the moment. We're done. All I want to do is move on.\" \nCraig admitted the only reason he would ever suit up as 007 again would \"be for the money,\" and that he wasn't even particularly interested in filming Spectre. \"Well, I was contracted to do another one,\" he explained. \nListen to Sam Smith's James Bond theme \nAs for his Bond successor, \"I don't give a f---\" who it will be, Craig said, before eloquently elaborating, \"Don't be sh--. You've got to step up. People do not make movies like this any more. This is really rare now. So don't be sh--.\" \nYou hear that, Idris Elba ? Don't be sh--, and you'll be OK. \nSpectre will be released Nov. 6. \nOther Links From TVGuide.com View the original article on TVGuide.com *DISCLAIMER* : The information contained in or provided through this site section is intended for general consumer understanding and education only and is not intended to be and is not a substitute for professional advice. Use of this site section and any information contained on or provided through this site section is at your own risk and any information contained on or provided through this site section is provided on an \"as is\" basis without any representations or warranties.", "external_links": [], "published": "2015-10-08T21:30:00.000+03:00", "crawled": "2015-10-08T22:00:29.700+03:00", "highlightTitle": ""}