{"organizations": ["New York Inventor Exchange"], "uuid": "a8adeb31ff985bf04fb819f7d19b784e83a5c3c3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "globenewswire.com", "main_image": "", "site_section": "http://globenewswire.com//Rss/subjectcode/4/Arts%2026%20Entertainment", "section_title": "GlobeNewswire: Arts & Entertainment", "url": "http://globenewswire.com/news-release/2015/10/05/773360/10151641/en/Camping-Can-Feel-Like-A-Home-Away-From-Home-Thanks-To-World-Patent-Marketing-And-The-Camp-Fire-Boot-Drier.html?f=22&fvtc=1&fvtv=Arts%2026%20Entertainment", "country": "US", "title": "Camping Can Feel Like A Home Away From Home Thanks To World Patent Marketing And The Camp Fire Boot Drier", "performance_score": 0, "site": "globenewswire.com", "participants_count": 0, "title_full": "Camping Can Feel Like A Home Away From Home Thanks To World Patent Marketing And The Camp Fire Boot Drier", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T13:04:00.000+03:00", "replies_count": 0, "uuid": "a8adeb31ff985bf04fb819f7d19b784e83a5c3c3"}, "author": "", "url": "http://globenewswire.com/news-release/2015/10/05/773360/10151641/en/Camping-Can-Feel-Like-A-Home-Away-From-Home-Thanks-To-World-Patent-Marketing-And-The-Camp-Fire-Boot-Drier.html?f=22&fvtc=1&fvtv=Arts%2026%20Entertainment", "ord_in_thread": 0, "title": "Camping Can Feel Like A Home Away From Home Thanks To World Patent Marketing And The Camp Fire Boot Drier", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Learning & Support New Software Sifts Store Inventory For World Patent Marketing's New Invention Known As SIMS The New York Inventor Exchange approves Secure Inventory Management System (S.I.M.S) for licensing and trading intellectual property rights. October 05, 2015 00:03 ET | Source: World Patent Marketing \nMIAMI, Fla., Oct. 5,   via PRWEB - World Patent Marketing , a vertically integrated manufacturer and engineer of patented products, announces the Security Inventory Management System or SIMS, a technological invention that makes inventory checking more accurate and less time consuming. \n\"The Business Analytics & Enterprise Software Publishing industry is worth $32 billion,\" says Scott Cooper, CEO and Creative Director of World Patent Marketing and Desa Industries Inc . \"High corporate profits and aggressive acquisitions will drive industry demand. Large and small businesses will look to the industry for software, including customer relationship management, inventory management, business intelligence, and enterprise resource planning applications.\" \n\"Store management entails a lot of commitment, hard work, and, most of all, patience,\" says Cattya Bella, Director of Product Development for the World Patent Marketing Review Team \"Retail stores have to ensure that the items are well-stocked while making sure that they provide nothing but quality products. This makes inventory checking a tedious task. The Security Inventory Management System or SIMS is a technological invention that will help in store management as it removes the need to manually check and balance inventory therefore avoiding costly losses.\" \nSIMS is a technological invention that makes use of computer sensors, mounted cameras, and an array of weight sensors to regulate the before and after weights of different products in a retail store. It assigns products with a specified identity code and is efficient in calculating the weight of inventory items as they are removed from the shelf--this instantly updates the records. \n\"SIMS was designed with many features in mind,\" says inventor Sommer S. \"This technological invention is designed to prevent theft, decrease the time it takes to count inventory items, decrease product costs thereby increasing profits, and better time management. It can be used by any type of store that has products that are weight-based such as restaurants and hospitals.\" \nVanessa Owens, a restaurant manager and blogger from Cheshire CT, has this to say about SIMS: \"Often times, inventory checking for meat, vegetables, and other ingredients take a long time since the items need to be double-checked with what is still in stock. SIMS is a technological invention that cut the time spent in doing this task significantly. Not only is it more accurate, but it frees up valuable manpower so that they can do other tasks.\" \nThe SIMS will help stores check, update, and keep their inventory in proper order. This technological invention makes not only keeping records, but also keeping stock a lot easier and work-friendly. \nABOUT WORLD PATENT MARKETING \nWorld Patent Marketing is an innovation incubator and manufacturer of patented products for inventors and entrepreneurs. The company is broken into eight operating divisions: Research, Patents, Prototyping, Manufacturing, Retail, Web & Apps, Social Media and Capital Ventures. \nWorld Patent Marketing Miami is by your side every step of the way, utilizing our capital and experience to protect, prepare, and manufacture your new product idea and get it out to the market. \nWorld Patent Marketing Success is demonstrated by its A+ rating with the Better Business Bureau and its five star ratings from consumer review sites including: Consumer Affairs, Google, Trustpilot, Customer Lobby, Reseller Ratings, Yelp and My3Cents. \nWorld Patent Marketing is also a proud member of the National Association of Manufacturers, Duns and Bradstreet, the US Chamber of Commerce, the South Florida Chamber of Commerce, the Greater Miami Chamber of Commerce, Association for Manufacturing Excellence, and the New York Inventor Exchange. Visit the worldpatentmarketing.com website.. Contact us at (888) 926-8174 (US Eastern Time) or email bill@worldpatentmarketing.com. \nThis article was originally distributed on PRWeb. For the original version including any supplementary images or video, visit http://www.prweb.com/releases/worldpatentmarketing/SIMS/prweb12943550.htm World Patent Marketing Bill Flanagan +1 6465643919 Related Articles other press releases by World Patent Marketing", "external_links": [], "published": "2015-10-05T13:04:00.000+03:00", "crawled": "2015-10-05T17:10:26.355+03:00", "highlightTitle": ""}