{"organizations": ["BET", "Epic Records"], "uuid": "9cebe8a0ebd8b4cb7677535f865ddc829e9d52a9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.onenewspage.com", "main_image": "http://cdn.newsserve.net/ONPglobe256.jpg", "site_section": "http://www.onenewspage.com/rss/latest/Entertainment.rss", "section_title": "Latest Entertainment News on One News Page", "url": "http://www.onenewspage.com/n/Entertainment/7559xol08/Scarface-Arrested-At-BET-Hip-Hop-Awards-2015.htm", "country": "US", "title": "Scarface Arrested At BET Hip Hop Awards 2015", "performance_score": 0, "site": "onenewspage.com", "participants_count": 0, "title_full": "Scarface Arrested At BET Hip Hop Awards 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T21:25:00.000+03:00", "replies_count": 0, "uuid": "9cebe8a0ebd8b4cb7677535f865ddc829e9d52a9"}, "author": "", "url": "http://www.onenewspage.com/n/Entertainment/7559xol08/Scarface-Arrested-At-BET-Hip-Hop-Awards-2015.htm", "ord_in_thread": 0, "title": "Scarface Arrested At BET Hip Hop Awards 2015", "locations": ["ATLANTA", "Atlanta", "South"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Drake", "Combs", "Sean"], "text": "Scarface Arrested At BET Hip Hop Awards 2015 Saturday, 10 October 2015 (12 minutes ago) What was supposed to a nice night (Oct. 9). at the 2015 BET Hip Hop Awards for Scarface ended with a major hitch. The Houston rap legend was arrested shortly after receiving the “I Am Legend Award.” According to Freddy-O, after accepting his award from Ludacris, the cops were waiting for Face Mob as he […] The post Scarface Arrested At BET Hip Hop Awards 2015 appeared first on Hip-Hop Wired. Scarface was a man of few words after accepting his \"I Am Hip Hop\" award, directing the attention away from himself and toward the many that have... Billboard.com 3 hours ago - Entertainment Scarface, known for his gritty street wise narratives, received the \"I Am Hip Hop\" award at the 10th annual BET Hip-Hop Awards in Atlanta. MyNorthwest.com 15 hours ago - Entertainment Atlanta is undoubtedly the international travel hub of the South and this weekend it will undoubtedly act as the world’s hip-hop hub. The world’s largest... bizjournals 20 hours ago - Business Also reported by • MyNorthwest.com The 10th annual BET Hip-Hop Awards are getting ready for next week's broadcast with a taping in Atlanta CBS News 1 day ago - Entertainment *By The Canadian Press* ATLANTA — The 10th annual BET Hip-Hop Awards are getting ready for next week's broadcast with a taping in Atlanta, and Drake is back... CJME 1 day ago - World Also reported by • MyNorthwest.com Bad Boy Entertainment has an epic new partner The label, founded by Sean \"Diddy\" Combs, has signed an exclusive partnership with Epic Records. The artist and... Mashable 5 days ago - Internet You Might Like", "external_links": [], "published": "2015-10-10T21:25:00.000+03:00", "crawled": "2015-10-10T21:37:16.650+03:00", "highlightTitle": ""}