{"organizations": [], "uuid": "f9eea22b018ffdef82010809c41849b4b1282e8a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "http://images.worldnow.com/AP/images/9065364_G.jpg", "site_section": "http://www.cbs8.com/category/73801/entertainment", "section_title": "Entertainment News | Movies, TV, Celebrity Gossip - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30315610/vice-media-goes-dark-for-journalist-jailed-in-turkey", "country": "US", "title": "Vice Media goes dark for journalist jailed in Turkey", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Vice Media goes dark for journalist jailed in Turkey - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "f9eea22b018ffdef82010809c41849b4b1282e8a"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30315610/vice-media-goes-dark-for-journalist-jailed-in-turkey", "ord_in_thread": 0, "title": "Vice Media goes dark for journalist jailed in Turkey", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By DESMOND BUTLER\nAssociated Press ISTANBUL (AP) - Vice Media is carrying out a two-hour blackout on its websites to call attention to an Iraqi Kurdish journalist who has been held in Turkish jails without charges since being arrested while working for the news organization.\nMohammed Rasool has been in jail for nearly eight weeks. He was detained while serving as a fixer for two British journalists for Vice News covering the conflict in Turkey's Kurdish southeast. On Wednesday, Vice News' parent group was directing all of its digital sites to a petition addressed to Turkish President Recep Tayyip Erdogan that calls for Rasool's release.\nVice Media organized the petition with the U.S.-based Committee to Protect Journalists. CPJ Executive Director Joel Simon called Rasool's case \"a tremendous injustice.\"\n\"It is also a reminder of the essential role of media support staff, the fixers, stringers, translators and drivers who risk their lives to bring us the news,\" he said.\nRasool, who marked his 25th birthday on Tuesday, was arrested Aug. 27 along with Vice's Jake Hanrahan and Philip Pendlebury. The three journalists had traveled to towns along Turkey's border with Iraq, the center of renewed violence between Kurdish militants and government forces.\nHanrahan and Pendlebury were released 11 days later, but Rasool has remained in a high-security jail. Turkish authorities have neither indicted him nor adequately explained why they are holding him. His case is being conducted under a secrecy order, so his lawyers don't have access to the files against him, they say. Some colleagues and friends have seen him, but the interactions have been limited.\nVice, which calls itself a youth media company, says it is setting the blackout at peak viewing time so that millions will see the petition and video on Rasool. Vice says its sites get 100 million unique visitors per month.\n___\nOn the Web:\nhttps://news.vice.com/\n____\nOn Twitter: Desmond Butler at https://twitter.com/desmondbutler\nCopyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "external_links": ["https://news.vice.com/", "https://twitter.com/desmondbutler"], "published": "2015-10-21T03:00:00.000+03:00", "crawled": "2015-10-21T17:51:25.143+03:00", "highlightTitle": ""}