{"organizations": [], "uuid": "d577fce71402869f9f61cba65374740f67ecd513", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mid-day.com", "main_image": "http://images.mid-day.com/images/2015/oct/26-Dijana-Dejanovic_l.jpg", "site_section": "http://www.mid-day.com/Resources/midday/rss/entertainment.xml#", "section_title": "entertainment", "url": "http://www.mid-day.com/articles/serbian-starlet-dijana-dejanovics-big-moment/16633185", "country": "IN", "title": "Serbian starlet Dijana Dejanovic's big moment", "performance_score": 0, "site": "mid-day.com", "participants_count": 1, "title_full": "Serbian starlet Dijana Dejanovic's big moment - Entertainment", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T02:00:00.000+02:00", "replies_count": 0, "uuid": "d577fce71402869f9f61cba65374740f67ecd513"}, "author": "Letty Mariam Abraham", "url": "http://www.mid-day.com/articles/serbian-starlet-dijana-dejanovics-big-moment/16633185", "ord_in_thread": 0, "title": "Serbian starlet Dijana Dejanovic's big moment", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "When Serbian actress Dijana Dejanovic, who is gearing up for her Bollywood debut with 'Main Aur Charles' met Hollywood director Michael Hoffman\nRandeep Hooda-starrer 'Main Aur Charles', which is due for release this week, has been earning rave reviews in the festival circuit. While everyone is going gaga over the heartthrob's performance, Serbian actress Dijana Dejanovic, who also features in the film, was taken by surprise when someone noticed her. And that someone happened to be none other than Hollywood ace filmmaker Michael Hoffman.\n\nSerbian actress Dijana Dejanovic \n\"I knew that Mr Hoffman was invited to see 'Main Aur Charles', and I was curious about what he will think about it. Having said that, I never expected him to call me right after he saw the movie and praise my performance. I just couldn't believe that it was happening. I have seen a few of Mr Hoffman's movies. However, 'One Fine Day' (1996) with George Clooney and Michelle Pfeiffer is my favourite.\"\nThe actress, who hails from Bosnia and started her modelling career in Kolkata four years ago, reveals that she was invited to dinner with Hoffman and a few producers. \"It was a casual dinner where we met and spent some time discussing about many things like comparisons between Bollywood and Hollywood, America and India. Mr Hoffman told me he would love to work in India and I am sure we will meet again.\nI was so nervous about the meeting, but when I did, I did not feel like I was sitting with some big Hollywood director. He was a nice person to be around and easy to talk to,\" adds Dijana.", "external_links": [], "published": "2015-10-26T02:00:00.000+02:00", "crawled": "2015-10-26T07:05:02.438+02:00", "highlightTitle": ""}