{"organizations": [], "uuid": "5bcabf7ffcdbbdd690582e8b0f7888eb57f2690d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48524/c", "section_title": "Entertainment - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30216627/unmasking-business-success", "country": "US", "title": "Unmasking Business Success", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Unmasking Business Success - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "5bcabf7ffcdbbdd690582e8b0f7888eb57f2690d"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30216627/unmasking-business-success", "ord_in_thread": 0, "title": "Unmasking Business Success", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Theatre Forward\nExecutive Perceptions of Arts Engagement and Workforce Skills\nNational Survey Reports 92% of Business Executives Feel Young People Are Not Well Prepared to Enter Workforce\n58% Agreed Participating in the Arts Develop Workplace Skills Require For Competitive Edge\nNEW YORK , Oct. 8, 2015 /PRNewswire-USNewswire/ -- At a breakfast business panel forum held today at the Microsoft Center, Theatre Forward -a national network of non-profit theatres, companies and funders supporting 19 of America's leading theatres-released findings from its commissioned survey, Unmasking Business Success affecting both the business and arts sectors.\nUnmasking Business Success is the first research of its kind to specifically measure the impact arts engagement has on the development of skills, which executives believe are essential for success in a competitive global marketplace.\nThe survey included senior executives from 200 corporations, non-profits and government agencies.\nThe results illustrate overwhelming consensus that young people entering today's workforce lack strength in key areas which arts education could help to develop.\n92% of business executives feel young people are not well prepared to enter the workforce for success. 58% (when directly asked) agreed that participating in the arts developed essential workplace skills required for maintaining a competitive edge. 89% responded they participated in the arts in some fashion. 47% said arts significantly contribute to their career success skills development of use daily in their jobs. 58% believe participating in the arts strongly impact the type of person they are. PERCEPTION GAP – A CALL TO ACTION\nAs encouraging as the findings are for the arts community, other findings from the survey are more challenging. There is a disconnect in the minds of executives.\nAlarmingly, unprompted (unaided), only 8% made the direct connection between origins and affect. For an Executive Summary and NEWS Video of Unmasking Business Success please go to: http://www.theatreforward.org/success\nPlease Note: This site isn't live until 10/08/15 @ 11 am\nPROVEN TRACK RECORD – AN ORGANIZATION REIMAGINED AND EXPANDED\nFor nearly four decades, Theatre Forward ( formerly known as the National Corporate Theatre Fund ) has been dedicated to advancing American theatre and its communities by providing funding and other resources to the country's leading nonprofit theatres.\nwww.theatreforward.org\nThe report was funded by The Schloss Family Foundation.\nContact: (National/Business)\nPeter B. Carzasty\nGeah ! Ltd.\npcarzasty@verizon.net\nPhone: 212.255.4528\nCell: 917.620.9042\nContact: (Institutional)\nEmily Miller\nDirector Strategic Partnerships\nTheatre Forward\nemiller@theatreforward.org\n505 Eighth Avenue, Suite 2303, New York, NY 10018\nPhone: 212.750.6895\nMobile: 561.212.0379\nVideo - http://youtu.be/NO0bowdNGJA\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/unmasking-business-success-300156244.html\n©2015 PR Newswire. All Rights Reserved.", "external_links": ["http://www.youtube.com/watch?v=NO0bowdNGJA?version=3", "http://www.xmlnews.org/ns/", "http://www.theatreforward.org/", "http://www.theatreforward.org/success", "http://www.prnewswire.com/news-releases/unmasking-business-success-300156244.html", "http://youtu.be/NO0bowdNGJA", "http://rt.prnewswire.com/rt.gif?NewsItemId=DC22972&Transmission_Id=201510081106PR_NEWS_USPR_____DC22972&DateId=20151008"], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-08T19:01:35.945+03:00", "highlightTitle": ""}