{"organizations": [], "uuid": "bab18abf47b4958f09e2bc241208bec3ad3f06b8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ctvnews.ca", "main_image": "http://www.ctvnews.ca/polopoly_fs/1.2602600.1444392138!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "site_section": "http://www.ctvnews.ca/rss/ctvnews-ca-entertainment-public-rss-1.822292", "section_title": "CTVNews.ca - Entertainment - Public RSS", "url": "http://www.ctvnews.ca/entertainment/breaking-bad-star-brings-blacklisted-director-to-big-screen-1.2602598", "country": "CA", "title": "'Breaking Bad' star brings blacklisted director to big screen | Entertainment & Showbiz from CTV News", "performance_score": 0, "site": "ctvnews.ca", "participants_count": 1, "title_full": "'Breaking Bad' star brings blacklisted director to big screen | Entertainment & Showbiz from CTV News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "bab18abf47b4958f09e2bc241208bec3ad3f06b8"}, "author": "AFP", "url": "http://www.ctvnews.ca/entertainment/breaking-bad-star-brings-blacklisted-director-to-big-screen-1.2602598", "ord_in_thread": 0, "title": "'Breaking Bad' star brings blacklisted director to big screen | Entertainment & Showbiz from CTV News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON -- The London Film Festival on Thursday honoured the late \"Spartacus\" screenwriter Dalton Trumbo, who was blacklisted in Hollywood during the days of McCarthyism, by hosting the European premiere of the eponymous biopic \"Trumbo\" starring Bryan Cranston.\nTrumbo is sympathetically portrayed by Cranston, who shot to international fame playing chemistry teacher turned meth dealer Walter White in the hit television series \"Breaking Bad.\"\n\"It's a cautionary tale, it happened in the United States and this man went to prison for nearly a year without committing a crime,\" said the 59-year-old actor.\n\"The message resonates internationally, when a government overreaches its powers and the press breach civil rights,\" he told reporters ahead of the premiere.\nTrumbo -- one of the so-called \"Hollywood Ten\" who refused to testify before the House Un-American Activities Committee in 1947 -- finds his nemesis in the form of dreaded socialite columnist Hedda Hopper, played by British Oscar-winner Helen Mirren.\nWith her impeccable manners and haute-couture wardrobe, Hopper makes a formidable \"red\" hunter.\nAsked about facing the real Hopper, the actress replied: \"She would have scared... me.\n\"I have never been a big fan of celebrity journalism. I find it boring.\"\nThe 70-year-old said \"Trumbo\" was a \"story about the fearful power of the press and how it can be misused\".\nFound \"guilty\" of belonging to the American Communist party, the biopic follows the \"Johnny Got His Gun\" author and director as he spends a year in prison, away from his wife (played by Diane Lane) and children.\nHe was also put on a blacklist of Hollywood \"traitors\" to prevent him from working.\nDark humour \nBut Trumbo's obstinacy and talent, fuelled by whisky and cigarettes, saw him craft some of his greatest works during that time, that were either signed off by friends or written under a pseudonym.\nIndeed, he even won two Oscars for \"Roman Holiday\" and \"The Brave One\", which he penned under the name Robert Rich.\nThe film recounts how \"the highest-paid writer in the world\" is ostracised by society after falling victim to the humiliation of McCarthyism.\nBut despite the gloom, a thread of dry humour runs through the story.\n\"I think it's the best form of humour, not based on jokes but the absurdity of human behaviour,\" said Mirren.\nDirected by Jay Roach, who is best known for the \"Austin Powers\" movies, the film charts Trumbo's Hollywood comeback thanks to the help of his friends and pays homage to the support offered by certain producers, primarily Frank King, played by \"The Big Lebowski\" star John Goodman.\nThe film also offers a history lesson in American cinema and the semi-mythical stars of the time. Kirk Douglas makes an appearance as a rising star who becomes the first person to officially credit Trumbo, who died in 1976, for writing \"Spartacus\".\nConservative icon John Wayne also makes a cameo, as does ultra-demanding director Otto Preminger, who openly hired Trumbo to write the screenplay for \"Exodus\".\nAsked about the climate in tinseltown today, Cranston said there existed a \"self-imposed\" Hollywood blacklist, citing as an example actor Mel Gibson, who has been dogged by a 2006 anti-Semitic outburst.\n\"I hope there aren't any political or sexual orientation blacklists -- I think we are moving out of that as a society and that's a great thing,\" he said.", "external_links": [], "published": "2015-10-09T03:00:00.000+03:00", "crawled": "2015-10-09T20:00:59.030+03:00", "highlightTitle": ""}