{"organizations": [], "uuid": "e647f604a3bf356ec8419c319ad3c5f4ba881a48", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.jokpeme.com", "main_image": "", "site_section": "http://www.jokpeme.com/feeds/posts/default?alt=rss", "section_title": "Jokpeme News - Europe,US,Middle East,UK,Asia,Africa,Latin America,Entertainment & World News", "url": "http://www.jokpeme.com/2015/10/us-coast-guard-scoured-bahamian-ship.html", "country": "US", "title": "Britain and France migrants shut down Channel Tunnel", "performance_score": 0, "site": "jokpeme.com", "participants_count": 1, "title_full": "Britain and France migrants shut down Channel Tunnel", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T15:57:00.000+03:00", "replies_count": 0, "uuid": "e647f604a3bf356ec8419c319ad3c5f4ba881a48"}, "author": "noreply@blogger.com (Toolzo Omosexy)", "url": "http://www.jokpeme.com/2015/10/us-coast-guard-scoured-bahamian-ship.html", "ord_in_thread": 0, "title": "Britain and France migrants shut down Channel Tunnel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "U.S. Coast Guard scoured Bahamian Ship missing with 33 on board after hurricane. Saturday, 3 October 2015 People watch the waves on a beach in North Carolina. Photo / AP The U.S. Coast Guard scoured Bahamian waters for a disabled cargo ship with 33 crewmembers, including 28 Americans, that lost contact during Hurricane Joaquin, which was moving away from the sprawling archipelago today. The 224-metre ship named El Faro had taken on water and was listing at 15 degrees near Crooked Island, one of the islands most battered by the hurricane. The Coast Guard said it hadn't been able to re-establish communication with the vessel, which was traveling from Jacksonville, Florida, to San Juan, Puerto Rico, when it ran into the storm and became disabled near Joaquin's eye. A satellite image, taken on October 2, showing Hurricane Joaquin over the Bahamas. Picture / AP Officials said the crew - 28 Americans and five Polish nationals - earlier reported they had been able to contain the flooding. \"We're going to go and try and save lives. We're going to push it to the operational limits as far as we can,\" Coast Guard Capt. Mark Fedor said of rescue efforts. Fedor said there were up to 9-metre waves in the area, and that heavy winds could have destroyed the ship's communications equipment. The ship went missing when Joaquin was a Category 4 storm. The hurricane has since lost strength and become a Category 3 storm. Late Friday, the Coast Guard said the planes and helicopters involved in the search had returned to base because of darkness and would resume the search for the ship at first light. Florida-based TOTE Services, the ship's owner, said in a brief statement that it was working with the Coast Guard and trying to establish communication with the ship.Joaquin, meanwhile, was moving away from the Bahamas on Saturday. Its threat to the U.S. East Coast was fading as new forecasts showed it likely to curve out into the Atlantic while moving north and weakening in coming days. Authorities in the Bahamas were expected to need days to assess damage on the hundreds of islands and cays that form the archipelago. On Friday, it destroyed houses, uprooted trees and unleashed heavy flooding as it hurled torrents of rain across the Bahamas. There had been no reports of fatalities or injuries so far, said Capt. Stephen Russell, the director of the Bahamas National Emergency Management Agency. Officials were investigating reports of shelters being damaged and flooded, as well as two boats with a total of five people that remained missing. About 85 percent of homes in one settlement of a couple dozen houses on Crooked Island were destroyed, said Marvin Hanna, an Acklins representative. He said he has had no communication with Acklins since late Thursday morning.\"At that time, vehicles were floating around and the water level was up to the windows of some homes,\" he said. Residents reached by relatives said they were \"trapped in their homes, and reported feeling as if their structures were caving in,\" Russell said. \"It's too dangerous to go outside because the flood waters are so high, so we ask that persons stay inside and try to go into the most secure place of their home.\" Power also was knocked out to several islands, and Leslie Miller, executive chairman of the Bahamas Electricity Corporation, said the company \"is in no position to do much\" to restore electricity. \"All the airports are flooded,\" he said. Schools, businesses and government offices were closed as the slow-moving storm roared through the island chain. Joaquin had maximum sustained winds of 205 kph, according to the Miami-based hurricane center. By late Friday night, the storm was centered about 95 kilometers north-northeast of San Salvador, Bahamas and was moving northeast near 17 kph. Rick Knabb, director of the hurricane center, said Joaquin is expected to pass well offshore from the eastern seaboard. \"We no longer have any models forecasting the hurricane to come into the East Coast,\" he said. \"But we are still going to have some bad weather.\" In addition, the entire East Coast will experience dangerous surf and rip currents through the weekend, he said.\" Joaquin is going to generate a lot of wave energy,\" Knabb said, adding that Bermuda might issue a tropical storm or hurricane watch, depending on Joaquin's path.", "external_links": [], "published": "2015-10-03T15:57:00.000+03:00", "crawled": "2015-10-03T16:34:40.365+03:00", "highlightTitle": ""}