{"organizations": [], "uuid": "bdaf54918ab9cc2e09573183e0bce888b99e73af", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.aceshowbiz.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Aceshowbizcom-EntertainmentNews\r", "section_title": "Aceshowbiz.com - Entertainment News", "url": "http://www.aceshowbiz.com/news/view/00089836.html", "country": "US", "title": "'Cosby Show' Stars Weigh In on Ebony's Controversial Cover", "performance_score": 0, "site": "aceshowbiz.com", "participants_count": 1, "title_full": "'Cosby Show' Stars Weigh In on Ebony's Controversial Cover", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T05:30:00.000+03:00", "replies_count": 0, "uuid": "bdaf54918ab9cc2e09573183e0bce888b99e73af"}, "author": "AceShowbiz.com", "url": "http://www.aceshowbiz.com/news/view/00089836.html", "ord_in_thread": 0, "title": "'Cosby Show' Stars Weigh In on Ebony's Controversial Cover", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments The cover in question features an image Bill Cosby and his on-screen family behind shattered glass. \nEbony tackles Bill Cosby 's scandal and tries to examine the real Cosby versus his \"The Cosby Show\" character Cliff Huxtable in its November issue. The said edition features a group shot of the show's cast on its cover, which has drawn mixed reactions from Twitter users. The aforementioned cover picture is actually an old photo of Cosby and his co-stars, including Phylicia Rashad and the four actors playing his children. The family portrait is depicted behind shattered glass which almost obscures Cosby's smile. #ICYMI - our November issue separates Cliff Huxtable & Bill Cosby. Start the conversation: http://t.co/ALEaVEslpO pic.twitter.com/ntL4qTrotV — EBONY MAGAZINE (@EBONYMag) October 16, 2015 Explaining its decision to use the controversial cover, Ebony said in a statement, \"This is our annual Family Issue and we decided, after much deliberation, to go with a focus on what we felt was an urgent and provocative conversation happening within the Black community. It wasn't just about making a statement; the cover is also asking questions.\" \"Can we separate the man with 50 or more allegations of sexual assault and related crimes against him from the fictional, heroic father?\" the statement continued. \"Should we? I think it is fair to say that no matter what someone feels about our cover, Ebony is not the reason there is a shattered family image we are dealing with. This is a moment of reflection, for many Black people, a painful one for different reasons.\" @CerromeRussell defended Ebony, writing, \"Bill Cosby shattered his own image, Ebony just printed the cover.\" @Luvvie praised the magazine, \"MANNNN @EbonyMag went where it needed to go. This cover is instantly iconic. Props to @kiernamayo and team!\" However, some others disagreed. @LovelyZinga tweeted, \"Do not like this issue of ebony cover I understand what Bill Cosby did was disgusting but they cover brings down the legacy of a blk family!\" @StarchildBarr echoed the sentiment, \"I dont like that new Ebony mag cover. Im sorry but u cant erase the legacy of Bill Cosby he has done wa to much 2 much!\" Appearing on \" The View \" Friday morning, October 16, Malcolm-Jamal Warner who was reunited with co-star Raven-Symone weighed in on the issue. \"We really don't have enough time on this show to really talk about how I feel about that,\" said Warner, who played one of Cosby's on-screen children, Theo Huxtable. \"That's the show that we've all very proud to have been on,\" he added. \"When we've had images that perpetuate the negative stereotype of people of color, we've always had The Cosby Show to hold up against that. And the fact that we no longer have that, kinda leaves us not in a great place in terms of having the wide scope of the images of people of color.\" \"The View\" co-host Raven-Symone chimed in, \"Let's not forget that 'The Cosby Show' was a sitcom and not a reality show. Let's just remember that this was a sitcom and we had writers and things of that nature.\" \n© AceShowbiz.com", "external_links": [], "published": "2015-10-17T05:30:00.000+03:00", "crawled": "2015-10-17T10:19:49.690+03:00", "highlightTitle": ""}