{"organizations": [], "uuid": "0d8d121d92735b9e61a84dcb0547e5d0ce666d52", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.jokpeme.com", "main_image": "", "site_section": "http://www.jokpeme.com/feeds/posts/default", "section_title": "Jokpeme News - Europe,US,Middle East,UK,Asia,Africa,Latin America,Entertainment & World News", "url": "http://www.jokpeme.com/2015/10/man-in-thailand-texts-wife-to-break-up.html", "country": "US", "title": "Man in Thailand texts wife to break up after lotto win", "performance_score": 0, "site": "jokpeme.com", "participants_count": 1, "title_full": "Man in Thailand texts wife to break up after lotto win", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T14:07:00.000+03:00", "replies_count": 0, "uuid": "0d8d121d92735b9e61a84dcb0547e5d0ce666d52"}, "author": "Watson William (noreply@blogger.com)", "url": "http://www.jokpeme.com/2015/10/man-in-thailand-texts-wife-to-break-up.html", "ord_in_thread": 0, "title": "Man in Thailand texts wife to break up after lotto win", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Man in Thailand texts wife to break up after lotto win Saturday, 17 October 2015 The couple won NZ$1.24 million in the lottery. Photo / Getty Images A Thai woman is suing the father of her son for child support after he said he wanted to break up with her in a text message a few weeks after winning NZ$1.24 million in a lottery. Saowanee Thongwiset is seeking 10 million baht (NZ$415,000) to raise their 8-month-old son and educate him, her lawyer, Theerapon Pochanukul, told The Associated Press Friday. The amount is one-third of the 30 million baht (NZ$1.24 million) that her common law husband, a clothing store security guard in northeastern Thailand, won as the first prize in a lottery on Sept. 16. The couple, who were living together at the time, cashed the winnings together at a local bank and deposited the money in the man's account, Theerapon said. A few days later the husband, Thammarong Keawsuanjik, transferred 700,000 baht (NZ$29,000) into the accounts of the wife and their son, which is being maintained by the mother. Then on Monday, the 28-year-old woman received a text message from Thammarong saying, \"Let's break up,\" said Theerapon. Her husband bought land with the money and is now building a house, the lawyer said. Besides seeking a share of the winnings, Saowanee has also gone to the Juvenile and Family Court to make the man register their baby as his lawful son. \"Saowanee believes that if he is honest and wants to keep the family he would have taken her to see the land that he bought and talk to her about it,\" said Theerapon. She will continue with the lawsuit unless they can come to an agreement during a pre-trial hearing on Nov. 30, he said. Thammarong and his lawyer could not be immediately reached for comment. But he told the Thai language Matichon newspaper that now that she's gone to court, he might counter-sue her for custody of the baby.", "external_links": [], "published": "2015-10-17T14:07:00.000+03:00", "crawled": "2015-10-17T17:39:02.788+03:00", "highlightTitle": ""}