{"organizations": [], "uuid": "20de6d3012ee11e4d28ac38ce9c5aabb15465642", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canindia.com", "main_image": "http://canindia.com/wp-content/uploads/2012/06/01/Avatar.jpg", "site_section": "http://www.canindia.com/category/entertainment/feed/", "section_title": "CanIndia NEWS » Entertainment Archive » CanIndia NEWS", "url": "http://www.canindia.com/2015/10/rudhramadevi-made-tax-free-in-telangana/", "country": "US", "title": "‘Rudhramadevi’ made tax free in Telangana", "performance_score": 0, "site": "canindia.com", "participants_count": 1, "title_full": "‘Rudhramadevi’ made tax free in Telangana", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T17:48:00.000+03:00", "replies_count": 0, "uuid": "20de6d3012ee11e4d28ac38ce9c5aabb15465642"}, "author": "NewsWire", "url": "http://www.canindia.com/2015/10/rudhramadevi-made-tax-free-in-telangana/", "ord_in_thread": 0, "title": "‘Rudhramadevi’ made tax free in Telangana", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "0 0 0 0 0 Hyderabad, Oct 8 (IANS) The Telangana government has exempted, from entertainment tax, Telugu movie “Rudhramadevi”, which is set to hit the screens on Friday. Chief Minister K. Chandrasekhar Rao made the announcement when the film unit called on him here on Thursday. Director-cum-producer Gunasekhar, co-producer Neelima Guna and distributor Dil Raju met the chief minister and requested him for entertainment tax exemption. The chief minister said as the movie is based on Kaktiya dynasty and the life of warrior queen Rudramma Devi, highlighting Telangana’s history and culture, it will be exempted from tax . Top actress Anushka Shetty had played Rudramma Devi in what is claimed to be India’s first historical stereoscopic 3D film . The multi-lingual movie, which also features Allu Arjun, Rana Daggubati, Krishnamraju, Nithya Menen and others, is releasing on Friday in Andhra Pradesh, Telangana and other states. It is set to hit over 400 theatres in Telangana alone. The Rs.80 crore movie was first shot simultaneously in Telugu and Tamil and later dubbed into Kannada, Hindi and Malayalam. It is slated to released in both 2D and 3D formats in over 160 screens in the United States. “Rudhramadevi” is the talk of the town as the industry hopes it will be as successful as “Baahubali”, one of the biggest grosser this year. Meanwhile, “Baahubali” director S.S. Rajamouli has appealed to the Andhra Pradesh government to follow Telangana and exempt “Rudhramadevi” from tax . “‘Rudramadevi’ is a queen for all Telugu land and I think even the govt of AP should and will exempt this film from tax,” he tweeted. Related Posts", "external_links": [], "published": "2015-10-08T17:48:00.000+03:00", "crawled": "2015-10-08T18:16:44.194+03:00", "highlightTitle": ""}