{"organizations": [], "uuid": "5a2e3df7f76809a3f022d883b298ec05a9cbd638", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nj.com", "main_image": "http://imgick.nj.com/home/njo-media/width620/img/entertainment_impact/photo/18967383-standard.jpg", "site_section": "http://blog.nj.com/entertainment_impact/rss.xml", "section_title": "Entertainment", "url": "http://www.nj.com/entertainment/index.ssf/2015/10/8_best_things_to_do_in_nj_this_weekend.html", "country": "IL", "title": "8 best things to do in N.J. this weekend", "performance_score": 0, "site": "nj.com", "participants_count": 1, "title_full": "8 best things to do in N.J. this weekend", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T17:05:00.000+03:00", "replies_count": 0, "uuid": "5a2e3df7f76809a3f022d883b298ec05a9cbd638"}, "author": "Bill Bodkin | For NJ Advance Media", "url": "http://www.nj.com/entertainment/index.ssf/2015/10/8_best_things_to_do_in_nj_this_weekend.html", "ord_in_thread": 0, "title": "8 best things to do in N.J. this weekend", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "8 best things to do in N.J. this weekend BLAZING SADDLES Mel Brooks, the writer, director and co-star of \"Blazing Saddles,\" center, will be at NJPAC Thursday to screen and discuss the film. (Warner Bros. ) Comments \nMEL BROOKS SCREENS 'BLAZING SADDLES' \nComic provocateur Mel Brooks has said he doubts that in today's sensitive climate he could have made \"Blazing Saddles,\" his 1974 racial satire wrapped in a Western spoof inside a cinematic lunacy. \" We're too courteous about hurting people's feelings,\" he told HitFix.com last year. \"You know? We're politically correct. All of these things that I'm saying? We're shy, we're polite, we're politically correct? It's the death of comedy.\" Get the inside scoop on \"Blazing Saddles\" and its legacy (or sadly, lack thereof) as Brooks screens the film and participates in a question-and-answer session with audience members at \"Mel Brooks: Back in the Saddle Again\" at NJPAC's Prudential Hall Thursday night. $49.50-$99.50. Thursday, 7:30 p.m. NJPAC, 1 Center St., Newark. \nASBURY UNDERGROUND \nThe streets of Asbury Park will come alive with music this Saturday during Asbury Underground . The semi-annual event features dozens of local Asbury-centric musicians performing special acoustic sets in art galleries, shops and eateries throughout downtown AP. Featured performers include: Nicole Atkins, Mark Melicia (The Parlor Mob), Chris Brown, Zach Moyle (Lost in Society), Deal Casino, and Doug Zambon (The VanSaders) along with a virtual who's who of Asbury mainstays. The daylong event features live outdoor art displays and exhibitions, while all the galleries in Asbury will have their doors open to the public. This event stretches out to the boardwalk and will help celebrate the unveiling of the Wooden Walls Mural Project (5 p.m.), an ongoing art exhibit that has seen local and international artists contribute murals to the carousel, casino, and steam plant at the south end of the boardwalk. Free. Saturday, Noon to 7 p.m. Cookman Avenue-Asbury Park Boardwalk. \nFALL FOOD TRUCK FIESTA \nAs the autumnal chill begins to hit New Jersey, it feels like the window for food truck weather is slowly closing. Luckily there's events such as the Fall Food Truck Fiesta to sate your hunger for food prepared a la truck. The Fiesta will take place this Saturday at the Mercer County Fairgrounds in West Windsor. Trucks will include The Empanada Guy, Ms. Fu's, The Pizza Wagon, and more . There's activities for the little ones ranging from pony rides and petting zoos to bounce houses. There's live music during the day from the likes of the Springsteen tribute band Tramps Like Us and party rock cover band Gypsy Wisdom . The Hopewell Valley Winery will be on hand to tend to the libations, and if the wine doesn't keep your warm, the fire pits will. $5 (two & under free). Saturday, 11 a.m. to 7 p.m. 1638 Old Trenton Road, West Windsor. Mayday Parade, who dropped their new album \"Black Lines\" on October 9, will be headlining the Alternative Press Tour at The Starland Ballroom in Sayreville. Photo Credit: Fearless Records \nTHE AP TOUR BRINGS PUNK ROCK TO STARLAND \nOn Saturday night Sayreville will get a little bit punk rock as The Alternative Press Tour will roll into the town Bon Jovi built. The tour, sponsored by Hot Topic, will be headlined by Mayday Parade, who dropped its new record \"Black Lines\" (Fearless Records) on Oct. 9. Now they're coming to the Garden State and they aren't alone. The AP Tour features a supporting line-up that includes the increasingly popular pop punk outfit Real Friends, along with This Wild Life and As It Is. $25 in advance, $30 day of. Friday, 7 p.m. 570 Jernee Mill Road, Sayreville, (732) 238-5500. Friday, October 16 at 5:30 PM Mayday Parade Starland Ballroom SEE FULL EVENT DETAILS nj.com \nWHISKEY FESTIVAL OF NJ \nA wise man once proclaimed, \"I love scotch. Scotchity scotch scotch scotch.\" So, if you want to channel your inner Ron Burgundy , imbibe at the first-ever Whiskey Festival of New Jersey on Saturday. The event will take place in Jersey City at Taphaus , a riverfront restaurant on Second Street, starting at 6:30 p.m. There will be more than 100 types of whiskey, bourbon, scotch and rye — including some that are more than 15 years old. Taphaus bartenders will be creating specialty cocktails for the evening, while the kitchen will be preparing food for the event. A portion of the proceeds for the Whiskey Festival will go to the York Street Project , which helps the poor of Jersey City. So this is drinking for a good cause. $75 per person. Saturday, 6:30 p.m. - 9:30 p.m. 2 Second Street, Jersey City. \nTHE CHATSWORTH CRANBERRY FESTIVAL \nWith all the talk of the Jersey Devil sighting these days, one tends to forget that the Pine Barrens is actually a pretty beautiful area. The famed cranberry bogs are a big part of this, so locals will celebrate the bog's beauty (and the recent cranberry harvest) at the 32nd Annual Chatsworth Cranberry Festival . The festival takes place Saturday and Sunday, taking over downtown Chatsworth with an endless sea of vendors, local craftsmen, and food vendors, many of whom do delicious things with cranberries. Southern rock cover band Bullzeye will provide the soundtrack, and there will be a classic car show for aficionados. Part of the proceeds of the festival will go towards to the restoration and preservation of the historic White Horse Inn. $5. Saturday and Sunday, 9 a.m. - 5 p.m. Downtown Chatsworth. Scenes from On Kentucky Avenue, a musical set in Atlantic City in the summer of 1969, which will run this weekend at the Union County Performing Arts Center in Rahway. Union County Performing Arts Center \nON KENTUCKY AVENUE AT UNION COUNTY PERFORMING ARTS CENTER \n\" On Kentucky Avenue ,\" a musical about Atlantic City's famed musical street, will come to the Union County Performing Arts Center in Rahway this weekend. For those unaware, Kentucky Avenue is on the north side of Atlantic City, and was once filled with music venues that hosted some of the most iconic names in music — Nat King Cole, Louis Armstrong, Billie Holiday, Lena Horne, etc. \"On Kentucky Avenue\" takes place at Club Harlem on the day of its opening for the 1969 season, and tells the story of a love triangle between three of the club's main performers. The musical is a blend of an original score and classic songs from the 1960s including \"Shout,\" \"Respect,\" and \"The Name Game.\" $22.50, Friday-Sunday, 360 Hamilton Street, Rahway, (732) 499-8226. Friday, October 16 at 8:00 PM \"On Kentucky Avenue\" Union County Performing Arts Center's Hamilton Stage SEE FULL EVENT DETAILS nj.com \nBIZARRE AC III \nThe Chelsea Hotel will be hosting the third annual Bizarre AC show this weekend, a unique event that has elements of a traditional \"con.\" There's a number of crazy live interactive programs, and celebrity-hosted parties throughout the hotel that make this more than a \"Here's a panel, here's a line for autographs\" event. For example, there's a \"Surviving 28 Days\" experience which puts you in a \"28 Days Later\"-esque zombie apocalypse in the Chelsea's parking deck. Your goal is to make it to the end without being \"bitten\" by a zombie. It actually sounds really frightening. If that's a little too much, there are panels and discussions, an appearance from Eric Roberts, and the aforementioned parties hosted by \"Clerks\" star Brian O'Halloran, former WWE star Snitsky, and Misfits alum Doyle Von Frankenstein. $20 ( single day ), $55 (weekend pass). Friday-Sunday, 111 South Chelsea Avenue, Atlantic City. Bill Bodkin can be reached at bodkinwrites@gmail.com . Find NJ.com/Entertainment on Facebook .", "external_links": [], "published": "2015-10-15T17:05:00.000+03:00", "crawled": "2015-10-15T19:42:29.089+03:00", "highlightTitle": ""}