{"organizations": [], "uuid": "f4502605bda064ec86102f48308f5105ea8734e2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dosavannah.com", "main_image": "http://www.dosavannah.com/sites/default/files/photos/dash.jpg", "site_section": "http://www.dosavannah.com/rss.xml", "section_title": "Do Savannah, arts and entertainment news for the Creative Coast - #dosavannah", "url": "http://www.dosavannah.com/article/wed-10072015-0120/sustainativity-hosts-second-annual-mattress-dash-fundraiser", "country": "US", "title": "Sustainativity hosts second annual Mattress Dash fundraiser", "performance_score": 0, "site": "dosavannah.com", "participants_count": 1, "title_full": "Sustainativity hosts second annual Mattress Dash fundraiser", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T08:20:00.000+03:00", "replies_count": 0, "uuid": "f4502605bda064ec86102f48308f5105ea8734e2"}, "author": "Heather Henley", "url": "http://www.dosavannah.com/article/wed-10072015-0120/sustainativity-hosts-second-annual-mattress-dash-fundraiser", "ord_in_thread": 0, "title": "Sustainativity hosts second annual Mattress Dash fundraiser", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sustainativity hosts second annual Mattress Dash fundraiser Photos courtesy of Sustainativity. 2014 Mattress Dash Photos courtesy of Sustainativity. 2014 Mattress Dash Tweet \nRemember how your mom told you not to jump on your bed? ‘Cause you might break it. Or the lamp. Or yourself. \nWell, forget that! It’s time to throw some wheels under that bad boy and have four costumed teammates push you all the way to the finish line. \nSustainativity , a local nonprofit taking a unique approach to investing in sustainability, is hosting its second annual Mattress Dash . Held on the south end of Forsyth Park, teams of five will race single mattresses with one rider on custom-built frames on Oct. 18. \nIF YOU GO \nWhat: Sustainativity’s second annual Mattress Dash \nWhen: 1 p.m. Oct. 18 \nWhere: South end of Forsyth Park \nCost: Team registration is $150; free to watch \nInfo: www.sustainativity.org \nTeams are encouraged to get creative with their frame designs, and prizes will be awarded for the Greenest Racing Frame, Judge’s Choice, People’s Choice and of course, Fastest Team. \n“Last year we had 11 teams and we saw a wide range of frames, including one made out of pallets,” says Tommy Linstroth, founder of Trident Sustainability Group. “Historic Savannah Foundation repurposed a historic gurney, and we saw some great themed frames, including Mario and the Princess, an airplane from Gulfstream, a pirate ship and event a Bon Jovi-themed Bed of Roses, which won the People’s Choice award.” Oxform, a local design studio that uses reclaimed materials, will be hand-crafting trophies from reclaimed wood. If that wasn’t enough of a reason to run as fast as you can, they’ve also got gift cards from Green Truck Pub. \nWhile the race begins at 1 p.m., participants need to be at the park by 12:30 p.m. to set up. The team registration fee is $150, and proceeds are being donated to Senior Citizens Inc., which will use the funds to retrofit some of its Meals On Wheels delivery vehicles to hybrid engines, and to replace old lighting in the building with new high-efficiency lighting. \n“I saw a similar race in Charleston, and felt — hey, if they can do it, we can do it Savannah-style. Plus, as an organization, Sustainativity looks for creative, non-traditional fundraisers that haven’t been seen in Savannah before,” Linstroth says. \nSustainativity partnered with Second Harvest Food Bank , providing a comprehensive lighting retrofit of its facility, which will save money for years to come. In fact, the money they’ll save from the lighting upgrade will provide an additional 10,000 meals for the hungry — every year. \nNow that’s a job well done. \n“Community response has been great. Our events have grown by about 50 percent in attendance over the past year. We have no overhead and 100 percent of individual contributions go directly toward implementing a sustainability project,” Linstroth adds. \nThis is one race even mom will approve of!", "external_links": [], "published": "2015-10-07T08:20:00.000+03:00", "crawled": "2015-10-12T22:08:20.086+03:00", "highlightTitle": ""}