{"organizations": [], "uuid": "2bfb6ca6570aadcb9b4bcd015d75e849cb4dc429", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.timesonline.com", "main_image": "http://bloximages.newyork1.vip.townnews.com/timesonline.com/content/tncms/assets/v3/editorial/3/43/343b7a90-76a5-11e5-a346-ef11b58fd2b9/52a52127a2ee1.image.jpg", "site_section": "http://www.timesonline.com/search/?q=&t=article&l=25&d=&d1=&d2=&s=start_time&sd=desc&c[]=news*,sports*,community*,entertainment/local_entertainment,columnists*&f=rss", "section_title": "www.timesonline.com - RSS Results in news*,sports*,community*,entertainment/local_entertainment,columnists* of type article", "url": "http://www.timesonline.com/news/local_news/ohio-river-s-huge-algae-bloom-a-warning-for-water/article_e1155ba6-769a-11e5-9379-3ffb2a495361.html", "country": "US", "title": "Ohio River's huge algae bloom a warning for water suppliers", "performance_score": 0, "site": "timesonline.com", "participants_count": 1, "title_full": "Ohio River's huge algae bloom a warning for water suppliers", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T00:30:00.000+03:00", "replies_count": 0, "uuid": "2bfb6ca6570aadcb9b4bcd015d75e849cb4dc429"}, "author": "Staff and wire reports", "url": "http://www.timesonline.com/news/local_news/ohio-river-s-huge-algae-bloom-a-warning-for-water/article_e1155ba6-769a-11e5-9379-3ffb2a495361.html", "ord_in_thread": 0, "title": "Ohio River's huge algae bloom a warning for water suppliers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Serving Beaver County, PA since 1874 \nMonday, October 19, 2015 6:19 PM Close Buy Now Lucy Schaly/The Times file \nBuildings are reflected in the water at the Beaver Falls Municipal Authority plant in Eastvale. General Manager Jim Riggio said the authority was aware of a recent algae outbreak in the Ohio River and has studied techniques to treat it. Ohio River's huge algae bloom a warning for water suppliers Buy Now Lucy Schaly/The Times file \nBuildings are reflected in the water at the Beaver Falls Municipal Authority plant in Eastvale. General Manager Jim Riggio said the authority was aware of a recent algae outbreak in the Ohio River and has studied techniques to treat it. \nA toxic algae outbreak that snaked more than 600 miles down the Ohio River past four states is forcing water utilities to reassess the threat from harmful algal blooms that are popping up increasingly around the nation. \nTreatment plant operators and researchers along the river were surprised by the large bloom and said it should be a warning to cities that get their water supply from lakes, rivers and manmade reservoirs. \n\"You need to be ready and have a plan in place,\" said Roger Tucker, who monitors algae sampling for the Louisville Water Co. in Kentucky. \"The Ohio River is proof of that.\" \nJim Riggio, general manager of the Beaver Falls Municipal Authority, said the authority was well aware of the latest algae bloom and even studied techniques to treat it. \nBut hopefully, Riggio said, they won’t know for a while if those treatments would work. \n“We looked at different treatment techniques to handle it, but we won’t know how to treat it until we see it again,” he said. \nUnfortunately, that might be sooner rather than later, Riggio said, as algae blooms seem to be occurring with more frequency. \n“We’ve seen it two or three times over the last couple of years,” he said. \nThe latest bloom appears to be winding down now, two months after being detected in the middle of August. It made its way from Wheeling, W.Va., and past Cincinnati and Louisville, Ky., setting off warnings about boating and fishing in the river. Organizers canceled a swim from Cincinnati to northern Kentucky. \nWhat surprised many along the river was the unprecedented size and level of toxins detected in some areas — well above those found recently in algae-plagued western Lake Erie. \nThe last toxic bloom on the river came in 2008. But that one covered about 30 miles and lasted a couple weeks. \nThis year, toxins produced by the algae didn't contaminate any municipal supplies along the river, which provides drinking water to about 5 million people. But utilities did spend more money to fight off the toxins that can cause rashes, diarrhea, vomiting and breathing difficulty. \nCincinnati spent $7,700 more per day in much of September to add chemicals to tap water. And the company that provides water to Huntington, W.Va., brought in new testing equipment and temporary pumps and pipes just in case it needed to draw from another river. \nResearchers say conditions this year were just right for the outbreak: Heavy rains in the early summer washed algae-feeding pollutants into the river, and a dry late-summer slowed down the currents. \n\"When you have months without much rainfall, the river really becomes a series of lakes,\" said Jeff Swertfeger, head of water quality for the Greater Cincinnati Water Works. \nUsually, the river flows too fast for algae blooms to develop. But as the river slows, it stirs up less sediment and allows more sunlight to penetrate the water and fuel the algae growth. \n\"The river changes year to year. This is the worst anyone has ever seen it,\" Swertfeger said. \"We don't expect it again and again. But we know it can happen.\" \nAlgae blooms are more common in lakes and reservoirs where the water is calm — a year ago one in Lake Erie fouled the drinking water in Toledo for more than two days. \nGina McCarthy, administrator of the U.S. Environmental Protection Agency, has said that harmful algal blooms are one of the nation's most serious and growing environmental challenges. Scientists say climate change and higher levels of nutrients such as phosphorus may be why they're seeing a rising number of algae contamination cases. \nBut not all blooms are toxic, said Gary Fahnenstiel, an algae expert with Michigan Technological University's Great Lakes Research Center. Still, a huge bloom on the Ohio River should be a wakeup call, he said. \"What we've learned is these things are increasing,\" Fahnenstiel said. \nAt the outset of this year's outbreak on the river, one water utility was surprised, thinking toxic algae was a problem limited to lakes, said Greg Youngstrom, an environmental specialist with the Ohio River Valley Water Sanitation Commission, which watches over the river's health. \n\"That attitude has changed,\" he said. Tags", "external_links": [], "published": "2015-10-20T00:30:00.000+03:00", "crawled": "2015-10-20T01:25:02.765+03:00", "highlightTitle": ""}