{"organizations": [], "uuid": "ac489cc6479b2b5aacfbf8045d622301e0261084", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.aceshowbiz.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Aceshowbizcom-EntertainmentNews\r", "section_title": "Aceshowbiz.com - Entertainment News", "url": "http://www.aceshowbiz.com/news/view/00089298.html", "country": "US", "title": "Cameron Diaz Takes a Tumble During Night Out With Benji Madden", "performance_score": 0, "site": "aceshowbiz.com", "participants_count": 1, "title_full": "Cameron Diaz Takes a Tumble During Night Out With Benji Madden", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T04:40:00.000+03:00", "replies_count": 0, "uuid": "ac489cc6479b2b5aacfbf8045d622301e0261084"}, "author": "AceShowbiz.com", "url": "http://www.aceshowbiz.com/news/view/00089298.html", "ord_in_thread": 0, "title": "Cameron Diaz Takes a Tumble During Night Out With Benji Madden", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments The 'Sex Tape' actress took a major tumble after stepping off the curb to get into her Uber during a rainy night on Saturday, October 3. \nCameron Diaz took a tumble during a night out with her husband Benji Madden in Los Angeles on Saturday, October 3. In some photos obtained by Mail Online , the \" Annie \" actress was seen slipping over as she climbed into her Uber. Benji quickly helped his wife back to her feet. Cameron and Benji were enjoying a date night at The Nice Guy. The star of \" The Other Woman (2014) \" wore a loose-fitting, knee-length dress which featured a purple, polka dot pattern. She sported bright pink lipstick and her hair was styled in natural waves. She completed her look with a black blazer and nude strappy heels. Benji, meanwhile, showed off his new head tattoo. The member of The Madden Brothers rocked a sleek black shirt paired with a black blazer and leather trousers. He completed his look with black sneakers with white soles. Cameron looked a bit distressed as she sat in the passenger seat of the black car, possible embarrassed over the fall. The \"Charlie's Angels\" actress was seen cuddling up in the back seat, appearing to have had a bit much of drink. While Cameron was previously rumored to be pregnant , a new report claims the 43-year-old actress isn't actually with child just yet. According to Star Magazine , she has turned to fertility treatments in an effort to conceive her first child. The magazine pointed out to Cameron's new photos which showed her rather \"swollen,\" saying it could signify a change in hormones. \"The invasive procedure, which has flooded Cam with hormones, has already taken a toll on her famously svelte physique,\" said the outlet. Dr. Andrea Fernandez, who hasn't treated Cameron, told the tabloid, \"IVF can cause the appearance of bloat. Women in their late 30s and early 40s are more sensitive to the process and can have greater swelling.\" Dr. Andrea was referring to the effects that IVF can have and why Diaz's swollen face \"could\" be a symptom. \n© AceShowbiz.com", "external_links": [], "published": "2015-10-05T04:40:00.000+03:00", "crawled": "2015-10-05T10:00:38.800+03:00", "highlightTitle": ""}