{"organizations": [], "uuid": "115a06ae283efb31d9ca1362bea836ac5774e26f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.contracostatimes.com", "main_image": "http://extras.mnginteractive.com/live/media/site568/2015/0929/20150929_105508_CCT-REMOTE-1004-01.JPG", "site_section": "http://feeds.contracostatimes.com/mngi/rss/CustomRssServlet/571/201115.xml", "section_title": "Entertainment Columns", "url": "http://www.contracostatimes.com/news/ci_28912964/homeland-arrow-flash-kick-off-new-seasons?source=rss", "country": "IL", "title": "'Homeland,' 'Arrow,' 'The Flash' kick off new seasons", "performance_score": 0, "site": "contracostatimes.com", "participants_count": 1, "title_full": "'Homeland,' 'Arrow,' 'The Flash' kick off new seasons", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T23:54:00.000+03:00", "replies_count": 0, "uuid": "115a06ae283efb31d9ca1362bea836ac5774e26f"}, "author": "Chuck Barney\n\ncbarney@bayareanewsgroup.com", "url": "http://www.contracostatimes.com/news/ci_28912964/homeland-arrow-flash-kick-off-new-seasons?source=rss", "ord_in_thread": 0, "title": "'Homeland,' 'Arrow,' 'The Flash' kick off new seasons", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "'Homeland,' 'Arrow,' 'The Flash' kick off new seasons By Chuck Barney Posted: 10/02/2015 12:02:00 PM PDT Updated: 10/02/2015 01:54:42 PM PDT DON'T MISS: \"Homeland\" -- Season 5 of the acclaimed drama begins two years after the horrific embassy attack in Islamabad. No longer with the CIA, Carrie Mathison (Claire Danes) is building a new life with her daughter in Berlin. She's even in a stable relationship with a nice German lawyer (Alex Fehling). Oh, but you just know all hell will break loose soon. 9 p.m. Sunday, Showtime. Other bets SUNDAY: Raise your right hand. As \"Madam Secretary\" launches its second season, Elizabeth (Téa Leoni) is suddenly thrust into a situation of power when the president's plane disappears over the Pacific Ocean. 8 p.m., CBS. Claire Danes as Carrie Mathison and Luna and Lotta Pfitzer as Franny in 'Homeland.' (Stephan Rabold/Showtime) SUNDAY: \"The Good Wife\" returns with fresh episodes and Alicia's (Julianna Margulies) life has taken on some new bumps. Hoping to salvage her law career, she enters the fast-paced, highly unglamorous world of bond court. 9 p.m., CBS. \nSUNDAY: There's a new setting for Season 2 of \"The Leftovers.\" Kevin Garvey (Justin Theroux) and his family are relocating to a small Texas town dubbed Miracle because it lost no one during the Departure. Still, drama happens. 9 p.m., HBO. \nMONDAY: The pressure on team \"Scorpion\" just refuses to ease. Tonight, Sylvester (Ari Stidham) goes undercover in a federal prison, hoping to save the lives of three federal judges and, of course, he eventually needs help to break out. 9 p.m., CBS. Advertisement \nTUESDAY: \"The Flash\" is back in action, and as Season 2 begins, Barry Allen (Grant Justin) wants to protect Central City on his own. When the Atom Smasher attacks, Iris (Candice Patton) pleads with him to let his friends help. 8 p.m., The CW. \nTUESDAY: Brace yourself for a Shaq attack on \"Fresh Off the Boat.\" Former NBA superstar Shaquille O'Neal makes a guest appearance on the sitcom that had previously given him several shout-outs. 8:30 p.m., ABC. \nWEDNESDAY: As Season 4 of \"Arrow\" begins, Oliver Queen (Stephen Amell) is away on a romantic escape. Luckily, John Diggle (David Ramsey) is around to battle assassins led by Damien Darhk (Neal McDonough). 8 p.m., The CW. \nWEDNESDAY: Seems you can check into the Los Angeles hot spot at the center of \"American Horror Story: Hotel,\" but you can never leave. Maybe that's because it's owned by a demented countess played by Lady Gaga. 10 p.m., FX. \nTHURSDAY: Season 7 of \"The Vampire Diaries\" opens with Elena out of the picture for good. That forces a bummed-out Damon (Ian Somerhalder) to try and move on. 8 p.m., The CW. \nFRIDAY: The sitcom \"Undateable\" returns with a daring little twist: This season, every episode will be broadcast live to the East Coast. But will that make the show any funnier? 8 p.m., NBC. \nSATURDAY: \"The Unauthorized Melrose Place Story\" is the latest gossipy film to dig into the behind-the-scenes dirt of an iconic TV show. Warning: You may need to take a shower after viewing. 8 p.m., Lifetime. Contact Chuck Barney at cbarney@bayareanewsgroup.com . Follow him at Twitter.com/chuckbarney and Facebook.com/bayareanewsgroup.chuckbarney .", "external_links": [], "published": "2015-10-02T23:54:00.000+03:00", "crawled": "2015-10-03T00:26:32.474+03:00", "highlightTitle": ""}