{"organizations": [], "uuid": "17f763ae7115ec9478dddbfa1dd10b630a2815e5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mid-day.com", "main_image": "http://images.mid-day.com/images/2015/sep/30ranvir-l.jpg", "site_section": "http://www.mid-day.com/Resources/midday/rss/entertainment.xml#", "section_title": "entertainment", "url": "http://www.mid-day.com/articles/ranvir-shorey-i-am-uncomfortable-doing-commercial-films/16628170", "country": "IN", "title": "Ranvir Shorey: I am uncomfortable doing commercial films", "performance_score": 0, "site": "mid-day.com", "participants_count": 1, "title_full": "Ranvir Shorey: I am uncomfortable doing commercial films - Entertainment", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "17f763ae7115ec9478dddbfa1dd10b630a2815e5"}, "author": "IANS", "url": "http://www.mid-day.com/articles/ranvir-shorey-i-am-uncomfortable-doing-commercial-films/16628170", "ord_in_thread": 0, "title": "Ranvir Shorey: I am uncomfortable doing commercial films", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "With a fair share of commercial and small content driven films in his filmography, actor Ranvir Shorey says he is not comfortable doing big-budget movies.\n\nRanvir Shorey \n\"The mainstream films are about making money, work is not that important and spinning money is. I find myself awkward doing such films. I am not comfortable there,\" Ranvir told PTI.\nThe 43-year-old actor, who has worked in both Bollywood 'masala' films like \"Singh is King\" and critically acclaimed movies, says even while choosing a commercial film, he looks for a good script.\n\"'Ek Tha Tiger' was a great script, director and leading superstar of the film industry Salman Khan is part of it. I don't these projects for visibility, I look for script,\" he said.\nThe \"Khosla Ka Ghosla\" actor said his interest mainly lies in doing small, independent films.\n\"I feel lucky that films like 'Singh is King', 'Ek Tha Tiger' came my way. They were mainstream films that were different. But my main staple is small, independent and smaller films. I feel such films have meaty parts that are challenging like 'Mithiya', 'Fatso'. They are important to my heart and career,\" he said.\nWhen it comes to work, Ranvir makes it clear that he never discriminates his work on basis of a big or small film.\n\"Big films or small films, I don't look at it that way. I do not discriminate that way. For me the role, script and director matter,\" he added.\nHe said though big mainstream films brings more visibility to actors, it is in small films where one learns more about the craft of acting.\n\"They (big films) do bring visibility also they have more reach and offer more money as well. But with independent films you tend to learn more, push the envelope of your craft.\nOne ends up making more friends here (independent films) than those films,\" he added.\nThe \"Mithiya\" actor said he has always tried to do \"different\" roles and has shunned repetitions.\nRanvir is looking forward to his next project \"Titli\", directed by Kanu Behl which is a coming-of-age story that explores the patriarchy and the circle of violence running within a family.", "external_links": [], "published": "2015-10-23T03:00:00.000+03:00", "crawled": "2015-10-23T14:56:28.599+03:00", "highlightTitle": ""}