{"organizations": [], "uuid": "9bfc202a1d6961a02beda4cabc9df10d22d0607a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.timesonline.com", "main_image": "http://bloximages.newyork1.vip.townnews.com/timesonline.com/content/tncms/assets/v3/editorial/9/dd/9dd781bc-78e7-11e5-b04b-bb20369510a2/5629265e4de7a.image.jpg?resize=620%2C407", "site_section": "http://www.timesonline.com/search/?q=&t=article&l=25&d=&d1=&d2=&s=start_time&sd=desc&c[]=news*,sports*,community*,entertainment/local_entertainment,columnists*&f=rss", "section_title": "www.timesonline.com - RSS Results in news*,sports*,community*,entertainment/local_entertainment,columnists* of type article", "url": "http://www.timesonline.com/entertainment/local_entertainment/zombie-opera-makes-its-midland-debut/article_386fba48-780f-11e5-8298-4f0432fee1bd.html", "country": "US", "title": "Zombie opera makes its Midland debut", "performance_score": 0, "site": "timesonline.com", "participants_count": 1, "title_full": "Zombie opera makes its Midland debut", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T02:00:00.000+02:00", "replies_count": 0, "uuid": "9bfc202a1d6961a02beda4cabc9df10d22d0607a"}, "author": "Scott Tady stady@timesonline.com", "url": "http://www.timesonline.com/entertainment/local_entertainment/zombie-opera-makes-its-midland-debut/article_386fba48-780f-11e5-8298-4f0432fee1bd.html", "ord_in_thread": 0, "title": "Zombie opera makes its Midland debut", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Serving Beaver County, PA since 1874 \nSaturday, October 24, 2015 9:52 PM Close Lincoln Park Performing Arts Center \nSophomore Jillian Ferguson stars in \"Night of the Living Dead: The Opera,\" running Oct. 30 to Nov. 1 at the Black Box Theater at the Lincoln Park Performing Arts Center in Midland. Zombie opera makes its Midland debut 0 Lincoln Park Performing Arts Center \nTom Kolos stars in \"Night of the Living Dead: The Opera,\" running Oct. 30 to Nov. 1 at the Black Box Theater at the Lincoln Park Performing Arts Center in Midland. Lincoln Park Performing Arts Center \nSophomore Jillian Ferguson stars in \"Night of the Living Dead: The Opera,\" running Oct. 30 to Nov. 1 at the Black Box Theater at the Lincoln Park Performing Arts Center in Midland. \nMIDLAND -- The hills are alive with the undead singing. \nYes, the zombies in \"Night of the Living Dead: The Opera\" sing as a chorus. \n\"That means a depth of passion that opera brings to the game,\" said Gregory Lehane, director of \"Night of the Living Dead: The Opera,\" which makes its Beaver County debut next weekend in the Black Box Theater at the Lincoln Park Performing Arts Center in Midland. \nThe dead-serious show, with its award-winning score composed by Midland resident Todd Goodman, is adapted from the 1968 horror film classic, \"Night of the Living Dead.\" \n\"We approached this opera with reverence to the original and in no way looked to make fun of, or mock it in any way,\" Goodman said. \nGoodman and librettist Stephen Catanzarite, of Brighton Township, first tested \"Night of the Living Dead: The Opera\" at a New York opera workshop, before successfully staging it two years ago with the Microscopic Opera Co. in Pittsburgh. \nSeveral key cast members, including the actress playing the all-important female lead, Barbara, are back this year, said Lehane, a Carnegie Mellon University School of Music professor, who also directed those 2013 shows at the Kelly-Strayhorn Theater in East Liberty. Lincoln Park Performing Arts Charter School students are also part of this year's cast. \nStaging the show in Lincoln Park's 175-seat Black Box Theater \"means less space to express ourselves, but we gain extra intimacy, immediacy, and even creepiness, because the zombies are right there in front of you,\" Lehane said. \nThe Friday show is sold out, and tickets have sold well for Halloween night. \nCatanzarite, founding artistic director at Lincoln Park, conceived the idea for \"Night of the Living Dead: The Opera\" after a conversation about the film's stage potential with the late-Bill Hinzman, a South Beaver Township resident who played the best-known zombie in the 1968 movie shot in Evans City. \nCatanzarite partnered with Lincoln Park resident composer Goodman, whose \"Night of the Living Dead: The Opera\" score went on to win The American Prize in Composition -- Theater Division, a nonprofit competition in the performing arts for the professional, university, church, community and secondary school levels. \nThe creators of the show say zombie fans and opera lovers can both enjoy it. \n\"The audience can expect to see the original movie come to life through music, wonderful stage direction by Gregory Lehane, original video by Pittsburgh filmmaker Joe Seamans, and other contributions by fabulous local and national artists,\" Goodman said. \"One difference that the opera has from the film is that the Undead in the opera have a voice via hauntingly beautiful choruses, which are original to this work. We get to hear their story for the first time.\" \nMore than just gimmick, having the zombies sing brings an extra heft to the film's original sociopolitical commentary on racism, war, and inequities of a ruling class run by corporations and/or the government. \n\"All those things I protested against in the '60s and '70s,\" Lehane said. \"By giving the zombies a voice, we can hear exactly, or look at exactly what it means to be thought of as something less than human, and how frustrating it is to try to press forward in a world that's always trying to prevent that.\" \nThe new generation of zombie fans obsessed with AMC's \"The Walking Dead\" might skeptically view a zombie opera, though Goodman said, \"I think opera is the perfect fit for this story and other stories like it. \n\"With opera being mostly through-sung, meaning there is no speaking, the work has a more organic flow and therefore the tension, which is so important to this type of storytelling, can be felt for long periods of time,\" he said. \"It is a lot of music, which took years and years of working and re-working to be able to craft into something that comes to the listener as a seamless piece from start to end.\" \nVideo projections intensify the mood. \n\"You'll see video of characters morphing into zombies in tight closeups,\" Lehane said. \nMakeup and costumes are crucial, too, with the production relying on another Lincoln Park resident artist, Kim Brown, of Pittsburgh's Spotlight Costumes, which has a client list that includes the Pittsburgh Civic Light Opera, Kennywood Park, the Pittsburgh Pirates and the Gateway Clipper Fleet. \nThe zombies will look scary enough to keep you at the edge of your seat. \n\"Their presence will most definitely be felt,\" Goodman said. \"They are, after all, coming to get you.\" If You Go \nWhat: \"Night of the Living Dead: The Opera\" \nWhen: 7:30 p.m. Oct. 30-31; 2 p.m. Nov. 1 \nWhere: Black Box Theater at the Lincoln Park Performing Arts Center, Midland \nTickets: $15 and $20 (Friday is sold out) \nInformation: lppacenter.org or 724-576-4644", "external_links": [], "published": "2015-10-25T02:00:00.000+02:00", "crawled": "2015-10-25T03:58:52.639+02:00", "highlightTitle": ""}