{"organizations": [], "uuid": "3cf265bbf873879d5bcaa75ee546024967c5030d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.heraldscotland.com", "main_image": "http://www.heraldscotland.com/resources/images/sitelogo/", "site_section": "http://www.heraldscotland.com/arts_ents/", "section_title": "Arts and Entertainment | Herald Scotland", "url": "http://www.heraldscotland.com/arts_ents/13895186.Leonard_Elschenbroich__Alexei_Grynyuk__Perth_Concert_Hall/", "country": "GB", "title": "Leonard Elschenbroich, Alexei Grynyuk, Perth Concert Hall", "performance_score": 0, "site": "heraldscotland.com", "participants_count": 1, "title_full": "Leonard Elschenbroich, Alexei Grynyuk, Perth Concert Hall (From Herald Scotland)", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T07:06:00.000+02:00", "replies_count": 0, "uuid": "3cf265bbf873879d5bcaa75ee546024967c5030d"}, "author": "heraldscotland.com", "url": "http://www.heraldscotland.com/arts_ents/13895186.Leonard_Elschenbroich__Alexei_Grynyuk__Perth_Concert_Hall/", "ord_in_thread": 0, "title": "Leonard Elschenbroich, Alexei Grynyuk, Perth Concert Hall", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Leonard Elschenbroich, Alexei Grynyuk, Perth Concert Hall\nMichael Tumelty\nFive Stars\nHAND on heart, and tissues disposed of, the lunchtime recital in Perth on Saturday by cellist Leonard Elschenbroich and pianist Alexi Grynyuk, as their own slot in the Nicola Benedetti and Friends weekend residency, was one of the most powerful and overwhelming musical experiences of my life.\nShare article And that was on two levels, intellectually and emotionally. Just recently, I was riding one of my hobby-horses, urging folk not to look on “early” Beethoven and see only echoes and formative influences, but to hear the real, authentic and original Beethoven that is present: I was referring to the Opus 18 String Quartets. I would say exactly the same about the G minor Cello Sonata, given a revelatory performance on Saturday by Elschenbroich. Ok, Beethoven was only 26, and the cello sonata as a genre was also young. But my God it didn’t sound remotely young in the hands of these two masters, whose qualities of detailed, forensic playing have rocketed into maturity since I first heard them. Next week, when I have a break, I’ll be returning anew to those Cello Sonatas.\nThat’s the intellectual bit; but the emotional fire and passion, suffused with characteristic melancholy, that then swept through the hall, with Elschenbroich and Grynyuk’s volcanic and heart-rending performance of Rachmaninov’s Cello Sonata, touched many people (they told me) and absolutely wrecked this listener. The two players had their hands, minds and hearts so deep in the emotional streams and torrents of the Sonata that the pounding passions and yearning aches just poured through their music-making. This was great, stimulating and revelatory playing of the highest order and deepest involvement.", "external_links": ["https://twitter.com/share?url=", "https://www.facebook.com/sharer/sharer.php?u="], "published": "2015-10-26T07:06:00.000+02:00", "crawled": "2015-10-26T02:14:49.351+02:00", "highlightTitle": ""}