{"organizations": [], "uuid": "ab6c39e8f6045faba40d5ac69a5d2c7c6891aa85", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/151012124020-janelle-monae-natpkg-00005023-large-169.jpg", "site_section": "http://rss.cnn.com/rss/edition_entertainment.rss", "section_title": "CNN.com - Entertainment", "url": "http://edition.cnn.com/2015/10/22/entertainment/janelle-monae-identity-feat/index.html", "country": "US", "title": "Janelle Monae: 'I represent the other'", "performance_score": 0, "site": "cnn.com", "participants_count": 1, "title_full": "Janelle Monae: 'I represent the other' - CNN.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T19:41:00.000+03:00", "replies_count": 0, "uuid": "ab6c39e8f6045faba40d5ac69a5d2c7c6891aa85"}, "author": "Brittany Vickers, CNN", "url": "http://edition.cnn.com/2015/10/22/entertainment/janelle-monae-identity-feat/index.html", "ord_in_thread": 0, "title": "Janelle Monae: 'I represent the other'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Story highlights Pop star Janelle Monae is using her platform to advocate for the #BlackLivesMatter movement \"I represent ... those who feel like they don't even want to be normal,\" she says Atlanta (CNN) The crowd roars as the tiny performer glides across the stage in her signature black and white, her moves seemingly choreographed and spontaneous at the same time.\nIt's the Electric Lady herself, Janelle Monae , and her set at the recent One Musicfest in Atlanta is a showcase for her powerful voice, smooth raps and effortless footwork. It's easy to see why big names like Prince and are infatuated with her talent.\nAs thousands of fans jam along to \"Tightrope,\" the song that catapulted her to pop stardom in 2010, Monae looks at home on the stage. It's because, essentially, she grew up there.\nHailing from a family of singers, she began performing as a child in her Kansas City living room. After a stint in New York, she moved as a teenager to Atlanta, where she was discovered by Antwan \"Big Boi\" Patton, half of the hip-hop duo Outkast, and founded the Wondaland Arts Society, a collective of like-minded young musicians. Monae then caught the eye of Sean \"Puffy\" Combs, who signed her to his music label, Bad Boy Records, and her career took off.\nSinger Janelle Monae in her trademark black and white. But you get the feeling she would have made it soon enough on her own.\nRead More Most noticeable is her singular style, as the 29-year-old has crafted a unique persona. There's her alter ego, Cindi Mayweather, an android she describes as the \"Other\" -- representing anyone who has felt stifled by the mainstream.\nThere's also her bold, distinctive look: an upturned crown of hair, red lipstick, Cover Girl skin (she's a spokeswoman for the brand) and a preference for black-and-white tuxedos.\nMostly, though, there is Monae's determination to call her own shots. She founded a music label, Wondaland Records, and has built an eclectic stable of young, breakthrough artists -- Jidenna, Deep Cotton, St. Beauty -- who share her eccentric sensibilities.\nAnd as her fame has grown, she has begun speaking out on issues of social justice. Monae has attended rallies by members of the #BlackLivesMatter movement and in August released a protest song, \" Hell You Talmbout ,\" that recites the names of unarmed African-Americans killed in recent confrontations with police.\nCNN sat down with Monae after her One Musicfest concert. Here is a condensed version of our conversation.\nCNN: The black-and-white outfits you wear during performances seem like more than a costume. Can you explain what they represent?\nJanelle Monae: The colors black and white are my uniform, to honor the working class. People like my parents, who were janitors and had to wear a uniform every day. It keeps me grounded.\nCNN: You use your platform as an artist to inspire those who don't fit the traditional mode. How has your message evolved?\nMonae: I'm always thinking about that young girl or young boy who doesn't quite know if their music, their messaging, their imaging, their voice is going to pop, if people are going to understand them. So I represent the other and those who feel like they don't even want to be normal. They embrace the things that make them unique.\nI'm always thinking about those people first when I'm writing music. Whenever I can reach that young person and inspire them to go after their own dreams, start their own movement just like I did with Wondaland. Starting their own tribe and showing people that we are not all the same, we're not all monolithic. I think that's what it's all about for me.\nCNN: You're one of the few black women who owns their own record label. Tell us about the artists that Wondaland encompasses.\nMonae: I'm really thankful to have my own record label. I've always looked up to people like Madonna when she launched Maverick Records. Even Jay Z and Sean \"Puffy\" Combs, who's a mentor and also gave me a shot when I was an independent artist in Atlanta. He came to my show, and he said, \"I just want people to know about you.\"\nI want to do the same thing. I want people to know about these visionary artists. I want people to know what they stand for and (that) they are representing something unique, something fresh. I am just so excited about their careers.\nCNN: Are you worried about backlash because you're speaking out as an activist? During your recent performance on the \"Today\" show, you were cut off in the middle of speaking. What was your reaction to that?\nMonae: No, that wasn't anything facetious. I actually went over on my (alloted) time. I got so emotional, and I just wanted to give a message to the viewers who were watching. Some of those people may not know what's going on in our community, and it's up to me. I'm not a politician; I'm an artist. So I always feel the need to give the unfiltered truth, (or) what I think is the truth, at least.\nCNN: You're active in the #BlackLivesMatter movement and even recorded a protest song, \"Hell You Talmbout.\" Why is it important for you to lend your voice to that?\nMonae: First, before I'm an artist, before I'm a celebrity, I'm a human being. I was really touched by the stories that I've been hearing (about police shootings of unarmed African-Americans) and when I saw the families crying, we as Wondaland saw the frustration, and we wanted to do something about it. We believe that silence is our enemy, and sound is our weapon.\nSo for us recording a song, recording a vessel for those who are out there marching frustrated, recording that song for them allowing them to chant \"Hell You Talmbout!\" and honor those victims' names, that was the least that we could do. I hope when people are listening to the song, they hear those names and they ... feel them as human beings.\nIf you see something that's ... different from you, search about and look at the things that make them special. It's important that we see each other as human beings. We need to take care of each other.\nCNN: What was the process of creating that song?\nMonae: Before we (in Wondaland) even started making music together, we would have conversations about what's going on in our community. What are the things that we can contribute to? How can we come into the music industry and give a fresh perspective?\nAs we were doing that, we just started talking about different issues that plagued our community, that plagued the world. Police brutality and the abuse of power is what motivated the song. As we were recording and saying the names -- from Aiyana Jones to Sandra Bland to Freddie Gray -- we were crying; we were upset. It was very emotional.\nWe can't imagine how the (victims') families feel if we were feeling like that. When they go into their child's room and they're not there. You can't get them back.\nCNN: What impact do you think your voice has had on the #BlackLivesMatter movement?\nMonae: When we do come together around a cause it's genuine. I think if people genuinely want to help ... that'll shine through, no matter what color or what race. We cannot see race before compassion.", "external_links": ["http://i2.cdn.turner.com/cnnnext/dam/assets/111025032038-entjanellemonae-topics.jpg", "http://www.jmonae.com/", "http://www.onemusicfest.com/", "http://i2.cdn.turner.com/cnnnext/dam/assets/111025032038-entjanellemonae-story-body.jpg", "http://www.npr.org/sections/allsongs/2015/08/18/385202798/janelle-mon-e-releases-visceral-protest-song-hell-you-talmbout", "http://i2.cdn.turner.com/cnnnext/dam/assets/111025032038-entjanellemonae-hp-video.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/111025032038-entjanellemonae-horizontal-large-gallery.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/111025032038-entjanellemonae-story-top.jpg"], "published": "2015-10-22T19:41:00.000+03:00", "crawled": "2015-10-22T17:10:03.337+03:00", "highlightTitle": ""}