{"organizations": [], "uuid": "f55936c4cf21ba860aaa5a39a5e405fe49d8d404", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48524/entertainment", "section_title": "Entertainment - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30195635/underdiagnosed-celiac-and-gluten-intolerant-patients-still-left-with-the-question-where-do-i-start-new-book-provides-answers", "country": "US", "title": "Underdiagnosed Celiac and Gluten-Intolerant Patients Still Left with the Question \"Where do I Start?\" New Book Provides Answers", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Underdiagnosed Celiac and Gluten-Intolerant Patients Still Left with the Question \"Where do I Start?\" New Book Provides Answers - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "f55936c4cf21ba860aaa5a39a5e405fe49d8d404"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30195635/underdiagnosed-celiac-and-gluten-intolerant-patients-still-left-with-the-question-where-do-i-start-new-book-provides-answers", "ord_in_thread": 0, "title": "Underdiagnosed Celiac and Gluten-Intolerant Patients Still Left with the Question \"Where do I Start?\" New Book Provides Answers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Arcara JHC LLC\n\"3 Steps To Gluten-Free Living: A Practical Step-By-Step Guide to the Elimination, Transition, & Substitution of Gluten©\" now available on Amazon.com\nPHILADELPHIA , Oct. 6, Publisher JHC LLC announced today the availability of a new book by author Melinda Arcara that answers the difficult question \" where do I start?\" after diagnosis of a gluten-intolerance or of celiac disease by a healthcare provider.\nAccording to the National Institutes of Health (NIH), Celiac disease affects about 1 in 141 people in the United States or roughly 2.3 million people 1 (1 to >2% world-wide 2 ). Non-celiac gluten sensitivity affects an even larger proportion with an estimated 5 to 20 percent of the population 3 . Unfortunately, less than 10 percent are not diagnosed.\nAccording to Johns Hopkins Medicine, gluten-intolerance and celiac symptoms can include joint pain & inflammation, digestive problems, stomach pain, bloating, indigestion and acid reflux, constipation or diarrhea, fatigue, anxiety, mood swings, or depression, vitamin deficiencies, skin rashes, infertility, migraines, canker sores, and tingling in the hands and feet. 4\n\"For patients diagnosed with a gluten intolerance or celiac, this book is written to be a practical, step-by-step guide to the elimination of gluten from their diet, the transition of their heart and their home (including their pantry), and the substitution of products and ingredients for their recipes and meals,\" states author Melinda Arcara . \"With over 100 products and brands referenced in the book, 3 Steps to Gluten Free living will not only potentially save people time, but a significant amount of money as it will help people navigate the vast (and expensive) gluten-free universe of products.\"\nContinued Mrs. Arcara, \"This book also covers eating whole, clean, local, and healthy, which is important when starting your gluten free journey and for being truly compliant to a gluten-free diet.\"\nABOUT THE AUTHOR\nAuthor Melinda Arcara , a.k.a. Gluten-Free Bebe (pronounced \"bee-bee\"), is a graduate of the Institute for Integrative Nutrition and a certified health coach with a focus on incorporating healthy gluten-free living into daily routines.\nAs the baby of ten children, Melinda, or \"the Bebe\" as her Dad nicknamed her, went through the first forty years of her life suffering from unexplained symptoms including migraines, anemia, anxiety, weight fluctuations, and joint pain. She was finally diagnosed with a gluten intolerance in 2009. For Melinda, this diagnosis was as a blessing, not a curse, as she learned how to incorporate a gluten-free diet into her daily life which finally put her on the path to better health.\nContact Information:\nTo learn more about the book, sign-up for the blog, or purchase the book, please click on the link below.\nwww.glutenfreebebe.com\namazon.com/Steps-Gluten-Free-Living\nIf you would like to contact Mrs. Arcara to learn more about her book and her experiences, you may email or call her at:\nEmail or call (855) 901-2870\nCopyright © 2015 Melinda Arcara. Publisher: Arcara JHC LLC. Glutenfreebebe™\n1. http://www.celiac.nih.gov/\n2. Remes-Troche JM. Ramirez-Iglesias MT. Rubio-Tapia A. Alonso-Ramos A. Velazquez A. Uscanga LF. Journal of Clinical Gastroenterology. 40(8):697-700, 2006\n3. Non-Celiac Gluten Sensitivity: The New Frontier of Gluten Related Disorders. Nutrients. 2013 Oct; 5(10): 3839–3853.\n4. http://www.hopkinsmedicine.org/healthlibrary/conditions/digestive_disorders/what_is_a_gluten-free_diet_134,183/ Celiac disease is an immune reaction to the gluten protein found in wheat, rye, and barley\nPhoto - http://photos.prnewswire.com/prnh/20151005/274201\nPhoto - http://photos.prnewswire.com/prnh/20151005/274202\n releases/underdiagnosed-celiac-and-gluten-intolerant-patients-still-left-with-the-question-where-do-i-start-new-book-provides-answers-300154766.html\n ", "external_links": ["https://photos.prnewswire.com/prnvar/20151005/274201", "https://photos.prnewswire.com/prnvar/20151005/274202", "http://www.prnewswire.com/news-releases/underdiagnosed-celiac-and-gluten-intolerant-patients-still-left-with-the-question-where-do-i-start-new-book-provides-answers-300154766.html", "http://www.amazon.com/exec/obidos/ASIN/1512188751", "http://www.celiac.nih.gov/", "http://photos.prnewswire.com/prnh/20151005/274202", "http://photos.prnewswire.com/prnh/20151005/274201", "http://www.xmlnews.org/ns/", "http://pressreleaseheadlines.com/contact?pid=291742", "http://www.glutenfreebebe.com/", "http://www.hopkinsmedicine.org/healthlibrary/conditions/digestive_disorders/what_is_a_gluten-free_diet_134,183/", "http://rt.prnewswire.com/rt.gif?NewsItemId=PH20630&Transmission_Id=201510060830PR_NEWS_USPR_____PH20630&DateId=20151006"], "published": "2015-10-06T03:00:00.000+03:00", "crawled": "2015-10-06T17:48:39.782+03:00", "highlightTitle": ""}