{"organizations": [], "uuid": "4aeb3fa04813070a32d1305674584bb267f4ec41", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/49191744.cms", "site_section": "http://timesofindia.indiatimes.com/Entertainment/Tamil/Music/articlelist/27288885.cms", "section_title": "Music - Tamil - Entertainment - The Times of India", "url": "http://timesofindia.indiatimes.com/entertainment/tamil/music/Success-as-a-singer-never-made-me-complete-Karthik/articleshow/49191704.cms", "country": "IL", "title": "Success as a singer never made me complete: Karthik", "performance_score": 0, "site": "indiatimes.com", "participants_count": 1, "title_full": "Success as a singer never made me complete: Karthik - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T18:44:00.000+03:00", "replies_count": 0, "uuid": "4aeb3fa04813070a32d1305674584bb267f4ec41"}, "author": "Sharanya CR", "url": "http://timesofindia.indiatimes.com/entertainment/tamil/music/Success-as-a-singer-never-made-me-complete-Karthik/articleshow/49191704.cms", "ord_in_thread": 0, "title": "Success as a singer never made me complete: Karthik", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "At a time when new singers are getting introduced almost every single day , Karthik has managed to sustain his position as one of the most sought-after playback singers. Ahead of the release of Tamilselvanum Thaniyar Anjalum, his second film as a composer, the singer-turned composer talks about sustainability , composing and much more. Excerpts:\nTell us about Tamilselvanum Thaniyar Anjalum?\nGautham Menon (the film's producer) approached me for this project. Since I've a lot of respect for him, I took this up. The film is a fun, commercial entertainer. After Aravaan, which was mainly folk and experimenting with things that were alien to me, I wanted to take up something light. The album has a love song, a slightly groovy , up-tempo number followed by a club song.\nWhen did the singer to composer transition happen?\nI was working in Rajiv Menon's studio when he heard the jingles that I had composed. He liked them and asked me to give composing a go. Later, director Vasanthabalan approached me for Aravaan. It was a challenging project to work on, but was rewarding in terms of experience gained. I then took up Tamilselvanum Thaniyar Anjalum. Since the film was getting delayed, I began focus ing on other things. But it is nice to come back with this release, though. The transition to com poser is something that I didn't plan. Whenever something interesting comes up, I will take it up.\nHow do you manage to sustain yourself when there is so much completion in the playback field?\nGod has really been kind to me. I really don't know what has worked, but I'm an easy person to handle. There are some preconceived notions about the industry -that it is ruthless, and full of backstab bers. But trust me, this is not the case and that is what I love about my industry . If you are honest and sincere, people respect you. This has played a big role in keeping me grounded and focused on my passion. Also, there are two ways of looking at success. You can either take it as God has given me this or I have done all this to be successful. I took the former route and I'm having a ball here.\nWhere do you derive the passion and energy from?\nYou have to reinvent yourself and have an open mind as there is so much to explore. The last few years, I have been travelling a lot with my fusion projects. When you start working with so many people, you realize that playback singing is one tiny part in the whole spectrum. The more you collaborate and travel, the more you imbibe. The best part is that it indirectly influences your work.This is what keeps me alive in my work. I need to refresh myself every now and then. I recently attended the Stanford Jazz Festival, where I met incredible pianists. I picked so much from them. It is important to keep your antenna open.\nDo you offer suggestion to composers when you are singing? Have you rejected songs?\nPeople know how I operate by now. I don't offer suggestion hoping they would take it. Some composers are very clear about what they want.Sometimes, if I feel strongly about something, then I do tell them. But it is their call whether to take it or not. And yes, there are a few songs that I chose not to sing, and it was mostly for the lyrics.I am not too comfortable if it is vulgar. But vulgarity is subjective. When I reject, people are mature about it.\nHas there been a low point in your career?\nYes, about five to six years ago... when I received five Filmfare awards on a trot. That's when I realized I was not using my energy for what I was supposed to do. I never bother about how many songs I've sung or how many have become hits. In fact, my enjoyment stops once I record for it. Even though everything had been going great, I felt incomplete. Feeling this way was my biggest low. This was the phase when I was reinventing myself.But today I'm happy to do multiple things.\nHow did Arka evolve?\nIt is an honour to be a part of Arka. We created this together and have the best of musicians. Selvaganesh, who is part of the band, encouraged me to do so many things for which I am thankful for. I had this drive to go beyond film music. Somewhere, success as a playback singer never made me complete as a musician. I strongly felt I had a lot more to do. The moment I started playing with them, I realized it is a beautiful world. We performed two months ago in Chicago, New York...for people who didn't know us. There is no hit or flop tag attached to it. If I play for 10 people, I directly connect with them. We are planning to start our next album by December. I strongly feel that the best times are ahead for independent music. ", "external_links": ["https://play.google.com/store/apps/details?id=com.toi.reader.activities"], "published": "2015-10-02T18:44:00.000+03:00", "crawled": "2015-10-03T21:23:25.256+03:00", "highlightTitle": ""}