{"organizations": [], "uuid": "9138571cce0c55634e4870735559298d83f72cda", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news24.com", "main_image": "http://graph.facebook.com/10227041841/picture", "site_section": "http://www.news24.com/", "section_title": "News24, South Africa's premier news source, provides breaking news on national, world, Africa, sport, entertainment, technology &amp; more. ", "url": "http://www.news24.com/MyNews24/Can-Hlaudi-Motsoeneng-continue-to-ignore-the-findings-of-the-Public-Protector-20151009", "country": "ZA", "title": "Can Hlaudi Motsoeneng continue to ignore the findings of the Public Protector", "performance_score": 0, "site": "news24.com", "participants_count": 1, "title_full": "Can Hlaudi Motsoeneng continue to ignore the findings of the Public Protector | News24", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T18:43:00.000+03:00", "replies_count": 0, "uuid": "9138571cce0c55634e4870735559298d83f72cda"}, "author": "news24.com", "url": "http://www.news24.com/MyNews24/Can-Hlaudi-Motsoeneng-continue-to-ignore-the-findings-of-the-Public-Protector-20151009", "ord_in_thread": 0, "title": "Can Hlaudi Motsoeneng continue to ignore the findings of the Public Protector", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "All the efforts of undermining the public protector Ms Thuli Madonsela by the SABC Chief Operating Officer Mr Hlaudi Motsoeneng has proven that he is not alone in such a bid. The parliament, Communications Minister Ms Muthambi, to appoint the person who’s name is in headlines day in day out are direct efforts to discredit the office of the Public Protector and to continue a silent war against institutions meant to protect democracy and the constitution.\nIt’s either the beginning or the advanced stage of betrayal to the citizens of this country that are real thirsty for accountable democratic system which can help to unite the South Africans across all race and to forget about the brutality of apartheid.\nThe question to be answered here is that Public Protector’s approach is it politically influenced or is it hatred or a pure execution of a constitutional mandate. The Office of the public protector has always acted in the best interest of the citizenship furthermore has after every findings provided remedial actions as a measure of correction.\nIt is unbelievable that there are individuals (friends of Hlaudi Motsoeneng) who want to see perpetuation of corruptible actions being condoned in favour of an individual not in favour of the people in general.\nThe issue if it is not political, it must be a pure sabotage of democracy or institutions meant to protect the SA constitution.\nIt was reported that the Public Protector, Thuli Madonsela released a report titled \"When governance and ethics fail\" at a media briefing in Pretoria.\nThe report recommended that the SABC board institute corrective action against the \"dishonest\" Motsoeneng. May I be allowed to once more Quote: \"The SABC board should ensure that all monies are recovered which were irregularly spent through unlawful and improper actions,\" Madonsela said. His irregular salary increases were but one of the matters which had to be corrected a wasted tax payer’s money.\nThe report reveals the good intentions of the findings that it was to uplift the integrity and the image of the public broadcaster nothing else by applying establishing a disciplinary processes with the aim to come up with the corrective measure. Again I found no personal attacks directed to Hlaudi Motsoeneng but good intention to promote honesty and the rule of law.\nThe person in question has legally failed in his bid to avoid disciplinary processes instituted against him. If it was Public Protector’s office which has got a vendetta against SABC’S COO why Supreme Court of appeal had dismissed an appeal by Hlaudi Motsoeneng surely it is in the best interests of the people of South Africa that he adheres to the findings of the Public Proctor. When one refers to the March 22 2015 The Sunday Times reported that Communications Minister Faith Muthambi said that President Jacob Zuma loves SABC COO Hlaudi Motsoeneng so much, that they have to support him.", "external_links": [], "published": "2015-10-09T18:43:00.000+03:00", "crawled": "2015-10-09T14:05:16.396+03:00", "highlightTitle": ""}