{"organizations": [], "uuid": "bffc7ecb18c85c7c01f32be28ea08be6dd758c3e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ctvnews.ca", "main_image": "http://www.ctvnews.ca/polopoly_fs/1.2603573.1444420630!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "site_section": "http://www.ctvnews.ca/rss/ctvnews-ca-entertainment-public-rss-1.822292", "section_title": "CTVNews.ca - Entertainment - Public RSS", "url": "http://www.ctvnews.ca/entertainment/off-broadway-theatre-in-nyc-named-after-actor-john-cullum-1.2603568", "country": "CA", "title": "Off-Broadway theatre in NYC named after actor John Cullum | Entertainment & Showbiz from CTV News", "performance_score": 0, "site": "ctvnews.ca", "participants_count": 1, "title_full": "Off-Broadway theatre in NYC named after actor John Cullum | Entertainment & Showbiz from CTV News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "bffc7ecb18c85c7c01f32be28ea08be6dd758c3e"}, "author": "Mark Kennedy,  The Associated Press", "url": "http://www.ctvnews.ca/entertainment/off-broadway-theatre-in-nyc-named-after-actor-john-cullum-1.2603568", "ord_in_thread": 0, "title": "Off-Broadway theatre in NYC named after actor John Cullum | Entertainment & Showbiz from CTV News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK -- Two-time Tony Award-winner John Cullum has gotten the ultimate stage honour -- a theatre named after him.\nThe American Theatre of Actors and The Araca Group said Friday that the off-Broadway repertory theatre company's largest venue, on 54th Street in Manhattan, will be renamed in Cullum's honour on Oct. 16.\nCullum, 85 and ever bashful, said Friday he felt overwhelmed and added it was a little spooky. \"People who get theatres named after them are usually dead,\" he said, laughing.\nThe renaming of the 140-seat Chernuchin Theater will take place, fittingly, following a performance of \"Urinetown\" by the Fracture Theatre Co. The Chernuchin was the theatre where \"Urinetown,\" starring Cullum, began before later going to Broadway.\n\"I can't think of a more appropriate theatre for me. I feel right at home in that theatre,\" said Cullum, best known on TV as the bartender Holling in \"Northern Exposure.\"\nThe actor said he'll find it hard to resist visiting his new theatre. \"They'll probably call on me to do a few things, and if I can do them I'll try to help out there -- and try to live up to my reputation,\" Cullum said. \"It's a totally new experience for me.\"\nCullum recalled joining the \"Urinetown\" company at American Theatre of Actors in 2001, with all the actors and actresses sharing the same dressing room, separated by a sheet. \"It was a very close-knit company. In fact, it was too close,\" he said. \"We all got to know each other very well.\"\nHe said initially he was treated coolly by the \"Urinetown\" company. He was getting strange stares and no one would talk to him. The director, John Rando, then told him they felt surprised the Tony-winner was doing this off-beat satirical, off-Broadway musical. \"I said, 'Listen, this is going to be a hit,\"' he said. \"They didn't think a star would do it.\"\nCullum received Tony Awards for \"On The Twentieth Century\" and \"Shenandoah.\" His other credits include \"Casa Valentina,\" \"110 in the Shade,\" \"Show Boat\" and \"The Scottsboro Boys.\"\nThe American Theatre of Actors consists of 50 actors, 20 playwrights and 10 directors. Among the stars who have worked there are Dennis Quaid, Bruce Willis, Danny Aiello, Dan Lauria, Chazz Palminteri, Kevin Spacey and Edie Falco.\nAfter the theatre company officials informed Cullum that they wanted to name of their three theatres after him, the actor told them he would accept only if they took time to reconsider the honour.\n\"I said, 'I just want to give you the chance to back out on this,\"' he said. \"There are so many extraordinary people who have their names attached to theatres and to have my name attached to it astonished me.\"", "external_links": [], "published": "2015-10-09T03:00:00.000+03:00", "crawled": "2015-10-10T04:00:20.315+03:00", "highlightTitle": ""}