{"organizations": [], "uuid": "d72310533a70d8f983f82e3875f9699a186b6056", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.heraldscotland.com", "main_image": "http://www.heraldscotland.com/resources/images/4309875/", "site_section": "http://www.heraldscotland.com/arts_ents/", "section_title": "Arts and Entertainment | Herald Scotland", "url": "http://www.heraldscotland.com/arts_ents/13838677.Georges_Perec_s_first__long_lost_novel/", "country": "GB", "title": "Georges Perec's first, long-lost novel", "performance_score": 0, "site": "heraldscotland.com", "participants_count": 1, "title_full": "Georges Perec's first, long-lost novel (From Herald Scotland)", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T07:09:00.000+03:00", "replies_count": 0, "uuid": "d72310533a70d8f983f82e3875f9699a186b6056"}, "author": "Rosemary Goring", "url": "http://www.heraldscotland.com/arts_ents/13838677.Georges_Perec_s_first__long_lost_novel/", "ord_in_thread": 0, "title": "Georges Perec's first, long-lost novel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Long thought to have been lost forever, this is the first, unpublished novel by French literary experimentalist Georges Perec, unearthed by his translator and biographer, David Bellos. Perec, who died in 1982 aged 45, was both an adventurous writer – he famously wrote an entire novel without using the letter “e” – and an accomplished one, winning the top literary awards and eventually having a postage stamp issued in his honour.\nWritten in the late 1950s, when he was working in a medical research library, Portrait Of A Man is the confession of forger Gaspard Winckler, who, as the novel opens, has just murdered his boss. After twelve years of turning his artistic talents to fraudulent ends, Winckler has snapped. His latest project, a forgery of a Condetierre by Antonello da Messina, has brought all the contradictions of his job to a head. Winckler wants to make a perfect, undetectable forgery. But he also wants it to be a true work of art in its own right. The two aims are irreconcilable, and this, in a hard-to-explain way, propels him towards murder.\nFor the first half of the book, Winckler is barricaded in his basement studio, having been spotted with the boss’s body, and decides to tunnel his way out. The second part finds him in Yugoslavia, trying to get a sympathetic friend to understand what drove him to kill. But the forger’s explanations are vague and unsatisfying, as he continually fails to find rational terms to frame an instinctive and impulsive act.\nShare article\nIt’s a slim book, with a somewhat narrow focus, that falls a little way short of the greatness it’s aiming for and fails to obliterate completely the influence of predecessors like Camus and Dostoevsky. The fact that the murder is portrayed as something very like a blow for existentialist freedom indicates that the determinedly original Perec was still shackled to a tradition of sorts at this stage. In the end, the real portrait is of the novelist himself as he embarks on a writing career determined to be innovative and provocative, but realising that he’s as much imprisoned by his chosen medium as he is liberated by it. If this early work has greatness, then it’s in Perec’s comprehension of the challenge ahead of him. Now finally admitted into his oeuvre, Portrait Of A Man sets up a dilemma which the rest of Perec’s work shows him wrestling with and, on good days, overcoming with style.\nPromoted stories", "external_links": ["https://twitter.com/share?url=", "https://www.facebook.com/sharer/sharer.php?u="], "published": "2015-10-10T07:09:00.000+03:00", "crawled": "2015-10-10T05:24:48.881+03:00", "highlightTitle": ""}