{"organizations": [], "uuid": "9fa35f697ac93f8adc5db6b28c3e406421719ae0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://www.canberratimes.com.au/content/dam/images/g/k/0/6/w/m/image.related.articleLeadwide.620x349.gjzyyw.png/1443870180901.jpg", "site_section": "http://www.canberratimes.com.au/act-news/canberra-life", "section_title": "Canberra Life | Lifestyle, Food, Entertainment, Arts, Theatre &amp; Music", "url": "http://www.canberratimes.com.au/act-news/canberra-life/graffiti-artists-work-with-government-to-bring-street-art-culture-to-canberra-20151002-gjzyyw.html", "country": "AU", "title": "Graffiti artists work with government to bring street art culture to Canberra", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "Graffiti artists work with government to bring street art culture to Canberra", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T19:03:00.000+03:00", "replies_count": 0, "uuid": "9fa35f697ac93f8adc5db6b28c3e406421719ae0"}, "author": "", "url": "http://www.canberratimes.com.au/act-news/canberra-life/graffiti-artists-work-with-government-to-bring-street-art-culture-to-canberra-20151002-gjzyyw.html", "ord_in_thread": 0, "title": "Graffiti artists work with government to bring street art culture to Canberra", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Street artist David Chavez has been given permission by ACT government to paint a mural on a public wall in Dickson. Photo: Elesa Kurtz\nACT residents will see an increase in the number of public murals and street art throughout the city as the government prepares to put in place a graffiti management co-ordinator.\nThis year to date, Territory and Municipal Services approved four murals – the Dickson shops laneway, the bowl at Belconnen skate park, the Melrose Drive stormwater drain and Eddison skate park – for artists who approached the government looking to showcase their work.\nA spokesman for TAMS said the number of murals likely to be created will depend on interest by the street art community.\nGraffiti artist David Chavez said he felt blessed to have a request approved for a mural in the city. Territory and Municipal Services allowed him to paint the wall of the laneway to the Dickson shops, on Dickson Place.\nAdvertisement Mr Chavez, who grew up in Central America, said while he would have liked to depict something from his own culture, he felt it was more relevant to the location to depict Asian culture.\n\"I thought doing something Asian was appropriate, Dickson being a Chinatown of Canberra,\" Mr Chavez said.\n\"It is very disappointing it doesn't have any lanterns, any dragons, any golden gates; you go to Sydney or Melbourne and they have all of that.\n\"For Canberra being the capital city, it is very disappointing so I'm trying to do my part where I can and educate the community about the culture.\"\nMr Chavez said his artwork would allow people to travel to a place without having to buy a plane ticket.\nHe said murals could help get rid of illegal graffiti and \"eliminate that bad neighbourhood feel\".\n\"At the moment it has been very hard [in Canberra] because I think graffiti has a bad name as it is. It's got a bad reputation, so as soon as you say street art, as soon as you say graffiti, people get scared. It makes it difficult for people like myself to bring something beautiful to the city.\"\nMr Chavez said the worst thing the government could do was say no to graffiti.\n\"I think the best thing you can do in a situation like that is if you have a wall which is vandalised, give it to an artist willing to take responsibility for it,\" he said.\nA spokesman for TAMS said the wall approved for a mural by Mr Chavez was one that was regularly \"tagged\" with graffiti which detracted from the overall amenity of the area.\nThe spokesman said the graffiti management co-ordinator would not only continue to identify communal street art sites, they would be responsible for the removal of graffiti from public assets. The recruitment process for such a person was under way.", "external_links": [], "published": "2015-10-03T19:03:00.000+03:00", "crawled": "2015-10-12T22:08:25.938+03:00", "highlightTitle": ""}