{"organizations": [], "uuid": "df889d5a709e26fdcd36cc86949dbc82e2379caa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mynews4.com", "main_image": "http://www.mynews4.com/media/lib/53/5/7/1/57101f88-720e-4b51-9c96-ff134c125bf0/Original.jpg", "site_section": "http://www.mynews4.com/rss/3305.rss", "section_title": "KRNV Entertainment News", "url": "http://www.mynews4.com/content/entertainment/story/Albinis-rant-posted-on-billboard/YUn6Da7edEOuz1j1Z46H2g.cspx?rss=3305", "country": "US", "title": "Albini's rant posted on billboard", "performance_score": 0, "site": "mynews4.com", "participants_count": 0, "title_full": "Albini's rant posted on billboard", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T18:49:00.000+03:00", "replies_count": 0, "uuid": "df889d5a709e26fdcd36cc86949dbc82e2379caa"}, "author": "", "url": "http://www.mynews4.com/content/entertainment/story/Albinis-rant-posted-on-billboard/YUn6Da7edEOuz1j1Z46H2g.cspx?rss=3305", "ord_in_thread": 0, "title": "Albini's rant posted on billboard", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Albini"], "text": "Share Updated: 8:53 am \nAn email rant about dance music by veteran rocker Steve Albini has been posted on a huge billboard in London. \nThe studio pioneer was asked by Oscar Powell, boss of Diagonal Records, for permission to use a sample of his vocals from a song by his former band Big Black. \nAlbini responded with a lengthy diatribe against the dance music genre, telling Powell he despises \"club culture,\" but agreed to let him use the clip on Powell's track Insomniac, writing, \"Don't care. Enjoy yourself.\" \nNow the text of the email has been plastered over a billboard in east London after Powell asked the U.S. star if he could use it to promote the single, according to Pitchfork.com. \nIn the message, Albini writes, \"I am absolutely the wrong audience for this kind of music. I've always detested mechanized dance music, its stupid simplicity, the clubs where it was played, the people who went to those clubs, the drugs they took, the s**t they liked to talk about, the clothes they wore, the battles they fought amongst each other... Basically all of it: 100 percent hated every scrap. \n\"The electronic music I liked was radical and different, s**t like the White Noise, Xenakis, Suicide, Kraftwerk, and the earliest stuff form Cabaret Voltaire, SPK and DAF. When that scene and those people got co-opted by dance/club music I felt like we'd lost a war. I detest club culture as deeply as I detest anything on earth. So I am against what you're into, and an enemy of where you come from but I have no problem with what you're doing... In other words, you're welcome to do whatever you like with whatever of mine you've gotten your hands on. Don't care. Enjoy yourself.\" Copyright WENN.com", "external_links": [], "published": "2015-09-30T18:49:00.000+03:00", "crawled": "2015-10-01T07:57:58.306+03:00", "highlightTitle": ""}