{"organizations": [], "uuid": "18739909cf882091c0949bd5ca866f9126ca32f9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wiltshiretimes.co.uk", "main_image": "http://www.wiltshiretimes.co.uk/resources/images/4313667/", "site_section": "http://www.wiltshiretimes.co.uk/leisure/showbiz/rss/", "section_title": "Wiltshire Times | National Entertainment News", "url": "http://www.wiltshiretimes.co.uk/leisure/showbiz/13841131.Aidan_Turner_might_keep_his_shirt_on_for_Poldark_s_second_series/?ref=rss", "country": "GB", "title": "Aidan Turner might keep his shirt on for Poldark's second series", "performance_score": 0, "site": "wiltshiretimes.co.uk", "participants_count": 0, "title_full": "Aidan Turner might keep his shirt on for Poldark's second series", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T13:00:00.000+03:00", "replies_count": 0, "uuid": "18739909cf882091c0949bd5ca866f9126ca32f9"}, "author": "", "url": "http://www.wiltshiretimes.co.uk/leisure/showbiz/13841131.Aidan_Turner_might_keep_his_shirt_on_for_Poldark_s_second_series/?ref=rss", "ord_in_thread": 0, "title": "Aidan Turner might keep his shirt on for Poldark's second series", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Poldark", "Aidan Turner"], "text": "Aidan Turner might keep his shirt on for Poldark's second series Aidan Turner might keep his shirt on for Poldark's second series \nPress Association 2014 / / National Entertainment News Share \nFans of Aidan Turner will be disappointed to hear he may not be getting his top off again in the new series of Poldark. \nThe handsome actor, who plays lead character Ross Poldark, won many hearts when he showed off his toned torso during a now famous scything scene in the hit BBC show. \nBut he will only get his kit off if the story calls for it, according to the show’s writer Debbie Horsfield. (BBC) \nAccording to the Radio Times, Debbie told the audience at the Cheltenham Literature Festival that she didn’t “feel duty bound at all” to get Aidan to take his shirt off in series two of the revamped period drama. \nShe added: “I feel duty bound to the story – that’s the duty I see.” \nThe show’s executive producer Karen Thrussell agreed. \n“There’s no way we can just have him strutting around with his top off for no good reason.” (BBC Pictures) \nQuestioned whether the national obsession with Aidan’s appearance distracted from the series itself, Debbie said: “I don’t feel that, to be honest. It’s the thing that’s attracted a lot of attention but in the grand scheme of things, it probably covers, what, 30 seconds, a minute, out of eight hours of television. \n“I think the huge majority are watching because they think the stories are good, the acting’s good and Aidan with his shirt on is also good.” \nProducer Karen also revealed that Aidan had been somewhat economical with the truth about his horse-riding skills when he had auditioned for the role of the brooding Cornish military man, who was seen in the first series returning from war to find he had lost his love and his family estate was in ruins. \nAlthough even Aidan’s co-stars believed he had learnt to ride while filming The Hobbit, Karen told the Cheltenham audience: “Actually he told me two weeks ago that he didn’t ride a lot in The Hobbit. He just lied to get the part.” \nFortunately for Aidan, he and his cast-mates received some intensive lessons before filming, so he could carry off the role of romantic hero Ross in the saddle. Share article \nPoldark will be back for a new series on BBC One in 2016. Promoted Stories", "external_links": [], "published": "2015-10-12T13:00:00.000+03:00", "crawled": "2015-10-12T14:27:08.375+03:00", "highlightTitle": ""}