{"organizations": [], "uuid": "aabce71a6fc38a1b4304c21e8fe9d54b66d59722", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.democratandchronicle.com", "main_image": "http://www.gannett-cdn.com/-mm-/a42f1ccd478dbda7020baa45a010f4a34f9cd33d/c=0-217-4272-2631&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/10/21/Rochester/Rochester/635810356585480023-ThinkstockPhotos-187980110.jpg", "site_section": "http://www.democratandchronicle.com/", "section_title": "Democrat and Chronicle | Rochester news, community, entertainment, yellow pages and classifieds. Serving Rochester, New York | democratandchronicle.com", "url": "http://www.democratandchronicle.com/story/money/business/2015/10/22/states-jobs-board-riddled-dead-ends/74340674", "country": "US", "title": "State's jobs board riddled with dead ends", "performance_score": 0, "site": "democratandchronicle.com", "participants_count": 1, "title_full": "State's jobs board riddled with dead ends", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T20:37:00.000+03:00", "replies_count": 0, "uuid": "aabce71a6fc38a1b4304c21e8fe9d54b66d59722"}, "author": "democratandchronicle.com", "url": "http://www.democratandchronicle.com/story/money/business/2015/10/22/states-jobs-board-riddled-dead-ends/74340674", "ord_in_thread": 0, "title": "State's jobs board riddled with dead ends", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "An adjunct writing professor, a government food inspector and a key holder for a local store that’s planning to close might not seem to have much in common. But they're all job postings on a state website with several dead ends for job seekers.\nRecently touted by Gov. Andrew Cuomo as having more than 132,000 postings, New York State’s Jobs Express site describes itself as having \"current job openings\" listed throughout the state by area, vacancies in a given region, type of job and, in a fewer number of cases, jobs by company.\nThere are 10,800 \"current\" and \"available jobs\" in the Finger Lakes region listed on the free service, according to a statement released by Cuomo’s office last week.\nBut it wouldn’t take a job seeker long to figure out that a number of postings lead to expired listings or link out to individual company job pages that no longer exist.\n\"It is very disheartening,\" said Hannah Morgan, a local job search expert behind CareerSherpa.net .\nEarlier this week on the site, there was a posting for an adjunct instructor in the University of Rochester's writing, speaking and professor program, although applications were listed as being due on Sept. 15, more than a month ago.\nA part-time customer service job at Wegmans’ Olde World Cheese shop dated Sept. 18 on the site linked out to a blank page for the Gates-based grocer.\nA key holder job listed on the site was for the Webster branch of Jo-Ann Fabric and Craft, expected to close at the Towne Center plaza early next year.\nROCHESTER DEMOCRAT AND CHRONICLE\nJo-Ann's to close at Towne Center\nSome postings date back to last year, including a food inspector job with the U.S. Department of Agriculture.\n\"If you click through and that job has expired, then there is definitely a problem with that aggregator entity,\" Morgan said. \"It reflects badly on the source of the posting, so whatever entity is pulling them needs to rethink what their algorithm is because that’s the problem.\"\nSome of the postings have been updated after concerns on their validity were brought to the state Department of Labor by the Democrat and Chronicle Media Group.\nThe Jobs Express site attracts more than 66,000 visitors a month and, similar to other online job boards, pulls in openings from employers' websites, according to Cullen Burnell, a spokesman with the state Department of Labor.\nHe said that some jobs showing older posting dates, like the food inspector job, are still available on the USDA’s site and have been updated.\n\"Occasional errors, such as the posting from Wegmans, are quickly corrected,\" he wrote in an email. \"Most businesses don’t post jobs with a hard 'apply-by' deadline. Businesses often use listings without closing dates to continue collecting résumés until they have found their ideal candidate, or to service ongoing recruitment needs.\"\nA principal scientist job in Rochester with Valeant Pharmaceuticals was posted on Sept. 9, and does not have a filing deadline . Many other jobs appear similarly on the state's site and various company pages.\nMany others were simply outdated.\nA summer internship with Xerox Corp. in Webster appeared on the site this week. A project manager job with UR also was recently listed despite a deadline date of Oct. 13. A web link to a PR external rep job with MVP Health Care linked out to a blank page. The postings for Xerox and UR also appeared on those organizations' own online job boards.\nMonster, Indeed, CareerBuilder and some other job boards allow job seekers to search by location, date, job type and other factors. Indeed works by pulling in postings from other listings online, similar to the state's site, Morgan said.\n\"It has become much more difficult for job seekers because they have to do this kind of smart search as opposed to relying on the job board,\" she said. \"Even the best aggregators and collectors of job postings are not going to be able to get all of them.\"\nCompanies have few hard and fast rules when it comes to job postings, she said. Some list deadlines for applications, others pull a posting down when the job is filled, and still others keep a posting up indefinitely, perhaps to simply collect résumés.\n\"Smart companies, the companies that really care about recruiting, probably won’t be doing that because they realize that the job seeker can smell this has been up since 2014, and ask, ‘What does that mean?' \" Morgan said. \"It all comes back down to human error, or human lack of intervention, which is understandable given the numerous things these recruiters and HR people are responsible for.\"\nSome high-turnover entry-level jobs may be posted for months if a company wants an endless of supply of résumés, even if that means alienating candidates who feel ignored or may never receive a call, she said.\nDavid Call is a senior vice president of Rochester-based executive search firm Cochrane, Cochrane & Yale, which matches workers and companies in such industries as engineering, operations, management, sales, marketing and more.\n\"The jobs boards are a great tool, but it is not something we utilize a great deal,\" he said. \"We will post something on our website and it often gets picked up by Indeed and some of the other operations that kind of do that: skim along, pick up the job and then report them.\"\nMost jobs are filled within 90 days, Call said. Some may take longer, but most of the candidates apply within the first 10 days of a job being posted online.\n\"I admire the state for what they are doing because at this point, everybody starts their job search on the Internet,\" he said. \"There is a kind of a balancing act in how long you keep a job posted. We sort of take the path of when the job is filled, we take it down. We don’t want to mislead anybody.\"\nAnd when a company allows candidates to apply online, the résumé needs to be highly refined just to get a “foot at least halfway through the door,” Call said. \"You better have a very sharp tool and that’s a résumé that’s built around keywords.\"\nROCHESTER DEMOCRAT AND CHRONICLE\nTips to get hired at a job fair\nAnd job seekers serious about their online search should always click from third-party job sites to company pages to submit applications and find other information.\n\"The words of wisdom to any job seeker, anyone on those job sites, is always to apply directly on the company’s site,\" she said. \"Whenever somebody finds a job they want, click through to the actual job posting on the company website.\"\nTCLAUSEN@Gannett.com", "external_links": ["https://www.labor.ny.gov/jobs/regional.shtm", "http://careersherpa.net/", "http://www.governor.ny.gov/news/governor-cuomo-announces-over-132000-positions-available-jobs-express-website", "http://www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/e6631aa122e8726740a366c821f538462087f83a/c=19-0-499-480/local/-/media/2015/10/16/Rochester/Rochester/635806170658584657-JoAnn.jpg", "http://www.ccy.com/", "https://wegmans.taleo.net/careersection/2/jobdetail.ftl?job=1507606&lang=en", "http://www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/05ce7831505caa977c8cc4f7a632ff878c4dcefd/c=0-456-2736-3192/local/-/media/2015/05/28/Rochester/Rochester/635684244662357064-P1010304-retouch.jpg", "http://swp.mvphealthcare.com:444/ltmprod/CandidateSelfService/controller.servlet?context.dataarea=ltmprod&webappname=CandidateSelfService&context.session.key.HROrganization=2&context.session.key.JobBoard=EXTERNAL&_saveKeys=true&JobPost=1&JobReq=95&context.session.key.noheader=true#", "http://newyork.us.jobs/results.asp?pg=6&si=1069559424&pi=1&ri=1&so=relevance&ls=col", "http://valeant.jobs/rochester-ny/principal-scientist-pharma-development/9AD8D894E52C42379E457431D9494C64/job/?utm_campaign=New%20York%20State%20Job%20Bank&vs=13&utm_medium=NLX&utm_source=New%20York%20State%20Job%20Bank-DE"], "published": "2015-10-22T20:37:00.000+03:00", "crawled": "2015-10-23T06:01:39.916+03:00", "highlightTitle": ""}