{"organizations": [], "uuid": "af58dc8a36dea31be554d1396c7fc8c09d2fd5df", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbsnews.com", "main_image": "http://cbsnews2.cbsistatic.com/hub/i/r/2015/08/04/47e95a9b-897f-4e23-8888-a925dc7ab78a/thumbnail/620x350/11da369b8ddb6d170f6530a9ed911c57/ap784820031255.jpg", "site_section": "http://www.cbsnews.com/entertainment/", "section_title": "Entertainment News, Headlines and Video - CBS News ", "url": "http://www.cbsnews.com/news/martian-criticized-for-changing-races-of-asian-american-characters/", "country": "US", "title": "\"Martian\" criticized for changing races of Asian-American characters", "performance_score": 0, "site": "cbsnews.com", "participants_count": 4, "title_full": "\"Martian\" criticized for changing races of Asian-American characters - CBS News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T20:06:00.000+03:00", "replies_count": 3, "uuid": "6b87ed1a0b04153080e89be63817ad12aeaf6352"}, "author": "Andrea Park CBS News", "url": "http://www.cbsnews.com/news/martian-criticized-for-changing-races-of-asian-american-characters/#post-0", "ord_in_thread": 0, "title": "\"Martian\" criticized for changing races of Asian-American characters", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Just months after Cameron Crowe got heat for casting Emma Stone as an Asian-American character in \"Aloha,\" new Matt Damon flick \"The Martian\" is getting similar blowback.\nThe Media Action Network for Asian Americans (MANAA) lobbed accusations of whitewashing against Ridley Scott for changing the races of two Asian characters in the film version of the book.\nCharacter Mindy Park, who is Korean-American in the book, is played by white actress Mackenzie Davis in the film, and book character Dr. Venkat Kapoor's name is changed to Vincent Kapoor, and is played by Chiwetel Ejiofo.\n36 Photos Matt Damon A look at the career of the Oscar-winning star\nOut of the Asian-American characters in the book, only the race of Jet Propulsion Lab director Bruce Ng remains unchanged; the character is played by Benedict Wong, who is of Chinese descent.\n\"Was Ridley Scott not comfortable having two sets of Asian Americans talking to each other?\" said MANAA founding president Guy Aoki in a statement . \"So few projects are written specifically with Asian-American characters in them, and he's now changed them to a white woman and black man.\"\nHe continued: \"This was a great opportunity to give meaty roles to talented Asian American actors--and boost their careers -- which would've enabled our community to become a greater part of the rescue team. This feel-good movie, which has attracted Oscar buzz, shouldn't get any awards for casting.\"\nAoki asked, \"Was the director afraid that having too many Asian American characters would prevent 20th Century Fox from approving his casting, or that it would be a turn-off to the audience? It didn't stop the book from becoming a best-seller.\"\nPlay Video CBS This Morning How accurate is the science behind \"The Martian\"? In this weekend's box office hit, Matt Damon plays an astronaut stranded on Mars after his crew is hit by a sandstorm. But is the drama realistic...\nMANAA also pointed out that this isn't the first time Scott has been criticized for \"whitewashing\" his cast -- the director was slammed last year for casting white actors in the lead roles of \"Exodus: Gods and Kings\" and Middle Easterners in secondary roles. MANAA Quote: d Scott from an interview last year: \"I can't mount a film of this budget, where I have to rely on tax rebates in Spain, and say that my lead actor is Mohammad so-and-so from such-and-such. I'm just not going to get it financed. So the question doesn't even come up.\"\nDamon, the star of \"The Martian,\" also got himself into hot water after he lectured a black woman on diversity on his show, \"Project Greenlight.\" Damon has since apologized for his remarks.", "external_links": ["https://www.facebook.com/manaaLA/posts/10156064774725580", "http://www.telegraph.co.uk/news/worldnews/northamerica/usa/11261784/I-cant-cast-Mohammad-so-and-so-from-such-and-such-says-Ridley-Scott.html", "http://cbsnews1.cbsistatic.com/hub/i/r/2015/10/05/58c37b5d-4b1f-45fd-87f0-cdea9684e41c/thumbnail/220x140/bb5a572d2d374ce0ccd1059c20ba703d/ctmmartian1005451481640x360.jpg", "http://cbsnews1.cbsistatic.com/hub/i/r/2010/12/18/b16d9085-a642-11e2-a3f0-029118418759/thumbnail/220x140/b9aa73a91df18f7bfa6ec4c3db645fcf/Damon_424_smile.jpg"], "published": "2015-10-09T20:06:00.000+03:00", "crawled": "2015-10-10T03:29:49.181+03:00", "highlightTitle": ""}