{"organizations": [], "uuid": "9e1bb013bfe9ba1a39cf39bf671e711be5ee9d98", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailynews.com", "main_image": "http://www.dailynews.com/apps/pbcsi.dll/storyimage/LA/20151016/FEATURES/151019549/AR/0/AR-151019549.jpg?Maxh=1500&Maxw=1500", "site_section": "http://www.dailynews.com/entertainment", "section_title": "Coverage and breaking news of entertainment in Hollywood and Los Angeles", "url": "http://www.dailynews.com/arts-and-entertainment/20151016/gerald-brommers-exhibit-for-the-love-of-san-fernando-valley-arts-and-cultural-center", "country": "US", "title": "Gerald Brommer’s exhibit for the love of San Fernando Valley Arts and Cultural Center", "performance_score": 0, "site": "dailynews.com", "participants_count": 1, "title_full": "Gerald Brommer’s exhibit for the love of San Fernando Valley Arts and Cultural Center", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "9e1bb013bfe9ba1a39cf39bf671e711be5ee9d98"}, "author": "Sandra Barrera", "url": "http://www.dailynews.com/arts-and-entertainment/20151016/gerald-brommers-exhibit-for-the-love-of-san-fernando-valley-arts-and-cultural-center", "ord_in_thread": 0, "title": "Gerald Brommer’s exhibit for the love of San Fernando Valley Arts and Cultural Center", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Gerald Broomer, a Studio City artist with a national reputation, has vowed to donate 60 percent of sales from his work to the San Fernando Valley Culture Center. Broomer's show at the center will open this Sunday. ( Photo by David Crane/Los Angeles News Group ) Gerald Brommer 200: For the Love of Art\nExhibit\nWhen: 11 a.m.-5 p.m. Tuesday-Saturday, through Oct. 24.\nWhere: San Fernando Valley Arts and Cultural Center, 18312 Oxnard St., Tarzana.\nAdmission: Free.\nInformation: 818-697-5525, www.sfvacc.org\nArtist’s Reception\nWhen: 2-5 p.m. Oct. 18.\nWhere: San Fernando Valley Arts and Cultural Center, 18312 Oxnard St., Tarzana.\nAdmission: Free.\nInformation: 818-697-5525, www.sfvacc.org\nAround the World\nWhat: A gala fundraiser for the San Fernando Valley Arts and Cultural Center.\nWhen: 8-10 p.m. Oct. 24.\nWhere: San Fernando Valley Arts and Cultural Center, 18312 Oxnard St., Tarzana.\nAdmission: $25.\nInformation: 310-283-4105, www.sfvacc.org\nThe first time he walked into the San Fernando Valley Arts and Cultural Center and saw his works hanging on the walls, Studio City-based painter Gerald Brommer was overwhelmed by emotion.\n“I just about cried,” he says. “It looks more like a museum than an art gallery. I’m not kidding. This is incredible.”\nBrommer recalled his first impression earlier this week during a walk through “ Gerald Brommer 200: For the Love of Art ,” a fund-raising exhibit for the arts and cultural center on view through Oct. 24. The show features 200 works by the renowned artist, author and educator who will be on hand from 2 to 5 p.m. today for a free artist reception .\nThe art\nAt 88, Brommer is a prolific and versatile painter.\nHe avoids falling into a rut by working in different styles, from plein air paintings of American and European landscapes in watercolor and acrylic to mixed-media abstracts and others that lie somewhere between. While all of his works are unique, they share Brommer’s affection for details, texture and ever-present pathways that lead people into the composition.\nStanding near a pastoral depicting a book sale just beyond some trees, he draws chuckles from his companions for taking artistic license.\n“The book sale was really a flop, but I made it a success,” he says, pointing to a little girl running toward the sale at the far left of the crowd. “She couldn’t wait to get to the books.”\nOne of his more unusual landscapes is a painting of the Carmel coast. With its flat expanses of color, it was created as a demonstration to show students how to simplify complex subjects.\n“I generally don’t leave them like that except that I liked this,” he says, explaining every painting starts out this way, and then he adds in the details with relish.\nSome of his landscapes are rendered with the addition of Japanese rice paper for texture.\nArtist and educator\nBrommer began selling paintings in the mid-1960s while teaching art at a parochial school in Los Angeles. As business picked up, he decided to give up teaching and become a full-time artist.\n“I could sell everything I painted in those days; it was incredible,” he says.\nWith his work in demand, he turned down calls from people wanting him to teach painting workshops.\nBut one day, while he was driving through Encino on the 101 Freeway, he heard a radio interviewer ask former L.A. Dodger Steve Garvey why he visited schools. He didn’t have to do it anymore. After all, he was an All-Star.\nAdvertisement\nGarvey told the interviewer it was his way of giving back.\n“I just about drove off the freeway,” Brommer recalls. “It was like he was talking to me. When I got home, I said to myself, ‘OK, I’ll try it.’ ”\nOne of his first workshops was in San Antonio, Texas, for 40 people.\n“I started talking and there were 40 pairs of eyes glued on me,” he says. “This never happened when I was teaching high school.”\nBrommer continues to lead workshops on watercolor and mixed media around the world.\n“The collage artists in the Valley adore him,” says Suki Kuss, the exhibit’s co-curator who has taken his stained paper collage classes. “Some of my friends and I call it the ‘Jerry Brommer Changed My Life Workshop,’ because he does. The technique is far from simple, but he doesn’t give you any room to fail.”\nThe exhibit\nIn February, Brommer began preparing for the exhibit. He painted about a quarter of the works (breaking his wrist midway through) and pulled the rest from other gallery shows, all with the goal of raising much-needed funds — he is donating 60 percent of sales to the center, which has been struggling since opening last year .\n“It’s been a rocky ride, but we’re almost to a year, and I was just thrilled when this show came up; we’re so lucky,” says Carolyn Uhri, president of the San Fernando Valley Arts Alliance and director of its center.\nShe adds the center has its supporters. It’s received contributions from L.A. Mayor Eric Garcetti, the Los Angeles Department of Cultural Affairs, L.A. City Councilman Bob Blumenfield and L.A. County Supervisor Sheila Kuehl.\n“The city is on our side,” Uhri says. “To keep this actually going is priority No. 1, but providing quality art work to the local community and to the Westside — let’s get them to drive over the hill.”\nThe center will celebrate its one-year anniversary from 8-10 p.m. Oct. 24 with “ Around the World ,” a gala during which folks will get a last chance to view the special exhibit over hors d’oeuvres, wine and dessert, while Bonnie Bowden and her trio play. It’s also a last chance to buy the work before it comes down.\n“We’re really intent on letting people know that art in the Valley should be recognized,” Uhri says.\nWant to go?\nEXHIBIT\nWhen: 11 a.m.-5 p.m. Tuesday-Saturday, through Oct. 24.\nWhere: San Fernando Valley Arts and Cultural Center, 18312 Oxnard St., Tarzana.\nAdmission: Free.\nInformation: 818-697-5525, www.sfvacc.org\nARTIST’S RECEPTION\nWhen: 2-5 p.m. Oct. 18.\nWhere: San Fernando Valley Arts and Cultural Center, 18312 Oxnard St., Tarzana.\nAdmission: Free.\nInformation: 818-697-5525, www.sfvacc.org\nAROUND THE WORLD\nWhat: A gala fundraiser for the San Fernando Valley Arts and Cultural Center.\nWhen: 8-10 p.m. Oct. 24.\nWhere: San Fernando Valley Arts and Cultural Center, 18312 Oxnard St., Tarzana.\nAdmission: $25.\nInformation: 310-283-4105, www.sfvacc.org\nAbout the Author Reach the author at sandra.barrera@dailynews.com or follow Sandra on Twitter: @sandrabarrera18 .\nFull bio and more articles by Sandra Barrera Back to top", "external_links": ["http://mn1-laweb.newscyclecloud.com/apps/pbcsi.dll/storyimage/LA/20151016/FEATURES/151019549/AR/0/AR-151019549.jpg&maxh=400&maxw=667", "http://losangeles.eventful.com/events/gerald-brommer-200-love-art-benefit-exhibition-rec-/E0-001-087207978-3", "http://mn1-laweb.newscyclecloud.com/apps/pbcsi.dll/persbilde?Avis=LA&ID=8", "http://www.sfvartsalliance.org/", "http://twitter.com/sandrabarrera18", "http://www.baseball-reference.com/players/g/garvest01.shtml", "http://www.sfvartsalliance.org/event-2020693", "http://www.sfvacc.org/", "http://www.sfvartsalliance.org/event-2013478", "http://www.amazon.com/Gerald-F.-Brommer/e/B001JS5QQA"], "published": "2015-10-16T03:00:00.000+03:00", "crawled": "2015-10-17T07:04:37.086+03:00", "highlightTitle": ""}