{"organizations": [], "uuid": "6e6c8e201a8c510bcf28bc897d7ac1ad94ce0858", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.syracuse.com", "main_image": "http://imgick.syracuse.com/home/syr-media/width620/img/entertainment_impact/photo/tracy-morgan-0254b6ad2d12ce2b.jpg", "site_section": "http://impact.syracuse.com/entertainment/atom.xml", "section_title": "Central NY Entertainment", "url": "http://www.syracuse.com/entertainment/index.ssf/2015/10/tracy_morgan_tour_dates_shows.html", "country": "US", "title": "Tracy Morgan tour dates: Comedian's return to stage includes 2 Upstate NY shows", "performance_score": 0, "site": "syracuse.com", "participants_count": 1, "title_full": "Tracy Morgan tour dates: Comedian's return to stage includes 2 Upstate NY shows", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T21:52:00.000+03:00", "replies_count": 0, "uuid": "6e6c8e201a8c510bcf28bc897d7ac1ad94ce0858"}, "author": "Geoff Herbert | gherbert@syracuse.com", "url": "http://www.syracuse.com/entertainment/index.ssf/2015/10/tracy_morgan_tour_dates_shows.html", "ord_in_thread": 0, "title": "Tracy Morgan tour dates: Comedian's return to stage includes 2 Upstate NY shows", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NBC video still \nTracy Morgan is back, ladies and gentlemen. \nFollowing his triumphant comeback at the Emmy Awards and \" Saturday Night Live ,\" the standup comedian is going back on tour for the first time since being seriously injured in a 2014 car crash. The nationwide \"Tracy Morgan: Picking up the Pieces\" tour will begin Feb. 5, 2016, at the Horseshoe Casino in Hammond, Indiana, he announced Tuesday. \nMorgan's return to the stage include two Upstate New York stops: Friday, Feb. 26 at the Seneca Niagara Casino & Hotel in Niagara Falls, and Tuesday, March 8 at the Turning Stone Resort Casino in Verona. Both performances are scheduled to begin at 8 p.m. \nTickets for both shows go on sale Friday through Ticketmaster , at 10 a.m. for the Turning Stone show and at noon for the Niagara Falls show. Prices range from $45 to $85. \nThe former \"SNL\" cast member and \"30 Rock\" star last performed in the Syracuse area to a sold-out at Destiny USA's Funny Bone Comedy Club. \nHe was scheduled to perform at the Turning Stone last August, but he was injured in a June 2014 accident when a truck crashed into the van he was riding in on the New Jersey Turnpike. Comedian James \"Jimmy Mack\" McNair was killed in the crash and Morgan was in a coma for two weeks. \nWhen Morgan returned to \"SNL\" as a guest-host this past weekend, he reprised popular characters like Brian Fellow and joked about his lengthy recovery. \n\"People are wondering, 'Can he speak? Does he have 100 percent mental capacity?'\" he said in his opening monologue. \n\"The truth is, I never did. I might even be a few points higher.\" \nTracy Morgan Tour Dates 2016 Feb 5 Hammond, IN The Venue at Horseshoe Casino Feb 6 Windsor, ON The Colosseum at Caesar's Windsor Feb 12 Atlantic City, NJ Harrah's Atlantic City Feb 13 Cherokee, NC Harrah's Cherokee Event Center Feb 19 Rutland, VT Paramount Theatre Feb 20 Boston, MA Wilbur Theatre Feb 26 Niagara Falls, NY Seneca Niagara Casino & Hotel Feb 27 Orillia, ON Casino Rama Entertainment Centre March 4 Mt. Pleasant, MI Soaring Eagle Casino Resort March 5 Baraboo, WI Ho-Chunk Casino March 8 Verona, NY Turning Stone Resort Casino March 11 Wilmington, DE Playhouse on Rodney Square March 12 Huntington, NY The Paramount March 13 Lakeville, PA Cove Haven Entertainment Resorts March 19 Mashantucket, CT Grand Theater at Foxwoods March 25 Norman, OK Riverwind Casino March 26 Thackerville, OK Winstar World Casino & Resort April 1 New York, NY Hot 97 April Fools Comedy Show - Madison Square Garden April 2 Englewood, NJ Bergen Performing Arts Center April 8 Kahului, HI Maui Arts & Cultural Center - Castle Theater April 9 Honolulu, HI Blaisdell Concert Hall April 15 Ridgefield, CT Ridgefield Playhouse April 16 New Brunswick, NJ State Theatre April 22 Washington, DC John F. Kennedy Center for the Performing Arts April 23 Reading, PA Santander Performing Arts Center April 29 Robinsonville, MS Horseshoe Tunica - Bluesville April 30 Atlanta, GA Cobb Energy Performing Arts Centre May 6 Las Vegas, NV Mirage Hotel & Casino May 7 Las Vegas, NV Mirage Hotel & Casino May 13 Vancouver, BC Hard Rock Casino Vancouver May 14 Scottsdale, AZ Talking Stick Resort & Casino May 20 Bossier City, LA Horseshoe Bossier City May 21 Hollywood, FL Seminole Hard Rock Live Arena May 28 Westhampton Beach, NY Westhampton Beach Performing Arts Center", "external_links": [], "published": "2015-10-20T21:52:00.000+03:00", "crawled": "2015-10-21T07:31:25.061+03:00", "highlightTitle": ""}