{"organizations": [], "uuid": "e19aead19c283fac0993e3e22477a3fb88609124", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://images.canberratimes.com.au/2015/10/16/6936767/Thumbnail1001550216gkaoz4image.related.thumbnail.320x214.gkap3c.png1445382795143.jpg.jpg", "site_section": "http://feeds.canberratimes.com.au/rssheadlines/entertainment.xml#", "section_title": "Canberra Times Entertainment Headlines", "url": "http://www.canberratimes.com.au/entertainment/tv-and-radio/the-limitless-possibilities-of-the-small-screen-20151016-gkap3c.html", "country": "AU", "title": "The Limitless possibilities of the small screen", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "The Limitless possibilities of the small screen", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T16:15:00.000+03:00", "replies_count": 0, "uuid": "e19aead19c283fac0993e3e22477a3fb88609124"}, "author": "Michael Idato", "url": "http://www.canberratimes.com.au/entertainment/tv-and-radio/the-limitless-possibilities-of-the-small-screen-20151016-gkap3c.html", "ord_in_thread": 0, "title": "The Limitless possibilities of the small screen", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Jake McDorman as Brian Finch in Limitless . Photo: Supplied \nBrian Finch may not be wearing a Lycra suit with a cape, but it is easy to interpret the new television series Limitless through the prism of the superhero genre.\nFinch, played by 28-year-old Jake McDorman, uses a drug, NZT-48, which unleashes the limitless potential of the human mind. For 12 hours after every dose he's the smartest person in the world.\nThe series is based on the 2011 film of the same name, which starred Bradley Cooper as Eddie Morra, a struggling writer who experiments with the drug. Cooper reprises his role in the the television sequel, now a US senator and watching over Finch's use of same drug which allowed him to unleash his potential and rise to prominence in political circles.\n\"I feel like we're at the tip of the iceberg,\" McDorman says. \"Even though Brian inadvertently has gotten wrapped into a situation where he's able to take this pill with little or no side effects, the drug still completely controls his life. He's working for the FBI which I think he will find pretty quick isn't as great as it might imagine it is, and he's being watched by Eddie Morra, whose intentions are very ambiguous. He doesn't know how sinister his intentions are.\"\nAdvertisement Though the movie has a little of the \"beware of what you wish for\" about it, McDorman says the moral structure of the television series, and its main character Brian Finch, is clearer.\n\"Eddie Morra took the pill in a much more self-serving way, [whereas] Brian … I think if he had taken it that one day he would have used it to help his dad and maybe that would have been it. I don't think he all of a sudden had a Eureka moment about something he wanted to be,\" he says. \"There's a line in one of the episodes … if anyone [else] had taken NZT they would have thought of a million things to do help their own lives. But the first thing Brian thought of was to help someone else. That reveals who he is, that's his character.\"\nFinch is also a very different person from Morra, he adds. \"Brian is younger than Eddie when we find him in the movie,\" McDorman says. \"He comes from a different place, he's more petulant and rebellious.\"\nThe film was based on the book The Dark Fields by Alan Glynn, which was published in 2001. Because the television series is, in effect, several steps removed from the book, McDorman felt it was better to leave the book alone and focus on the series' use of the 2011 film as its basis. \"There's the book, then the film then the series, [and] I think matching the template of the movie is the world we're living in,\" he says. \"And already our vibe is a lot different than the film.\"\nAccepting the role, he says, was a no-brainer. \"Coming in you know a couple of facts: I had seen the movie so I was kind of hooked, and then knowing that Bradley Cooper was involved and was going to reprise his role as Eddie Morra was a huge vote of confidence in the whole project,\" he says.\n\"I am always a fan of TV shows if they are based on movies that try to expand the universe of the movie, rather than re-write the universe of the movie,\" McDorman adds. \"So there was a lot going in already behind the show. Plus all the producers behind the movie, there was a lot of creative support. Going in you know it's legitimate.\"\nThe series also, to some extent, attempts to explode some of the traditional narrative habits of television dramas. It dispenses with back story – there is an assumption, to some extent, that the audience is at least aware of the film – and kicks off proceedings in the middle of the story, so to speak, rather than the beginning.\n\"The script started off in the middle of an action sequence and I think it's smart,\" McDorman says. \"My parents just watched it for the first time; they're not very tech savvy, and because it started in the middle of an action sequence they were trying to rewind it. It was a screener, there were no opening credits, it just went boom.\"\nWhat it does, McDorman says, is immediately \"click you into the idea that we have to get back to this moment, them at this standoff on a subway platform, and figure out who these two people are and how they got there. It grabbed me right away. The action really jumps right off the page. It's probably the craziest stunts and fun I have had on set ever.\"\nThe film was directed by Neil Burger from a script by Leslie Dixon. The television adaptation was developed by Craig Sweeny and the pilot episode was directed by Marc Webb. The show's producers include Cooper, Sweeny, Webb, Alex Kurtzman and Roberto Orci. Though the medium of television is, historically, a writer's medium, the migration of film talent to the smaller screen means the influence of TV directors is on the rise. Limitless demonstrates that powerfully. \"I want to give Craig all the credit in the world, there is so much to juggle it blows my mind that he can do it, but Marc and Craig struck a harmony in our pilot, and Mark came back not only to direct episode two but co-write it.\"\nThough the show's authorship is split between them, Webb's influence, McDorman says, is everywhere. \"The way our camera moves, the way the story is told, the difference in the way he shoots when Brian is on NZT compared with when he's not on NZT, all of that is such an integral template for future episodes and that's all Marc,\" he says.\n\"Even just with freeze framing, putting icons on the screen, all the camera tricks Mark did in the pilot really set up the look of the show. I just work my ass off to try and be a part of that trifecta.\"\n\"Marc has set the template for the any director who comes in to direct from here on out,\" McDorman adds. \"There's a little bible: when he's on NZT it's cameras on rigs, when he's off NZT it's cameras hand-held. It's this whole source of material that's so rich, and he directs through the point of view of Brian really well. It helps me, it moves quick, the edits are fast.\"\nWHAT \nLimitless\nWHEN \nTen, Sunday, 8.30pm", "external_links": [], "published": "2015-10-21T16:15:00.000+03:00", "crawled": "2015-10-21T17:26:16.489+03:00", "highlightTitle": ""}