{"organizations": [], "uuid": "47f1d94850ab7f9c4d6b7cf24f256d6f8f27caca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailymercury.com.au", "main_image": "http://media.apnarm.net.au/img/media/images/2015/10/21/MDM_22-10-2015_ROP_10_MDM_01-07-2013_fct727x545x18.0x28.0_ct300x300.jpg", "site_section": "http://feeds2.feedburner.com/DailymercurycomauEntertainment", "section_title": "dailymercury.com.au: Entertainment", "url": "http://www.dailymercury.com.au/news/festival-gone-for-now-not-forgotten/2815098/", "country": "AU", "title": "We were there: River Sessions gone for now, not forgotten", "performance_score": 0, "site": "dailymercury.com.au", "participants_count": 0, "title_full": "We were there: River Sessions gone for now, not forgotten", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T17:00:00.000+03:00", "replies_count": 0, "uuid": "47f1d94850ab7f9c4d6b7cf24f256d6f8f27caca"}, "author": "", "url": "http://www.dailymercury.com.au/news/festival-gone-for-now-not-forgotten/2815098/", "ord_in_thread": 0, "title": "We were there: River Sessions gone for now, not forgotten", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Local Real Estate Subscribe Now \nIT might not have made an appearance this year, but River Sessions has certainly left its mark on Mackay. \nAnd the Daily Mercury was there to support the festival with comprehensive coverage before and after the event. \nResponsible for bringing some of the latest and greatest acts to the region, River Sessions in only seven years quickly turned into one of the regions most premier events. Photos View Photo Gallery \nThe last festival wrapped up in 2014, but there is still hope that it, or a similar event, will return in 2016. \nIn its last year The Amity Affliction headlined the show, with Megan Washington, Illy and Dan Sultan performing for the thousands of fans. \nFounder Adrian Young could barely contain his excitement at the time with the event at the showgrounds for the second year. \n\"We will have four days on site for the build prior to the festival,\" Mr Young said at the time. Photos View Photo Gallery \n\"The venue is the perfect location and space for the event and we are happy to be here two years running. \nIn March Mr Young told the Daily Mercury there were a number of reasons he had decided to cancel this year's event. Photos View Photo Gallery \nNow based in Brisbane, Mr Young said he would take a break and put his efforts into study, travel and other business goals. \n\"It's sad it's not happening this year,\" he said at the time. \nA lot of the Daily Mercury's coverage of the event was online. \nThere were announcement of lineups, previews with bands performing at the show and details about the event in the days leading up to it. \nThe wrap included a gallery of pictures from our own staff photographers and contributed photos from festival goers. \nThe Amity Affliction headlined River Sessions for its last year. festival", "external_links": [], "published": "2015-10-21T17:00:00.000+03:00", "crawled": "2015-10-22T19:15:16.462+03:00", "highlightTitle": ""}