{"organizations": [], "uuid": "41d24c1144c3c5a2a2b8ace919380f23444e9070", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.upi.com", "main_image": "http://cdnph.upi.com/sv/ph/og/upi/6811444955465/2015/1/de29f40708da4065ac56ef7e69bfa70d/v2.1/UPI-Almanac-for-Tuesday-Oct-20-2015.jpg", "site_section": "http://www.upi.com/Entertainment_News/", "section_title": "Entertainment news, celebrity news, celebrity pics, entertainment stories - UPI.com", "url": "http://www.upi.com/Top_News/2015/10/20/UPI-Almanac-for-Tuesday-Oct-20-2015/6811444955465/", "country": "US", "title": "The Almanac - October 20th", "performance_score": 0, "site": "upi.com", "participants_count": 1, "title_full": "The Almanac - October 20th - UPI.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T11:30:00.000+03:00", "replies_count": 0, "uuid": "41d24c1144c3c5a2a2b8ace919380f23444e9070"}, "author": "upi.com", "url": "http://www.upi.com/Top_News/2015/10/20/UPI-Almanac-for-Tuesday-Oct-20-2015/6811444955465/", "ord_in_thread": 0, "title": "The Almanac - October 20th", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "1 of 9 | License Photo Today is Tuesday, Oct. 20, the 293rd day of 2015 with 72 to follow.\nThe moon is waning. The morning stars are Jupiter, Mercury and Venus. The evening stars are Mars, Neptune, Uranus and Saturn.\nThose born on this date are under the sign of Libra. They include English astronomer and architect Christopher Wren in 1632; French poet Arthur Rimbaud in 1854; James Robert Mann, Illinois congressman and author of the \"White Slave Traffic Act,\" also known as the \"Mann Act,\" in 1856; educator John Dewey in 1859; composer Charles Ives in 1874; actors Bela Lugosi (\"Dracula\") and Margaret Dumont, both in 1882; musician Jelly Roll Morton in 1885; mystery writer Ellery Queen (Frederic Dannay) in 1905; TV personality Arlene Francis in 1907; longtime Yankee Stadium announcer Bob Sheppard in 1910; game show contestant and psychologist Joyce Brothers in 1927; country singer Grandpa (Louis Marshall) Jones in 1913; humorist Art Buchwald in 1925; baseball Hall of Fame members Mickey Mantle in 1931 and Juan Marichal in 1937 (age 78); actors William Christopher in 1932 (age 83), Jerry Orbach in 1935, Earl Hindman in 1942 and Viggo Mortensen in 1958 (age 57); poet Robert Pinsky in 1940 (age 75); writer Lewis Grizzard in 1946; Rock and Roll Hall of Fame member Tom Petty in 1950 (age 65); film director Danny Boyle in 1956 (age 59); political commentator Michelle Malkin in 1970 (age 45); rapper Snoop Dogg in 1971 (age 44); and actor John Krasinski in 1979 (age 36).\nOn this date in history:\nIn 1818, the United States and Britain agreed to establish the 49th parallel as the official boundary between the U.S. and Canada.\nIn 1918, Germany accepted U.S. President Woodrow Wilson's terms to end World War I .\nIn 1944 American troops landed on the eastern coast of Leyte Island in the Philippines. Gen. Douglas MacArthur, forced off the island 2 years earlier said as he strode ashore, \"I have returned.\"\nIn 1947, the U.S. House of Representatives Un-American Activities Committee opened public hearings into alleged communist influence in Hollywood.\nIn 1968, former First Lady Jacqueline Kennedy marries Greek shipping tycoon Aristotle Onassis on the Greek island of Skorpios.\nIn 1973, during the Watergate scandal , U.S. President Richard Nixon dismissed two officials for refusing to fire special prosecutor Archibald Cox. (The incident became known as the \"Saturday Night Massacre.\")\nIn 1977, members of Lynyrd Skynyrd, including lead singer Ronnie Van Zant and guitarist Steve Gaines, were killed in the Mississippi crash of a plane chartered by the rock band. Twenty people survived the crash.\nIn 1982, up to 340 soccer fans were crushed to death in a stampede on icy steps in a Moscow stadium passageway during a match between Soviet and Dutch players.\nIn 1994, Hollywood star Burt Lancaster died at the age of 80.\nIn 2004, retired Gen. Susilo Bambang Yudhoyono was sworn in as Indonesia's sixth president after winning the country's first direct elections for head of state.\nIn 2010, more than 1 million ballots in the Afghan parliamentary election were disqualified for fraud , electoral officials said two days after the vote.\nIn 2011, deposed Libyan dictator Moammar Gadhafi was killed as he tried to escape from his hometown hideout in the coastal city of Sirte while troops, including NATO forces, closed in. Gadhafi, 69, ousted from power in a massive revolt two months earlier, had ruled Libya for 42 years.\nIn 2012, opposition activists in Syria said the bodies of more than 75 people, mostly women, children and elderly people, many showing signs of torture, were found in the city of Deir Ezzor.\nIn 2013, Arab League Secretary-General Nabil al-Araby said an international conference aimed at ending the civil war in Syria would be conducted in November. Within hours of his announcement, a sucide bomber killed more than 30 people in the Syrian city of Hama. In 2 1/2 years, the war had claimed more than 100,000 lives and 2 million Syrians had fled to other countries.", "external_links": [], "published": "2015-10-20T11:30:00.000+03:00", "crawled": "2015-10-20T10:32:29.203+03:00", "highlightTitle": ""}