{"organizations": [], "uuid": "a07de0f32da8f9008b460a89345df99f7c319432", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.vvdailypress.com", "main_image": "http://www.vvdailypress.com/storyimage/ZZ/20151015/ENTERTAINMENT/310159846/AR/0/AR-310159846.jpg", "site_section": "http://www.vvdailypress.com/entertainment?template=rss&mime=xml", "section_title": "Entertainment - VVdailypress.com", "url": "http://www.vvdailypress.com/article/ZZ/20151015/ENTERTAINMENT/310159846/12968/ENTERTAINMENT?rssfeed=true", "country": "US", "title": "Yankee Doodle Dandy Actress Joan Leslie Dies at 90", "performance_score": 0, "site": "vvdailypress.com", "participants_count": 1, "title_full": "Yankee Doodle Dandy Actress Joan Leslie Dies at 90", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:15:00.000+03:00", "replies_count": 0, "uuid": "a07de0f32da8f9008b460a89345df99f7c319432"}, "author": "TV Guide", "url": "http://www.vvdailypress.com/article/ZZ/20151015/ENTERTAINMENT/310159846/12968/ENTERTAINMENT?rssfeed=true", "ord_in_thread": 0, "title": "Yankee Doodle Dandy Actress Joan Leslie Dies at 90", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Yankee Doodle Dandy Actress Joan Leslie Dies at 90 It's a sad day for Old Hollywood.Joan Leslie, who appeared in number of movies during Hollywood's first Golden Age, died this week. She was 90 years old.Leslie appeared in ... Comment Posted Oct. 15, 2015 at 4:10 PM Updated at 7:15 PM Posted Oct. 15, 2015 at 4:10 PM Updated at 7:15 PM » Social News It's a sad day for Old Hollywood. Joan Leslie , who appeared in number of movies during Hollywood's first Golden Age, died this week. She was 90 years old. Leslie appeared in movies like High Sierra , Sergeant York , Yankee Doodle Dandy , and The Sky's the Limit , in which she co-starred with Fred Astaire . Born Joan Agnes Theresa Sadie Brodel in Michigan in 1925, she began performing with her mother and musically gifted sisters at 2-and-a-half years old. Sopranos actor Frank Albanese dies at 84 During the Great Depression, she and her two older sisters went into vaudeville to earn money for their family. They toured North America as The Three Brodels. To evade child labor investigators, the then-9-year-old told them she was 16. An MGM scout \"discovered\" her, and she landed a $200-a-week contract in 1936. After working at a few different studios, she was signed by Warner Brothers in 1941. (They asked her to change her stage name from Brodel to Leslie to avoid confusion with a similarly-named actress on their payroll.) In addition to her film with Astaire, she appeared on screen with famous actors like James Cagney, Gary Cooper, Humphrey Bogart, and Ronald Reagan. Leslie did not smoke or drink. The Catholic Theatre Guild honored her with an award in 1947 for her \"consistent refusal to use her talents and art in film productions of objectionable character.\" She married a doctor named William Caldwell in 1950, and gave birth to identical twin girls 10 months later. Both of her daughters grew up to be doctors and medical school professors. From the 1950s through the early 1990s, she appeared in a number of TV series and made-for-TV movies. Her last role was in 1991's TV movie Fire in the Dark . Leslie was named one of the \"Baby Stars of 1940\" by a group of Hollywood directors that included Orson Welles . She received a star on the Hollywood Walk of Fame in 1960. In 1999, the American Film Institute named Leslie as one of the 250 actresses nominated for their list of the 25 greatest female screen legends to have debuted before 1950. Other Links From TVGuide.com", "external_links": [], "published": "2015-10-16T03:15:00.000+03:00", "crawled": "2015-10-16T03:12:43.772+03:00", "highlightTitle": ""}