{"organizations": [], "uuid": "06a901c959d98383937e707ad2deda0b8a8a7abb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.torontosun.com", "main_image": "http://storage.torontosun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297760034118_ORIGINAL.jpg?quality=80&size=100x", "site_section": "http://www.torontosun.com/entertainment/rss.xml", "section_title": "Top Entertainment stories", "url": "http://www.torontosun.com/2015/10/14/the-knick-eric-johnsons-angry-character-tries-to-save-his-career-in-season-2", "country": "CA", "title": "'The Knick': Eric Johnson's angry character tries to save his career in Season 2", "performance_score": 0, "site": "torontosun.com", "participants_count": 0, "title_full": "'The Knick': Eric Johnson's angry character tries to save his career in Season 2", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T21:01:00.000+03:00", "replies_count": 0, "uuid": "06a901c959d98383937e707ad2deda0b8a8a7abb"}, "author": "", "url": "http://www.torontosun.com/2015/10/14/the-knick-eric-johnsons-angry-character-tries-to-save-his-career-in-season-2", "ord_in_thread": 0, "title": "'The Knick': Eric Johnson's angry character tries to save his career in Season 2", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Steven Soderbergh", "Eric Johnson"], "text": "Steven Soderbergh returns to TV with dark medical drama 'The Knick' \n“He looked as if his head might explode.” \nMost of us have uttered that expression, or a close variation of it, from time to time. But apparently we all have been using it far too casually. \nBecause now I have seen the look of a head that might explode. And it belongs to a character played by Eric Johnson in The Knick. \nSet at a New York City hospital in the early 1900s, this dark drama series from acclaimed director Steven Soderbergh topped my annual list of best TV shows in 2014. The scene to which I'm referring occurs in the first episode of the second season, which begins Friday, Oct. 16, on HBO Canada. \nDr. Everett Gallinger (Johnson) is waiting in the hospital office of Dr. Algernon “Algie” Edwards (Andre Holland). Algie enters and is startled, because there has been so much bad blood between these two men. In fact, Everett was suspended for attacking Algie. But Algie gathers himself and asks Everett, “Tell me, how are things at home?” \nThat's when it happens. \nEverett pauses. You can see on his face that he's so angry, so insulted, so humiliated, on so many levels, that he can't even form words. There's just so much history going through his mind. The entire first season, in fact. \nIt's impressive work by Johnson, saying so much without saying anything in five silent seconds. \n“That's an eternity in television,” agreed Johnson, who is best known to TV audiences for his work on Rookie Blue, Flash Gordon and Smallville. “I believe that actually was the first scene I shot in Season 2, so it was a pretty loaded, heavy day to break the seal. It's a tense scene. \n“(Everett) needs something from (Algie) at that moment. Everett swallows his pride even to show up. It's like two dogs circling each other.” \nFirst and foremost, Everett hates everything that comes out of Algie's mouth, because Algie is black, and Algie moved ahead of Everett in the pecking order at the hospital. \nPlus, Everett's wife Eleanor (Maya Kazan) had a mental breakdown after the couple lost a child. She wound up in a mental facility, and our worst fears about what mental care would have been like in 1900 were realized. Some quack actually yanked out all her teeth. \nSo for Everett to hear the question, “How are things at home?” from Algie, of all people? In Everett's ears, it's infuriatingly condescending. \n“One of the things (Soderbergh) did in Season 1, and you'll really see in Season 2, are those carefully choreographed single shots, where you allow the scene to unfold, and not cutting away to augment what's happening,” Johnson said. “You're watching it in an active, voyeuristic way.” \nThe lead character in The Knick is Dr. John “Thack” Thackery (Clive Owen), the brilliant and innovative chief of surgery at the hospital whose boundless energy in Season 1 was fuelled by a drug addiction. \nThack had been planning to promote Everett, but political interference from hospital administrators got Algie the job. With Thack beginning Season 2 in a rudimentary rehab facility, Algie is the acting chief of surgery. Algie would love to make it permanent, although the people running the hospital likely aren't that progressive. \nComing off his suspension, Everett is ready to return to work, but he has no interest in being subordinate to Algie. So it's in Everett's best interests to get Thack healthy as soon as possible. \nJohnson chuckled when I told him that sometimes I feel badly for Everett, because his life really fell apart. But then the character is such a racist, I get mad at myself for feeling sorry for him. Everett hardly is alone in his racism in this era, but still, you know what I mean. \n“I appreciate you feeling bad, and then being mad at the fact that you feel bad, because that's exactly the goal,” Johnson said. \n“This is not a stilted Victorian drama with the idea of looking back at these people with nostalgia and reverence or romance. It's a very honest and, at times, brutal look at people.” \nIndeed it is. And if you look really closely, you just might see someone's head explode. \nTwitter: @billharris_tv", "external_links": [], "published": "2015-10-14T21:01:00.000+03:00", "crawled": "2015-10-14T22:11:10.255+03:00", "highlightTitle": ""}