{"organizations": [], "uuid": "e68eec9f30ba3cddbf9321607e77c95d5b42b81a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ibtimes.co.uk", "main_image": "http://d.ibtimes.co.uk/en/full/1464400/hollyoaks-logo.jpg", "site_section": "http://www.ibtimes.co.uk/rss/entertainment", "section_title": "IBTimes.co.uk : Entertainment", "url": "http://www.ibtimes.co.uk/hollyoaks-20th-anniversary-most-shocking-moments-john-paul-craig-affair-max-dying-1525090", "country": "US", "title": "Hollyoaks 20th anniversary: Most shocking moments from John Paul and Craig affair to Max dying", "performance_score": 0, "site": "ibtimes.co.uk", "participants_count": 0, "title_full": "Hollyoaks 20th anniversary: Most shocking moments from John Paul and Craig affair to Max dying", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T11:00:00.000+03:00", "replies_count": 0, "uuid": "e68eec9f30ba3cddbf9321607e77c95d5b42b81a"}, "author": "", "url": "http://www.ibtimes.co.uk/hollyoaks-20th-anniversary-most-shocking-moments-john-paul-craig-affair-max-dying-1525090", "ord_in_thread": 0, "title": "Hollyoaks 20th anniversary: Most shocking moments from John Paul and Craig affair to Max dying", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Craig", "John Paul", "Max"], "text": "October 22, 2015 09:00 BST Hollyoaks has enjoyed its fair share of shocking storylines over the last 20 years Lime Pictures/All3Media \nEastEnders and Coronation Street may be bigger in prestige when it comes to the soap landscape but when it comes to the most scandalous storylines, Hollyoaks certainly holds its own. The Channel 4 series may not exactly clean up at the awards shows but fans will always appreciate the show's daring approach to covering the most uncomfortable and shocking topics. \nAs the long-running soap – or teen drama – celebrates its 20th anniversary, IBTimes UK looks back at the most jaw-dropping moments and storylines that have gripped viewers over the last two decades. Max dies on his wedding day \nIt was the end of the Max and OB bromance when the former died just moments after tying the knot with Steph while trying to save his younger brother Tom from getting run over. It made for truly emotional scenes with Max dying in OB's arms and declaring his love for his best friend. 'Oaks has never the same without him. Becca and Justin's teacher/pupil love affair \nThere was never going to be a happy ending when Becca cheated on her husband Jake Dean by sleeping with her pupil Justin. Becca was imprisoned over her love affair with the student but later died in jail. Ste cuts off Amy's hair \nThe abusive relationship between Amy and Ste was incredibly hard to watch and viewers gasped when he chopped off his girlfriend's famously long red hair during an argument. Rhys sleeping with half-sister Beth - only to later die in a car crash \nIt led to Brookside's downfall when they attempted to cover the highly controversial subject but somehow, viewers were gripped by the incestuous relationship between half-siblings Rhys and Beth. When they initially slept together, the half-brother and sister were unaware that they were related but when they did learn the truth, the twisted romance continued anyway. Although it forcibly came to an end when Beth died in a car crash. Steph sacrifices herself in the fire \nPoor Steph had been diagnosed with cancer and decided not to fight for her life when she and several others were trapped in a fire. It still sends shivers down the spine watching Steph accept her fate and uttering her last words: \"I'm ready now,\" before walking into the burning building. May she and Max rest in peace. John Paul and Craig's gay affair exposed \nIt became one of the sweetest love stories soap has ever seen but the path of true love certainly was not smooth for gay couple John Paul and Craig. The pair had been forced to keep their romance under wraps but it was prematurely exposed to their family and friends when Craig's fiance Sarah Barnes caught them in a clinch. Gripping stuff. Hannah Ashworth's eating disorder \nEmma Rigby rightfully won best actress at the British Soap Awards for her portrayal of character Hannah's battle with anorexia and bulimia. Perhaps the most harrowing scene came when Hannah visited her friend Melissa, who was also suffering from an eating disorder, in the hospital. Who shot Calvin? \nBefore there was the neverending \"Who killed Lucy?\" saga in EastEnders, Hollyoaks broadcast their own whodunnit with the murder of policeman Calvin Valentine on his wedding day. It took six months for viewers to find out that it was his sister-in-law Theresa McQueen who pulled the trigger. What a family affair! Niall attempts to kill the McQueens \nNiall was out for revenge when he arrived in the 'Oaks to get back at his mother Myra McQueen, who abandoned him as a baby. Unfortunately for Tina McQueen, she was the only one not to get out alive during his plan to blow up the church. Karma did come back to get him when he met his end at the bottom of a cliff. More TV news", "external_links": [], "published": "2015-10-22T11:00:00.000+03:00", "crawled": "2015-10-22T12:12:53.003+03:00", "highlightTitle": ""}