{"organizations": [], "uuid": "4132ba11b81e0e6f012bb30ec57af741958f3bfc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "http://s2.reutersmedia.net/resources/r/?m=02&d=20151012&t=2&i=1086493623&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXNPEB9B0YF", "site_section": "http://feeds.reuters.com/reuters/entertainment", "section_title": "Reuters: Entertainment News", "url": "http://www.reuters.com/article/2015/10/12/us-music-janetjackson-charts-idUSKCN0S624F20151012", "country": "US", "title": "Janet Jackson notches seventh No. 1 album on Billboard 200 chart", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Janet Jackson notches seventh No. 1 album on Billboard 200 chart | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T00:44:00.000+03:00", "replies_count": 0, "uuid": "4132ba11b81e0e6f012bb30ec57af741958f3bfc"}, "author": "Piya Sinha-Roy", "url": "http://www.reuters.com/article/2015/10/12/us-music-janetjackson-charts-idUSKCN0S624F20151012", "ord_in_thread": 0, "title": "Janet Jackson notches seventh No. 1 album on Billboard 200 chart", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES Pop star Janet Jackson scored her seventh No. 1 album on the weekly U.S. Billboard 200 album chart on Monday, making her only the third musician to achieve a chart-topping record in each of the past four decades, Billboard said.\n\"Unbreakable,\" Jackson's eleventh studio album and the first after the 2009 death of her pop star brother Michael Jackson, sold 109,000 albums, 44,000 songs and was streamed nearly 4 million times in the week ending Oct. 8, totaling 116,000 units according to figures from Nielsen SoundScan.\nThe only other artists to score a chart-topping record in each of the past four decades are Barbra Streisand and Bruce Springsteen.\nStreisand and Madonna are the only other female artists to have more No. 1 albums than Jackson, the former with 10 under her belt and the latter with eight, Billboard said.\nThe Billboard 200 chart tallies album sales, song sales (10 songs equal one album) and streaming activity (1,500 streams equal one album).\nLast week's chart-topper, rapper Fetty Wap's self-titled record, dropped to No. 4 this week, behind R&B singer The Weeknd's \"Beauty Behind the Madness\" at No. 2 with 73,000 units and rappers Drake and Future's \"What A Time To Be Alive\" at No. 3 with 65,000 units.\nOnly one other new album cracked into the top 10 this week, R&B singer Tamar Braxton's \"Calling All Lovers\" at No. 5.\nOn the Digital Songs chart, which measures online download sales, Drake's \"Hotline Bling\" ousted The Weeknd's \"Hills\" for the top spot, selling 121,000 downloads in the past week.\n(Reporting by Piya Sinha-Roy; Editing by Alan Crosby)", "external_links": [], "published": "2015-10-13T00:44:00.000+03:00", "crawled": "2015-10-13T00:46:05.772+03:00", "highlightTitle": ""}