{"organizations": [], "uuid": "8c65e36050cd5626eb4a4ab5b8a0f28a17dc15f6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.hitc.com", "main_image": "http://cdn3-i.hitc-s.com/76/lord_sugar_14697.jpg", "site_section": "http://www.hitc.com/en-gb/lifestyle/entertainment/", "section_title": "Entertainment News", "url": "http://www.hitc.com/en-gb/2015/10/14/its-time-to-kill-off-the-apprentice/", "country": "GB", "title": "It's time to kill off The Apprentice", "performance_score": 0, "site": "hitc.com", "participants_count": 1, "title_full": "It's time to kill off The Apprentice", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "8c65e36050cd5626eb4a4ab5b8a0f28a17dc15f6"}, "author": "The Guardian", "url": "http://www.hitc.com/en-gb/2015/10/14/its-time-to-kill-off-the-apprentice/", "ord_in_thread": 0, "title": "It's time to kill off The Apprentice", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Cast your mind back to last Wednesday evening.\nNadiya Hussain had just won The Great British Bake Off in such a blaze of heartwarming positivity that even Mary Berry was briefly reduced to tears. It felt tender. It felt inclusive. It felt, undoubtedly, like a Moment; one that you wanted to hold and cherish because it was just so perfect. Watching it, you felt like nothing could ruin that moment.\nAnd then, seconds later, something ruined it. That something was a promo for The Apprentice . A swathe of slate-grey douchebags in stupid ties, all looking as if they’d somehow managed to surgically graft the Instagram Structure filter to their own faces, barking clumsy metaphors about eagles to a man who looked for all the world like an escapee from a sanctuary for neglected hedgehogs.\nThe juxtaposition was heartbreaking. It was like waking up from the best night’s sleep of your life to realise that you’re in Pyongyang. It was like watching your mum divorce your dad and marry a Death Eater. It was like watching a new version of It’s a Wonderful Life where, right in the middle of Auld Lang Syne, Henry Potter brutally stabs George Bailey to death and performs a graphic blood ritual upon his corpse.\nRelated: The Apprentice should challenge candidates to develop a new Facebook – not flog fish fingers\nThis will be the 11th series – the 14th if you count the apocalyptic vision of the future that was Young Apprentice – and I’m sick of it. I’m sick of the contestants ; of their witless self belief and their sweatflop desperation and the way they truly believe that participating in what basically amounts to a succession of dismal Generation Game sausage-making skits demonstrates their unknowable business acumen.\nI’m sick of the tasks, which are now exclusively limited to The One Where They Sell Crap To Idiots, Then Run Around Local Shops Trying To Offload It All For 50p Three Seconds From the End and The One Where They’re Bizarrely Expected To Become Instant Experts In a Field They’re Not Familiar With, Then Go And Visit Actual Experts Who Exist Only To Patronise Them.\nI’m sick of the rewards. I’m sick of the boardroom. I’m sick of the bit in the cafe. I’m sick of Karren Brady. I’m already sick of Claude Littner , and at this stage I’ve literally only seen a photo of him. I’m sick of Alan Sugar, and the way he thinks that being on The Apprentice miraculously excuses him from ever knowing the difference between “your” and “you’re” on Twitter . I’m sick of the lot of it.\nI cannot be the only one. In fact, I’ve convinced myself that everyone involved in the making of The Apprentice is as sick of it as I am. The grinding repetition and utter lack of imagination in each episode suggests that the production company doesn’t really care about it. The increasingly threadbare promotional endeavours by the BBC suggest an underlying embarrassment that it’s even still on the air. If the last few years have been any indication, I’m half-expecting the continuity announcer to declare the start of tomorrow’s episode with a deep sigh of unknowable sadness.\nRelated: Claude Littner – The Apprentice’s new crusher of dreams\nOf course, this year’s Apprentice might buck the trend. This year the candidates might actually get to spend their time on the show honing their ideas in a useful way instead of just pelting around markets trying to sell their awful soup to disinterested commuters for £12 a cup. This year the finale might actually amount to more just than a couple of gussied-up PowerPoint presentations. This year, for once, basic competency might end up being seen as a desirable trait.\nBut I expect that’s too much to ask. My theory is that the BBC hasn’t cancelled The Apprentice yet because it doesn’t know how to replace it. The truth is that it doesn’t need to. It could simply broadcast a static image of a title card reading “PEOPLE ARE AWFUL” for an hour and it’d do the job just as well. Please, let this be the year that The Apprentice fires itself.\nThis article was written by Stuart Heritage, for theguardian.com on Tuesday 13th October 2015 11.09 Europe/London guardian.co.uk © Guardian News and Media Limited 2010", "external_links": ["http://www.theguardian.com/tv-and-radio/shortcuts/2015/oct/11/claude-littner-the-apprentices-new-crusher-of-dreams", "http://www.theguardian.com/tv-and-radio/tvandradioblog/gallery/2015/oct/07/the-apprentice-2015-meet-the-candidates", "https://twitter.com/Lord_Sugar", "http://www.youtube.com/watch?v=XY8aOXVLkNw", "https://www.youtube.com/embed/XY8aOXVLkNw?wmode=opaque&feature=oembed", "http://image.guardian.co.uk/sys-images/Guardian/Pix/pictures/2010/03/01/poweredbyguardian.png", "http://pubads.g.doubleclick.net/gampad/ad?iu=/4658593/04-noNetworks-noAdsense-mpu&sz=300x250&t=vertical%3Dhome&mob=js&c=", "http://www.theguardian.com/commentisfree/2015/oct/11/the-apprentice-business-alan-sugar-facebook", "http://pubads.g.doubleclick.net/gampad/jump?iu=/4658593/04-noNetworks-noAdsense-mpu&sz=300x250&t=vertical%3Dhome&mob=js&c=", "http://gu.com/p/4d8pf"], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-14T11:37:34.671+03:00", "highlightTitle": ""}