{"organizations": [], "uuid": "3847995bd784dcb5b53f61fb1506f5cc797edfa9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.vindy.com", "main_image": "http://media.vindy.com/content/image/a/5/logo/v5logo.gif", "site_section": "http://www.vindy.com/rss/headlines/entertainment", "section_title": "Vindy.com stories: Entertainment", "url": "http://www.vindy.com/news/2015/oct/11/powers-auditorium-director-bringing-back/", "country": "US", "title": "powers auditorium Director bringing back his play with top actors", "performance_score": 0, "site": "vindy.com", "participants_count": 0, "title_full": "powers auditorium Director bringing back his play with top actors", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T07:05:00.000+03:00", "replies_count": 0, "uuid": "3847995bd784dcb5b53f61fb1506f5cc797edfa9"}, "author": "", "url": "http://www.vindy.com/news/2015/oct/11/powers-auditorium-director-bringing-back/", "ord_in_thread": 0, "title": "powers auditorium Director bringing back his play with top actors", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published: Sun, October 11, 2015 @ 12:05 a.m. \nBy GUY D’ASTOLFO \ndastolfo@vindy.com \nYOUNGSTOWN \nMike Forney will again stage his original play “I Was Fine Before I Met You” at Powers Auditorium, but this time with a cast led by professional screen and television actors. \nThe Nov. 21 performance will feature Misty Alli (“Exit Strategies”), Carl Payne (“Martin”), Yolanda Whitaker (“Boyz n the Hood”) and Vincent Ward (“The Walking Dead,” “The Game”). Forney will fill out the remaining roles with local actors. \nForney wrote and is directing “I Was Fine,” which premiered in November 2012, also at Powers. \n“My vision was always to get to this level,” he said. \nForney sent scripts to several nationally known actors and received a strong response. “When they read the script, they loved it,” he said. “They said that my style of writing is like no one else’s.” \nAfter the Powers show, Forney is making plans to perform the play in the spring at theaters in Cleveland, Detroit, Columbus, Washington and Atlanta, with the same cast. \n“I might even be able to add a few other big names,” he said, noting that actors often take on projects like his when they are not filming. \nThe buzz in the community has been growing over the impressive cast, said Forney. “People are saying, ‘Is it really true?’ and I say, ‘Yes it is.’” \nForney noted that filmmaker Tyler Perry took a similar path in building his name, adding that it is a costly game plan. \n“I Was Fine” tells the story of a woman named Michelle [Alli] who is coming home for a birthday party for her elderly mother, who is suffering from dementia. But before she gets there, she gets a scary phone call that changes her life and could destroy her family. \n“It’s kind of a thriller,” said Forney. \nAlli, a Youngstown native who is working as an actor and model in Los Angeles, will play Michelle, the lead role. \n“Michelle is a real-estate agent who sells high-end property,” said Forney. “She is beautiful and witty.” \nAdvance tickets are on sale for “I Was Fine,” and Forney expects it to sell out the 2,300-seat theater. \nTickets are $30 ($45 at the door) at the DeYor Performing Arts box office, 260 W. Federal St.; by phone at 330-744-0264; and online at youngstownsymphony.com. For reserved seating options, call Hot Topix Productions at 330-406-9656. Other stories of interest", "external_links": [], "published": "2015-10-11T07:05:00.000+03:00", "crawled": "2015-10-11T07:19:06.260+03:00", "highlightTitle": ""}