{"organizations": [], "uuid": "62c32ac0838e016aff936033cff1097256a458e3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "manilastandardtoday.com", "main_image": "http://manilastandardtoday.com/panel/_files/modbuild/wp-images/wp-content/uploads/2015/10/dba87_2015_oct03_show7a-300x300.jpg", "site_section": "http://manilastandardtoday.com/feed/entertainment/", "section_title": "The Standard Entertainment", "url": "http://manilastandardtoday.com/2015/10/02/27-beauties-vie-for-miss-world-philippines-crown/", "country": "CA", "title": "27 beauties vie for Miss World Philippines crown", "performance_score": 0, "site": "manilastandardtoday.com", "participants_count": 1, "title_full": "27 beauties vie for Miss World Philippines crown", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T12:40:00.000+03:00", "replies_count": 0, "uuid": "62c32ac0838e016aff936033cff1097256a458e3"}, "author": "Eton B. Concepcion", "url": "http://manilastandardtoday.com/2015/10/02/27-beauties-vie-for-miss-world-philippines-crown/", "ord_in_thread": 0, "title": "27 beauties vie for Miss World Philippines crown", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "27 beauties vie for Miss World Philippines crown 27 beauties vie for Miss World Philippines crown By Eton B. Concepcion | Oct. 02, 2015 at 05:40pm \nWho will succeed Valerie Weighmann? Twenty seven girls will compete for the title Miss World Philippines 2015 at The Theater, Solaire Resort and Casino in Pasay City on Oct. 18. Miss World Philippines has been a highly anticipated beauty search since Megan Young’s Miss World conquest in 2013. 27 girls from across the Philippines will compete for the title Miss World Philippines 2015 \nMiss World Philippines director Cory Quirino expressed excitement on the prospect for this year’s batch after Weigmann’s top 20 finish at Miss World 2014. With cross over contestants from other local pageants, beauty watchers listed the early favorites which include, among others, Hillarie Danielle Parungao, Emma Mary Tiglao, and Jessica Rose McEwen. \nParungao who hails from Nueva Vizcaya, is a freelance print ads model and competed at Miss Asia Pacific World 2014 in Seoul, Korea, finishing third runner up. Tiglao was a top 15 candidate of Bb. Pilipinas 2015 and first runner up in Mutya ng Pilipinas 2012, while McEwen finished in the Top 10 in Mutya ng Pilipinas 2015. Mia Allyson Howell and Marita Cassandra Naidas also competed in Bb. Pilipinas 2015 and 2013, respectively. The rest of the 27 candidates are Ma. Vanessa Wright, Jannie Loudette Alipo-on, Danica Macabangon, Sheila Mae Torino, Christelle Abello, Janelle Tee, Ma. Jackielyn Dulay, Kiara Giel Gregorio, Mona Mahmound Hammad, Teena Pagulayan, Alexie Marie Ibabao, Avonlea Paraiso, Erika Mari de Castro, Erica Rose Bayani, Leitz Camyll Ang, Diana Pinto, Mariah Nilo, Vianca Louise Marcelo, Janette Roanne Sturm, Jeddahliz Maltezo, Casey Anne Austria and Grapes Pacara. \nA sports challenge preliminary activity “Race to Greatness– Guro to Pangulo” will be held at the Quirino Grandstand, free admission with prizes at stake, on Oct.10, marking the 125th birth anniversary of President Elpidio Quirino, while Ilocos Sur will host the swimsuit pictorials of candidates from Oct. 6-8. A gala charity night and best in fashion runway will be held at Manila Hotel New Fiesta Favillion. Ticket sales proceeds will be for the benefit of the PGH Medical Foundation and the Tuloy Street Children Foundation. \nA record of 130 contestants from all over the world will compete in Miss World 2015 to be held at the Crown Beauty Theatre in Sanya, China on Dec. 19,. Miss World Philippines 2015 coronation night will be telecast on GMA 7. \n ", "external_links": [], "published": "2015-10-02T12:40:00.000+03:00", "crawled": "2015-10-02T13:30:06.755+03:00", "highlightTitle": ""}