{"organizations": [], "uuid": "ad2979c2ea83889b8d43610e161e7ec373ca4d43", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wptv.com", "main_image": "http://sharing.wptv.com/sharescnn/photo/2015/10/06/1444159404_24849734_ver1.0_640_480.jpg", "site_section": "http://www.wptv.com/feeds/rssFeed?obfType=RSS_FEED&siteId=10016&categoryId=10008", "section_title": "Entertainment | WPTV", "url": "http://www.wptv.com/newsy/demi-lovato-is-promoting-more-than-music-with-upcoming-album", "country": "US", "title": "Demi Lovato is promoting more than music", "performance_score": 0, "site": "wptv.com", "participants_count": 0, "title_full": "Demi Lovato is promoting more than music", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T22:33:00.000+03:00", "replies_count": 0, "uuid": "ad2979c2ea83889b8d43610e161e7ec373ca4d43"}, "author": "", "url": "http://www.wptv.com/newsy/demi-lovato-is-promoting-more-than-music-with-upcoming-album", "ord_in_thread": 0, "title": "Demi Lovato is promoting more than music", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Demi Lovato", "Cody LaGrow"], "text": "Demi Lovato Is Promoting More Than Music With Upcoming Album Cody LaGrow 3:33 PM, Oct 6, 2015 \nPhoto Credit: Getty Images / Paul Morigi \nDemi Lovato, the woman who kept us \"Cool for the Summer,\" is making us admire her in autumn. (Video via Safehouse Records / Demi Lovato ) \nAnd here's why: Lovato turned heads at this year's MTV Video Music Awards, wearing a cut-out one-piece with fishnets and singing alongside She-Who-Must-Not-Be-Named. Lovato is now shedding light on her new sexy persona. \n\"I'm proud of the skin that I'm in, and I'm wanting to share that with the world and showing everyone how you can go from being very insecure with body-image issues to feeling so proud of your body that you want to show it to the world,\" Lovato explained. \nLovato, who has battled eating disorders, is using her platform for good. The singer recently bared it all for a Vanity Fair shoot, demanding she wear no makeup and no clothes, and prohibiting retouching of the photos. \n\"I basically went from hating every inch of my body to working on myself and trying to figure out ways to love myself and love the skin that I'm in,\" Lovato said. \nNow, Lovato is using her music to promote body-positive messages as well. Her latest single, \"Confident,\" is set for release later this week. She's teasing her video on Instagram, singing the lyrics \"you had me underrated.\" \nBut her work doesn't stop at body image. She's also an advocate for mental health. Lovato has struggled with bipolar disorder, and she went to Capitol Hill to promote mental health care reform — an issue she reminded us should not only be discussed after mass shootings. (Video via Hollywood Records / Demi Lovato ) \n\"People with mental illness are actually more likely to inflict harm on themselves and become the victim rather than become the perpetrators,\" Lovato said on MSNBC. \nLovato's new album launches Oct. 16. It will be her first released under her own record label, appropriately named Safehouse Records. \nThis video includes images from Getty Images.", "external_links": [], "published": "2015-10-06T22:33:00.000+03:00", "crawled": "2015-10-06T23:10:11.973+03:00", "highlightTitle": ""}