{"organizations": [], "uuid": "d8449e2432ebe34d1d96f1887a4f6c141dbed094", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://images.canberratimes.com.au/2015/10/22/6950771/Article%20Lead%20-%20wide1001786435gkfss3image.related.articleLeadwide.729x410.gkfrcz.png1445486026833.jpg.jpg", "site_section": "http://feeds.canberratimes.com.au/rssheadlines/entertainment.xml#", "section_title": "Canberra Times Entertainment Headlines", "url": "http://www.canberratimes.com.au/entertainment/movies/our-reviewer-hated-everything-about-the-original-star-wars-except-chewbacca-20151022-gkfrcz.html", "country": "AU", "title": "Our reviewer hated everything about the original Star Wars (except Chewbacca)", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "Our reviewer hated everything about the original Star Wars (except Chewbacca)", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T06:55:00.000+03:00", "replies_count": 0, "uuid": "d8449e2432ebe34d1d96f1887a4f6c141dbed094"}, "author": "Helen Frizell", "url": "http://www.canberratimes.com.au/entertainment/movies/our-reviewer-hated-everything-about-the-original-star-wars-except-chewbacca-20151022-gkfrcz.html", "ord_in_thread": 0, "title": "Our reviewer hated everything about the original Star Wars (except Chewbacca)", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "\"The creature I liked most in the film was not human...\" Chewbacca (Peter Mayhew) in Star Wars. Photo: Publicity \nFirst published in  The Sydney Morning Herald  on October 27, 1977 \n\nSTAR WARS (NRC, Hoyts Entertainment Centre).\nOh, the astronomical audiences; oh, the mundane story; oh, the over-cute little robots (one fat, one thin); oh, the vapid actors, the galactic shootouts; oh, the brilliant technology and oh, the boredom of it all.\nGeorge Lucas, who directed Star Wars, wrote the film. He is no Asimov, Bradbury or Le Guin, no master of imagination or language.\nThe terrier-like Chewbacca (Peter Mayhew) and Han Solo (Harrison Ford) (right). Photo: Publicity \nIn his space fantasy, the dialogue is as dull as that spoken by those brave men, the astronauts.\nAdvertisement Only when the speech switches from English to a strange tongue concocted from a 40 real languages does the ear attune to mystery.\n\"A long time ago in a galaxy far, far, away\", Princess Leia Organa (Carrie Fisher) steals the plans for Death Star, a space station that can obliterate planets.\nChewbacca, right, in the triumphant conclusion of the film Photo: Publicity \nShe steals not because she is a kleptomaniac but became she is trying to preserve her planet and others from destruction by the Galactic Empire, which is ruled by Grand Moff Tarkin (Peter Cushing) and his villainous ally, Lord Darth Vader (David Prowse).\nThey kidnap the princess, little knowing that she has left the plans with the chubby robot Artoo-Detoo (R2D2). From here, the plot Flash Gordons itself into space. Who'll rescue the princess? Answer: Luke Skywalker (Mark Hamill), a young farmer whose performance is more humanoid than human.\nIt takes an eternity (actually 121 minutes) for Luke to rescue and win his princess. With him, we hurtle from planet to planet, meeting R2D2, his robot mate See Threepio (C3PO) and unctious Ben (Obi-Wan) Kenobi (Alec Guinness), a holy warrior whose catchphrase is: May the Force Be with You.\nThe force of the film was not in its acting, but in the special effects of photography and technology. John Dykstra and John Stears, who provided these effects, were part of a technical crew of extraordinary brilliance.\nThanks to the Planet and Satellite Artist, Ralph McQuarrie and the Chief Model Maker, Grant McCune, the space trips were beautiful and awesome. The Dolby Sound, too, was shatteringly effective.\nBut Star Wars was not science-fiction, not satire. It was black-suited villains versus the goodies in space. It was battle after battle, aerial dogfight after dogfight, even a spoken \"This is it, chaps.\" It was stupid humanity carrying on as violently as usual. The creature I liked most in the film was not human. He was Chewbacca, the Wookie, who was a very competent co-pilot of a fighter craft. His hairy face, said to he apelike, resembled an Australian terrier. (They're nice, bright little dogs.)\nAs for R2D2 and C3PO, the robots activated by actors Kenny Baker and Anthony Daniels, I can say only that they may he 4U but are certainly not 4 me.\nFirst published in  The Sydney Morning Herald  on October 27, 1977 \nTwitter; FairfaxArchives", "external_links": [], "published": "2015-10-22T06:55:00.000+03:00", "crawled": "2015-10-22T08:32:30.747+03:00", "highlightTitle": ""}