{"organizations": [], "uuid": "d3a1f1597ab3dd2faf861dcd408243ab3b82a913", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.northjersey.com", "main_image": "http://www.northjersey.com:80/polopoly_fs/1.1431139!/fileImage/httpImage/101315-f-backtothefuture1car-70p.jpg", "site_section": "http://www.northjersey.com/cmlink/arts-and-entertainment-rss.rss#", "section_title": "Arts and Entertainment on NorthJersey.com", "url": "http://www.northjersey.com/arts-and-entertainment/music/nj-symphony-orchestra-to-play-back-to-the-future-in-concert-1.1431138", "country": "US", "title": "NJ Symphony Orchestra to play Back to the Future in Concert - Music", "performance_score": 0, "site": "northjersey.com", "participants_count": 1, "title_full": "NJ Symphony Orchestra to play Back to the Future in Concert - Music - NorthJersey.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T14:30:00.000+03:00", "replies_count": 0, "uuid": "d3a1f1597ab3dd2faf861dcd408243ab3b82a913"}, "author": "KARA YORIO", "url": "http://www.northjersey.com/arts-and-entertainment/music/nj-symphony-orchestra-to-play-back-to-the-future-in-concert-1.1431138", "ord_in_thread": 0, "title": "NJ Symphony Orchestra to play Back to the Future in Concert - Music", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Buy this photo courtesy photo Christopher Lloyd and Michael J Fox in a scene from the original 'Back to the Future.' MUSIC/FILM \nRelated:  The future is here with Marty McFly Day, but where are the flying cars? \nWHAT: Back to the Future in Concert.\nWHEN: 8 p.m. Thursday and Friday. \nWHERE: Radio City Music Hall, 1260 Sixth Ave., Manhattan, radiocity.com.\nHOW MUCH: $48.88 to $118.88, ticketmaster.com, 800-745-3000.\nFOR MORE INFO: filmconcertslive.com.\nWhile \"Back to the Future\" fans await Marty McFly Day next week, they can continue to celebrate the 30th anniversary of the release of the original film with a special showing at Radio City Music Hall.\nThe New Jersey Symphony Orchestra will play the score of the film while the movie plays during \"Back to the Future in Concert.\"\n\"Definitely the biggest challenge is maintaining one's professionalism and not watching the movie,\" said Sarah Seiver, a cellist in her 30th season with the New Jersey Symphony Orchestra. \"When we do the concerts more than once, we can figure out when it's OK to glance at the screen without losing yourself.\"\nTypically, the orchestra does these events at the New Jersey Performing Arts Center in Newark. The legendary Manhattan location makes the night even better, according to Seiver.\n\"Just to do it at Radio City Music Hall is extraordinary,\" she said. \"To do anything at that venue is special. It's so huge and it's so — I know the word is so overused — but it is so iconic.\"\nThere will be special guests, too. Emmett \"Doc\" Brown himself, Christopher Lloyd, will be there to introduce the film, along with fellow cast mate James Tolkan, who played high school principal Mr. Strickland, composer Alan Silvestri and writer/producer Bob Gale. The orchestra will perform Silvestri's entire original score in sync with the film, plus 20 minutes of brand new music that Silvestri added for this special live production.\nIn past NJSO performances with films including \"Singin' in the Rain\" and \"The Wizard of Oz,\" the audience has loved the combination of live music and a favorite film, according to Seiver.\n\"It's incredibly exciting for an audience to have the awareness that the music is being made as they're watching it and the excitement that it's all working perfectly,\" she said. \nFrequently they want to know how the orchestra can hit every mark exactly on time.\n\"I always point out that they should look at what is going on around the conductor's podium, because it's like an airplane cockpit with all the screens and timers and devices he has to indicate exactly where he's supposed to put everything,\" she said. \"Most of these movies, there's no leeway. Everything has to line up exactly. Our job as musicians is just to do everything the conductor indicates. There is no room for rhythmic expression. We can play our parts expressively, but they have to be exactly within the time indicated by the conductor. It's never more important than in this situation, and it makes it fun and exciting.\"\nEmail: yoriok@northjersey.com", "external_links": [], "published": "2015-10-13T14:30:00.000+03:00", "crawled": "2015-10-13T18:42:13.731+03:00", "highlightTitle": ""}