{"organizations": ["Vermont State Police"], "uuid": "0b95d4a4950e2f93e6c54d8a5e7f3d9211e6712f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wtvm.com", "main_image": "http://images.worldnow.com/AP/images/9020704_G.jpg", "site_section": "http://www.wtvm.com/Global/category.asp?C=171888&clienttype=rss", "section_title": "WTVM - Entertainment - Headline", "url": "http://www.wtvm.com/story/30265120/randy-quaid-to-face-fugitive-charge-in-vermont", "country": "US", "title": "Randy Quaid to face fugitive charge in Vermont", "performance_score": 0, "site": "wtvm.com", "participants_count": 0, "title_full": "Randy Quaid to face fugitive charge in Vermont", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T08:11:00.000+03:00", "replies_count": 0, "uuid": "0b95d4a4950e2f93e6c54d8a5e7f3d9211e6712f"}, "author": "", "url": "http://www.wtvm.com/story/30265120/randy-quaid-to-face-fugitive-charge-in-vermont", "ord_in_thread": 0, "title": "Randy Quaid to face fugitive charge in Vermont", "locations": ["Vt", "St. Albans", "Vermont State Police", "Vermont"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Randy Quaid", "Quaid"], "text": "Contests Randy Quaid to face fugitive charge in Vermont (Vermont State Police via AP, File). FILE - In this Oct. 9, 2015 file photo provided by the Vermont State Police, actor Randy Quaid stands in the Vermont State Police barracks in St. Albans, Vt. In a hearing Monday, Oct. 12, 2015 in St. Albans, Quaid w... \nST. ALBANS, Vt. (AP) - Actor Randy Quaid is expected back in a Vermont court on a charge that he left the country five years ago after being accused of vandalism in California. \nQuaid and his wife Evi were arrested Friday while trying to enter the United States from Canada. They've been held on $500,000 bail each. He is to return to court on Thursday. \nThe Quaids are wanted in Santa Barbara, California, on felony charges filed in 2010 after they were found squatting in a guesthouse of a home they previously owned. Court papers said the Quaids damaged or destroyed furniture, a fireplace and a mirror. They're charged with occupying the property illegally and failing to appear for court dates. \nThe couple fled the U.S. after the charges, saying they were victims of persecution. Quaid had sought to stay in Canada, saying he was being hunted by \"Hollywood star-whackers\" who killed his friends David Carradine and Heath Ledger. Last week, Quaid said in interview with The Associated Press from a detention center in Laval, Quebec, that he wanted to resolve the legal issues and \"move on with my life.\" \nEvi Quaid also is charged with impeding sheriff's deputies. She pleaded not guilty to being a fugitive from justice on Monday. \nRandy Quaid's arraignment on the same charge was continued until Thursday because California's courts were closed for the Columbus Day holiday and the county prosecutor could not get needed paperwork. The Quaids face extradition to California. \nRandy Quaid is likely most known for his roles in in the \"National Lampoon's Vacation\" movies, \"Independence Day\" and \"Kingpin.\" He won a Golden Globe Award and was nominated for an Emmy for his portrayal of President Lyndon Johnson in \"LBJ: The Early Years.\" Copyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-10-15T08:11:00.000+03:00", "crawled": "2015-10-15T08:26:49.113+03:00", "highlightTitle": ""}