{"organizations": [], "uuid": "eb5a35c9ed72efe334233a8ae441140ad2b084fd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.timesunion.com", "main_image": "http://ww1.hdnux.com/photos/41/41/13/8786680/3/rawImage.jpg", "site_section": "http://www.timesunion.com/default/feed/entertainment/feed/Entertainment-News-214.php", "section_title": "Entertainment News", "url": "http://www.timesunion.com/news/article/Review-Truth-is-elusive-slippery-in-6569431.php", "country": "US", "title": "Review: Truth is elusive, slippery in entertaining 'Truth'", "performance_score": 0, "site": "timesunion.com", "participants_count": 1, "title_full": "Review: Truth is elusive, slippery in entertaining 'Truth' - Times Union", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T04:53:00.000+03:00", "replies_count": 0, "uuid": "eb5a35c9ed72efe334233a8ae441140ad2b084fd"}, "author": "timesunion.com", "url": "http://www.timesunion.com/news/article/Review-Truth-is-elusive-slippery-in-6569431.php", "ord_in_thread": 0, "title": "Review: Truth is elusive, slippery in entertaining 'Truth'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photo: Lisa Tomasetti, AP Image 1 of / 6 Caption\nClose\nImage 1 of 6 In this image released by Sony Pictures Classics, Robert Redford portrays Dan Rather, from left, Cate Blanchett portrays Mary Mapes and Bruce Greenwood portrays Andrew Heyward in a scene from, \"Truth.\" (Lisa Tomasetti /Sony Pictures Classics via AP)\nPhoto: Lisa Tomasetti, AP In this image released by Sony Pictures Classics, Robert Redford... Image 2 of 6 In this image released by Sony Pictures Classics, Cate Blanchett portrays Mary Mapes, left, and Robert Redford portrays Dan Rather in a scene from, \"Truth.\" (Lisa Tomasetti /Sony Pictures Classics via AP)\nPhoto: Lisa Tomasetti, AP In this image released by Sony Pictures Classics, Cate Blanchett... Image 3 of 6 In this image released by Sony Pictures Classics, Cate Blanchett portrays Mary Mapes in a scene from, \"Truth.\" (Lisa Tomasetti /Sony Pictures Classics via AP)\nPhoto: Lisa Tomasetti, AP In this image released by Sony Pictures Classics, Cate Blanchett... Image 4 of 6 In this image released by Sony Pictures Classics, Robert Redford portrays Dan Rather in a scene from, \"Truth.\" (Lisa Tomasetti /Sony Pictures Classics via AP)\nPhoto: Lisa Tomasetti, AP In this image released by Sony Pictures Classics, Robert Redford... Image 5 of 6 In this image released by Sony Pictures Classics, Cate Blanchett portrays Mary Mapes, left, and Andrew McFarlane portrays Dick Hibey in a scene from, \"Truth.\" (Lisa Tomasetti /Sony Pictures Classics via AP)\nPhoto: Lisa Tomasetti, AP In this image released by Sony Pictures Classics, Cate Blanchett... Image 6 of 6 In this image released by Sony Pictures Classics, Elisabeth Moss, from left, Cate Blanchett, Topher Grace and Dennis Quaid appear in a scene from, \"Truth.\" (Lisa Tomasetti /Sony Pictures Classics via AP)\nPhoto: Lisa Tomasetti, AP In this image released by Sony Pictures Classics, Elisabeth Moss,... Review: Truth is elusive, slippery in entertaining 'Truth' 1 / 6 Back to Gallery There's a scene in \"Truth,\" James Vanderbilt 's crisp, absorbing new film about the doomed 2004 CBS story on then-president George W. Bush and his National Guard service, where execs are doing something utterly mundane. They're looking at a calendar, scheduling a broadcast.\nBetween sports and fluffy specials, there aren't many dates available for the potentially explosive \"60 Minutes II\" story. Unless, someone asks, it could be ready to air in just a few days? Producer Mary Mapes ( Cate Blanchett , at her jittery, high-octane best), agrees, knowing how tough that'll be, but up to the challenge. And we all shudder, because we know what happened. Maybe, if there had been more time for reporting, things would have been different?\nLater, there's a moment when a decision must be made within seconds, literally, about where to make a crucial cut. Again, we watch it happen, and we suck in our breath.\nMovies about the craft of journalism — how the sausage gets made — aren't always nail-biters. Credit goes to Vanderbilt (who also penned the script) and his cast —Blanchett, Robert Redford , and Stacy Keach especially — for making a cracklingly entertaining newsroom film about an endlessly thorny story, to say the least.\nNot that everyone will find \"Truth\" perfect, or close. The film is based on one point of view: that of Mapes, who lost her job in the fallout and on whose own book the script is based. CBS does not fare well here. But Vanderbilt seems less interested in finding an ultimate answer — Mapes still maintains the story was accurate — than in the process of how these waters got so muddied. With the exception of Dan Rather , who anchored the fateful story, apologized for it and stepped down soon after, his characters are nearly all flawed. And with the exception of one eleventh-hour speech highly critical of Viacom, CBS's parent company, the film largely avoids temptation to be too preachy.\nWe meet Mapes at the pinnacle of her career, acclaimed for reports like one on the abuse at Abu Ghraib. One day, a tip lands in her inbox. She assembles a crack research team to probe just how Bush got into the Texas National Guard in the first place — which kept him from Vietnam duty — and then whether he fulfilled the terms of his service.\nMapes' report hinges in part on documents that would have come from an early 1970's typewriter. The morning after the report, pride and congratulations are in the air. It doesn't last. CBS is hit with claims that the memos were faked. Questions are raised about fonts and superscript. Mapes and her crew race to defend their reporting.\nAs everything spirals out of control, Mapes tries to point out that \"the documents were a small part. They weren't the whole story.\" But nobody wants to hear that.\nTwo terrific speeches stand out. One is delivered for all it's worth by Blanchett, who tells an investigating panel just how difficult and unlikely it would have been for someone to fake the documents. Another is heartbreaking. It comes just after a key source —Bill Burkett, played with great crustiness by Keach— has been put through the wringer on camera by a CBS team desperate to deflect blame. Burkett's wife ( Noni Hazelhurst ) laces into the journalists for throwing her husband to the lions. It's a searing moment.\nThe acting is uniformly excellent. Most interesting is Redford. Without attempting to imitate, he captures Rather's drawl and good-natured derring-do. It's a hugely appealing performance, but whether the role itself is accurately drawn might be another question.\nIn the end, the film is a fascinating look at investigative broadcast journalism and how it intersected with election-year politics in one relentlessly slippery case. \"Questions help reporters get to the truth,\" Mapes tells her young son. At least in this case, the film seems to be saying, the very definition of \"truth\" is elusive.\n\"Truth,\" a Sony Pictures Classics release, is rated R by the Motion Picture Association of America \"for language and a brief nude photo.\" Running time: 121 minutes. Three stars out of four.\n___\nMPAA definition of R: Restricted. Under 17 requires accompanying parent or adult guardian.\n___\nFollow AP National Writer Jocelyn Noveck on Twitter at http://www.Twitter.com/JocelynNoveckAP", "external_links": ["http://ww3.hdnux.com/photos/41/41/13/8786682/3/920x920.jpg", "http://ww3.hdnux.com/photos/41/41/13/8786682/3/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/41/41/13/8786680/3/920x920.jpg", "http://www.Twitter.com/JocelynNoveckAP", "http://ap.org/schemas/03/2005/apcm", "http://ww4.hdnux.com/photos/41/41/13/8786683/3/920x920.jpg", "http://ww3.hdnux.com/photos/41/41/13/8786678/3/920x920.jpg", "http://ww1.hdnux.com/photos/41/41/13/8786680/3/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/41/41/13/8786684/3/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/41/41/13/8786684/3/920x920.jpg", "http://ww4.hdnux.com/photos/41/41/13/8786683/3/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/41/41/13/8786679/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/41/41/13/8786678/3/square_gallery_thumb.jpg", "http://ap.org/schemas/03/2005/apnm", "http://ww4.hdnux.com/photos/41/41/13/8786679/3/920x920.jpg"], "published": "2015-10-14T04:53:00.000+03:00", "crawled": "2015-10-14T04:09:01.138+03:00", "highlightTitle": ""}