{"organizations": [], "uuid": "0c524df0d3ca7187b274326673bbf98f18aeea80", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266347/arts-entertainment-general", "section_title": "Arts &amp; Entertainment: General - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30226235/events-dc-announces-the-selection-of-oma-globally-recognized-architecture-firm-to-lead-rfk-stadium-armory-campus-conceptual-design-plans", "country": "US", "title": "Events DC Announces the Selection of OMA, Globally-Recognized Architecture Firm to Lead RFK Stadium-Armory Campus Conceptual Design Plans", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Events DC Announces the Selection of OMA, Globally-Recognized Architecture Firm to Lead RFK Stadium-Armory Campus Conceptual Design Plans - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T21:02:00.000+03:00", "replies_count": 0, "uuid": "0c524df0d3ca7187b274326673bbf98f18aeea80"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30226235/events-dc-announces-the-selection-of-oma-globally-recognized-architecture-firm-to-lead-rfk-stadium-armory-campus-conceptual-design-plans", "ord_in_thread": 0, "title": "Events DC Announces the Selection of OMA, Globally-Recognized Architecture Firm to Lead RFK Stadium-Armory Campus Conceptual Design Plans", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "OMA Will Work in Partnership with Brailsford and Dunlavey to Reinvent Future Usage for the District’s Iconic Campus\nWASHINGTON, DC (PRWEB) October 09, 2015\nEvents DC, the official convention and sports authority for the District of Columbia announced today that OMA, a globally-recognized architecture firm has been selected to develop both short and long-term redevelopment concepts for the future usage of the RFK Stadium-Armory Campus. In collaboration with Brailsford and Dunlavey (B&D) and the existing subcontractors who are part of the team conducting the RFK Campus site and market analysis study, OMA will develop a holistic conceptual plan for the iconic Campus located in the Southeast corridor of the District.\n“On behalf of Events DC, we are tremendously excited about bringing OMA on board to help us reimagine the RFK Stadium-Armory Campus. OMA will help us develop both short and long-term redevelopment concepts for this important site in our nation’s capital,” said Max Brown, chairman of Events DC Board of Directors. “They will bring world-class credentials and ideas to this effort and we are looking forward to working with all our stakeholders on this important effort.”\nOMA’s conceptual designs will address connectivity across the 190 acre site – while creating a sense of place for the Campus that resonates with the surrounding community and across the District. It is our shared goal that OMA will deliver conceptual plans for the entire Campus that create axis points and public areas of converge from which residents and visitors can benefit. The conceptual concepts will be available and made public in mid-January 2016.\nThis project continues OMA urban engagement with Washington, DC, which includes the 11th Street Bridge Park, a public park elevated over the Anacostia River.\n“It’s an honor to work with Events DC on a sports and recreation hub for the residents of our nation’s capital, on a site that will play an important part in reconnecting the city to the Anacostia waterfront,” said Jason Long, partner-in-charge of both projects.\nThis project marks the second development plan project for OMA in Washington, DC following their award of the 11th Street Bridge Park in 2014. Notable OMA projects currently under construction include the Qatar National Library, Musée National des Beaux-Arts du Québec and Faena Arts Center in Miami.\nFor greater information on the RFK Stadium-Armory Campus study, click here .\nAbout Events DC\nEvents DC, the official convention and sports authority for the District of Columbia, delivers premier event services and flexible venues across the nation's capital. Leveraging the power of a world-class destination and creating amazing attendee experiences, Events DC generates economic and community benefits through the attraction and promotion of business, athletic, entertainment and cultural activities. Events DC oversees the Walter E. Washington Convention Center, an anchor of the District's hospitality and tourism economy that generates over $400 million annually in total economic impact, and the historic Carnegie Library at Mt. Vernon Square. Events DC manages the Stadium-Armory campus, which includes Robert F. Kennedy Memorial Stadium and surrounding Festival Grounds, the non-military functions of the DC Armory and Maloof Skate Park at RFK Stadium. Events DC also built and now serves as landlord for Nationals Park, the first LEED-certified major professional sports stadium in the United States. For more information, please visit http://www.eventsdc.com .\nAbout OMA\nOMA is a leading international partnership practicing architecture, urbanism, and cultural analysis. OMA's buildings and masterplans around the world insist on intelligent forms while inventing new possibilities for content and everyday use. OMA is led by ten partners - Rem Koolhaas, Ellen van Loon, Reinier de Graaf, Shohei Shigematsu, Iyad Alsaka, David Gianotten, Chris van Duijn, Ippolito Pestellini Laparelli, Jason Long and Michael Kokora - and maintains offices in Rotterdam, New York, Beijing, Hong Kong, Doha and Dubai.\n# # #\n //www.prweb.com/releases/2015/10/prweb13014138.htm\n ", "external_links": ["http://www.eventsdc.com/AboutUs/Community.aspx", "http://www.prweb.com/releases/2015/10/prweb13014138.htm"], "published": "2015-10-09T21:02:00.000+03:00", "crawled": "2015-10-09T21:02:43.582+03:00", "highlightTitle": ""}