{"organizations": [], "uuid": "9534bd7336a79934d96e78e774b81276db830c46", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "entertainment.inquirer.net", "main_image": "http://entertainment.inquirer.net/files/2015/10/t1015HOLLYWOOD4-edt-600x323.jpg", "site_section": "http://entertainment.inquirer.net/feed\r", "section_title": "Inquirer Entertainment^", "url": "http://entertainment.inquirer.net/181029/not-death-defying-but-life-affirming", "country": "US", "title": "Not death-defying, but life-affirming", "performance_score": 0, "site": "inquirer.net", "participants_count": 1, "title_full": "Not death-defying, but life-affirming", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T19:40:00.000+03:00", "replies_count": 0, "uuid": "9534bd7336a79934d96e78e774b81276db830c46"}, "author": "clopez", "url": "http://entertainment.inquirer.net/181029/not-death-defying-but-life-affirming", "ord_in_thread": 0, "title": "Not death-defying, but life-affirming", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By: Ruben V. Nepales , October 15th, 2015 12:40 AM A COP reaches out to Philippe Petit, played by Joseph Gordon-Levitt, as he makes “The Walk.” \n(First of two parts) \nLOS ANGELES—For someone who walked on the clouds, more than 1,300 feet up in the air, in the immense void between the two towers of the World Trade Center, Philippe Petit in person doesn’t disappoint. Being a showman—a “silent personality” (he doesn’t like to be called a mime)—Philippe (portrayed by Joseph Gordon-Levitt in “The Walk”) is larger than life, funny and ready with props. \nThe aerialist brought the shoes and bow and arrow used in his 1974 coup and the black hat he wears as a street juggler. He juggles on the streets to this day. ADVERTISEMENT \nManic energy \nSpeaking enthusiastically with a French accent, exuding joie de vivre that Joseph captures in director Robert Zemeckis’ film, Philippe preferred to stand throughout our interview in a SoHo hotel. Brimming with manic energy, Philippe joked, regaled us with stories and even stood on a table at one point. \nAs a kid growing up in France, Philippe was infatuated with magic and juggling. Self-taught, he walked on the wire for the first time at the age of 16. His high wire act, which he does with a ballet dancer’s elegance and poise, took him around Europe, Australia and the United States. \nHe wrote about his most spectacular stunt, on the twin towers, in a book, “To Reach the Clouds,” which inspired the 2009 Oscar-winning documentary, “Man on Wire,” and now, the must-see IMAX 3D film, “The Walk.” His other major high wire performances include derrings-do on the Notre Dame Cathedral in Paris, Sydney Harbor Bridge and the Louisiana Superdome. \nFor the man who risked his life in that dangerous stunt in the 1970s and continues to do so as a high wire artist, he declared that the word “death” is not in his vocabulary. “You have this term in America—death-defying daredevil. I don’t defy death; I defy life,” he said. “When I grab the pole, before I walk and you see that in the movie, I know already whether or not I will be able to do that first step. \nForest of exclamation points \n“I know in my heart and body that I will successfully do the last step and, therefore, there are no question marks. Maybe there is a forest of exclamation points but I don’t ask myself: Oh my God, I hope the cable will support me. I go there because I am solid. It is this solidity of the most fragile action a human being can do on a little wire that inspires people. \n“So it’s really life-affirming. I don’t risk my life. I do something maybe mysterious but very noble and carry my life across. I think yoga is inspired by what I do.” \nThe word “impossible” doesn’t faze him, either. “I am a fighter,” he stressed. “I am a tenacious little rat who doesn’t take impossible for granted.” \nHe doesn’t plan to slow down. “I’m 66 years old. People are amazed that I’m still alive, standing on chairs and tables,” he said. And with those words, he was suddenly on top of the table, smiling and looming larger than life. \n“I forget that I’m getting old,” he remarked. “I’m doing three hours a day of practice [on a wire] except one day of the week.” \nPrized objects PHILIPPE Petit presents the bow and arrow he used at the World Trade Center. Ruben V. Nepales \nWhen we asked Philippe to recall his unauthorized, though celebrated, walk between the twin towers, that was all the prompt he needed to trot out the prized objects he brought, like a magician pulling out his cards. \n“So I arrived in New York. I was a street juggler for eight months,” he recalled. “This is my top hat. Not the beautiful new top hat as shown in the film but my old battered top hat. I would draw a circle on the street of Manhattan, ride my unicycle. I’m not a mime as the movie maybe sometimes shows. I am a silent performer. I don’t like mimes very much. \n“Let’s go back to Aug. 7, 1974. The movie says the 6th but it’s actually the 7th when the coup took place. I had a bow and arrow which was very cheap. My friend Jean-Louis was on the North Tower. I signaled him, you can throw the bow. We had an arrow. Look at the point—it’s very soft in case it landed on me. \n“Now, I have a story which didn’t happen but I thought it would be incredible. Let’s imagine on the 7th of August in the morning—the cops come in their routine tour of the roof and they see a Frenchman with an arrow in his heart. That would have been a great mystery, right? \n“But anyway, that didn’t happen so this is the historic arrow, which I keep very close to my heart, that flew away to the other side. \n“Now comes the moment of ‘The Walk.’ Here’s something that I will never sell on eBay. I will show them to you like Charlie Chaplin (held his shoes). These are the historic shoes.” \nAs the film shows, Philippe and his band of international recruits carefully planned for that big day in Manhattan, studying the wind patterns and other factors. \nMurmur of the city \n“I value my life so much,” he emphasized. “I did not risk my life. I thought of all these things. Many times, I climbed up, disguising myself as an architect or a construction worker. I climbed to the roof unchallenged. \n“I looked down to get myself used to the height. I listened with all my senses to the murmur of the city, the sirens and the noise. I looked at the lights and really got to know the buildings and much more. I called it my spy work. Eight months in New York to get to know the towers like my family. \n“So if you were following me in all that, you would realize that there was actually no fear in the end. There was no anxiety. The word anxiety is not something that I cultivate very much. If you see me before a meeting or an action, if you see me gathering my thoughts, you cannot approach me and say, ‘Are you nervous? Are you fearful?’ \n“Because if you know me, you would know that I am preparing myself. That is concentration, to try again as a perfectionist to do the best job as possible.” \n(To be concluded) \n(E-mail the columnist at rvnepales_5585@yahoo.com. Follow him at http://twitter.com/nepalesruben.) FOLLOW INQUIRER ON:", "external_links": [], "published": "2015-10-14T19:40:00.000+03:00", "crawled": "2015-10-15T07:39:36.418+03:00", "highlightTitle": ""}