{"organizations": [], "uuid": "f4593d328c8cad2b3b9b06cfc6601cfb7731fa56", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailyherald.com", "main_image": "http://www.dailyherald.com/gfx/site/logos/dailyherald_marble_300.jpg", "site_section": "http://www.dailyherald.com/rss/feed/?feed=entlife", "section_title": "DailyHerald.com &gt; Life &amp; Entertainment", "url": "http://www.dailyherald.com/article/20151024/entlife/151029876/", "country": "US", "title": "Owners can request an annual board election", "performance_score": 0, "site": "dailyherald.com", "participants_count": 1, "title_full": "Owners can request an annual board election", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T09:00:00.000+03:00", "replies_count": 0, "uuid": "f4593d328c8cad2b3b9b06cfc6601cfb7731fa56"}, "author": "David M. Bendoff", "url": "http://www.dailyherald.com/article/20151024/entlife/151029876/", "ord_in_thread": 0, "title": "Owners can request an annual board election", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Q. I've lived in my Illinois condominium for many years and the same people have run the building without any annual elections. Recently, the idea of holding elections came up, and the spouse of one of the board members had an outburst, saying no one would better manage the building than the current people. How can a resident ask for elections when the people on the board refuse?\nA. Owners with 20 percent of the vote could sign and deliver a petition to the secretary of the board calling a meeting of the owners for the purpose of conducting an annual election. This would obligate the board to issue the notice of the meeting, and to conduct the annual meeting. If the board fails or refuses, there is a procedure available whereby an owner can file a suit in the circuit court to require the board to hold the annual meeting. At the end of the day, however, you are going to have to find other owners who are like minded as you and who are willing and able to run for and serve on the board.\nQ. There are many discrepancies in the management of the association by the board. Through what legal government entity can a resident request a legal audit of a condominium in Illinois?\nA. Your remedy is to seek removal of the board members, elect better board members at the next annual meeting, or to file a suit in circuit court to enjoin the board from engaging in conduct that is in violation of the law and/or the association's governing documents. However, there really isn't any sort of government agency dedicated to overseeing the operation of associations in Illinois.\nQ. A board member of our association frequently requests that board members meet alone without the homeowners to discuss issues that will be addressed at the upcoming board meeting, so that he feels prepared for the official meeting. Are these private board meetings legal?\nA. These closed door planning meetings of the board are generally referred to as \"workshops,\" and are no longer permitted. In the appellate court decision in Palm v. 2800 Lake Shore Drive Condominium, the Illinois appellate court held that a gathering of a quorum of the board for the purpose of conducting board business constitutes a board meeting. Notice of board meetings must be provided to owners, and owners permitted to attend the open portion of the meeting, even if no vote is taken. Therefore, the board of your association needs to either stop using these \"private\" meetings or issue appropriate notice and permit owners to attend those meeting, or those portions of meetings, that are required to be open by law.\nQ. Can you define the purpose for an \"executive session\" of the board?\nA. In general, meetings of a quorum of the board must be open to any unit owner. Owners have to be permitted to attend board meetings. There are nonetheless three exceptions that permit portions of a board meeting to be held outside of the presence of unit owners. This portion of a board meeting is commonly referred to as an \"executive session,\" or \"closed session.\"\nPortions of a board meeting can be conducted in executive session:\n• Discussion of litigation when an action against or on behalf of the association has been filed and is pending in a court or administrative tribunal, or when the board finds that such an action is probable or imminent.\n• Consideration regarding the appointment, employment or dismissal of an employee.\n• Discussion of violations of rules and regulations of the association or a unit owner's unpaid share of common expenses.\nHowever, (and this is often overlooked) any actual vote on matters discussed in executive session must be taken at a meeting or portion of a meeting open to any unit owner.\n• David M. Bendoff is an attorney with Kovitz Shifrin Nesbit in the Chicago suburbs. Send questions for the column to him at CondoTalk@ksnlaw.com. The firm provides legal service to condominium, townhouse, homeowner associations and housing cooperatives. This column is not a substitute for consultation with legal counsel.\n Life & Entertainment Real Estate Home & Garden Bendoff, David", "external_links": ["https://twitter.com/share"], "published": "2015-10-24T09:00:00.000+03:00", "crawled": "2015-10-24T12:09:56.726+03:00", "highlightTitle": ""}