{"organizations": [], "uuid": "5846157d9d172f6e693d4ad4972de868bd79be1b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pr.com", "main_image": "", "site_section": "http://www.pr.com/news-by-category/2", "section_title": "Arts &amp; Entertainment Press Releases and News - PR.com", "url": "http://www.pr.com/press-release/642164", "country": "US", "title": "Meals On Wheels of Tampa and Feeding Tampa Bay to Deliver Free Produce to 700 Homebound on Saturday", "performance_score": 0, "site": "pr.com", "participants_count": 1, "title_full": "Meals On Wheels of Tampa and Feeding Tampa Bay to Deliver Free Produce to 700 Homebound on Saturday - PR.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T03:00:00.000+03:00", "replies_count": 0, "uuid": "5846157d9d172f6e693d4ad4972de868bd79be1b"}, "author": "PR.com", "url": "http://www.pr.com/press-release/642164", "ord_in_thread": 0, "title": "Meals On Wheels of Tampa and Feeding Tampa Bay to Deliver Free Produce to 700 Homebound on Saturday", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Meals On Wheels of Tampa and Feeding Tampa Bay to Deliver Free Produce to 700 Homebound on Saturday\nTampa, FL, October 17, 2015 --( PR.com )-- Meals On Wheels of Tampa launches a new program, Produce On Wheels (POW), in partnership with Feeding Tampa Bay, to increase senior and homebound access to fresh produce. Over 100 individuals, businesses and community groups will volunteer their time, vehicle, and gas to deliver pre-packed bags of fresh produce to 700 home delivered meal recipients (HDM) on the morning of Saturday, October 17th. Produce bags are free of charge to HDM recipients.\nGroups that will help deliver produce on Saturday morning include the USF College of Public Health, Suncoast Credit Union, MacDill Air Force Base, and the Girl Scouts. As a result of this program, further partnerships have developed with the following groups: Feeding Tampa Bay, University of South Florida, Tampa Bay Network to End Hunger, University of Florida Extension Office, Next Stop Produce, and others.\nThis is very exciting for Meals On Wheels of Tampa whose mission is to nourish, enrich, and strengthen the independent lives of the homebound and seniors in Tampa. POW was developed in response to results collected from a survey that was sent out to all 700 HDM recipients in August.\n“Bringing us fresh fruits and vegetables is a blessing. The closest grocery store is over 3 miles away from my house and I can't drive...even if I got a ride, I can't stand long enough to shop... so fresh is hard for me to get. I know I have lived this long because of good health and good nutrition- I am certain that fresh fruits and veggies are the best medicine and have helped kept me alive this long,\" said Barbara, HDM recipient.\nIn addition to increasing access to produce, this opportunity will increase volunteer opportunities for those who may not be available to deliver meals during the week.\nRecipients will also receive an educational handout that highlights the nutritional advantages of the items in the bag, tips to reduce waste, recipe ideas, and produce safety. Feedback will also be collected from recipients and volunteers to evaluate the program launch so they can continue to improve the program. Professor Lauri Wright from the University of South Florida’s College of Public Health will assist Meals On Wheels of Tampa staff in evaluating the effectiveness of this program on Tampa’s seniors and homebound. Pre-test surveys are currently underway; post-test surveys will begin in March.\nFuture POW/Saturday delivery dates are: November 26th (Thanksgiving treat), December 19th (Holiday gift bag), January 16th (Produce), and February 20th (Produce). An expansion of this program is slated for 2016.\nInterested in volunteering or want to learn more about Meals On Wheels of Tampa? Please visit www.MOWTampa.org/volunteer or call (813) 238-8410.\nIf you would like to start receiving meals or know someone in need, please visit www.MOWTampa.org or call (813) 238-8410 today.\nAbout Meals On Wheels of Tampa:\nMeals On Wheels of Tampa has been committed to nourishing and enriching the independent lives of the homebound and seniors of Tampa since 1975. Today, Meals On Wheels of Tampa serves over 700 people with a hot meal during the lunch hour. Meals On Wheels of Tampa is a 4-star charity and relies on its community for support by not accepting government funding.", "external_links": [], "published": "2015-10-17T03:00:00.000+03:00", "crawled": "2015-10-24T13:41:42.387+03:00", "highlightTitle": ""}