{"organizations": [], "uuid": "e9c2aa4e3fb6fbff1694f0a8c3a71b944cd9e9c6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://www.canberratimes.com.au/content/dam/images/g/k/c/d/d/2/image.related.articleLeadwide.620x349.gkcdek.png/1445384414635.jpg", "site_section": "http://feeds.canberratimes.com.au/rssheadlines/entertainment.xml#", "section_title": "Canberra Times Entertainment Headlines", "url": "http://www.canberratimes.com.au/act-news/canberra-life/art-overland-by-ros-auld-and-tim-winters-at-queabeyans-form-studio-and-gallery-20151019-gkcdek", "country": "AU", "title": "Art: Overland by Ros Auld and Tim Winters at Queanbeyan's Form Studio and Gallery", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "Art: Overland by Ros Auld and Tim Winters at Queanbeyan's Form Studio and Gallery", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T02:40:00.000+03:00", "replies_count": 0, "uuid": "e9c2aa4e3fb6fbff1694f0a8c3a71b944cd9e9c6"}, "author": "Peter Haynes", "url": "http://www.canberratimes.com.au/act-news/canberra-life/art-overland-by-ros-auld-and-tim-winters-at-queabeyans-form-studio-and-gallery-20151019-gkcdek", "ord_in_thread": 0, "title": "Art: Overland by Ros Auld and Tim Winters at Queanbeyan's Form Studio and Gallery", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ros Auld's \"Landform 2\" in \"Overland\" at Form Studio and Gallery. Photo: Ron Cerabona \nOverland . By Ros Auld and Tim Winters. Form Studio and Gallery. 1/30 Aurora Avenue, Queanbeyan. Weekdays 9.30am to 2.30pm, Weekends 10am to 4pm. Until November 1.\nThis exhibition showcases the  work of two artists from the Central West of New South Wales. Ros Auld is a potter and Tim Winters a painter and printmaker. Each artist shows a number of her/his own works and a group of collaborative pieces is also on display. It is an ambitious exhibition and for me would have benefited from a judicious editing to allow the excellence of much of the work to be seen to better advantage. The exhibition space is crowded both on the walls and for the floor-based ceramic pieces. That said, Ros Auld demonstrates through arguably each of her more than 20 pieces, that she is a considerable figure in Australian ceramics and her contribution here marks this body of works as one of the best three-dimensional displays that I have seen this year.\nAuld's work is characterised by highly refined sculptural and pictorial sensibilities. She has elected to use (mostly) the vessel form as the vehicle for her expressive language and her understanding of both that form's intrinsic place in the history of ceramics as well as its interpretative possibilities are clearly evoked in Overland . \nRos Auld's \"Landscape\" in \"Overland\" at Form Studio and Gallery. Photo: Ron Cerabona \nThe vessels are raised on four tiny feet, thus activating the space around and within each form. As the exhibition's title suggests, the works are thematically concerned with journeys through a range of landscapes. Auld's overall palette is mostly a subdued one (soft greys, ochres, greens) but each piece is personalised by flashes and bands of colour that are at once integral and integrated within the aesthetic character of individual works. These idiosyncratic marks and gestures may well have topographical significance for the artist but they serve a more generalised purpose in imbuing memories of place rather than actualities and in that role embrace the experiences of place(s) that each viewer has undergone. \nAdvertisement Auld uses textural contrasts and combinations not only to populate the walls of her vessels but also to draw the viewer in for close examination of each of the pieces. This device means the viewer is vicariously undertaking his/her own journey as filtered through the artist's considerable formal and aesthetic skills. The latter is also beautifully exemplified in the finely controlled tensions between positive and negative spaces that, allied to the intersecting and overlapping textural areas, imbue powerful plastic presence.\nNot all Auld's work embraces the vessel form. In Landform 1, 2 and 3  she uses slabs of clay in an almost pictorially gestural way to evoke the grandeur of the natural world. Landform 1  is a particularly impressive sculptural statement. The three Landform  works allude to the latent compressed energies below the surface of the earth and Auld captures this through her understanding of the power of the ostensibly simple statement. The dictum of \"less is more\" is powerfully illustrated in these works.  Throughout this exhibition Auld demonstrates her control over scale and her ability to elide the intimate with the monumental. It is difficult not to use superlatives in relation to most of this important and beautiful work.\nTim Winters, \"Grass fire, Channel Country\" in \"Overland\" at Form Studio and Gallery. Photo: Ron Cerabona \nTim Winters has been exhibiting since 1982 and was the subject of a recent major survey exhibition at the Orange Regional Gallery (2015). For me the issue of too many works marred my experience of much of his contribution to Overland . However there are a number of works that stand out, most notably Channel Country . The notion of journey is clearly present. The canvas is a rich, red ochre populated with a network of freeform \"lines\" that moves inexorably across the surface in simultaneous left to right and right to left directional gestural impulses. The slow rhythmic impulses across the picture plane of the black \"lines\", variously heightened by the inclusion of flashes of luminous colour (turquoise, purple), instils a feeling of the cycles of the natural world.  \n While the \"lines\" sit above the ochre surface they can also be read as part of that surface; their movement perhaps promulgated by that partnership. Winters adopts a deftly clever spatial configuration and this, combined with deliberately ambiguous viewpoints, imbues Channel Country  with a marvellously controlled aesthetic tension. He is obviously aware of the different ways humans \"place\" themselves when they are \"in\" nature. We are at once a part of, apart from and within the places we find ourselves. In Channel Country  we may be presented with an aerial viewpoint but we could also just as well be looking up or across the same topographies. Winters is about evocation not delineation and creates a space for personal contemplation as much as he does for pictorial exploration. \nGrass fire, Channel Country  adopts the same square format (150 x 150cm) as the previous work. He divides the painting into two distinct rectangles separated by a narrow strip of pinks and purples. The top rectangle is a powerful rendition of a raging bushfire. Its visually simple composition belies its expressive strength and it stands in stark contrast to the more activated area that sits under the central dividing line. Winters again exploits the use of the ambiguous viewpoint to great effect, capturing in his deliberately discordant combinations the drama of the natural world. That drama is further underscored by the artist's dense and rich palette of (mostly) reds.         \nTim Winters, \"Channel Country I\" in \"Overland\" at Form Studio and Gallery. Photo: supplied \nThe Channel Country has informed a number of works in Overland . Channel Country, Red Oxide I and II  are visually very effective. Winters uses simple and direct tonal contrasts appended with his signature free-flowing lines and other pictorial devices to capture the vast spread of the interior. Here, and in a number of other works ( Water tracks, Channel Country I and II  for example), the rectangular format (31 x 62cm), while traditionally \"landscape\" does indeed assist in the conveyance of Australia's outback topographies. \nWinters has included a portfolio of prints in the exhibition that includes collagraphs​ and etched lino works. These are delightful and worth taking the time to look through. \nAuld and Winters have been producing collaborative works since 2002. In Overland  they are showing a number of works in paperclay​ with the surfaces decorated with glazes. There is a spontaneity to these perhaps related to their essentially freeform rectangular shapes. The elision of two obviously mature aesthetic approaches results in some marvellously evocative works that for me are like shards of archaeological topographies; concrete memories of places visited and remembered.", "external_links": [], "published": "2015-10-21T02:40:00.000+03:00", "crawled": "2015-10-21T17:28:09.781+03:00", "highlightTitle": ""}