{"organizations": [], "uuid": "25ae4b6d9407459f56231380a59e98d974d46fd9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.heraldscotland.com", "main_image": "http://www.heraldscotland.com/resources/images/4287075/", "site_section": "http://www.heraldscotland.com/arts_ents/", "section_title": "Arts and Entertainment | Herald Scotland", "url": "http://www.heraldscotland.com/arts_ents/13799993.How_the_slave_trade_shaped_Glasgow/", "country": "GB", "title": "How the slave trade shaped Glasgow", "performance_score": 0, "site": "heraldscotland.com", "participants_count": 1, "title_full": "How the slave trade shaped Glasgow (From Herald Scotland)", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T19:21:00.000+03:00", "replies_count": 0, "uuid": "25ae4b6d9407459f56231380a59e98d974d46fd9"}, "author": "heraldscotland.com", "url": "http://www.heraldscotland.com/arts_ents/13799993.How_the_slave_trade_shaped_Glasgow/", "ord_in_thread": 0, "title": "How the slave trade shaped Glasgow", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The issue of Britain's role in the slave trade has returned to the headlines, with calls for the UK to pay reparations to Jamaica. In tomorrow's Herald Magazine, Scotland's foremost historian Sir Tom Devine reveals the true extent of Scotland's involvement. Here, we look at how Glasgow - and Scotland - was shaped by the trade - and the men who benefited from other people's misery.\nIn his 2009 book, It Wisnae Us: The Truth About Glasgow and Slavery, Stephen Mullen said that Glasgow and her merchants monopolised the two main goods produced by slaves - tobacco and sugar. He added: \"There are many reminders of this controversial past in daily view in Glasgow. The built heritage betrays much of this history in its street names, churches, graveyards and in the remains of Palladian mansions. That Glasgow benefited is indisputable.\"\nMullen says the building that houses the Gallery of Modern Art, one of the city's most-visited attractions, \"has a long connection with slave plantation economics.\" The Cunninghame Mansion, now the core of the building, was constructed in 1778 for William Cunninghame of Lainshaw, one of Glasgow's leading merchants. He had \"significant\" interests in both the Virginia tobacco trade and the West Indies sugar trade, Mullen added. He owned one plantation in Westmoreland, Jamaica, which had 300 slaves.\nPromoted stories James Ewing, an influential Glasgow citizen, was Lord Provost of Glasgow and an MP. He too, was a slave plantation owner. He also served as chairman of the city's Chamber of Commerce, and was a key figure in the development of the Glasgow Necropolis .\nJamaica Street was named after the largest slave plantation in the Caribbean, Mullen says.\nMany other parts of modern-day Glasgow carry echoes of merchants who were associated with the tobacco business or the Caribbean sugar business, both of which were utterly dependent upon the enslavement of black people.\nAmong them are Buchanan Street, Virginia Street, Glassford Street, Ingram Street and Tobago Street .\nThe magnificent church of St Andrews in the Square was funded by colonial merchants.\nKingston Bridge, too: Kingston is the capital of Jamaica, and refers to the former Kingston dock on the Clyde.\nRichard Oswald worked for his cousins’ Glasgow-based merchants’ firm before, in 1743, in London, setting up his own company, working in tobacco and then in slaves, horses and sugar. A key source of his wealth was the establishment of a slave ‘fort’ on Bance Island, off the coast of Sierra Leone. During its period of activity, some 30,000 Africans were exported from it to the Caribbean.\nShare article Oswald retired to Auchincruive , in Ayrshire, where the agricultural college now stands. The Oswalds have a family burial plot in Glasgow Cathedral , though Richard himself in buried in a parish church in Ayrshire.\nBy Russell Leadbetter", "external_links": ["https://twitter.com/share?url=", "https://www.facebook.com/sharer/sharer.php?u="], "published": "2015-10-02T19:21:00.000+03:00", "crawled": "2015-10-02T20:17:05.370+03:00", "highlightTitle": ""}