{"organizations": [], "uuid": "5495ee44372d29602a3f0ecbefd7e20206dfddea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266353/arts-entertainment-television", "section_title": "Arts &amp; Entertainment: Television - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30303069/leading-nursery-furniture-company-dream-on-me-rebrands-as-dom-family-expands-portfolio-to-include-four-brands-designed-for-families", "country": "US", "title": "Leading Nursery Furniture Company Dream On Me Rebrands as DOM Family, Expands Portfolio to Include Four Brands Designed for Families", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Leading Nursery Furniture Company Dream On Me Rebrands as DOM Family, Expands Portfolio to Include Four Brands Designed for Families - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T14:11:00.000+03:00", "replies_count": 0, "uuid": "5495ee44372d29602a3f0ecbefd7e20206dfddea"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30303069/leading-nursery-furniture-company-dream-on-me-rebrands-as-dom-family-expands-portfolio-to-include-four-brands-designed-for-families", "ord_in_thread": 0, "title": "Leading Nursery Furniture Company Dream On Me Rebrands as DOM Family, Expands Portfolio to Include Four Brands Designed for Families", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Dream On Me, the award-winning, family-owned brand for cribs, mattresses and other nursery furniture, today announced its rebranded debut as DOM Family, the parent company of a portfolio of brands to suit every taste, style and price a family may need. Existing brands include Dream On Me and Mia Moda, as well as two new higher-end lines, Rest Assure and Évolur, which are both dedicated to “Making Luxury Affordable.”\nSouth Plainfield, NJ (PRWEB) October 20, 2015\nDream On Me , the award-winning, family-owned brand for cribs, mattresses and other nursery furniture, today announced its rebranded debut as DOM Family, the parent company of a portfolio of brands to suit every taste, style and price a family may need. Existing brands include Dream On Me and Mia Moda. Dedicated to “Making Luxury Affordable” the DOM Family will be launching its newest upper end brands Évolur and Rest Assure at the All Baby and Child trade show in Las Vegas this month. With a choice of four brands, consumers will now have a range of affordable to higher-end luxury products to choose from.\nAccording to Avish Dahiya, the company’s Chief Marketing & Technology Officer, DOM Family brands offers parents the ability to shop for essential products for babies and children, including furniture, mattresses and travel gear, at all price points and without sacrificing great design, quality or safety.\nDOM Family brands include:\nDream On Me : A top-rated collection of cribs, patented mattresses and a wide range of nursery furniture solutions including strollers, car seats, high chairs, play pens, nursery bedding and other essentials. Seven new products include the Violet 7-in-1 Convertible Life Style Crib, with its fashionable architectural wave design offers both style and value at an affordable retail price of $159. Available in five color options, it transitions easily to a comfy toddler bed, daybed, youth bed, and full size bed as a child grows. The Synergy, a sleek, contemporary-styled 5-in-1 convertible crib in six vibrant colors, easily converts from a standard size crib to a toddler bed to a day bed and two options as a full size bed (rails sold separately for full bed). Dream on Me also offers a series of cribs with built-in changer models, ranging in price from $199 to its flagship Brody crib retailing at $359, and a canopied round crib, the Sophia. With a full line of mattresses and bedding to fit cribs, mini cribs and porta cribs, all are valued priced and available to ship directly to consumers though top online retailer’s sources.\nMia Moda: Represents DOM's style-driven cribs, strollers, car seats and other parenting essentials that fuse fashion with function. New products include the Elite 502 Lightweight Stroller, a one-hand quick fold ultimate stroller with 3-wheel configuration, 5-point quick-adjust harness, padded, reclining seat and other features. Also featuring are two other models Adriana 503 and Marisa 493 Strollers in the price range between $149 to $199.\nLaunching October 2015:\nÉvolur : Convertible cribs, dressers and room décor designed to create a style driven lifestyle environment at affordable luxury pricing. Cribs will range between $379 to $529 and furniture between $499-$599.The new line will include some of the industry’s most fashion forward stains and colors including a reclaimed weathered natural, a midnight blue and a charcoal stone finish. With 11 collections and 7 furniture groups to choose between, the line will have options for all decorating motifs.\nRest Assure : Ergonomically designed mattresses, accessories and safety products for babies and toddlers. Mattresses, include four natural certi pur foam models retailing between $99 to $249. Rest Assure’s top of the line Twilight Ultra offers the most advanced components in infant/juvenile sleep technology. With its hospital grade Derma Plush cover, Ultra provides 3 layers of comfort and support: Infant ultra-firm, a cutting edge Cool Flow air channel mid core with a tempur-perfect convoluted cooling gel comfort toddler layer. Other models include natural coconut air flow fiber and green bear certified baby safe natural fire barriers.\nCoinciding with its rebranded launch, DOM Family also introduces Nursery Concepts, a Community & blog inspired by the platform “By Moms and Dads for Moms and Dads.” Under this premise, Nursery Concepts gives parents direct access to advice, brand news and other information from the company’s design talent and arrange of experts.\nFor more information on DOM Family or to view its brands and product collections, visit http://www.TheDomFamily.com .\n###\nAbout DOM Family\nIn business for nearly three decades, Dream On Me has evolved from a nursery furniture collection into DOM Family, with a portfolio of top-rated, award-winning brands for families. Under the DOM Family name, brands including Dream On Me, Mia Moda, Rest Assure and Évolur. The company offers one of the widest range of nursery furniture mattresses in the market. With car seats, strollers, and other essentials for babies, children and parents at a variety of price points the company has a one stop shop variety for all priced budgets. All products are designed with the highest standards of quality, safety, style and value. A family-owned business, DOM Family is headquartered in Plainfield, NJ. For more information, please visit http://www.TheDomFamily.com .\n //www.prweb.com/releases/2015/10/prweb13028813.htm\n ", "external_links": ["http://www.prweb.com/releases/2015/10/prweb13028813.htm", "http://www.thedomfamily.com/"], "published": "2015-10-20T14:11:00.000+03:00", "crawled": "2015-10-20T13:22:27.941+03:00", "highlightTitle": ""}