{"organizations": [], "uuid": "d00c874372e3a5e71b6c4560c1d2f126982aa025", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "savannahnow.com", "main_image": "http://savannahnow.com/sites/default/files/images/sms-default-facebook-share.jpg", "site_section": "http://savannahnow.com/", "section_title": "savannahnow.com | Savannah Georgia's source for News, Entertainment, Sports, Weather, Classifieds, Jobs, Autos, Real Estate and St. Patricks Day", "url": "http://savannahnow.com/news/2015-09-30/savannah-launches-facts-web-page-ahead-election", "country": "US", "title": "Savannah launches \"facts\" web page ahead of election", "performance_score": 0, "site": "savannahnow.com", "participants_count": 1, "title_full": "Savannah launches \"facts\" web page ahead of election | savannahnow.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T19:45:00.000+03:00", "replies_count": 0, "uuid": "d00c874372e3a5e71b6c4560c1d2f126982aa025"}, "author": "Eric Curl", "url": "http://savannahnow.com/news/2015-09-30/savannah-launches-facts-web-page-ahead-election", "ord_in_thread": 0, "title": "Savannah launches \"facts\" web page ahead of election", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SPECIAL OFFER FOR NEW READERS 99 cent digital subscription to savannahnow.com\nSubscriber-members get access to ALL our digital products AND become eligible for free event tickets, discount coupons and other benefits. SIGN UP FOR SUBSCRIBER BENEFITS As a Savannah Morning News / savannahnow.com subscriber, you're eligible for members-only discounts. Download your coupons now. SPECIAL OFFER FOR NEW READERS 99 cent digital subscription to savannahnow.com\nSubscriber-members get access to ALL our digital products AND become eligible for free event tickets, discount coupons and other benefits. SIGN UP FOR SUBSCRIBER BENEFITS As a Savannah Morning News / savannahnow.com subscriber, you're eligible for members-only discounts. Download your coupons now. By Eric Curl With about one month until the municipal elections on Nov. 3, the city of Savannah has launched a page on its website officials say is meant to answer questions the public may have about decisions the city has made or services it offers.\nWith the public hyper-focused and engaged on various issues due to the election, the city decided to make it easier to get information in a more concise manner than what staffers have already been doing, said city spokesman Bret Bell.\n“This is just for the general public out there raising issues,” Bell said. “It will be continuing after the election.”\nAnother factor behind the website’s launch is the increased use of social media for news and as a platform for discussing city matters, Bell said. Residents will have a central location for finding answers to questions that are raised repeatedly, he said.\nThe site, dubbed “Just the FAQs,” addresses topics such as the city’s financial health, the police merger and the Cultural Arts Center. Also, city officials say the site will respond to misinformation or rumors about city issues that often circulate quickly and can be taken as fact. The website, which includes links to primary documents, minutes and meeting videos, is free of “spin,” Bell said.\n“It’s just going to be straight information,” he said.\nUsers can submit questions through the site, and city staff will review and respond on the site when appropriate. The site is to be regularly updated with new answers when topics of interest surface within the community, say officials.\nThe site can be accessed at www.savannahga.gov/facts.", "external_links": ["http://sav-cdn.com/sites/all/themes/savannahnow/images/blank.gif"], "published": "2015-09-30T19:45:00.000+03:00", "crawled": "2015-10-02T02:00:38.933+03:00", "highlightTitle": ""}