{"organizations": [], "uuid": "c939d4ae684c1dfc4c9a6535a9cff59e6c11e78a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wiltshiretimes.co.uk", "main_image": "http://www.wiltshiretimes.co.uk/resources/images/4302402/", "site_section": "http://www.wiltshiretimes.co.uk/leisure/showbiz/rss/", "section_title": "Wiltshire Times | National Entertainment News", "url": "http://www.wiltshiretimes.co.uk/leisure/showbiz/13810418.Hollywood_action_hero_Arnie_set_to_meet_fans_at_black_tie_dinner_in_Birmingham/?ref=rss", "country": "GB", "title": "Hollywood action hero Arnie set to meet fans at black tie dinner in Birmingham", "performance_score": 0, "site": "wiltshiretimes.co.uk", "participants_count": 0, "title_full": "Hollywood action hero Arnie set to meet fans at black tie dinner in Birmingham", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T18:43:00.000+03:00", "replies_count": 0, "uuid": "c939d4ae684c1dfc4c9a6535a9cff59e6c11e78a"}, "author": "", "url": "http://www.wiltshiretimes.co.uk/leisure/showbiz/13810418.Hollywood_action_hero_Arnie_set_to_meet_fans_at_black_tie_dinner_in_Birmingham/?ref=rss", "ord_in_thread": 0, "title": "Hollywood action hero Arnie set to meet fans at black tie dinner in Birmingham", "locations": ["Birmingham"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Arnie"], "text": "0 comments \nHOLLYWOOD action legend and former Mr Universe Arnold Schwarzenegger is heading to Birmingham for an exclusive black tie dinner event. \nOlexy Productions is hosting the event, An Experience with…Arnold Schwarzenegger, which will take place at the ICC on Thursday January 21. \nThe Terminator star will be taking part in a live on-stage interview during which he'll discuss his meteoric rise to become one of Hollywood's greatest action stars from humble beginnings flexing his muscles on Britain's bodybuilding circuit. \nStill considered among one the most important figures in the history of sport, the Austrian-born muscleman won the acclaimed Mr Universe title twice and Mr Olympia seven times - before trying his hand at acting. \nHe made his movie debut in Conan The Barbarian before landing his career defining role in legendary 1980s action flick The Terminator. \nBetween 2003 and 2011, Schwarzenegger – a member of the Republican party - put his movie career on the backburner to take up political office as Governor of California. \nHe has since returned to the big screen and was recently announced as the new host of the USA's Celebrity Apprentice, replacing Donald Trump. \nTickets to see Arnie in Birmingham go on sale on Friday October 9 and prices range from £95 (for the talk) to £145 (including a three course dinner) up to a £1,500 platinum package - which will offer die-hard fans chance to meet their idol. \nTicket holders also have the opportunity to upgrade to a photo opportunity with the star for £545. \nEvents company Olexy Productions hosted a similar sell-out dinner with Schwarzenegger in Leeds in 2014. \nThe event, hosted by comedian and presenter Jonathan Ross, received rave reviews and saw one Arnie super fan join the star on stage to propose to his girlfriend. Share article \nOlexy Productions have also hosted sell-out events with Hollywood legend Al Pacino, Vinnie Jones and they have a forthcoming event in November with Jean Claude Van Damme in Manchester. \nTickets and more details are available online at http://www.olexyproductions.com/ Promoted Stories Hollywood action hero Arnie set to meet fans at black tie dinner in Birmingham Sorry, an error occurred. Please sign in or register to leave a comment Remember that you are personally responsible for what you post on this site and must abide by our site terms . Do not post anything that is false, abusive or malicious. If you wish to complain, please use the 'Report' link underneath the comment. Post comment Sign in or Register to get comment alerts. Keep in touch with local news", "external_links": [], "published": "2015-10-07T18:43:00.000+03:00", "crawled": "2015-10-09T07:26:51.347+03:00", "highlightTitle": ""}