{"organizations": [], "uuid": "e51ac6b74466ec722fecde59eb0131151e6f5318", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kptv.com", "main_image": "http://images.worldnow.com/AP/images/9066779_G.jpg", "site_section": "http://kptv.com/category/13540/entertainment?clienttype=rss", "section_title": "KPTV.com - Entertainment - Headline", "url": "http://www.kptv.com/story/30317748/the-latest-lawyer-vows-to-appeal-dismissed-jay-z-lawsuit", "country": "US", "title": "The Latest: Lawyer vows to appeal dismissed Jay Z lawsuit", "performance_score": 0, "site": "kptv.com", "participants_count": 1, "title_full": "The Latest: Lawyer vows to appeal dismissed Jay Z lawsuit - KPTV - FOX 12", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "e51ac6b74466ec722fecde59eb0131151e6f5318"}, "author": "cbs8", "url": "http://www.kptv.com/story/30317748/the-latest-lawyer-vows-to-appeal-dismissed-jay-z-lawsuit", "ord_in_thread": 0, "title": "The Latest: Lawyer vows to appeal dismissed Jay Z lawsuit", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES (AP) - The latest on a copyright infringement case against rapper Jay Z (all times local):\n11 a.m.\nThe lawyer for the heir of an Egyptian composer who sued rapper Jay Z over the hit song \"Big Pimpin'\" says he will appeal a ruling dismissing the case before it went to a jury.\nAttorney Pete Ross says he believes the decision Wednesday by U.S. District Judge Christina A. Snyder is \"completely wrong.\"\nSnyder ruled that the nephew of Egyptian composer Baligh Hamdi didn't have the proper authority to sue Jay Z over the 1999 hit song, which partially uses Hamdi's 1957 song \"Khosara Khosara.\" The judge told jurors she was basing her ruling on testimony about Egyptian law that was presented during a weeklong trial.\nAttorneys for Jay Z and producer Timbaland say they are pleased with the ruling. Neither man attended Wednesday's hearing.\n___\n10:27 a.m.\nA judge has dismissed a copyright infringement case against rapper Jay Z over his 1999 hit \"Big Pimpin'\" before the case was sent to a jury.\nU.S. District Judge Christina A. Snyder ruled Wednesday that the heir of an Egyptian composer didn't have the right to pursue a copyright infringement claim and the case should be tossed out.\nThe nephew of Baligh Hamdi, an Egyptian composer whose 1957 song \"Khosara Khosara\" is partially used in \"Big Pimpin',\" sued Jay Z and producer Timbaland. Flute notes that Hamdi composed appear throughout the Jay Z song.\nThe abrupt end to the case came after the rapper and Timbaland testified about creating the rap hit and their belief that they had valid rights to use the Egyptian song.\nCopyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-10-21T03:00:00.000+03:00", "crawled": "2015-10-21T23:12:54.475+03:00", "highlightTitle": ""}