{"organizations": ["Mental State"], "uuid": "e3ef104dd3fdab17f0e78cc3b1a7f10f8868f7e7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eonline.com", "main_image": "http://i.accesshw.com/production/images/244/300x300/244634.jpg", "site_section": "http://news.google.com/news?pz=1&cf=all&ned=us&hl=en&topic=e&output=rss", "section_title": "Entertainment - Google News", "url": "http://www.eonline.com/news/705193/variety-power-of-women-top-eight-quotes-from-oprah-winfrey-gwyneth-paltrow-and-more", "country": "IL", "title": "'Walking Dead': New S6 Threat - Access Hollywood", "performance_score": 0, "site": "eonline.com", "participants_count": 0, "title_full": "'Walking Dead': New S6 Threat - Access Hollywood", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T05:32:00.000+03:00", "replies_count": 0, "uuid": "e3ef104dd3fdab17f0e78cc3b1a7f10f8868f7e7"}, "author": "", "url": "http://www.eonline.com/news/705193/variety-power-of-women-top-eight-quotes-from-oprah-winfrey-gwyneth-paltrow-and-more", "ord_in_thread": 0, "title": "'Walking Dead': New S6 Threat - Access Hollywood", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Rick", "Andrew Lincoln"], "text": "'The Walking Dead': Andrew Lincoln On Rick's Mental State, S6's 'Terrible Threat' \nOctober 9, 2015 10:32 PM EDT \n\"The Walking Dead\" is a ratings juggernaut, but having the show's Season 6 premiere at Madison Square Garden still came as a surprise to star Andrew Lincoln. \n\"When they said, 'We're doing MSG,' I was just like, 'What do you mean? Monosodium glutamate?' And then we arrived here and we had a rehearsal and it was the most mind blowing – it kind of dawned on me. Up until that point, I hadn't been nervous and then I stepped on the stage and I couldn't see the back,\" Andrew told Access Hollywood as he hit the premiere red carpet (in a tux) on Friday night. \n\"We're thrilled,\" he continued. \"I mean, look, if anybody told me when I became an actor that you would be playing Madison Square Garden, I would have laughed squarely in their face. I'm an actor, not a musician. So this is a huge testament to the hard work that the crew have done, everyone at AMC and of course this amazing cast, and you know, it's ultimately a fan night. This is for the fans.\" \nPHOTOS: ‘The Walking Dead’: Season 6 Red Carpet Premiere \nLast season, the series' 90-minute finale ended with a major cliffhanger. Jessie's husband Pete turned up at the Alexandria town meeting to kill Rick (with Michonne's katana), but he killed Reg instead. Deanna told Rick to \"do it,\" and Andrew's character shot and killed the troublemaker a mere moment before his old friend Morgan (Lennie James) arrived, flanked by Daryl (Norman Reedus) and Aaron (Ross Marquand). \nWhen the new season begins on Sunday night on AMC, Rick's mental state is in familiar territory. \nWATCH: Andrew Lincoln: Every Episode In 'The Walking Dead' S6 Feels Like It's The Season Finale' \n\"Rick's mental state is pretty much where you left him last season,\" Andrew said. \"It is a spill-over. It's a direct pickup from the shooting in Alexandria, but you meet a man that is not willing to tolerate incompetence, and he's a man of action. \n\"He's basically a self-appointed general of the community,\" Andrew told Access. \"There is a power space, perhaps left by Deanna, because she's grieving for her husband and son, but you'll quickly realize that there is a terrible threat that the community faces that they have to step up and try and deal with. And this season is more ambitious, bigger, more bold, more brave, I think, than any we've ever attempted. And, you know, it feels like every single episode is a season finale. It's thrilling.\" \nThe trailers for the new season have hinted over and over again at big scenes between Andrew's character and Lennie's character. Having his Season 1 co-star back to play off of (beyond their encounter in Season 3's \"Clear\") has been something Andrew has relished in. \n\"That's been such fun playing with Lennie and having that relationship back,\" Andrew said. \"There's this incredible history between these two men and they have a shared history, but they don't know each other, and to have someone of his strength and his granite-like fortitude in opposition to Rick is a very, very interesting catalyst for the community. And it's been fun. We've had a lot of fun playing.\" \n\"The Walking Dead\" Season 6 premieres Sunday night at 9 PM ET/PT on AMC. \n-- Jolie Lash \nCopyright 2015 by NBC Universal, Inc . All rights reserved.This material may not be published, broadcast, rewritten or redistributed. More news", "external_links": [], "published": "2015-10-10T05:32:00.000+03:00", "crawled": "2015-10-10T08:55:17.071+03:00", "highlightTitle": ""}