{"organizations": [], "uuid": "3df15d1db64ecbec25f7e0f2ea1dd76369781352", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.onenewspage.com", "main_image": "http://cdn.newsserve.net/ONPglobe256.jpg", "site_section": "http://www.onenewspage.com/rss/latest/Entertainment.rss", "section_title": "Latest Entertainment News on One News Page", "url": "http://www.onenewspage.com/n/Entertainment/7559xw6e5/Unfaithful-Music-Disappearing-Ink-by-Elvis.htm", "country": "US", "title": "‘Unfaithful Music & Disappearing Ink,’ by Elvis Costello", "performance_score": 0, "site": "onenewspage.com", "participants_count": 0, "title_full": "‘Unfaithful Music & Disappearing Ink,’ by Elvis Costello", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T02:14:00.000+03:00", "replies_count": 0, "uuid": "3df15d1db64ecbec25f7e0f2ea1dd76369781352"}, "author": "", "url": "http://www.onenewspage.com/n/Entertainment/7559xw6e5/Unfaithful-Music-Disappearing-Ink-by-Elvis.htm", "ord_in_thread": 0, "title": "‘Unfaithful Music & Disappearing Ink,’ by Elvis Costello", "locations": ["Britain", "New York City", "Spain", "England"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Rick Danko", "George Jones", "Levon Helm", "Diana Krall", "Brodsky Quartet", "Elvis Costello", "Steve Nieve", "David Letterman", "Chet Baker", "Ross MacManus"], "text": "‘Unfaithful Music & Disappearing Ink,’ by Elvis Costello Wednesday, 14 October 2015 (3 minutes ago) Deep into his droll, hefty new autobiography, the British songwriter who long ago dubbed himself Elvis Costello recalls a chance mid-’80s meeting on a New York City fire escape with Rick Danko and Levon Helm of The Band, one of his favorite groups. For interviewers, squeezing a single question into his stream of music-history consciousness can be as elusive as a glimpse of the dapper entertainer without a hat on. On the crowded shelf of musicians’ memoirs, Costello’s “Unfaithful Music & Disappearing Ink” claims the same kind of real estate as does his long, confounding catalog of records. Costello is not the sort of recording artist who attracts many fair-weather fans, but for those who know “Alison” and “Everyday I Write the Book” and not much else, the rudiments are mostly here: his rise from Britain’s punk and pub-rock scenes as the razor-witted wordsmith who made some memorable mischief on an early episode of “Saturday Night Live”; the restless stylist who collaborated with George Jones, Chet Baker, the Brodsky Quartet and many more; the encyclopedic raconteur who hosted the highly touted television series “Spectacle” and once subbed for David Letterman. Befitting a consummate lyricist — this is, after all, the man who once rhymed “America” with “hysterical” — the writing in “Unfaithful Music” often soars high above the typical rock ’n’ roll rehash. Recalling a boyhood trip to Spain, Costello riffs on the fragmentary nature of holiday memories: “The sky as seen on a certain day through a viewfinder; the taste of seawater swallowed by accident … my Irish complexion turning tight and pink, then angry red.” The book has some touching words for Costello’s father, Ross MacManus, a well-known big-band singer in England (from whose stage name the younger performer takes the back end of his own alter ego), his longtime accompanist Steve Nieve, and his third wife, the pianist and jazz singer Diana Krall. About another matter entirely, the 1981 country-covers album “Almost Blue,” Costello’s first real departure from his spiky new-wave image, he writes, “If you intend to have a long career in show business , it is necessary to drive people away from time to time, so they can remember why they miss you.” Songs can be many things,” he muses: “an education, a seduction, some solace in heartache, a valve for anger, a passport, your undoing, or even a lottery ticket.", "external_links": [], "published": "2015-10-15T02:14:00.000+03:00", "crawled": "2015-10-15T02:18:06.798+03:00", "highlightTitle": ""}