{"organizations": [], "uuid": "3c0b0f0a1c5312ab83f661cd3c253a5f8d055cf0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prnewswire.com", "main_image": "http://content.prnewswire.com/designimages/logo-prn-01_PRN.gif", "site_section": "http://rss.prnewswire.com/industry/entertainment/", "section_title": "PR Newswire: Entertainment & Media", "url": "http://www.prnewswire.com/news-releases/ott-optimization-goes-beyond-audience-counting---demands-actionable-insights-conviva-white-paper-finds-300163624.html", "country": "IT", "title": "OTT Optimization Goes Beyond Audience Counting - Demands Ac", "performance_score": 0, "site": "prnewswire.com", "participants_count": 1, "title_full": "OTT Optimization Goes Beyond Audience Counting - Demands Ac", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T16:25:00.000+03:00", "replies_count": 0, "uuid": "3c0b0f0a1c5312ab83f661cd3c253a5f8d055cf0"}, "author": "Conviva", "url": "http://www.prnewswire.com/news-releases/ott-optimization-goes-beyond-audience-counting---demands-actionable-insights-conviva-white-paper-finds-300163624.html", "ord_in_thread": 0, "title": "OTT Optimization Goes Beyond Audience Counting - Demands Ac", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "FOSTER CITY, Calif. , Oct. 21, 2015 /PRNewswire/ --  Conviva , the leader in Over the Top (OTT) video experience optimization for the world's top media companies, today released its latest white paper, which explores the benefits and limitations of audience counting; identifies the opportunity to improve business KPIs by surfacing actionable insights that lead to measurable outcomes; and introduces the Conviva Information Architecture™, which empowers OTT services to manage their business efficiently and profitably. The white paper, \"Information Architecture\" reveals the challenges OTT broadcasters, operators and publishers face when correlating audience measurement into measurable results. \"The numbers matter – but the numbers have to represent more than static audience counting,\" said Hui Zhang , CEO of Conviva. \"As content consumption moves away from the traditional TV-based model, broadcasters need to ensure they can measure every aspect of audience engagement.  When we observe engagement changes, we must analyze the experience measurements to seek a root cause. By observing changes in experience metrics in real-time, we can identify a correctable problem that is affecting engagement and deliver a positive, measurable outcome.\" \nKey facets of the white paper include: \nTV businesses have the \"whats\" but where are the \"whys?\" : How does Conviva's engagement measurement differ from the counting of Nielsen, comScore, Omniture and others. It's all about actionable insights: Statistical measurements and opportunities to make adjustments that can impact those measurements are key to an optimized viewing experience If content is king, delivery is queen: It is unacceptable to consider quality of experience as anything other than equally important as quality of content. Real-time, automated course corrections : Automating the system to be self-healing – even self-optimizing – is the logical and necessary next step to gaining advantage in the market. Quality of experience is the single core element of an OTT business that can be fully controlled and optimized. Failing to plan for viewer experience management is planning to fail. To download the full report, visit http://www.conviva.com/conviva-whitepapers/ia-whitepaper \nAbout Conviva \nConviva partners with top tier media companies and premium OTT video broadcasters and operators like HBO, Sky, and Foxtel to deliver optimized viewing experiences that maximize customer engagement.  The Conviva Intelligent Control Platform helps providers meet and exceed ever-changing audience expectations for video experience, across a multi-screen viewing environment. Using a unique real-time map of the Internet video delivery ecosystem, the platform provides 360-degree visibility across all users, maximizes picture fidelity, and eliminates playback delays and interruptions. Multi-dimensional reports and analyses of the top tier OTT market, based on Conviva's tracking of 50 billions streams annually, enable data-driven decisions, supporting successful development of market-leading services.  Conviva is based in Silicon Valley, with offices in New York and London . Please visit  www.conviva.com  and follow us on Twitter  @Conviva .\n\nSOURCE Conviva\n\n\nRELATED LINKS\nhttp://www.conviva.com", "external_links": [], "published": "2015-10-21T16:25:00.000+03:00", "crawled": "2015-10-21T16:24:46.499+03:00", "highlightTitle": ""}