{"organizations": [], "uuid": "f6a30b32dd9de1b2d36ab51d6fd1a6d96e90be85", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.india.com", "main_image": "http://s3.india.com/wp-content/uploads/2015/10/Narendra-Modi-While-Giving-Speech-On-Independence-Day.jpg", "site_section": "http://www.india.com/feed/", "section_title": "India | Latest India News | Get Free India.com Email | Live Cricket and Entertainment News at India.Com", "url": "http://www.india.com/whatever/narendra-modi-has-violated-model-code-by-remarks-on-interviews-ambedkar-grand-alliance-657731/", "country": "US", "title": "Narendra Modi has violated model code by remarks on interviews, Ambedkar: Grand Alliance", "performance_score": 0, "site": "india.com", "participants_count": 1, "title_full": "Narendra Modi has violated model code by remarks on interviews, Ambedkar: Grand Alliance", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T19:00:00.000+02:00", "replies_count": 0, "uuid": "f6a30b32dd9de1b2d36ab51d6fd1a6d96e90be85"}, "author": "Wires English | Press Trust of India", "url": "http://www.india.com/whatever/narendra-modi-has-violated-model-code-by-remarks-on-interviews-ambedkar-grand-alliance-657731/", "ord_in_thread": 0, "title": "Narendra Modi has violated model code by remarks on interviews, Ambedkar: Grand Alliance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments \nNew Delhi, Oct 25: Bihar’s grand alliance partners JD(U) and Congress today charged Prime Minister Narendra Modi with violating the model code of conduct by announcing abolition of interviews for Group D, C, and B non-gazetted posts in central government from January 1, claiming it was intended to put an end to the reservation policy. (read:Gohana Dalit incident: Congress demands CBI probe ) \nJD(U) general secretary K C Tyagi said the announcement, made at a time when Bihar assembly polls are underway, would in effect lead to “effective implementation” of RSS chief Mohan Bhagwat’s call for a review of the reservation policy.Tyagi also accused Modi of violating the model code by speaking on his ‘Mann Ki Baat’ radio programme about his plans to visit B R Ambedkar’s London home during his upcoming visit to the UK “so as to reach out to the SC and ST voters” in the state. \n“The PM’s announcement of doing away with interviews for Group D,C and B non-gazetted posts in central government means a good bye to the reservation policy as recruitment will only be held on merit basis. The PM’s statement suggests so.”We strongly oppose this and will make respresentation to the EC soon and raise this issue inside and outside Parliament,” Tyagi, flanked by Congress leader R P N Singh and eminent lawyer K T S Tulsi, told reporters. \n“This is the effective implementation of Mohan Bhagwat’s demand for a review of the reservation policy and the Prime Minister has to respond to the voters,” he said.Tyagi also accused the EC of going “soft” on BJP and the PM. The grand alliance had petitioned the poll panel earlier this month seeking a ban on live telecast of Modi’s election rallies on days when polling is held in the state. It had also sought a ban on his ‘Mann Ki Baat’ address contending he would try and influence voters through it. \nTulsi, a Rajya Sabha MP, accused Modi of poll code violation with his announcement on abolition of interviews, saying the Election Commission had already made it clear that the government cannot announce launch of any new scheme when the poll process is underway.”Neither BJP leader Sushil Modi or PM Modi is fearful of law. EC had given notice to Sushil Modi but it has served no such notice to the PM,” he alleged. \nTyagi demanded a role for the opposition in appointment of the Chief Election Commissioner and other members of the poll panel through a collegium system so as to ensure fairness in their functioning. ”The Election Commission cannot dare to issue a notice to the PM,” he said. \n  25, 2015 10:35 PM Topics:", "external_links": [], "published": "2015-10-25T19:00:00.000+02:00", "crawled": "2015-10-25T23:53:01.484+02:00", "highlightTitle": ""}