{"organizations": [], "uuid": "219fbecd2b2d4fc4d0edb774b6a22abcc46058ed", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "http://yospace-cds1.reuters.com/u/resize~ad1~1200/0/f/~image_jpeg~9999-1/1/m/d/e/f/r/e05p/reuters04?videoId=112473878", "site_section": "http://feeds.reuters.com/reuters/INVideoEntertainment", "section_title": "Reuters Video: Entertainment", "url": "http://in.reuters.com/video/2015/10/11/obama-has-some-words-of-advice-for-kanye", "country": "US", "title": "Obama has some words of advice for Kanye", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "Obama has some words of advice for Kanye", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T04:40:00.000+03:00", "replies_count": 0, "uuid": "219fbecd2b2d4fc4d0edb774b6a22abcc46058ed"}, "author": "", "url": "http://in.reuters.com/video/2015/10/11/obama-has-some-words-of-advice-for-kanye", "ord_in_thread": 0, "title": "Obama has some words of advice for Kanye", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Obama has some words of advice for Kanye 7:10am IST - 01:46 \nU.S. President Barack Obama pokes fun at rapper Kanye West, says he's ''a guy who I hear has been talking about launching a potential political career.'' Rough Cut (no reporter narration).   \nROUGH CUT (NO REPORTER NARRATION) President Barack Obama poked a little fun at rapper Kanye West on Saturday for saying he planned to run for the White House and offered some tongue-in-cheek advice on how to achieve a successful political career. \"First of all, you've got to spend a lot of time dealing with some strange characters who behave like they're on a reality TV show. So you've just to be cool with that,\" Obama said to laughter from a crowded theater where he was headlining a fundraiser. West is married to reality TV star Kim Kardashian. \"Second important tip: saying that you have a 'Beautiful Dark Twisted Fantasy' -- that's what's known as 'off-message' in politics. You can't say something like that,\" Obama riffed, making reference to a popular West album. \"And number three: do you really think that this country is going to elect a black guy from the South Side of Chicago with a funny name to be president of the United States? That is crazy. That's cray!\" Obama, who lived on the South Side of Chicago before he was elected president, concluded, to applause. West has said he's serious about running for president in 2020. Obama opened his remarks at the fundraiser, at which West was scheduled to perform, by joking that the entertainer was going to jump into the increasingly complicated race to replace Republican Speaker of the House of Representatives John Boehner. \"A little bit later, you're going to hear from a guy who I hear has been talking about launching a potential political career,\" Obama told the crowd. \"Kanye is thinking about running -- for Speaker of the House. Couldn't get any stranger.\"  //reut.rs/1Ml6q1E", "external_links": [], "published": "2015-10-11T04:40:00.000+03:00", "crawled": "2015-10-11T06:08:25.401+03:00", "highlightTitle": ""}