{"organizations": [], "uuid": "1959498eb13a076561f242be6dbb77ac3507cb30", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailyherald.com", "main_image": "http://www.dailyherald.com/storyimage/DA/20151015/BUSINESS/151019271/AR/0/AR-151019271.jpg&amp;updated=201510151506&amp;imageversion=Facebook&amp;exactH=630&amp;exactW=1200&amp;exactfit=crop&amp;noborder", "site_section": "http://www.dailyherald.com/rss/feed/?feed=entlife", "section_title": "DailyHerald.com &gt; Life &amp; Entertainment", "url": "http://www.dailyherald.com/article/20151015/business/151019271/", "country": "US", "title": "Towing of Blues Brothers car a sign of brighter days ahead in Mount Prospect?", "performance_score": 0, "site": "dailyherald.com", "participants_count": 1, "title_full": "Towing of Blues Brothers car a sign of brighter days ahead in Mount Prospect?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T23:06:00.000+03:00", "replies_count": 0, "uuid": "1959498eb13a076561f242be6dbb77ac3507cb30"}, "author": "Steve Zalusky", "url": "http://www.dailyherald.com/article/20151015/business/151019271/", "ord_in_thread": 0, "title": "Towing of Blues Brothers car a sign of brighter days ahead in Mount Prospect?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "In a symbolic gesture many hope is a sign of brighter days ahead for Mount Prospect's former Blues Bar, a tow truck this week hauled the iconic 1974 Dodge Monaco sedan -- a replica of the beat-up Mount Prospect police car used in the movie \"The Blues Brothers\" -- out of the downtown restaurant space's second floor.\nThe car's removal comes six months after the bar at Busse Avenue and Route 83 closed its doors, and helps clear the way for a new restaurant venture planned there called Bar 145.\n\"It (the car) just doesn't go with our theme,\" said Deana Rago, who is opening Bar 145 with her husband, Lenny Rago. \"Anything Blues Brothers related that was previously in there we wanted to get out. Our thing is burgers, bands and bourbon, and it has nothing to do with the Blues Brothers car.\"\nThe Rago's next official step is getting approval for a liquor license at Tuesday's village board meeting.\nDeana Rago said she doesn't expect the restaurant to open until December, after the space is redecorated to conform with the other Bar 145 franchises, most of which are in Ohio. The \"145\" refers to the temperature of a perfectly cooked medium-rare burger.\nThe Ragos, who live in Mount Prospect, are already successful restaurateurs, operating Panino's Pizza, which has locations in Park Ridge, Evanston and Wrigleyville. Bar 145 will run by Deana Rago as a separate entity from Panino's.\nRago said she and her husband began investigating the Blues Bar property about six months ago, and signed a lease in September. She said there is a lot of local pride involved.\n\"There needs to be something down there,\" she said. \"I love Mount Prospect. But it's missing something right now.\"\nAlong with the neighboring Tokens & Tankers gastrocade, expected to open later this fall at the former Ye Olde Town Inn site, many hope Bar 145 helps revitalize Busse Avenue in downtown Mount Prospect.\nDeana Rago said the restaurant will host live music on Friday and Saturday nights, and possibly open mic nights. There will be 50 types of bourbon offered, as well as several craft beers, she said.\nIn the meantime, the Blues Brothers car is now sitting in a towing company lot.\n\"We're not really sure right now who it belongs to,\" Rago said. \"There is no title, so we're not sure what's going to happen to it.\"\n Business News Dining Mount Prospect Commercial Real Estate", "external_links": ["http://www.bar145toledo.com/home", "https://twitter.com/share"], "published": "2015-10-15T23:06:00.000+03:00", "crawled": "2015-10-16T01:36:45.710+03:00", "highlightTitle": ""}