{"organizations": [], "uuid": "bb8212642ee61f456bcf89c66afab6302d7bf579", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbsnews.com", "main_image": "http://cbsnews2.cbsistatic.com/hub/i/r/2015/10/02/6d3ba953-b6b4-40d1-ad3f-8b38c78a8d3e/thumbnail/620x350/8432ba5216f4daeed66618d2432b358c/2015-10-02t150721z1729385235pm1eba21a0401rtrmadp3fashion-paris.jpg", "site_section": "http://www.cbsnews.com/entertainment/", "section_title": "Entertainment News, Headlines and Video - CBS News ", "url": "http://www.cbsnews.com/news/esquire-names-emilia-clarke-sexiest-woman-alive/", "country": "US", "title": "Esquire names Emilia Clarke Sexiest Woman Alive", "performance_score": 0, "site": "cbsnews.com", "participants_count": 1, "title_full": "Esquire names Emilia Clarke Sexiest Woman Alive - CBS News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T18:22:00.000+03:00", "replies_count": 0, "uuid": "bb8212642ee61f456bcf89c66afab6302d7bf579"}, "author": "AP", "url": "http://www.cbsnews.com/news/esquire-names-emilia-clarke-sexiest-woman-alive/", "ord_in_thread": 0, "title": "Esquire names Emilia Clarke Sexiest Woman Alive", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK -- It's most definitely Emilia Clarke's year.\nThe 28-year-old Londoner, who plays menacing, white-haired Daenerys Targaryen, aka Khaleesi, aka Mother of Dragons on \"Game of Thrones,\" is Esquire's Sexiest Woman Alive.\nThe magazine made the announcement early Tuesday, but GQ got there first, anointing Clarke Woman of the Year in September.\nIn addition to her high-profile role on the massively popular HBO series, Clarke was Sarah Connor in the summer movie hit \"Terminator: Genisys.\"\n21 Photos \"Game of Thrones\" season 5 premiere Stars of the hit HBO drama trade their fantasy costumes for red carpet attire to celebrate the show's upcoming fifth season\nShe can do fierce, but also friendly. She can be queen, but also kid sister, killer or girl next door, writes Benjamin Markovits in the Esquire story accompanying Clarke's nude cover, belly down with bedsheet strategically placed.\nLisa Hintelmann, editorial projects director for the magazine, called Clarke the all-around favorite.\n\"Emilia Clarke is unforgettable in 'Game of Thrones' and was hands down the number one choice of Esquire's staff, friends and family,\" she said in an email.\nOn the pages of Esquire, with more sultry photos inside, she is also \"Lilly,\" the alias she takes after donning a disguise to frolic at London's Crystal Palace Park with Markovits for a round of \"Game of Phones,\" a group treasure hunt thought up by a social networking company and intended to help people make new friends in a new city.\nShe isn't recognized.\nClarke is the second child of by-the-bootstraps parents. Mom started as a secretary and rose to marketing executive and dad made it out of working-class Wolverhampton near Birmingham to become roadie, then sound specialist for big-budget musicals.\nShe followed her brother into boarding school because \"I fancied his friends,\" she told Esquire, then she went on to study drama in college, pulling a couple of episodes on the long-running British daytime soap \"Doctors\" after graduation. She worked multiple jobs while living with friends before \"Game of Thrones\" changed her life when it began airing in 2011.\nClarke recalled some difficulties on the show early on. She was just 23. There was full frontal nudity, lots of sex, even a rape scene. She tells Markovits how she suffered along with her character.\n\"Once, I had to take a little time out,\" she said. \"I said I needed a cup of tea, had a bit of a cry, and was ready for the next scene.\"\nThat's what the English call \"mucking in,\" or striking a balance between helping out and getting your hands dirty while maintaining a smile on your face, Markovits writes. Clarke, he said, is good at it.\nShe recalled in the story her father's early warnings about lowering expectations as an actress when she first started out, and her days working at a call center.\nSexy but still real, Markovits declares, \"is the gorgeous balance of Emilia Clarke.\"", "external_links": ["http://cbsnews1.cbsistatic.com/hub/i/r/2015/03/24/da87f474-5b18-4be8-9c73-729c5c26a1e7/thumbnail/220x140/b9232e80a098919fd0d8e5e3143aa60a/2015-03-24t031434z950374667gf10000036175rtrmadp3usa-entertainment.jpg"], "published": "2015-10-13T18:22:00.000+03:00", "crawled": "2015-10-13T17:40:58.526+03:00", "highlightTitle": ""}