{"organizations": [], "uuid": "5e09a7645127f728f0d268a21c8083dfa21f60b4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mcall.com", "main_image": "http://www.trbimg.com/img-562aba99/turbine/mc-polyphonic-spree-bethlehem-musikfest-cafe-20151023", "site_section": "http://www.mcall.com//entertainment/rss2.0.xml", "section_title": "Entertainment - The Morning Call", "url": "http://www.mcall.com/entertainment/music/mc-polyphonic-spree-bethlehem-musikfest-cafe-20151023-story.html", "country": "US", "title": "Dreamy Polyphonic Spree looking back to the beginning", "performance_score": 0, "site": "mcall.com", "participants_count": 1, "title_full": "Dreamy Polyphonic Spree looking back to the beginning - The Morning Call", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T01:53:00.000+03:00", "replies_count": 0, "uuid": "5e09a7645127f728f0d268a21c8083dfa21f60b4"}, "author": "mcall.com", "url": "http://www.mcall.com/entertainment/music/mc-polyphonic-spree-bethlehem-musikfest-cafe-20151023-story.html", "ord_in_thread": 0, "title": "Dreamy Polyphonic Spree looking back to the beginning", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The post-grunge era was bottoming out when Tim DeLaughter formed The Polyphonic Spree 15 years ago. The uplifting choral-pop-rock act was not meant to be an antidote to the angst rock by such acts as Limp Bizkit, Creed and Three Days Grace.\nDeLaughter never imagined he was forming a sonic difference maker. \"I didn't think that way at all,\" he says in a phone call from his Dallas home. \"I never thought this would actually happen.\"\nBut after his prior band, the spare, innocuous and relatively inconsequential Tripping Daisy, called it a day after the drug overdose death of guitarist Wes Berggren, DeLaughter decided to see what would happen if he took a musical risk.\n\"All I tried was this experiment,\" he says. \"It was pretty simple.\"\nActually The Polyphonic Spree concept is complex. It's a 29-piece ensemble, which combines the gorgeous Beach Boy-esque \"Teenage Symphonies to God\" with the quirkiness of the Flaming Lips.\n\"The Beginning Stages of The Polyphonic Spree,\" an inspired debut album, which was released in 2002, comprises baroque songs, some celebratory and some melancholy. \"It's the Sun,\" couldn't be more uplifting. The amusing \"Soldier Girl\" is full of big hooks. The common denominator is that each song, even if the lyrics are somber, induce grins.\n\"I never knew this would connect with music fans but it did,\" DeLaughter says. \"The album came out at a very confused musical time. We made what I think is a charming record but I didn't know how it would go.\"\nThe Polyphonic Spree became a live sensation. Fans flocked to catch the feel-good act clad in flowing white robes. The band, which includes full horn and string sections and a cadre of backup vocalists, knocked it out of the park.\nSuch instruments as flutes and French horns were part of an unconventional but moving sonic attack.\n\"It was clear that we were doing something different live and people really appreciated it,\" DeLaughter says. \"I decided to have people in a rock band that normally weren't in rock bands. I had a horn player's unbridled energy and that pushed everything up a notch on the stage. A lot of energy came from people who were so thrilled to be part of something like The Polyphonic Spree.\"\nDavid Bowie became a huge fan right from the start. The rock legend invited The Polyphonic Spree to perform at London's Meltdown Festival, which he curated in 2002. \"That was an amazing honor,\" DeLaughter says. \"That happened not that long after we really got things together. It was after we played South By Southwest.\"\nPolyphonic Spree's performance 13 years ago at the world's biggest music conference helped the band break out.\n\"It all happened here in Texas,\" DeLaughter says. \"It helped propel 'The Beginning Stages.'\"\nWhen The Polyphonic Spree performs Wednesday at Bethlehem's Musikfest Cafe, and Nov. 2 at Philadelphia's Underground Arts, the group will deliver \"The Beginning Stages\" in its entirety. The bad is celebrating the 15th anniversary of the record's recording in 2000.\n\"We're excited since this will be the first time we ever do this,\" DeLaughter says. \"When we toured behind the first album way back when we had a bunch of other songs and it was all mixed up. I can't wait to see how this all goes when we play it all the way through. This tour is long overdue\"\nDeLaughter can't believe that The Polyphonic Spree is still standing a decade and a half after it formed and he's at the helm.\n\"My original idea was for me to be on the periphery,\" DeLaughter says. \"I just wanted to watch what this band could do but I was needed to navigate the ship in the studio and on the road. I don't regret it for a minute. I just never thought it would be alive 15 years after it started.\"\nDeLaughter had a daughter, Stella, who was an infant when the band commenced. He has four children now between 8 and 16. \"They love it,\" DeLaughter says. \"They think it's cool. This is what their dad does for a living and it's a really great situation.\"\nThe band is crafting a follow-up to 2013's \"Yes, It's True,\" which is an uncharacteristically heavy album. \"We're kicking around for some songs and we'll get to it next year,\" DeLaughter says. \"I'm never one to rush an album but I will say the next album will be different from the last. That's for sure.\"\nDeLaughter, who will turn 50 in mid-November, is hoping someone shakes up the world of pop music, which is way too predictable and well-mannered. \"It's about time someone does something interesting,\" he says. \"It's so frustrating with shows like 'The Voice' and 'American Idol.' All those shows are about is becoming a star. But it should really be about the art and taking chances.\"\nThe Polyphonic Spree was just that. \"It was a big chance and it paid off,\" DeLaughter says. \"There's nothing like what we do.\"\nThree years ago The Polyphonic Spree delivered its entertaining holiday show at Philadelphia's Trocadero. Children were invited on stage to sing Christmas favorites.\n\"That was the only time we did a holiday show tour,\" DeLaughter says. \"The performance in Philadelphia was loose and simply a blast. We did the holiday songs and came back for the rock set later on so kids that couldn't last the night could go home. We love doing those shows but it's not going to happen this year. We're not doing a tour. It's a huge production. It's so expensive.\n\"We're just going to do one show in December in Dallas. If you're planning to see us on the East Coast, now is the time. Who knows when we'll be back again? The cool thing is that we're still doing this. It just goes to show you never know what will happen when you start a band. It could last a week or it can last 15 years and counting. I'm hoping to do this for many, many years.\"\nEd Condran is a freelance writer.\nJodi Duckett , editor\nJodi.duckett@mcall.com\n610-820-6704\nTHE POLYPHONIC SPREE\n• 7:30 Wednesday, Musikfest Cafe, ArtsQuest Center at SteelStacks, 101 Founders Way, Bethlehem. Tickets: $25 and $39. 610-297-1700, www.steelstacks.org\n• 8 p.m. Nov. 2, Underground Arts, 1200 Callowhill, Philadelphia. Tickets: $25. www.undergroundarts.org", "external_links": ["http://bio.tribune.com/JodiDuckett"], "published": "2015-10-24T01:53:00.000+03:00", "crawled": "2015-10-25T03:35:55.393+02:00", "highlightTitle": ""}