{"organizations": [], "uuid": "7980763323f42fe9029fad186125e1b9536a98b5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wfsb.com", "main_image": "http://tvguide.images.worldnow.com/images/9048368_G.jpg", "site_section": "http://wfsb.com//category/73801/entertainment?clienttype=rss", "section_title": "WFSB - Entertainment", "url": "http://www.wfsb.com/story/30293534/jenni-jwoww-farley-marries-roger-mathews-baby-no-2-on-the-way", "country": "US", "title": "Jenni \"JWoww\" Farley marries Roger Mathews, baby No. 2 on the way", "performance_score": 0, "site": "wfsb.com", "participants_count": 0, "title_full": "Jenni \"JWoww\" Farley marries Roger Mathews, baby No. 2 on the way", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T18:30:00.000+03:00", "replies_count": 0, "uuid": "7980763323f42fe9029fad186125e1b9536a98b5"}, "author": "", "url": "http://www.wfsb.com/story/30293534/jenni-jwoww-farley-marries-roger-mathews-baby-no-2-on-the-way", "ord_in_thread": 0, "title": "Jenni \"JWoww\" Farley marries Roger Mathews, baby No. 2 on the way", "locations": ["Las Vegas", "Nevada"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Scott Disick", "Odom", "Hayden Panettiere", "Roger Mathews", "Khloe Kardashian", "Jenni", "Kardashian", "John Stamos", "Lamar Odom", "Bill Cosby", "Farley"], "text": "More schools are trying to distance themselves from Bill Cosby. More > More schools are trying to distance themselves from Bill Cosby. More > The Kardashian and Odom families speak out as Lamar Odom remains in critical condition Lamar Odom's children have released a statement thanking fans for prayers for their father, who remains in critical condition after being found unconscious on Tuesday. More > Lamar Odom's children have released a statement thanking fans for prayers for their father, who remains in critical condition after being found unconscious on Tuesday. More > Jenni \"JWoww\" Farley marries Roger Mathews, baby No. 2 on the way Jenni \"JWoww\" Farley married her longtime boyfriend, Roger Mathews, over the weekend, and that wasn't the only thing the couple had to celebrate. More > Jenni \"JWoww\" Farley married her longtime boyfriend, Roger Mathews, over the weekend, and that wasn't the only thing the couple had to celebrate. More > It's a sad day for Old Hollywood. More > It's a sad day for Old Hollywood. More > John Stamos charged with DUI John Stamos has been officially charged with one count of driving under the influence in relation to his arrest in June, TMZ reports. More > John Stamos has been officially charged with one count of driving under the influence in relation to his arrest in June, TMZ reports. More > Scott Disick has checked into a Malibu rehab center for drug and alcohol addiction, UsWeekly reports. More > Scott Disick has checked into a Malibu rehab center for drug and alcohol addiction, UsWeekly reports. More > Khloe Kardashian is making medical decisions on Lamar Odom's behalf Things are not looking good for Lamar Odom and the Kardashian family. Odom is currently in a coma and remains unresponsive in a Las Vegas hospital. More > Things are not looking good for Lamar Odom and the Kardashian family. Odom is currently in a coma and remains unresponsive in a Las Vegas hospital. More > Lamar Odom reportedly overdosed on drugs Drugs were found in Lamar Odom's system after he was found unconscious at a Nevada brothel, E! News reports. More > Drugs were found in Lamar Odom's system after he was found unconscious at a Nevada brothel, E! News reports. More > Hayden Panettiere enters treatment center for postpartum depression After struggling with postpartum depression since the birth of her daughter, Hayden Panettiere is reaching out for a helping hand. More > After struggling with postpartum depression since the birth of her daughter, Hayden Panettiere is reaching out for a helping hand. More > \nBy Liz Raftery, \nJenni \"JWoww\" Farley married her longtime boyfriend, Roger Mathews, over the weekend, and that wasn't the only thing the couple had to celebrate. \nET reports that Farley and Mathews are also expecting Baby No. 2. The new addition will join big sister Meilani, who was born last July . \nFarley and Mathews, who have been engaged since September 2012, tied the knot on Sunday. InTouch was the first to report the news. \nIn a blog post on Farley's website Friday, Mathews wrote that his wife-to-be was \"very calm\" in the days leading up to the wedding. And, he added: \"Meilani has been in a great mood all week ... Think she knows her Mommy and Daddy are about to have a very special day.\" \nMeilani was a flower girl at the ceremony, and Farley's former Jersey Shore co-stars Nicole \"Snooki\" Polizzi , Deena Cortese and Sammi \"Sweetheart\" Giancola were bridesmaids, according to Us Weekly . \nOther Links From TVGuide.com", "external_links": [], "published": "2015-10-19T18:30:00.000+03:00", "crawled": "2015-10-19T18:56:43.562+03:00", "highlightTitle": ""}