{"organizations": [], "uuid": "9b3b0325faa991ee3248a47a6f8ddc0e598ac403", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.recordonline.com", "main_image": "http://www.recordonline.com/storyimage/TH/20151022/ENTERTAINMENTLIFE/151029785/AR/0/AR-151029785.jpg", "site_section": "http://www.recordonline.com/entertainment?template=rss&mime=xml", "section_title": "Entertainment - recordonline.com", "url": "http://www.recordonline.com/article/20151022/ENTERTAINMENTLIFE/151029785/101014/ENTERTAINMENT?rssfeed=true", "country": "US", "title": "Sweet bites and historic bikes", "performance_score": 0, "site": "recordonline.com", "participants_count": 1, "title_full": "Sweet bites and historic bikes", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T17:00:00.000+03:00", "replies_count": 0, "uuid": "9b3b0325faa991ee3248a47a6f8ddc0e598ac403"}, "author": "Beth Kalet Times Herald-Record", "url": "http://www.recordonline.com/article/20151022/ENTERTAINMENTLIFE/151029785/101014/ENTERTAINMENT?rssfeed=true", "ord_in_thread": 0, "title": "Sweet bites and historic bikes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sweet bites and historic bikes Motorcyclepedia Museum hosts Chocolate Expo Comment Posted Oct. 22, 2015 at 9:00 AM By Beth Kalet Posted Oct. 22, 2015 at 9:00 AM \nWhat: The Chocolate Expo \nWhen: Sunday, Oct. 25, from 11 a.m. to 7 p.m. \nWhere: Motorcyclepedia Museum, 250 Lake St., Newburgh, 569-9065, motorcyclepediamuseum.org... » Read more \nWhen: Sunday, Oct. 25, from 11 a.m. to 7 p.m. \nWhere: Motorcyclepedia Museum, 250 Lake St., Newburgh, 569-9065, motorcyclepediamuseum.org \nTickets: $15 adults; $10 children 3-12 \nInfo: thechocolateexpo.com » Social News Chocolate and motorcycles – perfect together! That’s just what Marvin Baum thought when he planned the Chocolate Expo at Motorcyclepedia, the 85,000-sq.-foot museum dedicated to motorcycles in Newburgh. Here, an expansive showroom downstairs offers plenty of space to set up the 60 or so vendor booths, where chocolate will share the stage with a comprehensive collection of motorcycles on two floors. The show will be held from 11 a.m.-7 p.m. Oct. 25. One ticket for the show, at $15 for adults and $10 for children 3-12, gets you into the museum too, so it’s a chance to check out a bike from the JFK Dallas motorcade of 1963, the Indians from 1901-53, bikes from films like “Terminator,”“Tron” and “Ghost Rider” and historic military bikes. But about the chocolate. “This is going to be something that the Hudson Valley has not seen before. It’s the second largest chocolate event in the U.S. at this point,” said Baum, clearly enthusiastic about the rich and varied show he’s putting together. The blend of local vendors (Scotchtown’s Pazdar Winery and its chocolate wine among them) and vendors of chocolate in its many forms from New Jersey, Pennsylvania and New Hampshire, for example, makes for a heady mix. Baum has been producing chocolate expos in cool locations for several years now. A show last winter at an aviation museum in Long Island, held during a snowstorm, drew about 8,600 people, testament to the lure of location and sweets. He expects 5,000-10,000 people to turn out for this weekend’s Expo in Newburgh. Parking will not be a problem, say Baum and Motorcyclepedia Museum owner Ted Doering. At the Chocolate Expo, attendees will have the chance to taste and to purchase gourmet chocolates, baked goods, specialty foods, gelato, cheeses, wines, distilled spirits and much more. Celebrity chefs will give demonstrations. There will be music, wine and lots for chocolate lovers to swoon over, from Belgium waffles prepared by a Belgian restaurateur to gelato, “healthful” chocolate goodies and some that are just plain decadent. For Baum, the selection of Newburgh and Motorcyclepedia Museum makes sense as he continues to expand his Chocolate Expo events around the Northeast in cultural venues from an aquarium to a science center. A Hudson Valley resident himself and the producer of the Woodstock 35th anniversary festival, Baum said he recognizes Newburgh as a special location and one that is already experiencing cultural growth. “I think this is another part of that whole equation that people are discovering that Newburgh has so much to offer, the Hudson Valley has a lot to offer from a food standpoint,” Baum said. Museum owner Doering, a Newburgh native, is more than pleased to have the Expo set in his venue, as he seeks to broaden the reach of the museum, attract more visitors of all ages through educational exhibits and earn the designation of a New York State museum. Chocolate exhibitors Local participants include Oliver Kita Chocolates from Rhinebeck and the Pretzel Princess from Port Jervis, Corbett’s Cookie Bar from Warwick, Drink More Good (sodas) from Beacon, Antonio’s Cupcake Shop from New Windsor, Yankee Folly Cidery of New Paltz, and Pazda. From beyond the Hudson Valley, there will be many gourmet chocolate vendors plus the unusual, such as Bacon Bites’ chocolate-covered bacon, New Orleans style beignets, chocolate-scented bath products from Merriweather’s. No one will go hungry. Ready-to-eat treats range from chocolate fountains to crepes to Brussels sprouts infused with chocolate, which are described as very popular. Local restaurants serving on premise that day include The Wherehouse. Face-painting, balloon twisting and visits from superheroes are on the agenda to entertain the kids. Musical guests Talking Machine will perform between the three chef demos, scheduled throughout the day. By Beth Kalet", "external_links": [], "published": "2015-10-22T17:00:00.000+03:00", "crawled": "2015-10-22T16:43:25.715+03:00", "highlightTitle": ""}