{"organizations": [], "uuid": "02c862d80bdb898daaa2d80c96346b41c2e2de45", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.examiner.com", "main_image": "http://cdn2-b.examiner.com/sites/default/files/styles/image_content_width/hash/2d/d6/2dd6982374e441bde5cac86cfa25a143.JPG?itok=l-_bkxY2", "site_section": "http://www.examiner.com/arts-and-entertainment", "section_title": "Arts &amp; Entertainment | Examiner.com", "url": "http://www.examiner.com/article/gotham-michael-chiklis-discusses-his-new-character-nathaniel-barnes", "country": "US", "title": "'Gotham': Michael Chiklis discusses his new character Nathaniel Barnes", "performance_score": 0, "site": "examiner.com", "participants_count": 1, "title_full": "'Gotham': Michael Chiklis discusses his new character Nathaniel Barnes | Examiner.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T18:01:00.000+02:00", "replies_count": 0, "uuid": "02c862d80bdb898daaa2d80c96346b41c2e2de45"}, "author": "Brittany Frederick", "url": "http://www.examiner.com/article/gotham-michael-chiklis-discusses-his-new-character-nathaniel-barnes", "ord_in_thread": 0, "title": "'Gotham': Michael Chiklis discusses his new character Nathaniel Barnes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Michael Chiklis (right) sits with 'Gotham' producer Bruno Heller at New York Comic Con. Krista Mettler/Exclusive to AXS.com When Michael Chiklis joins a TV show, people notice. FOX 's Gotham has gotten a big boost from casting Chiklis as Gotham City police boss Nathaniel Barnes, a new regular for the DC Comics prequel's second season. The actor sat down with LA Fan Cultures Examiner at New York Comic Con to share a few tidbits about his latest badge-wearing character.\n\"I have a background with comics,\" Chiklis told us. \"I think anything you loved when you're twelve/thirteen/fourteen, those are your formative years. The bands you loved then you will always love them. Even when I moved away from it - you discover girls, you move on - it always holds a place in my heart. It holds a really cool, fun, storytelling arena. Imagination is a lifetime of preparation.\"\nAs such, he didn't have to do much research for joining Gotham other than watching the first season of the series and reading the scripts he was given. But the former Shield and No Ordinary Family star did say that Barnes will work very closely together with main character Detective James Gordon ( Ben McKenzie ) as the situation worsens in Gotham City.\n\"[The season is] called 'Rise of the Villains' and to this point it has been just that,\" he explained. \"The villains have been running amok and they have become so brazen as to come into the precinct and kill my predecessor. So as a counterbalance to this outbreak of crime, I have been sent to clean up Gotham. And to be a mentor to young Jim Gordon and to help him do this.\n\"So I am at once a mentor to him and an antagonist to him,\" he continued, \"because he is through his own frustration and his inability to get his arms around this, he has started to take shortcuts, started to get into the grey areas, starting to break the law in order to enforce it. Which, I'm very familiar with that. This character is very different.\"\nGotham executive producer Bruno Heller praised Chiklis's addition to the series. \"Really, we had to do very little with Michael,\" he said. \"He was such a natural fit to the show when he came on board, and he provided the necessary counterweight that we needed.\n\"Ben is a very strong actor and he's going on this dark journey; you need someone that can hold the scene and leverage against Ben in those scenes to make the show feel balanced. When he came on, things started fitting together. The way it does when it works!\"\nGotham airs Mondays at 10 p.m. ET/PT on FOX.", "external_links": ["http://www.fox.com/gotham"], "published": "2015-10-26T18:01:00.000+02:00", "crawled": "2015-10-26T19:31:35.120+02:00", "highlightTitle": ""}