{"organizations": [], "uuid": "d06381700692de60af3da95707b33b258fe5b700", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.flossmagazine.com", "main_image": "http://i2.wp.com/www.flossmagazine.com/wp-content/uploads/2015/10/Lee-Daniels.jpg?resize=215%2C115", "site_section": "http://www.flossmagazine.com/feed/rss/", "section_title": "FLOSS MAGAZINE | ENTERTAINMENT |FASHION | NEWS | CELEBRITY", "url": "http://www.flossmagazine.com/lee-daniels-casting-characters-for-his-new-tv-show-star/", "country": "US", "title": "Lee Daniels Casting Characters For His New TV Show “Star”", "performance_score": 0, "site": "flossmagazine.com", "participants_count": 1, "title_full": "Lee Daniels Casting Characters For His New TV Show “Star”", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T21:30:00.000+03:00", "replies_count": 0, "uuid": "d06381700692de60af3da95707b33b258fe5b700"}, "author": "Editorial Dept", "url": "http://www.flossmagazine.com/lee-daniels-casting-characters-for-his-new-tv-show-star/", "ord_in_thread": 0, "title": "Lee Daniels Casting Characters For His New TV Show “Star”", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "0 comments \n“Empire” co-creator, Lee Daniels has launched an international casting to find four characters for his upcoming show “ Star.” The pilot for the new music-themed drama which will be filmed in Atlanta, is scheduled to go into production beginning in December. The pilot for the upcoming show “Star”, was greenlighted by 20th Century Fox Television in August, through Lee Daniels’ overall deal with the company. \nWritten, directed and executive-produced by Daniels and co-written/executive produced by Tom Donaghy, Star is set in Atlanta and centers on three girls — one White, one Black and one half White/Half Black — who are coming together to form a band and their rise to the top. It will chronicle the choices with which these artists are faced along the way, while showcasing the allure and heartache of the cut-throat music scene, and exploring cultural themes from a new perspective. \nLee Daniels along with Fox and 20th TV are launching an international casting search for four roles in the pilot, including the three female leads and a half Black-Half Latina transgender actress to play Cotton. \n\nThe descriptions of the roles is as follows: \nSTAR: Character is a Caucasian female, 18 years old (actor must be 18 years of age or over). She’s a tough chick with a badass attitude. \nALEXANDRA: Character is an African-American female, about 20 (actor must be 18 years of age or over). She’s an elegant yet classic beauty. Alexandra wants to put this material world behind her so she can make real, authentic music. \nSIMONE: Character is Half African-American Half Caucasian, Star’s younger sister, 16 years old (actor must be 18 years of age or over). Tragic and adorable. \nCOTTON: Character is a half African-American and half Latina transgender woman with a stunning look, 20 (actor must be 18 years of age or over). She has an especially keen eye for fashion. \n\nIf you’re interested in auditioning for the roles, submission information is available here – http://foxedocs.com/uld/ Related", "external_links": [], "published": "2015-10-21T21:30:00.000+03:00", "crawled": "2015-10-21T22:02:50.268+03:00", "highlightTitle": ""}