{"organizations": [], "uuid": "b270506494bb93d59f36d8ac4d9e1f9501707d38", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "entertainment.suntimes.com", "main_image": "http://entertainment.suntimes.com/wp-content/uploads/2015/10/Cast-of-Treasure-Island.jpg", "site_section": "http://entertainment.suntimes.com/feed/", "section_title": "12Chicago Entertainment - Chicago Sun-Times", "url": "http://entertainment.suntimes.com/stage/lookingglass-theatre-full-tilt-sails-treasure-island/", "country": "US", "title": "Lookingglass Theatre at full tilt as it sails to ‘Treasure Island’", "performance_score": 0, "site": "suntimes.com", "participants_count": 1, "title_full": "Lookingglass Theatre at full tilt as it sails to ‘Treasure Island’", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T01:59:00.000+03:00", "replies_count": 0, "uuid": "b270506494bb93d59f36d8ac4d9e1f9501707d38"}, "author": "Hedy Weiss", "url": "http://entertainment.suntimes.com/stage/lookingglass-theatre-full-tilt-sails-treasure-island/", "ord_in_thread": 0, "title": "Lookingglass Theatre at full tilt as it sails to ‘Treasure Island’", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The cast of the Loookingglas Theatre production of \"Treasure Island.\" (Photo: Liz Lauren) Lookingglass Theatre at full tilt as it sails to ‘Treasure Island’ Hedy Weiss on October 18, 2015 \nWith its gloriously full-sail world premiere production of “Treasure Island,” Lookingglass Theatre has headed out to sea again, riding with abandon on the formidable current generated by its extraordinary staging of “Moby Dick.” Clearly there is something about a shipboard yarn — especially one propelled by a sense of adventure, obsession and moral complexity — that brings out the very best in this company. \n‘TREASURE ISLAND’ Where: Lookingglass Theater at Water Tower Place, 821 N. Michigan Tickets: $55 – $85 theatre.org Run time: 2 hours and 30 minutes, with one intermission \nAlthough Robert Louis Stevenson’s 1883 novel is categorized as a children’s book (and, as the author himself proclaimed, was geared to boys), that ever ingenious adapter-director Mary Zimmerman understands that a strong story full of larger-than-life characters and the quest for filthy lucre has no age barrier. And if it’s narrated by a young boy recounting the life-altering experiences that made him a man — and animated by a ship full of rowdy pirates, plenty of rum and even an engaging parrot — you can hardly lose. \nDesign is invariably a crucial element for Zimmerman, and her collaboration with Todd Rosenthal (and lighting magician TJ Gerckens) is nothing short of sublime here. From the moment audiences enter the theater they are enveloped in the architecture of a massive ship, the Hispaniola, complete with gangplank, ropes, ladders and trap door. The naval life of the British empire is palpable, and thrilling, as is the fact that this ship can be made to truly roll on the waves. \nBest of all, the storytelling is beguiling, and Zimmerman has winningly “impressed” a cast of 14 actors and musicians with terrific personalities, fearless physicality and distinctive faces to portray a mostly scurrilous but sometimes honorable bunch. John Babbo as Jim Hawkins and Lawrence E. DiStasi as Long John Silver in “Treasure Island,” Mary Zimmerman’s production of the Robert Louis Stevenson class now in its world premiere at Lookingglass Theatre. (Photo: Liz Lauren) \nIt all begins in an English seaside village in the mid-1700s, where a young widow and innkeeper, Mrs. Hawkins (the silvery-voiced Kasey Foster, the lucky lone woman in the cast), lives with her son, Jim (a stellar turn by John Babbo, 14, already a veteran of the stage possessed of the charm, voice, looks and technique of a born actor). \nWhen Billy Bones (Christopher Donahue), a tempestuous, drunken buccaneer, staggers into the inn, he offers Jim a bit of cash to keep his eye out for a one-legged seafaring man who covets the contents of his sea chest. (Donahue, sensational as a swarthy pirate, returns later in an impeccable portrayal of the loyal, mild-mannered Redruth, a butler.) \nBefore long, Billy breathes his last, leaving a huge debt at the inn. Jim and his mother unlock his sea chest and find a map of a far-off island which, as they are told by the local physician, Dr. Livesey (Andrew White), is where one Captain Flint, a dead pirate, is said to have buried an immense treasure. In league with the wealthy Squire Trelawney (Matt DeCaro), the decision is made to buy a ship and pursue the treasure, with the experienced Captain Smollett (Philip R. Smith) at the helm, and Jim as cabin boy. Serving as cook will be the wooden-legged Long John Silver (Lawrence E. DeStasi), owner of a most winning parrot (a Blair Thomas puppet creation). John Babbo plays Jim Hawkins in the Lookingglass Theatre world premiere of “Treasure Island.” (Photo: Liz Lauren) \nFrom the very start, the crew feels suspect to Smollett, but he sets out despite his better judgment. And it is not long before Jim overhears plans for a mutiny, informs Smollett and Trelawney, and the decision is made that will get them to the island and enable them to deal with their corrupt crew from there. Of course that is only the start of their troubles, and of Jim’s independent efforts that will find him confronting many ethical dilemmas and growing up far faster than ordinary boys. \nIn addition to the crew — the uniformly excellent Travis Delgado, Anthony Irons, Ariel Shafir and Mathew C. Yee — Jim encounters a comical castaway, Ben Gunn (Steve Pickering in rare form). That ever-winning fiddler, Greg Hirte, along with L.J. Slavin, Yee and Foster, supply the rousing score composed by Andre Pluess. And Ana Kuzmanic’s costumes (notably Billy Bones’ tattered green greatcoat) are priceless in every detail. \nSail away!", "external_links": [], "published": "2015-10-19T01:59:00.000+03:00", "crawled": "2015-10-19T04:15:28.292+03:00", "highlightTitle": ""}