{"organizations": [], "uuid": "ba57960afedc4626ed48596f01e5406434269dff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.businesswire.com", "main_image": "", "site_section": "http://feed.businesswire.com/rss/home/?rss=G1QFDERJXkJeGFNVWA==", "section_title": "Business Wire Entertainment: Casino/Gaming News", "url": "http://www.businesswire.com/news/home/20151023006014/en/Viejas-Casino-Resort-Opening-Luxury-Hotel-Tower", "country": "US", "title": "Viejas Casino & Resort Opening Their Second Luxury Hotel Tower", "performance_score": 0, "site": "businesswire.com", "participants_count": 0, "title_full": "Viejas Casino & Resort Opening Their Second Luxury Hotel Tower", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T03:01:00.000+03:00", "replies_count": 0, "uuid": "ba57960afedc4626ed48596f01e5406434269dff"}, "author": "", "url": "http://www.businesswire.com/news/home/20151023006014/en/Viejas-Casino-Resort-Opening-Luxury-Hotel-Tower", "ord_in_thread": 0, "title": "Viejas Casino & Resort Opening Their Second Luxury Hotel Tower", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Viejas Casino & Resort Opening Their Second Luxury Hotel Tower October 23, 2015 08:01   \nSAN DIEGO- Viejas Casino & Resort will be officially opening their second luxury hotel tower on Friday, October 30, 2015. Thousands will be in attendance for the grand opening ceremony for the new five-story tower. Separated by the hotel pool area and the Park at Viejas––a designated space for concerts and special events––the new hotel tower stands near its perfect partner, Viejas’ first hotel tower, which opened in spring of 2013. \nThe new $50 million hotel tower will feature 109 deluxe rooms and luxury suites, a fitness center and business center, a spacious bar and lounge, and nine state-of-the-art meeting spaces including the Oak Ballroom, accommodating up to 1,200 attendees for events. This expansion creates an additional 50,000 square feet of indoor and outdoor multifunction resort space, and will increase current hotel accommodations to a total of 237 rooms and suites. \n“Our new hotel tower and casino expansion raises the bar for our guests and delivers an experience that’s unmatched in the San Diego area,” commented Viejas Tribal Chairman Robert Welch. \nThe grand opening celebration will include a thrilling tightrope performance by Tino Wallenda of the world-famous Flying Wallendas. Mr. Wallenda will walk the distance between both hotel towers on a tightrope suspended five stories high. Test drives of Viejas’ featured Dream Machine , the Aston Martin Vantage GT, will also be conducted throughout the evening. The events will conclude with a spectacular fireworks display and exclusive tours of the new hotel tower. \nViejas General Manager Chris Kelley commented, “This dream became a reality through the steadfast contributions of hundreds of skilled workers and dedicated team members. It is an accomplishment for which we can all be proud.” \nThe opening of the second Viejas Hotel Tower will be the crowning achievement in a year-long development project that includes the addition of 1,000 all new slot machines. The expanded casino floor opened on October 9, 2015. \nAbout Viejas Casino & Resort \nLocated at I-8 and Willows Road east of San Diego, the AAA Four Diamond Viejas Casino & Resort features world-class gaming with thousands of slot machines, exciting table games that include Blackjack, Baccarat, and Pai Gow, a modern and elegant bingo room, and an off-track betting facility. Viejas Casino & Resort also features a variety of restaurants including the AAA Four Diamond Grove Steakhouse, The Buffet, and The Café. \nThe beautiful Viejas Outlets, located across the street from the casino, offers visitors a unique shopping experience with highly acclaimed stores, numerous eateries, Viejas Bowl, and Southern California’s largest outdoor ice rink. Viejas Hotel will feature 203 luxury rooms and 34 VIP suites, including a lush, spacious pool and lounge area, and nine indoor-outdoor meeting spaces, including the magnificent Oak Ballroom. \nFor more information, visit www.viejas.com or call 1-800-847-6537. Contacts", "external_links": [], "published": "2015-10-24T03:01:00.000+03:00", "crawled": "2015-10-24T11:00:10.172+03:00", "highlightTitle": ""}