{"organizations": [], "uuid": "20b4a5449bfb5b2310a56a4bf48d26795f5f9d23", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.philly.com", "main_image": "http://media.philly.com/images/natllampoondoc768.jpg", "site_section": "http://www.philly.com/philly_entertainment.rss", "section_title": "Philly.com Entertainment", "url": "http://www.philly.com/philly/entertainment/20151009_Review__National_Lampoon_s_story_told_in__Drunk_Stoned_Brilliant_Dead_.html", "country": "US", "title": "Review: National Lampoon's story told in 'Drunk Stoned Brilliant Dead'", "performance_score": 0, "site": "philly.com", "participants_count": 0, "title_full": "Review: National Lampoon's story told in 'Drunk Stoned Brilliant Dead'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T00:13:00.000+03:00", "replies_count": 0, "uuid": "20b4a5449bfb5b2310a56a4bf48d26795f5f9d23"}, "author": "", "url": "http://www.philly.com/philly/entertainment/20151009_Review__National_Lampoon_s_story_told_in__Drunk_Stoned_Brilliant_Dead_.html", "ord_in_thread": 0, "title": "Review: National Lampoon's story told in 'Drunk Stoned Brilliant Dead'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Molly Eichel"], "text": "Molly Eichel, Inquirer Staff Writer Posted: Friday, October 9, 2015, 3:01 AM \nIn the opening salvos of Drunk Stoned Brilliant Dead: The Story of the National Lampoon , contributors from far and wide sing National Lampoon's praises. Meatloaf, a contributor, says the brand was so intellectual that Tennessee Williams and Arthur Miller could have been a part of the staff. \n\"Breasts,\" says Kevin Bacon, who got his breakout role as ROTC suck-up Chip Diller in National Lampoon's Animal House . \"I would try to seek out the magazine on the off-chance that there would be some breasts.\" \nBoth Meatloaf and Bacon - what a pair! - have valid points. \nDrunk Stoned Brilliant Dead is a survey of the best and brightest years of the National Lampoon, the monthly magazine that was birthed by Harvard Lampoon alumni Doug Kenney, Henry Beard, and Rob Hoffman, along with publisher Matty Simmons. \nThe humor magazine was known for pushing boundaries. It's impossible to the forget its most famous cover: a man holds a gun to a dog's head, with the headline, \"If you don't buy this magazine, we'll kill this dog.\" The magazine was smart and funny, but also inherently salacious and purposefully button-pushing (but then again, what great satire isn't?). \n\"Doug did the dirty stuff, Henry did the brainy stuff, [founding writer Michael O'Donoghue] did the outrageous, the really transgressive stuff,\" said contributor Ellis Weiner about the balance of power that made the Lampoon what it was. \nDouglas Tirola's film brings in an array of voices - from director Judd Apatow to former contributors like Tony Hendra and Chevy Chase. In this profile of a humor publication, it certainly helps that most of the commentators are quite funny. Chase is particularly candid, belying the difficult reputation he's earned since his time on Saturday Night Live . \nBut what makes Drunk Stoned Brilliant Dead feel particularly vibrant is how the Lampoon's specific art direction is put to use. Indelible images from the magazine become animated and alive, used to tell the story of the Lampoon just as much as they once were used to bolster Lampoon stories during its heyday. \nTirola's goal is to canonize the Lampoon, meaning potential depth is lost. Female voices are present, but few and far between. Contributors defend claims about racism. Sometimes, great satire must offend to be truly great satire - but no one addresses the lack of people of color on the masthead (or in the documentary, for that matter). \nPerhaps the greatest missed opportunity, though, is that Drunk Stoned Brilliant Dead never addresses the Lampoon brand's downfall and potential resurgence. What started with Animal House and Vacation later put out bargain-bin fratboy trash like Van Wilder: The Rise of Taj and The Legend of Awesomest Maximus . But a reboot of the Vacation series (notably missing the National Lampoon brand before the title) did well enough at the box office. But the doc extends only to the end of the first generation of the magazine. \n\"It went downhill from there,\" Matty Simmons says as the story wraps up, \"and I'll end it on that note.\"", "external_links": [], "published": "2015-10-09T00:13:00.000+03:00", "crawled": "2015-10-09T00:58:11.124+03:00", "highlightTitle": ""}