{"organizations": [], "uuid": "db33c70ddb0cf035f5fa95a7de8478f946681c62", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.india.com", "main_image": "http://s3.india.com/wp-content/uploads/2015/10/sf-1.jpg", "site_section": "http://www.india.com/feed/", "section_title": "India | Latest India News | Get Free India.com Email | Live Cricket and Entertainment News at India.Com", "url": "http://www.india.com/showbiz/bigg-boss-9-contestants-which-is-the-hottest-jodi-in-the-house-622288/", "country": "US", "title": "Bigg Boss 9 contestants: Which is the hottest jodi in the house?", "performance_score": 0, "site": "india.com", "participants_count": 1, "title_full": "Bigg Boss 9 contestants: Which is the hottest jodi in the house?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T23:24:00.000+03:00", "replies_count": 0, "uuid": "db33c70ddb0cf035f5fa95a7de8478f946681c62"}, "author": "Maggie Davis", "url": "http://www.india.com/showbiz/bigg-boss-9-contestants-which-is-the-hottest-jodi-in-the-house-622288/", "ord_in_thread": 0, "title": "Bigg Boss 9 contestants: Which is the hottest jodi in the house?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bigg Boss 9 contestants: Which is the hottest jodi in the house? By Maggie Davis on October 12, 2015 at 1:54 AM Comments The biggest and the most dramatic show of the season Bigg Boss Nau has finally been aired on Colors channel. There must be no other reality show that the audiences might be desperately waiting for in the entire year. The most favourite person of the show is none other than the host himself – Salman Khan. He made such a dhamakedaar entry with some sizzling performances with his favourite girls – Elli Avram and Daisy Shah. As this year’s theme is ‘Double Trouble’, Salman entered with the girls who by default showed some trouble. This year there is going to be lot of trouble for the contestants as they are paired with unexpected or even unknown people. As you all the know contestants and the jodis’ by now, it is time to vote for the hottest jodi in the house. So let’s a take a quick recap of all the jodis’ in the house. Roopal Tyagi and Digangana Suryavanshi These two ladies might have some trouble amongst themselves. Roopal is sounded pretty confident and matured whereas Digangana was a completed barbie doll type. Now that childish attitude would be tolerated or not by Roopal, we will get to know in the coming episode. (ALSO READ: Bigg Boss 9 Jodi Roopal Tyagi and Digangana Suryavanshi: One is Rebellious and other is Princess) Aman Verma and Kishwar Merchant The cool and calm Aman shouldn’t forget that he has been paired up with the lady (Kishwar) who has an over protective boyfriend (Suyyash Rai) who is also present in Bigg Boss 9 house. Aman and Kishwar look very thanda thanda types of contestants but you never know; when the time comes these two might just show their hot and bold avatar. (ALSO READ: Bigg Boss 9 Jodi Aman Verma and Kishwar Merchant: Two popular faces of small screen industry are together) Suyyash Rai and Rimi Sen The Punjabi munda Suyyash has been paired with Bong beauty and B-town actress Rimi Sen. Hope she does not create a magic that affects Suyyash and Kishwar’s relationship. The duo are happy been paired with one another. Let’s see till what extent they successfully bare each other. (ALSO READ: Bigg Boss 9 Jodi Suyyash Rai and Rimi Sen: Punjabi munda and Bong beauty look great together!) Rochelle Maria Rao and Prince Narula Without any doubt, Rochelle and Prince do look one of the hottest pairs in the Bigg Boss 9 house. But again, charming and flirty Prince should not forget that Rochelle is already in a relationship. But the over confident Punjabi munda cannot take his eyes off the beauty. Is Keith already jealous? (ALSO READ:Bigg Boss 9 Jodi Rochelle Maria Rao and Prince Narula: Prince finally gets his Princess) \nYuvika Choudhary and Vikas Bhalla She was seen in Farah Khan’s popular film Om Shanti Om and he has been the quintessential good looking boy on the small screen. Together they look oh-so-cute. Both are polite, soft-spoken and charming. They truly make for a fine jodi. Will the two lose their collective cool in the glass walled house only time and India.com will tell! (ALSO READ: Vikas Bhalla Bigg Boss 9 contestant: The actor singer looks polite and genuine!) Mandana Karimi and Keith Sequiera The Goan dude has been a popular RJ, VJ, model and actor. She is a fine blend of western zing and desi tadka. Together they look fabulous. Looks like nobody wanted to be seen opposite Prince Narula and the tall lady after measuring the long and small of it finally chose Keith over everyone else! (ALSO READ: Keith Sequeira Bigg Boss 9 contestant: Meet the popular RJ, VJ, actor and Model!) Arvind Vegda and Ankit Gera Here’s a toast for the only ‘dostana’ in the house. Just when Ankit was acting Ultra-cool with his ‘multiple’ options, Sallu paired him up with singer Arvind. This jodi rocks in the truest sense of the word for the obvious reason, wink! (ALSO READ: Ankit Gera Bigg Boss 9 contestant: Meet the hot boy of the season?) It’s time to know who is your most favourite jodi in Bigg Boss 9 house. Do let us know your views in the comments below. \n  12, 2015 1:54 AM Topics:", "external_links": [], "published": "2015-10-11T23:24:00.000+03:00", "crawled": "2015-10-11T23:55:48.727+03:00", "highlightTitle": ""}