{"organizations": [], "uuid": "97415e7cb64dfcbb8380804b24696bd96f678c8c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stalbansreview.co.uk", "main_image": "http://www.stalbansreview.co.uk/resources/images/4004147/", "site_section": "http://www.stalbansreview.co.uk/uk_national_entertainment/rss/", "section_title": "St Albans & Harpenden Review | National Entertainment News", "url": "http://www.stalbansreview.co.uk/uk_national_entertainment/13889759.Sam_Smith_is_ready_to_be_a__spokesman__for_gay_men___and_change_minds_through_music/?ref=rss", "country": "GB", "title": "Sam Smith is ready to be a 'spokesman' for gay men - and change minds through music", "performance_score": 0, "site": "stalbansreview.co.uk", "participants_count": 0, "title_full": "Sam Smith is ready to be a 'spokesman' for gay men - and change minds through music", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T16:35:00.000+03:00", "replies_count": 0, "uuid": "97415e7cb64dfcbb8380804b24696bd96f678c8c"}, "author": "", "url": "http://www.stalbansreview.co.uk/uk_national_entertainment/13889759.Sam_Smith_is_ready_to_be_a__spokesman__for_gay_men___and_change_minds_through_music/?ref=rss", "ord_in_thread": 0, "title": "Sam Smith is ready to be a 'spokesman' for gay men - and change minds through music", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Sam Smith"], "text": "Sam Smith is ready to be a 'spokesman' for gay men - and change minds through music Sam Smith is ready to be a 'spokesman' for gay men - and change minds through music \nPress Association 2014 / / National Entertainment News Share \nSam Smith is ready to be seen as a “spokesman” for gay men – and hopes to change homophobes’ opinions through his music. \nIn 2014 he said he wanted to be more than a “spokesperson for the gay community”– but now has revealed his stance has changed. \nHe told NME magazine: “I want to be a spokesperson. I want to be a figure in the gay community, who speaks for gay men. I sell records in countries where gay men get killed and that’s a big thing for me, because maybe one person in that country will pick up my album, realise it’s by a gay artist, and it might change their opinion.” Sam Smith (Powers Imagery/Invision) \nThe 23-year-old singer explained: “I’m a gay man who came out when I was 10 years old, and there’s nothing in my life that I’m prouder of. \n“What I was trying to say was that I didn’t want the album to appeal to just one community, I wanted it to appeal to all of them. I wanted anyone, gay or straight, to be able to relate to me singing about men, like I was able to relate to Stevie Wonder or John Legend singing about girls.” \nSam may have written the soundtrack to Spectre, Writing’s On The Wall, but he admitted the film’s star Daniel Craig is not his favourite 007. Promoted stories \nHe said the actor was initially his favourite: “I hadn’t seen all the old movies, and I loved how modern his take on Bond was.” \nHowever, he added: “But when I went back and watched them all, I realised that it’s (Sean) Connery and (Roger) Moore who I love the most. I love how classy and clean-cut they are. I think I’d like the next Bond to be more of a return to that.” \nSmith’s debut album In The Lonely Hour has become synonymous with sadness, with hits including Stay With Me and I’m Not The Only One. \n“I’ve had an amazing life, but I think I was born with a little bit of sadness in me,” he said. “I’ve always been attracted to those things, whether it’s sad movies, sad music … when you’re sad, you feel everything in a greater way than you do when you’re happy. \n“I’m a vulnerable, sensitive person. I overthink everything. I’m insanely self-conscious about my body, about my music, about everything in my life, and that self-consciousness is what’s keeping my feet on the ground at the moment.” Share article \nHe added: “If I didn’t have it, I’d become a bit of a p***k. I’m thankful for my sadness.” Promoted Stories", "external_links": [], "published": "2015-10-22T16:35:00.000+03:00", "crawled": "2015-10-22T17:38:20.418+03:00", "highlightTitle": ""}