{"organizations": [], "uuid": "f24d3ef7acd164de98d1b84043ebcadb8a514d08", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/285254/entertainment-art", "section_title": "Entertainment - Art - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30162017/the-annual-photography-showcase-comes-to-the-studio620-in-st-petersburg-fl-october-16-17th", "country": "US", "title": "The Annual Photography Showcase Comes to the Studio@620 in St Petersburg FL October 16-17th", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "The Annual Photography Showcase Comes to the Studio@620 in St Petersburg FL October 16-17th - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T18:02:00.000+03:00", "replies_count": 0, "uuid": "f24d3ef7acd164de98d1b84043ebcadb8a514d08"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30162017/the-annual-photography-showcase-comes-to-the-studio620-in-st-petersburg-fl-october-16-17th", "ord_in_thread": 0, "title": "The Annual Photography Showcase Comes to the Studio@620 in St Petersburg FL October 16-17th", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "\nTampa, FL -- ( ReleaseWire ) -- 10/01/2015 -- The United Photographic Artists Gallery is holding their annual Photography Showcase exposition in St Petersburg, Florida on October 16th and 17th 2015, showcasing over 24 national and international fine art photography artists at the studio 620 location.\nAdmission is free and the gallery hours are 5-9 p.m. on both Friday October 16th and Saturday October 17th. Studio@620 is located at 620 First Avenue South St. Petersburg FL 33701.??\nWith over 80 selected photographic artworks, this presentation fulfills the United Photographic Artists core mission of supporting the advancement and representation of emerging artists, through an exclusive gallery of limited edition photographic works. UPAG supports the education, income, and creative progress of emerging artists via an internet-based format as well as on ground seminars and gallery openings.??\nThe high quality and variety of the works presented will firmly support the many emerging and established artists we are privileged to support, with some artworks exclusively presented and sold during the show. Many of the artists have received prestigious international awards and have their work collected and in permanent collections.\nFeatured artists include: Scott Bolendz, Pierre-Yves Chicoineau, Erik Cocks, Kat Cunningham, Guillermo De Angelis, Cathy Dutertre, Pierre Dutertre, Lisa Fitch, Joel Geffen, Christine Ghezzo, William Glover, Jose Gomez, Paul Haffenden, Eric Lawson, Maria Chapin, David Monroe, Ruiz B Mozi, Frank Novatsky, Muffy Sadler, Trentin Shreeve, Matt Smith, Ron Weiss, Lindsey Welch, Brady Wilks.\nAbout United Photographic Artists Gallery\nThe United Photographic Artists Gallery, L.L.C. ( http://www.upagallery.com ) is the intellectual and practical collaboration of five emerging artists in the medium of photography, each with very diverse cultural and generational backgrounds.\nWe are fully engaged artists, versed in the fine art world and dedicated to the excellence of the medium. Our mission is to grow the medium of photography as an overall validated art form and to support other emerging artists in their artistic endeavors with a solid track record in photographic education (fine art and commercial genres), consulting on many levels, international judging backgrounds and curatorial duties, the founding members of UPAG are committed to supporting our members through dialogues and consultations, the end goal residing firmly into a positive and progressive outlook for all involved.\nUnited Photographic Artists Gallery works are highly sought, with offerings in limited quantities.Created by creative professionals, for the discerning eye of the of those that seek to possess the exclusive and the extraordinary.\nAbout Studio@620\nThe Studio @ 620 ( http://www.thestudioat620.org ) is the brainchild of Artistic Directors David Ellis and Bob Devin Jones along with a host of hard working board members, volunteers, patrons, and visionaries. The idea grew out a core belief that art and diversity play a crucial role in the lives of individuals and communities.\nThe primary goal of The Studio@620 is to:\n- Provide a place where people can experience artistic and educational programs in innovative ways.\n- Bring people from diverse cultural backgrounds and experiences together as artists, audiences and volunteers.\n- Work collaboratively with artistic, educational, and cultural organizations in and beyond our community.\n- Develop artistic and educational programs that integrate a variety of art forms in order to encourage new cultural experiences both for the audience and the artists.\nMore Information on the October 16 & 17th Annual Photography Showcase:\nVisit www.upagallery.com or call 813-431-0440 to learn more about the Annual Photography Showcase.\n releases/the-annual-photography-showcase-comes-to-the-studio620-in-st-petersburg-fl-october-16-17th-629628.htm\n Pierre Dutertre\nTelephone: 813-431-0440\n Pierre Dutertre\nWeb: http://www.upagallery.com/\n ", "external_links": ["http://www.upagallery.com/", "http://www.releasewire.com/press-releases/the-annual-photography-showcase-comes-to-the-studio620-in-st-petersburg-fl-october-16-17th-629628.htm?utm_source=worldnow&utm_medium=feed&utm_campaign=distribution", "http://www.releasewire.com/press-releases/the-annual-photography-showcase-comes-to-the-studio620-in-st-petersburg-fl-october-16-17th-629628.htm", "http://www.thestudioat620.org/events/annual-photography-showcase", "http://www.releasewire.com/?utm_source=worldnow&utm_medium=feed&utm_campaign=distribution", "http://www.releasewire.com/press-releases/contact/629628?utm_source=worldnow&utm_medium=feed&utm_campaign=distribution"], "published": "2015-10-01T18:02:00.000+03:00", "crawled": "2015-10-01T17:54:48.634+03:00", "highlightTitle": ""}