{"organizations": [], "uuid": "b21713151d6fb6f61b72bd5e7dd1e75d3ff0e4f9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nydailynews.com", "main_image": "http://assets.nydailynews.com/polopoly_fs/1.2381682!/img/httpImage/image.jpg_gen/derivatives/landscape_1200/social-network.jpg", "site_section": "http://www.nydailynews.com/entertainment/index.html", "section_title": "Entertainment News &amp; Reviews - NY Daily News", "url": "http://www.nydailynews.com/entertainment/social-network-stars-article-1.2381683", "country": "US", "title": "Where are \"The Social Network\" stars now?", "performance_score": 0, "site": "nydailynews.com", "participants_count": 1, "title_full": "Where are \"The Social Network\" stars now? - NY Daily News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "b21713151d6fb6f61b72bd5e7dd1e75d3ff0e4f9"}, "author": "NEW YORK DAILY NEWS", "url": "http://www.nydailynews.com/entertainment/social-network-stars-article-1.2381683", "ord_in_thread": 0, "title": "Where are \"The Social Network\" stars now?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Social Network.\" Andrew Garfield, Joseph Mazzello, Jesse Eisenberg and Patrick Maple in \"The Social Network.\" Where are the stars from the movie that millions of moviegoers clicked \"like\" on five years ago?\n\"The Social Network,\" the David Fincher-directed and Aaron Sorkin-scripted story of the founding of Facebook, poked its way into film fans' hearts, becoming a massive success.\nThursday is the five-year anniversary of the film's premiere. The movie wowed critics and audiences alike, earning over $200 million at the box office and winning three of the eight Academy Awards it was nominated for.\nHow have the film's stars and creators progressed ever since? Here's a snapshot of just some of them.\nJesse Eisenberg Jesse Eisenberg in \"The Social Network.\" People were mesmerized by Eisenberg's performance as Facebook Founder Mark Zuckerberg, and received Golden Globe and Oscar nominations for the role.\nSince then, Eisenberg has not quite been the leading man everyone expected, but has continued to topline mostly critically acclaimed films like \"Zombieland,\" \"Now You See Me,\" and \"The End of the Tour.\"\nThat said, he'll likely return to big box office hits with his role as Lex Luthor in the upcoming \"Batman v. Superman: Dawn of Justice.\" Of course, Lex Luther after portraying the \"Social Network\" version of Zuckerberg won't be a stretch.\nAndrew Garfield Merrick Morton Andrew Garfield and Jesse Eisenberg in \"The Social Network.\" Perhaps the real breakout star of \"The Social Network\" was the virtually unknown Garfield, who's performance as Eduardo Saverin won him a Golden Globe nomination.\nGarfield has become a leading man (with a somewhat controversial run as Spiderman under his belt) but also has made interesting choices, including a run in \"Death of a Salesman\" on Broadway.\nArmie Hammer Hammer was predicted to go far following his villainous turn as the Winklevoss twins, but he's become somewhat known for big budget box office flops.\nSince \"The Social Network,\" Hammer has starred in a mixed bag containing \"J. Edgar,\" \"The Lone Ranger,\" \"The Man from U.N.C.L.E.\" and \"Entourage.\"\nJustin Timberlake Merrick Morton/©Columbia Pictures/courtesy Ever Justin Timberlake and Jesse Eisenberg in \"The Social Network.\" Right around this time was when Timberlake was starting to make a push for \"serious actor\" status, with much talk of him possibly receiving an Oscar nomination for his scene-stealing role as Sean Parker.\nHowever, the pop superstar was mostly left out of the awards haul for the film. He's done fine since, with two more platinum albums and star turns in films like \"Friends with Benefits\" and \"Inside Llewyn Davis.\"\nRooney Mara Mara only makes a brief but impactful appearance in the film as Erica Albright, but she's since gone on to stardom in films like Fincher's \"The Girl with the Dragon Tattoo,\" \"Her\" and \"Side Effects.\"\nAaron Sorkin It's been an odd few years for the writer who won an Oscar for his adaptation of \"The Accidental Billionaires\" by Ben Mezrich.\nSorkin won another Oscar nomination the following year for his adaptation of \"Moneyball,\" but then followed it up with the mostly critically reviled HBO series \"The Newsroom.\"\nHe appears headed for a comeback, however, with an adaptation of the book \"Steve Jobs\" by Walter Isaacson receiving rave early reviews.\nDavid Fincher Fincher's \"Girl with the Dragon Tattoo\" the very next year was a box office smash and critically acclaimed, but the sequels to the other books in the series were never produced.\nThe director also won an Emmy for helming two episodes of \"House of Cards\" and was nominated for a Golden Globe for the blockbuster \"Gone Girl\" in 2014.\nBest of the rest The movie also features a couple of actors who would become more famous as the years went on.\n\"Parks and Recreation\" star Rashida Jones has a supporting role as one of the lawyers litigating Zuckerberg's case against Saverin, and future \"Fifty Shades of Grey\" star Dakota Johnson makes her film debut in a key scene.", "external_links": [], "published": "2015-10-02T03:00:00.000+03:00", "crawled": "2015-10-02T00:03:37.072+03:00", "highlightTitle": ""}