{"organizations": [], "uuid": "576b1270a538ca9953557f20f8e2a0979bfcab8c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/49332279.cms", "site_section": "http://timesofindia.indiatimes.com/entertainment/kannada/movies/news/articlelist/12245853.cms", "section_title": "News - Movies - Kannada - Entertainment - The Times of India", "url": "http://timesofindia.indiatimes.com/entertainment/kannada/movies/news/Puneeth-Rajkumar-Fahadh-Faasil-in-Gautham-Menon-film/articleshow/49332181.cms", "country": "IL", "title": "Puneeth Rajkumar, Fahadh Faasil in Gautham Menon film", "performance_score": 0, "site": "indiatimes.com", "participants_count": 3, "title_full": "Puneeth Rajkumar, Fahadh Faasil in Gautham Menon film - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T17:54:00.000+03:00", "replies_count": 2, "uuid": "576b1270a538ca9953557f20f8e2a0979bfcab8c"}, "author": "timesofindia.indiatimes.com", "url": "http://timesofindia.indiatimes.com/entertainment/kannada/movies/news/Puneeth-Rajkumar-Fahadh-Faasil-in-Gautham-Menon-film/articleshow/49332181.cms", "ord_in_thread": 0, "title": "Puneeth Rajkumar, Fahadh Faasil in Gautham Menon film", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Filmmaker Gautham Vasudev Menon is on the brink of wrapping up his Tamil-Telugu bilingual film Achcham Yenbadhu Madamaiyada with Simbu and Naga Chaitanya. Next, he plans to start a multilingual project with Kannada superstar Puneeth Rajkumar along with Fahadh Faasil and two other popular stars from Telugu and Tamil industries. According to a source close to the Minnnale director, he's been in talks with Puneeth for the project for nearly two years now and he's glad that it's finally materialising. \"Puneeth met Gautham while working on the 7up campaign and he expressed his interest to work with him. This happened a few years ago but both of them have been in touch since then,\" the source told Mirror.\nFahadh, too, has been interested to work with Gautham and, although they had planned to collaborate in the past, things never fell in place. Having got used to making films in multiple languages, Gautham realised he could work with Puneeth and Fahadh in the same project instead of wasting time on two projects. \"Besides Puneeth and Fahadh, he also plans to rope in Simbu and Allu Arjun for the project that's likely to be made in three or more languages,\" the source added. While Gautham plans to pro duce the Tamil and Malayalam version, Puneeth may bankroll the film in Kannada.\nAnother leading producer may come on board for the Telugu version. Gautham hopes to rope in A R Rahman for this project but he's yet to meet the Oscar winning composer.\nGautham also has a film with Ram Charan in the offing. This project will only go on the floors in June next year after the completion of the Telugu remake of Thani Oruvan, which will feature Charan in the lead. \"Since Gautham has about five months before he gets to work with Ram Charan, he hopes to start his multilingual project and, if it doesn't take off right away, he'll try and make Ram Charan also part of the project,\" the source added.\n— Haricharan Stay updated on the go with Times of India News App. Click here to download it for your device.", "external_links": ["https://play.google.com/store/apps/details?id=com.toi.reader.activities"], "published": "2015-10-13T17:54:00.000+03:00", "crawled": "2015-10-13T19:11:01.252+03:00", "highlightTitle": ""}