{"organizations": [], "uuid": "987af26b8069aead5737ae6423d9c8f4f6224333", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.morningsun.net", "main_image": "http://www.morningsun.net/storyimage/KM/20151022/NEWS/151029961/AR/0/AR-151029961.jpg", "site_section": "http://www.morningsun.net/entertainment?template=rss&mime=xml", "section_title": "Entertainment - Morning Sun", "url": "http://www.morningsun.net/article/20151022/NEWS/151029961/2052/ENTERTAINMENT?rssfeed=true", "country": "US", "title": "The Farr Side: With her latest, Demi Lovato is becoming ‘Confident’", "performance_score": 0, "site": "morningsun.net", "participants_count": 1, "title_full": "The Farr Side: With her latest, Demi Lovato is becoming ‘Confident’", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T17:49:00.000+03:00", "replies_count": 0, "uuid": "987af26b8069aead5737ae6423d9c8f4f6224333"}, "author": "David T. Farr More Content Now", "url": "http://www.morningsun.net/article/20151022/NEWS/151029961/2052/ENTERTAINMENT?rssfeed=true", "ord_in_thread": 0, "title": "The Farr Side: With her latest, Demi Lovato is becoming ‘Confident’", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted Oct. 22, 2015 at 9:49 AM By David T. FarrMore Content Now Posted Oct. 22, 2015 at 9:49 AM Demi Lovato may have been cool for the summer, but she’s extremely confident we’re finally going to see her as the pop star she has so desperately wanted to be. Lovato’s latest album, “Confident,”is her fifth studio album and perhaps will move her into the spotlight. Until now, her music hadn’t truly struck a chord with me. I could take her or leave her, the music just didn’t go anywhere for me. It might be that she tried too hard to make herself believable, only adding to the manufactured mix. The single “Cool For The Summer” was different. I heard the song and didn’t even realize it was her. It was strong, direct, and her vocals blared as if she were singing from a bullhorn. “Confident” is an appropriate title for where her career is. She no longer needs to appeal only to teeny-boppers. Now she can make music that doesn’t have to pigeonhole her into one demographic. The title track is the second single from the new album, which boasts 11 strong radio-friendly songs. “Confident,” the song,” carries the same boldness that sold “Cool For The Summer” to me. Where did this incredible voice come from? Lovato has always sported a big mouth. Cases in point: her previous hits “Skyscraper,”“Give Your Heart A Break” and “Heart Attack.” But there’s a certain, well, confidence, to her vocal styling not heard before now. Thankfully, it’s present throughout the album. “Waitin For You” is a sure-fire single-worthy track in which Lovato sings, “Knuckles out and a guard in my mouth/When you’re hungry for the next round/I’ll be waitin for ya!” Add a ring and bring on Ronda Rousey and we just might have a fight Rousey can’t win. “Old Ways,” Lionheart” and “Stone Cold” are equally good, as is the pairing of Lovato with rapper Iggy Azalea on “Kingdom Come.” I know Iggy hast some haters, but I find her artistic angst refreshing compared to that of Nicki Minaj. Lovato was right to work with Iggy here. Lovato can definitely sing and sing hard, but it’s encouraging to know she can tone it down a notch or two and carry a ballad better than most of her contemporaries. “For You” is a nice attempt at a love song. Lovato seems sincere in her delivery. Page 2 of 2 - The album closes with the best song of her career thus far: “Father” is a beautiful, gospel-tinged ballad in which Lovato sings in tribute to her late dad. “Father” illustrates another level of confidence in Lovato, too — songwriting. The lyricism is so powerful that you can feel the hurt she has held in for years, as she sings, “Father, I’m gonna say thank you/Even if I’m still hurt/Oh, I’m gonna say bless you/I wanna mean those words.” This will be the song to turn heads of other artists and finally see her as legit. “I know you were a troubled man/I know you never got the chance/To be yourself, To be your best/I hope that heaven’s giving you, a second chance …” How many of us have felt this way about someone and never knew how to put it into words? “Father” is perfect “10.” Contact David T. Farr at farrboy@hotmail.com. By David T. Farr", "external_links": [], "published": "2015-10-22T17:49:00.000+03:00", "crawled": "2015-10-22T18:07:46.436+03:00", "highlightTitle": ""}