{"organizations": [], "uuid": "92c34ebee1f89df203c16b16c4b55112cd677d82", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pe.com", "main_image": "http://www.pe.com/images/logo.gif", "site_section": "http://www.pe.com/", "section_title": "Press Enterprise : Riverside County California News, Sports and Entertainment", "url": "http://www.pe.com/articles/city-784040-budget-hemet.html", "country": "US", "title": "EDITORIAL: Discipline improves Hemet's fiscal forecast", "performance_score": 0, "site": "pe.com", "participants_count": 1, "title_full": "EDITORIAL: Discipline improves Hemet's fiscal forecast - Press Enterprise", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "92c34ebee1f89df203c16b16c4b55112cd677d82"}, "author": "The Press-Enterprise", "url": "http://www.pe.com/articles/city-784040-budget-hemet.html", "ord_in_thread": 0, "title": "EDITORIAL: Discipline improves Hemet's fiscal forecast", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "PRESS-ENTERPRISE EDITORIAL\nPublished: Oct. 21, 2015 Updated: 10:54 p.m. Hemet might be able to balance its budget by 2020, in large part thanks to much needed fiscal discipline in the city. It’s a lesson other municipalities in the region should take note of.\nLast week, the City Council was presented with a five-year budget projection showing significant curtailments in Hemet’s long-running budget deficits. Under the projection, the city is expected to balance its budget in fiscal year 2019-20. “This is bare bones,” interim City Manager Gary Thornhill told the council. “I would recommend you adhere to this five-year plan.”\nOne of the most significant developments was cost reductions in retiree health benefits for the 239 former city workers paid by Hemet. The high health care costs threatened to bankrupt the city. Last month, the council approved a plan to offer beneficiaries cash incentives to switch to less expensive plans. The switch may save the city up to $13 million over the next five years.\nReining in retiree health benefits, known as other post-employment benefits, or OPEBs, is something any jurisdiction with them can and should do. This is true at the state and local levels, with such benefits ballooning in recent years. Alongside pensions, the benefits can contribute significantly to crowding-out spending on actual services.\nAs for Hemet, the “bare bones” budget projection assumes a lot, including steady revenue growth and no cost increases for staffing except for pensions. “Given the information currently available, a fully balanced budget will likely be achieved in the next five years without impacting current levels of service provided to the community,” reported Mr. Thornhill and Deputy City Manager Jessica Hurst.\nWhether or not the city can stick to the plan remains to be seen. As positive a development as this new projection is, the city still can benefit from reexamining how it does business. As Councilwoman Shellie Milne told us, the city needs to take an entrepreneurial approach. Hemet might be able to project a balanced budget now, but the same may not be true going forward. Nor is it necessarily the case that service levels are optimal.\nThe city recently squandered $40,000 to hire a consulting firm that specializes in helping governments raise taxes, highlighting a status quo far from desirable.\nTo its credit, Hemet did the right thing in addressing its OPEB burden, something other governments should do. But the city should remain critical of how it does things.\nWRITE A LETTER TO THE EDITOR: Letters to the Editor: E-mail to letters@pe.com . Please provide your name, city and telephone number (telephone numbers will not be published). Letters of about 200 words will be given preference. Letters will be edited for length, grammar and clarity.", "external_links": ["http://letters.ocregister.com/2010/10/27/calling-all-pundits-join-the-flip-cam-sensation/"], "published": "2015-10-21T03:00:00.000+03:00", "crawled": "2015-10-22T12:27:50.063+03:00", "highlightTitle": ""}