{"organizations": [], "uuid": "74579cb6cb5fcbfae1013a685afaa369d81c30b0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.india.com", "main_image": "http://s3.india.com/wp-content/uploads/2015/10/devendra-fadnavis.jpg", "site_section": "http://www.india.com/feed/", "section_title": "India | Latest India News | Get Free India.com Email | Live Cricket and Entertainment News at India.Com", "url": "http://www.india.com/news/india/ncp-asks-devendra-fadnavis-if-crime-ridden-nagpur-is-his-idea-of-smart-city-603991/", "country": "US", "title": "NCP asks Devendra Fadnavis if crime-ridden Nagpur is his idea of smart city", "performance_score": 0, "site": "india.com", "participants_count": 1, "title_full": "NCP asks Devendra Fadnavis if crime-ridden Nagpur is his idea of smart city", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T18:20:00.000+03:00", "replies_count": 0, "uuid": "74579cb6cb5fcbfae1013a685afaa369d81c30b0"}, "author": "Wires English | Press Trust of India", "url": "http://www.india.com/news/india/ncp-asks-devendra-fadnavis-if-crime-ridden-nagpur-is-his-idea-of-smart-city-603991/", "ord_in_thread": 0, "title": "NCP asks Devendra Fadnavis if crime-ridden Nagpur is his idea of smart city", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments Mumbai, Oct 5: The Nationalist Congress Party (NCP) took a swipe at Maharashtra Chief Minister Devendra Fadnavis here today and questioned if his hometown Nagpur which is a hotbed of criminal activities is his idea of a “smart city”. The development comes after Fadnavis spoke about his vision of smart cities and “safe cities” at a public meeting yesterday ahead of the Kalyan Dombivali Municipal corporation (KDMC) polls scheduled next month. Talking to reporters, NCP spokesman Nawab Malik said that Fadnavis must clarify if Nagpur, which is a hotbed of criminal activities is his concept of a “safe city”. ”Nagpur witnesses murders, dacoities, atrocities against women and Dalits on a daily basis. If Nagpur is a safe city, then people of Kalyan-Dombivali should think twice and not accept leaders who advocate such kind of safe cities,” Malik said. He said that the local unit of the NCP will file a complaint against Fadnavis for violating the poll code by announcing a Rs 6500-crore package for KDMC during his speech yesterday. (Also Read: Car-Free Day: Elected govt doesn’t need police nod for event, says transport Minister Gopal Rai) Malik condemned the Raj Thackeray-led Maharashtra Navnirman Sena (MNS) for protesting against prime time shows of Gujarati films at movie halls, saying that the MNS began its political career by targeting non-Maharashtrians. “Now apart from Marathi votes, they are also looking for notes (money) from Gujaratis,” he said. Malik also criticised the BJP for launching a Bhim Rath Yatra procession. ”The BJP is known to fool people. A few years ago, they had organised a Ram Rath Yatra,” he said, adding that it is the Congress-NCP government which sanctioned construction of an Ambedkar memorial on Indu Mills land. ”Now the BJP has planned a bhoomipujan and a public meeting in Mumbai with an eye on the Bihar polls. Bhim Rath is also another ploy to fool voters. BJP has no love or respect for Ambedkar and so the party’s gameplan should be foiled,” he said. \n  8:50 PM Topics:", "external_links": [], "published": "2015-10-05T18:20:00.000+03:00", "crawled": "2015-10-05T19:20:21.105+03:00", "highlightTitle": ""}