{"organizations": [], "uuid": "c341bd4791e20db57db2974fd6d26ed097f03201", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reviewjournal.com", "main_image": "http://www.reviewjournal.com/sites/default/files/field/media/1003744743%2520ROUTE91_10021%252318_1.jpg", "site_section": "http://feeds.feedburner.com/Reviewjournalcom-Neon", "section_title": "Entertainment", "url": "http://www.reviewjournal.com/entertainment/country-fest-kicks-little-breeze-and-lot-beer", "country": "US", "title": "Country fest kicks off with a little breeze and a lot of beer", "performance_score": 0, "site": "reviewjournal.com", "participants_count": 1, "title_full": "Country fest kicks off with a little breeze and a lot of beer | Las Vegas Review-Journal", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T23:03:00.000+03:00", "replies_count": 0, "uuid": "c341bd4791e20db57db2974fd6d26ed097f03201"}, "author": "Mike Weatherford", "url": "http://www.reviewjournal.com/entertainment/country-fest-kicks-little-breeze-and-lot-beer", "ord_in_thread": 0, "title": "Country fest kicks off with a little breeze and a lot of beer", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "\"Country music looks pretty good from where I stand,\" Frankie Ballard proclaimed.\nAnd why wouldn't it? It was not yet 5:30 p.m., and from his main-stage perch, the second year of the Route 91 Harvest festival was already filling up with its sold-out crowd, and already trying to do right by the title of Ballard's \"Sunshine & Whiskey\" album.\n\"I always wanted to play the pyramids,\" Ballard said, a nod to the Luxor on the other side of the Strip. A nice breeze spread the barbecue smells, and strategic shade — thank you, Delano — helped those who opted out of the cowgirl's preferred choice of shade, the cowboy hat.\nAnd in between the hat and boots?\n\"They always wear their shorts a little shorter here in Las Vegas,\" Ballard announced.\nBallard was one of the seven main-stage acts kicking off the three-day country festival at the MGM Resorts Village across from the Luxor. Florida Georgia Line headlined Friday, followed by Keith Urban today and Tim McGraw on Sunday.\nLocals who decided to wait for good weather or ticket discounts missed the party this year. Route 91 declared a three-day sell-out even before the gates opened Friday.\n\"This might be the most people I've ever seen in my entire life,\" said Thomas Rhett, whose set led up to Florida Georgia Line.\nBy then, the evening had turned into that perfect Las Vegas night the festival's promoter, Brian O'Connell, had hoped for when he timed the festival to the belief that,\"psychologically\" at least, \"people turn Vegas back on October 1st.\"\nWhile the outdoor site can host about 25,000 per day, most attendees will be there more than one day. No single-day tickets were sold, only three-day wristbands.\nBut locals hadn't responded in big numbers anyway. O'Connell, the president of country touring for promoter Live Nation, said only about 5 percent of sales were in the Las Vegas market (though it sure sounded like the city was better represented when Rhett polled the crowd and asked how many of the fans were from Las Vegas).\nFive perent would be analogous to the Electric Daisy Carnival in its first year or two, though last weekend's Life Is Beautiful festival promoters said about half of its 102,000 was local.\n\"It's a destination festival,\" O'Connell said. Fans \"want the experience of coming to Las Vegas with their buddies.\"\nLive Nation also promoted Route 91 at other country festivals it produced this summer, including July's Watershed Festival in Washington, which also featured Florida Georgia Line and a half dozen of this weekend's lower-billed acts.\nLast year's debut festival averaged closer to 20,000 people each day.\n\"We had 100 days from the first phone call to the last downbeat to create Route 91,\" O'Connell says. \"And we did it, which was just insane.\"\nThat said, \"We screwed a bunch of stuff up last year and learned from it, and worked all year to fix it,\" he adds.\nChanges range from big and noticeable — such as moving the main stage out of a corner and \"squaring it up\" — to expanded amenities for premium VIP-ticket buyers.\nBetween the two years of Route 91, Rock in Rio debuted last May on MGM Resorts' other new festival site, at the intersecton of the Strip and Sahara Avenue. That one is 40 acres compared with the Village site's 15 and will host the Academy of Country Music's \"Party for a Cause\" April 1-3 with Dierks Bentley, Kenny Chesney and Carrie Underwood.\nBut local procrastinators shouldn't assume the festival will move up the street next year.\n\"I'm about quality, not necessarily quantity,\" O'Connell says. \"We'll see what happens. Never say never, but this site feels right to me. ... I don't care about being the biggest and all that. I want to be the best.\"\nOpening day was a tutorial on how country reached the place where Rhett could follow the slinky Bee Gees-style '70s funk of his \"Make Me Wanna\" with a full-on cover of Mark Ronson and Bruno Mars' \"Uptown Funk.\" Merle Haggard would only smile at the sight of the shirtless guy in the cowboy hat and red bandanna dancing to House of Pain's \"Jump Around\" as part of the anything-but-country mix played between sets.\nAs the beer lines grew in anticipation of Florida Georgia Line and A Thousand Horses coaxed the crowd to get \"Trailer Trashed,\" the down-bill acts paid tribute to their influences and traced the history back.\nEaston Corbin, a singer on the balance more mellow than the evening's general drift, teased the crowd with Metallica and Michael Jackson riffs but eventually settled on a cover of Toby Keith's breakthrough hit \"Should've Been a Cowboy.\"\nTaylor Swift has her \"1989\" album, but the 32-year-old Ballard had 1969, covering Johnny Cash's \"A Boy Named Sue.\" And 1973, too, with the guitar boogie of ZZ Top's \"La Grange.\"\nNot 10 minutes before the Cash cover, Ruthie Collins — a singer born in Swift's same year of 1989 — covered John Denver's 1971 hit, \"Take Me Home, Country Roads,\" in the Next From Nashville tent for up-and-coming acts on the far opposite side of the main stage.\nA Thousand Horses covered \"Hard to Handle,\" known to both Otis Redding and Black Crowes fans, while back in the Next tent, Haley & Michaels brought it up to 1988 with The Proclaimers' \"500 Miles.\"\nThat's country in 2015, or at least the blacktop country version of it at the Village.\n— Read more from Mike Weatherford at reviewjournal.com. Contact him at mweatherford@reviewjournal.com . Follow him@Mikeweatherford . \nPitbull attends charter...   Comment section guidelines The below comment section contains thoughts and opinions from users that in no way represent the views of the Las Vegas Review-Journal or GateHouse Media. This public platform is intended to provide a forum for users of reviewjournal.com to share ideas, express thoughtful opinions and carry the conversation beyond the article. Users must follow the guidelines under our Commenting Policy and are encouraged to use the moderation tools to help maintain civility and keep discussions on topic.\n ", "external_links": [], "published": "2015-10-02T23:03:00.000+03:00", "crawled": "2015-10-04T02:45:26.988+03:00", "highlightTitle": ""}