{"organizations": [], "uuid": "8d770ff4f0dc46965e6a414e1e1be5eb8e13fdbc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.detroitnews.com", "main_image": "http://www.gannett-cdn.com/-mm-/588657bc0ae5b481bf3a6b634def8772251a233c/c=2-0-798-448&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/01/DetroitNews/B99309387Z.1_20151001204957_000_GBEJNR51.1-0.jpg", "site_section": "https://feeds.feedblitz.com/detroit/entertainment#", "section_title": "Detroit News - Entertainment", "url": "http://www.detroitnews.com/story/entertainment/movies/2015/10/02/movie-review-tom-long-bloody-christmas-movie-halloween/73179648/", "country": "US", "title": "Movie review: A bloody Christmas movie just in time for Halloween", "performance_score": 0, "site": "detroitnews.com", "participants_count": 1, "title_full": "Movie review: A bloody Christmas movie just in time for Halloween", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:11:00.000+03:00", "replies_count": 0, "uuid": "8d770ff4f0dc46965e6a414e1e1be5eb8e13fdbc"}, "author": "detroitnews.com", "url": "http://www.detroitnews.com/story/entertainment/movies/2015/10/02/movie-review-tom-long-bloody-christmas-movie-halloween/73179648/", "ord_in_thread": 0, "title": "Movie review: A bloody Christmas movie just in time for Halloween", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "George Buza stars as Santa in “A Christmas Horror Story.” (Photo: RLJ Entertainment) \nCONNECT TWEET LINKEDIN COMMENT EMAIL MORE Santa’s doing battle with his elves, all of whom have turned into bloodthirsty zombies.\nA suburban family is on the run through a snowy forest, hunted by a merciless monster.\nTeens working on a video project are trapped in a dark basement haunted by a ghost.\nAnd a mother and father are slowly realizing that their little boy is some kind of demon.\nMerry Christmas!\n“A Christmas Horror Story” may be a cheesy horror movie, but you have to give it points for originality and energy. It runs four separate story lines alongside one another, each containing some genuinely spooky moments. With three credited directors — Grant Harvey, Steven Hoban and Brett Sullivan — and five writers you get the idea people broke off into teams to do each of the stories and then re-assembled and edited the pieces together.\nThe only name actor involved in the movie, William Shatner, serves as a fifth component, playing an aging deejay working on Christmas Eve, spinning Christmas classics while drinking spiked eggnog. At first, he doesn’t seem associated with anything going on, but a reveal is waiting.\nMost of the action takes place around a town called Bailey Down. Two teens were murdered in the school basement there last Christmas Eve. So, of course, this year three more teens decide to do a video about the murders. Returning to the scene of the crime, they somehow get locked in. Cue bad things.\nOut in the country, the cop who discovered the dead teens is trespassing on land to cut down a free Christmas tree. His boy goes missing for a bit, and when he’s found, something’s changed. A few hours away, another family from Bailey Down has gotten stranded and is staggering toward civilization when it comes under attack.\nAnd then there’s Santa, slicing and dicing mad-eyed, foul-mouthed elves. Ho-ho-ho.\nThose acquainted with (or fans of) low-budget horror will find some ingenuity here, although the quality of the separate stories varies (Santa’s is the best, and the bloodiest). Considering it’s a crass film timed for the Halloween crowd, “A Christmas Horror Story” is pretty much as horrible as it’s supposed to be.\ntlong@detroitnews.com \ntwitter.com/toomuchTomLong \n\n‘A Christmas Horror Story’ \nGRADE: C+ \nNot rated\nRunning time: 99 minutes", "external_links": [], "published": "2015-10-02T03:11:00.000+03:00", "crawled": "2015-10-02T07:23:28.499+03:00", "highlightTitle": ""}