{"organizations": [], "uuid": "aa3a9f8beb6840995b7dda86f44cffb1de94b2d4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.aceshowbiz.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Aceshowbizcom-EntertainmentNews\r", "section_title": "Aceshowbiz.com - Entertainment News", "url": "http://www.aceshowbiz.com/news/view/00089636.html", "country": "US", "title": "'Dancing with the Stars': Alexa Vega Gets Perfect Score in Switch-Up Week", "performance_score": 0, "site": "aceshowbiz.com", "participants_count": 1, "title_full": "'Dancing with the Stars': Alexa Vega Gets Perfect Score in Switch-Up Week", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T07:22:00.000+03:00", "replies_count": 0, "uuid": "aa3a9f8beb6840995b7dda86f44cffb1de94b2d4"}, "author": "AceShowbiz.com", "url": "http://www.aceshowbiz.com/news/view/00089636.html", "ord_in_thread": 0, "title": "'Dancing with the Stars': Alexa Vega Gets Perfect Score in Switch-Up Week", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments Alexa's husband Carlos Pena Jr. trails close behind her with 39 points for his quickstep, as Bindi Irwin wows everyone with her cha cha. \nMaksim Chmerkovskiy returned to \" Dancing with the Stars \" as a judge on Monday, October 12. He joined Bruno Tonioli, Carrie Ann Inaba and Julianne Hough to comment on the contestants' dances in the Switch-Up episode, in which the remaining celebrities and professional dancers switched partners. Tamar Braxton was the first to perform that night, dancing a samba with Louis Van Amstel. Louis came up with a rough routine that mixed fast and slow movements, and it was hard for Tamar. The judges pointed out the lack of connection between the two. Tamar earned 29 out of 40 points. Hayes Grier was paired with Allison Holker. They danced a Viennese waltz. It was fun to watch, but Bruno said it was too \"jumpy\" and \"kangarooish.\" Maksim agreed with Bruno, adding that \"there was not enough Viennese Waltz.\" Carrie Ann and Julianne, on the other hand, liked it more than the male judges. The YouTube personality earned 30 points. Paula Deen danced a jive with Mark Ballas. He played a milk delivery boy, with the celebrity chef playing a saucy housewife. \"You are a naughty silver fox, that was your best dance ever,\" Carrie Ann gushed. The judges liked it that it was fun, though the technique wasn't great. They scored the dance 26. Alek Skarlatos, who broke his nose during rehearsals on Monday morning, danced a steamy rumba with Emma Slater. The judges wanted him to show emotion with his face. Maksim, being honest, said he didn't think Alek would win at first, but now considered him a dark horse. Alek earned 29 points. Bindi Irwin later raised the bar with her cha cha with Val Chmerkovskiy. She showed her best performance so far as Carrie Ann said, \"You took yourself to a whole new level tonight.\" Bruno told her to watch her shoulders. She earned 37 points. Carlos Pena Jr., paired with Lindsay Arnold, danced a quickstep that's full of energy. Bruno liked it that it was so energetic, while Carrie Ann said, \"To me it doesn't get any better than that.\" Maksim called it \"amazing.\" The judges scored the danced 39. Carlos' high score was later surpassed by his wife Alexa Vega , who earned the first perfect score of the season (40) for her tango with Derek Hough . Carrie Ann gave a standing ovation as Bruno declared, \"It was a victory!\" Andy Grammer danced a sexy Argentine tango with Sharna Burgess. Maksim praised Sharna for her choreography that had a lot of value. Bruno noticed there was a few footwork issues, but Carrie Ann noted that he did better than last week. Andy earned 36 points. Nick Carter , paired with Witney Carson, danced a paso doble for the last performance of the night. Maks called the boybander \"a great performer,\" but the dance was \"not my cup of tea.\" The judges liked it, but Julianne thought it \"went too far.\" Nick earned 35 points. There's no elimination in this week's episode. The scores and votes of the last two weeks will be combined to determine who will be sent home next week. \n© AceShowbiz.com", "external_links": [], "published": "2015-10-13T07:22:00.000+03:00", "crawled": "2015-10-13T10:11:13.175+03:00", "highlightTitle": ""}