{"organizations": [], "uuid": "d748b13b2381ee84bfe1dd62406e2ef616438092", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.newsday.com", "main_image": "http://cdn.newsday.com/polopoly_fs/1.10682370.1438042742!/httpImage/image.JPG_gen/derivatives/display_600/image.JPG", "site_section": "http://www.newsday.com/entertainment/movies", "section_title": "Movies - Newsday - Entertainment News, Movie Reviews, &amp; Trailers | Newsday", "url": "http://www.newsday.com/entertainment/celebrities/matt-lauer-seeks-delay-in-decision-on-tree-planting-plan-at-his-water-mill-horse-farm-1.10989044", "country": "US", "title": "Matt Lauer seeks delay in decision on tree-planting plan at his Water Mill horse farm", "performance_score": 0, "site": "newsday.com", "participants_count": 4, "title_full": "Matt Lauer seeks delay in decision on tree-planting plan at his Water Mill horse farm | Newsday", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T06:32:00.000+03:00", "replies_count": 3, "uuid": "d748b13b2381ee84bfe1dd62406e2ef616438092"}, "author": "LISA IRIZARRY", "url": "http://www.newsday.com/entertainment/celebrities/matt-lauer-seeks-delay-in-decision-on-tree-planting-plan-at-his-water-mill-horse-farm-1.10989044", "ord_in_thread": 0, "title": "Matt Lauer seeks delay in decision on tree-planting plan at his Water Mill horse farm", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "\"Today\" show host Matt Lauer has asked the Southampton Town planning board to delay a decision on his proposal to plant dozens of trees and shrubs at his Water Mill horse farm.\nThe deadline for planning board members to make a decision in the dispute between Lauer and a neighbor who is fighting the plan is expected to be extended until at least next month.\nMost popular 'Star Wars' characters: Best, worst, in between LI's DeLorean doctors celebrate car 'Tidal X' brings Nicki Minaj, Usher to Barclays Springsteen's 'Born to Run' home for sale What to read this week Southampton Town Planner Claire Vail said in a telephone interview Monday that Lauer asked for a postponement of the decision. She said the deadline is expected to be extended to Nov. 19.\nStory Lawyer: Lauer sees neighbor's LI pool as 'dangerous risk' Story Hearing set on Lauer's plan for Hamptons farm Story Lauer draws ire of Hamptons neighbor Neither Lauer nor his attorney could be reached for comment Tuesday.\nDuring the summer, Lauer submitted a proposal to plant 42 trees and dozens of shrubs on his 40-acre Bright Side Farm to protect the horses from being startled by activities and noise around the swimming pool of his neighbors, Jack and Jodi Wasserman.\nThe Wassermans are fighting the plan, saying trees would block their view of Lauer's bucolic farm and violate restrictions on the property.\nThe Wassermans' attorney, Patrick Fife of Riverhead, said Monday that he would have a comment only when a decision is made.\nAccording to Vail, Lauer asked for an extension so he could \"work on a new plan in terms of landscaping that will address a lot of concerns.\"\nReal Estate 10 highest-taxed Hamptons homes A source added the two sides have been talking with each other in recent weeks.\nTweets from @Newsday/newsday-entertainment Lauer has said there is a \"dangerous risk\" to riders and horses because part of the farm's horse trail is near the pool and backyard of the Wassermans' house on Farrell Court, and that noise from people using that pool can spook horses on the trail.\nLauer's original plan called for 42 trees ranging from 6 feet to 18 feet tall, and 194 shrubs to be planted along the north boundary of his property, with the majority being placed along the perimeter of the Wassermans' property.\nFife has said the problem is of Lauer's own creation.\n\"The Wassermans' pool and backyard existed before the Lauers built out their horse farm and trail, and the Lauers nevertheless decided to place part of their trail right alongside the Wassermans' property,\" Fife said in July.\nReal Estate The most expensive houses for sale in Suffolk In addition, Fife said the planting of large trees would violate the site plan and other restrictions on the property, \"all of which strictly prohibit landscaping on the farm that would obstruct its open views.\"\n ", "external_links": ["https://twitter.com/Newsday/newsday-entertainment"], "published": "2015-10-21T06:32:00.000+03:00", "crawled": "2015-10-21T16:35:16.654+03:00", "highlightTitle": ""}