{"organizations": [], "uuid": "c948a4b8e9f0851fd391ecc63b1d2bf4ef93f4aa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.heraldscotland.com", "main_image": "http://www.heraldscotland.com/resources/images/sitelogo/", "site_section": "http://www.heraldscotland.com/arts_ents/", "section_title": "Arts and Entertainment | Herald Scotland", "url": "http://www.heraldscotland.com/arts_ents/13834474.Glasgow_Americana_review__Bruce_Cockburn_at_St_Andrew___s_in_the_Square__Glasgow/", "country": "GB", "title": "Glasgow Americana review: Bruce Cockburn at St Andrew’s in the Square, Glasgow", "performance_score": 0, "site": "heraldscotland.com", "participants_count": 1, "title_full": "Glasgow Americana review: Bruce Cockburn at St Andrew’s in the Square, Glasgow (From Herald Scotland)", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T19:12:00.000+03:00", "replies_count": 0, "uuid": "c948a4b8e9f0851fd391ecc63b1d2bf4ef93f4aa"}, "author": "Rob Adams", "url": "http://www.heraldscotland.com/arts_ents/13834474.Glasgow_Americana_review__Bruce_Cockburn_at_St_Andrew___s_in_the_Square__Glasgow/", "ord_in_thread": 0, "title": "Glasgow Americana review: Bruce Cockburn at St Andrew’s in the Square, Glasgow", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Glasgow Americana\nBruce Cockburn\nSt Andrew’s in the Square, Glasgow\nRob Adams\nFOUR STARS\nGlasgow Americana 2015’s train made its first stop in Canada with the now seventy years old Bruce Cockburn. I mention his age because, while Cockburn has the air of a bespectacled senior professor, he has the fingers and musical spirit of a much younger, if experienced guitar man. In a snapshot of his art you’d find a mixture of erudition and six- and twelve-string locomotion that, against all the odds, makes a line such as “thousand-year-old petroglyphs doing a double take” rock.\nCockburn hasn’t added many songs to his canon in recent years because his writing time has been taken up by a “spiritual memoir” (no, he didn’t know what his publishers meant either) but the one new item he shared, Jesus Train, continued very much in the above style with a superb guitar accompaniment that suggested a Hammond organ and soul-jazz tenor sax combo rather than a twelve string acoustic at work.\nShare article The shortage of new material wasn’t a problem for the audience as fans want to hear their favourites and Cockburn’s performing style, especially on guitar, can refresh the familiar, although he did seem to slip off the pace a bit towards the interval, introducing wind effects and a slight ponderousness compared to a near unimpeachable opening sequence that included the suitably travelling Night Train, a hypnotic Mango and the sinister Lovers in a Dangerous Time.\nHis second half, a momentary late slip on guitar aside, was a masterly clear run, though, with his voice carrying authority and the audience’s participation in Wondering Where the Lions Are re-emphasising Cockburn’s ability to make serious environmental and political statements entirely singable.", "external_links": ["https://twitter.com/share?url=", "https://www.facebook.com/sharer/sharer.php?u="], "published": "2015-10-08T19:12:00.000+03:00", "crawled": "2015-10-08T19:12:35.124+03:00", "highlightTitle": ""}