{"organizations": [], "uuid": "97afc204648ba905fc06b657aecdce2702ad40fe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://images.canberratimes.com.au/2015/10/08/6909791/Thumbnail1001132269gjzo6fimage.related.thumbnail.320x214.gk1qlp.png1444357658273.jpg.jpg", "site_section": "http://feeds.canberratimes.com.au/rssheadlines/entertainment.xml#", "section_title": "Canberra Times Entertainment Headlines", "url": "http://www.canberratimes.com.au/entertainment/movies/the-dressmaker-author-rosalie-hams-surreal-moment-as-her-book-becomes-a-movie-20151008-gk1qlp.html", "country": "AU", "title": "The Dressmaker author Rosalie Ham's surreal moment as her book becomes a movie", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "The Dressmaker author Rosalie Ham's surreal moment as her book becomes a movie", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T15:45:00.000+03:00", "replies_count": 0, "uuid": "97afc204648ba905fc06b657aecdce2702ad40fe"}, "author": "canberratimes.com.au", "url": "http://www.canberratimes.com.au/entertainment/movies/the-dressmaker-author-rosalie-hams-surreal-moment-as-her-book-becomes-a-movie-20151008-gk1qlp.html", "ord_in_thread": 0, "title": "The Dressmaker author Rosalie Ham's surreal moment as her book becomes a movie", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play video Return to video Video settings Please Log in to update your video settings\nVideo will begin in 5 seconds.\nDon't play Play now More video Recommended Replay video Return to video Video settings Please Log in to update your video settings\nTrailer: The Dressmaker Small town girl, Tilly (Kate Winslet) returns from international adventures to reconcile with her mother and set chins wagging.\nPT2M11S http://www.canberratimes.com.au/action/externalEmbeddedPlayer?id=d-405po 620 349 July 30, 2015 Autoplay On Off Video feedback Video settings Sarah Snook in The Dressmaker We were on the penultimate hole of our Friday morning golf game when Sue Maslin told me Kate Winslet would play the lead role in the film adaption of my first novel, The Dressmaker .\nSue and I went to school together and I knew her as a tenacious, and somewhat formidable, golf partner and a very fine film producer.\nRosalie Ham: \"Film is another medium so it can't be my novel but what I intended has been made to work for film.\" Photo: Supplied \nShe's brought us Japanese Story and Road to Nhill and was working hard producing The Dressmaker; Jocelyn Moorhouse had written the adaptation and would direct, and there was interest from investors and filmmakers locally and internationally.\nAdvertisement But, Kate Winslet? It was a task to focus on the small white ball and the final fairway, but there were more surreal experiences ahead.\nThe first was sitting in the extras tent for hair and makeup and seeing myself reflected as my mother in 1950.\nThe town of Dungatar, as created in The Dressmaker . Photo: Supplied \nThen there was the friends and family (mostly farmers and nurses) as extras 'acting' in crowd scenes behind Shane Jacobson, Gyton Grantley, Sarah Snook and Sacha Horler.\nMy brother looked just like my father in 1950.\nThen I stepped off a bus into Dungatar, the town I created in the novel, and shook hands with Mad Molly (Judy Davis) and Muriel Pratt (Rebecca Gibney).\nA new edition of Rosalie Ham's novel has been released to coincide with the film. \nI danced with Sergeant Farrat (Hugo Weaving), was cuddled by Kate Winslet and kissed by Liam Hemsworth.\nAs a writer you want readers to know the intention behind the words, the tension between the small black dots on the page and the meaning, but sitting on set, looking through Mad Molly's window at Tilly and Molly Dunnage playing the subtext of a scene I had written years prior was chilling, and brilliant.\nAnd then I saw my story in technicolour on a huge screen in a cinema with an audience who responded truthfully – that is, emotionally.\nFilm is another medium so it can't be my novel but what I intended has been made to work for film, for an audience to see rather than to read.\nIt's a terrific film and a remarkable thing that Sue, Jocelyn, Don McAlpine, the costumiers and other artists have created.\nAs the film nears release the surreal experiences continue – try the red carpet at the Toronto International Film Festival.\nIt's just like it is on the telly, only from the other side.\nNone of those fans are screaming our names, the walls of photographers don't point their lenses at us, it's the stars they call for, the actors who make the story live.\nAnd the actors create a red carpet spectacle to bring the audience to the film (advertising).\nStanding in a club in Toronto at the after party, still wondering at the standing ovation from 2000 people, I thought about my mother, and my father, and how I was in that room with all those clever (or just plain enthusiastic) people because of them, and also because of the cast and crew in the room, and it occurred to me that we were all there because of a story I'd written as part of a writing course.\nSurreal.\nThe Dressmaker opens in cinemas on October 29.", "external_links": [], "published": "2015-10-09T15:45:00.000+03:00", "crawled": "2015-10-09T07:46:48.283+03:00", "highlightTitle": ""}