{"organizations": [], "uuid": "3f8f2a26281db3b15484404defc81cab379d5a92", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mercurynews.com", "main_image": "http://extras.mnginteractive.com/live/media/site568/2015/1021/20151021__salm1023halloween~2.JPG", "site_section": "http://feeds.mercurynews.com/mngi/rss/CustomRssServlet/568/200733.xml", "section_title": "Entertainment", "url": "http://www.mercurynews.com/entertainment/ci_29004784/halloween-san-jose-is-about-more-than-just?source=rss", "country": "IL", "title": "Halloween in San Jose is about more than just trick-or-treating", "performance_score": 0, "site": "mercurynews.com", "participants_count": 1, "title_full": "Halloween in San Jose is about more than just trick-or-treating", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T22:39:00.000+03:00", "replies_count": 0, "uuid": "3f8f2a26281db3b15484404defc81cab379d5a92"}, "author": "Anne Gelhaus\n\nagelhaus@community-newspapers.com", "url": "http://www.mercurynews.com/entertainment/ci_29004784/halloween-san-jose-is-about-more-than-just?source=rss", "ord_in_thread": 0, "title": "Halloween in San Jose is about more than just trick-or-treating", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "4 » For scoring the most treats with the fewest tricks, San Jose ranks second in the nation. Or so say the folks at the real estate website Zillow.com , who ranked the best cities in which to trick-or-treat based on their potential to score gobs of candy in a safe, walkable environment (San Francisco was ranked No. 1). Zillow further broke down its rankings by neighborhood, naming Cambrian Park the best area of San Jose to let your little ones loose on All Hallow's Eve. Almaden Valley, Willow Glen, Blossom Valley and the Rose Garden were ranked second to fifth, in that order. (photo Jacqueline Ramseyer/Bay Area News Group/October 31, 2012) Astronaut Nathan Watson, then 3, was all smiles during the Trick or Treat on Lincoln Avenue on Halloween back in 2012. This year's event will be held on Friday, Oct. 30--11am-12:30pm for babies and toddlers; 3pm-4:30pm for school-aged children. ( Jacqueline Ramseyer ) \nAll these neighborhoods offer a lot more for Halloween than the opportunity for kids to fill their plastic pumpkins with the best goodies in the least amount of time. Many events around this increasingly popular holiday are designed to appeal to trick-or-treaters of all ages and tastes, including furry, four-legged friends. Events in this round-up are free unless otherwise noted. Trunk-or-treating Diving into a car trunk full of candy is no doubt the dream of many a child, and churches throughout San Jose are making that dream come true. Besides providing a safe community trick-or-treating experience, trunk-or-treating lets those who help hand out the candy dress up their cars as well as themselves. Advertisement \nTrinity Presbyterian Church at 3151 Union Ave. is getting a jump on things with an Oct. 24 trunk-or-treat event from 6 to 8 p.m., with food, games, cake walks, costumes and decorated car trunks. \nOn Halloween itself, resourceful trunk-or-treaters can hop from Westminster Presbyterian's event, which runs 3:30-5:30 p.m. at 1100 Shasta Ave., to Bethel Church at 1201 S. Winchester Blvd., where candy will be handed out from 5 to 7 p.m. Scary(ish) Movies Candy aside, some folks enjoy Halloween for the opportunity to scare and be scared. To that end, a couple of local businesses are screening movies that won't leave audiences booing. \nOrchard Supply Hardware, at 720 W. San Carlos St., is hosting a Monster Mania Double Feature on Oct. 29 at 7 p.m. in the store's parking lot. OSH is going back to the 1930s, when the store first opened, and showing the original \"Frankenstein\" and \"Dracula.\" \nThe Willow Glen Funeral Home at 1039 Lincoln Ave. is opting for family-friendly fare on Oct. 30, with a 6 p.m. screening of \"Alvin and the Chipmunks Halloween Collection.\" \nAll children must be accompanied by an adult, costumes are encouraged and RSVPs to 408.295.6446 are appreciated. (photo Jacqueline Ramseyer/Bay Area News Group/October 27, 2012) Wonder Woman Lora Schraft holds Superman \"Schnitzel\" at Gussied Up Dog Boutique's pet costume parade back in 2012. This year there will be two pet costume events on Lincoln Avenue--a costume contest held by Unleashed on Sat. Oct. 24 between 2-4pm and Gussied Up's 12th Annual Doggie Social and Costume Parade being held on Sun. Oct. 24 from 5pm-6:30pm. Doggie Dress-up Dogs like their treats just as much as their owners do, and come Halloween, they're willing to go the extra sartorial mile if there are biscuits involved. San Jose pooches will have several opportunities to show off their Halloween costumes in the coming week. \nOn Oct. 24 the Friends of Butcher Dog Park are holding a costume parade for the park's furry patrons. Starting at 10 a.m. at 1782 Lancaster Drive, the event will also feature dog nail trimming, dog accessories and fun activities. Friends of Butcher Dog Park T-shirts will be on sale, with all proceeds going toward park improvements. \nIn Willow Glen that same afternoon, Unleashed is holding a Halloween Pet Costume Contest from 2 to 4 p.m. at its store at 1155 Lincoln Ave. Costumes will be judged and prizes awarded based on creativity, originality, attention to detail and expression of the pet's personality. \nKeep that costume handy because Gussied Up is holding its 12th annual Trick or Treat for Dogs on Oct. 25, 5-6:30 p.m. along Lincoln Avenue. Billed as a \"doggie social and costume parade,\" the event is sponsored by City Councilman Pierluigi Oliverio's office and organized by the Silicon Valley Pet Project. The Running Dead It doesn't take a lot of brains to realize that zombies are a pop culture phenom, and Dream Team Events is staging its third annual 5K Zombie Run on Oct. 24 for those who want to shamble through a race like the undead. Before runners--and Walkers--line up for the 10 a.m. start at Kelley Park, located at 1300 Senter Road, they can avail themselves of a zombie make-up artist, who may be able to help them up their chances of winning the \"Worst-Dressed Zombie\" contest. \nRace proceeds will benefit the nonprofit San Jose Parks Foundation. For more information and to register, visit dreamteamevents.org . \nFamilies seeking a less gory celebration can head to History Park at Kelley Park on Halloween for \"Haunt History Park.\" Despite the name, this is a scare-free event, with arts and crafts activities, rides on the historic trolley, games and trick-or-treating stations set up at the park's historic homes from 11 a.m. to 3 p.m. General admission is $5. For more information, visit historysanjose.org or call 408.918.1047. \nAt Santana Row's Park Valencia, Mommy & Me and Daddies, Too hosts its annual Halloween Family Fun Fest on Oct. 27, 10 a.m.-noon. Kids can trick-or-treat around The Row and enjoy pumpkin decorating, live musical performances and other activities. For more information, call 408.551.4611 or visit SantanaRow.com . A'haunting We Will Go Some frightful family fun can be had Oct. 24 at the Almaden Community Center's ninth annual Harvest Festival and Holiday Boutique from 11 a.m. to 4 p.m. Guests are invited to get spooked in Transylvania Town and the Haunted Hallway, or opt for less scary fare like a magic show, carnival games or a pumpkin patch. The boutique lets Mom and Dad get a jump on holiday shopping at prices that won't haunt their credit rating. \nCurrent Tattoo is looking to the community to provide works for its Wizards And Witches Art Show and Costume Party, set for Oct. 30 from 7 p.m. to midnight. The show is open to all artists who want to participate. Artworks should be delivered to the shop at 48B Race St. by Oct. 29. For more information, visit Current Tattoo's Facebook page or call 408.288.6822. Book 'Em On Oct. 30 some businesses on Lincoln Avenue between Minnesota Avenue and Willow Street will welcome trick-or-treaters with candy and other treats. Others will direct children to Rebecca Morgan's Books for Treats station, where they'll get age-appropriate reading material donated by businesses along the Avenue that served as collection sites. \nLike the books, trick-or-treaters will be divided into age groups, with toddlers collecting candy from 11 a.m. to 12:30 p.m. and school-age kids taking to the street from 3 to 4:30 p.m. \nThe Willow Glen Business Association expects about 4,000 people at the event and is seeking volunteers to help keep foot traffic flowing smoothly. To fill out a volunteer application, visit willowglen.org/trick-or-treat-on-the-avenue .", "external_links": [], "published": "2015-10-22T22:39:00.000+03:00", "crawled": "2015-10-23T02:04:39.812+03:00", "highlightTitle": ""}