{"organizations": [], "uuid": "551cd5e3382a80bd6787fcdd37c3ad9543c09175", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.india.com", "main_image": "http://s3.india.com/wp-content/uploads/2015/10/CRmX0q8UAAAfq67.jpg", "site_section": "http://www.india.com/feed/", "section_title": "India | Latest India News | Get Free India.com Email | Live Cricket and Entertainment News at India.Com", "url": "http://www.india.com/news/india/vikram-seth-backs-sahitya-akademis-condemnation-of-writers-654455/", "country": "US", "title": "Vikram Seth backs Sahitya Akademi’s condemnation of writers’", "performance_score": 0, "site": "india.com", "participants_count": 1, "title_full": "Vikram Seth backs Sahitya Akademi’s condemnation of writers’", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T19:05:00.000+03:00", "replies_count": 0, "uuid": "551cd5e3382a80bd6787fcdd37c3ad9543c09175"}, "author": "Wires English | Press Trust of India", "url": "http://www.india.com/news/india/vikram-seth-backs-sahitya-akademis-condemnation-of-writers-654455/", "ord_in_thread": 0, "title": "Vikram Seth backs Sahitya Akademi’s condemnation of writers’", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments \nNew Delhi, Oct 23: Eminent author Vikram Seth today came out in support of the Sahitya Akademi statement denouncing the recent killing of writers, saying it has condemned the “atmosphere of fear” sought to created by such acts and actred as an “independent body”. At an emergency board meeting here, the Akademi came out with a resolution strongly condemning the killing of Kannada writer M M Kalburgi and others while urging litterateurs to take back awards they have returned. (read: Narendra Modi to hold several bilateral talks during India-Africa summit) \nWelcoming the Akademi statement, 63-year-old Seth, who has authored award winning books like ‘A Suitable Boy’ and for his travelogue ‘From Heaven Lake: Travels Through Sinkiang and Tibet’, told NDTV, “it shows that the board has acted as an independent body.”\"It (Akademi) has condemned any attempt to suppress free speech and of course the ultimate suppression of free speech is where you stop your lips and dead in the hand, in other words, murder. It has also condemned the atmosphere of fear that is sought to be inculcated by acts of assassination such as these and this form of tear/terror has been condemned in the strongest possible terms,” he said. Seth said had it not been for the writers who gave up their Akademi awards, this board meeting would not have been advanced from December. \nAt least 36 authors have gven up their Akademi awards and five others have relinquished their posts in the literary body protesting against the recent killing of writers and “rising intolerance” in the country.Observing that it was not easy for writers to give up their awards, he said as to get a mark of appreciation from their peers, their fellow writers, is something that gives them great comfort. \n“From what I understand, there was a lot of pressure on them (Akademi),” he said, adding, that its statement has sent a strong message that the writers will maintain their autonomy and will respect those of others.”I think that our strength lies in the fact that we are individual voices who can on crucial matters come together,” he said. Seth also said that Finance Minister Arun Jaitley was one of the very few people who spoke out very early about the dreadful lynching at Dadri. “Other people remained fairly quiet. Jaitley is one of the very few people in that party (BJP) who spoke out,” he said. \nModified Date: October 23, 2015 8:38 PM Topics:", "external_links": [], "published": "2015-10-23T19:05:00.000+03:00", "crawled": "2015-10-23T19:59:07.256+03:00", "highlightTitle": ""}