{"organizations": [], "uuid": "d30a85a0ec765f0a0d6b230f66e9f60b5d5b891b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://images.canberratimes.com.au/2015/10/15/6932442/Article%20Lead%20-%20wide1001515293gk9zozimage.related.articleLeadwide.729x410.gk9y59.png1444886215450.jpg.jpg", "site_section": "http://feeds.canberratimes.com.au/rssheadlines/entertainment.xml#", "section_title": "Canberra Times Entertainment Headlines", "url": "http://www.canberratimes.com.au/entertainment/theatre/aladdins-magic-carpet-ride-sweeps-into-town-with-disney-musical-to-launch-next-year-20151015-gk9y59.html", "country": "AU", "title": "Aladdin's magic carpet ride sweeps into town with Disney musical to launch next year", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "Aladdin's magic carpet ride sweeps into town with Disney musical to launch next year", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T08:17:00.000+03:00", "replies_count": 0, "uuid": "d30a85a0ec765f0a0d6b230f66e9f60b5d5b891b"}, "author": "Sarah Thomas", "url": "http://www.canberratimes.com.au/entertainment/theatre/aladdins-magic-carpet-ride-sweeps-into-town-with-disney-musical-to-launch-next-year-20151015-gk9y59.html", "ord_in_thread": 0, "title": "Aladdin's magic carpet ride sweeps into town with Disney musical to launch next year", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play video Return to video Video settings Please Log in to update your video settings\nVideo will begin in 5 seconds.\nDon't play Play now More video Recommended Replay video Return to video Video settings Please Log in to update your video settings\nTrailer: Aladdin (Broadway musical) Having enjoyed a successful run on Broadway, Disney's Aladdin musical will open in Sydney in August 2016.\nPT2M17S http://www.canberratimes.com.au/action/externalEmbeddedPlayer?id=d-44kit 620 349 October 15, 2015 - 4:21PM Autoplay On Off Video feedback Video settings A rub of Aladdin's lamp is set to grant NSW a $39 million bounty in visitor expenditure, with the announcement that Disney is to bring the hit Broadway musical to town next year.\nAladdin , based on the1992 blockbuster Disney film, will open at the Capitol Theatre in August, bringing with it more than 120,000 visitors according to estimates by the NSW Government. \nThe Sydney run follows its expansion outside of its Broadway launch last year, with productions now set to run in Tokyo, Hamburg and London. \nAladdin has been making its way around the globe and will hit Sydney next August. Photo: Deen van Meer \nThe Minister for Trade, Tourism and Major Events Stuart Ayres said it hoped Aladdin would follow on from the success of The Lion King , which drew more than 600,000 visitors. \nAdvertisement \"It's got such a fantastic track record,\" Mr Ayres said of Aladdin . \"It's not just for children, it's for everyone. It's a genuine Broadway comedy, it will make you laugh, it will make you cry, it will inspire you. It does all the things that Disney has been doing to families and people around the world for many, many years now.\"\nThe musical features the five songs featured in the original movie scored by Alan Menken, including the Oscar-winning A Whole New World , plus seven additional songs. Based on the folktales One Thousand and One Nights, the film's winning factors included Robin Williams as the voice of the Genie, in one of his most memorable roles. More than 1 million theatregoers have seen the show on Broadway since it opened in March 2014. \nThomas Schumacher, president of Disney Theatrical Productions announced Aladdin is coming to Sydney at the Capitol Theatre on Thursday. Photo: Nick Moir \nDisney Theatrical Productions president Thomas Schumacher said Sydney had been chosen as part of the show's global growth as it was a \"world theatre capital\" and the company had scored so much success here with previous productions of Beauty and the Beast, Mary Poppins and The Lion King.  \nThe Lion King in particular, which is now in Melbourne before moving to Perth next month, has proved to be an theatrical juggernaut with estimates that it has pulled in global ticket sales of more than $US6.2 billion – making it the most lucrative work in entertainment of any kind ever. \n\"At this moment in time, when everyone has got their face in their smartphone, or their tablet or computer, record numbers of people are coming to see shows on Broadway,\" Schumacher said. \nThe next hotly anticipated production out of the Disney stable will be a musical version of Frozen . Schumacher would not comment on whether there are expectations that Frozen will surpass the popularity of The Lion King.  \n\"What I try not to do in my own work is predict what the success of something is going to be because what I'd rather do is work with the great artists and just try to make it a great show,\" he said.\nSchumacher said the company was \"deep into the process of writing\" Frozen the musical, with the movie's writer Jennifer Lee and composer Christophe Beck working on the show. \nThere have been reports Frozen  could see a 2017 opening, but Schumacher would not be drawn on confirming when it would open.\n\"I'm not putting a date on it because I want to let it take the time it needs to get there,\" he said. \nTickets for Aladdin at the Capitol Theatre will go on sale in March.", "external_links": [], "published": "2015-10-15T08:17:00.000+03:00", "crawled": "2015-10-15T13:19:46.700+03:00", "highlightTitle": ""}