{"organizations": [], "uuid": "3acd07ae7b773a5e6faf54ceb1c235fe0535c5c6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.maxim.com", "main_image": "", "site_section": "http://www.maxim.com/entertainment", "section_title": "Entertainment | Maxim", "url": "http://www.maxim.com/entertainment/article/dr-ken-jeong-doing-another-hangover-movie-and-why-he-really-really-hates-patch-2015-10", "country": "US", "title": "Dr. Ken Jeong On Doing Another Hangover Movie And Why He Hates Patch Adams", "performance_score": 0, "site": "maxim.com", "participants_count": 1, "title_full": "Dr. Ken Jeong On Doing Another Hangover Movie And Why He Hates Patch Adams | Maxim", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "3acd07ae7b773a5e6faf54ceb1c235fe0535c5c6"}, "author": "Chris Wilson", "url": "http://www.maxim.com/entertainment/article/dr-ken-jeong-doing-another-hangover-movie-and-why-he-really-really-hates-patch-2015-10", "ord_in_thread": 0, "title": "Dr. Ken Jeong On Doing Another Hangover Movie And Why He Hates Patch Adams", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ken Jeong shot to worldwide fame as the coke-snorting, junk-flashing drug dealer Mr. Chow in The Hangover movies, which led to a recurring role on Community and eventually his own sitcom, Dr. Ken, based on his real-life past as a doctor. The former general practitioner-by-day, stand-up comic by night told Maxim about becoming instantly famous, how he juggled comedy and medicine, and his utter hatred for Patch Adams.\nHow did that sudden fame from The Hangover transform your life ?\nLike a week and a half after it came out, my wife and I were at a sushi restaurant in L.A. and everyone was looking at me like I’d farted or something. I still get guys yelling, “Toodaloo, mothafucka!” at me at stoplights. I don’t know if I could have dealt with it in my 20s. I’m happily married, I love my kids, and I love my life prior to The Hangover —so I’m very grateful that my head was in a proper place before all this happened. I wasn’t lonely or desperate for anything.\nYou were once a full-time doctor who did stand-up at night. That must have been very demanding.\nI don’t think I spent any more time doing stand-up than a doctor does playing golf; that’s the way I looked at it. I don’t play golf, so at the time I looked at it as my hobby.\nSo tell me, doc: is laughter contagious, as the immortal doctor/clown Patch Adams once said?\nNo, infection is contagious. Colds and flus are contagious. Laughter is just an affectation. I hate that saying: \"Laughter is the best medicine.\" Medicine is the best medicine. Laughter just doesn’t hurt!\nAnd “contagious laughter” actually sounds terrifying.\nYeah, otherwise everyone would be some sort of hyena. As a doctor, I was never Patch Adams. I was always super respectful. No clown nose. “You’ve got herpes, but I’ve got your nose! Honk! Honk!” It’s just not good.\nThere’s something about a doctor with a clown nose that's truly disturbing.\n“Why do you hate me?” says the patient. “Why do you hate me?” says the patient. “Why do you hate me?” says the patient.\nNow you’re starring in, writing, and executive-producing ABC's Dr. Ken . Are there any TV or movie doctors you do like?\nI don’t watch medical shows. When you’re a doctor, you don’t want to come home and see more trauma. I remember when ER was in its heyday, I tried it and got choked up. It was almost a post-traumatic-stress experience watching it, because it was so well done. I was like, \"I can't watch this. I've got to go watch Seinfeld or Larry Sanders right now.\"\nOK, how about other comedies that inspire you?\nI’ve been watching a lot of Cheers lately as inspiration. A lot of people ask me, “Is this a workplace comedy? Is this a family comedy?” And I say, “No. It’s an ensemble comedy.” I think that has something to do with being on Community . That’s a big influence, too.\nSo if The Hangover launched your career, is there any hope for Mr. Chow’s return in a stand-alone franchise, perhaps?\nI would love that. I’d be game to do another one, but in this shape and form, The Hangover III was, by design, the last one. It was the end to the trilogy. That character was just pure, unadulterated joy. It was such an id. I don’t know if I could play a character quite like that ever again. There's a time and a place for everything.", "external_links": ["http://www.youtube.com/watch?v=olaeqfvMJ4A", "http://www.rottentomatoes.com/m/patch_adams/"], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-14T02:33:25.024+03:00", "highlightTitle": ""}