{"organizations": [], "uuid": "42648b2c97ef9fab86e4b720e5fef020867a0a75", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattletimes.com", "main_image": "http://static.seattletimes.com/wp-content/uploads/2015/10/eafae0a4-71d7-11e5-a09b-c7989da14a88-316x316.jpg", "site_section": "http://seattletimes.com/rss/artsentertainment.xml", "section_title": "The Seattle Times » Sections » Entertainment", "url": "http://www.seattletimes.com/entertainment/theater/play-adapts-a-story-for-the-ages-a-simpsons-episode/?utm_source=RSS&utm_medium=Referral&utm_campaign=RSS_entertainment", "country": "US", "title": "Play adapts a story for the ages: a ‘Simpsons’ episode", "performance_score": 0, "site": "seattletimes.com", "participants_count": 1, "title_full": "Play adapts a story for the ages: a ‘Simpsons’ episode | The Seattle Times", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T10:00:00.000+03:00", "replies_count": 0, "uuid": "ba3f4d794f2d8e180216294b189dd1eea65c93f6"}, "author": "Misha Berson", "url": "http://www.seattletimes.com/entertainment/theater/play-adapts-a-story-for-the-ages-a-simpsons-episode/", "ord_in_thread": 0, "title": "Play adapts a story for the ages: a ‘Simpsons’ episode", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Anne Washburn is the first to acknowledge that she is no expert on “The Simpsons.”\nHowever, thanks to “Mr. Burns, a post-electric play,” Washburn’s writing career and the long-running animated TV show will be forever linked.\n“I have enormous respect for ‘The Simpsons,’ but I could never win a trivia contest,” admitted the wry, unassuming playwright. “I haven’t watched it for years.”\nTheater Preview ‘Mr. Burns, a post-electric play’ by Anne Washburn. Through Nov. 15 at ACT Theatre, 700 Union St., Seattle; tickets start at $20 (206-292-7676 or acttheatre.org )\nAnd yet, when the experimental New York troupe The Civilians offered her a commission, Washburn began the project by asking the actors to describe episodes from that TV icon, “The Simpsons.”\n  The one they remembered best was “Cape Feare,” from Season 5, a semi-parody of the chilling 1962 film “Cape Fear,” and the Scorsese 1991 remake, in which a family is stalked and menaced by a psycho-criminal. \nThe episode figures largely in “Mr. Burns, a post-electric play,” though Washburn insists you needn’t see it before attending ACT Theatre’s production, opening on Oct. 22. (Some reviewers have suggested otherwise.)\nDrawing from a transcription of improv sessions with The Civilians, Washburn years later began writing about a cluster of apocalypse survivors recounting the “Cape Feare” episode around a campfire. \nFrom there, “Mr. Burns” (titled after the head of the nuclear power plant, where “Simpsons” dad Homer works), imagines (humorously and ominously) a future where the center no longer holds — yet some old stories survive, and evolve. \n“The idea of things breaking down is an essential theme from the beginning,” Washburn noted. “When I think about a breakdown in the social order, my brain goes right to our horrible infrastructure. We have over 100 nuclear power plants in the country, and they’re only safe if you have a stable grid and an ongoing supply of electricity.”\nWhat’s left in the frightening aftermath of a meltdown, she suggests, is a need to cling to a familiar fable. “When we’re stressed we reach for a story. Our original fireside stories were about strange, enormous forces people feel they can’t control. The ‘Cape Fear’ movies also tell an old story, about powerlessness, and family.”\nIn the play, the “Simpsons” plot is passed along and reinterpreted over eight decades — at one point, actors wear masks of the cartoon figures. Washburn meant it all to be “serious and goofy at the same time, humorous but the reality behind it is pretty grim.”\nMusic is added to the mix, including a medley of hits by current pop stars. “Once you no longer have electricity it’s hard to have rock music. But with rap, you just need a voice, and it’s very much about copping an attitude of strength and tenacity” — an asset, when life flips into the primitive. \n“Mr. Burns,” in its initial 2013, New York run, perplexed some critics, but most lauded its audacity, its dark, mirthful invention and zeitgeist savvy. According to New York Times critic Ben Brantley, the play captures “the apocalyptic spirit of the times … It feels like [it] could only be written now.” \nTo her credit, Washburn has shared the success of “Mr. Burns” with the actors who helped create it. (“They have a part of my author’s royalty, but nobody’s getting crazy wealthy off it.”) The script has been produced around the U.S., in London, and, she added, “I think an extraordinarily tiny production was done in Romania.”\nACT Theatre’s version, staged by new artistic director John Langs, has a local cast that includes Anne Allgood and Adam Standley. Meanwhile, New York-based Washburn recently adapted another durable story: Euripides’ ancient Greek tragedy, “Iphigenia in Aulis.”\nMisha Berson: mberson@seattletimes.com", "external_links": [], "published": "2015-10-16T10:00:00.000+03:00", "crawled": "2015-10-17T00:35:52.043+03:00", "highlightTitle": ""}