{"organizations": [], "uuid": "2285dd5ed0eed15bcb90300992a85549bf964b31", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.democratandchronicle.com", "main_image": "http://www.gannett-cdn.com/-mm-/33025ab91368498a491929009891e168cbd733bc/c=0-195-1999-1324&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/14/Rochester/Rochester/635804191603644115-roc-56liae7sqoi10n31d28l-original.jpg", "site_section": "http://www.democratandchronicle.com/rocflavors/", "section_title": "Democrat and Chronicle | Rochester news, community, entertainment, yellow pages and classifieds. Serving Rochester, New York | democratandchronicle.com", "url": "http://www.democratandchronicle.com/story/lifestyle/columnist/howell/2015/10/14/bordeaux-wineries/73922330", "country": "US", "title": "Howell: Small Bordeaux wineries offer great values", "performance_score": 0, "site": "democratandchronicle.com", "participants_count": 1, "title_full": "Howell: Small Bordeaux wineries offer great values", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T19:40:00.000+03:00", "replies_count": 0, "uuid": "2285dd5ed0eed15bcb90300992a85549bf964b31"}, "author": "democratandchronicle.com", "url": "http://www.democratandchronicle.com/story/lifestyle/columnist/howell/2015/10/14/bordeaux-wineries/73922330", "ord_in_thread": 0, "title": "Howell: Small Bordeaux wineries offer great values", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I had my first sip of Bordeaux wine exactly 40 years ago. It was during my stay as a 13th year abroad exchange student with a French family that lived just outside of Paris. My French “Papa” was a lover of fine wines. Every night at dinner, he would open something new, and tell me a little story about the wine and where it came from. I was not a wine drinker then, and much preferred the local sparkling waters with my meal! But the family would often pour me a little taste of wine to try. The flavors grew on me, and over the course of that memorable year, I found that I really liked the taste of wine with a good meal. Wine was like a condiment that made the food taste better. And the cuisine did wonders for the wine as well. What tasted tart and bitter when just sipped on its own, became smooth and fruity with the right mouthful of food.\nWine service at the table was always the same, whether the bottle was a simple quaff from the local market, or a high-end collector’s item from Papa’s cellar. But I knew when the really good stuff was being poured from the way that the bottle was displayed on the table. It was decanted into a carafe before dinner to “open up”, and the bottle was prominently displayed in a special wine coaster for all to see. Those were usually the nights when Papa popped a good “Bordeaux.”\nUSA TODAY\nRiver line AmaWaterways to launch Bordeaux cruises\nTo this very day, the mention of “Bordeaux” wine still gives me the warm and fuzzies. The wines were special to me back then, and they are even more special to me now that I have had a few more years to get to know them. I was fortunate to be introduced to Bordeaux without intimidation, and so I would like to share that with you in this very simple Bordeaux wine primer:\nBordeaux is a region that lies on the southwestern coast of France, right on the Atlantic Ocean. Au bord de l’eau, meaning “at the edge of the water”, is how the name originated. That exposure to the effect of the ocean currents makes for some interesting weather patterns. The climate for growing grapes can be wonderful there, but not always consistent. So very early on, the Bordeaux wine makers decided that the wines were going to be blends of several different grapes that all ripened at different times. That way, in the case of a challenging vintage (as in heavy rains or hailstorms), they could always work with what was already harvested. Makes total sense.\nSo, when you buy a white Bordeaux wine, it can be a blend of any of the three famous white grapes of Bordeaux — Sauvignon blanc, Semillon and Muscadelle. The reds have five main players, and the wines can be a blend of any of them — Cabernet Sauvignon, Merlot, Cabernet Franc, Petit Verdot and Malbec.\nBordeaux wines can be very expensive. But so can any other wine in the world. The fact is that there are countless wines from Bordeaux that can be had for under $20, even under $10, and they are very good wines.\nIn 1855, a classification of the wines of Bordeaux was created. Basically, the wine brokers in the city of Bordeaux listed the top wineries (called chateaux), and rated them in five different categories (called Cru). Sixty-one wineries were divided into five groups according to the quality and price of their wines at the time. Think of it like a five-round draft pick. With the exception of one small change, this list has not changed in 160 years. Of course these wines are still outrageously good, and the prices reflect that. Some names you might recognize are Château Lafite-Rothschild, Château Latour and Château Margaux. (For a list of these famous chateaux, you just need to check out crus-classes.com .\nBuy Photo Bordeaux, France, is known for its grapes and wines. (Photo: NANCY STANCILL/CHARLOTTE OBSERVER file photo)\nAs you can imagine, many new wineries have been founded since then, but will never have the chance to break into the set-in-stone classification. That means that we can have a whole barrel of fun trying wines that we have never even heard of. And that is exactly what I love to do. It is among these smaller chateaux that I find some of the best wine values in Bordeaux.\nBordeaux is divided into geographical sub-regions called appellations. The river Gironde cuts the northern part of the region into two distinct sides — the Left Bank and the Right Bank. The red wines of the Left Bank tend to have more Cabernet Sauvignon in the mix, due to the gravelly soils which that vine prefers. The Right Bank favors Merlot and Cabernet Franc, since the soils there are more clay- and limestone-based, which makes those two varieties very happy.\nThis is just a starting point, but look for more Bordeaux specifics in the next few columns. Autumn is the perfect time to take a Bordeaux adventure, because these wines pair so well with fall flavors.\nSpeaking of adventures, I am happy to say that I will be returning to France after all these years. In November 2016, I will be hosting a wine-themed river cruise aboard AmaWaterways. We will be traveling through a region very dear to my heart. Bordeaux! We currently have cabins still available, and I would love for you to join me. If you are interested, please drop me an e-mail and I’ll send you the details. Until next time, A bientôt!\nUSA TODAY\nTwo river cruise lines plan first trips in Bordeaux", "external_links": ["http://www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/d23530e3b4aabd3a0ca9c139de75886d71d15de5/c=300-0-2850-2550/local/-/media/2015/03/23/USATODAY/USATODAY/635627045814534049-Amadolce---Exterior.jpg", "http://www.gannett-cdn.com/-mm-/d32db2135ae34aac89ba8857c0095c5d78ab7ec4/r=500x318/local/-/media/2015/10/14/Rochester/Rochester/635804192687851065-roc-56li7dcm0901h21q328l-original.jpg", "http://www.gannett-cdn.com/-mm-/b2f8e1f683fad13719886b2ec84825c86cbb8c95/c=152-0-1848-1275&r=x408&c=540x405/local/-/media/2015/10/14/Rochester/Rochester/635804192687851065-roc-56li7dcm0901h21q328l-original.jpg", "http://www.usatoday.com/story/cruiselog/2015/03/23/amawaterways-bordeaux-river-cruise/25216711/", "http://www.gannett-cdn.com/media/2015/10/14/Rochester/Rochester/635804192687851065-roc-56li7dcm0901h21q328l-original.jpg", "http://www.usatoday.com/story/cruiselog/2012/12/17/bordeaux-france-river-cruise-viking/1769097/", "http://www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/media/USATODAY/cruiselog/2012/12/17/cc_freya_rhinecruising1_121102-1_1.jpg"], "published": "2015-10-14T19:40:00.000+03:00", "crawled": "2015-10-17T21:59:22.030+03:00", "highlightTitle": ""}