{"organizations": [], "uuid": "cd5de46e281ba2cef4d2747feb0b2370064c32d2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266347/arts-entertainment-general", "section_title": "Arts &amp; Entertainment: General - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30196688/winner-of-world-patent-marketing-sweepstakes-comes-forward-to-cash-in-on-european-union-patent", "country": "US", "title": "Winner of World Patent Marketing Sweepstakes Comes Forward To Cash In On European Union Patent", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Winner of World Patent Marketing Sweepstakes Comes Forward To Cash In On European Union Patent - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T18:02:00.000+03:00", "replies_count": 0, "uuid": "cd5de46e281ba2cef4d2747feb0b2370064c32d2"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30196688/winner-of-world-patent-marketing-sweepstakes-comes-forward-to-cash-in-on-european-union-patent", "ord_in_thread": 0, "title": "Winner of World Patent Marketing Sweepstakes Comes Forward To Cash In On European Union Patent", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Inventor from Allentown, PA, has won an all-expenses paid European Union Patent.\nMiami, FL (PRWEB) October 06, 2015\nWorld Patent Marketing , a vertically integrated manufacturer and engineer of patented products, announced the winner of their most recent sweepstakes contest. Congratulations, to Richard Williams, of Allentown, PA, our latest winner! Richard, the Sweepstakes Winner, has won an all-expenses paid European Union Patent.\n\"We're really glad to make this announcement,\" said Scott J. Cooper, CEO and Creative Director of World Patent Marketing and Desa Industries Inc. \"We had a huge number of entries for this sweepstakes. A lot of our inventors were definitely interested. And no wonder, the European Union is a large affluent market. Of course inventors want to be able to sell inventions there. Richard is the big winner.\"\nEuropean Union Patents, like their counterpart, the United States Patent, offer legal protection for registered patented inventions for a limited time. They prevent third parties from copying and/or selling the patented invention. A European Union Patent generally applies to over 25 countries in the European Union.\n\"Richard has a great idea,\" said Cattya Bella DuBois, Director of Product Development for World Patent Marketing Reviews . \"When he came to us and said, 'I want to patent my idea,' we knew that this is the kind of product that really does have worldwide appeal. So of course, he needs to be looking towards Europe as well as Latin America and Asia. It's all part of the process. Way to go Richard, I'm so glad you won.\"\nWorld Patent Marketing Sweepstakes Winners in the past have won prizes such as 10,000 World Patent Marketing Dollars that can be spent developing and preparing invention ideas for the licensing or retail market, and breakfast on a luxury yacht with CEO Scott Cooper. These contests are easy to enter at the World Patent Marketing Facebook page.\nABOUT WORLD PATENT MARKETING\nWorld Patent Marketing is an innovation incubator and manufacturer of patented products for inventors and entrepreneurs. The company is broken into eight operating divisions: Research, Patents, Prototyping, Manufacturing, Retail, Web & Apps, Social Media and Capital Ventures.\nWorld Patent Marketing Miami is by your side every step of the way, utilizing our capital and experience to protect, prepare, and manufacture your new product idea and get it out to the market.\nWorld Patent Marketing Success Stories are demonstrated by its A+ rating with the Better Business Bureau and its five star ratings from consumer review sites including: Consumer Affairs, Google, Trustpilot, Customer Lobby, Reseller Ratings, Yelp and My3Cents.\nWorld Patent Marketing is also a proud member of the National Association of Manufacturers, Duns and Bradstreet, the US Chamber of Commerce, the South Florida Chamber of Commerce, the Greater Miami Chamber of Commerce, Association for Manufacturing Excellence, and the New York Inventor Exchange. Visit the worldpatentmarketing.com website. Contact us at (888) 926-8174 (US Eastern Time) or email bill(at)worldpatentmarketing(dot)com.\n //www.prweb.com/releases/worldpatentmarketing/sweepstakes/prweb12990141.htm\n ", "external_links": ["https://twitter.com/worldpatentmktg", "https://www.linkedin.com/company/world-patent-marketing", "https://www.trustpilot.com/review/worldpatentmarketing.com", "http://www.prweb.com/releases/worldpatentmarketing/sweepstakes/prweb12990141.htm", "https://worldpatentmarketing.net/category/success-stories", "https://www.pinterest.com/WorldPatentMKTG/"], "published": "2015-10-06T18:02:00.000+03:00", "crawled": "2015-10-06T18:59:01.396+03:00", "highlightTitle": ""}