{"organizations": ["Dey Street Books"], "uuid": "6006992e84b8f99c1710cfc3a39ea29a66f3d4e3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.springfieldnewssun.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/10/13/87/0e/98d5900c71794f08984a737b9ece1a45-ea99f1fbba6d487091354c29d964c20d-0.jpg", "site_section": "http://www.springfieldnewssun.com/list/rss/ap/entertainment/latest-entertainment-news/aD57/", "section_title": "Entertainment, celebrity news", "url": "http://www.springfieldnewssun.com/ap/ap/entertainment/apnewsbreak-bobby-brown-working-on-unvarnished-mem/nn2PN/", "country": "US", "title": "APNewsBreak: Bobby Brown working on 'unvarnished' memoir", "performance_score": 0, "site": "springfieldnewssun.com", "participants_count": 0, "title_full": "APNewsBreak: Bobby Brown working on 'unvarnished' memoir", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T13:58:00.000+03:00", "replies_count": 0, "uuid": "6006992e84b8f99c1710cfc3a39ea29a66f3d4e3"}, "author": "", "url": "http://www.springfieldnewssun.com/ap/ap/entertainment/apnewsbreak-bobby-brown-working-on-unvarnished-mem/nn2PN/", "ord_in_thread": 0, "title": "APNewsBreak: Bobby Brown working on 'unvarnished' memoir", "locations": ["NEW YORK", "Beverly Hills", "Calif"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["HILLEL ITALIE", "Bobby Brown", "John Salangsang/Invision/AP", "Brown"], "text": "Updated: 6:58 a.m. Tuesday, Oct. 13, 2015 | Posted: 6:58 a.m. Tuesday, Oct. 13, 2015 APNewsBreak: Bobby Brown working on 'unvarnished' memoir Related View Larger FILE - In this Sept. 27, 2015, file photo, Bobby Brown attends the 26th Annual Heroes and Legends Awards in Beverly Hills, Calif. Brown has a deal with Dey Street Books for “My Prerogative,” the publisher told   on Tuesday, Oct. 13, 2015. The book is scheduled for June 2016 and Brown, in a statement issued through Dey Street Books, is calling it a journey through his “crazy, exciting, fascinating world.” (Photo by John Salangsang/Invision/AP, File) By HILLEL ITALIE NEW YORK — \nGet ready for a \"raw and unvarnished\" memoir by Bobby Brown. \nThe platinum-selling singer, ex-husband of the late Whitney Houston and father of the late Bobbi Kristina Brown has a deal with Dey Street Books for \"My Prerogative,\" the publisher told   on Tuesday. The book is scheduled to be released in June. \nBrown, in a statement issued through Dey Street Books, called the memoir a journey through his \"crazy, exciting, fascinating world.\" \n\"Right after I signed on to write my story, I went through one of the most agonizing traumas I had ever experienced with the death of my daughter,\" Brown said, referring to the July 26 death of 22-year-old Bobbi Kristina, who was found face-down and unresponsive in a bathtub Jan. 31 at her home in Roswell, Georgia. \nHouston, Bobbi Kristina's mother, was found dead in a bathtub in Beverly Hills, California, in 2012. \n\"But I was surprised by how therapeutic it was to work on this project, to look at the entire arc of my life and to realize that although there has been considerable pain, I have also been incredibly blessed,\" Brown said. \"I hope my fans and other readers of this book will be entertained by this trip into the crazy, exciting, fascinating world of Bobby Brown. And I hope they will feel that I have been as honest and open with them in these pages as I have tried to be my entire life.\" \nFinancial terms for \"My Prerogative\" were not disclosed. Dey Street Books called the memoir \"raw and unvarnished\" and promised that Brown will \"tell the full story of his life and set the record straight, particularly about his relationship with Whitney Houston .\" \n\"'My Prerogative' is the story of a man who has been on the top of the mountain and in the depths of the valley and who is now finally ready to talk about his career and family life, from the passion and the excess to his creative inspirations and massive musical success,\" according to the publisher's statement. \nBrown, 46, has been a star since co-founding New Edition more than 30 years ago, his hits including \"Every Little Thing,\" ''Humpin' Around\" and the song that provides the title for his memoir, \"My Prerogative.\" But many think of him first for his tumultuous time with Houston, to whom he was married from 1992 to 2007, his run-ins with the police and his struggles with drugs and alcoholism. \nHe has feuded with Houston's mother, Cissy Houston, who has said Whitney would have been better off without Brown and would not have become so \"deep\" into drugs. \nThe memoir will be co-written by Nick Chiles, who has worked on books by the Rev. Al Sharpton and former Massachusetts Gov. Deval Patrick, among others. \nDey Street is an imprint of HarperCollins Publishers. Copyright  ", "external_links": [], "published": "2015-10-13T13:58:00.000+03:00", "crawled": "2015-10-13T17:42:39.504+03:00", "highlightTitle": ""}