{"organizations": [], "uuid": "b8b0172db1b43df9a03f03dc23f85b7a22c70dc1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "savannahnow.com", "main_image": "http://savannahnow.com/sites/default/files/images/sms-default-facebook-share.jpg", "site_section": "http://savannahnow.com/", "section_title": "savannahnow.com | Savannah Georgia's source for News, Entertainment, Sports, Weather, Classifieds, Jobs, Autos, Real Estate and St. Patricks Day", "url": "http://savannahnow.com/editorial/2015-10-08/editorial-garden-city-gets-serious-about-growth", "country": "US", "title": "Editorial: Garden City gets serious about growth | savannahnow.com", "performance_score": 0, "site": "savannahnow.com", "participants_count": 1, "title_full": "Editorial: Garden City gets serious about growth | savannahnow.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T20:55:00.000+03:00", "replies_count": 0, "uuid": "b8b0172db1b43df9a03f03dc23f85b7a22c70dc1"}, "author": "DispatchDaemon", "url": "http://savannahnow.com/editorial/2015-10-08/editorial-garden-city-gets-serious-about-growth", "ord_in_thread": 0, "title": "Editorial: Garden City gets serious about growth | savannahnow.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SPECIAL OFFER FOR NEW READERS 99 cent digital subscription to savannahnow.com\nSubscriber-members get access to ALL our digital products AND become eligible for free event tickets, discount coupons and other benefits. SIGN UP FOR SUBSCRIBER BENEFITS As a Savannah Morning News / savannahnow.com subscriber, you're eligible for members-only discounts. Download your coupons now. Garden City officials should be applauded for being proactive when it comes to future development of a prime piece of publicly owned real estate on Dean Forest Road near the Interstate 16 interchange.\nOn Tuesday, City Manager Ron Feldner said Garden City council members have instructed him to hire a land appraiser to determine the value of about 20 acres in the Town Center property around City Hall on Dean Forest Road — figures that could later be used to solicit sealed bids for a future land sale.\nThe Garden City Council is smart to ask its manager to hire an expert for advice. It beats shooting in the dark, which is what the Savannah City Council seems to do when it decides to buy or sell property.\nGarden City is also planning ahead, another sign of intelligent government. The council developed a master plan for the Town Center, where its City Hall is located, about five years ago. It calls for a variety of uses on several blocks, an interconnected street system and pocket parks. “Walkability” is high on the priority list, and for good reason — as the ability to get around on foot as opposed to driving and making multiple stops has immense appeal, especially among older people. Thus it’s no surprise that housing for senior citizens is among the development ideas. Other possibilities are a mix of housing and retail including shops, restaurants, offices and medical facilities. Mr. Feldner said the city has been getting more nibbles about the property’s availability, which is encouraging because it’s yet another positive sign that the long real estate slump may be ending. In Garden City’s case, that means making the best and smartest use of Town Center real estate, putting it back on the tax rolls and potentially generating sales taxes and other revenue to help pay for public services.\nMr. Feldner said that “state law requires that the city utilize a process that involves submittal of sealed bids to sell property, and the appraisal process will enable us to set the minimum bid level.”\nAs one of the few remaining city officials to have been involved in the original plan for Town Center, Mayor Tennyson Holder said he’s excited about the prospect of getting the property sold and developed. So should all Garden City residents who want to expand their community’s tax base and support planned growth — as opposed to the anything goes approach — to do it. That means the town shouldn’t sell itself short, and it must be wary of development that adds to the existing traffic headaches.\nHow a future land sale and development plan dovetails with what the City Council approved in February remains to be seen.\nThat month, the council approved a resolution in support of developing “an affordable housing project for its active senior citizen population” on a 12-acre plot of land near City Hall.\nThe council later followed up with a new resolution, expressing “exclusive support for the construction of ‘The Villages at Town Center.’” According to the resolution, the plan is to build 72 units behind City Hall, just off Constantine Road.\nThe city is working with Kingsland, Ga.,-based W.H. Gross Construction to come up with a project to compete for tax credits from the Georgia Department of Community Affairs. Owner Bill Gross has been successful in developing similar communities across the state, including in Brunswick, where he recently finished an affordable housing community for residents of all ages.\nMr. Feldner said at that time that Gross Construction is still crafting the application for the DCA program, and more detailed designs for the project would be forthcoming.\n“(W.H. Gross) have asked for the (resolution) while they work through their efforts to pull together a full application,” Feldner said. “In recent weeks, they have asked for other items such as a letter from the city stating that the property is properly zoned for the project and that water and sewer service is available. We provide them the information as they request it, but we have not seen the full application or detailed plans as of yet.”\nThe process has been slow, Garden City Council President Don Bethune said at the time, but the city does expect its project to be competitive — if not this year, then next. Bethune said the town already has a couple of advantages in place. The DCA already has designated Garden City a WaterFirst community, which indicates it has worked to manage and protect its water resources.\nAnd Garden City has a Community Housing Team, a DCA program that provides assistance to local homeowners in need. The housing team is headed by Bethune’s wife, Sharon. “Each one of those items will get us points for the (tax credits) application. If we get everything in place in time, we’re going to apply this year,” Bethune said. “It’s going to be a perfect fit for that area. It’s near the library. It’s one of the things that the seniors have been asking for.\nThis project could be just what this westside community needs.\nA new senior housing community near Garden City’s Town Center could serve as a catalyst for a new grocery store, hotel or restaurant in Town Center, Mr. Bethune said.\nEven historic preservation, a subject usually reserved by Savannah, is part of the mix. Another goal for whatever is proposed for Town Center is that it incorporates the city’s historic Dotson House. The house, originally built in 1850, was relocated to the Dean Forest Road area in 2009.\nInitial plans were to develop it into a welcome center — part of a much larger plan to develop shops and businesses around a new city hall and police department — but a slow economy halted renovation efforts. The house sits vacant. Garden City officials say vacant properties in the city, which has struggled to get back on its feet since the recession, are being marketed. The vision city leaders once had has not come to fruition, as evidenced by the vacant stores in Southbridge Commons next to city hall. In June, the city raised property taxes for the first time in its 75-year history after seeing declining tax revenues.\nThanks to the property tax increase, town officials are working on a number of capital improvements — including road projects and purchase of public safety equipment. There’s even talk of building a band shell in the open area in front of City Hall to be used as a venue for public concerts and even movies — a splendid idea because it’s an amenity that west Chatham County lacks.\nIn recent years, Garden City officials have mostly sat back and watched much of the westside growth go to Pooler and even Port Wentworth. It’s good to see Garden City get serious, get off the sidelines and get back into the game.", "external_links": ["http://sav-cdn.com/sites/all/themes/savannahnow/images/blank.gif"], "published": "2015-10-08T20:55:00.000+03:00", "crawled": "2015-10-08T20:10:06.016+03:00", "highlightTitle": ""}