{"organizations": [], "uuid": "a33ddfa3a11741ddc10dc4faa989a0115d748a05", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.680news.com", "main_image": "", "site_section": "http://www.680news.com/category/entertainment/feed/", "section_title": "680 NEWS » Entertainment", "url": "http://www.680news.com/2015/10/23/museum-returns-to-alaska-tribal-members-totem-pole-stolen-by-actor-john-barrymore-in-1931-2/", "country": "CA", "title": "Museum returns to Alaska tribal members totem pole stolen by actor John Barrymore in 1931", "performance_score": 0, "site": "680news.com", "participants_count": 1, "title_full": "Museum returns to Alaska tribal members totem pole stolen by actor John Barrymore in 1931", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T11:26:00.000+03:00", "replies_count": 0, "uuid": "a33ddfa3a11741ddc10dc4faa989a0115d748a05"}, "author": "News Staff", "url": "http://www.680news.com/2015/10/23/museum-returns-to-alaska-tribal-members-totem-pole-stolen-by-actor-john-barrymore-in-1931-2/", "ord_in_thread": 0, "title": "Museum returns to Alaska tribal members totem pole stolen by actor John Barrymore in 1931", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "by Jennifer Sinco Kelleher, The Associated Press Posted Oct 23, 2015 4:26 am   23, 2015 at 5:00 am EDT \nHONOLULU, Hawaii – A stolen totem pole that went from the garden decor of two golden-age Hollywood actors to the basement of a Hawaii museum has been returned to Alaska tribal members. \nScreen legend John Barrymore was travelling along the Alaska coast by yacht and directed crew members to take the totem pole from an unoccupied village in 1931, said University of Alaska Anchorage professor Steve Langdon, who has long researched the object. They sawed it in three pieces. \nBarrymore, star of “Grand Hotel” and grandfather of actress Drew Barrymore, displayed the pole in the garden of his California estate. \nAfter Barrymore’s death, actor Vincent Price, known for horror flicks such as “House of Wax,” and his wife bought the item and also used it as a yard decoration. The couple donated it to the Honolulu Museum of Art in 1981. \nLangdon’s interest in the piece came from a visit to an Alaska museum where he saw a photo of Price standing next to the approximately 40-foot-tall pole. “It was totally out of place,” he recalled. “Here’s this recognizable Hollywood figure in a backyard estate with a totem pole … that was surrounded by cactus.” \nLangdon learned the pole was used for burials, and that there were remains of a man inside before Barrymore had it erected at his home. Langdon does not know what happened to the remains after they were removed from the pole. \nMuseum officials didn’t know the pole was stolen. With permission from tribal leaders, Langdon came to Honolulu in 2013 to examine the pole, setting into motion a repatriation process funded by the Native American Graves Protection and Repatriation Act. \nOn Thursday, seven Tlingit tribal members who travelled to Honolulu from the southeast village of Klawock wore lei, sang sombre songs, handed out gifts and thanked Hawaii for taking good care of the pole. \n“We too also are ocean people,” said Jonathan Rowan, master carver and cultural educator. “We live on an island also.” \nWith the scent of cedar wafting in the air, his daughter Eva Rowan brushed three feathers along the pole pieces bearing carved images of a killer whale, a raven, an eagle and a wolf. \n“It gives my heart great peace that my ancestors can go home,” she said. “I feel my father’s people here. I feel my grandfather’s people here, giving us strength right now.” \nOnly the top section of the pole was displayed briefly in the museum, and the pole spent most of its years in Honolulu in a climate-controlled basement. \n“I take some comfort in the fact that we’ve taken good care of it,” said Stephan Jost, the museum’s director. \nIt was among more than 100 totem poles that once stood in the old village of Tuxecan on Prince of Wales Island, Alaska, which was inhabited by the Tlingit people, the museum said. \nOf the original Tuxecan poles, only two remain, both in Klawock, the village of 800 people where the tribe moved, according to the museum. \nThe pieces were cradled in packing foam in wooden crates that museum workers sealed after the ceremony. The pole will leave the museum Friday, and set sail for Alaska on Tuesday. \n___ \nThis story has been corrected to show Klawock has a population of 800, not 80. \n___ \nFollow Jennifer Sinco Kelleher at http://www.twitter.com/JenHapa . Join the conversation Sign in to comment (not connected to your Insider Club login). You're logged in as Loading profile... Unexpected error. Please try again. Notice: Your email may not yet have been verified. Please check your email, click the link to verify your address, and then submit your comment. If you can't find this email, access your profile editor to re-send the confirmation email. You must have a verified email to submit a comment. Once you have done so, check again .", "external_links": [], "published": "2015-10-23T11:26:00.000+03:00", "crawled": "2015-10-23T12:45:37.437+03:00", "highlightTitle": ""}