{"organizations": [], "uuid": "5732b3d506ff7de316f6ae8ba19a509e8728849d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.india.com", "main_image": "http://s3.india.com/wp-content/uploads/2015/10/CO6jEkTUYAAz2ll.jpg", "site_section": "http://www.india.com/feed/", "section_title": "India | Latest India News | Get Free India.com Email | Live Cricket and Entertainment News at India.Com", "url": "http://www.india.com/news/world/australia-pushing-for-new-anti-terrorism-laws-625566/", "country": "US", "title": "Australia pushing for new anti-terrorism laws", "performance_score": 0, "site": "india.com", "participants_count": 1, "title_full": "Australia pushing for new anti-terrorism laws", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T06:24:00.000+03:00", "replies_count": 0, "uuid": "5732b3d506ff7de316f6ae8ba19a509e8728849d"}, "author": "Wires English | Press Trust of India", "url": "http://www.india.com/news/world/australia-pushing-for-new-anti-terrorism-laws-625566/", "ord_in_thread": 0, "title": "Australia pushing for new anti-terrorism laws", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments \nMelbourne, Oct 13: The Australian government is pushing for new anti-terrorism laws which could among others see lowering the age for teenagers to 14 years, making it easier to issue control orders on suspected radical teenagers.Aiming to strengthen anti-terrorism legislation, the federal government will next month table in Parliament the proposed new laws to lower the age at which terror suspects can be slapped with control orders, which allows the movements and activities of a suspect to be restricted. (Also Read: PM Malcolm Turnbull advised people to leave the country if Australian values were unpalatable to them) \nThe move comes in the wake of a recent incident in Sydney’s Parramatta suburb in which a 15-year-old boy Farhad Jabar killed state police accountant Curtis Cheng by shooting him in the head.Favouring the new changes, Attorney General George Brandis said he?was comfortable with the proposed laws as he said Islamic State militants were reaching out to younger people in Australia. \n“Fourteen is not too young an age for an order of this kind to be made,” he said, adding, “Under the (proposed) legislation, there will be particular protections and safeguards for minors in the 14 to 17 age category. There will be various measures that will limit the capacity of police to question or deal with minors in a way which is regarded given the age of the person to be unreasonable.”Under the new laws, teenagers as young as 14 could be required to wear a tracking device or remain in a premises for up to 12 hours, if suspected of being involved in a terror plot. \nThe announcement has come after a request from NSW Premier Mike Baird was made to Prime Minister Malcolm Turnbull to strengthen existing laws.Baird has also sought for an extension for terror suspects to be held without charge from 14 to 28 days. However, Turnbull said changes to anti-terrorism orders were not a direct response to the shooting incident in Parramatta.He said the law change had been in the works for “some considerable time” and are rather a response to the execution-style shooting of Cheng outside the NSW police headquarters.Under the current laws, a control order can only be issued to someone under 18 for a maximum of three months. \n  8:54 AM Topics:", "external_links": [], "published": "2015-10-13T06:24:00.000+03:00", "crawled": "2015-10-13T06:50:49.814+03:00", "highlightTitle": ""}