{"organizations": [], "uuid": "dc72f2ad7ac84aff88cfd128264acf49b95cadb2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266353/arts-entertainment-television", "section_title": "Arts &amp; Entertainment: Television - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30245680/constellix-launches-webinar-campaign-to-help-admins-transition-to-integrated-monitoring-and-dns", "country": "US", "title": "Constellix Launches Webinar Campaign to Help Admins Transition to Integrated Monitoring and DNS", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Constellix Launches Webinar Campaign to Help Admins Transition to Integrated Monitoring and DNS - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T12:02:00.000+03:00", "replies_count": 0, "uuid": "dc72f2ad7ac84aff88cfd128264acf49b95cadb2"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30245680/constellix-launches-webinar-campaign-to-help-admins-transition-to-integrated-monitoring-and-dns", "ord_in_thread": 0, "title": "Constellix Launches Webinar Campaign to Help Admins Transition to Integrated Monitoring and DNS", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "To prepare administrators and business owners for the upcoming launch of Constellix, lead Sales Engineer Evan Daniels will be hosting an educational webinar and live demo of different Sonar features once a month. Starting Wednesday Oct. 28 at 1pm, Constellix Sonar will be hosting the first live demo of their Sonar Webinar series which will highlight Sonar Smart Notifications.\nReston, VA (PRWEB) October 13, 2015\nWhen it comes to mitigating a DNS outage or latencies in DNS resolution times, the primary concern for administrators is being alerted of an issue as soon as possible. Long-lasting outages and latencies in packet delivery can turn your customers away for good, but learning of an attack sooner can minimize downtime. Sonar eliminates the gap between you and your DNS infrastructure with Smart Notifications and Intelligent Monitoring .\nOver the next few months Lead Sales Engineer Evan Daniels will be hosting a free educational webinar series that will give viewers an inside look at how network monitoring has become a crucial aspect to optimizing businesses’ online presence. An expert in DNS and cloud computing, Evan Daniels has been an integral collaborator in developing and improving Constellix Sonar. Each session will highlight a different aspect of network monitoring such as Smart Notifications, a live demo of the Sonar control panel, and 30-minute Q&A sessions.\nBeginning Oct. 28 ( Register Here ), Daniels will walk viewers through a guided tour of Smart Notifications which allow for instant SMS or email alerts based on preconfigured checks.\n“Our most popular feature, Verified Notifications, allows administrators to customize alerts based on a specified interval between lapses in connectivity,” says President of Constellix Steven Job. “Our engineers designed Constellix to analyze and respond to only the events we deem critical rather than every minor fluctuation,” says Job who was inspired to create Constellix after struggling to adequately analyze alerts when he was becoming inundated with dozens of notifications each day.\nWhen you’re a company with a global presence, you have to monitor your site’s connectivity across dozens of servers and nodes across the world. This can lead to a steady stream of alerts swamping your inbox, and critical information can easily be missed. Along with Verified Notifications, Sonar also includes customized alerts that recognize that different team members have varied roles within DNS management. For example when using Shift-Aware Notifications, admins can configure alerts to be delivered to different team members based on who is working. Users can also create different groups so customized alerts can be delivered to multiple team members at once to tackle an issue together.\nConstellix Sonar and Geo-DNS are currently available for free with a DNS Made Easy membership. Take Sonar for a test-drive today to get your questions ready for the live demo and Q&A session on Oct. 28th!\nAbout Constellix\nConstellix is a subsidiary of Tiggee LLC, the creators of DNS Made Easy , and the world leader in providing global IP Anycast enterprise DNS services. Using Constellix Sonar, users can monitor their online infrastructure performance, troubleshoot issues, and resolve problems with a Cloud-based Traffic Management Suite. The only Traffic Management Service of its kind that helps fuel end-user experiences to incomparable levels.\nConstellix DNS features maximum DNS speeds and industry topping layers of redundancy. Built upon DNS Made Easy’s industry leading 13 year 100% uptime record, Constellix DNS builds on a proud history of reliability and is the preferred DNS hosting choice for companies big or small.\n //www.prweb.com/releases/sonar/webinar/prweb13018154.htm\n ", "external_links": ["https://attendee.gotowebinar.com/register/9205153498776235265", "http://www.constellix.com/sonar/notifications/", "http://www.constellix.com/sonar/aboutsonar/", "http://www.prweb.com/releases/sonar/webinar/prweb13018154.htm"], "published": "2015-10-13T12:02:00.000+03:00", "crawled": "2015-10-13T12:31:07.722+03:00", "highlightTitle": ""}