{"organizations": [], "uuid": "446b7bc12ebb9ac37f29f54be0970c9e2489a88f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.democratandchronicle.com", "main_image": "http://www.gannett-cdn.com/-mm-/eedf021954e4c48989d17efecceb2d38856a0cdc/c=114-1763-4036-3979&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/10/19/Rochester/Rochester/635808612621595790-Lynne-Hobaica-portrait-1.jpg", "site_section": "http://www.democratandchronicle.com/life/", "section_title": "Democrat and Chronicle | Rochester news, community, entertainment, yellow pages and classifieds. Serving Rochester, New York | democratandchronicle.com", "url": "http://www.democratandchronicle.com/story/lifestyle/2015/10/19/woman-watch-lynne-hobaica/74046280", "country": "US", "title": "Woman to Watch: Lynne Hobaica", "performance_score": 0, "site": "democratandchronicle.com", "participants_count": 1, "title_full": "Woman to Watch: Lynne Hobaica", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T23:23:00.000+03:00", "replies_count": 0, "uuid": "446b7bc12ebb9ac37f29f54be0970c9e2489a88f"}, "author": "democratandchronicle.com", "url": "http://www.democratandchronicle.com/story/lifestyle/2015/10/19/woman-watch-lynne-hobaica/74046280", "ord_in_thread": 0, "title": "Woman to Watch: Lynne Hobaica", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Lynne Hobaica couldn't be happier in a career choice that has led her to Rochester. As the new ceramics studio manager at Genesee Center for the Arts and Education, she teaches three classes — two drawing-related, and one wheel throwing course. She completed her residency at the center in 2011 and came back just a few months ago.\n\"After working at the center, I knew I wanted to come back to a community center,\" she says. \"Here everyone is excited and enthusiastic. There is a general curiosity.\"\nA native of Phoenix, Arizona, Hobaica had an unconventional introduction into the pottery world during her junior year at Syracuse University after taking a throwing class. It wasn't until she attended a visiting artist's workshop and exhibition that she noticed food was served in the artist's hand-thrown pottery during the potluck that followed. Hobaica then knew she wanted to study ceramics.\n\"There's a strong community and large support for ceramics,\" she says. \"That's what drew me in.\"\nAfter earning a bachelor's degree in art history at Syracuse in 2010, Hobaica transplanted to Rochester to complete her residency at the Genesee Center. A year later, she moved to Pennsylvania and started a worldwide search for a compelling master's program. She reached out to a friend in Austria who had his own personal ceramic studio and in 2013 decided to move to Austria to study at the University of Art and Design at Linz. She finished her MFA in Sculptural Concepts and Ceramics this year.\n\"I was interested in the approach to ceramics in Austria,\" Hobaica says. \"There, there isn't an appreciation of ceramics, so they look at it in a very conceptual approach. It forced me to look at it in a different way.\"\nHobaica is thankful for her five years of involvement at the Genesee Center. She most enjoys seeing students take a class, return and blossom in the techniques they've learned.\n\"The curiosity that everyone has and their excitement to come in and make art inspires me,\" she says. \"That I can teach and help them is just amazing.\"\nHobaica is returning to Austria this fall to finish her thesis and is currently planning her next solo exhibition in March. Her most recent body of work will be on display at the Firehouse Gallery at the Genesee Center.\n\"There is no title yet, but it will be a continuation of the art that I already make which playfully depicts my reflections on the strange dynamics of human relationships and the awkwardness of navigating life in general.\"\nAs an artist, Hobaica enjoys making both functional and conceptual pottery. But she knows that eventually she'll have to choose.\n\"I think to be an artist you have to have a focus on one thing,\" she says. \"I enjoy making functional pottery but conceptual pottery feeds my soul. Right now I'm just excited to be back in the States and get my feet back on the ground,\" she says.\nPersonal: Lives in the city, age 30\nRecent achievements: Flower City Pottery Invitational, an event that brought in 19 ceramic artists from around the country.\nBiggest challenge I've overcome: Completed a master's program in a foreign country/language. I had a lot of support from my parents and have wonderful, encouraging friends in Austria and the U.S.\nWho inspired me: My mother has inspired me to continue on this path to becoming an artist. She did a little art herself before she became a single mother, and because of this, she would never let me give up my passion.\n5 favorite things to do in Rochester: Bike the Genesee River Trail, picnic in Highland Park, sketch (while sipping coffee and listening to live music) at Boulder, attend First Fridays, hike around the many beautiful parks in and around Rochester.\nOn my reading list: Swann's Way and anything from David Foster Wallace; more by Amelie Nothomb.\nFavorite smartphone app: Instagram\nFavorite saying: \"Anything that gets your blood racing is probably worth doing.\"— Hunter S. Thompson\nLeah Shaw is a freelance writer in the Rochester area.", "external_links": [], "published": "2015-10-19T23:23:00.000+03:00", "crawled": "2015-10-21T10:25:12.777+03:00", "highlightTitle": ""}