{"organizations": [], "uuid": "dffbf6b2883b8dbe8d94b9f22209e435ee404971", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chardandilminsternews.co.uk", "main_image": "http://www.chardandilminsternews.co.uk/resources/images/4306068/", "site_section": "http://www.chardandilminsternews.co.uk/uk_national_entertainment/rss/", "section_title": "Chard & Ilminster News | National Entertainment News", "url": "http://www.chardandilminsternews.co.uk/uk_national_entertainment/13835397.Anne_Marie_Duff__thrilled__about_feminist_protest_at_Suffragette_premiere/?ref=rss", "country": "GB", "title": "Anne-Marie Duff 'thrilled' about feminist protest at Suffragette premiere", "performance_score": 0, "site": "chardandilminsternews.co.uk", "participants_count": 0, "title_full": "Anne-Marie Duff 'thrilled' about feminist protest at Suffragette premiere", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T18:45:00.000+03:00", "replies_count": 0, "uuid": "dffbf6b2883b8dbe8d94b9f22209e435ee404971"}, "author": "", "url": "http://www.chardandilminsternews.co.uk/uk_national_entertainment/13835397.Anne_Marie_Duff__thrilled__about_feminist_protest_at_Suffragette_premiere/?ref=rss", "ord_in_thread": 0, "title": "Anne-Marie Duff 'thrilled' about feminist protest at Suffragette premiere", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Anne-Marie Duff"], "text": "Anne-Marie Duff 'thrilled' about feminist protest at Suffragette premiere Anne-Marie Duff 'thrilled' about feminist protest at Suffragette premiere \n  \nSuffragette star Anne-Marie Duff has said she was “thrilled and excited” about the feminist protesters who stormed the red carpet as the movie opened the BFI London Film Festival. \nStars of the film were taken by surprise as real life scenes echoed the film when a group of protesters jumped the barriers and lay down on the red carpet. \nAnne-Marie said: “If you’re going to make a film about women’s civil rights let there be women screaming for them on a red carpet. Let it be about something, that red carpet, not just about the fabulous dresses we were lucky to wear, let it be about something and I just thought this is what we want young women to see Suffragette for. Anne-Marie Duff and her Suffragette co-stars (Ian West/PA) \n“Not necessarily to always protest, but feel strong enough that they feel they have a right to be heard about everything that concerns them and that they value. And so it just felt like it was the cherry on the cake for us.” \nDuring the premiere, women from Sisters Uncut, wearing tops with posters stuck on saying “Two women killed every week” and “Dead women can’t vote”, jumped the barriers, while others in the crowd held banners with the words “50/50 Parliament”, calling for equality in the British Government. Promoted stories \nWritten by The Iron Lady’s Abi Morgan and directed by Sarah Gavron, the movie tells the story of the British women’s suffrage movement as Emmeline Pankhurst led a call for female rights to be recognised. \nAnne-Marie also spoke out about the criticism the cast have received after they posed wearing slogan t-shirts saying “I’d rather be a rebel than a slave”. \n“My thought on it is this. I rebel against all kinds of slavery, the subduction of any human being is disgraceful. I am a lucky person, I live in the western world and I am a free person, I am free to have an education, to do the career that I want to do,” she said. \n“Anybody who’s not given that right, I will be a rebel against that. That is what we were trying to say and we feel passionately about it because we made a film about human rights and it saddened us profoundly that we would be accused of attacking anybody’s human rights. \n“We can only support the destruction of that. That’s what we care about and that’s what we want. We’re human beings with nerve endings and that’s how we feel.” Feminism! Fame! Fights! Foolishness! Meryl Streep and the stars of SUFFRAGETTE speak out: http://t.co/XRVJ5avftI pic.twitter.com/4gpseWK8yc \n— Time Out Film (@TimeOutFilm) September 29, 2015 \nAll main cast members – Anne-Marie, Meryl Streep, Carey Mulligan and Romola Garai – were featured on a magazine cover wearing the shirts. \nTalking at the premiere, Helena Bonham Carter, who also stars in the movie, said: “I think it’s marvellous. That is exactly what the suffragettes were about. Hopefully the film will inspire anybody who feels an injustice has been done, to be bold enough to protest.” \nAt the film’s press conference, Meryl – who portrays Emmeline Pankhurst – hit out at the male-dominated film-making industry, saying the inequality made her “infuriated”. Share article \nSuffragette opened the BFI London Film Festival, which runs until October 18. Promoted Stories", "external_links": [], "published": "2015-10-08T18:45:00.000+03:00", "crawled": "2015-10-09T00:51:43.635+03:00", "highlightTitle": ""}