{"organizations": [], "uuid": "af951ba17bc31af774e12e64ce8b1b11994c52d9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailyherald.com", "main_image": "http://www.dailyherald.com/storyimage/DA/20151019/ENTLIFE/151018728/AR/0/AR-151018728.jpg&amp;updated=201510191433&amp;imageversion=Facebook&amp;exactH=630&amp;exactW=1200&amp;exactfit=crop&amp;noborder", "site_section": "http://www.dailyherald.com/rss/feed/?feed=entlife", "section_title": "DailyHerald.com &gt; Life &amp; Entertainment", "url": "http://www.dailyherald.com/article/20151019/entlife/151018728/", "country": "US", "title": "Lake in the Hills debuts Pub in the Park Craft Beer Fest", "performance_score": 0, "site": "dailyherald.com", "participants_count": 1, "title_full": "Lake in the Hills debuts Pub in the Park Craft Beer Fest", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T22:33:00.000+03:00", "replies_count": 0, "uuid": "af951ba17bc31af774e12e64ce8b1b11994c52d9"}, "author": "Ann Piccininni Daily Herald correspondent", "url": "http://www.dailyherald.com/article/20151019/entlife/151018728/", "ord_in_thread": 0, "title": "Lake in the Hills debuts Pub in the Park Craft Beer Fest", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Beer is not just beer these days.\nThat point undoubtedly will be well-illustrated Saturday, Oct. 24, when more than three dozen craft brewers serve their signature beverages at a new event in Lake in the Hills called Pub in the Park Craft Beer Fest.\nrelated advertisement If you go\nWhat: Pub in the Park Craft Beer Fest\nWhen: 4 to 7:30 p.m. (3 to 4 p.m. reserved for VIP ticketholders only) Saturday, Oct. 24\nWhere: Sunset Park, 5200 Miller Road, Lake in the Hills\nTickets: $45-$55 general admission, $75-$85 VIP; $25-$35 VIP designated driver, $15-$25 general admission designated driver\nDetails: www.pubinthepark.org \"This is our first year. It's a new thing we are starting,\" said Laura Barron, director of the Lake in the Hills Parks and Recreation Department.\nSunset Park at 5200 Miller Road will be the setting for the beer-tasting party set to run from 3 to 7:30 p.m.\n\"It's a very large park. We can accommodate thousands,\" said Barron. \"Being our first year, we're shooting for 1,000. That's our goal.\"\nBarron said local and regional brewers will be in attendance, including some from Algonquin, Crystal Lake and points north and west, such as Wisconsin and Colorado.\n\"We're going to have a lot of fall brews -- pumpkin, some ciders -- and we'll even have some root beers,\" she said.\nBob Boyer owns Algonquin's Village Vintner Winery and Brewery with his brother, Steve.\nThe company started out as a winery 10 years ago and added a brewery and restaurant three and a half year ago.\n\"Right now, we have out our Oktoberfest (lager). We'll probably be bringing that,\" Boyer said. \"We do a lot of seasonals. We usually have about eight of our own on tap.\"\nBoyer said Village offers vanilla cream, redhead and Scottish ales, as well as a stout known as coconilla, a combination of chocolate and vanilla flavors.\nThe creative process is ongoing, he said.\n\"We have a new beer coming out,\" he said. \"We haven't named it yet.\"\nBarron said food trucks will offer grilled chicken, pizza, Italian dishes and gourmet cupcakes at Pub in the Park.\n\"It's a really good pairing with the craft beers,\" she said.\nAnd an act called Felix and Fingers will perform on dueling pianos.\n\"They take requests. It's going to be a really good time,\" said Barron.\nBarron said the event is a fundraiser for the People for Parks Foundation of Lake in the Hills, a nonprofit organization that provides park equipment and grants scholarship funds for needy families that can't otherwise afford parks and recreation programs.\n\"We needed a big event we can do annually so we can continue to provide scholarships,\" she said.\nTickets are cheaper if purchased in advance; a $10 surcharge will be added for each ticket purchased at the door.\nTickets are $75 for VIP advance tickets, a price that includes a sampling glass, 15 four-ounce beer tastings, a commemorative T-shirt and access to VIP restrooms. It also gets attendees entrance at 3 p.m., a full hour before general admission tickets allow entrance.\nVIP ticketholders also get to taste a selection of special brews that won't be available to general admission ticketholders.\nGeneral admission tickets are priced at $45 for tickets purchased in advance. Ticketholders may enter at 4 p.m. and each will receive a sampling glass and 15 four-ounce beer tastings.\nThere're also a couple of designated driver ticket options. VIP designated drivers, who pay $25 to get in if they buy tickets in advance or $35 if they buy them at the door, get $5 in food coupons, complimentary water and soda, early admission, a T-shirt and VIP restroom access.\nGeneral admission designated driver tickets are priced at $15 for advance purchases and $25 at the door.\nBarron said about 50 volunteers will help with taking tickets, checking IDs and keeping ice and water supplies replenished.\nThe event will go on, rain or shine, she said.\n\"We'll have tents,\" she said. There also will be some pub-style tables and seating, she said.\nBut please, don't bring the kids. No one younger than age 21 will be admitted. Attendees may not bring pets, other than service animals, or outside food or drink.\nBarron said the event is being promoted on Facebook and Twitter.\n\"We're getting a lot of feedback that people are coming,\" she said.\n News Dining Festivals/Fairs Night Life Algonquin East Dundee Huntley Lake in the Hills Naperville West Dundee", "external_links": ["https://twitter.com/share"], "published": "2015-10-19T22:33:00.000+03:00", "crawled": "2015-10-20T06:35:40.787+03:00", "highlightTitle": ""}