{"organizations": [], "uuid": "6a93c6a54635488da103e4007dfce63d737fb964", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.india.com", "main_image": "http://s3.india.com/wp-content/uploads/2015/10/dadri-incident.jpg", "site_section": "http://www.india.com/feed/", "section_title": "India | Latest India News | Get Free India.com Email | Live Cricket and Entertainment News at India.Com", "url": "http://www.india.com/news/india/dadri-lynching-incident-mha-says-stop-politics-direct-states-to-act-strictly-against-people-invoking-communal-disharmony-603866/", "country": "US", "title": "Dadri lynching incident: MHA says stop politics, direct states to act strictly against people invoking communal disharmony", "performance_score": 0, "site": "india.com", "participants_count": 1, "title_full": "Dadri lynching incident: MHA says stop politics, direct states to act strictly against people invoking communal disharmony", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T18:00:00.000+03:00", "replies_count": 0, "uuid": "6a93c6a54635488da103e4007dfce63d737fb964"}, "author": "Saurav Mukherjee", "url": "http://www.india.com/news/india/dadri-lynching-incident-mha-says-stop-politics-direct-states-to-act-strictly-against-people-invoking-communal-disharmony-603866/", "ord_in_thread": 0, "title": "Dadri lynching incident: MHA says stop politics, direct states to act strictly against people invoking communal disharmony", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Dadri lynching incident: MHA says stop politics, direct states to act strictly against people invoking communal disharmony By Saurav Mukherjee on October 5, 2015 at 8:30 PM Comments \nNew Delhi, Oct 5: As the politics on the much debated issue of Dadri lynching incident took place on Monday last is increasing with each minute, the Union Ministry of Home Affairs have directed the state governments to take stringent actions against those who are trying to incite communal tensions on Monday evening. With politicians making the life hell for the victim’s kin by making visits and giving insensitive comments, the ministry has taken the issue very seriously. (Also Read: Dadri lynching incident: BSP adds Rs 11 lakhs financial aid for Akhlaqh’s kin, Centre says stop politics on it ) \nIn the advisory issued by the Union Home Ministry on Monday, it stated the State government saying that there is zero tolerance for any attempt to weaken the secular fabric of nation and had advised them to take strictest action as per law against such elements without any exception whatsoever. The Ministry was reacting to the recent comments by politicians and non-politicians on the sensitive issue, which had already disturbed the atmosphere in the country. \nLeaders from All India Majlis-E-Ittehadul Muslimeen to Rashtriya Swayamsevak Sangh have been saying some provoking speeches. Be it Akbaruddin Owaisi or Sadhvi Prachi, all what they have done is made the situation worse. Akbaruddin had said that the Muslims can revert back it situations turn grim, while Saqdhvi had said that what happened in Dadri was right. Samajwadi Party announced an ex-gratia of Rs 45, plus government jobs to Akhlaqh’s kin, while Bamujan Samaj Party had tried to increase the pain by helping them with Rs 11 Lakh. (Also Read: Dadri lynching: ‘Save me, call police’, said Akhlaq in his last call to Hindu friend ) \nThere seems to be no end on the political visits too. Be it Congress vice-president Rahul Gandhi or Delhi Chief Minister Arvind Kejriwal, all are trying to raise their political vote banks. This has certainly made the central government concerned. An investigation has already been initiated into the incident and with things now to improve, provided no further politics done onto the in issue. \nUnion Home Minister Rajnath Singh too have tried his best and said that politics on these types of sensitive issues is not appropriate and have condemned the incident. Speaking to the media on Sunday he said, “ Kahi par koi ghatna hoti h, wo unfortunate hoti h. Usey rajneetikaran ya communal colour dene ki koshish nahi kii jaani chahiye (Any incident that takes place is unfortunate. It must not politicized, should not be given communal colour).” (Also Read: Dadri lynching: BJP MLA Sangeet Som demands strict law against cow slaughtering; calls Azam Khan ‘mentally ill’ ) \nBored with the political visits, Akhlaqh’s son Sartaj, who works as a technician in the Indian Air Force had requested the state government that they don’t want to meet any of the political visit, but what they want is a fair probe. As per to the reports, 10 people have been arrested. Mohammed Akhlaqh, 55, who was beaten down to death, while his 22-year-old son Danish son was critically injured by a mob on which barged into their house following rumours that the family had killed a brown calf and kept in meat in the fridge, on Monday night. \n  8:32 PM Topics:", "external_links": [], "published": "2015-10-05T18:00:00.000+03:00", "crawled": "2015-10-05T19:20:22.048+03:00", "highlightTitle": ""}