{"organizations": [], "uuid": "da12843e9bef5a5c00c9dbbac11ff2f68525edb8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.heraldscotland.com", "main_image": "http://www.heraldscotland.com/resources/images/4288655/", "site_section": "http://www.heraldscotland.com/arts_ents/", "section_title": "Arts and Entertainment | Herald Scotland", "url": "http://www.heraldscotland.com/arts_ents/13801144.Scots_filmmakers__Perfect_Strangers_set_for_homecoming_at_Southside_Film_Festival/", "country": "GB", "title": "Scots filmmakers' Perfect Strangers set for homecoming at Southside Film Festival", "performance_score": 0, "site": "heraldscotland.com", "participants_count": 1, "title_full": "Scots filmmakers' Perfect Strangers set for homecoming at Southside Film Festival (From Herald Scotland)", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T03:49:00.000+03:00", "replies_count": 0, "uuid": "da12843e9bef5a5c00c9dbbac11ff2f68525edb8"}, "author": "heraldscotland.com", "url": "http://www.heraldscotland.com/arts_ents/13801144.Scots_filmmakers__Perfect_Strangers_set_for_homecoming_at_Southside_Film_Festival/", "ord_in_thread": 0, "title": "Scots filmmakers' Perfect Strangers set for homecoming at Southside Film Festival", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Award winning Scottish filmmakers Ryan Hendrick and David Newman’s acclaimed short film Perfect Strangers is coming home, thanks to a screening at Glasgow's Southside Film Festival.\nSince premiering at the prestigious Cannes Film Festival in May, the Christmas comedy has been watched across the globe, but now the pair are eagerly awaiting their first opportunity of a home audience.\nIn it’s fifth year, the Southside Film Festival has chosen to screen Perfect Strangers as part of this year’s local short film line up.\nBAFTA nominated director Hendrick said: \"We are thrilled that our little film is finally returning home for its first Scottish screening after a successful few months on the festival circuit. We were so incredibly lucky to be able to take Perfect Strangers to Cannes - it has opened so many doors for us.”\nPerfect Strangers tells the story of two people stranded in the Scottish Highlands on Christmas Eve, who team up to try and get home in time for the big day.\nShot on Rannoch Moors last year, the 26 minute production was a testing ground for the duo, as they prepare to embark on their debut feature film, Journey Bound - a comedy road movie starring Ford Kiernan, Clare Grogan, Sylvester McCoy and Rutger Hauer.\n“It is crucial to enable independent filmmakers working with very little resources to get their films out there. It is s incredibly challenging on the festival circuit and you always receive far more rejections than you do acceptance notices,” Hendrick added.\nShare article You can see Perfect Strangers during the festival on Sunday 11th October at 4.30pm at the Glad Cafe on Pollockshaws Road.\nFor more information visit the Facebook page, at www.facebook.com/perfectstrangersxmas , or the Southside Film Festival website via wwwsouthsidefilm.co.uk", "external_links": ["https://twitter.com/share?url=", "https://www.facebook.com/perfectstrangersxmas", "https://www.facebook.com/sharer/sharer.php?u="], "published": "2015-10-03T03:49:00.000+03:00", "crawled": "2015-10-03T06:02:10.936+03:00", "highlightTitle": ""}