{"organizations": [], "uuid": "cb1ba24d42b13c4fcfb1b57ebbf07bd7048ed123", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ocregister.com", "main_image": "http://images.onset.freedom.com/ocregister/gallery/nvra4s-b88509282z.120151005093443000gidcb9oo.10.jpg", "site_section": "http://ocregister.com//common/rss/rss.php?catID=18926", "section_title": "The Orange County Register - News Headlines : Entertainment", "url": "http://www.ocregister.com/articles/parents-686129-nguyen-says.html", "country": "US", "title": "Playwright returnsto his family's roots", "performance_score": 0, "site": "ocregister.com", "participants_count": 0, "title_full": "Playwright returnsto his family's roots - The Orange County Register", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "cb1ba24d42b13c4fcfb1b57ebbf07bd7048ed123"}, "author": "", "url": "http://www.ocregister.com/articles/parents-686129-nguyen-says.html", "ord_in_thread": 0, "title": "Playwright returnsto his family's roots", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Qui Nguyen"], "text": "Qui Nguyen came to South Coast Repertory expecting to write a play about comic book culture.\nInstead, he ended up returning to his roots.\nThe 38-year-old co-founder of the New York-based Vampire Cowboys theater company pioneered “geek theater,” a genre that appeals to the Comic-Con crowd with superheroes, zombies and action-adventure, fantasy plots infused with martial arts, hip-hop, multimedia elements and a pop culture vernacular. So it seemed only natural that Nguyen would expand on his repertoire when he arrived at SCR, as part of the theater’s CrossRoads community-focused playwriting initiative.\nDuring his stay in Costa Mesa, he met with gamers and comic book collectors. But on the final day of his weeklong residency, Nguyen found himself at UC Irvine’s Southeast Asian Archive Center, flipping through photos of Vietnamese and Cambodian refugee camps in the U.S. in the 1970s.\n“I was surprised there was a folder of pictures from Arkansas. The photos that were of interest to me were from Fort Chaffee because that’s where my parents were,” he says. “I found myself spending an hour just looking at those photos to see if there were any that just happened to capture my mom or my dad or my grandmother.”\nThough he didn’t find pictures of family, images of the camps stuck with him. After he returned to Brooklyn, Nguyen decided to tell the tale of his parents’ journey from Vietnam to the U.S. The result is “Vietgone,” the first of five plays about their experience as immigrants.\n“Vietgone” is a love story about a couple who meet at the Fort Chaffee refugee camp in 1975. Most elements are based on Nguyen’s parents, who were, at first, reluctant to talk about sad times. To draw them out, the playwright used deception: “I would play dumb and say, ‘These are the facts I know,’ and they’re like, ‘Are you an idiot? That’s not what happened.’”\nHis parents eventually figured out his ruse. But by then, he had enough information to start a play. Any gaps, he decided, he would fill with his own style and way of doing theater. “It’s a nice mixture of fact and fantasy,” he says.\nSCR Artistic Director Marc Masterson sees “Vietgone” as a story everyone can relate to. “This is every immigrant’s story, but it’s an American story,” he says, “and I think a lot of people who aren’t Vietnamese, who don’t come from that background, can relate to it.”\nThis isn’t the first time Nguyen has written about his family. He starting writing his first play, “Trial By Water,’ while he was in graduate school, modeling his style after playwrights he admired – David Henry Hwang, Suzan-Lori Parks and Diana Son. The play, about brothers fleeing Vietnam, was produced in New York.\n“There were people who loved it, and people who hated it,” he says. “But it didn’t feel like me.”\nThen his parents attended. “It was a very telling moment because my mom saw it and she said that it was just OK. I said, ‘Mom, how do you know it doesn’t sound like me?’ and she said, ‘I don’t need to read what you write to know what you sound like. I can hear you talk, and you don’t sound like any of those characters,’” he recalls. “That kinda stuck with me.”\nSo, he says, he decided to take a pause on writing his family stories and double down on developing his voice through his work with Vampire Cowboys. That included a “secret agenda,” he says of his plays, which often feature heroes of color, LGBT and/or female characters.\n“People would come to see our superhero stories or our action-adventure stories and what they weren’t realizing was that we were reshaping how they saw things,” he says. “It’s really easy to find white, straight, male superheroes. We felt this was our opportunity to do the opposite – to celebrate stories of heroes from populations of people who didn’t get to see themselves depicted that way on the screen or stage.”\nFor “Vietgone,” Nguyen again wanted to break stereotypes, this time by creating two sexy lead characters that did not fit conventional portrayals of Asians: “complex characters with wants and needs and goals – just like any white character in a white romantic comedy.”\nHe’s hoping his hip-hop touches and contemporary – and often colorful – language will appeal to a younger generation of playgoers, who may be inspired to learn more about their own parents.\nThe next play in his series will look at the struggles his parents faced as new immigrants – things he wasn’t aware of when he was growing up. “They’re hiding and sheltering you from what made being an immigrant in America so hard: The fact that my dad felt marginalized; the fact that my mom didn’t feel educated,” he says. “That stuff was part of their experience that I never got to hear. I never got to see their struggle, so now that they’re talking to me about it, I’m experiencing it for the first time, and it’s breaking my heart.”\nBut like “Vietgone,” his work will be infused with Nguyen’s humor and wit. “As much as it is a love story between my mom and my dad, it’s also kinda a love story from me to my parents.”\nAnd in the audience at SCR will be Nguyen’s parents, seeing the play for the first time.", "external_links": [], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-05T21:31:39.273+03:00", "highlightTitle": ""}