{"organizations": [], "uuid": "fdccb39004c235ee6fcbc187f1f0a5727fe32bc8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/278850/arts-entertainment", "section_title": "Arts &amp; Entertainment - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30291443/new-fishermans-lounge-to-highlight-48th-annual-pacific-marine-expo", "country": "US", "title": "New Fisherman's Lounge to Highlight 48th Annual Pacific Marine Expo", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "New Fisherman's Lounge to Highlight 48th Annual Pacific Marine Expo - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T11:55:00.000+03:00", "replies_count": 0, "uuid": "fdccb39004c235ee6fcbc187f1f0a5727fe32bc8"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30291443/new-fishermans-lounge-to-highlight-48th-annual-pacific-marine-expo", "ord_in_thread": 0, "title": "New Fisherman's Lounge to Highlight 48th Annual Pacific Marine Expo", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Pacific Marine Expo, the West Coast's largest commercial marine trade show, will feature a new Fishermen's Lounge with a variety of displays and special events. The Expo will be held at CenturyLink Field Event Center in Seattle from Nov. 18-20.\nThis article was originally distributed via 24-7 Press Release Newswire. 24-7 Press Release Newswire, WorldNow and this Site make no warranties or representations in connection therewith. SEATTLE, WA, October 19, 2015 /24-7PressRelease/ -- Pacific Marine Expo has always served as the annual event for fishing and workboat industry members to catch up with friends and meet new friends. This year, the Fisherman's Lounge will provide the perfect gathering place at the Expo.\n\"The new Fisherman's Lounge will be a great place to take a break from walking the Expo floor, grab a drink with your friends, and check out a variety of fun displays and special events,\" said Jes Hathaway, editor in chief of National Fisherman magazine, which sponsors the Expo.\nPacific Marine Expo, the West Coast's largest commercial marine trade show, returns to CenturyLink Field Event Center in Seattle from Nov. 18-20. This year's show features a keynote address by Deadliest Catch television star Capt. Keith Colburn of the Wizard, a comprehensive conference program with a wide range of industry-critical topics, and the Fisherman's Lounge, which will be open each day of the Expo.\nHathaway said the Fisherman's Lounge will include:\n- Short films from the Commercial Fishing Film Festival\n- Maritime photography and art displays, including work from Karen Ducey and Chelsea Stephen\n- Puget Sound Maritime historical display\n- Book signing with author and historian Chuck Fowler (Wednesday)\n- Book signing and photo exhibit with Jana Suchy (Thursday)\n- Book signing and meet & greet with John van Amerongen (Thursday)\n- Book signing and meet & greet with a group of FisherPoets (Friday)\n- Fish Tales: A chance to record your best fishing stories\n- Cash bar and ample seating\nFor details on the Lounge, visit www.pacificmarineexpo.com/fishermans-lounge .\nThe 48th Annual Expo will serve all aspects of the market, including commercial vessel owner and operators, commercial fishermen, boat builders and seafood processors. In 2014, PME attracted more than 8,000 visitors from 40 states and 24 countries.\n\"Last year was a record year for the Expo, with nearly 550 exhibitors in an expanded exhibit hall showcasing the latest in equipment, propulsion, new products, and builder and supplier services,\" said Denielle Christensen, Expo show director. \"With the continued growth and strength of the fishing and workboat industries, we expect another terrific year in 2015.\"\nQualified members of the industry can attend the Exhibit Hall, educational conference sessions and keynote for free by registering on or before Nov. 17. Non-exhibiting suppliers can register for $50. To register, visit www.PacificMarineExpo.com .\nCompanies interested in exhibiting should contact Chris Dimmerling, sales director, at 207-842-5666 or cdimmerling@divcom.com .\nFor further information on PME, visit www.PacificMarineExpo.com .\nAbout Pacific Marine Expo\nPacific Marine Expo is part of the Diversified Communications portfolio of commercial marine events, publications and eMedia products. Pacific Marine Expo is the largest and longest running commercial marine tradeshow on the West Coast and is annually held in Seattle. The Expo serves all aspects of the market, including commercial vessel owners, commercial fishermen, boat builders, workboat operators and seafood processors.\nFor further information, visit www.PacificMarineExpo.com .\nAbout Diversified Communications\nDiversified Communications, based in Portland, Maine, provides information and market access through face-to-face events, publications and digital media. Diversified serves a number of industries, including seafood, foodservice, natural and organic products, healthcare, commercial marine industries, and business management. Diversified operates divisions in the US, Australia, Hong Kong, India, the UK and Canada. For more information, visit: www.divcom.com .\nFOR MORE INFORMATION\nKen Saunderson (206) 282-6858\nKen@SaundersonMarketingGroup.com\nInformation contained on this page is provided by an independent third-party content provider. WorldNow and this Station make no warranties or representations in connection therewith. If you have any questions or comments about this page please contact pressreleases@worldnow.com.\nFor the original version on 24-7 Press Release Newswire visit: http://www.24-7pressrelease.com/press-release/new-fishermans-lounge-to-highlight-48th-annual-pacific-marine-expo-414330.php", "external_links": ["http://www.pacificmarineexpo.com/fishermans-lounge", "http://purl.org/rss/1.0/modules/content/", "http://www.24-7pressrelease.com/press-release/new-fishermans-lounge-to-highlight-48th-annual-pacific-marine-expo-414330.php"], "published": "2015-10-19T11:55:00.000+03:00", "crawled": "2015-10-19T11:07:50.932+03:00", "highlightTitle": ""}