{"organizations": [], "uuid": "66702c708cd2c4c965dba4fbde8b2032897c5c2c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.india.com", "main_image": "http://s3.india.com/wp-content/uploads/2015/10/12113429_1672337019647143_4752183516836662090_o.jpg", "site_section": "http://www.india.com/feed/", "section_title": "India | Latest India News | Get Free India.com Email | Live Cricket and Entertainment News at India.Com", "url": "http://www.india.com/showbiz/brett-lee-excited-about-his-upcoming-movie-unindian-622653/", "country": "US", "title": "Brett Lee excited about his upcoming movie unINDIAN", "performance_score": 0, "site": "india.com", "participants_count": 1, "title_full": "Brett Lee excited about his upcoming movie unINDIAN", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T08:25:00.000+03:00", "replies_count": 0, "uuid": "66702c708cd2c4c965dba4fbde8b2032897c5c2c"}, "author": "Wires English | Press Trust of India", "url": "http://www.india.com/showbiz/brett-lee-excited-about-his-upcoming-movie-unindian-622653/", "ord_in_thread": 0, "title": "Brett Lee excited about his upcoming movie unINDIAN", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments \nMelbourne, Oct 12: Former cricketer Brett Lee is turning full-time actor with Indo-Australian romantic comedy, “unINDIAN” and he says he is excited about the film, which is set to hit the screens on October 15 here.The former fast bowler will be sharing screen with Indian actress Tannishtha Chatterjee in the film which has been helmed by Sydney-based Indian director and producer Anupam Sharma.”I am super excited about the movie and I m very pleased that it is all done and dusted now,” Lee told PTI at the red carper launch of the film in Melbourne. (Also Read: Watch official trailer of UnIndian: Brett Lee romances hot Bengali actress Tannishtha Chatterjee in Bollywood debut!) \n“We think there is a great message in the film that love has no boundaries. My character has fallen in love with a beautiful Indian woman,” Lee said.Lee revealed he took a five-week acting camp with vocal specialist Bill Pepper and acting expert Kevin Jackson in Sydney in order to prepare for the role.”I did take four or five weeks acting coaching before the shooting of the film. Little bit of crash course,” Lee said.One of the most popular Australian cricketer in India, who has managed to say a dialogue in Hindi in the film, said he would love to go down the track of acting career. \n“There are few offers from other Bollywood directors and I would love to go down the track. However, right now I am concentrating on my Australian film.”The film was launched at a gala events organised in Melbourne and Sydney last week which was attended by several dignitaries and community members.Sharma said the movie will hit around 100 screens across Australia this week. “I am pretty numb and overwhelmed about the film. The response so far has been amazing during the two launches,” Sharma said.”We are looking at options to launch the film in India but right now we are concentrating on Australian screens.” \nIn August this year, “unINDIAN” was selected to be screened at Montreal World Film Festival, where it had its world premiere.“It is an honour and a pleasant surprise to be selected to Montreal and also have the world premiere there,” Sharma said.The film also stars John Howard, Tiriel Mora, Maya Sathi, Arka Das, Sarah Roberts, Adam Dunn, Nicholas Brown, Kumud Merani, Supriya Pathak, Akash Kurana and Gulshan Grover, with a special appearance by Pallavi Sharda.The film is produced by Sharma and Lisa Duff, from a story and screenplay by Thushy Sathi, with executive producers Devendra Gupta and Chandru Tolani. \n  10:55 AM Topics:", "external_links": [], "published": "2015-10-12T08:25:00.000+03:00", "crawled": "2015-10-12T09:38:30.189+03:00", "highlightTitle": ""}