{"organizations": [], "uuid": "e86b4b74040ef1288b17459e9dc9af321078bee0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailyherald.com", "main_image": "http://www.dailyherald.com/storyimage/DA/20151013/ENTLIFE/151019970/AR/0/AR-151019970.jpg&amp;updated=201510130642&amp;imageversion=Facebook&amp;exactH=630&amp;exactW=1200&amp;exactfit=crop&amp;noborder", "site_section": "http://www.dailyherald.com/rss/feed/?feed=entlife", "section_title": "DailyHerald.com &gt; Life &amp; Entertainment", "url": "http://www.dailyherald.com/article/20151013/entlife/151019970/", "country": "US", "title": "Lean and Lovin' It: 23 years of Lean and Lovin' It", "performance_score": 0, "site": "dailyherald.com", "participants_count": 1, "title_full": "Lean and Lovin' It: 23 years of Lean and Lovin' It - DailyHerald.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T14:42:00.000+03:00", "replies_count": 0, "uuid": "e86b4b74040ef1288b17459e9dc9af321078bee0"}, "author": "Don Mauer", "url": "http://www.dailyherald.com/article/20151013/entlife/151019970/", "ord_in_thread": 0, "title": "Lean and Lovin' It: 23 years of Lean and Lovin' It", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Twenty-three years ago I contacted the Daily Herald's Food Editor, Olivia Wu, asking to write a column about low-fat foods and to share lower-in-fat recipes. That turned out to be my lucky day (it was also my birthday) because, after showing Wu and the editors here a sample column, they told me they'd give me a chance. Lean and lovin' It was about to be born just two months after that day in August 1992.\nA bit of trivia: My new column was almost called Low-fat and Loving It. Wu smartly believed that the words \"Low-Fat\" would be too restrictive and could limit the column's popularity and shorten its existence to as long as dietary fat restrictions were hot. Wu said, and I paraphrase here: \"What if studies determine that fats turn out to be healthier than now believed?\"\nWu was wise and prescient; you'll see why in a bit.\nI can't take credit for changing the words low-fat to lean; that was Wu. However, I will take credit for making the contraction from loving to lovin'.\nMy first Lean and Lovin' It column appeared on Thursday, Oct. 8, 1992. I wore a bow-tie in my picture to honor James Beard, the father of American cookery.\nAt that time, Beard was famous for many things; he also created and starred in the very first \"live\" American television cooking show on NBC apply titled: \"I Love to Eat.\" It was just 15 minutes in length.\nOver the years I followed in Beard's footsteps by almost always cooking \"live\" on television. I also strode along Julia Child's path by having fun when things went wrong on \"live\" TV, which it frequently did.\nHere's an example: in the middle of a \"live\" PBS fundraiser broadcast, accidentally undercooked potato chunks meant to be turned into mashed potatoes, literally, flew out of my electric mixer's bowl. Off camera, they threw those potato chunks back to me so I could keep going. The folks answering the phones in that PBS studio roared their delight.\nIn those early years, thanks to the Daily Herald, I filled adult continuing education classrooms across three county's sharing my low-fat story. I met hundreds of Daily Herald readers and made many new friends. I loved every one of those classes.\nOne significant column change has been the addition of pictures of each finished recipe. Creating those pictures has been both challenging and fun. I believe you want to see what happens if you follow my recipes and always hope those images tantalize you.\nThis past year it turned out that trans (partially hydrogenated) fats couldn't be more unhealthy. Reviled coconut oil is now a dietary darling. And, the biggest surprise, dietary cholesterol is a big nonissue. Wu nailed that one.\nTo help you dodge as much sugar as possible, you need to know how much sugar is in a serving. That's why sugars was added to the nutrition values at the end of every Lean and Lovin' It recipe.\nThis year, as have all the years I've been writing Lean and Lovin' It, has been amazing. I keep learning about how to eat healthier, apply that knowledge to my recipes and share them with you.\nWithout you, each of you, this column would not continue to be possible. Thank you for gifting me with the opportunity to go to joy instead of work every time I write a column.\nHow could anything be better than what James Beard created? My updated zucchini bread has all the good things that Beard crafted, including big flavor. What it has less of is added fat (half) and added sugars (half).\n• Don Mauer welcomes questions, comments and recipe makeover requests. Write to him at don@ theleanwizard.com.\nRelated Article\nBetter-Than-Beard's Zucchini Bread with Walnuts Life & Entertainment Food Mauer, Don", "external_links": ["https://twitter.com/share"], "published": "2015-10-13T14:42:00.000+03:00", "crawled": "2015-10-13T16:57:30.169+03:00", "highlightTitle": ""}