{"organizations": [], "uuid": "56aa6f3398a946e486035d453a024cd4f85c598a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cosmopolitan.com", "main_image": "http://cos.h-cdn.co/assets/15/42/1445005103-screen-shot-2015-10-16-at-101745-am.png", "site_section": "http://www.cosmopolitan.com/entertainment/", "section_title": "Entertainment News and Celebrity Gossip - Cosmopolitan", "url": "http://www.cosmopolitan.com/entertainment/a47811/greys-anatomy-season-12-episode-4/", "country": "US", "title": "Grey's Anatomy Episode 4 Recap & Review – Old Time Rock and Roll", "performance_score": 0, "site": "cosmopolitan.com", "participants_count": 1, "title_full": "Grey's Anatomy Episode 4 Recap & Review – Old Time Rock and Roll", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T18:21:00.000+03:00", "replies_count": 0, "uuid": "56aa6f3398a946e486035d453a024cd4f85c598a"}, "author": "Cosmopolitan.com", "url": "http://www.cosmopolitan.com/entertainment/a47811/greys-anatomy-season-12-episode-4/", "ord_in_thread": 0, "title": "Grey's Anatomy Episode 4 Recap & Review – Old Time Rock and Roll", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I try to stay off Twitter on Shondaland nights (West Coast problems!), but was on long enough last night to catch Ellen Pompeo's warning that the last five minutes of last night's episode were going to blow people away. I disagree with her about the timing — for me, it was all about the last 30 seconds — but holy hell, she wasn't kidding.\nAnd let's start there! It turns out that Callie's new girlfriend, Penny, is the doctor who failed to order the CT that could've easily saved Derek. Penny looks absolutely shocked to be seeing Meredith, although I side-eye the logistics around that a little bit. Like, if your new girlfriend invited you to a gathering of colleagues, and you knew you'd sort of contributed to the death of a surgeon who used to work with her, wouldn't you ask for a few key details about the guest list before you agreed to show up at a Sloane/Grey Memorial doctors' party?\n At any rate, that bombshell last-second reveal worked so well because the rest of the episode effectively convinced us (well, at least me, and by now we know I'm gullible enough to fall into whatever trap Shonda Rhimes lays for me) that Meredith was doing pretty well, all things considered. She even says she's happy! And she's not so beset by grief that she was unable to use her and Derek's story to give the interns a much-needed lesson in breaking bad news to patients. She tells Maggie that she had her great love story — now she has her career and her family, and that's enough. I ship Meredith Grey and happiness, hardcore, but kind of can't wait to see what chaos Penny's arrival will stir up for her.\nMore From Cosmopolitan We get to see the morning after Maggie's tryst with Douchebeard, and she spends the rest of the day in a weird, flail-y tailspin about him before they wind up having on-call room (or at least hospital office) sex again. There's a unique enough little spin on this story that keeps it fun, but the trouble with it — and with the \"let's teach the interns how to be humane about death!\" story — is that we've seen these stories play out on Grey's time and time again. I'm glad to see that there's a gender swap in the Maggie/Douchebeard power dynamic — the woman is professionally and probably sexually on top — but that's not quite enough to make this story feel as fresh as it needs to.\nA few stray, great moments in the episode: Arizona bonding with and finding hope in an elderly man about to propose to his girlfriend; Meredith's mom's house being full of doctors/chosen family for a dinner party; the hospital's new, lighter sets, which actually feel like a real hospital, not a hospital on a soundstage someplace. (I probably should've noticed that sooner, but I typically prefer examining emotional scenery, not literal sets.)\nAnd there's a plotline that does feel much fresher: We actually get a pretty solid chunk of Stephanie storytelling throughout the episode, which is great, because Jerrika Hinton is super-talented and deserves more to do than following department heads around with charts. Amelia tasks her with implementing an early ambulation protocol with a new patient — in other words, Stephanie is in charge of dragging the patient out of bed less than a day after surgery, trying to get her up and walking while she's still in terrible pain. (This is actually a medically sound treatment method, for the record.)\nBut Stephanie's completely overwhelmed, which is a theme throughout the episode. At one point, Webber illustrates this theme by helping an intern cut a brain into neat pieces and spread them out on a slab, like slice and bake cookies, which is fine, as it's not like I ever wanted to eat anything baked ever again. Amelia's surprised when Stephanie tries to back out of the task by sending Jo in her place and demands to know what's up. Stephanie then explains that she was in a clinical trial for sickle cell anemia as a child and was often strapped down to have medical procedures done against her will. As a result, some specific patient situations freak her out.\nJo's response, bafflingly enough, is to accuse Stephanie of lying and to correspondingly tattle to Amelia. It doesn't quite make sense given what we know about Jo and Stephanie's relationship, but maybe Jo is jealous of Stephanie's natural ability to get ahead? And so while it's touching to see Amelia eventually believe and apologize to Stephanie, and to see Stephanie ultimately succeed in a patient situation that scares her, Jo's role in the whole thing just doesn't hold up … although I'm still curious to see what this does to their relationship. It doesn't seem like something a quick \"I'm sorry!\" at the beginning of next week's episode will fix.\nAlso, are Jo and April almost never in scenes together because they literally have the exact same haircut? These are the questions that keep me up Thursday nights, folks.\n​Follow Lauren on Twitter .", "external_links": ["https://twitter.com/L_Hoff?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Eauthor"], "published": "2015-10-16T18:21:00.000+03:00", "crawled": "2015-10-16T20:39:11.656+03:00", "highlightTitle": ""}