{"organizations": [], "uuid": "a070e1c36a11a412ae63e855e16198e4d9c180bf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.detroitnews.com", "main_image": "http://www.gannett-cdn.com/-mm-/12e0012037c6341e7cecb64961078ca7e37b3957/c=0-647-1400-1435&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/02/DetroitNews/B99310949Z.1_20151002183257_000_GR2JOGNV.2-0.jpg", "site_section": "https://feeds.feedblitz.com/detroit/entertainment#", "section_title": "Detroit News - Entertainment", "url": "http://www.detroitnews.com/story/opinion/columnists/adam-graham/2015/10/02/adam-graham-apple-music-future-music/73239448/", "country": "US", "title": "Graham: Will the public finally bite on Apple Music?", "performance_score": 0, "site": "detroitnews.com", "participants_count": 1, "title_full": "Graham: Will the public finally bite on Apple Music?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T21:32:00.000+03:00", "replies_count": 0, "uuid": "a070e1c36a11a412ae63e855e16198e4d9c180bf"}, "author": "detroitnews.com", "url": "http://www.detroitnews.com/story/opinion/columnists/adam-graham/2015/10/02/adam-graham-apple-music-future-music/73239448/", "ord_in_thread": 0, "title": "Graham: Will the public finally bite on Apple Music?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Rapper Drake’s “What a Time to be Alive” album debuted at No. 1 on Billboard’s Top 200 albums chart. (Photo: Kevin Winter / Getty Images) \nIt’s crunch time for Apple Music.\nThis week the streaming service, which offers on-demand listening for millions of songs, turned 3 months old, meaning the free 90-day trial users were offered at launch is now up. Now it’s a question of whether those users turn into subscribers — plans begin at $9.99 a month — and if Apple Music is the future of streaming, a bust, or somewhere in between.\nApple Music’s success could go a long way in determining the way we consume music going forward, and the future of the music business. Music sales continue to decline and streaming is here to stay, but consumers have gotten so used to listening to music for free — whether via Pandora, YouTube or other services — that convincing them to pay a monthly subscription fee to listen to those same songs is like trying to stuff a very big genie back inside a very small bottle.\nPeople have no problem paying monthly bills for cable or their cell phones, or paying $5 for a cup of coffee at Starbucks. That people have to be convinced to pay for music shows how much music has been devalued in the eyes of the public since the dawn of the Napster age. At this point, it’s just expected to be free.\nApple Music was a high-profile launch, and if subscription-based streaming is going to be a successful concept, Apple — with its deep well of consumer trust and reputation as a tech innovator — had a good shot at being the company to sell that idea to the public. But Apple Music has not been the immediate slam dunk many expected, or hoped, it would be.\nBeats 1, the service’s global radio station, has been a success, proving in a world of fractured listenership there’s value in the singularity of everyone listening to the same thing at the same time. Beats 1 was the launchpad for Drake and Future’s surprise mixtape “What a Time to Be Alive” (everyone heard it for the first time at the same time), and Apple Music and iTunes in turn had an exclusive five-day window on the project. (The album debuted at No. 1 on Billboard’s Top 200 albums chart with 375,000 first-week album equivalent units, a figure that combines sales and streams.)\nApple Music also had success with its exclusive releases, including Dr. Dre’s “Compton” album, which is only available on the service (and on iTunes). But other features have been disappointing — users complained about Apple Music’s functionality, its search capabilities and its “Connect” feature, which is a glorified Instagram feed of artist promotions.\nStill, early numbers are promising for the service. Last month, the New York Post reported around 15 million users had signed up, which was in line with the company’s projected figures. Apple execs are reportedly hoping half of those users convert to paid subscriptions, which would give them roughly a third of the 20 million subscribers who pay for Spotify, Apple’s chief competition in the paid streaming business.\nBut the biggest hurdle remains the idea that music is worth paying for. Apple Music’s free trial is up. Will people open up their wallets for more? Now it’s time for Apple to give them that reason.\nagraham@detroitnews.com \n@grahamorama", "external_links": [], "published": "2015-10-02T21:32:00.000+03:00", "crawled": "2015-10-03T01:52:41.443+03:00", "highlightTitle": ""}