{"organizations": [], "uuid": "71b5c231029ce5abfd5eb7e550f5a4438c230b22", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.daytondailynews.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/10/13/52/95/101515lifenosferatu.jpg", "site_section": "http://www.daytondailynews.com/list/rss/entertainment/local-entertainment-news/aD6N/", "section_title": "Local entertainment news", "url": "http://www.daytondailynews.com/news/entertainment/nosferatu-to-rise-at-state-theatre/nn2mR/", "country": "US", "title": "‘Nosferatu’ to rise at State Theatre, with live score by Equinox", "performance_score": 0, "site": "daytondailynews.com", "participants_count": 1, "title_full": "‘Nosferatu’ to rise at State Theatre, with live score by Equinox | www.daytondailynews.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "71b5c231029ce5abfd5eb7e550f5a4438c230b22"}, "author": "Brett Turner", "url": "http://www.daytondailynews.com/news/entertainment/nosferatu-to-rise-at-state-theatre/nn2mR/", "ord_in_thread": 0, "title": "‘Nosferatu’ to rise at State Theatre, with live score by Equinox", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "One of the events that’s given Halloween in Springfield its bite is about to rise again.\n“Nosferatu,” one of the classic vampire horror films of the silent era and all-time, will be screened for the first time in five years at 8 p.m. Friday and Saturday at the State Theatre.\nPart of Springfield StageWorks 2015-16 season and presented by Jim and Nike Lagos, the screening will be accompanied by a live original score by local music ensemble Equinox.\nWith its classic decor and atmosphere, the State has been a perfect setting for silent films presented by StageWorks over the years, including showings of classics “Metropolis,” “The Cabinet of Dr. Caligari” as well as “One Small Step,” an original film about space.\nAll had scores from Equinox, consisting of Larry Coressel, Doug Baumle, Andrew Gibson and Wayne Justice. The band has been together and done numerous recordings since the 1980s.\nJustice said, it’s always been back to “Nosferatu.”\n“People love seeing it at the State,” Justice said. “Nothing compares to seeing it there. With the music it’s an immersive experience.”\n“Nosferatu” is an unauthorized version of “Dracula” that has gained a classic reputation of its own in the horror genre.\nA film buff, Justice said he’s probably seen “Nosferatu” more than any other film, always on the screen. “It’s still incredibly creepy in a natural way,” Justice said of the film.\nIt became a Halloween seasonal favorite in 2005 and had its last showing in 2010 with strong attendance each time. Justice said the time was right to resurrect the story of Count Orlok.\nEquinox as added new instruments and songs for the score this year.\n“We try to make it a little new every time out,” Justice said. “Somebody who has seen it will find something new.”\nSeeing it in the State Theatre will bring back movie-going memories for a number of Springfielders before its closing in 1990.\nThere’s always a wide age range and a lot of people like to show up in costume, Justice said.\nA cash bar will also be available.\nSpringfield StageWorks will present the classic play “Waiting for Godot” in spring 2016 at the State.\nContact this contributing writer at bturner004@woh.rr.com.", "external_links": [], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-14T20:24:56.050+03:00", "highlightTitle": ""}