{"organizations": [], "uuid": "aa5a78bdef551eec0754b0e5a8f6756400312dad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://images.canberratimes.com.au/2015/10/21/6948668/Thumbnail1001759090gkf69nimage.related.thumbnail.320x214.gkf69e.png1445426046623.jpg.jpg", "site_section": "http://feeds.canberratimes.com.au/rssheadlines/entertainment.xml#", "section_title": "Canberra Times Entertainment Headlines", "url": "http://www.canberratimes.com.au/entertainment/tv-and-radio/the-bachelorette-australia-richie-eliminated-by-sam-frost-ahead-of-finale-20151021-gkf69e.html", "country": "AU", "title": "The Bachelorette Australia: Richie eliminated by Sam Frost ahead of finale", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "The Bachelorette Australia: Richie eliminated by Sam Frost ahead of finale", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T14:14:00.000+03:00", "replies_count": 0, "uuid": "aa5a78bdef551eec0754b0e5a8f6756400312dad"}, "author": "Ebony Bowden", "url": "http://www.canberratimes.com.au/entertainment/tv-and-radio/the-bachelorette-australia-richie-eliminated-by-sam-frost-ahead-of-finale-20151021-gkf69e.html", "ord_in_thread": 0, "title": "The Bachelorette Australia: Richie eliminated by Sam Frost ahead of finale", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "An emotional Sam Frost sending home Richie. Photo: Ten \nSam Frost sends Alex home after family visits Bachelorette Sam Frost is ready to shine Snezana wins Sam Wood's heart Handsome rope technician Richie has been eliminated by Sam Frost in an emotional penultimate episode of The Bachelorette .\nThe normally composed brunette broke down in tears during Wednesday's episode after giving her final two roses to real estate agent Michael and construction manager Sasha.\n\"I have a big crush on you.\" Photo: Ten \nDoubts over Richie's chances arose early in the episode as he struggled to tell Sam how he felt, confessing to having a crush on her while the other two men told Sam they were falling in love.\nAdvertisement Following a date in the snow, Sam grilled the rope technician over his inability to tell her how he felt. Gasps could be heard across the country as Richie gave the Bachelorette his last-ditch plea.\n\"I do have a big crush on you and I'm open to falling in love,\" he said.\nA concerned Sasha comforts Sam after a skydiving mishap. Photo: Ten \nRichie's inability to tell Sam how he felt was made only worse by the romantic dates she shared with finalists, Michael and Sasha.\nDespite a crippling fears of heights, frontrunner Sasha went beyond the call of dating and agreed to go skydiving with his thrill-seeking love interest.\nHe also went into protective boyfriend mode as Sam suffered a dizzy spell following their jump, something Sam later said brought them \"so much closer\".\nMichael tells Sam he's falling for her at a candlelit aquarium dinner. Photo: Ten \n\"Sash was so supportive and calming the whole time.\"\nThe brawny Sydneysider later told Sam she made a good impression on his family and that he was falling in love with her.\n\"Every time i see you I'm falling more and more in love with you.\"\nOn a romantic whale-watching and aquarium dinner date, Michael also told Sam he was falling in love with her.\n\"You know I am falling for you. Make no mistake, I really am falling for you.\"\nHe also put the 26-year-old at ease over her anxiety that the men were falling for the unreal, glamorous television version of her.\n\"Anyone can look good in a suit or look good in a dress, but it's that real stuff I appreciate,\" he said\n\"It's the unspoken moments, that's when I am falling in love with you.\"\nIt looks like the competition between Sasha and Michael is only narrowing. Stay tuned, folks.\nThe Bachelorette finale airs at 7.30pm Thursday on Ten.", "external_links": [], "published": "2015-10-21T14:14:00.000+03:00", "crawled": "2015-10-21T17:26:50.738+03:00", "highlightTitle": ""}