{"organizations": ["AC Brew The New York Inventor Exchange", "AC Brew Taste"], "uuid": "0c708ffcc6c7a97334d703699485df872be7c5f7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "globenewswire.com", "main_image": "", "site_section": "http://globenewswire.com//Rss/subjectcode/4/Arts%2026%20Entertainment", "section_title": "GlobeNewswire: Arts & Entertainment", "url": "http://globenewswire.com/news-release/2015/10/10/775085/10152209/en/Taste-for-Cider-Is-Bringing-Back-More-Local-Orchards-To-World-Patent-Marketing-s-Cider-Drink-Invention-AC-Brew.html?f=22&fvtc=1&fvtv=Arts%2026%20Entertainment", "country": "US", "title": "Taste for Cider Is Bringing Back More Local Orchards To World Patent Marketing's Cider Drink Invention, AC Brew", "performance_score": 0, "site": "globenewswire.com", "participants_count": 0, "title_full": "Taste for Cider Is Bringing Back More Local Orchards To World Patent Marketing's Cider Drink Invention, AC Brew", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T01:00:00.000+03:00", "replies_count": 0, "uuid": "0c708ffcc6c7a97334d703699485df872be7c5f7"}, "author": "", "url": "http://globenewswire.com/news-release/2015/10/10/775085/10152209/en/Taste-for-Cider-Is-Bringing-Back-More-Local-Orchards-To-World-Patent-Marketing-s-Cider-Drink-Invention-AC-Brew.html?f=22&fvtc=1&fvtv=Arts%2026%20Entertainment", "ord_in_thread": 0, "title": "Taste for Cider Is Bringing Back More Local Orchards To World Patent Marketing's Cider Drink Invention, AC Brew", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Taste for Cider Is Bringing Back More Local Orchards To World Patent Marketing's Cider Drink Invention, AC Brew The New York Inventor Exchange approves the AC Brew for licensing and trading intellectual property rights. October 10, 2015 18:00 ET | Source: World Patent Marketing \nLOS ANGELES, Calif., Oct. 10,   via PRWEB - World Patent Marketing , a vertically integrated manufacturer and engineer of patented products, announces the AC Brew, a beverage invention which provides a healthy and nutritious drink with apple cider vinegar but without that strong and tangy taste. \n\"The Cider Production industry is worth $293 million,\" says Scott Cooper, CEO and Creative Director of World Patent Marketing and Desa Industries Inc . \"As a result of the craft beverage craze that has occurred over the past decade, many consumers are expanding their preferences. Although massive growth is not likely to continue, consumers have indicated that their waning interest for traditional brews have been diverted to hard cider products or newer brews.\" \n\"People are looking for healthier alternatives, particularly when it comes to refreshing beverages,\" says Cattya Bella, Director of Product Development for World Patent Marketing Review. \"One of the things that people realize is that if the beverage has apple cider vinegar in it, more health benefits will be gained. The AC Brew is a refreshing beverage invention which contains apple cider vinegar but is delicious to drink at the same time.\" \nThe AC Brew is a beverage invention with apple cider vinegar as its main source of natural nutrients. Everyone knows that apple cider vinegar is good for the digestive system and even aids in the proper function of the body's immune system. However, a lot of people are still apprehensive to include this in their daily diet due to its strong and overly tangy taste. This invention is formulated to provide people with their healthy daily dose of apple cider vinegar without the unpleasant taste. It includes other natural ingredients such as tea and Stevia which helps in improving its overall flavor. \n\"The AC Brew will provide people with a healthy alternative to drinking delicious beverages,\" says inventor Roy G. \"Most people love to drink instant cold beverages to quench their thirst while having something sweet and tasty. The AC Brew is a beverage invention unlike anything else in the market because not only is it delicious and refreshing, it also provides people with a healthy dose of apple cider vinegar, an ingredient known to provide a whole lot of benefits to the body.\" \nEarl McKinley, a vegetarian and health food blogger from Los Angeles, CA, has this to say about the AC Brew: \"For those who are conscious about what they drink, it is difficult to purchase something that is not riddled with harmful preservatives. The AC Brew is a beverage invention which provides people with an all-natural drink with healthy ingredients such as apple cider vinegar that is surprisingly refreshing and tasty.\" \nThe AC Brew is a beverage invention which will provide so much health benefits without sacrificing flavor. \nAbout World Patent Marketing \nWorld Patent Marketing is an innovation incubator and manufacturer of patented products for inventors and entrepreneurs. The company is broken into eight operating divisions: Research, Patents, Prototyping, Manufacturing, Retail, Web & Apps, Social Media and Capital Ventures. \nWorld Patent Marketing is by your side every step of the way, utilizing our capital and experience to protect, prepare, and manufacture your new product idea and get it out to the market. The company sends representatives to to trade shows every month in order to further advocate for its clients. It is just part of the World Patent Marketing cost of doing business. \nWorld Patent Marketing Reviews \nWorld Patent Marketing complaints from clients are extremely rare which is demonstrated by its A+ rating with the Better Business Bureau and its five star ratings from consumer review sites including: Consumer Affairs, Google, Trustpilot, Customer Lobby, Reseller Ratings, Yelp and My3Cents. \nDesa Industries, Inc. doing business as World Patent Marketing is a proud member of the National Association of Manufacturers, Dun and Bradstreet, the US Chamber of Commerce, the South Florida Chamber of Commerce, the Greater Miami Chamber of Commerce, Association for Manufacturing Excellence, and the New York Inventor Exchange. Visit the worldpatentmarketing.com website. Contact us at (888) 926-8174 (US Eastern Time) or email bill(at)worldpatentmarketing(dot)com. \nThis article was originally distributed on PRWeb. For the original version including any supplementary images or video, visit http://www.prweb.com/releases/worldpatentmarketing/ac-brew/prweb12999472.htm World Patent Marketing Bill Flanagan +1 6465643919 Related Articles other press releases by World Patent Marketing Boating Safety Tips For Columbus Day Weekend Include Testing Out World Patent Marketing&#39;s Skip Drive Boating Propulsion System October 10, 2015 17:05", "external_links": [], "published": "2015-10-11T01:00:00.000+03:00", "crawled": "2015-10-11T05:03:48.389+03:00", "highlightTitle": ""}