{"organizations": [], "uuid": "0ade8fe04b7d0f71cb10d3dfff3680b5b4c08397", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "", "site_section": "http://www.financialexpress.com/section/lifestyle/", "section_title": "Lifestyle News:Entertainment News,Bollywood Latest News,Box Office Collection Report,Movie Reviews | The Financial Express", "url": "http://www.financialexpress.com/article/fe-columnist/column-the-fits-in-the-starts/151369", "country": "IE", "title": "Column: The fits in the starts", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Column: The fits in the starts | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T08:21:00.000+03:00", "replies_count": 0, "uuid": "0ade8fe04b7d0f71cb10d3dfff3680b5b4c08397"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/fe-columnist/column-the-fits-in-the-starts/151369", "ord_in_thread": 0, "title": "Column: The fits in the starts", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Editorial: Maruti goes to Japan Editorial: Start-up India Ola, Compliance The prime minister has mentioned start-ups more than once, in greater detail in Silicon Valley than earlier at Red Fort. Several people have sought to define start-ups and the definitions don’t necessarily agree, because each person has a different angle on what a start-up is. There is a children’s riddle: “I come in different shapes and sizes. Parts of me are curved, others are straight. You can put me anywhere you like. But to do my job, I only have one right place.\nWhat am I?” Like many such riddles, the answer isn’t always obvious, especially because the classic form of the object in question is disappearing. In the case of this particular, the answer is “a key”. The key to start-ups, which also come in different shapes and sizes, is partly disruption, a splicing of Shakespeare with Schumpeter. Shakespeare has to be mentioned. To the best of my knowledge, Much Ado About Nothing contains the first known instance of the word “start-up” being used. “That young start-up hath all the glory of my overthrow”—Shakespeare used the word in the sense of upstart and indeed, there is a parvenu kind of angle to all start-ups. They overthrow and disrupt the status quo, a bit like Schumpeter’s creative destruction.\nEvery start-up is an upstart, but every upstart is not a start-up. The business angle to start-ups is circa 1970s. In Silicon Valley, PM used the terms “imagination”, “inspiration”, “invention” and “innovation”. An individual uses imagination to think of a new product, process or service. This is the innovation bit, which may fall short of strict legal requirements of invention. However, for an upstart to be a start-up, there has to be a present, or potential, commercial application. Most importantly, there has to be an entrepreneur and an act of entrepreneurship. Who is an entrepreneur and what is entrepreneurship? The trouble with borrowing words from French and not reading classical economists like Richard Cantillon or Adam Smith is that we sometimes miss the most critical element of entrepreneurship. That happens to be risk-taking. This isn’t a very common human trait. Perhaps that’s understandable, since risk-taking can entail failure, as well as success. After all, if a human ancestor stepped out of a cave in search of better food, there was the off-chance of being gobbled up by a sabre-toothed tiger. Did you know that some human genome research shows risk-taking attributes to be partly genetic? Roughly, one-third of test subjects possess this risk-taking gene. (The MAOA-L gene variant, also called “warrior gene”. It is inherited from the mother, not the father.)\nHow many risk-taking endeavours succeed? That depends on the context, but is rarely above 5%. There is no guarantee about success in risk-taking. That’s the reason success in entrepreneurship cannot be encouraged without encouraging failure. The eco-system encouraging or inhibiting start-ups isn’t only about credit, or financial products, or equity. Thus, some definitions of “start-up” get fixated on financing, such as venture capital. Alternatively, they are fixated on information technology. Hence, use of expressions like scalable and replicable, the implicit assumption being these start-ups graduate upwards and become large companies. That’s a laudable objective and several high-profile and successful start-ups have done that. But there are others that fail and several that aren’t scalable. That doesn’t mean such a start-up is born to blush unseen, or waste its sweetness in a hostile environment.\nThat paraphrasing from an elegy occurred in the sub-conscious, but there is a wasting in the ecosystem. While there are data problems and time-lags in data, some 30 million of India’s employment is in organised sector, roughly 18 million public and 12 million private. This private means private corporate sector. Without distinguishing between labour force and work force, there are almost 500 million who work. There are issues in measuring how many are in agriculture, as opposed to primary pursuits in agriculture. Let’s say 250 million are in non-agricultural pursuits.\nConsider the mind-space occupied by public sector (18 million) and private corporate capital (12 million). That 500 million is also private capital and if PM’s mention of start-ups shifts our attention to 500 million, that’s a desirable fallout. Notice that in risk-taking appetite, this 500 million is far less risk-averse. For the 12 million private corporate capital, risk taking is a matter of choice. For the 500 million, it is a matter of survival. You will say I am stretching the mind-space argument too much. Are we not concerned about agriculture? Yes, we are, but let’s take an example.\nSubject to data and definitional problems again, 131,666 people committed suicide in 2014. 25,904 were self-employed. You have heard about the 12,360 in agriculture (farmers and labourers). Have you heard about the others, that “others” category including vendors and tradesmen? There was a news item about Chinese government pushing for 10,000 start-ups a day. Yes, India’s younger generation is probably more risk-loving and entrepreneurial, especially if you arrive at that conclusion on the basis of IT or financial sectors or top management schools. Yes, entrepreneurship is desirable, because it is better to create employment for others too. But outside that visible sector, you would be mad to be an entrepreneur. Did you know we still don’t have an insolvency law, as against a personal bankruptcy law? Assets/liabilities of such an enterprise are inseparable from those of the owner. If the enterprise fails, so does the owner. That’s just one instance of how we punish entrepreneurship and start-ups.\nThe author is Member, NITI Aayog. Views are personal\n 15, 2015 12:21 am", "external_links": [], "published": "2015-10-15T08:21:00.000+03:00", "crawled": "2015-10-15T00:20:21.619+03:00", "highlightTitle": ""}