{"organizations": [], "uuid": "421d85b43ae81bca78581db9831e36821194d53c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-561d9415/turbine/sc-hlth-1021-dick-van-dyke-aging-20151013", "site_section": "http://www.chicagotribune.com/", "section_title": "Chicago Tribune: Chicago breaking news, sports, business, entertainment, weather and traffic - Chicago Tribune", "url": "http://www.chicagotribune.com/lifestyles/health/sc-hlth-1021-dick-van-dyke-aging-20151013-story.html", "country": "US", "title": "Pushing 90, Dick Van Dyke prescribes song and dance", "performance_score": 0, "site": "chicagotribune.com", "participants_count": 1, "title_full": "Pushing 90, Dick Van Dyke prescribes song and dance - Chicago Tribune", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T16:55:00.000+03:00", "replies_count": 0, "uuid": "421d85b43ae81bca78581db9831e36821194d53c"}, "author": "William Hageman", "url": "http://www.chicagotribune.com/lifestyles/health/sc-hlth-1021-dick-van-dyke-aging-20151013-story.html", "ord_in_thread": 0, "title": "Pushing 90, Dick Van Dyke prescribes song and dance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "It's not even 9 a.m. in Malibu, Calif., yet Dick Van Dyke — soon-to-be 90 Dick Van Dyke — already is home from the gym, attacking his long to-do list for the day.\n\"I just got back,\" says Van Dyke, who has been entertaining audiences in some capacity for more than 65 years. \"I'm up at 6 every morning. I wake up and have a cup of coffee and get over to the gym before I talk myself out of it.\"\nHis daily regimen includes the treadmill and weights — he says he can still lift his age — a stop at the market, errands, back home, a nap, dinner, then a nightly treat of ice cream.\nThese days he's also promoting his new book, \"Keep Moving and Other Tips and Truths About Aging\" (Weinstein Books).\n\"I've got a couple of signings to do this week, phone interviews, some newspaper things,\" he says. \"I think it will sell well to my generation.\"\nThe book is full of stories from Van Dyke's life and his reflections on what he has seen and learned over his 90 years (his birthday is Dec. 13). But mostly he wants to tell readers how to enjoy life as they get into their 60s, 70s, 80s and beyond.\n'Keep Moving' Weinstein Books \"Keep Moving and Other Tips and Truths About Aging\" (Weinstein Books). \"Keep Moving and Other Tips and Truths About Aging\" (Weinstein Books). (Weinstein Books) The primary message of \"Keep Moving\" is just that — keep moving as you get older. In the book, Van Dyke talks about breaking into a little soft-shoe when the spirit moves him, whether at home or at his favorite grocery market. He has no room — or time —for a sedentary lifestyle.\n\"If you get exercise, get moving, get the blood moving, you walk out of the gym feeling better,\" he says. \"Get that circulation going, and it changes you. I can go to the gym feeling pretty lousy, but I walk out of there with a bounce in my step and feeling pretty good. I know very few people who are inactive who have all their marbles.\"\nThat leads to another factor in a healthy old age, one he mentions frequently in the book: the mental aspect.\n\"There's the biblical admonition about putting aside the things of your childhood. But I take that to mean self-centeredness, willfulness; not creativity and wonder. Walt Disney and I always said we were children looking for our inner adults.\"\nHere are some of Van Dyke's other lessons for living a full life:\nThe doodler Arlene Silver Van Dyke \"I doodle while on the sets of all my projects. Sometimes I even draw in bed -- my 'doodling studio' \" \"I doodle while on the sets of all my projects. Sometimes I even draw in bed -- my 'doodling studio' \" (Arlene Silver Van Dyke) Diet: \"Good habits matter,\" he writes. \"Eating light and fresh. Staying away from fast and processed foods.\" Van Dyke says he has never had a weight problem. \"I come from a skinny family. I watch what I eat. I'm not much on meat, maybe once a week. I have blueberries every morning. I watch my sugar level. When I was a kid I said, 'When I grow up I want to eat candy every night.' I do eat ice cream every night.\" For those keeping score at home, that's two scoops of Haagen-Dazs vanilla with a generous topping of chocolate syrup.\nBad habits: Van Dyke smoked and drank for decades but stopped on his own. His secret? \"I tried for several years to quit smoking. It's just the worst. Then a doctor showed me an X-ray. He said, 'These are little emphysema scars on your lungs.' I stopped right there. Drinking I had a problem with, but it went away. It started to taste funny. It didn't do anything for me. I wasn't interested anymore.\"\nThe mind: Find mental challenges. Van Dyke tries to memorize some Shakespeare every day. A lifelong artist, he also talks about getting involved with 3-D computer animation. \"It's so deep I'll never master it,\" he says with a laugh, \"but it's one of those hobbies you can lose yourself in. Everyone needs an engrossing hobby. Some of my older friends — there are still a few left — haven't changed their minds about anything since they were kids. They can't be open-minded. And I think that's a factor in aging.\"\nThinking young: \"You've got to stay social somehow,\" he says. \"I have a quartet I sing with (an a cappella group, Vantastix); we do benefits all over. The guys are all 40. My wife (Arlene) is 44. As my friends have disappeared, I have a circle of friends a lot younger. They say time appears to pass more quickly as you age. I've had young people come to me and say, 'Where is the time going?' I think it's the pace of life. Life goes faster.\nBelt it out: Van Dyke says that he has older friends who are bothered by weak voices. \"I tell them, 'For God's sake, sing.' They say, 'I can't sing.' Oh, everybody can sing. Get those voices going.\" It will not only strengthen your voice, but it will improve your attitude. \"You can't sing and be miserable at the same time.\"\nOne last nugget: \"I think I repeat this to everybody. Never go down stairs sideways, no matter if it feels better on your hips or knees. I always tell everyone, go up and down forward, even if it hurts a little.\"\n ", "external_links": ["http://www.trbimg.com/img-561e5e74/turbine/ct-cth-van-dyke2409-jpg-20151013", "http://www.trbimg.com/img-561d941a/turbine/ct-cth-van-dyke2410-jpg-20151013", "http://www.trbimg.com/img-561d9415/turbine/sc-hlth-1021-dick-van-dyke-aging-20151013"], "published": "2015-10-14T16:55:00.000+03:00", "crawled": "2015-10-14T20:35:05.638+03:00", "highlightTitle": ""}