{"organizations": [], "uuid": "bd6db96c0220e579449e36a9987bf0cf0c125ba0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.democratandchronicle.com", "main_image": "http://www.gannett-cdn.com/-mm-/049ebcd82ee9fe9c38d6f81c44288e53d59fb292/c=0-253-2996-1946&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/23/Rochester/Rochester/635812081951700562-LP-ROCMusic-A-102215-Metro.JPG", "site_section": "http://www.democratandchronicle.com/", "section_title": "Democrat and Chronicle | Rochester news, community, entertainment, yellow pages and classifieds. Serving Rochester, New York | democratandchronicle.com", "url": "http://www.democratandchronicle.com/story/news/education/2015/10/24/rocmusic-eastman-rochester-ref/74229746", "country": "US", "title": "Groups provide instruments, lessons to city school kids", "performance_score": 0, "site": "democratandchronicle.com", "participants_count": 1, "title_full": "Groups provide instruments, lessons to city school kids", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T18:04:00.000+03:00", "replies_count": 0, "uuid": "bd6db96c0220e579449e36a9987bf0cf0c125ba0"}, "author": "democratandchronicle.com", "url": "http://www.democratandchronicle.com/story/news/education/2015/10/24/rocmusic-eastman-rochester-ref/74229746", "ord_in_thread": 0, "title": "Groups provide instruments, lessons to city school kids", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Over the last few years, the Rochester School District has made a priority of re-investing in music and the arts in its schools. Still, it estimates there are several hundred students who would like to take musical instrument lessons but don't have the opportunity. Two outside organizations are expanding aggressively to fill that void. One, the Rochester Education Foundation, is celebrating its 10th year this month and has distributed nearly 1,200 instruments to Rochester children in that time, along with providing lessons and other services.\nThe other, the ROCmusic Collaborative, is just in its third year of providing free lessons in city recreation centers, but already has expanded to a second site, with plans to add more grade levels.\nBoth programs have tight connections to the district and city as well as the Eastman School of Music, Hochstein School of Music and Dance and the Rochester Philharmonic Orchestra, among other groups. They're separate entities, but both are driven by the same inexplicable disconnect that first struck REF executive director Pat Braus when her organization began its work.\n\"There were kids who wanted to play an instrument in fourth grade and couldn’t — and in our community, where we have so much music,\" she said. \"That was pretty crazy.\"\nThe Rochester Education Foundation first started collecting instruments 10 years ago in emulation of a similar project in Nashville.\n\"(The Nashville organizers) said, 'You'll never do as well as we did, because we’re the Music City,'\" Braus said. \"Which was funny, because their drive lasted about a year and they got maybe 150 instruments.\"\nREF has collected 1,175 total instruments, including 75 this year. The City School District repairs and moves them — pianos included — and distributes them to interested students.\nBuy Photo Aaron Frasier, 8, jumps in the air as he leads the rest of the ROCMusic class in a dance at Edgerton Recreation Center on Thursday. (Photo: LAUREN PETRACCA/@laurenpetracca/STAFF PHOTOGRAPHER)\nIt supports a summer music school open to all city children with a recommendation from their school music teacher. It not only got city children into the RPO's winter chorale concert, but also provided busing, food to eat during rehearsals and clothes to wear for performances.\n\"The music opportunities we could offer as a community are almost infinite,\" Braus said. \"You would not believe how many kids said, ‘I love music. This is what I love to do.'\"\nOne such child is Jahshanti Henry, who received a flute five years ago when he was in fourth grade. All his aunts play the clarinet, and he wanted to try something different.\nNow, he's a ninth-grader at School of the Arts, receiving free private lessons through the Eastman Pathways program and playing in the school jazz band. He hopes to study flute at a music conservatory and become either a performer or a teacher.\n\"I feel like me and my flute connect in some way,\" he said. \"When I play, I can let out all my emotions. Say I'm having a really tough time or something — I’ll just go play the flute and it’ll make me feel better.\"\nREF also works with literacy and college access for Rochester students. It is having a 10-year anniversary celebration Wednesday at the Memorial Art Gallery.\nWhile REF and the district work to get instruments in schools and homes, ROCmusic is providing lessons in the city recreation centers that swell with children after school lets out.\n\"The question is, are we really actually bringing arts to the neighborhoods?\" director Alexander Peña asked. \"The answer is no, even in such a musically rich city.\"\nHis organization started trying to bridge that gap three years ago at the David F. Gantt Community Center on North Street. This year, 60 elementary school students there are learning to play stringed instruments with the help of mostly Eastman-trained teachers.\nThis year, it opened a second location at the Edgerton Recreation Center. One recent day there, 20 budding musicians sat in front of tall, colorful tubano drums and suffered the exquisite punishment of not being able to smack them while the teacher was trying to talk.\nBuy Photo Kendra Davis, 6, and Yalexis Negron, 8, play hand drums during a ROCMusic class led by Eastman students at Edgerton Recreation Center on Thursday. (Photo: LAUREN PETRACCA/@laurenpetracca/STAFF PHOTOGRAPHER)\nAnnalee Cruz, a smidgen of a girl with missing front teeth, clapped her hands over her ears when it got too noisy. Her ears are sensitive, she said, but she enjoys the regular classes nonetheless.\n\"They have so many games and they always have a song to go with it,\" she said. \"Then we get the hang of it and it's so fun.\"\nIt is no coincidence that both ROCmusic locations are within the city's crescent of poverty, where children face the longest odds in music and otherwise.\n\"We want to build out all the way to high school so these kids have a fair opportunity to go to SOTA and Hochstein and Eastman,\" Peña said. \"For these kids to have something to go home and do and own and be proud of and talk about — that's really important.\"\nJMURPHY7@Gannett.com\nGet involved\nThe Rochester Education Foundation's anniversary gala is from 5:30 to 8 p.m. Wednesday at the Memorial Art Gallery, 500 University Ave. Principal Jay Piper and music teacher Cheri France of the Children's School of Rochester and Harris Corp. will be honored for their work.\nTickets are $75. For more information, go to rochestereducation.org . The website also has information about donating instruments or money and volunteering.\nROCmusic is looking for volunteers to teach music or help run programs. For more information, go to esm.rochester.edu/rocmusic , email rocmusickids@gmail.com or call (585) 490-1559.", "external_links": ["http://www.esm.rochester.edu/rocmusic/", "http://www.gannett-cdn.com/-mm-/e7c866b662bebf1efe4447b572ca408abb4efcc0/c=170-0-2830-2000&r=x408&c=540x405/local/-/media/2015/10/23/Rochester/Rochester/635812081979156738-LP-ROCMusic-C-102215-Metro.JPG", "http://www.gannett-cdn.com/-mm-/4044b1e7645488621f157de466cf1a990870caa2/r=500x333/local/-/media/2015/10/23/Rochester/Rochester/635812081979156738-LP-ROCMusic-C-102215-Metro.JPG", "http://www.gannett-cdn.com/-mm-/4044b1e7645488621f157de466cf1a990870caa2/r=500x333/local/-/media/2015/10/23/Rochester/Rochester/635812081916132334-LP-ROCMusic-B-102215-Metro.JPG", "http://www.gannett-cdn.com/media/2015/10/23/Rochester/Rochester/635812081979156738-LP-ROCMusic-C-102215-Metro.JPG", "http://www.gannett-cdn.com/-mm-/e7c866b662bebf1efe4447b572ca408abb4efcc0/c=170-0-2830-2000&r=x408&c=540x405/local/-/media/2015/10/23/Rochester/Rochester/635812081916132334-LP-ROCMusic-B-102215-Metro.JPG", "http://www.gannett-cdn.com/media/2015/10/23/Rochester/Rochester/635812081916132334-LP-ROCMusic-B-102215-Metro.JPG", "http://rochestereducation.org/"], "published": "2015-10-24T18:04:00.000+03:00", "crawled": "2015-10-25T16:07:27.846+02:00", "highlightTitle": ""}