{"organizations": ["Konami", "Black Ops"], "uuid": "2069bd6adb006ad7f5fe55469d052610a8babd48", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.express.co.uk", "main_image": "http://cdn.images.express.co.uk/img/dynamic/143/590x/GTA-5-update-611929.jpg", "site_section": "http://express.co.uk//posts/rss/18/entertainment", "section_title": "Daily Express :: Entertainment Feed", "url": "http://www.express.co.uk/entertainment/gaming/611929/GTA-5-update-Metal-Gear-Online-news-Konami-Black-Ops-3-Zombies-PS4-GTA-Online", "country": "", "title": "PS4 report: GTA 5 trail update, Metal Gear Online boost news, Black Ops 3 Zombies unlock", "performance_score": 0, "site": "express.co.uk", "participants_count": 0, "title_full": "PS4 report: GTA 5 trail update, Metal Gear Online boost news, Black Ops 3 Zombies unlock", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T05:49:00.000+03:00", "replies_count": 0, "uuid": "2069bd6adb006ad7f5fe55469d052610a8babd48"}, "author": "", "url": "http://www.express.co.uk/entertainment/gaming/611929/GTA-5-update-Metal-Gear-Online-news-Konami-Black-Ops-3-Zombies-PS4-GTA-Online", "ord_in_thread": 0, "title": "PS4 report: GTA 5 trail update, Metal Gear Online boost news, Black Ops 3 Zombies unlock", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "PS4 report: GTA 5 trail update, Metal Gear Online boost news, Black Ops 3 Zombies unlock PS4 report: GTA 5 trail update, Metal Gear Online boost news, Black Ops 3 Zombies unlock PS4 news this week includes a new epic way to make money on GTA 5, Metal Gear Online's boost from Konami and the new Black Ops 3 Zombies unlock. PUBLISHED: 03:49, Wed, Oct 14, 2015 | UPDATED: 05:03, Wed, Oct 14, 2015 ROCKSTAR GTA 5 has 19 challenges included in its most recent update \nThe GTA Online Freemode Events update has created a new way for fans to make money on Xbox One, PS4 and PC. \nThis includes 19 challenges that players can undertake to make some serious GTA Online in-game cash. \nRockstar say they are geared to proving yourself the best in key abilities, including achieving the Longest Jump, Most Headshots, most Near Misses and Longest Fall Survived amongst many more. \nThese 19 new Challenges will give you plenty of opportunities to use the Action Replay feature in the Rockstar Editor which was included in the most recent GTA 5 update . \n\"The top 3 finishers in each Challenge receive cash and RP for displaying their talent, so time your winning flourishes well,\" a tip from Rockstar reveals. \nAnd it just so happens GTA Online’s weekly Time Trials includes a $50,000 payout if the par time is beaten, a guide on how to achieve this near Simeon’s chop shop can be found here . \nMetal Gear Online fans have been given a big boost from Konami this week, following the issues the multiplayer mode has had since launch. \nKonami is apologising for the laggy start by giving every player a 3,000 bonus GP boost just by logging in that will allow for new items to be snapped up, while should also see their characters level up faster this week. \n\"Since release, the game suffered frequent instances of difficulties maintaining an online connection, and other associated problems such as lag when switching between menu screens,\" Konami wrote to fans this week. \n\"We sincerely apologize for the inconvenience this has caused. The game is currently running in a much more stable manner, but to make amends for the frustrating difficulties users have dealt with so far, we have distributed bonus items, etc. to all users. \n\"The XP Boost #MGO promotional code duration has been extended from 2 to 3 weeks. \n\"Please accept our sincere apologies for these issues.\" TREYARCH Black Ops 3 Zombies fans have a new unlock on PS4 \nCall of Duty: Black Ops 3 Zombies mode fans who took part in the game's recent multiplayer beta can now download a free dynamic theme, showing off the game's Morg City. \nPlayStation say it's a free gift provided by Treyarch showing off the backdrop for Shadows of Evil in all its glory. \nIf you played the Beta, here's how you can download this theme: 1. Hit the PlayStation Store on your PS4 2. Press Triangle and select Search and Black Ops III 3. Select Call of Duty: Black Ops III 4. Scroll down to Themes - Morg City Zombies Theme and download the theme 5. After the download is complete, navigate to the PS4 Home Screen - \"Settings\" - \"Themes\" to select the theme \nBlack Ops 3 Zombies won't be the only undead spinoff to be included in the game, a recent achievements list found by fans shows that Dead Ops Arcade 2 is also set to return in top-down mini-game shooter form. KONAMI Metal Gear Online news this week includes a special boost from Konami Related articles", "external_links": [], "published": "2015-10-14T05:49:00.000+03:00", "crawled": "2015-10-14T18:58:23.152+03:00", "highlightTitle": ""}