{"organizations": [], "uuid": "37ed2dbe2ba8174ea276e96d05086a6c92d9fae3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.newindianexpress.com", "main_image": "http://www.newindianexpress.com/skins/eb/gfx/group-logo.jpg", "site_section": "http://www.newindianexpress.com/entertainment/telugu/?widgetName=rssfeed&widgetId=276210&getXmlFeed=true", "section_title": "The New Indian Express - Telugu - http://www.newindianexpress.com/entertainment/telugu/", "url": "http://www.newindianexpress.com/entertainment/telugu/Battered-Bruised-and-Emotional/2015/10/15/article3080075.ece", "country": "IN", "title": "Battered, Bruised and Emotional", "performance_score": 0, "site": "newindianexpress.com", "participants_count": 0, "title_full": "Battered, Bruised and Emotional", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:04:00.000+03:00", "replies_count": 0, "uuid": "37ed2dbe2ba8174ea276e96d05086a6c92d9fae3"}, "author": "", "url": "http://www.newindianexpress.com/entertainment/telugu/Battered-Bruised-and-Emotional/2015/10/15/article3080075.ece", "ord_in_thread": 0, "title": "Battered, Bruised and Emotional", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Email 0 \nStar-son, actor, producer and entrepreneur – Ram Charan Teja has assumed major responsibilities in his relatively short career. Even as he awaits the release of Bruce Lee, the weight of expectations and the pressure of producing megastar Chiranjeevi’s much-awaited 150th film is quite telling. In his own words, Charan is extremely happy to take the backseat and let his father enjoy the limelight for as long as he can. The Magadheera star, however, wants to be the one to showcase Chiranjeevi’s charisma on-screen once again. \n“I had no idea that dad would be doing a cameo in Bruce Lee. Vaitla garu had directly approached him and he gave his consent for the role. Initially they thought of including a fight and song sequence for the cameo but I refused to let him do the song. Dad’s next song sequence will be only in his 150th film,” revealed a defiant Charan. \nSave for a brief cameo in Charan’s Magadheera, Chiranjeevi has not gone behind the arc lights for the past eight years and his last film was Shankar Dada Zindabad in 2007. Charan reveals that Chiranjeevi’s return to the sets, albeit in a cameo role, was an emotional moment for his family. “There were mixed emotions for us. My mother was in tears on the day of the shooting. I was very excited to see dad back in action and was up early in the morning. I personally designed his entire look for the cameo and even convinced him to sport a stubble,” he shares. \nAnd once he returned to the sets, Charan says that it felt like he never left. “He rolled back the years and looked exactly like he did 10 years ago. It was an amazing experience,” he gushed. \nOn his part, Charan is looking forward to essaying a new avatar – that of a stuntman in Bruce Lee. “My character needed some flexibility and mobility. There are quite a few high-octane action sequences in the film. I like to do my own stunts so I suffered quite a few injuries. I hope it pays off,” he says, optimistically. \nWhile the film promises to be a complete actioner, Charan reveals that it ultimately has a sentimental backdrop. \n“There is sibling sentiment in the film. It is about a common boy who has to manage his responsibilities and take care of his family,” the actor says. \nCharan has decided to broaden his horizon as an actor and opened himself to remakes. He will next be seen in the Telugu remake of the recent Tamil blockbuster Thani Oruvan, to be directed by Surender Reddy. “Earlier, I wasn’t very keen on the idea of featuring in remakes but I have gotten over that now. I watched Thani Oruvan and loved the film. I’m quite excited about it,” he beamed. \nCharan is also launching two new production houses – Konidela Productions and White Horse Entertainments. \n“We are at a stage where there are a lot of actors but not enough quality directors who can experiment and explore new content and cinema. That is why it’s important to spot and encourage new talent in the Telugu film industry,” adds Charan. \nApart from the Telugu remake of Thani Oruvan, Charan will also feature in a romantic film by Gautham Menon in 2016. \nProduced by DVV Danayya, Bruce Lee also features Rakul Preet Singh. \nCharan Reacts! \nThe timing of Bruce Lee’s release has stirred up a controversy with veteran producer Dasari Narayana Rao, asking the makers to move up the film’s release and allow Rudhramadevi a chance to recover its investment. Reacting to this, Charan said, “Release dates are not my responsibility so it was not my decision. We had announced this date long time ago and everybody knew that it will release on October 16. Had Rudhramadevi makers approached us in advance about shifting the release date, we would’ve obliged.” \nResponding strongly to Dasari’s remark that stars needn’t release their films on festival days as it would be a festival whenever their film releases, Charan sarcastically quipped, “It sounds quite good, but one most think practically.” \nThe actor-producer also refuted Puri Jagannadh’s claim that he came to know about his removal as the director for Chiru’s 150th film after it was announced in the media. “We did speak to Puri. I was not part of the discussions for Auto Johnny but my father loved the script for the first half. Puri later said that he will work on the second half but he’s busy with Loafer,” clarified Charan.", "external_links": [], "published": "2015-10-15T03:04:00.000+03:00", "crawled": "2015-10-15T03:16:57.027+03:00", "highlightTitle": ""}