{"organizations": [], "uuid": "3c3b185ed195c7441bd21fefc5087ed2b13731ce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266347/arts-entertainment-general", "section_title": "Arts &amp; Entertainment: General - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30275309/the-start-of-the-new-college-year-marks-a-resurgence-of-bed-bugs-in-denver-colorado-springs", "country": "US", "title": "The Start of the New College Year Marks a Resurgence of Bed Bugs in Denver & Colorado Springs", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "The Start of the New College Year Marks a Resurgence of Bed Bugs in Denver & Colorado Springs - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T12:02:00.000+03:00", "replies_count": 0, "uuid": "3c3b185ed195c7441bd21fefc5087ed2b13731ce"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30275309/the-start-of-the-new-college-year-marks-a-resurgence-of-bed-bugs-in-denver-colorado-springs", "ord_in_thread": 0, "title": "The Start of the New College Year Marks a Resurgence of Bed Bugs in Denver & Colorado Springs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Local bed bug removal specialist Thermal-Clean announces that the return to college marks a resurgence of bed bug infestations in dorms in Denver & Colorado Springs. Learn more about how you can protect your dorm room or apartment.\nDenver, CO (PRWEB) October 16, 2015\nBack to school time is an exciting time for many across America. It means students are arriving on campus with new books, motivation, summer memories, backpacks, and unfortunately in many cases, bed bugs. Bed bugs are a growing problem everywhere, but especially in dorms and apartments where students can be carrying bed bugs on packed clothes or other items.\nA recent survey of pest management professional across the west, including Colorado, found that 100% of respondents said multi-unit housing overwhelmingly had the most infestations, the worst infestations, and the most often treated infestations. High resident turnover rates and inconsistent treatment and cleanliness levels contribute to an annual resurgence of bed bugs as new groups of students come to campus each year.\nBed bugs attach themselves to people via clothing as they come and go from a living area, and also attach themselves to used furniture and bedding, which means they commonly come from used mattresses or couches. For them, a college dorm area is the perfect breading ground and the best place to call home.\nAlthough there are heat treatment machines that can be rented that claim to eliminate bed bugs with 60% effectiveness, these machines are rarely this effective when operated by a pest control novice. Unlike other pest control problems involving spiders and ants, bed bugs can’t be treated with store-bought treatment. They require professional, specialized care that utilizes a multi-pronged approach including heat, vacuuming, mild pesticide, and in some cases, a dog.\nCollege is stressful enough without the added psychological impact that comes with the consequences of bed bug infestation, like not feeling clean or safe or constantly worrying about being bit and even what others might perceive about the situation.\nHowever, there are things that students, parents, and dorm managers can do.\n1. Start by recognizing when there is a bed bug infestation and realize that the earlier it is detected, the better. The good news is that bed bugs are easily visible, so look for small dots around your bedding or sleeping area. Also keep an eye out for multiple bites that form a linear pattern on the skin.\n2. Next, realize that DIY treatments almost never work and that professional help will likely be needed.\n3. Know where to go for professional help. In Denver and Colorado Springs, the best source is Thermal-Clean, a team of local and experienced bed bug removal professionals .\nThermal-Clean's bed bug remediation approach is green, EPA recommended and 98% effective. Whereas some bed bug treatment companies take days to complete treatment, Thermal-Clean is done in 8 hours or less, so going to classes and coming home to a bed bug-free room without interrupting work and school schedules is a reality.\nCollege is an exciting time that shouldn’t be marred with a stressful bed bug infestation. Know where to go for professional bed bugs treatment help and students can avoid the hassle of dealing with the problem of bed bugs and focus more on enjoying college life and doing well in classes!\n //www.prweb.com/releases/2015/10/prweb13007582.htm\n ", "external_links": ["http://www.prweb.com/releases/2015/10/prweb13007582.htm", "http://www.thermal-clean.com/why-heat-and-treat/"], "published": "2015-10-16T12:02:00.000+03:00", "crawled": "2015-10-16T11:26:49.831+03:00", "highlightTitle": ""}