{"organizations": [], "uuid": "068b2c2a42022b7a12d873ae0502c363671a1672", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.india.com", "main_image": "http://s3.india.com/wp-content/uploads/2015/10/CRhsH1WVAAE19MU.jpg", "site_section": "http://www.india.com/feed/", "section_title": "India | Latest India News | Get Free India.com Email | Live Cricket and Entertainment News at India.Com", "url": "http://www.india.com/whatever/huge-solar-storms-dodging-detection-systems-on-earth-643228/", "country": "US", "title": "Huge solar storms dodging detection systems on Earth", "performance_score": 0, "site": "india.com", "participants_count": 1, "title_full": "Huge solar storms dodging detection systems on Earth", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T12:28:00.000+03:00", "replies_count": 0, "uuid": "068b2c2a42022b7a12d873ae0502c363671a1672"}, "author": "Wires English | Indo-Asian News Service", "url": "http://www.india.com/whatever/huge-solar-storms-dodging-detection-systems-on-earth-643228/", "ord_in_thread": 0, "title": "Huge solar storms dodging detection systems on Earth", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Huge solar storms dodging detection systems on Earth By Indo-Asian News Service on October 19, 2015 at 2:58 PM Comments London, Oct 19: The current systems to analyse and predict solar storms may not be able to detect large solar flares, scientists report, indicating that this can put both power supply and communication networks at risk on Earth.According to observations from the Tihany Magnetic Observatory in Hungary, the indices used by scientists to assess the Sun’s geomagnetic perturbations to the Earth are unable to detect some of these events. (Read: Lab-grown meat burger may hit stores in five years) \nThe Tihany Magnetic Observatory registered a solar storm similar to the largest one ever recorded in 2003 while other observatories were completely unaware of the event. \nIn 1859, the largest and most powerful solar storm ever recorded — also known as the Carrington Event or the Carrington Flare – was detected at the Colaba Observatory in India. \nThe storm caused power outages and fires at telegraph system facilities all over Europe and North America. \nAnother large solar storm known as the Halloween Solar Storm took place between October and November in 2003. \nThe systems, however, were not able to detect the magnetic perturbation that affected the Earth precisely at that time, specifically on October 29, 2003. \nThis solar event was extraordinarily similar to the Carrington Flare of 1859. \nThe Halloween Solar Storm affected power plants both in Sweden and South Africa where several transformers were burnt. \n“One of the conclusions is that the indices commonly used by scientists failed to detect such an important event, and they most likely would have failed to detect the Carrington Event as well,” explained Consuelo Cid, lead author from Tihany Magnetic Observatory. \nThe geomagnetic storms caused by the Sun pose a serious threat to a society that is increasingly dependent on technology, in addition to directly posing serious danger to power and communication networks. \nThe study, published in the Journal of Space Weather and Space Climate, suggests that the scientific community could be mistaken in their calculation of the data average from different observatories around the world. \nThis may be attributable to the fact that positive and negative magnetic disturbances cancel each other out, meaning that the true magnetic disturbance in a region disappears. In addition, the disturbance depends greatly on the local time (longitude), although other scientists postulate that it depends largely on the latitude. \n“A Carrington-like event may occur more often than we expect; actually, it might have already happened without us even realising it,” Cid noted.There is an urgent need to develop local indices that are truly useful to companies that may be affected by these disturbances, such as electric companies, Cid concluded. \n  2:58 PM Topics:", "external_links": [], "published": "2015-10-19T12:28:00.000+03:00", "crawled": "2015-10-19T12:49:07.723+03:00", "highlightTitle": ""}