{"organizations": [], "uuid": "49663fd7008c7294cecf7609c5a46e827aa30a36", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.marketwired.com", "main_image": "http://media.marketwire.com/attachments/201510/91186_crosspaths_logo.jpg", "site_section": "http://www.marketwire.com/rss/mwMediaandEntertainment.xml", "section_title": "Marketwired - Media and Entertainment", "url": "http://www.marketwired.com/press-release/faith-and-love-meet-on-new-dating-app-for-single-christians-nyse-mkt-lov-2062631.htm", "country": "CA", "title": "Faith and Love Meet on New Dating App for Single Christians", "performance_score": 0, "site": "marketwired.com", "participants_count": 0, "title_full": "Faith and Love Meet on New Dating App for Single Christians", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T00:14:00.000+03:00", "replies_count": 0, "uuid": "49663fd7008c7294cecf7609c5a46e827aa30a36"}, "author": "", "url": "http://www.marketwired.com/press-release/faith-and-love-meet-on-new-dating-app-for-single-christians-nyse-mkt-lov-2062631.htm", "ord_in_thread": 0, "title": "Faith and Love Meet on New Dating App for Single Christians", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "October 08, 2015 17:14 ET Faith and Love Meet on New Dating App for Single Christians \nCROSSPATHS Helps Dating Millennial Christians Find Truly Compatible Connections \nLOS ANGELES, CA--(Marketwired - Oct 8, 2015) - Single Christians now have a new, deeper way to find truly compatible connections. Spark Networks® (NYSE MKT: LOV), owner of dating communities ChristianMingle® and JDate® , has launched a brand-new, free iPhone® app, CROSSPATHS , which makes the act of dating more meaningful for today's faith and moral-based millennials. The new dating app features a one-of-a-kind \"Faith Spectrum,\" that allows users to quickly identify a connection based on similar beliefs. \n\"The CROSSPATHS app fills a gaping hole in today's dating app environment. There is a wide spectrum of how millennial Christians approach their faith and today's simple swipe apps don't effectively help them find others with compatible beliefs. Through our Faith Spectrum component we immediately allow users to understand who is on the same path they are on and reach out and meet others in a safe, considerate environment. We also know that today's young Christians are seeking to be part of and give back to their community and so the app infuses relevant causes and events into the experience,\" said Michael Egan, Chief Executive Officer, Spark Networks. \nA better way for finding like-minded single Christians, CROSSPATHS uses patented mutual matching technology which only connects two people when they're both interested, allowing them to get to know each other and then meet when they're ready to take that next step. CROSSPATHS uses Facebook to verify each and every member's profile so that people can make real connections with real people on the app. \n\"Today, more and more people are looking for connections that go beyond the surface, beyond the selfish, and beyond the hype,\" said Chris Grace, Ph.D. \"What makes the CROSSPATHS app exceptionally unique is that it takes seriously the faith and beliefs we hold as Christians. If you are someone who seeks to move beyond the usual and into deeper and more meaningful matches, this will be the app to take you there.\" \nHere's how it works: Singles download the free app, register through Facebook, and complete a profile. The app directly links to Instagram and users' personal pictures automatically upload from Facebook. Members are then presented with profiles of other members who could be a match. Members show their interest in a match by simply swiping Yes or No to each profile. If the same two people swipe yes to each other, they will both be notified and can then communicate freely via chat. CROSSPATHS also enables users to meet off-line by displaying events and interests that members can match with in order to find common interests and activities they can participate in with other members. \n\"When it comes to online dating, CROSSPATHS is a game changer for Christians,\" said Jarrid Wilson, pastor, author, blogger and ChristianMingle advisory board member. \nCROSSPATHS has launched nationwide. Visit iTunes App Store to download the CROSSPATHS App. For additional information, please visit www.CROSSPATHSapp.com . \nABOUT CROSSPATHS CROSSPATHS is the new go-to destination for single Christians looking to meet, date and relate. As one of the only dating apps with a focus on faith, CROSSPATHS aims to give users a new and fun way to find meaningful connections with like-minded Christians. \nABOUT SPARK NETWORKS Spark Networks, Inc.'s mission is to create iconic, niche-focused brands that build and strengthen the communities they serve. Spark Networks' portfolio of consumer websites is anchored by ChristianMingle and JDate , and also includes, among others, BlackSingles.com® and SilverSingles®.com . Spark Networks' shares trade on the NYSE MKT under the ticker symbol \"LOV\" (NYSE MKT: LOV). \nApple, the Apple logo, and iPhone are trademarks of Apple Inc., registered in the U.S. and other countries. App Store is a service mark of Apple Inc.", "external_links": [], "published": "2015-10-09T00:14:00.000+03:00", "crawled": "2015-10-09T01:05:22.674+03:00", "highlightTitle": ""}