{"organizations": [], "uuid": "2097443c0d1cf3b08018c12349e47b55c97902a1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/10/21/13037512/The Doctor Stories.jpg", "site_section": "http://www.prweb.com/rss2/artbooks.xml", "section_title": "Arts &amp; Entertainment: Books", "url": "http://www.prweb.com/releases/TheDoctorsStories/CharlesTChaseMD/prweb13037512.htm", "country": "US", "title": "New Marketing Campaign Launched for 'The Doctor's Stories'", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "New Marketing Campaign Launched for 'The Doctor's Stories'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "2097443c0d1cf3b08018c12349e47b55c97902a1"}, "author": "Marketing Services", "url": "http://www.prweb.com/releases/TheDoctorsStories/CharlesTChaseMD/prweb13037512.htm", "ord_in_thread": 0, "title": "New Marketing Campaign Launched for 'The Doctor's Stories'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "After reading William Carlos Williams' \"The Doctor Stories,\" author Charles T. Chase 's patients began to haunt him. A flood of memories would come back to him while musing in elevators, driving in his car or winding down in his desk at the end of the work day. Thus began the task of penning down the stories in a journal, leaving every detail as accurately as they were remembered. The stories piled up and these became the cornerstone for his anthology, \" The Doctor's Stories \" (published by Xlibris). The collection receives its new marketing campaign after its successful release in 2014. Chase has been in the medical practice for over 35 years. Thorough experience with medical diagnosis and patient interaction taught him many things about human struggle. This book chronicles some of the extraordinary ones. Some are amusing, some serious and some are inspiring. Eclectic insights are gleaned from a poignant exploration of pathos, compassion and the trials and triumphs of the human spirit.\nHow much can man endure when confronted with extreme circumstances? This book bares the vulnerability of the human soul as it exalts its most astounding capacities in the face of struggle.\n“The Doctor's Stories”\nBy Charles T. Chase, MD\nHardcover | 6x9in | 318 pages | ISBN 9781503524620\nSoftcover | 6x9in | 318 pages | ISBN 9781503524637\nE-Book | 318 pages | ISBN 9781503524644\nAvailable at Amazon and Barnes & Noble\nAbout the Author\nAn experienced practicing neurologist for over 25 years, Charles T. Chase, MD has nearly 35 total years in the field of medicine. Nine years of practice on active duty in the U.S. Air Force gave him a different perspective. Feeling a need to apprehend the same business mechanisms CEO’s of HMO’s understand, 14 years ago he went back to school to earn his MBA. He also served on numerous Boards of Directors for The Toledo Clinic, Promedica Professional Panel and is currently a chief of staff for the hospital where he attends most of his hospitalized patients. Chase has always been interested in writing and has garnered awards for writing at all levels of formal education. The most telling aspect of his drive to be a writer was the result of his Ohio Vocational Interest Survey in high school senior. He scored in the 99th percentile of those taking the test with interest in writing as a profession.\nXlibris Publishing, an Author Solutions, LLC imprint, is a self-publishing services provider created in 1997 by authors, for authors. By focusing on the needs of creative writers and artists and adopting the latest print-on-demand publishing technology and strategies, we provide expert publishing services with direct and personal access to quality publication in hardcover, trade paperback, custom leather-bound and full-color formats. To date, Xlibris has helped to publish more than 60,000 titles. For more information, visit xlibris.com or call 1-888-795-4274 to receive a free publishing guide. Follow us @XlibrisPub on Twitter for the latest news.", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cHM6Ly9jaGFybGVzdGNoYXNlLndvcmRwcmVzcy5jb20v", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3BhdGllbnQuaW5mby8=", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL2Jvb2tzdG9yZS54bGlicmlzLmNvbS9Qcm9kdWN0cy9TS1UtMDAwOTc5NjEyL1RoZS1Eb2N0b3JzLVN0b3JpZXMuYXNweA==", "http://www.prweb.net/Redirect.aspx?id=aHR0cHM6Ly93d3cuYW1hLWFzc24ub3JnL2FtYS9wdWIvYWJvdXQtYW1hL291ci1wZW9wbGUvbWVtYmVyLWdyb3Vwcy1zZWN0aW9ucy9pbnRlcm5hdGlvbmFsLW1lZGljYWwtZ3JhZHVhdGVzL3ByYWN0aWNpbmctbWVkaWNpbmUucGFnZQ==", "http://www.prweb.net/Redirect.aspx?id=aHR0cHM6Ly9zdG9yeWJpcmQuY29tL3JlYWQv"], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-22T09:37:42.865+03:00", "highlightTitle": ""}