{"organizations": [], "uuid": "b27a6b351ec44c4830eec5bf434679c1c1ba75d3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "savannahnow.com", "main_image": "http://savannahnow.com/sites/default/files/14815027.jpg", "site_section": "http://savannahnow.com/", "section_title": "savannahnow.com | Savannah Georgia's source for News, Entertainment, Sports, Weather, Classifieds, Jobs, Autos, Real Estate and St. Patricks Day", "url": "http://savannahnow.com/exchange/2015-10-16/selfie-stick-founders-speak-during-geekend", "country": "US", "title": "Selfie on a Stick founders to speak during Geekend |", "performance_score": 0, "site": "savannahnow.com", "participants_count": 1, "title_full": "Selfie on a Stick founders to speak during Geekend | savannahnow.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T19:37:00.000+03:00", "replies_count": 0, "uuid": "b27a6b351ec44c4830eec5bf434679c1c1ba75d3"}, "author": "Katie Martin", "url": "http://savannahnow.com/exchange/2015-10-16/selfie-stick-founders-speak-during-geekend", "ord_in_thread": 0, "title": "Selfie on a Stick founders to speak during Geekend |", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photos Photo courtesy of Selfie on a Stick - Jacqueline Verdier and Dominic Suszanski, founders of Selfie on a Stick, take a selfie with a wax figure of President Barak Obama at Madame Tussauds Wax Museum. The famed wax museum sells the selfie stick at its gift shops across the nation. By Katie Martin First, let me take a selfie.\nThose six little words have crept into millions of conversations in the past few years.\nIn 2013, Oxford crowned “selfie” as its Word of the Year. Merriam-Webster made it official in 2014 by adding it to the dictionary.\nTwitter also declared 2014 “Year of the Selfie.”\nThen came the selfie stick.\nYou can thank Jacqueline Verdier and Dominic Suszanski for that.\nThe idea came after the duo spotted a selfie stick in use in Hong Kong but, after days of searching, Verdier couldn’t find one to buy.\n“I just lost my mind and had to have one. I was never a person that took that many selfies because I never just wanted a picture of my face — I wanted the background and the surroundings,” said Verdier, who serves as CEO of the company they formed to market selfie sticks.\nSuszanski stayed behind in Hong Kong and brought a few sticks back to the United States. After snapping photos around New York City and north Georgia and seeing everyone’s excitement, the friends created the now-most popular selfie stick brand in the country.\n“People in New York lost their minds about it, then people in Georgia got behind it... It was still so new to America that no one had really heard about them before,” said Suszanski, who serves as company president.\nIn the year since they launched their company, Selfie\non a Stick, the duo and their product have been featured on “Good Morning America,” CNN, Vogue magazine and can be found coast-to-coast in retail stores and on QVC.\n“We live in New York, and we’re exposed to a lot of things that are new and cutting edge, but we couldn’t find one there, and it’s the city that has everything,” Verdier said.\nThey began sourcing manufacturers and making design modifications, which include a sturdier grip with real silicone, spin-control and ability to accommodate and secure almost any smartphone or digital camera.\nIt’s also the longest selfie stick on the market, extending to three-and-a-half feet, but it folds to a compact 9 inches when not in use.\nAccording to Suszanski, it’s a better stick for a better pic.\nThe friends, who have quit their previous jobs to focus on the brand, credit a lot of their success to social media marketing, which also helped build their online store. They’ll be sharing their journey and advice today with Geekend attendees during their keynote address, Selfies and Success.\n“It’s been a whirlwind year, and we want to share some of the lessons we’ve learned... We have a very broad view of how a lot of things work, and I think that has lead to a lot of our success,” Verdier said, adding that every social media platform is different and challenging but it’s quickly becoming the new way to reach consumers.\n“We just want everyone to be their best selfie... Each platform has its own challenges, but it’s important to know where your customer is engaging,” Suszanski said. “At the end of the day it’s what the consumer is using anyway; so that’s what we as marketers have to use.”\nONLINE\nFor more information on Selfie on a Stick, go to www.selfieonastick.com", "external_links": ["http://sav-cdn.com/sites/all/themes/savannahnow/images/blank.gif", "http://sav-cdn.com/sites/default/files/imagecache/superphoto/14815027.jpg", "http://sav-cdn.com/sites/default/files/imagecache/story_slideshow_thumb/14815027.jpg"], "published": "2015-10-16T19:37:00.000+03:00", "crawled": "2015-10-17T12:18:00.236+03:00", "highlightTitle": ""}