{"organizations": ["E. Mukilteo Blvd.", "Arlington Hardware Store", "Terrace Park School Gym", "Kontagious Arts Foundation", "Herald", "Kontagious Dance Company", "Volunteers of America Food Bank", "Marysville Community Food Bank", "Mountlake Terrace Dance Company Scholarship Fund", "Edmonds Community College", "Arlington United Church Harvest Party", "Nile Shriners", "Nile Shrine Golf Course", "WICA", "Zech Hall", "Black Box Theatre", "Whitewall Brewing"], "uuid": "eb8fd02d5eb4cfc5e5e2b47273b7fb2bae05f017", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.heraldnet.com", "main_image": "http://www.heraldnet.com/apps/pbcsi.dll/bilde?Site=DH&Date=20151010&Category=ENT&ArtNo=151019948&Ref=AR&MaxW=500&MaxH=500", "site_section": "http://www.heraldnet.com/section/RSS07&mime=xml", "section_title": "HeraldNet.com Entertainment", "url": "http://www.heraldnet.com/article/20151010/ENT/151019948", "country": "US", "title": "Want to scream? Head to a haunted house. Here's where.", "performance_score": 0, "site": "heraldnet.com", "participants_count": 0, "title_full": "Want to scream? Head to a haunted house. Here's where.", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T10:01:00.000+03:00", "replies_count": 0, "uuid": "eb8fd02d5eb4cfc5e5e2b47273b7fb2bae05f017"}, "author": "", "url": "http://www.heraldnet.com/article/20151010/ENT/151019948", "ord_in_thread": 0, "title": "Want to scream? Head to a haunted house. Here's where.", "locations": ["Mountlake Terrace", "Whidbey Island Center", "Seattle", "Marysville", "Marsh Road", "Lynnwood", "E. Mukilteo Boulevard", "Forest Park", "Sunnyside Blvd", "Mountlake Terrace Dance", "Snohomish"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jay Hitt", "Jody Bossert", "Bossert", "Langley", "Everett", "Ian Terry", "PJ Parsons", "Lake Stevens", "Shawn Morse"], "text": "<< Prev Next >> Ian Terry / The Herald A wrapped mummy is part of the Haunted Nightmare at the Nile at Nile Shrine Golf Course in Mountlake Terrace. Ian Terry / The Herald The final walkthrough area for guests at the Haunted Nightmare at the Nile at Nile Shrine Golf Course in Mountlake Terrace includes a dimly lit room with glowing clowns and other funhouse themes. Ian Terry / The Herald Patrons of the Haunted Nightmare at the Nile at Nile Shrine Golf Course in Mountlake Terrace come across a grisly scene on Saturday, Oct. 3, 2015. The haunted house, includes a beer garden as well as food for sale. Ian Terry / The Herald A projection is seen at the entrance to the Haunted Nightmare at the Nile at Nile Shrine Golf Course in Mountlake Terrace on Oct. 3. Ian Terry / The Herald A severed head decoration awaits visitors at the Haunted Nightmare at the Nile at Nile Shrine Golf Course in Mountlake Terrace on Oct. 3. Want a thrill scarier than I-5 traffic?Head to a haunted house.It's the ultimate way to take a stroll through a waking nightmare, and come face to face with those things that go bump in the night. Need a better reason to go?Many haunted houses are fundraisers that support good causes.And it's a safe way to get the you-know-what scared out of you.“Adrenaline junkies get a rush out of parachuting and skydiving,” said Jody Bossert, producer of Haunted Nightmare at the Nile in Mountlake Terrace, which partners with the Nile Shriners. “This gets blood pumping for people who want that rush but they aren't quite that hardcore so they want the feeling of security.”How scary is the Nile nightmare?“One a scale of 1-to-12, it's 13,” said Shawn Morse, Nile haunted director.The Nile haunted house is recommended for “brave 13-year-olds and older,” though there are no formal age restrictions.Youngsters and older scaredy cats can still get a piece of the action. On Oct. 25, from 3 to 8 p.m., there will be a Nile family fun fest, with scary lights, bouncy house and face painting.Bossert said this year's haunted house has new “scream-worthy” scenes, major upgrades to the haunted trail and cemetery, 3-D projection mapping and an LED tunnel with thousands of lights.The groundscreeper lurking in the shadows just might jump out to trim you down. When you catch your breath, there's a food and fear garden with treats and food trucks, plus frothy evil elixirs for those 21 and older. The haunted folks take the fright business seriously.“It's a year-round activity for us,” Bossert said. “We start building in early July.”They attend national haunters conventions for ideas and additions.At Nile, cellphones are not allowed inside. Selfies are allowed outside, so you can show your friends how brave you are. If you chicken out and don't go in, they'll never know. And nobody will hear you scream ... Haunted houses Haunted Nightmare at the Nile: 7 to 11 p.m. Fridays and Saturdays, 7 to 10 p.m. Thursdays and Sundays, Oct. 9 through 31; 244th Street SW, Mountlake Terrace, adjacent to the west side of I-5 at exit 177. The haunt goes pitch dark for a special Fright Light Night on Nov. 1. Tickets $15 general admission; $20 VIP (faster line). www.hauntednightmare.com Stalker Farms: 7 to 10 p.m. Thursdays through Sundays; just off Highway 9 at 8705 Marsh Road, Snohomish. Stalker Farms is filled with terrifying actors and surrounded by a creepy cornfield maze. Brave the gruesome Field of Screams and the clown-infested Last Laugh or take a ride into the fields to shoot paintballs at monsters. Food vendors and free parking. Portion of proceeds go to Strong Against Cancer. Ticket prices vary. Call 360-568-7391. www.stalkerfarms.com Thomas Family's Nightmare on 9: 6 to 10 p.m. Thursdays, 6 p.m. to midnight Fridays, 10 a.m. to 10 p.m. Saturdays and Sundays through Oct. 31; 9010 Marsh Road, Snohomish. Zombie paintball, flashlight corn maze, fire pit rentals. Beer in the Barn, noon to 5 p.m. Oct. 10; tickets $20. Halloween costume party, 7 to midnight Oct. 31. Prices vary. www.thomasfamilyfarm.com Carleton Farm: 7 to 10 p.m. Friday and Saturdays, also Thursday Oct. 29, through Oct. 31; 630 Sunnyside Blvd. SE, between Everett and Lake Stevens. Zombie Paintball, Haunted Swamp, Zombie Farm and Evil Clowns. Kids activities are 10 a.m. to 6 p.m. www.frightmaze.com Events Goblin Splash: 7 to 8:30 p.m. Oct. 16, Swim Center at Forest Park, 802 E. Mukilteo Boulevard, Everett. Show off your Halloween costume and exercise with splashy indoor fun. Enjoy some not-too-scary hijinks as you play games for prizes, swim and sample festive refreshments. Bring a generous canned food donation for the Volunteers of America Food Bank or pay admission to boost the Park Scholarship Fund. Ages 3 to 15. Mother-son Monster Mash: 6 p.m. Oct. 23, Floral Hall in Forest Park, 802 E. Mukilteo Blvd., Everett. Grandmas, mothers and aunties are invited to bring their boys of all ages to an evening with treats, drinks, spooky decorations and upbeat music for dancing. Check in at 6 p.m., and take a turn in the photo booth for free souvenir prints. PJ Parsons, a live DJ, will play a mix of popular music from 6:30 to 8:30 p.m. Tickets are $29 for each mother-child pair, and $6 for each additional son. Registration is required. To learn more or register, go to signmeup.everettwa.gov , call 425-257-8300, ext. 2, or visit the Recreation Office between 9 a.m. and 5:30 p.m. Monday through Friday. Costume Carnival: 5 to 9 p.m. Oct. 24 at Terrace Park School Gym, 5409 228th St. SW, Mountlake Terrace. The city of Mountlake Terrace Dance and Fitness Program, with performances by the Kontagious Dance Company, hosts its ninth annual carnival. Harvest festival activities, a costume contest, dancing and dance performances, snacks, games and crafts. Tickets are $5 or $10 for a family. Proceeds benefit the Mountlake Terrace Dance Company Scholarship Fund and the Kontagious Arts Foundation. For more information, call 425-640-3107. Haunted STEM lab: Edmonds Community College invites the community to visit the haunted Science, Technology, Engineering, and Mathematics lab from noon to 6 p.m. Oct. 30 in Monroe Hall, 6606 196th St. SW, Lynnwood. Witness explosive demonstrations and participate in hands-on activities such as 3D ghost printing and laser cutting goblins. There will also be candy launches and vortex smoke rings. The event is free and all ages welcome. Sound to Summit Halloween Bash: Snohomish's Sound to Summit Brewing Halloween Bash is 9 p.m. to midnight Oct. 30 at the brewery, 1830 Bickford Ave No. 111, Snohomish. There will be a costume contest, food and live music from Dead to Rights. Event is 21-and-older and tickets are $5 in advance or $10 at the door. For more information, call 360-294-8127. Boo-La-La!: 7:30 p.m. Oct. 30 and 31 at Whidbey Island Center for the Arts, 565 Camano Ave, Langley. Seattle's Can Can Productions, an award-winning dance troupe, puts on a two-night Halloween burlesque show titled Boo-La-La! This is a one-of-a-kind Halloween treat and the only all-adult Halloween party of the season. Come for the burlesque and then stay for the party afterwards in Zech Hall for a meet-and-greet with the dancers in WICA's Piano Bar. Tickets are $25 and includes the post-show party. For tickets, go to www.wicaonline.org or call 360-221-8268 or 800-638-7631. “Haunted Doorways”: 8 p.m. Saturdays through Oct. 31, Black Box Theatre, Edmonds Community College. Billed as “Let's Make a Deal” meets “Saw,” this reality game show from Jay Hitt has three contestants choose door prizes with comically horrific consequences. Halloween Trick or Feed: Marysville's Whitewall Brewing is hosting a Halloween Trick or Feed, a costume contest and food drive, from 1 to 3 p.m. Oct. 31 at the brewery, 14524 Smokey Point Blvd, Suite 1, Marysville. Dress up in your favorite costume and bring nonperishable food items to donate to the Marysville Community Food Bank. For more information, including a list of items needed, go to the brewery's Facebook page . Arlington's Hometown Halloween: Pumpkin carving contest Saturday morning, Oct. 31 at Arlington Hardware Store, 215 N. Olympic Ave. Arlington United Church Harvest Party, 11 a.m. to 3 p.m. at the church, 338 N. McLeod Ave. Trick or Treat along Olympic Avenue from noon to 1 p.m. followed by a costume contest at 1 p.m. in Legion Park. Roll your pumpkins down First Street Hill at 1:30 p.m. All ages. More information at the city recreation office, 360-403-3448.", "external_links": [], "published": "2015-10-10T10:01:00.000+03:00", "crawled": "2015-10-10T12:08:17.870+03:00", "highlightTitle": ""}