{"organizations": [], "uuid": "17b851fba77a9802477c50757b333725365305ad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.arcamax.com", "main_image": "http://www.arcamax.com/jsnews/images/columns/katiedidlangrock.jpg", "site_section": "http://www.arcamax.com/entertainment/", "section_title": "Entertainment | ArcaMax Publishing", "url": "http://www.arcamax.com/entertainment/humor/katiedidlangrock/s-1734679?fs", "country": "US", "title": "The Frozen Pizza Disaster | Katiedid Langrock | Columns", "performance_score": 0, "site": "arcamax.com", "participants_count": 1, "title_full": "The Frozen Pizza Disaster | Katiedid Langrock | Columns | ArcaMax Publishing", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "17b851fba77a9802477c50757b333725365305ad"}, "author": "arcamax.com", "url": "http://www.arcamax.com/entertainment/humor/katiedidlangrock/s-1734679?fs", "ord_in_thread": 0, "title": "The Frozen Pizza Disaster | Katiedid Langrock | Columns", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Yes, I am often barefoot and pregnant in the kitchen, but please don't confuse that with being domestic. I am a far cry from that.\nI don't cook. I wish I did. I wish I enjoyed it -- the same way I wish I enjoyed exercise and Herman Melville and carrots and paying taxes. Sure, these things are considered \"good for you,\" but I hate them, and lucky for me, they are 100 percent avoidable. I don't think I've had a carrot in six years. These are the adulthood perks you dream about as a kid.\nMy family does eat, of course. And though we are fans of ordering delivery, many meals come from grocery shopping. They will be cooked in the microwave or on the stovetop -- representations of all five food groups that come in one easy-to-pour-into-pan meal and are equipped with a seasoning packet. Count me in! But let's be clear; this isn't cooking. This is faux cooking. It's how Trader Joe's and its ilk make people like me not feel like complete failures as parents. My pantry and freezer are full, and my refrigerator is used solely to store milk. That says everything.\nThe oven is turned on once a year. It's called Thanksgiving. This holiday is met with an excess of complaining that the vegetarian is responsible for not just cooking the Thanksgiving turkey but also pulling its innards out of its butt. (The complaining is coming from me, not the turkey. That would just be weird -- and would signify that I'm even worse at cooking than I thought.) Inevitably, at some point during the day, the smoke alarm goes off.\nWhich brings me to yesterday.\nMy husband was taking our toddler to swimming lessons, and I decided to use my advanced culinary skills to make not just one frozen pizza but two. And these weren't your run-of-the-mill frozen pizzas. Oh, no. We were having a Brie and mushroom medley on one pie and ham and Gruyere on the other. Just call me Martha Child. Or is it Julia Stewart?\nI followed the instructions on the box and heated my oven to 500 F. Then I placed the two pies directly on the middle rack and set the timer for 10 minutes. I really don't know what I did wrong. Truly. But six minutes into baking, the house was filled with enough smoke to set off the fire alarm.\nMy house is equipped with a security system that is connected to the smoke detector. There is just one problem: The security control panel is by the front door, and the smoke detector is in the bedroom hallway. Turning off the alarm becomes a two-person job -- with one person to fan the smoke away from the alarm and the other to disarm the control panel. But I was home. Alone.\nAt nine months pregnant, I ran (read: waddled) to the control panel to put in my code, letting the security company know that I was fine and not in need of fire assistance. I then pulled a chair into the hallway and hoisted my top-heavy body up onto it and fanned the alarm. My phone began to ring; it was the security company. I ran (read: waddled) to the kitchen, answered the phone and was informed that the fire department was on the way. I told the security system to tell the fire department it was a false alarm. But by the time I hung up the phone, the smoke alarm was back to ringing by the bedrooms, and the control panel was back to beeping by the front door. I ran (read: waddled) back to the front door, plugged in my code again, headed back to the hallway and was actively fanning the smoke detector, when a huge firetruck pulled up in front of my house. Sirens blaring. Five firefighters jumped out holding extinguishers.\nI felt terrible and met the men at my front door.\n\"I'm sorry you came,\" I said. \"There's no fire. I just tried to make a frozen pizza.\"\n\"Did you keep it in the cardboard box?\" a firefighter asked.\nI shook my head no.\n\"All this smoke from a frozen pizza? How'd you do that?\"\nI have no idea.\nP.S. Dear IRS, disregard the earlier tax comment. It was a joke. Promise.\nP.P.S. Pretty please, don't look into my taxes.\n===", "external_links": [], "published": "2015-10-10T03:00:00.000+03:00", "crawled": "2015-10-12T01:22:48.276+03:00", "highlightTitle": ""}