{"organizations": [], "uuid": "12842863a6a2a48151da6c6262d850b133890d7f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.india.com", "main_image": "http://s3.india.com/wp-content/uploads/2015/10/CR6MOMoUEAAcso_.jpg", "site_section": "http://www.india.com/feed/", "section_title": "India | Latest India News | Get Free India.com Email | Live Cricket and Entertainment News at India.Com", "url": "http://www.india.com/news/world/bashar-assad-fighting-terrorism-leads-to-political-solution-657753/", "country": "US", "title": "Bashar Assad: Fighting terrorism leads to political solution", "performance_score": 0, "site": "india.com", "participants_count": 1, "title_full": "Bashar Assad: Fighting terrorism leads to political solution", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T19:07:00.000+02:00", "replies_count": 0, "uuid": "12842863a6a2a48151da6c6262d850b133890d7f"}, "author": "Wires English | Press Trust of India", "url": "http://www.india.com/news/world/bashar-assad-fighting-terrorism-leads-to-political-solution-657753/", "ord_in_thread": 0, "title": "Bashar Assad: Fighting terrorism leads to political solution", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments \nDamascus, Oct 25: Syrian President Bashar Assad told a visiting Russian delegation that eradicating “terrorist” groups in Syria will lead to the political solution that Damascus and Moscow are seeking, Syrian state media reported today. Assad’s comments come as top diplomats from Russia, the US, Saudi Arabia and Turkey are discussing new ideas to revive a failed political transition in Syria to end the wa, now in its fifth year. (read: Haiti votes for new president amid security concerns) \nThe war, which has killed 250,000 Syrians and displaced millions, has become increasingly complex as Russia and a US-led coalition attack different insurgent groups in Syria in separate and uncoordinated air campaigns.Russian lawmakers meanwhile told Russia media that Assad is prepared to take part in an early presidential election, hold parliamentary elections and discuss constitutional changes, but only after the “terrorist” forces in Syria are defeated. \nCommunist lawmaker Alexander Yushchenko told the Tass news agency that the Syrian president is ready if necessary to hold an early presidential election but only “after victory over terrorism on the territory of Syria.”Sergei Gavrilov, another Communist lawmaker, told Tass that Assad was ready to hold parliamentary elections that included “reasonable, patriotic opposition forces.” \nThe new diplomatic push follows the recent Russian military intervention in Syria, targeting what Moscow and Damascus call “terrorists” with daily airstrikes.Opposition groups and Washington say the Russian air campaign aims to bolster Assad who has faced major setbacks from advancing insurgents, including western-backed rebels, ultraconservative Islamists as well as militant groups. \nRussia says it is targeting the Islamic State group and other terrorists in Syria, but most of the Russian airstrikes have focused on areas where the IS militants do not have an active presence. Russian airstrikes have also enabled a government ground offensive on a number of fronts, backed by allied troops from Lebanon’s Hezbollah and Iran’s Revolutionary Guards.Meanwhile, Moscow has invited the US, Saudi Arabia and Turkey to coordinate their air campaign, which targets the Islamic State group in Syria. \nBut so far the US-led coalition has refused to cooperate with Russia’s operations beyond a basic agreement intended to prevent mid-air incidents. Jordan, a member of the US-led coalition, has agreed to separately coordinate with Russia. Assad told the visiting Russian delegation that Moscow’s entry into the conflict is “the writing of a new history” and will determine the future of the region and the world. He said eradicating terrorists groups will lead to the solution sought by Russia and Syria which “pleases the Syrian people and maintains Syria’s sovereignty, independence and territorial integrity.” \n  25, 2015 8:41 PM Topics:", "external_links": [], "published": "2015-10-25T19:07:00.000+02:00", "crawled": "2015-10-25T23:52:44.688+02:00", "highlightTitle": ""}