{"organizations": [], "uuid": "e0681da23fd4ad969501d5fb21bbc32614a46106", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.forbes.com", "main_image": "{{meta.image}}", "site_section": "http://www.forbes.com/media-entertainment/", "section_title": "Forbes - Media Information and Entertainment News - Forbes.com", "url": "http://www.forbes.com/sites/anthonydemarco/2015/10/01/harry-winston-unveils-art-deco-inspired-collection/", "country": "US", "title": "Harry Winston Unveils Art Deco Inspired Collection", "performance_score": 0, "site": "forbes.com", "participants_count": 1, "title_full": "Harry Winston Unveils Art Deco Inspired Collection", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T04:49:00.000+03:00", "replies_count": 0, "uuid": "e0681da23fd4ad969501d5fb21bbc32614a46106"}, "author": "Anthony DeMarco", "url": "http://www.forbes.com/sites/anthonydemarco/2015/10/01/harry-winston-unveils-art-deco-inspired-collection/", "ord_in_thread": 0, "title": "Harry Winston Unveils Art Deco Inspired Collection", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Art Deco has to be the most enduring of all period jewelry styles. It is defined by bold geometric shapes, lavish ornamentation and rich colors. However, the style can also be delicate, refined and colorless. It interpreted the rapid industrialization of the western world from the mid-1920s to the 1940s, often taking its cues from technology, machinery and skyscrapers.The style is still popular today and is often used in design by contemporary jewelers in both nostalgic ways and in new interpretations.When Harry Winston founded his eponymous jewelry brand in 1932, the Art Deco scene was in its heyday and its signature designs personified the luxury and glamour of the period. Harry Winston continues this heritage through a collection of six colorless diamond and platinum jewels that underscore the distinctive architectural style of the 1930s. Titled, “Art Deco by Harry Winston,” the collection evokes the iconic elegance of the period with combinations of round brilliant and baguette diamonds set in a symmetrical geometric shapes and angular forms. All of the pieces represent a singular sculptural motif, whether it is used as a central design element or repeated. The collection consists of a diamond sautoir, single and multi-motif diamond bracelets, single motif diamond earrings, a diamond pendant and a ladies jewelry timepiece using the same motif. The pieces represent the refined and colorless interpretation of the Art Deco design period. The collection is available at Harry Winston salons worldwide.", "external_links": [], "published": "2015-10-02T04:49:00.000+03:00", "crawled": "2015-10-02T00:43:26.162+03:00", "highlightTitle": ""}