{"organizations": [], "uuid": "fc328ac1e66e764d983351d54bfcbe0117f05987", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.glamour.com", "main_image": "http://www.glamour.com/images/entertainment/2015/10/kim-kardashian-kanye-west-main.jpg", "site_section": "http://feeds.glamour.com/glamour/all_entertainment", "section_title": "All Entertainment", "url": "http://www.glamour.com/entertainment/blogs/obsessed/2015/10/kanye-west-kim-kardashian-pregnant-birthday-party-pics", "country": "US", "title": "Kanye West Throws Kim Kardashian a Surprise \"Pregnant\" Birthday Party: Glamour.com", "performance_score": 0, "site": "glamour.com", "participants_count": 1, "title_full": "Kanye West Throws Kim Kardashian a Surprise \"Pregnant\" Birthday Party: Glamour.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T21:30:00.000+03:00", "replies_count": 0, "uuid": "fc328ac1e66e764d983351d54bfcbe0117f05987"}, "author": "glamour.com", "url": "http://www.glamour.com/entertainment/blogs/obsessed/2015/10/kanye-west-kim-kardashian-pregnant-birthday-party-pics", "ord_in_thread": 0, "title": "Kanye West Throws Kim Kardashian a Surprise \"Pregnant\" Birthday Party: Glamour.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Kanye West isn't exactly known for being understated. His proposal to Kim Kardashian involved a Major League baseball stadium, a 50-piece orchestra, and a 15-carat rock boulder of a diamond. (Their wedding was also, not surprisingly, over the top—and that's putting it lightly.) His idea of sending flowers is less \"here's a nice arrangement\" and more \"here's an entire, stunning garden\" ( case in point: Taylor Swift ). And whenever Kanye takes the stage, you're not sure what exactly is going to go down—microphone-stealing, announcing a presidential bid , etc. So it's certainly not shocking that Kanye would go all out to throw wife Kim Kardashian's surprise 35th birthday party (this is the man who commissioned a Warhol painting for her ).\nHere are all the deets on Kim's fabulous party: Kanye rented out an entire movie theater in Westlake Village, California, and arranged for a private screening of Steve Jobs (only one of the hottest and most anticipated films of the season, naturally). He invited all of Kim's family and close friends (sister Khloe, however, wasn't in attendance)—and had them all dress up as their best \"pregnant Kim.\" (ICYMI, Kim is currently seven months pregnant with their second child, a son.) Of course, fake bumps were provided to all guests upon arrival to complete their looks. Capping off the kids-free celebrations were delicious food (including churros), drinks from Margarita Man, a gorgeous cake, and Kanye's signature drop-dead gorgeous flower wall and arrangements. Take a look at all of the pics from the epic celebrations below:\nI wasn't expecting to look this way again quite yet, but Happy Pregnant Birthday @kimkardashian !!\nA photo posted by Kourtney Kardashian (@kourtneykardash) on Oct 21, 2015 at 9:18pm PDT\nA photo posted by Kim Kardashian West (@kimkardashian) on Oct 21, 2015 at 8:57pm PDT\nObviously, Kim was thrilled with the party. \"My husband never ceases to amaze me,\" she wrote on Instagram. \"Not sure if that [pregnant theme] was to make me feel less huge or just a fun cool theme but I loved it and had the best time ever, feeling so very comfortable eating churros with a bunch of pregnant women! Just what I needed, the perfect chill yummy food birthday!\"\nWant to celebrate Kim's birthday from afar? Check out how her makeup looks have changed over her 35 years .", "external_links": ["https://instagram.com/p/9IE3g-k1hS/", "https://instagram.com/p/9ICf74OS3H/"], "published": "2015-10-22T21:30:00.000+03:00", "crawled": "2015-10-23T00:39:58.189+03:00", "highlightTitle": ""}