{"organizations": [], "uuid": "5aa9a8bb1d329ec097ca1d2fb55a7cf17470d833", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ktxs.com", "main_image": "http://www.ktxs.com/image/view/-/35936944/highRes/2/-/maxh/640/maxw/640/-/dgl2vj/-/Star-Wars-trailer-2.jpg", "site_section": "http://www.ktxs.com/14770048?format=rss_2.0&view=feed", "section_title": "Feed:Entertainment", "url": "http://www.ktxs.com/features/entertainment/final-star-wars-trailer-is-here/35934538", "country": "US", "title": "Final 'Star Wars' trailer is here", "performance_score": 0, "site": "ktxs.com", "participants_count": 0, "title_full": "Final 'Star Wars' trailer is here", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T11:09:00.000+03:00", "replies_count": 0, "uuid": "5aa9a8bb1d329ec097ca1d2fb55a7cf17470d833"}, "author": "", "url": "http://www.ktxs.com/features/entertainment/final-star-wars-trailer-is-here/35934538", "ord_in_thread": 0, "title": "Final 'Star Wars' trailer is here", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Henry Hanks CNN"], "text": "Final 'Star Wars' trailer is here Movie to hit theaters on Dec. 18 By Henry Hanks CNN POSTED: 9:34 PM Oct 19 2015 UPDATED 46 mins Text Size: New trailer for 'Star Wars: The Force Awakens' (CNN) - \nThe latest trailer for \"Star Wars: The Force Awakens\" debuted on ESPN during this week's Monday night football game, perhaps the most anticipated halftime outside of a Super Bowl. More Headlines 'Star Wars: The Force Awakens': What we know \nThe trailer introduces us once again to Daisy Ridley's Rey and John Boyega's Finn, before kicking into high gear with glimpses of Han Solo, Chewbacca and Princess Leia, not to mention the evil Kylo Ren, space battles and all we're used to seeing from the best \"Star Wars\" movies. \nThe film is set decades after \"Return of the Jedi.\" And as the trailer shows, the younger characters aren't sure the stories about the Jedi are real. Han assures them everything they've heard is true. \nMeanwhile, Kylo Ren is set on finishing what Darth Vader started (one would guess that means wiping out any vestiges of the Jedi at least). \nDirector J.J. Abrams prefaced the trailer with a note to fans: \"I don't care if you're black, white, brown, Jawa, Wookiee, Jedi or Sith. I just hope you like it!\" \nLike the other \"Force Awakens\" trailers, fans across the board raved about the trailer, which is sure to be dissected frame by frame in the hours to come. \nThe reaction was so rapturous (combined with some frustration about ticket difficulties) that it was a very unique night to be a \"Star Wars\" fan, with many comparing it to the feelings they felt seeing the original trilogy. \nWatch it here: it's your last big look at the movie until December 18, 2015. \nCopyright 2015 by CNN NewSource . All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-10-20T11:09:00.000+03:00", "crawled": "2015-10-20T11:57:18.950+03:00", "highlightTitle": ""}