{"organizations": ["Louis Dillon Savage Local Real Estate Cars"], "uuid": "b4569f621d6e49a796326fd1d8b1ef78e10c4cca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.byronnews.com.au", "main_image": "http://media.apnarm.net.au/img/media/images/2015/10/01/LNS_01-10-2015_ENTERTAINMENT_05_LIS0110FALLEN3_fct666x500x175.0_ct300x300.jpg", "site_section": "http://feeds2.feedburner.com/ByronnewscomauEntertainment", "section_title": "byronnews.com.au: Entertainment", "url": "http://www.byronnews.com.au/news/the-tale-of-a-wild-courtesan/2792215/", "country": "IL", "title": "Musical theatre with a wild taste and a bittersweet history", "performance_score": 0, "site": "byronnews.com.au", "participants_count": 0, "title_full": "Musical theatre with a wild taste and a bittersweet history", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T17:00:00.000+03:00", "replies_count": 0, "uuid": "b4569f621d6e49a796326fd1d8b1ef78e10c4cca"}, "author": "", "url": "http://www.byronnews.com.au/news/the-tale-of-a-wild-courtesan/2792215/", "ord_in_thread": 0, "title": "Musical theatre with a wild taste and a bittersweet history", "locations": ["Paris"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Marie Duplessis", "Javier Encalada"], "text": "Musical theatre with a wild taste and a bittersweet history Javier Encalada | 4th Oct 2015 12:00 PM Javier Encalada Songs for the Fallen is a musical-party charting French courtesan Marie Duplessis’ life from poverty to infamy in burgeoning 19th century Paris. Louis Dillon Savage Local Real Estate Cars For Sale \nON January 15, 1847, French courtesan, party girl, liar and legend Marie Duplessis got out of bed, put on a dress, ordered a bottle of champagne, and sat alone in her Paris apartment to celebrate her birthday. \nShe died 18 days later, aged 23. \nBut mademoiselle was not done yet. \nSongs for the Fallen is a musical theatre and cabaret show charting Marie's life from poverty to fame (and infamy) in 19th century Paris. \nThis is the wild and hilarious tale of a woman who knew that good girls don't make history. \nSongs for the Fallen is a cabaret show that tells Marie's story with a modern score to understand the woman behind the legend. \nCabaret singer and actress Sheridan Harbridge said Duplessis was the inspiration for French writer Alexandre Dumas' masterpiece, the Lady of the Camellias. \n\"I was looking for a project to mix cabaret and theatre and I remembered a teacher telling me about this famous courtesan,\" she said. \n\"She famously wore a white camellia for 25 days of the month and a red camellia the other five days, when she was 'out of businesses'. \n\"Alexander Dumas was one of her lovers, so at first I was going to do an adaptation of his story and their romance. \n\"But then her real story was so much more inspiring and horrific. She dragged herself out of the poorest life in Europe, and she, in a very short amount of time, transformed herself from a poor peasant to be, at age 18, one of the most emulated, well-known and sought after courtesan in France.\" \nMs Harbridge said the show needed a musical background that hit historical and modern notes. \n\"We had to develop something new, we called it 'baroque pop for the party girl' where we take music from strong women such as Lady Gaga and Beyonce and we added baroque elements to it.\" \n\nAt the Byron Theatre, Saturday and Sunday, October 16-17, 6pm. cabaret", "external_links": [], "published": "2015-10-03T17:00:00.000+03:00", "crawled": "2015-10-04T18:07:24.620+03:00", "highlightTitle": ""}