{"organizations": [], "uuid": "1d36595787e2f5264cb22b90cbc54100a16f3e6e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.greatfallstribune.com", "main_image": "http://www.gannett-cdn.com/-mm-/d4bb63df4eefde91b8b04f29fb46149ce67e3381/c=0-248-3883-2442&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/10/21/GreatFalls/GreatFalls/635810485211870082-FALTab-10-24-2014-HotTicket-1-H006--2014-10-23-IMG--FALTab-07-05-2013-V-1-1-268SMR7V-L505206878-IMG--FALTab-07-05-2013-V-1-1-268SMR7V.jpg", "site_section": "http://rssfeeds.greatfallstribune.com/greatfalls/local-entertainment", "section_title": "Hot Ticket - Local Entertainment", "url": "http://www.greatfallstribune.com/story/entertainment/2015/10/21/colors-fall-art-show/74357038/", "country": "US", "title": "Get a look at the Colors of Fall", "performance_score": 0, "site": "greatfallstribune.com", "participants_count": 0, "title_full": "Get a look at the Colors of Fall", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T05:42:00.000+03:00", "replies_count": 0, "uuid": "1d36595787e2f5264cb22b90cbc54100a16f3e6e"}, "author": "", "url": "http://www.greatfallstribune.com/story/entertainment/2015/10/21/colors-fall-art-show/74357038/", "ord_in_thread": 0, "title": "Get a look at the Colors of Fall", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Charles Fulcher", "Traci Rosenbaum"], "text": "Get a look at the Colors of Fall Traci Rosenbaum, trosenbaum@greatfallstribune.com 8:42 p.m. MDT October 21, 2015 Artist Charles Fulcher paints at the 2012 Colors of Fall Art Show and Sale. This year's event will be Oct. 23 to 25. (Photo: TRIBUNE PHOTO/RION SANDERS) COLORS OF FALL ART SHOW AND SALE Oct. 23 to 25   \nThe Ad Club’s Colors of Fall Art Show and Sale is back for its fourth year at the Montana ExpoPark Exhibition Hall. \nThe show opens Friday, Oct. 23, kicking off with a ticketed preview event from 5:30 to 8 p.m. Artists who are part of the show get to invite patrons to see their work, and the public can purchase tickets for $25 through the Ad Club. \n“It’s just a nice relaxed way for the artists to meet with their patrons again and reconnect,” executive director John Godwin said. \nAlthough Colors of Fall does benefit the Ad Club, Godwin says it’s also an important way to promote the arts in Montana. \n“It is a fundraiser for us, but it’s also about wanting to connect newer artists with buyers,” he said. This year's fourth-annual event features artists in a variety of media. Exhibitors come from all over Montana and the United States, and their artwork ranges from sandstone art to watercolor to oil or acrylic paintings to bronze sculpture. \nSaturday, Oct. 24, marks the opening of the show to the general public from 10 a.m. to 9 p.m. Organizers added a special treat this year as jazz artist Jeni Fleming plays from 7:30 to 9. \nThe ExpoPark provides concessions, and Stockman Bank has a café area offering a quiet place for attendees to enjoy a latte, snack or a meal while they contemplate their art purchases. There are also art activities for the kids. \nThe hours on Sunday, Oct. 25, are 11 a.m. to 3 p.m. with the awards for Budding Artists presented at 2 p.m. \nBudding Artists is a competition open to area high schools. Students are given the prompt “interpret the colors of fall” and turned loose to make art in the style and medium of their choice. All those pieces are judged the Thursday before the sale, and the top artists receive awards. \nIn previous years, there was a charge for admission, but now the show is free to the public. \n“We decided not to put hurdles in front of people,” Godwin said. “It’s a great opportunity to meet the artists in a nice casual atmosphere.” THE ESSENTIALS \nWhat: Colors of Fall Art Show and Sale \nOct. 23: VIP Reception from 5:30 to 8 p.m. \nOct. 24: 10 a.m. to 9 p.m. \nOct. 25: 11 a.m. to 3 p.m. \nWhere: Montana ExpoPark Exhibition Hall \nCost: Preview event is $25, all other admission is free Read or Share this story: http://gftrib.com/1RXrEHE MORE STORIES", "external_links": [], "published": "2015-10-22T05:42:00.000+03:00", "crawled": "2015-10-22T08:41:36.844+03:00", "highlightTitle": ""}