{"organizations": [], "uuid": "015a04c42c99fe23f81f171f00f8fe188aa81ba8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freep.com", "main_image": "http://www.gannett-cdn.com/-mm-/f6f57b89481bd1b5c8ff90a2f51681b280463ff7/c=0-861-2261-2138&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/09/DetroitFreePress/DetroitFreePress/635799970945912292-GTY-491479946.jpg", "site_section": "http://rssfeeds.freep.com/freep/entertainment", "section_title": "Detroit Free Press - Entertainment", "url": "http://www.freep.com/story/entertainment/2015/10/09/darren-criss-glee-broadway-university-of-michigan-centennial-theater-department/73663004/", "country": "US", "title": "Darren Criss marks a University of Michigan birthday", "performance_score": 1, "site": "freep.com", "participants_count": 2, "title_full": "Darren Criss marks a University of Michigan birthday", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T02:25:00.000+03:00", "replies_count": 1, "uuid": "d2ef4ec798c57cb91266e0ae1663088726aad87b"}, "author": "freep.com", "url": "http://www.freep.com/story/entertainment/2015/10/09/darren-criss-glee-broadway-university-of-michigan-centennial-theater-department/73663004/#post-0", "ord_in_thread": 0, "title": "Darren Criss marks a University of Michigan birthday", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MORE\nDarren Criss sounded friendly if a bit frantic during a Thursday night phone call that was cutting his schedule a little too close.\n\"I have to get onstage in about 10 minutes and I have to memorize two scenes, a dance and I have to go through some notes and get into costume,\" said the former \"Glee\" star, whose career continues to rise on TV, Broadway and film.\nCriss was speaking from Ann Arbor during a trip back at his alma mater, the University of Michigan, for the centennial celebration of the college's department of theater and drama.\nHe performed Thursday night at Ann Arbor's Power Center in \"A Very StarKid Reunion.\" The show brought together members of a student theater troupe that launched during Criss' college days and gained fame through the 2009 viral sensation \"A Very Potter Musical.\"\nPhotos from the evening show Criss onstage wearing Harry's wire-rim glasses and reenacting scenes from StarKid shows that turned the fledgling group into a creative force that continues today.\n\"Because I work so much and spend so much time with what is known as StarKid now, it's as though I never really left Michigan,\" said Criss during an conversation squeezed into a busy day of rehearsals and catching up with people on campus. \"I quite literally took StarKid from Michigan with me.\"\nMost of the centennial's events are taking place during Homecoming Weekend, the annual gathering that gives Maize and Blue alums everywhere a chance to relive their college glory days.\nYou can count Criss as a devoted U-M fan. \"As evident by one of the most enthusiastic alumni associations out there, I think everybody who comes to Michigan for the most part has a pretty amazing resonance for the rest of their lives,\" he said of his school ties. \"I'm definitely no exception there.\"\nThe centennial is also honoring the 100th birthday of the late Arthur Miller, one of America's greatest playwrights and a 1938 U-M graduate. Miller's \"All My Sons\" will play through Oct. 18 at the theater named for him that's inside the School of Music, Theatre and Dance's Walgreen Drama Center.\nAlso planned is an Arthur Miller symposium and a mini-conference running Wednesday-Friday. It kicks off Wednesday with a keynote speech by Enoch Brater, a U-M teaching legend and well-known Miller expert.\nFor Criss, who graduated in 2009 with a bachelor of arts, the Web fame of \"A Very Potter Musical\" was a happy accident that resulted from the decision to post the show online. A fond spoof of Harry Potter, it originally had five free performances in Ann Arbor.\n\"We only put it on YouTube because that was easier than making a DVD for all of our friends,\" recalls Criss. \"We put it on the Internet so our friends could see it, not so the world could see it.\"\nThe musical, which went on to earn millions of hits, was praised by New York magazine and Entertainment Weekly, which thanked the U-M students \"for bringing this kind of joy into the world.\"\nCriss said the positive reaction took him and his friends by total surprise. \"It's like if you had a really great party and your friends videoed it and took some pictures. And then all of a sudden, the next day, people on the street would come up to you and be able to Quote: something said at the party. It was like, 'Oh my God, how do you know about that line?' \"\nStarKid has gone on to create several other shows and accumulate 180 million views on its YouTube channel.\nCriss and StarKid were together last month performing in New York City at the first Elsie Fest, an outdoor music event he shepherded that featured Broadway actors and was aimed at young people interested in theater.\n\"I never thought I'd be able to make a living doing fun stuff with my friends from college, so it's nice to be able to continue that,\" said Criss.\nCriss has had some pretty amazing \"A Very Potter Musical\" experiences through the years, including watching part of the first act with director Chris Columbus, who helmed the first two Potter movies.\nBut one of his proudest moments has been encountering current U-M students who first saw the musical when they were just 15 or 16.\n\"You have people who go here who say to us, 'I came to U-M because of StarKid.' And that's really a treat for us. We're really proud of what we've done and we're really proud of the school, and to be able to inspire other people is really really encouraging.\"\nCriss is in the cast of FX's \"American Horror Story: Hotel,\" the new season starring Lady Gaga that premiered last week. He had a stint this year as Hedwig in the Broadway revival of \"Hedwig and the Angry Inch.\" In June, news spread that he's been cast in a leading role in a romantic comedy called \"Smitten!\" that will be written and directed by Barry Morrow, who wrote \"Rain Man.\"\nHis advice to theater kids? See as much as you can in terms of theater, film, music, dance, whatever.\n\"When you're at a place like the University of Michigan, or any university for that matter, the resources are so mind-numbingly at your fingertips. There are concerts coming to you, there are things that are free. If you have a student ID, there are so many things to experience right in your front yard. It's your obligation as an artist to immerse yourself in as much as you can.\"\nAdds Criss, \"If you don't like it, then figure out what you could do better.\"\nContact Detroit Free Press writer Julie Hinds: 313-222-6427 or jhinds@freepress.com.\nFor more information on the University of MIchigan's department of theater and drama centennial, go to t he U-M School of Music, Theatre & Dance's website .", "external_links": ["https://www.youtube.com/embed/wmwM_AKeMCk?feature=oembed", "http://www.music.umich.edu/departments/theatre/news.php?id=440"], "published": "2015-10-10T02:25:00.000+03:00", "crawled": "2015-10-10T16:11:26.769+03:00", "highlightTitle": ""}