{"organizations": [], "uuid": "489aa1f707f231f9f42086d64a6329eb65c7bc43", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattletimes.com", "main_image": "http://static.seattletimes.com/wp-content/uploads/2015/10/f9d2b62a-7686-11e5-9b6f-703717d3539c-474x711.jpg", "site_section": "http://www.seattletimes.com/", "section_title": "The Seattle Times | Local news, sports, business, politics, entertainment, travel, restaurants and opinion for Seattle and the Pacific Northwest. ", "url": "http://www.seattletimes.com/entertainment/tv/being-mary-jane-begins-third-season-on-bet/", "country": "EU", "title": "‘Being Mary Jane’ begins third season on BET", "performance_score": 0, "site": "seattletimes.com", "participants_count": 1, "title_full": "‘Being Mary Jane’ begins third season on BET | The Seattle Times", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T15:00:00.000+03:00", "replies_count": 0, "uuid": "489aa1f707f231f9f42086d64a6329eb65c7bc43"}, "author": "Doug Knoop", "url": "http://www.seattletimes.com/entertainment/tv/being-mary-jane-begins-third-season-on-bet/", "ord_in_thread": 0, "title": "‘Being Mary Jane’ begins third season on BET", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "‘Being Mary Jane’ This drama about a single woman who works for a news-style daytime TV show, starts off its third season with Mary Jane (Gabrielle Union) being rushed to the hospital after an accident. Season premiere, 9 p.m. Tuesday, Oct. 20, on BET.\nDoug Knoop: dknoop@seattletimes.com or on Twitter @dougknoop\nAlso on Tuesday Most Read Stories Pair split; now can she divorce nickname? Next Air Force One will fly faster, farther with advanced technology What’s really wrong with the Seahawks? They’re just not as good Panthers 27, Seahawks 23: What the national media are saying about another Seattle collapse Seattle Seahawks to lift suspension on fullback Derrick Coleman Unlimited Digital Access. $1 for 4 weeks. “It’s the Great Pumpkin, Charlie Brown,” 8 p.m. (ABC): Linus waits in the pumpkin patch for the elusive Halloween symbol to appear.\n“The Grinder,” 8:30 p.m. (Fox): Stewart and Deb think a new couple, Lyle and Vanessa, like them because Dean is a celebrity; Claire is the only person Dean has met who is not affected by his fame.\n“NCIS: New Orleans,” 9 p.m. (CBS): When an Australian Royal Navy Lieutenant is murdered in New Orleans, Special Agent Naomi Parsons (Kate Beahan) is sent to work with Special Agent Pride.\n“iZombie,” 9 p.m. (The CW): Liv eats the brains of a trophy wife who was pushed to her death from her home’s balcony by a hired hit man; Liv and Ravi discover Peyton is back in Seattle.\n“Chicago Fire,” 10 p.m. (NBC): Chief Boden’s job is on the line in the wake of a complicated call to a fire; Severide struggles to adjust to his smaller role and the presence of his new commanding officer; Casey works on finding evidence in his investigation against Nesbitt.\n“Public Morals,” 10 p.m. (TNT): The streets of Hell’s Kitchen run red with the blood of the Irish mafia; Muldoon treats Christine to a night on the town; Duffy gets surprising news from Deirdre; Bullman’s feelings for Fortune intensify.\nThe New York Times", "external_links": ["http://www.twitter.com/dougknoop"], "published": "2015-10-20T15:00:00.000+03:00", "crawled": "2015-10-20T17:57:02.664+03:00", "highlightTitle": ""}