{"organizations": [], "uuid": "8d2b0c2e9f509590d4d1dc07778f39ad85ea49a0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mb.com.ph", "main_image": "http://www.mb.com.ph/wp-content/themes/city-desk/images/fb-image_200x200.jpg", "site_section": "http://www.mb.com.ph/category/entertainment/", "section_title": "mb.com.ph | Philippine News | Archive | Entertainment", "url": "http://www.mb.com.ph/a-night-of-freddie-and-queen-music/", "country": "CA", "title": "A night of Freddie and Queen music", "performance_score": 0, "site": "mb.com.ph", "participants_count": 1, "title_full": "A night of Freddie and Queen music | mb.com.ph | Philippine News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "8d2b0c2e9f509590d4d1dc07778f39ad85ea49a0"}, "author": "Jon Montesa", "url": "http://www.mb.com.ph/a-night-of-freddie-and-queen-music/", "ord_in_thread": 0, "title": "A night of Freddie and Queen music", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "by Jon Montesa\nOctober 12, 2015 Gary Mullen\nWhen music legend Freddie Mercury died in 1991 at 45 years old, many were saddened thinking they wouldn’t see or hear someone as good as him perform the music of Queen live again.\nThen came Gary Mullen.\n“Bohemian Rhapsody,” “We Will Rock You,” “We Are The Champions,” “Another One Bites The Dust,” name it, Gary can do it.\nHe looks the part too. Indeed, watching Gary perform (he has videos on YouTube) is like seeing Freddie come back to life.\nHe started his career in 2000 when his mother and his wife urged him to join the Granada TV show “Stars In Their Eyes.”\nGary decided he would do best to imitate Freddie, his childhood idol.\nAlthough, very much a newbie, Gary did good, winning the heart’s of the show’s viewers, earning a record-breaking 864,838 votes of approval – more than double that of the runner-up’s score.\nMuch as it was a surprise to many, not to Gary.\n“I’ve always been a Queen fan…\nI always love singing their songs. Even as a kid, I already thought of myself as a rock star, trying to move like Freddie, sing like Freddie,” he shared in a Skype interview.\nHe considers his new-found career a “great job,” something he can do for as long as he can stand.\nAsked how he got his voice sounding like Freddie’s he said, “Actually, I don’t hear, I just hear my own voice. I don’t try to sound like Freddie, it’s my actual voice.”\nTo complete his act, Gary now works with a band dubbed The Works, and counts as members Billy Moffat on bass, Malcolm Gentles, on keyboards and Davie Brockett on guitar.\nTogether, they have been traveling the world for “One Night Of Queen,” a tribute show dedicated to everything that is Queen.\nAnd they’re quite the success already, performing some 150 shows a year – a matter that delights Gary no end. “I’ve always wanted to go around and see the world and this job gives me the chance to do that,” he said.\n“It’s great that I’ve been around the world introducing music to a whole new generation of fan because the music is timeless, it’s ageless you know,” he added.\nThis October, Gary and The Works will be rocking Manila.\nHe shared how he learned from a Pinoy friend how their act might be a big hit here, considering the many Queen fans around these parts.\n“You seem to really embrace the music…and I’m actually looking forward to see that and experience it myself,” Gary said.\nSome of the songs they will be performing are “Somebody To Love,” which is Gary’s all-time favorite; “I Want To Break Free,” which he says, is the one Queen song that fires up audiences wherever they go; and “Bohemian Rhapsody,” which Gary considers the most challenging Queen song ever.\nGary guaranteed Pinoys a good time. “It’s a big party and they can sing-along as much as they want to,” he said.\n“One Night Of Queen” will be held Oct. 24 and 25 at The Theatre of Solaire Resorts & Casino.", "external_links": ["http://i.po.st/static/v3/post-widget.js#publisherKey=4qcr4d26tnrf260rqrda&retina=true"], "published": "2015-10-12T03:00:00.000+03:00", "crawled": "2015-10-12T09:55:04.111+03:00", "highlightTitle": ""}