{"organizations": [], "uuid": "5ab269e73444a9aac74518bfbfa26261428ee4b1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "http://www.bostonherald.com/sites/default/files/media/2014/04/14/101415goosebumps001.jpg", "site_section": "http://bostonherald.com/entertainment", "section_title": "Entertainment | Boston Herald", "url": "http://bostonherald.com/entertainment/movies/movie_reviews/2015/10/black_film_won_t_give_you_goosebumps", "country": "US", "title": "Black film won’t give you ‘Goosebumps’", "performance_score": 0, "site": "bostonherald.com", "participants_count": 1, "title_full": "Black film won’t give you ‘Goosebumps’ | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "5ab269e73444a9aac74518bfbfa26261428ee4b1"}, "author": "James Verniere", "url": "http://bostonherald.com/entertainment/movies/movie_reviews/2015/10/black_film_won_t_give_you_goosebumps", "ord_in_thread": 0, "title": "Black film won’t give you ‘Goosebumps’", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "More than 300 million “Goosebumps” books, knocked off at amazing speed by author R.L. Stine between 1995 and 2000, have been sold, and yet I have never heard of them. Well, my luck ran out when I sat through the 3-D live-action plus computer-animated “Goosebumps,” the latest film from Sony Pictures, the studio that cannot figure out how to make a good “Spider-Man” movie.\n“Goosebumps” features love-him-or-hate-him Jack Black as Stine (how very meta), a scary, clean-shaven, bookish fellow (we know this by the phony, snooty librarian accent he adopts) in black-framed eyeglasses, who lives with his tween daughter Hannah (Odeya Rush, yet another Mila Kunis look-alike), on whom the new boy-next-door Zach (Dylan Minnette) has an instant crush.\nWhen Zach and his buddy Champ (Ryan Lee) inadvertently release one of the many monsters and supernatural creatures (evil lawn gnomes?) from one of Stine’s magic manuscripts, all heck breaks loose, and before you can say, “Lions and tigers and bears, oh my,” a werewolf, abominable snowman, giant mantises and an angry clown named Slappy (voiced by Black) terrorize the town, and Zach, Champ and Hannah must figure out how to get the figurative genies back into their metaphorical bottles.\nStine’s work is clever if also utterly derivative of every genre B-movie ever made. The film features cartoonish CG work. It criminally wastes the talent of Amy Ryan as Zach’s mother and is extremely reminiscent of the far superior 2010 stop-motion wonder “ParaNorman.” Director Rob Letterman (“Monsters vs. Aliens”) and Black reunite here after their work together on the utterly un­inspired modern-day version of Jonathan Swift’s classic “Gulliver’s Travels” (2010). Tim Burton once planned to make “Goosebumps” (sigh). His regular composer Danny Elfman did the music for the film.\n(“Goosebumps” contains scary monsters and rude humo r.)", "external_links": [], "published": "2015-10-16T03:00:00.000+03:00", "crawled": "2015-10-16T08:57:13.311+03:00", "highlightTitle": ""}