{"organizations": [], "uuid": "54b8bbb12c41b969e016ffaceb97e05b9527b3d8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://images.canberratimes.com.au/2015/10/22/6949748/Thumbnail100177097412hkdpimage.related.thumbnail.320x214.gkfffi.png1445473777840.jpg.jpg", "site_section": "http://feeds.canberratimes.com.au/rssheadlines/entertainment.xml#", "section_title": "Canberra Times Entertainment Headlines", "url": "http://www.canberratimes.com.au/entertainment/tv-and-radio/mythbusters-best-explosions-over-the-years-20151022-gkfffi.html", "country": "AU", "title": "MythBusters' best explosions over the years", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "MythBusters' best explosions over the years", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:56:00.000+03:00", "replies_count": 0, "uuid": "54b8bbb12c41b969e016ffaceb97e05b9527b3d8"}, "author": "Nick Galvin", "url": "http://www.canberratimes.com.au/entertainment/tv-and-radio/mythbusters-best-explosions-over-the-years-20151022-gkfffi.html", "ord_in_thread": 0, "title": "MythBusters' best explosions over the years", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play video Return to video Video settings Please Log in to update your video settings\nVideo will begin in 5 seconds.\nDon't play Play now More video Recommended Replay video Return to video Video settings Please Log in to update your video settings\nMythbusters final season announced Take a look back at some of the biggest explosions from the reality science show’s past thirteen seasons. \nPT1M8S http://www.canberratimes.com.au/action/externalEmbeddedPlayer?id=d-44y4k 620 349 October 22, 2015 - 10:33AM Autoplay On Off Video feedback Video settings After 13 explosive years, it's been announced that MythBusters ' next season – it's 14th – will be its last.\nThe popular science show fronted by Adam Savage and Jamie Hyneman has staged some 3,000 experiments in that time, investigating myths as diverse as whether you can fold a piece of paper more than seven times and if it's possible to ride a motorbike on water.\nBut it's the ever more outlandish explosions for which MythBusters is best known.\nHaving a blast ... MythBusters Adam Savage and Jamie Hyneman. \nThe sight of Savage chortling with glee as the team creates yet another massive detonation, while Hyneman, the purist, looks on with a little more calm detachment, has become the trademark of the show.\nAdvertisement There have been some 700 explosions over the course of the program's 248 episodes but not all blasts are created equal.\nHere, them are five of the biggest and best explosions we've seen.\nSparkling theory \nTo test the theory that a big explosion could be used to compress graphite into diamonds, the team set off more than 2 tonnes of industrial explosives in New Mexico. The resulting blast in the 2009 series was the biggest ever on the show. And, yes, the experiment did create diamonds, but only of a low, industrial grade.\nDummy run \nThe genesis of this myth is a story from World War 2 in which an airman apparently survived a 7000m fall after his landing was \"cushioned\" by the shockwave from an explosion below him. Employing 220kg of dynamite and a falling dummy, the myth was busted in a very loud and spectacular fashion.\nHard evidence \nHere the dynamic duo investigate the question so many of us have pondered over the years – is it possible to clean the inside of a cement truck with dynamite? Having figured out that it sorta works they then decide to pack the truck with 400kg of explosive and see what happens. The answer, unsurprisingly, is \"no more truck\".\nCannon lore \nCoffee drinkers of the world beware. Not only do those little sachets of powdered \"cream\" taste disgusting, they can also pack quite a punch under the right conditions. Those conditions included taking a serious quantity of the stuff packing it into a cannon and setting fire to it with a flare.\nPlaying with matches \nSo, you know how striking a match is, essentially, creating a small explosion? Guess what would happen if you took a million match heads and set fire to them? Yup – it makes a big explosion. A really big explosion.", "external_links": [], "published": "2015-10-22T03:56:00.000+03:00", "crawled": "2015-10-22T08:32:54.924+03:00", "highlightTitle": ""}