{"organizations": ["ABC NEWS", "Facebook Email Twitter Google"], "uuid": "47583540246fb893c2204be173551100ddacc22e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.whas11.com", "main_image": "http://cdn.tegna-tv.com/-mm-/0ab14dcd2b62b3d5a34db8f46b678fea5f7fd9bd/c=0-92-992-652&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/20/WHAS/WHAS/635809364960157378-HT-star-wars1-rey-s-into-Lucas-film.jpg", "site_section": "http://rssfeeds.whas11.com/_/20/109785166/whas/entertainment", "section_title": "WHAS11 - Entertainment", "url": "http://www.whas11.com/story/entertainment/2015/10/20/star-wars-5-highlights-new-force-awakens-trailer/74265024/", "country": "US", "title": "'Star Wars': 5 highlights from the new 'Force Awakens' trailer", "performance_score": 0, "site": "whas11.com", "participants_count": 0, "title_full": "'Star Wars': 5 highlights from the new 'Force Awakens' trailer", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T21:11:00.000+03:00", "replies_count": 0, "uuid": "47583540246fb893c2204be173551100ddacc22e"}, "author": "", "url": "http://www.whas11.com/story/entertainment/2015/10/20/star-wars-5-highlights-new-force-awakens-trailer/74265024/", "ord_in_thread": 0, "title": "'Star Wars': 5 highlights from the new 'Force Awakens' trailer", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Facebook Email Twitter Google+ LinkedIn Pinterest 'Star Wars': 5 highlights from the new 'Force Awakens' trailer A new \"Star Wars\" trailer has hit the small screen and it's certain to cause an awakening among fans. Post to Facebook 'Star Wars': 5 highlights from the new 'Force Awakens' trailer A new \"Star Wars\" trailer has hit the small screen and it's certain to cause an awakening among fans.  //on.whas11.com/1LINxJK   'Star Wars': 5 highlights from the new 'Force Awakens' trailer ABC NEWS, @ABC 2:11 p.m. EDT October 20, 2015 A scene from the new trailer \"Star Wars: The Force Awakens.\" (ABC NEWS) (Photo: Lucas Film) CONNECT TWEET   \n( ABC NEWS ) -- A new \"Star Wars\" trailer has hit the small screen and it's certain to cause an awakening among fans. \nThe trailer debuted on ESPN during halftime of the Giants-Eagles Monday night game and there's a lot to take in. Let's break it down. \nSEE TRAILER HERE: <!--iframe--> \n1 - Rey's Intro \nThe new snippet opens with a lone piano note sounding, as Daisy Ridley's Rey, a scavenger, is shown exploring the wreckage of what appears to be a downed starship. \n\"Who are you?\" a female voice, likely Gwendoline Christie's Captain Phasma, asks off-camera. \n\"I'm no one,\" the young woman answers in voiceover, as she's shown walking through the sands of planet Jakku, rolling droid BB-8 faithfully by her side. \n2 - Finn's Awakening \n\"I was raised to do one thing,\" John Boyega's Finn is heard saying, as he pulls off his Stormtrooper helmet. \"But I've got nothing to fight for,\" a phrase lending credence to the theory he was one of the New Order's troops, who realizes he's been on the wrong side. \nThe next shot shows his TIE fighter shot to pieces and careening to presumably the same planet. \nFinn (Photo: Lucas Film) \n3 - Kylo Ren a Darth Fan \n\"Nothing will stand in our way,\" Adam Driver's helmeted Kylo Ren vows to the heat-melted helmet of Darth Vader. \"I will finish what you started.\" \nHis character is said to be a member of a group of the Knights of Ren, who were said to emulate the Sith. He's shown apparently using a Force grip of some kind to apparently torture Oscar Isaac's resistance pilot, Poe Dameron. \nKylo Renn (Photo: Lucas Film) \n4 - Han the Mentor \n\"There are stories about what happened,\" Ridley says to Harrison Ford's Han Solo, off-camera, as his Millennium Falcon dogfights with TIE fighters amid starship ruins on Jakku. \n\"It's true,\" he responded. \"All of it. The Dark Side. The Jedi. They're real.\" \nAs his voiceover continues, teases of huge land and aerial battles rage on various planets. \nDameron and Finn share a quick back-slap as they scramble to Resistance X-Wings. Carrie Fisher's Princess Leia tenderly hugs Solo. And, finally, Finn ignites Luke Skywalker's blue lightsaber and faces off against the jagged crimson blade of Kylo Ren's. \n5 - The Chilling End \n\"The Force. It's calling to you,\" the same female voice heard earlier urges. \"Just let it in.\" \nBefore the new trailer Monday, an all-new poster was offered over the weekend with new characters like Kylo Ren, Rey, BB-8; stormtroopers; Han Solo, Princess Leia, Chewbacca, C-3PO and the Millennium Falcon. \n\"The dark side and the light together on the new official poster. Tune in to ESPN’s Monday Night Football tomorrow for an exclusive new look at STAR WARS: THE FORCE AWAKENS. #TheForceAwakens,\" the caption read on the official \"Star Wars\" Facebook page. \n\"Star Wars: The Force Awakens,\" which is produced by a division of ABC’s parent company, Disney, is scheduled open everywhere Dec. 18. <!--iframe--> \nCoinciding with tonight's trailer, \"tickets for the highly anticipated film will also go on sale [Monday] for showings in theaters across the globe,\" according to StarWars.com. \nThere's also a list of theaters hosting a special marathon event leading up to \"Episode 7.\" \nThe full list is on StarWars.com .", "external_links": [], "published": "2015-10-20T21:11:00.000+03:00", "crawled": "2015-10-20T21:45:01.628+03:00", "highlightTitle": ""}