{"organizations": [], "uuid": "77fc732372a7b4bf2ed5177d66af852c5ce3207c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.india.com", "main_image": "http://s3.india.com/wp-content/uploads/2015/10/Tittygram.jpg", "site_section": "http://www.india.com/feed/", "section_title": "India | Latest India News | Get Free India.com Email | Live Cricket and Entertainment News at India.Com", "url": "http://www.india.com/stream/tittygram-is-the-new-instagram-for-messages-on-boobs-627409/", "country": "US", "title": "Tittygram is the new Instagram for messages on boobs", "performance_score": 0, "site": "india.com", "participants_count": 1, "title_full": "Tittygram is the new Instagram for messages on boobs", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T15:33:00.000+03:00", "replies_count": 0, "uuid": "77fc732372a7b4bf2ed5177d66af852c5ce3207c"}, "author": "Rishabh Chakravorty", "url": "http://www.india.com/stream/tittygram-is-the-new-instagram-for-messages-on-boobs-627409/", "ord_in_thread": 0, "title": "Tittygram is the new Instagram for messages on boobs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tittygram is the new Instagram for messages on boobs By Rishabh Chakravorty on October 13, 2015 at 6:03 PM Comments \nYes, you read the headline right and what you are imagining is probably right too. It is not exactly NSFW and the service isn’t free but for that special occasion with your guy friends or if you are fortunate enough to have a cool girlfriend/wife then share your message on boobs. Tittygram is meant to please everybody so don’t worry ladies, you can get your messages written on a man’s chest as well. You can always mix and match and choose a male chest or female boobs to show your message like on Instagram . \nHow Tittygram works is that you send your message to the good people who run Tittygram, you pay for the message and within an hour the male/female chest of a professional model will showcase your message. That’s the shortest way to explain how Tittygram works. You think of a message or motto, send it along with your email address, pay for the service, wait for about an hour while the male/female model according to your preference writes the message and send you the selfie. You are then free to share the Tittygram with the world. \nIt is a crazy way to make a living. The customer comments section at the bottom of their website speaks highly of the satisfaction of gifting or receiving a Tittygram. Words touching breasts do sound good and if you think that boobs solve every problem then you can understand the Tittygram philosophy and will happily use the service for the benefit of others and even for yourself by clicking here . \nModified Date: October 13, 2015 6:08 PM Topics:", "external_links": [], "published": "2015-10-13T15:33:00.000+03:00", "crawled": "2015-10-13T16:19:49.035+03:00", "highlightTitle": ""}