{"organizations": [], "uuid": "70add84dfa0b4790396de88b2e43c8d0e323736a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "http://s3.reutersmedia.net/resources/r/?m=02&d=20151009&t=2&i=1085821766&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXNPEB98117", "site_section": "http://www.reuters.com/news/entertainment", "section_title": "Entertainment Industry &amp; Celebrity News | Reuters.com", "url": "http://www.reuters.com/article/2015/10/09/us-film-stevejobs-idUSKCN0S327W20151009", "country": "US", "title": "'Steve Jobs' takes big screen deep-dive into the man behind Apple", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "'Steve Jobs' takes big screen deep-dive into the man behind Apple | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T22:09:00.000+03:00", "replies_count": 0, "uuid": "70add84dfa0b4790396de88b2e43c8d0e323736a"}, "author": "Piya Sinha-Roy", "url": "http://www.reuters.com/article/2015/10/09/us-film-stevejobs-idUSKCN0S327W20151009", "ord_in_thread": 0, "title": "'Steve Jobs' takes big screen deep-dive into the man behind Apple", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES \"It's like, five minutes before a launch, everyone goes to a bar and gets drunk and tells me what they really think,\" Apple co-founder Steve Jobs, played by Michael Fassbender, says with exasperation in a new biographical film.\nThe phrase sets the tone for Oscar-winning screenwriter Aaron Sorkin's \"Steve Jobs,\" a dialogue-heavy reimagining of one of technology's most revered figures in the moments leading up to three product launches: 1984's Macintosh, 1988's NeXT cube and 1998's iMac.\nThe film, directed by Oscar winner Danny Boyle and opening in New York and Los Angeles on Friday and across the U.S. next week, explores Jobs through four of his key relationships - with Apple's marketing head Joanna Hoffman (Kate Winslet), fellow Apple co-founder Steve Wozniak (Seth Rogen), Apple CEO John Sculley (Jeff Daniels) and Jobs' eldest daughter, Lisa.\nSeen across the years, the behind-the-scenes moments aim to shed light on Jobs the man, whether it's his warm relationship with \"work wife\" Hoffman, being a protective older brother-type to Wozniak or seeking a pat on the back from father-figure Sculley.\nComing four years after Jobs died at age 56 from cancer, the film is the third film on him, following 2013's \"Jobs\" starring Ashton Kutcher and this year's Alex Gibney's documentary \"Steve Jobs: The Man in the Machine.\"\nIt looks at the much-revered technology entrepreneur from yet another angle. Sorkin adapted his screenplay in part from Pulitzer-winning Walter Isaacson's book: \"Steve Jobs.\"\nIntroducing Boyle at a Los Angeles screening on Thursday, Sorkin enthused \"you're never going to meet someone with this talent that has no business being this nice - one of themes we explore.\"\nUnlike Boyle, the film portrays Jobs as contentious, arrogant, stubborn, isolated, troubled, charismatic, witty and often misunderstood.\nIn heated, passionate and spirited conversations, Jobs is seen struggling to find a balance between his talents and being a nice guy. He makes diva-like demands on long-suffering colleagues for his product launches. He has no qualms about delivering pointed threats or even rejecting his five-year-old daughter as she stands in front of him.\nThe film's structure mirrors Jobs' frenetic energy as it jumps between the three product launches without actually showing their debuts, leaping from one fast-paced conversation to another.\n\"Steve Jobs\" has been well received by critics, with The New York Times calling it \"a rich and potent document of the times.\"\n(Reporting by Piya Sinha-Roy. Editing by Chris Michaud and David Gregorio )", "external_links": [], "published": "2015-10-09T22:09:00.000+03:00", "crawled": "2015-10-09T22:07:49.511+03:00", "highlightTitle": ""}