{"organizations": [], "uuid": "280c54c22ae17dd9ed4fb49c8d88c53471c69b0d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48524/entertainment", "section_title": "Entertainment - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30209994/newsy-expands-internet-tv-distribution-through-new-partnership-with-pluto-tv", "country": "US", "title": "Newsy expands Internet TV distribution through new partnership with Pluto TV", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Newsy expands Internet TV distribution through new partnership with Pluto TV - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T03:00:00.000+03:00", "replies_count": 0, "uuid": "280c54c22ae17dd9ed4fb49c8d88c53471c69b0d"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30209994/newsy-expands-internet-tv-distribution-through-new-partnership-with-pluto-tv", "ord_in_thread": 0, "title": "Newsy expands Internet TV distribution through new partnership with Pluto TV", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Information contained on this page is provided by an independent third-party content provider. WorldNow and this Station make no warranties or representations in connection therewith. If you have any questions or comments about this page please contact pressreleases@worldnow.com .\nSOURCE The E.W. Scripps Company\nCINCINNATI , Oct. 7, 2015 /PRNewswire/ -- Newsy, the over-the-top video news service that brings context and perspective to a growing millennial audience, has partnered with Pluto TV to provide 24/7 coverage of the latest world and national news including politics, entertainment, science and technology. Viewers who tune to the Newsy channel on Pluto TV will enjoy a continually updated feed of the day's top stories as well as hourly updates from the newsroom. Newsy is a wholly owned subsidiary of The E.W. Scripps Company (NYSE: SSP).\n\"Our viewers immediately connected with Newsy's unique take on the day's top news,\" said Tom Ryan , co-founder and CEO of Pluto TV. \"When we were seeking partners to bring exciting and interesting programming to Pluto TV, especially in the critical news category, Newsy was a clear fit for our engaged, tech-savvy audience.\"\nPluto TV, a free Internet TV service, announced the partnership with Newsy at the MIPCOM conference in Cannes, France . It is one of 25 content partners, along with CNET, Reuters and Associated Press TV.\n\"Newsy will continue to strike partnerships with forward-thinking digital video providers such as Pluto TV as we continue to expand our OTT footprint,\" said Blake Sabatinelli , general manager of Newsy. \"By scaling up our distribution, we are able to better live out our mission of informing and empowering our viewers by delivering 'news with the why.'\"\nNewsy is available on Channel 210 on Pluto TV, which is accessible through its website at Pluto.tv and through over-the-top devices, connected TVs and its mobile app for iOS, Android and Amazon.\nThe partnership comes on the heels of Newsy's announcement last week that it is one of the launch partners for Comcast's new Watchable platform. Through that deal, Newsy is available on-demand through the Watchable platform, which consumers can access on mobile, Web and TV via Comcast's cloud-based cable TV operating system, X1.\nAbout Newsy\nNewsy is a millennial-focused digital video news service that provides \"news with the why,\" built to inform and engage by delivering today's top stories across platforms. Its content is available in on-demand and linear formats on over­the­top (OTT) services including Watchable from Comcast, Roku, Amazon Fire TV and Google Chromecast; connected television; on mobile for iOS, Android, Kindle Fire and Windows devices; and at newsy.com.\nAbout Pluto TV\nPluto TV is a start-up company redefining TV entertainment in today's digital world in order to entertain the planet. Pluto TV is creating a new, yet familiar, lean back TV experience by curating together digital and traditional content into 100+ channels great entertainment free of the clutter facing viewers with other TV experiences. Viewers can find Pluto TV on connected devices (Amazon's Fire TV and Fire TV Stick, Android TV Devices, Chromecast and Apple AirPlay,) connected TVs (Samsung Smart TVs,) web and mobile devices apps (iOS, Android and Amazon).\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/newsy-expands-internet-tv-distribution-through-new-partnership-with-pluto-tv-300156075.html\n©2015 PR Newswire. All Rights Reserved.", "external_links": ["http://www.newsy.com/", "http://www.xmlnews.org/ns/", "http://www.prnewswire.com/news-releases/newsy-expands-internet-tv-distribution-through-new-partnership-with-pluto-tv-300156075.html", "http://pluto.tv/", "http://scripps.com/press-releases/907", "http://rt.prnewswire.com/rt.gif?NewsItemId=CL22807&Transmission_Id=201510071557PR_NEWS_USPR_____CL22807&DateId=20151007"], "published": "2015-10-07T03:00:00.000+03:00", "crawled": "2015-10-08T01:11:33.497+03:00", "highlightTitle": ""}