{"organizations": [], "uuid": "e4994f0635725611a5cdc9269d19ae598c3d86c3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ign.com", "main_image": "http://assets2.ignimgs.com/2014/11/06/me-3jpg-eb5eb9_1280w.jpg", "site_section": "http://feeds.ign.com/IGNPS4All", "section_title": "IGN Entertainment Articles", "url": "http://www.ign.com/articles/2015/10/16/ea-has-no-interest-or-time-for-hd-remakes", "country": "US", "title": "EA Has No Interest or Time for HD Remakes", "performance_score": 1, "site": "ign.com", "participants_count": 1, "title_full": "EA Has No Interest or Time for HD Remakes", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T18:00:00.000+03:00", "replies_count": 0, "uuid": "e4994f0635725611a5cdc9269d19ae598c3d86c3"}, "author": "Mitch Dyer", "url": "http://www.ign.com/articles/2015/10/16/ea-has-no-interest-or-time-for-hd-remakes", "ord_in_thread": 0, "title": "EA Has No Interest or Time for HD Remakes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "EA Has No Interest or Time for HD Remakes Share. By Mitch Dyer \nElectronic Arts has little interest in re-releasing its old games, so don’t expect that Mass Effect Trilogy remake to release any time soon. When publishers release old games on new platforms, EA COO Peter Moore told IGN, “It feels like pushing stuff out because you’ve run out of ideas.” \nMoore explained why EA isn’t into this approach to releasing games. “Remakes, because of who we are, and this broad portfolio of intellectual property...you add all that together, I don’t know where we find the time to do remakes,” Moore said. “We’re a company that just likes to push forward.” \nOf course, Moore admitted, remakes are extremely convenient. “For a lot of companies, remakes are a way to drive revenue. It’s sub-cost, it’s an IP that’s there, you can remaster, and that’s great. We don’t do that here. I don’t think that’s ever been in our culture.” \nEA’s COO also shared his thoughts on backward compatibility. “In the old days, backward compatibility was to convince your mom to buy the new console -- not that you were ever going to use it,” Moore said. “Once you got it? Those things went in the drawer, or on eBay.” \nOf course, EA’s games will be accessible via Xbox One backward compatibility later this year -- which saves the company having to do what it doesn’t want to. \nMitch Dyer is an Editor at IGN. Talk to him about Dota 2, movies, books, and other stuff on Twitter at @MitchyD and subscribe to MitchyD on Twitch . IN THIS ARTICLE", "external_links": [], "published": "2015-10-16T18:00:00.000+03:00", "crawled": "2015-10-16T18:42:32.955+03:00", "highlightTitle": ""}