{"organizations": [], "uuid": "55bf7641dfd3657badc1730d272bd67098fecbe1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.jsonline.com", "main_image": "http://media.jrn.com/images/b99589289z.1_20151009132544_000_gmgcrv7c.1-0.jpg", "site_section": "http://www.jsonline.com/rss?c=y&path=%2Fentertainment%2Fnewswatch", "section_title": "JSOnline.com Entertainment NewsWatch", "url": "http://www.jsonline.com/entertainment/books/authors-melodramatic-approach-doesnt-do-thurgood-marshall-justice-b99589289z1-331717551.html", "country": "US", "title": "Book Review - Author's melodramatic approach doesn't do Thurgood Marshall justice", "performance_score": 0, "site": "jsonline.com", "participants_count": 1, "title_full": "Book Review - Author's melodramatic approach doesn't do Thurgood Marshall justice", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T14:28:00.000+03:00", "replies_count": 0, "uuid": "55bf7641dfd3657badc1730d272bd67098fecbe1"}, "author": "Mike Fischer", "url": "http://www.jsonline.com/entertainment/books/authors-melodramatic-approach-doesnt-do-thurgood-marshall-justice-b99589289z1-331717551.html", "ord_in_thread": 0, "title": "Book Review - Author's melodramatic approach doesn't do Thurgood Marshall justice", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "In early 1973, former President Lyndon Johnson called U.S. Supreme Court Justice Thurgood Marshall, who had become the first African-American justice two months after Johnson nominated him for the job in 1967.\n\"I'm going to write about it,\" Johnson said, referring to Marshall's historic nomination and the bruising Senate confirmation hearings that ensued. \"I'll help you, best I can do,\" Marshall replied.\nLess than three weeks later, Johnson was dead. But Wil Haygood has now used those 1967 confirmation hearings as his foundation for \"Showdown: Thurgood Marshall and the Supreme Court Nomination that Changed America.\"\nHaygood's title doesn't quite capture the truth of what his book rightly suggests: Symbolically important as his nomination was, Marshall's most significant contributions to the changed America making it possible had come earlier, during his days as the acclaimed lawyer who won 29 of 32 cases before the Supreme Court. \"Thurgood Marshall,\" Haygood writes, \"was Atticus Finch before Atticus Finch.\"\nThose victories include the landmark Brown vs. Board of Education, the school desegregation case for which Marshall is best known. But as Haygood points out, Marshall's big wins on voting rights helped pave the way for the Voting Rights Act — in part by providing legal support for black voting rights organizers in the 1950s and 1960s.\nHaygood presents these and other stories from Marshall's pre-1967 biography through a series of flashbacks, interwoven with a chronicle of the Senate confirmation hearings and ensuing Senate vote.\nFurther sidebars adjoining this central narrative — during which Haygood relies almost exclusively on the confirmation hearing transcript — focus on the backstories of the four Southern senators from the Senate Judiciary Committee who worked hardest to derail Marshall's nomination.\nThey included Strom Thurmond, the racist who ran for president as a Dixiecrat and who was subsequently revealed to be the father of an African-American child; Judiciary Committee chairman James Eastland, whose father lynched a man and who a dying Marshall called \"the meanest SOB that ever walked the earth\"; and Sam Ervin, whose lovably irascible performance during the Watergate hearings can't ever erase his long-standing commitment to segregation.\nHaygood strategically juxtaposes these sketches with chapters in which Marshall narrowly escapes being lynched; the house of an NAACP organizer with whom he'd stayed gets bombed; and numerous black men are framed and jailed. In this context, one fully understands the temptation to cast Marshall's story as a morality play pitting good vs. evil. Haygood's epilogue even briefly entertains the notion that Marshall was a saint.\nHe wasn't.\nHaygood downplays and then nearly apologizes for Marshall's womanizing. He overlooks the seamier side of Marshall's overly close relationship with J. Edgar Hoover, which included defending the FBI against criticisms from fearless black organizers like T.R.M Howard, who spoke out repeatedly against Emmett Till's murder and mentored Medgar Evers.\nMarshall also criticized the students trying to integrate the Woolworth's lunch counter in Greensboro, N.C., as \"a bunch of crazy colored students\" who didn't respect property rights. And he lashed out at critics of the Vietnam War.\nBefitting a hagiography, Haygood repeatedly resorts to purple prose (Marshall is \"born unto a scarred and bruised land\"; later Marshall is described as having \"entered the dreams of the oppressed\"). He resorts to cliché (senators are \"steely-eyed\"; \"crickets sang in the night air\").\nThere are numerous solecisms (1960s protest singers \"assail the years of antigovernment disenchantment\") and some embarrassing mistakes (FDR was not President when World War II ended). Endnotes are sparse, don't always support Haygood's text and reflect little use of primary source material.\nMarshall deserves better. He's no less a hero because he's also flawed; I'd argue his profile in courage would mean still more if offset by a candid account of his failures, presented in clearer prose as part of a better organized story. Haygood's book makes me wish all the more that Johnson had lived long enough to write his.\n ", "external_links": ["http://analytics.apnewsregistry.com/analytics/v2/image.svc/Special-to-the-Journal-Sentinel/RWS/jsonline.com/MAI/331717551/E/prod/PC/Basic/AT/A"], "published": "2015-10-09T14:28:00.000+03:00", "crawled": "2015-10-12T11:38:49.128+03:00", "highlightTitle": ""}