{"organizations": [], "uuid": "c8f6341091bb0ea7bb37a2dd10dc1bba7ffd5949", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbsnews.com", "main_image": "http://cbsnews2.cbsistatic.com/hub/i/r/2015/10/12/dddefd94-863a-4b2a-9842-f5bd4b8a9fd6/thumbnail/620x350/a5e3b2fa9ea7562f5ae94446bb69f0af/gettyimages-185862379.jpg", "site_section": "http://www.cbsnews.com/", "section_title": "CBS News - Breaking News, U.S., World, Business, Entertainment &amp; Video ", "url": "http://www.cbsnews.com/news/the-trouble-at-twitter-more-than-job-cuts/", "country": "US", "title": "The trouble at Twitter: More than job cuts", "performance_score": 0, "site": "cbsnews.com", "participants_count": 5, "title_full": "The trouble at Twitter: More than job cuts - CBS News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T20:08:00.000+03:00", "replies_count": 4, "uuid": "b7cbae0ca8659300df11573ee633642ae76c57a1"}, "author": "Aimee Picchi MoneyWatch", "url": "http://www.cbsnews.com/news/the-trouble-at-twitter-more-than-job-cuts/#post-0", "ord_in_thread": 0, "title": "The trouble at Twitter: More than job cuts", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A little bird is fighting some mighty headwinds.\nJust a few days after being named permanent CEO at Twitter ( TWTR ), Jack Dorsey is reportedly planning several cost-cutting maneuvers , including layoffs and nixing a plan to expand the social-media company's San Francisco headquarters. The layoffs could be announced as soon as Tuesday, according to The New York Times. Twitter told CBS MoneyWatch that it was \"not commenting on rumor and speculation.\"\nWhile cost-cutting measures are usually cheered by profit-minded investors, the reports have spooked shareholders, who sent shares trading sharply lower on Monday morning. The reports of belt-tightening are coming just two weeks before the company reports third-quarter results, raising concerns that the tech company may be adjusting its expenses to cope with slowing revenue growth.\nOn the other hand, Twitter has roughly doubled its staff since mid-2013 , according to tech blog Re/Code. During the same period, its user base has only increased by 50 percent, which suggests there may be some bloat in the employee base.\nThat appears to be a concern for Dorsey, who has been pushing Twitter to focus on its core business. While Facebook ( FB ) has become an essential part of many users' lives, that's not always the case for Twitter users, given the high percentage of inactive users and accounts that don't have any followers. A significant number of accounts aren't even backed by real people, but are run by \"bots,\" or programs that send out tweets.\n\"There's a huge desire for more efficiency, and there's a huge opportunity to really raise the bar on our execution,\" Dorsey said during a conference call last week. He added that he has been \"making sure that we have more alignment around our purpose, around our road map. And in that, we have a disciplined execution, and that's been my #1 focus, all in service of simplifying the service and at the same time, doing the necessary work to better communicate what Twitter is and why Twitter.\"\nThe problem is that investors aren't as convinced today about why they need to have Twitter in their portfolios. The stock is trading at about $29, only a few bucks above its $26 IPO price, and at one point this summer, the shares had sunk below its initial stock sale price.\nTwitter is facing many challenges, including heavy losses and slowing user growth . Expenses have surged, with the company's total costs and expenses jumping 37 percent to $633.4 million in the second quarter. In the October conference call, Twitter's CFO pointed to higher headcount and investments in infrastructure as a cause.\nThat's great if your business is expanding, but it doesn't work as well when growth isn't picking up as fast as executives and investors had hoped. The layoffs are likely to hit several areas of the company, The Times said. It's also planning to abandon plans to expand into a 100,000-square-foot building, the publication added.\nStill, some analysts believe that Twitter's time to shine might be right around the corner. Last week the company debuted a new service called \"Moments,\" which Dorsey said would address \"ease of use\" and simplify the service. Moments, which can be found as lightning-bolt emblazoned tab on a user's Twitter page, consolidates stories trending on Twitter.\nThe company will have three weeks of data on Moments when it reports third-quarter earnings on Oct. 27, and key will be whether the new service is attracting and engaging new users, wrote Deutsche Bank analysts in a research report earlier this month.\n\"Twitter has had a rough 2015, full stop. The investment community has more or less given up on the story, except for a few loyal enthusiasts,\" they noted. Still, they added, \"we think the sentiment pendulum for Twitter has swung too far to the negative.\"\nWhether that proves true may depend on what a little bird says about its growth prospects when it reports third-quarter results on Oct. 27.", "external_links": ["http://www.nytimes.com/2015/10/10/technology/twitter-expected-to-begin-layoffs-and-stop-headquarters-expansion.html?_r=0", "http://www.techtimes.com/articles/12840/20140812/twitter-acknowledges-14-percent-users-bots-5-percent-spam-bots.htm", "http://recode.net/2015/10/09/twitter-is-planning-company-wide-layoffs-for-next-week/"], "published": "2015-10-12T20:08:00.000+03:00", "crawled": "2015-10-13T04:16:00.481+03:00", "highlightTitle": ""}