{"organizations": [], "uuid": "cb80752237306739a8911c59a07ff50034337316", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "knox.villagesoup.com", "main_image": "http://knox.villagesoup.com/media/Common/CourierPublications/2015/10/5/1663111/t600-Kindship%20by%20Eric%20Leppanen%20-%20Belfast%20Poetry%20Festival-1.jpg", "site_section": "http://knox.villagesoup.com//rss/story/ae", "section_title": "Knox VillageSoup Arts & Entertainment Headlines", "url": "http://knox.villagesoup.com/p/belfast-poetry-festival-jazz-poet-social-dialogue-panel-and-more/1422542?source=rss", "country": "US", "title": "Belfast Poetry Festival: jazz poet, Social Dialogue panel and more", "performance_score": 0, "site": "villagesoup.com", "participants_count": 1, "title_full": "Belfast Poetry Festival: jazz poet, Social Dialogue panel and more", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T07:58:00.000+03:00", "replies_count": 0, "uuid": "cb80752237306739a8911c59a07ff50034337316"}, "author": "news@courierpublicationsllc.com (Staff)", "url": "http://knox.villagesoup.com/p/belfast-poetry-festival-jazz-poet-social-dialogue-panel-and-more/1422542?source=rss", "ord_in_thread": 0, "title": "Belfast Poetry Festival: jazz poet, Social Dialogue panel and more", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Belfast Poetry Festival: jazz poet, Social Dialogue panel and more Oct 03, 2015 City painter Eric Leppanen is one of the visual artists participating the Belfast Poetry Festival-capping multimedia showcase; pictured is his painting \"Kindship.\" Enlarge... \nBelfast — The annual Belfast Poetry Festival will mark its eleventh year with a full slate of ways to celebrate poetry, community and artistic possibility Friday and Saturday, Oct. 16 and 17, at Belfast Free Library, the Colonial Theatre and throughout downtown with talent hailing from across the state and beyond. \nThe 2015 festival will include a Friday night of unadulterated poetry readings; a late-night open mic; writing and community-building workshops; a panel discussion and public forum on Poetry as a Force for Social Dialogue; a Gallery Hunt featuring the winners of the Maine Postmark Poetry Contest in downtown art galleries; a parade; and a Saturday evening multimedia extravaganza of poetry, visual art and performing arts collaborations featuring 14 poets, seven visual artists and 14 performing artists from across Maine. \nFriday evening will feature a full night of unadulterated poetry readings including guest poet Elizabeth McKim, the Jazz Poet of Lynn, Mass.; winners of the sixth annual Maine Postmark Poetry Contest; and a late night open mic. Readings will begin 7 p.m. at the Belfast Free Library, with open mic to follow. \nSaturday morning will open with a slate of workshops from 10 a.m. to 12:30 p.m. at the library. Workshops are available for writers of all skill levels and include featured guest workshop Sounding the Stone/Finding Your Poem with McKim; All Our Queer Voices with Belfast Poet Laureate Toussaint St. Negritude; Leap after Leap in the Dark with Bangor poet Annaliese Jakimides; and a guest workshop with Lady Zen of Portland. Space is limited and pre-registration is required; send $25 payable to “Belfast Free Library” to Jacob Fricke, Belfast Poetry Festival, P.O. Box 911, Belfast, ME 04915. All 2015 workshop offerings are free to high school and college students; students may email jacob@belfastpoetry.com to indicate their choice and the school they attend. \nSaturday afternoon will feature what is hoped to be a landmark panel discussion, Poetry as a Force for Social Dialogue, a conversation about the possibilities and challenges of using poetry as a force for social dialogue in turbulent times. The 2 to 4 p.m. panel discussion at the library will involve a diverse slate of panelists hosting a robust public conversation that will subsequently be prepared as a documentary handbook for governments and arts organizations for furthering their own work using the arts to engage community. This event is free and open to the public, and open discussion with audience participation is strongly encouraged. \nThroughout the weekend, the 10 winning poems from the sixth annual Maine Postmark Poetry Contest will be on display in downtown Belfast art galleries: \"That Moon Again\" by Jackie Ascrizzi, Montville; \"The Cage\" by Jay Franzel, Wayne; \"Losing Integrity\" by Lenora Goldman Jackson, Rockland; \"Waiver\" by Russell Buker, Alexander; \"Signs\" by Peggy Gannon, Palmyra; \"Six-thirty, Tuesday Morning, Six Below\" by Elizabeth Tibbetts, Hope; \"How To Burn Your Bridges\" by Chuck Marecic, Washington; \"Tenebrae: a prose sonnet\" by DiTa Ondek, Friendship; \"Ogunquit Beach at Dawn, 6/18/15\" by Richard Foerster, Cape Neddick; and \"Before\" by Laurence Coe, Rockland. \nThe festival culminates in a Saturday evening celebratory showcase of poetry, visual art and performing arts collaborations, with a reception at the Colonial Theatre at 4 p.m. and the main presentation from 5 to 8 p.m. featuring music, dance, live readings, projected artwork and more. Poetic styles range from socially urgent and historically documentary to mythic, classical, nature-based and contemporary liturgical to jazz-experimental, bop-driven and slam urban. Art will include upturned historical tropes, historical and documentary photography, nature-inspired mixed media, action abstracts and tattoo. Performing arts will include opera, choir, piano, drum, jazz, experimental, jazz dance, contemporary dance and more. For the full list of participants, visit belfastpoetry.com . \nThe Belfast Poetry Festival, one of the few community-based, non-academic poetry festivals in the country, is in its 11th year of production with support from Off the Coast, the Maine Humanities Council, the City of Belfast, Belfast Free Library, the Belfast Co-op and Front Street Shipyard. All programming except the workshops is free of charge. For more information, email Fricke at jacob@belfastpoetry.com; visit the website; or check out the Belfast Poetry Festival Facebook page . \n 4401, ext. 115;  ", "external_links": [], "published": "2015-10-03T07:58:00.000+03:00", "crawled": "2015-10-05T19:23:39.724+03:00", "highlightTitle": ""}