{"organizations": [], "uuid": "dd50b3c3d6fa33c66ba29fe7db6b269e54589085", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.heraldscotland.com", "main_image": "http://www.heraldscotland.com/resources/images/4311013/", "site_section": "http://www.heraldscotland.com/arts_ents/", "section_title": "Arts and Entertainment | Herald Scotland", "url": "http://www.heraldscotland.com/arts_ents/13839565.Demetrios_Matheou_film_review__Suffragette__12A____A_splendidly_impassioned_and_intelligent_period_film_that_is_unusually_contemporary_/", "country": "GB", "title": "Demetrios Matheou film review: Suffragette (12A): 'A splendidly impassioned and intelligent period film that is unusually contemporary'", "performance_score": 0, "site": "heraldscotland.com", "participants_count": 1, "title_full": "Demetrios Matheou film review: Suffragette (12A): 'A splendidly impassioned and intelligent period film that is unusually contemporary' (From Herald Scotland)", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T07:10:00.000+03:00", "replies_count": 0, "uuid": "dd50b3c3d6fa33c66ba29fe7db6b269e54589085"}, "author": "Demetrios Matheou", "url": "http://www.heraldscotland.com/arts_ents/13839565.Demetrios_Matheou_film_review__Suffragette__12A____A_splendidly_impassioned_and_intelligent_period_film_that_is_unusually_contemporary_/", "ord_in_thread": 0, "title": "Demetrios Matheou film review: Suffragette (12A): 'A splendidly impassioned and intelligent period film that is unusually contemporary'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "THERE is a quietly powerful significance about Suffragette. Not only is the film recreating one of the most important episodes in Britain’s history as a democracy – in a way that will be revelatory for many in the audience – but rarely has a film been so dominated by women, on either side of the camera.\nThe result is a splendidly impassioned and intelligent affair, a head-and-heart combination that results in a period film that is unusually contemporary.\nSay “suffragette” and many people think of dainty ladies in fulsome hats peacefully campaigning for their cause. But this image falls short of the whole story. For in 1903, Emmeline Pankhurst turned the suffragettes towards “deeds not words”, deciding that civil disobedience was needed to turn the tide.\nThere is a great story in the Pankhursts, of Emmeline and her three daughters, who led the movement yet fell out terribly over tactics. But the film’s writer Abi Morgan and director Sarah Gavron have reasonably decided to shift their focus from the suffragette leaders to the ordinary working women who were the “foot soldiers” of the movement and had much more to lose than middle and upper-class suffragettes.\nPromoted stories It’s 1912, the year when the suffragettes are escalating their militancy, destroying shop windows and bombing property. Maud (Carey Mulligan) works in an East London laundry – nay, sweatshop. At work, she must deal with a venal boss who abuses his female workers in more ways than one; at home, she hands her wages to her husband Sonny (Ben Whishaw), each locked by tradition into their unequal relationship.\nThen, on an errand to Oxford Street, Maud encounters a group of women violently pelting shop windows. One of these, Violet (Anne-Marie Duff), also works in the laundry. Maud’s curiosity is piqued, and from here the film charts her burgeoning political engagement, from bystander to peaceful participant to militant, prepared to lose family and freedom to achieve equality.\nMorgan, who also wrote Thatcher biopic The Iron Lady, offers a social cross-section of women engaged with suffrage, from the laundrywomen to the middle-class chemist Edith (Helena Bonham Carter), in whose shop the suffragettes hold clandestine meeting, to upper-class MP’s wife Alice (Romola Garai), who naively believes that lobbying the government will win the day.\nOn the other side of the wall, the establishment enlists Inspector Steed (Brendan Gleeson) to use the same counter-terrorism tactics that he’s been using against the Fenians. And the battle becomes exceedingly – and one-sidedly – violent. On the streets, the police beat women without provocation; in prison, as the suffragettes attempt to hunger strike to continue their protest, they are force fed.\nShare article Shooting with roving handheld cameras, Gavron invests almost every scene with an edgy drama, removing Suffragette from the perils of “period” or costume drama and giving it freshness and vitality. Our perspective through this civil unrest is that of the novice suffragette, and as Maud Mulligan offers the perfect guide. With her watchful, intelligent eyes, and deceptively easy style of acting, of being present in scenes, the actress gives a heartbreakingly naturalistic performance.\nShe’s ably supported, particularly by Duff and Bonham Carter. The one odd note is struck when we actually glimpse Pankhurst herself. It ought to be a casting coup to have Meryl Streep in the role, an icon as an icon, though the decision to shoot the suffragette leader’s speech from a distance, as her supporters would see her, gives the actress a difficult task that she doesn’t entirely overcome.", "external_links": ["https://twitter.com/share?url=", "https://www.facebook.com/sharer/sharer.php?u="], "published": "2015-10-11T07:10:00.000+03:00", "crawled": "2015-10-11T07:33:54.934+03:00", "highlightTitle": ""}