{"organizations": [], "uuid": "a15c14ee7ac4cde49838d89f6a8db921659c0a93", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dnainfo.com", "main_image": "https://assets.dnainfo.com/generated/photo/2015/10/lettie-g-howard-hudson-river-park-1444138825.jpg/extralarge.jpg", "site_section": "http://www.dnainfo.com/new-york/topics/arts-entertainment.rss", "section_title": "Arts & Entertainment Top Stories on DNAINFO.com - Sunday, October 11, 2015 | 3:42am", "url": "https://www.dnainfo.com/new-york/20151008/greenwich-village/13-things-do-manhattan-neighborhoods-this-weekend", "country": "US", "title": "13 Things To Do in Manhattan Neighborhoods This Weekend", "performance_score": 0, "site": "dnainfo.com", "participants_count": 0, "title_full": "13 Things To Do in Manhattan Neighborhoods This Weekend", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T02:19:00.000+03:00", "replies_count": 0, "uuid": "a15c14ee7ac4cde49838d89f6a8db921659c0a93"}, "author": "", "url": "https://www.dnainfo.com/new-york/20151008/greenwich-village/13-things-do-manhattan-neighborhoods-this-weekend", "ord_in_thread": 0, "title": "13 Things To Do in Manhattan Neighborhoods This Weekend", "locations": ["Hudson River Park", "Manhattan"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "13 Things To Do in Manhattan Neighborhoods This Weekend By DNAinfo Staff | October 8, 2015 7:19pm Courtesy of Hudson River Park \nAll Weekend \nWhere: Pier 25 in TriBeCa When: Saturday and Sunday, 1:00 p.m. to 4:00 p.m. \nThe Lettie G. Howard was built in 1893 as a fishing schooner and spent much of its career transporting catches from Long Island and New Jersey to the Fulton Fish Market. It will dock at Pier 25 for visitors to explore this Saturday and Sunday as well as next weekend . \n► Fire Department Appreciation Weekend \nWhere: Intrepid Museum, Pier 86 in Hell's Kitchen When: Saturday and Sunday, 10:00 p.m. to 6:00 p.m. \nThe Intrepid will host Fire Department Appreciation Weekend , offering a tour of an FDNY fireboat and demos of firefighters cutting through steel with the jaws of life and hoisting a pretend victim using ropes and pullies, among many other activities. The event is free and open to the public. \nWhere: The Guggenheim Museum, Fifth Avenue on the Upper East Side When: Starting at 10 a.m. \nPostwar Italian Abstractionist Alberto Burri tore, burned, punctured and slashed his canvases during his career. His exhibit opens on Friday and will run until Jan 6. \nFriday, October 9 \nWhere: 170 Central Park West on the Upper West Side When: 7 p.m. \nIn honor of the New-York Historical Society’s new exhibit “Superheroes in Gotham” and Comic Con, test your superhero knowledge during a fun quiz show-style game run by creators of The Big Quiz Thing. The event is free and costumes are encouraged. Reserve a spot here or buy calling (212) 485-9268. \n► \"A Raisin in the Sun\" \nWhere: Taino Towers, at 240 East 123rd St. in East Harlem When: 7 p.m. \nWatch the Harlem Repertory Theater perform the first play written by an African-American woman to be produced on Broadway. \"A Raisin in the Sun\" follows the tale of an African-American family living in the South Side of Chicago. Tickets are $15 to $30 and can be purchased online . \nSaturday, October 10 \nWhere: Frank T. Modica Room, 80 Rutgers Slip in Two Bridges, Lower East Side When: 5:15 p.m. to 6:30 p.m. \nDescribed as cross between “a chamber music ensemble, rock band and art project,” the Warp Trio will perform a mix of original material, interpretations of popular music and “unique takes on classical repertoire,” according to the Two Bridges Neighborhood Council Inc., which organized the event. The concert is free and open to the public. \nWhere: Roosevelt Island’s lawn south of Rivercross, Meditation Steps, Gallery RIVAA and Blackwell Plaza & Park When: 11 a.m. to 4 p.m. \nSpend the day exploring the arts, music, visual and otherwise, on Roosevelt Island. Live mural painting will take place at the lawn, while a live jazz concert is put on at the Meditation Steps. Catch a free art workshop at the Gallery RIVAA on Main Street and find kid-friendly activities at Blackwell Plaza & Park. \nWhere: Gibney Dance Studio 280 Broadway (Enter at 53A Chambers St.), Civic Center When: 7:30 p.m. \nDancers and choreographers Jumatatu Poe and Jesse Zaritt began working together creatively two and a half years ago as strangers. Their new modern dance duet explores their evolving relationship. General admission tickets are $20 and $15 for seniors, students & Gibney Dance Class-Card Holders. \n► Children’s Harvest Festival with Dave the Worm Guy \nWhere: Jefferson Market Garden, Greenwich Avenue between Sixth Avenue and West 10th Street in Greenwich Village When: 11 a.m. to 2 p.m. (Rain date Sunday, same time) \nKids get to touch earthworms and decorate yummy cookies from Citarella (though maybe not in that order) on Jefferson Market Garden’s pretty lawn Saturday afternoon. Harvest Festival regular Dave the Worm Guy will teach kids how the wriggly critters enrich soil to grow plants, including pumpkins. Each kid gets to take a pumpkin home, courtesy of nearby gourmet grocer Citarella. \nWhere: A. Philip Randolph Square at Saint Nicholas Avenue near 116th Street, Harlem When: 11 a.m. to 4 p.m. \nCheck out this free outdoor party featuring live music and some of the best vendors Harlem has to offer. The event features face painting and a rock climbing wall for children, as well as a neighborhood bake-off and a live performance from the Harlem Swing Dance Society. \nSunday, October 11 \nWhere: Schimmel Center, 3 Spruce St. at Pace University, Downtown When: 2 p.m. \nWatch classic 1925 silent film \"The Freshman,\" a comedy starring Harold Lloyd, with live music. Adults $12, students $8. \nWhere: Lincoln Statue in Union Square When: 2 p.m. to 3 p.m. \nTake a walking tour to learn about the people, buildings and events that have shaped the history of Union Square \nWhere: Riverside Park, near 116th Street in Morningside Heights When: 2 p.m. \nWatch the Columbia University Bluegrass Band play tunes outdoors. \nThese listings were compiled by DNAinfo's Manhattan reporters: Lisha Arino, Emily Frost, Gustavo Solis, Gwynne Hogan, Noah Hurowitz, Danielle Tcholakian, Irene Plagianos and Shaye Weaver.", "external_links": [], "published": "2015-10-09T02:19:00.000+03:00", "crawled": "2015-10-11T10:44:51.580+03:00", "highlightTitle": ""}