{"organizations": [], "uuid": "02e9fdc5708c2b989e523528d9e7e7cf0361f5af", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://images.canberratimes.com.au/2015/10/15/6932128/Thumbnail1001508656gk9sm7image.related.thumbnail.320x214.gk9t0w.png1444882510858.jpg.jpg", "site_section": "http://feeds.canberratimes.com.au/rssheadlines/entertainment.xml#", "section_title": "Canberra Times Entertainment Headlines", "url": "http://www.canberratimes.com.au/entertainment/art-and-design/cate-blanchett-to-take-the-lead-role-in-new-acmi-film-installation-20151015-gk9t0w.html", "country": "AU", "title": "Cate Blanchett to take the lead role in new ACMI film installation", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "Cate Blanchett to take the lead role in new ACMI film installation", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T07:15:00.000+03:00", "replies_count": 0, "uuid": "02e9fdc5708c2b989e523528d9e7e7cf0361f5af"}, "author": "canberratimes.com.au", "url": "http://www.canberratimes.com.au/entertainment/art-and-design/cate-blanchett-to-take-the-lead-role-in-new-acmi-film-installation-20151015-gk9t0w.html", "ord_in_thread": 0, "title": "Cate Blanchett to take the lead role in new ACMI film installation", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Cate Blanchett is the face of a newly commissioned piece of cinematic art created by the German artist Julian Rosefeldt which is to open at the Australian Centre for the Moving Image in December. Photo: John Phillips \nIt's Cate Blanchett as you've never seen before - inhabiting the roles of a school teacher, a puppeteer, a newsreader, a taxi driver and a homeless man.\nThe Oscar-winning actress is the face of a newly commissioned piece of cinematic art created by the German artist Julian Rosefeldt which is to open at the Australian Centre for the Moving Image in December.\nIn the newly commissioned work,  Manifesto, Blanchett inhabits 13 different personas while bringing to dramatic life the musings and philosophies of artists, and artist movements, architects, dancers and filmmakers. Scenes with Blanchett were shot in Berlin earlier this year. They will play on separate screens in the one gallery. \nThe ACMI, the Art Gallery of NSW, Hamburger Bahnhof – Museum für Gegenwart, Berlin and Sprengel Museum, Hanover have all contributed to the cost of the show's production.\nAdvertisement The renowned artist's aim is to question the intersection between politics and arts, pay homage to the role of history in art and explore the artist's role in society.\n\"I have used the title Manifesto as a clear statement that the focus in this work is above all on texts, whether by visual artists, filmmakers, writers, performers or architects – and on the poetry of these texts,\" Rosefeldt says in a statement released by the ACMI.\n\"It's my intention to pull the curiosity of the viewer back to the text and the spoken word. Manifesto is a homage to the beauty of artists' manifestos - a manifesto of manifestos.\n\"The art scene at the beginning of the last century was still very small. To be heard, artists needed to scream extremely loud. The art scene today is a global network and business with diverse means of expression, and the manifesto as a medium of artistic articulation has become less relevant in a globalised and connected art world.\"\nJulian Rosefeldt: Manifesto has its world premiere at the ACMI on Wednesday December 9.\nThe show will open at the Art Gallery of NSW on May 28, 2016 and run until November 13.", "external_links": [], "published": "2015-10-15T07:15:00.000+03:00", "crawled": "2015-10-15T13:19:53.155+03:00", "highlightTitle": ""}