{"organizations": [], "uuid": "1179181978ce492cb0a3de5203b7a36d5ab5a1c6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wiltshiretimes.co.uk", "main_image": "http://www.wiltshiretimes.co.uk/resources/images/4342933/", "site_section": "http://www.wiltshiretimes.co.uk/leisure/showbiz/rss/", "section_title": "Wiltshire Times | National Entertainment News", "url": "http://www.wiltshiretimes.co.uk/leisure/showbiz/13875269.Jason_Manford_potty_about_Potts_role_in_Chitty_Chitty_Bang_Bang/?ref=rss", "country": "GB", "title": "Jason Manford potty about Potts role in Chitty Chitty Bang Bang", "performance_score": 0, "site": "wiltshiretimes.co.uk", "participants_count": 0, "title_full": "Jason Manford potty about Potts role in Chitty Chitty Bang Bang", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T16:50:00.000+03:00", "replies_count": 0, "uuid": "1179181978ce492cb0a3de5203b7a36d5ab5a1c6"}, "author": "", "url": "http://www.wiltshiretimes.co.uk/leisure/showbiz/13875269.Jason_Manford_potty_about_Potts_role_in_Chitty_Chitty_Bang_Bang/?ref=rss", "ord_in_thread": 0, "title": "Jason Manford potty about Potts role in Chitty Chitty Bang Bang", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Potts", "Jason Manford"], "text": "Jason Manford potty about Potts role in Chitty Chitty Bang Bang Jason Manford potty about Potts role in Chitty Chitty Bang Bang \nPress Association 2014 / / National Entertainment News Share \nComedian Jason Manford has said he is “very excited” about starring in a new production of Chitty Chitty Bang Bang. \nThe family favourite, by Bond writer Ian Fleming, will be touring around the UK and Ireland, kicking off at Southampton’s Mayflower Theatre in 2016. Jason Manford (Yui Mok/PA) \nThe 34-year-old will play Caractacus Potts, the role portrayed by American star Dick Van Dyke in the movie, from February 10, 2016 until April 24. He will return to the show from October 5, 2016. \nLee Mead, recently seen in BBC One’s Casualty, takes over as Potts from May 4 until September 18, 2016. \nJason, who is currently performing a couple of live stand-up dates, enjoyed success in West End productions The Producers and Sweeney Todd. Lee Mead will play Caractacus Potts in Chitty Chitty Bang Bang (Music & Lyrics Limited) \nTalking about his forthcoming engagement at Southampton’s Mayflower Theatre, the star took to Twitter. So I'm gonna be playing Caractacus Potts in the 2016 tour of Chitty Chitty Bang Bang! Very excited! Book here http://t.co/hIKSLv3oKj \nThe Mancunian heads up a cast that includes a 1980s pop star, a soap stalwart and a popular comedian. Promoted stories \nSpandau Ballet’s Martin Kemp will build on his flair for playing villains by taking on the role of the evil Child Catcher. Kemp played bad boy Steve Owen in EastEnders and starred alongside his brother Gary in The Krays. \nFunnyman Phill Jupitus (The Producers) will play Lord Scrumptious/Baron Bomburst, and Amy Griffiths (Everyman) has been cast as Truly Scrumptious. \nAll three will play their roles until April 24, 2016. Michelle Collins (Dominic Lipinski/PA Wire) \nThe cast is rounded off by Michelle Collins as Baroness Bomburst. Lately seen in Coronation Street, she remains most famous for playing Cindy Beale in EastEnders. \nAndy Hockley (The Phantom Of The Opera) will play Grandpa Potts. \nChitty Chitty Bang Bang’s pedigree includes author Fleming and Oscar winners Richard M Sherman and his brother Robert B Sherman who wrote the film’s famous songs. Dick Van Dyke in Chitty Chitty Bang Bang (PA) \nMusic and lyrics included in the movie include Truly Scrumptious, Toot Sweets, Hushabye Mountain and the Oscar-nominated title song Chitty Chitty Bang Bang. \nThe duo also worked on box office smashes Mary Poppins and The Jungle Book. They won two Academy Awards for Mary Poppins and two Grammy Awards. They received 21 gold and platinum albums. \nThis new production of Chitty Chitty Bang Bang will be directed by West Yorkshire Playhouse artistic director James Brining, with new choreography by Stephen Mear. \nOrganisers said the new production will have sensational sets and stunning special effects. \nChitty Chitty Bang Bang’s tour takes in cities including Belfast, Nottingham, Newcastle, Edinburgh, Glasgow and Sheffield. Share article \nTicket information is available on the official website . Promoted Stories", "external_links": [], "published": "2015-10-16T16:50:00.000+03:00", "crawled": "2015-10-16T18:08:50.367+03:00", "highlightTitle": ""}