{"organizations": [], "uuid": "1e702611c0c4c7204d294d399484452fe41d4d09", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.digitalspy.co.uk", "main_image": "http://i1.cdnds.net/15/35/300x225/x-factor-2015-caroline-flack.jpg?1451472757", "site_section": "http://www.digitalspy.co.uk/rss/zones/gb/all.xml#", "section_title": "All - Digital Spy - Entertainment and Media News", "url": "http://www.digitalspy.co.uk/tv/s103/the-x-factor/news/a673144/where-on-earth-was-caroline-flack-on-tonights-x-factor.html?rss", "country": "US", "title": "Where on earth was Caroline Flack on tonight's X Factor? - The X Factor Reality TV", "performance_score": 0, "site": "digitalspy.co.uk", "participants_count": 3, "title_full": "Where on earth was Caroline Flack on tonight's X Factor? - The X Factor News - Reality TV - Digital Spy", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T03:00:00.000+03:00", "replies_count": 2, "uuid": "9afab4d0b11b7244c5b23ac7deb09fbfdc392bcb"}, "author": "Susannah Alexander", "url": "http://www.digitalspy.co.uk/tv/s103/the-x-factor/news/a673144/where-on-earth-was-caroline-flack-on-tonights-x-factor.html?rss#post-0", "ord_in_thread": 0, "title": "Where on earth was Caroline Flack on tonight's X Factor? - The X Factor Reality TV", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "It was pretty much business as usual on The X Factor tonight as the Six Chair Challenge reached its nail-biting conclusion – but one element of the show was noticeably lacking.Viewers were united in their confusion when they took to Twitter to ask a vital question: where the heck was Caroline Flack? © Rex Features / David Fisher It certainly didn't seem to go unnoticed that the majority of the show was presented by Olly Murs, flying solo as his co-host was nowhere to be seen.Some weren't particularly happy about Flack not performing her presenting duties, with one viewer tweeting: \"Wonder how much Caroline Flack gets paid for 'presenting' on the X Factor for about 17 seconds each episode\".While others joked that Flack had more reason to kick off about lack of airtime than contestant Mason Noise, with one user tweeting: \"Can't believe Mason Noise kicking off about getting 47 seconds on the x factor, that's 45 seconds more than Caroline Flack has had\".Does Caroline Flack even work on the X-Factor? She gets less air time than Mason— Lukie (@MaliseTweets) October 11, 2015Why is Caroline Flack never on the X Factor...isn't she meant to be a presenter?! #XFactor— Leonie Gonzalez (@LeonieSheridan) October 11, 2015Can't believe Mason Noise kicking off about getting 47 seconds on the x factor, that's 45 seconds more than Caroline Flack has had— Bianca Del Taco Trio (@elmer_dudd) October 11, 2015THIS IS A PUBLIC ANNOUNCEMENT! HAS ANYBODY SEEN CAROLINE FLACK? SHE SEEMS TO BE MISSING FROM TONIGHT'S X FACTOR— tomm⚓️ (@tommbrew) October 11, 2015But fear not X Factor fans, Flack and her job are perfectly safe. The presenter was simply busy filming for the Strictly launch show when most of tonight's auditions took place, as she was needed back to perform her winners dance from last year with partner Pasha Kovalev.And as if just to reassure viewers, Flack magically reappeared in the final segment of the show to express her love for girl group 4th Power.#FlackWatch will resume on next week's X Factor, which airs next Sunday (October 18) at 7pm on ITV. Want to be on The X Factor, but without Simon Cowell grimacing at you? The Bopheads app gives you the chance to appear in that funny bit in the ad breaks, all thanks to those clever people at TalkTalk. Simply download here.", "external_links": [], "published": "2015-10-11T03:00:00.000+03:00", "crawled": "2015-10-12T10:17:14.924+03:00", "highlightTitle": ""}