{"organizations": [], "uuid": "f411a3217c5516289d5e0ca00b3a8335c1787dd0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mid-day.com", "main_image": "http://images.mid-day.com/images/2015/oct/11salman-khan-chalet-l.jpg", "site_section": "http://www.mid-day.com/Resources/midday/rss/entertainment.xml#", "section_title": "entertainment", "url": "http://www.mid-day.com/articles/salman-khans-chalet-at-bigg-boss-9-gets-a-superhero-twist/16600189", "country": "IN", "title": "Salman Khan's chalet at 'Bigg Boss 9' gets a superhero twist!", "performance_score": 0, "site": "mid-day.com", "participants_count": 1, "title_full": "Salman Khan's chalet at 'Bigg Boss 9' gets a superhero twist! - Entertainment", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T03:00:00.000+03:00", "replies_count": 0, "uuid": "f411a3217c5516289d5e0ca00b3a8335c1787dd0"}, "author": "A correspondent", "url": "http://www.mid-day.com/articles/salman-khans-chalet-at-bigg-boss-9-gets-a-superhero-twist/16600189", "ord_in_thread": 0, "title": "Salman Khan's chalet at 'Bigg Boss 9' gets a superhero twist!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "'Bigg Boss Nau – Double Trouble' is all set to open doors to an all-new set of contestants who will call the 'Bigg Boss' house their home for more than 100 days. And when the contestants have a brand-new home to look forward to, host for the season – Salman Khan – also gets a swanky freshly designed chalet which ups the levels of comfort for the superstar as he takes a break from grilling the contestants about their doings in the 'Bigg Boss 9' house.\nAlso read: Digangana Suryavanshi, Aman Varma and Sahil Khan on 'Bigg Boss 9'? \n\n\nStrategically located right next to the 'Bigg Boss 9' house, the chalet boasts of many fascinating features and has been specially designed to suit Salman Khan's choices and requirements. With a sprawling living room, well-equipped kitchen and personalized bedroom, the chalet is designed to give Salman a homely feel at all times. As soon as you step inside the chalet, one cannot miss the large poster of Salman's 'Devil' avatar from his movie creating a strong visual of the actor's many roles. With a strong personality touting him as Bollywood's superhero, the living room further carries impressions of various superhero characters which have created international impact. A collection of artefacts of renowned superheroes like Superman, Spiderman, Ironman, Batman, and Hulk add to the allure of the room.\n\nSalman Khan’s bedroom, though, has a different feel altogether. Pulling at the various memories that the actor harbours in his heart for his family, Salman’s bedroom showcases a collage of pictures of cherished times spent with his family members including his parents and siblings over the years. Adjoining to the bedroom is a lavish bathroom which has the choicest amenities adding a touch of luxury whenever the actor stays at this home away from home.\n\nSalman Khan's bedroom in his chalet on 'Bigg Boss 9' sets \nThe fine interiors and theme has been designed by renowned designer Subhajyoti Datta. “Home is where the heart is and I wanted to ensure that Salman Sir feels at home on Bigg Boss Nau set. I wanted to fill the house with elements which encapsulate Salman’s endearing yet strong personality and that is how we came up with the superhero theme. I presented my thoughts to the team that works closely with Salman Sir and after we reached a consensus, we put together the entire house speedily within 20 days. I hope the superstar enjoys what we have put together for him inside the chalet this year!” says Subhajyoti.\n\nCollage of family pictures on the bedroom wall in Salman Khan's chalet \nAs Bigg Boss Nau – Double Trouble readies to stir up double the entertainment and double the fun for the contestants, we hope that the comforts inside and outside the Bigg Boss house will add to the excitement levels for the viewers.", "external_links": [], "published": "2015-10-11T03:00:00.000+03:00", "crawled": "2015-10-11T10:32:12.988+03:00", "highlightTitle": ""}