{"organizations": [], "uuid": "6aed7dd91a0eca9bbe590ab00414f2b799351e11", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/151019182552-back-to-the-future-day-3-large-169.jpg", "site_section": "http://rss.cnn.com/rss/edition_entertainment.rss", "section_title": "CNN.com - Entertainment", "url": "http://edition.cnn.com/2015/10/20/opinions/wheeler-back-to-the-future-day/index.html", "country": "US", "title": "How Back to the Future blew it", "performance_score": 0, "site": "cnn.com", "participants_count": 1, "title_full": "How Back to the Future blew it - CNN.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T01:22:00.000+03:00", "replies_count": 0, "uuid": "6aed7dd91a0eca9bbe590ab00414f2b799351e11"}, "author": "David Wheeler", "url": "http://edition.cnn.com/2015/10/20/opinions/wheeler-back-to-the-future-day/index.html", "ord_in_thread": 0, "title": "How Back to the Future blew it", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Story highlights David Wheeler: It's finally Back to the Future day and we can see which predictions from the movie came true Luckily, many did not, he says. We don't, for example, have to deal with rehydrating our pizza, sleep inducing gadgets and Jaws 19 David R. Wheeler is a freelance writer and a journalism professor at the University of Tampa. Follow him on Twitter: @David_R_Wheeler . The opinions expressed in this commentary are solely those of the author.\n(CNN) Unless you've been living in a nuclear fallout shelter (remember those?), you're aware that we're celebrating Back to the Future Day. That's right, it's here: The date that Marty McFly and Doc Brown traveled to in the DeLorean in the 1989 Robert Zemeckis film, \"Back to the Future Part II.\"\nDavid Wheeler Finally we have the rare opportunity to confirm whether a famous movie's predictions actually came true on a certain day: October 21, 2015.\nWhile the movie nailed certain aspects of our time (including flatscreen TVs, nostalgia for the '80s, and even a successful Chicago Cubs season), we can be glad that not all the movie's predictions came true. We're definitely better off without the following inventions:\nJaws 19\nIn a memorable scene, a holographic advertisement for Jaws 19 terrifies Michael J. Fox. In the real-life fourth installment of the shark franchise, \"Jaws: The Revenge,\" we're already forced to accept the existence of sharks that roar, sharks that follow people to the Bahamas, and sharks that have vendettas. The tagline for \"Jaws 4\" was \"This time it's personal.\" Which invites the question: What absurdities would we be subjected to in the 19th installment? Sharks that leave a horse's head in your bed to \"send a message\"? We're better off not knowing.\nRead More 7 photos: From geek to chic: Wearable technology for 2015 travel Apple Watch – The Apple Watch , which will be available in April, can receive phone calls and send messages like an iPhone. It can also track fitness data and even pull up emails and some apps, including CNN. Hide Caption 1 of 7 7 photos: From geek to chic: Wearable technology for 2015 travel Google Glass – Google Glass is an augmented-reality headset that can take photos and videos, provide navigation and keep track of reservations and bookings. Hide Caption 2 of 7 7 photos: From geek to chic: Wearable technology for 2015 travel Ralph Lauren Polo Tech Shirt – Wear this shirt, and information tracking your activity, breathing and cardiac rates is streamed to your smartphone and tablet via Bluetooth. Hide Caption 3 of 7 7 photos: From geek to chic: Wearable technology for 2015 travel Hush smart earplugs – Developed as the world's first smart earplugs, Hush claims to filter unwelcome sounds while allowing important phone calls and alarms to intrude. Hide Caption 4 of 7 7 photos: From geek to chic: Wearable technology for 2015 travel 1Voice beanie – The 1Voice beanie is a warm, wireless way to listen to music. Bluetooth headphones built into the knit hat stream music from your device. Hide Caption 5 of 7 7 photos: From geek to chic: Wearable technology for 2015 travel Yelp Monocle augmented reality apps – Yelp Monocle overlays the real-world view through your mobile device's camera with labeled restaurants, shops, bars, landmarks and attractions. Hide Caption 6 of 7 7 photos: From geek to chic: Wearable technology for 2015 travel Flight Tonight: Last-minute bookings – Next year will see more apps like Flight Tonight and Hotel Tonight, which minimize planning and make it faster and easier to travel on a whim. Hide Caption 7 of 7 Dehydrated pizza\n\"Boy, oh, boy, Mom,\" Michael J. Fox says to Lea Thompson in BTTF's version of 2015. \"You sure can hydrate a pizza.\" But in the real 2015, everybody knows that moisture is the worst thing about microwaving a pizza. To avoid soggy slices, even the busiest and laziest people of 2015 take the extra couple of minutes to warm up a pizza in an oven (toaster or conventional). If you think microwave pizza is bad, you would be sure to hate the Black and Decker food hydrator.\nFlying cars\nEverybody loves the flying cars in \"Back to the Future II,\" but did you notice the floating Hill Valley welcome sign? It says, \"Please fly safely. Ejection seats save lives.\" Ejection seats? You mean I have to parachute to the ground any time I have a fender bender? Just to get to work a couple minutes faster? Thanks — I'll stick with my old-fashioned terrestrial Toyota.\nJUST WATCHED 'Back to the Future II' was this star's first movie Replay More Videos ... MUST WATCH\n'Back to the Future II' was this star's first movie 03:09 Sleep-inducing gadgets\nIn \"Back to the Future II,\" the filmmakers already anticipate the problem with mass-marketed gadgets that induce sleep. In fact, the movie never once shows the devices being used for their only legitimate purpose: curing insomnia. Instead, they're used to knock people out and make them forget that something happened. For example, Elisabeth Shue, who plays Marty McFly's girlfriend (and later wife), asks one too many questions about her future upon entering 2015. Wanting her to think it was all a dream, Doc Brown puts her to sleep with the sleep inducer. Then they leave her in an alley! Not cool.\nFollow @CNNOpinion Imagine being knocked unconscious any time you get too curious about something. Any time you're an inconvenience to someone. Any time you hear a secret you're not supposed to hear. Boom, you're out for hours. People would clearly get carried away and the streets would be strewn with the passed out. Small wonder the EZ Sleep hasn't made it into reality.\nVoice-activated light fixtures\nIn \"Back to the Future II's\" version of 2015, we don't flip light switches. We say, \"Lights on,\" and the lights come on at the sound of our voice. But the movie already anticipates the unintended consequence: Any time we happen to use those words in a sentence, the house thinks we're giving it a command. You couldn't say, \"Honey, can you make sure to turn the lights off before you go to bed.\" If you did, the light fixture's voice-activation system would misunderstand you and turn off the lights prematurely. Maybe it would be better to have some other sound command -- say, clapping your hands?\nToo late, this invention already exists -- remember The Clapper? -- and it was already being parodied in the 1980s. Buy one if you want, but it's hard to improve on a light switch. It works just fine.\nHovering robot photographers\nIn \"Back to the Future II,\" automated hovering cameras are so prevalent that they can even be relied upon for news footage, such as when Griff Tannen and his gang of bullies cause a \"hoverboard rampage\" that destroys the front of the Hill Valley courthouse. Good thing we don't have to worry about drones taking constant surveillance of our lives ... right?\nJoin us on Facebook.com/CNNOpinion.\nRead CNNOpinion's Flipboard magazine.", "external_links": ["http://i2.cdn.turner.com/cnnnext/dam/assets/151020083222-back-to-the-future-2-elijah-wood-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/141216105157-wearable-tech-rl-polo-topics.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/141216114423-wearable-tech-apple-watch-hp-video.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/151020083222-back-to-the-future-2-elijah-wood-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/141216114423-wearable-tech-apple-watch-horizontal-large-gallery.jpg", "https://flipboard.com/section/voices-baPbmr", "http://i2.cdn.turner.com/cnnnext/dam/assets/141216110306-wearable-tech-1v-beanie-horizontal-large-gallery.jpg", "http://www.rogerebert.com/reviews/jaws-the-revenge-1987", "http://i2.cdn.turner.com/cnnnext/dam/assets/141217120556-travel-tech-flight-tonight-app-topics.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/130814151553-david-wheeler-hedshot-topics.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/141216110306-wearable-tech-1v-beanie-hp-video.jpg", "http://traffic.outbrain.com/network/trackpxl?advid=814&action=view", "https://twitter.com/David_R_Wheeler", "http://i2.cdn.turner.com/cnnnext/dam/assets/141216114423-wearable-tech-apple-watch-story-body.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/151020083222-back-to-the-future-2-elijah-wood-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/141216114423-wearable-tech-apple-watch-story-top.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/141217114939-travel-tech-yelp-monocle-horizontal-large-gallery.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/141217120556-travel-tech-flight-tonight-app-story-body.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/130814151553-david-wheeler-hedshot-story-body.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/151020083222-back-to-the-future-2-elijah-wood-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/151020083222-back-to-the-future-2-elijah-wood-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/140410175403-skyscanner-future-of-travel-google-glass-story-top.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/140410175403-skyscanner-future-of-travel-google-glass-horizontal-large-gallery.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/141216110838-wearable-tech-hush-earplugs-horizontal-large-gallery.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/141217114939-travel-tech-yelp-monocle-topics.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/141217120556-travel-tech-flight-tonight-app-hp-video.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/141216105157-wearable-tech-rl-polo-story-body.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/141216105157-wearable-tech-rl-polo-horizontal-large-gallery.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/141216105157-wearable-tech-rl-polo-hp-video.jpg", "http://home.howstuffworks.com/clapper.htm", "http://i2.cdn.turner.com/cnnnext/dam/assets/141216110306-wearable-tech-1v-beanie-story-body.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/130814151553-david-wheeler-hedshot-story-top.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/130814151553-david-wheeler-hedshot-horizontal-large-gallery.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/141216105157-wearable-tech-rl-polo-story-top.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/140410175403-skyscanner-future-of-travel-google-glass-topics.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/141217120556-travel-tech-flight-tonight-app-story-top.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/140410175403-skyscanner-future-of-travel-google-glass-story-body.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/151020083222-back-to-the-future-2-elijah-wood-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/141216110306-wearable-tech-1v-beanie-topics.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/141217120556-travel-tech-flight-tonight-app-horizontal-large-gallery.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/151020083222-back-to-the-future-2-elijah-wood-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/141216110306-wearable-tech-1v-beanie-story-top.jpg", "https://twitter.com/CNNOpinion", "http://www.facebook.com/CNNOpinion", "http://i2.cdn.turner.com/cnnnext/dam/assets/140410175403-skyscanner-future-of-travel-google-glass-hp-video.jpg", "http://teamcoco.com/&quot;", "http://i2.cdn.turner.com/cnnnext/dam/assets/141216110838-wearable-tech-hush-earplugs-topics.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/130814151553-david-wheeler-hedshot-hp-video.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/141216114423-wearable-tech-apple-watch-topics.jpg"], "published": "2015-10-21T01:22:00.000+03:00", "crawled": "2015-10-20T20:49:30.264+03:00", "highlightTitle": ""}