{"organizations": [], "uuid": "6cd5e1977b1147311b43987f680a125f1cf8d4f2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.herald.ie", "main_image": "http://www.herald.ie/opinion/article31594586.ece/ALTERNATES/h342/2015-10-09_opi_13544577_I1.JPG", "site_section": "http://www.herald.ie/entertainment/", "section_title": "Entertainment - Herald.ie", "url": "http://www.herald.ie/opinion/colette-fitzpatrick-shes-facing-cancer-for-the-tenth-time-yet-my-pal-emma-is-so-open-and-brave-31594588.html", "country": "US", "title": "Colette Fitzpatrick: She's facing cancer for the tenth time, yet my pal Emma is so open and brave", "performance_score": 0, "site": "herald.ie", "participants_count": 1, "title_full": "Colette Fitzpatrick: She's facing cancer for the tenth time, yet my pal Emma is so open and brave - Herald.ie", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T11:00:00.000+03:00", "replies_count": 0, "uuid": "6cd5e1977b1147311b43987f680a125f1cf8d4f2"}, "author": "herald.ie", "url": "http://www.herald.ie/opinion/colette-fitzpatrick-shes-facing-cancer-for-the-tenth-time-yet-my-pal-emma-is-so-open-and-brave-31594588.html", "ord_in_thread": 0, "title": "Colette Fitzpatrick: She's facing cancer for the tenth time, yet my pal Emma is so open and brave", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "When I heard last week that Emma Hannigan had been diagnosed with cancer again, I was stunned. Although this is a woman who calls herself the 'cancer slayer' and cheekily a 'cancer vixen', she has already had it nine times.\nEmma Hannigan Angelina Jolie Minister Michael Noonan Phubbing your pals Now she has a tenth diagnosis in her cross-hairs and is reloading and getting ready to fight again.\nI texted Emma last Saturday asking would she come on Newstalk in the morning to talk about her diagnosis. I should have known that she never takes the easy option.\nShe rang me back minutes later, told me the whole story and agreed to come on radio in the morning to talk about the 10th diagnosis.\nLumps\nShe had found the lumps herself in her neck. It's still called breast cancer though because its labelled on the basis of where your first cancer was found.\nWas Emma angry? Who could blame her if she was?\nShe'd have every right to eff and blind and scream and be furious at whoever for landing this on her and her husband and teenage children again.\nShe's not though. She's accepting of the fact that 'this is the way it will be' and we live at a time when treatment and survival rates are a world away from what we grew up with.\nWhen she found out, she kept it to herself for an entire month.\nImagine knowing that your cancer is back and not being able to confide in those you love. It's not because she couldn't. She didn't because she felt guilty.\n'Cancer guilt' she called it - guilty that her family would be going through it all again.\nEmma has the BRCA 1 gene - the one Angelina Jolie has. Women who carry a mutated version of BRCA1, or another gene known as BRCA2, face a life-time risk of breast cancer. If diagnosed, they face a severe threat of ovarian tumours.\nJust like Jolie, Emma chose to have preventative surgery and has had both breasts and her ovaries removed.\nAngelina Jolie\nHer mum decided against surgery and decided to monitor. Her own children, when the time comes, may have to make hard decisions on this too.\nBare\nThis week, Emma allowed TV3's cameras into a chemo session she was undergoing.\nShe laid herself bare in what must be one of the most vulnerable states you can be in, just so other people could see, could have their questions answered and their fears removed.\nShe does other work too, of course. The Emma I know is an author of some stonking good reads. The Heart of Winter went into paperback just last week.\nShe started to write to have something to do when she was lying in a hospital bed.\nThat's typical of her - turning the worst news into one of the best parts of her life.\nAnd here she goes again. Emma Hannigan, cancer slayer and cancer vixen, we wish you well going into battle.\nMums need a Budget that stops us dipping into the 'running away money' The really big question we should be asking the Government isn't about the date of the general election. It's whether or not it has the guts to deliver a Budget that isn't a pre-election give-away, but loosens the purse strings enough to give something back to taxpayers.\nThis would be a Budget that keeps the think tanks, who've been begging Michael Noonan to resist playing Santa Claus, happy, but which gives people a break. A sort of a Goldilocks budget. Not too little. Not too much. Just right.\nThe last few Budgets have given women a lot to think about. Maternity benefit was slashed, which left many mums in the private sector wondering why they were paying taxes to provide their pals in the public sector with fully-paid maternity benefit.\nOf course, if benefits like child benefit and maternity benefit were taxed, those in need wouldn't pay any tax and those that could afford them would.\nRecession\nAnd will there be a second free pre-school year announced next Tuesday? Many parents hope so.\nAn ESRI study last year found that women have been hardest hit by the recession. They are half the population but make about 85pc of spending decisions in households.\nIt is women who look after the most vulnerable members of our society too - children, the elderly, the sick.\nIt's a game of family fortunes next week. And those that keep families together, the women who crunch the numbers and work out what's affordable within their own family budget or not, need a Budget that protects them and keeps their health, their families, their futures and their finances in mind. A Budget that won't leave them sleepless next Tuesday night.\nOtherwise they may have to dip into the running away money - that little stash of cash that's just yours. That's if you have any.\nDon't 'phub' up your relationship\nIf you're reading this on a phone, I hope you're not 'phubbing' - 'phone snubbing', that is.\nThis is snubbing someone in a social setting by using your mobile. Keeping your phone in sight or even holding it in your hand also counts.\nNot hesitating to check your phone if you get a message, looking at your phone while on a date, or playing with your phone if there's a lull in conversation, are all forms of phubbing.\nIt's an epidemic - and there's even a website that can help, called stopphubbing.com.\nSo don't check that on your phone. Put it down. Otherwise you'll end up phubbing up your relationship.\nWe have shopping smart in the bag\nDear England, it'll be okay. We too thought the bag levy was a major imposition and 13 years later we can't imagine the country without it.\nBack then, you couldn't drive 100 yards down an Irish road without seeing plastic bags all over trees and ditches - almost 17 times as many as you see now. And the levy has raised more than €200m here.\nI do wish however that supermarkets wouldn't sell us those thin plastic bags that fall apart, in a bid to get you to buy their more expensive ones. And yes it's always annoying when you're at the till and realise you've forgotten your bags.\nWhy not ban plastic shopping bags completely and bring in strong brown paper bags, like they do in parts of the States?\nAnyway England, you'll be grand. Yours, Ireland.", "external_links": [], "published": "2015-10-09T11:00:00.000+03:00", "crawled": "2015-10-09T14:24:36.873+03:00", "highlightTitle": ""}