{"organizations": [], "uuid": "364ea8027915d5262d1c133ecc2c085a9e77e025", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "lasvegassun.com", "main_image": "//media.lasvegasweekly.com/img/photos/2009/09/03/scaled.PennEmilyJillette_t378.jpg?42670983c634e7c20626cc4856c543752c0d8b2f", "site_section": "http://www.lasvegassun.com/feeds/headlines/ae/", "section_title": "Las Vegas Sun Stories: Arts & Entertainment", "url": "http://lasvegassun.com/vegasdeluxe/2015/oct/19/emily-jillette-rescues-surfer-in-hawaii-lou-ruvo-c/", "country": "CR", "title": "Emily Jillette rescues surfer in Hawaii; Lou Ruvo Center to expand?", "performance_score": 0, "site": "lasvegassun.com", "participants_count": 0, "title_full": "Emily Jillette rescues surfer in Hawaii; Lou Ruvo Center to expand?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T02:44:00.000+03:00", "replies_count": 0, "uuid": "364ea8027915d5262d1c133ecc2c085a9e77e025"}, "author": "", "url": "http://lasvegassun.com/vegasdeluxe/2015/oct/19/emily-jillette-rescues-surfer-in-hawaii-lou-ruvo-c/", "ord_in_thread": 0, "title": "Emily Jillette rescues surfer in Hawaii; Lou Ruvo Center to expand?", "locations": ["Hawaii"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Lou Ruvo Center", "Emily Jillette"], "text": "Launch slideshow » \nRio headliner magician Penn Jillette’s wife Emily Jillette used magic of her own to help save the life of a badly injured surfer in Hawaii over the weekend. \nEmily was playing in a golf tournament on Kona and while staying at the Four Seasons there walked on the beach one morning ahead of the greens and discovered the athlete beaten up by severe waves and rocks. \n“An experienced surfer wouldn’t go out there alone,” Emily told me. “His head and face were covered in blood, and he was lying on his back.” \nEmily ran to him: “It was surreal because it didn’t seem likely that I’d find someone who was injured and wasn’t being helped. His eyes were closed tight, and he had a deep gash over his brow. \n“I asked his name, where he was and a few other questions to ensure that he was coherent. I called the hotel at the same time, and security arrived within five minutes.” \nThe injuries were serious enough for security to call in EMS paramedics. Emily managed to get the young man to give him the name of his wife and her number, but he said, “She’ll kill me as we go home tonight — and now won’t be able.” \nEmily continued: “She was Russian, so she didn’t understand me very well. Somehow I communicated to her what had happened, where we were and told her how to find us. As soon as she saw him, she began crying as EMS bandaged him up and took him off to a hospital. \n“I don’t know what happened after that but can only hope they were OK, and if they were delayed a day or two going home, at least he was alive and I’d found him.” Launch slideshow » \nSUPERSTAR HELP: Is a big expansion in the works at the Cleveland Clinic Lou Ruvo Center for Brain Health because the waiting list to help patients is now as long as four months? \nIt now takes until next March for an appointment, and founder Larry Ruvo wants that drastically reduced. That means a bigger and new building. \nI’m reliably told that distinguished architect Frank Gehry has drawn up plans for expansion to the current facility that he designed and was opened in May 2010. \nTwo music superstars have promised Larry to visit the center in December to help boost expansion plans to be announced then. \nRobin Leach of “Lifestyles of the Rich & Famous” fame has been a journalist for more than 50 years and has spent the past 15 years giving readers the inside scoop on Las Vegas, the world’s premier platinum playground. \nFollow Robin Leach on Twitter at Twitter.com/Robin_Leach . \nFollow Las Vegas Sun Entertainment + Luxury Senior Editor Don Chareunsy on Twitter at Twitter.com/VDLXEditorDon . Cleveland Clinic Lou Ruvo Center for Brain Health 888 West Bonneville Ave. Las Vegas , NV 89101 Rio All-Suite Hotel and Casino \nCarnival lasts all year at the Rio. With a float occasionally passing overhead and dropping beads while feathered dancers fire up the gamblers below, the Rio tries to keep its 120,000-square foot casino jumping with excitement. Special Brazilian mixed-drinks are also served throughout the casino. The hotel suites tend to be larger than similar priced rooms on the Strip and many offer excellent views with floor to ceiling windows. \nThe Rio offers some quality shows like \"Penn & Teller\" and \"Chippendales.\" Many come to the Rio for the nightlife at the VooDoo Lounge, located on the 51st floor, or McFadden's Irish Pub on the casino level. \nOthers come for a bit relaxation at the Rio Spa or pool area and still others come to shop at the hotel's 60,000 square feet of shops. In each of these endeavors, the Rio attempts to make the experience a bit more fun and spontaneous. \nThe Rio also offers guests a variety of dining choices from all-American food at the All-American Bar & Grille to Gaylord India Restaurant for something a little spicier and even Carnival World Buffet for the indecisive. 3700 W. Flamingo Rd. Las Vegas , NV 89103 702-777-7634", "external_links": [], "published": "2015-10-20T02:44:00.000+03:00", "crawled": "2015-10-20T03:01:23.304+03:00", "highlightTitle": ""}