{"organizations": [], "uuid": "405c004d071fa49a694daa38b8bd9ae1e8eba560", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.examiner.com", "main_image": "http://cdn2-b.examiner.com/sites/default/files/styles/image_content_width/hash/0b/09/0b090d33d2624ce19ad20fa22000e4e6.jpg?itok=No--htb6", "site_section": "http://www.examiner.com/arts-and-entertainment", "section_title": "Arts &amp; Entertainment | Examiner.com", "url": "http://www.examiner.com/article/gold-rush-miners-see-blood-sweat-and-gold-on-discovery-channel", "country": "US", "title": "'Gold Rush' miners see ‘Blood, Sweat and Gold’ on Discovery Channel", "performance_score": 0, "site": "examiner.com", "participants_count": 1, "title_full": "'Gold Rush' miners see ‘Blood, Sweat and Gold’ on Discovery Channel | Examiner.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T06:30:00.000+03:00", "replies_count": 0, "uuid": "405c004d071fa49a694daa38b8bd9ae1e8eba560"}, "author": "Diane Zoller-Ciatto", "url": "http://www.examiner.com/article/gold-rush-miners-see-blood-sweat-and-gold-on-discovery-channel", "ord_in_thread": 0, "title": "'Gold Rush' miners see ‘Blood, Sweat and Gold’ on Discovery Channel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Play Get to know the dogs running around Scribner Creek during Season Five of Gold Rush! on.aol.com Tonight’s season six premiere episode of \" Gold Rush \" was titled “Blood, Sweat and Gold.” The episode begins as the Hoffman crew is on their way to the Klondike earlier than ever. Todd, his son Hunter and father Jack are determined not to let anything stop them this season.\nPhoto courtesy of Discovery used with permission Parker Schnabel is reflecting on his leadership qualities or lack thereof from last season. Tony Beets is also determined to change things up, and as he sees his dredge sitting alone and wants a fleet of dredges. The Hoffmans are ready to come back with more determination than ever and knock Parker off the mountain.\nIn Haines, Alaska, Parker is on a boat on the way to find Gene Cheeseman and do whatever to make him return. Parker needs to mend the broken fences. When Parker finds Gene, he thanks him for the awesome job he did last season. He asks Gene to return to his crew, but Gene refused. Now Parker is at a loss because Gene will be difficult, if not impossible to replace.\nAt McKinnon Creek, the Hoffman crew is two weeks ahead of the rest of the crews. The permafrost is hard to work through, but they are doing it. At Eldorado Creek, The three Hoffmans are exploring the land at the richest documented Creek in the area. They met with Peter Tallman, the owner of the land they are mining who showed them that giant chunk of rock with gold sticking out. Peter told them if they can double what they did last year at McKinnon Creek; they will work something out for Eldorado.\nAt Paradise Hill, Tony and Minnie are flying over another dredge he wants to buy. She is not convinced that buying another will be the answer, as the initial one has yet to prove itself.\nIn Haines, Parker is at crossroads, and discussing his future with his mother, father and grandfather. After making enough to buy his own claim, he lost his secret weapon; Gene Cheeseman. Greg Remsburg, Mike Beaudry his mechanic and Rick cannot return because Rick’s mother has brain cancer. Parker may have to mine for Tony Beets again because he has no crew, but makes a call to Tony Beets after five months of not speaking.\nThe Beets family is finding gold together, Kevin adds concentrate to the large wheel that drops the gold into the middle hole where it can be dried and weighed. In Haines, Parker is still home checking over the contract Tony sent him. As Parker packs and gets ready for his trek to the Klondike, he says goodbye to his family and Dozer comes with him. At Scribner Creek, over six hundred miles later, he arrives to check his equipment that sat out in the elements during the winter. His D-10 dozer started right up, making him smile. As spring arrives, a new crew arrives of all youngsters with little experience, but the best thing that happened was the arrival of Rick Ness, whose mother knew he had to be there. Rick will do the training because he has more patience than Parker.\nAt McKinnon Creek, the three Hoffmans return and the crew had three weeks under their belt of clearing overburden. Todd told Dave Turin that he promised to double last year’s gold. Dave was not happy that Todd did not consult with him. Then Todd told Dave that he wanted to triple last year’s cut and mine more gold than ever before. Dave knows that a cut this big can cause a disaster if something goes wrong.\nAt Eureka Creek , Tony comes to inspect the dredge to see if it survived the winter. When they fire it up, it hums each part of it. Minnie showed up and told them to turn it off until it had more safety measures in place. She knows the cost if someone falls or gets hurt.\nAt McKinnon Creek, the ground is thawing quickly and there is mud all around. Dave calls an emergency meeting and explains what a terrible situation they are in the midst of. They bring in the largest pump to suck out as much water as they can so the cut does not flood. However, Logan’s excavator starts sinking as the excavator went through the ice. As Dave tries to get him free, he has been in the icy water for an hour. Finally, he comes out as all are counting their blessings as they learn a hard lesson never trust the ice.\nAt Paradise Hill, Parker is on his way to get a signed copy of his lease from Tony. When he arrives, the lease has changed and Parker will not sign. At McKinnon Creek, they have a handle on the water problem. Dave believes they should be able to sluice in a few weeks. When Andy finds large chunks of quartz, they decide to run some dirt to the wash plant to see what it produces. The wash plant costs thousands of dollars a day to run, so Dave hopes his decision brings at least $10 a yard, or it is a loss.\nAt Eureka Creek, Mike Beaudry, who worked for Parker, last season is working for Tony. Now Tony goes to find a guy, who can run his dredge and supervise his crew. The guy is Gene Cheeseman, and he takes the job. He soon found that he had a ‘no compete’ clause in his contract with Parker. Will they be able to solve this amicably? Or will it be war? Parker wants to lease virgin ground that Tony owns and Tony wants Gene.\nAt McKinnon, the sluice box shows some gold, but they must check to see if they are on the gold. When Jack presented the gold, it weighed 29 ounces, which was their best first cleanup ever. At Paradise Hill, Parker is on his way to negotiate, and he got his virgin ground, and Tony got Gene on this episode of \"Gold Rush.\"", "external_links": ["https://www.google.com/search?q=eureka+creek+yukon&espv=2&biw=1422&bih=661&tbm=isch&tbo=u&source=univ&sa=X&ved=0CCkQsARqFQoTCPednbvRyMgCFQs3PgodIrEH6A&dpr=1.35", "http://dsc.discovery.com/tv-shows/gold-rush"], "published": "2015-10-17T06:30:00.000+03:00", "crawled": "2015-10-17T08:29:48.803+03:00", "highlightTitle": ""}