{"organizations": [], "uuid": "0a7e111e849d02d194c6bab2fa3887d7659953f1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mercurynews.com", "main_image": "http://local.mercurynews.com/common/dfm/assets/logos/1200x627/mercurynews.png", "site_section": "http://feeds.contracostatimes.com/mngi/rss/CustomRssServlet/571/201109.xml", "section_title": "Entertainment", "url": "http://www.mercurynews.com/entertainment/ci_28997557/star-wars-ticket-sales-set-records-two-months?source=rss", "country": "IL", "title": "'Star Wars' ticket sales set records two months before opening", "performance_score": 0, "site": "mercurynews.com", "participants_count": 1, "title_full": "'Star Wars' ticket sales set records two months before opening", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T01:08:00.000+03:00", "replies_count": 0, "uuid": "0a7e111e849d02d194c6bab2fa3887d7659953f1"}, "author": "Anousha Sakoui and Christopher Palmeri \n\nBloomberg News", "url": "http://www.mercurynews.com/entertainment/ci_28997557/star-wars-ticket-sales-set-records-two-months?source=rss", "ord_in_thread": 0, "title": "'Star Wars' ticket sales set records two months before opening", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "'Star Wars' ticket sales set records two months before opening By Anousha Sakoui and Christopher Palmeri Bloomberg News Posted: 10/20/2015 02:18:10 PM PDT Updated: 10/20/2015 02:18:10 PM PDT Walt Disney's upcoming \"Star Wars\" film set sales records in the U.S. and U.K. as the company began selling tickets two months before its opening. \nAMC Entertainment Holdings, the second-largest U.S. cinema chain, said it sold out more than 1,000 shows. Online seller Fandango smashed its previous record, selling eight times as many tickets as it did for \"The Hunger Games\" in 2012. \n\"Fandango traffic surged to 7 times its typical peak levels,\" the Comcast-owned site said in a statement Tuesday. It expects enthusiasm for the film \"to continue all the way to its debut.\" \nResearcher BoxOffice.com is forecasting a $215 million opening-weekend box office in the U.S. and Canada, a new high for any film, when the movie makes its debut on Dec. 18. \nU.S. ticketing sites Fandango and MovieTickets.com struggled to keep up with demand in the first few hours tickets were available. Disney's ESPN network kicked off early sales with a new trailer for the film during a \"Monday Night Football\" telecast. Some fans trying to buy tickets received error messages, and Twitter users reported trouble reaching the Fandango site, as well as those of some cinema chains. \n\"With such extraordinary demand, we saw intermittent technical challenges that caused some consumers to queue online longer than expected,\" Fandango said in a statement. The websites of both Fandango and MovieTickets.com were working normally by early Tuesday. Advertisement \nMovietickets.com said Monday that \"The Force Awakens\" became its No. 1 seller with 44 percent of tickets sold in the prior 24 hours. But its site, too, succumbed for a time, posting this message: \"Web server is returning an unknown error.\" \nIn the U.K., Odeon & UCI Cinemas Group said Monday online ticket sales for \"Star Wars\" set a record for the U.K. chain and caused booking delays at its website. \nThe U.K.'s Vue Entertainment also had record advance ticket sales purchases, selling 10,000 in the first 90 minutes, according to an emailed statement. Customers were able to purchase throughout the day with only a few delays. \n\"We've seen massive traffic to our website today as guests book ahead\" for \"Star Wars\" and the new James Bond film \"Spectre,\" Simon Soffe, an Odeon & UCI spokesman, said Monday in an email. The chain is owned by Guy Hands's Terra Firma Capital Partners Ltd., while Vue's parent is Omers Private Equity.", "external_links": [], "published": "2015-10-21T01:08:00.000+03:00", "crawled": "2015-10-21T01:13:29.027+03:00", "highlightTitle": ""}