{"organizations": ["Hearts of Stone Review"], "uuid": "ce20cba86d2b1ea61fa038890d418377b379ce66", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ign.com", "main_image": "http://assets1.ignimgs.com/2015/10/09/witcher3heartsofstone1280jpg-996800_1280w.jpg", "site_section": "http://feeds.ign.com/IGNXboxOneVideos", "section_title": "IGN Entertainment Videos", "url": "http://www.ign.com/articles/2015/10/09/the-witcher-3-hearts-of-stone-review?watch", "country": "US", "title": "The Witcher 3: Hearts of Stone Review", "performance_score": 0, "site": "ign.com", "participants_count": 0, "title_full": "The Witcher 3: Hearts of Stone Review", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T04:00:00.000+03:00", "replies_count": 0, "uuid": "ce20cba86d2b1ea61fa038890d418377b379ce66"}, "author": "", "url": "http://www.ign.com/articles/2015/10/09/the-witcher-3-hearts-of-stone-review?watch", "ord_in_thread": 0, "title": "The Witcher 3: Hearts of Stone Review", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Got feedback on our player? We want to hear it. \nAll of it is of such high quality that I often had trouble discerning whether something was new, or just something I’d never done my first time through. So while it doesn’t stand out as uniquely different, nothing in Hearts of Stone feels like it was rushed out by some sort of “B team.” As ever, the plentiful sidequests all have fun, interesting stories to tell. “ \nRunewords actually alter or break the normal rules of combat in ways that changed how I played. \nOne of those stories is of an Ofieri merchant who waxes poetic about the beauty of his far-off homeland. He also introduces the new Runewords mechanic, which allows you to apply powerful, unique buffs to your gear by combining three existing runes. More than straight-line stat upgrades, these actually alter or break the normal rules of combat in ways that changed how I played. I went for one that granted a huge boost to health and stamina regen once I hit max adrenaline, and immediately switched my build around to focus on generating adrenaline so I could go mad with power once the runeword kicked in. Things get even more interesting than that though. One in particular makes all of your equipped armor count as heavy, allowing you to make use of the School of the Bear passive while wearing whatever you want. Another cause your Axii sign to skip to another target if the current one dies. Not only are these changes functional and cool to mess with, but they have the nice side effect of giving runes value beyond their standard stats. All those junk runes sitting in your inventory now have the potential to turn into something useful. Additionally, the Runewright can add sockets to any piece of gear for a cost, finally giving us a reliable way to socket our favorite pieces of gear. The Heart of the White Wolf But the true star of Hearts of Stone is the story, which finds believable ways to put Geralt into new situations you wouldn’t expect to see him in, like making a speech at a wedding, or willfully working with others to plan a heist. It introduces great new characters like von Everec, and breathes new life into the enigmatic Gaunter O’Dimm and Shani, who some might remember from the first Witcher game. The Witcher 3 - Hearts of Stone Screens < Previous Next > The complex nature of the relationship between Gaunter, Olgierd, and Geralt is drawn beautifully, with nuanced performances of material that’s more introspective and thematically driven than anything else. Missed chances at love, the institution of marriage, learning to live for the moment, the illusion of free will - these are explored to varying degrees, making it one of my favorite Witcher 3 storylines. The Verdict \nThe story in Hearts of Stone alone would make it worth getting, but it succeeds on other levels as well. The fun new enemies and bosses, along with the customization potential of Runewords make Hearts of Stone a very well-rounded package that shouldn’t be skipped. IN THIS ARTICLE PS4 PC Xbox One Amazing The Witcher 3: Hearts of Stone wraps an interesting story and great gameplay additions into one well-rounded expansion. Vince Ingenito 8 Oct 2015 Great characters", "external_links": [], "published": "2015-10-09T04:00:00.000+03:00", "crawled": "2015-10-09T04:28:07.688+03:00", "highlightTitle": ""}