{"organizations": [], "uuid": "ba2b8944cd7a80a18d5cdf1ab62c341224ff7607", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.spokesman.com", "main_image": "http://media.spokesman.com/img/logos/sr200.png", "site_section": "http://www.spokesman.com/feeds/stories/entertainment/", "section_title": "Spokesman.com: Entertainment stories", "url": "http://www.spokesman.com/stories/2015/oct/22/new-on-dvd-oct-20-jurassic-world-stomps-into-store/", "country": "US", "title": "New on DVD Oct. 20: ‘Jurassic World’ stomps into stores - Thu, 22 Oct 2015 PST", "performance_score": 0, "site": "spokesman.com", "participants_count": 0, "title_full": "New on DVD Oct. 20: ‘Jurassic World’ stomps into stores - Thu, 22 Oct 2015 PST", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T10:00:00.000+03:00", "replies_count": 0, "uuid": "ba2b8944cd7a80a18d5cdf1ab62c341224ff7607"}, "author": "", "url": "http://www.spokesman.com/stories/2015/oct/22/new-on-dvd-oct-20-jurassic-world-stomps-into-store/", "ord_in_thread": 0, "title": "New on DVD Oct. 20: ‘Jurassic World’ stomps into stores - Thu, 22 Oct 2015 PST", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The latest dinosaur story proved to be a massive success at the box office. Now, you can own a copy. \n“Jurassic World” 1/2: Steven Spielberg had the advantage of dazzling new computer technology to make his 1993 release “Jurassic Park” a cinematic joyride. The creation of the dinosaurs was … \nThe latest dinosaur story proved to be a massive success at the box office. Now, you can own a copy. \n“Jurassic World” 1/2: Steven Spielberg had the advantage of dazzling new computer technology to make his 1993 release “Jurassic Park” a cinematic joyride. The creation of the dinosaurs was almost as amazing as the technology suggested in the movie to bring back the giant beasts through found DNA. \nSince then, audiences have been fed a steady diet of computer-generated creatures and characters to the point that it has become somewhat passe. That didn’t bode well for “Jurassic World,” the fourth film in the series based on the Michael Crichton books. \n“Jurassic World” serves as a reminder that it wasn’t just the dazzling CGI work in “Jurassic Park” that made it such a masterpiece. It was also the combination of a solid story, interesting characters and pacing that bounces between terror and humor with ease. \nAll of those elements come together again to make “Jurassic World” – such pure entertainment fun it easily became the biggest movie of the year at the box office. \n“Nurse Jackie: Season 7” : Golden Globe and Emmy Award winner Edie Falco takes viewers through one last season of her wild medical world with the final season of the superb cable program. \nNurse Jackie faces her biggest challenges after her drug addiction is exposed. Falco is marvelous as she shows the depths at which a character can be played by a skilled actor. Also new on DVD \n“Testament of Youth”: War comes between a feminist and her true love. Alicia Vikander stars. \n“The Wolfpack”: Documentary on six brothers who were locked away from society. \n“Z is for Zachariah”: Chris Pine stars in this post-apocalyptic tale that pits the world’s last three survivors against one another. \n“Galaxy Buck: Mission to Sector 9”: Out of this world story from “VeggieTales” creator Phil Vischer. \n“Olympus”: First season of the series that follows a young man’s quest to solve the riddle of the Gods. \n“The Bomb”: Examination of nuclear weaponry to mark 70th anniversary of the detonation of the atomic bomb. \n“The Facts of Life: Season Seven”: Girls must deal with the destruction of Edna’s Edibles. \n“The Vatican Tapes”: Dougray Scott stars in this tale of good battling evil. \n“Benoit Jacquot Collection”: Includes “The Disenchanted,” “A Single Girl” and “Keep It Quiet.” \n“Northern Limit Line”: Based on the real story of the Second Battle of Yeonpyeong. \n“Chasing Shadows”: Sean Stone can identify and predict patterns of human behavior. \n“The Widower”: British gentleman hides a dark side. \n“Dumb It Down”: A look at how hip-hop has changed over the years. \n“Hungry Hearts”: Life changes for a young couple after their son is born. Adam Driver stars. \n“Peaky Blinders”: Head of the Birmingham gang looks to become more powerful. \n“Transformers: Robots in Disguise”: Bumblebee steps up to be the new leader. \n“Ben Collins: Stunt Driver”: The driver known as The Stig searches for the ultimate stunt car. \n“Paper Towns”: Young woman loves mysteries so much, she becomes one. Based on the novel by John Green. \n“Mr. Warmth Don Rickles: The Ultimate TV Collection”: Includes the comedians TV appearances, plus 37 episodes of “CPO Sharkey.” \n“Beyond Paradise”: Talented music student haunted by a tragic past flees Iran. Ryan Guzman stars. \n“Bubble Guppies: The Puppy and the Ring – Great Guppy Gift Set”: Follow the Bubble Guppies in Bubbledom. \n“The Larry Fessenden Collection”: Includes four films from the indie horror film director.", "external_links": [], "published": "2015-10-22T10:00:00.000+03:00", "crawled": "2015-10-22T12:12:05.286+03:00", "highlightTitle": ""}