{"organizations": [], "uuid": "cf7fe8c3c5fdf764c209a4db1e17ca266eb8f846", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prestwichandwhitefieldguide.co.uk", "main_image": "http://www.prestwichandwhitefieldguide.co.uk/resources/images/4288876/", "site_section": "http://www.prestwichandwhitefieldguide.co.uk/uk_national_entertainment/rss/", "section_title": "Prestwich and Whitefield Guide | National Entertainment News", "url": "http://www.prestwichandwhitefieldguide.co.uk/uk_national_entertainment/13801310.Buffy_star_Anthony_Head_wants_fans_of_the_US_drama_to_see_his_play_Ticking/?ref=rss", "country": "GB", "title": "Buffy star Anthony Head wants fans of the US drama to see his play Ticking", "performance_score": 0, "site": "prestwichandwhitefieldguide.co.uk", "participants_count": 0, "title_full": "Buffy star Anthony Head wants fans of the US drama to see his play Ticking", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T02:11:00.000+03:00", "replies_count": 0, "uuid": "cf7fe8c3c5fdf764c209a4db1e17ca266eb8f846"}, "author": "", "url": "http://www.prestwichandwhitefieldguide.co.uk/uk_national_entertainment/13801310.Buffy_star_Anthony_Head_wants_fans_of_the_US_drama_to_see_his_play_Ticking/?ref=rss", "ord_in_thread": 0, "title": "Buffy star Anthony Head wants fans of the US drama to see his play Ticking", "locations": ["US"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Anthony Head", "Buffy"], "text": "Buffy star Anthony Head wants fans of the US drama to see his play Ticking Buffy star Anthony Head wants fans of the US drama to see his play Ticking \nPress Association 2014 / / National Entertainment News Share \nBuffy the Vampire Slayer star Anthony Head has said fans of the cult US series “would approve” of his forthcoming play, Ticking. \nThe stage debut of Bafta-nominated TV writer and director Paul Andrew Williams, Ticking revolves around Simon (The Game’s Tom Hughes), a young British man in deep trouble. He is awaiting execution in a Chinese prison cell after being convicted of murder. Anthony Head as David Whele in Dominion (NBC Universal) \nDuring a final visiting hour with his parents, Simon must decide whether to confront a secret from his past with his father (played by Anthony), all the while mindful of his mother (Heartbeat’s Niamh Cusack). \n“It’s a cracking script and I am script-driven,” Anthony said. “It’s a really good read and it’s turning into a really good watch. Buffy fans would approve.” \nThe 1997-2003 role of Rupert Giles, the Watcher and father figure of Sarah Michelle Gellar’s vampire slayer Buffy Summers, gave Anthony a new generation of fans on both sides of the Atlantic. \nWhen asked how Ticking would particularly appeal to Buffy aficionados, he explained: “This play is about a young man, on death row in possibly his last night in a prison that’s under one of those closed-door regimes in Asia and you’re thinking: ‘how do you sell that?’ but it’s funny. It’s really funny.” Promoted stories \nThe 61-year-old is busy playing villain David Whele in hit Syfy series Dominion, which is made in the US, but he couldn’t resist Ticking. \n“I love to do theatre when I can,” he stated. “Trouble is, usually, it’s very difficult to fit it in so I pick my projects very specifically and this was one of those plays where I just had to say yes.” \nMoving from an American TV series to the stage with a first-time playwright certainly underlines his versatility. “I’ve worked really hard not to be pigeon-holed,” he acknowledged. “As far as I know, people still don’t know who I am. It’s great. Long may it remain so. \n“I get a lot of recognition, but I keep people guessing as to what I’ll do next: Little Britain, The Iron Lady and Manchild and Doctor Who – that was cracking! I loved that.” Little Britain stars David Walliams, Anthony Head and Matt Lucas. (Ian West/PA) \nThe Londoner is perfectly at ease with his television career, but is happy to be back on the stage. “If a play is good, the word gets around. Ticking is sort of like a thriller because there is a very definite whodunnit element in there: did he commit the crime or not? Is he innocent or not? And it’s cracking.” \nWarming to his theme, he added: “Unfortunately, these days, movies have as fast a turnaround as TV. The thing about stage is that you get to play with it. On TV: you do, four or five takes or something like that. But in a play, it can change depending on the reaction of the audience.” \nFamously, Anthony’s big break came when he starred in a long-running advertising campaign alongside Holby City’s Sharon Maughan as the Nescafe Gold Blend couple. The nation became hooked on the will they? / won’t they? story which ran from 1987-1993. \nThis may be a golden age of television, but Anthony can’t help looking back. \n“I used to love the old days when a show would come out and people would see you on the street the next day and say: ‘I saw you on that programme last night. I loved that!’ That’s gone, to a certain extent. People still come up, but it’s usually now: ‘I loved that thing you did a while ago’.” Anthony Head and his actress daughters Emily, left, and Daisy, right, in London (Yok Mui/PA) \nBut the genial actor is looking forward to working with Joss Whedon again at some point in the future and he isn’t ruling out a Buffy reunion. “It was rumoured that there would be a movie without Joss, but that’s an appalling idea,” he said. “I think it’s been put to bed. I’d love to work with Joss again.” Share article \nTicking opens Tuesday October 6 at London’s Trafalgar Studios. Promoted Stories", "external_links": [], "published": "2015-10-03T02:11:00.000+03:00", "crawled": "2015-10-03T15:21:15.863+03:00", "highlightTitle": ""}