{"organizations": [], "uuid": "038808d7581f999d85cff7beada91c5f6c7e2f57", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48524/entertainment", "section_title": "Entertainment - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30266048/majority-of-americans-and-7-in-10-cardholders-happy-with-their-local-library", "country": "US", "title": "Majority of Americans - and 7 in 10 Cardholders - Happy with their Local Library", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Majority of Americans - and 7 in 10 Cardholders - Happy with their Local Library - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "038808d7581f999d85cff7beada91c5f6c7e2f57"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30266048/majority-of-americans-and-7-in-10-cardholders-happy-with-their-local-library", "ord_in_thread": 0, "title": "Majority of Americans - and 7 in 10 Cardholders - Happy with their Local Library", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " The Harris Poll\nStrong majority of Americans believe libraries need to go digital to stay relevant\nNEW YORK , Oct. 15, 2015 /PRNewswire/ -- As next week marks \"National Friends of Libraries\" week ( October 18-24 ), it's particularly good news that over half (55%) of Americans are extremely or very satisfied with their local library. Satisfaction is especially high (as one might hope) among those with a library card (70%), but that's not to say Americans don't have any recommendations to improve library services.\nWhile reading a book used to mean turning a page, for many it now means swiping a screen, and a vast majority of Americans (81%) say libraries need to offer digital content to stay relevant. This belief is particularly strong among Baby Boomers and Gen Xers (86% & 83% vs. 75% Millennials & 77% Matures).\nThese are some of the results of The Harris Poll® of 2,212 U.S. adults surveyed online between August 12 – 17, 2015. Full results of this study, including data tables, can be found here .\nGoing digital\nLibraries are responding with a variety of digital offerings, but just how many Americans are making use of them? Over two thirds of Americans (68%) believe all of a library's content should be available online to borrow digitally. When library cardholders are asked about the products their libraries offer, majorities say they can borrow digital audio books (66%; with 18% using/borrowing) and eBooks (63%; with 23% using/borrowing). Fewer say they can borrow magazines (42%; with 9% using/borrowing), music (37%; with 10% using/borrowing) and movies/shows (36%; with 10% using/borrowing) digitally.\nMen are more than twice as likely as women to have used or borrowed digital movies/shows (14% vs. 7%), music (14% vs. 6%), and magazines (13% vs. 5%) from their local library. Those with children in the household are more likely than those without to have borrowed each type of digital product tested. Meanwhile, large percentages of cardholders (ranging from 29% for digital audio books to 53% for both digital music and movies/shows) indicate they're not sure if their library offers each of these items digitally, while few explicitly state their library is lacking each (ranging from 5% for digital audio books to 10% for both digital music and movies/shows).\nDesires of the digitally deprived\nDigitally deprived cardholders (those who say their library doesn't offer the aforementioned digital products) are most interested in their library offering digital or streaming movies/show (43%) and eBooks (39%), followed by digital magazines (33%), streaming music (30%), and audio books (30%).\nMillennials and Gen Xers without current access are more likely than both Baby Boomers and Matures to show interest in digital or streaming movies/shows (59% & 50% vs. 32% & 15%) and music (46% & 36% vs. 19% & 9%). Among those saying their libraries lack these digital offerings, those with children under 18 at home are more interested in each digital product compared to those without: Digital or streaming movies/shows: 58% vs. 36% eBooks: 48% vs. 35% Digital magazines: 42% vs. 29% Digital or streaming music: 43% vs. 24% Digital audio books: 42% vs. 25% Library usage\nOver six in ten (63%) Americans say they have a library card (consistent with 2014's 64%), and these cardholders do tend to have some key demographic attributes:\nWomen are more likely than men are to have a library card (67% vs. 58%). Library cards more prevalent among those who have completed higher levels of education (77% post grad, 68% college grad, 63% some college & 56% H.S. or less). Perhaps not surprisingly, those in households with children are more likely to have a card compared to adults in childless households (68% vs. 60%). Eight in ten cardholders have visited the library or used its services at least once in the past year (81%, up marginally from 78% in 2014). When asked the top reasons – from a provided list – for using the library over the past year, borrowing books (54%) is at the top of the list, followed distantly by borrowing DVDs/videos (22%). Just over one in ten indicate they've gone in order to connect to the Internet with a library computer (12%).\nBut clearly libraries are about a lot more that what people can get from them: a vast majority of Americans (89%) agree that no matter how much content is available digitally, local libraries will always be an important community resource.\nTo see other recent Harris Polls, please visit our new website, TheHarrisPoll.com .\nWant Harris Polls delivered direct to your inbox? Click here !\nMethodology\nThis Harris Poll was conducted online, in English, within the United States between August 12 and 17, 2015 among 2,212 adults (aged 18 and over). Figures for age, sex, race/ethnicity, education, region and household income were weighted where necessary to bring them into line with their actual proportions in the population. Propensity score weighting was also used to adjust for respondents' propensity to be online.\nAll sample surveys and polls, whether or not they use probability sampling, are subject to multiple sources of error which are most often not possible to quantify or estimate, including sampling error, coverage error, error associated with nonresponse, error associated with question wording and response options, and post-survey weighting and adjustments. Therefore, The Harris Poll avoids the words \"margin of error\" as they are misleading. All that can be calculated are different possible sampling errors with different probabilities for pure, unweighted, random samples with 100% response rates. These are only theoretical because no published polls come close to this ideal.\nRespondents for this survey were selected from among those who have agreed to participate in Harris Poll surveys. The data have been weighted to reflect the composition of the adult population. Because the sample is based on those who agreed to participate in our panel, no estimates of theoretical sampling error can be calculated.\nThese statements conform to the principles of disclosure of the National Council on Public Polls.\nThe results of this Harris Poll may not be used in advertising, marketing or promotion without the prior written permission of The Harris Poll.\nProduct and brand names are trademarks or registered trademarks of their respective owners.\nThe Harris Poll ® #64, October 15, 2015\nBy Allyssa Birth , Senior Research Analyst, The Harris Poll\nAbout The Harris Poll®\nBegun in 1963, The Harris Poll is one of the longest running surveys measuring public opinion in the U.S. and is highly regarded throughout the world. The nationally representative polls, conducted primarily online, measure the knowledge, opinions, behaviors and motivations of the general public. New and trended polls on a wide variety of subjects including politics, the economy, healthcare, foreign affairs, science and technology, sports and entertainment, and lifestyles are published weekly. For more information, or to see other recent polls, please visit our new website, TheHarrisPoll.com .\nPress Contact:\nCorporate Communications\nThe Harris Poll\n585-272-8400\nPress.TheHarrisPoll@Nielsen.com\nLogo - http://photos.prnewswire.com/prnh/20100517/NY06256LOGO\n releases/majority-of-americans--and-7-in-10-cardholders--happy-with-their-local-library-300160064.html\n ", "external_links": ["http://photos.prnewswire.com/prnh/20100517/NY06256LOGO", "http://photos.prnewswire.com/prnvar/20100517/NY06256LOGO", "http://www.xmlnews.org/ns/", "http://rt.prnewswire.com/rt.gif?NewsItemId=NY28271&Transmission_Id=201510150505PR_NEWS_USPR_____NY28271&DateId=20151015", "http://www.theharrispoll.com/health-and-life/Americans-Happy-with-Local-Library.html", "http://www.theharrispoll.com/", "http://www.prnewswire.com/news-releases/majority-of-americans--and-7-in-10-cardholders--happy-with-their-local-library-300160064.html"], "published": "2015-10-15T03:00:00.000+03:00", "crawled": "2015-10-15T12:46:12.635+03:00", "highlightTitle": ""}