{"organizations": [], "uuid": "a8bfe6ec7fd71295c5914dd179b94fc7fea87148", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://www.canberratimes.com.au/content/dam/images/g/j/s/8/f/k/image.related.socialLead.620x349.gk15dx.png/1444002159436.jpg", "site_section": "http://feeds.canberratimes.com.au/rssheadlines/entertainment.xml#", "section_title": "Canberra Times Entertainment Headlines", "url": "http://www.canberratimes.com.au/act-news/canberra-life/soul-of-fire-by-susanne-f-wolf-at-the-street-theatre-20151004-gk15dx", "country": "AU", "title": "Soul of Fire by Susanne F. Wolf at the Street Theatre", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "Soul of Fire by Susanne F. Wolf at the Street Theatre", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T02:42:00.000+03:00", "replies_count": 0, "uuid": "a8bfe6ec7fd71295c5914dd179b94fc7fea87148"}, "author": "Alanna Maclean", "url": "http://www.canberratimes.com.au/act-news/canberra-life/soul-of-fire-by-susanne-f-wolf-at-the-street-theatre-20151004-gk15dx", "ord_in_thread": 0, "title": "Soul of Fire by Susanne F. Wolf at the Street Theatre", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Maxi Blaha as Bertha von Suttner in \"Soul of Fire\". Photo: Peter Rigaud \nSoul of Fire . By Susanne F. Wolf. Directed by Alexander Hauer. The Street in association with the Austrian Embassy, Australia. The Street Theatre. Ended October 4.\nSoul of Fire is an elegant little play that gently and economically recreates the life and spirit of Bertha von Suttner, peace activist, writer and, in 1905, the first woman to win the Nobel Peace Prize.\nAustrian actress Maxi Blaha brings a restless intelligence to the role. On a rich carpet square with a couple of old-fashioned chairs, one for her and one for unobtrusive but evocative guitar accompanist Georg Buxhofer​ she appears in a dress with a fabulously long and heavy 19th-century train. Later in the piece she reverts to contemporary black pants and blouse, but that train becomes an image for the constraints of the times on women.\nMaxi Blaha and Georg Buxhofer (with guitar) in \"Soul of Fire\". Photo: Peter Rigaud \nNot quite aristocratic enough to marry \"well\", not quite capable of the singing career she pursues for a while, and saddled with relatives inclined to be feckless with what money there is, she eventually finds herself a teacher and companion to the Suttner family's four daughters. However, when she falls in love with the son of the family, seven years her junior they send her to Paris to be the secretary of Alfred Nobel.\nAdvertisement That does not last long and she soon runs off with the son to a teaching and writing exile in the Caucasus, but the exchange of ideas with Nobel, inventor of dynamite and ironically the founder of the Nobel Peace Prize, is clearly one that is important to the development of her pacifist thinking and activities. And she also has a powerful effect on what he does with his wealth in his will.\nBlaha is convincing as a woman of her times, limited in access to formal education and political rights, but able through the chances of her life (and dare it be said, the authority of her social class) to advocate publicly for peace. She dies just before the outbreak of World War I, which is only the extreme intensification of many simmering conflicts. She hands out a pamphlet to the audience that makes it clear she foresees a massive conflict. Why not, she says, simply lay down your arms? Who really wants war? Who speaks up for peace?\nThe effect on an audience with 100 more years of violent history to factor in could very well be depressing. But Blaha's intense and persuasive performance makes it clear that peace activism continues and must continue. This is emotional and political life scripted and performed with feeling and understanding.", "external_links": [], "published": "2015-10-05T02:42:00.000+03:00", "crawled": "2015-10-05T06:19:09.899+03:00", "highlightTitle": ""}