{"organizations": [], "uuid": "0d21bb60197e94db126486010eb39b34c304d581", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.arcamax.com", "main_image": "http://www.arcamax.com/apple-touch-icon.png", "site_section": "http://www.arcamax.com/entertainment/", "section_title": "Entertainment | ArcaMax Publishing", "url": "http://www.arcamax.com/entertainment/entertainmenttoday/s-1731816?fs", "country": "US", "title": "Movie review: 'A Brilliant Young Mind' is a wonderful, fresh tale | Entertainment News", "performance_score": 0, "site": "arcamax.com", "participants_count": 1, "title_full": "Movie review: 'A Brilliant Young Mind' is a wonderful, fresh tale | Entertainment News | ArcaMax Publishing", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "0d21bb60197e94db126486010eb39b34c304d581"}, "author": "arcamax.com", "url": "http://www.arcamax.com/entertainment/entertainmenttoday/s-1731816?fs", "ord_in_thread": 0, "title": "Movie review: 'A Brilliant Young Mind' is a wonderful, fresh tale | Entertainment News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A classy comedy-drama in overdrive, \"A Brilliant Young Mind\" gets seriouser and seriouser even as it grows funnier and funnier. It is a fully realized love story of rare spirit, the sort of deeply affecting film that can make you laugh until you are near tears, then drive you close to bawling.\nAsa Butterfield, growing up by leaps since his roles in \"Hugo\" and \"Ender's Game,\" stars as Nathan, a British math savant with autism spectrum disorder. Like a teenage Alan Turing, he has severely impaired social skills. He sees life as a differential equation. With enough informational nuggets, Nathan believes he can understand the puzzling people all around him. He digs into the big questions of human existence, getting lost as he tries to add up the answers.\nThe ever-awesome Sally Hawkins plays his mother, caring for her odd, sometimes embarrassing son with endless acceptance and unrequited love. She cares for him with an almost religious fanaticism. At dinnertime she makes sure his favorite Chinese takeout has seven shrimp, not eight, because the presence of a non-prime number would drive him bonkers. The film presents Nathan's complex character as a fiercely intellectual newcomer to our planet, frustrated by its irrational tendencies. Like the way people his age create gently romantic bonds with one another.\nFate being even less predictable than human behavior, that is a situation he will soon be facing, like it or not. The prodigy is on the verge of joining Britain's top math students for the International Mathematics Olympiad competition. The other participants include more than one girl who finds this attractive oddball quite fetching. Nathan isn't entirely disinterested, just shy, emotionally reserved and inexperienced. He wouldn't hate giving and receiving love, provided he could understand the structure of the relationship.\nTraveling with his fellow entrants to megamodern Taiwan, Nathan enters a puzzling environment entirely detached from his suburban English home. As he's introduced to this brave new world, the camerawork draws in endless odd images, giving us a feeling of befuddled curiosity that must be close to what Nathan experiences every day. When he meets the charming Chinese math whiz Zhang Mei (Jo Yang), we watch him beginning to get a grasp of how the rest of us live.\nThis is utterly original, fiercely intelligent filmmaking. Director Morgan Matthews can make the laughable absurdity of Nathan's worldview slide over to sadness and back again like the swinging pendulum of an heirloom grandfather clock. His cast is entirely top-drawer. Rafe Spall is delightfully irritating as Nathan's longtime math instructor, a man with a wheelbarrow full of troubles himself. Eddie Marsan, playing the leader of the math competitors as they near the showdown, delivers every thigh-slapping line of dialogue as cleanly as if he were sinking a one-inch putt.\nEvery character onscreen is presented with honest affection and tender pity. Every figure here has a rich private back story. Each one faces interesting and important questions, moving off long before we're ready to see them go. It's a clever structural choice that makes the young protagonist's anxieties about loss and isolation feel all the more excruciating.\nFunded in part by the BBC, \"A Brilliant Young Mind\" is not a movie that was made because it was commercially promising, but because it tells a fresh tale wonderfully. It is not the sort of movie you see often, but once you see it, it's very hard to forget.\n'A BRILLIANT YOUNG MIND'\n3.5 out of 4 stars\nUnrated: Mature subject matter and brief violence. In English and subtitled Mandarin.\n(c)2015 Star Tribune (Minneapolis)\nVisit the Star Tribune (Minneapolis) at www.startribune.com\nDistributed by Tribune Content Agency, LLC.\nShare Comment", "external_links": ["http://www.facebook.com/sharer.php?u=http://www.arcamax.com/entertainment/entertainmenttoday/s-1731816&h=Movie+review%3A+%27A+Brilliant+Young+Mind%27+is+a+wonderful%2C+fresh+tale", "http://twitter.com/share?url=http://www.arcamax.com/entertainment/entertainmenttoday/s-1731816&hashtags=ArcaMax", "https://plus.google.com/share?url=http://www.arcamax.com/entertainment/entertainmenttoday/s-1731816"], "published": "2015-10-02T03:00:00.000+03:00", "crawled": "2015-10-03T12:39:52.161+03:00", "highlightTitle": ""}