{"organizations": [], "uuid": "96f104a1a326df76b35b5ff0e5d5650741614df0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.arcamax.com", "main_image": "http://www.arcamax.com/apple-touch-icon.png", "site_section": "http://www.arcamax.com/entertainment/", "section_title": "Entertainment | ArcaMax Publishing", "url": "http://www.arcamax.com/entertainment/entertainmenttoday/s-1735868?fs", "country": "US", "title": "TV review: No sophomore slump for 'Fargo' | Entertainment News", "performance_score": 0, "site": "arcamax.com", "participants_count": 1, "title_full": "TV review: No sophomore slump for 'Fargo' | Entertainment News | ArcaMax Publishing", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T03:00:00.000+03:00", "replies_count": 0, "uuid": "96f104a1a326df76b35b5ff0e5d5650741614df0"}, "author": "arcamax.com", "url": "http://www.arcamax.com/entertainment/entertainmenttoday/s-1735868?fs", "ord_in_thread": 0, "title": "TV review: No sophomore slump for 'Fargo' | Entertainment News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The suspicious cloud looming over the new installment of \"Fargo\" isn't the Coen brothers' 1996 cult classic or the drama's Emmy-winning first season. It's \"True Detective.\"\nThe HBO series that played a pivotal role in transforming Matthew McConaughey from \"Hee Haw\" hunk to brooding leading man toppled so quickly from its high perch in its second year that the shark it jumped died from excessive laughter.\nFortunately, \"Fargo\" doesn't take the same nosedive. In fact, creator Noah Hawley has managed to sustain a quirky sense of humor, Midwest moodiness and nervous tension with no indication that he's operating from the same playbook.\nThe new season, debuting Monday on FX, jumps back 27 years to 1979, a time where the good citizens of Luverne, Minn., are still reeling from Watergate and grousing over long lines at the gas pump. Future deputy Molly Solverson is just a kid looking up to her wholesome father, Lou (Patrick Wilson), a sheriff straight out of the Gary Cooper Training Academy who hasn't quite shaken off memories of the Vietnam War.\nHe's assigned a head-scratching murder in a local diner and the disappearance of a mobster's son, inadvertently run over by a bored hairdresser (Kirsten Dunst) who would be a budding feminist if she weren't so obsessed with becoming a Hollywood starlet.\nAlso searching for the young gangster: a Kansas City syndicate that wants to take over rural operations.\nThe chase is not nearly as fascinating as the characters, most notably officer Hank Larsson (Ted Danson, whose demeanor and accent are so Minnesotan you'd swear the actor spent his childhood summers fishing on Leech Lake) and hit man Mike Milligan (Bokeem Woodbine, cool as a cucumber soaked in a Bloody Mary).\n\"You're pretty unfriendly. But you're so polite about it,\" he tells Lou, the kind of smart Minnesota insult you'll never find in a Sven and Ole joke book.\nHawley once again fills his narrative with nods to the Coens' movie -- the hairdresser's husband puts a corpse through the meat grinder at his butcher shop -- and other cinematic classics. The relationship between acting crime boss Floyd Gerhardt (Jean Smart) and her hot-tempered son (Jeffrey Donovan) suggests \"The Godfather\" in overalls.\nThere are a lot of inexcusable trimmings, including obscure music choices ranging from arias to Western ballads, and numerous references to alien invasions, with one early episode winding down with an excerpt from \"The War of the Worlds.\" There's even an appearance or two from \"Dutch\" Reagan.\nWill any of this add up? Maybe, maybe not. But based on the first four episodes, there are plenty of reasons to load up the station wagon and head back to the promised land.\n(c)2015 Star Tribune (Minneapolis)\nVisit the Star Tribune (Minneapolis) at www.startribune.com\nDistributed by Tribune Content Agency, LLC.\nShare Comment", "external_links": ["http://www.facebook.com/sharer.php?u=http://www.arcamax.com/entertainment/entertainmenttoday/s-1735868&h=TV+review%3A+No+sophomore+slump+for+%27Fargo%27", "http://twitter.com/share?url=http://www.arcamax.com/entertainment/entertainmenttoday/s-1735868&hashtags=ArcaMax", "https://plus.google.com/share?url=http://www.arcamax.com/entertainment/entertainmenttoday/s-1735868"], "published": "2015-10-11T03:00:00.000+03:00", "crawled": "2015-10-12T01:22:25.118+03:00", "highlightTitle": ""}