{"organizations": ["Kareena Kapoor & Diljit Dosanjh Filming"], "uuid": "55a9e3839fc2604f1d87b68c36c4e03a1fc25d79", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.filmibeat.com", "main_image": "http://www.filmibeat.com/img/2015/10/26-1445803618-pics-kareena-kapoor-diljit-dosanjh-filming-bike-sequence-on-the-sets-of-udta-punjab.jpg", "site_section": "http://www.filmibeat.com/rss/filmibeat-bollywood-fb.xml", "section_title": "Oneindia.in - Entertainment Bollywood", "url": "http://www.filmibeat.com/bollywood/news/2015/pics-kareena-kapoor-diljit-dosanjh-filming-bike-sequence-on-the-sets-of-udta-punjab-202941.html", "country": "CA", "title": "NEW PICS! Kareena Kapoor & Diljit Dosanjh Filming Bike Sequence On The Sets Of Udta Punjab!", "performance_score": 0, "site": "filmibeat.com", "participants_count": 0, "title_full": "NEW PICS! Kareena Kapoor & Diljit Dosanjh Filming Bike Sequence On The Sets Of Udta Punjab!", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T22:15:00.000+02:00", "replies_count": 0, "uuid": "55a9e3839fc2604f1d87b68c36c4e03a1fc25d79"}, "author": "", "url": "http://www.filmibeat.com/bollywood/news/2015/pics-kareena-kapoor-diljit-dosanjh-filming-bike-sequence-on-the-sets-of-udta-punjab-202941.html", "ord_in_thread": 0, "title": "NEW PICS! Kareena Kapoor & Diljit Dosanjh Filming Bike Sequence On The Sets Of Udta Punjab!", "locations": ["Udta Punjab"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted by: Swikriti Srivastava Published: Monday, October 26, 2015, 1:45 [IST] \nThe sizzling diva of Bollywood, Kareena Kapoor Khan and Punjabi sensation, Diljit Dosanjh recently spotted on the sets of their upcoming film, Udta Punjab , while filming bike sequence for the film and we gotta say, Kareena is looking very promising in these leaked pictures.In the pictures, you can see Kareena sporting her desi girl look in a simple kurti-patiala combo sans makeup paired with a cardigan over it! \nWhereas, along with Kareena one can also her co-star Diljit, who is standing beside Kareena Kapoor and seems like the duo is filming one of the intense scenes of the film. Shaandaar Saturday (3 Days) Box Office Collection: Not So Shaandaar! Udta Punjab , which is being directed by Abhishek Chaubey is continuously in tremendous buzz since its star cast has been announced, which also includes Shahid Kapoor and Alia Bhatt .The film is slated to be released on next year i.e. 2016. Check out the leaked pictures of Kareena Kapoor straight from the sets of Udta Punjab here! PICS: Kareena-Diljit Spotted On The Sets Of Udta Punjab! 1/7 Kareena-Diljit \nThe sizzling diva of Bollywood, Kareena Kapoor Khan and Punjabi sensation, Diljit Dosanjh recently spotted on the sets of their upcoming film, Udta Punjab. PICS: Kareena-Diljit Spotted On The Sets Of Udta Punjab! 2/7 Kareena Sporting Desi Look \nKareena sporting her desi girl look in a simple kurti-patiala combo sans makeup paired with a cardigan over it! PICS: Kareena-Diljit Spotted On The Sets Of Udta Punjab! 3/7 Filming Bike Sequence \nThe duo (Kareena & Dijit) can be seen filming bike sequence and seems like Bebo facing some problems while trying to start the bike. PICS: Kareena-Diljit Spotted On The Sets Of Udta Punjab! 4/7 Clicked By Shutterbugs \nKareena being clicked by some shutterbugs on the sets of Udta Punjab, along with her co-star Diljit. PICS: Kareena-Diljit Spotted On The Sets Of Udta Punjab! 5/7 Kareena As A Doctor \nReportedly, Kareena Kapoor will be playing the role of a doctor in Udta Punjab and apparently, the role will be quite an intense one. PICS: Kareena-Diljit Spotted On The Sets Of Udta Punjab! 6/7 Stay Tuned \nThe film is slated to be released on next year i.e. 2016. Stay tuned for more updates. You might like", "external_links": [], "published": "2015-10-25T22:15:00.000+02:00", "crawled": "2015-10-26T04:10:40.502+02:00", "highlightTitle": ""}