{"organizations": [], "uuid": "99efb4d21217335226618ee372f2af322ff07724", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-56129e65/turbine/ct-lyric-cinderella-review-ent-1006-20151005", "site_section": "http://www.chicagotribune.com/entertainment/rss2.0.xml", "section_title": "Arts &amp; Entertainment - Chicago Tribune", "url": "http://www.chicagotribune.com/entertainment/music/vonrhein/ct-lyric-cinderella-review-ent-1006-20151005-column.html", "country": "US", "title": "Review: Wit, whimsy, vocal fireworks make Lyric's 'Cinderella' soar", "performance_score": 0, "site": "chicagotribune.com", "participants_count": 1, "title_full": "Review: Wit, whimsy, vocal fireworks make Lyric's 'Cinderella' soar", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T19:44:00.000+03:00", "replies_count": 0, "uuid": "99efb4d21217335226618ee372f2af322ff07724"}, "author": "John von Rhein", "url": "http://www.chicagotribune.com/entertainment/music/vonrhein/ct-lyric-cinderella-review-ent-1006-20151005-column.html", "ord_in_thread": 0, "title": "Review: Wit, whimsy, vocal fireworks make Lyric's 'Cinderella' soar", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The 2014 Tony Award-winning musical \"A Gentleman's Guide to Love & Murder\" opened its national tour in Chicago this week. So in honor of its arrival, and with a nod to the gender-parity imperative, let me offer a gentleperson's guide to the first wave of autumnal theater openings in the Chicago... \nThe 2014 Tony Award-winning musical \"A Gentleman's Guide to Love & Murder\" opened its national tour in Chicago this week. So in honor of its arrival, and with a nod to the gender-parity imperative, let me offer a gentleperson's guide to the first wave of autumnal theater openings in the Chicago... (Chris Jones) \nAnd since this \"Cinderella\" is an elaborate amalgam of surreal dream and sober reality, the singers, dancers, conductor, orchestra and chorus must walk a tightrope between childlike naivete and adult sophistication. They all do so marvelously, thanks to the deftness with which Font orchestrates the action and the clarity, rhythmic verve and buoyancy Davis brings to his first \"Cenerentola,\" a few ragged orchestral entrances notwithstanding. \nDid I mention the sextet of human-sized rats? These adorable rodents serve various functions as confidants, stagehands and onlookers, their scurrying cleverly synchronized with the music to which it provides nifty visual counterpoint. With their cone-shaped snouts and large pink tails, the cartoon rats are great fun to watch and nimbly fill the dramatic black holes in the action. The costumes and clean-lined unit set were designed by Joan Guillen, the choreography by Xevi Dorca, with fluid lighting by Albert Faura that spirits the audience between Don Magnifico's sparse abode and the opulent palace of the prince. \nWith Leonard and Brownlee, two of today's finest young Rossini singers, as the scullery-maid-turned-royal-bride and the prince who instantly adores her, the show's visual delights found their ideal vocal complement. \nLeonard, so appealing as Rosina in Lyric's 2013-14 Rossini \"Barber of Seville,\" was even more appealing as Angelina. The mezzo has the vocal and physical beauty, the natural stage charisma, the sure dramatic instincts, to win all hearts from the outset. She also commands the coloratura agility, flexibility and precision to satisfy the role's stiff technical demands and graceful bel canto lines. \nRossini does his rags-to-riches heroine no favors by placing her florid showpiece, \"Non piu mesta,\" at the end of a long, vocally taxing opera. But Leonard sailed through the tricky roulades, runs and other embellishments with grace and aplomb, making Angelina's joy at being united with her prince palpable in every ornate flourish. \nBrownlee also scored a triumph in this, his belated Lyric debut. Like Leonard, he has real stage presence and he sings Rossini as to the manner born. His light lyric tenor, bright of timbre and absolutely secure in his dizzying flights into the coloratura heavens, shone in the capstone Act 2 aria in which Ramiro launches his search for the unknown beauty (Angelina, of course) he met at the ball. How many tenors have you heard who can nail high Cs, and above, without resorting to falsetto? Brownlee can, and did so resplendently, bringing down the house. \nPriante, another Lyric debut, displayed a full, admirable Rossini baritone and choice comedic moves as he flounced his way through Dandini's foppish masquerade. The veteran buffo bass Corbelli missed not a trick, vocally or histrionically, in his idiomatic portrayal of the grasping Magnifico. Soprano Diana Newman and mezzo Annie Rosen, first-year Ryan Opera Center members of bright promise, had a ball with the comic shtick the director gave the silly stepsisters. Van Horn brought due agility and thrust to Alidoro's wide-ranging aria. \nThe male choristers, prepared by chorus master Michael Black, managed to sing well and bring off their soft-shoe routines at the same time. Numerous minor cuts were observed, bringing the show in at 3 ¼ hours, with one intermission. Together with Mozart's \"Marriage of Figaro,\" comedy rules the Ardis Krainik Theatre throughout this opening month of the Lyric season. \n4 stars \nLyric Opera's production of Rossini's \"La Cenerentola\" plays through Oct. 30 at the Civic Opera House, 20 N. Wacker Drive; $34-$239; 312-827-5600, lyricopera.org. \nJohn von Rhein is a Tribune critic.", "external_links": [], "published": "2015-10-05T19:44:00.000+03:00", "crawled": "2015-10-05T21:53:47.280+03:00", "highlightTitle": ""}