{"organizations": [], "uuid": "a2f280c0fbe8bfc8f26be06e09c45bd3ed67f5aa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bbc.co.uk", "main_image": "http://ichef-1.bbci.co.uk/news/1024/cpsprodpb/16879/production/_86218229_86218228.jpg", "site_section": "http://news.bbc.co.uk/rss/newsonline_uk_edition/entertainment/rss.xml", "section_title": "BBC News - Entertainment & Arts", "url": "http://www.bbc.co.uk/news/entertainment-arts-34579451", "country": "GB", "title": "Frenzied reaction to Star Wars trailer", "performance_score": 6, "site": "bbc.co.uk", "participants_count": 0, "title_full": "Frenzied reaction to Star Wars trailer", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T11:06:00.000+03:00", "replies_count": 0, "uuid": "a2f280c0fbe8bfc8f26be06e09c45bd3ed67f5aa"}, "author": "", "url": "http://www.bbc.co.uk/news/entertainment-arts-34579451", "ord_in_thread": 0, "title": "Frenzied reaction to Star Wars trailer", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Star Wars: The Force Awakens: Frenzied social media reaction to trailer 20 October 2015 From the section Entertainment & Arts Image copyright DISNEY/LUCASFILM Image caption The film is set for released this Christmas The final trailer for Star Wars: The Force Awakens has debuted online and has been met with considerable acclaim. \nThe film, the seventh in the series, reunites original stars Harrison Ford, Carrie Fisher and Mark Hamill. They are joined by British newcomers Daisy Ridley and John Boyega. \nWith Star Wars trending on Twitter, one user wrote : \"Not been this excited about a movie in a long time!\" \nThe film is released in the UK on 17 December. \nBBC Entertainment Live: News updates \nThe new trailer gives little away to the plot of the movie but the central character appears to be Rey - played by Ridley who, it's been speculated, is the daughter of Ford and Fisher - both seen in character as Han Solo and Princess Leia. Image copyright DISNEY/LUCASFILM Image caption Daisy Ridley is the main character Rey, thought to be the daughter of Han Solo and Princess Leia \nDirected by JJ Abrams, the film picks up three decades after the events of Return of the Jedi, released in 1983. \nThe new villain of the movie, Kylo Ren - played by Girls star Adam Driver - also features in the trailer as he appears to address the misshapen mask of the trilogy's original antagonist Darth Vader. \n\"Nothing will stand in our way,\" he growls. \"I will finish what you started.\" Trailer analysis by Lizo Mzimba, entertainment correspondent \nPerhaps the most significant thing about the final trailer before the film's release is how little of the story it reveals. So many trailers give away huge chunks of plot, but wisely the Star Wars team appear to have decided that with awareness of the movie running so high, secrecy and curiosity about how the Star Wars saga continues is the best way of drawing in audiences. \nSo there's only a sprinkling of dialogue over images which range from sights like the Millennium Falcon to action involving newcomers Daisy Ridley and John Boyega. \nAdditionally fans have commented on how little is seen of the central character from the original trilogy Luke Skywalker and what this might mean for this story. Mention should also be made of one of the most important characters in the Star Wars universe - composer John Williams's music, which as well as giving the trailer an epic feel, also makes it feel new and exciting but still familiar. \nWriting a review of the trailer in the Telegraph , Robbie Collins called the two-and a half minute long promo \"a perfect blend of old and new, in keeping with the old-fashioned Star Wars aesthetic\". Image copyright DISNEY/LUCASFILM Image caption Harrison Ford returns as space smuggler Han Solo \nHe added: \"There's something perversely impressive about the fact that, after three trailers and a behind-the-scenes featurette, director JJ Abrams has still let almost nothing slip about what actually happens in his movie.\" \nA tearful Ridley shared her reaction to the trailer on Instagram , writing: \"Staying in a little b'n'b with my friend... Set an alarm to watch the trailer... My friend filmed my reaction. Totally emotional seeing it for the first time and so, so, so incredibly awed to be part of this incredible legacy.\" \nUSA Today said : \"This trailer more than the two previous ones is hitting hard on the emotion and history involved with this universe.\" Image copyright DISNEY/LUCASFILM Image caption Kylo Ren, played by Girls' Adam Driver is the film's primary antagonist \nLiam Jackson said on Twitter : \"I'm so freaking excited for this! What an awesome trailer!\" \nLauren agreed in her posting : \"Was brought up on Star Wars and did love it. But after last three films, went straight off them. Think Force Awakens is making me love it again!\"", "external_links": [], "published": "2015-10-20T11:06:00.000+03:00", "crawled": "2015-10-20T13:00:57.025+03:00", "highlightTitle": ""}