{"organizations": ["Performing Arts Coalition", "The Salt Lake Tribune", "Theatre Company", "Utah Department of Heritage", "Utah Arts and Museums", "Salt Lake Tribune First Published", "Rose Wagner Performing Arts Center", "International Piano Competition"], "uuid": "71c3e7122d3ed3e6c45ea18bce4202f091401bd1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sltrib.com", "main_image": "http://www.sltrib.com/csp/mediapool/sites/shared/assets/img/tribune1200x630.jpg", "site_section": "http://www.sltrib.com/rss/feed/?sec=/Entertainment/&level=0", "section_title": "Entertainment - The Salt Lake Tribune", "url": "http://www.sltrib.com/entertainment/3058468-155/arts-producers-call-on-utah-governor", "country": "US", "title": "Arts producers call on Utah governor to appoint arts-experienced leader", "performance_score": 0, "site": "sltrib.com", "participants_count": 0, "title_full": "Arts producers call on Utah governor to appoint arts-experienced leader", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T23:00:00.000+03:00", "replies_count": 0, "uuid": "71c3e7122d3ed3e6c45ea18bce4202f091401bd1"}, "author": "", "url": "http://www.sltrib.com/entertainment/3058468-155/arts-producers-call-on-utah-governor", "ord_in_thread": 0, "title": "Arts producers call on Utah governor to appoint arts-experienced leader", "locations": ["Salt Lake County", "Utah"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Lynnette Hiskey", "Hiskey", "Herbert", "Pruyn", "Gary Herbert", "Stephen Brown", "Jena Woodbury", "Kary Billings", "Brown", "Geoffrey Fattah", "ELLEN FAGG WEIST", "Linda C. Smith", "Gina Bachauer", "Jerry Rapier", "Fisher", "Fattah", "Fran Pruyn", "Julie Fisher"], "text": "By ELLEN FAGG WEIST | The Salt Lake Tribune First Published 1 minute ago • Updated 1 minute ago Arts » Arts producers call on Herbert to appoint arts-experienced leader. Share This Article Six resident arts companies of the Rose Wagner Performing Arts Center have volunteered their professional expertise to help Gov. Gary Herbert hire the next division director of the Utah Arts and Museums. The arts producers sent a letter to Herbert's office and to the media. In the letter, which was published Oct. 12 in the Public Forum of The Salt Lake Tribune, the arts leaders expressed concern that the job description for the division director included \"scant mention of a background in arts and museums,\" and that the job post was advertised for less than three weeks. The application period for the position closed Sept. 30. VIDEOS Check out all the Trib TopJobs \"We're not necessarily privy to all the processes that are taking place,\" says Stephen Brown, founder of SB Dance and president of the Performing Arts Coalition of companies based at The Rose. \"We're just keeping our eye on things. We want to make sure that the voices of artists and arts organizations are being represented in this process.\" Brown added: \"We just want to make sure we get a really good new director, and that the selection process is of national caliber.\" The position was vacated by Lynnette Hiskey , who in August was asked to resign by her boss, Julie Fisher, a former state legislator appointed by Herbert in 2011 to head the Utah Department of Heritage and Arts. Fisher promoted Hiskey to head the division in 2013. Hiskey had served 11 years as the assistant director of the division, after previously managing Salt Lake County's Zoo, Arts and Parks program. It's important for the division director to advocate and communicate with the arts community, yet the main duty of the division head is managing a staff of nearly 20 people and overseeing a $3 million budget, said Geoffrey Fattah, communications director for the Utah Department of Heritage and Arts. \"First and foremost, we want someone who is an effective administrator and an effective leader,\" Fattah said. \"We do have a very healthy list of qualified candidates, and our selection committee is considering their experience with arts and museums.\" (See box for list of selection committee members.) The letter was signed by Brown and Fran Pruyn, of Pygmalion Theatre Company; Kary Billings, of Gina Bachauer International Piano Competition; Linda C. Smith, of Repertory Dance Theatre; Jerry Rapier, of Plan-B Theatre Company; and Jena Woodbury, of Ririe-Woodbury Dance Company. Among them, the group represents \"more than 200 years of producing, performing and contributing to the cultural landscape of Utah,\" the letter states, while the groups' combined programming reaches more than 50,000 Utahns annually. \"That appointment is very important because public monies from the state have to be funneled through that organization,\" Pruyn says. \"And they really, really have to understand what our needs are. That person isn't just a public appointee. It has to be somebody with some sort of professional, lifelong dedication to both the performing and the visual arts.\" Brown and Pruyn added that the division's peer-reviewed grants funding process has improved over the past years under Hiskey's leadership, \"and we want to make sure the process keeps progressing.\" The abrupt nature of Hiskey's removal from the job angered some artists and advocates , who in late August held a meeting at the state Capitol and presented a letter to the governor, urging him to restore funds to the arts and not to allow politics to replace arts experience in administering the division. Herbert's office released a statement on Sept. 1, lauding Fisher as a valued member of the governor's cabinet, saying that she has brought stability to the department. \"While there is always room for improvement, the arts will continue to remain a priority of the governor's administration,\" the statement said.", "external_links": [], "published": "2015-10-13T23:00:00.000+03:00", "crawled": "2015-10-13T22:02:18.182+03:00", "highlightTitle": ""}