{"organizations": [], "uuid": "cd9944436ed7880eeb2f7c58c4903ff11e91cc78", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mynews4.com", "main_image": "http://www.mynews4.com/media/lib/53/b/1/2/b122f07d-5023-4924-8518-2c5bd49c00fb/Original.jpg", "site_section": "http://www.mynews4.com/rss/3305.rss", "section_title": "KRNV Entertainment News", "url": "http://www.mynews4.com/content/entertainment/story/Khloe-Kardashian-scraps-book-tour-to-care-for/CCjvxdb4EUKVWjfz2PMIzg.cspx?rss=3305", "country": "US", "title": "Khloe Kardashian scraps book tour to care for Lamar Odom", "performance_score": 0, "site": "mynews4.com", "participants_count": 0, "title_full": "Khloe Kardashian scraps book tour to care for Lamar Odom", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T20:16:00.000+03:00", "replies_count": 0, "uuid": "cd9944436ed7880eeb2f7c58c4903ff11e91cc78"}, "author": "", "url": "http://www.mynews4.com/content/entertainment/story/Khloe-Kardashian-scraps-book-tour-to-care-for/CCjvxdb4EUKVWjfz2PMIzg.cspx?rss=3305", "ord_in_thread": 0, "title": "Khloe Kardashian scraps book tour to care for Lamar Odom", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Share Updated: 10:16 am \nKhloe Kardashian has cancelled plans to embark on a promotional tour for her upcoming book so she can remain by ailing husband Lamar Odom's side. \nThe \"Keeping Up With the Kardashians\" reality star was scheduled to hit the road to support the release of her self-help guide, \"Strong Looks Better Naked,\" on Nov. 3, but she has since pulled the plug on the trip, reports UsMagazine.com. \nKhloe has been a constant presence by Lamar's bedside ever since he was hospitalized in Las Vegas Oct. 13, after he was found unconscious at a brothel in nearby Crystal, Nevada. He woke up from a coma last week, and he has since been transferred to Los Angeles' Cedars-Sinai Medical Center for further treatment. \nThe former Los Angeles Lakers basketball player is said to be recovering after undergoing emergency surgery on Thursday to treat issues reportedly related to a bout of pneumonia. \n\"Lamar is in a very fragile state,\" a source told People.com. \"The infection, that is being aggressively treated with strong intravenous antibiotics, is unfortunately not getting better. There are many concerns about his health.\" \nThe latest health crisis occurred a day after the couple formally called off their divorce, after a Los Angeles judge granted the stars' request to dismiss their signed divorce papers. \nKhloe had originally filed to end their four-year union in December 2013, but they didn't move forward with the court action until this summer, when they both finally signed the documents. However, the papers had not been finalized by a judge, allowing them to pull the petition and reportedly give their marriage another chance. \nKhloe details her split from Lamar in the new book. Copyright WENN.com", "external_links": [], "published": "2015-10-24T20:16:00.000+03:00", "crawled": "2015-10-25T01:12:11.088+03:00", "highlightTitle": ""}