{"organizations": [], "uuid": "f16aaa21388b58acfddf94c8a12ff78643e4cbf5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mcall.com", "main_image": "http://www.trbimg.com/img-5622f090/turbine/mc-coloring-for-adults-parkland-library-20151017", "site_section": "http://www.mcall.com/entertainment/rss2.0.xml", "section_title": "Entertainment - The Morning Call", "url": "http://www.mcall.com/news/local/parkland/mc-coloring-for-adults-parkland-library-20151017-story.html", "country": "US", "title": "Adults drawn to coloring books as a way to relax", "performance_score": 0, "site": "mcall.com", "participants_count": 1, "title_full": "Adults drawn to coloring books as a way to relax", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T04:04:00.000+03:00", "replies_count": 0, "uuid": "f16aaa21388b58acfddf94c8a12ff78643e4cbf5"}, "author": "Jennifer Sheehan", "url": "http://www.mcall.com/news/local/parkland/mc-coloring-for-adults-parkland-library-20151017-story.html", "ord_in_thread": 0, "title": "Adults drawn to coloring books as a way to relax", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Adults drawn to coloring books as a way to relax Adults coloring trend APRIL BARTHOLOMEW / THE MORNING CALL \n\"I colored a lot as a child,\" says Kathy Dimmich of North Whitehall Township, who joined other adults for a coloring event recently at Parkland Community Library. \n\"I colored a lot as a child,\" says Kathy Dimmich of North Whitehall Township, who joined other adults for a coloring event recently at Parkland Community Library. (APRIL BARTHOLOMEW / THE MORNING CALL) Jennifer Sheehan Contact Reporter Of The Morning Call Parkland Library taps into adult coloring trend. \nFocused on her work, Ellen Reed slowly, meticulously used a vibrant blue pencil to shade a detailed section of the wreath on her coloring page. \n\"I can't talk and color at the same time,\" she said. \"I have to concentrate.\" \nReed, 74, was among about two dozen adults gathered at Parkland Community Library recently to enjoy some snacks, some company — and some coloring. \nAn activity that most of us associate with children is becoming increasingly popular among adults and in particular women, who find the quiet task a way to decompress and unplug from the pressures of daily life. \nColoring books designed for adults — featuring ornate, modern, mosaic patterns or complex geometric shapes — are topping retail sales. Amazon has four different coloring books for adults among its 20 best-sellers this month. \nPHOTO GALLERY: Childhood activity helps stressed grown-ups relax at Parkland Library and beyond (APRIL BARTHOLOMEW / THE MORNING CALL ) \nThe Moravian Book Shop has seen a huge increase in adult coloring book sales since early spring, said Janelle Lockett, the store's book buyer. And colored pencils — preferred by adults over crayons — keep selling out. \nBarnes & Noble's store in Bethlehem Township has a monthly coloring club that started in August because of the rising popularity of coloring books at the store. \n\"They sell like crazy,\" said Karen Rose, the store's community business development manager, who started the club. \"When I saw what was going on with the products in the store, I thought there would be something to this. I invited people to come and check out this idea of a coloring club.\" Adults coloring trend APRIL BARTHOLOMEW / THE MORNING CALL Adults at Parkland Community Library take part in a coloring event. The childhood activity has grown popular recently with grownups who tackle more detailed designs. Adults at Parkland Community Library take part in a coloring event. The childhood activity has grown popular recently with grownups who tackle more detailed designs. (APRIL BARTHOLOMEW / THE MORNING CALL) \nCrayola, the Forks Township company synonymous with children's art supplies, has a new line of adult coloring kits that include 12 coloring pages with such themes as kaleidoscopes and gardens, a 50-count box of colored pencils and 12 fine-line markers for detailed coloring. \nThe company has had free, downloadable coloring pages for adults on its website for a while but recently noticed the number of those downloads increasing, said Victoria Lozano, senior vice president and general manager for Crayola Attractions and Retail. One design, \"inSPIRAred,\" has been downloaded nearly 52,000 times. \nAt the Crayola Experience in Easton, where parents often are seen coloring with their children, the company has added pages with complex designs meant for adult colorers. \n\"If they were going to be there, let's give them some options,\" Lozano said. \nFor some adults, it's the connection to childhood that draws them to coloring. Life was easier then — no bills, no job pressures, no emails beckoning or smartphones buzzing. \n\"I colored a lot as a child,\" said Kathy Dimmich of North Whitehall Township, filling in the petals of a black-eyed Susan at the Parkland Library event. \nLike Dimmich, many of those who attended said they enjoyed coloring as a child and did it often with their own children and grandchildren. They came to the library looking for nothing more than a fun activity. \nBut the activity sometimes is pitched as something more. Many of the best-selling adult coloring books are marketed as \"art therapy,\" which may be a bit of a stretch, art therapists say. For one thing, coloring generally isn't considered art because it's not original. \nAnd art therapy isn't a solo exercise but one undertaken with a trained professional, said Laura Zeisler, an assistant professor of art therapy at Cedar Crest College in Allentown. \nColoring does, however, have stress-relieving benefits, say Zeisler and Kate Marder, a senior rehabilitation specialist and art therapist with the Menninger Clinic in Houston, a nationally recognized psychiatric hospital. \n\"I do think that it's something that can be therapeutic,\" Marder said. \"It can be very relaxing.\" \nSome of Marder's patients who are struggling with life or in need of calming have found coloring helpful, she said. \nYou can think of coloring as a form of visual meditation, stimulating the part of the brain that causes us to relax, Zeisler said. \nThe autonomic nervous system, which regulates body functions such as heart and respiratory rates, has two branches, she explained. One is the parasympathetic system, which controls rest and digestion. Coloring stimulates that system, which encourages the body to rest, she said. \nOverworked adults may be turning to coloring books because they are looking for activities where they can unplug, such as painting pottery, yoga and knitting — all of which have found new audiences in recent years. \n\"People are seeking peace and quiet,\" said Melanie Greenberg, a California psychologist who writes a blog, The Mindful Self-Express, for Psychology Today. \"In the old days, people used to do jigsaw puzzles and play cards. It wasn't so electronic.\" \nPeople should keep in mind that coloring alone won't dissolve all of life's stresses, she and others warn. Benefits from activities such as yoga and meditation are more proven stress-reduction methods, Greenberg said. \nBut there's no harm in coloring, either. It's inexpensive, for one thing, and there's no commitment. You can color whenever and wherever you like. And, Greenberg noted, it's a healthier way to relax than common alternatives such as drinking alcohol or smoking. \nYou just have to actively focus on your coloring to get any benefit, Marder said. If your cellphone is beeping with text messages and email alerts, that will distract your attention and you won't get the benefits of stress relief. The act of focusing on one thing is what provides that relief, she said. \nWhy coloring appears to be more popular among women than men is beyond the realm of art therapists. But they suspect societal stereotypes are at play. It may be more socially acceptable for women than for men to join a coloring club or class. \nAll but one of those coloring at Parkland Library were women. \nBrenda Held of South Whitehall Township signed up because she was looking for a new hobby. \n\"I normally go to yoga,\" she said. \"I heard about this and I thought it would be fun.\" \nHeld chatted with the other participants as she worked on her page. Those around her penciled in different kinds of pictures — from a hippy cat surrounded by peace symbols to complex mosaic designs. \nThe people in the group, representing an array of ages and backgrounds, got to know one another as they chose their pages. \n\"Feel free to ask a friend nearby for a color if you need one,\" said Carly Simon, the library's marketing and outreach coordinator. \"Pass around the books and tear out the pages you want.\" \nReed, of South Whitehall, patiently brought her wreath to life, remaining engaged and engrossed in the process. \n\"Coloring makes me … ,\" she said, with a pause, \"I don't want to say happy, but content.\"", "external_links": [], "published": "2015-10-18T04:04:00.000+03:00", "crawled": "2015-10-18T10:28:34.230+03:00", "highlightTitle": ""}