{"organizations": [], "uuid": "51c7b6cf32b43703ffe21c14796a3f141f037219", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48524/entertainment", "section_title": "Entertainment - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30218196/hip-hop-hall-of-fame-museum-relaunches-fan-vip-membership-drive-and-preps-crowd-fundraising-major-campaign-for-new-harlem-location", "country": "US", "title": "Hip Hop Hall of Fame + Museum Relaunches Fan VIP Membership Drive and Preps Crowd Fundraising & Major Campaign for New Harlem Location", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Hip Hop Hall of Fame + Museum Relaunches Fan VIP Membership Drive and Preps Crowd Fundraising & Major Campaign for New Harlem Location - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "51c7b6cf32b43703ffe21c14796a3f141f037219"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30218196/hip-hop-hall-of-fame-museum-relaunches-fan-vip-membership-drive-and-preps-crowd-fundraising-major-campaign-for-new-harlem-location", "ord_in_thread": 0, "title": "Hip Hop Hall of Fame + Museum Relaunches Fan VIP Membership Drive and Preps Crowd Fundraising & Major Campaign for New Harlem Location", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Information contained on this page is provided by an independent third-party content provider. WorldNow and this Station make no warranties or representations in connection therewith. If you have any questions or comments about this page please contact pressreleases@worldnow.com .\nSOURCE Dove Entertainment\nHip Hop Hall of Fame Awards TV Show in Talks with TV Networks and Advertisers as HHHOF Museum Initiates Its Early Campaign Talks with Potential Partners, Sponsors, and Major Legacy Contributors Assisted By Dove Entertainment\nNEW YORK , Oct. 8, 2015 /PRNewswire/ -- After successfully closing out its 2 nd annual Hip Hop Health Month in September, the Non-profit Hip Hop Hall of Fame Museum & Educational Institution has today relaunched its Fan VIP Membership Drive today. The Founding Fans Membership Campaign salutes the first 350,000 VIP Membership Fans who join for $35 at http://hiphophalloffame.org as they will be 'enshrined with hip hop greats' in a real life 'Fan Wall of Fame Exhibit' inside the HHHOF Museum with their picture, and a 20 second video clip of why they love hip hop when it opens in late 2016-17. A rendering of the exhibit is on display. Those fans and supporters will also receive a VIP 10% discount on all Merchandise, Events, and Products.\nA new crowd funding initiative will be unveiled prior to the upcoming Hip Hop Hall of Fame Awards TV Show '2015 Inductee Announcement' Press Conference slated for late October. The event will be attended by Hip Hop Artists, Pioneers, Executives, Celebrities, and special guest. The HHHOF Awards show continues talks with television networks, and potential sponsors and advertisers as it will tape during Hip Hop Hall of Fame Week November 28 th – December 4 th , closing out Hip Hop History Month in November. The new Harlem site will be unveiled at a private event, and then publicly at during the HHHOF week of activities.\nThe HHHOF Museum has also initialized its early campaign by reaching out to potential partners, sponsors, major legacy contributors, and challenge grants that shall continue through 2016-17. \"The level of excellence and historical significance that will be expressed in the Hip Hop Hall of Fame + Museum & Entertainment Complex Harlem site can be achieved only with a significant infusion of philanthropic capital, fan and supporter memberships, entertainment industry and executive support, artists and celebrity proclamations with natural sponsorships and naming rights opportunities,\" said JT Thompson, the creator of the HHHOF Awards that first aired on BET in the 1990s, and is the founder of the HHHOF Museum.\nThe HHHOF is a 501c3 whose dedicated mission is to inspire, celebrate, preserve, interpret, educate, and exhibit Hip Hop music and its worldwide cultural expressions. It will include the Hall, Museum, Retail Gift Store, Restaurant, Sports Bar, Education facilities, TV Studios, and Concert Lounge that will produce up to 100 co-branded special events and concerts annually.\nThe funds raised will assist in the continued concept development, and acquisition of its new Harlem location. It will also contribute to the architectural design, rehab construction, museum exhibits design and build out, collection management, reconstituting our internal boards and committees, community outreach & educational programming for school kids (K-12), the hip hop media & arts academy, a digital hip hop history museum & archive website, annual events, and the museum's general operations and staffing for long-term sustainability. The private support, contributions, and gifts we receive invest in attracting and retaining the best minds, and ensures the HHHOF Museum has the power to open to the general public worldwide with the permanence to endure.\nThe HHHOF Museum will open its Harlem offices in November and also launch its Hip Hop Media & Arts Youth Academy. It considers these legacy gifts and contributions as gifts to America's music history, the world and the future as the museum seeks to inspire, uplift, and educate through its many exhibits, programs, tours, and entertainment events that excite the imagination and will connect people everywhere to its collection treasures that will preserve the now classic four decade old urban street culture inspired hip hop music & culture genre history for many generations to come. For more information on how to contribute, sponsor events and programs, museum gifts, and volunteering contact Ben Davis at Dove Entertainment.\nPhoto - http://photos.prnewswire.com/prnh/20151008/275366\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/hip-hop-hall-of-fame--museum-relaunches-fan-vip-membership-drive-and-preps-crowd-fundraising--major-campaign-for-new-harlem-location-300156819.html\n©2015 PR Newswire. All Rights Reserved.", "external_links": ["http://photos.prnewswire.com/prnh/20151008/275366", "http://www.xmlnews.org/ns/", "http://rt.prnewswire.com/rt.gif?NewsItemId=LA23917&Transmission_Id=201510081340PR_NEWS_USPR_____LA23917&DateId=20151008", "https://photos.prnewswire.com/prnvar/20151008/275366", "http://www.prnewswire.com/news-releases/hip-hop-hall-of-fame--museum-relaunches-fan-vip-membership-drive-and-preps-crowd-fundraising--major-campaign-for-new-harlem-location-300156819.html", "http://hiphophalloffame.org/"], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-08T21:47:30.087+03:00", "highlightTitle": ""}