{"organizations": [], "uuid": "67fafed128feb9cd8fc03e53b642dbc8331ce456", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.timesunion.com", "main_image": "http://www.timesunion.com/img/pages/article/opengraph_default.jpg", "site_section": "http://www.timesunion.com/default/feed/entertainment/feed/Entertainment-News-214.php", "section_title": "Entertainment News", "url": "http://www.timesunion.com/news/article/Nonprofit-continues-fight-against-Lucas-Museum-in-6549580.php", "country": "US", "title": "Nonprofit continues fight against Lucas Museum in Chicago", "performance_score": 0, "site": "timesunion.com", "participants_count": 1, "title_full": "Nonprofit continues fight against Lucas Museum in Chicago - Times Union", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T00:38:00.000+03:00", "replies_count": 0, "uuid": "67fafed128feb9cd8fc03e53b642dbc8331ce456"}, "author": "timesunion.com", "url": "http://www.timesunion.com/news/article/Nonprofit-continues-fight-against-Lucas-Museum-in-6549580.php", "ord_in_thread": 0, "title": "Nonprofit continues fight against Lucas Museum in Chicago", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO (AP) — A nonprofit group has filed an updated complaint in federal court as part of its efforts to keep filmmaker George Lucas from building a museum along Lake Michigan in Chicago.\nFriends of the Parks' filing Friday focuses on a ground lease agreement that the Chicago Park District has signed with the Lucas Museum of Narrative Art , the Chicago Tribune reports ( http://trib.in/1PYAsf6 ). The agreement gives the Lucas museum a 99-year lease on the lakefront property for $10. The group also reiterated its argument that the museum will ruin the character of the Lake Michigan shoreline.\n\"In particular, the ground lease agreement would authorize the construction of a museum that would preclude the use of the trust property as free and open space with access to the activities on Lake Michigan,\" the filing stated.\nConstruction could begin as early as next spring and last until 2018 if plans for the museum pass the Chicago City Council and city Plan Commission . The site is south of Soldier Field and north of McCormick Place. The 17-acre site will erase parking lots and add 4.5 acres of new parkland and a 300,000-square-foot museum.\nA judge previously ordered the group to file an amended complaint because the museum recently released revised plans that include more green space and a scaled-back design.\nMayor Rahm Emanuel offered the land along Lake Michigan for the project to the \"Star Wars\" creator, who chose to build in Chicago over San Francisco. The mayor has said he believes the museum will add to other cultural institutions already in the area, including the Field Museum and Shedd Aquarium .\nThe Chicago Park District now has the option to reply to Friends of the Parks' filing. The next court date in the case in Nov. 10.", "external_links": ["http://ap.org/schemas/03/2005/apcm", "http://trib.in/1PYAsf6", "http://ap.org/schemas/03/2005/apnm"], "published": "2015-10-05T00:38:00.000+03:00", "crawled": "2015-10-05T01:21:08.875+03:00", "highlightTitle": ""}