{"organizations": [], "uuid": "8344afd8571c5adc2c83d2e4aa304bf7c5bd30cd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bangaloremirror.com", "main_image": "http://www.bangaloremirror.com/photo/49232922.cms", "site_section": "http://www.bangaloremirror.com/entertainment/section/20970473.cms", "section_title": "Entertainment News: Bollywood, Hollywood News, South Movie News &amp; Reviews – Bangalore Mirror", "url": "http://www.bangaloremirror.com/entertainment/south-masala/Puli-roars-at-the-box-office/articleshow/49232877.cms", "country": "IN", "title": "Puli roars at the box office", "performance_score": 0, "site": "bangaloremirror.com", "participants_count": 1, "title_full": "Puli roars at the box office - Bangalore Mirror", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T05:55:00.000+03:00", "replies_count": 0, "uuid": "8344afd8571c5adc2c83d2e4aa304bf7c5bd30cd"}, "author": "bangaloremirror.com", "url": "http://www.bangaloremirror.com/entertainment/south-masala/Puli-roars-at-the-box-office/articleshow/49232877.cms", "ord_in_thread": 0, "title": "Puli roars at the box office", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By: Haricharan\nTamil superstar Vijay's mega-budget fantasy drama Puli, despite initial setback and scathing reviews, managed to shine at the box office and netted Rs39 crore in its opening weekend worldwide. It's too early to term the film a hit, as trade pundits believe the real test at the ticket window starts from the first Monday after a release for a star's film. \"Vijay's films usually open big, thanks to his mass following. The opening weekend tickets of Puli were sold out in just a few hours after theatres opened bookings last week. So, as expected, the film was had a good opening. The first three days of this week are very crucial and it will decide the fate of the film,\" a trade pundit told Mirror.\nTouted to be made on a budget of nearly Rs100 crore, Chimbu Deven-directed Puli reportedly recovered its investment through pre-release business. \"Rumour has it that it raked in over Rs100 crore through satellite rights and area-wise distribution. The distributors bought the film for a whopping price, so they expect higher returns,\" he said, and added that the film would've registered bigger opening if its released was not delayed.\n\"If Puli had released as planned in all the three languages - Tamil, Hindi and Telugu - on the release day, then it surely would've raked in much more than what it has collected now. On the first day, all the early morning shows of the film were cancelled in Tamil Nadu, following the income tax raid the previous night at the homes of actor Vijay and the producers of the film. The Telugu version, on the other hand, released only a day later in cinemas. The delayed release had affected the box-office returns severely, which otherwise would've easily minted another Rs10-12 crore,\" he added.\nMeanwhile, superstar Rajinikanth, who saw the film in a private screening on Sunday, has heaped praise on the makers and the team, adding that he loved the visual effects, the production design and the scale on which the film has been made.", "external_links": [], "published": "2015-10-06T05:55:00.000+03:00", "crawled": "2015-10-05T22:34:35.371+03:00", "highlightTitle": ""}