{"organizations": [], "uuid": "4ede4494cac4c74deaaf3145838aaba2dbe867ff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nj.com", "main_image": "http://imgick.nj.com/home/njo-media/width620/img/entertainment_impact/photo/18903980-standard.jpg", "site_section": "http://blog.nj.com/entertainment_impact/rss.xml", "section_title": "Entertainment", "url": "http://www.nj.com/entertainment/index.ssf/2015/10/pan_review_give_it_the_hook.html", "country": "IL", "title": "'Pan' review: Give it the hook", "performance_score": 0, "site": "nj.com", "participants_count": 1, "title_full": "'Pan' review: Give it the hook", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T15:44:00.000+03:00", "replies_count": 0, "uuid": "4ede4494cac4c74deaaf3145838aaba2dbe867ff"}, "author": "Stephen Whitty | ArtiSyndicate", "url": "http://www.nj.com/entertainment/index.ssf/2015/10/pan_review_give_it_the_hook.html", "ord_in_thread": 0, "title": "'Pan' review: Give it the hook", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "If you believe in fairies, clap your hands. Please. \nBecause it's the only applause \"Pan\" is going to get. \nA stubbornly stupid rewriting of the beloved J.M. Barrie tale, it gets off on the wrong foot almost immediately by setting its prequel to the Edwardian fantasy in 1940s London. No, you're right. That math doesn't work. \nBut neither do many of the other things in this extravagantly produced, painfully leaden film. \nYet another \"origin\" story (and didn't it used to be fun when we simply wondered where heroes came from?), the story begins with Peter as a foundling in a viciously sadistic Catholic orphanage. He's then sold along with some of his friends to Blackbeard the Pirate, who takes the boys to Neverland and puts them to work in his mines. \nUpon arrival, they are greeted with a chorale version of Nirvana's \"Smells Like Teen Spirit.\" \nWhy? I have no idea. Nor was I quite sure why we were treated, shortly thereafter, to a similar a cappella rendition of the Ramones' \"Blitzkrieg Bop.\" (I was relieved though, when this musical idea – if you can call it that – was almost immediately abandoned.) \nJoe Wright's film alternates between grim and campy after that, with Levi Miller's Peter working with blistered hands in the mines, and Hugh Jackman's Blackbeard prancing around on deck. Eventually rangy Garrett Hedlund shows up as a cowboy, or maybe just someone who's seen too many Indiana Jones movies. His name, it seems, is Hook. \nWait, what? \nFor children who know Peter only from the Disney cartoon (or, better yet, the original musical ) this is roughly the point at which they will drop their popcorn and start overwhelming you with questions. Why is Hook a good guy now? Where's Wendy? And why is Tiger Lily no longer Native American, but now the princess of some Asian/Pacific Islander tribe? \n(Children's more politically conscious parents, meanwhile, can ask why she's still played by a white actress, Rooney Mara .) \nEventually Peter, Hook and Tiger Lily all team up to fight Blackbeard, and the film takes off, or at least its special effects do. The state-of-the-art 3D wonders include flying frigates and crystalline caves; even better are some of the quieter touches, like Tiger Lily's forest home, or a family of mermaids all played by Cara Delevigne. \nYet even when the screen is filled with eyecandy, it still feels empty. Hedlund is obvious without ever being entertaining, and his relationship with Peter is pale, at best (the absence of Wendy leaves a particularly large emotional hole). And Jackman's Blackbeard is bizarre, but barely believable; even a dimension-travelling pirate needs to act, occasionally, in a way that makes some sort of sense. \nBut a carefully thought-through story is something this movie has no interest in. Instead, it's an overpriced hodgepodge – a \"chosen one\" fantasy out of \"Harry Potter,\" lots of action scenes nicked from a superhero movie, and a bunch of nuns so unrelievedly gruesome they seem lifted from an anti-Catholic tract. \nMara remains intense, even when she's wearing a headdress that looks like a pair of draperies, and Miller is a sweet and unforced child actor. But for all the eye-popping effects and hyperkinetic action, there's no joyful innocence here. There's no sense of childlike wonder. Just a lifeless machine, dully ticking away like a clock in a crocodile's belly. \nRatings note: The film contains violence and some very mild bathroom humor. 'Pan' (PG) Warner Bros. (111 min.) Directed by Joe Wright. With Levi Miller, Garrett Hedlund, Hugh Jackman. Now playing in New Jersey. ★ ½ \nStephen Whitty may be reached at stephenjwhitty@gmail.com . Follow him on Twitter @stephenwhitty. Find him on Facebook.", "external_links": [], "published": "2015-10-09T15:44:00.000+03:00", "crawled": "2015-10-09T19:37:39.078+03:00", "highlightTitle": ""}