{"organizations": [], "uuid": "790a2b8869e65b82e496e364e2955b8e077bba1f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "savannahnow.com", "main_image": "http://savannahnow.com/sites/default/files/14782427.jpg", "site_section": "http://savannahnow.com/", "section_title": "savannahnow.com | Savannah Georgia's source for News, Entertainment, Sports, Weather, Classifieds, Jobs, Autos, Real Estate and St. Patricks Day", "url": "http://savannahnow.com/sports/2015-10-03/nats-scherzer-throws-his-2nd-no-hitter", "country": "US", "title": "Nats' Scherzer throws his 2nd no-hitter", "performance_score": 0, "site": "savannahnow.com", "participants_count": 1, "title_full": "Nats' Scherzer throws his 2nd no-hitter | savannahnow.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T17:47:00.000+03:00", "replies_count": 0, "uuid": "790a2b8869e65b82e496e364e2955b8e077bba1f"}, "author": "BEN WALKER", "url": "http://savannahnow.com/sports/2015-10-03/nats-scherzer-throws-his-2nd-no-hitter", "ord_in_thread": 0, "title": "Nats' Scherzer throws his 2nd no-hitter", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photos Kathy Kmonicek/The Associated Press\nWashington’s Max Scherzer, second from left, celebrates his no hitter against the New York Mets with teammates Saturday.\nSPECIAL OFFER FOR NEW READERS 99 cent digital subscription to savannahnow.com\nSubscriber-members get access to ALL our digital products AND become eligible for free event tickets, discount coupons and other benefits. SIGN UP FOR SUBSCRIBER BENEFITS As a Savannah Morning News / savannahnow.com subscriber, you're eligible for members-only discounts. Download your coupons now. SPECIAL OFFER FOR NEW READERS 99 cent digital subscription to savannahnow.com\nSubscriber-members get access to ALL our digital products AND become eligible for free event tickets, discount coupons and other benefits. SIGN UP FOR SUBSCRIBER BENEFITS As a Savannah Morning News / savannahnow.com subscriber, you're eligible for members-only discounts. Download your coupons now. By BEN WALKER NEW YORK — Max Scherzer pitched his second no-hitter this season for Washington, striking out a team-record 17 and leading the Nationals over the NL East champion New York Mets 2-0 Saturday night for a doubleheader sweep.\nOnly one batter reached base against Scherzer, and that came when third baseman Yunel Escobar bounced a throw for an error on Kevin Plawecki’s leadoff grounder in the sixth inning.\nThe All-Star righty became just the sixth pitcher to throw two no-hitters in a year, and the first since Roy Halladay in 2010 — the former Phillies ace had one in the regular season and another in the playoffs.\nScherzer struck out nine straight batters before Curtis Granderson hit an easy popup to Escobar to end it on his 109th pitch.\nWorking quickly on a brisk, blustery night at Citi Field, Scherzer (14-12) added to the no-hitter he threw against Pittsburgh on June 20, when he came within one strike of a perfect game.\nJohnny Vander Meer, who pitched two in a row, Nolan Ryan, Virgil Trucks and Allie Reynolds also threw a pair in the same season.\nThe Mets lost their fifth in a row, having dropped the opener 3-1. The skid has put in peril their chance of getting home-field advantage in the NL Division Series against the Los Angeles Dodgers.\nScherzer pitched the seventh no-hitter in the majors this year, including one by San Francisco rookie Chris Heston at Citi Field on June 9.\nThis is Scherzer’s first season with the Nationals after the 2013 AL Cy Young winner left Detroit and signed a $210 million, seven-year deal as a free agent.\nIn a season that has spiraled downward for the Nationals, the gems by Scherzer have been highlights. This also marked the second straight year a Washington pitcher came up big late — Jordan Zimmermann threw the first no-hitter in Nationals’ history on the final day of the regular season in 2014.\nAt times, Scherzer looked as if he was simply playing catch with Wilson Ramos. Wherever Ramos put his catcher’s mitt, Scherzer seemed to hit it.\nMatt Harvey (13-8) lost despite allowing just one unearned run and four hits in six innings.\nThe Nationals won the opener when Bryce Harper hit a tiebreaking, two-run homer in the eighth off Addison Reed (3-3). It was Harper’s 42nd homer. Rafael Martin (2-0) got one out as the Nationals ended a six-game skid against the Mets. Felipe Rivero worked the ninth for his second save.", "external_links": ["http://sav-cdn.com/sites/default/files/imagecache/superphoto/14782427.jpg", "http://sav-cdn.com/sites/default/files/imagecache/story_slideshow_thumb/14782427.jpg", "http://sav-cdn.com/sites/all/themes/savannahnow/images/blank.gif"], "published": "2015-10-03T17:47:00.000+03:00", "crawled": "2015-10-04T13:49:30.306+03:00", "highlightTitle": ""}