{"organizations": [], "uuid": "93dc018819abb93ddefab762767cfc1f75b9d16b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3337804/images/o-DEFAULT-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/entertainment/index.xml", "section_title": "Entertainment - The Huffington Post", "url": "http://www.huffingtonpost.com/piper-perabo/the-heroes-ive-met_b_8369432.html", "country": "US", "title": "The Heroes I've Met", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "The Heroes I've Met", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T17:16:00.000+03:00", "replies_count": 0, "uuid": "93dc018819abb93ddefab762767cfc1f75b9d16b"}, "author": "Piper Perabo", "url": "http://www.huffingtonpost.com/piper-perabo/the-heroes-ive-met_b_8369432.html", "ord_in_thread": 0, "title": "The Heroes I've Met", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nThis article is the third and final in a series written by Piper Perabo in partnership with WhoSay and the IRC about her experience with Syrian refugees in Greece. \nWhile visiting the island of Lesbos, Greece, I saw a bumper sticker that read: \"Greeks don't fight like heroes; heroes fight like Greeks.\" It's true. \nI was recently in Lesbos with the global humanitarian aid organization, International Rescue Committee , and met a Greek mother of three, who owns and runs a restaurant with her husband and, at the same time, is feeding and sheltering hundreds of refugees that walk through her small town on the way to the ferry port. She hangs tarps so there will be some place dry to sleep. She makes food for them, no charge. I saw a couple of people stop at the restaurant and ask her how she was doing; one couple gave her a donation. \n(Refugees jump off of a raft after arriving from Turkey, in Molyvos, northern Lesbos, Greece on Wednesday, October 7th, 2015. Many boats come over-crowded with refugees, with more people than the rafts should handle.) \nNow that people know about her big heart, they tell her when a boat lands, or if they hear of a refugee family that needs help. Her oldest daughter, a twenty-something, spent the day with her friends out looking for boats and helping people who landed on the shore. \nThat week, the coast guard saved a group of refugees who were victims of a capsized boat and brought them to this woman's house because they knew she would open her doors and feed them. (Frankly, the coast guard had no other option.) \nImagine: You're at home after a long day of work when the coast guard knocks on your door and asks, \"Can you take in all of these soaking wet, terrified people for the night?\" \nImagine, on top of your more than full-time job, volunteering all your spare time and donating your own money to help strangers, all the while to raise your family under austerity measures imposed by the government for the last five years. \nThis is a reality for many Greeks right now on the island of Lesbos. \nVolunteers on the island are ordinary people making sandwiches, handing out water, offering spare shoes and clothes, letting people sleep in their yards. The kicker? The on-going Greek economic crisis has been so tumultuous that these folks have been left with very little money of their own. Yet they take it upon themselves to help the hundreds of thousands of Syrian refugees flooding their beaches. It's astonishing. \n(IRC Voice Piper Perabo visits Molyvos in Lesvos, Greece, and witnesses the arrival of refugees. She is working to bring awareness about the mounting crisis and to provide aid where and when she can.) \nBefore the end of the year, an estimated 200,000 more refugees will flee Syria and up to 75 percent will pass through this tiny island. Lesbos doesn't have the resources or the infrastructure to handle these numbers. The Greeks have been helping displaced people for years and, as you can imagine, they are frustrated and exhausted. It's too much for local volunteers to handle by themselves. \nSo, how can we help? This crisis is an ocean away from us in the United States, and it's natural to feel powerless--but there are three things everyone can do to make an impact. \nThe most obvious way to help is to contribute money to organizations that are aiding the relief effort. The IRC, for example, is providing water, healthcare, and transportation for people crossing the island. Our staff and volunteers work tirelessly around the clock. You can also support resettlement in the United States, so that when refugees arrive in America legally, they will have help finding jobs and enrolling their kids in school. \nGiving money is important, needless to say, but there is something else perhaps even more important we all can do. Let me illustrate with a story. While in Greece, I stayed at a makeshift camp (much like the one behind the restaurant), and I was looking for a size 42 shoe in the shoe bin for a man who was walking to Mytilene, the port city where he could catch a ferry to Athens. I couldn't find any size 42 shoes. In an attempt at humor, I said to George, the local butcher who was running the camp, \"Should I ask people at home in America to send more size 42 shoes?\" \nHe smiled but shook his head no. \"Tell the people in America that you don't have to send us any more shoes,\" he said. \"You don't have to send us any more money. What you need to do is talk to someone who is a refugee. You need to understand this problem for yourself.\" \nGeorge looked me in the eyes. \"You can't just understand this by watching fifteen minutes of news at night, or reading a newspaper once a day. Go and talk to someone who's a refugee...person to person. That's how we're really going to get people to understand what's going on. I don't need any more size 42 shoes.\" \nHis advice struck me. In order to best help a group of people, we must first understand their plight. \n(Afghan refugees warm themselves by the fire at sunrise, at the Moria refugee camp, in Mytilene, on the island of Lesbos, Greece on Friday, October 9th, 2015. Once refugees get processed and get papers after their arrival in Lesbos, they can exchange money and buy ferry tickets to get to Athens.) \nLast, but certainly not least, there are many ways that constituents can put pressure on their elected officials to change things--and elected officials listen when confronted with a deluge of emails. Go to www.opencongress.org and type in your zip code--the site will give you the email address of your Congressional representative. Write him or her, write your senators, telling them your concerns about the situation. Make your voice heard. It doesn't cost anything. \nUltimately, the war in Syria must end. There are 1.8 million Syrians in Turkish refugee camps, still more in camps in Lebanon, Iraq and Jordan. Syrians don't want to leave Syria, but they can't stay in their country under the current conditions. Until we find a solution to the conflict, the refugee crisis in Europe will grow. \nRemember: Even if you don't have a restaurant in Greece, you can help. \nLearn more about the Syrian refugee crisis here . \nFounded in 1933 at the request of Albert Einstein, the International Rescue Committee offers emergency aid and long-term assistance to refugees and those displaced by war, persecution or natural disaster. The IRC resettles refugees and helps them become self-sufficient. \nFollow Piper Perabo on Twitter: www.twitter.com/piperperabo More:", "external_links": [], "published": "2015-10-23T17:16:00.000+03:00", "crawled": "2015-10-23T17:28:55.546+03:00", "highlightTitle": ""}