{"organizations": [], "uuid": "3e727c5225a8f77d7e14e2a75ed1e21ed4f45110", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbsnews.com", "main_image": "http://cbsnews1.cbsistatic.com/hub/i/r/2015/09/14/56f50ff8-938a-429f-9a81-83c90f4f6e4c/thumbnail/620x350/55164087d0e10fb9a6c0584b8dadb74d/john-cleese-interview-triptych-promo.jpg", "site_section": "http://www.cbsnews.com/entertainment/", "section_title": "Entertainment News, Headlines and Video - CBS News ", "url": "http://www.cbsnews.com/news/extended-transcript-john-cleese/", "country": "US", "title": "Extended transcript: John Cleese", "performance_score": 0, "site": "cbsnews.com", "participants_count": 1, "title_full": "Extended transcript: John Cleese - CBS News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T15:42:00.000+02:00", "replies_count": 0, "uuid": "3e727c5225a8f77d7e14e2a75ed1e21ed4f45110"}, "author": "CBS News", "url": "http://www.cbsnews.com/news/extended-transcript-john-cleese/", "ord_in_thread": 0, "title": "Extended transcript: John Cleese", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "In this extended interview transcript, recorded following the Tribeca Film Festival's Monty Python tribute this past spring, John Cleese talks about comedy, his mother's anxiety, divorce laws, and why you won't see him doing any more silly walks.\nFor more info:\nTheJohnCleese.com \"So Anyway\" by John Cleese (Crown Archtype); Also available in Trade Paperback and eBook formats montypython.com \"John Cleese and Eric Idle: Together Again at Last, for the Very First Time\" (Through Oct. 31) | Tour Dates and Tickets\nSmith: So how are you?\nCleese: Old and tired, but in a good mood. It was quite busy. They just showed all the Python movies in a retrospective at the Tribeca Film Festival. But the thing now is that people are so mindlessly benevolent towards us, that it doesn't really matter what we say.\nSmith: Seriously? That's how you feel?\nCleese: Yeah, they're just wonderful. It's like the O2 [their 2014 reunion in London], this extraordinary warmth towards us, so we don't get nervous anymore.\nSmith: Did you used to get nervous?\nCleese: Oh, yes. I used to get very nervous, all through Monty Python I remember thinking, \"I wish they'd tape the dress rehearsal,\" because I was always funnier in the dress rehearsal than I was on the actual recording. Always. Because I was relaxed. And then the audience would come in and I would tighten up. I'd be okay, but I wouldn't be as good.\nSo, nerves are always a big problem for me, which is why I loved doing American sitcoms, like \"Cheers\" and \"Will & Grace.\" Because you know when you do the take in front of the audience that you're going to do it again afterwards. A minute after you finish, you just go and do it again. So, there's that sort of safety net. And then if you made a little mistake or two, they'll go pick it up, so there's nothing to worry about.\nSmith: You're operating with a net.\nCleese: And so you are more relaxed. And people are funnier when they're more relaxed.\nSmith: How did you deal with nerves?\nCleese: Suffered. Just suffered. What do you do with 'em, you know? You just tighten up and you try to stay relaxed and you do little breathing exercises and so forth. And then if the audience is really good, a certain joy comes in 'cause you're really making them laugh. And that's a lovely experience when you make an audience laugh. Then the nerves go away for a bit. And sometimes you do things then that you've never done before that are really funny.\nSmith: What is that feeling like when you hear that the audience is with you?\nCleese: It's exhilarating and you love it. But you're always thinking, \"I musn't lose 'em.\" (laughs)\nSmith: That's in the back of your mind?\nCleese: Oh, yeah, that's always in the back of your mind, yeah. Well, I think so. There are moments when you're just flying, like on a movie. Probably if you shoot a movie for seven weeks, there are three takes when you're absolutely fine and you can do no wrong.\nI remember there was a basketball player who used to say that he practiced so hard because twice in a season an angel would sit on his shoulder. And that's what it's about -- just occasionally that happens. But it's very rare.\nI remember doing a take on \"Holy Grail\" with Eric Idle where he was playing Concorde, my trusty servant. And he'd been hit by an arrow. And we were just chatting as though nothing had happened. And at the end of the take, director said, \"Cut.\" And I turned and I said, \"How about that,\" 'cause it was one of the best takes I've ever done. And the director said, \"Not enough smoke.\" (laughs)\nI think it's that it is so silly that it gives people a mindset that enables them to realize how silly the whole world is.\nSmith: So the one that we end up seeing is not necessarily the best take?\nCleese: Well, it depends. I mean, the cameraman always wants the one that looks the best. But the cameramen tend not to be that interested in whether it's funny or not.\nSmith: Going back to the Python reunion that you just had here. You said that the audience is just loving and benevolent. What is it about your work with Python that so resonates with people?\nCleese: I think it's that it is so silly that it gives people a mindset that enables them to realize how silly the whole world is. And one of the loveliest things that people ever said to me at the beginning of Python [was], 'Once we've watched Python, we can't then watch the evening news, 'cause we cannot take it seriously.'\nCleese: I think it takes a long time, as you get older, to realize just how crazy the world is, just how ridiculous it all is. And I think people sometimes get that feeling after they've watched Python. And it's very relaxing. Because when you realize it's hopeless, then you can just have fun losing your mind -- what else are you gonna do before you die?\nSmith: When did you realize that Python had that hold on people?\nCleese: Well, there was a tiny dedicated audience at the start. But, I mean, numerically it was really quite small. That was right at the beginning. In England, you see, it's never had the acclaim that it has in other parts of the world, especially in America, because the press in England is just dedicatedly negative about almost everything. They wanna cut everybody down to size, whether they're politicians or businessmen or football coaches.\nSmith: Or comedians.\nCleese: Or comedians. Just anybody -- racing car driver, it doesn't matter, they're after them, you know? And yet, extraordinary thing is that that kind of negative criticism is never applied to one group, which is, of course, the journalists! So, they're always chipping away at everyone who's had any kind of success in England, because I think they're basically a very envious bunch. When we go anywhere else in the world, there's a much greater feeling of acceptance and affection.\nVery often people come to interview me in America or Canada and they say, 'I asked the editor if I could interview 'cause I enjoy your work. You make me laugh.' And I think in England, that would be the reason that he would not be asked to interview you.\nSmith: Oh, because he has to be critical of you?\nCleese: 'Cause he has to do spiky interviews. They decided to do spiky interviews about 25 years ago, Sunday Times. Of course they didn't tell anyone.\nSmith: Having said that, though, when you had the reunion last year, those shows sold out how quickly?\nCleese: Oh, amazing. The first shows sold out 16,000 seats in 43 seconds.\nprev Next 1 / 10", "external_links": ["http://cleeseandidle.com/tourdates/index.html", "https://www.youtube.com/embed/Rb9mn6YeQMY", "http://montypython.com/", "http://cleeseandidle.com/", "http://www.penguinrandomhouse.com/books/224637/so-anyway-by-john-cleese/", "http://thejohncleese.com/"], "published": "2015-10-25T15:42:00.000+02:00", "crawled": "2015-10-25T16:49:11.150+02:00", "highlightTitle": ""}