{"organizations": [], "uuid": "dfea6efe77eab5fcd5d0df0aabd99baf47bedb80", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.570news.com", "main_image": "http://www.570news.com/wp-content/blogs.dir/sites/3/2015/10/01/CPT110301944_hd.jpg", "site_section": "http://www.570news.com/category/entertainment/feed/", "section_title": "570 NEWS » Entertainment", "url": "http://www.570news.com/2015/10/01/kate-mara-keen-to-produce-star-in-project-with-canuck-pal-ellen-page/", "country": "CA", "title": "Kate Mara keen to produce, star in project with Canuck pal Ellen Page", "performance_score": 0, "site": "570news.com", "participants_count": 1, "title_full": "Kate Mara keen to produce, star in project with Canuck pal Ellen Page", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T19:19:00.000+03:00", "replies_count": 0, "uuid": "dfea6efe77eab5fcd5d0df0aabd99baf47bedb80"}, "author": "News Staff", "url": "http://www.570news.com/2015/10/01/kate-mara-keen-to-produce-star-in-project-with-canuck-pal-ellen-page/", "ord_in_thread": 0, "title": "Kate Mara keen to produce, star in project with Canuck pal Ellen Page", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "by Cassandra Szklarski, The Canadian Press Posted Oct 1, 2015 12:19 pm EDT Kate Mara arrives on the red carpet at the gala for the film 'The Martian' at the 2015 Toronto International Film Festival in Toronto on Friday, Sept. 11, 2015. THE CANADIAN PRESS/Frank Gunn \nTORONTO – Kate Mara says she’s teaming up with her good friend Ellen Page for a project they will both produce and star in. \nThe “House of Cards” star hinted at the plans while promoting her new film “The Martian” at the Toronto International Film Festival. \nMara wouldn’t reveal details, but said she was keen to work with her Canadian pal, who was also at the festival with the films “Freeheld” and “Into the Forest.” \n“It’s probably too early to talk about but we’re going to star in something that we’re producing together,” Mara said on a chilly mid-September day, wearing a black leather motorcycle jacket slung over a short red party dress. \n“We’re good friends but we also really want to work together as actors so hopefully that will happen soon.” \nIn “The Martian,” Mara plays an astronaut who is part of a manned mission to Mars cut short by a massive sand storm. \nMatt Damon stars as a fellow astronaut left behind when his fleeing team assumes he was killed by a piece of flying debris. Turns out he survived, and he and NASA are forced to figure out a way to help him live long enough for a rescue mission that could be years away. \nIt’s a brainy flick that doesn’t shy away from detailing various technical problems, and Mara said wrapping her head around the science was one of the toughest parts of the role. \n“I’ve always been a really big fan of films about space and I like sci-fi but I was awful in school with both math and science so it’s not something that I learn easily,” she admitted. \n“For the film, I definitely had to do my homework.” \nMara said she leapt at the chance to work with director Ridley Scott, whose other galactic visions include “Alien” and “Blade Runner.” \n“Ridley likes to do things big, he always kind of has,” chuckled Mara, who batted away questions about her last big spectacle — the heavily panned “Fantastic Four.” \n“Ridley is the reason I wanted to be a part of the film. Before I ever read anything I said, ‘Yes, I want to work with him.’ And then luckily I loved the script.” \nMara lamented being too busy to meet up with Page during the festival. Her other obligations included a New York premiere for the film “Captive,” about a former addict who is taken hostage by a recently released convict. \nIn October, she was scheduled to begin shooting her next film — a true story about a marine and her bomb-sniffing dog, directed by Gabriela Cowperthwaite. \nMara said she was excited to work with a female director on a tale about a female war hero, noting that a gender imbalance in big screen projects is something she can’t help but notice. \n“As I get older I’m more aware of it,” she said. \n“I’m very hopeful that things will start moving in a direction where at some point it won’t be a discussion, because it will just be normal for women to be directing and for there to be an equal amount of women in films as there are men.” \n“The Martian” opens Friday.", "external_links": [], "published": "2015-10-01T19:19:00.000+03:00", "crawled": "2015-10-01T19:45:54.148+03:00", "highlightTitle": ""}