{"organizations": [], "uuid": "261ef6cf0c0f4ad6ad2983407ce5d2bae7a1f6be", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbsnews.com", "main_image": "http://cbsnews1.cbsistatic.com/hub/i/r/2015/10/16/df97573a-0bb2-4ec7-8d41-bf74e20d09f7/thumbnail/620x350/e852d92e62ab7a75db6e49f0f9daf6fd/cake-salad-split.jpg", "site_section": "http://www.cbsnews.com/", "section_title": "CBS News - Breaking News, U.S., World, Business, Entertainment &amp; Video ", "url": "http://www.cbsnews.com/news/prudent-diet-cognitive-decline-alzheimers-association-study/", "country": "US", "title": "Can you have your cake and protect brain health, too? New findings on diet and cognitive decline", "performance_score": 1, "site": "cbsnews.com", "participants_count": 2, "title_full": "Can you have your cake and protect brain health, too? New findings on diet and cognitive decline - CBS News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T23:13:00.000+03:00", "replies_count": 1, "uuid": "261ef6cf0c0f4ad6ad2983407ce5d2bae7a1f6be"}, "author": "Mary Brophy Marcus CBS News", "url": "http://www.cbsnews.com/news/prudent-diet-cognitive-decline-alzheimers-association-study/", "ord_in_thread": 0, "title": "Can you have your cake and protect brain health, too? New findings on diet and cognitive decline", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Is it OK to eat your burgers and fries as long as they come with a hearty helping of salad and blueberries on the side?\nResearch suggests when it comes to brain health, a heart-healthy diet rich in vegetables and fruits, whole grains, and fish is best for fending off cognitive decline . But study participants who ate a mix of healthy foods and less-healthy foods -- including red and processed meats, sugar, and beer -- still fared better on brain tests over a six year period compared to those who ate diets heavy on less-healthy foods.\nThe latest study, published in Alzheimer's & Dementia: The Journal of the Alzheimer's Association, analyzed the diets of more than 2,200 older adults from Sweden, comparing what they ate with their cognitive function over six years. The participants, aged 60 and up, were dementia -free at the start of the study. At that time, they were asked to answer a questionnaire about their diets, including how often and how much they ate of 98 different foods and beverages over the previous 12 months.\nThe researchers grouped the participants based on their diet patterns and how strongly they adhered to a \"Western\" diet or what was dubbed a \"prudent\" diet. \"Western\" eaters consumed more red and processed meats, and more foods with saturated and trans-fats, refined grains, sugar, beer, and liquor.\nThe MIND diet: 10 foods that fight Alzheimer's (and 5 to avoid) The \"prudent\" eaters more frequently ate vegetables, fruits, cooking/dressing oil, cereals and legumes, whole grains, rice and pasta, fish, low-fat dairy, poultry, and drank water.\nThe participants also underwent cognitive testing at the start of the study and again three years and then six years into the research.\nIndividuals with the highest adherence to a \"prudent\" diet and who were less likely to eat a \"Western\" style diet experienced the smallest decline in cognitive function over time. Individuals with the lowest adherence to a \"prudent\" diet, who conformed more to a \"Western\" eating pattern, showed an increase in cognitive decline over the six year period.\nCognitive decline is an age-related deterioration in brain function characterized by more difficulty with memory, language, and other cognitive functions.\n\"In our study population, we saw evidence that those who mostly consumed an unhealthy diet had approximately twice as much cognitive decline than those who consumed healthy and unhealthy diets together over time,\" said study author Behnaz Shakersain, a Ph.D. candidate in the Department of Neurobiology, Care Sciences and Society, at the Karolinska Institute Aging Research Center, in Stockholm.\nThe researchers also found, though, that participants who consumed an array of foods from both the \"prudent\" and \"Western\" diet patterns had only about half (54 percent) the decline in cognition on average than those in the group that ate a predominantly \"Western\" diet.\nSo, can we eat imperfectly and still fight brain decline if we make sure we eat some healthy foods, too?\n\"We can never make such a conclusion. As we have shown, those who had a mixed dietary pattern -- healthy and less healthy -- still had more cognitive decline as compared to those who adhered mostly to a healthy diet, even if the decline was not statistically significant. So, the main message is still to try to modify your diet towards entire healthy eating behaviors and patterns. It's never too early, never too late. The healthier you eat, the more benefits -- better cognition at older age -- you may gain,\" Shakersain told CBS News.\nDr. Eric Reiman, Executive Director at Banner Alzheimer's Institute, in Phoenix, said that the large, longitudinal study provides added support for the idea that dietary habits that are good for the heart may also be good for the brain.\n\"Closer adherence to a 'healthy diet' was associated with a slightly lower rate of decline in memory and thinking abilities in older adults. While actual prevention trials are needed to confirm the findings and clarify whether a healthy diet is also associated with a lower risk for the clinical onset of Alzheimer's disease , the findings may provide an additional incentive for people to watch what they eat to promote their physical and mental health,\" Reiman told CBS News.\nHeather Snyder, Ph.D., Director of Medical and Scientific Operations at the Alzheimer's Association, told CBS News, \"We can walk away with new information that supports the idea of eating a balanced diet.\"\nAdded Shakersain, \"Whether diet has an impact on specific cognitive domains -- attention, memory, language, planning and decision-making, etcetera -- needs more research.\"", "external_links": ["http://cbsnews2.cbsistatic.com/hub/i/r/2015/03/28/08dd53ab-c473-48a2-a58a-49d38f1156e8/thumbnail/220x140/0a0cf05f05a6db2b060ad53500cd5257/istock000006794852large.jpg"], "published": "2015-10-16T23:13:00.000+03:00", "crawled": "2015-10-17T05:01:56.115+03:00", "highlightTitle": ""}