{"organizations": [], "uuid": "ebafea869debe4f57d31ac9be49e43fb9281849e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "snn.bz", "main_image": "http://i1.wp.com/snn.bz/wp-content/uploads/2015/10/PRISONER_BANKERS.jpg?resize=700%2C450", "site_section": "http://SyndicatedNews.NET/feed/", "section_title": "Syndicated News - Live News Entertainment Political Music News", "url": "http://snn.bz/26bankers-74years/", "country": "US", "title": "26 BANKERS 74 YEARS IN PRISON", "performance_score": 0, "site": "snn.bz", "participants_count": 1, "title_full": "26 BANKERS 74 YEARS IN PRISON", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T08:44:00.000+03:00", "replies_count": 0, "uuid": "ebafea869debe4f57d31ac9be49e43fb9281849e"}, "author": "SyndicatedNews", "url": "http://snn.bz/26bankers-74years/", "ord_in_thread": 0, "title": "26 BANKERS 74 YEARS IN PRISON", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "[PHOTO ABOVE] THE KAUPÞING FOUR Former Chairman, Sigurður Einarsson, former CEO Hreiðar Már Sigurðsson, former CEO of Kaupþing Luxembourg Magnús Guðmundsson and Corporate Viking Ólafur Ólafsson , sentenced for market manipulation. Photo/Vísir.is \nBy James Woods \nUnlike the United States Department of Justice, Iceland focused on prosecuting the CEOs rather than low-level traders. In a move that would make many capitalists’ head explode if it ever happened here, Iceland just sentenced their 26th banker to prison for their part in the 2008 financial collapse. \nIn two separate Icelandic Supreme Court and Reykjavik District Court rulings, five top bankers from Landsbankinn and Kaupping — the two largest banks in the country — were found guilty of market manipulation, embezzlement, and breach of fiduciary duties. Most of those convicted have been sentenced to prison for two to five years. The maximum penalty for financial crimes in Iceland is six years, although their Supreme Court is currently hearing arguments to consider expanding sentences beyond the six year maximum. After the crash in 2008, while congress was giving American banks a $700 billion TARP bailout courtesy of taxpayers, Iceland decided to go in a different direction and enabled their government with financial supervisory authority to take control of the banks as the chaos resulting from the crash unraveled. \nBack in 2001, Iceland deregulated their financial sector, following in the path of former President Bill Clinton. In less than a decade, Iceland was bogged down in so much foreign debt they couldn’t refinance it before the system crashed. \nAlmost eight years later, the government of Iceland is still prosecuting and jailing those responsible for the market manipulation that crippled their economy. Even now, Iceland is still paying back loans to the IMF and other countries which were needed just to keep the country operating. \nWhen Iceland’s President, Olafur Ragnar Grimmson was asked how the country managed to recover from the global financial disaster, he famously replied, “We were wise enough not to follow the traditional prevailing orthodoxies of the Western financial world in the last 30 years. We introduced currency controls, we let the banks fail, we provided support for the poor, and we didn’t introduce austerity measures like you’re seeing in Europe.” \nMeanwhile, in America, not one single banking executive has been charged with a crime related to the 2008 crash and U.S. banks are raking in more than $160 billion in annual profits with little to no regulation in place to avoid another financial catastrophe. \nBANK CEO SIGURJÓN Þ. ÁRNASON: He and two other Landsbankinn Bank managers were sentenced to prison by the Supreme Court of Iceland. Photo/Vilhelm Gunnarsson \nSigurjón Þ. Árnason , former CEO of failed Landsbankinn, Elín Sigfúsdóttir , former director of corporate lending and Steinþór Gunnarsson , former director of brokerage were sentenced to serve time in prison by the Supreme Court of Iceland . \nMarket manipulation and fraudulent loans The three were sentenced for breach of fiduciary duty and market manipulation. Sigurjón and Elín had previously been acquitted by the Reykjavík District Court while Steinþór had been given a nine-month suspended sentence. The Supreme Court sentenced Sigurjón to three years in prison and Elín to 1.5 years. Steinþór was sentenced to nine months in prison. \nThe case revolved a 5.2 billion ISK loan (41 million USD/37 million EUR) to a company called Ímon on 30 September, just days before Landsbankinn and the entire Icelandic financial system collapsed. \nThe loan paid for the purchase of shares in Landsbankinn . The Supreme Court found that the Sigurjón and Elín arranged for the loan to buy over-priced shares, despite the lack of adequate collateral. \nSigurjón was then sentenced for having misrepresented the purchases of Landsbankinn shares by Ímon and a related company Azaela Resource s in an official notification to the Icelandic Stock Exchange . The purchases were made to look like Landsbankinn was receiving a new equity infusion when in reality the share purchase was fully financed with a loan from the bank itself. \nTHE THREE LANDSBANKINN BOSSES From the left: Steinþór Gunnarsson , Elín Sigfúsdóttir and Sigurjón Þ. Árnason . Photo/visir.is \nThe three will join three Kaupþing bosses already behind bars Earlier this year the Supreme Court sentenced three top managers of Kaupþing to prison for market manipulation and breach of fiduciary duties. Several cases against the Landsbankinn and Kaupþing bosses are still finding their way through the court system, as are cases against the managers of Glitnir, the third largest Icelandic bank prior to the financial collapse of 2008. \nSigurjón Þ. Árnason blasted the ruling, describing it as “inexplicable” and “flying against the rule of law”, but refused to comment further on the case, the local TV station Stöð 2 reported. \nWhy are the bankers being jailed? Since the burst of the 2008 financial bubble, Iceland has been used as both an example of the worst excesses of the bubble which burst in 2008, and as an example of how to deal with a financial crisis. \n\n\nJames Woods (AKA – JamesFromTheInternet) is an independent journalist based in New York City who can be reached on twitter @JamesFTInternet or via email: jamesftinternet@gmail.com 15 Current Visitors On This Page CRYPTO CURRENCIES ARE NOW LEGAL COMMODITIES Commodities are powered by Investing.com RECENT ARTICLES", "external_links": [], "published": "2015-10-24T08:44:00.000+03:00", "crawled": "2015-10-24T09:49:33.671+03:00", "highlightTitle": ""}