{"organizations": ["CBC"], "uuid": "5efc00d39b521772c3df67cff5ad63db1e6604f8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.brandonsun.com", "main_image": "http://media.brandonsun.com/designimages/squaresun_web.jpg", "site_section": "http://www.brandonsun.com/rss?path=/entertainment/breaking-news", "section_title": "Entertainment Breaking News", "url": "http://www.brandonsun.com/entertainment/breaking-news/dragons-den-addition-joe-mimran-bemoans-too-many-deals-on-cbc-series-331918651.html", "country": "US", "title": "'Dragons' Den' addition Joe Mimran bemoans 'too many deals' on CBC series", "performance_score": 0, "site": "brandonsun.com", "participants_count": 0, "title_full": "'Dragons' Den' addition Joe Mimran bemoans 'too many deals' on CBC series", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T20:56:00.000+03:00", "replies_count": 0, "uuid": "5efc00d39b521772c3df67cff5ad63db1e6604f8"}, "author": "", "url": "http://www.brandonsun.com/entertainment/breaking-news/dragons-den-addition-joe-mimran-bemoans-too-many-deals-on-cbc-series-331918651.html", "ord_in_thread": 0, "title": "'Dragons' Den' addition Joe Mimran bemoans 'too many deals' on CBC series", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Joe Mimran", "Cassandra Szklarski"], "text": "The Canadian Press - ONLINE EDITION 'Dragons' Den' addition Joe Mimran bemoans 'too many deals' on CBC series By: Cassandra Szklarski, The Canadian Press Sunday, Oct. 11, 2015 at 12:56 PM | Comments: 0 Report Error \nTORONTO - The new dragons on CBC-TV's reality series \"Dragons' Den\" showed some claws in their debut last week, but newcomer Joe Mimran says they were too soft in their rookie outing. \nThe tenth season debuted last Wednesday with the fashion titan and fellow newbie Michele Romanow agreeing to help fund a Vancouver-based crowdsourced delivery service. \nMimran says many more deals follow as the season progresses. \n\"I think we probably did too many deals, to be quite honest,\" Mirman said in a post-mortem earlier this year at a CBC event to introduce three new judges. \n\"There are a lot of deals that were done for either emotional reasons or because we were new, or whatever. I think we could have been, as a group, a touch tougher. Especially at the beginning.\" \nThird newcomer Manjit Minhas, who made her fortune as co-founder and co-owner of Minhas Breweries and Distillery, also jumped into the early deal-making by partnering with an Ottawa-based creator of a line of cocktail syrups. \n\"We will make lots of money together,\" she promised the wannabe mogul in last Wednesday's episode. \nVeteran dragon Jim Treliving said he scored 43 deals overall this season, just shy of his record of 46 deals. \nIf every agreement goes through it would cost the Boston Pizza boss $9.2 million, but he said that's not likely. \n\"What I look at is what happened (in) previous years ... 10 to 15 per cent come to fruition, for whatever reason,\" said Treliving. \n\"You don't know that when you're doing the show because you've got 45 minutes to make a decision. So what you look at is: Does this fit in with the criteria that I want to use and where I can do it? Have I got a connection that can help these people?\" \nReturning judge Michael Wekerle said he was especially gun shy this time around, noting he was burned by a deal last season that cost him $350,000. \n\"Last year I didn't bring a team behind me,\" said the flamboyant financial guru, a tech industry trader known for his rock'n'roll passions. \n\"You've got to remember one thing: You can't pay enough for good lawyers, accountants and good people working with you.\" \nNevertheless, he said he's happy with a lot of the partnerships he formed last year, even if they weren't all financial successes. \nThe new dragons were front-and-centre in the season premiere, with Joe Fresh founder Mimran taking the centre chair while Buytopia co-founder Romanow and beer baroness Minhas took either side. \n\"This is the first time that we've ever changed three dragons in one year which makes a huge difference and I think the whole perspective of the show has changed,\" said Treliving. \n\"Dragons' Den\" airs Wednesdays on CBC-TV.", "external_links": [], "published": "2015-10-11T20:56:00.000+03:00", "crawled": "2015-10-12T05:40:57.889+03:00", "highlightTitle": ""}