{"organizations": [], "uuid": "076e4f5d4b2545e7cbf8dddef5ec1a486a68bb49", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48524/entertainment", "section_title": "Entertainment - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30319363/entrepreneur-magazine-releases-first-entrepreneur-360-performance-index-the-most-comprehensive-analysis-of-private-companies-in-america", "country": "US", "title": "Entrepreneur Magazine Releases First Entrepreneur 360™ Performance Index, The Most Comprehensive Analysis Of Private Companies In America", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Entrepreneur Magazine Releases First Entrepreneur 360™ Performance Index, The Most Comprehensive Analysis Of Private Companies In America - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "076e4f5d4b2545e7cbf8dddef5ec1a486a68bb49"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30319363/entrepreneur-magazine-releases-first-entrepreneur-360-performance-index-the-most-comprehensive-analysis-of-private-companies-in-america", "ord_in_thread": 0, "title": "Entrepreneur Magazine Releases First Entrepreneur 360™ Performance Index, The Most Comprehensive Analysis Of Private Companies In America", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Entrepreneur Magazine\nGroundbreaking Study Offers a 360-View of What's Driving U.S. Business Today\nIRVINE, Calif. , Oct. 21, In order to gain a multi-dimensional perspective on entrepreneurship today, the Entrepreneur 360™ Performance Index studied companies that exemplify sustained growth. By taking a 360-degree view of U.S. businesses and examining how they have attained lasting success over multiple years, the study resulted in uncovering six paths for achieving sustainable growth and recognizes the distinguished group of extraordinary companies demonstrating them.\nThe six paths, presented as entrepreneurial archetypes, for achieving continued success are: best practicers, data champions, controllers, classics, forward thinkers and contrarians. Featured in the redesigned November issue of Entrepreneur and on Entrepreneur.com , these archetypes embody key characteristics, processes, and additional takeaways that drive sustainable growth.\n\"Each archetype represents a unique set of objectives, strategies, and tactics, and each demonstrates the trade-offs between actions that increase the probability of success and those that can increase operational risk,\" explains Lisa Murray , Chief Insights Officer of Entrepreneur Media, Inc. \"The companies recognized in the E360 Performance Index fall into one of the six we've identified. While each company was founded by individuals driven by unique visions of how to create higher value for customers in both emerging and mature industries, it's through extraordinary implementation that they have achieved lasting success.\"\nConducted through in-depth surveys and research, the team of editors and researchers behind the E360 Performance Index, in partnership with the Business Dynamics Research Consortium , collected more than 250 pieces of data from hundreds of companies, focusing on growth drivers and challenges, goal setting, resource allocations, and reward systems. The company founders who participated were surveyed on multiple factors that go beyond the traditional measurements of success, including market sector, sales territory, target growth rates, culture and other company functions. Companies had to be based in the U.S., privately owned, involve the original founder of the company, and have at least three years within a five-year period that they added employees.\nThis analysis uncovered a subset of companies, as noted above, whose continued success is largely based on superior value creation for their customers, building an adaptive learning culture, and aggressive geographic expansion-making them the most dynamic firms in America today. Those companies have been designated the \"Best Entrepreneurial Companies in America\" for 2015 by Entrepreneur.\n\"Those honored have identified a problem, come up with a unique solution, and bravely built their enterprises around it,\" says Ryan Shea , president of Entrepreneur Media. \"They've accomplished new ways of producing sustainable growth and are an inspiration to others who want to fulfill their own entrepreneurial goals.\"\nAccording to research conducted by the Business Dynamics Research Consortium (BDRC), less than one percent of U.S. businesses expanded capacity three or more years out of the past five. On average, they grew by 41% over the period whereas all other surviving companies lost an average of 4%. Based on their analysis of 19.1 million for-profit US businesses, sustained growers are statistically more likely to survive and continue to grow over the next five years than any other group of businesses in the economy.\n\"The companies identified in the E360 Index are sustained growers, and based on our research, have proven adept at navigating the changing challenges of their marketplace to win new business and grow their output capacity year after year,\" says Gary Kunkle , senior research fellow at the Business Dynamics Research Consortium and research partner of the E360 Performance Index.\nFor additional details on the E360 Performance Index, including the archetypes derived from the study and the companies recognized, visit: http://entm.ag/E360Index\nABOUT ENTREPRENEUR MEDIA INC.\nFor nearly 40 years, Entrepreneur Media Inc. has been serving the entrepreneurial community providing comprehensive coverage of business and personal success through original content and events. Entrepreneur magazine, Entrepreneur.com, and publishing imprint Entrepreneur Press provide solutions, information, inspiration and education read by millions of entrepreneurs and small business owners worldwide.\nTo learn more, visit entrepreneur.com .\nFollow us on Twitter at @Entrepreneur and like us on Facebook at facebook.com/entmagazine.\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/entrepreneur-magazine-releases-first-entrepreneur-360-performance-index-the-most-comprehensive-analysis-of-private-companies-in-america-300164128.html\n ", "external_links": ["http://www.entrepreneur.com/", "http://entm.ag/E360Index", "http://www.entrepreneur.com/article/251291", "http://www.xmlnews.org/ns/", "http://www.facebook.com/EntMagazine", "https://twitter.com/Entrepreneur", "http://rt.prnewswire.com/rt.gif?NewsItemId=LA35070&Transmission_Id=201510211552PR_NEWS_USPR_____LA35070&DateId=20151021", "http://www.prnewswire.com/news-releases/entrepreneur-magazine-releases-first-entrepreneur-360-performance-index-the-most-comprehensive-analysis-of-private-companies-in-america-300164128.html", "http://exceptionalgrowth.org/"], "published": "2015-10-21T03:00:00.000+03:00", "crawled": "2015-10-22T01:20:49.968+03:00", "highlightTitle": ""}