{"organizations": [], "uuid": "3f66524cfc3305061ced1bb9b3234c9d71709093", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.democratandchronicle.com", "main_image": "http://www.gannett-cdn.com/-mm-/900873bc9b6da1dbb0ecb5351c686e5de0559856/c=0-168-4650-2795&amp;r=x633&amp;c=1600x630/local/-/media/2015/10/23/Rochester/Rochester/635812099199156295-Jg-101615-Rhinos-17.jpg", "site_section": "http://www.democratandchronicle.com/life/rocroots/", "section_title": "Democrat and Chronicle | Rochester news, community, entertainment, yellow pages and classifieds. Serving Rochester, New York | democratandchronicle.com", "url": "http://www.democratandchronicle.com/story/sports/soccer/blogs/daily-devo/2015/10/23/devo-2015-rhinos-forever-team/74471434", "country": "US", "title": "Devo: 2015 Rhinos, a 'forever' team among club's greats", "performance_score": 0, "site": "democratandchronicle.com", "participants_count": 1, "title_full": "Devo: 2015 Rhinos, a 'forever' team among club's greats", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T23:24:00.000+03:00", "replies_count": 0, "uuid": "3f66524cfc3305061ced1bb9b3234c9d71709093"}, "author": "democratandchronicle.com", "url": "http://www.democratandchronicle.com/story/sports/soccer/blogs/daily-devo/2015/10/23/devo-2015-rhinos-forever-team/74471434", "ord_in_thread": 0, "title": "Devo: 2015 Rhinos, a 'forever' team among club's greats", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "It has been a week now, a week since the Rhinos won the USL Championship , a week since they became one of those forever teams, the ones we remember for all time. From the start of the season, which included an incredible 19-match unbeaten streak (12-0-7), to the very end, when they pulled off a remarkable comeback, these Rhinos were special. They earned and deserved their place among the franchise’s greats, joining those A-League title teams from 1998, 2000 and 2001 and the 1999 U.S. Open Cup championship squad.\nThis club developed that kind of swagger, that air of invincibility. You saw and felt it coming in the first three months. Even when Rochester didn’t play its best, it found a way to win or tie a match. And then late last Friday night, in the cold and after the rain had stopped, just when it looked like what was supposed to be another magical night at Sahlen’s Stadium would be spoiled, these Rhinos delivered again.\nRookie forward Asani Samuels saved them, coming off the bench to score goals in the 91st and 113th minute – the first in the dying minutes of stoppage time, the second in overtime – as the old guard of the USL with a new breed of winners, edged the newbies, the Los Angeles Galaxy II, 2-1. About 5,000 fans were there, braving the elements and this team’s recent history of failure and like the players and coaches, they deserved every bit of the celebration.\nBuy Photo Rhinos Asani Samuels goes up for a header that turned out to be the winning goal in overtime to beat the LA Galaxy ll, 2-1 to capture the USL championship. (Photo: Jamie Germano/@jgermano1/, STAFF PHOTOGRAPHER)\nYes, the fan base is much smaller than in the club’s heyday. So what. This was about a team and a coaching staff that stood up all season and said: Forget about the past; look what WE are doing. Whether local fans did or not, so be it. And if you weren’t there or didn’t pay attention, shame on you because you missed a magical moment. Two of them, really.\nForever moments.\nIt just doesn’t happen like that in soccer. It was like hitting a 3-pointer at the buzzer or a grand slam in the bottom of the ninth to tie the game. We’ve been blessed around here, if you’ve been paying attention for as long as I have, to be connected now to three such moments.\nThe first happened July 12, 1996: Doug Miller scored in the final seconds of the inaugural match at Frontier Field, completing a hat trick and comeback from a two-goal deficit to beat Montreal, 3-2. It was the first of so many memorable Rhinos triumphs there, forever teams and championships feeling so automatic around here, like the changing of the seasons.\nThe second happened July 10, 2011 with a much bigger spotlight. That’s when Abby Wambach flew through the air and spiked home her header in stoppage time to tie the 2011 World Cup quarterfinals against Brazil. That came in the 122nd minute and was voted the most memorable goal in the history of the United States soccer program, men or women.\nROCHESTER DEMOCRAT AND CHRONICLE\nChampionship flashback: Past Rhinos league title games\nThen came Samuels, 24 and barely a factor most of the season. He’d played just 188 minutes in USL action and that included just five minutes in the two playoff matches that preceded Friday night. But with top forwards Steevan Dos Santos (suspended) and rookie Christian Volesky (injured) and their 18 goals combined unavailable, Bob Lilley, a resourceful coach if there ever was one, found a winning formula.\nSamuels replaced rookie Nate Bordeau in the 80th minute. “We’ve won in so many different ways that there are solutions. There are just different solutions,” Lilley said the day before the title match about his lineup, knowing he’d probably need to find a new hero.\nI’ve thought for several years that Sahlen’s Stadium, by whichever name you wanted to call it, was cursed. But that changed last Friday. Of course, I wasn’t thinking that in the 65th minute when the Galaxy II took the lead on two hustle headers and a good bounce off the crossbar that led to Ariel Lassiter’s easy putaway.\n“My heart is broken for them,” former Rhinos star goalie Scott Vallow, watching from Portland, Oregon, texted me as the final minutes of regulation ticked away when we both thought the curse had done it again.\nWhy wouldn’t we think that?\nWhen Lassiter scored I thought: Here we go again.\nLike a lot of big nights at that stadium, starting with the monsoon-like weather for its inaugural match on June 3, 2006, this one appeared to be spoiled. Often Mother Nature has been the culprit, producing horrible weather for big matches. Honestly, that rarely happened from 1996-2005 at Frontier Field. Rochester Red Wings staffers used to joke that they knew when the soccer team was playing at home back then because the weather was usually great.\nROCHESTER DEMOCRAT AND CHRONICLE\nRhinos tie it late to force OT, edge L.A. for USL title\nOther times since the move to the soccer stadium, the opponent stole the show. Vancouver Whitecaps, coached by Lilley, did it in the 2006 USL First Division title match, burying Rochester, 3-0. Then simply there were plays on the field when I swore something spooked the Rhinos. They missed penalty kicks they shouldn’t have in a sure-fire U.S. Open Cup upset of New England (MLS) when Vallow was brilliant turning away three shots.\nIn 2012, team captain Troy Roberts – a smart and steady center back who is one of the few in the new era of the Rhinos that deserves a spot in their Hall of Fame – missed a PK that would have put Rochester in the league title match. That was Jesse Myers’ first season as coach. The next one, the bottom fell out and the Rhinos missed the playoffs for the first and only time ever.\nHere came Lilley, 49, back to rebuild for 2014 the way he’d done it in 2010. He gutted the roster, found good, young players and some others with experience. This team got him, understood how his mind worked and worked hard for him and for themselves. We talked a lot this season about the way he trusted them to put in the effort, night in and night out. They fought every single minute and do you know how often you can say that about teams? Rarely. These players were prideful and stubborn – just like their coach.\nBuy Photo Rhinos head coach Bob Lilley from the sidelines during the rainy first half of the USL title match. (Photo: Jamie Germano/@jgermano1/, STAFF PHOTOGRAPHER)\nThe team president, Pat Ercoli, is that way, too. His legacy as the head coach for Rochester’s first four title teams will always be there, but Ercoli’s been on the job as team president since 2011. He knew Lilley was the coach to rebuild – twice – and early Friday he also felt fate might finally shine down on the Rhinos, his Rhinos. He’s the only person who’ll end up with five championship rings.\nErcoli saw a harbinger last Friday morning. Around 8:30 he and Sahlen’s Stadium operations manager Rob Taylor were getting things ready for the championship match. Taylor told Ercoli to look up at the sky. “I was like, ‘That’s unbelievable,’ ” Ercoli said about the rainbow hovering over the soccer stadium.\nAbout 13 hours later, at exactly 9:33 p.m., Ercoli and everyone else at the stadium were saying the same thing when Samuels and all those other guys on the field who believed, rescued Rochester. Ercoli posted on Facebook that the rainbow, he thought, was his mother’s way of telling him the team he loves was going to be OK.\nMatilde Ercoli, 86, died on May 12. Her son was right.\nThe Rhinos were finally champions again.\nTeam captain and midfielder Tony Walls, an ironman for sure, and fourth-year goalkeeper Brandon Miller, a first-year starter who left no doubt about his ability, led this group that included talent and hustlers, guys who’d bleed for the jersey the way some old stars would. Some numbers were remarkable, too:\n20-1-10 record, the one loss is the fewest ever, better than the 1998 club that went 30-4. 15-0-2 at home, where they outscored foes 28-7, the first unbeaten home mark since 2001. 17 shutouts and just 15 goals allowed tied franchise marks from 1998 and set new-USL era records. Overall with the playoffs, it was 19 shutouts and only 16 goals allowed. 40 goals scored in the regular season was the most since 2005. Tack on five more in the playoffs. 45-16 goal-differential, plus 29, the number that Lilley is most proud of. #Drive4Five was the social media hashtag the team used all season, a reminder of the club’s history going after a fifth title. Back in 2002, we ran a season preview package in the Democrat and Chronicle that accompanied a picture of former star midfielder Lenin Steenkamp giving two thumbs up to the Frontier crowd. Headline: “ONE FOR THE THUMB.”\nThe words and picture matched up perfectly. Truth is, things around here have been far from perfect since then and there’s no need to dredge it all up again. But this club must use this title as a new starting point. Invest more. Spend more. Work hard in the offseason to get groups of fans back to matches.\nThe USL, which had just 14 teams in 2014, is getting bigger and better. It’ll add six more teams in 2016 and is up to 30. If the Rhinos don’t step it up, they’ll get left behind.\nBut 13 years later, they finally got that fifth ring.\nThumbs up to the 2015 Rhinos. Special team. Forever team.", "external_links": ["http://www.gannett-cdn.com/media/2015/10/23/Rochester/Rochester/635812104175744196-JG-101615-Rhinos-1.jpg", "https://www.youtube.com/embed/A-Hh7nBdgp8?feature=oembed", "http://www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/cc2cc2419ccef93323528ea8ed06e32b87f3b260/c=120-0-840-720/local/-/media/2015/10/16/Rochester/Rochester/635805960576999880-12096055-10207356312043286-6201968165929224401-n.jpg", "http://www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/408e3eef1f5da5b2cc49d8e10a8e762bae84362c/c=0-152-2554-2706/local/-/media/2015/10/16/Rochester/Rochester/635806295263360363-JG-101615-Rhinos-3.jpg", "http://www.gannett-cdn.com/-mm-/cde6e3fe83edd3ca6fa44f2b0222d78f5ae2025c/c=0-111-3876-2301&r=x329&c=580x326/local/-/media/2015/10/23/Rochester/Rochester/635812102249443848-Jg-101615-Rhinos-15.jpg", "http://www.gannett-cdn.com/-mm-/5bec5b288a76674a62d387cb464f38ecc8da9f7a/c=6-0-5178-2922&r=x329&c=580x326/local/-/media/2015/10/23/Rochester/Rochester/635812104175744196-JG-101615-Rhinos-1.jpg", "http://www.gannett-cdn.com/media/2015/10/23/Rochester/Rochester/635812102249443848-Jg-101615-Rhinos-15.jpg"], "published": "2015-10-23T23:24:00.000+03:00", "crawled": "2015-10-25T02:04:45.622+02:00", "highlightTitle": ""}