{"organizations": [], "uuid": "e1aa99967c7103d81e3d819c3c74c94cea6aff41", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.winnipegsun.com", "main_image": "http://storage.winnipegsun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297758502900_LARGE_BOX.jpg?quality=80&stmp=1444409985927&size=100x", "site_section": "http://www.winnipegsun.com/entertainment/rss.xml", "section_title": "Top Entertainment stories", "url": "http://www.winnipegsun.com/2015/10/09/chrissie-hyndes-tales-of-a-reckless-life-puts-her-at-centre-of-rape-debate", "country": "CA", "title": "Chrissie Hynde's tales of a reckless life puts her at centre of sex assault debate", "performance_score": 0, "site": "winnipegsun.com", "participants_count": 0, "title_full": "Chrissie Hynde's tales of a reckless life puts her at centre of sex assault debate", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T19:46:00.000+03:00", "replies_count": 0, "uuid": "e1aa99967c7103d81e3d819c3c74c94cea6aff41"}, "author": "", "url": "http://www.winnipegsun.com/2015/10/09/chrissie-hyndes-tales-of-a-reckless-life-puts-her-at-centre-of-rape-debate", "ord_in_thread": 0, "title": "Chrissie Hynde's tales of a reckless life puts her at centre of sex assault debate", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Chrissie Hynde"], "text": "Chrissie Hynde breaks her silence about controversial rape remarks \nNEW YORK -- She may be 64 now, but Chrissie Hynde is still one tough rock 'n' roller. \nShe proved that once again this week when a simmering controversy over a passage in her new memoir blew up in a hostile interview with a National Public Radio reporter . Hynde complained profanely when reporter David Greene asked about critics of her recounting of a long-ago assault, saying she felt under attack by a lynch mob. \nThe anecdote has overshadowed \"Reckless: My Life as a Pretender,\" a tale of rock debauchery she waited until after her parents died to tell, and its author is plainly sick of it. \nThe episode took place in Ohio, where Hynde grew up before moving to England in the 1970s. The future rock star, zonked on drugs, was taken to an abandoned house by bikers who demanded sexual favours and threatened violence. Hynde isn't specific about what happened, other than to say she \"humoured\" her attackers and gave them Quaaludes. \"I never say I was raped,\" she says now. \nShe wrote that, \"however you want to look at it, this was all my doing and I take full responsibility. You can't (mess) around with people, especially people who wear 'I Heart Rape' and 'On Your Knees' badges.\" \nHer elaboration in a London newspaper interview, where she said it was \"common sense\" not to entice an unhinged person through provocative dress and actions, was criticized for a blame-the-victim mentality. \"I can't believe this (expletives), singer Lucinda Williams wrote on Facebook. \"Come on, Chrissie!\" \nHynde's touchiness with NPR brought new attention. Given the lightning speed of social media, it led to a backlash against the backlash. \nWhile not defending Hynde's attitude toward assault, Sophie Gilbert wrote in The Atlantic that \"the instinct to lash out at someone who's honest about a terrible thing that happened to her, and to victimize her once again, ultimately says more about the people doing the shaming than it does the supposed perpetrator.\" \n'STORY OF MY GENERATION' \nHynde told The Associated Press that she was writing her own story and tried to keep it light. \n\"That was the story of my generation,\" she said. \"These bikers were the security guards at all the gigs. They were selling drugs and they had motorcycles and they looked better than the hippies. That's all we knew. We were little kids from the suburbs. If you put the same group of motorcycle riders in any music venue these days they would stick out like a sore thumb, and I mean a very attractive sore thumb.\" \nIt doesn't take a deep dive into Hynde's music to note a weakness for rough boys. One of the threats made that night by a biker -- \"shut up or you're going to make some plastic surgeon rich\" -- eventually found its way into her lyrics. \nAs detailed in \"Reckless,\" Hynde has lived large. She witnessed the Kent State shootings, received her first kiss at a Sam Cooke concert from the star himself, nearly married two members of the Sex Pistols, played in an early version of The Clash, had Ray Davies' daughter, drank and doped prodigiously and became a Rock and Roll Hall of Fame member by the force of her will. \nThe tragic end of the original Pretenders, with the deaths of guitarist James Honeyman-Scott in 1982 and bass player Pete Farndon in 1983, also end her story. In Farndon's case, Hynde details a painful conversation with his mother, who blamed her son's death on a descent into a heroin use after he was fired from the band; Hynde told her he was fired because of heroin. \nFor 15 years after Honeyman-Scott's death, Hynde wrote, she felt his voice in her ear telling her what to do, \"and then slowly, he seemed to fade away.\" She kept going, recruiting new versions of the Pretenders, although she says now the band name should have been retired. \nLike with her parents, Hynde waited to tell the story of her conversation with Farndon's mother until after the woman died. She made an effort to protect others, saying the book is really \"Reckless Lite,\" although that's a little frightening to ponder. \nHer marriage to singer Jim Kerr isn't mentioned because it happened after the story ended. Hynde said she was pressured by publishers to write about her relationship with Davies while he asked her to keep him out. It led to an uncomfortable middle ground where she discusses some of their epic fights and aborted attempt to marry, and little else. \nHYNDE RESPONDS TO CRITICS \nThe imperatives of writing a book and Hynde's \"what happens backstage, stays backstage\" attitude leads to inconsistencies. \n\"I was told there were a few criticisms that I didn't get into my personal life,\" she said. \"My answer to those critics is go (expletive) yourselves. I'm not here to talk about my personal life for one reason -- because it's considered a form of treason to betray anybody you've been in some kind of a personal relationship with.\" \nSo what about that story of lying in bed in her underwear next to a naked Iggy Pop as he made a rather specific request? \n\"I said I slept with him,\" she said. \"I wasn't in a relationship with him and I never said I had sex with him. He was a mate. I don't think I betray anything in there. Nothing that happened between me and Iggy Pop hasn't happened with another 10,000 women in America who went to see Iggy Pop shows.\" \nHynde has long since cleaned up. She writes that \"it's easy to see that the moral of my story is that drugs, including tobacco and alcohol, only cause suffering.\" But she isn't interested in preaching. \nFor all the rock star tales, a subtext of \"Reckless\" is something many people her age can relate to: a bitter generation gap with her parents that she regrets was never resolved. They were proud of her -- kept a \"Pretenders\" bumper sticker on their car -- but the tension and miscommunication never ended. They cringed over her arrests for animal rights activism. They hated her swearing. \n\"I hope when people read this they will think, 'Oh yeah, that was me, and I wasn't so alone in having a (lousy) relationship with my parents,'\" Hynde said. \"This was something that happened to a lot of people and it was because of external factors. It wasn't me and them, it was more me and the world, and then them.\" Sponsored Links", "external_links": [], "published": "2015-10-09T19:46:00.000+03:00", "crawled": "2015-10-09T20:41:05.572+03:00", "highlightTitle": ""}