{"organizations": [], "uuid": "aecf90cf0bee0518269815840068fc588f1e5e0d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ibtimes.co.uk", "main_image": "http://d.ibtimes.co.uk/en/full/1462998/jazbaa.png", "site_section": "http://ibtimes.co.uk//rss/entertainment", "section_title": "IBTimes.co.uk : Entertainment", "url": "http://www.ibtimes.co.uk/jazbaa-movie-review-aishwarya-rai-bachchan-excels-comeback-film-1523487", "country": "US", "title": "Jazbaa movie review: Aishwarya Rai Bachchan excels in comeback film", "performance_score": 0, "site": "ibtimes.co.uk", "participants_count": 0, "title_full": "Jazbaa movie review: Aishwarya Rai Bachchan excels in comeback film", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T16:03:00.000+03:00", "replies_count": 0, "uuid": "aecf90cf0bee0518269815840068fc588f1e5e0d"}, "author": "", "url": "http://www.ibtimes.co.uk/jazbaa-movie-review-aishwarya-rai-bachchan-excels-comeback-film-1523487", "ord_in_thread": 0, "title": "Jazbaa movie review: Aishwarya Rai Bachchan excels in comeback film", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Aishwarya Rai Bachchan"], "text": "October 11, 2015 14:03 BST Updated 1 min ago Jazbaa review White Feather Films \nBollywood star Aishwarya Rai Bachchan returns to the big screen after five long years with director Sanjay Gupta's stylish thriller Jazbaa. Rai's last film Guzaarish (2010) was a big flop and that could be the reason the actress has chosen more 'box office-friendly' projects like Jazbaa and Karan Johar's upcoming film Ae Dil Hai Mushkil as her comeback movies. \nJazbaa, a remake of the 2007 South Korean film Seven Days, like most films directed by Gupta (Zinda, Musafir, Kaante) is more style than substance. The film features a chic and dapper lead pair running around looking really troubled, intense and serious. \nRai plays Anuradha Verma/Anu, a hotshot lawyer who has never lost a case. She's also a loving and caring single mum who seems to be balancing her personal and professional lives perfectly. All is well until the daughter gets kidnapped and as ransom Anu needs to take on the case of a convicted rapist and murderer named Miyaaz and get him bail. \nIn this mix is her college friend and \"decorated\" police inspector Yohaan (Irrfan Khan). Yohaan has been suspended on charges of corruption and expects Anu to help him out of the mess. This is before he gets involved in her predicament as he's the cop who put Miyaaz in jail in the first place. What follows is how the duo tries to defeat the bad guys, rescue the young damsel in distress and, in the process, correct a few wrongs in their own lives. \nRai excels in terms of giving a knockout performance and looking like a million bucks. Tighter screenplay and better direction could have helped her go the distance with this film. Irrfan Khan, who is clearly one of the best actors in Bollywood today, tries his utmost to fit in a more 'commercial' setup but this film is clearly not one his finer performances. More on Bollywood", "external_links": [], "published": "2015-10-11T16:03:00.000+03:00", "crawled": "2015-10-11T16:05:42.968+03:00", "highlightTitle": ""}