{"organizations": [], "uuid": "6333545e0c17d086afdce54e9daa49004c931e5c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48524/entertainment", "section_title": "Entertainment - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30345598/steelers-all-pro-running-back-leveon-bell-announces-the-bells-boys-initiative", "country": "US", "title": "Steelers All Pro Running Back Le'Veon Bell Announces The \"Bell's Boys\" Initiative", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Steelers All Pro Running Back Le'Veon Bell Announces The \"Bell's Boys\" Initiative - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T02:00:00.000+02:00", "replies_count": 0, "uuid": "6333545e0c17d086afdce54e9daa49004c931e5c"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30345598/steelers-all-pro-running-back-leveon-bell-announces-the-bells-boys-initiative", "ord_in_thread": 0, "title": "Steelers All Pro Running Back Le'Veon Bell Announces The \"Bell's Boys\" Initiative", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Information contained on this page is provided by an independent third-party content provider. WorldNow and this Station make no warranties or representations in connection therewith. If you have any questions or comments about this page please contact pressreleases@worldnow.com .\nSOURCE Le'Veon Bell\nPITTSBURGH , Oct. 25, 2015 /PRNewswire/ -- Le'Veon Bell, All Pro running back and Pittsburgh Steelers MVP, is launching The Bell's Boys Initiative, a leadership and mentorship program designed to encourage Pittsburgh -area high school-aged youth to begin planning their futures today. The key mission of The Bell's Boys Initiative is to teach and demonstrate the principles of manhood to high school-aged young men in the Pittsburgh community. The 2015 Bell's Boys class will consist of 10 Woodland Hills High School male student-athletes.\nThe first Bell's Boys event will be a fine dining experience on October 27, 2015 at The Capital Grille in downtown Pittsburgh. The students' evening will include roundtrip transportation provided by Uber Pittsburgh. During dinner, Le'Veon and the young men will discuss life goals and how each of the students can individually achieve those goals.\n\"My mom always stressed to me the importance of establishing a plan early to reach my goals,\" said Bell. \"She constantly pushed and motivated me. Not all kids have this type of influence in their lives. I hope that The Bell's Boys Initiative can help to motivate these young men to reach their dreams.\"\nLe'Veon also will be bringing the 2015 Bell's Boys class to the Steelers home game on November 15th , against the Cleveland Browns. 2015 Bell's Boys partners include The Capital Grille, Uber Pittsburgh, and H.H. Seiferth Signs.\nAbout Le'Veon Bell:\nLe'Veon Bell was drafted by the Pittsburgh Steelers in 2013. He rushed for 2,221 yards in his first two seasons of his NFL career, the most by a Steeler in their first two years with the team. He set a franchise record for the most yards from scrimmage by a Steeler in their first two seasons. He became the third player in NFL history to eclipse 2,000 scrimmage yards in a season without fumbling. In 2015 he was awarded the Steelers' MVP honor, AFC Offensive Player of the Year, FedEx Ground Player of the Year, Fantasy Player of the Year and selected to the Pro Bowl. Off the field, Le'Veon launched The Bell's Boys Initiative, a leadership and mentorship program designed to encourage Pittsburgh -area high school-aged youth to begin planning their futures today.\nSocially: Twitter ( @ ) L_Bell26, Facebook ( @ ) LeVeonBellOfficial and Instagram @SteelerRB26\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/steelers-all-pro-running-back-leveon-bell-announces-the-bells-boys-initiative-300165806.html\n©2015 PR Newswire. All Rights Reserved.", "external_links": ["http://rt.prnewswire.com/rt.gif?NewsItemId=DC37599&Transmission_Id=201510251752PR_NEWS_USPR_____DC37599&DateId=20151025", "http://www.prnewswire.com/news-releases/steelers-all-pro-running-back-leveon-bell-announces-the-bells-boys-initiative-300165806.html", "http://www.xmlnews.org/ns/"], "published": "2015-10-25T02:00:00.000+02:00", "crawled": "2015-10-26T02:14:08.953+02:00", "highlightTitle": ""}