{"organizations": [], "uuid": "b8888eaf2a92e8354fa8d9caf6f96c3a97f2bb37", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-5622ca08/turbine/ct-notre-dame-usc-football-spt-1018-20151017", "site_section": "http://www.chicagotribune.com/", "section_title": "Chicago Tribune: Chicago breaking news, sports, business, entertainment, weather and traffic - Chicago Tribune", "url": "http://www.chicagotribune.com/sports/college/ct-notre-dame-usc-football-spt-1018-20151017-story.html", "country": "US", "title": "Lot of tricks and treats in Notre Dame&apos;s 41-31 victory over USC - Chicago Tribune", "performance_score": 0, "site": "chicagotribune.com", "participants_count": 1, "title_full": "Lot of tricks and treats in Notre Dame&apos;s 41-31 victory over USC - Chicago Tribune", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T06:54:00.000+03:00", "replies_count": 0, "uuid": "b8888eaf2a92e8354fa8d9caf6f96c3a97f2bb37"}, "author": "Paul Skrbina", "url": "http://www.chicagotribune.com/sports/college/ct-notre-dame-usc-football-spt-1018-20151017-story.html", "ord_in_thread": 0, "title": "Lot of tricks and treats in Notre Dame&apos;s 41-31 victory over USC - Chicago Tribune", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "USC entered this weekend unranked, under duress and under its fourth head coach in four years.\nNotre Dame entered ranked 14th and still rankled by an embarrassing 35-point loss to the Trojans last season.\nThe rivals met again Saturday night at Notre Dame Stadium — their 87th encounter — the Trojans five days removed from the removal of coach Steve Sarkisian, who reportedly showed up to a meeting Sunday with alcohol on his breath.\nUSC interim coach Clay Helton, in his second such stint in the role, and the Trojans left South Bend 41-31 losers against the Irish.\nBut not without seeing a game full of tricks and treats.\n\"We came in and said we were going to fire every bullet,\" Helton said.\nThe treats included a pair of one-play, 75-yard scoring drives — one for each team. First came Notre Dame's, on a pass from DeShone Kizer to Will Fuller in the first quarter. The second treat included a trick, when JuJu Smith-Schuster caught a receiver-to-receiver prayer from Jalen Greene to pull USC within seven with 5 minutes, 41 seconds left in the second.\nThen there was Corey Robinson's diving, 10-yard scoring catch with 9:06 left that landed Notre Dame a 38-31 lead upon Robinson's landing. That treat was preceded by a trick at the hands of Torii Hunter Jr., who turned a lateral into a 35-yard completion to Alize Jones to set up the score.\nWill Fuller after Notre Dame beat USC Notre Dame receiver Will Fuller on the win over USC.\nNotre Dame receiver Will Fuller on the win over USC.\nSee more videos Can't forget the \"wow\" interception that landed in the hands of Notre Dame defensive back KeiVarae Russell with 8:18 left and Russell wearing USC receiver like a drape. That eventually led to a 32-yard Justin Yoon field goal and a 41-31 advantage for Notre Dame.\nMax Redfield followed with a \"wow\" interception of his own after Russell's deflection found him with just more than five minutes left.\n\"Just your normal, everyday Notre Dame-USC football game, I guess,\" Irish coach Brian Kelly said. \"If you like offensive football, it certainly had that tonight.\n\"(The Irish) turned some question marks into exclamation points. I thought KeiVarae Russell's interception was huge.\"\nKelly's name has popped up in speculation as Helton's eventual successor, rumors he called \"a lot of noise.\"\nBesides, Kelly has enough to worry about with his current team, which allowed a touchdown on its opponent's first drive for the third straight game and entered the half tied 24-24 with the Trojans after leading 24-10.\nNotre Dame was nearly a year removed from a 49-14 loss in Los Angeles that helped orchestrate Malik Zaire's move from backup quarterback to starter, ahead of Everett Golson.\nGolson is gone now, at Florida State. Zaire, too — on the sideline with a season-ending ankle injury he suffered at Virginia.\nIn Zaire's place was Kizer, who was 15-for-24 for 227 yards and a pair of touchdowns in his fifth start. Three of Kizer's completions found Fuller, who had 131 yards to complement his touchdown. C.J. Prosise ran for 143 more in his fifth 100-plus yard game this season.\nUSC quarterback Cody Kessler was back, though. He torched the Irish last year when he for 372 yards and six touchdowns. This time around, Kessler, coming off a 156-yard, two-interception showing during a loss to Washington, was 30-for-46 for 365 yards and two touchdowns.\nAnd two more interceptions.\n\"We remember last year,\" Kelly said last week. \"We want to perform a whole lot better.\"\nThe Irish had to if they hoped to stay in the conversation for the College Football Playoff.\nAnd so they did.\npskrbina@tribpub.com\nTwitter @ChiTribSkrbina\n2-minute drill\nPregame scare: USC athletic director Pat Haden, a former color commentator on Notre Dame football broadcasts for 12 years, felt light-headed before the game and collapsed on the field. The team reported that Haden was stable in the locker room and doctors said he \"is fine.\"\nBig men on campus: A pair of Pro Football Hall of Famers were in the building Saturday at Notre Dame Stadium. Former Irish players Jerome Bettis and Tim Brown spoke to othe team this week and were honored for their inductions at midfield before the game.\nFamiliar foe: Notre Dame receiver Amir Carlisle spent one season playing for USC before transferring to South Bend. Carlisle didn't have a catch Saturday, but he returned the punt Equanimeous St. Brown blocked 5 yards for a touchdown to give Notre Dame a 21-10 lead late in the second quarter.\nFlag day: Where there's a Will, there's a pass interference. USC employed that defensive tactic on Notre Dame receiver Will Fuller on consecutive plays near the end of the third quarter, each resulting in 15-yard penalties. C.J. Prosise eventually scored on a 6-yard run to tie it 31-31.\nUp next: Notre Dame travels to Philadelphia to play Temple on Oct. 31 at Lincoln Financial Field.\nCopyright © 2015, Chicago Tribune Notre Dame Fighting Irish USC Trojans Brian Kelly Florida State University Jerome Bettis", "external_links": ["http://www.trbimg.com/img-56234252/turbine/ct-colleges-notre-dame-will-fuller-video-spt-20151017", "http://www.trbimg.com/img-5622ca08/turbine/ct-notre-dame-usc-football-spt-1018-20151017"], "published": "2015-10-18T06:54:00.000+03:00", "crawled": "2015-10-18T16:29:26.350+03:00", "highlightTitle": ""}