{"organizations": [], "uuid": "51c16756065e42d769784b9297b2583a3a5f6393", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "", "site_section": "http://www.prweb.com/rss2/entertainment.xml", "section_title": "Arts &amp; Entertainment", "url": "http://www.prweb.com/releases/2015/10/prweb13017599.htm", "country": "US", "title": "MOVIEQU Partners With MovieTickets.com Allowing Users To Explore Films And Buy Advance Tickets", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "MOVIEQU Partners With MovieTickets.com Allowing Users To Explore Films And Buy Advance Tickets", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "51c16756065e42d769784b9297b2583a3a5f6393"}, "author": "Amy Britt", "url": "http://www.prweb.com/releases/2015/10/prweb13017599.htm", "ord_in_thread": 0, "title": "MOVIEQU Partners With MovieTickets.com Allowing Users To Explore Films And Buy Advance Tickets", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MOVIEQU, the first movie trailer sound recognition app, has partnered with MovieTickets.com for in-app purchasing. MovieTickets.com, a leading global provider of remote movie ticketing, will allow MOVIEQU app users the ability to purchase tickets to see movies at over 28,000 screens around the world. The partnership will also give users the ability to find everything they need and want to know about the latest releases, from studios to first time directors, within the app. This is the latest step in MOVIEQU’s continued quest to streamline film lovers’ interaction, no matter where they are. Those using the app can MOVIEQU coming attractions in theaters before the lights go out, on their television, computer or wherever they enjoy trailers. With one touch, the sound recognition tool is activated, and once recognized, the app instantly pulls up the movie poster, puts the release date in the user’s calendar, and adds it to a personalized QU. Joining forces with MovieTickets.com is one step closer to perfecting the consumer experience.\n“Given their forward thinking technology, joining with MovieTickets.com was always the dream,” says MOVIEQU Founder & CEO, Rakesh Nigam. “Being able to combine their ticketing technology into our sound recognition and unique consumer learning is the perfect trifecta. It’s incredible to see major companies bringing together what they do best for a truly rich consumer experience.”\nJoel Cohen, CEO of MovieTickets.com, stated, “We are impressed by the innovative platform utilized at MOVIEQU and appreciate that they have chosen to work with MovieTickets.com to enhance their users’ experience. Working with MOVIEQU gives us yet another original platform to provide moviegoers with access to advance tickets and our exhibitors another meaningful distribution option.”\nMOVIEQU is the go-to app for discovering new films. Not only do users learn about films they’ve QUd, but MOVIEQU learns users’ preferences, makes suggestions under the ‘Recommended’ tab, and has a search feature if a trailer isn’t playing. With an ever-growing database of blockbuster, independent, and international films, MOVIEQU makes it easy to learn about new movies, and now with the MovieTickets.com integration, ultimately go see them. Users can download the newest version of MOVIEQU, or update their preexisting one, at http://apple.co/1DKcu64 .\nAbout MOVIEQU:\nMOVIEQU, the brainchild of CEO Rakesh Nigam and COO Allison Silver, is the first ever movie trailer recognition app, simultaneously recognizing movie trailers, capturing their release dates, and sharing the moment with friends. Launched in July 2015, MOVIEQU allows for the seamless discovery of films with the one-touch sound recognition software, while providing users the ability to search films or have them recommended based on their QU preferences. Stay connected with MOVIEQU through Twitter @moviequapp, Facebook (facebook.com/moviequ) and Instagram @moviequapp.\nAbout MovieTickets.com:\nMovieTickets.com is the leader in advance movie ticketing with 240 theater chains, representing over 28,000 screens worldwide in its group, offering moviegoers a quick and convenient way to purchase tickets online, via mobile devices and at 877-789-MOVIE. The company currently enables remote ticketing for consumers across 21 countries/territories including the United States, Canada, United Kingdom, Ireland, Argentina, Puerto Rico, the Dominican Republic and the Caribbean. Fans can stay connected with MovieTickets.com through Facebook (facebook.com/MovieTicketscom), Twitter (twitter.com/movietickets) and YouTube (youtube.com/MovieTicketsTrailers).\n###\nContact\nFor MOVIEQU\nAmy Britt\nAmy(at)brittbanter(dot)com / 212-797-0224\nFor MovieTickets.com\nHans-Dieter Kopal\nhans(at)pcommgroup(dot)com / 323-658-1555", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL2FwcGxlLmNvLzFES2N1NjQ=", "http://apple.co/1DKcu64"], "published": "2015-10-12T03:00:00.000+03:00", "crawled": "2015-10-13T01:09:00.731+03:00", "highlightTitle": ""}