{"organizations": [], "uuid": "aa1f76ba30793f5e98afae50c00ed35b2b30e87d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150226191410-jem-holograms-movie-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_showbiz.rss", "section_title": "CNN.com - Entertainment", "url": "http://edition.cnn.com/2015/10/23/entertainment/jem-holograms-reviews-feat/index.html?eref=rss_showbiz", "country": "US", "title": "What are the critics saying about 'Jem and the Holograms'?", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "What are the critics saying about 'Jem and the Holograms'?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T15:19:00.000+03:00", "replies_count": 0, "uuid": "aa1f76ba30793f5e98afae50c00ed35b2b30e87d"}, "author": "", "url": "http://edition.cnn.com/2015/10/23/entertainment/jem-holograms-reviews-feat/index.html?eref=rss_showbiz", "ord_in_thread": 0, "title": "What are the critics saying about 'Jem and the Holograms'?", "locations": ["New York", "Strawberry Shortcake", "American"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Matthew Broderick", "Gargamel", "Jem", "Michael Bay", "Jon Chu", "Strawberry Shortcake", "Fat Albert", "Albert", "Alvin", "Joe", "Rihanna", "Hub", "Robert Rodriguez", "Kenan Thompson", "Megan Fox", "Bill Cosby", "Neil Patrick Harris"], "text": "CNN Leadership <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> What are the critics saying about 'Jem and the Holograms'? Updated 1300 GMT (2000 HKT) October 23, 2015 12 photos: What Hollywood's done to your childhood 'Jem' – Then: \"Jem,\" the 1980s cartoon series about battling all-girl rock bands, was a cult hit. Now: \"Jem and the Holograms\" arrives in theaters Friday, directed by Jon Chu. Jem's not the only animated '80s star who's being brought back to life for a new generation. Hide Caption 1 of 12 12 photos: What Hollywood's done to your childhood 'Jonny Quest' – Then: \"Jonny Quest\" was much beloved to generations of TV viewers, thanks to many animated reboots since the 1960s (and the popular Adult Swim parody \"Venture Bros.\"). Now: Robert Rodriguez is set to direct a live-action movie. Hide Caption 2 of 12 12 photos: What Hollywood's done to your childhood Rainbow Brite – Then: More than 30 years ago, Hallmark introduced its color-loving character Rainbow Brite. Now: The young heroine who entertained a generation of kids in the '80s is returning as part of an animated original series on Feeln, an on-demand service. Hide Caption 3 of 12 12 photos: What Hollywood's done to your childhood 'Transformers' – Then: In the '80s, the Transformers were best known as the awesome robots that could turn into cool cars -- and had a TV show to match. Now: Michael Bay has taken the toy line and transformed them into formidable live-action box office giants. Hide Caption 4 of 12 12 photos: What Hollywood's done to your childhood 'G.I. Joe' – Then: Remember playing with American hero G.I. Joe? This was another classic action figure that also came with his own animated cartoon. Now: Everyone who grew up with the toy soldier saw him brought to life with 2009's live-action \"G.I. Joe: The Rise of Cobra.\" Hide Caption 5 of 12 12 photos: What Hollywood's done to your childhood 'Teenage Mutant Ninja Turtles' – Then: The late '80s introduced a cartoon crew of lovable warrior turtles who ate pizza like most kids wish they could (as in all day long, every day of the week). Now: They're mammoth creatures brought to life by CGI that also like to hit on Megan Fox. Hide Caption 6 of 12 12 photos: What Hollywood's done to your childhood 'The Smurfs' – Then: \"The Smurfs\" was the kind of cartoon that could keep an '80s kid captivated for hours, despite the fact that episodes could include a lesson and always ended the same way, with the nefarious Gargamel defeated once again. Now: They're still small and blue but are more liable to be found running around New York accompanied by Neil Patrick Harris. Hide Caption 7 of 12 12 photos: What Hollywood's done to your childhood 'Alvin and the Chipmunks' – Then: Before getting hooked on \"Chip N Dale: Rescue Rangers,\" most kids in the mid-'80s were huge fans of the chubby-cheeked trio of brothers that starred in \"Alvin and the Chipmunks.\" Now: The chipmunk bros have been upgraded with CGI and now appear at the movies, where they do their best takes on Lady Gaga and Rihanna. Hide Caption 8 of 12 12 photos: What Hollywood's done to your childhood 'Inspector Gadget' – Then: The tales of Penny and her bumbling inspector dad were always good for a laugh and a few \"wow\" moments at Inspector Gadget's toys. Now: Matthew Broderick played the inspector in 1999's live-action take on the cartoon. Hide Caption 9 of 12 12 photos: What Hollywood's done to your childhood 'Strawberry Shortcake' – Then: Strawberry Shortcake and her group of deliciously named friends were some of the sweetest characters of the '80s. Like Rainbow Brite, the character was spun off a greeting card to include TV movies and toys. Now: You can find the new version of Strawberry Shortcake on Hub's \"Strawberry Shortcake's Berry Bitty Adventures.\" Hide Caption 10 of 12 12 photos: What Hollywood's done to your childhood 'My Little Pony' – Then: The My Little Pony line of tiny horses inspired a \"collect them all\" mentality that was so intense it inspired TV series and a movie. Now: The My Little Pony love has shifted from the toys to Hub's \"My Little Pony: Friendship is Magic.\" And instead of a fan base made up primarily of young girls, the new \"My Little Pony\" series has a really vocal adult male contingent -- a.k.a. \"bronies.\" Hide Caption 11 of 12 12 photos: What Hollywood's done to your childhood 'Fat Albert and the Cosby Kids' – Then: Bill Cosby introduced his imaginative \"Fat Albert and the Cosby Kids\" in 1972, but the cartoon was such a staple that it ran all the way up through 1985, making sure more than one generation was very familiar with Fat Albert's iconic introduction. Now: A live-action movie tried to recreate \"Fat Albert's\" magic in 2004 with Kenan Thompson but didn't succeed. Hide Caption", "external_links": [], "published": "2015-10-23T15:19:00.000+03:00", "crawled": "2015-10-23T15:37:37.462+03:00", "highlightTitle": ""}