{"organizations": [], "uuid": "62f5573b9ec9ea360a7fded23b0f983623be1591", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbsnews.com", "main_image": "http://cbsnews1.cbsistatic.com/hub/i/r/2015/06/02/adc3acde-eefd-438f-ba49-6ebe043738ab/thumbnail/620x350/9bdcc11a39e95958c67f658a718201d1/475548860.jpg", "site_section": "http://www.cbsnews.com/entertainment/", "section_title": "Entertainment News, Headlines and Video - CBS News ", "url": "http://www.cbsnews.com/news/ashley-judd-says-she-was-harassed-by-studio-exec/", "country": "US", "title": "Ashley Judd says she was harassed by studio exec", "performance_score": 0, "site": "cbsnews.com", "participants_count": 1, "title_full": "Ashley Judd says she was harassed by studio exec - CBS News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T23:45:00.000+03:00", "replies_count": 0, "uuid": "62f5573b9ec9ea360a7fded23b0f983623be1591"}, "author": "Andrea Park CBS News", "url": "http://www.cbsnews.com/news/ashley-judd-says-she-was-harassed-by-studio-exec/", "ord_in_thread": 0, "title": "Ashley Judd says she was harassed by studio exec", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ashley Judd calls herself \"a declared feminist,\" but she said that even so, she felt helpless when a \"famous\" studio mogul harassed her.\nIn an interview with Variety , the actress recalled an alleged incident during which a studio executive asked her to watch him shower.\nShe said, \"Yet I did not recognize at the time what was happening to me. It took years before I could evaluate that incident and realize that there was something incredibly wrong and illegal about it.\"\nJudd said that the executive lured her into his hotel room by asking her for a meeting about potential roles in his studio's movies. T\n\"He groomed me, which is a technical term - 'Oh, come meet at the hotel for something to eat,'\" she said. \"Fine, I show up. 'Oh, he's actually in his room.' I'm like, 'Are you kidding me? I just worked all night. I'm just going to order cereal .' It went on in these stages. It was so disgusting.\"\nJudd continued that the studio mogul kept asking her to do things and she said no that she knows some people may wonder why she didn't just leave -- finally he asked her if she'd watch him shower.\n\"I told him something like, 'When I win an Academy Award in one of your movies,'\" she said. \"He said, 'No, when you get nominated.' I said, 'No, no, when I win an Academy Award.'\"\nThe actress added: \"That was a small moment of power when I was able to contradict him and hold to my reality. And then I got out of there. And by the way, I've never been offered a movie by that studio. Ever.\"\nJudd said when she told other women in the industry, they all said the man had done the same thing to them. The actress added that she was hard on herself about the incident: \"I beat myself up for a while. This is another part of the process. We internalize the shame.\"\nYears later, Judd said she was able to confront him at a party for the premiere of her movie, \"Double Jeopardy.\" She said he tried to keep her quiet: \"I was no longer that naïve ingénue who couldn't identify what was happening as it was happening. I was getting ready to nail him on it, and he said, 'I think I'll let you out of that deal we made.'\"", "external_links": ["http://variety.com/2015/film/news/ashley-judd-sexual-harassment-studio-mogul-shower-1201610666/"], "published": "2015-10-06T23:45:00.000+03:00", "crawled": "2015-10-07T08:47:27.321+03:00", "highlightTitle": ""}