{"organizations": [], "uuid": "cf3e5c44e2a6f5406e26c117dcad8225a64928c6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nydailynews.com", "main_image": "http://assets.nydailynews.com/polopoly_fs/1.2385992!/img/httpImage/image.jpg_gen/derivatives/landscape_1200/mta6n-3-web.jpg", "site_section": "http://www.nydailynews.com/news/index.html", "section_title": "Breaking, Local and National News, Sports &amp; Entertainment - NY Daily News", "url": "http://www.nydailynews.com/new-york/mayor-blasts-transport-workers-union-ads-article-1.2385995", "country": "US", "title": "Mayor blasts Transport Workers Union for ads", "performance_score": 0, "site": "nydailynews.com", "participants_count": 1, "title_full": "Mayor blasts Transport Workers Union for ads - NY Daily News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "cf3e5c44e2a6f5406e26c117dcad8225a64928c6"}, "author": "NEW YORK DAILY NEWS", "url": "http://www.nydailynews.com/new-york/mayor-blasts-transport-workers-union-ads-article-1.2385995", "ord_in_thread": 0, "title": "Mayor blasts Transport Workers Union for ads", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Susan Watts/New York Daily News Mayor Bill de Blasio has called the TWU claims “unfair” and insinuated that Gov. Cuomo was behind them. Saying the MTA gets more than enough money from New York City, Mayor de Blasio blasted a new subway workers union ad that raps him for not bankrolling the system — and insinuated Gov. Cuomo was behind it.\n“I don’t think it’s hard to figure that out,” the mayor said when asked why the Transit Workers Union was now attacking him for not doing enough to fund the Metropolitan Transportation Authority capital plan.\n“I'm going to leave you to do a little bit of simple research about why the transit workers union would so conveniently be attacking us, and who they respond to.”\nThe new ads appeared in Monday’s Daily News, and feature a cartoon image of the mayor jumping a subway turnstile.\n“Stop farebeating New York City’s working families,” the ad reads.\nIt argues that New York City spends just .2% of its budget on the MTA, which is a state agency that operates primarily in the city.\nThe city has pledged $657 million for the MTA’s capital plan, but the Cuomo-controlled agency is asking for $3.2 billion.\nDe Blasio called the ads “unfair.”\n“The bottom line here is, it is a specious argument, it’s an inaccurate argument, it’s an unfair argument,” the mayor said.\nCourtesy TWU An ad from the Transport Workers Union of America AFL-CIO and Transport Works Union Local 100 blasts Major de Blasio for his apparent refusal to match state funding for the MTA subway and bus system. TWU The ad argues that New York City spends just .2% of its budget on the MTA, which is a state agency that operates primarily in the city. Previous Next Enlarge He said that three quarters of the MTA’s resources come from the city, which includes the city contribution, tolls, taxes from Big Apple businesses and rider fares.\n“The TWU is obviously just posturing at this point,” he said.\nJohn Samuelsen, the president of the TWU, said it is City Hall that’s posturing.\n“We have 3,000 jobs riding on this capital plan,” he said.\n“We’re fighting a fight on behalf of our members.”\nThe governor’s office declined to comment about de Blasio’s allegations.\nBut last week Cuomo suggested that the mayor should do the heavy lifting on transportation financing if he wants to have more of a say on how the funds are spent.\n“If the city wants more control, let them pay $8 billion and then we’ll talk about more control,” Cuomo said.", "external_links": [], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-05T22:06:14.516+03:00", "highlightTitle": ""}