{"organizations": [], "uuid": "e133c8f3380c0596e470e8d42f0864072557a55e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "http://www.bostonherald.com/sites/default/files/media/2015/09/23/092815walk002.jpg", "site_section": "http://bostonherald.com/entertainment", "section_title": "Entertainment | Boston Herald", "url": "http://bostonherald.com/entertainment/movies/movie_news/2015/10/the_martian_the_walk_give_oscar_voters_feel_good_options", "country": "US", "title": "'The Martian,' 'The Walk' give Oscar voters feel-good options", "performance_score": 0, "site": "bostonherald.com", "participants_count": 1, "title_full": "'The Martian,' 'The Walk' give Oscar voters feel-good options | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T03:00:00.000+03:00", "replies_count": 0, "uuid": "e133c8f3380c0596e470e8d42f0864072557a55e"}, "author": "Kristopher Tapley", "url": "http://bostonherald.com/entertainment/movies/movie_news/2015/10/the_martian_the_walk_give_oscar_voters_feel_good_options", "ord_in_thread": 0, "title": "'The Martian,' 'The Walk' give Oscar voters feel-good options", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Both Robert Zemeckis\n' \"The Walk\" and Ridley Scott\n's \"The Martian\" made their way to theaters this week, and both have something unique to offer in the Oscar race. No, not spectacle, though they have that in spades as well. Rather, in a season typically packed with deadly serious themes and issues, these movies trade in delighting their audiences. Zemeckis' could almost be described as a family film; its jaunty tone and Joseph Gordon-Levitt's bubbly persona are an antidote to somber stories on the circuit. Meanwhile, that quality is part of the very fabric of \"The Martian,\" which finds actor Matt Damon\nleft behind on an unforgiving extraterrestrial world in a story that could, for obvious reasons, have been much darker. As screenwriter Drew Goddard\ntold me this week, \"It has this optimistic soul to it, which is not something you see a lot in science-fiction in general.\" I've just been speaking with Scott today about the film, in fact, and we ended up on a tangent about that optimistic quality. He wondered aloud what the recent obsession with zombies in film and television is all about and we settled on the idea that a general sense of accepted pessimism has worked its way into storytelling. Meaning, we're at a point -- with over-extended timelines for reducing emissions and such -- that notions of \"beyond the point of no return\" are more numbing than shocking. So post-apocalyptic stories are almost just a matter of course, where they used to be more subgenre territory. For a film like \"The Martian\" to come along, embracing good nature and the progressive mentality of problem-solving (one is reminded of \"Apollo 13\"), it's really rather unique in the spectrum.\nWhat's more? The film also happens to be Scott's most critically acclaimed since 1991's \"Thelma & Louise.\" And yes, that includes Best Picture winner \"Gladiator\" and 2001's \"Black Hawk Down,\" for which he received a best director nomination. Add to that a sure-to-be-substantial box office take (early estimates put it around $50 million this weekend) and obvious appeal in below-the-line categories (the effects, editing, sound and design elements are all outstanding, as they tend to be even in Scott's lesser works), then you start closing in on a delicious recipe for awards success.\nOne wonders, however, if Damon's perceived press faux pas in recent weeks will be more than just grist for the short-sighted outrage mill. (Reaction to his somewhat benign statements have been overblown, I feel, and I say that as someone who smacked my forehead when I saw the \"Project Greenlight\" clip.) In all likelihood, that will blow over for the next news cycle and the actor will end up a best actor contender for holding the audience's attention by his lonesome for long stretches of the film. Golden Globe recognition seems particularly within reach.\nThe point here is that voters will be yearning to feel better than a number of the films in the race this year will be willing to make them feel. \"Spotlight\" has a bit of the quality they'll be looking for, ending on a significant note of reverence for journalism, though it comes at the end of a tale with considerable \"ick\" factor. Obviously \"Inside Out\" keeps spirits high, and \"Brooklyn\" refreshingly avoids overt melodrama.\n\"The Walk\" and \"The Martian\" emboss that quality, however, and they stand out as a result.\n© 2015 Variety Media, LLC, a subsidiary of Penske Business Media; Distributed by Tribune Content Agency, LLC", "external_links": ["http://b.scorecardresearch.com/p?c1=7&c2=6035310&c3=10000&cv=2.0&cj=1"], "published": "2015-10-03T03:00:00.000+03:00", "crawled": "2015-10-04T02:19:59.611+03:00", "highlightTitle": ""}