{"organizations": [], "uuid": "08517878e39d4d33f94442d22fc4fd0a6cb0a47f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com/asset/1200_630/562902521400002b003c8da8.jpeg?cache=SMnpIlCn3j", "site_section": "http://www.huffingtonpost.com/feeds/verticals/entertainment/index.xml", "section_title": "Entertainment - The Huffington Post", "url": "http://www.huffingtonpost.com/entry/theory-proves-the-last-witch-hunter-is-a-fast-furious-sequel_56268ba5e4b0bce3470280f5", "country": "US", "title": "Theory Proves 'Last Witch Hunter' Is A 'Fast And The Furious' Sequel", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Theory Proves 'Last Witch Hunter' Is A 'Fast And The Furious' Sequel", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T19:50:00.000+03:00", "replies_count": 0, "uuid": "08517878e39d4d33f94442d22fc4fd0a6cb0a47f"}, "author": "Bill Bradley", "url": "http://www.huffingtonpost.com/entry/theory-proves-the-last-witch-hunter-is-a-fast-furious-sequel_56268ba5e4b0bce3470280f5", "ord_in_thread": 0, "title": "Theory Proves 'Last Witch Hunter' Is A 'Fast And The Furious' Sequel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Theory Proves 'Last Witch Hunter' Is A 'Fast And The Furious' Sequel Vin Diesel is back for one last ride ... Bill Bradley Entertainment Editor, The Huffington Post Posted: 10/23/2015 12:50 PM EDT | Edited: 7 minutes ago Lionsgate \nIn \" The Last Witch Hunter ,\" Vin Diesel lives his life one witch slaying at a time. \nThe movie follows Diesel as Kaulder, an 800-year-old witch slayer with the curse of immortality, which means he's just forced to be awesome forever. Diesel does his best to keep peace between the worlds of humans and witches with the help of an unbelievable cast including Elijah Wood , Rose Leslie and Michael Caine. In addition to the action and drama, Wood told The Huffington Post that what drew him to the film was its originality, saying he was \"impressed how detailed the mythology was.\" \nWood added, \"I think it’s also refreshing to read something that is at this budget level and is a completely new idea. That’s not based on any preexisting text. It’s not a sequel or a reboot\" ... or is it? After watching the film, one mind-blowing revelation became pretty evident to us. HuffPost discussed this with both Wood and director Breck Eisner, who both actually supported the idea. And it changes everything: \nThe theory: Vin Diesel's Kaulder from \"Last Witch Hunter\" and Dominic Toretto from the \"Fast and the Furious\" series are the same person. Image: YouTube \nJust think about it: Kaulder is 800 years old and constantly switching identities, he has an affinity for nice cars, he can't die and the end of the movie has a car whipping around the corner, \" Tokyo Drift \"-style. \nEverything appears to match up. The timeline doesn't seem to be an issue, and \"Fast and the Furious\" fans know Dom makes a point of saying, \"I don't have friends.\" Well, neither does Kaulder. \n(Is this actually happening right now? Is. This. Happening. ) \nIt's crazy, but it appears for a small time during his 800 years, Kaulder was Dominic Toretto . \nMaking a \" Fast and the Furious \" connection even more plausible, the movie seems to have callbacks to other films, too. For instance, a scene with Elijah Wood in a cave with a spider-like monster is reminiscent of his \" Lord of the Rings \" scene with giant spider Shelob . Oh, and there's this:", "external_links": [], "published": "2015-10-23T19:50:00.000+03:00", "crawled": "2015-10-23T20:09:36.804+03:00", "highlightTitle": ""}