{"organizations": [], "uuid": "0a820313141c76f825bdc2cefa659af66053307e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "http://www.bostonherald.com/sites/default/files/media/2015/10/07/lampoon4.jpg", "site_section": "http://bostonherald.com/entertainment", "section_title": "Entertainment | Boston Herald", "url": "http://bostonherald.com/entertainment/movies/movie_reviews/2015/10/brilliant_doc_uncovers_lampoon_history", "country": "US", "title": "‘Brilliant’ doc uncovers Lampoon history", "performance_score": 0, "site": "bostonherald.com", "participants_count": 1, "title_full": "‘Brilliant’ doc uncovers Lampoon history | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "0a820313141c76f825bdc2cefa659af66053307e"}, "author": "James Verniere", "url": "http://bostonherald.com/entertainment/movies/movie_reviews/2015/10/brilliant_doc_uncovers_lampoon_history", "ord_in_thread": 0, "title": "‘Brilliant’ doc uncovers Lampoon history", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "First, I should declare that I worked for the American business legend and co-founder of Diners Club Matty Simmons in the mid-1980s when I wrote about film for the French-based, science-fiction and fantasy publication Heavy Metal magazine, something that still impresses my sons’ friends (and they are a hard crowd to impress).\n“Drunk Stoned Brilliant Dead: The Story of the National Lampoon” is a marvelously entertaining and significant, warts-and-all look at the years Simmons spent as the patient and wise publisher of the 1970s-era satirical magazine and cultural phenomenon known as National Lampoon. An offshoot of Harvard Lampoon (founded in 1876), National Lampoon magazine famously featured a cover with a dog with a gun to its head and the words, “If you don’t buy this magazine, we’ll kill this dog.” The magazine caught the Vietnam-era, anti-establishment, irreverent, anarchic, sex- and drug-hungry zeitgeist tsunami and rode that monster wave for years. Started by creative geniuses from Harvard, Douglas C. Kenny and Henry N. Beard, authors of the hilarious, hobbit-sex-pandering Tolkien 1969 parody “Bored of the Rings,” the magazine went the analog version of viral in its heyday.\nDirected by Douglas Tirola, the film is “narrated” by the National Lampoon Radio Hour, a genuine show in 1973-1974 with Christopher Guest, Gilda Radner and Chevy Chase among its performers, and features people such as Seth Rogen and Judd Apatow singing the praises of the National Lampoon.\nSimmons also appears in interviews, giving credit where credit is due and lamenting the drug addiction and mysterious death of the brilliant Kenny, who was the best friend of the similarly strung-out at the time Chevy Chase. The actor appears in the film and is much more game to discuss Kenny than he was when I interviewed him in the early 1980s.\nPerhaps most noteworthy among the revelations is that “Saturday Night Live” producer Lorne Michaels basically hired all the talent, including Radner, Chase, Bill Murray and John Belushi, from National Lampoon to start “Saturday Night Live,” something you’d never know from that recent, vanity “Saturday Night Live” documentary.\n“Drunk Stoned Brilliant Dead” is like the “Goodfellas” of comedy documentaries. The men and women recruited to produce National Lampoon struck gold. Many of them, future auteurs Harold Ramis and John Hughes included, then responded to the siren song of Hollywood to make such films as “National Lampoon’s Animal House” (1978), an offshoot of the magazine’s famous high school yearbook parody issue, “National Lampoon’s Vacation” (1983), “Caddyshack” (1980) and “Sixteen Candles” (1984). But some succumbed to temptations and imploded as a result of their success, sudden wealth and notoriety. Sic transit gloria mundi.\n(“ Drunk Stoned Brilliant Dead: The Story of the National Lampoon” contains drug use, profanity and nudity.)", "external_links": [], "published": "2015-10-09T03:00:00.000+03:00", "crawled": "2015-10-09T12:37:04.297+03:00", "highlightTitle": ""}