{"organizations": [], "uuid": "55f862d82fff274d99d71750baa80545e0d430b1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "savannahnow.com", "main_image": "http://savannahnow.com/sites/default/files/14786160.jpg", "site_section": "http://savannahnow.com/", "section_title": "savannahnow.com | Savannah Georgia's source for News, Entertainment, Sports, Weather, Classifieds, Jobs, Autos, Real Estate and St. Patricks Day", "url": "http://savannahnow.com/sports/2015-10-05/falcons-put-sluggish-ways-behind-blowout-houston", "country": "US", "title": "Falcons put sluggish ways behind in blowout of Houston", "performance_score": 0, "site": "savannahnow.com", "participants_count": 1, "title_full": "Falcons put sluggish ways behind in blowout of Houston | savannahnow.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T15:16:00.000+03:00", "replies_count": 0, "uuid": "55f862d82fff274d99d71750baa80545e0d430b1"}, "author": "GEORGE HENRY", "url": "http://savannahnow.com/sports/2015-10-05/falcons-put-sluggish-ways-behind-blowout-houston", "ord_in_thread": 0, "title": "Falcons put sluggish ways behind in blowout of Houston", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photos Back | Next Atlanta Falcons Roddy White and Jonathan Babineaux share a laugh on the sidelines on Sunday during the second half of a game against the Houston Texans in Atlanta.\nBack | Next Photos by Curtis Compton/Atlanta Journal-Constitution via AP\nAtlanta Falcons linebacker Nate Stupar returns a turnover for a touchdown on Sunday past Houston Texans wide receiver Keith Mumphery during the second half of a game in Atlanta.\n By GEORGE HENRY FLOWERY BRANCH — Coach Dan Quinn has been trying to get the Atlanta Falcons to start games fast.\nHis message seems to be taking effect.\nIn Sunday’s blowout win over Houston, the Falcons did as he instructed, avoiding a sluggish first half by taking care of the ball on offense and taking it away on defense.\n“For us, it was going to be about the ball, so for us to be plus-four and convert on some opportunities — all units improved,” Quinn said Monday. “That’s our goal going forward.”\nQuinn’s halftime talk to the team was nothing like last week’s when Atlanta trailed by 11 at Dallas and had to rally in the fourth quarter for the third straight week.\nThis time, the Falcons were up 28-0. Turnovers — no miscues by the offense, an interception by Jonathan Babineaux and two fumble recoveries by Desmond Trufant — were the reason why.\n“The coaches give us a great game plan, and we go out and execute it,” Trufant said. “We believe in each other, and it’s really starting to show.”\nTurnover margin was one of Quinn’s big themes at the start of training camp, and he will repeat it again this week when the Falcons (4-0) host Washington (2-2).\nHe wants the ball-hawking skills to improve. Strong safety William Moore has two of the team’s four picks, but no Atlanta cornerback yet has an interception.\n“That’s a real challenge as we go through it,” he said. “Can we keep finding small ways to improve? For us it was going to be about the football this last week. Can we get more turnovers? Can we take care of the ball better than we ever have?\nOffensively, Atlanta found a new way to win.\nThree-time Pro Bowl quarterback Matt Ryan didn’t even need a big contribution from Julio Jones, who began the game leading the NFL in yards from scrimmage but caught just four passes for 38 yards.\nWith Jones facing double-team coverages, Ryan used other weapons. No. 3 receiver Leonard Hankerson caught six passes for 103 yards and a touchdown. Running back Devonta Freeman had five catches for 85 yards.\n“There were some adjustments by their safeties, playing over the top help and giving you advantageous looks to the other side to kind of force you to throw to other guys,” Ryan said. “I thought our other guys stepped up and did really well.”\nThe Falcons are among the league’s most efficient, ranking second in third-down percentage and first in red-zone touchdown percentage.\nBut just as importantly, the offense isn’t giving the ball away. Atlanta has yet to lose a fumble this season and Ryan hasn’t thrown an interception since Week 1.\nNotes\nOLB Justin Durant left the game with an injured elbow and did not return. He will meet with doctors again Thursday. ... RB Tevin Coleman will return to practice on Wednesday. He missed the last two games with bruised ribs. ... Quinn said rookie FS Robenson Therezie played well in his first career start, getting a pass breakup and missing no tackles. Therezie, an undrafted free agent from Auburn, replaced Ricardo Allen, who missed the game with a sprained left knee.", "external_links": ["http://sav-cdn.com/sites/all/themes/whitelabel/images/blank.gif", "http://sav-cdn.com/sites/default/files/imagecache/superphoto/14786160.jpg", "http://sav-cdn.com/sites/default/files/imagecache/superphoto/14786155.jpg", "http://sav-cdn.com/sites/default/files/imagecache/story_slideshow_thumb/14786155.jpg", "http://sav-cdn.com/sites/all/themes/savannahnow/images/blank.gif", "http://sav-cdn.com/sites/default/files/imagecache/story_slideshow_thumb/14786160.jpg"], "published": "2015-10-05T15:16:00.000+03:00", "crawled": "2015-10-06T05:27:18.387+03:00", "highlightTitle": ""}