{"organizations": [], "uuid": "fc59b23ed89d8d6fcc6bc3bd29090421145fdbc5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegram.com", "main_image": "http://www.telegram.com/storyimage/WT/20150930/ENTERTAINMENTLIFE/150939944/AR/0/AR-150939944.jpg&MaxW=1200&MaxH=630", "site_section": "http://www.telegram.com/living/entertainment", "section_title": "Entertainment - telegram.com - Worcester, MA", "url": "http://www.telegram.com/article/20150930/ENTERTAINMENTLIFE/150939944/101397", "country": "US", "title": "Q&A with Harden of 'Code Black' - Entertainment & Life", "performance_score": 0, "site": "telegram.com", "participants_count": 1, "title_full": "Q&A with Harden of 'Code Black' - Entertainment & Life - telegram.com - Worcester, MA", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "fc59b23ed89d8d6fcc6bc3bd29090421145fdbc5"}, "author": "Patricia Sheridan Pittsburgh Post-Gazette", "url": "http://www.telegram.com/article/20150930/ENTERTAINMENTLIFE/150939944/101397", "ord_in_thread": 0, "title": "Q&A with Harden of 'Code Black' - Entertainment & Life", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Oscar- and Tony Award-winning actress Marcia Gay Harden is taking on the emergency room in CBS’s new medical drama “Code Black.” Off screen the 56-year-old is the mother of three children with former husband Thaddaeus Scheel. Born in La Jolla, Calif., she moved often with her family, living in Greece, Japan and Germany as well as several cities in the U.S. “Code Black” debuted Wednesday at 10 p.m. Q: Your new character on “Code Black” seems to be a tough, emotions-in-hand kind of person who is suppressing or repressing a lot. Is that challenging to play? A: If she was a man, would you say he was suppressed or repressed? You might say he is in control. He is professional. So I don’t try to use judgment words for her. I try to know that she has a history, and she has a job she has to do, and the professional requirements are not to have the personal seep in. Q: Is it easy for you to lose yourself in a character? A: I do lose myself in a character (laughing), sometimes much to my children’s dismay. (They say) “Mom, come back. Please, dear God, come back!” Q: That is funny. I was going to ask if you ever bring the character’s issues home with you. A: Not their issues, but their sounds. If I’m trying to learn an accent, I bring it home. So for “Pollock” or this character I did for “The Maiden Heist,” she was even more extreme. (Breaks into a strong New York accent) How they were talking was so New York. You can only learn an accent if you are using it in your own words all the time. So I was making them breakfast and using it. “Mom, stop it!” (laughing) They were ready to mutiny. Q: I am sure that is interesting to them on some level. A: Sometimes, but I am sure it was more irritating. On the other hand, they can do something I can’t do, which are pristine English accents because they all grew up on “Harry Potter,” watching it again and again. There is a whole generation of kids who can do these amazing English accents. Q: Do you think moving so much as kid had anything to do with you wanting to go into acting? A: I come from (a family of) five kids, and I am the only one who is an actress, so I would be hard-pressed to lay it at the heels of moving around a lot. There is a gypsy similarity to the life of an actor and the life of a military brat. I love acting. I love the possibility of connecting with other people or reflecting other people’s lives or getting insight into what it’s like to be alive. I love words so, so much. I love storytelling and stories. I think that is what drew me to it. It is a very ancient art. Q: Have your ambitions changed since you started out? A: Well, no. I’m working and that is what I am thrilled to be doing. When I first started out, I wouldn’t have known what I wanted to do. I wanted to be an actor, that’s it. It’s not the ambition that’s changed. You realize with work, preparation and education that it is not impossible the things that I wanted — theater, film and television — could come true. Now I want to embark on storytelling in other ways, producing and discovering, especially women’s stories that may have been hidden for too long. I am writing a book with my mom right now about my mom. I love it. Q: Is work enough at this stage? Would you ever want to remarry? A: It wouldn’t be enough if I didn’t have children. Absolutely the most important thing for me is children. It’s a balance on the teeter-totter. If it is just family without the work, I am really restless. The romance world, it is what it is. It would take someone really incredible to turn my head. I do not feel a void. I feel if it comes it will be a beautiful extra.", "external_links": [], "published": "2015-09-30T03:00:00.000+03:00", "crawled": "2015-10-01T07:10:40.369+03:00", "highlightTitle": ""}