{"organizations": [], "uuid": "357ed04a144e759ed4dc80ffc909fe2a507120e1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.brandonsun.com", "main_image": "http://media.winnipegfreepress.com/images/NYR301-1016_2015_100526_high.jpg", "site_section": "http://brandonsun.com//rss?path=/entertainment/breaking-news", "section_title": "Entertainment Breaking News", "url": "http://www.brandonsun.com/entertainment/breaking-news/20th-century-masterpieces-by-picasso-gauguin-on-tap-at-christies-nyc-fall-auctions-333262471.html", "country": "US", "title": "20th-century masterpieces by Picasso, Gauguin on tap at Christie's NYC fall auctions", "performance_score": 0, "site": "brandonsun.com", "participants_count": 0, "title_full": "20th-century masterpieces by Picasso, Gauguin on tap at Christie's NYC fall auctions", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T21:32:00.000+03:00", "replies_count": 0, "uuid": "357ed04a144e759ed4dc80ffc909fe2a507120e1"}, "author": "", "url": "http://www.brandonsun.com/entertainment/breaking-news/20th-century-masterpieces-by-picasso-gauguin-on-tap-at-christies-nyc-fall-auctions-333262471.html", "ord_in_thread": 0, "title": "20th-century masterpieces by Picasso, Gauguin on tap at Christie's NYC fall auctions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Gauguin", "Picasso", "Christie"], "text": "Enlarge Image \nIn this image provided by Christies is the painting, \"Jeune homme a la fleur,\" by French artist Paul Gauguin. “Young Man with a Flower” depicts a Tahitian youth in a white shirt and loose cravat and a white blossom tucked behind his ear. Gauguin created it in 1891 soon after arriving on the French Polynesian island. It will be auctioned at Christie's, Nov. 9, 2015. (Christie's via AP) \nNEW YORK, N.Y. - Works by some of the most coveted artists of impressionist and modern art are coming to auction this fall, including two major works by Paul Gauguin. \nChristie's has a lineup of 20th-century masterpieces by Lucian Freud, Amedeo Modigliani, Pablo Picasso and Roy Lichtenstein. \nThe Gauguin pieces — a sculpture and a painting — hail from the artist's days in Tahiti. \n\"Young Man with a Flower\" depicts a Tahitian youth in a white shirt and loose cravat and a white blossom tucked behind his ear. Gauguin created it in 1891 soon after arriving on the French Polynesian island. Christie's estimates it could bring $12 million to $18 million. \nGauguin identified his subject as a young man who helped him find native wood for carving sculptures. \nThe portrait's first owner was Henri Matisse, who paid 200 francs for it in 1900. Later owners included John Quinn and Lillie Bliss, one of the original founders of the Museum of Modern Art in New York. \nThe current auction record for a painting by the artist is another work from his Tahitian period, \"Man with an Ax,\" which sold for $40.3 million in 2006 at Christie's. \nGauguin's \"Therese,\" a carved wooden figure of a Tahitian female, is poised to set a new auction record for a sculpture by the artist. The estimate is $18 million to $25 million; the current record is $11.3 million. \nWorks by Gauguin are red hot. In February, one of his Tahitian paintings, \"When Will You Marry?\" sold privately for nearly $300 million. \nThe sculpture and portrait are part of a 34-work curated sale on Nov. 9 dubbed \"The Artist's Muse.\" \nAmong the highlights of that sale is Modigliani's \"Reclining Nude,\" a work that created a scandal nearly a century ago. It could exceed $100 million, surpassing the current artist record at auction of $71 million. \nAlso included in \"The Artist's Muse\" sale is an iconic work by pop artist Roy Lichtenstein not seen on the market for 20 years. \"Nurse,\" based on a comic book image, is estimated to bring $80 million, exceeding the auction record for the artist of $56 million for \"Woman with Flowered Hat\" set in 2013 at Christie's. \nPicasso's \"Man with a Sword,\" a portrait of the artist as a musketeer created in 1969, could bring as much $25 million. The richly colored oil painting was used in promotional material for one of his last exhibitions in 1970 at the Palais des Papes in Avignon. Christie's said interest in Picasso's late-period musketeer portraits has grown dramatically in recent years. \nTwo important works by Freud also are on tap. \"Naked Portrait on a Red Sofa,\" a portrait of the artist's daughter, the fashion designer Bella Freud, will be sold on Nov. 9 and could bring $20 million to $30 million. One of a series of portraits of his daughters, it is the first time it's being offered at auction. \nFreud's \"Brigadier,\" a portrait of Andrew Parker Bowles, the former husband of the Duchess of Cornwall, Camilla Parker Bowles, will be sold the following day. The portrait, on view at the 2012 retrospective of the artist at the National Portrait Gallery in London, portrays the career soldier seated wearing his sumptuous army brigadier uniform. It could bring as much as $30 million.", "external_links": [], "published": "2015-10-16T21:32:00.000+03:00", "crawled": "2015-10-17T07:22:15.942+03:00", "highlightTitle": ""}