{"organizations": [], "uuid": "4c1b1f1972a1c0ee25c3d242330297d067e57c42", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.deccanchronicle.com", "main_image": "http://www.deccanchronicle.com/sites/default/files/HERO-NANI-PHOTOS-35.jpg", "site_section": "http://www.deccanchronicle.com/entertainment", "section_title": "Entertainment | Deccan Chronicle", "url": "http://www.deccanchronicle.com/151007/entertainment-tollywood/article/surprised-and-shocked-nani", "country": "US", "title": "Surprised and shocked: Nani", "performance_score": 0, "site": "deccanchronicle.com", "participants_count": 1, "title_full": "Surprised and shocked: Nani", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T11:54:00.000+03:00", "replies_count": 0, "uuid": "4c1b1f1972a1c0ee25c3d242330297d067e57c42"}, "author": "Deccan", "url": "http://www.deccanchronicle.com/151007/entertainment-tollywood/article/surprised-and-shocked-nani", "ord_in_thread": 0, "title": "Surprised and shocked: Nani", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Deccan Chronicle | Suresh Kavirayani | October 07, 2015, 23.37 pm Nani Nani says that he was the most surprised with the business garnered by his recent film Bhale Bhale Mogadivoy. The film stands at number seven in the list of all-time top Telugu grossers in the USA. In India, too, the film has collected more than `25 crore, the best in the actor’s career till date. Nani and director Maruthi recently returned from the US after meeting fans there. “We were all surprised that my film was in the top 10 of all-time Telugu films. So, we decided to meet the audience and toured the country,” says Nani. He and Maruthi were warmly received in the US by fans. Nani adds that earlier not many people were interested in watching films in theatres. “But Baahubali changed this trend. It showed the importance of watching a film in the theatre,” he adds. “Earlier, travelling to Vijayawada and Vizag was a big task, but now we can travel to the USA like we go to another city in India. It’s become easy and we can explore the market potential,” he says. When asked whether he had expected the film to become such a hit, he said, “I had thought that the film would do good business because I knew it was a good film and I believed in the subject. But I was surprised and shocked when it became a huge blockbuster,” says the actor, adding that no one from the unit had also thought that it would become such a hit. Nani agrees that if filmmakers come up with a proper plan and release date, pre-promotions can definitely help a film’s business. “Sometimes we postpone releases, because of another big film or some other reasons. In the end, the big film too postpones and the impact is on the small films. So once you decide on a release date, you have to go ahead it with it,” he says. For his next film, where he portrays a fan of Nandamuri Balakrishna, he has specific plans in place. “The film’s shooting is going on and we will know the approximate release date after 80 per cent of shooting is done. I will then plan the promotions accordingly in advance,” he says. Tollywood Nani Bhale Bhale Mogadivoy movie Maruthi Also Read Cherry now as ‘Bruce Lee?’ Naga Chaitanya's latest 'Autonagar Surya' trailer released Kamal Haasan’s Cannes look ‘homemade’ Tollywood actor Rambha and her brother booked for abuse of sister-in-law", "external_links": ["http://platform.twitter.com/widgets.js", "http://static.ak.fbcdn.net/connect.php/js/FB.Share", "http://dd508hmafkqws.cloudfront.net/sites/default/files/HERO-NANI-PHOTOS-35.jpg", "https://apis.google.com/js/plusone.js", "http://twitter.com/share?url=http://www.deccanchronicle.com/151007/entertainment-tollywood/article/surprised-and-shocked-nani", "http://dd508hmafkqws.cloudfront.net/sites/default/files/styles/article_node_view/public/HERO-NANI-PHOTOS-35.jpg", "http://www.facebook.com/sharer.php", "http://vuukle.com/js/vuukle.js"], "published": "2015-10-08T11:54:00.000+03:00", "crawled": "2015-10-08T01:25:56.001+03:00", "highlightTitle": ""}