{"organizations": [], "uuid": "e964924e6924cd4b95a4a20eab47a5f4aba6639d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/10/20/13034823/6898_Ebook_2000-e1444665019630.jpg", "site_section": "http://www.prweb.com/rss2/artbooks.xml", "section_title": "Arts &amp; Entertainment: Books", "url": "http://www.prweb.com/releases/2015/10/prweb13034823.htm", "country": "US", "title": "Robert Chiappetta’s New Book “The Immaculate Deception” is a Cautionary Tale that Informs Readers to Know and to Question Authority.", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Robert Chiappetta’s New Book “The Immaculate Deception” is a Cautionary Tale that Informs Readers to Know and to Question Authority.", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T02:00:00.000+02:00", "replies_count": 0, "uuid": "e964924e6924cd4b95a4a20eab47a5f4aba6639d"}, "author": "Mitzi McKenzie", "url": "http://www.prweb.com/releases/2015/10/prweb13034823.htm", "ord_in_thread": 0, "title": "Robert Chiappetta’s New Book “The Immaculate Deception” is a Cautionary Tale that Informs Readers to Know and to Question Authority.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Robert Chiappetta, a retired, veteran, history buff, devoted writer, and author, has completed his new book “The Immaculate Deception” is a gripping and potent story behind the story of one of the worst school fire disasters in US history. The author, a survivor, was inspired to write this book after the death of his sister and the absence of justice. Published by New York City-based Page Publishing, Robert Chiappetta’s poignant tale will keep the reader intrigued through the honest, crime-driven plot.\nAlthough the risk of death and great bodily harm were foreseeable, rather than changing their conduct they chose to run the risk. A sinister gamble virtually assuring death with the greatest possible violence. It is apparent that both corporations had willfully entered into an amoral and criminal quagmire that the law can only begin to address. The children’s mortal wounds are quintessential examples of theocratic and bureaucratic corruption fulfilling their deadly potential.\nReaders who wish to experience this profound work can purchase “The Immaculate Deception” at bookstores everywhere or online at the Apple iTunes store, Amazon, Google Play or Barnes and Noble.\nFor additional information or media inquiries, contact Page Publishing at 866-315-2708.\nAbout Page Publishing\nPage Publishing is a traditional New York based full-service publishing house that handles all of the intricacies involved in publishing its authors’ books, including distribution in the world’s largest retail outlets and royalty generation. Page Publishing knows that authors need to be free to create - not bogged down with complicated business issues like eBook conversion, establishing wholesale accounts, insurance, shipping, taxes and the like. Its roster of authors can leave behind these tedious, complex and time consuming issues, and focus on their passion: writing and creating. Learn more at http://www.pagepublishing.com .", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5wYWdlcHVibGlzaGluZy5jb20vcG9ydGZvbGlvLXZpZXcvdGhlLWltbWFjdWxhdGUtZGVjZXB0aW9uLw==", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5wYWdlcHVibGlzaGluZy5jb20="], "published": "2015-10-26T02:00:00.000+02:00", "crawled": "2015-10-26T09:18:49.196+02:00", "highlightTitle": ""}