{"organizations": [], "uuid": "94ea67b5d17b1709caf2b4e0e69d60c46e8a964e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.myrtlebeachonline.com", "main_image": "http://www.myrtlebeachonline.com/entertainment/l9ncao/picture41185149/ALTERNATES/LANDSCAPE_1140/Mr%20Fish%2002", "site_section": "http://www.myrtlebeachonline.com/entertainment/?widgetName=rssfeed&widgetContentId=712015&getXmlFeed=true", "section_title": "Entertainment news on restaurants movies & music in Myrtle Beach SC | MyrtleBeachOnline.com &", "url": "http://www.myrtlebeachonline.com/entertainment/article41185161.html", "country": "US", "title": "Mr. Fish worth the sometimes elongated wait", "performance_score": 0, "site": "myrtlebeachonline.com", "participants_count": 1, "title_full": "Mr. Fish worth the sometimes elongated wait", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T19:26:00.000+03:00", "replies_count": 0, "uuid": "94ea67b5d17b1709caf2b4e0e69d60c46e8a964e"}, "author": "Emily Smith \nFor The Sun News", "url": "http://www.myrtlebeachonline.com/entertainment/article41185161.html", "ord_in_thread": 0, "title": "Mr. Fish worth the sometimes elongated wait", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Mr. Fish worth the sometimes elongated wait \nFresh seafood, sushi a staple for Myrtle Beach joint \nVisitors sometimes have to wait for food, however \nFamilies with kids should ask for crayons, paper during wait The wait notwithstanding, when the food came out, it was fresh and so very delicious. By Emily Smith For The Sun News Emily Smith For The Sun News 1 of 2 Order Reprint of this Story \nWhat started as a market for locals and tourists to obtain fresh fish grew into a vastly popular seafood restaurant that has continued serving fresh fish to its clientele every day. In fact, after guests enjoy their meal, they can go to the building next door to purchase more of the seafood they just partook of. \nWhen Mr. Fish opened, the location was small, only able to dine up to 25 guests at a time. Now, after two upgrades, Mr. Fish is a separate market and restaurant that can fit over 200 seafood lovers with its original goal still in mind. \nJust a glance at the restaurant’s name can give a good idea of what consumers can find here, but there is still a bit of wiggle room for the rare few who come here not wanting seafood. Mr. Fish is also known for its sushi bar, with a kitchen completely separate from the first to allow less contamination and greater efficiency. Granted, having two kitchens in one restaurant can cause some confusion when one party orders meals from both kitchens, but they still get the job done. \nOn a Tuesday night in fall, the restaurant is surprisingly bustling though not overcrowded. The wait for the food ended up taking up a good chunk of time, which could have been attributed to the sushi kitchen. The main kitchen probably has an easier time getting dishes out quicker, while the sushi chefs might become easily overwhelmed. \nThe wait notwithstanding, when the food came out, it was fresh and so very delicious. The Boom Boom Shrimp Tacos were delicious, especially with the spicy sauce. Having sour cream, tomatoes, and beans on the side allowed for some creativity to get the tacos to optimum tastiness. \nThe Ahi Poke and Geisha Roll arrived after the tacos, but were met with just as much enthusiasm. Although the different poke dishes are listed as appetizers, they can easily be made into a meal for one. The Ahi Poke was amazing, even without using the crispy wontons that came with the dish. \nJust like the poke, the roll was a delicious medley of tastes and it was easy to notice how fresh the raw fish was. Some might consider the rolls to be a little too big in size, if only because of the amount of rice used. Still, funny faces and slightly messy eating were accepted if it meant enjoying the sushi. \nMr. Fish is popular with Myrtle Beach residents and its visitors. One visit makes it clear why. The seafood is fresh and delicious, though sometimes there is a wait that can elongate a meal. If you’re dining with kids, be sure to ask for the kids menu and crayons, which could make the time seem shorter. \nAll in all, Mr. Fish is an apt name for this restaurant, because it certainly knows how to make some delicious seafood. \nIf you go: \nWhat | Mr. Fish Seafood Restaurant \nWhere | 6401 N. Kings Highway \nHours | 11 a.m.-9:30 p.m. daily \nContact | mrfish.com, 843-839-3474", "external_links": [], "published": "2015-10-23T19:26:00.000+03:00", "crawled": "2015-10-24T08:51:48.471+03:00", "highlightTitle": ""}