{"organizations": [], "uuid": "253bbca29bbad8542c60cb10fdf29c99f0794263", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mid-day.com", "main_image": "http://images.mid-day.com/images/2015/oct/14super-team-l.jpg", "site_section": "http://www.mid-day.com/Resources/midday/rss/entertainment.xml#", "section_title": "entertainment", "url": "http://www.mid-day.com/articles/disneypixars-short-film-to-present-hindu-gods-as-superheroes/16608162", "country": "IN", "title": "Disney-Pixar's short film to present Hindu gods as superheroes", "performance_score": 0, "site": "mid-day.com", "participants_count": 1, "title_full": "Disney-Pixar's short film to present Hindu gods as superheroes - Entertainment", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "253bbca29bbad8542c60cb10fdf29c99f0794263"}, "author": "IANS", "url": "http://www.mid-day.com/articles/disneypixars-short-film-to-present-hindu-gods-as-superheroes/16608162", "ord_in_thread": 0, "title": "Disney-Pixar's short film to present Hindu gods as superheroes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "New Delhi : US film production studio Disney-Pixar's short movie “Sanjay's Super Team\" is set to present Hindu gods as superheroes on Indian screens in December.\nDirected by Sanjay Patel, “Sanjay’s Super Team” is his personal story and a “mostly true” chronicle of his journey to understand the Hindu world that is important to his parents.\n\nSanjay's Super Team. Pic/IANS \nThe animation film shows how he uses his own experience to tell the story of a young, first generation Indian-American boy whose love for western pop culture comes into conflict with his father’s traditions.\nIn the short, the boy is seen absorbed in the world of cartoons and comics. His father, on the other hand, tries to draw him into the traditions of his Hindu practice.\nWhile he tries to follow the tradition with reluctance, the boy soon finds himself in another world where a trio of Hindu deities, including Hanuman -- who represents strength and valour -- are fighting a villain. The ending is an emotional one and will surely leave the audience in tears.\nPic/IANS \n\"Shorts are all original ideas. We make shorts for different reasons. Sometimes, it's because we think that the person has a potential to be a director and then we give them training. Sometimes, they have a good story to tell and we like the idea. That's the case with Sanjay. It is a special story,\" said Jim Morris, president of Pixar Animation Studios.\nPatel joined the Pixar Animation Studios in 1996 as an animator on “A Bug’s Life\". Since then he has animated on many of Pixar’s feature films, including “Ratatouille\", “Cars\" and \"Toy Story 3”.\nPatel also storyboarded extensively for “Monster’s Inc.\", “The Incredibles” and “Toy Story 2.”\n“Sanjay’s Super Team”, which shows superheroes like never before, will be released along with \"The Good Dinosaur\" on December 4 in India.", "external_links": [], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-14T20:14:17.486+03:00", "highlightTitle": ""}