{"organizations": ["Westlife"], "uuid": "36c8894e068a0115f152e239249bd4a972801b1a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/09/30/12993626/DancePicker_app_icon_1024.png", "site_section": "http://uk.prweb.com/atom10/aeperforminguk.xml", "section_title": "Art & Entertainment: Performing Arts", "url": "http://uk.prweb.com/releases/2015/10/prweb12993626.htm", "country": "US", "title": "DancePicker app makes us all Strictly dance experts.", "performance_score": 0, "site": "prweb.com", "participants_count": 0, "title_full": "DancePicker app makes us all Strictly dance experts.", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T07:00:00.000+03:00", "replies_count": 0, "uuid": "36c8894e068a0115f152e239249bd4a972801b1a"}, "author": "", "url": "http://uk.prweb.com/releases/2015/10/prweb12993626.htm", "ord_in_thread": 0, "title": "DancePicker app makes us all Strictly dance experts.", "locations": ["America", "UK"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Graham Jarvis", "Graham", "Jess Glynne", "DancePicker", "Sheeran"], "text": "DancePicker app makes us all Strictly dance experts. Share Article Samba to Sheeran, Waltz to Westlife, Jive to Jess Glynne? Strictly Come Dancing and Dancing with the Stars' music guru Graham Jarvis has created an app called ‘DancePicker’ which helps users find the perfect song for their favourite dance or the perfect dance for their favourite song. DancePicker app DancePicker’ app helps users find the perfect song for their favourite dance or the perfect dance for their favourite song! Woking Surrey   Graham Jarvis, who’s worked on many TV (Only Fools and Horses, My Family) and dance shows in the UK and America, including Strictly Come Dancing and Dancing with the Stars, has listened to more than 11 thousand songs in real time, alongside professional dancers, and decided which dance style each track works best for. The tracks have then been categorised accordingly in an easy to use app format. Users can easily search for an artist, song or one of thirty dance styles. Graham says, “Dance shows are so popular. They’ve encouraged more and more people to become interested in dancing, with many taking to the floor for the first time. I decided to create the DancePicker app to help beginners and professionals alike to find music and dances to enjoy.” DancePicker isn’t only useful to dancers however. Graham says, “Picking your first dance on one of the most important days in your life can be daunting. Using the wedding filter on the app means couples can quickly see what will work on their big day to make their first dance special.” The filter option also allows you to search for Disney songs, Halloween, Country and many more and makes planning party music a breeze. The TempoPicker facility will also help joggers, runners and even dressage choreographers find tracks that are the perfect tempo for them. Once you’ve found the tracks you want you can preview them and have the option to buy and download them to your device and you are ready to get moving.", "external_links": [], "published": "2015-09-30T07:00:00.000+03:00", "crawled": "2015-10-01T05:07:05.374+03:00", "highlightTitle": ""}