{"organizations": [], "uuid": "e0bba67cb4df02542edea499262f416c427cce8c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eveningtribune.com", "main_image": "http://www.eveningtribune.com/Global/images/head/nameplate/hornelleveningtribune_logo.png", "site_section": "http://www.eveningtribune.com/entertainment?template=rss&mime=xml", "section_title": "Entertainment - The Evening Tribune", "url": "http://www.eveningtribune.com/article/20151008/NEWS/151009760/2052/ENTERTAINMENT?rssfeed=true", "country": "US", "title": "HHS choirs to hold pops concert Oct. 14", "performance_score": 0, "site": "eveningtribune.com", "participants_count": 1, "title_full": "HHS choirs to hold pops concert Oct. 14", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T04:42:00.000+03:00", "replies_count": 0, "uuid": "e0bba67cb4df02542edea499262f416c427cce8c"}, "author": "Ryan Papaserge/The Evening Tribune", "url": "http://www.eveningtribune.com/article/20151008/NEWS/151009760/2052/ENTERTAINMENT?rssfeed=true", "ord_in_thread": 0, "title": "HHS choirs to hold pops concert Oct. 14", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "HHS choirs to hold pops concert Oct. 14 Comment By Ryan Papaserge/The Evening Tribune The Evening Tribune By Ryan Papaserge/The Evening Tribune Posted Oct. 8, 2015 at 8:42 PM Updated at 8:42 PM By Ryan Papaserge/The Evening Tribune Posted Oct. 8, 2015 at 8:42 PM Hornell, N.Y. HORNELL — The Hornell High School Vocal Music program will take its audience on a trip through recent pop music history next week. The school's choirs will hold a pops concert on Wednesday, Oct. 14 at 7:30 p.m. in the Hornell High School auditorium. Doors open at 7 p.m. and admission is $5. All proceeds will go towards the program's trip to Chicago this coming April. Chris van Leeuwen, Hornell High School director of vocal music, said that the inspiration for the concert came from a Broadway revue his students did last February to raise money for a trip to Washington, D.C. \"Most of what you're going to hear is stuff that's recent,\" van Leeuwen said. \"Tony Bennett and Lady Gaga, nice little mashup there. Beyonce, Whitney Houston, some really interesting things ... You're going to hear things like Don Henley, you're going to hear Michael Jackson, Journey, Tears for Fears, stuff like that. We're just going to be opening it up. A lot of different pop songs I'm really excited about. \"We just got back to school Sept. 8 so we're throwing a concert together in a very, very short amount of time and they've learned a lot of good music. Billy Joel's is going to be done, Norah Jones is going to be done, James Taylor is going to be done. There's just such great stuff that's going to be taking place. Adele, Miley Cyrus — I'm actually going to be teaching a Miley Cyrus tune. I can't believe I can say that.\" The concert will feature a mix of ensemble performances and special numbers. For example, the Junior High Choir will perform Journey's \"Faithfully\" and \"Everybody Wants to Rule the World\" by Tears for Fears; the Women's Choir will sing Adele's \"Someone Like You\" and Miley Cyrus' \"The Climb\"; and the Senior High Choir will perform Michael Jackson's \"Man in the Mirror\" and \"The Heart of the Matter\" by Don Henley. The Jazz Choir, Show Choir and Vox Feminam will also perform modern hits during the concert. Van Leeuwen noted that his students picked their own special numbers to perform. Some of the 15 numbers include Andrew Richardson's performance of \"Never Gonna Give You Up\" by Rick Astley; MaryGrace Gambino's rendition of \"I Have Nothing\" by Whitney Houston; and Rachel and Maggie Shepard's version of Paul McCartney's \"Maybe I'm Amazed.\" Like the previous fundraising concert — which took place weeks before the Washington, D.C. trip — van Leeuwen's singers are forced to deal with a limited period in time in which to learn the material. School started on Sept. 8 and students have this coming Friday off for a conference day as well as Monday due to Columbus Day. However, van Leeuwen said his students have been up to the challenge so far. Page 2 of 3 - \"All told, I think I only had 22 rehearsals to get ready,\" van Leeuwen said. \"(The students) are coming from a summer break where some of them haven't used their brains in a long time either so we had to like snap into it real quick whereas in January, February they've already been singing for four or five months and they're fresh. \"The kids are flexible, they're pliable. If they want it bad enough they'll put in the time to do it and they are. They're putting in a good amount of effort to make sure this works well.\" While the music performed during next week's concert will likely be familiar to many in the audience, van Leeuwen noted it was slightly different with his students. \"My younger kids, they recognized some of the tunes but they have no clue who the artists are,\" van Leeuwen said. \"I think that's really the trend is a lot of those guys have heard the tunes, they don't know the verses, they don't know who the artists are but they know songs.\" Van Leeuwen also credited TV hits like \"The Voice,\" \"American Idol\" and \"Glee\" (among a myriad of others) for exposing youngsters to a wide variety of music. \"I think television shows today — well, there's so many of them,\" van Leeuwen said, \"all these shows that are showing popular music, not just of that generation but of all generations spanning past so I think they're at a tremendous advantage of having a wide scope of music available to them in a medium where they're comfortable with it ... I'm surprised at how accepting they are of stuff that is socially not the norm.\" Van Leeuwen credited Neil Bryson, music teacher in the Bath Central School District, for coming up with the idea for the pops concert and was inspired to do his own version of it after watching Bryson's students. The goal is now to pick a different theme each year for a fundraising concert. \"Now that we're doing that in contrast to Broadway, now I think each year we can pick a different focus, a different spotlight on the type of music we're going to do,\" van Leeuwen said, \"whether it be a decades concert or a themed concert. I think now it's really nice that they get to do something that's not so standard literature.\" The Hornell High School Vocal Music program will travel to Chicago on April 7-10 for the WorldStrides Heritage Festival. It will a unique experience for students — long bus ride notwithstanding. \"It takes 10 hours to get there by bus so we knew we were going to be on the bus for quite some time,\" van Leeuwen said. \"We'll be leaving on a Thursday morning, early in the morning and spend a good portion of the late night-early morning driving to get there. We'll take in a musical while we're there, we're going go to the Oriental Theatre and take in 'Matilda.' The competition will be on Saturday while they're there. They'll attend Medieval Times, that's where the awards ceremony will be held and we'll get right back on the bus after the awards ceremony and drive right back to Hornell.\" Page 3 of 3 - After next week's concert, the vocal music program returns to the stage on Dec. 17 for the annual winter concert. Hornell High School's Select Choirs are available to perform for area organizations and events in December. Contact van Leeuwen at chris.van.leeuwen @hornellcsd.org for more information as soon as possible. By Ryan Papaserge/The Evening Tribune The Evening Tribune By Ryan Papaserge/The Evening Tribune Posted Oct. 8, 2015 at 8:42 PM", "external_links": [], "published": "2015-10-09T04:42:00.000+03:00", "crawled": "2015-10-09T06:48:27.638+03:00", "highlightTitle": ""}