{"organizations": [], "uuid": "bc27f92c35ac78912af37452cad7ba100f095fdc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48524/entertainment", "section_title": "Entertainment - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30170665/author-accuses-google-facebook-and-the-nsa-of-burglary", "country": "US", "title": "Author Accuses Google, Facebook and the NSA of Burglary", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Author Accuses Google, Facebook and the NSA of Burglary - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "bc27f92c35ac78912af37452cad7ba100f095fdc"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30170665/author-accuses-google-facebook-and-the-nsa-of-burglary", "ord_in_thread": 0, "title": "Author Accuses Google, Facebook and the NSA of Burglary", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " PKI Press\nBOSTON , Oct. 2, In his book Escape The Plantation , Wes Kussmaul asserts that our phones, computers and tablets and the files and online spaces we manage with them constitute second homes – our information homes. Therefore, when companies and governments break into our information homes they're committing acts of burglary.\nPhoto - http://photos.prnewswire.com/prnh/20151001/273142\nTo make his point, Kussmaul includes a sample theft report form from a police department in his book and urges the reader to go to her local police station, request the local version of the form, and report the burglary of her information home and the theft of information from it.\n\"If someone broke into your home and stole a camera, you'd report the crime, wouldn't you?\" writes the author. \"So if Google or Facebook or WPP or a government agency has stolen your personal intellectual property, that is, the information that identifies you and your travels and habits and interests, shouldn't you report it? It's not simply a matter of seeking personal restitution; reporting theft is also your civic duty.\"\nEscape The Plantation offers other remedies to victims of invasion of privacy, phishing attacks, online fraud, predation, viruses and other malware. Most importantly, Kussmaul says, is to understand that the old \"information highway\" metaphor is as apt as ever; the Net is, and always will be, an outdoor public transport system. \"We're keeping our files, holding our meetings, and letting our kids play by the side of a busy roadway\" says Kussmaul.\nThe solution, says the author, is precisely the same as the solution to the problems we would have if we found ourselves working and living in cardboard boxes by the side of the street. That is, we would construct indoor spaces – buildings. Kussmaul notes that a proven construction material called PKI has existed for decades, but that PKI has been misunderstood and deployed in bits and pieces. \"It's as though some building materials engineers had delivered a pile of really good construction materials to a site and pronounced the pile to be a building.\"\nA practical guide to designing and building secure online indoor spaces, protected from data mining burglars and thieves, is detailed in the book. Such buildings are accessible via the Web but apart from the Web – as your physical home is accessible via the roadway but is apart from the roadway.\nAs the founder of Delphi Internet Services Corporation, which was acquired by Rupert Murdoch's News America Corp., Wes Kussmaul has been conceiving and creating secure online spaces since 1981.\nEscape The Plantation , 387 pages, ISBN 978-1-931248-23-5, published by PKI Press, is available in ebook and print form for $24.95 from The PKI Press Bookstore at https://pkipre ss.com and from other booksellers. Review copies available.\nPKI Press was established in 2001 to serve readers interested in issues of identity, authentication, privacy, and online community. If you're interested in the future of the Internet, browse our online catalog to find indispensable books for both technical and non-technical audiences.\nContact: Harvey Wharfield , Post Oak Associates\n(978) 635-9586 | Email\n releases/author-accuses-google-facebook-and-the-nsa-of-burglary-300153271.html\n ", "external_links": ["https://pkipress.com/", "http://www.xmlnews.org/ns/", "http://rt.prnewswire.com/rt.gif?NewsItemId=PH17746&Transmission_Id=201510020830PR_NEWS_USPR_____PH17746&DateId=20151002", "http://www.prnewswire.com/news-releases/author-accuses-google-facebook-and-the-nsa-of-burglary-300153271.html", "http://photos.prnewswire.com/prnh/20151001/273142", "http://pressreleaseheadlines.com/contact?pid=291537"], "published": "2015-10-02T03:00:00.000+03:00", "crawled": "2015-10-02T17:10:57.729+03:00", "highlightTitle": ""}