{"organizations": [], "uuid": "dad7bb36f0c6ed6bb2485c73d5bea8fd623c187e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "", "site_section": "http://www.prweb.com/rss2/aemuseums.xml", "section_title": "Arts &amp; Entertainment: Museums", "url": "http://www.prweb.com/releases/2015/10/prweb13001460.htm", "country": "US", "title": "Thinkwell Group Appoints Two New Senior Level Executives For Thinkwell Asia", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Thinkwell Group Appoints Two New Senior Level Executives For Thinkwell Asia", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "dad7bb36f0c6ed6bb2485c73d5bea8fd623c187e"}, "author": "Andrea Yoo", "url": "http://www.prweb.com/releases/2015/10/prweb13001460.htm", "ord_in_thread": 0, "title": "Thinkwell Group Appoints Two New Senior Level Executives For Thinkwell Asia", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Thinkwell Group, a global experience design and production agency specializing in the creation of theme parks, major attractions, live events, and museum exhibits around the world, has announced the appointment of Evi Sari as Managing Art Director and Yan Yan as Director of Business Development for Thinkwell Asia. Both women will be working out of Thinkwell’s offices in Beijing, China. A native of Beijing, Yan brings over 15 years of experience in the entertainment and media industries. Prior to joining Thinkwell, Yan worked as a producer for Reuters TV, a project manager for Getty Images during the 2008 Beijing Olympic Games, and as a group syndication manager for Condé Nast China. Additionally, Yan has extensive experience working in business development with major global brands Sony Music, Warner Music, Skype, and Universal Music. As the director of business development for Thinkwell Asia, Yan is primarily responsible for sourcing and reviewing new business opportunities, retaining and developing existing client relationships, and executing long-term strategic plans for Thinkwell Asia.\nBorn in Indonesia and raised in Singapore, Sari brings over 10 years of experience and contacts in China working in the entertainment and creative sectors. Prior to joining Thinkwell, Sari served as creative development director for Tim Yip Studio, the Beijing-based company founded by the Oscar-winning production designer of \"Crouching Tiger, Hidden Dragon\" directed by Ang Lee. At Tim Yip Studio, Sari worked on projects such as \"Red Cliff,\" a John Woo and China Film Group production, \"The Banquet\" produced by Huayi Bros, The Weinstein Company and Netflix series \"Marco Polo,\" the Kennedy Center’s Festival of China, and The Han Show by Franco Dragone and the Wanda Group. As managing art director, Sari will be responsible for liaising between Thinkwell’s U.S.-based art directors, the China-based design teams and clients in Asia, to manage talent, mentor designers, and support business development.\nAs Thinkwell Asia continues its rapid growth, filling key roles within the organization has become a top priority for the company. “Building a design studio in Beijing to mirror our studio in Los Angeles is no small task, but the talent we are finding here in China is quickly solidifying our ability to continue the amazing work we do in the location based entertainment industry,” says Kelly Ryner, President of Thinkwell Asia. “Our team in China is an extension of our U.S. operations, providing our clients just the right balance of Eastern and Western creativity and business sense.” By adding these two significant appointments, Thinkwell Asia boasts an experienced management team that can help drive the organization’s efforts in Asia.\nThinkwell has worked in Asia for many years in the theme park and resort sectors helping major studios, casino owners, and Fortune 500 companies to expand their brand and intellectual properties overseas. Recent projects in China have seen Thinkwell partnering in the strategy, creation, and development of new intellectual properties and projects for heritage attractions, educational experiences, theme parks and resorts with real estate developers like Zhonghong Group, Eontime, Le Song, Legend Tourism, and Huayi Brothers Studios.\nAbout Thinkwell Group\nFounded in 2001, Thinkwell is a global experience design and production agency specializing in the creation and master planning of theme parks, destination resorts, major branded and intellectual property attractions, events & spectaculars, museums & exhibits, expos and live shows around the world. The award-winning company has become a leader in experiential design by bringing a unique holistic approach to every creative engagement, delivering extraordinary results to notable clients over the years, including Fortune 500 companies, movie studios, museums, theme parks and destination resorts. For more information visit http://www.thinkwellgroup.com .", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy50aGlua3dlbGxncm91cC5jb20="], "published": "2015-10-06T03:00:00.000+03:00", "crawled": "2015-10-06T16:49:09.208+03:00", "highlightTitle": ""}