{"organizations": [], "uuid": "e2ffca43285ffea17516559ef8a8247cf65e9264", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://images.canberratimes.com.au/2015/09/26/6880469/Thumbnail1000808567gjut96image.related.thumbnail.320x214.gjustz.png1443755655607.jpg.jpg", "site_section": "http://feeds.canberratimes.com.au/rssheadlines/entertainment.xml#", "section_title": "Canberra Times Entertainment Headlines", "url": "http://www.canberratimes.com.au/entertainment/melbourne-festival-2015-unleashes-creatures-from-ronnie-van-houts-black-lagoon-20150926-gjustz.html", "country": "AU", "title": "Melbourne Festival 2015 unleashes creatures from Ronnie Van Hout's black lagoon", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "Melbourne Festival 2015 unleashes creatures from Ronnie Van Hout's black lagoon", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T16:45:00.000+03:00", "replies_count": 0, "uuid": "e2ffca43285ffea17516559ef8a8247cf65e9264"}, "author": "Andrew Stephens", "url": "http://www.canberratimes.com.au/entertainment/melbourne-festival-2015-unleashes-creatures-from-ronnie-van-houts-black-lagoon-20150926-gjustz.html", "ord_in_thread": 0, "title": "Melbourne Festival 2015 unleashes creatures from Ronnie Van Hout's black lagoon", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Dark Pool by Ronnie Van Hout: The Creature from the Black Lagoon especially fascinates the artist. Photo: Supplied \n\nMonsters lurk in Ronnie Van Hout's studio. There's Dracula, Frankenstein, Wolf Man and the Creature from the Black Lagoon, among others. He photographs them in luscious close-up and they remain motionless – they are, after all, plastic figurines – but the photos return them to something cinematic, even though their deeper origins are likely to be found in literature.\nThe Creature from the Black Lagoon especially fascinates Van Hout. For him, this ugly beast has an uncomplicated symbolism, embodying the monstrous emerging from a dark pool, just as our inner demons reside in the murky unconscious.\nVan Hout and his monsters plunge in, and take us with them.\nRonnie Van Hout photographs monsters in luscious close-up for The Dark Pool . Photo: Supplied \nTurning his interest into The Dark Pool , an exhibition as part of the Melbourne Festival, Van Hout has interwoven another interest that at first might seem tangential – Stanley Kubrick's A Clockwork Orange (1971). Yet both the film and the model monster kits share a level of notoriety whose reverberations are still felt.\nAdvertisement Classic model kits of popular monsters were designed in the late 1960s and came out when there was a craze for monster movies. This coincided with Van Hout's childhood in New Zealand, though he didn't start collecting the kits until the 1990s, when they were re-released. In many ways, he says, the monsters are pre-20th century, belonging to another age before psychoanalysis and the work of Sigmund Freud or Carl Jung took root.\nLooking at the models in his studio, Van Hout began to see themes emerging; often, the monsters were set in a particular environment – an underground torture chamber, or some other subterranean cavity, such as the Black Lagoon.\nRonnie Van Hout says the fictional monsters belong to an age before psychoanalysis. Photo: Supplied \nVan Hout knew about the controversy surrounding the kits when they were originally released. Made by the Aurora Plastics Corporation, founded in 1950, the first kit rolled off the conveyor belt in 1961. It was Frankenstein – a strange fact given that the monster in Mary Shelley's 1818 novel was itself a piece of manufacturing in the form of surgically connected off-cuts of human beings.\nIt was certainly a successful production line. According to monster-mania historian Dennis Prince, Aurora went on to develop 13 monster kits, including Dracula, the Mummy, Wolf Man, the Hunchback of Notre Dame, King Kong, Godzilla, a Salem witch and the Bride of Frankenstein.\nPrince writes in his book Aurora Monster Scenes – The Most Controversial Toys of a Generation (2014) that the toys became infamous in 1971 when Aurora developed them as \"Monster Scenes\" with interactive adaptable figures in play sets based on the classic monster films. Marketing of them touted \"X-rated\" themes of sex and sadism, even though they were pitched at children as young as eight.\nThe kitset subjects of Ronnie Van Hout's The Dark Pool were first released in the 1960s. Photo: Supplied \nAlarm bells sounded not over the monsters – people were used to them – but the sadistic scenes in which they were set. The monsters came with an array of torture devices and a figure called the \"Victim\". In one piece of marketing, for example, the Victim has been kidnapped so she can be brought to the dungeon. As she screams for help, villainous Vampirella declares: \"Don't worry, this is New York, no one will help her!\" This caused outrage as it referenced real events in Manhattan, at that time notorious for some crimes in which bystanders or neighbours did nothing to help victims.\nAurora, on the cusp of new success, had to go into battle with parenting organisations, women's advocacy groups, Christian activists and toy safety watchdogs. In his book, Prince describes the kerfuffle as a series of misunderstandings that toppled the company, owned by Nabisco.\nFor Van Hout, this story strangely parallels Kubrick's A Clockwork Orange , also released in 1971 and also causing a storm of protest after a wave of crimes appeared to emulate those portrayed in the film.\nModel artist: Ronnie van Hout explores monstrous depths in The Dark Pool . Photo: Supplied \nBased on Anthony Burgess' futuristic tale, the film was withdrawn from distribution in Britain in 1974 by Warner Brothers, at Kubrick's request. The director had become agitated about a series of rapes and murders that had been linked to the teenage violence depicted in his film.\nVan Hout understands the controversy, saying the character of Alex (played by Malcolm McDowell) is smart, desirable and attractive. \"It looks like the world is the problem, not Alex.\"\nKubrick was one of the first auteurs Van Hout read about when he studied film, realising that the director wasn't simply telling a story but using cinematic techniques to tell another story underneath the mechanics of the plot. Like those Aurora model kits, Kubrick was setting a scene – one that can be terribly disturbing.\n\"It is one of those films where you see stuff you really don't want to look at,\" Van Hout says. \"It is as if you are not supposed to look at it.\"\nLike the Aurora kits, A Clockwork Orange was also born out of the monster mania of the 1960s and one of the early films in that genre that Van Hout saw was George A. Romero's Night of the Living Dead . Romero, says Van Hout, was the first to make a direct analogy by using a monster, equating the zombie with racial violence in America. \"When the film ends it suddenly looks like a documentary.\" Watching it back then, he had thought it unusual to have an African-American in the lead role – until the film began to wrap up.\n\"There is no racial tension at all until right at the end – when Romero effectively tells you that what you've been watching is something else altogether.\"\nCinema historian Barbara Creed reflects on these subtexts, writing in a short essay for The Dark Pool that its \"outsiders and abjects\"' disturb the mind long after the gallery doors have closed. \"The artist brings back to life what the past has repressed, those things that trouble and disturb the unconscious. Ronnie Van Hout's images speak so eloquently to the uncanny.\"\nThe uncanny, a term cemented into contemporary culture by Sigmund Freud, is based on the German word unheimlich, whose translation roughly connects it to ideas about the homely and familiar, the unhomely and the unfamiliar. In the form of ghosts, dolls, automata, clockwork, doubles, severed limbs and castration anxiety, uncanny fears evoke anxiety, disquiet and apprehension.\n\"Stanley Kubrick's A Clockwork Orange of 1971 was a 'bad' film,\" Creed writes. \"It hit a new high in uncanniness. Alex himself was a large clockwork doll – dancing to Singing in the Rain as a warm-up to rape and mayhem. The law prescribed aversion therapy. Alex was a mistake society tried to mend. Kubrick's film was so powerful it turned many cinemas into haunted houses.\"\nVan Hout is bringing it and a monster-mash of villains back for another bout of reflection – by ourselves and our inner monsters.\nThe Dark Pool is at the Centre for Contemporary Photography, October 2–November 15. ccp.org.au . The Melbourne Festival runs October 8-25. festival.melbourne", "external_links": [], "published": "2015-10-02T16:45:00.000+03:00", "crawled": "2015-10-02T22:24:29.147+03:00", "highlightTitle": ""}