{"organizations": [], "uuid": "d6dd0e2961deb6cbd601b626a993d3eb3ca47ac5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wiltshiretimes.co.uk", "main_image": "http://www.wiltshiretimes.co.uk/resources/images/4361637/", "site_section": "http://www.wiltshiretimes.co.uk/leisure/showbiz/rss/", "section_title": "Wiltshire Times | National Entertainment News", "url": "http://www.wiltshiretimes.co.uk/leisure/showbiz/13892387.Caitlyn_Jenner_s_I_Am_Cait_is_renewed_for_season_2_and_the_star_couldn_t_be_happier/?ref=rss", "country": "GB", "title": "Caitlyn Jenner's I Am Cait is renewed for season 2 and the star couldn't be happier", "performance_score": 0, "site": "wiltshiretimes.co.uk", "participants_count": 0, "title_full": "Caitlyn Jenner's I Am Cait is renewed for season 2 and the star couldn't be happier", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T15:05:00.000+03:00", "replies_count": 0, "uuid": "d6dd0e2961deb6cbd601b626a993d3eb3ca47ac5"}, "author": "", "url": "http://www.wiltshiretimes.co.uk/leisure/showbiz/13892387.Caitlyn_Jenner_s_I_Am_Cait_is_renewed_for_season_2_and_the_star_couldn_t_be_happier/?ref=rss", "ord_in_thread": 0, "title": "Caitlyn Jenner's I Am Cait is renewed for season 2 and the star couldn't be happier", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Caitlyn Jenner", "Cait"], "text": "Caitlyn Jenner's I Am Cait is renewed for season 2 and the star couldn't be happier Caitlyn Jenner's I Am Cait is renewed for season 2 and the star couldn't be happier \nPress Association 2014 / / National Entertainment News Share \nCaitlyn Jenner has said she is “looking forward to continuing the conversation” following the renewal of I Am Cait. \nThe reality programme, broadcast by America’s E! network, has been given a second season following the success of the first. \nI Am Cait charts her transition from TV star and Olympic hero to transgender advocate. Caitlyn Jenner (Chris Pizzello/Invision) \nThe much-publicised premiere episode in July drew 2.7 million viewers to E! in the US, with a further four million watching additional plays. \nThe ratings have dipped slightly since then, but E! is happy to extend the run. \nThe star took to Twitter to express her feelings. I'm looking forward to continuing the conversation. #IAmCait \n— Caitlyn Jenner (@Caitlyn_Jenner) October 22, 2015 \nIn a statement, E! executive vice president of programming Jeff Olde said: “Caitlyn’s story has ignited a global conversation on the transgender community on a scale that has never been seen before.” \nHe added: “We are honored Caitlyn has chosen to continue to share her ongoing story with our viewers around the world.” \nThe first season of the show was a mixture between Caitlyn’s new life of campaigning for transgender rights and some soapy moments as it crossed territory at times, inevitably, with fellow E! reality series Keeping Up With The Kardashians. \nThere were appearances from step-son Rob Kardashian, step-daughters Khloe, Kourtney and Kim alongside her rapper husband Kanye West. \nIn addition, the Jenner clan gave full support, including Caitlyn’s daughters Kendall and Kylie Jenner. \nBut the guest star everyone wanted to see was Caitlyn’s ex-wife, Kris Jenner. The season finale featured a showdown between the two women as they attempted to bury the hatchet. \nIn September, the 65-year-old filed paperwork to make her name and gender change official. She was recently seen attending step-daughter Kim’s 35th birthday party. Share article \nI Am Cait will return in 2016. Promoted Stories", "external_links": [], "published": "2015-10-23T15:05:00.000+03:00", "crawled": "2015-10-23T22:07:35.293+03:00", "highlightTitle": ""}