{"organizations": [], "uuid": "007201578627848175a441ec85df11f5fbb690e6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.maxim.com", "main_image": "", "site_section": "http://www.maxim.com/entertainment", "section_title": "Entertainment | Maxim", "url": "http://www.maxim.com/entertainment/sports/article/why-college-football-fans-are-more-devoted-nfl-fans-2015-10", "country": "US", "title": "Why College Football Fans Are So Much Crazier Than NFL Fans", "performance_score": 0, "site": "maxim.com", "participants_count": 1, "title_full": "Why College Football Fans Are So Much Crazier Than NFL Fans | Maxim", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "007201578627848175a441ec85df11f5fbb690e6"}, "author": "Diane Roberts", "url": "http://www.maxim.com/entertainment/sports/article/why-college-football-fans-are-more-devoted-nfl-fans-2015-10", "ord_in_thread": 0, "title": "Why College Football Fans Are So Much Crazier Than NFL Fans", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Pro football has its fans, but college football inspires a ferocious devotion that's on another level entirely.\nSure, in the NFL, you’re a Packers fan, a Dolphins fan, a Saints fan. Yes, fan is short for fanatic, and yes, pro football people feel passion and loyalty. Nevertheless, you’re at one remove from the mad nucleus of that identity. “Your” team could move and morph; they do it all the time.\nThe Rams left Cleveland for LA, then settled in Saint Louis. The Houston Oilers bailed on the city that lent their name some cred, turfed up in Memphis, and finally landed in Nashville as the Tennessee Titans, a reference, perhaps, to that city’s full-scale replica of the Parthenon. Not that Pallas Athene was a Titan (she belonged to the usurping Olympian clan), but what’s a little fuzzy mythology between season-ticket holders?\nIn the college game, hundreds of thousands of grown people travel long distances to sit for hours on hard metal bleachers and engage in sacramental cheering and singing, suffering and rejoicing over a bunch of armor-clad boys the size of cows crashing into each other on a field. Many (not all, mind you) will admit the existence of some things more important than football: war, famine, terrorism, deforestation, the birth of children, the death of parents, high blood pressure, low self-esteem, the Islamic State, near-Earth asteroids, Ebola, rising sea levels—complicated stuff.\nYet people who can’t be bothered to show up at the polls on Election Day or recycle their plastic bottles follow their football clans from Kickoff Classic Labor Day games in Atlanta to bowl games in Dallas, unfazed by the soul-sapping heat of September or the iron cold of January.\nDevotion to college football is more fundamental than mere fandom: it’s as if you carry your team breed in your mitochondrial DNA. You’re not a Bulldog fan or Buckeye fan; you actually are a Bulldog or a Buckeye. Not quite literally, of course. But some mystical imprinting occurs, some molecular-level shamanistic transformation.\nYou run with the Wolfpack, strut with the Gamecocks, roll with the Tide; you’re a Trojan, a Spartan, a member of the Auburn Family or the Seminole Nation. You are a citizen of a country with invisible borders. In the psychic fiefdoms of college football, we are like medieval villagers, certain that while we are righteous folk, that bunch over in the next hamlet are witches.\nWe are who we are because we are not those assholes who support Notre Dame or Tennessee or Oregon: we are better-looking, smarter, way cooler. Our team is virtuous, brave, strong; their team is full of cheats and thugs. If their team wins, bad things happen. The moral order disintegrates. Chaos ensues. If our team wins, the universe vibrates with joy.\n…\nCollege football divides the world into Us and Them, validating Us and disparaging Them. College football allegiance overrides many of the usual divisions—at least, temporarily. In the stadium, tribe trumps race. That lady in the jersey sitting next to you might be the quarterback’s mother, though at big-time football colleges, there are proportionally many more African Americans in pads and helmets than eating boiled peanuts in the stands or kicking back in the skyboxes.\nThose white Bulldogs or Tigers or Spartans or Longhorns might not live next to black folks or have black friends who come for dinner, but from the way they name-check Ja’Vonn and Mario, Kermit and Isaiah, the boys on the field, you’d think they were talking about favorite nephews.\nFootball cuts across geography, too: a cane-syrup Mississippi Delta accent heard among the board-flat vowels of Notre Dame Stadium might bring on a friendly question or two, but as long as that person’s wearing green and cheering the right plays, he’s Irish. And, speaking of religion, the Christians in the stands—mainline, evangelical, or those who don’t exactly go to church but still get worked up about the “War on Christmas”—are OK with Islam so long as its adherents can run like Nebraska’s Ameer Abdullah.\nAmericans are at least as adept as older cultures at dividing people up into categories of approval or disapproval: look at the South. Four centuries of race obsession has honed our genius for taxonomy. In the eighteenth and nineteenth centuries, black people weren’t simply black people; they came in all sorts of varieties, mixtures to which white people attached names: mulattoes, quadroons, octoroons, sacatras, and griffes.\nSoutherners now apply the same rage for definition and exclusion to social class, gender roles, sexuality, membership in clubs and groups, and, of course, college. Cocktail shaker in the glove compartment of the Jeep? Probably went to LSU. Wears pearls in bed? Went to Randolph-Macon. Owns a kilt? Sewanee. Camo in church? Texas A&M. Keeps saying he could have gone to Yale? Duke. Knows a suspicious amount about livestock? Auburn.\nNo wonder college football took root with such lush and creepy vigor in small-town America. It’s our essential sport. The South, the Midwest, the rural, and many of the not truly urban burgs (Baton Rouge, Dallas, Iowa City) throughout the country that still operate like large villages, slow to change their thinking on race, gender, sexuality, and the divinely favored goodness of America, all love college football.\nIt’s the metaphor that keeps on giving, a game played by twenty-year-old boys raised to the level of some ultimate battle, some titanic struggle, for dominance, pride, joy, a championship or maybe a postseason trip to the Poulan Weed-Eater Independence Bowl or the Tostitos Fiesta Bowl.\nIt’s possible to live in Seattle or LA or New York and never notice that Washington or USC or, bless their hearts, Columbia, is playing at home Saturday, but in a college town, football season infects the place like an outbreak of swine flu: even if you don’t get the fever, you cannot help knowing it’s raging.\nYou hear people playing the fight song out of their apartment windows, see the car flags fluttering as you drive, jostle your way through crowded grocery store aisles as the faithful, decked out in their colors, load up on Pringles and Bud Light Platinum for the tailgate, then holler “War Eagle!” or “Go Big Red!” across the parking lot.\nGet within a mile of the stadium and you will smell ribs smoking, steaks grilling, the acid pong of mustard, and the sour stink of beer spilled on the sidewalk in the sun. The normal rules of chemistry and physics, to say nothing of civil society and the highway code, are suspended: in Tuscaloosa parking is so scarce—for cars, anyway, the RVs sprawl over about half an acre each—that somehow a Cadillac Escalade and a Range Rover can both squeeze into a single space.\nIn Athens, the bars and liquor stores open extra early on the theory that being drunk by nine a.m. gives you plenty of time to sober up before a noon kickoff. On game day, your heart beats faster; you escape from the petty worries of the quotidian—grades, jobs, the mortgage, the marriage—and enter the epic, elemental, Us versus Them.\nAdapted excerpt from Tribal: College Football and the Secret Heart of America by Diane Roberts. Copyright © 2015 by Diane Roberts. A Harper book, an imprint of HarperCollins Publishers.", "external_links": ["http://www.amazon.com/exec/obidos/ASIN/B00T3D7IIW"], "published": "2015-10-23T03:00:00.000+03:00", "crawled": "2015-10-23T21:58:47.936+03:00", "highlightTitle": ""}