{"organizations": [], "uuid": "a895e2e719d76bc8ae816413d644d15b0c0b9726", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266353/arts-entertainment-television", "section_title": "Arts &amp; Entertainment: Television - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30161978/a-weekend-dedicated-to-le-donne-del-vino-at-the-italian-wine-pavilion-expo-2015", "country": "US", "title": "A Weekend Dedicated to Le Donne Del Vino at the Italian Wine Pavilion, EXPO 2015", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "A Weekend Dedicated to Le Donne Del Vino at the Italian Wine Pavilion, EXPO 2015 - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T18:01:00.000+03:00", "replies_count": 0, "uuid": "a895e2e719d76bc8ae816413d644d15b0c0b9726"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30161978/a-weekend-dedicated-to-le-donne-del-vino-at-the-italian-wine-pavilion-expo-2015", "ord_in_thread": 0, "title": "A Weekend Dedicated to Le Donne Del Vino at the Italian Wine Pavilion, EXPO 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Italian National Association “Le Donne Del Vino”, which loosely translated from Italian means “women in the wine business”, will host the event “L’Italia del Vino” on Saturday the 3rd and Sunday the 4th of October at the Italian Wine Pavilion, VINO A Taste of Italy at Expo 2015 in Milan.\n(PRWEB) October 01, 2015\nThe Italian National Association “Le Donne Del Vino”, which loosely translated from Italian means “women in the wine business”, will host the event “L’Italia del Vino” on Saturday the 3rd and Sunday the 4th of October at the Italian Wine Pavilion, VINO A Taste of Italy at Expo 2015 in Milan. Taking place in the Hortus Area of the pavilion, which already hosts the weekly appointment “VINO is Aperitivo”, 70 women from the Italian National Association, in these two days, will present to Expo visitors 105 wines from their wineries originating from Northern, Central, and Southern Italy. The wine selection will range from bubbles and whites, to rosés, fine reds, and sweet wines, thus representing the various wine realities of Italy. The tasting modalities are the same as those of the Wine Library on the first floor as well as the weekly event “VINO is Aperitivo”: visitors can buy a Wine Card for 10 which entitles them to three wine tastings and a light snack with Prosciutto and Parmesan.\nBeyond having the opportunity to taste a wide range of fine Italian wines and getting to know who makes those wines, the event will also serve to raise awareness of the growing number of women working within the wine industry, who are often uncelebrated and confined to less visible roles and tasks. The Italian National Association “Le Donne del Vino” aims at endorsing the role of women in an industry that is, and has been, dominated by men.\nSince its foundation in 1988 by ElisabettaTognana, the society has gathered over 700 members, including winemakers, oenologists, sommeliers, restaurants and wine-bar owners, journalists and communication specialists who are actively involved in the wine sector, becoming a remarkable example of successful cooperation and coordination for a common cause.\n“’Le Donne del Vino’ could not miss this opportunity to be at Expo in this prestigious context in order to show the entire world the value of our wines” stated Elena Martusciello, the sixth president of the Society, commenting on the decision of the Association to organise the event. Their presence at the Italian Wine Pavilion is expected to have a wide appeal, considering the large number of visitors who decide to discover and taste Italian wine every day. As of the end of September, 1.5 million people (20% of which were foreign visitors) have visited the Italian Wine Pavilion and over 400 thousand people have tasted the 3600 wines featured in these five months. The numbers are still bound to increase during this final month, leading the pavilion to organise several collateral activities in order to entertain all visitors.\nOne of the key contributors of this event is Vinitaly International’s Managing Director Stevie Kim, who was awarded ambassadorship by “Le Donne del Vino” for her contribution to the world of Italian wine, during the last edition of Vinitaly and states “I love the idea of closing the last month of EXPO with a weekend dedicated to “Le Donne del Vino.” On a personal note, it gives me an opportunity to get in touch with these very busy women in order to celebrate Italian wine. From a business perspective, we hope to leverage this weekend in order to broadcast the wonderful characters of Italian wine that is represented by these women producers. We are ever so lucky to have, at one weekend, 70 Italian wine women producers. Good wine in the company of great women: who would not want to be part of this!”\nThe 70 women from “Le Donne del Vino” who will be personally presenting their wines at EXPO on Saturday and Sunday are:\nAbbona Valentina, Aliani Angela, Allegrini Marilisa, Alleva Giulia, Francesca Virginia, Antonutti Adriana, Argiolas Valentina, Ascheri Cristina, Balestrieri Buelli Vanna, Barzano' Lucia, Basile Maria Teresa, Bianchi Michiel Giovanna, Boatti Laura, Borio Mariuccia, Brosio Maria Angela, Busa' Stefania, Cantarutti Antonella, Carmina Laura, Cellerino Renata, Chiari Patrizia, Cinelli Colombini Donatella, Danesi Elena, D'arpa Roberta, Del Duca Claudia, Di Camillo Valentina, Falconieri Lia Margherita, Famiglietti Anna, Formisano Grazia, Gaidano Valeria, Garetto Cristina, Garofano Renata, Gennari Anna, Ghislandi Maddalena, Jacono Gaetana, Koenig Elisabeth, Lisetto Monica, Loi Anna Giulia, Loi Francesca Rita, Maculan Maria Vittoria, Marenco Michela, Martellozzo Piera, Martino Carolin, Masci Katia, Mastroberardino Daniela, Matta Furini Paola, Mauri Alessandra, Molon Ornella, Monti Emilia, Mori Tiziana, Olivini Giordana, Paladin Lucia, Pedrini Magda Rita, Pepe Milena, Pergola Carmen, Poggio Francesca, Prandini Giovanna, Rallo Jose', Rancone Serena, Russo Emanuela, Soletta Pina, Soloperto Sabrina, Sorana Daniela, Tiraboschi Perotti Ambra, Tirelli Gloria, Travaglini Cinzia, Venica Ornella, Walch Elena, Zardo Manuela, Zavattaro Bertone Laura, Zeni Elena, Ziliani Cristina.\nAbout:\nVeronafiere is the leading organizer of trade shows in Italy including Vinitaly ( http://www.vinitaly.com ), the largest wine and spirits fair in the world. During its 49th edition Vinitaly counted some 4.000 exhibitors on a 100.000 square meter area and 150.000 visitors including 2.600 journalists from 46 different countries. The next edition of the fair will take place on 10 - 13 April 2016. The premier event to Vinitaly, OperaWine ( http://www.vinitalyinternational.com ) “Finest Italian Wines: 100 Great Producers,” will unite international wine professionals on April 9th in the heart of Verona, offering them the unique opportunity to discover and taste the wines of the 100 Best Italian Producers, as selected by Wine Spectator. Since 1998 Vinitaly International travels to several countries such as Russia, China, USA and Hong Kong thanks to its strategic arm abroad, Vinitaly International. In February 2014 Vinitaly International launched an educational project, the Vinitaly International Academy (VIA) with the aim of divulging and broadcasting the excellence and diversity of Italian wine around the globe. VIA has now also organizedits very first Certification Course with the aim of creating new Ambassadors of Italian Wine in the World.\n###\n //www.prweb.com/releases/2015/10/prweb12996862.htm\n ", "external_links": ["http://www.prweb.com/releases/2015/10/prweb12996862.htm"], "published": "2015-10-01T18:01:00.000+03:00", "crawled": "2015-10-02T02:18:47.436+03:00", "highlightTitle": ""}