{"organizations": [], "uuid": "7f89932a19651779006445b7a64e125a33f5f8b8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbsnews.com", "main_image": "http://cbsnews2.cbsistatic.com/hub/i/r/2015/10/23/d36cf290-9372-47fa-a0d0-f2930cf31c3b/thumbnail/620x350/9ac65f9ecab7cec1011f393691b64258/istock000037790340large.jpg", "site_section": "http://www.cbsnews.com/", "section_title": "CBS News - Breaking News, U.S., World, Business, Entertainment &amp; Video ", "url": "http://www.cbsnews.com/news/phishing-scam-targets-videogamers/", "country": "US", "title": "Phishing scam targets videogamers", "performance_score": 0, "site": "cbsnews.com", "participants_count": 1, "title_full": "Phishing scam targets videogamers - CBS News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T21:04:00.000+03:00", "replies_count": 0, "uuid": "7f89932a19651779006445b7a64e125a33f5f8b8"}, "author": "Mitch Lipka MoneyWatch", "url": "http://www.cbsnews.com/news/phishing-scam-targets-videogamers/", "ord_in_thread": 0, "title": "Phishing scam targets videogamers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Videogamers are being targeting in phishing scams looking to take advantage of their devotion to their games, the Federal Trade Commission is warning.\nThe scam tries to dupe players into believing the gaming companies are coming after them for such things as selling in-game characters or items used in the game for actual money, the FTC said. Fraudsters send emails to gamers claim the company is going to sue them for up to $2,700 for continued violations of using real money for in-game transactions, hoping to bait targets of the scam into sharing personal or financial information.\n\"If you want to check the status of your account or challenge the suspension, the email tells you to click a link and fill in a 'verification' page,\" the FTC said. \"But that's the way they try to trick potential victims into offering up anything from their address and phone number to their credit card or bank account numbers.\"\nGaming companies have been warning users about these scams. Blizzard Entertainment, which runs such popular games as World of Warcraft and Diablo III, last month informed players of rampant scams and offered a range of tips to avoid being taken.\n\"Phishing emails may appear as promotions that give you something for free (when you log in and 'claim' the item) or threaten account suspension (which you prevent by logging in and 'confirming' some account information),\" Blizzard Entertainment wrote. \"These emails may have simple mistakes that someone writing professionally wouldn't make, so check for bad grammar and spelling. Do not reply to emails that ask for your account information.\"\nIt can be hard to tell what's a scam and what's legit, especially when an email uses company logos or names. Here are a few tips for dealing with emails like this:\nIf you get an email with links, don't click on them Verify questionable emails by contacting the company directly using information not contained in the message Be sure your security software is in use and up to date Don't download attachments in emails from sources you don't know", "external_links": ["https://us.battle.net/support/en/article/phishing"], "published": "2015-10-23T21:04:00.000+03:00", "crawled": "2015-10-23T21:11:08.069+03:00", "highlightTitle": ""}