{"organizations": [], "uuid": "5aac4a5ff7ad612996e6dc709a6ffd5ba28c46df", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/10/21/13036707/paintin.jpg", "site_section": "http://www.prweb.com/rss2/fineart.xml", "section_title": "Arts &amp; Entertainment: Fine Art", "url": "http://www.prweb.com/releases/2015/10/prweb13036707.htm", "country": "US", "title": "Michaan's Auctions Brings New Works to November Market", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Michaan's Auctions Brings New Works to November Market", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "5aac4a5ff7ad612996e6dc709a6ffd5ba28c46df"}, "author": "Talesa Eugenio", "url": "http://www.prweb.com/releases/2015/10/prweb13036707.htm", "ord_in_thread": 0, "title": "Michaan's Auctions Brings New Works to November Market", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Michaan’s Auctions hosts the next Estate Auction on Nov. 7, which will feature works of John Ruskin, Loran Speck and others. A preview will be held Oct. 31, Nov. 1 and Nov. 6. Held at the regular auction place at 2751 Todd St., Alameda, the auction will feature fine art, decorative art, Asian art and jewelry. Lovely pieces of cultured pearl elements highlight the jewelry sale that includes a variety of precious stones, as well as jades and period pieces. From the pearl selections is a necklace of 20 strands of seed pearls, tightly strung and beautifully uniform. A turquoise clasp of a carved, openwork scene of a bird perched among a blossoming, fruit-bearing tree sits on a stacked silver mounting, ornately completing the piece (lot 119, $300-500).\nAlso available is a rather royal looking bracelet of four cultured pearl strands centered by a pearl cross formation. This formation is then encased by a diamond and emerald encrusted frame. Screw back earrings accompany the bracelet, each are two pearls of a decidedly lustrous quality and creamy hue. An almost structural diamond foliate design separates the pearls, making the total diamond weight for the suite approximately 2.00 carats (lot 021, $400-600). Providing an understated yet formal look is earring lot 020. Delicate platinum articulated drop mountings daintily hold both diamonds and sapphires, with each letting a substantial South Sea cultured pearl dangle from the ear ($600-800).\nA Victorian coral bracelet is a wonderful example of the handcraftsmanship of the era (lot 040, $700-900). The body of the bracelet is comprised of four strands of faceted coral beads, with each strand measuring approximately 5 inches in length. Upon close inspection, each hand-carved bead displays an organic quality, with slight variations in size and texture, while showcasing a desirable uniformity of vivid color. The bracelet’s clasp then depicts a coral cameo of a front-facing lady carved in high relief, framed and set in 14 karat yellow gold.\nThe 116 lot Asian category holds nine lots of silver element offerings, ranging from a low of $300 to a high of $2,000. Chinese pieces available at the auction include a silvered bronze mirror, a pair of decorative silver vases and a silver element figure of Bodhidharma. Of Japanese origin is a silver tea kettle as well as a silvered bronze mirror. A small silver Tibetan prayer wheel inlaid with turquoise and coral will also make an appearance, alongside Chinese export pieces such as a silver cuff also bearing turquoise and coral and a set of silver stem trays. However, a Chinese export silver footed bowl stands as this month’s highlight (lot 221, $1,200-1,800). The bowl is beautifully decorated upon the exterior with low relief renditions of iris flowers and cranes in flight. Perched rather high by branch-form feet, the base then displays another decorative scheme of applied silver Prunus blossoms. The effect is pleasingly fanciful and diverse in technique. The early 20th Century piece measures approximately 7 inches in width.\nThe fine art portion of the sale includes more than 90 lots of primarily European and American artworks. A variety of California artists will be presented at sale, as seen in names such as Laddie John Dill, Heinie Hardwig, Nicholas Firfires, Edward Borein, Ralph Holmes, Martin Weekly and Paul Lauritz.\nNovember’s highlight is found in yet another notable Californian, Loran Speck. The oil on canvas “Three Apples” captures the art of the still life (lot 259, $4,000-6,000). The effect lends to each depicted article an individuality and presence all its own, further enhanced by a level of fineness and high detail. His expert use of light and color give a nod to the classical style of the Old Masters, which has been cited as an influence on his work. A self-described “natural realist,” he was known to eschew the notion of perfection, keeping a realness and intimacy to his work. For instance, to express the notion of mortality, objects were given an imperfection, expressed in an overly ripe fruit, dried out stem and/or intentional spots of decay. Beloved for both his talent and graciousness, he was emphatically embraced by the Carmel art community during his career.\nA bibliognost will undoubtedly find the offering of “The Works of John Ruskin” to be a most collectible lot in November (lot 599, $7,000-9,000). The Renaissance man that Ruskin was is reflected in the complete 39 volume set, delving into a myriad of topics of refinement. Ruskin explored poetry, painters and architecture to name a few, with concentrations on, for example, early prose and Italian artists. The red, leather-bound, 1907 limited editions from a print of 2,062 remain in wonderful condition, stemming from the private estate of the Bekins family of Bekins Movers services. A family member of the consignor had lived in the same Hillsborough mansion for 82 years, where the books remained in their personal family library. This set was undoubtedly a highlight of their collection. It also served as a symbol of the resident’s father’s dedication to his own education, as he never attended college but nonetheless made it a priority to embrace academia.\nThe illustrated auction catalog will be posted online at http://www.michaans.com when it becomes available. Previews for the November Estate Auction will be held on Oct. 31, Nov. 1 and 6 as well as Nov. 7, the day of sale. For general information please call 510-740-0220 ext. 0 or email info@michaans.com. Michaan’s Auctions is located at 2751 Todd St., Alameda, CA 94501.\nAbout the company:\nMichaan’s Auctions is a leading full-service auction house on the West Coast. Specializing in the appraisals and sale of antiques and fine art, Michaan’s has specialists in the fields of furniture and decorative arts, modern, contemporary art, European and American paintings and prints, jewelry and Asian works of art.\nEstablished in 2002, Michaan’s Auctions holds up to 30 sales each year attracting a broad base of buyers and consignors from all over the world. With one of the largest facilities in Northern California and the Bay Area’s lowest buyer’s premium, Michaan’s offers buyers and sellers the opportunity to preview and bid on many unique and desirable properties. Some of these pieces realized world record prices. In 2005, A.D.M. Cooper’s oil painting, Three Graces 1915, sold for a record $21,060 and an Eduard Gaertner oil, German City Street Scene 1831 sold for $266,000.\nMichaan’s has built its reputation on its ability to accept single items, groups or entire estates with its “no risk consignment policy” free of hidden fees and charges. Michaan’s specialists are dedicated to staying current on the latest issues and developments in the market and are committed to providing personalized and professional attention throughout the entire auction process.\nFor a full listing of upcoming auctions or to view a complete catalog, please visit http://www.michaans.com .", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5taWNoYWFucy5jb20="], "published": "2015-10-21T03:00:00.000+03:00", "crawled": "2015-10-22T00:43:04.808+03:00", "highlightTitle": ""}