{"organizations": ["Horse & Stock Show", "Ron Morgan", "U Rodeo Company", "PRCA"], "uuid": "add682235622b41623b4eb1901e1daab770960c5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.artipot.com", "main_image": "", "site_section": "http://rss.artipot.com/category/1", "section_title": "Artipot: Arts and Entertainment Articles", "url": "http://www.artipot.com/articles/1943943/grand-national-rodeo-horse-and-stock-show.htm", "country": "US", "title": "Grand National Rodeo, Horse and Stock Show (Ron Morgan)", "performance_score": 0, "site": "artipot.com", "participants_count": 0, "title_full": "Grand National Rodeo, Horse and Stock Show (Ron Morgan)", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T10:03:00.000+03:00", "replies_count": 0, "uuid": "add682235622b41623b4eb1901e1daab770960c5"}, "author": "", "url": "http://www.artipot.com/articles/1943943/grand-national-rodeo-horse-and-stock-show.htm", "ord_in_thread": 0, "title": "Grand National Rodeo, Horse and Stock Show (Ron Morgan)", "locations": ["California", "San Francisco", "West"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Cotton Rosser", "Ron Morgan"], "text": "By Ron Morgan Oct 15, 2015 The essence of the old west is still buzzing in San Francisco, California. The Grand National Rodeo, Horse & Stock Show 2015 continue its western practice with the PRCA Rodeo exclusively at Cow Palace for 2 action packed exclusive weekends. For more than 60+ years the Grand National Rodeo, Horse Show and Livestock Show has been the West's most admired and respected western lifestyle episode that lures thousands of contestants and supporters from 7 western states. The exhibitors and participants have clustered year after year for the much sought-after Grand National Champion awards. The spectators are back to see the best livestock, cowgirls & cowboys the west has to offer. Contact a cab service to book a cab for the transportation.The Grand National Horse Show is one of the most awaited indoor equestrian events in the west. The AQHA Show will run from Friday, 16th October 2015 through Saturday till 24th October. Livestock Show exhibitors will be arriving in their best stock contending for top prize money and the holy grail, the tribute of showing a Grand National Champion. The Cow Palace will again respect the California Livestock Person of the Year at the Cattleman's Day celebration. You are invited to reach timely and stay late at the Grand National Western Experience, where you can enjoy at the marketplace, relish some award winning Bar-be-que & enjoy at the Cow Palace Saloon after & before every PRCA rodeo show.* Cotton Rosser and the Flying U Rodeo Company will bring to the audience his top stock for the more than 600 professional cowboys contending in 7 rodeo events for battle points. Well, to gather more information on Grand Horse Show you can also search the web.* The Junior and Open Livestock Shows will take place from 15th of October to 18th of October 2015. The participants will strive for top prize money and the admiration of showing a Grand National Champion.* You will surprised to know that the AQHA Show will basically held in combination with Rodeo on 18th October 2015 & the best cow horses will actually contest in NHCRA Bridle Horse Classic. Call to arrange for a taxi cab San Francisco to transport you to the show location.The tickets are available for sale. Get your friends, relatives or colleagues along with you to enjoy the grand event to the fullest. You can purchase the tickets for the show at http://www.ticketmaster.com/artist/803824. For any queries, you can give us a call at 415.404.4100 or drop us an email at info@grandnationalrodeo.com.The largest event does not deserve a miss. You will be delighted to watch the mesmerizing events taking place one after the other. It will, moreover be a wonderful experience for your kids. Call a cab company to book a cab SF to take your family to the show this October. We know that you can easily follow the action from home but it is a totally different experience to appreciate the drama disclose before your own eyes. About the Author Ron Morgan is the market representative for Luxor Cab . Luxor Cab is part of the San Francisco community for taxi cab service. Luxor's fleet contains the largest number of wheelchair accessible ramp taxis of any SF taxi fleet. Luxor cab can also be used for delivery of packages. Rating:", "external_links": [], "published": "2015-10-15T10:03:00.000+03:00", "crawled": "2015-10-15T12:10:14.147+03:00", "highlightTitle": ""}