{"organizations": [], "uuid": "3643246a7079f8adc85ee2cfc4b2621494bf2bd7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "empowerednews.net", "main_image": "http://empowerednews.net/wp-content/uploads/2015/10/Emilia-Clarke.jpg", "site_section": "http://empowerednews.net/category/entertainment/feed/", "section_title": "Empowered News » Entertainment", "url": "http://empowerednews.net/emilia-clarke-is-the-sexiest-woman-alive/1856904/", "country": "US", "title": "Emilia Clarke Is The Sexiest Woman Alive", "performance_score": 0, "site": "empowerednews.net", "participants_count": 1, "title_full": "Emilia Clarke Is The Sexiest Woman Alive", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T18:45:00.000+03:00", "replies_count": 0, "uuid": "3643246a7079f8adc85ee2cfc4b2621494bf2bd7"}, "author": "Kade Quinn", "url": "http://empowerednews.net/emilia-clarke-is-the-sexiest-woman-alive/1856904/", "ord_in_thread": 0, "title": "Emilia Clarke Is The Sexiest Woman Alive", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Press Releases Emilia Clarke Is The Sexiest Woman Alive \nEsquire named Emilia Clarke the “ Sexiest Woman Alive ” on Tuesday. The Game of Thrones actress joins an exclusive list of celebrities that includes Penelope Cruz and Scarlett Johansson. GQ also named Clarke the “ Woman of the Year ” last month. \nThe magazine said the 28-year-old actress combines numerous opposites and make them natural: toughness and sweetness, emotionalism and a cold-blooded determination. Her sex appeal is highlighted by these contrasts and she can take the role of a queen, kid sister, friend and dominatrix. \nEmilia Clarke is one of the breakout stars of the Game of Thrones of HBO. Her character on the Game of Thrones, Daenerys or \"Khaleesi,\" is a fan-favorite and became the inspiration of a number of baby names. She is set to star on Terminator: Genisys as Sarah Connor together with Arnold Schwarzenegger and Jai Courtney. \nClarke said in July she is happy to take on the mantle of Sarah Connor on the Terminator. She added that it feels great to be a young girl with the opportunity to take on the roles of strong and powerful women. \nThe actress talked about her audition for Game of Thrones on the feature article on Esquire. She said her agent told the casting director that the breakdown for the character was a tall, willowy blonde and she was short, round and brown. But, her agent asked the director to see her. Clarke said she did not know anything about two scenes in the audition and she was not able to read all the books. So, she searched Wikipedia for the story. \nShe said they wanted an actress who can grow within the season, who can gather strength while displaying vulnerability. The latest title of Emilia Clarke simply adds to the long list of titles she has for her Games of Thrones character. \n\n— Esquire Magazine (@esquire) October 13, 2015 Share:", "external_links": [], "published": "2015-10-15T18:45:00.000+03:00", "crawled": "2015-10-15T20:50:30.684+03:00", "highlightTitle": ""}