{"organizations": ["Chicago Cubs Online", "Watch Pittsburgh Pirates", "MLB NL", "Christian Post", "Chicago Cubs Online MLB NL"], "uuid": "ba434e47c81cc338dbd8ee26ed468ebe05d1dcc5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.christianpost.com", "main_image": "http://images.christianpost.com/full/88586/pittsburgh-pirates.jpg", "site_section": "http://www.christianpost.com/services/rss/feed/entertainment/", "section_title": "The Christian Post Entertainment", "url": "http://www.christianpost.com/news/mlb-nl-wild-card-game-2015-live-stream-how-to-watch-pittsburgh-pirates-vs-chicago-cubs-online-147119/", "country": "US", "title": "MLB NL Wild Card Game 2015 Live Stream (Start Time): How to Watch Pittsburgh Pirates vs Chicago Cubs Online", "performance_score": 0, "site": "christianpost.com", "participants_count": 0, "title_full": "MLB NL Wild Card Game 2015 Live Stream (Start Time): How to Watch Pittsburgh Pirates vs Chicago Cubs Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T01:21:00.000+03:00", "replies_count": 0, "uuid": "ba434e47c81cc338dbd8ee26ed468ebe05d1dcc5"}, "author": "", "url": "http://www.christianpost.com/news/mlb-nl-wild-card-game-2015-live-stream-how-to-watch-pittsburgh-pirates-vs-chicago-cubs-online-147119/", "ord_in_thread": 0, "title": "MLB NL Wild Card Game 2015 Live Stream (Start Time): How to Watch Pittsburgh Pirates vs Chicago Cubs Online", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jim Gardner"], "text": "MLB NL Wild Card Game 2015 Live Stream (Start Time): How to Watch Pittsburgh Pirates vs Chicago Cubs Online 0 By Jim Gardner , Christian Post Contributor October 7, 2015 | 6:21 pm \nThe MLB Playoffs 2015 have commenced and Wednesday will see the NL Wild Card game take place in a contest between the Pittsburgh Pirates and the Chicago Cubs. Today's game is sure to be a tense affair, but the whoever holds their nerve will progress to face the St Louis Cardinals in a five game series for the NLDS. \nThe Cubs and Pirates face off from 8 p.m. ET at PNC Park in Pittsburgh. Full coverage of the game will be shown on TBS, and the game can also be watched online through live stream (details below). (Reuters) The Pittsburgh Pirates can be seen in this file photo. \nChicago will be sending star pitcher Jake Arrieta to the mound as their starter, in the hope that he can help them progress to meet the Cardinals in a postseason series for the first time ever. \nArrieta finished the season with a 22-6 record, with a 1.77 ERA and 236 SO's. His 22 wins was enough to top the MLB for games won by a pitcher, and his tally included a no-hitter against the LA Dodgers in August. \nArrieta is an excellent pick for this road winner takes all game, and through the season he has only lost one road game when starting, winning 13 others. On the road he posted a hugely impressive 1.60 ERA, and had a 0.75 ERA against the Pirates specifically. \nMeanwhile, Gerrit Cole will be starting for the Pirates. The young right-hander is in only his second full MLB season, but manager Clint Hurdle claims that choosing Cole for today's crunch much-win game was an \"easy call.\" Cole's season record was 19-8, with a 2.60 ERA and 202 SO's. \nToday's NLWC 2015 game between the Pittsburgh Pirates and the Chicago Cubs has a start time of 8 p.m. ET, and can be watched on TBS. Various radio stations will be covering the game live, including Cubs Radio Network, WBBM 780, ESPN Radio, and KDKA-FM 93.7. The game can also be watched online by clicking here .", "external_links": [], "published": "2015-10-08T01:21:00.000+03:00", "crawled": "2015-10-08T01:50:15.489+03:00", "highlightTitle": ""}