{"organizations": [], "uuid": "59f38e53c6b6c160b40dedb209a2b63a9a8da38a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.baltimoresun.com", "main_image": "http://www.trbimg.com/img-560c5c01/turbine/bal-vibrant-national-tour-of-kinky-boots-reaches-baltimore-20150930", "site_section": "http://www.baltimoresun.com/entertainment/rss2.0.xml#", "section_title": "Entertainment - Baltimore Sun", "url": "http://www.baltimoresun.com/entertainment/arts/artsmash/bal-vibrant-national-tour-of-kinky-boots-reaches-baltimore-20150930-story.html", "country": "US", "title": "'Kinky Boots' provides a lift at the Hippodrome", "performance_score": 0, "site": "baltimoresun.com", "participants_count": 1, "title_full": "'Kinky Boots' provides a lift at the Hippodrome", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T18:54:00.000+03:00", "replies_count": 0, "uuid": "59f38e53c6b6c160b40dedb209a2b63a9a8da38a"}, "author": "Tim Smith", "url": "http://www.baltimoresun.com/entertainment/arts/artsmash/bal-vibrant-national-tour-of-kinky-boots-reaches-baltimore-20150930-story.html", "ord_in_thread": 0, "title": "'Kinky Boots' provides a lift at the Hippodrome", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Tim Smith) \nSuch thoughts are kicked away easily enough, though, by the sight of Jerry Mitchell's exuberant choreography and the sounds of yet another rousing number by Cyndi Lauper, whose first Broadway score is more ear-catching than some turned out in recent years by veterans of the genre. \nFor the most part, she delivers the melodic goods, nowhere more tellingly than in \"Charlie's Soliloquy,\" sung by the conflicted factory owner to a tune distantly related to Lauper's vintage hit \"Time After Time.\" And \"The History of Wrong Guys,\" a solo for Lauren, the factory worker who falls for Charlie, is a comic showpiece in the best Broadway tradition. \nAs for Lauper's lyrics, well, it does seem a wee bit lazy to build an Act 1 finale largely out of \"yeah, yeah.\" And it's hard to overlook the clunkiness of trying to rhyme \"hubris\" and \"chooses\"— or of using \"hubris\" at all in a song. But, more often than not, the words get the job done as neatly as the music. \n\"Kinky Boots\" couldn't have much more persuasive advocates than those in the touring cast. As witty and wise Lola, Kyle Taylor Parker proves every bit as satisfying as originator Billy Porter, right down to the Eartha Kitt-on-steroids purring. It's worth catching the show just to hear Parker say, with profound and hilarious contempt, the word \"burgundy\" (the first color choice for a boot presented to him at the factory). He's also a sturdy, warmly expressive singer. \nSteven Booth deftly conveys Charlie's journey from ambivalence to confidence, reaching a peak in the angry outbursts of Act 2. The actor handles humorous bits with equal flair. His voice is a little too light for the more driving rock songs in the score, but his phrasing invariably rings true. \nAmong the supporting players, Lindsay Nicole Chambers stands out as Lauren, offering a funny array of vocal inflections. She even manages to make some of the most cliched lines in the script sound natural. As Don, the bully who gets his comeuppance, Joe Coots hits the spot. And the gang of Angels, Lola's fellow drag performers, could not be much more assured or stylish. Likewise, the ensemble of factory workers couldn't look more true-to-life. \nDavid Rockwell's large, richly evocative scenic design and Gregg Barnes' spot-on costumes complete the appeal of this well-polished production. \n\"Kinky Boots\" runs through Oct. 4 at the Hippodrome Theatre, 12 N. Eutaw St. Call 800-982-2787, or go to baltimorehippodrome.com . \ntim.smith@baltsun.com", "external_links": [], "published": "2015-09-30T18:54:00.000+03:00", "crawled": "2015-10-01T18:08:56.981+03:00", "highlightTitle": ""}