{"organizations": [], "uuid": "3349b1c98080872ce4fc67525e94d4d4c63722b8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-5629637d/turbine/ct-crime-procedural-csi-svu-20151022", "site_section": "http://www.chicagotribune.com/", "section_title": "Chicago Tribune: Chicago breaking news, sports, business, entertainment, weather and traffic - Chicago Tribune", "url": "http://www.chicagotribune.com/entertainment/tv/ct-crime-procedural-csi-svu-20151022-story.html", "country": "US", "title": "Why &apos;Law & Order&apos; makes its fans smarter about crime - and &apos;CSI&apos; makes them dumber", "performance_score": 0, "site": "chicagotribune.com", "participants_count": 1, "title_full": "Why &apos;Law & Order&apos; makes its fans smarter about crime - and &apos;CSI&apos; makes them dumber - Chicago Tribune", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T05:00:00.000+03:00", "replies_count": 0, "uuid": "3349b1c98080872ce4fc67525e94d4d4c63722b8"}, "author": "Jessica Contrera", "url": "http://www.chicagotribune.com/entertainment/tv/ct-crime-procedural-csi-svu-20151022-story.html", "ord_in_thread": 0, "title": "Why &apos;Law & Order&apos; makes its fans smarter about crime - and &apos;CSI&apos; makes them dumber", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The most familiar female cop on television is staring into the eyes of yet another rape victim. She looks like the victim of a violent street abduction - bruised, swollen and scratched. Olivia Benson speaks calmly, her voice full of practiced concern.\n\"This man, can you describe him?\"\nThe victim takes a breath. \"Yes,\" she says. \"Yes, I know him.\"\nOlivia, as played by Mariska Hargitay, doesn't look surprised.\nIn this week's episode, as in nearly all its 372 episodes to date, \"Law & Order: Special Victims Unit\" presents a relatively nuanced portrait of sexual assault - one that a new study shows could actually be changing our society's views of sex crimes.\nResearchers at Washington State University who study the way the media influences the public have long been curious about crime procedural dramas, which have proliferated to the extent that kinky serial killers are as commonplace on the airwaves as wacky sitcom neighbors. Lead researcher Stacey J.T. Hust wondered: Do these shows make us more intelligent about crime, or more indifferent to it?\nHust and her team sent out a survey to WSU's dorm-dwelling freshmen, seeking data on which crime shows they watch. They also asked them their views of sexual assault, such as what they believe it means for a person to consent to sex and whether they think some victims \"ask for it.\"\nUnsurprisingly, the most popular crime shows among those surveyed were the long-running hit franchises \"Law & Order,\" \"CSI\" and \"NCIS.\" But after controlling for factors like gender and whether the respondents had experience with sexual assault, the researchers found only the \"Law & Order\" dramas had a positive effect on the students' views. \"NCIS\" had a mostly neutral effect, while \"CSI's\" was actually negative.\nStudents who watch \"Law & Order\" were less likely to buy into rape myths, more likely to adhere to their partner's decision about whether or not to have sex, and more likely to say no themselves to sexual activity they did not want, the researchers concluded.\n\"We can't say that watching 'Law & Order' causes this,\" Hust clarified, \"but we know there is a definite association there.\"\nHer hypothesis: \"Law & Order\" victims don't cleave to stereotypes: They're not necessarily alone or in an unsafe place or dressed \"provocatively\" when attacked. The attackers are of all races, ages and socioeconomic statuses. Even when the victim is a sex worker or porn star, the stories assert that he or she had every right to refuse sex. And at the end of each episode, the criminal is almost always found guilty.\n\"According to social cognitive theory, seeing them punished for that action will likely make the viewer think, 'I don't want to do that. I don't want that punishment,' \" Hust said.\nThe habitually violent show is not without its critics, who argue its ripped-from-the-headlines plots veer toward seamy sensationalism. The season 15 story arc in which Olivia was kidnapped and tortured was singled out in some quarters as especially exploitative.\nBut accurately portraying the complications of sex crimes in the justice system is an ongoing concern at NBC, where \"SVU\" executive producer and showrunner Warren Leight is tasked with making entertainment out of real-life scenarios, such as Rolling Stone's publication of false sexual assault claims.\n\"What makes SVU harder for detectives is it's the only crime where the victim has to prove they didn't want the crime to happen,\" Leight said. \"No one says, 'Are you sure you didn't want to get your TV stolen?' \"\nMeanwhile, the study found that people who watch \"CSI\" showed less inclination to seek consent or refuse unwanted sexual activity. Hust blames episodes like the ones in which a woman who leaves her windows unlocked is raped and murdered and another is attacked after accepting a tainted drink from a stranger - reinforcing stereotypes of victims who are to blame for their own assault.\n\"SVU,\" though, frequently explores the gray areas that underlie real-life sexual assaults. On an upcoming episode, a teenage girl willingly accompanies a boy to a dark, loud basement party. She says he raped her, while he feels that the act was consensual.\n\"I don't think either of them is lying,\" Leight said. \"His character is not a player or a predator. He was just so unaware of her he didn't notice she wasn't into it.\"\nThat episode drew on consultations with a defense attorney and a lawyer who advocates for rape victims, along with the former sex-crimes prosecutor and investigator who read every script.\n\"They said very often, it's the kids less able to assert and articulate themselves who find themselves in these situations, because they don't want to upset the guy,\" Leight said. \"They might text him back the next day, for example, and that looks terrible in court. On the stand, that's the kind of person who is more likely to be victimized. But then, are we blaming the victim? It's tricky turf.\"\nHargitay, meanwhile, has parlayed her role as a tough-but-compassionate SVU detective into advocacy for victims of sexual assault and domestic violence. Her Joyful Heart Foundation often runs seminars for the show's writers, and she frequently weighs in storylines and dialogue.\n\"You have so much more responsibility as an actor or writer in this show,\" Leight said. \"If it was a zombie show, people would not come up to you and say 'My family was attacked by zombies once and that episode really meant a lot to me.' But people write, email, tweet to us and say very personal things. They will disclose assaults that happened to them years ago that they have buried, and say the episode made them realize something happened.\"\n Sexual Assault Washington State University Mariska Hargitay", "external_links": ["http://www.trbimg.com/img-5629637d/turbine/ct-crime-procedural-csi-svu-20151022"], "published": "2015-10-23T05:00:00.000+03:00", "crawled": "2015-10-23T09:32:10.390+03:00", "highlightTitle": ""}