{"organizations": [], "uuid": "2fb56141ecc96837a8b8394e3957156511b9b827", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-562807bb/turbine/ct-wtk-cubs-fan-memories-tl-1029-20151029", "site_section": "http://www.chicagotribune.com/", "section_title": "Chicago Tribune: Chicago breaking news, sports, business, entertainment, weather and traffic - Chicago Tribune", "url": "http://www.chicagotribune.com/suburbs/evanston/news/ct-wtk-cubs-fan-memories-tl-1029-20151029-story.html", "country": "US", "title": "Northfield man recalls watching Cubs in game 7 of 1945 World Series - Evanston Review", "performance_score": 0, "site": "chicagotribune.com", "participants_count": 1, "title_full": "Northfield man recalls watching Cubs in game 7 of 1945 World Series - Evanston Review", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T10:00:00.000+03:00", "replies_count": 0, "uuid": "2fb56141ecc96837a8b8394e3957156511b9b827"}, "author": "Daniel I. Dorfman", "url": "http://www.chicagotribune.com/suburbs/evanston/news/ct-wtk-cubs-fan-memories-tl-1029-20151029-story.html", "ord_in_thread": 0, "title": "Northfield man recalls watching Cubs in game 7 of 1945 World Series - Evanston Review", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "In this digital day and age, researching the last World Series game the Cubs every played in is hardly a complex initiative. While box scores and play-by-play sheets provide the hard facts of that October afternoon, getting a firsthand account is almost impossible.\nUnless you know Northfield resident Dave Carlson.\nWhile he does not have memorabilia from that game, played on Oct. 10, 1945, Carlson talks reverentially about the game where he says he sat in the lower deck.\nCarlson was 16 at the time, attending Evanston Township High School, when he took the \"El\" from his Evanston home to attend game 7 of the World Series.\nWhile World War II hostilities had concluded earlier that year, major league rosters were still decimated as many top players had engaged in fighting overseas. But Carlson said the Cubs still fielded a very good team, highlighted by players such as Andy Pafko and Phil Cavarretta.\nOn the other side, the Tigers were led by future Hall of Famer Hank Greenberg, who had rejoined the team after his military service.\nThe first three games of the series were played in Detroit and the Cubs came back to Chicago up 2-1 in the series, giving fans hope a 37-year World Series drought would conclude.\nNaperville man's Cubs' fandom cuts deep in his yard Suzanne Baker A Naperville man wasn't going to let shoulder surgery keep him away from his tradition of carving a Chicago Cubs logo into his backyard lawn any time the team is in the playoffs.\nA lifelong Cubs fan, Robert \"Rudy\" Radasevich used no extra tools other than his Toro push gas mower to cut his lush,...\nA Naperville man wasn't going to let shoulder surgery keep him away from his tradition of carving a Chicago Cubs logo into his backyard lawn any time the team is in the playoffs.\nA lifelong Cubs fan, Robert \"Rudy\" Radasevich used no extra tools other than his Toro push gas mower to cut his lush,...\n(Suzanne Baker) Instead, the Tigers defeated the Cubs 4-1 in Game 4 and 8-4 in Game 5, which Carlson said he also attended.\nAfter blowing a 7-3 lead in Game 6, allowing four runs in the eighth inning, the Cubs pulled out Game 6 8-7 in 12 innings, setting the stage for the decisive game.\nCarlson took the El from his Evanston home for the afternoon start. He got the $13 ticket from his brother, who he said had political connections.\n\"My recollection was I was excited,\" he said about what he felt when he entered the ballpark.\nBut that excitement was short lived.\nUnlike the Cubs collapses in 1984 and 2003, which were of the late-inning variety, Game 7 was over essentially in the first inning.\nManager Charlie Grimm elected to bring back pitcher Hank Borowy, who had gone 11-2 for the Cubs since being acquired by the Yankees midseason, as the starter despite pitching four innings two days prior in Game 6. Borowy could not get anyone out and was removed by Grimm after only three hitters.\nMets' David Wright on Cubs: 'These guys can win the next three very easily' Fred Mitchell The champagne, no doubt, is on ice for the Mets to celebrate in the cramped visitors’ locker room at Wrigley Field if they win on Wednesday night.\nBut Mets players insist their focus is solely on the Cubs in Game 4 of the NLCS, and not on the World Series.\n“We understand just like we've won the...\nThe champagne, no doubt, is on ice for the Mets to celebrate in the cramped visitors’ locker room at Wrigley Field if they win on Wednesday night.\nBut Mets players insist their focus is solely on the Cubs in Game 4 of the NLCS, and not on the World Series.\n“We understand just like we've won the...\n(Fred Mitchell) \"There was a lot of intense second guessing going on,\" Carlson recalled.\nYet the game was still only 2-0 in the top of the first inning with two out. But then catcher Paul Richards, a lifetime .227 hitter, doubled down the left field line off reliever Paul Derringer to clear the bases to give the Tigers what turned out to be an insurmountable 5-0 lead.\n\"He hits a line drive right over the third baseman's head down the left field line and three runs scored,\" Carlson added. \"It was heartbreak when that happened.\"\nThe Cubs scored once in the bottom of the first but could never get closer than four the rest of the day and the Tigers cruised to a 9-3 victory. Seventy years later, the Cubs have yet to play in another World Series game.\n\"I was just very disappointed after the first inning,\" Carlson said. \"I don't remember them ever making a rally to get back in the game.\"\nNot surprisingly, Carlson said he was down leaving the ballpark that day and it took him about a week or two to get over it.\nThis was also the series where the purported \"Curse of the Billy Goat\" occurred. But Carlson does not believe in that.\n\"It's more of a media thing as far as I am concerned,\" he said.\nAs for Carlson, he says he served in the U.S. Air Force and eventually became an entrepreneur in the fuel business, married his wife, Lynn, of 63 years and lived in the same Northfield home for most of that time. Along the way, there were six children, 10 grandchildren and now one great-grandchild.\nWhen the family gets together, even at 86, Carlson is able to keep up with them talking baseball history. The younger generation might rely on a laptop, tablet or phone, but Carlson has his own personal recall as he says he does with every pitch.\n\"It's amazing at 86 that he remembers all the stuff,\" Lynn Carlson said. \"The kids are amazed at that too. They always give him baseball quizzes and they are surprised he can always answer.\"\nFor years, he would attend 10-15 games per season at Wrigley Field. That ended about four years ago as it became too difficult to navigate for someone who was the recipient of a kidney from his son, but every night during the season the sounds of the Carlson home are filled with baseball.\nCarlson, 86, acknowledges he has seen a lot of bad baseball through the years, but he has been thrilled with what he has seen from the youngsters named Rizzo, Bryant, Russell et al, plus manager Joe Maddon during this season's 97-win campaign.\n\"I'm just impressed with how good those young guys are,\" Carlson said. \"At first, I was skeptical of Maddon, but he knows how to handle young people and keep them loose as best he can.\"\nHe thought the World Series drought might be coming to an end after the Cubs defeated the Cardinals in the National League Division Series, but the New York Mets have imposed other ideas on Cubs fans, taking a 3-0 series lead.\n\"That guy Murphy has just been a killer,\" Carlson said about New York's Daniel Murphy, who has homered in all three games.\nHe also laments the Chicago offense, effectively stymied by the New York starters to start the series.\n\"I know how important it is to get that first man and they haven't been able to do that against the Mets,\" he added.\nEven if the season does not see the Cubs in the World Series, Carlson is very optimistic about the future for the team that he is likely one of the very few to have seen play in the World Series in person.\n\"It's been a phenomenal year,\" he said. \"The future is bright.\"\nDaniel I. Dorfman is a freelance reporter for Pioneer Press.\n Major League Baseball Baseball Chicago Cubs World Series Detroit Tigers Joe Maddon New York Mets", "external_links": ["http://www.trbimg.com/img-56279abd/turbine/ct-cubs-mets-game-4-wrigley-20151021", "http://www.trbimg.com/img-562807bb/turbine/ct-wtk-cubs-fan-memories-tl-1029-20151029", "http://www.trbimg.com/img-56219a21/turbine/ct-nvs-cubs-naperville-mow-logo-st-1016-20151016"], "published": "2015-10-22T10:00:00.000+03:00", "crawled": "2015-10-22T02:17:26.924+03:00", "highlightTitle": ""}