{"organizations": [], "uuid": "e032bc6cfeb8c19dfc16103dd7eae2e674fa798f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://images.canberratimes.com.au/2015/10/23/6953203/Thumbnail1001825092gkgl67image.related.thumbnail.320x214.gkgl6s.png1445559841099.jpg.jpg", "site_section": "http://feeds.canberratimes.com.au/rssheadlines/entertainment.xml#", "section_title": "Canberra Times Entertainment Headlines", "url": "http://www.canberratimes.com.au/entertainment/stage/wharf-revue-review-celebrating-15-years-has-warm-and-fuzzies-in-abundance-20151023-gkgl6s.html", "country": "AU", "title": "Wharf Revue review: Celebrating 15 Years has warm and fuzzies in abundance", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "Wharf Revue review: Celebrating 15 Years has warm and fuzzies in abundance", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T03:25:00.000+03:00", "replies_count": 0, "uuid": "e032bc6cfeb8c19dfc16103dd7eae2e674fa798f"}, "author": "Reviewed by Jason Blake", "url": "http://www.canberratimes.com.au/entertainment/stage/wharf-revue-review-celebrating-15-years-has-warm-and-fuzzies-in-abundance-20151023-gkgl6s.html", "ord_in_thread": 0, "title": "Wharf Revue review: Celebrating 15 Years has warm and fuzzies in abundance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathan Biggins, Amanda Bishop, Phillip Scott and Drew Forsythe in Sydney Theatre Company's Wharf Revue. Photo: Brett Boardman \nThe Wharf Revue: Celebrating 15 Years \nSydney Theatre Company Wharf 1, October 22.  \n★★★\nSketches old and new: Drew Forsythe. Photo: Brett Boardman \nThe laurels heaped on the Wharf Revue over the years are deep and leafy. Why wouldn't you settle into them for a while? Fifteen years at the coalface of satirical comedy is, after all, no joke.\nAdvertisement This year's edition of the Wharf Revue sees the team – Jonathan Biggins, Amanda Bishop, Drew Forsythe and Phil Scott – in retrospective mood. As a result, the gallery of ex-Prime Ministers and cabinet heavyweights is even more expansive than usual, with Hawke, Keating, Howard, Rudd, Gillard, Abbott and Turnbull popping up in sketches old and new.\nHoward's Bunker , riffing on the German film Downfall , dates back to 2007's Beware of the Dogma . Even now its references to the Howards' sex life still makes your toes curl. The Latham Diaries , in which Biggins and Scott turn lines from the ex-Labor leader's memoirs into a Benjamin Britten-like modern opera, is older still, dating back to 2005's Stuff All Happens . Its brilliance is undimmed.\nThe same can be said for Rudd Never Dies , the Phantom-spoofing highlight of 2011's Debt Defying Acts , and of Forsythe's technically brilliant mash-up of two Irish Joyces (novelist James and Qantas honcho Alan) from 2012 Red Wharf .\nWarm and fuzzies in abundance, then.\nBut what about the new stuff and how does it fare in a show so heavily stacked with golden oldies?\nSometimes not so well. Forsythe's Chrissie Pyne Rap is unappealing and his unveiling of the Wharf Revue's Malcolm Turnbull only showed us that, as yet, the freshly installed PM's carapace is proving too smooth and hard for the team to gets its claws into. That will be rectified in next year's show, no doubt.\nOn the upside, a nimble \"Who's On First\"-style skit between a confused Clive Palmer and PUP Senator Dio Wang is excellent. So is Bishop's rendering of former New Zealand PM Helen Clarke as a torch-singing chanteuse backed by a band of Kiwi beatniks.\nBiggins's impersonation of Peter Costello is unnervingly acute and Bishop has ABC anchor Emma Alberici and columnist/foodie Annabel Crabb to a tee. Tony Abbott as Thernadier (singing Leader of the House ) in the night's extended sketch, Les Liberales , is inspired casting.\nCelebrating 15 Years feels like a breather and you have to say the team deserves it. Here's to next year and a show that's freshly ground.\nUntil December 23", "external_links": [], "published": "2015-10-23T03:25:00.000+03:00", "crawled": "2015-10-23T11:18:41.934+03:00", "highlightTitle": ""}