{"organizations": [], "uuid": "c648bb32f339940afa7cb56fa9ae2e953965a26e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prnewswire.com", "main_image": "http://content.prnewswire.com/designimages/logo-prn-01_PRN.gif", "site_section": "http://rss.prnewswire.com/industry/entertainment/", "section_title": "PR Newswire: Entertainment & Media", "url": "http://www.prnewswire.com/news-releases/global-non-small-cell-lung-cancer-partnering-2010-2015---reportlinker-review-300164155.html", "country": "IT", "title": "Global Non-Small Cell Lung Cancer Partnering 2010-2015 - Re", "performance_score": 0, "site": "prnewswire.com", "participants_count": 1, "title_full": "Global Non-Small Cell Lung Cancer Partnering 2010-2015 - Re", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T23:13:00.000+03:00", "replies_count": 0, "uuid": "c648bb32f339940afa7cb56fa9ae2e953965a26e"}, "author": "Reportlinker", "url": "http://www.prnewswire.com/news-releases/global-non-small-cell-lung-cancer-partnering-2010-2015---reportlinker-review-300164155.html", "ord_in_thread": 0, "title": "Global Non-Small Cell Lung Cancer Partnering 2010-2015 - Re", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK , Oct. 21, 2015 /PRNewswire/ -- The Non-Small Cell Lung Cancer Partnering 2010-2015 report provides understanding and access to the non-small cell lung cancer partnering deals and agreements entered into by the worlds leading healthcare companies. Trends in non-small cell lung cancer partnering deals\n\n\nTop non-small cell lung cancer deals by value\n\n\nDeals listed by company A-Z, industry sector, stage of development, technology type\n\n\nThe Non-Small Cell Lung Cancer Partnering 2010-2015 provides understanding and access to the non-small cell lung cancer partnering deals and agreements entered into by the worlds leading healthcare companies.\n\n\nThe report provides an analysis of non-small cell lung cancer partnering deals. The majority of deals are discovery or development stage whereby the licensee obtains a right or an option right to license the licensors non-small cell lung cancer technology. These deals tend to be multicomponent, starting with collaborative R&D, and commercialization of outcomes.\n\n\nUnderstanding the flexibility of a prospective partner's negotiated deals terms provides critical insight into the negotiation process in terms of what you can expect to achieve during the negotiation of terms. Whilst many smaller companies will be seeking details of the payments clauses, the devil is in the detail in terms of how payments are triggered – contract documents provide this insight where press releases do not.\n\n\nThis data driven report contains over 60 links to online copies of actual non-small cell lung cancer deals and contract documents as submitted to the Securities Exchange Commission by companies and their partners, where available. Contract documents provide the answers to numerous questions about a prospective partner's flexibility on a wide range of important issues, many of which will have a significant impact on each party's ability to derive value from the deal.\n\n\nThe initial chapters of this report provide an orientation of non-small cell lung cancer partnering trends.\n\n\nChapter 1 provides an introduction to the report, whilst chapter 2 provides an overview of the trends in partnering since 2010, including a summary of deals by industry sector, stage of development, deal type, and technology type.\n\n\nChapter 3 provides an overview of the average deal terms since 2010. The chapter includes deals with a stage of development announced by headline value, upfront value, milestone value and royalty rate. Numerous tables outline financial trends.\n\n\nChapter 4 provides an overview of the most active dealmakers, top dealmakers by value, active big pharma and big biotech dealmakers including contract documents where available.\n\n\nChapter 5 provides a comprehensive directory of partnering deals signed and announced since 2010. The chapter is organized by company A-Z, stage of development at signing, deal type (collaborative R&D, co-promotion, licensing etc), and technology type. Each deal title links via Weblink to an online version of the deal record, and where available the contract document, providing easy access to each contract document on demand.\n\n\nIn conclusion, this report provides everything a prospective dealmaker needs to know about partnering in the research, development and commercialization of non-small cell lung cancer technologies and products.\n\n\nReport scope\n\n\nNon-Small Cell Lung Cancer Partnering 2010-2015 is intended to provide the reader with an in-depth understanding and access to non-small cell lung cancer trends and structure of deals entered into by leading companies worldwide.\n\n\nThis data driven report includes:\n\n\nTrends in non-small cell lung cancer dealmaking in the biopharma industry since 2010\n\n\nAccess to summary headline, upfront, milestone and royalty data\n\n\nAccess to over 60 non-small cell lung cancer deals and contract documents where available\n\n\nThe leading non-small cell lung cancer deals by value since 2010\n\n\nIn Non-Small Cell Lung Cancer Partnering 2010-2015, the available deals are listed by:\n\n\nHeadline value\n\n\nUpfront payment value\n\n\nRoyalty rate value\n\n\nCompany A-Z\n\n\nIndustry sector\n\n\nStage of development at signing\n\n\nDeal component type\n\n\nTechnology type\n\n\nEach deal title links via Weblink to an online version of the deal record and where available, the contract document, providing easy access to each contract document on demand.Non-Small Cell Lung Cancer Partnering 2010-2015 provides the reader with the following key benefits:\n\n\nIn-depth understanding of non-small cell lungcancer deal trends since 2010\n\n\nAccess to summary headline, upfront, milestone and royalty data\n\n\nComprehensive access to over 60 actual non-small cell lungcancer deals entered into by the world's biopharma companies since 2010\n\n\nInsight into key deal terms included in contracts, where disclosed\n\n\nUnderstand the key deal terms companies have agreed in deals\n\n\nUndertake due diligence to assess suitability of your proposed deal terms for partner companies\n\nRead the full report: http://www.reportlinker.com/p03106576-summary/view-report.html \n\nAbout Reportlinker \nReportLinker is an award-winning market research solution. Reportlinker reviews, finds and organizes the latest industry data so you get all the market research you need - instantly, in one place.\n\nhttp://www.reportlinker.com", "external_links": [], "published": "2015-10-21T23:13:00.000+03:00", "crawled": "2015-10-21T23:23:05.838+03:00", "highlightTitle": ""}