{"organizations": [], "uuid": "54e5a3759e51990a681ead2ff6519de02b755f66", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mid-day.com", "main_image": "http://images.mid-day.com/images/2014/nov/23-Abhinay-Deo_l.jpg", "site_section": "http://www.mid-day.com/Resources/midday/rss/entertainment.xml#", "section_title": "entertainment", "url": "http://www.mid-day.com/articles/abhinay-deo-tabu-has-shown-interest-in24/16626202", "country": "IN", "title": "Abhinay Deo: Tabu has shown interest in '24'", "performance_score": 0, "site": "mid-day.com", "participants_count": 1, "title_full": "Abhinay Deo: Tabu has shown interest in '24' - Entertainment", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "54e5a3759e51990a681ead2ff6519de02b755f66"}, "author": "PTI", "url": "http://www.mid-day.com/articles/abhinay-deo-tabu-has-shown-interest-in24/16626202", "ord_in_thread": 0, "title": "Abhinay Deo: Tabu has shown interest in '24'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Versatile actress Tabu is likely to be a part of Anil Kapoor's much awaited second season of television show '24'.\n\nAbhinay Deo \nDirector Abhinay Deo will soon be back with espionage drama '24'. A lot of names are being speculated to feature in the show, including that of Tabu, Prachi Desai, Akshaye Khanna and Urmila Matondkar.\n\"The few names that we are talking to are Akshaye, Tabu, Prachi, but that is all yet to unfold. We haven't spoken to Urmila about the show, we don't know where that came from,\" Deo told PTI in an exclusive interview here.\n\"She (Tabu) would be outstanding. She is my favourite actress. We tried to get her for season one but that time there were other constraints. Let's see... There will be surprises (in casting),\" he said.\nDeo said the \"Chandni Bar\" actress has shown interest in the show '24'.\nWhen asked what feedback has Tabu given, he says, \"She would try to be part of the show. We are trying to work out different permutations and combinations between us. The doors are never closed, if not work this season then next season.\"\nAs Abhinay shoots at a stretch, he requires his actors to give him time accordingly.\n\"We want good actors doing good roles and give their best performance. Casting is a huge exercise and my job is to make sure actors get good roles,\" he said.\n\"We need clean dates straight. We shoot at a stretch for 12 hours a day and we shoot for six days so that is like 200 days of shooting straight. So we need that kind of commitment from actors,\" the director said.\nThe last season of the show featured noted actors like Anupam Kher and Shabana Azmi.\n\"Anupam sir can't come as he is dead (in the show). The character of Shabana Azmi can be a part of this season or next season, it depends on the script,\" Deo said.\nSince the first season of '24' got a positive response from the audience, Abhinay feels the pressure for the second season as the expectations would be high.\n\"Pressure is always there as every piece of work needs to be accepted and appreciated. But the idea is not to take the pressure and I try and follow it. The second season has double the pressure as people know what the first season was about,\" he said.\nAccording to the 'Delhi Belly' director, the most challenging part is setting the pace of the show.\n\"To set the right pace was important and it was the biggest challenge. It was a 24-hour story, it was real time story, we were trying to show various characters at the same time.\nThere were so many tracks that we were showing, the fear was that we might make it completely confusing for the audience,\" he said.\nAbhinay is elated with the way television is growing in terms of content.\n\"The face of television is changing... The change has begun. The change is audience... Audience is getting educated, they want better stuff on television than the same stuff.\nThere will always be audience for same stuff that is going on television,\" he said.\n\"With '24' we are getting into details, we are making the show grounded and simple. We are trying to make it simple so that audience understands it,\" he added", "external_links": [], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-22T07:52:48.281+03:00", "highlightTitle": ""}