{"organizations": [], "uuid": "8c02f6716abf25414615aa1f5353e6c054cdda0c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "http://www.youtube.com/watch?v=HtgCZMpdqow", "site_section": "http://bostonherald.com/entertainment", "section_title": "Entertainment | Boston Herald", "url": "http://bostonherald.com/entertainment/music/music_news/2015/10/with_beano_boyz_roxbury_music_producer_mike_bivins_launches", "country": "US", "title": "With Beano Boyz, Roxbury music producer Mike Bivins launches new R&B crew", "performance_score": 0, "site": "bostonherald.com", "participants_count": 1, "title_full": "With Beano Boyz, Roxbury music producer Mike Bivins launches new R&B crew | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "8c02f6716abf25414615aa1f5353e6c054cdda0c"}, "author": "Jed Gottlieb", "url": "http://bostonherald.com/entertainment/music/music_news/2015/10/with_beano_boyz_roxbury_music_producer_mike_bivins_launches", "ord_in_thread": 0, "title": "With Beano Boyz, Roxbury music producer Mike Bivins launches new R&B crew", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Nobody knows more about R&B crews than Mike Bivins.\nThe Roxbury native founded New Edition with Bobby Brown, Ralph Tresvant, Ricky Bell and Ronnie DeVoe. He spun off the hit-making side project Bell Biv DeVoe. He discovered, managed and produced Boyz II Men and Another Bad Creation.\nNow Bivins has returned to Roxbury to help the Beano Boyz Crew.\nThe first act signed to Biv’s SportyRich Enterprises, the Beano Boyz mix today’s Top 40 with old school swagger — their sample debut single “Supa Model” bounces­ from new jack swing to ’70s Motown to modern urban soul.\n“It’s been a four-year trip taking this dance crew, which I saw on MTV, and turning them into a legitimate R&B group,” Bivins said. “They came as dancers, but the radio won’t play dancers, so we had to bring in members that are really great singers. We had to take raw talent and turn it into something great.”\nThe Beano Boyz, who perform at the Greater Boston YMCA’s Dream Together fundraiser Wednesday at the Four Seasons Hotel, remind Bivins of his early days in New Edition. Pulled from Dorchester, Roxbury and surrounding neighborhoods, Donald Simmons, Darius Rutledge, Marquis Smitherman, Thornell Williams and Ralph Codio have a tough road between Boston and global conquest.\n“Everyone doesn’t make it,” Bivins said. “It just doesn’t happen. It’s talent and timing. There’s a smorgasbord of crap, and people’s attention is all over the place, on their phones, on their tablets. People don’t even know if they like an artist these days, maybe they only like a song.\n“But I’m not in any hurry with these guys,” he added. “I’m going to do this slow, one single at a time.”\nThe Beano Boyz take Bivins’ praise, and his mentorship, seriously.\n“He’s a legend, someone we look up to, that we’re fans of,” Simmons said. “Over four years, he’s helped build this group. When I came in, I wasn’t a dancer. I was a singer. We’ve had to interchange members, it’s not easy to change up five different personalities. But Bivins knew what we needed to be.”\nBivins hasn’t been the group’s only supporter. The team at the Roxbury YMCA helped the Beano Boyz from the beginning. The guys write and rehearse at the Y, hold listening sessions for youth members and have even recorded tracks in the building.\n“It’s a great facility and the people that work at the Y are great people,” Simmons said. “We use the Y four days a week to practice. It’s like our home base.”\nWith Bivins and the neighborhood behind them, the Beano Boyz Crew look to break big beyond our borders.\n“I’ll be calling in all my favors to get these guys going,” Bivins said. “First we’ll make sure all of Boston likes what they’re doing. And that’s happening, 94.5 got behind them and had them at their block party last month. We’re starting to get airplay. Then we move to New York, then to Philly and on.”", "external_links": [], "published": "2015-10-09T03:00:00.000+03:00", "crawled": "2015-10-09T18:22:21.820+03:00", "highlightTitle": ""}