{"organizations": [], "uuid": "77d3846527aef2afd90e6e68e594de9c23ab4652", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.brownsvilleherald.com", "main_image": "http://bloximages.newyork1.vip.townnews.com/brownsvilleherald.com/content/tncms/assets/v3/editorial/7/aa/7aa92fdc-e1af-5cd0-a5ab-a33929642bdf/562d4306d95bd.image.jpg", "site_section": "http://www.brownsvilleherald.com/search/?q=&t=article&l=25&d=&d1=&d2=&s=start_time&sd=desc&c[]=news/entertainment*&f=rss", "section_title": "Brownsville Herald - news/entertainment", "url": "http://www.brownsvilleherald.com/news/entertainment/music/article_2587ae9a-e296-5b4d-8644-9960c28a3713.html", "country": "US", "title": "Justin Bieber is the big winner at MTV EMAs with 5 awards", "performance_score": 0, "site": "brownsvilleherald.com", "participants_count": 1, "title_full": "Justin Bieber is the big winner at MTV EMAs with 5 awards", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T05:35:00.000+02:00", "replies_count": 0, "uuid": "77d3846527aef2afd90e6e68e594de9c23ab4652"}, "author": "COLLEEN BARRY", "url": "http://www.brownsvilleherald.com/news/entertainment/music/article_2587ae9a-e296-5b4d-8644-9960c28a3713.html", "ord_in_thread": 0, "title": "Justin Bieber is the big winner at MTV EMAs with 5 awards", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Antonio Calanni Justin Bieber is the big winner at MTV EMAs with 5 awards \nJustin Bieber arrives for the 2015 MTV European Music Awards in Milan, Italy, Sunday, Oct. 25, 2015. (AP Photo/Antonio Calanni) Luca Bruno Justin Bieber is the big winner at MTV EMAs with 5 awards \nRuby Rose releases fire at the start of the start of the MTV European Music Awards in Milan, Italy, Sunday, Oct. 25, 2015. (AP Photo/Luca Bruno) Antonio Calanni Justin Bieber is the big winner at MTV EMAs with 5 awards \nHost Ed Sheeran arrives for the 2015 MTV European Music Awards in Milan, Italy, Sunday, Oct. 25, 2015. (AP Photo/Antonio Calanni) Antonio Calanni Justin Bieber is the big winner at MTV EMAs with 5 awards \nHost Ed Sheeran arrives for the 2015 MTV European Music Awards in Milan, Italy, Sunday, Oct. 25, 2015. (AP Photo/Antonio Calanni) Antonio Calanni Justin Bieber is the big winner at MTV EMAs with 5 awards \nPharrell Williams, left, and Helen Lasichanh arrive for the 2015 MTV European Music Awards in Milan, Italy, Sunday, Oct. 25, 2015. (AP Photo/Antonio Calanni) Antonio Calanni Justin Bieber is the big winner at MTV EMAs with 5 awards \nPharrell Williams, left, and Helen Lasichanh arrive for the 2015 MTV European Music Awards in Milan, Italy, Sunday, Oct. 25, 2015. (AP Photo/Antonio Calanni) Antonio Calanni Justin Bieber is the big winner at MTV EMAs with 5 awards \nPharrell Williams, left, and Helen Lasichanh arrive for the 2015 MTV European Music Awards in Milan, Italy, Sunday, Oct. 25, 2015. (AP Photo/Antonio Calanni) Antonio Calanni Justin Bieber is the big winner at MTV EMAs with 5 awards \nItalian singer Marco Mengoni arrives for the 2015 MTV European Music Awards in Milan, Italy, Sunday, Oct. 25, 2015. (AP Photo/Antonio Calanni) Antonio Calanni Justin Bieber is the big winner at MTV EMAs with 5 awards \nMark Ronson and Josephine de la Baume arrive for the 2015 MTV European Music Awards in Milan, Italy, Sunday, Oct. 25, 2015. (AP Photo/Antonio Calanni) Antonio Calanni Justin Bieber is the big winner at MTV EMAs with 5 awards \nTori Kelly arrives for the 2015 MTV European Music Awards in Milan, Italy, Sunday, Oct. 25, 2015. (AP Photo/Antonio Calanni) Justin Bieber is the big winner at MTV EMAs with 5 awards Associated Press | \nMILAN (AP) — Pop singer Justin Bieber dominated the MTV EMAs with five European music awards Sunday night, including for best male performer, best collaboration and best look. \nBieber, who was up for six awards, performed his single \"What Do You Mean?\" for screaming fans — surely some of whom helped him win the best fans category — inside the Mediolanum Center in Italy's fashion capital of Milan. \n\"Make some noise!\" he exhorted the fans as he sang, as if they needed to be told. \nAs he picked up his award for best collaboration, Bieber said \"it's been a pretty good night.\" By the time he took the fifth award, for best look, wearing a boyish red ensemble, he just said \"Wow.\" \n\"I don't know what to say, I got these looks from my mamma,\" Bieber added. \nHe also won the worldwide act: North America category. \nHost Ed Sheeran had a busy night, keeping the show going with co-host Ruby Rose, performing with Rudimental on their hit \"Lay It On Me,\" and taking home two awards himself, for best live act and best world stage. \nTaylor Swift, who led all artists with nine nominations, took just one prize, best song, for \"Bad Blood,\" featuring Kendrick Lamar. Rihanna won best female performer while Nicki Minaj took best hip hop. One Direction won for best pop group, preventing Bieber from sweeping all the awards for which he was nominated. None of those acts were on hand to accept, and only Minaj sent along a video \"thank you.\" \nBest video went to Macklemore & Ryan Lewis, who opened the show with their award-winning song \"Downtown,\" with Eric Nally flying against a full moon backdrop. They thanked fans for supporting their music without the backing of a big label. \nPharrell Williams closed out the ceremony, singing a rousing rendition of his anthem \"Freedom\" with dancers in brightly colored swing skirts. As the broadcast wrapped up, cameras cut to the Piazza Duomo in Milan's center, where fans unfurled a huge \"Freedom\" banner to raise awareness about Europe's refugee crisis. \nNew Wave rockers Duran Duran were honored with the first-ever MTV video visionary award honoring music video pioneers. \n\"Their distinctive style has had an undeniable impact on music history,\" MTV said. \nThe awards ceremony travels to a different European city each year and winners are selected by fans across the continent. \n___ \nThis story corrects the name of the ceremony to the MTV EMAs.", "external_links": [], "published": "2015-10-26T05:35:00.000+02:00", "crawled": "2015-10-26T09:30:45.575+02:00", "highlightTitle": ""}