{"organizations": [], "uuid": "be882ec8666fb6f472fbc869111741d1bc6b83c5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266353/arts-entertainment-television", "section_title": "Arts &amp; Entertainment: Television - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30213307/capilia-by-hair-professional-to-host-womens-hair-loss-solutions-seminar", "country": "US", "title": "Capilia by Hair Professional To Host Women's Hair Loss Solutions Seminar", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Capilia by Hair Professional To Host Women's Hair Loss Solutions Seminar - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T12:02:00.000+03:00", "replies_count": 0, "uuid": "be882ec8666fb6f472fbc869111741d1bc6b83c5"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30213307/capilia-by-hair-professional-to-host-womens-hair-loss-solutions-seminar", "ord_in_thread": 0, "title": "Capilia by Hair Professional To Host Women's Hair Loss Solutions Seminar", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Guest speaker and women's hair loss specialist, Flora Fuentes to present at West Palms' first hair loss seminar for women November 2 from 6pm - 8pm.\nWest Palm Beach, FL (PRWEB) October 08, 2015\nCapilia by Hair Professionals in West Palm Beach, FL, will be hosting a Women’s Hair Loss Solutions Seminar on Monday, November 2, 2015 from 6pm- 8pm.\nWomen are invited to come learn about the causes and solutions for women’s hair loss. This event will address the newest options, technological advances and most recent FDA approval for treatment of women’s hair loss.\nMore than 30 million women in the US have noticeably thinning hair loss, yet it’s still a taboo subject. While 90% of baldness in men is caused by genetics, there are so many more factors that can impact women. Not knowing where to go or who to trust, many women withdraw socially and suffer in silence. Celebrities will talk about their hair extensions and fashion wigs, but few speak out about the real issues of hair loss.\n“This is why educational seminars are so important,” says Andrea Green, co-owner of Capilia by Hair Professionals, who has regularly featured articles in the “Ask the Expert” Health and Beauty Section of the Palm Beach Post. “Once the medical field has ruled out any underlying health issues that need treatment, there is little else they can offer these women. It takes years of training in this specialized field to understand the phases of hair growth, what causes hair loss and what the newest solutions are. All women attending our seminar will receive a free microscopic scalp and hair analysis which will help evaluate their individual situation.”\nThe guest speaker will be hair loss specialist Flora Fuentes from NYC, who has over twenty years’ experience in hair restoration and is also the U.S. representative for Cesare Ragazzi out of Italy.\nWell-known in Europe for their scientific research into hair and scalp disorders and effective treatments, Cesare Ragazzi Laboratories introduced their expansion into the US Market in 2014. Capilia by Hair Professionals in West Palm Beach, FL was one of the originally chosen hair loss studios in the US to team with CRL. Dan and Andrea Green, having over 50 years of combined experience in the field of hair replacement, have attended several national and international conferences this past spring and summer where the newest products and services for women’s hair loss were featured. “We are eager to share our information with women in the Palm Beach area.”\nThere is no charge to attend this Women’s Hair Loss Educational Seminar, which will be held on Monday, November 2nd, from 6 pm to 8 pm at Capilia by Hair Professionals, 5651 Corporate Way, Suite 2, West Palm Beach, FL. Refreshments and light hors d’oeuvres will be served, along with raffles for hair and beauty products. Space is limited, please call and RSVP to reserve your space or for further questions, call 561-640-0990 or visit http://www.hairprofessionals.com .\n //www.prweb.com/releases/2015/10/prweb13001252.htm\n ", "external_links": ["http://www.prweb.com/releases/2015/10/prweb13001252.htm"], "published": "2015-10-08T12:02:00.000+03:00", "crawled": "2015-10-08T11:47:48.190+03:00", "highlightTitle": ""}