{"organizations": [], "uuid": "de5d987bf63b307b5ae2ac788a10761d31132233", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://images.canberratimes.com.au/2015/10/09/6913810/Thumbnail1000957882gjy2teimage.related.thumbnail.320x214.gjy01m.png1444354094084.jpg.jpg", "site_section": "http://feeds.canberratimes.com.au/rssheadlines/entertainment.xml#", "section_title": "Canberra Times Entertainment Headlines", "url": "http://www.canberratimes.com.au/entertainment/music/blackeyed-susan-rob-snarskis-new-low-fidelity-album-keeps-it-real-20151001-gjy01m.html", "country": "AU", "title": "Blackeyed Susan Rob Snarski's new low fidelity album keeps it real", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "Blackeyed Susan Rob Snarski's new low fidelity album keeps it real", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T15:45:00.000+03:00", "replies_count": 0, "uuid": "de5d987bf63b307b5ae2ac788a10761d31132233"}, "author": "Michael Dwyer", "url": "http://www.canberratimes.com.au/entertainment/music/blackeyed-susan-rob-snarskis-new-low-fidelity-album-keeps-it-real-20151001-gjy01m.html", "ord_in_thread": 0, "title": "Blackeyed Susan Rob Snarski's new low fidelity album keeps it real", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Keeping it real: Rob Snarski. Photo: Andrew Watson \nSome songs were born to travel light.  Wichita Lineman  might be the best example. Picture him on that endless, empty highway. A lonely speck atop a towering telephone pole, receiver in his hand and seven short lines — yep, that's all — to make the world understand. \nSmall wonder that song cut through the AM static so clearly back in Rob Snarski​'s youth. He remembers in soft focus those golden summers in Karragullen, about an hour south-east of Perth: he and his brother picking fruit on the family property while the thin sound of his dad's radio drifted from the far side of the valley.\n\"I've no doubt it's somehow seeped into my psyche,\" he recently wrote for the music and lifestyle zine, whatsmyscene.com. \"Elvis, Roy Orbison, Neil Sedaka, Ricky Nelson, Connie Francis, '60s girl groups, Dusty Springfield, Ray Charles, Frank & Nancy Sinatra, Lee Hazelwood… It's all swirling madly about this coconut of mine like a well-shaken daiquiri.\"\nSipping coffee outside Readings bookstore in Carlton, where he's about to sing solo for an intimate Friday afternoon gathering, the Dandenongs-based singer has no trouble making the connection between those distant song lines and his new album, Low Fidelity .\nAdvertisement Subtitled Songs by Request Volume 1 , it's an album of cover versions recorded on his iPhone. Originally intended as bespoke gifts to fans who had crowd-funded his previous album, Wounded Bird , the collection has turned into a surprising statement about the power of song.\n \"The nature of how we listen to music these days has changed so dramatically and maybe that was part of the impetus for releasing Low Fidelity ,\" he says. \n\"I listen to music on my iPhone, I listen to it on the stereo, in the car a hell of a lot. Sometimes I pull out my turntable. So the actual sound is never consistent. It varies so much that you wonder, how pristine does the quality have to be?\"\nDavid Byrne spends some pages pondering that question in his book  How Music Works  (Canongate, 2012). Sure he hears the relative merits of vinyl and CD. He's suspicious about the sonic information missing from MP3s. But unlike Neil Young, say, he's not inclined to get militant about it.\n\"I can be moved to tears by a truly awful recording or a bad copy of a good recording,\" Byrne writes. \"Would I be moved even more if the quality were higher? I doubt it.\" \nSnarski says he can relate. He tells a story from his day job as a disability support worker, about driving one man home with golden hits radio, as usual, playing in the car.\n\"He's a gentle soul and sometimes a very quiet person; he barely says boo at times. In the five years I've supported him I'd never heard him sing before but today for some reason, just out of the blue, he sang along to two songs that came on the radio.\"\nOne was  Baby Love , the other was Mrs Robinson . \"Honestly, it was just beautiful,\" Snarski says. \"I could've quite easily burst into tears.\"\nThe story identifies the mystery bubbling beneath the seemingly random songs of  Low Fidelity . The beauty of Snarski's rich, velvet tenor isn't lightly dismissed, but from Wichita Lineman   to Tiny Dancer  to Wild Is the Wind , it's the secret emotional triangle between singer, song and listener that makes this album fly. \n\"You've got to remember that when I started this humble little project, there was no intention of releasing any of the songs,\" he says. \"I can kind of hear that in the way that they're delivered. It's very intimate. They're sung for one person, essentially.\"\nSnarski's producer, guitarist Shane O'Mara, had the odd amused reaction to the snoring dog or distant TV lurking in the recordings. His usual approach to overdubbing wasn't an option this time. Shades of reverb and the odd counterpoint were as much as the fragile demos could bear.\n\n\"There's lots of flaws in the recording but I felt it was a different way of approaching a record: something really minimal and beautiful,\" O'Mara says. He points out that Jeff Tweedy's new record has iPhone elements too. \"Everything is up for grabs these days.\"\nThe proof of this record's impact, he says, has been on the road, which they've approached as a suitably downscaled duo. \"People have been taken aback because it's so raw,\" O'Mara says. \"Rob's an incredible singer but it's all sort of casual; comfortable. People love that.\"\nThe Friday bookshop gig begins with a conversation with a small boy who insists that the singer isn't who he claims to be. The wild card is the moustache – \"more Merv Hughes\" than he intended, Snarski admits – but the unmistakable voice soon allays the lad's suspicions.\nThrough the tall book stacks and CD racks it glides – a bit like a radio across a valley. There's a story about Lou Reed's Satellite of Love . Jarvis Cocker's Babies  tells its own, albeit wrung into more heartbreaking shape. Merle Haggard's Turning Off a Memory  is \"classic country: clever, funny and sad,\" the singer notes with quiet admiration.\nIt's all over too soon and he steps down to chat and shake hands with the small crowd, some of whom he knows well. He recorded a request for one lady, as a part of that crowd-funding deal. Made her dinner too. \nSnarski's next record with his old band, the Blackeyed Susans, began to take shape in September in more traditional multi-tracked studio style. But with 12 long years since their last, one suspects the attitude he brings to it will be as different as the world that hears it.\n\"I think the expectation when you're young is that you're going to be the next Velvet Underground. Something similarly unrealistic. I guess I've got this analogy now that I'm not a sprinter, I'm like marathon man. I'm in it for the long run.\" He laughs. \"Maybe I'm more a walker.\"\nRob Snarski and Shane O'Mara play the Spotted Mallard on Oct 16 and the Flying Saucer Club on Oct 23.", "external_links": [], "published": "2015-10-09T15:45:00.000+03:00", "crawled": "2015-10-09T17:04:35.842+03:00", "highlightTitle": ""}