{"organizations": ["Parliament", "AP Photo/Matt Dunham"], "uuid": "6a8bc4e23ade992cc3351456b07258251d83c079", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wmcactionnews5.com", "main_image": "http://images.worldnow.com/AP/images/9055426_G.jpg", "site_section": "http://www.wmctv.com/category/13540/news?clienttype=rss", "section_title": "WMC Action News 5 - Entertainment - Headline", "url": "http://www.wmcactionnews5.com/story/30303008/uk-rolls-out-red-carpet-for-chinas-xi-on-contentious-visit", "country": "US", "title": "UK rolls out red carpet for China's Xi on contentious visit", "performance_score": 0, "site": "wmcactionnews5.com", "participants_count": 0, "title_full": "UK rolls out red carpet for China's Xi on contentious visit", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T06:53:00.000+03:00", "replies_count": 0, "uuid": "6a8bc4e23ade992cc3351456b07258251d83c079"}, "author": "", "url": "http://www.wmcactionnews5.com/story/30303008/uk-rolls-out-red-carpet-for-chinas-xi-on-contentious-visit", "ord_in_thread": 0, "title": "UK rolls out red carpet for China's Xi on contentious visit", "locations": ["Britain", "Heathrow Airport", "UK", "Britain Monda", "London", "China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jinping", "Peng Liyuan", "JILL", "Dunham", "Philip Hammond", "Xi Jinping"], "text": "Employment and Internship Opportunities UK rolls out red carpet for China's Xi on contentious visit (AP Photo/Matt Dunham). People pose for a group snapshot as they wait to see Chinese President Xi Jinping and his wife Peng Liyuan pass along the Mall, in London, Tuesday, Oct. 20, 2015. Chinese President Xi Jinping will address Britain's Parliament on... (Toby Melville/Pool photo via AP). Chinese President Xi Jinping sits with Britain's Foreign Secretary Philip Hammond (not pictured) after arriving at Heathrow Airport, London, Monday, Oct. 19, 2015. Chinese President Xi Jinping arrived in Britain Monda... (Toby Melville/Pool photo via AP). Chinese President Xi Jinping and his wife Peng Liyuan leave their plane as they arrive at Heathrow Airport, London, Monday, Oct. 19, 2015. Chinese President Xi Jinping arrived in Britain Monday for a four-day state vi... (Toby Melville/Pool photo via AP). Chinese President Xi Jinping and his wife Peng Liyuan leave their plane as they arrive at Heathrow Airport, London, Monday, Oct. 19, 2015. Chinese President Xi Jinping arrived in Britain Monday for a four-day state vi... (AP Photo/Matt Dunham). People stand under a large Chinese flag as they wait to see Chinese President Xi Jinping and his wife Peng Liyuan, in London, Tuesday, Oct. 20, 2015. Chinese President Xi Jinping arrived in Britain Monday for a four-day state vi... By JILL LAWLESSAssociated Press \nLONDON (AP) - China's leader quoted Chinese proverbs and William Shakespeare while Britain's prime minister hailed a \"golden age\" between the two nations as a state visit festooned with regal pomp and pageantry was shadowed by concerns about national security, human rights and economic rivalry. \nPresident Xi Jinping's trip, years in the making, aimed to cement deals giving Britain a vast new pool of investment and China greater access to European markets. But as Xi was welcomed Tuesday as an honored guest at Buckingham Palace and Parliament, critics warned that Britain was taking a risk by courting Beijing so aggressively. \n\"If you act like a panting puppy, the object of your attention is going to think they have got you on a leash,\" James McGregor, a China expert at consulting firm APCO, told the BBC. \nSome British politicians, businesspeople and union members are alarmed by growing Chinese investment in key sectors of the British economy, including nuclear power, and by Chinese competition in areas such as steel production. \nHundreds of U.K. steel layoffs were announced Tuesday, the first full day of Xi's four-day visit, in a crisis that manufacturers blame on China selling steel at a loss on world markets to secure its own market share. \nPrime Minister David Cameron is under pressure to confront Xi about the steel industry and human rights, but China's leader was welcomed to London with lavish tradition and military pomp - a genre at which both Britain and China excel. \nXi was greeted with a 41-gun artillery salute before being driven to Buckingham Palace, where he and his wife Peng Liyuan will stay, in a gilded carriage drawn by white horses. \nThousands lined the route to see Xi go by. Demonstrators from human rights and pro-Tibet groups jostled with a much larger group of Xi well-wishers whose chants of \"China! China!\" drowned out their rivals' shouts of \"Shame!\" and \"Free Tibet!\" \nAmong the protesters was dissident Chinese lawyer and activist Chen Guangcheng, who urged British leaders not to ignore human rights in favor of trade. He told the BBC that while trade is important, human rights are \"like air and water, and no one can live without it.\" \nThe small protests and larger crowds of supporters followed Xi to Parliament and back to Buckingham Palace, where he later dined with Queen Elizabeth II, senior royals and dignitaries in a lavish state banquet. \nThe queen hailed what she called Britain and China's \"global partnership\" before leading guests in a toast to Xi and his wife. Prince William's wife, Kate - wearing a red gown and a lotus flower tiara loaned by the queen - was sat prominently next to Xi, while William sat next to Peng. \nXi made a short speech to both houses of Parliament, an honor that has been given to visiting politicians including President Barack Obama and German Chancellor Angela Merkel. \nBritain and China have a long and sometimes antagonistic history that includes the 19th-century Opium Wars and decades of Cold War tension. But Xi quoted Shakespeare - \"What's past is prologue\" - and urged the two nations to \"join hands and move forward\" toward peace and development. \nBritain's Conservative-led government has been courting China, the world's second-largest economy, for years. When Xi's predecessor, Hu Jintao, paid a state visit to Britain in 2005, the countries announced $1.3 billion in trade deals. This time, Britain said the two nations would sign 30 billion pounds ($46 billion) in business agreements. \nTreasury chief George Osborne, a champion of closer ties, has said he wants China to be Britain's biggest trading partner after the United States by 2025. \nIn an interview before the visit, Cameron told China's CCTV television that this was a \"golden age\" of U.K.-China relations. He said Chinese investment was good for Britain and that China benefited from \"having access to a country that is a leading member of the EU, and has so many other contacts and roles in the world.\" \nYet economic rivalries remain. Tata Steel announced 1,200 layoffs at its British plants Tuesday, just weeks after 2,200 jobs were lost at SSI's plant in northeast England. Tata said the layoffs were in response to \"a shift in market conditions caused by a flood of cheap imports, particularly from China, a strong pound and high electricity costs.\" \nIn an emergency House of Commons debate on the layoffs, Labour Party business spokesman Kevin Brennan accused the government of being \"content to allow Britain's entire steel-making capacity to disappear in the face of blatant Chinese dumping.\" \nChina also is set to build a new nuclear power plant in southwest England, and the two governments have signed deals giving Chinese money greater access to London's financial district. \nThe slew of deals has sparked accusations that Britain is pandering to China to secure investment. Opposition politicians are urging Cameron to raise China's human rights record in his several meetings with Xi this week. \nOthers caution against relying too heavily on a country whose astonishing recent economic growth is flagging. Data released Tuesday showed China eased to a six-year low of 6.9 percent growth in the third quarter after expanding 7 percent in each of the previous two quarters. Some economists, however, say this year's true rate of growth for China might be as low as 4 percent. \nAndreas Fulda, a lecturer in Chinese studies at the University of Nottingham, said the British government was being overly optimistic about the economic impact of Chinese trade. He said it appeared illogical for Britain to open up its economy to China without reciprocal measures to allow European businesses into the Chinese market. \n\"The Chinese market is not a level playing field,\" he said. \nOn Tuesday evening, Queen Elizabeth II was hosting a state banquet for Xi at Buckingham Palace, attended by senior politicians and royalty - but not by heir to the throne Prince Charles, a friend of exiled Tibetan spiritual leader the Dalai Lama. \nThe palace did not give a reason for Charles' absence. He held several engagements with Xi earlier in the day, including a private meeting over tea. \n__ \nAssociated Press Writers Danica Kirka and Sylvia Hui in London and Joe McDonald in Beijing contributed to this report. Copyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-10-21T06:53:00.000+03:00", "crawled": "2015-10-21T07:07:32.310+03:00", "highlightTitle": ""}