{"organizations": [], "uuid": "728cc62e493d47c4c58d7f9495b5e37b6003a6f9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mid-day.com", "main_image": "", "site_section": "http://www.mid-day.com/Resources/midday/rss/entertainment.xml#", "section_title": "entertainment", "url": "http://www.mid-day.com/articles/athiya-shetty-to-add-star-power-to-amazon-india-fashion-week/16594184", "country": "IN", "title": "Athiya Shetty to add star power to Amazon India Fashion Week", "performance_score": 0, "site": "mid-day.com", "participants_count": 1, "title_full": "Athiya Shetty to add star power to Amazon India Fashion Week - Entertainment", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "728cc62e493d47c4c58d7f9495b5e37b6003a6f9"}, "author": "PTI", "url": "http://www.mid-day.com/articles/athiya-shetty-to-add-star-power-to-amazon-india-fashion-week/16594184", "ord_in_thread": 0, "title": "Athiya Shetty to add star power to Amazon India Fashion Week", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "New Delhi : \"Hero\" actress Athiya Shetty, also the brand ambassador for Maybelline New York, will be walking the ramp for designer duo Rohit Gandhi and Rahul Khanna at the Amazon India Fashion Week (AIFW) Spring Summer 2016 here on Saturday.\nThe actress will showcase the designers' pret collection, inspired by the Maybelline woman who is modern, edgy, ambitious and diverse.\nThe collection which follows the theme of 'Many Mazes, Many Minds', will see structured silhouettes in mesh, silk organza and more highlighted with unique motifs, tone on tone embellishments and Rorschach embroideries.\nVivid tones of mint, white, coral, sky hues, frost and black form a strong part of the collection. A stark combination of black and white stripes has also been used which are in sync with Maybelline's motto of 'Make It Happen'.\n\"We are extremely excited to have Athiya Shetty make a debut for Maybelline New York at the grand platform of Amazon India Fashion Week. With established designers like Rohit Gandhi and Rahul Khanna, we look forward to a creating a show that will inspire women to express themselves with the power of make-up,\" Pooja Sahgal, general manager- marketing, Maybelline New York, said in a statement.\nThe ongoing five-day fashion gala that began on Wednesday has been low on Bollywood quotient so far. Only Bollywood beauties Konkona Sen Sharma, Mini Mathur, Deepti Naval and Soha Ali Khan were spotted applauding the collection of designer Sanjay Garg of the Raw Mango brand from the front row on Day One.", "external_links": [], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-08T15:01:59.016+03:00", "highlightTitle": ""}