{"organizations": [], "uuid": "276a021703281a25c4013f02ce1b91cf8326e515", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.aceshowbiz.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Aceshowbizcom-EntertainmentNews", "section_title": "Aceshowbiz.com - Entertainment News", "url": "http://www.aceshowbiz.com/news/view/00089910.html", "country": "US", "title": "Artist of the Week: 5 Seconds of Summer", "performance_score": 0, "site": "aceshowbiz.com", "participants_count": 1, "title_full": "Artist of the Week: 5 Seconds of Summer", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T10:27:00.000+03:00", "replies_count": 0, "uuid": "276a021703281a25c4013f02ce1b91cf8326e515"}, "author": "AceShowbiz.com", "url": "http://www.aceshowbiz.com/news/view/00089910.html", "ord_in_thread": 0, "title": "Artist of the Week: 5 Seconds of Summer", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments The Australian boys are coming back with 'Sounds Good Feels Good' which will be darker and more honest than their 2014 debut. \n5 Seconds of Summer enjoyed a huge 2014 thanks to their supporting slot on One Direction 's tour and two full-lenghts that included their No. 1 debut album. The Australian band continues the success in 2015 with their first headlining tour that launched earlier this year and another studio LP that's scheduled to come out on October 23. Titled \" Sounds Good Feels Good \", the new LP is led by \"She's Kinda Hot\" which has peaked at No. 22 on Billboard Hot 100. The song was co-penned by Good Charlotte 's Benji Madden and Joel Madden, who also worked with the group's members on several other cuts including the second single \"Hey Everybody\". 5SOS has promised a darker and more honest album with the upcoming project. \"I want people to feel something. It's more about connecting them with us,\" Ashton Irwin explained in a new interview with Australia's News.com. \"We have created 14 characters for 14 songs on the album and those characters are little skerricks of us and what we feel in the songs.\" \"It's a real honest thing that we want to be more than a band to our fans. And it's not meant to be a marketing thing or anything like that,\" he continued. \"The band got big so quickly off the first album and we went and looked at our own issues individually, the fans' issues and we said we need to put on our thinking caps and think about what we are singing and expressing.\" Talking about how this album would be different from its 2014 predecessor, Michael Clifford said that they might lose lots of fans because of some changes they'd made. \"With the new album we wanted to make sure our fans get us. They do. And maybe now some people are saying this band isn't for me,\" he shared. \"Admittedly a lot of people came to us from 1D. Now, to some of those people, we aren't the band they thought we were. There was a weird perception of us when we first came out and that's fair enough, we knew who we were playing to and we wouldn't change it for anything,\" he added. \n© AceShowbiz.com", "external_links": [], "published": "2015-10-19T10:27:00.000+03:00", "crawled": "2015-10-19T21:50:57.182+03:00", "highlightTitle": ""}