{"organizations": [], "uuid": "344f9a8dad169d7d9d9027d42865ea8fbeff5680", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.spokesman.com", "main_image": "http://media.spokesman.com/img/logos/sr200.png", "site_section": "http://www.spokesman.com/feeds/stories/entertainment/", "section_title": "Spokesman.com: Entertainment stories", "url": "http://www.spokesman.com/stories/2015/oct/15/faith-football-combine-in-woodlawn/", "country": "US", "title": "Faith, football combine in ‘Woodlawn’ - Thu, 15 Oct 2015 PST", "performance_score": 0, "site": "spokesman.com", "participants_count": 0, "title_full": "Faith, football combine in ‘Woodlawn’ - Thu, 15 Oct 2015 PST", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T10:00:00.000+03:00", "replies_count": 0, "uuid": "344f9a8dad169d7d9d9027d42865ea8fbeff5680"}, "author": "", "url": "http://www.spokesman.com/stories/2015/oct/15/faith-football-combine-in-woodlawn/", "ord_in_thread": 0, "title": "Faith, football combine in ‘Woodlawn’ - Thu, 15 Oct 2015 PST", "locations": ["Woodlawn"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Tony Nathan story isn’t one of the big stories in the integration of major sports. \nNathan, now 60, was a half-back with Birmingham, Alabama’s Woodlawn High School in the 1970s. \nThe school was racially diverse as a result of forced busing in the post-Brown vs. the Topeka … \nThe Tony Nathan story isn’t one of the big stories in the integration of major sports. \nNathan, now 60, was a half-back with Birmingham, Alabama’s Woodlawn High School in the 1970s. \nThe school was racially diverse as a result of forced busing in the post-Brown vs. the Topeka Board of Education Supreme Court ruling world. \nDuring Nathan’s varsity years, the team experienced a collective epiphany to distance themselves from the legacy of hatred that had permeated their lives until that time and embrace a spirit of unity. The team made a run at the playoffs, and Nathan became Birmingham’s first African American football star. He went on to play for the Miami Dophins. \n“ ‘Woodlawn’ is not a just a Christian movie,” Kevin Sizemore said during a telephone interview from his home in California. Sizemore portrays one of the assistant coaches on the Woodlawn football team. “It’s not just a football movie either.” \n“When I got the role I went down to Birmingham to meet the real Jerry Stearns,” Sizemore said. “I didn’t want to be Jerry Stearns. I studied his mannerisms and his heart in my portrayal of him. \n“We shot the film for almost nine weeks, and during that time, Jerry and I either talked on the phone or texted each other about once a day,” Sizemore said. “About four or five days before shooting wrapped, I received a call on the set to tell me that Jerry had died. His health was not good. He had two prosthetic legs, suffered from heart failure and diabetes. He didn’t expect to live long, but he didn’t expect God to take him right away. \n“The next day, I was visiting with his family and I said: ‘Jerry is going to see the movie before any of us because he’s looking down on us right now.’ He had worked so hard to help me understand the time and his feelings.” \n“Woodlawn” is directed by Andrew Erwin and Jon Erwin, and was written by Jon Erwin and Quinton Peeples. The stars include Caleb Castille as Tony Nathan; Sean Astin as Hank, the youth leader who steered the team toward embracing love; and Jon Voight as Alabama University head football coach, Paul “Bear” Bryant, who recruited Nathan to play for the Crimson Tide – the first black athlete to play at Alabama. \n“One thing that I have learned through the work on this movie is how racism is still prevalent,” Sizemore said. “I don’t understand it. If a brother falls down, help him up. Always put other people before yourself. No matter what the situation, always follow the Golden Rule. As a person, I have tried to get better in everything I do.”", "external_links": [], "published": "2015-10-15T10:00:00.000+03:00", "crawled": "2015-10-15T10:32:45.200+03:00", "highlightTitle": ""}