{"organizations": [], "uuid": "d8046fd445886bbaabc90feaa189184e75a0592d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.arcamax.com", "main_image": "http://www.arcamax.com/newspics/131/13113/1311338.jpg", "site_section": "http://www.arcamax.com/", "section_title": "News &amp; Entertainment by Email | ArcaMax Publishing", "url": "http://www.arcamax.com/currentnews/newsheadlines/s-1733007?fs", "country": "US", "title": "Susumu Ito, member of Japanese American regiment in World War II, dies at 96 | News & Features", "performance_score": 0, "site": "arcamax.com", "participants_count": 1, "title_full": "Susumu Ito, member of Japanese American regiment in World War II, dies at 96 | News & Features | ArcaMax Publishing", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "d8046fd445886bbaabc90feaa189184e75a0592d"}, "author": "arcamax.com", "url": "http://www.arcamax.com/currentnews/newsheadlines/s-1733007?fs", "ord_in_thread": 0, "title": "Susumu Ito, member of Japanese American regiment in World War II, dies at 96 | News & Features", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Much has been written about the brutal Lost Battalion mission in France during World War II in which Japanese-American soldiers of the 442nd Regimental Combat Team rescued a group of other U.S. soldiers cut off by the German enemy.\nThe tales of loss and ultimate victory in the multiday battle are harrowing, but perhaps some of the most emotional documentations of the mission are photographs taken by Stockton, Calif.-born soldier Susumu Ito, who carried a small camera during his time with the highly decorated 442nd.\nOne photo in particular drew attention during an exhibit of Ito's work this year at the Japanese American National Museum in Los Angeles. It showed a fellow soldier sitting down in a dense forest during a break in the action, his face buried in his hands.\n\"You don't know what he is thinking, what he's been through,\" said Lily Anne Welty Tamai, curator of history at the museum. \"But people would stand in front of the Lost Battalion photos and cry.\"\nIto, who became a professor and researcher after the war at Harvard Medical School, died of natural causes at his home in Wellesley, Mass. He was 96.\nBecause he lived alone, his exact date of death was not known. Officials listed it as Sept. 29, said his son-in-law, James Ito-Adler.\nIto donated thousands of his pictures -- including those of a Japanese-American internment camp in the U.S. and of a liberated Nazi concentration camp near Dachau -- to the museum's collection.\nHe was drafted into the Army in 1940 and probably could have avoided combat -- trained as a mechanic, he was initially assigned to a heavy vehicle maintenance unit at Camp Haan in Riverside, Calif. After the attack on Pearl Harbor in 1941, he was \"transferred into a boring, noncombatant station complement group\" in Oklahoma with many other Japanese-American soldiers, he said in an interview for the 2003 book about the 442nd, \"And Then There Were Eight.\"\n\"They took our rifles away,\" he said in a 2011 interview with CNN. \"They didn't know what to do with us.\"\nBut Ito wanted to see action and volunteered to be in the artillery of a 442nd unit.\nMeanwhile, his parents were among the more than 110,000 civilians of Japanese ancestry sent to internment camps during the war. While in Army training in Mississippi, Ito had the chance to visit them at the Rohwer Relocation Center in Arkansas (the same camp where actor George Takei spent part of his boyhood). With his inexpensive, 35-millimeter Agfa Memo camera, Ito took pictures of life in the barracks-like facilities.\n\"I guess to see how they lived there was, was somewhat shocking,\" he said in a 2000 interview with the Go for Broke National Education Center's oral history project. His parents and other relatives were crowded into small, spare rooms and had to deal with a lack of privacy, even in the bathrooms. \"It seemed very degrading.\"\nBut it did not dampen his wish to fight for his country with the 442nd, which adopted the motto \"Go for broke.\"\nSent to Europe, the outfit was involved in major combat campaigns. German captives were especially stunned to see members of the regiment. \"We'd tell them, 'Don't you know that Japan is fighting with the U.S. Army now?'\" Ito said with a laugh in a Los Angeles Times interview in July.\nIn October 1944, with little rest from combat, soldiers of the regiment, including Ito, were sent to rescue more than 200 men of what became known as the Lost Battalion, trapped by enemy forces in the Vosges Mountains. It was a highly dangerous mission in the dense forest, under heavy artillery and machine gun fire. Shortly before it began, Ito was given a field commission promotion to 2nd lieutenant.\n\"It was so dark, you couldn't see the man in front of you,\" he told CNN. \"I lost so many colleagues.\"\nAfter several days, members of the regiment made their way up a hill -- later given the nickname Banzai Hill -- and pulled off the rescue of the trapped soldiers who had dug deep foxholes to survive.\nIto was involved in several other actions during the war, including the liberation of a Nazi auxiliary camp near Dachau where Jews were imprisoned during the war. \"It was probably as sad an outcome ... of man's atrocity to man as one can encounter,\" he said in the Go for Broke interview.\nIto came home from the war unhurt.\n\"I don't know why I was so fortunate,\" he told CNN. \"I'm very grateful for the time given to me. I aim to make the most of it.\"\nHe was born July 27, 1919. Although his immigrant parents were poor itinerant farmers and endured racial prejudice, Ito recalled his rural childhood with fondness. \"I didn't have a pair of trousers until I started school, I think,\" he said in the Go for Broke oral history. \"We always wore overalls and led a very, very carefree life.\"\nFrom an early age, he was mischievous and rebelled against authority. That included secretly carrying his camera on military missions, which was against the rules. \"I wanted to take one because we weren't allowed to,\" he said with a grin in the Times interview. \"I like to break the rules.\"\nAfter the war, Ito used G.I. Bill benefits to enroll at Western Reserve University (now Case Western Reserve) in Cleveland. He got his doctorate in biology from Cornell University. Although he retired from Harvard in 1990, he routinely continued his research activities into his 90s.\nIn 2011, he was among the members of the 442nd to receive the Congressional Gold Medal for their service during the war.\n\"Despite the fact that we were rounded up, segregated and interned,\" he told CNN, \"I think the message I would like to spread is that our loyalty to the United States is unquestioned.\"\nIto's wife of 64 years, Minnie, died in 2012. He is survived by daughters Linda Ito-Adler and Celia Doe; son Bruce Ito; and five grandchildren.\n(c)2015 Los Angeles Times\nVisit the Los Angeles Times at www.latimes.com\nDistributed by Tribune Content Agency, LLC.\nShare Comment", "external_links": ["http://twitter.com/share?url=http://www.arcamax.com/currentnews/newsheadlines/s-1733007&hashtags=ArcaMax", "http://www.facebook.com/sharer.php?u=http://www.arcamax.com/currentnews/newsheadlines/s-1733007&h=Susumu+Ito%2C+member+of+Japanese+American+regiment+in+World+War+II%2C+dies+at+96", "https://plus.google.com/share?url=http://www.arcamax.com/currentnews/newsheadlines/s-1733007"], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-06T04:26:29.242+03:00", "highlightTitle": ""}