{"organizations": [], "uuid": "c25360b9d416c9775b3859ac9efb8c0559f22ff6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "http://www.bostonherald.com/sites/default/files/media/2014/09/15/101415witchhunter001.jpg", "site_section": "http://bostonherald.com/entertainment", "section_title": "Entertainment | Boston Herald", "url": "http://bostonherald.com/entertainment/movies/movie_news/2015/10/last_witch_hunter_newest_film_franchise_for_overworked", "country": "US", "title": "‘Last Witch Hunter’ newest film franchise for overworked Diesel", "performance_score": 0, "site": "bostonherald.com", "participants_count": 1, "title_full": "‘Last Witch Hunter’ newest film franchise for overworked Diesel | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T03:00:00.000+03:00", "replies_count": 0, "uuid": "c25360b9d416c9775b3859ac9efb8c0559f22ff6"}, "author": "Stephen Schaefer", "url": "http://bostonherald.com/entertainment/movies/movie_news/2015/10/last_witch_hunter_newest_film_franchise_for_overworked", "ord_in_thread": 0, "title": "‘Last Witch Hunter’ newest film franchise for overworked Diesel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK — Vin Diesel doesn’t need another film franchise.\nHe’s already locked into “Furious 8,” “Guardians of the Galaxy 2” and the next installments in his “XXX” and “Riddick” action movies.\nBut the 48-year-old superstar revealed that when Lionsgate executives were on the set of “The Last Witch Hunter” (opening Friday), they readily committed to a sequel.\n“I was doing a scene with Michael Caine” — who plays the aged priest who has assisted Diesel’s ageless Witch Hunter for 50 years — “and the top brass from the studio came down and were sitting behind the monitor all day. At the end of the day, they came over and said, ‘Just want to tell you. We’re starting the sequel now.’\nDiesel admitted, “It’s always flattering to hear. Awesome. Scary? A little bit, but definitely comes from a place of confidence, which is never a bad thing.”\nThe approval for the film is particularly satisfying for Diesel, for two decades-plus a “Dungeon & Dragons” fan and an avid gamer who sparked the notion of a witch hunter doomed for eternity to protect mankind.\n“The film implies that witches are just scratching the surface of this other, shadow realm, and I always thought of it as an introduction to the mythology.”\nViewers might be startled by his appearance at first: In a sequence set 800 years in the past, he is almost unrecognizable as a bearded Viking.\n“That was the vision of our director Breck Eisner. He created that look. I was apprehensive about looking so radically different — but excited, too.\n“Actors on the film who were only in the modern-day section would come into the makeup trailer and see the pictures of this guy with a beard and thought it was another actor! They were in scenes with me but had no idea.”\nAs for “Furious 8,” it will reunite Diesel with director F. Gary Gray.\n“I haven’t worked with him since ‘A Man Apart’ 14 years ago. Isn’t that crazy? This next one will fit in quite nicely. It’s going to be shocking for what’s about to come,” he promised while flashing a smile. “Shocking people is fun.”", "external_links": [], "published": "2015-10-18T03:00:00.000+03:00", "crawled": "2015-10-18T08:44:26.709+03:00", "highlightTitle": ""}