{"organizations": [], "uuid": "dbecd14760c1560abddea070c8fdf0267383ae66", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "http://www.bostonherald.com/sites/default/files/media/2015/05/08/100715walkingdead.jpg", "site_section": "http://bostonherald.com/entertainment", "section_title": "Entertainment | Boston Herald", "url": "http://bostonherald.com/entertainment/television/2015/10/walking_dead_encounters_divided_path", "country": "US", "title": "‘Walking Dead’ encounters divided path", "performance_score": 0, "site": "bostonherald.com", "participants_count": 1, "title_full": "‘Walking Dead’ encounters divided path | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T03:00:00.000+03:00", "replies_count": 0, "uuid": "dbecd14760c1560abddea070c8fdf0267383ae66"}, "author": "John Crook", "url": "http://bostonherald.com/entertainment/television/2015/10/walking_dead_encounters_divided_path", "ord_in_thread": 0, "title": "‘Walking Dead’ encounters divided path", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The presence of battle-hardened Rick Grimes (Andrew Lincoln), Daryl Dixon (Norman Reedus) and their party polarizes the genteel residents of Alexandria and threatens to spark civil unrest as AMC’s “The Walking Dead” returns for its sixth season tonight at 9.\nLongtime fans of the show likely share Rick’s profound wariness about the relative safety that apparently prevails against all odds in this community, but they may start to change their minds as this season unfolds, revealed executive producer Robert Kirkman, who created this epic saga in comic-book format more than a decade ago. He remains heavily involved in its TV incarnation.\n“Season five put (Rick and his party) in an environment that really illustrates how much they have changed and how different they are now,” Kirkman said. “We brought them into Alexandria and put them back into what could pass as ‘normal’ to see how they would react. And they either can’t trust in it or they don’t accept it.”\nAnyone who has watched “The Walking Dead” from the start and followed the brutal challenges Rick Grimes has survived probably can understand his extreme skepticism about Alexandria, but season six will flip the focus somewhat to explore how the Alexandrians regard this violence-marinated newcomer in their midst.\n“The reaction that the people in Alexandria are having is the normal reaction that you should have if you encounter someone like Rick Grimes at this time (in their experience),” Kirkman said. “If Rick Grimes were to walk into any of our living rooms here in our safe, real world, we would see him as a lunatic. I don’t want to spoil anything, but in some respects season six is about a villain who is taking over a town and how are these people letting this happen? You can come into a show like this and have a completely different perspective on what is happening, whether you’ve watched everything leading up to it or not. That’s fascinating, and we have some really cool, really neat stories ... about this conflict between ‘Do we retain our humanity or do we do whatever we have to do to survive?’ ”\nThe reappearance of Morgan (Lennie James), a character introduced in the first season of the TV show, serves to intensify the schism inside Alexandria, since he has arrived at a world view that is far more pacifist than Rick’s kill-or-be-killed attitude.\n“Morgan really is a catalyst this season, and he’s going to change things in very large, earth-­shattering ways,” Kirkman said. “He is a guy who has been through as many things as Rick has — and, to a certain extent, worse than what Rick has gone through — and yet he has a completely opposing outlook on how to survive in this world. These two men met under completely different circumstances in season one, met again in season three, and now are meeting again. Seeing how they interact with each other is really interesting.”", "external_links": [], "published": "2015-10-11T03:00:00.000+03:00", "crawled": "2015-10-11T09:41:58.922+03:00", "highlightTitle": ""}