{"organizations": [], "uuid": "f2cdec0e3522c768ac88cea356fd6b822688f1f4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.india.com", "main_image": "http://s3.india.com/wp-content/uploads/2015/10/New_Delhi_Metro.jpg", "site_section": "http://www.india.com/feed/", "section_title": "India | Latest India News | Get Free India.com Email | Live Cricket and Entertainment News at India.Com", "url": "http://www.india.com/news/india/ngt-notice-to-moef-on-noida-greater-noida-metro-line-659452/", "country": "US", "title": "NGT notice to MoEF on Noida-Greater Noida metro line", "performance_score": 0, "site": "india.com", "participants_count": 1, "title_full": "NGT notice to MoEF on Noida-Greater Noida metro line", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T14:04:00.000+02:00", "replies_count": 0, "uuid": "f2cdec0e3522c768ac88cea356fd6b822688f1f4"}, "author": "Wires English | Press Trust of India", "url": "http://www.india.com/news/india/ngt-notice-to-moef-on-noida-greater-noida-metro-line-659452/", "ord_in_thread": 0, "title": "NGT notice to MoEF on Noida-Greater Noida metro line", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments New Delhi, Oct 26: The National Green Tribunal has sought the response of Ministry of Environment and Forests (MoEF) and Uttar Pradesh government among others on a petition challenging the construction of upcoming Noida-Greater Noida metro line. A bench headed by NGT Chairperson Justice Swatanter Kumar issued notice to Ministry of Environment and Forests (MoEF), Delhi and Noida Metro Rail Corporation, Uttar Pradesh government and others while seeking their reply by November 24. (Also Read: Crime against Muslims, Dalits rising in Rajasthan: Jamaat-E-Islami Hind) The tribunal was hearing a plea filed by environmentalist Vikrant Tongad seeking directions to Noida Metro Rail Corporation (NMRC) to obtain environmental clearance for its project from Noida to Greater Noida after conducting proper Environment Impact Assessment of the project. ”From the detailed project report (DPR) it is clear that the total land requirement for the project of metro rail from Noida to Greater Noida is around 2,84,762.01 sq m, however, no Environment Impact Assessment (EIA) report was prepared. This fact was verified by the applicant by inspecting the records of the project under Right to Information Act, 2005. “It is submitted that as per 8(b) of the Schedule of EIA Notification, 2006 project having covering area more than 50 ha or built up area more than 150000 sq m requires environmental clearance and is to be appraised as category ‘B1′ project,” the plea, filed through advocate Rahul Choudhary, said. Tongad stated that the metro from Noida to Greater Noida will pass through Hindon and piers would be constructed on the river bed which can significantly harm aquatic habitat of the river. “During construction phase of the project, the total water requirement is about 1,40,00,000 litres. The water requirement would be met to by digging borewells. The detailed project report states that the water is made available by borewell within the vicinity of the project site during the construction phase. ”The requirement water for operation phase is not clear from the DPR. It is submitted that the extraction of groundwater will have further impact of the depleting groundwater level of Noida and Greater Noida,” the plea added. \nModified Date: October 26, 2015 5:34 PM Topics:", "external_links": [], "published": "2015-10-26T14:04:00.000+02:00", "crawled": "2015-10-26T14:18:57.171+02:00", "highlightTitle": ""}