{"organizations": [], "uuid": "582808aa454d414b2bb3bc43a604051161d2cf71", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/10/22/13039204/gilbert.jpg", "site_section": "http://www.prweb.com/rss2/artbooks.xml", "section_title": "Arts &amp; Entertainment: Books", "url": "http://www.prweb.com/releases/2015/10/prweb13039204.htm", "country": "US", "title": "Samuel Gilbert’s New Book “The Beastly Frame” is a Suspenseful, Page-turner that Delves into the Psyche and Mystery of Crime, Fear and Love.", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Samuel Gilbert’s New Book “The Beastly Frame” is a Suspenseful, Page-turner that Delves into the Psyche and Mystery of Crime, Fear and Love.", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T02:00:00.000+02:00", "replies_count": 0, "uuid": "582808aa454d414b2bb3bc43a604051161d2cf71"}, "author": "Mitzi McKenzie", "url": "http://www.prweb.com/releases/2015/10/prweb13039204.htm", "ord_in_thread": 0, "title": "Samuel Gilbert’s New Book “The Beastly Frame” is a Suspenseful, Page-turner that Delves into the Psyche and Mystery of Crime, Fear and Love.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Samuel Gilbert, a Christian, prior gang member, singer, devoted writer and author, has completed his new book “The Beastly Frame”: a gripping and potent journey of intrigue, mystery, manipulation with several unexpected moments. Published by New York City-based Page Publishing, Samuel Gilbert’s emotional tale details the life of the main character and the audacities of life in poverty.\nOne man’s love for a woman creates jealousy and murder. Two childhood friends turn into a deadly battle in their endeavor to survive the street life. Living in poverty is always a question of who’ll survive and who won’t. Selling drugs always seem to spark that glimmer of hope for success when everything else has failed in this corrupt world we live in. Is it all worth dying for when you go against our judicial system? Find out in this thrilling tale of murder and intrigue.\nReaders who wish to experience this profound work can purchase “The Beastly Frame” at bookstores everywhere, or online at the Apple iTunes store, Amazon, Google Play or Barnes and Noble.\nFor additional information or media inquiries, contact Page Publishing at 866-315-2708.\nAbout Page Publishing\nPage Publishing is a traditional New York based full-service publishing house that handles all of the intricacies involved in publishing its authors’ books, including distribution in the world’s largest retail outlets and royalty generation. Page Publishing knows that authors need to be free to create - not bogged down with complicated business issues like eBook conversion, establishing wholesale accounts, insurance, shipping, taxes and the like. Its roster of authors can leave behind these tedious, complex and time consuming issues, and focus on their passion: writing and creating. Learn more at http://www.pagepublishing.com .", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5wYWdlcHVibGlzaGluZy5jb20vcG9ydGZvbGlvLXZpZXcvdGhlLWJlYXN0bHktZnJhbWUv", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5wYWdlcHVibGlzaGluZy5jb20="], "published": "2015-10-26T02:00:00.000+02:00", "crawled": "2015-10-26T09:19:01.846+02:00", "highlightTitle": ""}