{"organizations": [], "uuid": "ca040ab06cfd93b85a5929f6496c1253d7073104", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chron.com", "main_image": "http://ww4.hdnux.com/photos/41/41/61/8789111/3/rawImage.jpg", "site_section": "http://www.chron.com/rss/feed/Entertainment-293.php", "section_title": "Entertainment", "url": "http://www.chron.com/entertainment/restaurants-bars/article/Halloween-burger-s-black-bun-has-an-eery-effect-6570494.php", "country": "US", "title": "Halloween burger's black bun has an eery effect", "performance_score": 0, "site": "chron.com", "participants_count": 1, "title_full": "Halloween burger's black bun has an eery effect - Houston Chronicle", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T19:56:00.000+03:00", "replies_count": 0, "uuid": "ca040ab06cfd93b85a5929f6496c1253d7073104"}, "author": "chron.com", "url": "http://www.chron.com/entertainment/restaurants-bars/article/Halloween-burger-s-black-bun-has-an-eery-effect-6570494.php", "ord_in_thread": 0, "title": "Halloween burger's black bun has an eery effect", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photo: PAUL J. RICHARDS, Staff Image 1 of / 3 3 Recently released Burger King Halloween Whopper is seen on October 5, 2015, in Centreville, Virginia. The burger, inspired by the Black Burger in Japan, is made with A-1 Steak sauce and food coloring, with a pitched-black bun covered with Sesame seeds. It has a suggested US retail price starting at $4.99 (USD). AFP PHOTO/PAUL J. RICHARDSPAUL J. RICHARDS/AFP/Getty Images\nPhoto: PAUL J. RICHARDS, Staff Recently released Burger King Halloween Whopper is seen on October... Image 2 of 3 Recently released Burger King Halloween Whopper is seen on October 5, 2015, in Centreville, Virginia. The burger, inspired by the Black Burger in Japan, is made with A-1 Steak sauce and food coloring, with a pitched-black bun covered with Sesame seeds. It has a suggested US retail price starting at $4.99 (USD). AFP PHOTO/PAUL J. RICHARDSPAUL J. RICHARDS/AFP/Getty Images\nPhoto: PAUL J. RICHARDS, Staff Recently released Burger King Halloween Whopper is seen on October... Image 3 of 3 Burger King's Halloween Whoppers feature black buns made ﻿with A.1. Thick and Hearty Sauce.﻿\nPhoto: PAUL J. RICHARDS, Staff Burger King's Halloween Whoppers feature black buns made ﻿with... Halloween burger's black bun has an eery effect 1 / 3 Back to Gallery This week, I reached out, with rare trepidation, for a new A.1. Halloween Burger from the No. 2 burger chain, Burger King, with 14,000 restaurants everywhere on this crazy blue planet hurtling across the universe.\nMore about blue later.\nWhat makes this a Halloween Whopper? The trick is the bun - it's very black. And it's no treat.\nBurger King says it's the flavor of A.1. Thick and Hearty Sauce baked in the bun that turns it black. Even though I tried two Halloween Whoppers, I didn't detect any A.1. flavor in the bun. It tasted like a regular bun - only black. Which makes me wonder … why?\nBurger King has tried a similar black bun Whopper in Japan. Over there, the black color is courtesy of squid ink and bamboo charcoal. That ain't helping, Burger King.\nSo be happy that all you're not tasting in the U.S. is A.1. Sauce.\nHere's the A.1. Halloween Whopper blueprint: a quarter-pound flame-broiled beef patty, melted American cheese, tomato, iceberg lettuce, mayo and a squeeze of A.1. Thick and Hearty Sauce on a black, sesame-seed bun laced with the flavor of A.1. sauce.\nTotal calories: 710. Fat grams: 43. Sodium: 1,530 mg. Carbs: 53 g. Dietary fiber: 3. Protein: 31 g.\nManufacturer's suggested retail price: $4.99.\nBurger King has been riding high recently on the reintroduction of Chicken Fries and the spinoff, Fiery Chicken Fries. It's said that every great idea in fast food is followed by an equal and opposite bad idea. The Halloween Whopper is that bad idea.\nWe love Whoppers - regular Whoppers on regular burger buns. They're a drive-through icon. What was in the air-conditioning vents the day that Burger King geniuses decided to unleash a Whopper on an ebony bun? If people really do eat with their eyes, too, it's time to turn off the lights in Burger King's R&D lab.\nThe Halloween Whopper is even served in a spooky wrapper to warn you that something scary is about to happen. More about that later, too.\nThis bun isn't pumpernickel-black, we're talking piano-keys black. It just plain looks weird, like something's gone terribly wrong.\nHere's where it gets beyond weird. If you believe what's being said on Twitter and social media - how can I put this delicately?\nAre you a poker player? Then deuces are wild.\nThe A.1. Halloween Whopper reportedly has a strange and colorful side effect on your next bathroom visit. The black bun will turn some people's bowel movements greenish-blue.\nA moment of reflection: I have reviewed more than 1,000 fast-food items, one a week, every week, for more than 20 years. I never thought I'd review a burger and mention that it may turn your bowel movement into a technicolor experience.", "external_links": ["http://ww4.hdnux.com/photos/41/41/61/8789111/3/920x920.jpg", "http://ww3.hdnux.com/photos/41/41/61/8789114/3/920x920.jpg", "http://ww2.hdnux.com/photos/41/41/61/8789113/3/920x920.jpg", "http://ww4.hdnux.com/photos/41/41/61/8789111/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/41/41/61/8789114/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/41/41/61/8789113/3/square_gallery_thumb.jpg"], "published": "2015-10-14T19:56:00.000+03:00", "crawled": "2015-10-14T21:45:52.262+03:00", "highlightTitle": ""}