{"organizations": [], "uuid": "3a9d73d7454b63dc9138985936e14945856c11d0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-56183d3b/turbine/ct-rosenthal-cubs-cardinals-1011-biz-20151009", "site_section": "http://www.chicagotribune.com/", "section_title": "Chicago Tribune: Chicago breaking news, sports, business, entertainment, weather and traffic - Chicago Tribune", "url": "http://www.chicagotribune.com/business/columnists/ct-rosenthal-cubs-cardinals-1011-biz-20151009-column.html", "country": "US", "title": "Even Cards, White Sox fans may appreciate Joe Maddon&apos;s Cubs leadership - Chicago Tribune", "performance_score": 0, "site": "chicagotribune.com", "participants_count": 1, "title_full": "Even Cards, White Sox fans may appreciate Joe Maddon&apos;s Cubs leadership - Chicago Tribune", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T01:13:00.000+03:00", "replies_count": 0, "uuid": "3a9d73d7454b63dc9138985936e14945856c11d0"}, "author": "Phil Rosenthal", "url": "http://www.chicagotribune.com/business/columnists/ct-rosenthal-cubs-cardinals-1011-biz-20151009-column.html", "ord_in_thread": 0, "title": "Even Cards, White Sox fans may appreciate Joe Maddon&apos;s Cubs leadership - Chicago Tribune", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "You don't have to know or like baseball to appreciate the way Cubs manager Joe Maddon has led them this season. You don't have to like the Cubs. Dare it be said, you can even be a Cardinals or White Sox fan.\nEffective leadership, wherever one might hope to find it, sadly has become as elusive as civil debate on social media, reasonably priced parking downtown and a subtle Al Pacino performance.\nSo when you come across it, however you come across it, you can ill-afford to squander the chance to savor it. Make a point to take stock of its rarity and the difficulty in sustaining it as much as whatever other outstanding qualities distinguish it.\nMaddon's Cubs have coalesced into contenders much as his earlier Tampa Bay Rays teams did. A big part of his role has been to achieve the right clubhouse balance between playful and all-business as if adjusting the tension of strings to tune a violin.\nAnd there's something uplifting in his virtuosity.\nFor the subset of Cubs faithful, few if any of whom were alive the last time their team won a World Series in 1908, this rush may be partly fueled in the mid-October baseball's open-ended optimism of unextinguished hopes.\nYet there's something for everyone in evidence that turnarounds can happen when leaders marshal forces, harness talent, maximize effectiveness, successfully execute strategy — you know, lead.\nWe are lousy these days with CEOs who insist they had no idea what those they oversee were doing to boost their business's interests, share prices and executive bonus pool.\nConcerning Cardinals, love lost, but respect everlasting from Joe Maddon David Haugh From their days growing up together in Hazleton, Pa., Dave Cassarella vividly recalls Joe Maddon the Cardinals fan.\nThe buddy whose dad took him to Yankee Stadium in 1962 and told the 8-year-old to pick out a souvenir, so young Joe chose a red Cardinals hat because he liked the logo, starting the...\nFrom their days growing up together in Hazleton, Pa., Dave Cassarella vividly recalls Joe Maddon the Cardinals fan.\nThe buddy whose dad took him to Yankee Stadium in 1962 and told the 8-year-old to pick out a souvenir, so young Joe chose a red Cardinals hat because he liked the logo, starting the...\n(David Haugh) We are teeming with politicians who love the sound of their own pronouncements while bobbing and weaving to avoid responsibility for not forming and managing the coalitions necessary to do anything but complain about inaction.\nIt's refreshing to see anyone uniting people to achieve a common purpose, regardless of how this eventually plays out this year or in the years to come.\nYes, it's in the job description of a baseball manager to manage. But managing is in the job description for a lot of positions in a lot of areas — mayor, speaker, governor, chief executive, coach, commissioner among them — and there hasn't necessarily been a lot to cheer.\nIt is customary to write about the management wisdom you, me, our bosses and everyone else can derive whenever a Chicago-area sports team breaks from the city's long-standing tradition of mediocrity by threatening to win something.\nThe lessons, broadly, tend to be common sense.\nKnow what each of your people can do and what each responds to, even if they don't. Listen but be decisive. Understand when focus is needed and when a distraction is needed more. Shield those under you by absorbing blame, but deflect credit to them for success.\nCubs vs. Cards: All 2,363 games in five charts Chad Yoder The Chicago Bears have squared off against their rivals the Green Bay Packers 191 times since 1921. The Chicago Bulls have faced teams featuring Lebron James 68 times since 2003. The Chicago White Sox have played the Detroit Tigers 2,113 times since 1901. None of those rivalries compares with the... The Chicago Bears have squared off against their rivals the Green Bay Packers 191 times since 1921. The Chicago Bulls have faced teams featuring Lebron James 68 times since 2003. The Chicago White Sox have played the Detroit Tigers 2,113 times since 1901. None of those rivalries compares with the... (Chad Yoder) That sort of thing.\nSome specifics — that it helps to have a Michael Jordan and a Scottie Pippen, a team leader like Jonathan Toews or Paul Konerko, a punishing defense, a hot goalie, great pitching, a lot of luck — are usually glossed over. But consistency speaks volumes.\nPhil Jackson did a masterful job of holding together the superstar-rich Bulls championship teams of the 1990s. They could have easily exploded into a supernova spray of overheated egos if not properly managed and directed. Ask LeBron James what an all-star basketball lineup ensures.\nThe Blackhawks' three Stanley Cups to date under Joel Quenneville are testimony to his effectiveness.\nOthers calling the shots in local sports have not nearly matched that kind of success, unless restaurant openings count. It is more common to rise and fall or, in Chicago, to rise not nearly enough, fall or flatline.\nEven the best leader hits a freshness date. Veterans under them start to recognize the same speeches and anticipate what once was unexpected. Opponents, too, are less likely to be surprised by moves after a while.\nYou can get caught up in Maddon's unusual methods of keeping his players loose over the years, from animals in the clubhouse to this summer's team pajama party on the red-eye Cubs charter flight home from the West Coast.\nThere's something infectious about the Little League-like enthusiasm of how the Cubs celebrated their wild-card victory at Pittsburgh. But it wouldn't have mattered — and, more importantly, might not have happened — if Maddon weren't also a skilled and confident tactician.\nFor that matter, if Cubs pitcher Jake Arrieta hadn't been on fire, perhaps it would have been the Pirates advancing to play St. Louis in the playoffs' next round.\nA lot of maybes out there.\nThis team, Maddon's first in Chicago, is young and talented. Like a prospective blind date, it presents nothing but possibilities and has yet to let anyone down.\nMaddon's brand of leadership ultimately may prove less instructive than inspirational.\nBut inspiration from leaders is in such short supply these days, that might be valuable enough.\nphilrosenthal@tribpub.com\nTwitter @phil_rosenthal\n Ice Hockey Chicago Cubs Joe Maddon Chicago White Sox St. Louis Cardinals Phil Rosenthal Tampa Bay Rays", "external_links": ["http://www.trbimg.com/img-56183d3b/turbine/ct-rosenthal-cubs-cardinals-1011-biz-20151009", "http://www.trbimg.com/img-56182aba/turbine/ct-cubs-cardinals-by-the-numbers-20151009", "http://www.trbimg.com/img-56171f23/turbine/ct-joe-maddon-cardinals-cubs-haugh-spt-1009-20151008"], "published": "2015-10-10T01:13:00.000+03:00", "crawled": "2015-10-10T02:30:36.095+03:00", "highlightTitle": ""}