{"organizations": [], "uuid": "1d07bba75ba2107db17604b1f8c65514f2cab453", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pe.com", "main_image": "http://images.onset.freedom.com/pressenterprise/thumb/nw6st4-b88539678z.120151013184154000gehcinss.10.jpg", "site_section": "http://www.pe.com/", "section_title": "Press Enterprise : Riverside County California News, Sports and Entertainment", "url": "http://www.pe.com/articles/riverside-783357-tookie-air.html", "country": "US", "title": "RIVERSIDE: Husband-wife aviators killed in Idaho plane crash", "performance_score": 0, "site": "pe.com", "participants_count": 9, "title_full": "RIVERSIDE: Husband-wife aviators killed in Idaho plane crash - Press Enterprise", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 9, "uuid": "1d07bba75ba2107db17604b1f8c65514f2cab453"}, "author": "BRIAN ROKOS", "url": "http://www.pe.com/articles/riverside-783357-tookie-air.html", "ord_in_thread": 0, "title": "RIVERSIDE: Husband-wife aviators killed in Idaho plane crash", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By BRIAN ROKOS / STAFF WRITER\nPublished: Oct. 13, 2015 Updated: 6:49 p.m. RIVERSIDE: Husband-wife aviators killed in Idaho plane crash Print Photo Share Pin It 1 of 2 More Galleries ADVERTISEMENT Pam Bird, in foreground, Tookie Hensley, in background, and Don Hensley, in rear seat, prepare to take off from an Idaho airport on Oct. 7, 2015. Their plane would crash minutes later, killing all three. The Hensleys lived in Riverside for decades and were well known in aviation circles. , COURTESY OF BIRD AVIATION MUSEUM & INVENTION CENTER Related article » Tookie Hensley bought flying lessons in 1973 as a Christmas present for her husband, Don, while she worked as a bookkeeper for a vendor at Riverside Municipal Airport.\nTookie Hensley later learned to fly after a back injury forced her to give up dune buggy and dirt bike racing. Years later, at age 67 in 2002, she became a champion aviatrix.\nDon and Tookie, after living in Riverside for decades, would eventually open their own flight school in Arizona. He would also fly entertainers to and from Las Vegas.\nThe hobby and profession that provided the couple with a full and adventurous life also ended it Thursday, Oct. 7, when the Cessna in which they were passengers crashed shortly after takeoff in Idaho. Don, 84, Tookie, 80, and pilot Pam Bird, 58, died in a devastating crash at the 6,149-foot summit of the Cabinet Mountains.\n\"Our hearts and our prayers go out to the families of all those associated with this very unfortunate accident,\" Bonner County Sheriff Daryl Wheeler told the Hagadone News Network.\nThe cause of the crash has not been determined.\nThe three flyers departed the Bird Aviation Museum & Invention Center at Glengary Bay in a Cessna 182 at 8:16 a.m. Thursday, Wheeler told the Bonner County Daily Bee. Ten minutes later, the U.S. Air Force Rescue Coordination Center at Tyndall Air Force Base in Florida notified the sheriff’s office that it had received a signal from an emergency locator beacon in Bonner County.\nA Civil Air Patrol airplane was scrambled and located the downed Cessna in rugged terrain on the flank of Round Top Mountain.\nThe flight plan involved flying to Minot, N.D.; Bar Harbor, Maine; and Gainesville, Fla.\nBird was the widow of Forrest Morton Bird, an aviator, biomedical engineer and inventor credited with revolutionizing chronic cardiopulmonary care with mechanical ventilators, the Daily Bee said. Forrest Bird, 94, died Aug. 2. His wife co-founded the Bird Museum.\nFriends of the Hensleys, in online comments on stories about their deaths, remembered the couple as kind and giving, and as expert aviators who patiently taught them to fly.\nTookie came a long way from a “housewife-type,” as she described herself in a 2002 Press-Enterprise story.\n“It was just such a challenge to do something not anybody does,\" Hensley said. “When I found out I could do it, it was the greatest thing.”\nThe Hensleys married Jan. 10, 1953, in Riverside. They celebrated their golden anniversary with a dinner, dance and vow-renewal ceremony hosted by their family and 180 friends at California Riverside Ballet.\nDon co-owned Fiesta Kampers in San Bernardino for 30 years before he retired in 1987. Previously he worked for Hunter Douglas in San Bernardino for seven years.\nTookie was a bookkeeper for Parflite at the airport for 12 years. She served on the Riverside County Airport Commission and on the board of directors for both the Air Race Classic and the California Riverside Ballet.\nThey moved to Mohave Valley, Arizona, in 1987, where they owned Tookie’s Flying Service, a flight school and charter service.\nTookie, teaming with Anne Honer, in 2002 won the Air Race Classic, a four-day, cross-country event that is the largest and longest-running air race for women. She had tried to win the race for 27 years, finishing in the top 10 in 1983, 1985, 1991 (finishing second), 1993 and 1996 before finally winning. She also entered in 2006 and 2008.\n“I'm very envious of this pilot,” longtime Riverside pilot Hank Schmel said in the 2002 story. “I learned to fly in high school in 1945 and it was always a man thing. I was so impressed – embarrassed – by what she had accomplished.”\nContact the writer: brokos@pe.com or 951-368-9569", "external_links": ["http://common.onset.freedom.com/images/gallery/twitter-ico.jpg", "http://common.onset.freedom.com/images/gallery/fb-ico.jpg", "http://images.onset.freedom.com/pressenterprise/gallery/nw6st4-b88539678z.120151013184154000gehcinss.10.jpg", "http://assets.pinterest.com/js/pinmarklet.js?r=", "http://images.onset.freedom.com/pressenterprise/thumb/nw6st4-b88539678z.120151013184154000gehcinss.10.jpg", "http://images.onset.freedom.com/pressenterprise/gallery/nw6st4-b88539678z.120151013184154000gmncijja.10.jpg", "http://s7.addthis.com/js/250/addthis_widget.js#username=YOUR-ACCOUNT-ID", "http://common.onset.freedom.com/images/gallery/mail-ico.jpg", "http://images.onset.freedom.com/pressenterprise/thumb/nw6st4-b88539678z.120151013184154000gmncijja.10.jpg"], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-14T07:43:23.228+03:00", "highlightTitle": ""}