{"organizations": [], "uuid": "ee4d7f829760c0b95d684a54c4e71964720dd485", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48524/entertainment", "section_title": "Entertainment - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30247899/nielsen-latinos-50-are-healthy-wealthy-and-wise", "country": "US", "title": "Nielsen: Latinos 50+ are Healthy, Wealthy and Wise", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Nielsen: Latinos 50+ are Healthy, Wealthy and Wise - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "ee4d7f829760c0b95d684a54c4e71964720dd485"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30247899/nielsen-latinos-50-are-healthy-wealthy-and-wise", "ord_in_thread": 0, "title": "Nielsen: Latinos 50+ are Healthy, Wealthy and Wise", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Nielsen\nNew study finds that older Hispanics are growing in numbers and influence, playing a central role in the purchasing decisions of several generations\nNEW YORK , Oct. 13, Hispanics over the age of 50 are a growing group in an increasingly younger multicultural society, and are exerting cultural, economic and political influence on the evolving U.S. mainstream, according to a Nielsen report released today. The report, The New American Vanguard: Latinos 50+: Healthy, Wealthy and Wise , reveals that while younger generations are garnering the bulk of media attention, Hispanics 50+ represent 10% of their age cohort in 2015 and are expected to grow to 42 million, or 24% by 2060. The report was released during a Town Hall event in New York City , hosted by Nielsen and the company's External Hispanic/ Latino Advisory Council-engaging Latino advocates, policy makers, marketers and professional community leaders-to discuss the growing importance of this consumer segment.\nThe New American Vanguard: Latinos 50+: Healthy, Wealthy and Wise provides insights on how Hispanics 50+ are responsible for much of the Hispanic population explosion, influence and power today in America. With a life expectancy of 83.5 years, compared to 78.7 for non-Hispanic Whites, this group is living longer and stands at the cross-section of major demographic and social trends. Incomes in households headed by older Latinos are also rising at a faster rate than those headed by younger counterparts. From 2005 to 2013, the percentage of households headed by Hispanics ages 50 to 69 making $100,000+ annually increased from 14% to 20%. In addition, the growing wealth of Hispanics 50+ has extended their influence in the buying and shopping decisions of increasingly multigenerational households.\n\"America is growing more and more diverse with younger generations commanding the attention, but in order to understand the Hispanic Millennial cultural influence, it's vital for marketers to understand the generation that precedes them,\" said Mónica Gil, Senior Vice President and General Manager, Multicultural Growth and Strategy, Nielsen. \"This report provides insights into one of the most influential multicultural consumer segments in the U.S. mainstream.\"\n\"Hispanics over the age of 50 have not aged out, but are aging up with an influence that extends to multiple generations. These are the original innovators, unsung influencers and true pioneers who laid the groundwork for the booming economic force that Latino consumers represent today,\" said Luis A. Miranda, Jr. , Nielsen External Hispanic/Latino Advisory Council Member. \"Nielsen has long been a champion for the importance of diverse and inclusive insights and data, and is uniquely positioned to help their clients to make fully informed, data-based decisions around multicultural consumers.\"\nHighlights of The New American Vanguard: Latinos 50+ include:\nPatriotic Swing Voters:\nHispanics 50+ will continue to see their political clout increasing in future elections as the size and growth of the Hispanic population fuels an overall rise in Hispanic voters; those 50+ could be the decisive swing vote in many local and state elections. Top issues in order of importance for registered Hispanic voters are education, employment, the economy, and healthcare. Nearly three-quarters (73%) consider immigration very important, or extremely important. The older Hispanic population is concentrated in four states: California , Texas , Florida and New York , which have 55, 38, 29 and 29 electoral votes respectively. Hispanics Have Health, Wealth and Time On Their Side:\nLatinos' Healthier Choices Leading to Longevity\nHispanics have lower mortality rates in seven out of the 10 leading causes of death in the U.S. In the first few years after immigrating to the U.S., Hispanics also tend to have lower smoking rates, better diet and better general health. This is translating to Hispanics living longer and having healthier, more active lives. Today Hispanic-Americans life expectancy is 83.5 years compared to 78.7 for non-Hispanic Whites. This means more buying and viewing power, for longer. Longer Lives and Earning Years Yield Financial Growth\nForty percent of Hispanics ages 55+ lived in multigenerational households in 2013, compared to just over a fifth of the total population in that age group. Communal living arrangements provide some significant mutual benefits when it comes to caring for children, cooking, transportation, and shopping. This means greater disposable income, more shared meals and family experiences as well as unique watching and buying behavior. Percentage of households headed by Hispanics ages 50-69 who earn 75,000+ saw a sharp increase from 2000 to 2013. All income brackets above $50,000 showed an increase, while the percentage of those earning incomes under $50,000 decreased. Buying and shopping decisions are communal decisions, led by older Hispanics and often relatives of other races and ethnicities extending and amplifying their shopping habits and choices across a wide spectrum of products and services. Shop \"Mas\" :\nOlder Hispanic shoppers buy more frequently than non-Hispanic. White peers in nearly 75% of all major fast-moving consumer goods departments– They make more trips to the store than non-Hispanic Whites. Plus, they are buying for all ages in their households. Hispanic Boomers over–index non-Hispanic White peers in seven of 11 departments (e.g., health and beauty aids, general merchandise, non-food grocery, packaged meat, dry grocery, fresh produce and alcoholic beverages). Total Hispanics and Hispanic Boomer households are similar in over-indexing in eight categories (e.g., meal starters, eggs, shelf juices, frozen meat/seafood, cosmetics, deodorant, baby food, refrigerated juices and skin care preparation). Hispanics 50+ are brand loyal consumers who provide a model for the spending habits of younger generations of Hispanics. Seventy-three percent of Hispanics 50+ often cook at home rather than eat out, compared to 62% of younger Hispanic adults. Traditional and Digital Media Mavens:\nHispanics ages 50-64 watch 162 hours of traditional TV each month. Hispanics 65+ watch a total of 230 hours per month, nearly doubling total Hispanic viewing for all ages of 121 hours. U.S.-born Hispanics 50+ say they are interested in watching live TV on their smartphone at a level 61% above non-Hispanic Whites 50+. Both younger and older Hispanics choose Facebook as their number one app. Hispanics ages 50-64 spend more time on Google Search, Gmail, Pandora and Google+ than those 18-49. For more details and insights, download The New American Vanguard: Latinos 50+: Healthy, Wealthy and Wise . To view and/or download a video based on insights from this report, click here .\nJoin the conversation on Facebook, Nielsen Community and Twitter, @NielsenKnows using #NielsenKnows.\nAbout Nielsen's Diverse Intelligence Series\nIn 2011, Nielsen launched the Diverse Intelligence Series, a robust portfolio of comprehensive reports which focus solely on multicultural consumers' unique consumption and purchasing habits.The series has become an industry resource to help brands better understand and reach ethnic customers. To learn more about Nielsen's Diverse Intelligence research series, visit www.nielsen.com/latinos .\nAbout Nielsen\nNielsen Holdings plc (NYSE: NLSN ) is a global performance management company that provides a comprehensive understanding of what consumers Watch and Buy. Nielsen's Watch segment provides media and advertising clients with Total Audience measurement services across all devices where content - video, audio and text - is consumed. The Buy segment offers consumer packaged goods manufacturers and retailers the industry's only global view of retail performance measurement. By integrating information from its Watch and Buy segments and other data sources, Nielsen provides its clients with both world-class measurement as well as analytics that help improve performance. Nielsen, an S&P 500 company, has operations in over 100 countries that cover more than 90 percent of the world's population. For more information, visit www.nielsen.com .\n releases/nielsen-latinos-50-are-healthy-wealthy-and-wise-300158376.html\n ", "external_links": ["http://rt.prnewswire.com/rt.gif?NewsItemId=CL26282&Transmission_Id=201510130900PR_NEWS_USPR_____CL26282&DateId=20151013", "http://www.prnewswire.com/news-releases/nielsen-latinos-50-are-healthy-wealthy-and-wise-300158376.html", "http://www.xmlnews.org/ns/", "http://www.nielsen.com/us/en/insights/reports/2015/the-new-american-vanguard-latinos-50-are-healthy-wealthy-and-wise.html", "https://twitter.com/nielsenknows", "https://www.facebook.com/NielsenCommunity", "http://www.youtube.com/watch?v=JYuiHpahJIc", "http://studio-5.financialcontent.com/prnews?Page=Quote&Ticker=NLSN", "http://www.nielsen.com/latinos", "http://www.nielsen.com/"], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-13T16:39:36.409+03:00", "highlightTitle": ""}