{"organizations": [], "uuid": "1d290baf433155fa07dfefe7e956ad73316d6da3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48524/c", "section_title": "Entertainment - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30189159/innovation-lives-here-original-bnn-series-the-disruptors-returns-for-season-2-october-8", "country": "US", "title": "Innovation Lives Here: Original BNN Series THE DISRUPTORS Returns for Season 2, October 8 - CBS", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Innovation Lives Here: Original BNN Series THE DISRUPTORS Returns for Season 2, October 8 - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "1d290baf433155fa07dfefe7e956ad73316d6da3"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30189159/innovation-lives-here-original-bnn-series-the-disruptors-returns-for-season-2-october-8", "ord_in_thread": 0, "title": "Innovation Lives Here: Original BNN Series THE DISRUPTORS Returns for Season 2, October 8 - CBS", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " BNN\n– Co-Hosts Amber Kanwar and Bruce Croxon return with fresh insight on the tech innovators who are disrupting established industries and changing the way people live –\n– All-new interactive component allows viewers to vote for Top Disruptor and offers chance to pitch Croxon's investment company, Round 13 ­–\nTo tweet this release: http://bmpr.ca/1Og0zPJ\nTORONTO , Oct. 5, 2015 /CNW/ - Uber creating cabbie riots. Facebook and Google redefining the advertising market. Over-the-top services that turn every device into a TV. And apps that turn every home into a hotel. The pace of disruption is accelerating at breakneck speed, and the only way to stay on top of it is to know what's next before it hits. Airing Thursdays at 5:30 p.m. ET beginning Oct. 8 , THE DISRUPTORS returns to BNN for its second season, charting the latest emerging technology trends and tracking game-changing innovations like no other television program in Canada . BNN Anchor and Reporter Amber Kanwar , along with digital pioneer and entrepreneur Bruce Croxon , return to helm the weekly, half-hour program.\nEach week, the duo reviews pitches from Canadian start-ups, providing expert advice, insight, and analysis. In addition to identifying the big tech trends rocking the worlds of information, transportation, finance, and workplace, THE DISRUPTORS introduces an exciting new interactive component, allowing viewers to vote for Top Disruptor. The start-up that is chosen will get a chance to be spotlighted on the program and given the opportunity to pitch Croxon's investment company, Round 13.\n\"Anyone who's ever dreamed about quitting their job and striking out on their own needs to watch THE DISRUPTORS ,\" said Grant Ellis , General Manager, BNN. \"This show isn't just for innovators; Bruce and Amber dig up the next life-changing technologies, the personalities who drive them, and the tactics to build the next big thing. The show is also interactive and open source, inviting viewers to visit THE DISRUPTORS website to vote for their favourite 'Top Disruptor' and see highlights from the show.\"\n**Media Note** Photography for THE DISRUPTORS available online at BellMediaPR.ca .\nEach week, THE DISRUPTORS speaks with CEOs of Canadian and international technology companies who share their own success stories, along with their thoughts on the risks faced by start-ups fighting for traction.\nLong before social networking became an underpinning of modern society, Croxon was making his mark as a digital pioneer, co-founding the dating website Lavalife in 1987, consequently revolutionizing how people connect. Under his direction, Croxon grew this early tech start-up from four to 600 employees, creating a marquee brand of online dating with more than 200 million users and nearly $100 million in revenue. Since then, Croxon has earned success as an investor and advisor in early-stage companies in the technology and hospital sectors. A familiar face to Canadian viewers, Croxon was a judge on the hit television program DRAGON'S DEN from 2011 to 2014. His latest endeavor is as Principal in Round 13 Capital, a firm investing in the Canadian high-tech field looking to find and create the next wave of disruptors.\nBNN's Kanwar specializes in equity markets and is constantly digging for stocks flying under the radar, recognizing trends that are about to emerge, and curating research to make it accessible to viewers. Kanwar has interviewed CEOs from across the continent, from BlackBerry's John Chen to Marriott CEO Arne Sorenson , and brings the day's biggest business stories to viewers on BNN, CP24, and CTV News Channel. She's an expert at finding the big deals before they are announced and bringing those scoops to viewers.\nTHE DISRUPTORS is produced by BNN, with additional research provided by BetaKit , the nation's foremost source for Canadian start-up news and tech innovation.\nTHE DISRUPTERS can also be seen Thursdays at 7 p.m. ET and 11 p.m. ET on BNN.\nAbout BNN\nBNN – Business News Network is Canada's only English-language television and digital service devoted to helping Canadians invest, build their businesses, and protect their families' financial well-being. Along with 12 hours of market coverage, regular news updates, and direct access to the country's top financial minds, the network features the only televised stock ticker with real-time data from the TSX, NYSE, and NASDAQ. BNN delivers real-time content across market-leading digital platforms including up-to-the-minute business news, newsmaker interviews, and stock market analyses online at BNN.ca . Listen to BNN live every weekday on SiriusXM entertainment channel Canada Talks (167) at 9 a.m. ET , and 6 p.m. ET , and catch BNN business news reports in syndication on Bell Media Radio and other participating radio stations. BNN is a division of Bell Media, which is part of BCE Inc. (TSX, NYSE: BCE), Canada's largest communications company.\nSOCIAL MEDIA LINKS:\nTwitter:\n@BNN\n@DisruptorsBNN\n@AmberKanwar\n@Bruce_Croxon\nFacebook:\nwww.facebook.com/BNNTV\n- BNN -\n ", "external_links": ["http://www.facebook.com/BNNTV", "http://www.bnn.ca/Shows/the-disruptors.aspx", "https://mobile.twitter.com/disruptorsbnn", "http://www.xmlnews.org/ns/", "https://twitter.com/bruce_croxon", "http://bellmediapr.ca/", "http://www.bnn.ca/", "http://bmpr.ca/1Og0zPJ", "https://twitter.com/BNN", "http://rt.prnewswire.com/rt.gif?NewsItemId=C5947&Transmission_Id=201510051350CANADANWWEB______C5947&DateId=20151005", "https://twitter.com/amberkanwar", "http://betakit.com/"], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-05T23:08:59.575+03:00", "highlightTitle": ""}