{"organizations": ["COHEN AP Entertainment Writer"], "uuid": "f1484ee65a0f1d57f32c00b981495cbe00a0bb26", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribtown.com", "main_image": "http://cdn1.tribtown.com/st_assets/images/the_tribune_sq.jpg", "site_section": "http://tribtown.com//feed/sec/7000", "section_title": "TribTown.com - Entertainment News", "url": "http://www.tribtown.com/view/story/f38a61610b844c6a91a3cbfbc0c926a6/US--Women-In-Hollywood", "country": "US", "title": "Hayek, Schumer, DuVernay celebrate success, call for equality at Elle's Women in Hollywood", "performance_score": 0, "site": "tribtown.com", "participants_count": 0, "title_full": "Hayek, Schumer, DuVernay celebrate success, call for equality at Elle's Women in Hollywood", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T12:42:00.000+03:00", "replies_count": 0, "uuid": "f1484ee65a0f1d57f32c00b981495cbe00a0bb26"}, "author": "", "url": "http://www.tribtown.com/view/story/f38a61610b844c6a91a3cbfbc0c926a6/US--Women-In-Hollywood", "ord_in_thread": 0, "title": "Hayek, Schumer, DuVernay celebrate success, call for equality at Elle's Women in Hollywood", "locations": ["Hollywood By SANDY", "Hollywood Hayek"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Schumer", "Hayek", "DuVernay", "Elle"], "text": "Hayek, Schumer, DuVernay celebrate success, call for equality at Elle's Women in Hollywood By SANDY COHEN AP Entertainment Writer   20, 2015 - 5:42 amLast Updated: October 20, 2015 - 5:42 am   \nPeople: \nCalifornia (1459) \nLOS ANGELES — Mary J. Blige asked Ava DuVernay to be her friend. Lena Dunham compared Amy Schumer to Oprah. Meryl Streep told Carey Mulligan her voice sounds \"like warm caramel poured over the English language.\" And Salma Hayek gave everyone a painting of a butterfly. \nIt was a starry lovefest at Elle magazine's 22nd Women in Hollywood celebration Monday night at the Four Seasons Hotel, but it was also a call for equality. \nEditor-in-chief Robbie Myers said Hollywood's vast gender disparities — 95 percent of studio movies are made by men — prove such nights are still needed. The annual event recognizes women for their accomplishments in the entertainment industry. \n\"Did you know the lowest paid male actor on the Forbes list was still ranked above the highest paid female actor on the same list?\" she said. \nBlige introduced DuVernay, who illustrated the gender gap with an anecdote about a fellow director. They both had features at the 2012 Sundance Film Festival and were taking on their first big-budget projects. \n\"I got a big movie,\" she remembered telling him, talking about the $20 million budget for \"Selma.\" \nHe said he had gotten a big movie, too. It was \"Jurassic World.\" \n\"Now... he'll go off and do 'Star Wars,' and I'm happy for him,\" DuVernay said of her friend Colin Trevorrow. \"But think about the women who were also in that class at Sundance 2012.\" \nHonoree Mulligan said that until she made her latest film, \"Suffragette,\" in which Streep appears, the best parts for women were always \"a really great female role in a story about a man.\" \n\"Imagine how many millions of women's stories there are for us to tell,\" Mulligan said. \nDunham introduced Schumer. In describing how the comedian inspired women, Dunham said: \"She's like Oprah, if Oprah squashed her boobs together more.\" \nSchumer dedicated Anne Sexton's poem \"Admonitions to a Special Person\" to the audience as she accepted her award. \nHayek, who was introduced by Zoe Saldana, said this generation of women can change Hollywood. The butterfly painting, she said, represents transformation. \nKate Winslet, Dakota Johnson, Alicia Vikander and Gena Rowlands were also recognized Monday, though Rowlands did not attend. The honorees are featured in the magazine's November issue. \nFollow AP Entertainment Writer Sandy Cohen at http://www.twitter.com/APSandy . \nAll content copyright ©2015 The Tribune, a division of Home News Enterprises unless otherwise noted.", "external_links": [], "published": "2015-10-20T12:42:00.000+03:00", "crawled": "2015-10-20T13:22:40.730+03:00", "highlightTitle": ""}