{"organizations": [], "uuid": "c7286f3921b38cf7a1ef226960c902ba79abda07", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mid-day.com", "main_image": "http://images.mid-day.com/images/2015/jun/24Virender-Sehwag-l.jpg", "site_section": "http://www.mid-day.com/Resources/midday/rss/entertainment.xml#", "section_title": "entertainment", "url": "http://www.mid-day.com/articles/btown-celebs-will-miss-the-bravest-cricketer-virender-sehwag-on-field/16623196", "country": "IN", "title": "B-Town celebs will miss the 'bravest' cricketer Virender Sehwag on field", "performance_score": 0, "site": "mid-day.com", "participants_count": 1, "title_full": "B-Town celebs will miss the 'bravest' cricketer Virender Sehwag on field - Entertainment", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "c7286f3921b38cf7a1ef226960c902ba79abda07"}, "author": "IANS", "url": "http://www.mid-day.com/articles/btown-celebs-will-miss-the-bravest-cricketer-virender-sehwag-on-field/16623196", "ord_in_thread": 0, "title": "B-Town celebs will miss the 'bravest' cricketer Virender Sehwag on field", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "As Indian batting great Virender Sehwag announced his retirement from international cricket on Tuesday, many Bollywood celebrities like Shah Rukh Khan, Manoj Bajpayee, Anupam Kher and Paresh Rawal thanked the \"bravest\", \"coolest\" and \"fearless\" cricketer for several glorious moments on the field.\nSehwag, who made his international debut in 1999 and played his last match for India in 2013, announced his retirement via Twitter.\n\"Thanks everyone for all your wishes and love. I hereby retire from all forms of international cricket and from the Indian Premier League (IPL),\" Sehwag tweeted.\nSince his retirement news broke out, many celebrities took to the micro-blogging site to bid adieu to Sehwag.\nHere's what the celebrities tweeted:\nShah Rukh Khan: Will miss you on the field yaar @virendersehwag. You are the gentlest, coolest and bravest of sportsmen I have ever come across. Love and health to you.\nManoj Bajpayee: One of my biggest favourites @viredersehwag retires today. Someone who changed the nature of batting in test and one day. Will miss you viru.\nAnupam Kher: Thank you @virendersehwag for giving us millions of glorious moments on the cricket field. We will miss you. Have a great life ahead.\nParesh Rawal: Virender Sehwag had Tendulkar's class...Ganguly's aggression...Fearless player. Great entertainer. Good luck for future endeavours #ThankYouSehwag.\nKaran Wahi: From G block school in Vikas Puri to the biggest stadiums..nothing changed ...He just tore apart every opposition ..Thank You @virendersehwag\nMasaba Gupta: One of my favorite cricketers announces his retirement @virendersehwag ! Feel like one part of my memory of Indian cricket is fading.\nGaurav Kapur: Every cricketer he played with has a joyous story about @virendersehwag. That's also what he gave us fans, pure unbridled joy! #HBDSehwag.\nRandeep Hooda: \"#ThankYouSehwag for all the entertainment and simple brilliance. An era has sadly come to an end. There will never be another. @virendersehwag.\"\nSiddharth: \"Dear #Viru a huge part or my life in my 20s was spent watching you become a legend. I'm going to miss your masterclass. Be well gentle sir!,\"", "external_links": [], "published": "2015-10-21T03:00:00.000+03:00", "crawled": "2015-10-21T11:06:03.157+03:00", "highlightTitle": ""}