{"organizations": [], "uuid": "284d5942e25a31b1d6c95b6081de95c42697d2f6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.heraldscotland.com", "main_image": "http://www.heraldscotland.com/resources/images/4343928/", "site_section": "http://www.heraldscotland.com/arts_ents/", "section_title": "Arts and Entertainment | Herald Scotland", "url": "http://www.heraldscotland.com/arts_ents/13876024.Margaret_Thatcher__saint_or_she_devil_/", "country": "GB", "title": "Margaret Thatcher: saint or she-devil?", "performance_score": 0, "site": "heraldscotland.com", "participants_count": 1, "title_full": "Margaret Thatcher: saint or she-devil? (From Herald Scotland)", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T07:10:00.000+03:00", "replies_count": 0, "uuid": "284d5942e25a31b1d6c95b6081de95c42697d2f6"}, "author": "Rosemary Goring", "url": "http://www.heraldscotland.com/arts_ents/13876024.Margaret_Thatcher__saint_or_she_devil_/", "ord_in_thread": 0, "title": "Margaret Thatcher: saint or she-devil?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "THE first rule of judging a biography must be to review the book rather than the subject. This is necessary in the case of Margaret Thatcher, saint of enterprise or she-devil of uncaring capitalism.\nThe second rule is surely to gauge the author as, in all tales, one must always consider the source. Charles Moore, a former editor of the Daily Telegraph, was chosen by Thatcher to write the biography and given access to her papers. This does not of itself make him partisan but he was picked for a reason and it was not because he was Alexei Sayle with received pronunciation or had learned of Thatcherism at the knees of his father at a Barnsley pithead.\nHe has produced a lucid, sometimes dramatic and brilliantly comprehensive account of the period from 1983 to 1988, picking up from the Conservative leader’s second election victory and stopping as she enters Downing Street for the third time. A third volume, now in production, will take Thatcher to political defeat and death, though the first two books suggest the former was the more dreadful fate for an extraordinary subject.\nThe strength of this massive project is that Moore writes with the insight of the observer, the knowing appraisal of one of those who met Thatcher, argued with her, agreed with her and watched her pursue her agenda relentlessly if not always consistently. This is the Old Etonian intellectual picking through the debris of history for something of substance, something that has to be preserved, even honoured.\nPromoted stories The weakness is that Moore is detached from the reality of Thatcherism far from the metropolis. He reflects, for example, that Thatcher had “a somewhat uneasy relationship with Scotland’’. This is true in the same way that Tom had issues with Jerry.\nIt is a testimony to Thatcher’s unflagging energy and to the demands of modern politics that her second tenure as prime minister included such challenges as nuclear talks, detente with Russia, the Anglo-Irish agreement, the invasion of Grenada, privatisation, the Westland helicopter fiasco that remains obscure but once brought her down, the miners’ strike and the birth of the poll tax. She was also the target of an assassination attempt by the IRA and had to be evacuated from the rubble of a Brighton hotel.\nShe emerges suitably battle-scarred and defiant from Moore’s second volume. She remains, though, obscured by the fog of war that she waged on the political battlefield. Moore is a devoted and conscientious biographer but he confesses that the precepts of Thatcherism are \"strong but vague’’. He can do no more than to state that Thatcherism opposed big government, high taxes, high deficits, the political power of trade unions. She was, he writes almost lamely, in favour of individual opportunity, free markets, nuclear weapons. “Thatcherism was more like a vision than a doctrine,” he says.\nRobin Butler, her principal permanent secretary, says in the book: “One of her great strengths was her single-mindedness and her absolute refusal to see that there could be any other side to any case.” This is the ambiguity of Thatcher in a civil servant’s nutshell. There will be those who protest that not seeing the other side of the argument may rather be a weakness. Certainly, this trait contributed significantly to her downfall that has its roots in volume two, which covers her ritual humiliation of her Ministers and her advocacy of the poll tax. The execution will take place in volume three.\nHer single-mindedness has produced differing views. Was privatisation a way to increase shareholders or a wizard wheeze to raise money by selling the public what it already owned? Was the defeat of the unions a step to freedom or the first precursor of the modern Britain of zero-hour contracts and vastly reduced workers’ rights? Was the selling of council houses a wonderful breakthrough in home ownership or a disastrous policy that has impacted severely on the chance of many to have their own home? Was her championing of the free market a battle cry for the City or the starting pistol for the sort of behaviour that will have our grandchildren and beyond paying for the vile, reckless excesses of bankers?\nThe answers will be made according to circumstance and politics. It is, though, possible to be dogmatic on some Thatcher matters. She was known as the Iron Lady but was far from unbending in matters of principle. For example, she fought a war for sovereignty in Falklands but rolled over when the sovereignty of Grenada was sacrificed to an invasion by the USA. She said in reference to the IRA that she would never negotiate with terrorists. Her government negotiated with the PLO. She extolled the principle of honesty but one close aide admits, \"there was a whiff of corruption” with her government’s arms dealing in the Middle East that involved her son, the reliably feckless and troublesome Mark.\nBut, then again, her view on this subject was clear. “If countries want to be armed, better they be armed by the British,” she said,\nMoore may reach different conclusions from some readers but the journey in all subjects is inclusive in that he is admirably clear and blessedly brisk. He has the ear for excellent Quote: s and the eye for fascinating detail. The search for Thatcher’s drive and motivation may, as it is suggested, owe much to her upbringing and to have never \"known the full force of sexual passion or unguarded love”. This is the view of an aide rather than of the author. Moore is more circumspect but his use of her words and of scenes she inhabited is surely revealing.\n“He is a German,” said Thatcher with some asperity about Helmut Kohl. She was similarly infuriated with the French at a European negotiation. “We saved all their necks in the war,” she said of their infuriating intransigence. Much worse was her reaction to the tragedy of the Vietnamese boat people, a precursor of today’s refugees from war: “Well, people do go on cruises don’t they?”\nIt is oddly remarkable that she could never spell Mitterrand, could not pronounce the name of the Irish parliament, and insisted Godot should be pronounced with a finally t because “that is the way it is spelled”. Other curiosities include her carrying of a torch in her handbag after the escape from her bombed suite in Brighton, her bodyguard being instructed to carry her high heels in his pocket when she went walkabout, and her ability to confront great issues while being demoralised by relatively minor slights.\nShare article Moore cannot claim to understand her but he does place her not only in history but in scenes of poignancy, drama and humour. There is the moment when she is spotted after a minor operation alone in a hospital bed clutching the teddy bear given to her by her administrative staff. There is the occasion where she sits uncomfortably close to a spittoon enthusiastically used by Deng Xiaoping. But despite these glimpses of humanity, Thatcher remains a force rather than a defined personality.\nMoore points to her compassion in writing in support to the wife of a working miner during the 1984 strike, sending the letter in an unmarked envelope so the recipient would not be targeted for abuse. There is thoughtfulness in this but also a lack of self-awareness. There will be those who argue the gesture says much about the striking miners. But it also says much about Thatcher and her works. The prime minister of the country, the ruler of all she surveyed, could not be identified on an envelope for fear of endangering a supporter. The Thatcher dichotomy was obvious then. It remains.", "external_links": ["https://twitter.com/share?url=", "https://www.facebook.com/sharer/sharer.php?u="], "published": "2015-10-17T07:10:00.000+03:00", "crawled": "2015-10-17T04:44:29.165+03:00", "highlightTitle": ""}