{"organizations": [], "uuid": "46d4f75f01874b233df6983345592917b1e6cd31", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.deseretnews.com", "main_image": "http://img.deseretnews.com/images/article/hires/1611912/1611912.jpg", "site_section": "http://www.deseretnews.com/family/arts-entertainment/index.rss", "section_title": "The latest entertainment, arts, movie reviews, music reviews, video game reviews and book reviews - Deseret News", "url": "http://www.deseretnews.com/article/865639205/Book-review-All-Hallows-Eve-Collection-is-a-handful-of-eerie-love-stories.html?pg=all", "country": "US", "title": "Book review: 'All Hallows' Eve Collection' is a handful of eerie love stories", "performance_score": 0, "site": "deseretnews.com", "participants_count": 0, "title_full": "Book review: 'All Hallows' Eve Collection' is a handful of eerie love stories", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T02:00:00.000+03:00", "replies_count": 0, "uuid": "46d4f75f01874b233df6983345592917b1e6cd31"}, "author": "", "url": "http://www.deseretnews.com/article/865639205/Book-review-All-Hallows-Eve-Collection-is-a-handful-of-eerie-love-stories.html?pg=all", "ord_in_thread": 0, "title": "Book review: 'All Hallows' Eve Collection' is a handful of eerie love stories", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Annette Lyon", "Lisa Mangum", "Elana Johnson", "Jordan McCollum", "Heather B. Moore", "Sarah Eden"], "text": "Published: Saturday, Oct. 17 2015 5:00 p.m. MDT Updated: 22 hours ago \"A Timeless Romance Anthology: All Hallows' Eve Collection\" is a collection of short stories by Sarah Eden, Lisa Mangum, Annette Lyon, Jordan McCollum, Heather B. Moore and Elana Johnson. Mirror Press View 7 photos » Summary \nSix authors come together to create a ghostly bunch of romantic stories just in time for Halloween in \"A Timeless Romance Anthology: All Hallows' Eve Collection.\" \n\"A TIMELESS ROMANCE ANTHOLOGY: All Hallows’ Eve Collection ,\" by Sarah Eden , Annette Lyon , Heather Moore, Lisa Mangum , Jordan McCollum and Elana Johnson , Mirror Press, e-book $4.99 (f) \nOn the cusp of the Halloween season, six popular storytellers have assembled a cluster of tales in the growing Timeless Romance Anthology family with the new “All Hallows’ Eve Collection.” \nBringing a taste of the ethereal to these romantic offerings, veteran anthology authors Sarah Eden, Annette Lyon and Heather Moore team with the voices of Lisa Mangum, Jordan McCollum and Elana Johnson to stage six eerie but intriguing tales of love. \nEden begins the collection with “Of Ghosts and Gardens.” When an aristocratic newcomer investigates a ghost in a Welsh garden, his attentions are quickly captured by the lovely but overlooked daughter of the humble homeowner. \nIn “It’s You,” Lyon spins a tale of two young members of The Church of Jesus Christ of Latter-day Saints living in American Fork who are mysteriously drawn to each other after being shadowed by an unfamiliar spirit that seems to know them intimately. \nMoore’s contribution, “Sophia’s Curse,” delves into the 19th-century lives of two orphaned children — one wealthy, one raised in an obscure abbey — living under the heavy shadow of a deadly curse. \nMangum’s tale takes place on a cruise ship. “The Siren’s Song” shares the story of a ship’s doctor mourning the loss of his wife. But when he saves a drowning child, events take a terrifying turn, and creatures in the water become more than just figments of his imagination. \n“The Man of Her Dreams” is McCollum’s chilling tale of a lovely homicide detective whose dreams foreshadow murders in her quiet town. But when the dreams abruptly change and the detective’s ex-boyfriend wades into the center of a new crime, her otherwise organized world is overcome by horror. \nCapping off the collection, Johnson offers “The Ghost of Millhouse Mansion.” This contemporary piece weaves together the lives of a talented interior designer and a reclusive, troubled rich boy as they both face the spectral figures that haunt the past and the present but center on a distressed mansion. \nEach of the six tales has a commanding voice of its own. The stories stand alone, and varying tones and timbres make each feel fresh and vibrant. Packaged together, they make a lively read and a perfect treat for romance lovers searching for a bite of something sweet this Halloween. \nThe stories contain no swearing, sexual content or described violence. \nIf you go ... \nWhat: A book signing and murder mystery dinner with the authors of \"All Hallows' Eve Collection\" \nWhen: Tuesday, Oct. 20, 6 p.m. public reception; 7 p.m. dinner and mystery \nWhere: Northampton House, 198 W. 300 North, American Fork \nTickets: $28 for dinner and mystery Melissa DeMoux is a stay-at-home mother of six young children who lives in West Valley City, Utah. Her email is mddemoux@gmail.com , and she blogs about her adventures in motherhood at demouxfamily.blogspot.com . Recommended Stories", "external_links": [], "published": "2015-10-18T02:00:00.000+03:00", "crawled": "2015-10-18T02:34:34.552+03:00", "highlightTitle": ""}