{"organizations": [], "uuid": "24e061a4be2b7f118bf58a3bd48e12683e5ace30", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.herald.co.zw", "main_image": "", "site_section": "http://www.herald.co.zw?cat=17&feed=rss2", "section_title": "The Herald » Entertainment", "url": "http://www.herald.co.zw/musicians-to-honour-tongai-moyo/", "country": "US", "title": "Musicians to honour Tongai Moyo", "performance_score": 0, "site": "herald.co.zw", "participants_count": 1, "title_full": "Musicians to honour Tongai Moyo", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T01:02:00.000+03:00", "replies_count": 0, "uuid": "24e061a4be2b7f118bf58a3bd48e12683e5ace30"}, "author": "silence muchemwa", "url": "http://www.herald.co.zw/musicians-to-honour-tongai-moyo/", "ord_in_thread": 0, "title": "Musicians to honour Tongai Moyo", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "October 13, 2015 silence muchemwa Entertainment The late Tongai Moyo Sophia Chese Arts Correspondent All is now in place for the annual Dhewa Commemoration shows to celebrate the life of the late sungura musician Tongai Moyo. The shows will take place over two weekends in Harare, Chinhoyi, Kwekwe and Kadoma. Peter Moyo will join hands with musicians such as Jah Prayzah, Suluman Chimbetu, Tocky Vibes, Seh Calaz and Killer T for the shows. In separate interviews, the musicians concurred that Tongai, who was popularly known as Dhewa, was a gifted musician and they would celebrate his life in a big way. Suluman Chimbetu, through his publicist Joe Nyamungoma, said Dhewa was one of the musicians that inspired many young artistes. “He has inspired a number of musicians in the country and his life is worth celebrating,” said Nyamungoma. Kinna a dancehall musician said he was happy to be one of the musicians who will perform at the commemorations. “I did not work with him (Dhewa) but I like his music. We need to respect our elders in the music industry,” he said. Jah Prayzah, through his manager Keen Mushapaidze, said he was happy to be part of this year’s commemorations and promised to give his best. Peter said they have decided to have the commemorations running for two weeks due to demand from Utakataka express fans. “For the past years fans have been complaining of commemorations in a few cities, so this year we want to satisfy our fans from different areas hence we will be moving from Harare , Chinhoyi, Kwekwe and Kadoma,” he said. Peter also hailed different artistes who have pledged to perform on the commemorations. “Musicians from different genres will be performing. We are starting with a commemoration party to be held on Thursday at Dandaro Inn in the capital where different artists will converge. On Friday we are going to have Zimdancehall versus sungura affair during the commemoration shows at Mushandirapamwe in the capital and at CSC in Chinhoyi,” he said. They will wrap up the first commemorations with a family show at the Jongwe Corner where contemporary musician Jah Prayzah and Jean Masters will also perform. The “Young Igwe” as he is affectionately known, thanked his father’s fans who have trusted and stood with him since Dhewa’s death. He also thanked his own fans who have accepted him since he took over Utakataka Express. “The road has not been a bed of roses but I would like to thank everyone who has stood with me since the passing on of my father. My fans are mixed since some are my late father’s loyal fans and some are my own fans who have been supporting me,” he said. “I am happy that the full band Utakataka Express that my father left is now intact with everyone now with one goal to continue building the brand and taking it to another level. We are happy to work together and we are glad other musicians are supporting us.” Dhewa rose to fame in the late 1990s and hits such as “Samanyemba”, “Naye”, “Muchina Muhombe” and “Ndazvimba Mapapu” among others catapulted him to national, regional and international fame. He released 14 albums in a career spanning over two decades. He succumbed to non Hodgkin’s lymphoma at St Anne’s Hospital on the evening of October 15, 2011 in Harare.", "external_links": [], "published": "2015-10-13T01:02:00.000+03:00", "crawled": "2015-10-13T04:12:13.765+03:00", "highlightTitle": ""}