{"organizations": [], "uuid": "89af9d1c52391a1de078d4293b92c3f15604b5d4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mid-day.com", "main_image": "", "site_section": "http://www.mid-day.com/Resources/midday/rss/entertainment.xml#", "section_title": "entertainment", "url": "http://www.mid-day.com/articles/actress-maureen-ohara-dies-at95/16633156", "country": "IN", "title": "Actress Maureen O'Hara dies at 95", "performance_score": 0, "site": "mid-day.com", "participants_count": 1, "title_full": "Actress Maureen O'Hara dies at 95 - Entertainment", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T02:00:00.000+02:00", "replies_count": 0, "uuid": "89af9d1c52391a1de078d4293b92c3f15604b5d4"}, "author": "IANS", "url": "http://www.mid-day.com/articles/actress-maureen-ohara-dies-at95/16633156", "ord_in_thread": 0, "title": "Actress Maureen O'Hara dies at 95", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Los Angeles:  Irish actress Maureen O'Hara, who starred in a series of American films, including 'Miracle on 34th Street', 'The Quiet Man' and 'The Parent Trap', is no more. She was 95.\nOne of the last surviving stars of Hollywood's golden age, the actress was often described 'fiery', and she displayed her versatility in such works as 'How Green Was My Valley' and 'Our Man in Havana'. She died on Saturday at her home in Boise, Idaho, and is survived by a daughter and a grandson, reports variety.com.\nO'Hara's movie career began thanks to Charles Laughton.\nWhile she was still a teenager, he viewed a screen test she had made and he and partner Erich Pommer signed her on to a seven-year contract with their company, Mayflower Films.\nO'Hara had small roles in a couple of English films made in 1938 but made her first significant bigscreen appearance was in Alfred Hitchcock's Gothic actioner 'Jamaica Inn,' starring Laughton.\nShe worked with directors ranging from Hitchcock to Chris Columbus, but is best remembered for her works with John Ford, particularly in her pairings with John Wayne, such as 'Quiet Man.'\nShe was one of the few Wayne co-stars who could prove her match in screen presence.\nHer 'Quiet' character is prideful and stubborn, strong and intelligent, the emblematic O'Hara role.\nOne of her best performances was in the 1940 proto-feminist film 'Dance Girl Dance,' directed by Dorothy Arzner and also starring Lucille Ball.\nIn 2014, the Academy of Motion Picture Arts & Sciences presented her with an Honorary Oscar at the Governors Awards.\nO'Hara was born Maureen FitzSimons in Ranelagh, a suburb of Dublin.\nAlong with several of her siblings, she received training in drama and dance. She began appearing in amateur theatre at the age of 10, and at 14 she was accepted to the Abbey Theater, where she began pursuing classical theatre and operatic singing.\nO'Hara made her last screen appearance in the 2010 Irish documentary 'Dreaming the Quiet Man.'\nHer autobiography, ' 'Tis Herself,' was published in 2004. In April 2014 the actress appeared at the TCM Classic Film Festival in Hollywood.", "external_links": [], "published": "2015-10-26T02:00:00.000+02:00", "crawled": "2015-10-26T05:51:09.232+02:00", "highlightTitle": ""}