{"organizations": [], "uuid": "f69577cfda325850698896a0d6c40b0ea1c200e5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thenewstribune.com", "main_image": "http://www.thenewstribune.com/entertainment/restaurants/tnt-diner/idht1e/picture39569010/ALTERNATES/LANDSCAPE_1140/go_fish%20(2)", "site_section": "http://www.thenewstribune.com/entertainment/?widgetName=rssfeed&widgetContentId=712015&getXmlFeed=true", "section_title": "Entertainment news | TheNewsTribune.com &", "url": "http://www.thenewstribune.com/entertainment/restaurants/tnt-diner/article39569013.html", "country": "US", "title": "Fish and chips restaurant, mid-century lounge coming to Tacoma’s Sixth Avenue", "performance_score": 0, "site": "thenewstribune.com", "participants_count": 1, "title_full": "Fish and chips restaurant, mid-century lounge coming to Tacoma’s Sixth Avenue", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T08:00:00.000+03:00", "replies_count": 0, "uuid": "f69577cfda325850698896a0d6c40b0ea1c200e5"}, "author": "Sue Kidd \nStaff writer", "url": "http://www.thenewstribune.com/entertainment/restaurants/tnt-diner/article39569013.html", "ord_in_thread": 0, "title": "Fish and chips restaurant, mid-century lounge coming to Tacoma’s Sixth Avenue", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Fish and chips restaurant, mid-century lounge coming to Tacoma’s Sixth Avenue \nFish Fish Fish: catfish, cod and halibut \nExpect a 2016 opening for The Boom Boom Room \nNaccarato will tap Tacoma chefs for collaboration TNT Diner \nTNT Diner Sue Kidd has the latest South Sound restaurant news, with openings & closings, recent reviews and more. Fish Fish Fish is a fish and chips haunt from the owners of Shake Shake Shake. The restaurant is expected to open around mid-December in Tacoma’s Sixth Avenue neighborhood. Sue Kidd Staff writer i \nThe owners behind the Stadium neighborhood’s Shake Shake Shake are opening a fish-and-chips restaurant and an adjacent lounge in Tacoma’s Sixth Avenue neighborhood. \nLike its sister restaurant, the fish-and-chips place carries a name in triplicate. \nFish Fish Fish is expected to open in mid-December if construction progresses as planned. Owners Robert Stocker and Steve Naccarato will operate the business with Stocker’s sister, Suzanne Roberson. \nFollowing the opening of Fish Fish Fish, a separate business — a lounge called The Boom Boom Room — will open next door, but more on that lounge in a moment. \nThe restaurant will be something like what Shake Shake Shake offers, but replace burgers, fries and shakes with fried fish, chips and Caesar salad. \nNaccarato said the neighborhood is in need of a casual fish-and-chips joint. “Geographically there isn’t a real go to fish-n-chips place, and it’s one of those foods, like burgers, that we love and wanted to try and do really well.” \nNaccarato described, via email, a decor and style similar to the arty-looking Shake Shake Shake, which carries a retro burger joint theme with a dining room outfitted in a vivid aqua and orange palette and striking, so to speak, retro scoop chairs from the old Elks bowling alley . \nNaccarato added, “(There will be) similar colors and logo, fun, casual. And the goal is to do with fish what we are doing with burgers.” \nHe described a menu of classic recipes with modern twists, just as the duo do with their roadside-style burgers and shakes at Shake Shake Shake. \nExpect to find catfish, cod and halibut with a variety of coatings, including a British style breading, a cornmeal batter and a panko (and possibly matzo) breading. There also will be fish tacos. Naccarato also mentioned something Brits will line up for — mushy peas. \nNaccarato said, “We will also offer a house-made chowder and my famous Caesar salad.” That famous Caesar salad was called Steve’s Caesar when it was on the menu at the Beach House at Purdy, which Naccarato previously operated with his brother Gordon Naccarato, co-owner of Tacoma’s Pacific Grill , Smoke + Cedar and Classics by Pacific Grill . \nNaccarato said the salad is a recipe he borrowed from Los Angeles chef Michael Roberts, a former co-worker when the duo worked at Trumps restaurant. \nAs for The Boom Boom Room, that’s a project with an expected mid-2016 opening. \nNaccarato described the lounge, “The Boom Boom Room will be a mid-century styled interior. An intimate space about the size of Hilltop Kitchen . The name developed as we discussed what we wanted the bar to be. A retro bar, highly stylized with a feeling of 1960s Palm Springs-Los Angeles-Miami Beach-Las Vegas, without being kitschy, but fun.” \nLakewood architect Dan Kinkella, who designed downtown Tacoma’s Indochine and Indo Asian Street Eatery, will design the lounge. Naccarato added that they’ve recruited artist friends to design custom booths. \nThe Boom Boom Room is a rif on a lounge of the same name at Miami’s Fontainebleau Hotel . “This is where all the big-time entertainers (Sinatra, Elvis, etc.) used to play when they went to Miami, and it’s still one of the swankiest places down there,” he said. \nThe Boom Boom menu is still in the works, but Naccarato gave a sneak peak. “We will have a slider-centric menu, flatbreads, a charcuterie plate and other small plates and things easily shared. No big entrees.” \nHe added, “Our chef and foodie friends will collaborate on the menu. Most of the sliders will be recipes from former chefs that worked for us along the way: Matt Colony, Tiaunnah Knox, Hudson Slater, chef-friends of Robert’s… .” \nNaccarato added, “I’ll squeeze my brother for a recipe or two, of course.” \nSue Kidd: 253-597-8270", "external_links": [], "published": "2015-10-19T08:00:00.000+03:00", "crawled": "2015-10-19T18:08:05.720+03:00", "highlightTitle": ""}