{"organizations": [], "uuid": "7af994b6f0fbd3f60c1fbd9304066bf23523bf06", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.vindy.com", "main_image": "http://media.vindy.com/content/image/a/5/logo/v5logo.gif", "site_section": "http://www.vindy.com/rss/headlines/entertainment", "section_title": "Vindy.com stories: Entertainment", "url": "http://www.vindy.com/news/2015/oct/03/by-john-benson/", "country": "US", "title": "‘Voice’ winner tries new approach", "performance_score": 0, "site": "vindy.com", "participants_count": 0, "title_full": "‘Voice’ winner tries new approach", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T07:05:00.000+03:00", "replies_count": 0, "uuid": "7af994b6f0fbd3f60c1fbd9304066bf23523bf06"}, "author": "", "url": "http://www.vindy.com/news/2015/oct/03/by-john-benson/", "ord_in_thread": 0, "title": "‘Voice’ winner tries new approach", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "entertainment@vindy.com \nWhen it comes to achieving dreams, Craig Wayne Boyd knows the power of perseverance. \nFor a decade, the singer and multi-instrumentalist toiled in Nashville while his career ebbed and flowed. At first a songwriter, the Texas native signed a publishing deal but then changed directions to focus on being a touring musician, opening for the likes of Jamey Johnson, Randy Houser and Brantley Gilbert. \nFeeling as though he was out of options, last year Boyd decided to try the reality-show route. It ended up changing his life forever. Not only did Boyd audition for “The Voice,” but last December he was named the season 7 winner and enjoyed his first No. 1 country hit, “My Baby’s Got a Smile on Her Face.” \n“It’s pretty wild, I don’t know how to describe it,” said Boyd, calling from outside of Nashville. “It’s mind blowing. A reality show was never even an option for me. I was scouted and asked to do some of those things in the past, but I never would go do them because there was a stigma about them when they first came out. \n“At this point for ‘The Voice,’ I was at a position where I had tried everything in my power to try to make something happen. It’s like every time it would happen good for a little while, then it would be pulled out from underneath me. And in one of those down points, I was like, ‘Let’s do something different.’” \nAs for winning “The Voice,” Boyd feels one of the reasons he appealed to so many viewers was because he fully embraced the reality-TV game, letting the cameras into all aspects of his life while accepting the fact his music was going to be heavily critiqued. \nUp next for Boyd is his major label debut, which includes lead single “I’m Still Here.” He’s hopeful the album will be released this year. Stylistically speaking, he said fans who want a sneak peak about what he’s all about shouldn’t look further than the artists he covered during his appearance on “The Voice.” That list includes George Strait, Johnny Cash, The Eagles, Merle Haggard and Randy Houser. \nLooking at Boyd’s journey, it’s safe to assume the Music Row veteran just needed the right opportunity to make the leap. \n“Exactly, that was the key in doing it,” Boyd said. “I’ve heard more ‘nos’ in my life than I’ve heard ‘yeses.’ I can’t say it doesn’t get to you every once in a while.” \nOne “yes” Boyd recently got was from his girlfriend, Wilhelmina model Taylor Borland, when he proposed marriage last month. So is this longtime bachelor catching any grief from his band members? \n“Oh man, luckily enough, the guys that are in my band, they’re like, ‘If Craig is this excited about someone, then he knows he’s found the right one,’” Boyd said. “So it’s been nothing but support around me.” Other stories of interest", "external_links": [], "published": "2015-10-03T07:05:00.000+03:00", "crawled": "2015-10-03T07:51:47.114+03:00", "highlightTitle": ""}