{"organizations": [], "uuid": "3649d27df0c323fc5f2d70d346da7befcc1740b3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nj.com", "main_image": "http://imgick.nj.com/home/njo-media/width620/img/ledgerupdates_impact/photo/2015/09/29/18863631-standard.jpg", "site_section": "http://blog.nj.com/entertainment_impact/rss.xml", "section_title": "Entertainment", "url": "http://www.nj.com/news/index.ssf/2015/10/meet_sid_mark_radio_dj_whose_weekly_shows_honor_fr.html", "country": "IL", "title": "Simply Sinatra: Philly radio DJ's weekly show nears 59 years", "performance_score": 0, "site": "nj.com", "participants_count": 1, "title_full": "Simply Sinatra: Philly radio DJ's weekly show nears 59 years", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T19:19:00.000+03:00", "replies_count": 0, "uuid": "3649d27df0c323fc5f2d70d346da7befcc1740b3"}, "author": "Greg Adomaitis | For NJ.com", "url": "http://www.nj.com/news/index.ssf/2015/10/meet_sid_mark_radio_dj_whose_weekly_shows_honor_fr.html", "ord_in_thread": 0, "title": "Simply Sinatra: Philly radio DJ's weekly show nears 59 years", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "PHILADELPHIA — The kid from Hoboken was pleased. Promotional efforts by a Philadelphia radio station for Frank Sinatra's newest LP outpaced every other major market across the country. Philadelphia-based radio DJ Sid Mark photo provided \nAs a gesture of his gratitude, Sinatra invited Camden native and now Philadelphia-based disc jockey Sid Mark out west to the Sands Hotel. The year was 1966 and at that point, Mark had been running radio shows featuring material strictly by the \"Chairman of the Board\" for a decade. \n\"I had my bags packed for 10 years,\" Mark said of finally meeting Sinatra, who footed the bill for the meeting that was long in the making, but still left him star-struck. \nAll things being equal, \"Sunday with Sinatra\" will turn 59 years old next month. The weekly radio show that airs from 9 a.m. to 1 p.m. on 1210 AM WPHT is almost always all Sinatra cuts, save a few songs by his son or other cohorts of the era. \nSinatra, who died in 1998, would have turned 100 on Dec. 12 and events have been held across the country all year long honoring the late crooner from Hudson County. NJ Advance Media recently caught up with Mark to talk about his own contribution to the everlasting legacy of a great American performer. \nRewind to 1956 and Mark, then in his early 20s and recently out of the U.S. Army, received a call from a listener who wanted to hear an hour of Sinatra. It was November, the caller was at work and Mark had two Sinatra albums with him at the time. \nThing is, the show Mark was supposed to be running was the \"Rock and Roll Kingdom,\" but he decided to do it his way. The listeners loved it and management gave Mark his own slot and a raise, only finding out six months later what he was really playing during the wee small hours of the night. \nThat request from a listener was all it took to plant the seed that would blossom into \"Friday with Frank,\" \"Saturday with Sinatra\" and his now nationally-syndicated \"Sounds of Sinatra\" show. MORE: You'll get a kick out of these Sinatra impersonators \nMark's shows on Fridays, Saturdays and Sunday went on for years until his radio station swapped formats from talk to more contemporary music. The entire staff and Mark's 45-year-old program got axed. Not five minutes later, the general sales manager at 1210 AM phoned Mark to say, \"We want you here,\" and there he's stayed. \nAsked what Sinatra was like, Mark said, \"Loyal. If you had him for a friend, you didn't have to worry about a thing.\" \nSinatra agreed. \n\"It's wonderful to have a friend like Sydney and I've had, oh maybe four or five in my career. People who have stayed with me when things were dark and didn't change at all, were never anything else when things changed and that's the kind of man he is,\" Sinatra said of Mark in front of 20,000 people at the former Spectrum stadium. \n\"This area has always been a hot bed for Sinatra,\" Mark said, adding that Sinatra once quipped that when performing live in concert, \"all the other cities are like cookie sales\" compared to dates outside of Philadelphia. \nMark's been told that the lights in South Philadelphia used to dim from a power surge when \"Fridays with Frank\" would come on the air. To this day, the phone lines light up by 9 a.m. for a show that doesn't broadcast listener requests on air. \n\"It's very gratifying for me,\" Mark said of the continued dedication from listeners. \nCan Mark, an indisputable authority on all things Frank, pick a favorite song from such a long career? \n\"It depends on my mood,\" he said, adding that he's partial to a 1984 re-release recorded live at the Royal Albert Hall, in London, of \"Guess I'll hang my tears out to dry.\" \nIn 1995, Sinatra asked Mark how long he planned to do the radio show for. The two agreed he should aim for 50 years. It's almost inconceivable that throughout all those decades, the only show Mark missed was in 1999, and that was for open heart surgery. \nEven Pope Francis' recent visit to Philadelphia didn't stop the program. \n\"We opened with 'You'll Never Walk Alone' and The Lord's Prayer by Frank Sinatra,\" Mark said of the Sunday, Sept. 27 show that was pre-recorded. \nWhen Mark shows up to WPHT's Center City station on that fateful Sunday next month, he'll come carrying 1,500 songs on more than 200 CDs. He could transfer them into the station's digital banks, but that's not his style. \nAnd when he goes to draw the curtain on 59 years — maybe by playing the usual show closer, \"I have dreamed\" — thousands of listeners from across the globe will hear an old exchange between two friends. \n\"Ladies and gentlemen, as I usually say at the close of most programs, I wish you everything you want in life for yourself and your families; lots of huggin' and kissin', sweet dreams, and God bless,\" Sinatra says. \n\"God bless you, Frank Sinatra. I love you,\" Mark says. \n\"I love you too, Sydney.\"", "external_links": [], "published": "2015-10-09T19:19:00.000+03:00", "crawled": "2015-10-09T19:37:35.748+03:00", "highlightTitle": ""}