{"organizations": [], "uuid": "d879000e0f546a6bdc427195f170920fb98de9b1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sagmart.com", "main_image": "http://www.sagmart.com/uploads/2015/10/01/news_image1/maruti-suzuki-baleno-1.jpg", "site_section": "http://www.sagmart.com/news_rss", "section_title": "SAG Mart News - General, Entertainment, Mobile, Fashion, Health", "url": "http://www.sagmart.com/news/Automobiles/suzuki-baleno-spotted-in-gurgaon-video-revealed", "country": "US", "title": "Suzuki Baleno Spotted in Gurgaon, Video Revealed", "performance_score": 0, "site": "sagmart.com", "participants_count": 0, "title_full": "Suzuki Baleno Spotted in Gurgaon, Video Revealed", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T14:34:00.000+03:00", "replies_count": 0, "uuid": "d879000e0f546a6bdc427195f170920fb98de9b1"}, "author": "", "url": "http://www.sagmart.com/news/Automobiles/suzuki-baleno-spotted-in-gurgaon-video-revealed", "ord_in_thread": 0, "title": "Suzuki Baleno Spotted in Gurgaon, Video Revealed", "locations": ["Gurgaon"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Suzuki Baleno Spotted in Gurgaon, Video Revealed 1st, Oct 2015 5:04 PM View: 19 (1 rate) \nfter being spotted many times, Maruti Baleno has been captured yet again in a video, while running on the roads of Gurgaon. Maruti Suzuki India Pvt. Ltd has commenced the production of this hatchback at its production facility in Manesar. From price aspect, it is not disclosed yet, but the car may be sold at a price varying from INR. 6 Lakh to 9 Lakh. It will be available in Maruti’s NEXA range of premium outlets on 26 October, 2015 and it's the second product, which will be sold at this dealership. \nRead on: Maruti Baleno \nUnder the hood, this upcoming model will be packed with a 1.3-liter MultiJet diesel engine that churns out 89bhp of power and 200Nm of torque, mated with a five-speed manual and a CVT (continues variable transmission). If market report is to be believed, then it might be introduced in petrol trim that offers the 1.2-liter MultiJet engine capable of producing maximum power of 90bhp and 118Nm of torque. \nIn Baleno same engine will be fitted, which is already fitted in the Swift and Swift Dzire models. It will get a stiff competition from Honda Jazz, Hyundai Elite i20 and the VW Polo. The all new Baleno is based on the Suzuki’s new-generation platform, while other technical details will be revealed later. \nComing to the interior, the vehicle includes number of features like, automatic climate control, Apple CarPlay's 7-inch SmartPlay infotainment system (first-in-segment), 2-DIN audio system with Bluetooth connectivity, navigation system, power folding mirrors, etc. For the safety equipments, it will have reverse parking sensor, dual airbags, Automatic Braking System (ABS), EBD and much more. \nGet latest and updated information about automobiles on our Google Plus Community Speed Gears .", "external_links": [], "published": "2015-10-01T14:34:00.000+03:00", "crawled": "2015-10-01T15:08:54.032+03:00", "highlightTitle": ""}