{"organizations": [], "uuid": "7bd014aa6ef7884bfb31c6ab68ddf056d3b57af8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "610kvnu.com", "main_image": "http://abcnewsradioonline.com/storage/_music-news-images/M_BTTF_101415.jpg?__SQUARESPACE_CACHEVERSION=1444866305556", "site_section": "http://www.610kvnu.com/entertainment/feed.xml", "section_title": "Entertainment", "url": "http://610kvnu.com/entertainment/b9fae3cb218fbb11de122fc2f1ff4d0d", "country": "US", "title": "Great Scott! \"Back to the Future in Concert\" Comes to NYC Thursday and Friday", "performance_score": 0, "site": "610kvnu.com", "participants_count": 0, "title_full": "Great Scott! \"Back to the Future in Concert\" Comes to NYC Thursday and Friday", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T07:44:00.000+03:00", "replies_count": 0, "uuid": "7bd014aa6ef7884bfb31c6ab68ddf056d3b57af8"}, "author": "", "url": "http://610kvnu.com/entertainment/b9fae3cb218fbb11de122fc2f1ff4d0d", "ord_in_thread": 0, "title": "Great Scott! \"Back to the Future in Concert\" Comes to NYC Thursday and Friday", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Great Scott! \"Back to the Future in Concert\" Comes to NYC Thursday and Friday Posted just a moment ago \nMathew Imaging Back to the Future is coming to an iconic New York City venue this Thursday and Friday night. \nThe classic sci-fi comedy, which is celebrating its 30th anniversary this year, will be screened at Radio City Music Hall, with the New Jersey Symphony Orchestra performing the entire original score from the film. \nChristopher Lloyd , who famously played scientist Doc Brown, will make an appearance at the Back to the Future in Concert shows. So will James Tolkan , a.k.a. the strict principal Mr. Strickland; Back to the Future writer-producer Bob Gale ; and the film's composer, Alan Silvestri . \nGale is thrilled that his movie, which he co-wrote with director Robert Zemeckis , continues to have an impact on pop culture and will be showing at a famous venue like Radio City. \"The idea that this crazy movie that Zemeckis and I came up with keeps on going like the Energizer Bunny...with this new iteration with the live orchestra -- it's such a great high, I can't tell you,\" he tells ABC Radio. \nGale attended a Back to the Future in Concert performance at the Hollywood Bowl earlier this year, and he says he received positive feedback from fans. He recalls they approached him and commented, \"I felt like I was seeing the movie for the first time. I was that excited, there was that much energy.\" \nSilvestri, who contributed 20 minutes of new music for the Back to the Future in Concert series, has also seen firsthand how enthusiastic fans are during the performances. \"In some of the iconic moments in the film -- where Doc Brown pops out of the DeLorean for the first time, the crowd cheers like the actors were up on stage. It's just amazing,\" he shares. \nThe Back to the Future in Concert series will also be presented in Toronto this week. Upcoming performances are scheduled for Indianapolis, St. Louis and Denver. You can review all future dates on FilmConcertsLive.com . \nCopyright © 2015, ABC Radio. All rights reserved.", "external_links": [], "published": "2015-10-15T07:44:00.000+03:00", "crawled": "2015-10-15T05:57:13.135+03:00", "highlightTitle": ""}