{"organizations": [], "uuid": "dba351fcec4c736b2267c53d4e3cbae33527e455", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cosmopolitan.com", "main_image": "http://cos.h-cdn.co/assets/15/43/1600x800/landscape-1445273127-elizabeth-gilbert-holi-powder-photo-alternate-credit-timothy-greenfield-sanders.jpeg", "site_section": "http://www.cosmopolitan.com/entertainment/", "section_title": "Entertainment News and Celebrity Gossip - Cosmopolitan", "url": "http://www.cosmopolitan.com/entertainment/books/q-and-a/a47916/elizabeth-gilbert-big-magic-interview/", "country": "US", "title": "Elizabeth Gilbert Will Not Sit Back and Wait For Success to Happen to Her", "performance_score": 1, "site": "cosmopolitan.com", "participants_count": 1, "title_full": "Elizabeth Gilbert Will Not Sit Back and Wait For Success to Happen to Her", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T21:17:00.000+03:00", "replies_count": 0, "uuid": "dba351fcec4c736b2267c53d4e3cbae33527e455"}, "author": "Cosmopolitan.com", "url": "http://www.cosmopolitan.com/entertainment/books/q-and-a/a47916/elizabeth-gilbert-big-magic-interview/", "ord_in_thread": 0, "title": "Elizabeth Gilbert Will Not Sit Back and Wait For Success to Happen to Her", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Share Tweet Pin E-mail Timothy Greenfield-Sanders Advertisement - Continue Reading Below Elizabeth Gilbert is the phenomenally successful author of Eat, Pray, Love , a memoir of the year she spent traveling following an emotionally gut-wrenching divorce. The book spent three years on the New York Times best seller list. Gilbert went on to be played by Julia Roberts in the feature film. Though many read ​ Eat, Pray, Love ​as a panacea for any emotional hardship one needs inspiration to overcome, in ​ Big Magic , ​Gilbert wades more officially into the self help genre, as she encourages readers to figure out how to live their most creative — and therefore, most fulfilling and happiest — lives.\nMore From Cosmopolitan I spoke to her about her best creative ideas, the mistakes she made in her twenties, and why she's not afraid to credit some of her success to pure luck.\nThe process of writing a book is very stressful. A lot of authors (myself included) obsess over their sales and Amazon ranking. You've done this seven times — do you obsessively check your numbers to see how you're doing? I try not to, to be honest. And it's not because I am a sort of zen creature who doesn't care about outcomes — it's because I do care that I try to stay away from the outcome. If I were somebody who honestly didn't care about what reviewers said or what my Amazon ranking was, then I could look at the reviews, and check my Amazon ranking, and read the comments underneath essays that I have published. You know, John Updike said that to read your reviews is like eating a sandwich that might have some broken glass in it. And these days, that goes for like looking at yourself on the internet in any form. And that broken glass can come at really surprising moments. I try not to read my good reviews because sometimes even in my good reviews the person will feel obliged to say something like, \"Well, I always thought that she was an asshole, but actually now I kind of like her.\" It is hard to not get broken glass. And I know that broken glass is bad for me. And that it is going to make it harder the next time I sit down to do a creative project if I have those words in my head. Because I am sensitive, and I am not going to be able to unsee what I saw.\nT he premise of your new book, Big Magic , is that everyone has a creative spirit inside of themselves but that not all of us are tapping into it. What gave you that idea? From my own lived experience, and watching the lives of my friends, my family members. Just seeing the difference between the people in my life who decided to live their life with creative curiosity, and people who decided not to. And seeing the difference in the quality of their existence, basically. And how interesting their lives turned out. And interesting is not a synonym for successful.\nShare Tweet Pin E-mail How would you sum up the distinction? I am 46 now, and I look back at the people who I was hanging out with in my twenties, and there were some who had what looked to me at the time like infinite power and infinite promise and infinite possibility. And they never did anything with it. And then there were other people who I kind of dismissed and thought didn't have anything — and then those people just blew my mind with what they ended up creating. To me the most boring question in the world is, \"Who has talent?\" and, \"Who doesn't have talent?\" Because I have seen that that is not really where it's at. We will never know. There is no objective measure that we could use to tell who is talented and who isn't talented. You can only tell by what they make, and what they make of their lives. ​ ​I don't know how much natural talent I have. I know that I work harder than anybody I know.\nSomething I tell young women beginning their careers is that hard work really pays off. Do you agree? What is a hard day's work like for you? ​I am on the road and I am working hard to promote this book. So that means I am saying yes to every interview. And I am working to do what some people consider to be very distasteful, which is to promote myself, which is something that I have never been afraid of doing because I want people to see the thing I made. So I am not going to sit quietly and wait for people to discover me on their own, because people are really busy. But it is more about in my twenties how I worked, and that was having three day jobs, at the same time, and setting aside time to write. ​\nWhat were your jobs? ​ ​I was a bartender, I was a waitress, and I worked in a bookstore. And you know, my first two books were written when I had three jobs. So something when I hear people say, \"I would love to do this but I don't have time!\" Or, \"Well, I have a real job and I would have to quit my job to write a book.\" And I'm like, you don't have to quit your fucking job to write a book. ​\nI agree — I wrote my book while I had my current job at Cosmopolitan.com. ​You have to quit a bunch of other stuff you are doing in your life. Like you might have to quit staying out till 2 in the morning. But that idea that, \"I am accountable for this work,\" and that, \"I am going to become\" — and I remember this was a big commitment to me in my twenties — \"that I am going to become my own patron. I am going to become my own sugar daddy. I am going to become my own great writer. I can take care of myself in the world, and take care of my art at the same time.\" That is the kind of work that I am talking about. Because once you are a professional creator and you are actually making money from it, it is actually easier. The important part is, what are you doing before anyone wants to pay you for this? That is where the work is important.\nAdvertisement - Continue Reading Below", "external_links": ["http://cos.h-cdn.co/assets/15/43/768x1181/gallery-1445273127-elizabeth-gilbert-holi-powder-photo-alternate-credit-timothy-greenfield-sanders.jpeg", "http://cos.h-cdn.co/assets/15/43/980x1507/gallery-1445273127-elizabeth-gilbert-holi-powder-photo-alternate-credit-timothy-greenfield-sanders.jpeg", "http://cos.h-cdn.co/assets/15/43/1280x1969/gallery-1445273127-elizabeth-gilbert-holi-powder-photo-alternate-credit-timothy-greenfield-sanders.jpeg", "http://cos.h-cdn.co/assets/15/43/1600x800/landscape-1445273310-big-magic-creative-living-beyond-fear-by-elizabeth-gilbert.jpeg", "http://cos.h-cdn.co/assets/15/43/1600x2543/gallery-1445273310-big-magic-creative-living-beyond-fear-by-elizabeth-gilbert.jpeg", "http://cos.h-cdn.co/assets/15/43/1600x800/landscape-1445273127-elizabeth-gilbert-holi-powder-photo-alternate-credit-timothy-greenfield-sanders.jpeg", "http://cos.h-cdn.co/assets/15/43/1600x2461/gallery-1445273127-elizabeth-gilbert-holi-powder-photo-alternate-credit-timothy-greenfield-sanders.jpeg", "http://cos.h-cdn.co/assets/15/43/768x1220/gallery-1445273310-big-magic-creative-living-beyond-fear-by-elizabeth-gilbert.jpeg", "http://cos.h-cdn.co/assets/15/43/640x1017/gallery-1445273310-big-magic-creative-living-beyond-fear-by-elizabeth-gilbert.jpeg", "http://www.amazon.com/exec/obidos/ASIN/B00S52M350", "http://www.amazon.com/exec/obidos/ASIN/0143038419", "http://cos.h-cdn.co/assets/15/43/1280x2034/gallery-1445273310-big-magic-creative-living-beyond-fear-by-elizabeth-gilbert.jpeg", "http://cos.h-cdn.co/assets/15/43/480x763/gallery-1445273310-big-magic-creative-living-beyond-fear-by-elizabeth-gilbert.jpeg", "http://cos.h-cdn.co/assets/15/43/640x984/gallery-1445273127-elizabeth-gilbert-holi-powder-photo-alternate-credit-timothy-greenfield-sanders.jpeg", "http://cos.h-cdn.co/assets/15/43/480x738/gallery-1445273127-elizabeth-gilbert-holi-powder-photo-alternate-credit-timothy-greenfield-sanders.jpeg", "http://cos.h-cdn.co/assets/15/43/980x1557/gallery-1445273310-big-magic-creative-living-beyond-fear-by-elizabeth-gilbert.jpeg"], "published": "2015-10-19T21:17:00.000+03:00", "crawled": "2015-10-19T21:10:51.752+03:00", "highlightTitle": ""}