{"organizations": [], "uuid": "6d7d947a5b2bd6210048daad7efb2bca496e957e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.albawaba.com", "main_image": "http://www.albawaba.com/sites/default/files/im/burn-the-balldom-saudi.jpg", "site_section": "http://albawaba.com//rss/entertainment", "section_title": "Al Bawaba - Entertainment", "url": "http://www.albawaba.com/entertainment/theyre-ballin-burn-ballroom-set-stage-fire-saudi-755380", "country": "US", "title": "They're ballin': Burn The Ballroom set the stage on fire in Saudi!", "performance_score": 0, "site": "albawaba.com", "participants_count": 0, "title_full": "They're ballin': Burn The Ballroom set the stage on fire in Saudi!", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T14:27:00.000+03:00", "replies_count": 0, "uuid": "6d7d947a5b2bd6210048daad7efb2bca496e957e"}, "author": "", "url": "http://www.albawaba.com/entertainment/theyre-ballin-burn-ballroom-set-stage-fire-saudi-755380", "ord_in_thread": 0, "title": "They're ballin': Burn The Ballroom set the stage on fire in Saudi!", "locations": ["Virginia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Click here to add Virginia as an alert Click here to remove the Virginia alert Disable alert for Virginia \nAmerican rock group “Burn The Ballroom” played to a capacity crowd of 300 at the US consulate in Jeddah on Tuesday. The day before, they gave a well-received concert at The Help Center, a non-profit organization committed to enhance the quality of life of individuals with intellectual disabilities. The musical ensemble comes out of Virginia and is sponsored by The US Department of State’s Bureau of Educational and Cultural Affairs in partnership with the government’s American Music Abroad exchanges. \n“Burn The Ballroom” was founded by singer and guitarist Alan Gant in 2013 with Jack Ivins on drums, Sterling Pearson as lead guitar, keyboardist Tuomas Easton, and bass player Justin Heresy. Driven by power instrumentation, driving melodies, and complex lyrics, “Burn The Ballroom” blurs the lines between anthem, rock, punk, alternative, and popular music. \nRock music has its roots in American jazz, considered the primary musical offering of the United States to the world, beginning in the early 20th century. Today’s rock music is popular to all age groups in the West and is used to communicate a full spectrum of emotional, political, and spiritual messages. \nPhoto: Facebook. \nThe Help Center is a non-profit organization based in Jeddah, committed to enhance the quality of life of individuals with intellectual disabilities by giving them the opportunity to learn, live, work, and play, in a safe environment. \nThe American Music Abroad (AMA) exchanges help promote a positive image of the US through arts and music and give overseas audiences the chance to directly interact with American artists. AMA bands represent a wide variety of American musical genres and reached more than 45 countries around the world during 2014 and 2015. \nAMA also builds on the historic legacy of the Department of State’s Jazz Ambassadors, who first traveled the world in the 1950s to connect people through music. Jazz Ambassador alumni include Duke Ellington, Louis Armstrong and Dave Brubeck. On the plane to #Riyadh , the flight attendants recognized us from the newspaper! #SaudiArabia #AMA #ExchangeOurWorld pic.twitter.com/DYs8EHJ1HL — Burn The Ballroom (@BurnTheBallroom) October 15, 2015 Advertisement Copyright: Arab News © 2015 All rights reserved. Rate Article:", "external_links": [], "published": "2015-10-15T14:27:00.000+03:00", "crawled": "2015-10-15T15:26:43.495+03:00", "highlightTitle": ""}