{"organizations": [], "uuid": "522a6419ecaac058be36aab176ecb3a003c3ce71", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266347/arts-entertainment-general", "section_title": "Arts &amp; Entertainment: General - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30169679/new-novel-falcons-and-seagulls-mixes-politics-religion-love", "country": "US", "title": "New Novel Falcons and Seagulls Mixes Politics, Religion, Love", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "New Novel Falcons and Seagulls Mixes Politics, Religion, Love - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T13:01:00.000+03:00", "replies_count": 0, "uuid": "522a6419ecaac058be36aab176ecb3a003c3ce71"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30169679/new-novel-falcons-and-seagulls-mixes-politics-religion-love", "ord_in_thread": 0, "title": "New Novel Falcons and Seagulls Mixes Politics, Religion, Love", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "David Taylor Johannesen’s reluctant hero encounters moral, ethical, and sexual challenges in new book.\nREDWOOD CITY, Calif. (PRWEB) October 02, 2015\nAuthor David Taylor Johannesen seamlessly blends political intrigue, murder, romantic love, biblical prophecy, religious controversy, upheavals in nature and character tension in his new novel, “ Falcons and Seagulls ” (published by Archway Publishing), to a peaceful and well-ordered conclusion.\nSolomon Fairchild lives a quiet life as a Quaker in Massachusetts until he learns of his uncle’s imminent death. His uncle Rory MacLeod was once an ally and employer of Solomon’s, so Solomon travels to say goodbye to this family member and old friend. Little does Solomon know, Rory has a secret that will change his peaceful life forever.\nSolomon’s seemingly innocent trip to his Mormon family in Utah takes a sudden turn when his uncle reveals a terrible family secret and extracts a promise from Solomon that pulls him into past clandestine dealings and intrigue involving Howard Hughes, the Mormon Church and Israel’s nuclear ambition. But Solomon takes on more than he ever realized when his cousin Phil is found shot dead in the Utah wilderness and high-powered shadow agencies make a play for his life and threaten the woman he loves – and loved long ago.\nThrough prose and well-posed action, “Falcons and Seagulls” brings readers a strong sense of cultural attachments and revealing love as it depicts the battle between good and evil.\nMore information is available at http://www.davidtjohannesen.wordpress.com .\n“Falcons and Seagulls”\nBy David Taylor Johannesen\nHardcover | 5.5 x 8.5 in | 382 pages | ISBN 9781480810747\nSoftcover | 5.5 x 8.5 in | 382 pages | ISBN 9781480810761\nE-Book | 382 pages | ISBN 9781480810754\nAvailable at Amazon and Barnes & Noble\nAbout the Author\nDavid Taylor Johannesen was born a fifth-generation Mormon and great-great-grandson of the Mormon church president John Taylor. He grew up in Massachusetts, where he found the plain quietude of the Society of Friends. He lived there for a number of years with his wife, Linda, before their recent move to northern California. He is also the author of the poetry collection “Vespers East and West” and the short story collection “Last One Close the Gate.” He is currently working on his new collection of short stories, titled “Boston Casualty.” He was educated at University of Pennsylvania, New York University, and Trinity College, Oxford.\nArchway Publishing is a supported self-publishing alliance between leading global publisher Simon & Schuster and Author Solutions, LLC. For more information about publishing your book with Archway Publishing, please visit archwaypublishing.com or call 888-242-5904. For the latest news, follow @ArchwayPub on Twitter and “Like” us at facebook.com/ArchwayPublishing.\n //www.prweb.com/releases/DavidTaylorJohannesen/FalconsandSeagulls/prweb12999666.htm\n ", "external_links": ["http://www.barnesandnoble.com/w/falcons-and-seagulls-david-taylor-johannesen/1121302942?ean=9781480810747", "http://www.amazon.com/exec/obidos/ASIN/1480810746", "http://www.prweb.com/releases/DavidTaylorJohannesen/FalconsandSeagulls/prweb12999666.htm", "http://bookstore.archwaypublishing.com/Products/SKU-000943781/Falcons-and-Seagulls.aspx", "https://www.kirkusreviews.com/book-reviews/david-taylor-johannesen/falcons-seagulls/"], "published": "2015-10-02T13:01:00.000+03:00", "crawled": "2015-10-02T12:39:55.140+03:00", "highlightTitle": ""}