{"organizations": [], "uuid": "34bafb5bdd879707e4a1f4fee3e6561b4d3f8a71", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48524/entertainment", "section_title": "Entertainment - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30171938/wayne-elseys-latest-book-serves-as-a-practical-how-to-guide-for-marketing-success-in-the-social-sector", "country": "US", "title": "Wayne Elsey's Latest Book Serves as a Practical How-To Guide for Marketing Success in the Social Sector", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Wayne Elsey's Latest Book Serves as a Practical How-To Guide for Marketing Success in the Social Sector - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "34bafb5bdd879707e4a1f4fee3e6561b4d3f8a71"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30171938/wayne-elseys-latest-book-serves-as-a-practical-how-to-guide-for-marketing-success-in-the-social-sector", "ord_in_thread": 0, "title": "Wayne Elsey's Latest Book Serves as a Practical How-To Guide for Marketing Success in the Social Sector", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Information contained on this page is provided by an independent third-party content provider. WorldNow and this Station make no warranties or representations in connection therewith. If you have any questions or comments about this page please contact pressreleases@worldnow.com .\nSOURCE Wayne Elsey Enterprises\nORLANDO, Fla. , Oct. 2, 2015 /PRNewswire/ -- The inspirational author, motivational speaker and successful social entrepreneur, Wayne Elsey, announced today the publication of his latest book as part of the Not Your Father's Charity Book Series: Be Bold , Dominate and Succeed in Marketing for Today's Digital World on a Tight Budget . With the majority of nonprofits operating on budgets of $1million or less and the world looking to end many of the intractable social challenges, marketing is an essential component for success. With brand awareness comes increased social impact. This book shows readers how to navigate the digital world by providing current tips and resources that are essential to an organization's marketing success in the social sector. The book is available on Amazon . A free digital download is also available at www.notyourfatherscharity.com .\n\"There are things you can do even on a limited means to market and promote your organization\" says Elsey, \"There are resources out there and many of them are little or no cost.\"\nFrom content strategy to understanding the function of the most highly used social media sites, readers will appreciate how the multiple threads of digital marketing are easily weaved together. Even more useful are the resources that can be found in chapters 2 & 8. Elsey offers up a wealth of resources with organizations and industry leaders around the country who can help your organization grow.\nAbout the Author\nWayne Elsey is an authority on topics related to leadership, business, money, branding, life success and the social sector due to his success in both the for profit and philanthropic world. Elsey is the founder and former CEO of a nonprofit he grew from zero to over $70 million in less than 5 years. He later took this success and started Funds2Orgs in 2012, a leading social enterprise that provides fundraising solutions for thousands of organizations, primarily in North America while working with micro-enterprises in developing nations to create economic sustainability. Elsey has been featured on NBC Nightly News, Good Morning America, Today Show, & Fox News. He is also the author of Almost Isn't Good Enough and Get Off the Couch: Grip & Rip and Break the Barriers Holding You Back in Life . Elsey is also available for interviews and speaking engagements.\nContact\nMichelle Blake , Marketing & Media Director\nWayne Elsey Enterprises\nOffice: (407) 440-8264\nEmail: michelle@wayneelsey.com\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/wayne-elseys-latest-book-serves-as-a-practical-how-to-guide-for-marketing-success-in-the-social-sector-300153295.html\n©2015 PR Newswire. All Rights Reserved.", "external_links": ["http://rt.prnewswire.com/rt.gif?NewsItemId=NY18211&Transmission_Id=201510021100PR_NEWS_USPR_____NY18211&DateId=20151002", "http://www.amazon.com/exec/obidos/ASIN/B013TN3M40", "http://www.prnewswire.com/news-releases/wayne-elseys-latest-book-serves-as-a-practical-how-to-guide-for-marketing-success-in-the-social-sector-300153295.html", "http://www.xmlnews.org/ns/", "http://www.notyourfatherscharity.com/"], "published": "2015-10-02T03:00:00.000+03:00", "crawled": "2015-10-03T07:26:55.692+03:00", "highlightTitle": ""}