{"organizations": [], "uuid": "4912bf75a0b0ed36148bfaf7c8df6f9fa7f6a872", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/202496/entertainment-news", "section_title": "Entertainment: Celebrity gossip and Hollywood news - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30269762/new-government-art-website-showcases-thousands-of-works", "country": "US", "title": "New government art website showcases thousands of works", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "New government art website showcases thousands of works - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "4912bf75a0b0ed36148bfaf7c8df6f9fa7f6a872"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30269762/new-government-art-website-showcases-thousands-of-works", "ord_in_thread": 0, "title": "New government art website showcases thousands of works", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "DETROIT (AP) - A new website showcasing artworks owned by the federal government chronicles the history of the United States as portrayed by artists over the past two centuries, offering an easy way to find works by favorite artists or discover pieces that may be in display nearby.\nThe U.S. General Services Administration, which oversees federal buildings across the nation, owns more than 26,000 paintings, sculptures, prints and other works from the 1850s to the present. Many are displayed in federal buildings and courthouses.\nThe Detroit Institute of Arts, which has hundreds of such artworks, was hosting an event Thurdsay heralding the GSA's Fine Arts Collection website. The website allows users to find works by specific artists or discover pieces in a state or specific area.\nIn addition to the GSA-owned pieces at public buildings, thousands of New Deal-era works are on long-term loan to museums, universities and nonprofits, including more than 350 at the Detroit Institute of Arts that have been used as part of special displays.\nIn a 2009-2010 exhibition titled \"Government Support for the Arts: WPA Prints from the 1930s,\" the museum featured about 100 prints that were created as part of the Federal Art Project, a unit of the Works Progress Administration during the Great Depression.\n___\nOnline:\nhttp://www.gsa.gov/fa\n ", "external_links": ["http://www.gsa.gov/fa"], "published": "2015-10-15T03:00:00.000+03:00", "crawled": "2015-10-15T20:14:51.331+03:00", "highlightTitle": ""}