{"organizations": [], "uuid": "0e67dba31331f353b218c32a829726c7765a81f5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.newindianexpress.com", "main_image": "http://www.newindianexpress.com/skins/eb/gfx/group-logo.jpg", "site_section": "http://www.newindianexpress.com/entertainment/hindi/?widgetName=rssfeed&widgetId=276210&getXmlFeed=true", "section_title": "The New Indian Express - Hindi - http://www.newindianexpress.com/entertainment/hindi/", "url": "http://www.newindianexpress.com/entertainment/reviews/Talvar---Interesting-Subject-But-Rusty-in-Rreatment/2015/10/02/article3059246.ece", "country": "IN", "title": "'Talvar' - Interesting Subject, But Rusty in Rreatment", "performance_score": 0, "site": "newindianexpress.com", "participants_count": 0, "title_full": "'Talvar' - Interesting Subject, But Rusty in Rreatment", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T13:45:00.000+03:00", "replies_count": 0, "uuid": "0e67dba31331f353b218c32a829726c7765a81f5"}, "author": "", "url": "http://www.newindianexpress.com/entertainment/reviews/Talvar---Interesting-Subject-But-Rusty-in-Rreatment/2015/10/02/article3059246.ece", "ord_in_thread": 0, "title": "'Talvar' - Interesting Subject, But Rusty in Rreatment", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Rusty"], "text": "Film: \"Talvar\" \nDirector: Meghna Gulzar \nCast: Irrfan Khan, Konkana Sen Sharma, Neeraj Kabi, Tabu, Atul Kumar, Sohum Shah and Sumit Gulhati \nRating: **1/2Punning on the surname and revealing the ironies in the investigation of the case and in India's judicial system, Meghna Gulzar's \"Talvar\", based on the Aarushi Talwar and Hemraj double-murder that rocked the nation in 2008, is far from poetry.Treated in a realistic manner and narrated from the points of view of the parents, the suspects and the police, the film has a Rashomon effect that makes the tale interesting.Set in Sameer Vihar, a middle-class housing society in Delhi, it is upon the servant's entry into the Tandon's household, that the murder of their 14-year-old daughter Shruti, is discovered. The lives of Dr.Nutan Tandon (Konkana Sen Sharma) and Dr. Ramesh Tandon (Neeraj Kabi) thereon, are set in a turmoil and open to public scrutiny.On the performance front, with no melodrama, the ace cast, comprising Konkana Sen Sharma, Neeraj Kabi and Irfan Khan, who plays the investigating officer Ashwin Kumar, render a very dispassionate portrayal of their characters. Unfortunately, even though their circumstances are compelling, it is the reference points that does not allow them the luxury of adding much nuance to the characters they play. The structure of the film also, perhaps restricts them.Tabu, too in a cameo as Reema Kumar, Ashwin's wife on the brink of divorce, disappoints with nothing much to do.It is the supporting cast - Sumit Gulati as the cocky and confident compounder Kanhaiya, Sohum Shah as the treacherous ACP Vedanta - assistant to Ashwin Kumar and Gajraj Rao as Inspector Dhaniram - who wow the audience with their realistic performances, adding some zing to the otherwise staid film.With the source material from public platforms, consisting of the media and police reports, the film does not offer anything that the public is not aware of. So in that sense, the film is just a documentation of the reports revealing how the investigation was poorly conducted and its after-effects.With an interesting subject, the screenplay efficiently sieves the unwarranted portions of the tale, making it for an easy viewing.But it is the treatment of the film that is its undoing. Captured in a realistic setting, a few tackily handled scenes along with restrained production values, the film tends to get repetitive and boring in parts.The script, with a non-dramatic graph saunters on an even keel, weakening in the second half only to pick up momentum sporadically.Humour comes in the form of puns, quick retorts and literal Hindi translation of sexual English words. It is the confrontation scene in the Home Ministry's office that is light and entertaining, offering some respite.Cinematographer Pankaj Kumar's dark frames with a few unwarranted angles do not elevate the viewing experience.Overall, Talvar is a rusty film that disappoints.", "external_links": [], "published": "2015-10-02T13:45:00.000+03:00", "crawled": "2015-10-03T03:20:28.987+03:00", "highlightTitle": ""}