{"organizations": [], "uuid": "847c4cf501fe178cded673f9813e47304405e1f5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-56268cce/turbine/ct-biggs-nfl-rankings-spt-1021-20151020", "site_section": "http://www.chicagotribune.com/", "section_title": "Chicago Tribune: Chicago breaking news, sports, business, entertainment, weather and traffic - Chicago Tribune", "url": "http://www.chicagotribune.com/sports/football/bears/ct-biggs-nfl-rankings-spt-1021-20151020-story.html", "country": "US", "title": "Brad Biggs&apos; NFL power rankings - Chicago Tribune", "performance_score": 0, "site": "chicagotribune.com", "participants_count": 1, "title_full": "Brad Biggs&apos; NFL power rankings - Chicago Tribune", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T21:50:00.000+03:00", "replies_count": 0, "uuid": "847c4cf501fe178cded673f9813e47304405e1f5"}, "author": "Brad Biggs", "url": "http://www.chicagotribune.com/sports/football/bears/ct-biggs-nfl-rankings-spt-1021-20151020-story.html", "ord_in_thread": 0, "title": "Brad Biggs&apos; NFL power rankings - Chicago Tribune", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Previous rank in parentheses.\n1. Patriots 5-0 (1) : Properly inflated footballs proved to be no problem for Tom Brady against the Colts this time around.\n2. Bengals 6-0 (3) : Marvin Lewis the early leader for coach of the year.\n3. Packers 6-0 (2) : With a week off, Green Bay looks to get running back Eddie Lacy healed from an ankle injury and back in shape.\n4. Panthers 5-0 (7) : With Falcons nipping at their heels, Carolina just keeps finding ways to win.\n5. Broncos 6-0 (4) : Criticism of Peyton Manning isn't going to faze Broncos as long as they keep stacking wins.\n6. Steelers 4-2 (9) : This team will be pretty scary when it gets healthy. Landry Jones expected to get first career start Sunday at Kansas City.\n7. Cardinals 4-2 (6) : Couldn't get it done in Bruce Arians' return to Pittsburgh and now AFC North tour continues with Ravens, Browns up next.\n8. Jets 4-1 (8) : Wonder if Darrelle Revis will wish he was back on the other sideline Sunday at Gillette Stadium against the Patriots.\n9. Falcons 5-1 (5) : After loss in New Orleans, soft schedule continues with Titans, Bucs and 49ers next up.\n10. Vikings 3-2 (13) : Emergence of rookie wide receiver Stefon Diggs worth watching in Norv Turner's offense.\n11. Eagles 3-3 (17) : Two straight wins is all it takes to go from the outhouse to the penthouse in the NFC East.\n12. Rams 2-3 (15) : Hearing on possible relocation to L.A. set for next Tuesday and it will be interesting to see how fans show up with two home games coming up.\n13. Seahawks 2-4 (10) : So much for the return of safety Kam Chancellor righting what was wrong with this defense.\n14. Giants 3-3 (11) : Eli Manning completed his first 10 passes against the Eagles Monday night and then fell apart. New York can't win without him playing at a high level.\n15. Colts 3-3 (14) : Best photoshop of bungled fake punt by Chuck Pagano used images of Beavis and Butthead.\n16. Bills 3-3 (12) : This defense hasn't been measuring up to Rex Ryan's standards.\n17. Cowboys 2-3 (19) : Eagles and Giants were so unimpressive Monday night surely Jerry Jones can resist temptation to rush Dez Bryant back on the field.\n18. Chargers 2-4 (16) : Philip Rivers on pace to pass for NFL-record 5,643 yards but they've been just bad enough to lose series of close games.\n19. Dolphins 2-3 (24) : Kudos to interim coach Dan Campbell for lighting a fire under his team. Just realize Titans aren't on the schedule every week.\n20. Browns 2-4 (22) : Tempted to believe progress is being made here but Rams, Cardinals and Bengals in next three weeks will provide better gauge.\n21. Raiders 2-3 (21) : Ken Norton Jr. has done a nice job running defense and now must replace play as well as leadership of Justin Tuck.\n22. Bears 2-4 (18) : Return of Alshon Jeffery gives Adam Gase much more to consider as Bears map out final 10 games during bye week.\n23. 49ers 2-4 (28) : They're building a little bit of confidence just in time to see how they measure up against the struggling Seahawks on Thursday.\n24. Saints 2-4 (30) : Defense is ranked last in the league but it was good enough to catch an overhyped Falcons bunch.\n25. Redskins 2-4 (20) : One of these weeks Jay Gruden will admit the reality that his team needs a quarterback.\n26. Buccaneers 2-3 (27) : With road game at Redskins on horizon, just one more victory needed to eclipse their 2014 total.\n27. Texans 2-4 (29) : Brian Hoyer named starter again and whatever possessed Bill O'Brien to play Ryan Mallett escapes us.\n28. Ravens 1-5 (23) : Worst start in franchise history could be worse after Monday's tussle with Cardinals in Arizona.\n29. Lions 1-5 (32) : Matthew Stafford showed some resolve with four touchdown passes against Bears.\n30. Chiefs 1-5 (26) : Andy Reid is adamant he's not going to hand over play-calling duties.\n31. Titans 1-4 (25) : Pass defense one of the few bright spots especially with Marcus Mariota dealing with knee sprain.\n32. Jaguars 1-5 (31) : Sending this team to London is no way to globally promote the product.\nPrivacy Policy Copyright © 2015, Chicago Tribune New England Patriots Tennessee Titans Atlanta Falcons Arizona Cardinals NFL Indianapolis Colts Pittsburgh Panthers", "external_links": ["http://www.tribpub.com/privacy-policy-and-your-privacy-rights/", "http://www.trbimg.com/img-56268cce/turbine/ct-biggs-nfl-rankings-spt-1021-20151020"], "published": "2015-10-20T21:50:00.000+03:00", "crawled": "2015-10-20T23:35:42.685+03:00", "highlightTitle": ""}