{"organizations": [], "uuid": "1893888a6ba6c4f2af49664128968e3a536c215e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.arcamax.com", "main_image": "http://www.arcamax.com/jsnews/images/columns/horoscopes.jpg", "site_section": "http://www.arcamax.com/entertainment/", "section_title": "Entertainment | ArcaMax Publishing", "url": "http://www.arcamax.com/entertainment/horoscopes/s-1729285?fs", "country": "US", "title": "Venus Favors Love as a Verb | Horoscopes | Columns", "performance_score": 0, "site": "arcamax.com", "participants_count": 1, "title_full": "Venus Favors Love as a Verb | Horoscopes | Columns | ArcaMax Publishing", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "1893888a6ba6c4f2af49664128968e3a536c215e"}, "author": "arcamax.com", "url": "http://www.arcamax.com/entertainment/horoscopes/s-1729285?fs", "ord_in_thread": 0, "title": "Venus Favors Love as a Verb | Horoscopes | Columns", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Venus crosses into Virgo beginning a transit that highlights love's more helpful qualities. For those who have been infatuated, the love-sickness will start to fade away as those who love make their affection tangibly evident. Proof tends toward the practical because that is mostly what's needed these days. The takeaway: Love is a verb.\nARIES (March 21-April 19). Are your spirits lifting for no apparent reason? Other people are thinking fondly about you, and through mysterious channels this has a way of lifting your spirits. They like you more than you might have guessed.\nTAURUS (April 20-May 20). There is little more satisfying now than reaping the rewards of efforts you made so long ago that you can barely remember them now. If you're on a waiting list, get ready, because your name is nearing the top.\nGEMINI (May 21-June 21). You know what your weakness is, but they don't. All they see is a person building on inherent strengths. Keep this up, and you'll be promoted inside of this year.\nCANCER (June 22-July 22). Maturity is your strongest asset now. The thing that made you feel afraid, squeamish, embarrassed or uncomfortable when you were younger will be the springboard for today's power move.\nLEO (July 23-Aug. 22). It won't feel quite as necessary to give intensely passionate energy to your endeavors as it might have felt yesterday. What makes sense is to embrace the gentler side of life -- to focus less on doing and more on being.\nVIRGO (Aug. 23-Sept. 22). It's fun to be a part of something, but not when the meetings and administration take up more time than the actual endeavor that's bringing you all together. Reevaluate your involvement.\nLIBRA (Sept. 23-Oct. 23). Chances are you're not sure what to do. Make the choice that's going to leave you with the most options later. The others may not like that you're hedging your bets, but ultimately it will work to your advantage.\nSCORPIO (Oct. 24-Nov. 21). When you invest yourself in something, you are giving more than money could ever buy. You are seeding your investment with a life force that will extend beyond you in ways you can't anticipate.\nSAGITTARIUS (Nov. 22-Dec. 21). The thing you wish you were doing is not the thing required of you. It's the norm for most people, but if you really want those long stretches of hours to devote to what you love, you'll find a way to make it happen.\nCAPRICORN (Dec. 22-Jan. 19). It might not technically be your problem, but if you can easily solve it, you'll generously do so. As for the more complicated problems of others, you're better off not to get involved.\nAQUARIUS (Jan. 20-Feb. 18). Imagine that everyone is cheering for you. It's not exactly true, but you do have enough fans to push on to greater heights if you'll only connect with them and let them encourage you.\nPISCES (Feb. 19-March 20). Most people aren't mind readers, but some people are. You'd be surprised what a certain very perceptive person can sense about you without you saying a word.\nTODAY'S BIRTHDAY (Oct. 8). On the day you were born, the sunshine streamed into your soul. This year you radiate that same brightness and warmth into the souls of others. The next three weeks show you promoting what you love and making a difference. Your glass-half-full attitude will get you hired or appointed in November. Sagittarius and Taurus people adore you. Your lucky numbers are: 40, 21, 24, 39 and 11.\nASTROLOGICAL QUESTIONS: Hi, Holiday. I've been divorced for 19 years and have only had a handful of relationships since. I haven't dated AT ALL in four years and wonder whether there is an imaginary bubble around me that I can't see. Lately, I am feeling it more than ever. My birthdate is October 15, 1962. Is there hope for me, and if so, when? -- Wishing I Were a Mermaid and Could Swim Away\nNeptune, ruler of all escapist mermaids, transits in a retrograde direction for about five months out of every year. The current retrograde of Neptune will last until November 18. You'll feel that imaginary bubble around you bursting around that time, and you are more likely to let your dream of the world merge with someone else's. In the meantime, there's no reason you can't operate a decent romance from inside your bubble. It provides a protective layer between you and the object of your affection. In some ways, this is an ideal situation! It's so much easier to flirt when you believe you can't be hurt. Online dating will be quite lucky if you set up your profile well. Pisces, Scorpio and Cancer are fantastic partners for you.\nCELEBRITY PROFILES: On this birthday, Bella Thorne graduates from child star to young adult sensation with a full list of film commitments to celebrate the transformation. Look for her in the upcoming horror flick \"Amityville: The Awakening.\" Born when the sun and Mercury were in Libra, Thorne's stars are excellent for working with others, strong partnerships, art, balance, politics and design.\nTo write to Holiday Mathis, visit www.creators.com and click \"Write the Author\" on her page. You also may email Holiday at holidaymathis@gmail.com or visit her website at HolidayMathis.com.\nCopyright 2015 Creators Syndicate Inc. Share Comment", "external_links": ["http://twitter.com/share?url=http://www.arcamax.com/entertainment/horoscopes/s-1729285&hashtags=ArcaMax", "https://plus.google.com/share?url=http://www.arcamax.com/entertainment/horoscopes/s-1729285", "http://www.facebook.com/sharer.php?u=http://www.arcamax.com/entertainment/horoscopes/s-1729285&h=Venus+Favors+Love+as+a+Verb"], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-08T12:18:09.794+03:00", "highlightTitle": ""}