{"organizations": ["Voice"], "uuid": "3b88e87fcc252393fab7b77c1546298f2020a086", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.contactmusic.com", "main_image": "http://admin.contactmusic.com/pics/ln/20150823/230815_v_festival_stafford_sunday/v-festival-held-at-weston_4883369.jpg", "site_section": "http://www.contactmusic.com/rss/contactmusic_news_pictures.xml\r", "section_title": "Contactmusic Ltd | Entertainment Headlines with Pictures", "url": "http://www.contactmusic.com/tom-jones/news/tom-jones-hits-out-at-the-voice-again-claiming-producers-pressure-judges-into-picking-singers_4970888", "country": "", "title": "Tom Jones Hits Out At 'The Voice' Again, Claiming Producers Pressure Judges Into Picking Singers", "performance_score": 0, "site": "contactmusic.com", "participants_count": 0, "title_full": "Tom Jones Hits Out At 'The Voice' Again, Claiming Producers Pressure Judges Into Picking Singers", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T18:21:00.000+03:00", "replies_count": 0, "uuid": "3b88e87fcc252393fab7b77c1546298f2020a086"}, "author": "", "url": "http://www.contactmusic.com/tom-jones/news/tom-jones-hits-out-at-the-voice-again-claiming-producers-pressure-judges-into-picking-singers_4970888", "ord_in_thread": 0, "title": "Tom Jones Hits Out At 'The Voice' Again, Claiming Producers Pressure Judges Into Picking Singers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Tom Jones"], "text": "Tom Jones Hits Out At 'The Voice' Again, Claiming... Tom Jones Hits Out At 'The Voice' Again, Claiming Producers Pressure Judges Into Picking Singers Tom Jones \nThe veteran singer was axed from the BBC talent series earlier this year to make way for Paloma Faith and Boy George. \nSince being axed as a judge on ‘The Voice’ earlier this year, veteran singer Tom Jones as opened up about what its really like behind the scenes on the BBC singing competition. Speaking to The Sunday Telegraph , Jones said judges are pressured into turning their chairs by bosses during the red chair challenge. Tom Jones is not holding back when it comes to criticising ‘The Voice’. \n“They kept telling us we needed to turn our chairs more,” Jones told the newspaper. ”And I said no, it has to be real. I don’t want to be lumbered with somebody I don’t like. I have a reputation for picking good voices.” \nMore: BBC Boss Sorry To Have Upset Tom Jones Over 'The Voice' Axe \n“But they were pressing on me, and that’s exactly what happened. I ended up with this red-haired girl [likely to be Roisin Geraghty-McDonagh] that I didn’t like. They hate it when we don’t turn but I kept telling them it has to be real.” \nJones went on to say that the celebrity “coaches” on the show aren't actually the ones helping the aspiring singers behind the scenes. “The real coaches are singing coaches who keep us informed about how far the contestants can stretch themselves,” Jones revealed. \n“We talk to them daily and discuss songs; can they handle it, that’s not working let’s change it. But they are the ones who do the real coaching work. We are just the faces. We pick them and they work with them.” \nMore: Tom Jones Hits Out At The BBC After Being Axed From 'The Voice’ \nSpeaking about his departure from the show Jones added, “I have learned over the years that you can’t rely on anything... so when Mark [Jones, his manager and son] said to me 'They are not renewing your contract, what do you think about that?' I said I couldn’t give a f---. That’s life. I was here before The Voice and I will be here after it.\" Contactmusic", "external_links": [], "published": "2015-10-11T18:21:00.000+03:00", "crawled": "2015-10-11T18:32:04.288+03:00", "highlightTitle": ""}