{"organizations": [], "uuid": "55f88d4d4059370058bc8746524bc4debd1f0361", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "http://247PRESS.images.worldnow.com/images/8936713_G.png", "site_section": "http://www.cbs8.com/category/278850/arts-entertainment", "section_title": "Arts &amp; Entertainment - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30177018/world-renowned-recording-artist-chris-de-burgh-continues-north-american-tour-with-three-concerts-in-california", "country": "US", "title": "World Renowned Recording Artist Chris De Burgh Continues North American Tour with Three Concerts in California", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "World Renowned Recording Artist Chris De Burgh Continues North American Tour with Three Concerts in California - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T11:03:00.000+03:00", "replies_count": 0, "uuid": "55f88d4d4059370058bc8746524bc4debd1f0361"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30177018/world-renowned-recording-artist-chris-de-burgh-continues-north-american-tour-with-three-concerts-in-california", "ord_in_thread": 0, "title": "World Renowned Recording Artist Chris De Burgh Continues North American Tour with Three Concerts in California", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Chris De Burgh will visit Cupertino, Irvine and Los Angeles, October 15th - 18th, as part of the \"Hands of Man Tour\" 2015. Tickets now on sale at chrisconcert.com\n LOS ANGELES, CA, October 03, In support of his latest album \"The Hands of Man,\" the world renowned singer and songwriter Chris De Burgh who brought us such hits as \"The Lady In Red\" - one of the most romantic love ballads of all time - will be returning to the US as part of the North American leg of his \"Hands of Man Tour.\" De Burgh will be returning to California with his band this month for three nights of his best-loved hits and cuts from his new 20th studio album.\nPresented by Noureen Entertainment and sponsored by Party Bravo! ( www.partybravo.com ) the first live concert performance will be held on Thursday, October 15th in Cupertino, CA at the Flint Center, followed by performances on Friday, October 16th at the Bren Events Center in Irvine, CA and Sunday, October 18th at Nokia Theatre in Los Angeles.\nFor event times, tickets and further information please visit: www.chris-ca-tour.com\nJoin Chris De Burgh as he returns to the states after nearly 20 years to perform his classic hits; \"Don't Pay the Ferryman\", \"Spanish Train\", \"Sailor\", \"Natasha Dance\" and \"A Spaceman Came Traveling.\" A continuation of his sold out 10-city Canadian tour, the California dates are De Burgh's only US scheduled performances. One lucky fan will also win a chance to meet De Burgh backstage after his concert performances. To enter the contest visit the official tour Facebook page: www.facebook.com/Chris.de.Burgh.CA.Tour\nFor press credentials and other media requests please contact A&M Entertainment (310) 295-4150 or email info[a]amentertainment.com.\nAbout Chris De Burgh\nWith sales over 50 million albums worldwide, Chris de Burgh's songs are staples on the radio. \"The Lady In Red\" to this day remains one of the most played songs on the planet. De Burgh's other classic songs include: \"Don't Pay the Ferryman\", \"Spanish Train\", \"Sailor\", \"Natasha Dance\" and \"A Spaceman Came Traveling.\" Legendary singer/songwriter Chris de Burgh returns to California, for a night of his best-loved hits and live cuts from his brand new, 20th studio album: The Hands of Man.\nAbout Noureen Entertainment\nNoureen Entertainment is a concert promoter that specializes in bringing top International artists to new audiences throughout the North American market. The artists promoted by Noureen Entertainment are well-established entertainers and performers with fans all over the globe. We focus on providing the best entertainment experiences possible by combining great talent with the best concert venues and production teams in the business.\nOfficial website: www.noureenentertainment.com\n release/world-renowned-recording-artist-chris-de-burgh-continues-north-american-tour-with-three-concerts-in-california-413632.php", "external_links": ["http://www.24-7pressrelease.com/press-release/world-renowned-recording-artist-chris-de-burgh-continues-north-american-tour-with-three-concerts-in-california-413632.php", "http://purl.org/rss/1.0/modules/content/", "http://www.facebook.com/Chris.de.Burgh.CA.Tour"], "published": "2015-10-03T11:03:00.000+03:00", "crawled": "2015-10-03T15:40:20.425+03:00", "highlightTitle": ""}