{"organizations": [], "uuid": "4a3095eaabd758e27b1766528b0f95977ee1b0dc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-56211d0f/turbine/ct-sex-trafficking-bolingbrook-man-sentenced-20151016", "site_section": "http://www.chicagotribune.com/", "section_title": "Chicago Tribune: Chicago breaking news, sports, business, entertainment, weather and traffic - Chicago Tribune", "url": "http://www.chicagotribune.com/news/local/breaking/ct-sex-trafficking-bolingbrook-man-sentenced-20151016-story.html", "country": "US", "title": "Bolingbrook man sentenced in &apos;sadistic&apos; sex trafficking ring", "performance_score": 0, "site": "chicagotribune.com", "participants_count": 1, "title_full": "Bolingbrook man sentenced in &apos;sadistic&apos; sex trafficking ring - Chicago Tribune", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T20:51:00.000+03:00", "replies_count": 0, "uuid": "4a3095eaabd758e27b1766528b0f95977ee1b0dc"}, "author": "Jason Meisner", "url": "http://www.chicagotribune.com/news/local/breaking/ct-sex-trafficking-bolingbrook-man-sentenced-20151016-story.html", "ord_in_thread": 0, "title": "Bolingbrook man sentenced in &apos;sadistic&apos; sex trafficking ring", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "McKenzie \"Casino\" Carson fancied himself a businessman and a pimp, but in reality he was a vicious predator, federal prosecutors say.\nCarson chose his victims carefully, preying on weak and vulnerable girls at homeless shelters, crack houses and rehab centers, according to prosecutors. He stalked the streets, befriending runaways, telling them they were beautiful and promising lucrative careers as models.\nOnce he had them under his thumb, Carson ruled with force, using fear, humiliation and violence to force the girls into lives of prostitution while he kept all of the money for himself. Some worked seven days a week around the clock.\n\"Over the course of years, Carson caused incalculable physical and psychological damage to countless young women and girls, in some cases, ruining their lives,\" Assistant U.S. Attorney Jennie Levin wrote in a recent court filing.\nCarson, 43, of Bolingbrook, was sentenced to 47 years in prison Thursday by U.S. District Judge Elaine Bucklo, one of the lengthiest sex-trafficking sentences ever handed down in Chicago’s federal court. Carson would be in his late 70s on his release from prison.\nCarson’s attorneys had asked the judge for a term of 15 years, arguing in a recent filing that he suffers from bipolar disorder that contributed to his “troubling past.”\nA federal jury in December 2013 deliberated only about two hours before convicting Carson of four counts of sex trafficking, including one count involving a minor. Carson has been in custody since his arrest in 2011.\nBolingbrook man found guilty of sex trafficking Jason Meisner A federal jury today convicted a Bolingbrook man of sex trafficking charges for using sweet talk and violence to coerce vulnerable runaways and drug addicts into lives of prostitution.\nAfter a weeklong trial, the jury deliberated about two hours before convicting McKenzie “Casino” Carson, 41, of...\nA federal jury today convicted a Bolingbrook man of sex trafficking charges for using sweet talk and violence to coerce vulnerable runaways and drug addicts into lives of prostitution.\nAfter a weeklong trial, the jury deliberated about two hours before convicting McKenzie “Casino” Carson, 41, of...\n(Jason Meisner) The trial centered on the emotional testimony of four of Carson’s victims who told jurors about Carson’s methods of recruiting and grooming girls and young women, often using drugs and the promise of a roof over their heads to control them. After taking them in, Carson essentially ran their lives, posting sex ads on the Internet and keeping them in dingy suburban motels until it was time for them to meet “dates” for sex, prosecutors said.\nTo keep them in line, Carson would whip the women with a belt and rape them while the others were forced to watch, prosecutors said. Jurors viewed explicit photos of the women posted in online classified ads as well as detailed diary entries the victims were forced to make listing the men they had sex with and how much they were paid. All four victims also identified a size-40 belt that Carson used to enforce his will.\nProsecutors said Carson used other control tactics as well. One victim who was 17 when she met Carson testified how he sweet-talked her into working for him, telling her she was beautiful and had a future as a model.\n\"He made me feel good,\" testified the woman, whose first name is Kaitlin. \"It made me feel like I was important, that somebody needed me.\"\nThe 47-year sentence was below the 55 years requested by prosecutors but still ranks as one of the stiffest punishments for sex trafficking in recent memory.\nIn 2012, prosecutors secured a life sentence for Alex \"Cowboy\" Campbell, a pimp who raped and terrorized young women he forced into prostitution in his massage parlors, while Datqunn Sawyer, convicted of trafficking minors for sex, was sentenced 50 years in prison.\njmeisner@tribpub.com\nTwitter @jmetr22b\n Trials and Arbitration", "external_links": ["http://www.trbimg.com/img-52a7a4ae/turbine/chi-sex-trafficking-bolingbrook-20131210", "http://www.trbimg.com/img-56211d0f/turbine/ct-sex-trafficking-bolingbrook-man-sentenced-20151016", "https://twitter.com/jmetr22b"], "published": "2015-10-16T20:51:00.000+03:00", "crawled": "2015-10-16T21:20:38.055+03:00", "highlightTitle": ""}