{"organizations": [], "uuid": "a2ca1e2c7f144db2db23e7a8dce4cf1ccce995a5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "wtop.com", "main_image": "", "site_section": "http://wtop.com/section/entertainment/feed/", "section_title": "WTOP » Sections » Entertainment", "url": "http://wtop.com/movies/2015/10/asias-largest-film-festival-closes-with-record-visitors/", "country": "US", "title": "Asia’s largest film festival closes with record visitors", "performance_score": 0, "site": "wtop.com", "participants_count": 1, "title_full": "Asia’s largest film festival closes with record visitors", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T15:57:00.000+03:00", "replies_count": 0, "uuid": "a2ca1e2c7f144db2db23e7a8dce4cf1ccce995a5"}, "author": "wtopstaff", "url": "http://wtop.com/movies/2015/10/asias-largest-film-festival-closes-with-record-visitors/", "ord_in_thread": 0, "title": "Asia’s largest film festival closes with record visitors", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Home » News » Entertainment » Movies » Asia's largest film festival… Asia’s largest film festival closes with record visitors By YOUKYUNG LEE October 10, 2015 8:57 am \nSEOUL, South Korea (AP) — A typhoon and a government budget cut did not stop cinema lovers from flocking to Asia’s most influential film festival. \nThe annual Busan International Film Festival drew to a close on Saturday with a record number of visitors and many new Asian movies for the world to enjoy. \nThe start of the 20th edition seemed doomed by a cut in the South Korean government’s budget for the event and typhoon-triggered strong winds that grounded red carpet guests. \nBut the festival overcame those obstacles, as companies based in Busan, other corporate sponsors and South Korean film professionals stepped up to help fund the festival. Organizers also arranged bullet trains or drivers to whisk many of the A-list guests stranded at a Seoul airport, including German actress Nastassja Kinski, to Busan in time for the opening ceremony. \nThe event drew a record number of 227,000 visitors over 10 days, a slight increase from last year. Legendary filmmakers such as Hou Hsiao Hsien and Leos Carax, American actor Harvey Keitel, French actress Sophie Marceau and Korean heartthrob Yoo A-in were among the top stars who met audiences at a movie screening or at an open air talk on the beach. \nThe Asian film festival’s closing film was Chinese director Larry Yang’s “Mountain Cry,” a romance drama set in a remote mountainous village. The festival showed 302 movies from 75 countries, including 125 world or international premieres after two movie screenings got cancelled. \nOther highlights from the festival included: \nNEW FACES OF ASIAN CINEMA \nOne of the most feted works by a budding Asian filmmaker this year was “Immortal” by Iranian director Hadi Mohaghegh. It was honored with two of the biggest awards at the festival. \nThe 37-year-old director won the New Currents award with a $30,000 prize, given to two first- or second-time feature movie directors in Asia in the festival’s only competition. Jurors, led by veteran Taiwanese actress and director Sylvia Chang, described it as “an extraordinary feat of visual storytelling” about “how to keep our dignity as human beings.” \nIt was also the winner of the FIPRESCI award, selected by the International Federation of Film Critics for “its highly realistic and humane approach in depicting a family tragedy that echoes a universal theme through masterful use of film language.” \nThe movie, shot against barren scenery in southwestern Iran, tells a story of an old man ridden with guilt and grief from losing one’s family in an accident. Mohaghegh said that he made the low-budget movie with money from his siblings and other family members because he thought no one would be interested in investing in such non-commercial movie. He had to change the main character to an old man from an old woman because it was not possible to film female nudity in the Islamic country. \nCountries on the margin of the global cinema industry showed strong potential. Another winner of the New Currents section was a film from Kazakhstan, “Walnut Tree,” by Yerlan Nurmukhambetov. Jurors said it showed “a way of life that’s unfamiliar to most of us but proves how humor, kindness, and forgiveness connect us all.” \nOther movies that impressed jurors and audiences were honored with awards in Busan, including “Boys Run” by South Korean director Kang Seokpil, which showed alternatives to the South Korean educational system; “Look Love” by Chinese director Ye Yun about struggles of two kids for love and recognition; “Communication & Lies” by South Korean director Lee Seung-won; “Radio Set” by Indian director Hari Viswanath; “Eyelids” by South Korean director O Muel. \nCHINA LOOMS BIG IN BUSAN \nChina continued to be a notable force at the event, despite fears that Chinese attendance would be affected by the Middle East respiratory syndrome that hit South Korea in the early summer and a plunge in mainland Chinese stocks. \nThe festival showed that more big-budget Asian movies catering to the Chinese market will draw talents from outside China. South Korea’s NEW, or Next Entertainment World, and China’s Huace Media Group said during that they will establish a joint venture in Beijing for films made jointly by the two Asian countries. \nThe Asian Film Market, the 10-year-old market that is part of the festival, demonstrated its potential to become the go-to place for Asian film professionals to tap the fast-growing Chinese market. \nSouth Korea’s Kirin Productions sold its web drama series “The Cravings” to China’s Beijing Alpha Transmedia in the first intellectual property right contract. \nPOPULAR AMPHITHEATRE \nOne way to measure the popular appeal of a movie to Asian moviegoers is to see ticket sales and reactions at Busan Cinema Center’s amphitheatre. \nThe outdoor screen with 5,000 seats under the futuristic metal wing of the cinema center played a box office hit from India, “Bajrangi Bhaijaan,” and Chinese box-office hit “Monster Hunt” as well as Japanese animation favorite “My Neighbor Totoro.” \nDirector Kabir Khan of “Bajrangi Bhaijaan” said on his Twitter that 5,000 tickets were sold out for the Tuesday screening and audiences gave a standing ovation for the drama. \n“Amazing energy here,” he said on Twitter. \n__ \nLee can be reached on Twitter: www.twitter.com/YKLeeAP Topics:", "external_links": [], "published": "2015-10-10T15:57:00.000+03:00", "crawled": "2015-10-11T01:27:53.601+03:00", "highlightTitle": ""}