{"organizations": [], "uuid": "8de083ea93725decb20a41bf4369eda605cdafa3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mercurynews.com", "main_image": "http://extras.mnginteractive.com/live/media/site568/2015/1008/20151008__rfk-1015~1.JPG", "site_section": "http://feeds.contracostatimes.com/mngi/rss/CustomRssServlet/571/201109.xml", "section_title": "Entertainment", "url": "http://www.mercurynews.com/entertainment/ci_28940579/review-rfk-an-engrossing-look-at-iconic-politician?source=rss", "country": "IL", "title": "Review: 'RFK' an engrossing look at iconic politician", "performance_score": 0, "site": "mercurynews.com", "participants_count": 1, "title_full": "Review: 'RFK' an engrossing look at iconic politician", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T21:21:00.000+03:00", "replies_count": 0, "uuid": "8de083ea93725decb20a41bf4369eda605cdafa3"}, "author": "Karen D'Souza\n\nkdsouza@mercurynews.com", "url": "http://www.mercurynews.com/entertainment/ci_28940579/review-rfk-an-engrossing-look-at-iconic-politician?source=rss", "ord_in_thread": 0, "title": "Review: 'RFK' an engrossing look at iconic politician", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted: 10/08/2015 11:10:05 AM PDT Updated: 10/08/2015 11:21:30 AM PDT While touring a Brooklyn tenement, Robert Kennedy met a little girl with a mangled face. She and her family lived in such squalor that rats had gnawed at her while she slept. \nThe gruesome forever changed the way Kennedy thought about the gulf between the rich and the poor in America. It's one of many telling anecdotes that enlivens \"RFK.\" \nJack Holmes' one-man show conjures up the end of the Camelot era, when RFK must come to terms with the horror of his brother's assassination, the enemies he made as attorney general and his deepening dread about the quagmire of war in Vietnam. Engagingly played by David Arrow in Randall King's production at San Jose Stage, the history of \"RFK\" is reborn for a whole new generation. The regional premiere runs through Oct. 25. David Arrow portrays Robert F. Kennedy in the solo show \"RFK,\" playing at San Jose Stage. ( Karen d'Souza ) \nUnfortunately the narrative is rather thinly sketched. There's not enough depth and nuance to the text, but the solo show comes at a fortuitous time. Audiences feeling besmirched by the tawdry tenor of politics today, as we head into yet another contentious election season, will doubtless enjoy reliving a time when optimism and hope didn't sound like empty promises. \nArrow, decked out in the power suits and skinny ties of the period, nicely captures the essence of the RFK persona as he delivers witty quips. On conquering his fear of heights to climb Canada's Mount Kennedy, a perilous Yukon peak: \"They named it Kennedy. It was either climb it or jump off of it.\" Advertisement \nThe play basks in the magic of the dapper Kennedy charm but it also points out Bobby's blind spots. He was notably smug about his family money until he had that awakening in the slums. Growing up with a silver spoon meant that he delivered the newspapers from the back seat of a limo. Perhaps some of his bravado stemmed from this privilege. The Kennedy mantra was always, \"It's the castle or the out house, nothing in between.\" \nHolmes takes pains to point out that RFK never backed down from a fight, taking on enemies as formidable as Teamster Jimmy Hoffa and FBI head J. Edgar Hoover while he was attorney general. He was also a pugnacious campaign adviser and a champion of civil liberties, from school desegregation to farmworkers' rights. \nUnfortunately Holmes never drills down into these details enough to truly illuminate Kennedy's character. We hear that he scaled the fence at Arlington National Cemetery at night, so he could spend time at his brother's grave in peace, but we never learn much of what their relationship was like or how Robert found the strength to rebound from his grief. We hear that he was surrounded by children (11) and pets but we never learn very much about any of them as individuals or how being a father changed his view of political leadership. \nStill these flaws with the text don't detract from Arrow's personable delivery. The actor evokes the trademark boyish looks, winning smile and Boston accent nimbly enough to make \"RFK\" a compelling memoir of a charismatic leader in a turbulent era. \nContact Karen D'Souza at 408-271-3772. Read her at www.mercurynews.com/karen-dsouza , and follow her at Twitter.com/karendsouza4 . \"RFK\" By Jack Holmes, peformed by David Arrow Through Oct. 25 Where: San Jose Stage Company, 490 South First St. Running time: 2 hours, 15 minutes, one intermissionTickets: $35-$65; 408-283-7142, www.thestage.org", "external_links": [], "published": "2015-10-08T21:21:00.000+03:00", "crawled": "2015-10-08T21:35:33.465+03:00", "highlightTitle": ""}