{"organizations": [], "uuid": "b975ec383499746a77500c29552fbc36cf6b2ba4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "m.theboltonnews.co.uk", "main_image": "http://www.theboltonnews.co.uk/resources/images/4340849/", "site_section": "http://m.theboltonnews.co.uk/news/entertainment/rss/", "section_title": "The Bolton News | Entertainment", "url": "http://m.theboltonnews.co.uk/news/entertainment/13873862.New_Bolton_nightclub_applies_to_extend_opening_hours_____and_appeals_for_people_to_turn_up_for_music_video_shoot/?ref=rss", "country": "GB", "title": "New Bolton nightclub applies to extend opening hours — and appeals for people to turn up for music video shoot", "performance_score": 0, "site": "theboltonnews.co.uk", "participants_count": 0, "title_full": "New Bolton nightclub applies to extend opening hours — and appeals for people to turn up for music video shoot", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T07:05:00.000+03:00", "replies_count": 0, "uuid": "b975ec383499746a77500c29552fbc36cf6b2ba4"}, "author": "", "url": "http://m.theboltonnews.co.uk/news/entertainment/13873862.New_Bolton_nightclub_applies_to_extend_opening_hours_____and_appeals_for_people_to_turn_up_for_music_video_shoot/?ref=rss", "ord_in_thread": 0, "title": "New Bolton nightclub applies to extend opening hours — and appeals for people to turn up for music video shoot", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "16 comments \nA NIGHTCLUB in Bolton town centre wants to extent its opening hours. \nThe licence holder of the Sparkles Nitespot in Union Buildings off Bradshawgate has applied for permission to extend the bar's opening hours by two hours between Wednesday and Sunday. \nIt would mean customers could stay until 2.30am Wednesday, Thursday and Sunday and until 3.30am on Friday and Saturday, according an application lodged with Bolton Council . \nLicensable activities such as the sale of alcohol, live music and recorded music would end half an hour before doors shut. \nLicence holder Elmah Makwabarara, who is a full-time nurse and runs the bar on the side, said: \"We just opened in March and we have been opening until 1.30am. \n\"Because we have our own careers we only open at the weekends. \n\"We have had a good response from people but it's just an issue with the opening hours. \n\"We don't see the first people until 1am. \n\"We have been struggling a bit since we opened and we want to maximise our sales.\" \nShe said guests at Sparkles Nitespot parties are entertained by DJs and the occasional live vocalist. \nThe venue's Facebook page lists the music styles as afrobeat, hip pop, R'n'B and dancehall. \nMrs Makwabarara said if the council grants the operating hours extension she and the other organisers would consider opening on a Thursday evening or on a Saturday afternoon to show football matches. \nThis weekend the nightclub will be used as the backdrop of a music video for a singer friend of Mrs Makwabarara called Wesley who goes by the stage name Wisky. \nProduction company De Williams Entertainment is asking on social media for Bolton girls to turn up for filming on Saturday. \nThe announcement says: \"Video shoot on Saturday. We are only shooting the bar scenes. \n\"The limo scenes will be the following week. Anyone is welcome but you have to dress smart and classy. Men and women.\" \nSparkles Bar — the former Anchor Inn pub — was sold at auction. \nThe new owner has leased the venue temporarily to Mrs Makwabarara while a new buyer is sought. \nMrs Makwabarara found out the venue was available thanks to Bolton Council's scheme encouraging regeneration of the town centre. Promoted Stories", "external_links": [], "published": "2015-10-16T07:05:00.000+03:00", "crawled": "2015-10-18T03:42:13.796+03:00", "highlightTitle": ""}