{"organizations": [], "uuid": "b18ff1a6aea85e4e4f55c08f406049247a62e543", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "abcnewsradioonline.com", "main_image": "http://abcnewsradioonline.com/storage/news-images-september-2015/Survivor Cambodia.jpg?__SQUARESPACE_CACHEVERSION=1443702019872", "site_section": "http://abcnewsradioonline.com/entertainment-news/rss.xml", "section_title": "Entertainment News - ABC News Radio", "url": "http://abcnewsradioonline.com/entertainment-news/survivor-cambodia-second-chance-recap-shirin-is-eliminated.html", "country": "US", "title": "\"Survivor Cambodia: Second Chance\" Recap: Shirin Is Eliminated", "performance_score": 0, "site": "abcnewsradioonline.com", "participants_count": 1, "title_full": "\"Survivor Cambodia: Second Chance\" Recap: Shirin Is Eliminated", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T15:00:00.000+03:00", "replies_count": 0, "uuid": "b18ff1a6aea85e4e4f55c08f406049247a62e543"}, "author": "Joi-Marie McKenzie", "url": "http://abcnewsradioonline.com/entertainment-news/survivor-cambodia-second-chance-recap-shirin-is-eliminated.html", "ord_in_thread": 0, "title": "\"Survivor Cambodia: Second Chance\" Recap: Shirin Is Eliminated", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Share Article \nTimothy Kuratek/CBS (NEW YORK) -- On Wednesday's episode of Survivor Cambodia: Second Chance , a classic immunity challenge left one tribe puzzled, while one castaway attempted a heartfelt apology in an effort to stave off elimination before the tribal council. \nAt camp, Abi-Maria Gomes overheard fellow Ta Keo tribe members Peih-Gee Law and Shirin Oskooitrash-talking her, which led to an altercation between Peih-Gee and Abi-Maria. Peih-Gee returned to the shelter and everyone was laughing at Abi, including the people who had previously aligned with her. Terry Deitz stepped in to cheer her up and the two formed an alliance, later joined by Jeff Varner. \nWednesday’s immunity challenge required both tribes to race across a series of a-frames while carrying coils of rope, then use that rope to pull the crate to the finish. Two tribe members then used the pieces inside the crate to solve a puzzle. In addition to immunity, rewards included a Survivor tool kit that included hammers, axes and chisels, and more necessary items to make their lives easier waiting back at camp. Ta Keo thought they had the puzzle solved, but they were wrong. Bayon tried next and was correct. \nRealizing the others were gunning for one of them to get booted off the island, Shirin and Spencer Bledsoe tried to stave off elimination. Shirin attempted an apology to Abi-Maria, and she and Bledsoe each tried unsuccessfully to make last-minute deals. \nAt the tribal conference, Varner confirmed that either Shirin or Spencer will be going home. Spencer vowed to change and get to know the other members, not to form alliances, but to “connect” with them. Jeff Probst tallied the votes and Shirin was the one sent home. \nSurvivor Cambodia: Second Chance returns Wednesday at 8 p.m. Eastern time on CBS.   Thursday, October 1, 2015 at 8:00AM by", "external_links": [], "published": "2015-10-01T15:00:00.000+03:00", "crawled": "2015-10-02T08:04:08.723+03:00", "highlightTitle": ""}