{"organizations": [], "uuid": "1102816c3a199582ad3e8f1e8d5ed69bc2b35963", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "http://images.worldnow.com/AP/images/8931883_G.jpg", "site_section": "http://www.cbs8.com/category/73801/entertainment", "section_title": "Entertainment News | Movies, TV, Celebrity Gossip - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30174785/train-hero-avoided-oregon-rampage-due-to-tv-show-rehearsal", "country": "US", "title": "Train hero avoided Oregon rampage due to TV show rehearsal", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Train hero avoided Oregon rampage due to TV show rehearsal - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "1102816c3a199582ad3e8f1e8d5ed69bc2b35963"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30174785/train-hero-avoided-oregon-rampage-due-to-tv-show-rehearsal", "ord_in_thread": 0, "title": "Train hero avoided Oregon rampage due to TV show rehearsal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES (AP) - Alek Skarlatos, one of three Americans hailed as heroes for stopping a terrorist attack on a Paris-bound train in August, would have been at the Oregon college where a gunman killed nine people if Skarlatos hadn't been in Los Angeles to rehearse for ABC's \"Dancing With the Stars.\"\nSkarlatos, 22, told the network's \"Good Morning America\" program that he would have been attending a class at Umpqua Community College in Roseburg, Oregon, when the man opened fire on a writing class Thursday, ABC News reported ( http://abcn.ws/1YUbsvv ) Friday.\nSkarlatos was asked if he would have taken down the shooter if he had been in the classroom.\n\"I would have tried anyways,\" he said.\nSkarlatos said he was with \"Dancing\" partner Lindsay Arnold when he received a text from a friend about the shooting. He said he then looked up the news on the Internet to confirm it.\n\"I just sat down for a second and then hid in the bathroom so the cameras couldn't see me,\" he said.\nSkarlatos said he decided quickly to return to Roseburg to be with the community.\nAs far as he knows, none of his friends were among the victims.\n\"My heart really goes out to the people who can't say the same,\" he said.\nSkarlatos and two friends, U.S. Air Force Airman Spencer Stone, 23, and Anthony Sadler, 23, received worldwide acclaim when they tackled the gunman aboard a train while vacationing in Europe. The heroics earned Skarlatos his stint on \"Dancing With the Stars.\"\nThe next installment of the competition airs on Monday. If he misses that show he would be eliminated under the rules.\n___\nThis story has been corrected to show Skarlatos' first name is Alek, not Alex.\nCopyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "external_links": ["http://abcn.ws/1YUbsvv"], "published": "2015-10-02T03:00:00.000+03:00", "crawled": "2015-10-03T02:33:54.887+03:00", "highlightTitle": ""}