{"organizations": [], "uuid": "8bbcb1f96b34d230b117274e7ad19379bb1eeed3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stalbansreview.co.uk", "main_image": "http://www.stalbansreview.co.uk/resources/images/4297105/", "site_section": "http://www.stalbansreview.co.uk/uk_national_entertainment/rss/", "section_title": "St Albans & Harpenden Review | National Entertainment News", "url": "http://www.stalbansreview.co.uk/uk_national_entertainment/13806461.James_Van_Der_Beek__I_ve_been_training_for_CSI__Cyber_role/?ref=rss", "country": "GB", "title": "James Van Der Beek: I've been training for CSI: Cyber role", "performance_score": 0, "site": "stalbansreview.co.uk", "participants_count": 0, "title_full": "James Van Der Beek: I've been training for CSI: Cyber role", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T14:54:00.000+03:00", "replies_count": 0, "uuid": "8bbcb1f96b34d230b117274e7ad19379bb1eeed3"}, "author": "", "url": "http://www.stalbansreview.co.uk/uk_national_entertainment/13806461.James_Van_Der_Beek__I_ve_been_training_for_CSI__Cyber_role/?ref=rss", "ord_in_thread": 0, "title": "James Van Der Beek: I've been training for CSI: Cyber role", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["James Van Der Beek"], "text": "James Van Der Beek: I've been training for CSI: Cyber role James Van Der Beek: I've been training for CSI: Cyber role \nPress Association 2014 / / National Entertainment News Share \nJames Van Der Beek has revealed how he has been planning a move into action for a while. \nThe Dawson’s Creek star takes on the role of FBI field agent Elijah Mundo in CSI: Cyber, alongside Patricia Arquette as Avery Ryan, the founder of the FBI’s Cyber Crime Division, in the latest spin-off in the CSI franchise. \nJames, who also appeared as himself in the comedy Don’t Trust The B**** In Apartment 23, explained: “I’ve actually been practising for stuff like this for quite a while. When I was doing comedy, I thought, ‘What’s going to be next after this comedy run?’ \n“I thought action might be a lot of fun so I started training in Krav Maga, jiu jitsu, parkour and then working with stuntmen to figure out how to transition all that real stuff on camera, so we could do it consistently without hurting anybody.” James Van Der Beek and Patricia Arquette in CSI: Cyber (Monty Brinton/CBS) \nHe continued: “In the first episode, I have to go underwater, break a window and cut a baby out of a car seat, chop off a railing on the back hood of a car, chasing guys a lot and running a lot, tackling and handcuffing people. \n“It’s a lot harder than it looks actually. I was walking around, asking co-workers if I could cuff them.” \nThe actor joked he has been relishing a move into more mature roles, away from his Dawson’s alter-ego. \n“I’m 38 years old so I need to play men,” he said. “It would be really inappropriate and creepy if I went back and played a really sensitive high school kid at this point in my career. \n“As an actor and as an artist, you just have to keep on pulling new tricks out of the bag and giving the audience something new to enjoy.” Share article \nCSI: Cyber begins at 10pm on Channel 5 on October 6. Promoted Stories", "external_links": [], "published": "2015-10-06T14:54:00.000+03:00", "crawled": "2015-10-06T19:11:27.082+03:00", "highlightTitle": ""}