{"organizations": ["Cosby Cosby"], "uuid": "817059563a13161a0a71c0e4a800a7e89163ac4f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wcvb.com", "main_image": "http://www.wcvb.com/image/view/-/29896236/highRes/2/-/maxh/630/maxw/1200/-/tlmabj/-/Cosby-Bill-jpg.jpg", "site_section": "http://www.wcvb.com/9849848?format=rss_2.0&view=feed", "section_title": "Entertainment", "url": "http://www.wcvb.com/news/judge-wont-dismiss-womans-molestation-suit-against-cosby/35708546", "country": "US", "title": "Judge won't dismiss molestation suit against Cosby", "performance_score": 0, "site": "wcvb.com", "participants_count": 0, "title_full": "Judge won't dismiss molestation suit against Cosby", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T23:10:00.000+03:00", "replies_count": 0, "uuid": "817059563a13161a0a71c0e4a800a7e89163ac4f"}, "author": "", "url": "http://www.wcvb.com/news/judge-wont-dismiss-womans-molestation-suit-against-cosby/35708546", "ord_in_thread": 0, "title": "Judge won't dismiss molestation suit against Cosby", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Judge won't dismiss woman's molestation suit against Cosby Cosby attorneys say lawyers violated sex abuse case rules Published 4:10 PM EDT Oct 07, 2015 Photos CNN \nA judge on Wednesday refused to throw out a lawsuit filed by a woman who accuses Bill Cosby of molesting her when she was 15, saying the comedian can still receive a fair trial despite procedural errors. \nLos Angeles Superior Court Judge Craig Karlan's ruling came over the objections of Cosby's attorneys, who sought to dismiss Judy Huth's case because her previous attorney violated rules for how older sex-abuse cases should be handled. \nCosby's attorney Martin Singer argued the lawsuit improperly included Cosby's name, which caused the comedian harm and required him to defend himself against numerous other allegations from women who claim he abused them decades ago. \n\"This was the linchpin that triggered everything going forward,\" Singer said. \nHuth's former attorney admitted Wednesday he erred by naming Cosby in the lawsuit filed in December 2014. Huth, 57, claims Cosby forced her to perform a sex act on him at the Playboy Mansion around 1974. \nCosby's lawyers have denied those claims and said Huth's former attorney attempted to extort $250,000 from the comedian for before filing the case. Singer also has said Huth attempted to sell her story to the National Enquirer 10 years ago. \n\"We believe this is a frivolous suit,\" Singer said, adding Huth's ex-lawyer used it to avoid a potential extortion claim. \nHuth's lawsuit is one of three filed against the comedian since last year, when sexual abuse allegations against him started drawing new scrutiny. One of the other suits is a defamation case; three women filed it in Massachusetts alleging statements released on Cosby's behalf labeled them liars. \nModel Chloe Goins filed the third lawsuit Tuesday in a Los Angeles federal court. \nShe says the comedian drugged and sexually assaulted her at the Playboy Mansion in 2008. \nCosby's attorneys have not commented on her lawsuit. \nKarlan said in his ruling that he was troubled by the mistake by Huth's previous lawyer, but despite that he felt Cosby could still get a fair trial. \nHuth's former attorney, Marc Strecker, acknowledged he overlooked a portion of the legal code that states claims by adult plaintiffs that they were victims of underage sexual abuse should omit the defendant's real name. \"I made a mistake,\" Strecker said. \nLos Angeles prosecutors declined to file charges against Cosby over Huth's allegations, citing the statute of limitations. Prosecutors are reviewing Goins' allegations for a possible case. \nThe AP doesn't normally identify people who say they are victims of sexual abuse, but Huth and Goins have both come forward publicly in their lawsuits and at news conferences. \nKarlan also ruled Wednesday that Cosby's upcoming deposition in the Huth case will remain under seal until a December hearing. Cosby is scheduled to be deposed Friday.", "external_links": [], "published": "2015-10-07T23:10:00.000+03:00", "crawled": "2015-10-08T02:10:26.399+03:00", "highlightTitle": ""}