{"organizations": [], "uuid": "6f35a3e763548bbfe903846902297e754c7d01e5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "thestir.cafemom.com", "main_image": "http://cdn-ugc.cafemom.com/gen/full/2015/10/10/21/di/3y/pow13ae74g.jpg", "site_section": "http://feeds.feedburner.com/cafemom/thestir/entertainment", "section_title": "The Stir By CafeMom: Entertainment", "url": "http://thestir.cafemom.com/celebrities/191538/president_obama_gives_kanye_west", "country": "US", "title": "President Obama Gives Kanye West Some Presidential Words of Wisdom (VIDEO)", "performance_score": 0, "site": "cafemom.com", "participants_count": 0, "title_full": "President Obama Gives Kanye West Some Presidential Words of Wisdom (VIDEO)", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T04:34:00.000+03:00", "replies_count": 0, "uuid": "6f35a3e763548bbfe903846902297e754c7d01e5"}, "author": "", "url": "http://thestir.cafemom.com/celebrities/191538/president_obama_gives_kanye_west", "ord_in_thread": 0, "title": "President Obama Gives Kanye West Some Presidential Words of Wisdom (VIDEO)", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "0 \nRemember when Kanye West announced he'd be running for president in 2020? Chances are you didn't take the rapper all that seriously -- but maybe you should have. Because one person who knows a thing or two about being president seems to be taking Kanye seriously : President Barack Obama! \nDuring a speech at Saturday's Democratic National Committee fundraiser in San Francisco (including a performance by Kanye), Obama offered some hard-won wisdom to the possible presidential hopeful: \n“In case Kanye is serious about this whole POTUS thing -- or as he calls it, ‘Peezy’ -- I do have advice for him,” he said. \n“Saying you have a beautiful, dark, twisted fantasy, that’s what known as off-message in politics,\" Obama continued. \n\"You can’t say something like that. A lot of people have lost their congressional seats saying things like this. We don’t do that.” \nStill, as Obama pointed out, Kanye does have some unique experiences under his belt that just might make him qualified to be leader of the free world. After all, like Kanye, Obama has dealt \" with some strange characters who behave like they’re on a reality TV show,\" as he put it. \nMore from The Stir: Kanye West Announces He's Running for President & We Aren't Sure Whether to Laugh or Cry \nThat said, the odds aren't necessarily in Kanye's favor, Obama (cheekily) warned: \n“Do you really think this country is going to elect a black guy from the South Side of Chicago with a funny name to be president of the United States? That is crazy,\" he said. \nGood one, POTUS! Seriously though, the idea of Kanye running for president seems progressively less crazy the longer Trump's campaign goes on, doesn't it? Anyway. Obama's good sense of humor is also on display in this pic posted by Mrs. Kanye West, a.k.a. Kim Kardashian, to Instagram: That's Obama's signature next to the number #44 (as in the 44th president) and Kanye's signature next to the number #46 (get it? get it??). A photo posted by Kim Kardashian West (@kimkardashian) on Oct 10, 2015 at 2:38pm PDT \nWhoa, pretty heavy! Or funny? Maybe both? Anyway, if this whole thing is seeming a bit too unbelievable for you, maybe Kim's Instagram post of Obama's speech will help you to accept reality: A video posted by Kim Kardashian West (@kimkardashian) on Oct 10, 2015 at 3:27pm PDT \nYup. There you have it. President Obama. POTUS. Peezy. PEEZY. \nAmerica's First Family, indeed!!", "external_links": [], "published": "2015-10-11T04:34:00.000+03:00", "crawled": "2015-10-11T10:34:58.277+03:00", "highlightTitle": ""}