{"organizations": [], "uuid": "e30b8e18e4bc6689e8ede6385ba94f861376a592", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.northjersey.com", "main_image": "http://www.northjersey.com:80/polopoly_fs/1.1431901!/fileImage/httpImage/101415-f-playboy1-50p.jpg", "site_section": "http://www.northjersey.com/cmlink/arts-and-entertainment-rss.rss", "section_title": "Arts and Entertainment on NorthJersey.com", "url": "http://www.northjersey.com/arts-and-entertainment/entertainment-news/no-nudes-is-good-news-or-so-playboy-says-1.1431900", "country": "US", "title": "Ervolino: Nudity is passe? Yes, according to Playboy", "performance_score": 0, "site": "northjersey.com", "participants_count": 0, "title_full": "Ervolino: Nudity is passe? Yes, according to Playboy", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T08:21:00.000+03:00", "replies_count": 0, "uuid": "e30b8e18e4bc6689e8ede6385ba94f861376a592"}, "author": "", "url": "http://www.northjersey.com/arts-and-entertainment/entertainment-news/no-nudes-is-good-news-or-so-playboy-says-1.1431900", "ord_in_thread": 0, "title": "Ervolino: Nudity is passe? Yes, according to Playboy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Marilyn Monroe", "Hugh Hefner"], "text": "Buy this photo APPlayboy founder Hugh Hefner holds a vintage issue with Marilyn Monroe on the cover. \nLast November, when we saw Kim Kardashian's ample derriere staring at us from the cover of Paper magazine (and practically every other news outlet in the free world), we had a feeling that nudity's days were numbered. \nStill, it was a shock to the system this week when Playboy magazine announced that nude women would no longer grace its pages. \nPlayboy? \nReally?? \nDoes Hugh Hefner know about this? \nHefner, who created the magazine in 1953 — the premiere issue featured stunning nude photos of then-starlet Marilyn Monroe — and grew it into a global media and lifestyle empire, turned 89 this year. And although he is still listed as the magazine's editor-in-chief, his daughter Christie Hefner took over the reins from 1988 to 2009 — a period in which the company was less concerned about its raunchy imitators than it was about the immediacy and accessibility of sexy stories, jokes and images on the Internet. \nAs Scott Flanders, the company's current CEO said last year in an interview with Entrepreneur magazine, \"You could argue that nudity is a distraction for us and actually shrinks our audience rather than expands it. At the time when Hef founded the company, nudity was provocative, it was attention-grabbing, it was unique, and today it's not. It's passé.\" \nThat sentiment was echoed this week by Cory Jones, a top editor at Playboy, who said in an interview with The New York Times, \"Don't get me wrong, 12-year-old me is very disappointed in current me. But it's the right thing to do.\" \nNot that Playboy has ever wanted for other, equally compelling content. Through the years, its contributing writers have included Saul Bellow, Vladimir Nabokov, Ian Fleming and Arthur C. Clarke. And John Cheever. And Joyce Carol Oates. \nLiterary cachet \n\"I just buy it for the articles!\" became a popular punch line when referring to the magazine, best known for its topless (and eventually bottomless) \"playmates.\" But it was a punch line anchored in fact. And the magazine was taken so seriously that even politicians, including a presidential candidate by the name of Jimmy Carter, agreed to sit down for interviews. (According to some politicos, Carter's controversial 1976 interview, in which he admitted \"I've looked on a lot of women with lust ...\" may have actually helped him win the election.) \nAs for the nude lovelies, they included Pamela Anderson, Jayne Mansfield, Jenny McCarthy and Anna Nicole Smith — as well as more established stars (who appeared nude, or semi-nude) such as Kim Basinger, Nancy Sinatra, Drew Barrymore, Linda Evans, Joan Collins and Farrah Fawcett. \nAlthough women often dismissed Playboy's saucy centerfolds as \"adolescent\" in the 1950s and '60s and \"offensive to women\" in the '70s, Hefner — a legendary libertine and libertarian — has always insisted that he loves women and wanted to celebrate and empower them. The magazine played a pivotal role in the sexual revolution and has always championed progressive causes and First Amendment issues. He was a lifelong proponent of advancing women in the workplace and has always supported equal rights for gays — a cause that Hefner began to champion, on the pages of Playboy, as far back as 1955. \nIn the post-feminist era, the magazine would also be criticized for providing overly idealized — \"airbrushed\" — images of female pulchritude. One of its best-remembered \"Barbie dolls\" was even named Barbie. (Playboy bunny-turned actress Barbie Benton was Hefner's constant companion from 1968 to 1976, although the couple never wed.) Readers didn't complain, though, particularly teenaged male readers, who did their best to sneak off with copies of the magazine when their parents weren't around. \nYoung males surreptitiously reading Playboy was such an American tradition and rite of passage that everyone got the joke in the 2006 movie \"The Devil Wears Prada,\" when the gay character played by Stanley Tucci confessed that he pretended to love soccer as a kid, while he was secretly reading fashion magazines under the covers at night. \n'Quaint' vintage issues \nToday, copies of the first issue of Playboy have fetched more than $6,000 at auction, and other issues from the 1950s, even without Monroe, are worth several hundred dollars to collectors. Perhaps it's because the magazines, which some branded pornographic at the time, are now almost considered quaint, particularly when compared to what is available online. \nThe Internet, which was allegedly \"broken\" last year by Kim Kardashian's rear end — it's since been \"fixed\" — offers plenty of naked women for free. So many, in fact, that the current management of Playboy considered nude playmates to be a distraction on their own website. \nAs company executives noted in interviews this week, the decision to drop nudes from the site last year yielded positive results, increasing page hits from 4 million per month to 16 million. \nAs Playboy fan Bart Simpson might say, \"Cowabunga, dude!\" \nLet's make no mistake, though: Sex still sells. It just sells different things these days — and un-sells others.  ", "external_links": [], "published": "2015-10-14T08:21:00.000+03:00", "crawled": "2015-10-14T08:55:33.518+03:00", "highlightTitle": ""}