{"organizations": [], "uuid": "2a9c13b7573b71d8c993aeeee7a22e875d6f8bfa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.examiner.com", "main_image": "http://cdn2-b.examiner.com/sites/default/files/styles/image_content_width/hash/ff/b6/ffb669d5d2c0628eec044b09c70c103a.JPG?itok=TMHgqUEt", "site_section": "http://www.examiner.com/arts-and-entertainment", "section_title": "Arts &amp; Entertainment | Examiner.com", "url": "http://www.examiner.com/article/5-things-we-want-to-see-from-blindspot-now-that-jane-s-identity-is-revealed", "country": "US", "title": "5 things we want to see from 'Blindspot' now that Jane's identity is revealed", "performance_score": 0, "site": "examiner.com", "participants_count": 1, "title_full": "5 things we want to see from 'Blindspot' now that Jane's identity is revealed | Examiner.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T17:01:00.000+03:00", "replies_count": 0, "uuid": "2a9c13b7573b71d8c993aeeee7a22e875d6f8bfa"}, "author": "Brittany Frederick", "url": "http://www.examiner.com/article/5-things-we-want-to-see-from-blindspot-now-that-jane-s-identity-is-revealed", "ord_in_thread": 0, "title": "5 things we want to see from 'Blindspot' now that Jane's identity is revealed", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "'Blindspot's' FBI team has at least 10 more episodes ahead of them. Here are 4 things we want to see from the NBC thriller. Courtesy of NBC Last week, NBC 's Blindspot gave audiences the identity of Jane Doe . Now with that mystery solved, there's a lot more ahead for Jane, Kurt Weller, and the other members of the FBI's Critical Incident Response Group - and a lot of possibilities. Here are five things that we want to see from Blindspot in the remainder of season one.\n1. No backtracking on Jane's identity\nThe series told us in no uncertain terms that Jane ( Jaimie Alexander ) is Taylor Shaw, Weller's missing childhood friend. Patterson (Ashley Johnson) says that she did multiple DNA tests to confirm the results. So it would be a tremendous slap in the face to both the characters and the audience if later down the line, Blindspot comes up with some reason why those results are wrong and Jane is, in fact, some woman who works in a Home Depot in Manhattan. Other shows have shown no shame in pulling bait-and-switches with big reveals in the past, but mercifully this one seems like it's above that, and we're expecting it to stick to its guns.\n2. The search for whoever abducted Jane/Taylor in the first place\nWhen Taylor went missing 25 years ago, it didn't just affect her. It traumatized Weller, whose father was accused of the crime and, according to his sister Sarah (Jordana Spiro), is now dying of lung cancer while being a suspected child murderer. The incident destroyed his marriage and likely had at least a hand in his son joining the FBI. Now that she's back, Blindspot owes it to the character of Weller to answer the equally important question of who took Taylor. Maybe there is a chance to repair the Weller family, or at least an opportunity for Sullivan Stapleton to deliver some gut-wrenching angsty performances.\n3. Don't turn Reade into a traitor\nThe second and third episodes of Blindspot have made it clear that Edgar Reade ( Rob Brown ) disagrees with Weller about the use of Jane in their cases, and thinks he's \"too close\" to her, a viewpoint which will probably be exacerbated by knowing she's now a girl from his boss's past. It's fun that the members of the CIRG team don't always agree, but especially with Carter (Michael Gaston) sniffing around, let's not make Reade out to become some sort of informant within his unit. That plotline is so tired across any genre; remember when Fox even did it on the medical drama Mental ? Let's not break up the band already.\n4. Figuring out what's going on with Zapata\nTasha Zapata (Audrey Esparza) is the one member of the CIRG roster that we've yet to discover anything about. We know about Weller's family, Reade's sense of humor, and Patterson's ability to make every technological discovery sound like the most awesome thing ever, but the secretive Zapata remains more of a mystery than Jane. We can't wait to start learning about Zapata and what she contributes to the unit, and then also get to see more of what Esparza can do.\n5. That Blindspot and The Player crossover\nYes, it'd be fantastic for former Strike Back co-stars Stapleton and Philip Winchester to be reunited on screen, but that's not the only reason we'd really love to see that happen. It would make for interesting storytelling between two fantastically crafted shows, and it would be interesting to see what Weller thinks of former FBI agent turned private security expert turned ultimate gambler Alex Kane. Check out our article on why a Blindspot and Player crossover would be a great idea this fall TV season.\nBlindspot airs Mondays at 10 p.m. ET/PT on NBC. For information on tonight's new episode, \"Bone May Rot,\" check out our preview .", "external_links": ["http://www.cinemax.com/strike-back", "http://www.nbc.com/blindspot"], "published": "2015-10-12T17:01:00.000+03:00", "crawled": "2015-10-12T22:00:40.780+03:00", "highlightTitle": ""}