{"organizations": [], "uuid": "9e500b6a59f857533ce2ee32ab58e9f6f47bf7f8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266353/arts-entertainment-television", "section_title": "Arts &amp; Entertainment: Television - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30249024/steelseries-introduces-new-rival-100-optical-gaming-mouse-with-best-in-class-performance-and-features", "country": "US", "title": "SteelSeries Introduces New Rival 100 Optical Gaming Mouse with Best-In-Class Performance and Features", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "SteelSeries Introduces New Rival 100 Optical Gaming Mouse with Best-In-Class Performance and Features - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T19:02:00.000+03:00", "replies_count": 0, "uuid": "9e500b6a59f857533ce2ee32ab58e9f6f47bf7f8"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30249024/steelseries-introduces-new-rival-100-optical-gaming-mouse-with-best-in-class-performance-and-features", "ord_in_thread": 0, "title": "SteelSeries Introduces New Rival 100 Optical Gaming Mouse with Best-In-Class Performance and Features", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The New Rival Lives Up to Its Name with a $39.99 / 39.99 Price Tag and Unbeatable Tracking Accuracy\nCHICAGO, IL (PRWEB) October 13, 2015\nSteelSeries, the leading global manufacturer of gaming peripherals, introduced the Rival 100 as the best-performing entry-level mouse available. The Rival 100 gives gamers 40% higher tracking accuracy and movement-tracking speeds up to 33% faster than top competitive mice. In addition to delivering the performance needed to match the reaction time of the world’s best gamers, the Rival 100 has customizable Prism RGB illumination and an ergonomic form-factor designed to fit the grip of all gamers.\n“We determined early-on that we weren’t going to sacrifice anything when designing the Rival 100. In fact, it was our goal to develop a multi-button gaming mouse, with features and performance beyond any similarly-priced mouse,” said Ehtisham Rabbani, SteelSeries CEO. “We are confident that this is the mouse gamers are demanding.”\nUNDER THE HOOD\nThe custom-engineered sensor of the Rival 100 delivers superior, unmatched performance. The enhancements made to create this new-breed sensor produce significant advantages for users, like:\nSuperior tracking accuracy: Professional gamers depend on their gear’s tracking accuracy to perform those amazing super-human, reflex plays. That is why all SteelSeries Rival mice have zero hardware acceleration. The Rival 100’s optical sensor offers gamers true 1:1 tracking accuracy. Optimized lift-off distance: Unlike gaming mice that reduce tracking performance to achieve a lower lift off distance, the Rival 100 sacrifices nothing by offering the best tracking performance paired with an optimal low lift of distance making it the best gaming mouse in its class.\nThese attributes combined with SteelSeries’ 30 million-click switches gives gamers more than any other gaming mouse under $50 on the market\nON THE OUTSIDE\nThe ergonomic shape and 6-button right-handed layout were designed to work comfortably with any grip style. The mouse features a soft-touch surface with sculpted side grips that provide a raised texture for maximum comfort, so gamers never lose grip or control in the heat of battle.\nMAKE IT YOURS\nSteelSeries delivers Prism RGB illumination on the Rival 100 – the only mouse in its class with millions of color options, variations and features. Features beyond color, like illumination motions and real-time game actions via GameSense can all be controlled through the powerful, SteelSeries Engine software suite.\nSteelSeries Engine allows users to map the 6 buttons to custom game controls, adjust optical sensor sensitivity for any style or speed of play and create personalized configurations from acceleration/deceleration to CPI settings.\nThe Rival 100 Optical Gaming Mouse is available now on SteelSeries.com for $39.99 / 39.99 MSRP. For more information on the mouse specifications please visit http://steelseries.com/rival100 .\nAbout SteelSeries\nSteelSeries is a gaming brand that leads the market in building peripherals with quality, innovation and purpose. The company’s passion has been the driving force behind many first-to-market innovations and technologies that continue to become the industry standard and have-to-have requirements of gamers. The global brand continues to support the growth of competitive gaming tournaments and electronic sports leagues through professional team sponsorships, partnerships and community support. The company surrounds itself with the passion and the commitment to being the best. It is with this mentality that SteelSeries chooses to partner with some of world’s most respected and recognized brands that work together to push the growth and evolution of the gaming industry into an even greater proposition http://SteelSeries.com . Follow SteelSeries on social media for the latest updates and to be a part of the conversation on Twitter @SteelSeries.\n //www.prweb.com/releases/2015/10/prweb13017967.htm\n ", "external_links": ["http://steelseries.com/rival100", "http://www.prweb.com/releases/2015/10/prweb13017967.htm"], "published": "2015-10-13T19:02:00.000+03:00", "crawled": "2015-10-13T20:18:40.446+03:00", "highlightTitle": ""}