{"organizations": [], "uuid": "c793674b214b293e62a1f7d031e7122c8a7313e3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.voxy.co.nz", "main_image": "", "site_section": "http://voxy.co.nz//entertainment/feed", "section_title": "Voxy.co.nz - Entertainment", "url": "http://www.voxy.co.nz/entertainment/nz-festival-set-give-creative-capital-art-attack/5/235076", "country": "US", "title": "NZ Festival set to give creative capital an 'art attack'", "performance_score": 0, "site": "voxy.co.nz", "participants_count": 1, "title_full": "NZ Festival set to give creative capital an 'art attack'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T09:00:00.000+03:00", "replies_count": 0, "uuid": "c793674b214b293e62a1f7d031e7122c8a7313e3"}, "author": "Fuseworks Media", "url": "http://www.voxy.co.nz/entertainment/nz-festival-set-give-creative-capital-art-attack/5/235076", "ord_in_thread": 0, "title": "NZ Festival set to give creative capital an 'art attack'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Fuseworks Media Wednesday, 21 October, 2015 - 18:00 \nExciting Australasian exclusives, an avian-inspired light and sound experience in the midst of native bush, 150 international musicians playing a ‘love letter to peace’, and a free junkyard fairground are just some of the experiences on offer during the 2016 New Zealand Festival in Wellington. \nThe three-week festival will roar into action on 26 February, with the programme unveiled on Wednesday including an electrifying series of cutting-edge acts across multiple arts platforms. \nWellington Regional Economic Development Agency chief executive Chris Whelan says the New Zealand Festival has been a much anticipated highlight of Wellington’s cultural calendar for 30 years. \n\"Once again Wellington will be abuzz with some of the most exciting contemporary art and performance on the planet, and the whole region will feel the festival spirit.\" \nIn true Wellington fashion, the festival programme features something for everyone - with a full schedule of contemporary, classical and family-friendly experiences. \nOne of Wellington’s most feted musical sons, composer John Psathas, has gathered together 150 musicians from across the world for his monumental \"love letter to peace\", No Man’s Land, while the Royal New Zealand Ballet return to the programme for the first time in 12 years with an explosive mixed bill, Speed of Light. \nThe first-ever appearance in New Zealand of the late German dance-maker Pina Bausch’s extraordinary company Tanztheater Wuppertal is among eight Australasian exclusives during the festival. Other highlights promise to be La Veritá, in which Switzerland-based Compagnia Finzi Pasca bring the surreal world of painter Salvador Dali to life through extraordinary imagination and dazzling acrobatics, and cinematic theatre show Cineastas, where five actors portray scores of characters in a play with eight plotlines and a two tier set. \nThe free-to-attend Contact Festival Playground in Frank Kitts Park is also sure to delight, hosting the parent-powered junkyard fairground Arquitecutra de Feria. The playground features vintage motorbikes seats on a merry-go-round and toilet bowl seats on a Ferris wheel, among many other amazing creations. \nThe artists behind 2014 festival favourite Power Planet return to the city again, this time bringing the Wellington Airport Season of For the Birds, which will see an immersive avian-inspired light and sound experience take over Otari Wilton’s Bush reserve from 3-19 March. \nPositively Wellington Tourism chief executive David Perks says the city’s collection of year-round attractions would also be turning it on for locals and cultural tourists alike. \n\"From Gallipoli: the scale of our war and The Great War Exhibition, to Nga Toi at Te Papa, a tribute to an artist who changed the way we think about New Zealand art history at City Gallery, and the recently upgraded and visitor favourite Wellington Museum, there will be a phenomenal programme on offer throughout the city.\" \nVisitors are advised to book early, Mr Perks says. \n\"With such a fantastic line-up in the midst of peak international visitor season, we’re encouraging arts fans to make their plans and travel bookings nice and early.\" \nPositively Wellington Tourism is a unit of the recently formed Wellington Regional Economic Development Agency. \nFor more festival details visit WellingtonNZ.com/NZFestival \nAll articles and comments on Voxy.co.nz have been submitted by our community of users. Please notify us through our contact form if you believe an item on this site breaches our community guidelines .", "external_links": [], "published": "2015-10-21T09:00:00.000+03:00", "crawled": "2015-10-21T10:58:59.335+03:00", "highlightTitle": ""}