{"organizations": [], "uuid": "6fc1cd8f69fbf27103a21576194d34b61f48eb67", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thetrentonline.com", "main_image": "http://thetrentonlinecom.c.presscdn.com/wp-content/uploads/2015/06/Onyeka-Nwelue.jpg", "site_section": "http://www.thetrentonline.com/category/entertainment-2/feed/", "section_title": "The Trent » Entertainment", "url": "http://www.thetrentonline.com/a-day-as-onyeka-nwelues-student-at-the-royal-arts-academy-by-ephraim-adiele/", "country": "US", "title": "A Day As Onyeka Nwelue’s Student At The Royal Arts Academy, By Ephraim Adiele", "performance_score": 0, "site": "thetrentonline.com", "participants_count": 1, "title_full": "A Day As Onyeka Nwelue’s Student At The Royal Arts Academy, By Ephraim Adiele", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T10:13:00.000+03:00", "replies_count": 0, "uuid": "6fc1cd8f69fbf27103a21576194d34b61f48eb67"}, "author": "Ephraim Adiele | Associate Editor", "url": "http://www.thetrentonline.com/a-day-as-onyeka-nwelues-student-at-the-royal-arts-academy-by-ephraim-adiele/", "ord_in_thread": 0, "title": "A Day As Onyeka Nwelue’s Student At The Royal Arts Academy, By Ephraim Adiele", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Onyeka Nwelue \nby Ephraim Adiele \nIt was Monday, October 19, 2015; I woke up very early that day for no apparent reason. Everyone close to me knows that I don’t sleep much, I’m usually up before 4:00am, maybe earlier sometimes, but on this day I woke up by 12:45 am. And by awake I mean wide awake with no plans to sleep for the next few hours. \nI checked my e-mail in order to get some work done and saw Onyeka Nwelue’s mail, then I suddenly remembered, I was to be a the Royal Arts Academy, Surulere. Onyeka had copied me in a mail he sent to his students. The mail was about an Ishaya Bako documentary – “Fuelling Poverty” – which was banned by the Nigerian government. I quickly watched the documentary and read the script. Then I became excited. \nI had missed his first invitation to attend the class on Thursday, October 15, 2015. I had rushed down from Enugu the previous day just to meet up with the class, but on the fateful day I got to the class the very moment it was ending owing to a combination of terrible Lagos traffic and uninformed people who misdirected me for over 45 minutes. \nAnyway, I decided that I would have none of that this time around. As the day broke gradually, I kept looking up at the clock from time to time. By 11am I hit the road. The class was for 1pm. \nWords will fail me if I attempt to explain how miffed I was by the kind of traffic that kept me from navigating from Ikotun to Surulere in less than two hours. God! I ended up at Royal Arts Academy at exactly 1:39 pm. You should see the inside of me to know how angry I was but true to my nature I kept a straight face because, hey! I’m not a handsome man and would not want to scare innocent students in Onyeka’s class who had done nothing to deserve my ugly-angry look. \nSo I got to the class and met the actor Temitope Tadela talking to the students. He was calm. His voice was calm, but he was dishing out hard hitting facts. Tadela told the students about perspective, how life should be viewed, how not to expect opportunities to land on your feet just because you did this, or that. I enjoyed Tadela’s talk. He spoke on religion and the influence of the universe in the affairs of men. He sounded intelligent and to some extent, honest. When he was done, a few students asked questions and after that some of them took pictures with him. Temitope Tadela addressing the students (Photo Credit: Ephraim Adiele/TheTrent 1 of 3 \nWhen he was gone, Onyeka asked the students about the mail he had sent earlier that morning. The same one I received. To my surprise only about three people acknowledged receipt of the mail. None of the three had bothered going through the details of the mail. I clenched my jaw. I wondered how busy these students must be. I receive an average of 50 mails per day and I attend to most of them. I was not even a student of Royal Arts Academy but I had read the script in the email and watched the documentary. Well, the students apologized, with one of them, whose nickname I believe was JUICE even kneeling in the middle of the class on behalf of his colleagues. 1 of 5 \nThen came the alcohol, I like alcohol. Onyeka had bought alcohol for his students! Who does that? But I caught his drift. He wanted them to loosen up and relax, and they did. They were relaxed, very relaxed. Unfortunately I was not given any alcohol; the students obviously did not feel that “new face” (who barely said anything to anybody but was busy taking pictures of them) needed alcohol. But I’m fine. I had had alcohol before I came to the class and I was to have some more alcohol after I left the class. \nThere was a brief stop over by a young lady. Onyeka later informed me that she is the younger sister to Emem Isong. She had come for something else, but Onyeka invited her to speak briefly. Although she didn’t want to, she ended up striking the nail on the head. She must be a writer, I guess. She spoke about writers in the acting industry. She told them the stark truth of how hard it is to make money off writing scripts. Some of the students did not like that part. But they needed to hear it. She spoke of the numerous opportunities in the movie industry and the need not to focus on only one aspect of the acting industry. Emem Isong's sister speaking to the class (Photo Credit: Ephraim Adiele/The Trent) 1 of 4 \nSoon after, Onyeka had another person speaking to the class. The actor, Sambasa Nzeribe took the floor. He spoke on a lot of issues. He started slowly, shyly, patronizingly. I guess that’s what makes him an actor. In no time, he had the attention of the students and he started feeling at home. He was also blunt. He spoke on how he grew up as an orphan and had to really hustle to where he was. He spoke with and about passion. I liked his style to an extent. The students asked him question after question after question. He gave answer after answer after answer. I was not a dull place to be. The atmosphere was young, pardon my French! He was seated initially, just like Tadela. But when he was asked how he gets focused and what made him thick, he stood up and started acting out an imaginary script. He is an actor abeg! The guys were impressed, while the ladies acted like new brides, like they had their hearts in their palms. They were drooling. I was having fun capturing everything. When Sambasa was done acting, he had won the hearts of the whole class. One girl even screamed that she loved him. And she was right. They all did, we all did. He also spoke to them about appreciating adversaries, something most people in any competitive industry see as an arduous task. At the end of the talk, they all posed for pictures and the photo session seemed like it would never end. You will read this and start thinking: WHO IS THIS ONE? Let me answer the question: THIS ONE is not a picture person. Sambasa Nzeribe lecturing the students 1 of 9 \nAnyway, while the students seemed to be ready to put Sambasa on a fine Chinese ceramic plate and feast on him, another actor, David Nnaji walked into the class. I have been a watching David since he was a teenager. He always had a professional look. So I said to myself. Let me see what he will bring to the table. He seemed impatient, like he did not want to forget anything. The look on his face was like that of a doctor who wanted to carry out an emergency operation but met his nurses eating. He needed decorum and demanded it via body language (Governor Adams Oshiomole and President Muhammadu Buhari have made that word a favourite). Then he started talking. This guy behaves like the British actor Jason Statham. Plenty action, in a good way though. The students needed someone like him. He spoke well; I think I liked his talk the most. He was the bluntest of all the speakers. At a point he said maybe only one or two of the students may be successful, they all frowned, then Onyeka said “no, they will all make it. They are bright”, then they all screamed “Amen.” I shook my head and said to myself: O YE RELIGIOUS LOT. FORGET YE NOT WHAT DAVID IS TRYING TO TELL YOU! David Nnaji speaking to the class 1 of 6 \nThe students needed someone who would not boost their egos and make them as relaxed as the average Nigerian youth seems to be. David Nnaji spoke about the rudiments of acting, maintaining professionalism, acting and standards and the need to insist on quality. He spoke to prospective directors, writers and actors. I owe him a bottle of his favourite alcoholic beverage, just for his style. He stood up all through. In no time, the students had gotten a harsh reality check, which I believe they appreciated. The place was so interesting that a class that was supposed to end by 3pm dragged on until almost 4pm and the student still did not want to leave. But then, we all had to leave. It was time to go. As usual, the students posed for pictures, with David and Onyeka. \nSo the class ended. A very interesting class I must say. Funny thing is, the teacher, Onyeka Nwelue, who is as controversial as it gets did not contribute to the “interesting-ness” of the class. He only invited other people to talk to his students. I wonder what the class would have been like if he had taken the floor. I heard the class I missed was electric. This class had some electricity in it. It was definitely not a waste of 3 hours. And I had gotten my time’s worth. \nEphraim Adiele is the Associate Editor of The Trent Online. He can be reached via e-mail: [email protected] \nThe opinions expressed in this article are solely those of the author. Sponsored Links", "external_links": [], "published": "2015-10-20T10:13:00.000+03:00", "crawled": "2015-10-20T10:29:46.782+03:00", "highlightTitle": ""}