{"organizations": [], "uuid": "a688e6e212dda5c5b5e118b34e690a3abd30739b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48524/c", "section_title": "Entertainment - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30304876/new-pedalboard-connection-system-by-maytech-music-systems-streamlines-guitarists-setup-and-teardown-reducing-cables-and-connections-and-saving-time", "country": "US", "title": "New Pedalboard Connection System by Maytech Music Systems Streamlines Guitarists' Setup and Teardown - Reducing Cables and Connections and Saving Time", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "New Pedalboard Connection System by Maytech Music Systems Streamlines Guitarists' Setup and Teardown - Reducing Cables and Connections and Saving Time - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "a688e6e212dda5c5b5e118b34e690a3abd30739b"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30304876/new-pedalboard-connection-system-by-maytech-music-systems-streamlines-guitarists-setup-and-teardown-reducing-cables-and-connections-and-saving-time", "ord_in_thread": 0, "title": "New Pedalboard Connection System by Maytech Music Systems Streamlines Guitarists' Setup and Teardown - Reducing Cables and Connections and Saving Time", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Information contained on this page is provided by an independent third-party content provider. WorldNow and this Station make no warranties or representations in connection therewith. If you have any questions or comments about this page please contact pressreleases@worldnow.com .\nSOURCE Maytech Music Systems\nThe new Patent Pending DuGyte™ Pedalboard Connection System™ combines all the guitarist's signal and power into a single All-In-One Cable™, making connecting backstage gear to your pedalboard fast and easy.\nBRISBANE, Australia and SAN DIEGO , Oct. 20, 2015 /PRNewswire/ -- Maytech Music Systems has ushered in a new evolution in pedalboard connection solutions by introducing the DuGyte Pedalboard Connection System (PCS) that combines all signal (guitar, footswitch, effects looms, wireless, midi, etc.) and power into a single All-In-One Cable. This offers guitarists the industry's fastest setup and teardown, making connecting or disconnecting pedalboard, amplifier and backstage equipment a snap. Owning a DuGyte PCS also seriously reduces the amount of guitar cables and power leads, and all but eliminates the need for wall warts and power strips.\nPhoto - http://photos.prnewswire.com/prnh/20151020/278584\nPhoto - http://photos.prnewswire.com/prnh/20151020/278583\nConnecting a pedalboard to an amplifier and other backstage equipment, guitarists normally lay multiple guitar, effects and other signal cables across the stage. Sometimes done orderly, while others just in a tangled mess. Also often requiring a myriad of wall warts, power strips and power leads to get power to their pedalboard. Notwithstanding the nuisance and potential safety hazard, until today, a simple and effective system for streamlining cable routing, and reducing the number of cables and power leads did not exist. The DuGyte now presents the guitarist with a whole new level of speed, simplicity, sound quality and power options in one complete system. There are several DuGyte GP Series models to choose from.\nDue to the often complex pedalboard layout, setup and amplifier switching needs of semi and professional players, the company offers a custom design service. So a guitarist can request a custom built system tailored to their individual and specific requirements. You can purchase the DuGyte directly from Maytech Music Systems' web site and a select set of strategic partners. To find out more, visit the company's website at www.maytechmusic.com or contact them directly.\nAccording to Managing Director Mr. Gerard Mayo , \"The DuGyte offers exceptional value to guitarist because our design solves several issues guitarists face every time they setup and teardown for a gig. There are several models for different playing styles. So whether playing in the garage, performing on a local level or as a touring professional, there is a DuGyte just right for you.\" Furthermore, he added, \"Let's face it, most guitarists are not fond of the repetitive task of setting up and tearing down their equipment. Not to mention, a DuGyte has less connection points, so there's less chance of cable or connector problems.\"\nAbout Maytech Music Systems\nMaytech Music Systems is a pioneer in developing functional systems for guitarist that are designed to add to their performance while making their life easier. Maytech Music Systems Pty Ltd., whose philosophy is Think Less Play More!™, is an Australian corporation with offices in Australia and the US, and whose primary markets include North America , Europe and Australasia.\nAustralian Contact\nGerard Mayo\nEmail\n+61.3398.9889\nUSA Contact\nJames Maida\nEmail\n+1.619.354.9160\nImage Links:\nLogo - http://www.maytechmusic.com/DuGyte_Logo_wb.jpg\nProduct - http://www.maytechmusic.com/GP_Series.jpg\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/new-pedalboard-connection-system-by-maytech-music-systems-streamlines-guitarists-setup-and-teardown---reducing-cables-and-connections-and-saving-time-300162799.html\n©2015 PR Newswire. All Rights Reserved.", "external_links": ["http://www.xmlnews.org/ns/", "http://www.maytechmusic.com/GP_Series.jpg", "http://rt.prnewswire.com/rt.gif?NewsItemId=PH33050&Transmission_Id=201510200848PR_NEWS_USPR_____PH33050&DateId=20151020", "http://www.prnewswire.com/news-releases/new-pedalboard-connection-system-by-maytech-music-systems-streamlines-guitarists-setup-and-teardown---reducing-cables-and-connections-and-saving-time-300162799.html", "http://photos.prnewswire.com/prnh/20151020/278584", "http://photos.prnewswire.com/prnh/20151020/278583", "http://pressreleaseheadlines.com/contact?pid=292825", "http://www.maytechmusic.com/DuGyte_Logo_wb.jpg", "http://www.maytechmusic.com/"], "published": "2015-10-20T03:00:00.000+03:00", "crawled": "2015-10-20T17:27:51.386+03:00", "highlightTitle": ""}