{"organizations": [], "uuid": "8c4afb33666fbfb036b075509aece0e9955adb90", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pjstar.com", "main_image": "http://www.pjstar.com/storyimage/IP/20151023/ENTERTAINMENT/151029684/AR/0/AR-151029684.jpg", "site_section": "http://www.pjstar.com/entertainment?template=rss&mime=xml", "section_title": "Entertainment - Journal Star", "url": "http://www.pjstar.com/article/20151023/ENTERTAINMENT/151029684/2052/ENTERTAINMENT?rssfeed=true", "country": "US", "title": "Duo say their art installation on Bradley's campus is fluid and ephemeral", "performance_score": 0, "site": "pjstar.com", "participants_count": 1, "title_full": "Duo say their art installation on Bradley's campus is fluid and ephemeral", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T20:42:00.000+03:00", "replies_count": 0, "uuid": "8c4afb33666fbfb036b075509aece0e9955adb90"}, "author": "Leslie Renken", "url": "http://www.pjstar.com/article/20151023/ENTERTAINMENT/151029684/2052/ENTERTAINMENT?rssfeed=true", "ord_in_thread": 0, "title": "Duo say their art installation on Bradley's campus is fluid and ephemeral", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Duo say their art installation on Bradley's campus is fluid and ephemeral Comment Posted Oct. 23, 2015 at 11:11 AM Updated at 12:42 PM Posted Oct. 23, 2015 at 11:11 AM Updated at 12:42 PM PEORIA - The artwork being constructed outside of Bradley University’s Heuser Art Center is whimsical, colorful and consciously impermanent. BU associate art professor Heather Brammeier and graduate student Jessica Bingham have been working on the installation since mid-September. Materials include items salvaged from the artists’ studios, Dumpsters, and the landscape surrounding the building. The pair have spent hours, both together and individually, arranging and re-arranging the elements with the knowledge that the work is ephemeral — not only will it be taken down some time next spring, it is also subject to environmental factors beyond the artists’ control. “When you make a piece this public, people can put something in it or take something out of it, and you have to be open to that,” said Brammeier. “And certain things might blow away. We just keep changing it as it goes. If something is not sturdy enough, we’ll take it down and put something else up.” Elements of the composition may appear or disappear. One day a plastic parking cone showed up — the artists later learned it was a present from Paul Krainak, the chairman of BU’s art department. A metal rod borrowed from a fellow artist might be called back at a moment’s notice, and the tiny golden leaves mulching the ground are likely to blow away with a few good gusts of wind. No problem. Evolution is part of the piece. Impermanence is a growing trend among artists — Bingham works by setting up displays with materials such as colored sand, fabric, paper and brightly colored tape at locations around town, photographing the results and immediately taking them down. “I think I started working this way because I didn’t want to have all these things I want to keep,” said Bingham. Equal parts economy, recycling and the desire to leave a small footprint, the trend is to create short-lived installations with materials that get used again and again. “When you create something to be permanent it’s like your artwork becomes a burden because you have to care for it and store it,” said Brammeier. “Today, a lot of artists are trying to come up with ways around that. One way is to constantly re-use the same materials in their art.” Brammeier describes herself as a painter who has expanded her practice to include constructed paintings and drawing in space. She began doing art installations about three years ago. When displaying her paintings and textile work, Brammeier began incorporating constructed and found objects for added dimension. Then she discovered red and blue PEX water lines at the hardware store. The cross-linked polyethylene pipes create endless loops of color, which appealed to the painter. Page 2 of 3 - “It lends itself to making these curvy lines,” said Brammeier, who has used the material to create large installations spilling off rooftops, tumbling down walls, and swaying in the wind. The first piece she did two years ago still hangs on an exterior wall at Heuser, right next to the installation she and Bingham are currently working on. “It was a test piece to see how the PEX would hold up outdoors, to see if it would fade and sag out of shape in the harsh winters and sunlight,” said Brammeier. Since then Brammeier has created PEX installations at the Lillstreet Art Center in Chicago, the South Bend (Indiana) Museum of Art and the Urban Institute for Contemporary Arts in Grand Rapids, Mich., where she displayed her largest piece yet — 40 feet by 80 feet by 15 feet tall. As part of ArtPrize, an international art competition that takes place every fall in Grand Rapids, the installation was only up for about a month — Brammeier took it down late last week. “Along with the PEX there were some painted wooden structures and some furniture you could sit on,” said Brammeier. “I wanted people to interact with the piece.” A bench also was incorporated into the installation outside Heuser. Brammeier and Bingham sat there Monday afternoon while discussing their work. “When we first started working together we agreed on the terms — you can change anything the other person has done without asking,” Brammeier explained. “It’s a constant process of revising and editing. We can get really excited about our ideas, then turn around later and change our minds.” A bit more flexible than a formal exhibit, the installation is a chance to experiment and spark new ideas. For Brammeier, the effort is also serving as a teaching tool and a form of outreach. “I’ve found it to be really positive for our department to have more artwork outside, especially if it’s constantly changing,” she said. “I’m using this space as a way to encourage people to come into the building. If you are not an art student, this might be something you wouldn’t think to do.” Working in a public location tends to attract attention. “People see it evolving and changing as we work on it, opening up the creative process for all to see.” The ideas the work sparks will be used again by both artists. So will the materials. And it’s quite likely the miles of PEX tubing Brammeier brought home from Grand Rapids won’t be sitting in her studio for long. “When I have a lot of materials lying around that I don’t want to throw away, I think, ‘I’ll have to make something.’” Page 3 of 3 - Leslie Renken can be reached at 686-3250 or lrenken@pjstar.com. Follow her on Twitter, @LeslieRenken, and subscribe to her on Facebook.com/leslie.renken .", "external_links": [], "published": "2015-10-23T20:42:00.000+03:00", "crawled": "2015-10-23T21:46:56.442+03:00", "highlightTitle": ""}