{"organizations": [], "uuid": "a9e0233a4dac044ebc02cbf39e5cc408acb42801", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.arcamax.com", "main_image": "http://www.arcamax.com/newspics/131/13133/1313353.jpg", "site_section": "http://www.arcamax.com/", "section_title": "News &amp; Entertainment by Email | ArcaMax Publishing", "url": "http://www.arcamax.com/currentnews/newsheadlines/s-1734166?fs", "country": "US", "title": "Obama apologizes to head of Doctors Without Borders over Afghan hospital bombing | & Features", "performance_score": 0, "site": "arcamax.com", "participants_count": 3, "title_full": "Obama apologizes to head of Doctors Without Borders over Afghan hospital bombing | News & Features | ArcaMax Publishing", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T03:00:00.000+03:00", "replies_count": 2, "uuid": "1e3f72c903f3d78f2ef7479f8eec894d2c9489e9"}, "author": "arcamax.com", "url": "http://www.arcamax.com/currentnews/newsheadlines/s-1734166?fs#post-0", "ord_in_thread": 0, "title": "Obama apologizes to head of Doctors Without Borders over Afghan hospital bombing | & Features", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON -- President Barack Obama apologized Wednesday to the president of Doctors Without Borders over the deadly U.S. bombing of a field hospital in Afghanistan, a White House spokesman said Wednesday, a reversal from a day earlier when the White House said Obama was waiting to gather facts before apologizing.\nIt wasn't immediately clear what changed Obama's view, but \"based on what the president has learned,\" he thought it was best to \"own up to our mistakes and to vow to carry out a full investigation to get to the bottom of exactly what happened,\" said White House press secretary Josh Earnest.\nThe U.S. has been helping Afghan forces trying to retake the northern city of Kunduz, overtaken by the Taliban last week in the militant group's first major claim of territory since the U.S. invaded 14 years ago.\nPentagon officials have given conflicting explanations concerning how the hospital was bombed Saturday, including both that the strike was ordered to protect U.S. troops and that Afghan forces under fire requested the strike. The top U.S. commander in Afghanistan, Gen. John Campbell, told lawmakers Tuesday that the bombing was a mistake and that the decision was carried out through the American chain of command.\nTwenty-two people were killed in the attack, and dozens of others wounded in the bombing.\nEarnest said the U.S. \"mistakenly struck\" the hospital.\nIn a phone call from the Oval Office, Obama assured the head of Doctors Without Borders, Dr. Joanne Liu, that a Pentagon investigation into the bombing would provide a \"transparent, thorough and objective accounting of the facts\" that, if necessary, would result in changes to lessen the likelihood of another attack, Earnest said.\nBut he sidestepped the question of whether the White House would support the independent investigation that Liu has called for. In a news conference in Geneva on Wednesday, Liu said the International Humanitarian Fact-Finding Commission, a group set up under the Geneva Conventions, should look into the attack.\n\"This was not just an attack on our hospital,\" Liu said. \"It was an attack on the Geneva Conventions.\"\nEarnest said investigations now underway, including one by the Pentagon, will provide the accounting the president thinks is necessary.\nAfter his apology to Liu, Obama called Afghan President Ashraf Ghani to express his condolences for the loss of life, and commended the Afghan forces in securing Kunduz.\n\"When we make a mistake, we're honest about it,\" Earnest said.\n(c)2015 Tribune Co.\nVisit Tribune Co. at www.latimes.com\nDistributed by Tribune Content Agency, LLC.\nShare Comment", "external_links": ["http://twitter.com/share?url=http://www.arcamax.com/currentnews/newsheadlines/s-1734166&hashtags=ArcaMax", "https://plus.google.com/share?url=http://www.arcamax.com/currentnews/newsheadlines/s-1734166", "http://www.facebook.com/sharer.php?u=http://www.arcamax.com/currentnews/newsheadlines/s-1734166&h=Obama+apologizes+to+head+of+Doctors+Without+Borders+over+Afghan+hospital+bombing"], "published": "2015-10-07T03:00:00.000+03:00", "crawled": "2015-10-08T12:09:36.815+03:00", "highlightTitle": ""}