{"organizations": ["Smith Center"], "uuid": "22bb79082514f8c7fd8dda1764d8ecc437c1057a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "lasvegasweekly.com", "main_image": "http://media.lasvegasweekly.com/img/photos/2015/10/14/lon_bronson_t378.jpg?42670983c634e7c20626cc4856c543752c0d8b2f", "site_section": "http://www.lasvegassun.com/feeds/headlines/ae/", "section_title": "Las Vegas Sun Stories: Arts & Entertainment", "url": "http://lasvegasweekly.com/ae/2015/oct/14/kats-report-lon-bronson-all-star-band-smith-center/", "country": "CR", "title": "The Kats Report: Lon Bronson’s All-Star Band marks 25 years with a Smith Center doubleheader", "performance_score": 0, "site": "lasvegasweekly.com", "participants_count": 0, "title_full": "The Kats Report: Lon Bronson’s All-Star Band marks 25 years with a Smith Center doubleheader", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "22bb79082514f8c7fd8dda1764d8ecc437c1057a"}, "author": "", "url": "http://lasvegasweekly.com/ae/2015/oct/14/kats-report-lon-bronson-all-star-band-smith-center/", "ord_in_thread": 0, "title": "The Kats Report: Lon Bronson’s All-Star Band marks 25 years with a Smith Center doubleheader", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["John Katsilometes"], "text": "John Katsilometes Wed, Oct 14, 2015 (5 p.m.) \nLon Bronson settles into a booth inside the Peppermill’s Fireside Lounge, just south of the lifeless Riviera, where 25 years ago in happier days he cut loose his All-Star Band. “I haven’t been here in a long, long time,” he recalls, nodding toward the famed fire-and-water pit. “That down there was the make-out zone, in the old days. It might still be. When you left it was always daylight, and there was a bar next door, the Night Gallery, that was really creepy. Just like the old TV show, a very creepy place.” \nA voice from a nearby table calls to Bronson. “I know you,” says the man in a booming voice. “I’m sh*t with names, but I’ve been a musician around here for 25 years, and I know you’re somebody.” \n“Well, I’m Lon Bronson,” says Lon Bronson. “That’s it!” the man says, elated to have run into this Vegas institution. \nFor 25 years Bronson and his band have filled lounges and showrooms with what he calls “industrial-strength” sound. As sturdy and strong as an old Chevy 350 V8 engine, the Lon Bronson All-Star Band marks its silver anniversary—and it’s increasingly silver these days for Bronson’s band and its fans—Saturday with two shows at Cabaret Jazz. The latter was to be the only concert, until it became obvious that more than 240 seats would be required to aptly celebrate this event. \n“When the Smith Center came along, it was a step up the ladder,” Bronson says. “It’s just reinvigorated the band.” \nWhen Bronson’s All-Stars first played the Smith Center in September 2013, it marked a turning point for a band that had been known strictly as a lounge act. It was a long trek to that venue, beginning with Bronson’s days as company manager for the Crazy Girls adult revue. He uprooted from New York in 1985, took a job that was supposed to be a two-week gig and has lived in Vegas ever since. \nTiring of working in a quasi-corporate environment (even in such a titillating show as Crazy Girls ), he grew eager to return to his passion, the trumpet. The famous story is that he had an “epiphany” one night in 1989, while watching Tower of Power at Calamity Jayne’s Nashville Nevada on Boulder Highway. He recruited a few musicians and pitched his concept—for a similar such band in Las Vegas—to then-Riviera entertainment director Steve Schirripa, who remains a fan to this day. \nThe Monday-night gig became legendary around town. Comics who Schirripa had booked at the comedy room would hustle to Le Bistro Lounge and perform for a few minutes. Those who regularly stopped by the Riv to sing and play included Drew Carey and Penn Jillette. A pre-fame Wayne Brady (working at the MGM Grand Adventures Theme Park at the time) famously asked to sing with the band and was turned away; Bronson had no idea who he was. Joe Walsh of The Eagles showed up several times to sing for late-night audiences. \nAn odd assortment of celebs dropped into Le Bistro: Tom Jones, The Righteous Brothers, Mick Fleetwood, David Lee Roth, Fee Waybill of The Tubes, David Cassidy (Bronson was an original member of Cassidy’s The Rat Pack Is Back cast at the Desert Inn), actor Jeremy Piven, Eddie Brigati of The Young Rascals, Kevin Eubanks from The Tonight Show , Skunk Baxter of Steely Dan. But not every experience was a winner. \nWeird Al Yankovic was invited to the stage by Bronson one night and declined to join the band, only to be chided mercilessly by the bandleader before finally walking out. Comic Jackie Mason fell asleep during a show. Jones was often asked to sing, only to put his hands to his throat, a sign that he needed vocal rest. \n“You never knew what was going to happen at the Riv, ever,” Bronson says. If there was a “golden era” for the band, it was then. They moved to the Golden Nugget in 2004, then were hustled out the next year. A six-month stretch at Margaritaville at the Flamingo, “Playing for people who were eating and drinking and did not care about the music,” followed. “That period nearly broke up the band. It was bad.” \nBronson’s friend Brody Dolyniuk, founder of the popular cover band Yellow Brick Road, suggested Bronson to then Station Casinos entertainment head Judy Alberti, who booked the All-Stars at the Railhead at Boulder Station. They later found a groove at another Station venue, Ovation at Green Valley Ranch, where they performed regularly until the spot closed to make room for a bingo parlor in 2012. Today the All-Stars play the first Thursday of each month at Club Madrid, along with their recurring shows at Cabaret Jazz. \nAt 56, Bronson has no misconceptions about the future of the band. It is now. “I don’t see us touring, and we don’t have any ambitions beyond doing what we’re doing and playing the Smith Center.” \nThe 25th anniversary is a moment to mark time, no more, no less. Someday there will be a last call for the Lon Bronson All-Star Band, and that would indeed be a first. \nLon Bronson All-Star Band 25th Anniversary Concert October 17, 7 & 10 p.m., $20-$35. Smith Center’s Cabaret Jazz, 702-749-2000.", "external_links": [], "published": "2015-10-15T03:00:00.000+03:00", "crawled": "2015-10-15T03:25:08.347+03:00", "highlightTitle": ""}