{"organizations": [], "uuid": "f7b39faeb9dc2456cf36d02efe04b515bd52d3f2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.contracostatimes.com", "main_image": "http://extras.mnginteractive.com/live/media/site568/2015/1012/20151012__treasure2~1.JPG", "site_section": "http://feeds.contracostatimes.com/mngi/rss/CustomRssServlet/571/201115.xml", "section_title": "Entertainment Columns", "url": "http://www.contracostatimes.com/news/ci_28955005/treasure-island-music-festival-here-are-12-cant?source=rss", "country": "IL", "title": "Treasure Island Music Festival: Here are 12 can't-miss acts", "performance_score": 0, "site": "contracostatimes.com", "participants_count": 1, "title_full": "Treasure Island Music Festival: Here are 12 can't-miss acts", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T21:19:00.000+03:00", "replies_count": 0, "uuid": "f7b39faeb9dc2456cf36d02efe04b515bd52d3f2"}, "author": "Jim Harrington\n\njharrington@bayareanewsgroup.com", "url": "http://www.contracostatimes.com/news/ci_28955005/treasure-island-music-festival-here-are-12-cant?source=rss", "ord_in_thread": 0, "title": "Treasure Island Music Festival: Here are 12 can't-miss acts", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Treasure Island Music Festival: Here are 12 can't-miss acts By Jim Harrington Posted: 10/12/2015 12:00:00 PM PDT Updated: 10/12/2015 02:04:56 PM PDT Deadmau5 performs during the Austin City Limits Music Festival in Zilker Park on Saturday, Oct. 10, 2015, in Austin, Texas. (Photo by Jack Plunkett/Invision/AP) ( Jack Plunkett ) It's time for a Treasure hunt. \nJust head on over to the ninth annual Treasure Island Music Festival, where an embarrassment of riches awaits indie-rock, hip-hop and electronic music fans on Saturday and Sunday. \nThis year's lineup is heavy on rising stars and young talent, with a few established acts thrown in for good measure. \nHere are our 12 best bets for the 2015 Treasure Island Music Festival: Big Grams BOSTON, MA - SEPTEMBER 26: Lauren Mayberry of Chvrches performs onstage during day two of the Boston Calling Music Festival at Boston City Hall Plaza on September 26, 2015 in Boston, Massachusetts. (Photo by Mike Lawrie/Getty Images) ( Mike Lawrie ) Big Boi (Antwan Patton) is one half of Outkast, one of the most successful hip-hop acts of all time. Phantogram is a rising electronic rock duo, consisting of Josh Carter and Sarah Barthel. Together, they form Big Grams, a new collaborative project that certainly ranks as one of the best reasons for attending the 2015 Treasure Island fest. The three artists tested the water on 2012's \"Vicious Lies and Dangerous Rumors,\" with Phantogram featured on a trio of cuts from that Big Boi solo platter, and have recently released the first Big Grams EP. \nPerforming: 8:35 p.m. Saturday, Tunnel Stage \nListen to: \"Lights On,\" \"Fell in the Sun\" Chvrches Advertisement The Scottish electronic music act made a huge impression with 2013's \"The Bones of What You Believe,\" which was one of the finest synth-pop albums to come along in years. Chvrches (pronounced \"churches\") then backed up that full-length studio debut with an even more impressive live show, which I was lucky enough to experience at the Fox Theater in Oakland in 2013. Now, the trio, consisting of lead vocalist Lauren Mayberry, multi-instrumentalist Iain Cook and synthesizer-sampler ace Martin Doherty, is back with its recently released sophomore set, \"Every Open Eye,\" which is another strong effort. \nPerforming: 7:30 p.m. Sunday, Bridge Stage \nListen to: \"Never Ending Circles,\" \"Clearest Blue\" Run the Jewels The dynamic duo, consisting of rappers extraordinaire Killer Mike and El-P, is on a major winning streak. It began when El-P produced Mike's excellent 2012 solo outing, \"R.A.P. Music,\" and continued with the dynamite \"Run the Jewels\" debut in 2013. The duo then upped the ante with \"Run the Jewels 2,\" which was hailed by many music scribes (including me) as the best hip-hop record of 2014. No wonder there's such anticipation for \"Run the Jewels 3,\" due out in 2016. \nPerforming: 4:35 p.m. Saturday, Bridge Stage \nListen to: \"Oh My Darling Don't Cry,\" \"Blockbuster Night, Pt. 1\" Panda Bear Noah Lennox is one of the founding members of Animal Collective, the psychedelic/experimental rock act from Baltimore that has drawn rave reviews for such efforts as 2007's \"Strawberry Jam\" and 2009's \"Merriweather Post Pavilion.\" Yet the music he makes under the Panda Bear moniker is a whole different animal. This is Lennox's avenue for exploring a wide range of electronic music, which can lead to such satisfying results as 2007's \"Person Pitch.\" \nPerforming: 8:30 p.m. Sunday, Tunnel Stage \nListen to: \"Comfy in Nautica,\" \"Mr Noah\" FKA Twigs Talk about a great late addition. Britain's FKA Twigs, who just joined the Treasure Island lineup in September, is one of the hottest young artists on the planet. She's a strikingly talented singer-songwriter who has wowed critics and fans alike with the intimate, delicate blend of alt-R&B, pop and electronic music found on her full-length debut, last year's accurately titled \"LP1.\" Catch this shooting star now before everyone else on your block joins the chase. \nPerforming: 7:45 p.m. Saturday, Bridge Stage \nListen to: \"Pendulum,\" \"Two Weeks\" José González Run The Jewels' El-P and Killer Mike, right, perform at the Austin City Limits Music Festival in Zilker Park on Friday, Oct. 2, 2015, in Austin, Texas. (Photo by Jack Plunkett/Invision/AP) ( Jack Plunkett ) Bay Area indie-folk fans really should know about this wonderfully talented singer-songwriter-guitarist, who already ranks as a substantial star in his native Sweden. González is an artist who takes his time -- he's released only three albums over his 15-year recording career. Yet, the result is usually worth the wait. Check out this year's \"Vestiges and Claws\" -- González's first full-length since 2007's \"In Our Nature\" -- and see if you don't agree. \nPerforming: 2:45 p.m. Sunday, Bridge Stage \nListen to: \"Stay Alive,\" \"Crosses\" Cashmere Cat He's an increasingly popular producer/artist known for his own solo efforts as well as his remixes/edits of tunes by Lana Del Rey, 2 Chainz, Miguel and other artists. He's done some notable work with Ariana Grande, appearing on her chart-topping 2014 album, \"My Everything,\" and then featuring the outstanding young vocalist on his recent single \"Adore.\" Cashmere Cat is an absolute turntable wizard, who has represented his native Norway at the DMC World DJ Championships on several occasions. \nPerforming: 5:25 p.m. Saturday, Tunnel Stage \nListen to: \"Adore,\" \"Mirror Maru\" The War on Drugs Looking to find a new favorite band? You could certainly do worse than to latch onto this fascinating Philadelphia indie-rock act, which is led by vocalist-guitarist Adam Granduciel. The War on Drugs has actually been around for more than a decade -- and released the debut \"Wagonwheel Blues\" in 2008 -- but it wasn't until last year that seemingly every hipster on the planet started paying attention. And there was a very good reason -- the release of \"Lost in the Dream,\" an album that folks will likely still be discussing for years to come. \nPerforming: 5:50 p.m. Sunday, Bridge Stage \nListen to: \"Red Eyes,\" \"Under the Pressure\" Hudson Mohawke Kanye West knows talent when he hears it. And he certainly heard it from this Scottish electronic artist whom West signed to do production work at his GOOD Music label. Mohawke has also released a pair of solo studio albums -- 2009's \"Butter\" and this year's \"Lantern\" -- as well as collaborated with fellow DJ/producer Lunice as the duo TNGHT. \nPerforming: 7 p.m. Saturday, Tunnel Stage \nListen to: \"Chimes,\" \"Warriors\" Ex Hex Mary Timony first gained attention in the early '90s with the alt-rock outfits Helium and Autoclave. She'd later go on to Wild Flag, the all-star indie-rock act that also featured Sleater-Kinney's Carrie Brownstein and Janet Weiss. The vocalist-guitarist's latest project -- the Washington D.C.-based Ex Hex -- is an awesome garage/punk trio that should appeal to fans of (very) early Go-Go's, Palo Alto's The Donnas and the ever-amazing Joan Jett. \nPerforming: 2 p.m. Sunday, Tunnel Stage \nListen to: \"Waterfall,\" \"Don't Wanna Lose\" Deadmau5 Yes, he's the guy in the giant mouse mask. And that's all he'd be if Canada's Deadmau5 (pronounced \"dead mouse\") didn't have the talent to match his attention-grabbing outfit. Fortunately, he's one of the top producers/artists in the business, whose last two albums both hit No. 1 on the U.S. dance charts. He's also top-notch onstage, knowing not only how to get the party started but how to constantly propel it toward the next level as well. \nPerforming: 9:25 p.m. Saturday, Bridge Stage \nListen to: \"Ghosts 'n' Stuff,\" \"Strobe\" Drive Like Jehu This San Diego post-hardcore punk act made its mark in the early '90s, releasing a pair of influential records that helped shape the future of emo music. The group parted ways in 1995, but the players -- singer Rick Froberg, guitarist John Reis, bassist Mike Kennedy and drummer Mark Trombino -- reunited in 2014. \nPerforming: 5:05 p.m. Sunday, Tunnel Stage \nListen to: \"Here Come the Rome Plows,\" \"Do You Compute\" Follow Jim Harrington at twitter.com/jimthecritic and www.facebook.com/jim.bayareanews . Treasure Island Music Festival When: Noon Saturday-SundayWhere: Treasure IslandTickets: Single-day passes are $95 general admission, $179.50 VIP; two-day passes are $169.50 GA, $315 VIP; treasureislandfestival.com Also: Parking is extremely limited on the island. Single-day parking passes are $45 and two-day parking passes are $80. For public transportation and other information, visit treasureislandfestival.com .", "external_links": [], "published": "2015-10-12T21:19:00.000+03:00", "crawled": "2015-10-13T00:09:26.761+03:00", "highlightTitle": ""}