{"organizations": [], "uuid": "e0affff6a2eccd8d2ee8ec7df6d60db9f732403a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.upi.com", "main_image": "http://cdnph.upi.com/sv/ph/og/i/6811445536316/2015/1/14455379886065/v2.1/Designer-Raf-Simons-drops-Dior-cites-personal-interests.jpg", "site_section": "http://rss.upi.com/news/entertainment_news.rss#", "section_title": "Entertainment News - UPI.com", "url": "http://www.upi.com/Entertainment_News/2015/10/22/Designer-Raf-Simons-drops-Dior-cites-personal-interests/6811445536316/", "country": "US", "title": "Designer Raf Simons drops Dior, cites personal interests", "performance_score": 0, "site": "upi.com", "participants_count": 1, "title_full": "Designer Raf Simons drops Dior, cites personal interests - UPI.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T18:26:00.000+03:00", "replies_count": 0, "uuid": "e0affff6a2eccd8d2ee8ec7df6d60db9f732403a"}, "author": "Marilyn Malara", "url": "http://www.upi.com/Entertainment_News/2015/10/22/Designer-Raf-Simons-drops-Dior-cites-personal-interests/6811445536316/", "ord_in_thread": 0, "title": "Designer Raf Simons drops Dior, cites personal interests", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "PARIS, Oct. 22 (UPI) -- Belgian designer Raf Simons has stepped down from his prestigious position at Christian Dior, it was confirmed this week.\nThe now former creative director for the LVMH-owned brand's women's collection said his decision to leave is based solely on his desire to pursue personal interests and business ventures. In a statement published by WWD Thursday, the split is described as entirely amicable after the two parties could not agree on an employment contract.\n\"Christian Dior is an extraordinary company, and it has been an immense privilege to write a few pages of this magnificent book,\" the designer, who worked with Dior for over three years, said. He described his time with the label as an \"incredible opportunity,\" dubbing his colleagues \"the most amazing team one could ever dream of.\"\nThe announcement reportedly comes as a shock to the fashion industry, as Simon made an expansive impression not only through his modernist creations, but also the documentary Dior and I . However, fashion writer Cathy Horyn notes Simon had been planning this for some time, news supposedly having reached the people who needed to hear it most earlier this month.\nHoryn said the situation isn't as surprising as it is at the surface. Simon had before mentioned the stress caused by having to host six fashion shows a year, frequently having to work within tiny blocks of time.\n\"When you do six shows a year, there's not enough time for the whole [creative] process,\" he told the writer in a previous interview. \"Technically, yes -- the people make the samples, do the stitching, they can do it. But you have no incubation time for ideas, and incubation time is very important.\"\nSimons entered Dior's executive creative team in 2012, becoming the sixth designer to head the company. The 47-year-old craftsman is expected to continue working on his menswear line, images of which he shares frequently on Instagram. WWD reports Dior has not yet assigned a successor for Simons.\n  Taylor Kinney talks wedding plans, kids with Lady Gaga Zendaya slams magazine for photoshopping hips, thighs Watch: Backstreet Boys perform, close out Balmain x H&M fashion show", "external_links": [], "published": "2015-10-22T18:26:00.000+03:00", "crawled": "2015-10-22T22:31:16.434+03:00", "highlightTitle": ""}