{"organizations": ["GOP"], "uuid": "218b2bdd7e267fd9b697567092ce1a7404bc1b94", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kcci.com", "main_image": "http://www.kcci.com/image/view/-/34111744/highRes/3/-/maxh/630/maxw/1200/-/hj19oh/-/Donald-Trump-thumbs-up-jpg.jpg", "site_section": "http://www.kcci.com/9358056?format=rss_2.0&view=feed", "section_title": "Entertainment", "url": "http://www.kcci.com/project-economy/donald-trump-hosting-snl-on-november-7/35817114", "country": "US", "title": "Donald Trump hosting 'SNL' on November 7", "performance_score": 0, "site": "kcci.com", "participants_count": 0, "title_full": "Donald Trump hosting 'SNL' on November 7", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T23:25:00.000+03:00", "replies_count": 0, "uuid": "218b2bdd7e267fd9b697567092ce1a7404bc1b94"}, "author": "", "url": "http://www.kcci.com/project-economy/donald-trump-hosting-snl-on-november-7/35817114", "ord_in_thread": 0, "title": "Donald Trump hosting 'SNL' on November 7", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Donald Trump"], "text": "Donald Trump hosting 'SNL' on November 7 GOP frontrunner previously hosted show in 2004 UPDATED 3:25 PM CDT Oct 13, 2015 \n\"Saturday Night Live\" is about to get \"huge.\" Videos Clinton sent GOP 2016ers copies of... \nDonald Trump, the GOP frontrunner and brash businessman, will host NBC's long-running sketch show on November 7. \nThe candidate will also be a guest next week on \"Jimmy Kimmel Live\" when Kimmel broadcasts his show from Brooklyn, New York. \nFor Trump, the SNL appearance is both a campaign stop and a return to NBC, the network that televised his reality show \"The Apprentice\" for over a decade. \nTrump and NBC severed ties over the summer after he entered the Republican presidential race. But he has since appeared on \"The Tonight Show with Jimmy Fallon\" and agreed to several interviews with NBC News programs. \nHis return to 30 Rockefeller Center for \"SNL\" is sure to garner even more attention. \nTrump has hosted \"SNL\" once before, on April 3, 2004. \nThis time Trump will be live from New York alongside musical guest Sia. \nVeteran TV reporter and CNN analyst Bill Carter pointed out on Twitter that Trump's appearance marks the first time an active presidential candidate has hosted the show. \nThe new season of \"SNL\" started two weekends ago. Trump's rival on the Democratic side of the presidential race, Hillary Clinton, made a cameo during the premiere. \nTrump had been expected to pop up the same way -- possibly as a surprise guest sometime this fall -- but not necessarily as a host. \nLast month he was uncharacteristically coy when CNN's Alisyn Camerota asked him, \"Has 'SNL' asked you to go on this season? Would you consider it?\" \nHe answered cryptically: \"I'm not allowed to say that.\" \nShe pressed: \"Because... you're in negotiations with them?\" And he said: \"I'm just not allowed to say it. I mean, I have -- uh -- silencio. I can't speak about it.\" \nAs the host, Trump will have a chance to interact with the \"SNL\" comedian who has been playing him this season, Taran Killam. Trump tweeted approvingly about the impression on October 3. \nTrump retweeted a user during the show who said, \"@Taran Killam plays a way better fake @realDonaldTrump than a real @HillaryClinton plays herself.\"", "external_links": [], "published": "2015-10-13T23:25:00.000+03:00", "crawled": "2015-10-14T00:33:01.520+03:00", "highlightTitle": ""}