{"organizations": [], "uuid": "998a9b325eac42a2569025fe5d341025f269890b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.hollandsentinel.com", "main_image": "http://www.hollandsentinel.com/Global/images/head/nameplate/mi-holland_logo.png", "site_section": "http://www.hollandsentinel.com/entertainment?template=rss&mime=xml", "section_title": "Entertainment - Holland Sentinel", "url": "http://www.hollandsentinel.com/article/20151014/ENTERTAINMENTLIFE/151019676/2052/ENTERTAINMENT?rssfeed=true", "country": "US", "title": "A Rocking Journey: Madcat returning to the Red Barn", "performance_score": 0, "site": "hollandsentinel.com", "participants_count": 1, "title_full": "A Rocking Journey: Madcat returning to the Red Barn", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T16:48:00.000+03:00", "replies_count": 0, "uuid": "998a9b325eac42a2569025fe5d341025f269890b"}, "author": "Staff report", "url": "http://www.hollandsentinel.com/article/20151014/ENTERTAINMENTLIFE/151019676/2052/ENTERTAINMENT?rssfeed=true", "ord_in_thread": 0, "title": "A Rocking Journey: Madcat returning to the Red Barn", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted Oct. 14, 2015 at 8:48 AM By Staff report Posted Oct. 14, 2015 at 8:48 AM Holland, Mich. Madcat Midnight Blues Journey, featuring Grammy Award-winner Peter Madcat Ruth, will return to the Red Barn Theatre in Saugatuck on Friday, Oct. 16, for an 8 p.m. concert. MMBJ played the Red Barn in January to a full house in its downstairs cabaret theater, and now, 63rd Street Productions, Inc., is bringing them back, in prime time and upstairs in the main theater space. Led by harmonica wizard Peter Madcat Ruth, this eclectic electric quartet is fueled by the fireworks of guitar and steel player Drew “Captain Midnight” Howard and propelled by the rhythms of bassist Mark “Papa” Schrock and drummer Michael “Kid” Shimmin. The group first appeared on the Michigan music scene in 2012, and now has become one of the hottest blues/roots/Americana bands in the state. Veterans of the concert and festival stage, the recording studio and clubs, MMBJ brings seasoned stage presence and improvisational exuberance to both standard and obscure blues tunes, folk and jazz melodies and original music. Madcat has established an international reputation for his virtuosity on the harmonica. He is equally at home playing blues, folk, jazz, country or rock. Performance Magazine refers to him as “a harmonica virtuoso who is rapidly approaching legend status. Drew “Captain Midnight” Howard is a fixture on the Michigan roots music scene and was awarded the Detroit Music Awards Outstanding Country Instrumentalist in 2010. Mark Schrock, music director and proprietor of Fennville’s Salt of the Earth, has performed with Madcat off and on since the late 1970s, but can also be seen and heard playing with Drew Nelson and Highway 2, Jive at Five, the Schrock Brothers and Jimmy Dillon. Drummer Michael Shimmin, a graduate of WMU’s percussion program, is one of the most in-demand percussionists in the state, and has played with numerous groups. Madcat says, “Expect a rocking journey through familiar blues destinations, but be ready to take a trip down the musical fork in the road with Madcat Midnight Blues Journey.” Advance tickets are $12 and may be purchased by calling (269) 857-8388, or online at brownpapertickets.com . Tickets are also available at the door for $15. The Red Barn box office will open at 6:30 p.m. on the evening of the concert. By Staff report", "external_links": [], "published": "2015-10-14T16:48:00.000+03:00", "crawled": "2015-10-14T16:11:23.599+03:00", "highlightTitle": ""}