{"organizations": [], "uuid": "a2a10e004682b7bf875841e58552e62ab433c447", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.al.com", "main_image": "http://imgick.al.com/home/bama-media/width620/img/alphotos/photo/2015/10/15/18974497-large.jpg", "site_section": "http://impact.al.com/entertainment_montgomery_impact/atom.xml", "section_title": "Entertainment Montgomery Impact", "url": "http://www.al.com/entertainment/index.ssf/2015/10/halloween_costumes_1.html", "country": "US", "title": "Halloween costume ideas 2015 for men, women: Donald Trump, Cecil the Lion, Emoji's and more", "performance_score": 0, "site": "al.com", "participants_count": 1, "title_full": "Halloween costume ideas 2015 for men, women: Donald Trump, Cecil the Lion, Emoji's and more", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T15:02:00.000+03:00", "replies_count": 0, "uuid": "a2a10e004682b7bf875841e58552e62ab433c447"}, "author": "Amber Sutton | asutton@al.com", "url": "http://www.al.com/entertainment/index.ssf/2015/10/halloween_costumes_1.html", "ord_in_thread": 0, "title": "Halloween costume ideas 2015 for men, women: Donald Trump, Cecil the Lion, Emoji's and more", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments Burger King's Halloween Whooper DIY costume. (Halloweencostumes.com) Halloween costumes based on pop cultures from 2015. \nWith only a few weeks left until Oct. 31, the time to pick the perfect Halloween attire for the scariest, and often times funniest, night of the year is dwindling. \nIf you're still uncertain about what guise you want to sport, why not look back on this year and select a costume that honors, or pokes fun at, your favorite 2015 moments in pop culture? \nWhether you're looking to pay homage to a favorite internet sensation, dress as your most used Emoji, imitate a popular movie character or just make people laugh with the unexpected or likely inappropriate, this year's crop of costumes has all that and more. \nTo get those creative juices flowing, here's a look at 15 Halloween costumes inspired by 2015 pop culture. \nDonald Trump \nSure, the Republican presidential candidate may seem like an easy target, but that doesn't mean you can't get creative with it. At least, we're assuming that's the line of thinking that was involved in the creation of the \"sexy Donald Trump\" costume. \nIt's also a good costume idea for those looking for something simple but still relevant. Just throw on a tie, buy an awful hair piece and practice scrunching your face into a bloated stare of disapproving judgement. \nLeft Shark \nKaty Perry may have launched Left Shark into stardom during this year's Super Bowl halftime show, but that doesn't mean you can't continue to keep the dancing shark's 15 minutes of fame alive. Just learn some choreography and figure out how you're supposed to hold a drink with a fin as your hand. \nEmojis \nAre you a fan of Emojis? Then why not dress as one this Halloween. Whether you're interested in the happy face, wink face or one of the more unique characters, there a variety of costumes out there so you can properly express yourself without having to say a word. \nComic Characters \nFor years, fans of comic books have been dressing up as their favorite characters each Halloween. This year, some of the more popular costumes include SuperGirl, Ant-Man, Suicide Squad characters and more. For full effect, pose in a fighting stance for all your photos. \nCecil the Lion \nIf you're wanting to get a reaction, this costume might be your best choice. After all, few headlines this year split readers as much as the death of the Zimbabwean lion. Of course, there' s a real possibility you might need to go into hiding, like Cecil's killer Walter Palmer, since it's likely several of your fellow party-goers won't appreciate the joke. \nDeflategate \nBig fan of football, but not a big fan of New England Patriots? Then \"Deflategate\" is the perfect costume for you. To add a bit of snark, you could even throw on a Tom Brady jersey and constantly reference how perfectly inflated everything is. \nMinions \nThanks to this summer's \"Minions\" and the \"Despicable Me\" movies, these little guys are super on trend when it comes to family-friendly Halloween costumes. It's also the perfect idea if you're looking to get a group involved without having to get too elaborate. \n\"Jurassic Park\" characters \nThere are plenty of costumes to choose from inspired by \"Jurassic World\" for those looking to go as a dinosaur or one of the many characters from the \"Jurassic Park\" franchise. If you're planning to go as Chris Pratt's Owen, make sure you strike that raptor wrangling pose he's known for in all your photos. \n\"The Dress\" \nIs it blue and black or white and gold? This Halloween, it can be both now that a costume version of \"The Dress\" is on the market. You'll make heads turn while reminding party-goers of one of the biggest pop culture phenomenons of 2015. \n\"Mad Max\" characters \n\"Mad Max\" was one of the biggest movies of the year so it's no surprise that costumes themed after the action flick are flying off the shelves. While all of the characters looks are pretty eccentric, there's lots of accessories out there to help you nail your imitation of Immortal Joe or Imperator Furiosa. \nNetflix and Chill \nIt's probably the most popular slang phrase to come out of 2015 so why not make it your Halloween costume? When all that's needed is a Netflix T-shirt and a bag of ice, it's also one of this year's least expensive and easiest to pull off ideas. \nHillary Clinton \nFor those looking to poke a little fun at the former Secretary of State, there are several masks and wigs designed to imitate Hillary Clinton. Just toss on a pants suit and tap into Amy Poehler's \"cackle like a manic\" methods to complete the getup. \nPizza Rat \nIsn't the Internet great? Without it, we wouldn't have the popular \"Pizza Rat\" meme based on a video of a rat carrying a piece of pizza into the New York City subway that went viral earlier this year. And, of course, if something goes viral on the Internet, it's bound to inspire a Halloween costume or two. \nTinder \nWant to go as something mostly simple but likely to garner some attention? Try dressing up as Tinder, the infamous dating app that everyone uses while simultaneously hating on. Just go into it knowing that you'll probably get a few swipe lefts, but don't worry. They're probably just jealous of your killer costume. \nBurger King's Halloween Whopper \nFor those looking to get in a little do-it-yourself, here's a Halloweencostumes.com tutorial on how to make your own costume for the Halloween Whopper and its accompanying green poop. Sure, it's gross and elaborate, but it's also pretty hilarious.", "external_links": [], "published": "2015-10-16T15:02:00.000+03:00", "crawled": "2015-10-16T17:28:23.638+03:00", "highlightTitle": ""}