{"organizations": [], "uuid": "3ccc6cd781366b2e1fbb685ae44c47c33a92235a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.providencejournal.com", "main_image": "http://www.providencejournal.com/storyimage/PJ/20151011/NEWS/151019824/AR/0/AR-151019824.jpg", "site_section": "http://www.providencejournal.com/entertainment", "section_title": "Entertainment - providencejournal.com - Providence, RI", "url": "http://www.providencejournal.com/article/20151011/NEWS/151019824/13883/ENTERTAINMENT", "country": "US", "title": "Beating the odds: Providence rapper proud of his city in all its unvarnished grittiness and hope - News", "performance_score": 0, "site": "providencejournal.com", "participants_count": 1, "title_full": "Beating the odds: Providence rapper proud of his city in all its unvarnished grittiness and hope - News - providencejournal.com - Providence, RI", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T06:35:00.000+03:00", "replies_count": 0, "uuid": "3ccc6cd781366b2e1fbb685ae44c47c33a92235a"}, "author": "Alisha A. Pina \nJournal Staff Writer", "url": "http://www.providencejournal.com/article/20151011/NEWS/151019824/13883/ENTERTAINMENT", "ord_in_thread": 0, "title": "Beating the odds: Providence rapper proud of his city in all its unvarnished grittiness and hope - News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "This guy named Harry has something to say. It’s a positive message for Providence’s youth and anyone struggling. It’s also a declaration of pride and love for the community in which he was raised. “I’m not fully dressed until I put my city on,” Harrison Mondubu Grigsby asserts in his rap “Sara’s Song.” Grigsby goes by “Jon Hope” in the music industry, a scene where he has had pockets of national success over the past decade. His music has been featured on top hip-hop radio stations, rap magazines and music television networks. Local station WBRU-FM placed him on its Urban 2015 Top 25 Artists list. He humbly says he is among “so much talent” in Providence, and “we can make a lot more noise together.” He reveals ups and downs from his life in his lyrics, as well as Providence’s trials with poverty and violence. His newest album, “A Guy Named Harry,” highlights pitfalls and depression that almost ended his career three years ago — and how he overcame them. “Your uncle is a king, and failure is no such thing,” he raps in “F.I.S.H. and Coffee Milk.” “You didn’t rain on my parade, you just watered my garden.” Grigsby’s mother, Zainab Kamara, came to the United States from Sierra Leone more than 30 years ago for better opportunities. She worked multiple jobs to raise her three kids alone, and credits God for managing to put them through private school. She repeatedly emphasizes that education is key, which, she says, may be why Grigsby didn’t share his desire to be a rapper with her until much later. “I dropped out of college for them, and I said, 'There is no way I am going to let them be dropouts,' ” Kamara recalls. \"I don't like much rap, but I like his music — minus the cussing.\" Grigsby started writing lyrics at about 10 years old, and says his early attempts were “reflective” and an outlet for his feelings. The subjects varied, including his absent Liberian father, being bullied for his middle name and family misunderstandings. He honed his skills while later living in the Arbor Glen Apartments. He and the other kids in the low-income housing community would freestyle and have rap battles against each other in the laundry room. They called themselves the AG Crew. Kamara says she would often find crumpled papers around the apartment, but didn’t know what the scribbled notes meant. His rap name changed — among them Geezi and G-man — as he grew. He ultimately settled on Jon Hope because Hope is the state motto and he wanted to portray it, dreaming big and not giving up. Page 2 of 3 - 'Rhode less traveled' Grisgsby took three buses, and sometimes walked, to go to St. Raphael Academy. He says he was the poor kid who saw everything, but didn’t partake. “Formulating dreams, how the [expletive] do I pursue them?” he says in “F.I.S.H. and Coffee Milk.” “My black friends the same, they know how a [n-word] feel. I’m sleeping at my white friend’s house for a meal. This is my truth.” He graduated in 2000, and didn’t do well at the University of Rhode Island. He transferred to Virginia Union University and received a bachelor’s degree in urban sociology. Throughout it all, he released mix-tapes and appeared in shows with Mobb Deep and Rakim — both successful in the world hip-hop scene. “Breathin',” from Grigsby's album “Somekind of Wonderful,” made it into the rotation of songs on MTV in 2009. He then was cast in Tyler Perry’s movie “Madea's Witness Protection.” In April 2012, BET’s “106 & Park” showed the world premiere of his “Rhode Less Traveled” video. “The sky is falling, the streets is calling,” he spits in a Rhode Island Reds sweatshirt. “I will not pick up. The world I’m touring. I’m moving forward, beneath the mayhem. I’m ready to take off, no need to say when, because we are going to rise over the negative even if it means I lose out on millions. Sell my soul? No, I’d rather buy love. I’m going to be a star who shines above.” “… Foot on the gas, I am going to ride on the Rhode less traveled.” A comeback Shortly after the premiere, a bad breakup, financial woes and a woman saying Grigsby had fathered her child pushed the young rapper into a depressed state. He says he went into “deep seclusion and unplugged” from music and social media. In his short film “Lil B Soliloquy,” his latest release, on Sept. 8, he talks about the boy who DNA testing proved wasn’t his: “I hope you meet your daddy lil boy, tried to turn one night into 18 years ... Harry, you are not the father.” He went back to school and received a master’s degree in educational leadership and administration from Rhode Island College during his break from music. He returned after Nas, considered one of the greatest hip-hop artists, released an album called “Life is Good” — even though Nas was then having troubles with his label, Def Jam Records, and was in a well-publicized feud with rapper Jay Z. Page 3 of 3 - “If he can do it,” Grigsby says, “I can do it.” “I’m happy to be back,” the now 33-year-old says, sitting in a red leather chair in the corner of Brewed Awakenings Coffee House, in Cranston, a place he frequently writes from these days. “To me, that’s bigger than winning a Grammy.” New album His album, “A Guy Named Harry,” was officially released in May. It includes what Grigsby calls a “street anthem” as well as a plea for unity and fair media coverage with the song, “Camp St. & Comstock.” The name refers to two streets in rival gang territories in Providence. He says there are “streets like this everywhere,” and a diverse group of people, good and bad, who live there. The majority of the media, he adds, only paint the streets negatively. The video, released in advance of the album, was all shot in the city — including Kennedy Plaza (he calls the state bus authority “Uncle RIPTA”), inside an empty recreation center pool and near a mural of the late Sgt. Cornel Young Jr., who was shot and killed by fellow officers in 2000. “Channel 6 and 7, 8 of my [n-word] gone, 9 times out of 10, 11-year-olds hear eulogies performed,” he raps. “… I’m not ashamed of my home, although a lot of suckers in my home, they must go. “Take the sweet with the bitter. I’m shaking hands with fiends, queens, kings, dealers, killers. They all reside in Camp Street and Comstock.” It ends with a relic, a close up of a payphone and “Eternal love to Moondo, Splashy Roc and Aynis Vargas,” all murdered in the last two years. Beating the odds In “Gmbln Man,” Grigsby talks about overcoming the violence, neighborhood problems and people “not having faith in you.” “I beat those odds that they gave to me,” he says. “I never had a hero that was safe for me.” These uplifting and hopeful messages within his music aren’t in line with the trends, Grigsby says, and may slow his rise in the industry. Yet he repeats a phrase he gave in another recent interview. “Greatness takes time. I’m here for the long haul.” apina@providencejournal.com (401) 277-7465 On Twitter: @AlishaPina", "external_links": [], "published": "2015-10-12T06:35:00.000+03:00", "crawled": "2015-10-12T12:56:25.957+03:00", "highlightTitle": ""}