{"organizations": [], "uuid": "87d23e057c7cc1baedcb6ff7daefffcc3d904af0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "wtop.com", "main_image": "http://wtop.com/wp-content/uploads/2015/10/Memphis-Music-Hall-of-Fame2.jpeg", "site_section": "http://wtop.com/section/entertainment/feed/", "section_title": "WTOP » Sections » Entertainment", "url": "http://wtop.com/music/2015/10/timberlake-sings-a-little-dances-a-little-at-memphis-event/", "country": "US", "title": "Timberlake sings a little, dances a little at Memphis event", "performance_score": 0, "site": "wtop.com", "participants_count": 1, "title_full": "Timberlake sings a little, dances a little at Memphis event", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T07:17:00.000+03:00", "replies_count": 0, "uuid": "87d23e057c7cc1baedcb6ff7daefffcc3d904af0"}, "author": "wtopstaff", "url": "http://wtop.com/music/2015/10/timberlake-sings-a-little-dances-a-little-at-memphis-event/", "ord_in_thread": 0, "title": "Timberlake sings a little, dances a little at Memphis event", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Home » News » Entertainment » Music » Timberlake sings a little,… Timberlake sings a little, dances a little at Memphis event By ADRIAN SAINZ October 18, 2015 12:17 am Justin Timberlake dances during the Memphis Music Hall of Fame Induction Ceremony after being inducted Saturday, Oct. 17, 2015, in Memphis, Tenn. (AP Photo/Karen Pulfer Focht) \nMEMPHIS, Tenn. (AP) — Justin Timberlake sang and strutted his way through his induction into the Memphis Music Hall of Fame on Saturday, doing vocal impersonations of soul singers Al Green and Otis Redding, performing on stage with Sam Moore of Sam & Dave, and joking with buddy Jimmy Fallon. \nThe pop singer and actor accepted the honor in front of about 2,100 people, who laughed throughout his acceptance speech. With a drink in tow, he told Fallon, who introduced him, that he was not funny. The pair marched together on stage as Timberlake led the audience in the fight song for the Memphis Tigers’ football team, which upset Mississippi on Saturday. \nTimberlake, a Memphis native, joked with friend DJ Paul of rap group Three 6 Mafia and sang bits of Green’s “Love and Happiness,” Sam & Dave’s “Hold On, I’m Comin'” and Redding’s “(Sittin’ On) The Dock of the Bay” during his speech. He even cursed a few times. \n“This is the (expletive) coolest thing that has ever happened to me,” said Timberlake, a former ‘NSync member and solo artist who has won multiple Emmy and Grammy awards and appeared in several films. \nLater, he added: “The Grammys are political. The Emmys are political. Memphis is not political. And don’t get me started on Hollywood.” \nThe event honored musicians and performers with strong connections to Memphis, known as a cradle of blues, soul/R&B and rock n’ roll. Also inducted were Sam & Dave, Elvis Presley guitarist Scotty Moore, Booker T. & the MG’s drummer Al Jackson Jr., singer Alberta Hunter, blues pianist Memphis Slim and country singer Charlie Rich. Rolling Stones guitarist Keith Richards accepted the award for Scotty Moore, who did not attend. \nEighty-year-old Sam Moore, one half of the duo Sam & Dave, performed to close the show. He was joined on stage by Timberlake, who danced during “Soul Man” and “Hold On, I’m Comin’.” They then sang “(Sittin’ On) The Dock of the Bay” together. \n“I left my home in Memphis, headed for the lights of L.A.,” Timberlake sang, changing some of the lyrics to fit his own success story. \nSam Moore’s singing partner, Dave Prater, died in 1988. They recorded several hits for Stax in the 1960s. \nFallon, who has performed with Timberlake on “Saturday Night Live” and “The Tonight Show,” sang like Elvis, did an impersonation of Donald Trump and called himself “Mrs. Justin Timberlake” during his speech. \n“He’s one of the biggest stars in the world,” Fallon said of Timberlake. “He can sing, he can dance, he can act, he’s funny, he’s good looking. And if you don’t believe me, you can ask Justin himself. He wrote this speech.” \nRichards praised Scotty Moore for influencing his career. Scotty Moore played guitar on Presley’s first recording, “That’s All Right,” at Sun Studio in 1954, and traveled with Presley as the rock n’ roll icon started his music career. \nRichards dropped the award when he approached the podium. \n“I dropped it classically, tastefully,” Richards joked. \nBluesman B.B. King was honored in an “In Memoriam” video. He died earlier this year at age 80. \nVideo and musical tributes accompanied the inductions of the other artists. Nicknamed the “Silver Fox,” Rich recorded at Sun Studio in Memphis with influential producer Sam Phillips. \nJackson kept time for Booker T. & the MG’s, the bi-racial, rock-soul-funk collaboration that served as the house band for Stax Records. The Memphis-born Jackson was fatally shot in 1975. \nHunter was born in Memphis but gained fame as a pioneering blues and jazz singer in Chicago and New York in the 1910s and 1920s. Memphis Slim created over 500 recordings and played piano for blues legends Sonny Boy Williamson and Willie Dixon. \nThe Memphis Music Hall of Fame started in 2012. Inaugural inductees included Presley, Redding and Three 6 Mafia. Since then, inductees have included rock group Big Star, blues guitarist Albert King and soul songstress Carla Thomas. \nThe sold-out event was held at the Cannon Center for the Performing Arts. Topics:", "external_links": [], "published": "2015-10-18T07:17:00.000+03:00", "crawled": "2015-10-18T08:20:18.660+03:00", "highlightTitle": ""}