{"organizations": [], "uuid": "8a8cf64534ad4776eb980d93932e8b5a92b856c1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailyherald.com", "main_image": "http://www.dailyherald.com/storyimage/DA/20151020/entlife/151029886/AR/0/AR-151029886.jpg&amp;updated=201510201438&amp;imageversion=Facebook&amp;exactH=630&amp;exactW=1200&amp;exactfit=crop&amp;noborder", "site_section": "http://www.dailyherald.com/rss/feed/?feed=entlife", "section_title": "DailyHerald.com &gt; Life &amp; Entertainment", "url": "http://www.dailyherald.com/article/20151020/entlife/151029886/", "country": "US", "title": "Award-winning actor to bring tale of the walking dead to Waukegan", "performance_score": 0, "site": "dailyherald.com", "participants_count": 2, "title_full": "Award-winning actor to bring tale of the walking dead to Waukegan", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T22:38:00.000+03:00", "replies_count": 1, "uuid": "8a8cf64534ad4776eb980d93932e8b5a92b856c1"}, "author": "Waukegan Public Library submission", "url": "http://www.dailyherald.com/article/20151020/entlife/151029886/", "ord_in_thread": 0, "title": "Award-winning actor to bring tale of the walking dead to Waukegan", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A theatrical reading of Ray Bradbury's 1948 \"Pillar of Fire\" is coming to the author's hometown on Halloween. The performance by Emmy Award-winning actor Bill Oberst Jr. will begin at 3:30 p.m. on Saturday, Oct. 31, at the Waukegan Public Library, 128 N. County St. There is no admission charge. The show is a part of the 10th Annual Ray Bradbury Storytelling Festival Weekend, Oct. 30-31, which includes events at the library and the Genesee Theatre.\n\"Pillar of Fire\" is an early tale of the walking dead (Bradbury was among the first to pen such fiction) set in the year 2349 on an Earth cleansed of fear. Burials have been banned, along with dark literature and the observance of Halloween. The last graveyard on the planet is being emptied when a 400 year-old corpse wakes up and decides to wage war on the living in order to reacquaint them with fear. A young Bradbury wrote the novella during a post-World War II backlash against horror-themed comics, which included some highly-publicized mass comic book burnings. Five years later he published \"Fahrenheit 451.\"\nOberst is an Emmy Award-winning actor whose roles lean toward the cinematic dark side; his character on CBS-TV's \"Criminal Minds\" appears on the network's list of the series' 14 Most Notorious Serial Killers.\n\"Bradbury's walking dead man in 'Pillar of Fire' is no unthinking zombie,\" Oberst said. \"He knows he is dead and he hates the living because they have lost respect for the dead. It's a passionate, poetic defense of Halloween from the lips of a man who has been in his grave for four centuries. It is suitable for all ages, but is pretty creepy stuff.\"\nFor information about the Oct. 31 performance of \"Pillar of Fire\" and a schedule of events for the 10th Annual Ray Bradbury Storytelling Festival Weekend, call the Waukegan Public Library at (847) 623-2041 or visit waukeganpl.org/Storytelling-Festival.\nGet great articles like this sent to your inbox! Click here to sign up for the Entertainment Newsletter No Thanks News Waukegan Performing Arts", "external_links": ["https://twitter.com/share"], "published": "2015-10-20T22:38:00.000+03:00", "crawled": "2015-10-21T10:32:13.840+03:00", "highlightTitle": ""}