{"organizations": ["Lambert Castle as Historical Society"], "uuid": "899ced7fdd2efbc8fce48b73c40f91475dd26029", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.northjersey.com", "main_image": "http://www.northjersey.com/designimages/NorthJerseyFacebook_377x196.jpg", "site_section": "http://www.northjersey.com/cmlink/arts-and-entertainment-rss.rss", "section_title": "Arts and Entertainment on NorthJersey.com", "url": "http://www.northjersey.com/arts-and-entertainment/entertainment-news/headless-horseman-delights-at-lambert-1.1430095", "country": "US", "title": "Headless Horseman delights at Lambert Castle as Historical Society hosts Halloween readings", "performance_score": 0, "site": "northjersey.com", "participants_count": 0, "title_full": "Headless Horseman delights at Lambert Castle as Historical Society hosts Halloween readings", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T08:21:00.000+03:00", "replies_count": 0, "uuid": "899ced7fdd2efbc8fce48b73c40f91475dd26029"}, "author": "", "url": "http://www.northjersey.com/arts-and-entertainment/entertainment-news/headless-horseman-delights-at-lambert-1.1430095", "ord_in_thread": 0, "title": "Headless Horseman delights at Lambert Castle as Historical Society hosts Halloween readings", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["JOHN SEASLY Print"], "text": "Headless Horseman delights at Lambert Castle as Historical Society hosts Halloween readings October 11, 2015 Last updated: Sunday, October 11, 2015, 1:21 AM By JOHN SEASLY Print \nPATERSON — Parents and children who came to Lambert Castle on Saturday to hear some spooky stories got a surprise visit from the Headless Horseman himself. \nThe event, organized by the Passaic County Historical Society, brought about 80 parents and children out to the lawn of the picturesque castle overlooking the New York skyline. \nThe lawn was decorated with tombstones, cobwebs and pumpkins. Songs like the \"Monster Mash\" and the \"Ghostbusters\" theme played as parents laid out their folding chairs and picnic blankets. \nThe society's president, Cat Cavallo, read the stories, beginning with a Halloween version of the old lady who swallowed a fly. \n\"There was an old mummy who swallowed a spider,\" she began, drawing out her words for dramatic effect. Like the other volunteers from the historical society, she was in costume, dressed as a witch complete with a black cape and pointed hat. \nWith each new verse, another volunteer dressed as a mummy would circle the lawn's fountain, pantomiming eating a spider, a rat, a crow. \n\"There was an old mummy, this story is true, you better look out, or he'll swallow you, too!\" Cavallo shouted. \nThe highlight of the night was Cavallo's reading of the \"The Legend of Sleepy Hollow.\" She explained to the children how schoolteacher Ichabod Crane, spooked by what he believed to be the Headless Horseman of legend, disappeared forever from Sleepy Hollow. \n\"In fact, he was never seen again,\" she said. \nAs she told the story, a Headless Horseman trotted into view, holding a carved pumpkin and mounted on a chestnut horse. The crowd gasped, and the rider circled the lawn and chased Jack Suttora, 10, of Clifton, who shrieked with delight. \nThe Horseman in reality was Cpl. David Carra of the mounted division of the Passaic County Sheriff's Office, atop his gentle 16-year-old equine partner, Baron. He volunteered for the event, he said, after the historical society reached out to the department. \nWith the stories concluded, families posed for pictures next to Carra and Baron. \n\"It seemed very real,\" Jack said. \"The horse is real, that thing chased me. I thought it was really cool.\" \n\"I thought you were Ichabod Crane; that's why I was chasing you,\" Carra told him. \n\"OK, I am then,\" Suttora happily replied. \nWalter Blayney, 8, of Clifton made it clear that he wasn't scared by the Headless Horseman. \n\"I don't really think it was scary,\" he said. \"A little spooky maybe for some younger kids.\" \nThe reading was the first of its kind, but the historical society hopes to make it an annual event, \"as long as the Headless Horseman is willing to come,\" Cavallo said. \n\"I actually enjoyed it and I hope the kids enjoyed it as much as I did,\" she said. \nEmail: seasly@northjersey.com  ", "external_links": [], "published": "2015-10-11T08:21:00.000+03:00", "crawled": "2015-10-11T08:35:32.855+03:00", "highlightTitle": ""}