{"organizations": [], "uuid": "06177479530190af42a4680632ad061464350ba6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.india.com", "main_image": "http://s3.india.com/wp-content/uploads/2015/10/ins-vikramaditya1-238x1341.jpg", "site_section": "http://www.india.com/feed/", "section_title": "India | Latest India News | Get Free India.com Email | Live Cricket and Entertainment News at India.Com", "url": "http://www.india.com/news/world/indian-navys-ins-trikand-reaches-egyptian-port-620824/", "country": "US", "title": "Indian Navy’s INS Trikand reaches Egyptian port", "performance_score": 0, "site": "india.com", "participants_count": 1, "title_full": "Indian Navy’s INS Trikand reaches Egyptian port", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T13:43:00.000+03:00", "replies_count": 0, "uuid": "06177479530190af42a4680632ad061464350ba6"}, "author": "Wires English | Press Trust of India", "url": "http://www.india.com/news/world/indian-navys-ins-trikand-reaches-egyptian-port-620824/", "ord_in_thread": 0, "title": "Indian Navy’s INS Trikand reaches Egyptian port", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments Cairo, Oct 11: As a significant initiative in the Indian Navy’s overseas deployment to West Asia and Africa, INS Trikand entered the Egyptian Safaga port today for a three-day visit to underscore India’s peaceful presence in the region and show solidarity with friendly countries. ”The ship visit underscores India’s peaceful presence and solidarity with the friendly countries and, in particular, to strengthen the existing bonds between India and Egypt,” a statement by the Indian embassy said. (Read: 17 killed in China restaurant blast) INS Trikand will engage extensively with the Egyptian Navy during its stay at Safaga port on the Red Sea Coast. It will conduct PASSEX with Egyptian ships and facilities. Apart from professional interactions, a number of sports and social engagements are also planned, which would go a long way in enhancing cooperation and understanding between these two important and capable navies, the statement added. Indian naval assets are regularly deployed as part of the Indian Navy’s mission of building ‘bridges of friendship’ and strengthening international cooperation with friendly countries, as well as to address maritime concerns of the region including piracy in the Gulf of Aden. In addition, Indian Navy has also been involved in capacity building and capability enhancement of friendly navies in the Indian Ocean Region, besides providing assistance in hydrographic survey, search and rescue and in improving maritime domain awareness. A notable recent deployment of the Indian Navy in the region was Operation Rahat for the evacuation of over 6,200 persons of whom 960 were citizens from 41 other countries including 47 Egyptians from strife-ridden Yemen in April this year. ”India and Egypt are two of the world’s ancient civilisations with a history of close contact. Building upon the rich and longstanding relations that have existed between India and Egypt over thousands of years, both nations have developed warm relations in several spheres,” the statement added. INS Trikand, commanded by Captain Vinay Kalia, is a state-of-the-art warship of the Indian Navy equipped with a versatile range of weapons and sensors capable of addressing threats in all three dimensions air, surface and sub- surface. The visiting ship is part of the Indian Navy’s Western Fleet and is under the operational command of the Flag Officer Commanding-in-Chief, Western Naval Command, with its Headquarters at Mumbai. \n  4:13 PM Topics:", "external_links": [], "published": "2015-10-11T13:43:00.000+03:00", "crawled": "2015-10-11T13:59:25.436+03:00", "highlightTitle": ""}