{"organizations": [], "uuid": "ce49626f8889b96f5b236b3e4045217f98d848a8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.india.com", "main_image": "http://s3.india.com/wp-content/uploads/2015/10/Join.jpg", "site_section": "http://www.india.com/feed/", "section_title": "India | Latest India News | Get Free India.com Email | Live Cricket and Entertainment News at India.Com", "url": "http://www.india.com/cricket-2/pakistan-vs-england-2nd-test-preview-alastair-cooks-men-look-to-shrug-off-terrible-dubai-record-650374/", "country": "US", "title": "Pakistan vs England 2nd Test Preview: Alastair Cook’s men look to shrug off terrible Dubai record", "performance_score": 0, "site": "india.com", "participants_count": 1, "title_full": "Pakistan vs England 2nd Test Preview: Alastair Cook’s men look to shrug off terrible Dubai record", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:19:00.000+03:00", "replies_count": 0, "uuid": "ce49626f8889b96f5b236b3e4045217f98d848a8"}, "author": "Wires English | R Vishal", "url": "http://www.india.com/cricket-2/pakistan-vs-england-2nd-test-preview-alastair-cooks-men-look-to-shrug-off-terrible-dubai-record-650374/", "ord_in_thread": 0, "title": "Pakistan vs England 2nd Test Preview: Alastair Cook’s men look to shrug off terrible Dubai record", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Pakistan vs England 2nd Test Preview: Alastair Cook’s men look to shrug off terrible Dubai record By R Vishal on October 22, 2015 at 5:49 AM Comments \nWho thought things would unfold the way they did in the 1st Test at Abu Dhabi. After the pounding England received at the hands of Pakistan in 2012 in these parts, there was little chance given to Alastair Cook’s men to perform the way they did. Yes, they were definitely aided with Yasir Shah missing out but when the opposition scores more than 500, it takes a mammoth effort to get back into the game, leave alone thinking about winning it. Yet again, Cook paved the way for his team, leading from the front. Cook’s 14 hour stay at the crease bore a stark resemblance to the way he set an example as a leader back in 2012/13 against India. England lost the first of the four Test series in Ahmedabad but it was the southpaw’s grit and determination in just hanging around and piling a big score that set the tone for an unlikely series win in India. \nFor England, the results followed in the same Test. The match looked likely to head for a draw and that is when Adil Rashid, after recording what was one of the worst figures on debut spun a web around the Pakistani batsmen and took England within touching distance of victory. The collapse would have worried Misbah-ul-Haq. One bad hour undid all the good work they had put in during the first innings. Shoaib Malik’s roaring comeback in Tests with a double hundred and the contributions that came along with it proved that there is more spine to the Pakistan batting order than just Misbah or Younis Khan. Things will take a different turn in Dubai though. \nEngland comfortably lost both the Tests played at this venue when they got here. Saeed Ajmal and Abdul Rahman had left Andrew Strauss and his side with no answer and from being the world’s best side at the time, they successively found their technique wanting against spin bowling. No team has ever won a series against Pakistan in the UAE. That will be a record that England are chasing. In the previous Test, the desire in the England ranks was quite palpable. James Anderson, despite taking only four wickets in the match was fearsome and tidy. The supporting cast of Stuart Broad and Ben Stokes also impressed. The spinners proved their mettle in the second innings while there were contributions across the batting order, rallying around Cook’s presence. \nLeggie Yasir Shah’s influence on proceedings is Pakistan’s dire need at this hour. While Zulfiqar Babar is not a someone who can lead the line, the 36-year-old has proved that he can compliment an attack well at one end. Wahab Riaz and Rahat Ali had their moments too. England need to continue what they did in Abu Dhabi to counter Wahab, who bowled his heart out and teased the off-stump corridor with nagging consistency. Overall, it comes down to Pakistan. As the trend has been in many games in the years gone by, whether they decide to turn up for a game or not plays a big role in the final result. If transposed in a match scenario, it is a question of whether it is the Pakistan of the first innings or the second in the first Test. \nPakistan \nMisbah-ul-Haq (c), Ahmed Shehzad, Shan Masood, Azhar Ali, Mohammad Hafeez, Fawad Alam, Asad Shafiq, Younis Khan, Sarfraz Ahmed (wk), Yasir Shah, Zulfiqar Babar, Wahab Riaz, Imran Khan, Rahat Ali, Junaid Khan, Shoaib Malik, Bilal Asif \nEngland \nAlastair Cook (c),Moeen Ali, James Anderson, Jonny Bairstow,Ian Bell, Stuart Broad, Jos Buttler (wk), Alex Hales, Liam Plunkett, Adil Rashid, Joe Root, Ben Stokes, James Taylor, Mark Wood, Samit Patel, Chris Jordan \nTimings: 11.30 am IST \n  5:49 AM Topics:", "external_links": [], "published": "2015-10-22T03:19:00.000+03:00", "crawled": "2015-10-22T03:52:16.762+03:00", "highlightTitle": ""}