{"organizations": [], "uuid": "3af80f4544f8627b4aeca05f6d2cd1d8b2befcfc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nj.com", "main_image": "http://imgick.nj.com/home/njo-media/width620/img/entertainment_impact/photo/19052454-standard.jpg", "site_section": "http://blog.nj.com/entertainment_impact/rss.xml", "section_title": "Entertainment", "url": "http://www.nj.com/entertainment/index.ssf/2015/10/review_diary_of_anne_frank_shakespeare_theatre.html", "country": "IL", "title": "'The Diary of Anne Frank' at Shakespeare Theatre: Slow, but sobering", "performance_score": 0, "site": "nj.com", "participants_count": 1, "title_full": "'The Diary of Anne Frank' at Shakespeare Theatre: Slow, but sobering", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T18:28:00.000+02:00", "replies_count": 0, "uuid": "3af80f4544f8627b4aeca05f6d2cd1d8b2befcfc"}, "author": "Patrick Maley | For NJ Advance Media", "url": "http://www.nj.com/entertainment/index.ssf/2015/10/review_diary_of_anne_frank_shakespeare_theatre.html", "ord_in_thread": 0, "title": "'The Diary of Anne Frank' at Shakespeare Theatre: Slow, but sobering", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments \nTragic theater often feels distant and disconnected, something too fictional and removed to deliver a real punch in the emotional gut. When was the last time you left a production of \"Othello\" in tears? \nAnne Frank and the Holocaust allow no such emotional distance. To encounter this story is to face the reality of horrors less than a century old — and to understand that this was an irreducibly real tragedy. \nThe Shakespeare Theatre of New Jersey's production of \"The Diary of Anne Frank,\" directed admirably by Joseph Discher, pulls no punches. Instead, the production spends most of its time developing the pitiable humanity of its characters, so that the haunting conclusion strikes a suitably painful chord. \nThe play, adapted from Frank's famed book, was originally written by Frances Goodrich and Albert Hackett. (It won the 1955 Pulitzer Prize and Tony for Best Play.) In 1997, Wendy Kesselman wrote a new adaptation to place greater stress on the Jewish identity that many thought was lacking in the original. RELATED: Did the Paper Mill just premiere its best show in years? \nThe play, of course, follows eight Jews hiding from Nazis in cramped secret quarters while the youngest, Anne (Emmanelle Nadeau), keeps a diary chronicling the daily struggle and her hopes for the future. At first, the Shakespeare Theatre of New Jersey's set — designed by Brittany Vasta, and featuring a comfortable common room, an attic living space, and several small bedrooms — seems too open to capture the claustrophobia that defines this experience. But once bodies and anxiety start filling the stage, the darkness seems to creep over the set's edges. \nMost of the first act finds the hideaways struggling to preserve normality. They dress formally for dinner; the adults are always addressed as Mr. and Mrs.; and the children study their Latin and French. It's a fascinating window into the lives of people in an extreme situation, but before long the first act slows to a drag. \nFor most of \"The Diary of Anne Frank,\" the bundle of inexhaustible precociousness that is Anne keeps an upbeat attitude that grates on those sharing her space. Nadeau succeeds in infusing this indefatigable character with life, but it does not take long to realize why her compatriots would tire of her spunk. It's not entirely Nadaeu's fault: Another of Kesselman's adaptation motives was to create a less idealized image of Anne, but except for a few key moments of anger, there isn't a whole lot of complexity here for an actress to play. The cast of \"The Diary of Anne Frank,\" now playing at the Shakespeare Theatre of New Jersey in Madison. Jerry Dalia \nThe performers are much more effective in the second act, when they show the growing fissures in their characters' stolid facades. There is a wonderful moment when Mr. Van Daan (Anthony Cochrane) asks Miep (Shana Wiersum), the group's liaison to the outside world, to sell his wife's treasured fur coat. The coat becomes a volatile flash point as Mr. Van Daan struggles mightily to pry it from his wife's desperate clutches. \nAnd for all its occasional missteps, the final fifteen minutes of this production are about as powerful and heart-wrenching as theater can be. Anne's father Otto (a nuanced Bryan Scott Johnson), having spent most of the play as the captive group's emotional rock, delivers a chilling monologue. This is the only point where we see Otto's strength waiver even a little bit, and it's all the more powerful because he's seemed like such an unshakable spirit until now. \nCertainly a bit more probing of these characters' fraying psyches would be welcome here. But if the slow-going first half is necessary to make possible the play's stunning close, then the lack of efficiency is justified. The haunting feeling with which this production sends the audience out of the theater is, after all, the goal of all great tragedy. The Diary of Anne Frank \n★ ★ ★ \nThe Shakespeare Theatre of New Jersey, 36 Madison Avenue, Madison, through Nov. 21 \nTickets: $32 - $62. Available online ( https://tickets.shakespearenj.org/ ) or by phone, (973) 408-5600 \nPatrick Maley may be reached at patrickjmaley@gmail.com . Find him on Twitter @PatrickJMaley . Find NJ.com/Entertainment on Facebook .", "external_links": [], "published": "2015-10-26T18:28:00.000+02:00", "crawled": "2015-10-26T19:57:35.592+02:00", "highlightTitle": ""}