{"organizations": [], "uuid": "a1a95cb5602a8c213674081f781c1dfc8ca2cbbd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbsnews.com", "main_image": "http://cbsnews1.cbsistatic.com/hub/i/r/2015/10/11/6e20c364-e289-4d6b-ad4a-2b420b91128d/thumbnail/620x350/533447983a65505fd833f13f7dd29d17/lionfish-cbs-promo.jpg", "site_section": "http://www.cbsnews.com/", "section_title": "CBS News - Breaking News, U.S., World, Business, Entertainment &amp; Video ", "url": "http://www.cbsnews.com/news/lionfish-from-malicious-to-delicious/", "country": "US", "title": "​Lionfish: From malicious to delicious", "performance_score": 0, "site": "cbsnews.com", "participants_count": 3, "title_full": "​Lionfish: From malicious to delicious - CBS News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T17:28:00.000+03:00", "replies_count": 2, "uuid": "dbfcf1803dacf8d4affda6d5a0c2a15788cc16c5"}, "author": "CBS News", "url": "http://www.cbsnews.com/news/lionfish-from-malicious-to-delicious/#post-0", "ord_in_thread": 0, "title": "​Lionfish: From malicious to delicious", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The prickly little creatures known as Lionfish are spearheads of an INVASION! Marlie Hall takes us under the sea:\nThe Atlantic's coral reefs bustle with marine life -- natural paradises filled with creatures of all colors, shapes and sizes, including the lionfish.\nBut this species is far from its native habitat; it's a sign of troubled waters.\n\"A lionfish is a beautiful, wonderful, ornate reef fish, native to the Indo-Pacific Ocean,\" said Lad Akins. \"And now, we have lionfish which don't belong swimming all over our reef areas.\"\nThe lionfish is an invasive species spreading across the oceans, but some chefs have found a new way to tackle the venomous lionfish: putting it on the menu. CBS News\nAkins studies lionfish for the REEF Environmental Education Foundation.\nThe lionfish are \"super popular\" in aquariums, Akins says. \"And just like we see with other things, people sometimes set their pets free.\"\nAnd soon a few abandoned pets started multiplying. A single lionfish can produce 2 million eggs a year. And with no natural predator in the Atlantic, there's plenty of this fish in the sea. Year after year, their numbers keep growing and growing.\nLionfish are always on the hunt for their next meal, gulping down whatever they can find -- many of them the young of fish we eat, like grouper and snapper.\nThe threat of invasive species (\"Sunday Morning,\" 08/11/13) Divers take lionfish invasion into their own hands (CBS News, 02/17/15) Biologists using CSI-like clues to find invasive species Killer shrimp could invade the Great Lakes (Live Science, 02/09/15) \"We could see extinctions of species,\" said Akins. \"We could see reductions in populations of species we rely on, economically. And those are worst-case scenarios. I'm a best-case scenario kind of guy. And I see we are engaging a lot of people right now.\"\nThat's mainly through derbies Akins organizes -- competitions across the U.S. and Caribbean for scuba divers to kill as many lionfish as they can. The goal: leave no lionfish behind.\nFor a better look at a derby near Fort Lauderdale, Hall went underwater with Project Baseline , a non-profit documenting the conditions of the world's oceans.\nCo-founder Robert Carmichael took Hall to a shipwreck 120 feet down, where lionfish like to feed.\nLionfish can't be baited, trapped or trawled, so the derby's scuba divers must spear them one by one -- exercising patience and caution to avoid their venomous spines.\nTo prevent painful (though not deadly) stings, they place fish in a plastic tube known as a zookeeper.\nCapturing lionfish. CBS News\n\"They don't really attack you,\" Carmichael said. \"The only risk you really run is if you mishandle the lionfish.\"\nAnd that's exactly what happened to diver Patrick Peacock, who was stung. \"I wasn't careful,\" he told Hall. \"It was a very big one. He came free and he poked me. And I had to end the dive.\"\n\"What did it feel like?\"\n\"It feels like a wasp times ten.\"\nprev Next 1 / 2", "external_links": ["http://projectbaseline.org/", "http://cbsnews2.cbsistatic.com/hub/i/2015/10/11/f7c38a23-a9ff-418d-bddb-04bf921c9097/a0d27873d5a1415de4b5c2eadc4a59ba/lionfish-captured-620.jpg", "http://cbsnews2.cbsistatic.com/hub/i/2015/10/11/69aa7137-e225-437c-a23d-bb025d775c43/6857d2f31256f03df91ec5afa367f880/lionfish-cbs-620.jpg"], "published": "2015-10-11T17:28:00.000+03:00", "crawled": "2015-10-12T06:28:45.673+03:00", "highlightTitle": ""}