{"organizations": [], "uuid": "629c8a2e7b5c003c88bbd53d2df479373025a1d9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailynews.com", "main_image": "http://www.dailynews.com/apps/pbcsi.dll/storyimage/LA/20151021/FEATURES/151029927/AR/0/AR-151029927.jpg?Maxh=1500&Maxw=1500", "site_section": "http://www.dailynews.com/entertainment", "section_title": "Coverage and breaking news of entertainment in Hollywood and Los Angeles", "url": "http://www.dailynews.com/arts-and-entertainment/20151021/theater-review-message-at-the-heart-of-all-my-sons-remains-relevant", "country": "US", "title": "Theater review: Message at the heart of ‘All My Sons’ remains relevant", "performance_score": 0, "site": "dailynews.com", "participants_count": 1, "title_full": "Theater review: Message at the heart of ‘All My Sons’ remains relevant", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "629c8a2e7b5c003c88bbd53d2df479373025a1d9"}, "author": "Frances Baum Nicholson", "url": "http://www.dailynews.com/arts-and-entertainment/20151021/theater-review-message-at-the-heart-of-all-my-sons-remains-relevant", "ord_in_thread": 0, "title": "Theater review: Message at the heart of ‘All My Sons’ remains relevant", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Jeremy Rabb is a country doctor and June Carryl portrays his wife in “All My Sons.” (Photo by Craig Schwartz) ALL MY SONS\nRating: ★★★&#xbd\nWhen: Through Nov. 21. 7 p.m. Oct. 25 and Nov. 15; 7:30 p.m. Nov. 5; 8 p.m. Oct. 30, Nov. 6 and 21; 2 p.m. matinee Oct. 25 and 30, Nov. 15 and 21.\nWhere: A Noise Within, 3352 E. Foothill Blvd., Pasadena\nTickets: From $44; $20 student rush\nInformation: 626-356-3100, ext. 1; www.anoisewithin.org\nWhen a play becomes a classic, the underlying message is timelessness.\nSomehow, the work has created characters which transcend their own age, and delivers a message with an innate universality. Most certainly this is true of the best works of Arthur Miller, often termed America’s premier playwright.\nAs if one needed proof, the solid rendition of his breakthrough work “All My Sons” at A Noise Within in Pasadena offers up that particular balance of the timely and the timeless, with a moral struggle as true today as it was in the years after World War II.\nThe story wrestles with profiteering during that war, but it provides a window on modern wrestles between the corporation and the idealist, and between morality and mammon.\nAs many know, it centers on a small, Midwestern town and the two families at the center of its greatest controversy. During the war, the company owned by Joe Keller and his partner and neighbor Steve Deever made cylinder heads for aircraft. One day, some came out cracked, but this was disguised and the cylinder heads were delivered anyway, leading to the deaths of 21 pilots.\nBoth men went to jail for the coverup, but Keller has since been released on appeal. Deever is still in prison.\nNow, in the post-war era, Keller’s younger son Chris, a former army officer who lived through heated battles, helps run the business. He wants to become engaged to Deever’s daughter, Ann, though his mother Kate insists that this is impossible.\nAnn was Chris’ elder brother’s girl before the war, and though he and his plane went missing, Kate insists he’s going to return.\nBetween Kate’s fervent belief, Chris’ intense belief that the only way his war experience can mean anything is if the world is better for what he and his men went through, and the hovering suspicions of Joe’s complicity in those pilot’s deaths, tension hovers ever near.\nThen news arrives which brings the tensions between truth and hope, between practical capitalism and idealism into sharp and painful focus.\nDirector Geoff Elliott has made a few interesting choices in this production. Though the costumes (Leah Piehl) and setting place this very firmly in the 1947 in which it was first performed, the casting — far more diverse than a Midwestern neighborhood of that era would have seen — seeks for universality. Also, the director has cast himself as Joe Keller, the focal point of much of the play’s drama. This is a bit disappointing, as an independent eye would have challenged him — as has been true in some other fairly recent ANW productions — to do his most creative interior work. Here he sometimes reverts to what one can recognize as a more formulaic approach for his own part.\nAdvertisement\nThe same is not true for the rest of the cast, however, all of whom prove strong and compelling.\nRafael Goldstein steps into Chris’ passion and belief system as if it was made for him. The events which begin to rock Chris’ understandings seem to hit on a visceral level, making the character rounded and deeply believable.\nMaegan McConnell gives Ann the balance of trust and nerve and direction, and the chemistry between her and Goldstein center the conundrums of this young couple’s desire to move forward.\nMost profoundly, Deborah Strang’s aching, obsessive Kate has a naturalness about her maternalism which anchors the entire proceeding.\nAlso worthy of considerable note are Aaron Blakely, briefly but intensely present as Ann’s furious brother almost wooed back into the neighborhood fold; E.K. Dagenfield and Natalie Reiko as a young couple unusually untouched by the chaos of war which surrounded most of their contemporaries; and Vega Pierce-English as the neighbor boy urged to virtuousness by the comparatively questionable Joe.\nPerhaps most captivating is the underscore to the entire debate over money’s role in both happiness and morality exemplified by Jeremy Rabb’s country doctor dreaming of a life in research and June Carryl as his wife, insistent he live out his promise of financial security instead.\nThere is a reason students still study “All My Sons,” as its ethical dilemma seems as fresh today as ever. Joe’s insistence that money and leaving something for his son to inherit trumps anything else, contrasted to his son’s insistence on seeing the world beyond the factory door — that age-old battle between the market and humanity — could be reset in any time frame from the Civil War to this year’s presidential campaign.\nThe art of Miller is to bring it down to the extremely personal, to people you believe you know. That, and the solidly interesting performances from most of the cast, make this definitely worth watching.\n“All My Sons” is part of ANW’s three-play fall repertory season, alternating with “A Flea in Her Ear” and “Antigone.”\nFor more of Frances Baum Nicholson’s reviews, go to www.stagestruckreview.com.\nWant to go?\nRating: \\*\\*\\*/*\nWhen: Through Nov. 21. 7 p.m. Oct. 25 and Nov. 15; 7:30 p.m. Nov. 5; 8 p.m. Oct. 30, Nov. 6 and 21; 2 p.m. matinee Oct. 25 and 30, Nov. 15 and 21.\nWhere: A Noise Within, 3352 E. Foothill Blvd., Pasadena\nTickets: From $44; $20 student rush\nInformation: 626-356-3100, ext. 1; www.anoisewithin.org", "external_links": ["http://widgets.outbrain.com/outbrain.js", "http://mn1-laweb.newscyclecloud.com/apps/pbcsi.dll/storyimage/LA/20151021/FEATURES/151029927/EP/1/1/EP-151029927.jpg&maxh=400&maxw=667"], "published": "2015-10-21T03:00:00.000+03:00", "crawled": "2015-10-22T02:31:26.685+03:00", "highlightTitle": ""}