{"organizations": [], "uuid": "9ad5f412c8dec9b690710a2664aac2e92b145e3c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266347/arts-entertainment-general", "section_title": "Arts &amp; Entertainment: General - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30163231/promenade-square-park-plays-host-to-long-beach-oktoberfest-on-saturday-october-17-featuring-the-leinenkugel-bier-garden", "country": "US", "title": "Promenade Square Park Plays Host to Long Beach Oktoberfest on Saturday, October 17 Featuring the Leinenkugel Bier Garden", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Promenade Square Park Plays Host to Long Beach Oktoberfest on Saturday, October 17 Featuring the Leinenkugel Bier Garden - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T20:01:00.000+03:00", "replies_count": 0, "uuid": "9ad5f412c8dec9b690710a2664aac2e92b145e3c"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30163231/promenade-square-park-plays-host-to-long-beach-oktoberfest-on-saturday-october-17-featuring-the-leinenkugel-bier-garden", "ord_in_thread": 0, "title": "Promenade Square Park Plays Host to Long Beach Oktoberfest on Saturday, October 17 Featuring the Leinenkugel Bier Garden", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Loosen your lederhosen with festivities of Bavarian proportions at the Long Beach Oktoberfest. Staged at Promenade Square Park downtown from noon to 7pm, traditional Oktoberfest activities include contests, live bands, Oom Pah, German food trucks, Frauleins and more.\nLong Beach, California (PRWEB) October 01, 2015\nLoosen your lederhosen with festivities of Bavarian proportions at the Long Beach Oktoberfest featuring the Leinenkugel Bier Garden on Saturday, October 17. Staged at Promenade Square Park downtown from noon to 7pm, traditional Oktoberfest activities include contests, live bands, Oom Pah, German food trucks, Frauleins and more. For additional information or to purchase tickets, please visit http://www.tasteofbrews.com .\nBenefiting the Long Beach Marine Institute, showcased brews include the entire portfolio of Jacob Leinenkugel Brewing Company, a Wisconsin-based brewery along with its popular sister brands Blue Moon and Crispin Ciders. VIP attendees will be treated to special, limited edition styles including the in-demand uber Oktoberfest. All beers are reasonably priced at $5 and are served in 12 ounce cups (sorry, no steins at this first year event).\n“Long Beach Oktoberfest brings the fun of a contemporary Biergarten including Leinenkugel beer, German food and live music to downtown,” said event director Mary Doherty. “Promenade Square Park is easily accessible via public transportation and is conveniently located near popular bars and restaurants. Most importantly, both the admission fee and beers are reasonably priced for millennial attendees.”\nIn addition to live music from local bands and traditional Oom Pah (i.e. the chicken dance), games and activities include mug holding, corn hole, giant jenga and more. Delicious eats will be served up for an additional fee by Germany’s Famous Bratwurst and the Berlin Food Trucks. A limited number of vendor spaces are available.\nThe festivities begin at 10am that morning with an hour-long beach cleanup co-sponsored by Long Beach Marine Institute and Canoes for a Cause. The location is at Belmont Shores: 1 S. Granada Ave., Long Beach. The first 100 age 21 and above participants receive a Leinenkugel’s T-Shirt and a free general admission ticket to Oktoberfest. Attendees beyond 100 receive a discounted voucher to Oktoberfest.\nEarly bird ticket prices begin at $10 for general admission and $20 for VIP which includes a Leinenkugel T-shirt and two free beers. All attendees must be age 21 and above to gain entry into the park. The box office opens at 11:30am and beer sales end at 6pm. Visit http://www.tasteofbrews.com or call (714) 375-1132.\n# # #\n //www.prweb.com/releases/2015/10/prweb12996451.htm\n ", "external_links": ["http://www.prweb.com/releases/2015/10/prweb12996451.htm"], "published": "2015-10-01T20:01:00.000+03:00", "crawled": "2015-10-01T23:37:53.937+03:00", "highlightTitle": ""}