{"organizations": [], "uuid": "081108086e2f5f7f8e1c95e00b6dfea7f3f44019", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "savannahnow.com", "main_image": "http://savannahnow.com/sites/default/files/14838262.jpg", "site_section": "http://savannahnow.com/", "section_title": "savannahnow.com | Savannah Georgia's source for News, Entertainment, Sports, Weather, Classifieds, Jobs, Autos, Real Estate and St. Patricks Day", "url": "http://savannahnow.com/news/2015-10-24/six-contenders-put-crime-first", "country": "US", "title": "Six contenders put crime first", "performance_score": 0, "site": "savannahnow.com", "participants_count": 1, "title_full": "Six contenders put crime first | savannahnow.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T18:02:00.000+03:00", "replies_count": 0, "uuid": "081108086e2f5f7f8e1c95e00b6dfea7f3f44019"}, "author": "Eric Curl", "url": "http://savannahnow.com/news/2015-10-24/six-contenders-put-crime-first", "ord_in_thread": 0, "title": "Six contenders put crime first", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photos Back | Next Steve Bisson/Savannah Morning News - G. Lind Taylor, candidate for At-Large 2. Back | Next Steve Bisson/Savannah Morning News - Brian Foster, candidate for At-Large 2. Back | Next Steve Bisson/Savannah Morning News - Travis Coles, candidate for At-Large 2. Back | Next Steve Bisson/Savannah Morning News - Alicia Blakely, candidate for At-Large 2. Back | Next Steve Bisson/Savannah Morning News - Joe Steffen, candidate for At-Large 2. Back | Next Steve Bisson/Savannah Morning News - Clint Young, candidate for At-Large 2. By Eric Curl Six candidates are running to replace Savannah Alderman Tom Bordeaux, who has chosen not to seek re-election to his alderman at-large post 2 seat. As the Nov. 3 City Council election approaches, all of the candidates recently sat down with the Savannah Morning News to discuss their priorities and plans. The conversations have been edited because of space constraints and for purposes of clarity.\nALICIA BLAKELY\nBIO: Blakely is a military veteran who served in the Army from 1981 through 2005 and now works as a longshoreman at the port of Savannah. She is president of the Savannah Chapter of National Action Network and a founder of the local anti-violence organization, the Bullhorn Crew.\nSMN: What are some of the things you hope to accomplish?\nBLAKELY: I hope to bring inclusion and equality across the board for everyone. Not just for certain areas of Savannah.\nSMN: How do you plan on doing that?\nBLAKELY: When the money comes into this city, we have to make sure it’s disseminated equally to everyone. You look at certain areas and see that nothing has been done. My job, hopefully, will be to empower the people so they do know how to go out asking for what they deserve.\nSMN: What about addressing increased crime?\nBLAKELY: First of all, we have to look at the root of where the crime is coming from. Poverty, disparity, hopelessness, homelessness breed crime. If we empower the people and give them a sense of hopefulness, then we’ll see crime drop. Right now, we have to invest back into our communities. We’ve got to invest back into our children.\nSMN: Do you think there is too much focus on creating tourist related jobs?\nBLAKELY: Of course. Savannah is a service-industry city. We need to have an organization that is going to represent the people providing the service. If we unionize these people that do the service industry work, then they are going to ask for certain things when the companies come in. We are going to make sure they get a living wage.\nSMN: What do you think about the arena/canal district plan?\nBLAKELY: That is an awesome plan as long as everybody is involved in it. My question is how many people who live in the area where all this beautiful stuff is about to take place are aware of it. We have to empower them. The arena is a good thing as long as everybody is going to reap the rewards and benefits of having the arena there.\nSMN: What about the policing aspects of public safety?\nBLAKELY: What I found out is that it is really sad how our officers are treated in this city. Why is it a police officer, if he gets hurt on the job, he only has 10 days of sick leave. He has to ask his fellow officers to give him time. That, to me, is ludicrous. You have to empower the police. You have to empower the community.\nWhen I was growing up, nothing went down in my neighborhood without everybody else knowing about it. If you’ve got somebody on the corner selling drugs, boy you’re going to get your behind away from here. OK. We take our communities back and that’s not what’s happening. Do more community policing and give our officers the tools they need to do what they need to do.\nSMN: Any ideas on how to resolve the issues on Waters Avenue?\nBLAKELY: All these consultants. All this money being spent. That, to me, is ludicrous. It seems to me they want to take Waters Avenue and do something other than what the people want them to do. That corridor should have had attention since day one.\nSMN: What do you think about the central precinct location?\nBLAKELY: Meldrim Row was history for African Americans in the city. For the city to tear down a piece of history, that really bothers me. I mean, it’s already done now, so I’m going to have to support it, but it could have gone someplace else.\nAnd I don’t want to sound so, like I’m just down hard with that particular group, but it just seems like African Americans being 55 percent of the population. When you look at everything in this city, they get nothing. Something’s wrong with that.\nTRAVIS COLES\nBackground: Coles is originally from Australia and a graduate of Richmond Hill High School who has lived in Savannah for about 10 years. He has experience managing restaurants in Richmond Hill before he began working with Club One in Savannah in 2004, where he currently works as the general manager.\nSMN: Why are you running?\nCOLES: I’ve been working downtown for 11 years. I’ve seen some of the missteps the council has made in various areas. Of course, my immediate reason is crime. This has been coming for a while. The current council seems to have been blindsided by it, which is surprising.\nFrom a pro-business perspective, the time in which ordinances are taking to pass. The process of writing it and then bringing it to the business owners instead of asking them ahead of time is kind of counterproductive.\nI think there needs to be more effort in attracting larger businesses and manufacturing businesses to the Savannah area. With the amount of poverty we have, that should be one of the highest priorities, getting better paying jobs to the area.\nSMN: How would you go about trying to achieve that?\nCOLES: I think there are certain angles we can take with it from the city. If it’s a matter of not enough qualified, skilled laborers then we can start putting an effort toward some of these schools to bring some of the folks out of the most impoverished areas and get them trained for those kind of jobs. Job fairs in those neighborhoods, looking at tax incentives.\nSMN: How would you go about improving the policing aspects of public safety?\nCOLES: I think we have the right chief in place. Definitely staffing the police department is a key priority, but also thinking a little more creatively about technology. As far as I’m concerned, whatever the chief asks for would be given to him. Definitely the policy of community policing. Putting people in communities that are aware of the culture in those communities so they can be sensitive to the needs of the communities they’re serving.\nSMN: Any ideas on how the city can reduce homelessness?\nCOLES: I endorse the idea of building smaller homes, not necessarily permanent structures, but providing our homeless with at least a nice place to stay. What we need to be careful of is making sure we don’t have surrounding counties bringing in their homeless people and dropping them off in Savannah.\nSavannah as a whole does a really terrible job of communicating the programs we have for folks who are homeless or veterans, and I think we need to have a better outreach program to let those folks know what is available.\nSMN: How do you feel about the city’s plan to purchase the fairgrounds?\nCOLES: For me right now, property acquisition should be at the bottom of the list. I think that money could be better spent elsewhere, and we don’t need to be shifting money from other departments to cover things like that.\nSMN: What do you think about short-term rentals?\nCOLES: I’m all for it. I think the way the ordinance is written is discriminatory where they limited it to basically downtown. Of course we have to be careful not to let it become a boarding house or anything like that. The city can write the ordinance to prevent that from happening and there can be regulations that will be enforceable on those property owners so if they have a number of complaints they lose their ability to do it.\nSMN: Is there any type of investment you think the city should be making besides public safety right now?\nCOLES: I think they need to look at their neighborhoods and invest more in neighborhood centers. Parks yes, but also community halls. Done in such a way it encourages a community to come together in a central spot. I think investment in those areas, especially the poverty stricken neighborhoods, is where we need to start.\nBRIAN FOSTER\nBIO: Foster has lived in Savannah for 25 years. He is the retired president and CEO of First Chatham Bank and has served as president or chairman of several local organizations, including Rotary Club of Savannah, the Savannah Economic Development Authority and the Savannah Area Chamber of Commerce. He is currently chairman of the board of the Savannah Technical College Foundation.\nSMN : What are your priorities?\nFOSTER: Public safety is number one. The crime is unacceptable. I’ve laid out a plan to accelerate the recruitment. You need to bring in trained officers from out of market by increasing pay.\nEvery officer should have a patrol car. There is a way to do that without affecting the budget. You could do that by bond financing. There is no reason not to have a complete camera security system for the entire city.\nSMN: What about economic development?\nFOSTER : The thing that bothers me most is we have so many programs in place to train folks that we are not taking advantage of. We ought to have a plan that works not only with the school system, but Savannah Tech. We’ve got the jobs. The good paying jobs.\nIf you really have a community effort to bring these programs together and bring the industry together, GulfStream, JCB, and say tell us the jobs that you’ve got and how many you need and let’s match them up.\nSMN: What do you think about the city’s decision to purchase the fairgrounds?\nFOSTER: I would have voted no. I don’t understand it. Government is not in the business of developing land, unless they have a specific use well defined and it is part of a strategic plan. None of that is the case.\nSMN: Do you think the city is prepared for another economic crisis?\nFOSTER: The city is in good shape financially. I think the budget needs adjusting. There’s too much wasteful spending. A lot of spending in that budget should have been redirected to police. And it seems like every time something comes up they want to hire a consultant and study it to death. In my experience you let professional people on staff who ought to make a lot of those decisions and if you can’t, you ought to replace them. Consultants should only be used when you have a very technical, specialized need that you wouldn’t have somebody who normally does that.\nSMN: Do you think enough is being done to address drainage issues in the city?\nFOSTER: I’d be more aggressive. The bond cap is 8 percent of revenue. We’re at 4 percent. Interest rates are going to go up. It can’t be zero rate forever. We can bond some of that drainage. Two percent was what they paid on the last bond issue. Two percent on a million dollars is $20,000 a year.\nSMN: Bordeaux has endorsed you. As an incumbent, do you consider him partially responsible for the current state of the city?\nFOSTER: Not as much as others. Tom had a lot of frustration with what was going on. I think he pointed out a lot of things that were being done that shouldn’t have been. I think he’s a smart guy and he was pretty good in a lot of the stuff he did. Nobody is going to make all the right decisions because at the time you might not have all the information.\nSMN: Do you support consolidating the county, city governments?\nFOSTER: First thing you’ve got to do is get the police merger done. And I think the next thing that needs to be done is permitting and inspections. That has been a problem for years. It is so slow and so tedious. People don’t understand the differences. It would be much more efficient if we merged that. To just do a county-city merger is probably politically difficult right now. Let’s do these two, get them done right. I think if you can accomplish those two things in the next four years it would probably be a good thing.\nJOSEPH STEFFEN JR.\nBIO: Steffen was born in Chicago but was raised in Galax, Va., where he served two terms as the youngest City Council member there. Since entering the practice of law in 1982, after graduating from Wake Forest University and the Marshall Wythe School of Law at the College of William & Mary, he has been active in politics and governmental relations. He moved to Savannah in 1999 and has served as the chairman of the Savannah Historic Review Board and the Chatham County Board of Elections.\nSMN: What are some of your priorities?\nSTEFFEN: I think everyone who’s running this year is concerned about crime and public safety. We are more than just short staffed.\nWe’ve got a good leader, but he doesn’t have the tools he needs to solved the public safety issues. One of goals is to make sure we are not only competitive but we can retain good officers and that we give them the technology they need.\nThe second issue I’m particularly concerned about, I’ve lived in Savannah for 17 years, and the poverty needle hasn’t moved.\nSMN: How would you address that?\nSTEFFEN: I’ve put out a five-point plan and suggested some things we haven’t tried yet. While the city pays a living wage to its own employees, the city does not require those that contract with the city to pay a living wage nor do they require people who contract with the city to properly classify their employees.\nThey get around paying a fair wage by calling their people independent contractors, and it continues to perpetuate poverty. That’s something we could change fairly quickly.\nWe can also incentivize based on them paying a living wage to their employees. Tax rebates, tax forgiveness, licensing fees, anything they pay to the city, we can waive those for a business that can show they pay a living wage to their employees.\nSMN: All of this sounds like it would come with a cost and make city projects more expensive.\nSTEFFEN: I don’t believe that. I believe the more money you put in people’s pockets, the more they have the ability to buy things and the more ability they have to pay taxes.\nSMN: The city is getting some push back on the plan to buy the fairgrounds. Any thoughts on that?\nSTEFFEN: The fact the city is going to purchase the fairgrounds for a mixed-use development there, I don’t have a problem with that, but I’ve talked to a lot of the neighbors in that area. What they are concerned about is they won’t have a seat at the table in determining what goes on at that property.\nFor too long, we’ve allowed the elites in this community, the bankers, the investors, to tell us what the city is going to build. The development has to be complementary to the communities that are going to be affected by it.\nSMN: How do you feel about the major hotel project being built on West River Street?\nSTEFFEN: It seems like we are continuously doing two things that I’m not sure are in our best long-term interest. We are allowing all these boutique hotels to be built, basically for the very wealthy, and you’re kind of creating a downtown area there that’s only accessible to very few people. Secondly, I’m not sure we should be giving tax breaks or incentives to folks who aren’t necessarily creating living-wage jobs.\nIf the city is going to incentivize construction, we should guarantee that those are living-wage jobs that are being created. I’m not saying we don’t do the deal, but I would set up the deal a lot differently.\nSMN: How do you think the council has done in terms of updating city ordinances?\nSTEFFEN: To be candid, that is a slow process and I’m not going to throw rocks at the council and say it’s too slow. The only objection I would have is too often the seats at the table are determined by the elite folks who tend to congregate around city hall. I would like that every neighborhood and interest group has a voice in that process.\nG. LIND TAYLOR\nBIO: Taylor is a community activist, pastor of the Savannah’s First Congregational Church and life member of the NAACP who served in the U.S. Army Reserve as a public affairs officer. He holds undergraduate and graduate degrees from the University of Washington and Gordon-Conwell Theological Seminary.\nSMN: What needs to be done to address public safety issues?\nTAYLOR: We’re going to have to address a charter amendment with the city and move public safety people, fire, police and probably emergency services, from under the yolk of the city manager. They need to be under a subcommittee with the council or a public safety committee. A police chief cannot be bossed by someone who does not know police work.\nSecond, you have to empower them, which means they need the necessary resources. We have to tell the people if we need to have a bond initiative to put the money up front. My idea to up the force is I would like to have two officers in a car. It’s partnership. It even helps defer maybe corruption. And I’m not saying they are corrupt, but it helps. They can do community policing a whole lot better. You can’t have one officer out there. You need a partnership. Even while you’re driving, somebody can watch.\nSMN: Do you think the steps the council has taken, like the salary increases, are adequate?\nTAYLOR: It’s in the right direction, but it’s not enough. It’s just a bandage the way it was implemented. I think we can do better. If it costs us more money up front, let’s tell the people, and we can pay for it down the line. Bond initiatives. Whatever we need to do.\nSMN: Do you think you would evaluate the possibility of having a new city manager?\nTAYLOR: Yeah. I think if you had a new charter, I think the very nature of having a new charter says it is like a new operation. Then I believe that city manager has to resign and reapply.\nSMN: What other issues are you concerned with?\nTAYLOR: We’re talking about fiscal responsibilities. If you don’t have a plan, a picture of where you’re going to go, you can’t properly budget and have a fiscal disciplines. We’re talking about this issue of buying. Well there’s right or wrong and being aggressive in buying real estate. Are we making a judicious statement based on it’s our money and the proper return for our dollar.\nSMN: What can you do as an alderman to address poverty in this city?\nTAYLOR: It’s going to take a lot of stuff. First of all, part of it is, if I see my community looking neglected, an eyesore, I’m going to think that way. We are going to have to start doing some cleanups. Number two, we are going to have to start doing some partnerships.\nI think it’s a long-term process. We have to expose people to museums, to art, music. Get kids in college.\nSMN: How do we get the lower class higher paying jobs?\nTAYLOR: Education. You’ve got to have the skillset. Some people won’t go to college, but if you have industries work with the kids through internships, they can have a better understanding than kids who’ve gone to college. We have to do that. Whether it’s Gulfstream, we have the talent. Reed Dulany has a classic school where they put their money where their mouth is. If we expose them, we can change them.\nSMN: Do you think there’s too much focus on the hospitality industry?\nTAYLOR: No. We don’t build cars here. You’ve got to balance the game we have. I think it has collateral effects and some ills if we don’t work with it, but I think we use it. If we can come up with another model, whether it’s the fiber cable, energy efficiency, something else, we can do that.\nCLINT YOUNG\nBIO: Young is a Savannah native, graduate of Savannah Technical College and veteran of the U.S. National Guard, who has worked with Gulfstream and as a longshoreman and a commercial fisherman. He now runs a vending machine company, Young American Vendors.\nSMN: What are your priorities?\nYOUNG: Crime and poverty. We’ve got 28 percent poverty. I grew up in poverty, and I see it from a first-hand view. Black males are number one in prison. The single-parent household is at an astronomical level.\nSMN: What can you do locally as an alderman to address those issues?\nYOUNG: Combine resources. Consolidation. I believe that combined (county-city government) can fight poverty and crime better than what we are doing now. A good step has been the merger of the police force.\nWe have a budget for 600 officers, but real-time numbers, with the tourists coming in, commuters, students, requires a manpower of three per 1,000. So 700-800 officers.\nI’m also in favor of a $10,000 signing bonuses, seven-year tax exemption as an incentive on state taxes. Give them something to bring them in.\nSMN: What can be done to spur economic development here?\nYOUNG: I’m disappointed about losing three major contracts (for the Pooler megasite). We’ve been sending out the wrong delegation. I didn’t think they sent out the right delegation for a Chrysler, BMW or Volvo. Whatever reason we lost to South Carolina that ranked last in education. It didn’t look good for us.\nYou should send out a delegation of maybe Ted Turner, Arthur Blank, some of the bigwigs. Whatever approach you took and you lost three times, you have to change that approach. You have to add more incentives.\nI think we need to make an aggressive approach into incorporating the Georgia Quick Start program into the high school curriculum so we can have a ready workforce. Bringing the Quick Start curriculum would have us in the position when opportunity comes in to be successful.\nSMN: What do you think about some of the major initiatives of the city such as the canal district, arena and fairgrounds purchase?\nYOUNG: Originally I was in favor of (the arena) being in a more visible site, maybe President Street, but I guess they are going to go with Gwinnett Street. I just hope they get it off in a timely fashion and when they do, not go out and have an outside management company come in. They would run it like the existing Civic Center that would have a living-wage job. We get an outside firm in there, I could see the disaster.\nThe fairground purchase. I believe that they should have a definite plan on any purchase. I just don’t see any long-term plan.\nSMN: How do you feel about new business models for Savannah such as food trucks?\nYOUNG: I don’t see how City Hall could just jump and pass that one. You’re bringing in competitors to the stationary restaurants. What kind of territory are you going to allow these trucks to go in? I run a vending machine company. I don’t want to allow them in front of my locations. Who spoke for the downtown restaurants that are trying to sell food too?\nSMN: You were in the runoff with Tom Bordeaux in the last council election. What would you have done differently if you were elected?\nYOUNG : I would have continued the fight to staff the police department and put prime-time foot patrol into play. Officers out of the car. Officers on the street.\nSMN: When Chief Lumpkin eventually retires, would you consider hiring an outside search firm?\nYOUNG: I was always puzzled at Savannah and Chatham County for two positions they would go around looking for around the country. I believe we should invest in our community and promote in-house. And he should be training his replacement.\nOn the web: Go to savannahnow.com/elections for voter tools, an aldermanic district map, the latest election coverage and more.", "external_links": ["http://sav-cdn.com/sites/all/themes/whitelabel/images/blank.gif", "http://sav-cdn.com/sites/all/themes/savannahnow/images/blank.gif", "http://sav-cdn.com/sites/default/files/imagecache/superphoto/14838250.jpg", "http://sav-cdn.com/sites/default/files/imagecache/story_slideshow_thumb/14838249.jpg", "http://sav-cdn.com/sites/default/files/imagecache/superphoto/14838262.jpg", "http://sav-cdn.com/sites/default/files/imagecache/story_slideshow_thumb/14838267.jpg", "http://sav-cdn.com/sites/default/files/imagecache/superphoto/14838249.jpg", "http://sav-cdn.com/sites/default/files/imagecache/story_slideshow_thumb/14838254.jpg", "http://sav-cdn.com/sites/default/files/imagecache/superphoto/14838267.jpg", "http://sav-cdn.com/sites/default/files/imagecache/story_slideshow_thumb/14838250.jpg", "http://sav-cdn.com/sites/default/files/imagecache/story_slideshow_thumb/14838263.jpg", "http://sav-cdn.com/sites/default/files/imagecache/story_slideshow_thumb/14838262.jpg", "http://sav-cdn.com/sites/default/files/imagecache/superphoto/14838263.jpg", "http://sav-cdn.com/sites/default/files/imagecache/superphoto/14838254.jpg"], "published": "2015-10-24T18:02:00.000+03:00", "crawled": "2015-10-25T12:16:51.918+02:00", "highlightTitle": ""}