{"organizations": [], "uuid": "31a934cdeab8873c431e37436b6bad9ed040beee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.myjoyonline.com", "main_image": "http://photos.myjoyonline.com/photos/news/201408/5269442628862_7896898872995.jpg", "site_section": "http://www.myjoyonline.com/pages/rss/site_entertainment.xml", "section_title": "Ghana Entertainment HomePage", "url": "http://www.myjoyonline.com/entertainment/2015/October-17th/if-you-want-to-hear-a-bible-verse-come-to-my-church-ofori-amponsah.php", "country": "US", "title": "If you want to hear a bible verse, come to my church - Ofori Amponsah", "performance_score": 0, "site": "myjoyonline.com", "participants_count": 0, "title_full": "If you want to hear a bible verse, come to my church - Ofori Amponsah", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T06:10:00.000+03:00", "replies_count": 0, "uuid": "31a934cdeab8873c431e37436b6bad9ed040beee"}, "author": "", "url": "http://www.myjoyonline.com/entertainment/2015/October-17th/if-you-want-to-hear-a-bible-verse-come-to-my-church-ofori-amponsah.php", "ord_in_thread": 0, "title": "If you want to hear a bible verse, come to my church - Ofori Amponsah", "locations": ["Ghana"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hitz", "Ofori", "Ofori Amponsah"], "text": "Source: Ghana | Hitz FM | Beverly Broohm Date: 17-10-2015 Time: 03:10:17:pm Ofori Amponsah \nHighlife singer and evangelist Ofori Amponsah has called on anyone who wants to hear a Bible verse from him to come to his church ‘The Family of Faith and Love Ministries’. \nOfori Amponsah, who is the head pastor of the church, was reacting to reports that he struggled to recite a single verse from the bible during an interview even though he has been a pastor for two years. \nSpeaking in an interview with Hitz @1 on Hitz FM, he said, “I have the bible at heart so why should I come out and say I have favourite bible verse, if you want to really hear a bible verse come to my church and listen to me, if I quote or not.” \n'Mr All 4 Real', as he used to be called, believes that people want to bring him down. “I see it like people wants to ridicule me, but this is what I want to do and is about my life.” \nAnswering a question on how he is going to manage being a pastor and a highlife artiste, the “Otoolege” singer said, “I think it’s just like any other person who leaves work and going to serve God, so I don’t know why people want to close the door, that I can’t serve God and do my work.” \n“What I am doing is in line with what God has written in his words that we should love so I choose to sing about my love,” he added. \nHe concluded that, “People can talk; everybody has their point of view and it will be very good if they bring that point across, I am still a pastor.” \nMeanwhile, veteran Highlife musician, Ben Brako in an interview with Hitz @ 1 said Ofori Amponsah’s return to secular music does not make sense to him. \n“God’s work should be about people, I don’t see how somebody can say they are leaving secular world as if it’s Satan’s world and go into God’s world, It’s all nonsense, boxing things to the extent that it’s not real.” \nHe joins other entertainers like DKB, Criss Waddle and Roro who have thrown jabs at Evangelist Ofori Amponsah after he announced his comeback to do secular music some months ago. \nThe ‘Meko Mekrom’ singer believes that a person can be able to serve God only by serving people. SHARE THIS STORY", "external_links": [], "published": "2015-10-17T06:10:00.000+03:00", "crawled": "2015-10-18T01:50:49.107+03:00", "highlightTitle": ""}