{"organizations": [], "uuid": "bb4a33802d41b6dce660077f8cd7e39bb5ba30a5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/10/08/13012976/9781681397276_Ebook_2000-e1443543027532.jpg", "site_section": "http://www.prweb.com/rss2/artbooks.xml", "section_title": "Arts &amp; Entertainment: Books", "url": "http://www.prweb.com/releases/2015/10/prweb13012976.htm", "country": "US", "title": "Kwaku Danso’s New “Life Is War” is a Philosophical, In-depth Work That Delves Into the Meaning of Life and the Human Psyche", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Kwaku Danso’s New Book “Life Is War” is a Philosophical, In-depth Work That Delves Into the Meaning of Life and the Human Psyche", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "bb4a33802d41b6dce660077f8cd7e39bb5ba30a5"}, "author": "Mitzi McKenzie", "url": "http://www.prweb.com/releases/2015/10/prweb13012976.htm", "ord_in_thread": 0, "title": "Kwaku Danso’s New “Life Is War” is a Philosophical, In-depth Work That Delves Into the Meaning of Life and the Human Psyche", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Kwaku Danso, a Ghana native, engineer, business entrepreneur, social activist, co-founder of two political parties, activist for the people of Ghana, 1971 Bechtel Engineering award at the university of California, researcher, educator, devoted writer and author, has completed his newest book “Life Is War”: a gripping and potent work that delves into the ideas of racism, politics, poverty and economics. Published by New York City-based Page Publishing, Kwaku Danso’s profound work is both educational and philosophical; this work uses an African proverb as a guide to personal fulfillment.\nIn this book the author uses the African proverb and philosophy of “Life is War” as a learning tool to advise the youth and even younger leaders of today on how to examine their lives and succeed in a modern competitive world, and finally how to live in peace with each other. Using the admonishing of elders of the Masai warrior tribe to their growing youth as they enter adulthood, the author touches on common areas of life for the youth and adults in handling modern life conflicts in human relationships, career paths, challenges and perspectives in America and the Western world.\nUsing his own personal experience growing up in the beautiful small town of Abetifi through Presbyterian schools, through high school in Kumasi, Ghana, and to University of California at Berkeley, the author brings this ancient wisdom to touch and advice the people he calls his nephews, nieces and loved ones behind on relationships, jobs and career paths, marriage and divorce, setting personal and professional goals and how to cope economically and survive on this earth.\nIn the later chapters the author touches on human competitiveness and prejudices, using this philosophy to explain racism and animosity, political tensions in America, poverty and wealth gap in human society, and eventually how to live in peace with each other. This books is a must read for the youth in the modern world as well as adults trying to puzzle out the meaning of life, society, war and peace.\nReaders who wish to experience this inspiring work can purchase “Life Is War” at bookstores everywhere or online at the Apple iTunes store, Amazon, Google Play or Barnes and Noble.\nFor additional information or media inquiries, contact Page Publishing at 866-315-2708.\nAbout Page Publishing\nPage Publishing is a traditional New York based full-service publishing house that handles all of the intricacies involved in publishing its authors’ books, including distribution in the world’s largest retail outlets and royalty generation. Page Publishing knows that authors need to be free to create - not bogged down with complicated business issues like eBook conversion, establishing wholesale accounts, insurance, shipping, taxes and the like. Its roster of authors can leave behind these tedious, complex and time consuming issues, and focus on their passion: writing and creating. Learn more at http://www.pagepublishing.com .", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5wYWdlcHVibGlzaGluZy5jb20vcG9ydGZvbGlvLXZpZXcvbGlmZS1pcy13YXItMi8=", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5wYWdlcHVibGlzaGluZy5jb20="], "published": "2015-10-12T03:00:00.000+03:00", "crawled": "2015-10-12T11:24:46.498+03:00", "highlightTitle": ""}