{"organizations": [], "uuid": "5ab5d3813f8b57bfff57d87592ab181b4539d7e4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mysanantonio.com", "main_image": "http://ww3.hdnux.com/photos/41/54/57/8834018/3/rawImage.jpg", "site_section": "http://www.mysanantonio.com/rss/feed/mySA-Entertainment-923.php", "section_title": "mySA Entertainment", "url": "http://www.mysanantonio.com/entertainment/music-stage/article/San-Antonio-s-Sebastien-de-La-Cruz-s-match-is-an-6584874.php", "country": "US", "title": "San Antonio's Sebastien de La Cruz's competition is an African-American corrido singer in Compton", "performance_score": 0, "site": "mysanantonio.com", "participants_count": 1, "title_full": "San Antonio's Sebastien de La Cruz's competition is an African-American corrido singer in Compton - San Antonio Express-News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T00:59:00.000+03:00", "replies_count": 0, "uuid": "5ab5d3813f8b57bfff57d87592ab181b4539d7e4"}, "author": "Madalyn Mendoza", "url": "http://www.mysanantonio.com/entertainment/music-stage/article/San-Antonio-s-Sebastien-de-La-Cruz-s-match-is-an-6584874.php", "ord_in_thread": 0, "title": "San Antonio's Sebastien de La Cruz's competition is an African-American corrido singer in Compton", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photo: Mendoza, Madalyn S, Provided By Antonio Lopez Image 1 of / 39 39 Ethnicity has played a part in Lowery’s musical career, too. He told We Are Mitu he has “haters,” who don’t believe he should sing Mexican music, as an African American. Ethnicity has played a part in Lowery’s musical career, too. He told We Are Mitu he has “haters,” who don’t believe he should sing Mexican music, as an African American. Photo: Mendoza, Madalyn S, Provided By Antonio Lopez Image 2 of 39 A few years ago the little mariachi, who is a Mexican-American, was the target of racist remarks made by people who didn’t believe he should have sung America’s National Anthem a few at a San Antonio Spurs Finals game. A few years ago the little mariachi, who is a Mexican-American, was the target of racist remarks made by people who didn’t believe he should have sung America’s National Anthem a few at a San Antonio Spurs ... more Image 3 of 39 He told Estrella TV how he became an honorary member of the community when he crashed his neighbor’s norteno band practice session. Lowery started playing drums with the group, then became the front man of his own band — El Compa Negro and Los Mas Poderosos. He told Estrella TV how he became an honorary member of the community when he crashed his neighbor’s norteno band practice session. Lowery started playing drums with the group, then became the front man of ... more Image 4 of 39 Not only can they both belt out songs in Spanish, Sebastien and El Compa, whose real name is Rhyan Lowery, have created a social media buzz in their own respects. Not only can they both belt out songs in Spanish, Sebastien and El Compa, whose real name is Rhyan Lowery, have created a social media buzz in their own respects. Photo: Mendoza, Madalyn S, Provided By Antonio Lopez Image 5 of 39 Lowery floods his Instagram profile with photos of recent concerts and meet ups with his fellow norteno singers Lowery floods his Instagram profile with photos of recent concerts and meet ups with his fellow norteno singers Photo: Mendoza, Madalyn S, Provided By Antonio Lopez Image 6 of 39 “He’s a lot more Mexican than I am, he’s legit,” his manager, Antonio Lopez, told mySA.com. “There’s a value in what you choose to be rather than what you were born to be, people should respect that.” “He’s a lot more Mexican than I am, he’s legit,” his manager, Antonio Lopez, told mySA.com. “There’s a value in what you choose to be rather than what you were born to be, people should respect ... more Image 7 of 39 As he serenades groups of fans with his Spanish ballads, his presence on social media and within the realm of accordions and Cowboy hats grows. As he serenades groups of fans with his Spanish ballads, his presence on social media and within the realm of accordions and Cowboy hats grows. Photo: Mendoza, Madalyn S, Provided By Antonio Lopez Image 8 of 39 Lowery’s latest “corrido” is an honor to Mexican artist, Larry Hernandez, who he was able to share the stage with. Lowery’s latest “corrido” is an honor to Mexican artist, Larry Hernandez, who he was able to share the stage with. Photo: Mendoza, Madalyn S, Provided By Antonio Lopez Image 9 of 39 \"I don't think he knows how much value he has,\" Lopez said. \"He's talented, he's natural, he's not trying to be something he's not.\" \"I don't think he knows how much value he has,\" Lopez said. \"He's talented, he's natural, he's not trying to be something he's not.\" Photo: Mendoza, Madalyn S, Provided By Antonio Lopez Image 10 of 39 \"I don't think he knows how much value he has,\" Lopez said. \"He's talented, he's natural, he's not trying to be something he's not.\" \"I don't think he knows how much value he has,\" Lopez said. \"He's talented, he's natural, he's not trying to be something he's not.\" Photo: Mendoza, Madalyn S, Provided By Antonio Lopez Image 11 of 39 Sebastien E. De La Cruz, 8, or El Charro de Oro as he is also known by, stands in his room for a portrait on July 24, 2010. De La Cruz, who has been singing Mariachi music since he was 5 and has done over 100 live performances, won the 2nd Annual Mariachi Music Fest at Austin City Hall on June 18, 2010. Sebastien E. De La Cruz, 8, or El Charro de Oro as he is also known by, stands in his room for a portrait on July 24, 2010. De La Cruz, who has been singing Mariachi music since he was 5 and has done over 100 ... more Image 12 of 39 Sebastien De La Cruz, 9, performs at a press conference on Nov. 28, 2011, announcing the 17th Annual Mariachi Vargas Extravaganza. Sebastien De La Cruz, 9, performs at a press conference on Nov. 28, 2011, announcing the 17th Annual Mariachi Vargas Extravaganza. Photo: HELEN L. MONTOYA, San Antonio Express-News Image 13 of 39 Bryanna Rich, 10 and Sebastien De La Cruz, 9 talk during a a press conference on Nov. 28, 2011, announcing the 17th Annual Mariachi Vargas Extravaganza. Both children performed songs during the press conference. Bryanna Rich, 10 and Sebastien De La Cruz, 9 talk during a a press conference on Nov. 28, 2011, announcing the 17th Annual Mariachi Vargas Extravaganza. Both children performed songs during the press ... more Image 14 of 39 San Antonio's little mariachi singer Sebastien De La Cruz appeared on \"America's Got Talent\" in the summer of 2012, singing before an audience of nearly 9 million viewers on NBC. San Antonio's little mariachi singer Sebastien De La Cruz appeared on \"America's Got Talent\" in the summer of 2012, singing before an audience of nearly 9 million viewers on NBC. Photo: COURTESY PHOTO, San Antonio Express-News Image 15 of 39 Sebastien De La Cruz, 9, placed in the top 16 on \"America's Got Talent.\" Sebastien De La Cruz, 9, placed in the top 16 on \"America's Got Talent.\" Photo: COURTESY PHOTO, Getty Images Image 16 of 39 Sebastien De La Cruz, center, looks at books with his brothers Job, left, and Jacob De La Cruz, twins, as they wait for their ride home after school at Salinas Elementary School in Judson ISD, Sept. 11, 2012. Sebastien De La Cruz, center, looks at books with his brothers Job, left, and Jacob De La Cruz, twins, as they wait for their ride home after school at Salinas Elementary School in Judson ISD, Sept. 11, 2012. Photo: BOB OWEN, San Antonio Express-News Image 17 of 39 Sebastien De La Cruz, a finalist on \"America's Got Talent\", gets a research book from his teacher Miss Pleak, in his 5th grade class at Salinas Elementary School in Judson ISD, Sept. 11, 2012. Sebastien De La Cruz, a finalist on \"America's Got Talent\", gets a research book from his teacher Miss Pleak, in his 5th grade class at Salinas Elementary School in Judson ISD, Sept. 11, 2012. Photo: BOB OWEN, San Antonio Express-News Image 18 of 39 Sebastien De La Cruz is shown on the video board as he sings the national anthem before Game 3 of the 2013 NBA Finals between the San Antonio Spurs and the Miami Heat on June 11, 2013, at the AT&T Center. Sebastien De La Cruz is shown on the video board as he sings the national anthem before Game 3 of the 2013 NBA Finals between the San Antonio Spurs and the Miami Heat on June 11, 2013, at the AT&T Center. Photo: Edward A. Ornelas, San Antonio Express-News Image 19 of 39 Sebastien de la Cruz sings the national anthem before Game 3 of the NBA Finals, on June 11, 2013, in San Antonio. The young mariachi was the target of hateful, racist tweets after the performance. Sebastien de la Cruz sings the national anthem before Game 3 of the NBA Finals, on June 11, 2013, in San Antonio. The young mariachi was the target of hateful, racist tweets after the performance. Photo: David J. Phillip, Associated Press Image 20 of 39 Sebastien De La Cruz speaks with the press at Harmony Hills Elementary School on June 12, 2013, a day after singing the national anthem and drawing both praise and ire on Twitter. Sebastien De La Cruz speaks with the press at Harmony Hills Elementary School on June 12, 2013, a day after singing the national anthem and drawing both praise and ire on Twitter. Photo: Billy Calzada, Associated Press Image 21 of 39 Sebastien De La Cruz puts on his boots for a photo shoot at home on June 12, 2013. Sebastien De La Cruz puts on his boots for a photo shoot at home on June 12, 2013. Photo: Billy Calzada, San Antonio Express-News Image 22 of 39 Sebastien De La Cruz stands for a portrait at his family's home on June 12, 2013. Sebastien describes himself as a \"proud American.\" Sebastien De La Cruz stands for a portrait at his family's home on June 12, 2013. Sebastien describes himself as a \"proud American.\" Photo: Billy Calzada, San Antonio Express-News Image 23 of 39 Sebastien De La Cruz, 11, walks on the court before singing the national anthem in Game 4 of the NBA Finals basketball series between the San Antonio Spurs and the Miami Heat, on June 13, 2013, in San Antonio. De La Cruz, a mariachi singer, whose singing of the national anthem at Game 3 set off a barrage of racist tweets, earned a roaring ovation in an encore performance Thursday night. Sebastien De La Cruz, 11, walks on the court before singing the national anthem in Game 4 of the NBA Finals basketball series between the San Antonio Spurs and the Miami Heat, on June 13, 2013, in San Antonio. ... more Image 24 of 39 Sebastien De La Cruz, known as San Antonio's Little Mariachi, is all smiles after Manu Ginobili of the San Antonio Spurs went to shake his hand prior to the start of Game 4 of the NBA Finals on June 13, 2013 in San Antonio. Sebastien De La Cruz, known as San Antonio's Little Mariachi, is all smiles after Manu Ginobili of the San Antonio Spurs went to shake his hand prior to the start of Game 4 of the NBA Finals on June 13, 2013 in ... more Image 25 of 39 Sebastian De La Cruz looks at San Antonio Mayor Julian Castro before the start of Game 4 of the 2013 NBA Finals on June 13, 2013 at the AT&T Center. Sebastian De La Cruz looks at San Antonio Mayor Julian Castro before the start of Game 4 of the 2013 NBA Finals on June 13, 2013 at the AT&T Center. Photo: Edward A. Ornelas, San Antonio Express-News Image 26 of 39 Sebastien De la Cruz sings the national anthem before Game 4 of the NBA Finals basketball series between the San Antonio Spurs and the Miami Heat, June 13, 2013, in San Antonio. Sebastien De la Cruz sings the national anthem before Game 4 of the NBA Finals basketball series between the San Antonio Spurs and the Miami Heat, June 13, 2013, in San Antonio. Photo: David J. Phillip, Associated Press Image 27 of 39 Sebastien De la Cruz is greeted by San Antonio Spurs' Gregg Popovich (left) and Miami Heat's Erik Spoelstra after singing the national anthem before Game 4 of the NBA Finals basketball series, June 13, 2013, in San Antonio. Sebastien De la Cruz is greeted by San Antonio Spurs' Gregg Popovich (left) and Miami Heat's Erik Spoelstra after singing the national anthem before Game 4 of the NBA Finals basketball series, June 13, 2013, in ... more Image 28 of 39 Popular mariachi group Los Camperos and 11-year-old Sebastian De La Cruz lead an attempt to break the Guinness World Records title for the most mariachi musicians performing together by having 600 mariachi players performing together, July 7, 2013 during half time of the Mexico vs. Panama 2013 CONCACAF Gold Cup Opener at the Rose Bowl in Pasadena, Calif. Popular mariachi group Los Camperos and 11-year-old Sebastian De La Cruz lead an attempt to break the Guinness World Records title for the most mariachi musicians performing together by having 600 mariachi ... more Image 29 of 39 Mariachi singer Sebastian De La Cruz, 11, is seen after an attempt with 599 other mariachi performers to break the Guinness World Records title for the most mariachi musicians performing together, July 7, 2013 during half time of the Mexico vs. Panama 2013 CONCACAF Gold Cup Opener at the Rose Bowl in Pasadena, Calif. Mariachi singer Sebastian De La Cruz, 11, is seen after an attempt with 599 other mariachi performers to break the Guinness World Records title for the most mariachi musicians performing together, July 7, 2013 ... more Image 30 of 39 Sesbastien De la Cruz, left, the 11-year-old boy who sang the National Anthem while wearing a charro outfit during an NBA Finals game, meets Emilio and Gloria Estefan during the Points of Light national series of America’s Sunday Suppers at the San Antonio Museum of Art on Aug. 29, 2013. Sesbastien De la Cruz, left, the 11-year-old boy who sang the National Anthem while wearing a charro outfit during an NBA Finals game, meets Emilio and Gloria Estefan during the Points of Light national series ... more Image 31 of 39 Sebastien De La Cruz (from left) performs as Joaquin Castro's fiancee Anna Flores, U.S. Rep. Joaquin Castro, D-San Antonio, Julian Castro's wife Erica and daughter Carina, and Mayor Julian Castro celebrate the twins 39th birthdays on Sept. 16, 2013, at the Pearl Stable. Sebastien De La Cruz (from left) performs as Joaquin Castro's fiancee Anna Flores, U.S. Rep. Joaquin Castro, D-San Antonio, Julian Castro's wife Erica and daughter Carina, and Mayor Julian Castro celebrate the ... more Image 32 of 39 Actor Danny Trejo and singer Sebastien De La Cruz attend the 2013 NCLR ALMA Awards at Pasadena Civic Auditorium on Sept. 27, 2013, in Pasadena, Calif. Actor Danny Trejo and singer Sebastien De La Cruz attend the 2013 NCLR ALMA Awards at Pasadena Civic Auditorium on Sept. 27, 2013, in Pasadena, Calif. Photo: Michael Kovac, Getty Images Image 33 of 39 Target's bull terrier mascot Bullseye and singer Sebastien De La Cruz celebrate the 2013 NCLR ALMA Awards sponsored by Target at Pasadena Civic Auditorium on Sept. 27, 2013, in Pasadena, Calif. Target's bull terrier mascot Bullseye and singer Sebastien De La Cruz celebrate the 2013 NCLR ALMA Awards sponsored by Target at Pasadena Civic Auditorium on Sept. 27, 2013, in Pasadena, Calif. Photo: John Sciulli, Getty Images Image 34 of 39 Singer Sebastien de la Cruz performs onstage during the 2013 NCLR ALMA Awards at Pasadena Civic Auditorium on Sept. 27, 2013 in Pasadena, Calif. Singer Sebastien de la Cruz performs onstage during the 2013 NCLR ALMA Awards at Pasadena Civic Auditorium on Sept. 27, 2013 in Pasadena, Calif. Photo: Kevin Winter, Getty Images Image 35 of 39 Singer Sebastien de la Cruz performs onstage during the 2013 NCLR ALMA Awards at Pasadena Civic Auditorium on Sept. 27, 2013 in Pasadena, Calif. Singer Sebastien de la Cruz performs onstage during the 2013 NCLR ALMA Awards at Pasadena Civic Auditorium on Sept. 27, 2013 in Pasadena, Calif. Photo: MSNBC, Getty Images Image 36 of 39 Sebastien De La Cruz, 12, performs during the Fort Sam Houston Fiesta Ceremony and Fireworks Extravaganza on April 13, 2014, at Fort Sam Houston. Sebastien De La Cruz, 12, performs during the Fort Sam Houston Fiesta Ceremony and Fireworks Extravaganza on April 13, 2014, at Fort Sam Houston. Photo: Edward A. Ornelas, San Antonio Express-News Image 37 of 39 Sebastien De La Cruz performs the national anthem before Game 1 in the first round of the Western Conference playoffs against the Dallas Mavericks on April 20, 2014, at the AT&T Center. Sebastien De La Cruz performs the national anthem before Game 1 in the first round of the Western Conference playoffs against the Dallas Mavericks on April 20, 2014, at the AT&T Center. Photo: Edward A. Ornelas, San Antonio Express-News Image 38 of 39 Sebastien De La Cruz, 12, performs the national anthem prior to Game 2 of the 2014 NBA Finals between the San Antonio Spurs and the Miami Heat at the AT&T Center on June 8, 2014, in San Antonio. Sebastien De La Cruz, 12, performs the national anthem prior to Game 2 of the 2014 NBA Finals between the San Antonio Spurs and the Miami Heat at the AT&T Center on June 8, 2014, in San Antonio. Photo: Andy Lyons, Getty Images Image 39 of 39 San Antonio's Sebastien de La Cruz's competition is an African-American corrido singer in Compton 1 / 39 Back to Gallery San Antonio’s little mariachi, Sebastien de la Cruz, could meet his match in a young man named El Compa Negro, who sings straight out of Compton, Calif.\nNot only can they both belt out songs in Spanish, Sebastien and El Compa, whose real name is Rhyan Lowery, have created a social media buzz in their own respects.\nA few years ago San Antonio's little mariachi, who is a Mexican-American, was the target of racist remarks made by people who didn’t believe he should have sung America’s National Anthem a few at a San Antonio Spurs Finals game. Ethnicity has played a part in Lowery’s musical career, too. He told We Are Mitu he has “haters,” who don’t believe he should sing Mexican music, as an African American.\n“He’s a lot more Mexican than I am, he’s legit,” Lowery's manager Antonio Lopez said in an interview with mySA.com. “There’s a value in what you choose to be rather than what you were born to be, people should respect that.”\nRELATED: S.A.’s 'Little Mariachi’ drama to bow on ESPN\n“Yo soy negro, claro. Afroamericano. Corazón y alma de un Mexicano,” he told the site, meaning that although he is black, he feels he has the heart and soul of a Mexican.\nHe told Estrella TV how he became an honorary member of the community when he crashed his neighbor’s norteño band practice session. Lowery started playing drums with the group, then became the front man of his own band — El Compa Negro and Los Mas Poderosos.\nAs he serenades groups of fans with his Spanish ballads, his presence on social media and within the realm of accordions and Cowboy hats grows. Lowery floods his Instagram profile with photos of recent concerts and meet ups with his fellow norteño singers.\n\"I don't think he knows how much value he has,\" Lopez said. \"He's talented, he's natural, he's not trying to be something he's not.\"\nmmendoza@mysa.com\nTwitter: @MaddySkye", "external_links": ["https://twitter.com/MaddySkye", "http://ww3.hdnux.com/photos/41/54/57/8834018/3/920x920.jpg", "http://ww1.hdnux.com/photos/41/54/57/8834024/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/34/04/77/7360457/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/41/54/57/8834013/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/34/04/76/7360413/3/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/34/04/76/7360443/3/920x920.jpg", "http://ww1.hdnux.com/photos/34/04/76/7360432/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/34/04/76/7360401/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/41/54/57/8834022/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/34/04/76/7360402/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/34/04/76/7360418/3/920x920.jpg", "http://ww3.hdnux.com/photos/34/04/76/7360402/3/920x920.jpg", "http://ww4.hdnux.com/photos/41/54/57/8834023/3/square_gallery_thumb.jpg", "https://www.youtube.com/embed/rO6JYGGqk-g", "http://ww1.hdnux.com/photos/34/04/76/7360432/3/920x920.jpg", "http://ww4.hdnux.com/photos/34/04/76/7360447/3/920x920.jpg", "http://ww4.hdnux.com/photos/34/04/76/7360443/3/square_gallery_thumb.jpg", "http://www.youtube.com/watch?v=3J1T1I-CdhQ", "http://ww3.hdnux.com/photos/41/54/57/8834018/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/34/04/76/7360406/3/920x920.jpg", "http://ww1.hdnux.com/photos/34/04/76/7360444/5/920x920.jpg", "http://ww1.hdnux.com/photos/34/04/76/7360412/3/920x920.jpg", "http://ww2.hdnux.com/photos/34/04/76/7360413/3/920x920.jpg", "http://ww2.hdnux.com/photos/34/04/77/7360457/3/920x920.jpg", "http://ww4.hdnux.com/photos/34/04/76/7360431/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/34/04/76/7360409/3/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/41/54/57/8834024/3/920x920.jpg", "http://ww2.hdnux.com/photos/34/04/76/7360433/3/920x920.jpg", "http://ww4.hdnux.com/photos/34/04/76/7360407/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/34/04/76/7360405/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/34/04/77/7360450/3/920x920.jpg", "http://ww2.hdnux.com/photos/34/04/76/7360409/3/920x920.jpg", "http://ww2.hdnux.com/photos/41/54/57/8834021/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/34/04/76/7360433/3/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/41/54/57/8834016/3/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/41/54/57/8834015/3/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/34/04/76/7360411/3/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/34/04/76/7360404/3/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/34/04/76/7360428/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/34/04/77/7360454/3/920x920.jpg", "http://ww4.hdnux.com/photos/34/04/76/7360407/3/920x920.jpg", "http://ww4.hdnux.com/photos/34/04/76/7360431/3/920x920.jpg", "http://ww4.hdnux.com/photos/34/04/76/7360419/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/34/04/76/7360429/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/34/04/77/7360458/3/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/34/04/76/7360416/3/920x920.jpg", "http://ww4.hdnux.com/photos/34/04/76/7360403/3/920x920.jpg", "http://ww4.hdnux.com/photos/41/54/57/8834023/3/920x920.jpg", "http://ww1.hdnux.com/photos/34/04/76/7360416/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/41/54/57/8834026/3/920x920.jpg", "http://ww2.hdnux.com/photos/34/04/76/7360405/3/920x920.jpg", "http://ww1.hdnux.com/photos/34/04/77/7360448/3/920x920.jpg", "http://ww4.hdnux.com/photos/34/04/76/7360447/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/41/54/57/8834022/3/920x920.jpg", "http://ww4.hdnux.com/photos/41/54/57/8834019/3/920x920.jpg", "http://ww1.hdnux.com/photos/34/04/77/7360456/3/920x920.jpg", "http://ww3.hdnux.com/photos/34/04/77/7360450/3/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/34/04/77/7360448/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/34/04/77/7360458/3/920x920.jpg", "http://ww2.hdnux.com/photos/34/04/76/7360401/3/920x920.jpg", "http://ww1.hdnux.com/photos/34/04/76/7360404/3/920x920.jpg", "http://ww2.hdnux.com/photos/41/54/57/8834013/3/920x920.jpg", "http://ww4.hdnux.com/photos/34/04/76/7360403/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/34/04/76/7360418/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/34/04/76/7360429/3/920x920.jpg", "http://ww4.hdnux.com/photos/34/04/76/7360419/3/920x920.jpg", "http://ww4.hdnux.com/photos/41/54/57/8834019/3/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/41/54/57/8834015/3/920x920.jpg", "http://ww1.hdnux.com/photos/34/04/76/7360412/3/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/34/04/77/7360456/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/41/54/57/8834021/3/920x920.jpg", "http://ww1.hdnux.com/photos/41/54/57/8834016/3/920x920.jpg", "http://ww3.hdnux.com/photos/41/54/57/8834026/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/34/04/76/7360406/3/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/34/04/76/7360411/3/920x920.jpg", "https://www.wearemitu.com/mitu-world/compton-kid-sings-mexican-corridos/", "http://ww1.hdnux.com/photos/34/04/76/7360444/5/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/34/04/76/7360428/3/920x920.jpg", "http://ww3.hdnux.com/photos/34/04/77/7360454/3/square_gallery_thumb.jpg"], "published": "2015-10-23T00:59:00.000+03:00", "crawled": "2015-10-23T02:23:40.533+03:00", "highlightTitle": ""}