{"organizations": ["Facebook", "Detroit Free Press"], "uuid": "f42b3d2c22062bd74df5d26f19128dfea131aa5e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freep.com", "main_image": "http://www.gannett-cdn.com/-mm-/11798605a55f2d0d6f3c9e4886819e7aeb599718/c=0-152-3000-1847&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/15/DetroitFreePress/DetroitFreePress/635805156913269748-MCT-ENTER-STEVEJOBS-MOV.jpg", "site_section": "http://rssfeeds.freep.com/freep/entertainment", "section_title": "Detroit Free Press - Entertainment", "url": "http://www.freep.com/story/entertainment/2015/10/15/jeff-daniels-steve-jobs-aaron-sorkin-michael-fassbender-movie-apple/73990428/", "country": "US", "title": "Jeff Daniels has key role in Shakespearean 'Steve Jobs'", "performance_score": 0, "site": "freep.com", "participants_count": 0, "title_full": "Jeff Daniels has key role in Shakespearean 'Steve Jobs'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T01:56:00.000+03:00", "replies_count": 0, "uuid": "f42b3d2c22062bd74df5d26f19128dfea131aa5e"}, "author": "", "url": "http://www.freep.com/story/entertainment/2015/10/15/jeff-daniels-steve-jobs-aaron-sorkin-michael-fassbender-movie-apple/73990428/", "ord_in_thread": 0, "title": "Jeff Daniels has key role in Shakespearean 'Steve Jobs'", "locations": ["Michigan"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Julie Hinds", "Michael Fassbender", "Francois Duhamel", "Jeff Daniels"], "text": "Jeff Daniels has key role in Shakespearean 'Steve Jobs' The actor who makes Michigan his home is having a major big-screen season Post to Facebook Jeff Daniels has key role in Shakespearean 'Steve Jobs' The actor who makes Michigan his home is having a major big-screen season Check out this story on Freep.com: http://on.freep.com/1RKFLzR Cancel Send A link has been sent to your friend's email address. Posted! A link has been posted to your Facebook feed. Join the Conversation To find out more about Facebook commenting please read the Conversation Guidelines and FAQs Jeff Daniels has key role in Shakespearean 'Steve Jobs' By Julie Hinds, Detroit Free Press 4:32 p.m. EDT October 15, 2015 Jeff Daniels and Michael Fassbender in \"Steve Jobs.\" (Photo: Francois Duhamel) CONNECT 1 TWEET LINKEDIN COMMENT EMAIL MORE \nIn the season of serious movies, Jeff Daniels is taking a leadership role. \nThe 60-year-old actor plays the guy in charge of NASA in “The Martian,” the current box office hit about an astronaut (Matt Damon) stranded on Mars. \nDaniels also portrays a powerful boss in “Steve Jobs,” which opens Friday. In the film about the late tech icon, he has an important supporting role as former Apple CEO John Sculley, whose rocky relationship with Steve Jobs (Michael Fassbender) provides some of the film's most electric clashes. \n\"Steve Jobs,\" which also stars Kate Winslet and Seth Rogen, is a riveting character study written by Aaron Sorkin, the creator of \"The Newsroom,\" the HBO series for which Daniels won a best actor Emmy. \nDirected by Oscar winner Danny Boyle, the movie does away with the usual cradle-to-grave biopic format and instead unfolds over the course of three product launches. And it gives Daniels a chance to go toe-to-toe with Fassbender in several scenes that are virtuoso examples of Sorkin's preference for intricate, rapid-fire dialogue. \nThis photo released by 20th Century Fox shows Jeff Daniels, as NASA administrator Teddy Sanders in a scene from the film, \"The Martian.\" (Photo: 20th Century Fox) \nDaniels, who's long made Chelsea his home base and based his Purple Rose Theater Company there, spoke to the Detroit Free Press this week about working again with Sorkin and tackling a screenplay with Shakespearean overtones. And he shared behind-the-scenes details of another recent performance: his Tuesday night skit on the CBS “Late Late Show\" that featured two of his best characters ever, cable news anchor Will McAvoy of \"The Newsroom\" and Harry Dunne of the “Dumb and Dumber” movies. \nQUESTION: \"Steve Jobs\" takes the traditional biopic and explodes it into something very different. Was that the appeal of movie for you? \nANSWER: No, I didn’t take it for that reason. I knew it was a different approach. Then you get the script and you go, \"Oh, it’s three (product) launches.\" I went right to, \"Oh, it's three acts.\" That’s the structure. ... The reason I took it, I got to work with Aaron again. We had three years of \"Newsroom.\" I know how to do (a Sorkin script). I’m certain Fassbender and Kate (Winslet), there were a couple of questions and concerned looks as to whether they could survive it. I’m just sitting there at the end of the (rehearsal) table going, \"I’m proof positive that you will survive a script that is so big it’s hard to even pick up.\" And they did. They jumped right in. The reason I took it is it was a chance to work with Aaron again, and Danny Boyle is a one-of-a-kind filmmaker, (and) Scott Rudin’s producing. Scott’s a great guy to have in your corner. Then you look at the role. \nQ: What appealed to you about playing Sculley? \nA: It’ s a Shakespearean fall for this guy. Aaron says he likes to write for ensembles, and he does. But what he also does is write supporting roles that have beginnings, middles and ends, and that isn’t always the case. There’s a lot of times when you’re the supporting actor that you are what I call plot pushing. You handle the exposition and push the plot, then the hero gets to have the big speech. That’s not what Aaron does. Everybody’s got something to play. And when I read Sculley, I'm thinking, man, does (his character) have something to play! And then I got to meet Sculley, and there was even more (to discover) there, especially about the third act with Jobs, in that scene where they come back together at the end, which never happened that way. \nQ: Wow, it didn't happen in real life? \nA: That’s part of this wonderful story about Sculley, kind of away from the camera. In meeting him, he’s a good guy. He happened to be a marketing rock star for Pepsi. Steve sought him out. l Here’s this young guy saying (to Sculley), \"I’m going to change the world. Do you want to be a part of it?\" Talking to the guy who put Pepsi on the map. And he went with Steve, because he was enamored with Steve’s creative genius. Sculley wanted to shepherd that. He wanted to steer that genius. (It was like,) \"I'll handle corporate. I'll handle the business end. You get the next idea.\" It was a wonderful, wonderful father-son relationship. For a couple of years, they got on great. Trust, respect. Then John made the business decision that Steve disagreed with. And they never reconciled. That was it. \nYou’re looking at a Shakespearean fall that Aaron put in three scenes. You set him up, the father figure, the corporate guy. Then in the middle scene, there’s this heavyweight (verbal) fight. It’s a divorce, really. At the end, there’s the scene (where he talks to Jobs) that never happened, a gift for Sculley in a way. Here’s what might have happened. Wouldn’t it have been nice? \nQ: That Shakespearean, almost Arthur Miller quality, too, to the father-son relationship, it rips your heart out in a way. You don’t see that in movies a lot. Does that make sense? \nA: It does. It is Shakespeare without putting on robes and all of that. At the end of the day, sometimes it’s father, son, mother, wife, lover, all these great Shakespearean themes that are just being with other people and wanting it to work out. Sometimes, when it doesn’t, you're falling off a cliff together. That’s what all great writers do. And I’ll argue Aaron is in that room. Is he sitting in the front row with Shakespeare?... He’d be the first to say no. But damn it, the guy can write. I think this is a wonderful display of what Aaron can do when he’s turned loose. \nQ: This is really an acting feast for viewers. Can I ask about the experience for you, going toe to toe with Fassbender? Did it have that sort of energy that we feel when we watch it? \nA: It does and it’s electric on the set, in front of the camera. We had rehearsals at least two weeks, maybe three, with Michael before we started shooting. Everyone came in and out, but Michael was there all the time. ... And then we would shoot act one. And then we shut down the end of February for a week and we would rehearse act two. And again, before act three, they shut down again and we rehearsed. Once you have that, when you come back, it’s game on. It’s drop the puck. It’s a heavyweight fight. It’s not a competition. But Aaron writes characters who are both absolutely right, both points of view are absolutely right. He writes strong beliefs going at each other. When you’ve got a Fassbender going, it’s showtime, and me going, it’s showtime. It’s Hagler versus Hearns, but then we’re adjusting and it becomes a dance. That’s the excitement of it. By the time you’re done with (all the necessary takes and angles), you’re exhausted. … We did it on \"Newsroom\" too. It got to the point where day players coming in were told by their agents, \"You need to be ready for this.\" (Laughs). \nQ: You’re in \"The Martian,\" you’ve got \"Steve Jobs,\" and you're headed to Broadway next year with a play. What does it feel like to be having a moment at a time of life when a lot of actors are pushed aside? \nA: When you move to Michigan early in your film career, you’re taking the long scenic route. You drop back. You raise your family. You have some other things you want to do, like start a theater company. You become a supporting actor who occasionally stars in things like \"Arachnophobia\" or indies. You’re also going to have to spread it around with theater and do HBO movies and \"Gettysburg\" as a TNT special event. You get into television at a time when movie actors don’t do that, because you know you're taking the long scenic route. What I did not see coming was \"Newsroom.\" \"Newsroom\" and Aaron Sorkin have bought me 10 years, easily. Because of the challenge that was \"Newsroom,\" I’ve gotten the attention of people like Ridley Scott and Danny Boyle and Scott Rudin (who produced \"Steve Jobs\" and \"The Newsroom\"). ... We work hard to get back to working with what we call A-list people, big time people. I wouldn’t have told you (this would happen) before \"Newsroom.\" I would have said I think I had a good run. Jeff Daniels' worlds collide in 'Late Late Show' skit \nQ: Earlier this week you were on CBS's \"Late Late Show with James Corden\" and did a taped segment simultaneously playing two of your most opposite characters. What was it like having Will McAvoy of \"The Newsroom\" meet Harry Dunne of the \"Dumb and Dumber\" movies (in a skit where Harry is a bumbling cable news intern)? \nA: I’m a fan of Corden. I saw him on Broadway in \"One Man, Two Guvnors.\" Brilliant comedic performance. I went backstage and talked to him a little bit. He was very kind. We had talked a little bit about the importance of family. He said yesterday, \"I remembered that and that’s one of the reasons I took this talk show, because it would keep me in one place with my kids, who are young.\" With Corden, you’re working with a guy who knows comedy and he played the straight man last night. James didn’t have to do that. There are other guys who would have said, \"I need my jokes.\" He was just there to make this sketch work. They wrote it up over the weekend. I saw it Monday and memorized the rant at the end. I put on a couple of wigs. It was interesting. It was like, about 20 people in the crew and the producer, they laughed a little bit and clapped a little for McAvoy. But when I switched over and got into Harry Dunne, we would get to the end and they would just crack up and applaud. I’ve always wanted to have McAvoy and Harry Dunne share a booth at a diner and just be a fly on the wall. They read that quote and said, \"Let’s see if we can put something together.\" Great fun! \nContact Detroit Free Press writer Julie Hinds: 313-222-6427 or jhinds@freepress.com. \n'Steve Jobs'", "external_links": [], "published": "2015-10-16T01:56:00.000+03:00", "crawled": "2015-10-16T02:14:15.222+03:00", "highlightTitle": ""}