{"organizations": [], "uuid": "8d49890876f512babb64e24a3b091520c85474c2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nydailynews.com", "main_image": "http://assets.nydailynews.com/polopoly_fs/1.2378523!/img/httpImage/image.jpg_gen/derivatives/landscape_1200/hills30a-3-web.jpg", "site_section": "http://www.nydailynews.com/entertainment/index.html", "section_title": "Entertainment News &amp; Reviews - NY Daily News", "url": "http://www.nydailynews.com/entertainment/tv/beverley-hills-90210-debuts-1990-article-1.2378527", "country": "US", "title": "‘Beverley Hills 90210’ debuts in 1990", "performance_score": 0, "site": "nydailynews.com", "participants_count": 1, "title_full": "‘Beverley Hills 90210’ debuts in 1990 - NY Daily News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "8d49890876f512babb64e24a3b091520c85474c2"}, "author": "NEW YORK DAILY NEWS", "url": "http://www.nydailynews.com/entertainment/tv/beverley-hills-90210-debuts-1990-article-1.2378527", "ord_in_thread": 0, "title": "‘Beverley Hills 90210’ debuts in 1990", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "zzz Cast of \"Beverly Hills 90210\" Top row (l-r) Kathleen Robertson, Luke Perry, Tori Spelling, Jamie Walters, Brian Austin Green, Tiffani-Amber Thiessen, Jason Priestley. (seated, l-r) Jennie Garth, Ian Ziering. (Originally published by the Daily News on October 3, 1990. This story was written by Kay Gardella.)\n\"Hull high,\" move over. Another high school series is making a bid for viewers, only this one, from Fox, may not be easy for viewers to relate to. \"Beverly Hills, 90210,\" opening its doors tomorrow night at 8:30 on Channel 5, is about a snooty West Beverly Hills high school where most of the kids have wealthy parents, ride to school in snazzy cars and throw lavish parties on their family estates.\nBut as Brandon Walsh (Jason Priestley) says to his twin sister Brenda (Shannen Doherty) at the close of the program, \"The houses are bigger and the weather is warmer, but it doesn't mean they cracked the meaning of life.\"\nJim Walsh (James Eckhouse), Brandon and Brenda's father, has been transferred from Minneapolis to a Los Angeles office. His two kids, high school juniors, are adjusting to their different environment. The first day at school, Brenda looks around and remarks to her brother that they're going to need a raise in their allowance.\nNew York Daily News Beverly Hills 90210 review The two young stars are likeable and attractive, but the series is run-of-the-mill, with a dull script and an assortment of predictable characters. That list includes a couple of wide-eyed freshman (Brian Austin Green and Douglas Emerson), a blond bombshell (Jennie Garth) who has had a nose job, an angry jilted boyfriend (Ian Ziering) and other forgettable types.\nSocial issues, we're promised, will be dealt with in future episodes. But tomorrow night's premiere is just a getting-to-know you outing with few sparks. If the show survives until next semester, it'll be surprising.\nTags: archives", "external_links": [], "published": "2015-10-02T03:00:00.000+03:00", "crawled": "2015-10-02T19:19:42.076+03:00", "highlightTitle": ""}