{"organizations": [], "uuid": "6dcc80558fd3a3393010389c6c02d8929899cfd1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.detroitnews.com", "main_image": "http://www.gannett-cdn.com/-mm-/7ee974163af718303bd23b97b07990cfa16d4457/c=0-182-3504-2153&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/10/16/DetroitNews/B99314878Z.1_20151016145446_000_G29K61CO.2-0.jpg", "site_section": "https://feeds.feedblitz.com/detroit/entertainment#", "section_title": "Detroit News - Entertainment", "url": "http://www.detroitnews.com/story/tech/2015/10/16/google-book-battle/74044360/", "country": "US", "title": "Appeals court rules in favor of Google’s online library", "performance_score": 0, "site": "detroitnews.com", "participants_count": 2, "title_full": "Appeals court rules in favor of Google’s online library", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T13:13:00.000+03:00", "replies_count": 1, "uuid": "6dcc80558fd3a3393010389c6c02d8929899cfd1"}, "author": "detroitnews.com", "url": "http://www.detroitnews.com/story/tech/2015/10/16/google-book-battle/74044360/", "ord_in_thread": 0, "title": "Appeals court rules in favor of Google’s online library", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A scanner passes over a book at the University of Michigan in Ann Arbor, where one of hundreds of librarians from all over the world was helping Google Inc.'s Book Search create digital versions of all the estimated 50 million to 100 million books in the world. Google is not violating copyright laws by digitizing books for a massive online library, a federal appeals court ruled Friday, Oct. 16, 2015, in a decadelong dispute by authors worried that the project would spoil the market for their books. (Photo: Carlos Osorio / AP) \nGoogle’s book-scanning project is back on track.\nThe world’s biggest search provider can keep adding to its digital library of millions of books without paying their authors, a U.S. appeals court said, ruling that the effort is “fair use” of published material under copyright law.\nGoogle, which has scanned more than 20 million books since 2004, has said that its goal is to provide a “virtual card catalog” of all books in all languages, so that people can search and find excerpts. At the same time, the Web company said it makes sure to respect authors’ and publishers’ copyrights, while providing links to where people can buy or borrow a book. The court’s decision gives institutions — public or private, large or small — a template for how they can scan and share books, according to Brandon Butler, a practitioner-in-residence at American University’s Washington College of Law.\n“It’s a charter document for anyone who wants to do research on books and to learn about books, which means librarians, search companies,” Butler said. “If you’re a relatively informed reader of these cases there’s enough here, now, that you can design a mass digitization program.”\nA three-judge panel of the New York-based court said Friday that Google’s purpose of helping people find books and view excerpts online is legal. The ruling promises to help Mountain View, California-based Google retain its dominance in Web searches. The court also approved Google’s Library Project, which provides digital copies of books for participating research libraries.\n“Google’s unauthorized digitizing of copyright-protected works, creation of a search functionality and display of snippets from those works are non-infringing fair uses,” U.S. Circuit Judge Pierre Leval wrote on behalf of the court. “The purpose of the copying is highly transformative, the public display of text is limited and the revelations do not provide a significant market substitute for the protected aspects of the originals.”\n“Today’s decision underlines what people who use the service tell us: Google Books gives them a useful and easy way to find books they want to read and buy, while at the same time benefiting copyright holders,” said Gina Scigliano, a spokeswoman for Google. “We’re pleased the court has confirmed that the project is fair use, acting like a card catalog for the digital age.”\nThe appeals panel upheld a lower-court decision throwing out a copyright lawsuit by writers including Jim Bouton, the former New York Yankees pitcher and author of “Ball Four” — a behind-the-scenes look at life in the major leagues published in 1970.\nThe Authors Guild, a writers’ organization, argued the Google project is “quintessentially commercial in nature” and intended to advance the company’s business interests. The group said Google Books violates authors’ rights to control their works. The guild may ask the Supreme Court to consider the case.\n“The Authors Guild is disappointed that the Court has failed to reverse the District Court’s flawed interpretation of the fair use doctrine,” Mary Rasenberger, executive director of the Authors Guild, said in a statement. “We trust that the Supreme Court will see fit to correct the Second Circuit’s reduction of fair use to a one-factor test whether the use is, in the court’s eye, transformative.”’\nThe appeals court ruled that Google Books is fair use despite the company’s commercial motivation. Other recognized forms of fair use, including news reporting and commentary, quotation, book reviews and parodies, are generally done for profit, Leval said in the opinion.\nThe Authors Guild sued in 2005 alleging that Google infringed copyrights by scanning and indexing books without writers’ permission. Judge Denny Chin ruled in November 2013 that Google Books provides a public benefit and doesn’t harm authors. Chin, a judge on the appeals court, didn’t participate in the review of his decision.\nThe appeals court ruled in 2014 in favor of the HathiTrust Digital Library, a nonprofit project by a group of university libraries to make digitized books available for the disabled. That ruling, and others like it, gave people confidence that institutions and companies would be able to scan books and expose the results without breaking the law, Butler said. Today’s ruling helps to define how extremely large companies can do this, he said.\n“The only question was is it different when the biggest, wealthiest company in the United States does it at a really big scale?”’, Butler said. “And the answer is no.”", "external_links": [], "published": "2015-10-16T13:13:00.000+03:00", "crawled": "2015-10-16T23:28:16.514+03:00", "highlightTitle": ""}