{"organizations": [], "uuid": "9566244faf0a1656023cab228ea65f86fb7a5562", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nj.com", "main_image": "http://imgick.nj.com/home/njo-media/width620/img/entertainment_impact/photo/19052900-standard.jpg", "site_section": "http://blog.nj.com/entertainment_impact/rss.xml", "section_title": "Entertainment", "url": "http://www.nj.com/entertainment/index.ssf/2015/10/count_basie_theatre_unveils_20m_expansion_plan.html", "country": "IL", "title": "Count Basie Theatre unveils $20M expansion plan", "performance_score": 0, "site": "nj.com", "participants_count": 1, "title_full": "Count Basie Theatre unveils $20M expansion plan", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T19:46:00.000+02:00", "replies_count": 0, "uuid": "9566244faf0a1656023cab228ea65f86fb7a5562"}, "author": "Bobby Olivier | NJ Advance Media for NJ.com", "url": "http://www.nj.com/entertainment/index.ssf/2015/10/count_basie_theatre_unveils_20m_expansion_plan.html", "ord_in_thread": 0, "title": "Count Basie Theatre unveils $20M expansion plan", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Count Basie Theatre unveils $20M expansion plan Count Basie Theatre Future Vision - Nighttime East to West.JPG Count Basie Theatre in Red Bank announced Monday a $20 million expansion plan, which will not only renovate some of the venue's antiquated facilities, but build a 550-capacity \"Second Space\" adjacent to the theater. An artist rendering is seen here. (Courtesy of Count Basie Theatre) ( ) Comments \nRED BANK — One of New Jersey's most historic multipurpose theaters will soon gain a significant facelift. \nCount Basie Theatre in Red Bank announced Monday a $20 million expansion plan, which will not only renovate some of the 89-year-old venue's antiquated facilities, but build a 550-capacity \"Second Space\" adjacent to the theater. Glass-fronted lobbies will bookend the two venues — the new performing arts center will span nearly an entire block on Monmouth Street between Route 35 and Pearl Street. \nMORE: A guided tour of Red Bank: What to do, see and eat \nTheater president and CEO Adam Philpson hopes to break ground on the project by 2018 or 2019. It will be funded solely through donors, he says. \nUpgrades to the existing theatre, which will include new plumbing, air conditioning, bathrooms and a modernized backstage area are not likely to begin until the rest of the new project gets underway, Philipson said. An artist rendering of Count Basie Theatre's $20 million expansion. A new \"Second Space\" venue will be built next to the existing theater. (Courtesy of Count Basie Theatre) \n\"We won't spend money until it has been raised,\" Philipson said at a press conference to announce the plan Monday morning. Honorary co-chairs and New Jersey mainstays Steven and Maureen Van Zandt, as well as Colts Neck teen and \"The Voice\" star Jacquie Lee also spoke on the venue opened in 1926's importance. \n\"It's going to be a great example of what should happen in every community across the country,\" Steven Van Zandt said of the expansion, which also includes an bolstered arts education program and more classrooms. \nRed Bank Mayor Pasquale Menna said the project is expected to boost the theater's local economic impact from $17 million to $30 million and called it \"a catalyst for economic growth\" in the riverfront borough, which over the last 20 years has morphed into a bustling social center with acclaimed restaurants and upscale shops. \nMore than 200,000 patrons come through Count Basie each year to see headlining music acts like Tony Bennett, Diana Ross and Bon Jovi, as well as theater and dance productions. Veteran singers Norah Jones, Darlene Love and Jackson Browne have played the venue in recent months. \nBut with newer facilities, the 1,500-capacity theater hopes to attract more name-brand acts and broadway-level shows. \n\"Being iconic doesn't insulate you from trends, you need to evolve,\" Menna said. \"You can't rely on your laurels.\" Interior of Count Basie Theater as workers put the finishing touches on a 4-month, $8 million renovation in 2008. (ANDREW MILLS/THE STAR-LEDGER) \nThe theater also underwent a renovation in 2008 — $8 million for new plasterwork, restoration of paintings, HVAC and a new exterior marquee. \nBut perhaps these latest changes would warrant a Bruce Springsteen and the E Street Band show considering E Street guitarist Van Zandt's involvement? \nVan Zandt and The Boss have played Count Basie many times over the last 40 years, but Little Steven's first memories of the place are more scandalous. \n\"My fondest memory was when they put couches in the balconies and I was 14 or 15 years old ...\" he joked. \nBobby Olivier may be reached at bolivier@njadvancemedia.com. Follow him on Twitter @BobbyOlivier . Find NJ.com on Facebook .", "external_links": [], "published": "2015-10-26T19:46:00.000+02:00", "crawled": "2015-10-26T19:57:35.541+02:00", "highlightTitle": ""}