{"organizations": [], "uuid": "79ddf7dc4c6a207635ccf0fc598f0efa0067fe6b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.voxy.co.nz", "main_image": "", "site_section": "http://voxy.co.nz//entertainment/feed", "section_title": "Voxy.co.nz - Entertainment", "url": "http://www.voxy.co.nz/entertainment/show-me-shorts-film-festival-announces-four-films/5/233568", "country": "US", "title": "Show Me Shorts Film Festival announces four films", "performance_score": 0, "site": "voxy.co.nz", "participants_count": 1, "title_full": "Show Me Shorts Film Festival announces four films", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T06:05:00.000+03:00", "replies_count": 0, "uuid": "79ddf7dc4c6a207635ccf0fc598f0efa0067fe6b"}, "author": "Fuseworks Media", "url": "http://www.voxy.co.nz/entertainment/show-me-shorts-film-festival-announces-four-films/5/233568", "ord_in_thread": 0, "title": "Show Me Shorts Film Festival announces four films", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Fuseworks Media Monday, 5 October, 2015 - 15:05 \nShow Me Shorts Film Festival, New Zealand’s only Academy Awards-accredited film festival, has made an early announcement of four of the 46 films that will feature in the Festival this November. \nThe films include Accidents, Blunders and Calamities by James Cunningham, which will be making its world premiere. \nThis animated bedtime story as read by a father possum is an A-Z of ways to die at the hands of the most dangerous animal of all… humans. Cunningham has an impressive ouvre of award-winning short films (Poppy, Shelved, Infection), and this one like many of his others has been animated by students at Media Design School, where Cunningham is a tutor. Accidents, Blunders and Calamities will feature in the My Generation section of the programme, which is suitable for families with children aged eight-years and above. \nAmerican New Zealander Jake Mahaffy’s A.D. 1363, the End of Chivalry will be screening for the first time in New Zealand. Mahaffy is a senior lecturer in media, film and television at the University of Auckland, who recently won the Orizzonti best film award at Venice Film Festival for his feature film Free in Deed. His short film is a comedy set in a medieval wilderness that received strong praise at Sundance earlier this year. \nFrom the international selection, South Korea-based French filmmakers Simon Sebastien and Forest Ian Etsler bring us ëå¿ (One-minded). Shot with a camera that mimicks the movement of a fan turning from side to side, this innovatively crafted story unfolds around the shenanigans of a woman and her room-mate who share a tiny apartment. \nOne of the six music videos that feature in this year’s programme was made by last year’s Show Me Shorts Best Music Video Award winning duo Thunderlips. The Eversons - Emily is a glam-rock musical-comedy set in an infamous dumpling restaurant on Auckland's Dominion Road. Starring the band The Eversons, two dancing dumplings and JJ Fong as Emily. \nFestival Director Gina Dellabarca says, \"It is our 10th anniversary this year and we are celebrating how much Show Me Shorts has grown. In 2015 we received around 1000 entries and will screen in 22 cinemas across the country. This is well up from the 300 entries we received, and just one cinema we screened at, in the first competition back in 1996! \n\"Our programmers have had a difficult but rewarding job selecting the top 46 films. The calibre of both the New Zealand and international shorts this year was exceptionally high. We’re delighted to bring the work of these very talented filmmakers to audiences at cinemas across New Zealand in November.\" \nIn great news for the Festival, last week Lightbox announced its position as principal sponsor of the 2015 Show Me Shorts Film Festival. The agreement delivers 65 festival-quality local short films to thousands of Lightbox viewers who have embraced the concept of \"anywhere, anytime\" online television. \nLightbox.co.nz is a New Zealand-made online video on demand service (SVOD) that gives viewers the freedom to choose from thousands of hours of great TV shows, all ready to watch, with no ads. \nShow Me Shorts is New Zealand’s leading international short film festival, and the only festival in New Zealand with Academy Awards-accreditation. Their mission is to connect audiences with quality short films, celebrate excellence in short film making and foster the New Zealand short film community. \nEvery year the event attracts a highly regarded panel of judges. This year’s panel comprises actor, writer and director Peter Elliot (The Art of the Architect, Gloss, Shortland St), actor Siobhan Marshall (Outrageous Fortune, The Almighty Johnsons, Shortland Street, The Blue Rose), film editor and screenwriter Cushla Dillon (Orhans and Kingdoms, Beautiful Machine, Topless Women Talk About Their Lives), and writer, director and actor - and the winner of Best Film (Dive) in the 2014 Show Me Shorts Film Festival - Matthew Saville (Kikia the Poa, Hitch Hike). \nThe tenth annual Show Me Shorts Film Festival plays in 22 cinemas nationwide from 11 November, 2015. The full programme will be unveiled on 20 October, but dates and locations are now available here: www.showmeshorts.co.nz/programme \nAll articles and comments on Voxy.co.nz have been submitted by our community of users. Please notify us through our contact form if you believe an item on this site breaches our community guidelines .", "external_links": [], "published": "2015-10-05T06:05:00.000+03:00", "crawled": "2015-10-05T14:52:47.118+03:00", "highlightTitle": ""}