{"organizations": [], "uuid": "22a28d4f9d4d71ae5ef1761be216d3d44ac5af5e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "snn.bz", "main_image": "http://snn.bz/wp-content/uploads/2015/01/newsyn.png", "site_section": "http://SyndicatedNews.NET/feed/", "section_title": "Syndicated News - Live News Entertainment Political Music News", "url": "http://snn.bz/benghazi-hearing/", "country": "US", "title": "Benghazi Hearing", "performance_score": 0, "site": "snn.bz", "participants_count": 1, "title_full": "Benghazi Hearing", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T19:28:00.000+03:00", "replies_count": 0, "uuid": "22a28d4f9d4d71ae5ef1761be216d3d44ac5af5e"}, "author": "SyndicatedNews", "url": "http://snn.bz/benghazi-hearing/", "ord_in_thread": 0, "title": "Benghazi Hearing", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEWS \nA high-stakes showdown with Republican critics \nFormer Secretary of State and Democratic presidential front-runner Hillary Clinton is testifying Thursday on Capitol Hill, appearing before the Republican-led special committee investigating the deadly Sept. 11, 2012 attack on the American consulate in Benghazi, Libya. \nIt’s the first time Clinton has testified before the House Select Committee on Benghazi, and her testimony is expected to last for hours. Committee leaders have been buffeted in recent weeks by criticism that their investigation has shifted its focus from the attack to Clinton’s controversial use of a private email server while Secretary of State. A poll this week found that a majority of Americans see the probe more as a vehicle to hurt Clinton than to find the facts. \nRepublicans have defended the investigation as critical to determining how four Americans died. Clinton is expected to defend the sort of “expeditionary diplomacy” that brought U.S. Ambassador Chris Stevens to Benghazi, arguing that diplomacy is best conducted from the front-lines, TIME’s Zeke Miller reports. Republicans hope to focus the questioning on the attack itself, rather than Clinton’s emails. \nWatch the hearing above. 25 Current Visitors On This Page CRYPTO CURRENCIES ARE NOW LEGAL COMMODITIES Commodities are powered by Investing.com RECENT ARTICLES", "external_links": [], "published": "2015-10-22T19:28:00.000+03:00", "crawled": "2015-10-22T20:13:24.514+03:00", "highlightTitle": ""}