{"organizations": [], "uuid": "118e3242bba7968ed81b2fc20b61c5adbf26984a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ctvnews.ca", "main_image": "http://www.ctvnews.ca/polopoly_fs/1.2591626.1443784070!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "site_section": "http://www.ctvnews.ca/rss/ctvnews-ca-entertainment-public-rss-1.822292", "section_title": "CTVNews.ca - Entertainment - Public RSS", "url": "http://www.ctvnews.ca/entertainment/chris-brown-thanks-strong-new-zealand-women-for-support-1.2591623", "country": "CA", "title": "Chris Brown thanks 'strong New Zealand women' for support | Entertainment & Showbiz from CTV News", "performance_score": 0, "site": "ctvnews.ca", "participants_count": 1, "title_full": "Chris Brown thanks 'strong New Zealand women' for support | Entertainment & Showbiz from CTV News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "118e3242bba7968ed81b2fc20b61c5adbf26984a"}, "author": "AFP", "url": "http://www.ctvnews.ca/entertainment/chris-brown-thanks-strong-new-zealand-women-for-support-1.2591623", "ord_in_thread": 0, "title": "Chris Brown thanks 'strong New Zealand women' for support | Entertainment & Showbiz from CTV News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Wellington -- American R&B singer Chris Brown on Friday thanked New Zealand women's advocates for supporting his plan to perform in the country, despite a domestic violence conviction which could see him banned.\nBrown's 2009 conviction for assaulting his then-partner pop star Rihanna means he may be refused entry to New Zealand, even though tickets for a December 18 concert in Auckland went on sale this week.\nIn order to perform, Brown needs to apply for a special dispensation from immigration officials, which as of last week had not been granted.\nBut the Grammy winner has found support from an unlikely source -- Maori women's advocates who say Brown appears to have reformed and could send a powerful message against domestic violence.\nA string of high-profile advocates, such as former Women's Refuge chief Merepeka Raukawa-Tait, have backed Brown and offered to hold a traditional Maori welcome for him.\nFormer Maori Party chief Dame Tariana Turia said Maori youth could relate more to an anti-domestic violence message from 26-year-old Brown than one delivered by indigenous elders.\n\"Good, bad, ugly or otherwise, the truth of it is that young people are more likely to be in tune with Chris Brown than they are with one of us,\" the 71-year-old said this week.\nBrown acknowledged the \"amazing\" Maori women's stance on Friday.\n\"Nothing more amazing than strong women,\" he tweeted. \"Thank you to Dame Tariana Turia and everyone who showed their support in NZ.\"\nSupport for Brown in New Zealand is not unanimous, with government lawmaker Judith Collins saying last month: \"We've got enough wife-beaters in this country, he should just bugger off.\"\nBrown's also faces being banned from Australia because of his past, and he offered this week to raise awareness of domestic violence there if his \"One Hell of a Nite\" tour is allowed to go ahead.\nRelated Stories Chris Brown vows to raise awareness about domestic violence if granted entry to Australia Chris Brown's Australian tour in jeopardy over visa questions", "external_links": [], "published": "2015-10-02T03:00:00.000+03:00", "crawled": "2015-10-02T19:17:22.238+03:00", "highlightTitle": ""}