{"organizations": [], "uuid": "c6882874f1d0616c2f16192f54512839da0a2035", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news24.com", "main_image": "http://graph.facebook.com/10227041841/picture", "site_section": "http://www.news24.com/", "section_title": "News24, South Africa's premier news source, provides breaking news on national, world, Africa, sport, entertainment, technology &amp; more. ", "url": "http://www.news24.com/MyNews24/I-could-have-been-something-else-fees_must_fall-20151024", "country": "ZA", "title": "I could have been something else #fees_must_fall", "performance_score": 0, "site": "news24.com", "participants_count": 1, "title_full": "I could have been something else #fees_must_fall | News24", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T20:14:00.000+03:00", "replies_count": 0, "uuid": "c6882874f1d0616c2f16192f54512839da0a2035"}, "author": "news24.com", "url": "http://www.news24.com/MyNews24/I-could-have-been-something-else-fees_must_fall-20151024", "ord_in_thread": 0, "title": "I could have been something else #fees_must_fall", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I could have chosen to stay at home after matric or became someone's wife or work at a shop , become a drunkard or have plenty of kids get grant money from the government but I chose to start a journey which I thought was to a bright future , go to university get a degree maybe do honours, masters or even PhD only if it was that easy, apon my arrival at the tetiary institution I learnt the myth of free education in our country. The whole of the country has been made to believe in free education while each and every year a huge number of students go home with no degrees just a huge dept with no means to pay, annually students in almost all institutions embark on a student protect action yet no one asks the right questions. Every one of those students could have been something else , could have chosen something else but they chose education , why is our society not asking the big questions. If I chose education because it is free why am I fighting the same people to sure give me? But the only things that come out of our society is comments that some how are biased, they are only based on what the media says. If there is something that will kill our nation is ignorance , the youth unemployment rate rises every year yet every year thousands of students are accepted in tetiary institutions some for a year at most some for a few months, truth is its pure hell, most students admitted are of a poor background, starvation is more likely especially with the lack of funds, who wouldn't drop out if they would leave home to starve at school, some last only a year Why? There is a big giant called financial exclusion. No one really knows these struggles because of ignorance or maybe no one cares of the future of the youth. I still could have become something but I chose education but that chose seems blurred out now.", "external_links": [], "published": "2015-10-24T20:14:00.000+03:00", "crawled": "2015-10-24T13:26:06.121+03:00", "highlightTitle": ""}