{"organizations": [], "uuid": "2e78bbf2b9867d7bd0152f5d6084a1bd8e9872c0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theepochtimes.com", "main_image": "http://www.theepochtimes.com/n3/eet-content/uploads/2015/10/22/TerRa_Han-benjamin_chasteen8899-20150929-2-674x449.jpg", "site_section": "http://www.theepochtimes.com/n3/c/entertainment/feed/", "section_title": "The Epoch Times » Entertainment", "url": "http://www.theepochtimes.com/n3/1883222-the-essence-of-traditional-korean-music-in-the-21st-century/", "country": "US", "title": "The Essence of Traditional Korean Music in the 21st Century", "performance_score": 0, "site": "theepochtimes.com", "participants_count": 1, "title_full": "The Essence of Traditional Korean Music in the 21st Century", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T19:50:00.000+02:00", "replies_count": 0, "uuid": "2e78bbf2b9867d7bd0152f5d6084a1bd8e9872c0"}, "author": "Milene Fernandez , Epoch Times", "url": "http://www.theepochtimes.com/n3/1883222-the-essence-of-traditional-korean-music-in-the-21st-century/", "ord_in_thread": 0, "title": "The Essence of Traditional Korean Music in the 21st Century", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Essence of Traditional Korean Music in the 21st Century Kayageum virtuoso, TeRra Han's Performance in Carnegie Hall By Milene Fernandez , Epoch Times | October 25,   25, 2015 2:39 pm < > \nTeRra Han plays the kayagum, a traditional Korean 12-string zither, at Carnegie Hall in New York on Sept. 29, 2015. (Benjamin Chasteen/Epoch Times) \nNEW YORK—Hundreds of years ago we probably had better ears. Without the noises of an industrialized, mechanical, digital world, we were probably more attentive too. Tree leaves rustling in the wind, spring water weaving around rocks, birds singing. The sounds and rhythms of nature permeated daily life. Nature overall influenced musicians and their compositions. The kayageum, a Korean zither-like instrument, was loud enough to fill a small recital hall, even with its 12 strings made of silk. \nTo hear such an instrument in the 21st century is rare. It was therefore an exquisite treat to listen to the kayageum virtuoso, TeRra Han perform authentic Korean sanjo classical music at the Weill Recital Hall in Carnegie Hall on Sept. 29—without any microphones. And yes, the strings of her kayageum, like the beautiful traditional Korean dress that she designed and wore to complement the music, were indeed made out of silk. TeRra Han plays the Kayageum at Carnegie Hall in New York on Sept. 29, 2015. (Benjamin Chasteen/Epoch Times) \n“It was amazing, the acoustics, the sound of the space was really nice,” Han said during an interview at Big Apple Studios on the afternoon after her first performance at Carnegie Hall . A child prodigy, she started playing the piano when she was 5 years old and started performing the kayageum when she was 8. Now 34, she is considered one of the most outstanding kayageum musicians in Korea. The kayageum sanjo is never played the same way twice. \nWith her traditional Korean dress, her perfectly made up face, and demure appearance on stage, Han seemed like a work of art of ancient times that had come to life. “If I wear a costume that is balanced well with the music, I can play better,” she said. But TeRra—who’s name roughly translates as “great things coming to earth”—wants her music to be relevant today. \n“I think this music is really needed in this period,” she said, revealing the fortitude she has had to have in order to maintain a musical tradition that may seem out of place at a time of busy lifestyles, information overload, and instant access to things—at a time when easy distraction replaces the ability to listen well. \n“I want to make the world more beautiful with my music,” she said. TeRra Han, a virtuoso kayageum musician in New York on Sept. 30, 2015. (Benjamin Chasteen/Epoch Times) Trained in both Western and Asian music, she can play Mozart and even jazz, and can play several instruments, including the Chinese guqin, the Japanese koto, and the Indian sitar. Yet, some of her Korean musician friends, who have collaborated with her on contemporary pieces, remind her to continue playing and treasuring traditional Korean music. Otherwise it could be forgotten. \n“I don’t want my music to just exist as if in a museum. I want to share my music with all people,” she said. Her goal is to find her audience. “I have to think about when, where, and to whom I should play this music. … I have to open my mind and share my music,” she said. \nIt’s not easy to understand traditional Korean music, especially for a Western audience. “I was a little worried if I could reach the audience, but it was nice,” she said. Bridging East and West, Reconciling Past and Present \nSimilar to the sonata, sanjo is considered the most representative style of Korean traditional music from the 19th century. UNESCO proclaimed it as a masterpiece of the oral and intangible heritage of Korea. \nHan played the full version of a kayageum sanjo in the style of the Choi Ok Sam master to celebrate the 120th anniversary of that well-respected school. The entire folk piece is about the life of Choi Ok Sam, a farmer who was also a musician. \nAccording to custom, Han was accompanied by a janggu (Korean drum) player, who occasionally would sing one-vowel words of encouragement—something like, “oh good,” or “very nice.” Han explained that it encourages the soloist to continue playing more. “That’s one important element of this music,” she said. \nThe nearly one hour piece begins slowly, with plucking that seemed rather random to ears accustomed to Western concert music. The janggu drummer, Sumin Cho would strum and strike simultaneously, also at seemingly random times. Cho’s left hand would tap lightly, correlated with the moon and yin energy while her right hand would strike with unmistakable determination, correlated with solar or yang energy, Han explained. I don’t want my music to just exist as if in a museum. I want to share my music with all people. — TeRra Han , musician \nThe rhythm of the entire piece increased so gradually that its buildup to an incredibly rapid galloping pace was surprisingly perceptible only when the piece was almost over. Any theme or melody that would start to form would suddenly take a completely unexpected turn, without any clear resolutions or predictable transitions until the end. \nHan assured, “In Korean music and arts, we make the conclusion at the end,” meaning that the main point of the piece is not revealed until the end, unlike in some Western music, which introduces the main theme of a piece at the beginning. \nHan considers the music, especially in the beginning at a slow tempo, as a kind of meditation. She counts the rhythm throughout the piece and also focuses on the mood of the music. “This music is actually very strong and sad music emotionally,” she said and then mentioned the tough history of Korea and how women were generally sad and lonely while their husbands fought in wars. \nThe full version of “Choi Ok Sam: Kayageum Sanjo” that she played unfolded similarly to how thoughts come and go, either developing into a narrative or quickly being replaced by the next thoughts. As the music took surprising turns, letting go of expectations, it’s melodies and rhythmical motifs began to sink in beautifully. From Master to Student \nOriginally the kayageum sanjo was played as improvisation by a kayageum master. Han explained the piece does not have a score, but was memorized from the teacher’s playing. The student would then gradually add his or her own artistry and improvisation. \nIn the most traditional way, the kayageum sanjo, while maintaining its eight rhythmical patterns, is never played the same way twice. The way each musician interprets the music is completely different—a section played very loudly by one musician may be played very quietly by another. \nHan’s artistry and dexterity playing the kayageum is more than impressive, especially evident in how she maintains her peaceful demeanor even while pressing down hard on the strings to create vibrato. \n“In some parts my fingers are moving by themselves,” she said. \nAlthough the unique timbre of the kayageum instrument, with its silk strings is rather quiet, Han said, “Actually this music is very powerful.” In traditional Asian music, there’s not so much emphasis on the dynamics (loudness, from pianissimo to forte) but on energy, or what the Chinese call “qi,” she explained. \n“We think energy is very important. … The beginner student of music actually cannot make energy; they just pluck strings. But as they practice more and more, they make their own energy and become great musicians,” Han said. It is all about how to create and balance energy with great skill. \nAlso what she called “substance” is very important. “We [Korean artists] have our own substance, also American and European artist they have their own substance. But finally we can share together; we can recognize each has their own unique beauty,” Han said. \nIn April and May, 2016 Han will tour to celebrate the 130th anniversary of relations between France and Korea, performing in Seoul, Tokyo, Paris, and New York. She will also do some recording and perform solo recitals in Tokyo and the United States during the 2016 fall–winter season. TeRra Han, a virtuoso kayageum musician in New York on Sept. 30, 2015. (Benjamin Chasteen/Epoch Times)", "external_links": [], "published": "2015-10-25T19:50:00.000+02:00", "crawled": "2015-10-25T21:13:05.820+02:00", "highlightTitle": ""}