{"organizations": [], "uuid": "5cabe396645ad02d1d2c023c9db704cf801f69d8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nydailynews.com", "main_image": "http://assets.nydailynews.com/polopoly_fs/1.2407961!/img/httpImage/image.jpg_gen/derivatives/landscape_1200/confitemsweb23f-2-web.jpg", "site_section": "http://www.nydailynews.com/entertainment/index.html", "section_title": "Entertainment News &amp; Reviews - NY Daily News", "url": "http://www.nydailynews.com/entertainment/gossip/confidential/alexander-wang-present-ace-influencer-award-article-1.2407962", "country": "US", "title": "Alexander Wang to present ACE Influencer Award", "performance_score": 0, "site": "nydailynews.com", "participants_count": 1, "title_full": "Alexander Wang to present ACE Influencer Award - NY Daily News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "5cabe396645ad02d1d2c023c9db704cf801f69d8"}, "author": "NEW YORK DAILY NEWS", "url": "http://www.nydailynews.com/entertainment/gossip/confidential/alexander-wang-present-ace-influencer-award-article-1.2407962", "ord_in_thread": 0, "title": "Alexander Wang to present ACE Influencer Award", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Gilbert Carrasquillo/FilmMagic Alexander Wangwill present “Empire” costume designer Paolo Nieddu and actress Taraji Henson with the Accessories Council’s 2015 ACE Influencer Award on Nov. 2. WANG CHARGED AS AN ACCESSORY\nAlexander Wang will present “Empire” costume designer Paolo Nieddu and actress Taraji Henson with the Accessories Council’s 2015 ACE Influencer Award on Nov. 2 at Cipriani in Midtown. Confidenti@l has learned exclusively that Wang, who recently departed Balenciaga, will be on hand as a presenter at the black-tie event that will also honor stylish socialite Ivanka Trump , menswear designer John Varvatos and InStyle director Ariel Foxman .\nMUSTO-SEE TV\nLogo TV’s “Cocktails & Classics” begins its second season on Nov. 1 with actor Michael Urie , “RuPaul’s Drag Race” star Shangela , writer Michael Musto and comedian Drew Droege screening the 1981 film “Mommie Dearest” while offering their own snarky brand of commentary.\nRutanya Alda , who plays Joan Crawford’s trusty aide Carol Ann in the film, will be on hand to discuss her book “The Mommie Dearest Diary: Carol Ann Tells All.”\nLogo TV’s “Cocktails & Classics” begins its second season on Nov. 1. SKY’S THE LIMIT\nNicole and Natalie Albino, the sisters better known as the recording artists Nina Sky , performed a mini-tour in Gowanus, Brooklyn, for a Chartered By Foursquare event to promote their new album coming out in November. The twins, who had a 2004 hit with “Move Your Body,” visited spots, including Royal Palms Shuffleboard Club, Brooklyn Boulders and Triple Diamonds Tattoo, where Nicole inked her body with a tattoo of her dog while drinking a Brooklyn Brewery beer.\nFRANC-LY, THAT’S A GREAT ’STACHE!\nRobO/Splash News/RobO/Splash News James Franco and Zoe Kazan seen filming \"The Deuce\" in Brooklyn. James Franco , his mustache and Zoe Kazan shoot scenes for “The Deuce” in Brooklyn. The upcoming HBO show comes from the brain of “The Wire” creator David Simon and deals with the Times Square porn industry of the ’70s and ’80s. The show got some unwanted publicity earlier this month when one of its producers, Marc Johnson , was questioned by police after a night of partying with 38-year-old dermatologist Kiersten Cerveny , who wound up dead in a Chelsea apartment building vestibule after an apparent drug overdose. Johnson was released.\n3RD TIME A CHARM FOR KIRSTEN, JESSE\nKristen Stewart and Jesse Eisenberg shared a carriage ride while working on Woody Allen ’s current project, which still hasn’t been named. This is the third time Stewart has teamed up with Eisenberg — once for 2009’s “Adventureland” and again for this year’s “American Ultra.”\nSEEN AND HEARD\nBernadette Peters and Stephen Sondheim honoring “Into the Woods” writer James Lapine with a Mr. Abbott Award at Stage 48 … Lo Bosworth stopping by the Café Bustelo Pop-Up Café Experience on the Bowery …V Burger will open in Union Square on Oct. 29 … Woody Allen and Soon Yi at the Bryant Park Hotel … Steve Stanulis will premiere “Legends of Freestyle” at the AMC Theater in Times Square on Nov. 7 …\nTUNE IN TO SEE HER YES FACE\nHandout Writer Mandy Stadtmiller’s comedian boyfriend Pat Dixon will become her fiancé Friday when he pops the question on Periscope for the couple’s fans to watch live. Good thing we found out about it before the lucky gal. Writer Mandy Stadtmiller ’s comedian boyfriend Pat Dixon will become her fiancé Friday when he pops the question on Periscope for the couple’s fans to watch live. Dixon will get down on one knee at 4 p.m. in Times Square, and says he thinks it may be the first marriage proposal on the video site. “But if she doesn’t say ‘yes,’ it’ll be more like Embarrass-scope.” You can watch live today by following it on @patdixon. Mazel tov!\nsjplovely.com Sarah Jessica Parker will announce the launch of a 10th Anniversary special edition bottle of her perfume, \"Lovely.\" Jason LaVeris/FilmMagic Sarah Silverman turns heads at the L.A. premiere of “I Smile Back.” Previous Next Enlarge THIS JOEL IS THE PIANO WOMAN\nAlexa Ray Joel kicks off her two-week engagement at the Cafe Carlyle and her proud mom Christie Brinkley is her biggest fan in the sold-out room. After Joel’s Upper East Side show, the 61-year-old supermodel tweeted, “Hands Down the best show uptown!” That’s high praise from Billy Joel ’s former Uptown Girl. Joel, 29, plays daily at Cafe Carlyle through Oct. 31, except on Mondays when Woody Allen & the Eddy Davis New Orleans Jazz Band rocks the room.\nSCENTS & THE CITY\nSarah Jessica Parker will soon launch a 10th anniversary edition bottle of her “Lovely” perfume. While the cursive-letter-emblazoned sweatshirt SJP wears in the promo shots looks familiar from her “Sex and the City” days, it’s rare we see TV’s Carrie Bradshaw not wearing shoes. Fans can win the sweatshirt by sharing their favorite memories on Twitter or Instagram, tagging @sjplovely and using the LovelyTurns10 hashtag.\nGot some hot gossip for us?\nTipline: 212-210-1616\nE-mail: confidential@nydailynews.com", "external_links": [], "published": "2015-10-23T03:00:00.000+03:00", "crawled": "2015-10-23T11:37:16.128+03:00", "highlightTitle": ""}