{"organizations": [], "uuid": "e38ef72f0d09b8af3490ca99c1d96a93cd32b08d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nydailynews.com", "main_image": "http://assets.nydailynews.com/polopoly_fs/1.2393080!/img/httpImage/image.jpg_gen/derivatives/landscape_1200/turkey-explosions.jpg", "site_section": "http://www.nydailynews.com/news/index.html", "section_title": "Breaking, Local and National News, Sports &amp; Entertainment - NY Daily News", "url": "http://www.nydailynews.com/news/world/mourners-clash-turkish-police-access-blast-site-article-1.2393083", "country": "US", "title": "Mourners clash with Turkish police to access blast site", "performance_score": 0, "site": "nydailynews.com", "participants_count": 1, "title_full": "Mourners clash with Turkish police to access blast site - NY Daily News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T03:00:00.000+03:00", "replies_count": 0, "uuid": "e38ef72f0d09b8af3490ca99c1d96a93cd32b08d"}, "author": "NEW YORK DAILY NEWS", "url": "http://www.nydailynews.com/news/world/mourners-clash-turkish-police-access-blast-site-article-1.2393083", "ord_in_thread": 0, "title": "Mourners clash with Turkish police to access blast site", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SEDAT SUNA/EPA A woman waits with flowers behind police lines as Turkish authorities keep the blast site in Ankara closed off to mourners. Burhan Ozbilici/AP Leaders of the pro-Kurdish Democratic Party of Peoples, Selahattin Demirtas, center, and Figen Yuksekdag, left, hold red carnations during a memorial Sunday morning for those killed and wounded in Saturday's double bombing. Previous Next Enlarge Grieving protesters and politicians clashed with Turkish police, pleading to pay tribute to 95 people killed in two Ankara suicide bombings with red carnations.\nThe scuffles broke out as riot gear-clad authorities refused to allow pro-Kurdish demonstrators access the blast site during the country’s three days of mourning.\nProtesters were kept back as investigators reportedly combed the site for evidence to the culprits behind the double bombing.\nOZAN KOSE/AFP/Getty Images Turkish riot police block Istiklal Avenue as thousands of protesters take part in a march against the deadly attack earlier in Ankara. VIDEO SHOWS MOMENT TWO BOMBS EXPLODED AT PEACE RALLY\nA group of 200 people were eventually allowed to enter the blast site, according to a Wall Street Journal reporter on Twitter .\nWhile no groups have claimed responsibility in the deadly attacks, Prime Minister Ahmet Davutoglu believes Kurdish rebels and Islamic State militants may be to blame.\nThe terrorist attack targeted a peace rally attended by members of the pro-Kurdish party, whose leaders, Selahattin Demirtas and Figen Yuksekdag, rallied again Sunday morning to memorialize the victims.\nSwarming crowds carried photographs of those killed in Saturday’s attack, marching toward the city’s main square chanting slogans decrying Turkish President Recep Tayyip Erdogan.\nWith News Wire Services.", "external_links": ["https://twitter.com/aylushka_a/status/653113219758837760"], "published": "2015-10-11T03:00:00.000+03:00", "crawled": "2015-10-11T12:43:02.318+03:00", "highlightTitle": ""}