{"organizations": ["American Hustle"], "uuid": "5be70da1107dbbd108f0bde6cb10de2f309d77f8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stalbansreview.co.uk", "main_image": "http://www.stalbansreview.co.uk/resources/images/4318526/", "site_section": "http://www.stalbansreview.co.uk/uk_national_entertainment/rss/", "section_title": "St Albans & Harpenden Review | National Entertainment News", "url": "http://www.stalbansreview.co.uk/uk_national_entertainment/13844304.Jennifer_Lawrence__I_didn_t_want_to_seem_like_a_brat_over_American_Hustle_pay_deal/?ref=rss", "country": "GB", "title": "Jennifer Lawrence: I didn't want to seem like a brat over American Hustle pay deal", "performance_score": 0, "site": "stalbansreview.co.uk", "participants_count": 0, "title_full": "Jennifer Lawrence: I didn't want to seem like a brat over American Hustle pay deal", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T17:59:00.000+03:00", "replies_count": 0, "uuid": "5be70da1107dbbd108f0bde6cb10de2f309d77f8"}, "author": "", "url": "http://www.stalbansreview.co.uk/uk_national_entertainment/13844304.Jennifer_Lawrence__I_didn_t_want_to_seem_like_a_brat_over_American_Hustle_pay_deal/?ref=rss", "ord_in_thread": 0, "title": "Jennifer Lawrence: I didn't want to seem like a brat over American Hustle pay deal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jennifer Lawrence"], "text": "Jennifer Lawrence: I didn't want to seem like a brat over American Hustle pay deal Jennifer Lawrence: I didn't want to seem like a brat over American Hustle pay deal \nPress Association 2014 / / National Entertainment News Share \nJennifer Lawrence has spoken for the first time about learning how she earned less than her male co-stars in American Hustle, thanks to the Sony hacking scandal. \nThe actress said rather than being angry at the studio for paying her less than Bradley Cooper, Christian Bale and Jeremy Renner, she was mad at herself for not being a tough enough negotiator and worrying about appearing to be a “brat”. \nIn an essay about gender pay inequality for Lena Dunham’s Lenny newsletter, the Hunger Games star wrote: “I would be lying if I didn’t say there was an element of wanting to be liked that influenced my decision to close the deal without a real fight. \n“I didn’t want to seem ‘difficult’ or ‘spoiled’. At the time, that seemed like a fine idea, until I saw the payroll on the internet and realised every man I was working with definitely didn’t worry about being ‘difficult’ or ‘spoiled’.” (Evan Agostini/AP) \nAt the end of last year, emails came to light that revealed Jennifer and co-star Amy Adams earned less than their male co-stars in the David O Russell film. \nThe leaked exchanges between studio executives showed the female stars – who both received Oscar nods for their performances– received seven per cent shares of the film’s profits while the director and the three male leads received nine per cent. Promoted stories \nJennifer said of the events: “When the Sony hack happened and I found out how much less I was being paid than the lucky people with d***s, I didn’t get mad at Sony. I got mad at myself. \n“I failed as a negotiator because I gave up early. I didn’t want to keep fighting over millions of dollars that, frankly, due to two franchises, I don’t need.” (Evan Agostini/AP) \nJennifer also questioned whether female stars were “conditioned” to behave in a certain way. “Could there still be a lingering habit of trying to express our opinions in a certain way that doesn’t ‘offend’ or ‘scare’ men?” she wrote. \nBut she said she had learned to be tougher in future. \n“I’m over trying to find the ‘adorable’ way to state my opinion and still be likeable! F*** that. Share article \n“I don’t think I’ve ever worked for a man in charge who spent time contemplating what angle he should use to have his voice heard. It’s just heard.” Promoted Stories", "external_links": [], "published": "2015-10-13T17:59:00.000+03:00", "crawled": "2015-10-14T00:26:46.278+03:00", "highlightTitle": ""}