{"organizations": [], "uuid": "f7b9b71b6bb74f9ef05c54d120f89cede7bfc5d8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://images.canberratimes.com.au/2015/10/21/6947757/AA-t-PMBook_Huff.jpg", "site_section": "http://feeds.canberratimes.com.au/rssheadlines/entertainment.xml#", "section_title": "Canberra Times Entertainment Headlines", "url": "http://www.canberratimes.com.au/entertainment/books/stephanie-reeder-reviews-children-books-with-inspiring-pictures-20151021-gk29od.html", "country": "AU", "title": "Stephanie Reeder reviews children books with inspiring pictures", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "Stephanie Reeder reviews children books with inspiring pictures", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T15:45:00.000+03:00", "replies_count": 0, "uuid": "f7b9b71b6bb74f9ef05c54d120f89cede7bfc5d8"}, "author": "Stephanie Owen Reeder", "url": "http://www.canberratimes.com.au/entertainment/books/stephanie-reeder-reviews-children-books-with-inspiring-pictures-20151021-gk29od.html", "ord_in_thread": 0, "title": "Stephanie Reeder reviews children books with inspiring pictures", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Picture books can be inspirational artefacts, taking children on imaginative journeys that help them to closely observe and learn about the real world. \nEveryone has the occasional bad day, when everything seems grey and uninviting. In Anna Walker's sensitive and insightful Mr Huff (Penguin, $24.99) , Bill is having one of those days. He wakes up, looks out the window and decides that it is \"Cloudy, with a chance of rain\". This observation sets the mood for the rest of his day. \nNothing goes right, and by the time Bill gets to school a large grey cloud looms over his head. As the day progresses and Bill's mood darkens, the cloud grows and metamorphoses into the very persistent Mr Huff. It is not until Bill realises that Mr Huff is a creation of his own emotional state that he is able to embrace him. When he does, Mr Huff begins to shrink. And the next day, when Bill wakes up, he sees that it is \"cloudy, with a chance of sunshine\". \nThis is a poignant and reassuring exploration of negative feelings and how to overcome them. Using detailed pencil, ink and collage illustrations in subdued colours, Walker creates images that are moody but not maudlin, and the imposing Mr Huff himself is strangely endearing. She achieves this by providing touches of gentle humour that help to lift the mood, showing that, even when you are feeling down, it is still possible to see the funny side of life. Despite its serious subject matter, this is a heart-warming and inspirational book.\nAdvertisement Finding Monkey Moon (Walker, $24.95) , by Elizabeth Pulford and Kate Wilkinson, also has moments of darkness. Many parents will identify with the panic that sets in when a favourite toy is missing at bedtime. When Monkey Moon cannot be found anywhere inside the house, Michael and his Dad set out into the darkness to find the much-loved toy that has apparently been left in the park. The result is an at times scary father-son adventure with a tender ending.\nPulford's lyrical text reads well aloud, making this a perfect bedtime story. Wilkinson's evocative and atmospheric illustrations create suitably haunting landscapes, with houses looming over the pavement, ghost-like trees and threatening shadows. Through it all, Dad is a reassuring presence, as Michael explores a familiar place in its unfamiliar night-time guise. And it is the close bond between father and son that is at the heart of this gentle tale.\nSuri's Wall (Penguin, $24.99) by Lucy Estela and Matt Ottley is also dark and unsettling. This enigmatic and intriguing story is sure to engender discussion amongst older children. It tells the story of a girl called Suri who, along with other children, is imprisoned/protected in a fortress surrounded by an imposing wall. Suri, who is much taller than the other children, is isolated by her difference, but when she grows tall enough to see what is on the other side of the wall, the other children are drawn to her. \nEspousing the importance of hope in the face of destruction and dislocation, this is very much a tale for our time. Estela's haunting text, with its folktale cadences, examines the gulf between reality and imagination, despair and hope, and the ultimate resilience of the human spirit. \nMatt Ottley's illustrations capture the undercurrents in Estele's text, creating a stark environment for the children in the fortress, which is set upon towering ramparts that look out over the city. As Suri describes the city beyond the wall to the other children, Ottley creates a colourful land full of rich colours and interesting details. However, his opulent images have dark undertones that hint at the reality that Suri is keeping from the children. This fascinating story raises more questions than it answers, but therein lies its strength.\nGraeme Base draws on a range of imagery to heighten the visual appeal of his latest picture book Eye to Eye (Penguin, $26.99) . The underlying premise is a child confronting eye to eye the 'creatures' that make up his domestic world. This leads him to wonderful flights of the imagination, including flying with eagles, galloping on a horse across the desert, close encounters with elephants and swimming beneath the waves with a majestic whale. \nWhat carries this simple exploration of a child's world beyond the ordinary is the striking design of the book and Base's trademark sumptuous illustrations. The design elements have been pared down, with unadorned grey and charcoal framing around each image. The simplicity of presentation allows the eye to concentrate on the illustrative elements: silhouette vignettes of the boy playing with his toys, small but intense framed images of eyes, and elaborate double-page spreads of the boy in stunning landscapes interacting with the featured creatures. There is much to engage and enthral in this beautiful book, including a final page that provides interesting details about each creature. \nThere is even more for children to look at, explore and think about in Beci Orpin's Find Me a Castle: A Look-and-Find Book (Penguin, $24.99) . Each double-page spread presents a different environment – bookshelves, table, bathroom, garden, night-time, fairground, city, museum, forest, seaside, mountains and sky – and encourages children, guided by the interactive and carefully crafted text, to find as many things as possible hidden in each image, including a different castle imbedded in each page.  \nOrpin's illustrations are highly decorative and stunningly designed. At first viewing they appear simple and uncluttered, but a closer look reveals a plethora of details hidden within the patterned images. This book provides both a pleasurable reading experience and visual challenges for keen-eyed children –– two elements that are essential for picture books that have the ability to elicit that magical response, \"Read it again!\"\nStephanie Owen Reeder is an award-winning Canberra author, illustrator and editor, whose latest book, Lennie the Legend (NLA Publishing), was recently shortlisted in the NSW Premier's History Awards.", "external_links": [], "published": "2015-10-23T15:45:00.000+03:00", "crawled": "2015-10-23T22:28:19.273+03:00", "highlightTitle": ""}