{"organizations": [], "uuid": "313416e6d6eea4c2250b9581888beab290363f6b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266347/arts-entertainment-general", "section_title": "Arts &amp; Entertainment: General - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30322606/translucent-ham-sandwich-band-music-from-the-future-album-release-on-itunes", "country": "US", "title": "Translucent Ham Sandwich Band- \"Music From The Future\" album release on iTunes", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Translucent Ham Sandwich Band- \"Music From The Future\" album release on iTunes - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T11:11:00.000+03:00", "replies_count": 0, "uuid": "313416e6d6eea4c2250b9581888beab290363f6b"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30322606/translucent-ham-sandwich-band-music-from-the-future-album-release-on-itunes", "ord_in_thread": 0, "title": "Translucent Ham Sandwich Band- \"Music From The Future\" album release on iTunes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Evan Stone and the Translucent Ham Sandwich Band (THSB) will release their debut album \"Music From The Future\" on iTunes on 11/05/15 to coincide with a performance that same evening held at the Mint in Los Angeles .\nLos Angeles, Ca. (PRWEB) October 22, 2015\nThe OC/LA County-based music performance ensemble of Evan Stone and the Translucent Ham Sandwich Band, known locally as one of the most visually interesting and musically adept acts on the music scene today, will release their debut recording, \"Music From The Future\" (Bigger Bang Music) on iTunes November 5th, 2015. The official release will coincide with a live performance that same evening to be held at the world renowned concert venue, 'The Mint' in West Los Angeles. http://www.themintla.com\nThe single, \"Censor Me' (released on iTunes April 20th, 2015) and the accompanying video received international airplay on radio and cable television stations throughout the U.S., U.K. and Europe, including Havoc Television, Americas #1 action sports and indie music digital on demand network with 46 million subscribers. https://www.youtube.com/watch?v=CbhGUj8PhSc\nThe selections on the album, \"Music From The Future\" offer poetic deliveries of the slam variety leaning towards social commentary with regards to current American politics and religion, as well as the more traditional fictional thought-provoking content, with the use of progressive funk, hip hop, rock and the improvisational spirit of jazz imbued throughout.\nBesides the 10 piece orchestra on stage performing new experimental improvised music; dancers, magicians, painters, poets, jugglers, video artists and other avant-garde purveyors of entertainment get in on the act during their live shows.\nThe group performs as costumed characters recently conceived in a somewhat controversial photo shoot (see photo) outlined in the OC Weekly newspaper depicting their version of Leonardo da Vinci's 'Last Supper' (entitled \"The Ham Dinner\"), in an effort to make the experience a more theatrical one that is as visually stimulating as it is audibly.\nhttp://www.translucenthamsandwichband.com\n //www.prweb.com/releases/thsbalbum/musicfromthefuture/prweb13032517.htm\n ", "external_links": ["http://www.prweb.com/releases/thsbalbum/musicfromthefuture/prweb13032517.htm", "http://www.youtube.com/watch?v=CbhGUj8PhSc"], "published": "2015-10-22T11:11:00.000+03:00", "crawled": "2015-10-22T11:07:04.481+03:00", "highlightTitle": ""}