{"organizations": ["NoCo", "Spike TV"], "uuid": "660332070017d1158b686da90dbc5f5fd2efd6c8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.coloradoan.com", "main_image": "http://www.gannett-cdn.com/-mm-/b232e154d90a47cb081e52949ab2b1a69ea461ef/c=42-0-559-291&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/22/FortCollins/B9319382695Z.1_20151022132807_000_GM8CASSIE.1-0.jpg", "site_section": "http://rssfeeds.coloradoan.com/fortcollins/entertainment", "section_title": "Fort Collins - Entertainment", "url": "http://www.coloradoan.com/story/entertainment/2015/10/22/rodeo-gate-workout-spike-tv/74398320/", "country": "US", "title": "NoCo gym to be featured on Spike TV show", "performance_score": 0, "site": "coloradoan.com", "participants_count": 0, "title_full": "NoCo gym to be featured on Spike TV show", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T20:34:00.000+03:00", "replies_count": 0, "uuid": "660332070017d1158b686da90dbc5f5fd2efd6c8"}, "author": "", "url": "http://www.coloradoan.com/story/entertainment/2015/10/22/rodeo-gate-workout-spike-tv/74398320/", "ord_in_thread": 0, "title": "NoCo gym to be featured on Spike TV show", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NoCo gym to be featured on Spike TV show   11:34 a.m. MDT October 22, 2015 A rodeo gate workout at Cowboys Gym. The gym, with two locations in Northern Colorado will be featured on Spike TV’s “Sweat Inc.” (Photo: Courtesy of Cowboys Gym) \nNever heard of a rodeo gate workout? \nWell, welcome to the wild West. \nAfter 14 years as a rodeo rider in the pro rodeo circuit, 43-year-old Ryan Ehmann took what he knew and poured it into an up-and-coming fitness trend, with his two local Cowboys Gym locations offering up daily 28-minute workouts that caught the attention of reality TV producers. \n“Sweat Inc.” a show on Spike TV featuring television personality and trainer Jillian Michaels pits 27 personal trainers – and their fitness products or programs – against each other. The winner nabs a $100,000 prize and the chance to have their product or concept put in a nationwide gym franchise. \nEhmann is a featured trainer and will compete against two others in his Nov. 3 episode. The winner of each episode advances, continuing in the competition. \nEhmann’s gyms – one that's been in Loveland for 7 years and a brand new one in Fort Collins – have red rodeo gates lining the walls with the option to climb them, do squats on them or even hook TRX or resistance bands to them. The possibilities allow for a new full-body, fat-burning workout every day, which are planned by the gym’s trainers. \nThe 28-minute workouts are equivalent to 1 hour on a treadmill, burn more than 500 calories and have three fitness levels, according to the gym’s website. \nAnd there are no set class times, which Ehmann said is popular. \n“Your workout starts when you show up,” he said, adding that members – mostly female – warm-up on specialty equipment before trainers take them through the daily workout. A monthly membership rate costs $79, Ehmann said. \n“The women absolutely love it,” he said of the workouts, adding that the flexibility allows members to come in on their own time without having to worry about being late to, or missing, a set class. \nThough the Loveland Cowboys Gym has been around for about 7 years, Ehmann said the Fort Collins spot, at 3307 S. College Ave., has just been open for about two weeks. It’s grand opening will be Nov. 7. Read or Share this story: http://noconow.co/1LP7gYd MORE STORIES", "external_links": [], "published": "2015-10-22T20:34:00.000+03:00", "crawled": "2015-10-23T11:21:57.031+03:00", "highlightTitle": ""}