{"organizations": [], "uuid": "aaa5048a4970d6299f564ece5a7d2c9335b9a06b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "snn.bz", "main_image": "http://i0.wp.com/snn.bz/wp-content/uploads/2013/03/Sheryl-Sandberg700.jpg?resize=700%2C394", "site_section": "http://SyndicatedNews.NET/feed/", "section_title": "Syndicated News - Live News Entertainment Political Music News", "url": "http://snn.bz/cnn-one-things-for-sure-sheryl-sandberg-is-in-the-crosshairs/", "country": "US", "title": "Too wealthy to relate", "performance_score": 0, "site": "snn.bz", "participants_count": 1, "title_full": "Too wealthy to relate", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T16:03:00.000+03:00", "replies_count": 0, "uuid": "aaa5048a4970d6299f564ece5a7d2c9335b9a06b"}, "author": "SyndicatedNews", "url": "http://snn.bz/cnn-one-things-for-sure-sheryl-sandberg-is-in-the-crosshairs/", "ord_in_thread": 0, "title": "Too wealthy to relate", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEWS , TECHNOLOGY We all expect to be judged on our merits at work—to be recognized for our accomplishments and our unique talents, insights, and efforts. But does that actually happen? A variety of recent research by business, psychology, and sociology scholars offers a window into women’s collective experiences in the workplace, confirming some intuitive notions (that men get the better assignments, for instance) and calling others (are women leaving work to care for their children?) into question. High Potentials: And the Plum Assignment Goes To… \nMen get more of the critical assignments that lead to advancement than women do, according to a recent Catalyst study of 1,660 business school graduates, which examined the nature of projects given to high-potential employees. On average the men’s projects had budgets twice as big and three times as many staffers as the women’s. Only 22% of the women, but 30% of the men, were given budgets of more than $10 million, and just 46% of the women, versus 56% of the men, received P&L responsibility. Even more telling, while more than a third of the men reported that their assignments garnered them a great deal of attention from the C-suite, only about a quarter of the women could say the same. Source: “Good Intentions, Imperfect Execution? Women Get Fewer of the ‘Hot Jobs’ Needed to Advance,” by Christine Silva, Nancy M. Carter, and Anna Beninger, Catalyst, 2012. Work/Life Balance: Why Women Really Leave \nIf high-potential women are leaving their careers to care for their families, they’re not doing it on purpose. That’s the conclusion Hunter College professor Pamela Stone drew from a study of 54 female high achievers, recruited mostly from alumnae of four selective colleges and universities. The women pursued their careers an average of 11 years; 60% worked well past the birth of their second child. None was pushed out. Fully 90% left not to care for their families but because of workplace problems, chiefly frustration and long hours. Two-thirds of those who left tried part-time work but found it problematic; since they’d been putting in long weeks, part-time tended to mean 40 hours of work for 20 hours’ worth of pay. Factoring even more into decisions to opt out entirely, though, was the inability to work part-time without being marginalized. Source: “‘Opting Out’: Challenging Stereotypes and Creating Real Options for Women in the Professions,” by Pamela Stone, Gender & Work: Challenging Conventional Wisdom, Harvard Business School, 2013. The Corporate Ladder: The Ladies Vanish \nData from McKinsey’s most recent survey of 60 major corporations show that both the number and the percentage of women fall off dramatically in the higher ranks of organizations. \nSource: “Unlocking the Full Potential of Women at Work,” by Joanna Barsh and Lareina Yee, McKinsey & Company, 2012. Ethics: That’s Not OK \nWould you assign a talented subordinate to a peripheral project and publicize his mistakes to prevent him from receiving too much admiration? How about using a cheaper ingredient known to cause lethal allergic reactions in some people in a product so you could meet a financial projection and get a bonus? These and other ethical dilemmas were considered by 65 women and 38 men recruited at large through Amazon’s Mechanical Turk service. The women displayed far more outrage over these morally questionable decisions—and also thought they made less business sense—than the men in this small but disturbing experiment conducted by Jessica Kennedy of Wharton and Laura Kray from the Haas School of Business. \nIn a second experiment, Kennedy and Kray presented 84 female and 94 male college students with descriptions of job openings in consulting, private equity, and wealth management. The women were just as keen as the men to pursue those positions—unless the descriptions specified they’d be expected to, say, suppress their advice to collect a fee or fund a company that made its profits through some wholly unethical business practice. Source: “Who Is Willing to Sacrifice Ethical Values for Money and Social Status? Gender Differences in Reactions to Ethical Compromises,” by Jessica A. Kennedy and Laura J. Kray, Social Psychological & Personality Science, 2013. \nCompensation: The Nastiness Premium \nWhether or not women become less likable as they rise through the ranks, research reveals that being disliked is not the penalty some people think it is. In examining a series of longitudinal studies of U.S. workers, stretching back as far as 1957 and continuing through 2008, Timothy Judge of Notre Dame, Beth Livingston of Cornell, and Charlice Hurst of the Ivey School of Business found that disagreeable people consistently earned more than agreeable people. This was true for both men and women, regardless of occupational status and job responsibility (suggesting that not only disagreeable lawyers and engineers but also disagreeable teachers and social workers earn more than their nicer colleagues). And sadder to say, over time both men and women paid a further wage penalty if they mellowed and became more likable, with those moving from sort-of to really nice paying a higher price than complete jerks who mellowed into mere slimeballs. Source: “Do Nice Guys—and Gals—Really Finish Last? The Joint Effects of Sex and Agreeableness on Income,” by Timothy A. Judge, Beth A. Livingston, and Charlice Hurst, Journal of Personality and Social Psychology, 2012. Career Choices: You Can’t Win if You Don’t Play \nWhen management professors Matthew Bidwell of Wharton and Roxana Barbulescu of McGill surveyed the students who were beginning an elite one-year international MBA program, they found the women to be as confident as the men of getting a job offer upon graduation—in general management and consulting, but not in finance. That lack of confidence may explain why later surveys of the program’s participants showed that fewer women eventually applied for finance positions. However, the women who did apply were just as likely to get offers as the men. The researchers discovered that for MBAs, the playing field is completely level at the start, concluding: “We find no evidence that women are less likely to receive job offers in any of the fields studied.” Source: “Do Women Choose Different Jobs from Men? Mechanisms of Application Segregation in the Market for Managerial Workers,” by Roxana Barbulescu and Matthew Bidwell, Organization Science, 2012. Bias, Explicit: That Persistent Motherhood Penalty \nIn a classic discrimination experiment, sociology professors Shelley Correll, Stephen Benard, and In Paik asked college students to rate a pair of job applicants after examining information packets that included résumés, personal fact sheets, and notes from screening interviews. After establishing that the application materials presented the candidates as equally qualified, the researchers altered them to indicate that one applicant was a parent. When being considered for the same job, mothers were significantly less likely to be recommended for hire, and when they were, they were offered $11,000 less in starting salary, on average, than childless women. Fathers were not penalized at all. The raters, displaying a clear form of status-based discrimination, revealed that they assumed the mothers to be inherently less competent and less committed. \nStatus bias could be overcome, Correll and Benard found in a similar follow-up experiment, if the raters were given copies of a performance review showing that a mother had demonstrated a heroic level of commitment to a previous job (by, say, describing her as “one of the most productive employees our division has hired in recent memory”). When that was the case, mothers were not seen as significantly less competent and committed. However, female raters (though, interestingly, not the male ones) judged the mothers to be less likable than the fathers and the childless women, and this normative discrimination produced the same result—fewer offers, less money. \nSource: “Minimizing the Motherhood Penalty: What Works, What Doesn’t and Why?” by Shelley J. Correll, Gender & Work: Challenging Conventional Wisdom, Harvard Business School, 2013. Stacking the Deck: Unmerited Pay \nThe latest figures from the Bureau of Labor Statistics show that the largest gaps in wages between men and women are in sales. In insurance, for example, saleswomen make only 62.5% of what their male colleagues earn, in retail just 64.3%, and in real estate only 66%. This is surprising considering that sales pay has long been thought to be less political and more merit-based. But in a study of two large stockbrokerages, Wharton professor Janice Madden found that saleswomen earned less than salesmen because they’d been systematically given inferior accounts that generated smaller commissions and then denied support staff, mentors, and other amenities that would have helped them perform better, suggesting that outright discrimination can be disguised as merit pay. \nSource: “Performance-Support Bias and the Gender Pay Gap Among Stockbrokers,” by Janice Fanning Madden, Gender & Society, 2012. Bias, Implicit: BS at Work \nA host of research points to the insidious effect of benevolent sexism—the view that women are inherently in need of protection and special consideration—on women’s advancement. \nWhen George Mason psychology professor Eden King and five colleagues surveyed energy industry managers, for instance, the women reported receiving less criticism—but also less challenging developmental assignments—than their male counterparts. Similar results from a subsequent study the same team conducted with thousands of managers in England’s National Health Service suggest that rather than a mark of favor, less criticism was a sign of condescension. \nA trio of researchers—Monica Biernat of the University of Kansas, consultant M.J. Tocci, and Joan Williams of the Hastings College of the Law—found the same dynamic in their study of performance evaluations at a Wall Street law firm. The women received more positive comments (excellent! stellar! terrific!) than the men, but only 6% of the women (as opposed to 15% of the men) were mentioned as potential partner material, reflecting, the researchers concluded, the application of lower standards to the women and (self-fulfilling) lower expectations. \nSources: “Benevolent Sexism at Work: Gender Differences in the Distribution of Challenging Developmental Experiences,” by Eden B. King, Whitney Botsford, Michelle R. Hebl, Stephanie Kazama, Jeremy F. Dawson, and Andrew Perkins, Journal of Management, 2012. “The Language of Performance Evaluations: Gender-Based Shifts in Content and Consistency of Judgment,” by Monica Biernat, M.J. Tocci, and Joan C. Williams, Social Psychological & Personality Science, 2012. \nOffice Politics: Are the Best People Being Promoted? \nIn late 2011 consultants Jack Zenger and Joseph Folkman analyzed the 360-degree leadership-effectiveness evaluations of more than 7,280 executives, which had been filled out by their peers, bosses, and subordinates. The analysis revealed that at every management level, the women were rated higher than the men—and the higher the level, the wider the gap. At the same time, the data showed, the higher the level, the higher the proportion of men. \nNot only were the women judged to be superior in areas where women are traditionally thought to excel, such as developing others and building relationships, but their ratings were significantly higher, statistically speaking, on 12 of the 16 traits Zenger and Folkman had identified, in more than 30 years of research, as most important to overall leadership effectiveness. \n8 Current Visitors On This Page CRYPTOCURRENCY COMING TO COMMODITIES SOON Commodities are powered by Investing.com RECENT ARTICLES", "external_links": [], "published": "2015-10-11T16:03:00.000+03:00", "crawled": "2015-10-11T16:27:05.787+03:00", "highlightTitle": ""}