{"organizations": [], "uuid": "4992e73acf094ac6feb90549bb42ebb344b03ed6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.philly.com", "main_image": "http://media.philly.com/images/applefritter6.jpg", "site_section": "http://www.philly.com/philly_entertainment.rss", "section_title": "Philly.com Entertainment", "url": "http://www.philly.com/r?19=961&43=168041&44=334567361&32=3796&7=195357&40=http%3A%2F%2Fwww.philly.com%2Fphilly%2Fentertainment%2FTheStreet_20151020_Star_Wars_Trailer_Is_Out_--_Here_s_10_Weird_Items_to_Buy_for_Die-Hard_Fans.html", "country": "US", "title": "Local treats, drinks, and snacks inspired by apples", "performance_score": 0, "site": "philly.com", "participants_count": 1, "title_full": "Local treats, drinks, and snacks inspired by apples", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T21:01:00.000+03:00", "replies_count": 0, "uuid": "4992e73acf094ac6feb90549bb42ebb344b03ed6"}, "author": "Tim Reardon", "url": "http://www.philly.com/r?19=961&43=168041&44=334567361&32=3796&7=195357&40=http%3A%2F%2Fwww.philly.com%2Fphilly%2Fentertainment%2FTheStreet_20151020_Star_Wars_Trailer_Is_Out_--_Here_s_10_Weird_Items_to_Buy_for_Die-Hard_Fans.html", "ord_in_thread": 0, "title": "Local treats, drinks, and snacks inspired by apples", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Entertainment Local treats, drinks, and snacks inspired by apples When it's autumn, pumpkin spice seems to get the entire spotlight. But don't forget apples, a seasonal delight that can be drunk, infused, and eaten. Local treats, drinks, and snacks inspired by apples Beiler's at Reading Terminal Market, home of sublime apple fritters. Michael Klein / Philly.com Travel Deals Tim Reardon Posted: Tuesday, October 20, 2015, 2:00 PM \nWhen it’s autumn, pumpkin spice seems to get the entire spotlight. But don’t forget apples, a seasonal delight that can be drunk, infused, and eaten. \nHere's an “in-cider” look at some local products to enjoy. \nApple fritters from Beiler’s Bakery (51 N. 12th St.) Without a doubt one of Beiler’s best pastries, these warm, frosty, apple-stuffed treats are a perfect side with a hot coffee in the morning. Frecon Farms cider collection (501 S. Reading Ave.) Boyertown Whether it be a part of their Estate Series or their year-round offerings, this local cidery has quite the “hardcore” beverage selection. Some notable favorites to look out for are their New England Style Hoghead Dry and Crabby Granny, a cider that packs quite the punch. \nMagpie's caramel apple pie (1622 South St.) You can never go wrong with apple pie. Magpie’s fall caramel apple pie is great for a personal snack, as well as a surprise treat for visiting guests at your home (especially during Thanksgiving). Apple dumplings at the Dutch Eating Place (51 N 12th St.) If you’re at the Reading Terminal Market, you must try the apple dumplings. The treat is served warm and topped off with whipped heavy cream. Caramel apple pie shake at Franklin Fountain (116 Market St.) If you never treated yourself to a warm milkshake, autumn is the perfect time. Warm your taste buds with Franklin Fountain’sCaramel Apple Pie Shake that includes: apple pie, vanilla ice cream, and caramel. Caramel apples at Mueller’s (51 N. 12th St.) Staple autumn treat, Mueller’s caramel-covered apples are a great snack for adults and kids alike. Fun fact: If you’re the prankster of your friends, you can purchase a chocolate-covered onion disguised as an apple! Peeps caramel apple candy (Various locations) Treat your sweet tooth to this seasonal candy flavored like a Granny Smith apple, with caramel layering the bottom. Linvilla Orchards' apple butter spread (137 W. Knowlton Rd.) Media Need something to accompany your upcoming snack? This locally made apple butter will certainly be a great addition to bagels, biscuits, and even grilled cheese. \nChaddsford Winery spiced apple wine (623 Baltimore Pike) Chadds FordIf you’re having friends over for an autumn party, this apple-flavored wine is a perfect beverage to cheers with. It’s great heated up, too! \nFall Drinks at McGillin’s Old Ale House (1310 Drury St.) In autumn, this Irish Pub makes a great pumpkin martini , but they also serve hot cider spiked with Tullamore Dew and a sparkling beverage including Jim Bean Apple, club soda, and cranberry juice.", "external_links": [], "published": "2015-10-20T21:01:00.000+03:00", "crawled": "2015-10-20T21:22:49.243+03:00", "highlightTitle": ""}