{"organizations": [], "uuid": "3226c5820785f7738f28fe2fb1168c81fb00e369", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.digitalspy.co.uk", "main_image": "http://i1.cdnds.net/15/42/300x225/ustv-arrow-s04e02-still-05.jpg?1231668470", "site_section": "http://www.digitalspy.co.uk/rss/zones/gb/all.xml#", "section_title": "All - Digital Spy - Entertainment and Media News", "url": "http://www.digitalspy.co.uk/ustv/s206/arrow/news/a673574/arrow-villain-damien-darhk-is-going-to-cause-triple-the-trouble-on-the-flash-and-legends-of-tomorrow.html?rss", "country": "US", "title": "Arrow villain Damien Darhk is going to cause triple the trouble on The Flash and Legends of Tomorrow - Arrow Cult", "performance_score": 0, "site": "digitalspy.co.uk", "participants_count": 1, "title_full": "Arrow villain Damien Darhk is going to cause triple the trouble on The Flash and Legends of Tomorrow - Arrow News - Cult - Digital Spy", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "3226c5820785f7738f28fe2fb1168c81fb00e369"}, "author": "Justin Harp", "url": "http://www.digitalspy.co.uk/ustv/s206/arrow/news/a673574/arrow-villain-damien-darhk-is-going-to-cause-triple-the-trouble-on-the-flash-and-legends-of-tomorrow.html?rss", "ord_in_thread": 0, "title": "Arrow villain Damien Darhk is going to cause triple the trouble on The Flash and Legends of Tomorrow - Arrow Cult", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Arrow villain Damien Darhk is going to be causing a lot more trouble as he crosses over to The Flash and Legends of Tomorrow.Neal McDonough let slip at New York Comic-Con that the origins of his merciless HIVE leader will be mined in a Legends of Tomorrow episode that travels back 40 years. © The CW / Katie YuAlexander Calvert as Lonnie Machin and Neal McDonough as Damien Darhk \"I look exactly the same in 1975 but you see he's not as confident, and doesn't have such an agenda… as he does now,\" he told ComicBook.com.Damien Darhk has been set up as the former protégé of League of Assassins leader Ra's al Ghul, who is now hell bent on letting Star City destroy itself.In terms of his guest appearance on The Flash, McDonough teased: \"I'm just this crazy, fun, enjoy-everything-while-I-kill-everybody type of character.\" © YouTube / The CW Here are 9 exciting teasers for DC's superhero epic Legends of TomorrowDamien Darhk is the second major DC villain confirmed for Legends of Tomorrow, which will also heavily feature the immortal warlord Vandal Savage (Casper Crump).Legends of Tomorrow gathers Arrow and Flash heroes Atom, Firestorm, White Canary, Hawkman, Hawkgirl and even the villainous Rogues as a team tasked with saving humanity.The Flash airs on Tuesdays on The CW in the US, while Arrow continues on Wednesdays. Meanwhile, The CW premieres Legends of Tomorrow next year as part of its mid-season schedule.", "external_links": [], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-14T04:05:20.416+03:00", "highlightTitle": ""}