{"organizations": [], "uuid": "ad13d6ae348a345bedb4e303928ef46d58ef0d48", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "http://s1.reutersmedia.net/resources/r/?m=02&d=20151016&t=2&i=1087504970&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXNPEB9F0UA", "site_section": "http://www.reuters.com/news/entertainment", "section_title": "Entertainment Industry &amp; Celebrity News | Reuters.com", "url": "http://www.reuters.com/article/2015/10/16/us-television-homeland-idUSKCN0SA25020151016", "country": "US", "title": "Artists who made racist graffiti on Homeland seek changes", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Artists who made racist graffiti on Homeland seek changes | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T20:29:00.000+03:00", "replies_count": 0, "uuid": "ad13d6ae348a345bedb4e303928ef46d58ef0d48"}, "author": "Tina Bellon and Mostafa Salem", "url": "http://www.reuters.com/article/2015/10/16/us-television-homeland-idUSKCN0SA25020151016", "ord_in_thread": 0, "title": "Artists who made racist graffiti on Homeland seek changes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BERLIN/CAIRO The artists who produced Arabic graffiti seen in the latest episode of the TV series \"Homeland,\" which accuses the show of racism, said on Friday they were surprised at the impact of their protest but hoped it would get the producers to change their scripts.\nThe hit show is about U.S. intelligence efforts to thwart Middle East terrorism. In the episode aired in the United States last week, CIA agent Carrie Mathison walks through a Syrian refugee camp and past a wall daubed with graffiti - one of which declares, in Arabic: \"Homeland is racist\".\nOther scenes had walls covered with similarly pointed Arabic messages: \"There is no Homeland\", \"Homeland is not a show\" and \"Black lives matter\".\n\"It was a way to start a discussion,\" Heba Amin, one of the artists responsible, told Reuters in Cairo. \"You know, we were hoping that once this aired that somebody would pay attention to it, and we never anticipated that it would be so massive.\nThe sabotage of the set has become a worldwide story, picked up by major newspapers and media outlets across the globe.\n\"This is exactly, for us, what we wanted,\" Amin said. \"This is a huge success, and now we can have that discussion and people are talking about it.\"\nThe graffiti were planted by a trio of artists calling themselves the \"Arabian Street Artists\". They were hired to make walls on the outskirts of Berlin, where the show as filmed this summer, look like part of Lebanon. Nobody detected the meaning before the show aired on the Showtime network last Sunday.\nAlex Gansa, co-creator of \"Homeland\", said in a statement distributed by Showtime: \"We wish we'd caught these images before they made it to air.\"\nBut he added: \"As 'Homeland' always strives to be subversive in its own right and a stimulus for conversation, we can’t help but admire this act of artistic sabotage.\"\nThe artists said they were motivated by stereotypes and inaccuracies in the scripts used by the show's producers.\n\"Based on previous episodes, they had made many mistakes and it was clear that they didn't have a strong research team, and so I figured this was the opportunity to incorporate subversive graffiti,\" Amin told Reuters during the interview at her home in the Cairo district of Maadi.\n\"What we are trying to raise is that regardless whether or not the show is fiction, it still has very dangerous implications because they're basically stereotyping an enormous region of people.\"\nAmong the inaccuracies the three artists - Caram Kapp and Don Karl, in addition to Amin - point to in \"Homeland\" are episodes that portrayed Al Qaeda as being backed by Shiite Iran, when the group is Sunni-led.\nThe show, now in its fifth season, had run for so long that it was affecting viewers' perceptions of the Middle East, Kapp said an interview with Reuters at a cafe in Berlin's artist district, Neukoellnin.\n\"By doing this for a long time they are forming a certain opinion, a certain representation of this part of the world in their audience's mind,\" he said.\n\"I hope that what we did will lead the makers of the show to interact a bit more with the subject matter and maybe try to represent people in a more differentiated way,\" he said.\nClaire Danes has won two Emmys and two Golden Globes for her portrayal of Mathison, who struggles to do her job while afflicted with bi-polar disorder. But the show has been criticized for its inaccuracies and accused of stereotyping in its depiction of the Middle East and Islamic culture.\n(Reporting by Tina Bellon in Berlin, Mostafa Salem in Cairo and Michael Roddy in London; Writing by Michael Roddy; Editing by Larry King)", "external_links": [], "published": "2015-10-16T20:29:00.000+03:00", "crawled": "2015-10-16T20:26:45.061+03:00", "highlightTitle": ""}