{"organizations": ["Shelby Rotary Breakfast Club", "NC Brew Fest", "Rotary", "AA United Cab", "Cleveland County Chamber office", "Tour Cleveland County"], "uuid": "6a09865d532b8af38ca5966809646ec471b284a9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.gastongazette.com", "main_image": "http://www.gastongazette.com/storyimage/NC/20151004/NEWS/151009566/AR/0/AR-151009566.jpg", "site_section": "http://www.gastongazette.com/lifestyle/entertainment?template=rss&mime=xml", "section_title": "Entertainment - Gaston Gazette", "url": "http://www.gastongazette.com/article/20151004/NEWS/151009566/14893/LIFESTYLE?rssfeed=true", "country": "US", "title": "Brew Fest, Chili Cook Off to kick off festive weekend uptown", "performance_score": 0, "site": "gastongazette.com", "participants_count": 0, "title_full": "Brew Fest, Chili Cook Off to kick off festive weekend uptown", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T00:20:00.000+03:00", "replies_count": 0, "uuid": "6a09865d532b8af38ca5966809646ec471b284a9"}, "author": "", "url": "http://www.gastongazette.com/article/20151004/NEWS/151009566/14893/LIFESTYLE?rssfeed=true", "ord_in_thread": 0, "title": "Brew Fest, Chili Cook Off to kick off festive weekend uptown", "locations": ["S. Lafayette Street", "Cleveland County", "North Carolina", "Washington Street"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Brew Fest, Chili Cook Off to kick off festive weekend uptown Cleveland County is joining the beer-festival craze. This year, Tour Cleveland County will host the NC Brew Fest and the Shelby Rotary Breakfast Club is sponsoring a Chili Cook Off - all from 6:30 to 10 p.m. on Friday, Oct. 16 in uptown Shelby. Both will be held in conjunction with the Mush, Music and Mutts festival on Saturday, Oct. 17. Posted Oct. 4, 2015 at 4:00 PM Updated at 4:20 PM Posted Oct. 4, 2015 at 4:00 PM Updated at 4:20 PM Cleveland County is joining the beer-festival craze. This year, Tour Cleveland County will host the NC Brew Fest and the Shelby Rotary Breakfast Club is sponsoring a Chili Cook Off - all from 6:30 to 10 p.m. on Friday, Oct. 16 in uptown Shelby. Both will be held in conjunction with the Mush, Music and Mutts festival on Saturday, Oct. 17. About the beer fest The beer festival - and the chili cook off - will be held on Washington Street. You must be at least 21 to purchase tickets for the beer fest and a valid ID is required for admission. Cost is $35 in advance for a combined general admission sampling pass for the brew fest and chili cook off . Through Saturday afternoon, approximately 150 of the 500 tickets have been sold for the event. Tickets, if available, on Oct. 16 will cost $45 to attend both the brew fest and cook off. Cost is $25 in advance and $35 for a brew fest-only sampling pass. To purchase tickets in advance, go to www.mushmusicandmutts.com or stop by the Cleveland County Chamber office at 200 S. Lafayette Street from 8:30 a.m. to 5 p.m., Monday through Friday. The beer festival will bring in 11 breweries that are from North Carolina or use North Carolina products in their beer-making process. No outside food or beverage will be permitted. Cost includes a 14 oz. beer mug, but attendees will be served 4 oz. pours. S ome pours may be smaller due to alcohol volume. Beer selections are subject to availability and may change. Event staff reserves the right to refuse service to anyone at any time. AA United Cab will be on hand for anyone without a designated driver who needs safe transportation. Live music will be provided by Southern Experience. About the chili cook off The chili cook off is sponsored by Rotary and all proceeds will go to the Rotary Scholarship Fund. There are three categories - restaurant, open and livermush. To enter the restaurant category and serve from a vendor space, contestants need appropriate permits and vendor space needs to be approved by health inspectors. Restaurant contestants can give out samples from their establishments without permits if located around the Shelby court square. Cost is $10 to attend and sample. There is a $10 entry fee to be a cooking team and cash prizes will be awarded to the best chili voted on by judges. For the open and livermush categories, the prizes include $150 for first place, $100 for second place and $50 for third place. The restaurant category will be awarded first, second and third place trophies or plaques. Other awards will be: the spirit award - for the cooking team with the most creative booth, energy and personality - and the people’s choice award. This is a non-sanctioned chili cook‐off event. Page 2 of 2 - To register for the chili cook-off, visit clevelandcountychamber.org . Confirmed breweries:", "external_links": [], "published": "2015-10-05T00:20:00.000+03:00", "crawled": "2015-10-05T05:46:33.922+03:00", "highlightTitle": ""}