{"organizations": [], "uuid": "994cb0dee4e6866d1102966f87b03d7ac0eb3478", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nevadaappeal.com", "main_image": "http://www.NevadaAppeal.com/csp/mediapool/sites/dt.common.streams.StreamServer.cls?STREAMOID=59v5Oxi_z4fzTZUrFUR6ys$daE2N3K4ZzOUsqbU5sYuZF6Ut3eImJhotBe156_sZWCsjLu883Ygn4B49Lvm9bPe2QeMKQdVeZmXF$9l$4uCZ8QDXhaHEp3rvzXRJFdy0KqPHLoMevcTLo3h8xh70Y6N_U_CryOsw6FTOdKL_jpQ-&CONTENTTYPE=image/jpeg", "site_section": "http://www.nevadaappeal.com/csp/mediapool/sites/SwiftShared/assets/csp/rssCategoryFeed.csp?pub=NevadaAppeal&sectionId=654&sectionLabel=Entertainment", "section_title": "The Nevada Appeal Section RSS Feed: Entertainment", "url": "http://www.NevadaAppeal.com/entertainment/18561041-113/brian-shaw-pursuing-perfection-evolving-toward-a-healthier", "country": "US", "title": "Brian Shaw: Pursuing perfection: Evolving toward a healthier recipe", "performance_score": 0, "site": "nevadaappeal.com", "participants_count": 1, "title_full": "Brian Shaw: Pursuing perfection: Evolving toward a healthier recipe", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T10:51:00.000+03:00", "replies_count": 0, "uuid": "994cb0dee4e6866d1102966f87b03d7ac0eb3478"}, "author": "Adam Trumble", "url": "http://www.NevadaAppeal.com/entertainment/18561041-113/brian-shaw-pursuing-perfection-evolving-toward-a-healthier", "ord_in_thread": 0, "title": "Brian Shaw: Pursuing perfection: Evolving toward a healthier recipe", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Cathleen Allison/Nevada Appeal Cafe Del Rio's Brian Shaw « » Related Media My former employer up in Lake Tahoe and I used to have the same argument every time we put a new dish on the menu. He would contend the dish shouldn’t go on until it was perfected. And I would argue it would never be perfected until it was on the menu. There’s nothing like doing a dish 10, 20 or 30 times a night, night after night to dial it in. Even some of the items on our menu we have been doing for 15 years get tweaked now and then. And our nightly specials always evolve over the course of the evening. I don’t feel like we are doing our job if we aren’t trying to improve it a little every time we make it. Today’s recipe is a case in point. We started playing with a quinoa burger about five years ago, right after my doctor insisted I cut out all the foods I thought made the civilized world civilized — pizza, pastry, butter and cheese. The original recipe had eggs as a binder, oats as a filler, and a little cheese mixed in for richness. But it bothered me it didn’t work for vegans or people with problems with gluten. So, over time we realized you could replace the oats with textured vegetable protein which is gluten free and adds a good dose of protein. The eggs were replaced with flaxseed meal, satisfying the vegans and adding some significant omega 3s. As for the cheese, we left it out, opting to put a slice on if requested. There are some pecans in the burger for texture and a little flavor, but you could probably leave them out if you have issues with nuts. I do think it’s worth the effort to seek out red quinoa instead of the yellow or white variety. It’s a little harder to find, but it makes the burgers look remarkably like beef. Walmart sells a good one for the same price as the regular stuff. And don’t be put off by what looks like a lot of steps. It’s really easy to do each of the steps while you’re doing something else. Then once everything has been soaked, sautéed or processed, you just throw it together. The mix can sit in the refrigerator for a day or two if you don’t feel like baking it right away. It will be perfect. QUINOA VEGGIE BURGERS", "external_links": [], "published": "2015-10-14T10:51:00.000+03:00", "crawled": "2015-10-14T10:17:55.626+03:00", "highlightTitle": ""}