{"organizations": ["Internship Opportunities Aerosmith"], "uuid": "aed652aa59e178a6d41add5c5970e9868f130671", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wmcactionnews5.com", "main_image": "", "site_section": "http://www.wmctv.com/category/13540/news?clienttype=rss", "section_title": "WMC Action News 5 - Entertainment - Headline", "url": "http://www.wmcactionnews5.com/story/30235002/aerosmith-frontman-asks-trump-campaign-to-stop-using-song", "country": "US", "title": "Aerosmith frontman asks Trump campaign to stop using song", "performance_score": 0, "site": "wmcactionnews5.com", "participants_count": 0, "title_full": "Aerosmith frontman asks Trump campaign to stop using song", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T00:07:00.000+03:00", "replies_count": 0, "uuid": "aed652aa59e178a6d41add5c5970e9868f130671"}, "author": "", "url": "http://www.wmcactionnews5.com/story/30235002/aerosmith-frontman-asks-trump-campaign-to-stop-using-song", "ord_in_thread": 0, "title": "Aerosmith frontman asks Trump campaign to stop using song", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Trump"], "text": "Employment and Internship Opportunities Aerosmith frontman asks Trump campaign to stop using song \nLOS ANGELES (AP) - Aerosmith frontman Steven Tyler is asking Republican presidential candidate Donald Trump to stop using the power ballad \"Dream On\" at campaign events. \nAttorneys for Tyler sent a second cease-and-desist letter to Trump's campaign committee on Saturday. \nThe letter says that Trump does \"not have our client's permission to use 'Dream On'\" or any of Tyler's other songs and that it \"gives the false impression that he is connected with or endorses Mr. Trump's presidential bid.\" \nTyler, who is a registered Republican, attended the GOP contenders' first debate in August. \nAttorney Dina LaPolt said in a statement that the letter is not a \"political\" or \"personal issue with Mr. Trump,\" but it's one of permission and copyright. \nRepresentatives for Trump did not immediately respond to request for comment. Copyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. More cities are recognizing Native Americans on Columbus Day More cities are recognizing Native Americans on Columbus Day this year as they revive a movement to change the name of the holiday to celebrate the history and contributions of indigenous cultures around the country. More >> More cities are recognizing Native Americans on Columbus Day this year as they revive a movement to change the name of the holiday to celebrate the history and contributions of indigenous cultures around the country. More >> Updated: Sunday, October 11 2015 3:56 PM EDT 2015-10-11 19:56:23 GMT The directors of the Trump Ocean Club met July 28 on urgent business. They needed to fire Donald Trump. More >> The directors of the Trump Ocean Club met July 28 on urgent business. They needed to fire Donald Trump. More >> Updated: Sunday, October 11 2015 3:56 PM EDT 2015-10-11 19:56:02 GMT Prosecutors investigating the death of a 12-year-old black boy who was fatally shot by a white Cleveland police officer say they are just trying to be transparent in seeking and sharing outside reviews by experts... More >> The Cleveland police union and the local prosecutor remain at odds even after the prosecutor released expert reports calling the fatal shooting of a 12-year-old black boy by a white officer justified. More >> Michelle Obama celebrates International Day of the Girl Michelle Obama is grooving to the tunes of Beyonce, Demi Lovato and Esperanza Spalding as she celebrates the International Day of the Girl. More >> Michelle Obama is grooving to the tunes of Beyonce, Demi Lovato and Esperanza Spalding as she celebrates the International Day of the Girl. More >> Sleeping Idaho hunter wakes up to black bear biting his head A hunter camping in central Idaho woke up when a black bear started biting his head, and he couldn't get medical care for three days because he was in such a remote wilderness area. More >> A hunter asleep in the remote Idaho wilderness woke up when he felt something tugging on his hair. Then he heard the black bear breathing. More >>", "external_links": [], "published": "2015-10-12T00:07:00.000+03:00", "crawled": "2015-10-12T00:13:59.852+03:00", "highlightTitle": ""}