{"organizations": [], "uuid": "7af49e7b41e1751d368f4ac1d7cd4d2c89eac393", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48524/entertainment", "section_title": "Entertainment - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30196971/civis-analytics-launches-the-civis-media-optimizer-to-bring-the-precision-of-digital-to-tv-advertising", "country": "US", "title": "Civis Analytics Launches the Civis Media Optimizer to Bring the Precision of Digital to TV Advertising", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Civis Analytics Launches the Civis Media Optimizer to Bring the Precision of Digital to TV Advertising - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "7af49e7b41e1751d368f4ac1d7cd4d2c89eac393"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30196971/civis-analytics-launches-the-civis-media-optimizer-to-bring-the-precision-of-digital-to-tv-advertising", "ord_in_thread": 0, "title": "Civis Analytics Launches the Civis Media Optimizer to Bring the Precision of Digital to TV Advertising", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Civis Analytics\nReinventing TV Ad Planning with Data Science\nCHICAGO , Oct. 6, Civis Analytics, the data science technology company launched from the 2012 Obama Campaign, today announced Civis Media Optimizer , the first-of-its-kind ad planning software using data science to reinvent TV ad planning by bringing together the targeting precision seen in digital to the massive reach and scale of television.\nEven with the rise of digital, brands know TV is still the best way to build awareness and reach a large audience quickly. As a result, they'll spend almost $79B this year on TV ads in the U.S. alone. 1 Yet, the science of TV ad planning hasn't really changed in decades - we're in the era of 'big data', but TV ad planners are still forced to target imprecise demographic segments ('18-49 Women', 'Soccer Moms', etc.) that barely resemble their target customer audiences. According to Nielsen, 64 percent of a brand's TV advertising is served to households that account for only 2 percent of sales. 2 Nothing has changed, and marketers expect more.\nNow, with Civis Media Optimizer, advertisers can finally achieve the precision targeting of digital combined with the massive scale of television. We're working to improve the value of television advertising and the content behind it for TV networks and advertisers.\nIt works like this: the software ingests a list of individual-audience targets, combines that list with consumer viewing data sets from respondent panels and set-top boxes, and the platform's machine learning algorithms help marketers pick the exact TV inventory that will maximize reach and frequency for their budget. Fewer wasted impressions. Fewer wasted dollars. This is the first time that marketers can optimize their budget based on true, measurable knowledge of how many unique customers they reach and a throttle of how many times they want to see a specific message.\nUsing the Optimizer, planners can quickly and iteratively 'optimize' media buys for their budget. And since it's built on the Civis cloud-based data science platform, it can scale for any size firm, corporate marketer, startup, and more.\n\"TV advertising has been a black box since televisions were invented -- there has been no data-driven method for advertisers to know who their target customers are,\" said Eric Schmidt , Civis Analytics board member and executive chairman of Alphabet, Inc. \"With Civis Media Optimizer, Civis Analytics solves a problem that seemed impossible -- bringing data, precision, and accountability to the TV advertising industry.\"\nDiscovery Communications and GMMB are among the media companies and ad agencies using Civis Media Optimizer.\n\"Discovery is continuing to expand our data-driven decision making and growing our expertise in addressability to more effectively target key audiences,\" said David Leavy , Chief Communications Officer, Discovery Communications. \"By using Civis Media Optimizer we can create a closer connection to the consumer and bring precision marketing at scale in a way that best showcases our world-class content.\"\n\"Before 2012, politics was in a very similar situation to the one TV is in today,\" said Dan Wagner , CEO and Founder of Civis Analytics. \"During my time as the Chief Analytics Officer for the 2012 Obama Campaign, our premise, specifically as it applied to advertising, was to understand individuals based on data, and meet them where they were. We're applying the same strategies for TV advertisers to adapt their business for a data-driven future.\"\nCivis Media Optimizer is reinventing TV ad planning with data science. To learn more or to request a demo, please visit www.civisanalytics.com/products/media-optimizer .\nAbout Civis Analytics\nCivis Analytics makes data-driven strategy possible for all organizations. Founded in 2013, Civis Analytics was born out of President Obama's reelection campaign in 2012. Today, Civis assists a fast-growing and diverse group of both public and private sector clients. Its data analytics products and services are deployed with corporations in industries including retail, energy, entertainment, healthcare, as well as with major non-profits, political campaigns, and advocacy groups.\nMore information can be found at www.civisanalytics.com , by following @CivisAnalytics on Twitter, and by liking us on Facebook .\n1 http://techcrunch.com/2015/01/20/2015-ad-spend-rises-to-187b-digital-inches-closer-to-one-third-of-it/\n2 http://www.ncsolutions.com/television/demographic-media-plans-inefficient-cpg-brands/\nLogo - http://photos.prnewswire.com/prnh/20150709/234457LOGO\n releases/civis-analytics-launches-the-civis-media-optimizer-to-bring-the-precision-of-digital-to-tv-advertising-300154782.html\n ", "external_links": ["https://www.facebook.com/CivisAnalytics", "http://www.xmlnews.org/ns/", "http://www.prnewswire.com/news-releases/civis-analytics-launches-the-civis-media-optimizer-to-bring-the-precision-of-digital-to-tv-advertising-300154782.html", "http://www.ncsolutions.com/television/demographic-media-plans-inefficient-cpg-brands/", "http://photos.prnewswire.com/prnvar/20150709/234457LOGO", "https://civisanalytics.com/", "http://www.civisanalytics.com/products/media-optimizer", "http://www.civisanalytics.com/", "http://photos.prnewswire.com/prnh/20150709/234457LOGO", "https://twitter.com/CivisAnalytics", "http://techcrunch.com/2015/01/20/2015-ad-spend-rises-to-187b-digital-inches-closer-to-one-third-of-it/", "http://rt.prnewswire.com/rt.gif?NewsItemId=CG20572&Transmission_Id=201510061030PR_NEWS_USPR_____CG20572&DateId=20151006"], "published": "2015-10-06T03:00:00.000+03:00", "crawled": "2015-10-06T17:48:10.991+03:00", "highlightTitle": ""}