{"organizations": [], "uuid": "4f8388868aa1df7054932dff43e2076dcc08453e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prnewswire.com", "main_image": "https://photos.prnewswire.com/prnvar/20151005/274238", "site_section": "http://rss.prnewswire.com/industry/entertainment/", "section_title": "PR Newswire: Entertainment & Media", "url": "http://www.prnewswire.com/news-releases/back-to-the-future-music-from-the-motion-picture-soundtrack-marks-historic-films-30th-anniversary-with-two-sided-vinyl-picture-disc-on-october-21-300154701.html", "country": "IT", "title": "Back to the Future: Music from the Motion Picture Soundtrac", "performance_score": 0, "site": "prnewswire.com", "participants_count": 1, "title_full": "Back to the Future: Music from the Motion Picture Soundtrac", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T16:40:00.000+03:00", "replies_count": 0, "uuid": "4f8388868aa1df7054932dff43e2076dcc08453e"}, "author": "Universal Music Enterprises", "url": "http://www.prnewswire.com/news-releases/back-to-the-future-music-from-the-motion-picture-soundtrack-marks-historic-films-30th-anniversary-with-two-sided-vinyl-picture-disc-on-october-21-300154701.html", "ord_in_thread": 0, "title": "Back to the Future: Music from the Motion Picture Soundtrac", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES     Thirty years after the release of Robert Zemeckis' beloved time-travel feature film, Back to the Future , we still don't have hover skateboards nor DeLorean's for that matter, but the Chicago Cubs may be on the verge of a World Series for the first time since 1908.  Perhaps the best news of all, a 30 th anniversary reissue of the original Back to the Future: Music from the Motion Picture soundtrack will be reissued as a special, double-vinyl picture disc by Universal Music Enterprises (UMe) on October 21.  The image on Side A is a recreation of the original album cover, while Side B sports a view of the digital clock ticking inside Doc Brown's time-tripping DeLorean, with the meter set at the current release date, making this a valued collector's item. The original Back to the Future album, which came out July 8, 1985 right after the movie hit theaters on July 3 , was a hit, spending a total of 19 weeks on the Billboard 200, peaking at #12, in October, producing Huey Lewis and the News' first chart-topping single, the RIAA-certified gold single, \"The Power of Love,\" nominated for an Academy Award for Best Original Song.  Lewis also contributed \"Back in Time\" to the soundtrack (and appeared as a judge during the battle of the bands contest which featured McFly's rock group). The album – appropriately highlighting songs both from the '50s and '80s -- also features such artists such as Lindsey Buckingham (\"Time Bomb Town\"), Eric Clapton (\"Heaven is One Step Away\") and Etta James (\"The Wallflower [Dance With Me Henry]\").  There were also a pair of tracks featuring Alan Silvestri's score, credited to the Outtatime Orchestra, two '50s classics credited to the fictional Marvin Berry (played by Harry Waters, Jr. , who did the vocals) and the Starlighters (\"Night Train,\" \"Earth Angel [Won't You Be Mine]\") and Michael J. Fox's character Marty McFly and the Starlighters' memorable \"just too darn loud\" version of Chuck Berry's \" Johnny B. Goode ,\" though it was actually sung on the soundtrack by Mark Campbell . If you recall, McFly and his cohorts played the song back in 1955, three years before Berry even wrote it.\nThe album's most memorable song, of course, is Huey Lewis and the News' \"The Power of Love,\" which appears during the film's early moments as Fox's Marty McFly skateboards to school. Later in the movie, McFly and his band play a hard rock version of the song in a Battle of the Bands, only to be told off by Lewis himself as a judge that it's \"just too darn loud.\"  The MTV video at the time featured the band playing in a night club with Christopher Lloyd's Doc Brown , who shows up in his DeLorean, which is then stolen by a couple who take it for a joy ride. The single topped the Billboard Hot 100 and Top Rock Tracks chart, peaking at #6 at Adult Contemporary, and also hit #1 in Australia and Canada , Top 5 in Ireland , New Zealand and South Africa and Top 10 in the U.K.  \"Back in Time,\" though never officially released as a single, went to #3 on Billboard's Album Rock Tracks chart with a Bob Clearmountain mixed version.\nAdditionally, Universal Pictures Home Entertainment is celebrating the arrival of the future on October 21, 2015 with the Back to the Future 30 th Anniversary Trilogy on Blu-ray and DVD featuring new bonus material including an original short starring Christopher Lloyd as Doc Brown . Plus, Back to the Future II will be back on the big screen for one night only on October 21, 2015 – the epic date that Marty and Doc travel to in the second film. For more information, please visit www.BackToTheFuture.com . #BTTF2015.\nPhoto - http://photos.prnewswire.com/prnh/20151005/274238 \n \n\nSOURCE Universal Music Enterprises", "external_links": [], "published": "2015-10-06T16:40:00.000+03:00", "crawled": "2015-10-06T16:53:54.999+03:00", "highlightTitle": ""}