{"organizations": [], "uuid": "cac4b1e487dc1d08debe2d65336e066c84b5d1df", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailyherald.com", "main_image": "http://www.dailyherald.com/gfx/site/logos/dailyherald_marble_300.jpg", "site_section": "http://www.dailyherald.com/rss/feed/?feed=entlife", "section_title": "DailyHerald.com &gt; Life &amp; Entertainment", "url": "http://www.dailyherald.com/article/20151011/entlife/151019994/", "country": "US", "title": "Make sure telling secret is not just in your best intrest", "performance_score": 0, "site": "dailyherald.com", "participants_count": 1, "title_full": "Make sure telling secret is not just in your best intrest - DailyHerald.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T14:00:00.000+03:00", "replies_count": 0, "uuid": "cac4b1e487dc1d08debe2d65336e066c84b5d1df"}, "author": "Carolyn Hax", "url": "http://www.dailyherald.com/article/20151011/entlife/151019994/", "ord_in_thread": 0, "title": "Make sure telling secret is not just in your best intrest", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Q. My brother (mid-60s) and his wife separated nearly three years ago and made the decision not to tell our then-89-year-old mom, reasoning it was to protect her. Mom is strong, realistic, very intuitive, resourceful, and -- although she sees that side of the family weekly -- lives independently and isn't close to them or attached to an idea of them. My brother is an unfeeling narcissist.\nNow the couple are formally divorcing. The tension around this lie that everyone, including my sister and me, has cooperated with, and the general unhappiness between the couple that has to be tolerated at all family occasions, finally feels selfish and pointless to endure. My sister and I are considering spilling the beans by saying they are living apart (without specifics). Brother will be enraged, but there's no talking to him, about anything actually, and we're sick of the charade. Any thoughts?\nA. Normally in these situations I advise warning someone you're through keeping a secret -- that you won't volunteer information but will tell the truth when asked. Giving people the chance to deliver their own news before you presume to do it for them is simple decency.\nYour mother's age and brother's volatility, though, warrant flexibility. If you two reasonably conclude that your mom is better off hearing the news from one of you -- i.e., it's not just better for you -- then one of you talks to Mom pre-emptively when the divorce is official. Then you brace for the fraternal tirade. \"I agreed to conceal a separation, because the outcome was in doubt,\" you can say, \"but not a divorce.\"\nBefore you spill Bean 1, though, please be as sure as possible that disclosure is in Mom's best interests. I tend to conclude reflexively that it is, but individual families, feelings and fallout are best gauged by the people who know them best. Good luck.\nQ. We are three gals who are close friends with \"Jane.\" Jane has recently completed a gourmet cooking class and wants to show off her new skills by cooking us all dinner at her place -- which is really sweet. The problem is, her two cats climb on the furniture, dig in the flowerpots, climb up on the toilet seat, paw and claw through the contents of the litter box and then walk all over the kitchen counters, the cutting boards, the food-prep island and the kitchen table, even when Jane's family is eating.\nJane knows this is not hygienic, but it doesn't bother her family -- they think it is adorable. As for us, the \"ick-factor\" turns our stomachs and leaves us unwilling to eat a meal at Jane's house.\nShe is hypersensitive when it comes to her \"darlings.\" If we tell the truth, our friendship will never be the same. If we all find excuses to beg off, it will break her heart. We can't stall much longer; Jane is trying to pin down a date. We love her and she has always unconditionally put up with our quirks and \"blind spots.\" What should we do?\nA. Put up with her quirky blind spot and accept her invitation, unless one of you is immune-compromised.\nIt's either that or admit to Jane you're very, very sorry you can't abide the cats.\nFor the record, it's situations like this that have cemented in me a deep loathing of defensiveness, especially among intimates. If you can't say what you really feel to a friend without fear of triggering a meltdown, then you can't conduct the essential business of that friendship.\nAnd really -- if discomfort with cats that pinball from litterbox to tabletop is a shocking disclosure, then what exactly qualifies as normal? Especially when there's such a simple answer Jane can give: \"Understandable! I forget sometimes that not everyone is a cat person.\"\nAlas, the reality you're forced to work with includes Jane's defensiveness -- and pinballing cats and gag reflexes and valued friendships and Jane's persistence despite, apparently, your prodigious dodging.\nThese leave you these options: Tell Jane the truth; lie to Jane (i.e. conjure a binding, blanket excuse like an allergy); contrive ways around Jane's kitchen and let her imagination come up with even worse reasons you're avoiding her; or eat the blasted dinner.\nLies and stalling are low roads masquerading as courtesy. If Jane were my friend, I'd take my serving of Chicken a la Fluffy and thank her for it. It's what you do for people you love. It's why I ate roughly a cat's worth of sheddings over the course of my childhood, served by my pet-indulgent grandma.\nIf it makes you feel better, Google \"fecal bacteria\" and cellphones, toothbrushes, beards, or the kitchen sponges we use to kid ourselves that our prep surfaces are \"hygienic.\" Ick is inescapable. True friends, on the other hand, don't grow on sinks.\n• Email Carolyn at tellme@washpost.com, or chat with her online at 11 a.m. each Friday at www.washingtonpost.com.\n Life & Entertainment Hax, Carolyn Lifestyle", "external_links": ["https://twitter.com/share"], "published": "2015-10-11T14:00:00.000+03:00", "crawled": "2015-10-11T20:31:55.115+03:00", "highlightTitle": ""}