{"organizations": [], "uuid": "2043eb707e4a23e69024e7d6e846332d805a69c3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "entertainment.ie", "main_image": "http://images.entertainment.ie/images_content/rectangle/620x372/guinness-cork-jazz-festival.jpg", "site_section": "http://entertainment.ie/life", "section_title": "Life photo galleries premieres interviews videos rumours news stories - entertainment.ie ", "url": "http://entertainment.ie/music/news/8-exciting-and-eclectic-acts-to-catch-at-this-years-Guinness-Cork-Jazz-Festival/371510.htm", "country": "IE", "title": "MusicNews | 8 exciting and eclectic acts to catch at this year's Guinness Cork Jazz Festival", "performance_score": 0, "site": "entertainment.ie", "participants_count": 1, "title_full": "MusicNews | 8 exciting and eclectic acts to catch at this year's Guinness Cork Jazz Festival - entertainment.ie", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T19:12:00.000+03:00", "replies_count": 0, "uuid": "2043eb707e4a23e69024e7d6e846332d805a69c3"}, "author": "entertainment.ie", "url": "http://entertainment.ie/music/news/8-exciting-and-eclectic-acts-to-catch-at-this-years-Guinness-Cork-Jazz-Festival/371510.htm", "ord_in_thread": 0, "title": "MusicNews | 8 exciting and eclectic acts to catch at this year's Guinness Cork Jazz Festival", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Anyone who's been to the Guinness Cork Jazz Festival in the past will be well aware not to be fooled by the title.\nAlthough the Leedside festival is Ireland's biggest and most celebrated jazz event – and has been since 1978, where it took roots in the city's Metropole Hotel – it is the eclectic line-up encompassing multiple genres that has given it longevity and continues to make it an ongoing success.\nThis year is no different. As always, there are some world-class jazz musicians on the 2015 programme – but there are also some well-known names from other categories that you may not be expecting. To help you decide how to best spend your time from October 22nd – 26th , we've narrowed down 8 of the best acts playing this year – and why you should make a point of seeing them.\n1) GARY NUMAN – Sunday 25th, Cork Opera House\nThe word 'pioneer' is unnecessarily (and incorrectly) bandied about a lot when it comes to music, but from his time spent fronting Tubeway Army in the late 1970s right through the 1980s and 1990s, Gary Numan was a forerunner in bringing electronic music to the masses. He's best known for his songs ' Cars' and 'Are Friends Electric?' , but it's his blend of rock music and synthesized effects – ten-a-penny these days, but innovative in the early 1980s - that have seen him held in high regard.\nWhy should you see him? Every music fan should hear 'Cars' played live at least once, and because everyone from Trent Reznor to Dave Grohl to Marilyn Manson have described him as an influence.\n**\n2) THE BOOMTOWN RATS – Thursday 22nd, Cork Opera House\nYeah, yeah, we know. Sir Bob is getting on, as we all are – but having recently reunited with his old muckers The Boomtown Rats in 2013, he seems to have found a new lease of life. The Dubliners' heyday was the late 1970s and early 1980s, when their blistering new wave tunes made them hugely successful. Geldof is best-known for two things: 'Live Aid' and 'I Don't Like Mondays ' – but there is more to the Rats than that tune, as their still-brilliant 1978 album 'A Tonic for the Troops' attests to.\nWhy should you see them? Everyone enjoys a little nostalgia trip every now and again, but you might be surprised by the energy generated by these old geezers. (We jest, we jest).\n**\n3) BLACKALICIOUS – Saturday 24th, The Pav\nSee? Told you this line-up was eclectic. Where else could you see this American hip-hop duo on the same programme as The Drifters, Jack L and the Phil Ware Trio ? Rapper Gift of Gab and DJ/producer Chief Xcel first formed in California in 1992, releasing their debut ' Nia ' in 2000. You might be more familiar with 2002's ' Blazing Arrow', which saw them work alongside the likes of Gil Scott-Heron, Questlove, DJ Shadow and members of Jurassic 5.\nWhy should you see them? Because they don't play Ireland often and their brand of 'indie/alternative hip-hop' offers something a little different from the norm. And duh - any chance to see the incredible ' Alphabet Aerobics' live is one that should be grabbed with both hands.\n**\n4) GREG WILSON - Friday 23rd, The Savoy\nIf you're into British electronic music in a big way – particular Manchester/the north in the 1980s – you'll know who Greg Wilson is. If not, you should make a point of seeing him, anyway. Growing up, the DJ was hugely influenced by an eclectic mix of black music like soul, funk and disco – and that sound still features heavily in his sets today.\nWhy should you see him? He was a resident at the legendary Wigan Pier in the early 1980s and he's the man who taught Fatboy Slim how to scratch. This set will be like a music history lesson.\n**\n5) MARCUS MILLER/PETER KING & URBAN JAZZ (Double bill) – Saturday 24th, The Everyman\nOne of the best things about the Guinness Cork Jazz Festival is its proliferation of double bills. It gives the audience a chance to see an act that they know and love (or two acts they know and love, if they're lucky) as well as potentially turning them on to something new. This bill, featuring American jazz bassist and composer Marcus Miller – a man who has worked with all the greats, including Miles Davis, Herbie Hancock, Bill Withers, Dr. John and many more – and English jazz saxophonist Peter King is the perfect example. King will be playing with backing band Urban Jazz , and it's sure to be a treat.\nWhy should you see them? At 75, King is regarded as one of the best alto saxophonists in the world, while Miller's vast experience, multi-instrumentalism and back catalogue will undoubtedly make for a thrilling mix.\n**\n6) COLIN STETSON & SARAH NEUFELD – Friday 23rd, Triskel Christchurch\nYou may already be aware of this pair, especially if you're a fan of American indie/folk/rock music. Stetson is a touring member of Bon Iver and Arcade Fire and has played on albums by Feist, TV on the Radio and more, playing saxophone, French horn, flute, clarinet and more. Violinist Neufeld is a solo musician in her own right, but also tours with Arcade Fire.\nWhy should you see them? Together, their talents and instruments combined (as heard on their collaborative album ' Never Were the Way She Was ', released earlier this year), this could be a special show.\n**\n7) DARIUS BRUBECK QUARTET/STACEY KENT (double bill)– Sunday 25th, The Everyman\nIf the name sounds familiar, you're correct: Darius is the son of jazz legend Dave Brubeck and is continuing his father's incredible legacy. The 68-year-old has spent much time in teaching roles in South Africa and has worked with many musicians there over the years, as well as playing with his brothers - but the American pianist's own material, as played with the quartet he founded in 2006, is worth savouring. He'll play on a double bill with platinum-selling jazz vocalist Stacey Kent , who has been described as 'straight out of the Billie Holiday mould'.\nWhy should you see them? With Brubeck, it's a chance to see a slice of jazz history; the platinum-selling Kent, meanwhile, has sold out gigs on all five continents. 'Nuff said.\n**\n8) WYVERN LINGO - Thursday 22nd, Cyprus Avenue\nWe've harped on quite a bit about Wyvern Lingo over the past while, but it's only because we think you really, really, really ought to listen to them. We're suckers for harmonies, and this relatively new Bray trio nail 'em on their small-but-perfectly-formed collection of songs. They're not quite folk, they're not quite indie, they're not quite pop, yet they're not quick rock. Whatever they are, we're having it.\nWhy should you see them? Because there's every chance that they could blow up internationally next year, when they hopefully release their debut album. In any case, you'll enjoy what they bring to the table.\n**\nFurther information on tickets and the programme can be found at guinnesscorkjazz.com .\nEnjoy Guinness responsibly.\nMORE: Gary Numan, The Drifters, Boomtown Rats & more head up Guinness Cork Jazz Festival bill\nMORE: Listen: Bray folk-pop trio Wyvern Lingo share rocky new single 'Subside' - hear it now\nMORE: The Boomtown Rats announce gig at Dublin's Olympia Theatre in December", "external_links": ["https://www.youtube.com/embed/npeENXmnL0w", "https://www.youtube.com/embed/99fRdfVIOr4", "https://www.youtube.com/embed/rFUVLGqsgts", "http://www.guinnessjazzfestival.com/", "https://www.youtube.com/embed/rJ02zCMoxCo", "https://www.youtube.com/embed/XqTCAZK9rzY", "https://www.youtube.com/embed/MvPnM2Q1nwU", "https://www.youtube.com/embed/Ex2EqRkbvGQ", "https://www.youtube.com/embed/DHPEGQvHffI"], "published": "2015-10-20T19:12:00.000+03:00", "crawled": "2015-10-21T00:27:30.848+03:00", "highlightTitle": ""}