{"organizations": ["Eisenhower Medical Center", "AP"], "uuid": "8364d2337211cb255a7c1bdd841be5238557e657", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wpxi.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/10/23/04/00/07c3d50eb477403887643df2d14a6f6f-fce305ef06b34f65a376a46bbc035440-0.jpg", "site_section": "http://www.wpxi.com/feeds/categories/entertainment/", "section_title": "News | Entertainment", "url": "http://www.wpxi.com/ap/ap/top-news/arnold-klein-dermatologist-to-the-stars-dies-in-ca/nn8P3/", "country": "US", "title": "Arnold Klein, dermatologist to the stars, dies in California", "performance_score": 0, "site": "wpxi.com", "participants_count": 0, "title_full": "Arnold Klein, dermatologist to the stars, dies in California", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T21:07:00.000+03:00", "replies_count": 0, "uuid": "8364d2337211cb255a7c1bdd841be5238557e657"}, "author": "", "url": "http://www.wpxi.com/ap/ap/top-news/arnold-klein-dermatologist-to-the-stars-dies-in-ca/nn8P3/", "ord_in_thread": 0, "title": "Arnold Klein, dermatologist to the stars, dies in California", "locations": ["California", "Palm Springs", "Beverly Hills", "Calif", "Sayles"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Arnold Klein", "Michael Jackson", "Klein"], "text": "Updated: 2:07 p.m. Friday, Oct. 23, 2015 | Posted: 2:07 p.m. Friday, Oct. 23, 2015 Arnold Klein, dermatologist to the stars, dies in California Related View Larger FILE - In this Sept. 22, 2011 file photo, dermatologist Arnold Klein poses for a portrait in his office in Beverly Hills, Calif. Klein, dermatologist to the late Michael Jackson and other Hollywood celebrities, has died in Palm Springs, California. The Riverside County sheriff-coroner's office says the 70-year-old Klein died Thursday evening, Oct. 22, 2015, at Eisenhower Medical Center. (AP Photo/Matt Sayles,File) View Larger FILE - In this Sept. 22, 2011 file photo, dermatologist Arnold Klein poses for a portrait in his office in Beverly Hills, Calif. Klein, dermatologist to the late Michael Jackson and other Hollywood celebrities, has died in Palm Springs, California. The Riverside County sheriff-coroner's office says the 70-year-old Klein died Thursday evening, Oct. 22, 2015, at Eisenhower Medical Center. (AP Photo/Matt Sayles,File) Sponsored Links The Associated Press LOS ANGELES — \nDr. Arnold Klein, dermatologist to the late Michael Jackson and other Hollywood celebrities, has died. He was 70. \nKlein, 70, died Thursday at Eisenhower Medical Center in Rancho Mirage near Palm Springs, according to the Riverside County coroner's office. The brief press release did not state the cause of death and did not indicate any investigation was underway. \nTelephone messages seeking comment were left at listings for Klein's office, a former attorney and the hospital. \nKlein's roster of patients once included Elizabeth Taylor, Dolly Parton, Carrie Fisher and other celebrities. The Beverly Hills dermatologist's specialty was the use of injectable drugs such as Botox to ease wrinkles and sagging skin. \n\"Put me next to a patient, give me a needle and I'm really happy,\" he said in a 2011 interview with The Associated Press. \nKlein, who called Jackson \"my best friend,\" treated him for more than 25 years before the pop star's drug-related death in 2009. \nDebbie Rowe, a nurse who worked for Klein, married Jackson and had two of the singer's three children, Prince and Paris, before the couple divorced. The doctor dismissed media reports alleging that he fathered the children through a sperm donation. \nWhen Jackson died, federal drug agents investigating the singer's prescriptions cleared Klein. \nAnother doctor, Conrad Murray, was charged and convicted of involuntary manslaughter. Murray's defense sought to involve Klein in the trial, claiming that he contributed to Jackson's addiction to a medication, Demerol, which was not found in the singer's body. \nKlein's attorney denied that Jackson was addicted to Demerol used for pain relief during medical procedures. The judge ruled that Klein's testimony would not be relevant to the case. \nAt the time, Klein said Internet chatter about him was hurtful. \n\"All I'm trying to do is be the best doctor I can,\" he said. \nAsked if he could have done something to save Jackson, Klein said he did not know. \n\"This tragedy is an example of how the rich and famous can get terrible medical care. It repeats itself and repeats itself. When people get famous, they get all the 'yes people' around them,\" he said. \n___ \nAP Entertainment Writer Lynn Elber contributed to this report. Copyright The Associated Press Sign up for our WPXI-TV Daily Headlines Newsletter Sign Up", "external_links": [], "published": "2015-10-23T21:07:00.000+03:00", "crawled": "2015-10-23T21:32:52.462+03:00", "highlightTitle": ""}