{"organizations": [], "uuid": "ee3585e8cca19d0bee40f9784e50c6e296136012", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegram.com", "main_image": "http://www.telegram.com/storyimage/WT/20151012/ENTERTAINMENTLIFE/151019930/AR/0/AR-151019930.jpg&MaxW=1200&MaxH=630", "site_section": "http://www.telegram.com/living/entertainment", "section_title": "Entertainment - telegram.com - Worcester, MA", "url": "http://www.telegram.com/article/20151012/ENTERTAINMENTLIFE/151019930/101397", "country": "US", "title": "Al Roker to headline Weather Channel's digital show - Entertainment & Life", "performance_score": 0, "site": "telegram.com", "participants_count": 1, "title_full": "Al Roker to headline Weather Channel's digital show - Entertainment & Life - telegram.com - Worcester, MA", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "ee3585e8cca19d0bee40f9784e50c6e296136012"}, "author": "David Bauder The Associated Press", "url": "http://www.telegram.com/article/20151012/ENTERTAINMENTLIFE/151019930/101397", "ord_in_thread": 0, "title": "Al Roker to headline Weather Channel's digital show - Entertainment & Life", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK — After The Weather Channel canceled his morning show, Al Roker is coming back on a much smaller screen. He's the headliner for \"The Lift,\" a digital offering that could have intriguing implications for television programs. It will launch on Oct. 15, available on the network's free mobile app on weekdays between 6 and 11 a.m. Each day's program will include six minutes of weather news, science and nature stories, fun videos and eventually local forecasts tailored to the mobile device owner (development of the local forecast technology won't be ready for the launch). \"The Lift\" comes a few weeks after The Weather Channel axed the two-hour morning show, \"Wake Up with Al,\" that Roker had hosted. \"Was I sad to see 'Wake Up with Al' go?\" Roker asked. \"Absolutely. But it was a better opportunity to utilize my time. Two hours is two hours, and this is a considerably shorter show.\" The Weather Channel cited research from eMarketer that 65 percent of smartphone users in the U.S. check their devices within 15 minutes of waking up. The morning is also the network's busiest time of day as viewers check to see what their day will be like. Mobile users will see a link to \"The Lift\" when they open their Weather Channel app. They will be able to watch it as a six-minute show or in individual segments 40 to 60 seconds long. Roker said he can see \"The Lift\" being a model for other information-based television shows or networks as a way to augment their reach.\n\"Other programmers will migrate to that model before long,\" he said. The show will primarily be produced out of a newly-built Atlanta studio, with Roker filming his contributions from New York or elsewhere when he's sent on location by the \"Today\" show. Meteorologists Domenica Davis and Ari Sarsalari will also be featured on \"The Lift.\" \"It's like the difference between having a sit-down breakfast or a good grab-and-go,\" Roker said.", "external_links": [], "published": "2015-10-12T03:00:00.000+03:00", "crawled": "2015-10-12T10:35:23.482+03:00", "highlightTitle": ""}