{"organizations": [], "uuid": "9b5d177e4e0e71247d1e563c2e03e59752badae6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prnewswire.com", "main_image": "http://content.prnewswire.com/designimages/logo-prn-01_PRN.gif", "site_section": "http://rss.prnewswire.com/industry/entertainment/", "section_title": "PR Newswire: Entertainment & Media", "url": "http://www.prnewswire.com/news-releases/olegario-vazquez-aldirs-cadenatres-will-change-the-tv-industry-in-mexico-and-latin-america-according-to-media-expert-300161096.html", "country": "IT", "title": "Olegario Vazquez Aldir's 'CadenaTres' will change the TV In", "performance_score": 0, "site": "prnewswire.com", "participants_count": 1, "title_full": "Olegario Vazquez Aldir's 'CadenaTres' will change the TV In", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T15:24:00.000+03:00", "replies_count": 0, "uuid": "9b5d177e4e0e71247d1e563c2e03e59752badae6"}, "author": "Cadena Tres", "url": "http://www.prnewswire.com/news-releases/olegario-vazquez-aldirs-cadenatres-will-change-the-tv-industry-in-mexico-and-latin-america-according-to-media-expert-300161096.html", "ord_in_thread": 0, "title": "Olegario Vazquez Aldir's 'CadenaTres' will change the TV In", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BOCA RATON, Fla. , Oct. 16, 2015 /PRNewswire/ -- Gilberto Lozano,  associate of Estrategia de Ernest & Young, predicts it won't be the big TV chains like Mexico's Televisa or TV Azteca that will generate the most valuable content or attract the most advertising support in Mexico .   Lozano believes smaller TV chains like Olegario Vazquez Aldir's \"Cadena Tres\" will be more successful in attracting bigger audiences and therefore is destined to become Mexico's major TV media. \nEven though digital media in Mexico covers about one-fifth of corporate marketing budget, TV is still queen with a 61% of the total budget being allocated to traditional broadcasting media (TV, radio and print publications), according to experts who monitor media in Mexico .\nCNN Expansion announced during its special program \"Las futuras 500 Expansion en Telecomunicaciones,\" that Vazquez Aldir's Cadena Tres is one of the most promising and unique propositions within Mexico's telecommunications sector. \nCNN Expansion underscores that Cadena Tres has a bright future and can position itself as one of Latin America's leading broadcasting companies thanks to hard work, passion, long-term vision and unique programming that it will bring to the Mexican territory.\nAccording to the experts, the firm which operates Cadena Tres will have great success in attracting and obtaining significant advertising dollars due to its particular programming, including include soap operas, news, special transmission of \"Gallos Blancos de Queretaro \" soccer games, and children's programs.\nCadena Tres, directed by Ignacio Anaya Cooley , forms part of Grupo Empresarial Angeles. Grupo Imagen Multimedia, a media company made up of several radio stations, a cable channel and a national newspaper is also part of Grupo Empresarial Angeles along with Grupo Real Turismo; one of Latin America's leading hotel chains, a hospital network; Hospitales Angeles, the financial group Grupo Financiero Multiva and the most recent acquisition, Club de Futbol Gallos Blancos de Queretaro . \nAll of these excellent enterprises are on the rise under Aldir's unique entrepreneurial vision. \nMedia contact, Gabriela Vega 561-750-9800 x2160; gabriela@transmediagroup.com . \n\nSOURCE Cadena Tres", "external_links": [], "published": "2015-10-16T15:24:00.000+03:00", "crawled": "2015-10-16T15:37:17.154+03:00", "highlightTitle": ""}