{"organizations": [], "uuid": "d2b112cda6f335ea83fd50e1e040d04f7beaa807", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbsnews.com", "main_image": "http://cbsnews2.cbsistatic.com/hub/i/r/2015/10/04/a3104074-1174-42e5-8f2f-a650385cd92e/thumbnail/620x350/0459fbf347cc125c730757f32cd8f309/bridge-of-spies-tom-hanks-promo.jpg", "site_section": "http://www.cbsnews.com/entertainment/", "section_title": "Entertainment News, Headlines and Video - CBS News ", "url": "http://www.cbsnews.com/news/nyff-review-bridge-of-spies/", "country": "US", "title": "New York Film Festival review: \"Bridge of Spies\"", "performance_score": 0, "site": "cbsnews.com", "participants_count": 1, "title_full": "New York Film Festival review: \"Bridge of Spies\" - CBS News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T17:35:00.000+03:00", "replies_count": 0, "uuid": "d2b112cda6f335ea83fd50e1e040d04f7beaa807"}, "author": "David Morgan CBS News", "url": "http://www.cbsnews.com/news/nyff-review-bridge-of-spies/", "ord_in_thread": 0, "title": "New York Film Festival review: \"Bridge of Spies\"", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "It's easy to see what attracted Joel and Ethan Coen to work on the screenplay for the espionage drama \"Bridge of Spies,\" a true-life Cold War thriller originally penned by British playwright Matt Charman. The irony of a lawyer who typically defends insurance companies being recruited to broker a prisoner exchange between the U.S. and the U.S.S.R. in the no-man's land of East Berlin, and the cynicism that appears to corrode most everyone around the story's protagonist, James Donovan (Tom Hanks), is right up their alley. It could have made for a very good Coen Brothers film.\n37 Photos New York Film Festival 2015 One of the world's premier celebrations of cinema kicks off with gala red carpet premieres, symposiums and retrospectives\nBut cynicism is not a strong suit for director Steven Spielberg, who often downplays dramatic irony in favor of full-throated lyricism. The disjoint is sadly apparent during much of \"Bridge of Spies,\" which had its world premiere Sunday at the 53rd New York Film Festival . (The movie opens nationwide on October 16.)\nIn 1957 Donovan, a Brooklyn-based lawyer whose resume included serving as a prosecutor's assistant during the Nuremberg trials, is handed the thankless job of defending Rudolf Abel (Mark Rylance), a foreign national arrested for passing secrets to the Soviet Union. Donovan's defense of Abel brings the fear and discord of the Cold War '50s to his doorstep, even endangering his children, who are busy having their heads filled with nuclear horrors of impending missile attacks. Abel's conviction may be a forgone conclusion, but Donovan gives it his all, and then some.\nIn short order, Air Force pilot Francis Gary Powers, who'd been recruited into the government's secret surveillance program, is captured by the Soviets after his U-2 spy plane is shot down over Russia. His conviction for espionage a forgone conclusion, he is interrogated for information and held up as a public embarrassment. Washington wants him back, and is willing to barter one spy for another.\nThis is where Donovan's insurance background comes in handy, by playing up the contingencies -- each government is trying to insure that their guy won't break under questioning, or insure that the next spy captured down the road won't break. Like a high-stakes poker game, they are also betting that the other side won't presume their man has already talked, or else the captive's value would be nil.\n42 Photos The films of Steven Spielberg A look at the career of one of Hollywood's most celebrated filmmakers\nThe film is thankfully quieter and less frenetic than is suggested by its hyped-up trailer, but nonetheless it's brazenly obvious about its intentions compared to productions based on some of John Le Carre's espionage novels, such as \"The Spy Who Came In From the Cold,\" \"Tinker Tailor Soldier Spy,\" or \"A Most Wanted Man.\" Spielberg hits his emotional points hard, with or without children around, and telegraphs dramatic events to the point where -- even for a historical reenactment whose key points are known -- they become predictable. (When Donovan spots a group of people running towards the Berlin Wall, you just know he will witness their deaths by machine-gun fire.)\nBy this token, Rylance (a three-time Tony Award-winner) gives the film's stand-out performance in part by doing so little -- his stillness and taciturn demeanor in the face of so much hot-blooded vitriol, international brinkmanship, and a looming death sentence is riveting. There is much about Abel that remains a cipher, even when the jig is up.\nThis is Hanks' fourth time working with Spielberg (after \"Saving Private Ryan,\" \"The Terminal\" and \"Catch Me If You Can\"). In his familiar role as Hollywood's consummate Everyman figure, Hanks upholds the movie's message that we all (FBI and CIA included) must act by the rules of the Constitution, and that the legal protections it promises are to be shared by all, even those who would do harm to our country. But he's also a softy, and finagles his negotiations to include a young American graduate student, Frederic Pryor (Will Rogers), who was picked up by East German police for being in the wrong place at the wrong time. Washington and Moscow don't particularly care about kids writing Ph.D. dissertations on economics, but Donovan does, and threatens to upend the entire deal if Pryor isn't freed as well. Cynicism, you lose.\n\"Bridge of Spies,\" distributed by Touchstone Pictures, opens October 16. Rated PG-13 (for some violence and brief strong language). 135 mins.\nTo watch a trailer click on the video player below.\nFor more info:\n\"Bridge of Spies\" (Official site)\nMore NYFF53 reviews:\n\"The Walk\" \"The Forbidden Room\" \"Journey to the Shore\" and \"Cemetery of Splendour\" \"Arabian Nights\" \"De Palma\" (documentary) \"Where to Invade Next\" \"Steve Jobs\"", "external_links": ["https://www.youtube.com/embed/2-2x3r1m2I4", "http://cbsnews1.cbsistatic.com/hub/i/r/2015/10/04/22f35461-6c9e-4cd9-8861-5f346a84e269/thumbnail/220x140/c8d04a27ce61655fa85441c3ae8be072/nyff-steve-jobs-ap510498655634.jpg", "http://cbsnews2.cbsistatic.com/hub/i/r/2012/01/11/13f8b7fa-a645-11e2-a3f0-029118418759/thumbnail/220x140/db489c5d3a297992cb86b415cae6236d/SMpromo_Spielberg_NewWorld.jpg", "http://www.filmlinc.org/nyff2015/", "http://bridgeofspies.com/"], "published": "2015-10-05T17:35:00.000+03:00", "crawled": "2015-10-05T23:15:57.704+03:00", "highlightTitle": ""}