{"organizations": [], "uuid": "a6e00f860b8aa48cc914d616ac1232f5c9a7058c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48524/c", "section_title": "Entertainment - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30239469/viamedia-receives-additional-capital-investment-from-private-equity-owner-lake-capital-to-fuel-continued-growth", "country": "US", "title": "Viamedia Receives Additional Capital Investment From Private Equity Owner Lake Capital To Fuel Continued Growth", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Viamedia Receives Additional Capital Investment From Private Equity Owner Lake Capital To Fuel Continued Growth - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "a6e00f860b8aa48cc914d616ac1232f5c9a7058c"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30239469/viamedia-receives-additional-capital-investment-from-private-equity-owner-lake-capital-to-fuel-continued-growth", "ord_in_thread": 0, "title": "Viamedia Receives Additional Capital Investment From Private Equity Owner Lake Capital To Fuel Continued Growth", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Viamedia\nNEW YORK , Oct. 12, Viamedia , the television industry's largest independent cable TV ad management company, announced today that it has received an additional growth capital investment from its private equity owner, Chicago -based Lake Capital . These funds will power Viamedia's expansion with new partners and into new growth areas in cable TV spot and programmatic TV advertising by bringing to market new ad tech software solutions. Terms of the deal were not disclosed.\nLake Capital made its initial strategic investment in Viamedia in December 2010 to complement its portfolio of digital and marketing service businesses. Viamedia has recently signed up additional multi-channel video programming distributors (MVPDs) including the renewal and expansion of its relationship with CenturyLink. In addition, Viamedia's 2 nd quarter ad sales are up 9% over the same period last year while digital sales are up 40%. And Viamedia's programmatic supply side television advertising platform, placemedia, which offers more than 30 billion monthly impressions, recently announced strategic relationships with a number of digital DSP and digital ad tech companies, including Tube Mogul, The Trade Desk, Tremor and Collective, as a means to create a cross media solution.\n\"Over the past year, the Viamedia management team has demonstrated the ability to move aggressively and smartly to pursue and monetize the opportunities offered by the evolution and disruption in television advertising,\" said Terence Graunke , chairman, principal and co-founder of Lake Capital. \"Local advertising is an important, rapidly growing and attractive sector, and Viamedia is at its forefront. We believe Viamedia's deep and strong relationships with a large and diverse community of local and national advertisers position the company to continue as a market leader across all forms of local advertising.\"\n\"Lake Capital has been terrifically supportive,\" said Viamedia President and CEO Mark Lieberman . \"Lake Capital possesses the vision, operational experience and command of the rapidly evolving TV advertising landscape, and they appreciate our unique role in driving change.\"\n\"The Viamedia management team boasts a special mix of advertising, ad tech solutions utilizing big data, and deep digital experience, which together are the right ingredients in today's rapidly evolving market for pay TV ad services,\" said Lake Capital advisor and longtime pay-TV executive and investor Carl Vogel , who serves as Viamedia's chairman. \"Combined with Lake's unique investment thesis, we have the right team moving forward.\"\nAbout Viamedia\nHeadquartered in New York City , Viamedia is the largest independent cable TV ad management company for local, regional and national advertising, programmatic and ad tech solutions, responsible for more than 1.2 million 30-second spots per day on behalf of 10,000 advertisers. The company specializes in selling advertising on behalf of U.S. cable and telecommunications service providers, utility companies and municipalities, and has partnered with nearly 60 multi-channel video programming distributors (MVPDs). The company also operates placemedia, a programmatic data-driven platform, representing over 30 billion advertising avails monthly across 210 DMAs on nearly 100 TV networks. For more information, please visit www.viamediatv.com .\nAbout placemedia\nplacemedia, a wholly owned subsidiary of Viamedia , is a fully automated supply side programmatic television platform for linear television. The placemedia platform seamlessly connects demand side players including agencies, advertisers and DSPs with aggregated television ad inventory from placemedia's supply side partners. Through aggregation and automation, placemedia provides the ability to target audiences for advertisers, which in turn creates incremental demand on inventory for cable networks, broadcast and MVPDs. The placemedia sell-side programmatic TV platform now handles more than 30 billion impressions monthly in nearly 100M TV households across 210 DMAs. For more information, please visit http://placemedia.com/ .\nAbout Lake Capital\nLake Capital is a Chicago based private equity firm that focuses on investments in service-based enterprises. The firm currently manages more than $1 billion in equity commitments and seeks to build leading services companies through organic and acquisition - enhanced growth. More information about Lake Capital is available at www.lakecapital.com .\nLogo - http://photos.prnewswire.com/prnh/20101115/CL01765LOGO\n releases/viamedia-receives-additional-capital-investment-from-private-equity-owner-lake-capital-to-fuel-continued-growth-300157610.html\n ", "external_links": ["http://www.xmlnews.org/ns/", "http://www.viamediatv.com/", "http://photos.prnewswire.com/prnvar/20101115/CL01765LOGO", "http://photos.prnewswire.com/prnh/20101115/CL01765LOGO", "http://rt.prnewswire.com/rt.gif?NewsItemId=CL25159&Transmission_Id=201510121027PR_NEWS_USPR_____CL25159&DateId=20151012", "http://www.lakecapital.com/", "http://placemedia.com/", "http://www.prnewswire.com/news-releases/viamedia-receives-additional-capital-investment-from-private-equity-owner-lake-capital-to-fuel-continued-growth-300157610.html"], "published": "2015-10-12T03:00:00.000+03:00", "crawled": "2015-10-12T19:13:22.282+03:00", "highlightTitle": ""}