{"organizations": [], "uuid": "624509e4326429b7d4fdb1a3f5fde09fecd79dcf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.courant.com", "main_image": "http://www.trbimg.com/img-5623da20/turbine/ct-eddie-murphy-humor-prize-kennedy-center-20151018", "site_section": "http://www.courant.com/entertainment/rss2.0.xml", "section_title": "Entertainment - Hartford Courant", "url": "http://www.courant.com/entertainment/ct-eddie-murphy-humor-prize-kennedy-center-20151018-story.html", "country": "US", "title": "Eddie Murphy receives top US humor prize at Kennedy Center", "performance_score": 0, "site": "courant.com", "participants_count": 1, "title_full": "Eddie Murphy receives top US humor prize at Kennedy Center", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T13:59:00.000+03:00", "replies_count": 0, "uuid": "624509e4326429b7d4fdb1a3f5fde09fecd79dcf"}, "author": "Tribune wire reports", "url": "http://www.courant.com/entertainment/ct-eddie-murphy-humor-prize-kennedy-center-20151018-story.html", "ord_in_thread": 0, "title": "Eddie Murphy receives top US humor prize at Kennedy Center", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Eddie Murphy receives top US humor prize at Kennedy Center Murphy makes Cosby jokes at award ceremony Eddie Murphy jokes about Bill Cosby and does his famous impersonation of the troubled star during his acceptance speech for the Mark Twain Prize in Washington, D.C.; comedy stars including Tracy Morgan, Kathy Griffin, and Trevor Noah attend. Oct. 19, 2015. (AP) Eddie Murphy jokes about Bill Cosby and does his famous impersonation of the troubled star during his acceptance speech for the Mark Twain Prize in Washington, D.C.; comedy stars including Tracy Morgan, Kathy Griffin, and Trevor Noah attend. Oct. 19, 2015. (AP) Tribune wire reports Contact Reporter \nEddie Murphy is trading places with Mark Twain. \nThe Kennedy Center for the Performing Arts is honoring the comedian, film star, producer and director Sunday evening with the nation's top prize for humor. \nA lineup of funny men and women including Dave Chappelle, George Lopez, Kathy Griffin, Arsenio Hall, Trevor Noah and Whitney Cummings will salute Murphy with the Mark Twain Prize for American Humor. \nOther performers include stars from \"Saturday Night Live,\" where Murphy had an early break. Among the SNL alumni paying tribute to Murphy are Tracy Morgan, Chris Rock, Jay Pharoah, Kevin Nealon and Joe Piscopo. \nThe humor prize honors those who influence society in the tradition of Samuel Clemens, the writer and satirist known as Mark Twain. Past honorees include Jay Leno, Carol Burnett, Tina Fey, Whoopi Goldberg, Ellen DeGeneres, Will Ferrell, Richard Pryor and Bill Cosby. \nMurphy gained national attention when he joined the SNL cast in 1980 at the age of 19. He went on to become the most commercially successful African-American actors in film history and one of the industry's Top 5 box office performers overall, the Kennedy Center said. Murphy's films have been among Hollywood's highest-grossing comedies, including \"48 Hours,\" ''Trading Places,\" ''Dr. Dolittle\" and \"Coming to America.\" \nThe tribute will be broadcast Nov. 23 on PBS. \nAssociated Press", "external_links": [], "published": "2015-10-19T13:59:00.000+03:00", "crawled": "2015-10-20T07:54:22.050+03:00", "highlightTitle": ""}