{"organizations": [], "uuid": "8c7437a7df72a7bfd4a7053bdd9c2312d07bef9f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "610kvnu.com", "main_image": "http://abcnewsradioonline.com/storage/news-images-october-2015/Jay%20Z%20Kevin%20MazurGetty%20Images%20for%20TIDAL.jpg?__SQUARESPACE_CACHEVERSION=1445434642209", "site_section": "http://www.610kvnu.com/entertainment/feed.xml", "section_title": "Entertainment", "url": "http://610kvnu.com/entertainment/d39ff1b52b6376a7318d95832cb733a5", "country": "US", "title": "Jay Z Treats \"Jimmy Kimmel Live!\" Audience to a Special Performance", "performance_score": 0, "site": "610kvnu.com", "participants_count": 0, "title_full": "Jay Z Treats \"Jimmy Kimmel Live!\" Audience to a Special Performance", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T21:00:00.000+03:00", "replies_count": 0, "uuid": "8c7437a7df72a7bfd4a7053bdd9c2312d07bef9f"}, "author": "", "url": "http://610kvnu.com/entertainment/d39ff1b52b6376a7318d95832cb733a5", "ord_in_thread": 0, "title": "Jay Z Treats \"Jimmy Kimmel Live!\" Audience to a Special Performance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jimmy Kimmel"], "text": "Jay Z Treats \"Jimmy Kimmel Live!\" Audience to a Special Performance Posted just a moment ago \nKevin Mazur/Getty Images for TIDAL (NEW YORK) -- Jay Z stopped by Jimmy Kimmel Live! on Tuesday to promote his Tidal X charity concert at Brooklyn's Barclays Center -- a bill that also features Beyoncé, Nicki Minaj, and Usher -- and invited Jimmy Kimmel and his entire audience to catch the show for free. \nProceeds will go to the New World Foundation, which benefits, “nonprofit organizations dedicated to advancing positive community relations and effecting systemic change for the development and sustainability of just societies,” according to the event's website . \nThe 45-year-old hip-hop mogul also discussed his subscription-based streaming service, Tidal, which he describes as a \"big jukebox.\" \n\"You go in a jukebox, there's a barkeep, he curates it, he puts a couple of things in there, you put four dollars and you get five songs,\" he explained, noting in Tidal's case, \"...You put nine dollars, you get 30 million songs.\" \nIn 2013, Jay Z launched his sports his sports agency, Roc Nation Sports. He told Kimmel that his business is not just about landing big money contracts for superstar athletes, but helping them plan for the future as well. \n\"They're 21, 18 years old, he explains, \"Someone needs to advise them. They're kids.\" \nAfterwards, Jay Z invited Kimmel's studio audience to walk to the show at Barclays Center, which is located just blocks away from the Brooklyn Academy of Music's Howard Gilman Opera House, where Jimmy is broadcasting his shows from this week. Jay performed \"Empire State of Mind,\" followed by \"Chains,\" for which Usher and Bibi Bourelly took center stage and closed out the show. \nIncidentally, Donald Trump was also supposed to appear on the program, but cancelled, reportedly to attend a political event. \nCopyright © 2015, ABC Radio. All rights reserved.", "external_links": [], "published": "2015-10-21T21:00:00.000+03:00", "crawled": "2015-10-21T17:06:08.986+03:00", "highlightTitle": ""}