{"organizations": [], "uuid": "ed429aa252ef1ff31d134bc4d63a3cad1586f69f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.democratandchronicle.com", "main_image": "http://www.gannett-cdn.com/-mm-/66e77f8a22d9db15300d453ed816bed4eb93a0b9/c=0-215-4606-2817&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/10/02/USATODAY/USATODAY/635793819426464273-AP-OBAMA-75913954.JPG", "site_section": "http://www.democratandchronicle.com/", "section_title": "Democrat and Chronicle | Rochester news, community, entertainment, yellow pages and classifieds. Serving Rochester, New York | democratandchronicle.com", "url": "http://www.democratandchronicle.com/story/news/2015/10/02/obama-arne-duncan-education-secreatry-john-b-king-jr/73203754", "country": "US", "title": "Education Secretary Arne Duncan to step down", "performance_score": 0, "site": "democratandchronicle.com", "participants_count": 1, "title_full": "Education Secretary Arne Duncan to step down", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T19:27:00.000+03:00", "replies_count": 0, "uuid": "ed429aa252ef1ff31d134bc4d63a3cad1586f69f"}, "author": "David Jackson, USA TODAY", "url": "http://www.democratandchronicle.com/story/news/2015/10/02/obama-arne-duncan-education-secreatry-john-b-king-jr/73203754", "ord_in_thread": 0, "title": "Education Secretary Arne Duncan to step down", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON — Education Secretary Arne Duncan, a member of President Obama's original Cabinet, is planning to step down in December and will be replaced by deputy John B. King, Jr., officials said Friday. President Obama will make the announcement at 3:30 p.m., said two officials, speaking on condition of anonymity so as to not to preempt that event.\nThe president is expected to take questions at the announcement on topics that could range from Russian military activity in Syria to Thursday's mass shooting at Umpqua Community College in Roseburg, Ore.\nDuncan's departure is scheduled for December, officials said.\nIn an e-mail to staff members, Duncan described his service at the Education Department as \"the greatest honor of my life.\"\nAmong his legacies: The \"Race to the Top\" program in which states competed for federal grants, and an emphasis on K-12 education.\nSome Republicans criticized Duncan for what they called federal overreach into decisions that should be made by local school officials.\nIn his e-mail, Duncan also noted that his family has remained in his hometown of Chicago, and being apart from them \"has become too much of a strain.\"\nUSA TODAY\nDuncan: Find other paths for non-violent offenders, spend savings on teacher raises\nDuncan said he doesn't know what he will do next, but \"I imagine my next steps will continue to involve the work of expanding opportunity for children, but I have no idea what that will look like yet.\"\nOfficials said the administration plans to have King serve in an acting capacity without a formal nomination to secretary's post. That eliminates the possibility of a contentious confirmation hearing before the Republican-run Senate.\nKing, a former education commissioner in New York State, has been a backer of Common Core, a set of new learning standards embraced by many education professionals. Many Republicans, including some GOP presidential candidates, oppose Common Core, describing it as too much federal meddling.\nDuncan, a former head of the Chicago public schools system, is one of the few Cabinet members to have a personal relationship with Obama. The former basketball at Harvard has often played hoops with the president.\nDuncan's decision leaves Agriculture Secretary Tom Vilsack as the only original member of the Cabinet that came into office with Obama in 2009. (Shaun Donovan, the president's first secretary of Housing and Urban Development, is now budget director.)", "external_links": ["http://www.usatoday.com/story/news/2015/09/30/duncan-incarceration-speech/73109088/", "http://www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/53b8c6840642a338f2d6f6def1b28bfc13e1b4f5/c=787-0-3819-3032/local/-/media/2015/09/30/USATODAY/USATODAY/635792291143036081-AP-OBAMA-75913954.JPG"], "published": "2015-10-02T19:27:00.000+03:00", "crawled": "2015-10-02T20:11:24.054+03:00", "highlightTitle": ""}