{"organizations": ["Scripps Media, Inc"], "uuid": "38a9c502c56c7a8865315a1072aa5bbc59403439", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thedenverchannel.com", "main_image": "http://media.thedenverchannel.com/photo/2015/10/22/espn-gus-kenworthy_Fotor_1445536460953_25589464_ver1.0_640_480.jpg", "site_section": "http://www.thedenverchannel.com/feeds/rssFeed?obfType=RSS_FEED&siteId=100003&categoryId=10008", "section_title": "Entertainment | 7NEWS", "url": "http://www.thedenverchannel.com/sports/olympic-freestyle-skier-gus-kenworthy-comes-out-as-gay-in-espn-interview", "country": "US", "title": "Olympic skier Gus Kenworthy comes out as gay", "performance_score": 0, "site": "thedenverchannel.com", "participants_count": 0, "title_full": "Olympic skier Gus Kenworthy comes out as gay", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T21:07:00.000+03:00", "replies_count": 0, "uuid": "38a9c502c56c7a8865315a1072aa5bbc59403439"}, "author": "", "url": "http://www.thedenverchannel.com/sports/olympic-freestyle-skier-gus-kenworthy-comes-out-as-gay-in-espn-interview", "ord_in_thread": 0, "title": "Olympic skier Gus Kenworthy comes out as gay", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kenworthy", "Ian", "Gus Kenworthy"], "text": "Olympic freestyle skier Gus Kenworthy comes out as gay in ESPN interview 12:05 PM, Oct 22, 2015 44 mins ago Previous Next Copyright 2015 Scripps Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed. Gus Kenworthy in the Freestyle Skiing Men's Ski Slopestyle Qualification on February 13. (Photo by Ian MacNicol/Getty Images) Copyright Getty Images Kenworthy celebrates in the Men's Freestyle Skiing Slopestyle finals. (Photo credit FRANCK FIFE/AFP/Getty Images) Image copyright 2014 Getty Images. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed. Show Caption Previous Next \nDENVER - Freestyle skier Gus Kenworthy pulls jumps, flips and twists at heights that would terrify most people. \nOn Thursday the X Games star from Telluride made another brave move. I am gay. pic.twitter.com/086ayvChq2 — Gus Kenworthy (@guskenworthy) October 22, 2015 \n\"Today is the first day of the rest of my life,\" Kenworthy tweeted a few hours before coming out to the public. \n\"I felt like I was already being so courageous with my body and my actions and the things I was doing in order to try to win and be the best,\" Kenworthy said at his home in Denver. \"Then, I was being such a coward in this other way, where I wouldn't let anyone know. So they were battling each other. I'm excited where those two things can go hand in hand.\" \nMembers of the sports community showed their support on Twitter. Proud of you @guskenworthy ! You're the man! — Tom Wallisch (@TWallisch) October 22, 2015 . @guskenworthy We are PROUD to say you are part of #TeamUSA ! pic.twitter.com/RKD49HQtiW — U.S. Olympic Team (@TeamUSA) October 22, 2015 \nKenworthy said he was touched by the positive response. Just watched my story air on @ESPN @SportsCenter and I'm all choked up. Tears of joy! Thanks for your support :) pic.twitter.com/A1VUHZh3Pb — Gus Kenworthy (@guskenworthy) October 22, 2015 \nDuring an interview with the Associated Press, Kenworthy spoke of severe depression, thoughts of suicide, the internal battle of how to \"live authentically and not feel like I need to hide anymore.\" \nHeading into the biggest ski contest of his life -- the 2014 Winter Olympics in Sochi, Russia -- he wasn't all the way there. He hadn't told his parents, or his brothers. And though he had let himself get caught up in the idea of a celebratory kiss with his boyfriend at the bottom of the hill, and the many messages it would send, he knew it couldn't happen. \n\"The idea of kissing my boyfriend at the bottom of my run would've been, in addition to me coming out, a silent f--- you to the anti-gay legislature in place in Russia,\" he said. \nKenworthy won silver in men's freestyle skiing. \nInstead, his post-victory tour involved him being portrayed as the pet-loving heartthrob who brought Olympic glory to his home country. Typical of winning athletes who go on their post-Olympic interview tours, he faced questions about much more than just skiing. \nWho is your celebrity crush? Miley Cyrus, Kenworthy lied. \nHow do you feel about saving all those dogs? He couldn't tell the real story and so he lied again: Couldn't be happier. \nTruth was, he was nothing more than a casual fan of Cyrus, and the person who did most of the hard work with the dogs -- including staying behind in Russia for more than a month to get them back to the United States -- was his boyfriend at the time. \n\"He got zero credit and I was getting asked about it on every show and in every interview,\" Kenworthy said. \nMuch as the label \"Dog Guy\" stuck with him long after Sochi, Kenworthy is aware he could be cast, too simply, as the \"Gay Skier.\" \nBut in the 20 months since his trip to Russia, where debate raged over gay rights and the government's law against gay \"propaganda,\" Kenworthy has become more assured about who he is, both on and off the slopes. He has won a title on the Dew Tour, more World Cup podiums and had a legitimate chance at the overall championship last season until a leg and knee injury ended things early. \nRelegated to the gym for months of rehab, he finally had the time to crystalize his feelings about whether he was ready to tell the world who he really is. \nHe said he likes the idea of coming out while he's at the top of his game, while people in his sport -- especially kids -- are paying attention. \n\"We admire Gus for having the strength to tell the world who he is as a person, and paving the way for others to do the same,\" said Tiger Shaw, the CEO of U.S. Ski and Snowboard Association. \nWhile the locker-room atmosphere of football or basketball doesn't exist in freestyle skiing, it is still a sport built on a certain brand of devil-may-care machismo. How will a gay skier be received among this cadre of daredevils? \nFor a man who makes a living catapulting off of 70-foot-high ramps, this is a very different sort of leap. \n\"I don't know what the future has in store,\" Kenworthy said, \"but I'm kind of looking forward to it.\" \nESPN The Magazine's Being Out Issue hits newsstands on Oct. 30. Copyright 2015 Scripps Media, Inc. The Associated Press contributed to this report. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.", "external_links": [], "published": "2015-10-22T21:07:00.000+03:00", "crawled": "2015-10-22T21:54:36.384+03:00", "highlightTitle": ""}