{"organizations": [], "uuid": "1cf644a60de42928a68bc3096f4bc0b4f9035a3d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sfgate.com", "main_image": "http://ww3.hdnux.com/photos/41/40/66/8785330/7/rawImage.jpg", "site_section": "http://sfgate.com//rss/feed/Entertainment-530.php", "section_title": "Entertainment", "url": "http://www.sfgate.com/music/article/Shamir-6569071.php", "country": "US", "title": "Shamir can't stop moving", "performance_score": 0, "site": "sfgate.com", "participants_count": 1, "title_full": "Shamir can't stop moving - SFGate", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T19:49:00.000+03:00", "replies_count": 0, "uuid": "1cf644a60de42928a68bc3096f4bc0b4f9035a3d"}, "author": "sfgate.com", "url": "http://www.sfgate.com/music/article/Shamir-6569071.php", "ord_in_thread": 0, "title": "Shamir can't stop moving", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Image 1 of / 1 Caption\nClose\nImage 1 of 1 Shamir will play the Treasure Island Music Festival on Saturday, October 17, 2015.\nShamir will play the Treasure Island Music Festival on Saturday,... Shamir can't stop moving 1  /  1 Back to Gallery Shamir is not having an identity crisis. He probably never has, or at least that's how it seems. The nearly 21-year-old Las Vegas native appears completely at ease in his own skin, which must come in handy when it's time to take some career risks.\nShamir was discovered only a couple years ago by GODMODE record label founder (and former music writer) Nick Sylvester, who invited the singer to visit New York to meet him. Things moved for the young performer rather quickly after that.\nAfter receiving Sylvester's call, Shamir didn't hesitate to chase a shot at a serious music career. He quit his job at Topshop and took his first ever airplane flight to get started on an EP called \"Northtown,\" which released only about a year ago, in June 2014.\nToday, only a few short days before he plays the Treasure Island Music Festival , Shamir is in Austin, on the second leg of a tour with Marina & the Diamonds supporting his pretty much unanimously adored debut full-length album \"Ratchet.\" He sounds quite busy; the artist is dodging noisy passersby on the phone, but eventually finds a quiet place to speak about his hometown, his music, and following intuition.\nQ: What's the music scene like in your home of Las Vegas? \nA: It's different. It's not too prominent because we don't have too many venues, so we only get kind of the bigger acts — like pop acts. It's kind of a struggle to make a name for our own selves, but I think it helped me to kind of go harder.\nQ: You've said that the city is very tolerant when it comes to LGBT and trans people. Do you think that kind of accepting environment is conducive to the success of the city's artists? \nA: Yeah, I mean, it's like maybe Vegas is more tolerant, but also people come [here] to do what they want and no one really judges them because, you know, it's Sin City. No one really has too much room to judge anyways. I don't know, I guess I just kind of stay in my own lane of music and never really thought about what straight people music [is]. I just sit down and make a lot of music.\nQ: You found fame really quickly. Has it been tough to adapt to this sudden level of constantly touring and notoriety? \nA: Yeah it really has, because it's been super all of a sudden and I'm still adjusting and adapting.\nQ: Your music has been described with words like \"candy-colored,\" \"quirky,\" and weirdly, \"sherbet.\" Do you feel like these terms accurately describe your sound? \nA: Sometimes. But I also feel like other people's descriptions of my music are solely their opinion and I can't tell them when they think my music should sound like. But whatever. As long as people are relating to it, that's all I care about.\nQ: When you met GODMODE record label founder Nick Sylvester and he heard your music, he joked that you must like EDM. I know you probably wouldn't describe it that way, but how would you describe your sound to those who haven't heard it? \nA: Well I would probably say pop music because I feel like it's relatable. It is pop music, but it has a bunch of different genres blended through it.\nQ: When you signed to Godmode, did it seem like you were taking a big risk or did it seem like the right thing to do? \nA: Yeah, it seemed like a fun thing to do. I really had nothing to lose. I had just graduated high school, like I didn't have anything to leave behind [laughs].\nShamir will play the Treasure Island Music Festival on Saturday, October 17, 2015.\nShamir will play the Treasure Island Music Festival on Saturday,... Q: Being signed to XL Recordings now, you share a roster with huge acts like Adele, fellow Treasure Island act FKA Twigs, and The xx. Do you feel the pressure to make really amazing music or do you feel supported, like you're surrounded by the best? \nA: Yeah, I feel even more comfortable. I think just knowing that they have all these artists and the fact that I am even on the same roster makes me want to be even more of myself. You know? For this album I was just being myself and that was enough for them, so in knowing that they have all these other amazing artists who are just also being themselves, so I guess I just need to put more faith in myself.\nQ: \"Ratchet\" is a super fun, bouncy album; how have audiences on tour so far been responding to the music live? \nA: Great! Great, everyone is dancing, it's really fun.\nShamir plays the Treasure Island Music Fest on Saturday, October 17.", "external_links": [], "published": "2015-10-13T19:49:00.000+03:00", "crawled": "2015-10-14T13:20:56.365+03:00", "highlightTitle": ""}