{"organizations": [], "uuid": "5f4be30b82307022895b0517165b6f2f4bbf90d9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.india.com", "main_image": "http://s3.india.com/wp-content/uploads/2015/10/voting-polls-elections.jpg", "site_section": "http://www.india.com/feed/", "section_title": "India | Latest India News | Get Free India.com Email | Live Cricket and Entertainment News at India.Com", "url": "http://www.india.com/news/world/india-seeks-transparency-in-election-of-un-secretary-general-649190/", "country": "US", "title": "India seeks transparency in election of UN Secretary-General", "performance_score": 0, "site": "india.com", "participants_count": 1, "title_full": "India seeks transparency in election of UN Secretary-General", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T14:05:00.000+03:00", "replies_count": 0, "uuid": "5f4be30b82307022895b0517165b6f2f4bbf90d9"}, "author": "Wires English | Press Trust of India", "url": "http://www.india.com/news/world/india-seeks-transparency-in-election-of-un-secretary-general-649190/", "ord_in_thread": 0, "title": "India seeks transparency in election of UN Secretary-General", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments United Nations, Oct 21 : India today called for doing away with “secret straw polls” to make the selection of the next Secretary-General more transparent, saying the process should not be a prerogative of the five permanent members of the Security Council. While there is a great deal of debate on the prerogatives of the Security Council and the General Assembly in this matter, “at the heart” is the question of the prerogatives of the five permanent members of the Council and the rest of the membership of the UN, visiting Lok Sabha MP Bhartruhari Mahtab said. (Also Read: India, Russia decide to triple bilateral trade by 2025) “And, that is, to a large extent, determined by something as seemingly innocuous as the working method of the Council,” he said adding that the Indian delegation has pressed for the Council to recommend two or more names to the General Assembly,” he said at an open debate on ‘Working Methods’ of the Security Council here yesterday. ”While the pronouncements of the General Assembly do not specifically provide for this, there is – in our view – no legal impediment for the Council to do so,” he said. He called for doing away with “secret straw polls” using different coloured slips that allow the the permanent members to exercise the veto without even taking ownership of it. He added that discussions should be held in official meetings of the Council, preferably open ones and the Secretary General should issue reports summarising the proceedings. He also reiterated the need for consultations to be held with troop contributing countries before mandates of peacekeeping operations are finalised. “Regrettably this has never happened. Again, we look towards the elected members of the Council to make a beginning,” he said. ”I must say that the problems afflicting the Security Council go deeper than its working methods. While a focus on working methods is useful, it can in no way be a substitute for reforming the Council in a manner that would give its decisions legitimacy and acceptability,” he said. \n  4:35 PM Topics:", "external_links": [], "published": "2015-10-21T14:05:00.000+03:00", "crawled": "2015-10-21T15:31:25.328+03:00", "highlightTitle": ""}