{"organizations": [], "uuid": "84650181a8857b88b4578859fa13be88c0f89903", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "wtop.com", "main_image": "", "site_section": "http://wtop.com/section/entertainment/feed/", "section_title": "WTOP » Sections » Entertainment", "url": "http://wtop.com/baltimore-orioles/2015/10/this-date-in-baseball-145/", "country": "US", "title": "This Date In Baseball", "performance_score": 0, "site": "wtop.com", "participants_count": 1, "title_full": "This Date In Baseball", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T07:00:00.000+03:00", "replies_count": 0, "uuid": "84650181a8857b88b4578859fa13be88c0f89903"}, "author": "wtopstaff", "url": "http://wtop.com/baltimore-orioles/2015/10/this-date-in-baseball-145/", "ord_in_thread": 0, "title": "This Date In Baseball", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "and The Associated Press October 3, 2015 12:00 am Compiled by PAUL MONTELLA Oct. 4 \n1906 — The Chicago Cubs won their 116th game of 152 played for a winning percentage (.763) since unmatched. The Cubs were 60-15 on the road for an .800 winning percentage. \n1925 — Fans saw the unusual spectacle of two managers, both famous hitters, pitch against each other in the season finale. Ty Cobb of the Detroit Tigers threw one perfect inning and George Sisler of the St. Louis Browns worked two scoreless frames in Detroit’s 11-6 victory. \n1948 — The Cleveland Indians beat the Boston Red Sox 8-3 in a one-game AL playoff. The pitching of Gene Bearden and the hitting of Lou Boudreau were chiefly responsible for the championship victory. \n1955 — The Brooklyn Dodgers won their first World Series with Johnny Podres blanking the Yankees 2-0. \n1964 — The St. Louis Cardinals clinched the NL pennant with an 11-5 triumph over the New York Mets to end the closest pennant race in NL history. \n1969 — The major leagues staged their first divisional championships as the New York Mets beat the Atlanta Braves 9-5 and the Baltimore Orioles nipped the Minnesota Twins 4-3 in 12 innings in the opening games. \n1987 — The Detroit Tigers took advantage of one of the great collapses in baseball history to win the AL East title, beating the Toronto Blue Jays 1-0 behind the six-hit pitching of Frank Tanana. The Blue Jays lost their last seven games of the season, including three straight in the season-ending series in Detroit. \n1999 — The New York Mets, behind the strong pitching of Al Leiter, clinched the last remaining postseason berth by beating the Cincinnati Reds 5-0 in a one-game playoff for the NL wild card. \n2005 — Reggie Sanders hit a grand slam and set an NL division series record with six RBIs to help St. Louis beat San Diego 8-5 in the first game of their division series. \n2011 — Adrian Beltre hit three straight home runs and the Texas Rangers powered themselves back into the AL championship series, beating the Tampa Bay Rays 4-3 to win their playoff series. \n2011 — Rookie Paul Goldschmidt hit a grand slam and tied a franchise postseason record with five RBIs to lead Arizona to an 8-1 win and cut Milwaukee’s lead to 2-1 in the best-of-five NL division series. It was only the third rookie slam in postseason history. \n2014 — Brandon Belt homered off Tanner Roark in the 18th inning, lifting the San Francisco Giants to their 10th consecutive postseason victory, edging Washington 2-1 for a 2-0 lead in the NL Division Series. It tied the mark for most innings in a postseason game and set a time record at 6 hours, 23 minutes. Down to their final out in the ninth, the wild-card Giants tied it on Pablo Sandoval’s RBI double. Yusmeiro Petit entered in the 12th and threw six scoreless innings, allowing one hit and striking out seven, to earn the win. \nToday’s birthdays: Alec Asher 24; Casey Kelly 26; Lonnie Chisenhall 27; Drew Stubbs 31; Kurt Suzuki 32; Jered Weaver 33; Joe Thatcher 34; Kyle Lohse 37. Oct. 5 \n1941 — Brooklyn catcher Mickey Owen dropped a third strike on Tommy Henrich of what would have been the last out of a Dodgers victory against the New York Yankees. Given the second chance, the Yankees scored four runs for a 7-4 victory and a 3-1 lead in the World Series, which they ended up winning. \n1947 — Al Gionfriddo’s catch in left field robbed Joe DiMaggio of a game-tying home run in Game 6 of the World Series. The Dodgers beat the Yankees 8-6. \n1966 — Baltimore relief pitcher Moe Drabowsky fanned 11 and gave up one hit in 6 2-3 innings to beat the Dodgers 5-2 in the opening game of the World Series. \n1967 — Jim Lonborg of the Boston Red Sox pitched a one-hit, 5-0 victory over the St. Louis Cardinals to tie the World Series 1-1. Carl Yastrzemski hit two home runs. \n1996 — Bernie Williams homered from each side of the plate and Cecil Fielder broke a tie with a seventh-inning single as the New York Yankees beat Texas 6-4 to win the AL series 3-1 and advance to the ALCS. \n2001 — Barry Bonds set a new mark for home runs in a single season, hitting Nos. 71 and 72, but San Francisco was eliminated from the playoffs with an 11-10 loss to the Los Angeles Dodgers. \n2001 — The Mariners won their 115th game of the year to become the winningest team in American League history, passing the record the Yankees set three years earlier. Jamie Moyer became the oldest first-time 20-game winner, leading Seattle to a 6-2 victory over the Rangers. \n2002 — The wild-card Anaheim Angels roughed up Yankees starters Andy Pettitte, Mike Mussina and David Wells in succession to win the AL division series 3-1 and end New York’s four-year run as league champions. \n2003 — The Chicago Cubs won their first postseason series since 1908 when they beat Atlanta 5-1 in the decisive Game 5 of the NLDS. \n2007 — Manny Ramirez hit a three-run homer with two outs in the ninth inning off Francisco Rodriguez and the Boston Red Sox beat the Los Angeles Angels 6-3, taking a 2-0 lead in their AL playoff series. \n2008 — Francisco Rodriguez wriggled out of a bases-loaded jam in the 10th inning, Mike Napoli hit two early homers before scoring the go-ahead run in the 12th and the Los Angeles Angels avoided another playoff sweep by beating the Boston Red Sox 5-4. \n2013 — David Ortiz hit two homers to lead the Red Sox to a 7-4 victory over the Tampa Bay Rays and give Boston a 2-0 lead in the AL division series. \n2013 — Stephen Vogt lined an RBI single in the ninth inning after rookie Sonny Gray matched zeros with Justin Verlander that helped the Oakland Athletics beat the Detroit Tigers 1-0, tying their AL division series at a game apiece. \n2014 — Nelson Cruz sliced a two-run homer for his latest big postseason hit, and the Baltimore Orioles swept Detroit’s Cy Young Award winners to hold off the Tigers 2-1 and reach the AL Championship Series for the first time since 1997. Bud Norris outpitched David Price in Game 3 of the AL Division Series. Cruz’s homer was the 16th of his postseason career, including eight against the Tigers. \n2014 — Alex Gordon hit a bases-clearing double in the first inning, Eric Hosmer and Mike Moustakas each homered and the Kansas City Royals beat the Los Angeles Angels 8-3 to finish a sweep of their AL Division Series. The Angels became the second team in the divisional era to have the majors’ best record and get swept from the playoffs. The Yankees were also swept by the Royals in 1980 ALCS. \nToday’s birthdays: Tanner Roark 29; Jeff Bianchi 29; Alexi Ogando 32. Oct. 6 \n1915 — Philadelphia rookie Elmer Myers made a spectacular debut by striking out 12 Washington batters while allowing just two hits. Myers walked 5 in the 4-0 win his only game this year. \n1926 — Babe Ruth hit three homers to lead the Yankees to a 10-5 victory over the St. Louis Cardinals in the fourth game of the World Series. \n1948 — In the opening game of the World Series, the Boston Braves beat Bob Feller and the Cleveland Indians 1-0 with two hits and the benefit of a disputed call on a pickoff attempt in the eighth by Feller. \n1963 — Frank Howard led Los Angeles to a 2-1 win over the New York Yankees with a home run and a single, giving the Dodgers a four-game sweep in the World Series. \n1966 — Jim Palmer, 20, became the youngest player to pitch a World Series shutout as the Baltimore Orioles beat the Los Angeles Dodgers 6-0. Sandy Koufax was the loser, his last appearance in the major leagues. Dodger outfielder Willie Davis committed three errors on successive plays in the fifth inning. \n1983 — Baltimore’s Mike Boddicker struck out a playoff-record 14 batters en route to a 4-0, five-hit victory over the Chicago White Sox in the second game of the ALCS. \n1985 — Phil Niekro of the New York Yankees became the 18th 300-game winner as he blanked the Toronto Blue Jays 8-0 on the last day of the season. At 46, he became the oldest pitcher to throw a shutout. \n2008 — B.J. Upton homered twice to lead the Tampa Bay Rays into the American League championship series, finishing off the Chicago White Sox 6-2 in Game 4 of the AL playoffs. \n2010 — Roy Halladay pitched the second no-hitter in postseason history, leading the Philadelphia Phillies over the Cincinnati Reds 4-0 in Game 1 of the NL division series. Halladay allowed one runner, a walk to Jay Bruce with two outs in the fifth, and struck out eight. \n2011 — Detroit’s Don Kelly and Delmon Young hit back-to-back homers in the first inning, then Doug Fister and three relievers held off the high-powered Yankees — barely — and beat New York 3-2 in the deciding Game 5 of their AL playoff series. \nToday’s birthdays: Scott Schebler 25; Andrew Albers 30. Oct. 7 \n1904 — Jack Chesbro got his 41st victory of the season as New York defeated the Boston Red Sox 3-2. \n1928 — Lou Gehrig’s two home runs led the New York Yankees to a 7-3 victory over the St. Louis Cardinals in the World Series, giving them a 3-0 lead. \n1945 — Hank Greenberg’s three doubles led Detroit to an 8-4 victory over the Chicago Cubs, giving the Tigers a 3-2 lead in the World Series. \n1952 — Billy Martin’s running catch on a high infield pop with the bases loaded in the seventh inning snuffed a Dodgers rally and the New York Yankees went on to win Game 7 of the World Series 4-2. \n1961 — New York’s Roger Maris won the third game of the World Series with a ninth-inning home run off the Reds’ Bob Purkey. The Yankees won 3-2 at Cincinnati’s Crosley Field. \n1984 — The San Diego Padres won the National League pennant with a 6-3 victory over the Chicago Cubs in the final game of the playoffs. The Padres won three straight after dropping the first two games. \n1987 — Don Baylor singled to break an eighth-inning tie and Gary Gaetti homered in his first two playoff at-bats as the Minnesota Twins beat the Detroit Tigers 8-5 in the opening game of the ALCS. \n1995 — Edgar Martinez of the Seattle Mariners hit a tie-breaking grand slam in the eighth inning and drove in seven runs — most in a postseason game — to lead the Mariners past the New York Yankees 11-8 and send the AL playoff series to a decisive Game 5. \n1998 — Chuck Knoblauch argued for an interference call at first base instead of picking up the ball while Enrique Wilson rounded the bases and scored to break a 1-all tie in the 12th inning of the Cleveland Indians’ 4-1 victory at New York in Game 2 of the AL championship series. \n2001 — San Diego’s Rickey Henderson became the 25th player with 3,000 hits with a bloop double in a 14-5 loss to Colorado. \n2001 — Barry Bonds wrapped up his record-breaking season with his 73rd homer and shattered the slugging percentage record that Babe Ruth had owned for 81 years. He finished the season with a .328 batting average, a career-high 137 RBIs and a slugging percentage of .863, easily surpassing the mark of .847 that Ruth set in 1920. \n2002 — The wild-card San Francisco Giants eliminated the Atlanta Braves 3-1 and moved on to face St. Louis in the NL championship series. For the first time since the current postseason format was adopted in 1995, all four teams with the best record were eliminated in the opening round. \n2003 — Florida and the Chicago Cubs set several NLCS records in Marlins’ 9-8, 11-inning win. The teams combined for a record seven home runs. The Marlins’ Ivan Rodriguez, Miguel Cabrera and Juan Encarnacion all homered in the third inning, the first time an NL team has hit three homers in one inning. And the Cubs’ nine extra-base hits also was an NLCS record, as were the 17 total extra-base hits. \n2010 — San Francisco’s Tim Lincecum pitched a two-hitter and struck out 14 in a dominating postseason debut, and the Giants scored their only run after a questionable umpiring call to beat the Atlanta Braves 1-0 in Game 1 of their NL division series. \n2011 — Nyjer Morgan delivered an RBI single in the 10th inning to beat the Arizona Diamondbacks 3-2 to send the Milwaukee Brewers to the NL championship series. Trailing 2-1 in the ninth, Arizona got to closer John Axford after he had converted 43 straight regular-season save chances and another in the postseason. \n2013 — Jose Lobaton hit a solo home run with two outs in the bottom of the ninth inning and Tampa Bay staved off elimination again by beating the Boston Red Sox 5-4. \n2013 — Juan Uribe was unable to get a bunt down — and then hit a go-ahead, two-run homer in the eighth inning to give the Dodgers a 4-3 victory over the Atlanta Braves and send Los Angeles into the National League championship series. Carl Crawford homered his first two times up for the Dodgers, who won the best-of-five playoff 3-1. \n2014 — The St. Louis Cardinals tagged Clayton Kershaw in the seventh inning for the second straight time, riding Matt Adams’ go-ahead, three-run homer to a 3-2 victory over the Los Angeles Dodgers and a fourth straight trip to the NL Championship Series. \n2014 — Joe Panik scored the go-ahead run in the seventh inning on Aaron Barrett’s bases-loaded wild pitch, and the San Francisco Giants beat the Washington Nationals 3-2 to advance to the NL Championship Series. \nToday’s birthdays: Mookie Betts 23; Mike Foltynewicz 24; Brandon Cunniff 27; Alex Cobb 28; Evan Longoria 30; Kris Medlen 30. Oct. 8 \n1908 — The Chicago Cubs won the NL pennant when Mordecai Brown beat Christy Mathewson 4-2 in the playoff of the disputed game Sept. 23 when Fred Merkle failed to touch second base. \n1929 — Howard Ehmke, a surprise starter for the Philadelphia Athletics, struck out 13 Chicago Cubs to win the opening game of the World Series 3-1. \n1956 — Don Larsen of the New York Yankees pitched the only perfect game in World Series history for a 2-0 triumph over the Brooklyn Dodgers. Sal Maglie, the opposing pitcher, gave up five hits. \n1961 — The Yankees’ Whitey Ford set a World Series record for consecutive scoreless innings by extending his streak to 32 innings in a 7-0 triumph over the Cincinnati Reds in Game 4. \n1973 — Rusty Staub’s two home runs powered the New York Mets to a 9-2 victory over the Cincinnati Reds and a 2-1 lead in the NLCS. Pete Rose of the Reds and Bud Harrelson of the Mets scuffled at second base in the fifth inning after Rose slid hard into the base. \n1986 — Mike Scott equaled a playoff record with 14 strikeouts and threw a five-hitter as the Houston Astros defeated the New York Mets 1-0 in the first game of the NLCS. Glenn Davis opened the second inning with a home run off Dwight Gooden. \n2000 — Bobby J. Jones pitched the sixth complete game one-hitter in postseason history as the Mets eliminated the Giants with a 4-0 win in Game 4 of their NL division series. It was the first one-hit shutout in the postseason since Boston’s Jim Lonborg beat St. Louis in the 1967 World Series. \n2010 — Rick Ankiel splashed a tiebreaking home run into McCovey Cove in the 11th inning, and Atlanta rallied from a late four-run deficit to beat San Francisco 5-4 in the NL Division Series. \n2011 — Chris Carpenter tossed a three-hitter to outpitch Roy Halladay in a duel for the ages and St. Louis edged the Philadelphia Phillies 1-0 in the deciding Game 5 of their NL playoff series. The wild-card Cardinals scored in the first inning when Rafael Furcal led off with a triple and Skip Schumaker followed with a double. \n2013 — Shane Victorino’s infield single snapped a seventh-inning tie and journeyman Craig Breslow gave Boston a huge boost out of the bullpen, sending the Red Sox into the AL championship series with a 3-1 victory over the Tampa Bay Rays. \nToday’s birthdays: Robbie Erlin 25; Taylor Featherston 26. Oct. 9 \n1910 — Nap Lajoie, in a batting race with Ty Cobb, collected eight hits for Cleveland in a season-ending doubleheader with the Browns. The hits were somewhat tainted, however, as St. Louis third baseman Red Corriden played back as Lajoie bunted safely six times. Regardless, Cobb was awarded the batting title by a fraction of a point. \n1916 — Babe Ruth outpitched Sherry Smith of the Brooklyn Dodgers as the Boston Red Sox won the longest World Series game, 2-1 in 14 innings. \n1928 — Babe Ruth hit three home runs in a World Series game for the second time in his career as the Yankees beat the St. Louis Cardinals 7-3. \n1934 — Dizzy Dean of St. Louis blanked the Detroit Tigers 11-0 in the seventh game of the World Series. \n1958 — Bob Turley of the Yankees pitched 6 2-3 scoreless innings in relief to beat the Milwaukee Braves 6-2 for the World Series title. New York became the first team since 1925 to win the World Series after being down 1-3. \n1977 — The New York Yankees rallied for three runs in the ninth inning to beat the Kansas City Royals 5-3 and take the American League pennant in the fifth game of the playoffs. \n1988 — The Oakland Athletics completed a four-game sweep in the ALCS by beating the Boston Red Sox 4-1. \n1996 — Bernie Williams homered in the 11th inning to give New York a 5-4 victory over Baltimore in Game 1 of the AL championship series. The Yankees got a lot of help from a fan when Jeff Maier, 12, created a game-tying homer by Derek Jeter in the eighth when he reached out and grabbed a ball that was about to be caught by Tony Tarasco. \n2005 — Chris Burke hit a home run in the bottom of the 18th inning and Roger Clemens pitched three scoreless innings of relief in Houston’s 7-6, series-ending victory over Atlanta in the NLDS. The longest postseason game in history took 5 hours, 50 minutes to complete. Atlanta’s Adam LaRoche and Houston’s Lance Berkman each hit grand slams, making it the first postseason game to feature two grand slams. \nToday’s birthdays: Jake Lamb 25; Starling Marte 27; Derek Holland 29; David Phelps 29. Oct. 10 \n1904 — Boston clinched the pennant on the last day of the season when Jack Chesbro of the New York Highlanders threw a wild pitch in the ninth to allow the winning run to score from third. \n1920 — The Cleveland Indians beat the Brooklyn Dodgers 8-1 in the fifth game of the World Series. For the Indians, Elmer Smith hit the first Series grand slam and Jim Bagby, the winner, hit the first Series homer by a pitcher. \n1924 — The Washington Senators won their only championship by defeating the Giants 4-3 in 12 innings. The winning run scored when a ball hit by Earl McNeely bounced over third baseman Fred Lindstrom’s head. \n1926 — Grover Alexander, 39, saved Game 7 and the World Series for the St. Louis Cardinals, fanning Tony Lazzeri with the bases loaded in the seventh inning and pitching 2 1-3 hitless innings. \n1957 — Lew Burdette’s third victory of the World Series, a 5-0 decision over the New York Yankees, gave the Milwaukee Braves the championship. \n1968 — Mickey Lolich won the World Series for the Detroit Tigers by defeating Bob Gibson and the St. Louis Cardinals 4-1 in Game 7. It was Lolich’s third win and came after the Tigers had lost three of the first four games. \n1980 — Kansas City’s George Brett hit an upper deck three-run homer off relief ace Goose Gossage to give the Kansas City Royals a 4-2 victory and a three-game sweep of New York Yankees in the ALCS. \n1987 — Jeffrey Leonard homered for the fourth straight game as the San Francisco Giants beat the St. Louis Cardinals 4-2, tying the NLCS at two games apiece. \n1990 — The Oakland Athletics swept the Boston Red Sox for the American League pennant and their third straight trip to the World Series with a 3-1 victory. MVP Dave Stewart won for the eighth straight time in head-to-head matchups with Roger Clemens, who was ejected in the second inning for arguing balls and strikes with umpire Terry Cooney. \n1999 — One night after winning their second postseason game in 20 tries, the Boston Red Sox made it two in a row in record style — shocking the Cleveland Indians 23-7 to force a deciding fifth game in their first-round AL playoff series. John Valentin had two homers, a double and seven RBIs as Boston scored the most runs in a postseason game. \n2011 — Albert Pujols had one of the biggest postseason nights of his career in Game 2 of the NL championship series, going 4 for 5 with a home run, three doubles and five RBIs as the St. Louis Cardinals beat the Milwaukee Brewers 12-3 to even the series at 1-1. \n2011 — Nelson Cruz hit the first game-ending grand slam in postseason history, lifting the Texas Rangers over the Detroit Tigers 7-3 in 11 innings for a 2-0 lead in the AL championship series. Cruz also hit a tying home run in the seventh inning. Cruz hit the first official game-ending grand slam. Robin Ventura sent a bases-loaded drive over the fence to finish a New York Mets victory against Atlanta in the 1999 NLCS, but was swarmed by teammates between first and second. Ventura never made it around the bases and was officially credited with an RBI single. His 15th-inning drive for a 4-3 Mets win in Game 5 became known as “the grand slam-single.” \n2012 — Raul Ibanez lined a ninth-inning home run while pinch hitting for slumping Alex Rodriguez, then hit a leadoff homer in the 12th, to give the New York Yankees a stunning 3-2 win over the Baltimore Orioles for a 2-1 lead in their AL division series. \n2012 — Seth Smith, Coco Crisp and the never-say-die Oakland Athletics forced a Game 5 of their AL division series against the Detroit Tigers with their most memorable comeback yet. Smith hit a game-tying two-run double off closer Jose Valverde in the ninth inning and Coco Crisp capped the comeback with a two-out RBI single as the A’s staved off elimination for a second straight night with a 4-3 victory in Game 4 of the ALDS. \n2013 — Justin Verlander pitched another Game 5 gem in Oakland while carrying a no-hit bid into the seventh inning, and Miguel Cabrera homered to lead the Detroit Tigers past the Athletics 3-0 and back into the AL championship series. \nToday’s birthdays: Kolten Wong 25; Shelby Miller 25; Jeurys Familia 26; Andrew McCutchen 29; Troy Tulowitzki 31; Brad Ziegler 36. \nEnd Adv", "external_links": [], "published": "2015-10-03T07:00:00.000+03:00", "crawled": "2015-10-03T08:49:03.988+03:00", "highlightTitle": ""}