{"organizations": [], "uuid": "cf37493aec3d1631f9f20ba89f2e9b2c3ee70a93", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.sky.com", "main_image": "http://media.skynews.com/media/images/generated/2015/10/23/425974/default/v2/rtr3f7f6-1-1600x900.jpg", "site_section": "http://news.sky.com/feeds/rss/entertainment.xml", "section_title": "Entertainment News - Latest Celebrity & Showbiz News | Sky News", "url": "http://news.sky.com/story/1575352/a-listers-take-to-stage-for-africa-charity", "country": "IL", "title": "A-Listers Take To Stage For Africa Charity", "performance_score": 2, "site": "sky.com", "participants_count": 1, "title_full": "A-Listers Take To Stage For Africa Charity", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T02:26:00.000+03:00", "replies_count": 0, "uuid": "cf37493aec3d1631f9f20ba89f2e9b2c3ee70a93"}, "author": "news.sky", "url": "http://news.sky.com/story/1575352/a-listers-take-to-stage-for-africa-charity", "ord_in_thread": 0, "title": "A-Listers Take To Stage For Africa Charity", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Danny Boyle is set to direct a host of celebrities for a one-off performance in aid of his African arts charity. The Oscar-winning director is taking the helm of the Children's Monologues at the Royal Court in London with Benedict Cumberbatch, James McAvoy and Nicole Kidman all appearing on stage.\nThey are raising money for Dramatic Need, a charity that works with vulnerable children in Rwanda and South Africa, and which uses the arts to address their needs.\nFor the Children's Monologues, 15 children from a poor township in South Africa were asked to recount their most memorable day.\nBenedict Cumberbatch will appear on stage to help support the charity\nThe stories were then dramatised and will be performed on Sunday night.\nAmber Sainsburys, who set up the charity, told Sky News the arts can play a valuable role in rehabilitating children who've had traumatic experiences.\n\"These children are carrying burdens that no child or adult should ever have to carry and it's very important that they find a way that they can adequately express these burdens or these issues,\" she said.\n\"So what Dramatic Need does is teach issue-based workshops that encourage children to talk about what they're going through and then express it in a way that others can understand what they're going through.\"\nJames McAvoy said he was persuaded to take part in the project because he was so moved by one of the stories.\nJames McAvoy says the drama is about therapy, rather than entertainment\n\"When you read the testimonies, that affects you and you feel a huge responsibility,\" he said.\n\"It was the one personal connection I had in reading that personal testimony and I think that's the thing that's really important about drama as therapy, not about drama as entertainment.\"\nMongi Mthombeni is an emerging South African playwright who dramatised the children's testimonies along with Sir David Hare, Neil LaBute, Laura Wade and Roy Williams.\n\"There are some very harrowing stories in South Africa,\" he said.\n\"South Africa does have a lot of people, it has a lot of trauma to get through, to deal with.\n\"The myths we tell ourselves, that's what drives people's lives and gives kids the power to create their own - it's the most powerful thing you can do.\"", "external_links": [], "published": "2015-10-24T02:26:00.000+03:00", "crawled": "2015-10-24T02:05:03.371+03:00", "highlightTitle": ""}