{"organizations": [], "uuid": "341299ef547fc48b2cdc5a493a28cf881728aaca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.naplesnews.com", "main_image": "http://mediaassets.naplesnews.com/photo/2015/10/14/buddyguy1_25214165_ver1.0_640_480.jpg", "site_section": "http://www.naplesnews.com/feeds/rssFeed?obfType=RSS_FEED&siteId=100108&categoryId=10008", "section_title": "Entertainment | NPDN", "url": "http://www.naplesnews.com/entertainment/music/review-buddy-guy-fuels-fort-myers-show-with-blues-power_10646834", "country": "US", "title": "Review: Buddy Guy fuels show with blues power", "performance_score": 0, "site": "naplesnews.com", "participants_count": 0, "title_full": "Review: Buddy Guy fuels show with blues power", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T16:15:00.000+03:00", "replies_count": 0, "uuid": "341299ef547fc48b2cdc5a493a28cf881728aaca"}, "author": "", "url": "http://www.naplesnews.com/entertainment/music/review-buddy-guy-fuels-fort-myers-show-with-blues-power_10646834", "ord_in_thread": 0, "title": "Review: Buddy Guy fuels show with blues power", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Next \nFORT MYERS, Fla. - Buddy Guy fuels Fort Myers show with blues power \nHe walked off the stage in Fort Myers, taking his guitar with him to join the audience. \nBuddy Guy — in his shimmering blue shirt with white polka dots, jeans and Puma shoes — surprised more than a few who filled the Barbara B. Mann Performing Arts Hall on Tuesday night. \nThe 79-year-old Louisiana native sang and strummed “Someone Else is Steppin’ In\" in the aisle, sat down in a seat to serenade fans nearby, got up, walked into the lobby and kept playing, and returned down the other main floor aisle. \n“I love everybody man, even if you don’t treat me right,” he told the crowd, who showered him with “We love you Buddy!” throughout his 100-minute show. \nWith the death in recent months of blues guitarist B.B. King, some would argue that Guy is now the greatest living blues guitarist. But why not argue that he was the greatest before King died? \nGuy, already in the Rock And Roll Hall of Fame, has influenced the likes of Eric Clapton, Jimi Hendrix, Jimmy Page, Keith Richards and others. \nHe paid homage to his “students,” picking up an acoustic guitar later in the show to strum a few lines from Cream’s “Strange Brew” and “Sunshine Of Your Love” (one of Clapton’s earlier bands) and used his teeth to play guitar like Hendrix often did. \nGuy kicked off the show at 9:30 p.m. with his trademark “Damn Right I’ve Got the Blues,” followed by his cover of the Muddy Waters song, “Louisiana Blues.” He skimmed past a few songs on previous concert set lists, performing his rendition of the Willie Dixon song “I’m Your Hoochie Coochie,” followed by Muddy Waters’“She’s Nineteen Years Old.” \n“As I said when I get home, they don’t play this on the radio,” Guy said, “but if you need it, call me.” \nGuy was playful and engaging the entire show, dropping a few f-bombs. In fact, Guy said, he never began using profanity in songs until hip-hop artists got away with it in the late 1980s, early ‘90s. \nAs the crowd screamed and clapped for more — and some annoyingly shouting out during times Guy was talking — he acknowledged that his fans wanted his best. \n“I’m enjoying myself more than you, because I’m like, ‘Oh (expletive), now I got to give it to them,” he said. \nGuy broke out some of his own stuff, such as the title track of his recently released album, “Born to Play Guitar.” \n“I taught myself to play guitar,” he said. “And my parents didn’t even have a radio.” \nGuy told of how his home never had running water Lettsworth, Louisiana, as a kid, so they drank water from a nearby creek. \n“And guess what? It must have been all right because I’m still around,” he said as the crowd applauded. \nGuy departed from previous shows, treating the audience to John Lee Hooker’s “Boom! Boom!” and even singing Ray Charles’“What’d I Say.” \nA stagehand reminded Guy about an 11 p.m. “curfew,” the bluesman chuckled, because you had the feeling he wasn’t done. \n“I hope you play all night!” yelled out a man in the audience. \nEarlier in the evening, blues vocalist Shemekia Copeland opened and performed for about an hour. The daughter of Texas blues guitarist Johnny Copeland, the Harlem-born singer belted out her hits including “Somebody Else’s Jesus” and “Pie In The Sky.” \nCopeland, 36, dressed in a short black dress and black-and-white blazer, also had game. \n“This girl’s going to do some country for you,” she said. \nCopeland then launched into some fun with her “Drivin’ Out of Nashville,” singing lyrics such as “Country music ain’t nothing but the blues with a twang” and “I’m driving out of Nashville with a body in the trunk/Thinking of the depths I have sunk.” \n“That is so silly,” she proclaimed. \nThe highlight of her show arrived near the end of her set, belting out “Ghetto Child” in honor of her father, who died in 1997 at age 60, away from the microphone. \n“I’m just a ghetto child, in this so-called free land,” she sang, bringing the crowd (and some to tears) to its feet. Copyright 2015 Journal Media Group. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.", "external_links": [], "published": "2015-10-14T16:15:00.000+03:00", "crawled": "2015-10-14T16:38:06.967+03:00", "highlightTitle": ""}