{"organizations": [], "uuid": "6a77de0843bc141dd83ee76a784eb59c85e4a91f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.huffingtonpost.co.uk", "main_image": "http://i.huffpost.com/gen/3526544/images/o-DOWNTON-ABBEY-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/uk-entertainment/index.xml", "section_title": "UK Entertainment - The Huffington Post", "url": "http://www.huffingtonpost.co.uk/2015/10/11/downton-abbey-episode-4_n_8277614.html", "country": "US", "title": "Downton Abbey: The 15 Best Lines From Series 6, Episode 4 As Lady Mary Flirts With New Romance, Robert Has A Twinge", "performance_score": 0, "site": "huffingtonpost.co.uk", "participants_count": 1, "title_full": "Downton Abbey: The 15 Best Lines From Series 6, Episode 4 As Lady Mary Flirts With New Romance, Robert Has A Twinge", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T00:26:00.000+03:00", "replies_count": 0, "uuid": "6a77de0843bc141dd83ee76a784eb59c85e4a91f"}, "author": "Caroline Frost", "url": "http://www.huffingtonpost.co.uk/2015/10/11/downton-abbey-episode-4_n_8277614.html", "ord_in_thread": 0, "title": "Downton Abbey: The 15 Best Lines From Series 6, Episode 4 As Lady Mary Flirts With New Romance, Robert Has A Twinge", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Previous Story Next Story Downton Abbey: The 15 Best Lines From Series 6, Episode 4 As Lady Mary Flirts With New Romance, Robert Has A Twinge The Huffington Post UK | By Caroline Frost reddit \nOh dear, this last series of 'Downton Abbey' is quite ably vindicating writer Julian Fellowes' decision to leave before he was pushed. A few decent plot lines - the Carsons' transition to married life, Barrow's unease, Baxter's murky past catching up with her again - keep being swallowed up by interminable nods to those times, they are a-changing, while that hospital is surely going to be turned into flats long before those sparring women put down their handbags… \nAnd yes, we did notice Robert have another twinge, and for once it wasn't because of his too-tight tux. Hope that local hospital has got the benefit of nationalised state-funded resources by the time they wheel him in… \nThis week's best lines… \n\"She says it's just to see us, but I'm sure she wants to get stuck into the row about the hospital.\" If she does, Edith, Aunt Rosamund must surely be the only one… \nRobert Crawley has had another twinge - should we worry? Four episodes to go... \n\"Makes a nice change.\" Angelic Anna shows her other side when it turns out the only copper in the county has for once come to see someone else with a murky past \n“We could’ve managed something a little better than Scarborough.” You really are all heart, Lady Mary. \n\"All that's needed for evil to triumph is for good men to do nothing.\" Molesley's wisdom and learning once again begs the question, WHY is he of all people stuck downstairs? \n\"They're too heavy for Anna to lift.\" Thoughtful Lady Mary, making sure Bates does a double journey with the cases, because, goodness knows, there's no one else in the room that could pick up a handle. \nThe beginning of married life for Mr and Mrs Carson, having returned from... Scarborough? \n\"Are you here to help or hinder?\" Oh god, now the dowager's called in reinforcements. Will the last episode of this fine series surely not be the drum-roll moment when we discover whether the local hospital is to have state-controlled authorities? Even with the Dowager's passionate conservative (small C?) manifesto, this can't be the biggest story we have to look forward to? Come on!!! \n\"I like the sound of him… self-made, clever, successful.\" All the qualities you'd want in a new face at the dinner table. \n\"You couldn't be harder on those potatoes if you wanted them to confess to spying.\" A proverb that strangely failed to make it out of Mrs Padmore's kitchen and into common parlance \n\"What sort of Talbot is he? A Shrewsbury, but nowhere near the earldom.\" This is a strange combination of nouns and articles, but somehow this shameless snobbery is more bearable than Edith's new idea for her magazine., a women editor. She doesn't really, she just hadn't mentioned her hobby horse for nearly a whole episode. \n\"Mary needs more than a handsome smile and a hand on the gearstick.\" As when Margaret Thatcher told us everyone needs a Willy, it's impossible to tell if the Dowager knows how naughty she's being. \n\"Would it be terribly common if I gave you my card?\" \"Fairly common.\" I dislike both of these people very much. \n\"Not that pain again?\" Things are NOT looking good for Robert, especially after all that talk of dear, departed Sybil at the dinner table. \n\"I knew I'd seen your face.\" Some nimble footwork by Lady Mary, somehow making it visitor Gwen Harding's fault that none of them upstairs even recognised one of their own household. \n\"You worked here for two years, and we never spoke to you. We're the ones in the wrong.\" That's more like it. Give that woman a magazine. \n\"Something medical, I'm not in any danger. I'll be back in a day or two.\" And with that Mary turned on her heel and left, safe in the knowledge that she was leaving behind a bunch of people less than curious, ie just as self-obsessed as her. \n\"I'd like to take this opportunity to settle the matter of Yew Tree Farm.\" \n'Downton Abbey' continues on ITV. Close   Michelle Dockery arrives for theÂ BAFTA Celebrates Downton Abbey event in London, Tuesday, Aug. 11, 2015. (Photo by Jonathan Short/Invision/AP) Lily James arrives for theÂ BAFTA Celebrates Downton Abbey event in London, Tuesday, Aug. 11, 2015. (Photo by Jonathan Short/Invision/AP) Elizabeth McGovern arrives for theÂ BAFTA Celebrates Downton Abbey event in London, Tuesday, Aug. 11, 2015. (Photo by Jonathan Short/Invision/AP) Phyllis Logan arrives for theÂ BAFTA Celebrates Downton Abbey event in London, Tuesday, Aug. 11, 2015. (Photo by Jonathan Short/Invision/AP) Joanne Froggatt arrives for theÂ BAFTA Celebrates Downton Abbey event in London, Tuesday, Aug. 11, 2015. (Photo by Jonathan Short/Invision/AP) Laura Carmichael arrives for theÂ BAFTA Celebrates Downton Abbey event in London, Tuesday, Aug. 11, 2015. (Photo by Jonathan Short/Invision/AP) Daisy Lewis arrives for theÂ BAFTA Celebrates Downton Abbey event in London, Tuesday, Aug. 11, 2015. (Photo by Jonathan Short/Invision/AP) Zoe Boyle arrives for theÂ BAFTA Celebrates Downton Abbey event in London, Tuesday, Aug. 11, 2015. (Photo by Jonathan Short/Invision/AP) Lily James arrives for theÂ BAFTA Celebrates Downton Abbey event in London, Tuesday, Aug. 11, 2015. (Photo by Jonathan Short/Invision/AP) Samantha Bond arrives for theÂ BAFTA Celebrates Downton Abbey event in London, Tuesday, Aug. 11, 2015. (Photo by Jonathan Short/Invision/AP) Joanne Froggatt arrives for theÂ BAFTA Celebrates Downton Abbey event in London, Tuesday, Aug. 11, 2015. (Photo by Jonathan Short/Invision/AP) Penelope Wilton arrives for theÂ BAFTA Celebrates Downton Abbey event in London, Tuesday, Aug. 11, 2015. (Photo by Jonathan Short/Invision/AP) Dan Stevens arrives for theÂ BAFTA Celebrates Downton Abbey event in London, Tuesday, Aug. 11, 2015. (Photo by Jonathan Short/Invision/AP) From left, British actresses Laura Carmichael and Michelle Dockery arrive for theÂ BAFTA Celebrates Downton Abbey event at a central venue, London, Tuesday, Aug. 11, 2015. (Photo by Jonathan Short/Invision/AP) British actor Hugh Bonneville and Lulu Williams arrive for theÂ BAFTA Celebrates Downton Abbey event at a central venue, London, Tuesday, Aug. 11, 2015. (Photo by Jonathan Short/Invision/AP) Joanne Froggatt arrives for theÂ BAFTA Celebrates Downton Abbey event at a central venue, London, Tuesday, Aug. 11, 2015. (Photo by Jonathan Short/Invision/AP) Julie Walters arrives for theÂ BAFTA Celebrates Downton Abbey event at a central venue, London, Tuesday, Aug. 11, 2015. (Photo by Jonathan Short/Invision/AP) Sophie McShera arrives for theÂ BAFTA Celebrates Downton Abbey event at a central venue, London, Tuesday, Aug. 11, 2015. (Photo by Jonathan Short/Invision/AP) Sophie McShera arrives for theÂ BAFTA Celebrates Downton Abbey event at a central venue, London, Tuesday, Aug. 11, 2015. (Photo by Jonathan Short/Invision/AP) Julie Walters arrives for theÂ BAFTA Celebrates Downton Abbey event at a central venue, London, Tuesday, Aug. 11, 2015. (Photo by Jonathan Short/Invision/AP) Phyllis Logan arrives for theÂ BAFTA Celebrates Downton Abbey event at a central venue, London, Tuesday, Aug. 11, 2015. (Photo by Jonathan Short/Invision/AP) Raquel Cassidy arrives for theÂ BAFTA Celebrates Downton Abbey event at a central venue, London, Tuesday, Aug. 11, 2015. (Photo by Jonathan Short/Invision/AP) Jonathan Ross arrives for theÂ BAFTA Celebrates Downton Abbey event at a central venue, London, Tuesday, Aug. 11, 2015. (Photo by Jonathan Short/Invision/AP) Zoe Boyle arrives for theÂ BAFTA Celebrates Downton Abbey event at a central venue, London, Tuesday, Aug. 11, 2015. (Photo by Jonathan Short/Invision/AP) Lily James arrives for theÂ BAFTA Celebrates Downton Abbey event at a central venue, London, Tuesday, Aug. 11, 2015. (Photo by Jonathan Short/Invision/AP) Lily James arrives for theÂ BAFTA Celebrates Downton Abbey event at a central venue, London, Tuesday, Aug. 11, 2015. (Photo by Jonathan Short/Invision/AP) Daisy Lewis arrives for theÂ BAFTA Celebrates Downton Abbey event at a central venue, London, Tuesday, Aug. 11, 2015. (Photo by Jonathan Short/Invision/AP) Hugh Bonneville and Lulu Williams arrive for theÂ BAFTA Celebrates Downton Abbey event at a central venue, London, Tuesday, Aug. 11, 2015. (Photo by Jonathan Short/Invision/AP) RICHMOND, ENGLAND - AUGUST 11: Sophie McShera attends as BAFTA celebrate 'Downton Abbey' at Richmond Theatre on August 11, 2015 in Richmond, England. (Photo by Danny Martindale/WireImage) Hugh Bonneville and Lulu Williams arrive for theÂ BAFTA Celebrates Downton Abbey event at a central venue, London, Tuesday, Aug. 11, 2015. (Photo by Jonathan Short/Invision/AP) RICHMOND, ENGLAND - AUGUST 11: James Faulkner and wife attends as BAFTA celebrate 'Downton Abbey' at Richmond Theatre on August 11, 2015 in Richmond, England. (Photo by Danny Martindale/WireImage) RICHMOND, ENGLAND - AUGUST 11: Phyllis Logan attends as BAFTA celebrate 'Downton Abbey' at Richmond Theatre on August 11, 2015 in Richmond, England. (Photo by Danny Martindale/WireImage) RICHMOND, ENGLAND - AUGUST 11: (L-R) Laura Carmichael and Michelle Dockery attends as BAFTA celebrate 'Downton Abbey' at Richmond Theatre on August 11, 2015 in Richmond, England. (Photo by Danny Martindale/WireImage) RICHMOND, ENGLAND - AUGUST 11: Myanna Buring attends as BAFTA celebrate 'Downton Abbey' at Richmond Theatre on August 11, 2015 in Richmond, England. (Photo by Danny Martindale/WireImage) RICHMOND, ENGLAND - AUGUST 11: (L-R) Fifi Ward and Allen Leech attends as BAFTA celebrate 'Downton Abbey' at Richmond Theatre on August 11, 2015 in Richmond, England. (Photo by Danny Martindale/WireImage) RICHMOND, ENGLAND - AUGUST 11: Rebecca Night and Harry Hadden-Paton attends as BAFTA celebrate 'Downton Abbey' at Richmond Theatre on August 11, 2015 in Richmond, England. (Photo by Danny Martindale/WireImage) RICHMOND, ENGLAND - AUGUST 11: Laura Carmichael attends as BAFTA celebrate 'Downton Abbey' at Richmond Theatre on August 11, 2015 in Richmond, England. (Photo by Danny Martindale/WireImage) RICHMOND, ENGLAND - AUGUST 11: David Robb attends as BAFTA celebrate 'Downton Abbey' at Richmond Theatre on August 11, 2015 in Richmond, England. (Photo by Danny Martindale/WireImage) RICHMOND, ENGLAND - AUGUST 11: Rebecca Night and Harry Hadden-Paton attends as BAFTA celebrate 'Downton Abbey' at Richmond Theatre on August 11, 2015 in Richmond, England. (Photo by Danny Martindale/WireImage) RICHMOND, ENGLAND - AUGUST 11: Zoe Boyle attends as BAFTA celebrate 'Downton Abbey' at Richmond Theatre on August 11, 2015 in Richmond, England. (Photo by Danny Martindale/WireImage) RICHMOND, ENGLAND - AUGUST 11: Julian Fellowes attends as BAFTA celebrate 'Downton Abbey' at Richmond Theatre on August 11, 2015 in Richmond, England. (Photo by Danny Martindale/WireImage) RICHMOND, ENGLAND - AUGUST 11: Julian Fellowes and Emma Joy Kitchener attends as BAFTA celebrate 'Downton Abbey' at Richmond Theatre on August 11, 2015 in Richmond, England. (Photo by Danny Martindale/WireImage) RICHMOND, ENGLAND - AUGUST 11: Dan Stevens attends as BAFTA celebrate 'Downton Abbey' at Richmond Theatre on August 11, 2015 in Richmond, England. (Photo by Danny Martindale/WireImage) RICHMOND, ENGLAND - AUGUST 11: Julian Fellowes attends as BAFTA celebrate 'Downton Abbey' at Richmond Theatre on August 11, 2015 in Richmond, England. (Photo by Danny Martindale/WireImage) RICHMOND, ENGLAND - AUGUST 11: Jim Carter attends as BAFTA celebrate 'Downton Abbey' at Richmond Theatre on August 11, 2015 in Richmond, England. (Photo by Danny Martindale/WireImage) RICHMOND, ENGLAND - AUGUST 11: Lily James attends as BAFTA celebrate 'Downton Abbey' at Richmond Theatre on August 11, 2015 in Richmond, England. (Photo by Danny Martindale/WireImage) RICHMOND, ENGLAND - AUGUST 11: Lily James attends as BAFTA celebrate 'Downton Abbey' at Richmond Theatre on August 11, 2015 in Richmond, England. (Photo by Danny Martindale/WireImage) RICHMOND, ENGLAND - AUGUST 11: Dan Stevens attends as BAFTA celebrate 'Downton Abbey' at Richmond Theatre on August 11, 2015 in Richmond, England. (Photo by Danny Martindale/WireImage) RICHMOND, ENGLAND - AUGUST 11: Lesley Nicol attends as BAFTA celebrate 'Downton Abbey' at Richmond Theatre on August 11, 2015 in Richmond, England. (Photo by Danny Martindale/WireImage) RICHMOND, ENGLAND - AUGUST 11: Jim Carter attends as BAFTA celebrate 'Downton Abbey' at Richmond Theatre on August 11, 2015 in Richmond, England. (Photo by Danny Martindale/WireImage) Laura Carmichael and Michelle Dockery arrive at the BAFTA Downton Abbey Celebration at the Richmond Theatre - London Brendan Coyle and Joy Harrison arrive at the BAFTA Downton Abbey Celebration at the Richmond Theatre - London Brendan Coyle and Joy Harrison arrive at the BAFTA Downton Abbey Celebration at the Richmond Theatre - London Dame Maggie Smith arrives at the BAFTA Downton Abbey Celebration at the Richmond Theatre - London Raquel Cassidy shields Fifi Hart from the rain whilst arriving at the BAFTA Downton Abbey Celebration at the Richmond Theatre - London  Share", "external_links": [], "published": "2015-10-12T00:26:00.000+03:00", "crawled": "2015-10-12T00:35:44.245+03:00", "highlightTitle": ""}