{"organizations": [], "uuid": "ca9d32185d505250d3c746a7b78012ebc45cf74d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "savannahnow.com", "main_image": "http://savannahnow.com/sites/default/files/images/sms-default-facebook-share.jpg", "site_section": "http://savannahnow.com/", "section_title": "savannahnow.com | Savannah Georgia's source for News, Entertainment, Sports, Weather, Classifieds, Jobs, Autos, Real Estate and St. Patricks Day", "url": "http://savannahnow.com/accent/2015-10-17/jane-fishman-taking-long-road-miami", "country": "US", "title": "Jane Fishman: Taking the long road to Miami", "performance_score": 0, "site": "savannahnow.com", "participants_count": 1, "title_full": "Jane Fishman: Taking the long road to Miami | savannahnow.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T18:41:00.000+03:00", "replies_count": 0, "uuid": "ca9d32185d505250d3c746a7b78012ebc45cf74d"}, "author": "Jane Fishman", "url": "http://savannahnow.com/accent/2015-10-17/jane-fishman-taking-long-road-miami", "ord_in_thread": 0, "title": "Jane Fishman: Taking the long road to Miami", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Jane Fishman\nPlanning on driving to Miami, are you?\nWant the good news first or the bad?\nToo late. Here’s the bad news: Everything will be fine for the first eight hours. You’ll cruise along, la la la, deep into your book on tape. We were listening to “The Girl on the Train,” which, I’m not sure how this happened, we finished four days later just as we pulled up to our Savannah house.\nEverything off the highway looks like a strip mall. If you’re lucky you might find a vendor with fresh fruit and/or veggie smoothies. You’ll pass some 900 new palm trees held in place by stakes, probably planted by the state of Florida after some earlier boneheaded administration okayed the request by a developer to remove the original 900 palm trees before thinking, “Hey, palm trees might look good here; let’s plant some.” You’ll see a hill and think for a minute maybe you took a wrong turn because Florida is so flat, but then you’ll see the buzzards and realize it’s not a hill but a beautifully landscaped landfill.\nYou’ll believe your GPS. “In three miles, take the first right turn; destination is ahead” and think, “That wasn’t such a bad drive.” Then you realize someone in the computing cloud world didn’t get the message. Someone in the front office didn’t know that three lanes of traffic on I-95 were about to merge into one. The exit you’ve been looking for is closed so you have to follow a series of detour signs. These detour signs put you close to 79th street, somewhere west of Biscayne Boulevard, except you want to be on the east side.\nLater on you learn this is Liberty City. “Don’t go there,” your friend Julio says. But you’re already there and the GPS is stumped (“Make a U-turn. You’re in unverified territory”). You turn to your brain to find the numbered street you need. With steam coming out of both ears you sputter, “How do people live this way?”\nYou kind of wonder the same thing the next day when bingo you find a perfect parking spot in front of the Rubell Family Collection in Wynwood where you’re going to see some cool contemporary art. But that’s before you look up and read the fine print on the sign. Miami, oh-so-au-courant, is all about a cashless, mobile PayByPhone system. In Miami there are no meter maids to beg, cajole, implore. There are no meters. In Miami, you buy your time online. God help you if you don’t have a smartphone. The system even texts to remind you your time is almost up and do you want to put some more money on your credit card?\nWe follow the prompts, lock up the car and walk past the coolest, most outrageous walls of graffiti in the world only to see the museum is closed for the day. Errgh.\nBy this time we’ve moved into the good news column, starting and maybe ending with the air. It hits the minute you leave your car; the perfumed, fragrant, unmistakable smell of South Florida. It’s ambrosia. The street is quiet so you walk a ways to stretch your legs. But you are careful. You look where you are going. Otherwise you might trip on a pair of coconuts, a frangipani limb (with blooms) or a cluster of tough seagrape leaves. They litter the street.\nThen you walk up to a sweet Airbnb offered by a young couple trying to make a few bucks. The following day they will text to make sure everything is alright. How many times does someone from a hotel do that? By then you’ve seen papaya fruit and starfruit on a neighbor’s tree. You’ve heard a rooster. You’ve passed a bush of fragrant Cuban oregano and some bushy cranberry hibiscus, which I just happened to snag in our fall plant swap.\nBy this time you’ve had a shot of Cuban coffee and a sweet plantain omelet at Enriqueta’s, one of a million Cuban restaurants to choose from. You’ve found your way down Biscayne Boulevard to Magnum, an epic piano bar and restaurant, all red and black with cushy booths, subtle servers and a singer who must have retired in Miami after Broadway days in New York.\nIt was in the bar, listening to songs like “Mr. Sandman,” “What’s New, Pussycat?” and “Whatever Lola Wants Lola Gets” that I started thinking about my grandparents, long gone, who would drive on the tiniest of roads from Michigan to Miami Beach with my mother and her four siblings in the car. Must have taken forever. Next time I think I’ll go that route.\nJane Fishman’s columns appear weekly in Accent. Contact her at gofish5@earthlink.net or call 912-484-3045.", "external_links": ["http://sav-cdn.com/sites/all/themes/savannahnow/images/blank.gif"], "published": "2015-10-17T18:41:00.000+03:00", "crawled": "2015-10-18T14:07:11.090+03:00", "highlightTitle": ""}