{"organizations": [], "uuid": "27cb5d13ba2b1764789afa56f264f3b9628bba29", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news24.com", "main_image": "http://graph.facebook.com/10227041841/picture", "site_section": "http://www.news24.com/", "section_title": "News24, South Africa's premier news source, provides breaking news on national, world, Africa, sport, entertainment, technology &amp; more. ", "url": "http://www.news24.com/MyNews24/Kindness-ripples-20151013", "country": "ZA", "title": "Kindness ripples", "performance_score": 0, "site": "news24.com", "participants_count": 1, "title_full": "Kindness ripples | News24", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T15:31:00.000+03:00", "replies_count": 0, "uuid": "27cb5d13ba2b1764789afa56f264f3b9628bba29"}, "author": "news24.com", "url": "http://www.news24.com/MyNews24/Kindness-ripples-20151013", "ord_in_thread": 0, "title": "Kindness ripples", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "“You have not lived today until you have done something for someone who can never repay you.” ? John Bunyan.\nAnthony Robbins ( a.k.a Tony Robbins ) normally tells a story that happened when he was eleven years old, which had a great impact his life and led him to do the kind of job that he does today, helping people to discover and unleash their potentials, and as well as feeding millions of people throughout the globe.\nHow did it all start?When Tony was only eleven years old, his family didn't have enough money to buy food at Thanksgiving. And at the same time his mother and father were fighting alot, as you would expect any couple to fight, if there's not enough money to put food on the table for the kids to eat. \"There was a knock at the door\" Tony says when he tells the story. \"I went to the door and there's this tall guy there with a giant box of food and a pan on the ground beside him with an uncooked turkey in it. He said, \"Can I speak to your father?\" I said, \"just one moment\". Tony went to fetch his father, who wasn't very happy when he saw the man standing on his door step, with a box of food on his hand and a pan of uncooked turkey next to him. I think he felt embarrassed or too proud to accept the gift from the man, then he decided to say this words to him \"We don't take charity.\", even they did.He tried to slam the door on the man's face, but the man wouldn't let him. \"The guy was a big guy, six foot plus and was very nice, but he put his foot in the door to stop it from shutting. He said, \"Sir, please, I'm just the delivery guy. Somebody knows that you're having a tough time and wanted you and your family to have a beautiful Thanksgiving.\" Tony recalls. But his father was still too proud, he tried to slam the door again and the delivery man wouldn't let him. According to Tony, the guy put a shoulder against the door and said to his father \"Look, Don't let your ego get in the way of your own family's well-being.\" The young Tony standing next to these two big men, he was nervous, he thought he was going to witness a fight or something between them, when his father finally took the food from the stranger and slammed the door behind him, and I doubt if he ever said thank you to the guy or nodded his head like guys normally do to show that they acknowledge what you have done. Anyway none of that matter, the man did what he felt led to do. Tony and his family went on and had a great thanksgiving. However that's not the only good thing that happened that day. With that small act of kindness, little did the stranger knew that he was planting seeds of hope and kindness in little Tony's heart. That experience made a big difference in his life.In his own words this is how he interpreted the whole thing \"people care\" and the second step, was for him to find a way to do the same thing for others. Six years later after that experience, Tony was feeding two families, he adopted the gentleman's style, he delivered food in this homes as a delivery guy, wearing jeans and a tshirt. He would put a little note inside the box that said \"This is from a family who loves you, who wants you to have a wonderful Thanksgiving. Someday if you can, do well enough to do this for one other family. With love. From a friend.\" That's how it all started, he started getting more families to feed every year, not only that, but he also got some of his friends to partner with him in this, to feed more families.\nTony, turned 55 years old early this year, and he and his organizations had fed more than half or million of people. But how did it start? By one small act of kindness from a stranger at Thanksgiving.\nSo my friend, can you imagine what would happen if all of us can stop thinking about ourselves for a minute and think about others, try to lift them up, like that gentleman did? Wouldn't the world be a better place?\n\"A small act of kindnes create and endless ripple.\"", "external_links": [], "published": "2015-10-13T15:31:00.000+03:00", "crawled": "2015-10-13T12:03:40.556+03:00", "highlightTitle": ""}