{"organizations": ["Associated Press"], "uuid": "4895b498ee51fb7c291eb6cc26b42ad7c3880625", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribtown.com", "main_image": "http://cdn1.tribtown.com/st_assets/images/the_tribune_sq.jpg", "site_section": "http://tribtown.com//feed/sec/7000", "section_title": "TribTown.com - Entertainment News", "url": "http://www.tribtown.com/view/story/68c5b1771e884d32a3f0c112659d28da/US--Book-Review-Strong-Light-of-Day", "country": "US", "title": "Review: Jon Land's 'Strong Light of Day' is suspenseful, fast-paced tale", "performance_score": 0, "site": "tribtown.com", "participants_count": 0, "title_full": "Review: Jon Land's 'Strong Light of Day' is suspenseful, fast-paced tale", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T17:41:00.000+03:00", "replies_count": 0, "uuid": "4895b498ee51fb7c291eb6cc26b42ad7c3880625"}, "author": "", "url": "http://www.tribtown.com/view/story/68c5b1771e884d32a3f0c112659d28da/US--Book-Review-Strong-Light-of-Day", "ord_in_thread": 0, "title": "Review: Jon Land's 'Strong Light of Day' is suspenseful, fast-paced tale", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["BRUCE DESILVA", "Jon Land"], "text": "Review: Jon Land's 'Strong Light of Day' is suspenseful, fast-paced tale By BRUCE DESILVA Associated Press   12, 2015 - 10:41 amLast Updated: October 12, 2015 - 10:41 am   \nPeople: \nEastern Europe (362) \n\"Strong Light of Day\" (Forge Books), by Jon Land \nEven in a genre devoted to action, violence and apocalyptic conspiracies, Jon Land's Caitlin Strong thrillers have often veered toward the extreme, but in \"Strong Light of Day,\" the seventh book in the series, the author has outdone himself. \nSomehow, he has packed all of this — and more — into 348 pages: arson, cattle rustling, child abuse, murders, environmental terrorism, flesh-devouring insects, full-immersion video games, a research center bombing, the vandalism of a church, the kidnapping of a bus full of high school students, a hurricane, a tornado, several gunfights, a plot to destroy the American economy and a related plot to restore the Soviet empire. \nThe characters include Russian spies and mobsters, a mad scientist who moonlights as a rodeo clown, a corrupt congressman, a psychic, a Homeland Security agent who cares more about his career than his duty and a war veteran who gets beaten to death with his own prosthetic leg. There's also a cameo appearance by Russian President Vladimir Putin. \nAt the center of it all, of course, is Caitlin Strong, a quick-on-the-draw fifth-generation Texas Ranger who once again comes off as a cross between Wyatt Earp and Wonder Woman. Other characters returning from earlier books include Cort Wesley Masters, Caitlin's menacing ex-felon boyfriend; Guillermo Paz, a former South American death squad commander who's become Caitlin's guardian angel; and D.W. Tepper, her often exasperated commanding officer who complains that her cases \"are filed under either the impossible or the apocalypse.\" \nWhich is exactly so. \nThe result this time is a suspenseful, fast-paced tale apparently constructed by a writer so obsessed with James Bond movies, Stephen King novels, Clint Eastwood Westerns, Marvel Comics and \"The Matrix\" that he tried to combine all of them into a single book. Logic suggests there's no way this should work, but somehow it does, making \"Strong Light of Day\" at once preposterous and wildly entertaining. \nBruce DeSilva, winner of the Mystery Writers of America's Edgar Award, is the author of four crime novels including \"A Scourge of Vipers.\" \nOnline:", "external_links": [], "published": "2015-10-12T17:41:00.000+03:00", "crawled": "2015-10-13T02:50:16.061+03:00", "highlightTitle": ""}