{"organizations": [], "uuid": "6e3618500f4cd0a1689c5e9b62b49c827dae607b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailyherald.com", "main_image": "http://www.dailyherald.com/storyimage/DA/20151017/entlife/151019228/AR/0/AR-151019228.jpg&amp;updated=201510151425&amp;imageversion=Facebook&amp;exactH=630&amp;exactW=1200&amp;exactfit=crop&amp;noborder", "site_section": "http://www.dailyherald.com/rss/feed/?feed=entlife", "section_title": "DailyHerald.com &gt; Life &amp; Entertainment", "url": "http://www.dailyherald.com/article/20151017/entlife/151019228/", "country": "US", "title": "Author appearances: Loreen Niewenhuis discusses new book at 3 suburban REIs", "performance_score": 0, "site": "dailyherald.com", "participants_count": 1, "title_full": "Author appearances: Loreen Niewenhuis discusses new book at 3 suburban REIs", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T15:10:00.000+03:00", "replies_count": 0, "uuid": "6e3618500f4cd0a1689c5e9b62b49c827dae607b"}, "author": "Laura Milbrath Stewart", "url": "http://www.dailyherald.com/article/20151017/entlife/151019228/", "ord_in_thread": 0, "title": "Author appearances: Loreen Niewenhuis discusses new book at 3 suburban REIs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "• Meet New York Times best-selling author Alison McGhee as she discusses and signs copies of her new middle-grade title, \"Firefly Hollow,\" at 7 p.m. Monday, Oct. 19, at Anderson's Bookshop, 26 S. La Grange Road, La Grange. Priority numbers to hold a place in the signing line are available with the purchase of \"Firefly Hollow\" from Anderson's. (708) 582-6353 or andersonsbookshop.com .\n• Loreen Niewenhuis will present her newest title, \"A 1,000-Mile Great Lakes Island Adventure,\" at several suburban locations this week. Niewenhuis will discuss her exploration of various islands on the five great lakes and share photos and videos from her journey. Niewenhuis will speak at 7 p.m. Monday, Oct. 19, at the REI outdoor sports store, 888 Willow Road, Northbrook, (847) 480-1938; at 7 p.m. Tuesday, Oct. 20, at REI, 17W160 22nd St., Oakbrook Terrace, (630) 574-7700; and at 7 p.m. Wednesday, Oct. 21, at REI, 1209 E. Golf Road, Schaumburg, (847) 619-6729. For information, visit laketrek.com .\n• Jack Bishop of television's \"America's Test Kitchen\" signs copies of his book \"100 Recipes: The Absolute Best Ways to Make the True Essentials\" at 7 p.m. Thursday, Oct. 22, at Anderson's Bookshop, 123 W. Jefferson Ave., Naperville. Priority numbers to hold a place in the signing line are available with the purchase of Bishop's book from Anderson's. (630) 355-2665 or andersonsbookshop.com .\n• Dan Ephron discusses his book \"Killing a King: The Assassination of Yitzhak Rabin and the Remaking of Israel\" at 7 p.m. Tuesday, Oct. 20, at the Highland Park Public Library, 494 Laurel Ave., Highland Park. (847) 432-0216 or hplibrary.org .\n• Former NFL player Tim Green signs copies of his sports novel for middle-grade readers, \"Kid Owner,\" at 7 p.m. Tuesday, Oct. 20, at Anderson's Bookshop, 26 S. La Grange Road, La Grange. Priority numbers to hold a place in the signing line are available with the purchase of \"Kid Owner\" from Anderson's. (708) 582-6353 or andersonsbookshop.com .\n• Psychiatrist Ned Hallowell, author of \"The Childhood Roots of Adult Happiness,\" discusses his book in a program running from 10 a.m. to noon Wednesday, Oct. 21, at Lake Forest Country Day School, 145 S. Green Bay Road, Lake Forest. The event is free and open to the community. Register at Lake Forest Country Day School by calling (847) 234-2350.\n• Author Adam Rubin and illustrator Dan Salmieri discuss their new picture book, \"Robo-Sauce,\" at 4:30 p.m. Thursday, Oct. 22, at The Book Stall at Chestnut Court, 811 Elm St., Winnetka. This event is recommended for children ages 4-8. (847) 446-8880 or thebookstall.com .\n• \"Old Heart\" author Peter Ferry discusses his book at 6:30 p.m. Thursday, Oct. 22, at the Aspen Drive Library, 701 Aspen Drive, Vernon Hills. A book-signing follows the author's program. Books will be available for purchase, courtesy of the Lake Forest Book Store. To register, call (847) 362-2330 or visit webres.cooklib.org .\n• Poet, professional photographer and social media personality Tyler Knott Gregson introduces his newest title, \"All the Words are Yours,\" at 7 p.m. Thursday, Oct. 22, at the Madden Theatre, on the campus of North Central College, 171 E. Chicago Ave., Naperville. The event is sponsored by Anderson's Bookshop of Naperville. For information, call (630) 355-2665 or visit andersonsbookshop.com .\n• Nancy Sindelar will sign copies of her book \"Influencing Hemingway: People and Places That Shaped His Life and Work\" at 7 p.m. Thursday, Oct. 22, at the Wheaton Public Library, 225 N. Cross St., Wheaton. (630) 868-7520 or wheatonlibrary.org .\n• Pulitzer Prize-winning journalist Lucinda Franks discusses her best-selling book, \"Timeless: Love, Morgenthau, and Me,\" from noon to 2 p.m. Friday, Oct. 23, at Books-A-Million, 144 S. Clark St., Chicago. (312) 857-0613.\n• Dan Jones signs copies of his new book, \"Magna Carta,\" at 7 p.m. Friday, Oct. 23, at Anderson's Bookshop, 26 S. La Grange Road, La Grange. For a place in the signing line, purchase a copy of \"Magna Carta\" from Anderson's. (708) 582-6353 or andersonsbookshop.com .\n• Meet Patricia Skalka, author of \"Death at Gills Rock,\" her latest Dave Cubiak Door County mystery, as she discusses her book at 2 p.m. Saturday, Oct. 24, at the Warren Newport Public Library, 224 N. O'Plaine Road, Gurnee. Books will be available for purchase at the event. Register by calling (847) 244-5150 or at wnpl.info .\n Life & Entertainment Celebrity Literature", "external_links": ["https://twitter.com/share"], "published": "2015-10-17T15:10:00.000+03:00", "crawled": "2015-10-17T22:04:38.003+03:00", "highlightTitle": ""}