{"organizations": [], "uuid": "36f320dec6b73f3a5280c857c299cb6c9f0dc020", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mynews4.com", "main_image": "http://www.mynews4.com/media/lib/53/7/3/3/733e4b25-8022-4517-9d33-71b0befd8b20/Original.jpg", "site_section": "http://www.mynews4.com/rss/3305.rss", "section_title": "KRNV Entertainment News", "url": "http://www.mynews4.com/content/entertainment/story/Gallaghers-shop-hosts-Britpop-exhibition/93VwRTRx5kyuJS0uwv0JMA.cspx?rss=3305", "country": "US", "title": "Gallagher's shop hosts Britpop exhibition", "performance_score": 0, "site": "mynews4.com", "participants_count": 0, "title_full": "Gallagher's shop hosts Britpop exhibition", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T18:49:00.000+03:00", "replies_count": 0, "uuid": "36f320dec6b73f3a5280c857c299cb6c9f0dc020"}, "author": "", "url": "http://www.mynews4.com/content/entertainment/story/Gallaghers-shop-hosts-Britpop-exhibition/93VwRTRx5kyuJS0uwv0JMA.cspx?rss=3305", "ord_in_thread": 0, "title": "Gallagher's shop hosts Britpop exhibition", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Gallagher"], "text": "Share Updated: 8:50 am \nAn exhibition of classic British record covers from the 1990s is to open at Oasis star Liam Gallagher's clothes store. \nThe collection of work by photographer Brian Cannon, encompassing the era dubbed \"Britpop,\" will go on display at a branch of Pretty Green in Manchester, England from Friday. \nIt will feature the iconic covers that adorned the first two Oasis albums, as well as other well-known rock artwork from the era, including Suede single \"So Young\" and the band's album \"Dog Man Star,\" Super Furry Animals' first album \"Fuzzy Logic,\" and \"1977,\" the debut disc from Ash. \nOther Oasis covers in the exhibition include those for their singles \"All Around the World,\"\"Stand By Me,\"\"Cigarettes & Alcohol,\" and \"Some Might Say,\" which featured Cannon's parents in the image. \nSpeaking at the launch, Cannon recalled working with Oasis as they were on the cusp of superstardom, telling the Manchester Evening News, \"Nobody knew who they were back then but I think they genuinely did believe that they were something else, that they would be stratospherically big. \n\"Quality doesn't always guarantee success but they were just brilliant. They really were something else. I just felt it and I thought it would be a travesty if they didn't make it big... \n\"Don't believe everything you read about them. They were very enthusiastic and totally into it - not just the music but the artwork itself as well. I would have creative meetings with (guitarist) Noel (Gallagher), I'd give him some pointers and he'd come back with some ideas. I got him and he got me. Nothing ever got rejected or re-shot.\" \nThe exhibition, which will also feature other rarities including unseen photographs and several handwritten notes from the Verve rocker Richard Ashcroft, runs until the end of October. Copyright WENN.com", "external_links": [], "published": "2015-10-15T18:49:00.000+03:00", "crawled": "2015-10-15T21:13:12.540+03:00", "highlightTitle": ""}