{"organizations": [], "uuid": "f8b5657e87eb7c47d9ddd560ea2415ae449a3729", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.courier-journal.com", "main_image": "http://www.gannett-cdn.com/-mm-/3692c46b111b9feb252be39d6432bf7474025707/c=0-297-5039-3144&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/10/08/Louisville/Louisville/635799182255758014-10-Luna-Gale-2015-l-r-David-McElwee-Lexi-Lapp-Wendy-Rich-Stetson-Photo-Credit-by-Bill-Brymer.jpg", "site_section": "http://rssfeeds.courier-journal.com/courierjournal/entertainment", "section_title": "Courier Journal - Entertainment", "url": "http://www.courier-journal.com/story/entertainment/2015/10/09/review-luna-gale-actors-smart-drama/73541006/", "country": "US", "title": "Review | 'Luna Gale' at Actors is smart drama", "performance_score": 0, "site": "courier-journal.com", "participants_count": 0, "title_full": "Review | 'Luna Gale' at Actors is smart drama", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T21:01:00.000+03:00", "replies_count": 0, "uuid": "f8b5657e87eb7c47d9ddd560ea2415ae449a3729"}, "author": "", "url": "http://www.courier-journal.com/story/entertainment/2015/10/09/review-luna-gale-actors-smart-drama/73541006/", "ord_in_thread": 0, "title": "Review | 'Luna Gale' at Actors is smart drama", "locations": ["Louisville"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Lexi Lapp", "Rebecca Hart", "Emma Ramos", "David McElwee", "Caroline", "Wendy Stetson", "Wendy Rich Stetson", "Todd Lawson", "Bill Brymer", "Gregory Maupin", "Rebecca Gilman", "David McElwe", "Elizabeth Kramer", "Luna Gale"], "text": "Review | 'Luna Gale' at Actors is smart drama Elizabeth Kramer , @arts_bureau 2:01 p.m. EDT October 9, 2015 Gregory Maupin, Todd Lawson and Wendy Rich Stetson in Actors Theatre of Louisville's production of \"Luna Gale\" by Rebecca Gilman. Photo by Bill Brymer. Courtesy Actors Theatre of Louisville. David McElwee and Rebecca Hart in Actors Theatre of Louisville's production of \"Luna Gale\" by Rebecca Gilman. Photo by Bill Brymer. Courtesy Actors Theatre of Louisville. Wendy Rich Stetson, Gregory Maupin and Emma Ramos in Actors Theatre of Louisville's production of \"Luna Gale\" by Rebecca Gilman. Photo by Bill Brymer. Courtesy Actors Theatre of Louisville. Rebecca Hart and Wendy Rich Stetson in Actors Theatre of Louisville's production of \"Luna Gale\" by Rebecca Gilman. Photo by Bill Brymer. Courtesy Actors Theatre of Louisville. Lexi Lapp, David McElwee and Wendy Rich Stetson in Actors Theatre of Louisville's production of \"Luna Gale\" by Rebecca Gilman. Photo by Bill Brymer. Courtesy Actors Theatre of Louisville. Lexi Lapp and David McElwe in Actors Theatre of Louisville's production of \"Luna Gale\" by Rebecca Gilman. Photo by Bill Brymer. Courtesy Actors Theatre of Louisville. Lexi Lapp and David McElwe in Actors Theatre of Louisville's production of \"Luna Gale\" by Rebecca Gilman. Photo by Bill Brymer. Courtesy Actors Theatre of Louisville. Lexi Lapp and David McElwe in Actors Theatre of Louisville's production of \"Luna Gale\" by Rebecca Gilman. Photo by Bill Brymer. Courtesy Actors Theatre of Louisville. Emma Ramos and Wendy Rich Stetson in Actors Theatre of Louisville's production of \"Luna Gale\" by Rebecca Gilman. Photo by Bill Brymer. Courtesy Actors Theatre of Louisville. Lexi Lapp and David McElwee in Actors Theatre of Louisville's production of \"Luna Gale\" by Rebecca Gilman. Photo by Bill Brymer. Courtesy Actors Theatre of Louisville. Wendy Rich Stetson, David McElwee and Lexi Lapp in Actors Theatre of Louisville's production of \"Luna Gale\" by Rebecca Gilman. Photo by Bill Brymer. Courtesy Actors Theatre of Louisville. David McElwee, Lexi Lapp and Wendy Rich Stetson in Actors Theatre of Louisville's production of \"Luna Gale\" by Rebecca Gilman. Photo by Bill Brymer. Courtesy Actors Theatre of Louisville. David McElwee, Lexi Lapp and Wendy Rich Stetson in Actors Theatre of Louisville's production of \"Luna Gale\" by Rebecca Gilman. Photo by Bill Brymer. Courtesy Actors Theatre of Louisville. Lexi Lapp and Wendy Rich Stetson in Actors Theatre of Louisville's production of \"Luna Gale\" by Rebecca Gilman. Photo by Bill Brymer. Courtesy Actors Theatre of Louisville. David McElwee and Lexi Lapp in Actors Theatre of Louisville's production of \"Luna Gale\" by Rebecca Gilman. Photo by Bill Brymer. Courtesy Actors Theatre of Louisville. Wendy Rich Stetson and Emma Ramos in Actors Theatre of Louisville's production of \"Luna Gale\" by Rebecca Gilman. Photo by Bill Brymer. Courtesy Actors Theatre of Louisville. David McElwee and Lexi Lapp in rehearsal play young parents whose drug addiction leads them to lose their child in \"Luna Gale.\" Photo by Bill Brymer. Courtesy Actors Theatre of Louisville. Wendy Stetson, here in rehearsal, portrays Caroline, a social worker whose job includes deciding the fate of a baby of drug addicted parents in \"Luna Gale.\" Photo by Bill Brymer. Courtesy Actors Theatre of Louisville. Lexi Lapp plays a young mother whose drug addiction leads her to lose her child in \"Luna Gale.\" Photo by Bill Brymer. Courtesy Actors Theatre of Louisville. Like this topic? You may also like these photo galleries: Replay David McElwee, Lexi Lapp and Wendy Rich Stetson in Actors Theatre of Louisville's production of \"Luna Gale\" by Rebecca Gilman. (Photo: Photo by Bill Brymer. Courtesy Actors Theatre of Louisville.) 3 CONNECT 6 TWEET LINKEDIN COMMENT EMAIL MORE \nThe electronic, industrial-sounding music pounds in the dark for a minute or so until a stark and soulless fluorescent light illuminates the stage. This is a nearly barren hospital waiting room save for a young couple. While Peter, nearly comatose in his chair, is slumped over with eyes closed, Karlie is wide-eyed, jittery and clawing through their stash of sugary food in a bag. \nPeter is crashing from his earlier dose of crystal meth, while Karlie is still high as they wait for word on their baby only to be faced with a social worker and her questions. \nThis is just the beginning of playwright Rebecca Gilman’s engrossing play “Luna Gale” directed at Actors Theatre of Louisville by artistic director Les Waters. Gilman has woven a multi-layered story that follows Karlie (Lexi Lapp) and Peter (David McElwee) through their journey through the social service system to keep their baby named Luna Gale. Not long after learning of their struggle, Lexi’s mother and an evangelical Christian, Cindy (Rebecca Hart), endeavors to adopt the baby with help from her pastor, Jay (Tod Lawson). Parsons Dance promises 'a roller coaster ride' \nAt the center of the struggle to secure this baby’s future is Caroline (Wendy Rich Stetson), the social worker with decades of experience of working through the bureaucracy of child welfare system. With every scene comes the message that this is a relentless job that frequently requires working odd hours and takes an emotional toll. A few scenes even show her relationship with Lourdes, an 18-year-old who has aged-out of foster care and is starting college. \n“Do you ever stop working,” Lourdes asks Caroline. \nBut there seem to be few fruits to Caroline’s labor as the play touches on the reality of children going into foster homes and explores the power play at work in her office with her supervisor Cliff (Gregory Maupin). \nWhat drives the story, though, is Caroline’s determination to find a way for this baby to stay with her parents and to help them kick their drug habit. That begets questions about why they took up getting high in the first place and raises issues of possible sexual abuse. Vanessa Williams teams up with Louisville Orchestra \nWaters' direction of this solid cast helps keep the story moving at a swift clip so it plays out as a mystery unfolding and engenders compassion for all of the characters. Hart’s portrayal of Cindy takes an understated tact to give great depth to this woman wrestling with pain the best way she knows how. The same goes for McElwee’s Peter, a kind of lost boy who retains an endearing childlike sweetness. Ramos takes on the challenge of portraying Lourdes, a character in only two scenes, to show how complicated the emotions and path can be for a young adult without a foundation of family. \nAs Caroline, Wendy Rich Stetson seemly plows through many of her scenes and for most of the play shows a woman who is more reactionary than reflective. At times, her Caroline displays a feigned stoicism. \nAndrew Boyce’s set design and Matt Frey’s lighting help illustrate the fluent realities the characters deal with by having set pieces that rise from the stage floor and lower from the ceiling to conjure Caroline’s office and Cindy’s kitchen, among other sites. Fall theater season tackles modern issues \nBut always behind them is an austere wall resembling white porcelain brick creating a hallmark of institutional design. The brick wall denotes not only the hospital waiting room but various parts of the county courthouse and the visitation room at the department of human services. That room features a two-way mirror where from one side social worker and other officials can observe clients on the other. Over the course of the second act, that wall slides forward toward the audience to push this too often-ignored world figuratively into our laps. \nThis and so many other facets of this production create an experience that resonates emotionally and challenges audience members to face and grapple with these issue in their own communities. \n“Luna Gale” by Rebecca Gilman and directed by Les Waters runs at Actors Theatre of Louisville, 316 W Main St., in the Pamela Brown Auditorium, through Oct. 25. For more information, call (502) 584-1205 or visit actorstheatre.org. \nReach reporter Elizabeth Kramer at and ekramer@courier-journal.com. Follow her on Twitter @arts_bureau on Twitter and on Facebook at Elizabeth Kramer - Arts Writer. 3 CONNECT 6 TWEET LINKEDIN COMMENT EMAIL MORE Read or Share this story: http://cjky.it/1LlSmIK TOP VIDEOS", "external_links": [], "published": "2015-10-09T21:01:00.000+03:00", "crawled": "2015-10-09T23:25:32.794+03:00", "highlightTitle": ""}