{"organizations": [], "uuid": "06f9c75fe426a2ff12e2814c75a24d96df9ebb3a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.brandonsun.com", "main_image": "http://media.winnipegfreepress.com/images/CPT118303034_high.jpg", "site_section": "http://www.brandonsun.com/rss?path=/entertainment/breaking-news", "section_title": "Entertainment Breaking News", "url": "http://www.brandonsun.com/entertainment/breaking-news/paul-gross-tries-to-paint-clear-picture-of-afghan-conflict-with-hyena-road-331104931.html", "country": "US", "title": "Paul Gross tries to paint clear picture of Afghan conflict with 'Hyena Road'", "performance_score": 0, "site": "brandonsun.com", "participants_count": 0, "title_full": "Paul Gross tries to paint clear picture of Afghan conflict with 'Hyena Road'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T01:31:00.000+03:00", "replies_count": 0, "uuid": "06f9c75fe426a2ff12e2814c75a24d96df9ebb3a"}, "author": "", "url": "http://www.brandonsun.com/entertainment/breaking-news/paul-gross-tries-to-paint-clear-picture-of-afghan-conflict-with-hyena-road-331104931.html", "ord_in_thread": 0, "title": "Paul Gross tries to paint clear picture of Afghan conflict with 'Hyena Road'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Paul Gross", "Victoria Ahearn"], "text": "The Canadian Press - ONLINE EDITION Paul Gross tries to paint clear picture of Afghan conflict with 'Hyena Road' By: Victoria Ahearn, The Canadian Press Wednesday, Oct. 7, 2015 at 5:31 PM | Comments: 0 Enlarge Image \nDirector/actor Paul Gross poses for a photograph to promote his new film \"Hyena Road\" in Toronto on Thursday, August 20, 2015. Gross says he isn't trying to make a political statement with his new film \"Hyena Road,\" which shows the struggles of Canadian troops as well as locals in Afghanistan.THE CANADIAN PRESS/Nathan Denette \nTORONTO - Paul Gross says he isn't trying to make a political statement with his new film \"Hyena Road,\" which shows the struggles of Canadian troops as well as locals in Afghanistan. \nBut he doesn't think Canada is \"really clear\" about what it is that we did in Afghanistan after the fall of the Taliban in 2001, nor do we fully realize the complications and costs of sending troops into long-term military engagements. \nThat's why the actor-filmmaker made the film, which opens on Friday. \n\"These are our brothers and sisters and I think we need to know,\" Gross said in a recent interview. \n\"It's not that I have a political axe to grind. I don't even have an opinion about the mission. Whether we should or should not have been in Afghanistan I think is actually an almost impossible question to answer simply. \n\"But when we start having conversations about ISIS and the thought that we should perhaps send our soldiers into that, I think: 'We should know what we're asking them to do before we get them in there.'\" \nGross wrote, directed and stars in the intense drama as a veteran intelligence officer. Rossif Sutherland co-stars as a sniper who gets close to a colleague, played by Christine Horne, and Neamat Arghandabi portrays a mysterious Afghan elder who becomes involved with the troops. Co-stars include Allan Hawco and Clark Johnson. \nGross said he never thought he'd try to make another soldier film after his 2008 First World War drama \"Passchendaele,\" which won a slew of Canadian awards. \n\"War movies are really difficult. To start with, they're extremely expensive and the logistics of them are difficult. Niv Fichman, who is my partner/co-producer in this, he and I are probably the only people stupid enough in Canada to try them.\" \nThen he went to Afghanistan in 2010. \nDuring a visit with troops he was struck by the stories he heard, and so he returned with a camera team to photograph the region and speak with soldiers and locals at a forward operating base in Panjwayi. \nThat footage is woven throughout the film. \n\"I was just mesmerized by the complexity of it all,\" said the beloved star of \"Due South\" and \"Slings & Arrows.\" \n\"I've been in a lot of screwed up places but never in an active war zone. They're just bewilderingly complicated.\" \nFor Gross, it was also the first time he got a sense of what it was like for troops and locals in the area, about the \"impossible decisions\" they have to make. The government and press had never painted a clear picture of that, he said. \nWhen Gross returned to Canada, he realized he had \"probably enough to make a pretty good narrative about what it is we were doing there for so long.\" \n\"I felt an obligation to a lot of the guys that I spoke with — and strangely I felt an obligation to the Afghans I met — and I thought, 'They need to be included in this somehow' and I thought, 'Well, nobody else is maybe going to do it,'\" Gross recalled. \n\"You know how sometimes you come across something and you think, 'Well, I guess it falls to me to do this. I wouldn't have thought of doing it, but I suppose I have to.'\"", "external_links": [], "published": "2015-10-08T01:31:00.000+03:00", "crawled": "2015-10-08T01:41:20.791+03:00", "highlightTitle": ""}