{"organizations": ["HBO", "Harrison Ford"], "uuid": "2307ebc033b65b8e07d4cce2ace70d23f5d8d7b4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/151019223009-finn-star-wars-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_showbiz.rss", "section_title": "CNN.com - Entertainment", "url": "http://edition.cnn.com/2015/10/19/entertainment/star-wars-force-awakens-final-trailer-feat/index.html?eref=rss_showbiz", "country": "US", "title": "Final 'Star Wars' trailer is here: Fans react as tickets go fast", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Final 'Star Wars' trailer is here: Fans react as tickets go fast", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T20:23:00.000+03:00", "replies_count": 0, "uuid": "2307ebc033b65b8e07d4cce2ace70d23f5d8d7b4"}, "author": "", "url": "http://edition.cnn.com/2015/10/19/entertainment/star-wars-force-awakens-final-trailer-feat/index.html?eref=rss_showbiz", "ord_in_thread": 0, "title": "Final 'Star Wars' trailer is here: Fans react as tickets go fast", "locations": ["Tarth", "Fandango.com"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Llewyn Davis", "Krissi", "Peter Mayhew", "Domhnall Gleeson", "Anthony Daniels", "Kylo Ren", "Crystal Clarke", "Ridley", "Mark Hamill", "Abrams", "Bill Weasley", "Tim Turi", "John Boyega", "Daisy Ridley", "Lincoln", "J. Edgar", "Clarke", "Carrie Fisher", "Rey", "Andersen", "Hamill", "Daniels", "Warwick Davis", "Andy Serkis", "Pip Andersen", "Isaac", "Gleeson", "Boyega", "Gwendoline Christie", "J.J. Abrams", "Luke Skywalker", "Max von Sydow", "Kenny Baker", "Lupita Nyong", "Leia", "Brienne"], "text": "What did we learn from the new 'Star Wars' trailer? 01:11 Story highlights Final \"Star Wars\" trailer debuted during football on Monday night Like the previous trailers, fans raved about it (CNN) The latest trailer for \"Star Wars: The Force Awakens\" debuted on ESPN during this week's Monday night football game, perhaps the most anticipated halftime outside of a Super Bowl. 17 photos: Meet the faces of the new 'Star Wars' 17 photos: Meet the faces of the new 'Star Wars' The cast of \"Star Wars: Episode VII\" -- or should we say \"Star Wars: The Force Awakens\" -- unites well-known names with some up-and-coming actors.John Boyega is best known for the 2011 sci-fi action comedy \"Attack the Block,\" but now he's known as the guy who steals the spotlight in the \"Star Wars: The Force Awakens\" trailer. Boyega was long rumored to be a top choice for the lead role. Hide Caption 1 of 17 17 photos: Meet the faces of the new 'Star Wars' Daisy Ridley portrays the female lead of the movie, Rey, who is often accompanied by her droid BB-8, an early fan favorite. Hide Caption 2 of 17 17 photos: Meet the faces of the new 'Star Wars' Actors Pip Andersen, left, and Crystal Clarke were picked from an open casting call to join the movie. Andersen is skilled in the training discipline parkour, and \"The Force Awakens\" will be one of Clarke's first feature films. Hide Caption 3 of 17 17 photos: Meet the faces of the new 'Star Wars' The rumors about Academy Award-winning actress Lupita Nyong'o joining the cast turned out to be true. In May, she was announced as the newest actress to join the saga. Nyong'o won the best supporting actress Oscar for her breakthrough role in \"12 Years a Slave.\" Hide Caption 4 of 17 17 photos: Meet the faces of the new 'Star Wars' Gwendoline Christie, currently known as Brienne of Tarth on HBO's \"Game of Thrones,\" has also joined \"Star Wars.\" She will co-star in \"The Hunger Games: Mockingjay - Part 2\" as Commander Lyme. Hide Caption 5 of 17 17 photos: Meet the faces of the new 'Star Wars' Adam Driver is a multifaceted actor who'll presumably get to show more of his range in \"The Force Awakens.\" While he's best known for playing a quirky love interest on \"Girls,\" Driver has also appeared in feature films \"J. Edgar,\" \"Lincoln,\" \"Frances Ha\" and \"Inside Llewyn Davis.\" Hide Caption 6 of 17 17 photos: Meet the faces of the new 'Star Wars' Oscar Isaac had a breakthrough role in 2013 as the cranky singer-songwriter Llewyn Davis in the drama \"Inside Llewyn Davis.\" We can't imagine his work in \"The Force Awakens\" will require him to sing, but it would be awesome if it did; Isaac has proved he's got a great set of pipes. Hide Caption 7 of 17 17 photos: Meet the faces of the new 'Star Wars' Andy Serkis is setting himself up to have a busy few years. The celebrated actor recently appeared in \"Dawn of the Planet of the Apes,\" which will be followed by \"The Force Awakens.\" After that, he's expected to appear in another \"Tintin\" movie, \"The Adventures of Tintin: Prisoners of the Sun.\" Hide Caption 8 of 17 17 photos: Meet the faces of the new 'Star Wars' Does the name Domhnall Gleeson sound familiar? That might be because you remember him as Bill Weasley in the last two movies of the \"Harry Potter\" franchise. But Gleeson has established himself with a host of other projects, including 2010's \"Never Let Me Go\" and 2013's \"About Time.\" Suffice to say that if you don't know Gleeson by now, you will after \"Star Wars: Episode VII.\" Hide Caption 9 of 17 17 photos: Meet the faces of the new 'Star Wars' When we learned that the latest \"Star Wars\" installment is supposed to take place 30 years after \"Return of the Jedi\" and feature a trio of newbies alongside some familiar faces, we were ready to bet the house that Mark Hamill's Luke Skywalker would be one of the recognizable stars. It was an easy guess to make, though; Hamill has long been considered an unspoken done deal. Hide Caption 10 of 17 17 photos: Meet the faces of the new 'Star Wars' Carrie Fisher was one of the original \"Star Wars\" cast members who initially said she was on board for the new movie, only for her rep to backtrack and say the actress was kidding. But Abrams' announcement is no joke: The former Princess Leia has returned. Hide Caption 11 of 17 17 photos: Meet the faces of the new 'Star Wars' After playing coy with the press for months, Harrison Ford was finally officially announced as part of the \"Force Awakens\" cast. The actor will reprise his role of Han Solo. Hide Caption 12 of 17 17 photos: Meet the faces of the new 'Star Wars' We can't be the only ones who are supremely relieved to see that Anthony Daniels, the voice of C-3PO, will be back in action. Hide Caption 13 of 17 17 photos: Meet the faces of the new 'Star Wars' Obviously, you can't have Daniels' C-3PO without Kenny Baker's R2-D2. Just the thought of splitting up the droids is heartbreaking! Hide Caption 14 of 17 17 photos: Meet the faces of the new 'Star Wars' Peter Mayhew is probably somewhere warming up his voice for that famous Chewbacca roar. The actor was rumored to be reprising the character in \"The Force Awakens,\" but it wasn't official until Abrams' announcement. Hide Caption 15 of 17 17 photos: Meet the faces of the new 'Star Wars' Max von Sydow is one of the veteran actors joining the upcoming \"Star Wars\" movie. It isn't clear what the wide-ranging thespian will do in Abrams' picture, but we can rest assured that he'll bring his respected acting chops to the part. Hide Caption 16 of 17 17 photos: Meet the faces of the new 'Star Wars' \"Star Wars\" veteran Warwick Davis is set to return too. He's played multiple roles, but he's best known as Wicket the lead Ewok from \"Return of the Jedi,\" so we suspect he may reprise that role. Hide Caption 17 of 17 The trailer introduces us once again to Daisy Ridley's Rey and John Boyega's Finn, before kicking into high gear with glimpses of Han Solo, Chewbacca and Princess Leia, not to mention the evil Kylo Ren, space battles and all we're used to seeing from the best \"Star Wars\" movies. The film is set decades after \"Return of the Jedi.\" And as the trailer shows, the younger characters aren't sure the stories about the Jedi are real. Han assures them everything they've heard is true. Meanwhile, Kylo Ren is set on finishing what Darth Vader started (one would guess that means wiping out any vestiges of the Jedi at least). Director J.J. Abrams prefaced the trailer with a note to fans: \"I don't care if you're black, white, brown, Jawa, Wookiee, Jedi or Sith. I just hope you like it!\" — Bad Robot (@bad_robot) October 20, 2015 Read More Reaction was immediate on social media (just hours after there was a virtual run on tickets on sites like Fandango.com). Got our tickets for Star Wars! Now we must defend them until 12/17/15! We don't mess around... pic.twitter.com/I1C9vk9Pzd \"Rewound and watched that Star Wars trailer like 3 times,\" tweeted @KrissiBex. Rewound and watched that Star Wars trailer like 3 times 😍 — Krissi (@KrissiBex) October 20, 2015 \"So many little moments in that trailer have more life & more \"Star Wars\" than all of the prequels combined. Dear God...\" said someone using the Twitter handle @MysteryCr8tve. So many little moments in that trailer have more life & more \"Star Wars\" than all of the prequels combined. Dear God... — MC Rantz Hoseley (@MysteryCr8tve) October 20, 2015 Tim Turi tweeted, \"I was going to just hold off on watching the Star Wars trailer like a purist. Then I watched it. And now I've got a lump in my throat.\" I was going to just hold off on watching the Star Wars trailer like a purist. Then I watched it. And now I've got a lump in my throat. — Tim Turi (@timturi) October 20, 2015 https://www.youtube.com/embed/RNt1Ih_HHQM Like the other \"Force Awakens\" trailers, fans across the board raved about the trailer, which is sure to be dissected frame by frame in the hours to come. The reaction was so rapturous (combined with some frustration about ticket difficulties) that it was a very unique night to be a \"Star Wars\" fan, with many comparing it to the feelings they felt seeing the original trilogy. The Star Wars trailer just took me back to being 5 years old and watching the original Star Wars movies on VHS. Man I'm stoked.", "external_links": [], "published": "2015-10-20T20:23:00.000+03:00", "crawled": "2015-10-20T20:42:41.396+03:00", "highlightTitle": ""}