{"organizations": [], "uuid": "b24bdd1030e18c2e23e471c9fa494770216efc23", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.detroitnews.com", "main_image": "http://www.gannett-cdn.com/-mm-/6ad857ff3f471a9f423b391a57ab1297845aebf6/c=0-104-2000-1229&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/14/DetroitNews/B99310959Z.1_20151014193551_000_GFDK2HMK.1-0.jpg", "site_section": "https://feeds.feedblitz.com/detroit/entertainment#", "section_title": "Detroit News - Entertainment", "url": "http://www.detroitnews.com/story/entertainment/2015/10/14/wholesome-halloween/73958890/", "country": "US", "title": "Enjoy a wholesome Halloween", "performance_score": 0, "site": "detroitnews.com", "participants_count": 1, "title_full": "Enjoy a wholesome Halloween", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T22:35:00.000+03:00", "replies_count": 0, "uuid": "b24bdd1030e18c2e23e471c9fa494770216efc23"}, "author": "detroitnews.com", "url": "http://www.detroitnews.com/story/entertainment/2015/10/14/wholesome-halloween/73958890/", "ord_in_thread": 0, "title": "Enjoy a wholesome Halloween", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ghosts ride the carousel at Greenfield Village. (Photo: Kristina Sikora / Greenfield Village) \nIf you have children old enough to trick-or-treat for the first time, you might be beginning to wonder why even the youngest among us are more than delighted to indulge in a such morbid tradition as Halloween.\nFear not, for it’s a perfectly natural obsession, according to the master of modern horror, Stephen King.\n“We take refuge in make-believe terrors so the real ones don’t overwhelm us, freezing us in a place and making it impossible for us to function in our day-to-day lives,” King writes in “Danse Macabre,” his book of essays on the horror genre. “We go into the darkness of a movie theater hoping to dream badly, because the world of our normal lives looks ever so much better when the bad dream ends.”\nBut can daily life really be so stressful for our well-nurtured young that they still crave a grotesque masquerade to alleviate their anxieties? Well, answer this simple question: Did you ever have a teacher in grade school who was so cruel she prompted comparisons to the Wicked Witch of the West? I rest my case.\nThis is not to say we shouldn’t be careful about how we expose our children to spooky sights and sounds. Thankfully, Metro Detroit offers plenty of Halloween-themed events that welcome the entire family to dip their toes into the netherworld without the risk of having nightmares or requiring an expensive therapist. I’ll guide you through three of the best all-ages events in the area, but be warned: The last stop might really be haunted.\nFor the next two weekends, a mile-long stretch of Greenfield Village will become home to carousing witches and demons, a galloping headless horseman, and more than 1,000 freshly carved jack-o-lanterns. “Hallowe’en in Greenfield Village” is a historically themed journey through over a century of autumn traditions, and it’s designed specially for the young and the young at heart, says The Henry Ford’s senior manager of creative programs, Jim Johnson.\n“We have very consciously steered away from the shock and gore kind of stuff that over the past 30 years has risen as the standard Halloween experience,” Johnson says. “Ours is very G-rated. It can get kind of spooky, but it’s not going to terrorize anybody.”\nThis year Greenfield Village’s constantly evolving holiday program will introduce improved visual effects, sound and lighting, and a creepy sideshow inspired by Ray Bradbury’s “Something Wicked This Way Comes.”\n“What we’ve been working on this year is a representation of an early 20th century carnival kind of thing,” Johnson says. “The whole set suggests a small carnival that has stopped in a small town, and we have a local group that will be performing every night and doing an ongoing, rolling performance involving breathing fire, swallowing swords, contortionists, magicians, and things like that.”\nJohnson points out that although “Hallowe’en” does include a trick-or-treating trail, it’s designed as a device to move visitors through the park rather than to supply them with bucket loads of candy. Those with a nagging sweet tooth might fare better at the Detroit Zoo’s “Zoo Boo,” which is held Fridays, Saturdays and Sundays through Oct. 25.\n“We call it an annual ‘merry-not-scary’ Halloween celebration,” says Detroit Zoo marketing director Rick Friday. “It features a festively decorated half-mile trick-or-treat trail through the front of the zoo. We have pumpkin displays that line the trail, we have greeters that hand out goods, treat stations along the route, and on top of all that we have magicians, street performers, extreme pumpkin carving demonstrations, and a mini musical we do each year called the ‘Zoo Boo Revue.’”\nFriday says friendly witches, vampires and other monsters will hole up in the Holden Reptile Conservation Center. There will also be a craft tent for creating spooky ornaments, and more adventurous visitors can risk entering the ominously titled “Zombie Zone.”\nI promised a truly ghostly attraction for the whole family, and here it is: The Oakland County Pioneer and Historical Society (OCPHS) is hosting a tour of Pontiac’s historic Wisner Mansion. Visitors will be guided through the first floor of the of former governor’s home while they learn about Victorian funeral practices. But there’s a catch: Five members of the Wisner family perished inside the house in the late 19th and early 20th centuries.\n“Sorry, none of them were by murder,” society volunteer Barbara Frye laughs when asked about the deaths. Apparently all five family members passed away due to natural causes, but Frye believes the deceased might still have a presence on the premises.\nThe most tragic element of the house’s history is the death of Moses Wisner’s first wife, Eliza, who passed shortly after delivering their second child. Sadly, the newborn perished soon after.\n“There are things that go on in what is now the gift shop and kitchen area, which would have been where where Eliza and the baby died,” Frye says before describing her own spectral encounters. “Apparently there have been noises and things falling with no obvious reason. When I was closing up the house after a tour and I was in the bay window where we have a bust of Moses Wisner, a shade managed to get off of its braces and fall to the floor all the way at the other end of the house.”\nSpookier still is society board member Charles Martinez’s brush with the beyond.\n“He was cleaning up after a tour and he was in the formal parlor,” Frye recalls. “He turned around to see a relatively short woman in a long black skirt and a mauve colored blouse walking through the parlor. Everybody else was out of the house and there shouldn’t have been anybody in there. He turns around to talk to her, and she goes to the front door in the parlor and disappears.”\nFrye says she doesn’t believe the supposed Wisner spirits are malevolent, and she expects them to behave themselves during the upcoming tours.\n“It was never intended to be Erebus,” Frye says, referring to Pontiac’s most popular haunted attraction. “If you want to go to a place where you’re going to require a dry cleaner afterward, go to Erebus or one of the other venues.”\nSteven Sonoras is an Ypsilanti-based freelance writer \n\nAdult \nHalloween events \nAre you kicking yourself for waiting too long to get tickets to Theatre Bizarre? There’s still hope for a lively month of spooky nightlife for those of us who won’t be haunting the halls of the Masonic Temple. Here are five of the best adult Halloween events happening in the Metro area during the next couple of weeks:\nElektric Circus: Zombie Party at Elektricity Nightclub: Get your groove on with the living dead as DJ Troublemaker spins the latest electronic dance hits. Costumes are encouraged. 9:30 p.m. Sat. Oct. 17. $10. 15 S. Saginaw, Pontiac. (248) 599-2212.\nCrofoot Creepy Cheapy VIII: Secret of the Ooze at the Crofoot Complex: This costumed covers concert features more than a dozen local bands impersonating famous artists ranging from Simon and Garfunkel to Black Sabbath. There will also be candy eating and costume contests. 7 p.m. Fri. Oct. 23. $5 in advance, $10 at the door. 1 S. Saginaw, Pontiac. (248) 858-9333.\nThe Haunted Kingdom at Russell Industrial Center: Billed as “The Midwest’s Largest Halloween Extravaganza,” The Haunted Kingdom features over 65,000 square feet of fearsome fun including fortune tellers, Cirque du Soleil-style performers, and live music. 10 p.m. Sat. Oct. 24. General admission $40, VIP packages available online. 1500 Clay, Detroit. (248) 566.4499.\nMonster’s Ball at the Fillmore Detroit: The Fillmore becomes a ghoulish ballroom featuring illusionists, aerialists, and other exotic performers, all set to the tune of some of the city’s best DJs. 9 p.m. Fri. Oct. 30. General admission has been discounted from $50 to $10, VIP drink packages are $45. 2115 Woodward Ave. (313) 961-5451.\nThe Bang! at The Blind Pig: Ann Arbor’s monthly themed dance party is sure to be equal parts spooky and sexy. Expect a killer mixtape soundtrack and some of the wildest DIY costumes around. 9:30 p.m. Sat. Oct. 31. $8, $11 under 21. 208 N. First St., Ann Arbor. (734) 996-8555.\n\n\nHallowe’en \nat Greenfield Village \n6:30-9 p.m. Fri.-Sat. and 6:30-8 p.m. Sun. (Oct. 22-25)\n$16, $13.75 for members\n20900 Oakwood, Dearborn\n(313) 982-6001\nZoo Boo trick-or-treat trail at Detroit Zoo \n5-8 p.m. Fri.-Sun.\n$8. Free for babies younger than two\n8450 W. 10 Mile, Royal Oak\n(248) 541-5717\nThe Haunted Mansion at Pine Grove \n1-5 p.m. Saturdays and Sundays through Oct. 25\n$5 per person, $10 per family of five\n405 Cesar E. Chavez, Pontiac\n(248) 338-6732", "external_links": [], "published": "2015-10-14T22:35:00.000+03:00", "crawled": "2015-10-15T02:51:32.076+03:00", "highlightTitle": ""}