{"organizations": ["The Canadian Press", "Scotiabank Giller Prize"], "uuid": "5316b9796e317216da8f2f77d9d8e1e398c63604", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.brandonsun.com", "main_image": "http://media.brandonsun.com/designimages/squaresun_web.jpg", "site_section": "http://www.brandonsun.com/rss?path=/entertainment/breaking-news", "section_title": "Entertainment Breaking News", "url": "http://www.brandonsun.com/entertainment/breaking-news/scotiabank-giller-prize-finalists-to-be-revealed-today-330618531.html", "country": "US", "title": "Scotiabank Giller Prize finalists to be revealed today", "performance_score": 0, "site": "brandonsun.com", "participants_count": 0, "title_full": "Scotiabank Giller Prize finalists to be revealed today", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T16:00:00.000+03:00", "replies_count": 0, "uuid": "5316b9796e317216da8f2f77d9d8e1e398c63604"}, "author": "", "url": "http://www.brandonsun.com/entertainment/breaking-news/scotiabank-giller-prize-finalists-to-be-revealed-today-330618531.html", "ord_in_thread": 0, "title": "Scotiabank Giller Prize finalists to be revealed today", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Canadian Press - ONLINE EDITION Scotiabank Giller Prize finalists to be revealed today By: The Canadian Press Report Error \nTORONTO - The short list for the Scotiabank Giller Prize will be revealed this morning in Toronto. \nA long list of 12 authors, including Marina Endicott, Patrick deWitt and Heather O'Neill, was announced last month in Montreal by last year's Giller winner, Sean Michaels. \nTheir novels were selected from a crop of 168 books submitted by 63 publishers. \nThe annual prize awards $100,000 to the author of the best Canadian novel or short story collection published in English. Each finalist gets $10,000. \nThe prize was established in 1994 by businessman Jack Rabinovitch in honour of his late wife, literary journalist Doris Giller. \nThe award gala will be hosted by Rick Mercer and is set to air Nov. 10 on CBC-TV. Rate this This article has not yet been rated. We want you to tell us what you think of our articles. If the story moves you, compels you to act or tells you something you didn’t know, mark it high. If you thought it was well written, do the same. If it doesn’t meet your standards, mark it accordingly. \nYou can also register and/or login to the site and join the conversation by leaving a comment. \nRate it yourself by rolling over the stars and clicking when you reach your desired rating. We want you to tell us what you think of our articles. If the story moves you, compels you to act or tells you something you didn’t know, mark it high. Sort by: Newest to Oldest | Oldest to Newest | Most Popular 0 Comments You can comment on most stories on brandonsun.com . You can also agree or disagree with other comments. All you need to do is register and/or login and you can join the conversation and give your feedback. There are no comments at the moment. Be the first to post a comment below. Post Your Comment", "external_links": [], "published": "2015-10-05T16:00:00.000+03:00", "crawled": "2015-10-05T17:40:25.266+03:00", "highlightTitle": ""}