{"organizations": [], "uuid": "2456e7138512b3398e76df7a6442458d799a3fba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.india.com", "main_image": "http://s3.india.com/wp-content/uploads/2015/10/banana.jpg", "site_section": "http://www.india.com/feed/", "section_title": "India | Latest India News | Get Free India.com Email | Live Cricket and Entertainment News at India.Com", "url": "http://www.india.com/whatever/new-treatment-to-improve-shelf-life-of-bananas-613845/", "country": "US", "title": "New treatment to improve shelf life of bananas", "performance_score": 0, "site": "india.com", "participants_count": 1, "title_full": "New treatment to improve shelf life of bananas", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T16:52:00.000+03:00", "replies_count": 0, "uuid": "2456e7138512b3398e76df7a6442458d799a3fba"}, "author": "Wires English | Press Trust of India", "url": "http://www.india.com/whatever/new-treatment-to-improve-shelf-life-of-bananas-613845/", "ord_in_thread": 0, "title": "New treatment to improve shelf life of bananas", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments Washington, Oct 8: A postharvest treatment with a natural phospholipid can extend shelf life of bananas by one or two days, scientists, including one of Indian-origin, have found. Around the world, bananas are one of the most popular tropical fruits. However, bananas have a relatively short shelf life that creates challenges for both producers and consumers. (Read: Rupert Murdoch suggests Barack Obama isn’t real black president) According to the study, by Zienab F R Ahmed from South Valley University in Egypt and Jiwan P Palta from the University of Wisconsin-Madison, bananas are harvested when they are in the “mature green” stage of ripening and treated with ethylene to stimulate ripening before distribution and sale. The fruits generally ripen within four to five days after ethylene treatment and are then sold primarily at the yellow stage of ripening. After turning yellow, bananas become unsuitable for sale within one to three days, so finding ways to extend banana’s shelf life just one to two days could enhance their market value. ”Previous studies conducted in our laboratory have demonstrated that both pre- and postharvest application of lysophosphatidylethanolamine (LPE) can retard ageing and improve shelf life of various fruits,” researchers said. “In this study we investigated the possibility of improving shelf life of banana fruit by a postharvest dip in LPE,” they said. In the experiments, bananas at “ripeness stage” of 2.5 (about 75 per cent green) were dipped in solution of 500 parts per million (ppm) LPE for 30 minutes and observed for a period of five days at room temperature. Each treatment was applied to 50 uniform bananas. Bananas from the same bunch (used as a control) were not treated. ”Five days after dip treatment, the fruit treated with LPE were firmer and thicker as compared with the untreated control,” the researchers noted. ”Starch breakdown was also delayed in the LPE-treated fruits. LPE treatment slowed the development of brown spots on the peel tissue,” they said. The researchers said these results suggest that LPE may improve shelf life by maintaining membrane integrity, reducing respiration, and slowing the breakdown of starch and cell walls during ripening and senescence of banana fruit tissue. Results of the experiments indicated that a postharvest dip treatment with LPE may improve shelf life of banana fruit by one to two days, researchers said. The study was published in the journal HortScience. \n 22 PM Topics:", "external_links": [], "published": "2015-10-08T16:52:00.000+03:00", "crawled": "2015-10-08T17:18:07.472+03:00", "highlightTitle": ""}