{"organizations": [], "uuid": "72ea71f33e8ceed00dd2c3b96b38f7ba0623eacd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "entertainment.suntimes.com", "main_image": "http://entertainment.suntimes.com/wp-content/uploads/2015/01/DEAR_ABBY_12880069-e1420416724734.jpg", "site_section": "http://entertainment.suntimes.com/feed/", "section_title": "12Chicago Entertainment - Chicago Sun-Times", "url": "http://entertainment.suntimes.com/lifestyles/dear-abby-rival-hostesses-claim-thanksgiving-dibs/", "country": "US", "title": "Dear Abby: Rival hostesses both claim Thanksgiving dibs", "performance_score": 0, "site": "suntimes.com", "participants_count": 1, "title_full": "Dear Abby: Rival hostesses both claim Thanksgiving dibs", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T08:00:00.000+03:00", "replies_count": 0, "uuid": "72ea71f33e8ceed00dd2c3b96b38f7ba0623eacd"}, "author": "Sun-Times", "url": "http://entertainment.suntimes.com/lifestyles/dear-abby-rival-hostesses-claim-thanksgiving-dibs/", "ord_in_thread": 0, "title": "Dear Abby: Rival hostesses both claim Thanksgiving dibs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Dear Abby: Rival hostesses both claim Thanksgiving dibs Sun-Times on October 18, 2015 Dear Abby \nDEAR ABBY: I have been hosting Thanksgiving for most of my married life — 44 years. When my children married, I told them we could celebrate all the holidays whenever and wherever they chose, but I wanted Thanksgiving. \nTwo years ago, my daughter-in-law asked to spend Thanksgiving with her parents and sister, and I reluctantly agreed. Her mom was battling cancer, so I said she could have Thanksgiving with her parents. This year I received an email that she will be hosting it at her house with her parents and hoped we would come! \nI was upset that she didn’t even discuss this with me. I sent her an email back saying I would like to have Thanksgiving at my house and she and her parents were invited. I haven’t heard from her and I’m afraid she’s mad. Frankly, I don’t want to go to her house, but I don’t want to alienate my son and two grandkids. I don’t see a compromise here that will please everyone. Do you? — UNTHANKFUL IN PENNSYLVANIA \nDEAR UNTHANKFUL: Yes, I do. Because your daughter-in-law has made it plain that she would like to establish some Thanksgiving traditions of her own, you should now graciously discuss alternating the celebration with her. \nDEAR ABBY: I was in an unhappy marriage for 35 years, and moved from California to Oklahoma to live with my oldest son. I have now met someone (“Tom”) who makes me very happy. The problem is, he’s only 30 years old. \nTom doesn’t see the age difference as a problem. I don’t either, but I have told only two people about him. I feel happy for the first time and don’t want to lose him. Do you think the age difference is an issue? I have tried dating men my own age, but they are boring. — YOUNG IN OKLAHOMA CITY \nDEAR YOUNG: You have the right to live your life the way you want to. Under the circumstances, the difference in your ages will be an issue only if you or Tom chooses to make it one. \nDEAR ABBY: I often find myself confused regarding contact information. Many times, people list both a cellphone and a home phone number for contacting them. Because I’ve grown up in this age of technology, I have only a cellphone and am not reachable any other way. \nWhen people list both numbers or send me both numbers in an email, which number shoauld be used first? And if I don’t reach them at the first number, do I leave a message and wait for a return call, or should I call the next number right away? Typically, preferences are not indicated. — TOO MANY NUMBERS IN WISCONSIN \nDEAR TOO MANY: While it’s increasingly common for people to have only cellphones, not everyone wants to be called during the day when they might be working. That’s why, if there is any confusion on your part, you should ask the individual, because the responses you receive may not be all the same. \nDear Abby is written by Abigail Van Buren, also known as Jeanne Phillips, and was founded by her mother, Pauline Phillips. Contact Dear Abby at www.DearAbby.com or P.O. Box 69440, Los Angeles, CA 90069. \nWhat teens need to know about sex, drugs, AIDS and getting along with peers and parents is in “What Every Teen Should Know.” Send your name and mailing address, plus check or money order for $7 (U.S. funds), to: Dear Abby, Teen Booklet, P.O. Box 447, Mount Morris, IL 61054-0447. (Shipping and handling are included in the price.)", "external_links": [], "published": "2015-10-18T08:00:00.000+03:00", "crawled": "2015-10-18T14:52:45.544+03:00", "highlightTitle": ""}