{"organizations": [], "uuid": "d7f6b9748f7d0870ff250f573802e0905a761d92", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48524/entertainment", "section_title": "Entertainment - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30267667/technology-changing-family-dynamics-in-todays-society", "country": "US", "title": "Technology: Changing Family Dynamics in Today's Society", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Technology: Changing Family Dynamics in Today's Society - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "d7f6b9748f7d0870ff250f573802e0905a761d92"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30267667/technology-changing-family-dynamics-in-todays-society", "ord_in_thread": 0, "title": "Technology: Changing Family Dynamics in Today's Society", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Information contained on this page is provided by an independent third-party content provider. WorldNow and this Station make no warranties or representations in connection therewith. If you have any questions or comments about this page please contact pressreleases@worldnow.com .\nSOURCE BookWhirl.com\nAuthor offers an eye-opening read that reminds readers of how influential technology has become in the world today\nMANASQUAN, N.J. , Oct. 15, 2015 /PRNewswire/ -- Many have become deeply addicted to technology, succumbing to the allure it brings. That which was once considered a leap in urban development seems to become a deterrent to a meaningful family life. Today, more and more families are using computers, social media and other electronic devices instead of just talking to one another. In this book, readers will get a wake-up call as they meet The Digitally Compulsive Family , whose lives are so dependent on technology. This book describes how families and lifestyles have changed because of technology.\nThis is a self-help book that describes how technology has influenced the changing dynamics of the family and the world. Too many people are texting and not talking. It presents the compulsive nature of digital technology and its effect on the family and the resultant sense of isolation, silence, loss of verbal interaction between the family and the community. There has been an ongoing \"electronic silence\" and the personal touch is lost.\nThis form of electronic interaction is used in millions of families to discuss family matters. It has become an easy tool in which people solve their problems. However, the sense of feelings and body language is no longer an indication of one's intentions. Technology has trivialized the true meaning of verbal communication. Social networking has contributed to the lost art verbal interaction. It is easy, quick, and depersonalizing.\nThere is a dire need to evaluate and make modifications in the way people connect with each other and the effect on people's lifestyles. The author hopes to educate, raise awareness, and provide strategies on how to help stop this growing epidemic. With this book, the author shares strategies to assist families and the community in balancing the use of technology, and to awaken the importance of oral and written communication.\nThis book is available online and can be purchased at www.amazon.com and www.barnesandnoble.com .\nThe Digitally Compulsive Family by John Najar, MA\nPublication Date: July 30, 2014\nPrice: $12.06 ; 136 pages; ISBN 978-1618565723\nTo request for a complimentary paperback review copy, please contact Edward Manning at BookWhirl.com by phone at (877) 207-1679 or by Email .\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/technology-changing-family-dynamics-in-todays-society-300160117.html\n©2015 PR Newswire. All Rights Reserved.", "external_links": ["http://www.prnewswire.com/news-releases/technology-changing-family-dynamics-in-todays-society-300160117.html", "http://www.xmlnews.org/ns/", "http://pressreleaseheadlines.com/contact?pid=292454", "http://www.amazon.com/", "http://www.barnesandnoble.com/", "http://rt.prnewswire.com/rt.gif?NewsItemId=PH28905&Transmission_Id=201510150830PR_NEWS_USPR_____PH28905&DateId=20151015"], "published": "2015-10-15T03:00:00.000+03:00", "crawled": "2015-10-15T19:25:14.611+03:00", "highlightTitle": ""}