{"organizations": [], "uuid": "d941cecba5de5f8c2665867db8c85cf61e323691", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48524/c", "section_title": "Entertainment - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30242078/chicago-magazine-names-the-best-pizzas-in-town", "country": "US", "title": "Chicago magazine Names the Best Pizzas in Town", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Chicago magazine Names the Best Pizzas in Town - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "d941cecba5de5f8c2665867db8c85cf61e323691"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30242078/chicago-magazine-names-the-best-pizzas-in-town", "ord_in_thread": 0, "title": "Chicago magazine Names the Best Pizzas in Town", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Chicago Tribune\nCHICAGO , Oct. 12, The last time Chicago magazine undertook the task of identifying Chicago's Best Pizza was in 2010, so its dining critics decided it was time to get back out there. After visiting eighty-four restaurants and tasting 150 different pies, they concluded that not only has the local pizza landscape gotten bigger and better, but some longtime favorites aren't all they are hyped up to be. The November issue of Chicago features the 38 greatest pizzas in the greatest pizza city on earth, from cracker crust to deep dish and everything in between. While the list may surprise or even enrage some pizza lovers (no Pequod's?), every establishment featured shares at least one trait: Its pizza has that indefinable quality that keeps you reaching for another slice. Plus, discover five awesome pizza alternatives, three highly overrated pizzerias, and five best beers for your pie.\nWith all-star status, a $95 million dollar contract, and celebrity pals, life is a dream these days for Chicago Bulls breakout star Jimmy Butler . He signed a five-year deal with the Bulls in July and has become the face of the franchise (or at least the shared face with the often-hobbled Derrick Rose ). In \"It's Good to be Jimmy Butler ,\" Chicago takes you on a trip to the San Diego mansion Butler rented for himself and his buddies during the off season and gives you a behind-the-scenes look at what a day in the life of Butler is like. And life wasn't always so luxurious for the Tomball, Texas native. Growing up without a father around and getting kicked out of his home at the age of 13, Butler was taken in by a high school teammate's family. He refuses to let his past define him, crediting his mentor, the actor Mark Wahlberg , and the people he surrounds himself with for his disciplined approach to life.\nWith the season of giving coming soon, Chicago set out to unveil the \"Best Charities in Chicago .\" The search criteria were strict: The organization had to be headquartered in Chicago , have 501 (c)(3) status from the Internal Revenue Service (i.e. any donations to it are tax deductible), pass a number of tests on its mission, measurable impact, strong Chicago connection and more. The final criterion was the answer to the question: how big of a hole would be left if the nonprofit were to disappear? The result is a list of the 20 best nonprofits to support this season, broken out by cause.\nAlso included in the November issue of Chicago magazine:\n\"Man Out of Time\" – Before the city gave much thought to preserving its architectural gems, a man by the name of Richard Nickel devoted his life to saving them. During the past few years, the Art Institute has organized and archived his writings, sketches, and photos- now presented in a new book. Chicago features several standouts. \"Politics: Back from the Brink\" – Chicago's projected $426 million budget deficit for 2016 may seem overwhelmingly dire, but the city isn't the first to near fiscal disaster. Find out what Chicago can learn from other cities that recovered from financial catastrophes. \"Dance Unbound\" – Dancer Barak adé Soleil spent much of his early career performing in New York until he discovered he had a disability that would hinder him physically. He has since moved back to his hometown of Chicago , where he places his disability on center stage as a performer. Using floor work, crutches, and wall-assisted movements, he transcends notions of disability in a new suite of performances. \"Best Restaurants\" – This month's issue is definitely one to keep: It contains not only the complete listing of 159 restaurants recommended by Chicago 's dining critics, but also capsule reviews of each one. This detailed list appears in print twice a year (May and November). Stay up to date on the week's biggest headlines with \"The 312,\" Chicago 's weekly e-newsletter showcasing the 10 most interesting local stories and must-reads for Chicagoans – from Chicago magazine and beyond. To subscribe at no cost, simply click here and enter your e-mail address.\nAbout Chicago magazine\nThe nation's largest city monthly, Chicago magazine produces both award-winning, in-depth journalism and authoritative coverage of food, culture, and other lifestyle issues. Together with its website Chicagomag.com , Chicago spurs intelligent conversations about the city's influencers, zeitgeist-defining trends, and civic controversies through award-winning, in-depth journalism available across all platforms. Chicago magazine is published by Tribune Publishing and is part of the Chicago Tribune Media Group portfolio of product offerings. In 2015, Chicago was awarded the John Bartlow Martin Award for Best Public Service in Journalism in a U.S. Magazine and the Sigma Delta Chi Award for Best Investigative Reporting in a City or Regional Magazine by the Society of Professional Journalists.\nAbout Chicago Tribune Media Group\nChicago Tribune Media Group is a diversified media and marketing solutions company that reaches 4.9 million people each month across all platforms. CTMG's robust portfolio of media solutions includes the Pulitzer Prize-winning Chicago Tribune, and a collection of niche and digital offerings including RedEye, Hoy, Chicago magazine, Naperville Magazine, The Mash, Blue Sky Innovation, chicagotribune.com, chicagonow.com and metromix.com. As the region's leading voice, CTMG also extends into the suburbs of Chicago through popular titles including TribLocal, The Beacon-News, The Courier-News, Lake County News-Sun, Naperville Sun, Post-Tribune in Northwest Indiana , Daily Southtown, and 32 Pioneer Press weekly newspapers.\n releases/chicago-magazine-names-the-best-pizzas-in-town-300158120.html\n ", "external_links": ["http://www.xmlnews.org/ns/", "http://www.prnewswire.com/news-releases/chicago-magazine-names-the-best-pizzas-in-town-300158120.html", "http://rt.prnewswire.com/rt.gif?NewsItemId=CG26000&Transmission_Id=201510121520PR_NEWS_USPR_____CG26000&DateId=20151012", "http://www.chicagomag.com/"], "published": "2015-10-12T03:00:00.000+03:00", "crawled": "2015-10-12T23:10:28.452+03:00", "highlightTitle": ""}