{"organizations": [], "uuid": "e12456c0bec27469166ca04362f4143c7ab7db9e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "rssfeeds.freep.com", "main_image": "http://www.gannett-cdn.com/-mm-/19928b646ae8d4daa7bd4c6d7c9a6c7081d5dc01/c=0-169-2863-1787&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/19/USATODAY/USATODAY/635808107746960632-AP-APTOPIX-18th-Annual-Mark-Twain-Prize-To-Eddie-Murphy.jpg", "site_section": "http://rssfeeds.freep.com/freep/entertainment", "section_title": "Detroit Free Press - Entertainment", "url": "http://rssfeeds.freep.com/~/118620763/0/freep/entertainment~Eddie-Murphy-honored-with-Mark-Twain-Prize/", "country": "US", "title": "Eddie Murphy honored with Mark Twain Prize", "performance_score": 0, "site": "freep.com", "participants_count": 1, "title_full": "Eddie Murphy honored with Mark Twain Prize", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T09:21:00.000+03:00", "replies_count": 0, "uuid": "e12456c0bec27469166ca04362f4143c7ab7db9e"}, "author": "freep.com", "url": "http://rssfeeds.freep.com/~/118620763/0/freep/entertainment~Eddie-Murphy-honored-with-Mark-Twain-Prize/", "ord_in_thread": 0, "title": "Eddie Murphy honored with Mark Twain Prize", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MORE WASHINGTON -- On a night filled with a thousand laughs, including jabs at Donald Trump and Bill Cosby, there was one touching moment that stood out among the star-studded lineup of performers who appeared on stage to salute Eddie Murphy with the Mark Twain Prize for American Humor.\nTracy Morgan, fresh from his gig hosting Saturday Night Live the night before, made his way down to the Nation's Capital on Sunday to celebrate his friend. \"When I first came out of my coma, I spoke to Eddie on the phone, and he was the first one to make me laugh, and that's why I love you,\" he said, looking up to where Murphy was seated in the Kennedy Center's Concert Hall.\nWhen Morgan first took to the stage to honor his friend, he received a standing ovation. The comedian, who has made quite a comeback after a June 2014 left him critically injured, called Murphy a \"true comedic hero\" and \"the reason I have a career.\"\nAlso there to celebrate Murphy's comedic career was Arsenio Hall, Kathy Griffin, Chris Rock, Joe Piscopo, Jay Pharoah, Trevor Noah and George Lopez, among others.\n\"He's (Murphy's) done it all,\" remarked Griffin on the red carpet prior to the show. \"He's done so many things that comics aren't able to do.\" Noah noted how Murphy \"connected with every single person\" when he performed. \"He didn't seem unrelatable.\" Piscopo, who started on Saturday Night Live at the same time as Murphy, recalled how the \"young kid\" made an impression by being \"grounded and polite and gracious as one can be. I'm so proud of him.\"\nHall opened the evening's program by comparing Murphy to another comedic great: \"When it comes to masters of everything who do it all in comedy, only two come to mind,\" said Hall. \"The first recipient (of the Mark Twain Prize), Richard Pryor, and tonight's recipient, Eddie Murphy.\"\nThroughout the night, clips were shown of moments throughout Murphy's career, from his standup routines to snippets from his films including Coming to America , Trading Places , The Nutty Professor and Shrek .\n\" Trading Spaces was the number one DVD I burned and sold,\" joked Lopez. Lopez then jumped on the Coming to America theme to rag on Trump: \"All of his wives have been immigrants from other countries,\" Lopez pointed out, adding, \"Women come to America and do jobs that other women don't want to do.\"\nOn a more serious note, he said of Murphy that \"every performance that that brother did on stage showed us how it could and should be done.\"\nWhen it was his turn to take to the stage to accept the prize, Murphy decided to offer some clarification about the honor: \"It's an award, because usually when it's a prize there's usually money involved.\" And to \"clear up the confusion for future recipients...if you don't want to call it an award, maybe you can call it the Mark Twain Sur-prise. The 'surprise'' being you ain't getting any money!\"\nHe also couldn't help but riff on former recipient Cosby, who was honored with the prize in 2009. “Bill has one of these,” Murphy said, looking at the bust of Mark Twain before posing the question, “Did you all make him give it back?” he asked.\"You know you’ve (expletive) up when they want you to give your trophy back,” Murphy joked before ripping Cosby in an impersonation of the disgraced comedian refusing to give back his award.\n“I would like to talk to some of the people who feel like I should give back some of my (expletive) trophies,” he said.\nThe prize honors those who influence American society in the tradition of Samuel Clemens, the writer and satirist known as Mark Twain. Past honorees include Richard Pryor, George Carlin, Jay Leno, Carol Burnett, Tina Fey, Ellen DeGeneres and Will Ferrell.\nThe show was taped for broadcast and will air Nov. 23 on PBS (check local listings).", "external_links": [], "published": "2015-10-19T09:21:00.000+03:00", "crawled": "2015-10-19T19:02:30.171+03:00", "highlightTitle": ""}