{"organizations": [], "uuid": "aeaa0d49aa7be0b77e574a59cc4732725dea9438", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prnewswire.com", "main_image": "http://photos.prnewswire.com/prnvar/20130307/600769", "site_section": "http://rss.prnewswire.com/industry/entertainment/", "section_title": "PR Newswire: Entertainment & Media", "url": "http://www.prnewswire.com/news-releases/us-automotive-parts-die-casting-market-2015-2020---key-vendors-are-briggs--stratton-california-die-casting-dynacast-auto-cast-rockwell-automation--ryobi-die-casting-300157749.html", "country": "IT", "title": "U.S Automotive Parts Die Casting Market 2015-2020 - Key Ven", "performance_score": 0, "site": "prnewswire.com", "participants_count": 1, "title_full": "U.S Automotive Parts Die Casting Market 2015-2020 - Key Ven", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T14:12:00.000+03:00", "replies_count": 0, "uuid": "aeaa0d49aa7be0b77e574a59cc4732725dea9438"}, "author": "Research and Markets", "url": "http://www.prnewswire.com/news-releases/us-automotive-parts-die-casting-market-2015-2020---key-vendors-are-briggs--stratton-california-die-casting-dynacast-auto-cast-rockwell-automation--ryobi-die-casting-300157749.html", "ord_in_thread": 0, "title": "U.S Automotive Parts Die Casting Market 2015-2020 - Key Ven", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "DUBLIN , Oct. 12,   Research and Markets ( http://www.researchandmarkets.com/research/8mslpn/u_s_automotive ) has announced the addition of the \"U.S Automotive Parts Die Casting Market - Growth, Trends, Forecast (2015-2020)\" report to their offering. \nWithin North America , which is the largest market for automotive die casting globally, the U.S. alone accounts for around 71% of the market share. The U.S market for automotive parts die casting had revenue $2.01 billion in 2014 and is estimated to reach $2.87 billion by 2020 at a decent CAGR of 6.10% over the forecasted period. Market for magnesium die cast parts in automotive is expected to grow at a higher CAGR of 13 % over the coming 5 years, while that of zinc is expected to grow at a slower pace of around 2%. \nThe United States has one of the largest automotive markets in the world and is home to over 13 major auto manufacturers. With an average of 8 million passenger vehicle production per annum, and regulations pertaining to the emission standards. The automakers are sourcing components for manufacturing lightweight vehicles by employing alloy and die cast parts, in turn driving the market for automotive parts die casting industry in the country. \nThe market for automotive Die Cast parts in the U.S. was highly influenced by socio-economic factors and unemployment rates in the region. Since the 2008 Recession, though the GDP showed growth, it was under-performing and with a low consumer sentiment, the personal consumption of the die casting parts also stayed low. Though the manufacturing capacity use of the die casts improved slightly, it will be still low over a long period. Overall, the automotive die casting market in the U.S, though matured, has a potential scope of growth with the die casting capacity utilization ahead of overall manufacturing utilization. \nDependence of the automobile manufacturers on the environmental agency regulations and a recent move by EPA of raising the mile per gallons standards to 35.5 miles per gallon by 2016 and then 54.5 mpg by 2025 actually helped the die casting industry as the auto industry concluded the only way they can get to those mileage standards is by light weighting the vehicles. \nRules levied by OSHA and initiatives by NADCA to improve the technical workforce in the die casting industry is expected to improve the overall production of the die casting market and in turn, the market for automotive parts die casting. NADCA is working with several community colleges in the U.S to create a die casting farm system. This aide in the entry of more technically qualified students into the die casting industry and improve the performance of the former as a whole. This initiative was mainly due to increased automation and a demand for higher skills from the workforce. \nBriggs & Stratton Corp., California Die Casting Incorporated, Dynacast Incorporated, Auto Cast Incorporated, Rockwell automation and Ryobi Die Casting ( USA ) Inc., are some of the key players in the market. The market is segmented based on the production process type, by raw material type, by application type and by geography type. \nKey Topics Covered: \n1. Introduction\n2. Executive Summary \n3. Market Overview\n4. Market Dynamics \n5. Market Segmentation\n6. Competitive Landscape \n7. Key Players (Overview, Strategies, Developments, Analyst Perspective)\n- Brabant Alucast - Chicago White Metal Casting Inc. - China Precision Diecasting - Continental Casting Llc - Georg Fischer Limited - Gibbs Die Casting Group - Kinetic Die Casting - Magic Precision Inc. - Meridian Lightweight Technologies - Mk Group Of Companies - Morimura Bros. Inc. - Ortal Die Casting - Pace Industries - Ryobi Die Casting Inc. - Shiloh Industries Inc. - Sundaram Clayton Ltd. - Twin City Die Casting Company - Ningbo Parison Die Casting Co., Ltd. - Pressure Die Casting (Pty) Ltd. ( Africa ) - Rockman Industries Ltd. - Ryobi Die Casting Inc. - Sandhar Technologies Ltd. - Sipra Engineers - Sun Beam Auto Pvt. Ltd. - Texas Die Casting - Tyche Diecast Pvt. Ltd. - Voit Automotive - Zealous Automotive \nFor more information visit http://www.researchandmarkets.com/research/8mslpn/u_s_automotive \nMedia Contact: \nLaura Wood , +353-1-481-1716, press@researchandmarkets.net \n \n\nSOURCE Research and Markets\n\n\nRELATED LINKS\nhttp://www.researchandmarkets.com", "external_links": [], "published": "2015-10-12T14:12:00.000+03:00", "crawled": "2015-10-12T14:18:33.116+03:00", "highlightTitle": ""}