{"organizations": [], "uuid": "d7130be53a4f0a82c4eedd72ee6e8246cc66421d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nydailynews.com", "main_image": "http://assets.nydailynews.com/polopoly_fs/1.2382158!/img/httpImage/image.jpg_gen/derivatives/landscape_1200/aptopix-oregon-school-shooting.jpg", "site_section": "http://www.nydailynews.com/news/index.html", "section_title": "Breaking, Local and National News, Sports &amp; Entertainment - NY Daily News", "url": "http://www.nydailynews.com/news/national/11-bloodiest-school-shootings-columbine-article-1.2382159", "country": "US", "title": "11 of the bloodiest school shootings since Columbine", "performance_score": 0, "site": "nydailynews.com", "participants_count": 1, "title_full": "11 of the bloodiest school shootings since Columbine - NY Daily News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "d7130be53a4f0a82c4eedd72ee6e8246cc66421d"}, "author": "NEW YORK DAILY NEWS", "url": "http://www.nydailynews.com/news/national/11-bloodiest-school-shootings-columbine-article-1.2382159", "ord_in_thread": 0, "title": "11 of the bloodiest school shootings since Columbine", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Mike Sullivan/AP Police search students outside Umpqua Community College in Roseburg, Ore., on Thursday following a deadly shooting at the college. Thursday’s shooting at Umpqua Community College in Oregon was just the latest in an ongoing string of school shootings.\nThis year alone there have already been 45 such tragedies, according to statistics compiled by the gun control advocacy group Everytown for Gun Safety.\nHere are some of the bloodiest school shooting in recent years:\nLittleton, Colo.: Columbine High School\nOn April 20, 1999, teenagers Eric Harris and Dylan Klebold went on what was then the highest fatality school shooting, killing 13 and wounding more than 20 others before turning the guns on themselves.\nThe killers were already seen as outcasts and there was speculation that the pair — who called themselves “the trenchcoat mafia” — had been motivated from everything bullying to Goth culture to violent video games.\nAP Eric Harris, left, and Dlyan Klebold, carried out the Columbine massacre in 1999. Santee, Calif.: Santana High School\nOn March 5, 2001, Charles Andrew Williams killed two and wounded 13 at his high school. The 15-year-old freshman had just moved from Maryland and, at a bigger school, fell in with a tougher group of kids.\nBefore the shooting, the teenager was struggling.\nHis parents divorced and a close friends died. Then, a teacher scolded him in front of the class. That was the last straw and just three days later, Williams took a gun to school.\nAfterward, the teenage killer said he was “trying to prove a point” to kids who bullied him, but he ended up shooting friends and enemies alike.\nCurrently, Williams is serving a sentence of 50 to life.\nPOOL/REUTERS Santana High School shooter Charles Andrew Williams appeared at his arraignment in 2001. Red Lake, Mich.: Red Lake High School\nJeff Wiese, 16, shot seven classmates, his grandfather and his grandfather’s partner on March 21, 2005. Wiese started the killing spree his family’s home on the Red Lake Indian Reservation, when he stole his grandfather’s guns, police-issued Kevlar vest and squad car.\nThen, he made his way to the local high school where he opened the doors and began shooting.\nMinutes later, the spree ended when tribal police arrived and Wiese shot himself.\nJEFF HAYNES/AFP/Getty Images Police and investigators' vehicles parked in front of the Red Lake Senior High School after a shooting in March 2005. Nickel Mines, Penn: West Nickel Mines School\nIn October 2006, Charles Carl Roberts IV barricaded himself in a one-room Amish schoolhouse in Lancaster County. He tied up 10 young girls before he started shooting.\nThe small-town murder spree resulted in five deaths and five injuries before the 32-year-old shooter took his own life.\nBRADLEY C BOWER/REUTERS A gunman in Nickel Mines, Penn., carried out a massacre in a one-room schoolhouse in 2006. Blacksburg, Va.: Virginia Polytechnic Institute\nThirty-two students and teachers died in the April 16, 2007 Virginia Tech massacre.\nShooter Seung Hui Cho started the killing in his dorm and then, two hours later, continued his rampage in a classroom building, where he chained and locked the main doors before firing at will for the next 10 minutes.\nThe spree ended when Cho shot himself.\nThis video frame grab image taken from a video aired by NBC News on April 18, 2007 shows Virginia Tech gunman Seung Hui Cho. DeKalb, Ill.: Northern Illinois University\nSteven Kazmierczak killed six people — including himself — during a mid-afternoon shooting at Northern Illinois University.\nDressed in black, the shooter — a former NIU grad student — stepped out from behind the curtain in an auditorium and opened fire on an oceanography class.\nEric Sumberg/AP Rescue workers evacuate a victim of a shooting at a lecture hall at Northern Illinois University in DeKalb, Ill., on Feb. 14, 2008. Oakland, Calif.: Oikos University\nOne Goh, 43, opened fire on a classroom at a Christian school on April 2, 2012.\nThe former student interrupted a nursing test and killed seven people with a legally purchased handgun.\nAP One Goh, 43, is accused of killing seven people at Oikos University in Oakland, Calif. Santa Monica, Calif.: Santa Monica College\nOn June 7, 2013, John Zawahri opened fire on campus, killing five people.\nThe attack was carried out with an assault rifle the killer built himself. The 13-minute shooting spree ended when police shot him.\nNewtown, Conn: Sandy Hook Elementary School\nOn Dec. 14, 2012, 20-year-old Adam Lanza shot and killed his mother. Then, he grabbed an AR-15 assault rifle and two pistols and headed to Sandy Hook Elementary School.\nThe school door was locked, but Lanza shot his way into the building. He murdered 20 students and six teachers before committing suicide.\nKEVIN P. COUGHLIN/KEVIN P. COUGHLIN Shown is an aerial view of the scene at and near the Sandy Hook Elementary School in Newtown, Conn., where gunman Adam Lanza killed students and teachers. Isla Vista, Calif.: University of California, Santa Barbara\nElliot Rodger, the son of a Hollywood director, killed six and injured 13 during a May 2014 shooting that started in his apartment building, then moved to a sorority house and finally ended in the shooter’s car.\nThe 22-year-old posted a murderous warning on YouTube beforehand, promising to exact vengeance on sorority women who scorned him.\nThe violence ended when Rodger shot himself.\nUncredited/ASSOCIATED PRESS Elliot Rodger was the gunman in the 2014 University of California at Santa Barbara shooting. Marysville, Wash.: Marysville Pilchuck High School\nOn Oct. 24, 2014,15-year-old Jaylen Fryberg shot five of his classmates, killing four of them.\nThough his friends described him as normal in the days leading up to the shooting, text messages later revealed that he may have been planning the massacre after the relationship with his 15-year-old girlfriend went south.\nMark Harrison/MCT Students are escorted to buses for evacuation after the shooting at Marysville Pilchuck High School in October 2014. In the end, Fryberg killed himself.\nkblakinger@nydailynews.com\nRelated Stories Troy Polamalu's cousin among survivors of Oregon massacre 13 reported dead after shooting at Oregon community college", "external_links": [], "published": "2015-10-02T03:00:00.000+03:00", "crawled": "2015-10-02T00:49:17.306+03:00", "highlightTitle": ""}