{"organizations": [], "uuid": "fe1da0822432343e076e15e08b93e94a2927ef1d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.aceshowbiz.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Aceshowbizcom-EntertainmentNews\r", "section_title": "Aceshowbiz.com - Entertainment News", "url": "http://www.aceshowbiz.com/news/view/00089787.html", "country": "US", "title": "Barry Seal's Daughter Attempts to Boycott Tom Cruise-Starring Film 'Mena'", "performance_score": 0, "site": "aceshowbiz.com", "participants_count": 1, "title_full": "Barry Seal's Daughter Attempts to Boycott Tom Cruise-Starring Film 'Mena'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T06:31:00.000+03:00", "replies_count": 0, "uuid": "fe1da0822432343e076e15e08b93e94a2927ef1d"}, "author": "AceShowbiz.com", "url": "http://www.aceshowbiz.com/news/view/00089787.html", "ord_in_thread": 0, "title": "Barry Seal's Daughter Attempts to Boycott Tom Cruise-Starring Film 'Mena'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments Lisa Seal Frigon said her father's story life rights were sold to Universal without the estate's consent and the money went to her stepmother's pocket. \nThe daughter of drug smuggler Adler \"Barry\" Seal is attempting to boycott a Universal Picture movie based on her father's life. Lisa Seal Frigon has filed a lawsuit on Wednesday, October 14 in Baton Rouge District Court, saying the life story rights were sold without court approval or the estate's consent. \" Mena \" is a thriller directed by Doug Liman and written by Gary Spinelli. Seal was a hustler and pilot who was unexpectedly recruited by the CIA in 1980s to run one of the biggest covert operations in U.S. history. He was instrumental in the capture of the late cocaine kingpin Pablo Escobar. Tom Cruise is already attached to play the lead role of drug smuggler-turned-federal informant. Frigon, who was born from Seal's first marriage, said her father's third wife Deborah Dubois and children born from the marriage sold the rights to movie studio for $350,000 but not a dime went to the estate. Her lawyer Roy Maughan said Dubois essentially stole money that belongs to the estate. \"Well, obviously, if the agreement for the life story rights of Barry Seal was not properly executed, I would think that Universal would be cautious about proceeding to a theater with the movie without making the appropriate arrangements,\" Maughan said. In the lawsuit, Frigon also pointed out that she had reviewed the movie's script and there were many inaccuracies. \"It contains many factual inaccuracies and thus falsely portrays Adler Berriman Seal,\" the lawsuit read. Among the faults are Seal's marital history, the portrayal of him as father of three instead of five, his work history, the portrayal of him as a drunkard and reckless pilot, his relationship with his two oldest children and the place and manner of his death. Overall, the lawsuit attempts to stop the movie from being released. It claimed the commercial value of Seal's persona has been damaged and therefore, the value of his estate is diminished. She seeks unmentioned damages from Universal, Dubois and her three children. Universal is yet to respond to the lawsuit. \"Mena\" actually has gone into filming in Colombia and is scheduled to hit theaters in 2017. A TV movie based on Seal's story was made in 1991 with Dennis Hopper as star. \n© AceShowbiz.com Warning : mysql_num_rows() expects parameter 1 to be resource, boolean given in /home/aceshow/public_html/php/bs_nview.php on line 567 More Mena News", "external_links": [], "published": "2015-10-16T06:31:00.000+03:00", "crawled": "2015-10-16T10:22:37.673+03:00", "highlightTitle": ""}