{"organizations": [], "uuid": "423a0c8c1c37a3407d9a2bc70dd12c0804a107a0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/278850/arts-entertainment", "section_title": "Arts &amp; Entertainment - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30332257/dr-jeffrey-n-shebovsky-will-serve-as-vice-president-of-membership-of-the-central-florida-chiropractic-society", "country": "US", "title": "Dr. Jeffrey N. Shebovsky Will Serve as Vice President of Membership of the Central Florida Chiropractic Society", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Dr. Jeffrey N. Shebovsky Will Serve as Vice President of Membership of the Central Florida Chiropractic Society - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T11:37:00.000+03:00", "replies_count": 0, "uuid": "423a0c8c1c37a3407d9a2bc70dd12c0804a107a0"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30332257/dr-jeffrey-n-shebovsky-will-serve-as-vice-president-of-membership-of-the-central-florida-chiropractic-society", "ord_in_thread": 0, "title": "Dr. Jeffrey N. Shebovsky Will Serve as Vice President of Membership of the Central Florida Chiropractic Society", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Dr. Jeffrey Shebovsky, owner of South Orange Wellness & Injury Center in Orlando, Florida and West Orange Wellness & Injury Center in Ocoee, Florida began his term as the Vice President for the Central Florida Chiropractic Society (CFCS).\n ORLANDO, FL, October 23, Dr. Jeffrey Shebovsky, owner of South Orange Wellness & Injury Center in Orlando, Florida and West Orange Wellness & Injury Center in Ocoee, Florida began his term as the Vice President for the Central Florida Chiropractic Society (CFCS), which is the local chapter of the Florida Chiropractic Association (FCA). The Central Florida Chapter is comprised of Chiropractors from Orange, Osceola, Seminole and Lake Counties.\nThe CFCS will be undergoing a reorganization, with the goal of raising awareness of health and wellness topics of both current academic and clinical interests that will ultimately assist the doctors in providing the most up-to-date health information to their patients.\nDr. Shebovsky has been an active member of the FCA for 20 years. His goal for CFCS is to increase membership and participation at the local level, through inviting radiologists and neurologists, and other area health professionals, as guest speakers, providing stimulating topics of discussion and education and keeping the local doctors up to date on the ever-changing practice climate in Florida.\nDr. Shebovsky is excited to accept the challenge of helping to generate new membership and greater involvement. He explains \"The Central Florida area is filled with highly skilled chiropractors who will make a great contribution to the State of Florida with their background and knowledge. I'm looking forward to working together and enriching our shared knowledge base.\"\nDr. Shebovsky added, \"Currently there are about 600 chiropractors in Central Florida . If each chiropractor reaches out to five of their contacts, and those people do likewise, we can all accomplish great things and stay on the cutting edge of healthcare for our patients.\"\nCentral Florida Wellness & Injury Centers are state-of-the-art chiropractic clinics located in Orlando in Hunter's Creek at 4170 Town Center Blvd. - Suite #100; Orlando and in Ocoee at 288 Moore Road .\nContact: 407-857-6166\n release/dr-jeffrey-n-shebovsky-will-serve-as-vice-president-of-membership-of-the-central-florida-chiropractic-society-414560.php", "external_links": ["http://www.24-7pressrelease.com/press-release/dr-jeffrey-n-shebovsky-will-serve-as-vice-president-of-membership-of-the-central-florida-chiropractic-society-414560.php", "http://purl.org/rss/1.0/modules/content/", "https://plus.google.com/+SouthOrangeWellnessInjuryCenterOrlando/", "https://plus.google.com/+WestOrangeWellnessandInjuryCentersOcoee/"], "published": "2015-10-23T11:37:00.000+03:00", "crawled": "2015-10-23T10:40:49.704+03:00", "highlightTitle": ""}