{"organizations": [], "uuid": "7b361f6d492e88c3dd7dfcd5a8fda0385819d7d5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/10/19/13030168/BlackCube_ChadPersonInflatable_India2.jpeg", "site_section": "http://www.prweb.com/rss2/entertainment.xml", "section_title": "Arts &amp; Entertainment", "url": "http://www.prweb.com/releases/2015/10/prweb13030168.htm", "country": "US", "title": "Black Cube Announces Second Pop Up Exhibition Featuring a Monumental Inflatable Sculpture by Chad Person in a Downtown Denver Parking Lot", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Black Cube Announces Second Pop Up Exhibition Featuring a Monumental Inflatable Sculpture by Chad Person in a Downtown Denver Parking Lot", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "7b361f6d492e88c3dd7dfcd5a8fda0385819d7d5"}, "author": "Carli Franks", "url": "http://www.prweb.com/releases/2015/10/prweb13030168.htm", "ord_in_thread": 0, "title": "Black Cube Announces Second Pop Up Exhibition Featuring a Monumental Inflatable Sculpture by Chad Person in a Downtown Denver Parking Lot", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Black Cube continues its inaugural year of pop up exhibitions in Denver with its second work by artist fellow Chad Person. This exhibition, titled Prospector, features an inflatable sculpture, which can be found in the Time Park parking lot in downtown Denver on Grant Street, across from the Colorado State Capital and was designed specifically for this space in Denver. The exhibition opens to the public tomorrow, October 22, 2015. Prospector is the artist’s first major outdoor sculpture in Denver. The 40-foot sculpture is a monochromatic blue inflatable inspired by the Disney Toy Story 2 prospector, Stinky Pete. For Person, the character draws many references from Denver - from its gold mining history, to the speculation of current tech economies and real estate booms, and particularly the connection with the era of digital commerce.\nThe character itself echoes the rich histories of westward expansion, manifest destiny, technology, and the classic story of the American entrepreneurial spirit. In this work, Person likens the historic miner character to the modern digital entrepreneur like the artist himself, wielding 3D printers, and coding skills.\nThis work has been conceived and produced specifically for this pop up exhibition. Its placement, next to the newly refurbished gold dome on the Colorado State Capital, calls out Denver’s history, but the inflatable also harkens to the inflatables used in outdoor commercial lots to attract customers to car or hot tub sales. This tension in the historic content of the work and the cheap, commercial, and temporary inflatable form are the tensions that make this work important to current discourse about the economy and values of society.\nThe Dikeou Pop Up Colfax is partnering with Black Cube on a reception for the Chad Person's 'Prospector' Pop Up and the opening of the Collection's new art installations in the Pop Up Colfax basement. The event will take place on Thursday, October 22 from 6:00-9:00 p.m. near the sculpture in the Time Park parking lot on Grant in between Colfax and 14th in Denver and in the Dikeou Colfax Pop Up. There will be DJs and food trucks at both locations.\nAbout Black Cube\nBlack Cube is a nonprofit, nomadic contemporary art museum. At Black Cube, we see ourselves as an unconventional museum pursuing the most effective ways to engage new audiences while supporting artists’ sustainability. Without the traditional boundaries of a physical building, Black Cube is experienced primarily through pop-up art exhibitions and shops conceived by our artist fellows. Black Cube was founded by artist and philanthropist, Laura Merage. Find out more at http://www.blackcubeart.org .", "external_links": ["http://t2180315.omkt.co/track.aspx?id=402|2144DB|DE2F|0|279|0|255|1|701E2082&destination=http%3a%2f%2fwww.blackcubeart.org&dchk=70061A9B", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5ibGFja2N1YmVhcnQub3Jn"], "published": "2015-10-21T03:00:00.000+03:00", "crawled": "2015-10-21T20:44:52.575+03:00", "highlightTitle": ""}