{"organizations": [], "uuid": "3f3dfc160484197af6e814601437a4ce3f28484d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "http://www.bostonherald.com/sites/default/files/media/2014/04/10/100915gabriel1.jpg", "site_section": "http://bostonherald.com/entertainment", "section_title": "Entertainment | Boston Herald", "url": "http://bostonherald.com/entertainment/music/music_news/2015/10/peter_gabriel_s_artistry_brought_to_vinyl_fans", "country": "US", "title": "Peter Gabriel’s artistry brought to vinyl fans", "performance_score": 0, "site": "bostonherald.com", "participants_count": 1, "title_full": "Peter Gabriel’s artistry brought to vinyl fans | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "3f3dfc160484197af6e814601437a4ce3f28484d"}, "author": "Jed Gottlieb", "url": "http://bostonherald.com/entertainment/music/music_news/2015/10/peter_gabriel_s_artistry_brought_to_vinyl_fans", "ord_in_thread": 0, "title": "Peter Gabriel’s artistry brought to vinyl fans", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A year ago, Peter Gabriel fans went into a tizzy when the singer debuted a new song in concert. One song launched scores of news items, blog posts and happy status updates. That’s what happens when a pop star shows creative life after an epic dry spell. Gabriel hasn’t released a set of original songs since 2002’s “Up.”\nWhile Gabriel takes his time, his record company — Real World — finally capitalizes on the singer’s 2014 induction into the Rock and Roll Hall of Fame by putting his first four LPs on vinyl for the first time since 2002. In a world bifurcated between vinyl junkies and streaming enthusiasts, Gabriel firmly planted his flag in the vinyl camp. Gabriel has kept his music off Spotify, but these reissues cater to the supreme audiophile: The remastering engineers divided each album on two 180-gram LPs that play at 45 rpm. (The theory is that it improves audio quality.)\nBells and whistles add appeal, but the music matters most. Most of the music sounds as sublime as when it dropped in the late ’70s and early ’80s.\nAfter leaving Genesis, Gabriel wanted to establish himself as an eclectic, strange, successful artistic force. He did that on his debut, 1977’s “Car.” If you only know the singer from “Sledgehammer” or “Solsbury Hill,” you’ll be surprised to find him dig into disco funk, barbershop quartet harmonies, epic ballads, cocktail jazz, straight rock ’n’ roll and Wagnerian crescendos. He gathers an odd blend of genres, but infuses each with art, heart and hooks — listen to the bridge on “Excuse Me.”\nOn album two, ’78’s “Scratch,” Robert Fripp graduates from guitarist to producer. The two tweak the template of “Car” by boiling down the sound — more rockers and ballads, less experimentation. While they tone down the weirdness, the melodies compete with anything Gabriel has done. (Listen to “Mother of Violence,” “Indigo,” “Animal Magic.”)\nGabriel unearths his signature approach on 1980’s “Melt.” The tribal rhythms (no cymbals allowed!) and global styles he perfects on “Passion,” the big, layered pop of “So,” begin here. Smartly, he knows when to flood the mix with his aesthetic and when to leave a melody clean. “Intruder” creeps and crawls with electronic textures and pounding toms. Probably the most beautiful song about an assassination, “Family Snapshot” sits raw and open.\nGabriel expands his travels on the master class of percussion that is “Security.” His fourth album, the one leading up to his breakthrough “So,” tramps through far-flung cities and beaches, forests and jungles. On the thundering “The Rhythm of the Heat,” he imagines Carl Jung’s response to watching African drummers. The swelling, cinematic “San Jacinto” came from a story a Native American related to Gabriel about genocide. The LP’s most tender tune, “Wallflower,” shines a light on the political prisoners of Latin America. And always the music backs up the words. If you’re looking for the bridge from Talking Heads’ “Remain in Light” to Paul Simon’s “The Rhythm of the Saints” — and you should be — spend time with “Security.”", "external_links": [], "published": "2015-10-09T03:00:00.000+03:00", "crawled": "2015-10-09T12:36:51.691+03:00", "highlightTitle": ""}