{"organizations": [], "uuid": "589483d16fc6b474fd5e83644ff5e2ace559bc66", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kptv.com", "main_image": "", "site_section": "http://kptv.com/category/13540/entertainment?clienttype=rss", "section_title": "KPTV.com - Entertainment - Headline", "url": "http://www.kptv.com/story/30276932/doris-duke-mansion-in-new-jersey-can-be-razed-panel-decides", "country": "US", "title": "Doris Duke mansion in New Jersey can be razed, panel decides", "performance_score": 0, "site": "kptv.com", "participants_count": 1, "title_full": "Doris Duke mansion in New Jersey can be razed, panel decides - KPTV - FOX 12", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "589483d16fc6b474fd5e83644ff5e2ace559bc66"}, "author": "cbs8", "url": "http://www.kptv.com/story/30276932/doris-duke-mansion-in-new-jersey-can-be-razed-panel-decides", "ord_in_thread": 0, "title": "Doris Duke mansion in New Jersey can be razed, panel decides", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "HILLSBOROUGH, N.J. (AP) - A 67,000-square-foot derelict mansion on a sprawling estate where tobacco heiress Doris Duke lived can be demolished, a panel ruled.\nThe Hillsborough Township Historic Preservation Commission rendered its decision on a 6-1 vote after a four-hour meeting Thursday night, culminating a lengthy hearing process that had taken place over the last few months and drew dozens of people.\nThe Duke Farms Foundation had sought to demolish the mansion, which has been empty since Duke's death in 1993 at age 80. They said the building, erected in 1893, had fallen into disrepair and would take $10 million to $20 million to bring it up to code.\nDuke's father, James Buchanan Duke, assembled the Tudor-style estate, beginning with a 357-acre farm on a picturesque stretch of the Raritan River. He eventually acquired 40 adjacent farms in the following years, expanding the total acreage of Duke Farms to 2,200 acres by the early 1900s.\nArchitectural historian Emily Cooperman told the board Thursday that the house where the socialite, philanthropist and environmentalist lived was a \"white elephant\" and the Duke Farms property as a whole was more significant.\nCommissioner Greg Gillette voted for the application, admitting at first he was skeptical.\n\"I was very disappointed to learn many months ago that Duke Farms was about to make an application for demolition of the main residences,\" Gillette said. \"But those are my personal feelings and I will put them aside. ... The loss of the house does not diminish the property.\"\nTim Stollery was the lone commissioner to vote against demolishing the house.\n\"History will judge us, and I think this is a mistake, guys,\" Stollery said.\nFoundation officials have said they planned to open about 50 acres at Duke Farms to the public if the demolition was approved. That property, which surrounds the home and is now fenced off, includes waterfalls, a lake and a meditation garden.\nA grass-roots community group called DORIS, for Demolition of Residence is Senseless, led the fight against the foundation's plans. They wanted the foundation to explore several possible \"re-adaptive uses\" for the mansion in Hillsborough Township that they said would generate income and attention.\nDavid Brook, one of the organizers of the group, said he plans to appeal to the township's board of adjustments.\n\"There was more fiction than fact,\" he told NJ.com after the meeting. \"They were all drinking the Kool-Aid before everything got underway. You could sense it. They weren't listening. It was all preordained.\"\nDuke was a global traveler who acquired items from around the world, including a collection of Islamic and Southeast Asian art.\nShe led a colorful life that drew international media attention. But most of her philanthropic work involved the Hillsborough estate, where she created many elaborately themed gardens, including one of the nation's largest indoor botanical displays.\nCopyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-10-16T03:00:00.000+03:00", "crawled": "2015-10-18T04:54:01.123+03:00", "highlightTitle": ""}