{"organizations": [], "uuid": "31d59f9923c0f66044dba740c98911c5b3d30d43", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.aceshowbiz.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Aceshowbizcom-EntertainmentNews\r", "section_title": "Aceshowbiz.com - Entertainment News", "url": "http://www.aceshowbiz.com/news/view/00090183.html", "country": "US", "title": "'Pretty Little Liars' Season 6B Featurette Teases the Reunion and New Problem", "performance_score": 0, "site": "aceshowbiz.com", "participants_count": 1, "title_full": "'Pretty Little Liars' Season 6B Featurette Teases the Reunion and New Problem", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T08:59:00.000+03:00", "replies_count": 0, "uuid": "31d59f9923c0f66044dba740c98911c5b3d30d43"}, "author": "AceShowbiz.com", "url": "http://www.aceshowbiz.com/news/view/00090183.html", "ord_in_thread": 0, "title": "'Pretty Little Liars' Season 6B Featurette Teases the Reunion and New Problem", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments The four Liars get together again after five years without any distraction from 'A', but it's not all merry and bright as a new threat is looming. \n\" Pretty Little Liars \" isn't returning until early 2016, but a new look at the season 6B has now been provided in the form of a featurette. The video shares a lot of new footage, including offering glimpses of the Liars' reunion for a court hearing for Charlotte abuse case. Ali asks the four girls to testify, or more likely lie, about Charlotte in order to help Ali's sister. Soon, something from the past begins to haunt them and the Liars begin receiving mysterious messages. Aria is worried about deleting security footage of her doing something shaddy. She also encounters Ezra although the two seemingly are no longer dating. \"I know why you did what you did and I will do whatever it takes to help you,\" Aria tells Ezra, who isn't pleased at all. \"Who do you think I am?\" he asks back, before screaming to the girls, \" Get out, now!\" Toby and Caleb are also back and the latter is ready to put up a fight against whoever the blackmailer is. Caleb and Hanna are no longer together as Hanna is seen kissing another man. She appears to be engaged as she shows off something on her left ring finger to her friends. \"Pretty Little Liars\" returns January 12 at 8 P.M. ET on ABC Family which will change its name into Freeform beginning in 2016. It will feature a five-year time jump in the second half of season 6. Exec producer I. Marlene King said at the PaleyFest, \"It's lighter in some ways [season 6B] because we are starting a new mystery...we get to rely little bit more heavily on the soap as we start this new mystery.\" \n© AceShowbiz.com", "external_links": [], "published": "2015-10-24T08:59:00.000+03:00", "crawled": "2015-10-24T11:05:32.421+03:00", "highlightTitle": ""}