{"organizations": [], "uuid": "038c2dfaebfc57564dcd989e42e4e0672b3bff95", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.heraldscotland.com", "main_image": "http://www.heraldscotland.com/resources/images/4288811/", "site_section": "http://www.heraldscotland.com/arts_ents/", "section_title": "Arts and Entertainment | Herald Scotland", "url": "http://www.heraldscotland.com/arts_ents/13801272.Marilynne_Robinson_takes_on_the_neuroscientists/", "country": "GB", "title": "Marilynne Robinson takes on the neuroscientists", "performance_score": 0, "site": "heraldscotland.com", "participants_count": 1, "title_full": "Marilynne Robinson takes on the neuroscientists (From Herald Scotland)", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T07:08:00.000+03:00", "replies_count": 0, "uuid": "038c2dfaebfc57564dcd989e42e4e0672b3bff95"}, "author": "Rosemary Goring", "url": "http://www.heraldscotland.com/arts_ents/13801272.Marilynne_Robinson_takes_on_the_neuroscientists/", "ord_in_thread": 0, "title": "Marilynne Robinson takes on the neuroscientists", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Givenness Of Things\nMarilynne Robinson\nVirago, £18.99\n“There are advantages,” writes Marilynne Robinson, “in being a self-declared Calvinist from northern Idaho, from the point of view of evading easy categories.” She is a rare person indeed, but not just for these reasons. Others include winning the Pulitzer for fiction, and being a friend of President Obama. Yet there is no doubt that, among the fraternity of novelists, her devoutness sets her apart. Indeed, there are those who read Robinson’s slim output of novels with reluctance, finding her Christian outlook neither comfortable nor subtle, yet unable to resist the lure of her language and characters. For anyone hesitating to try her fiction because of the religious reputation that precedes it, I recommend they read this collection of essays.\nThe Givenness Of Things is Robinson unadorned, speaking her mind forthrightly, sometimes with frustration, often with dry humour, and occasionally so caught up in the complexities of her ideas – and they can be very knotty indeed – that she neglects to make herself entirely comprehensible. This lapse in her customary clarity is an oddly likeable oversight, suggestive of the urgency and importance of what she wants to say, rather than the perfectionism of the artist for whom style is as crucial as content.\nThere is nothing easy about this book, but it repays the concentration it demands. Perhaps the least accessible of its chapters is the opening essay, placed as if to warn anyone misled by works such as Gilead or Lila into expecting instant gratification. However, that first piece, Humanism, sets the tone for what follows. It is, in essence, an assault on neuroscience which, says Robinson witheringly, seems barely to have evolved in the century since its inception.\nPromoted stories It is a recurring theme, “scientists taking as the whole of reality that part of it their methods can report”. In a later essay she continues, as if on the same page, “Neuroscience does not know what the mind or the self is, and has made a project of talking them out of existence for the sake of its theories which exclude them.”\nThe profession’s dismissal of an entire realm of human experience shocks, appals and offends her. Her riposte to their simplification of the world as she finds it, rather than as they believe or wish it to be, makes for an invigorating denunciation of a field that tries to reduce rather than fully comprehend the nature of being human: “The physical as we have come to know it frays away into dark matter, antimatter, and by implication on beyond them and beyond our present powers of inference. But for these scientists it is a business of nuts and bolts, a mechanics of signals and receptors of which no more need be known.”\nThose not interested in questions of theology, the self or religious history might not fall under Robinson’s astringent spell, but I doubt many could resist the enthusiasm she brings to her subjects, be it the compiling of the King James Bible, based largely on the reformer Tyndale’s version – thus written for the common people; the New Testament concept of fathers and sons; or the alarming evolution of what the terms Christian and fundamentalist mean in modern America.\nAt the heart of this book lies an idea not everyone will agree with in religious terms, but which all but the most devout sceptics must surely acknowledge might hold a grain of truth. In the chapter called Givenness, from which the book takes its (exceptionally clumsy) title, she declares: “the argument for the alternative architecture proposed by religion, that moral structures are essential elements of cosmic reality, taking precedence over space and time and gravity matter and force, is formidable.” Those resistant to the concept of God, or an equivalent, will doubtless baulk at this, but if one follows Robinson’s reasoning, what initially appears to be tub-thumping sermonising, actually opens the mind to the possibilities of the unquantifiable elements in human history that defy the laboratory, but have yet to be entirely explained.\nNot that this book is an attempt to convert readers to Robinson’s way of thinking, though it is likely that it will provoke serious contemplation among believers and non-believers alike. The impression her often trenchant, occasionally meandering meditations leaves is more of someone following her own train of thought, as fast and as honestly as she can.\nAnyone keen to skip the more explicitly spiritual Christian passages, however, can still find plenty to slake their interest. In Grace, for instance, Robinson argues convincingly that Shakespeare imbued his plays with profound theological meaning, much of it so heretical it had to be implicit rather than plain. The radical Calvinist idea of the doctrine of grace is, she suggests, to be found in many of his most successful works, from Hamlet and The Winter’s Tale to Antony And Cleopatra and The Tempest, where the gathering up of plot at their conclusion hints at a profound understanding of new thought at the time. So powerful was his use of such concepts that, she writes, “his theological seriousness is simultaneous with his greatness as a dramatist”.\nElsewhere she describes the literary impact of the Reformation, and the great flowering of languages beyond Latin that this allowed. Drawing a line between the works of William Langland, whose narrative poem Piers The Ploughman marked a religious watershed in popular form in the 14th century, through to John Bunyan’s Pilgrims’ Progress in the 17th century, she makes a case for the general population being far better informed and intellectually questioning than has often previously been thought. The raucous scenes in Shakespeare’s plays were not, she argues, mere sops to the uneducated in the audience; rather, the plays’ revolutionary religious ideas would have been as intelligible to them as to those in the expensive seats.\nShare article In recreating the motivation and feelings of writers from history, as in her more minute examination of Christian doctrine, Robinson makes full use of her writerly imagination. It proves a great asset when tackling regions of higher thought, especially those dealing with the ineffable, or unknowable. Had more clergy been endowed with it, the pews might not be any more packed today than in yesteryear, but at least their occupants would be better served.\nAll this risks making it sound as if an unbridgeable gulf lies between Robinson’s popular novels and these intellectual exercises. That is certainly true in terms of style, but with her emphasis on the understanding of ordinary yet remarkable people, her openness to reality beyond the physical, and her assurance of an omnipotent organising principle or structure that underpins the world, everything she writes about here is also to be found in her fiction.", "external_links": ["https://twitter.com/share?url=", "https://www.facebook.com/sharer/sharer.php?u="], "published": "2015-10-03T07:08:00.000+03:00", "crawled": "2015-10-03T06:01:54.959+03:00", "highlightTitle": ""}