{"organizations": [], "uuid": "6af4e0567ceda17abb624cef7b217a6a5f0cd718", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mercurynews.com", "main_image": "http://local.mercurynews.com/common/dfm/assets/logos/1200x627/mercurynews.png", "site_section": "http://feeds.contracostatimes.com/mngi/rss/CustomRssServlet/571/201109.xml", "section_title": "Entertainment", "url": "http://www.mercurynews.com/celebrities/ci_28924048/youtube-star-caleb-logan-bratayley-dies-mysteriously-at?source=rss", "country": "IL", "title": "YouTube star Caleb Logan Bratayley dies mysteriously at 13", "performance_score": 0, "site": "mercurynews.com", "participants_count": 1, "title_full": "YouTube star Caleb Logan Bratayley dies mysteriously at 13", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T21:44:00.000+03:00", "replies_count": 0, "uuid": "6af4e0567ceda17abb624cef7b217a6a5f0cd718"}, "author": "Compiled by Martha Ross\n\nmross@bayareanewsgroup.com", "url": "http://www.mercurynews.com/celebrities/ci_28924048/youtube-star-caleb-logan-bratayley-dies-mysteriously-at?source=rss", "ord_in_thread": 0, "title": "YouTube star Caleb Logan Bratayley dies mysteriously at 13", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "YouTube star Caleb Logan Bratayley dies mysteriously at 13 Compiled by Martha Ross Posted: 10/05/2015 11:43:13 AM PDT Updated: 10/05/2015 11:44:53 AM PDT Caleb Logan Bratayley, one of the stars of the popular YouTube family known as the Bratayleys, has died. He was 13. \nIn an Instagram post on Friday, Caleb's mother, Katie, said her son died of \"natural causes\" at 7:08 p.m. Thursday, People magazine reported. \n\"This has come as a shock to all of us. Words cannot express how much we miss him.\" \nThe family -- whose real name is not Bratayley -- has become a YouTube sensation, racking up more than a billion views -- for their daily videos that chronicle the day-to-day events of their lives. \nThe ambiguity of the statement about Caleb's death, plus the fact that he appeared healthy in the family's previous videos, has prompted fans to question the reason for his death, People said. \nTMZ, citing law enforcement sources, said Caleb died Thursday night in Maryland. A 911 call was placed at 7 p.m. and police and fire crews responded to the family's home. \nIn their videos and social media posts, the Bratayleys have asked for privacy while they grieve and have not gone into specifics about Caleb's death. \n\"His incredibly funny, loving and wonderful spirit made us all fall in love with him as a YouTuber, friend, brother and son,\" his mother Katie wrote. \"We know you tune in to watch each day and eagerly anticipate new videos, but ask that you bear with us while we deal with this tragedy as a family.\" \nOn Sunday, Katie shared a video on YouTube of her son the day before he died, CBS News reported. Advertisement \nIn the video, Caleb talks about what he wants to ask his future self -- questions like, \"Is Taco Bell still around?\" \nThe Bratayley family started their channel in 2010 and have 1.6 million subscribers. Logan is survived by his two sisters, Annie and Hayley, and his mother and father Billy, CBS News said. \nMartha Ross provides celebrity commentary for the Bay Area News Group. Follow her at twitter.com/marthajross .", "external_links": [], "published": "2015-10-05T21:44:00.000+03:00", "crawled": "2015-10-05T21:56:45.688+03:00", "highlightTitle": ""}