{"organizations": [], "uuid": "42c9b7dd3bbbcc079a2871334910de632cb6907a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://images.canberratimes.com.au/2015/10/01/6891512/Thumbnail1000966037gh6dvuimage.related.thumbnail.320x214.gjy6c5.png1443688404525.jpg.jpg", "site_section": "http://feeds.canberratimes.com.au/rssheadlines/entertainment.xml", "section_title": "Canberra Times Entertainment Headlines", "url": "http://www.canberratimes.com.au/entertainment/movies/jed-kurzel-on-why-macbeth-echoes-snowtown-and-how-the-score-was-almost-electronic-20151001-gjy6c5.html", "country": "AU", "title": "Jed Kurzel on why Macbeth echoes Snowtown and how the score was almost electronic", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "Jed Kurzel on why Macbeth echoes Snowtown and how the score was almost electronic", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T16:45:00.000+03:00", "replies_count": 0, "uuid": "42c9b7dd3bbbcc079a2871334910de632cb6907a"}, "author": "Karl Quinn", "url": "http://www.canberratimes.com.au/entertainment/movies/jed-kurzel-on-why-macbeth-echoes-snowtown-and-how-the-score-was-almost-electronic-20151001-gjy6c5.html", "ord_in_thread": 0, "title": "Jed Kurzel on why Macbeth echoes Snowtown and how the score was almost electronic", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play video Return to video Video settings Please Log in to update your video settings\nVideo will begin in 5 seconds.\nDon't play Play now More video Recommended Replay video Return to video Video settings Please Log in to update your video settings\nTrailer: Macbeth An adaptation of the Shakespeare play in which trio of witches prophesy that Macbeth, a duke of Scotland, will become King and consumed by ambition he makes the prophecy real.\nPT1M52S http://www.canberratimes.com.au/action/externalEmbeddedPlayer?id=d-43em2 620 349 September 25, 2015 Autoplay On Off Video feedback Video settings More on Macbeth Movie session times Full movies coverage Writing music for a movie is an inexact science, says Jed Kurzel, who has notched up six additional feature scores since writing his first, for brother Justin's Snowtown in 2011.\n\"Sometimes it doesn't take long to get there, and other times you go, `Oh, finally',\" he says. \"In the end, you can throw a lot of music at a film and most of it is going to work, but it's kind of rare that you start putting things in and the film says, `This is it. I don't want anything else.' \"\nBrothers in arms: Jed (left) and Justin Kurzel. Photo: Kitty Gale \nIn the case of Macbeth , his latest collaboration with his brother, the final score was the product of six months' work. It's a string-heavy, vaguely folk-leaning sound that seems to evoke the cold and mist of the Scottish landscape in which the film was shot under very trying conditions.\nAdvertisement \"There's kind of a rustic element to it,\" Kurzel says. \"The element of the witches in there – the score kind of followed them for a while – but also this feeling that the landscape is cursed.\"\nAlthough the locations couldn't be more different, what Macbeth's images provoked in him was \"not so different from  Snowtown in a way\".\nJed Kurzel says he had a similar response to seeing images of Macbeth 's landscape as he did to that of Snowtown . Photo: Peter Mathew \nThe Kurzel brothers grew up in the suburbs north of Adelaide, where Snowtown is set, and when Jed first saw the shots of the serial killer John Bunting (Daniel Henshall​) and his young apprentice, Jamie (Lucas Pittaway​) driving out into the countryside, he felt he had found his sound.\n\"There was something in that that kind of informed the music, the way it should be and where I felt it was coming from,\" he says.\nWhen he saw the rushes from Macbeth , \"I was getting the same kind of sense, that the landscape was going to play a big part, that it was a character in itself\", but the score didn't suddenly announce itself to him fully formed – quite the contrary, in fact.\n\"I gave them lots and lots of music,\" Kurzel says. \"We'd go down one track for a couple of weeks and then move somewhere else. There was another score. It wasn't completely finished, but it was a very different tone.\"\nWhat, was it chirpy?\n\"No,\" he says, laughing. \"It's very hard to write chirpy music for someone on a killing spree. It was a little more electronic, more obviously modern, but I started to see that was becoming a bit of a trend in films and I wanted to keep away from that. I wanted to use strings in a way that felt kind of modern, but had a traditional feel as well.\"\nKurzel, who says his rock duo the Mess Hall is an ongoing proposition with vague plans to record another album (time permitting) soon, sees himself as part of a new movement in scoring movies, dominated by the likes of Portishead's Geoff Barrow ( Ex Machina ​ ) and Radiohead's Johnny Greenwood ( There Will Be Blood , Inherent Vice ).\nWhat they share, apart from a background in bands, is a sense that a score doesn't just have to serve as wallpaper or manipulation.\n\"When I did Snowtown , the jumping-off point was, `What don't I want to hear in a score',\" he says. \"A lot of the time I watch films and the music's doing that kind of swelling stuff, and I start to get suspicious about why it's there. It's just there pushing bad performances.\"\nThat's something no one is likely to say about Macbeth .\nFollow Karl Quinn on twitter: @karlkwin \nOn Facebook: karl quinn writer", "external_links": [], "published": "2015-10-01T16:45:00.000+03:00", "crawled": "2015-10-01T23:36:52.088+03:00", "highlightTitle": ""}