{"organizations": [], "uuid": "e93c6c4b631af84b1d5c1027a7752494dbe1c226", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.vancouversun.com", "main_image": "", "site_section": "http://rss.canada.com/get/?F6962", "section_title": "Vancouver Sun - Entertainment / Arts", "url": "http://www.vancouversun.com/entertainment/movie-guide/movie+review+coming+home+navigates+tricky+path/11406720/story.html", "country": "CA", "title": "Movie review: Coming Home navigates a tricky path through a tearful story", "performance_score": 0, "site": "vancouversun.com", "participants_count": 0, "title_full": "Movie review: Coming Home navigates a tricky path through a tearful story", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:41:00.000+03:00", "replies_count": 0, "uuid": "e93c6c4b631af84b1d5c1027a7752494dbe1c226"}, "author": "", "url": "http://www.vancouversun.com/entertainment/movie-guide/movie+review+coming+home+navigates+tricky+path/11406720/story.html", "ord_in_thread": 0, "title": "Movie review: Coming Home navigates a tricky path through a tearful story", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mao", "Feng Wanyu", "Li Gong", "Bai XiaoYan"], "text": "Li Gong stars as Feng Wanyu, a wife who forgets her husband’s face after the trauma of his long imprisonment during the Mao years. Bai XiaoYan/ Sony Pictures Classics. \nComing Home \nRating: 3.5 stars out of 5 \nStarring: Li Gong, Daoming Chen, Huiwen Zhang \nDirector: Yimou Zhang \nDuration: 109 minutes \nIf they ever remake The Notebook — and I’m not suggesting they do! — I would want director Yimou Zhang at the helm. In addition to an impressive resume that includes Raise the Red Lantern, Hero and House of Flying Daggers, Zhang has handled some potentially gooey melodrama, — The Road Home (1999), for instance — with a minimum of mawkishness. \nHis newest, Coming Home, has a certain Notebookishness to its central plot. In the early 1970s, Dan Dan (Huiwen Zhang), an aspiring ballet dancer, is growing up without a father. Lu (Daoming Chen), has been imprisoned to be “re-educated” as part of China’s Cultural Revolution, though, as the film begins, we learn that he has escaped. \nLu makes a passionate though ultimately foolish attempt to contact Dan Dan’s mother, Yu (Li Gong), at a busy train station. A four-way chase ensues — Zhang expertly handles a scene of guards in pursuit of Lu, who is trying to make his way to Yu, even as Dan Dan tries to hold her mother back lest she be arrested and taken away as well. In ends with Lu back in custody, and Yu bleeding from a head wound. \nThree years later, the Cultural Revolution is over, and Lu comes back to his hometown, bearing an official letter of rehabilitation. Dan Dan, stigmatized because of her father, has had to give up dancing, and now works in a factory. Yu continues her life much as before, but it soon becomes apparent that her trauma has caused her to forget her husband’s face. After briefly appearing to recognize him, she starts calling him Fang, a party functionary whom she desperately dislikes. \nThis is where the meat of the story is to be found. Lu takes up residence near his wife’s home and tries to find a way to remind her who he is. He pens a letter, promising to arrive by train on “the 5th,” then dutifully shows up at the station, only to have her look right through him as she searches for her husband. (The lack of a month means he can try again in 30 days, as she rediscovers the letter anew.) \nThe story plays out on two levels. Film students could write papers on the metaphors of forgetfulness and rewritten history during the Mao years. Dan Dan had long ago removed Lu’s image from their family photo album, so he can’t even show Yu a picture of them together. Later the daughter complains of her mother: “She forgets everything but remembers all my faults!” \nYet there is a much simpler human drama on the screen as Lu, with remarkable patience and forbearance, tries to jog his wife’s recall. Beautiful, melancholy images — a rain-streaked sign, a cloth-covered piano — evoke the fragility of memory. And Dan Dan manages a quiet reconciliation with both parents, even as they remain strangers to one another. \nThis is Zhang’s second time adapting a novel by Geling Yan. His last movie, The Flowers of War (2011), with Christian Bale, dramatized an episode during the Japanese rape of Nanking in 1937. But where that story seemed sometimes to teeter over the edge of coincidence and into contrivance, Coming Home stays remarkably grounded, anchored by fine performances and unsullied by oversentimentality. It may move you to tears, but it won’t push you there. © Copyright (c) The Vancouver Sun", "external_links": [], "published": "2015-10-02T03:41:00.000+03:00", "crawled": "2015-10-02T09:02:06.103+03:00", "highlightTitle": ""}