{"organizations": [], "uuid": "e2239c33e732fd5968a5a28f1cbd7731760faa28", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266347/arts-entertainment-general", "section_title": "Arts &amp; Entertainment: General - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30172806/kevin-hart-presents-plastic-cup-boyz-to-be-released-on-comedy-dynamics-1013", "country": "US", "title": "Kevin Hart Presents: Plastic Cup Boyz to be Released on Comedy Dynamics 10/13", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Kevin Hart Presents: Plastic Cup Boyz to be Released on Comedy Dynamics 10/13 - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T21:01:00.000+03:00", "replies_count": 0, "uuid": "e2239c33e732fd5968a5a28f1cbd7731760faa28"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30172806/kevin-hart-presents-plastic-cup-boyz-to-be-released-on-comedy-dynamics-1013", "ord_in_thread": 0, "title": "Kevin Hart Presents: Plastic Cup Boyz to be Released on Comedy Dynamics 10/13", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Kevin Hart Presents: Plastic Cup Boyz will be available on Comedy Dynamics October 13, 2015.\nLos Angeles, CA (PRWEB) October 02, 2015\nKevin Hart brings Joey Wells, Will “Spank” Horton and Na’im Lynn, a hysterical troupe of comedians known as the Plastic Cup Boyz to the stage. All three comedic acts are introduced with a short skit starring Kevin Hart. Each of the ‘boyz’ brings a different energy and comedic style to the show, tackling their issues with college, eyebrows, and cat clocks. This is the first special starring the Plastic Cup Boyz, and was filmed in front of a live audience at the House of Blues in San Diego.\nThis is the second special in the Hartbeat Productions and Comedy Dynamics trilogy which also includes Kevin Hart Presents - Keith Robinson: Back of the Bus Funny and Kevin Hart Presents - Lil Rel Howery: RELevent. Hart recently concluded his What Now Tour, which has been called the “biggest comedy tour in history.” He is currently filming Central Intelligence with Dwayne Johnson, aka “The Rock.” Other recent film credits include Get Hard, opposite Will Farrell, and The Wedding Ringer. Previously he has starred in Think Like a Man, Think Like a Man Too, Ride Along, Grudge Match opposite Sylvester Stallone and Robert DeNiro. Hart also had a supporting role in the Nick Stoller comedy Five Year Engagement, produced by Judd Apatow. He is a force in television as an executive, producing the hit BET show, Real Husbands of Hollywood.\n“Each one of these artists has different comedic styles,” says Brian Volk-Weiss, President of Comedy Dynamics. “The variety of comics is what keeps the energy high throughout the special.”\nComedy Dynamics is the largest independent comedy production and distribution company in North America, specializing in a range of established and emerging comedic talent including Aziz Ansari, Jim Gaffigan, Bill Burr, Chelsea Peretti, Katt Williams and many more. The Comedy Dynamics catalog is available on most video streaming platforms including, but not limited to: Hulu, Roku, iOS, Amazon, and Android.\n //www.prweb.com/releases/2015/10/prweb12999295.htm\n ", "external_links": ["http://www.prweb.com/releases/2015/10/prweb12999295.htm"], "published": "2015-10-02T21:01:00.000+03:00", "crawled": "2015-10-02T22:13:00.695+03:00", "highlightTitle": ""}