{"organizations": [], "uuid": "0cbccdbfad3ec9d09668c4ac5ff8db2d5bde33ae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "savannahnow.com", "main_image": "http://savannahnow.com/sites/default/files/795a783167125f2d840f6a706700d4e5.jpg", "site_section": "http://savannahnow.com/", "section_title": "savannahnow.com | Savannah Georgia's source for News, Entertainment, Sports, Weather, Classifieds, Jobs, Autos, Real Estate and St. Patricks Day", "url": "http://savannahnow.com/news/2015-10-09/searchers-find-boys-alive-kentuckys-red-river-gorge-area", "country": "US", "title": "Searchers find boys alive in Kentucky's Red River Gorge area", "performance_score": 0, "site": "savannahnow.com", "participants_count": 1, "title_full": "Searchers find boys alive in Kentucky's Red River Gorge area | savannahnow.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T16:44:00.000+03:00", "replies_count": 0, "uuid": "0cbccdbfad3ec9d09668c4ac5ff8db2d5bde33ae"}, "author": "BRUCE SCHREINER | Associated Press", "url": "http://savannahnow.com/news/2015-10-09/searchers-find-boys-alive-kentuckys-red-river-gorge-area", "ord_in_thread": 0, "title": "Searchers find boys alive in Kentucky's Red River Gorge area", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photos Dave and Julia Esposito with their son, Michael after he was found near the Koomer Ridge Campground in the Red River Gorge, near Slade, Ky., Friday, Oct. 9, 2015. Two young cousins alone and lost in the Appalachian woods ate sticks and slept on the ground during a 20-hour ordeal that ended when searchers found them unharmed Friday in the rugged terrain in the Red River Gorge area of Kentucky, the mother of one boy said. (Charles Bertram/Lexington Herald-Leader via AP) SPECIAL OFFER FOR NEW READERS 99 cent digital subscription to savannahnow.com\nSubscriber-members get access to ALL our digital products AND become eligible for free event tickets, discount coupons and other benefits. SIGN UP FOR SUBSCRIBER BENEFITS As a Savannah Morning News / savannahnow.com subscriber, you're eligible for members-only discounts. Download your coupons now. SPECIAL OFFER FOR NEW READERS 99 cent digital subscription to savannahnow.com\nSubscriber-members get access to ALL our digital products AND become eligible for free event tickets, discount coupons and other benefits. SIGN UP FOR SUBSCRIBER BENEFITS As a Savannah Morning News / savannahnow.com subscriber, you're eligible for members-only discounts. Download your coupons now. By BRUCE SCHREINER | Associated Press LOUISVILLE, Ky. (AP) — Two young cousins alone and lost in the Appalachian woods ate sticks and slept on the ground during a 20-hour ordeal that ended when searchers found them unharmed Friday in the rugged terrain in the Red River Gorge area of Kentucky, the mother of one boy said.\nThe boys, ages 5 and 7, were found about a mile from the family's campsite in the popular recreation area, Kentucky State Police Trooper Joe Veeneman said. Their disappearance Thursday evening from the campsite set off a massive search in the wooded, ravine-filled area.\nThe boys came away from the adventure with only a few bumps and scrapes, the trooper said.\n\"No more scrapes than they would normally get on a hike,\" said Julia Esposito, the mother of one of the boys.\n\"They're in great shape, good spirits,\" she added. \"They don't want to leave the campout.\"\nOne boy was identified as 5-year-old Michael Esposito of Batavia, Ohio. His cousin, 7-year-old Adrian Ross, is from Bloomington, Indiana.\nThe boys had gone to the campsite with the younger boy's father and a grandfather of both boys, Veeneman said. They had gone ahead of other family members who were joining them later, he said.\nJulia Esposito said her husband was pitching a tent and her father was cooking dinner when the boys wandered off. The boys had been running around with three other young relatives as the adults tended to the campsite, she said.\n\"Two of them went off just exploring and went a little bit too far and just disappeared,\" she said. \"If you get over a ridge and get yourself turned around, it's easy to get lost.\"\nThe boys didn't seem spooked by their night alone in the woods, Esposito said.\n\"If you talk to them, they weren't afraid and they weren't cold,\" she said. \"It was so dark that they couldn't see each other.\"\nThey told family that they slept on the ground under a tree. Overnight lows dipped into the mid-50s.\n\"They decided to eat some sticks because they didn't know what else to eat, because they knew they shouldn't eat mushrooms or berries,\" she said.\nThe rescuer who found them said later that the boys were calm, she said. The boys gobbled cookies and jerky and guzzled water offered by rescuers.\nFor the family, it was \"a nailbiter of a night\" as the search continued, Esposito said.\n\"You keep imagining the worst-case scenario,\" she said.\nSearchers used dogs to try to track the boys. A helicopter also flew over the area as part of the search.\nRain started falling soon after the boys were found Friday afternoon.\nEven after its ordeal, the family was staying in the area and planned to hike on Saturday, Esposito said.\nRed River Gorge is a heavily wooded, rocky destination popular with hikers, campers and rock climbers.", "external_links": ["http://sav-cdn.com/sites/all/themes/savannahnow/images/blank.gif", "http://sav-cdn.com/sites/default/files/imagecache/story_slideshow_thumb/795a783167125f2d840f6a706700d4e5.jpg", "http://sav-cdn.com/sites/default/files/imagecache/superphoto/795a783167125f2d840f6a706700d4e5.jpg"], "published": "2015-10-09T16:44:00.000+03:00", "crawled": "2015-10-10T04:04:24.422+03:00", "highlightTitle": ""}