{"organizations": [], "uuid": "5daddfeb6392422da49e4ac22d19a1f3ae9a0e7a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.yahoo.com", "main_image": "http://l3.yimg.com/bt/api/res/1.2/lw_NfKrklxYbLkBf6eQ0Zw--/YXBwaWQ9eW5ld3NfbGVnbztpbD1wbGFuZTtxPTc1O3c9NjAw/http://media.zenfs.com/en_us/News/ap_webfeeds/251d2a3312b2262d840f6a70670054b7.jpg", "site_section": "http://news.yahoo.com/rss/entertainment/", "section_title": "Entertainment News Headlines — Yahoo! News", "url": "http://news.yahoo.com/celebrities-hit-paris-shows-balenciaga-names-designer-145441121.html", "country": "GB", "title": "Celebrities hit Paris shows as Balenciaga names new designer", "performance_score": 0, "site": "yahoo.com", "participants_count": 2, "title_full": "Celebrities hit Paris shows as Balenciaga names new designer - Yahoo News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 1, "uuid": "3355c5ca04794c4e183935195a1e7a22973934be"}, "author": "THOMAS ADAMSON", "url": "http://news.yahoo.com/celebrities-hit-paris-shows-balenciaga-names-designer-145441121.html#post-0", "ord_in_thread": 0, "title": "Celebrities hit Paris shows as Balenciaga names new designer", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "PARIS (AP) — The chicest celebrities in the business rocked the final day of Paris Fashion Week on Wednesday as powerhouse Louis Vuitton and Miuccia Prada's VIP-magnet Miu Miu presented their spring-summer 2016 collections.\nBut among fashion insiders it was the unexpected decision by Balenciaga to name its new artistic director that drew the most attention.\nHere are Wednesday's fashion highlights:\n___\nBALENCIAGA'S NEW DESIGNER\nOutgoing Alexander Wang had only just said his final catwalk goodbyes in an emotional and intimate show in Paris last week.\nView gallery A model wears a creation for Miu Miu's Spring-Summer 2016 ready-to-wear fashion collection prese … Now Kering, the luxury group that owns Balenciaga, made a shock announcement Wednesday that 34-year-old Georgian designer Demna Gvasalia would be replacing him.\nIt's the third Balenciaga designer in four years for the Parisian house.\nThe appointment of Gvasalia, head designer of street wear brand Vetements, has raised some eyebrows among fashion insiders as his casual aesthetic appears to be at odds with the established Balenciaga, which was founded in 1919.\n___\nLOUIS VUITTON FRONT ROW\nView gallery Models wear creations for Miu Miu's Spring-Summer 2016 ready-to-wear fashion collection presente … \"Man from U.N.C.L.E.\" star and Louis Vuitton ambassador Alicia Vikander turned heads at the Wednesday show in a demure white embroidered top with a frilly ruff, holding court next to powerful U.S. Vogue Editor Anna Wintour and Australian model Miranda Kerr, who sported a multicolored silk blouse and a black leather mini.\nThey joined Michelle Williams, who appeared in a Peter Pan collar and blond bob, posing for the cameras next to Canadian director Xavier Dolan and French icon Catherine Deneuve.\nElsewhere, American comedian Steve Harvey was in light spirits, laughing and chatting with his wife.\n___\nLOUIS VUITTON'S GLADIATOR\nView gallery A model wears a creation for Miu Miu's Spring-Summer 2016 ready-to-wear fashion collection prese … Wednesday's collection saw an increasingly confident Nicolas Ghesquiere steer Louis Vuitton in a bold new direction toward the female gladiator.\nBlack studded platform sandals, a belt with a pointy end descending like a dagger, and a heavy black skirt drew attention on the runway.\nA dangerous-looking model marched past with a head-clasp, a third eye and tribal makeup. A pink leather coat sported aggressive black pockets and lines, with a zipper creating a pointed angle with the lapel.\nDecorative Roman-style A-line and billowing gathered skirts, followed black mesh sportswear, mirroring chainmail and fingerless gloves.\nIts kinesis mirrored the show decor inside the abstract Frank Gehry-designed Louis Vuitton Foundation, which has bold interlocking geometric shapes.\nView gallery A model wears a creation for Miu Miu's Spring-Summer 2016 ready-to-wear fashion collection prese … Ghesquiere's metaphor was not lost. This show was the French's designer's fight to mark out creative ownership of the world's most lucrative luxury brand, following the near-indomitable legacy of Marc Jacobs. And it was a resounding success.\n___\nMIU MIU'S GLAM ROCK BOOTS\nOversize sleeves, big coats and show-stopping glam rock boots hit the spot for Prada's little tongue-in-cheek sister brand Miu Miu — a line that's all the rage for edgy pop stars like Miley Cyrus.\nThe Wednesday show was replete with quirky ideas — dyed fox-tails hanging off belts, sheer lingerie on top of nurses' outfits and padlocks locked to mismatched ankle-tied ribbons.\nView gallery A model wears a creation for Miu Miu's Spring-Summer 2016 ready-to-wear fashion collection prese … It was the \"more is more\" philosophy we've seen before.\nBut the 39-piece collection was also a showcase of Prada's precise tailoring on some of the best coats of the season. They had contrasting patterns — check, plaid or big ethnic lozenge motifs down shiny boxy leather jackets.\nThe skirts played with transparency and were set off nicely by the silver-and-gold foil-wrapped auditorium.\n___\nMONCLER GAMME ROUGE\nView gallery A model wears a creation for Miu Miu's Spring-Summer 2016 ready-to-wear fashion collection prese … Italian designer Giambattista Valli is leading this arm of Moncler in a more floral — well, more Valli — direction. And that's not a bad thing.\nThe backdrop this season was again a country hillside but more of a spring meadow this time, with yellow-and-blue blooms that made the girly collection appear fresh.\nThe voluminous jackets associated with this brand are now completely gone, replaced by a new white-dominated aesthetic that borrows from Valli's eponymous ready-to-wear line.\nPlays on transparencies in sheer A-line skirts — often embroidered with flower motifs and white laurel crowns— gave this 41-piece display a diaphanous vibe.\nWhite equestrian helmets, large and surreal, injected a sporty vibe alongside swimming suit-style bodysuits and white sneakers.\n___\nThomas Adamson can be followed at Twitter.com/ThomasAdamsonAP\nFashion Arts & Entertainment Louis Vuitton Miuccia Prada Balenciaga Paris Fashion Week Miu Miu", "external_links": [], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-08T07:53:07.613+03:00", "highlightTitle": ""}