{"organizations": [], "uuid": "ee8fd2d8ca4d506c03fb8a23696c19b2c7617456", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "savannahnow.com", "main_image": "http://savannahnow.com/sites/default/files/images/sms-default-facebook-share.jpg", "site_section": "http://savannahnow.com/", "section_title": "savannahnow.com | Savannah Georgia's source for News, Entertainment, Sports, Weather, Classifieds, Jobs, Autos, Real Estate and St. Patricks Day", "url": "http://savannahnow.com/opinion/2015-10-09/letters-editor-friday", "country": "US", "title": "Letters to the editor Friday", "performance_score": 0, "site": "savannahnow.com", "participants_count": 2, "title_full": "Letters to the editor Friday | savannahnow.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T20:09:00.000+03:00", "replies_count": 1, "uuid": "ee8fd2d8ca4d506c03fb8a23696c19b2c7617456"}, "author": "DispatchDaemon", "url": "http://savannahnow.com/opinion/2015-10-09/letters-editor-friday", "ord_in_thread": 0, "title": "Letters to the editor Friday", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "America meets the pontiff\nIntolerance permeates the fabric of our society and plays a powerful role in our perceptions, actions and attitudes. Even things that appear to have nothing to do with prejudice end up having everything to do with prejudice.\nRight-wing Conservatives keep badmouthing the pope. They keep proving the point that the “Christian” right is nothing more than an embarrassment to the world. Do we need any more proof?\nNonetheless, Pope Francis was a breath of fresh air during his six-day visit to the United States, his first time setting foot on American soil. Protocol set aside, he was greeted by President Barack Obama and the first family in addition to Vice President Joe Biden and his wife. It’s rare for the president to give an airport welcome, but he recognized the spiritual head of 70 million Catholics in America and more than 1 billion around the world.\nWe immediately witnessed the humility of this man who dispenses of the luxurious accommodation befitting his position and instead is driven in a small Italian Fiat.\nThe pope is greeted on his visits to the three cities by throngs of Catholics and non-Catholics, believers and non-believers, the curious, the skeptics, amidst cheers of “Il Papa.” As a practicing Catholic, my eyes became moist looking at smiling faces of adults and children wanting to come close to him, and he welcoming their touch while dispensing a blessing and a kiss to babies and the lame.\nHis visit was not without controversy after departing from American soil.\nWe learned he met “secretly” with Kim Davis, the Kentucky county clerk who refused to issue marriage licenses to same sex couples. The little that is reported by the media had tongues wagging.\nBut the most surprising development centers around the speaker of the House, John Boehner, a Catholic who came in close contact with the pontiff. What they said to each other may never be known, but is it coincidence that Boehner announced his resignation from the speakership? Some may conclude that the pope’s words had him examine his conscience and speak the truth that his colleagues are “false prophets.”\nTo add to the drama, Kevin McCarthy, the possible successor to Boehner, confessed that the Benghazi investigation was purely political to undermine Hillary Clinton’s poll numbers. A slip of the tongue, or more likely a papal secret weapon, the truth shall set you free.\nJEAN MAX DORSINVILLE\nPooler\nSavannah is losing its appeal\nWhile on vacation, I often have people tell me how much they love Savannah. Truth be told, I used to love her too. I was born and raised here, many of my classmates relocated after college, but I came back home.\nI am sorry to say that I don’t recognize the Savannah of today. The city is rampant with crime and poverty. Our elected officials acknowledge the problem, but they aren’t doing anything to resolve the situation. How many people have to lose their lives, cars or sense of security before officials back up their words with real, tangible action?\nYes, we all know about the shortage of police officers, so why haven’t local leaders reached out to state and/or federal agencies for help?\nI for one will be sure to express my discontent with the mayor and other elected officials at the ballot box in November. Savannah needs new leadership across the board. We need someone to address issues that affect local citizens like economic development, crime and education.\nIf Savannah stays on her current path, the best and brightest will leave and never return. Savannah will be a city where people will come to visit, but not to do business or raise families. You would think that a large port city like ours would be a great place to live and work, but it’s not.\nWhen compared to other Georgia cities, the wages here are lower, the homes cost more and the crime is extremely high. That leaves me to ask the question, why in the world would anyone want to bring their families or business here?\nIt’s time for citizens and local leaders to come together, take our city back and make it a desirable community once again.\nTAKELIA GOLDEN\nSavannah\nTown of Bluffton gaining its own identity\nThe Greater Bluffton Chamber of Commerce hosted the fourth annual Boiled Peanut Festival on Sept. 19 at the Bluffton Village Festival. Crowds were estimated around 5,000. This was a great turn out considering how this event started with the Bluffton Boilers, Jared Jester and Hannah Parrish four years ago at the Farmer’s Market with around 250 people.\nThe Chamber was then asked to take on this event and help grow it into a quirky, fun, family friendly event to be every bit the essence of our “Bluffton State of Mind.” Not only has this festival grown and become a success, but it also fulfills part of our “Bluffton” chamber’s mission to create opportunities and events that are not only great for our community, but also give our businesses a chance to gain exposure for their goods and services.\nBluffton has never been so vibrant for business as it is today. Bluffton has become the nucleus or center of commerce for this region (just imagine the possibilities once the Jasper County port takes flight).\nAs a Bluffton business owner and having grown up here, it was clear to me, as well as many other Blufftonians, that Bluffton has indeed grown up and was ready to represent itself. So, in order to help Bluffton gain its own identity, in January of 2012 the Greater Bluffton Chamber of Commerce was born. Its mission is to support business-to-business relationships, become a credible resource for those businesses and encourage them to be active in the community.\nThe focus is to have everyone working toward a common goal that supports all.\nEntering into our fourth year as a Chamber of Commerce chartered in Bluffton, we are well on our way to becoming a prominent upstanding chamber and supporter of the greater Bluffton area.\nAs we welcome our 500th business member (announcement coming), I look back on how far and how much we have accomplished in just a few years. I am amazed and humbled by the overwhelming support for the Greater Bluffton Chamber.\nI thank all of those that have been there for me and for this Chamber, its efforts, its events, its programs and its mission. I look forward to continue growing along with our businesses, our community, our region and our town.\nThank you, Bluffton.\nSHELLIE WEST HODGES\nCEO & Founder\nThe Greater Bluffton Chamber\nERIN M. BLACK\nExecutive Administrator\nGreater Bluffton Chamber of Commerce\nBluffton, S.C.", "external_links": ["http://sav-cdn.com/sites/all/themes/savannahnow/images/blank.gif"], "published": "2015-10-09T20:09:00.000+03:00", "crawled": "2015-10-09T17:33:19.409+03:00", "highlightTitle": ""}