{"organizations": [], "uuid": "de570d1299176ffb014f47bb2f98dfd880c1c641", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wpxi.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2014/06/18/bf/39/wpxi-logo-fb-default.jpg", "site_section": "http://www.wpxi.com/feeds/categories/entertainment/", "section_title": "News | Entertainment", "url": "http://www.wpxi.com/ap/ap/top-news/teammates-remember-lamar-odoms-productive-selfless/nn3j3/", "country": "US", "title": "Teammates remember Lamar Odom's productive, selfless career", "performance_score": 0, "site": "wpxi.com", "participants_count": 0, "title_full": "Teammates remember Lamar Odom's productive, selfless career", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T11:54:00.000+03:00", "replies_count": 0, "uuid": "de570d1299176ffb014f47bb2f98dfd880c1c641"}, "author": "", "url": "http://www.wpxi.com/ap/ap/top-news/teammates-remember-lamar-odoms-productive-selfless/nn3j3/", "ord_in_thread": 0, "title": "Teammates remember Lamar Odom's productive, selfless career", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Lamar Odom"], "text": "Updated: 4:54 a.m. Thursday, Oct. 15, 2015 | Posted: 4:54 a.m. Thursday, Oct. 15, 2015 Teammates remember Lamar Odom's productive, selfless career Sponsored Links The Associated Press LOS ANGELES — \nAlthough Lamar Odom's marriage to Khloe Kardashian introduced him to untold millions of fans who don't know a power forward from a paparazzo, reality television notoriety was only a small part of a life largely spent in basketball. \nOdom won two NBA championships with the Los Angeles Lakers and an award as the league's top reserve during his 14-year pro career, adding to a trophy case that also includes an Olympic medal and a FIBA world championship medal. \nOdom was a can't-miss prospect from the start of his playing days in Queens, a skilled ball-handler in a rangy big man's body. His versatility got him through a truncated college career into the NBA, where he played for four franchises and became known as an invaluable teammate who repeatedly sacrificed personal statistics for team success. \n\"All he cared about was playing basketball,\" said Knicks star Carmelo Anthony, a longtime friend. \"He wanted to give back to the league. Every time I talked to him, that's all he talked about.\" \nOdom's teammates and friends throughout the sport paid tribute after he was found unconscious in a Nevada brothel and rushed to a hospital this week. Several basketball figures visited Odom's bedside, including Kobe Bryant and Lakers general manager Mitch Kupchak. \n\"Lamar Odom is one of the greatest people I've ever known,\" said New York Knicks coach Derek Fisher, Odom's longtime teammate with the Lakers. \"I don't view him through the prism of choices that he's made. I view him through the heart and soul of the person that he really is.\" \nOdom's basketball gifts were multifold from the start. He sprouted to his full 6-foot-10 height during his prep career at Christ The King Regional High School in Queens, yet never lost the ball-handling and passing abilities of a smaller player. \nAnthony, another New York native and top-flight prospect born three years later, looked up to Odom's multifaceted game. \n\"L.O. was a point forward,\" Anthony said. \"A lot of people will tell you he was one of my favorite players coming out of high school, one of the best high school players I've seen as a kid.\" \nA hotly recruited prospect, Odom spent one year at UNLV without playing amid NCAA investigations. He transferred to the University of Rhode Island, where he won a conference title in his single season under coach Jim Harrick before entering the NBA draft. \nOdom was the fourth pick in the 1999 draft by the moribund Los Angeles Clippers, who evolved into a solid team during his four years. He was chosen for the 2004 U.S. Olympic basketball team in Athens, winning a bronze medal. \nAfter one season with the Miami Heat, Odom was traded to the Lakers in 2004 in a deal for Shaquille O'Neal. When the famed club hired coach Phil Jackson a year later, Odom became a key component of the Lakers' rise back to glory. \n\"He was an amazing teammate,\" Fisher said. \"Really an amazing player that possesses all the skills necessary to do everything on the floor you need done. I think his defense and rebounding was more spectacular than anything he can do on the floor offensively. (He was) one of the top reasons as to why we won championships in '09 and '10.\" \nOdom spent the best seven years of his career with the Lakers, hitting his professional stride in a jack-of-all-trades role. Led by Bryant and Pau Gasol, the Lakers reached three straight NBA Finals, winning two titles - the second with Ron Artest, his Queens childhood friend and former AAU teammate now known as Metta World Peace. \nOdom also became known for his generosity with other players, his family and even strangers. On his Twitter account, Magic Johnson said Odom would buy new suits for the Lakers' rookies each season. \n\"We understood what it means to be in a band of brothers, what it means to go through a lot of things together,\" said Sasha Vujacic, Odom's former Lakers teammate. \"He's someone with a heart of gold.\" \nOdom returned to the U.S. national team and won a gold medal at the 2010 world championships as a key contributor. When Odom won his Sixth Man award a year later, he donated the accompanying car to a Lakers children's charity. \nA few months after that, Odom's world began to unravel. \nHe was stunned when the Lakers attempted to send him to New Orleans in a multiplayer deal for Chris Paul. Odom said he spent days crying over the trade, which was nullified by NBA Commissioner David Stern. \nOdom refused to return to the Lakers and eventually went to Dallas in another deal. The Lakers' missteps were factored into the gradual decline of the team, which finished last season with the worst record in franchise history. \nAfter a productive season back with the Clippers in 2012-13, Odom was done in the NBA. \nAfter two-game stint in Spain, he signed with the New York Knicks in April 2014 right before the season ended when Jackson, now running the Knicks, attempted to throw a lifeline to his beloved former player. Odom never played and was cut in July. \nHe was still young enough to play again, but Odom never found the will or the clarity to get back on the courts he loved. \n\"We love you, man,\" Paul said after a news conference in Shanghai, where the Clippers are playing exhibition games. \"Keep fighting. He's a member of this fraternity, our basketball brotherhood, and we love you and we're all there for you, man.\" \n___ \nAP Basketball Writer Brian Mahoney in New York contributed to this report. Copyright The Associated Press Sign up for our WPXI-TV Daily Headlines Newsletter Sign Up", "external_links": [], "published": "2015-10-15T11:54:00.000+03:00", "crawled": "2015-10-15T12:41:54.068+03:00", "highlightTitle": ""}