{"organizations": [], "uuid": "2724524eaf2ef5e17615886d5b34a258529423d5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.aceshowbiz.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Aceshowbizcom-EntertainmentNews", "section_title": "Aceshowbiz.com - Entertainment News", "url": "http://www.aceshowbiz.com/news/view/00089598.html", "country": "US", "title": "Kris Jenner Disappointed With 'Disrespectful' Scott Disick for Cheating on Kourtney Kardashian", "performance_score": 0, "site": "aceshowbiz.com", "participants_count": 1, "title_full": "Kris Jenner Disappointed With 'Disrespectful' Scott Disick for Cheating on Kourtney Kardashian", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T10:07:00.000+03:00", "replies_count": 0, "uuid": "2724524eaf2ef5e17615886d5b34a258529423d5"}, "author": "AceShowbiz.com", "url": "http://www.aceshowbiz.com/news/view/00089598.html", "ord_in_thread": 0, "title": "Kris Jenner Disappointed With 'Disrespectful' Scott Disick for Cheating on Kourtney Kardashian", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments 'I think I've often made excuses for Scott and it's just getting tougher and tougher,' Kris says of Scott after she learned that he's cheating on her daughter Kourtney. \nKris Jenner was clearly unhappy when she first learned that Scott Disick cheated on her daughter Kourtney Kardashian . In the season finale of \" Keeping Up with the Kardashians \" airing on Sunday, October 12, the momager called Scott \"disrespectful.\" While Kris and her daughter Kim Kardashian were sitting in the kitchen, the pregnant reality TV star received a call from her cousin Cici Bussey who told them that Scott was pictured with a girl \"laying down together, with their arms around each other.\" Kris quickly reacted, \"No... that's a piece of s**t!\" Kris then googled the news on her mobile phone. She then read one of the headlines, to which Kim said, \"It's just embarrassing.\" The mother of six told the camera that there were photos of Scott and his ex-girlfriend \"feeding each other food.\" She called his action \"disrespectful\" to Kourtney. \"I think I've often made excuses for Scott and it's just getting tougher and tougher,\" Kris continued. Kim was worried about her elder sister Kourtney at that time. \"I feel really bad for Kourtney.\" Kim said. \"But maybe it's time.\" In a discussion with Kris and Kim, Kourtney said she's concerned about Scott's partying behavior and possible drug abuse problems. Kris commented, \"That's the biggest wake-up call of all, to be thrown in jail with no alcohol, no nothing, no pillow.\" Kim added, \"No one to bail him out.\" Later on, the 36-year-old reality TV star got very emotional. Kourtney told Kim that she's \"on the verge of a mental breakdown\" because of the troubles in her relationship with Scott. Kim advised Kourtney, \"I think you have to just try and move on.\" Kourtney replied, \"I could never depend on him for one single thing. I've worked so hard to keep this family together.\" Kourtney then told the camera, \"At this point, I'm really just trying to focus on me and the kids, and make them the priority.\" She told Kim, \"I can't do it anymore,\" to which Kim asked, \"Are you guys gonna fully break up?\" Kourtney answered, \"Yeah, I told him that...I really need it to be done.\" \n© AceShowbiz.com", "external_links": [], "published": "2015-10-12T10:07:00.000+03:00", "crawled": "2015-10-12T21:41:34.412+03:00", "highlightTitle": ""}