{"organizations": ["WMC Action News"], "uuid": "2d36ba8495024ecbdc44cefd7fc85fc86ebc0eea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wmcactionnews5.com", "main_image": "", "site_section": "http://www.wmctv.com/category/13540/news?clienttype=rss", "section_title": "WMC Action News 5 - Entertainment - Headline", "url": "http://www.wmcactionnews5.com/story/30185045/best-selling-swedish-author-henning-mankell-dead-at-age-67", "country": "US", "title": "Best-selling Swedish author Henning Mankell dead at age 67", "performance_score": 0, "site": "wmcactionnews5.com", "participants_count": 0, "title_full": "Best-selling Swedish author Henning Mankell dead at age 67", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T14:52:00.000+03:00", "replies_count": 0, "uuid": "2d36ba8495024ecbdc44cefd7fc85fc86ebc0eea"}, "author": "", "url": "http://www.wmcactionnews5.com/story/30185045/best-selling-swedish-author-henning-mankell-dead-at-age-67", "ord_in_thread": 0, "title": "Best-selling Swedish author Henning Mankell dead at age 67", "locations": ["Tennessee", "Memphis"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Henning Mankell"], "text": "Best-selling Swedish author Henning Mankell dead at age 67 - WMC Action News 5 - Memphis, Tennessee Member Center: Employment and Internship Opportunities Best-selling Swedish author Henning Mankell dead at age 67 \nSTOCKHOLM (AP) - Henning Mankell, the hesitant figurehead of Scandinavian crime fiction whose books about the gloomy, soul-searching police inspector Kurt Wallander enticed readers around the world, has died. \nMankell's publisher Leopard said Monday on its website that the author and theater director died in the city of Goteborg, southwestern Sweden, during the night following his battle with cancer. His books sold more than 40 million copies worldwide. \nIn January 2014, Mankell revealed he had been diagnosed with the disease and wrote about his fight against it in the Guardian and a Swedish daily. \nSurvivors include his wife, Eva Bergman, the daughter of legendary Swedish film director Ingmar Bergman. Copyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Updated: Monday, October 5 2015 6:53 AM EDT 2015-10-05 10:53:48 GMT The White House is announcing the designation of two new National Marine Sanctuaries - the first chosen in 15 years - as part of President Barack Obama's efforts to protect the environment. More >> The White House is announcing the designation of two new National Marine Sanctuaries - the first chosen in 15 years - as part of President Barack Obama's efforts to protect the environment. More >> Updated: Monday, October 5 2015 6:12 AM EDT 2015-10-05 10:12:54 GMT The Obama administration is tightening limits on the smog-forming pollution that's linked to asthma and respiratory illness - setting a new national ozone standard of 70 parts per billion. More >> The Obama administration on Thursday established stricter limits on the smog-causing pollution linked to asthma and respiratory illness, drawing swift condemnation from business leaders and Republicans who warned of damage... More >> Updated: Monday, October 5 2015 6:12 AM EDT 2015-10-05 10:12:44 GMT America's health care debate has been called an unhealthy political obsession. But if the 2016 presidential hopefuls have any say, it's about to get bigger. More >> America's health care debate has been called an unhealthy political obsession. But if the 2016 presidential hopefuls have any say, it's about to get bigger. More >> Trial to begin for teen charged in teacher's rape, killing One day in the fall of 2013, Colleen Ritzer asked one of her 9th-grade algebra students to stay after school. Hours later, the body of the popular, 24-year-old teacher was found in nearby woods, partly covered by... More >> One day in the fall of 2013, Colleen Ritzer asked one of her 9th-grade algebra students to stay after school. Hours later, the body of the popular, 24-year-old teacher was found in nearby woods, partly covered by leaves.... More >> Pastor's sermon: 'Violence will not have the last word' People in this southern Oregon timber town sought solace in church services following last week's deadly shooting rampage - including one congregation where the pastor's daughter survived because the gunman... More >> People in this southern Oregon timber town sought solace in church services following last week's deadly shooting rampage - including one congregation where the pastor's daughter survived because the gunman... More >>", "external_links": [], "published": "2015-10-05T14:52:00.000+03:00", "crawled": "2015-10-05T15:10:18.328+03:00", "highlightTitle": ""}