{"organizations": [], "uuid": "218f1e57ffd8638016d935b84423564681889e32", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "http://www.bostonherald.com/sites/default/files/media/2015/10/01/100115bakerpw009.jpg", "site_section": "http://bostonherald.com/entertainment/books", "section_title": "Entertainment: Books | Boston Herald", "url": "http://bostonherald.com/news_opinion/us_politics/2015/10/governor_open_to_treatment_of_opiate_addiction_with_medical", "country": "US", "title": "Governor open to treatment of opiate addiction with medical marijuana", "performance_score": 0, "site": "bostonherald.com", "participants_count": 1, "title_full": "Governor open to treatment of opiate addiction with medical marijuana | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "218f1e57ffd8638016d935b84423564681889e32"}, "author": "Chris Villani", "url": "http://bostonherald.com/news_opinion/us_politics/2015/10/governor_open_to_treatment_of_opiate_addiction_with_medical", "ord_in_thread": 0, "title": "Governor open to treatment of opiate addiction with medical marijuana", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Gov. Charlie Baker said he is open to the idea of addicts using medicinal marijuana as a way to wean their way off harder drugs, amid a statewide opiate epidemic.\n“There is no question that, for certain people, whether you are talking about seizures or ulcers or pain, or cancer … medical marijuana has turned out to be a significantly improved solution for them compared to some of the more traditional solutions like opioids,” Baker said following a speech at the Career Collaborative Leadership Breakfast in Boston.\nSeveral Massachusetts doctors recently told the Herald they are treating hundreds of opioid addicts with medicinal cannabis. Baker stressed that the treatment option is a “doctor and patient call,” but was supportive of the idea.\n“If there are people out there who would prefer an alternative to an opioid, I think that’s something people should take pretty seriously,” he said.\nBaker said the Department of Public Health is trying to fix the botched medical marijuana system he took over from Gov. Deval Patrick’s administration.\n“We have been in the process of sort of redoing the bungled process we inherited,” he said. “My hope is we will be able to serve people on a medical marijuana basis statewide by the end of the year.”\nA call for comment to spokesman Scott Zoback of the Department of Public Health, which oversees the state’s medical marijuana program, was not immediately returned.\nThe governor also discussed one of his new opiate bill’s proposals: Under the new bill, drug-addicted women would sent to either Lemuel Shattuck Hospital in Jamaica Plain or Taunton State Hospital, rather than being sent to MCI-Framingham if they are involuntarily committed.\n“I have always been bothered by the fact that women who are addicted to drugs…they are basically sentenced to Framingham State Prison, which is not a treatment facility,” Baker said. “The legislation we are filing today would have women who are involuntarily committed (are) committed to a hospital.”\nBaker said his administration is working on “developing the capacity” to serve women at the two locations.\n“Our goal would be to, by this spring, be in a position where women who are addicted are committed to a treatment facility and not a jail,” he said.", "external_links": [], "published": "2015-10-15T03:00:00.000+03:00", "crawled": "2015-10-15T20:47:01.399+03:00", "highlightTitle": ""}