{"organizations": [], "uuid": "bce75c7b0e95fb83cb404e8eb957ea13249a3abf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://images.canberratimes.com.au/2015/10/14/6929874/REM_neighbours-20151014193254242531.jpg", "site_section": "http://feeds.canberratimes.com.au/rssheadlines/entertainment.xml", "section_title": "Canberra Times Entertainment Headlines", "url": "http://www.canberratimes.com.au/entertainment/tv-and-radio/monday-october-19-20151014-44imr.html", "country": "AU", "title": "Monday, October 19", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "Monday, October 19", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T01:22:00.000+03:00", "replies_count": 0, "uuid": "bce75c7b0e95fb83cb404e8eb957ea13249a3abf"}, "author": "canberratimes.com.au", "url": "http://www.canberratimes.com.au/entertainment/tv-and-radio/monday-october-19-20151014-44imr.html", "ord_in_thread": 0, "title": "Monday, October 19", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ryan Moloney in Neighbours . \nFREE TO AIR Neighbours, Eleven, 6.25pm \nYou can almost smell the trouble afoot in Neighbours tonight. The meddling mysterious redhead warns Toadie (Ryan Moloney) that Steph (Carla Bonner) is not ready to be back in Erinsborough, prompting him to discourage her from attending the school sleepover fundraiser. It’s a plot development that raises all sorts of questions around Steph, not to mention the redhead, but nothing could have prepared the Erinsborough community for what is about to unfold at their beloved school ... \nDogs: Their Secret Lives, SBS, 7.35pm \nAdvertisement News that will disturb dog owners around the country: most pooches really don’t like to be left at home alone. Separation anxiety is the focus of the pilot episode of this seven-part documentary, hosted by Mark Evans, former chief vet atthe RSPCA in England. Evans and his university researcher colleagues have undertaken unprecedented studies in the field, filming dozens of dogs in their homes. How they respond when their owners head out for the day is, at times, difficult to watch, particularly when the footage is replayed to their unknowing masters. Anxious pooches can betreated, with considerable effortfrom owner and dog, as we see tonight. In subsequent episodes, Evans will look at othercanine concerns, including obesity, aggression, and doggy depression. \nStorage Wars, 7Mate, 9pm \nWhatever will they think of next? Garage sale wars? Bake stall standoffs? Until then, we have Storage Wars, a reality show hinged on the strange world of storage unit auctions. It follows four \"professional buyers\" who have only five minutes to glimpse the contents of storage units before deciding how much to bid for them (after the original owners have not paid rent on the units for three months, they’re considered fair game in California). In every episode there are winners and losers, but Brandi and Jarrod, who desperately need to stock  their new thrift store, are probably the worst off tonight (and it doesn’t help that Jarrod seems unable  to stick to a budget). There’s a lot of junk to be found in these \"treasure troves\", but the odd diamond is what drives these hustlers.\nAnnabel Ross", "external_links": [], "published": "2015-10-19T01:22:00.000+03:00", "crawled": "2015-10-19T05:22:06.897+03:00", "highlightTitle": ""}