{"organizations": [], "uuid": "64690404c33d9b8b6476ab6024379003a237bf97", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbsnews.com", "main_image": "http://cbsnews1.cbsistatic.com/hub/i/r/2015/10/02/6b7741e2-3d01-47b2-987f-669c2d2f70d5/thumbnail/620x350/55824904c8d62fd13a83956065428e2c/ctm1002chickfila04450835640x360.jpg", "site_section": "http://www.cbsnews.com/", "section_title": "CBS News - Breaking News, U.S., World, Business, Entertainment &amp; Video ", "url": "http://www.cbsnews.com/news/southern-franchise-chick-fil-a-opens-largest-restaurant-in-new-york-city/", "country": "US", "title": "Southern franchise Chick-fil-A opening its largest restaurant in New York City", "performance_score": 0, "site": "cbsnews.com", "participants_count": 4, "title_full": "Southern franchise Chick-fil-A opening its largest restaurant in New York City - CBS News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T18:29:00.000+03:00", "replies_count": 3, "uuid": "00916284c70030943d51e9a78b00d05c2606e505"}, "author": "CBS News", "url": "http://www.cbsnews.com/news/southern-franchise-chick-fil-a-opens-largest-restaurant-in-new-york-city/#post-0", "ord_in_thread": 0, "title": "Southern franchise Chick-fil-A opening its largest restaurant in New York City", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Chick-fil-A, which has more than 1,900 stores nationwide, is opening its first freestanding franchise in New York City, joining more than 7,000 other fast food eateries. Standing three stories tall, the 5,000-square foot restaurant will open its eight registers Saturday, reports Vladimir Duthiers of CBS News' digital network, CBSN.\nInvented over 50 years ago, Chick-fil-A's trademark sandwich -- breaded fried chicken breast served on a buttered bun with two pickles -- has a recipe so simple but one that has built Chick-fil-A into a Southern institution.\n\"They can try, but I don't think they can duplicate what we do right here,\" said Oscar Fittipaldi, a former ship captain who is now in command of Chick-fil-A's grand store in Manhattan, the company's largest operation yet.\nBut more than the food, Fittipaldi attributes Chick-fil-A's success to its culture.\n\"The food is just the vehicle that we use, but the service, through service we create memories worth repeating,\" he said.\nThat service started in 1967, when S. Truett Cathy opened the first Chick-fil-A in Atlanta, Georgia.\nCathy died last year, but the company remained family-owned and has maintained his Christian values.\n\"Truett used to say he thinks of Chick-fil-A as a business that is consistent with biblical values, and he would say those biblical values are good business values too,\" said David Farmer, Chick-fil-A's vice president of product strategy.\nWhile Chick-fil-A has just a fraction of the number of restaurants McDonald's does, they make half a million dollars more on average per store, and they sell more chicken than Kentucky Fried Chicken.\n\"We have to work really, really hard. We can never rest on the success that we've had in the past. Millions of transactions every day, we've got to get out there and earn it all over again,\" Farmer said.\nWhich they had to do in 2012, when those values ran afoul of public sentiment. In several interviews, CEO Dan Cathy affirmed his support for traditional marriage.\n14 Photos \"Kiss-in\" protests at Chick-Fil-A Gay rights activists and supporters demonstrate at Chick-fil-A stores in opposition to fast food chain owner's donations to anti-gay marriage gro...\n\"I pray God's mercy on our generation that has such a prideful, arrogant attitude to think that we have the audacity to redefine what marriage is all about,\" Cathy said on \"The Ken Coleman Show,\" a conservative radio show.\nHuckabee backs Chick-fil-A in same-sex marriage controversy The comment sparked protests and boycotts by marriage-equality supporters. In response, the company stopped donating to several conservative groups.\n\"We're really just trying to back away from politics and saying there are people in a better position to do that. We'll stick to what we know, and that's what we're trying to practice now,\" said Fittipaldi.\nFittipaldi said that means someone of a different religion could become an operator of a Chick-fil-A franchise.\n\"What we want to know is: Do you love serving people? Are you excited about getting out there and building a business? That's what we're interested in,\" said Fittipaldi.\nBut even in New York City, the city that never sleeps, Chick-fil-A will adhere to its core \"Cathy Christian values\" by closing every Sunday, like all of their other locations across the nation.", "external_links": ["http://cbsnews2.cbsistatic.com/hub/i/r/2012/08/04/ce3e80f0-a644-11e2-a3f0-029118418759/thumbnail/220x140/5f688828dcaf07da02dd411ee24d3a42/Kissin_AP57281047704.jpg"], "published": "2015-10-02T18:29:00.000+03:00", "crawled": "2015-10-02T20:31:49.594+03:00", "highlightTitle": ""}