{"organizations": ["NBA", "North Idaho News & Weather", "Los Angeles Clippers", "Sunrise Hospital and Medical Center", "AP", "Golden State Warriors"], "uuid": "4b271ee9aa3ba884786e67486c94597ce1232fdc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.khq.com", "main_image": "http://images.worldnow.com/AP/images/9013833_G.jpg", "site_section": "http://www.khq.com/category/171888/entertainment-news?clienttype=rss", "section_title": "KHQ Right Now - Entertainment - Headline", "url": "http://www.khq.com/story/30258848/the-latest-lamar-odom-hospitalized-with-ex-by-his-side", "country": "US", "title": "The Latest: Lamar Odom hospitalized with ex by his side", "performance_score": 0, "site": "khq.com", "participants_count": 0, "title_full": "The Latest: Lamar Odom hospitalized with ex by his side", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T19:32:00.000+03:00", "replies_count": 0, "uuid": "4b271ee9aa3ba884786e67486c94597ce1232fdc"}, "author": "", "url": "http://www.khq.com/story/30258848/the-latest-lamar-odom-hospitalized-with-ex-by-his-side", "ord_in_thread": 0, "title": "The Latest: Lamar Odom hospitalized with ex by his side", "locations": ["Las Vegas", "Oakland", "Calif", "Spokane"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jose Sanchez", "Odom", "Becker", "Lamar Odom"], "text": "The Latest: Lamar Odom hospitalized with ex by his side - Spokane, North Idaho News & Weather KHQ.com Member Center: Press Releases The Latest: Lamar Odom hospitalized with ex by his side (AP Photo/David Becker). A driver displays a basketball jersey with Lamar Odom's name as the driver exits Sunrise Hospital and Medical Center on Tuesday, Oct. 13, 2015, in Las Vegas. The former NBA basketball player was hospitalized after he was found ... (AP Photo/David Becker). Members of the media stand outside Sunrise Hospital and Medical Center while waiting for word about Lamar Odom on Tuesday, Oct. 13, 2015, in Las Vegas. Odom, a former NBA basketball player, was hospitalized after he was found u... (AP Photo/Marcio Jose Sanchez, File). FILE - This Jan. 2, 2013 file photo shows Los Angeles Clippers' Lamar Odom (7) in action against the Golden State Warriors during an NBA basketball game in Oakland, Calif. Authorities say former NBA and reality TV ... \nLAS VEGAS (AP) - The latest on the hospitalization of Lamar Odom, who was found unconscious in a Nevada brothel (all times local): \n7 a.m. \nReality TV personality Khloe Kardashian has been by Lamar Odom's side at a Las Vegas hospital since Tuesday evening. \nThat's according to a person close to the Kardashians who spoke anonymously because she wasn't authorized to speak to the press. Kardashian and Odom were married in 2009, but Kardashian filed for divorce in 2013, citing irreconcilable differences. \nOdom was found unconscious Tuesday afternoon at the Love Ranch brothel in Crystal, Nevada, about 70 miles outside of Las Vegas. \nAuthorities said the 35-year-old was stabilized at the scene before being taken to a hospital. He was then transferred to Sunrise Hospital and Medical Center in Las Vegas. \nOwner Dennis Hof said Odom had been at his brothel since Saturday. \n___ \nBy Associated Press writer Sally Ho. Copyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. News Community Interact", "external_links": [], "published": "2015-10-14T19:32:00.000+03:00", "crawled": "2015-10-14T19:44:54.108+03:00", "highlightTitle": ""}