{"organizations": [], "uuid": "419abe16159ec163e430d389040e18843ffe046c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.india.com", "main_image": "http://s3.india.com/wp-content/uploads/2015/10/punjab-police.jpg", "site_section": "http://www.india.com/feed/", "section_title": "India | Latest India News | Get Free India.com Email | Live Cricket and Entertainment News at India.Com", "url": "http://www.india.com/news/india/punjab-4-killed-4-injured-as-army-officer-fires-openly-in-sangrur-646329/", "country": "US", "title": "Punjab: 4 killed, 4 injured as Army officer fires openly in Sangrur", "performance_score": 0, "site": "india.com", "participants_count": 1, "title_full": "Punjab: 4 killed, 4 injured as Army officer fires openly in Sangrur", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T13:46:00.000+03:00", "replies_count": 0, "uuid": "419abe16159ec163e430d389040e18843ffe046c"}, "author": "Mohammed Uzair Shaikh", "url": "http://www.india.com/news/india/punjab-4-killed-4-injured-as-army-officer-fires-openly-in-sangrur-646329/", "ord_in_thread": 0, "title": "Punjab: 4 killed, 4 injured as Army officer fires openly in Sangrur", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Punjab: 4 killed, 4 injured as Army officer fires openly in Sangrur By Mohammed Uzair Shaikh on October 20, 2015 at 4:16 PM Comments \nChandigarh, Oct 20: Further escalating the tense situation in Punjab, a report has surfaced from the town of Sangrur where four individuals were allegedly shot to death by an army officer. The security personnel, identified as Jagdeep fired indiscriminate rounds of bullet in a blind manner leaving four dead, and an equal number of people critically injured. \nAccording to local reports, the accused officer fired from an apartment which has been cordoned off by the Punjab police. An operation has been initiated by the police team to apprehend the army personnel. (ALSO READ: Sikh holy book desecration: 3 accused arrested; Punjab chief minister Parkash Singh Badal calls emergency meet) \nSangrur SSP Preetpal Singh Thind appealed the people to maintain peace in the region. “4 people have been killed. 4 have been injured. The reason behind the attack is not yet revealed,” he said while speaking to news agency ANI. \nThe situation would further vitiate the atmosphere in Punjab which is already tense after desecration of holy book Guru Granth Sahib outside the gurudwaras in the six villages of Punjab – Kotkapura near Faridkot, Baath near Taran, Mishriwala near Ferozepur, Kohrian near Sangrur and Ghawaddi near Ludhiana. \nSeveral Sikh bodies in the state have unitedly launched an agitation against the state government led by Shiromani Akali Dal and BJP. The agitators have accused the NDA partners of shielding the saffron extremists allegedly behind the attack. \nFive troops of paramilitary forces have been deployed in the region to prevent the law and order situation to further deteriorate. Chief Minister Parkash Singh Badal had called for an emergency meeting between senior bureaucrats and cabinet ministers to normalize the situation in the state. \n  4:25 PM Topics:", "external_links": [], "published": "2015-10-20T13:46:00.000+03:00", "crawled": "2015-10-20T14:08:43.482+03:00", "highlightTitle": ""}