{"organizations": [], "uuid": "53d938c836ddccf005b1b91fd72d6fe8d2b14ba8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theepochtimes.com", "main_image": "http://www.theepochtimes.com/n3/eet-content/uploads/2015/10/14/Film-Crimson-Peak_Druk-674x448.jpg", "site_section": "http://www.theepochtimes.com/n3/c/entertainment/feed/#", "section_title": "The Epoch Times » Entertainment", "url": "http://www.theepochtimes.com/n3/1878120-inside-the-lavish-visual-feast-of-crimson-peak/", "country": "US", "title": "Inside the Lavish Visual Feast of ‘Crimson Peak’", "performance_score": 0, "site": "theepochtimes.com", "participants_count": 1, "title_full": "Inside the Lavish Visual Feast of ‘Crimson Peak’", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T23:40:00.000+03:00", "replies_count": 0, "uuid": "53d938c836ddccf005b1b91fd72d6fe8d2b14ba8"}, "author": "Associated Press", "url": "http://www.theepochtimes.com/n3/1878120-inside-the-lavish-visual-feast-of-crimson-peak/", "ord_in_thread": 0, "title": "Inside the Lavish Visual Feast of ‘Crimson Peak’", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Associated Press | October 14, 2015 Last Updated: October 14, 2015 4:40 pm < > \nIn this image released by Legendary Pictures and Universal Pictures, Mia Wasikowska listens to director Guillermo del Toro on the set of \"Crimson Peak.\" Del Toro, who has created fantastically dark worlds in films like Pans Labyrinth, wanted Crimson Peak, to feel as grand as an old Hollywood production. (Kerry Hayes/Legendary Pictures and Universal Pictures via AP) \nLOS ANGELES — Fear is written in the walls of “Crimson Peak’s” crumbling haunted mansion. Literally. \nDirector Guillermo del Toro had his production and design teams fashion the word into the cracks and crevasses of the woodwork and furniture throughout the massive, three-story manor, which they built from the ground up specifically for the gothic thriller. \nIt’s not that del Toro thinks that spelling out the word fear will make the experience of watching the film any scarier. In fact he doesn’t even believe in subliminal messages at all. (Ghosts, mind you, are another story.) \nBut it is one among dozens of hidden in plain sight treats and thematically relevant motifs woven into the visuals of the painstakingly designed film about a young American novelist, Edith (Mia Wasikowska) who comes to live in the eerie estate of her new husband, Thomas (Tom Hiddleston) and his sister, Lucille (Jessica Chastain), in 1901. \nThe director, who has created fantastically dark worlds in films like “Pan’s Labyrinth,” wanted “Crimson Peak,” out Friday, to feel as grand as an old Hollywood production. Building a three-story house with a functioning elevator, running water, and working fireplaces isn’t a bad place to start, but beauty alone is trite. Everything needed to serve the story — even details that might not be obvious to the casual viewer. \nTo ensure everyone was on the same page, Del Toro asked his wardrobe and production design teams to read and study the character biographies he’d crafted for his three leads. \n“The second mandate was that everything in the movie, no matter how whimsical, needed to be rooted in reality,” said del Toro in a recent interview. “I asked them to always have a photograph or a reference of the period to back up any choice.” \nWhile there are other locations, Allerdale Hall is the wheezing, bleeding centerpiece of “Crimson Peak,” where the untold horrors of the past converge in all their decadent glory. Truly, the walls ooze red clay and the house creaks and moans and breathes, thanks to a gaping hole in the foyer ceiling. \n“I wanted to make it feel like a character. I wanted to create it from scratch. That’s why the movie took eight years to make. Everybody wanted it to be smaller or PG-13 and I didn’t agree on either of those,” said del Toro. (The bloody film ended up securing an R-rating). \nMembers of the key artistic team, including production designer Tom Sanders, costume designer Kate Hawley, and supervising art director Brandt Gordon, were given an almost luxurious amount of time to prep before pre-production began. \n“In contemporary cinema, there is often a mandate to try to keep things as economical as possible and to try to keep prep as short as possible. This was totally different,” said Gordon. He calls the four months in Toronto their “pre-conceptual production phase.” \nIt was all about ideas, and Del Toro was there daily to discuss everything while Sanders built models. \nOnce pre-production was underway, they spent about 14 weeks building the house before their February shoot date. For the crew, that meant having 10 completely distinct sets ready to go at the same time, which proved to be quite a challenge. \n“All of the architectural elements were handmade — all of the moldings, all of the sculpted details and bannisters and fireplaces,” said Gordon. \nThe ornate, billowy Victorian costumes were also all completely handmade. Hawley sourced fabrics and manipulated them, with over-dying and pleating. \n“We chose our decorative details very carefully. We developed them ourselves. We didn’t just go in and put Victorian lace on everything,” she said. MORE: Film Review: ‘Bridge of Spies’ \nThe costumes even have their own little warning signs. Lucille’s wardrobe in particular is meant to almost camouflage her in Allerdale Hall. The heaviness of her frocks and wig also helped the delicate Chastain sink further into a character who is deeply tied to her home. \n“Edith wears a belt with a hand clasp. That’s taken from the idea of a Victorian mourning jewelry,” said Hawley. \nIt won’t take a dozen viewings to notice that Lucille and Thomas’s wardrobe has the same color palette as the house, but look a little closer and you might spot some of the same patterns on Lucille’s dress used in trimmings. In the woodwork, you may see human shapes. And the windows? Yes, they’re meant to look like eyes. \nAt one point, Lucille tells Edith she’s like a fragile butterfly. Del Toro laughed that someone could play a pretty good drinking game trying to spot all the butterflies in the wallpaper alone. \nSo where is the intricately designed haunted mansion now? \n“Sadly they destroyed it shortly thereafter,” said del Toro.", "external_links": [], "published": "2015-10-14T23:40:00.000+03:00", "crawled": "2015-10-15T00:04:14.663+03:00", "highlightTitle": ""}