{"organizations": [], "uuid": "35ee68396c44e4edd01b856587798e25d2bc642c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nydailynews.com", "main_image": "http://assets.nydailynews.com/polopoly_fs/1.2406307!/img/httpImage/image.jpg_gen/derivatives/landscape_1200/rose22f-1-web.jpg", "site_section": "http://www.nydailynews.com/entertainment/index.html", "section_title": "Entertainment News &amp; Reviews - NY Daily News", "url": "http://www.nydailynews.com/entertainment/gossip/amber-rose-slams-gq-labeling-poses-naked-article-1.2406308", "country": "US", "title": "Amber Rose slams GQ for labeling her after she poses naked", "performance_score": 0, "site": "nydailynews.com", "participants_count": 1, "title_full": "Amber Rose slams GQ for labeling her after she poses naked - NY Daily News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "35ee68396c44e4edd01b856587798e25d2bc642c"}, "author": "NEW YORK DAILY NEWS", "url": "http://www.nydailynews.com/entertainment/gossip/amber-rose-slams-gq-labeling-poses-naked-article-1.2406308", "ord_in_thread": 0, "title": "Amber Rose slams GQ for labeling her after she poses naked", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Robert Maxwell for GQ Magazine Amber Rose slammed GQ for the way she was portrayed in a story, soon after she posed naked for the magazine. Amber Rose is a stripper-turned-model, a feminism activist and the author of a soon-to-be-released how-to book — but don't cheapen her as \"Kanye's infamous ex\" or Wiz Khalifa's baby mama.\"\nThe outspoken stunner slammed GQ magazine for using those labels to tout an upcoming feature — though she apparently had no problem posing completely nude to properly illustrate the eye-popping story.\n\"Really @gq???\" she angrily wrote on Instagram under a photo of GQ's article. \"I'm so much more then Kanye's Ex or Wiz's baby's mama.\"\nTo be fair, GQ’s story also referred to her as \"America's toughest bald babe since Sigourney Weaver in 'Alien 3'” and also touted her new book, \"How to Be a Bad Bitch\" — but Rose only wanted to call out the lad mag for its references to her past as a shower-requiring bedmate to Kanye West and as Wiz Khalifa's former wife.\n\"Damn, why the f--- did u guys reach out to me for this article and photoshoot?\" she asked. \"To dumb me down?\"\nThe magazine teased its interview with Rose as a look into her \"beautiful dark twisted journey to the top,\" which possibly angered Rose further, given that it’s a reference to West's fifth studio album, \"My Beautiful Dark Twisted Fantasy.\"\n“Oh ‘Her beautiful dark twisted journey to the top?’” Rose concluded her vicious Instagram post. \"Nice pun. Negative af. Thx for nothing.\"\nBauer-Griffin/GC Images Rose dressed in black lingerie as she led a Slut Walk in Los Angeles last month. Enlarge GQ's story can be seen in GQ's November issue. Enlarge The story about Amber Rose, who led a Slut Walk in Los Angeles last month (left), appears in the November issue of GQ.\nRose probably doesn't want to be associated with West or Khalifa after being dissed by each in the past few months.\nIn February, West said it was hard for a woman to be interested in a man who had been with Rose, saying he \"had to take 30 showers\" before getting with his now-wife Kim Kardashian.\nMeanwhile, Khalifa, who married Rose in 2013 and had a son with her before divorcing in 2014, referred to his wife only as a \"stripper\" in his song with Juicy J \"For Everybody\" in March.\nRose has become a leading voice against slut-shaming women, and she led a Slut Walk event in Los Angeles last month in which many participants strolled the streets in lingerie.\nThe model, wearing a black lace dress, addressed the crowd at the event, where she forgave West and Khalifa for their harsh words about her.\nRose also made headlines in August, when she and fellow model Blac Chyna went to the MTV Video Music Awards wearing body suits emblazoned with derogatory terms such as \"slut,\" \"whore\" and \"bitch.\"\nRelated Stories Amber Rose leads hundreds of supporters at ‘SlutWalk’ Amber Rose, Blac Chyna shock on VMA red carpet", "external_links": ["https://instagram.com/p/9E00B-EqzS/?taken-by=amberrose"], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-22T03:39:54.363+03:00", "highlightTitle": ""}