{"organizations": [], "uuid": "f15c3469028b549dea347efb9095d652a0aee112", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pr.com", "main_image": "", "site_section": "http://www.pr.com/news-by-category/14", "section_title": "Arts &amp; Entertainment: Web Sites &amp; Internet Press Releases and News - PR.com", "url": "http://www.pr.com/press-release/641842", "country": "US", "title": "\"In Limine,\" the Second Album of the Female Italian Singer Silvia Tancredi. New Gigs Announced in the US in the Spring.", "performance_score": 0, "site": "pr.com", "participants_count": 1, "title_full": "\"In Limine,\" the Second Album of the Female Italian Singer Silvia Tancredi. New Gigs Announced in the US in the Spring. - PR.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "f15c3469028b549dea347efb9095d652a0aee112"}, "author": "PR.com", "url": "http://www.pr.com/press-release/641842", "ord_in_thread": 0, "title": "\"In Limine,\" the Second Album of the Female Italian Singer Silvia Tancredi. New Gigs Announced in the US in the Spring.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "\"In Limine,\" the Second Album of the Female Italian Singer Silvia Tancredi. New Gigs Announced in the US in the Spring.\nNew York, NY, October 15, 2015 --( PR.com )-- After the release of the new radio single “I do it for you,” comes out in an all digital platform “In Limine” (Imagina Production/Edel), the new album of the Italian singer Silvia Tancredi. The LP consists of 11 tracks, including a cover “True Colors” by Cindy Lauper, and “The Cage,” song chosen for the soundtrack “Cam Girl,” the movie directed by Mirca Viola, also available Remix by Jeffrey Jey (Eiffel 65). The album also includes a duet with male singer Anthony Morgan, and an important collaboration of great vocalist of the Gospel scene of New York City.\nThe LP, with the artistic production by Gigi Rivetti, and the executive production by Imagina Prod., is mastered at Sterling Sound in NYC by Tom Coyne and by Antonio Baglio (Nautilus, Milan).\nThe authors are Silvia Tancredi, along with Gigi Rivetti, Fabrizio Consoli, Gianmarco Borello, Enrico De Lotto and Luisa Parrelli.\nThis is the tracklist of “In limine”: “I do it for you,” “Ora Voglio,” “In limine,” “The Cage,” “Negli occhi,” “I think about you,” “True Colors,” “Never walk away” feat. Anthony Morgan, “The Sense,” “Back Home,” “Sarà vero e di più (il bene che mi vuoi).”\nSilvia says: “Sometimes we walk on the border line, we hold our breath, we concentrate all our strength and we decide to jump: only in this way you will win your limits.”\nSilvia Tancredi is back from few gigs in some of the must important clubs of New York, confirming as a main player in the gospel music scene of the City.\nSilvia Tancredi is wearing fashionable creations by Maddalena Triggiani ™, jewel by Simona Elia, and shoes by Pamela Quinzi.\nPress Contact - All Countries: Luca Re +393939035925 press[at]silviatancredi.it\nManagement & booking live USA: Nate Blackmon +17326194521 theN8voice[at]live.com", "external_links": [], "published": "2015-10-15T03:00:00.000+03:00", "crawled": "2015-10-22T20:08:27.608+03:00", "highlightTitle": ""}