{"organizations": [], "uuid": "7056e02248a41d92faafeda9c066ee784da1dfba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailyherald.com", "main_image": "http://www.dailyherald.com/storyimage/DA/20151019/entlife/151019722/AR/0/AR-151019722.jpg&amp;updated=201510161542&amp;imageversion=Facebook&amp;exactH=630&amp;exactW=1200&amp;exactfit=crop&amp;noborder", "site_section": "http://www.dailyherald.com/rss/feed/?feed=entlife", "section_title": "DailyHerald.com &gt; Life &amp; Entertainment", "url": "http://www.dailyherald.com/article/20151019/entlife/151019722/", "country": "US", "title": "Caitlin Brodnick turned breast cancer scare into stand-up fodder", "performance_score": 0, "site": "dailyherald.com", "participants_count": 1, "title_full": "Caitlin Brodnick turned breast cancer scare into stand-up fodder", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T13:45:00.000+03:00", "replies_count": 0, "uuid": "7056e02248a41d92faafeda9c066ee784da1dfba"}, "author": "Debra Bruno Special To The Washington Post", "url": "http://www.dailyherald.com/article/20151019/entlife/151019722/", "ord_in_thread": 0, "title": "Caitlin Brodnick turned breast cancer scare into stand-up fodder", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "It's a rollicking Saturday night in the cozy basement comedy club at Stairs, a gay bar in New York's East Village. A series of young comedians are doing their 10-minute bits before an audience of about two dozen millennials.\nThe topics are edgy and funny: race, sex, gluten, kale. Next up is Caitlin Brodnick, a fresh-faced blonde in heels and a bright red dress. She announces that she's wearing Spanx. The crowd chuckles.\nThen she launches into her real topic.\n\"I'm excited today, guys,\" she says, \"because I don't know if anybody else out there is afraid of dying of cancer.\"\nYes, she's going there.\nHave you heard the joke about cutting off your boobs to prevent breast cancer?\nThe room is not warming to her shtick.\nShe continues: \"I had the Angelina Jolie surgery, you guys, where they removed my breasts because I'm BRCA-positive, so I have a huge chance of getting breast cancer.\"\nDead silence.\n\"I know -- it's so intense,\" she says. She soldiers on: \"I'm just like Angelina Jolie -- we're like twins. I love her. Except she has Brad Pitt, and I have credit card debt.\"\nAt that, the audience erupts in laughter, and she has the crowd back.\nBrodnick can do that. The 30-year-old native of Kensington, Maryland, has made a name for herself in the past couple of years with her very public, poignant and funny openness about finding out that she is BRCA1-positive and then taking the radical step of undergoing a preventive double mastectomy.\nAt first glance, not so funny, right?\nIncreasingly, women who learn that they have the BRCA1 and 2 genetic mutations that exponentially increase their risk of developing breast or ovarian cancer have been having preventive mastectomies to lessen their chances of getting the disease.\nThey call themselves \"previvors.\"\nThey've formed communities and sisterhoods and identify with actress and director Jolie, who has the gene and had the surgery, as well as actress Christina Applegate, who has the gene, developed breast cancer and had the surgery.\nWriter Rachel Joy Horn wrote the blog \"Ticking Time Bombs\" about getting the preventive surgery because she has the BRCA gene.\nBut joking about it?\nWhen Brodnick found out, at 26, that she has the gene and started doing research, she mainly found fear and sadness.\n\"I looked at YouTube, and all the women had had breast cancer or terrible experiences,\" she says. \"Nobody was casually talking about it in a hopeful, positive way.\"\nAnd nobody was seeing the subject matter as comic fodder. That's where she comes in.\n\"I have these amazing fake (breasts),\" she tells the audience. \"They are high -- and they just won't quit!\" When she's old, she's going to walk around topless in the nursing home, she says.\nBrodnick is not the only comic who has tapped into the mastectomy humor vein. Tig Notaro, the subject of HBO's \"Boyish Girl Interrupted,\" developed breast cancer before she decided to have her breasts removed.\nAlso, before her surgery, Notaro's chest was so flat that she joked about it to the extent that, as she recounts in her stand-up routine, her breasts said, \"You know what? We're sick of this. Let's kill her.\"\nNotaro is now completely flat-chested and nipple-free, which she reveals when she removes her shirt for the last 20 minutes of her HBO special. She makes no further reference to breasts or cancer, though.\nBrodnick, on the other hand, has never had cancer. And she delights in her new size 34C breasts. She says the former ones were too large -- 32G on a 5-foot-1 frame -- and she can't seem to stop talking about her freedom to downsize and create what she calls \"DIY boobs.\"\nShe also decided that the best way to go through the experience was to document it, which led to a groundbreaking video series posted on the Glamour magazine website. \"Screw You Cancer\" takes the public through every stage of Brodnick's journey.\nAs a habitual over-sharer and a storyteller who has won the Moth's open mic StorySLAM contest, she knew that \"I'm probably going to talk about it anyway.\" So why not be that open book?\nBrodnick has spent her life in the shadow of cancer. Her father's sister died of breast cancer at 32.\n\"It really rocked everyone to their core,\" she says.\nBorn nine months later, Caitlin was the \"miracle child\" who gave her grandmother a reason to live. Then other family members started dying: her grandmother, another aunt.\n\"I just remember being -- it's always about the cancer,\" Brodnick says.\nWhen her test proved positive, \"it felt like I had cancer. It felt like my family's fears were coming true, that I was going to be the next one.\"\nFor three years, her reaction was depression and not taking care of herself. Then Jolie announced her decision to undergo a preventive mastectomy. For Brodnick, it was a major tipping point.\nAs she recalls in the Glamour series, she called her mother and left a voice mail telling her that she was going for the surgery.\n\"I think I just wanted to make it sound like I was getting my tonsils out,\" she says.\nHer mother's initial reaction was shock. \"I said, 'Wait, you're not sick yet. Do the normal stuff first,'\" Maggie Brodnick recalls.\nCaitlin's father, Al, was more immediately behind the decision. \"I was like, 'Yay, good for you. Thank God you're going to be alive,'\" he recounts.\nAllen Arthur, Caitlin's husband, also was supportive from the start. In a touching moment in the \"Screw You Cancer\" series, he's shown as Brodnick, her back to the camera, reveals her reconstructed breasts. \"Yowza! Boobs!\" he says. The video series served an important purpose, he says: \"It helped distract us both from how big it was and how intense a decision it was.\"\nSandy Cohen, coordinator of volunteers for Facing Our Risk of Cancer Empowered, a national nonprofit organization that supports and advocates on behalf of those with hereditary breast and ovarian cancer, heard about the Glamour series and invited Brodnick to speak at this year's annual conference, held in Philadelphia in June.\nBrodnick did about 20 minutes of her comedy routine for about 80 attendees. \"She was very frank,\" Cohen says. \"It was like a breath of fresh air that they needed\" after talking about cancer and prevention all day.\nWhat Brodnick has done for many women is demystify the reconstruction process and help remove the fear, says Andrea Pusic, the plastic surgeon at Memorial Sloan Kettering Cancer Center who performed Brodnick's reconstructive surgery.\n\"It's a difficult process, and she's done a nice job of giving women a glimpse of what that's about,\" Pusic says.\nToday, Brodnick is part advocate, part comedian and part the girl you want to sit next to on the airplane.\nShe performs a regular gig at New York's Upright Citizens Brigade comedy shows as well as at other venues, and is launching a new tour called BRCA Power Prevention International to connect with other BRCA-positive women.\nThanks to her comedy and her video series, she says, she is starting to be recognized. People will ask her, \"Are you the one who went under the knife and then showed everyone your (breasts)?\"\n\"Yeees!\" she says. \"I m! This is all I have to offer! I'm a feminist, but this is all I have to offer!\"\nHer mom says that the entire process has given a girl who was once self-conscious about her breasts and dressed modestly a completely new mindset.\n\"If you had told me before her surgery that someday we would watch her and laugh, I probably couldn't have imagined it,\" Maggie Brodnick says. But now it seems totally natural. \"There was a grander purpose for it all -- and she found it.\"\n Life & Entertainment Health & Fitness Washington Post", "external_links": ["https://twitter.com/share"], "published": "2015-10-19T13:45:00.000+03:00", "crawled": "2015-10-19T16:23:25.932+03:00", "highlightTitle": ""}