{"organizations": [], "uuid": "18d25fd499b0479ed3ee22b0bf30c9f2dcf3b467", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/49183824.cms", "site_section": "http://timesofindia.indiatimes.com/entertainment/articlelistls/1081479906.cms", "section_title": "Entertainment News, Latest Entertainment News, Hollywood Bollywood News | Entertainment - Times of India", "url": "http://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/Diamond-set-choreographed-sangeet-chauka-chadhna-rasam-at-Harbhajan-Singh-Geeta-Basra-wedding/articleshow/49183647.cms", "country": "IL", "title": "Diamond set, choreographed sangeet, chauka chadhna rasam at Harbhajan Singh-Geeta Basra wedding", "performance_score": 0, "site": "indiatimes.com", "participants_count": 6, "title_full": "Diamond set, choreographed sangeet, chauka chadhna rasam at Harbhajan Singh-Geeta Basra wedding - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T08:00:00.000+03:00", "replies_count": 5, "uuid": "178014b720d8de46a2dacd4ff2dc41bc357f0dfa"}, "author": "Vinita Chaturvedi", "url": "http://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/Diamond-set-choreographed-sangeet-chauka-chadhna-rasam-at-Harbhajan-Singh-Geeta-Basra-wedding/articleshow/49183647.cms#post-0", "ord_in_thread": 0, "title": "Diamond set, choreographed sangeet, chauka chadhna rasam at Harbhajan Singh-Geeta Basra wedding", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Indian cricket team's Turbanator Harbhajan Singh is finally set to tie the knot this month with longstanding girlfriend and Bollywood actress, Geeta Basra.\nRE AD: Harbhajan Singh - Geeta Basra's grand wedding invite\nListen to songs of The Train on Gaana.com\nKnown to be a fiercely private person, Bhajji is tight-lipped when it comes to speaking about his ladylove or his impending marriage on October 29. But, reliable sources tell us that the wedding preparations are in full swing at their respective homes .\nGhaghras for bride, sherwani for groom\n\"Being a stickler for tradition, Harbhajan will wear an elegant sherwani designed by couturier Raghavendra Rathore,\" informs our source, adding, \"Geeta has opted for ghaghras for all the important occasions, including the sangeet (October 27), mehendi (October 28), wedding (October 29) and reception (November 1). Her ceremonial dresses have been designed by Archana Kochhar and Babita Malkani while her wedding dress will be a stunning heavy ghaghra in red and gold.\"\nDance moves at sangeet\nAccording to our source, the sangeet ceremony will be organised at Harbhajan's home in Jalandhar, for which only very close friends are being invited to join the family. Reveals our informer, \" Mehendi will be organised at Geeta's maternal aunt's home, which is also in Jalandhar while the wedding will be solemnised at an elite wedding hall in the Punjab city. The reception will take place in Delhi. A choreographer has been hired to teach some filmi dance moves to key members of both the families. Bhajji, who has previously participated in the dance reality show Ek Khiladi Ek Haseena, is also expected to show some Bollywood moves at the sangeet .\"\nRituals planned\nReportedly, Geeta has already made a place in her in-laws' hearts because of her friendly and warm nature. \"The family has bought a beautiful diamond set, along with other things, for their bahu -to-be. After the wedding, there is a ritual called chauka chadhna (entering the kitchen) wherein Geeta is expected to make halwa or any other sweet and serve it to her extended family,\" says our source.\nLast-minute honeymoon plans\nApparently, the couple's honeymoon plans will be finalised last-minute because Bhajji is currently in the Indian squad for the T20 series against South Africa. And if he is also selected for the India-South Africa bilateral Test series, which begins on November 5, then the honeymoon will be postponed for a while. \"Although the destination has not been finalised yet, the choice seems to be between New Zealand and Maldives,\" sums up our informer.\nFor latest Bollywood updates follow us on Twitter >>> @TOIEntertain\nFor the latest in Bollywood news, like us on Facebook >>> TOIEntertain\nFor more interesting Bollywood news and pictures follow us on Pinterest>>> timesofindia\nFor latest Bollywood updates follow us on G+ >>> The Times of India Entertainment\nWATCH: Harbhajan Geeta Basra to get married in October - TOI\nThe Train Amazon.in : Buy now ", "external_links": ["https://www.youtube.com/embed/HcL4egNC8_o", "https://www.facebook.com/TOIEntertain", "https://play.google.com/store/apps/details?id=com.toi.reader.activities", "http://www.amazon.in/The-Train-Emraan-Hashmi/dp/B0092LFMLU%3FSubscriptionId%3DAKIAJP4GPDYQHXPFUOWQ%26tag%3Dtimofind-21%26linkCode%3Dxm2%26camp%3D2025%26creative%3D165953%26creativeASIN%3DB0092LFMLU", "https://www.pinterest.com/timesofindia/", "https://plus.google.com/u/0/b/107628521107103264647/+TOIEntertainment/posts", "https://twitter.com/TOIEntertain", "http://ecx.images-amazon.com/images/I/51lhYzRNRLL._SL160_.jpg", "http://gaana.com/album/the-train-some-lines-should-never-be-crossed"], "published": "2015-10-02T08:00:00.000+03:00", "crawled": "2015-10-02T05:22:29.236+03:00", "highlightTitle": ""}