{"organizations": [], "uuid": "b92f1c87c49bad31e1da87ef758fbd42350bbc35", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailyjournal.net", "main_image": "http://d1bdhkmqqz901h.cloudfront.net/1200x630/smart/s3.amazonaws.com/hne-smedia/9/9/99ba2ebc29334fb3bf91563b200089c6/web_full_234626745906.jpg", "site_section": "http://www.dailyjournal.net//feed/sec/7000/", "section_title": "Entertainment News from dailyjournal.net", "url": "http://www.dailyjournal.net/view/story/99ba2ebc29334fb3bf91563b200089c6/US--Theater-Review-The-Gin-Game", "country": "US", "title": "Review: James Earl Jones, Cicely Tyson risk it in 'Gin Game'", "performance_score": 0, "site": "dailyjournal.net", "participants_count": 0, "title_full": "Review: James Earl Jones, Cicely Tyson risk it in 'Gin Game'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T05:02:00.000+03:00", "replies_count": 0, "uuid": "b92f1c87c49bad31e1da87ef758fbd42350bbc35"}, "author": "", "url": "http://www.dailyjournal.net/view/story/99ba2ebc29334fb3bf91563b200089c6/US--Theater-Review-The-Gin-Game", "ord_in_thread": 0, "title": "Review: James Earl Jones, Cicely Tyson risk it in 'Gin Game'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["James Earl Jones", "Cicely Tyson"], "text": "Review: James Earl Jones and Cicely Tyson make the 'The Gin Game' an honor to watch \nBy MARK KENNEDY AP Drama WriterOctober 14, 2015 - 10:02 pm EDT \nNEW YORK — One thing you should probably not bet against at \"The Gin Game\" on Broadway is the little old lady onstage who seems to have supernatural luck with cards. \nAnother is the two-person cast, James Earl Jones and Cicely Tyson — actors still performing at the highest level despite their combined age of 174. You might wonder if there's something supernatural at work there, too. \nThe handsome and beautifully acted revival of D.L. Coburn's Pulitzer Prize-winning play opened Thursday at the John Golden Theatre, the same venue where it made its Broadway debut in 1977. \nThe play about two lonely, alienated nursing home residents is directed by Leonard Foglia, who has put an emphasis on the play's humor. That makes for an enjoyable evening but also makes the come-out-of-nowhere ending a gut-wrencher. \nJones, 84, as Weller Martin and Tyson, 90, as Fonsia Dorsey are two still relatively spry elders who find themselves in \"a warehouse for the intellectually and emotionally dead.\" They strike up a tentative friendship over a series of gin rummy games. \nThe irascible Weller, long divorced and distanced from his ex-wife and children, was a businessman, done in by his partners. Fonsia, also divorced, is filled with bitterness toward her ex-husband and excuses for her son, who she says lives far away and can't come to visit her. In this image released by Boneau/Bryan-Brown, James Earl Jones, left, and Cicely Tyson appear during a performance of \"The Gin Game,\" playing through January 10, at the Golden Theatre in New York. (Joan Marcus/Boneau/Bryan-Brown via AP) \nThe enjoyment in Coburn's script comes mostly from Weller's increasing frustration at not being able to beat his new card partner, a woman blessed with an abundance of beginner's luck. \nJones curses up a storm, pushes for faster games and slaps the cards down on the table in hopes of winning just a single hand. \nTyson plays her little old lady with a stutter-step and tentativeness to her gait, but a mind sharp and stinging. There's a girlish glee that comes over her as each new round ends with her victory. Watching them together is a sheer honor. \nThe play takes place on a gritty back porch designed by Riccardo Hernandez, a stage ominously littered with discarded medical supplies like walkers and wheelchairs. A rain shower with real water is beautifully rendered. (The sounds of random bird tweets and insect noises, however, are annoying.) \nAs Weller grows more violent and insistent on avenging his losses, Fonsia tries to avoid him. So he repeatedly apologizes and she's lured back to the card table, along with her buzz saw of cleverness. There are real stakes at play for Weller to stay cool. \nBut the unfairness of it — the sheer frustration of loss and aging — is eventually too much for Weller and boils over in a final scene. But so adorable has been Weller, so shorn until that point of any real menace, that the audience is cheated and may not realize that something has forever altered. \nOnline: http://thegingamebroadway.com \nThink your friends should see this? Share it with them! \nStory copyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. \nFeedback, Corrections and Other Requests: AP welcomes feedback and comments from readers. Send an email to info@ap.org and it will be forwarded to the appropriate editor or reporter. We also have more stories about: (click the phrases to see a list) \nCategory:", "external_links": [], "published": "2015-10-15T05:02:00.000+03:00", "crawled": "2015-10-15T07:36:52.019+03:00", "highlightTitle": ""}