{"organizations": [], "uuid": "5b21880a330da0428c42e2d19abc2ffcd89877c5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kptv.com", "main_image": "", "site_section": "http://kptv.com/category/13540/entertainment?clienttype=rss", "section_title": "KPTV.com - Entertainment - Headline", "url": "http://www.kptv.com/story/30183746/grateful-dead-john-mayer-giving-away-10k-tickets-to-ny-show", "country": "US", "title": "Grateful Dead, John Mayer giving away 10K tickets to NY show", "performance_score": 0, "site": "kptv.com", "participants_count": 1, "title_full": "Grateful Dead, John Mayer giving away 10K tickets to NY show - KPTV - FOX 12", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "5b21880a330da0428c42e2d19abc2ffcd89877c5"}, "author": "cbs8", "url": "http://www.kptv.com/story/30183746/grateful-dead-john-mayer-giving-away-10k-tickets-to-ny-show", "ord_in_thread": 0, "title": "Grateful Dead, John Mayer giving away 10K tickets to NY show", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (AP) - Members of the Grateful Dead and John Mayer are giving away 10,000 free tickets to a concert next month.\nThe veteran band and Mayer, who joined forces for the supergroup Dead & Company this summer, announced Monday that 5,000 fans will have a chance to win two tickets each to their Nov. 7 show in New York City.\nThe group has partnered with American Express for its music series, \"American Express Unstaged,\" for the sweepstakes. Film director Brett Ratner will direct the concert's livestream from Madison Square Garden.\n\"People who want to hear the music get to hear it for free and we get to promote our music and share it with people,\" Bob Weir said in an interview with The Associated Press on Saturday.\nFans can enter to win tickets Monday through Thursday on Dead & Company's website. No tickets for the show will go on sale.\nGrateful Dead's Weir, Mickey Hart and Bill Kreutzmann are part of Dead & Company with Mayer; Phil Lesh is not involved.\nThey group is performing a string of U.S. dates on a fall tour, which kicks off Oct. 29 in Albany, New York.\n\"We're about halfway in and rehearsals are going well, if I may say,\" Weir said. \"We've been through 45 or 50 tunes and I'm not going to tell you that we have them entirely locked down, but we have a good handle on them.\"\nThe band is encouraging fans who attend the show or watch the livestream to donate to the Robin Hood Foundation, an organization fighting poverty in New York City.\n___\nOnline:\nhttp://www.deadandcompany.com/ \nCopyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-05T09:08:52.548+03:00", "highlightTitle": ""}