{"organizations": [], "uuid": "84ca76b22c7b28f76a1a9f9a1e3f2523d0dc4f48", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.aceshowbiz.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Aceshowbizcom-EntertainmentNews\r", "section_title": "Aceshowbiz.com - Entertainment News", "url": "http://www.aceshowbiz.com/news/view/00089786.html", "country": "US", "title": "Report: Sofia Vergara's Wedding Dress Is Designed by Zuhair Murad", "performance_score": 0, "site": "aceshowbiz.com", "participants_count": 1, "title_full": "Report: Sofia Vergara's Wedding Dress Is Designed by Zuhair Murad", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T06:02:00.000+03:00", "replies_count": 0, "uuid": "84ca76b22c7b28f76a1a9f9a1e3f2523d0dc4f48"}, "author": "AceShowbiz.com", "url": "http://www.aceshowbiz.com/news/view/00089786.html", "ord_in_thread": 0, "title": "Report: Sofia Vergara's Wedding Dress Is Designed by Zuhair Murad", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments Sofia entrusted her wedding dress to Lebanese fashion designer Zuhair who previously designed her dress for Oscar and Golden Globe parties. \nSofia Vergara is gearing up for her approaching wedding to actor Joe Manganiello . Us Weekly reported that the \" Modern Family \" actress entrusted her wedding dress to Lebanese fashion designer Zuhair Murad. Zuhair previously designed Sofia's dress for Oscar and Golden Globe parties. The 43-year-old actress looked gorgeous in some sequinned dresses designed by Zuhair in the past. For the upcoming nuptials, Sofia will wear a custom-made, fairy-tale frock. Other details about the dress haven't been revealed yet. Sofia and Joe were engaged in Hawaii in December last year. The couple will marry at Florida's Breakers resort in Palm Beach on November 22. Sofia revealed on \" Jimmy Kimmel Live! \" that they would invite 400 guests and use Colombian tradition for the wedding which means there will be no bridesmaids. In another interview, Sofia said that there would be a \"special\" cake table with \"a big wedding cake and lots of desserts.\" However, there won't be a gift table. An insider said that the pair requested donations to Vergara's beloved St. Jude Children's Research Hospital instead. The couple recently sent luxurious 8-by-8-inch invitations to their guests. A source said of the invitations, \"They're classy and white. It cost around $7 to mail each one!\" \n© AceShowbiz.com", "external_links": [], "published": "2015-10-16T06:02:00.000+03:00", "crawled": "2015-10-16T10:22:46.264+03:00", "highlightTitle": ""}