{"organizations": ["Country Music Association Foundation", "Pelham Gardens Middle School", "Big Apple"], "uuid": "53e8f2ac277a3944c672650676db58a361cf118a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.whio.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/10/12/35/d4/48eb3e592dc04ac0887326a24e75ab6f-c42757f106994e4ca098e085c83972b2-0.jpg", "site_section": "http://www.whio.com/feeds/categories/entertainment/", "section_title": "News | Entertainment", "url": "http://www.whio.com/ap/ap/entertainment/that-new-york-twang-nashville-calls-on-big-apple-s/nnzkf/", "country": "US", "title": "That New York twang: Nashville calls on Big Apple schools", "performance_score": 0, "site": "whio.com", "participants_count": 0, "title_full": "That New York twang: Nashville calls on Big Apple schools", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T07:28:00.000+03:00", "replies_count": 0, "uuid": "53e8f2ac277a3944c672650676db58a361cf118a"}, "author": "", "url": "http://www.whio.com/ap/ap/entertainment/that-new-york-twang-nashville-calls-on-big-apple-s/nnzkf/", "ord_in_thread": 0, "title": "That New York twang: Nashville calls on Big Apple schools", "locations": ["New York", "Bronx", "Nashville"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mathis", "Liz Rose"], "text": "Updated: 12:31 a.m. Monday, Oct. 12, 2015 | Posted: 12:28 a.m. Monday, Oct. 12, 2015 That New York twang: Nashville calls on Big Apple schools Related View Larger In this Oct. 5, 2015 photo, Liz Rose, center, a Grammy-award winning country music songwriter from Nashville, rehearses a song with students at Pelham Gardens Middle School in the Bronx borough of New York. Rose is working with the students through a program funded by the Country Music Association Foundation which provides a curriculum for teachers to develop language skills through the art of songwriting. (AP Photo/William Mathis) Sponsored Links The Associated Press NEW YORK — \nAs the Bronx middle schoolers harmonized in their auditorium and plucked out basic chords on ukuleles and guitars, in walked their music instructor, Liz Rose — a Grammy-award winning country songwriter from Nashville. \nRose has penned tracks for some of the biggest names in the business, including Taylor Swift. But on this recent fall day, she helped 19 students write an original tune called \"Everybody's Perfect.\" \n\"Y'all are awesome,\" Rose said as she approached the stage. \"Y'all made me cry.\" \nCountry music and New York City don't go hand in glove; the city has only one country radio station, which came on the air two years ago after a 17-year drought. Nonetheless, Music City musicians are partnering with a nonprofit that is providing music education in New York City schools to help boost it as a core subject. \nThe students at Pelham Gardens Middle School in the Bronx are among 500 students in 15 schools around the city to participate; they receive 10 lessons on how to write lyrics, and one class in each school has a videoconference session with a musician in Nashville. \nThe Nashville-New York connection is made through the Country Music Association Foundation, which began in 2006 to help fund music education programs in Nashville and is branching out across the country. \nIn recent years, it has donated to the New York-based nonprofit Education Through Music, which helps provide music education to all students in 50 low-income elementary and middle schools in all five city boroughs. It also works with Words & Music, based out of the Country Music Hall of Fame and Museum in Nashville, which provides a curriculum for both music and language arts teachers to develop language skills through the art of songwriting. \nThe Country Music Association Foundation wanted to bring the two together, and the program was born. \nRose, who won a Grammy with Swift for best country song in 2010 for \"White Horse,\" first met her students over Skype. Rose helped them write the lyrics for the song, which they performed this past week at All for the Hall, a benefit concert for education programs at the Country Music Hall of Fame and Museum at the Best Buy Theater in Times Square. Students shared the stage with Brad Paisley , Paul Simon and Carrie Underwood. \nFor many of the New York kids, country music was unfamiliar territory. \nCorey Stuckey, 12, said he has been inspired to write songs in the past by hip-hop and R&B artists such as R. Kelly and Ludacris. But now he is opening up to country, too. \n\"I like country music because of the tone of it,\" the seventh-grader said. \"It's kind of like reggae, but it's different because it's more calming.\" \nRose said she applied the same techniques she uses when collaborating with professionals. She had the students shout out whatever was on their minds, and they said things like, older kids are tall, ice cream and hallways. She quickly jotted down everything they said and then started to place the words together like puzzle pieces. \n\"It's not different for whoever you're writing with. It's about getting them to talk,\" she said. \"And then I would ask them questions and put a line together.\" \nUltimately they wrote: \"Everybody's Perfect,\" an homage to the difficulties of life at a new school. \nMoesha Masters, 11, helped come up with the inspiration for the title. \n\"I moved a lot and it was hard making friends,\" she said. \"And I realized I'm not perfect. But after I looked at that I realized everyone's perfect in other ways.\" \n\"Ice cream, money and MetroCards and full backpacks and school is hard!\" the students sang. With lots of oohs and aahs and an upbeat, catchy melody, the students' song emulated more the contemporary pop-country of Taylor Swift than the old-country twang. \nPeter Pauliks, director of programs for Education through Music, urged the students at the rehearsal to enunciate every word so that a diverse audience would understand the song's message. \n\"In Nashville, I don't think they even have MetroCards,\" he reminded them. \nKyle Young, chief executive officer of the Country Music Hall of Fame, says he was moved when he saw the students from the Bronx onstage at All for the Hall, dressed in their blue school uniforms under T-shirts for Words & Music and Education Through Music. \n\"This is why we go to work every day,\" he said. \"It's not about the genre, it's about giving kids an opportunity to express themselves and create.\" Copyright The Associated Press Sign up for our WHIO-TV Daily Headlines Newsletter Sign Up", "external_links": [], "published": "2015-10-12T07:28:00.000+03:00", "crawled": "2015-10-13T07:29:34.987+03:00", "highlightTitle": ""}