{"organizations": [], "uuid": "894a11990eb9ff41648d56bf90c8cd219468dc2a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reviewjournal.com", "main_image": "http://www.reviewjournal.com/sites/default/files/field/media/1003840014_nv_lvrj_jewel_re.jpg", "site_section": "http://feeds.feedburner.com/Reviewjournalcom-Neon", "section_title": "Entertainment", "url": "http://www.reviewjournal.com/opinion/columns-blogs/doug-elfman/jewel-promises-no-shortage-luxury-entertainment", "country": "US", "title": "Jewel promises no shortage of 'luxury entertainment'", "performance_score": 0, "site": "reviewjournal.com", "participants_count": 1, "title_full": "Jewel promises no shortage of 'luxury entertainment' | Las Vegas Review-Journal", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T02:09:00.000+03:00", "replies_count": 0, "uuid": "894a11990eb9ff41648d56bf90c8cd219468dc2a"}, "author": "Doug Elfman", "url": "http://www.reviewjournal.com/opinion/columns-blogs/doug-elfman/jewel-promises-no-shortage-luxury-entertainment", "ord_in_thread": 0, "title": "Jewel promises no shortage of 'luxury entertainment'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Remember Haze nightclub, the one in the Aria hotel, the one that closed after a Haze patron left the club and, allegedly, drove after a fellow patron in anger, causing a car crash to explode a taxi and kill three people in 2013?'\nOn Wednesday, Hakkasan Group, which took over the ghost of Haze from Light Group just months ago, announced it will transform the space into \"Jewel,\" adding this vow: \"Continuing with the next generation of luxury entertainment offerings.\"\nJewel may open in the spring, capable of holding 1,925 partiers in 24,000 square feet of space, blinged out in shiny Hakkasan-esque objects of the shamalamadingdong variety.\nJust last week, Hakkasan dumped two of its holdings — Mandalay Bay's Light nightclub and Daylight dayclub, two properties Hakkasan recently picked up from Light Group, after some legal maneuvering between Hakkasan and investors.\nCirque du Soleil, which used to stage weird sensuous stuff in the Light clubs, has also pulled out of the Light and Daylight, both of which are now under the direction of people who truly know how to party — venture capitalists.\nCHO: BRING BELL-BOTTOMS BACK\nAs I reported a few weeks ago, Margaret Cho is planning to officiate an LGBTQ wedding onstage during her stand-up show on Friday at Treasure Island hotel.\nAnd since Hillary Clinton and Bernie Sanders, et al., just performed their own show in Las Vegas on Tuesday, I have Cho's official stance on her political dream ticket:\n\"I really like Bernie Sanders a lot. I'm kind of an old-school Hillary supporter, although I did switch from Hillary to Obama eight years ago,\" Cho said. \"I do wish they would run on the same ticket.\"\nCho and I got to talking about a theme I've been pondering a lot this year, that some 1970s-style American traits have returned to mass culture, specifically that it's cool again for people to be gay, feminist, rock a mustache and smoke marijuana.\n\"The Seventies was a very revolutionary and thrilling time, culturally. I do think some of that is back,\" Cho said.\n\"I just hope the fashion comes back.\"\nWhat kind of Seventies fashions?\n\"I like bell-bottoms, and wide collars, and big wide ties, and long flare pants, men's pants for women,\" and punk and new wave clothes, she said.\nShe's quite fond of the androgynous styles of the \"Annie Hall\" era.\n\"Unisex tried to equalize the sexes by fashion, which is a cool thing,\" she said. \"I do enjoy a lot of men's fashion and wear it. I fit in that androgynous category.\"\nCan America handle bell-bottoms again?\nBOOKS AND PODCASTS\nIf you're one of those Las Vegans who bemoans our supposed lack of traditional culture (dude, we have the Strip, that's new culture!), then get ye self to this weekend's Vegas Valley Book Festival downtown.\nThursday through Saturday, authors (including me) will be meeting, greeting, speaking aloud and discussing super cool things, such as symbolism, alternative realities, yada.\nCheck out the whole enchilada at vegasvalleybookfestival.org.\nIf you can't wait to see me there (calm down, I'm ego-joking), go to iTunes or a podcast app and listen to me say curse words about famous people on the Thursday podcast, \"Matt and Mattingly's Ice Cream Social,\" hosted by some of the funniest improvisational actors anywhere (mattandmattingly.com)\nPORN AGAIN\nDon't you just love how convincing porn names are? Friday through Sunday, the Adult Film Festival of Las Vegas will roll out the red carpet for Misty Stone, Leya Falcon, Shane Diesel, Kianna Bradley, Kiki D'Aire, Raquel Sultra, Danny Blaq, Alura Jenson, Hustler Honeys, Kima Shines, Wesley Pipes, Nikki Phoenix, Veronica Vain and Julien Grei.\nThis goes down noon-10 p.m. Friday and Saturday; noon-7 p.m. Sunday; at Cashman Field convention halls. It's officially called \"Daejha Milan's Adult Film Festival Las Vegas\" ( http://afflv.com ).\nTickets are available at Showgirls Video (next to \"Pawn Stars'\" pawnshop) and at Deja Vu adult store, and cost $37 each day, although people who are disabled or who are military/EMS/cops/firefighters get in for $27, and oddly, if you arrive with this column, you'll get $5 off. (This is a special the event organizers told me about after I told them I was typing this up; it's not something I worked out in advance.)\nSaturday's after-party is around 11 p.m. at the Hustler Club, which, like finer strip clubs in town, offers free shuttle service. Isn't that nice?\nDoug Elfman can be reached at delfman@reviewjournal.com . He blogs at reviewjournal.com/elfman. On Twitter: @VegasAnonymous \nUB40 star says world needs...    ", "external_links": [], "published": "2015-10-15T02:09:00.000+03:00", "crawled": "2015-10-16T07:43:29.523+03:00", "highlightTitle": ""}