{"organizations": [], "uuid": "d14d7fce8485528a4277becaa893e0c7c8c7ceb7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.heraldscotland.com", "main_image": "http://www.heraldscotland.com/resources/images/sitelogo/", "site_section": "http://www.heraldscotland.com/arts_ents/", "section_title": "Arts and Entertainment | Herald Scotland", "url": "http://www.heraldscotland.com/arts_ents/13810902.Alison_Rowat_film_review__Sicario_with_Emily_Blunt__Josh_Brolin_and_Benicio_Del_Toro/", "country": "GB", "title": "Alison Rowat film review: Sicario with Emily Blunt, Josh Brolin and Benicio Del Toro", "performance_score": 0, "site": "heraldscotland.com", "participants_count": 1, "title_full": "Alison Rowat film review: Sicario with Emily Blunt, Josh Brolin and Benicio Del Toro (From Herald Scotland)", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T07:06:00.000+03:00", "replies_count": 0, "uuid": "d14d7fce8485528a4277becaa893e0c7c8c7ceb7"}, "author": "Alison Rowat", "url": "http://www.heraldscotland.com/arts_ents/13810902.Alison_Rowat_film_review__Sicario_with_Emily_Blunt__Josh_Brolin_and_Benicio_Del_Toro/", "ord_in_thread": 0, "title": "Alison Rowat film review: Sicario with Emily Blunt, Josh Brolin and Benicio Del Toro", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sicario (15)\nfour stars\nDir: Denis Villeneuve\nWith: Emily Blunt, Josh Brolin, Benicio Del Toro\nRuntime: 121 minutes\nEARLY on in Denis Villeneuve's slow burn but highly satisfying crime drama, the forces of law and order come across a scene to make even the hardest of agents blanche.\nWhat truly sends a chill down the spine of officialdom, however, is that the location for this mayhem is not south of the border in a foreign land, but across it, in the USA itself. A line has been crossed in the drugs war in more ways than one, and a response must be found. But what, who will enforce it, and to what ends?\nThose are the questions which lie, brooding, at the heart of Sicario, an intensely macho picture with the twist that the main character is a female FBI agent, played by British actress Emily Blunt. Perhaps best known for her turn as a neurotic assistant to a ‘mare of a boss in The Devil Wears Prada, Blunt here swaps stilettos for steel toe-capped boots, the better to kick down doors with, my dear. The style change suits her, even if the role is not without its shrieking contradictions.\nFollowing the incident in Arizona, agent Kate Macer is invited to go on a special assignment. Those issuing the invitation include the quasi-charming, half-menacing Matt Graver (Josh Brolin). The big picture is that they will be going after the cartels. As for the details, they can wait. Macer’s ambition, and willingness to serve her country, persuade her to throw caution to a passing desert wind and sign up.\nPromoted stories Joining Macer and Graver on the trip south is the mysterious, first name only, Alejandro (Benicio Del Toro). He is one of the many details which must remain shrouded to Macer for now. Even when Alejandro does open his mouth it is to hint at more riddles wrapped in engimas inside mysteries. “Nothing will make sense to your American ears,” he tells Kate before a briefing at which she is the only woman among an assortment of beefy military types. Disappointingly, the address by Brolin is not delivered in Klingon. Sicario is a very serious picture.\nAs her attachment to Brolin’s squad continues, the puzzlement of Kate and her FBI colleague Reggie (another Brit, Daniel Kaluuya) only intensifies. The viewer will sympathise. Such is the quality of the performances, and the excitement of the action scenes, that one indulges Villeneuve (Prisoners) and even forgives the odd hokey line while we are waiting for all to be revealed. One just knows, for example, that at some point Kate will be told that “this is the future”, and so it proves.\nBlunt’s Kate is the latest action heroine to blast her way through cinema’s glass ceiling. From Jennifer Lawrence in the Hunger Games to Rebecca Ferguson in Mission: Impossible, and Blunt herself in Edge of Tomorrow, the sisters are doing the running, punching and shooting for themselves. In Kate’s case, however, it is only up to a point. She’s meant to be a tough, driven individual, but she is also pupil to her male colleagues’ masters, and they are her protectors. Plus, she takes on the traditional female role of being the film’s moral compass. It is a character, in short, that wants to have its feminist cake and eat it.\nShare article It is a difficult line to walk, but Blunt is the woman for the job. Brave but fragile, determined yet questioning, Kate is the mass of contradictions through which we view a complex, seemingly intractable situation. Brolin puts on his usual, enjoyably swaggering show, while Del Toro goes to town with Alejandro, a man with secrets embedded in his DNA, an hombre to keep an eye on, if you can.\nPerhaps the greatest bravery on show in Sicario (apart from that of the poor bloody civilians around whom the so-called “war on drugs” rages) is that of Villeneuve, who trusts the audience to keep the faith with a picture that reveals its secrets with extreme reluctance. His film offers no clean fix for the murky problems it explores, only plenty of broken dreams and bodies along the way.", "external_links": ["https://twitter.com/share?url=", "https://www.facebook.com/sharer/sharer.php?u="], "published": "2015-10-08T07:06:00.000+03:00", "crawled": "2015-10-08T04:39:14.337+03:00", "highlightTitle": ""}