{"organizations": [], "uuid": "2b99f89b2227e1d89ac672d8790d2d5417f3692e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.arcamax.com", "main_image": "http://www.arcamax.com/newspics/131/13106/1310653.jpg", "site_section": "http://www.arcamax.com/", "section_title": "News &amp; Entertainment by Email | ArcaMax Publishing", "url": "http://www.arcamax.com/currentnews/newsheadlines/s-1732564?fs", "country": "US", "title": "Floods inundate wide area of South Carolina | News & Features", "performance_score": 0, "site": "arcamax.com", "participants_count": 1, "title_full": "Floods inundate wide area of South Carolina | News & Features | ArcaMax Publishing", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T03:00:00.000+03:00", "replies_count": 0, "uuid": "2b99f89b2227e1d89ac672d8790d2d5417f3692e"}, "author": "arcamax.com", "url": "http://www.arcamax.com/currentnews/newsheadlines/s-1732564?fs", "ord_in_thread": 0, "title": "Floods inundate wide area of South Carolina | News & Features", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "COLUMBIA, S.C. -- A slow-moving storm in South Carolina left parts of Charleston underwater and dumped a more than a foot of rain on parts of Columbia.\nThe rainfall submerged lowing-lying traffic intersections around Columbia.\nRichland County declared a state of emergency Sunday, which allows the county to seek help from state emergency officials and buy emergency equipment and supplies.\nRoads were closed all over the Midlands. State officials told drivers to stay home -- even if there was little rain in their part of South Carolina.\n\"We've got another day of this at least,\" said Derrec Becker, a spokesman for the state Emergency Management Division.\nAt least four people across the state died in incidents related to the storm that started late last week. The latest was a motorist on U.S. 378 in West Columbia who died in floodwaters Sunday, an emergency official said.\nIn Columbia, the city received hundreds of calls requesting rescue and evacuation. Creeks overflowed into neighborhoods and shopping centers.\nBetween 3:30 a.m. and 7:30 a.m. Sunday, the Columbia Fire Department had rescued people in at least 50 vehicles throughout the capital city.\nFlooding is widespread in Columbia.\nAfter soaking Charleston with nearly two feet of rain since Thursday, the storm shifted northwest overnight and drenched the Midlands.\nAt least three dams had failed in Richland County by 9 a.m.\nThe Forest Lake, Arcadia Lake and Lake Dogwood dams had been affected by rising waters that were creating pressure, Lewis said.\nColumbia Fire Department spokesman Brick Lewis said he did not know of any injuries related to broken dams, but he said the department was generally busy helping people trapped in homes and cars across town. The first dam breaks were reported after dawn.\n\"The rainfall totals that have come in are causing the waters of these lakes to flow over the dams and just give way,\"\" he said. \"It is putting pressure on the dams.\"\nPresident Barack Obama declared a state of emergency for South Carolina on Saturday. The National Guard activated 300 more members, service members, bringing the total on duty to about 500, Becker said.\nSouth Carolina also asked other states to send swift-water rescue teams.\n––––\n(John Monk, Clif LeBlanc, Tim Flach, Sammy Fretwell, Sarah Ellis and Jamie Self contributed to this report.)\n(c)2015 The State (Columbia, S.C.)\nVisit The State (Columbia, S.C.) at www.thestate.com\nDistributed by Tribune Content Agency, LLC.\nShare Comment", "external_links": ["http://twitter.com/share?url=http://www.arcamax.com/currentnews/newsheadlines/s-1732564&hashtags=ArcaMax", "http://www.facebook.com/sharer.php?u=http://www.arcamax.com/currentnews/newsheadlines/s-1732564&h=Floods+inundate+wide+area+of+South+Carolina", "https://plus.google.com/share?url=http://www.arcamax.com/currentnews/newsheadlines/s-1732564"], "published": "2015-10-04T03:00:00.000+03:00", "crawled": "2015-10-06T04:23:45.912+03:00", "highlightTitle": ""}