{"organizations": [], "uuid": "97c8e42a8c086b55db333d07d611837baae4fbfa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mb.com.ph", "main_image": "http://www.mb.com.ph/wp-content/themes/city-desk/images/fb-image_200x200.jpg", "site_section": "http://www.mb.com.ph/category/entertainment/", "section_title": "mb.com.ph | Philippine News | Archive | Entertainment", "url": "http://www.mb.com.ph/solenn-heussaff-on-hot-showbiz-topics-her-new-movies/", "country": "CA", "title": "Solenn Heussaff on hot showbiz topics, her new movies", "performance_score": 0, "site": "mb.com.ph", "participants_count": 1, "title_full": "Solenn Heussaff on hot showbiz topics, her new movies | mb.com.ph | Philippine News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "97c8e42a8c086b55db333d07d611837baae4fbfa"}, "author": "Christine Allaine B. Dumaplin", "url": "http://www.mb.com.ph/solenn-heussaff-on-hot-showbiz-topics-her-new-movies/", "ord_in_thread": 0, "title": "Solenn Heussaff on hot showbiz topics, her new movies", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "by Christine Allaine B. Dumaplin\nOctober 5, 2015 A lot of celebrities have been raving about “Heneral Luna,” among them Solenn Heussaff, who watched the movie with her fiancé, Argentine businessman Nico Bolzico, and her dad.\n“I loved ’yung final message that your own enemy is yourself, tayong mga Pinoys mismo. I loved that they have shown that because totoo naman ’yun. I don’t know what their budget was pero ’yung mga scenes na may gunshots sa head and everything mukhang super high budget – ang galing.”\nSolenn Heussaff\nShe also liked it that the dialogue was a bit off-the-wall. “Kahit historical film siya, may comedy din – as in nakakatawa ’yung mga lines,” she added. “Maganda talaga ’yung movie, I loved it.”\nWe also asked her about Alden Richards, who is waxing hot for his hit partnership with Maine “Yaya Dub” Mendoza. Solenn and Alden once worked together on GMA-7’s Bayani Serye, “Ilustrado.”\n“He (Alden) was already big back then. He’s always been so kind to everyone he worked with. Kahit matagal na siyang actor, super down to earth niya,” said Solenn. “Sikat na sikat na siya ngayon, ang bilis ng pag-rise up niya to stardom, yet he is the same old Alden. Masaya ako para sa kanya, and para kay Yaya Dub as well.”\nNO ‘AWKWARD’ MOMENTS\nBefore her relationship with Nico, the actress dated hunk Derek Ramsay for three years.\nDerek admitted on “Gandang Gabi Vice” that his relationship with Solenn was something he “broke his own heart for.” The two reunites in the movie “Love is Blind.”\nSolenn said working with Derek was not awkward at all.\n“The shooting was actually fun. At first, I thought na baka maging awkward ng konti, pero feeling ko parang it just made it better. We got to talk about so many things. Maybe you can call it weird lang, pero hindi naman awkward,” she said.\nCOMING SOON\nSolenn will also appear in the romantic “Flotsam The Movie” opposite Rocco Nacino. The movie is close to heart because of the bond she formed with co-stars and production staff.\n“Iba talaga ‘yung naging samahan namin sa set. As in lahat kami parang magkakapatid na ngayon, like we always miss each other, we’re always talking to each other, ganun,” she said.\nThe movie is about people who love to surf. Solenn plays Kai, a career woman engaged to be married. She goes to Flotsam and Jetsam Hostel to take a break from the relationship. She meets Tisoy (Rocco Nacino), a bartender. Soon Kai will find herself having second thoughts on her wedding.\n“Flotsam” was shot on location in San Juan, La Union. “Iba lang ’pag nandun ka. Parang may magic, there’s something about the place that just brings people closer. Makikita ng makakanood ’yung relation between people in that place, na it’s all about having people come together as a community.”\nThe 30-year-old shared her favorite scene in the movie.\n“It was this bonfire scene where we have to pretend we were all drunk. Nag-request ako kay direk (director Jay Abello) kasi we were super sober, kaya mahirap mag-pretend. So, sabi ko sa kanya (direk Jay), ‘Pwedeng uminom ng isang beer lang para talagang ma-feel ko naman.’ Sabi niya, ‘No alcohol on my set.’ Sabi ko, ‘Sige po.’ So in that scene, all of us were super normal pero mukha talaga kaming drunk. I really loved that part.”\nJoining Solenn in the cast are Carla Humphries, Marc Abaya, Julia Quisimbing, Mara Lopez, Jun King Austria, Franco Daza, Gerard Sison, among others. “Flotsam” opens Nov. 4 in cinemas nationwide.", "external_links": ["http://i.po.st/static/v3/post-widget.js#publisherKey=4qcr4d26tnrf260rqrda&retina=true"], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-06T05:38:22.665+03:00", "highlightTitle": ""}