{"organizations": [], "uuid": "abdb02f09af99644cdc5a8054ce478bb5eaeee67", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mcall.com", "main_image": "http://www.trbimg.com/img-562a70be/turbine/ct-star-wars-force-awakens-trailer-viewership-20151023", "site_section": "http://www.mcall.com/rss/all-rss-entertainment-movies,0,7968136.hyperlink", "section_title": "Entertainment: Movie News", "url": "http://www.mcall.com/entertainment/ct-star-wars-force-awakens-trailer-viewership-20151023-story.html", "country": "US", "title": "'Star Wars: The Force Awakens' trailer draws 112 million views in 24 hours", "performance_score": 0, "site": "mcall.com", "participants_count": 1, "title_full": "'Star Wars: The Force Awakens' trailer draws 112 million views in 24 hours", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T20:33:00.000+03:00", "replies_count": 0, "uuid": "abdb02f09af99644cdc5a8054ce478bb5eaeee67"}, "author": "Tribune wire reports", "url": "http://www.mcall.com/entertainment/ct-star-wars-force-awakens-trailer-viewership-20151023-story.html", "ord_in_thread": 0, "title": "'Star Wars: The Force Awakens' trailer draws 112 million views in 24 hours", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "'Star Wars: The Force Awakens' trailer draws 112 million views in 24 hours 'Star Wars: Episode VII -- The Force Awakens' Film Frame / Associated Press \nFinn gets a helping hand in a scene from \"The Force Awakens.\" \nFinn gets a helping hand in a scene from \"The Force Awakens.\" (Film Frame / Associated Press) Tribune wire reports Contact Reporter How many people watched the new \"Star Wars\" trailer in 24 hours? \nWith less than two months to go before the theatrical debut of \"Star Wars: The Force Awakens,\" Disney and Lucasfilm trumpeted the record-busting pre-sales and the huge viewership of the latest trailer for the film, which premiered during halftime on \"Monday Night Football.\" \nAn announcement Friday deemed the \"Star Wars\" creators at Lucasfilm \"totally overwhelmed by the enthusiasm we've seen from fans this week and throughout the lead-up to this film.\" That included a monstrous 112 million views of the new trailer online in just the first 24 hours, building on top of the nearly 16 million viewers who had access to the preview via the football broadcast on ESPN, another part of the Disney family. \n\"Thank you all for making the 'Star Wars' universe what it is, for keeping it alive and growing and meaningful,\" said a statement from the company. \"'Star Wars' is back and beginning an exciting new journey, and it's because of you.\" \n\"Episode VII\" of the \"Star Wars\" series had set new presales records by Tuesday, bypassing \"The Hunger Games\" in first-day ticket sales, according to Fandango. The J.J. Abrams-directed picture obliterated the \"Games\" mark by more than eight times and traffic on Fandango's site surged to seven times above its peak level in less than 24 hours. \nLucasfilm said the fervor for tickets was worldwide. It reported that in the United Kingdom, more than 200,000 tickets were purchased on day one. Fans in Norway reportedly went out in sub-zero temperatures to get early tickets. Even with the record-setting sales, the company said tickets remain available for the opening weekend, following the Dec. 18 debut.", "external_links": [], "published": "2015-10-23T20:33:00.000+03:00", "crawled": "2015-10-24T22:48:35.572+03:00", "highlightTitle": ""}