{"organizations": [], "uuid": "d46bf72d2fcdd39e6ec2dbb332308c189ece4b5a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.yahoo.com", "main_image": "http://l3.yimg.com/bt/api/res/1.2/HqozphOzOvdtyQS3HKiAmQ--/YXBwaWQ9eW5ld3NfbGVnbztpbD1wbGFuZTtxPTc1O3c9NjAw/http://media.zenfs.com/en_us/News/afp.com/Part-PAR-Par8302806-1-1-0.jpg", "site_section": "http://news.yahoo.com/rss/entertainment", "section_title": "Entertainment News Headlines — Yahoo! News", "url": "http://news.yahoo.com/singer-stromae-return-fathers-homeland-rwanda-173609797.html", "country": "US", "title": "Singer Stromae to return to father's homeland Rwanda", "performance_score": 0, "site": "yahoo.com", "participants_count": 1, "title_full": "Singer Stromae to return to father's homeland Rwanda - Yahoo News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T03:00:00.000+03:00", "replies_count": 0, "uuid": "d46bf72d2fcdd39e6ec2dbb332308c189ece4b5a"}, "author": "news.yahoo.com", "url": "http://news.yahoo.com/singer-stromae-return-fathers-homeland-rwanda-173609797.html", "ord_in_thread": 0, "title": "Singer Stromae to return to father's homeland Rwanda", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Kigali (AFP) - Stromae, the French-speaking world's singing superstar, arrives in Rwanda Friday, birthplace of his father who was killed in the 1994 genocide.\nThe singer, who broke off an African tour in June after falling sick to the huge disappointment of fans, plays his first concert in Rwanda on Saturday, after performances in neighbouring Democratic Republic of Congo.\n\"I am very happy to see him return to his country of origin,\" said 20-year old fan Olivier Havugimana in Kigali, where excitement is mounting at the singer's visit.\nStromae, alias Paul Van Haver, 30, was born to Belgian mother and Rwandan father Pierre Rutare, an architect, who was among the estimated 800,000 slaughtered in the 1994 genocide.\nThe singer is expected make a private visit to Rwanda's genocide memorial in Kigali, as well as meet with family members who survived.\nIn Kigali, large posters dot the capital, and sound technicians are busy preparing the stage at a university for the concert.\nThe genre-merging Belgian singer, who earlier this month played in New York's Madison Square Garden -- only the third French-language artist to play the self-described \"World's Most Famous Arena\" after Charles Aznavour and Celine Dion -- is to perform in front of some 20,000 people in Kigali on Saturday evening.\nStromae has won a huge following in Belgium and France for his tunes, including his 2009 hit 'Alors on danse', which are danceable but also introspective with themes including the absence of his Rwandan father.\nMalendo Pierrot, 56, said he remembers Stromae's father, playing on the same basketball team, and only recently learned of the fame of the son of his late friend when reading a magazine.\n\"When I saw him for the first time, I said, it's the son of Pierre...he looks like Pierre, especially the eyes,\" he told AFP. \"It's a very good thing for him to return home - and make contact with its origins.\"\nConcert organisers Judo Kanobana has said that while the concert is the last leg in a long tour, the performance will hold \"a lot of emotion\" for the singer.\nPersonal Finance - Lifestyle Arts & Entertainment Rwanda", "external_links": [], "published": "2015-10-17T03:00:00.000+03:00", "crawled": "2015-10-17T00:56:57.310+03:00", "highlightTitle": ""}