{"organizations": [], "uuid": "c37d48706e9d1d98a0ecfced755b01a54f1ffea0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.examiner.com", "main_image": "http://cdn2-b.examiner.com/sites/default/files/styles/image_content_width/hash/cf/5e/cf5e95116ecc4bf42ff7504a07df542f.jpg?itok=rUC6IhgI", "site_section": "http://www.examiner.com/arts-and-entertainment", "section_title": "Arts &amp; Entertainment | Examiner.com", "url": "http://www.examiner.com/article/the-sinister-effects-of-sitting", "country": "US", "title": "The sinister effects of sitting", "performance_score": 0, "site": "examiner.com", "participants_count": 1, "title_full": "The sinister effects of sitting | Examiner.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T02:09:00.000+03:00", "replies_count": 0, "uuid": "c37d48706e9d1d98a0ecfced755b01a54f1ffea0"}, "author": "debbie mandel", "url": "http://www.examiner.com/article/the-sinister-effects-of-sitting", "ord_in_thread": 0, "title": "The sinister effects of sitting", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photo by Mark Thompson/Getty Images Hailed as worse than smoking, hazardous for your heart and metabolism and carrying a nearly 50% increased risk of death from any cause: Sitting. While sitting quietly and with good posture used to be deemed a virtue especially in a house of worship, at your desk, or in school, in our decade sitting has become sinister and worthy of condemnation. Sitting and resting while others serve you - an aspiration of the upper class - might be counterproductive making those who do the physical chores healthy while rendering those who are waited on sick and ripe for a revolution.\nEven if you begin your day with an intense workout around 60-90 minutes, you cannot feel smug and rest on your laurels for the remains of the day. Movement as prescribed by the medical community has to be continuous - throughout the day; this means brief walks, stretches, or deskercising like doing chair squats or desk push-ups.\nPeople look down at you if you sit all day!\nEmployees are advised to get up and move every half an hour or so, or even better, do their work while standing, or walking slowly on a treadmill with a vertical desk. Business leaders encourage this type of work station because studies show that productivity increases, mental sluggishness disappears, and stress is reduced when employees move.\nSchools are learning that children need to move around rather than sit still all day. Gym and recess are necessary for academic success. Also, children who exercise are less stressed and less likely to be bullied.\nIn spite of Netflix and Amazon Prime both children and adults are urged to stop binge watching, or vegging out nightly in front of the TV because medical research points out that TV viewing contributes to obesity, junk food eating, passivity, sluggishness, back aches, stiff knees and overall poor health. Note: there are exercises you can do while watching TV.\nThink about the connotations associated with sitting versus standing:\n* You stand up for your rights\n* You are an upstanding citizen\n* Speakers stand at the podium\n* Cheer leaders don’t sit when they cheer a team to victory\n* A sitting duck is vulnerable to attack\n* People sit up and take notice for more ways to stand\n* Sitting in a specific posture for long periods of time is hard on the skeletal frame, muscles and joints\n* Jews who are in mourning sit shiva and when the seven days of sitting shiva are over, they take a walk around the block to signify their freedom from sorrow\n* Ask anyone contemplating retirement if he or she plans to just sit on a porch\nFor more info on health and happiness visit: www.turnonyourinnerlight.com", "external_links": [], "published": "2015-10-14T02:09:00.000+03:00", "crawled": "2015-10-14T03:55:48.354+03:00", "highlightTitle": ""}