{"organizations": [], "uuid": "d035e8e2a690c8cad5eef85389c29418aade81ef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://images.canberratimes.com.au/2015/09/30/6889968/Thumbnail1000877593gjw8pnimage.related.thumbnail.320x214.gjwa3d.png1443755846207.jpg.jpg", "site_section": "http://feeds.canberratimes.com.au/rssheadlines/entertainment.xml#", "section_title": "Canberra Times Entertainment Headlines", "url": "http://www.canberratimes.com.au/entertainment/irine-vela-giving-a-voice-to-the-real-australia-20150928-gjwa3d.html", "country": "AU", "title": "Irine Vela: Giving a voice to the 'real Australia'", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "Irine Vela: Giving a voice to the 'real Australia'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T16:45:00.000+03:00", "replies_count": 0, "uuid": "d035e8e2a690c8cad5eef85389c29418aade81ef"}, "author": "Kylie Northover", "url": "http://www.canberratimes.com.au/entertainment/irine-vela-giving-a-voice-to-the-real-australia-20150928-gjwa3d.html", "ord_in_thread": 0, "title": "Irine Vela: Giving a voice to the 'real Australia'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Milad Norouzi, Irine Vela and Ez Eldin Deng of GrandDiVisions . Photo: Simon O'Dwyer \n\nThe inspiration for composer Irine Vela's new work comes as much from what she sees in our arts landscape as what she doesn't. Her ensemble piece GrandDiVisions , premiering at this year's Melbourne Festival, gives a voice to young artists who otherwise may not have the opportunity. Vela describes her hip-hop harp concerto as an \"urban cantata\" which explores the idea of  \"falling in and out of love with Australia\".\nIt is, she says, a vision of \"real Australia\".\n\"On our stages and in our media, we stereotype 'the other'.\" Vela says. \"That's just not the reality; it's just not true. And the best way to address that, we think, is by presenting artists from countries that are somehow demonised by our media and reduced to a stereotype, a cliche.\" Vela, who composes for film and television (she won the 2012 APRA Screen Music Award for Best Soundtrack for The Slap ) and has worked with Massive Hip Hop Choir, Melbourne Youth Music and The Centre for Poetics and Justice.\n\"For me, there's an excitement about all the diverse artistic voices.\nAdvertisement \"It's called GrandDiVisions with a capital 'V' as in 'visions' because it's like a snapshot of a world  – a face of Australia that people don't necessarily connect with Australia.\"\nVela is creative producer at Outer Urban Projects, an arts organisation working with young people in Melbourne's Hume and Whittlesea shires, which take in outer suburbs like Broadmeadows, Sunbury, Mill Park; places rarely, if ever, represented on our main stages, and certainly not on TV. And yet almost half of Melbourne's population lives in the outer suburbs – and in the shire of Hume there are 145 nationalities. \n\"Everything is all so white, middle class and … it's not that interesting all the time,\" she says. \"It's one part of our diversity but there are so many great performers and fantastic voices with stories; that's my interest.\"\nVela wrote GrandDiVisions, a collaboration between Outer Urban Projects, Newsboys Foundation and the Arts Centre, with a communal execution in mind: as well as a 25-piece string orchestra, the stage will be shared by rappers, poets, gospel singers, contemporary dancers, an Indian tabla player and a solo harpist.\nSome of the performers – a mix of emerging and professional – are from refugee backgrounds, and one of the narrative strands evolved from their experiences.\n\"Particularly their connections with their mothers,\" Vela says. \"Many of them can't see their families as they're in different countries.\"\nThemes of family and of waiting – an often unconsidered aspect of the refugee experience – are explored in the work of rapper and storyteller Ez Eldin Deng. After Deng, 27, and his family fled South Sudan, they were \"stuck\" in Egypt waiting to be resettled somewhere safe; after eight years they moved to Australia.\n\"I was about eight, and I didn't understand at all; I kept asking my Mum, and she would say, 'We have to wait, we have to wait',\" he says.\n\"When I was 15, I saw the problem more clearly and ... I could see other people we knew leaving. That was worse because I could see a little window now, and I could speak for myself.\"\nHe compares the years of waiting to the film The Terminal , based on the story of Mehran Karimi Nasseri​, who spent 18 years at Charles de Gaulle Airport.\n\"You're just stuck in … nowhere.\"\nDeng, now an aspiring filmmaker, says singing, rapping and theatre motivated him to learn English.\n\"I would write but I didn't know what I was writing – I was just copying the words but they would stick in my brain,\" he says. \"Then I moved into theatre where I would read words and memorise it. I was really hungry and wanted to do something … to repay back my Mum one day.\"\nFellow rapper Milad Norouzi, who has been in Melbourne only a few months, also uses rapping and poetry to help him learn English. Norouzi also knows what it is to wait  – at just 17, he fled Iran after recording an anti-establishment song that found its way into the hands of the Iranian \"morality police\", the Basij.\n\"These police, they have all the good jobs, and people who go to university and have all the knowledge, they are driving taxis – this is what I wrote about in my rap,\" he says.\nHis parents organised for him to leave the country on a fake passport, and he has been waiting – first in Iraq, then Malaysia, Indonesia and finally Australia – for a permanent home for more than two years.\n\"It's been a long journey, all on my own.\"\nHis rap, which he performs in a mix of Persian and English, talks about censorship in Tehran, and his journey here.\nBoth he and Deng say they love Australia – but also find it difficult at times.\n\"Australia is a great place to live, but at the same time, there's nothing wrong with criticising it and with expressing through art one's frustration,\" Vela says.\nThe show doesn't have a particular message. \n\"The act of getting up to 20 emerging artists on stage from all backgrounds is the narrative in itself,\" Vela says. \"Then there's the mix with all these individual voices and individual stories … with 52 people on stage!\"\nThe gravity of performing at an international festival, sharing a bill with main stage acts from around the world, isn't lost on those new to the stage.\n\"My responsibility is to ... speak for people who can't really speak for themselves and to explain to the audience what we we're going through here in Australia and back home,\" Deng says.\n\"This show will be a small little window for our voices to be heard. If we can't do anything else, we can project our voices.\"\nGrandDiVisions is at the Fairfax Studio, Arts Centre, from October 14-17.", "external_links": [], "published": "2015-10-02T16:45:00.000+03:00", "crawled": "2015-10-02T22:24:37.237+03:00", "highlightTitle": ""}