{"organizations": [], "uuid": "919cbe17107515c58f73ac919b6ceea108e00cf4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "savannahnow.com", "main_image": "http://savannahnow.com/sites/default/files/images/sms-default-facebook-share.jpg", "site_section": "http://savannahnow.com/", "section_title": "savannahnow.com | Savannah Georgia's source for News, Entertainment, Sports, Weather, Classifieds, Jobs, Autos, Real Estate and St. Patricks Day", "url": "http://savannahnow.com/accent/2015-10-16/family-relationships-protect-yourself-emotional-vampires", "country": "US", "title": "Family Relationships: Protect yourself from emotional vampires |", "performance_score": 0, "site": "savannahnow.com", "participants_count": 1, "title_full": "Family Relationships: Protect yourself from emotional vampires | savannahnow.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T19:15:00.000+03:00", "replies_count": 0, "uuid": "919cbe17107515c58f73ac919b6ceea108e00cf4"}, "author": "Michelle Aycock", "url": "http://savannahnow.com/accent/2015-10-16/family-relationships-protect-yourself-emotional-vampires", "ord_in_thread": 0, "title": "Family Relationships: Protect yourself from emotional vampires |", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Michelle Aycock I have gotten a lot of emails from readers who have questions about how to deal with problematic people. My best advice is found in a column I wrote about these types of individuals who I label as “emotional vampires.” These individuals tend to suck all of the positive emotional energy out of a person.\nI am sure you know of at least one person in your life who fits this profile. It could be a family member or friend who gets upset with you when you don’t answer his or her phone call every time they call. They may even get offended when you don’t want to stop whatever you are doing to listen to their gossip. You may feel guilty if you don’t drop everything to help or even listen to them.\nThese types of individuals I label as “emotional vampires” because they tend to suck all of the emotional energy out of you. They leave you feeling guilty, exhausted and inadequate. If you have this type of individual in your life then you probably have little emotional energy left for yourself. If so, then you understand what it can be like if you do not set limits or boundaries with people in your life.\nIt can be hard to set boundaries with others who are in our lives. We all have an innate need to be liked by our friends and family. However, people who are not able to set and maintain boundaries with others often find that it is harder to meet their own needs.\nKeep in mind that boundaries are important in maintaining healthy relationships with family and friends. In setting boundaries you are able to give and do for others those things that you choose, also it will make others conscious of the fact that you respect yourself enough to take the time to rest and replenish your emotional energy.\nSome ways to manage “emotional vampires” who exist in your life include:\n• Saying no to people is OK. It is important to practice saying no. Society, and more than likely your family, growing up has taught you that being selfish is not good, but I am here to tell you that it is OK to be selfish. In fact, it is necessary to take care of yourself emotionally.\n• You do not have to explain yourself and/or your decisions. When you are doing for yourself, there is no need for you to explain your needs to others. Offering explanations may give the impression that you don’t believe that your wants and needs are important. Unfortunately, one lesson I learned later in life is that you can’t please everyone in your life; the only person you have control of pleasing is yourself so do it often.\n• Replenish your emotional energy by setting boundaries with yourself and others. Do activities that you enjoy and don‘t get frustrated if you fail to keep the boundaries you have set with others. Use it as a learning experience and take from that what you need to be more successful the next time with enforcing your boundaries with others and yourself.\nGetting rid of emotional vampires in your life is difficult, but well worth the effort. Keep in mind that this is your life and you are responsible for taking care of yourself emotionally. If you are not emotionally healthy, then you can’t help take care of yourself or even others.\nI remember what I and all other passengers are told when traveling on an airplane, “In case of an emergency, you must put on your oxygen mask first before helping others.” This statement rings true and is reminding us that we have to be healthy before we can even attempt to help others.\nTaking care of yourself emotionally is not a tough task. If you feel that you could have a more positive life, then the first step is to get the emotional vampires out of your life and put boundaries in place not only with others but yourself as well. You will then see how fast your emotional health improves.\nMichelle Aycock is a licensed psychotherapist. Her office number is 912-233-4294. Her website is www.coastaltherapist.com . Submit a family relationship question at michelle@coastaltherapist.com.", "external_links": ["http://sav-cdn.com/sites/all/themes/savannahnow/images/blank.gif"], "published": "2015-10-16T19:15:00.000+03:00", "crawled": "2015-10-17T12:15:47.168+03:00", "highlightTitle": ""}