{"organizations": [], "uuid": "75b89f6fea0081a4ad23c81b82a2550bfd501b3d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "savannahnow.com", "main_image": "http://savannahnow.com/sites/default/files/14800483.jpg", "site_section": "http://savannahnow.com/", "section_title": "savannahnow.com | Savannah Georgia's source for News, Entertainment, Sports, Weather, Classifieds, Jobs, Autos, Real Estate and St. Patricks Day", "url": "http://savannahnow.com/news/2015-10-10/savannah-district-5-large-post-1-candidates-lay-out-positions-issues", "country": "US", "title": "Savannah District 5, At-large Post 1 candidates lay out positions on issues", "performance_score": 0, "site": "savannahnow.com", "participants_count": 1, "title_full": "Savannah District 5, At-large Post 1 candidates lay out positions on issues | savannahnow.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T18:59:00.000+03:00", "replies_count": 0, "uuid": "75b89f6fea0081a4ad23c81b82a2550bfd501b3d"}, "author": "Eric Curl", "url": "http://savannahnow.com/news/2015-10-10/savannah-district-5-large-post-1-candidates-lay-out-positions-issues", "ord_in_thread": 0, "title": "Savannah District 5, At-large Post 1 candidates lay out positions on issues", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photos Back | Next Back | Next Back | Next Back | Next SPECIAL OFFER FOR NEW READERS 99 cent digital subscription to savannahnow.com\nSubscriber-members get access to ALL our digital products AND become eligible for free event tickets, discount coupons and other benefits. SIGN UP FOR SUBSCRIBER BENEFITS As a Savannah Morning News / savannahnow.com subscriber, you're eligible for members-only discounts. Download your coupons now. SPECIAL OFFER FOR NEW READERS 99 cent digital subscription to savannahnow.com\nSubscriber-members get access to ALL our digital products AND become eligible for free event tickets, discount coupons and other benefits. SIGN UP FOR SUBSCRIBER BENEFITS As a Savannah Morning News / savannahnow.com subscriber, you're eligible for members-only discounts. Download your coupons now. By Eric Curl Unlike some other races that have drawn multiple candidates, each incumbent is facing one challenger in the race for Savannah’s fifth district and alderman-at large, post 1 seat.\nAll of the candidates who will be on the Nov. 3 city election ballot recently sat down to discuss their priorities for the districts and the city.\nThe conversations have been edited because of space constraints and for the purposes of clarity.\nDISTRICT 5\nSHAUNDRA MCKEITHEN\nBIO: McKeithen is a two-time graduate of Savannah State University and has a bachelor’s in social work and a master’s of public administration degree and is also a member of Alpha Kappa Alpha Sorority Inc.\nShe has worked for the Department of Community Health as the director of hospital services; Phoebe Putney Memorial Hospital as a grants and development manager; and Chatham County Building Safety as administrative assistant managing the Occupational Tax Division.\nShe currently provides consulting services for nonprofits, small businesses and government agencies.\nSMN: What would you do differently as an alderman?\nMCKEITHEN: I have skills and have been a community developer and community organizer for so long, the first things I want to do is unify the fifth district. Every neighborhood needs a neighborhood association for one thing. And your neighborhood association presidents need to sit at the table with you when you’re making decisions that will impact the fifth district. We need to have a strategic plan in place. How can you see where you are going if you have no map?\nSMN: How do you plan to address poverty?\nMCKEITHEN: First of all, if the city pays a living wage to all its city workers, we could reduce poverty by mandating that all businesses that do business with the city do the same.\nWe’ve had Step-Up Savannah. We’ve been funding them for 10 whole years, and that was supposed to be our big poverty reduction program. Well, poverty has not been decreased. And we need to find out what we are actually paying for.\nSMN: You have talked about the need to start a grant department?\nMCKEITHEN: We need that type of office. Not only could they help the nonprofits, but they could help us with getting department of transportation money to fix some of these awful streets. We could get department of justice money with everything being in one centralized place.\nSMN: What do you think of the council’s plan to purchase the fairgrounds?\nMCKEITHEN: I’m very concerned. The city of Savannah, especially the people that have been there for more than one term, have not had a good track record in making smart purchases for the city. The things they do never really benefit the people it should benefit.\nSMN: Do you believe there is a need for more affordable housing in the city?\nMCKEITHEN: I believe we should have the landlords we already have improve their residences and make it affordable in the area, but I don’t believe we should knock down a whole infrastructure of a place to put in more Section 8 housing.\nMany of the structures in the areas where you do see dilapidated housing could have been saved or rehabbed easily if the owners had the funding to upkeep.\nSMN: What are your thoughts on short-term vacation rentals? That’s been an issue in the fifth district.\nMCKEITHEN: I think that if it’s allowed downtown, it should be allowed.\nSMN: Even in residential areas?\nMCKEITHEN: Yeah, in residential areas. It would probably help with a lot of these structures that are sitting dormant. Maybe that would incentivize landlords that don’t particularly live in Savannah to do something with their structures.\nSMN: What do you think the $1.5 million in SPLOST dollars each district is getting for neighborhood projects should go toward?\nMCKEITHEN: We need a lot of street maintenance in this area. There are dangerous places in the Bradley Pointe area. We need to find some dollars to get lights up there. I mean there are accidents all the time. We have a whole section out there beyond Hunter Army Airfield; none of those kids have community centers.\nSMN: Do you support the city manager’s proposal to use $100,000 of the funds from that $1.5 million for the cultural arts center?\nMCKEITHEN: No.\nSMN: What do you think about the cultural arts center plan?\nMCKEITHEN: I think it’s a figment of our imagination. I think that it was poorly planned. I don’t think it is going to bring living wage jobs to Savannah.\nSMN: What other priorities do you have?\nMCKEITHEN: To have a fifth district business association that meets, and we discuss issues and create a plan to draw more businesses into the district.\nESTELLA SHABAZZ-INCUMBENT\nBIO: Born in Savannah, Shabazz is a graduate of Savannah State College with a bachelor’s degree in civil engineering. She received a master’s in divinity from Turner Theological Seminary in Atlanta and a doctorate in ministry from United Theological Seminary in Dayton, Ohio.\nShe founded the New Afrikan Methodist Christian Church and is its chief bishop. After being elected in 2011, she is serving her first term on the Savannah City Council.\nSMN: Why did you support the purchase of the fairgrounds?\nSHABAZZ: I am supporting it because it gives the city of Savannah control of the land. The residents that live around that property questioned me when it was up for sale — why won’t the city purchase the property? I knew the concern was there with the neighborhood associations. Also, because it will provide affordable housing and great space for family and recreational usage.\nSMN: What are some of your priorities for the next four years?\nSHABAZZ: I will continue to listen to residents about their needs and desires and give them voice for fair resolutions. Advance issues that will improve conditions, neighborhood blight and public safety.\nSMN: Would you like to address the poverty rates your opponent has raised?\nSHABAZZ: From the U.S. Census Bureau 2009-2013 five year American Community Survey, the population below poverty level in the fifth district is 19.3 percent. In reference to Step Up Savannah 2015 annual report, 26 percent of Savannahians live in poverty. So these are the numbers.\nSMN: Do you believe that’s an acceptable number?\nSHABAZZ: Poverty is something we must continue to lower. We can continue to work with our agencies such as Step Up Savannah in supporting them as they support our citizens.\nAlso, in working with the summer youth work experience program, which provides supervised summer work experience for the youth ages 14 through 24 from June through August. There is also the youth build program for young men and women ages 16 through 24 who have not yet completed high school and spend nine months participating in GED instruction, construction training, leadership training.\nThis is part of how we reduce poverty.\nSMN: Why have you opposed short-term vacation rentals in your district?\nSHABAZZ: We have a problem with rooming houses in the fifth. It is against the law. You’ve got to abide by the law when you do housing of that nature, but in the district it’s been our problem in illegal boarding houses. That is our concern over here.\nSMN: Do you think the city has taken adequate steps to address the vacancies in the police department, or does more need to be done?\nSHABAZZ: The police chief with the recruitment efforts is a good thing. The building of the $3.9 million police department development center in the fifth district is a plus for our police department. As the recruits come in to be hired, they will have 21st Century training so they can adequately give adequate public safety.\nSMN: Are you satisfied with how the city’s program to encourage women- and minority-owned businesses is working out?\nSHABAZZ: I am an advocate for minority, women enterprises. That is one of my many accomplishments in my first term that I can state I advocate for MWBEs. The city manager continues to better those efforts.\nSMN: How do you plan to use the $1.5 million in SPLOST funds that each district gets that is supposed to go toward neighborhood projects?\nSHABAZZ: Sidewalk installations. Passive parks and playgrounds. Those are some of the things.\nSMN: Do you support the city manager’s recommendation to use $100,000 of those funds to help fund the cultural arts center?\nSHABAZZ: The residents have questions about that $100,000 being taken out of that $1.5 million. So I am a voice of the people and what the people say is what I will do.\nSMN: What do you consider some of your accomplishments?\nSHABAZZ: Hiring of city manager and police chief. Built two fire stations and police development center in the district. Purchased the fairgrounds property. Summer Youth Work experience program. Strengthened city efforts to support MWBEs. Helped re-establish neighborhood associations.\nALDERMAN AT-LARGE POST 1\nCAROL BELL-\nINCUMBENT\nBIO: Bell has lived in Savannah for 40 years. She has a bachelor’s degree in mathematics from Shaw University and a master’s in public administration from the University of Georgia. She completed post-graduate studies at the Harvard Kennedy School of Government.\nShe retired from the city of Savannah after 38 years of service and is serving her first term as a Savannah alderman.\nSMN: How has it differed being a council member as opposed to being a city employee?\nBELL: I felt somebody had to stand up and do something about turmoil in city government, and I felt like I was in a position to do it because I was retiring. And I naively thought that because I had spent 38 years in local government those skill sets would transcend to (city council.)\nWhen I worked as an employee on the administrative side, if I had a task assigned to me, as long as I had the resources, we could go forward.\nThat was what I was accustomed to doing, getting a job to do and delivering on it. On the political side, I’ve learned pretty quickly, and it was really a shocking revelation, it doesn’t matter how good your idea is, if you can’t count to five it’s for nought. It doesn’t make any difference.\nI’ve also found you have to learn to compromise, build coalitions, all the things seasoned politicians know, but it was a revelation.\nSMN: What ideas were you unable to get support for?\nBELL: Let’s just say that some of my colleagues were already committed to initiatives before I got on council.\nUnlike zero-based budgeting, each new administration doesn’t wipe the slate clean and start from scratch. It’s sometimes hard to change people’s minds in mid-stream. I won’t cite specific projects. I will just say that was part of the learning process. The great takeaway for me has been to start early.\nI think I have been able to form some relationships with my colleagues. I would like to think they know what some of my strong suits are, and I know what some of their passions are so that helps in terms of moving forward.\nSMN: So what are your priorities you would like to move forward?\nBELL: I am just appalled by the crime problem. The difficulty about the crisis we are facing, for the most part, it’s person-against-person crimes. These are not random types of incidents, which makes it extremely difficult to tackle. And I would like to see the council as well as the community become more involved in addressing some of the root causes.\nI think it’s important for us to collaborate with the board of education and address the kids.\nSMN: How are you going to collaborate with the school board?\nBELL: In a more centralized fashion, I would like to develop a community-wide mentoring program for our youth. I would also like to see us expand what was attempted this summer, our summer youth job program. I think it was a start. I certainly think we have a ways to go.\nSMN: Some have been critical that you took too long fill police officer vacancies.\nBELL: It’s been an ongoing problem in this city since before the merger. It’s a problem. I think we all have responsibility for the state of crime in this city. I’m not running from it. We should have acted quicker, but we have taken steps to address the problem. We’ve committed to giving the police the proper support that they need by way of resources.\nSMN: Is there anything else you want to bring up that I haven’t asked you about?\nBELL: I would like to see the city develop relationships with, not just Savannah Tech, but with the local unions. They do some very structured training. So we might be able to partner with them and try to make sure we are training workers for the workforce.\nI think we’re missing a major resource by not using the unions here. And they volunteered to enter into some relationships like that.\nLINDA WILDER-BRYAN\nBIO: Wilder-Bryan is a 49-year Savannah resident who has a bachelor’s degree in political science/criminal justice from Morris Brown University. She works as an environmental health and safety coordinator for Interfor US Inc., and has work experience with the Georgia Department of Corrections and Chatham County Sheriff’s Department.\nSMN: Do you want to talk about why you decided to run?\nWILDER-BRYAN: Right now we have two factions in this city. There are no in-betweens. We have the wealthy and the poor. I understand the root cause is poverty. That works hand-in-hand with crime.\nSMN: How would you reduce poverty?\nWILDER-BRYAN: With maritime trade being part of the most productive city in our state, the inner city youth have not been introduced to the science, technology, engineering and mathematics program. We need training so when jobs do become available, they’re ready.\nSMN: What would you do differently than the incumbent?\nWILDER-BRYAN: I’m really wanting to do something that stands out. They have these neighborhood association meetings. And I’ve been following them because I want people to vote for me. They don’t even know who she is.\nSMN: What do you think about the actions the council took to fill the police vacancies?\nWILDER-BRYAN: Well, guess what? They had $3 million to boost that along. (For purchase of Coastal Empire Fairgrounds).\nSMN: You think they should have raised them more?\nWILDER-BRYAN: Yes I do. They need to recruit, retain and try to get the best of the best.\nI’m wanting to make sure the police officers get a higher pay grade. That we recruit officers that are already trained.\nI believe when they hire these new officers they should have mandatory sensitivity and diversity training. You have to know how to speak to people. You can’t make assumptions. I know if a threat is there then you have to protect yourself, but just because you see somebody with some saggy pants and a white shirt, how do you automatically say that’s a threat?\nSMN: Do you think the city should be making any other type of investments in the community besides police?\nWILDER-BRYAN: I think they should be investing in our children. In their education.\nSMN: Are you familiar with the summer job training program for youth the city did this summer?\nWILDER-BRYAN: I’m not familiar with that program, but I am familiar with the Joint Partnership Training Act, and when I first came back from Savannah and so I’ve worked in agencies that offered tax breaks. It was a joint program with (Economic Opportunity Authority) and the Department of Labor.\nWhy can’t we do that now? On a larger scale. Why can’t the city say, ‘we are going to partner with the schools and we’re going to save some people? We need to catch somebody. We’re not catching anybody.\nSMN: What are some investments you would like to see happen?\nWILDER-BRYAN: I do environmental health and safety. We have a lot of plants that are emitting a lot of toxic stuff. They need to do studies about that. That could be the cause of why our children our acting the way they are acting.\nOne of the main causes of children staying at home is because of asthma, but they don’t have an emissions testing program in this city.\nI’d like to see a project where the labor gets a tax credit. The school system gets a return on children who are wanting to succeed. I don’t think education and the city should be separated. I think they should be a joint effort to make our children marketable.\nAnd I do believe in affordable living, but what about these houses that are condemned? Why don’t we train people to fix those houses up right now and put families in them.\nThree million (for the fairground purchase.) Do you know how many houses they could have bought that are already here? You’re giving people an opportunity to have ownership. You’re invested in a community.\nEARLY VOTING BEGINS MONDAY\nEarly in-person voting for the Nov. 3 election begins Monday, Oct. 12 and runs through Oct. 30.\nAny eligible registered voter desiring to early vote during this period may do so at the Voter Registration Main Office, 1117 Eisenhower Dr, Suite E., 8 a.m. to 5 p.m. Monday through Friday.\nWeekend voting will be available at the registration office from 10 a.m. to 2 p.m. on Saturday, Oct. 24, and from 1-5 p.m. on Sunday, Oct. 25.\nAdvance voting will be available Oct. 26-30 at the following additional locations:\n• Voter registration office: 8 a.m. to 5 p.m. (Monday, Wednesday, Friday)\n• Voter registration office: 8 a.m. to 7 p.m.(Tuesday, Thursday)\n• Civic Center: 9 a.m. to 4 p.m. (Monday through Friday)\n• Southwest Library (by Savannah Mall), 14097 Abercorn St.: 10 a.m to 5 p.m. (Tuesday through Friday)\n• Mosquito Control, 65 Billy B. Hair Drive: 9 a.m. to 4 p.m. (Monday through Friday)\nMunicipalities having an election:\n• Garden City\n• Savannah\n• Pooler\n• Tybee Island\n• Port Wentworth\nThe Savannah Morning News and GPB Savannah will host a full day of candidate forums for the upcoming mayoral and alderman posts on Monday, Oct. 12, in the Savannah Morning News auditorium at 1375 Chatham Parkway.\nThe day will consist of six one-hour forums moderated by Bill Kelso, vice president for advancement at Armstrong State University.\nThis is not a debate. The forums will give candidates the opportunity to communicate their plans to address the issues in our community.\nCandidates will make brief opening remarks and then a panel of journalists from the Savannah Morning News, GPB Savannah and The Savannah Tribune will ask questions.\nThe forums are open to the public, but no campaign literature or paraphernalia such as signs and buttons will be allowed at the event.\nPeople wearing clothing or carrying signs in support of any candidate will be asked to leave.\nThe schedule is as follows:\n• Districts 1 and 2, 9 a.m.\n• Districts 5 and 6, 10:30 a.m.\n• Districts 3 and 4, 2 p.m.\n• At-Large 1, 3:30 p.m.\n• At-Large 2, 6 p.m.\n• Mayor, 7:30 p.m.", "external_links": ["http://sav-cdn.com/sites/all/themes/whitelabel/images/blank.gif", "http://sav-cdn.com/sites/default/files/imagecache/superphoto/14800480.jpg", "http://sav-cdn.com/sites/default/files/imagecache/superphoto/14800482.jpg", "http://sav-cdn.com/sites/default/files/imagecache/story_slideshow_thumb/14800482.jpg", "http://sav-cdn.com/sites/default/files/imagecache/story_slideshow_thumb/14800480.jpg", "http://sav-cdn.com/sites/default/files/imagecache/story_slideshow_thumb/14800483.jpg", "http://sav-cdn.com/sites/default/files/imagecache/superphoto/14800481.jpg", "http://sav-cdn.com/sites/default/files/imagecache/story_slideshow_thumb/14800481.jpg", "http://sav-cdn.com/sites/default/files/imagecache/superphoto/14800483.jpg", "http://sav-cdn.com/sites/all/themes/savannahnow/images/blank.gif"], "published": "2015-10-10T18:59:00.000+03:00", "crawled": "2015-10-11T12:16:18.244+03:00", "highlightTitle": ""}