{"organizations": [], "uuid": "8ea4d65b49a253b32a0951527528328e60721a1d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wiltshiretimes.co.uk", "main_image": "http://www.wiltshiretimes.co.uk/resources/images/4310391/", "site_section": "http://www.wiltshiretimes.co.uk/leisure/showbiz/rss/", "section_title": "Wiltshire Times | National Entertainment News", "url": "http://www.wiltshiretimes.co.uk/leisure/showbiz/13839134.Strictly_Come_Dancing_2015__Peter_Andre_slams_vanity_claims_as_he_prepares_pirate_themed_Paso_Doble/?ref=rss", "country": "GB", "title": "Strictly Come Dancing 2015: Peter Andre slams vanity claims as he prepares pirate-themed Paso Doble", "performance_score": 0, "site": "wiltshiretimes.co.uk", "participants_count": 0, "title_full": "Strictly Come Dancing 2015: Peter Andre slams vanity claims as he prepares pirate-themed Paso Doble", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T12:08:00.000+03:00", "replies_count": 0, "uuid": "8ea4d65b49a253b32a0951527528328e60721a1d"}, "author": "", "url": "http://www.wiltshiretimes.co.uk/leisure/showbiz/13839134.Strictly_Come_Dancing_2015__Peter_Andre_slams_vanity_claims_as_he_prepares_pirate_themed_Paso_Doble/?ref=rss", "ord_in_thread": 0, "title": "Strictly Come Dancing 2015: Peter Andre slams vanity claims as he prepares pirate-themed Paso Doble", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Peter Andre"], "text": "Strictly Come Dancing 2015: Peter Andre slams vanity claims as he prepares pirate-themed Paso Doble Strictly Come Dancing 2015: Peter Andre slams vanity claims as he prepares pirate-themed Paso Doble Share \nStrictly Come Dancing’s Peter Andre has spoken out about reports claiming he is “vain”. \nPeter, who after two shows is the bookies’ favourite to win, says there is no truth to the gossip at all. \nHe told the Press Association: “The funny thing was, when that first came out, we all laughed, and someone said to me ‘Well, aren’t you going to say something? I said no, why would I say something? \n“As if anyone would believe it. But then I thought people might believe it, and I thought, oh, maybe I should say something.” (BBC) \nHe also revealed, contrary to reports, he is actually the last celebrity to get their make-up done on the show. \n“I’m always the last to go in the make-up room, so I’m usually the one backstage hanging around with everyone, telling bad jokes… I hang out with the wardrobe guys, the crew, everybody and it’s just a really lovely vibe. \n“It couldn’t have been further from the truth.” \nA Strictly insider said: “Peter is so lovely and fun backstage – he gets involved and loves hanging out with all the team, finding out more about what they do to put on the big show.” Promoted stories (BBC) \nHe topped the Strictly Come Dancing leaderboard last week thanks to his lively Quickstep with partner Janette Manrara. \nThe 42-year-old pop star and TV personality impressed with his routine to Valerie, made famous by Amy Winehouse. \nTalking about being the bookies’ favourite, he said: “I’m very, very grateful but I’m under no illusion that that could change at any minute. I’m the first person to say ‘I’m not a technical dancer, I’ve never been to dance school, I’m self-taught’. \n“I used to watch videos of people like Michael Jackson and Prince, and I used to go on stage and do stuff, but I was never very good on anything technical. So to be able to get as far as I’ve got, I’m so happy.” \nThis week’s theme is Movie Week and he will be performing one of the series’ first two Paso Dobles as he combines the fierce character of the matador with the devilish air of Johnny Depp. (Ray Burmiston/BBC) \nHe and Janette will be dancing to He’s A Pirate from Pirates Of The Caribbean. \nSo far Latin is his favourite dance style and Andre said he cannot wait to do the Paso. \n“If I could nail it like we’ve been doing in rehearsals, I’m going to be very happy,” he said. “Because from the second Janette showed me the routine, I was like ‘I love this’. \n“Last week when she showed me the Quickstep, I was freaking out. Even on the day of the show last week, I said I just don’t know if I can get this right. Share article \n“This week, I feel more comfortable earlier on so I’m really happy.” Promoted Stories", "external_links": [], "published": "2015-10-10T12:08:00.000+03:00", "crawled": "2015-10-10T16:16:37.367+03:00", "highlightTitle": ""}