{"organizations": [], "uuid": "d1ea0ba2da1b9984a65ccfaee4961b3142b391b8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.maxim.com", "main_image": "", "site_section": "http://www.maxim.com/entertainment", "section_title": "Entertainment | Maxim", "url": "http://www.maxim.com/entertainment/article/sexy-ronald-mcdonald-homer-simpson-mutants-and-more-weird-art-wizard-skull-2015-10", "country": "US", "title": "Sexy Ronald McDonald, Simpsons Mutants, and More Weird Street Art From Wizard Skull", "performance_score": 0, "site": "maxim.com", "participants_count": 1, "title_full": "Sexy Ronald McDonald, Simpsons Mutants, and More Weird Street Art From Wizard Skull | Maxim", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "d1ea0ba2da1b9984a65ccfaee4961b3142b391b8"}, "author": "Chris Wilson", "url": "http://www.maxim.com/entertainment/article/sexy-ronald-mcdonald-homer-simpson-mutants-and-more-weird-art-wizard-skull-2015-10", "ord_in_thread": 0, "title": "Sexy Ronald McDonald, Simpsons Mutants, and More Weird Street Art From Wizard Skull", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Brooklyn-based street artist Wizard Skull has built a cult following on Instagram with his wildly irreverent and deeply strange riffs on pop culture characters, ranging from his signature \"Sexy Ronald\" series to Simpsons -inspired mutants and rappers holding cats. Here, the oddball artist holds forth on his unique inspiration, copycats, and putting creative fulfillment over cash.\nHow long have you been making art as Wizard Skull ?\nFor about 10 years, and I've been drawing and painting longer than that. I worked as graphic designer full time for the last five years, but was recently laid off when the company got sold. Right now I have a part-time job at a museum, and am always doing a lot of odd jobs. I make art for myself and want to keep it that way. If people like it or I can make money off it, that's great.\nYou’ve become something of an Instagram sensation with absurd riffs on pop culture characters, ranging from “Sexy” Ronald McDonald series to stuff like Chief Wiggum from The Simpsons snuggling with rapper Rick Ross . How would you describe your work overall?\nI enjoy making fun images playing with pop culture imagery, sometimes playing with social norms, gender and masculinity in my work. I refused to get a smart phone for a long time, but everyone kept telling me I had to get on Instagram to promote my art. When I finally did get on Instagram, I already had a ton of images tagged by other people on there of my zines, street art, and stickers.\nYou’ve also drawn Rick Ross, Tupac, Biggie and even Coolio holding cats. What’s that all about?\nI've made zines for 15 years, maybe longer. I started making zines because I didn't know how to get an art show and I wanted to share my work with others. One zine I made was called \"Pussy\", and the concept behind it was that no other genre of music has so many lyrics about pussy as rap does. So I drew all these rappers holding cats. I did that one around 2011, but recently its gotten a lot more attention with the images getting onto Instagram and being shared.\nYou’ve called out people who have ripped off your work on Instagram. What gets ripped off most?\nRight now the Sexy Ronald character gets ripped off the most, I think just because that image has gone viral so many times without any link or logo for people to see who created it. There's been days where I'll see a band using one of my images for their flyers, multiple accounts posting drawings that are almost direct traces of mine, people postings stickers for sale of my images etc..when that happens I'm like, \"Damn, all these people using my art!\" It would be cool if they let me know and at least credited the art as done by me. I don't have the time or energy to explain to everyone the difference between me doing a parody drawing of Ronald McDonald, and how that is different than someone copying my extra drawing or concept and using it for their own.\nI know you’re working on some animation stuff that mashes up cartoon characters from He-Man to The Smurfs . Did you grow up watching classic 1980s-era cartoons?\nYeah, I watched the TV shows of the animation cels I've done. It's really cool—and kind of bizarre—to be able to hold and own a piece of art that was used to create a show I watched as a kid. When I was younger I wanted to draw cartoons but that job just doesn't exist anymore. I like getting animation cels and playing with the expression of the character and reinterpreting the image to give it new meaning.\nYour mutant series in particular has a lot of imagery from The Simpsons — \"Sexy Yellow Beast” blends Bart, SpongeBob Squarepants, Big Bird and Tweety Bird, you have another one of Homer eating himself as a donut. What do you love about The Simpsons so much?\nWell I like to play with the characters of pop culture, and The Simpsons have been on for TV for so long that a lot of people can relate to that.\nFair enough. You've also designed skateboard decks featuring the likes of Hannibal Lecter, Freddy Krueger, and Chucky. Did you grow up skating?\nI grew up skateboarding. I use to be sponsored and go on tours and film skateboarding videos and shoot photos all the time. Skateboarding was the most important thing to me. I started doing graphics for Consolidated Skateboards in 2007. At the time they were the only ones into using funny drawings as board graphics. When I realized I could get free boards for drawing funny things I got really into it.\nWhat can Wizard Skull fans expect to see from you in the near future?\nThere's lots of things I'd like to do. If I could get my hands on some original Disney Fantasia animation cels that would be great. I'd also like to make some life-size fiberglass sculptures, but those are kind of expensive, and maybe that's much further down the road. For now, I'm looking forward to some collaborations with other artists where we take some of my drawings and create toys from them. I also have started to storyboard a cartoon based on some of the characters I draw, which I'd like to animate.\nIs there anything else you’d like to say?\nI'm doing well with my art now, but it's only been the last few years that I've made money from it. If you want to be good at something you need to put time into it, a lot of time, Picasso made over 50,000 works of art, Warhol made over 20,000! Success is really subjective. Money comes and goes. One day you might look around and the people who were important to you are dead and gone and you'll be alone with your money, what are you going to do then? If you have a hobby you enjoy doing, don't let yourself get frustrated that you can't make a living off it. Whatever you enjoy doing, let the value of that be determined by yourself, and not by whether others like it, or are willing to spend money on it.", "external_links": ["http://www.animatedreview.com/2015/05/wizard-skull-sexy-yellow-beast.html", "https://en.wikipedia.org/wiki/Cel", "http://wizardskull.com/", "http://www.wizardskull.com/skateboards.html", "http://consolidated-skateboards.myshopify.com/", "http://www.imdb.com/title/tt0032455", "https://instagram.com/p/8eg5HwrwlB/?taken-by=wizardskull", "https://instagram.com/wizardskull/?hl=en"], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-09T06:10:32.079+03:00", "highlightTitle": ""}