{"organizations": [], "uuid": "33f1bc219a56e5ce86e4ec4b543710af54256c0a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mid-day.com", "main_image": "http://images.mid-day.com/images/2015/oct/12mandana-l.jpg", "site_section": "http://www.mid-day.com/Resources/midday/rss/entertainment.xml#", "section_title": "entertainment", "url": "http://www.mid-day.com/articles/mandana-karimi-is-not-looking-for-film-offers-through-bigg-boss9/16602216", "country": "IN", "title": "Mandana Karimi is not looking for film offers through 'Bigg Boss 9'", "performance_score": 0, "site": "mid-day.com", "participants_count": 1, "title_full": "Mandana Karimi is not looking for film offers through 'Bigg Boss 9' - Entertainment", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "33f1bc219a56e5ce86e4ec4b543710af54256c0a"}, "author": "PTI", "url": "http://www.mid-day.com/articles/mandana-karimi-is-not-looking-for-film-offers-through-bigg-boss9/16602216", "ord_in_thread": 0, "title": "Mandana Karimi is not looking for film offers through 'Bigg Boss 9'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Iranian girl Mandana Karimi, the foreign factor in \"Bigg Boss 9\", says she is not looking for a career push through the reality show.\nKarimi, who made her Bollywood debut with \"Bhaag Johnny\" this year, said she has her kitty full with interesting projects and her sole motive to be a part of the Salman Khan-hosted show is to connect with the Indian audience.\n\nMandana Karimi. Picture courtesy: Bigg Boss Twitter account @BiggBoss \n\"I don't want a push to my career. I don't crave for visibility and I am not looking for job offers. I have good films, which include Ekta Kapoor's 'Kya Kool Hain Hum 3'. My only reason to join this show was to connect with my fans,\" Mandana told PTI.\n\"People in India love 'Bigg Boss' and I will get an opportunity to show myself to the people,\" said the actress, whose father is an Indian.\nThe Tehran-born model-actress said she never had apprehensions about being a part of \"Bigg Boss\" and is grateful to have been approached for it.\n\"It is a great show. It is the biggest show. And also it is being hosted by one of the most loved celebrities in India, Salman Khan. I am really grateful.\" This season of \"Bigg Boss\" has many TV celebrities like Roopal Tyagi, Ankit Gera, Kishwar Merchant, Aman Verma and Prince, who are already household names.\nWhen asked if being a newcomer is a disadvantage for her, Mandana said, \"I don't think TV people have an advantage. I think perception about you changes every single day when you participate in 'Bigg Boss'. There is no disadvantage for me. I want to be loved by people in India.\"\nThe actress said the audience will find her accent entertaining and hopefully that will keep her safe on the show.\n\"I think the audience will be entertained by my accent as they will find it very funny. Also my fitness routine is something, which I think they will find interesting,\" she said.\n\"Bigg Boss 9\" airs on Colors everyday at 10:30 pm.", "external_links": [], "published": "2015-10-12T03:00:00.000+03:00", "crawled": "2015-10-13T01:41:55.207+03:00", "highlightTitle": ""}