{"organizations": [], "uuid": "de5f0ee302b8f507f1ccfac2f2d7cddc5ba2c7de", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wiltshiretimes.co.uk", "main_image": "http://www.wiltshiretimes.co.uk/resources/images/4314733/", "site_section": "http://www.wiltshiretimes.co.uk/leisure/showbiz/rss/", "section_title": "Wiltshire Times | National Entertainment News", "url": "http://www.wiltshiretimes.co.uk/leisure/showbiz/13841811.Retro_role_leaves_Saoirse_Ronan_enjoying__womanly__fashions/?ref=rss", "country": "GB", "title": "Retro role leaves Saoirse Ronan enjoying 'womanly' fashions", "performance_score": 0, "site": "wiltshiretimes.co.uk", "participants_count": 0, "title_full": "Retro role leaves Saoirse Ronan enjoying 'womanly' fashions", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T17:01:00.000+03:00", "replies_count": 0, "uuid": "de5f0ee302b8f507f1ccfac2f2d7cddc5ba2c7de"}, "author": "", "url": "http://www.wiltshiretimes.co.uk/leisure/showbiz/13841811.Retro_role_leaves_Saoirse_Ronan_enjoying__womanly__fashions/?ref=rss", "ord_in_thread": 0, "title": "Retro role leaves Saoirse Ronan enjoying 'womanly' fashions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Saoirse Ronan"], "text": "Retro role leaves Saoirse Ronan enjoying 'womanly' fashions Retro role leaves Saoirse Ronan enjoying 'womanly' fashions \nPress Association 2014 / / National Entertainment News Share \nSaoirse Ronan enjoyed starring in 50s period film Brooklyn – because it was an era when women were allowed to have a figure. \nIn the film, the actress plays Eilis Lacey, a 20-something Irish migrant to New York. \nShe said: “The 50s outfits were so womanly, and it encouraged women – as opposed to now, it encouraged women to have the curves and a bum and boobs and all that stuff. \n“Girls are so strongly encouraged to be almost waif-like now, and not have any shape at all.” \nStruggling to find work in her home town in Ireland, Eilis moves to New York – leaving behind her beloved sister and mother to join the Big Apple’s Irish community. \nAlthough she initially battles intense homesickness, with the help of her landlady (Julie Walters) and Father Flood (Jim Broadbent) she starts to settle in – especially after meeting Italian Tony Fiorello (Emory Cohen). \nBut when she has to return home for a family emergency, Eilis must choose between Tony back in New York – or her life back in Ireland, where she meets Jim Farrell (Domhnall Gleeson). \nIrish-American Ronan, 21, said this resonated with her – because she herself had just moved out. The actress, who first rose to prominence in 2007′s Atonement, was born in New York but moved back to Ireland with her family when she was three years old. At the time of filming she had just moved to London – and now plans a move to New York. Promoted stories Saoirse Ronan stars in Brooklyn (Amy Sussman/Invision) \nAhead of the European premiere in London’s Leicester Square, she explained: “I really do feel the weight that you experience, the heaviness that you experience when you’re homesick. I’m leaving home for the first time, and haven’t quite settled anywhere, and you’re sort of floating between these two different places, and you can’t quite go back to where you’re from – but you’re not quite settled in this place that you’re moving towards either. \n“There is definitely that sense of loss and vulnerability, and you don’t really know when that’s going to be lifted.” \nShe added: “Ireland offers me what it offers Eilis: that sense of home, and childhood and security, that no where else will ever offer me. But New York is very much the place I want to be when I’m young.” \nDirected by John Crowley, the film is Nick Hornby’s adaptation of the award-winning novel by Irish author Colm Toibin. Saoirse Ronan with John Crowley and Nick Hornby (Joel Ryan/Invision) \nOn adapting the novel, Hornby said: “It’s very frightening because the book is so loved and so special to its readers, and so of course there’s a tension: are we going to mess this up? But Colm was so incredibly generous and hands-off in a way that was so wise, I think… We met once and Colm told me that I shouldn’t say ‘rashers of bacon’, I should just say rashers; ‘mammy’ not ‘mummy’; and that was pretty much it as far as consultation went. We still seem to be friends.” Share article \nBrooklyn has its European premiere at the BFI London Film Festival on October 12 and will be released in UK cinemas in November. Promoted Stories", "external_links": [], "published": "2015-10-12T17:01:00.000+03:00", "crawled": "2015-10-12T17:45:24.351+03:00", "highlightTitle": ""}