{"organizations": [], "uuid": "d3c3afebf1eeb11b5b280832a56a1f402fb4c6fc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wiltshiretimes.co.uk", "main_image": "http://www.wiltshiretimes.co.uk/resources/images/4319364/", "site_section": "http://www.wiltshiretimes.co.uk/leisure/showbiz/rss/", "section_title": "Wiltshire Times | National Entertainment News", "url": "http://www.wiltshiretimes.co.uk/leisure/showbiz/13844909.Here_s_how_Booker_winner_A_Brief_History_Of_Seven_Killings_split_the_critics/?ref=rss", "country": "GB", "title": "Here's how Booker winner A Brief History Of Seven Killings split the critics", "performance_score": 0, "site": "wiltshiretimes.co.uk", "participants_count": 0, "title_full": "Here's how Booker winner A Brief History Of Seven Killings split the critics", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T01:07:00.000+03:00", "replies_count": 0, "uuid": "d3c3afebf1eeb11b5b280832a56a1f402fb4c6fc"}, "author": "", "url": "http://www.wiltshiretimes.co.uk/leisure/showbiz/13844909.Here_s_how_Booker_winner_A_Brief_History_Of_Seven_Killings_split_the_critics/?ref=rss", "ord_in_thread": 0, "title": "Here's how Booker winner A Brief History Of Seven Killings split the critics", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Booker"], "text": "Here's how Booker winner A Brief History Of Seven Killings split the critics Here's how Booker winner A Brief History Of Seven Killings split the critics \nPress Association 2014 / / National Entertainment News Share \nRunning at 700 pages, and with large sections written in Jamaican patois, A Brief History Of Seven Killings – the re-telling of the attempted assassination of Bob Marley, referred to in the book as The Singer – was always going to be a struggle for some readers. \nIts author Marlon James was the first Jamaican-born writer to be short-listed for the Booker Prize, although the novel was immediately installed as one of the also-rans by several bookmakers. \nThat it was a divisive offering was reflected by some of the reviews. Here is a sample of what the critics said at the time of the book’s release… (Four Colman Getty/PA) Telegraph \n“His (James’s) decision to fictionalise the names of people and places is probably a mistake … It is odd, too, that while James renames everything, he nevertheless follows the facts quite faithfully. As a result, the novel is less politically charged than it might have been … A vivid novel that deserves all the praise it has already received.” Guardian \n“A Brief History, however, is sometimes more impressive than it is easily enjoyable – a difficult book with a stop-start structure that doesn’t quite sweep you up in the way the single narrative voices of the previous novels did.” Promoted stories Independent \n“This is a book the energy, intelligence and intellectual range of which demands and rewards attention … It showcases the extraordinary capabilities of a writer whose importance can scarcely be questioned, even if his mode of address will exclude some.” (Frank Augstein/AP) Huffington Post \n“Epic, immersive, acutely observed and deeply moving, it’s worth every long hour it demands of the reader.” New Statesman \n“Though brilliant as a literary accomplishment, James’s work is frequently hard going in reading terms, given the outsized stew of players and motives and the hyped-up prose that conveys it all. At times he risks coming across as overly indulgent of his penchant for maximalist effects. But, in giving us the fullest sense of this world, it proves to be a risk worth running.” Share article New York Times \n“Spoof, nightmare, blood bath, poem, A Brief History Of Seven Killings eventually takes on a mesmerising power. It makes its own kind of music, not like Marley’s, but like the tumult he couldn’t stop.” Promoted Stories", "external_links": [], "published": "2015-10-14T01:07:00.000+03:00", "crawled": "2015-10-14T02:48:05.515+03:00", "highlightTitle": ""}