{"organizations": [], "uuid": "3dd2b2d46f0fb1ad561314915f5a984d15bf9591", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.yahoo.com", "main_image": "http://l1.yimg.com/bt/api/res/1.2/bWRMJwd7GhLUdTOkrGU4IQ--/YXBwaWQ9eW5ld3NfbGVnbztpbD1wbGFuZTtxPTc1O3c9NjAw/http://media.zenfs.com/en_us/News/ap_webfeeds/714e7b4f8680022e850f6a706700ece4.jpg", "site_section": "http://news.yahoo.com/rss/entertainment", "section_title": "Entertainment News Headlines — Yahoo! News", "url": "http://news.yahoo.com/york-city-police-recruits-watch-play-training-190822973.html", "country": "US", "title": "New York City police recruits to watch a play for training", "performance_score": 0, "site": "yahoo.com", "participants_count": 1, "title_full": "New York City police recruits to watch a play for training - Yahoo News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T03:00:00.000+03:00", "replies_count": 0, "uuid": "3dd2b2d46f0fb1ad561314915f5a984d15bf9591"}, "author": "MARK KENNEDY", "url": "http://news.yahoo.com/york-city-police-recruits-watch-play-training-190822973.html", "ord_in_thread": 0, "title": "New York City police recruits to watch a play for training", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (AP) — The New York City Police Department is turning to a new tool in its effort to teach its future officers about tolerance and understanding — drama.\nThe city's Police Academy has added the one-act play \"Anne & Emmett\" by Janet Langhart Cohen to its recruit training this fall. The play is an imaginary conversation between Anne Frank, who died in a Nazi concentration camp, and Emmett Till, who was killed by racists in Mississippi in 1955.\nThe play will be performed for some 1,100 recruits at their academy in Queens over two performances on Thursday, part of a push by the department to prepare future police officers to overcome community mistrust and their own bias.\n\"Sometimes you can't get it in a text book. Sometimes you can't get it in a lecture. But you can get it when human emotions are played live on the stage and that humanity can connect,\" Cohen said Friday.\n\"If the play can reach one man or woman with a badge and a gun, I'm happy. Their training can take them only so far. The body cams will only cover so much. At some point, I'm hoping their humanity will kick in and hopefully this play with revive that humanity.\"\nIt was Commissioner William J. Bratton who, after seeing a production downtown, asked to take it to the recruits. In a statement, he called the play \"a poignant and thoughtful production that explores the respective histories and common experiences of two people cruelly victimized by racial and religious prejudice.\"\nView gallery FILE - In this Dec. 29, 2014 file photo, NYPD police commissioner Bill Bratton stands on stage durin … Since Bratton took office in 2014, he has sought to change how the department interacts with the communities it serves, following years of rising mistrust and a stop-and-frisk policy that was found to have targeted minorities. But the death last year of Eric Garner, an unarmed black man, helped fuel a national public outcry over how communities of color are treated by police.\nIn the play, the two teens meet and find similarities between their harrowing experiences. Cohen, a former journalist who grew up in segregated housing in Indianapolis and is the wife of the former Secretary of Defense William S. Cohen, said she jumped at Bratton's idea.\n\"I thought, 'Where better than at the tip of spear of law enforcement, where we African-Americans, in particular, are having so much trouble with excessive force, with police brutality, with disproportionate stop and frisks?'\" Cohen said. \"They don't always see us the way they see each other.\"\n\"Anne & Emmett\" premiered in 2009 at the United States Holocaust Museum and has been performed in Washington, D.C., Indianapolis and Chicago. Its message of humility, dignity and empathy has played for students and Supreme Court justices. The New York police department is discussing making it a permanent part of its recruit training.\n\"We're always looking for new ways for recruits to tackle the challenges of policing in a multicultural society like we have in New York City,\" said Inspector Richard Dee, the executive officer of the police academy. \"It's a way for recruits to self-reflect. I think the production is going to cause them to reflect on the history of race relations and now their new-found role.\"\n___\nOnline:\nhttp://anneandemmett.com\nSociety & Culture Politics & Government Anne Frank Janet Langhart Cohen New York City Emmett Till", "external_links": [], "published": "2015-10-17T03:00:00.000+03:00", "crawled": "2015-10-17T00:56:46.403+03:00", "highlightTitle": ""}