{"organizations": [], "uuid": "607b867b650cf84f8fa6b81bc24a9b7534e51a8b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://images.canberratimes.com.au/2015/10/16/6934257/Thumbnail1001507609gk9snximage.related.thumbnail.320x214.gk9s7t.png1444951214215.jpg.jpg", "site_section": "http://feeds.canberratimes.com.au/rssheadlines/entertainment.xml", "section_title": "Canberra Times Entertainment Headlines", "url": "http://www.canberratimes.com.au/entertainment/your-perth/a-sweet-kind-of-love-for-new-bassendean-breakfast-beauty-holly-rayes-20151016-gk9s7t.html", "country": "AU", "title": "A sweet kind of love for new Bassendean breakfast beauty Holly Raye's", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "A sweet kind of love for new Bassendean breakfast beauty Holly Raye's", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T02:20:00.000+03:00", "replies_count": 0, "uuid": "607b867b650cf84f8fa6b81bc24a9b7534e51a8b"}, "author": "Liz Sheehan", "url": "http://www.canberratimes.com.au/entertainment/your-perth/a-sweet-kind-of-love-for-new-bassendean-breakfast-beauty-holly-rayes-20151016-gk9s7t.html", "ord_in_thread": 0, "title": "A sweet kind of love for new Bassendean breakfast beauty Holly Raye's", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A welcoming image for pooches and diners alike. Photo: Liz Sheehan \nJust like Maylands, Bassendean is going through a bit of a renaissance.\nThere are apartments being built, a small bar set to open any day now and fantastic cafes popping up, with the newest being a little beauty called Holly Raye's. \nThey opened last week to the loud applause of Instagram and Facebook love. Andy and I visited on Friday and I wasn't the only person there with a camera. When you have food bloggers there that early, you know this is a cafe with some serious hype.\nMexican style beans hit the spot. Photo: Liz Sheehan \nYou can't miss this place as you turn off Old Perth Road. A massive colourful mural of Holly's dog Angus decorates the outside wall. Painted by world renowned Fremantle artist Anya Brock, this tribute to the owners' beloved pet dog is a welcoming face for patrons and pets alike. \nAdvertisement Yep.. your pooches are welcome too!\nCoffee here is by local independent roaster - Micrology Coffee Roasters. I guarantee you won't be disappointed when you're drinking one of the best coffees in Perth. They had a couple of roasts on the go - \"La Perla Del Cafe\" from Costa Rica & \"Blue Note\", which is a blend of South American beans.\nFor those who enjoy a sweet treat for breakfast. Photo: Liz Sheehan \nThe coffee tasting notes are sitting on the front counter along with some pretty impressive sweet treats. Oh did I mention Holly's mum is responsible for those delicious baked goods AND she used to bake at Sherbets in Maylands - talk about skills!\nThe menu has all bases covered - sweet, vegetarian, healthy, traditional and inventive - there IS a dish for YOU here. Prices range from $7 for toast up to $20 for benedict eggs with pulled pork and hollandaise.\nI really wanted the acai bowl ($15) because it was a hot morning and the idea of fresh fruit, granola and coconut with acai sounded very appealing. BUT they didn't have any. None on day four of being open? \nOur breakfast blogger guarantees you won't be disapoointed with a coffee from Micrology Coffee Roasters. Photo: Liz Sheehan \nGAH! I never have a back up dish ready in my mind because I like to be 100 per cent committed to what I order. I don't want to order something but then be thinking \"oh I should have gone with the other one\". I don't have the temperament to be dealing with that kind of regret. So I made a spur of the moment decision and went with the breakfast guacamole, black beans and jalapeno corn bread ($18).\nWow. When this was put in front of me the acai bowl became a very distant memory.  Don't be fooled by how small this dish looked on the plate - it packed a filling punch. Two thick slices of tasty corn bread sat underneath a pile of hearty beans that had a rich spiced flavour. The freshness of the guacamole was a brilliant addition to this dish. This breakfast with a Mexican slant was well worth ordering.\nThe sticky gingerbread ($17) had no trouble enticing Andy. Served with vanilla mascarpone, treacle toffee sauce, poached pear, and campfire marshmallow, this was good enough to be a dessert in one of Perth's top restaurants and definitely good enough to be a breakfast for someone with a sweet tooth.\nThe dark coloured gingerbread reminded Andy of the Lyons Jamaica Ginger Cake he used to eat in ol blighty as a kid. Anyone would find it hard to say something bad about a dish that takes them back to their childhood. Well... unless we're talking about lambs fry liver.\nThe poached pear gave it a different textural element and was something a little less sweet to cut through the sticky goodness of the treacle toffee sauce. Campfire marshmallows were lightly kissed by a flame, which is nothing like how I used to toast marshmallows (until they were blackened and stuck to the stick). The yellow edible flowers were the perfect colour matched garnish to this perfect sweet breakfast.\nWe also ordered a side of Karri smoked bacon ($4) - just because we wanted to see what it would taste like. I don't know how to say this without it sounding bad, and I don't intend it to, but it tasted like the smell of bushfire AND it was delicious.  It is unique in flavour and in the world of bacon - that's worth mentioning.\nBassendean sounds far away but it is only around 12km from the city and you know what else is out that way? The Swan Valley. Wine tasting after breakfast anyone?\nWith summer right around the corner, Holly Raye's is going to be adding some fresh new menu items in time for the hot weather. This cafe should be on top of everyone's list to visit.\nJames St, Bassendean (just off Old Perth Road)\nBreakfast served from 7am Tues - Sun", "external_links": [], "published": "2015-10-16T02:20:00.000+03:00", "crawled": "2015-10-16T10:48:44.509+03:00", "highlightTitle": ""}