{"organizations": [], "uuid": "d92a12fa87361d80e8230ba5f5634879b1444b24", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mid-day.com", "main_image": "http://images.mid-day.com/images/2015/aug/11Heath-Ledger-l.jpg", "site_section": "http://www.mid-day.com/Resources/midday/rss/entertainment.xml#", "section_title": "entertainment", "url": "http://www.mid-day.com/articles/hilarious-throwback-video-of-heath-ledger-goes-viral/16633158", "country": "IN", "title": "Hilarious throwback video of Heath Ledger goes viral", "performance_score": 0, "site": "mid-day.com", "participants_count": 1, "title_full": "Hilarious throwback video of Heath Ledger goes viral - Entertainment", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T02:00:00.000+02:00", "replies_count": 0, "uuid": "d92a12fa87361d80e8230ba5f5634879b1444b24"}, "author": "PTI", "url": "http://www.mid-day.com/articles/hilarious-throwback-video-of-heath-ledger-goes-viral/16633158", "ord_in_thread": 0, "title": "Hilarious throwback video of Heath Ledger goes viral", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Los Angeles:  A video featuring the late Heath Ledger and 'Kath and Kim' actress Magda Szubanski from 2006 went viral this week, after being featured in a Throwback Thursday post.\n\n\nHeath Ledger \nThe funny clip shows Szubanski in character as 'Kath and Kim's' Sharon, freaking out upon seeing the actor on the red carpet and then getting a kiss on the lips from the hunk, reported Radar online.\n\nAs Heath Ledger was about to be interviewed on the red carpet, Szubanski comes up behind him and screams, making the actor jump.\nBut Ledger handles it like a pro and gives the over-excited Sharon a kiss on the lips and even strokes her face, causing her to drop to the floor.\nLater in the night, as luck would have it, Sharon and popstar Danni Minogue presented the reader's choice award, for which Ledger had been nominated.\nSharon appeared on stage with an unsightly rash on her face and told the audience, \"I'm a little bit over-excited tonight, because when I was on the red carpet, I met Heath Ledger and now I have a little bit of a case of Heath Rash.\"\n\"And you know, it's really funny, actually, Danni, cause I always thought he was gay,\" she continued. Then, after nervously opening the envelope, Sharon got to reveal that Ledger had one the award and the two were reunited after their red carpet snog.\n\"I'm sorry about his,\" Ledger told her, pointing to the facial rash. \"I had the same thing happen to me when I made out with Jake Gyllenhaal.\"\nAt the time Ledger had been winning nearly every award going, thanks to his role in 'Brokeback Mountain' opposite Jake Gyllenhaal.", "external_links": [], "published": "2015-10-26T02:00:00.000+02:00", "crawled": "2015-10-26T05:51:08.219+02:00", "highlightTitle": ""}