{"organizations": [], "uuid": "92a0d588796710869decfddcbc532ac2503d8e04", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cosmopolitan.com", "main_image": "http://cos.h-cdn.co/assets/15/42/1444916482-ahs-502-0250d-hires1.jpg", "site_section": "http://www.cosmopolitan.com/entertainment/", "section_title": "Entertainment News and Celebrity Gossip - Cosmopolitan", "url": "http://www.cosmopolitan.com/entertainment/tv/a47742/american-horror-story-hotel-episode-2-recap/", "country": "US", "title": "American Horror Story Hotel Episode 2 Recap & Review – Chutes and Ladders", "performance_score": 0, "site": "cosmopolitan.com", "participants_count": 1, "title_full": "American Horror Story Hotel Episode 2 Recap & Review – Chutes and Ladders", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T17:45:00.000+03:00", "replies_count": 0, "uuid": "92a0d588796710869decfddcbc532ac2503d8e04"}, "author": "Cosmopolitan.com", "url": "http://www.cosmopolitan.com/entertainment/tv/a47742/american-horror-story-hotel-episode-2-recap/", "ord_in_thread": 0, "title": "American Horror Story Hotel Episode 2 Recap & Review – Chutes and Ladders", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Share Tweet Pin E-mail FX Why.\nDoes Lady Gaga.\nTalk.\nLike she has.\nAsthma.\nSo far things are still gross and sad, but now we have the extra bonus of listening to Lady Gaga wheeze her way through flashbacks. She's been alive since 1904, her favorite vampire era was '70s disco, and this week she turned meth-addled model Tristan into her newest boy toy. She \"smelled his rage\" and he was sick of modeling anyway, having just slashed his face to get out of the biz. Everything is pumped up to 10 with these vampires — they don't have fangs so they just cut at will, spilling blood everywhere. They've taken the very neat business of murder and turned it into a log flume ride of gore. The main rule of vampires should be \"carful who you turn,\" because Tristan is annoying as hell. He also wants to hunt Kendall Jenner because she \"blew him off at Coachella,\" proving that men's rights activism will literally follow you to the grave. Donovan the old junkie is out, and Tristan the new junkie is in.\nMore from American Horror Story 20 articles Here Is the First \"American Horror Story: Hotel\"... New \"American Horror Story: Hotel\" Teaser... \"American Horror Story: Freak Show\" Finale Leaves... \"American Horror Story\" Recap: Neil Patrick... Naomi Campbell made her debut this week, but only to attend a fashion show thrown by Will Drake. Will's son takes Lowe's daughter to explore the hotel, and brings her directly to an empty pool filled housing four coffins for the Four Yup-Blonde kids. They're vampires now? Or, like, a blood delivery system? They feed on the remaining Euro girl until she croaks, and then their blood gets pumped out and put in a decanter for Countess Wheeze-a-lot.\nOf course Scarlett recognizes her supposedly dead brother; she even snaps a selfie with him like that's a totally normal reaction. She's probably scarred from seeing Hypodermic Sally chew on her own teeth in the hallway. But surprise, bitch! He can't be caught on camera. The photo is enough to make her dad want to learn more about Hotel Cortez, and Kathy Bates gives up the history of the hotel in a heartbeat.\nBasically, James March (Evan Peters) built the hotel to be his own serial killer Winchester Mystery house back in 1925. The funniest part is that Iris called him \"new money,\" as if how he made his fortune is somehow sleazier than the fact that he has a dead body chute built into his laundry room. March is a sadistic bastard, raping a woman while he slashed her apart, bricking a different woman into the wall, killing migrant workers, and bashing in the heads of men who believe in god. He has a weird mask and the laundress, Miss Evers (Mare Winningham), was his right-hand woman. I hereby declare: I will write a TV show that allows our aging actresses the dignity of not having to wash blood out of murder sheets while begging to be killed in a murder-suicide pact. We deserve better, guys, and so does Mare Winningham. After March shoots her in the head, he slashes his own throat, which comes in handy for freaking people out when he shows up later in the show. Oh yeah, he totally still haunts his own hotel. Where else is he going to go?\nLowe thinks March is a Ten Commandments serial killer, and his current bedroom is March's old office. That might explain his horrible nightmares featuring ol' Screw Dick and some ghouls who bone in his shower. Is the goal of this show to turn me off of sex forever? Congratulations, Ryan Murphy, I'm having my vagina hermetically sealed.\nTristan uses Grindr to find his first victim, some urban lumberjack with a topknot and suspenders. The Countess tries to get in on the action, and homeboy has the nerve to say, \"Vag is a total deal breaker for me, I got rules.\" But it doesn't really matter — Tristan slices him up and has the nerve to basically say \"no homo\" before sucking the blood out of this dude. Then they bone on top of the lumberjack while he bleeds out, just like Jesus and Mary.\nI am reeeeally not feeling this season. It's gratuitously gory in a way that just makes me feel like I'm losing brain cells watching it, and they could change the title to American Horror Story: Male Gaze without skipping a beat. Why is Lowe living in this hotel, especially after he hears the grizzly tale of James March? Once your child tells you she just saw your missing son living in the walls, getting his blood pumped, wouldn't you pack a suitcase and bounce on out of there?\n​Follow Danielle on Twitter .", "external_links": ["http://cos.h-cdn.co/assets/15/42/980x1498/gallery-1444916482-ahs-502-0250d-hires1.jpg", "http://cos.h-cdn.co/assets/15/29/320x160/landscape-1436811994-screen-shot-2015-07-13-at-22554-pm.png", "http://cos.h-cdn.co/assets/15/37/320x160/landscape-1441905689-screen-shot-2015-09-10-at-12155-pm.png", "http://cos.h-cdn.co/assets/15/02/320x160/gallery_nrm_1420732399-o-american-horror-story-neil-patrick-harris-facebook.jpg", "http://cos.h-cdn.co/assets/15/42/640x978/gallery-1444916482-ahs-502-0250d-hires1.jpg", "http://cos.h-cdn.co/assets/15/42/480x733/gallery-1444916482-ahs-502-0250d-hires1.jpg", "http://cos.h-cdn.co/assets/15/42/640x320/landscape-1444916482-ahs-502-0250d-hires1.jpg", "http://cos.h-cdn.co/assets/15/42/1444916482-ahs-502-0250d-hires1.jpg", "http://cos.h-cdn.co/assets/15/04/320x160/landscape_nrm_1421940987-o-american-horror-story-freak-show-finale-facebook.jpg", "https://twitter.com/knottyyarn", "http://cos.h-cdn.co/assets/15/42/768x1174/gallery-1444916482-ahs-502-0250d-hires1.jpg"], "published": "2015-10-15T17:45:00.000+03:00", "crawled": "2015-10-15T18:38:18.716+03:00", "highlightTitle": ""}