{"organizations": [], "uuid": "63bbb57a270e8377fb06963f0b98795b84b24933", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "savannahnow.com", "main_image": "http://savannahnow.com/sites/default/files/14800513_0.jpg", "site_section": "http://savannahnow.com/", "section_title": "savannahnow.com | Savannah Georgia's source for News, Entertainment, Sports, Weather, Classifieds, Jobs, Autos, Real Estate and St. Patricks Day", "url": "http://savannahnow.com/sports/2015-10-10/tigers-pound-ga-tech-43-24", "country": "US", "title": "Tigers ground Ga. Tech 43-24", "performance_score": 0, "site": "savannahnow.com", "participants_count": 1, "title_full": "Tigers ground Ga. Tech 43-24 | savannahnow.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T15:28:00.000+03:00", "replies_count": 0, "uuid": "63bbb57a270e8377fb06963f0b98795b84b24933"}, "author": "PETE IACOBELLI", "url": "http://savannahnow.com/sports/2015-10-10/tigers-pound-ga-tech-43-24", "ord_in_thread": 0, "title": "Tigers ground Ga. Tech 43-24", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photos Back | Next Photo by Cam Turner\nCalvary grad Milan Richard (left) and Benedictine grad Brad Stewart after Clemson’s win over Georgia Tech Saturday.\nBack | Next Richard Shiro/The Associated Press\nGeorgia Tech quarterback Justin Thomas is sacked by Clemson’s Shaq Lawson during the first half Saturday in Clemson, S.C.\nBack | Next Clemson's Germone Hopper, left, slips the tackle attempt of Georgia Tech's Corey Griffin, center, and Lawrence Austin (20) during the first half of an NCAA college football game Saturday, Oct. 10, 2015, in Clemson, S.C. (AP Photo/Richard Shiro) SPECIAL OFFER FOR NEW READERS 99 cent digital subscription to savannahnow.com\nSubscriber-members get access to ALL our digital products AND become eligible for free event tickets, discount coupons and other benefits. SIGN UP FOR SUBSCRIBER BENEFITS As a Savannah Morning News / savannahnow.com subscriber, you're eligible for members-only discounts. Download your coupons now. SPECIAL OFFER FOR NEW READERS 99 cent digital subscription to savannahnow.com\nSubscriber-members get access to ALL our digital products AND become eligible for free event tickets, discount coupons and other benefits. SIGN UP FOR SUBSCRIBER BENEFITS As a Savannah Morning News / savannahnow.com subscriber, you're eligible for members-only discounts. Download your coupons now. By PETE IACOBELLI CLEMSON, S.C. — No. 6 Clemson is out to show its old reputation is a thing of the past. The Tigers hope a win over Georgia Tech on Saturday helped them build their case.\nDeshaun Watson threw his most yards this season and two touchdowns to tight end Jordan Leggett, Wayne Gallman had his third-straight 100-yard game and two rushing touchdowns and the Tigers’ defense held the Yellow Jackets to their fewest rushing yards in coach Paul Johnson’s tenure for a 43-24 win.\nOn the same soggy field where they beat Notre Dame last week, Clemson (2-0 Atlantic Coast Conference) improved to 5-0 for the third time in five seasons. Those other two teams — 8-0 in 2011 and 6-0 in 2013 — could not keep their edge after their hot starts.\nMaybe this group has more staying power.\nLeft guard Eric Mac Lain said the Tigers came out eager to keep the momentum from last week’s 24-22 win against the No. 15 Irish — and finally sink the bitter sound of “Clemsoning,” a term detractors created to explain why bad things happen to good Tiger teams.\n“Our past has nothing to do with us, but we get all the credit for it,” Mac Lain said. “So I hope this game is a little bit of statement that we won’t overlook anybody this season.”\nThe Yellow Jackets (2-4, 0-3) lost four straight games for the first time since 1996 and managed just 71 yards rushing, their fewest since gaining 79 yards against Gardner-Webb in Johnson’s debut season of 2008.\nGallman ran for 115 yards, including a 66-yard touchdown run on the game’s third play, and Clemson’s rout was on. Still, Swinney faced questions about if his team had put aside “Clemsoning” for good. He bristled.\n“This football team has shown up. What else do we have to do?” Swinney said. “I can’t believe I have to come here with a 5-0 football team and talk about ‘Clemsoning.’ It shouldn’t be in the conversation.”\nWatson passed for 265 yards, his highest total this season, and had touchdown throws of 29 and 8 yards to Leggett.\nThe Georgia Tech victory was Clemson’s 33rd straight over an unranked opponent and proved perhaps these Tigers have more staying power than in the past. It was also Clemson’s 13th straight victory at home, tying the school record set from 2011-13.\nThis time, though, many wondered if the Tigers would get caught in a Georgia Tech trap.\n“The rhetoric was, ‘How can you possibly be ready to play the game?’” Clemson coach Dabo Swinney said. “I don’t understand that, and I’m proud our guys didn’t buy into that.”\nThe proof began three plays in when Gallman swept around the left end and went 66 yards for the Tigers longest play of the year and a 7-0 lead on the game’s third play.\nThomas was intercepted moments later, and the Tigers tacked on a field goal to take an early double-digit lead for the second straight contest. While Clemson struggled to build on its 14-0 lead on Notre Dame last week, it little problem piercing the Yellow Jackets defense. Watson went 5 of 5 passing for 68 yards on a second-quarter drive Gallman finished from a yard out for his second TD and a 17-3 lead.\nWatson went to the air in the second quarter, finding Leggett on scoring passes of 29 and 8 yards to take a 33-10 lead at half.\nThe Tigers also got a safety off a blocked punt that looked like something from a Three Stooges short. The ball was snapped over the head of punter Ryan Rodwell, who picked up the ball and booted a low liner that hit off Clemson defender Jadar Johnson before bouncing through several hands and out of the end zone.\nClemson outgained Georgia Tech 318 to 109 in the opening half.\nThe Yellow Jackets, who came in leading the ACC with 311 yards a game on the ground, were held to 56 in the first half by Clemson’s defense. They did not do much better after halftime, gaining just 15 on the ground the final 30 minutes.\n“I’ve never experienced a year like this in my coaching career, being as inept as we are,” Johnson said. “It’s one thing to be physically dominated. It’s another thing to not even give yourselves a chance.”\nGeorgia Tech 3 7 7 7 — 24\nClemson 19 14 7 3 — 43\nFirst Quarter\nClem_Gallman 66 run (Huegel kick), 13:55.\nClem_FG Huegel 21, 11:19.\nGaT_FG Butker 39, 6:52.\nClem_Gallman 1 run (Huegel kick), 2:52.\nClem_Safety, :51.\nSecond Quarter\nClem_Leggett 29 pass from Watson (Huegel kick), 13:56.\nGaT_Lynch 50 pass from Thomas (Butker kick), 5:27.\nClem_Leggett 8 pass from Watson (Huegel kick), :04.\nThird Quarter\nClem_Brooks 35 run (Huegel kick), 5:06.\nGaT_Gotsis recovered fumble in end zone (Butker kick), 1:16.\nFourth Quarter\nClem_FG Lakip 42, 12:07.\nGaT_Jeune 46 pass from Thomas (Butker kick), 8:52.\nA_80,983.\nGaT Clem\nFirst downs 12 24\nRushes-yards 42-71 41-201\nPassing 159 336\nComp-Att-Int 6-14-1 23-33-1\nReturn Yards 12 34\nPunts-Avg. 8-31.6 3-45.0\nFumbles-Lost 0-0 2-2\nPenalties-Yards 5-50 4-45\nTime of Possession 29:24 30:36\nINDIVIDUAL STATISTICS\nRUSHING_Georgia Tech, M.Marshall 11-45, Jordan 2-14, Alford 1-9, M.Allen 4-8, Skov 2-4, Lynch 1-3, Thomas 14-3, Lands-Davis 3-2, Team 1-(minus 1), T.Marshall 1-(minus 6), L.Griffin 2-(minus 10). Clemson, Gallman 13-115, Brooks 3-41, Davidson 3-17, Watson 6-16, Fuller 6-15, McCloud 2-6, Dye 3-4, Schuessler 1-0, K.Bryant 3-(minus 1),\nTeam 1-(minus 12).\nPASSING_Georgia Tech, Thomas 6-14-1-159. Clemson, Watson 21-30-1-265, Schuessler 2-2-0-71, Team 0-1-0-0.\nRECEIVING_Georgia Tech, Jeune 2-69, Lands-Davis 2-37, Lynch 1-50, Summers 1-3. Clemson, Cain 5-96, Leggett 4-56, A.Scott 4-50, Thompson 3-47, McCloud 3-16, Peake 2-22, Hopper 1-32, Renfrow 1-17.", "external_links": ["http://sav-cdn.com/sites/all/themes/whitelabel/images/blank.gif", "http://sav-cdn.com/sites/default/files/imagecache/story_slideshow_thumb/14800513_0.jpg", "http://sav-cdn.com/sites/default/files/imagecache/superphoto/14801033.jpg", "http://sav-cdn.com/sites/default/files/imagecache/story_slideshow_thumb/14801033.jpg", "http://sav-cdn.com/sites/default/files/imagecache/story_slideshow_thumb/14800828.jpg", "http://sav-cdn.com/sites/default/files/imagecache/superphoto/14800828.jpg", "http://sav-cdn.com/sites/all/themes/savannahnow/images/blank.gif", "http://sav-cdn.com/sites/default/files/imagecache/superphoto/14800513_0.jpg"], "published": "2015-10-10T15:28:00.000+03:00", "crawled": "2015-10-11T12:14:10.901+03:00", "highlightTitle": ""}