{"organizations": [], "uuid": "29ce122bab20abdf91d2742c7fa0cfb84edfe3ee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bellinghamherald.com", "main_image": "http://www.bellinghamherald.com/static/images/bellinghamherald/facebook.jpg", "site_section": "http://www.bellinghamherald.com/entertainment/?widgetName=rssfeed&widgetContentId=712015&getXmlFeed=true", "section_title": "Entertainment News | BellinghamHerald.com &", "url": "http://www.bellinghamherald.com/entertainment/celebrities/article38802696.html", "country": "US", "title": "Halloween, horror: harmless fun or a step too far?", "performance_score": 0, "site": "bellinghamherald.com", "participants_count": 1, "title_full": "Halloween, horror: harmless fun or a step too far?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T21:07:00.000+03:00", "replies_count": 0, "uuid": "29ce122bab20abdf91d2742c7fa0cfb84edfe3ee"}, "author": "CRAIG SEMON Telegram &amp; Gazette", "url": "http://www.bellinghamherald.com/entertainment/celebrities/article38802696.html", "ord_in_thread": 0, "title": "Halloween, horror: harmless fun or a step too far?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Order Reprint of this Story WORCESTER, Mass. \nDespite the pervading real-life violence of ISIS, school shootings and terror bombings, many people still love to see the gory sights of the season. \nBut some people ask if our society has become desensitized to the real evils of the world, or is the gore and scariness of Halloween just harmless fun? It depends on whom you talk to. \n\"Halloween is about gory and bloody. It's just the world around us that is getting very sensitive,\" Christine Arvanigian, president of the Halloween Outlet said. \"For a while, after Sept. 11, things pulled back and kids were being like happy things. But they're back to being scary things. Halloween is about having fun. It's escapism. It's not real, people.\" \nIn addition to being members of the Deadites, a heavy rock band inspired by B-horror movies, Mique \"Dynamo\" L. Marz and Johnny Wolfenstein, co-hosts of \"Trick Or Treat Radio\" (which Entertainment Weekly ranked as one of its \"5 essential podcasts for horror fans\"), Kevin Barbare, morning host of 104.5 WXLO and creator and co-founder of Rock and Shock Convention (happening Oct. 16-18 at the DCU Center), and Erick Godin, owner of the Lucky Dog Music Hall, all have something in common. \nThey love Halloween and horror movies. \nThe four friends talked to a reporter at the Halloween Outlet on West Boylston Street, the perfect haunt for a Halloween fan and horror-film aficionado. \n\"I love horror movies. I love what it does to me. I do love getting dressed up for Halloween, getting a really freaky costume, getting into people's faces and nobody knows it's you,\" Godin said. \"It's awesome.\" \nMr. Wolfenstein blames the Internet and its relentless barrage of graphic images and information as the culprit in desensitizing the human populace, not horror movies and/or over-the-top Halloween displays depicting decapitations, dismemberment, demonic possession and even acts of cannibalism. \n\"If something happens, you instantly know about it. If there's a shooting, it's trending on Twitter. Everybody knows about it. You can't avoid it now,\" Wolfenstein said. \"Before, if you wanted to, you had to read a newspaper and seek it out.\" \nMarz said society has become so overwhelmed by so much bad news that we cannot be scared anymore. \n\"If you look at the really gritty, grimy horror movies that came out after Vietnam and into the 80s when kids were dressed as serial killers, as Jason (from \"Friday the 13th\") and Michael Myers (from \"Halloween\"), I feel that was escapism, pure escapism,\" Marz said. \"We use to think that there were bad things out there, maybe. But, now we know. People are cutting off people's head on the Internet. We grew up watching movies about 'Don't go there. Don't go there' but you can get shot just going to the movies now.\" \nThe four horror-film aficionados agree that they are living proof that watching too much horror movies does not have a damaging or detrimental effect on one's psyche. \n\"We all watched horror movies as a kid and we are all relatively normal. I was going to horror movies in high school before I was old enough to see them and grew up on monster movies,\" Barbare said. \"If my son is seeing a horror movie right now he would be more, 'Wow, how did they do that?' kind of thing and be scared. He wouldn't be like, 'Oh, I want to see what happens when I do that to a real person.' And that's how I was when I was little. It got nothing to do with what you're watching. It's the person who's watching it.\" \n\"Psychos and horror and Halloween are not synonymous,\" Wolfenstein interjected. \nBetsy Huang, associate professor of English at Clark University, said horror films are both transgressive and conservative. \n\"Stephen King wrote in his essay 'Why We Crave Horror Movies' that we see horror flicks 'to re-establish our feelings of essential normality' and that the horror film is 'innately conservative, even reactionary',\" Huang said. \"Horror is about excessive behavior and ruptures in the rules by which we play every day. It allows us to escape the stultifying conventions of our lives. But the excess feeds our fear of the loss of those rules to such an extreme degree that by the end of a horror film or experience, we desperately want the rules restored.\" \nHugh S. Manon, associate professor and director of the Screen Studies Program at Clark, publishes and teaches about horror/Gothic and zombie films. \nNot only is Halloween his favorite holiday, he said Halloween can serve as a \"release valve\" for one's pent-up aggressions, anxieties and repressed desires. \n\"Wild costumes, haunted house tours, trick-or-treat rituals — all of these permit a safe, relatively controlled way to express impulses and emotions that normally must remain hidden in order for society to function on a day-to-day basis,\" Manon said. \"In some ways, Halloween is the least radical of holidays; it's a holiday for normal people to blow off steam in a culturally sanctioned \"safe zone.\" More disturbing than the wild costumes and displays would be if there were no such opportunity to express what is normally repressed.\" \nA licensed mental health counselor/psychotherapist specializing in reactive attachment disorder, Ken Frohock is also the regional manager of the Adoption Journeys Program that supports adoptive families at risk of disruption. \nNot only does he love his job, this father of three adopted children also loves Halloween so much that for the last 20 years Frohock has created elaborate displays in front of his home on Forest Street. It has ghosts, ghouls, gravestones and, this year, a full-size hearse drawn by the (fake) skeletal remains of a horse. \n\"For me, Halloween is the only time of the year when anybody can be anybody and get away with it,\" Frohock said. \"It's a day of no judgment. Kids can be the villain or they can be the hero.\" \nWhile Frohock is into Halloween, he's not into the gore. \n\"We try to keep it spooky but light. We try not to make it too scary, because we don't want them to be afraid to go up,\" Frohock said. \"I want Halloween to be more old school. I want it to be about the trick-or-treating and about the family and these kind of cool images. . There's not going to be blood or any gore or any of that. It's all lighting and special effects and fog and sound. It's really about the experience. Not the shock value.\" \nNot only does he think some Halloween costumes and displays are too bloody and gory, Frohock said he thinks our society, as a whole, has become too bloody and gory, and young adults have become desensitized to violence. \n\"As a society, we are getting addicted to cortisol. We're so focused on that high from that thing that's going take us by surprise that we're kind of losing focus on what's important,\" Frohock said. \"I think kids are way too hip, way too accustomed to that stuff. When I was a kid, you didn't want to see gore. Now, kids, that's all they want.\" \nFrohock said society is teaching our kids that the reality of the violence is OK and entertaining. \n\"We're training our kids to be attracted to more and more high-adrenaline entertainment so that regular, everyday life seems boring. So they're living in these alternate realities,\" Frohock said. \"When we were growing up, something scary happened. We looked away. Kids these days, something scary happens, they look towards. They want more. That's a really scary statement about society.\" \nFrohock, who said he's a big fan of eliminating TV and the Internet (because \"it's bad for brains\"), blames kids getting more unsupervised access to the Internet, as well as access as violent video games and graphic movies, as the catalyst for Halloween's lost innocence. However, Frohock is quick to point out that people who are into Halloween and horror are not psychopathic killers waiting to happen. \n\"We had 'Creature Double Feature.' 'Creature Double Feature' was scary but we knew it was puppets. At no point did you say, 'Oh my God, this could be real' and that's the other difference in our entertainment. Fantasy used to be fantasy. Now what they do, they mix so much real life into it that it's hard for kids to tell the difference,\" Frohock said. \"And it has become such a high tolerance for kids that that stuff isn't even uncomfortable anymore. What do you have to do to get uncomfortable? How bad does it have to be for you to get uncomfortable and don't want to look at something anymore?\" \nFrohock said it's important for us to spend more time with our kids and be more present when they are watching things that might be more of a \"grey area,\" as well as continue to talk to them about real-life consequences from violent acts. \nManon said a critical point occurs when a child or teenager is able to distinguish and articulate the different between \"real horror and gore\" and \"fake or 'stagey' horror and gore\" and recognizing and understanding this difference is part of what it means to be an adult. However, Manon acknowledges that horror movies and Halloween costumes and displays sometimes work very hard to blur the line between what's \"fake\" and what's \"real.\" \nCiting Sam Raimi's \"Evil Dead\" film series, George A. Romero's \"Living Dead\" film series and stage personae of horror-punk band the Misfits, Manon said \"cartoonish excess\" delivers over-the-top violence and gore that can thrill and delight fans while not being taken very seriously. \n\"People who are into Halloween enjoy the fantasy that everyone is a psychopathic killer waiting to happen,\" Manon said. \"But that people who go all-out on Halloween are, in some ways, the sanest of all.\" Related content", "external_links": [], "published": "2015-10-17T21:07:00.000+03:00", "crawled": "2015-10-17T21:48:48.837+03:00", "highlightTitle": ""}