{"organizations": [], "uuid": "9081432a670dfd8850285618d011471ad2724624", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/Entertainment/0/0/ET_C03_BINDI_IRWIN_072015_640.jpg", "site_section": "http://www.foxnews.com/entertainment/", "section_title": "Entertainment News | Latest News, Videos &amp; Photos on Celebrities, Movies &amp; Music | Fox News", "url": "http://www.foxnews.com/entertainment/2015/10/20/dancing-with-stars-recap-bindi-irwin-has-time-her-life-with-dirty-dancing/", "country": "US", "title": "'Dancing With The Stars' recap: Bindi Irwin has the time of her life with 'Dirty Dancing' tribute", "performance_score": 1, "site": "foxnews.com", "participants_count": 2, "title_full": "'Dancing With The Stars' recap: Bindi Irwin has the time of her life with 'Dirty Dancing' tribute | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T03:00:00.000+03:00", "replies_count": 1, "uuid": "9081432a670dfd8850285618d011471ad2724624"}, "author": "Carole Glines", "url": "http://www.foxnews.com/entertainment/2015/10/20/dancing-with-stars-recap-bindi-irwin-has-time-her-life-with-dirty-dancing/", "ord_in_thread": 0, "title": "'Dancing With The Stars' recap: Bindi Irwin has the time of her life with 'Dirty Dancing' tribute", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Carole Glines\nPublished October 20, 2015 FoxNews.com Facebook 0 Twitter 0 livefyre Email Print\nThe week's most hotly-anticipated \"Dancing with the Stars\" performance didn't disappoint, as Bindi Irwin and her partner Derek Hough soared to new heights with their thrilling tribute to \"Dirty Dancing.\"\nThe remaining competitors recreated famous dances from movies and music videos Monday night, and Irwin and Hough played Jennifer Grey and Patrick Swayze to perfection, receiving 40 out of 40 points.\nWhile singers Tamar Braxton and Andy Grammer also scored perfect 40s, Irwin created the emotional high point of the evening, while chef Paula Deen was eliminated at the episode's end.\nIrwin's mom Terri sobbed in the audience after watching Hough lift her daughter during \"(I've Had) The Time of My Life,\" and guest judge Olivia Newton-John raved, \"It touched my heart.\"\nAfter the show, Irwin told FOX411, \"It was amazing. Going out there, I was so, so terrified, just because it was so different from anything that we've done yet in this competition so I was scared but Derek was so strong and we managed to get that lift. I'm thrilled.\"\nGrey, who won season 11 with Hough, visited them during rehearsal to give advice.\nIrwin said, \"She's such a kind soul. [She told me] just to keep breathing and to be strong and feel it. For us, it wasn't so much a recreation of the movie as it was just taking inspiration from the movie and trying something, [doing] the best that we could.\"\nThe late Steve Irwin's 17-year-old crocodile kid confided to FOX411 that her wakeboarder boyfriend Chandler Powell, who has constantly been by her side while she's competed, \"was really excited\" by the successful routine. \"He was like, 'I was nervous for you!' \"\nAlthough she doesn't know if her late father Steve Irwin watched \"Dirty Dancing,\" she's sure he would have \"been really excited that we actually managed to get the lift and I'm sure that he would have been practicing it with me!\"\nRehearsal footage showed Irwin and Hough practicing the lift in a smelly pond in Los Angeles.\n\"It was gross,\" Irwin smiled.\nBut Hough revealed that the lift could have been a wardrobe malfunction disaster as he discovered a small tear in Irwin's white dress costume: \"Just five seconds before we went onstage, I had the costume department sew the dress 'cause it was sliding up.\"\nWhen asked if she's lost weight on the show, Irwin replied, \"I don't really know but I'm loving [it]. It's like working out five hours a day, it's brilliant. But for me, I think, jumping on crocodiles and hiking up mountains is all really quite fun. It's about feeling good ... I'm loving this experience. My body the first few weeks was going, 'wow, what are you trying to do to me?' and now, I feel like I have more energy with it.\"\nGrammer and his partner Allison Holker (who is four months pregnant) did an accomplished version of \"Good Morning\" from \"Singin' in the Rain\" after visiting the widow of Gene Kelly, the classic movie's star.\nBraxton and her partner Val Chmerkovskiy ended the show with a strong dance based on Janet Jackson's \"Rhythm Nation\" video.\nAmong the other stars, Nick Carter did an energetic John Travolta from \"Saturday Night Fever\" and Hayes Grier charmed as Travolta in \"Grease.\"\nAlek Skarlatos portrayed another icon, Elvis Presley in \"Jailhouse Rock.\"\nCarlos PenaVega stood out by doing the sexy \"Pony\" routine from \"Magic Mike,\" and had a wardrobe malfunction when he tried to tear off his white tank top but it settled at his waist instead of coming off completely.\nJudge Julianne Hough thought he handled it \"like a pro, you kept going,\" and he got a score of 38.\nBut his wife Alexa PenaVega, who handled a snake for her routine to Britney Spears' \"I'm A Slave 4 U,\" only received 30 and wound up in tears as she landed in the bottom two with Deen.\nBut it was Deen who had to say \"Bye, y'all,\" after receiving the night's lowest score, a 24 for her hilarious performance with partner Louis Van Amstel, essaying Madonna's \"Vogue\" at the 1990 VMAs.\nDeen, still wearing her elaborate Marie Antoinette costume backstage, wasn't fazed by her elimination, telling FOX411, \"I think I went out on top.\"\nThe 68-year-old cook said it \"was so fun\" playing Madonna but laughed of the costume, \"It's uncomfortable. The wig is going to itch me to death. I'm probably going to rip half my hair out trying to get it off.\"\nDeen praised her tugboat captain Michael Groover, 59, backstage for how he had supported her during \"DWTS,\" telling reporters, \"My husband has been with me every second. He has not left me, not for one minute. He is—I just can't say what a sport he's been. He sits in a hotel room all day long by himself, sometimes half the night by himself and has not complained, not one time.\"\nWith Groover standing loyally nearby, Deen said she's now going to concentrate on promoting her new cookbook, \"Paula Deen Cuts The Fat.\"\n\"It's time for me to get out there and meet the people,\" she declared.", "external_links": [], "published": "2015-10-20T03:00:00.000+03:00", "crawled": "2015-10-20T14:59:27.877+03:00", "highlightTitle": ""}