{"organizations": [], "uuid": "60beb3b21a6664361262d508e6354dba42d5fae4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "savannahnow.com", "main_image": "http://savannahnow.com/sites/default/files/image1_3.JPG", "site_section": "http://savannahnow.com/", "section_title": "savannahnow.com | Savannah Georgia's source for News, Entertainment, Sports, Weather, Classifieds, Jobs, Autos, Real Estate and St. Patricks Day", "url": "http://savannahnow.com/news/2015-10-23/chatham-county-commission-calls-police-merger-talks-plans-restart-county-force", "country": "US", "title": "Chatham County Commission calls off police merger talks, plans to restart county force", "performance_score": 0, "site": "savannahnow.com", "participants_count": 6, "title_full": "Chatham County Commission calls off police merger talks, plans to restart county force | savannahnow.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T19:39:00.000+03:00", "replies_count": 8, "uuid": "60beb3b21a6664361262d508e6354dba42d5fae4"}, "author": "KELLY QUIMBY", "url": "http://savannahnow.com/news/2015-10-23/chatham-county-commission-calls-police-merger-talks-plans-restart-county-force", "ord_in_thread": 0, "title": "Chatham County Commission calls off police merger talks, plans to restart county force", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photos By KELLY QUIMBY\nThe Chatham County Commission is no longer willing to negotiate with the city of Savannah to preserve a joint police department.\nMore than a year since the commission voted unanimously to terminate the current agreement and began what became an ongoing round of negotiations and preliminary votes, commissioners Helen Stone, Tony Center, Patrick Farrell, Lori Brady and Dean Kicklighter on Friday said they are ready to give up on the process.\nThe five supported a motion by Kicklighter to “end any and all negotiations/discussions with the city of Savannah regarding a merged police department effective immediately, and hereby instruct the county manager to notify in writing the city of Savannah that the county withdrew its offer and that no more negotiations regarding a merged department will take place.\n“In addition,” Kicklighter said, “this motion instructs the county manager to immediately begin the process of hiring a fully staffed police department, acquire all the needed vehicles, weapons and everything else that’s needed and to have a goal to have all of this in place ... by the time that the contract for the current agreement expires.”\nA common complaint among the supporters of Kicklighter’s motion was that the city of Savannah has proved to be a disappointing partner and impassive negotiator.\nCommissioner Helen Stone, who voted to support a merger agreement on Sept. 11, likened the negotiations to that of the city and its little brother, in which the county was treated as less than an equal.\n“We’ve been sitting on this for six weeks waiting for an answer. They won’t respond. They want to keep adding on,” Stone said. “I find no joy in seeing this department de-merge. I think it’s going to be a great deal of effort on the part of the county. I think it’s not in the best interest of the city. (But) I think our hands are tied at this point.”\nBefore the commission’s 5-4 vote Friday morning, Chairman Al Scott cautioned that the expense to start a county police department will drain Chatham’s special service district fund during the first two years.\n“It could result on this commission being called on to raise taxes in the special service district, and I want you to know that up front,” Scott said. “I want to be on record telling you this. So when you vote for this, please be prepared for all the other things you may have to vote for in order to implement your decisions.”\nAs for having a county department in place by the time the current merger agreement expires in six months, Scott told Vice Chairman Priscilla Thomas the county has estimated the process will take about 18 months.\nCounty Manager Lee Smith said the county can count on mutual aid to protect the unincorporated residents during the period between the current agreement’s expiration and the official start of a county department.\n“That’s something I have no question about,” he said after the meeting Friday. “When the red lights, the blue lights go off, we all work together.”\nSmith he intends to call a workshop for sometime next week to discuss costs to re-form a department. He said the numbers have changed since he recommended the commission take such action at a work session last December. At the time, the anticipated cost was $13 million for the first year, with an additional $3.5 million needed for equipment.\nThe proposed agreement with the city of Savannah would have cost the county $14.1 million for the first two years plus an additional expense to adjust the police department’s salary table. The county commission on Friday did agree by an 8-1 vote to a one-time payment to the city of $279,773 to cover police salary increases from July 1 through Dec. 31.\nThe county’s share amounts to 24.27 percent of the cost to implement pay scale change during those six months. City of Savannah spokesman Bret Bell said the total expense from July to December is estimated $1.4 million.", "external_links": ["http://sav-cdn.com/sites/default/files/imagecache/superphoto/image1_3.JPG", "http://sav-cdn.com/sites/all/themes/savannahnow/images/blank.gif", "http://sav-cdn.com/sites/default/files/imagecache/story_slideshow_thumb/image1_3.JPG"], "published": "2015-10-23T19:39:00.000+03:00", "crawled": "2015-10-23T22:05:27.265+03:00", "highlightTitle": ""}