{"organizations": [], "uuid": "2d1cc2323113053c156c01db17865466abcce877", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mercurynews.com", "main_image": "http://extras.mnginteractive.com/live/media/site568/2015/1006/20151006_060159_1007roku.jpg", "site_section": "http://feeds.mercurynews.com/mngi/rss/CustomRssServlet/568/200733.xml", "section_title": "Entertainment", "url": "http://www.mercurynews.com/troy-wolverton/ci_29015012/wolverton-4k-streaming-no-big-advantage-roku-4?source=rss", "country": "IL", "title": "Wolverton: 4K streaming no big advantage for Roku 4", "performance_score": 0, "site": "mercurynews.com", "participants_count": 1, "title_full": "Wolverton: 4K streaming no big advantage for Roku 4", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T01:42:00.000+03:00", "replies_count": 0, "uuid": "2d1cc2323113053c156c01db17865466abcce877"}, "author": "Troy Wolverton\n\nMercury News Columnist", "url": "http://www.mercurynews.com/troy-wolverton/ci_29015012/wolverton-4k-streaming-no-big-advantage-roku-4?source=rss", "ord_in_thread": 0, "title": "Wolverton: 4K streaming no big advantage for Roku 4", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted: 10/23/2015 03:40:22 PM PDT Updated: 10/23/2015 03:42:38 PM PDT The new Roku 4 streaming device offers video in Ultra HD, or 4K, resolution. (Roku photo) Ultra-high definition video is the big new thing in television, and Roku is hoping to cash in on the trend. \nThe Saratoga startup has updated its lineup of digital set-top boxes to include one that can display ultra-high definition, or 4K, movies and television shows. Dubbed the Roku 4, the device represents the company's new flagship and, at $130, is priced accordingly. \nUnfortunately for Roku, the ability to display 4K video is less useful than it would seem. And at least right now, the Roku 4 isn't worth the premium the company is charging for it. \nMany of the problems with the Roku 4 are really just shortcomings of the 4K standard itself. Although there are a growing number of ultra-high definitions being sold and an increasing amount of 4K video available, there's still not a lot to watch on them. \nOut of the more than 3,000 channels available through Roku boxes, the Roku 4 offers just six that have 4K content: Netflix, Amazon Instant Video, Vudu, YouTube, M-Go and kids video provider Toon Goggles. Even among those handful of channels, only a small portion of their videos are available in the ultra-high resolution standard. And that video can be hard to find; many of the channels don't highlight their 4K content, so you have to comb through videos one by one to see if they are available in ultra-high definition. \nRoku has attempted to address the last of these problems. Inside the Roku channel store, the company has a special section for 4K-compatible channels. And the Roku 4 has a new channel called \"4K Showcase\" that highlights ultra-high definition videos. Advertisement \nBut finding 4K videos can still be a challenge. \"4K Showcase\" doesn't point to ultra-high definition videos from Netflix, and it doesn't have a complete listing of all 4K movies or TV shows available through the other channels. You also can't use Roku's search feature to look just for 4K videos. \nThe big selling point for Roku's boxes has long been that they offered access to far more Internet channels than their leading competitors. But the paucity of available 4K videos minimizes that advantage. If you have a 4K television, it's likely that you can already access most of the 4K videos available through Roku. \nThat's because nearly all 4K televisions are also smart TVs, and those televisions typically offer access to most of the same 4K videos you can get through the Roku 4. The Samsung TV on which I tested the Roku 4 offered 4K content from Netflix, YouTube, Netflix and M-Go. \nThe other big problem with 4K is that unless you have better than 20-20 eyesight, your TV is 70 inches or bigger or you typically sit closer to it than 9 feet, you almost certainly won't be able to distinguish between 4K and regular high-definition video. So in most cases, even if the video you are watching is only in high-definition, you won't be able to tell. \nBut the Roku 4 has some other shortcomings beyond those inherent in the ultra-high definition format. In my tests, the device had a hard time playing 4K videos smoothly. As I was watching ultra-high definition movies and shows through it, there was a slight stutter every second or so, as if the video was buffering. \nThe stutter, which was most noticeable on panning shots or on scenes where a background or object was constantly moving, was present on videos from different channels. It happened despite the fact that I have a relatively fast Internet connection and the Roku 4 was connected by an Ethernet cable to my router, and so not susceptible to the vagaries of Wi-Fi. And the problem appeared to be with the Roku 4, rather than the television or anything else; when I watched the same videos through the TV's own apps, they played without any stutter. \nAlthough you can't find very many Hollywood-produced 4K videos, there is a large and growing amount of ultra-high definition content available in the form of digital photos and, now, videos shot by smartphones. But this points to another problem with the Roku 4: It doesn't make it easy to get those pictures and videos onto your television screen. \nRoku's smartphone app can't beam 4K videos from the new iPhone 6s to its boxes. And when the app beams pictures from an iPhone or an Android device, it will only send them in high-definition resolution, not in ultra-high definition. You can use an app like Plex to bridge these gaps, but it involves installing extra software on your home computer. \nDon't get me wrong. I'm a big fan of Roku's boxes. They offer lots of channels, and are easy to configure and use. Their universal search feature generally works well at combing numerous channels for particular videos. And I still love the feature the company pioneered that allows you to listen to videos through headphones that you connect to the Roku remote control. \nBut you can get all of those features on the Roku 3 for $30 less than you'd pay for the Roku 4. And you can get most of them on the Roku Streaming Stick for just $50. No, you won't be able to play 4K video through those devices, but there's a good chance you won't notice what you're missing. Contact Troy Wolverton at 408-840-4285 or twolverton@mercurynews.com . Follow him at www.mercurynews.com/troy-wolverton or Twitter.com/troywolv . What: Roku 4Likes: Easy to install and use; offers wide selection of channels; plays 4K videos; special app highlights available 4K movies and television shows; allows users to listen to videos through headphones plugged into remote control; universal search feature combs multiple channels for content.Dislikes: Relatively pricey; only offers six channels with 4K video content; those channels only offer a small proportion of 4K videos; 4K resolution is basically a marketing gimmick, except where TV is very large or placed very close to viewers; 4K video stutters noticeably; lacks way to search for or browse through all available 4K content; Roku's smartphone app can't beam 4K pictures or videos to TV.Price: $130", "external_links": [], "published": "2015-10-24T01:42:00.000+03:00", "crawled": "2015-10-24T02:11:05.013+03:00", "highlightTitle": ""}