{"organizations": [], "uuid": "d82d398ee3ba16cbd2c15c7543ee62e432cf34cc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "savannahnow.com", "main_image": "http://savannahnow.com/sites/default/files/14798510.jpg", "site_section": "http://savannahnow.com/", "section_title": "savannahnow.com | Savannah Georgia's source for News, Entertainment, Sports, Weather, Classifieds, Jobs, Autos, Real Estate and St. Patricks Day", "url": "http://savannahnow.com/sports/2015-10-09/raiders-slow-calvarys-offense-key-3-win-14-3", "country": "US", "title": "Raiders slow Calvary's offense in 14-3 Region 3-A win", "performance_score": 0, "site": "savannahnow.com", "participants_count": 1, "title_full": "Raiders slow Calvary's offense in 14-3 Region 3-A win | savannahnow.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T18:57:00.000+03:00", "replies_count": 0, "uuid": "d82d398ee3ba16cbd2c15c7543ee62e432cf34cc"}, "author": "Dennis Knight", "url": "http://savannahnow.com/sports/2015-10-09/raiders-slow-calvarys-offense-key-3-win-14-3", "ord_in_thread": 0, "title": "Raiders slow Calvary's offense in 14-3 Region 3-A win", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photos Back | Next Josh Galemore/Savannah Morning News - Demetris Robertson of Savannah Christian runs the ball during the Savannah Christian v. Calvary game at the Pooler Stadium. Back | Next Josh Galemore/Savannah Morning News - Johnny Lewis of Savannah Christian runs the ball after intercepting it from Calvary Day school in the first quarter. Back | Next Josh Galemore/Savannah Morning News - Calvary's Alan Gibbs kicks off the ball at their game against Savannah Christian Friday night. Back | Next Josh Galemore/Savannah Morning News - Jalen Leary of Calvary runs the ball at the Calvary v. Savannah Christian game held at the Pooler Stadium. Back | Next Josh Galemore/Savannah Morning News - Calvary Day quarterback Sal Calderon throws under pressure from Neil Maclang during the second quarter Friday night. SPECIAL OFFER FOR NEW READERS 99 cent digital subscription to savannahnow.com\nSubscriber-members get access to ALL our digital products AND become eligible for free event tickets, discount coupons and other benefits. SIGN UP FOR SUBSCRIBER BENEFITS As a Savannah Morning News / savannahnow.com subscriber, you're eligible for members-only discounts. Download your coupons now. By Dennis Knight With his team leading headed into the second half against Calvary Day, Savannah Christian coach Donald Chumley gathered his team and challenged them on the sideline of Pooler Stadium Friday night.\n“We need to play 30 minutes more of Raider football,” Chumley said. “We need to rock their world on this first defensive possession. We can win if we finish — it’s all about heart and who wants it more in the second half.”\nThe Raiders responded to their coach as the defense pitched a shutout after intermission, leading Savannah Christian to a 14-3 victory over Calvary in a critical Region 3-A (East) matchup.\nCalvary Day (5-1, 1-1 in region) entered the game ranked No. 3 in the state among Class A schools by the Georgia Sportswriters Association, while SCPS (5-1, 2-0) was No. 13.\nChumley is known as a defensive mastermind, and his Raider squad followed his game plan well — holding a Calvary rushing attack averaging nearly 300 yards a game to 56 yards rushing and 126 yards of total offense.\n“I couldn’t be more proud of our guys,” Chumley said. “It wasn’t just one player on that defense; it was a total team effort. Everyone stepped up and made plays. We knew a Mark Stroud-coached team like Calvary was going to play physical and fundamental football, and we had to put forth an extra effort to beat them.”\nCalvary couldn’t get its offense in rhythm all night. In the second half, the Raiders forced punts on the first two CD possessions. On the third, safety Ryan Smith stripped the ball away from Calvary quarterback Sal Calderon, and Jack Grusheski recovered the fumble. Late in the fourth quarter, Seth Bruno made an impressive interception to seal the win.\nLinebackers Dylan Harper and Eric Davidson were all over the field, along with Evan Reese. Cornerback Ben Haeussler put on a show with his sure-handed tackling all night.\n“The key was containing the run,” said Haeussler, a senior who also booted a pair of 50-yard punts and caught a pass. “When you do that, it opens up the defense to make more plays. This is the first time we beat them since my freshman year, so it’s a big win for our team. I think the sky is the limit if we prepare and play like we did tonight.”\nSavannah Christian went to work on its ball-control offense on its first possession. The Cavaliers elected to kick off with a short one to keep the ball out of Demetris Robertson’s hands, giving the Raiders solid field position on their own 38-yard line.\nThe Raiders ground it out from there with a 13-play, 68-yard scoring drive that ate seven minutes off the clock.\nJunior A.J. Davis shouldered the load with seven carries for 41 yards on the drive, punching it in from a yard out for the first touchdown of the game. Bryce O’Brien connected on the extra point to give SCPS a 7-0 lead.\nCalvary countered with a long drive of its own as the Cavs marched 80 yards on 18 plays, but the Raider defense toughened up in the red zone and Calvary had to settle for a 26-yard field goal from Alan Gibbs to cut the deficit to 7-3 with 11:00 left in the second quarter.\nSavannah Christian’s standout senior Robertson showed off the skill set that has made him one of the top recruits in the country midway through the second quarter. He took a pitch to the right, and when he couldn’t find an opening he reversed his field, as the Calvary defense tried to keep up with him. Robertson cut back once again and found daylight for a 22-yard run that even had one official shaking his head in amazement.\nBut the Cavaliers made a big stand at the end of the drive, stopping Davis on a fourth and 1 at their own 6-yard line. The SCPS defense responded by buckling down and forcing a three and out.\nThe Raiders got great field position starting their next drive at the Calvary 43-yard line.\nJordan Grant hit Seth Bruno for a 16-yard gain, and Davis and Grant combined for 11 rushing yards on the next two plays.\nThat set up junior Ben Jackson, who was seeing his first action since the first game of the season when he suffered a concussion. Jackson burst up the gut for a 10-yard gain to the 2-yard line and finished it off with a touchdown plunge on the next play as SCPS took a 14-3 lead with 1:53 left in the half. SCPS led 14-3 at halftime.\n“The offensive line had its best game of the year,” said Davis, who rushed for a game-high 61 yards on 16 carries. “Without their work, Ben (Jackson) and Demetris (Robertson) and I wouldn’t be gaining all the yards. We had a bye and worked on this game for two weeks. We executed and won, and that gives us a lot of confidence for the rest of the year.”\nCalvary coach Mark Stroud praised the defensive effort of Savannah Christian.\n“We’ve made our identity running the ball, and credit that defense because they bottled us up tonight,” Stroud said.\nBut he told his team the season was far from over.\n“One game is never going to make or break you,” Stroud told his squad after the loss. “We played with heart and class, and losing hurts, but we have to get over it and get back to work.”\nCD 0 3 0 0 — 3\nSC 7 7 0 0 — 14\nSC-A.J. Davis 1 run (Bryce O’Brien kick)\nCD-Alan Gibbs 26 FG\nSC-Ben Jackson 2 run (O’Brien kick)\nRecords-CD 5-1, 1-1; SCPS 5-1, 2-0", "external_links": ["http://sav-cdn.com/sites/all/themes/whitelabel/images/blank.gif", "http://sav-cdn.com/sites/default/files/imagecache/superphoto/14798509.jpg", "http://sav-cdn.com/sites/default/files/imagecache/superphoto/14798512.jpg", "http://sav-cdn.com/sites/default/files/imagecache/superphoto/14798510.jpg", "http://sav-cdn.com/sites/default/files/imagecache/superphoto/14798508.jpg", "http://sav-cdn.com/sites/default/files/imagecache/story_slideshow_thumb/14798508.jpg", "http://sav-cdn.com/sites/default/files/imagecache/story_slideshow_thumb/14798510.jpg", "http://sav-cdn.com/sites/default/files/imagecache/story_slideshow_thumb/14798512.jpg", "http://sav-cdn.com/sites/default/files/imagecache/superphoto/14798513.jpg", "http://sav-cdn.com/sites/default/files/imagecache/story_slideshow_thumb/14798513.jpg", "http://sav-cdn.com/sites/default/files/imagecache/story_slideshow_thumb/14798509.jpg", "http://sav-cdn.com/sites/all/themes/savannahnow/images/blank.gif"], "published": "2015-10-09T18:57:00.000+03:00", "crawled": "2015-10-10T14:14:22.154+03:00", "highlightTitle": ""}