{"organizations": [], "uuid": "8318fd420da1c8379cb4d7cec5a3c4ccd08da06e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.examiner.com", "main_image": "http://cdn2-b.examiner.com/sites/default/files/styles/image_content_width/hash/60/9b/609bcebf2327699ee460910554ac2371.jpg?itok=kRb2MmoI", "site_section": "http://www.examiner.com/arts-and-entertainment", "section_title": "Arts &amp; Entertainment | Examiner.com", "url": "http://www.examiner.com/article/northern-cal-authors-to-speak-about-their-post-apocalyptic-novel", "country": "US", "title": "Northern Cal authors to speak about their post-apocalyptic novel", "performance_score": 0, "site": "examiner.com", "participants_count": 1, "title_full": "Northern Cal authors to speak about their post-apocalyptic novel | Examiner.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T06:52:00.000+03:00", "replies_count": 0, "uuid": "8318fd420da1c8379cb4d7cec5a3c4ccd08da06e"}, "author": "Steven Rose, Jr.", "url": "http://www.examiner.com/article/northern-cal-authors-to-speak-about-their-post-apocalyptic-novel", "ord_in_thread": 0, "title": "Northern Cal authors to speak about their post-apocalyptic novel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Amazon When it comes to hard science fiction, Northern California is known for best-selling author Kim Stanley Robinson. But there are two newer authors of the subgenre both who are from the Sacramento Area: Louis Evan Grivetti (who, like Robinson, is a Davis resident) and Sargent Thurber Reynolds. They’re latest book is volume one of their “Testing Ground” trilogy, “The Cave”. “The Cave” is set in a post-apocalyptic future but don’t mistake it for another zombie plot. With the exception of its setting, the book is far from the escapist reading of tales involving the living dead. The apocalypse in this story is caused by the fall of Earth’s economic system and the computer networks it is dependent on, as “The Davis Enterprise” implies. The force behind this fall is a computer-hacking terrorist. Grivetti and Reynolds will talk about their book on Oct. 16, 7:30 p.m. at The Avid Reader, 617 Second Street in Davis.\n“The Cave” apparently starts out as a space opera in that an expedition searches for an inhabitable planet similar to its home world. We learn of the details of the cause for the fall of Earth’s civilization through a flashback that spans a huge portion of the novel . While the expedition is exploring a planet, they discover records in a cave that tells about an entire society that lived there but apparently became extinct.\nThe scientific phenomenon in the novel should be very convincing. Both authors have scientific backgrounds. Grivetti, a professor of Nutrition at UC Davis, holds a Master’s in paleontology and a Ph.D. in geography . Reynolds, who worked as a technician for Valley Toxicology of West Sacramento, holds a Master’s in geology . So the educational and professional backgrounds of the two authors should give a lot of weight to the setting and events of “The Cave”.\n“The Cave” was released back in July. It was published by EditPros LLC and is the authors’ first collaboration together, as the “Enterprise” indicates.", "external_links": ["http://www.davisenterprise.com/local-news/local-authors-present-debut-science-fiction-novel/", "http://www.amazon.com/exec/obidos/ASIN/1937317218"], "published": "2015-10-10T06:52:00.000+03:00", "crawled": "2015-10-10T09:06:13.189+03:00", "highlightTitle": ""}