{"organizations": [], "uuid": "8258509eda473b2fbaec2fdab1ca7b0993436e72", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266353/arts-entertainment-television", "section_title": "Arts &amp; Entertainment: Television - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30293425/best-drug-rehabilitation-sponsors-a-taste-of-nashville-at-peck-fest-2015", "country": "US", "title": "Best Drug Rehabilitation Sponsors A Taste of Nashville at Peck Fest 2015", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Best Drug Rehabilitation Sponsors A Taste of Nashville at Peck Fest 2015 - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T17:11:00.000+03:00", "replies_count": 0, "uuid": "8258509eda473b2fbaec2fdab1ca7b0993436e72"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30293425/best-drug-rehabilitation-sponsors-a-taste-of-nashville-at-peck-fest-2015", "ord_in_thread": 0, "title": "Best Drug Rehabilitation Sponsors A Taste of Nashville at Peck Fest 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Supporting rising country music acts and spreading awareness about addiction and recovery, Best Drug Rehabilitation visits Point Pleasant, WV for Peck Fest 2015.\nPoint Pleasant, WV (PRWEB) October 19, 2015\nOn September 4th-5th, 2015, the “Taste of Nashville” Tour visited the Kanawha River Campground in Point Pleasant, WV for Peck Fest 2015, featuring many rising stars and well-known country music performers. Always working to raise awareness about addiction and the many treatment options available to those struggling with drug abuse or alcoholism, Best Drug Rehabilitation was proud to sponsor this two-day music festival.\n“Our entire treatment program focuses on uncovering and addressing the underlying factors that may be causing a person’s addictive behaviors,” commented Best Drug Rehabilitation founder Per Wickstrom. “Part of that comes with finding healthy and positive alternatives to substance abuse. Our music therapy program is one of the more popular options that we offer to our patients, and we encourage musical expression as a productive method of remaining drug and alcohol free. By showing our support at Peck Fest 2015, we hope to demonstrate that life can be successful and fun without using substances, and that recovery from addiction, through music and other avenues, is possible.”\nBest Drug Rehabilitation took the opportunity to speak with several of the Peck Fest performers over the course of the weekend, discussing their experiences with substance abuse, whether through personal issues or through witnessing a close friend or relative struggle with addiction, and their viewpoints on treatment and recovery.\n“There’s so many opportunities out there for everyone in the world,” observes Tom Dixon, who has won several awards, including “Country Act of the Year” at the 2013 New England Music Awards, a fan nominated and voted award. “Even if you’ve had a problem (with addiction) at some point in your life, it doesn’t mean it’s over. You have an opportunity to change that and you have to want to do that.”\nJared Elledge, half of the duo that makes up Double Barrel, says, “Go be addicted to something positive. If you want to make nutcrackers for a living, be the best at it. If you want to be a musician, be the best musician you can be. Make that your drug.”\nA highlight video featuring performance footage and interview clips from the musicians has been released on the Best Drug Rehabilitation YouTube channel.\n //www.prweb.com/releases/best-drug-rehabilitation/sponsors-peck-fest/prweb13027103.htm\n ", "external_links": ["http://www.prweb.com/releases/best-drug-rehabilitation/sponsors-peck-fest/prweb13027103.htm"], "published": "2015-10-19T17:11:00.000+03:00", "crawled": "2015-10-19T16:49:09.403+03:00", "highlightTitle": ""}