{"organizations": [], "uuid": "78f5081e996a9835c28a025144cd7a1c072ef600", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.myjoyonline.com", "main_image": "http://photos.myjoyonline.com/photos/news/201510/7571927391096_136301068123.jpg", "site_section": "http://www.myjoyonline.com/pages/rss/site_entertainment.xml", "section_title": "Ghana Entertainment HomePage", "url": "http://www.myjoyonline.com/entertainment/2015/October-1st/im-not-married-because-i-dont-have-time-flavour-nabania.php", "country": "US", "title": "I’m not married because I don’t have time - Flavour N'abania", "performance_score": 0, "site": "myjoyonline.com", "participants_count": 0, "title_full": "I’m not married because I don’t have time - Flavour N'abania", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T08:10:00.000+03:00", "replies_count": 0, "uuid": "78f5081e996a9835c28a025144cd7a1c072ef600"}, "author": "", "url": "http://www.myjoyonline.com/entertainment/2015/October-1st/im-not-married-because-i-dont-have-time-flavour-nabania.php", "ord_in_thread": 0, "title": "I’m not married because I don’t have time - Flavour N'abania", "locations": ["Ghana"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ernest Dela Aglanu"], "text": "Source: Ghana | Myjoyonline.com | Ernest Dela Aglanu (Twitter: @delaXdela / Instagram: citizendela) Date: 01-10-2015 Time: 05:10:32:pm Flavour N'abania \nNigerian music star Chinedu Okoli, better known on stage as Flavour N'abania has no plans of marrying any time soon because he has no time for it. \nBeing famous for doing music for the ladies, one may think that Flovour would have settled down with one. But no. \nEven with his appealing physique, unique style of singing and dancing and the fact that ladies across Africa love his music, the ‘Ada Ada’ hit singer, says his busy schedule will not allow him time for his wife and kids. \nSpeaking in an exclusive interview with Myjoyonline.com, Flavour said “Marriage is a serious thing. It’s a decision that when you make its like you are in it or you are not so you don’t need to make the wrong decision. That’s the most important thing.” \n“For me, I want to give myself time I don’t want to rush into marriage,” he said during an interview at the 2015 MultiChoice Africa Content Showcase in Mauritius. \n“If you want to marry,” for marrying sake “then it doesn’t make sense. You are not defining marriage and because of the kind of job we do, I hardly stay at home so where I’m going to have the time to give my family? So it is very difficult” , Flavour noted. \n“If I was maybe a banker, a CEO of a company or some kind of job it would be very easy,” because I would have just gone to work and return to my family every day. \n“For almost two months now I have not been home so if I had a wife…what will be expected of me? That means I can’t go to work, I have to think about them because I can’t leave them lonely like that,” Flavour added. \nFlavour, 31, says his songs are specifically designed for the ladies. \n“The ladies, they like anything attractive, don’t take it away from them; your music, your style, everything [and] your name. So if you are doing something attractive, they will all want to support you because they have that thing in them.” \nMale musicians, he noted, are supposed to be appealing to the ladies while the female musicians appeal to the males. \n\nFowllow me on Twitter: @delaXdela and Instagram: citizendela", "external_links": [], "published": "2015-10-01T08:10:00.000+03:00", "crawled": "2015-10-02T05:42:14.899+03:00", "highlightTitle": ""}