{"organizations": [], "uuid": "7442d87a2f8fb6caeabef53447aa4ee43fe31cb2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.northjersey.com", "main_image": "http://www.northjersey.com:80/polopoly_fs/1.1423760!/fileImage/httpImage/100215-f-sicario-bd-50p.jpg", "site_section": "http://www.northjersey.com/cmlink/arts-and-entertainment-rss.rss", "section_title": "Arts and Entertainment on NorthJersey.com", "url": "http://www.northjersey.com/arts-and-entertainment/movies/trying-to-hold-the-line-in-the-war-on-drugs-1.1423759", "country": "US", "title": "Movie review: 'Sicario'", "performance_score": 0, "site": "northjersey.com", "participants_count": 0, "title_full": "Movie review: 'Sicario'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T08:21:00.000+03:00", "replies_count": 0, "uuid": "7442d87a2f8fb6caeabef53447aa4ee43fe31cb2"}, "author": "", "url": "http://www.northjersey.com/arts-and-entertainment/movies/trying-to-hold-the-line-in-the-war-on-drugs-1.1423759", "ord_in_thread": 0, "title": "Movie review: 'Sicario'", "locations": ["Benicio Del Toro", "Texas"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Josh Brolin"], "text": "Emily Blunt, Josh Brolin (center, left) and Benicio Del Toro (right) team up on a drug raid in Texas in \"Sicario.\" \n**** \nR, 121 minutes \n(for strong violence, grisly images and language) \nDirected by Denis Villeneuve. Produced by Basil Iwanyk, Thad Luckinbill, Trent Luckinbill, Edward McDonnell and Molly Smith. Written by Taylor Sheridan. \nWith Emily Blunt, Josh Brolin and Benicio Del Toro. \nWhen we talk about \"the war on drugs,\" there’s an implication that two clearly established armies are engaged in battle and eventually one will prevail. \nNonsense. The war is over and drugs won, and now we’re just trying to prevent the fire from consuming us. As one of the key players in \"Sicario\" so bluntly puts it, as long as tens of millions of Americans want to inhale and snort illegal drugs and they don’t really care about the chain of supply and what it entails, the best law enforcement can do is work to slow down the tide, target some of the most heinous drug lords and try to keep the violence from escalating to even more horrific levels. \nDenis Villeneuve’s \"Sicario\" is an extreme, brutal, complex and sometimes sickeningly violent story of its time, one of the best movies about the dominance of drugs in our culture since Steven Soderbergh’s \"Traffic\" (2000). It’s an unusual mix of big-picture issues, grindhouse pulp and pure, rough entertainment, bolstered by one of the better ensemble casts of the year. This movie is not, um, fussing around. \nBenicio Del Toro won best supporting actor for \"Traffic\" and it was a well-deserved honor, but I admire his work in \"Sicario\" even more. It’s maybe the most memorable turn of its kind since Javier Bardem’s work in \"No Country for Old Men.\" \nNot that you should assume Del Toro’s Alejandro is a villain. We’re deep into the abyss before his true colors are revealed. \nThe purest character in this sometimes murky story is Emily Blunt’s Kate, a young but field-tested and well-respected FBI agent working in the Southwest near the border. Busting drug houses and tracking down kidnap victims, Kate is resolute in her mission. But as Kate and her partner, Reggie (a very good Daniel Kaluuya), are reminded during a raid on a house in a seemingly quiet subdivision in Arizona that goes wrong in shocking fashion, they’re working but a tiny patch of turf in the ongoing struggle against drugs. And as one of their own superiors says, with all respect, are they really making even the slightest difference? \nEnter Josh Brolin’s Matt, who dresses like an aging jock on vacation in Hawaii, calls himself an \"adviser\" to the Department of Defense and seems to carry an enormous amount of clout when he visits Kate’s home office. \nMatt offers Kate an opportunity to jump into the deep end of the pool with the big boys: She can join his team on a mission to Texas that hopefully will lead them to the doorstep of one of the biggest and most brutal drug lords in Mexico. \nAlso along for the trip: Del Toro’s Alejandro, who’s even more difficult to peg than Matt. Alejandro says he was once a prosecutor and now he’s an associate of Matt’s, and he looks like he’s always hung over, but even when he’s sleeping, you feel as if you don’t want to mess with him. \nThe trip to Texas turns out to be more than a trip to Texas, leading to one of the most impressively choreographed and tense extended shootout scenes since Michael Mann’s \"Heat.\" It’s breathtakingly good filmmaking, and it strikes us to the very bone, illustrating in bloody fashion the complex, overwhelming and insanely dangerous world Kate now inhabits. Even as a tough FBI agent, she’s literally shaken. \nKate’s smart. It doesn’t take her long to figure out she’s in over her head, and these shadowy figures are using her because they need an FBI agent on the scene to cover their tracks legally and stay within the boundaries of the law — or at least create the appearance of staying within the boundaries of the law. \nAs was the case with the best recent movies about \"traditional\" military wars, e.g., \"Zero Dark Thirty\" and \"The Hurt Locker\" and \"American Sniper,\" with \"Sicario\" we are often in the gray zone. How much moral and ethical compromise is acceptable to achieve someone’s vision of a greater good? \nWe experience \"Sicario\" mostly through Kate’s eyes, literally and otherwise, and Blunt gives one of the great performances of the year, whether she’s utterly in command of a raid, challenging the \"spooks\" who seem to be fighting a war with almost no rules, or stunned by betrayal. With \"Edge of Tomorrow\" and now this role, Emily Blunt is an action movie star, and how about that. \nBrolin is casually great. And then there’s Del Toro, who lurks about the fringes for most of the story, and then springs into action in a handful of scenes in a variety of ways that will leave you shaken — and grateful to have seen such beautifully dark work. \nThis is one of the best movies of the year.  ", "external_links": [], "published": "2015-10-02T08:21:00.000+03:00", "crawled": "2015-10-02T11:34:36.272+03:00", "highlightTitle": ""}