{"organizations": [], "uuid": "ffff975d818ba3567d92fc5284a4cf0949a771f6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailynewsen.com", "main_image": "", "site_section": "http://www.dailynewsen.com/./entertainment", "section_title": "Entertainment News | Breaking News &amp; Headlines", "url": "http://www.dailynewsen.com/entertainment/verizon-chases-millennials-with-new-mobile-video-service-38396.html", "country": "US", "title": "Verizon chases millennials with new mobile video service", "performance_score": 0, "site": "dailynewsen.com", "participants_count": 1, "title_full": "Verizon chases millennials with new mobile video service | Breaking News & Headlines", "spam_score": 0.0, "site_type": "news", "published": "2015-09-20T06:34:00.000+03:00", "replies_count": 0, "uuid": "ffff975d818ba3567d92fc5284a4cf0949a771f6"}, "author": "Graham Finley", "url": "http://www.dailynewsen.com/entertainment/verizon-chases-millennials-with-new-mobile-video-service-38396.html", "ord_in_thread": 0, "title": "Verizon chases millennials with new mobile video service", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Verizon is mad for millennials.\n“We’re generally skating to wherever the puck is going,” CEO Lowell McAdam told attendees at Goldman Sachs’ Communacopia media conference on Thursday. And the puck Verizon’s chasing suitable now is 18-to-34 year-olds.\nExhibit A from the telecom is Go90, a absolutely free app introduced this month that Verizon calls its “mobile-initial video service.”\nMcAdam, who’s clearly taken with Go90 regardless of becoming outside the target demo, mentioned the skinny OTT bundle has content material especially curated for millennials.\nThis means “snackable content” from Verizon-owned Huffington Post, some half-hour and hour shows developed by Vice and other people that’s delivered a la Netflix, and some sports, including live NFL games.\nAdd to this mix some exclusive content from DreamWorks Animation and a feature called “cuts,” which allows app customers to snip a clip from a video on Go90 and transmit it to good friends. Verizon knows millennials like to share that way.\n“It’s not only the form of content but how you interact with the content material,” McAdam stated.\nThe app will not go live until the end of the month, even though 25,000 Verizon prospects have currently downloaded Go90 for some requisite road-testing.\nThe shift toward millennial media isn’t totally at the expense of Verizon Fios, as McAdam stated the firm will show development in each areas. But he also left no doubt that, at Verizon, the fiber-optic network that delivers cable-like bundles has taken a backseat to mobile video.\nThe transition is in some ways upsetting Verizon’s workforce, members of which picketed outdoors the hotel where McAdam gave his presentation.\nWhen asked about the protesters, the CEO told The Post that Verizon has usually “focused on personnel maintaining superior jobs and expanding their jobs.” But with so lots of regulatory adjustments afoot, which includes the Reasonably priced Care Act, he called it essential to rethink benefits.\nBut after that is done, McAdam mentioned, “I’m confident our employees will be in the upper echelon in wages and in rewards.”\n ", "external_links": ["http://nypost.com/2015/09/17/verizon-chases-millennials-with-new-mobile-video-service/"], "published": "2015-09-20T06:34:00.000+03:00", "crawled": "2015-10-19T10:09:54.199+03:00", "highlightTitle": ""}