{"organizations": [], "uuid": "21ad4be801535f4bf6ebd574c1c28e67f68a07ae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pnj.com", "main_image": "http://www.gannett-cdn.com/-mm-/24bb01f4e1b5ba3ef7ffeecc25de1ccb6852f961/c=0-20-4199-2392&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/10/11/Pensacola/Pensacola/635801843288619970-Greek-Fest-Sunday-4.jpg", "site_section": "http://rssfeeds.pnj.com/pensacola/entertainment", "section_title": "Pensacola - Entertainment", "url": "http://www.pnj.com/story/news/2015/10/12/weekend-photos/73810896/", "country": "US", "title": "The weekend in photos", "performance_score": 0, "site": "pnj.com", "participants_count": 0, "title_full": "The weekend in photos", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T17:35:00.000+03:00", "replies_count": 0, "uuid": "21ad4be801535f4bf6ebd574c1c28e67f68a07ae"}, "author": "", "url": "http://www.pnj.com/story/news/2015/10/12/weekend-photos/73810896/", "ord_in_thread": 0, "title": "The weekend in photos", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The weekend in photos From staff reports, pnj.com 9:35 a.m. CDT October 12, 2015 Kostas Kastanis performs for the crowd Sunday during the 56th annual Greek Festival at the Annunciation Greek Orthodox Church. (Photo: John Blackie/jblackie@pnj.com) 5 CONNECT TWEET LINKEDIN COMMENT EMAIL MORE \nThere was plenty to do this weekend. Here's a recap in photos. \n56th Annual Pensacola Greek Festival Kostas Kastanis plays his buzuki instrument behind his head at the 56th annual Greek Festival of Pensacola as the music entices members of the audience to join in and dance around him Saturday afternoon at the Annunciation Greek Orthodox Church. Bruce Graner/bgraner@pnj.com Tara Utsey listens as her children, Ethan Utsey, 10, and Sophia Utsey, 6, make suggestions as to which pastries they'd like to try Saturday afternoon at the 56th annual Annunciation Greek Orthodox Church Greek Festival of Pensacola. Bruce Graner/bgraner@pnj.com Audience members dance around musician Kostas Kastanis as he plays his buzuki instrument for them at the 56th annual Greek Festival of Pensacola held at the Annunciation Greek Orthodox Church Saturday. The event continues through 6PM Sunday. Bruce Graner/bgraner@pnj.com Members of the Glentzethes dance group perform Saturday afternoon at the 56th annual Greek Festival of Pensacola. Bruce Graner/bgraner@pnj.com Fullscreen Liz Gilmore, an instructor for the Hara Greek dance group encourages her dancers during their performance at the 56th annual Greek Festival of Pensacola Saturday afternoon at the Annunciation Greek Orthodox Church. She is shown holding her daughter, Angela Gilmore, 4. Bruce Graner/bgraner@pnj.com At the 56th annual Greek Festival of Pensacola (l-r) Marcia Edwards Speros Athanasios and Annette Wiechert hustle in the kitchen at the Annunciation Greek Orthodox Church trying to keep up with the demand for spanakopita. Bruce Graner/bgraner@pnj.com Hungry visitors to the 56th annual Greek Festival of Pensacola line up to sample some of the Greek food being served Saturday at the event being held through the weekend at the Annunciation Greek Orthodox Church. Bruce Graner/bgraner@pnj.com Audience members watch the Glentzethes dance group perform Saturday at the 56th annual Greek Festival of Pensacola. Bruce Graner/bgraner@pnj.com Members of the Glentzethes dance group perform Saturday afternoon at the 56th annual Greek Festival of Pensacola. Bruce Graner/bgraner@pnj.com Chance Szot, 8, watches as Greek pastries are served up Saturday afternoon at the 56th annual Greek Festival of Pensacola that he was attending with family members. The festival continues through Sunday. Bruce Graner/bgraner@pnj.com Fullscreen Members of the Hara dance group perform Saturday at the 56th annual Greek Festival of Pensacola event being held through the weekend. Money is often stuffed into the clothing of the dancers as they perform by members of the audience as a way to show their appreciation. Bruce Graner/bgraner@pnj.com Members of the Glentzethes dance group perform Saturday afternoon at the 56th annual Greek Festival of Pensacola. Bruce Graner/bgraner@pnj.com An order of Greek pastries is prepared for a vistor to the 56th annual Greek Festival of Pensacola Saturday afternoon. Bruce Graner/bgraner@pnj.com Members of the Glentzethes dance group perform Saturday afternoon at the 56th annual Greek Festival of Pensacola. The festival continues through Sunday. Bruce Graner/bgraner@pnj.com Fullscreen Members of the Hara dance group perform Saturday at the 56th annual Greek Festival of Pensacola event being held through the weekend. Money is often stuffed into the clothing of the dancers as they perform by members of the audience as a way to show their appreciation. Bruce Graner/bgraner@pnj.com Michael Minton delivers another tray of cheese cake baklava Saturday afternoon at the 56th annual Greek Festival of Pensacola. Bruce Graner/bgraner@pnj.com Like this topic? You may also like these photo galleries: Replay Katlyn Cole, Kalli Gilmore and Auna Arrndondo of the dance group Hana, watch the Glentzethes dance group Sunday during the 56th annual Greek Festival at the Annunciation Greek Orthodox Church. John Blackie/jblackie@pnj.com Visitors get a tour of the church Sunday during the 56th annual Greek Festival at the Annunciation Greek Orthodox Church. John Blackie/jblackie@pnj.com Visitors enjoy the entertainment Sunday during the 56th annual Greek Festival at the Annunciation Greek Orthodox Church. John Blackie/jblackie@pnj.com Kostas Kastanis performs for the crowd Sunday during the 56th annual Greek Festival at the Annunciation Greek Orthodox Church. John Blackie/jblackie@pnj.com Kostas Kastanis performs Sunday during the 56th annual Greek Festival at the Annunciation Greek Orthodox Church. John Blackie/jblackie@pnj.com Nina Staviski,center, of the Glentzethes dance group, performs for the crowd Sunday during the 56th annual Greek Festival at the Annunciation Greek Orthodox Church. John Blackie/jblackie@pnj.com The dance group Hana, perfoms for the crowd Sunday during the 56th annual Greek Festival at the Annunciation Greek Orthodox Church. John Blackie/jblackie@pnj.com Like this topic? You may also like these photo galleries: Replay Last Slide Next Slide \nLifeguards say goodbye to another season Getting ready to shut down their lifeguards stations for the year Pensacola Beach lifeguards pack up their chairs and other belonings and wait for one of the pickup truck to help them in with all their stuff for their final day of the Pensacola Beach 2015 season. Bruce Graner/bgraner@pnj.com One of the Pensacola Beach lifeguards in tower four prepares to close up his lifeguard stand for the last time this year as the lifeguards ended their 2015 season Sunday afternoon. Bruce Graner/bgraner@pnj.com Fullscreen The Pensacola Beach lifeguards of station No. 3 keep a watch on the few swimmer in the water late Sunday afternoon as the final seconds of their 2015 season tick away. Collection and storage of their lifeguard towers will start Monday morning. Bruce Graner/bgraner@pnj.com The lifeguards of lifeguard tower No. 3 pack of their belongings and shut down the tower for the last time of the 2015 season Sunday afternoon. The tower will be collected for storage until next year starting Monday. Bruce Graner/bgraner@pnj.com Fullscreen With their lifegaurd tower No. 3 closed up Pensacola Beach lifeguards carry their rescue boards back to the public safety building on Pensacola Beach for storage for the final time of the 2015 beach season. Starting Monday morning the lifeguard towers will be picked up and put into storage until the 2016 beach season. Bruce Graner/bgraner@pnj.com Fullscreen Pensacola Beach lifeguards bring in their gear from their lifeguard towers on Pensacola Beach for the final time this year as their season drew to a close Sunday. The lifeguard towers will be removed from Pensacola Beach starting tomorrow until they are needed for the 2016 season. Bruce Graner/bgraner@pnj.com Pensacola Beach lifeguards place their equipment into storage for the last time for the 2015 season Sunday evening until it is needed again for the 2016 Pensacola Beach season. Bruce Graner/bgraner@pnj.com Fullscreen Pensacola Beach lifeguards unpack their trucks and bring in their rescue gear and other equipment for the last time Sunday evening as their 2015 beach season came to an end. Lifeguard towers will start to be removed from the beach Monday morning until needed for the 2016 beach season. Bruce Graner/bgraner@pnj.com Fullscreen Pensacola Beach lifeguards unpack their trucks and bring in their rescue gear and other equipment for the last time Sunday evening as their 2015 beach season came to an end. Lifeguard towers will start to be removed from the beach Monday morning until needed for the 2016 beach season. Bruce Graner/bgraner@pnj.com Pensacola Beach lifeguard Grant Bridges hoses salt off the vehicles used by the lifegaurds before they are put in storage or taken off the beach. The 2015 beach season for the lifeguards ended Sunday evening. Bruce Graner/bgraner@pnj.com Dave Greenwood, right, the new water safety supervisor for Pensacola Beach, takes a group photo of his lifeguards as they wrapped up their 2015 beach season Sunday evening before taking a final celebratory plunge of the Pensacola Beach Gulf Pier. Bruce Graner/bgraner@pnj.com Like this topic? You may also like these photo galleries: Replay \nSoul Bowl \nEnsley Chief's Nathaniel Lyons Jr. runs down field Saturday during the Soul Bowl at Blue Wahoos Stadium. John Blackie/jblackie@pnj.com Pensacola Tigers' Jaylen Glover runs down field agaunst the Ensley Chiefs Saturday during the Soul Bowl at Blue Wahoos Stadium. John Blackie/jblackie@pnj.com Ensley Chiefs' Byron Jones Jr. looks for a reciever down field during play against the Pensacola Tigers Saturday during the Soul Bowl at Blue Wahoos Stadium. John Blackie/jblackie@pnj.com Pensacola Tigers' Brandon Bonner Jr. runs down field against the Ensley Chiefs Saturday during the Soul Bowl at Blue Wahoos Stadium. John Blackie/jblackie@pnj.com Ensley Chiefs' and Pensacola Tigers' go after a fumble Saturday during the Soul Bowl at Blue Wahoos Stadium. John Blackie/jblackie@pnj.com Ensley Chiefs' Byron Jones Jr. runs up the mddle during play against the Pensacola Tigers Saturday during the Soul Bowl at Blue Wahoos Stadium. John Blackie/jblackie@pnj.com Pensacola Tigers' Zeky Watson runs down field against the Ensley Chiefs Saturday during the Soul Bowl at Blue Wahoos Stadium. John Blackie/jblackie@pnj.com Ensley Chiefs' cheerleaders cheer on their team during play against the Pensacola Tigers Saturday during the Soul Bowl at Blue Wahoos Stadium. John Blackie/jblackie@pnj.com Ensley Chiefs' Tanner Vaughn runs down field Saturday during the Soul Bowl at Blue Wahoos Stadium. John Blackie/jblackie@pnj.com Pat Robertson cheers on the Rattlers Saturday during the Soul Bowl at Blue Wahoos Stadium. John Blackie/jblackie@pnj.com The East Pensacola Rattlers hit the field Saturday during the Soul Bowl at Blue wahoos Stadium. John Blackie/jblackie@pnj.com East Pensacola Rattlers' La'Tahj McGraw runs down field agaisnt the Pensacola Tigers Saturday during the Soul Bowl at Blue Wahoos Stadium. John Blackie/jblackie@pnj.com East Pensacola Rattlers' Tyqwan Stabler runs runs in for the touchdown agaisnt the Pensacola Tigers Saturday during the Soul Bowl at Blue Wahoos Stadium. John Blackie/jblackie@pnj.com East Pensacola Rattlers' Greg Carter runs runs in for the touchdown agaisnt the Pensacola Tigers Saturday during the Soul Bowl at Blue Wahoos Stadium. John Blackie/jblackie@pnj.com Pensacola Tigers' Jiquez Minor runs down field agaunst the East Pensacola Rattlers Saturday during the Soul Bowl at Blue Wahoos Stadium. John Blackie/jblackie@pnj.com Coaches and dignitaries gather for the Unity Ceremony Saturday during the Soul Bowl at Blue Wahoos Stadium. John Blackie/jblackie@pnj.com Former NFL defensive tackle Fred Robbins speaks during the Unity Ceremony Saturday during the Soul Bowl at Blue Wahoos Stadium. John Blackie/jblackie@pnj.com Football fans check out the action Saturday during the Soul Bowl at Blue Wahoos Stadium. John Blackie/jblackie@pnj.com Like this topic? You may also like these photo galleries: Replay \nWounded Warrior Fishing Rodeo \nWounded Warrior Anglers The Kingfish Brigade volunteer Ted Corbin, holds a fish caught by Michael Dixon Saturday during the Wounded Warrior Anglers and The Health Center of Pensacola Cast back to Big Brothers and Big Sisters fishing rodeo at Plaza De Luna. John Blackie/jblackie@pnj.com Young anglers try their luck at fishing Saturday during the Wounded Warrior Anglers and The Health Center of Pensacola Cast back to Big Brothers and Big Sisters fishing rodeo at Plaza De Luna. John Blackie/jblackie@pnj.com Young anglers get their fishing poles ready Saturday during the Wounded Warrior Anglers and The Health Center of Pensacola Cast back to Big Brothers and Big Sisters fishing rodeo at Plaza De Luna. John Blackie/jblackie@pnj.com Cayden Aadnesen fishes for bait Saturday during the Wounded Warrior Anglers and The Health Center of Pensacola Cast back to Big Brothers and Big Sisters fishing rodeo at Plaza De Luna. John Blackie/jblackie@pnj.com Young anglers try their luck at fishing Saturday during the Wounded Warrior Anglers and The Health Center of Pensacola Cast back to Big Brothers and Big Sisters fishing rodeo at Plaza De Luna. John Blackie/jblackie@pnj.com Vivian Smley,8, gets her hook baited by Mike Petty of the U.S. Army, Saturday during the Wounded Warrior Anglers and The Health Center of Pensacola Cast back to Big Brothers and Big Sisters fishing rodeo at Plaza De Luna. John Blackie/jblackie@pnj.com Young anglers try their luck at fishing Saturday during the Wounded Warrior Anglers and The Health Center of Pensacola Cast back to Big Brothers and Big Sisters fishing rodeo at Plaza De Luna. John Blackie/jblackie@pnj.com Like this topic? You may also like these photo galleries: Replay Last Slide Next Slide \n3rd annual Women's Day Out The 3rd annual Women's Day Out event, featuring a panel of medical experts as shown in this photo, was held Saturday in the atrium of the National Museum of Naval Aviation. Bruce Graner/bgraner@pnj.com Melissa Stockwell was the featured speaker for the 3rd annual Women's Day Out event held Saturday at the National Museum of Naval Aviation. Melissa lost her leg from an IED while serving with the U.S. Army in Iraq. Bruce Graner/bgraner@pnj.com Fullscreen Melissa Stockwell, who lost a leg while serving with the U.S. Army in Iraq, was the featured speaker Saturday for the 3rd annual Women's Day Out event that took place in the atrium of the National Museum of Naval Aviation. Stockwell spoke on the obstacles she's overcome in her recovery and how viewing obstacles as challenges has helped her achieve more than she thought possible when she was first injured. Bruce Graner/bgraner@pnj.com Audience members attending the 3rd annual Women's Day Out listen to one of the speakers during the event held Saturday at the National Museum of Naval Aviation. Bruce Graner/bgraner@pnj.com Dr. Lisa Tucker, far right, was the moderator for the medical panel of experts particpating in the 3rd annual Women's Day Out event held Saturday in the atrium of the National Museum of Naval Aviation. Bruce Graner/bgraner@pnj.com Lt. Minday Paturzzio, pharmacist at the Naval Hospital Pensacola, third from right, answers a question from audience members attending the 3rd annual Women's Day Out event being held at the National Museum of Naval Aviation Saturday morning. Bruce Graner/bgraner@pnj.com Melissa Stockwell was the featured speaker for the 3rd annual Women's Day Out event held Saturday at the National Museum of Naval Aviation. Melissa lost her leg from an IED while serving with the U.S. Army in Iraq. Bruce Graner/bgraner@pnj.com Members of the audience were able to come forward and ask questions of the medical panel assembled for the 3rd annual Women's Day Out event held Saturday at the National Museum of Naval Aviation. Bruce Graner A fashion show was part of the 3rd annual Women's Day Out event held Saturday at the National Museum of Naval Aviation. Bruce Graner/bgraner@pnj.com Fullscreen A fashion show was part of the 3rd annual Women's Day Out event held Saturday at the National Museum of Naval Aviation. Here an member of the audience is shown taking pictures of the models as they wait their turn to appear before the rest of the audience. Bruce Graner/bgraner@pnj.com A fashion show was part of the 3rd annual Women's Day Out event held Saturday at the National Museum of Naval Aviation. Bruce Graner/bgraner@pnj.com A fashion show was part of the 3rd annual Women's Day Out event held Saturday at the National Museum of Naval Aviation. Bruce Graner/bgraner@pnj.com A slide show narrated by featured speaker Melissa Stockwell showed the bomb-damaged vehicle she was riding in that caused her to lose her left leg while serving in the U.S Army in Iraq. Bruce Graner/bgraner@pnj.com Fullscreen Christy Allen receives a standing ovation as the West Florida Hospital RN is recognized as the Frist Humanatarian Employee Winner during the 3rd annual Women's Day Out Saturday morning during the event held at the National Museum of Naval Aviation. JoAnne Pryor, also a West Florida Hospital RN, was recognized with the Excellence in Nursing Award for Compassionate Care. Bruce Graner/bgraner@pnj.com The 3rd annual Women's Day Out event was held Saturday in the atrium of the National Museum of Naval Aviation. Bruce Graner/bgraner@pnj.com Like this topic? You may also like these photo galleries: Replay", "external_links": [], "published": "2015-10-12T17:35:00.000+03:00", "crawled": "2015-10-13T16:04:24.416+03:00", "highlightTitle": ""}