{"organizations": [], "uuid": "dbdcb5e7b082ac9c493711bd3769a798ef213037", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.huffingtonpost.co.uk", "main_image": "http://i.huffpost.com/gen/3554684/images/o-JAY-ALIONA-STRICTLY-facebook.jpg", "site_section": "http://www.huffingtonpost.co.uk/feeds/verticals/uk-entertainment/news.xml", "section_title": "UK Entertainment News on The Huffington Post", "url": "http://www.huffingtonpost.co.uk/2015/10/19/strictly-come-dancing-2015-jay-mcguiness-aliona-vilani-romance-rumours_n_8328896.html", "country": "US", "title": "'Strictly Come Dancing' 2015: Aliona Vilani 'Worried Jay McGuiness Romance Rumours Will Stop Them Winning Show'", "performance_score": 0, "site": "huffingtonpost.co.uk", "participants_count": 1, "title_full": "'Strictly Come Dancing' 2015: Aliona Vilani 'Worried Jay McGuiness Romance Rumours Will Stop Them Winning Show'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T11:01:00.000+03:00", "replies_count": 0, "uuid": "dbdcb5e7b082ac9c493711bd3769a798ef213037"}, "author": "Ashley Percival", "url": "http://www.huffingtonpost.co.uk/2015/10/19/strictly-come-dancing-2015-jay-mcguiness-aliona-vilani-romance-rumours_n_8328896.html", "ord_in_thread": 0, "title": "'Strictly Come Dancing' 2015: Aliona Vilani 'Worried Jay McGuiness Romance Rumours Will Stop Them Winning Show'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Previous Story Next Story 'Strictly Come Dancing' 2015: Aliona Vilani 'Worried Jay McGuiness Romance Rumours Will Stop Them Winning Show'   Ashley Percival \n‘ Strictly Come Dancing ’ professional Aliona Vilani is reportedly worried rumours of a romance between her and partner Jay McGuiness will hamper their chances of winning the show. MORE 'STRICTLY': \nThe pair have been at the centre of reports about their relationship following their show-stopping routines on the BBC ballroom show, despite Aliona being married. \nAliona Vilani and Jay McGuiness \nAccording to The Sun, the pro-dancer is “stressed” out about how the speculation could affect their place in the competition. \nA source told the newspaper: “Aliona really thought she could win again but that is disappearing and she blames the rumours about Jay and her. \n“She denies anything is going on but doesn't help herself by constantly cuddling up to him and flirting. That encourages speculation, which stresses her out and affects her performance.” \nIt was previously reported that Aliona’s husband Vincent Kavanagh was angered her closeness with Jay , resulting in a backstage row between them following filming for the show. \nHowever, former The Wanted singer Jay has insisted that there is nothing going on between him and Aliona, after pictures of the pair hugging outside an awards bash were published. \n“I am single but I didn’t expect to meet someone on ‘Strictly’,” he said. \n“Aliona is happily married to an Irish fellow who I think is a legend. So my eyes won’t wander in our rehearsals.” \nJay and Aliona's routine failed to impress on Saturday \nHowever, they failed to replicate their success on Saturday night (17 October), when a series of errors in their Quickstep routine meant they were awarded just 25 points . \n‘Strictly Come Dancing’ continues on Saturday (24 October) at 6.35pm on BBC One. Close   The 'Countdown' presenter announced her split from her husband just weeks after her stint on the show. Earlier this year, it was confirmed that Rachel and her partner Pasha Kovalev are dating, however, she remains insistent that 'Strictly' had nothing to do with her marriage split. Sunetra split from her husband of 10 years just before filming for the 2014 series began. Susanna's marriage ended in February 2014, weeks after she finished as a runner-up in the competition. Susanna is still living with her ex, Dominic Cotton, and their two children. Flackers and boyfriend Jack Street have called time on their relationship, according to reports. The former 'Xtra Factor' presenter dated the music manager for 18 months. Ben denied rumours that he was romancing his pro partner Kristina Rihanoff, though he later split from his wife Abby days after photos of him and Kristina looking cosy on the tube were posted online. The 'EastEnders' star reportedly first hooked up with Flavia Cacace during their time dancing together on the 2008 series - on which Flavia's boyfriend Vincent Simone was also a dancer. However, they weren't together for long... Just a year after getting together with Matt, Flavia ended the relationship after finding love with her new dance partner Jimi. The couple married in 2013. Boxer Joe and pro dancer Kristina Rihanoff initally denied romance rumours when they were paired together in 2009, however Joe split from his girlfriend just weeks later. Joe and Kristina later confirmed that they were a couple, before splitting after four years together. 'Tracey Beaker' star Dani split from her boyfriend just days after filming began in 2012. Newsreader Natasha and Brendan were plagued by romance rumours when they were paired up for the first ever series of 'Strictly' in 2004. Despite being insistent that they weer just friends, Natasha and Brendan both split from their partners shortly after winning the series.  Share", "external_links": [], "published": "2015-10-19T11:01:00.000+03:00", "crawled": "2015-10-19T12:19:13.969+03:00", "highlightTitle": ""}