{"organizations": ["Masala Padam Movie Review"], "uuid": "66de5ab44d51585de2a4931efd442013b1acaf33", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.filmibeat.com", "main_image": "http://www.filmibeat.com/img/2015/10/09-1444390948-masalapadamreview.jpg", "site_section": "http://www.filmibeat.com/rss/filmibeat-tamil-fb.xml", "section_title": "Filmibeat - Tamil Entertainment", "url": "http://www.filmibeat.com/tamil/reviews/2015/masala-padam-movie-review-and-rating-plot-story-a-peculiar-commercial-flick-201140.html", "country": "CA", "title": "Masala Padam Movie Review & Rating: A Peculiar Commercial Flick!", "performance_score": 0, "site": "filmibeat.com", "participants_count": 0, "title_full": "Masala Padam Movie Review & Rating: A Peculiar Commercial Flick!", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T14:48:00.000+03:00", "replies_count": 0, "uuid": "66de5ab44d51585de2a4931efd442013b1acaf33"}, "author": "", "url": "http://www.filmibeat.com/tamil/reviews/2015/masala-padam-movie-review-and-rating-plot-story-a-peculiar-commercial-flick-201140.html", "ord_in_thread": 0, "title": "Masala Padam Movie Review & Rating: A Peculiar Commercial Flick!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Receive all updates via Facebook. Just Click the Like Button Below Rating: 2.5 /5 \nMasala Padam starring Bobby Simha and Shiva in the lead roles has released today all over Tamil Nadu. Check out our movie review to know what exactly this flick has to offer. Masala Padam (U): Book Your Tickets Right Away! Masala Padam Plot: \nMasala Padam has an interesting plot. The movie starts off with an intention of teaching its audience the history of cinema and how it has evolved over the years. \nThe rest of the film is actually a commercial flick as the title suggests with enough comedy, romance and action to keep its viewers entertained. \nBut cloaked under all the commercialism is an earnest attempt by the director to teach his audience the difficulties involved in fabricating a film keeping the 'general audience' in mind. \nThe events that follows after a group of online reviewers are challenged to come up with an entertaining script of their own by avoiding all the 'cliches' forms the crux of this story. Performances: \nCredible performances are delivered by Shiva whose depiction as a common man looks natural and Bobby Simha who has breezed through his character of a tough yet likeable goon. \nLakshmi Devy too deserves a mention as she plays an important character which has been performed well. Other supporting actors have done justices to their respective roles as well. Technicalities: \nOne thing that stands out throughout the film is its bold and beautiful dialogues which serves as a major plus point. Laxman Kumar's cinematography is solid and also refreshing. \nThough the film has a crisp run time, second half is stretched at places which exposes its editor Richard Kevin. Apart from that the editor's work is quite decent. \nKarthik Acharya's background score is impressive, having said that, his songs do not deserve to be on a music lover's playlist. \nThough director Laxman Kumar has come up with an interesting plot that aims to entertain as well as expose an important fact, his execution could've been much better. Overall View: \nWith an interesting plot and decent screenplay Masala Padam is an honest attempt. But it could've easily been a better flick had it been executed with much more care.", "external_links": [], "published": "2015-10-09T14:48:00.000+03:00", "crawled": "2015-10-09T15:29:46.745+03:00", "highlightTitle": ""}