{"organizations": [], "uuid": "e5712dcd37aad836e3b5c6847c52fff0bcb7125c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "http://images.worldnow.com/AP/images/9065288_G.jpg", "site_section": "http://www.cbs8.com/category/13540/entertainment-news-from-ap", "section_title": "Entertainment: Celebrity gossip and Hollywood news - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30315513/carrie-underwood-has-mom-guilt-about-work-life-balance", "country": "US", "title": "Carrie Underwood has 'mom guilt' about work-life balance", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Carrie Underwood has 'mom guilt' about work-life balance - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "e5712dcd37aad836e3b5c6847c52fff0bcb7125c"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30315513/carrie-underwood-has-mom-guilt-about-work-life-balance", "ord_in_thread": 0, "title": "Carrie Underwood has 'mom guilt' about work-life balance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By KRISTIN M. HALL\nAssociated Press NASHVILLE, Tenn. (AP) - Carrie Underwood is pure poise on the red carpet, on stage and on TV - but she's finding it hard to strike a balance these days, she says.\n\"I think mom guilt is rampant in my life,\" said Underwood, whose son Isaiah was born in February. \"I am sure it is in any mom's... I still constantly wonder, 'Is this fair to him? Is my life fair to him?'\"\nUnderwood, whose new album, \"Storyteller, is out on Oct. 23, knows the exhaustion that comes after being up with a fussy baby all night during album launch week, or the remorse in bidding him goodbye in the morning and knowing she'll be working long after his bedtime.\nAs she sings in \"Smoke Break,\" an ode to the working class that is now in the Top 5 on Billboard's Hot Country Songs chart, it's hard to be a good wife, a good mom and a Christian.\n\"He's my No. 1 priority,\" Underwood said. \"But it's just a question of how am I going to do this?... I'll probably never find the answers to those questions.\"\nWhen she was pregnant and writing songs for \"Storyteller,\" she initially wasn't ready to sing about the joys of motherhood.\n\"I would have writing dates with people and they would come in and push me in that direction,\" Underwood said. \"And I was like, 'Eh, no.' I do not want to write an album of mushy baby songs. Or mommy songs. That is not me.\"\nBut she did co-write \"What I Never Knew I Always Wanted,\" a reflection on the realization that motherhood filled a hole she never knew she had.\n\"I think it had to be my doing to come in with the idea, or I would have resisted forever,\" Underwood said. \"But it ended up being very personal and I think perfect for the album.\"\nThat's just one way that Underwood avoided doing what was expected for her fifth studio album. She worked with a new producer, Jay Joyce, along with her regular producers Mark Bright and Zach Crowell.\nJoyce, who won a CMA Award for producing Eric Church's album \"Chief\" and is nominated this year for Little Big Town's \"Painkiller,\" brought a dark, rock edge to the album.\n\"There's definitely some twang on the album,\" Underwood said. \"That almost makes it super fresh compared to a lot of what is out there right now. It's not old, not old country, but it's more traditional.\"\nUnderwood and Joyce didn't want to make another album like \"Blown Away\" with its dramatic power ballads that showcased her powerful vocal range. Instead she aimed for more subtle but still distinctive singing. She turned on her Oklahoma accent on songs like \"Choctaw County Affair,\" and even rolled her Rs for a little Spanish flair on \"Mexico.\"\n\"She's got so many different facets to her voice,\" Joyce said. \"She's got a really sexy slinky quiet voice, too. She sounds more confident to me.\"\n__\nOnline:\nwww.carrieunderwoodofficial.com\n__\nFollow Kristin M. Hall on Twitter at http://twitter.com/kmhall\n ", "external_links": ["http://twitter.com/kmhall"], "published": "2015-10-21T03:00:00.000+03:00", "crawled": "2015-10-21T17:55:36.249+03:00", "highlightTitle": ""}