{"organizations": [], "uuid": "8a962c301f3fffee9a8924e960b967048a16d386", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.detroitnews.com", "main_image": "http://www.gannett-cdn.com/-mm-/cbc94ded4cd4bf3d281aa6ac7a3bc6555ff8c958/c=0-156-3000-1844&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/01/DetroitNews/B99310679Z.1_20151001210237_000_G23JLBG8.2-0.jpg", "site_section": "https://feeds.feedblitz.com/detroit/entertainment#", "section_title": "Detroit News - Entertainment", "url": "http://www.detroitnews.com/story/entertainment/movies/2015/10/02/movie-review-mississippi-grind-serves-two-kind/73180178/", "country": "US", "title": "Movie review: ‘Mississippi Grind’ serves up two of a kind", "performance_score": 0, "site": "detroitnews.com", "participants_count": 1, "title_full": "Movie review: ‘Mississippi Grind’ serves up two of a kind", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:12:00.000+03:00", "replies_count": 0, "uuid": "8a962c301f3fffee9a8924e960b967048a16d386"}, "author": "detroitnews.com", "url": "http://www.detroitnews.com/story/entertainment/movies/2015/10/02/movie-review-mississippi-grind-serves-two-kind/73180178/", "ord_in_thread": 0, "title": "Movie review: ‘Mississippi Grind’ serves up two of a kind", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ryan Reynolds, right, and Ben Mendelsohn star in “Mississippi Grind.” (Photo: Patti Perret / A24) \nCONNECT TWEET LINKEDIN COMMENT EMAIL MORE Ryan Fleck and Anna Boden’s latest film, “Mississippi Grind,” combines the classic tales of a love story and an odyssey, but features two down-and-out, inveterate gamblers as our heroes.\nGerry (Ben Mendelsohn), is pathetic and miserable, a hopeless gambling addict, drifting until he encounters the smooth-talking shyster Curtis (Ryan Reynolds), who shakes up his whole world. These two men enable the worst in each other, but also find some fellowship and redemption in the relationship, as they make their way from Dubuque, Iowa, to New Orleans on a misguided, haphazard road trip.\nRyan Reynolds’ best roles are the ones that play on his inherently smarmy qualities, and the sketchy Curtis offers up the chance for Reynolds to excel in his performance, with a motor-mouth, dark circles under his eyes, and a rash of bizarre tattoos up one thigh. Curtis’ accent travels up and down the Eastern Seaboard, but this isn’t a failure of performance on Reynolds’ part; in fact it’s a slyly clever bit of character building. Curtis isn’t from anywhere, and he himself is performing this persona of the well-traveled, down-on-his-luck cad.\nReynolds and Mendelsohn could not be more different actors, but in this pairing they are perfect. Their relationship is almost sweet. They look out for each other while simultaneously throwing each other under the bus. The two are extremely selfish addicts who torpedo every relationship they have — particularly with women — but somehow, they keep coming back together, usually at the bar, to order a bourbon. It’s plainly obvious the endless tall tales Curtis spins are bull, but he finds the perfect sidekick in Gerry, who has been hardened by life, but remains gullible, almost naive. He’s a dreamer, and Curtis is too. In each other, they see themselves. For Curtis, Gerry’s shifty existence is an ominous warning sign, but for Gerry, his younger pal embodies the kind of sexy, dangerous adventure he thinks this life could be.\nThere are many allusions to “The Wizard of Oz” in “Mississippi Grind” — the men talk of rainbows, Gerry’s estranged wife is named Dorothy, and they bet on Toto’s Revenge at the racetrack. It’s as if the Scarecrow and the Tin Man got lost and wandered down the Mississippi River, drinking and gambling and stumbling into and out of various troubles, not worrying about their brains or their hearts, just wishing for just a little bit of luck.\nMendelsohn is a heartbreaker in this role. He ranges from insecure loser to wild-eyed mania when the betting bug gets him. There are times when you want grab him and shake him, shouting “no!” as he takes bigger and bigger risks, falling harder and harder. The picture rends your soul, as we desperately want and hope for Curtis and Gerry to make the right choices as they repeatedly do not. At the end of their journey, much like Dorothy’s trip to Oz, at least one of them finds that there’s no place like home, for better or for worse.\n\n‘Mississippi Grind’ \nGRADE: B+ \nRated R for language\nRunning time: 10 48 minutes", "external_links": [], "published": "2015-10-02T03:12:00.000+03:00", "crawled": "2015-10-02T07:23:27.836+03:00", "highlightTitle": ""}