{"organizations": [], "uuid": "de06b8ae2661afdb72e1329d652ce1f5de641b0f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mcall.com", "main_image": "http://www.trbimg.com/img-5629a21f/turbine/la-et-mn-carey-mulligan-20151023", "site_section": "http://www.mcall.com/rss/all-rss-entertainment-movies,0,7968136.hyperlink", "section_title": "Entertainment: Movie News", "url": "http://www.mcall.com/la-et-mn-carey-mulligan-20151023-story.html", "country": "US", "title": "After 'Suffragette,' a private Carey Mulligan makes sure her own voice is heard", "performance_score": 0, "site": "mcall.com", "participants_count": 1, "title_full": "After 'Suffragette,' a private Carey Mulligan makes sure her own voice is heard", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T13:00:00.000+03:00", "replies_count": 0, "uuid": "de06b8ae2661afdb72e1329d652ce1f5de641b0f"}, "author": "Amy Kaufman", "url": "http://www.mcall.com/la-et-mn-carey-mulligan-20151023-story.html", "ord_in_thread": 0, "title": "After 'Suffragette,' a private Carey Mulligan makes sure her own voice is heard", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "After 'Suffragette,' a private Carey Mulligan makes sure her own voice is heard After ‘Suffragette,’ a private Carey Mulligan makes sure her own voice is heard Brian van der Brug / Los Angeles Times \nCarey Mulligan Amy Kaufman Contact Reporter \nWhen you think of Carey Mulligan, what comes to mind? \nPerhaps that she's one of the finest actresses of the millennial generation, the kind who gets Oscar and Tony nominations and works with Meryl Streep. Or that she's delicate and British — the kind of lithe figure who looks at home in a Vogue spread, knee-deep in the tall grass of the English countryside. (Kenneth Turan) \n\"Dull?\" Mulligan herself suggests. \"I don't think there's a moniker next to my name of some personality trait.\" \nWhich is exactly how she wants it. While Jennifer Lawrence shares stories about her intestinal distress with late-night talk-show hosts and Shailene Woodley espouses the virtues of eating clay, Mulligan is uninterested in offering up quirky personal tidbits so as to appear relatable. As a result, she's a bit at odds with a culture that demands its actors use social media or develop a lifestyle brand. \nFive weeks ago, for example, she gave birth to her first daughter with her husband, Marcus Mumford of Mumford and Sons. She never announced her pregnancy, masked her growing stomach while performing in \"Skylight\" on Broadway this year and has gamely jumped into promotion for her new movie, the women's rights drama \"Suffragette,\" despite being a new mother. \n\"I didn't want the ['Skylight'] audience to know I was pregnant because it would affect the way they viewed my character, and I don't want people to know about my marriage or my children because it will affect the way they see me in films,\" said Mulligan, who turned 30 in May. \"And they don't need to know. There's this idea that people need to know, but they don't. I don't want them to form an attachment to me or my personality or my family or my life, because that's not healthy. Because they don't know me.\" \nBut her refusal to join Twitter or post photos of her baby on Instagram hasn't affected her popularity with filmgoers. Her performance in \"Suffragette,\" out Friday, has once again thrust her into the center of Oscar conversation. In the period drama, set in the early 1900s in London, Mulligan plays a laundromat worker who joins the suffrage movement, fighting for the right to vote alongside other women. Her decision proves catastrophic to her family life: Her husband is so outraged by her outspokenness that he kicks her out of their home and refuses to let her see her son. \nIf the role resonates with academy members, it will mark Mulligan's second journey through award season in Hollywood. Her first came five years ago for her debut starring film, \"An Education,\" a coming-of-age drama about an English schoolgirl who falls for an older man. \nShe was a novice and followed the storied It-girl trajectory: The film broke out at the Sundance Film Festival, she spent months being lauded as the next big thing and did loads of wide-eyed interviews about how surreal the newfound attention was. It should have been a wonderful experience for Mulligan, who as a girl was so desperate to be an actress that she wrote to her heroes, Julian Fellowes and Kenneth Branagh, begging for advice on how to break into the business. \n\"But I don't think I enjoyed it, because I was terrified all the time,\" she recalled. \"There was a lot of being introduced to people, and people don't want to meet you — it's a weird thing. You just feel awkward all the time. I think I made myself have no fun with it, and it's such a shame because I think I could have had a really good time if I'd gone, 'This is fine. Just relax. This is a good thing' instead of 'Oh, God. I shouldn't be here.'\" \nIt was around lunch time, and she'd shown up for the interview just out of the shower with wet hair — possibly the only indication that she was strapped for time as a new mom. Just a few hours later, she'd arrive with a blow-out to Elle's Women in Hollywood bash, where her \"Suffragette\" costar Streep waxed rhapsodic about Mulligan and her voice, which Streep described as \"warm caramel poured over the English language.\" \n\"I applaud your taste in material and how you hold out for stuff,\" Streep told a room filled with talent like Kate Winslet, Salma Hayek and Amy Schumer. \"Even when you were young and didn't have any money, you just did things that mattered.\" \nShe was referring to movies like \"Never Let Me Go\" and \"Shame,\" the kind of subversive indie fare that Mulligan turned up in before she agreed to her biggest-ever role as Daisy Buchanan in Baz Luhrmann's 3-D adaptation of \"The Great Gatsby.\" \nThe young woman who broke onto the scene playing a naive innocent has since evaporated, opting in \"Suffragette\" to play the kind of fiery feminist who always has the courage of her convictions. \nBut when it comes to discussing her career choices, Mulligan goes into sound bite speak. As in: \"I'm always just looking for good roles, whether it's a really big part or a really small part.\" Or: \"I've veered away from genre films and superheroes and spaceships — not because I don't enjoy them, but I've never found a role within them that I wanted to play.\" \n\"She works very hard and takes life very seriously,\" said Sarah Gavron, who directed \"Suffragette.\"\"She has got a lot under her belt for her age. I've heard people say that she's wise beyond her years, and there is something about that I think right.\" \nWhen she was young, Mulligan recalled, she used to have \"visceral dreams\" about being in films with Judi Dench. She would wake up devastated, realizing her fantasy wasn't real. But when she landed a small part in her first film, 2005's \"Pride & Prejudice\"— Fellowes helped her get the gig — Dench was on the set. Of her first movie. As her costar. \nWhich is to say that it seems there's nothing Mulligan won't make happen for herself, be it through magical thinking or steely determination. Which is probably why she saw herself in her \"Suffragette\" character — a woman more defined by her mission, in a way, than anything else. \n\"When I started working, I was often the only girl in a roomful of men,\" she said. \"I'd either try to please people by being lovely and sweet all the time — being polite and nice and getting the job done — or going in quite laddish and acting tough. \n\"Making 'Suffragette' made me realize I don't have to do either of those things. I can be a woman and be confident in my ideas, and I don't have to play anyone. I'm an adult, and I can get my voice heard without having to manipulate the situation.\"", "external_links": [], "published": "2015-10-23T13:00:00.000+03:00", "crawled": "2015-10-23T19:40:49.305+03:00", "highlightTitle": ""}