{"organizations": [], "uuid": "1c25c138d56e24986e7460bf269e7e00a91f3385", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.scmp.com", "main_image": "http://cdn3.scmp.com/sites/default/files/styles/620x356/public/2015/10/07/munch1.jpg?itok=mhj29jyY", "site_section": "http://scmp.com//rss/23/feed", "section_title": "South China Morning Post - Arts & Entertainment feed", "url": "http://www.scmp.com/lifestyle/arts-entertainment/article/1864939/munch-van-gogh-show-casts-fresh-light-two-fathers", "country": "HK", "title": "Munch: Van Gogh show casts fresh light on two of the fathers of expressionism", "performance_score": 0, "site": "scmp.com", "participants_count": 1, "title_full": "Munch: Van Gogh show casts fresh light on two of the fathers of expressionism | South China Morning Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T09:08:00.000+03:00", "replies_count": 0, "uuid": "1c25c138d56e24986e7460bf269e7e00a91f3385"}, "author": "GDN", "url": "http://www.scmp.com/lifestyle/arts-entertainment/article/1864939/munch-van-gogh-show-casts-fresh-light-two-fathers", "ord_in_thread": 0, "title": "Munch: Van Gogh show casts fresh light on two of the fathers of expressionism", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A gunshot and a scream reverberate through the yellow house, echo across the fjord, and fill a new exhibition at the Van Gogh Museum in Amsterdam with pity and terror.\nIn 1890 Vincent Van Gogh fatally shot himself in the French countryside. Three years later the Norwegian painter Edvard Munch was walking near Oslo's fjord at sunset. As the sun went down, he remembered years later, he was seized by a dreadful vision: \"The air became like blood - with piercing strands of fire … I felt a great scream - and I actually heard a great scream.\"\nMunch's 1893 crayon drawing The Scream , on loan from Oslo's Munch Museum, now hangs near Van Gogh's Wheatfield Under Thunderclouds , which he painted in the last months of his life.\nThe sky for Van Gogh has become a gorgeously thick and wet, yet oppressively dense and massive smear of blue and white. Meanwhile, the sky for Munch, in The Scream , is a sinister aurora borealis, a radioactive blaze. We are left to guess what Van Gogh's blue soup of a sky says about his emotional state. Munch leaves no such ambiguity. He portrays himself as a robed, monk-like figure, his eyes dots of pain in a hairless skull, his mouth an oval of anguish.\n\nOther walkers stand insensitive before the fjord. Only the isolated artist can hear the scream that is tearing nature itself apart.\nSeeing Munch and Van Gogh side by side is a journey to the birth of expressionism. They never met, and Van Gogh never knew Munch existed - although Munch, who lived until 1944, certainly got to know eventually about Van Gogh. Yet both artists intuited something similar. They felt the world crying out to express itself in colours. They heard a music, or a scream, in nature that connected artist and sky, artist and fields. The way they set down this holistic, extreme sensitivity created a new kind of art.\n\"Munch: Van Gogh\" compares some of the greatest masterpieces of two of the greatest modern artists. Munch, besides one of his four versions of The Scream , is represented by his even more terrifying vision of a house that seems to drip blood, Red Virginia Creeper (1898-1900), his darkly erotic Madonna (1895-97), and many more such shocking revelations of the fin de siecle .\nVan Gogh replies with works such as Starry Night over the Rhone (1888) and The Yellow House (1888). It is like a drama by Strindberg in which the two most intense artists who ever lived rage in mutual madness.\n\nMunch was the friend Van Gogh never found. The one man who might have understood him. When he rented the Yellow House in Arles and decorated it with bright paintings of sunflowers, Van Gogh was dreaming of utopia. He hoped this house would become an art colony where painters worked like brothers. Instead he got Paul Gauguin as a house guest and the dream ended in self-harm and a hospital bed.\nWould Munch have been a better painting companion? In his 1889 painting Summer Night (Inge on the Beach) , nature is a numinous, living presence that infuses the painting with inner light, just as Van Gogh's stars spark in the blue.\nBoth these northerners were set alight by French Impressionism and both admired Gauguin's abstract, symbolic boldness. Munch's nightmarish lithographs of lonely souls and depraved sexuality owe more to Gauguin than Van Gogh does, even though it was Van Gogh who lived with Gauguin. But the similarities between Munch and Van Gogh are ultimately less telling than their differences.\nThis exhibition casts a radically new light on the tragedy of Van Gogh. If a psychiatrist were asked which of these painters was most troubled, the diagnosis would be easy. Obviously, Munch is the morbid, seriously disturbed artist here. It is Munch who wears sickness on his sleeve.\nBy comparison, Van Gogh is free from all morbidity, despair, or self-pity. His paintings, next to those of Munch, are golden dreams of harmony and hope. The Guardian\n\"Munch: Van Gogh\" is at the Van Gogh Museum, Amsterdam until Jan 17, 2016 \nThis article appeared in the South China Morning Post print edition as Munch and Van Gogh together at last", "external_links": [], "published": "2015-10-08T09:08:00.000+03:00", "crawled": "2015-10-08T06:12:14.020+03:00", "highlightTitle": ""}