{"organizations": [], "uuid": "d2767bb051e0e4412d7ef9a5568d37371dabd3e2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.arcamax.com", "main_image": "http://www.arcamax.com/newspics/132/13280/1328042.jpg", "site_section": "http://www.arcamax.com/", "section_title": "News &amp; Entertainment by Email | ArcaMax Publishing", "url": "http://www.arcamax.com/healthandspirit/health/healthtips/s-1742523?fs", "country": "US", "title": "Her son died a preventable death. Her mission: to make sure it never happens again | Health & Fitness", "performance_score": 0, "site": "arcamax.com", "participants_count": 1, "title_full": "Her son died a preventable death. Her mission: to make sure it never happens again | Health & Fitness | ArcaMax Publishing", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "d2767bb051e0e4412d7ef9a5568d37371dabd3e2"}, "author": "arcamax.com", "url": "http://www.arcamax.com/healthandspirit/health/healthtips/s-1742523?fs", "ord_in_thread": 0, "title": "Her son died a preventable death. Her mission: to make sure it never happens again | Health & Fitness", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "When Maruchi Mendez first lowered her head to Harvey's cool, plastic chest, she listened for a moment, then burst into tears.\nShe listened to the steady, soothing thump-thump of a normal heartbeat, then, with the press of a button, the distinctive swishing thump rhythm of a heart with cardiomyopathy.\nShe sobbed because the sounds were so different. So simple to differentiate.\nShe sobbed because if anyone had listened for it 15 years ago, her son might still be alive.\nRamiro \"Toti\" Mendez, one of the top three starting pitchers on Florida International University's baseball team in 2000, was only a sophomore when he died suddenly from cardiomyopathy.\nHe was 20.\nOn Monday, his mother tried hard not to cry, and nearly succeeded, as FIU officials unveiled a plaque dedicating their newest simulation rooms in Toti's honor.\nInside the two windowed rooms were twin dummies, lopped off at the hip. They each had a mop of brown hair and blue eyes, and their insides re-arrange depending on which of their more than 30 heart condition modes are selected.\nThe Harvey dummies, designed by University of Miami Dr. Michael Gordon, teach medical students what various heart conditions sound like. Magnetic sensors inside the chest detect where the stethoscope is and change to mimic what a real stethoscope would register on a human patient.\n\"I fell in love with Harvey,\" Mendez said.\nBefore Mendez's donation, the dummies were kept in storage and hauled out only when students requested them, or for tests, said Dr. Vivian Obeso, dean for curriculum and medical education and the simulation center director at FIU's Herbert Wertheim College of Medicine.\nNow they have a dedicated space that Mendez said she hopes encourages students to log more hours on the dummies and develop lifesaving skills.\n\"The students love it,\" Obeso said. \"They know the only way to get better is to practice.\"\nFlorida U.S. Rep. Carlos Curbelo, a family friend and middle school baseball teammate of Toti's, told the crowd at Monday's unveiling that he admired Mendez's push to make something good out of a tragedy.\n\"It takes so much more strength and courage to respond to that by giving life, more life,\" he said.\nToti was on a full athletic scholarship to FIU, and Mendez created scholarships to honor her son.\nFifteen years ago she helped create the 23 Scholarship Endowment Fund, named for her son's baseball number, which has since been retired.\nNow she's developing another scholarship -- the Toti Mendez scholarship fund. Maybe one day, she said, it'll be enough to fund a cardiologist's education.\nThere's a memorial for Toti at the FIU baseball field. Another stands at Westminster Christian.\nBut these rooms, Mendez said, are her son's legacy.\n\"This is his biggest testament,\" she said. \"I know this is what he would have wanted.\"\n(c)2015 Miami Herald\nVisit Miami Herald at www.miamiherald.com\nDistributed by Tribune Content Agency, LLC.\nShare Comment", "external_links": ["http://www.facebook.com/sharer.php?u=http://www.arcamax.com/healthandspirit/health/healthtips/s-1742523&h=Her+son+died+a+preventable+death%2E+Her+mission%3A+to+make+sure+it+never+happens+again", "http://twitter.com/share?url=http://www.arcamax.com/healthandspirit/health/healthtips/s-1742523&hashtags=ArcaMax", "https://plus.google.com/share?url=http://www.arcamax.com/healthandspirit/health/healthtips/s-1742523"], "published": "2015-10-23T03:00:00.000+03:00", "crawled": "2015-10-24T04:09:38.616+03:00", "highlightTitle": ""}