{"organizations": ["Juice ‘N Java Cafe"], "uuid": "70410ba85b4833d2b9675760d1471880548f5b35", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.floridatoday.com", "main_image": "http://www.gannett-cdn.com/-mm-/e99b75d3c21c23b38836ded548d2693781e0686e/c=0-0-2423-1369&amp;r=x633&amp;c=1200x630/local/-/media/Brevard/Brevard/2014/11/17/635518326779023375-11162014203315.DSC07005.JPG", "site_section": "http://rssfeeds.floridatoday.com/brevard/entertainment", "section_title": "Brevard - Entertainment", "url": "http://www.floridatoday.com/story/entertainment/2015/10/26/jamie-lynn-spears-runaway-country/74629668/", "country": "US", "title": "Jamie Lynn Spears, Radio Romance join Runaway Country", "performance_score": 0, "site": "floridatoday.com", "participants_count": 0, "title_full": "Jamie Lynn Spears, Radio Romance join Runaway Country", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T19:43:00.000+02:00", "replies_count": 0, "uuid": "70410ba85b4833d2b9675760d1471880548f5b35"}, "author": "", "url": "http://www.floridatoday.com/story/entertainment/2015/10/26/jamie-lynn-spears-runaway-country/74629668/", "ord_in_thread": 0, "title": "Jamie Lynn Spears, Radio Romance join Runaway Country", "locations": ["Cocoa Beach", "FLORIDA"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Heath Chapman", "Jamie Lynn Spears", "Jennifer Sangalang"], "text": "Jamie Lynn Spears, Radio Romance join Runaway Country Jennifer Sangalang , FLORIDA TODAY 1:43 p.m. EDT October 26, 2015 2016 lineup features Jamie Lynn Spears (Britney's little sis!) and Radio Romance. Buy Photo Radio Romance performed at Juice ‘N Java Cafe in Cocoa Beach on Nov. 14, 2014. (Photo: Heath Chapman, for FLORIDA TODAY) Buy Photo 5 CONNECT 2 TWEET LINKEDIN COMMENT EMAIL MORE \nA few more country music artists have joined the Runaway Country 2016 party. \nOrganizers on Monday announced Jamie Lynn Spears (Britney's little sis!) and Radio Romance will perform at the country music festival's sixth annual event in March. \n“Joining (headliners) Kenny Chesney, Eric Church and Jake Owen will be Neal McCoy, Sawyer Brown, Jamie Lynn Spears, Radio Romance, Juke Box Mafia, Strung Like A Horse and Tim Montana and the Shrednecks,” Gary McCann said in an email to FLORIDA TODAY. \nPreviously held at Wickham Park in Melbourne, the three-day music fest switched venues for the next 10 years to accommodate growth. It also dropped Space Coast from its name and is being rebranded as Runaway Country Music Festival. It now will be held at Osceola Heritage Park in Kissimmee. Runaway Country leaving Brevard for Osceola County \nSpears is best known for her Nickelodeon show \"Zoey 101.\" She released her country music album \"The Journey\" in March 2014. This will be the first Runaway Country appearance for the 24-year-old. \nRadio Romance has performed in Brevard, most recently Juice N Java in Cocoa Beach. It's their first appearance at Runaway, too. In an interview with FLORIDA TODAY earlier this year, singer Sam Hayes described the band's sound like this: \"With a lot of our music, we try to have an original sound that is still country music at its core, but with rock influences from the stuff we grew up listening to as kids. Lyrically and musically you can hear the '90s rock influences that give us a unique sound, and we hope our music is able to stand alone through melody, sound, etc., but still be very much in the country genre.\" Radio Romance shakes up country music sound \nOther bands on tap for Runaway 2016: Thomas Rhett, Old Dominion, Maddie & Tae, Chris Janson, Craig Wayne Boyd, Mark Chesnutt, Mo Pitney, Old Southern Moonshine Revival, Whiskey Myers, Grayson Rogers, Lockhart, DJ Shane, and Keith Coleman’s tribute to music legend Johnny Cash. \nContact Sangalang at 321-242-3630 or jsangalang@floridatoday.com. Twitter: @byjensangalang \n-", "external_links": [], "published": "2015-10-26T19:43:00.000+02:00", "crawled": "2015-10-26T23:31:50.651+02:00", "highlightTitle": ""}