{"organizations": [], "uuid": "be6aaccfc3734874d73a8607fb66856284461ee6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ctvnews.ca", "main_image": "http://www.ctvnews.ca/polopoly_fs/1.2610136.1444862671!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "site_section": "http://www.ctvnews.ca/rss/ctvnews-ca-entertainment-public-rss-1.822292", "section_title": "CTVNews.ca - Entertainment - Public RSS", "url": "http://www.ctvnews.ca/entertainment/dance-moms-star-accused-of-hiding-income-from-show-amid-bankruptcy-1.2610130", "country": "CA", "title": "'Dance Moms' star accused of hiding income from show amid bankruptcy | Entertainment & Showbiz from CTV", "performance_score": 0, "site": "ctvnews.ca", "participants_count": 1, "title_full": "'Dance Moms' star accused of hiding income from show amid bankruptcy | Entertainment & Showbiz from CTV News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "be6aaccfc3734874d73a8607fb66856284461ee6"}, "author": "Joe Mandak,  The Associated Press", "url": "http://www.ctvnews.ca/entertainment/dance-moms-star-accused-of-hiding-income-from-show-amid-bankruptcy-1.2610130", "ord_in_thread": 0, "title": "'Dance Moms' star accused of hiding income from show amid bankruptcy | Entertainment & Showbiz from CTV", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "PITTSBURGH -- \"Dance Moms\" star Abby Lee Miller has been charged with hiding $775,000 worth of income from the Lifetime network reality show and spinoff projects during her Chapter 11 bankruptcy.\nThe investigation began when a channel-surfing bankruptcy judge saw Miller on TV in December 2012 and figured she had to be making more than the $8,899 in monthly income she was claiming, according to the 20-count bankruptcy fraud indictment announced Wednesday by federal prosecutors in Pittsburgh.\nIn reality, Miller had signed deals to earn up to $15,000 per episode of \"Dance Moms\" and up to $25,000 for each episode of her spinoff series, \"Abby's Ultimate Dance Competition\" -- not to mention income from dance sessions, public events, merchandise and apparel, the indictment said.\nMiller, 50, formerly of Penn Hills, wasn't arrested. She'll be mailed a court summons to appear Nov. 5 before a federal magistrate in Pittsburgh.\n\"Criminal prosecution is appropriate when debtors corrupt the bankruptcy process through deceit and lies before the court,\" U.S. Attorney David Hickton said.\nThe \"Dance Moms\" star is known for her brash behaviour and pursuit of perfectionism from her students. The show follows a class of Miller's elite students and the perilous relationship she has with the girls' mothers. Critics of \"Dance Moms\" accuse Miller of being emotionally abusive toward the girls, and many episodes show her students dissolving into tears after a harsh critique.\nMiller is charged with two counts of bankruptcy fraud, five counts of concealing bankruptcy assets and 13 counts of making false bankruptcy declarations. Each of the 20 counts carries up to five years in prison.\nAccording to the indictment, Miller filed for Chapter 11 bankruptcy protection in 2010 claiming debts of more than $356,000, including a $200,000 mortgage on a Florida home and a $96,000 mortgage on her dance studio in Penn Hills, the Pittsburgh suburb where the reality show is based.\nWhen someone files for Chapter 11 bankruptcy protection, the court can order creditors to accept less than they're owed or otherwise agree to more lenient repayment terms. That is done, however, with the understanding that the debtor is honestly and fully disclosing their income.\nIf they don't, it's a crime.\nMiller's bankruptcy and defence attorney didn't immediately return messages for comment, nor did a spokesman for Lifetime or officials at Collins Avenue Productions, the Los Angeles company that produces \"Dance Moms.\"\nAccording to the indictment, Miller obtained favourable repayment terms on the mortgage debts by hiding her income. Other creditors, who she wanted to pay over six years with no interest in her original bankruptcy plan, were paid in full after the court learned of her extra income. Her bankruptcy was discharged in December 2013, record show.\nU.S. Bankruptcy Judge Thomas Agresti rejected Miller's original bankruptcy repayment plan after seeing her on TV.\n\"And if it wasn't for me channel surfing one night and seeing Abigale Miller's Ultimate Dance Competition on one of the TV stations ... I realize that there's an awful lot of money coming into this plan, this case, and it hasn't been disclosed,\" Agresti said in the indictment.\nMiller then produced 49 TV payroll and other checks totalling more than $288,000 for the court, the indictment said. The FBI, Internal Revenue Service and U.S. Postal Inspection Service took over and found the rest of the under- or unreported income, according to the indictment.", "external_links": [], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-15T02:27:36.347+03:00", "highlightTitle": ""}