{"organizations": [], "uuid": "111c85f1a40ae9febc53fe68614098d2d8869183", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://www.canberratimes.com.au/content/dam/images/g/j/t/0/p/c/image.related.socialLead.620x349.gjs3ye.png/1443662123431.jpg", "site_section": "http://feeds.canberratimes.com.au/rssheadlines/entertainment.xml#", "section_title": "Canberra Times Entertainment Headlines", "url": "http://www.canberratimes.com.au/act-news/canberra-life/last-dinosaurs-come-to-canberra-to-perform-new-album-wellness-20150922-gjs3ye", "country": "AU", "title": "Last Dinosaurs come to Canberra to perform new album, Wellness", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "Last Dinosaurs come to Canberra to perform new album, Wellness", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T04:15:00.000+03:00", "replies_count": 0, "uuid": "111c85f1a40ae9febc53fe68614098d2d8869183"}, "author": "Arne Sjostedt", "url": "http://www.canberratimes.com.au/act-news/canberra-life/last-dinosaurs-come-to-canberra-to-perform-new-album-wellness-20150922-gjs3ye", "ord_in_thread": 0, "title": "Last Dinosaurs come to Canberra to perform new album, Wellness", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Brisbane indie rock band Last Dinosaurs' new single Apollo has an offbeat dance video. Photo: Wilk \nWith a set jammed full of new tracks, Last Dinosaurs are pumped to be hitting the Australian National University to promote their latest album,  Wellness .\nSinger Sean Caskey​ says, \"I seriously can't wait, because we've worked so hard on this set. It's going to be really good.\"\nThe album was released late in August and people have been reacting \"really well\" to the new material, he says.\nNow Caskey is keen to get out and show people how things are sounding live.\nAdvertisement \"It has just been so long,\" he says. \"Even on the tour for [the album's first single] Evie , we only got to play, like, three new songs, so this time it's going to be so much better.\"\nEnsuring they make the most of the new tracks, for this tour the band are playing each song from Wellness in order, with their older songs and a Jamiroquai/Michael Jackson medley jammed in between.  \n\"There is so much going on on this album, as we have discovered,\" Caskey says.\n\"We're just making sure it's all perfect. Which is a challenge.\"\nA challenge it may be, but it's one the band are enjoying.\n\"It's good. After playing for three years the same songs, it wasn't very challenging any more, because it was just so easy by the end of it. It's just refreshing to have something new and slightly difficult to play again,\" he says.\nOne of the tracks Caskey has been working hard to nail is Apollo, t he second single from Wellness. The song's video follows a security guard as he dons headphones and dances around an empty shopping mall.\n\"He's such a good dancer,\" Caskey says.\n\"At first, it was supposed to be a relatively boganish dude who partied all night and that was his escape, dancing all night. And the sun would be rising and he'd still be going hard, and he'd just walk onto the job site and keep dancing.\"\nIt proved too difficult to secure a job site to make that creative vision come true, so they ended up going with the security guard, shopping mall idea. \"But that worked really well,\" says Caskey.\nThe clip for Apollo was made by the band's bass player, Michael Sloan.\n\"Film clips have always been completely Michael's thing. He's always just taken control from the very beginning.\n\"Every time he makes a clip it always surprises me how good it is. He doesn't do it that often, but when he does, he always steps it up each time. And Apollo is probably one of his best.\"\nThe clip generates a creative and positive aura around the track, and by association around the entire album, which has been hailed as a real summertime release. \nDiscussing its title, Caskey says that on top of thinking it would be cool to have a one-word album name to sell this time around, calling the album Wellness is about always wanting to have a healthy mind, but not really being able to have it.\n\"It's also about just trying to play down and make the idea of falling in love again an everyday thing … Looking at it like, nothing lasts forever. It's just going through the motions again.\"\nWriting about love is something Caskey is drawn to time and time again.\n\"It's the only thing that I can really write about that at the time of writing is the most real,\" he says.\n\"It's what I think we live for, those sort of experiences, and I guess it's also relatable to everybody.\"\nLast Dinosaurs \nWith: Palms, The Jensens \nWhen: Saturday,  October 10 \nWhere: ANU Bar \nTickets: $35 +bf from moshtix.com.au", "external_links": [], "published": "2015-10-01T04:15:00.000+03:00", "crawled": "2015-10-01T08:44:32.307+03:00", "highlightTitle": ""}