{"organizations": [], "uuid": "f8b781132cb8f82778d022c24af54eb9ed94da83", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.arcamax.com", "main_image": "http://www.arcamax.com/newspics/130/13084/1308448.jpg", "site_section": "http://www.arcamax.com/entertainment/", "section_title": "Entertainment | ArcaMax Publishing", "url": "http://www.arcamax.com/entertainment/entertainmenttoday/s-1731223?fs", "country": "US", "title": "Movie review: 'Sicario' offers a brutally realistic look at drug war | Entertainment News", "performance_score": 0, "site": "arcamax.com", "participants_count": 1, "title_full": "Movie review: 'Sicario' offers a brutally realistic look at drug war | Entertainment News | ArcaMax Publishing", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "f8b781132cb8f82778d022c24af54eb9ed94da83"}, "author": "arcamax.com", "url": "http://www.arcamax.com/entertainment/entertainmenttoday/s-1731223?fs", "ord_in_thread": 0, "title": "Movie review: 'Sicario' offers a brutally realistic look at drug war | Entertainment News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "As FBI agent Kate Macer, the head of a kidnap-response team based in Phoenix, Emily Blunt has the steady, steely mien of a seasoned veteran, accustomed to working her way through hostage lairs, firearm pointed forward, anticipating, alert.\nBut at a certain point in \"Sicario,\" the bloody cross-border thriller that also stars Josh Brolin and Benicio Del Toro, a more troubled look begins to cross the actress' face. \"Why am I here?\" she seems to be saying -- and, in fact, pretty much does say -- as she joins an interagency task force, hops a private jet to Juarez, and becomes party to some decidedly brutal, extralegal behavior.\n\"Sicario,\" directed with an air of ghostly dread by Denis Villeneuve (\"Prisoners,\" \"Incendies\"), never satisfactorily answers Agent Macer's question. It's a fundamental flaw in a movie that nonetheless succeeds in evoking the anarchic violence of the drug wars raging on both sides of the U.S.-Mexican border.\nIt's a horrorscape that has been addressed in the recent documentary \"Cartel Wars\" and the FX series \"The Bridge,\" but Villeneuve paints it in chilling strokes: bodies hanging from an overpass in a city street; the discovery of corpses -- scores of them -- concealed behind the drywall of a house; corrupt cops (Mexican and American) carrying drugs and carrying out hits.\nI'm not sure if \"leavening\" is the right word, but Brolin, as an enigmatic U.S. agent with a world-weary cynicism and a black-ops vibe, provides at least a dose of (very) dark humor to the proceedings. His Matt Graver has clearly rubbed shoulders with Del Toro's Alejandro before. On several occasions, Kate finds herself in the company of Alejandro (if that's even his real name), who is definitely not from any law enforcement bureau she knows, trying to get at who he is, why they're here, what their mission is.\n\"You're asking me how a watch works,\" he responds, heavy-lidded, tamped-down. \"For now, just keep an eye on the time.\"\nTalk about brush-offs.\n\"Sicario\" means \"hit man\" in Mexico, according to a title card, and it doesn't take a genius to figure out which of the players the role fits best. There are strong supporting performances here -- Daniel Kaluuya as Macer's partner, shunted to the sidelines; Victor Garber as a high-up bureaucrat; Julio Cedillo as a Sonoran drug lord.\nRoger Deakins, who filmed Villeneuve's \"Prisoners,\" goes close in with his cameras, bringing a naturalistic intensity to the proceedings. One sequence deploys night vision and infrared lenses. An SUV convoy into Mexico is covered with swooping aerial photography, and a botched re-entry into the States -- Kate and her colleagues trapped in bumper-to-bumper traffic, surrounded by potential shooters -- ricochets with cross-cutting suspense.\nToward the end of \"Sicario,\" after all sorts of retribution and rogue behavior, Kate gets some advice: \"You should move to a small town where the rule of law still exists.\"\nIt's a great line, even if it doesn't help solve the puzzle of why she was here in the first place.\n(c)2015 The Philadelphia Inquirer\nVisit The Philadelphia Inquirer at www.philly.com\nDistributed by Tribune Content Agency, LLC.\nShare Comment", "external_links": ["https://plus.google.com/share?url=http://www.arcamax.com/entertainment/entertainmenttoday/s-1731223", "http://twitter.com/share?url=http://www.arcamax.com/entertainment/entertainmenttoday/s-1731223&hashtags=ArcaMax", "http://www.facebook.com/sharer.php?u=http://www.arcamax.com/entertainment/entertainmenttoday/s-1731223&h=Movie+review%3A+%27Sicario%27+offers+a+brutally+realistic+look+at+drug+war"], "published": "2015-10-01T03:00:00.000+03:00", "crawled": "2015-10-03T12:37:24.966+03:00", "highlightTitle": ""}