{"organizations": [], "uuid": "1ad34cb44ecbeb681a8b1593188a8a5fa720573e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbsnews.com", "main_image": "http://cbsnews1.cbsistatic.com/hub/i/r/2015/03/31/4d6ab916-9096-4f66-bbfb-b783f1614601/thumbnail/620x350/4def4ea30ea4bffc82638630835c5320/enbojorquez03313.jpg", "site_section": "http://www.cbsnews.com/", "section_title": "CBS News - Breaking News, U.S., World, Business, Entertainment &amp; Video ", "url": "http://www.cbsnews.com/news/judge-halts-8-executions-as-inmates-challenge-arkansas-secrecy-law/", "country": "US", "title": "Judge halts 8 executions in Arkansas as inmates challenge secrecy law", "performance_score": 0, "site": "cbsnews.com", "participants_count": 3, "title_full": "Judge halts 8 executions in Arkansas as inmates challenge secrecy law - CBS News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T02:58:00.000+03:00", "replies_count": 2, "uuid": "3f42803ae9583746749b503f53616b007eaeba1a"}, "author": "CBS/AP", "url": "http://www.cbsnews.com/news/judge-halts-8-executions-as-inmates-challenge-arkansas-secrecy-law/#post-0", "ord_in_thread": 0, "title": "Judge halts 8 executions in Arkansas as inmates challenge secrecy law", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LITTLE ROCK, Ark. -- An Arkansas judge on Friday halted the upcoming executions of eight death row inmates, dealing a blow to the state's efforts to begin putting prisoners to death for the first time in a decade.\nPulaski County Circuit Court Judge Wendell Griffen issued a stay for all eight of the state's scheduled executions, the first two of which were set for Oct. 21. In a separate filing, he denied most of the state's request to dismiss the case and said within a few days he would schedule a hearing in the inmates' ongoing case.\nThe inmates are challenging a new Arkansas law that allows the state to withhold any information that could publicly identify the manufacturers or sellers of its execution drugs.\nPlay Video Politics and Power Supreme Court steps into lethal injection debate The execution of a convicted murderer in Missouri is on hold, amid growing debate over lethal injection. The Supreme Court justice stopped the ex...\nJeff Rosenzweig, an attorney for the inmates, declined to comment about the ruling Friday.\nCathy Frye, a spokeswoman for the Arkansas Department of Correction, said the department can't comment on ongoing litigation and referred all questions to the Arkansas Attorney General's Office, which could appeal the ruling. In an emailed statement, Attorney General Leslie Rutledge disagreed with it.\n\"I respectfully disagree with the Court's decision not to dismiss the lawsuit brought by the prisoners and to delay their executions. I will continue to fight for the victims of these murders and their grieving families,\" Rutledge said.\nPlay Video CBSN Supreme Court upholds states' use of controversial lethal injection drug The Supreme Court has upheld the states' use of a lethal injection drug that has been linked to botched executions. CBS News correspondent Jan Cr...\nJoshua Lee, a lawyer for the inmates, argued in court that the new secrecy law put them at risk of enduring unconstitutional pain and suffering during their executions because the drugs' safety and effectiveness couldn't be vetted. He also said the state agreed in a prior settlement to reveal the drug information to the inmates before their executions.\nAssistant Attorney General Jennifer Merritt argued that the secrecy law is constitutional and that the state wasn't bound by the settlement terms because of the law's subsequent passage.\nBut Griffen ruled that proceeding with the executions, as scheduled, would unfairly deprive the inmates of their rights to pursue their legal claims.\nMerritt had argued that the inmates' case was largely based on speculation of what might happen, instead of fact. But Griffen ruled that the inmates had presented enough facts to warrant their case moving forward.\nHe wrote that the inmates' allegations that the lethal injection procedure posed a substantial enough risk of causing them unnecessary pain and suffering included enough facts about the drugs used to move forward with their claim.\nThe inmates will also get the chance to argue that the law violates the previous lawsuit settlement and free speech rights and infringes on judicial powers.\nGriffen did grant the state's request to dismiss an argument that the secrecy law violated the separation of powers provisions by giving the Department of Correction power that was reserved for the Legislature. He cited a March ruling by the Arkansas Supreme Court denying a similar challenge to the state's previous execution law by many of the same inmates listed in the lawsuit.\nOn Thursday, an attorney for the inmates submitted a court filing citing troubles in neighboring Oklahoma as reason to stop the executions. Like Arkansas, Oklahoma has a secrecy law protecting the source of its execution drugs. A newly released autopsy report showed that Oklahoma used the wrong drug when it executed inmate Charles Warner in January.\nArkansas hasn't executed an inmate since 2005, largely because of court challenges to the state's lethal injection law and a nationwide shortage in the drugs Arkansas has used during executions such as midazolam.\nMidazolam was implicated after executions last year in Arizona, Ohio and Oklahoma went longer than expected, with inmates gasping and groaning as they died. The U.S. Supreme Court approved continued use of the drug in June, rejecting a challenge from three Oklahoma death-row inmates.", "external_links": ["http://cbsnews2.cbsistatic.com/hub/i/r/2014/05/22/45b658e1-4e02-4aff-8730-5354ee311503/thumbnail/220x140/e19a61da5729ac4ec3165e1bea8126a3/ctm0522crawford640x360.jpg", "http://cbsnews1.cbsistatic.com/hub/i/r/2015/06/29/d03250ff-c947-41ea-990c-bab00ab38086/thumbnail/220x140/110440faff73de09a150446a69c65a8b/cbsn0629xwk413846640x360.jpg"], "published": "2015-10-10T02:58:00.000+03:00", "crawled": "2015-10-10T22:29:33.811+03:00", "highlightTitle": ""}