{"organizations": [], "uuid": "a70f31b1908afb24f8866382460dac4f017e879a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.examiner.com", "main_image": "http://cdn2-b.examiner.com/sites/default/files/styles/image_content_width/hash/9f/3f/9f3f2ca160f83d58941d9e110136b05e.jpg?itok=9_HKGWrd", "site_section": "http://www.examiner.com/arts-and-entertainment", "section_title": "Arts &amp; Entertainment | Examiner.com", "url": "http://www.examiner.com/article/remembering-americans-killed-1983-beirut-barracks-bombing", "country": "US", "title": "Remembering Americans killed in 1983 Beirut Barracks bombing", "performance_score": 0, "site": "examiner.com", "participants_count": 1, "title_full": "Remembering Americans killed in 1983 Beirut Barracks bombing | Examiner.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T14:47:00.000+03:00", "replies_count": 0, "uuid": "a70f31b1908afb24f8866382460dac4f017e879a"}, "author": "Susy Raybon", "url": "http://www.examiner.com/article/remembering-americans-killed-1983-beirut-barracks-bombing", "ord_in_thread": 0, "title": "Remembering Americans killed in 1983 Beirut Barracks bombing", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Memorial at Camp Lejeune Personal file, released photo Thirty-two years ago, today, 220 Marines of the 1st Battalion, 8th Marines of Camp Lejeune were killed in the worst attack on the U.S. Marine Corps since Iwo Jima in World War II. The American death toll that day was 241 servicemen; besides the 220 Marines, 18 were Navy and three were U.S. Army. The French also suffered the loss of 58 of their peace-keeping servicemen that day.\nThat deadly attack by suicide bombers in explosives-laden trucks marked the beginning of an era of terrorism not quite realized in the world before. Many of today’s Marines were not even born when that attack occurred.\nIn July 2014, some of those troops’ surviving family members were awarded a small restitution for their loss. A settlement of $1.7 million from the Iranian government was awarded to 1,300 families who lost loved ones in the attack. The award brought an end some 13 years of legal wrangling but did nothing to mend the pain of the families who lost loved ones.\nThe lawsuit against Iran was filed under a 1996 U.S. law allowing Americans to sue countries the State Department has identified as having sponsored terrorist acts that caused damages. February 2015, a U.S. District judge said those who were awarded the settlement could not pursue assets owned by Iran's Bank Markazi and held in Luxembourg because she does not have jurisdiction over the funds.\nIt should be noted that the American service members were at the Beirut Barracks at the request of the Lebanese government. They were there to establish a peacekeeping force “in the conflict between warring Muslim and Christian factions.” Four months after the attack, Pres. Reagan removed the Americans troops who were sent to keep the peace.\nAmericans learned a sad but powerful lesson that day, they came in peace and thirty-two years later, nothing has really changed in the Mideast. Tensions and violence in Iraq, Syria, and Yemen are worse than than they have been in decades. Yesterday, a U.S. special ops warrior was killed in Iraq. He was on a hostage rescue mission.", "external_links": ["http://www.reuters.com/article/2015/02/20/deutscheboerse-court-iran-idUSL5N0VU3EX20150220", "http://www.cnn.com/2015/10/22/middleeast/us-iraq-hostage-rescue-attempt/", "https://en.wikipedia.org/wiki/1983_Beirut_barracks_bombing"], "published": "2015-10-23T14:47:00.000+03:00", "crawled": "2015-10-23T16:49:15.821+03:00", "highlightTitle": ""}