{"organizations": [], "uuid": "a8bbe4e4622cb3aa4c6aac0ac48f3b3f4f5b8f4d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.greatfallstribune.com", "main_image": "http://www.gannett-cdn.com/-mm-/8f1f07caa952f3d49859cf76d1c425af442daec1/c=0-0-2400-1356&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/12/GreatFalls/GreatFalls/635802605296674349-120311-Roller-Derby-B.jpg", "site_section": "http://rssfeeds.greatfallstribune.com/greatfalls/local-entertainment", "section_title": "Hot Ticket - Local Entertainment", "url": "http://www.greatfallstribune.com/story/entertainment/2015/10/12/ecrg-bisman-bombshellz/73456376/", "country": "US", "title": "Roller derby hits hard, gives back", "performance_score": 0, "site": "greatfallstribune.com", "participants_count": 0, "title_full": "Roller derby hits hard, gives back", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T02:46:00.000+03:00", "replies_count": 0, "uuid": "a8bbe4e4622cb3aa4c6aac0ac48f3b3f4f5b8f4d"}, "author": "", "url": "http://www.greatfallstribune.com/story/entertainment/2015/10/12/ecrg-bisman-bombshellz/73456376/", "ord_in_thread": 0, "title": "Roller derby hits hard, gives back", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Traci Rosenbaum", "BisMan Bombshellz"], "text": "Roller derby hits hard, gives back Traci Rosenbaum, trosenbaum@greatfallstribune.com 5:46 p.m. MDT October 12, 2015 Roller girls are as diverse as the socks they wear. Check out some derby action Saturday, Oct. 17 as ECRG faces off against the BisMan Bombshellz. (Photo: RION SANDERS, GREAT FALLS TRIBUNE) Story Highlights Saturday, Oct. 17. Doors at 6 p.m., bout starts at 7. Four Seasons Arena CONNECT TWEET LINKEDIN COMMENT EMAIL MORE \nWith the holiday season coming up fast, people are starting to think about how they can give back to the community and make resolutions for their health in the new year. \nSome of them join boards and committees. Some of them visit local organizations to lend a helping hand. Some get a gym membership to become active. Others turn to support groups to help them stay fit and make healthy choices. \nAnd some people do all of these things while dodging hip-checks in pads and a helmet. \nThe members of the Electric City Roller GrrrlZ roller derby team come from all walks of life, but they all have one thing in common: They fell in love with a sport that merges fitness with community involvement. \nTeam captain and founding member Casie “Slim Hitman” Steinert was there when it all started. \n“Me and Mischief and Maribeth were all sitting at the bar talking about how we had nothing to do that we could be passionate about,” Steinert said. The three ladies put the word out on MySpace to draw recruits and talked to other skaters who had already started teams. \n“They gave us some feedback on what we needed to work on, which was everything,” Steinert recalls. \nAs a wife, mother and full-time embellisher at Shining Mountain images, Steinert’s life is pretty hectic, but she always makes time for derby because it’s something she believes in. \n“I really enjoy overcoming things in roller derby,” she said, adding that absolutely anyone can do it. “The only thing you need is the ability to not give up.” \nKaty Postlethwait, known as “Fr8 Train Fred,” is ECRG’s killer and one of the hardest hitters on the team. She was talked into trying derby five years ago after some badgering from a team member. Although she skates for physical activity and stress relief from her day jobs as a preschool teacher and gymnastics coach, that’s not what keeps her coming back. \n“Eventually I showed up and I fell in love with it,” Postlethwait said. “It’s a total close-knit family.” \nJanine \"Hiebee Jeebee\" Hieb has made a career out of helping people deal with their problems. As a counselor with a private practice, she knows the importance of nurturing the things you love in life. Hieb’s love for derby started with a phone call. \n“Well, we went to a game in December 2011,” she said, “and my husband called me in August and said ‘Janine, they’re having tryouts. You have to go!’” \nSince then, the 53-year-old grandmother of nine has thrown herself into skating. Despite being injured several times, she continues to promote the sport through her work with the Rock’N Rollerz Coed Junior Roller Derby Team. \n“I don’t want people to think getting hurt is such a big reality,” Hieb said. “I’m out there to play. Derby gives me the confidence and courage to continue to reach my athletic aspirations.” \nAll of the girls agreed that anyone interested, regardless of age or skill level, should check out roller derby. Practices are held at Hauer’s Family Skating Center, 1609 12th Ave. N., from 10 a.m. to 12:30 p.m. Sundays and from 6:30 to 9 p.m. Tuesdays, and anyone is welcome to stop by. \nYou can see the girls in action on Oct. 17 during their home bout at the Four Seasons Arena against North Dakota’s BisMan Bombshellz. The doors for “The Blocking Dead” open at 6 p.m., and the action starts at 7, with tickets available for $10 in advance and $12 at the door. \nPartial proceeds from the bout go to Toys for Tots, so pick up tickets at Barrel O’ Bucks Casino, 527 Central Ave. W., or through www.brownpapertickets.com . \nECRG is also partnering with 221 Industries for a special promotion. Head downtown to Alias Smith & Jones Pawn at 700 1st Ave. S. through Friday, Oct. 16, to land a combo ticket that gets you entrance into the 221 Industries fights on Oct. 16 and some sweet roller derby action on Oct. 17. You can take in both events at the Four Seasons Arena for just $25, so don’t miss out! THE BLOCKING DEAD \nWhen: Saturday, Oct. 17. Doors at 6 p.m., bout starts at 7 \nWhere: Four Seasons Arena \nCost: $10 in advance, $12 at the door ICF 22 - TOUGH ENOUGH TO FIGHT IN PINK \nWhen: Friday, Oct. 16. Doors at 6 p.m., fights start at 7 \nWhere: Four Seasons Arena \nCost: $20 in advance, $25 the day of the event SPECIAL: Visit Alias Smith & Jones Pawn, 700 1st Ave. S. by Oct. 16 for a $25 combo ticket for both events Read or Share this story: http://gftrib.com/1RDoQz9 More Stories", "external_links": [], "published": "2015-10-13T02:46:00.000+03:00", "crawled": "2015-10-13T03:51:42.420+03:00", "highlightTitle": ""}