{"organizations": [], "uuid": "80d8a246daf77b18b3063ae0bef221840679bfc0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "http://247PRESS.images.worldnow.com/images/9080579_G.jpg", "site_section": "http://www.cbs8.com/category/278850/arts-entertainment", "section_title": "Arts &amp; Entertainment - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30332267/see-flashdance-the-musical-at-newberry-opera-house-and-stay-at-holiday-inn-express-suites-newberry", "country": "US", "title": "See Flashdance-The Musical at Newberry Opera House and Stay at Holiday Inn Express & Suites Newberry", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "See Flashdance-The Musical at Newberry Opera House and Stay at Holiday Inn Express & Suites Newberry - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T11:37:00.000+03:00", "replies_count": 0, "uuid": "80d8a246daf77b18b3063ae0bef221840679bfc0"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30332267/see-flashdance-the-musical-at-newberry-opera-house-and-stay-at-holiday-inn-express-suites-newberry", "ord_in_thread": 0, "title": "See Flashdance-The Musical at Newberry Opera House and Stay at Holiday Inn Express & Suites Newberry", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Holiday Inn Express & Suites Newberry, SC offers affordable lodging for guests attending Flashdance-The Musical at Newberry Opera House on November 13, 2015.\n NEWBERRY, SC, October 23, The Holiday Inn Express & Suites Newberry SC hotel offers affordable accommodations to guests attending performances of Flashdance-The Musical at the Newberry Opera House on November 13. The stage adaptation of the 1983 movie is the story of a steelworker who dreams of becoming a professional dancer. The musical features the biggest hits from the movie including \"Maniac\", \"Gloria\", \"What a Feeling\", and the title song \"Flashdance\".\n\"We look forward to welcoming guests who are attending Flashdance-The Musical,\" notes Ambria Lanteigne, General Manager of the Holiday Inn Express & Suites Newberry. \"Our property is located just five minutes from the famous Newberry Opera House,\" explains Ms. Lanteigne.\nThis award winning hotel near downtown Newberry features non-smoking guest rooms with free high speed Internet and Simply Smart beds. Travelers will appreciate the convenience of an in-room microwave, mini refrigerator, and coffee maker. Some suites are equipped with sofa sleepers and whirlpool tubs. The complimentary Express Start Breakfast Bar, with signature cinnamon rolls, is available each morning in the lobby. Property amenities include a business center, fitness room, and 24-hour sundry shop. The Holiday Inn Express & Suites is close to Newberry College, The Firehouse Conference Center, and historic downtown Newberry. Dreher Island State Park on Lake Murray is a short drive away.\nThe Holiday Inn Express & Suites Newberry is located off I-26 at Exit 76. Current lodging specials include the Romantic Escape Package. IHG Rewards Club members will earn points toward free hotel nights. AAA, senior, and government discounts are available.\nFor more information and tickets to Flashdance-The Musical at Newberry Opera House, visit www.newberryoperahouse.com . To book your stay at the Holiday Inn Express & Suites Newberry South Carolina hotel , visit www.NEWBERRYSOUTHCAROLINAHOTEL.com or call 803-321-3955.\nAbout Holiday Inn Express & Suites Hotel Newberry\nThe Holiday Inn Express & Suites Hotel in Newberry is the premier choice among Newberry South Carolina hotels. They are conveniently located at exit 76 off of I-26, about 30 minutes north of Columbia and less than an hour south of Greenville, SC. This Newberry SC hotel has outstanding amenities, including an indoor pool, whirlpool and Fitness Center. Guest should be sure to stop by their complimentary Express Start Breakfast Bar each morning for delights like their signature cinnamon rolls and Smart Roast coffee. Few other Newberry South Carolina hotels can provide travelers with these perks backed by the reputable name they trust. \"Stay Smart\" at the Holiday Inn Express & Suites Hotel.\nFor more information visit: http://www.NewberrySouthCarolinaHotel.com\nFor all media inquiries, please contact:\nAllison Reinert\nCardinal Web Solutions\nhttp://www.CardinalWebSolutions.com\n release/see-flashdancethe-musical-at-newberry-opera-house-and-stay-at-holiday-inn-express-amp-suites-newberry-414608.php", "external_links": ["http://www.24-7pressrelease.com/press-release/see-flashdancethe-musical-at-newberry-opera-house-and-stay-at-holiday-inn-express-amp-suites-newberry-414608.php", "http://purl.org/rss/1.0/modules/content/"], "published": "2015-10-23T11:37:00.000+03:00", "crawled": "2015-10-23T10:39:46.214+03:00", "highlightTitle": ""}