{"organizations": [], "uuid": "1efa728707b715f0a2638767d2d36460b79e2c7e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailyherald.com", "main_image": "http://www.dailyherald.com/storyimage/DA/20151019/entlife/151019055/AR/0/AR-151019055.jpg&amp;updated=201510161605&amp;imageversion=Facebook&amp;exactH=630&amp;exactW=1200&amp;exactfit=crop&amp;noborder", "site_section": "http://www.dailyherald.com/rss/feed/?feed=entlife", "section_title": "DailyHerald.com &gt; Life &amp; Entertainment", "url": "http://www.dailyherald.com/article/20151019/entlife/151019055/", "country": "US", "title": "Spend time in garden before putting it to bed", "performance_score": 0, "site": "dailyherald.com", "participants_count": 1, "title_full": "Spend time in garden before putting it to bed", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T14:00:00.000+03:00", "replies_count": 0, "uuid": "1efa728707b715f0a2638767d2d36460b79e2c7e"}, "author": "Diana Stoll The Planter’s Palette", "url": "http://www.dailyherald.com/article/20151019/entlife/151019055/", "ord_in_thread": 0, "title": "Spend time in garden before putting it to bed", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Instead of viewing autumn as the finale of the vegetable garden, consider it the preamble of the garden next spring. Actions taken now will not only improve the health of the garden, they will reduce chores in the spring.\nHarvest remaining vegetables Dig or pick any remaining vegetables and either eat them or preserve them. Root crops like carrots, onions and potatoes can be stored for the winter. Herbs can be used fresh, dried or frozen.\nRemove stakes and other plant supports Collect stakes, cages and other devices used to support vegetable plants. Remove any plant material before cleaning them with a bleach and water solution. Allow them to dry before storing them for the winter.\nRemove debris from the garden Remove all spent plants, old vegetables and all weeds from the garden to reduce future assaults from insects and disease. Insects lay eggs on old foliage where they can overwinter. Some diseases also spend the winter on old plant material ready to re-infect the garden next year.\nIf plants were healthy, add them to the compost pile where they will decompose and feed future gardens. If there was any hint or suspicion of disease, dispose of plant material in the garbage.\nPull all annual weeds and dig out perennials weeds. Weeds with seed heads left standing in the winter shed their seeds and the weed population will multiply exponentially next year.\nFeed the soil Growing vegetables robbed the soil of nutrients. Adding organic material replenishes the soil. Done in fall, the garden has all winter to begin breaking them down. Ideal choices for organic matter include mushroom or homemade compost, composted manure and shredded leaves. Micro-organisms in the soil will get to work on these materials until the ground freezes and again as soon as it thaws in the spring.\nSpread organic material evenly over the garden and then spade or rototill amendments into the soil. Add a mulch of shredded leaves or weed-free hay or straw to reduce soil erosion in the winter. An added benefit to a layer of mulch: reduced early spring weeds.\nPlant a cover crop Another way to add organic matter and prevent soil erosion is to plant a cover crop, sometimes called green manure. Planted in the fall, a cover crop holds the soil while providing an environment for soil organisms. Tilled into the soil in spring, it breaks down quickly adding valuable organic matter. Cover crops also provide shade to the soil reducing weed growth.\nCrimson clover, winter rye or wheat, and annual ryegrass are types of cover crops to consider. Seeds for these can be purchased from seed companies like Territorial Seed, Johnny's Selected Seeds and Burpee.\nTake notes Take some time to reflect on the past season. Make notes of lessons learned. Did the sweet corn cast too much shade on the peppers? Should you have thinned the carrots more ruthlessly? Did the new tomato variety you tried live up to expectations? Recording observations reduce the chance you will repeat the same mistakes.\nRecord garden successes too. Which varieties performed beyond anticipations? Did the new staking system make harvesting easier? Was there a new recipe that garnered accolades from the entire family? Notes will ensure repeat achievements.\nTake a few hours in the vegetable garden now before tucking it in for its winter nap. It will awaken in spring in top form.\n• Diana Stoll is a horticulturist and the garden center manager at The Planter's Palette, 28W571 Roosevelt Road, Winfield. Call (630) 293-1040, ext. 2, or visit planterspalette.com.\n Life & Entertainment Home & Garden Gardening", "external_links": ["https://twitter.com/share"], "published": "2015-10-19T14:00:00.000+03:00", "crawled": "2015-10-19T16:24:47.575+03:00", "highlightTitle": ""}