{"organizations": [], "uuid": "211741cc93af163de8bcf59abeae346070bd0c1d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.deccanchronicle.com", "main_image": "http://dd508hmafkqws.cloudfront.net/sites/default/files/Ram%20Pothineni_0.jpg", "site_section": "http://www.deccanchronicle.com/entertainment", "section_title": "Entertainment | Deccan Chronicle", "url": "http://www.deccanchronicle.com/150930/entertainment-tollywood/article/%E2%80%98i-am-learning-all-time%E2%80%99", "country": "US", "title": "‘I am learning all the time’ | Deccan Chronicle", "performance_score": 0, "site": "deccanchronicle.com", "participants_count": 1, "title_full": "‘I am learning all the time’ | Deccan Chronicle", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T05:01:00.000+03:00", "replies_count": 0, "uuid": "211741cc93af163de8bcf59abeae346070bd0c1d"}, "author": "Deccan", "url": "http://www.deccanchronicle.com/150930/entertainment-tollywood/article/%E2%80%98i-am-learning-all-time%E2%80%99", "ord_in_thread": 0, "title": "‘I am learning all the time’ | Deccan Chronicle", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Deccan Chronicle | Suresh Kavirayani | September 30, 2015, 23.25 pm Actor Ram Pothineni Actor Ram Pothineni says that his upcoming film Shivam, directed by debutant Srinivas Reddy, is a romantic action entertainer. “When the director narrated the story, we liked the plot and developed it. Along with the director, our people too added some bits. But the director’s strong point is that he can execute the story well,” says Ram.\nDoesn’t Raashi Khanna, who plays the female lead opposite him, look elder to him? Ram says, “Even I was a bit scared initially when we roped her in. But after a couple of days’ shooting, we felt that our screen presence was very nice. She is a good performer.”\nRaashi has actually replaced Aisha Sharma in Shivam. “Yes, we had even shot for a few days with Aisha. But she is a busy model with lots of assignments. We needed an actress who could give us bulk dates, so we didn’t have any other choice but to replace her,” says the actor.\nRam adds that his earlier film Pandaga Chesuko was a big commercial success for him. “It gave me a good break, but I feel that something was missing in the film. I don’t know what was missing, but I felt that the second half was like my earlier film Ready,” he says.\nThe actor is also busy with another film, Hari Katha. “We are planning to release that film too this year’s end as 50 per cent of the shooting is complete,” says the actor. Before Pandaga Chesuko, Ram did not have any hits for nearly four years. Did he get frustrated at that time? “No, more than frustration, I felt guilty that I couldn’t give a hit film to my fans,” he says.\nHe, however, adds that when his second film Jagadam failed, he had felt very bad. “I came to the industry at 17. Both Sukumar and I felt that it was a good film. But it didn’t do well at the box office. I really got frustrated at that time, but I am growing as an actor with each film and learning a lot,” he says.\nRam, who prefers to stay away from the party scene and social dos, adds, “I always prefer to be at home when I don’t have work. I am searching for new scripts and discussing movies.” He adds that though his parents are putting pressure on him to get married, he does not have the time. “Whenever they raise the topic, I simply tell them that I have some urgent work and escape,” Ram laughs.\n Film Shivam Ram Pothineni entertainment Tollywood Also Read Rishi’s ‘old’ look, a guarded secret I love the incredible chaos of India: John Madden I failed at some of the biggest things in life: Sharon Stone We’re not promoting free music: U2", "external_links": ["http://platform.twitter.com/widgets.js", "http://twitter.com/share?url=http://www.deccanchronicle.com/150930/entertainment-tollywood/article/‘i-am-learning-all-time’", "http://dd508hmafkqws.cloudfront.net/sites/default/files/styles/article_node_view/public/Ram%20Pothineni_0.jpg", "https://apis.google.com/js/plusone.js", "http://www.facebook.com/sharer.php", "http://dd508hmafkqws.cloudfront.net/sites/default/files/Ram%20Pothineni_0.jpg", "http://vuukle.com/js/vuukle.js", "http://static.ak.fbcdn.net/connect.php/js/FB.Share"], "published": "2015-10-02T05:01:00.000+03:00", "crawled": "2015-10-01T18:33:26.686+03:00", "highlightTitle": ""}