{"organizations": [], "uuid": "8e9f8c79c9a2affd669c2c8ac0ca253e5da409af", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://www.canberratimes.com.au/content/dam/images/g/j/w/5/a/c/image.related.socialLead.620x349.gjw5ai.png/1443396881819.jpg", "site_section": "http://feeds.canberratimes.com.au/rssheadlines/entertainment.xml#", "section_title": "Canberra Times Entertainment Headlines", "url": "http://www.canberratimes.com.au/act-news/canberra-life/guitar-trek-take-music-round-the-world-in-serene-nights-at-wesley-music-centre-20150927-gjw5ai", "country": "AU", "title": "Guitar Trek take music round the world in Serene Nights, at Wesley Music Centre", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "Guitar Trek take music round the world in Serene Nights, at Wesley Music Centre", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T02:34:00.000+03:00", "replies_count": 0, "uuid": "8e9f8c79c9a2affd669c2c8ac0ca253e5da409af"}, "author": "Janet Wilson", "url": "http://www.canberratimes.com.au/act-news/canberra-life/guitar-trek-take-music-round-the-world-in-serene-nights-at-wesley-music-centre-20150927-gjw5ai", "ord_in_thread": 0, "title": "Guitar Trek take music round the world in Serene Nights, at Wesley Music Centre", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Guitar Trek is, from left, Tim Kain, Minh Le Hoang, Bradley Kunda and Matt Withers. Photo: Jimmy Walsh \nSerene Nights . Guitar Trek. Wesley Music Centre, Forrest. Saturday, October 17 at 7.30pm. Tickets: full price $30, concession $20,  children under 12 free. Bookings: . \nThe members of the Australian guitar quartet, Guitar Trek, are on a real high with the release of their latest CD, Serene Nights .\nThe beauty of the sound is a key aim.   \nTim Kain The artistic director of the ensemble, Tim Kain, says, \"This is our sixth disc. It's reimagined music, most of it arranged by me, with one piece arranged by Bradley Kunda. The music is from eight different countries and all the pieces are ones that we've loved to play over the years.\"\nLimelight magazine has called Guitar Trek's music \"a tour-de-force of sound-painting\". Since the formation of the original group in 1987, the ensemble has delighted lovers of fine music with its versatility and the quality of its blend of the sounds of four guitars: treble, standard, baritone and bass. \nAdvertisement \"The acoustic classical instrument bass [played by Matt Withers] is a real feature of the ensemble's sound,\" Kain says.\nThe disc's release is by ABC Classics and its Sydney launch will take place on Sunday, October 11 at the Art Gallery of NSW as part of the Resonate Series. Earlier concerts in the series have featured Slava Grigoryan​ and Yvonne Kenny. A champagne reception and a private exhibition viewing will precede the concert and doors open at 7pm.\nIn Canberra,  Serene Nights  will have its launch at Wesley Music Centre at 7.30pm on Sunday, October 17. \nAn unusual feature of the promotion of this disc is \"crowdfunding\"  so people can buy the disc before it is made, generating  funds for its production.\n\"Matt's the ideas man who really thinks and plans ahead,\" Kain says.\n\"We raised $12,000 for the album,\" Withers says,\"and it's been a very exciting time for Guitar Trek to have such great support from local individuals and communities. We've already sold a large number of seats for our Canberra concert so pre-booking is highly recommended.\"\nSerene Nights  was recorded at Studios 301 in Alexandria, Sydney, with Bob Scott as the sound engineer.\n\"Bob really managed to get inside the ensemble and placed the bass guitar in the middle of the group,\" Kain says.  \n\"He's the head sound engineer for the Australian Chamber Orchestra and travels with them and also works at the Canberra International Musical Festival. He did a superb job. The beauty of the sound is a key aim and also to capture a broad range of nuance and colour.\"\nKain arranged the order of the pieces on the disc, so that each piece flows easily on to the next through the changing atmosphere as the music travels through different countries. \nSerene Nights  begins with a piece, Llanura  ( Plains ),  from Venezuela and moves on to an arrangement by Kunda of Brahms' Intermezzo ; then, from Russia, Tchaikovsky's Waltz of the Flowers, followed by the spirit of Spain with Kain's arrangement of a tango by Albeniz. Perhaps you wouldn't expect to hear the sound of horns translated into guitar music, but Kain has done just that with his arrangement of Brahms' Finale from his Horn Trio Op. 40 . \nArgentina is represented by an arrangement of Alfonsina y el mar by Ramirez and is followed by Kain's arrangement of a piece by Rufino Almeida, better known as Bau, a musician from the African Cape Verde Islands.\nThere's a piece, Nola, by the American pianist and composer Felix Arndt and Je Te Veux ( I Want You ) by Erik Satie​.\n\"Our Australian piece is Angel by Mark Isaacs,\" Kain says. \"He's Sydney-based and well known as a jazz composer and pianist – a fabulous musician. We premiered this piece on Sunday Live .\"\nThe longest track is Kain's arrangement of Rodrigo's Four Pieces for Piano , the true flavour of Spain displayed in virtuosicperformance. And to end this selection: Jeremy Sparks' arrangement of Scott Joplin's Solace .\n\"It's a very varied collection that fits really nicely together,\" Withers says. \n\"We're working on new repertoire all the time,\" Kain says, \"and the four of us have such a harmonious relationship.\n\"We've cultivated each one specialising in a role: I do the artistic direction, Matt handles the business side – and Bradley does amazing off-beats.\"", "external_links": [], "published": "2015-09-28T02:34:00.000+03:00", "crawled": "2015-10-12T22:20:08.295+03:00", "highlightTitle": ""}