{"organizations": [], "uuid": "bb0563bdcd5bfb29934cd557c9b4dce91b969b32", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.courant.com", "main_image": "http://www.trbimg.com/img-5627a922/turbine/ct-oprah-winfrey-cultural-clout-belief-ratings-20151021", "site_section": "http://www.courant.com/entertainment/rss2.0.xml", "section_title": "Entertainment - Hartford Courant", "url": "http://www.courant.com/entertainment/ct-oprah-winfrey-cultural-clout-belief-ratings-20151021-story.html", "country": "US", "title": "Oprah Winfrey's loss of cultural clout shows in 'Belief' ratings", "performance_score": 0, "site": "courant.com", "participants_count": 1, "title_full": "Oprah Winfrey's loss of cultural clout shows in 'Belief' ratings", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T18:05:00.000+03:00", "replies_count": 0, "uuid": "bb0563bdcd5bfb29934cd557c9b4dce91b969b32"}, "author": "Brian Lowry", "url": "http://www.courant.com/entertainment/ct-oprah-winfrey-cultural-clout-belief-ratings-20151021-story.html", "ord_in_thread": 0, "title": "Oprah Winfrey's loss of cultural clout shows in 'Belief' ratings", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Oprah Winfrey's loss of cultural clout shows in 'Belief' ratings Oprah Winfrey Greg Allen / Greg Allen/Invision/AP \nOprah Winfrey attends the premiere of the Oprah Winfrey Network's (OWN) documentary series \"Belief\", at The TimesCenter on Wednesday, Oct. 14, 2015, in New York. \nOprah Winfrey attends the premiere of the Oprah Winfrey Network's (OWN) documentary series \"Belief\", at The TimesCenter on Wednesday, Oct. 14, 2015, in New York. (Greg Allen / Greg Allen/Invision/AP) Brian Lowry Variety \nOprah Winfrey made news recently by investing in Weight Watchers Intl., promptly causing the company's value to soar. But based on the early ratings for her new faith-oriented series \" Belief ,\" that's not the only thing she's associated with that's exhibiting shrinkage. \nA seven-part documentary devoted to exploring faith in its various forms, \"Belief\" opened to a mere 508,000 viewers in its first episode Sunday, according to Nielsen data. And while that represents a bump for OWN versus the prior week and a not-bad number for a program with such earnest intentions, it's a conspicuous comedown from the kind of audience that Winfrey attracted on a daily basis when hosting her own syndicated talk show. \nAfter a rocky start, Winfrey has managed to turn OWN into a reasonably formidable basic-cable player, and her personal brand -- filled with messages of hope and self-empowerment -- remains a powerful one. Nevertheless, the tepid start for \"Belief,\" after a flood of promotion trading off Winfrey's name, reinforces the sense that she sacrificed some of her cultural clout when she gave up her daily platform. \nClearly, Winfrey's intention to transform the network that bears her name into \"the world's biggest classroom,\" as she once called it, proved more ambitious than was commercially feasible. OWN has rebounded somewhat, but a lot of that had to do with broadening its programming mix, including enlisting Tyler Perry to produce several scripted series for the channel. \nWinfrey has no mountains left to climb professionally, and her wealth and avid fan base have made her a force in more than just Hollywood, including philanthropy and politics. That said, her stated goals for OWN, including a desire to \"uplift and entertain,\" are certainly loftier than the mantra at most networks. And while cynics have often been too dismissive of what is sometimes called \"broccoli TV,\" it's fair to say such endeavors only fulfill their mandate if people actually consume what's being offered.", "external_links": [], "published": "2015-10-21T18:05:00.000+03:00", "crawled": "2015-10-23T08:41:57.707+03:00", "highlightTitle": ""}