{"organizations": [], "uuid": "050ebec13effa2de3715456aba52897295d4b6f6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.india.com", "main_image": "http://s3.india.com/wp-content/uploads/2015/10/336506-hiv.jpg", "site_section": "http://www.india.com/feed/", "section_title": "India | Latest India News | Get Free India.com Email | Live Cricket and Entertainment News at India.Com", "url": "http://www.india.com/whatever/new-breakthrough-may-lead-to-hiv-relapse-cure-620774/", "country": "US", "title": "New breakthrough may lead to HIV relapse cure", "performance_score": 0, "site": "india.com", "participants_count": 1, "title_full": "New breakthrough may lead to HIV relapse cure", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T13:24:00.000+03:00", "replies_count": 0, "uuid": "050ebec13effa2de3715456aba52897295d4b6f6"}, "author": "Wires English | Indo-Asian News Service", "url": "http://www.india.com/whatever/new-breakthrough-may-lead-to-hiv-relapse-cure-620774/", "ord_in_thread": 0, "title": "New breakthrough may lead to HIV relapse cure", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "New breakthrough may lead to HIV relapse cure By Indo-Asian News Service on October 11, 2015 at 3:54 PM Comments Sydney, Oct 11: Scientists are now better able to predict how quickly the HIV virus will return after individuals stop treatment, thanks to the discovery of new immune system biomarkers by researchers at the University of New South Wales (UNSW), Australia, and the University of Oxford. The development opens up new avenues for understanding why the HIV virus persists in some patients, and remains dormant and undetectable in others. (Read: New blood test to detect heart attack risk) \nWhile existing anti-retroviral therapy (ART) stops the HIV virus from replicating, it does not completely remove the virus. Destroying the hidden reservoirs of the virus remains one of the holy grails of HIV research.Led by Oxford researcher professor John Frater, the international research team analysed data from a randomised study of patients with primary HIV infection. \nThey compared the T-cells of 154 patients in Europe, Brazil and Australia who had their ART treatment interrupted after 12 or 48 weeks. T-cells play a central role in protecting the immune system.After coming up with a shortlist of 18 immune system biomarkers, researchers discovered that three of them — PD-1, Tim-3 and Lag-3 — were statistically significant predictors of when the virus would rebound. \nThe researchers found that high levels of these biomarkers, attached to ‘exhausted’ T-cells prior to patients commencing ART, were associated with earlier rebound of the virus following treatment interruption.”Focusing on the exhaustion markers was an important step as it has given us vital clues as to why some people are able to better control the virus after therapy has been interrupted,” said Professor Rodney Phillips from UNSW. \nStudy co-author Professor Anthony Kelleher from UNSW said understanding the mechanisms that allow HIV to remain in ‘remission’ is essential if the virus is to be eradicated.”We want to be able to predict how the virus will behave before we take patients off ART to test drug therapies aimed at eradicating HIV,” he said.The findings were published in the journal Nature Communications. \n\n  3:54 PM Topics:", "external_links": [], "published": "2015-10-11T13:24:00.000+03:00", "crawled": "2015-10-11T14:00:59.790+03:00", "highlightTitle": ""}