{"organizations": [], "uuid": "e3993433ce30cef88fcbb955d3edb132c9a35c8e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailyherald.com", "main_image": "http://www.dailyherald.com/storyimage/DA/20150930/NEWS/150939932/AR/0/AR-150939932.jpg&amp;updated=201509301043&amp;imageversion=Facebook&amp;exactH=630&amp;exactW=1200&amp;exactfit=crop&amp;noborder", "site_section": "http://www.dailyherald.com/rss/feed/?feed=entlife", "section_title": "DailyHerald.com &gt; Life &amp; Entertainment", "url": "http://www.dailyherald.com/article/20150930/news/150939932/", "country": "US", "title": "Antioch Rotary hosts annual pork chop dinner fundraiser Oct. 3", "performance_score": 0, "site": "dailyherald.com", "participants_count": 1, "title_full": "Antioch Rotary hosts annual pork chop dinner fundraiser Oct. 3 - DailyHerald.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T18:43:00.000+03:00", "replies_count": 0, "uuid": "e3993433ce30cef88fcbb955d3edb132c9a35c8e"}, "author": "Steven Olive Daily Herald correspondent", "url": "http://www.dailyherald.com/article/20150930/news/150939932/", "ord_in_thread": 0, "title": "Antioch Rotary hosts annual pork chop dinner fundraiser Oct. 3", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Seasoned, thick pork chops grilled slowly over a charcoal fire. Applesauce, baked beans, coleslaw, and a choice of lemonade, iced tea or coffee. For dessert -- ice cream.\nThe Antioch Rotary hosts its annual pork chop dinner and auction Saturday, Oct. 3, at St. Peter Catholic Church, 557 Lake St., Antioch. Dinner is 5 to 7 p.m., while the auction runs from 7 to 10:30 p.m. A cash bar is available.\n\"This annual fundraiser event raises money for us to give back to the community via scholarships to graduating high school seniors,\" said Gary Quedenfeld, president of the Antioch Rotary.\nThis year, the 19 student-recipients will receive $500 to $2,000, for a total of $27,000 distributed by the Rotary, Quedenfeld said.\nThe company catering the event is Fay's Pork Chop Bar-B-Que in Waterman, which is about 12 miles south of DeKalb. Marcia Dempsey, a former Fay who owns Fay's with several siblings, employs her crews to grill the chops at various public and private events.\nDempsey said they will purchase about 1,000 pork chops -- or 450 to 500 pounds -- from Pioneer Wholesale Meats Inc. in Chicago for this event. Fay's has been catering the Antioch Rotary event since 1974, one of the longest-running catered events in the company's history, she said.\nAbout 40 years ago, former Rotary member Vern Thelen, owner of Thelen Sand and Gravel Inc., was at the DeKalb County Fair when he tasted a vendor's pork chops. That was love at first bite. Thelen couldn't wait to get back to Antioch to tell his Rotary brothers how tasty the pork chops were, and that they should hire Fay's to cater the Rotary's annual fundraiser event. Thelen died in 2003 at the age of 78.\nThe secret to the pork chops is the dry rub and the fire, said Bob Dempsey, manager of Fay's Pork Chop Bar-B-Que. The dry rub -- available for sale the night of the dinner -- is placed on the chops several days in advance. And, the grill is 8 inches away from the charcoal fire instead of the usual 4 inches on a home charcoal grill, Bob Dempsey added. Each pork chop is cut at least 3/4-inch thick and weighs 5 to 8 ounces; each person receives two chops plus the sides.\nThose who don't attend the dinner but want to go to the auction, need to purchase a ticket to enter the auction area, Quedenfeld said. The live auction typically has 75 to 90 items, while the silent auction area will have 35 to 50 items available. Items, services, trips and vacations will be on the auction block. They include: gift cards to local restaurants; a guided trip to Germany; a week's stay in a condo in Florida, the Wisconsin Dells or Hawaii; generators; bicycles; guided fishing or pheasant hunting trips; and laptop computers.\nThe highest bid in the auction's history was $3,200 for Scotch whisky tasting for 10 adults, Quedenfeld said. During the auction, cookies -- provided by Rotary members -- are laid out on tables.\nTickets are $25 in advance or $30 at the door. To purchase tickets before the event, call Quedenfeld at (847) 226-1759.\n News Festivals/Fairs Antioch Charities and Fundraising Food Neighbor", "external_links": ["https://twitter.com/share"], "published": "2015-09-30T18:43:00.000+03:00", "crawled": "2015-10-01T01:03:34.818+03:00", "highlightTitle": ""}