{"organizations": [], "uuid": "5660b8f21fa5e66e839a343223ab7da52f850c07", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.india.com", "main_image": "http://s3.india.com/wp-content/uploads/2015/10/jp-duminy-takes-hat-trick.jpg", "site_section": "http://www.india.com/feed/", "section_title": "India | Latest India News | Get Free India.com Email | Live Cricket and Entertainment News at India.Com", "url": "http://www.india.com/sports/j-p-duminyodis-wont-be-walk-in-the-park-615290/", "country": "US", "title": "J P Duminy:ODIs won’t be walk in the park", "performance_score": 0, "site": "india.com", "participants_count": 1, "title_full": "J P Duminy:ODIs won’t be walk in the park", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T09:28:00.000+03:00", "replies_count": 0, "uuid": "5660b8f21fa5e66e839a343223ab7da52f850c07"}, "author": "Wires English | Press Trust of India", "url": "http://www.india.com/sports/j-p-duminyodis-wont-be-walk-in-the-park-615290/", "ord_in_thread": 0, "title": "J P Duminy:ODIs won’t be walk in the park", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments \nKolkata, Oct 9: South Africa may have clinched the Twenty20 series quite comprehensively but their star batsman batsman J P Duminy feels the Indians will fight back strongly in the upcoming ODIs and make sure that his side does not have it easy. South Africa defeated India in Dharamsala and Cuttack to clinch the Twenty20 series 2-0 after the third and final match was abandoned owing to a wet outfield. (Read: BCCI Working Committee meeting reconvened on October 18) \n“As a team, we definitely expect them to put in a big performance in the two series. We are under no illusion that it is going to be a walkover in the ODI series. We know that we have to fight hard and play well and take it one game at a time,” Duminy, who was adjudged man of the series, told a news conference after yesterday’s washout.The ODI leg is beginning with Kanpur in two days time and Duminy said his side would once again look to make a strong start. \n“Our focus is on Kanpur and hopefully we can start off well in that series as well. That is going to give us a lot of confidence. We know that they are a great ODI team so it is important for us to start off well in the ODI series,” Duminy said. India had set up a mammoth 200 target in Dharamsala riding on Rohit Sharma’s maiden century but his effort was overshadowed by the Duminy’s unbeaten 68 that fashioned a thrilling seven-wicket for the visitors. \n“I would definitely put it down as one of my better innings, especially in International cricket in the shorter format. But I still believe that there is a lot more to come from myself and I can still contribute a lot more; not only with the bat but also with the ball. I guess the key for me is to stay hungry to perform,” the South African all-rounder said. \nTerming the Dharamsala win as a turning point, Duminy said, “It was a big one for us especially chasing 200 gave us a lot of confidence going into the second T20I. That is going to be a big tick for us in the T20 format. With the results that we have got here now, they will give us a lot of confidence going into the T20 series against England and Australia and obviously the World cup coming in a few months.” ”We spoke long and hard coming here… It can get quite painful if you start off in the wrong fashion. We are happy the way we have started but we also know that there is a lot of hard work ahead of us,” Duminy said. \n  11:58 AM Topics:", "external_links": [], "published": "2015-10-09T09:28:00.000+03:00", "crawled": "2015-10-09T09:46:19.198+03:00", "highlightTitle": ""}