{"organizations": [], "uuid": "7609c3a65c6cdcff0c733720c4918c8af1b0fafe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48524/c", "section_title": "Entertainment - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30292631/shanda-games-reports-first-half-2015-unaudited-results", "country": "US", "title": "Shanda Games Reports First Half 2015 Unaudited Results", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Shanda Games Reports First Half 2015 Unaudited Results - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "7609c3a65c6cdcff0c733720c4918c8af1b0fafe"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30292631/shanda-games-reports-first-half-2015-unaudited-results", "ord_in_thread": 0, "title": "Shanda Games Reports First Half 2015 Unaudited Results", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Shanda Games Limited\nHONG KONG , Oct. 19, Shanda Games Limited (\" Shanda Games \", \"we\" or the \"Company\") (NASDAQ: GAME), a leading online game developer, operator and publisher in China , today announced its unaudited consolidated financial results for the first half of 2015 ended June 30, 2015 .\nFirst Half 2015 Unaudited Financial Results\nNet Revenues. Net revenues for the first half of 2015 totaled RMB1,446.4 million ( US$236.6 million ), a decrease of 26.1% from RMB1,956.5 million in the first half of 2014.\nGross Profit. Gross profit for the first half of 2015 was RMB1,015.8 million ( US$166.2 million ), a decrease of 32.0% from RMB1,493.6 million in the first half of 2014. Gross margin was 70.2%, a decrease from 76.3% in the first half of 2014.\nOperating Income. Operating income for the first half of 2015 was RMB429.6 million ( US$70.3 million ), a decrease of 38.6% from RMB699.2 million in the first half of 2014. Operating margin was 29.7%, a decrease from 35.7% in the first half of 2014.\nNon-GAAP Operating Income. Non-GAAP operating income for the first half of 2015 was RMB481.3 million ( US$78.7 million ), a decrease of 37.3% from RMB768.0 million in the first half of 2014. Non-GAAP operating margin was 33.3%, a decrease from 39.3% in the first half of 2014.\nNet Income Attributable to Ordinary Shareholders. Net income for the first half of 2015 was RMB289.5 million ( US$47.4 million ), a decrease of 52.2% from RMB605.7 million in the first half of 2014. Net margin was 20.0%, a decrease from 31.0% in the first half of 2014. Earnings per diluted ADS were RMB1.06 (US$0.18) , compared with RMB2.24 in the first half of 2014.\nNon-GAAP Net Income Attributable to Ordinary Shareholders. Non-GAAP net income for the first half of 2015 was RMB326.6 million ( US$53.4 million ), a decrease of 50.5% from RMB660.1 million in the first half of 2014. Non-GAAP net margin was 22.6%, a decrease from 33.7% in the first half of 2014. Non-GAAP earnings per diluted ADS were RMB1.20 (US$0.20) , compared with RMB2.44 in the first half of 2014.\nNet Cash. In the first half of 2015 the Company generated RMB327.8 million ( US$53.6 million ) in cash flows from operating activities. The Company's cash and cash equivalents, time deposits with maturity over one year, short-term investments and restricted cash, net of loans and dividend payable, increased from RMB1,147.7 million as of December 31, 2014 to RMB1,460.9 million ( US$238.9 million ) as of June 30, 2015 .\n\"The Company continues its focus on strengthening its development culture and capabilities. Titles originally scheduled for the first half of 2015 were slated for delayed releases, as we made the decision to give our producers and their teams more time – to create the best games possible for our fans,\" commented Mr. Yingfeng Zhang , Chairman of the Board and acting Chief Executive Officer of Shanda Games . \"Our core strategies are to nurture our key franchises and to grow our mobile audience. The blockbuster success of 'Mir 2 Mobile' is the result of our focus and improved execution in mobile game development. To serve our PC gaming fans, we have planned for release, 'Chuan Qi Yong Heng' a 3D-MMORPG masterpiece made using the Unreal 3 engine, in the near future.\"\nEntering into an Agreement and Plan of Merger\nOn April 3, 2015 , Shanda Games announced that it had entered into an Agreement and Plan of Merger (as amended and restated, the \"Agreement\") with Capitalhold Limited (\"Parent\") and Capitalcorp Limited, a wholly owned subsidiary of Parent (\"Merger Sub\"). Pursuant to the Agreement, Merger Sub will be merged with and into the Company (the \"Merger\"), with the Company continuing as the surviving corporation (the \"Surviving Corporation\") and becoming a wholly owned subsidiary of Parent.\nUnder the terms of the Merger Agreement, Parent will acquire the Company for cash consideration equal to US$3.55 per ordinary share of the Company (each, an \"Ordinary Share\") and US$7.10 per American Depositary Share of the Company, each representing two Class A Ordinary Shares (each, an \"ADS\"), in a transaction valuing the Company at approximately US$1.9 billion . This price represents a premium of 46.5% and 53.8%, respectively, over the Company's 30- and 60-trading day volume-weighted average price as Quote: d by NASDAQ Global Select Market (\"NASDAQ\") on January 24, 2014 , the last trading date immediately prior to the Company's announcement on January 27, 2014 that it had received a \"going private\" proposal. The consideration to be paid to holders of Ordinary Shares and ADSs pursuant to the Agreement also represents an increase of approximately 2.9% from the original US$3.45 per Ordinary Share and US$6.90 per ADS offer price included in the January 27, 2014 \"going private\" proposal.\nImmediately following consummation of the transactions contemplated by the Agreement, Parent will be beneficially owned by a consortium comprising (i) Ningxia Yilida Capital Investment Limited Partnership, a limited partnership formed under the laws of the People's Republic of China and an affiliate of the Company's acting CEO, Mr. Yingfeng Zhang , (ii) Ningxia Zhongyincashmere International Group Co., Ltd. (\"Ningxia\"), a company formed under the laws of the People's Republic of China , (iii) Orient Hongtai ( Hong Kong ) Limited, a company incorporated and existing under the laws of Hong Kong (\"Orient Hongtai\"), (iv) Orient Hongzhi ( Hong Kong ) Limited (\"Orient Hongzhi\"), a company incorporated and existing under the laws of Hong Kong and an affiliate of Orient Hongtai, (v) Hao Ding International Limited (\"Hao Ding\"), a company established under the laws of the British Virgin Islands , (vi) Ningxia Zhengjun Equity Investment Partnership Enterprise (Limited Partnership), a limited partnership organized and existing under the laws of the People's Republic of China and an affiliate of Mr. Yingfeng Zhang , (vii) Ningxia Silkroad Equity Investment Partnership Enterprise (Limited Partnership), a limited partnership organized and existing under the laws of the People's Republic of China and an affiliate of Ningxia, and (viii) Ningxia Zhongrong Legend Equity Investment Partnership Enterprise (Limited Partnership), a limited partnership organized and existing under the laws of the People's Republic of China and an affiliate of Ningxia.\nOn June 30, 2015 , Litian Investment Center ( Shanghai ) L.P., a limited partnership organized under the laws of the PRC (\"Litian\"), closed a privately negotiated transaction to acquire 100% of the equity interest of HuaSung Holdings Limited (\"HuaSung\") from Orient Zhihui Investment Center ( Shanghai ) L.P., which directly owned 100% of the equity interest of HuaSung, which directly owns 100% of the equity interest of Orient Hongzhi. As a result, Litian, through HuaSung, became the beneficial owner of 100% of the equity interest of Orient Hongzhi, which directly owns 61,776,335 Class A Ordinary Shares, which are the sole assets of Orient Hongzhi. Orient Hongzhi is the sole asset of HuaSung.\nOn June 30, 2015 , Lihua Investment Center ( Shanghai ) L.P., a limited partnership organized under the laws of the PRC (\"Lihua\"), closed a privately negotiated transaction to acquire 100% of the equity interest of TonSung Holdings Limited (\"TonSung\") from Orient Zhisheng Investment Center ( Shanghai ) L.P., which directly owned 100% of the equity interest of TonSung, which directly owns 100% of the equity interest of Orient Hongtai. As a result, Lihua, through TonSung, became the beneficial owner of 100% of the equity interest of Orient Hongtai, which directly owns 61,776,334 Class A Ordinary Shares, which are the sole assets of Orient Hongtai. Orient Hongtai is the sole asset of TonSung.\nOn June 30, 2015 , Lihai Investment Center ( Shanghai ) L.P., a limited partnership organized under the laws of the PRC (\"Lihai\"), closed a privately negotiated transaction to acquire 100% of the equity interest of Shanghai Hai Sheng Tong Investment Co., Ltd. (\" Hai Sheng Tong \") from Shanghai Buyout Fund L.P., a limited partnership organized under the laws of the PRC, and Xizang Runda Resource Co., Ltd., a company organized under the laws of the PRC, which collectively and directly owned 100% of the equity interest of Hai Sheng Tong , which directly owns 100% of the equity interest of Hao Ding. As a result, Lihai, through Hai Sheng Tong , became the beneficial owner of 100% of the equity interest of Hao Ding, which directly owns 107,438,129 Class A Ordinary Shares, which are the sole assets of Hao Ding. Hao Ding is the sole asset of Hai Sheng Tong .\nOn September 24, 2015 , Shanda Games Limited announced that it entered into an Amended and Restated Agreement and Plan of Merger (the \"Amended and Restated Merger Agreement\") with Parent and Merger Sub on September 23, 2015 . The Amended and Restated Merger Agreement amends and restates in its entirety the Agreement and Plan of Merger, dated as of April 3, 2015 , by and among Parent, Merger Sub and the Company (the \"Original Merger Agreement\"). Pursuant to the Amended and Restated Merger Agreement, Parent, Merger Sub and the Company agreed, among other things, to extend the \"Termination Date\", as defined in Section 8.02(a) of the Original Merger Agreement, to December 31, 2015 .\nRecent Business Highlights\nMarch 6, 2015 – Shanda Games launched an expansion pack for its 3D action-based massively multi-player online game (\"MMO\") \"Dragon Nest\" in Mainland China. The expansion pack offers players a new \"Dark Avenger\" occupation.\nApril 15, 2015 – Shanda Games launched the 4.8 expansion pack for its 3D fantasy MMO \"AION\" with two new maps and new functions.\nJune 4, 2015 – Shanda Games' subsidiary Eyedentity Mobile published \"Kai-ri-sei Million Arthur\", a 2D mobile card game licensed from the leading Japanese game developer, Square Enix Inc., in South Korea .\nJune 18, 2015 – Shanda Games began open-beta testing for \"Woool Online\", a 2D idle mobile game, in Mainland China.\nJuly 23, 2015 – Shanda Games launched an expansion pack for its 3D action-based MMO \"Dragon Nest\" in Mainland China. The expansion pack offers players a new \"Machina\" occupation.\nJuly 30, 2015 – Shanda Games received the following award from \"2015 Baidu Top Game Search List\": Top Ten Game Operator.\nAugust 3, 2015 – Shanda Games , in cooperation with Shenzhen Tencent Computer System Co., Ltd, began open-beta testing for \"Mir 2 Mobile\", an in-house developed 2D mobile game, in Mainland China.\nAugust 6, 2015 – Shanda Games began close-beta testing for \"Chuan Qi Yong Heng\", an in-house developed martial arts themed 3D MMO game, in Mainland China.\nAugust 20, 2015 – Shanda Games' subsidiary Eyedentity Mobile published \"Wonder5 Master\", a 2D mobile RPG game, in South Korea .\nAugust 21, 2015 – Shanda Games began open-beta testing for \"Legend of Immortals II\", an in-house developed martial arts themed 2.5D MMO game, in Mainland China.\nAugust 27, 2015 – Shanda Games launched a new expansion pack for its 3D action-based MMO \"Dragon Nest\" in Mainland China. This expansion pack enabled a higher level cap to 90, along with more challenging quests and new dungeons.\nSeptember 1, 2015 – Shanda Games' subsidiary Eyedentity Mobile published \"Final Fantasy XIV\", a fantasy-themed 3D MMO game licensed from the leading Japanese game developer, Square Enix Inc., in South Korea .\nSeptember 22, 2015 – Shanda Games began open-beta testing for \"Dungeon Striker Mobile\", an in-house developed 3D mobile game, in Mainland China.\nLegal Proceedings\nOn October 10, 2014 , Kilometre Capital Management Cayman (''Kilometre'') issued a writ of summons endorsed with a statement of claim against the Company from the Court of First Instance of the High Court of the Hong Kong Special Administrative Region in connection with the proposed ''going private'' transaction. Kilometre seeks outstanding consulting fees in an aggregate sum of US$25.6 million (or alternatively, damages), certain declaratory relief, interest, costs and further and/or other relief as the court deems fit. On February 10, 2015 , Kilometre amended its statement of claim to seek outstanding consulting fees in an aggregate sum of US$44.9 million (or alternatively, damages), certain declaratory relief, interest, costs and further and/or other relief as the court deems fit. On February 17, 2015 , Kilometre applied for a summary judgment for consulting fees of US$39,229,944.32 , interest and/or other relief as the court deems fit. In April 2015 , Kilometre issued an invoice to the Company asserting an increased entitlement to US$45.8 million ; however, this amount is yet to be reflected in any further amendment to the statement of claim. On July 8, 2015 , a Hong Kong High Court Judge dismissed Kilometre's summary judgment application and granted the Company unconditional leave to defend Kilometre's claim. The effect of the dismissal of the summary judgment application, subject to any appeal, is that Kilometre's claim will now follow the usual litigation procedure. It can typically take 18 - 24 months to proceed to trial in Hong Kong . There is, at present, no scheduled hearing or further judgment expected from the Hong Kong Courts.\nIn addition, Kilometre served a statutory demand on the Company in the Cayman Islands on May 21, 2015 requesting the Company to pay a purported debt of US$39,229,944.32 within 21 days. On June 9, 2015 , the Grand Court of the Cayman Islands (the \"Grand Court\") granted an injunction restraining Kilometre from representing a winding-up petition against the Company based upon the statutory demand or any other statutory demand in relation to the same claim. On the same day, the Company issued an originating summons from the Grand Court seeking to set aside the statutory demand. On July 22, 2015 , following the dismissal of the Hong Kong summary judgment application , Kilometre gave an undertaking to the Grand Court not to present a winding-up petition against the Company on the basis of the statutory demand pending the resolution of the Hong Kong proceedings. The Company intends to vigorously defend itself against all legal actions taken by Kilometre on the merits. If the Merger is completed prior to the resolutions of the disputes between the Company and Kilometre, then pursuant to the Merger Agreement and the effects of the Merger, the Surviving Corporation will become party to such unresolved disputes and succeed to and assume all of the Company's rights and obligations with respect thereto.\nOn August 18, 2015 , the Shanghai No.1 Intermediate People's Court (the \"Court\") heard a case between Wuhan Shengwei Network Technology Co., Ltd. (\"Shengwei\"), as plaintiff, and Lansha Information Technology ( Shanghai ) Co., Ltd. (\"Lansha\"), a subsidiary of Shanda Games , as defendant with counterclaims, and Shanghai Shengfutong Electronic Business Co., Ltd. (\"Shengfutong\"), a company affiliated with Shanda Interactive Entertainment Limited, a former shareholder of the Company, arising out of a dispute in connection with an agreement regarding Lansha's licensing to Shengwei certain enforcement rights related to the game Mir 2. Based on the original complaint filed by Shengwei dated May 22, 2015 , Shengwei is seeking from Lansha (1) a refund of the license fees of RMB60 million previously paid to Lansha; (2) compensation for the loss of anticipated interest of RMB35,499,600 from Lansha; and (3) court fees. Shengwei also seeks to hold Shengfutong jointly and severally liable for such damages. Lansha filed counterclaims against Shengwei, and seeks to recover from Shengwei (1) damage in the amount of RMB30 million from Shengwei under the relevant agreement; (2) interests on the delayed payment of RMB30 million ; and (3) court fees. The Court has not rendered any judgment. The Company intends to vigorously defend this case on its merits.\nCurrency Convenience Translation\nThe United States dollar (\"US$\") amounts disclosed in this press release are presented solely for the convenience of the reader. The conversion of Renminbi (\"RMB\") into U.S. dollars is based on RMB6.1136 to US$1.00 as published by the People's Bank of China on June 30 , 2015. The Company makes no representation that the Renminbi or U.S. dollar amounts referred to in this release could have been, or could be, converted at such rate or at all. The percentages stated are calculated based on the RMB amounts.\nNote to the Financial Information\nThe unaudited financial information disclosed above is preliminary and subject to adjustments. Adjustments to these preliminary financial statements may be identified when audit work is performed for the year-end audit, which could result in significant differences from this preliminary unaudited financial information.\nNon-GAAP Financial Measures\nIn addition to disclosing financial results in accordance with United States (U.S.) generally accepted accounting principles (GAAP), this earnings release contains non-GAAP financial numbers including non-GAAP gross profit, non-GAAP operating income, non-GAAP net income attributable to the Company's shareholders and non-GAAP earnings per share data.\nThe non-GAAP financial measures disclosed by the Company exclude share-based compensation, amortization of acquisition-related intangible assets, and the related income tax effects. These non-GAAP measures are not in accordance with, or an alternative for, measures prepared in accordance with generally accepted accounting principles and may be different from non-GAAP measures used by other companies. In addition, these non-GAAP measures are not based on any comprehensive set of accounting rules or principles. Shanda Games believes that non-GAAP measures have limitations in that they do not reflect all of the amounts associated with Shanda Games' results of operations as determined in accordance with GAAP and that these measures should only be used to evaluate the Company's results of operations in conjunction with the corresponding GAAP measures.\nShanda Games believes that the presentation of non-GAAP financial measures when shown in conjunction with the corresponding GAAP measures provides useful information to investors and management regarding financial and business trends relating to its financial condition and results of operations. Shanda Games' management also believes that the non-GAAP financial measures are appropriate for period to period comparisons in the Company's budget, planning and evaluation processes. From time to time in the future, there may be other items that Shanda Games may exclude in reviewing its financial results.\nSafe Harbor Statement\nThis announcement contains forward-looking statements. These statements are made under the \"safe harbor\" provisions of the U.S. Private Securities Litigation Reform Act of 1995. Statements in this announcement that are not historical facts, including, but not limited to, statements regarding the long-term growth of the Company; the expansion into mobile games; and the introduction and potential success of new MMO game and mobile game titles represent only the Company's current expectations, assumptions, estimates and projections and are forward-looking statements. These forward-looking statements involve various risks and uncertainties. Important risks and uncertainties that could cause the Company's actual results to be materially different from expectations include, but are not limited to, the risk that the Company is unable to launch the games the Company intends to release; such games and any related expansion packs are not well received by users; the games fail to meet the expectations of end users; the Company fails to execute its mobile strategy and the Company fails to deliver long-term growth, as well as the risks set forth in the Company's filings with the U.S. Securities and Exchange Commission, including the Company's annual report on Form 20-F. The Company does not undertake any obligation to update any forward-looking statement, except as required under applicable law.\nAbout Shanda Games\nShanda Games Limited (NASDAQ: GAME) is a leading online game developer, operator and publisher in China. Shanda Games offers a diversified game portfolio, which includes some of the most popular MMO games and mobile games in China and in overseas markets, targeting a large and diverse community of users. Shanda Games manages and operates online games that are developed in-house, co-developed with world-leading game developers, acquired through investments or licensed from third parties. For more information about Shanda Games , please visit http://www.ShandaGames.com .\nContact\nShanda Games Limited:\nStefanie Guo , Investor Relations\nPhone:+86-21-5050-4740 ( Shanghai )\nEmail: IR@ShandaGames.com\nSHANDA GAMES LIMITED\nUNAUDITED CONDENSED CONSOLIDATED BALANCE SHEETS\n(in millions, except for share and per share data)\nDecember 31\nJune 30\n2014\n2015\nRMB\nRMB\nUS$\nASSETS\nCurrent assets:\nCash and cash equivalents\n797.5\n1,293.7\n211.6\nShort-term investments\n942.4\n170.0\n27.8\nAccounts receivable, net of allowance for doubtful accounts\n231.6\n189.1\n30.9\nDeferred licensing fees and related costs\n1.4\n2.0\n0.3\nPrepayments and other current assets\n282.7\n241.7\n39.6\nDeferred tax assets\n82.0\n65.2\n10.7\nTotal current assets\n2,337.6\n1,961.7\n320.9\nTime deposits with maturity over one year\n2.9\n-\n-\nInvestments in affiliated companies\n194.9\n207.9\n34.0\nProperty and equipment\n140.6\n129.1\n21.1\nIntangible assets\n424.6\n347.9\n56.9\nGoodwill\n297.7\n300.6\n49.2\nLong-term deposits\n14.7\n15.8\n2.6\nOther long term assets\n217.3\n194.5\n31.8\nNon-current deferred tax assets\n17.2\n17.9\n2.9\nTotal assets\n3,647.5\n3,175.4\n519.4\nLIABILITIES\nCurrent liabilities:\nShort-term borrowings\n-\n1.7\n0.3\nAccounts payable\n106.5\n96.5\n15.8\nLicensing fees payable\n142.4\n153.8\n25.2\nTaxes payable\n99.4\n124.2\n20.3\nDeferred revenue\n284.9\n205.5\n33.6\nOther payables and accruals\n350.2\n278.7\n45.5\nDividend payable\n1.6\n1.1\n0.2\nDeferred tax liabilities\n72.5\n39.1\n6.4\nTotal current liabilities\n1,057.5\n900.6\n147.3\nLong-term borrowings\n593.5\n-\n-\nLong-term liabilities\n35.8\n31.5\n5.2\nNon-current deferred tax liabilities\n55.4\n45.0\n7.4\nNon-current deferred revenue\n6.5\n4.5\n0.7\nTotal liabilities\n1,748.7\n981.6\n160.6\nSHAREHOLDERS' EQUITY\nOrdinary shares (US$0.01 par value)\n39.5\n39.7\n6.5\nAdditional paid-in capital\n15.4\n53.1\n8.7\nStatutory reserves\n172.9\n173.9\n28.4\nAccumulated other comprehensive loss\n(48.8)\n(56.1)\n(9.1)\nRetained earnings\n1,434.9\n1,722.4\n281.7\nTotal Shanda Games Limited shareholders' equity\n1,613.9\n1,933.0\n316.2\nNon-controlling interests\n284.9\n260.8\n42.6\nTotal shareholders' equity\n1,898.8\n2,193.8\n358.8\nTotal liabilities and shareholders' equity\n3,647.5\n3,175.4\n519.4\nOrdinary shares outstanding\n537,832,318\n540,839,385\n540,839,385\nADS equivalents outstanding\n268,916,159\n270,419,693\n270,419,693\nSHANDA GAMES LIMITED\nUNAUDITED CONDENSED CONSOLIDATED STATEMENTS OF OPERATIONS\n(in millions, except for share and per share data)\nSix months ended\nJune 30\n2014\nJune 30\n2015\nRMB\nRMB\nUS$\nNet revenues:\nMMO game revenues\n1,784.7\n1,228.4\n200.9\nMobile game revenues\n151.4\n198.7\n32.5\nOther revenues\n20.4\n19.3\n3.2\nTotal net revenues\n1,956.5\n1,446.4\n236.6\nCost of revenues\n(462.9)\n(430.6)\n(70.4)\nGross profit\n1,493.6\n1,015.8\n166.2\nOperating expenses:\nProduct development\n(322.0)\n(297.8)\n(48.7)\nSales and marketing\n(299.5)\n(146.0)\n(23.9)\nGeneral and administrative\n(172.9)\n(142.4)\n(23.3)\nTotal operating expenses\n(794.4)\n(586.2)\n(95.9)\nIncome from operations\n699.2\n429.6\n70.3\nInterest income, net\n0.9\n6.1\n1.0\nGovernment financial incentives\n44.3\n7.2\n1.2\nOther income (expense), net\n(48.2)\n(41.3)\n(6.8)\nIncome before income tax expense and equity in loss of affiliated companies\n696.2\n401.6\n65.7\nIncome tax expense\n(119.1)\n(134.2)\n(22.0)\nEquity in loss of affiliated companies\n(5.6)\n(1.8)\n(0.3)\nNet income\n571.5\n265.6\n43.4\nNet (income) / loss attributable to non-controlling interests\n34.2\n23.9\n4.0\nNet income attributable to the Company's shareholders\n605.7\n289.5\n47.4\nEarnings per ordinary share\nBasic\n1.13\n0.54\n0.09\nDiluted\n1.12\n0.53\n0.09\nEarnings per ADS\nBasic\n2.26\n1.08\n0.18\nDiluted\n2.24\n1.06\n0.18\nWeighted average ordinary shares outstanding\nBasic\n536,873,171\n540,655,143\n540,655,143\nDiluted\n542,993,650\n544,116,032\n544,116,032\nWeighted average ADS outstanding\nBasic\n268,436,585\n270,327,571\n270,327,571\nDiluted\n271,496,825\n272,058,016\n272,058,016\nReconciliation from non-GAAP measures to GAAP measures\nNon-GAAP gross profit\n1,527.8\n1,048.8\n171.6\nIntangible asset amortization arising from acquisitions\n(33.6)\n(33.0)\n(5.4)\nShare-based compensation cost\n(0.6)\n-\n-\nGAAP gross profit\n1,493.6\n1,015.8\n166.2\nNon-GAAP operating income\n768.0\n481.3\n78.7\nIntangible asset amortization arising from acquisitions\n(51.6)\n(49.0)\n(8.0)\nShare-based compensation cost\n(17.2)\n(2.7)\n(0.4)\nGAAP operating income\n699.2\n429.6\n70.3\nNon-GAAP net income attributable to the Company's shareholders\n660.1\n326.6\n53.4\nIntangible asset amortization arising from acquisitions\n(51.6)\n(49.0)\n(8.0)\nShare-based compensation cost\n(17.2)\n(2.7)\n(0.4)\nIncome tax effect\n10.8\n11.0\n1.8\nIntangible asset amortization arising from acquisitions attributable to non-controlling interests\n3.6\n3.6\n0.6\nGAAP net income attributable to the Company's shareholders\n605.7\n289.5\n47.4\nNon-GAAP diluted earnings per share\n1.22\n0.60\n0.10\nNon-GAAP expense per share\n(0.10)\n(0.07)\n(0.01)\nGAAP diluted earnings per share\n1.12\n0.53\n0.09\nNon-GAAP diluted earnings per ADS\n2.44\n1.20\n0.20\nNon-GAAP expense per ADS\n(0.20)\n(0.14)\n(0.02)\nGAAP diluted earnings per ADS\n2.24\n1.06\n0.18\nSupplemental disclosure of intangible asset amortization arising from acquisitions included in:\nCost of revenues\n(33.6)\n(33.0)\n(5.4)\nProduct development\n(13.8)\n(13.8)\n(2.2)\nSales and marketing\n(2.4)\n(0.4)\n(0.1)\nGeneral and administrative\n(1.8)\n(1.8)\n(0.3)\nTotal\n(51.6)\n(49.0)\n(8.0)\nSupplemental disclosure of share-based compensation cost included in:\nCost of revenues\n(0.6)\n-\n-\nProduct development\n(5.7)\n0.1\n0.0\nSales and marketing\n(0.1)\n-\n-\nGeneral and administrative\n(10.8)\n(2.8)\n(0.4)\nTotal\n(17.2)\n(2.7)\n(0.4)\nSHANDA GAMES LIMITED\nUNAUDITED CONDENSED CONSOLIDATED STATEMENTS OF CASH FLOWS\n(in millions, except for share and per share data)\nSix months ended\nJune 30\n2014\nJune 30\n2015\nRMB\nRMB\nUS$\nCash flows from operating activities:\nNet income\n571.5\n265.6\n43.4\nAdjustments for:\nShare-based compensation expenses\n17.2\n2.7\n0.4\nDepreciation and amortization\n122.9\n140.7\n23.0\nOther\n88.1\n(9.1)\n(1.5)\nChanges in operating assets and liabilities, net of effect of acquisitions:\nPrepayments and licensing fees and royalties\n(57.9)\n(21.3)\n(3.5)\nOthers\n(380.0)\n(50.8)\n(8.2)\nNet cash provided by operating activities\n361.8\n327.8\n53.6\nCash flows from investing activities:\nPurchase of property, equipment and intangible assets\n(23.0)\n(27.9)\n(4.6)\nAcquisitions (net of cash acquired) and purchase of equity investments\n(24.2)\n(7.3)\n(1.2)\nDecrease in short-term investments\n820.1\n771.4\n126.2\nOthers\n(5.5)\n(3.9)\n(0.6)\nNet cash provided by investing activities\n767.4\n732.3\n119.8\nCash flows from financing activities:\nPayment for seller financing from Shanda Interactive relating to acquisition of Shengzhan and Shengjing (1)\n(547.5)\n-\n-\nProceeds from loan borrowings and other payables due to former related parties\n719.8\n-\n-\nRepayment of loan borrowings and other payables due to former related parties\n(1,534.7)\n(596.5)\n(97.5)\nDividends paid\n(0.7)\n(0.4)\n(0.1)\nOthers\n1.8\n37.4\n6.1\nNet cash used in financing activities\n(1,361.3)\n(559.5)\n(91.5)\nEffect of exchange rate changes on cash and cash equivalents\n9.3\n(4.4)\n(0.7)\nNet increase (decrease) in cash and cash equivalents\n(222.8)\n496.2\n81.2\nCash and cash equivalents, beginning of period\n877.5\n797.5\n130.4\nCash and cash equivalents, end of period\n654.7\n1,293.7\n211.6\nNote:\n(1) The amount represented partial acquisition payments to Shanda Interactive for acquisition of Shanghai Shengzhan Networking Technology Co., Ltd. (\"Shengzhan\") and Tianjin Shengjing Trade Co., Ltd. (\"Shengjing\") in August 2013. For more details regarding this transaction, please refer to the Company's press release dated July 29, 2013.\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/shanda-games-reports-first-half-2015-unaudited-results-300161787.html\n ", "external_links": ["http://www.shandagames.com/", "http://www.prnewswire.com/news-releases/shanda-games-reports-first-half-2015-unaudited-results-300161787.html", "http://rt.prnewswire.com/rt.gif?NewsItemId=CN31504&Transmission_Id=201510190700PR_NEWS_USPR_____CN31504&DateId=20151019", "http://www.xmlnews.org/ns/"], "published": "2015-10-19T03:00:00.000+03:00", "crawled": "2015-10-19T18:47:45.360+03:00", "highlightTitle": ""}