{"organizations": [], "uuid": "4ab5012acfce2862d7e2a1f06f18b88884746d79", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theday.com", "main_image": "http://www.theday.com/storyimage/NL/20151014/ENT04/151019728/AR/0/AR-151019728.jpg&imageversion=16by9&Maxw=960", "site_section": "http://www.theday.com/section/rss05", "section_title": "The Day RSS Feeds - Entertainment News", "url": "http://www.theday.com/food--drink/20151014/no-drive-thru-needed-for-this-fast-food", "country": "US", "title": "No drive-thru needed for this fast food", "performance_score": 0, "site": "theday.com", "participants_count": 1, "title_full": "No drive-thru needed for this fast food", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T01:13:00.000+03:00", "replies_count": 0, "uuid": "4ab5012acfce2862d7e2a1f06f18b88884746d79"}, "author": "MELISSA D’ARABIAN, Associated Press", "url": "http://www.theday.com/food--drink/20151014/no-drive-thru-needed-for-this-fast-food", "ord_in_thread": 0, "title": "No drive-thru needed for this fast food", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "No drive-thru needed for this fast food Baked eggs in sweet pepper sauce (AP Photo/Matthew Mead) Published October 14. 2015 12:01AM MELISSA D’ARABIAN, Associated Press \nSchool, kids, work ... It’s always something. Whatever the culprit, we are all busy. And on those crazy-busy days, dinner can sneak up on me, and suddenly I find my whole family ravenous. And the busier and more hectic the day, the more likely we are all craving something satisfying and hearty. \nAnd this, my friends, is the perfect storm for making some regrettable food choices. This is when the pizzas get ordered out of desperation, not true desire. And I like to save the once-in-a-while foods like greasy Chinese takeout or drive-thru burgers for just that: once in a while. In our house, fast food is for cravings, not convenience. \nWhen we need a tasty dinner fast (so a trip to the supermarket is out of the question), I turn to a trusty protein source: the egg. Eggs remain one of the least expensive proteins around. Yes, you can do scrambled eggs for dinner (and we do!), but to bump the egg up a notch and get it squarely out of breakfast-for-dinner territory, try these baked eggs in sweet pepper sauce. \nFill a ramekin with about 1/2 cup of sauce or fillings (from cooked meat to tomatoes to salsa and black beans), add the egg and bake for about 8 minutes. Serve with some nice bread you keep in the freezer for just such a culinary emergency, and your fast food becomes a feast. \nThe sauce for these baked eggs uses healthy fast foods you can keep in your pantry, such as jarred roasted red peppers and simple marinara sauce (just check the labels to avoid added sugars). You can throw the whole thing together in less time than it took you to read this. Really. \nBAKED EGGS IN SWEET PEPPER SAUCE \nServes 4 \n1/2 cup chopped jarred roasted red peppers, drained \n2 tablespoons capers, chopped if large \n1/4 cup chopped Kalamata olives \n1 teaspoon Italian seasoning \n1 1/4 cups jarred marinara sauce \n4 eggs \nKosher salt and ground black pepper \nBaguette, sliced \nHeat the oven to 350 F. \nIn a small microwave-safe bowl, mix together the red peppers, capers, olives, Italian seasoning and marinara. Heat in the microwave (cover with a paper towel to avoid splattering) on high until warm, about 30 seconds (depending on oven). \nMist four 8-ounce ramekins with cooking spray. Divide the sauce among the ramekins. Use the back of a spoon to make a crater in the sauce at the center of each ramekin. One at a time, crack each egg into a small bowl, then gently transfer it to the crater in each ramekin. Season with salt and pepper, then give a quick mist of cooking spray. Set the ramekins on a rimmed baking sheet and bake until the whites are set, but the yolks are still runny, 8 to 10 minutes. Serve with slices of baguette.", "external_links": [], "published": "2015-10-14T01:13:00.000+03:00", "crawled": "2015-10-14T12:18:48.819+03:00", "highlightTitle": ""}