{"organizations": [], "uuid": "e1b0ef893d2e1ab04170f62262406cf78be2427d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.vaildaily.com", "main_image": "http://www.vaildaily.com/csp/mediapool/sites/dt.common.streams.StreamServer.cls?STREAMOID=ZIYi9dnGysNYpd6Dvv2OT8$daE2N3K4ZzOUsqbU5sYv0GOOs4hDvcXLs2WDzopf8WCsjLu883Ygn4B49Lvm9bPe2QeMKQdVeZmXF$9l$4uCZ8QDXhaHEp3rvzXRJFdy0KqPHLoMevcTLo3h8xh70Y6N_U_CryOsw6FTOdKL_jpQ-&CONTENTTYPE=image/jpeg", "site_section": "http://www.vaildaily.com/csp/mediapool/sites/SwiftShared/assets/csp/rssCategoryFeed.csp?pub=VailDaily&sectionId=1010&sectionLabel=Entertainment", "section_title": "The VailDaily Section RSS Feed: Entertainment", "url": "http://www.vaildaily.com/entertainment/18645147-113/mnozil-brass-is-next-concert-of-underground-sound", "country": "US", "title": "Mnozil Brass is next concert of Underground Sound Series at Vilar Center", "performance_score": 0, "site": "vaildaily.com", "participants_count": 1, "title_full": "Mnozil Brass is next concert of Underground Sound Series at Vilar Center", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T07:18:00.000+03:00", "replies_count": 0, "uuid": "e1b0ef893d2e1ab04170f62262406cf78be2427d"}, "author": "Krista Driscoll", "url": "http://www.vaildaily.com/entertainment/18645147-113/mnozil-brass-is-next-concert-of-underground-sound", "ord_in_thread": 0, "title": "Mnozil Brass is next concert of Underground Sound Series at Vilar Center", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "What: Mnozil Brass, part of the Underground Sound Series. When: 7:30 p.m. Tuesday, Oct. 20. Where: Vilar Performing Arts Center, 68 Avondale Lane, Beaver Creek. Cost: $30. More information: Tickets are on sale now at the VPAC Box Office, by calling 970-845-8497 or visiting www.vilarpac.org. Related Media BEAVER CREEK — The Vilar Performing Arts Center welcomes the unique and unforgettable septet Mnozil Brass on Tuesday at 7:30 p.m. Mnozil Brass has established itself as one of the world’s premiere brass ensembles. With more than 130 performances per year, the group has sold out houses from the farthest reaches of the European continent to Russia, Israel, China, Taiwan, Japan, Australia, Canada and the United States and has captivated audiences with its blend of immense virtuosity and theatrical wit. ‘Yes! Yes! Yes!’ This season, Mnozil Brass returns to North America with a brand new show. “Yes! Yes! Yes!” premiers on the heels of the group’s 20th anniversary and seamlessly blends original compositions with classical favorites, jazz standards and popular hits. As always, the repertoire is presented with the group’s iconic humor and wit in scenes so clever that they would be worthy of “Monty Python.” Mnozil Brass takes its name from the Gasthaus Mnozil, a restaurant across the street from the Vienna Conservatory, where, in 1992, seven young brass musicians met and began playing at a monthly open mic. Since then, the group has embraced repertoire for all ages and stages of life — from folk to classical to jazz to pop — all executed with the same fearlessness, immense technical skill and typical Viennese “schmah” (almost impossible to find an English translation, but best rendered as a kind of sarcastic charm). In its time away from touring, Mnozil Brass has recorded eight albums and six DVDs. They’ve collaborated on three operetta and opera productions and composed and recorded the music for the 2006 film “Freundschaft.” The group has been nominated for the Amadeus Austrian Music Award and won the prestigious Salzburger Stier Cabaret Prize in 2006. Learn more about the band at www.mnozilbrass.at.", "external_links": [], "published": "2015-10-18T07:18:00.000+03:00", "crawled": "2015-10-18T15:44:09.375+03:00", "highlightTitle": ""}