{"organizations": [], "uuid": "23627d5376aa150ebfb4f12dba510ab9a005efd0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48524/c", "section_title": "Entertainment - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30156147/asia-pacific-online-gaming-market-2015-reportlinker-review", "country": "US", "title": "Asia-Pacific Online Gaming Market 2015 - Reportlinker Review", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Asia-Pacific Online Gaming Market 2015 - Reportlinker Review - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "23627d5376aa150ebfb4f12dba510ab9a005efd0"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30156147/asia-pacific-online-gaming-market-2015-reportlinker-review", "ord_in_thread": 0, "title": "Asia-Pacific Online Gaming Market 2015 - Reportlinker Review", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Reportlinker\nAsia-Pacific Leads the Way in Global Mobile Gaming Boom\nNEW YORK , Sept. 30, Asia-Pacific is reported to be both the largest and the fastest growing gaming market worldwide. While the shift to digital games is happening worldwide, Asia-Pacific already leads the way in mobile gaming revenues, topping all other regions in 2014. Asia-Pacific also stands out in online gaming on computers, with five countries from this region on the list of the top ten countries in online gamer penetration of Internet users last year. Overall, the online gaming market in Asia-Pacific is forecasted to retain double-digit growth rate for the coming years.\nChina , Japan and South Korea are the largest markets for online games in Asia-Pacific and among the most prominent worldwide. In China , the number of people playing games online is nearly four hundred million and a quarter of a billion play mobile games. Distribution of games through mobile chat applications is a major trend, with close to two-thirds of mobile gamers discovering new games through this channel. This trend is also persistent in Japan , where a popular messaging app LINE carries an ever growing number of mobile free-to-play games.. In South Korea , mobile games tripled their share of the gaming market between 2012 and 2013.\nThe South East Asia sub-region is increasingly gaining attention of the global games market players. In 2014, there were close to a hundred million online gamers there and even a large number of mobile gamers. Countries like Thailand , Indonesia , and Vietnam are expanding their market potential with growing Internet and smartphone penetration. While Oceania is an advanced sub-region in these two parameters, Australia and New Zealand are still seeing double-digit growth rates in the digital gaming segment.\nSome major digital games companies operate in the Asia Pacific region. China -based Tencent , which both publishes and distributes games through its platforms, generated several billion of Euros in online and mobile games revenues in 2014. Japan , is home to prominent digital games publishers such as Nexon and GungHo, and made news in early 2015 announcing the strategic cooperation between video games maker Nintendo and mobile games developer DeNA.\nRead the full report: http://www.reportlinker.com/p0850057-summary/view-report.html\nAbout Reportlinker\nReportLinker is an award-winning market research solution. Reportlinker reviews, finds and organizes the latest industry data so you get all the market research you need - instantly, in one place.\nhttp://www.reportlinker.com", "external_links": ["http://www.reportlinker.com/p0850057-summary/view-report.html", "http://www.reportlinker.com/"], "published": "2015-09-30T03:00:00.000+03:00", "crawled": "2015-10-01T06:47:58.042+03:00", "highlightTitle": ""}