{"organizations": [], "uuid": "d97214730080b44582ef92afd94d934fea30d1f8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.vcpost.com", "main_image": "http://images.vcpost.com/data/images/full/77465/playstation-vr.jpg", "site_section": "http://www.vcpost.com/games-entertainment", "section_title": "Games/Entertainment : Venture Capital Post", "url": "http://www.vcpost.com/articles/95616/20150930/playstation-third-intimate-brand-millennials.htm", "country": "US", "title": "PlayStation is the third most intimate brand for millennials", "performance_score": 0, "site": "vcpost.com", "participants_count": 1, "title_full": "PlayStation is the third most intimate brand for millennials : Regions : Venture Capital Post", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T16:59:00.000+03:00", "replies_count": 0, "uuid": "d97214730080b44582ef92afd94d934fea30d1f8"}, "author": "VCpost", "url": "http://www.vcpost.com/articles/95616/20150930/playstation-third-intimate-brand-millennials.htm", "ord_in_thread": 0, "title": "PlayStation is the third most intimate brand for millennials", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sony's PlayStation is in the top three as the most intimate brands for millennials based on the research done by MBLM. The report will be released on October 6.\nMarketing firm MBLM is about to publish its Brand Intimacy 2015 Report. According to the Venture Beat , Sony's PlayStation ranked top three as the most intimate brand for millennials next to Apple and Amazon. Millennials are the people from the age bracket of 18 to 34 years old.\nMBLM identified intimacy as the relationship between brands and people. It's the attachment brands had established with the customers. To create a lasting value is a huge factor for businesses and is an indicator of the company's success.\nIn the same context, research firms recognize millennials has a great influence on the market. \"Millennials are savvy consumers, comfortable in the digital and mobile world we increasingly live in,\" stated Marcelo Nacht of Praxis Research Partners in a statement from PR Web.\nAt this time, the gaming market is worth $100B. And so far, Sony has built up the trust from its customers being one of the major players in the gaming industry.\nIt has been proven that PlayStation has solid fans all over the world. In fact, the PlayStation 4 sells faster than any other Sony devices.\nIt appears that Sony's PlayStation used a different technique as the PS4 still stood out against its rival Microsoft's Xbox. Even though both of them have almost identical features, PS4's messaging attracts more gamers.\nThe marketing company based this year's research out of the responses of 6000 consumers around Mexico, UAE and U.S.A. Accordingly, 54,000 brands were evaluated.\nMBLM is an agency that helps businesses to put up their brand with people and technology. The firm formulates strategies and designs concepts to shape brands in accordance to the company's vision.\nThey have nine offices, including New York, Bogota, Caracas, Dubai, Mexico City, Panama City, Santiago, Stockholm and Toronto, as read in MBLM's LinkedIn profile.\nAs we live in the age of information, communication and technology, it becomes necessary for companies to measure if their product creates an impact in people's lives.\nThe MBLM Brand Intimacy 2015 Report will be published on October 6.\n ", "external_links": ["http://as.ebz.io/scripts/api/beead_apiV3.js", "http://venturebeat.com/2015/09/28/playstation-is-one-of-the-most-intimate-brands-for-millennials/", "http://mgid.com/advertisers/?utm_source=widget&utm_medium=text&utm_campaign=add", "http://mgid.com/", "https://www.linkedin.com/company/mblm", "http://www.prweb.com/releases/2015/09/prweb12981427.htm"], "published": "2015-09-30T16:59:00.000+03:00", "crawled": "2015-10-01T04:29:44.656+03:00", "highlightTitle": ""}