{"organizations": ["Sharp Literacy", "Nordstrom"], "uuid": "ab10660dbb0b70294b85a99f178b12e0f42618d9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.jsonline.com", "main_image": "http://media.jrn.com/images/b99600075z.1_20151023172308_000_g7ld1ms7.1-0.jpg", "site_section": "http://www.jsonline.com/rss?c=y&path=/tablet/entertainment", "section_title": "JSOnline.com Tablet - Entertainment", "url": "http://www.jsonline.com/entertainment/nordstrom-opening-gala-sharp-literacys-novel-event-next-doors-books-for-kids-b99600075z1-336422921.html", "country": "US", "title": "Nordstrom opening gala, Sharp Literacy's 'Novel Event,' Next Door's Books for Kids", "performance_score": 0, "site": "jsonline.com", "participants_count": 0, "title_full": "Nordstrom opening gala, Sharp Literacy's 'Novel Event,' Next Door's Books for Kids", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T01:28:00.000+03:00", "replies_count": 0, "uuid": "ab10660dbb0b70294b85a99f178b12e0f42618d9"}, "author": "", "url": "http://www.jsonline.com/entertainment/nordstrom-opening-gala-sharp-literacys-novel-event-next-doors-books-for-kids-b99600075z1-336422921.html", "ord_in_thread": 0, "title": "Nordstrom opening gala, Sharp Literacy's 'Novel Event,' Next Door's Books for Kids", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Nordstrom opening gala, Sharp Literacy event, Next Door's Books for Kids \nEtta James' classic \"At Last,\" being played by a band near the ladies shoe department during the gala opening of the new Nordstrom's, pretty much summed up the sentiment of more than 1,800 guests who came to shop and admire the impressive new department store. Words and phrases like \"finally,\" and \"It's about time\" were bandied about by shoppers who have waited years for the Seattle chain to commit to the area. \nIt's been two generations — back to the early 1970s when Northridge and Southridge were opened — since local residents have been treated to a brand-new, full-service department store. And the atmosphere at the gala clearly declared the new Nordstrom to be the biggest thing, at least in retailing, to happen to Wauwatosa since Mayfair mall opened there in 1958. So it wasn't surprising that the $100-a-head sneak peek of the store Oct. 21 drew a sellout crowd. \nThe excitement of the moment was being savored by Tosa Mayor Kathy Ehley, who was there to greet guests. The gala was co-chaired by Corry Joe Biddle, Rachael Hughes, Maureen and Ken Manning, Michelle and Cory Nettles, Marie Michel-Tucker and Jacqueline Russell. Those folks represented the three charities — Links Inc., United Way of Greater Milwaukee and Waukesha Counties, and the local Ronald McDonald House — that were recipients of the evening's proceeds of $190,000. \nIn attendance were three fourth-generation Nordstrom family members, Blake and Erik Nordstrom, who are co-presidents, and Jamie Nordstrom, who is president of Full-Line Stores. \nGuests enjoyed hors d'oeuvres, a variety of Wisconsin beers, desserts and could make first dibs on fabulous heels in the awesome shoe department. Among those trying on footwear were Angelia Nowatka and Stefanie Spilde, who said they had put off their customary trips to Nordstrom at Old Orchard in anticipation of the new Mayfair store. Also seen there were Amy Fotsch and her daughter Jenny Austino, son Tim Fotsch, daughter-in-law Rebecca Fotsch and mother-in-law Geri Fotsch, Christi Torkelson, Margaret Dunn, John and JoEllen Stollenwerk, Stephanie Brunkhorst, Sue Culver and her daughter Christine Culver, Mary Strohmaier and her sister Sue Holmes. \nThere was a strong contingent from the local chapter of Links Inc., a women's service organization, that included Thelma Sias, Cecelia Gore, Jackie Herd-Barber and Janice Welburn. Sharp Literacy's 'Novel Event' \nMilwaukee's favorite adopted son Henry Winkler, a.k.a. The Fonz, returned to the city he helped make famous to 1970s TV viewers to give Sharp Literacy a boost in its efforts to promote reading. Winkler was the keynote speaker at Sharp's \"A Novel Event\" on Sept. 28 at the Pfister Hotel. Sharp's mission is to enhance success of students from urban families by encouraging reading, writing and the visual arts. \nWinkler told the luncheon crowd about his own personal struggles learning to read as a child. This challenge formed the basis for a multivolume series of children's books Winkler has co-authored about his alter ego, \"Hank Zipzer, the World's Greatest Underachiever.\" \nThe event was co-chaired by BMO Harris Bank's Raquel Filmanowicz and MillerCoor's Tami Garrison. Among those at Raquel's table were her husband, Steve, Leslie Meisner, Danae Davis, Griselda Aldrete, Jennifer Gonda, Lynn Sheka, Faye Wetzel and Sodi Nichols . Tami also brought her husband, Matthew, and other MillerCoors folks including Jim Kanter and Kim Marotta . Also seen there were Arvind and Namie Ahuja, Wisconsin Superintendent of Public Instruction Tony Evers, Thelma Sias, Anne Stratton and daughter Margy Stratton, Jan Lennon, Andy and Jan Fleckenstein, Sharon Millman, and John Kreilkamp and Marlene Doerr Kreilkamp. Next Door's Books for Kids \nMary Kellner's friends were out in full force to see her honored as the founder of Next Door's Books for Kids program at a party celebrating the books effort's 25th anniversary. The party was held Oct. 7 at the Milwaukee Art Museum. \nMary and her husband, local executive Ted Kellner, were there to greet the many guests that included their daughters and spouses Laura and Brent Lueck and Kristin and Ryan Schultz. Longtime friends Jon and Ann Hammes and Laurie and Mike Mahoney co-chaired the event. Also seen there were Marian and Bill Nasgovitz, Candy Pindyck, Dave and Edie Radtke, Greta and John Collopy, Chris Doerr, Doris Heiser, Roger and Sandy Kriete, John and Linda Mellowes and Peter Schuyler and wife Patty who was Mary's college roommate. \nAlso in attendance were Katie Falk, Jim and Libby Wigdale, Jay and Madonna Williams, Diane and Ed Zore, Scott and Mary Ellen Stanek, Steve and Melanie Booth, and Ellen and Hans Kirkegaard, and George Mosher. \nHarley-Davidson, a longtime supporter of Books for Kids, was also cited at the party. Among the contingent of Harley folks at the party were Tchernavia Rocker and Matt Levatich and his wife, Brenda. \nNext Door is a provider of early education and support services in Milwaukee that has helped fight illiteracy so at-risk children are ready for school. © 2015 , Journal Sentinel Inc. All rights reserved.", "external_links": [], "published": "2015-10-24T01:28:00.000+03:00", "crawled": "2015-10-24T01:31:55.678+03:00", "highlightTitle": ""}