{"organizations": ["BBC", "Iggy Azalea", "State", "Paris Hilton", "CBS Entertainment", "TCA", "The Seattle Times", "BBC Two", "Playboy", "Add Black Keys", "New York Times"], "uuid": "ff27e5a63066607d0f307dcbd8fccc51b16d780b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150528071136-the-good-wife-margulies-panjabi-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_showbiz.rss", "section_title": "CNN.com - Entertainment", "url": "http://edition.cnn.com/2015/10/05/entertainment/good-wife-julianna-margulies-archie-panjabi-feud-thr-feat/index.html?eref=rss_showbiz", "country": "US", "title": "Margulies on 'Good Wife' rumors: 'There's no animosity on my part'", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Margulies on 'Good Wife' rumors: 'There's no animosity on my part'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T14:37:00.000+03:00", "replies_count": 0, "uuid": "ff27e5a63066607d0f307dcbd8fccc51b16d780b"}, "author": "", "url": "http://edition.cnn.com/2015/10/05/entertainment/good-wife-julianna-margulies-archie-panjabi-feud-thr-feat/index.html?eref=rss_showbiz", "ord_in_thread": 0, "title": "Margulies on 'Good Wife' rumors: 'There's no animosity on my part'", "locations": ["United States", "New York", "Paltrow", "Spain", "Gwyneth Paltrow", "Ibiza", "Lady Gaga", "Penn"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kendrick Lamar", "Nicole Richie", "Sheen", "Richards", "Donald Trump", "Aubrey O'Day", "Snoop", "Carter", "Danity Kane", "Richard", "Richie Sambora", "Dawn Richard", "Conan O'Brien", "Miley Cyrus", "Adrienne Bailon", "Holly Madison", "Carney", "Nicki Minaj", "Daniels", "Hugh Hefner", "Bette Midler", "Nina Tassler", "Iggy", "Rob", "Sharon Osbourne", "Breslin", "Drake", "Cruise", "Hillary", "Mariah Carey", "Chloe Sevigny", "Bryan", "Michelle King", "Britney Spears", "Snoop Dogg", "Whoopi Goldberg", "Lorde", "Sambora", "Trump", "Katy Perry", "Freddie Prinze Jr.", "Bon Jovi", "Jimmy Kimmel", "Heather Locklear", "Tamar Braxton", "Winfrey", "Kimmel", "Kendra Wilkinson-Baskett", "Jennifer Lawrence", "Kylie Jenner", "Braxton", "Julianna Margulies", "Robert King", "Terrence Howard", "Iggy Azalea", "Williams", "Orlando Bloom", "Madeleine Albright", "David Letterman", "Justin Bieber", "Hilary Lewis", "Alan Cumming", "Kelly", "Margulies", "Tom Cruise", "Khloe Kardashian", "Sean Penn", "Kim", "Bailon", "Kelly Osbourne", "Stewart", "Kelly O.", "Jon Stewart", "Carey", "Bono", "Eli", "Kalinda", "Pharrell", "Abigail Breslin", "Martha Stewart", "Oprah Winfrey", "Robert", "Sutherland", "Denise Richards", "Brooke Shields", "O'Day", "Madison", "Rihanna", "Brown", "Taylor Swift", "Lee Daniels", "Dwayne", "Kiefer Sutherland", "Panjabi", "Charlie Sheen", "Midler", "Fox", "Karrueche Tran", "Gaga", "Michael Clifford", "Locklear", "Kardashian", "Archie Panjabi", "Patrick Carney", "Donald", "Kim Kardashian", "Prinze", "Nick Cannon", "Chris Brown"], "text": "CNN Leadership <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> Margulies on 'Good Wife' rumors: 'There's no animosity on my part' By Hilary Lewis, The Hollywood Reporter Updated 0012 GMT (0712 HKT) October 6, 2015 37 photos: Biggest celebrity feuds TVLine reported that Julianna Margulies, left, and Archie Panjabi did not actually film their final scene together on the \"Good Wife.\" According to the site, body doubles and special effects were used to create the scene. There have long been rumors of tension between the pair on the set of the hit CBS drama. Hide Caption 1 of 37 37 photos: Biggest celebrity feuds Actor Sean Penn filed a defamation lawsuit against \"Empire\" creator Lee Daniels, alleging that in Daniels' recent interview with The Hollywood Reporter , Penn was falsely accused of hitting women by being likened to \"Empire\" star Terrence Howard. Hide Caption 2 of 37 37 photos: Biggest celebrity feuds Rapper Meek Mill, right, started a Twitter spat on July 21, claiming that Drake doesn't write his own raps . Hide Caption 3 of 37 37 photos: Biggest celebrity feuds Taylor Swift, left, and Nicki Minaj went at it on Twitter after the pop singer took offense at the rapper's comments about her exclusion from video of the year nominees at the MTV Video Music Awards. And as if it that wasn't enough, Katy Perry seemed to weigh in as well. Hide Caption 4 of 37 37 photos: Biggest celebrity feuds Iggy Azalea, left, and Britney Spears were chummy at the Billboard Music Awards in May, but now they may be at odds over the lack of success of their single \"Pretty Girls.\" Hide Caption 5 of 37 37 photos: Biggest celebrity feuds Playboy founder Hugh Hefner's former girlfriends Kendra Wilkinson-Baskett, left, and Holly Madison are arguing over Madison's portrayal of their former life at the Playboy Mansion in her new book. Hide Caption 6 of 37 37 photos: Biggest celebrity feuds Rappers Dwayne \"Lil Wayne\" Carter, left, and Bryan \"Birdman\" Williams were once the father and son of Cash Money Records. Now the pair are in a $51 million dollar court battle over Carter's contract and the delayed release of \"Tha Carter V.\" Hide Caption 7 of 37 37 photos: Biggest celebrity feuds Mariah Carey and Nicki Minaj shared the judges' table during season 12 of \"American Idol,\" and they bickered all season. \"Let's just say I don't think they had any intentions for us to have a good experience doing that show,\" Carey reflected in a recent interview on Australian radio. \"Pitting two females against each other wasn't cool.\" Hide Caption 8 of 37 37 photos: Biggest celebrity feuds When it comes to feuds, you could probably pair Azealia Banks up with any number of people -- particularly Iggy Azalea, with whom she's exchanged many angry tweets . But in the April issue of Playboy, Banks added some targets, saying Pharrell and Kendrick Lamar engage in \"nonthreatening black man sh*t\" and adding that she hates \"everything\" about the United States. Hide Caption 9 of 37 37 photos: Biggest celebrity feuds It seems that not everyone loves Jennifer Lawrence, left. In talking about some of her fellow actresses to V Magazine, Chloe Sevigny said , \"Jennifer Lawrence, I find annoying. Too crass.\" Wow. Hide Caption 10 of 37 37 photos: Biggest celebrity feuds The beef between Lady Gaga and Kelly Osbourne dates to an open letter Gaga wrote , accusing Kelly of being a bully . When Kelly O. saw that Gaga had offered her a birthday cake last October, she tweeted , \"Not to be ungrateful but why would you send me a birthday cake via my MOTHER in a country half the (world) away? ... #EatMyS***.\" Hide Caption 11 of 37 37 photos: Biggest celebrity feuds Onetime friends Denise Richards and Heather Locklear hit a major impasse after the former started dating the latter's ex, Bon Jovi's Richie Sambora. In interviews, Richards denied that she and Locklear were still friends at the time she began seeing Sambora. Hide Caption 12 of 37 37 photos: Biggest celebrity feuds Kanye West has given Jimmy Kimmel the rap feud he's always wanted. After Kimmel poked fun at West's interview with the BBC -- in which the entertainer called himself the No. 1 rock star on the planet -- West went to Twitter to air his profane grievances (in all caps, of course). The two later made amends with a televised sitdown. Hide Caption 13 of 37 37 photos: Biggest celebrity feuds It's a case of he said/she said/he said. Eminem set it off after he claimed to have had a torrid dating relationship with singer Mariah Carey, who denied it. Her husband, Nick Cannon, even offered to defend her honor by meeting the rapper in the ring. Hide Caption 14 of 37 37 photos: Biggest celebrity feuds Oprah Winfrey was reportedly annoyed by David Letterman's constant joking references to her name when he hosted the Academy Awards in 1995. The late-night talk-show host told \"The Daily Show's\" Jon Stewart he had also once played a practical joke on Winfrey, convincing a waiter that she had agreed to pick up his tab. They have since made peace. Hide Caption 15 of 37 37 photos: Biggest celebrity feuds Tom Cruise got on Brooke Shields' bad side by decrying her use of medication to treat postpartum depression. Shields responded with an op-ed in The New York Times, and Cruise later apologized for his remarks. Hide Caption 16 of 37 37 photos: Biggest celebrity feuds Paris Hilton and Nicole Richie helped to coin the term \"frenemies\" after their very public bust-up in 2004. The former \"Simple Life\" co-stars went on to make up two years later. Hide Caption 17 of 37 37 photos: Biggest celebrity feuds It appears that rapper Lil' Kim has not taken too kindly to what she views as Nicki Minaj's lack of respect and similar style with the colored wigs and sexually explicit lyrics. The pair have traded insults all over the media. Hide Caption 18 of 37 37 photos: Biggest celebrity feuds Kanye West and Taylor Swift had one of the greatest celeb feuds of all time. The rapper famously grabbed the singer's mic at the 2009 MTV Video Music Awards. He later apologized, and she seemed to accept his apology via her song \"Innocent.\" Hide Caption 19 of 37 37 photos: Biggest celebrity feuds Model Amber Rose served it up to reality Khloe Kardashian on Twitter after Kardashian criticized her for talking about Kardashian's younger sister Kylie Jenner during an interview. Let's just say the word \"hoe\" was used. Hide Caption 20 of 37 37 photos: Biggest celebrity feuds Abigail Breslin's big music debut did notgo over well with fans of Australian boy band 5 Seconds of Summer. In a song called \"You Suck,\" the actress sings about the wrongdoings of unnamed prior loves; judging from some of the lyrics, 5SOS fans inferred that Breslin was taking aim at 5SOS singer Michael Clifford. They retaliated with a series of mean tweets under the hashtag #AbigailYouTried. Hide Caption 21 of 37 37 photos: Biggest celebrity feuds In a recent interview with the Telegraph , Bette Midler criticized Ariana Grande's pop act as being needlessly sexy, calling it \"terrible,\" \"ridiculous\" and \"silly.\" When Grande heard about it, she called Midler out for being hypocritical. It wasn't long before Midler bowed out of the fight, tweeting, \"all I can say is, 'Spoken like a reformed old whore! She does have a beautiful voice, on a couch or off.' \" Hide Caption 22 of 37 37 photos: Biggest celebrity feuds Lorde is not the kind of girl to stand idly by while someone picks on her friends. When DJ/producer Diplo teased Taylor Swift about her backside, Lorde jumped in with a fiery comeback. If they wind up at a music show together, things may get awkward. Hide Caption 23 of 37 37 photos: Biggest celebrity feuds When Chris Brown learned what \"The Real\" co-hosts Adrienne Bailon and Tamar Braxton had to say about his relationship with Karrueche Tran, the singer defended his (then) girlfriend in a social media tirade. Among other things, Brown criticized Bailon as being an \"ole trout mouth\" and labeled Braxton as \"Muppet Face.\" Hide Caption 24 of 37 37 photos: Biggest celebrity feuds Former Secretary of State Madeleine Albright did not let Conan O'Brien get away with tweeting that he was going as \"Slutty Madeleine Albright\" for Halloween. She came right back at him with a hilarious response. Hide Caption 25 of 37 37 photos: Biggest celebrity feuds Add Black Keys drummer Patrick Carney, right, to the list of musicians unimpressed with U2's attempt to give away an album on iTunes. Carney told The Seattle Times that he believes the band, fronted by Bono, \"devalued their music completely\" by offering the new release \"Songs of Innocence\" as a free download to iTunes subscribers. Hide Caption 26 of 37 37 photos: Biggest celebrity feuds Sharon Osbourne is also not a fan of U2's giveaway. The TV personality took the group and Bono to task in September 2014 for releasing a free album via iTunes. She called their music \"mediocre\" and the group \"middle-age political groupies.\" Hide Caption 27 of 37 37 photos: Biggest celebrity feuds Snoop Dogg and Iggy Azalea also battled in a very public way. After Snoop made fun of Iggy's appearance on social media , the \"Fancy\" rapper responded with confusion, saying that she didn't understand why Snoop would be \"supportive to my face but another way on your Instagram.\" Hide Caption 28 of 37 37 photos: Biggest celebrity feuds It seems Martha Stewart isn't the biggest fan of Gwyneth Paltrow's lifestyle brand, GOOP, but Paltrow isn't bothered. After Stewart commented in an interview that Paltrow \"just needs to be quiet\" and not try \"to be Martha Stewart,\" Paltrow took it as a compliment. \"I'm so psyched that she sees us as competition,\" the actress said in October. Hide Caption 29 of 37 37 photos: Biggest celebrity feuds Danity Kane's reunion is over as quickly as it began. The girl group got back together in 2013 after a four-year hiatus, but by August its bond was broken again because of an alleged dispute between Aubrey O'Day, left, and Dawn Richard. O'Day has claimed Richard punched her in the back of the head without provocation, while Richard says O'Day and another member were cutting her out of the group. Hide Caption 30 of 37 37 photos: Biggest celebrity feuds Last August, Donald Trump protested via Twitter about two American Ebola patients returning to the United States. Whoopi Goldberg responded on her show that while Trump is her friend, \"that was a stupid comment. Do your homework, Donald. Just do your homework.\" Hide Caption 31 of 37 37 photos: Biggest celebrity feuds A recent TMZ video appeared to show actor Orlando Bloom and pop singer Justin Bieber having an altercation at a bar in Ibiza, Spain, but neither star has commented on the report. That hasn't stopped the world from imagining that these two had a heated throwdown. Hide Caption 32 of 37 37 photos: Biggest celebrity feuds Kim Kardashian didn't mention actress Adrienne Bailon by name when she went on a Twitter rant last July, but it was pretty obvious whom she was speaking of. Bailon, who used to date Kim's brother Rob, spoke ill of the past relationship in a magazine interview. Kim then tweeted, \"Funny how she says being with a Kardashian hurt her career yet the only reason she has this article is bc she is talking about a Kardashian ... So sad when people try to kick my brother when he is down #FamilyForever.\" Hide Caption 33 of 37 37 photos: Biggest celebrity feuds Freddie Prinze Jr. worked with Kiefer Sutherland on the Fox series \"24\" in 2010 and said his experience with the actor was so horrible, he wanted to quit acting. Yet while Prinze called Sutherland \"the most unprofessional dude in the world,\" Sutherland responded via his rep that he enjoyed working with his former co-star. Hide Caption 34 of 37 37 photos: Biggest celebrity feuds Rihanna's bare-it-all style caught flak from the ladies of TLC. \"Every time that I see you, you don't have to be naked,\" T-Boz said during a recent interview with an Australian media outlet . \"We became the biggest-selling girl group of all time with our clothes on.\" Rihanna's response? A series of pointed subtweets and a new Twitter header that shows a topless TLC. Hide Caption 35 of 37 37 photos: Biggest celebrity feuds Charlie Sheen is also unhappy with Rihanna. Sheen tweeted that the singer declined to meet him and his gal pal when they all landed at the same restaurant in May. The actor went on a bit of a Twitter rant , saying, \"it was a pleasure NOT meeting you.\" We think Rihanna might have responded when she tweeted , \"If that old queen don't get ha diapers out of a bunch...\" Hide Caption 36 of 37 37 photos: Biggest celebrity feuds Katy Perry got a tongue-lashing from Miley Cyrus after she dissed the younger singer's hygiene on an Australian morning show last year. The two seem to have patched things up: the two joked around at the 2015 Grammys. Hide Caption 37 of 37 (The Hollywood Reporter) Julianna Margulies finally weighed in on the long-simmering rumors of a feud between her and former \"Good Wife\" co-star Archie Panjabi. And Margulies claims \"there's no animosity\" from her and the whole story is just \"gossip.\" Speaking at the New Yorker Festival on Sunday, Margulies said, according to Vulture, \"I've heard about [the feud]. Who says that? It's totally gossip. I heard that question had been asked to [co-showrunner] Robert King. There's no story there, sorry ... I actually had heard [that rumor] and I feel that it has been talked about and answered. I feel people just like to have gossip or make something into something that isn't there. There's no animosity on my part. It's a shame, because I wonder if it was two men, when one finds out that he f—ed his best friend's wife, if it would get that same attention, you know what I mean?\" Read more: 'The Good Wife's' Alan Cumming on that surprise Eli twist: \"He's out for revenge\" Whispers that the two actresses didn't get along, for an unknown reason, grew louder as the two failed to share a scene together for more than 30 episodes. And then after they finally did reunite onscreen in the sixth season finale, for Panjabi's last appearance on the show, it was revealed that the two didn't film the scene together, but instead special effects were used to make it look like they did. Read more: 'The Good Wife' showrunners on Hillary and Trump in new season and branching out As for that scene, specifically, Margulies says it was King's idea to film it that way and suggests that scheduling difficulties, particularly Panjabi filming \"The Fall\" for BBC Two, contributed to the need for special effects. \"It was shot the way Robert wanted to shoot it, and the storyline, too,\" Margulies said, according to Vulture. \"You also have to remember, there's difficulty ... [Panjabi] was also doing another show, called 'The Fall.' I went along with whatever Robert asked me to do and I did it happily.\" Read more: 'The Good Wife's' new addition tackles comparisons: \"Kalinda was then and this is now\" Shortly after Vulture's coverage of Margulies' remarks was posted online, though, Panjabi tweeted that there wasn't a scheduling issue on her part. \" @TheFallTV was not even in production at that time and I was in New York ready to film the scene!\" Panjabi tweeted. http://t.co/7Ci8jY9lSf . @TheFallTV was not even in production at that time and I was in New York ready to film the scene! — Archie Panjabi (@PanjabiArchie) October 5, 2015 Outgoing CBS Entertainment chairman Nina Tassler addressed the scene at this summer's TCA press tour, saying, \"I'm not going to reveal movie magic. The ending was very satisfying for the characters and I stand by how Robert and Michelle King produce their show.\" ©2015 The Hollywood Reporter. All rights reserved. More from Entertainment", "external_links": [], "published": "2015-10-06T14:37:00.000+03:00", "crawled": "2015-10-06T14:52:53.255+03:00", "highlightTitle": ""}