{"organizations": [], "uuid": "50d9745551fb1383a7fb6d8437c7304ff37857f0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mpnnow.com", "main_image": "http://www.mpnnow.com/storyimage/NU/20151016/NEWS/151019676/AR/0/AR-151019676.jpg", "site_section": "http://www.mpnnow.com/entertainment?template=rss&mime=xml", "section_title": "Entertainment - MPNnow", "url": "http://www.mpnnow.com/article/20151016/NEWS/151019676/2052/ENTERTAINMENT?rssfeed=true", "country": "US", "title": "A musical night of 'tone poems' Saturday in Bloomfield", "performance_score": 0, "site": "mpnnow.com", "participants_count": 1, "title_full": "A musical night of 'tone poems' Saturday in Bloomfield", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T03:02:00.000+03:00", "replies_count": 0, "uuid": "50d9745551fb1383a7fb6d8437c7304ff37857f0"}, "author": "Messenger Post", "url": "http://www.mpnnow.com/article/20151016/NEWS/151019676/2052/ENTERTAINMENT?rssfeed=true", "ord_in_thread": 0, "title": "A musical night of 'tone poems' Saturday in Bloomfield", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A musical night of 'tone poems' Saturday in Bloomfield The Finger Lakes Concert Band performs Saturday night at the Bloomfield High School Performing Arts Center. Comment Posted Oct. 16, 2015 at 7:02 PM Updated Oct 16, 2015 at 7:02 PM By Messenger Post Posted Oct. 16, 2015 at 7:02 PM Canandaigua, N.Y. BLOOMFIELD — James Bond and the Lord of the Rings, as well as Berlioz’s “Symphonie Fantastique” and MacDowell’s “Woodland Sketches,” are part of what promises to be a memorable and diverse musical evening concert offered by the Finger Lakes Concert Band. The performance is scheduled for 7 p.m. today at Bloomfield High School Performing Arts Center, 1 Oakmount Ave. According to concert band director and conductor Gregory Kane, the concert will feature challenging and melodic \"tone poems.\" \"This is music that the audience will love: We take you to Ringling Brothers’ circus and then on to Berlioz’s 'March to the Scaffold,'\" he stated. \"We explore the exciting sounds of James Bond and Lord of the Rings’ 'Gandalf.' The rich harmonies of Grainger’s 'Irish Tune for County Derry' and lush selections from MacDowell’s 'Woodland Sketches' may just move you to tears with their beautiful arrangements. We hope you come and enjoy this musical adventure.” Tickets are $5 for adult general admission; student admission is free. Kane teaches music in the Canandaigua school system and is a passionate believer that music should be taught in all schools to children of all ages. As a graduate of The Crane School of Music, he holds bachelor degrees in both music education and French horn performance. He also holds a masters of music in music education from Ithaca College in addition to completing coursework at the Eastman School of Music. As a performer, he enjoys performing as a jazz pianist, as well as on the French horn. He has performed with the Monroe County Music Educator’s Wind Ensemble, Southern Tier Symphony Orchestra, Southern Tier All-Star Jazz Band, Greater Finger Lakes Jazz Orchestra, Hornell Area Wind Ensemble and Honeoye Falls Community Band, and at various other free-lance performances. By Messenger Post", "external_links": [], "published": "2015-10-17T03:02:00.000+03:00", "crawled": "2015-10-18T20:49:23.299+03:00", "highlightTitle": ""}