{"organizations": [], "uuid": "a2a9d0d5fad954c6c7a8d58e434f0ae56a8c512c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "entertainment.ie", "main_image": "http://images.entertainment.ie/images_content/rectangle/620x372/maxresdefault20151015146705.jpg", "site_section": "http://entertainment.ie/life", "section_title": "Life photo galleries premieres interviews videos rumours news stories - entertainment.ie ", "url": "http://entertainment.ie/cinema/news/Die-Hard-prequel-in-works-effectively-mercy-killing-the-franchise-once-and-for-all/371580.htm", "country": "IE", "title": "MovieNews | Die Hard prequel in works, effectively mercy-killing the franchise once and for all", "performance_score": 0, "site": "entertainment.ie", "participants_count": 1, "title_full": "MovieNews | Die Hard prequel in works, effectively mercy-killing the franchise once and for all - entertainment.ie", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T22:06:00.000+03:00", "replies_count": 0, "uuid": "a2a9d0d5fad954c6c7a8d58e434f0ae56a8c512c"}, "author": "Brian Lloyd", "url": "http://entertainment.ie/cinema/news/Die-Hard-prequel-in-works-effectively-mercy-killing-the-franchise-once-and-for-all/371580.htm", "ord_in_thread": 0, "title": "MovieNews | Die Hard prequel in works, effectively mercy-killing the franchise once and for all", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "It's had a good run, folks.\nDie Hard has sat as a paragon of everything an action movie could be - fun, intelligent, witty, thrilling, unpredictable. Now? It's Bruce Willis and Actor That Studio Is Furiously Trying To Push On The World™ and everyone's just depressed trying to remember back to the glory days.\nWhat's happening now will, we hope, finish off Die Hard once and for all. A prequel is currently in the works with director Len Wiseman - who did Die Hard 4.0, by the way - setting the film up in 1979 New York. The film will open and close with Bruce Willis explaining how he became the John McClane we all know and love.\nNo actor has been selected as yet to play young Bruce Willis, but we can smell the stink coming off this thing from here. Why is this such a terrible idea, you ask? Let's look at it like this. Have you seen Jaws 2? Neither have we. You've seen Jaws, though, right? Exactly.\nJaws was incredible, one of the best films ever made and just about everyone loves it. Nobody cares about the sequels. The same can be said for Die Hard. Sure, Die Hard 2: Die Harder had some pretty cool moments and Die Hard With A Vengeance was pretty great, too. Die Hard 4.0 - or Live Free Or Die Hard - or Bruce Willis Comes To Terms With Middle Age - was pretty middle of the road and inoffensive.\nA Good Day To Die Hard was a cheap mockery of what came before. So unless we're mistaken, the Die Hard prequel will be down there with the American Psycho sequel and Breakin' 2: Electric Boogaloo as the Most Unnecessary Film Of All Time. Don't get us wrong - we want to believe in this film. We absolutely do. And we believed in A Good Day To Die Hard and look where that got us. Bruce Willis and Jai \"I Can't Believe I Still Get Work\" Courtney. In Russia with CGI explosions.\nExactly.\nVia Deadline\nMORE: Eight of the best alternate endings in film\nMORE: Ten movies you need to see before the end of 2015\nMORE: Marvel says Avengers: Infinity War will be the end of 'The Avengers as we know them'", "external_links": ["http://deadline.com/2015/10/die-hard-6-len-wiseman-lorenzo-dibonaventura-bruce-willis-prequel-1201582142/"], "published": "2015-10-15T22:06:00.000+03:00", "crawled": "2015-10-16T04:11:16.697+03:00", "highlightTitle": ""}