{"organizations": [], "uuid": "2af60b0911080f9a42afdce780fdc0db506303c2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.spokesman.com", "main_image": "http://media.spokesman.com/img/logos/sr200.png", "site_section": "http://www.spokesman.com/feeds/stories/entertainment/", "section_title": "Spokesman.com: Entertainment stories", "url": "http://www.spokesman.com/stories/2015/oct/15/review-bridge-of-spies-is-an-absorbing-slow-burn/", "country": "US", "title": "Review: ‘Bridge of Spies’ is an absorbing slow burn - Thu, 15 Oct 2015 PST", "performance_score": 0, "site": "spokesman.com", "participants_count": 0, "title_full": "Review: ‘Bridge of Spies’ is an absorbing slow burn - Thu, 15 Oct 2015 PST", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T10:00:00.000+03:00", "replies_count": 0, "uuid": "2af60b0911080f9a42afdce780fdc0db506303c2"}, "author": "", "url": "http://www.spokesman.com/stories/2015/oct/15/review-bridge-of-spies-is-an-absorbing-slow-burn/", "ord_in_thread": 0, "title": "Review: ‘Bridge of Spies’ is an absorbing slow burn - Thu, 15 Oct 2015 PST", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Alan Alda", "Steven Spielberg", "Mark Rylance", "Tom Hanks"], "text": "Credits: Directed by Steven Spielberg, starring Tom Hanks, Mark Rylance, Alan Alda \nRunning time/rating: 2:22, PG-13 for some violence and brief strong language \nSteven Spielberg’s “Bridge of Spies,” much like its misunderstood litigator, is a film that plays the long game. This complex Cold War drama soaked in shadows, blues, greys and furrowed brows, is a slow burn that challenges the audience to trust where it’s going. \nIn this fictional rendering of how a Brooklyn insurance lawyer ended up negotiating a high-stakes prisoner exchange at the height of the Cold War, Spielberg and writers Matt Charman and Joel and Ethan Coen toss details at you, shake them all around and piece them back together in the third act, when the form of the puzzle starts to take shape. Only then can you begin to fully appreciate just how lean and purposeful every moment is. \nSuddenly that seemingly random conversation about clients and incidents from the first act isn’t an outlier after all – it means everything. As a first time viewing experience, it’s like not realizing you’ve been playing a game of chess until you’ve already lost. \nThat’s all to say that “Bridge of Spies,” which waxes poetic – and occasionally cynically – on patriotism, honor, and duty, echoes in your mind long after the credits roll and begs for a second viewing. \nOn the page, “Bridge of Spies” is the story of everyman James B. Donovan (Tom Hanks), a lawyer and family man who takes on the thankless task of representing Soviet Agent Rudolf Abel (Mark Rylance) in a trial, only to then be called on to negotiate his exchange for a detained U.S. soldier on behalf of the CIA. But that’s just scratching the surface of this very thoughtful meditation on doing the right thing – embodied in the burgeoning friendship between Abel and Donovan. \nDonovan fights for Abel despite the scorn of the public, the indifference of the legal system and the danger to his family. When he goes to Berlin to negotiate the exchange of Abel for a detained U-2 pilot Francis Gary Powers (Austin Stowell), Donovan decides, against the wishes of the U.S., to try to tack on the release of another imprisoned American as well. \nThis all makes Donovan sound like a martyr. The film fights against that cozy idea, though. Donovan is not sentimentalized or propped up in an unbelievable way. In Hanks’ hands, Donovan is a real person, runny nose, doubts and all. Reality, tedium and wit supersede the hyperbole of the great man myth. In this way, it makes “Bridge of Spies” feel like a spiritual companion to “Lincoln.” \nPerhaps most unexpected, though, is how Rylance sneaks up on you and proves himself to be the heart, soul, and standout of the film. \nThe Shakespearean actor is actually the first person we meet, in an elegant, nearly dialogue-free opening showing the FBI’s real time pursuit and arrest of Abel. Cold War-era fears want to paint him as the face of the enemy, but Rylance makes Abel sympathetic, and even docile. He plays him as a highly intelligent foot soldier who’s seen enough to know that even possible execution isn’t enough to get worked up over. It’s impossible not to like him. \nBut the story’s focus on Abel is juxtaposed with near indifference to Francis Gary Powers and the detained American student Frederic Pryor (Will Rogers). Donovan wants to get them both out, and is confident enough in his negotiating skills to defy the CIA in the process, but the film doesn’t seem to care if you care about them – at least not in the way it does for Abel. \nIt’s in these unexpected details and choices that Spielberg continues to defy our skeptical movie expectations. He has a point of view, he has a plan, and he remains in a class of his own in his ability to both execute those ambitions and entertain in the process. \n© Copyright 2015 Associated Press. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.", "external_links": [], "published": "2015-10-15T10:00:00.000+03:00", "crawled": "2015-10-15T10:32:31.747+03:00", "highlightTitle": ""}