{"organizations": [], "uuid": "7d405a40586b456a1048ef84e4ac3a0680767db6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "savannahnow.com", "main_image": "http://savannahnow.com/sites/default/files/14831223.jpg", "site_section": "http://savannahnow.com/", "section_title": "savannahnow.com | Savannah Georgia's source for News, Entertainment, Sports, Weather, Classifieds, Jobs, Autos, Real Estate and St. Patricks Day", "url": "http://savannahnow.com/sports/2015-10-22/racer-ages-hall-famer-brian-redman-brings-skills-stories-savannah", "country": "US", "title": "A racer for the ages: Hall of Famer Brian Redman brings skills, stories to Savannah", "performance_score": 0, "site": "savannahnow.com", "participants_count": 1, "title_full": "A racer for the ages: Hall of Famer Brian Redman brings skills, stories to Savannah | savannahnow.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T18:10:00.000+03:00", "replies_count": 0, "uuid": "7d405a40586b456a1048ef84e4ac3a0680767db6"}, "author": "NATHAN DOMINITZ • 912-652-0350", "url": "http://savannahnow.com/sports/2015-10-22/racer-ages-hall-famer-brian-redman-brings-skills-stories-savannah", "ord_in_thread": 0, "title": "A racer for the ages: Hall of Famer Brian Redman brings skills, stories to Savannah", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photos Back | Next Sportscar driving legend and multiple world champion Brian Redman is participating at the Savannah Speed Classic.\nPhoto courtesy James Redman/Historic Sports Racing Ltd. Back | Next Photo courtesy Savannah Speed Classic\nBrian Redman will be driving the BMW CSL model for “hot laps” with members of the public around the Grand Prize of America road course in Savannah this weekend. He was a co-driver of the car when it won the 1975 Sebring 12-hour race.\nBy NATHAN DOMINITZ • 912-652-0350\nBrian Redman says he doesn’t drive faster than his age on public roadways. He’s 78 years old.\nThat still could be a problem for the rest of us if he was some other septuagenarian from South Florida, not a hall of fame race car driver who stays within reasonable speed limits.\n“I never go above 78 on the highway,” Redman said this week by telephone from Vero Beach, Fla. “I don’t feel any need to do anything (faster). I get my experience from being on the track.”\nRedman has five-plus decades of experience on race tracks around the world. He’s driven as fast as possible in race cars built by BMW, Ford, McLaren, Aston Martin, Porsche, Lola, Ferrari, Chevron, Jaguar and others.\nHe drove up the interstate this week for the annual Savannah Speed Classic at the Grand Prize of America road course on Hutchinson Island. While he’s been in the area many times to race at Roebling Road Raceway in Bloomingdale, it’s his third time at the Speed Classic. One of his duties will be driving “hot laps” when members of the public pay to be passengers going very fast in a real race car.\nRedman will be behind the wheel of a car particularly special to him, BMW Motorsport and BMW of North America. It was 40 years ago that he co-drove the BMW CSL model race car to victory at the 1975 12 Hours of Sebring. It was BMW’s first racing win in the United States.\n“It was a huge deal because BMW was a relatively new car in America,” Redman recalled. “The majority of Americans thought that BMW stood for British (not Bavarian) Motor Works.”\nThe car is still around and in good working order in 2015. So is Redman.\n“I didn’t know I was going to be around,” he quipped.\nThe personable Englishman can reflect on a career when he was one of the world’s elite drivers from open-wheel to sports cars, and feel fortunate. Along with capturing Sports Car Club of America Formula 5000 season titles in 1974, ’75 and ’76 and the 1981 IMSA GTP championship, he won numerous individual races including the 24 Hours of Daytona three times. He has been inducted into both the Motorsports Hall of Fame of America (2002) and International Motorsports Hall of Fame (2011).\nHe credits being part of good teams and having good timing — as in knowing when to make moves and when to back off.\n“It’s definitely a question of getting the right break at the right time,” Redman said. “You know that. The temptation when you get that kind of break is to try too hard and crash or blow it up.”\nMistakes can be costly, not only in terms of race position or series points but as a matter of life and death. So many of auto racing’s safeguards were put in place after Redman competed at the highest levels from the mid-1960s to 1989.\n“It’s my 56th year of racing now, so I’ve been very, very lucky because I came from an era when it was so dangerous,” Redman said. “Somehow. I was badly injured three times (and lived). Most of my friends only had one bad accident and they were killed.”\nRedman, who was badly burned in one fiery crash, said he and his wife didn’t talk much about the dangers of his chosen profession. But she spoke up after he nearly lost his right arm when it was pinned between his Formula One car and a barrier after his suspension broke and he crashed at the 1968 Belgian Grand Prix.\n“The only thing my wife really said was ‘I’d really prefer that you don’t race.’ I didn’t say anything. I just carried on. We know the dangers. It was a very difficult time in the ’60s.”\nA driver, he said, would kiss his wife and children goodbye and, “You knew it could be the last time you’ll see them. It was a very difficult time.”\nPerhaps no time was tougher than a Can-Am race when he went airborne at 170 mph and the car turned over. The roll bar broke, and so did his neck, his shoulder, his ribs. He was helpless in the open cockpit as his helmet scraped along the track.\nAnd that wasn’t all.\n“The ambulance blew a tire on the way to the hospital,” Redman said, noting that detail was captured by a newspaper photograph of him in the ambulance while the crew repaired the wheel.\n“The Montreal newspaper the next day declared, ‘Redman is dead,’” he said, translating the headline from French.\nBut, like a famous Quote: attributed to Mark Twain, reports of his death were greatly exaggerated. Redman said he’s glad they were wrong.\nMoving on\nThough he retired more than once from the sport he loves, he didn’t then. “At that point, I lived what was really an ideal life,” he said, noting a beautiful home in England and a thriving racing career in America. He recovered and carried on.\n“I didn’t actually retire at 52,” Redman said. “That was 1989. The phone stopped ringing. Nobody was calling me to ask me to drive.”\nHe still drives, primarily vintage cars such this week in Savannah. His son, James Redman, is the general manager of Historic Sportscar Racing Ltd., which manages the Speed Classic.\nNo other family members are involved in racing, though Brian Redman said his daughter Charlotte would be good at it.\n“She’s very competitive,” he said, recalling how she once knocked him off the track during a go-kart race.\n“That wasn’t a good place to try and pass,” he advised. “You should have waited until the next corner.”\nHer response: “Well, you were in the way.”\nSAVANNAH SPEED CLASSIC\nPARTY SCHEDULE\nTODAY: Riverfront Wine Dinner featuring grand marshal Skip Barber, 6:30 p.m., Bohemian Hotel Savannah Riverfront. $125 per person.\nRACING SCHEDULE\nAt Grand Prize of America road course, Hutchinson Island; presented by Mingledorff’s Inc. Schedule subject to change.\nTODAY: Qualifying sessions 8 a.m. to 5 p.m.; hot laps, 11:15 a.m. (45 minutes); lunch/track touring, noon. Bob Woodman Tire International/American Challenge 3:45 p.m.; hot laps, 4:20 p.m. (30 minutes).\nSATURDAY: Qualifying and racing sessions 8 a.m. to 5:15 p.m.; manufacturer corporate laps, 10:40 a.m.; hot laps, 11:10 a.m. (30 minutes); lunch/track touring, 11:40 a.m., followed by pre-race ceremonies, national anthem with Savannah Children’s Choir, race commander Mayor Edna Jackson; BRM Enduro H/P/GTM, 1:10 p.m.; hot laps, 4:15 p.m. and 5:45 p.m. (each 30 minutes).\nSUNDAY: Racing 9 a.m. to 4:05 p.m.; to BRM GTC Enduro Challenge, 9 a.m.; hot laps, 10:40 a.m. (20 minutes); lunch/track touring, 11-noon; BRM Vintage Enduro Challenge, 12:30 p.m.; hot laps, 1:40 and 3:10 p.m. (each 30 minutes) and 4:40 p.m. (25 minutes).\nINFORMATION: For more details, ticket prices and a full schedule of events for the 2015 Savannah Speed Classic, go to www.SavannahSpeedClassic.com . For more on the Hilton Head Island (S.C.) Motoring Festival & Concours d’Elegance on Oct. 30-Nov. 1, go to http://www.hhiconcours.com.", "external_links": ["http://sav-cdn.com/sites/all/themes/whitelabel/images/blank.gif", "http://sav-cdn.com/sites/default/files/imagecache/story_slideshow_thumb/14831223.jpg", "http://sav-cdn.com/sites/default/files/imagecache/superphoto/14832101.jpg", "http://sav-cdn.com/sites/default/files/imagecache/story_slideshow_thumb/14832101.jpg", "http://sav-cdn.com/sites/all/themes/savannahnow/images/blank.gif", "http://sav-cdn.com/sites/default/files/imagecache/superphoto/14831223.jpg"], "published": "2015-10-22T18:10:00.000+03:00", "crawled": "2015-10-23T08:18:44.013+03:00", "highlightTitle": ""}