{"organizations": ["Rubell Family Collection", "Facebook Full", "LinkedIn Pinterest Full", "Detroit Institute of Arts", "Facebook Email Twitter Google"], "uuid": "4faa619d29f64598f981c6bfe71316a584f55e34", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.detroitnews.com", "main_image": "http://www.gannett-cdn.com/-mm-/7f85032e3b0d34ea85721c9fb8ffc465b23c6fff/c=0-563-2265-1837&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/08/DetroitNews/B99310845Z.1_20151008104716_000_GDRJOLKA.1-0.jpg", "site_section": "http://rssfeeds.detroitnews.com/detroit/entertainment", "section_title": "Detroit News - Entertainment", "url": "http://www.detroitnews.com/story/entertainment/2015/10/08/detroit-art-museums-exciting-fall-lineup/73577954/", "country": "US", "title": "Full fall lineup at area art museums", "performance_score": 0, "site": "detroitnews.com", "participants_count": 0, "title_full": "Full fall lineup at area art museums", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T17:47:00.000+03:00", "replies_count": 0, "uuid": "4faa619d29f64598f981c6bfe71316a584f55e34"}, "author": "", "url": "http://www.detroitnews.com/story/entertainment/2015/10/08/detroit-art-museums-exciting-fall-lineup/73577954/", "ord_in_thread": 0, "title": "Full fall lineup at area art museums", "locations": ["Detroit"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Michael H. Hodges", "Kehinde Wiley"], "text": "Above: Waud talks of the transformation of the abandoned house in Hamtramck, where 37 floral designers will divvy up 17 different rooms and cover its dilapidated walls, ceilings and cabinets with plants, flowers, herbs, and foliage. (Photo: Max Ortiz / The Detroit News) 1404 CONNECT 37 TWEET 2 LINKEDIN 7 COMMENT EMAIL MORE \nThe steady hum of freeway traffic flows down I-75 as a nearby house, forgotten by time, sits empty. \nPlywood covers its broken windows. A cement step is missing. Massive pieces of peeling paint dangle from the ceiling inside. \nFloral designer Lisa Waud bought the abandoned house at a Hamtramck city auction last fall for $250. But she doesn’t see a dilapidated old house. She sees a blank canvas. \nLater this month, Waud and a team of floral designers from all over southeast Michigan and the country will embark on an ambitious plan to transform this run-down duplex on the I-75 service drive into a house of flowers. It’s called Flower House. \nThirty-seven designers will divvy up 17 different rooms and, using a lot of water tubes and chicken wire, they’ll cover walls, ceilings and cabinets with plants, flowers, herbs, and foliage. Flower House opens to the public for tours Oct. 16 for three days only. The house will later be torn down and the lot turned into an urban flower garden for Waud’s business. \n“I think there’s a little bit in this story for everyone,” says Waud, the Flower House creator who owns the pot & box flower shop in Hamtramck. “It’s flowers, it’s art, it’s an abandoned building in Detroit, it’s deconstruction, it’s a flower farm.” \nThe installation — which may be the first of its kind — has attracted attention from across the country. So many floral designers asked to be part of the project that Waud asked them to submit applications. She recently filmed a television segment for Martha Stewart. \nWaud says the project was inspired by two different elements. She’s always loved the work of artists Christo and Jeanne-Claude, who are known for their large-scale art installations such as the Gates at Central Park. She also was inspired by a 2012 Dior fashion show, held in a flower-filled mansion outside Paris. \n“I was just always really smitten with the idea of these massive scale, long-term planning (installations) that can only be experienced for a short period of time,” says Waud, who grew up in Petoskey and studied horticulture at Michigan State University before moving to Washington, Hawaii, and then, eventually, returning to Michigan. “There’s just something about that.” \nAnd when she saw the Dior show, “I wanted to be there,” says Waud, who now lives in Detroit. “I wanted to know what it looked like, smelled like and sounded like. What does it feel like to be in a room full of flowers? And I wanted to create it so I could experience it and others could too — as many as possible.” \nWaud considered doing something smaller — such as building a shed from a kit and filling it with flowers — “but the scale wasn’t big enough.” \nSoon, a light bulb went off about an abundant resource in Detroit: abandoned houses. \n“I ended up at an auction at Hamtramck City Hall. I went in, checked in, got the address, I pulled up and it was perfect,” says Waud, who also bought the house next door for a total of $500 so she and the Flower House could use a large lot between the two for preparations. The second house also was used for a preview in May. \nWaud says she loves the the juxtaposition of grit with eventual beauty. \n“I love that it’s on a one-way street and people fly by here and probably don’t even notice it,” she says. “I love the constant noise of traffic. You walk into anywhere where there’s something beautiful ... I think this just adds to it. ” \nFlowers will be donated by three wholesale companies. Once the installation is over, Waud has asked Reclaim Detroit to deconstruct the house. \nSusan McLeary, who owns the Passionflower floral shop in Ann Arbor, is one of eight local designers involved in the project and will transform the downstairs kitchen. She says she was drawn to the project because of the lack of parameter. \n“When you’re a florist, you can be creative, but only to a certain point,” she says. “With this, with a house that’s going to come down anyway, you can unleash and be as creative and wild as you want it to be. \nWorking with well-known floral designer Francoise Weeks, McLeary says she plans to fill the tall cabinets with berried branches, herbs and produce. They’ll also create a chandelier with ornamental peppers, cherry tomato stems and herbs, which will hang over the table. \n“I plan to bring in a small table and a pair of chairs and encase them in foliage. They’ll kind of look like they’re growing out of the floor,” says McLeary. \nBecause of the short time frame, McLeary says designers have to be very mindful of their flower choices. The designers aren’t using any floral foam, but they will use water. \n“I’ve kind of focused on things that will look good for three days without water,” says McLeary. “I’m purposely choosing foliages and berried branches.” \nSome have criticized wasting flowers for such a such short period of time, but McLeary stresses it’s an art installation. \n“Just like for a wedding, people enjoy them for a short time,” she says. “As florists, we are so charged by perceiving flowers as art.” \nWaud says she has had to have some work done to make sure the house is structurally sound. They rebuilt the stairs and closed off the third floor, which won’t be used. Visitors also will have to sign a waiver. \nWaud remembers talking to a friend years ago who lived in California, but planned to visit New York for the weekend, simply to see Christo and Jeanne-Claude’s bright orange gates in Central Park. Now, the same thing is happening with Flower House, Waud says. \n“People are doing that,” she says as her eyes well up with tears. “People are coming to see this spectacle ... People will say ‘I’ve been hearing about Detroit. I’ve never been here, but this flower house this is happening. Maybe I’ll visit.’” \nmfeighan@detroitnews.com \n(313) 223-4686 \nFlower House \nFlower House, at 11751 Dequindre in Hamtramck, will run from 10 a.m.-5 p.m. Oct. 16, 10 a.m.-10 p.m. Oct. 17 and 10 a.m.-10 p.m. Oct. 18. Tickets are $15. Go to theflower.house for tickets and information. The Detroit Institute of Arts, meanwhile, will show a free screening of the documentary “Dior and I” at 7 p.m. Wednesday about the 2012 Dior fashion show that inspired Flower House. 1404 CONNECT 37 TWEET 2 LINKEDIN 7 COMMENT EMAIL MORE Read or Share this story: http://detne.ws/1LgIJLE", "external_links": [], "published": "2015-10-08T17:47:00.000+03:00", "crawled": "2015-10-08T19:11:23.859+03:00", "highlightTitle": ""}