{"organizations": [], "uuid": "1e9b7efc5c74ac53dc324d73c826ca0b3d418db2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.democratandchronicle.com", "main_image": "http://www.gannett-cdn.com/-mm-/3cc6670a432c022ad759ff40cb5981ea91f45771/c=0-341-2483-1744&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/15/Rochester/B9319251506Z.1_20151015153955_000_GHAC8JPT2.1-0.jpg", "site_section": "http://www.democratandchronicle.com/rocflavors/", "section_title": "Democrat and Chronicle | Rochester news, community, entertainment, yellow pages and classifieds. Serving Rochester, New York | democratandchronicle.com", "url": "http://www.democratandchronicle.com/story/news/local/rocroots/2015/10/16/whatever-happened-frenchs/73860638", "country": "US", "title": "Whatever Happened To ... French's?", "performance_score": 0, "site": "democratandchronicle.com", "participants_count": 1, "title_full": "Whatever Happened To ... French's?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T04:25:00.000+03:00", "replies_count": 0, "uuid": "1e9b7efc5c74ac53dc324d73c826ca0b3d418db2"}, "author": "Alan Morrell", "url": "http://www.democratandchronicle.com/story/news/local/rocroots/2015/10/16/whatever-happened-frenchs/73860638", "ord_in_thread": 0, "title": "Whatever Happened To ... French's?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The R.T. French Co. \"made mustard what it is today\" and also introduced Americans to instant mashed potatoes during the company's long reign in Rochester. French's employed nearly 1,000 people here at its peak and sponsored cooking contests for kids and the \"Academy Awards\" of cookbooks. \"Home economists\" at French's test kitchens at One Mustard St. conceived thousands of recipes that were listed on French's product labels. The company ran cooking shows with hosts like Trudy McNall, whose Home Cooking series made her an early star of Rochester TV.\nWhile the French's company is still going strong, its ties to Rochester were cut decades ago. So Whatever Happened To… French's in Rochester? First, let's look back at the company's history.\nRobert Timothy French was a spice trader in Elmira who started his own company in 1880. One of his sons, George, visited Fairport on a business trip three years later and liked what he saw enough to buy a mill and move the business there.\nBuy Photo An early French's mustard jar photographed in the kitchen at the Rochester Historical Society in 2004. (Photo: Annette Lein / Staff file photo 2004)\nWhen an 1885 fire destroyed the mill, French's moved to Brown's Race near the Upper Falls in Rochester. While the company manufactured spices and extracts, George's brother, Francis, lobbied for a new kind of prepared mustard, one that was milder, lighter and creamier than the mustards of the time. By 1904, the company had developed its signature item — French's Cream Salad Brand Mustard, which was introduced at the St. Louis World's Fair and immediately became a big hit. The recipe has remained essentially the same since, while the name has slightly changed.\nBuy Photo Jane Asmus, a food lab technician at R.T. French Co., demonstrates a filter process in formulating new gravy in 1977. (Photo: Staff file photo 1977)\nThe R.T. French Co. moved to a new headquarters off East Main Street in 1912. The address became part of the company's ads: \"Good things to eat come from 1 Mustard Street.\" French's mustard became far and away the industry leader, once maintaining a reported 50 percent share of all mustard sold in the United States. But there was a lot more to the company than just mustard, as we shall see.\nFrench's introduced the \"Hot Dan the Mustard Man\" advertising campaign in 1932 and began attaching Hot Dan spoons to jars of mustard. The campaign continued to be the keystone of French's advertising until it was phased out in the 1940s. The spoons became a hot item for collectors who fondly remembered Hot Dan, as Peter B. Taub wrote in a 1982 Times-Union column.\n\"For such a small item, it was surprising how popular they were,\" French's top ad man told Taub. \"Thousands of people wrote in for them, and French's mailed them in a special cardboard tube. A lot of women said the spoons were the best thing they could find for feeding their babies.\"\nBy 1946, French's made another major culinary contribution to the culture. British researchers had developed a process for instant mashed potatoes during World War II, and French's brought the product to the masses. As John Rumsey wrote in a 1986 Times-Union story, \"The world's first commercial production of instant mashed potatoes began in 1946 at French's headquarters, One Mustard Street.\"\nBuy Photo Pictured after the R.T. French Co. acquired Widmer Wine Cellars in 1970 are, from left, O.C. Rowntree, French's president; E.I Reveal, Widmer president; and George L. Todd, Widmer chairman. (Photo: Staff file photo 1970)\nFrench's entered the dry foods business in the 1950s and developed products like gravy and sauce packets in Rochester. As the years went by, French's got into countless other products, even dog treats. The company acquired Widmer Wine Cellars of Naples, Ontario County, at one time. French's later diversified into non-food items like ceramics and artist supplies.\nBut it was the creamy yellow mustard for which French's has always been known best. It was revolutionary to American palates; before French's, the only mustard that most people knew was a hot, dark brown pepper. And for decades, it was made in Rochester.\nThat ended in 1973. French's parent company, which had owned the firm since the 1920s, moved manufacturing operations to Springfield, Mo. \"The pleasant spicy scent that permeated the air around Mustard Street soon faded,\" wrote Karen Deyle in the book Rochester Eats/75 Years of Classic Faves & Craves . Headquarters and the test kitchens remained in Rochester, and about 250 people still worked there.\nFrench's bought land in Perinton in the mid-1970s and company officials talked about moving there. That never occurred. A group of buildings that French's had used for production were demolished at the end of the decade. French's continued to diversify its product line, entering the home products business.\nIn 1986, French's ended its 19-year sponsorship of the prestigious Tastemaker Awards, which were presented for outstanding cookbooks at an annual ceremony in New York City. (Kathy Lindsley called them the \"Academy Awards for cookbooks\" in a Times-Union story that year.)\nThe next year, French's announced its plans to leave Rochester completely. Office operations and test kitchens were transferred to New Jersey. The news hit Rochesterians hard.\nBuy Photo Lee Matlock, left, and Karin McNamara work in the test kitchen at R.T. French Co. in 1983. (Photo: Staff file photo 1983)\nA French's official called it \"the end of an era.\" Phil Ebersole wrote in a Democrat and Chronicle story that the company's yellow mustard jar \"was once as distinctive a symbol of Rochester as Eastman Kodak Co.'s yellow box of film.\" A Democrat and Chronicle editorial lamented, \"No longer will the label on the familiar yellow jar say 'Rochester, N.Y.' Newcomers to the city won't know why there's a place called One Mustard Street … We've lost a piece of history.\"\nHillside Family of Agencies now occupies the iconic One Mustard St. address.\nMorrell is a Rochester-based freelance writer.\nAbout this feature\n\"Whatever Happened To ...?\" is a feature that explores favorite haunts of the past and revisits the headlines of yesteryear. It's a partnership between RocRoots.com and \"Hometown Rochester\" on Facebook. Have an idea you'd like us to explore? Email us at roc-roots@DemocratandChronicle.com.", "external_links": ["http://www.gannett-cdn.com/-mm-/7ded66b21716c92431cd9c3ad485775e35c2f2c2/r=500x296/local/-/media/2015/10/15/Rochester/B9319251506Z.1_20151015153955_000_GHAC8JPUL.1-0.jpg", "http://www.gannett-cdn.com/-mm-/8ad2122bfa4e455375f01de0acc902272150a49c/r=500x313/local/-/media/2015/10/15/Rochester/B9319251506Z.1_20151015153955_000_GKPC7P0SD.1-0.jpg", "http://www.gannett-cdn.com/-mm-/481d35cd86cc7611fcd581a01e397032adc82208/r=395x400/local/-/media/2015/10/15/Rochester/B9319251506Z.1_20151015153955_000_GHAC8JQ87.1-0.jpg", "http://www.gannett-cdn.com/-mm-/e4dfe71447efa4592267c5cb9115edf91933b706/r=500x335/local/-/media/2015/10/15/Rochester/B9319251506Z.1_20151015153955_000_GHAC8JQB4.1-0.jpg", "http://www.gannett-cdn.com/media/2015/10/15/Rochester/B9319251506Z.1_20151015153955_000_GKPC7P0SD.1-0.jpg", "http://www.gannett-cdn.com/-mm-/7a61d2100b9a1c2e9799ad837c6a77dae527e428/c=178-0-1766-2117&r=183&c=0-0-180-240/local/-/media/2015/10/15/Rochester/B9319251506Z.1_20151015153955_000_GHAC8JQ87.1-0.jpg", "http://www.gannett-cdn.com/-mm-/bb05bb28b777200e3527b58348628c1c1df2b6f9/c=0-0-2502-1881&r=x408&c=540x405/local/-/media/2015/10/15/Rochester/B9319251506Z.1_20151015153955_000_GHAC8JQB4.1-0.jpg", "http://www.gannett-cdn.com/media/2015/10/15/Rochester/B9319251506Z.1_20151015153955_000_GHAC8JQ87.1-0.jpg", "http://facebook.com/HometownRochesterNY", "http://www.gannett-cdn.com/-mm-/c397136bd35b8b4bcb9eb2eb932d95bf1daed0ef/c=528-0-2492-1477&r=x408&c=540x405/local/-/media/2015/10/15/Rochester/B9319251506Z.1_20151015153955_000_GHAC8JPUL.1-0.jpg", "http://www.gannett-cdn.com/media/2015/10/15/Rochester/B9319251506Z.1_20151015153955_000_GHAC8JPUL.1-0.jpg", "http://www.gannett-cdn.com/media/2015/10/15/Rochester/B9319251506Z.1_20151015153955_000_GHAC8JQB4.1-0.jpg", "http://www.gannett-cdn.com/-mm-/b3a45e8aa480cc2e83146b8dfbdc696a881d00e0/c=48-0-1711-1250&r=x408&c=540x405/local/-/media/2015/10/15/Rochester/B9319251506Z.1_20151015153955_000_GKPC7P0SD.1-0.jpg"], "published": "2015-10-17T04:25:00.000+03:00", "crawled": "2015-10-17T21:58:27.293+03:00", "highlightTitle": ""}