{"organizations": [], "uuid": "3229993c8280d515571cb490780fd2375900b54a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.heraldscotland.com", "main_image": "http://www.heraldscotland.com/resources/images/4309890/", "site_section": "http://www.heraldscotland.com/arts_ents/", "section_title": "Arts and Entertainment | Herald Scotland", "url": "http://www.heraldscotland.com/arts_ents/13838691.Life_is_an_adventure_with_My_Friend_Selma/", "country": "GB", "title": "Life is an adventure with My Friend Selma", "performance_score": 0, "site": "heraldscotland.com", "participants_count": 1, "title_full": "Life is an adventure with My Friend Selma (From Herald Scotland)", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T07:10:00.000+03:00", "replies_count": 0, "uuid": "3229993c8280d515571cb490780fd2375900b54a"}, "author": "Ann Fotheringham", "url": "http://www.heraldscotland.com/arts_ents/13838691.Life_is_an_adventure_with_My_Friend_Selma/", "ord_in_thread": 0, "title": "Life is an adventure with My Friend Selma", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WHEN I was eight years old, my dad set up a charity to help people in danger escape from the war in Bosnia. He had seen a film about the holocaust in the Second World War and afterwards had said to my mum, \"If anything like that happened again, I couldn’t stand by and watch.\" So when war broke out in Bosnia, and people started to flee, he kept his word.\nWe lived in Leeds, near a disused boarding school. My dad, helped by the local council and lots of volunteers, turned this ramshackle old building into a place for families to stay.\nHe told my mum, me and my older brother that we were going to live there too for a few months to help them all settle in. It didn’t seem strange to me at all – you trust your parents when you are eight. When they tell you you are going to live somewhere else for a while, you just do it.\nMy dad brought 50 refugees over to stay and Selma was on the first coach. She was braver and cheekier and generally cooler than me, and we just got on from the moment we met. My mum remembers watching us out of the window as we played in the garden, unable to speak each other’s language but laughing and laughing so much we almost fell over.\nPromoted stories We went to school and Brownies together, played together and grew up together. I came to study in Glasgow 11 years ago, loved the city and never left. Now I run my own theatre company, Terra Incognita, which tells extraordinary real-life stories. Selma works in human resources in Yorkshire, and she has a thick Yorkshire accent. We still see each other when we can.\nWhen I decided to tell Selma’s story in the theatre, I spoke to her again about that time in her life and I realised there were many things even I didn’t know about her strange, horrible, incredible journey to Britain.\nHer sister was sick when the war broke out and the family only just escaped an attack on the local hospital before they left. The journey was dangerous – at one point, the whole family had to swim across a river.\nSelma is flattered and excited that her story will help young people understand what it’s like for refugees but she was also full of trepidation about reliving some of those memories.\nIt was hard at times when she was young, in a new country, far from home. I understood some days she was troubled about those she had left behind – it’s what they were all worried about.\nSometimes we would go to the climbing frame in the playground and just hang upside down for a while, not chatting much, being there together, and I understood it was her way of recalibrating.\nPeople ask me if it was hard for me, moving out of my home into an old boarding school with 52 refugees, but it really wasn’t – I wasn’t fleeing from anything horrific in my life, I just had to move up the road and stay with my friends for a while. It was an adventure.\nShare article The playground was my front garden. We had lots of visitors, people were always feeding me and I learned to ride a bike. But the best thing about living there was definitely meeting my friend Selma.\nMy Friend Selma, a 45-minute theatre performance for audiences aged over eight, is touring venues across Scotland until October 25. Visit myfriendselma.com.", "external_links": ["https://twitter.com/share?url=", "https://www.facebook.com/sharer/sharer.php?u="], "published": "2015-10-10T07:10:00.000+03:00", "crawled": "2015-10-10T05:11:25.206+03:00", "highlightTitle": ""}