{"organizations": [], "uuid": "1f08eab8c6e916d69cccab9755cfdedc53519dec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://images.canberratimes.com.au/2015/10/15/6930350/Thumbnail1001370246gk8blvimage.related.thumbnail.320x214.gk6u86.png1444962955808.jpg.jpg", "site_section": "http://feeds.canberratimes.com.au/rssheadlines/entertainment.xml#", "section_title": "Canberra Times Entertainment Headlines", "url": "http://www.canberratimes.com.au/entertainment/movies/why-bridge-of-spies-gave-tom-hanks-the-cold-war-chills-20151014-gk6u86.html", "country": "AU", "title": "Why Bridge of Spies gave Tom Hanks the cold war chills", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "Why Bridge of Spies gave Tom Hanks the cold war chills", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T23:00:00.000+03:00", "replies_count": 0, "uuid": "1f08eab8c6e916d69cccab9755cfdedc53519dec"}, "author": "Jenny Cooney Carrillo", "url": "http://www.canberratimes.com.au/entertainment/movies/why-bridge-of-spies-gave-tom-hanks-the-cold-war-chills-20151014-gk6u86.html", "ord_in_thread": 0, "title": "Why Bridge of Spies gave Tom Hanks the cold war chills", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play video Return to video Video settings Please Log in to update your video settings\nVideo will begin in 5 seconds.\nDon't play Play now More video Recommended Replay video Return to video Video settings Please Log in to update your video settings\nTrailer: Bridge of Spies True story of a lawyer who found himself thrust into the Cold War when the CIA sent him to negotiate the release of a spy plane pilot captured by Soviet forces.\nPT2M33S http://www.canberratimes.com.au/action/externalEmbeddedPlayer?id=d-436oq 620 349 September 21, 2015 Autoplay On Off Video feedback Video settings More on Bridge of Spies Movie session times Full movies coverage Tom Hanks made his debut on Broadway this year in the play Lucky Guy . The title could not have been more appropriate for an actor who often uses the phrase to describe his life.\nAfter all, this is the actor who defied all odds to achieve his megastar status. His beginnings were hardly illustrious – a guest appearance on the TV series  The Love Boat , followed up by a lead in the forgettable sitcom Bosom Buddies and then the teenage sex romp Bachelor Party .\nBrooklyn lawyer James Donovan (Tom Hanks) is an ordinary man placed in extraordinary circumstances in the thriller Bridge of Spies . Photo: Jaap Buitendijk \nBut in the 30 years since, he has become one of Hollywood's most bankable stars – his films have taken more than $A10 billion at the box office, according to the website  Boxofficemojo  – as well as becoming almost synonymous with decency and likeability.\nAdvertisement But as we sit in a small, windowless conference room in a New York hotel to talk about his latest screen venture, the new spy drama Bridge of Spies , directed by Steven Spielberg, the 59-year-old actor confides that lately he's really come to appreciate the good fortune of being a \"lucky guy\".\nLast December, Hanks' wife of 27 years, actress Rita Wilson, was diagnosed with  breast cancer and underwent a bilateral mastectomy and reconstruction.\nTom Hanks with his wife, cancer survivor Rita Wilson. Photo: Getty Images \nShe revealed her diagnosis to this media this year, saying it was missed by the first doctor and that, \"I hope this will encourage others to get a second opinion and to trust their instincts if something doesn't feel right\".\nThe usually upbeat Hanks, who likes to skim along the surface of interviews with self-deprecating jokes, momentarily pauses when asked how he felt about her decision to go public.\n\"That was all her decision,\" he responds. \"When something comes up like that, everything stops and you deal with it.\"\nThe cold war took on new meaning for Tom Hanks in Steven Spielberg's Bridge of Spies . Photo: Jaap Buitendijk \nHe says that after they got the potentially life-threatening diagnosis, \"Christmas and New Year's was a completely different version of what it had been prior to that\".\nHe adds, with palpable relief, that after \"a fervent nine months of treatment\", Wilson has fully recovered.\n\"We are so lucky, because right off the bat we knew that we had access to the greatest care in the world, and that was a blessing,\" he says, using the L-word again. \"All I can do now is bow down to the courage of my wife.\"\nTom Hanks is Brooklyn lawyer James Donovan, front right, Mark Rylance is Rudolf Abel, and Billy Magnussen is Doug Forrester in Bridge of Spies . Photo: Jaap Buitendijk \nAs if we've come too close to the emotions that are rarely on display for the press, Hanks smoothly steers the conversation back to the reason we're here, to talk about Bridge of Spies , his fourth collaboration with Spielberg.\nSet in the 1950s and based on a true story, the film stars Hanks as James Donovan, an insurance-claims lawyer from New York who is thrust into the centre of the Cold War after the CIA enlists his help in negotiating the release of captured American U-2 pilot Gary Powers and student Frederic Pryor (Will Rogers) in exchange for Russian spy Rudolf Abel (Mark Rylance).\nHanks reminisces that he was only five when the Cold War really began but has chilling memories of that period.\nTom Hanks, Matt Damon and Edward Burns in Saving Private Ryan . \n\"I remember my parents talking about when Khrushchev said, 'We will bury you', and I was a kid, so I took it literally and was terrified,\" he says. \"I imagined we were all going to be put in a hole with dirt shovelled on top of us and I was terrified.\"\nPerhaps that vivid brush with a period in all the history books spurred on his lifelong fascination with the past, which often translated to films such as Saving Private Ryan and Apollo 13, and his excitement when he heard about Bridge of Spies .\n\"I'd heard that this was a huge international incident, when the U-2 pilot was shot down by the Soviet Union back then,\" Hanks says, \"but I didn't know anything about James Donovan, so when Steven sent me the script, it was like winning the lottery.\"\nHanks isn't afraid to voice his political opinions. Photo: Stuart C. Wilson/Getty Images \nThe affable actor has always come across as charming and easygoing during our many chats over the past two decades, but it's only in recent times he's become more willing to voice his political opinions – as if he no longer seems worried about offending his fan base.\nThe staunch Democrat has supported environmental causes, alternative fuels, same-sex marriage and Barack Obama in his presidential bid.\nBut in a country now obsessed with Donald Trump's race for the White House, Hanks drops any facade and cautions with disgust: \"There are some things to be taken very seriously right now but the political process today is so far away from being important that it's a joke.\"\nFew actors have survived as long as Hanks without a whisper of scandal. Not only is he considered, as Spielberg later declares, \"one of the greatest actors in the world\", he's also a devoted husband and father of four – Colin, 37, Elizabeth, 32 (from his first marriage), Chester, 24, and Truman, 20 – and grandfather of two.\nIt's no secret he had a rough childhood; it could tell you why he's always prioritised his family over his career.\n\"I learned what not to do from my own parents, who had this fabulous philosophy of benign care,\" Hanks says with a hint of lingering resentment as he leans forward in his chair, his green eyes boyishly engaging. \nAged five when his parents divorced, Hanks and his older brother and sister went to live with their dad, Amos, a cook who moved often, while his younger brother stayed with their mother. When Amos married for a third time in 1966, he moved the three Hanks children into a tiny basement bedroom with their five new step-siblings.\n\"There was stuff going on and I'd go to school and end up spending three or four weeks sleeping on the couch at somebody's house because it was easier than going home,\" Hanks says.\n\"When you get older and have kids yourself, you're just trying to make your way in the world as a professional but also a man who is continuously reminded that there's no substitute for being there enough during the day in order to make them breakfast before they go to school.\"\nHanks, who has won two Oscars (for  Philadelphia and  Forrest Gump ) and been nominated for three more ( Big, Saving Private Ryan, Castaway ), seems particularly proud his family has remained largely unaffected by his fame.\n\"My wife married me knowing I wasn't a dentist or an investment banker and my kids have grown up with a dad who had this odd job that was often defined by the hairstyle he was wearing or whether or not he had a dyed moustache,\" he says, chuckling.\n\"I'd either be away for a long time or be the idiot doing car pool and hanging around a lot and they pay no attention to all the other stuff, so it's no different than if I was a long-haul trucker or news photographer on assignment.\"\nA lucky guy? Indeed, but a great deal more as well.\n\nBridge of Spies opens in cinemas on October 22.  \n \nSaving private friendship   Steven Spielberg and Tom Hanks met long before they collaborated on the 1998 war drama Saving Private Ryan . They started out as close friends after Spielberg produced the 1986 movie The Money Pit and 1990 film Joe vs the Volcano , both starring Hanks.\nEight years later, Spielberg the director cast his friend in the World War II film that won five Oscars.\n\"I think it was just a matter of me being mature enough finally,\" Hanks suggests modestly. Spielberg acknowledges it was a risk, saying, \"Tom is godfather to one of my kids and we were friends for years, so the fear was whether our friendship would survive the movies.\"\nThey needn't have worried. The collaboration continued with the 2002 caper movie Catch Me If You Can and the 2004 drama The Terminal and they have also co-produced two award-winning miniseries,  Band of Brothers (2001) and The Pacific (2010), and the documentary Shooting War, narrated by Hanks.", "external_links": [], "published": "2015-10-17T23:00:00.000+03:00", "crawled": "2015-10-18T11:27:30.104+03:00", "highlightTitle": ""}