{"organizations": [], "uuid": "bca4559b0119027c48f33230a16df30b3d1e1765", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "entertainment.suntimes.com", "main_image": "http://entertainment.suntimes.com/wp-content/uploads/2015/01/DEAR_ABBY_12880069-e1420416724734.jpg", "site_section": "http://entertainment.suntimes.com/feed/", "section_title": "12Chicago Entertainment - Chicago Sun-Times", "url": "http://entertainment.suntimes.com/lifestyles/dear-abby-drink-wine-offered-water/", "country": "US", "title": "Dear Abby: As all drink wine, why am I offered water?", "performance_score": 0, "site": "suntimes.com", "participants_count": 1, "title_full": "Dear Abby: As all drink wine, why am I offered water?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T08:00:00.000+03:00", "replies_count": 0, "uuid": "bca4559b0119027c48f33230a16df30b3d1e1765"}, "author": "Sun-Times", "url": "http://entertainment.suntimes.com/lifestyles/dear-abby-drink-wine-offered-water/", "ord_in_thread": 0, "title": "Dear Abby: As all drink wine, why am I offered water?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Dear Abby: As all drink wine, why am I offered water? Sun-Times on October 9, 2015 Dear Abby \nDEAR ABBY: I was invited to a small gathering of women. I arrived punctually, was greeted by the hostess and asked if I wanted some water to drink. I accepted. \nAs I looked around the room, everyone else had a glass of wine. When one other woman arrived a little while later and joined our group, the hostess asked her if she wanted wine or water to drink. \nI have never abused alcohol. Why was I not given a choice? I later found out that all the other women had been given a “show up” time that was a half-hour earlier than my “show up” time. \nI am hurt by the way I was treated. What are your thoughts? — SECOND-CLASS CITIZEN IN FLORIDA \nDEAR SECOND-CLASS CITIZEN: I think your hostess could learn a few things about hospitality, because you were treated shabbily. As it stands, you have nothing to lose by asking her why because I can’t imagine that you would ever accept another invitation from the woman if one is offered. \nDEAR ABBY: At what point should grown kids in their 20s pay for their own “extras” (cellphone, gas, movies, gym memberships)? In my opinion, if they can’t afford these luxuries, they should get a second job or do without. My husband, on the other hand, thinks they should be “rewarded” simply for being good kids. \nAt this stage in their lives, I think gifts should be reserved for birthdays and Christmas only and that we have been raising kids with a sense of entitlement that may be detrimental to their future (and to our retirement). What are your thoughts on this? — ODD WOMAN OUT IN PENNSYLVANIA \nDEAR ODD WOMAN OUT: My thoughts are these: If you are truly concerned that your husband’s generosity could have a negative impact on your retirement savings, then he may be overly generous. If the “children” expect these gifts and don’t realize how lucky they are to be receiving this kind of largesse, the gifts should be stopped. However, if neither of these things is true and your husband derives pleasure from doing this for them, you should stay out of it. \nDEAR ABBY: Six months ago my brother told me he vapes. At first I didn’t think much of it. Because I pride myself on how well I keep secrets, I haven’t told our parents. But now his grades have started sliding, and I wonder if there’s a connection. He’s going into his senior year of high school and his graduation is on the line. \nIf vaping has had an effect on his grades, it might be best for me to tell our parents and figure things out from there. I don’t know what the right choice is. What should I do? — HOLDING A SECRET IN WASHINGTON \nDEAR HOLDING: From what I have been reading lately, some teens have begun vaping marijuana, which is known to impair memory. Depending upon what substance your brother has been vaping, it could definitely be why his grades have dropped. Secrets that can pose a danger shouldn’t be kept because they are not harmless. I think your instinct is to share your concerns with your parents, and I concur. \nDear Abby is written by Abigail Van Buren, also known as Jeanne Phillips, and was founded by her mother, Pauline Phillips. Contact Dear Abby at www.DearAbby.com or P.O. Box 69440, Los Angeles, CA 90069. \nFor an excellent guide to becoming a better conversationalist and a more sociable person, order “How to Be Popular.” Send your name and mailing address, plus check or money order for $7 (U.S. funds), to: Dear Abby, Popularity Booklet, P.O. Box 447, Mount Morris, IL 61054-0447. (Shipping and handling are included in the price.)", "external_links": [], "published": "2015-10-09T08:00:00.000+03:00", "crawled": "2015-10-09T17:05:14.701+03:00", "highlightTitle": ""}