{"organizations": [], "uuid": "5f46da6725565d53c44eee95670a121eaf1627ad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nydailynews.com", "main_image": "http://assets.nydailynews.com/polopoly_fs/1.2390114!/img/httpImage/image.jpg_gen/derivatives/landscape_1200/badfrats9n-1-web.jpg", "site_section": "http://www.nydailynews.com/news/index.html", "section_title": "Breaking, Local and National News, Sports &amp; Entertainment - NY Daily News", "url": "http://www.nydailynews.com/news/national/7-horrifying-bizarre-frats-article-1.2390115", "country": "US", "title": "7 horrifying and bizarre things frats have done", "performance_score": 0, "site": "nydailynews.com", "participants_count": 1, "title_full": "7 horrifying and bizarre things frats have done - NY Daily News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "5f46da6725565d53c44eee95670a121eaf1627ad"}, "author": "NEW YORK DAILY NEWS", "url": "http://www.nydailynews.com/news/national/7-horrifying-bizarre-frats-article-1.2390115", "ord_in_thread": 0, "title": "7 horrifying and bizarre things frats have done", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Jim Cole/AP Dartmouth College Sigma Alpha Epsilon were accused of making pledges eat vomit omelettes. Not all fraternities are like “Animal House” — some, it seems, are actually a lot, lot worse.\nIn the wake of the latest hazing allegations at the Indiana University branch of Alpha Tau Omega , here’s a list of some of the most appalling examples of bros’ bad behavior in the past few years:\n1. Emory University Phi Delta Theta’s fight club\nIn 2013, The Emory Wheel reported that the university suspended PDT for four years after an investigation found that they’d forced pledges to participate in a fight club, sleep on the basement floor and eat “unusual amounts” of items “that are not typical for eating.” Yikes.\n2. Dartmouth College Sigma Alpha Epsilon’s vomlettes\nIn 2012, former SAE member Andrew Lohse wrote in The Dartmouth , “I was a member of a fraternity that asked pledges, in order to become a brother, to: swim in a kiddie pool of vomit, urine, fecal matter, semen and rotten food products; eat omelets made of vomit; chug cups of vinegar, which in one case caused a pledge to vomit blood; drink beer poured down fellow pledges' ass cracks... among other abuses.\"\nGoogle Maps Emory University Phi Delta Theta bothers were accused of making pledges eat ‘unusual amounts’ of items that are ‘not typical for eating.’ ’Nuff said.\n3. University of Tennessee Pi Kappa Alpha’s butt chugging\nYes, butt chugging is a thing.\nIn 2013, the Huffington Post reported that the University of Tennessee “Pike” chapter got shut down briefly after a possible butt-chugging incident when frat members allegedly gave an underage student an alcohol enema.\nThe student denied that’s how he got a .40 BAC, but authorities said he “showed signs of physical and possible sexual assault,” which is consistent with butt chugging.\nJ. Miles Cary/AP University of Tennessee Pi Kappa Alpha frat was accused of butt chugging. 4. University of Michigan Sigma Alpha Mu’s urine-covered party\nIn January, a group of UMich Greeks — mostly from SAM and their sister sorority Sigma Delta Tau — partied for 48 hours in a northern Michigan resort, according to Gawker .\nThe fratsters caused $434,000 worth of damage by smashing ceiling tiles, destroying on furniture — and peeing on everything.\n5. Florida International University Pi Kappa Alapha’s drug dealing message board\nIn 2013, the Miami New Times reported that FIU’s Pike got busted for using Facebook as a drug dealing message board.\nChelsea_Alyssa/Twitter The University of Oklahoma's chapter of Sigma Alpha Epsilon was closed after a video leaked depicting members chanting a racist ditty. Screenshots of the page show posts like, “Hey guys, my boy made weed cookies and is trying to get rid of them quick, hit me if you want his number,” and “30mg of addy 10 starting tomorrow. 15 for non brothers.”\nClearly, they are not smooth criminals.\n6. University of Oklahoma Sigma Alpha Epsilon’s racist chant\nIn March, SAE made headlines when brothers were caught on video singing a shockingly racist chant:\n\"There will never be a n----r SAE. There will never be a n----r SAE . You can hang him from a tree, but he will never sign with me. There will never be a n----r SAE.”\n7. Dartmouth College Alpha Delta’s infected butt problem\nIn March, Gawker reported that a sophomore Alpha Delt pledge sought medical attention after he got a butt infection because of a branding incident gone wrong. (Actually, there’s probably no way it could have gone right.)\nkblakinger@nydailynews.com\nRelated Stories Famous alumni of Alpha Tau Omega Alpha Tau Omega fraternity has history of problems Indiana University suspends Alpha Tau Omega in hazing probe UCLA fraternity, sorority under fire for Kanye-themed party Dartmouth ‘Animal House’ frat loses appeal to stay on campus", "external_links": ["http://emorywheel.com/university-removes-phi-delt-fraternity-files-appeal/", "http://www.rollingstone.com/culture/news/confessions-of-an-ivy-league-frat-boy-inside-dartmouths-hazing-abuses-20120328?page=5", "http://gawker.com/michigan-frats-48-hour-rager-wrecks-resort-causes-430-1688877451", "http://gawker.com/report-dartmouth-frat-suspended-over-frat-brother-s-in-1693429119", "http://www.miaminewtimes.com/news/fius-pi-kappa-alpha-frat-suspended-over-facebook-posts-about-drug-dealing-hazing-and-creep-shots-6526847", "http://www.huffingtonpost.com/2013/07/23/butt-chugging-fraternity-tennessee_n_3635660.html"], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-08T20:15:03.412+03:00", "highlightTitle": ""}