{"organizations": [], "uuid": "9255103d91f3c561d310b5c72d2d09b3148de291", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chron.com", "main_image": "http://ww2.hdnux.com/photos/41/37/76/8781705/3/rawImage.jpg", "site_section": "http://www.chron.com/rss/feed/Entertainment-293.php", "section_title": "Entertainment", "url": "http://www.chron.com/entertainment/article/Marina-and-the-Diamonds-shines-in-Houston-6567593.php", "country": "US", "title": "Marina and the Diamonds shines in Houston -", "performance_score": 0, "site": "chron.com", "participants_count": 1, "title_full": "Marina and the Diamonds shines in Houston - Houston Chronicle", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T07:51:00.000+03:00", "replies_count": 0, "uuid": "9255103d91f3c561d310b5c72d2d09b3148de291"}, "author": "chron.com", "url": "http://www.chron.com/entertainment/article/Marina-and-the-Diamonds-shines-in-Houston-6567593.php", "ord_in_thread": 0, "title": "Marina and the Diamonds shines in Houston -", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photo: Jamaal Ellis, For The Chronicle Image 1 of / 51 51 Marina and The Diamonds fans at Revention Music Center in Downtown Houston on Monday, October 12, 2015.\nPhoto: Jamaal Ellis, For The Chronicle Marina and The Diamonds fans at Revention Music Center in Downtown... Image 2 of 51 Marina and The Diamonds fans at Revention Music Center in Downtown Houston on Monday, October 12, 2015.\nPhoto: Jamaal Ellis, For The Chronicle Marina and The Diamonds fans at Revention Music Center in Downtown... Image 3 of 51 Marina and The Diamonds fans at Revention Music Center in Downtown Houston on Monday, October 12, 2015.\nPhoto: Jamaal Ellis, For The Chronicle Marina and The Diamonds fans at Revention Music Center in Downtown... Image 4 of 51 Marina and The Diamonds fans at Revention Music Center in Downtown Houston on Monday, October 12, 2015.\nPhoto: Jamaal Ellis, For The Chronicle Marina and The Diamonds fans at Revention Music Center in Downtown... Image 5 of 51 Marina and The Diamonds fans at Revention Music Center in Downtown Houston on Monday, October 12, 2015.\nPhoto: Jamaal Ellis, For The Chronicle Marina and The Diamonds fans at Revention Music Center in Downtown... Image 6 of 51 Marina and The Diamonds fans at Revention Music Center in Downtown Houston on Monday, October 12, 2015.\nPhoto: Jamaal Ellis, For The Chronicle Marina and The Diamonds fans at Revention Music Center in Downtown... Image 7 of 51 Marina and The Diamonds fans at Revention Music Center in Downtown Houston on Monday, October 12, 2015.\nPhoto: Jamaal Ellis, For The Chronicle Marina and The Diamonds fans at Revention Music Center in Downtown... Image 8 of 51 Marina and The Diamonds fans at Revention Music Center in Downtown Houston on Monday, October 12, 2015.\nPhoto: Jamaal Ellis, For The Chronicle Marina and The Diamonds fans at Revention Music Center in Downtown... Image 9 of 51 Marina and The Diamonds fans at Revention Music Center in Downtown Houston on Monday, October 12, 2015.\nPhoto: Jamaal Ellis, For The Chronicle Marina and The Diamonds fans at Revention Music Center in Downtown... Image 10 of 51 Marina and The Diamonds fans at Revention Music Center in Downtown Houston on Monday, October 12, 2015.\nPhoto: Jamaal Ellis, For The Chronicle Marina and The Diamonds fans at Revention Music Center in Downtown... Image 11 of 51 Marina and The Diamonds fans at Revention Music Center in Downtown Houston on Monday, October 12, 2015.\nPhoto: Jamaal Ellis, For The Chronicle Marina and The Diamonds fans at Revention Music Center in Downtown... Image 12 of 51 Marina and The Diamonds fans at Revention Music Center in Downtown Houston on Monday, October 12, 2015.\nPhoto: Jamaal Ellis, For The Chronicle Marina and The Diamonds fans at Revention Music Center in Downtown... Image 13 of 51 Marina and The Diamonds fans at Revention Music Center in Downtown Houston on Monday, October 12, 2015.\nPhoto: Jamaal Ellis, For The Chronicle Marina and The Diamonds fans at Revention Music Center in Downtown... Image 14 of 51 Marina and The Diamonds fans at Revention Music Center in Downtown Houston on Monday, October 12, 2015.\nPhoto: Jamaal Ellis, For The Chronicle Marina and The Diamonds fans at Revention Music Center in Downtown... Image 15 of 51 Marina and The Diamonds fans at Revention Music Center in Downtown Houston on Monday, October 12, 2015.\nPhoto: Jamaal Ellis, For The Chronicle Marina and The Diamonds fans at Revention Music Center in Downtown... Image 16 of 51 Marina and The Diamonds fans at Revention Music Center in Downtown Houston on Monday, October 12, 2015.\nPhoto: Jamaal Ellis, For The Chronicle Marina and The Diamonds fans at Revention Music Center in Downtown... Image 17 of 51 Marina and The Diamonds fans at Revention Music Center in Downtown Houston on Monday, October 12, 2015.\nPhoto: Jamaal Ellis, For The Chronicle Marina and The Diamonds fans at Revention Music Center in Downtown... Image 18 of 51 Marina and The Diamonds fans at Revention Music Center in Downtown Houston on Monday, October 12, 2015.\nPhoto: Jamaal Ellis, For The Chronicle Marina and The Diamonds fans at Revention Music Center in Downtown... Image 19 of 51 Marina and The Diamonds fans at Revention Music Center in Downtown Houston on Monday, October 12, 2015.\nPhoto: Jamaal Ellis, For The Chronicle Marina and The Diamonds fans at Revention Music Center in Downtown... Image 20 of 51 Marina and The Diamonds fans at Revention Music Center in Downtown Houston on Monday, October 12, 2015.\nPhoto: Jamaal Ellis, For The Chronicle Marina and The Diamonds fans at Revention Music Center in Downtown... Image 21 of 51 Marina and The Diamonds fans at Revention Music Center in Downtown Houston on Monday, October 12, 2015.\nPhoto: Jamaal Ellis, For The Chronicle Marina and The Diamonds fans at Revention Music Center in Downtown... Image 22 of 51 Marina and The Diamonds fans at Revention Music Center in Downtown Houston on Monday, October 12, 2015.\nPhoto: Jamaal Ellis, For The Chronicle Marina and The Diamonds fans at Revention Music Center in Downtown... Image 23 of 51 Marina and The Diamonds fans at Revention Music Center in Downtown Houston on Monday, October 12, 2015.\nPhoto: Jamaal Ellis, For The Chronicle Marina and The Diamonds fans at Revention Music Center in Downtown... Image 24 of 51 Fans cheer on Marina and the Diamonds at Revention Music Center in downtown Houston, Monday, October 12, 2015.\nPhoto: Jamaal Ellis, For The Chronicle Fans cheer on Marina and the Diamonds at Revention Music Center in... Image 25 of 51 Marina and the Diamonds performs at Revention Music Center in downtown Houston, Monday, October 12, 2015.\nPhoto: Jamaal Ellis, For The Chronicle Marina and the Diamonds performs at Revention Music Center in... Image 26 of 51 Marina and the Diamonds performs at Revention Music Center in downtown Houston, Monday, October 12, 2015.\nPhoto: Jamaal Ellis, For The Chronicle Marina and the Diamonds performs at Revention Music Center in...\nImage 27 of 51 Fans cheer Marina and the Diamonds at Revention Music Center in downtown Houston, Monday, October 12, 2015.\nPhoto: Jamaal Ellis, For The Chronicle Fans cheer Marina and the Diamonds at Revention Music Center in...\nImage 28 of 51 Fans cheer Marina and the Diamonds at Revention Music Center.\nPhoto: Jamaal Ellis, For The Chronicle Fans cheer Marina and the Diamonds at Revention Music Center. Image 29 of 51 Marina Diamandis, known as Marina and the Diamonds, performs at Revention Music Center in downtown Houston, Monday, October 12, 2015.\nPhoto: Jamaal Ellis, For The Chronicle Marina Diamandis, known as Marina and the Diamonds, performs at... Image 30 of 51 Marina Diamandis, known as Marina and the Diamonds, performs at Revention Music Center in downtown Houston, Monday, October 12, 2015.\nPhoto: Jamaal Ellis, For The Chronicle Marina Diamandis, known as Marina and the Diamonds, performs at... Image 31 of 51 Marina Diamandis, known as Marina and the Diamonds, performs at Revention Music Center in downtown Houston, Monday, October 12, 2015.\nPhoto: Jamaal Ellis, For The Chronicle Marina Diamandis, known as Marina and the Diamonds, performs at... Image 32 of 51 Fans record with their cell phones as Marina Diamandis, known as Marina and the Diamonds, performs at Revention Music Center in downtown Houston, Monday, October 12, 2015.\nPhoto: Jamaal Ellis, For The Chronicle Fans record with their cell phones as Marina Diamandis, known as... Image 33 of 51 Marina and the Diamonds performs at Revention Music Center in downtown Houston, Monday, October 12, 2015.\nPhoto: Jamaal Ellis, For The Chronicle Marina and the Diamonds performs at Revention Music Center in...\nImage 34 of 51 Marina and the Diamonds performs at Revention Music Center in downtown Houston, Monday, October 12, 2015.\nPhoto: Jamaal Ellis, For The Chronicle Marina and the Diamonds performs at Revention Music Center in...\nImage 35 of 51 Marina and the Diamonds performs at Revention Music Center in downtown Houston, Monday, October 12, 2015.\nPhoto: Jamaal Ellis, For The Chronicle Marina and the Diamonds performs at Revention Music Center in... Image 36 of 51 Marina and the Diamonds performs at Revention Music Center in downtown Houston, Monday, October 12, 2015.\nPhoto: Jamaal Ellis, For The Chronicle Marina and the Diamonds performs at Revention Music Center in... Image 37 of 51 Marina and the Diamonds performs at Revention Music Center in downtown Houston, Monday, October 12, 2015.\nPhoto: Jamaal Ellis, For The Chronicle Marina and the Diamonds performs at Revention Music Center in... Image 38 of 51 Marina and the Diamonds performs at Revention Music Center in downtown Houston, Monday, October 12, 2015.\nPhoto: Jamaal Ellis, For The Chronicle Marina and the Diamonds performs at Revention Music Center in... Image 39 of 51 Marina and the Diamonds performs at Revention Music Center in downtown Houston, Monday, October 12, 2015.\nPhoto: Jamaal Ellis, For The Chronicle Marina and the Diamonds performs at Revention Music Center in... Image 40 of 51 Marina and the Diamonds performs at Revention Music Center in downtown Houston, Monday, October 12, 2015.\nPhoto: Jamaal Ellis, For The Chronicle Marina and the Diamonds performs at Revention Music Center in... Image 41 of 51 Marina and the Diamonds performs at Revention Music Center in downtown Houston, Monday, October 12, 2015.\nPhoto: Jamaal Ellis, For The Chronicle Marina and the Diamonds performs at Revention Music Center in... Image 42 of 51 Marina and the Diamonds performs at Revention Music Center in downtown Houston, Monday, October 12, 2015.\nPhoto: Jamaal Ellis, For The Chronicle Marina and the Diamonds performs at Revention Music Center in... Image 43 of 51 Marina and the Diamonds performs at Revention Music Center in downtown Houston, Monday, October 12, 2015.\nPhoto: Jamaal Ellis, For The Chronicle Marina and the Diamonds performs at Revention Music Center in... Image 44 of 51 Fans cheer Marina and the Diamonds at Revention Music Center in downtown Houston, Monday, October 12, 2015.\nPhoto: Jamaal Ellis, For The Chronicle Fans cheer Marina and the Diamonds at Revention Music Center in... Image 45 of 51 Marina and the Diamonds performs at Revention Music Center in downtown Houston, Monday, October 12, 2015.\nPhoto: Jamaal Ellis, For The Chronicle Marina and the Diamonds performs at Revention Music Center in... Image 46 of 51 Marina and the Diamonds performs at Revention Music Center in downtown Houston, Monday, October 12, 2015.\nPhoto: Jamaal Ellis, For The Chronicle Marina and the Diamonds performs at Revention Music Center in... Image 47 of 51 Marina and the Diamonds performs at Revention Music Center in downtown Houston, Monday, October 12, 2015.\nPhoto: Jamaal Ellis, For The Chronicle Marina and the Diamonds performs at Revention Music Center in... Image 48 of 51 Marina and the Diamonds performs at Revention Music Center in downtown Houston, Monday, October 12, 2015.\nPhoto: Jamaal Ellis, For The Chronicle Marina and the Diamonds performs at Revention Music Center in... Image 49 of 51 Marina and the Diamonds performs at Revention Music Center in downtown Houston, Monday, October 12, 2015.\nPhoto: Jamaal Ellis, For The Chronicle Marina and the Diamonds performs at Revention Music Center in... Image 50 of 51 Marina and the Diamonds performs at Revention Music Center in downtown Houston, Monday, October 12, 2015.\nPhoto: Jamaal Ellis, For The Chronicle Marina and the Diamonds performs at Revention Music Center in... Image 51 of 51 Marina and the Diamonds shines in Houston 1 / 51 Back to Gallery Marina Diamandis is an electro-pop superstar. And it's time for the U.S. to catch up.\nThe cheeky singer and songwriter kicked off her Neon Nature Tour on Monday night at Revention Music Center. The venue was solidly packed but not completely full. Her engaging, effervescent sound, however, is worthy of a stadium.\nDiamandis has a unique allure that connected strongly with every fan inside the venue. There's '80s and indie pop, Tori Amos and Kate Bush, Madonna and Donna Summer in what she does. It all comes alive effortlessly onstage.\nDiamandis split the show into three parts, named for her albums: \"The Family Jewels,\" \"Electra Heart\" and this year's \"Froot.\" Her band was on risers just above her.\nSetlist \"Mowgli's Road\"\n\"I Am Not a Robot\"\n\"Oh No!\"\n\"Obsessions\"\n\"Hollywood\"\n\"Bubblegum Bitch\"\n\"Radioactive\"\n\"How to be a Heartbreaker\"\n\"Primadonna\"\n\"The State of Dreaming\"\n\"Froot\"\n\"Forget\"\n\"Savages\"\n\"Happy\"\n\"Can't Pin Me Down\"\n\"I'm a Ruin\"\n\"Blue\"\n\"Immortal\"\nThe Diamonds in her stage name — Marina and the Diamonds — refers to her fans. They sang \"Happy Birthday\" near the end of the night. (She turned 30 Saturday.)\nA bit of Kanye West/Jay-Z tune \"No Church in the Wild\" preceded her entrance. The show itself was an explosion of neon, sparkly costumes and frothy energy. Emojis and Betty Boop cartoons swirled on screens behind her.\n\"The Family Jewels\" segment was sweeping and sincere, from opener \"Mowgli's Road\" to the solemn \"Obsessions.\" It segued into the \"Electra Heart\" era, which pulsed with dancefloor ferocity. Every song here was a hands-in-the-air standout: \"Bubblegum Bitch,\" \"Radioactive,\" \"How to be a Heartbreaker.\"\nDiamandis has a voice that goes from flirty and cooing to big and wailing. She lifted every song into the heavens.\nThe final stretch, \"Froot,\" was awash in dreamy synth-pop. She joked through a cape mishap and a minor lyrical slip, enlisting the crowd to help with the words. It just made her more endearing. Sweet ballad \"Happy\" had the crowd swaying back and forth. \"Immortal\" was a truly stunning closer.\nDiamandis has said she doesn't care if she gets another fan and is happy with her career trajectory. But the urgency and energy she puts into every moment deserves some major-league love.", "external_links": ["http://ww1.hdnux.com/photos/41/40/00/8781840/3/920x920.jpg", "http://ww1.hdnux.com/photos/41/37/76/8781712/3/920x920.jpg", "http://ww2.hdnux.com/photos/41/40/00/8781861/3/920x920.jpg", "http://ww2.hdnux.com/photos/41/40/00/8781841/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/41/37/76/8781701/3/920x920.jpg", "http://ww3.hdnux.com/photos/41/40/00/8781850/3/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/41/37/76/8781715/3/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/41/40/00/8781872/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/41/40/00/8781854/3/920x920.jpg", "http://ww2.hdnux.com/photos/41/37/76/8781705/3/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/41/37/76/8781723/3/920x920.jpg", "http://ww3.hdnux.com/photos/41/40/00/8781830/3/920x920.jpg", "http://ww1.hdnux.com/photos/41/40/00/8781856/3/920x920.jpg", "http://ww2.hdnux.com/photos/41/37/76/8781709/3/920x920.jpg", "http://ww1.hdnux.com/photos/41/40/00/8781864/3/920x920.jpg", "http://ww2.hdnux.com/photos/41/37/76/8781705/3/920x920.jpg", "http://ww2.hdnux.com/photos/41/37/76/8781709/3/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/41/40/00/8781856/3/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/41/37/76/8781704/3/920x920.jpg", "http://ww1.hdnux.com/photos/41/40/00/8781832/3/920x920.jpg", "http://ww1.hdnux.com/photos/41/37/76/8781700/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/41/37/76/8781717/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/41/37/76/8781718/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/41/37/76/8781721/3/920x920.jpg", "http://ww2.hdnux.com/photos/41/37/76/8781713/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/41/37/76/8781713/3/920x920.jpg", "http://ww3.hdnux.com/photos/41/40/00/8781830/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/41/37/76/8781718/3/920x920.jpg", "http://ww1.hdnux.com/photos/41/37/76/8781704/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/41/40/00/8781850/3/920x920.jpg", "http://ww4.hdnux.com/photos/41/40/00/8781867/3/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/41/40/00/8781851/3/920x920.jpg", "http://ww3.hdnux.com/photos/41/37/76/8781706/3/920x920.jpg", "http://ww3.hdnux.com/photos/41/40/00/8781838/3/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/41/37/76/8781703/3/920x920.jpg", "http://ww3.hdnux.com/photos/41/40/00/8781866/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/41/40/00/8781838/3/920x920.jpg", "http://ww2.hdnux.com/photos/41/40/00/8781857/3/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/41/40/00/8781863/3/920x920.jpg", "http://ww2.hdnux.com/photos/41/40/00/8781857/3/920x920.jpg", "http://ww1.hdnux.com/photos/41/37/76/8781716/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/41/37/76/8781702/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/41/37/76/8781710/3/920x920.jpg", "http://ww3.hdnux.com/photos/41/37/76/8781714/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/41/40/00/8781861/3/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/41/40/00/8781872/3/920x920.jpg", "http://ww2.hdnux.com/photos/41/40/00/8781853/3/920x920.jpg", "http://ww4.hdnux.com/photos/41/40/00/8781847/3/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/41/37/76/8781720/3/920x920.jpg", "http://ww4.hdnux.com/photos/41/40/00/8781855/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/41/37/76/8781706/3/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/41/37/76/8781720/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/41/40/00/8781854/3/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/41/40/00/8781867/3/920x920.jpg", "http://ww4.hdnux.com/photos/41/37/76/8781715/3/920x920.jpg", "http://ww1.hdnux.com/photos/41/40/00/8781844/3/920x920.jpg", "http://ww2.hdnux.com/photos/41/40/00/8781853/3/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/41/37/76/8781703/3/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/41/40/00/8781831/3/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/41/40/00/8781848/3/920x920.jpg", "http://ww4.hdnux.com/photos/41/40/00/8781859/3/920x920.jpg", "http://ww2.hdnux.com/photos/41/40/00/8781865/3/920x920.jpg", "http://ww4.hdnux.com/photos/41/37/76/8781719/3/920x920.jpg", "http://ww4.hdnux.com/photos/41/40/00/8781855/3/920x920.jpg", "http://ww4.hdnux.com/photos/41/40/00/8781851/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/41/37/76/8781722/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/41/37/76/8781714/3/920x920.jpg", "http://ww4.hdnux.com/photos/41/37/76/8781707/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/41/40/00/8781841/3/920x920.jpg", "http://ww4.hdnux.com/photos/41/37/76/8781711/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/41/40/00/8781866/3/920x920.jpg", "http://ww3.hdnux.com/photos/41/40/00/8781858/3/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/41/37/76/8781707/3/920x920.jpg", "http://ww3.hdnux.com/photos/41/37/76/8781710/3/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/41/37/76/8781719/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/41/40/00/8781845/3/920x920.jpg", "http://ww1.hdnux.com/photos/41/40/00/8781840/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/41/37/76/8781721/3/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/41/37/76/8781716/3/920x920.jpg", "http://ww1.hdnux.com/photos/41/37/76/8781700/3/920x920.jpg", "http://ww3.hdnux.com/photos/41/40/00/8781858/3/920x920.jpg", "http://ww2.hdnux.com/photos/41/37/76/8781701/3/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/41/40/00/8781847/3/920x920.jpg", "http://ww1.hdnux.com/photos/41/37/76/8781712/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/41/40/00/8781845/3/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/41/40/00/8781859/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/41/37/76/8781722/3/920x920.jpg", "http://ww1.hdnux.com/photos/41/40/00/8781832/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/41/40/00/8781862/3/920x920.jpg", "http://ww3.hdnux.com/photos/41/37/76/8781702/3/920x920.jpg", "http://ww1.hdnux.com/photos/41/40/00/8781848/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/41/40/00/8781865/3/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/41/40/00/8781864/3/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/41/37/76/8781723/3/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/41/40/00/8781831/3/920x920.jpg", "http://ww4.hdnux.com/photos/41/40/00/8781863/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/41/37/76/8781717/3/920x920.jpg", "http://ww1.hdnux.com/photos/41/40/00/8781844/3/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/41/37/76/8781711/3/920x920.jpg", "http://ww3.hdnux.com/photos/41/40/00/8781862/3/square_gallery_thumb.jpg"], "published": "2015-10-13T07:51:00.000+03:00", "crawled": "2015-10-13T07:56:26.198+03:00", "highlightTitle": ""}