{"organizations": ["Facebook First", "Facebook Email Twitter Google"], "uuid": "035ff272e44a7e381754e2070f4e90ac61c702b9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wtsp.com", "main_image": "http://cdn.tegna-tv.com/-mm-/9177043cd029836e1dad2b74552c6484bcfcdae0/r=x633&amp;c=1200x630/http/www.gannett-cdn.com/-mm-/6043c5e77fb94d6d22d8aec8dd614d0d7f48cb88/c=0-331-2993-2022/local/-/media/2015/10/19/USATODAY/USATODAY/635808758670199993-EP7-IA-38176-DJ.jpg", "site_section": "http://rssfeeds.wtsp.com/_/20/110251360/wtsp/entertainmentnews", "section_title": "WTSP - Entertainment", "url": "http://www.wtsp.com/story/news/2015/10/19/first-impressions-force-awakens-trailer/74251600/", "country": "US", "title": "First impressions of 'Force Awakens' trailer", "performance_score": 0, "site": "wtsp.com", "participants_count": 0, "title_full": "First impressions of 'Force Awakens' trailer", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T05:49:00.000+03:00", "replies_count": 0, "uuid": "035ff272e44a7e381754e2070f4e90ac61c702b9"}, "author": "", "url": "http://www.wtsp.com/story/news/2015/10/19/first-impressions-force-awakens-trailer/74251600/", "ord_in_thread": 0, "title": "First impressions of 'Force Awakens' trailer", "locations": ["USA"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Brian Truitt", "Kylo Ren", "David James"], "text": "Facebook Email Twitter Google+ LinkedIn Pinterest First impressions of 'Force Awakens' trailer Darth Vader and the Empire may be seemingly gone, but Kylo Ren and the First Order are now out to rule the galaxy for themselves, making their presence felt in the final trailer for Star Wars: The Force Awakens. Post to Facebook First impressions of 'Force Awakens' trailer Darth Vader and the Empire may be seemingly gone, but Kylo Ren and the First Order are now out to rule the galaxy for themselves, making their presence felt in the final trailer for Star Wars: The Force Awakens. Check out this story on wtsp.com: http://on.wtsp.com/1RTeDyW Cancel Send A link has been sent to your friend's email address. Posted! A link has been posted to your Facebook feed. Join the Conversation To find out more about Facebook commenting please read the Conversation Guidelines and FAQs First impressions of 'Force Awakens' trailer Brian Truitt, USA TODAY 10:49 p.m. EDT October 19, 2015 Kylo Ren (Adam Driver) arrives with Stormtroopers in 'Star Wars: The Force Awakens.' (Photo: David James) CONNECT TWEET LINKEDIN COMMENT EMAIL MORE \nDarth Vader and the Empire may be seemingly gone, but Kylo Ren and the First Order are now out to rule the galaxy for themselves, making their presence felt in the final trailer for Star Wars: The Force Awakens . \nESPN's Monday Night Football debuted one of the last bits of footage Star Wars fans will see before director J.J. Abrams' movie arrives Dec. 18 in theaters, and the bad guys themselves arrive in style. But so does a new heroine in Rey, a scavenger from Jakku who is seen at the opening of the trailer doing her thing and sees the arrival of Finn, a former First Order Stormtrooper whose TIE Fighter crashes and begins his new journey. \nMore first impressions: \nNew heroes in the Resistance, Finn and X-wing pilot Poe Dameron (Oscar Isaac), give each other a bro pat as they scramble to the ready. Yay team! \nFinn was raised to be in the First Order, and the trailer shows how he is escaping his service. \"I've got nothing to fight for.\" Though there is a question of how he comes to claim his own lightsaber. \n\"Nothing will stand on our way,\" says Kylo Ren (Adam Driver), who promises to finish what Vader started. He's shown holding Vader's burned mask, with his troops on the march and torturing Poe. Could he be kin to the Sith lord formerly known as Anakin Skywalker? It seems like he has the same nasty demeanor. \nHarrison Ford's Han Solo is around to give advice. \"The Dark Side, the Jedi, they're real.\" \nCarrie Fisher's Princess Leia is back, though she looks emotional in the arms of Han. One main man missing is Mark Hamill's Luke Skywalker, the hero of the original Star Wars trilogy. There is a shot included from the last trailer where it seems like it's him touching his old droid R2-D2, yet Abrams seems to be keeping him off screen for a reason. \nFinn and Kylo are gonna have a huge lightsaber fight, but there is so much more for the Star Wars faithful with space battles and starships galore. Read or Share this story: http://on.wtsp.com/1RTeDyW TOP VIDEOS", "external_links": [], "published": "2015-10-20T05:49:00.000+03:00", "crawled": "2015-10-20T06:02:20.905+03:00", "highlightTitle": ""}