{"organizations": [], "uuid": "f672b9be3c72aaaadc639430ac1ae39e3400a531", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.maxim.com", "main_image": "", "site_section": "http://www.maxim.com/entertainment", "section_title": "Entertainment | Maxim", "url": "http://www.maxim.com/entertainment/music/article/van-halen-rising-documents-bands-decadent-early-years-2015-10", "country": "US", "title": "\"Van Halen Rising\" Documents The Band's Decadent Early Years", "performance_score": 0, "site": "maxim.com", "participants_count": 1, "title_full": "\"Van Halen Rising\" Documents The Band's Decadent Early Years | Maxim", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "f672b9be3c72aaaadc639430ac1ae39e3400a531"}, "author": "Chris Wilson", "url": "http://www.maxim.com/entertainment/music/article/van-halen-rising-documents-bands-decadent-early-years-2015-10", "ord_in_thread": 0, "title": "\"Van Halen Rising\" Documents The Band's Decadent Early Years", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I've got it bad, got it bad, got it bad for vintage Van Halen . Sure, they're technically still around — an aging version of the party rock gods recently played the last show of their U.S. tour at the Hollywood Bowl — but old-school Van Halen remains the peak period of their bombastic glory. Back when Roth still possessed all his hair, \"no brown M&Ms\" had yet to be written into the tour rider, and \"Runnin' with the Devil\" was cranked to 11 inside Camaros and keg parties alike.\nYears before the band found MTV mega-stardom with \"Jump\" and \"Hot For Teacher\", they were undeniably on their way to world domination. A new book out this week, Van Halen Rising: How a Southern California Backyard Party Band Saved Heavy Metal , traces their dizzying ascent from Pasadena cover band to 1978's multi-platinum debut. Here are five revelations from Van Halen Rising author Greg Renoff:\n1. Van Halen was originally named Genesis\nEddie and Alex Van Halen's first cover band was actually called Genesis—which they didn't realize was already the name of the British prog-rock group that brought us Peter Gabriel and Phil Collins. \"In late 1971, Eddie and Alex were in a record store in Pasadena. Eddie was thumbing through LPs and saw the Nursery Cryme album by Genesis,\" says Renoff. \"He pulled it out and laughed and said, 'Hey, we've got a record out, Alex.' They really didn't know there was a band called Genesis.\" The brothers then changed their band's name to Mammoth before eventually settling on Van Halen.\n2. David Lee Roth was almost replaced by Sammy Hagar in 1977\nHagar fronted the band during the controversial \"Van Hagar\" period after Roth left to pursue a solo career in 1985. But the tequila-loving \"Why Can't This Be Love?\" belter nearly nabbed the lead singer's slot eight years before that. Van Halen producer Ted Templeman got them signed to Warner Bros. mostly because he loved Eddie's guitar playing. Roth's vocals? Not so much. After hearing Roth sing on the band's demos, he nearly replaced him with Hagar, who had just left the band Montrose. But Roth stayed put, namely because he worked so hard to improve his voice in 1977.\n3. Ozzy Osbourne was reported missing after an epic coke binge with David Lee Roth\nAfter Van Halen opened for Black Sabbath in Birmingham, Alabama in 1976, Roth and Ozzy “snorted enough cocaine to stop the hearts of a half-dozen men.” The next day, they staggered to their respective tour buses bound for Nashville. Ozzy, who had been up for days, stumbled into the hotel and walked into the wrong room, which was being cleaned. He yelled at the housekeeper to leave, locked the door and passed out for 24 hours. Black Sabbath's panicked management couldn't find him and canceled the Nashville show, and police even considered the possibility that he had been kidnapped. But just before the bus left, a bleary Ozzy wandered into the hotel lobby. \"Guys were literally yelling, 'Ozzy's alive!' Renoff reports. That's probably not the first or last time anyone said that, but still...\n4. There was a bitter\"fashion clash\" between Roth and the Van Halen brothers\nBefore Roth teamed up with Eddie and Alex in 1973, the brothers wore flannel shirts, jeans and desert boots when they played live. The considerably glammier Roth wore gold lame' platform shoes, hip-hugger pants and loudly-colored, open shirts. \"The brothers didn't like his look,\" Renoff says.\"Roth went to a heavily integrated, black and Latino high school, so he was dressing like someone from Super Fly or Shaft. It was a real fashion clash.\" Little did the Van Halen brothers know that the freewheeling Roth would go on to regularly wear assless chaps onstage in the '80s.\n5. Journey singer Steve Perry once stopped them from destroying a Sheraton hotel\nWhile opening for Journey in 1978, Van Halen decided to destroy the entire 7th floor of a Sheraton in Madison, Wisconsin. They smashed lamps and mirrors, ripped bathroom doors off the hinges, had fire extinguisher fights and threw TVs, furniture, toilet seats and rotary phones out the window. Alex Van Halen was the worst culprit, but settled down after Perry stopped him and warned, \"You know you're going to have to pay for that stuff.\" Nerd alert! The band later blamed the damage on Journey and thanked \"Sheraton Hotel (seventh floor) Madison, Wisconsin\" in the liner notes for Van Halen II.", "external_links": ["http://money.cnn.com/magazines/fsb/fsb_archive/2007/07/01/100122129/", "http://ultimateclassicrock.com/david-lee-roth-thanks-eddie-van-halen/", "http://www.feelnumb.com/2009/11/03/van-halen-thanks-the-madison-wisconsin-sheraton-on-the-van-halen-ii-album/", "http://www.complex.com/style/2011/03/the-50-worst-rock-star-fashion-fails/david-lee-roth-wears-assless-chaps", "http://www.amazon.com/exec/obidos/ASIN/1770412638", "http://www.thesmokinggun.com/file/van-halens-legendary-mms-rider"], "published": "2015-10-12T03:00:00.000+03:00", "crawled": "2015-10-12T21:59:22.810+03:00", "highlightTitle": ""}