{"organizations": [], "uuid": "9a82c9936642e07b86a125629220fce5ffc468f6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "http://images.worldnow.com/AP/images/9004252_G.jpg", "site_section": "http://www.cbs8.com/category/73801/entertainment", "section_title": "Entertainment News | Movies, TV, Celebrity Gossip - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30247799/daniel-craig-inspects-the-uns-demining-work-in-cyprus", "country": "US", "title": "Daniel Craig inspects the UN's demining work in Cyprus", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Daniel Craig inspects the UN's demining work in Cyprus - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "9a82c9936642e07b86a125629220fce5ffc468f6"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30247799/daniel-craig-inspects-the-uns-demining-work-in-cyprus", "ord_in_thread": 0, "title": "Daniel Craig inspects the UN's demining work in Cyprus", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NICOSIA, Cyprus (AP) - Daniel Craig's globetrotting has brought him to Cyprus - but not to film any scenes as super spy James Bond.\nThe British actor was on the eastern Mediterranean island Tuesday to inspect the United Nations' work in clearing minefields, a vestige of the conflict that divided this island along ethnic lines more than four decades ago.\nThe U.N. has removed more than 27,000 landmines from the island's buffer zone over the last decade but it's estimated that thousands more remain.\nThe U.N. said Craig inspected a live minefield being cleared by a 20-strong Cambodian demining team from the U.N.'s peacekeeping mission in Lebanon.\nCambodia is still plagued by millions of undetected mines planted over three decades of strife that still injure and kill.\n\"For these peacekeepers to take their expertise, gleaned over the last forty years in Cambodia, and make it available to the people of Cyprus, half-way around the world, is truly inspiring,\" Craig said, according to the U.N.\nHe also toured the U.N.-controlled buffer zone that separates an internationally recognized Greek Cypriot south from a breakaway Turkish Cypriot north. Cyprus was split in 1974 when Turkey invaded after a coup by supporters of union with Greece.\nThe actor's two-day Cyprus trip is his first since being appointed U.N. Global Advocate for the Elimination of Mines and Explosive Hazards.\n\"I've much hope that I will be the first and last global advocate to see land mines on this beautiful island,\" said Craig.\nTalks aimed at reunifying Cyprus as a federation are expected to ramp up next month as the two sides tackle the issues that still separate them.\nCopyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-13T17:09:08.077+03:00", "highlightTitle": ""}