{"organizations": [], "uuid": "b15a364c7b7b171f03e73be7c4df4b6f92fcf65b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "http://yospace-cds1.reuters.com/u/resize~ad1~1200/0/f/~image_jpeg~9999-1/1/m/c/9/6/i/2j93/reuters04?videoId=112384645", "site_section": "http://feeds.reuters.com/reuters/USVideoEntertainment", "section_title": "Reuters Video: Entertainment", "url": "http://www.reuters.com/video/2015/10/08/too-much-too-young-teen-sparks-model-age", "country": "US", "title": "Too much too young? Teen sparks model age debate", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "Too much too young? Teen sparks model age debate", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T19:30:00.000+03:00", "replies_count": 0, "uuid": "b15a364c7b7b171f03e73be7c4df4b6f92fcf65b"}, "author": "", "url": "http://www.reuters.com/video/2015/10/08/too-much-too-young-teen-sparks-model-age", "ord_in_thread": 0, "title": "Too much too young? Teen sparks model age debate", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Too much too young? Teen sparks model age debate 12:30pm EDT - 02:09 \nFourteen-year-old Israeli model Sofia Mechetner sparks debate over whether modelling under the age of eighteen is too much too young. Edward Baran reports.   \nLiving the life many young girls dream of -- Sofia Mechetner is opening the Paris fashion show of one of the world's most famous labels, Dior. But she's just fourteen years old. SOUNDBITE, 14 YEAR-OLD ISRAELI MODEL, SOFIA MECHETNER, SAYING (English): \"I feel ready and I am not alone, I am being looked after, closely. They are treating me really nicely here. Everything I ask for is being taken care of, they help me. So the fact that I am 14-year-old is not really an issue.\" Mechetner was catapulted into the limelight in July when she opened Dior's haute couture show wearing a sheer white dress. Her appearance drew criticism and stirred the debate on where to draw the age line in fashion. SOUNDBITE, MANAGER, ROTEM GUR, SAYING (English): \"Before she started with Dior she was cleaning houses with her mother so if she is not too young to clean houses, I don't think she is too young to walk on a show.\" The use of young models isn't new -- with Kate Moss scouted at 14. Celebrity offspring have also modelled young. Romeo Beckham, son of soccer player David, starred in a Burberry campaign at 12. The British Fashion Council says designers contracted to London Fashion Week use models aged 16 or over. New York and Milan have similar age guidelines. And some of the biggest names in the industry say the pressure could be too much to take for younger models. SOUNDBITE, MODEL NEELAM GILL, SAYING (English): \"I think you should start modelling at 18. I mean, that is the age I started up.\" SOUNDBITE, MALE MODEL, DAVID GANDY, SAYING (English): \"You do get scrutinised, you do get disappointments and that's very hard to take when you're fourteen or sixteen. At eighteen you're a little but more experienced, but even at 18, I would say I was probably ready by 21, 22.\" Dior hasn't publicly commented on Mechetner's employment and other powerful fashion houses have not shied away from using teenage models. Lily-Rose Depp, the 16-year old daughter of film star Johnny Depp, is the face of Chanel's eyewear. SOUNDBITE, CHANEL CREATIVE DIRECTOR, KARL LAGERFELD, SAYING (English): \"I'm sorry to tell you that's the way people want to see them. The public wants to see them on girls like this. They can identify even if it's not the same age group.\" And with that pronouncement from one of the most powerful men in fashion, this debate looks set to continue.  //reut.rs/1MgvDue", "external_links": [], "published": "2015-10-08T19:30:00.000+03:00", "crawled": "2015-10-08T22:10:46.427+03:00", "highlightTitle": ""}