{"organizations": ["Academy of Motion Picture Arts and Sciences"], "uuid": "81e0bef28f0bfb2038cb68d7fd8638c3afed58c6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "http://s4.reutersmedia.net/resources/r/?m=02&d=20151024&t=2&i=1089468069&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXNPEB9N0AW", "site_section": "http://feeds.reuters.com/reuters/entertainment", "section_title": "Reuters: Entertainment News", "url": "http://www.reuters.com/article/2015/10/24/us-people-o-hara-idUSKCN0SI0OZ20151024?feedType=RSS&feedName=entertainmentNews", "country": "US", "title": "Maureen O'Hara, spirited Hollywood star, dies at 95", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "Maureen O'Hara, spirited Hollywood star, dies at 95", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T21:05:00.000+03:00", "replies_count": 0, "uuid": "81e0bef28f0bfb2038cb68d7fd8638c3afed58c6"}, "author": "", "url": "http://www.reuters.com/article/2015/10/24/us-people-o-hara-idUSKCN0SI0OZ20151024?feedType=RSS&feedName=entertainmentNews", "ord_in_thread": 0, "title": "Maureen O'Hara, spirited Hollywood star, dies at 95", "locations": ["California", "Los Angeles"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Maureen O'Hara"], "text": "Honoree actress Maureen O'Hara poses during the Academy of Motion Picture Arts and Sciences Governors Awards in Los Angeles, California November 8, 2014. Reuters/Kevork Djansezian \nMaureen O'Hara, the flame-haired Irish-American actress known for playing feisty women in classics like \"How Green Was My Valley\" and \"Miracle on 34th Street\" as well as her on-screen chemistry with John Wayne, died on Saturday of natural causes at the age of 95, her manager said. \nO'Hara passed away peacefully at her home in Boise, Idaho, surrounded by family members and listening to \"her favorite music\" from the 1952 film \"The Quiet Man,\" said Johnny Nicoletti, her manager and co-author of O'Hara's memoir \"'Tis Herself'.\" \nO'Hara was one of Hollywood's top leading ladies of the 1940s and 1950s and was a favorite of fabled director John Ford. \nShe starred in more than 50 films and thrived in various genres: dramas, swashbuckling adventures, Westerns, comedies and family films. \nO'Hara brought a fiery temperament, sharp tongue and strong-willed manner to her roles. With her red hair and green eyes, she was once dubbed the \"Queen of Technicolor.\" \nShe starred opposite some of the top leading men of the screen including Wayne, Jimmy Stewart, Henry Fonda, Tyrone Power and Douglas Fairbanks Jr. \nDespite being one of the most recognizable leading women in American cinema for decades and delivering numerous memorable performances, she was never nominated for an Oscar. \nIn 2014, however, she was given an honorary Oscar for career achievement and showed she still had her fiery temperament at age 94 by protesting when her acceptance speech was cut short and she was rolled offstage in her wheelchair. \nHer breakout role was in 1939 as the gypsy Esmeralda alongside Charles Laughton's Quasimodo in \"The Hunchback of Notre Dame.\" She largely retired from the movies after the 1971 big-screen Western, \"Big Jake,\" with Wayne and the 1973 television movie, \"The Red Pony,\" with Fonda, but returned to the big screen to play John Candy's overbearing mother in \"Only the Lonely\" in 1991. \nO'Hara teamed with gruff Hollywood superstar Wayne in five movies: \"Rio Grande\" (1950); \"The Quiet Man\" (1952), a nominee for a best picture Oscar; \"The Wings of Eagles\" (1957); \"McLintock!\" (1963); and \"Big Jake\" (1971). Wayne liked to say she was \"the greatest guy I ever met.\" \n'VERY WELL, YOU'RE MAUREEN O'HARA' \nShe was born in 1920 near Dublin as Maureen Fitzsimons. In 1939, she was cast in director Alfred Hitchcock's \"Jamaica Inn.\" Co-star Laughton was so impressed that he took her to the United States and cast her in a major role in \"The Hunchback of Notre Dame.\" He also changed her name. \n\"He said that nobody would ever get it straight so we're going to change your name to O'Hara or O'Mara. I said, 'I like Maureen Fitzsimons and I want to keep it,' and he said, 'Very well, you're Maureen O'Hara,'\" she told the Guardian of London. \nIn 1991, asked to name her two favorite co-stars, she told the Los Angeles Times: \"Why did you have to make that so difficult? If you had asked one, I'd say John Wayne. But two - I couldn't choose - Henry Fonda? Brian Keith? Jimmy Stewart? ... They were all fine actors, gentlemen, intelligent, considerate - fine people. They were tough and strong. I was tough and strong.\" \nAfter \"Hunchback,\" O'Hara's career caught fire when Ford cast her with Walter Pidgeon in the 1941 family drama \"How Green Was My Valley,\" winner of five Academy Awards, including best picture, despite tough competition including \"Citizen Kane.\" \nIn the 1947 film \"Miracle on 34th Street,\" O'Hara played a single working mother to daughter Natalie Wood who hired a kindly man portrayed by Edmund Gwenn to play a department store Santa Claus only to realize he may be the real thing. It became one of the most popular holiday-themed movies ever made. \nShe played feisty women in swashbucklers such as \"The Black Swan\" in 1942, \"Sinbad the Sailor\" in 1947 and \"At Sword's Point\" in 1952. She was happy to play physical roles and enjoyed doing her own stunts because \"it was like an extension of the girl bashing up the boys when I was young.\" \nO'Hara began to take maternal roles in the 1960s, like \"The Parent Trap\" in 1961 with Brian Keith and Hayley Mills. \nShe was married three times. Her third husband was aviator Charles Blair, whom she married in 1968. When Blair was killed in a plane crash in 1978, she took his post as head of a Caribbean commuter airline.", "external_links": [], "published": "2015-10-24T21:05:00.000+03:00", "crawled": "2015-10-24T21:34:38.414+03:00", "highlightTitle": ""}