{"organizations": ["Christian Post"], "uuid": "a734dcdeaa9659bcbda84deeb1ad3565858ce2fd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.christianpost.com", "main_image": "http://images.christianpost.com/full/88727/chicago-pd.jpg", "site_section": "http://www.christianpost.com/services/rss/feed/entertainment/", "section_title": "The Christian Post Entertainment", "url": "http://www.christianpost.com/news/past-catches-up-with-voight-lindsay-copes-with-family-in-oct-14-episode-of-chicago-pd-147370/", "country": "US", "title": "Past Catches Up With Voight, Lindsay Copes With Family In Oct. 14 Episode Of 'Chicago PD'", "performance_score": 0, "site": "christianpost.com", "participants_count": 0, "title_full": "Past Catches Up With Voight, Lindsay Copes With Family In Oct. 14 Episode Of 'Chicago PD'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T20:48:00.000+03:00", "replies_count": 0, "uuid": "a734dcdeaa9659bcbda84deeb1ad3565858ce2fd"}, "author": "", "url": "http://www.christianpost.com/news/past-catches-up-with-voight-lindsay-copes-with-family-in-oct-14-episode-of-chicago-pd-147370/", "ord_in_thread": 0, "title": "Past Catches Up With Voight, Lindsay Copes With Family In Oct. 14 Episode Of 'Chicago PD'", "locations": ["Chicago"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Voight", "Aarati Shah", "Lindsay"], "text": "Past Catches Up With Voight, Lindsay Copes With Family In Oct. 14 Episode Of 'Chicago PD' 0 By Aarati Shah , Christian Post Contributor October 11, 2015 | 1:48 pm \nIn the upcoming episode of \"Chicago PD\" titled \"Actual Physical Violence,\" the fight between Bunny and Voight gets tougher and Lindsay is trying to manage family problems. A secret hangs between Olinksy and Antonio while Platt is harried when a man turns up at the desk, desperately seeking help for his missing daughter. Facebook/Chicago P.D. Chicago PD \nVoight's dark past is catching up with him. Voight is from the original Chicago Fire where he is a dirty cop, which is actually his alter ego and part of an undercover operation to net in other corrupt cops and criminals. Voight is not very popular with Casey or with Chief Boden. \nIn the upcoming episode, Voight will have to fight off fresh accusations from the 2001 case involving his son and brought up by Bunny, played by guest star Markie Post. The clash between Bunny and Voight will lead to many interesting secrets being revealed. \nDetective Erin Lindsay is caught between family problems. On one side is her biological mother and on the other side is her mentor and guide, Voight, who had rescued her from a druggie's life and made her into the tough detective that she has now become. \nAs usual, the chaos at the Chicago PD desk is accelerated when a man's daughter goes missing and the man takes drastic action to get the police to find her. \nThe official synopsis is as follows: \"While Platt (Amy Morton) tries to manage a chaotic desk area, a man struggling to get her attention takes a drastic action and demands that the unit find his missing daughter. At the same time, Commander Fischer (guest star Kevin J. O'Connor) informs Voight (Jason Beghe) that Bunny (guest star Markie Post) is bringing up new accusations on a case from his past. Lindsay (Sophia Bush) urges her mother to fix the situation. Meanwhile, Antonio (Jon Seda) is shocked to learn a secret Olinksy (Elias Koteas) has been keeping.\" \nIn the previous episode, detective Alvin Olinksy's relationship with his newfound daughter is moving ahead. However, at the work front, Antonion discovers a secret that Olinksy's has been hiding. \nWatch the chaotic desk of \"Chicago PD\" in their next episode \"Actual Physical Violence,\" that airs October 14.", "external_links": [], "published": "2015-10-11T20:48:00.000+03:00", "crawled": "2015-10-12T03:35:01.749+03:00", "highlightTitle": ""}