{"organizations": [], "uuid": "b637b1767fd3bde1a85dbe98ef8d0a132a84f332", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.philly.com", "main_image": "http://media.philly.com/images/RIrvine800.jpg", "site_section": "http://www.philly.com/philly/entertainment", "section_title": "Philly.com guide to entertainment news, music, nightlife and things to do in the Philadelphia area", "url": "http://www.philly.com/philly/entertainment/celebrities/20151022_Britain_s_baddest_chef_comes_to_Philly.html", "country": "US", "title": "Britain's baddest chef comes to Philly", "performance_score": 0, "site": "philly.com", "participants_count": 1, "title_full": "Britain's baddest chef comes to Philly", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "b637b1767fd3bde1a85dbe98ef8d0a132a84f332"}, "author": "Jenny DeHuff,", "url": "http://www.philly.com/philly/entertainment/celebrities/20151022_Britain_s_baddest_chef_comes_to_Philly.html", "ord_in_thread": 0, "title": "Britain's baddest chef comes to Philly", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Celebrity chef Robert Irvine has seen just about everything when it comes to gross kitchens. Cockroaches, bacteria, wads of grease 5 inches thick - and he's put it all on TV, to encourage and scare restaurateurs into fixing what's broken in their businesses.\nIrvine's a familiar face on the Food Network for his brash approach to constructive criticism on shows like \" Dinner: Impossible ,\" \" Worst Cooks in America \" and \" Restaurant: Impossible ,\" among others.\nHe'll be in town Monday for \"Setting the Table for Success,\" a restaurant-business seminar put on by Comcast, Irvine and some Philadelphia industry pros. (Details on the free seminar at comcast-events.com.)\nTonight at 8 on the Food Network, Irvine will be on the judging panel as 12 former \"Chopped\" champions compete on \"Chopped: Impossible.\" Cookbook author and TV personality Ted Allen hosts.\nAsked how being on TV has changed his business approaches, Irvine said: \"For me, technology has been the biggest learning curve. When change comes - and it does - if we don't keep up with it, somebody else is going to do it, and we'll be out of business.\"\nWhen Irvine comes to Philly, he almost always stops at Stephen Starr 's Parc (227 S. 18th St.), and at Marc Vetri 's and Jose Garces ' hot spots.\nA Rose is a rose . . . Dressed in little more than her birthday suit, Philly's own Amber Rose graces the pages of November's GQ magazine, on newsstands Monday.\nRose talks to GQ about her new book, How to Be a Bad Bitch , out Tuesday, the same day she'll appear at the Barnes & Noble on Rittenhouse Square (1805 Walnut St.) at 7 p.m.\nHer book discusses feminism, child rearing and why she doesn't need a man in her life to be successful.\nShe's not so happy about her GQ treatment, posting on Instagram that a blurb in the article referred to her as \" Kanye 's infamous ex [and] Wiz Khalifa 's baby mama.\"\n\"I'm so much more,\" she fumed. \"Damn, why the [expletive] did u guys reach out to me for this article and photoshoot? To dumb me down? . . . I expected so much more from u guys.\"\nDN of future past Daily News movie critic Gary Thompson 's getting buzz for a 1989 review he did of \"Back to the Future II,\" which sends Michael J. Fox 's Marty McFly to Oct. 21, 2015. Rotten Tomatoes mined critics' reviews on the film's depiction of our current day.\nWrote Thompson, on Nov. 22, 1989:\n\"The different visions of alternate times and realities are imaginatively staged . . . The best of them is a Hill Valley dominated by Biff [Tannen, the series' villain played by Thomas F. Wilson ], who has used his ill-gotten information about the outcome of sporting events to amass a fortune. He's become a nightmarish (more nightmarish?) version of Donald Trump , converting the town into a neon-lit casino town ruled by greed and power.\"\nEmail: dehuffj@phillynews.com\nOn Twitter: @PhillyGossipDN\nOnline: ph.ly/DNGossip\nMore coverage Joe Jonas makes comeback with DNCE Mo'ne Davis launches holiday sneaker collection", "external_links": ["http://www.foodnetwork.com/shows/dinner-impossible.html", "http://www.foodnetwork.com/shows/restaurant-impossible.html", "http://www.foodnetwork.com/shows/worst-cooks-in-america.html"], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-22T12:11:12.397+03:00", "highlightTitle": ""}