{"organizations": [], "uuid": "8bfb3fe942866996d7e406dec7484f5afdd62a63", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.winnipegsun.com", "main_image": "http://storage.winnipegsun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297763825379_LARGE_BOX.jpg?quality=80&stmp=1445648295567&size=100x", "site_section": "http://www.winnipegsun.com/entertainment/rss.xml", "section_title": "Top Entertainment stories", "url": "http://www.winnipegsun.com/2015/10/23/gordon-lightfoot-immortalized-in-bronze-in-hometown-orillia", "country": "CA", "title": "Gordon Lightfoot immortalized in bronze in hometown Orillia", "performance_score": 0, "site": "winnipegsun.com", "participants_count": 0, "title_full": "Gordon Lightfoot immortalized in bronze in hometown Orillia", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T03:40:00.000+03:00", "replies_count": 0, "uuid": "8bfb3fe942866996d7e406dec7484f5afdd62a63"}, "author": "", "url": "http://www.winnipegsun.com/2015/10/23/gordon-lightfoot-immortalized-in-bronze-in-hometown-orillia", "ord_in_thread": 0, "title": "Gordon Lightfoot immortalized in bronze in hometown Orillia", "locations": ["ORILLIA", "Orillia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Gordon Lightfoot"], "text": "Report an error ORILLIA - \nIf you could read his mind the tale his thoughts could tell would definitely be memories of the very location where he was immortalized forever. \n“Oh yeah I remember this place very well,” Gordon Lightfoot said Friday, on the day where an incredible bronze sculpture was unveiled in his honour. \nSculpted by St. Jacobs figurative artist Timothy Schmalz, the four-metre (13-foot) Lightfoot statue, Golden Leaves: A Tribute To Gordon Lightfoot was placed at the foot of Lake Couchiching in the picturesque J.B. Tudhope Memorial Park in the heart of the legend’s beloved home town. \n“I used to ride my bike down here in what was known as Barnfield Point,” the soon to be 77-year-old national treasure told the Toronto Sun. “I used to swim over there.” \nThe area is called the Lightfoot Trail now but as much as this day was about Lightfoot, he made it about Orillia. \n“He means a lot to us because his music was from our generation but he is also a local,” sad Marlene Caryl, who was among the hundreds who came down to witness the dedication. \nJim and Sandy Simpson have the rare bragging right to say they actually saw Lightfoot play as a teen at Jim’s “eighth grade school graduation party above Carter’s Restaurant.” \nClassy Gordon Lightfoot said his upbringing in Orillia is part of his success which includes 17 Junos and five Grammy nominations and more than 20 top-40 songs. \nThanks to Christopher Bratty of the Remington Group, Lightfoot will be part of Orillia, and this beautiful spot in the heart of Canada, forever. \n“Gordon Lightfoot and his music is quintessentially Canadian that transcends borders,” said Bratty. “Whenever I hear Gordon’s music, I never want it to end.” \nSchmalz, whose works are often religious and displayed in city’s centres around the world, said he listened to every Lightfoot song over a half-century career to gain inspiration. \n“Gordon Lightfoot is Canada’s Shakespeare,” said Schmalz. \nAt that point a humbled Lightfoot, as photographer Michael Peake captured, put his head in his hands in shock. \nHe told me he doesn’t feel worthy of such grand compliments, adoration or immortalization but more like a regular kid from Orillia. \nHe’s so understated, Gordon and his wife Kim drove down to the ceremony, not in a limo, but a small two-door Ford. \nNot one to blow his own horn, it sure was nice to see that there are others who will do it for him. \n“He’s very special and we think the world of him,” said a beaming Bratty, who through the Rudolph P. Bratty Foundation funded the $500,000 project. \nSchmalz said he hopes “100 years from now and beyond people will come down and reflect on the greatness of this musical talent.” \nThis, he said, is why he decided to not only do a statue likeness of Lightfoot with a guitar but also incorporate scenes from some of his greatest songs. It’s a stunning piece of art complete with beautiful portraits of the Wreck of the Edmund Fitzgerald, The Canadian Railroad Trilogy and the Carefree Highway. \nThere are just too many songs to mention but classics like If You Could Read My Mind, Sundown, Early Morning Rain, Song For A Winter’s Night, Rainy Day People, Alberta Bound, Cotton Jenny and Did She Mention My Name? are among those highlighted. \nWhen with the help of Orillia Mayor Steve Clarke, Simcoe North MP Bruce Stanton and MC John Swartz, as his classics played in the background, Lightfoot partook in the countdown to unveil the much anticipated work. When the tarp came off, he stood there in awe. \n“Nice job, Tim,” said Lightfoot after a pause to soak it all in. \nYou too, Gordon. \nHe took a long look at the bronze interpretation of himself and his songs that will be on the very waterfront lands that helped inspired it all. Lightfoot admitted he was a loss for words. \nBut you didn’t have to read his mind to see he was thrilled. Sponsored Links", "external_links": [], "published": "2015-10-24T03:40:00.000+03:00", "crawled": "2015-10-24T04:20:14.482+03:00", "highlightTitle": ""}