{"organizations": [], "uuid": "070e45e58b0f48bcd215463c68b176e1e093d08a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.baltimoresun.com", "main_image": "http://www.trbimg.com/img-561ddb35/turbine/bal-the-410-in-140-jazzmen-knoderer-20151014", "site_section": "http://www.baltimoresun.com/entertainment/rss2.0.xml#", "section_title": "Entertainment - Baltimore Sun", "url": "http://www.baltimoresun.com/features/baltimore-insider-blog/bal-the-410-in-140-jazzmen-knoderer-20151014-htmlstory.html", "country": "US", "title": "The 410 in 140: @jazzmen_k talks 'call-out culture,' Beyonce, accountability", "performance_score": 0, "site": "baltimoresun.com", "participants_count": 1, "title_full": "The 410 in 140: @jazzmen_k talks 'call-out culture,' Beyonce, accountability", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T07:00:00.000+03:00", "replies_count": 0, "uuid": "070e45e58b0f48bcd215463c68b176e1e093d08a"}, "author": "Quinn Kelley", "url": "http://www.baltimoresun.com/features/baltimore-insider-blog/bal-the-410-in-140-jazzmen-knoderer-20151014-htmlstory.html", "ord_in_thread": 0, "title": "The 410 in 140: @jazzmen_k talks 'call-out culture,' Beyonce, accountability", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Quinn Kelley Contact Reporter \n“We’re tired of Jazzmen posting all these links.” \nThat was the name of a group on Facebook -- then, “The Facebook” -- created by friends of Jazzmen Knoderer in the site's early days. Knoderer, a former Myspace enthusiast, had found an exciting outlet for posting articles and her commentary -- though sharing links clearly hadn’t quite caught on yet. This could be us but I'm not eating carbs this week. ¿¿¿¿ pic.twitter.com/eUm5rhmcfP — Dr. Cornrow West (@jazzmen_k) May 18, 2015 \nThe West Baltimore native has since found a captive audience for her observations and links, tweeting under @jazzmen_k . Knoderer, an academic coordinator in Johns Hopkins University’s nursing school, and an early adopter of social media platforms, shares interests ranging from Beyonce to Baltimore on Twitter. \n“I remember being really into Myspace at first, and thinking, oh, I’m on Myspace; I would never be on Facebook,” she said, which soon turned into: “Why would I get on Twitter if I could just post a status on Facebook? And then I got on Twitter and I was like, this is amazing.” \nThe 29-year-old remembers a pre-2008-election Twitter, in which awards show commentary and humor dominated. She witnessed a shift in the culture a few years later. \n“It was kind of like watching TV in your living room with a couple thousand people, and now it doesn’t have that small feel anymore,” she said. “Now I think Twitter is becoming a bit unwieldy for me.” Breaking: @rupertmurdoch demands to see President Obama's black certificate — Dr. Cornrow West (@jazzmen_k) October 8, 2015 \nNot only has Twitter become more unwieldy, but timelines are filled with more instances of violence, racism and police shootings as the social platform increasingly becomes a hub for activism and transparency. That transformation, Knoderer said, has inspired a push for self-care among many of the people she follows, making conscious decisions to unplug and refusing to retweet videos depicting police shootings. \n“You never know when you’re going to be triggered by something that’s really messed up,” she said. “There’s this fine line between wanting to stay connected and informed, and knowing that if you don’t see that one tweet, it doesn’t mean that you don’t care. It doesn’t mean that you’re not aware of the issues.” \"Justine Sacco will be fine. I don't feel sorry for her.\" - ME, 2013 https://t.co/tUaWtv9alP — Dr. Cornrow West (@jazzmen_k) October 6, 2015 \nThough Twitter can be a channel for transparency, 140-character limits don’t lend themselves to context or nuance, as evidenced by a popular tweet of Knoderer’s from last year. In trying to point out the flaws of white feminism, Knoderer sent a tweet highlighting the hypocrisy of Beyonce’s feminism being called into question when white celebrities are heralded for making the same declaration -- but many readers didn’t pick up on Knoderer’s intended meaning. \n“I think Twitter has amplified the need for media literacy, because so many people tweet things without context and without verification,” she said. “I don’t think that that furthers discourse in any productive way.” — Dr. Cornrow West (@jazzmen_k) September 24, 2014 \nKnoderer, who lives in Mount Washington with her husband and dog (both of whom are on Twitter), has exercised that ability academically to provide context in a clear and concise manner; she studied journalism at Towson University, where she will also become an adjunct professor next spring. \n“I’ve been told that when I talk I use really short sentences in a punchy way, so I think the way I tweet is definitely how I talk in real life,” she said. It's his Snuggie now. pic.twitter.com/kCFMiOyvGg — Dr. Cornrow West (@jazzmen_k) October 8, 2015 \nIn Twitter, Knoderer also sees a utility in bringing once-private thoughts, criticisms and conversations into the public -- she doesn’t favor the term “call-out culture,” but values the accountability social media provides. \n“These reactions aren’t new,” she said. “But Twitter makes it real so that there are real consequences, and for the first time I think people in powerful positions and people with privilege are being held accountable by people who, I don’t necessarily want to call them voiceless because they’ve always had voices, but now we have an opportunity to respond in real time.” \nIt’s easy to tweet -- it’s another thing altogether to advocate for social justice in actionable ways, Knoderer acknowledges, though social media can be a powerful tool in driving those efforts. After the death of Freddie Gray in April, Knoderer volunteered to make lunches for children whose schools were closed, in an event circulated around Twitter. \n“I’ve kind of shifted away from tweeting about myself, especially since I’ve been trying to get more involved in Baltimore in terms of, ‘Where are we going to protest and where do the kids need food?’” Knoderer said. “I’ve been trying to make a conscious effort to recenter my humanity on social media as opposed to always tweeting about fighting the power.” \n\"The 410 in 140\" puts the spotlight on prominent Baltimore Twitter personalities. If you have a suggestion of someone to be featured, email qkelley@baltsun.com . \nRead interviews with @dennisthecynic , @paulmgardner , @slb79 , @annmariebrok and @thebrokenplate . \ntwitter.com/quinnrkelley", "external_links": [], "published": "2015-10-14T07:00:00.000+03:00", "crawled": "2015-10-14T19:23:14.063+03:00", "highlightTitle": ""}