{"organizations": ["AP Television"], "uuid": "aaa3d4a60b0df6439d9e286f79ebac78d695c97f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pendletontimespost.com", "main_image": "", "site_section": "http://pendletontimespost.com//feed/sec/7000/", "section_title": "PendletonTimesPost.com - Entertainment News", "url": "http://www.pendletontimespost.com/view/story/1e257822b54d484390d52ddc1ef0d5e1/US--TV-The-View-Apology/", "country": "US", "title": "Raven-Symone apologizes for remark on job discrimination", "performance_score": 0, "site": "pendletontimespost.com", "participants_count": 0, "title_full": "Raven-Symone apologizes for remark on job discrimination", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T00:28:00.000+03:00", "replies_count": 0, "uuid": "aaa3d4a60b0df6439d9e286f79ebac78d695c97f"}, "author": "", "url": "http://www.pendletontimespost.com/view/story/1e257822b54d484390d52ddc1ef0d5e1/US--TV-The-View-Apology/", "ord_in_thread": 0, "title": "Raven-Symone apologizes for remark on job discrimination", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["DAVID BAUDER", "Raven-Symone"], "text": "Raven-Symone says her comment on 'The View' about job discrimination in poor taste By DAVID BAUDER AP Television Writer   12, 2015 - 5:28 pmLast Updated: October 12, 2015 - 5:28 pm   \nPeople: \nSocial affairs (4589) \n\nNEW YORK — Raven-Symone is the latest panelist on \"The View\" to try to take back her words, saying her comment last week that she would not hire someone with an ethnic-sounding name was in \"poor taste.\" \nThe former child star and new panelist on ABC's daytime chat show was part of a discussion last Thursday about a study on people who make racial assumptions based on names. She said she discriminated against people when it came to names. \n\"I'm not about to hire you if your name is Watermeloandrea,\" she said, later explaining that she heard that name online in a viral video and wasn't targeting a specific race. \nRaven-Symone, in a Facebook post this weekend, said she's been rejected for jobs because of her skin color, size and age. She said she hoped names, physical appearance or sexual orientation would never outweigh job qualifications, but they often do. \"That's the truth, and it sucks,\" she wrote. \nEven though she said on \"The View\" that she'd discriminate against a name, she said over the weekend that she would not. \n\"My comment was in poor taste,\" she said. \"My lack of empathy toward name discrimination was uncalled for.\" \nApologies are nothing new on \"The View.\" Joy Behar apologized twice last month after some mocking commentary about a Miss America contestant who is a nurse appeared on the pageant dressed for work and talked about an Alzheimer's patient. The comment infuriated nurses and led to a couple of ads being pulled from the show. \nWhoopi Goldberg also drew attention this summer for backing fellow comedian Bill Cosby following a story by The Associated Press that Cosby had admitted to obtaining Quaaludes with the intent of giving them to women he wanted to have sex with. \nA few days later, \"The View\" brought legal analyst Dan Abrams on to explain the case against Cosby, and Goldberg walked back her support. \nAll content copyright ©2015 Pendleton Times-Post, a division of Home News Enterprises unless otherwise noted.", "external_links": [], "published": "2015-10-13T00:28:00.000+03:00", "crawled": "2015-10-13T09:57:06.467+03:00", "highlightTitle": ""}