{"organizations": [], "uuid": "4f0e58acf406643f1bd003c4701f5f466bfd0a0a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.examiner.com", "main_image": "http://cdn2-b.examiner.com/sites/default/files/styles/image_content_width/hash/0e/2d/0e2d08ab671a2fa747c28bc031f379c0.jpg?itok=RYvPr3u9", "site_section": "http://www.examiner.com/arts-and-entertainment", "section_title": "Arts &amp; Entertainment | Examiner.com", "url": "http://www.examiner.com/article/free-printable-back-to-the-future-day-coloring-pages-for-oct-21-2015", "country": "US", "title": "Free printable Back to the Future Day coloring pages for Oct. 21, 2015", "performance_score": 0, "site": "examiner.com", "participants_count": 1, "title_full": "Free printable Back to the Future Day coloring pages for Oct. 21, 2015 | Examiner.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T01:03:00.000+03:00", "replies_count": 0, "uuid": "4f0e58acf406643f1bd003c4701f5f466bfd0a0a"}, "author": "Marilisa Sachteleben", "url": "http://www.examiner.com/article/free-printable-back-to-the-future-day-coloring-pages-for-oct-21-2015", "ord_in_thread": 0, "title": "Free printable Back to the Future Day coloring pages for Oct. 21, 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Play Just in time for 'Back to the Future Day,' Jason Bradbury posted a video on YouTube shocking people as he rode around Piccadilly Circus on a replica of Marty McFly's hoverboard while holding onto a DeLorean time machine replica. Bradbury even dressed... on.aol.com Great Scott! It's Back to the Future Day! You remember how Doc Brown sent Marty McFly to Oct. 21, 2015 in the DeLorean time machine in Back to the Future 2? Well, now 10/21/2015 is a sort of official B2TF holiday which begins at 4:28 pm (the time McFly set). So, here are free printable Back to the Future coloring pages to celebrate. Start your time travel journey at Free Colouring Pages in the UK for images of warriors McFly and Doc encounter in the future world. Here's a website with a nice collection of the sooo-very cool DeLorean time machine from the Back to the Future trilogy. Here's a free printable B2tF coloring page featuring Doc Brown, Marty McFly and his skateboard, Einstein and the clock tower.\nAnd don't miss this awesome website, also from the UK with more free printable Back to the Future coloring pages . Kids and adults alike will love the DeLorean, the flux capacitor and all the cool inventions the creators thought there would be in 2015. Surprise--most of those haven't gotten here yet. The world is still waiting on Mr. Fusion, hoverboards, self-drying clothes, self-tying shoes, flying cars and rejuvenation clinics. We do have food hydrators and holographic movies but they're not quite as impressive as B2TF show creators envisioned. Of course, we do have Internet and mobile phones which B2TF never foresaw.\nHere are a few more DeLorean DMC 12 coloring pages to print. Here are coloring pages with the DeLorean gullwing doors open. There's a printable paper model of a 3D DeLorean to cut, assemble and paste. Here are how to draw a DeLorean tutorials, too. It's hard to know what John Delorean's most iconic car feature was: those winged doors, the fiberglass under carriage, the techno logo, the stainless steel bodies or the flat-nosed lean looking style. Maybe it was the fact that Delorean was made originally only in Ireland by an entirely Irish labor force. Happy Back to the Future Day, folks!", "external_links": ["http://printablecolouringpages.co.uk/?s=back+to+the+future", "http://printablecoloringpages.in/?zq=Back%20To%20The%20Future", "http://printablecolouringpages.co.uk/?s=delorean%20car", "http://www.comicartfans.com/gallerypiece.asp?piece=754758", "http://www.education.com/worksheet/article/delorean-dmc-12/", "http://freecoloringpages.co.uk/?q=back%20to%20the%20future", "http://how.to-draw.co.uk/?s=the%20delorean"], "published": "2015-10-22T01:03:00.000+03:00", "crawled": "2015-10-22T02:47:46.857+03:00", "highlightTitle": ""}