{"organizations": [], "uuid": "c3cd4aeb89e415a8025d54a99d3c1d3ee48d9135", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48524/c", "section_title": "Entertainment - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30304150/moon-river-studios-announces-production-of-james-brown-documentary", "country": "US", "title": "Moon River Studios Announces Production of James Brown Documentary", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Moon River Studios Announces Production of James Brown Documentary - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "c3cd4aeb89e415a8025d54a99d3c1d3ee48d9135"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30304150/moon-river-studios-announces-production-of-james-brown-documentary", "ord_in_thread": 0, "title": "Moon River Studios Announces Production of James Brown Documentary", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Information contained on this page is provided by an independent third-party content provider. WorldNow and this Station make no warranties or representations in connection therewith. If you have any questions or comments about this page please contact pressreleases@worldnow.com .\nSOURCE FONU2, Inc.\nRINCON, Ga. , Oct. 20, 2015 /PRNewswire/ -- FONU2, Inc . (OTCQB: FONU) (\"FONU2\", \" Moon River \" or \"Company\") announced today that in association with RKA Entertainment LLC and Loochie Records & Publishing LLC, the Company will be producing a documentary on the legendary Godfather of Soul , the founding father of funk music, James Brown . Rolling Stone has cited James Brown as the most sampled artist of all time.\nThe documentary will feature proprietary concert footage from James Brown's last live performance ever, interviews with friends and family, along with interviews from current music celebrities discussing how James Brown influenced them. In addition to the concert footage, some of the themes of the film will include (i) his battles against racism, (ii) his patriotism and support of the troops during the Vietnam War, and (iii) the multi-generational impact, influence and popularity of his music.\nTerms of the agreement include shared rights on up to sixteen never before released songs performed by James Brown . It is anticipated that a number of these songs will be featured in the documentary, along with an accompanying soundtrack. Production of the film is expected to begin in November 2015.\nAbout James Brown\nIn a career that spanned six decades, James Brown influenced the development of several music genres. Brown began his career as a gospel singer in Toccoa, Georgia . Brown recorded 16 singles that peaked at number-one on the Billboard R&B charts. Brown also holds the record for the most singles listed on the Billboard Hot 100 chart which did not reach number-one. Brown has been honored by many institutions including inductions into the Rock and Roll Hall of Fame and Songwriters Hall of Fame. In Joel Whitburn's analysis of the Billboard R&B charts from 1942 to 2010, James Brown is ranked as number one in The Top 500 Artists. Brown is ranked seventh on the music magazine Rolling Stone ' s list of its 100 greatest artists of all time.\nAbout FONU2 Inc.\nFONU2 is a publicly traded company,that operates under the name Moon River Studios (\" Moon River \"). Moon River has a public private partnership with the Effingham County Industrial Development Authority, and the State of Georgia , to develop a 1,560 acre full service film production facility predominantly in Effingham, Georgia . Moon River's camera, grip and electric equipment rental subsidiary serves coastal Georgia and beyond. For additional information, visit our Website, www.Fonu2.com . You can also follow us on our social network, Facebook , Google + and Twitter .\nSafe Harbor Statement\nThe Private Securities Litigation Reform Act of 1995 provides a \"safe harbor\" for forward-looking statements. Certain information included in this press release contains statements that are forward-looking, such as statements related to the future anticipated direction of the industry, plans for future expansion, various business development activities, planned or required capital expenditures, future funding sources, anticipated sales growth, and potential contracts. Such forward-looking information involves important risks and uncertainties that could significantly affect anticipated results in the future and, accordingly, such results may differ from those expressed in any forward-looking statements made by, or on behalf of, the company. These risks and uncertainties include, but are not limited to, those relating to development and expansion activities, dependence on existing management, financing activities, domestic and global economic conditions, and other risks and uncertainties described in the Company's periodic filings with the Securities and Exchange Commission.\nLogo - http://photos.prnewswire.com/prnh/20150707/232348LOGO\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/moon-river-studios-announces-production-of-james-brown-documentary-300162521.html\n©2015 PR Newswire. All Rights Reserved.", "external_links": ["http://fonu2.us9.list-manage1.com/track/click?u=81ff0acc882d8b7fd40aa431f&id=f4e4dd6a2a&e=1ffd4cb098", "http://www.xmlnews.org/ns/", "http://rt.prnewswire.com/rt.gif?NewsItemId=CL32574&Transmission_Id=201510200807PR_NEWS_USPR_____CL32574&DateId=20151020", "http://fonu2.us9.list-manage.com/track/click?u=81ff0acc882d8b7fd40aa431f&id=98c6489ce1&e=1ffd4cb098", "http://photos.prnewswire.com/prnh/20150707/232348LOGO", "http://fonu2.com/", "http://photos.prnewswire.com/prnvar/20150707/232348LOGO", "http://fonu2.us9.list-manage.com/track/click?u=81ff0acc882d8b7fd40aa431f&id=f5219cf408&e=1ffd4cb098", "http://fonu2.us9.list-manage.com/track/click?u=81ff0acc882d8b7fd40aa431f&id=c5070f99da&e=1ffd4cb098", "http://www.prnewswire.com/news-releases/moon-river-studios-announces-production-of-james-brown-documentary-300162521.html"], "published": "2015-10-20T03:00:00.000+03:00", "crawled": "2015-10-20T17:31:26.169+03:00", "highlightTitle": ""}