{"organizations": [], "uuid": "854cea9b77dc7357b67cd92ab7eb3bf16472111d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.courant.com", "main_image": "http://www.trbimg.com/img-5615d987/turbine/hc-pictures-pink-party-west-hartford-2015-20151007", "site_section": "http://www.courant.com/", "section_title": "Hartford Courant: Connecticut breaking news, UConn sports, business, entertainment, weather and traffic - Hartford Courant", "url": "http://www.courant.com/health/breast-cancer/pink-party/hc-pictures-pink-party-west-hartford-2015-20151007-photogallery.html", "country": "US", "title": "Pictures: Pink Party West Hartford 2015", "performance_score": 0, "site": "courant.com", "participants_count": 1, "title_full": "Pictures: Pink Party West Hartford 2015 - Hartford Courant", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T05:00:00.000+03:00", "replies_count": 0, "uuid": "854cea9b77dc7357b67cd92ab7eb3bf16472111d"}, "author": "courant.com", "url": "http://www.courant.com/health/breast-cancer/pink-party/hc-pictures-pink-party-west-hartford-2015-20151007-photogallery.html", "ord_in_thread": 0, "title": "Pictures: Pink Party West Hartford 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Caption Pink Party 2015 Alex Syphers | Special to the Courant Sporting a smile breast cancer survivor Elaine Lindsley, 22, of Bristol, models an athletic outfit during the 4th annual Pink Party held in Blue Back Square, West Hartford, Wednesday evening, Oct. 7, Lindsley has been cancer free since August 31. Hundreds attended the breast-cancer awareness fundraiser for a fun filled night including live entertainment by the Shaded Soul Band and a fashion show by Kimberly Boutique featuring breast-cancer survivors. Giveaways, swag bags, raffle prizes and exclusive food and drink tastings were also offered throughout the evening. A portion of the proceeds will support breast cancer research and local breast cancer programs through Komen Connecticut. Sporting a smile breast cancer survivor Elaine Lindsley, 22, of Bristol, models an athletic outfit during the 4th annual Pink Party held in Blue Back Square, West Hartford, Wednesday evening, Oct. 7, Lindsley has been cancer free since August 31. Hundreds attended the breast-cancer awareness fundraiser for a fun filled night including live entertainment by the Shaded Soul Band and a fashion show by Kimberly Boutique featuring breast-cancer survivors. Giveaways, swag bags, raffle prizes and exclusive food and drink tastings were also offered throughout the evening. A portion of the proceeds will support breast cancer research and local breast cancer programs through Komen Connecticut. (Alex Syphers | Special to the Courant) Pink Party 2015 Alex Syphers | Special to the Courant Lydia Tomarchio, 10, of Newington, signs a pink Scion during the 4th annual Pink Party breast-cancer awareness event held in Blue Back Square, West Hartford, Wednesday evening, Oct. 7. The Scion, provided by Gale Toyota of Enfield, was painted with a rubber paint so guests of the paty could sign congratulations and remembrances to those with breast cancer. Hundreds attended the breast-cancer awareness fundraiser for a fun filled night including live entertainment by the Shaded Soul Band and a fashion show featuring breast-cancer survivors. Giveaways, swag bags, raffle prizes and exclusive food and drink tastings were also offered throughout the evening. A portion of the proceeds will support breast cancer research and local breast cancer programs through Komen Connecticut. Lydia Tomarchio, 10, of Newington, signs a pink Scion during the 4th annual Pink Party breast-cancer awareness event held in Blue Back Square, West Hartford, Wednesday evening, Oct. 7. The Scion, provided by Gale Toyota of Enfield, was painted with a rubber paint so guests of the paty could sign congratulations and remembrances to those with breast cancer. Hundreds attended the breast-cancer awareness fundraiser for a fun filled night including live entertainment by the Shaded Soul Band and a fashion show featuring breast-cancer survivors. Giveaways, swag bags, raffle prizes and exclusive food and drink tastings were also offered throughout the evening. A portion of the proceeds will support breast cancer research and local breast cancer programs through Komen Connecticut. (Alex Syphers | Special to the Courant) See more galleries The fourth annual Pink Party was Wednesday, Oct. 7, in Blue Back Square in West Hartford. Hundreds attended the breast-cancer awareness fundraiser for a fun filled night including live entertainment by the Shaded Soul Band and a fashion show featuring breast-cancer survivors. Giveaways, swag bags, raffle prizes and exclusive food and drink tastings were also offered throughout the evening. A portion of the proceeds will support breast cancer research and local breast cancer programs through Komen Connecticut. Click here to view a video of the event.\nAlex Syphers | Special to the Courant This photo gallery is featured in these articles: Pink Party Fourth Annual Pink Party Held In West Hartford", "external_links": ["http://www.trbimg.com/img-5615d616/turbine/hc-pictures-pink-party-west-hartford-2015-2015-170", "http://www.trbimg.com/img-5615d618/turbine/hc-pictures-pink-party-west-hartford-2015-2015-171", "http://www.trbimg.com/img-5615bffa/turbine/hc-west-hartford-pink-party-1008-20151007"], "published": "2015-10-07T05:00:00.000+03:00", "crawled": "2015-10-08T12:46:36.389+03:00", "highlightTitle": ""}