{"organizations": [], "uuid": "55cc6b37a74792419a3c5734d101e619f8ce9f68", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prbuzz.com", "main_image": "", "site_section": "https://www.prbuzz.com/entertainment.html", "section_title": "Entertainment", "url": "https://www.prbuzz.com/entertainment/353083-anthony-crane-writer-and-producer-of-four-beautiful-women-launches-a-kickstarter-campaign.html", "country": "US", "title": "Anthony Crane, writer and producer of Four Beautiful Women, Launches a Kickstarter Campaign", "performance_score": 0, "site": "prbuzz.com", "participants_count": 1, "title_full": "Anthony Crane, writer and producer of Four Beautiful Women, Launches a Kickstarter Campaign", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "55cc6b37a74792419a3c5734d101e619f8ce9f68"}, "author": "prbuzz.com", "url": "https://www.prbuzz.com/entertainment/353083-anthony-crane-writer-and-producer-of-four-beautiful-women-launches-a-kickstarter-campaign.html", "ord_in_thread": 0, "title": "Anthony Crane, writer and producer of Four Beautiful Women, Launches a Kickstarter Campaign", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Four Beautiful Women is a film by Anthony Crane that explores the effects of ED and sexual paraphernalia on today's diverse relationships through the vehicle of romantic comedy . The film is in the final stages of preproduction and has been scouted, budgeted, cast and rehearsed. Now, the producer has launched a Kickstarter campaign to raise production funds for filming and post-production costs.\nAccording to Crane, \"We've had amazing word of mouth publicity about this witty, sensual romantic comedy that challenges the stereotypes of contemporary relationships today.\" The film will be one of the top-slated independent films released in 2016 and has already generated strong interest among investors and critics. Crane hopes to add a \"sizzle\" reel with the funds raised through the Kickstarter campaign to pay for production trucks, personnel, editing, sound, musical score and formatting the final product to industry standards.\nCrane notes, \"Our main concern is the perfection of the project, with the proper and professional lighting, sound, score, directors and cinematographers to successfully compete. We are determined and steadfast in our pursuit to finish this project in the industrial standards expected by our predecessors to make Four Beautiful Women a box office success.\"\nAs seen at https://www.kickstarter.com/projects/199225354/four-beautiful-women , pledge levels range from $10 to $10,000, with rewards including newsletter updates, copies of the soundtrack and invitations to exclusive wrap parties. For more information on specific pledge levels and associated rewards, see the Kickstarter page.\nAbout Four Beautiful Women:\nFour Beautiful Women is a romantic comedy film by Anthony Crane that explores the issues that arise around ED and sexual paraphernalia. This film has been praised by critics and has received backing from strong investors. Now, the producer has launched a Kickstarter campaign to raise funds for final production and an addition of more material to enhance the quality of the film.\nContact:\nContact Person: Anthony Crane\nCompany: Imanifest Diversity Films Studio\nAddress: Los Angeles, CA, United States\nEmail: This email address is being protected from spambots. You need JavaScript enabled to view it.\nPhone: 818-679-2149\nWebsite: https://www.kickstarter.com/projects/199225354/four-beautiful-women", "external_links": ["https://www.kickstarter.com/projects/199225354/four-beautiful-women"], "published": "2015-10-23T03:00:00.000+03:00", "crawled": "2015-10-23T18:17:50.999+03:00", "highlightTitle": ""}