{"organizations": [], "uuid": "f1f3d9f9755faaa5ceeee4166b8e04f15dff6da2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48524/c", "section_title": "Entertainment - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30227717/youtube-star-joey-graceffa-partners-with-the-ad-council-to-launch-video-in-support-of-love-has-no-labels-campaign", "country": "US", "title": "YouTube Star Joey Graceffa Partners with the Ad Council to Launch Video in Support of Love Has No Labels Campaign", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "YouTube Star Joey Graceffa Partners with the Ad Council to Launch Video in Support of Love Has No Labels Campaign - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "f1f3d9f9755faaa5ceeee4166b8e04f15dff6da2"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30227717/youtube-star-joey-graceffa-partners-with-the-ad-council-to-launch-video-in-support-of-love-has-no-labels-campaign", "ord_in_thread": 0, "title": "YouTube Star Joey Graceffa Partners with the Ad Council to Launch Video in Support of Love Has No Labels Campaign", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " The Ad Council\nGraceffa shares his coming out story for the first time in advance of National Coming Out Day on Sunday, October 11\nNEW YORK , Oct. 9, 2015 /PRNewswire/ -- To coincide with National Coming Out Day on Sunday, October 11 , YouTube Creator Joey Graceffa is releasing an exclusive video today to further the Love Has No Labels message of diversity and inclusion. As part of the Ad Council's Creators for Good program, Graceffa shares for the first time his full coming out story including some of the biases he witnessed and why he felt compelled to hide his true identity.\nThe Ad Council launched Love Has No Labels with a simple message – rethink your bias. Within days, the message was shared by influencers from the First Lady to George Takei , and viewers around the world shared the video with their own personal experiences with bias. Implicit bias refers to the way people unconsciously, and sometimes unwillingly, exhibit bias towards other individuals and groups. It creates negative stereotypes and manifests in small and large ways – from social exclusion to hiring bias. Yet the vast majority of Americans consider themselves to be unprejudiced. Love Has No Labels was designed to encourage all Americans to examine their implicit biases in order to promote further acceptance of all communities regardless of race, religion, gender, sexuality, age and ability.\nGraceffa, a 24-year-old YouTube star with a channel that reaches over 5.2 million subscribers, has lent his voice to this campaign to help promote the campaign message that \"before anything else, we're all human\" through this video and his social media platforms. He is part of the Ad Council's Creators for Good program, which launched in April and aims to partner with YouTube Creators on developing original content to further the Ad Council's campaigns and move the needle on social causes.\n\"Now that I've come out to my audience, I want to use my platform to help those struggling to come to terms with their sexuality or other aspects of their lives,\" said Graceffa. \"I realized how much other people's beliefs had held me back, and I want to let my audiences know that it's okay to be who we are and embrace each other's differences.\"\nSince Love Has No Labels debuted on Upworthy, the campaign and video have gained significant attention, receiving recognition at the Cannes Lions Festival and Clio Awards. The online video, created pro bono by R/GA has been viewed over 150 million times, shared 2.6 million times and liked 1.8 million times. It is the second most viewed community and activism of all time, the best performing Upworthy video of all time and the most viewed brand video campaign of 2015 to date.\nCampaign assets direct audiences to visit www.lovehasnolabels.com where they can take a quiz to examine and overcome their own biases, find tips to help them challenge bias in themselves and others and use the \"Faces of Love\" tool to take a picture with campaign branding and join the campaign.\nThe Ad Council\nThe Ad Council is a private, non-profit organization with a rich history of marshaling volunteer talent from the advertising and media industries to deliver critical messages to the American public. Having produced literally thousands of PSA campaigns addressing the most pressing issues of the day, the Ad Council has affected, and continues to affect, tremendous positive change by raising awareness, inspiring action and saving lives. To learn more about the Ad Council and its campaigns, visit www.adcouncil.org , like us on Facebook , follow us on Twitter or view our PSAs on YouTube .\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/youtube-star-joey-graceffa-partners-with-the-ad-council-to-launch-video-in-support-of-love-has-no-labels-campaign-300157457.html\n ", "external_links": ["http://twitter.com/adcouncil", "http://www.prnewswire.com/news-releases/youtube-star-joey-graceffa-partners-with-the-ad-council-to-launch-video-in-support-of-love-has-no-labels-campaign-300157457.html", "http://www.adcouncil.org/", "http://www.xmlnews.org/ns/", "http://www.youtube.com/adcouncil", "https://www.facebook.com/adcouncil", "http://rt.prnewswire.com/rt.gif?NewsItemId=NY24585&Transmission_Id=201510091628PR_NEWS_USPR_____NY24585&DateId=20151009", "http://www.lovehasnolabels.com/", "http://www.youtube.com/watch?v=PnDgZuGIhHs", "http://www.youtube.com/watch?v=BW3GXDZVA7g"], "published": "2015-10-09T03:00:00.000+03:00", "crawled": "2015-10-10T01:18:03.336+03:00", "highlightTitle": ""}