{"organizations": [], "uuid": "459225394e9f3e9bfeb7b92f197b71e6cefcd68b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailyherald.com", "main_image": "http://www.dailyherald.com/storyimage/DA/20151013/ENTLIFE/151019681/AR/0/AR-151019681.jpg&amp;updated=201510130640&amp;imageversion=Facebook&amp;exactH=630&amp;exactW=1200&amp;exactfit=crop&amp;noborder", "site_section": "http://www.dailyherald.com/rss/feed/?feed=entlife", "section_title": "DailyHerald.com &gt; Life &amp; Entertainment", "url": "http://www.dailyherald.com/article/20151013/entlife/151019681/", "country": "US", "title": "On Cooking: Refresher courses on weeknight meals, holiday entertaining", "performance_score": 0, "site": "dailyherald.com", "participants_count": 1, "title_full": "On Cooking: Refresher courses on weeknight meals, holiday entertaining - DailyHerald.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T14:40:00.000+03:00", "replies_count": 0, "uuid": "459225394e9f3e9bfeb7b92f197b71e6cefcd68b"}, "author": "Susan Stark", "url": "http://www.dailyherald.com/article/20151013/entlife/151019681/", "ord_in_thread": 0, "title": "On Cooking: Refresher courses on weeknight meals, holiday entertaining", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "If you're feeling like your holiday cooking or entertainment routine needs a reboot, Prisco's Fine Foods in Aurora is offering its most popular cooking classes this fall.\nYou'll have to be on the ball to get to the first class in the series as it's at 6:30 p.m. Wednesday, Oct. 14. Meals in Minutes will be held in the cafe section of the store, 1108 Prairie St., Aurora. There are spaces available.\nWhile that might be cutting it close, the next up is Cocktail Party at 6:30 p.m. Nov. 13.\nTeaching the fall series of classes is Phyllis Kramer of Aurora, Prisco's longtime culinary instructor and a Butterball Turkey Helpline adviser. Maybe she'll share some of the calls she's received over the years helping holiday cooks prepare a healthy, tasty turkey.\nIn Meals in Minutes, Kramer will offer tips on how to get a delicious meal on the table in 30 minutes or less.\nShe'll demonstrate how each recipe and technique can be used to make two completely different meals from one recipe. Kramer will prepare beef, chicken, pork and seafood meals. There will be samples of Prisco's General Manager Andy Guzauskas' favorite wines and beers to complement the dishes.\nDuring Cocktail Party on Nov. 13, Kramer will explore easy ways to prepare food in advance, how to comfortably entertain guests with special dietary needs and how to balance a menu using chicken, seafood, beef, pork, cheese and vegetables. If much of a meal can be done ahead, then as the host you might actually get to enjoy your own party.\nShe will give tips on how to garnish party platters and how to create a beautiful holiday centerpiece. Plus, she will introduce her annual savory Holiday Cupcake.\nKramer will also teach how to impress with traditional concepts such as cheese fondue. Wine and cheese pairings and plenty of tastings are planned.\nThe classes, each about two hours, are open to everyone and cost $45. To register or for information, call (630) 264-9400.\nHalloween-themed brunch: The Hilton's Oak Brook Hills Resort & Conference Center will host a family Pumpkins & Pancakes event from 11 a.m. to 3 p.m. Saturday, Oct. 31. Families are encouraged to slip into their costumes early for a spookalicious feast and a variety of fun-filled Halloween activities. Brunch will be served in Windows, the resort's signature restaurant, with pumpkin decorating, games, a caramel apple station, trick-or-treating and more that will spill out on the grounds. Some of the ghoulish goodies on the buffet include pumpkin and chocolate chip pancakes, pork sausage mummies, eyeball eggs, jack-o'-lantern sliders, gummy worm fruit salad and more. The resort is at 3500 Midwest Road, Oak Brook. This special brunch costs $20; $10 for children 12 and younger and free for children 2 and younger. To reserve a spot or find out more about the menu and activities, visit www.oakbrookhillsresort.com or call (630) 264-9400. National Chocolate Day is Oct. 28: As a fan, I'm not surprised there's a day set aside to pay homage to that most delectable, dreamy ambrosia. The only question is how big a deal you want to make of it. If you want to go all-out, Chef Alain Roby of the All Chocolate Kitchen in Geneva is planning a lavish tribute this year by offering a $3,000, gold-plated chocolate truffle made of the finest Grand Cru Creole chocolate. The basketball-sized truffle will be presented with blown sugar adornments and served with two glasses of Dom Pérignon champagne in crystal glasses. Order ahead by visiting the All Chocolate Kitchen store, 33 S. Third St., Geneva, or call (630) 232-2395.\n• Contact Food Editor Susan Stark at sstark@dailyherald.com or (847) 427-4586. Be her friend on Facebook.com/SusanStarkDailyherald or follow her on Twitter.\n Life & Entertainment Food Stark, Susan", "external_links": ["https://twitter.com/share"], "published": "2015-10-13T14:40:00.000+03:00", "crawled": "2015-10-13T17:03:10.320+03:00", "highlightTitle": ""}