{"organizations": [], "uuid": "25e43abe6588c9ef7443db1799a6defda9cc2e68", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.philly.com", "main_image": "http://media.philly.com/images/EgoPo800.jpg", "site_section": "http://www.philly.com/philly_entertainment.rss", "section_title": "Philly.com Entertainment", "url": "http://www.philly.com/philly/entertainment/20151020_EgoPo_exlores_Hellman_s_dark__The_Children_s_Hour_.html", "country": "US", "title": "EgoPo explores Hellman's dark 'The Children's Hour'", "performance_score": 0, "site": "philly.com", "participants_count": 0, "title_full": "EgoPo explores Hellman's dark 'The Children's Hour'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T23:09:00.000+03:00", "replies_count": 0, "uuid": "25e43abe6588c9ef7443db1799a6defda9cc2e68"}, "author": "", "url": "http://www.philly.com/philly/entertainment/20151020_EgoPo_exlores_Hellman_s_dark__The_Children_s_Hour_.html", "ord_in_thread": 0, "title": "EgoPo explores Hellman's dark 'The Children's Hour'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hellman", "Stephan Salisbury"], "text": "Stephan Salisbury, Inquirer Staff Writer Posted: Tuesday, October 20, 2015, 3:01 AM \nWhen EgoPo Classic Theater was putting together last year's American Giants Festival, a season comprising three iconic playwrights, artistic director Lane Savadove was acutely aware that something was missing. \n\"We were very conscious of it being a very male, very white season,\" he said. \"I wanted a counterpart.\" Thus, American Giants II: The Women, which opened with Lillian Hellman's classic The Children's Hour , running through Sunday. \nAdrienne Mackey, 33, one of the region's most inventive young theater artists and founder of Swim Pony Performing Arts, is guest director. \nHellman's play, a dark tragedy turning on a child's false accusations of lesbianism, was scandalous on its Broadway opening in 1934, when onstage mention of homosexuality was illegal in New York. It was a smash, the rule was not enforced, and it ran for more than two years. More coverage Review: 'Shipwrecked!' wondrously tells tall tales \nSavadove, 48, sees the play as an echo of EgoPo's last-season tragedy, Arthur Miller's The Death of a Salesman . The two other plays in American Giants II - Clare Boothe Luce's 1936 The Women (opening in March) and Sophie Treadwell's 1928 Machinal (April) - are perhaps less familiar to today's theatergoers. \nSavadove notes that the works by Hellman, Luce, and Treadwell were all written during the 1920s and '30s and that each in its way is \"taking on the American dream.\" It was, he said, a time when America felt a \"need to reinvent itself, redefine itself, a need to find a way.\" \nLast season's works by Arthur Miller, Tennessee Williams, and Eugene O'Neill grew from the same impulses and the same period. Yet few now know the theatrical work of Luce and Treadwell, and Hellman is increasingly viewed as dated. \n\"They were a huge part of American theater, but really have been consciously left out of the canon,\" Savadove said. \"Women were simply not let in.\" \nEgoPo and Savadove knew they wanted to bring in a director to bring out The Children's Hour 's portrait of a broken and dangerous society. \"We knew Adrienne was one of the directors in the city who brings a strong director's vision,\" he said. \nFor Mackey, who rarely works outside her own expansive and nontraditional performing group, directing Hellman offered an opportunity to handle a scripted work right out of the theatrical canon. \n\"Last year, when I was doing a lot of writing . . . one thing I was concerned about was the visibility of women playwrights,\" she said. \"That's an issue that is important to me personally. And it's just been a long time since I've done a regular play.\" \nAnd it is, she said, \"such a strange play. The characters are really complicated, and it's a very female-dominated space.\" \nThe play focuses on Karen and Martha, headmistresses of a girls' boarding school, who are falsely accused of having a lesbian relationship by one of their young charges, Mary. The result is social ostracism, the destruction of their school, and suicide. \n\"At least to me, it felt like their journey through the play included the fact that they were women, but it didn't become about them being weak or incapable or unable to act because of their gender,\" Mackey said. There is none of the \"victim helplessness\" that brings down many a play, even in the canon, and Mackey became interested in exploring what these people at this particular time revealed about the state of being human. \n\"Actually,\" she said, \"all of the women in the play . . . they're all really just fighting to do their best in a very clear and direct way.\" \nIn fact, Mary, the girl whose lies lead to disaster, is as close to a sociopath as you can get. The character put Mackey in mind of the confusion and anxiety that often shadow adolescence. \n\"I thought of myself as a teenager, and I thought, 'God, teenage girls!' There's this crazy time in your life where you're just negotiating your ability to be an adult, and your actions have a lot more consequences than you emotionally realize.\" \nWhen she was 12, Mackey told Savadove, she went to a ball game with her father and slyly tossed peanuts down on fans sitting below. Unfortunately, they didn't find it amusing, and one stormed up, threatening to punch out her startled dad. \n\"I remember feeling just so ashamed,\" she said. \"Intellectually, I understood what I was doing, but it wasn't until the aftereffect of emotional consequence that I thought, 'Why did I do that? I'm a monster.' I felt so bad.\" \nIt is that imperfect understanding of self and the world that Mackey explores in The Children's Hour : A girl's accusation sets her world ablaze. \"The landscape of Mary's emotional state becomes the landscape of the play,\" Savadove said. \"It's in the very fabric of the play, where the landscape is rumbling with anger.\" \nMackey notes that many readings of the play portray Mary as a \"bad seed.\" That is not the case here, although the manipulative Mary evinces no empathy. \n\"She's just trying to get some space and figure some things out, and what it does is it unlocks this darker place in the whole world around the school,\" Mackey said. \"It's not that she's malicious. It's more that the darkness and bias in the society is unleashed.\" \nThis is not, Mackey said, a \"beautiful tragedy\" like Romeo and Julie t; it is hard, redolent of anger and judgment, offering little redemption. \nIn the face of that and past readings of the play, Mackey threw down a challenge to her cast: \"I want the audience to walk away and never feel that any one person in this story is doing something with malicious intent. . . . How honest, how genuine, how real can we make this?\"", "external_links": [], "published": "2015-10-20T23:09:00.000+03:00", "crawled": "2015-10-20T23:30:04.932+03:00", "highlightTitle": ""}