{"organizations": [], "uuid": "ca926b4c0f6b78c07adfd55a092e5a4fdef92baf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-562640ea/turbine/ct-bears-fox-clock-management-rosenbloom-20151020", "site_section": "http://www.chicagotribune.com/", "section_title": "Chicago Tribune: Chicago breaking news, sports, business, entertainment, weather and traffic - Chicago Tribune", "url": "http://www.chicagotribune.com/sports/rosenblog/ct-bears-fox-clock-management-rosenbloom-20151020-column.html", "country": "US", "title": "The more John Fox talks, the less his game management makes sense", "performance_score": 0, "site": "chicagotribune.com", "participants_count": 1, "title_full": "The more John Fox talks, the less his game management makes sense - Chicago Tribune", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T16:25:00.000+03:00", "replies_count": 0, "uuid": "ca926b4c0f6b78c07adfd55a092e5a4fdef92baf"}, "author": "Steve Rosenbloom", "url": "http://www.chicagotribune.com/sports/rosenblog/ct-bears-fox-clock-management-rosenbloom-20151020-column.html", "ord_in_thread": 0, "title": "The more John Fox talks, the less his game management makes sense", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Each week, Bears fans and the media learn more things about head coach John Fox.\nLike, say, he gets prickly when second-guessed about his clock management and play-calling decisions.\nHere’s a solution, John: Stop mismanaging the clock and making bad play-calls.\nSee? All better.\nHere’s something else, John: Bears fans and the media can get prickly, too.\nLike, say, when they see the coach cost the team a chance to win Sunday’s game against a bunch of stiffs in regulation.\nThe Bears held a 31-27 lead in Detroit, but the Lions were at the Bears' 6 in the last two minutes. Fox chose not to use his three timeouts. He also chose to take the 10-second runoff that accompanied Matthew Stafford’s intentional grounding penalty.\nThe Lions scored on a TD to Calvin Johnson, natch, and Fox’s team had just 21 seconds left to make something happen instead of another 30 seconds or so if Fox had managed the game better.\nPhotos from the Bears' Week 6 game in Detroit.\n“As it worked out, we had enough time to go down and tie the game,’’ Fox said Sunday.\nFox tried to justify his clock management by pointing to the speed with which his offense covered the turf necessary to get Robbie Gould in field-goal range to tie the game.\nTo tie the game.\nNothing about winning it.\nFox’s Bears were forced to kick that field goal because they only had four seconds left. What a waste of first-and-10 at the Lions 11.\nAnother 30 seconds, and Fox’s team had a chance to take shots at the end zone to win the game. Isn’t that the point?\nHerm Edwards told us you play to win the game. Hel-LO!\nFox said Monday he wanted to remind everybody that the Lions are “a pretty good offensive football team,’’ and I can see that as another reason to use your timeouts and give your team more time to do something.\nThose sequences followed Fox’s decision to call three straight running plays with 2:42 remaining when a first down would’ve ended things, and hey, look at that Alshon Jeffery jump.\nBrad Biggs and Rich Campbell on the Bears' OT loss to the Lions Brad Biggs and Rich Campbell on the Bears' OT loss to the Lions. Brad Biggs and Rich Campbell on the Bears' OT loss to the Lions. See more videos “It’s all my call, just so we’re clear on that,’’ Fox said, and we’re clear on a lot of things, such as the Bears coach being too conservative to try to beat a team that every other opponent had beaten.\nHoping the clock runs out doesn’t sound like much of a plan.\nBanking on a defense to make plays even though it didn’t really do that most of the afternoon isn’t a particularly strong plan, either.\nClock management is not a criticism new to Fox. Same goes for conservative decisions. They have been part of the Fox profile for years.\nAlso part of the Fox profile is quick improvement, as evidenced by Bears comeback wins the two previous weeks.\nBut Fox's clunky clock management and subsequent justification of his thinking usher you to the side of the discussion that argues Fox is great on every day except game day.\nEach week, we learn more things about Fox. This is not the goofy and disastrous Marc Trestman experience. More like rouge derriere and game management issues of Lovie Smith.\n John Fox Chicago Bears Detroit Lions Lovie Smith Calvin Johnson Matthew Stafford", "external_links": ["http://www.trbimg.com/img-562595b2/turbine/ct-brad-biggs-and-rich-campbell-on-t-20151019", "http://www.trbimg.com/img-562640ea/turbine/ct-bears-fox-clock-management-rosenbloom-20151020", "http://www.trbimg.com/img-56250c6d/turbine/ct-week-6-photos-bears-at-lions-20151018"], "published": "2015-10-20T16:25:00.000+03:00", "crawled": "2015-10-20T17:56:22.835+03:00", "highlightTitle": ""}