{"organizations": [], "uuid": "eab552bd96f10f081bb41256285efa988ab03d3e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "", "site_section": "http://bostonherald.com/entertainment/lifestyle", "section_title": "Entertainment: Lifestyle | Boston Herald", "url": "http://bostonherald.com/entertainment/lifestyle/2015/10/requests_to_connect_romantically_creep_into_linkedin", "country": "US", "title": "Requests to connect romantically creep into LinkedIn", "performance_score": 0, "site": "bostonherald.com", "participants_count": 1, "title_full": "Requests to connect romantically creep into LinkedIn | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T03:00:00.000+03:00", "replies_count": 0, "uuid": "eab552bd96f10f081bb41256285efa988ab03d3e"}, "author": "Alison Bowen , Chicago Tribune", "url": "http://bostonherald.com/entertainment/lifestyle/2015/10/requests_to_connect_romantically_creep_into_linkedin", "ord_in_thread": 0, "title": "Requests to connect romantically creep into LinkedIn", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "When an email arrives from LinkedIn, it’s usually a reminder to check a connection’s new photo or update your profile.\nBut sometimes what lands in the inbox are flattering flirtations from strangers, vague messages suggesting a drink or clear come-ons.\nMany people say Linked­In plays a role in the dating game, sometimes to scope out potential suitors or a profile picture. But others­ report approaches in ways they deemed creepy, all through the professional networking site.\nCanadian Tara Prud­homme was uneasy and surprised when a recent contact sent her a long missive requesting a romantic connection.\n“I wasn’t expecting it,” she said. “That kind of gave me the creepy feeling.”\nShe wasn’t the only one to report nonbusiness — and, at times, even unsettling — inquiries through people using the site as a dating hub.\nOne 31-year-old attorney recalled being asked to “connect” by a man who said he was interested in becoming a prosecutor. Business-­related talk soon gave way to questions about when she would be in his town. Another woman, a 31-year-old New Yorker, was confused when a former co-worker added her on LinkedIn, leading to weeks of emails and eventually a coffee meet up. Years later, she is still not sure if it was more than a work thing; their conversation didn’t stick to work, but they didn’t meet up again. (Both women asked to remain anonymous.)\nStill, others contend that LinkedIn can serve as one item in a toolbox for searching online ahead of dates. For example, finding out whether­ those who proclaim themselves successful business owners actually own one, or simply confirming whether people are employed.\nEven a recent New York Times wedding announcement gives a nod to the site: After forgetting to nab his future wife’s phone number when they met at a restaurant, the groom tracked her down through LinkedIn.\nLinkedIn profiles contain a thorough, tidy collection of a person’s life accomplishments, something that can also be a rich mine of data for strangers to sift through.\nOne app sprang up using the site. BeLinked, previously known as LinkedUp, targets career-minded singles and operates by importing users’ LinkedIn data, then making matches.\nFounder Max Fischer told Tribune Newspapers last year that he launched BeLinked after angling to score dates himself. “I noticed that my friends and myself would subtly begin conversations with interesting people through Linked­In,” he said. He also noted the popularity of the site’s “Who’s Viewed Your Profile” feature.\nFor better or worse, LinkedIn can function as an avenue when others aren’t available; even those who have strict privacy settings on Facebook or a partial name on Twitter may post a full resume and photo on LinkedIn to attract future job opportunities.\nWomen seem to be approached more often with nonbusiness messages, which was noted in a recent conversation on Twitter when a London lawyer publicized a message a man sent her about her profile photo.\nEric Martin, a vice president of marketing in Atlanta, recently wrote a post titled “Guys: Stop Hitting on Women on LinkedIn.”\nMartin recounted stories of unwanted contacts to women he knows, including a 19-year-old intern at his company as well as his wife, who received a message that said in part, “I just could not help myself to say hi because your beauty is captivating.”\nA LinkedIn spokesman, Doug Madey, noted in a statement the “large number of granular settings that give our members control over what’s visible to their connections, their broader network and others.”\n“If a LinkedIn member believes they are being contacted in an inappropriate manner, we suggest they report the message as spam, just as they would if the message came via email,” Madey wrote.\nDating coach Evan Marc Katz, whose clients nearly all date online, said he does not recommend reaching out to potential flames through LinkedIn.\n“It’s a business networking site, not a dating site, and I would think most people would make a very clear distinction between the two,” he said.\nKatz added, “It seems tone-deaf and inappropriate, as if the HR director asked you out while you were interviewing at the company. Even if you find each other attractive, is this really the forum for it?”\nPlus, the many sites just for dating — or even, he noted­, social networking — provide plenty of places to flirt.\n“LinkedIn? Not so much,” Katz said.\nOne thing to consider before hitting that “connect” button, if you’re hoping for the romantic kind: whether it’ll be appreciated in the recipient’s inbox.\n“I haven’t replied,” Prudhomme said of the overture she received. “I’m just going to block the guy.”", "external_links": [], "published": "2015-10-11T03:00:00.000+03:00", "crawled": "2015-10-11T15:09:13.857+03:00", "highlightTitle": ""}