{"organizations": [], "uuid": "b5d6b3c60d110ba2ac4dc316c2424d2720f5255b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.neagle.com", "main_image": "http://www.neagle.com/storyimage/PW/20151008/NEWS/151009871/AR/0/AR-151009871.jpg", "site_section": "http://www.neagle.com/entertainment?template=rss&mime=xml", "section_title": "Entertainment - News Eagle - Hawley, PA", "url": "http://www.neagle.com/article/20151008/NEWS/151009871/2052/ENTERTAINMENT?rssfeed=true", "country": "US", "title": "Tom Hanks dug deep to find his ‘Bridge of Spies’ character", "performance_score": 0, "site": "neagle.com", "participants_count": 1, "title_full": "Tom Hanks dug deep to find his ‘Bridge of Spies’ character", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T18:08:00.000+03:00", "replies_count": 0, "uuid": "b5d6b3c60d110ba2ac4dc316c2424d2720f5255b"}, "author": "Ed Symkus More Content Now", "url": "http://www.neagle.com/article/20151008/NEWS/151009871/2052/ENTERTAINMENT?rssfeed=true", "ord_in_thread": 0, "title": "Tom Hanks dug deep to find his ‘Bridge of Spies’ character", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted Oct. 8, 2015 at 10:08 AM Updated Oct 8, 2015 at 10:08 AM By Ed SymkusMore Content Now Posted Oct. 8, 2015 at 10:08 AM Try thinking of a film in which Tom Hanks isn’t the good guy. Without doing a detailed Internet search, the only characters I can come up with are the murderous Irish author in “Cloud Atlas” and the hitman in “Road to Perdition.” Otherwise, Hanks has made his career out of playing well-intentioned men both in comedies and in films where the odds are stacked against him. There’s no departure in “Bridge of Spies,” the true story of a spy swap between Russia and the United States during the height of the Cold War. Hanks plays James Donovan, an insurance lawyer who, because of his dedication to his craft, was asked by the government to defend Rudolf Abel, a man accused of being a Russian spy but still entitled to counsel and to a fair trial. This caused a boatload of problems for Donovan and his family courtesy of various “American patriots” who labeled him a traitor. Donovan subsequently became a driving force in the situation of Russian spy Abel and American spy Francis Gary Powers being made two pawns in a political game. Hanks spoke in New York last week about researching the role, finding the heart of his character, and working with dialogue provided by the Coen brothers. Q: James Donovan must have been fascinating to play. Did you know much about him when you signed on? A: I knew nothing about the man, and I was fueled by absolutely no preconceived knowledge of him. When you come across this guy, who is an awfully good insurance lawyer, who then ends up being part of such a momentous six days of history ... well, I’m a selfish actor. I’ll lunge at that opportunity. Q: What was your method of getting into his head? A: Immediately after reading the screenplay I Googled the guy. There was an awful lot, and I came across a piece on YouTube in which the real Donovan, when he was defending Rudolf Abel, was interviewed at the courthouse. He stated the reason he took the case, and why he carried it to the extremes of the Supreme Court. He said, “You can’t accuse this man of treason. He’s not a traitor; he’s actually a patriot to his cause. Only an American can be a traitor. Only an American can commit treason against their own country. He’s just a man, doing his job.” Donovan also wrote a lot about his own life. As a matter of fact, he wrote a book about his experience with Abel that goes so in depth into the trial, I felt like I was a court stenographer after a while; it just goes on and on (laughs). So you look for some degree of superstructure of who it is, and outside the fact that he’s got a smokin’ hot wife (played in the film by Amy Ryan), you look for something in the past. [Before all of this] he was an associate prosecutor of the Nuremberg trials. That means he wasn’t the type of soldier that wanted to go off and KILL as many Nazis as possible. He was a guy that wanted to NAIL as many Nazis as possible, using the letter of the law. Page 2 of 2 - Q: The Coen brothers did a lot of work on the original Matt Charman script. How did their contributions affect your acting? A: This is the second time I’ve been in a film the Coens had done (he starred in their remake of “The Ladykillers”). Their dialogue is different than other motion picture dialogue in which there’s mostly text as opposed to subtext. A lot of times you read screenplays in which one specific thing is happening in a scene [with two characters], and both characters sound the same after a while. They just lock into the antagonist/protagonist thing, and that just never happens with them. It seems as though somebody is rocking back on their heels in a Coen brothers scene, while another person is making arguments that you can’t even begin to imagine. I must say it’s pretty cool when you get to wrap your heads around that. “Bridge of Spies” opens on Oct. 16. Ed Symkus covers movies for More Content Now. By Ed Symkus", "external_links": [], "published": "2015-10-08T18:08:00.000+03:00", "crawled": "2015-10-09T08:55:41.275+03:00", "highlightTitle": ""}