{"organizations": ["Star Wars"], "uuid": "b7c996956adf064cd9008f27b58165f75e72636d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reviewjournal.com", "main_image": "http://www.reviewjournal.com/sites/default/files/field/media/starwars.JPG", "site_section": "http://www.reviewjournal.com/taxonomy/term/34/feed", "section_title": "Entertainment", "url": "http://www.reviewjournal.com/trending/star-wars-fans-take-over-boycott-hashtag-after-few-say-film-anti-white", "country": "US", "title": "Star Wars fans take over boycott hashtag after few say film is 'anti-white'", "performance_score": 0, "site": "reviewjournal.com", "participants_count": 0, "title_full": "Star Wars fans take over boycott hashtag after few say film is 'anti-white'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T23:14:00.000+03:00", "replies_count": 0, "uuid": "b7c996956adf064cd9008f27b58165f75e72636d"}, "author": "", "url": "http://www.reviewjournal.com/trending/star-wars-fans-take-over-boycott-hashtag-after-few-say-film-anti-white", "ord_in_thread": 0, "title": "Star Wars fans take over boycott hashtag after few say film is 'anti-white'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Star Wars fans take over boycott hashtag after few say film is 'anti-white' Star Wars fans take over boycott hashtag after few say film is 'anti-white' NDN-VIDEO-40118601824.mov Star Wars fans take over boycott hashtag after few say film is 'anti-white' \nJohn Boyega and Daisy Ridley (Star Wars/YouTube) Related links By Chris Kudialisreviewjournal.com \nThe trailer for \"Star Wars: The Force Awakens\" premiered last night, along with an unexpected Twitter reaction from some claiming the film is \"anti-white propaganda.\" Fans of the series fought back as the #BoycottStarWarsVII hashtag appeared to be trending. \nThe hashtag protests the fact that none of the protagonists are white males, USA Today reported , although other sources say the hashtag was created just to rile people up . Daisy Ridley is a woman, John Boyega is black and Oscar Isaac is Guatemalan-American. \nPrevious \"Star Wars\" films have featured African-American actors Billy Dee Williams (Lando Calrissian), Samuel L. Jackson (Mace Windu) and James Earl Jones (voicing Darth Vader). \"#BoycottStarWarsVII because it is anti-white propaganda promoting #whitegenocide,\" Twitter user @genophilia wrote. \"#BoycottStarWarsVII becuase it's nothing more than a social justice propaganda piece that alienates it's core audience of young white males,\" user @officialCritDis said. The protest was, for the most part, shut down by Tuesday , as hundreds of Twitter users revolted against the hashtag, calling it \"racist.\" Whether the hashtag was started as a prank, some claimed on Twitter on Tuesday they were offended anyway. \"Let's be clear: The backlash against #BoycottStarWarsVII is what is causing it to trend,\" Twitter user @Tor_H wrote. Comment section guidelines The below comment section contains thoughts and opinions from users that in no way represent the views of the Las Vegas Review-Journal or GateHouse Media. This public platform is intended to provide a forum for users of reviewjournal.com to share ideas, express thoughtful opinions and carry the conversation beyond the article. Users must follow the guidelines under our Commenting Policy and are encouraged to use the moderation tools to help maintain civility and keep discussions on topic.", "external_links": [], "published": "2015-10-20T23:14:00.000+03:00", "crawled": "2015-10-21T00:24:12.465+03:00", "highlightTitle": ""}