{"organizations": [], "uuid": "25c92c9540f226a71886fa921f31ec440b6358c4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.vancouversun.com", "main_image": "http://www.vancouversun.com/cms/binary/11432309.jpg", "site_section": "http://rss.canada.com/get/?F6962", "section_title": "Vancouver Sun - Entertainment / Arts", "url": "http://www.vancouversun.com/entertainment/margo+kane+force+nature/11432308/story.html", "country": "CA", "title": "Margo Kane is a force of nature", "performance_score": 0, "site": "vancouversun.com", "participants_count": 0, "title_full": "Margo Kane is a force of nature", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T02:31:00.000+03:00", "replies_count": 0, "uuid": "25c92c9540f226a71886fa921f31ec440b6358c4"}, "author": "", "url": "http://www.vancouversun.com/entertainment/margo+kane+force+nature/11432308/story.html", "ord_in_thread": 0, "title": "Margo Kane is a force of nature", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["David Cooper", "Margo Kane", "Kevin Loring"], "text": "Margo Kane is a force of nature Her razor sharp comic timing perfect for Gateway Theatre’s season opener Margo Kane (lett) and Kevin Loring are compulsively charming as mother and son in For the Pleasure of Seeing Her Again, which runs until Oct. 24 at the Gateway Theatre. Photo courtesy of David Cooper. Photograph by: David Cooper \nFor the Pleasure of Seeing Her Again \nUntil Oct. 24 | Gateway Theatre \nTickets & Info: gatewaytheatre.com \nThe Gateway Theatre season opener is a charming remount of the 2014 Talking Stick Festival production of For the Pleasure of Seeing Her Again, featuring the compulsively talented Margo Kane and Kevin Loring. \nThe script, by beloved French Canadian playwright Michel Tremblay, begins with an unnamed narrator explaining the kind of things the audience will not see during the performance, running through a list of famous theatre tropes that draw on everything from Shakespeare to Oscar Wilde to Anton Chekhov. \nWhat he’s saying is that the themes of the play are not part of the sanctioned canon and they don’t, on the surface anyway, draw on epic or romantic narratives. Instead, the focus is on a mother and a son. The mother is, like so many of Tremblay’s female characters, a working class woman struggling to raise a family on limited means. \nIn the 90 minutes of the play, the narrator grows from a 10-year-old boy to a young man through a series of vignettes around that mother-son relationship. As they banter about the French Revolution and pulp novels, it becomes clear that the son’s creative juice comes from the woman who spent most of her time ironing clothes. \nAs Nana, Kane is a force of nature. But it would be a mistake to see the character as merely a big personality. In even her wildest stories, there’s a kind of raw intelligence and wisdom, a knowledge of the world that can only be wrung from a life of hard work and care. Nana is a working class woman who has maybe seen more than she is willing to let on, more than her eye-rolling son could ever imagine, but rather than let it drag her under, she approaches the world with humour and curiosity. \nKane plays all those qualities with nuance and charm. She embodies her character’s whimsical, romantic side as well as her world weary side and does it all with razor sharp comic timing. \nFor the most part, Loring as the narrator just gets out of her way, allowing her the spotlight. His growth into adulthood appears mostly in his posture and facial expressions. Otherwise, he plays the straight man for Nana, letting her get all the best punchlines. And in that deference there’s a tenderness that sneaks up, turning the final scene into a guaranteed tear-jerker. \nThe action is largely set in a worn kitchen space with walls that are clean but cracked. Pam Johnson’s set feels a bit sparse but it holds a few surprises. \nThat Kane and Loring are First Nations offers beautiful depth and texture to the discussion of Nana’s Cree heritage. This production is yet another piece of evidence that performers of colour need not be relegated to roles that are specifically written for them as is so often the case. \nIn the handbill to the show, Gateway artistic director Jovanni Sy makes a stirring call for increased diversity on Canadian stages, pointing out that the vast majority of productions in the Lower Mainland feature men behind the scenes and Caucasian people on the stage. \nTremblay’s work broke ground by bringing working class characters and language to the stage. It’s kind of beautiful that his work is now being used to break yet another barrier — that which keeps actors of colour on the sidelines of mainstream theatre.", "external_links": [], "published": "2015-10-13T02:31:00.000+03:00", "crawled": "2015-10-13T13:01:56.289+03:00", "highlightTitle": ""}