{"organizations": [], "uuid": "79607f93faaeac882e85c4ae196b2a5cca6ebf94", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbsnews.com", "main_image": "http://cbsnews1.cbsistatic.com/hub/i/r/2015/10/02/9af5d85e-b8c4-406c-bd9c-b29d26aaa6f5/thumbnail/620x350/96417a8cc8adc97c0518ea5a18f23fea/utahmurder.jpg", "site_section": "http://www.cbsnews.com/", "section_title": "CBS News - Breaking News, U.S., World, Business, Entertainment &amp; Video ", "url": "http://www.cbsnews.com/news/triple-murder-suspect-allegedly-said-mom-made-me-do-it/", "country": "US", "title": "Alexander Hung Tran, Utah triple murder suspect, said mom \"made me do it,\" cops allege", "performance_score": 0, "site": "cbsnews.com", "participants_count": 1, "title_full": "Alexander Hung Tran, Utah triple murder suspect, said mom \"made me do it,\" cops allege - CBS News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T20:33:00.000+03:00", "replies_count": 0, "uuid": "79607f93faaeac882e85c4ae196b2a5cca6ebf94"}, "author": "Crimesider Staff CBS News", "url": "http://www.cbsnews.com/news/triple-murder-suspect-allegedly-said-mom-made-me-do-it/", "ord_in_thread": 0, "title": "Alexander Hung Tran, Utah triple murder suspect, said mom \"made me do it,\" cops allege", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SALT LAKE CITY -- Utah triple murder suspect Alexander Hung Tran allegedly pointed a finger at his mother for the brutal killings, reports CBS affiliate KUTV .\n\"He made certain statements to them (detectives) about trying to blame his mother,\" Salt Lake County DA Sim Gill said on Thursday, according to the station, after Tran was charged with aggravated murder in the shooting deaths of three people inside a Salt Lake City home.\nA probable cause statement included in the charging document said Tran was found in the basement of a house early in the afternoon of Sept. 18, soon after police discovered the bodies upstairs.\nThe detective who penned the statement wrote that Tran told police, \"I'm putting down the gun,\" according to the station.\nThen, it's alleged, he made a strange request to officers: \"If I think this is my mom's fault and that she should be here instead, is there anything I can do? She made me do it. I'm not saying I didn't do it.\"\nThe probable cause statement said Tran's mother bought a home, only to be told that \"a man, woman, and two children were staying in the upstairs portion of the house.\"\nHis mother apparently did not want tenants, but Tran said they would not leave. His mother was reportedly planning to start an eviction case.\n\"There is a subsequent conversation he had with his mother, and communicates to her that these individuals are gone, implying that they have left,\" said Gill.\nBut Heike Poike, 50, her baby granddaughter, Lyrik, and 28-year-old Dakota Smith were found dead from \"multiple gunshot wounds.\" An 8-year-grandson of Heike's was apparently at school at the time of the shootings.\nKUTV's attempts to reach Tran's mother were unsuccessful on Thursday.\nTran is being held in jail, with bail set at $3 million. The DA would not rule out seeking execution as punishment.", "external_links": ["https://kutv.com/news/local/mom-made-me-do-it-says-triple-murder-suspect"], "published": "2015-10-02T20:33:00.000+03:00", "crawled": "2015-10-02T20:25:24.568+03:00", "highlightTitle": ""}