{"organizations": [], "uuid": "85ca3865dd34855026d460c97404c14e25af8e32", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.obaasema.com", "main_image": "http://www.obaasema.com/wp-content/uploads/2015/10/finding-Gods-will.jpg", "site_section": "http://www.obaasema.com/feed/", "section_title": "OBAASEMA| Ghanaian Woman, Entertainment, Beauty, Fashion, Love Advice", "url": "http://www.obaasema.com/how-to-discover-gods-will-and-stay-within-its-boundaries/", "country": "US", "title": "How to Discover God’s Will and Stay Within its Boundaries", "performance_score": 0, "site": "obaasema.com", "participants_count": 1, "title_full": "How to Discover God’s Will and Stay Within its Boundaries", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T08:11:00.000+02:00", "replies_count": 0, "uuid": "85ca3865dd34855026d460c97404c14e25af8e32"}, "author": "Priscilla Yirenkyi", "url": "http://www.obaasema.com/how-to-discover-gods-will-and-stay-within-its-boundaries/", "ord_in_thread": 0, "title": "How to Discover God’s Will and Stay Within its Boundaries", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Priscilla Yirenkyi | Oct 26, 2015 \nThere are times when we feel trapped in life and pause to reflect only to realize that we just can’t identify the next steps. At this junction in our lives, we often find ourselves asking the questions, ‘Why am I here? What’s the next step?’ Others may ask how they found themselves in their present state and might just give up. One of the lessons I have learned from such experiences is to find my way back into God’s original purpose, his intended plan for my life. But how do we know God’s plan? \nI believe God’s will for us is what he has prompted us to do and where he has asked us to go. One way to clearly see this is by learning to hear his voice and nurturing a heart that is free of filth and chaos. How do you hear the voice? Remaining in God’s word daily and allowing it to speak to your life and situations around you is one of the best ways of connecting with God and hearing his voice, When you finally discover his will for your life, reach out to him for help and wisdom to carry it out. \nWe all want to feel like our lives count for something. God has called all of us to significance and purpose. We must understand that God means us good and has chosen us individually and together to accomplish his divine purpose for us on earth. So whenever you get confused and do not know the next steps in life, work your way back into God’s will for you and humble yourself for God to work in and through you. \nHow do you hear God’s voice? Share it with a comment below.", "external_links": [], "published": "2015-10-26T08:11:00.000+02:00", "crawled": "2015-10-26T16:08:17.909+02:00", "highlightTitle": ""}