{"organizations": [], "uuid": "e3f4660e8968f22434c823fda8855bea36f50672", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailyherald.com", "main_image": "http://www.dailyherald.com/storyimage/DA/20151017/business/151019443/AR/0/AR-151019443.jpg&amp;updated=201510141049&amp;imageversion=Facebook&amp;exactH=630&amp;exactW=1200&amp;exactfit=crop&amp;noborder", "site_section": "http://www.dailyherald.com/rss/feed/?feed=entlife", "section_title": "DailyHerald.com &gt; Life &amp; Entertainment", "url": "http://www.dailyherald.com/article/20151017/business/151019443/", "country": "US", "title": "No one knows why Facebook blocked the phrase 'everyone will know'", "performance_score": 0, "site": "dailyherald.com", "participants_count": 1, "title_full": "No one knows why Facebook blocked the phrase 'everyone will know'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T15:43:00.000+03:00", "replies_count": 0, "uuid": "e3f4660e8968f22434c823fda8855bea36f50672"}, "author": "Caitlin Dewey Washington Post", "url": "http://www.dailyherald.com/article/20151017/business/151019443/", "ord_in_thread": 0, "title": "No one knows why Facebook blocked the phrase 'everyone will know'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "On Sunday, a Redditor named \"System_Requirements\" made a mysterious discovery: If you try to post \"everyone will know\" on someone else's Facebook page, the system would block you indefinitely.\nConspiracy theories ran rampant: Maybe \"everyone will know\" means something insidious. Maybe Facebook is scheming to shape the global dialogue. Or maybe (read: definitely) that particular phrase just happened to get snagged in Facebook's spam filter -- which is its own sort of Internet puzzle.\nFor starters, Facebook doesn't just block malware, phishing or other explicit forms of spam: Its researchers have defined spam, broadly, as any communication that the recipient doesn't want to get. (\"Different cultures have different social norms around communication,\" an in-house team wrote in a 2010 paper. \"Acceptable behavior in one region may be interpreted as unwanted contact in another. This makes a uniform definition of spam difficult.\")\nFor another thing, we have next to no idea how that blocking mechanism works: Like Google, Twitter and a host of other major tech companies, Facebook doesn't share the details of its spam filter out of fear they'll be abused.\nWhat we do know is vague and impenetrable. That same 2010 paper, titled \"Facebook Immune System,\" outlines an overlapping complex of machine-learning algorithms, analyzing dozens of factors across millions of pages. The number of URLs in a message can signal the spam filter, for instance, as can the number of liked pages in common between a requester and his would-be friend. Other purported factors include the number of messages you send, the percentage of people who accept your friend requests, the length of your comments, the length of that particular comment thread, and who else has or is commenting on it.\nPut those two things together -- the semi-arbitrary blocking and the vagueness of the process -- and you end up with an opaque system that selectively regulates the speech of millions of people. It's no wonder that the spam filter has repeatedly been accused (unfairly!) of having nefarious motives: of silencing the critics of Roman Polanski, for instance, or censoring the tech blogger Robert Scoble. Or, for no immediately apparent reason, blocking the phrase \"everyone will know.\"\nSo why did Facebook block \"everyone will know\"? A company spokesman told the Huffington Post that it was \"a mistake with our spam filter\" which has since been repaired. Maybe the phrase appeared on some kind of suspicious-word list, or maybe there was a cross in Facebook's various spam-fighting layers.\nThere's another possibility, however: Presumably, one of the many factors that Facebook's spam algorithm weighs is unexpected spikes in the frequency of words. When our Reddit friend \"System_Requirements\" accused Facebook of blocking \"everyone will know\" in a highly upvoted post, a flood of Redditors rushed to test it.\nSo merely because it was called spam, \"everyone will know\" became spam for real. That may be the closest we get to a \"universal definition\" of the Internet's least-loved kind of speech.\n• Dewey writes The Post's The Intersect web channel covering digital and Internet culture.\n Business Technology Internet Washington Post", "external_links": ["http://www.washingtonpost.com/news/the-intersect/", "https://twitter.com/share"], "published": "2015-10-17T15:43:00.000+03:00", "crawled": "2015-10-17T22:04:07.691+03:00", "highlightTitle": ""}