{"organizations": [], "uuid": "1e60e25a8a569b87c292b71824e6d0f0dcf60152", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailyherald.com", "main_image": "http://www.dailyherald.com/gfx/site/logos/dailyherald_marble_300.jpg", "site_section": "http://www.dailyherald.com/rss/feed/?feed=entlife", "section_title": "DailyHerald.com &gt; Life &amp; Entertainment", "url": "http://www.dailyherald.com/article/20151004/news/310049922/", "country": "US", "title": "Law firm labeled hate group leading Kim Davis' crusade", "performance_score": 0, "site": "dailyherald.com", "participants_count": 1, "title_full": "Law firm labeled hate group leading Kim Davis' crusade - DailyHerald.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T18:09:00.000+03:00", "replies_count": 0, "uuid": "1e60e25a8a569b87c292b71824e6d0f0dcf60152"}, "author": "CLAIRE GALOFARO", "url": "http://www.dailyherald.com/article/20151004/news/310049922/", "ord_in_thread": 0, "title": "Law firm labeled hate group leading Kim Davis' crusade", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LOUISVILLE, Ky. -- Kim Davis' lawyer stood onstage in a Washington D.C. hotel and pointed to a photo on the screen. It showed 100,000 people packed into a Peruvian soccer stadium, Mat Staver told the crowd, all there to pray for the Kentucky clerk battling against gay marriage.\nThe crowd erupted.\nIt wasn't true.\nStaver's firm, the Liberty Counsel, which revealed Davis' secret meeting with Pope Francis, has been accused by advocacy groups of peddling misrepresentations in the past. Yet it has become the main source of details about the controversial pope meeting.\nOnline sleuths quickly debunked the Peru story Staver told at the Values Voter Summit, a conference for the conservative Family Research Council. The photo was from a year-old gathering unrelated to Davis, who spent five days in jail for defying a court order and refusing to license gay marriages. Staver could provide no evidence of a massive Davis rally. On Monday, he called it a mistake and blamed miscommunication with the Peruvian authorities who gave him the photo.\nThe next day, the firm dropped a bombshell. It said Pope Francis, on his celebrated visit to America, secretly met with Davis. The pope hugged her, thanked her for her courage and told her to \"stay strong,\" Liberty Counsel said. The Vatican on Friday said the pope had a brief meeting with Davis that should not be seen as support for her stance.\nMany on the religious right hail the Florida-based Liberty Counsel, which bills itself as a non-profit committed to \"restoring the culture by advancing religious freedom, the sanctity of human life and the family.\"\n\"They're willing to stand up for our rights under the Constitution, they're not backing down,\" said Nick Williams, a probate judge in Alabama who has also pledged never to issue a marriage licenses to a same-sex couple and sought guidance from the Liberty Counsel. Williams compared the federal court system to the tyrannical kings in the Bible: \"I'm glad we have a law firm willing to stand up to the kings of our time.\"\nBut critics watched in exasperation as the organization rocketed to national celebrity alongside Davis.\nThe Southern Poverty Law Center lists the Liberty Counsel as an anti-gay hate groups for spreading false information.\n\"A group that regularly portrays gay people as perverse, diseased pedophiles putting Western civilization at risk are way, way over the line,\" said Mark Potok, a senior fellow at the center.\nThe Liberty Counsel has connected homosexuality to higher rates of promiscuity and incest, Potok said, despite scientific evidence to the contrary. The firm opposes laws banning hate crimes and supports discredited conversion therapies that purport to turn homosexuals into heterosexuals. Staver once declared that the Boy Scouts would become a \"playground for pedophiles\" once it allowed gay troop leaders.\nStaver, his hair bright white and his ties usually red, contends his Quote: s were taken out of context and he has legal arguments for the rest: hate crime laws infringe on free speech, he believes, and gay conversion therapies should be available to those who want them because he believes in \"personal autonomy.\"\n\"It is irresponsible and reckless to call someone a hate group because you disagree with them,\" he said.\nHe added that he can't be considered a hater because he loves all of God's creation.\nWilliams also came to his defense: the Bible warned that Christians would be persecuted for standing strong for their faith, he noted.\n\"Jesus told us we would be hated for his name,\" he said. \"For standing for what we stand for, people will hate us. It happened to the disciples, but it's also happening today.\"\nStaver grew up in Florida. He told The Associated Press in a phone interview that his father was an abusive alcoholic who his Catholic mother divorced when he was young. She worked three jobs and raised him alone, he said, and he went through the motions of Catholicism until an evangelical pastor saved him from sin as a young man.\nHe became a pastor himself in Kentucky, though he shied away from social issues until he saw a film in 1982 about abortion. He resolved to go to law school to fight for traditional family values. He graduated from the University of Kentucky's law school, moved back to Florida with his wife, Anita, and they started the Liberty Counsel in 1989.\nFor years they dabbled in causes against abortion, the \"War on Christmas\" and other hot-button topics in the American culture wars.\nIn 2000, the firm threatened to sue a Florida library that offered a \"Hogwarts School of Witchcraft and Wizardry\" certificate to kids who read the Harry Potter book series. Five years later, they sent letters complaining that a Wisconsin elementary school put on a decades-old play called \"The Little Christmas Tree,\" about a lonely pine searching for a family, which sets a song to the tune of \"Silent Night\" but does not mention Jesus.\nTony Perkins, president of the Family Research Council, has called Staver a courageous legal scholar.\nCivil liberties advocates disagree.\n\"There is an enormous amount of bluster amid his legal arguments,\" said Barry Lynn, a minister and executive director of Americans United for Separation of Church and State, who has debated Staver on religious freedom issues. \"It looks to me like he's making claims that will get his clients great publicity, but not necessarily get them victories.\"\nStaver stands firm on his contributions to American jurisprudence. His firm has been involved in 60 same-sex marriage cases. It has 10 full-time attorneys, and dozens more across the country willing to work for free to promote the cause. In 2013, the firm hauled in more than $4 million, according to tax returns.\nAs Davis defied a series of federal court orders and was sent to jail, Staver cast her as a heroine called into battle by God. He compared her actions to Dr. Martin Luther King Jr. and Abraham Lincoln. She received 20,000 pieces of mail in jail, he said.\n\"I've lost the ability to be surprised at how easy it is to become the next Joan of Arc,\" said Lynn. \"When you make heroes out of people who refuse to accept the rule of law and who fail to acknowledge the dignity of other human beings, you are on a very dangerous path.\"\nStaver said the meeting with the pope validates his arguments about Davis' rights to conscientious objection. He rejects even the suggestion he might wake up one day and discover himself on the wrong side of history.\nLast week, he showed the crowd at the Values Voter Summit the photo of the imaginary Peruvian prayer rally and declared its significance in the battle against Christian oppression.\n\"That, my friends, is happening around the world,\" he said. \"When one person stands it has an impact and Kim Davis will continue to stand for her lord and savior Jesus Christ.\"\n News Nation/World Religion Associated Press", "external_links": ["https://twitter.com/share"], "published": "2015-10-04T18:09:00.000+03:00", "crawled": "2015-10-05T02:21:11.292+03:00", "highlightTitle": ""}