{"organizations": [], "uuid": "8e64e4aef2c66836b617219cda800bd63350de9c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nydailynews.com", "main_image": "http://assets.nydailynews.com/polopoly_fs/1.2405903!/img/httpImage/image.jpg_gen/derivatives/landscape_1200/kitchen22n-3-web.jpg", "site_section": "http://www.nydailynews.com/news/index.html", "section_title": "Breaking, Local and National News, Sports &amp; Entertainment - NY Daily News", "url": "http://www.nydailynews.com/news/national/20-collapse-soup-kitchen-apparent-k2-overdose-article-1.2405906", "country": "US", "title": "20 collapse outside soup kitchen in apparent K2 overdose", "performance_score": 0, "site": "nydailynews.com", "participants_count": 1, "title_full": "20 collapse outside soup kitchen in apparent K2 overdose - NY Daily News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "8e64e4aef2c66836b617219cda800bd63350de9c"}, "author": "NEW YORK DAILY NEWS", "url": "http://www.nydailynews.com/news/national/20-collapse-soup-kitchen-apparent-k2-overdose-article-1.2405906", "ord_in_thread": 0, "title": "20 collapse outside soup kitchen in apparent K2 overdose", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Thomas Colishaw, 21, Bamf Hunter, 29, and Abdur Rahim, 47, were arrested in connection with a spike in overdoses from use of the synthetic marijuana drug K2 in Tulsa. Three people have been arrested after an apparent K2 synthetic marijuana overdose at an Oklahoma soup kitchen sent at least 20 people to the hospital.\nDozens of people high on drugs collapsed outside the Iron Gate Soup Kitchen in Tulsa early Tuesday with some convulsing violently, Tulsa Fire Department spokesman Stan May told the Daily News.\n\"They were delirious,\" May said Wednesday. \"It seemed to hit them pretty quick. They were confused and dazed and they went down.\"\n6 BASIC FACTS ABOUT K2\nPolice and fire rescuers responded about 9 a.m. and watched as people took turns tumbling to the ground within a two-block area.\nNews9 At least 20 people were sent to the hospital after an apparent K2 drug overdose at an Oklahoma food kitchen, authorities said. News9 At least 20 people were sent to the hospital after an apparent K2 drug overdose at an Oklahoma food kitchen, authorities said. News9 At least 20 people were sent to the hospital after an apparent K2 drug overdose at an Oklahoma food kitchen, authorities said. Previous Next Enlarge \"It started with one and then within 15 minutes, it was about eight or nine and then a couple more before they left the scene,\" May said.\nWitnesses described the scene as something out of a zombie flick.\n\"It's like a freak accident,\" witness Tim Merkov told News 9 Oklahoma . \"It's like from a horror movie or something.\"\nAt least 11 people were rushed to the hospital after the initial 911 call, authorities said. That number grew to at least 20 by early Wednesday, according to local reports.", "external_links": ["http://www.news9.com/story/30305841/multiple-drug-overdoses-reported-at-downtown-tulsa-soup-kitchen"], "published": "2015-10-21T03:00:00.000+03:00", "crawled": "2015-10-21T22:32:10.628+03:00", "highlightTitle": ""}