{"organizations": [], "uuid": "827caceaffa48df96e5b05bddb0795e16fab33f9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.democratandchronicle.com", "main_image": "http://www.gannett-cdn.com/-mm-/d0368f32152c86051c345742ed81e5c82199a9d1/c=0-81-2990-1770&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/18/USATODAY/USATODAY/635807520126762917-AP-DEM-2016-Biden-Clinton.jpg", "site_section": "http://www.democratandchronicle.com/", "section_title": "Democrat and Chronicle | Rochester news, community, entertainment, yellow pages and classifieds. Serving Rochester, New York | democratandchronicle.com", "url": "http://www.democratandchronicle.com/story/news/politics/elections/2016/2015/10/18/hundreds-obama-bundlers-missing-clintons-elite-fundraising-ranks/74170182", "country": "US", "title": "Hundreds of Obama bundlers missing from Clinton's elite fundraising ranks", "performance_score": 0, "site": "democratandchronicle.com", "participants_count": 1, "title_full": "Hundreds of Obama bundlers missing from Clinton's elite fundraising ranks", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T20:56:00.000+03:00", "replies_count": 0, "uuid": "827caceaffa48df96e5b05bddb0795e16fab33f9"}, "author": "Fredreka Schouten and Christopher Schnaars, USA TODAY", "url": "http://www.democratandchronicle.com/story/news/politics/elections/2016/2015/10/18/hundreds-obama-bundlers-missing-clintons-elite-fundraising-ranks/74170182", "ord_in_thread": 0, "title": "Hundreds of Obama bundlers missing from Clinton's elite fundraising ranks", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON — Hundreds of wealthy Democrats who raised money for President Obama’s re-election have not yet joined the top fundraising ranks of Hillary Clinton’s presidential campaign, raising hopes among some of Vice President Biden’s supporters that there remains a path for his late entry into the race. Just 76, or less than 10%, of the 833 individuals who collected political cash for the 2012 Obama-Biden campaign are listed among Clinton’s “Hillblazers,” her campaign’s designation for people who already have bundled together at least $100,000 on her behalf, a USA TODAY analysis of Clinton’s newly updated fundraiser list shows.\nBiden loyalists have sought to assure his supporters in recent days that there is still a viable route to the nomination, despite Clinton’s commanding debate performance Tuesday in Las Vegas and her early fundraising dominance over the 2016 field.\nIn a letter Thursday to Biden’s political network , one of his longest-serving advisers, former Delaware senator Ted Kaufman, pledged an “optimistic campaign” from Biden should he seek the presidency. Kaufman suggested that Biden was close to a decision.\nIt’s hard to pin down exactly how much of an opening remains for Biden among the Democratic fundraisers who helped the Obama-Biden ticket win a second term. New campaign-finance reports show scores of Obama’s bundlers giving $2,700 to Clinton, the maximum an individual can donate to her campaign for the primary.\nSome of Obama’s elite fundraisers also say they have committed to raise money on Clinton’s behalf but have not yet reached the $100,000 threshold needed to appear on her bundler list.\nBoston-area resident Erik Ramanathan, an Obama fundraiser eager to see Biden enter the race, insists Clinton has not locked up the majority of the president’s finance team. “I think there are a lot of Obama bundlers who are effectively on the sidelines,” he said.\nRamanathan called Biden a “spectacular vice president” who is valued in part for his 36 years of experience in the Senate and his ability to work with Republicans on Capitol Hill.\n“People see him as the fixer President Obama sends in when he’s facing an intractable problem,” Ramanathan said, citing Biden’s role in a 2011 budget deal with congressional leaders and his current task of helping sell the Iran nuclear deal.\n“I don’t think any of the other (Democrat) candidates brings that bridging ability,” Ramanathan said.\nAnother Obama bundler, Chicago attorney Nigel Telman, said he’s biding his time. The controversy swirling around Clinton’s use of a private email server during her tenure as secretary of State raises “transparency” issues, he said. (Clinton is expected to face questions about those emails and more during an appearance Thursday before a House committee investigating the Benghazi terrorist attacks.)\n“My wife is all Hillary, all the time,” Telman said. “But I’m holding off a bit. I’m intrigued by Biden.”\nTelman said the vice president, known for his off-the-cuff speaking style, “brings the same kind of authenticity” that’s drawing voters to GOP presidential front-runner Donald Trump but “without the Trump craziness.”\nBiden, who twice before has sought the presidency, faces steep challenges should he run.\nClinton, basking in rave debate reviews, has regained her narrow lead over rival Vermont Sen. Bernie Sanders in the crucial state of New Hampshire, according to a Suffolk University/ Boston Globe poll of likely Democratic voters released Friday.\nUSA TODAY\nAnalysis: Hillary Clinton, Bernie Sanders and the big Democratic debate\nONPOLITICS\nPoll: Clinton erases Sanders' lead in New Hampshire after debate\nShe’s also outraised and outspent every other candidate in the 2016 field as she races to build a substantial field operation. Together, Clinton and Sanders, who is relying on an army of small donors, entered October with a combined $60 million in cash reserves, most of which can be used in the primary fight.\nAsked about the potential opening for Biden, Clinton’s camp pointed to the big pool of donors she already has amassed and her aggressive push to build a ground operation that extends far beyond the early voting states.\n\"We are grateful to the nearly 400,000 people who have contributed to our campaign and given us a record-breaking first six months,” spokesman Josh Schwerin said in an email. “With their help, we have built an organization that is equipped to compete in every primary state and territory and train and empower every one of our 60,000 volunteers and recruit even more.\"\nClinton is the only Democrat in the presidential race to release a fundraiser list. Given the $2,700-donation cap, fundraisers are crucial players in campaigns and must tap their networks of relatives, friends and associates to bundle together contributions.\nUSA TODAY\nMeet Jeb Bush's top White House fundraisers\nIn all, EMILY’s List, a group supporting female Democratic candidates, and 272 individuals have collected at least $21 million for Clinton’s campaign through Sept. 30. That’s more than a quarter of the $76 million she has raised.\nThe 76 Obama fundraisers on that list include some of the Democratic Party’s biggest power brokers and famous names, ranging from Vogue editor Anna Wintour and Chicago media mogul Fred Eychaner to New York hedge fund manager Marc Lasry.\nLainy Lebow-Sachs, a non-profit executive in Baltimore and well-known figure in Maryland’s Democratic fundraising circles, is among the Obama fundraisers who has joined Clinton’s camp but has not yet earned Hillblazer status. She plans to co-host her first Clinton fundraiser in December.\nClinton’s performance on the debate stage “just rejuvenated everyone who is a Hillary supporter,” Lebow-Sachs said. “She’s in a good spot right now. I think Hillary is going to win.”\nBiden, on the other hand, should not “upset the apple cart for Democrats ,” she said. “He’s lost twice, and it would be a shame for him to come in and lose a third time.”", "external_links": ["http://www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/fde251906e8b630ab92f4ca2c0f784f97f832a3d/c=410-0-2038-1628/local/-/media/2015/10/13/USATODAY/USATODAY/635803747914035936-AP-DEM-2016-Debate.jpg", "http://www.usatoday.com/story/news/politics/elections/2015/10/13/analysis-hillary-clinton-bernie-sanders-democratic-debate/73866212/", "https://www.hillaryclinton.com/about/hillblazers/", "http://www.usatoday.com/story/news/politics/elections/2015/10/15/jeb-bush-bundlers-fundraisers/73987592/", "http://onpolitics.usatoday.com/2015/10/16/poll-clinton-regains-lead-over-sanders-in-new-hampshire/", "http://www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/c56d0189167743e66a7e6c8e131da00d19acbc39/c=0-89-4819-2811&r=x1683&c=3200x1680/local/-/media/2015/10/15/USATODAY/USATODAY/635805072756781794-AP-GOP-2016-Bush-Health-Care.jpg", "http://www.gannett-cdn.com/-mm-/ebc9519ac086054fa5092ba711393606fbfe81d3/r=300/https/i1.wp.com/usatelections.files.wordpress.com/2015/10/ap_dem_2016_debate.jpg?fit=440%2C330", "http://onpolitics.usatoday.com/2015/10/16/joe-biden-2016-decision-ted-kaufman/"], "published": "2015-10-18T20:56:00.000+03:00", "crawled": "2015-10-19T16:13:42.334+03:00", "highlightTitle": ""}