{"organizations": [], "uuid": "8605721bbdec2eac6444b6255c6d17aba5ef65ff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.digitalspy.co.uk", "main_image": "http://i2.cdnds.net/13/19/300x225/lamar-khloe-kardashian.jpg?1396268187", "site_section": "http://www.digitalspy.co.uk/rss/zones/gb/all.xml#", "section_title": "All - Digital Spy - Entertainment and Media News", "url": "http://www.digitalspy.co.uk/showbiz/news/a674713/khloe-kardashian-breaks-her-silence-on-lamar-odoms-condition-incredible-strides-have-been-made.html?rss", "country": "US", "title": "Khloé Kardashian breaks her silence on Lamar Odom's condition: \"Incredible strides have been made\" - Showbiz", "performance_score": 0, "site": "digitalspy.co.uk", "participants_count": 1, "title_full": "Khloé Kardashian breaks her silence on Lamar Odom's condition: \"Incredible strides have been made\" - Showbiz News - Digital Spy", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "8605721bbdec2eac6444b6255c6d17aba5ef65ff"}, "author": "Justin Harp", "url": "http://www.digitalspy.co.uk/showbiz/news/a674713/khloe-kardashian-breaks-her-silence-on-lamar-odoms-condition-incredible-strides-have-been-made.html?rss", "ord_in_thread": 0, "title": "Khloé Kardashian breaks her silence on Lamar Odom's condition: \"Incredible strides have been made\" - Showbiz", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Khloé Kardashian has broken her silence on the condition of her estranged husband Lamar Odom.Odom was discharged from hospital in Las Vegas on Monday (October 19), having regained consciousess several days after collapsing at a Nevada brothel. © WENN The NBA star's former wife Khloé was by his side throughout his hospitalisation, and is now offering an update on Odom's condition.Kardashian wrote on her blog: \"The past week has been incredibly difficult. I am so thankful to family, friends and fans, who have sent nothing but prayers and well wishes to Lamar.\"I also want to take a moment to thank everyone at Sunrise Hospital, including the amazing doctors and nurses for their kindness and diligent work.\"Under their amazing care, incredible strides have been made. You can never be prepared for an experience like this, but without the outpouring of love and endless prayers that Lamar has received and the strength I was given from my loved ones, it would have been difficult to endure.\"Thank you for your continued support. God is great!!!\" © PA Images / Jordan Strauss/AP The reality star's family members Kim Kardashian West, Kourtney Kardashian, Rob Kardashian, Kendall Jenner and Kylie Jenner all rallied support for Odom on social media over the last week.Following his Las Vegas hospital discharge, Odom will be transferred to his hometown of Los Angeles to receive more extensive treatmentThe Nye County Sheriff stated last week that Odom was using cocaine and sexual performance enhancing supplements on the weekend before his hospitalisation.Kardashian and Odom separated in 2013 after four years of marriage, with their divorce finalised this year.", "external_links": [], "published": "2015-10-20T03:00:00.000+03:00", "crawled": "2015-10-21T01:55:42.017+03:00", "highlightTitle": ""}