{"organizations": [], "uuid": "3e027d71d435a7d596eccaf65f24fe8b75b1dbd0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mysanantonio.com", "main_image": "http://ww1.hdnux.com/photos/41/61/26/8852880/4/rawImage.jpg", "site_section": "http://www.mysanantonio.com/rss/feed/mySA-Entertainment-923.php", "section_title": "mySA Entertainment", "url": "http://www.mysanantonio.com/entertainment/celebrities/article/Kevin-Fowler-warns-against-rattlesnakes-with-6590787.php", "country": "US", "title": "Texas country star Kevin Fowler posts gnarly rattlesnake bite photos on Facebook", "performance_score": 0, "site": "mysanantonio.com", "participants_count": 1, "title_full": "Texas country star Kevin Fowler posts gnarly rattlesnake bite photos on Facebook", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T17:13:00.000+02:00", "replies_count": 0, "uuid": "3e027d71d435a7d596eccaf65f24fe8b75b1dbd0"}, "author": "Madalyn Mendoza, San Antonio Express-News", "url": "http://www.mysanantonio.com/entertainment/celebrities/article/Kevin-Fowler-warns-against-rattlesnakes-with-6590787.php", "ord_in_thread": 0, "title": "Texas country star Kevin Fowler posts gnarly rattlesnake bite photos on Facebook", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Texas country star Kevin Fowler posts gnarly rattlesnake bite photos on Facebook By Madalyn Mendoza Updated 10:45 am, Monday, October 26, 2015 Photo: 2006 Getty Images Close Image 1 of 16 Texas country music star, Kevin Fowler, is taking to Facebook to warn against the feared enemy of rural area areas by posting photos of a gnarly rattlesnake bite. Texas country music star, Kevin Fowler, is taking to Facebook to warn against the feared enemy of rural area areas by posting photos of a gnarly rattlesnake bite. Photo: 2006 Getty Images Image 2 of 16 The musician’s third encounter of the month with a snake prompted the viral post, he said on Facebook. Fowler is definitely not one to feel guilty about slaying a rattlesnake because he's seen the pain they're capable of causing. The musician’s third encounter of the month with a snake prompted the viral post, he said on Facebook. Fowler is definitely not one to feel guilty about slaying a rattlesnake because he's seen the pain ... more Image 3 of 16 Fowler added that the gruesome bite photos are of his friend Tommy’s hand, who is still undergoing rehab and surgeries a year later. Fowler added that the gruesome bite photos are of his friend Tommy’s hand, who is still undergoing rehab and surgeries a year later. Photo: Facebook.com Image 4 of 16 “All of you people who cry about folks killing rattlesnakes have probably never seen what it looks like when you get bit by one,” he said. “All of you rattlesnake sympathizers will change your tune when your kid gets bit playing in your backyard.” “All of you people who cry about folks killing rattlesnakes have probably never seen what it looks like when you get bit by one,” he said. “All of you rattlesnake sympathizers will change your tune when ... more Image 5 of 16 Snake sightings are no surprise to Texans, but some can be viscous, ginormous and downright terrifying. Keep clicking to see snakes that have made national headlines. Snake sightings are no surprise to Texans, but some can be viscous, ginormous and downright terrifying. Keep clicking to see snakes that have made national headlines. Photo: File Image 6 of 16 \"Terrifying photo shows snake in Austin man's BBQ pit\" Austin man Andrew Barlow found this Texas rat snake in his barbecue pit on Sunday, July 19, 2015. He posted this photo on social media after his dog sniffed out a Texas rat snake, which are not poisonous, stuck at the bottom of the barbecue pit. He posted on Facebook: \"Anybody have recommendations on a good replacement barbecue grill? (P.S. I wasn't scared. Not a bit. Seriously. I always grab drumsticks to deal with random serpents.)\" Read more here . \"Terrifying photo shows snake in Austin man's BBQ pit\" Austin man Andrew Barlow found this Texas rat snake in his barbecue pit on Sunday, July 19, 2015. He posted this photo on social media after his dog Image 7 of 16 \"Expert: Viral photo of '11-foot rattlesnake' killed in Texas is fake\" A photo showing a man holding an 11-foot rattlesnake in George West went viral, but it is actually not as big as it seems. Texas Parks and Wildlife officials confirmed in early July 2015 that the rattlesnake was positioned to exaggerate its size. Read more here . \"Expert: Viral photo of '11-foot rattlesnake' killed in Texas is fake\" A photo showing a man holding an 11-foot rattlesnake in George West went viral, but it is actually not as big as it seems. Texas Parks and Image 8 of 16 \"Boy bitten by copperhead snake is recovering\" A 14-year-old boy was bitten by a Northern copperhead while visiting Connecticut's D evil’s Den Preserve on a class field trip on July 6, 2015. Although copperheads are poisonous, the boy was expected to make a full recovery. Read more here . \"Boy bitten by copperhead snake is recovering\" A 14-year-old boy was bitten by a Northern copperhead while visiting Connecticut's D evil’s Den Preserve on a class field trip on July 6, 2015. Although Image 9 of 16 \"Cobra that killed teen on the loose in Austin, residents share fear online\" On July 14, Austin Police announced their search for a cobra that they believe bit and killed 18-year-old Grant Thompson. The search went viral on Twitter, with serious and exaggerated concerns. A few Twitter users even created parody accounts for the missing cobra. The snake was later found dead in a parking lot. Read more here . \"Cobra that killed teen on the loose in Austin, residents share fear online\" On July 14, Austin Police announced their search for a cobra that they believe bit and killed 18-year-old Grant Thompson. The search Image 10 of 16 \"The story behind this viral photo of a squirrel eating a snake at a Texas park\" A squirrel, photographed at the Guadalupe Mountains National Park, made headlines after it was seen eating a snake. According to a Facebook post, the squirrel ate most of the snake, \"bones and all.\" Rock squirrels eat mostly plants, fruits and nuts, but they are omnivores, so they do eat bird eggs, lizards and snakes. Read more here . \"The story behind this viral photo of a squirrel eating a snake at a Texas park\" A squirrel, photographed at the Guadalupe Mountains National Park, made headlines after it was seen eating a snake. According to a Image 11 of 16 \"Man in 'snake-proof' suit to be 'eaten' by anaconda during Discovery Channel special\" \nPaul Rosolie, a filmmaker and naturalist, built a custom snake-proof suit so he could be devoured by an anaconda for a Discovery Channel television special. A YouTube promo for the Dec. 7 special — titled, predictably, \"Eaten Alive\" — shows Rosolie stalking an anaconda, otherwise minding its own business, before it presumably attacks and eats him. \nRead more here . \"Man in 'snake-proof' suit to be 'eaten' by anaconda during Discovery Channel special\" \nPaul Rosolie, a filmmaker and naturalist, built a custom snake-proof suit so he could be devoured by an anaconda for a Image 12 of 16 \"Texas' nightmare-inducing centipede caught on camera in Garner State Park\" OK, this is not a snake, but it is just as creepy. On July 1, the Garner State Park Facebook page posted this photo of a large redheaded centipede. Bites from the terrifying \"creepy-crawly\" are often mild, resulting in a sting comparable to a bee and usually accompanied by swelling. Read more here . \"Texas' nightmare-inducing centipede caught on camera in Garner State Park\" OK, this is not a snake, but it is just as creepy. On July 1, the Garner State Park Facebook page posted this photo of a large Image 13 of 16 \"S.F. Zoo’s missing snake mystery solved\" This 13-inch Baron's Racer snake was thought to have disappeared from its enclosure at the San Francisco Zoo in mid-July 2015, was found safe in its cage. The snake was though to have escaped and been eaten by a bird, but it camouflaged itself in its enclosure. Read more here . \"S.F. Zoo’s missing snake mystery solved\" This 13-inch Baron's Racer snake was thought to have disappeared from its enclosure at the San Francisco Zoo in mid-July 2015, was found safe in its cage. The snake Image 14 of 16 \"Snake removed from visitor’s locker room at AT& T Center before Game 2\" Portland Trail Blazer Mo Williams and the rest of the Blazers were welcomed to game 2 of their playoff series with the Spurs in May 2014 by a snake, who was hanging out in their dressing room of the AT&T Center. The snake was believed to have entered the facility after the old stable/barn facility adjacent to the AT&T Center was torn down. Read more here . \"Snake removed from visitor’s locker room at AT& T Center before Game 2\" Portland Trail Blazer Mo Williams and the rest of the Blazers were welcomed to game 2 of their playoff series with the Spurs in May 2014 Image 15 of 16 \"Snake in golf course hole will make you question golfing ever again\" An employee at The Clubs of Kingwood at Deerwood golf course just north of Houston spotted a snake in a cup in March 2015. “We see snakes all the time on the course but never one caught under the cup. Sometimes we found dead ones in the cups though,” Superintendent Ed Martinez told the Houston Chronicle. Read more here . \"Snake in golf course hole will make you question golfing ever again\" An employee at The Clubs of Kingwood at Deerwood golf course just north of Houston spotted a snake in a cup in March 2015. “We see snakes", "external_links": [], "published": "2015-10-26T17:13:00.000+02:00", "crawled": "2015-10-26T20:28:46.537+02:00", "highlightTitle": ""}