{"organizations": [], "uuid": "259d255ca48640c55c577a37fe3c6310a9a00925", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.timesunion.com", "main_image": "http://ww3.hdnux.com/photos/41/43/43/8796406/5/rawImage.jpg", "site_section": "http://www.timesunion.com/default/feed/entertainment/feed/Entertainment-News-214.php", "section_title": "Entertainment News", "url": "http://www.timesunion.com/entertainment/article/Book-explains-why-Halloween-attractions-make-us-6572992.php", "country": "US", "title": "Book explains why Halloween attractions make us \"Scream\"", "performance_score": 0, "site": "timesunion.com", "participants_count": 1, "title_full": "Book explains why Halloween attractions make us \"Scream\" - Times Union", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T01:08:00.000+03:00", "replies_count": 0, "uuid": "259d255ca48640c55c577a37fe3c6310a9a00925"}, "author": "timesunion.com", "url": "http://www.timesunion.com/entertainment/article/Book-explains-why-Halloween-attractions-make-us-6572992.php", "ord_in_thread": 0, "title": "Book explains why Halloween attractions make us \"Scream\"", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photo: AP Image 1 of / 3 3 This undated photo provided by ScareHouse shows an exterior shot at the ScareHouse haunted attraction in Pittsburgh. Margee Kerr, a sociologist who studies fear and has written a book called \"Scream: Chilling Adventures in the Science of Fear,\" works at Scarehouse analyzing visitor responses to the attraction. (Scarehouse via AP) This undated photo provided by ScareHouse shows an exterior shot at the ScareHouse haunted attraction in Pittsburgh. Margee Kerr, a sociologist who studies fear and has written a book called \"Scream: ... more Photo: AP Image 2 of 3 This undated image provided by the publisher PublicAffairs shows the cover of \"Scream: Chilling Adventures in the Science of Fear,\" a book by Margee Kerr, a sociologist who studies fear. The book documents Kerr's adventures around the world checking out extreme and scary attractions from roller coasters and haunted houses to the CN Tower EdgeWalk in Toronto. (PublicAffairs via AP) This undated image provided by the publisher PublicAffairs shows the cover of \"Scream: Chilling Adventures in the Science of Fear,\" a book by Margee Kerr, a sociologist who studies fear. The book documents ... more Photo: AP Image 3 of 3 This undated photo shows Margee Kerr, author of the new book \"Scream: Chilling Adventures in the Science of Fear.\" Kerr is a sociologist who studies fear. The book documents her adventures around the world checking out extreme and scary attractions from roller coasters and haunted houses to the CN Tower EdgeWalk in Toronto. (Rachellynn Schoen via AP) This undated photo shows Margee Kerr, author of the new book \"Scream: Chilling Adventures in the Science of Fear.\" Kerr is a sociologist who studies fear. The book documents her adventures around the world ... more Photo: Rachellynn Schoen, AP Book explains why Halloween attractions make us \"Scream\" 1 / 3 Back to Gallery Margee Kerr says she has the best job in the world: She studies fear for a living, and loves to scare herself as part of her research.\nKerr is a sociologist with a Ph.D. from the University of Pittsburgh , and just in time for Halloween, she's written a book called \"Scream: Chilling Adventures in the Science of Fear.\"\nThe book documents Kerr's adventures around the world experiencing extreme attractions, ranging from the tallest roller coasters in Japan to the CN Tower's EdgeWalk in Toronto, where participants are tethered to the skyscraper for an outdoor walk 116 stories off the ground.\nKerr also works at a haunted attraction in Pittsburgh called ScareHouse, analyzing customer responses to help keep the fright levels just right. \"We're trying to scare people in a way that's going to make them feel good,\" she said.\nKerr is interested in the notion that society usually regards \"fear as a negative force. But there's another side to fear that's fun and fulfilling,\" and that's the sweet spot sought by recreational activities — whether skydiving, ziplining, roller coasters or haunted houses.\n\"When we know we're not really in any physical danger, we can enjoy the endorphins and the dopamine. That response is similar to being really excited and happy,\" she said.\nHer quest for the \"Scream\" book took her on \"many, many adventures across the world, doing as many scary and thrilling things as I could. I look at it from the cultural perspective, the physiological perspective and the psychological perspective: Why do we engage with this type of material? Part of it is the natural high we get from activating the flight-or-fight response in a safe environment.\"\nKerr says the trick is to figure out what types of situations \"trigger our flight or fight response. What are people afraid of, what's going to tap into the fear?\"\nFor example, \"we know from science that seeing the whites of people's eyes will activate the amygdala — the emotional processing center of our brain.\" That intense response to another being's eyes explains why scary attractions often have \"dolls with big eyes or animatronics with wide-open eyes.\" Startling sounds, fast-moving props and other sudden visual effects also trigger instinctive responses, upping the fear factor without putting people in real danger.\nShe added that part of the draw for an extreme adventure or attraction is that \"you are testing your own resilience. When you come out the other side of a scary movie or haunted house, you have accomplished something. You've tested your will. Even though we know nothing will hurt us, the self-esteem boost is real.\"\nAs for her own responses, she found the CN Tower Edgewalk to be \"way more terrifying than I thought it would be.\" Skydiving, on the other hand, was pure pleasure for Kerr.\nKerr says her research can have implications beyond theme parks and haunted houses by helping people understand how to tolerate stress. \"We're trying to find the best ways to teach people how to experience their emotions in ways that are healthy and not debilitating,\" she said. \"When people lean into the experience and test themselves in an environment that is safe, they come to learn they can handle stress and they are stronger than they thought they were.\"", "external_links": ["http://ww1.hdnux.com/photos/41/43/43/8796404/5/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/41/43/43/8796405/5/920x920.jpg", "http://ww3.hdnux.com/photos/41/43/43/8796406/5/920x920.jpg", "http://ww2.hdnux.com/photos/41/43/43/8796405/5/square_gallery_thumb.jpg", "http://ap.org/schemas/03/2005/apcm", "http://ww1.hdnux.com/photos/41/43/43/8796404/5/920x920.jpg", "http://ww3.hdnux.com/photos/41/43/43/8796406/5/square_gallery_thumb.jpg", "http://ap.org/schemas/03/2005/apnm"], "published": "2015-10-16T01:08:00.000+03:00", "crawled": "2015-10-16T00:28:48.159+03:00", "highlightTitle": ""}