{"organizations": [], "uuid": "b071175271978ec90e0c72725aa3f218ac8e8b74", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.syracuse.com", "main_image": "http://imgick.syracuse.com/home/syr-media/width620/img/parade/photo/2015/10/19/19005352-standard.jpg", "site_section": "http://impact.syracuse.com/entertainment/atom.xml", "section_title": "Central NY Entertainment", "url": "http://www.syracuse.com/celebrity-news/index.ssf/2015/10/anthony_mackie_donald_trump_president_buzz.html", "country": "US", "title": "Anthony Mackie endorses Donald Trump 'who worked his way up from nothing': PM Buzz", "performance_score": 0, "site": "syracuse.com", "participants_count": 1, "title_full": "Anthony Mackie endorses Donald Trump 'who worked his way up from nothing': PM Buzz", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T23:36:00.000+03:00", "replies_count": 0, "uuid": "b071175271978ec90e0c72725aa3f218ac8e8b74"}, "author": "Geoff Herbert | gherbert@syracuse.com", "url": "http://www.syracuse.com/celebrity-news/index.ssf/2015/10/anthony_mackie_donald_trump_president_buzz.html", "ord_in_thread": 0, "title": "Anthony Mackie endorses Donald Trump 'who worked his way up from nothing': PM Buzz", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments \n\"Captain America\" star Anthony Mackie is endorsing Donald Trump for president in 2016, but social media users are upset with his reasoning. The 37-year-old actor, best known for playing Marvel's Falcon in \"The Avengers\" and Papa Doc in \"8 Mile,\" was promoting his new film \"Our Brand Is Crisis\" when he described Trump as \"the guy who worked his way up from nothing. And I think if you're a 'pull yourself up by your bootstraps' candidate, people would identify with that.\" Mackie added that he's \"on the bandwagon\" and \"drinking the Kool-Aid\" for the Republican frontrunner. Backlash included critics saying Trump built his success off his father's real estate development fortune. » Read more at The Root . \nSyracuse native Tom Cruise once gave an interview at a urinal -- in fact, it was just this past weekend. The 53-year-old actor attended an LSU football game on Saturday while in town filming \"Jack Reacher 2,\" and local The Advocate reporter Ross Dellenger asked \"during our pee together\" about Cruise attending what was apparently his first college football game. \"Memorable. Exciting. Everything else will pale in comparison,\" Cruise said. » See photos at AL.com and read more at TMZ . \nA decade after winning \"American Idol,\" Carrie Underwood is opening up about body issues she's had since being in the spotlight. The 32-year-old singer says she started eating less and turned to weight-loss supplements with ephedra to slim down. \"It wasn't the best way. If I could go back and talk to myself I'd be like, 'Here's how you do it the right way,'\" she said. Underwood says she now works out daily and has more muscle tone, plus she says having a baby has made her \"bum a little nicer than it used to be\" (though the C-section did ruin her four-leaf clover tattoo). » Read more at People . \nAnd is \"The Nightmare Before Christmas\" a Halloween movie or a Christmas movie? Tim Burton's 1993 stop-motion animated musical is either a creepy December tale or an October flick that gets you in the holiday spirit. \"It's a Halloween movie,\" director Henry Selick definitely says in a new interview. He describes it as a story about citizens of Halloween Town reacting to something new and unusual like Christmas, so he recommends watching it in October -- but to each your own. » Read more at Slash Film . \nMore Buzz: » ABC's '13 Nights of Halloween' schedule begins tonight with 'Hocus Pocus' ( E! )» 'The Conjuring' spinoff 'Annabelle' already has a sequel in the works ( SFilm )» Hustler's Larry Flynt on Playboy ending nude photos: Hef's 'lost his mind' ( DM )» Final season of 'Downton Abbey' gets US premiere date: Jan. 3 ( CBS News )» Khloe Kardashian pictured in hospital with Lamar Odom ( NY Daily News )» Metta World Peace on Odom: 'Not every Kardashian needs to be around' ( Vibe )» Ellen didn't want Meryl Streep in Oscars selfie? Bradley Cooper 'ruined it' ( E! )» Kate Hudson reveals 'insane' workout tips to maintaining her fit body ( Daily Mail )» Aaron Sorkin wants app to stop him from saying wrong thing to girlfriends ( RE )» Britney Spears nearly suffers wardrobe malfunction, keeps performing ( TMZ )» Duggar sisters address molestation scandal in trailer for 'Jill & Jessa' ( NYDN )» Awkward? Blake Shelton, Miranda Lambert to both appear at CMA Awards ( E! )» Selena Gomez, 23, has a crush on 'Captain America' star Chris Evans, 34 ( DM ) \nPM Buzz is a weekday afternoon feature on syracuse.com where we'll post the latest in viral videos, trending topics, celebrity gossip and entertainment news.", "external_links": [], "published": "2015-10-19T23:36:00.000+03:00", "crawled": "2015-10-20T07:25:50.754+03:00", "highlightTitle": ""}