{"organizations": [], "uuid": "676adf50fcc885d37c2b90237710c431eb64292d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/49154606.cms", "site_section": "http://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/articlelist/536583627.cms", "section_title": "Bollywood News, Latest Bollywood News, Actresses, Actors, Movies, Films India | Entertainment - Times of India", "url": "http://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/Mugdha-Godse-Dont-mind-playing-glamorous-roles/articleshow/49269363.cms", "country": "IL", "title": "Mugdha Godse: Don't mind playing glamorous roles", "performance_score": 0, "site": "indiatimes.com", "participants_count": 3, "title_full": "Mugdha Godse: Don't mind playing glamorous roles - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T20:05:00.000+03:00", "replies_count": 2, "uuid": "a592461c31fe8b04e5e0ea470809c06cabd1a49b"}, "author": "timesofindia.indiatimes.com", "url": "http://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/Mugdha-Godse-Dont-mind-playing-glamorous-roles/articleshow/49269363.cms#post-0", "ord_in_thread": 0, "title": "Mugdha Godse: Don't mind playing glamorous roles", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Model-turned-actress Mugdha Godse, who will be seen playing a powerful and dominating business woman in her upcoming film Ishq Ne Krazy Kiya Re , says she doesn't mind play glamorous roles but would enjoy \"an intense powerful role\" more.\nREAD: Who is making Mugdha smile so much?\n\"I don't mind to play 'singing and running around tree' roles. Though I love playing emotional, glamorous roles, but I would enjoy more playing an intense powerful role,\" she said at a function for her forthcoming film.\nThe film is directed by Naresh Malhotra who has previously directed popular films such as Yeh Dillagi and Dil Ka Rishta .\n updates,\nAbout him, Mughda said: \"Nareshji is an experienced director. He has made successful films long ago and now coming back with this film. The benefit of working with Nareshji is he has used his experience and molded himself into current film making. He understands nowadays what audience wants to watch. His experience made all of us to deliver good performance.\"\nFor more interesting Bollywood news and pictures, follow us on Pinterest>>> timesofindia\n updates, follow us on G+ >>> The Times of India Entertainment\nThe film also stars Nishant Malkani and Madhurima Banerjee in lead roles. Nishant and Mugdha were last seen in another love triangle, Bezubaan Ishq , which had also starred Sneha Ullal. About working with fresh star cast as she is senior in this industry and if she has provided any guidance, Mughda said: \"Today's newcomers don't need any training. They know their job.\"\nShe said that her upcoming project which is yet to be titled, is a love story. She completed the shoot in Shimla and soon will leave for Lucknow for the further shoot. Mughda made her Bollywood debut with the film Madhur Bhandarkar's Fashion (2008), alongside Priyanka Chopra and Kangana Ranaut where she played a glamorous character in an important role. She received loads of praise for her performance.\nClick here for more Bollywood videos\nListen to Fashion songs on Gaana.com\nWATCH: Mugdha Godse To Play An Obsessive Lover In Her\nFashion Amazon.in : INR 125.00 Buy now Ishq Ne Krazy Kiya Re: Music launch of 10 Celebs unveil the music of Bollywood film Ishq Ne Krazy Kiya Re in Mumbai.\nSee more of: Tanya Abrol , Nishant Malkani , Mugdha Godse , Manmeet Singh , Harmeet Singh Mugdha Godse poses for a photo during the music launch of Bollywood film Ishq Ne Krazy Kiya Re in Mumbai.\nSee more of: Mugdha Godse Harmeet Singh and Manmeet Singh pose for a photo during the music launch of Bollywood film Ishq Ne Krazy Kiya Re in Mumbai.\nSee more of: Manmeet Singh , Harmeet Singh Ritu Chauhan poses as she arrives for the music launch of Bollywood film Ishq Ne Krazy Kiya Re in Mumbai.\nSee more of: Ritu Chauhan Mugdha Godse and Nishant Malkani pose together during the music launch of Bollywood film Ishq Ne Krazy Kiya Re in Mumbai.\nSee more of: Nishant Malkani , Mugdha Godse Stay updated on the go with Times of India News App. Click here to download it for your device.", "external_links": ["http://www.amazon.in/Fashion-Priyanka-Chopra/dp/B00DJ5Z7RO%3FSubscriptionId%3DAKIAJP4GPDYQHXPFUOWQ%26tag%3Dtimofind-21%26linkCode%3Dxm2%26camp%3D2025%26creative%3D165953%26creativeASIN%3DB00DJ5Z7RO", "https://play.google.com/store/apps/details?id=com.toi.reader.activities", "https://www.facebook.com/TOIEntertain", "https://www.youtube.com/embed/z3xx0lWbkZs", "http://ecx.images-amazon.com/images/I/41Ekm-VI8VL._SL160_.jpg", "http://gaana.com/album/fashion", "https://www.pinterest.com/timesofindia/", "http://ad.doubleclick.net/N7176/adi/TOI/TOI_ENT_ROS_ATF_Artical_Photo_300;sz=300x250;ord=", "https://plus.google.com/u/0/b/107628521107103264647/+TOIEntertainment/posts", "https://twitter.com/TOIEntertain", "https://www.youtube.com/playlist?list=PLzjPDNc5ZgsCeE3cQedGQG8kA_B6yPM9x"], "published": "2015-10-08T20:05:00.000+03:00", "crawled": "2015-10-09T01:27:13.209+03:00", "highlightTitle": ""}