{"organizations": [], "uuid": "e1fa0b671df3c252b2561d62cc6cf3470ce17faf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48524/c", "section_title": "Entertainment - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30189663/abota-presents-courageous-advocacy-award-to-social-justice-attorney-morris-dees", "country": "US", "title": "ABOTA presents Courageous Advocacy Award to social justice attorney Morris Dees", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "ABOTA presents Courageous Advocacy Award to social justice attorney Morris Dees - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "e1fa0b671df3c252b2561d62cc6cf3470ce17faf"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30189663/abota-presents-courageous-advocacy-award-to-social-justice-attorney-morris-dees", "ord_in_thread": 0, "title": "ABOTA presents Courageous Advocacy Award to social justice attorney Morris Dees", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " American Board of Trial Advocates\nDees becomes the fourth recipient of the Courageous Advocacy Award\nDALLAS , Oct. 5, 2015 /PRNewswire-USNewswire/ -- The American Board of Trial Advocates will present its Courageous Advocacy Award to Morris Dees , founder and chief trial attorney of the Southern Poverty Law Center, at the organization's National Board of Directors Meeting in Charleston, SC , on Oct. 10 .\nABOTA presents the award to a judge or advocate anywhere in the world who has demonstrated exemplary courage in the representation of clients and a firm commitment to the rule of law, even at great risk to personal freedom and safety.\nMorris Dees has spent his career protecting society's most vulnerable. The United States was founded on the principles of freedom and liberty for all citizens. Mr. Dees saw first-hand in the South that racial equality did not exist. His efforts to form the Southern Poverty Law Center has had far-reaching effects. Now, decades later, the SPLC continues to be a vital opponent against those who promote hatred and intolerance.\n\"ABOTA applauds Morris Dees and his staff of 75 lawyers for bringing systemic reforms - legally and peacefully - to society,\" said Joel W. Collins, Jr. , president of ABOTA.\n\"Mr. Dees has served as a tireless champion for those who could not defend themselves. He has endured numerous death threats, had his offices burned to the ground, and has opposed some of the most violent hate groups in America. All the while, he has adhered to the rule of law to fight against those who conspire against the very principles that provide freedom in our country,\" Collins said.\nABOTA has presented the Courageous Advocacy Award on three previous occasions. It was presented in 1999 at the ABOTA International Meeting in Florence, Italy , as a collective award to 24 lawyers and judges who gave their lives in the pursuit of justice under the law.\nA second Courageous Advocacy Award was given at the ABOTA International Meeting in 2003 in Belfast, Northern Ireland , in memory of 13 judges, barristers and solicitors who were maimed or murdered while showing extraordinary courage and unwavering commitment to the rule of law during the political and social unrest known as \"the Troubles.\"\nIn 2007, the award was presented to Chinese human rights lawyer Gao Zhisheng, who was not present to accept the award because he was imprisoned in China . Gao has championed the cause of thousands of Chinese citizens forcibly relocated for the construction of a massive dam and reservoir, as well as the families of miners killed in a 2004 coal mine explosion. He has stood for the rights of the members of Falun Gong , a Chinese spiritual practice. He has not been allowed to practice law since 2005.\nABOUT MORRIS DEES :\nMorris Dees co-founded the SPLC in 1971 following a successful business and law career. He started a direct mail sales company specializing in book publishing while still a student at the University of Alabama , where he also obtained his law degree.\nAfter launching a law practice in Montgomery in 1960, he won a series of groundbreaking civil rights cases that helped integrate government and public institutions. He also served as finance director for former President Jimmy Carter's campaign in 1976 and for Democratic presidential nominee George McGovern in 1972. He is known for his innovative lawsuits that crippled some of America's most notorious white supremacist hate groups.\nDees has written three books: A Season For Justice , his autobiography; Hate on Trial: The Case Against America's Most Dangerous Neo-Nazi ; and Gathering Storm: America's Militia Threat . In 1991, NBC aired a made-for-TV movie entitled, \"Line of Fire\" about Dees and his landmark legal victories against the Ku Klux Klan.\nABOUT ABOTA:\nThe American Board of Trial Advocates, founded in 1958, is an organization dedicated to defending the American civil justice system. With a membership of 7,400 experienced attorneys representing both plaintiffs and defendants in civil cases, ABOTA is uniquely qualified to speak for the value of the constitutionally mandated jury system as the protector of the rights of persons and property. ABOTA publishes Voir Dire magazine, which features in-depth articles on current and historical issues related to constitutional rights, in particular the Seventh Amendment right to trial by jury.\nFor more information contact:\nBrian Tyson at (800) 932-2682\nbriant@abota.org\n releases/abota-presents-courageous-advocacy-award-to-social-justice-attorney-morris-dees-300154282.html\n ", "external_links": ["http://www.prnewswire.com/news-releases/abota-presents-courageous-advocacy-award-to-social-justice-attorney-morris-dees-300154282.html", "http://www.xmlnews.org/ns/", "http://rt.prnewswire.com/rt.gif?NewsItemId=DC20218&Transmission_Id=201510051509PR_NEWS_USPR_____DC20218&DateId=20151005"], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-05T23:08:04.683+03:00", "highlightTitle": ""}