{"organizations": [], "uuid": "80f1d929b910c9dae150bbebc4a1c8ab21fed60f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.therepublic.com", "main_image": "http://d1bdhkmqqz901h.cloudfront.net/fit-in/1200x630/filters:fill(white)/cdn1.therepublic.com/tr_assets/images/TheRepublic-Icon-2048x2048.jpg", "site_section": "http://www.therepublic.com/feed/subject/4f9d99dca074de4192b92f4cecd0637a", "section_title": "Media and entertainment News from TheRepublic.com", "url": "http://www.therepublic.com/view/story/c1c23e7af6fe493e845bf287cc6b0856/AS--China-Qigong-Master", "country": "US", "title": "Journalist, others held over case of Chinese spiritual guide", "performance_score": 0, "site": "therepublic.com", "participants_count": 0, "title_full": "Journalist, others held over case of Chinese spiritual guide", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T08:39:00.000+03:00", "replies_count": 0, "uuid": "80f1d929b910c9dae150bbebc4a1c8ab21fed60f"}, "author": "", "url": "http://www.therepublic.com/view/story/c1c23e7af6fe493e845bf287cc6b0856/AS--China-Qigong-Master", "ord_in_thread": 0, "title": "Journalist, others held over case of Chinese spiritual guide", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Chinese journalist, others held over documents in case of disgraced official's spiritual guide \nBy CHRISTOPHER BODEEN Published: 10/20/15 1:38 am EDT - Updated: 10/20/15 1:39 am EDT \nBEIJING — A Chinese journalist and policeman have been detained over accusations of bribery and the leaking of documents relating to the case of a disgraced spiritual guide linked to celebrities and a fallen state minister, state media reports say. \nThe case involving investigative reporter Liu Wei of the state-run Southern Metropolis Daily newspaper has drawn the concern of foreign journalists' advocates about the ability of reporters to do probing work in China. The U.S.-based Committee to Protect Journalists has protested the holding of Liu Wei, saying China is now \"criminalizing basic reporting.\" \nThe policeman, identified only by his surname, Zhong, is suspected of taking bribes in exchange for any help in dropping criminal charges against spiritual master Wang Lin, the official Xinhua News Agency reported. Zhong is suspected of accepting bribes from the ex-wife and a former mistress of Wang, who in turn are suspected of leaking secret documents that could help Wang's case, Xinhua said. \nLiu, who had been reporting extensively on Wang's case, was suspected of involvement with Zhong's illegal activities, Xinhua said, without further detailing the accusations against Liu. \nIt wasn't immediately clear whether the two women were also being held, and law enforcement departments declined to comment on the case. \nWang claims to have supernatural powers as a master of qigong, a traditional combination of meditation, martial arts and Chinese philosophy. He was arrested in August and charged with illegal detention in the kidnapping and grisly murder of a former acolyte. \nCiting a detention notice issued to Liu's family, the Committee to Protect Journalists said Liu has been accused of \"illegally acquiring state secrets,\" an extremely vague charge that can result in a lengthy prison sentence. \n\"The government's interpretation of state secrets has grown so broad that it now encompasses routine criminal justice matters,\" CPJ Executive Director Joel Simon said in a letter of protest. \"Liu Wei must be released and all criminal allegations against him dropped immediately.\" \nXinhua said Liu and Zhong's case was being handled directly by the Ministry of Public Security, in an apparent indication of the seriousness with which it was being regarded. Zhong had been an officer with the police force in the Jiangxi province city of Pingxiang. \nXinhua said a \"responsible person\" from the Southern Metropolis Daily said the paper supported the investigation, had agreed to cooperate and \"believes the law enforcement departments will investigate according to law and handle justly.\" \nHowever, an editor reached at the newspaper's office in the southern city of Guangzhou said no official statement on the case had ever been issued. The editor, who declined to give his name, said the paper was not accepting interviews on the matter. \nThe case underscores the influence of spiritual masters in Chinese political and business life, a phenomenon sometimes blamed for encouraging corruption and abuse of office. \nWang was propelled to fame by reports of his purported mastery of qigong. Wang claimed to be able to conjure up snakes from thin air and to be able to \"poke\" people remotely with his powers of concentration. \nHe drew the wrong sort of attention from authorities after his former disciple Zou Yong was kidnapped and murdered on July 9. Zou had claimed he paid Wang 5 million yuan ($786,000) to become his disciple and that the two were involved in a web of lawsuits and disputes. \nWang had previously been investigated for gun possession, practicing medicine without a license, bribery and fraud, but those investigations were stymied by a lack of evidence, Xinhua said. \nWang once had the trust of former Chinese railways minister Liu Zhijun , who fell in a corruption scandal in 2013 even after Wang gifted him with a rock supposedly imbued with protective powers. Jack Ma , founder of Internet shopping giant Alibaba, and martial arts actor Jet Li also were fans of Wang. \n   ", "external_links": [], "published": "2015-10-20T08:39:00.000+03:00", "crawled": "2015-10-20T09:50:54.456+03:00", "highlightTitle": ""}