{"organizations": [], "uuid": "00ad1de2222a67c24334fe1bd42ca8ae531baf1a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.courant.com", "main_image": "http://www.trbimg.com/img-561e51cc/turbine/hc-bridge-of-spies-local-guy-1014-20151013", "site_section": "http://www.courant.com/entertainment/rss2.0.xml", "section_title": "Entertainment - Hartford Courant", "url": "http://www.courant.com/entertainment/movies/hc-bridge-of-spies-local-guy-1014-20151013-story.html", "country": "US", "title": "Hamden Actor Greg Nutcher In New Tom Hanks' Movie 'Bridge of Spies'", "performance_score": 0, "site": "courant.com", "participants_count": 1, "title_full": "Hamden Actor Greg Nutcher In New Tom Hanks' Movie 'Bridge of Spies'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T15:47:00.000+03:00", "replies_count": 0, "uuid": "00ad1de2222a67c24334fe1bd42ca8ae531baf1a"}, "author": "SUSAN DUNNE", "url": "http://www.courant.com/entertainment/movies/hc-bridge-of-spies-local-guy-1014-20151013-story.html", "ord_in_thread": 0, "title": "Hamden Actor Greg Nutcher In New Tom Hanks' Movie 'Bridge of Spies'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Hamden Actor Greg Nutcher In New Tom Hanks' Movie 'Bridge of Spies' Tom Hanks Walt Disney Studios Motion Pictures \nTom Hanks plays James Donovan in the drama/thriller \"Bridge of Spies.\" \nTom Hanks plays James Donovan in the drama/thriller \"Bridge of Spies.\" (Walt Disney Studios Motion Pictures) Susan Dunne Contact Reporter Greg Nutcher of Hamden tells what it was like acting next to Tom Hanks \nThere's a scene in the new Tom Hanks movie \"Bridge of Spies\" in which Hanks' character is visited at his home by police. The uniformed cops aren't nice to him but their plainclothes supervisor is. Hartford-area film fans who think that the plainclothes guy looks familiar aren't imagining it. Greg Nutcher Courtesy Greg Nutcher Hamden actor Greg Nutcher has been acting in movies for about 12 years now, almost all of them in Connecticut. Hamden actor Greg Nutcher has been acting in movies for about 12 years now, almost all of them in Connecticut. (Courtesy Greg Nutcher) \nThat's Greg Nutcher. He's been acting in movies for about 12 years now, almost all of them in Connecticut. He was in \"Diamond Ruff\" and \"Rising Star,\" both shot in Hartford, and was seen most recently in \"Grandpa's Psycho,\" which was filmed in Stafford Springs and had its world premiere at Parkade Cinemas in Manchester in June. Nutcher also has been in several films produced by Rocky Hill-based Synthetic Cinema International. \nNutcher's role in Steven Spielberg's \"Bridge of Spies\" (in theaters locally Friday, Oct. 16) is only one scene, and the cinematography keeps him in the shadows. Still, going from Insurance City filmmaking to shooting scenes with Hanks and Spielberg is a noteworthy career leap and an experience Nutcher will remember. \nNutcher, 46, lives in Hamden with his wife, Gina, and 13-year-old twins Gregory and Kaitlyn. He auditioned for the role last year. He mentioned during his audition that he was a retired Hamden police detective. \"I sometimes bring it up. I'm not always sure if it hurts or helps,\" said Nutcher, who often plays authority figures. \nWhen he first heard he got the part — in an email from his agent while he was on vacation in Georgia — he didn't believe it and made his agent repeat it. \nNutcher spent a 12-hour day in Brooklyn last fall shooting with the superstars. Nutcher said that, from the start, he was made to feel at ease. \n\"I was very anxious to work with Spielberg and Tom Hanks,\" he said. \"They knew I had anxiety. My assistant brought me to meet Spielberg. He said 'Oh, good, Greg's here, I want to introduce you to Tom.' Tom Hanks couldn't have been nicer. \n\"It brought my anxiety level down to zero,\" he said. \"They know they're huge. They come down to your level and make you feel comfortable.\" \nAnother Connecticut resident in Spielberg's fact-based Cold War espionage drama is Austin Stowell, who graduated from Berlin High School in 2003. Stowell, who got his big break in 2009 in the TV show \"The Secret Life of an American Teenager,\" plays American pilot Francis Gary Powers, who in 1960 was shot down over the Soviet Union. East Hartford-based Pratt & Whitney gets a shout-out, too, in a scene in which Powers and his buddies are shown the CIA spy planes they would be flying over the USSR.", "external_links": [], "published": "2015-10-14T15:47:00.000+03:00", "crawled": "2015-10-15T02:09:09.064+03:00", "highlightTitle": ""}