{"organizations": ["Chelsea Flower Show"], "uuid": "25cb636fbe7c3f1361a6f24b88d852cb8f3d0cfb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.artipot.com", "main_image": "", "site_section": "http://rss.artipot.com/category/163", "section_title": "Artipot: Arts and Entertainment > Photography Articles", "url": "http://www.artipot.com/articles/1941212/simulacra-studio-london-offers-photographic-studio-hire-for-editorial-photography-and-more.htm", "country": "US", "title": "Simulacra Studio London, Offers Photographic Studio Hire for Editorial Photography and More. (studiosi mulacra)", "performance_score": 0, "site": "artipot.com", "participants_count": 0, "title_full": "Simulacra Studio London, Offers Photographic Studio Hire for Editorial Photography and More. (studiosi mulacra)", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T10:03:00.000+03:00", "replies_count": 0, "uuid": "25cb636fbe7c3f1361a6f24b88d852cb8f3d0cfb"}, "author": "", "url": "http://www.artipot.com/articles/1941212/simulacra-studio-london-offers-photographic-studio-hire-for-editorial-photography-and-more.htm", "ord_in_thread": 0, "title": "Simulacra Studio London, Offers Photographic Studio Hire for Editorial Photography and More. (studiosi mulacra)", "locations": ["Brixton East", "Brixton", "London"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By studiosi mulacra Oct 8, 2015 Simulacra Studio is a stylish photographic and video studio located in SW9, minutes from the revamped Brixton Market.It's a venue with a lot of local history being a converted railway arch and part of the former Brixton East station, this means a large industrial architecture lending itself to a spacious shooting area, classy make up room with grand features, overlooking studio balcony and even an adjacent lounge/bar are with pool table.Clients hire Studio One (2000 sq ft) or Studio Two (700 sq ft) inclusive of basic equipment and enough lighting to furnish your shoot, extra kit to an unlimited level is available on request.Simulacra Studio are putting themselves on the map due to their impressive and affordable space, technically excellent in house photographers and due to the prop and scenery construction facility offered on site.This warehouse with power tools enables clients to come and make their own props and sets or commission the Simulacra team to make them. They have skilled makers and designers on hand with a wealth of experience creating builds for plays, festivals, installations and more.This enables clients to think big and create something unusual, instead of just shooting against Colorama or with standard furniture props.Recent examples include a swimwear shoot shot on a purpose built indoor beach complete with sand, palm tree, wooden waves and deckchairs. This was a far more interesting studio landscape than shooting a model against a white background.The Simulacra team includes renowned photographer www.francoisboutemy.com commended for his work in fashion, product, editorial, lifestyle and portraiture.Francois has a knack of coming up with shoot concepts and furnishing them on a fair budget, he can present something lavish with elements sourced from theatrical hire, chandlers, builders merchants, antique dealers or artists, the studio has a long list of contacts for borrowing, rental or collaboration.This is especially useful when shooting for editorial content, it'll add that unique, one off individualism which is vital, especially in getting a shoot noticed, promoted and circulated.Sets and props aren't exclusive to editorial pieces of course, recently Simulacra Studio has utilised editorial elements to shoot PR images for business, in particular making a giant swing decorated with flower garlands for a company involved in the Chelsea Flower Show, shooting underwater, high speed photography shooting paint explosions and various 'levitation' shoots where supporting props are removed in photoshop leaving the model falling in mid air.Simulacra Studio is actually a complex of 4 studios plus the prop warehouse and for 2016 they hope to extend into another building to create a designated product studio.The studio operates from 10am-6pm weekdays and weekends with extra time available on request.The studio and fully licensed bar are also available to hire for events with a mean cocktail menu, 250 guest capacity, soundsystem, staging, seating, lighting and sound engineers and more.Regular event hire clients host birthday parties, club nights, theatre, wine tasting, cabaret, book and product launches.They're always keen to discuss shoot ideas and the logistics for creating something striking memorable and unusual so do get in touch to discuss your requirements. About the Author Simulacra Studio is a state of the art creative place. Photo studio for hire in London is available. Hire photo studio in London , and make difference to your portfolio. To know more on the services offered by Simulacra Studio, click on: www.Simulacrastudio.com Rating:", "external_links": [], "published": "2015-10-08T10:03:00.000+03:00", "crawled": "2015-10-09T07:55:26.333+03:00", "highlightTitle": ""}