{"organizations": [], "uuid": "fa4fbf58825568d94ed66a8082342e1537c04dce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.industriesnews.net", "main_image": "", "site_section": "http://www.industriesnews.net/rss.php/?ind=entertainment", "section_title": "industriesnews.net  - Breaking Entertainment News latest RSS headlines", "url": "http://www.industriesnews.net/story?sid=s237443363&ampcid=55", "country": "US", "title": "In South Africa Gospel Music Reigns Supreme", "performance_score": 0, "site": "industriesnews.net", "participants_count": 0, "title_full": "In South Africa Gospel Music Reigns Supreme", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T16:00:00.000+03:00", "replies_count": 0, "uuid": "fa4fbf58825568d94ed66a8082342e1537c04dce"}, "author": "", "url": "http://www.industriesnews.net/story?sid=s237443363&ampcid=55", "ord_in_thread": 0, "title": "In South Africa Gospel Music Reigns Supreme", "locations": ["South Africa"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "In South Africa, Gospel Music Reigns Supreme \nEntertainment Industry News.Net : Thursday 8th October, 2015 \nJOHANNESBURG - What is the most listened-to music in South Africa? Is it Ramp;B, like in many other African countries? Or maybe pop music, like in most parts of the world? Or maybe homegrown kwaito? Wrong. Research by international entertainment company Havas Sports and Entertainment has yielded what for some South Africans is a surprising result. \nAs the sounds of American Ramp;B superstar R. Kelly wash over patrons at a Johannesburg bar, many patrons think they can name South Africa's most popular music genre. \n\"I would definitely say house music,\" guesses one man. \n\"I would also say house music, but there's also a lot of Ramp;B and hip hop. If you go into any club you'd see there's a lot of hip hop,\" offers another. \nOther patrons mentioned deep house and traditional music, but few correctly identified the country's most popular genre. \nThe international entertainment company Havas Sports and Entertainment surveyed thousands of music lovers all over the world. It found that 13 percent of South Africa's population enjoys listening to Christian gospel songs, which is more than three times the global average of four percent. \n\"Mostly these days, people are becoming more spiritual, so they like gospel music,\" said Sophie Ntlaza. \nAmong pedestrians in Johannesburg, the overwhelming reaction to the survey's results is one of astonishment. \n\"Are you serious? Gospel?\" said one man, after being told of its popularity. \"I would have never expected that!\" \nBut music historian Evans Netshivhambe said he could \"easily\" have predicted that gospel would emerge tops. \n\"Most South Africans, they're very religious; Christians if I may say. As religious people, the music that they can relate to, it's gospel music,\" he said. \nHe said another reason for gospel's popularity here is historical: it was used as a voice against apartheid. \n\"Most black people found gospel music as the best way of expression of how they can tell the world who they are, you know, how they feel about their lives and what they've gone through,\" said Netshivhambe. \nMuch of modern South African gospel rails against ills such as violent crime. And, as Netshivhambe said, South Africans, influenced by decades of gross inequality in their society, love a good protest. More Entertainment Industry News  ", "external_links": [], "published": "2015-10-08T16:00:00.000+03:00", "crawled": "2015-10-09T08:57:02.228+03:00", "highlightTitle": ""}