{"organizations": [], "uuid": "29dcdfec6d9e0cad23671369d9d6153b13f1747c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.aceshowbiz.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Aceshowbizcom-EntertainmentNews", "section_title": "Aceshowbiz.com - Entertainment News", "url": "http://www.aceshowbiz.com/news/view/00089665.html", "country": "US", "title": "Bobby Brown Announces Memoir Following Daughter's Death", "performance_score": 0, "site": "aceshowbiz.com", "participants_count": 1, "title_full": "Bobby Brown Announces Memoir Following Daughter's Death", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T19:18:00.000+03:00", "replies_count": 0, "uuid": "29dcdfec6d9e0cad23671369d9d6153b13f1747c"}, "author": "AceShowbiz.com", "url": "http://www.aceshowbiz.com/news/view/00089665.html", "ord_in_thread": 0, "title": "Bobby Brown Announces Memoir Following Daughter's Death", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments The New Edition singer says writing helped him go through 'one of the most agonizing traumas' after the death of Bobbi Kristina Brown. \nBobby Brown is going to tell all in an upcoming memoir called \"My Prerogative\". \"Right after I signed on to write my story, I went through one of the most agonizing traumas I had ever experienced with the death of my daughter,\" he said, referring to Bobbi Kristina Brown , his only child with Whitney Houston . \"But I was surprised by how therapeutic it was to work on this project, to look at the entire arc of my life and to realize that although there has been considerable pain, I have also been incredibly blessed,\" he added. \"I hope my fans and other readers of this book will be entertained by this trip into the crazy, exciting, fascinating world of Bobby Brown. And I hope they will feel that I have been as honest and open with them in these pages as I have tried to be my entire life.\" According to the publisher Dey Street Books, the book will be \"raw and unvarnished.\" It's promised to \"tell the full story of his life and set the record straight, particularly about his relationship with Whitney Houston.\" The company adds, \"My Prerogative is the story of a man who has been on the top of the mountain and in the depths of the valley and who is now finally ready to talk about his career and family life, from the passion and the excess to his creative inspirations and massive musical success.\" \n© AceShowbiz.com", "external_links": [], "published": "2015-10-13T19:18:00.000+03:00", "crawled": "2015-10-13T21:42:39.349+03:00", "highlightTitle": ""}