{"organizations": [], "uuid": "5b81c00fb418dae486888762e9921058bb708d6d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://images.canberratimes.com.au/2015/09/29/6887592/Thumbnail1000900769gjx8vgimage.related.thumbnail.320x214.gjwrz5.png1443865863561.jpg.jpg", "site_section": "http://feeds.canberratimes.com.au/rssheadlines/entertainment.xml#", "section_title": "Canberra Times Entertainment Headlines", "url": "http://www.canberratimes.com.au/entertainment/stage/the-spirit-is-stayin-alive-as-velvet-unites-marcia-hines-brendan-maclean-in-disco-celebration-20150929-gjwrz5.html", "country": "AU", "title": "The spirit is stayin' alive as Velvet unites Marcia Hines, Brendan Maclean in disco celebration", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "The spirit is stayin' alive as Velvet unites Marcia Hines, Brendan Maclean in disco celebration", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T17:15:00.000+03:00", "replies_count": 0, "uuid": "5b81c00fb418dae486888762e9921058bb708d6d"}, "author": "Elissa Blake", "url": "http://www.canberratimes.com.au/entertainment/stage/the-spirit-is-stayin-alive-as-velvet-unites-marcia-hines-brendan-maclean-in-disco-celebration-20150929-gjwrz5.html", "ord_in_thread": 0, "title": "The spirit is stayin' alive as Velvet unites Marcia Hines, Brendan Maclean in disco celebration", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Marcia Hines shows Brendan Maclean how it's done in Velvet. Photo: Tony Virgo \nBrendan Maclean didn't start out as a disco bunny. He's more of a pop-folk, ukulele kind of guy. But since he was cast in Velvet , his first theatre show, he has found his inner dancing queen and a new stage mother – Marcia Hines.\n\"When I started Velvet I had a hard time looking Marcia in the eyes, I was so nervous,\" Maclean says. \"I grew up with her on Australian Idol and disco is her thing, man. She is the queen and I am just some kid. But now she is my best friend on tour, she's like my mother; we go op-shopping together and she phones me up in the morning saying, 'Brendan, get up, I'll take you for a drive'. It's so cool.\"\nVelvet is a new cabaret-circus-concert hybrid from Craig Ilott, the director of shows such as Smoke and Mirrors and Hedwig and the Angry Inch .\nIn Velvet, the audience enters a disco loosely based on Studio 54 in New York City. Photo: Supplied \nIn Velvet , the audience enters a disco, loosely based on Studio 54 in New York City, with a DJ pumping out disco hits from the Bee Gees, Donna Summer and Chic.\nAdvertisement Maclean plays an innocent young man who stumbles into a glittering world of strongmen, hula-hoopers and burlesque stars on the way to \"finding his inner fabulousness\", according to one enthusiastic critic at the Edinburgh Fringe Festival, where the show earned five-star reviews and standing ovations in August.\nMaclean and Hines – who plays Maclean's fairy godmother in the show – sing solo songs and two duets; Donna Summer's No More Tears (Enough is Enough) and a medley of Chic's Thinking of You , The Real Thing's You To Me Are Everything , and Hines' own 1970s disco hit You . Maclean later brings the house down with an unplugged version of the Bee Gees' Stayin' Alive , played on his trusty uke.\nA young man stumbles into a glittering world of strongmen, hula-hoopers and burlesque stars in Velvet. Photo: Supplied \nVelvet is a theatre debut for Maclean, who grew up in Cronulla wanting to be a ballet dancer. He's played the singing, organ-playing Klipspringer in Baz Luhrmann's The Great Gatsby , worked behind the microphone at Triple J, released a number of indie-pop songs, and has a massive following on Twitter.\nBut acting a role – even one as musically inclined as this – has been a steep learning curve, Maclean admits.\n\"I've been an indie-folk artist used to playing just three gigs a week and now I'm doing 14 theatre performances a week. It's a total change in my world,\" he says. \"But Marcia is used to it because she grew up doing Hair and Jesus Christ Superstar . She's been giving me a few tips like making eye contact with each person in the audience or focusing on one person.\"\nHines says she is relishing the chance to relive her disco years. She has recently recorded a session of disco hits for the ABC's Rage with Maclean and the original cast recording of Velvet was released on iTunes this week.\n\"I just love Brendan. He is such a fine singer and we are having a lot of fun together,\" says Hines. \"I lived through that disco era with all the crazy fashions and the dancing. That was my time! It was a time of great positivity after the Vietnam War. Those songs and the disco era make people feel so happy. For me, I just love Donna Summer, who is not with us any more, so this show feels like a tribute to her.\"\nHines says audiences should expect to party. \"It is going to be super fun! Bring a few girlfriends and have a ball,\" she says. \"People you wouldn't expect – even guys – are really getting into it. I've seen them standing on their chairs hooting and hollering. That's just great. Everyone loves disco.\"\n \nVelvet plays at the Sydney Opera House from October 6-November 1. Tickets $35-$89, bookings (02) 9250 7777, sydneyoperahouse.com", "external_links": [], "published": "2015-10-03T17:15:00.000+03:00", "crawled": "2015-10-03T18:39:19.939+03:00", "highlightTitle": ""}