{"organizations": [], "uuid": "4cc698fd4230ce30cf8ea832a036c78f7c2fb4df", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pr.com", "main_image": "", "site_section": "http://www.pr.com/news-by-category/8", "section_title": "Arts &amp; Entertainment: Music Press Releases and News - PR.com", "url": "http://www.pr.com/press-release/639448", "country": "US", "title": "Maverick Musician Brazenly Busking the USA in Rebellion", "performance_score": 0, "site": "pr.com", "participants_count": 1, "title_full": "Maverick Musician Brazenly Busking the USA in Rebellion - PR.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "4cc698fd4230ce30cf8ea832a036c78f7c2fb4df"}, "author": "PR.com", "url": "http://www.pr.com/press-release/639448", "ord_in_thread": 0, "title": "Maverick Musician Brazenly Busking the USA in Rebellion", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Maverick Musician Brazenly Busking the USA in Rebellion\nSinger-songwriter Shanta Paloma embarks on her Guerrilla Gigs Tour Across The United States of America.\nHolyoke, MA, September 30, 2015 --( PR.com )-- Indie Soul Rock Singer-Songwriter Shanta Paloma is setting out on tour, brazenly busking 27 major cities and national landmarks in The United States of America. Starting from Massachusetts and making her way along Rt. 66 to the west coast and back, Shanta will be spontaneously singing & strumming her songs. “If I can’t hop on the bill as an opening act, or as an opener to the opening act at my venues of choice, I’ll perform on the sidewalk for the entrance line!”\nThis adventure will be videotaped and shared via Paloma’s Youtube Channel: www.Youtube.com/ShantaPaloma and her website, www.ShantaPaloma.com.\n“The whole project is a demonstration not only on following one’s bliss, but also on how the music industry has changed so drastically, since social media networks and online distribution,” Paloma said. “The music industry rules keep changing as fast as it takes us musicians to catch on. We are also our own PR reps, booking agents, marketing firms, managers, promoters, sound guys, roadies & web designers. Now, more than ever, we artists must create something out of nothing. And that can take away resources from making Quality art! There are the rules that never change — Share Good Music. I’ve been successful where I am, but my new business model is to share my music guerrilla, grassroots style.” Read more at www.ShantaPaloma.com/blog.\n“What better way for me to do this than to traverse this great land we have – the land of the free & the brave? Well, though I’m scared, I’m going to just go and tour. I mean, why not?!! The Guerrilla Gigs Tour is about music from my heart & soul, shared directly on the streets with people all across America. If I can help one person feel catharsis; entertain and raise the mood of just one person; then, I’ve helped humanity in some way. Why can’t it be just as simple as that? I believe in sharing resources and this is what I have to offer. Also, that is why my tour is also, in part, to support Oxfam International.”\nMaverick musician, Shanta Paloma embarks on her voyage in Boston, on October 4th, 2015. She will be headed northwest, down California and then back to New England, via the southern route. For up to date information on where and when Shanta will be touring, visit her website often: www.ShantaPaloma.com. Follow her journey by subscribing to her Youtube channel: http://www.youtube.com/ShantaPaloma.", "external_links": ["http://www.youtube.com/ShantaPaloma."], "published": "2015-09-30T03:00:00.000+03:00", "crawled": "2015-10-01T07:57:02.134+03:00", "highlightTitle": ""}