{"organizations": [], "uuid": "6d5bf6c90d41bb63bc6a0cb864dd03e976b4898d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.artipot.com", "main_image": "", "site_section": "http://rss.artipot.com/category/7", "section_title": "Artipot: Arts and Entertainment > Humor Articles", "url": "http://www.artipot.com/articles/1945278/why-every-kid-should-read-tales-of-akbar-and-birbal.htm", "country": "US", "title": "Why Every Kid Should Read Tales of Akbar and Birbal (Bijayani swain)", "performance_score": 0, "site": "artipot.com", "participants_count": 0, "title_full": "Why Every Kid Should Read Tales of Akbar and Birbal (Bijayani swain)", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T10:03:00.000+03:00", "replies_count": 0, "uuid": "6d5bf6c90d41bb63bc6a0cb864dd03e976b4898d"}, "author": "", "url": "http://www.artipot.com/articles/1945278/why-every-kid-should-read-tales-of-akbar-and-birbal.htm", "ord_in_thread": 0, "title": "Why Every Kid Should Read Tales of Akbar and Birbal (Bijayani swain)", "locations": ["Bijayani", "India"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Birbal", "Bijayani Swain", "Akbar", "Bijayani"], "text": "By Bijayani swain Oct 19, 2015 Story time is the perfect means to build a relationship with your kids and a story each day can help your kids to learn a language in a fun and relaxed manner. From early days, showing young babies a picture book and labeling an object by name has helped children to learn may everyday items. Bedtime stories have always been everyone's favorite during childhood days and the tales of Akbar and Birbal have delighted kids and adults across India for many generations. These tales are not only amusing and charming, but they are real stories of a wise man, Birbal, who lived in the palace of the Emperor Akbar.The tales of Akbar and Birbal have taught us various realities of life and how to handle critical situations and meet the challenges of daily life. All the narrations are not fictional, but they are realities that represent the then Indian times. Birbal was the most trusted advisor of Akbar and was popular for his wit and wisdom. What do the tales teach? The tales follow a similar pattern. There is either a question or a puzzle posted by the Emperor and no listener or reader is aware of the answer. It is only Birbal who uses his intelligence to solve the puzzle and even the Emperor is left looking stupid at times. Everyone tends to admire Birbal for his wit and charm and the way he comes up with the answer for each question. In all the stories, Birbal is represented as someone who has a good moral sense while Akbar is shown to require guidance in governance matters. All the narratives of Akbar and Birbal explain a plot and highlight how the clever minister with his wisdom outwitted the goons. The stories are great means to explain difficult concepts of life to little kids and make them aware that evil exists in the world too. All the tales reflect the morals and help kids understand the typical problems of life and prepare them to handle them wisely. These stories have been in circulation for several centuries throughout the country and not only kids, but adults also have enjoyed the mature overtone of some of the tales.The stories of Akbar and Birbal help kids to gain an understanding of various situations and the corresponding emotions they might feel. The beauty of the story lies in the fact that each tale has a moral to learn and helps the child to have a vivid imagination. Today, the stories can be easily read online or videos and CDs are also available that contain the entire collection of Birbal stories. So, if you want your kids to develop a reading habit, then buy them some good collection of these story books and see how easily they start enjoying reading. The tales not only help them to understand the daily problems of life, but also help them to get acquainted with the Indian heritage and culture. About the Author Bijayani Swain is an expert author and she has written so many articles related to parenting, raising a baby etc. In this article she described why every child must read Tales of Akbar and Birbal. Rating:", "external_links": [], "published": "2015-10-19T10:03:00.000+03:00", "crawled": "2015-10-19T15:00:51.921+03:00", "highlightTitle": ""}