{"organizations": [], "uuid": "440f21d3bf5f0a4d64b5030d0b90e0810a4ae4e3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nydailynews.com", "main_image": "http://assets.nydailynews.com/polopoly_fs/1.2402326!/img/httpImage/image.jpg_gen/derivatives/landscape_1200/conflead19f-2-web.jpg", "site_section": "http://www.nydailynews.com/entertainment/index.html", "section_title": "Entertainment News &amp; Reviews - NY Daily News", "url": "http://www.nydailynews.com/entertainment/gossip/confidential/hef-soft-playboy-pg-13-article-1.2402327", "country": "US", "title": "Hugh Hefner goes soft as Playboy goes PG-13", "performance_score": 0, "site": "nydailynews.com", "participants_count": 1, "title_full": "Hugh Hefner goes soft as Playboy goes PG-13 - NY Daily News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "440f21d3bf5f0a4d64b5030d0b90e0810a4ae4e3"}, "author": "NEW YORK DAILY NEWS", "url": "http://www.nydailynews.com/entertainment/gossip/confidential/hef-soft-playboy-pg-13-article-1.2402327", "ord_in_thread": 0, "title": "Hugh Hefner goes soft as Playboy goes PG-13", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Charley Gallay/Getty Images for Playboy Hugh Hefner attends Playboy Mansion's Annual Halloween Bash at The Playboy Mansion on October 25, 2014. Hugh Hefner is becoming impotent — at least as far as his magazine goes, sources tell Confidenti@l.\nWe’re told the velvet-clad editor in chief has long been opposed to the idea of Playboy going “non-nude,” and insiders say last week’s announcement that its models will no longer be naked is a sign that Hef’s grip is weakening.\nA former staffer tells us that the berobed boss has been resisting a push in that direction for about five years.\nIn fact, we’re told that after chief marketing officer Kristen Patrick was hired in 2011, a faction of staffers made a desperate bid to modernize the monthly by secretly planning a non-nude issue, hoping to get enough momentum behind it to get it onto shelves.\n“I think that they wanted to get it off the ground,” said an insider, “but someone went behind their back and told Hef, and it was obviously killed.”\n“That was back when they had that CMO (Patrick) who was supposed to be really cutting-edge and going to make it a fashion brand,” added the insider. Patrick has since moved on to the decidedly less racy PepsiCo.\nWhile The New York Times has reported that the 89-year-old Hefner, who launched the groundbreaking magazine in 1953, “agreed” to take the famous naked ladies off its pages , the insider said, “I think that this is not at all what Hef wants.”\nA second insider familiar with the drooping organ said of Hefner, “His whole thing — everything he’s worked for and started — is being torn down.”\n“(Playboy) used to splash on the scene with its covers and now it’s not taking any risks at all,” the insider added. “I’m sure he’s not liked the direction of anything the magazine has done in the past five to 10 years.”\nAnother media insider put it more bluntly, wondering, “I don’t know why they didn’t just wait until he dies.”\nIn the press release last Tuesday, it was announced that as of the March issue, Playboy, “for the first time in its history, will no longer feature nudity in its pages.” The release added, “Playboy will continue to publish sexy, seductive pictorials of the world’s most beautiful women, including its iconic Playmates.”\nIt Quote: d Playboy Enterprises CEO Scott Flanders as saying, “The political and sexual climate of 1953, the year Hugh Hefner introduced Playboy to the world, bears almost no resemblance to today.”\nHefner was not Quote: d in the release.\nReps for both Playboy and Hefner didn’t respond to requests for comment.\nRelated Gallery: View Gallery Iconic Playboy magazine covers Related Stories Playboy will no longer feature naked women Got some hot gossip for us?\nTipline: 212-210-1616\nE-mail: confidential@nydailynews.com", "external_links": ["http://www.nytimes.com/2015/10/13/business/media/nudes-are-old-news-at-playboy.html?_r=0"], "published": "2015-10-19T03:00:00.000+03:00", "crawled": "2015-10-19T10:12:44.208+03:00", "highlightTitle": ""}