{"organizations": [], "uuid": "4ccb32239e19a2508e47fdcb3f37e088e6dbf97c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.india.com", "main_image": "http://s3.india.com/wp-content/uploads/2015/10/rape12.jpg", "site_section": "http://www.india.com/feed/", "section_title": "India | Latest India News | Get Free India.com Email | Live Cricket and Entertainment News at India.Com", "url": "http://www.india.com/news/india/4-year-old-child-rape-case-delhi-police-clueless-about-attacker-620722/", "country": "US", "title": "4 year old Child Rape Case: Delhi Police clueless about attacker", "performance_score": 0, "site": "india.com", "participants_count": 1, "title_full": "4 year old Child Rape Case: Delhi Police clueless about attacker", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T13:05:00.000+03:00", "replies_count": 0, "uuid": "4ccb32239e19a2508e47fdcb3f37e088e6dbf97c"}, "author": "Wires English | Indo-Asian News Service", "url": "http://www.india.com/news/india/4-year-old-child-rape-case-delhi-police-clueless-about-attacker-620722/", "ord_in_thread": 0, "title": "4 year old Child Rape Case: Delhi Police clueless about attacker", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "4 year old Child Rape Case: Delhi Police clueless about attacker By Indo-Asian News Service on October 11, 2015 at 3:35 PM Comments New Delhi, Oct 11: It has been two days since a four-year-old girl was found raped in the national capital but Delhi Police are still clueless and hoping that the girl may give them some clue about her attacker.The child was found lying in a pool of blood by a passerby near a railway track in north Delhi’s Keshav Puram area around 7 p.m. on Friday, hours after she went missing from her house. (Read: Majority of gold from Dubai and Singapore smuggled into India) \n“We have registered a case under sections Protection of Children from Sexual Offences (POSCO) Act and a manhunt has been launched to arrest the accused, who is yet to be identified,” a police official said.The official said that police have detained some suspected people and hope the real culprit would be caught soon. \nAccording to the official, the investigators are handicapped as the victimised child is not in a condition to give any statement.”We can arrest the attacker easily if the girl gives us some clue about the culprit,” the official said.Meanwhile, Delhi Commission for Women (DCW) chairperson Swati Maliwal met the child at the hospital. \n“Visited the little girl, her condition can’t be described. Horrific. Her parents are extremely poor. When will this heinous crime stop in Delhi (sic),” Maliwal tweeted.”In 2014, only nine accused were convicted in Delhi in crime against women. Can you imagine! Tabhi to Delhi mei kisi ko darr nahi hai (That’s why no one is scared in Delhi),” she tweeted. \nThe police official said that the girl was bleeding profusely when she was found by the railway tracks. “She was rushed to Mahavir Hospital from where she was referred to Safdarjung Hospital. She is undergoing treatment,” police said.”The girl is sexually assaulted. She is still in pain, but she is conscious and out of danger,” said Safdarjung Hospital medical superintendent A.K. Rai. \nHe added that the girl was brought to Safdarjang Hospital around 8 p.m. on Friday with injuries on her private parts.Police said the girl, whose father is a painter, was playing outside her house when she went missing.”The victim’s family members approached police after they failed to find her,” said a police official. \n  3:35 PM Topics:", "external_links": [], "published": "2015-10-11T13:05:00.000+03:00", "crawled": "2015-10-11T14:00:00.354+03:00", "highlightTitle": ""}