{"organizations": [], "uuid": "be320cb468e052b49535f64d9553b203f86ff614", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/278850/arts-entertainment", "section_title": "Arts &amp; Entertainment - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30291446/shrewsbury-teen-draws-huge-crowds", "country": "US", "title": "Shrewsbury Teen Draws Huge Crowds!", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Shrewsbury Teen Draws Huge Crowds! - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T11:55:00.000+03:00", "replies_count": 0, "uuid": "be320cb468e052b49535f64d9553b203f86ff614"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30291446/shrewsbury-teen-draws-huge-crowds", "ord_in_thread": 0, "title": "Shrewsbury Teen Draws Huge Crowds!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "DJ Josh Bernstein makes mark in EDM world.\nThis article was originally distributed via 24-7 Press Release Newswire. 24-7 Press Release Newswire, WorldNow and this Site make no warranties or representations in connection therewith. SHREWSBURY, MA, October 19, 2015 /24-7PressRelease/ -- St. John's High School senior, Josh Bernstein, doesn't spend his weekends hanging out at the Solomon Pond Mall or melting into the couch. Instead, he DJs at some of the country's hottest venues on some of the most popular EDM tours.\nDJ Josh Bernstein has spun at The House of Blues in Anaheim, California, at Club Avalon in Hollywood - twice, and for the \"I'm Shmacked\" tour at Amazura in New York City. Most recently, 17-year-old Bernstein co-headlined the huge EDM branded event, \"Life in Color\", held at the DCU Center in Worcester. Bernstein pumped up the crowd of several thousands ahead of DJ Carnage.\nBernstein has made quite a name for himself in the industry, too. He has DJ'd for Columbia Records recording artist Samantha J, and has won international contests with his remixes. When he was last in Los Angeles, Bernstein even spent time in the studio with producers RedOne and R. City. \"You can tell when someone really young is going to be doing big things in the industry. Josh Bernstein is one of those rare people who you just know is going to be a force,\" says RedOne, the Grammy award winning producer who made all the biggest hits for Lady Gaga and so many other major stars.\nHe isn't just a force on-stage, though. Bernstein takes part in local community service activities, and is enrolled in honors courses at the challenging private high school in Shrewsbury.\nTo close out the year, DJ Josh Bernstein has been asked to attend several gigs - one of them includes performing as a part of Winter Lights 3 on December 6th in Los Angeles. After walking the red carpet, Bernstein will DJ the event, and then take the redeye from LA to Boston to catch school at St. John's the very next day.\nInformation contained on this page is provided by an independent third-party content provider. WorldNow and this Station make no warranties or representations in connection therewith. If you have any questions or comments about this page please contact pressreleases@worldnow.com.\nFor the original version on 24-7 Press Release Newswire visit: http://www.24-7pressrelease.com/press-release/shrewsbury-teen-draws-huge-crowds-414264.php", "external_links": ["http://purl.org/rss/1.0/modules/content/", "http://www.24-7pressrelease.com/press-release/shrewsbury-teen-draws-huge-crowds-414264.php"], "published": "2015-10-19T11:55:00.000+03:00", "crawled": "2015-10-19T11:08:47.827+03:00", "highlightTitle": ""}