{"organizations": [], "uuid": "8e809e134f5fac71099b2d9741d74a0b8bff417d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.india.com", "main_image": "http://s3.india.com/wp-content/uploads/2015/10/internet4.jpg", "site_section": "http://www.india.com/feed/", "section_title": "India | Latest India News | Get Free India.com Email | Live Cricket and Entertainment News at India.Com", "url": "http://www.india.com/news/world/middle-east-set-to-become-world-leader-in-internet-devices-643166/", "country": "US", "title": "Middle East set to become world leader in Internet devices", "performance_score": 0, "site": "india.com", "participants_count": 1, "title_full": "Middle East set to become world leader in Internet devices", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T12:12:00.000+03:00", "replies_count": 0, "uuid": "8e809e134f5fac71099b2d9741d74a0b8bff417d"}, "author": "Wires English | Press Trust of India", "url": "http://www.india.com/news/world/middle-east-set-to-become-world-leader-in-internet-devices-643166/", "ord_in_thread": 0, "title": "Middle East set to become world leader in Internet devices", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments Dubai, Oct 19: The Middle East is set to become the world leader in devices and consumer products connected to the Internet and expected to generate a revenue of USD 270 billion this year, according to a new research. ”Middle East organisations are ideally placed to become leaders in Internet of Everything innovation. The Middle East and Africa is set to post the world’s second-fastest growing ICT market in 2015, reaching USD 270 billion,” according to International Data Corporation, a market research, analysis and advisory firm. (Read: Two killed, over 20,000 displaced in Philippines typhoon) Internet of Everything is a broad term that refers to devices and consumer products connected to the Internet and outfitted with expanded digital features. ”Longer-term, the Middle East’s IT market is set to grow by 23 per cent, from USD 204 billion in 2014 to USD 252 billion in 2019, according to Gartner, an American information technology research and advisory firm. Middle East is also engaging in digital transformations with application of Internet of Things in drones, robotics, and 3D printing that can transform the region’s business. “More than ever, Middle East businesses are engaging in digital transformations, as the Internet of Things is no longer a theory, but is impacting our daily lives and business practices,” said Trixie LohMirmand, Senior Vice President, Dubai World Trade Centre. The 35th edition of GITEX Technology Week – the leading Information and communications technology (ICT) event in the Middle East, Africa and South Asia opened yesterday, featuring the latest in innovative IoT solutions, especially in drones, robotics, and 3D printing that can transform the region’s businesses. In tandem with the Year of Innovation, the GTX Horizons Zone will showcase leading edge demonstrations of next generation disruptive technologies across 3D printing, autonomous vehicles, drones and robotics. \n  2:42 PM Topics:", "external_links": [], "published": "2015-10-19T12:12:00.000+03:00", "crawled": "2015-10-19T12:50:51.336+03:00", "highlightTitle": ""}