{"organizations": [], "uuid": "348447b5b1243a21f739e6f90c6160e0b049fc16", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "savannahnow.com", "main_image": "http://savannahnow.com/sites/default/files/14820379.jpg", "site_section": "http://savannahnow.com/", "section_title": "savannahnow.com | Savannah Georgia's source for News, Entertainment, Sports, Weather, Classifieds, Jobs, Autos, Real Estate and St. Patricks Day", "url": "http://savannahnow.com/sports/2015-10-18/georgias-mark-richt-ugas-richt-offensive-issues-coming-down-basics", "country": "US", "title": "Georgia's Mark Richt: UGA's Richt: Offensive issues coming down to 'basics'", "performance_score": 0, "site": "savannahnow.com", "participants_count": 1, "title_full": "Georgia's Mark Richt: UGA's Richt: Offensive issues coming down to 'basics' | savannahnow.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T15:29:00.000+03:00", "replies_count": 0, "uuid": "348447b5b1243a21f739e6f90c6160e0b049fc16"}, "author": "Marc Weiszer", "url": "http://savannahnow.com/sports/2015-10-18/georgias-mark-richt-ugas-richt-offensive-issues-coming-down-basics", "ord_in_thread": 0, "title": "Georgia's Mark Richt: UGA's Richt: Offensive issues coming down to 'basics'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photos John Bazemore/The Associated Press\nGeorgia head coach Mark Richt celebrates after derating Missouri 9-6 on Saturday in Athens.\nBy Marc Weiszer\nATHENS — Mark Richt was asked on his Sunday teleconference about whether Georgia’s offense needed a drastic fix or just minor changes before its next game against Florida on Oct. 31.\n“Aaah, man,” the Bulldogs coach said a day after Georgia’s 9-6 win against Missouri, the first time his team went without a touchdown since a 10-6 loss to UCF in the 2010 Liberty Bowl. “It really goes down to the basics, you know. We’ve got to block better. When you say blocking, people always think offensive line. Tight ends block, too, and running backs block and wide receivers block. If you don’t block, it’s hard to succeed offensively. It’s hard to get the ball through the line of scrimmage and it’s hard once you get through only have one guy to maybe make miss if you’re not blocking well in the perimeter.”\nRicht said Georgia had both good blocking and bad blocking on perimeter screens, something the Bulldogs relied on heavily against Missouri.\n“It’s hard to be consistent unless you block well, and I think it all starts with that,” he said. “Obviously, there’s some route running that could be more crisp, there’s some balls that could be placed better. We’ve caught the ball pretty good when the ball was within range so that’s good, We’ve just got to get better in all of those things.”\nHe added later: “We have the right things schematically. We’ve just got to be able to execute them.”\nRicht on assessing quarterback Greyson Lambert after seven games:\n“It’s been up and down, no doubt. It’s pretty obvious to see there’s been some really spectacular moments and some not so spectacular. It’s kind of part of the process sometimes. Even though he’s a veteran quarterback, he’s brand new to this system and brand new to Georgia and brand new to the SEC. A lot of firsts for him. Overall, he’s worked hard for us, he’s put himself in position to play. ... It’s been a little bit up and down, but that’s pretty much true most everybody on the team.”\nThe Virginia graduate transfer is fourth in the SEC in completion percentage (64.1), fourth in passing efficiency (149.3) and 10th in passing yards per game (182.3)\nInjury notes\n• Freshman defensive lineman Trenton Thompson “tweaked” an ankle, but Richt said it wasn’t severe.\n“He may not even miss a practice,” Richt said.\n• Nose guard Chris Mayes didn’t play against Missouri because he was bothered by a knee injury, Richt said.\n“We decided not to use him,” Richt said.\n• Tailback Sony Michel sustained a groin injury during the week of practice leading up to the Missouri game.\n“He came through with that very well,” Richt said. “Now we’ve got a couple of weeks. We’ll be sure to rest these guys and get them in position to be as healthy and rested as possible and still have that balance of being prepared as well.”", "external_links": ["http://sav-cdn.com/sites/default/files/imagecache/story_slideshow_thumb/14820379.jpg", "http://sav-cdn.com/sites/default/files/imagecache/superphoto/14820379.jpg", "http://sav-cdn.com/sites/all/themes/savannahnow/images/blank.gif"], "published": "2015-10-18T15:29:00.000+03:00", "crawled": "2015-10-19T14:17:27.341+03:00", "highlightTitle": ""}