{"organizations": ["BBC", "Michaela Tsuen"], "uuid": "56fb0466a8b2451039ac07a16f813051d8ef7930", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.channel24.co.za", "main_image": "http://cdn.24.co.za/files/Cms/General/d/666/b5ff8ca28d0b4175b961206879568be1.jpg", "site_section": "http://feeds.news24.com/articles/channel/topstories/rss", "section_title": "Channel Entertainment", "url": "http://www.channel24.co.za/TV/News/Star-bakers-special-ingredient-steals-the-show-on-SA-Bake-Off-20151022", "country": "ZA", "title": "Channel24.co.za | Star baker's special ingredient steals the show on SA Bake Off!", "performance_score": 0, "site": "channel24.co.za", "participants_count": 0, "title_full": "Channel24.co.za | Star baker's special ingredient steals the show on SA Bake Off!", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T08:32:00.000+03:00", "replies_count": 0, "uuid": "56fb0466a8b2451039ac07a16f813051d8ef7930"}, "author": "", "url": "http://www.channel24.co.za/TV/News/Star-bakers-special-ingredient-steals-the-show-on-SA-Bake-Off-20151022", "ord_in_thread": 0, "title": "Channel24.co.za | Star baker's special ingredient steals the show on SA Bake Off!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Star baker's special ingredient steals the show on SA Bake Off! 2015-10-22 07:32 Meringue star baker Michaela Tsuen (BBC) Related Links \nCape Town – Meringues might look delicate and light but it turns out baking them is not an easy affair. It was all things meringue on the third episode of The Great SA Bake Off as the ten remaining amateur bakers took to the tent to face their latest challenges. \nAfter three rounds of intense challenges, 22-year-old professional dancer from Cape Town, Michaela Tsuen was crowned meringue queen. \nWe had a quick chat with Michaela about the challenge, her meringue secret and what’s it’s like winning that star baker title. \nChannel24: \nHow much meringue baking experience did you have upon entering the competition? \nMichaela: \nUpon entering the competition, I didn't have too much experience with meringues. I had made a few maybe 5 or 6 times in my life, but nothing serious. I had also been the least experienced contestant when it came to macarons, as I had been the only person to never make a proper macaron, and I'd never gotten feet on a macaron before! \nChannel24: \nWhat’s your secret for making a good meringue? \nMichaela: \nThe secret to a good meringue is to add the sugar to the mixture at the correct time. People often wait too long to add the sugar, but one should start the first addition of sugar as soon as the egg whites become less translucent in colour and frothy in texture, so about 2 minutes into the process. The sugar needs a sufficient time to break down in the egg white mixture, so you need to add it soon so that it has time to dissolve. Touch is the best sense we have for judging when something is done, so if you rub the meringue between your fingers and if you can't feel the sugar granules anymore, you'll know your meringue is done. \nChannel24: \nWill you tell us a big more about that hard to find ingredient you used? \nMichaela: \nThe purple taro I used for my macaron is an Asian root vegetable, almost like a potato. It looks really cool when you cut it in half, because it's white, with flecks of purple in it. The flavour of taro is a bit like a vanilla with an Asian twist, but it's really difficult to describe, as it has no distinct flavour one can really compare it to. It is, however, the most popular bubble tea flavour. Bubble tea is a popular drink created in Taiwan, but is now found almost everywhere! I had to beg a bubble tea shop in Cape Town for some taro powder, because they were the only place I knew of that sourced it, and they happily sold it to me, so thank you to them! \nChannel24: \nWhat was the most difficult part of the challenge? \nMichaela: \nThe most difficult part of the challenge had to be the timing of everything we had to do. Macarons require a standing period in which it needs to dry and form a thin skin, so that when you bake them, they hold that rounded shape on the outside, and grow feet. We had 4 hours for the challenge, so about 3 and a half hours were spent on baking and filling the macaron shells, while the last 30 minutes/15 minutes were spent assembling the tower. \nChannel24: \nYou were really surprised that you won the challenge. Why did you think that you would be leaving this week? \nMichaela: \nI was really surprised that I won star baker because I was sure that if there was a week I would go home, it would be macaron week, as I had failed to produce them during the preparation phase of the bake off. I originally used the Italian method for my meringue base, but a day before the filming, I decided to change to the French meringue method, and thank goodness for that! I was so sure that Alice would win star baker, so that's why I pointed to her after the announcement was made. I was really honoured to receive that title though. Everyone in the competition is so strong, so to make it through to another week is amazing enough for me. \nTune in to for more baking drama Tuesdays at 20:00 on BBC Lifestyle (DStv 174). \n(Photos: BBC)", "external_links": [], "published": "2015-10-22T08:32:00.000+03:00", "crawled": "2015-10-22T09:30:45.640+03:00", "highlightTitle": ""}