{"organizations": [], "uuid": "ef4a2166eda1ce5db6c8b48434eda1e5f8f4cf7a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usatoday.com", "main_image": "http://www.gannett-cdn.com/-mm-/6c1d5c4dba0db92934ddc66ce2c213c9a7f47b48/c=0-440-4592-3034&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/10/21/USATODAY/USATODAY/635810248663652538-car.jpg", "site_section": "http://www.usatoday.com/life/", "section_title": "Entertainment News: Celebrity gossip blogs, photos, videos &amp; stories - USATODAY.com", "url": "http://www.usatoday.com/story/life/2015/10/21/voices-my-lifelong-obsession-time-travel/74324146/", "country": "US", "title": "Voices: My lifelong obsession with time travel", "performance_score": 0, "site": "usatoday.com", "participants_count": 1, "title_full": "Voices: My lifelong obsession with time travel", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T20:43:00.000+03:00", "replies_count": 1, "uuid": "ef4a2166eda1ce5db6c8b48434eda1e5f8f4cf7a"}, "author": "", "url": "http://www.usatoday.com/story/life/2015/10/21/voices-my-lifelong-obsession-time-travel/74324146/", "ord_in_thread": 0, "title": "Voices: My lifelong obsession with time travel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Christopher Lloyd as Doc Brown and Michael J. Fox as Marty McFly in a scene from the motion picture 'Back to the Future.' (Photo: Universal Studios Home Entertainment)\n4 CONNECT 8 TWEET LINKEDIN 1 COMMENT EMAIL MORE My phone rang one evening in the summer of 1985. It was my mother, and she had something important to tell me.\n“Steven Spielberg stole your idea,” she said.\n“What idea?”\n“Your time travel idea.”\nThis obviously was something only a mother could say. She had just seen a trailer for the first Back to the Future movie. She also had heard me talk incessantly since childhood about just how fascinating the concept of time travel was. If it did seem rather unlikely that I’d ever be able to travel back in time, I always thought I’d someday write a novel or short story about it, so when she heard about the movie, she thought of me.\nAll these years later, I still haven’t made it back to the Titanic in time to warn Captain Smith to turn away from the iceberg, and I haven’t written that time travel novel either, but that doesn’t mean I’m still not nuts about the concept.\nThis obsession dates back to the 1960s, when I was a young girl and my father and I happened upon a new TV series called The Time Tunnel . Each week, Tony and Doug, played by James Darren and Robert Colbert, found themselves in just the right spot as a huge historic event was about to take place: the attack on Pearl Harbor, the siege of the Alamo, the sinking of the Titanic, D-Day.\nAlong the way, I naturally asked my father if time travel really was possible, and, great dad that he was, he didn’t totally discount the idea. He told 8-year-old me that if scientists ever invented a vehicle that could travel faster than the speed of light, it might be possible to blast off from any particular spot on earth and catch up to the light bouncing back off that location, thereby allowing us to view what had happened in the past, if only in reflections and shadows.\nIt’s probably important to say right now that I don’t think this is ever going to happen. But that has never stopped my imagination from running wild on this magical subject.\nI had help. I devoured every one of author Jack Finney’s intriguing books and short stories. My list of beloved time-travel movies includes but is not limited to the entire Back to the Future franchise, Field of Dreams , Frequency , Deja Vu , Peggy Sue Got Married , Somewhere in Time , Timecop and The Final Countdown . If anyone is going back in time to save a loved one, right a wrong or become cool in high school, I’m there.\nUnlike a lot of sci-fi buffs, I have never been as interested in the future as I am in the past. For me, it’s all about the so-called butterfly effect, the theory that a single occurrence, no matter how small (like stepping on a butterfly), can change the course of history.\nTo that end, I’ll mention a dinner party ritual I’ve put a friend or two or 20 through over the years: If you could travel in time, where would you go? You get one personal choice and one historic choice.\nMy picks haven’t changed. For the former, I’d go to my parents’ wedding in Chicago on Sept. 17, 1955. I’d sit in the back of the church and soak it all in, trying not to make eye contact with anyone, especially my future mom and dad. Marty McFly taught us how much trouble that can cause.\nFor history, I’d beeline to Dealey Plaza in Dallas on the morning of Nov. 22, 1963, the day President Kennedy was shot. Who wouldn’t want to try to stop that from happening? (Talk about your butterfly effects.) It’s such a popular destination for time travel lovers that we’d all likely bump into one another as we ran around trying to figure out what happened.\nIf you end up there, look for me. I'll be the one standing on the Grassy Knoll, taking video with my iPhone.\nBrennan is a USA TODAY sports columnist and television commentator who still holds out hope for saving the Titanic.\n###\n4 CONNECT 8 TWEET LINKEDIN 1 COMMENT EMAIL MORE TOP VIDEOS", "external_links": ["https://twitter.com/intent/tweet?url=http%3A//usat.ly/1LLIKr7&text=Voices%3A%20My%20lifelong%20obsession%20with%20time%20travel&via=usatoday", "http://www.gannett-cdn.com/-mm-/efd780c05e93bb093b6d704029464e29e0bf388c/c=493-0-4528-3034&r=x404&c=534x401/local/-/media/2015/10/21/USATODAY/USATODAY/635810248663652538-car.jpg", "http://www.linkedin.com/shareArticle?url=http%3A//usat.ly/1LLIKr7&mini=true", "http://www.gannett-cdn.com/media/2015/10/21/USATODAY/USATODAY/635810248663652538-car.jpg", "http://www.gannett-cdn.com/-mm-/6fab25231f6c1fd11cde4d24dbd7ecc68a66d4b6/r=500x329/local/-/media/2015/10/21/USATODAY/USATODAY/635810248663652538-car.jpg"], "published": "2015-10-21T20:43:00.000+03:00", "crawled": "2015-10-21T21:26:49.641+03:00", "highlightTitle": ""}