{"organizations": [], "uuid": "3dddb1dccb1e1a9723452d536edf67e55bbad445", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.aceshowbiz.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Aceshowbizcom-EntertainmentNews\r", "section_title": "Aceshowbiz.com - Entertainment News", "url": "http://www.aceshowbiz.com/news/view/00090118.html", "country": "US", "title": "Heath Ledger's Old Video Went Viral on Throwback Thursday", "performance_score": 0, "site": "aceshowbiz.com", "participants_count": 1, "title_full": "Heath Ledger's Old Video Went Viral on Throwback Thursday", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T06:54:00.000+03:00", "replies_count": 0, "uuid": "3dddb1dccb1e1a9723452d536edf67e55bbad445"}, "author": "AceShowbiz.com", "url": "http://www.aceshowbiz.com/news/view/00090118.html", "ord_in_thread": 0, "title": "Heath Ledger's Old Video Went Viral on Throwback Thursday", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments The 'Dark Knight' actor showed his comedic and playful side when attending an Australian awards event two years before his death. \nAn old video of the late Heath Ledger was unearthed on Thursday, October 22 and went viral on Throwback Thursday. The serious actor was captured attending the 2006 Australian Film Institute Awards and showing a bit of his playful side on the red carpet. Ledger was having an interview with a 9News Australia reporter on the red carpet when a deafening scream startled him. The loud one was Australian actress Magda Szubanski who was dressed as a crew member and playing Sharon Strzelecki, her character on Australian sitcom \"Kath and Kim\". Szubanski freaked out upon meeting Ledger and the actor reacted by giving her a long kiss on the lips. Gobsmacked, Szubanski lost for words and pretended to faint. She was later reunited with him onstage when presenting the Reader's Choice Awards with singer Dannii Minogue . Szubanski was wearing red \"rashes\" on her face and told the audience, \"I'm a little bit over-excited tonight, because when I was on the red carpet, I met Heath Ledger and now I have a little bit of a case of Heath Rash. And you know, it's really funny, actually, Dannii, 'cause I always thought he was gay.\" Ledger was smiling from the audience seat. And when he was called as the winner of the award, Ledger held Szubanski before saying about the fake rash, \"I'm sorry about this. I had the same thing happen to me when I made out with Jake [Gyllenhaal].\" The actor won the award for playing gay cowboy opposite Gyllenhaal in \" Brokeback Mountain \". He died at the age of 28 in January 2008 of acute intoxication by the combined effects of several meds. \n© AceShowbiz.com", "external_links": [], "published": "2015-10-23T06:54:00.000+03:00", "crawled": "2015-10-23T10:44:41.093+03:00", "highlightTitle": ""}