{"organizations": [], "uuid": "56048e527569ff76440c6d7ba1a97343b0f23722", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.google.com", "main_image": "http://www.ew.com/sites/default/files/styles/tout_image_612x380/public/1444245672/ahs-hotel.jpg?itok=H7636nDg", "site_section": "http://news.google.com/news?pz=1&cf=all&ned=us&hl=en&topic=e&output=rss", "section_title": "Entertainment - Google News", "url": "http://news.google.com/news/url?sa=t&fd=R&ct2=us&usg=AFQjCNH28WiiRauDSAHLa72xWKu0xeNZGQ&clid=c3a7d30bb8a4878e06b80cf16b898331&cid=52778965154748&ei=UrsXVrmuIqDUa8nVq5AK&url=http://www.ew.com/article/2015/10/08/american-horror-story-hotel-ryan-murphy-checking-in", "country": "IL", "title": "American Horror Story exclusive: Ryan Murphy on Gaga, ghosts, and what's in ... - Entertainment Weekly", "performance_score": 0, "site": "google.com", "participants_count": 0, "title_full": "American Horror Story exclusive: Ryan Murphy on Gaga, ghosts, and what's in ... - Entertainment Weekly", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T09:37:00.000+03:00", "replies_count": 0, "uuid": "56048e527569ff76440c6d7ba1a97343b0f23722"}, "author": "", "url": "http://news.google.com/news/url?sa=t&fd=R&ct2=us&usg=AFQjCNH28WiiRauDSAHLa72xWKu0xeNZGQ&clid=c3a7d30bb8a4878e06b80cf16b898331&cid=52778965154748&ei=UrsXVrmuIqDUa8nVq5AK&url=http://www.ew.com/article/2015/10/08/american-horror-story-hotel-ryan-murphy-checking-in", "ord_in_thread": 0, "title": "American Horror Story exclusive: Ryan Murphy on Gaga, ghosts, and what's in ... - Entertainment Weekly", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ryan Murphy"], "text": "How Lady Gaga prepared for 'American Horror Story' \n[SPOILER ALERT IF YOU HAVEN’T WATCHED THE AMERICAN HORROR STORY: HOTEL PREMIERE!!!] \nBased on what we knew about American Horror Story: Hotel , we sorta guessed the Hotel Cortez wasn’t gonna be a five-star resort. The premiere revealed a building that not only houses vampire-esque bloodsuckers but also kinky ghosts, cool modern art, a cross-dresser named Liz Taylor, and a demon armed with really nasty sex toys. \nEW talked to AHS ’ co-creator Ryan Murphy about all the bloodshed and whether Lady Gaga has responded to his offer to return for season 6. \nENTERTAINMENT WEEKLY: This one looks so different. Freak Show had much more static shots. Hotel has a ton of movement and fish eye-lenses. Why that choice? RYAN MURPHY: Every season has a different tone. I think last season was literally about being out in the open and being exposed and naked and nowhere to hide with your differences. This season is more paranoid. It’s more claustrophobic. It’s more about hiding things. Hotels by nature are a good place to store secrets. [ AHS cinematographer] Michael Goi and I sorta came up with a look. Also one the things that was an inspiration to us this season was the idea of the peepholes. We had the title sequence around that. Visually it’s supposed to be a representation of somebody can always watch you. \nRELATED: See American Horror Story stars, then and now \nWhat are the rules of the hotel? Is it like season 1 where you die on the property and you’re trapped there? Yes. I think whenever we’ve done ghosts or supernatural things, that rule is a constant on the show: The place that you die is the place that you haunt. That’s a rule that harkens back to season one. \nSo Sally is a ghost? Yeah she was pushed out the window. She died on the property. \nWho is the man in the bed who the two blonde women find in the beginning? You’ll see that more in the second episode. Anybody who comes through to do a drug deal with Sally usually meets that fate. She is the purveyor of sewing them into mattresses. \nSo are the Addiction Demon and Sally punishing those who seek drugs? No, the Addiction Demon is there to inflict his pain and suffering which addiction does not only to the victims but to the people around them. I think Sally is there, having gone through the experience, to comfort them in their time of need. She’s more of the yin to the yang. Those two do work together but she’s gone through it and she died for it. So she’s trying in some ways I think to make amends for her ghastly acts. \nIs Marcy like the puppeteer of all this? Is she secretly Satan? [ Laughs ] No Marcy is just a damn good realtor and that’s that! We pretty much have the writing staff now as in the beginning and we always loved her because she was so mean to her clients. I think Ms. Estabrook does such a great job as Marcy. It was great to have her back. She’s just a damn fine realtor. She hustles for a living. \nObviously it’s a very different story. But I think it’s fun that she comes back in the premiere. The question I get asked more than anything on this show is, “Whatever happened to the Harmon’s dog?” So she updates you on the current state of affairs of the Harmon’s dog which she took possession of. \nRELATED: See 11 American Horror Story: Hotel photos exclusive to EW \nGaga’s introduction was incredible. Between the penthouse and the cemetery and the foursome, what was it like shooting all that? Some critics and some people have written about Gaga that her introduction is almost like she’s in a silent movie. As you will see, that’s the whole f—ing point. We establish by episode 2 or 3 what year she was born and her story is very much wrapped into the silent film culture of early Los Angeles. So I think it was giving people a foreshadowing of what her character is about. \nIt was a very hard sequence to shoot. It took a really long time over several locations and Gaga’s first day she dropped the veil and there she was! She was such a great pro about it. It’s one of my favorite things I’ve personally ever directed on the show because I like telling that whole story with no dialogue. But that was the entire point: We’re setting up a silent world to come. \nIs the Ten Commandments Killer tied to The Countess? Yeah, everyone is tied to the Ten Commandments Killer. The great fun is, “Who among them is that killer?” It’s obviously someone who’s staying in the hotel. \nAfter feeding the blondes, Iris complains she has to go “feed that thing in room 33.” Will we meet that thing? Yes. We have an entire episode dedicated to the thing in room 33 — episode 5. The thing in room 33’s name is Bartholomew. \nSo the vampires don’t have fangs. Was that just because you wanted a different twist on the genre? Well I was interested in it being a little different. I liked doing vampirism but I didn’t wanna do vampires. Gaga has a big line in the second episode where she turns somebody and they ask her all questions. I was interested in it being some sort of weird, almost biblical virus that has its own good and bad properties. It leads to a super-charged immune system. But we’re not doing the thing about you can only kill them with a silver bullet or a stake. If you walk in front of a car, you die. They are very much mortals but they have this virus that impedes the aging process. It’s based on stuff that’s happening right now with stem cell research and all that stuff. It’s really not to me that crazy or fantastical of what could come in the next couple of years. The show always plays with mortality and the idea of aging and beauty. \nIn terms of the children, is she just creating a brood that looks like her? \nI think there’s an Auntie Mame quality to her that I think you can see in the first episode where she loves children and feels like she’s saving any abused child. She feeds them sugar and lets them play video games all day. We establish in the second episode how she gets their blood. It’s done for both largesse and her own needs. It’s interesting. \nAnd Lachlan isn’t blonde. Does he go through a makeover? I don’t think she’s interested unless they’re blonde. [ Laughs ] I think she could give a s—, like if you don’t have the blonde stuff you’re not gonna be in her brood. She’s very specific about the look of her vamps. \nAll the men kind of look a like—brunette with dark features. Is there a specific reason for that? I love the theory that they’re all my type. When I read that, I was like that’s hilarious. Yes, I completely cast the show with all men that are my sexual prototype. Of course there’s a reason! It’s established. Matt Bomer even says it in the second episode. There is a reason for her insanity that’s very deeply wounded and her core wound. Why are all these men who have a very similar aesthetic around her? Why is she the only platinum blonde? I just love reading people’s theories on it. \nYou tweeted that you officially asked Gaga back for season 6. What did she say? I’ll never tell. That’s something that she has to deal with and announce or not announce when she feels comfortable based on her schedule. I never expect an answer right away and I don’t expect an answer about this right away. But I think she’s just so great in it. I think the first episodes are very weird. I think it’s hard to review the first episode of the show. A lot of people write that like, “We don’t know what the fuck is happening.” There’s so much set up and we’re creating a world. I’ve seen more than half the episodes now and I think it’s really quite extraordinary and I think she’s a great actress. I think she’s got a very special talent. So I just went to her and said, “I’ve loved having you on the show so much — if you wanna come back, I’d love to have you. I have a couple ideas.” I told her that and she hopped on a plane to New York. So I’m anxiously awaiting her return next week where she’s shooting more scenes. \nIt’s pretty amazing when somebody like Kathy Bates calls me up and says, “I just did a scene with Gaga and I’m shaking because she’s so convincing and I’m so terrified of her.” Gaga gets that all the time on our set. I’m very thrilled by her. \nAnd you said she improv’d “Your boy has a jawline for days.” Yes it was the last take. I think what was scripted was “Your boy is beautiful” or something. I said, “Say something else!” She’s sitting there like a spider and she ad libbed that. Poor Matt Bomer who was supposed to be comatose I believe almost died from holding in his laughter. \nAre there already clues in the premiere to what season 6 would be? This is an interesting year in that the idea that we’re dealing with I’ve mentioned in several seasons. It’s been there before. We’ve actually talked about it a lot on the show. I might do that for season 7 but I’m leaning towards that for season 6. \nWhat can you say about episode 2, “Chutes and Ladders”? Episode 2 takes you deeper into the mythology of the characters and you get to meet some more people. You get to meet Mr. March who is Evan Peters. I think this is Evan’s best role we’ve ever done. Usually Evan is the tortured good guy or the tortured ingénue. But this year we decided to go a very different route and just make him perhaps the worst human being to have ever lived. So he’s the bad guy and you get to really meet him and how he built the hotel. It’s loosely inspired by HH Holmes and that hotel of horrors he made. \nIt gets into the romantic exploits of Gaga and Matt Bomer. You also get to meet Finn Wittrock’s character who is a tortured crystal meth-using male model, so that’s always fun. You meet Naomi Campbell who’s brilliant and hilarious. She plays a bored Vogue magazine editor. \nAlso, in the second episode, is an amazing sequence where we get to see Gaga’s character in Studio 54 in the late ‘70s. The hilarious thing about that is when we shot that three months ago, we used that Chic song, “I Want Your Love.” Then this weekend, I clicked on the Tom Ford thing and there it is! I was like, “Why didn’t you tell me you covered that?” So I would like to just stake my claim that we did it first. I joked with her and Tom is a good friend. I was like, “Did you get that idea from that?” She wouldn’t say—she just smiled.", "external_links": [], "published": "2015-10-08T09:37:00.000+03:00", "crawled": "2015-10-09T16:05:07.985+03:00", "highlightTitle": ""}