{"organizations": [], "uuid": "4f71f92d6f3abfd9ce12763256520fb5d5d09b03", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.democratandchronicle.com", "main_image": "http://www.gannett-cdn.com/-mm-/af13095df8dd22ffe1a76d2064f24496722e82a8/c=0-11-500-293&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/14/Rochester/Rochester/635804264917451206-Lollypop-IMG-0838.jpeg", "site_section": "http://www.democratandchronicle.com/", "section_title": "Democrat and Chronicle | Rochester news, community, entertainment, yellow pages and classifieds. Serving Rochester, New York | democratandchronicle.com", "url": "http://www.democratandchronicle.com/story/sponsor-story/lollypop-farm/2015/10/15/lollypop-farm/73930610", "country": "US", "title": "Why adopting an older dog is a great choice", "performance_score": 0, "site": "democratandchronicle.com", "participants_count": 1, "title_full": "Why adopting an older dog is a great choice", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T12:03:00.000+03:00", "replies_count": 0, "uuid": "4f71f92d6f3abfd9ce12763256520fb5d5d09b03"}, "author": "Lollypop Farm, Humane Society of Greater Rochester", "url": "http://www.democratandchronicle.com/story/sponsor-story/lollypop-farm/2015/10/15/lollypop-farm/73930610", "ord_in_thread": 0, "title": "Why adopting an older dog is a great choice", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Some people think adopting an older dog is a risk because they don't know what they're getting, or they think it may be easier for a puppy to bond with a new family. \"The truth is, older dogs are most likely house-trained already and understand basic behavior cues, which means they may require less training than a puppy,\" says Erin Sandle, Shelter Manager at Lollypop Farm, the Humane Society of Greater Rochester. \"Older dogs are calmer, and in many cases have an easier time focusing on the task at hand.\"\nIn other words, the saying that \"you can't teach an old dog new tricks\" is simply not true, says Sandle.\nAnd with most senior dogs, what you see is what you get. \"In most cases, we have history from the previous owners, and adopters will know the dog's full-grown size as well as results of their behavior and physical evaluation that we perform,\" Sandle adds.\nAccording to Sandle, Lollypop Farm has adopted out countless senior dogs who have settled in quickly and have become loving, vital members of the family. In fact, she says families report that these dogs are devoted, loving and grateful. Another payoff, says Sandle, is the emotional return for a family, knowing they're providing quality, loving care for a dog who may have stayed longer at a shelter because of age.\nLollypop Farm offers a Seniors-for-Seniors program, which allows eligible adopters 60 years of age or older to adopt an animal 6 years or older for free.\n\"This is a savings of $130, and includes everything that normally comes with an adoption: spay/neuter surgery, vaccinations, deworming, microchipping, flea treatment, 30-day gift of pet health insurance, free exam with a veterinarian and ID tag,\" says Sandle.\nA year ago, says Sandle, Katie Conway adopted 14-year-old Oreo, a basset hound mix, from Lollypop Farm. Conway had come to the shelter to see another dog, but \"then I turned around and saw Oreo's big floppy ears,\" she says. \"Her age didn't bother me. I was drawn to her, and I thought, 'No matter how long she lives I can give her a loving, comfortable life.'\"\nAs it turns out, Oreo is helping other humans live a more comfortable life. Conway began bringing Oreo to Pet Assisted Therapy training sessions at Lollypop Farm, and Oreo was registered in April 2015. Conway and Oreo have already visited people to help provide comfort and reassurance.\n\"I feel like she's come full-circle: She was an animal in need of a home, and now she's helping others who need special care,\" says Conway.\nAccording to Conway, \"senior dogs have a tremendous amount of love to give. Adopting an older dog has given me a huge return on my investment. I feel the rewards every day we spend together.\"\nThis story is provided and presented by our sponsor, Lollypop Farm, Humane Society of Greater Rochester", "external_links": ["http://www.lollypop.org/"], "published": "2015-10-15T12:03:00.000+03:00", "crawled": "2015-10-16T00:23:35.959+03:00", "highlightTitle": ""}