{"organizations": [], "uuid": "97ae6f8c9d16aaec5df48aabfdead7576155122f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://www.canberratimes.com.au/content/dam/images/g/k/6/l/5/0/image.related.articleLeadwide.620x349.gk6kwn.png/1444612987344.jpg", "site_section": "http://feeds.canberratimes.com.au/rssheadlines/entertainment.xml#", "section_title": "Canberra Times Entertainment Headlines", "url": "http://www.canberratimes.com.au/world/im-glad-my-terrorist-son-abdul-hakim-is-burning-in-hell-mother-sally-evans-20151011-gk6kwn", "country": "AU", "title": "I'm glad my terrorist son, Abdul Hakim, is 'burning in hell': mother Sally Evans", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "I'm glad my terrorist son, Abdul Hakim, is 'burning in hell': mother Sally Evans", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T04:23:00.000+03:00", "replies_count": 0, "uuid": "97ae6f8c9d16aaec5df48aabfdead7576155122f"}, "author": "Anita Singh in London", "url": "http://www.canberratimes.com.au/world/im-glad-my-terrorist-son-abdul-hakim-is-burning-in-hell-mother-sally-evans-20151011-gk6kwn", "ord_in_thread": 0, "title": "I'm glad my terrorist son, Abdul Hakim, is 'burning in hell': mother Sally Evans", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Return to video Video settings Please Log in to update your video settings\nVideo will begin in 5 seconds.\nDon't play Play now More video Recommended Trailer: House Husbands\nTrailer: My Son The Jihadi\nTrailer: Pan\nTrailer: Please Like Me (TV Show Season 3) \nTrailer: The Bachelorette - meet the families\nReplay video Return to video Video settings Please Log in to update your video settings\nTrailer: My Son The Jihadi In 2011, British mother Sally Evans made a devastating discovery - her eldest son, Thomas aged just 21, had left their home and travelled to Somalia join a deadly Islamist terrorist group.\nPT0M39S 620 349 Autoplay On Off Video feedback Video settings The mother of a British man who converted to Islam and died fighting for the terrorist group al-Shabaab has said he is \"burning in hell\" for his crimes.\nThomas Evans, 25, was killed during a gun battle with Kenyan troops in June. The former Manchester United fan from High Wycombe, became radicalised in Britain and changed his name to Abdul Hakim before travelling to east Africa in 2011.\nImagine discovering the death of your child on Twitter and being both devastated and relieved   \nSally Evans A Channel 4 documentary, My Son the Jihadi , found witnesses who claim a man fitting Evans' description led attacks on Kenyan villages, singling out Christians and cutting their throats.\nA still of My Son the Jihadi ... Thomas Evans as a young boy in High Wycombe, Britain. He changed his name to Abdul Hakim when he became radicalised in his twenties. Photo: YouTube \nHis mother, Sally Evans, said she would forever miss the boy she brought up but that she was glad the man he became was dead and \"burning in hell\". She learnt he had been killed after a picture of his body was circulated on social media.\nAdvertisement \"Imagine discovering the death of your child on Twitter and being both devastated and relieved,\" Mrs Evans said.\n\"Devastated because the child you brought into this world was killed after being brainwashed into pursuing a murderous cause, but relieved because the death of your child meant he could no longer harm innocent people.\"\nThomas Evans, 25, died fighting for the terrorist group al-Shabaab during a gun battle with Kenyan troops in June. Photo: My Son the Jihadi \nMrs Evans, 57, a former teaching assistant, remembers her son as a little boy full of \"cute mischief\" who made mud pies in the back garden and won a WH Smith drawing competition aged 10 with a Harry Potter illustration.\nHe spoke of wanting to become an electrical engineer with the Royal Marines so he could serve his country.\nShe believes he became radicalised after splitting from his girlfriend and forming a friendship with a group of Muslim men at his gym. He changed his name, grew a beard and lost his engineering apprenticeship after repeatedly expressing extremist views at work.\nIn 2011 he went to Egypt, telling his mother he was going to study Arabic, but the following year he phoned to say he was in Somalia and had joined al-Shabaab.\nOn Christmas Eve 2012, he announced he had married a girl of 13 or 14. In subsequent calls, Evans praised the terrorist attack on the Westgate mall in Nairobi, and told his mother he was preparing for \"martyrdom\".\nHe was killed four months ago during a raid on a Kenyan military base.\nThe documentary is to appear on October 22.\nTelegraph, London", "external_links": [], "published": "2015-10-12T04:23:00.000+03:00", "crawled": "2015-10-12T09:47:39.929+03:00", "highlightTitle": ""}