{"organizations": [], "uuid": "0023dd09e5adbc54e6ec98fde0e32ea080eeb9f5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-56294ea0/turbine/ct-madigan-cullerton-illinois-democrats-pensions-perspec-1022-20151022", "site_section": "http://www.chicagotribune.com/", "section_title": "Chicago Tribune: Chicago breaking news, sports, business, entertainment, weather and traffic - Chicago Tribune", "url": "http://www.chicagotribune.com/news/opinion/commentary/ct-madigan-cullerton-illinois-democrats-pensions-perspec-1022-20151022-story.html", "country": "US", "title": "How Illinois Democrats hoodwinked the middle class", "performance_score": 2, "site": "chicagotribune.com", "participants_count": 1, "title_full": "How Illinois Democrats hoodwinked the middle class - Chicago Tribune", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T23:57:00.000+03:00", "replies_count": 0, "uuid": "0023dd09e5adbc54e6ec98fde0e32ea080eeb9f5"}, "author": "Kristen McQueary", "url": "http://www.chicagotribune.com/news/opinion/commentary/ct-madigan-cullerton-illinois-democrats-pensions-perspec-1022-20151022-story.html", "ord_in_thread": 0, "title": "How Illinois Democrats hoodwinked the middle class", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "In 2011, Illinois House Speaker Michael Madigan attended a private fundraiser for Republican U.S. House Speaker John Boehner. Madigan was a guest of the host, Terrence Duffy, chairman of CME Group, the parent company of the Chicago Mercantile Exchange and the Chicago Board of Trade.\nFour months later, Madigan and Senate President John Cullerton gathered lawmakers in Springfield for a rare special session to approve tax-break legislation that included CME Group, cutting the company's annual state income taxes nearly in half.\nAt the time, Illinois was facing the possible shutdown of seven facilities, including mental health institutions and a home for the developmentally disabled. For weeks, parents with adult disabled children were visiting the Capitol trying to save the facility slated for closure. They pushed their loved ones around in wheelchairs or sat outside the House chamber carrying framed pictures of their kids.\nTheir efforts didn't work. Jacksonville Developmental Center was eventually closed. But CME Group got its tax break.\nCME Group is one of many big-donor firms to benefit from a form of corporate welfare from a Democrat-led state government. From 2010 to 2014, the state handed out tax breaks worth roughly $4.6 billion to Sears and Mitsubishi, Motorola and others, according to a subsidy tracker website.\nRemember that the next time you hear Madigan or Cullerton or any Illinois Democrat boast that their party is the one putting the interests of the middle class ahead of big business.\nIt's a theme you'll hear repeatedly as the election cycle takes off.\nNo, Gov. Edgar, 'doable' is the problem Editorial Board Before Bruce Rauner took office in January, an ex-governor who campaigned for him described the state's devastated finances. \"Doomsday's coming, we do not have a printing press,\" Jim Edgar told the Tribune. \"I was talking to some people to see if there's any smoke and mirrors left and I don't think...\nBefore Bruce Rauner took office in January, an ex-governor who campaigned for him described the state's devastated finances. \"Doomsday's coming, we do not have a printing press,\" Jim Edgar told the Tribune. \"I was talking to some people to see if there's any smoke and mirrors left and I don't think...\n(Editorial Board) Let's explore. How exactly have Democrats in Illinois helped the middle class?\nUnder a Democrat-controlled state government between 2003 and 2015, the state's unfunded pension liability skyrocketed to more than $111 billion from about $43 billion. Through a series of monumentally bad decisions, the Democrats have imperiled the retirements of thousands of workers. They approved a $10 billion pension bond sale to prop up the funds in 2003, which added $21.9 billion to the state's long-term pension debt, according to a Tribune analysis.\nIn 2005, the Democrats passed a bill that lowered the state's required pension contributions over a two-year period — with the blessing of organized labor.\nThe backloaded pension payment schedule from 1994 — passed on a bipartisan roll call and signed by Republican Gov. Jim Edgar — is blamed for much of the state's pension mess. But that was only part of the problem. The Democrats didn't adhere to the payment schedule. When they couldn't make a required payment, they rewrote the pension code and lowered what they owed.\nFor Speaker Madigan, gridlock is the plan Editorial Board Comptroller Leslie Munger announced last week that Illinois would not be able to make its required $560 million contribution to the pension system in November. Illinois is running out of money.\nPity poor Squeezy the Pension Python.\nSqueezy, you'll recall, was an orange cartoon snake that Gov. Pat...\nComptroller Leslie Munger announced last week that Illinois would not be able to make its required $560 million contribution to the pension system in November. Illinois is running out of money.\nPity poor Squeezy the Pension Python.\nSqueezy, you'll recall, was an orange cartoon snake that Gov. Pat...\n(Editorial Board) Democrat-controlled state government in 2006 also allowed union lobbyists to join the pension system. Be a substitute teacher for one day, and boom! You, too, can join the Teachers Retirement System. Other clouted private citizens were allowed to join.\nBy the time the calendar turned to 2010, the state was at least $24 billion behind in payment obligations. And over the next two years, the Democrat-led state government borrowed again and again, adding billions more to what taxpayers will eventually owe to bail out the pension system.\nTo his credit, Madigan finally got serious about pension reform and in 2013 passed a bill that would have stabilized the system. The courts struck it down, though. No real effort has been made since to deal with the ongoing pension crisis.\nThe retirements of thousands of workers remain in jeopardy. And the nonunion, middle-class workforce in this state is stuck trying to save for their own retirements while also paying for the irresponsibility of a state government led by one party from 2003 to 2015.\nThat's not representing the middle class. That's abusing it.\nThe Democrats have broken other promises to the middle class.\nIn more than a decade of exclusive control, why didn't they put a constitutional amendment on the ballot for a progressive income tax, and lobby to get it passed? They had the time. They didn't do it.\nWhat happened to the promise of a statewide minimum wage hike? Madigan shelved it last year after Mayor Rahm Emanuel passed his own version for Chicago. For Madigan, sending a message to Emanuel was more important than passing a higher minimum wage.\nDuring more than a decade of exclusive control, why didn't the Democrats fix a broken property tax system that puts middle-class families on the hook for most of the funding for public schools? Why didn't they change the unfair school funding formula that burdens property-poor communities with sky-high tax rates?\nBy allowing the state to slip into near-permanent deadbeat status — unable to pay its bills, unable to pay its pension obligations, unable to support the state's most vulnerable citizens — the Democrats have not helped the middle class. They've crushed it.\nAnd it's interesting: For all the class warfare Madigan and Cullerton like to perpetuate, they rarely talk about their own wealth. They both run successful law practices that Madigan once admitted \"in a good year\" puts him in a millionaire's bracket.\nMeanwhile, the Terrence Duffys of the world get waved into Madigan's office. They get a special session to give them tax breaks. I doubt the parents of adult disabled children got the same attention. In fact, they're usually at the back of the line.\nRemember that the next time Democrats in this state claim to be the party protecting the middle class. They're not telling the truth.\nKristen McQueary is a member of the Tribune Editorial Board.\nkmcqueary@tribpub.com\nTwitter @ statehousechick\n Commentary Opinion", "external_links": ["http://www.trbimg.com/img-56256ad3/turbine/ct-jim-edgar-bruce-rauner-illinois-budget-edit-20151019", "http://www.trbimg.com/img-56294ea0/turbine/ct-madigan-cullerton-illinois-democrats-pensions-perspec-1022-20151022", "http://www.trbimg.com/img-56215a15/turbine/ct-rauner-madigan-cullerton-budget-illinois-taxes-edit-1018-jm-20151016", "http://www.twitter.com/statehousechick"], "published": "2015-10-22T23:57:00.000+03:00", "crawled": "2015-10-23T00:27:08.117+03:00", "highlightTitle": ""}