{"organizations": [], "uuid": "9b0d25f0948e3acdbca50f0cde031c0237fb7c8b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.delawareonline.com", "main_image": "http://www.gannett-cdn.com/-mm-/76344a343862f97d4f7a29a1084bd455bd77b967/c=0-0-1996-1128&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/05/Wilmington/Wilmington/635796416282924610-061915-FireflyFri-KRG4437.JPG", "site_section": "http://rssfeeds.delawareonline.com/wilmington-entertainment", "section_title": "Wilmington - Entertainment", "url": "http://www.delawareonline.com/story/entertainment/2015/10/05/firefly-music-festival-aeg-panorama/73378212/", "country": "US", "title": "Firefly fest to face competition from within?", "performance_score": 0, "site": "delawareonline.com", "participants_count": 0, "title_full": "Firefly fest to face competition from within?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T19:52:00.000+03:00", "replies_count": 0, "uuid": "9b0d25f0948e3acdbca50f0cde031c0237fb7c8b"}, "author": "", "url": "http://www.delawareonline.com/story/entertainment/2015/10/05/firefly-music-festival-aeg-panorama/73378212/", "ord_in_thread": 0, "title": "Firefly fest to face competition from within?", "locations": ["Dover"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Zedd", "Ryan Cormier"], "text": "Firefly fest to face competition from within? Ryan Cormier , The News Journal 2:11 p.m. EDT October 5, 2015 Buy Photo Fans cheer as Zedd performs at Firefly Music Festival in Dover in June. (Photo: KYLE GRANTHAM/THE NEWS JOURNAL) Buy Photo 114 CONNECT TWEET LINKEDIN 2 COMMENT EMAIL MORE \nDover’s Firefly Music Festival may face new competition this summer – and it could come from within. \nA new rock festival tentatively named Panorama could launch next year in New York City on the same weekend as Firefly, according to the New York Daily News. \nHere’s the twist: The possible June 16-19 festival would be hosted by music giant AEG Live, which owns Coachella Valley Music & Arts Festival founders Goldenvoice. \nFirefly organizers teamed up with Goldenvoice and AEG last year to help grow the Delaware festival, assisting with booking, sponsorships and marketing. \nWith 28 percent of Firefly’s 90,000 fans this year coming from New York and New Jersey, how are Firefly organizers Red Frog Events reacting to the news of another massive East Coast rock festival? \nThey are showing little concern. \n“The difference in location and venue type would make a festival like this able to co-exist with Firefly,” says Lauren Shield King, Red Frog’s director of public relations. Buy Photo \nGrizfolk plays at The Coffeehouse stage at the Firefly Music Festival earlier this year. (Photo: KYLE GRANTHAM/THE NEWS JOURNAL) \nAccording to reports , Panorama would be held in Queens at Flushing Meadows Corona Park, the site of the 1964 World’s Fair – an urban site where camping is not expected. \nThat would be a major difference for festivalgoers who would theoretically commute to Panorama each day as opposed to Firefly’s offer of a long weekend of camping and music in The Woodlands, says Michael Johnson, assistant professor and head of the Music Technology Department at the University of the Arts in Philadelphia. \n“It depends on what people want,” says Johnson, a multi-instrumentalist who has performed on albums like Kurt Vile’s “Wakin on a Pretty Daze” and The War on Drugs’ “Slave Ambient.” “Do they want a camping, live-on-site experience or do they want a single ticket each day in Queens kind of thing and see the three bands they care about?” \nAEG did not immediately respond to requests for comment. \nA possible new festival 190 miles north in New York run by Firefly’s partners also offers an interesting proposition: Could acts take the New Jersey Turnpike and play both festivals on the same weekend? \nKing says it could happen. “Since we began working with Goldenvoice, the potential for sharing acts with other festivals they're associated with has been a possibility,” she says. \nJohnson is not surprised at reports of yet another music festival sprouting in the U.S. After all, we’re in the midst of a festival boom. Just last year, America’s five largest music festivals (Coachella, Austin City Limits, Lollapalooza, Outside Lands, Stagecoach) combined to sell $184 million in tickets, according to Forbes magazine. Buy Photo \nFans at Firefly Music Festival in Dover in 2013. (Photo: SUCHAT PEDERSON/THE NEWS JOURNAL, SUCHAT PEDERSON/THE NEWS JOURNAL) \nJohnson only needs to look as far as his friends in the Philadelphia-based band The War on Drugs, which played both weekends of California’s Coachella, along with Tennessee’s Bonnaroo, New York’s Governor’s Ball Music Festival, Washington’s Sasquatch! Music Festival, Denmark’s Roskilde Festival and more this past summer. \n“They can play five or six of these festivals and then write music the rest of the summer,” Johnson says. “For a lot of bands, there are no more summer touring schedules. They play festivals.” \nFirefly has grown from 30,000 people in 2012 to 90,000 this past June. Its partnership with Goldenvoice led to Firefly’s debut on AXS TV, which aired 17 hours of the fest nationally. \nA limited number of presale four-day Firefly passes went on sale in July, selling out quickly at $249 apiece. No on-sale date or musical acts for Firefly’s fifth year have been announced. \n-- Ryan Cormier, The News Journal. Facebook: @ryancormier . Twitter: @ryancormier . Instagram: @ryancormier . 114 CONNECT TWEET LINKEDIN 2 COMMENT EMAIL MORE Read or Share this story: http://delonline.us/1RqVsfp More Stories", "external_links": [], "published": "2015-10-05T19:52:00.000+03:00", "crawled": "2015-10-06T07:41:32.106+03:00", "highlightTitle": ""}