{"organizations": [], "uuid": "132e7b183cb46401b113b79fd090f79032ffba6d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.aceshowbiz.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Aceshowbizcom-EntertainmentNews\r", "section_title": "Aceshowbiz.com - Entertainment News", "url": "http://www.aceshowbiz.com/news/view/00089497.html", "country": "US", "title": "Justin Bieber Shares Sexy Photo Amid Report He Threatens to Sue Over His Naked Photos", "performance_score": 0, "site": "aceshowbiz.com", "participants_count": 1, "title_full": "Justin Bieber Shares Sexy Photo Amid Report He Threatens to Sue Over His Naked Photos", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T07:03:00.000+03:00", "replies_count": 0, "uuid": "132e7b183cb46401b113b79fd090f79032ffba6d"}, "author": "AceShowbiz.com", "url": "http://www.aceshowbiz.com/news/view/00089497.html", "ord_in_thread": 0, "title": "Justin Bieber Shares Sexy Photo Amid Report He Threatens to Sue Over His Naked Photos", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments The 'What Do You Mean?' singer takes to Instagram to share a semi-naked photo of himself amid report he's threatening to sue New York Daily News over his naked photos. \nJustin Bieber posted on Instagram a semi-naked photo of himself amid report he's threatening to sue New York Daily News over his naked photos during a vacation in Bora Bora. The \"What Do You Mean?\" singer took to the social media on Thursday, October 8 to share the sexy black-and-white snap of him. The snap showed Justin shirtless, showing off his muscular pecs and ripped abs, as he stood in front of the wall. The 21-year-old singer lifted up one of his arms, revealing tattoos on her pecs. He only wore black shorts and necklace. He didn't write anything in the caption for the snap. Foto kiriman Justin Bieber (@justinbieber) pada Okt 8, 2015 pada 2:25 PDT Fans were so excited after they learned of Justin's shirtless snap on the social media. Fan @iiamyuk wrote, \"I LOVE YOU SO MUCH BIEBER.\" Another fan @little_lee_baby17 said, \"So hot And those abs tho.\" Infatuated with the snap, fan @jenna_marie9 commented, \"Drooling.\" Earlier this week, Justin was pictured naked while walking around the swimming pool at the beach resort in Bora Bora. Meanwhile, model Jayde Pierce who was photographed at the same deck was strolling around with a white cloth robe on. Both of them took to Instagram to share some photos from their getaway, but they didn't share pictures featuring each other. The \"Baby\" hitmaker\" was clearly unhappy with his nude photos spread online. Justin's legal team has sent a cease and desist letter demanding the removal of the nude pictures from New York Daily News' website within 12 hours. His legal team said the publication of the nude photos is a violation of the singer's publicity and privacy rights. \n© AceShowbiz.com Browse Justin Bieber Pictures More Justin Bieber News", "external_links": [], "published": "2015-10-09T07:03:00.000+03:00", "crawled": "2015-10-09T10:00:10.768+03:00", "highlightTitle": ""}