{"organizations": [], "uuid": "8849897c39a7c1757709bec9e7bc57aa014cc177", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266347/arts-entertainment-general", "section_title": "Arts &amp; Entertainment: General - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30265609/david-babcock-the-knitting-runner-will-run-and-crochet-in-two-marathon-runs-to-support-alzheimers-caregivers-and-research", "country": "US", "title": "David Babcock The Knitting Runner Will Run and Crochet in Two Marathon Runs to Support Alzheimers Caregivers and Research", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "David Babcock The Knitting Runner Will Run and Crochet in Two Marathon Runs to Support Alzheimers Caregivers and Research - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T12:02:00.000+03:00", "replies_count": 0, "uuid": "8849897c39a7c1757709bec9e7bc57aa014cc177"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30265609/david-babcock-the-knitting-runner-will-run-and-crochet-in-two-marathon-runs-to-support-alzheimers-caregivers-and-research", "ord_in_thread": 0, "title": "David Babcock The Knitting Runner Will Run and Crochet in Two Marathon Runs to Support Alzheimers Caregivers and Research", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Babcock to simultaneously run and crochet in the Kansas City and New York City Marathon\nNew York, New York (PRWEB) October 15, 2015\nLion Brand® Yarn Company is sponsoring David Babcock, The Knitting Runner, in two upcoming marathon runs to support research in the fight against Alzheimer’s disease. David Babcock is the current Guinness World Record holder for knitting the longest scarf (12 feet) while running a marathon in 2013.\nOn Saturday, October 17th David will attempt to crochet the world’s largest doily while running the Kansas City Marathon – coining it the “Doily Dash”. He will crochet the doily in Lion Brand®’s super chunky yarn, Wool-Ease® Thick & Quick®. Two weeks later, on November 1st, David will run the TCS New York City Marathon while finger crocheting symbolic flowers to hand out to spectators along the sidelines.\nFor the second year in a row, Lion Brand is sponsoring David Babcock in the New York City Marathon to help raise funds for free care and support programs provided by the New York City Chapter of the Alzheimer’s Association. In addition to awareness surrounding Alzheimer’s research, David hopes to bring the creative and health benefits of knitting to a wider audience.\nDavid explains his choice for crochet flowers by stating, “the Alzheimer's Association has a flower tradition as part of their \"Walk to End Alzheimer's\" events. They give all of the participants a pinwheel flower with colors based on their relationship to someone who has Alzheimer's. During the event, you hold up the flower in memory of those affected by the disease, so my flowers will be Alzheimer's flowers. I hope that this will help people remember how devastating this disease is and that they can do something to help.”\nLion Brand® will be hosting David for a few events leading up to his 2015 TCS New York City Marathon run, beginning on Thursday, October 29th:\nThursday, October 29th, 2015 at 1pm: Learn to finger-crochet flowers while moving, like David Babcock! Join runner David Babcock for an hour-long, easy-paced walk and talk in Central Park. David will teach his technique, and Lion Brand® will have yarn supply on hand. Meet at the Daniel Webster Statue on the west side of 72nd street Transverse in Central Park. Free. No rain date.\nThursday, October 29th, 2015 at 6pm: David Babcock will give a talk at the Lion Brand® Yarn Studio and demonstrate his finger crochet technique. 34 West 15th street, Manhattan (Union Square neighborhood). Space is limited. To RSVP, visit lionbrandyarnstudio.com.\nSunday, November 1st, Marathon Day: Watch for David from the New York City Chapter of the Alzheimer’s Association’s cheering station at Mile 22 (110th Street & 5th Avenue) or download the 2015 TCS New York City Marathon Mobile App and track his progress from wherever you are.\nAbout Lion Brand® Yarn Company\nLion Brand® Yarn Company is a 5th generation, family-owned and operated business, and a beloved American brand since 1878. The company is devoted to inspiring and educating knitters and crocheters with yarns, patterns, how-tos, and ideas that elevate their yarn crafting experience. Visit lionbrand.com.\nAbout David Babcock\nFeatured in the New York Times and around the world, David Babcock is the Guinness World Record holder for knitting the longest scarf (12 feet!) while running a marathon, which he did in Kansas City on October 20th, 2013. Coupled with a great deal of skill and endurance, David credits his choice in using Lion Brand’s Hometown USA as a factor in his amazing accomplishment!\nAbout The Alzheimer’s Association, New York City Chapter\nThe Alzheimer’s Association, New York City Chapter provides free information, confidential assistance and support for those with Alzheimer’s disease and related dementias, as well as for their family members, caregivers and professionals. Our core programs include a 24-hour Helpline, Care Consultation, Education and Training, Support Groups, Early Stage Services and MedicAlert® + Alzheimer's Association Safe Return®. The Chapter actively advocates at the city, state and federal level to support related legislation and heighten public awareness. The Chapter’s mission is to eliminate Alzheimer’s disease through the advancement of research; to provide and enhance care and support for all affected; and to reduce the risk of dementia through the promotion of brain health.\nHigh-resolution photos and video are available for free media use on request.\n //www.prweb.com/releases/2015/10/prweb13019529.htm\n ", "external_links": ["http://www.prweb.com/releases/2015/10/prweb13019529.htm"], "published": "2015-10-15T12:02:00.000+03:00", "crawled": "2015-10-15T17:12:31.502+03:00", "highlightTitle": ""}