{"organizations": [], "uuid": "26847d4ec520522a87020b2b26e209a4923bb01e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsmv.com", "main_image": "http://wsmv.images.worldnow.com/images/3677863_G.jpg", "site_section": "http://wsmv.com//category/211167/entertainment?clienttype=rss", "section_title": "WSMV Nashville - Entertainment", "url": "http://www.wsmv.com/story/30266137/dolly-parton-addresses-rumors-about-her-health", "country": "US", "title": "Dolly Parton addresses rumors about her health", "performance_score": 0, "site": "wsmv.com", "participants_count": 1, "title_full": "Dolly Parton addresses rumors about her health", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T12:51:00.000+03:00", "replies_count": 0, "uuid": "26847d4ec520522a87020b2b26e209a4923bb01e"}, "author": "Kara Apel", "url": "http://www.wsmv.com/story/30266137/dolly-parton-addresses-rumors-about-her-health", "ord_in_thread": 0, "title": "Dolly Parton addresses rumors about her health", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Dolly Parton addresses rumors about her health Posted: Dolly Parton is busy filming a movie for NBC. NASHVILLE, TN (WSMV) - \nSinger Dolly Parton is clearing up some rumors about her health. \nRumors were circulating online that she was battling stomach cancer, but Parton says that is not true. \nParton said she had kidney stones removed a couple weeks ago but is doing fine now. \nShe has been keeping busy at Dollywood, filming scenes for her new movie, Coat of Many Colors. The movie premieres on Channel 4 on Dec. 10. \nHere is Parton's full statement: \nIt is true that I had kidney stones. I had them removed three weeks ago and I am doing just fine! I am back to work and last week I was at Dollywood filming parts for my new movie \"Coat of Many Colors,\" which premieres December 10th on NBC. With the 30th Anniversary of Dollywood, I did a full week of activities promoting my new DreamMore Resort's opening. There is absolutely no truth at all that I have stomach cancer. I love and appreciate everyone's concern. \nCopyright 2015 WSMV (Meredith Corporation).   Updated: Thursday, October 15 2015 7:24 AM EDT 2015-10-15 11:24:09 GMT President Barack Obama will keep 5,500 U.S. troops in Afghanistan when he leaves office in 2017, according to senior administration officials, casting aside his promise to end the war on his watch and instead... More >> President Barack Obama will keep 5,500 U.S. troops in Afghanistan when he leaves office in 2017, according to senior administration officials, casting aside his promise to end the war on his watch and instead ensuring he... More >> TSU senior among White House All-Star students A Tennessee State University senior is among 83 students being recognized by the White House for their academic achievement and leadership. More >> A Tennessee State University senior is among 83 students being recognized by the White House for their academic achievement and leadership. More >> Clinton names 46-member leadership team in Tennessee Democratic presidential candidate Hillary Rodham Clinton has named a 46-member Tennessee leadership team headlined by U.S. Reps. Jim Cooper of Nashville and Steve Cohen of Memphis. More >> Democratic presidential candidate Hillary Rodham Clinton has named a 46-member Tennessee leadership team headlined by U.S. Reps. Jim Cooper of Nashville and Steve Cohen of Memphis. More >> UT president says school committed to inclusion, diversity The president of the University of Tennessee says it's committed to inclusion and diversity even though references to the use of gender-neutral pronouns were removed from a school website. More >> The president of the University of Tennessee says it's committed to inclusion and diversity even though references to the use of gender-neutral pronouns were removed from a school website. More >>", "external_links": [], "published": "2015-10-15T12:51:00.000+03:00", "crawled": "2015-10-15T14:50:20.436+03:00", "highlightTitle": ""}