{"organizations": [], "uuid": "140a8085ddd79ccc33255e53cc95b1b3170e1f08", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.contactmusic.com", "main_image": "http://www.contactmusic.com/pics/ln/20140410/oklahoma_screening_100414_02/maureen-o-hara-2014-tcm-classic-film_4150431.jpg", "site_section": "http://www.contactmusic.com/rss/contactmusic_news_pictures.xml\r", "section_title": "Contactmusic Ltd | Entertainment Headlines with Pictures", "url": "http://www.contactmusic.com/news/maureen-ohara-dies-aged-95_4992626", "country": "", "title": "Maureen O'Hara, Star From The Golden Age Of Hollywood, Dies Aged 95", "performance_score": 0, "site": "contactmusic.com", "participants_count": 0, "title_full": "Maureen O'Hara, Star From The Golden Age Of Hollywood, Dies Aged 95", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T01:30:00.000+03:00", "replies_count": 0, "uuid": "140a8085ddd79ccc33255e53cc95b1b3170e1f08"}, "author": "", "url": "http://www.contactmusic.com/news/maureen-ohara-dies-aged-95_4992626", "ord_in_thread": 0, "title": "Maureen O'Hara, Star From The Golden Age Of Hollywood, Dies Aged 95", "locations": ["Hollywood"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Maureen O'Hara"], "text": "Maureen O'Hara, Star From The Golden Age Of Hollywood,... Maureen O'Hara, Star From The Golden Age Of Hollywood, Dies Aged 95 Comment \nO'Hara, star of many movies from the golden age of Hollywood, passed away at her home in Idaho on Saturday. \nMaureen O’Hara, one of the last remaining stars from Hollywood’s golden age, has passed away at the age of 95. \nThe Irish-American actress, who was the leading lady in several movies alongside the iconic John Wayne, including The Quiet Man , and in the 1941 Oscar-winning picture How Green Was My Valley , died in her sleep in Boise, Idaho on Saturday (October 24th), according to her agent Johnny Nicoletti. Maureen O'Hara, 1920-2015 \n“Her characters were feisty and fearless, just as she was in real life,” her family said in a statement. “She was also proudly Irish and spent her entire lifetime sharing her heritage and the wonderful culture of the Emerald Isle with the world. She passed peacefully surrounded by her loving family as they celebrated her life listening to music from her favourite movie, The Quiet Man .” \nMore: Kelly Clarkson announces she’s having a baby boy \nBorn in Dublin, O’Hara moved to the United States in 1939, later becoming an American citizen. After a couple of minor roles, including her first ever credit in My Irish Molly (the only one in which she used her real name FitzSimons), she was picked to star in the drama How Green Was My Valley , an enormously popular saga about a Welsh mining family that beat out Orson Welles’ Citizen Kane to win Best Picture at the Oscars. \nShe starred in several extremely popular films subsequently, including five alongside John Wayne, and famous movies such as The Parent Trap , Our Man In Havana and Miracle on 34th Street . She effectively retired from acting in 1978 when her husband died in a plane crash, and she took over his job of running a commercial airline. RIP #MaureenOHara from one tough redhead broad to another. Thankful for the light you shared https://t.co/TFX3GkJVi4 pic.twitter.com/ExAupBOIFc — Jessica Chastain (@jes_chastain) October 24, 2015 \nO’Hara was an inspiration to many modern movie stars, including Jessica Chastain who tweeted her tribute upon hearing the sad news. “RIP #MaureenOHara from one tough redhead broad to another. Thankful for the light you shared.” \nNicknamed as ‘The Queen of Technicolour’ because of her eye-catching red hair, which many commented looked great on camera along with her pale complexion, she told The Telegraph last year that people remembered her because she had talent. “I proved there was a bloody good actress in me. It wasn't just my face. I gave bloody good performances.”", "external_links": [], "published": "2015-10-25T01:30:00.000+03:00", "crawled": "2015-10-25T01:25:55.344+02:00", "highlightTitle": ""}