{"organizations": [], "uuid": "4e0a2399e62364fae64c8cdef4c0acd0acfd4879", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.huffingtonpost.co.uk", "main_image": "http://i.huffpost.com/gen/3570614/images/o-JODIE-MARSH-facebook.jpg", "site_section": "http://www.huffingtonpost.co.uk//feeds/verticals/uk-entertainment/index.xml", "section_title": "UK Entertainment - The Huffington Post", "url": "http://www.huffingtonpost.co.uk/2015/10/22/jodie-marsh-documentary-filming-eggs_n_8356442.html", "country": "US", "title": "Jodie Marsh Issues Twitter Plea After Being 'Pelted With Eggs' While Filming New Benefits Documentary In Essex", "performance_score": 0, "site": "huffingtonpost.co.uk", "participants_count": 1, "title_full": "Jodie Marsh Issues Twitter Plea After Being 'Pelted With Eggs' While Filming New Benefits Documentary In Essex", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T16:08:00.000+03:00", "replies_count": 0, "uuid": "4e0a2399e62364fae64c8cdef4c0acd0acfd4879"}, "author": "Rachel McGrath", "url": "http://www.huffingtonpost.co.uk/2015/10/22/jodie-marsh-documentary-filming-eggs_n_8356442.html", "ord_in_thread": 0, "title": "Jodie Marsh Issues Twitter Plea After Being 'Pelted With Eggs' While Filming New Benefits Documentary In Essex", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Previous Story Next Story Jodie Marsh Issues Twitter Plea After Being 'Pelted With Eggs' While Filming New Benefits Documentary In Essex The Huffington Post UK | By Rachel McGrath reddit \nJodie Marsh has taken to Twitter to plea to the people of Jaywick, after reportedly being pelted with eggs while filming in the Essex town. \nThe former glamour model is making a new documentary about benefits, however it seems that the residents weren’t pleased with the presence of the Discovery Channel cameras, and the Mirror reports that six people threw eggs at Jodie and the crew. \nJodie Marsh \nShortly after the incident, Jodie took to Twitter, pleading her case with the residents of the Brooklands estate, which is officially listed as the most deprived area of the country: People of Jaywick: do NOT tar me or my film crew with the same brush as others. I pride myself on making HONEST, fair, decent documentaries \n— Jodie Marsh (@JodieMarsh) October 21, 2015 ... I know you have been screwed over by other film crews but I do NOT screw people over. I have been screwed over myself so I'm with you!! \n— Jodie Marsh (@JodieMarsh) October 21, 2015 I came to Jaywick to give you a voice and you chased us out of town. I didn't disrespect you so don't disrespect me! \n— Jodie Marsh (@JodieMarsh) October 21, 2015 I didn't JUDGE you, so don't judge me. If you watched any of my shows you would categorically KNOW that I don't stitch people up!! \n— Jodie Marsh (@JodieMarsh) October 21, 2015 You will only make yourself look bad if you are vile to me without giving me a chance to talk to you. Think about it.... I'm here & ready \nCouncillor Kevin Watson addressed the incident, telling the Mirror: “People have had enough. If the production companies had been fair in the first place then this wouldn’t have happened. \n“We spoke to the last production company in good faith about regeneration and the positive things, not about drugs and alcoholics. We are not getting involved in this one.” \nThe Jaywick neighbourhood was the topic of a previous documentary, ‘Benefits By The Sea’, but residents were’nt happy with the way the area was portrayed and many claimed it would bring house prices down. \nDetails of Jodie’s doc are yet to be confirmed, however it’s believed it will also focus on the number of residents who receive benefits on the Brooklands estate. Close Jodie Marsh's Most Outrageous Looks of   LONDON - MAY 16: Jodie Marsh poses with some flowers as she launches 'MTV's Jodie Marsh: Who Will Take Her Up the Aisle?' in Leicester Square on May 16, 2007 in London, England. Jodie will spend the summer trying to find a husband and the show will culminate in a marriage at the end of the summer. (Photo by Chris Jackson/Getty Images) BRENTWOOD, UNITED KINGDOM - DECEMBER 23: Model Jodie Marsh arrives for her 30th Birthday at Sugar Hut on December 23, 2008 in Essex, England. (Photo by Nat Jag/FilmMagic) Jodie Marsh Gives A Pole-Dancing Show At Stringfellow'S To Launch The New Scruffs Clothing And Boots Range. (Photo by Justin Goff\\UK Press via Getty Images) Jodie Marsh during Jodie Marsh Unveils 'Say No to Nuggets' PETA Ad Campaign at Oxford Circus Tube Station in London, Great Britain. (Photo by David Lodge/FilmMagic) Jodie Marsh Poses In A Candy G-String And Bra To Launch The Gift Of The Year Awards In London. . (Photo by Mark Cuthbert/UK Press via Getty Images) Jodie Marsh (Photo by J. Quinton/WireImage) Jodie Marsh during Just My Luck London Film Premiere at Vue West End in London, Great Britain. (Photo by Alan Weller/FilmMagic) Jodie Marsh during Reveal Magazine 1st Birthday - Arrivals at Living Room Heddon in London, Great Britain. (Photo by Mu Kei/FilmMagic) LONDON, ENGLAND - MAY 06: Jodie Marsh attends Aisleyne's book launch party at Studio Valbonne on May 6, 2009 in London, England. (Photo by Simon James/FilmMagic) LONDON - NOVEMBER 26: Jodie Marsh and girlfriend Nina attend the HumanHi Christmas Party And Launch Of Johnny Ikon at Volstead on November 26, 2008 in London, England. (Photo by Danny Martindale/WireImage) Jodie Marsh during TV Moments 2004 Awards - Outside Arrivals at BBC Television Centre in London, Great Britain. (Photo by Goffredo di Crollalanza/FilmMagic) Jodie Marsh during Grease DVD Launch Party at All Star Lanes in London, Great Britain. (Photo by David Westing/WireImage) Jodie Marsh Attends The Opening Night Gala Of 'Murderous Instincts' At London'S Savoy Theatre. (Photo by Justin Goff\\UK Press via Getty Images) LONDON - AUGUST 27: Jodie Marsh attends the UK Premiere of Daylight Robbery at the Apollo West End Cinema on August 27, 2008 in London, England. (Photo by Fred Duval/FilmMagic) LONDON - AUGUST 27: Jodie Marsh arrives at the UK Film Premiere of Daylight Robbery at the Apollo West End on August 27, 2008 in London, England. (Photo by Chris Jackson/Getty Images) LONDON - APRIL 21: Jodie Marsh attends the Three and Out film premiere held at the Odeon Leicester Square on April 21, 2008 in London, England. (Photo by Jon Furniss/WireImage) Jodie Marsh appearing on No 1 Leicester Square.The show will be broadcast on MTV at 10.00pm on Monday (Photo by Eamonn McCormack/WireImage) Jodie Marsh (Photo by Martin Doyle/FilmMagic) Jodie Marsh Attends The Fhm 100 Sexiest Women In The World Party 2006 At London'S Madame Tussauds. (Photo by James Whatling/UK Press via Getty Images) Jodie Marsh at the Suga Suga in London, United Kingdom. (Photo by James Quinton/WireImage) Glamour Model Jodie Marsh Shows Her Support For A Campaign To Save On Waste By Taking Your Own Mugs In Coffee Shops At Whitechapel, London,. (Photo by Mark Cuthbert/UK Press via Getty Images) Jodie Marsh Attends The 'Basic Instinct 2: Risk Addiction' World Film Premiere At The Vue Cinema In London'S Leicester Square. (Photo by Justin Goff\\UK Press via Getty Images) LONDON - NOVEMBER 9: Jodie Marsh performs at the Lick Poverty In Style Fashion Show at Tantra on November 9, 2005 in London, England. The charity catwalk show is held in aid of ActionAid's Lick Child Poverty campaign and is organised by Kaiz Boutique. (Photo by Chris Harding/Getty Images) Jodie Marsh during Opening of Playboy Photography Exhibition at the Proud Gallery at Sony Ericsson Proud, Camden in London, Great Britain. (Photo by C. Uncle/FilmMagic) LONDON - SEPTEMBER 26: Model Jodie Marsh attends the aftershow party following the UK Premiere of 'Deuce Bigalow: European Gigolo,' at China Whites on September 26, 2005 in London, England. (Photo by David Westing/Getty Images) Jodie Marsh Attends 'The Dukes Of Hazzard' Uk Film Premiere At The Vue Cinema In London'S Leicester Square. . (Photo by Mark Cuthbert/UK Press via Getty Images) Jodie Marsh Promotes The Remington Body Hair Trimmer At A Photocall In London. The Latest Trend Is For Low-Slung Jeans - Known As 'Pubic Pants'. (Photo by Justin Goff\\UK Press via Getty Images) LONDON - APRIL 21: Glamour model Jodie Marsh attends 'FHM's 100 Sexiest Women In The World Party' hosted by the men's monthly magazine, at Umbaba on April 21, 2005 in London. The party celebrates the annual poll of 100 sexiest women as voted for by readers. (Photo by David Westing/Getty Images) LONDON - OCTOBER 31: Jodie Marsh attends the Safety Net Ball in aid of the Marine Connection October 31, 2007 at the Grosvenor House Hotel in London, England. (Photo by Ferdaus Shamim/WireImage) Jodie Marsh Attends The People For The People Charity Concert, In Aid Of The World Unite Appeal In London. . (Photo by UK Press/UK Press via Getty Images) LONDON - OCTOBER 12: Model Jodie Marsh attends the Ronan Keating's Album Launch Party to celebrate yesterday's release of his new album/DVD '10 Years Of Hits' at Cafe de Paris on October 12, 2004 in London, England. Marking ten years at Polydor, the collection includes 11 hit singles, three Boyzone covers and two brand new tracks. (Photo by Dave Hogan/Getty Images) Jodie Marsh (Photo by Tom O'Donnell/WireImage) LONDON - NOVEMBER 12: Model Jodie Marsh arrives at the HumanHi Party held at Volsted on November 12, 2008 in London, England. (Photo by Nat Jag/FilmMagic) Jodie Marsh during 'Dodgeball' London Premiere - Arrivals at Odeon Kensington in London, Great Britain. (Photo by J. Quinton/WireImage) LONDON, ENGLAND - JUNE 14: (EMBARGOED FOR PUBLICATION IN UK TABLOID NEWSPAPERS UNTIL 48 HOURS AFTER CREATE DATE AND TIME. MANDATORY CREDIT PHOTO BY DAVE M. BENETT/GETTY IMAGES REQUIRED) Jodie Marsh attends Boy George's 50th Birthday celebration on June 14, 2011 in London, England. (Photo by Dave M. Benett/Getty Images) Jodie Marsh Attends The Fhm Magazine'S 100 Sexiest Women Party In London. . (Photo by Mark Cuthbert/UK Press via Getty Images) Jodie Marsh during Cirque Party - April 1, 2004 at Hippodrome Nightclub in London, England, Great Britain. (Photo by J. Quinton/WireImage) Jodie Marsh during 'Scooby-Doo 2: Monsters Unleashed' London Premiere - Arrivals at Islington Warner Village in London, Great Britain. (Photo by Mike Marsland/WireImage)  Share", "external_links": [], "published": "2015-10-22T16:08:00.000+03:00", "crawled": "2015-10-22T16:27:48.587+03:00", "highlightTitle": ""}