{"organizations": [], "uuid": "828cb045ae6596cf6e9762bcb7a4dfcb16605d6c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "", "site_section": "http://www.financialexpress.com/section/lifestyle/", "section_title": "Lifestyle News:Entertainment News,Bollywood Latest News,Box Office Collection Report,Movie Reviews | The Financial Express", "url": "http://www.financialexpress.com/article/lifestyle/health/sitting-for-long-periods-not-bad-for-health-study/151145", "country": "IE", "title": "Sitting for long periods not bad for health: study", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Sitting for long periods not bad for health: study | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T04:40:00.000+03:00", "replies_count": 0, "uuid": "828cb045ae6596cf6e9762bcb7a4dfcb16605d6c"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/lifestyle/health/sitting-for-long-periods-not-bad-for-health-study/151145", "ord_in_thread": 0, "title": "Sitting for long periods not bad for health: study", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Armed malaria protein provides hope for general cancer cure Your Facebook, Twitter posts may hold clues to your health Enjoy black coffee? You may be a psychopath Good news for couch potatoes! Sitting, either at home or at work, is not associated with an increased risk of dying, according to a new study which included more than 5,000 people.\nThe study from the University of Exeter and University College London challenges claims by previous research that sitting for long periods increases the risk of an early death even if you are otherwise physically active.\nThe study followed more than 5,000 participants for 16 years, making it one of the longest follow-up studies in this area of research.\n“Our study overturns current thinking on the health risks of sitting and indicates that the problem lies in the absence of movement rather than the time spent sitting itself,” said Dr Melvyn Hillsdon from Sport and Health Sciences at the University of Exeter.\n“Any stationary posture where energy expenditure is low may be detrimental to health, be it sitting or standing,” Hillsdon said.\n“The results cast doubt on the benefits of sit-stand work stations, which employers are increasingly providing to promote healthy working environments,” said Hillsdon.\nThe study participants provided information on total sitting time and on four other specific types of sitting behaviour (sitting at work; during leisure time; while watching TV; and sitting during leisure time excluding TV) as well as details on daily walking and time spent engaged in moderate to vigorous physical activity.\nAge, gender, ethnicity, socioeconomic status, general health, smoking, alcohol consumption and diet were all taken into account. The study showed that over the 16 year follow-up period none of these five sitting measures influenced mortality risk.\nFuture work will consider whether long periods of sitting are associated with increased incidence of diseases such as heart disease and type II diabetes, and will investigate the biological mechanisms that underpin previously observed associations between sitting time and health outcomes.\nThe study is published in the International Journal of Epidemiology.\n 14, 2015 8:40 pm", "external_links": [], "published": "2015-10-15T04:40:00.000+03:00", "crawled": "2015-10-15T00:11:08.195+03:00", "highlightTitle": ""}