{"organizations": [], "uuid": "2bd9c694572056e627347804a444ffcc41217eb1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.arcamax.com", "main_image": "http://www.arcamax.com/newspics/131/13133/1313369.jpg", "site_section": "http://www.arcamax.com/", "section_title": "News &amp; Entertainment by Email | ArcaMax Publishing", "url": "http://www.arcamax.com/currentnews/newsheadlines/s-1734202?fs", "country": "US", "title": "Russians strike Syria with cruise missiles, engage in first ground battle | & Features", "performance_score": 0, "site": "arcamax.com", "participants_count": 1, "title_full": "Russians strike Syria with cruise missiles, engage in first ground battle | News & Features | ArcaMax Publishing", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T03:00:00.000+03:00", "replies_count": 0, "uuid": "2bd9c694572056e627347804a444ffcc41217eb1"}, "author": "arcamax.com", "url": "http://www.arcamax.com/currentnews/newsheadlines/s-1734202?fs", "ord_in_thread": 0, "title": "Russians strike Syria with cruise missiles, engage in first ground battle | & Features", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "IRBIL, Iraq -- Russian forces supporting embattled Syrian President Bashar Assad fired 26 cruise missiles from ships based in the Caspian Sea into eastern Syria on Wednesday in an escalation of Russian involvement in the country's brutal conflict.\nThe strikes, spanning almost 1,000 miles of precision flight, were by far the longest-range attack by Russian forces in modern history.\nThe cruise missiles flew over the Caucasus Mountains, Iran and Iraq before veering toward Islamic State-held areas, shocking military analysts who said they were unaware that the weapons had such long-range capability.\n\"We knew that both the Gepard frigate and Buyan corvettes were capable of launching land-attack cruise missiles, but the apparent range of the missiles has come as a surprise to us,\" Jeremy Binnie, a weapons expert for Janes IHS, the London-based defense think tank, said, referring to two types of Russian ships.\nThe direction from which the attack occurred also was something of a surprise. While Western news media had reported Russia's dispatch of four ships to the Mediterranean west of Syria in recent days, there had been little public notice of Russian ship deployments in the Caspian, a landlocked body of water bordered on all sides by Russian allies or former Soviet republics.\nNavy Capt. Jeff Davis, a Pentagon spokesman, said U.S. military officials knew that the Russian fleet in the Caspian was equipped with cruise missiles, but he said he did not know if the Russians had notified Iraq, a U.S. ally, that they would fly through its airspace. Iraq previously has permitted Iranian planes to overfly its territory to ferry supplies to the Assad government.\nIn another sign of Moscow's military escalation in the war-torn Middle East country, Russian helicopters apparently were used to ferry Syrian government forces in an offensive to push back anti-government forces in the country's west.\nA Syrian rebel commander said the offensive included airstrikes, helicopter-borne paratroopers, tanks and artillery, targeting three downs in Idlib province near Syria's border with Turkey and a fourth village in Hama province.\nMaj. Mustafa Alkenj, a commander with the 13th division of the Free Syrian Army, said his forces managed to repel the assault. He provided a lopsided account of the battle, saying that as many as 50 government-aligned fighters had died and that none of his forces was killed.\nThere was no confirmation of the casualty figures. Syrian government officials told The Associated Press that the new ground offensive was aimed at reclaiming rebel-held areas in Idlib, Hama and Homs provinces, the area of northwestern Syria where most of the Russian airstrikes have been concentrated over the past week.\nThe Pentagon, meanwhile, said for the first time that Moscow's still-young air campaign had caused at least one American bomber to change course in order to avoid a possible collision or conflict with a Russian aircraft.\n\"We have taken measures to reroute aircraft as necessary when there's an aircraft that's getting close,\" Davis said.\nHe added: \"Over Syria we're taking action as necessary to ensure safe separation\" of U.S.-led and Russian bombers.\nDavis said that U.S. and Russian military officials would hold a second round of formal talks aimed at keeping their forces in Syria from interfering with one another, a process known as \"de-conflicting.\"\n\"We continue to believe that having these talks with Russia about air safety would serve a useful purpose,\" he said.\nIt was unclear how much damage the Russian cruise missiles had caused. At least one was reported to have hit Tabqa, a former Syrian government military base west of Raqqa, the defacto Islamic State capital.\nTargeting Tabqa may have represented a reprisal attack by Moscow. In a brutal assault 14 months ago, Islamic State militants seized the air base and then beheaded soldiers loyal to Assad.\nThe cruise missile attack was announced on Russian state television during a meeting between President Vladimir Putin, who was celebrating his 63rd birthday, and his top military advisers.\n\"Besides using aviation to destroy militants, this morning ships from the Caspian Flotilla were brought in,\" Russian Defense Minister Sergei Shoigu told Putin during the televised session. \"Four destroyers launched 26 Kalibr sea-based cruise missiles at 11 targets.\"\nShoigu added: \"The fact that we launched high-precision missiles from the Caspian Sea at approximately 1,500 kilometers (932 miles) and hit all of the targets says much about the good training in the military-industrial complex and high skills of the staff.\"\nThe Kalibr supersonic cruise missile was deployed this summer for the first time after seven years of testing and development. While the new missile system had been seen as a potential threat to Western European targets, the demonstration of its more than 900-mile range surprised some experts on Russian military hardware.\nSome American officials said that besides delivering powerful explosives, the Russian missiles carried a political message.\n\"Russia launched cruise missiles as part of Putin's propaganda campaign to show Russia as a modern military force able to strike targets from long distances,\" said a U.S. intelligence official, who requested anonymity because he wasn't authorized to speak on the record.\nThe missile launches showed Putin's domestic audience that Russia is back on the international stage, the intelligence official said, while demonstrating to the United States and its allies that it is prepared \"to use a broad range of capabilities to prop up\" the Assad regime.\nAfter a summer of significant setbacks at the hands of Islamic State militants and other anti-government fighters, Syrian forces are expected to use Russia's new support to push out from government-controlled areas in the western third of the country.\nDavis, the Pentagon spokesman, said U.S. military officials have seen \"forward deployment\" in that region of Russian troops, artillery pieces and multiple-rocket launchers.\n(Prothero reported from Irbil, Gutman from Istanbul and Rosen from Washington. Jonathan S. Landay in Washington contributed.)\n(c)2015 McClatchy Washington Bureau\nVisit the McClatchy Washington Bureau at www.mcclatchydc.com\nDistributed by Tribune Content Agency, LLC.\nGRAPHIC (for help with images, contact 312-222-4194): 20151007 Russia missiles\nVIDEO (for help with video, contact 312-222-4196): Russia Syria\nShare Comment", "external_links": ["https://plus.google.com/share?url=http://www.arcamax.com/currentnews/newsheadlines/s-1734202", "http://twitter.com/share?url=http://www.arcamax.com/currentnews/newsheadlines/s-1734202&hashtags=ArcaMax", "http://www.facebook.com/sharer.php?u=http://www.arcamax.com/currentnews/newsheadlines/s-1734202&h=Russians+strike+Syria+with+cruise+missiles%2C+engage+in+first+ground+battle"], "published": "2015-10-07T03:00:00.000+03:00", "crawled": "2015-10-08T12:02:56.025+03:00", "highlightTitle": ""}