{"organizations": [], "uuid": "395896b31f72ffc3f75cc315e2955ee7482deb2c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/49452939.cms", "site_section": "http://timesofindia.indiatimes.com/entertainment/hindi/music/music-events/articlelist/6747187.cms", "section_title": "Music Events - Music - Hindi - Entertainment - The Times of India", "url": "http://timesofindia.indiatimes.com/entertainment/hindi/music/music-events/Classical-vocalist-Shubha-Mudgal-pays-tribute-to-Indias-Mallika-e-Ghazal/articleshow/49452799.cms", "country": "IL", "title": "Classical vocalist Shubha Mudgal pays tribute to India’s Mallika-e-Ghazal", "performance_score": 0, "site": "indiatimes.com", "participants_count": 1, "title_full": "Classical vocalist Shubha Mudgal pays tribute to India’s Mallika-e-Ghazal - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "395896b31f72ffc3f75cc315e2955ee7482deb2c"}, "author": "Itishree Misra", "url": "http://timesofindia.indiatimes.com/entertainment/hindi/music/music-events/Classical-vocalist-Shubha-Mudgal-pays-tribute-to-Indias-Mallika-e-Ghazal/articleshow/49452799.cms", "ord_in_thread": 0, "title": "Classical vocalist Shubha Mudgal pays tribute to India’s Mallika-e-Ghazal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Nawabs patronage to the arts and music made Oudh a hub for performing arts. Begum Akhtar, known as Mallika-E-Ghazal or the queen of ghazals, was a product of the flourishing art scene in the city.\nThe Padma Shri and Padma Bhushan awardee from Lucknow, Begum Akhtar is still remembered for her ghazals, thumri and dadra . Born in Faizabad, Begum Akhtar began singing from the tender age of seven. Her singing was praised by the likes of Sarojini Naidu and she became the first lady artiste to give concerts, breaking away from the tradition of private mehfils and gatherings. So popular was Akhtari bai's singing, that she also acted in a few movies including Mehboob Khan's Roti in 1942. \"As is the case with most path breakers in performing arts, the music of the legendary Begum Akhtar is characterised by an originality that defies easy articulation,\" says singer Shubha Mudgal, who calls herself the biggest fan of the Ghazal Queen. Mudgal also paid a fitting tribute to the singer in Lucknow last year, on the occasion of Begum sa'ab's 100th birthday celebrations.\nREAD: Shubha Mudgal: Popular and folk music can coexist in India\n\"It was her ability to speak to her listeners through her music that made her unforgettable,\" says Mudgal, while sharing that she and her husband listen to Begum Akhtar's ghazals constantly. \"Awadhi culture and arts coloured her music indelibly. In a sense, an artiste belongs to no one community or geographical region, and yet, the work of every artiste is also rooted and tethered somewhere,\" says Mudgal adding, \"Begum Akhtar's music is most definitely tethered to Lucknow, but a Lucknow that perhaps is fast turning into yet another Indian city where the arts and music no longer enjoy the stature they did in her lifetime.\"\nFor latest Music updates follow us on Twitter >>> @TOIEntertain\nFor the latest in Music news, like us on Facebook >>> TOIEntertain\nLISTEN: Songs of Shubha Mudgal on Gaana.com\nWATCH: Shubha Mudgal - Mann Ke Manjeere", "external_links": ["http://gaana.com/artist/shubha-mudgal"], "published": "2015-10-20T03:00:00.000+03:00", "crawled": "2015-10-24T08:36:41.415+03:00", "highlightTitle": ""}