{"organizations": [], "uuid": "942ce6449cbc92c33ef100dc25fd76c5053fd3b1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.deseretnews.com", "main_image": "http://img.deseretnews.com/images/article/hires/1609108/1609108.jpg", "site_section": "http://www.deseretnews.com/family/arts-entertainment/index.rss", "section_title": "The latest entertainment, arts, movie reviews, music reviews, video game reviews and book reviews - Deseret News", "url": "http://www.deseretnews.com/article/865638681/Chris-Hicks-Disney7s-6Aladdin7-released-on-Blu-ray-for-the-first-time.html", "country": "US", "title": "Chris Hicks: Disney’s ‘Aladdin’ released on Blu-ray for the first time", "performance_score": 0, "site": "deseretnews.com", "participants_count": 1, "title_full": "Chris Hicks: Disney’s ‘Aladdin’ released on Blu-ray for the first time | Deseret News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T03:00:00.000+03:00", "replies_count": 0, "uuid": "942ce6449cbc92c33ef100dc25fd76c5053fd3b1"}, "author": "Chris Hicks", "url": "http://www.deseretnews.com/article/865638681/Chris-Hicks-Disney7s-6Aladdin7-released-on-Blu-ray-for-the-first-time.html", "ord_in_thread": 0, "title": "Chris Hicks: Disney’s ‘Aladdin’ released on Blu-ray for the first time", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Disney’s animated hit “Aladdin” gets a Blu-ray upgrade, along with several other vintage titles, and the fourth “Peanuts” movie arrives on DVD for the first time.\nIt’s hard to believe Disney’s “Aladdin” has never been on Blu-ray, and it’s even harder to think that one of the most popular “Peanuts” theatrical films has never been on DVD. But fans will be happy to know that both injustices are being rectified.\n“Aladdin” (Disney/Blu-ray/DVD/Digital, 1992, G, text commentary, deleted scenes/songs, featurettes, outtakes, interactive games). One of Disney’s best animated features during its early 1990s resurgence was this retelling of the classic story of Aladdin and his magic lamp.\n“Beauty and the Beast” was a tough act to follow, so Disney wisely came up with something completely different, a manic farce that would have made the anarchic Warner Bros. cartoonists proud. First and foremost is the unforgettably hilarious genie, thanks to the comic abilities of the late Robin Williams. But there’s also plenty of other comedy, exciting adventure and memorable songs.\nThe Blu-ray enhancement is fabulous, and there are new bonus features along with all the extras from the 2004 DVD release.\n“Bon Voyage, Charlie Brown (and Don’t Come Back!!)” (Paramount/DVD, 1980, G, featurette). The fourth theatrical feature in the animated “Peanuts” franchise is now celebrating its 35th anniversary with this newly remastered release. The story has Charlie Brown, Linus, Peppermint Patty and Marcie as exchange students in Paris, with Snoopy and Woodstock garnering most of the laughs as they investigate a spooky chateau.\n“Jackie Chan’s First Strike” (Warner/Blu-ray, 1997, PG-13).\n“Rumble in the Bronx” (Warner/Blu-ray, 1996, R for violence and language). Fans of Jackie Chan will no doubt enjoy these Blu-ray upgrades of a pair of mid-’90s action flicks that were developed with Western audiences in mind. And if you’re not a fan, these two aren’t a bad place to start.\n“Rumble” came first, a major attempt to reach American moviegoers in a way Chan had not been able to achieve before. And it worked, though not quite at the level he had hoped, perhaps because it’s darker than most of his pictures. Chan plays a Chinese cop in New York battling bikers and mobsters, and it’s a good example of his distinctive comic-fighting style, part Bruce Willis and part Buster Keaton.\n“Strike” is much lighter fare (the fourth in his “Police Story” franchise), with Chan doing his James Bond impersonation in a bigger-budget effort than usual, traveling to Ukraine, Russia, Australia and Hong Kong as he takes on Russian mobsters. Chan’s outrageous death-defying stunt work is in full force, and he’s back in hapless everyman mode. This one is alternately harrowing and hilarious.\n“Christine” (Columbia/Blu-ray, 1983, R for violence and language, deleted scenes, audio commentary, featurettes). Based on Stephen King’s novel, this fright flick is about a killer car — a “cherry” 1958 Plymouth Fury with candy-apple red exterior and a radio that plays only 1950s rock ’n’ roll. The car is apparently possessed, as is the owner, a wimpy high schooler (Keith Gordon) who turns into something resembling Jerry Lewis’ Buddy Love in “The Nutty Professor.” The violence is surprisingly restrained (wish I could say the same for the overabundance of crass language), with director John Carpenter (“Halloween”) emphasizing flashy visuals (enhanced by this Blu-ray upgrade). Still, the premise is pretty ridiculous.", "external_links": [], "published": "2015-10-11T03:00:00.000+03:00", "crawled": "2015-10-11T10:24:05.236+03:00", "highlightTitle": ""}