{"organizations": [], "uuid": "7a5a15943e86f032fc27994cda87f149fd95b3b7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wtsp.com", "main_image": "http://cdn.tegna-tv.com/-mm-/c4f93fb94fd78bc94134a764563012517bc51af3/c=33-0-1739-964&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/26/WTSP/WTSP/635814703795774920-trump.jpg", "site_section": "http://rssfeeds.wtsp.com/_/20/110077714/wtsp/entertainmentnews", "section_title": "WTSP - Entertainment", "url": "http://www.wtsp.com/story/news/politics/2015/10/26/questions-over-equal-time-from-donald-trump-on-saturday-night-live/74634642/", "country": "US", "title": "Will Trump's 'SNL' hosting trigger equal time for others?", "performance_score": 0, "site": "wtsp.com", "participants_count": 0, "title_full": "Will Trump's 'SNL' hosting trigger equal time for others?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T21:56:00.000+02:00", "replies_count": 0, "uuid": "7a5a15943e86f032fc27994cda87f149fd95b3b7"}, "author": "", "url": "http://www.wtsp.com/story/news/politics/2015/10/26/questions-over-equal-time-from-donald-trump-on-saturday-night-live/74634642/", "ord_in_thread": 0, "title": "Will Trump's 'SNL' hosting trigger equal time for others?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Donald Trump", "Will Trump"], "text": "Will Trump's 'SNL' hosting trigger equal time for others? 3:56 p.m. EDT October 26, 2015 Donald Trump is returning to \"Saturday Night Live\" for another appearance. (Photo: NBC) CONNECT TWEET LINKEDIN COMMENT EMAIL MORE \nPresidential candidate Donald Trump heads back to reality television -- and NBC -- in a couple of weeks. Sort of! \nTrump will host \"Saturday Night Live\" on Nov. 7. You can bet his rivals for the Republican presidential nomination will be watching not only to hear what he has to say but also to see how much time he gets in front of the camera. \nThis won't be the first time Trump has hosted \"SNL\". That came in 2004, when Trump's show \"The Apprentice\" was a hit for NBC. At that time, Trump was a private citizen not running for public office. Now that he is, many wonder if the government's \"equal time\" rule means that Trump's competitors -- Ben Carson, Jeb Bush, Marco Rubio and the other Republican candidates -- will get a chance to host the show. PunditFact says the short answer is no. PunditFact checks Trump appearances on 'SNL' \n\"Equal time, or as experts like to call it equal opportunities, just guarantees that if a candidate appears on a broadcast network -- so, not cable news -- and isn't appearing on a news-oriented way -- so in 'SNL's case it's an entertainment program -- then the other candidates, if they're legally qualified in the markets where that episode runs, they're entitled to the same amount of time that Donald Trump gets on 'SNL' if they ask for it,\" says PunditFact's Katie Sanders. \nOn Oct. 3, Hillary Clinton appeared on an \"SNL\" skit for 3:12. Only one little-known candidate, Harvard law professor Larry Lessig, asked for free time on 47 NBC affiliates. So far, that request hasn't been decided because it's not clear if Lessig is a qualified candidate in all of those markets. \nIf a candidate's claim for free time is valid, PunditFact says it would have to be in a comparable time slot. In the case of \"Saturday Night Live,\" it would be late night. The candidates can do or say whatever they want, stations can't edit. \nClearly, NBC thinks the number of viewers they'll get from Trump's appearance \"trumps\" any potential problem from equal time requests. Read or Share this story: http://on.wtsp.com/1S6NZCB TOP VIDEOS", "external_links": [], "published": "2015-10-26T21:56:00.000+02:00", "crawled": "2015-10-26T22:41:22.620+02:00", "highlightTitle": ""}