{"organizations": [], "uuid": "7b0b424835c7ab3dd66ddcf4f9c3a9ddb9b9425b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nydailynews.com", "main_image": "http://assets.nydailynews.com/polopoly_fs/1.437807!/img/httpImage/image.jpg_gen/derivatives/landscape_1200/alg-roy-disney-jpg.jpg", "site_section": "http://www.nydailynews.com/entertainment/index.html", "section_title": "Entertainment News &amp; Reviews - NY Daily News", "url": "http://www.nydailynews.com/entertainment/roy-disney-nephew-walt-disney-dies-79-fight-cancer-article-1.434851", "country": "US", "title": "Roy Disney, nephew of Walt Disney, dies", "performance_score": 0, "site": "nydailynews.com", "participants_count": 1, "title_full": "Roy Disney, nephew of Walt Disney, dies - NY Daily News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "7b0b424835c7ab3dd66ddcf4f9c3a9ddb9b9425b"}, "author": "NEW YORK DAILY NEWS", "url": "http://www.nydailynews.com/entertainment/roy-disney-nephew-walt-disney-dies-79-fight-cancer-article-1.434851", "ord_in_thread": 0, "title": "Roy Disney, nephew of Walt Disney, dies", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Saxon/AP Roy Disney has died at the age of 79 after a year-long struggle with cancer. Roy E. Disney , the nephew of Walt Disney whose powerful behind-the-scenes influence on The Walt Disney Co. led to the departure of former chief Michael Eisner , has died. He was 79.\nThe company announced that Disney died Wednesday in Newport Beach , Calif. , after a yearlong bout with stomach cancer.\nCompany president and chief executive Bob Iger said Disney was much more than a valued 56-year company veteran.\n\"Roy's commitment to the art of animation was unparalleled and will always remain his personal legacy and one of his greatest contributions to Disney's past, present and future,\" Iger said in a statement.\nAlthough he generally stayed out of the spotlight, Roy Disney didn't hesitate to lead a successful campaign in 1984 to oust Walt Disney's son-in-law after concluding he was leading the company in the wrong direction.\nNearly 20 years later, he launched another successful shareholders revolt, this time against Eisner, the man he'd helped bring in after the previous ouster.\nEisner and his wife issued a statement expressing their sympathies over Disney's death.\nDon Hahn , an executive producer at the Disney movie studio, credited Roy Disney with ushering in a new era after taking over the animation department in 1984. Together, they helped make such blockbusters as \"Beauty and the Beast\" and \"The Lion King.\"\n\"He took it under his wing, was a cheerleader, a coach, therapist,\" Hahn said.\nJohn Lasseter , chief creative officer for Walt Disney and Pixar Animation Studios , also lauded Disney.\n\"He put his heart and soul into preserving Disney's legendary past, while helping to move the art of animation into the modern age by embracing new technology,\" Lasseter said.\nBorn in 1930, Roy Disney had practically grown up with the company. His uncle Walt Disney and his father, Roy O. Disney, had co-founded the Disney Brothers Cartoon Studio seven years before, later renaming it The Walt Disney Co.\nWhile Walt was the company's creative genius, his brother was the one in charge of the company's finances.\nStarting in the 1950s, the younger Roy Disney worked for years in the family business as an editor, screenwriter and producer. Two short films he worked on were nominated for Academy Awards : the 1959 \"Mysteries of the Deep,\" which he wrote, was nominated as best live action short, and the 2003 film \"Destino,\" which he co-produced, was nominated as best animated short.\nDespite his heritage, Roy Disney never got the chance to lead the company. But as an investor who grew his Disney stock into a billion-dollar fortune, he had a huge impact on the company's destiny.\nIn 1984, dissatisfied with the leadership Walt's son-in-law Ron Miller was providing, Disney resigned from the company's board of directors and sought investors to back a bid to install new management. (Miller was the husband of Diane Disney Miller , Roy's cousin.)\nHis efforts resulted in the hiring of Eisner and Frank Wells , who led the company as a team until Wells died in 1994.\nDuring that time, Disney rejoined the board and rose to become the company's vice chairman and chairman of its animation division. He also became a savvy investor over the years, forming Shamrock Holdings with his friend and fellow Disney board member Stanley Gold in 1978.\nThe fund grew to become a major investor in California real estate, the state of Israel and other entertainment and media companies.\nGold, president of Shamrock Holdings and a friend of Disney for 35 years, described him as steadfastly loyal to his principles and his friends.\n\"He was a gracious, humble gentleman,\" Gold said in a statement.\nAfter years of dissatisfaction with Eisner's leadership and the company's lagging stock price, Disney and Gold resigned their board seats in 2003 and launched a shareholder revolt.\nIn his resignation letter, Disney called for Eisner's ouster, complaining that on his watch the company's standards had declined, particularly at theme parks like California's Disneyland and Florida 's Walt Disney World .\nInitially rebuffed, Disney rallied small investors and enthusiasts who responded to his folksy complaints about peeling paint at the theme parks and his anger at being told he would have to leave the board because he was too old.\nShareholders eventually delivered an unprecedented rebuke to Eisner, withholding 45 percent of votes cast for his re-election to the board. The chief executive was later stripped of his role as board chairman and announced his retirement in 2005, a year before his contract was up.\nDisney initially opposed Iger, Eisner's successor, but they reconciled and in 2005 Iger named Disney a board member emeritus and welcomed him back to company events. Disney didn't attend board meetings and at the time of his death was no longer a significant shareholder.\nBorn in Los Angeles on Jan. 10, 1930, Roy Edward Disney was Roy and Edna Disney 's only child. As an adult, he bought a castle in Ireland and indulged his passion for yacht racing, setting several speed records.\nHe was also an active philanthropist, supporting the California Institute of the Arts in Valencia , a school founded by his father and uncle.\n\"It's kind of hard to imagine us without him,\" said school president Steven D. Lavine , citing Disney's unflagging support.\nIn 1999, he matched a gift from The Walt Disney Co. to establish an experimental theater space as part of the Walt Disney Concert Hall in Los Angeles. He named the theater for his parents.\nIn 2005, Disney pledged $10 million to establish the Roy and Patricia Disney Cancer Center at Providence St. Joseph Medical Center in Burbank .\nRelated News 'The Princess and the Frog' hops to top spot in box office with $25M Disney's first black princess makes an entrance 'Dreamgirl' Anika Noni Rose is Disney's history making 'Princess' Disney keeps up with the Jonases Disney adds princess-themed rings to wedding line Delete that Tweet! New contracts will silence the stars", "external_links": [], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-05T07:28:51.516+03:00", "highlightTitle": ""}