{"organizations": [], "uuid": "65e31978e12a637681303e302e60013fbcebf043", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nydailynews.com", "main_image": "http://assets.nydailynews.com/polopoly_fs/1.2394638!/img/httpImage/image.jpg_gen/derivatives/landscape_1200/leamichele13f-3-web.jpg", "site_section": "http://www.nydailynews.com/entertainment/index.html", "section_title": "Entertainment News &amp; Reviews - NY Daily News", "url": "http://www.nydailynews.com/entertainment/tv/lea-michele-suggests-hoping-glee-reboot-article-1.2394640", "country": "US", "title": "Lea Michele suggests she’s hoping for a ‘Glee’ reboot", "performance_score": 0, "site": "nydailynews.com", "participants_count": 1, "title_full": "Lea Michele suggests she’s hoping for a ‘Glee’ reboot - NY Daily News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "65e31978e12a637681303e302e60013fbcebf043"}, "author": "NEW YORK DAILY NEWS", "url": "http://www.nydailynews.com/entertainment/tv/lea-michele-suggests-hoping-glee-reboot-article-1.2394640", "ord_in_thread": 0, "title": "Lea Michele suggests she’s hoping for a ‘Glee’ reboot", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Eric Ray Davidson/Women's Health Lea Michele implied she would like it if “Glee” was picked up by Hulu or Netflix. \"Glee\" fans may soon have reason to sing with joy.\nFormer star Lea Michele told Women’s Health that she is hoping that the musical television series will one day be rebooted -- with a place kept for her.\n\"That last day (on the set) it's just kind of like 'oh my god, we are never gonna be here ever again,' unless we get picked up by Netflix at some point, or Hulu,\" she told the magazine in its November issue.\nThose streaming services have not publically shown interest in picking up the once- popular Fox series, but it’s always possible the Bronx native knows something the show's many fans do not.\nThe actress, though, hasn't been hurting for work since the show's finale aired in March after six seasons. She's currently starring on \"Glee\" creator Ryan Murphy's newest show, Fox's horror comedy \"Scream Queens.\"\nEric Ray Davidson/Women's Health The actress also opened up about her new role on “Scream Queens.”\nIn her new show, he 29-year-old Michele plays a sorority girl with scoliosis named Hester Ulrich on the show - a role that she is very thankful to have.\n\"Ryan Murphy is such an amazing person and an incredible boss to have,\" she said. \"To have the opportunity for him to write now a second character for me to play is such a great honor.\nEric Ray Davidson/Women's Health Lea Michele is on the cover of Women’s Health’s November issue. Eric Ray Davidson/Women's Health Michele said she doesn’t the set of scream on “Scream Queens,” although she does get scared in real life when she’s in a crowded car. Eric Ray Davidson/Women's Health She also said she loves working with “Glee” and “Scream Queens” creator Ryan Murphy. Previous Next Enlarge\n“The cast is incredible, the scripts are so funny, they're also really scary. I couldn't be happier right now. It's really such an amazing blessing. “\nThe actress revealed that she doesn't actually scream during filming for the show, because she doesn't want to strain her singing voice.\nInstead, the crew dubs a pair of screams she pre-recorded before the first episode.\n\"But they say I do a really good scream face without having to scream,\" she said.\nThe actress did admit, however, that she has a quirky fear in real life.\n\"I really don't like to be in a car with more than five people-that really freaks me out because I'm always afraid the tires are going to pop,\" she said. \"It's this super weird thing that I'm afraid of.\"\nRelated Stories Lea Michele opens up on finding love after Cory Monteith’s ‘Scream Queens’ trailer stars Lea Michele, Ariana Grande Lea Michele remembers Cory Monteith two years after death Tags: lea michele , interviews", "external_links": [], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-13T16:47:53.353+03:00", "highlightTitle": ""}