{"organizations": [], "uuid": "a91db769e595411db1a2c8e1c0fcb5f2e0cb22c8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.arcamax.com", "main_image": "http://www.arcamax.com/newspics/131/13163/1316311.jpg", "site_section": "http://www.arcamax.com/", "section_title": "News &amp; Entertainment by Email | ArcaMax Publishing", "url": "http://www.arcamax.com/politics/politicalnews/s-1735863?fs", "country": "US", "title": "House Republicans plead with Paul Ryan to run for speaker | Political", "performance_score": 0, "site": "arcamax.com", "participants_count": 1, "title_full": "House Republicans plead with Paul Ryan to run for speaker | Political News | ArcaMax Publishing", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T03:00:00.000+03:00", "replies_count": 0, "uuid": "a91db769e595411db1a2c8e1c0fcb5f2e0cb22c8"}, "author": "arcamax.com", "url": "http://www.arcamax.com/politics/politicalnews/s-1735863?fs", "ord_in_thread": 0, "title": "House Republicans plead with Paul Ryan to run for speaker | Political", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON -- With the zeal of a college football coach trying to woo a blue-chip recruit, House Republicans are aggressively trying to persuade Rep. Paul Ryan to run for House speaker after Majority Leader Kevin McCarthy's surprising withdrawal from consideration.\nMany House Republicans view Ryan, the 2012 GOP vice presidential candidate, as the salve that can heal and unify a divided conference and move it beyond the double shocker of House Speaker John Boehner's pending retirement and McCarthy's decision not to seek the speaker's gavel.\nBoehner, R-Ohio, has spoken with Ryan, R-Wis. So has McCarthy, R-Calif., and almost every rank-and-file House Republican Ryan's encountered since McCarthy's withdrawal Thursday.\nRyan, chairman of the House Ways and Means Committee, thus far has said thanks, but no thanks, to overtures.\n\"Chairman Ryan appreciates the support he's getting from his colleagues but is still not running for speaker,\" Ryan spokesman Brendan Buck said in a statement.\nBut that's not stopping colleagues from pleading.\n\"I picked up the phone and called and that's what a lot of people on their own are doing. This is not an orchestrated effort,\" said Michigan Rep. Fred Upton. \"I talked to him on the floor as well yesterday. I said, 'Paul you gotta run.' He said, 'I gotta go sit next to (Rep. James) Sensenbrenner.' He's known to be such a grouch that he figured if he sat next to him no one would.\"\nUpton's message to Ryan was simple: \"He needs to do this for the team. That's what we're all telling him.\"\nRep. Peter King of New York said, \"Paul is the only one right now who can unify the party.\"\nThe wooing of Ryan began Thursday almost immediately after McCarthy dropped out of a three-way race for the House GOP nomination for speaker. The Californian said he dropped out, in part, for the sake of party unity.\nOn the eve of Thursday's scheduled GOP conference vote for speaker, the conservative House Freedom Caucus announced that it was backing Rep. Daniel Webster of Florida, a long-shot candidate to succeed Boehner.\nThe caucus, which has about 40 members, said McCarthy was too closely aligned with Boehner. The group considers the outgoing speaker too accommodating to Democrats and too soft on President Barack Obama.\nEven before Thursday's drama, House Republicans were split between pragmatists, who view negotiating with Democrats and the White House as part of their legislative mission, and hard-core conservatives, who advocate aggressively going toe to toe with Obama, House Minority Leader Nancy Pelosi, D-Calif., and Senate Minority Leader Harry Reid, D-Nev.\nMany Republicans feel that Ryan, 45, can bridge that gap.\n\"He has a very good understanding of how this place works,\" Upton said. \"One of the good things about Paul is he's not a very good card player, which means he gives you straight answers. He doesn't have five aces in his hand and he's not gonna bluff you and that's what we need right now.\"\nBut not everyone on and off Capitol Hill was enamored. Several Freedom Caucus members interviewed said they're still backing Webster.\n\"Some of my conservative colleagues remember Paul Ryan's impassioned pleas for the TARP, the Wall Street bailout, he was asking for them to vote for it several years ago,\" Rep. Thomas Massie, R-Ky., a Freedom Caucus member, told CNN, referring to the federal programs that were the Bush administration's response to the financial crisis. \"I would want to talk to Paul Ryan about why he kicked conservatives off the Budget Committee when he was chairman of the Budget Committee. So, I'm still supporting Daniel Webster, because he has articulated for changing the process here in Washington, D.C., making it functional again.\"\nAnd some conservative talk radio hosts have begun taking shots at Ryan. Laura Ingraham dismissively tweeted Friday, \"Are they talking abt the same Paul Ryan who once lost a VP debate to JOE BIDEN?\"\nNone of this turmoil appears likely to disrupt delicate negotiations over a series of potentially contentious deadlines. Highway money runs out Oct. 29. The nation could reach its debt limit at the start of next month. And the government is funded only through Dec. 11.\nThe White House and congressional leaders have quietly been discussing compromises on the budget and the debt ceiling.\nThere was cautious optimism the deadlines would be met. At the White House, spokesman Josh Earnest said he was hopeful progress would continue.\nAt the Capitol, lawmakers seemed unworried for now. Such talks traditionally occur below the leadership level, and the key committees, notably appropriations, look to remain intact.\nShould a new speaker want to exercise more control, or have his own views -- which is considered highly unlikely -- some House members have suggested that Congress could pass more short-term debt ceiling and budget extensions.\nThe biggest budget dispute involves how to handle the sequester, or automatic spending cuts.\nObama had proposed a 7 percent spending increase, divided between defense and domestic programs. Republicans are eager to go above the sequester on defense but are reluctant to break the domestic limits.\n\"We still have a speaker, a majority leader, a conference chair,\" said Rep. Bill Flores of Texas. \"We can't let that cause any chaos. We've got to lead. There is nobody who wants to disturb the capital markets or the economy of this country.\"\n(c)2015 McClatchy Washington Bureau\nVisit the McClatchy Washington Bureau at www.mcclatchydc.com\nDistributed by Tribune Content Agency, LLC.\nGRAPHIC (for help with images, contact 312-222-4194): 20151009 Speaker vacancy\nVIDEO (for help with video, contact 312-222-4196): CONGRESS-GOP\nShare Comment", "external_links": ["http://twitter.com/share?url=http://www.arcamax.com/politics/politicalnews/s-1735863&hashtags=ArcaMax", "https://plus.google.com/share?url=http://www.arcamax.com/politics/politicalnews/s-1735863", "http://www.facebook.com/sharer.php?u=http://www.arcamax.com/politics/politicalnews/s-1735863&h=House+Republicans+plead+with+Paul+Ryan+to+run+for+speaker"], "published": "2015-10-11T03:00:00.000+03:00", "crawled": "2015-10-12T01:20:20.353+03:00", "highlightTitle": ""}