{"organizations": [], "uuid": "bb165b95e46be444f7090c8816e39131acd652be", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://images.canberratimes.com.au/2015/10/21/6946147/Thumbnail1001558832gkavnvimage.related.thumbnail.320x214.gkavqo.png1445383294539.jpg.jpg", "site_section": "http://feeds.canberratimes.com.au/rssheadlines/entertainment.xml#", "section_title": "Canberra Times Entertainment Headlines", "url": "http://www.canberratimes.com.au/entertainment/tv-and-radio/the-hard-yards-are-paying-off-for-sullivan-stapleton-20151017-gkavqo.html", "country": "AU", "title": "The hard yards are paying off for Sullivan Stapleton", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "The hard yards are paying off for Sullivan Stapleton", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T16:15:00.000+03:00", "replies_count": 0, "uuid": "bb165b95e46be444f7090c8816e39131acd652be"}, "author": "Michael Idato", "url": "http://www.canberratimes.com.au/entertainment/tv-and-radio/the-hard-yards-are-paying-off-for-sullivan-stapleton-20151017-gkavqo.html", "ord_in_thread": 0, "title": "The hard yards are paying off for Sullivan Stapleton", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sullivan Stapleton stars as Special Agent Kurt Weller, head of the FBI Critical Incident Response Group and Jaimie Alexander plays \"Jane Doe\" in Blindspot . \nSullivan Stapleton is nothing if not confident. And he has good reason to be.\nThe 38-year-old actor has a string of credits to his name: the HBO/Cinemax drama Strike Back , the critically acclaimed 2010 film Animal Kingdom and the 2014 blockbuster 300: Rise of an Empire .\nIn Hollywood he is talked about as a rising superstar. And this year the respected industry news website Deadline noted that he and his co-star in the new television drama Blindspot , Jaimie Alexander, were the two most requested actors for the 2015 television pilot season.\nLeading man: Sullivan Stapleton. Photo: supplied \nWhich begs the question, is flattery ever a risk for an actor?\nAdvertisement \"F-ck no,\" declares Stapleton, with characteristic directness. \"I think it's great.\" And with that he breaks into a broad grin. Stapleton is the real deal: very direct, wholly authentic. In that sense, you're almost more worried for Hollywood than for him. In any event, you hope they're ready for him.\n\"I guess that's where you know you're doing a good job,\" Stapleton continues, perhaps trying to temper his cockiness with some reasoned logic. \"I don't think I'm the prettiest guy or whatever; I'm trying my hardest so I know it's just not aesthetically based whether they like me or not.\"\nSullivan Stapleton and Pommie in Cut Snake . \nStapleton's aesthetic is complicated. He's right in the sense that he's not classically pretty, but he's unequivocally handsome, and from within the frame he dominates the screen with a rare natural presence of the sort not seen since, perhaps, Mel Gibson.\n\"Hopefully I bring some honesty, some strength to some of the performances I've done [and] I hope therein lies the flattery,\" he continues. \"[And] you at least know that you are affecting people in some way, whether it be good or bad. That's what we do; we're here to tell stories and if you're telling them right or if you're doing a good job then it affects people. I'm happy with that.\"\nIn Blindspot , Sullivan plays special agent Kurt Weller, who heads up the FBI's Critical Incident Response Group. In the pilot episode he is assigned to the case of a woman (played by Jaimie Alexander) whose body is covered with tattoos. Among them are clues to crimes which have not yet been committed and – significantly – his own name.\nBlindspot comes with a solid pedigree. Created by Martin Gero, it is produced by Greg Berlanti, television's current kingmaker, who produces a suite of shows for Blindspot 's parent studio, Warner Bros. Though production on the first season is well under way, and somewhat buoyed by the fact that it has been given a \"full season order\" (industry jargon which means its ratings are solid enough for the network to confirm its longevity in the schedule), Stapleton says they are still finding their way.\n\"We are trying to still flesh it out,\" Stapleton says. \"Kurt is very focused on his job and then throughout the discovery of this case of Jane Doe then he starts to explore his own past or what makes him tick, trying to help her find out who she is. The case hits close to him, [and] I guess it makes him look into himself.\"\nHe and co-star Alexander \"just play it\" and let the chemistry form in its own time, he says. \"I just use the words that I'm given and try to make them the most believable,\" he says. \"Throughout that you are working as a team and she's a great girl to work with. We're still exploring where those guys are going to go or what is going to happen.\"\nAs the series opens, Weller knows nothing except that his name is among the many tattoos on Jane Doe's back. In time, however, he discovers her identity and how that fits into a larger jigsaw, including a significant connection to his own past. Through it all there is a sense that the larger mosaic is slowly assembling, and the stakes are far higher than simply a missing persons case.\n\"That's sort of what drives him to his past, to something happened to him in his past, in trying to help her find out who she is and trying to solve some of these cases that are linked to all those tattoos,\" he says. \"Are they connected, or did someone put that on her back and sort of plant it within the FBI? We don't know. I guess that is the beauty of this series.\"\nThat uncertainty, he adds, is what fuels the actors. \"That was the other reason why it's such a joy to work on,\" he says. \"We don't know. It's not set out and it has the ability to go anywhere. It's kind of exciting.\"\nThe series is filmed in New York and while it is easy to frame the \"city\" as a character in the narrative – a notion that is common in television, with programs such as Sex and the City – this a very different kind of New York than audiences have seen before. In a tonal sense, it almost has more in common with Gotham than Sex and the City .\n\"It's pretty extraordinary to be in Times Square and all of a sudden you're filming and you're sort of watching how to part those crowds and how to disperse them so you can shoot that as being empty,\" Stapleton says. \"I don't think I'll ever see that again. That was full on.\" Then, he adds, \"to be on a boat going out to Liberty Island, just to do that for the day and to be that close to the Statue of Liberty and to then turn around and see that skyline of Manhattan, it's a great office to work in. It's a lot of fun. It's exciting. We can go into different areas and different boroughs and they're all very different. It's fun.\"\nThe series also powers along at a cracking pace. Stapleton is sprinting with ease, demonstrating the kind of physicality that pushed him through action-heavy material such as Strike Back and 300: Rise of an Empire . Indeed, the physical toll of Strike Back kept him out of action for the better part of a year.\nHis acting method, he says, plays better with instinct that analysis. And he prefers roles than require him to run rather than walk. \"I just think I'm a very instinctive actor so to get given such great scripts, I want the ability to play with it then and there. I just want to play with it. I don't want to sit and talk about it and discuss it and go on about it and intellectualise it. No. Just play with it and see what happens.\"\nThe beauty of that, he adds, is that you work it out. \"Sometimes it doesn't work, or sometimes if you're going to deliver lines that way to me then I have to change my reaction. That's the beauty. That's the fun part.\"\nWHAT \nBlindspot\n​WHEN \nSeven, Wednesday, 8.30pm", "external_links": [], "published": "2015-10-21T16:15:00.000+03:00", "crawled": "2015-10-21T17:27:49.892+03:00", "highlightTitle": ""}