{"organizations": [], "uuid": "212e057b315d0bd09876eb20cbd69a9341898f86", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.yahoo.com", "main_image": "http://l2.yimg.com/bt/api/res/1.2/oohxf8ngrk5BaZfQPWE19Q--/YXBwaWQ9eW5ld3NfbGVnbztpbD1wbGFuZTtxPTc1O3c9NjAw/http://media.zenfs.com/en_us/News/afp.com/b50daa059df1116dc7dffb5c9e70663c1422c164.jpg", "site_section": "http://news.yahoo.com/rss/entertainment/", "section_title": "Entertainment News Headlines — Yahoo! News", "url": "http://news.yahoo.com/meteoric-rise-halsey-headline-madison-square-garden-221403580.html", "country": "GB", "title": "In meteoric rise, Halsey to headline Madison Square Garden", "performance_score": 0, "site": "yahoo.com", "participants_count": 2, "title_full": "In meteoric rise, Halsey to headline Madison Square Garden - Yahoo News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T03:00:00.000+03:00", "replies_count": 1, "uuid": "212e057b315d0bd09876eb20cbd69a9341898f86"}, "author": "news.yahoo.com", "url": "http://news.yahoo.com/meteoric-rise-halsey-headline-madison-square-garden-221403580.html", "ord_in_thread": 0, "title": "In meteoric rise, Halsey to headline Madison Square Garden", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "New York (AFP) - Electropop star Halsey will close a global tour at New York's Madison Square Garden, marking a meteoric rise for the millennial-generation heroine who just months ago was playing small clubs.\nThe 21-year-old New Yorker announced the show at one of the world's most prestigious venues on social media Thursday, writing on Twitter simply: \"Madison Square Garden \"\nHalsey, whose real name is Ashley Frangipane, will play at the 20,000-seat Manhattan arena on August 13 next year after a tour that takes her across five continents.\nHalsey first enjoyed mainstream attention with a self-released song last year and even this summer was playing small festival stages.\nBut she has quickly drawn a fan base with her debut album \"Badlands,\" released in August, a concept album that uses a fictional dystopian land as a metaphor for her mental torment.\nThe album's track \"New Americana\" has become an anthem for some in the millennial generation, although the biracial singer has explained that the song is about society's embrace of diversity and not about wild partying, as some fans have interpreted it.\n\"We are the New Americana / High on legal marijuana / Raised on Biggie and Nirvana / We are the New Americana,\" she sings, referring both to the country's changing drug laws and to deceased 1990s music legends.\nAnother song off the album, \"Gasoline,\" revolves more explicitly around Halsey's emotional condition as she sings of the bipolar disorder that keeps her stuck in bed.\nHalsey's success has been credited in part to Apple's new Beats 1 online radio station, whose influential DJ Zane Lowe has chosen \"New Americana\" as one of his favorite tracks.\nArts & Entertainment Music Madison Square Garden millennial generation", "external_links": [], "published": "2015-10-23T03:00:00.000+03:00", "crawled": "2015-10-23T08:07:51.467+03:00", "highlightTitle": ""}