{"organizations": [], "uuid": "db653488ef33a64dd8b1a811d78f6fc0116b791b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-562541cb/turbine/ct-halloween-is-huge-at-this-costume-shop-ent-1020-20151019", "site_section": "http://www.chicagotribune.com/entertainment/rss2.0.xml", "section_title": "Arts &amp; Entertainment - Chicago Tribune", "url": "http://www.chicagotribune.com/entertainment/ct-halloween-is-huge-at-this-costume-shop-ent-1020-20151019-story.html", "country": "US", "title": "Halloween is huge, and this massive costume shop is proof", "performance_score": 0, "site": "chicagotribune.com", "participants_count": 1, "title_full": "Halloween is huge, and this massive costume shop is proof", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T22:37:00.000+03:00", "replies_count": 0, "uuid": "db653488ef33a64dd8b1a811d78f6fc0116b791b"}, "author": "Rick Kogan", "url": "http://www.chicagotribune.com/entertainment/ct-halloween-is-huge-at-this-costume-shop-ent-1020-20151019-story.html", "ord_in_thread": 0, "title": "Halloween is huge, and this massive costume shop is proof", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Halloween is huge, and this massive costume shop is proof Halloween Chris Sweda / Chicago Tribune You can't hide from Halloween these days. It's getting more popular all the time. You can't hide from Halloween these days. It's getting more popular all the time. (Chris Sweda / Chicago Tribune) Rick Kogan Contact Reporter With this costume shop's help, you can be Obama, Trump, Elvis or the Easter Bunny. \nIf it is not disturbing enough to many that Donald Trump has been parading across the nation's television screens seemingly nonstop, imagine what it would have been like to see him a couple of weeks ago, walking (or was that strutting?) one morning down the 4000 block of North Milwaukee Avenue? \nThis was not the real Donald Trump. Rather, it was a 27-year-old man named Al Rodriguez who was wearing Trump-like hair, a wig he had just purchased for $28.88 at Fantasy Costumes , the epicenter of all that is Halloween, a wonder to visit any time of year but at this time a place that should be an essential oasis. \nThe mask worn by Rodriguez —\"I'm just wearing it around to make sure it fits OK and looks good,\" he said — is not called the Donald Trump Wig, for we live in a very litigious society and Trump is an extremely litigious man. It is called the Mr. CEO Election Wig, and it is one of the thousands of wigs, masks, costumes, gizmos, decorative items and other objects available at this amazing store. \nAs Halloween has grown over the last decades from put-on-a-sheet-and-become-a-ghost simplicity into an all-ages bacchanal, Fantasy Costumes' owner, George Garcia, has watched his operation grow from one storefront into an entire block, 20,000 square feet filled with more than 1 million items. During this season the staff swells to three times its normal size, and the store will be open 24 hours a day from Thursday through the 31st. \nNo wonder. The National Retail Federation predicts that more than 157 million American citizens plan to celebrate Halloween this year, spending on average $74.34 (a figure that includes costumes, candy, decorations and all the other seasonal stuff). Many of these things can be purchased at those relatively new retail shops known as pop-up stores, those here-today-gone-tomorrow outlets. Fantasy Costumes is a permanent space, a landmark for many and, for me, the greatest costume store on the planet. It is in business year-round, in case you are interested in an Easter Bunny or Santa Claus costume or really want to enliven some other holiday or office party. The freakiest haunted houses you'll find in Chicago this year Open link \nGarcia says, \"I never want someone to walk in here and want something and (I) have to say, 'We don't have that.'\" \nOver the years, he and his staff have sold almost every conceivable costume, allowing normal people to transform themselves into dogs, aliens, political figures, monsters, bananas, packs of French fries, Fred Flintstone, Hulk Hogan, Betty Boop, Elvis, angels, devils … or any person or thing their imaginations and self-confidence will allow. \nGarcia has, in a very real sense, seen it all, and his Halloween philosophy can be boiled down to this: \"The name of my store sort of says it all: Fantasy. On this one day, you can get to live your fantasy, or at least dress like it.\" \nHis store is no neatly organized Walgreens, with goods arrayed according to scientifically studied patterns of customer flow. It is a jerry-built delight with a neighborhood feel, so jampacked that customers are provided with maps at the entrance. If a place can be massive and cozy at the same time, this is that place.", "external_links": [], "published": "2015-10-19T22:37:00.000+03:00", "crawled": "2015-10-20T00:38:01.762+03:00", "highlightTitle": ""}