{"organizations": [], "uuid": "54d0bb26282bf23bdf981d96227bd22e5894a90a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.examiner.com", "main_image": "http://cdn2-b.examiner.com/sites/default/files/styles/image_content_width/hash/7a/12/7a1253c6aac7545a6b1cc8312679a559.jpg?itok=ez6FBUsB", "site_section": "http://www.examiner.com/arts-and-entertainment", "section_title": "Arts &amp; Entertainment | Examiner.com", "url": "http://www.examiner.com/article/disney-world-releases-full-2015-candlelight-processional-celebrity-schedule", "country": "US", "title": "Disney World releases full 2015 Candlelight Processional celebrity schedule", "performance_score": 0, "site": "examiner.com", "participants_count": 1, "title_full": "Disney World releases full 2015 Candlelight Processional celebrity schedule | Examiner.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T00:55:00.000+03:00", "replies_count": 0, "uuid": "54d0bb26282bf23bdf981d96227bd22e5894a90a"}, "author": "Debra Peterson", "url": "http://www.examiner.com/article/disney-world-releases-full-2015-candlelight-processional-celebrity-schedule", "ord_in_thread": 0, "title": "Disney World releases full 2015 Candlelight Processional celebrity schedule", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Neil Patrick Harris is one of the celebrity narrators on the schedule for the 2015 Epcot Candlelight Processional, a retelling of the Christmas story with an orchestra and choir. Garth Vaughan. Photo courtesy of Walt Disney World, used with permission. The Candlelight Processional has emerged as a popular holiday tradition at Walt Disney World Resort. Each year, guests visit Epcot to experience this retelling of the Christmas story performed by different celebrity narrators and accompanied by a 50-piece orchestra and a mass choir.\nWalt Disney World released a tentative list of Candlelight Processional narrators back in July, when Candlelight Dining Packages first opened for booking. With the Christmas season set to begin, Disney has now provided the complete schedule for its 2015 Epcot Candlelight Processional schedule. Several familiar faces show up, celebrities who have performed at the processional as part of their own holiday tradition; they include Gary Sinise, Neil Patrick Harris, Whoopi Goldberg and Blair Underwood. A few new names also appear on this year’s schedule: Meredith Vieira, America Ferrera, Chandra Wilson and Dae Kim.\nThe Candlelight Processional is performed three times each evening at the America Gardens Theatre: 5:00, 6:45 and 8:15 p.m., also running from Nov. 27 through Dec. 30. For the 2015 season, the Candlelight Processional celebrity narrators slated to perform follows. (Note: The schedule is subject to change.)\nNov. 27 – 29: Gary Sinise Nov. 30 – Dec. 3: Neil Patrick Harris Dec. 4 – 5: Whoopi Goldberg Dec. 6 – 8: Joe Morton Dec. 9 – 11: Ana Gasteyer Dec. 12 – 14: Meredith Vieira (New) Dec. 15 – 17: America Ferrera (New) Dec. 18 – 20: Chandra Wilson (New) Dec. 21 – 23: Daniel Dae Kim (New) Dec. 24 – 26: Edward James Olmos Dec. 27 – 28: Blair Underwood Dec. 29 – 30: Amy Grant Epcot Candlelight performances are included with admission to Epcot, with limited seating available in two ways. The first is to stand in line on a first-come basis. The second involves purchasing one of the Candlelight Dining Packages . These packages, available on select nights and subject to availability, include a meal and guaranteed seat. Candlelight Processional Dining Packages do not include park admission. Guests may call 407-WDW-DINE or visit the Walt Disney World site for more information or to book.\nThe Candlelight Processional is but one of Epcot’s highlights of the holiday season, as the theme park highlights different traditions with its Holidays Around the World. During this seasonal celebration, the World Showcase pavilions celebrate the holidays by featuring some of the traditions, music and stories that inform the countries they represent. Holidays Around the World runs Nov. 27 through Dec. 30 .\nEpcot also offers special seasonal merchandise as part of Holidays Around the World. Disney guests may enjoy visiting Santa’s Village at the American Adventure pavilion, for example, and Christkindlmarkt at Germany will provide holiday shopping experiences with unique Christmas ornaments and other items.\nEpcot’s nighttime spectacular nods to the season with “IllumiNations: Reflections of Earth – Holiday Edition.” The laser, light, fireworks display capped adds a seasonal finale distinguished by a holiday symphony and some magical Orlando snow.\nWhile much of the holiday happenings at Epcot take place around World Showcase, the Future World Fountain Stage gets into the spirit of the season with joy-filled performance by “Joyful!” The ensemble combines gospel and inspirational music with the sounds of jazz, R&B and urban music.\nVisit the Walt Disney World Resort website for more information on Holidays Around the World and the Epcot Candlelight Processional.", "external_links": ["http://disneyparks.disney.go.com/blog/2015/10/chandra-wilson-daniel-dae-kim-america-ferrera-join-narrators-for-2015-candlelight-processional-at-epcot/", "https://disneyworld.disney.go.com/events-tours/epcot/holidays-around-the-world/", "https://disneyworld.disney.go.com/events-tours/epcot/candlelight-processional/", "https://disneyworld.disney.go.com/dining/epcot/candlelight-dinner-packages/"], "published": "2015-10-22T00:55:00.000+03:00", "crawled": "2015-10-22T02:53:07.918+03:00", "highlightTitle": ""}