{"organizations": [], "uuid": "7e49d7b7245ca6b0db47573f89a2e8acb81629c2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "entertainment.ie", "main_image": "http://images.entertainment.ie/images_content/rectangle/620x372/maxresdefault201510201115705.jpg", "site_section": "http://entertainment.ie/", "section_title": "entertainment.ie : Cinema, TV, Listings, Celebrity Gossip, Photos, Clubbing, Theatre, Reviews, Trailers, Lotto ", "url": "http://entertainment.ie/movie-review/The-Black-Panthers-Vanguard-of-the-Revolution/371804.htm", "country": "IE", "title": "The Black Panthers: Vanguard of the Revolution - Cinema, Movie, Film Review", "performance_score": 0, "site": "entertainment.ie", "participants_count": 1, "title_full": "The Black Panthers: Vanguard of the Revolution - Cinema, Movie, Film Review - entertainment.ie", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T19:21:00.000+03:00", "replies_count": 0, "uuid": "7e49d7b7245ca6b0db47573f89a2e8acb81629c2"}, "author": "Gavin Burke", "url": "http://entertainment.ie/movie-review/The-Black-Panthers-Vanguard-of-the-Revolution/371804.htm", "ord_in_thread": 0, "title": "The Black Panthers: Vanguard of the Revolution - Cinema, Movie, Film Review", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A documentary about a movement that took place fifty years ago, with Ferguson still very much in the news The Black Panthers: Vanguard of the Revolution is sadly just as relevant today as it was in 1967. Not only for those who only know the broad strokes of the Black Panther party, director Stanley Nelson unearths some startling footage to appease the well-versed.\nThe birth of the movement in the mid-sixties was nothing more than a neighbourhood security in Oakland, California. The measured Bobby Seale and the fiery Huey Newton and others, shotguns in hand, would observe police arrest black people, at a legal distance, ensuring there was no brutality. But it was their appearance – shades, leather jacket, beret - on the floor of the legislature in Sacramento to protest the change in gun laws, that the organisation gained prominence.\nChapters popped up all over the country and in Eldridge Cleaver, a best-selling novelist, they had an eloquent and ‘respectable’ speaker. Soon there was a political manifesto, the introduction of breakfast programs for hungry children, and the recruitment and training of members. Hoover took an interest with a program to discredit the Panthers not only in the eyes of the American people but also among themselves, encouraging his agents to ‘use their imagination’; some of the tactics included the placement of rumours of infidelity within the party.\nIt worked. With Newton behind bars (for the shooting of a police officer), Cleaver forced to flee to Algeria (where he further alienated the authorities for cosying up to North Korea and North Vietnam, etc), and Seale in and out of jail, the party disintegrated. In the emergence of the young and charismatic Fred Hampton there was hope but his murder at the hands of the police force (called “a political assassination” by “a death squad”) put paid to that.\nNelson’s approach isn’t as revolutionary as his subject, being a series of interviews (Bobby Seale, the last surviving former member refused to participate) that stitch together footage, but Nelson does find some gems in the archive. The recording of Seale’s incendiary protest at a hearing (the judge ordered him to be bound and gagged in the courtroom) is fascinating however difficult it might be to understand the garbled dialogue under tape hiss (for some sentences the subtitles just give up).\nIt can skim over some of the more nefarious elements of the party but Nelson does touch on the inherent chauvinism (one woman is laughed at for trying to join) and Newton’s unpredictable rages. A captivating watch.\nREAD: 3.5 Minutes, Ten Bullets - Movie Review\nREAD: By Our Selves - Movie Review\nREAD: Red Army - Movie Review", "external_links": [], "published": "2015-10-20T19:21:00.000+03:00", "crawled": "2015-10-21T12:06:36.861+03:00", "highlightTitle": ""}