{"organizations": [], "uuid": "5fe78ce48854b082ff1d9938409bde28b818d669", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "entertainment.ie", "main_image": "http://images.entertainment.ie/images_content/rectangle/620x372/RedArmy.jpg", "site_section": "http://entertainment.ie/", "section_title": "entertainment.ie : Cinema, TV, Listings, Celebrity Gossip, Photos, Clubbing, Theatre, Reviews, Trailers, Lotto ", "url": "http://entertainment.ie/movie-review/Red-Army/370987.htm", "country": "IE", "title": "Red Army - Cinema, Movie, Film Review", "performance_score": 0, "site": "entertainment.ie", "participants_count": 1, "title_full": "Red Army - Cinema, Movie, Film Review - entertainment.ie", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T21:35:00.000+03:00", "replies_count": 0, "uuid": "5fe78ce48854b082ff1d9938409bde28b818d669"}, "author": "Brian Lloyd", "url": "http://entertainment.ie/movie-review/Red-Army/370987.htm", "ord_in_thread": 0, "title": "Red Army - Cinema, Movie, Film Review", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "For people on this side of the Atlantic, most of our knowledge or experience with ice hockey comes from teenage sports drama The Mighty Ducks with Emilio Estevez and Joshua Jackson. Therefore, approaching Red Army with almost no knowledge of the game whatsoever, one would suspect you're going to be baffled by the technicalities of it all. Thankfully, the only thing you'll be baffled by is just how ruthless and violent the game is and how it was a microcosm of the Cold War.\nThe documentary begins with a dowdy-looking, middle-aged 'Slava' Fetisov trying to work his smartphone whilst an earnest interviewer, from behind the camera, begins to fire questions at him. The Russian, complete with round glasses and an ambivalent look on his face, calmly gives him the finger and continues messing with his phone. While he's doing this, his achievements are listed on a ticker that works its way down the screen. Simply put, the man's a legend in the ice hockey game. Born in the Soviet Union just a few short years after the end of World War II, Fetisov brings us into the harsh world of Russian ice-hockey and introduces us to both the Red Army Ice Hockey Team, Russia's premier team and one that was directly controlled by the Red Army itself.\nFrom there, we're introduced to Anatoli Tarasov, the Red Army's head coach and father of Russian ice hockey who introduces the idea of tactics, finesse and fluidity to the game that makes the team so devastating for their opponents. It's clear that Fetisov has a deep, abiding respect for him and it's touching to see the stone-faced Russian speak fondly of him - because it's truly rare for Fetisov to be anything close to emotional. The team politics play out and Tarasov's replaced with the villain of the film, Viktor Tikhonov.\nLike Tarasov, his training plans are ruthless and dogmatic, but not one single player on the team is willing to work with him and so begins the friction. We begin to see that the KGB, the Red Army and the Soviet establishment aren't so much the sponsors of the team so much as they're controlling each and every aspect of the team, confining Fetisov and the team to barracks and training schedules almost eleven months a year. As the documentary progresses through the years, so to we see glasnost and perestroika - the Russian policies of openness and restructuring - played out in the team itself, as the NHL begins to infiltrate and recruit players at an alarming rate. Fetisov, meanwhile, battles Soviet bureaucracy as he attempts to get a fair deal for himself, but winds up being a social pariah when he dares to challenge the dictator Tikhonov.\nDirector Gabe Polsky is smart enough to know that not everyone is familiar with ice hockey or, indeed, the finer points of Russian-American geopolitics, but keeps it relatively simple and allows the subjects to explain in their own way without the fuss of flowery language. Together with quick edits and a pulsing score by Christophe Beck, the documentary charges forward and captures the imagination and attention almost immediately. The sheer level of brutality and ruthlessness that forged the so-called Five Man Unit that formed the core of the team is astounding. However, it's the interview subjects really make the documentary; the bemused Fetisov, a retired KGB agent who brings his interrupting granddaughter with him to the interview, various US journalists who were familiar with the Red Army's exploits, teammates of Fetisov with their own stories and varying degrees of fortune in their retirement and Fetisov's wife, who explains how he was kidnapped by the KGB at one point and severely beaten for refusing to play.\nOverall, Red Army is an expertly-made sports documentary that ranks alongside When We Were Kings, Senna and The Class of '92.\nREAD: 3.5 Minutes, Ten Bullets - Movie Review\nREAD: By Our Selves - Movie Review\nREAD: Tana Bana - Movie Review", "external_links": ["http://adserver.adtech.de/?adrawdata/3.0/690.1/2913996/0/1725/noperf=1;cc=2;header=yes;alias=myalias;cookie=yes;adct=204;key=key1+key2;grp="], "published": "2015-10-02T21:35:00.000+03:00", "crawled": "2015-10-03T04:01:05.391+03:00", "highlightTitle": ""}