{"organizations": [], "uuid": "ed423ee4cc2cd8a917913bb757d3c0c30281933f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.northjersey.com", "main_image": "http://www.northjersey.com:80/polopoly_fs/1.1431302!/fileImage/httpImage/future-news.JPG", "site_section": "http://www.northjersey.com/cmlink/arts-and-entertainment-rss.rss#", "section_title": "Arts and Entertainment on NorthJersey.com", "url": "http://www.northjersey.com/arts-and-entertainment/movies/the-future-has-arrived-with-marty-mcfly-day-1.1431156", "country": "US", "title": "The future is here with Marty McFly Day, but where are the flying cars? - Movies", "performance_score": 0, "site": "northjersey.com", "participants_count": 1, "title_full": "The future is here with Marty McFly Day, but where are the flying cars? - Movies - NorthJersey.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T14:25:00.000+03:00", "replies_count": 0, "uuid": "ed423ee4cc2cd8a917913bb757d3c0c30281933f"}, "author": "KARA YORIO", "url": "http://www.northjersey.com/arts-and-entertainment/movies/the-future-has-arrived-with-marty-mcfly-day-1.1431156", "ord_in_thread": 0, "title": "The future is here with Marty McFly Day, but where are the flying cars? - Movies", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Buy this photo courtesy photo Michael J. Fox and Christopher Lloyd in Back to the Future Part II It seemed so far away, a date that would never come: Oct. 21, 2015. It is the day Marty McFly, his girlfriend Jennifer and Doc Brown jumped to in \"Back to the Future II,\" which showed the people of 1989 what the world would look like nearly 30 years in the future.\nSort of. \nBuy this photo Hover boards were supposed to be the rage in 2015. Sadly — unlike Christopher Lloyd's famous pronouncement at the end of the original film — in 2015, we still need roads.\nA little more than a week before Marty McFly Day, as fans have come to call next Wednesday, we look back to what screenwriters Robert Zemeckis and Bob Gale envisioned and, in some cases, we are still anxiously awaiting.\nBuy this photo Glasses as phones have not appeared yet either. * Flying cars: This was the big one, and we're still waiting. It seems like they would solve so many problems and be much more fun than the tires-on-road variety. At one point in the movie, though, Doc laments traffic in the sky, so maybe flying cars aren't the answer to all transportation issues.\n* Fashion: The clothes looked more like something Grace Jones wore in the '80s than anything people wear now. But they did have cool technology, including auto tightening sneaker laces and a button on a jacket that makes it fit.\n* Hoverboards: Sure there are things out there that call themselves hoverboards, but they never actually \"hover.\" Inventors young and old are working on it, though, so don't give up hope.\n* The justice system: Marty learns that his son was \"tried, convicted and sentenced\" within two hours, and Doc Brown notes that the justice system moves \"swiftly\" in the future thanks to the abolition of lawyers. Lawyers or no, not sure anyone could use the word \"swiftly\" to describe the current process.\n* \"Jaws 19\": The franchise mercifully stopped at four films, but thanks to the excitement surrounding the arrival of Marty McFly Day, a trailer for \"Jaws 19\" (made by Steven Spielberg's son) has actually been released.\n* Newspapers: Marty and Doc still go to the physical paper as their first and best source for news. If only.\nThe movie didn't get it all wrong, though. Marty Jr. operates a voice-activated TV. His sister uses glasses that double as a phone, and there are video phone capabilities through the TV. (We'll ignore the use of the fax as a follow-up to the phone conversation.)\nAs for the Cubs beating 100-to-1 odds and winning the 2015 World Series — the news that prompts Marty to buy the Sports Almanac that leads to all the trouble in \"Back to the Future II?\" It's still possible for Chicago to win its first title since 1908. \nBut they won't beat Miami as depicted in the movie. The Marlins are also in the National League, which makes a World Series meeting impossible. They didn't make the playoffs either. But give it to the writers, the Miami Marlins (who were first called the Florida Marlins) didn't have their inaugural season until 1993 — four years after the movie came out. \nFinally, Pepsi has made a prop a reality by creating a limited edition \"Pepsi Perfect\" just like the one Marty orders in the '80s nostalgia café. Limited quantities of the 6,500 16.9-ounce bottles being produced will be sold online for $20.15 each.\nEmail: yoriok@northjersey.com", "external_links": [], "published": "2015-10-13T14:25:00.000+03:00", "crawled": "2015-10-13T18:42:22.887+03:00", "highlightTitle": ""}