{"organizations": [], "uuid": "5058cd8490b941c81db315549d359142cfb02b3f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nj.com", "main_image": "http://www.nj.com/static/aff/static/img/logos/logo_fb.jpg", "site_section": "http://blog.nj.com/entertainment_impact/rss.xml", "section_title": "Entertainment", "url": "http://www.nj.com/inside-jersey/index.ssf/2015/10/monmouth_county_author_offers_more_southern_views_in_new_novel.html", "country": "IL", "title": "Monmouth County author offers more Southern views in new novel", "performance_score": 0, "site": "nj.com", "participants_count": 1, "title_full": "Monmouth County author offers more Southern views in new novel", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T19:33:00.000+03:00", "replies_count": 0, "uuid": "5058cd8490b941c81db315549d359142cfb02b3f"}, "author": "Teresa Politano | For Inside Jersey", "url": "http://www.nj.com/inside-jersey/index.ssf/2015/10/monmouth_county_author_offers_more_southern_views_in_new_novel.html", "ord_in_thread": 0, "title": "Monmouth County author offers more Southern views in new novel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Monmouth County author offers more Southern views in new novel missA.jpg Amy Hill Hearth, who lives in Monmouth County, continues her tales of Southern life in \"Miss Dreamsville and the Lost Heiress of Collier County.\" Comments \nPRESIDENT KENNEDY FAMOUSLY summarized our nation's differences: \"Washington is a city of Southern efficiency and Northern charm.\" \nAuthor Amy Hill Hearth would also like to remind you that when it comes to differences, the South is not as monolithic as the North believes. That progressive Southerners exist, even thrive. And that a Northerner's refusal to notice is condescending, provincial and snobbish. \nHearth is a best-selling author who writes from her Monmouth County home (accompanied by her 7-pound Boston terrier, a rescue). \nShe continues to illuminate the nuances of Southern life, some subtle, some not-so-much, in her second novel, \"Miss Dreamsville and the Lost Heiress of Collier County\" (Atria Books, 320 pp., $16 paperback). The work, published in September, is a sequel to her wildly successful and rollicking first novel, \"Miss Dreamsville and the Collier County Women's Literary Society.\" \nThe second novel, Hearth promises, is more confident and complex than the first, which rapidly became a national book club favorite (and a success internationally, with 50,000 copies published in Brazil alone). \nThe new novel's launch comes with an impressive book tour, including a star appearance at the all-important annual Pulpwood Queens Girlfriend Weekend in January, as well as talk of a potential movie. This despite the nervousness of the author, who was jittery about entering another genre. (You'll remember Hearth from her best-selling nonfiction work, particularly \"Having Our Say: The Delany Sisters' First 100 Years.\") \n\"I tried something new and landed on my feet,\" Hearth says, the awe still evident in her voice. Hearth is also clearly glad she didn't announce her intentions in advance. \"People are always telling you what not to do.\" \nThe novels center around Miss Dreamsville, an opinionated Northerner who moves to Naples, Fla., in the early 1960s — a tiny, rural town at the time. But don't assume a storyline, because Hearth's plots are far from predictable and her characters unexpected. \nWhich is not to say unrealistic.That stripper? Hearth, as a journalist in Daytona in the early '80s, met many women who stripped for cash. Florida then was being sold as a vacation and retiree dreamland, but the reality was far more harsh. Daytona had the country's highest murder rate, and Hearth also was appalled by the state's lack of social services — no safety net for runaways, the poor, the jobless. \nHearth was born in New England, but moved to South Carolina as a child, which forms her view of the North/South cultural divide. But it is also the experiences of her husband, who grew up in Naples, that inspire the Miss Dreamsville series. \nHearth met her husband in Daytona, while on a reporting assignment. He was director of Halifax Urban Ministries, which earned recognition from President Reagan for its work feeding the homeless and providing a place for unwed mothers to live. \nThe stories of Miss Dreamsville trade in serious and provocative issues, and the misfit characters within are authentic and true. \nBut also expect a vivid, vibrant plot, in a journalist's efficient prose. Abruptly real, but with the wisdom not to take itself too damn seriously. (Think \"To Wong Foo, Thanks for Everything! Julie Newmar.\") \nHearth has built a career of giving voice to those who have none, in her works of fiction and nonfiction. She has done so by earning the trust of the disenfranchised, and attributes that success to a singular characteristic: sincerity. \nAs a child of privilege — born in a stable home, with a good education and the opportunity to join the Girl Scouts — she's obligated to give something back. \"I have no excuse not to have done something in my life.\"", "external_links": [], "published": "2015-10-15T19:33:00.000+03:00", "crawled": "2015-10-15T19:42:29.540+03:00", "highlightTitle": ""}