{"organizations": [], "uuid": "d5f76cadc7f8d5d75155d6d351936487c4822587", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://www.canberratimes.com.au/content/dam/images/g/k/b/2/o/5/image.related.socialLead.620x349.gkb0w0.png/1445230840065.jpg", "site_section": "http://feeds.canberratimes.com.au/rssheadlines/entertainment.xml#", "section_title": "Canberra Times Entertainment Headlines", "url": "http://www.canberratimes.com.au/act-news/canberra-life/salut-baroque-canberra-concert-louis-legacy-at-albert-hall-20151016-gkb0w0", "country": "AU", "title": "Salut! Baroque Canberra concert: Louis' Legacy at Albert Hall", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "Salut! Baroque Canberra concert: Louis' Legacy at Albert Hall", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T08:00:00.000+03:00", "replies_count": 0, "uuid": "d5f76cadc7f8d5d75155d6d351936487c4822587"}, "author": "Janet Wilson", "url": "http://www.canberratimes.com.au/act-news/canberra-life/salut-baroque-canberra-concert-louis-legacy-at-albert-hall-20151016-gkb0w0", "ord_in_thread": 0, "title": "Salut! Baroque Canberra concert: Louis' Legacy at Albert Hall", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Salut! Baroque, from left, Sally Melhuish, Tim Blomfield, Alexander Knight, Matthew Greco, Julia Russoniello, Hans-Dieter Michatz, Valmai Coggins, Josie Ryan, Monika Kornel and Jane Downer. Photo: supplied \nLouis' Legacy . Salut! Baroque, Albert Hall, Canberra. Friday, October 23 at 7.30pm. Tickets: at the door, $40/$35. Enquiries: 6230 9262 or Salut@baroque.com.au .\nWhat a difference a king makes – in this case specifically the transition from the 72-year reign of Louis XIV, the Sun King, to that of his successor, Louis XV.\nCo-artistic director of Salut! , Sally Melhuish, says, \"What I wanted to show when I chose the music for this concert was the contrast between the two French kings.\n\"Everything changed after the death of Louis XIV. After that the Italian influence on French music became stronger and stronger.\"\nAdvertisement Louis XIV was an absolutist. \"Etat, c'est moi,\" (\"I am the state\") he famously remarked. His indulgent lifestyle of feasting, ballets de cour​, balls, concerts, fireworks and water displays required appropriate accompanying music and took place in the grand setting of chateaux at Fontainebleau, , Marly,  Saint-Germain, Chantilly and Versailles.\nHe indulged his love for all the arts, especially music and dance, and even contravened the restrictions of the Catholic church by having music played and sung at the daily celebration of Low Mass.\nBy 1682, Louis had converted the hunting lodge at Versailles into a gorgeously decorated and luxurious palace which included a charming theatre for all types of musical presentation. Seated in this theatre last year, I was able to imagine the concert performance of a Handel opera translated into the splendour of a fully staged production during the days of Louis XIV.\nJean-Baptiste Lully, whose influence spread far and wide through Western music, was given enormous financial and moral support by Louis and acted as his \"surintendant de la musique de la chamber du Roi\".\nLully was internationally regarded as an embodiment of French music and dance and it seems a cruel trick of fate that his death was the result of a musical accident: he stabbed himself in the foot with the rapier-like point of his conducting cane as he fervently beat time to the music and died in 1687 of gangrene – ironically also the cause of the demise of his patron, Louis XIV, in 1715.\nFittingly, a piece by Lully's second son, Jean-Baptiste fils, who became one of Louis' musiciens du chambre, will begin Salut's concert. It will be followed by works by Jean-Philippe Rameau, Michel Pignolet Montclair,  Jacques-Christophe Naudot and Marc-Antoine Charpentier, Lully's most eminent rival.\nCharpentier spent many years in Rome under the guidance of Giacomo Carissimi​ and it is suggested that Lully snubbed him on more than one occasion because of what he regarded as the Italian influence in Charpentier's music.\nAfter the death of Louis XIV the court was no longer the centre of French musical life. There had been strong pressure from both the king and Lully to eliminate Italian influence from all French music but now, gradually, its effects crept in, making French music more complex and learned.\nFollowing the interval at this concert, there will be another piece by Monteclair, his Air , and works by Michel Corrette​, Francois Couperin and Joseph Bodin de Boismortier,​ who was the first composer in France to appropriate the Italian term \"concerto\" for the title of a composition.\nCouperin, Corrette, Charpentier, Naudot and de Boismortier all became preoccupied with the blending of French and Italian styles and Couperin was even referred to as \"a passionate servant of Italy\". Joseph Royer's​ work, Le Vertigo , which will also be included in this second half, was said to have been inspired as he gazed down from the Jura Mountains on his journey from his native Turin to Paris.\nRoyer certainly embraced the Italian influence and he became the musician ultimately responsible for the education of the children of Louis XV.\nItalian taste was beginning its Rococo assault on the style of music so favoured by Louis XIV.", "external_links": [], "published": "2015-10-19T08:00:00.000+03:00", "crawled": "2015-10-19T13:58:16.159+03:00", "highlightTitle": ""}