{"organizations": [], "uuid": "059dfcceeb049c972a39cfd070214b6ba9125034", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pr.com", "main_image": "", "site_section": "http://www.pr.com/news-by-category/8", "section_title": "Arts &amp; Entertainment: Music Press Releases and News - PR.com", "url": "http://www.pr.com/press-release/638625", "country": "US", "title": "Dw. Dunphy's Album Test Test Test Breaks New Ground for Introverse Media", "performance_score": 0, "site": "pr.com", "participants_count": 1, "title_full": "Dw. Dunphy's Album Test Test Test Breaks New Ground for Introverse Media - PR.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-24T03:00:00.000+03:00", "replies_count": 0, "uuid": "059dfcceeb049c972a39cfd070214b6ba9125034"}, "author": "PR.com", "url": "http://www.pr.com/press-release/638625", "ord_in_thread": 0, "title": "Dw. Dunphy's Album Test Test Test Breaks New Ground for Introverse Media", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Dw. Dunphy's Album Test Test Test Breaks New Ground for Introverse Media\nNew Jersey musician receives unprecedented public affirmation for new music.\nRed Bank, NJ, September 24, 2015 --( PR.com )-- In the span of four months, Dw. Dunphy's instrumental album Test Test Test has become the most successful offering under the auspices of Introverse Media. Regularly accruing downloads on Bandcamp and Noisetrade (in a singles format), while generating some of the best reviews Dunphy has had in his music career, Test Test Test is making a forceful case for instrumental pop-rock.\n\"I'm surprised; delighted of course,\" Dunphy said, regarding the recent figures. \"The record has generated great buzz, which is always a nice position to be in. People want to talk about the album with me and I'm happy to oblige.\"\nThe album grew up out of a novel approach, whereby Dunphy added tracks as they were completed rather than waiting until everything was finalized, then released all at once. \"That's not how the world works anymore. People grab music like they check email. It is an instantaneous transaction. If you aren't prepared to adapt and to be there when the audience arrives, they could forget you.\"\nThe strategy, born of necessity, gave the overall story of Test Test Test a hook, but the songs are bringing people back, and are bringing reviewers with them. \"The record is proving to be my least polarizing,\" Dunphy said. \"It is such a luxury to have something out there that is confounding ambivalence. People are liking it, and they're liking it fast.\"\nWith reviews and interviews on many music blogs, as well as a thoughful article about Dunphy penned by Thomas Gerbasi for TheExaminer.com and tracks included on the Internet radio site BlowUpRadio.com, Dunphy is hopeful for next steps with the album. \"Getting it into peoples' hands and on their devices is the goal. That's why so many sites have it out there for free. I want people to enjoy and talk about it. That's what's really going to keep this enterprise going.\"\nAbout The Co-Op\nThe Co-Op is an artist-supported collective devoted to shifting the balance of opportunities toward independent musicians. Presented as a subsidiary of Introverse Media, Ltd., The Co-Op maintains that the \"underground\" is just as vital, interesting, and unique as it has ever been and needs a bullhorn to make that statement clear. For more information regarding The Co-Op, contact Dw Dunphy at dw.dunphy@gmail.com.", "external_links": [], "published": "2015-09-24T03:00:00.000+03:00", "crawled": "2015-10-01T07:59:54.287+03:00", "highlightTitle": ""}