{"organizations": [], "uuid": "b34778a00bbdac0897efa215ca958a5b554752dc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nydailynews.com", "main_image": "http://assets.nydailynews.com/polopoly_fs/1.2407389!/img/httpImage/image.jpg_gen/derivatives/landscape_1200/nick-jonas.jpg", "site_section": "http://www.nydailynews.com/entertainment/index.html", "section_title": "Entertainment News &amp; Reviews - NY Daily News", "url": "http://www.nydailynews.com/entertainment/nick-jonas-rumors-dating-kate-article-1.2407392", "country": "US", "title": "Nick Jonas says he’s ‘alone’ despite rumors he’s dating Kate", "performance_score": 0, "site": "nydailynews.com", "participants_count": 1, "title_full": "Nick Jonas says he’s ‘alone’ despite rumors he’s dating Kate - NY Daily News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "b34778a00bbdac0897efa215ca958a5b554752dc"}, "author": "NEW YORK DAILY NEWS", "url": "http://www.nydailynews.com/entertainment/nick-jonas-rumors-dating-kate-article-1.2407392", "ord_in_thread": 0, "title": "Nick Jonas says he’s ‘alone’ despite rumors he’s dating Kate", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Michael Rozman/Warner Bros Nick Jonas dances will Ellen on \"The Ellen DeGeneres Show.\" He also will peform his latest hit “Levels.\" When will Kate Hudson and Nick Jonas set the record straight?\nThe \"Jealous\" crooner told Ellen DeGeneres he's single and \"alone\" during Thursday's appearance on her show.\nWhen she hinted that Hudson seems to \"be in the same city as you all the time\" and that \"he's not alone\" he quickly fired back \"I'm never alone, I have you.\"\nHudson has been equally mum about their rumored fling.\nMichael Rozman/Warner Bros Pop star Nick Jonas on'The Ellen DeGeneres Show' where he performed his hit “Levels” on Thursday. When a fan asked the actress about the \"Scream Queens\" hunk on Tuesday's \"Watch What Happens Live\" she appeared to be embarrassed. \"I don't like addressing any kind of gossip,\" she quipped. \"Let's keep going.\"\nHudson, 36, and the 23-year-old singer set tongues wagging last month when they toured Disney World and brunched in Miami Beach the next day. The actress reportedly also attended the singer's concert in Miami Beach. Last week, they hooked up at UP & Down, a swanky hotspot in the Meatpacking District.\nJonas singer split with Olivia Culpo this summer after two years of dating, which he said has been \"an adjustment.\"\nCharles Sykes/Bravo/NBCU Photo Bank via Getty Images Kate Hudson on \"Watch What Happens Live.\" \"I was with my ex now for two years and then when my life dramatically changed and I started touring and doing all these projects.\"\nOne of those projects includes keeping DeGeneres home nice and tidy. The singer, who rents from the television host, admitted he's nervous about making a mess and that he forces visitors to use coasters \"so there's no rings on the tables.\"\nmhood@nydailynews.com\nRelated Stories The actress won't confirm if she's dating Nick Jonas Kate Hudson parties with Nick Jonas Kate Hudson hasn't introduced Nick Jonas to sons: report Tags: nick jonas , kate hudson , the ellen degeneres show", "external_links": [], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-22T23:06:30.568+03:00", "highlightTitle": ""}