{"organizations": ["Microsoft", "U.S. District Court"], "uuid": "1faba2ea0bc39c872f3a5734964fc5737f33ccaa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.fox30jax.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/09/29/40/9e/c7916a17580740d098b0fa286a256216-cb9f9726b918465a815f2dd1740a7ce0-0.jpg", "site_section": "http://www.fox30jax.com/list/rss/ap/entertainment/latest-entertainment-news/atk/", "section_title": "Latest in Entertainment", "url": "http://www.fox30jax.com/ap/ap/entertainment/73m-verdict-against-lady-gagas-former-boyfriend-to/nnsgy/", "country": "US", "title": "$7.3M verdict against Lady Gaga's former boyfriend tossed", "performance_score": 0, "site": "fox30jax.com", "participants_count": 0, "title_full": "$7.3M verdict against Lady Gaga's former boyfriend tossed", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T17:31:00.000+03:00", "replies_count": 0, "uuid": "1faba2ea0bc39c872f3a5734964fc5737f33ccaa"}, "author": "", "url": "http://www.fox30jax.com/ap/ap/entertainment/73m-verdict-against-lady-gagas-former-boyfriend-to/nnsgy/", "ord_in_thread": 0, "title": "$7.3M verdict against Lady Gaga's former boyfriend tossed", "locations": ["New York", "Jordan", "NEWARK", "N.J.", "Los Angeles"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Rob Fusari", "Jose Linares", "Lady Gaga"], "text": "Updated: 10:31 a.m. Friday, Oct. 2, 2015 | Posted: 10:31 a.m. Friday, Oct. 2, 2015 $7.3M verdict against Lady Gaga's former boyfriend tossed FILE - In this Sept. 20, 2015 file photo, Lady Gaga arrives at the 67th Primetime Emmy Awards in Los Angeles. Billboard announced Tuesday, Sept. 29, that the pop star will be honored at their annual Women in Music event on Dec. 11 in New York. The event, in its 10th year, will be televised on Lifetime. (Photo by Jordan Strauss/Invision/AP, File) Related View Larger FILE - In this Sept. 20, 2015 file photo, Lady Gaga arrives at the 67th Primetime Emmy Awards at the Microsoft Theater in Los Angeles. Lady Gaga’s first producer and former boyfriend has been given a new trial after a judge overturned an order that he pay $7.3 million to the Hollywood songwriter who discovered her. U.S. District Court Judge Jose Linares ordered the new trial for Rob Fusari on Sept. 3, but the ruling wasn’t unsealed until Wednesday, Sept. 30, 2015. (Photo by Jordan Strauss/Invision/AP) Sponsored Links The Associated Press NEWARK, N.J. — \nLady Gaga 's first producer and former boyfriend has been given a new trial after a judge overturned an order that he pay $7.3 million to the Hollywood songwriter who discovered the singer. \nU.S. District Court Judge Jose Linares ordered the new trial for Rob Fusari on Sept. 3, but the ruling wasn't unsealed until Wednesday. \nThe judge found that he mistakenly allowed the jury to hear details about an allegation connected to Lady Gaga and Fusari's personal relationship and his fiduciary duty to her. The exact details of that allegation were redacted from the order. \nFusari was ordered to pay Wendy Starland following a trial last year after a jury found that he agreed to split profits with her. Linares upheld that decision in February before Fusari appealed. \nStarland testified during the trial that Fusari, based in Parsippany, New Jersey, had asked her to find an \"edgy, bold, confident, charismatic\" performer and \"someone that you can't take your eyes off of\" to be a female version of the lead singer of \"The Strokes.\" \nShe brought back Lady Gaga after spotting her during a New York City performance in 2006, when she was simply Stefani Germanotta. \nLady Gaga said in a deposition in 2011 that she believed Fusari and Starland, a singer and songwriter who wrote songs with her, had a verbal agreement to split their share from her career. \n\"My understanding was that Wendy and him had initially agreed upon 50/50 perhaps before Wendy ever found me, and after I was signed to Rob and made music, Rob began to change his mind,\" said Lady Gaga , whose hits have included \"Poker Face\" and \"Bad Romance.\" \nLinares did not agree with Fusari that allowing that testimony was an issue. But he did agree that allowing testimony from Lady Gaga 's deposition about the allegation to be read in court was unfairly prejudicial. \nFusari, a Grammy Award-winning producer whose credits include work for Beyonce, Whitney Houston and Will Smith, previously sued Lady Gaga for $30 million in court in New York, but that lawsuit was dropped. Copyright The Associated Press", "external_links": [], "published": "2015-10-02T17:31:00.000+03:00", "crawled": "2015-10-02T23:17:54.273+03:00", "highlightTitle": ""}