{"organizations": [], "uuid": "5ec8810c8cf39297f906a15716966bad49e63286", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailyherald.com", "main_image": "http://www.dailyherald.com/storyimage/DA/20151003/entlife/151009708/AR/0/AR-151009708.jpg&amp;updated=201510021356&amp;imageversion=Facebook&amp;exactH=630&amp;exactW=1200&amp;exactfit=crop&amp;noborder", "site_section": "http://www.dailyherald.com/rss/feed/?feed=entlife", "section_title": "DailyHerald.com &gt; Life &amp; Entertainment", "url": "http://www.dailyherald.com/article/20151003/entlife/151009708/", "country": "US", "title": "Midwest travel: Carve out fun at Highwood's Great Pumpkin Fest", "performance_score": 0, "site": "dailyherald.com", "participants_count": 1, "title_full": "Midwest travel: Carve out fun at Highwood's Great Pumpkin Fest - DailyHerald.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T15:20:00.000+03:00", "replies_count": 0, "uuid": "5ec8810c8cf39297f906a15716966bad49e63286"}, "author": "Jacky Runice", "url": "http://www.dailyherald.com/article/20151003/entlife/151009708/", "ord_in_thread": 0, "title": "Midwest travel: Carve out fun at Highwood's Great Pumpkin Fest", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Top pick Carve out some family fun The city of Highwood hosts its now annual Great Pumpkin Fest, a three-day festival highlighted by pumpkin walls lit to music every night and an attempt to break the Guinness World Record of most pumpkins carved and lit at once (30,581 pumpkins). Nonstop family activities? You bet! All you can carve on-site pumpkins, the Great Pumpkin Maze sponsored by Home Depot, trick-or-treating, a pet costume contest, a kids costume contest, a Pumpkin Parade, pumpkin pie-eating contests, hay rides, pony rides, petting zoo, carnival rides, kids' crafts, two stages of live entertainment, and food and drink vendors. 4 to 10 p.m. Friday, Oct. 9; 11 a.m. to 10 p.m. Saturday, Oct. 10; and 11 a.m. to 9 p.m. Sunday, Oct. 11, at City Hall Park, 17 Highwood Ave., Highwood. highwoodpumpkinfest.com or (847) 432-1924.\nChicago Fantasy foodie fete Brats and beer are de rigueur for October, but when you live near a city like Chicago, you just may want to take advantage of OctoberFeast in River North. The neighborhood teeming with fabulous restaurants presents the seventh annual stroll and tasting tour: Choose a culinary route led by a tour guide, with each route offering a culinary tasting adventure to at least five restaurants for tasting portions and specialty drinks. Sample Japanese, Mediterranean, American, Italian and other cuisines from some the hottest eateries including Connie's Pizza, Del Frisco's Double Eagle Steak House, Dolce Italian, Eddie V's Prime Seafood and Steak, Farmhouse, Fleming's Prime Steakhouse & Wine Bar, Joe Fish, Kinmont, Kinzie Chophouse, River Roast, The Redhead Piano Bar, Reverie, Ruth's Chris Steak House, Seasons 52, STK, The Boarding House and Troquet River North, among others. 5 to 10 p.m. Tuesday, Oct. 6. Tickets are $75 each and available at octoberfeastchicago.com . (312) 645-1047.\nAutumnal antics The first Fall Fest at Lincoln Park Zoo features a variety of attractions across the main zoo grounds and at the Farm-in-the-Zoo. The list of lovely fun includes a corn maze and hay mountain, pumpkin carver, Ferris wheel, fun slide, pumpkin bounce house, strolling entertainers, singalongs for kids, animal chats and learning stations, wagon rides and an edible garden. 10 a.m. to 5 p.m. Friday through Sunday, Oct. 9-11 and 16-18, and Monday, Oct. 12, at Lincoln Park Zoo, 2001 N. Clark St., Chicago. Free admission, but activity tickets cost $3 for 1; $27 for 10; $51 for 20. lpzoo.org/events/calendar/fall-fest or (312) 742-2000.\nCheeky child theater If you think you can't handle another kids' play starring talking bunnies, consider an outing to Stage 773 for the launch of its cheeky, family-friendly weekend entertainment, \"THE INOFFENSIVE THEATRE SERIES.\" This unique series runs select Saturdays, featuring performance troupes such as the award-winning, all-silent and very funny BRI-KO; Barrel of Monkeys' hit show \"That's Weird, Grandma,\" an ever-changing showcase of sketches and songs adapted from stories written by children and performed by adults; and Theatre Unspeakable's SUPERMAN 2050, showcasing seven actors sharing a 3-by-7-foot space in a futuristic man-of-steel tale. Each show runs between 50 and 75 minutes. 2 p.m. various Saturdays through 2015 at Stage 773, 1225 W. Belmont Ave., Chicago. Purchase a $75 flex pass, which is valid for 10 tickets; regular tickets cost $12 for adults and $6 for kids 12 and younger. Stage773.com or (773) 327-5252.\nMidwest Free ride Is there a better time for a leisurely drive than autumn? Head out to the Scenic Drive Festival winding through rural Iowa towns like Birmingham, Bentonsport, Bonaparte, Cantril, Keosauqua, Lebanon and others. Stop at bake sales; trash and treasures sales; the open house at Millard's Turtle Farm; museums; antiques markets; a fine art festival; live music performances; pioneer games; an Amish dinner and buggy rides; quilt show; a Main St. autumn fest; Medicine Wagon Show; farm sales; and archaeological dig-site tours. There's also a chili cook-off and a black kettle ham, beans and cornbread lunch. Saturday and Sunday, Oct. 10-11, in the villages of Van Buren, Iowa. Get a map at villagesofvanburen.com/special-events/scenic-drive-festival.html or call (800) 868-7822.\nThat smell Smell that? There's something brewing in the crocks and jugs in Reedsburg, Wisconsin -- a festival celebrating everything cultured or fermented. The fifth annual \"Fermentation Fest -- A Live Culture Convergence\" is a multifaceted food and farming festival highlighting the beautiful Wisconsin countryside and live culture from dance to yogurt, poetry to sauerkraut. Get a map to follow the Farm/Art DTour through Sauk County's farm country, see temporary art installations and pasture performances, then meet chefs, scientists, brewers and cheesemakers who offer more than 30 classes and tastings about fermented foods, beneficial bacteria and the rural renaissance. Reedsburg is 55 miles northwest of the state's capital, Madison, in rural south-central Wisconsin. Now through Oct. 11 in Reedsburg, Wisconsin. fermentationfest.com . Life & Entertainment Festivals/Fairs Highwood Chicago Travel Runice, Jacky Wisconsin Entertainment", "external_links": ["http://www.http://villagesofvanburen.com/special-events/scenic-drive-festival.html", "https://twitter.com/share", "http://www.lpzoo.org/events/calendar/fall-fest"], "published": "2015-10-03T15:20:00.000+03:00", "crawled": "2015-10-03T19:46:49.593+03:00", "highlightTitle": ""}