{"organizations": [], "uuid": "7f59e270f2585d67185371a42fee337cb697a1d8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news.com.au", "main_image": "http://cdn.newsapi.com.au/image/v1/b306f1dc5d2f1f69593c111187c07ae3", "site_section": "http://feeds.news.com.au/public/rss/2.0/news_ent_3169.xml", "section_title": "NEWS.com.au | Entertainment", "url": "http://www.news.com.au/entertainment/tv/television-shows-that-were-plagued-by-behind-the-scenes-feuds/story-e6frfmyi-1227561859846?from=public_rss", "country": "IL", "title": "The feuds that plagued TV shows", "performance_score": 0, "site": "news.com.au", "participants_count": 0, "title_full": "The feuds that plagued TV shows", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T05:29:00.000+03:00", "replies_count": 0, "uuid": "7f59e270f2585d67185371a42fee337cb697a1d8"}, "author": "", "url": "http://www.news.com.au/entertainment/tv/television-shows-that-were-plagued-by-behind-the-scenes-feuds/story-e6frfmyi-1227561859846?from=public_rss", "ord_in_thread": 0, "title": "The feuds that plagued TV shows", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "What to see at the movies right now 13:02 PM Leigh Paatsch National movie reviewer HAS Johnny Depp redeemed his career with Black Mass? National film reviewer Leigh Paatsch reviews this and every current release here. The feuds that plagued TV shows 12:53 PM Corey Sinclair OFF-screen feuds and behind-the-scenes drama are nothing new in Hollywood. But some of the shows with clashing casts and crews will surprise you. Best new celebrity social snaps 12:53 PM Network Vision HEARTTHROB Orlando Bloom visits Jessica Alba, Lady Gaga gets raunchy and Justin Bieber poses poolside amidst his nude photo scandal. UFC’s ‘Netflix’ helping Aussie fighters gain exposure 12:23 PM MATTHEW DUNN THE UFC has brokered a content deal with Australia’s largest MMA company and young Aussie fighters are the big winners. Louise’s ridiculous lifestyle blog crashes 12:18 PM Charlotte Willis LOUISE Pillidge’s lifestyle blog has crashed less than 24 hours after the self-proclaimed “lifestyle guru” launched her latest project. Indie artists lead ARIA nominations 12:13 PM Kathy McCabe National Music Writer COURTNEY Barnett, Hermitude, Tame Impala and Vance Joy lead the roll call of the 2015 ARIA Awards as indie artists dominate nominations. Oktoberfest finds venue 12:07 PM JENNIFER CRAWLEY OKTOBERFEST has found a new venue after a row over Hobart City Council’s refusal to supply tables and chairs for the event at Princes Wharf 1. Television shows that were plagued by behind the scenes feuds October 8, 2015 11:54am Hurt feelings ... Sarah Jessica Parker has admitted the cast of Sex and the City didn’t always get along Corey Sinclair News Corp Australia Email a friend \nACTORS on successful television shows are trained to always give the right answers in interviews, and shift the focus away from any drama that might be going on behind the scenes. \nBut sometimes the friction between cast members, writers and production staff reachs such a point that rumours begin to leak and the shows become more infamous for backstage bickering than what’s happening on screen. \nFans of The Good Wife were shocked when it was revealed animosity between Julianna Margulies and the actor who played her bestfriend, Archie Panjabi, had become so bad that producers of the show were forced to use a split screen to film a scene. \nThe truth is off-screen feuds are nothing new in Hollywood — and sometimes even the most popular shows with the most cohesive casts have some skeletons in the closet. \nBUFFY THE VAMPIRE SLAYER \nKnown as ‘the little show that could’, Buffy went from a mid-season replacement on a fledgling network to a cult hit franchise with millions of fans across the globe. \nIt launched the careers of Sarah Michelle Gellar, who starred as the titular Buffy, and Alyson Hannigan who played her bestfriend Willow. Cracks ... the cast of Buffy the Vampire Slayer did not always see eye to eye Source: News Corp Australia \nThe pair seemed like good friends at first, giving shootouts to each other in interviews and attending functions together. When Gellar hosted Saturday Night Live, she held up a sign saying ‘I miss you Aly’ at the end of the show. \nBut things seemed to shift around season three as the actors and their film careers took off, with Gellar starring in a string of hits and Hannigan appearing in American Pie . \nTheir feud reached fever pitch when Gellar announced season seven of Buffy would be her last on the front cover of Entertainment Weekly. \nIn an interview, Hannigan slammed Gellar for making a public announcement before telling the cast and crew. But the show’s creator Joss Whedon quickly defended Gellar, saying it was his responsibility to notify the production team and that it was clear from the show’s storyline that it would end after this year. \n“There was a whole thing about it being in Entertainment Weekly and the crew wasn’t informed and everybody was unhappy, and I was just like, ‘There was somebody who didn’t know?’ Some of the actors were upset and I said, ‘You guys I’ve talked to specifically about this,’” Joss said in an interview with Chud.com. \nGellar’s husband Freddie Prinze Jr also weighed in, telling Zap2It that she was leaving the show because of the “nonsense” she has to deal with. \n“She’s a very strong woman, because she deals with a lot of nonsense, and instead of that nonsense, she should be thanked — and she’s not. That’s the reason she won’t be coming back,” he said. Happier times ... Sarah Michelle Gellar and Alyson Hannigan seemed to stop getting along around season three of Buffy the Vampire Slayer Source: News Limited \nMost thought the end of the show would have put a stake in the feud, but when Hannigan was asked in a 2013 interview which cast member had been the most annoyed about being on the show, she named Gellar. \n“She had a big career going, It was a lot of work,” Hannigan said. \nWhen asked which season of the show Gellar started hating doing Buffy , Hannigan quickly answered: “Three”. \nGellar surprisingly agreed with Hannigan, and explained that the show was a lot of hard work. \n“Vampires come out at night so you’re working these crazy hours when everyone else is sleeping … It’s physical, I was constantly getting injured … You hit this wall of ‘Oh my God’… They turned me into a rat [for an episode, just] so I could get a break …” \nIt seems as though the two have now buried the hatchet, with Gellar recently attending a birthday party for Hannigan’s daughter. \nBEVERLY HILLS, 90210 \nThe only thing that came close to matching the high octane drama featured in storylines of Beverly Hills, 90210 was the theatrics that erupted behind the scenes. \nMost of the drama revolved around the show’s two female leads, Shannen Doherty and Jennie Garth. \nWhen talking about the feud in an interview in 2014, Garth said it was expected considering they were locked in the sound stage for 14 to 16 hours every day. \n“There were times when we loved each other and there were times when we wanted to claw each other’s eyes out,” she said. \nBut Tori Spelling revealed this week that she was the one responsible for Doherty’s axing. All smiles ... the cast of Beverly Hills 90210 were not always a happy, united team Source: Supplied \nSpelling recalled a number of incidents that led to the decision, including one occasion when the male cast members were forced to break up a “fistfight” between Doherty and Garth. \nIt’s not clear what the final straw was, but Spelling admitted that she had asked her father Aaron Spelling — the producer of the show — to remove Doherty from the cast. \n“I felt like I was a part of something ... a movement ... that cost someone their livelihood,” Spelling said. \n“Was she a horrible person? No — she was one of the best friends I ever had.” \nGarth, who is now good friends with Doherty despite their infamously tempestuous relationship, described their personalities as being like “gasoline and a match” in her 2014 memoir Deep Thoughts From A Hollywood Blonde. \n“Without warning, she was gone. There was no goodbye, no nothing. One day she just wasn’t on the call sheet,” she wrote about Doherty’s departure. \nJason Priestley also wrote about the debacle in his memoir, saying Doherty “really and truly did not give a sh*t”. \nIn response, Doherty said Priestly ‘has brain damage’ after he died momentarily in a car accident. \nCHARMED \nNobody expected hot shot producer Aaron Spelling to ever work with Shannen Doherty again after he fired her from Beverly Hills, 90210 — so the announcement that she would lead his latest production took most by surprise. \nDoherty suggested her bestfriend Holly Marie Combs to play her sister Piper, but the part of the youngest sibling Phoebe was much harder to fill. Cast troubles ... Alyssa Milano would often fight with her Charmed co-stars Shannen Doherty and Holly Marie Combs Source: News Limited \nThe original actor left the series after shooting the pilot episode and was ultimately replaced by Who’s The Boss’s Alyssa Milano, who had previously worked with Spelling on Melrose Place. \nIt seemed like smooth sailing at first with Doherty and Combs even serving as bridesmaids in Milano’s 1999 wedding \nCombs told TV Guide that the trio were “very close for the first couple of years”. \nBut tensions had become noticeably tense by the time the series entered its third season. \nCombs explained that they were becoming frustrated with feeling like they were doing the same episode over and over, and Doherty “wanted to make the show bigger and better and stretch her boundaries”. \nParamount, the studio that produced the series, sent a mediator to the set but it only made things worse. \n“The problems we had weren’t things some big company mediator could fix,” Combs told TV Guide. \nDoherty was eventually fired, which she believes happened after Milano gave the producers an ultimatum. But Milano denies the accusation. \nCombs said Doherty had actually asked to be let go from her contract originally but the studio refused. \n“[She] was like, ‘This is getting too problematic. Just let me go,’” Combs said. \n“She didn’t want the bad press again. She wanted to exit gracefully.” \nShe hit out at the producers for firing Doherty —“a person who has basically created two hit shows for you”. \nAfter her departure, Doherty told Entertainment Tonight that there was “too much drama on the set and not enough passion for the work”. \n“I’m 30 years old and I don’t have time for drama in my life anymore,” Doherty said. \n“I’ll miss Holly a lot … she’s one of my best friends and I love her dearly, and there were never, ever, ever any problems between the two of us.” \nWhen talking about the feud on Watch What Happens Live in 2013, Milano compared the experience of working on Charmed to high school. \n“Holly and Shannen were best friends for like 10 years before the show started, so it was very much sort of like high school,” she said. \n“I would hope that in our thirties it wouldn’t be like that anymore.” \nBoth Doherty and Combs dismissed Milano’s claims in a radio interview. \n“We were all friends and at times we weren’t,” Combs said. \nCOMMUNITY \nUnlike a lot of television shows, the drama behind the scenes of Community was not covered up with its stars and creator speaking to the media on a semi-regular basis. \nComedy legend Chevy Chase seemed to be at the centre of most of the drama, with the show’s creator Dan Harmon often clashing heads with the star. Clashing heads ... comedy legend Chevy Chase often argued with his co-stars and his boss Source: Supplied \nIt all turned nuclear when Harmon played one of Chase’s expletive-filled voicemail messages, which included the actor calling the show a “f*cking mediocre sitcom”. \n“I want people to laugh and this isn’t funny,” Chase said. \n“It ain’t funny to me because I’m 67-years-old and I’ve been doing this a long time. I’ve been making a lot of people laugh — a lot better than this.” \nThen at a wrap party for the show, Harmon allegedly ripped into Chase in a speech and even attempted to lead the crowd to chant “f*ck you Chevy”. \nHarmon was eventually fired, but Chase continued his rampage. While protesting his character’s developing racist streak, Chase dropped the N-word. It was then announced he would leave the show for good. \nHarmon eventually returned to the series for its fifth season. \nAlison Brie, who stars on the show, said she thought the whole situation got blown out of proportion in the media but admitted that she was not at the infamous wrap party. \nSeries star Joel McHale also weighed in on Chase not wanting to be on the show. \n“He just didn’t want to be there,” McHale said. \n“When I would try [to talk to him about his attitude], he would just try to fight me ... He physically wanted to fight me.” \nGOLDEN GIRLS \nEverybody remembers the iconic opening lines of the Golden Girls theme song: “Thank you for being a friend ...” \nBut the truth is, the cast of the hit television show were not always friends. In fact, as Betty White revealed while promoting her memoirs, Bea Arthur was not her biggest fan. \n“She was not that fond of me. She found me a pain in the neck sometimes,” White said. \n“It was my positive attitude — and that made Bea mad sometimes. Sometimes if I was happy, she’d be furious!” Not so golden ... the cast of The Golden Girls weren’t as close as it seemed on screen Source: Getty Images \nRue McClanahan, who played the flirty southern belle Blanche, said a drunk Arthur once called White a “c*nt” at a lifetime achievement award ceremony. \nShe also admitted to a rocky relationship with Arthur. \n“Bea and I didn’t have a lot of relationship going on,” McClanahan said. \n“Bea is a very, very eccentric woman.” \nGREYS ANATOMY \nIn the decade since it first started, the hospital drama has been a breeding ground for drama with a number of its main cast departing under questionable circumstances. \nThe first high profile feud was sparked after Isaiah Washington called T.R Knight a “f*ggot”, which forced to actor to come out. \nWashington took the opportunity in the Golden Globe press room to clear the air, stating he never called Knight the homophobic slur. \n“Never happened,” he claimed. Oh no ... the set of Grey’s Anatomy has been filled with drama over the years Source: News Limited \nWashington’s outburst angered the cast and production staff. In response, Knight’s good friend and Grey’s co-star Katherine Heigl said Washington should not speak in public. \nWashington agreed to undergo counselling but was eventually let go from the show. \nIt didn’t stop Knight from leaving as well a few years later, citing the character had run its course. \nThe next big drama erupted after Heigl suspended contract talks with the show until she was offered a raise, but the show’s network, ABC, hit back and issued a statement that said they had already offered “to raise her compensation significantly above the terms of her contract”. \nHeigl said she felt disrespected by the statement. \nThen a few months later, when Heigl was asked why she did not submit a nomination for the Golden Globes, she said she was not “given the material this season to warrant an Emmy nomination”. \nThe show’s creator Shonda Rhimes told Oprah Winfrey that Heigl’s comments stung. \n“On some level, I was not surprised. When people show you who they are, believe them,” she said. \nWhen Heigl gave an interview saying she was open to returning to the show to wrap up her character’s story, Rhimes hit back with: “I don’t put up with bulls*** or nasty people. I don’t have time for it.” \nThe show’s main star Ellen Pompeo, who plays Meredith Grey, recently opened up about the Heigl situation. \n“You could understand why she wanted to go — when you’re offered $12 million a movie and you’re only 26,” Pompeo told the New York Post. \n“But Katie’s problem is that she should not have renewed her contract. She re-upped, took a big raise and then tried to get off the show. And then her movie career did not take off.” Ouch. \nThe next casualty in the Greys Anatomy wars was Grey’s love interest, played by Patrick Dempsey. \nHis character, best known as McDreamy, was killed off after multiple run ins with Rhimes. \nTWO AND A HALF MEN \nIt was well known that Charlie Sheen was a troublemaker, entering rehabilitation three times in 2010 alone. \nBut the turmoil behind the scenes of the popular sitcom was kept relatively well guarded until Sheen challenged the show’s creator Chuck Lorre to a fight, which forced the series into an early hiatus. \n“I violently hate Chaim Levine (Chuck Lorre). He’s a stupid, stupid little man and a p**sy punk that I’d never want to be like. And that’s me being polite,” Sheen said. \n“That piece of s**t [Lorre] took money out of my pocket, my family’s pocket, and, most importantly, my second family — my crew’s pocket. You can tell him [Lorre] one thing. I own him.” Attack ... Charlie Sheen lost his job after threatening the show’s creator in the press Source: Supplied \nSheen continued to attack Lorre in the media, which forced the writer to create a new start for the show without Sheen’s character. Ashton Kutcher was eventually cast as his replacement. \nBefore the show finished its final season, Lorre extended an olive branch and offered Sheen a chance to appear in the finale. His character would have been squashed by a falling piano. \nWhen asked why Sheen refused to return, Lorre said: “I just have to assume that he didn’t see the humour in it, which is all right.” \nThe show’s other lead, Jon Cryer said the situation with Sheen had erupted out of nowhere when Lorre tried to help Sheen with his battle with addiction. \n“It wasn’t a case of him just rampaging around the set and breaking stuff and knocking stuff over,” he said. \n30 ROCK \nAlec Baldwin has a reputation for making outlandish statements and attacking people in the press, yet people were surprised when rumours surfaced of a tempestuous working relationship with the show’s creator and star Tina Fey. \nAlthough the stars never openly spoke about the feud, Baldwin did admit that he was ready to leave the show after its fifth show because he felt it was at its low point. United front ... Alec Baldwin and Tina Fey often clashed on the set of 30 Rock Source: News Limited \n“Though even anaemic 30 Rock writing is still better than everybody else’s writing, I go, ‘I’m going to get the f*ck out of here, I’m done,’ because I’m an employee, I don’t have any say.” \nIt seems Baldwin’s lack of power was the main problem \nBaldwin told the Guardian that it was a struggle working on a show that he had no say in as creator or producer. \n“They never came to me and said, what storyline do you want? There was a period when I said to myself, what else could I be doing? It’s Tina’s show. I want to do my own show, which says what I want to say and about things I believe in,” he said. \nIt was also rumoured that during a photoshoot with Fey, Baldwin told the photographer to “get ready to do a lot of airbrushing”. \nAs the story goes, Fey asked “something wrong with my face?” which Baldwin replied that it was her entire body that was the problem. \nBut representatives for the actors and the show denied the interaction. \nFey has kept relatively quiet about the feud but did once say that she uses techniques she learned working with Baldwin to control her child. \n“It’s like, I’m gonna present the idea that we might leave now, but make [her] think it’s her idea. It would work better with Alec than with the baby,” Fey said. \nThe working relationship between Fey and Tracey Morgan also reportedly became strained after he went on a homophobic rant during a stand up appearance, and Fey was forced to apologise. \nCircumstances surrounding the incident were eventually adapted into an episode of the series. \nSTAR TREK \nEverybody hated William Shatner. At least, that’s what stories from behind the scenes of Star Trek would have you believe. \nMost surprisingly was the ongoing feud between Shatner and the actor who portrayed his on-screen bestfriend, Leonard Nimoy. \nThe feud reportedly started when Shatner became jealous of Nimoy’s burgeoning popularity with fans, and Nimoy’s character Spock solving the problems in every episode. Stars wrecked ... William Shatner and Leonard Nimoy played bestfriends but weren’t as close off screen Source: Supplied \n“Bill was worried that Kirk would seem unintelligent by contrast. And so lines of dialogue that had logically been Spock’s soon became Kirk’s,” Nimoy said. \nThe bad blood between the pair became even worse after Nimoy demanded equal pay with Shatner, which the producers refused. \nMany of the cast members reported Shatner blatantly stealing their dialogue. \nGeorge Takei once said that Shatner would not be satisfied “until we’re all gone and he gets to do our parts.” \nCast member James Doohan admitted that he had “wanted to thump him on more than one occasion”. \nHe also revealed that Shatner and Nimoy became embroiled in a fight after a photographer from Life magazine was sent to the Star Trek set to photograph Nimoy having his Vulcan ears attached. \nNichelle Nichols, who played communications officer Uhura, almost quit the series because she was sick of Shatner “bossing around and intimidating the directors and guest stars, cutting other actors’ lines and scenes and generally taking enough control to disrupt the sense of family we had shared”. \nDESPERATE HOUSEWIVES \nThe drama between the lead actors on Desperate Housewives was well-publicised during its tenure, with many media outlets casting Teri Hatcher as the antagonist. \nPossibly the most infamous incident was on the set of a Vanity Fair photoshoot, when several members of the cast became furious after Hatcher was placed in the centre of the photo despite requests that the cast members be treated as equals. Cat fights ... the lead actors of Desperate Housewives were tabloid fodder during the show’s tenure Source: Supplied \nMarcia Cross, who previously played fiery redhead Dr Kimberley in Melrose Place , reportedly “lost it” and screamed at the publicist to “do your bleeping job”. \nEva Longoria dismissed the claims as being the result of having just finished a 16-hour day. \n“When someone’s tweaking every little hair, it’s like, ‘Stop touching us, just shoot the picture’,” she said. \nHatcher has refused to comment on the drama, and said she will never “disclose the true and complicated journey of us all, but I wish everyone on the show well”. \nWhen the show finally wrapped up, the main cast bought the crew a parting gift — but left Hatcher off the gift tag. \nHatcher said the crew knows she’d jump “in front of a bus for them at any moment” and that she was “beyond generous throughout those eight years and any crew members will tell you that”. \nCherry claimed it was just a light tap on the head. \nThe case was eventually dismissed, but Sheridan is still attempting to bring it back to trial. \nA number of snippets about the feud did come out in the original trial — Sheridan had once told Cherry that Hatcher was the “meanest women in the world”, the writers had considered writing Hatcher out of the show in season five, and both Cross and Longoria had threatened to walk off the Vanity Fair cover shoot. \nMIGHTY MORPHIN POWER RANGERS \nThe show was an overnight sensation, but things behind the scenes were not as simple for the cast. \nThey were famously underpaid, and worked long hours. But it was the treatment of David Yost, who played Billy the blue ranger that shocked many fans. Left out ... The blue power ranger was the focus of homophobic attacks Source: News Corp Australia \nYost told a Power Rangers fansite that he walked off the set one day during lunch and never returned. But why? Because he was the target of homophobic workplace bullying. \n“The reason I walked off was because I was called f*ggot one too many times,” he said. \n“From creators, producers, writers, directors ... I know that my co-stars were called in a couple times to different producers’ offices and questioned about my sexuality, which is kind of a humiliating experience to hear that.” \nYost started to fear for his own stability and decided to quit when he started to contemplate suicide. \nWhen producers started planning a Power Rangers reunion, Yost refused as he was “done with abusive relationships”. \nA Power Rangers producer anonymously told TMZ that Yost was a “pain in the ass”. \nSEX AND THE CITY \nRumours of a rift between the show’s star Sarah Jessica Parker, and arguably the show’s most popular actor Kim Cattrall, have been rife since the earlier seasons. \nAlthough the cast rarely comment on the rumours, Parker once admitted that there had been clashes. \n“When you’re on set, you’re working 90-hour weeks, you’re never home, you’re exhausted. There are times when all of us have been sensitive and sometimes feelings get hurt,” Parker said. \nCynthia Nixon, who played the straightforward Miranda, agreed and said that the show’s production was not always smooth sailing. Sex and the catty ... the cast of the beloved HBO series have fought over money in the past Source: Supplied \n“But the idea that we’re somehow adversarial is ludicrous,” Nixon said. \nCattrall has always denied that there was a feud, but did admit that nineteen-hour workdays are stressful. \n“But there’s a camaraderie that happened through all of that,” she said. \nCattrall also admitted to holding out on signing on to the first Sex and the City film because she thought she, as well as Nixon and Kristin Davis, deserved to make the same amount of money as Parker. \n“But it became just my fight. And that’s [Davis and Nixon’s] choice, I don’t have a problem with people deciding what’s right for them but it wasn’t right for me and I don’t think that’s a crime,” Cattrall said. \n“To me it was about standing up for something I really believe in and saying, ‘I would like to be part of this in a way you have all been part of it on this hierarchy. You took from my life storylines and inspiration, you think that I’m brilliant, so please, allow me to have security for the rest of my life.” \nMOONLIGHTING \nIt launched its stars’ careers to new heights, yet the behaviour of Bruce Willis and Cybill Shepherd behind the scenes was anything but glimmering. \nProducer Jay Daniel was the one who would be sent into “the lion’s den” when the pair would be having a disagreement, forced to act as a referee. Darkest before the dawn ... Moonlighting stars Bruce Willis and Cybill Sheperd argued like cats and dogs Source: News Corp Australia \n“Everybody knows there was friction between the two of them on the stage,” Daniel said. \nWhile Willis started out as a ‘guy’s guy’, Daniel said he quickly evolved when he realised he was going to be a big movie star. \n“That sometimes made the set a very unpleasant place to be. Cybill — I got along with her very well at times, other times I’d have to be the one who said you have to come out of the trailer and go to work,” Daniel said. \nHowever the show’s creator, Glenn Gordon Caron, targeted Shepherd for playing a part in the production problems. \n“I don’t mean to paint her as the sole bearer of responsibility for the discord,” he said. \n“It [the hours] can be very difficult, it requires an amazing amount of stamina. It’s easier to do if you’re still reaching for the stars, it’s a lot tougher if you’re already a star, if you’ve already reached the top of the mountain.” \nThe feud seemed to explode when Shepherd gave birth to twins and Willis found success with Die Hard, but neither of the two have opened up about what really happened behind the scenes. \nBut Shepherd did recently admit that the pair almost slept together after a night drinking whiskey. \nTHE X-FILES \nThe truth is out there ... and the truth is Mulder and Scully didn’t always see eye to eye. \nYou could be forgiven for thinking the two were best of friends after their much-loved run in the series and two subsequent films, but David Duchovny revealed the pair were sick of the sight of each other. \n“Familiarity breeds contempt. It’s nothing to do with the other person. All that fades away and you’re just left with the appreciation and love for the people you’ve worked with for so long,” he said. Bad blood ... David Duchovny and Gillian Anderson didn’t always get along on the set of The X-Files Source: Supplied \n“We used to argue about nothing.” \nGillian Anderson agreed that there was “definitely periods when we hated each other”. \n“We didn’t talk for long periods of time. It was intense, and we were both pains in the arse for the other at various times,” she said. \nBut X-Files fans can breathe a sigh of relief — Anderson said the pair are now closer than ever. \nNews that the infamous duo were once at eachother’s throats might come as a surprise considering there had been rumours for years of an off-screen romance. \nAnderson said they know each other too well to ever be romantic, but did admit that there is a spark. \n“There is an attraction,” she said. \n“There might even be more than an attraction, but it’s not going to happen. And it’s that frisson that has made it interesting in the series and continues to make it interesting.”", "external_links": [], "published": "2015-10-08T05:29:00.000+03:00", "crawled": "2015-10-08T05:46:48.339+03:00", "highlightTitle": ""}