{"organizations": [], "uuid": "007e311e232944b6b6858b97074b735c4052b0c4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nj.com", "main_image": "http://imgick.nj.com/home/njo-media/width620/img/njcom_photos/photo/2015/10/09/18933779-large.jpeg", "site_section": "http://blog.nj.com/entertainment_impact/rss.xml", "section_title": "Entertainment", "url": "http://www.nj.com/entertainment/tv/index.ssf/2015/10/melissa_gorga_rhonj_teresa_checks_in_bravo_special.html", "country": "US", "title": "Melissa Gorga on 'very emotional' 'Real Housewives' special, future of franchise", "performance_score": 0, "site": "nj.com", "participants_count": 4, "title_full": "Melissa Gorga on 'very emotional' 'Real Housewives' special, future of franchise | NJ.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T00:45:00.000+03:00", "replies_count": 3, "uuid": "a682371f2edbeef62272e27950c318d2cd47e040"}, "author": "Vicki Hyman | NJ Advance Media for NJ.com", "url": "http://www.nj.com/entertainment/tv/index.ssf/2015/10/melissa_gorga_rhonj_teresa_checks_in_bravo_special.html#post-0", "ord_in_thread": 0, "title": "Melissa Gorga on 'very emotional' 'Real Housewives' special, future of franchise", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bravo is characteristically tight-lipped about the future of the \"Real Housewives of New Jersey\" franchise, but star Melissa Gorga shares this with NJ Advance Media: \"You'll never not see us again.\"\nIs that a promise or a threat?\nGorga revealed what she could during an appearance at the opening of the Bowlmor in Green Brook, the former AMF Strike N Spare Lanes and now glitzy offshoot of the original New York City hipster hangout. The opening of Bowlmor, the first of its kind in New Jersey, with glowing lanes, an arcade, mini-laser tag and an extensive bar, attracted hundreds with the promise of booze, lane-side snacks, a deejay and rubber-soled footwear.\nGorga said she's definitely up to return, should a seventh season be in the offing, and that she and co-star and sister-in-law Teresa Giudice, currently in federal prison for her role in a long-running financial fraud , are now a united front.\n\"A lot of what we've seen, it's a bunch of nonsense,\" Gorga says of previous seasons of the show, several of which have revolved around rumors, abetted by Teresa, of infidelity and a secret stripper past. \"When there's a crisis, a family comes together.\"\nA three-part special called \"Real Housewives of New Jersey: Teresa Checks In,\" begins airing Sunday at 8 p.m., and Gorga calls it \"very emotional.\"\nThe show focuses on Joe Giudice, who will report to prison next year for his 41-month prison sentence, as he wrangles his four young daughters in Teresa's absence. The special will also air Teresa's calls home to her family from the Federal Correctional Institute in Danbury, Conn. Gorga and her husband Joe will appear in the special, along with Teresa's parents and Teresa's cousins Kathy Wakile and Rosie Pierri.\nMORE: Your questions answered about Teresa Giudice's prison sentence\nThe Giudices pleaded guilty last year to bankruptcy fraud and conspiracy to commit wire and mail fraud in a scheme that dated back to 2001. Teresa was sentenced to 15 months in prison but will be released to home confinement in late December.\nGorga's future plans include a boutique in Montclair, and while Entertainment Tonight has reported that Bravo cameras taped her on site , she says there will be no footage of her new venture in the three-part special. (So it's for the seventh season then? Gorga won't say.)\nVicki Hyman may be reached at vhyman@njadvancemedia.com . Follow her on Twitter @vickihy . Find NJ.com/Entertainment on Facebook .\nWe'll be recapping the \"Real Housewives of New Jersey\" special every Sunday night. In the meantime, check out our new podcast TV Hangover , where TV critic Vicki Hyman and TV super fan Erin Medley talk about all things small screen, highbrow and low.\nTV HANGOVER, EP. 4: 'The Leftovers' returns, 'Quantico' soars and Vicki interviews 'The Voice' contestant NJ.com TV critic Vicki Hyman and super fan Erin Medley agree to hate \"Dr. Ken\" but are divided on drama \"Quantico.\" New Jersey's Manny Cabo talks about wowing judges on NBC's \"The Voice.\" Subscribe to the podcast on iTunes or Stitcher .", "external_links": ["http://www.stitcher.com/s?fid=72628&refid=stpr", "http://www.twitter.com/vickihy", "https://www.facebook.com/NJ.comEntertainment", "https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/227368289&color=ff5500&auto_play=false&hide_related=false&show_comments=true&show_user=true&show_reposts=false", "https://itunes.apple.com/us/podcast/tv-hangover/id1035437200", "http://player.theplatform.com/p/PHSl-B/yT7k3t_YLXoZ/embed/select/a6QpScyD6ywD", "http://www.etonline.com/news/173062_real_housewives_of_new_jersey_star_melissa_gorga_opens_boutique/"], "published": "2015-10-10T00:45:00.000+03:00", "crawled": "2015-10-10T12:08:47.856+03:00", "highlightTitle": ""}