{"organizations": [], "uuid": "5040fed574377fe87336503e18a23892562d780b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266353/arts-entertainment-television", "section_title": "Arts &amp; Entertainment: Television - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30169423/as-cooler-weather-approaches-national-home-expert-danny-lipford-launches-satellite-media-event-offering-tips-for-seasonal-improvements-and-healthy", "country": "US", "title": "As Cooler Weather Approaches, National Home Expert Danny Lipford Launches Satellite Media Event Offering Tips for Seasonal Improvements and Healthy Homes", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "As Cooler Weather Approaches, National Home Expert Danny Lipford Launches Satellite Media Event Offering Tips for Seasonal Improvements and Healthy Homes - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T12:01:00.000+03:00", "replies_count": 0, "uuid": "5040fed574377fe87336503e18a23892562d780b"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30169423/as-cooler-weather-approaches-national-home-expert-danny-lipford-launches-satellite-media-event-offering-tips-for-seasonal-improvements-and-healthy", "ord_in_thread": 0, "title": "As Cooler Weather Approaches, National Home Expert Danny Lipford Launches Satellite Media Event Offering Tips for Seasonal Improvements and Healthy Homes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "With cooler weather driving people indoors, Home Improvement Expert Danny Lipford gives advice on seasonal projects and discusses what homeowners can do to clean their indoor air and maintain a healthier home.\nMobile, AL (PRWEB) October 02, 2015\nDanny Lipford, National Home Improvement Expert and star of Today’s Homeowner TV and radio, presented a Satellite Media Event yesterday to 15 million viewers, offering advice on winter-friendly home improvements. During the October 1 event titled “Tips to Avoid the Winter Blues”, Danny presented tried-and-true advice to keep consumers active during the approaching cold season by taking on some projects around the house.\nTraditionally, when the weather turns cold, homeowners head inside where they’ll spend 90% of their time through the season. “A lot of people shy away from wintertime projects, but just because you’re stuck indoors doesn’t mean you can’t do things to improve your home,” said Danny. “Painting a room to give it a fresh look, updating light fixtures, and changing out drapes are a few tasks you can take on during cold months. These projects will keep you engaged and active, plus you’ll get to enjoy the new look and feel of your home.”\nIn addition to winter-friendly home improvements, Danny also discussed “chores you can’t ignore” to maintain a healthy home during cold months when families stay indoors. He pointed out that homes today are built with tighter envelopes than ever before, and while that’s great for energy efficiency, allergens and pollutants can be trapped indoors, posing health risks. “Paying attention to the quality of the air you’re breathing inside your home is a very important issue,” offered Danny. “With 1 in 5 Americans suffering from asthma and allergies, manufacturers are really responding to consumers who are concerned about keeping their homes clean.” Danny advised homeowners to consider central vacuum systems and kitchen venting hoods that route exhaust to the outside of the home as this is an effective way to clean the air inside the home and provide an overall healthier environment.\nDanny also cautioned that bathrooms should not be overlooked when it comes to Indoor Air Quality. Baths can be a haven for mold and mildew growth which can lead to serious health problems. He explained that homeowners can keep the humidity level in check by installing and regularly using a bath vent fan that exhausts moisture outdoors.\nThe Satellite Media Event included national sponsor Broan-NuTone. To obtain a video clip from Danny’s “Tips to Avoid the Winter Blues” media event to share with your audience, visit Today's Homeowner to download, or contact Stephanie Greenwood at 251.478.3345 x110 / stephanie(at)dannylipford(dot)com.\nAbout Danny Lipford\nAs a contractor for 36 years, Danny Lipford is one of the most respected and sought-after names in the home improvement industry. He has made more than 160 national television appearances and is an expert source for hundreds of popular magazines and websites each year.\nToday's Homeowner is a national, multi-media home improvement brand including Danny’s Emmy-nominated television show, Today’s Homeowner with Danny Lipford, airing on over 205 stations across the country and reaching 1.75 million viewers each week. His weekly syndicated radio show by the same name and radio features air on more than 160 stations across the U.S. and his website, TodaysHomeowner.com, draws over 1.8 million unique monthly viewers.\n //www.prweb.com/releases/danny_lipford/indoor_air_quality/prweb12997585.htm\n ", "external_links": ["http://www.prweb.com/releases/danny_lipford/indoor_air_quality/prweb12997585.htm", "http://www.todayshomeowner.com/television", "http://www.todayshomeowner.com/email.todayshomeowner.com/SME-10-01-15.php"], "published": "2015-10-02T12:01:00.000+03:00", "crawled": "2015-10-02T13:13:28.600+03:00", "highlightTitle": ""}