{"organizations": [], "uuid": "46fafdf1fed42dc48e9858ba52fadda465076431", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266347/arts-entertainment-general", "section_title": "Arts &amp; Entertainment: General - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30248362/a-fragile-tomorrow-release-make-me-over-on-mpress-records-october-16", "country": "US", "title": "A Fragile Tomorrow Release \"Make Me Over\" On MPress Records October 16", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "A Fragile Tomorrow Release \"Make Me Over\" On MPress Records October 16 - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T18:02:00.000+03:00", "replies_count": 0, "uuid": "46fafdf1fed42dc48e9858ba52fadda465076431"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30248362/a-fragile-tomorrow-release-make-me-over-on-mpress-records-october-16", "ord_in_thread": 0, "title": "A Fragile Tomorrow Release \"Make Me Over\" On MPress Records October 16", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Opening for folk legends the Indigo Girls on Tour in November\nNew York, NY (PRWEB) October 13, 2015\nCharleston, SC four piece, A Fragile Tomorrow are releasing their fifth studio album Make Me Over , their label debut from MPress Records. The album was self-produced and self-engineered, recorded at Low Watt Recording studios in Savannah, GA, the studio run by band members Sean and Dominic Kelly, identical brothers. They mixed it with Grammy® winning producer Malcolm Burn. Make Me Over is being released October 16, and is available for pre-order now via iTunes .\nMake Me Over is saturated with the transformative/transgressive air of rock n' roll androgyny inhabiting songs that are complex yet immediately infectious. The album explores new sonic territory for the band inspired by the bold aesthetic explorations of David Bowie, T. Rex, and Brian Wilson as well as the frantic energy of Cheap Trick and The Who. Their performances are thick and swirling with dense layers of multiple guitars and heady vocal harmonizing. Special guests include folk legend Joan Baez, Amy Ray and Emily Saliers of Indigo Girls, Mark Hart of Crowded House, Vicki Peterson of The Bangles, and John Cowsill of The Beach Boys. There’s already been a flood of pre-release praise for the album:\n“I’m always reminded how refreshing it is to be around AFT,” Indigo Girls’ Emily Sailer says. “These guys love the true beauty of music, and it shines through in projects like this community rendition of ‘One Way Ticket.'” Her songwriting partner Amy Ray adds, “Leave [it] to A Fragile Tomorrow to understand the musical ties that bind and to pay homage to them with their song and spirit! Recording the song ‘One Way Ticket’ was a cross-generational psychedelic experience with [a] band that I look to for inspiration and evolution.”\nDusty Henry/ConsequenceOfSound.net 8/26\n\"Bearing an endearing similarity to XTC and Big Star (what better bands to emulate?) Make Me Over is a rich and wonderfully catchy album by the South Carolina band\"\nAdrien Begrand/Popmatters.com 10/9\n\"The absorption of so many varied influences has given an enormous palette for A Fragile Tomorrow to paint with and they’ve used multiple colors to layer this musical canvas with an incredible array of sounds. If you think what I’ve said is bluster, forget it. Get your hands on this album and listen to it because I’m satisfied in knowing that once you do, you won’t stop listening to it for days and days. And then you’ll be turning others on to A Fragile Tomorrow. Which is my point. Everyone needs to know this band. And I mean EVERYONE.\"\nRobert Ross/Popdose.com 9/29\n\"Make Me Over celebrates the past forty years of rock’n‘roll by blending power pop punch, glam rock flair and a classic rock sense of melody into a single vision. The vocal harmonies of brothers Sean Kelly, Brendan Kelly and Dominic Kelly recall the familial dreaminess of The Beach Boys packed with Cheap Trick’s exuberance, blending perfectly with the lyrical instrumentation of the songs. Subtle aspects of the production add dimension to the tracks, creating a dynamic backdrop for tales of unrequited love, alienation and general confusion. It’s Teenage Fanclub by way of Sloan with a touch of Matthew Sweet\"\nChuck Foster/BigTakeover.com 10/8\n\"On their latest, ‘Make Me Over,’ A Fragile Tomorrow is thick with pop goodness, swirling soundscapes and layered guitars. They add a full mix of sounds to their songs, giving them plenty of weight to sink your teeth into. I defy you not to bounce around with the jangly rocker “Hit Parade” or rock out to the title track, which opens the 13-song album. As a whole, ‘Make Me Over’ is a complex album, but not hard to get into. The songs have their own personality, painting a wide swath in many styles.\"\nTroy Michael/InnocentWords.com 10/2\n\"Great songs, a strong image, and a strong presence...all add up to a band that is impossible to ignore. A Fragile Tomorrow songs are smart, reflective, melodic, and ultimately very catchy. This is one of those rare cases where the folks in the band are doing everything right\"\nDon Seven/Babysue.com October update\nThe group was formed in 2003 by Sean, Dominic (both of whom live with cerebral palsy) and their brother Brendan in their parents' basement, named in honor of Sean and Dominic’s triplet brother who passed away some eight years earlier; Shaun Rhoades joined in 2006. That same year, they released their debut album, Wishful Thinking. Early 2008 saw the release of the group’s second album Beautiful Noise, produced by Grammy® award-winner Malcolm Burn (Emmylou Harris, Patty Griffin, and Patti Smith, among many others). In 2009, they recorded their third record “Tripping Over Nothing,” with singer-songwriter Danielle Howle producing and Amy Ray, songstress Susan Cowsill, and smart-pop legend Peter Holsapple contributing. Sean and Dominic also made an appearance on Indigo Girls’ live Staring Down the Brilliant Dream album as well as Amy Ray’s 2012 solo release, Lung of Love.\nFrom late 2010 through early 2011, A Fragile Tomorrow joined Indigo Girls on tour, then later that year were invited to tour with The Bangles, the band’s West Coast debut. More high-profile gigs followed throughout 2012, as they shared bills with Antigone Rising, Garrison Starr, Drivin’ N Cryin’, and Matthew Sweet. One Massachusetts critic who caught them opening for Sweet proclaimed AFT as “everything that is right with music.”\nIn the midst of this hectic touring schedule, A Fragile Tomorrow nonetheless found time to record their fourth record, Be Nice Be Careful, with pop-auteur Mitch Easter (R.E.M., Pavement, etc.) and Ted Comerford co-producing. This batch of songs showed considerable growth not only as songwriters, but as musicians.\nAudiophile Reviews said \"Be Nice Be Careful redefines power-pop for the 21st Century\", while SomethingElse Reviews boasts that “their smart sense of purpose, and a determination well beyond their years, ensures that A Fragile Tomorrow holds its own, even among much more famous contributors. This album ought to be the one that gets them there, too”. Following this album’s release, the band toured the United States and Europe extensively and released a live album from the European leg of their touring \"Belgique: Live at AB in Brussels\" in 2014.\nSince their inception A Fragile Tomorrow has won the respect of fans and fellow musicians alike through their venerable work ethic, stellar musicianship and fans in high places!\nOn Tour Now!\nOct 16 // MPressFest CMJ @ The Cutting Room // New York, NY\nOct 17 // BSP // Kingston, NY\nOct 23 // Redux Contemporary Art Center // Charleston, SC\nNov 01 // Opening for Indigo Girls at Maryland Hall for the Creative Arts // Annapolis, MD\nNov 02 // Opening for Indigo Girls at Birchmere // Alexandria, VA\nNov 04 // Opening for Indigo Girls at Mayo Performing Arts Center // Morristown, NJ\nNov 05 // Opening for Indigo Girls at Beacon Theatre // New York, NY\nNov 06 // Opening for Indigo Girls at Troy Savings Bank Music Hall // Troy, NY\nNov 07 // Opening for Indigo Girls at Orpheum Theatre // Boston, MA\nNov 09 // Opening for Indigo Girls at Stone Mountain Arts Center // Brownfield, ME\nNov 10 // Opening for Indigo Girls at The Strand Theatre // Rockland, ME\nNov 11 // Opening for Indigo Girls at The Paramount Theatre // Rutland, VT\nNov 13 // Opening for Indigo Girls at Smith Opera House // Geneva, NY\nNov 14 // Opening for Indigo Girls at Asbury Hall // Buffalo, NY\nNov 15 // Opening for Indigo Girls at Sound Board // Detroit, MI\n //www.prweb.com/releases/2015/10/prweb13018212.htm\n ", "external_links": ["http://www.prweb.com/releases/2015/10/prweb13018212.htm", "https://itunes.apple.com/us/album/make-me-over/id1034614004"], "published": "2015-10-13T18:02:00.000+03:00", "crawled": "2015-10-13T18:17:45.600+03:00", "highlightTitle": ""}