{"organizations": [], "uuid": "1c07a6a52107999c94a8c7b6d6bb1bdd10e8aec1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.timesunion.com", "main_image": "http://www.timesunion.com/img/pages/article/opengraph_default.jpg", "site_section": "http://www.timesunion.com/default/feed/entertainment/feed/Entertainment-News-214.php", "section_title": "Entertainment News", "url": "http://www.timesunion.com/news/article/Doris-Duke-mansion-in-New-Jersey-can-be-razed-6573879.php", "country": "US", "title": "Doris Duke mansion in New Jersey can be razed, panel decides", "performance_score": 0, "site": "timesunion.com", "participants_count": 1, "title_full": "Doris Duke mansion in New Jersey can be razed, panel decides - Times Union", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T17:09:00.000+03:00", "replies_count": 0, "uuid": "1c07a6a52107999c94a8c7b6d6bb1bdd10e8aec1"}, "author": "timesunion.com", "url": "http://www.timesunion.com/news/article/Doris-Duke-mansion-in-New-Jersey-can-be-razed-6573879.php", "ord_in_thread": 0, "title": "Doris Duke mansion in New Jersey can be razed, panel decides", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "HILLSBOROUGH, N.J. (AP) — A 67,000-square-foot mansion where tobacco heiress Doris Duke lived can be demolished, a panel ruled.\nThe Hillsborough Township Historic Preservation Commission rendered its decision Thursday night, culminating a lengthy hearing process that had taken place over the last few months and drew dozens of people.\nThe Duke Farms Foundation had sought to demolish the mansion, which has been empty since Duke's death in 1993 at age 80. They said the building, erected in 1893, had fallen into disrepair and would take $10 million to $20 million to bring it up to code.\nFoundation officials have said they planned to open about 50 acres at Duke Farms to the public if the demolition was approved. That property, which surrounds the home and is now fenced off, includes waterfalls, a lake and a meditation garden.\nA grass-roots community group called DORIS, for Demolition of Residence is Senseless, led the fight against the foundation's plans. They wanted the foundation to explore several possible \"re-adaptive uses\" for the mansion in Hillsborough Township that they said would generate income and attention.\nDuke was a socialite, philanthropist and environmentalist with interests ranging from fine art to horticulture to surfing. She was a global traveler who acquired items from around the world, including a collection of Islamic and Southeast Asian art.\nShe led a colorful life that drew international media attention. But most of her philanthropic work involved the Hillsborough estate, where she created many elaborately themed gardens, including one of the nation's largest indoor botanical displays.\nDuke's father, James Buchanan Duke , assembled the Tudor-style estate, beginning with a 357-acre farm on a picturesque stretch of the Raritan River. He eventually acquired 40 adjacent farms in the following years, expanding the total acreage of Duke Farms to 2,200 acres by the early 1900s.", "external_links": ["http://ap.org/schemas/03/2005/apcm", "http://ap.org/schemas/03/2005/apnm"], "published": "2015-10-16T17:09:00.000+03:00", "crawled": "2015-10-16T16:52:21.727+03:00", "highlightTitle": ""}