{"organizations": ["Apple"], "uuid": "5a9aad077c5f0c0c7312e55655ab01e835d7faf5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kesq.com", "main_image": "http://www.kesq.com/image/view/-/35936572/highRes/2/-/maxh/640/maxw/640/-/u5um31z/-/Apple-hq-jpg.jpg", "site_section": "http://www.kesq.com/7626060?format=rss_2.0&view=feed", "section_title": "Entertainment", "url": "http://www.kesq.com/news/money/apple-bans-hundreds-of-iphone-apps-that-secretly-gathered-personal-info/35926014", "country": "US", "title": "Apple bans hundreds of apps that gather personal info", "performance_score": 0, "site": "kesq.com", "participants_count": 0, "title_full": "Apple bans hundreds of apps that gather personal info", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T09:13:00.000+03:00", "replies_count": 0, "uuid": "5a9aad077c5f0c0c7312e55655ab01e835d7faf5"}, "author": "", "url": "http://www.kesq.com/news/money/apple-bans-hundreds-of-iphone-apps-that-secretly-gathered-personal-info/35926014", "ord_in_thread": 0, "title": "Apple bans hundreds of apps that gather personal info", "locations": ["NEW YORK", "China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["David Goldman Jim Castel/CNN"], "text": "Apple bans hundreds of apps that gather personal info Most were made in China but available worldwide By David Goldman Jim Castel/CNN NEW YORK (CNNMoney) - \nApple has removed hundreds of apps from the iTunes App Store that secretly collected personal information from anyone who downloaded them. Related Content Hacker who allegedly gave out... \nMost of the 256 affected apps were made in China, but they were available worldwide on the app store and were downloaded 1 million times, according to app analytics service SourceDNA, which first discovered the problem. \nThe apps' creators used a software development kit from a Chinese advertising company called Youmi, which allowed the developers to put ads in their apps. That's kosher. \nBut Youmi's software gathered information about the people who downloaded the apps, including their email addresses and iPhone serial numbers -- sending all that data to Youmi's servers. That skirted Apple's strict privacy guidelines for app developers. \nAnd the way Youmi designed the software hid that fact from the developers and Apple's iTunes App Store gatekeepers. \nSourceDNA did not say which apps were affected. The company told Apple about the problem on Sunday, and Apple removed the apps on Monday. \n\"This is a violation of our security and privacy guidelines,\" Apple said in a statement. \"The apps using Youmi's SDK will be removed from the App Store and any new apps submitted to the App Store using this SDK will be rejected.\" \nAnyone who already downloaded the apps will still be able to use them but the apps won't be updated. \nThe data collection does not appear to be the developers' fault, since Youmi was disguising the fact that its software was sending that data to its servers. Apple said it is working with the app developers to update their apps, ensuring they are safe for customers and in compliance with the app store's guidelines. The apps are banned from the store until they are fixed. \nThis is the third big lapse in Apple's typically tight app store security in the past month. \nLast week, Apple banned a group of apps that were able to peek into encrypted communications between the iPhones they were installed on and the servers the phones communicated with. \nIn late September, the app store suffered a major attack, forcing Apple to remove dozens of popular apps that had been infected by malware. The malicious apps were capable of duping customers into giving up their iCloud passwords and opening dangerous websites. \nCopyright 2015 by CNN NewSource . All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Recommended", "external_links": [], "published": "2015-10-20T09:13:00.000+03:00", "crawled": "2015-10-20T09:18:11.978+03:00", "highlightTitle": ""}