{"organizations": [], "uuid": "7e88148c283d77ced9180db7aaf5374cf3b8b46e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.aceshowbiz.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Aceshowbizcom-EntertainmentNews\r", "section_title": "Aceshowbiz.com - Entertainment News", "url": "http://www.aceshowbiz.com/news/view/00089449.html", "country": "US", "title": "Blake Shelton Goes on Hilarious Twitter Rant After He Read False Reports About Him", "performance_score": 0, "site": "aceshowbiz.com", "participants_count": 1, "title_full": "Blake Shelton Goes on Hilarious Twitter Rant After He Read False Reports About Him", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T07:17:00.000+03:00", "replies_count": 0, "uuid": "7e88148c283d77ced9180db7aaf5374cf3b8b46e"}, "author": "AceShowbiz.com", "url": "http://www.aceshowbiz.com/news/view/00089449.html", "ord_in_thread": 0, "title": "Blake Shelton Goes on Hilarious Twitter Rant After He Read False Reports About Him", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments 'The stuff I read about myself blows my mind. Shouldn't I get to do all these things since I'm already accused of them?' Blake tweets after learning of abundant false reports about him. \nBlake Shelton was surprised by a lot of false reports about him circulating on the internet, including rumors he's drunk and partying with strippers . The 39-year-old took to Twitter on Wednesday, October 7 to slam the rumors with a series of hilarious tweets. \"The stuff I read about myself blows my mind. Shouldn't I get to do all these things since I'm already accused of them? #doublejeopardy,\" Blake tweeted. \"I literally just got back from FAR northern Quebec chasing caribou and now read about all the crazy stuff I've been doing lately?!! #WTF?!\" Blake expected that the tweets he just posted would be spun by some news outlets as saying, \"Just watch and see how these tweets I just sent get spun...\" He admitted that the reports were quite frustrating and caused him to drink. \"Son of a b***h!!!! This calls for a drink,\" he wrote. The \"Sangria\" singer then replied tweets from his fans who weighed in on his previous tweets. A fan @mandaellengibbs cheekily wrote, \"@blakeshelton we may as well just get married for real now, the press would never know the difference #shotguninvegas?\" Blake jokingly replied, \"Ha Let's do it!!\" Another fan @jewel_burkhead reminded Blake that it's the consequence of being a celebrity,\"@blakeshelton That's called being a celebrity!! No matter what you do they'll turn it around so you're the bad guy!! #teamblake.\" However, Blake refused to be labeled as a celebrity as saying, \"I'm not a celebrity... I'm a country singer!!!\" Fan @ChristyThompso9 predicted the next rumors about Blake, \"@blakeshelton since you were just in Alaska I guess the next story is that you are dating an Eskimo.\" The coach of \" The Voice \" hilariously replied, \"No.. I don't need any more shrinkage...\" \n© AceShowbiz.com More Blake Shelton News", "external_links": [], "published": "2015-10-08T07:17:00.000+03:00", "crawled": "2015-10-08T09:56:20.839+03:00", "highlightTitle": ""}