{"organizations": [], "uuid": "05365a415435b4e68a8af6cf801f008c65efb464", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.arktimes.com", "main_image": "http://media1.fdncms.com/arktimes/imager/u/slideshow/4132996/todo_list1-1-74a793fc0a3bce5d.jpg", "site_section": "http://www.arktimes.com/arkansas/Rss.xml?section=861837", "section_title": "Entertainment, Arkansas Times", "url": "http://www.arktimes.com/arkansas/leon-russell-comes-to-revolution/Content?oid=4132998", "country": "US", "title": "Leon Russell comes to Revolution", "performance_score": 0, "site": "arktimes.com", "participants_count": 1, "title_full": "Leon Russell comes to Revolution", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T09:00:00.000+03:00", "replies_count": 0, "uuid": "05365a415435b4e68a8af6cf801f008c65efb464"}, "author": "Will Stephenson", "url": "http://www.arktimes.com/arkansas/leon-russell-comes-to-revolution/Content?oid=4132998", "ord_in_thread": 0, "title": "Leon Russell comes to Revolution", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LEO BUD WELCH \n7:30 p.m. South on Main. $12. \nLeo Bud Welch was born in 1932, the same year as Patsy Cline, Little Richard, Glenn Gould and Sylvia Plath. It was the beginning of the Dust Bowl. Welch was in Sabougla, Miss., where he'd hang around for the next few decades, working on logging crews and playing blues guitar in cafes and Baptist churches and juke joints like the Blue Angel, where he first saw Ike Turner and B.B. King. Now he lives in a town called Bruce, which is about 20 minutes away. Since being \"discovered\" by Oxford blues label Fat Possum, though, Welch has ventured outside his home region, and recorded albums and performed at festivals and venues all over the country, with his gruff jokes and pink electric guitar. Lately he's been called things like \"the last of the Mississippi Delta blues guitarists,\" which seems a little obtuse (and a little familiar), but he's 83 years old, remains a remarkable and fluent guitarist, and deserves our attention. Performing with him at South on Main this week will be Jimbo Mathus, front man of the beloved psycho-blues outfit Tri-State Coalition, fresh off the release of his new LP, \"Blue Healer.\" \nFRIDAY 10/23 \nARKANSAS TIMES CRAFT BEER FESTIVAL \n6 p.m. Argenta Farmers Market Plaza. $35. Rain or shine. \nAs a species, journalists are known for many things — insomnia, physical cowardice, poor penmanship — but they are above all known for their drinking, which is why we are proud to present the fourth annual Arkansas Times Craft Beer Festival this weekend. Over 50 brewers will be present, offering over 250 beers for your enjoyment. Plus: food samples from local restaurants like Whole Hog Cafe, Doe's Eat Place, Cafe Bossa Nova, Zaffino Italian and Raduno Pizza. And the Fayetteville Americana band Arkansauce, which seems to have named itself just for the occasion, will provide live music. Get your tickets at arktimes.com/craftbeer15 ASAP. This typically sells out. \nFRIDAY 10/23 \nLEON RUSSELL \n8:30 p.m. Revolution. $25. \nIt can be funny to approach the idea of Leon Russell in a vacuum. How do you justify the continued cultural significance of this person, with his wild, rangy beard and tall hats? His shady preoccupation with circus folk and his admittedly kind of silly voice? A Tulsa native, Russell is one of the artists who helped solidify our notion of the 1970s as a gaudy, corduroy-and-patchouli carnival of a decade, full of lavishly produced concept albums and clammy, questionable vibes. He injected his own albums with boggy, drawling, Delta majick and did the same for the songs he produced for others, like Bob Dylan and Joe Cocker. You get the sense that his life has been one long Rolling Thunder Revue, a parade of face-paint and handlebar mustaches and unruly organ solos. He is one of classic rock's great acquired tastes — as simultaneously addictive and off-putting as, say, clove cigarettes or the city of New Orleans. And anyway, as David Berman said once, \"All my favorite singers couldn't sing.\" \nSATURDAY 10/24 \nCHRISTOPHER DENNY \n10 p.m. South on Main. $10. \nOne night last October, after I'd spent a half-hour huddled in a restaurant bathroom during a tornado warning, I drove to the White Water Tavern to see Christopher Denny play. As soon as I got off I-630 I noticed the entire area had lost power. The houses were all dark, and so were the traffic lights, which was ominous. White Water was open, though. I walked in and they'd spread candles around the room, so that you could see just enough to find your way to a chair. Everyone had to be quiet to hear Denny play, and mostly everyone was. He played John Prine and Townes Van Zandt covers and his own songs. When the lights finally came on everyone groaned. It was one of the most memorable shows I've attended in Little Rock — and Denny seems to have that effect on people. \"It's too obvious to say the kid sounded like he was from another time,\" David Ramsey wrote in the Times last year of seeing a 20-something Denny play at a house party. \"Hell, he sounded like he was from another planet.\" A North Little Rock native, his career has long been the subject of torturous, vaguely voyeuristic interest in Arkansas. He has been on the verge of greater success before, particularly in 2009, when things didn't work out due to anxiety, heroin and dissolution. But last year marked his return to form, and to Little Rock. On stage at Juanita's last summer, he said, \"This has been a dangerous place for me, but it's been a good place. Man, I'm so happy to be here.\" \nSUNDAY 10/25 \nVIENNA BOYS CHOIR \n3 p.m. Wildwood Park for the Performing Arts. $35. \nThe Vienna Boys Choir is the only band playing in Little Rock this week that can honestly claim to have been started by a Holy Roman emperor. In this case, Maximilian I, the man credited with kick-starting the Habsburg dynasty in Spain. In the literature on the period, he has been described as \"morbidly depressed\" — he used to refuse to travel anywhere without his coffin. After his death, according to his very specific instructions, his hair was cut off, his teeth knocked out, his body covered in lime and ash and \"publicly displayed to show the perishableness of all earthly glory.\" Nevertheless! He was a great supporter of the arts, Maximilian was, and in 1498 he wrote a letter insisting that the Vienna Boys Choir be started. They worked with all the hot composers of their day (over centuries): Schubert, Bruckner, Mozart, even Salieri. Joseph Haydn was a member. There are around a hundred of them today, all between the ages of 10 and 14, still performing in sailor outfits, touring the world. \nTUESDAY 10/27 \nARKANSAS SYMPHONY ORCHESTRA: 'ANNIVERSARY OF A VIOLIN' \n7 p.m. Clinton Presidential Center. $23. \nAndrew Irvin is the concertmaster of the Arkansas Symphony Orchestra, where his primary instrument is a violin that was built approximately 250 years ago by the legendary Italian violin-maker Nicolo Gagliano. Gagliano was trained by his father, and as a family they established Naples as the new center of forward-thinking violin design in the late 18th century. I'm not entirely clear on how they did this. They abandoned slow-drying oil varnish for shellac, for instance, and perfected well-proportioned archings, but what does that actually mean? For that, you'll have to go Tuesday night to see the Arkansas Symphony Orchestra's tribute to the violin, which will feature pieces by Mozart, Shostakovich, Oeste and Grieg, all of them with violin solos performed by Irvin. \"Mr. Irvin's violin is a direct connection to musical history,\" says Philip Mann, the symphony's musical director. \"Its previous masters' preferences are infused in its tone, their gaffes inscribed upon its body, and its surface is a story of centuries of perspiration and effort in service to art.\"", "external_links": [], "published": "2015-10-22T09:00:00.000+03:00", "crawled": "2015-10-21T22:02:17.554+03:00", "highlightTitle": ""}