{"organizations": [], "uuid": "60bf8be89ce60c9752496c64cf4c4964e51ab9ca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.courant.com", "main_image": "http://www.trbimg.com/img-561aa780/turbine/la-et-ct-the-martian-box-office-steve-jobs-20151011", "site_section": "http://www.courant.com/entertainment/rss2.0.xml", "section_title": "Entertainment - Hartford Courant", "url": "http://www.courant.com/entertainment/la-et-ct-the-martian-box-office-steve-jobs-20151011-story.html", "country": "US", "title": "'The Martian' sits alone atop box office, but 'Steve Jobs' scores big on a small stage", "performance_score": 0, "site": "courant.com", "participants_count": 1, "title_full": "'The Martian' sits alone atop box office, but 'Steve Jobs' scores big on a small stage", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T22:25:00.000+03:00", "replies_count": 0, "uuid": "60bf8be89ce60c9752496c64cf4c4964e51ab9ca"}, "author": "Libby Hill", "url": "http://www.courant.com/entertainment/la-et-ct-the-martian-box-office-steve-jobs-20151011-story.html", "ord_in_thread": 0, "title": "'The Martian' sits alone atop box office, but 'Steve Jobs' scores big on a small stage", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "'The Martian' sits alone atop box office, but 'Steve Jobs' scores big on a small stage 'The Martian' \nMatt Damon in \"The Martian.\" \nMatt Damon in \"The Martian.\" (Handout / TNS) Libby Hill Contact Reporter \n“The Martian” topped the box office for the second straight weekend as Matt Damon and science kept audiences entertained to the tune of an estimated $37 million in the U.S. and Canada, a drop of only 32% from the film's opening weekend. \nDirected by Ridley Scott and released by Twentieth Century Fox, “The Martian” made back its production budget of $108 million as its cumulative earnings rose to $108.7 million. The film is the tale of a lone astronaut (Matt Damon) who, left for dead on Mars, must attempt to survive on his own. Jessica Chastain, Kristen Wiig, Kate Mara, Michael Peña, Jeff Daniels and Chiwetel Ejiofor also star. \nKeeping pace with impressive numbers of its own was Sony Pictures Animation’s “Hotel Transylvania 2,” which grossed an estimated $20.3 million in its third weekend at the box office, a drop of just 39% from last week. The animated comedy has made $116.8 million in the U.S. and Canada to date. \nBut perhaps a bigger story was Universal’s “Steve Jobs,” which opened in just four theaters in New York and Los Angeles but made nearly $521,000, giving the film a massive per-screen average of more than $130,000. Starring Michael Fassbender as Jobs and co-starring Kate Winslet and Seth Rogen, the film recorded the best average of 2015, easily outpacing former champion “Sicario,” which made $66,800 per location in its opening weekend in September. \n“Steve Jobs,” scripted by Aaron Sorkin from Walter Isaacson’s biography and directed by Danny Boyle, opens wide Oct. 23. \nWarner Bros. films took the third and fourth spots at the box office with the Peter Pan prequel “Pan” opening at just $15.5 million, a disappointing number for a film that cost $150 million to make. “Pan” has been plagued with underwhelming reviews from critics and audiences alike. Latest weekend domestic box office Read the story \nThough the reviews may have hurt \"Pan\", it may have been the competition from fellow family film \"Hotel Transylvania 2\" that did the movie in, an issue that will only intensify for the prequel with the release of another family-friendly Sony film, \"Goosebumps\" in the week to come. \nThe studio had happier news in “The Intern,” starring Anne Hathaway and Robert DeNiro, which landed in the fourth with $8.6 million, bringing its cumulative total to just under $50 million. \nRounding out the top five: Lionsgate’s “Sicario” earning $7.3 million in its fourth week of release, bringing the film’s total earnings to $26.7 million. The film, starring Emily Blunt and Benecio Del Toro, details a drug-war operation on the U.S.-Mexico border. It has been helped by an average A-minus grade from moviegoers, according to CinemaScore. \nChris Aronson, head of Fox's domestic distribution, credited the continued success of \"The Martian\" to its crowd-pleasing story. \n\"With the hold this weekend, I think it's entrenched as the major hit of the fall,\" Aronson said. \"I think as word of mouth spreads, this becomes the movie that people have to see and want to see to know what the conversation is about.\" \nIn a more disappointing performance, Sony’s “The Walk” failed to captivate audiences in its move to wide release. Though it added more than 2,000 locations, the film grossed just $3.6 million over the weekend, landing it at No. 7. The film, starring Joseph Gordon-Levitt, is a dramatization of French high-wire artist Philippe Petit's 1974 walk between the World Trade Center towers. \n\"It's disappointing when you love a film and you realize for some reason or another it just can't break through on its release like this,\" said Rory Bruer, president of worldwide distribution for Sony Pictures, adding that the film will have more relevance long-term. \"(Director) Bob Zemeckis has created a film that will be spoken of for many, many years to come.\" \nYear-to-date, the box office is up 6.5%.", "external_links": [], "published": "2015-10-11T22:25:00.000+03:00", "crawled": "2015-10-11T23:16:06.105+03:00", "highlightTitle": ""}