{"organizations": [], "uuid": "977309b341d5c324ac218ee242e04cf415275e71", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.albawaba.com", "main_image": "http://www.albawaba.com/sites/default/files/im/hugh-grant-assaf-film.jpg", "site_section": "http://albawaba.com//rss/entertainment", "section_title": "Al Bawaba - Entertainment", "url": "http://www.albawaba.com/entertainment/hugh-grant-brian-eno-touched-mohammed-assafs-biopic-idol-756108", "country": "US", "title": "Hugh Grant, Brian Eno touched by Mohammed Assaf's biopic 'The Idol'", "performance_score": 0, "site": "albawaba.com", "participants_count": 0, "title_full": "Hugh Grant, Brian Eno touched by Mohammed Assaf's biopic 'The Idol'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T12:49:00.000+03:00", "replies_count": 0, "uuid": "977309b341d5c324ac218ee242e04cf415275e71"}, "author": "", "url": "http://www.albawaba.com/entertainment/hugh-grant-brian-eno-touched-mohammed-assafs-biopic-idol-756108", "ord_in_thread": 0, "title": "Hugh Grant, Brian Eno touched by Mohammed Assaf's biopic 'The Idol'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Brian Eno", "Mohammed Assaf", "Hugh Grant"], "text": "Hugh Grant, Brian Eno touched by Mohammed Assaf's biopic 'The Idol' Hugh Grant, Brian Eno touched by Mohammed Assaf's biopic 'The Idol' 2.5 5 \nPublished October 18th, 2015 - 10:49 GMT via SyndiGate.info Rate Article: Hugh Grant attended Assaf's The Idol's film premiere in London. (Oh My Mag) Follow > Click here to add Baroness Sayeeda Warsi as an alert Click here to remove the Baroness Sayeeda Warsi alert Disable alert for Baroness Sayeeda Warsi , Click here to add Baroness Warsi as an alert Click here to remove the Baroness Warsi alert Disable alert for Baroness Warsi , Click here to add Brian Eno as an alert Click here to remove the Brian Eno alert Disable alert for Brian Eno , Click here to add Brian Eno.Assaf as an alert Click here to remove the Brian Eno.Assaf alert Disable alert for Brian Eno.Assaf , Click here to add Gaza as an alert Click here to remove the Gaza alert Disable alert for Gaza Click here to add Gaza Strip as an alert Click here to remove the Gaza Strip alert Disable alert for Gaza Strip , Click here to add Hany Abu-Assad as an alert Click here to remove the Hany Abu-Assad alert Disable alert for Hany Abu-Assad , Click here to add Hugh Grant as an alert Click here to remove the Hugh Grant alert Disable alert for Hugh Grant , Click here to add London as an alert Click here to remove the London alert Disable alert for London Click here to add Mohammed Assaf as an alert Click here to remove the Mohammed Assaf alert Disable alert for Mohammed Assaf , Click here to add Skype as an alert Click here to remove the Skype alert Disable alert for Skype Click here to add UK Prime Minister David Cameron’s Cabinet as an alert Click here to remove the UK Prime Minister David Cameron’s Cabinet alert Click here to add West Bank as an alert Click here to remove the West Bank alert Disable alert for West Bank \nA number of big names are supporting Mohammed Assaf in London , including actor Hugh Grant, Baroness Sayeeda Warsi, the Conservative politician, and the musician and producer Brian Eno. \nAssaf, who first earned worldwide fame by winning Arab Idol two years ago, is currently in London promoting a new biopic, titled The Idol, about his life. \nFilmed in the Gaza Strip, Jenin and other areas of the Occupied Palestinian Territories, in addition to Jordan, The Idol charts Assaf’s life from his boyhood in a refugee camp to triumph in the singing reality show in 2013. \nMr Eno said: ‘I’m very interested in the Palestinian issue and that’s why I got involved in this. I also like Arabic music a lot and I heard about Mohammed winning Arab Idol. He has an incredible voice and a powerful story that made me cry when I watched the film… It’s a good thing that the lights were off… men are not supposed to cry! \n‘There wasn’t a single horror scene in the film and yet the director managed to convey the violence and suffering experienced by Palestinians who live under military occupation. \n‘The young boy who plays Mohammed is a beautiful child. All the children in the film are. The way Palestinian children are growing up with brutal colonialism as their reference is very brave.’ \nThe Idol is directed by twice Oscar-nominated Hany Abu-Assad, who said at his film’s Premiere: ‘All the actors in the film are from Gaza’. \nAbu-Assad explained that ‘because of the travel restrictions imposed by Israel, we could not do the casting there, so we auditioned them via Skype. \n‘The Israeli authorities only allowed us two days of filming in Gaza and it took months and months to get permissions to move the cast to and shoot in the West Bank too. \n‘I thought that the boy playing Mohammed and the girl acting as his sister were better than professional actors, especially as it’s the first time they’ve played in a film. I hope they will inspire other Palestinian children to take up roles in movies, especially children from Gaza.’ \nBaroness Warsi, who quit her position in UK Prime Minister David Cameron’s Cabinet last year over its policy on Gaza, praised Assaf at a dinner on Monday night. \nShe said: ‘We’re here to celebrate Mohammed Assaf’s fight against all odds. Mohammed was not prepared to say no to living his dream and to his desire to give hope to an oppressed people’. \nExpressing his own view on The Idol, Hugh Grant said: ‘Yes, I was there at the Premiere and watched the film. I’m a cynical old bastard but I genuinely loved it. It’s one of the best films I’ve seen for years, and I’m not even lying… It was real, touching… all that. \n‘It’s a brilliant casting. The young Assaf and his sister in the film are very endearing. It was an excellent introduction for me to Palestinian cinema.’ \nElaborating on the power of Abu-Assad’s film, Grant said: ‘I think we’ve become immune to terrible images in the news and sometimes it needs art to really affect people and convey reality better. \n‘The film has a very clever light touch politically and it makes the message more effective in putting the Palestinian story on the global agenda. \n‘I don’t think art can bring a solution to what seem to be intractable problems, but it opens your eyes and enlightens you.’ \nKnife and gun attacks are currently breaking out across Israel and the Occupied Palestinian Territories almost daily, with serious casualties on both sides. \nSince the beginning of the month at least 32 Palestinians have been killed by Israeli fire and nearly 2000 have been wounded in Israeli attacks. \nMeanwhile eight Israelis died in assaults, including one in which a victim was run over by a car and then hacked to death by a man using an axe. Numerous others have been injured in stabbing and firearm incidents. Advertisement © 2000 - 2015 Al Bawaba (www.albawaba.com) Rate Article:", "external_links": [], "published": "2015-10-18T12:49:00.000+03:00", "crawled": "2015-10-18T13:29:14.998+03:00", "highlightTitle": ""}