{"organizations": [], "uuid": "a0d522846cb07be39e16a68282ca8764d9bd9d04", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wptv.com", "main_image": "http://sharing.wptv.com/sharescnn/photo/2015/10/15/1444948682_25293249_ver1.0_640_480.jpg", "site_section": "http://www.wptv.com/feeds/rssFeed?obfType=RSS_FEED&siteId=10016&categoryId=10008", "section_title": "Entertainment | WPTV", "url": "http://www.wptv.com/newsy/the-big-issue-in-jayzs-big-pimpin-lawsuit", "country": "US", "title": "The big issue in Jay-Z's 'Big Pimpin' lawsuit", "performance_score": 0, "site": "wptv.com", "participants_count": 0, "title_full": "The big issue in Jay-Z's 'Big Pimpin' lawsuit", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T01:39:00.000+03:00", "replies_count": 0, "uuid": "a0d522846cb07be39e16a68282ca8764d9bd9d04"}, "author": "", "url": "http://www.wptv.com/newsy/the-big-issue-in-jayzs-big-pimpin-lawsuit", "ord_in_thread": 0, "title": "The big issue in Jay-Z's 'Big Pimpin' lawsuit", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Big Issue In Jay-Z's 'Big Pimpin' Lawsuit Cody LaGrow 6:39 PM, Oct 15, 2015 \nPhoto Credit: Getty Images / Scott Gries \nAh, 1999 — a year where Jay-Z opted for a bucket hat instead of Beyonce. Mr. Carter was truly \"Big Pimpin'\" on his yacht full of bikini-clad women and champagne showers. But 16 years later, this '90s anthem has got Hova in hot water. \nJay-Z and producer Timbaland —both behind the song \"Big Pimpin\" — are being accused of copyright infringement . The distinct beat from that song stems from the song \"Khosara Khosara,\" the work of an Egyptian composer named Baligh Hamdi. Now, Hamdi's heirs are in court after filing a lawsuit in 2007, saying the hip-hop duo violated the rights of the song. \nYou see, when Timbaland first heard \"Khosara Khosara,\" he thought it was public domain. Timbaland then sampled it and turned it into one of Jay-Z's greatest hits. But when the song became a sensation, foreign music company EMI contacted Jay-Z and Timbaland to pay up. \nLawyers for Jay-Z and Timbaland say they then secured appropriate rights from EMI to use the music for $100,000, which should have nixed any future legal disputes. But the Hamdi heirs say it wasn't EMI's license to give. \nA lawyer for the heirs said \"Big Pimpin'\" violated Hamdi's \"moral rights\" — a legal concept in Egypt that would have required them to get further permission to use Hamdi's work in a song promoting, well, big pimpin' and spendin' cheese. \nJay-Z and Timbaland's lawyers say that the court has determined moral rights have no application in the United States and, therefore, can't support the heirs' claims of copyright infringement. \nThis case comes after Robin Thicke and Pharrell were ordered to pay Marvin Gaye's family an unprecedented $5.3 million after a jury said \"Blurred Lines\" was a knock-off of Gaye's \"Gotta Give It Up.\" \nSam Smith even found himself in a copyright dispute with Tom Petty this year. Petty said his song \"I Won't Back Down\" was similar to Smith's \"Stay With Me.\" Smith's team called it a \"complete coincidence\" and credited Petty and team as co-writers. \nThe trial began this week and is featuring music's top lawyers who are taking on another complex case to answer who owns creativity. \nThis video includes images from Getty Images.", "external_links": [], "published": "2015-10-16T01:39:00.000+03:00", "crawled": "2015-10-16T01:48:52.904+03:00", "highlightTitle": ""}