{"organizations": ["Scott Flanders Ricardo DeAratanha / Los Angeles Times", "Times Playboy"], "uuid": "4c38675525fa481182b40b3fa526072acba1b345", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.latimes.com", "main_image": "http://www.trbimg.com/img-561cbd91/turbine/la-fi-playboy-nude-photos-20151013", "site_section": "http://news.google.com/news?pz=1&cf=all&ned=us&hl=en&topic=e&output=rss", "section_title": "Entertainment - Google News", "url": "http://www.latimes.com/business/la-fi-playboy-nude-photos-20151013-story.html", "country": "IL", "title": "Playboy to end publishing fully nude female photos - Los Angeles Times", "performance_score": 1, "site": "latimes.com", "participants_count": 0, "title_full": "Playboy to end publishing fully nude female photos - Los Angeles Times", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T11:17:00.000+03:00", "replies_count": 0, "uuid": "4c38675525fa481182b40b3fa526072acba1b345"}, "author": "", "url": "http://www.latimes.com/business/la-fi-playboy-nude-photos-20151013-story.html", "ord_in_thread": 0, "title": "Playboy to end publishing fully nude female photos - Los Angeles Times", "locations": ["Los Angeles"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Playboy to end publishing fully nude female photos Scott Flanders Ricardo DeAratanha / Los Angeles Times \nPlayboy will stop publishing nude female photos. Scott Flanders, pictured, CEO of Playboy Enterprises, told the New York Times sex acts are now \"one click away.\" \nPlayboy will stop publishing nude female photos. Scott Flanders, pictured, CEO of Playboy Enterprises, told the New York Times sex acts are now \"one click away.\" (Ricardo DeAratanha / Los Angeles Times) Associated Press \nPlayboy will no longer publish photos of nude women as part of a redesign of the decades-old magazine, according to a news report Monday. \nExecutives for the magazine company told The New York Times that the change will take place in March 2016. \nThe paper reported that the print edition of Playboy will still feature women in provocative poses, but they will no longer be fully nude. \nPlayboy editor Cory Jones contacted founder and current editor in chief Hugh Hefner recently about dropping nude photos from the print edition and he agreed, the New York Times reported. \nThe change represents a major shift for the magazine, which broke new ground when Hefner created it and featured Marilyn Monroe on its debut cover in 1953. \nBut officials acknowledge that Playboy has been witnessing widespread changes. \"You're now one click away from every sex act imaginable for free. And so it's just passé at this juncture,\" said Scott Flanders, the company's chief executive. See the most-read stories this hour >> Read the story \nThe New York Times reported that Playboy's print circulation, once measured in millions, is now about 800,000, according to Alliance for Audited Media. \nThe move marks the latest step away from depictions of full nudity, which were banned from the magazine's website last August. \nPrevious efforts to revamp Playboy have never quite stuck. But this time, as the magazine seeks to compete with younger outlets, Flanders said it sought to answer a key question: \"If you take nudity out, what's left?\"", "external_links": [], "published": "2015-10-13T11:17:00.000+03:00", "crawled": "2015-10-13T11:42:43.525+03:00", "highlightTitle": ""}