{"organizations": [], "uuid": "d5d53181fe80da34f06a272ffcf857b969560b7c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.filmibeat.com", "main_image": "http://www.filmibeat.com/img/2015/10/15-1444913454-1.jpg", "site_section": "http://www.filmibeat.com/rss/filmibeat-bollywood-fb.xml", "section_title": "Oneindia.in - Entertainment Bollywood", "url": "http://www.filmibeat.com/bollywood/features/2015/pics-jacqueline-fernandez-goes-shopping-in-london-201876.html", "country": "CA", "title": "Pics! Jacqueline Fernandez Goes Shopping In London", "performance_score": 0, "site": "filmibeat.com", "participants_count": 0, "title_full": "Pics! Jacqueline Fernandez Goes Shopping In London", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T16:46:00.000+03:00", "replies_count": 0, "uuid": "d5d53181fe80da34f06a272ffcf857b969560b7c"}, "author": "", "url": "http://www.filmibeat.com/bollywood/features/2015/pics-jacqueline-fernandez-goes-shopping-in-london-201876.html", "ord_in_thread": 0, "title": "Pics! Jacqueline Fernandez Goes Shopping In London", "locations": ["London"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Vinod D'souza", "Jacqueline Fernandez"], "text": "Posted by: Vinod D'souza Published: Thursday, October 15, 2015, 18:27 [IST] \nAfter wrapping up the shoot of Housefull 3 in London, Jacqueline Fernandez hits the streets and went shopping with her sister. The actress shared a lot of fun filled pictures on her Instagram account roaming the streets of London.Jacqueline Fernandez is currently shooting in London for Housefull 3 along with Lisa Haydon and Nargis Fakhri . The lead actors in the movie are Akshay Kumar , Abhishek Bachchan and Riteish Deshmukh.Sajid Nadiadwala, has casted Akshay Kumar in all the three Housefull franchises and the movie is a comedy roller coaster.Recently we saw pictures of Akshay Kumar and Twinkle Khanna roaming the city of Norwich taking a day off from the shoot of Housefull 3 , and now Jacqueline Fernandez is seen chilling with her sister in London.Click on to see some awesome pictures of Jacqueline Fernandez shopping in London with her sister. The images were posted in her Instagram account. Pics! Jacqueline Fernandez Goes Shopping In London 1/13 It's London Time \nAfter wrapping up the shoot of Housefull 3 in London, Jacqueline Fernandez hits the streets along with her sister. Pics! Jacqueline Fernandez Goes Shopping In London 2/13 Fernandez Sisters \nJacqueline Fernandez shared a lot of fun filled pictures on her Instagram account roaming the streets of London. Pics! Jacqueline Fernandez Goes Shopping In London 3/13 \nJacqueline Fernandez drinking a Coconut Milk Latte at a cafe in London. Pics! Jacqueline Fernandez Goes Shopping In London 4/13 \nJacqueline Fernandez shared a video on her Instagram account. Pics! Jacqueline Fernandez Goes Shopping In London 5/13 The Ladies Three \nJacqueline Fernandez is currently shooting in London for Housefull 3 along with Lisa Haydon and Nargis Fakhri. Pics! Jacqueline Fernandez Goes Shopping In London 6/13 \nThe lead actors of Housefull 3 are Akshay Kumar, Abhishek Bachchan and Riteish Deshmukh. Pics! Jacqueline Fernandez Goes Shopping In London 7/13 Housefull \nSajid Nadiadwala has casted Akshay Kumar in all the three Housefull franchises and the movie is a comedy roller coaster. Pics! Jacqueline Fernandez Goes Shopping In London 8/13 A Day Off \nRecently we saw pictures of Akshay Kumar and Twinkle Khanna roaming the city of Norwich taking a day off from the shoot of Housefull 3. Pics! Jacqueline Fernandez Goes Shopping In London 9/13 \nJacqueline Fernandez is seen chilling with Lisa Haydon at the sets of Housefull 3. Pics! Jacqueline Fernandez Goes Shopping In London 10/13 Girls Just Wanna Have Fun \nJacqueline Fernandez and Nargis Fakhri having fun on the sets of Housefull 3. Pics! Jacqueline Fernandez Goes Shopping In London 11/13 Jacqueline Fernandez On Her Instagram Account \n\"Schedule wrap for@nargisfakhri we gonna miss you!!!@lisahaydon pls stop making me laugh so much!!!! #houseful3 #london\" Pics! Jacqueline Fernandez Goes Shopping In London 12/13 \nJacqueline Fernandez on the cover page of Gracia magazine. You might like", "external_links": [], "published": "2015-10-15T16:46:00.000+03:00", "crawled": "2015-10-15T21:25:55.431+03:00", "highlightTitle": ""}