{"organizations": [], "uuid": "611c084aa702ad48f724a090d4e214376c3a64b7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ctvnews.ca", "main_image": "http://www.ctvnews.ca/polopoly_fs/1.2601488.1444329388!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "site_section": "http://www.ctvnews.ca/rss/ctvnews-ca-entertainment-public-rss-1.822292", "section_title": "CTVNews.ca - Entertainment - Public RSS", "url": "http://www.ctvnews.ca/entertainment/actor-randy-quaid-ordered-released-faces-removal-from-canada-next-week-1.2601448", "country": "CA", "title": "Actor Randy Quaid ordered released, faces removal from Canada next week", "performance_score": 0, "site": "ctvnews.ca", "participants_count": 1, "title_full": "Actor Randy Quaid ordered released, faces removal from Canada next week | Entertainment & Showbiz from CTV News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "611c084aa702ad48f724a090d4e214376c3a64b7"}, "author": "Sidhartha Banerjee,  The Canadian Press", "url": "http://www.ctvnews.ca/entertainment/actor-randy-quaid-ordered-released-faces-removal-from-canada-next-week-1.2601448", "ord_in_thread": 0, "title": "Actor Randy Quaid ordered released, faces removal from Canada next week", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MONTREAL -- Actor Randy Quaid has been ordered released by the Immigration and Refugee Board but faces the looming prospect of being returned to the United States as early as next week.\nQuaid appeared briefly before the board in Montreal on Thursday for a detention review and was released in short order by board member Dianne Tordorf, who said there were no grounds to hold him.\nQuaid has already been arrested once by CBSA officers in May and released on $10,000 bond and a host of conditions by the same board member, all of which had been respected.\n\"All the conditions have been respected, I find that the offer of release that I made in the past is completely valid today,\" Tordorf ruled. \"I'm releasing you right now because there's no reason to detain you, there is no breach, there is nothing under the law that would permit me even to deprive you of your freedom.\"\nThe CBSA's Anthony Lashley told the hearing an impending departure date and the rejection of a pre-removal risk assessment application on Sept. 22 prompted the arrest on Tuesday, fearing he wouldn't comply with an order to leave the country next Wednesday.\n\"This is the position of the agency: Mr. Quaid represents a flight-risk, we feel it's an important one, we feel that the circumstances have changed enough to warrant his arrest,\" Lashley said, before Tordorf immediately rule that Quaid be released.\nSporting the same massive beard and shoulder-length grey hair, Quaid was silent during the hearing as his wife, Evi, sat in the audience. They both left the downtown Montreal office, politely declining comment.\nHis lawyer, Mark Gruszczynski, told the hearing Quaid's arrest was \"tantamount to a preventative detention.\"\nThe 65-year-old Quaid was informed this week he would be sent back to the United States, where he faces an outstanding warrant and pending criminal charges.\nContacted Thursday, a CBSA spokeswoman did not say whether the removal would proceed or provide any further explanations.\nQuaid and his Canadian wife fled to Canada in 2010, saying they were the victims of persecution. Quaid had sought to stay in Canada and said he was being hunted by \"Hollywood star-whackers.\"\nAfter arriving in 2010, the Quaids lived in Vancouver, Toronto and Ottawa before moving to Montreal in January 2013.\nQuaid's bid for permanent residency was denied in December 2012 and he was arrested earlier this year after he stopped checking in with immigration officials.\nQuaid has said he's willing to return to his native United States to deal with those legal cases and wouldn't jeopardize the bond his father-in-law had put down in May to secure his release.\nSanta Barbara Senior Deputy District Attorney Lee Carter said Wednesday there is an active extradition order for Quaid on a felony vandalism case, and prosecutors would be seeking his extradition if he's returned to the United States. Carter said Quaid and his wife also face felony charges for failing to appear at a November 2010 court hearing while out on bail.\nA friend of the couple, Janet Olmsted Cross, told reporters following the hearing the couple are happy in Montreal living off residuals from Quaid's film career.\nShe's confident there is an explanation for the charges the couple is facing and drove from New York to bring them back to the U.S. if they must leave.\n\"It's just a crazy, complicated series of legal events,\" Olmsted Cross said. \"You're innocent until you're proven guilty.\"\nRelated Stories Actor Randy Quaid detained in Montreal pending immigration board hearing Photos Actor Randy Quaid arrives at his Immigration and Refugee Board hearing in Montreal, Thursday, Oct. 8, 2015. (Peter McCabe / THE CANADIAN PRESS)", "external_links": [], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-08T23:55:35.706+03:00", "highlightTitle": ""}