{"organizations": [], "uuid": "c16cd0472febad2c7cbb7745b3e3373b8b6a5701", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mobilecommercedaily.com", "main_image": "", "site_section": "http://www.mobilecommercedaily.com/category/entertainment/feed/rss/", "section_title": "Mobile Commerce Daily » Entertainment", "url": "http://www.mobilecommercedaily.com/upout-exec-user-segmentation-is-key-for-event-marketers", "country": "US", "title": "UpOut exec: User segmentation is key for event mobile-first sales", "performance_score": 0, "site": "mobilecommercedaily.com", "participants_count": 1, "title_full": "UpOut exec: User segmentation is key for event mobile-first sales", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T11:00:00.000+03:00", "replies_count": 0, "uuid": "c16cd0472febad2c7cbb7745b3e3373b8b6a5701"}, "author": "Alex Samuely", "url": "http://www.mobilecommercedaily.com/upout-exec-user-segmentation-is-key-for-event-marketers", "ord_in_thread": 0, "title": "UpOut exec: User segmentation is key for event mobile-first sales", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "October 20, 2015 UpOut is a subscription-based platform \nRANCHO MIRAGE, CA – An UpOut executive at the Mobile Shopping Summit 2015 stressed the importance of user segmentation for event marketers, especially as third-party applications attempt to catapult themselves up to the selling levels of behemoths such as StubHub and SeatGeek. \nDuring the “Keynote: Mapping The Omnichannel Customer Journey – How To Engage People In A Mobile-First World” session, the executive discussed how event marketer UpOut made the move from a primarily Web-driven platform to a mobile-first application. User segmentation is an imperative strategy for UpOut, as personalized campaigns and profile data help drive sales among eventgoers who enjoy receiving customized suggestions for outings. \n“You can kind of think of it as a gym membership for culture,” said Sam Ho, chief product officer at UpOut , San Francisco. “Our goal is to get people to go out and do something a bit different.” \nChoosing the right platform While the brand currently encompasses a mobile-first approach to targeting consumers and selling tickets, much of its traffic was Web-driven upon its inception four years ago. Offering a native application is imperative for long-term users, some of whom prefer to shop on-the-go. \n“For us, having a native iPhone app is really about enhancing the user experience for those top users that are going to ask for it,” Mr. Ho said. \nFor consumers not active on its app, UpOut engages in a variety of omnichannel campaigns, ranging from social media to email. Getting conversions via email may be a winning strategy for some event marketers, especially as many other brands tend to neglect it as a mobile tactic. \n“It’s important to think about that as a channel that’s mobile,” Mr. Ho said. \nSubscribers receive 2 complimentary event tickets per month \nThe company’s goal is to drive increased transactions per user, which it is achieving by segmenting customers based on a variety of criteria. UpOut keeps of track of consumers viewing specific types of events, such as concerts or museum trips, and then re-targets those users with more of those types of outings. \nIt also focuses on one-to-one messaging by ensuring that everyone received a personalized message. This can be as simple as pulling data from user profiles and greeting consumers by their first name. \nUpOut will also offer customers a list of events taking place nearby their home addresses. \nAnother way it is driving mobile commerce is by identifying a primary cause for shopping cart abandonment. Consumers typically do not attend events alone, meaning they must find a fellow attendee or friend to go with if they do not already have someone in mind. \nConsequently, users may leave tickets in the shopping cart for days a time while they track down an eventgoer. To combat this issue, UpOut sends a push notification the next day after cart abandonment as a reminder to complete the purchase. \nFuture efforts UpOut plans to broaden its targeting efforts to include geofencing and location-based data. That way, if individuals are traveling and in the vicinity of a major event, they may receive a push notification notifying them in case they would like to go. \nData-sharing will also be a future marketing tactic. The brand hopes to allow customers to add purchased events into their mobile calendars, providing the utmost convenience in setting reminders. \nPush notifications are paramount for event marketers \nAdditionally, social integration is at the top of the list. Facebook log-ins make up approximately half of UpOut’s log-ins, suggesting that reaching new users via the social network is a sound idea. \n“People are getting more open about having less private accounts,” Mr. Ho said. “There’s clear demand for this personalization. \n“People are willing to share a little bit more so they can get that personalized information.” \n ", "external_links": [], "published": "2015-10-20T11:00:00.000+03:00", "crawled": "2015-10-21T05:01:30.268+03:00", "highlightTitle": ""}