{"organizations": [], "uuid": "b8a90e45317ff9556737175a8d3aa8eba50e7bab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://images.canberratimes.com.au/2015/10/16/6935209/Thumbnail1001287455gk52jbimage.related.thumbnail.320x214.gk52cf.png1444962276116.jpg.jpg", "site_section": "http://feeds.canberratimes.com.au/rssheadlines/entertainment.xml", "section_title": "Canberra Times Entertainment Headlines", "url": "http://www.canberratimes.com.au/entertainment/about-town/six-reasons-to-visit-meeniyan-20151009-gk52cf.html", "country": "AU", "title": "Six reasons to visit Meeniyan", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "Six reasons to visit Meeniyan", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T15:45:00.000+03:00", "replies_count": 0, "uuid": "b8a90e45317ff9556737175a8d3aa8eba50e7bab"}, "author": "Richard Cornish", "url": "http://www.canberratimes.com.au/entertainment/about-town/six-reasons-to-visit-meeniyan-20151009-gk52cf.html", "ord_in_thread": 0, "title": "Six reasons to visit Meeniyan", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Riding the Great Southern Rail Trail. Photo: Richard Cornish \n1. Garden Festival \nThis annual event in and around this small South Gippsland town sees four private gardens opened to the public on the last Sunday in October. We can't give away too much detail about the gardens, as guests need to buy a map that reveals their location. We can say that one garden is a large and formal country affair with sweeping lawns shaded by established exotic ornamental and native trees. It's blessed with vistas across the rolling hills of South Gippsland. Another has been planted by a New Zealand expat with plants native to her homeland. In the middle of town is a small, modern, eco-indigenous garden with raised vegetable beds and rubble walls giving protection from the prevailing westerlies. The fourth is a vast family garden with a cubby house, gazebo and family pool.\nOctober 31. Maps available from the Meeniyan Town Hall. $10 a head. Details 0409 564 945\nDeep-fried calamari at Moo's. Photo: Richard Cornish \n2. Meeniyan Hall \nAdvertisement The Meeniyan Hall is nothing to look at, built at the outbreak of World War II after the 1882 original burned down. Squat and perfunctory, it hides an interior with such beautiful acoustics that it attracts performers from across Australia and the world. In recent months jazz legend Vince Jones took to the stage and Martha Wainwright performed here after her Jeff Buckley tribute show tour. Performing tomorrow night is LA group Dawes, with Missouri-born Barna Howard supporting. On October 27, The Waifs come to town.\nFor tickets and booking details visit lyrebirdartscouncil.com.au or call (03) 5664 9239.\nOpen Gardens in Meeniyan. Photo: Richard Cornish \n3. Locally Made \nMeeniyan is home to scores of artists. You can see and buy their works at the Meeniyan Art Gallery (meeniyanartgallery.com.au) and take part in regular workshops. A few doors down is Lacy Jewellery Studio and Gallery where husband and wife jewellers Philip and Danielle Lacy make and sell beautifully finished pieces. It's worth dropping into BrownWigg agricultural supplies (110-116 Whitelaw Street) to see the pot belly stoves made out of old truck brake drums by the ingenious prisoners at Fulham gaol.\n4. Locally Grown \nThe Meeniyan Store carries a large range. Photo: Richard Cornish \nThe farmers and producers of South Gippsland grow and make exceptional quality food and wine. The Meeniyan Store carries a large range of these products, such as Gippy Milk, Hazeldean Forest Farm Apple Cider, Waratah Hills Pinot Noir and Prom Coast Ice-Cream. Locals bring in surplus fruit and vegetables from their gardens. Come here for fair trade coffee, homemade honey, muesli cookies and Thorpdale Bakery pies. Out the back is a vegie patch with tables and chairs under umbrellas, plus Charlie and Lola the pet bunnies.\n106 Whitelaw St, 10-5 Tue-Sat, 11-4 Sun, 0431 311 848\n5. Rail Trail \nFelicity 'Flick' Jones from the Meeniyan Store grows vegies in the garden out the back. Photo: Richard Cornish \nThis is one of the best off-road bike trails in the state, meandering 68 kilometres through the rich dairy country between Leongatha and Welshpool. The Great Southern Rail Trail passes over old bridges, through patches of forest and connects a series of towns and villages that have bakeries and cafes, making the experience a little like Famous Five Go Mad in Dorset. Some casual riders take their time and stay overnight at Meeniyan with its dining options and boutique accommodation. One new facility is Glenleith at Meeniyan, a modern single-room apartment in a new rammed-earth home just 50 metres from the trail (glenleithatmeeniyan.com.au). Bikes can be hired from the Meeniyan Motel (119-129 Whitelaw St, 03 5664 0030).\nFor maps and trail details go to railtrails.org.au . Note: there are still some on-road sections.\n6. Moo's \nThe old weatherboard butcher's shop sits on a corner on the edge of town. It's now a very busy ​cafe, especially on weekends and over summer. Sit down at the cypress tables, made from local farm timber, and have a honey-mustard chicken Turkish toasty or a plate of salt and pepper calamari made with fresh strips of real calamari. Owner and host the ebullient Marty Thomas has a fresh food philosophy that sees chef Trevor Baker and his kitchen team make all food from scratch. On the last Friday night of the month Trevor cooks world food, serving a five-course meal from far-flung cuisines. On Friday, October 30 he'll be serving German classics. Moo's at Meeniyan, 89 Whitelaw Street, Thu-Mon 8.30am-4pm, Fri & Sat 6pm-late, (03) 5664 0010, moosatmeeniyan.com.au. Also consider the excellent pizza at Trulli Woodfire Pizzeria (93 Whitelaw St, Meeniyan, (03) 5664 7397, www.trullipizzeria.com.au) made by Francesco Laera, originally from Puglia in Italy.\nNext Week: Port Melbourne \nRichard Cornish stayed as a guest of Destination Gippsland. \n@Foodcornish \n6reasons@richardcornish.com.au", "external_links": [], "published": "2015-10-16T15:45:00.000+03:00", "crawled": "2015-10-17T03:22:13.099+03:00", "highlightTitle": ""}