{"organizations": ["Pixar", "Disney"], "uuid": "720236c70a02a0ebbe56d3171de1054069523824", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "enewsi.com", "main_image": "", "site_section": "http://enewsi.com/xml-rss2.php", "section_title": "Entertainment News International", "url": "http://enewsi.com/news.php?itemid=29032", "country": "US", "title": "The Good Dinosaur - New Trailer", "performance_score": 0, "site": "enewsi.com", "participants_count": 0, "title_full": "The Good Dinosaur - New Trailer", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T19:50:00.000+03:00", "replies_count": 0, "uuid": "720236c70a02a0ebbe56d3171de1054069523824"}, "author": "", "url": "http://enewsi.com/news.php?itemid=29032", "ord_in_thread": 0, "title": "The Good Dinosaur - New Trailer", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jack Bright", "Frances McDormand", "A.J. Buckley", "Marcus Scribner", "Anna Paquin", "Jeffrey Wright", "Steve Zahn", "Raymond Ochoa", "Sam Elliott", "Arlo"], "text": "The Good Dinosaur - New Trailer   2015.10.07 Disney and Pixar is taking one last bite at the box office this year with their latest 3D adventure film \"The Good Dinosaur,\" which is the first time the studio is releasing two full-length feature films in a single year. Check out a newly-released final trailer for Pixar's sixteenth computer-animated film, a prehistoric buddy comedy that asks, \"what if the asteroid that destroyed the dinosaurs ... missed? Who would walk the Earth?\" The new trailer has some added footage of the bumbling green Apatosaurus named \"Arlo\" (voiced by Raymond Ochoa) and his new little human companion called \"Spot\" (voiced by Jack Bright). Also making an appearance in the new video, are Arlo's parents (voiced by Jeffrey Wright and Frances McDormand) and fellow dinosaurs voiced by Anna Paquin, Sam Elliott, and Steve Zahn. \"The Good Dinosaur\" asks the generations-old question: What if the asteroid that forever changed life on Earth missed the planet completely and giant dinosaurs never became extinct? The film is a humorous and exciting original story about Arlo, a lively Apatosaurus with a big heart. After a traumatic event unsettles Arlos family, he sets out on a remarkable journey, gaining an unlikely companion along the way - a human boy. The Good Dinosaur is an extraordinary journey of self-discovery full of thrilling adventure, hilarious characters and poignant heart. The Good Dinosaur stars the voices of Raymond Ochoa, Jack Bright, Frances McDormand, Anna Paquin, Sam Elliott, Jeffrey Wright, Steve Zahn, Marcus Scribner, A.J. Buckley Release: November 25th, 2015", "external_links": [], "published": "2015-10-07T19:50:00.000+03:00", "crawled": "2015-10-08T10:54:16.618+03:00", "highlightTitle": ""}