{"organizations": [], "uuid": "8cd113318737d707daf032519f63edb2fa0091ab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mid-day.com", "main_image": "http://images.mid-day.com/images/2015/oct/19-Instagram-photos-week-l.jpg", "site_section": "http://www.mid-day.com/Resources/midday/rss/entertainment.xml#", "section_title": "entertainment", "url": "http://www.mid-day.com/articles/top-10-celebrity-instagram-photos-of-the-week-october1218/16618174", "country": "IN", "title": "Top 10 celebrity Instagram photos of the week: October 12-18", "performance_score": 0, "site": "mid-day.com", "participants_count": 1, "title_full": "Top 10 celebrity Instagram photos of the week: October 12-18 - Entertainment", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "8cd113318737d707daf032519f63edb2fa0091ab"}, "author": "A Correspondent", "url": "http://www.mid-day.com/articles/top-10-celebrity-instagram-photos-of-the-week-october1218/16618174", "ord_in_thread": 0, "title": "Top 10 celebrity Instagram photos of the week: October 12-18", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Think you might have missed some pictures that created waves on social media? We have you covered with our weekly round-up of the top 10 photos posted by celebs on Instagram from October 12 to 18\nSalman Khan , who recently revealed his look in 'Sultan', was snapped horseriding at his Panvel farmhouse. Salman's sister Arpita took to Instagram to share photos of the Bollywood superstar.\n  A photo posted by Arpita Khan Sharma (@arpitakhansharma) onOct 16, 2015 at 8:06am PDT\n \n(Haven't seen Salman's 'Sultan' look yet? Check it out here. )\nHot fuzz on hotter men! Apart from their camaraderie on the set, Ranbir Kapoor and Fawad Khan are sporting identical facial fuzz in 'Ae Dil Hai Mushkil'. Fawad, who recently joined the unit in Vienna, has a special role in Karan Johar’s film.\n  A photo posted by Karan Johar (@karanjohar) onOct 15, 2015 at 4:01am PDT\n \n( Find out more about Fawad Khan's role here. ) \nSidharth Malhotra is sure having a gala time in New Zealand. From skydiving to jetboarding, Sidharth is having quite an adventurous journey! And as a fan of 'The Lord Of The Rings' film series, Sidharth was thrilled to receive Frodo Baggins' ring from Oscar-winning legend Richard Taylor, who made significant contribution to the trilogy's costume, make-up and visual effects. Check out Sidharth's 'elf' look from 'LOTR':\n  A photo posted by Sidharth Malhotra (@s1dofficial) onOct 13, 2015 at 3:25pm PDT\n \nShah Rukh Khan , Kajol and the entire cast of the forthcoming film 'Dilwale' were 'served' a sumptous meal of biryani by tennis star Sania Mirza in Hyderabad\n  A photo posted by Sania Mirza (@mirzasaniar) onOct 13, 2015 at 1:18am PDT\n \nWhen Priyanka Chopra flew into Mumbai from Montreal, where she is shooting for American TV show 'Quantico', for her last schedule of 'Bajirao Mastani', she did something special to express her gratitude to the team — a lavish lunch awaited them as soon as the shoot wrapped up\n  A photo posted by Priyanka Chopra (@priyankachopra) onOct 12, 2015 at 4:04am PDT\n \nActress Neha Dhupia , who was in London for the India Fashion Week London 2015, took some time off from her busy schedule to visit the world famous Lord's cricket ground. During her visit to the famous ground, Neha also learned some cricketing tips by reminiscing the moves of cricket legends like W.G. Grace.\n  A photo posted by @nehadhupia onOct 15, 2015 at 12:48am PDT\n \nHugh Jackman , who turned 47 on October 12, shared photos of his birthday celebrations on Instagram. He captioned the photo, \"Man, do you all know how to make a guy feel special. Thank you for all the birthday love!\" \n  A photo posted by Hugh Jackman (@thehughjackman) onOct 12, 2015 at 6:23am PDT\n \nAlso see: 10 throwback photos of Hugh Jackman you should not miss!  \nHollywood actor  Chris Hemsworth  struck a pose with a snake in his backyard for his first post on Instagram. The photograph shows half face of the Australian actor. He is seen glancing at a big snake crawling on the ground of his backyard in the background. He compared his backyard to the Jurassic Park. \"Hangin' with the locals in my backyard... the real Jurassic Park!\" Hemsworth captioned it.\n  A photo posted by Chris Hemsworth (@chrishemsworth) onOct 12, 2015 at 9:59am PDT\n \nBrazilian soccer star Neymar Jr. shared a cute picture of him and his 4-year-old son David Lucca taking a nap together. \n  A photo posted by Nj ðÂÂÂÂÂÂÂÂ§ðÂÂÂÂÂÂÂÂ· (@neymarjr) onOct 15, 2015 at 12:23pm PDT\n \nNeymar Jr  also posted a picture of him and Luis Suarez visiting Barcelona teammate Lionel Messi , who is recovering from an injury, in the hospital. \n  A photo posted by Nj ðÂÂÂÂÂÂÂÂ§ðÂÂÂÂÂÂÂÂ· (@neymarjr) onOct 14, 2015 at 1:57am PDT\n\n\nWhich celebrity's Instagram photo did you like most?", "external_links": [], "published": "2015-10-19T03:00:00.000+03:00", "crawled": "2015-10-19T12:00:08.360+03:00", "highlightTitle": ""}