{"organizations": [], "uuid": "0690ab62d07ec05a761075d39521854e061e4185", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "entertainment.ie", "main_image": "http://images.entertainment.ie/images_content/rectangle/620x372/ArgoDog.gif", "site_section": "http://entertainment.ie/", "section_title": "entertainment.ie : Cinema, TV, Listings, Celebrity Gossip, Photos, Clubbing, Theatre, Reviews, Trailers, Lotto ", "url": "http://entertainment.ie/man-cave/Watch-Argo-the-police-dogs-last-call-will-have-you-in-absolute-bits/371747.htm", "country": "IE", "title": "Man-Cave | Watch: Argo the police dog's 'last call' will have you in absolute bits", "performance_score": 0, "site": "entertainment.ie", "participants_count": 5, "title_full": "Man-Cave | Watch: Argo the police dog's 'last call' will have you in absolute bits - entertainment.ie", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T22:18:00.000+03:00", "replies_count": 4, "uuid": "0690ab62d07ec05a761075d39521854e061e4185"}, "author": "entertainment.ie", "url": "http://entertainment.ie/man-cave/Watch-Argo-the-police-dogs-last-call-will-have-you-in-absolute-bits/371747.htm", "ord_in_thread": 0, "title": "Man-Cave | Watch: Argo the police dog's 'last call' will have you in absolute bits", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "This video genuinely had us in tears, as a decorated member of a local police force takes his final call, before being put to sleep.\nThe below was posted on Hidalgo County Sheriff's Office official Facebook page.\nGood morning friends.\nIt is with a heavy heart that we wish to inform you of the passing of one of our K-9 working dogs, Argo.\nArgo was born on the 13th of March 2006 in the Czech Republic. Argo was a perfect example of his breed, the Czech German Shepherd. After being acquired from Creative Kennels in Turlock, California, he proudly began his training and service with the\nHidalgo County Sheriff's Office in August of 2009 and was partnered with LT Francisco Guerrero. Argo was a Narcotics Detection Dog that certified with the National Narcotics Detector Dog Association on a yearly basis as well as a skilled and relentless Police TrackingDog. Argo was credited with taking thousands of pounds of dangerous drugs off of our streets as well as the apprehension of many dangerous felons.\nArgo was diagnosed with bone cancer, but refused to let it slow him down. Only after the pain became evident to his partner and the cancer was found to be all over his body and terminal, was the hard, painful, but loving decision made to end his suffering. Argo was given a small and private ceremony where he was honored with the traditional Last Call, given to those who pass in the line of duty.\nThe HCSO is aware that a video was taken by a family member and released a few days ago that shows Argo's final moments and his Last Call. We would now like to share it with you, as we have given our K-9 handlers and Argo's family an appropriate time to grieve.\nThank you for your kind words during this time. Argo will be publicly honored at the HCSO First Annual South Texas K9 Competition on November 10, 2015.\nWe forever remain your humble servants.\nWe warn you, this video will make you cry. RIP Argo\nMORE: Watch: This promo for UFC 193 stars Ronda Rousey's little sister and is amazing\nMORE: Watch: Here's that Vine of Jamie Carragher & Thierry Henry reacting to Brendan Rogers' sacking\nMORE: Podcast: SBG and The Ultimate Fighter: McGregor vs Faber coach Owen Roddy joins The Manual", "external_links": ["https://www.facebook.com/hidalgocountysheriffsofficetx?fref=ts", "https://www.youtube.com/embed/2umgf0wianY"], "published": "2015-10-19T22:18:00.000+03:00", "crawled": "2015-10-19T22:05:03.491+03:00", "highlightTitle": ""}