{"organizations": ["Goldeneye", "NINTENDO Nintendo", "Zelda on Wii U", "Nintendo", "NINTENDO"], "uuid": "d66089e838f3e5179750072fb9591429e2d229d7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.express.co.uk", "main_image": "http://cdn.images.express.co.uk/img/dynamic/143/590x/Nintendo-Wii-U-614831.jpg", "site_section": "http://www.express.co.uk/posts/rss/18/entertainment", "section_title": "Daily Express :: Entertainment Feed", "url": "http://www.express.co.uk/entertainment/gaming/614831/Nintendo-Wii-U-Zelda-Goldeneye", "country": "", "title": "Nintendo reveal plans to expand Zelda franchise as Goldeneye 2 request is unearthed", "performance_score": 0, "site": "express.co.uk", "participants_count": 0, "title_full": "Nintendo reveal plans to expand Zelda franchise as Goldeneye 2 request is unearthed", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T22:48:00.000+02:00", "replies_count": 0, "uuid": "d66089e838f3e5179750072fb9591429e2d229d7"}, "author": "", "url": "http://www.express.co.uk/entertainment/gaming/614831/Nintendo-Wii-U-Zelda-Goldeneye", "ord_in_thread": 0, "title": "Nintendo reveal plans to expand Zelda franchise as Goldeneye 2 request is unearthed", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Zelda"], "text": "Nintendo reveal plans to expand Zelda franchise as Goldeneye 2 request is unearthed Nintendo reveal plans to expand Zelda franchise as Goldeneye 2 request is unearthed NINTENDO news this week includes an update on the fate of Zelda on Wii U and how the company wanted to make a follow up to the successful N64 title, Goldeneye. PUBLISHED: 20:48, Mon, Oct 26, 2015 | UPDATED: 21:21, Mon, Oct 26, 2015 NINTENDO Nintendo look to have gone in a different direction for Zelda on Wii U \nNintendo producer Eiji Aonuma has spoken of his plans to build on the fan feedback gathered after the release of Zelda: Skyward Sword, and use it to create a new open-world concept on Wii U. \n“We actually had some feedback from Skyward Sword, where people were saying, 'This is not exactly the Zelda game I was looking for, I was looking for a bigger open world.'\" Aonuma revealed to IGN. \n“Unfortunately, I can’t go into details but I’m hoping to put a surprise, or kind of a twist, on my view of an open world game. I hope that you’ll look forward to it. \n“If we put all the feedback the fans write directly into the game, there won’t be an element of surprise. NINTENDO Fans are still waiting to find out more about the new title for Wii U \n“If there’s a comment and they’re asking for certain element, I would think, 'Oh, why not interpret this in a different way that you wouldn’t expect?' That’s how we create a new element in a Zelda game. \n\"I always want to implement something new and surprising into every game.“ \nZelda on Wii U has been officially delayed by Nintendo, who hope to work on some on several new possibilities for the game, which will now land in 2016. \nIt follows the news that Nintendo reportedly wanted Rare to develop a sequel to iconic N64 shooter, Goldeneye but instead created a spiritual successor, Perfect Dark, for the console. \nMartin Hollis, a member of the Goldeneye design team, revealed Rare's response during a talk at GameCity 2015 in Nottingham. \nThe official reply was: \"We don't plan to make another Bond game from another Bond film,\" according to Hollis, who also revealed Shigeru Miyamoto's feelings on the game's gore and body count. \n\"he felt the game was too tragic, with all the killing,\" Hollis added. \n\"He suggested that it might be nice if, at the end of the game, you got to shake hands with all your enemies in the hospital.\" NINTENDO It was recently revealed that Nintendo were interested in a Goldeneye sequel Most Read Stories in Gaming", "external_links": [], "published": "2015-10-26T22:48:00.000+02:00", "crawled": "2015-10-26T23:38:05.320+02:00", "highlightTitle": ""}