{"organizations": [], "uuid": "3f1c5852fdc15bd3485873692a635e2cbf0fc2a0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266347/arts-entertainment-general", "section_title": "Arts &amp; Entertainment: General - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30312486/practice-makes-perfect-as-10-year-old-stockton-student-comes-third-in-national-language-competition", "country": "US", "title": "Practice makes perfect as 10-year-old Stockton student comes third in national language competition", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Practice makes perfect as 10-year-old Stockton student comes third in national language competition - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T11:11:00.000+03:00", "replies_count": 0, "uuid": "3f1c5852fdc15bd3485873692a635e2cbf0fc2a0"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30312486/practice-makes-perfect-as-10-year-old-stockton-student-comes-third-in-national-language-competition", "ord_in_thread": 0, "title": "Practice makes perfect as 10-year-old Stockton student comes third in national language competition", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Isobel Eason, aged 10, a pupil at Red House School, learnt Portuguese, Mandarin and Arabic to beat over 1,100 language learners and claim third place in the final of the EuroTalk Junior Language Challenge (JLC).\nLondon (PRWEB UK) 21 October 2015\nIn Friday’s final, Isobel fought off fierce competition to finish third behind Tudor Mendel-Idowu, a former runner-up on Channel 4’s Child Genius, who took the title. After reaching the JLC final last year, Isobel was prepared for a tough contest:\n“I knew after the final last year how much work it would take to get into the final round this year,” she said. “I was always trying to beat my highest score, which motivated me to learn more of the language. I couldn’t believe it when I finished third.”\nIsobel’s mum Vickie added, “To see Isobel’s face when she looked at the scoreboard at the end of the final round was an absolute joy. It has amazed me that just a bit of practice everyday has resulted in her being able to speak and understand so many languages.”\nThe Junior Language Challenge is an annual competition for children aged 10 and under running from March to October. It takes place over three rounds, with the children learning a new language for each, using the games in EuroTalk’s online software. This year’s competition saw over 1,100 children representing 60 primary schools across the UK. The top 33 competed in Friday’s final, where prizes were awarded by Child Genius winner Thomas Frith.\nIsobel’s teacher at Red House School, Heidi Garrett, is delighted with her achievement: “Watching the scoreboard in the final round was an intense experience and we were all on the edge of our seats. I’m incredibly proud of Isobel; her hard work, commitment and determination have certainly paid off.”\nBackground:\nFor more details, contact Liz Dyer, EuroTalk Marketing Manager on 0207 371 7711 or liz(at)eurotalk(dot)com.\nEuroTalk is a friendly, fun British-based language learning company with the biggest range of languages to choose from - 150+ of them - across apps and in-store products.\nThe company wants to enable people all over the world, of any age, to start learning to talk in a new language simply and with immediate results. (For more details visit eurotalk.com )\n //www.prweb.com/releases/EuroTalk/JLC/prweb13033775.htm\n ", "external_links": ["http://www.prweb.com/releases/EuroTalk/JLC/prweb13033775.htm", "http://eurotalk.com/jlc"], "published": "2015-10-21T11:11:00.000+03:00", "crawled": "2015-10-21T11:33:04.784+03:00", "highlightTitle": ""}