{"organizations": [], "uuid": "56886a04ed425c46bfc1d96b0b23b617165c25a5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nj.com", "main_image": "http://imgick.nj.com/home/njo-media/width620/img/entertainment_impact/photo/18885922-standard.jpg", "site_section": "http://blog.nj.com/entertainment_impact/rss.xml", "section_title": "Entertainment", "url": "http://www.nj.com/entertainment/index.ssf/2015/10/terror_time_october_brings_out_ghost_stories_at_ea.html", "country": "IL", "title": "Terror Time: October brings out ghost stories of Eastern State | Paranormal Corner", "performance_score": 0, "site": "nj.com", "participants_count": 1, "title_full": "Terror Time: October brings out ghost stories of Eastern State | Paranormal Corner", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T15:07:00.000+03:00", "replies_count": 0, "uuid": "56886a04ed425c46bfc1d96b0b23b617165c25a5"}, "author": "Kelly Roncace | For NJ.com", "url": "http://www.nj.com/entertainment/index.ssf/2015/10/terror_time_october_brings_out_ghost_stories_at_ea.html", "ord_in_thread": 0, "title": "Terror Time: October brings out ghost stories of Eastern State | Paranormal Corner", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments \nAnyone who is a fan of Eastern State Penitentiary's annual epic haunted house, Terror Behind the Walls, knowns that when the calendar turns to October, it's officially Terror Time. \nNow open for it's 25th season, Terror Behind the Walls has revamped the haunt to include two new attractions for the 2015 season — Quarantine 4D and Break Out. \nI got to preview these awesome new additions on Oct. 1 and had a blast. \nWhile I love the riotous revelry of the six, interactive haunted attractions, I can't help but constantly think about the real hauntings that have been reported — and that I have personally experienced — inside those 30-foot walls. \nA couple hours after I left the preview at Eastern State, I went to Toxic Radio studios for the live broadcast of Paradelphia where Terror's Kenny Wittwer joined us on the air. \nWittwer, manager of Terror's Infirmary attraction, has had some strange experiences at work that have nothing to do with costumes and makeup. \nOne night, while acting in the Infirmary, Wittwer experienced something he can not explain. \nHe was in an actor's hallway — a hidden passageway the monsters can use to get from one place to another behind the scenes — and was standing near an old, heavy door with no door knob. \n\"There was a hole in the door where the knob should be so I could see that there was no one on the other side,\" Wittwer said. \nSuddenly, the door swung open, hesitated, then slammed shut again. \n\"It did it two times,\" he said. MORE : Get on the Historic Ghost Tour of Salem County and possibly meet a spirit | Paranormal Corner \nBut that was tame compared to another encounter he had. \n\"I heard laughter,\" he said, explaining he was alone in an area of Eastern State. \"It kept getting louder and louder, and then I saw a shadow on one of the stone walls.\" \nHe said he saw the silhouette of what appeared to be a young girl with pigtails in her hair and puffy sleeves on her dress. \n\"It freaked me out,\" Wittwer said. \nHe quickly left the area. \nRick Prewitt, host of Paradelphia, posed the question of why there would be the spirit of a child in the prison? \nI have personally heard stories of babies being born to inmates in the prison, and some children even lived on the property with their parents who worked as guards there in the facility's early years. \n\"Or maybe it was something demonic,\" Prewitt said. \nIt has been said, in the paranormal field, that demons or demonic spirits sometimes present themselves as children in order to earn a human's trust. \nI have personally had strange experiences in cellblocks 4 and 10 while visiting Eastern State, but one cellblock — which is actually included in Terror Behind the Walls — is one of the most active areas of the prison. \nCellblock 12, where the Ghost Hunters captured a full-bodied apparition during their investigation, is a part of the first attraction in Terror Behind the Walls — Lock Down. \nA few years ago, I was discussing cellblock 12 with a previous manager of Lock Down. \nHe told me he tried putting an actor at the top of the stairs that guests ascend to see level two of cellblock 12, but no one would stay there. \nActors would only last up there alone for a few minutes, he said, and several actors quit after being stationed there. \nI don't know about you, but I would love to sit upstairs in cellblock 12 to see what I could experience during the haunted house inside a real haunted prison. \nKelly Roncace is senior investigator and team leader with Jersey Unique Minds Paranormal Society, a professional paranormal investigation team based in Salem County. Do you know of a haunted location that JUMPS could research and investigate? Contact Kelly at kroncace@njadvancemedia.com and follow her on Twitter @KellyRoncace with your suggestions.", "external_links": [], "published": "2015-10-05T15:07:00.000+03:00", "crawled": "2015-10-05T19:34:59.900+03:00", "highlightTitle": ""}