{"organizations": [], "uuid": "7edbc339349c1f63ececede2837064dc9a9f6550", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nydailynews.com", "main_image": "http://assets.nydailynews.com/polopoly_fs/1.2404168!/img/httpImage/image.jpg_gen/derivatives/landscape_1200/butcher21n-2-web.jpg", "site_section": "http://www.nydailynews.com/news/index.html", "section_title": "Breaking, Local and National News, Sports &amp; Entertainment - NY Daily News", "url": "http://www.nydailynews.com/news/crime/man-sentenced-125-years-life-fatal-stabbings-article-1.2404170", "country": "US", "title": "Man sentenced to 125 years to life for fatal stabbings", "performance_score": 0, "site": "nydailynews.com", "participants_count": 1, "title_full": "Man sentenced to 125 years to life for fatal stabbings - NY Daily News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "7edbc339349c1f63ececede2837064dc9a9f6550"}, "author": "NEW YORK DAILY NEWS", "url": "http://www.nydailynews.com/news/crime/man-sentenced-125-years-life-fatal-stabbings-article-1.2404170", "ord_in_thread": 0, "title": "Man sentenced to 125 years to life for fatal stabbings", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Jesse Ward/for New York Daily News Ming Dong Chen, 27, at State Supreme Court in Brooklyn where Chen was sentenced to life in prison for the murder of his cousin's wife and her four children. Brooklyn, New York, Tuesday October 20, 2015. (Jesse Ward for New York Daily News.) The devastated aunt of four children who were brutally stabbed to death by their demented cousin armed with a meat cleaver will never understand why they were killed.\n\"Why? I don't know why, I don't understand why?\" asked a hysterical Hong Jin Zhuo to Ming Dong Chen in Brooklyn Supreme Court on Tuesday.\nChen, 27, was sentenced to 125 years to life in prison for killing his cousin-in-law Qiao Zhen-Li, 37, and her four children, Amy Zhuo, 7; Linda Zhuo, 9; Kevin Zhuo, 5; and William Zhuo, 1, on October 27, 2013.\n\"These past two years have been miserable. Our family treated you well. Can we do that your honor? Ask him why?\" Hong Jin asked Brooklyn Supreme Court Justice Vincent Del Guidice through a Mandarin-speaking prosecutor.\nChen immigrated from China and was living with his cousin, Yi Lin Zhuo, and his family's inside their Sunset Park home for two weeks before the tragedy.\nJesse Ward/for New York Daily News Hong Jin Zhuo, sister of Yilin Zhuo, whose wife and four children were murdered by his cousin Ming Dong Chen, (not pictured here) gives her victim impact statement at State Supreme Court in Brooklyn where Chen was sentenced to life in prison. Brooklyn, New York, Tuesday October 20, 2015. (Jesse Ward for New York Daily News.) The cold-hearted murderer declined to give an explanation or offer an apology.\n\"It is with earnest hope and desire of the court that you'll never be free and remain in a cage in upstate New York for the rest of your life,\" said Del Guidice.\n\"I want him to die in his cell,\" said the children's father, Yi Lin, in Mandarin to reporters outside the courthouse.\nHong Jin and Yi Lin said they will visit their deceased loved ones at their resting place in a New Jersey cemetery on the two-year anniversary to deliver the news that justice was served.", "external_links": [], "published": "2015-10-20T03:00:00.000+03:00", "crawled": "2015-10-20T20:18:59.739+03:00", "highlightTitle": ""}