{"organizations": [], "uuid": "30eb3570c938974495c5d99e4533aad803f6e6b3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.heraldscotland.com", "main_image": "http://www.heraldscotland.com/resources/images/4356100/", "site_section": "http://www.heraldscotland.com/arts_ents/", "section_title": "Arts and Entertainment | Herald Scotland", "url": "http://www.heraldscotland.com/arts_ents/13887201.DVD_reviews/", "country": "GB", "title": "DVD reviews", "performance_score": 0, "site": "heraldscotland.com", "participants_count": 1, "title_full": "DVD reviews (From Herald Scotland)", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T07:08:00.000+03:00", "replies_count": 0, "uuid": "30eb3570c938974495c5d99e4533aad803f6e6b3"}, "author": "Barry Didcock", "url": "http://www.heraldscotland.com/arts_ents/13887201.DVD_reviews/", "ord_in_thread": 0, "title": "DVD reviews", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Pasolini (18)\nBFI, £19.99\nPasolini: Six Films 1968-1975 (18)\nBFI, £69.99\nNext month marks the 40th anniversary of the death of Italian film director Pier Paolo Pasolini, who was found murdered on a beach near Rome on November 2 1975. A 17-year-old rent boy was jailed for the killing though there are other theories involving (variously) a Mafia hit and an extortion plan gone wrong. Pasolini was 53 and had just finished making Salo, his most controversial work.\nAbel Ferrara's film follows Pasolini over his last 24 hours and features an appearance by Ninetto Davoli, Pasolini's one-time lover and star of six of his films. Playing the director himself is Willem Dafoe, in a role he was born for: the resemblance is uncanny.\nIn terms of Pasolini's demise, Ferrara goes down the gay bashing route though the who and the how don't concern him overly much. Instead, he uses Pasolini's last day as a way to present a series of stories-within-stories, nod to some of the Italian's greatest works (hardcore fans will enjoy playing spot the allusion) and introduce some of the people around him such as his mother and friends like actress Laura Betti, played here with gusto by the wonderful Maria de Medeiros. Where has she been since Pulp Fiction?\nPromoted stories In an extended sequence, Ferrara also gives us a flavour of what would have been Pasolini's next film after Salo. It features Davoli as veteran Italian actor Eduardo de Filippo and Riccardo Scamarcio (soon to be seen in BBC 2 espionage drama London Spy) as Davoli. Think Waiting For Godot-meets-Pasolini's own Hawks And Sparrows.\nAs a companion piece of sorts, the BFI is releasing a six-film box set featuring films made towards the end of the Italian's career. It's in-at-the-deep-end collection - easy-going early films like Accattone and Mamma Roma are missing - and contains his trilogy of adaptations of classic texts from world literature: The Decameron, The Canterbury Tales and The Arabian Nights. Medea is notable for the powerful presence of opera singer Maria Callas in a lead role but the highlights are Theorem, starring Terence Stamp, and the unmissable (and still ultra-controversial) Salo, which is a little tamer and a lot more intellectually rigorous than its reputation suggests.\nThe Skull (15)\nEureka!, £15.95\nThe “Hammer Horror” dream team of Peter Cushing and Christopher Lee star in this 1965 curio from Hammer's rival studio Amicus, an adaptation of a (very) short story by Psycho writer Robert Bloch. Cushing plays Dr Christopher Maitland, a collector of occult objects who is offered the skull of the Marquis de Sade. Thanks to an opening scene set a century earlier, the viewer knows that whoever possess the skull is liable to do very bad things, something Maitland's friend Sir Matthew Phillips (Lee) tries to warn him about. And so it comes to pass.\nExtras include an interview with film critic and horror expert Kim Newman, who contextualises the film well but wisely decides not to make any grander claims for it of the misunderstood cult classic sort. That said, it's worth watching for one immensely weird and powerful set-piece scene, a dream sequence drafted by writer (and Amicus co-founder) Milton Subotsky to replace Bloch's original, sexually-charged S&M version. In his censor-friendly scene Maitland is dragged into the presence of a wigged judge by two spooky-looking policemen and then forced to play three rounds of Russian roulette. It's entirely wordless except for the maniacal cackling of the judge when the fourth chamber fires a bullet.\nThe Skull is notable, too, for its score, written by avant-garde composer Elisabeth Lutyens. The daughter of eminent architect Sir Edwin Lutyens, she was a disciple of Arnold Schoenberg and only turned to scoring horror films when work on the classical scene dried up. Nonetheless she was the first British woman to score any film and her music for this one has been released as a CD in its own right.\nHowl (18)\nMetrodome, £14.99\nShare article This straight-to-DVD British horror turns on a neat conceit – it plays on our obsession with and dread of commuting and public transport – but never quite lives up to its promise, despite an impressive cast lead by Scottish actress Shauna Macdonald (Spooks, Filth, The Descent) and Ed Speleers (Jimmy Kent in Downton Abbey and soon to be seen in ITV's blockbuster fantasy drama Beowulf).\nSpeleers plays Joe, guard on a late-night train out of Waterloo which breaks down in a forest and then comes under attack from werewolves. Barring an ill-starred foray back along the railway line, all the action takes place in gloomy train carriages lit by flickering lights, so there's no faulting the set design. Director Paul Hyett provides a couple of decent plot feints too, as well as a potent hate figure in the form of a philandering City banker. But the tension never gets ratcheted up high enough to make Howl really sing. Oh, and there's a blink-and-you-miss-him cameo from Sean Pertwee, as the train driver who goes out with a torch and doesn't come back. Dig out Pertwee's 2002 film Dog Soldiers if you want an impressively-done British werewolf flick.", "external_links": ["https://twitter.com/share?url=", "https://www.facebook.com/sharer/sharer.php?u="], "published": "2015-10-22T07:08:00.000+03:00", "crawled": "2015-10-22T03:13:22.992+03:00", "highlightTitle": ""}