{"organizations": [], "uuid": "ef915548e228e710d93a102121bcf3c35bf6683d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stalbansreview.co.uk", "main_image": "http://www.stalbansreview.co.uk/resources/images/4359169/", "site_section": "http://www.stalbansreview.co.uk/uk_national_entertainment/rss/", "section_title": "St Albans & Harpenden Review | National Entertainment News", "url": "http://www.stalbansreview.co.uk/uk_national_entertainment/13890194.Spectre_star_Christoph_Waltz_reveals_friendship_with_Daniel_Craig/?ref=rss", "country": "GB", "title": "Spectre star Christoph Waltz reveals friendship with Daniel Craig", "performance_score": 0, "site": "stalbansreview.co.uk", "participants_count": 0, "title_full": "Spectre star Christoph Waltz reveals friendship with Daniel Craig", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T18:45:00.000+03:00", "replies_count": 0, "uuid": "ef915548e228e710d93a102121bcf3c35bf6683d"}, "author": "", "url": "http://www.stalbansreview.co.uk/uk_national_entertainment/13890194.Spectre_star_Christoph_Waltz_reveals_friendship_with_Daniel_Craig/?ref=rss", "ord_in_thread": 0, "title": "Spectre star Christoph Waltz reveals friendship with Daniel Craig", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Daniel Craig", "Christoph Waltz", "Daniel Craig Spectre"], "text": "Spectre star Christoph Waltz reveals friendship with Daniel Craig Spectre star Christoph Waltz reveals friendship with Daniel Craig \nPress Association 2014 / / National Entertainment News Share \nOscar-winning actor Christoph Waltz has revealed how he and Daniel Craig have cemented a strong friendship, after starring together in the latest James Bond adventure. \nThe Austrian-born star portrays 007′s nemesis Franz Oberhauser in Spectre, in which Daniel has reprised his role as the MI6 agent for the fourth time. \nChristoph said his co-star knows how to keep him on his toes: “I knew him a little but not very well at all. But I knew what a lovely man he is. (Ian West/PA) \n“We started working and discussing and rehearsing long before we started shooting, and that’s when I got to know him as an extremely smart person. \n“I like that too because he doesn’t let you get away with anything, and I don’t let him get away with anything, and that’s actually the basis of a friendship.” \nChristoph admitted he had doubts before signing on for the part of Franz, saying: “There’s a reaction, where you think, ‘Bond, that’s fantastic’ but then there’s also the question about what is the part. \n“I know it’s the baddie, but what constitutes in detail this very specific part? That’s my usual hesitation – I never jump at anything. I usually hesitate, look at it and find out what it is in detail.” Promoted stories (Anthony Devlin/PA) \nThe 59-year-old actor, who won Academy Awards for his performances in Quentin Tarantino’s films Inglourious Basterds and Django Unchained, said his favourite Bond villain is Gert Frobe as Auric Goldfinger in the 1964 movie, Goldfinger. \n“I always like him because I grew up in Austria and I saw these German movies from the 50s and 60s, and I always liked him huffing and puffing. It’s very specific, original and very special,” he explained. \nChristoph also spoke about the possibility of Daniel’s successor, and how each different actor brings something new to the character. \nHe said: “There are actors who can play a Bond but you have to know first what Bond and what kind of Bond. When Daniel started, it turned into a different person and that’s how it should be. It’s very much defined by the actor who plays it. \n“Daniel wasn’t cast as Bond and then they tried to figure out what to do with him – they had an idea and then they tried to find an actor. So let’s see what the next Bond requires and find the ideal person.” Share article \nSpectre, directed by Sam Mendes, opens in UK cinemas on Monday October 26. Promoted Stories", "external_links": [], "published": "2015-10-22T18:45:00.000+03:00", "crawled": "2015-10-22T23:10:48.671+03:00", "highlightTitle": ""}