{"organizations": [], "uuid": "ccf2e99a91c703a54a5b4daf9cb03040ddb932c0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/49257371.cms", "site_section": "http://timesofindia.indiatimes.com/entertainment/tamil/music/articlelist/27288885.cms", "section_title": "Music - Tamil - Entertainment - The Times of India", "url": "http://timesofindia.indiatimes.com/entertainment/tamil/music/Why-This-Kolaveri-Di-becomes-the-highest-viewed-Indian-video-on-YouTube/articleshow/49257362.cms", "country": "IL", "title": "Why This Kolaveri Di becomes the highest viewed Indian video on YouTube", "performance_score": 0, "site": "indiatimes.com", "participants_count": 1, "title_full": "Why This Kolaveri Di becomes the highest viewed Indian video on YouTube - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "ccf2e99a91c703a54a5b4daf9cb03040ddb932c0"}, "author": "M Suganth", "url": "http://timesofindia.indiatimes.com/entertainment/tamil/music/Why-This-Kolaveri-Di-becomes-the-highest-viewed-Indian-video-on-YouTube/articleshow/49257362.cms", "ord_in_thread": 0, "title": "Why This Kolaveri Di becomes the highest viewed Indian video on YouTube", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Four years after it became a viral sensation, Why This Kolaveri Di has become the highest viewed Indian video on YouTube. The song, composed by Anirudh and sung by Dhanush for Aishwaryaa Dhanush's Tamil film 3, is all set to hit 100 million views in the coming days. Sridhar Subramaniam, the president of the music label that released the song, informs that the views for the user generated content for the song (by way of cover versions, flash mobs, parodies, etc) is around 500 million. \"This was the first song that truly showed the power of online media to Indians. And it launched the career of Anirudh and made Dhanush a nationwide sensation,\" he says.\nTalking about the song's journey from being a single to a pop cultural phenomenon, he says, \"Once we realized that the song was getting huge attraction from Tamil movie fans, we shared it with social media influencers in Mumbai and also made sure that it was picked by traditional media like radio and TV as well. In the first three days, it hit 10 million views and after that the song took a life of its own as it and was embraced nationally and internationally.\" He adds that the song still pulls in around one lakh views a day.\nHe says that the label deliberately adopted a non-restrictive copyright policy \"to harness the power of the crowd\". \"After seeing that it had captured people's imagination, we chose not to pull down content based on the song citing copyright infringement. It had become a song of the people,\" he explains.\nWhile he admits that online video sharing platforms have become great promo vehicles, he reveals that the monetary benefits are minuscule compared to what one generates through traditional media.", "external_links": [], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-13T11:22:05.099+03:00", "highlightTitle": ""}