{"organizations": ["FBI", "Black Pearl"], "uuid": "fcd6ce489d62ee83220660715050c85c2dc74010", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wwnytv.com", "main_image": "http://media.wwnytv.com/images/Black+Mass+poster.jpg", "site_section": "http://wwnytv.com//features/craigs-to-do-list/index.rss2", "section_title": "WWNY - Entertainment - Craig's To Do List", "url": "http://www.wwnytv.com/features/craigs-to-do-list/Black-Mass---Movie-Review--330331491.html", "country": "US", "title": "Black Mass - Movie Review", "performance_score": 0, "site": "wwnytv.com", "participants_count": 0, "title_full": "Black Mass - Movie Review", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T02:55:00.000+03:00", "replies_count": 0, "uuid": "fcd6ce489d62ee83220660715050c85c2dc74010"}, "author": "", "url": "http://www.wwnytv.com/features/craigs-to-do-list/Black-Mass---Movie-Review--330331491.html", "ord_in_thread": 0, "title": "Black Mass - Movie Review", "locations": ["Grey", "Boston", "Hollywood"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Scott Cooper", "John Connolly", "Joel Edgerton", "Depp", "Billy Bulger", "Johnny Depp", "Whitey", "Brit Benedict Cumberbatch", "Dakota Johnson", "Whitey Bulger", "Bulger", "Sweeney", "Connolly"], "text": "Story Published: Oct 1, 2015 at 6:37 PM EDT Story Updated: Oct 1, 2015 at 7:55 PM EDT Johnny Depp courts the Oscar again with his performance as Whitey Bulger in Black Mass . He was previously nominated for: Pirates of the Caribbean: The Curse of the Black Pearl (2003), Finding Neverland (2004) and Sweeney Todd: The Demon Barber of Fleet Street (2007.) Admittedly Depp is unrecognizable as the notorious Irish Mob Boss, who ruthlessly killed people with shocking random and ease. Ghoulishly pale, wearing blue contact lenses with greased back receding blond hair, Depp who is considered one of Hollywood’s sexiest actors, is so uncharacteristically homely, movie viewers are clamoring for a fourth Oscar nomination. Depp is very good, but how much of his transformation is simply cosmetic? His performance often feels one note. However, not all the blame is on him, Bulger seems hopelessly underwritten. There are attempts to humanize him, especially when he must face loss in his personal life, but too often Bulger comes across as a sociopathic, brutal criminal who has no remorse. This could be the point, but even evil becomes monotonous after a while. Black Mass is never boring. There is tension and audience involvement throughout the film, even when it feels episodic and covers long periods of time. The violence is pervasive, but it isn’t gratuitous. Director Scott Cooper is deft at presenting its brutality as to shine a light on just how nasty the real Bulger was during his crime spree. I also liked the sense of location (Boston) and the expert production design that feels authentic without being pretentious or flashy. It’s fun to see the accurate props and set pieces that were part of everyone’s houses in the 1970’s. The supporting performances are all strong, including Dakota Johnson ( Fifty Shades of Grey ) in an uncharacteristic role and Brit Benedict Cumberbatch ( The Imitation Game ) as Bulger’s Boston Irish brother. So here is the bad news. Black Mass , despite all these good things, isn’t very satisfying. The ending is abrupt and anticlimactic. Actually, there is no real climax and this is frustrating because of the tension that precedes the ending. The screenplay, at times, feels unfocused. Bulger’s involvement as an informant to the FBI and his collusion with his boyhood buddie John Connolly (Joel Edgerton) who is now an agent, is a major element of the plot. This is interesting, especially because it is fact, but Connolly and Bulger’s relationship lacks details and complexity. The film misses opportunities for nuance and specifics, often when it comes to the most intriguing true life events. When Bulger and his colleagues win the $14 million dollar state lottery, it is implied that there was foul play, but the implication is so brief it makes the reference to the lottery win moot. How did Whitey pull this off? I haven’t a clue after seeing this. Such a unique crime deserves attention. Truth is often stranger than fiction, but here in this film, the strange truth is often generic and glossed over. This includes the irony of one of Boston’s biggest criminals being brother to one of Boston’s biggest politicians, State Senator Billy Bulger (Cumberbatch). Why did it take so long to catch Whitey as a refugee? Whitey Bulger’s life of murder and mayhem is dark and riveting and an important period in American organized crime history, but as chronicled here, it feels like just another crime film that is well executed but not particularly resonant.", "external_links": [], "published": "2015-10-02T02:55:00.000+03:00", "crawled": "2015-10-03T08:06:09.755+03:00", "highlightTitle": ""}