{"organizations": [], "uuid": "edc309008cde524b03913c8ea1595be6c94cbb6c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mysanantonio.com", "main_image": "http://ww1.hdnux.com/photos/41/34/75/8769372/3/rawImage.jpg", "site_section": "http://www.mysanantonio.com/rss/feed/mySA-Entertainment-923.php", "section_title": "mySA Entertainment", "url": "http://www.mysanantonio.com/entertainment/article/Popular-N-St-Mary-s-Street-bar-is-being-sold-6563377.php", "country": "US", "title": "Popular N. St. Mary’s Street bar is being sold, but the party continues - San Antonio Express-News", "performance_score": 0, "site": "mysanantonio.com", "participants_count": 1, "title_full": "Popular N. St. Mary’s Street bar is being sold, but the party continues - San Antonio Express-News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T19:39:00.000+03:00", "replies_count": 0, "uuid": "edc309008cde524b03913c8ea1595be6c94cbb6c"}, "author": "Hector Saldana", "url": "http://www.mysanantonio.com/entertainment/article/Popular-N-St-Mary-s-Street-bar-is-being-sold-6563377.php", "ord_in_thread": 0, "title": "Popular N. St. Mary’s Street bar is being sold, but the party continues - San Antonio Express-News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photo: By Ryan Humphries, For MySA.com Image 1 of / 39 Caption\nClose\nImage 1 of 39 It’s been a N. St. Mary’s Street mainstay for decades, serving live music and cold cocktails to partiers. Now The Mix will be under new ownership, but the party is sure to continue.\nBuy this photo Photo: By Ryan Humphries, For MySA.com It’s been a N. St. Mary’s Street mainstay for decades, serving... Image 2 of 39 It’s been a N. St. Mary’s Street mainstay for decades, serving live music and cold cocktails to partiers. Now The Mix will be under new ownership, but the party is sure to continue.\nBuy this photo Photo: By Ryan Humphries, For MySA.com It’s been a N. St. Mary’s Street mainstay for decades, serving... Image 3 of 39 It’s been a N. St. Mary’s Street mainstay for decades, serving live music and cold cocktails to partiers. Now The Mix will be under new ownership, but the party is sure to continue.\nBuy this photo Photo: By Ryan Humphries, For MySA.com It’s been a N. St. Mary’s Street mainstay for decades, serving... Image 4 of 39 It’s been a N. St. Mary’s Street mainstay for decades, serving live music and cold cocktails to partiers. Now The Mix will be under new ownership, but the party is sure to continue.\nBuy this photo Photo: By Ryan Humphries, For MySA.com It’s been a N. St. Mary’s Street mainstay for decades, serving... Image 5 of 39 It’s been a N. St. Mary’s Street mainstay for decades, serving live music and cold cocktails to partiers. Now The Mix will be under new ownership, but the party is sure to continue.\nBuy this photo Photo: By Ryan Humphries, For MySA.com It’s been a N. St. Mary’s Street mainstay for decades, serving... Image 6 of 39 It’s been a N. St. Mary’s Street mainstay for decades, serving live music and cold cocktails to partiers. Now The Mix will be under new ownership, but the party is sure to continue.\nBuy this photo Photo: By Ryan Humphries, For MySA.com It’s been a N. St. Mary’s Street mainstay for decades, serving... Image 7 of 39 It’s been a N. St. Mary’s Street mainstay for decades, serving live music and cold cocktails to partiers. Now The Mix will be under new ownership, but the party is sure to continue.\nBuy this photo Photo: By Ryan Humphries, For MySA.com It’s been a N. St. Mary’s Street mainstay for decades, serving... Image 8 of 39 It’s been a N. St. Mary’s Street mainstay for decades, serving live music and cold cocktails to partiers. Now The Mix will be under new ownership, but the party is sure to continue.\nBuy this photo Photo: By Ryan Humphries, For MySA.com It’s been a N. St. Mary’s Street mainstay for decades, serving... Image 9 of 39 It’s been a N. St. Mary’s Street mainstay for decades, serving live music and cold cocktails to partiers. Now The Mix will be under new ownership, but the party is sure to continue.\nBuy this photo Photo: By Ryan Humphries, For MySA.com It’s been a N. St. Mary’s Street mainstay for decades, serving... Image 10 of 39 It’s been a N. St. Mary’s Street mainstay for decades, serving live music and cold cocktails to partiers. Now The Mix will be under new ownership, but the party is sure to continue.\nBuy this photo Photo: By Ryan Humphries, For MySA.com It’s been a N. St. Mary’s Street mainstay for decades, serving... Image 11 of 39 It’s been a N. St. Mary’s Street mainstay for decades, serving live music and cold cocktails to partiers. Now The Mix will be under new ownership, but the party is sure to continue.\nBuy this photo Photo: By Ryan Humphries, For MySA.com It’s been a N. St. Mary’s Street mainstay for decades, serving... Image 12 of 39 It’s been a N. St. Mary’s Street mainstay for decades, serving live music and cold cocktails to partiers. Now The Mix will be under new ownership, but the party is sure to continue.\nBuy this photo Photo: By Ryan Humphries, For MySA.com It’s been a N. St. Mary’s Street mainstay for decades, serving... Image 13 of 39 It’s been a N. St. Mary’s Street mainstay for decades, serving live music and cold cocktails to partiers. Now The Mix will be under new ownership, but the party is sure to continue.\nBuy this photo Photo: By Ryan Humphries, For MySA.com It’s been a N. St. Mary’s Street mainstay for decades, serving... Image 14 of 39 It’s been a N. St. Mary’s Street mainstay for decades, serving live music and cold cocktails to partiers. Now The Mix will be under new ownership, but the party is sure to continue.\nBuy this photo Photo: By Ryan Humphries, For MySA.com It’s been a N. St. Mary’s Street mainstay for decades, serving... Image 15 of 39 It’s been a N. St. Mary’s Street mainstay for decades, serving live music and cold cocktails to partiers. Now The Mix will be under new ownership, but the party is sure to continue.\nBuy this photo Photo: By Ryan Humphries, For MySA.com It’s been a N. St. Mary’s Street mainstay for decades, serving... Image 16 of 39 It’s been a N. St. Mary’s Street mainstay for decades, serving live music and cold cocktails to partiers. Now The Mix will be under new ownership, but the party is sure to continue.\nBuy this photo Photo: By Ryan Humphries, For MySA.com It’s been a N. St. Mary’s Street mainstay for decades, serving... Image 17 of 39 It’s been a N. St. Mary’s Street mainstay for decades, serving live music and cold cocktails to partiers. Now The Mix will be under new ownership, but the party is sure to continue.\nBuy this photo Photo: By Ryan Humphries, For MySA.com It’s been a N. St. Mary’s Street mainstay for decades, serving... Image 18 of 39 It’s been a N. St. Mary’s Street mainstay for decades, serving live music and cold cocktails to partiers. Now The Mix will be under new ownership, but the party is sure to continue.\nBuy this photo Photo: By Ryan Humphries, For MySA.com It’s been a N. St. Mary’s Street mainstay for decades, serving... Image 19 of 39 It’s been a N. St. Mary’s Street mainstay for decades, serving live music and cold cocktails to partiers. Now The Mix will be under new ownership, but the party is sure to continue.\nBuy this photo Photo: By Ryan Humphries, For MySA.com It’s been a N. St. Mary’s Street mainstay for decades, serving... Image 20 of 39 It’s been a N. St. Mary’s Street mainstay for decades, serving live music and cold cocktails to partiers. Now The Mix will be under new ownership, but the party is sure to continue.\nBuy this photo Photo: By Ryan Humphries, For MySA.com It’s been a N. St. Mary’s Street mainstay for decades, serving... Image 21 of 39 It’s been a N. St. Mary’s Street mainstay for decades, serving live music and cold cocktails to partiers. Now The Mix will be under new ownership, but the party is sure to continue.\nBuy this photo Photo: By Ryan Humphries, For MySA.com It’s been a N. St. Mary’s Street mainstay for decades, serving... Image 22 of 39 It’s been a N. St. Mary’s Street mainstay for decades, serving live music and cold cocktails to partiers. Now The Mix will be under new ownership, but the party is sure to continue.\nBuy this photo Photo: By Ryan Humphries, For MySA.com It’s been a N. St. Mary’s Street mainstay for decades, serving... Image 23 of 39 It’s been a N. St. Mary’s Street mainstay for decades, serving live music and cold cocktails to partiers. Now The Mix will be under new ownership, but the party is sure to continue.\nBuy this photo Photo: By Ryan Humphries, For MySA.com It’s been a N. St. Mary’s Street mainstay for decades, serving... Image 24 of 39 It’s been a N. St. Mary’s Street mainstay for decades, serving live music and cold cocktails to partiers. Now The Mix will be under new ownership, but the party is sure to continue.\nBuy this photo Photo: By Ryan Humphries, For MySA.com It’s been a N. St. Mary’s Street mainstay for decades, serving... Image 25 of 39 It’s been a N. St. Mary’s Street mainstay for decades, serving live music and cold cocktails to partiers. Now The Mix will be under new ownership, but the party is sure to continue.\nBuy this photo Photo: By Ryan Humphries, For MySA.com It’s been a N. St. Mary’s Street mainstay for decades, serving... Image 26 of 39 It’s been a N. St. Mary’s Street mainstay for decades, serving live music and cold cocktails to partiers. Now The Mix will be under new ownership, but the party is sure to continue.\nBuy this photo Photo: By Ryan Humphries, For MySA.com It’s been a N. St. Mary’s Street mainstay for decades, serving... Image 27 of 39 It’s been a N. St. Mary’s Street mainstay for decades, serving live music and cold cocktails to partiers. Now The Mix will be under new ownership, but the party is sure to continue.\nBuy this photo Photo: By Ryan Humphries, For MySA.com It’s been a N. St. Mary’s Street mainstay for decades, serving... Image 28 of 39 It’s been a N. St. Mary’s Street mainstay for decades, serving live music and cold cocktails to partiers. Now The Mix will be under new ownership, but the party is sure to continue.\nBuy this photo Photo: By Ryan Humphries, For MySA.com It’s been a N. St. Mary’s Street mainstay for decades, serving... Image 29 of 39 It’s been a N. St. Mary’s Street mainstay for decades, serving live music and cold cocktails to partiers. Now The Mix will be under new ownership, but the party is sure to continue.\nBuy this photo Photo: By Ryan Humphries, For MySA.com It’s been a N. St. Mary’s Street mainstay for decades, serving... Image 30 of 39 It’s been a N. St. Mary’s Street mainstay for decades, serving live music and cold cocktails to partiers. Now The Mix will be under new ownership, but the party is sure to continue.\nBuy this photo Photo: By Ryan Humphries, For MySA.com It’s been a N. St. Mary’s Street mainstay for decades, serving... Image 31 of 39 It’s been a N. St. Mary’s Street mainstay for decades, serving live music and cold cocktails to partiers. Now The Mix will be under new ownership, but the party is sure to continue.\nBuy this photo Photo: By Ryan Humphries, For MySA.com It’s been a N. St. Mary’s Street mainstay for decades, serving... Image 32 of 39 It’s been a N. St. Mary’s Street mainstay for decades, serving live music and cold cocktails to partiers. Now The Mix will be under new ownership, but the party is sure to continue.\nBuy this photo Photo: By Ryan Humphries, For MySA.com It’s been a N. St. Mary’s Street mainstay for decades, serving... Image 33 of 39 It’s been a N. St. Mary’s Street mainstay for decades, serving live music and cold cocktails to partiers. Now The Mix will be under new ownership, but the party is sure to continue.\nBuy this photo Photo: By Ryan Humphries, For MySA.com It’s been a N. St. Mary’s Street mainstay for decades, serving... Image 34 of 39 It’s been a N. St. Mary’s Street mainstay for decades, serving live music and cold cocktails to partiers. Now The Mix will be under new ownership, but the party is sure to continue.\nBuy this photo Photo: By Ryan Humphries, For MySA.com It’s been a N. St. Mary’s Street mainstay for decades, serving... Image 35 of 39 It’s been a N. St. Mary’s Street mainstay for decades, serving live music and cold cocktails to partiers. Now The Mix will be under new ownership, but the party is sure to continue.\nBuy this photo Photo: By Ryan Humphries, For MySA.com It’s been a N. St. Mary’s Street mainstay for decades, serving... Image 36 of 39 It’s been a N. St. Mary’s Street mainstay for decades, serving live music and cold cocktails to partiers. Now The Mix will be under new ownership, but the party is sure to continue.\nBuy this photo Photo: By Ryan Humphries, For MySA.com It’s been a N. St. Mary’s Street mainstay for decades, serving... Image 37 of 39 It’s been a N. St. Mary’s Street mainstay for decades, serving live music and cold cocktails to partiers. Now The Mix will be under new ownership, but the party is sure to continue.\nBuy this photo Photo: By Ryan Humphries, For MySA.com It’s been a N. St. Mary’s Street mainstay for decades, serving... Image 38 of 39 It’s been a N. St. Mary’s Street mainstay for decades, serving live music and cold cocktails to partiers. Now The Mix will be under new ownership, but the party is sure to continue.\nBuy this photo Photo: By Ryan Humphries, For MySA.com It’s been a N. St. Mary’s Street mainstay for decades, serving... Image 39 of 39 Popular N. St. Mary’s Street bar is being sold, but the party continues 1 / 39 Back to Gallery The Mix has been sold. New owners Eric Hanken (Bauhaus Media Group), Steve Mahoney (Blue Box, Brigid) and attorney Blayne Tucker (Maverick Music Festival) take over the beloved St. Mary's Strip dive bar from Danny Clift on Oct. 16.\nClift, a fixture for 18 years, goes out with a bang with a farewell party Thursday with the Cutthroats, No Gods and guest deejays. But first, there's late-night ska from Lost Project on Friday and an ear-blowing Saturday lineup of Yoshimoto, Maneaters of Tsavo and Smear Cake Face.\nMajor changes are coming, but the Mix is expected to remain the same for now. 10 p.m. Friday-Saturday and Thursday, The Mix, 2423 N. St. Mary's St. No cover; themix-sa.com", "external_links": ["http://mysa.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20San%20Antonio%20Express-News&image=http://ww1.hdnux.com/photos/41/34/75/8769364/3/628x471.jpg", "http://mysa.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20San%20Antonio%20Express-News&image=http://ww2.hdnux.com/photos/41/34/75/8769385/3/628x471.jpg", "http://ww2.hdnux.com/photos/41/34/75/8769373/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/41/34/75/8769369/3/square_gallery_thumb.jpg", "http://mysa.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20San%20Antonio%20Express-News&image=http://ww3.hdnux.com/photos/41/34/75/8769366/3/628x471.jpg", "http://ww3.hdnux.com/photos/41/34/75/8769382/3/920x920.jpg", "http://ww3.hdnux.com/photos/41/34/75/8769370/3/square_gallery_thumb.jpg", "http://mysa.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20San%20Antonio%20Express-News&image=http://ww1.hdnux.com/photos/41/34/75/8769360/3/628x471.jpg", "http://ww3.hdnux.com/photos/41/34/75/8769362/3/920x920.jpg", "http://mysa.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20San%20Antonio%20Express-News&image=http://ww3.hdnux.com/photos/41/34/75/8769374/3/628x471.jpg", "http://mysa.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20San%20Antonio%20Express-News&image=http://ww2.hdnux.com/photos/41/34/75/8769365/3/628x471.jpg", "http://ww2.hdnux.com/photos/41/34/75/8769389/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/41/34/75/8769377/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/41/34/75/8769374/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/41/34/75/8769394/3/920x920.jpg", "http://mysa.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20San%20Antonio%20Express-News&image=http://ww3.hdnux.com/photos/41/34/75/8769362/3/628x471.jpg", "http://mysa.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20San%20Antonio%20Express-News&image=http://ww2.hdnux.com/photos/41/34/75/8769389/3/628x471.jpg", "http://mysa.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20San%20Antonio%20Express-News&image=http://ww4.hdnux.com/photos/41/34/75/8769387/3/628x471.jpg", "http://mysa.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20San%20Antonio%20Express-News&image=http://ww3.hdnux.com/photos/41/34/75/8769370/3/628x471.jpg", "http://ww1.hdnux.com/photos/41/34/75/8769392/3/920x920.jpg", "http://mysa.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20San%20Antonio%20Express-News&image=http://ww2.hdnux.com/photos/41/34/75/8769393/3/628x471.jpg", "http://ww1.hdnux.com/photos/41/34/75/8769372/3/920x920.jpg", "http://ww1.hdnux.com/photos/41/34/75/8769376/3/920x920.jpg", "http://ww4.hdnux.com/photos/41/34/75/8769383/3/920x920.jpg", "http://mysa.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20San%20Antonio%20Express-News&image=http://ww3.hdnux.com/photos/41/34/75/8769386/3/628x471.jpg", "http://mysa.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20San%20Antonio%20Express-News&image=http://ww2.hdnux.com/photos/41/34/75/8769369/3/628x471.jpg", "http://mysa.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20San%20Antonio%20Express-News&image=http://ww4.hdnux.com/photos/41/34/75/8769371/3/628x471.jpg", "http://ww1.hdnux.com/photos/41/34/75/8769384/3/920x920.jpg", "http://mysa.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20San%20Antonio%20Express-News&image=http://ww4.hdnux.com/photos/41/34/75/8769383/3/628x471.jpg", "http://mysa.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20San%20Antonio%20Express-News&image=http://ww2.hdnux.com/photos/41/34/75/8769377/3/628x471.jpg", "http://ww2.hdnux.com/photos/41/34/75/8769361/3/920x920.jpg", "http://mysa.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20San%20Antonio%20Express-News&image=http://ww4.hdnux.com/photos/41/34/75/8769367/3/628x471.jpg", "http://ww2.hdnux.com/photos/41/34/75/8769369/3/920x920.jpg", "http://mysa.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20San%20Antonio%20Express-News&image=http://ww4.hdnux.com/photos/41/34/75/8769375/3/628x471.jpg", "http://ww2.hdnux.com/photos/41/34/75/8769393/3/920x920.jpg", "http://ww4.hdnux.com/photos/41/34/75/8769387/3/920x920.jpg", "http://ww4.hdnux.com/photos/41/34/75/8769375/3/920x920.jpg", "http://ww2.hdnux.com/photos/41/34/75/8769365/3/920x920.jpg", "http://ww2.hdnux.com/photos/41/34/75/8769357/3/square_gallery_thumb.jpg", "http://mysa.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20San%20Antonio%20Express-News&image=http://ww4.hdnux.com/photos/41/34/75/8769395/3/628x471.jpg", "http://mysa.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20San%20Antonio%20Express-News&image=http://ww2.hdnux.com/photos/41/34/75/8769361/3/628x471.jpg", "http://ww4.hdnux.com/photos/41/34/75/8769391/3/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/41/34/75/8769375/3/square_gallery_thumb.jpg", "http://mysa.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20San%20Antonio%20Express-News&image=http://ww2.hdnux.com/photos/41/34/75/8769357/3/628x471.jpg", "http://ww2.hdnux.com/photos/41/34/75/8769361/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/41/34/75/8769358/3/square_gallery_thumb.jpg", "http://mysa.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20San%20Antonio%20Express-News&image=http://ww1.hdnux.com/photos/41/34/75/8769384/3/628x471.jpg", "http://ww3.hdnux.com/photos/41/34/75/8769390/3/920x920.jpg", "http://ww3.hdnux.com/photos/41/34/75/8769358/3/920x920.jpg", "http://ww2.hdnux.com/photos/41/34/75/8769393/3/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/41/34/75/8769360/3/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/41/34/75/8769388/3/920x920.jpg", "http://ww1.hdnux.com/photos/41/34/75/8769380/3/920x920.jpg", "http://ww3.hdnux.com/photos/41/34/75/8769362/3/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/41/34/75/8769380/3/square_gallery_thumb.jpg", "http://mysa.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20San%20Antonio%20Express-News&image=http://ww3.hdnux.com/photos/41/34/75/8769382/3/628x471.jpg", "http://ww2.hdnux.com/photos/41/34/75/8769385/3/920x920.jpg", "http://ww3.hdnux.com/photos/41/34/75/8769370/3/920x920.jpg", "http://ww1.hdnux.com/photos/41/34/75/8769364/3/square_gallery_thumb.jpg", "http://mysa.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20San%20Antonio%20Express-News&image=http://ww2.hdnux.com/photos/41/34/75/8769381/3/628x471.jpg", "http://ww4.hdnux.com/photos/41/34/75/8769367/3/920x920.jpg", "http://mysa.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20San%20Antonio%20Express-News&image=http://ww2.hdnux.com/photos/41/34/75/8769373/3/628x471.jpg", "http://ww1.hdnux.com/photos/41/34/75/8769384/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/41/34/75/8769357/3/920x920.jpg", "http://ww3.hdnux.com/photos/41/34/75/8769366/3/920x920.jpg", "http://ww4.hdnux.com/photos/41/34/75/8769395/3/920x920.jpg", "http://ww3.hdnux.com/photos/41/34/75/8769386/3/920x920.jpg", "http://ww4.hdnux.com/photos/41/34/75/8769371/3/920x920.jpg", "http://mysa.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20San%20Antonio%20Express-News&image=http://ww1.hdnux.com/photos/41/34/75/8769372/3/628x471.jpg", "http://ww3.hdnux.com/photos/41/34/75/8769386/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/41/34/75/8769378/3/square_gallery_thumb.jpg", "http://mysa.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20San%20Antonio%20Express-News&image=http://ww3.hdnux.com/photos/41/34/75/8769394/3/628x471.jpg", "http://ww1.hdnux.com/photos/41/34/75/8769368/3/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/41/34/75/8769371/3/square_gallery_thumb.jpg", "http://mysa.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20San%20Antonio%20Express-News&image=http://ww1.hdnux.com/photos/41/34/75/8769368/3/628x471.jpg", "http://ww1.hdnux.com/photos/41/34/75/8769392/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/41/34/75/8769382/3/square_gallery_thumb.jpg", "http://mysa.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20San%20Antonio%20Express-News&image=http://ww1.hdnux.com/photos/41/34/75/8769380/3/628x471.jpg", "http://ww3.hdnux.com/photos/41/34/75/8769390/3/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/41/34/75/8769388/3/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/41/34/75/8769364/3/920x920.jpg", "http://ww4.hdnux.com/photos/41/34/75/8769391/3/920x920.jpg", "http://ww2.hdnux.com/photos/41/34/75/8769377/3/920x920.jpg", "http://ww3.hdnux.com/photos/41/34/75/8769378/3/920x920.jpg", "http://mysa.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20San%20Antonio%20Express-News&image=http://ww1.hdnux.com/photos/41/34/75/8769388/3/628x471.jpg", "http://ww4.hdnux.com/photos/41/34/75/8769387/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/41/34/75/8769365/3/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/41/34/75/8769395/3/square_gallery_thumb.jpg", "http://mysa.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20San%20Antonio%20Express-News&image=http://ww3.hdnux.com/photos/41/34/75/8769358/3/628x471.jpg", "http://ww1.hdnux.com/photos/41/34/75/8769360/3/920x920.jpg", "http://ww4.hdnux.com/photos/41/34/75/8769363/3/920x920.jpg", "http://mysa.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20San%20Antonio%20Express-News&image=http://ww1.hdnux.com/photos/41/34/75/8769392/3/628x471.jpg", "http://ww4.hdnux.com/photos/41/34/75/8769383/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/41/34/75/8769374/3/920x920.jpg", "http://ww1.hdnux.com/photos/41/34/75/8769376/3/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/41/34/75/8769359/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/41/34/75/8769366/3/square_gallery_thumb.jpg", "http://mysa.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20San%20Antonio%20Express-News&image=http://ww4.hdnux.com/photos/41/34/75/8769363/3/628x471.jpg", "http://ww1.hdnux.com/photos/41/34/75/8769372/3/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/41/34/75/8769363/3/square_gallery_thumb.jpg", "http://mysa.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20San%20Antonio%20Express-News&image=http://ww4.hdnux.com/photos/41/34/75/8769391/3/628x471.jpg", "http://mysa.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20San%20Antonio%20Express-News&image=http://ww4.hdnux.com/photos/41/34/75/8769359/3/628x471.jpg", "http://mysa.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20San%20Antonio%20Express-News&image=http://ww3.hdnux.com/photos/41/34/75/8769390/3/628x471.jpg", "http://ww2.hdnux.com/photos/41/34/75/8769381/3/square_gallery_thumb.jpg", "http://mysa.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20San%20Antonio%20Express-News&image=http://ww1.hdnux.com/photos/41/34/75/8769376/3/628x471.jpg", "http://mysa.mycapture.com/mycapture/remoteimage.asp?backtext=Back%20to%20San%20Antonio%20Express-News&image=http://ww3.hdnux.com/photos/41/34/75/8769378/3/628x471.jpg", "http://ww4.hdnux.com/photos/41/34/75/8769367/3/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/41/34/75/8769359/3/920x920.jpg", "http://ww3.hdnux.com/photos/41/34/75/8769394/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/41/34/75/8769373/3/920x920.jpg", "http://ww2.hdnux.com/photos/41/34/75/8769385/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/41/34/75/8769389/3/920x920.jpg", "http://ww1.hdnux.com/photos/41/34/75/8769368/3/920x920.jpg", "http://ww2.hdnux.com/photos/41/34/75/8769381/3/920x920.jpg"], "published": "2015-10-10T19:39:00.000+03:00", "crawled": "2015-10-10T20:51:15.942+03:00", "highlightTitle": ""}