{"organizations": [], "uuid": "c415d26f7d42b94d8b23b3f8bb784f445ef3e924", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news24.com", "main_image": "http://graph.facebook.com/10227041841/picture", "site_section": "http://www.news24.com/", "section_title": "News24, South Africa's premier news source, provides breaking news on national, world, Africa, sport, entertainment, technology &amp; more. ", "url": "http://www.news24.com/MyNews24/Revolution-hijacked-20151023", "country": "ZA", "title": "Revolution hijacked", "performance_score": 0, "site": "news24.com", "participants_count": 1, "title_full": "Revolution hijacked | News24", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T02:07:00.000+03:00", "replies_count": 0, "uuid": "c415d26f7d42b94d8b23b3f8bb784f445ef3e924"}, "author": "news24.com", "url": "http://www.news24.com/MyNews24/Revolution-hijacked-20151023", "ord_in_thread": 0, "title": "Revolution hijacked", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Why the #feesMustFall has now become a staged managed narrative directed from luthuli house. The revolution has been hijacked right under our noses.\nDuring the time of a revolution, the is mass confusion and excitement. This is fueled by revolutionary agenda information and repressive agenda of disinformation and propaganda.\nWhy is this happening:1. An educated electorate is a threat to the government and has always been since the age of enlightenment. 2. Student loans are a multi billion industry and the bankers wont be happy when education is made free. Student loans are in fact the first step to being trapped in the cycle of indebtedness. 3. Debt and inflation are the cornerstones of the monetary system and the \"solution\" to universal laziness. Who will work for who when no one owes anyone. hence the system will not hold it will simply crush.\nThe real struggle will begin when we experience the living conditions of the Greeks and the Zimbabweans, for we have entrusted our future to a incompetent government, which is essentially a monopoly-tyranny … an oppression of the weak by the incompetent and an exploitation of the poor by the lazy.\nentrusting the revolution to party agents is simply revolutionary suicide and they need to be handled by the masses on a leash to avoid them fulfilling their narrow career ambitions and catching the microphone syndrome.\nPower knows nothing but power,hijacking the revolution is one of their strategies to hold onto power. The busing in of ANCYL loyalist and the agreements of the ANC on principle is nothing but a farce from the bodyguards of capital.To realism our freedoms we first have to tear down the old order of the old guard of capitalism.\nProtesters are told by the ANC firebrand Mcebo Dlamini to maintain \"Discipline\", he is essentially protecting the party, that has used excessive force on the youth and students it claims to represent. PYA/SASCO/ANCYL marching against the ANC is contradictory in itself.\nThe point is not to be integrated but to decolonise and as Fanon says decolonisation is a process of complete disorder where the the last shall be first. Right now the danger is that the movement is headed towards reforms not revolution.as Eliphas Levi posits it is through disorder that we can attract attention because it awkward and intrusive.\nThe world is watching and once again is in solidarity against civil (not liberation) rights movement it once endorsed, that has since committed many sins of incumbency to a point where we have lost count.\nIn this vein I appeal to the #NationalShutDown collective to bring down the ANC lend monopoly tyranny down to its knees, like you did to the VC of the University of Whites-With-Rands.\nIt cannot continue to be business as usual,even if we are appeased with free education, simply because the are no jobs and the pie of opportunity is concentrated to the politically connected and the means of production are owned by white monopoly capital.\nSo even if we get educated we cannot entrepreneur ourselves from poverty.", "external_links": [], "published": "2015-10-24T02:07:00.000+03:00", "crawled": "2015-10-24T03:27:48.584+03:00", "highlightTitle": ""}