{"organizations": [], "uuid": "680ad98b2b1f730e1633da9b594d6ee8eea0d219", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chron.com", "main_image": "http://ww2.hdnux.com/photos/41/20/13/8717049/3/rawImage.jpg", "site_section": "http://www.chron.com/rss/feed/Entertainment-293.php", "section_title": "Entertainment", "url": "http://www.chron.com/entertainment/arts-theater/article/Chronicle-critics-offer-entertainment-suggestions-6540445.php", "country": "US", "title": "Chronicle critics offer entertainment suggestions", "performance_score": 0, "site": "chron.com", "participants_count": 1, "title_full": "Chronicle critics offer entertainment suggestions - Houston Chronicle", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T20:12:00.000+03:00", "replies_count": 0, "uuid": "680ad98b2b1f730e1633da9b594d6ee8eea0d219"}, "author": "chron.com", "url": "http://www.chron.com/entertainment/arts-theater/article/Chronicle-critics-offer-entertainment-suggestions-6540445.php", "ord_in_thread": 0, "title": "Chronicle critics offer entertainment suggestions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photo: Hiram Butler Gallery Image 1 of / 11 11 Mark Fox's video installation \"Giverny: Journal of an Unseen Garden\" offers an under-the-surface view of Claude Monet's famous water garden.\nPhoto: Hiram Butler Gallery Mark Fox's video installation \"Giverny: Journal of an Unseen... Image 2 of 11 The Texas Contemporary Art Fair includes Brandon Vickerd's \"Monument to the First American in Space.\"﻿\nPhoto: Courtesy Of The Artist The Texas Contemporary Art Fair includes Brandon Vickerd's... Image 3 of 11 Corey Arnold's \"Colliding Sea\" is among works on view at the Charles L. Hartman Fine Art Booth during the Texas Contemporary Arts Fair Thursday-Sunday at the George R. Brown Convention Center.\nPhoto: Courtesy Of The Artist, Photographer Corey Arnold's \"Colliding Sea\" is among works on view at the... Image 4 of 11 Pontus Willfors' \"Chair\" (2014, Maple wood, 68x64x72 inches) is among works on view in the Edward Cella Art & Architecture gallery booth during the Texas Contemporary Arts Fair Thursday-Sunday at the George R. Brown Convention Center.\nPhoto: Courtesy Of The Artist Pontus Willfors' \"Chair\" (2014, Maple wood, 68x64x72 inches) is... Image 5 of 11 for La Voz? \"Sixty Years of Animation\", painting and drawings by Gerard Baldwin at the bookstore Domy Books. Byline: Domy Books.\nPhoto: Handout Email for La Voz? \"Sixty Years of Animation\", painting and drawings by... Image 6 of 11 rock band Beach House\nPhoto: Liz Flyntz rock band Beach House Image 7 of 11 Kinky Friedman\nPhoto: Conqueroo Kinky Friedman Image 8 of 11 SHANNON AND THE CLAMS By Wenzdai Morgan Hardly Art Records\nSHANNON AND THE CLAMS By Wenzdai Morgan Hardly Art Records Image 9 of 11 Buffalo Bayou Park celebrates its grand opening on Saturday﻿.\nPhoto: Katya Horner Buffalo Bayou Park celebrates its grand opening on Saturday﻿. Image 10 of 11 Animator-illustrator Gerard Baldwin ﻿﻿has drawn some of the worlds best-known cartoons.\nPhoto: Handout Email Animator-illustrator Gerard Baldwin ﻿﻿has drawn some of the... Image 11 of 11 Chronicle critics offer entertainment suggestions 1 / 11 Back to Gallery Buffalo Bayou Park: Stretching from Shepherd Drive to Sabine Street, the 160-acre Buffalo Bayou Park will celebrate its grand opening with a day of activities, including live music, walking tours, children's crafts, a beer garden and a food truck gathering. The event will culminate with a illuminated procession and a fireworks show.\nWhen: 1:30-9:30 p.m. Saturday\nWhere: 105 Sabine\nInformation: buffalobayou.org\nHE'S NOT LONELY: Kinky Friedman performs frequently in these parts, but this time through he has \"The Loneliest Man I Ever Met,\" his first new album in four decades. On it he covers songs by Johnny Cash , Merle Haggard , Tom Waits , Warren Zevon and others as well as contributing some of his own, including the title track. 5:30 p.m. Friday at Cactus Music, 2110 Portsmouth; free with album purchase; 713-526-9272.\nAndrew Dansby\na good MATCH: The long-awaited Midtown Arts and Theater Center Houston (MATCH) has a soft opening this week with performances. Uptown Dance Company's \"Dance Infusion\" features choreography by Krissy Richmond , Alex Pandiscio and Beth Gulledge-Brown at 7 p.m. Friday-Saturday ($15-$30). Apollo Chamber Players present \"Rhapsody Nouveau,\" a diverse program inspired by Jewish folk music and American jazz that includes the premiere of Gilad Cohen 's \"Three Goat Blues,\" at 6 p.m. Sunday ($10-$30); 3400 Main; 713-874-5875, matchouston.org .\nMolly Glentzer\na New light: What could possibly be new about Claude Monet 's legendary water lilies? Ohio artist Mark Fox found an angle during his Monet Foundation residency in Giverny, France. His \"Giverny: Journal of an Unseen Garden\" takes viewers under the surface of the pond via a high-def video installation. It puts a beautiful 21st-century spin on the great Impressionist's practice of capturing the effects of shifting light from different seasons and different times of day on a single subject. The show debuts 10 a.m.-5 p.m. Saturday; through Nov. 28 at Hiram Butler Gallery, 4520 Blossom; 713-863-7097; hirambutler.com . FREE\nMolly Glentzer\nBuffalo Bayou Park: Stretching from Shepherd to Sabine, the 160-acre Buffalo Bayou Park will celebrate its grand opening with a day of activities, including live music, walking tours, children's crafts, a beer garden and a food truck gathering. The event will culminate with a illuminated procession and a fireworks show.\nWhen: 1:30-9:30 p.m. Saturday\nWhere: 105 Sabine\nInformation: buffalobayou.org\nAnimated life: For more than 60 years, Gerard Baldwin has worked different facets of animation, from writing to directing to drawing cartoon characters, including Mr. Magoo, the Smurfs, the Flintstones, Bullwinkle and his pal Rocky, the Grinch and Yogi Bear. Born in New York, Baldwin has lived in Houston since 1989, where he continues creating and teaching art. The Emmy-winning artist has a new memoir, \"From Mr. Magoo to Papa Smurf,\" about his life and career. Baldwin will sell some original artwork and sign copies of the book at 3 p.m. Saturday at Cactus Music, 2110 Portsmouth; free; 713-526-9272.\nAndrew Dansby\nStep back in time: The delightful trio Shannon and the Clams make music as though the members are locked in the mid-'60s. They incorporate elements of girl groups, doo-wop, garage rock and surf guitar into a joyous mix that can be heard on the new \"Gone By the Dawn.\" 9 p.m. Sunday at Rudyard's, 2010 Waugh; $11-$13; 713-521-0521, rudyardspub.com .\nAndrew Dansby", "external_links": ["http://ww1.hdnux.com/photos/41/20/13/8717052/3/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/41/20/13/8717051/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/41/20/13/8717049/3/920x920.jpg", "http://ww2.hdnux.com/photos/41/20/14/8717057/3/920x920.jpg", "http://ww2.hdnux.com/photos/41/20/13/8717053/3/920x920.jpg", "http://ww1.hdnux.com/photos/41/20/14/8717056/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/41/20/13/8717054/3/920x920.jpg", "http://ww3.hdnux.com/photos/40/34/06/8503682/7/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/41/20/13/8717052/3/920x920.jpg", "http://ww2.hdnux.com/photos/41/20/13/8717049/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/41/20/13/8717053/3/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/41/20/14/8717056/3/920x920.jpg", "http://ww3.hdnux.com/photos/41/20/13/8717054/3/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/41/20/13/8717055/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/41/20/13/8717050/3/920x920.jpg", "http://ww4.hdnux.com/photos/41/20/13/8717051/3/920x920.jpg", "http://ww2.hdnux.com/photos/41/20/14/8717057/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/40/34/06/8503682/7/920x920.jpg", "http://ww4.hdnux.com/photos/41/20/13/8717055/3/920x920.jpg", "http://ww3.hdnux.com/photos/41/20/13/8717050/3/square_gallery_thumb.jpg"], "published": "2015-09-30T20:12:00.000+03:00", "crawled": "2015-10-01T00:30:48.232+03:00", "highlightTitle": ""}