{"organizations": [], "uuid": "c56b99473ed8b19c8c5cee35c668755e1132cec2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cosmopolitan.com", "main_image": "http://cos.h-cdn.co/assets/15/40/1443628177-sq-103-sb-1217r-hires1.jpg", "site_section": "http://www.cosmopolitan.com/entertainment/", "section_title": "Entertainment News and Celebrity Gossip - Cosmopolitan", "url": "http://www.cosmopolitan.com/entertainment/tv/a46982/scream-queens-season-1-episode-3-recap/", "country": "US", "title": "\"Scream Queens\" Recap: Lea Michele Makes Her Stunning Debut as Chanel #6", "performance_score": 6, "site": "cosmopolitan.com", "participants_count": 1, "title_full": "\"Scream Queens\" Recap: Lea Michele Makes Her Stunning Debut as Chanel #6", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T20:03:00.000+03:00", "replies_count": 0, "uuid": "c56b99473ed8b19c8c5cee35c668755e1132cec2"}, "author": "Cosmopolitan.com", "url": "http://www.cosmopolitan.com/entertainment/tv/a46982/scream-queens-season-1-episode-3-recap/", "ord_in_thread": 0, "title": "\"Scream Queens\" Recap: Lea Michele Makes Her Stunning Debut as Chanel #6", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Last night's ​Scream Queens ​was ... not good. It wasn't funny. It was all over the place. And I'm already losing hope that the Red Devil reveal is going to be satisfying. That said, I'm going to keep watching the show anyway. If not for fun, then for these recaps. And for Lea Michele as Hester. And for Niecy Nash as Denise. And now for Mr. Earl Grey. OK, maybe I'm still enjoying the show.\n The episode, called \"Chainsaw,\" opens with Grace and Zayday stocking up on food at a decrepit mini-mart because there is nothing to eat in the KKT house. Figures. Aside from Keke Palmer looking banging in that denim dress, the scene feels pointless. The two have Tasers that Zayday's grandmother bought them to stay safe, only they aren't safe because the Red Devil appears in aisle three, only it's not actually the Red Devil, it's an impostor, which the girls learn after Grace Tasers him in the crotch. See? Pointless.\nShare Tweet Pin E-mail Fox More From Cosmopolitan While this is going down, Chanel #1 is in the meat locker where she dumped the body of Ariana Grande, or Chanel #2. With her is Chanel #5, who is over Chanel #1's shenanigans. She tells Chanel #1 that she needs to handle her mess and find the missing body before people get suspicious. Chanel #5 is also high on that D because she got Spit Roasted / Eiffel Towered by two twins named Rodger and Dodger the night prior, so her priorities are basically in order and missing bodies aren't one of them. Let's take a moment to praise Abigail Breslin, because bitch is bad.\nShare Tweet Pin E-mail Fox Grace and Zayday go searching for Chanel #2, and find that her room is empty and there's a mysterious stain on the carpet. Denise walks in with some pretty glittery luminol and the stain is confirmed to be blood. Denise also reminds the girls that Chanel #2 live-tweeted her death, so duh, she's dead. Grace and Zayday aren't fully accepting her death though, because Chanel #2 has been Instagramming her limp little body from the great beyond.\nThat same night whole campus is rallying against KKT to Bone Thugs-N-Harmony's \"Crossroads,\" which was released in 1995 (I see you, Ryan Murphy). The campus wants to make it clear to the Red Devil that if they're picking off Chanel #1's cohorts then that ain't them . More important, however, is that this is the first prominent moment we get with Earl Grey, played by Lucian Laviscount, who is Chad's right-hand man.\nShare Tweet Pin E-mail Fox A moment for Mr. Earl Grey needs to be had. Aside from wanting to steep that man for 3 to 4 minutes in a teacup of boiling water, I'd also like to dunk his teabag a few times before deciding to leave it in the cup for extra, longer lasting flavor, then top it off with a splash of milk because we both deserve it. In short, boo is fine as all levels of fuck. If Earl Grey turns out to be the Red Devil, take me to your lair, kind sir, and chop me up with all of your chainsaws!\nAt the rally, Dean Munsch tries to convince the students that there is absolutely no murderer on campus, just a series of ill-timed accidental or suicidal deaths. But she announces a new mascot for Wallace University anyway, which is something that probably should have happened decades ago. Replacing the Red Devil is a soft-serve ice cream cone named Coney. Unfortunately for Coney, he's murdered by the Red Devil shortly after his debut. In the first kill of the episode, Coney is sawed in two with a chainsaw in his dorm room. R.I.P., Coney.\nThe following morning, Grace, Zayday, and Denise visit Chanel #2's home in Bel Air to ask her parents if they've seen their missing daughter. Neither of her parents care about her absence or possible death, but they reveal that her name is Sonya. How cute! If she happens to be in any danger, they assume it has to do with her drinking problem or her tough breakup with Chad, with whom they spent the prior Thanksgiving. (It turns out that Chad was in a \"relationship\" with Chanel #2 even though he was \"dating\" Chanel #1.) Finally, Chanel #2's parents tell the girls and Denise that if they find Sonya, don't bother bringing her home. Cold.\nLater in the episode, we find out that Chad has dated or had sex with all of the Chanels. This revelation makes Chad the obvious Red Devil suspect, at least according to Grace, because he's essentially a pathological freak who sees people as objects.\nSpeaking of Grace's astute thinking, she attends her first college class, a Film Analysis seminar taught by her father, Wes. Like any freshman with no regard for the monetary cost of credits would, she walks out of the classroom once she sees her dad is there. Unbothered, Wes begins an uncomfortable intro to his favorite film of all time, Texas Chainsaw Massacre. In lieu of teaching, Wes forces his students, who are being taunted by a mass murderer on their campus, to watch a horror film about a mass murderer. 2015, AMIRITE!? While the film is playing, Wes's flame Gigi sneaks into class.\nShare Tweet Pin E-mail Fox ", "external_links": ["http://www.urbandictionary.com/define.php?term=spit+roast", "http://cos.h-cdn.co/assets/15/40/640x320/landscape-1443627961-sq-103-sb-2175-hires1.jpg", "http://cos.h-cdn.co/assets/15/40/1443627717-sq-103-hg-0441r-hires1.jpg", "http://cos.h-cdn.co/assets/15/40/768x512/gallery-1443627717-sq-103-hg-0441r-hires1.jpg", "http://cos.h-cdn.co/assets/15/40/640x320/landscape-1443627904-sq-s1-lucien-poster-hires1.jpg", "http://www.urbandictionary.com/define.php?term=eiffel+tower", "http://cos.h-cdn.co/assets/15/40/480x320/gallery-1443627717-sq-103-hg-0441r-hires1.jpg", "http://cos.h-cdn.co/assets/15/40/640x320/landscape-1443627717-sq-103-hg-0441r-hires1.jpg", "http://cos.h-cdn.co/assets/15/40/768x511/gallery-1443627961-sq-103-sb-2175-hires1.jpg", "http://cos.h-cdn.co/assets/15/40/640x320/landscape-1443627774-sq-103-sb-1363r-hires1.jpg", "http://cos.h-cdn.co/assets/15/40/640x426/gallery-1443627961-sq-103-sb-2175-hires1.jpg", "http://cos.h-cdn.co/assets/15/40/768x1137/gallery-1443627904-sq-s1-lucien-poster-hires1.jpg", "http://cos.h-cdn.co/assets/15/40/640x427/gallery-1443627717-sq-103-hg-0441r-hires1.jpg", "http://cos.h-cdn.co/assets/15/40/480x711/gallery-1443627904-sq-s1-lucien-poster-hires1.jpg", "http://cos.h-cdn.co/assets/15/40/768x511/gallery-1443627774-sq-103-sb-1363r-hires1.jpg", "http://cos.h-cdn.co/assets/15/40/1443627904-sq-s1-lucien-poster-hires1.jpg", "http://cos.h-cdn.co/assets/15/40/1443627774-sq-103-sb-1363r-hires1.jpg", "http://cos.h-cdn.co/assets/15/40/640x948/gallery-1443627904-sq-s1-lucien-poster-hires1.jpg", "http://cos.h-cdn.co/assets/15/40/480x319/gallery-1443627961-sq-103-sb-2175-hires1.jpg", "http://cos.h-cdn.co/assets/15/40/1443627961-sq-103-sb-2175-hires1.jpg", "http://cos.h-cdn.co/assets/15/40/640x426/gallery-1443627774-sq-103-sb-1363r-hires1.jpg", "http://cos.h-cdn.co/assets/15/40/480x319/gallery-1443627774-sq-103-sb-1363r-hires1.jpg"], "published": "2015-09-30T20:03:00.000+03:00", "crawled": "2015-10-01T03:53:03.710+03:00", "highlightTitle": ""}