{"organizations": [], "uuid": "94f2adab25659f284f9a74850383fe42f142671e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.newsday.com", "main_image": "http://cdn.newsday.com/polopoly_fs/1.10949515.1444611578!/httpImage/image.JPG_gen/derivatives/display_600/image.JPG", "site_section": "http://www.newsday.com/cmlink/1.1250364", "section_title": "Entertainment stories from Newsday", "url": "http://www.newsday.com/entertainment/celebrities/amy-schumer-kicks-out-heckler-at-calif-gig-1.10953064", "country": "US", "title": "Amy Schumer kicks out heckler at California gig", "performance_score": 0, "site": "newsday.com", "participants_count": 0, "title_full": "Amy Schumer kicks out heckler at California gig", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T04:57:00.000+03:00", "replies_count": 0, "uuid": "94f2adab25659f284f9a74850383fe42f142671e"}, "author": "", "url": "http://www.newsday.com/entertainment/celebrities/amy-schumer-kicks-out-heckler-at-calif-gig-1.10953064", "ord_in_thread": 0, "title": "Amy Schumer kicks out heckler at California gig", "locations": ["California"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Amy Schumer"], "text": "advertisement | advertise on newsday \nComedian Amy Schumer had a persistent heckler ejected from a performance in California on Sunday. \nWhile taking part in Funny Or Die's touring Oddball Comedy and Curiosity Festival at the Irvine Meadows Amphitheatre in Irvine, People magazine reports, Schumer was telling the audience about her \"dream come true\" of having hosted \"Saturday Night Live\" the previous evening. \nadvertisement | advertise on newsday \nBut midway through her set, said The Orange County Register, a woman in the front row began to yell at her, prompting the Rockville Centre-raised comic, 34, to ask the heckler to stop. When the woman refused to do so, Schumer called for security to escort her out of the 18,000-strong audience. \nPeople added that a friend of the heckler also was removed, and that the audience applauded as the seasoned standup nonchalantly returned to her act, sipping on a drink between jokes. \nVirtually all standup comics must deal with hecklers from time to time. A YouTube video with more than 3 million views shows Schumer at The Punchline in Atlanta in November 2009 -- two years after appearing on Comedy Central's \"Live at Gotham\" and competing on NBC's \"Last Comic Standing\" -- easily handling another woman heckler. Responding to an evidently drunk woman wanting to know where Schumer purchased her boots, the comedian replied, \"They're at the corner of you-can't-afford-them and stop-talking-to-me.\" She then waved off security, telling the comedy club's staff, \"She's fine, no security.\" The woman momentarily continued heckling but then remained quiet the rest of the evening. \nThe festival, which closes its tour Sunday, played Wantagh Sept. 4. \nComing soon: Newsday's Entertainment newsletter, for the latest on celebs, TV, more.", "external_links": [], "published": "2015-10-13T04:57:00.000+03:00", "crawled": "2015-10-13T05:30:29.928+03:00", "highlightTitle": ""}