{"organizations": [], "uuid": "30e719cdbf7af939df5bb8dae5617c70c57b941c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48524/c", "section_title": "Entertainment - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30218650/artprice-frieze-and-fiac-warfair-in-a-context-of-anglo-french-rivalry", "country": "US", "title": "Artprice: FRIEZE and FIAC, \"Warfair\" in a Context of Anglo-French Rivalry", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Artprice: FRIEZE and FIAC, \"Warfair\" in a Context of Anglo-French Rivalry - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "30e719cdbf7af939df5bb8dae5617c70c57b941c"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30218650/artprice-frieze-and-fiac-warfair-in-a-context-of-anglo-french-rivalry", "ord_in_thread": 0, "title": "Artprice: FRIEZE and FIAC, \"Warfair\" in a Context of Anglo-French Rivalry", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Artprice.com\nPARIS , October 8, 2015 /PRNewswire/ --\nRegarding Contemporary art auction sales turnover, no need for a photo finish… London is way ahead of Paris ( $407 million vs. $31 million ), as revealed this week in Artprice's 2015 Contemporary Art Market Report.\n( Free download of the entire Contemporary Art Market Report 2015 in PDF format on Artprice's Twitter https://twitter.com/artpricedotcom/status/651070545115619329 )\nHowever, the art market is not just a question of auction turnover… and the French capital fortunately still has an army of powerful galleries and a renowned fair, the FIAC. This year the event is being held at the Grand Palais from October 22 to 25 , and, as is now customary, one week after the FRIEZE art fair in London .\nToday, both events enjoy a roughly equivalent standing, but that could change in the near future if one of the two capitals were to definitely prevail over the other. The competition is indeed intense and it would be most unfortunate and very expensive for France if the French capital ended up losing the battle!\nArtprice has compared and analysed the structures of the two fairs. According to thierry Ehrmann, CEO and founder of Artprice, \"the FRIEZE art fair is a \"war machine\" irrigated by Anglo-Saxon domination which completely belittles France \" (The USA and UK account for 60% of the global Contemporary art auction turnover compared with just 2% for France ). With such figures, France's handicap seems insurmountable.\nThe FIAC ' s diminishing advantage\nThe FIAC is not at its first edition ... The Old Lady, now celebrating its 42nd year, bills itself as a pioneer in the field of Contemporary art fairs. Its English rival is only in its 12th edition and seems very young by comparison. And yet their respective 2014 exhibitor / visitor stats look very similar:\nFIAC:\nExhibitors: 191 in 2014, 175 in 2015.\nCountries represented: 26 in 2014, 23 in 2015.\nVisitors: 74,000 in 2014.\nFRIEZE:\nExhibitors: 162 in 2014, 164 in 2015.\nCountries represented: 25 in 2014, 27 in 2015.\nVisitors: 60,000 in 2014.\nThe FIAC retains a slight lead over its English rival… but things are changing. Not only is the FRIEZE growing each year, but the Paris event has reduced the number of exhibitors. Obviously, the number of galleries invited does not in any way determine the quality of a fair and the comparison really needs to look elsewhere to be of any value.\nThe question of their respective international reaches is however a relevant, if not a fundamental, factor. While the FRIEZE is hosting galleries from an increasingly diverse national base, the FIAC seems to be heading in the opposite direction, often accused of not hosting enough French galleries and artists and letting itself be seduced by the rich and powerful Anglo-Saxon galleries.\nIn fact the French fair seems to want to defend its specificity and its culture at all costs. In financial terms, the FRIEZE is supported by Deutsche Bank, an extremely international and well-known German bank that is highly active in the Art Market; the FIAC for its part is sponsored by Galeries Lafayette , an undoubtedly prestigious ensign, but very Franco-French.\nAmbition or tradition?\nWhile the FRIEZE has appointed as Director the young Victoria Sidall (36 and founder of the FRIEZE Masters), the FIAC has been headed by Jennifer Flay for the past 12 years, i.e. since the FRIEZE has existed! So while the English Fair has sought to inject new blood, the French fair is sticking to its positions.\nThe Paris event can be proud of its long-earned experience. The FRIEZE Artist Award, awarded since 2014, is not about to overshadow the famous Marcel Duchamp Prize awarded during the FIAC. The latter can also count on support from the major French collectors. We know that François Pinault and Bernard Arnaud are competing fiercely for domination of the French market. Last year, Pinault acquired 37 works on the first day of the FIAC, including a sculpture by the American artist Roni Horn for $3.5 million at Hauser & Wirth.\nOn the other side of the Channel, business is also buoyant. The work Because I Cannot Have You I Want You by Damien Hirst (an English artist!) was acquired for £4 million just hours after the fair opened in 2014.\nAn uninhibited fair versus a political event…\nMembers of France's government visit the FIAC every year. Last year, President Francois Hollande visited the Grand Palais accompanied by the Minister of Culture, and their visit was of course covered by the Press. This might seem strange to Brits as neither David Cameron nor the Queen seek to promote the FRIEZE event.\nAt the end of the day, both fairs might look quite similar in appearance… but are in fact profoundly different. The FRIEZE wants to be independent, young and dynamic; the FIAC wants to remain prestigious and a symbol of France .\nhttp://www.artprice.com (c) 1987-2015 thierry Ehrmann\nAbout Artprice:\nArtprice is listed on the Eurolist by Euronext Paris, SRD long only and Euroclear: 7478 - Bloomberg: PRC - Reuters: ARTF.\nArtprice is the global leader in art price and art index databanks. It has over 30 million indices and auction results covering more than 592,000 artists. Artprice Images(R) gives unlimited access to the largest Art Market resource in the world: a library of 118 million images or prints of artworks from the year 1700 to the present day, along with comments by Artprice's art historians.\nArtprice permanently enriches its databanks with information from 4,500 auctioneers and it publishes a constant flow of art market trends for the world's principal news agencies and approximately 7,200 international press publications. For its 3,600,000 members, Artprice gives access to the world's leading Standardised Marketplace for buying and selling art.\nDiscover the Alchemy and the universe of Artprice http://web.artprice.com/video , which headquarters are the famous Museum of Contemporary Art, the Abode of Chaos http://goo.gl/zJssd https://vimeo.com/124643720\nNews Artmarket:\nhttps://www.facebook.com/artpricedotcom\nhttp://twitter.com/artpricedotcom https://www.facebook.com/artpricedotcom\nhttps://plus.google.com/+Artpricedotcom/posts\nhttp://artmarketinsight.wordpress.com/\nThe 2014 Art Market Report contains the famous Artprice ranking of the world's 500 most sought-after artists, the top 100 auction results, market breakdowns by country and by city, by period and by medium, Artprice indices and 21 chapters that provide an uncompromising analysis of the Art Market. It is available free of charge in PDF format at http://imgpublic.artprice.com/pdf/rama2014_en.pdf\nThe Contemporary Arts Museum The Abode of Chaos on Facebook:\nhttps://www.facebook.com/la.demeure.du.chaos.theabodeofchaos999\nContact : Josette Mey : e-mail : ir@artprice.com\n ", "external_links": ["http://artmarketinsight.wordpress.com/", "http://goo.gl/zJssd", "http://www.xmlnews.org/ns/", "http://twitter.com/artpricedotcom", "https://www.facebook.com/artpricedotcom", "http://web.artprice.com/video", "http://imgpublic.artprice.com/pdf/rama2014_en.pdf", "https://vimeo.com/124643720", "http://rt.prnewswire.com/rt.gif?NewsItemId=enUK201510082265&Transmission_Id=201510081417PR_NEWS_USPR_____enUK201510082265&DateId=20151008", "https://twitter.com/artpricedotcom/status/651070545115619329", "https://plus.google.com/+Artpricedotcom/posts", "https://www.facebook.com/la.demeure.du.chaos.theabodeofchaos999"], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-08T23:33:09.477+03:00", "highlightTitle": ""}