{"organizations": ["Cirque du Soleil", "Ruby Lewis Related View Larger FILE"], "uuid": "203025ad160d03bf0083587a13faf6107694c257", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.actionnewsjax.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/10/23/e9/5b/22e2f49f36644441b6c550e14fe97679-72231778a2354ee7a37a687c3502a966-0.jpg", "site_section": "http://www.actionnewsjax.com/list/rss/ap/entertainment/latest-entertainment-news/atk/", "section_title": "Latest in Entertainment", "url": "http://www.actionnewsjax.com/ap/ap/entertainment/broadways-cirque-du-soleil-show-will-star-ruby-lew/nn8PW/", "country": "US", "title": "Broadway's Cirque du Soleil show will star Ruby Lewis", "performance_score": 0, "site": "actionnewsjax.com", "participants_count": 0, "title_full": "Broadway's Cirque du Soleil show will star Ruby Lewis", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T19:07:00.000+03:00", "replies_count": 0, "uuid": "203025ad160d03bf0083587a13faf6107694c257"}, "author": "", "url": "http://www.actionnewsjax.com/ap/ap/entertainment/broadways-cirque-du-soleil-show-will-star-ruby-lew/nn8PW/", "ord_in_thread": 0, "title": "Broadway's Cirque du Soleil show will star Ruby Lewis", "locations": ["Tennessee", "NEW YORK", "Los Angeles"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Lewis", "Ruby Lewis", "Ryan Miller/Invision/AP", "Ben Elton"], "text": "Updated: 12:07   12:07   Broadway's Cirque du Soleil show will star Ruby Lewis Related View Larger FILE - In this July 16, 2014 file photo, Ruby Lewis poses during the party for the opening night performance of Queen and Ben Elton's \"We Will Rock You\" at the Center Theatre Group/Ahmanson Theatre in Los Angeles. Lewis, a native of Tennessee, will make her Broadway debut this spring in “Paramour” with a 38-member company that will build a show about a love triangle with some eye-popping acrobatics. (Photo by Ryan Miller/Invision/AP, File) Sponsored Links   NEW YORK — \nCirque du Soleil has revealed one of the female leads of its first production created specifically for Broadway and, appropriately, she's a self-described \"thrill-seeker\" who lists among her skills skydiving, improv and tae kwon do. \nRuby Lewis, a native of Kentucky, will make her Broadway debut this spring in \"Paramour\" with a 38-member company that will build a show about a love triangle with some eye-popping acrobatics. \nLewis said she is currently visiting with friends and family \"before my whole life takes off at 50 mph.\" She grew up a dancer and has always been intrigued by aerial artists and gymnasts. \n\"Balancing and strength and grace, all combined into one, is so divine to watch so if I can hone in on those skills and fly around, I'll be a happy lady,\" she said. \"Whatever skills I have, I'm ready to throw them in the ring. That's what's going to be so fun about it: We're just going to play.\" \nPreviews for \"Paramour\" will begin April 16 at the Lyric Theatre with an opening set for May 25. The show is directed by French stage director and choreographer Philippe Decouflé. \n\"We cast Ruby for her amazing vocal talent and acting and dancing. But the fact that she's unafraid to get 30 feet up in the air in a harness above the stage is a bonus for us,\" said Scott Zeiger, the president and managing director of Cirque du Soleil Theatrical. \nLewis, a soprano, recently did her first aerial training at the Cirque's home base of Montreal. \"It felt very natural. I flew. I flipped. I did a couple of little stunts.\" She also took a physicality test to prove she had the core strength to do the show. \"I passed with flying colors. I've heard there are a lot of plans for magical moments.\" \nLewis was discovered while appearing in \"For the Record: Baz,\" a post-modern cabaret inspired by the films of director Baz Luhrmann. She has also appeared in the national touring companies of \"Grease,\" ''Jersey Boys\" and \"We Will Rock You.\" \nHer TV credits include stints on \"Girl Meets World,\" ''Masters of Sex,\" ''Desperate Housewives,\" ''Rules of Engagement\" and \"Medium.\" She graduated from Western Kentucky University and has worked with the improv comedy group the Upright Citizens Brigade. \nZeiger was tasked in spring 2014 with transforming one part of the Cirque empire into a theater-ready medium by adding linear story-telling to what is often just an assorted group of acts. \n\"If you've seen other Cirque du Soleil shows, they are primarily visual and extraordinary spectacles and while they do have a thin story, it really is a visual and emotional roller-coaster and you take away for it what you wish,\" he said. \n\"The creation of 'Paramour' gives is us this extraordinary opportunity to tell a story with a beginning, middle and end. We'll be doing this in a very, very unique way, meaning we will use acrobatics and Cirque du Soleil theatricality for story-telling.\" \n___", "external_links": [], "published": "2015-10-23T19:07:00.000+03:00", "crawled": "2015-10-24T09:50:42.586+03:00", "highlightTitle": ""}