{"organizations": [], "uuid": "c28a204466f301b7c9d36e3e5e977edac5ce686c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "lgbtweekly.com", "main_image": "http://lgbtweekly.com/wp-content/uploads/2015/10/wpid-184_5268_7813-300x220.jpg", "site_section": "http://lgbtweekly.com/category/section4a/feature4a/feed/", "section_title": "LGBT Weekly » Entertainment Feature", "url": "http://lgbtweekly.com/2015/10/15/healing-wars-2/", "country": "US", "title": "‘Healing Wars’", "performance_score": 0, "site": "lgbtweekly.com", "participants_count": 1, "title_full": "‘Healing Wars’", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T22:30:00.000+03:00", "replies_count": 0, "uuid": "c28a204466f301b7c9d36e3e5e977edac5ce686c"}, "author": "LGBT Weekly", "url": "http://lgbtweekly.com/2015/10/15/healing-wars-2/", "ord_in_thread": 0, "title": "‘Healing Wars’", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Paul Hurley and Keith A. Thompson in Healing Wars | PHOTO: JIM CARMODY A remarkable multisensory experience that blends dance, storytelling and multimedia \nHealing Wars, a new performance piece being offered at the La Jolla Playhouse, through their Without Walls program is a powerful show the combines dance, music, acting and multimedia, and unfolds through the specter of past and present wars. \nCreator Liz Lerman has been inspired by the Civil War for many years. She initially wanted to focus on women in war and how during the time of the Civil War there were a number of women that dressed as men to fight in that war, but as she did more research for the show she became interested in amputation and decided to combine these elements into her work. With this new addition, she decided to incorporate other wars into the piece as well. \nLa Jolla Playhouse Artistic Director Christopher Ashley, thought the piece would do quite well here in San Diego, this being a military town. \nAshley is right in thinking there will be a strong connection between San Diego military audiences and the show, but it will also appeal to the artistic and theatrical San Diego audience as well. \nThe event, if you will, begins before the audience is seated. Lerner’s piece has been presented a handful of times over the last year or so, in many different cities. Each presentation starts with a preshow performance. Here at The Playhouse, Lerner has created a walk-through live museum of sorts. \nThe audience enters the theater from backstage and they are led through a maze. Throughout that maze audience members get to experience the shows performers in various live vignettes that depict individual moments during American wars. Dialogue is not used. The performers dance and move in their individual areas silently allowing the walk-through audience a chance to peek into their lives. \nThe last vignette is a conversation, the only vignette with dialogue, between two men. One of those men is an amputee, the other asking him questions about his amputation and life. \nHealing Wars may not be for everyone. That’s not to say that it isn’t an interesting experience that everyone should see. It is visually stunning at times and the modern dance used throughout the evening is thoughtful, athletic and at times quite beautiful. \nThere will be some that will feel there is no storyline. To be honest, while there is one, it’s thin and sometimes tough to follow as it goes back and forth between the Civil War and present day wars in Iraq and Afghanistan. Meghan Frederick in Healing Wars | PHOTO: JIM CARMODY \nThe performers play multiple roles. However, they also each play a “main part” they reprise a few times throughout the evening. Since they are rarely called by their character names and their costumes barely change, it is difficult to know immediately what role they are playing. \nThe ensemble is comprised mainly with dance performers with little to no acting experience. \nThe piece itself touches upon the women who dressed as men to be in the war and how their secret was only discovered once they were found dead. Narration explains that it wasn’t so much the shock that women did this; it was more the question of where to bury them. \nAnother moment in the show features Paul Hurley, a retired Navy gunners mate, who was injured overseas in Bahrain. His segment explains what led up to and how he lost his leg. \nAll of these moments are explained mainly through choreography and minimal dialogue if any. Like most dance pieces these moments are captivating and interesting to watch. However, that being said, there really are no standout performances in the show. They work as a collective ensemble and that is where their strength lies. \nDance enthusiasts will definitely connect with, and enjoy, the choreography and movement created for the piece. Lerman, along with co-choreographer Keith Thompson and members of the cast have put together a tight dance show. There really isn’t a false moment with the choreography. \nAudience members are taken through a story that unfolds through dance and the acting does not have a polished conversational tone or feeling to it which appears intentional. War is not an easy subject to talk about. Especially when what is being talked about is amputation, or how particular operations were handled years ago, or what injuries someone has sustained and if they can be saved. \nThe performers who lecture, or who give presentations, come across as uncomfortable in front of a crowd or group that they are presenting to. The intention here is to give audiences a look into those people and they have nailed it. \nWe live in a time where television shows like ER, Grey’s Anatomy and Code Black , feature actors who rattle off procedures. They talk about injuries and medical situations like they are reciting a nursery rhyme they learned as a child. We all know that in most live situations this isn’t the case. Lerner has taken some of these medical moments and narrations and has added them throughout the piece, trying to bridge the gap between a dance and theater piece. \nThe reason to see Healing Wars is for the story told through the choreography and the visual effects treating the audience to a remarkable experience. Tamara Hurwitz Pullman in Healing Wars | PHOTO: T. WOOD \nThe Without Walls project at The Playhouse has, in the past, presented many shows, events and programs that give audiences a chance to see performance in an “out-of-the-box” style and experience. Healing Wars , being a part of this program does just that. \nThis is an event. An experience that will not touch everyone at every moment, or the same moment, but there is most likely something in the show that will affect each one of us. \nHealing Wars continues at The La Jolla Playhouse in the Forum Theatre through Oct. 25. For tickets visit The Playhouse box office, or call 858-550-1010. lajollaplayhouse.org \nShort URL : http://lgbtweekly.com/?p=64979 Posted by LGBT Weekly on Oct 15, 2015. Filed under Entertainment Feature , Entertainment News , Latest Issue , Section 4A . You can follow any responses to this entry through the RSS 2.0 . You can leave a response or trackback to this entry Leave a Reply", "external_links": [], "published": "2015-10-15T22:30:00.000+03:00", "crawled": "2015-10-16T08:06:30.783+03:00", "highlightTitle": ""}