{"organizations": [], "uuid": "7f4f3849e60febe0c33cac383598f17a05f69c7b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbsnews.com", "main_image": "http://cbsnews1.cbsistatic.com/hub/i/r/2015/09/21/81cde6da-8df1-46fd-95cb-3d0493f932d2/thumbnail/620x350/c0146c918367fda62282fb09a1acf59f/brian-depalma-blow-out-promo.jpg", "site_section": "http://www.cbsnews.com/entertainment/", "section_title": "Entertainment News, Headlines and Video - CBS News ", "url": "http://www.cbsnews.com/news/nyff-review-a-bloody-valentine-to-de-palma/", "country": "US", "title": "New York Film Festival review: A bloody valentine to \"De Palma\"", "performance_score": 0, "site": "cbsnews.com", "participants_count": 1, "title_full": "New York Film Festival review: A bloody valentine to \"De Palma\" - CBS News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T14:26:00.000+03:00", "replies_count": 0, "uuid": "7f4f3849e60febe0c33cac383598f17a05f69c7b"}, "author": "David Morgan CBS News", "url": "http://www.cbsnews.com/news/nyff-review-a-bloody-valentine-to-de-palma/", "ord_in_thread": 0, "title": "New York Film Festival review: A bloody valentine to \"De Palma\"", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Reveries of sensuality and blood-soaked violence mark the work of director Brian De Palma. In a new documentary, the filmmaker recounts a career which has known box office success and failures, and of being both a critical darling and a whipping post of attacks nearly as violent as his movies.\n17 Photos New York Film Festival 2015 One of the world's premier celebrations of cinema kicks off with gala red carpet premieres, symposiums and retrospectives\n\"De Palma\" (making its U.S. premiere Wednesday at the New York Film Festival) was directed and produced by two filmmakers who are very much fans: Noah Baumbach (\"Francis Ha,\" \"Mistress America\"), and Jake Paltrow (\"The Good Night,\" \"Young Ones\").\nIt consists almost entirely of De Palma, now 75, speaking straight into a camera, with cutaways to clips and stills illustrating his life and work. No time is spent interviewing other filmmakers, critics or collaborators; De Palma is such an entertaining and insightful enough raconteur that they are not needed.\nThe son of a surgeon (\"I did grow up in an operating room ... you can't believe how much blood there is\"), De Palma came to notice in the 1970s as part of a coterie of Hollywood's brightest young directors, including Martin Scorsese, George Lucas, Steven Spielberg and Francis Coppola. But while he'd cut his teeth on bargain-basement films evoking the French New Wave, De Palma suffered from what he labeled \"his 'Orson Welles problem' ... I had big ideas and I needed a lot of that stuff\" (meaning expensive equipment and adequate budgets).\nSissy Spacek in \"Carrie.\" United Artists His 1973 horror film \"Sisters,\" in which Margot Kidder played twins (one of whom is a mentally disturbed killer), was a surprise hit, and his 1976 Stephen King adaptation, \"Carrie,\" captured Academy Award nominations for his two female leads. He got on the map, but while he has fashioned a career for himself now spanning five decades, De Palma's resume has been spotty and at times risible, a fact he admits as being par for the course in the industry.\nUnlike many retrospectives of filmmakers, and to this documentary's great credit, ALL of De Palma's movies are highlighted -- the good, the bad and the ugly. Beginning with his student films and early independent features (starring a very young Robert De Niro), De Palma gets to wax rhapsodically about the artistic and financial triumphs (\"Dressed to Kill,\" \"The Untouchables,\" \"Mission Impossible\"), the bombs (\"Get to Know Your Rabbit,\" \"The Bonfire of the Vanities\"), the curiosities (\"Phantom of the Paradise,\" \"Raising Caine,\" \"The Black Dahlia\"), and the paychecks (\"Mission to Mars\").\nWe hear De Palma's intellectualization of cinematic language, sparked by his early screening of Hitchcock's \"Vertigo,\" which proved a career-long inspiration for him. He also explains why some tricks of the trade are or are not effective, such as the split-screen montages in \"Sisters\" (which worked) and \"Carrie\" (which didn't).\nAs an example, here is the Steadicam shot from \"Carlito's Way,\" filmed in New York's Grand Central Station, featuring Al Pacino as an ex-con being tailed by some ruthless mob characters. It's a splendid example of De Palma's masterful use of space and sinuous camera movement to drive the narrative and build tension:\nHis use of Hitchcock's stylistic trappings was always a signature of his work, particularly his suspense films. But De Palma set himself apart by the blood, violence and sex which Hitchcock could only suggest. He rather casually regards the criticism of his portrayal of women as victims of violence or targets of the male gaze (and if you'd forgotten, the film's generous clips will remind you). And yes, he understands why the caustic ending of \"Blow Out\" (in which a dying woman's gut-wrenching scream is looped into a schlock horror movie) generated such ire. How could it not?\nWhat is more valuable about this documentary are the personal stories that colored De Palma's creative output, such as Keith Gordon's character in \"Dressed to Kill,\" a young student who spies on a psychiatrist's office in order to catch a criminal -- it is similar to the young De Palma who spied on, and caught, his philandering father with his mistress.\nWe also get gossipy reminiscences of his colorful dealings with Hollywood stars. Cliff Robertson, the male lead in the romantic melodrama \"Obsession,\" comes off as a jerk who made acting difficult for costar Genevieve Bujold, while Sean Connery hilariously objected to all the bullet squibs for his Tommy gun death scene in \"The Untouchables.\" (De Palma is incredulous that Mr. James Bond had never before worn a squib!)\n\"De Palma,\" distributed by A24, will be released in theatres in 2016. It is not rated (but quite bloody). 107 mins.\nMore NYFF53 reviews:\n\"The Walk\" \"The Forbidden Room\" \"Journey to the Shore\" and \"Cemetery of Splendour\" \"Arabian Nights\"", "external_links": ["https://www.youtube.com/embed/f0S0gvvhaqg", "http://cbsnews1.cbsistatic.com/hub/i/2015/09/21/5d83a4b3-e6c0-49fb-b983-4b62a734fed7/ea8d58543ddd132f4b12b230aa69be31/brian-de-palma-sissy-spacek-carrie-220.jpg", "http://cbsnews1.cbsistatic.com/hub/i/r/2015/09/30/d2c3a54e-8c68-44e0-85e4-547a2a02a4b1/thumbnail/220x140/033a53e1c2134d74c588104afa7dff87/gettyimages-490595962.jpg"], "published": "2015-09-30T14:26:00.000+03:00", "crawled": "2015-10-01T00:24:05.804+03:00", "highlightTitle": ""}