{"organizations": [], "uuid": "7c73fa1cb1dbea4cc97412bf2f030f27e812c820", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.arcamax.com", "main_image": "http://www.arcamax.com/apple-touch-icon.png", "site_section": "http://www.arcamax.com/entertainment/", "section_title": "Entertainment | ArcaMax Publishing", "url": "http://www.arcamax.com/entertainment/entertainmenttoday/s-1731829?fs", "country": "US", "title": "US has funded artists and intellectuals for half a century, but it's a perennial fight | Entertainment News", "performance_score": 0, "site": "arcamax.com", "participants_count": 1, "title_full": "US has funded artists and intellectuals for half a century, but it's a perennial fight | Entertainment News | ArcaMax Publishing", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "7c73fa1cb1dbea4cc97412bf2f030f27e812c820"}, "author": "arcamax.com", "url": "http://www.arcamax.com/entertainment/entertainmenttoday/s-1731829?fs", "ord_in_thread": 0, "title": "US has funded artists and intellectuals for half a century, but it's a perennial fight | Entertainment News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON -- Half a century ago, during a crowded Rose Garden ceremony, President Lyndon B. Johnson codified the nation's commitment to the arts and humanities.\nJohnson, who as a young man taught students of Mexican descent in his native Texas, asked the nation not to forget the arts and humanities even as the prevailing thought was that science and technology should be the focus in an increasingly advanced world.\n\"We in America have not always been kind to the artists and the scholars who are the creators and the keepers of our vision,\" Johnson said on Sept. 29, 1965. \"Somehow, the scientists always seem to get the penthouse, while the arts and the humanities get the basement.\"\nAs the National Endowment for the Humanities and the National Endowment for the Arts celebrate their 50th anniversaries this week, they are still trying to climb out of that cellar, at least financially. While their endurance reflects an ongoing commitment to the arts and humanities, their struggles show that the government's adherence to that promise can be fickle.\nAt $150 million each, the budgets for the two endowments represent less than 1 percent of federal discretionary spending. Still, the Endowment for the Humanities is on constant alert for budget cuts, said William Adams, who became the 10th chairman of the agency just over a year ago.\n\"It's been difficult to make arguments for incremental funding when the total size of the federal budget has been flat or smaller in the past few years,\" Adams said, adding, \"But at the same time, as I talk with members of Congress and the administration, we're always trying to make a case for the efficiency and cost-effectiveness for what we do.\"\nFrom scholars to filmmakers to museums and libraries, a number of people who work in the arts and humanities rely on the endowments to finance their work and leverage private support.\nThe endowments were created by Johnson and Congress as independent federal agencies to support research and learning to further cultural knowledge, in an unprecedented government show of support for the arts and humanities.\nIt was the height of the Cold War, but also a time of renewed interest in cultural expression, thanks in part to the celebration of artists in the White House when John F. Kennedy was president.\n\"The NEA was not intended to solve a problem, but rather to embody a hope,\" editor Mark Bauerlein wrote in \"The National Endowments for the Arts: A History -- 1965-2008.\"\nAmong the Endowment for the Arts' first grant recipients were nontraditional, up-and-coming artists such as Leon Polk Smith, Dan Flavin and Manuel Neri.\nHumanities grant recipients over the years include Harold Bloom for research related to his book \"The Anxiety of Influence,\" Noam Chomsky for his work on the theory of universal grammar and Ken Burns' work from the start of his documentary film career. The endowment, as part of its yearlong 50th anniversary celebration, has digitized its grant records for public viewing.\nFor years, however, the Endowment for the Humanities' budget has dwelt far below the 1979 high of $390 million, adjusted for inflation, before significant cuts in the 1980s.\nAlong with public broadcasting, both endowments have faced threats of elimination from some in Congress who reject the idea that taxpayers should pay for arts projects and research into philosophy and other humanities. For example, the 1989 Serrano-Mapplethorpe controversy over the boundary-pushing of exhibits of grant-funded artists Andres Serrano and Robert Mapplethorpe sparked outrage in Congress.\nFolklore scholar William Ferris, a recipient of grants from both endowments who served as humanities endowment chairman from 1997 to 2001, has long called for a Cabinet-level position to oversee the endowments and other cultural institutions, including the Smithsonian Institution and National Archives. Many other countries, he noted, have ministers of culture.\n\"Ironically, our culture is often better appreciated overseas than at home,\" Ferris said of, for instance, American movies and fashion that take hold abroad.\nPart of the tension that underlies funding issues for the endowments, said Stanley Katz, director of Princeton's Center for Arts and Cultural Policy Studies, is the idea that federal agencies should fund cultural affairs. It raises the suspicion many Americans have of state intervention in culture, he said.\nPolitics is the biggest threat to the endowments' survival, said Cynthia Koch, a historian at Bard College, citing the culture wars at the end of the last century.\n\"Both endowments are still very, very cautious,\" said Koch, who has written about the endowments' funding challenges. \"They're still very aware of the culture wars of the 1990s and continue to operate that way.\"\nAdams, who retired as Colby College's president before his appointment by President Barack Obama as chairman for humanities, says he believes the endowments are still a \"good deal.\" To suppose private philanthropy would have filled in the arts and humanities funding gap when the endowments were created, he said, is \"fantasy.\"\n\"The investment that has been made over these 50 years has had huge impact in that the country is much better off and richer in its cultural expression because of NEA and NEH,\" said Adams.\nThis week, arts endowment Chairwoman Jane Chu launched a yearlong 50th anniversary celebration of the agency that includes new initiatives. The humanities endowment kicked off its anniversary celebration with 50.neh.gov, a website highlighting its history and a series of events planned over the next year around the country.\nSince taking office last summer, Chu said, she has met with members of Congress and state and local leaders, advocating for why the arts matter.\n\"It's time to move away from the notion that the arts are a separate part of society and that some people can participate in the arts and others cannot,\" she said Monday in a National Press Club speech. \"We are seeing, firsthand, that the opposite is true.\"\n(c)2015 Tribune Co.\nVisit Tribune Co. at www.latimes.com\nDistributed by Tribune Content Agency, LLC.\nShare Comment", "external_links": ["https://plus.google.com/share?url=http://www.arcamax.com/entertainment/entertainmenttoday/s-1731829", "http://www.facebook.com/sharer.php?u=http://www.arcamax.com/entertainment/entertainmenttoday/s-1731829&h=US+has+funded+artists+and+intellectuals+for+half+a+century%2C+but+it%27s+a+perennial+fight", "http://twitter.com/share?url=http://www.arcamax.com/entertainment/entertainmenttoday/s-1731829&hashtags=ArcaMax"], "published": "2015-10-02T03:00:00.000+03:00", "crawled": "2015-10-03T12:39:25.567+03:00", "highlightTitle": ""}