{"organizations": [], "uuid": "dbf18256f3e5406faf43645bd286a406a674c642", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.northjersey.com", "main_image": "http://www.northjersey.com:80/polopoly_fs/1.1430154!/fileImage/httpImage/101115-f-stevegoldstein1ei-60p.jpg", "site_section": "http://www.northjersey.com/cmlink/arts-and-entertainment-rss.rss", "section_title": "Arts and Entertainment on NorthJersey.com", "url": "http://www.northjersey.com/arts-and-entertainment/movies/steve-carell-plays-teaneck-s-steven-goldstein-in-the-new-freeheld-1.1430153", "country": "US", "title": "Steve Carell plays Teaneck's Steven Goldstein in the new 'Freeheld'", "performance_score": 0, "site": "northjersey.com", "participants_count": 0, "title_full": "Steve Carell plays Teaneck's Steven Goldstein in the new 'Freeheld'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T08:21:00.000+03:00", "replies_count": 0, "uuid": "dbf18256f3e5406faf43645bd286a406a674c642"}, "author": "", "url": "http://www.northjersey.com/arts-and-entertainment/movies/steve-carell-plays-teaneck-s-steven-goldstein-in-the-new-freeheld-1.1430153", "ord_in_thread": 0, "title": "Steve Carell plays Teaneck's Steven Goldstein in the new 'Freeheld'", "locations": ["Teaneck", "VIRGINIA"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Steven Goldstein", "Carell", "Steve Carell"], "text": "Steve Carell plays Teaneck's Steven Goldstein in the new 'Freeheld' October 11, 2015 Last updated: Sunday, October 11, 2015, 1:21 AM By VIRGINIA ROHAN Pages: 1 2 > display on one page \nOn that day last November, Teaneck's Steven Goldstein had no intention of critiquing how Steve Carell was playing him in a scene being shot in Rye, N.Y., for the movie \"Freeheld.\" Goldstein had been told, after all, that nothing is more distracting for actors than having the real people they're playing offering unsolicited notes from the sidelines. Buy this photo amy newman/staff photographer Teaneck's Steven Goldstein,portrayed byactor Steve Carell, above right, in \"Freeheld,\" says the film took very few liberties with what really happened. \n\"I actually thought Steve Carell was doing a fine job as it was, so I wasn't going to say anything. But he came up to me and he said, 'So, Steven, am I doing you right?'\" Goldstein recalls over a coffee in Englewood, noting how he looked for a cue from the film's director and producer, who indicated he should share his thoughts. Buy this photo \n\"I said, 'Steve, you're actually more low-key than I am in real life. I'm just a little louder, a little gayer and a little more Jewish.' And as I told this to him, I could see he was watching me. I think the real reason Steve Carell wanted to have a conversation with me was not just to get my take, but to watch my body language, my hand gestures … It was so odd. I felt like the gay Jewish Henry Higgins from 'My Fair Lady.' \" \nThe many New Jerseyans who've grown accustomed to Goldstein's face and mannerisms because of his years as a high-profile political activist — in 2004, he founded Garden State Equality, which he ran until 2013 — might use the same word Goldstein does to describe watching Carell in \"Freeheld\": surrealistic. \nState Sen. Loretta Weinberg, D-Teaneck, who's so close to Goldstein she calls him \"my third child or, as we refer to him, my easiest birth,\" says that Carell's physical resemblance to Goldstein in the movie was uncanny — especially when the character was shot from behind. \"He looked exactly like Steven,\" Weinberg says. \"If I had the two of them in a lineup, I might not have been able to tell which was which.\" The film, like Cynthia Wade's same-named Oscar-winning 2007 documentary short, tells the true story of Laurel Hester, a police lieutenant with the Ocean County Prosecutor's Office who, terminally ill with lung cancer, spent the last year of her life fighting for the right to transfer her earned pension to her domestic partner, Stacie Andree. \nThe Ocean County freeholders repeatedly denied Hester's request. But Goldstein and Garden State Equality orchestrated a passionate and highly strategic advocacy campaign, which captured the media's attention and ultimately led to a victory for Hester on Jan. 25, 2006 — less than a month before she died at age 49. \n'Ideal story' \nGoldstein, a Columbia-educated lawyer and former television producer, is now an associate professor at Rutgers in Newark who teaches legislative advocacy at the law school and in the political science department on campus. In 2005, he was running Garden State Equality and studying at rabbinical school in Philadelphia when he learned of an Asbury Park Press article about Hester's plight. He instantly recognized it was the \"ideal story\" for his organization. \n\"Social change begins with touching people's hearts, and we searched far and wide across New Jersey for a story that would capture people's hearts,\" says Goldstein, who took an open-ended leave of absence from rabbinical school to work on Hester's case. \"And here's the deal, you can care deeply about somebody such as Laurel Hester and her partner, Stacie, yet also recognize at the same time that their story represents something bigger.\" \n\"Freeheld,\" which opens wide on Friday, is directed by Peter Sollett and stars Julianne Moore (as Hester), Ellen Page (as Andree), Michael Shannon (as Hester's devoted police partner, Dane Wells) and, of course, Carell, who in the movie wears yarmulkes, embroidered with \"Garden State Equality,\" from Goldstein's own collection. (Goldstein is not Orthodox; he wears his \"kippot\" in the workplace, he says, as \"a statement that I am proudly Jewish and proudly progressive.\") \nGoldstein has seen \"Freeheld\" six times and is thrilled with it, even though he has mixed feelings about a lack of nuance in the writing of his character. \n\"The movie depicts one side of me and depicts it quite accurately,\" Goldstein says. \"There's much more to my activism than that, but I think Steve Carell's performance is great. I think the movie is brilliant, frankly.\" \nWhen he first heard that Hollywood planned to make the documentary into \"a full-length movie with created dialogue,\" Goldstein was concerned, but now says, \"What has stunned me, much to my great pleasure, is that the new movie takes very few liberties with what happened. Yes, of course, there are certain plot devices that fictionalized films have, but there are not that many in 'Freeheld.' The movie absolutely captures the essence of the truth.\" \nGoldstein did not get paid for the use of his name and likeness, but he sat for a full day with screenwriter Ron Nyswaner, who also had access to \"hours upon hours\" of outtake footage not used in Wade's 38-minute documentary (in which Goldstein was much heavier; through diet and exercise, he has shed 100 pounds). And so, \"much of the dialogue that comes out of Steve Carell's mouth are things I really said at the time,\" Goldstein says. \nWhen, for example, someone in the film calls him \"Steve,\" he corrects him, saying, \"It's Steven, with a v, as in very gay.\" \n\"I actually say that a million times,\" says Goldstein, who, in fact, said that to this reporter the first time they spoke on the phone. \nOn the other hand, Carell's Goldstein has a habit of calling people \"Sweetie,\" and Goldstein says, \"I don't think I've ever called anyone \"Sweetie or \"Sweetheart\" in my life … So, that was hard to watch.\" \nThere was also a scene in which Goldstein's character says he's going to \"round up a bunch of people — gay grandmas, gay this, gay that.\" In reality, Goldstein says, \"What I would have said, and what I did say at the time, is, get me some straight grandmothers, straight rabbis, straight priests, because we're in Ocean County, New Jersey, arguably the most conservative part of the state.\" \nHis biggest quibble, though, is that the movie basically \"buried\" his intense behind-the-scenes lobbying — specifically, the deal he brokered (involving Gov.-elect Jon Corzine calling the freeholders to offer them a \"face-saving\" solution) that led to victory. \n\"Steven is shown as the over-the-top activist, as he is. But they did not show the planning, the strategic behind the scenes, much of the real thought processes that went along with what we saw as him going there and rabble-rousing and getting everybody riled up,\" says state Sen. Raymond Lesniak, D-Union, a strong advocate for gay rights, who has seen \"Freeheld\" three times and overall gives it high marks. \nA goal in mind  ", "external_links": [], "published": "2015-10-11T08:21:00.000+03:00", "crawled": "2015-10-11T08:36:50.564+03:00", "highlightTitle": ""}