{"organizations": [], "uuid": "c3b28300a9f618e1c32c9a29ec9e56a1160de9ee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "http://s4.reutersmedia.net/resources/r/?m=02&d=20151021&t=2&i=1088683582&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXNPEB9K12V", "site_section": "http://www.reuters.com/news/entertainment", "section_title": "Entertainment Industry &amp; Celebrity News | Reuters.com", "url": "http://www.reuters.com/article/2015/10/21/us-awards-oscars-chrisrock-idUSKCN0SF27B20151021", "country": "US", "title": "Comedian Chris Rock to host Oscars ceremony for second time", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Comedian Chris Rock to host Oscars ceremony for second time | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T20:03:00.000+03:00", "replies_count": 0, "uuid": "c3b28300a9f618e1c32c9a29ec9e56a1160de9ee"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/10/21/us-awards-oscars-chrisrock-idUSKCN0SF27B20151021", "ord_in_thread": 0, "title": "Comedian Chris Rock to host Oscars ceremony for second time", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES Comedian Chris Rock will host the 2016 Oscars ceremony in February, producers said on Wednesday, in his second stint at the helm of Hollywood's biggest night.\n\"Chris Rock is truly the MVP of the entertainment industry,” David Hill and Reginald Hudlin, who will produce the live telecast, said in a statement. \"Comedian, actor, writer, producer, director, documentarian - he’s done it all. He’s going to be a phenomenal Oscar host!\"\nRock, who hosted the 2005 Oscars telecast and has won four Emmy Awards, said in a statement, \"It's great to be back.\"\nRock, a stand-up comedian and former cast member of the long-running sketch comedy show \"Saturday Night Live,\" created and produced the TV sitcom \"Everybody Hates Chris,\" based on his own life, which ran from 2005 to 2009. His movie appearances include \"Lethal Weapon 4\" and \"The Longest Yard.\"\n\"Chris may be best known as a stand-up comic, but we think of him as a creative innovator in many other ways. He is unafraid in his artistry,\" Dawn Hudson, chief executive of the Academy of Motion Picture Arts and Sciences, said in a statement. “We couldn’t be happier to welcome him back to the Oscars.”\nLast year's Academy Awards telecast was hosted by television and Broadway star Neil Patrick Harris, who received mixed reviews. The U.S. television audience fell to its lowest level in six years, attracting some 36.6 million viewers.\nThe Academy Awards ceremony, which celebrates the best films, performances, writers and directors in the movie industry, will take place in Los Angeles on Feb. 28. Nominations will be announced in January.\nRecent previous Oscar hosts include Ellen DeGeneres, Jon Stewart, James Franco and Anne Hathaway, and Seth MacFarlane.\n(Reporting by Jill Serjeant ; Editing by Susan Heavey and Will Dunham )", "external_links": [], "published": "2015-10-21T20:03:00.000+03:00", "crawled": "2015-10-21T19:35:14.491+03:00", "highlightTitle": ""}