{"organizations": [], "uuid": "c4c7e95cdeb26e74971a9c6e09197787eda68fd2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wtvm.com", "main_image": "", "site_section": "http://www.wtvm.com/Global/category.asp?C=171888&clienttype=rss", "section_title": "WTVM - Entertainment - Headline", "url": "http://www.wtvm.com/story/30245254/report-playboy-to-end-publishing-fully-nude-female-photos", "country": "US", "title": "Report: Playboy to end publishing fully nude female photos", "performance_score": 0, "site": "wtvm.com", "participants_count": 0, "title_full": "Report: Playboy to end publishing fully nude female photos", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T10:16:00.000+03:00", "replies_count": 0, "uuid": "c4c7e95cdeb26e74971a9c6e09197787eda68fd2"}, "author": "", "url": "http://www.wtvm.com/story/30245254/report-playboy-to-end-publishing-fully-nude-female-photos", "ord_in_thread": 0, "title": "Report: Playboy to end publishing fully nude female photos", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Report: Playboy to end publishing fully nude female photos - WTVM.com-Columbus, GA News Weather & Sports Member Center: Contests Report: Playboy to end publishing fully nude female photos \nNEW YORK (AP) - Playboy will no longer publish photos of nude women as part of a redesign of the decades-old magazine, according to a news report Monday. \nExecutives for the magazine company told The New York Times that the change will take place in March 2016. \nThe paper reported that the print edition of Playboy will still feature women in provocative poses, but they will no longer be fully nude. \nPlayboy editor Cory Jones contacted founder and current editor in chief Hugh Hefner recently about dropping nude photos from the print edition and he agreed, the Times reported. \nThe change represents a major shift for the magazine, which broke new ground when Hefner created it and featured Marilyn Monroe on its debut cover in 1953. \nBut officials acknowledge that Playboy has been witnessing widespread changes. \"You're now one click away from every sex act imaginable for free. And so it's just passé at this juncture,\" said Scott Flanders, the company's chief executive. \nThe Times reported that playboy's print circulation, once measured in millions, is now about 800,000, according to Alliance for Audited Media. \nThe move marks the latest step away from depictions of full nudity, which were banned from the magazine's website last August. \nPrevious efforts to revamp Playboy have never quite stuck. But this time, as the magazine seeks to compete with younger outlets, Flanders said it sought to answer a key question: \"if you take nudity out, what's left?\" Copyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Report: Playboy to end publishing fully nude female photos A new report says Playboy will no longer publish photos of nude women as part of a redesign effort. More >> Playboy will no longer publish photos of nude women as part of a redesign of the decades-old magazine, according to a news report Monday. More >> California governor bans Redskins name at public schools Four California schools will be forced to change mascots after Gov. Jerry Brown signed legislation barring public schools from using the Redskins name for sports teams. More >> Four California high schools will be forced to change mascots after Gov. Jerry Brown signed legislation making the state the first to bar public schools from using the Redskins name for sports teams. More >> Evidence mounts for El Nino that could ease Calif. drought Evidence is mounting that the El Nino ocean-warming phenomenon in the Pacific will spawn a rainy winter in California, potentially easing the state's punishing drought but also bringing the risk of chaotic... More >> Evidence is mounting that the El Nino ocean-warming phenomenon in the Pacific will spawn a rainy winter in California, potentially easing the state's punishing drought but also bringing the risk of chaotic storms like... More >> Man gets weapon charge in fatal shooting of Memphis officer An off-duty Memphis police officer who died after being shot multiple times had been on the force for little more than a year and had a fiancee who is four months pregnant, authorities said. More >> Terence Olridge was heading to his job as a police officer when he and a neighbor were involved in an argument that escalated into a shootout in a normally quiet neighborhood in suburban Memphis, authorities said. More >> Judge: 16-year-old to be tried as adult in family stabbing A 16-year-old Oklahoma boy will stand trial as an adult in the stabbing deaths of his parents and three siblings, a judge ruled Monday, rejecting a request by defense attorneys to certify him as a juvenile... More >> A 16-year-old Oklahoma boy will stand trial as an adult in the stabbing deaths of his parents and three siblings, a judge ruled Monday, rejecting a request by defense attorneys to certify him as a juvenile delinquent or... More >>", "external_links": [], "published": "2015-10-13T10:16:00.000+03:00", "crawled": "2015-10-13T10:47:09.062+03:00", "highlightTitle": ""}