{"organizations": [], "uuid": "f9085f03b786608828ae5dd1171f20886f0617cb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48524/entertainment", "section_title": "Entertainment - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30325479/legacy-recordings-announces-limited-edition-vinyl-exclusives-for-record-store-days-annual-black-friday-event-friday-november-27-2015", "country": "US", "title": "Legacy Recordings Announces Limited Edition Vinyl Exclusives For Record Store Day's Annual Black Friday Event (Friday, November 27, 2015)", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Legacy Recordings Announces Limited Edition Vinyl Exclusives For Record Store Day's Annual Black Friday Event (Friday, November 27, 2015) - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "f9085f03b786608828ae5dd1171f20886f0617cb"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30325479/legacy-recordings-announces-limited-edition-vinyl-exclusives-for-record-store-days-annual-black-friday-event-friday-november-27-2015", "ord_in_thread": 0, "title": "Legacy Recordings Announces Limited Edition Vinyl Exclusives For Record Store Day's Annual Black Friday Event (Friday, November 27, 2015)", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Legacy Recordings\nNew Legacy Vinyl Collectibles include Releases by Earth Wind & Fire, the Isley Brothers, Johnny Cash, Judas Priest, Neil Hefti, OutKast, Stevie Ray Vaughan & Double Trouble, and Elvis Presley\nLegacy's RSD Black Friday 2015 Import Singles include Falco's \"Rock Me Amadeus\"/\"Vienna Calling\" and 35th Anniversary Edition of the Alan Parsons Project's \"Turn of a Friendly Card: The Singles\"\nVarious Artist 12\" Vinyl Releases include Garden State Soundtrack Album and 30th Anniversary Edition of Transformers Soundtrack\nNEW YORK , Oct. 22, Legacy Recordings , the catalog division of Sony Music Entertainment , announces the label's line-up of collectible 12\", 10\" and 7\" vinyl releases created especially for Record Store Day's Black Friday 2015, celebrated this year at the nation's independent record stores on Friday, November 27, 2015 .\nFor RSD Black Friday 2015, Legacy is catering to connoisseurs of classic sounds delivered old school, offering a range of RSD exclusives and numbered limited vinyl editions.\nLegacy's RSD Black Friday 2015 releases include these collectible titles:\nVarious - Transformers: The Movie Soundtrack - 12\" 2LP Etched Sides: A (Autobot) / D (Decepticon) in Transforming Package\nLeading Legacy's RSD Black Friday line-up this year is a 2LP 12\" vinyl 30th anniversary edition of Transformers: The Movie Soundtrack . In commemoration of the 1986 cinematic blockbuster, Legacy has created an innovative gatefold jacket that completely converts all four sides of the cover from an Autobot-themed jacket to a Decepticon-themed jacket. This 2LP collection is pressed on 150gram color vinyl: LP1 in translucent red with the Autobot logo etched on side A; LP2 in translucent purple with the Decepticon logo etched on side D. Remastered and re-imagined, Transformers: The Movie Soundtrack has never looked or sounded better!\nEarth, Wind & Fire - The Best of Earth, Wind & Fire, Vol. 1 - 12\" 1LP Vinyl Picture Disc The Best of Earth, Wind & Fire, Vol. 1 , EWF's monumental 1978 anthology, compiled the group's previously charting songs--including \"Shining Star,\" \"Sing a Song,\" \"Getaway\" and \"Fantasy\"--alongside new tracks including a cover of the Beatles' \"Got to Get You Into My Life\" (which won a Best Arrangement with Vocal Grammy for Maurice White ) and \"September,\" a song which became an EWF classic, hitting the Top 10 on both sides of the Atlantic. A Billboard Top 10, RIAA 5x platinum-selling album, The Best of Earth, Wind & Fire, Vol. 1 has been pressed as a collectible picture disc, featuring the iconic EWF gold coin logo plus a die-cut insert, especially for RSD 2015.\nThe Isley Brothers - Groove with You...LIVE! - 12\" 2LP Gold/Blue 180g Vinyl\nThe \"Great Lost Isley Brothers Album,\" Groove with You...LIVE! is a previously unreleased double album recorded for release in 1980. This newly restored performance offers an immersive listen into a crucial chapter in the Isley Brothers' history, a pivotal moment in the fusion of rock and funk music in an era fueled by the sound of the Isleys. The album includes the hits \"That Lady\" and \"Fight the Power\" plus fan favorites like \"Here We Go Again,\" \" Summer Breeze ,\" and \"Voyage to Atlantis.\" Featuring new cover art, evocative of the era, Groove with You...LIVE! is a 2LP set pressed on 180gram gold (LP1) and blue (LP2) vinyl, designed to look like a classic release from the Isley Brothers' T-Neck discography.\nJohnny Cash - Man In Black: Live in Denmark 1971 - 12\" 2LP Red/White 120g Vinyl\nAmerican musical icon Johnny Cash was at a career highpoint and in the middle of a successful tour of Scandinavia in 1971 when asked to star in his own concert special for Danish television. Lensed before a small audience on a small sound set, Man In Black: Live in Denmark 1971 captures the essence of a Johnny Cash show of the era, showcasing performances with his touring companions--the Tennessee Three (his backup band) June Carter Cash , the Carter Family, Carl Perkins , and the Statler Brothers--on a setlist of hits, classics and songs-of-the-day including \"If I Were a Carpenter\" ( Johnny Cash and June Carter Cash ), the song that won the couple the 1971 Grammy Award for Best Country Performance by a Duo or Group with Vocal. Previously commercially available only as a DVD (released in 2006), the audio portion of Johnny Cash's Man In Black: Live in Denmark 1971 can finally be enjoyed for the first time as a full-length album on RSD Black Friday 2015. This collectible 2LP set is pressed on 120gram opaque white (LP1) and red (LP2) vinyl (the colors of the flag of Denmark ).\nJudas Priest - \"Painkiller\" (25th Anniversary) - 10\" Die Cut Buzz Saw EP\nCommemorating the 25th anniversary of Painkiller . Legacy Recordings is releasing this 10\" die cut buzz saw EP, including the album's Grammy nominated title track, \"Painkiller\".\nNeil Hefti - \"Batman Theme\" / \"The Batusi\" - 7\" 45RPM Yellow Vinyl Single\nComposer Neil Hefti's iconic theme music from the 1960s live action television series, a runaway hit in 1966, coupled with \"The Batusi,\" a go-go dance parody of \"The Watusi,\" introduced on the \"Batman\" premiere episode, characterized by its signature move: making a horizontal V-sign with the index and middle fingers of both hands and crossing them in front one one's eyes. The \"Batman Theme\"/\"The Batusi\" single is pressed on opaque yellow vinyl in a newly designed picture sleeve inspired by the original graphics of the show.\nOutKast - Stankonia - 12\" 2LP Orange/Yellow/Purple Black Spatter - Edition Limited to 3,000 Numbered Copies\nA special 15th anniversary edition, limited to 3,000 numbered copies, of Stankonia , the fourth studio album by Atlanta's experimental hip-hop duo OutKast (André 3000 and Big Boi), is being released for RSD Black Friday 2015. An eclectic musical concoction blending elements of funk, gospel, techno, psychedelic rock into a heady Dirty South gumbo, Stankonia debuted at #2 on the Billboard 200, selling more than half a million copies in its first week. Featuring the hit singles \"B.O.B.,\" \"So Fresh, So Clean,\" and \"Ms. Jackson\" (the first OutKast single to reach #1 on the Billboard Hot 100), Stankonia took home the 2002 Grammy for Best Rap Album while \"Ms. Jackson\" won the Grammy for Best Rap Performance by a Duo or Group. Ranked #359 on Rolling Stone's 500 Greatest Albums of All Time, Stankonia stands as an undisputed hip-hop masterpiece and milestone.\nVarious - Garden State Soundtrack - 12\" 2LP Orange/Yellow/Ribbon Color Vinyl - Edition Limited to 3,000 Numbered Copies\nLegacy Recordings celebrates RSD Black Friday 2015 with this 2LP vinyl edition, limited to 3,000 numbered copies, of Garden State - Music From The Motion Picture , Originally released on August 10, 2004 , Garden State - Music From The Motion Picture featured songs, personally chosen by Zach Braff (the film's writer/director), which served as psychological and emotional touchstones in the movie. Since its release in '04, \"Garden State\" has achieved cult status as one of the era's definitive coming-of-age films, while the soundtrack set a platinum standard for alternative and indie rock compilations.\nBraff's work as the album's producer and musical curator earned the 2005 Grammy Award for Best Compilation Soundtrack Album for a Motion Picture, Television or Other Visual Media. Garden State - Music From The Motion Picture has sold more than 1.3 million copies and is certified platinum by the Recording Industry Association of American.\nStevie Ray Vaughan & Double Trouble - A Legend in the Making - 12\" 2LP White/Grey Vinyl\nRecorded on-stage at Toronto's legendary El Mocambo Club on July 20, 1983 , Stevie Ray Vaughan & Double Trouble's A Legend in the Making was originally released as a promotional title for radio broadcast only. This blistering live set was released for the first time commercially in 2014 as a bonus CD in The Complete Epic Recordings Collection boxset. RSD 2015 marks the first time that A Legend in the Making has ever been released on vinyl. This collectible edition includes 2LPs with LP1 struck on 180gram vinyl with LP1 pressed on opaque white and LP2 on gray.\nElvis Presley - \"If I Can Dream\" / \"Anything That's Part of You\" - 7\" 45RPM Black Vinyl\nPressed on classic black vinyl, this 45rpm single contains the title track from RCA/Legacy's forthcoming If I Can Dream album coupled with the previously unreleased \"Anything That's Part of You.\" Part of the ongoing Elvis 80th Birthday Celebration, If I Can Dream showcases Elvis Presley with the Royal Philharmonic Orchestra, the King of Rock & Roll at the peak of his powers.\nJimi Hendrix - Burning Desire - 12\" 2LP - First 5,000 Copies Numbered\nBurning Desire is a posthumous compilation of recordings by Jimi Hendrix including instrumental studio jams and demos recorded in late 1969 through early 1970. Originally released on Dagger Records, Burning Desire has never been released on vinyl (or sold as a CD in stores) prior to this new RSD Black Friday 2015 release. The first 5,000 copies of Burning Desire will be numbered.\nFalco - \"Rock Me Amadeus\" / \"Vienna Calling\" - 7\" 45RPM - IMPORT\nA special commemorative release celebrating the upcoming 30 anniversary of Falco's career-defining hit, \"Rock Me Amadeus\" features the song's American edit (#1 on the Billboard 100 in March 1986 ) couple with Falco's \"Vienna Calling\" (the 86er mix which peaked at #6 on the US Billboard charts in 1986). This RSD Black Friday 2015 IMPORT single is limited to 1,000 units in the US.\nAlan Parsons Project - The Turn of a Friendly Card: Single Edits - 7\" 45RPM - Limited Edition Green Vinyl - IMPORT\nA special limited edition 7\" vinyl release for RSD 2015, The Turn of a Friendly Card: Single Edits presents the rare single edits of three key tracks from the album--\"The Turn of a Friendly Card\" / \"Snake Eyes\" / \"Games People Play\"--in commemoration of the 35th anniversary of the APP's 1980 progressive rock masterpiece. Pressed on green vinyl, this special RSD Black Friday IMPORT is limited to sales of 1,000 units in the United States .\nNow in its eighth year, Record Store Day is an annual day-long celebration of record store culture taking place on the third Saturday in April, with an annual Black Friday event occurring the day after Thanksgiving . This year, RSD has named Dave Grohl as Record Store Day Ambassador 2015.\nwww.recordstoreday.com\n#RSDBF\nwww.legacyrecordings.com\nPhoto - http://photos.prnewswire.com/prnh/20151021/279344\nLogo - http://photos.prnewswire.com/prnh/20060130/LEGACYLOGO\n releases/legacy-recordings-announces-limited-edition-vinyl-exclusives-for-record-store-days-annual-black-friday-event-friday-november-27-2015-300164591.html\n ", "external_links": ["https://photos.prnewswire.com/prnvar/20151021/279344", "http://www.sonymusic.com/", "http://www.xmlnews.org/ns/", "http://photos.prnewswire.com/prnh/20060130/LEGACYLOGO", "http://photos.prnewswire.com/prnvar/20060130/LEGACYLOGO", "http://www.legacyrecordings.com/", "http://photos.prnewswire.com/prnh/20151021/279344", "http://rt.prnewswire.com/rt.gif?NewsItemId=NY35109&Transmission_Id=201510221002PR_NEWS_USPR_____NY35109&DateId=20151022", "http://www.prnewswire.com/news-releases/legacy-recordings-announces-limited-edition-vinyl-exclusives-for-record-store-days-annual-black-friday-event-friday-november-27-2015-300164591.html", "http://www.recordstoreday.com/"], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-22T17:35:55.526+03:00", "highlightTitle": ""}