{"organizations": ["Atkinson Country Club", "AP"], "uuid": "2f39e29a94502802448827b15ed6e05903a2d9fb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kptv.com", "main_image": "http://images.worldnow.com/AP/images/9099608_G.jpg", "site_section": "http://www.kptv.com/category/13540/entertainment?clienttype=rss", "section_title": "KPTV.com - Entertainment - Headline", "url": "http://www.kptv.com/story/30350333/trump-says-his-father-gave-him-a-small-1-million-loan", "country": "US", "title": "Trump says his father gave him a 'small' $1 million loan", "performance_score": 0, "site": "kptv.com", "participants_count": 0, "title_full": "Trump says his father gave him a 'small' $1 million loan", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T22:09:00.000+02:00", "replies_count": 0, "uuid": "2f39e29a94502802448827b15ed6e05903a2d9fb"}, "author": "", "url": "http://www.kptv.com/story/30350333/trump-says-his-father-gave-him-a-small-1-million-loan", "ord_in_thread": 0, "title": "Trump says his father gave him a 'small' $1 million loan", "locations": ["Atkinson", "N.H."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["JILL", "Donald Trump", "Trump", "Senter"], "text": "FOX 12 Studio Virtual Tour Trump says his father gave him a 'small' $1 million loan (AP Photo/Cheryl Senter). Republican presidential candidate Donald Trump autographs a book on his way out after speaking at a town hall meeting at the Atkinson Country Club in Atkinson, N.H., Monday, Oct. 26, 2015. (AP Photo/Cheryl Senter). Republican presidential candidate Donald Trump gestures while speaking at a town hall meeting at the Atkinson Country Club in Atkinson, N.H., Monday, Oct. 26, 2015. (AP Photo/Cheryl Senter). The crowd catches sight of Republican presidential candidate Donald Trump as he arrives for a town hall meeting at Atkinson Country Club in Atkinson, N.H., Monday, Oct. 26, 2015. By JILL COLVINAssociated Press \nATKINSON, N.H. (AP) - How about some humility, Donald Trump? \nAt a rare town hall event Monday for a man who goes for big rallies, some potential voters wanted to see a common touch from the tower-building billionaire in his quest for the 2016 Republican presidential nomination. \nHe said in reply that he ate at McDonald's on Sunday, often drives himself and got started in business with a \"small loan\" of $1 million from his dad. \nThe event, a televised town hall broadcast live on the \"Today\" show, brought together about 125 registered voters in a country club ballroom. The intimate environment was a rarity for the GOP front-runner, who has generally eschewed small events in favor of rallies drawing thousands of rowdy and loyal backers. \nWhile a handful of questions addressed Trump's policy positions, many focused on his persona as a brash TV entertainer and whether he possessed the ability to come back down to earth. \n\"I know a lot of people would really want to vote for you if only you would eat a piece of humble pie once in a while,\" said one woman, an undecided registered Republican, who asked Trump whether he had any weaknesses he might share. \n\"Well I'd like to do that,\" Trump responded, \"but then I'd expose the weaknesses to Putin and everybody else and we don't want to do that, right?\" He was referring to Russian President Vladimir Putin. \nAnother questioner, identified as an undecided Republican, asked Trump whether, with the exception of his family, he'd ever been told \"no.\" \n\"I mean, my whole life really has been a 'no,'\" Trump said. \"And I fought through it.\" Trump is the son of a successful real estate developer who gave him seed money to begin investing in Manhattan real estate. \n\"It has not been easy for me,\" Trump added. \"And I started off in Brooklyn, my father gave me a small loan of $1 million. I came into Manhattan and I had to pay him back, and I had to pay him back with interest.\" \nHost Matt Lauer quickly noted that most voters would not consider $1 million a small amount. \nUnlike 2012 GOP nominee Mitt Romney, Trump has fully embraced his wealth in the campaign trail, often bragging about his riches, to little ill effect. \nStill, Trump did show some signs of relatability in talking about his recent fast-food stop and his tendency to get behind the wheel. \nDuring a commercial break, Trump half-jokingly protested the fact that so many of the questioners were undecided. He said he wanted to hear from some backers. \nTrump was also pushed for more specifics. One attendee, a student at Saint Anselm College in nearby Manchester, said he felt that Trump's campaign has been \"based more on talking points than substance.\" \n\"Do you have a specific plan for how to bring our economy back, or should middle class voters just elect you because your name's Trump?\" the student asked. \nTrump was unapologetic. \n\"Well I think they should,\" he said, \"because I built a great company.\" \nMark Casey, a registered independent, pressed the candidate on how he would deal with world leaders. \n\"What would you say to people like me who have concern that you'll be dealing with a lot of world leaders you might not see eye-to-eye with, and you can't fire them?\" he asked. \"But you could start a war by calling them a loser or an idiot.\" \nTrump told Casey that he'd shown restraint throughout the campaign, an assertion bound to raise eyebrows from the political rivals who've been subjected to his zingers. He said he knows how to be politically correct when needed. \nCasey said afterward that Trump's answer was just what he was looking to hear. \n\"I think that's what the country needs,\" he said. Copyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-10-26T22:09:00.000+02:00", "crawled": "2015-10-26T22:14:44.411+02:00", "highlightTitle": ""}