{"organizations": [], "uuid": "f4b3ab8d3376be6ae9c38e590696a67164b4906d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.democratandchronicle.com", "main_image": "http://www.gannett-cdn.com/-mm-/b6e02bd5513855f67cfe8a1226b59db653283963/c=0-253-1280-976&amp;r=x633&amp;c=1200x630/local/-/media/2015/09/30/Rochester/Rochester/635792371101393175-Campbell.JPG", "site_section": "http://www.democratandchronicle.com/", "section_title": "Democrat and Chronicle | Rochester news, community, entertainment, yellow pages and classifieds. Serving Rochester, New York | democratandchronicle.com", "url": "http://www.democratandchronicle.com/story/news/2015/09/30/head-roc-future-focuses-family/73108640", "country": "US", "title": "Head of ROC the Future focuses on family", "performance_score": 0, "site": "democratandchronicle.com", "participants_count": 1, "title_full": "Head of ROC the Future focuses on family", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T04:15:00.000+03:00", "replies_count": 0, "uuid": "f4b3ab8d3376be6ae9c38e590696a67164b4906d"}, "author": "democratandchronicle.com", "url": "http://www.democratandchronicle.com/story/news/2015/09/30/head-roc-future-focuses-family/73108640", "ord_in_thread": 0, "title": "Head of ROC the Future focuses on family", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The new director of a local group that is trying to strengthen the cradle-to-career pipeline in the Rochester area is putting a priority on involving parents in their children's future. \"My focus will be to reach out to parents,\" said Jackie Campbell, who recently was hired to serve as alliance director of ROC the Future.\nCampbell appeared Wednesday with several members of this coalition before the Democrat and Chronicle editorial board.\nROC the Future, which was established four years ago, is an alliance of more than 50 Rochester area institutions, community groups and organizations, such as the Rochester school district, The Children's Institute and Monroe Community College.\nInitially, ROC the Future focused on increasing third-grade literacy, but now has become involved in various initiatives with other community groups and government.\nIts list of shared accomplishments include:\nHelped reduce chronic absenteeism by 10.7 percent in 13 targeted Rochester schools. Worked with community groups to develop more comprehensive screening of 3-year-olds. Helped devise the pilot program to increase summer reading by youths in the city. Advocated for successfully expanding by 25 percent summer learning opportunities for youths. Assisted in a 9 percent increase of students filling out college financial aid forms. ROC the Future's involvement in each initiative varied. In reducing chronic absenteeism, for example, it helped recruit volunteers who knocked on doors of parents whose children were truant.\nAnd its volunteers also helped the Rochester Education Foundation in assisting college applicants fill out the complicated federal financial assistance form.\nThe School Readiness Committee of ROC the Future was in the forefront of developing more comprehensive screening of 3-year-olds to identify potential learning problems.\n\"We are starting to see the needle move in key areas,\" said Larry Marx, who is a convener of ROC the Future and executive director of The Children's Agenda.\nCampbell had worked for the city of Rochester for 24 years and from 2010 to July 2014 served as assistant commissioner of youth services in the Department of Recreation and Youth Services.\nShe spent the past year as youth service manager in charge of the Rochester Public Library's Teen Central digital learning lab and literacy team.\nCampbell succeeded Leonard Brock as director of ROC the Future. He is now director of the Rochester-Monroe Anti-Poverty Initiative.\nShe said that her experience in working with parents should help her in her new job.\n\"We have done a really bad job with parents,\" said Campbell. \"We are partners with them.\"\nSince ROC the Future has only a staff of two and annual budget of about $200,000, it is all the more important that it focus on working with other community groups and forming alliances.\nWhile members of the coalition told how ROC the Future has been busy in its various initiatives, they expect to be more public in the future.\nAfter the release of its State of Our Children Report Card on Oct. 16, ROC the Future will be doing more community outreach and come up with a set of goals to help improve children's academic outcomes, said Marx.\n.JGOODMAN@Gannett.com", "external_links": [], "published": "2015-10-01T04:15:00.000+03:00", "crawled": "2015-10-01T12:03:34.879+03:00", "highlightTitle": ""}