{"organizations": [], "uuid": "a34fbd227e15dc9941f70a920aa6679fc8a9b4e3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/10/20/13034828/9781681394756_Ebook-2000-e1443639460554.jpg", "site_section": "http://www.prweb.com/rss2/artbooks.xml", "section_title": "Arts &amp; Entertainment: Books", "url": "http://www.prweb.com/releases/2015/10/prweb13034828.htm", "country": "US", "title": "Reani King’s New Book “The Many Adventures Of Cutie Patooty And The Fairy Princess” is a Vivid and Exciting Tale", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Reani King’s New Book “The Many Adventures Of Cutie Patooty And The Fairy Princess” is a Vivid and Exciting Tale", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T02:00:00.000+02:00", "replies_count": 0, "uuid": "a34fbd227e15dc9941f70a920aa6679fc8a9b4e3"}, "author": "Mitzi McKenzie", "url": "http://www.prweb.com/releases/2015/10/prweb13034828.htm", "ord_in_thread": 0, "title": "Reani King’s New Book “The Many Adventures Of Cutie Patooty And The Fairy Princess” is a Vivid and Exciting Tale", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Reani King, a wife, mother, and native Texan, has completed her new book “The Many Adventures Of Cutie Patooty And The Fairy Princess”: a gripping and poignant tale of adventure for young readers. When asked to describe the book, King stated “This book is first and foremost a leisure read; however, it is also about family, diversity, and the seemingly unlikely places friends are found.”\nPublished by New York City-based Page Publishing, Reani King’s poignant tale is sure to entertain any and all young readers. This colorful story is filled with excitement, uncertainty, and affection.\n“The Many Adventures of Cutie Patooty and the Fairy Princess” is a series of stories that shows the unlikely relationship between a royal fairy and a dragonfly. The two companions go on adventures and learn things about one another, their families, and their surroundings.\nThis book is the first installment of the adventures of these characters. There is an element of suspense and surprise in each one of the stories. After all, what is an adventure without suspense. The adventures take the reader through the first meeting between Cutie Patooty and Tory Rose, the dangers of a thunderstorm, the introduction to a library, and a royal party inside Cedar Tree.\nReaders who wish to experience this cheerful work can purchase “The Many Adventures Of Cutie Patooty And The Fairy Princess” at bookstores everywhere, or online at the Apple iTunes store, Amazon, Google Play or Barnes and Noble.\nFor additional information or media inquiries, contact Page Publishing at 866-315-2708.\nAbout Page Publishing\nPage Publishing is a traditional New York based full-service publishing house that handles all of the intricacies involved in publishing its authors’ books, including distribution in the world’s largest retail outlets and royalty generation. Page Publishing knows that authors need to be free to create - not bogged down with complicated business issues like eBook conversion, establishing wholesale accounts, insurance, shipping, taxes and the like. Its roster of authors can leave behind these tedious, complex and time consuming issues, and focus on their passion: writing and creating. Learn more at http://www.pagepublishing.com .", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5wYWdlcHVibGlzaGluZy5jb20vcG9ydGZvbGlvLXZpZXcvdGhlLW1hbnktYWR2ZW50dXJlcy1vZi1jdXRpZS1wYXRvb3R5LWFuZC10aGUtZmFpcnktcHJpbmNlc3Mv", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5wYWdlcHVibGlzaGluZy5jb20="], "published": "2015-10-26T02:00:00.000+02:00", "crawled": "2015-10-26T09:18:53.026+02:00", "highlightTitle": ""}