{"organizations": [], "uuid": "b7eb6cc5dae7ad82593b6f1820d70e554c89de7d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.aceshowbiz.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Aceshowbizcom-EntertainmentNews", "section_title": "Aceshowbiz.com - Entertainment News", "url": "http://www.aceshowbiz.com/news/view/00089463.html", "country": "US", "title": "'Terminator' Franchise Is in Process of Readjustment", "performance_score": 0, "site": "aceshowbiz.com", "participants_count": 1, "title_full": "'Terminator' Franchise Is in Process of Readjustment", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T11:20:00.000+03:00", "replies_count": 0, "uuid": "b7eb6cc5dae7ad82593b6f1820d70e554c89de7d"}, "author": "AceShowbiz.com", "url": "http://www.aceshowbiz.com/news/view/00089463.html", "ord_in_thread": 0, "title": "'Terminator' Franchise Is in Process of Readjustment", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments Skydance Media Chief Creative Officer Dana Goldberg said that future installments of 'Terminator' movie series were not on hold, but they're in the stage of readjustment. \nWith \" Terminator Genisys \" earning a disappointing number at domestic box office, people started to wonder about the existence of the already-planned sequels. Latest report claimed that the follow-up movies had been on hold, but Skydance Media Chief Creative Officer Dana Goldberg recently said that the sequels were in the stage of readjustment. While attending TheWrap's 6th Annual Media Leadership Conference TheGrill on Tuesday, October 6, Goldberg was asked about the future of \"Terminator\" movie franchise. \"I wouldn't say on hold, so much as readjusting,\" she answered. Goldberd hinted that the movies would not start production anytime soon, despite the fact that they already set a May 2017 release for the sequel to \"Genisys\". \"We are not going to begin production at the beginning of next year,\" she said. Goldberg went on talking about continuing the saga. \"At Skydance, when we talk movies, we talk universes, even more than franchises. So the idea of a 'Terminator' TV show fits into that universe. All the steps have to be taken in unison,\" she said. She promised fans that the time-traveling cyborgs would be back and the team behind the franchise would do the best to make more \"Terminator\" films. She hinted that the plan was to use \"data and research to do a worldwide study and really talk to audiences about what they loved, and what maybe didn't work for them, so that the next we take with the franchise is the right one.\" \"Terminator Genysis\" grossed just $89 million in domestic box office. It earned $350 million internationally for a global total of $440 million. \n© AceShowbiz.com Warning : mysql_num_rows() expects parameter 1 to be resource, boolean given in /home/aceshow/public_html/php/bs_nview.php on line 567 More Terminator Genisys News", "external_links": [], "published": "2015-10-08T11:20:00.000+03:00", "crawled": "2015-10-08T21:34:07.979+03:00", "highlightTitle": ""}