{"organizations": ["Rowenta Intense Pure Air"], "uuid": "9ce8d932c2cf39477c785b8fff918767510c131e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wtsp.com", "main_image": "http://www.gannett-cdn.com/-mm-/489efad1142179deef9ce5ef3cf126cd99e1a3f1/r=x633&amp;c=1200x630/http/cdn.tegna-tv.com/-mm-/9324be96a121bd20abb5c359923dc535db62ceca/c=0-6-288-169/local/-/media/2015/10/05/WTSP/WTSP/635796273348900146-btb-rowenta.jpg", "site_section": "http://rssfeeds.wtsp.com/_/20/109690310/wtsp/entertainmentnews", "section_title": "WTSP - Entertainment", "url": "http://www.wtsp.com/story/entertainment/2015/10/05/stlbtbsafety/73365780/", "country": "US", "title": "Priceless products that promote family wellness and safety in our unpredictable lives", "performance_score": 0, "site": "wtsp.com", "participants_count": 0, "title_full": "Priceless products that promote family wellness and safety in our unpredictable lives", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T14:37:00.000+03:00", "replies_count": 0, "uuid": "9ce8d932c2cf39477c785b8fff918767510c131e"}, "author": "", "url": "http://www.wtsp.com/story/entertainment/2015/10/05/stlbtbsafety/73365780/", "ord_in_thread": 0, "title": "Priceless products that promote family wellness and safety in our unpredictable lives", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["David Gregg"], "text": "Priceless products that promote family wellness and safety in our unpredictable lives Great product ideas from BehindTheBuy.com Senior Editor David Gregg. Post to Facebook Priceless products that promote family wellness and safety in our unpredictable lives Great product ideas from BehindTheBuy.com Senior Editor David Gregg. Check out this story on wtsp.com: http://on.wtsp.com/1Rqw0XA Cancel Send A link has been sent to your friend's email address. Posted! A link has been posted to your Facebook feed. Join the Conversation To find out more about Facebook commenting please read the Conversation Guidelines and FAQs Priceless products that promote family wellness and safety in our unpredictable lives 8:02 a.m. EDT October 5, 2015 Great product ideas from BehindTheBuy.com Senior Editor David Gregg. Rowenta Intense Pure Air CONNECT TWEET LINKEDIN COMMENT EMAIL MORE \nRowenta Intense Pure Air \nRowenta just launched the Intense Pure Air – the first and ONLY air purifier to filter 99.97% of pollutants and permanently capture and destroy formaldehyde - a highly toxic chemical compound found in 100% of homes and is linked to cancer, neurological diseases like ALS, birth defects, miscarriages, and more. \nThe Intense Pure Air offers four levels of filtration (most other air purifiers only offer three) – 1) pre filter for dust, animal hair; 2) active carbon filter for odors, smoke and VOCs; 3) True HEPA filter for fine dust like pollen, dust mites, etc. and 4) Patented Nano Captur Filter to trap and permanently destroy formaldehyde, which turns from yellow to dark red as it becomes more saturated. \nThe Intense Pure Air will better safeguard any home by combating household toxins and allergens, including VOCs, mold spores, dust mites, pollen, animal hair and formaldehyde, as the majority of today's home are highly insulated and practically air tight, making indoor air 5x more polluted than outdoor air. \nProduct features include smart pollution sensors with automatic filtration regulation, a timer for 1-8 hours, and three modes of operation (auto, night, manual). \nThe Intense Pure Air comes in two sizes – \"Bedroom,\" purifying up to 400 sq. ft. and retailing for $299 and \"XL Room,\" purifying up to 835 sq. ft. and retailing for $399. \nWEBSITE: www.rowentausa.com \nairweave Portable DUAL MODE Team USA Model \nairweave is a premium bedding topper created with innovative Japanese technology that helps create the best quality sleep possible. airweave premium toppers are made by weaving together three-dimensional resin fibers; this highly resilient material responds to your body and weight when you move, allowing you to turn over easily while sleep. With 90% of the core material being air, airweave helps dissipate heat and moisture generated by the body during sleep; it keeps users cool in the summer and warm in the winter. airweave carries a full size range of bedding toppers for mattresses and futons and all covers are machine-washable. \nAirweave has partnered with the US Olympic Committee and a is a proud sponsor of Team USA, supporting American athletes by improving their quality sleep. This DUAL MODE portable, Team USA model is their first product collaboration with the USOC leading up to the Rio 2016 Olympic Games. \nairweave has numerous affiliations with professional athletes around the world, including Two-Time Masters Champion Bubba Watson, Olympic Gold Medalist Ice Dancers Meryl Davis & Charlie White, as well as outfits high end hotels and airlines across the globe. \nWEBSITE: www.airweave.com \nIncipio Performance Series Cases for iPhone 6S and 6S Plus \nThe new Incipio Performance Series of cases for the latest iPhones offer device protection at every level. Committed to defending your smartphone against drops, the Incipio Performance Series offers 5 Levels of cases that allows customers to choose their desired level of protection for their new iPhone. Ranging from a sleek single layer, Level 1 case to an ultra-rugged, Level 5 case - With each level, another layer of superior drop protection is added. \nOffered in a range of color combinations, the Incipio Performance Series for iPhone 6S and iPhone 6S Plus provide intelligent drop protection, no matter what level you choose! \nAvailable at incipio.com and in select retailers nationwide on October 15th. \nPrices range from $24.99 to $49.99. \nWEBSITE: www.incipio.com \nOoma Telo - The Smart Phone For Your Home \nOoma uses your high-speed Internet and regular home phone to give you crystal-clear nationwide calling, FOR FREE! After purchasing the Ooma Telo device, you pay only applicable taxes and fees (about $4 a month) and get all the features you would expect in a phone service including voicemail, call-waiting and caller-ID. 911 Alerts are also included with basic service – get notified the moment 911 is called from your Ooma number. \nCall quality and reliability is amazing thanks to Ooma's propriety PureVoice HD technology. In fact, Ooma was ranked as the #1 home phone service for the fifth year in a row by readers Consumer Reports (2010, 2011, 2012, 2013, and 2014)! \nOoma Telo's newest feature, introduced within the last year, is its integration with Nest devices to enable a truly connected home and position Ooma as a key player in the emerging smart home market. Customers now have the option to integrate their phone with Nest devices to monitor the home while users are away. More than a product feature, Ooma Telo's Nest integration enhances the power of Nest devices: \n• Ooma Telo automatically forwards home phone calls to mobile when Nest is in \"away mode\" and restores incoming calls when users return \n• When the Nest smoke and CO alarm is triggered, Ooma can call designated mobile phones and connect users with the emergency services local to the home. Ooma Telo passes the home address along with the call, allowing emergency personnel to respond more quickly \n• Occupancy sensors in Nest can detect when people arrive home. If events are not detected within a specified window of time, Ooma Telo alerts the user. \nOoma Telo ($129.99) is available at leading retailers and online destinations, including Amazon, Best Buy, Walmart and Office Depot and Office Max.", "external_links": [], "published": "2015-10-05T14:37:00.000+03:00", "crawled": "2015-10-05T15:18:30.440+03:00", "highlightTitle": ""}