{"organizations": ["Basketball", "Los Angeles Clippers", "People Basketball"], "uuid": "b9088987e3200f52c34c9ab492337aa9e98bf3ec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "http://s2.reutersmedia.net/resources/r/?m=02&d=20151015&t=2&i=1087194093&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXNPEB9E0NG", "site_section": "http://uk.mobile.reuters.com/reuters/rss/ENTUK.xml", "section_title": "Reuters: Entertainment News", "url": "http://uk.reuters.com/article/2015/10/15/us-people-lamarodom-idUKKCN0S91HC20151015?feedType=RSS&feedName=entertainmentNews", "country": "US", "title": "Basketball star Lamar Odom on life support for second day as friends, family rally", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "Basketball star Lamar Odom on life support for second day as friends, family rally", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T15:28:00.000+03:00", "replies_count": 0, "uuid": "b9088987e3200f52c34c9ab492337aa9e98bf3ec"}, "author": "", "url": "http://uk.reuters.com/article/2015/10/15/us-people-lamarodom-idUKKCN0S91HC20151015?feedType=RSS&feedName=entertainmentNews", "ord_in_thread": 0, "title": "Basketball star Lamar Odom on life support for second day as friends, family rally", "locations": ["California", "Los Angeles"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Lamar Odom"], "text": "Related: Entertainment, People Basketball star Lamar Odom on life support for second day as friends, family rally Basketball player Lamar Odom speaks at a news conference announcing his acquisition by the Los Angeles Clippers in Los Angeles, California in this July 2, 2012 file photo. Reuters/Mario Anzuoni/Files \nFormer pro basketball player and reality TV star Lamar Odom was reportedly on life support for a second day on Thursday after falling unconscious at a Nevada brothel, as friends and family rushed to his bedside and asked fans to pray for his recovery. \nOdom, 35, the estranged husband of reality TV star Khloe Kardashian, on Tuesday was found unresponsive at Love Ranch, a legal brothel in Crystal, Nevada, by employees who said he had used cocaine and a sexual performance-enhancing supplement, according to the Nye County sheriff. \nOdom was rushed to the Sunrise Hospital & Medical Center in Las Vegas, which has declined to comment his condition, citing patient confidentiality. \nMedia reports, citing unnamed sources, said doctors believe Odom might have suffered an accidental overdose and a stroke. \nThe Rev. Jesse Jackson, a friend of Odom's, visited him on Wednesday and said he remained in a coma. \n\"He is in a real difficult situation,\" Jackson told reporters. \"We can only at this time pray for his recovery,\" he said. \nKardashian was by his side along with friends and family, Jackson said. \nOdom's two children from a previous relationship were also with their father, according to E!, a celebrity website and cable television channel. \nIn a news conference on Wednesday, Nye County Sheriff Sharon Wehrly said authorities received an emergency call from panicked brothel staff, reporting that Odom was unconscious and had blood and a white substance coming from his nose and mouth. \nThe staff told authorities that Odom had used cocaine. \n\"They confirmed his usage on Saturday but were unsure if it had continued,\" Wehrly said. \nThe callers said Odom had taken as many as 10 tablets of a herbal sexual enhancement supplement, Wehrly said. \nLove Ranch owner Dennis Hof said during Odom's three-day stay he had taken large amounts of \"herbal Viagra,\" a non-prescription product which can dramatically lower blood pressure and interact with other medications. \nThe former basketball star has been rumored to have struggled with drug use. \nHe split with Kardashian in 2013. Their courtship, wedding and four-year marriage was captured in the television series, \"Keeping Up With the Kardashians\" and its spinoff, \"Khloe and Lamar.\" \nAccording to E!, which airs the popular Kardashian reality series, the couple signed divorce papers in July but are still legally married until a judge approves them. \nA toxicology report on Odom was not complete, the sheriff's office said on Wednesday. \nKardashian's mother, Kris Jenner, posted a photo of Odom in his Lakers uniform on her Instagram account late Wednesday, asking fans to \"please pray for Lamar #ourfighter.\" \n(Reporting by Victoria Cavaliere Editing by Suzannah Gonzales and Jeffrey Benkoe) \nOur top photos from the last 24 hours. Slideshow Trending On Reuters", "external_links": [], "published": "2015-10-15T15:28:00.000+03:00", "crawled": "2015-10-15T17:36:40.904+03:00", "highlightTitle": ""}