{"organizations": [], "uuid": "146f5b1ee57f7b5b78f7e6ed10746cbab55476c3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.flossmagazine.com", "main_image": "http://i1.wp.com/www.flossmagazine.com/wp-content/uploads/2015/10/Global-Spin.jpg?resize=211%2C115", "site_section": "http://www.flossmagazine.com/feed/rss/", "section_title": "FLOSS MAGAZINE | ENTERTAINMENT |FASHION | NEWS | CELEBRITY", "url": "http://www.flossmagazine.com/swizz-beatz-named-the-host-of-the-fourth-annual-global-spin-awards/", "country": "US", "title": "Swizz Beatz Named The Host Of The Fourth Annual Global Spin Awards", "performance_score": 0, "site": "flossmagazine.com", "participants_count": 1, "title_full": "Swizz Beatz Named The Host Of The Fourth Annual Global Spin Awards", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T22:21:00.000+03:00", "replies_count": 0, "uuid": "146f5b1ee57f7b5b78f7e6ed10746cbab55476c3"}, "author": "Editorial Dept", "url": "http://www.flossmagazine.com/swizz-beatz-named-the-host-of-the-fourth-annual-global-spin-awards/", "ord_in_thread": 0, "title": "Swizz Beatz Named The Host Of The Fourth Annual Global Spin Awards", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Home / Entertainment / Swizz Beatz Named The Host Of The Fourth Annual Global Spin Awards Swizz Beatz Named The Host Of The Fourth Annual Global Spin Awards By Editorial Dept on October 9, 2015 @FLOSSMagazine 1 share \n0 comments \nThe Global Spin Awards (GSA) , an award show that honors the most dynamic and talented DJ’s around the world, both past and present, named recording artist and global entrepreneur, Swizz Beatz, as the official host of this year’s prestigious event. Nominees and categories for the 2015 GSA, a property of Power Moves Inc., were also announced reflecting an eclectic mix of music’s heavy hitters over the past year. The announcement was made exclusively at the nationally-syndicated, award-winning “The Breakfast Club” radio show, which airs on the REVOLT television network. \n\n“The Global Spin Awards has quickly grown into a movement that celebrates and recognizes the enormous contributions DJs have made to both the music and entertainment industries,” said Shawn Prez, Founder of the Global Spin Awards. “DJs are not only the gatekeepers to what’s next in music but they are at the forefront of culture, serving as the tastemakers for our generation and generations to come. They are the driving force and influencers that impact diverse audiences globally and across various genres. We are honored to have Swizz Beatz host this year’s GSA and know that his unique expertise will allow him to set the shows tone and easily connect with his peers to the fans at home.” \n\nCategories include DJ’s and producers from all regions, spanning all genres. Highlights of this year’s nominees are DJ Mustard, DJ Envy, and DJ Skrillex . DJ Khaled and Diplo were among the few nominated for the producer category, while DJ Esco and DJ Clue were among the few nominated for mixtape of the year. Jermaine Dupri, Lil Jon, DJ Daddy Kat (Wiz Khalifa) and Paris Hilton were nominated for top celebrity DJ’s while top album nominees included Calvin Harris and Funkmaster Flex to name a few. \n\n“I am thrilled to host this year’s fourth annual Global Spin Awards,” said Swizz Beatz. “This award show gives talented DJs the overdue recognition they deserve. Every individual that has been nominated contributes to the culture and more importantly, the music. I am honored to serve as the host of the fourth annual award show and be a part of this universal team of phenomenal DJs.” \n\nThe official award show will be held on November 17 th at the Best Buy Theatre in New York, where the nominees will join each other in celebrating their work and the growth of the industry. GSA has grown into a weekend long celebration complete with a DJ Technology and Lifestyle Expo and Finale of the McDonald’s Flavor Battle. Each event will give the public an opportunity to interact, learn and be entertained by some of the world’s greatest DJs, while getting an exclusive look at upcoming equipment and products. \n\nLast year’s show was hosted by Lala Anthony and attended by some of the industry’s biggest entertainers including Sean “Diddy” Combs, Ne-Yo, and DJ Khaled . Previous winners of the 2014 Global Spin Awards include: DJ Mustard (DJ of the Year); Jermaine Dupri (Celebrity DJ of the Year); and Diplo (EDM DJ of the Year). \nRelated", "external_links": [], "published": "2015-10-09T22:21:00.000+03:00", "crawled": "2015-10-09T22:54:21.891+03:00", "highlightTitle": ""}