{"organizations": [], "uuid": "eefaa1e8b9f5458f6144519c0fefeabdaefb03c1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.gympietimes.com.au", "main_image": "http://media.apnarm.net.au/img/media/images/2015/09/30/9-2980577-scn300915todayshowza_fct695x521x127.0_ct300x300.jpg", "site_section": "http://feeds2.feedburner.com/GympietimescomauTv", "section_title": "gympietimes.com.au: entertainment tv stories", "url": "http://www.gympietimes.com.au/news/today-show-receives-a-red-carpet-welcome/2792737/", "country": "AU", "title": "Today Show broadcast live from Moffat Beach this morning", "performance_score": 0, "site": "gympietimes.com.au", "participants_count": 0, "title_full": "Today Show broadcast live from Moffat Beach this morning", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T17:00:00.000+03:00", "replies_count": 0, "uuid": "eefaa1e8b9f5458f6144519c0fefeabdaefb03c1"}, "author": "", "url": "http://www.gympietimes.com.au/news/today-show-receives-a-red-carpet-welcome/2792737/", "ord_in_thread": 0, "title": "Today Show broadcast live from Moffat Beach this morning", "locations": ["Moffat Beach"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kathy Sundstrom"], "text": "Today Show broadcast live from Moffat Beach this morning Kathy Sundstrom | 1st Oct 2015 5:00 AM Updated: 8:58 AM Kathy Sundstrom Cars For Sale \nUPDATE 9AM \nMAYOR Mark Jamieson and Lisa Curry have welcomed hosts of The Today Show, Karl Stefanovic and Lisa Wilkinson to the Sunshine Coast. \nThe pair shared their views on the Sunshine Coast with the hosts. Love you Karl and Lisa... Welcome to my home here on the beautiful Sunshine Coast @karlstefanovic @TheTodayShow pic.twitter.com/NEGHBdienV — Lisa Curry AO (@LisaCurry_) September 30, 2015 \nLocal music duo, hoo8hoo, made up of Tim and Sam Aitken also performed for the live broadcast and hundreds of locals down at Caloundra. — The Today Show (@TheTodayShow) September 30, 2015 \n\nUPDATE 8.15AM \nDICKIE'S Double Dip proved popular with residents down at the live broadcast of The Today Show at Moffat Beach this morning. \nLucky participants picked out ping pong balls for their chance to win some cash. The crowd is going nuts for Dickie's balls! #Today9 pic.twitter.com/QArZVPtFwZ — The Today Show (@TheTodayShow) September 30, 2015 \nParents were more than happy to receive their winnings after their kids drew out the balls. \nUPDATE 8AM: \nMALENY Dairies cows Millie and Kaylee have made their television debut on The Today Show. \nTour cows Millie and Kaylee awaiting their TV debut on the Today Show Australia this morning down here at Moffat Beach... Posted by Maleny Dairies on Wednesday, 30 September 2015 \nHosts Karl Stefanovic and Lisa Wilkinson competed in a milk-off with the Sunshine Coast cows. \nWhile Lisa got off to a shakey start, Karl coaxed his cow into providing some milk and took the win. \"I think that worked out quite well\" Karl #Today9 pic.twitter.com/Tiu66bHIMv — The Today Show (@TheTodayShow) September 30, 2015 \n\nUPDATE 6AM: \nLOCALS have flocked to Moffat Beach to greet the stars from The Today Show this morning. \nHosts Karl Stefanovic and Lisa Wilkinson watched the sun rise over the water before fans joined them in Caloundra. Good morning to you from Moffat Beach! #Today9 pic.twitter.com/q0XvAHvdp2 — The Today Show (@TheTodayShow) September 30, 2015 \nKarl and Richard Wilkins couldn't believe how many fans had joined them. Reader poll Do you think The Today Show broadcast was good for tourism? Yes, the nation saw the best the Sunshine Coast has to offer. No, it was too corny. I don't think it will make much difference. \n\"What a beautiful crowd we've got here,\" Karl said. \n\"I can't believe how many people were here as we went to air,\" Richard said. \nRichard also appreciated the love some residents had specifically for him. — The Today Show (@TheTodayShow) September 30, 2015 \nRichard promptly found the granny in question. There she is! Such an awesome crowd this morning! @RichardWilkins loving it! We Love Sunshine Coast! #Today9 pic.twitter.com/BNzG8jQtRQ — The Today Show (@TheTodayShow) September 30, 2015 \nHe also spent some time with the nippers from Dicky Beach Surf Life Saving Club. Lol! @RichardWilkins loves this surf club, wonder why?! #Today9 pic.twitter.com/FxIthGzPAu — The Today Show (@TheTodayShow) September 30, 2015 \nSunshine Coast Council was also impressed with the hundreds of Sunshine Coasters who turned out to make the show welcome. The cameras are rolling for @TheTodayShow . #SunshineCoast is putting on an awesome welcome. pic.twitter.com/dOR31ZQuqo — SunshineCoastCouncil (@CouncilSCC) September 30, 2015 \nEARLIER: \nTHE eyes of 350,000 people will be on the Sunshine Coast this morning as Karl Stefanovic and Lisa Wilkinson broadcast their popular morning television show live from Moffat Beach. Karl Stefanovic arrives at Sunshine Coast airport all kitted up. john mccutcheon \nOne only hopes that Karl has changed from the short black Adidas running shorts and slightly small sandals and cowboy hat he wore when arriving to a red carpet at the Sunshine Coast Airport. \nThe blue suit Karl wore every morning for an entire year was gone, he said it was \"packed away\" as he embraced the \"warmest welcome from anywhere in the world\". Lisa also appeared amazed as she walked along the carpet to the tunes of the Shake it Up music band. SUPERSTAR WELCOME: Nine's breakfast show hosts Karl Stefanovic and Lisa Wilkinson arrive at Sunshine Coast Airport. john mccutcheon \nBoth television personalities took the time to be photographed with the young band members and their family in the airport welcome lounge. \nKarl and Lisa were gracious enough to be interviewed twice after problems with audio on the tarmac. \nThey were thrilled to be showcasing the Sunshine Coast for their \"We love Australia Tour\". \nFor Karl, a visit to the region has been a long time coming. \n\"I've been here for 60 Minutes interviews, but it's probably been about 15 to 20 years since I spent the night,\" he said. \nLisa, on the other hand, is a familiar face. \n\"I spent my honeymoon here (to media personality Pete FitzSimons),\" she said. \n\"I try to come back at least once a year.\" \nKarl was hoping to take in a kite surf yesterday afternoon, but with storm clouds brewing and his skills sorely lacking, he admitted it probably wouldn't happen. \nHe was looking forward to enjoying the food from our restaurants and \"catching up with locals\". \n\"The best part of what we do is promoting parts of Australia to Australians,\" he said. \nHe was impressed with how \"green\" the Sunshine Coast was from the air. \nBut then again, he had just travelled from drought-stricken Longreach. \nKarl and Lisa were also challenged with the task of milking a cow from Maleny Dairy in the Hinterland to the beach for an on-air milking session, while Spicers Clovelly chef Cameron Matthews used the best Mooloolaba seafood to cook up a distinctively local breakfast barbecue. The Today Show will be broadcast from 5.30am at Moffat Beach. entertainment", "external_links": [], "published": "2015-09-30T17:00:00.000+03:00", "crawled": "2015-10-01T02:23:20.083+03:00", "highlightTitle": ""}