{"organizations": [], "uuid": "32275255b81931f951682552a3d9332fcbdcf1e5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "entertainment.ie", "main_image": "http://images.entertainment.ie/images_content/rectangle/620x372/ed2015917958705.png", "site_section": "http://entertainment.ie/life", "section_title": "Life photo galleries premieres interviews videos rumours news stories - entertainment.ie ", "url": "http://entertainment.ie/music/news/Ed-Sheeran-says-he-always-goes-on-the-lash-before-big-gigs-because-he-plays-better-hungover/372028.htm", "country": "IE", "title": "MusicNews | Ed Sheeran says he always goes on the lash before big gigs because he plays better hungover", "performance_score": 0, "site": "entertainment.ie", "participants_count": 1, "title_full": "MusicNews | Ed Sheeran says he always goes on the lash before big gigs because he plays better hungover - entertainment.ie", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T22:02:00.000+03:00", "replies_count": 0, "uuid": "32275255b81931f951682552a3d9332fcbdcf1e5"}, "author": "Lauren Murphy", "url": "http://entertainment.ie/music/news/Ed-Sheeran-says-he-always-goes-on-the-lash-before-big-gigs-because-he-plays-better-hungover/372028.htm", "ord_in_thread": 0, "title": "MusicNews | Ed Sheeran says he always goes on the lash before big gigs because he plays better hungover", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Well, if you didn't know he had Irish blood in him, it's 100% confirmed now.\nEd Sheeran has said how he makes sure to go out on the tear the night before he plays a big gig, because he always performs better when hungover.\nThat includes his three biggest headline shows to date, when he played Wembley Stadium during the summer.\n\"I don't know why the best gigs I've ever played have been after real heavy nights,\" he said. \"I think it's just because you walk onstage, you're not complacent, you're not onstage being like, 'Oh, I've done this a million times.' You walk onstage being like, 'You know, I'm 90 percent the human I should be so I'll make sure I give 115 percent.'\"\nHe also spoke about his new concert film 'Jumpers for Goalposts', which were filmed at Wembley and are in cinemas for a limited run - including numerous Irish cinemas - this weekend.\n\"I just find whenever I'm on a British Airlines flight I always watch someone's concert film and it always like, I was never really a fan of Justin Bieber, and then I watched 'Never Say Never' and then it made sense, so I was like, 'Oh, oh. I get it now',\" he said. \"So I wanted to make a film that I could put on British Airlines flights and have Chinese businessmen like my music.\"\nThere's no word on his hangover cure of choice - although you wouldn't rule the jumbo breakfast roll out, given his heritage.\nMORE: Ed Sheeran concert film 'Jumpers for Goalposts' hits cinemas next month - watch trailer\nMORE: Ed Sheeran has a role in gory TV series 'The Bastard Executioner' - watch a clip here\nMORE: Watch: Ed Sheeran sings 'Ain't No Sunshine' on The Late Show with Stephen Colbert", "external_links": ["https://www.youtube.com/embed/nSDgHBxUbVQ"], "published": "2015-10-23T22:02:00.000+03:00", "crawled": "2015-10-24T16:33:07.312+03:00", "highlightTitle": ""}