{"organizations": [], "uuid": "04ff264d5689ee1c71249c8a2eba9eeac1821caf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.democratandchronicle.com", "main_image": "http://www.gannett-cdn.com/-mm-/ff0ced22344988046e1713199648c597aedd18fb/c=0-69-719-475&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/09/Rochester/Rochester/635800024533035797-12122409-10153225954296172-7725372289935496237-n.jpg", "site_section": "http://www.democratandchronicle.com/", "section_title": "Democrat and Chronicle | Rochester news, community, entertainment, yellow pages and classifieds. Serving Rochester, New York | democratandchronicle.com", "url": "http://www.democratandchronicle.com/story/news/2015/10/09/eastview-mall-lost-and-found-bear/73670550", "country": "US", "title": "Eastview Mall looks after little lost bear", "performance_score": 0, "site": "democratandchronicle.com", "participants_count": 1, "title_full": "Eastview Mall looks after little lost bear", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T00:10:00.000+03:00", "replies_count": 0, "uuid": "04ff264d5689ee1c71249c8a2eba9eeac1821caf"}, "author": "democratandchronicle.com", "url": "http://www.democratandchronicle.com/story/news/2015/10/09/eastview-mall-lost-and-found-bear/73670550", "ord_in_thread": 0, "title": "Eastview Mall looks after little lost bear", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "When Scott Woodruff saw the little lost teddy bear in the Eastview Mall lost and found, he thought of his six-year-old granddaughter. Woodruff, a sergeant of the night shift for Eastview Mall security, is in charge of the mall's lost and found. He decides what is donated, what is trashed, and what is saved.\nAn 8-inch tall teddy bear caught his attention on Wednesday.\nInstead of throwing the teddy bear into the trash, knowing that the well-worn stuffed animal wouldn't be saved at Goodwill or Salvation Army, Woodruff asked Eastview Mall Marketing Director Wendy Roche to post a picture of the bear on the mall's Facebook page.\n\"I hadn’t seen the bear for a while,\" Woodruff said. \"So when I pulled it out, it caught my attention. It looked like my granddaughter’s lamb that she had. It was worn out, well loved. You can see through the tag on it, that’s so weathered and worn.\"\nThat Facebook post, which led to the hashtag #LittleLostBear, has over 2,000 likes and over 7,000 shares. According to Roche, the post has been shared from Florida to Texas to California.\nAnd because Eastview Mall attracts visitors from all over, it might be hard to find the bear's home. But both Roche and Woodruff are hopeful.\n\"I did not expect this, but it’s awesome,\" Roche said. \"It's definitely something everyone can identify with. I can imagine being a parent with a kid going to bed crying because he needs this teddy. It might not be a monetary value, but there are priceless memories.\"\nRoche notes that she has had to shut off notifications on her phone because of all the social media attention the post is receiving.\nWoodruff said he is hoping for a happier ending with the the little lost bear.\n\"I know when my granddaughter lost her lamb, my daughter spent hours looking for it,\" Woodruff said. \"She spent hours at the Walmart or something searching every shelf and never found it. It meant a lot to my granddaughter, so I assume this means a lot to a little boy or girl.\"\nFor now, the bear is safe and cozy in the mall office. Roche said that people have volunteered to foster the bear, but they are still hopeful that the bear will find its way home.\n\"This has been amazing,\" Woodruff said. \"I figured we might get a few likes here or there, but I'm amazed at how many people this has touched. I'm amazed at touching the Facebook comments have been about how they want this bear to find his way home.\"\nIf you think this bear belongs to your child, please contact Eastview Mall security at 585-223-2930.\nWCLEVELAND@Gannett.com", "external_links": ["https://www.facebook.com/EastviewMall/photos/a.112254206171.98917.109030666171/10153225954296172/?type=3&theater"], "published": "2015-10-10T00:10:00.000+03:00", "crawled": "2015-10-10T02:06:47.980+03:00", "highlightTitle": ""}