{"organizations": [], "uuid": "e96e9b9637f299c1920f51457cb861f5d98d7fda", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thegazette.com", "main_image": "http://www.thegazette.com/storyimage/GA/20151011/ARTICLE/151019937/AR/0/AR-151019937.jpg", "site_section": "http://feeds.feedburner.com/~r/GazetteOnlineSports/~6/1", "section_title": "Eastern Iowa Sports News and Information from Gazette Online", "url": "http://www.thegazette.com/subject/sports/hlas-hawkeyes-must-ignore-1-game-cat-astrophe-20151011", "country": "US", "title": "Hlas: Hawkeyes must ignore 1-game ‘Cat-astrophe", "performance_score": 0, "site": "thegazette.com", "participants_count": 0, "title_full": "Hlas: Hawkeyes must ignore 1-game ‘Cat-astrophe", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T19:00:00.000+03:00", "replies_count": 0, "uuid": "e96e9b9637f299c1920f51457cb861f5d98d7fda"}, "author": "", "url": "http://www.thegazette.com/subject/sports/hlas-hawkeyes-must-ignore-1-game-cat-astrophe-20151011", "ord_in_thread": 0, "title": "Hlas: Hawkeyes must ignore 1-game ‘Cat-astrophe", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mike Hlas"], "text": "Mike Hlas , The Gazette October 11, 2015 | 12:21 pm \nThe only good thing for Northwestern football Saturday? The Chicago Cubs were in a National League playoff game that began before the Wildcats’ game at Michigan was over. \nRealistically, though, the Northwestern-Michigan game was decided long before the Cubs jumped on St. Louis Cardinals starting pitcher Jaime Garcia for a five-run second inning. \nThe Wildcats were 5-0 entering their game against the Wolverines, but were an afterthought in Chitown as the Cubs squared their best-of-5 series at a win apiece. \nMichigan’s 38-0 burial of the Wildcats was best left unnoticed. The Wolverines scored on a kickoff return 13 seconds into the game. It was 21-0 after the first quarter. That was that. \nThat the Wildcats lost was obviously a good thing for Iowa from a won-lost standpoint. That the ‘Cats got obliterated may be an even better thing for the Hawkeyes. Better to have an opponent with self-doubt than one full of self-esteem. \nIf Iowa can win Saturday — and no one with any sense will call that a done deal — it will head to its off-week with a 7-0 record and no ranked teams on its remaining schedule. \nThat doesn’t mean anything given the nutty nature of college football, but the crazy dream of a 12-0 season would remain as dreamable in Iowa as anywhere an unbeaten team prowls the FBS landscape. \nBut don’t throw out what happened in the first five weeks because Northwestern got overwhelmed Saturday. \nNorthwestern had been averaging 391 yards of offense before it was muzzled by Michigan. It had been rushing for 248.8 yards a game. It had been limiting foes to seven points per game. It held Stanford to six points and Minnesota to zero. \nHere’s one thing the Hawkeyes need Saturday: Quarterback C.J. Beathard dealing with the Wildcats’ defense as well as Michigan QB Jake Rudock did. \n“I’ve really been feeling like Jake Rudock is playing his best football,” Michigan Coach Jim Harbaugh said after the game. “I watched him all week during practice, he just has total command of our offense and what he’s doing right now, it’s good to see. I knew he’d have a good game. He played great, and no turnovers which is great for our offense.” \nWhy am I dragging Rudock into this, you might ask. Iowa is 6-0, everything’s rosy, move on. \nBecause the former Hawkeye is an illustration that people shouldn’t get too hung up on impressions made in any one isolated week. Rudock’s first game as a Wolverine was not good, not at all, and Michigan lost at Utah. \nWell, it turns out that Utah is pretty good. It also turns out Harbaugh knew what he was doing when he stayed with Rudock as his quarterback. \nSo Northwestern got plastered at Michigan Saturday. Forget about it, Hawkeyes. You forgot about Illinois losing 48-14 at North Carolina a few weeks ago when you saw the Illini come home and beat Nebraska. \nHad Northwestern beaten Michigan, Saturday’s game in Evanston would have been a clash of unbeatens, a big hyped-up deal. Instead, the Big Ten’s Game of the Week is Michigan State-Michigan. \nWhich is just as well for Iowa. It’s also just as well for Chicago. It has baseball to worry about. Your Next Articles", "external_links": [], "published": "2015-10-11T19:00:00.000+03:00", "crawled": "2015-10-11T20:38:05.585+03:00", "highlightTitle": ""}