{"organizations": [], "uuid": "ee6526920f265f839974d3e016b1126f0f83536e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pe.com", "main_image": "http://images.onset.freedom.com/pressenterprise/thumb/s-anaheimducks.logo.jpg.jpg", "site_section": "http://www.pe.com/sections/sports/", "section_title": "Sports : Press Enterprise", "url": "http://www.pe.com/articles/maul-783520-need-coyotes.html", "country": "US", "title": "Coyotes maul Ducks: What you need to know", "performance_score": 0, "site": "pe.com", "participants_count": 1, "title_full": "Coyotes maul Ducks: What you need to know - Press Enterprise", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "ee6526920f265f839974d3e016b1126f0f83536e"}, "author": "ERIC STEPHENS", "url": "http://www.pe.com/articles/maul-783520-need-coyotes.html", "ord_in_thread": 0, "title": "Coyotes maul Ducks: What you need to know", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By ERIC STEPHENS 15, 2015 12:19 a.m. Coyotes maul Ducks: What you need to know Print Photo Share Pin It More Galleries ADVERTISEMENT Related article » Here’s what you need to know about the Ducks’ 4-0 loss to the Arizona Coyotes on Wednesday night:\nTHE GAME IN 140 CHARACTERS OR FEWER\n- The good in the Ducks that was shown in losses to San Jose and Vancouver was nonexistent against Arizona. And they still can't score.\nQuote: OF THE NIGHT\n“We just had nothing. We got embarrassed in our building.”\n- Ducks captain Ryan Getzlaf on their performance.\nSTAT OF THE NIGHT\n- The Ducks have been shut out twice in three losses and have only one regulation goal in 185 minutes. They’ve held a lead in just six minutes and 42 seconds of that time.\nPLAYER OF THE GAME\n- As tempting it is to say it was speedy rookie Max Domi, it is hard to ignore a hat trick by Anthony Duclair in just his 25 th NHL game. Duclair may make the New York Rangers regret giving him up for defenseman Keith Yandle. And with Domi scoring a nifty backhand goal and blowing past the Ducks’ Kevin Bieksa to set Duclair up for one, you can go ahead and enter the pair in the Calder Trophy race.\nANALYSIS\n- There is a bull’s-eye on the Ducks after the bulk of preseason predictions had them playing for the Stanley Cup and, in a number of cases, winning it. It is high time for them to realize that they’re going to get an opposing team’s best effort on most nights. Playing fast and free with little to lose, Arizona gave a textbook example of that effort by skating harder and faster. It was a surprise to see Anton Khudobin get a start this early in the season, especially after Frederik Andersen played well in his first two games. And that start for Khudobin proved disastrous.\nKEY MOMENT\n- The Ducks appeared to have a good handle on Arizona’s power play when Domi picked up Martin Hanzal’s touch pass at the Coyotes’ blue line in full flight and shifted into a gear that stunned the backtracking Bieksa. Domi put a pass back into the slot and Duclair finished. A 1-0 lead had been doubled and the Coyotes were well on their way to a third straight win.\nANY NEWS?\n- Ducks defenseman Clayton Stoner did not play due to a lower-body injury. Stoner, who missed a handful of games last season because of occasional ailments, did not skate in the morning. Josh Manson took his place in the lineup, playing over 20 minutes in his season debut.\nMORE POSTGAME Quote: S\nRYAN GETZLAF\n(on the Coyotes …)\n“They’re playing with passion. They’re excited to be on the ice and we weren’t. That’s the difference in the game. You look at what goes on the ice and how we executed those things. They had kids that were out there excited to play and we weren’t.”\n1 2 3 Next Page", "external_links": ["http://common.onset.freedom.com/images/gallery/twitter-ico.jpg", "http://common.onset.freedom.com/images/gallery/fb-ico.jpg", "http://assets.pinterest.com/js/pinmarklet.js?r=", "http://images.onset.freedom.com/pressenterprise/thumb/s-anaheimducks.logo.jpg.jpg", "http://images.onset.freedom.com/pressenterprise/gallery/s-anaheimducks.logo.jpg.jpg", "http://s7.addthis.com/js/250/addthis_widget.js#username=YOUR-ACCOUNT-ID", "http://common.onset.freedom.com/images/gallery/mail-ico.jpg"], "published": "2015-10-15T03:00:00.000+03:00", "crawled": "2015-10-15T11:25:46.317+03:00", "highlightTitle": ""}