{"organizations": [], "uuid": "5777fd08d914bc3aebff3b4cfd30df6f31eac262", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "", "site_section": "http://www.tribuneindia.com/", "section_title": "The Tribune, Chandigarh, India : Latest news, India, Punjab, Chandigarh, Haryana, Himachal, Uttarakhand, J&amp;K, sports, cricket ", "url": "http://www.tribuneindia.com/news/editorials/sehwag-calls-it-a-day/148950.html", "country": "US", "title": "Sehwag calls it a day", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "Sehwag calls it a day", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "5777fd08d914bc3aebff3b4cfd30df6f31eac262"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/editorials/sehwag-calls-it-a-day/148950.html", "ord_in_thread": 0, "title": "Sehwag calls it a day", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Virender Sehwag, who announced his retirement from international cricket on Tuesday, was a throwback to the days when sport at the highest level was still played primarily for fun. There was a time when being an amateur in sport was honourable, when those who played sport for money were seen with disdain, and the phrase “playing like an amateur” was not derogatory. In his 14 years in international cricket, Sehwag seemed to be the only cricketer around who played with the spirit of the amateur — he was there to have fun and entertain the spectators. His natural game was to hit the ball from the outset, and that's the way he played right to the end. Unlike his illustrious teammates, universally acknowledged as greater batsmen, Sehwag didn't become a nervous wreck when batting in his 90s — he would step out of the crease to hit sixers even when batting in his 290s. He continued in this vein even when Sourav Ganguly converted him into an opener. His lack of anxiety, his indifference to high numbers made him the first Indian to hit a triple century in Test cricket. In fact, he scored two triple centuries and was once out at 293. Fourteen of his 23 Test centuries exceeded 150 runs. This is really remarkable, for conventional wisdom suggests that a man with such a high-risk, attacking game can’t play very long innings. The pace of his innings was scintillating — he scored the fastest Test triple century on record, and five of the 10 fastest double centuries in Tests. His quick scoring gave the Indian bowlers time to dismiss the opposition and score a win, as at Multan in 2004 and Mumbai in 2009. Sehwag’s game was based on a quick eye and quicker reflexes, supplemented by a wide range of strokes and fearlessness. As age dimmed his eyesight and dulled his reflexes, his game declined. His last century for India came three years ago, and he hadn't played for India for 30 months. At 37, he knew he was now good only for one of those T20 leagues.", "external_links": [], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-22T04:08:08.975+03:00", "highlightTitle": ""}