{"organizations": [], "uuid": "8edafad01e06b1243d0ef7ee29814e7f0c9ba63c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nj.com", "main_image": "http://imgick.nj.com/home/njo-media/width620/img/njcom_photos/photo/2015/10/08/18931147-large.jpg", "site_section": "http://blog.nj.com/realtimesports_impact/rss.xml", "section_title": "New Jersey Real-Time Sports", "url": "http://www.nj.com/flyers/index.ssf/2015/10/flyers_love_new_3-on-3_ot_but_want_to_be_little_le.html", "country": "US", "title": "Flyers love new 3-on-3 OT, but want to be less risky", "performance_score": 0, "site": "nj.com", "participants_count": 1, "title_full": "Flyers love new 3-on-3 OT, but want to be less risky | NJ.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T00:36:00.000+03:00", "replies_count": 0, "uuid": "8edafad01e06b1243d0ef7ee29814e7f0c9ba63c"}, "author": "Randy Miller | NJ Advance Media for NJ.com", "url": "http://www.nj.com/flyers/index.ssf/2015/10/flyers_love_new_3-on-3_ot_but_want_to_be_little_le.html", "ord_in_thread": 0, "title": "Flyers love new 3-on-3 OT, but want to be less risky", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SUNRISE, Fla. — Flyers winger Brayden Schenn grew a smile after Friday's practice when he was asked if his first 3-on-3 overtime experience was as exciting to play as it was to watch.\n\"It's definitely fun,\" he said.\nThe Flyers probably had a little too much fun Thursday night in the NHL's new attempt at limiting shootouts because their all-out attempt to win led to Tampa Bay scoring an overtime game-winner for a 3-2 opening-night win at Amalie Arena.\nThis OT didn't even get to the halfway point, but the action was nonstop odd-man rushes that we didn't see when the Flyers tested out the format during a few of their preseason games.\n\"Yeah, it's exciting for a fan,\" defenseman Michael Del Zotto said. \" You see the chances both ways. But we lost.\"\nStill, losing this way beats losing in a shootout, which the Flyers have had down pat for a lot of years, as we all know.\nThe Flyers had great opportunities to win their 2015-16 opener in OT — center Scott Laughton even had an overtime penalty shot — before Lightning defenseman Jason Garrison won it 2:17 into the new five-minute OT, which had been 4-on-4 hockey since debuting in 2005-06 through last season.\nALSO: Logan Pyett, Flyers minor leaguer, has cancer in leg\n\"There are opportunities both ways, but as much as you want to win the game, you've got to be aware of the team going the other way,\" Schenn said. \"It happens pretty quick, especially with some higher-skilled players out there. I think we were trying a little too hard to score.\"\nFlyers coach Dave Hakstol agreed.\n\"The best way I put is it looked like we were playing 3-on-3 like we were a goal down and we had to score,\" he said. \"You want to be in attack mode, but I think it's something you have to grow into a little bit.\n\"I'm not looking to be critical of it. I'm just looking at it realistically from our end. I think game days, you've got to practice it at game-day speed. We will spend some time on it in practice., but I think we'll get most of our work done looking at it on video and developing through games.\"\nThe Flyers hope to be a little less riskier in the future, but they know 3-on-3 still \"\n\"If you go 3-on-2, 2-on-1 or 2-on-0, like (Tampa Bay) did, if you don't score and the other team gets the puck, you know there's trouble right away,\" right wing Jakub Voracek said. \"I think we could play it a little smarter, but it's hard. If you react a little bit too late for something, it's a breakaway.\n\"It's fun if you have the puck. If you don't, it's not. It's going to be who scores first.\"\nRandy Miller may be reached at rmiller@njadvancemedia.com . Follow him on Twitter @RandyJMiller . Find NJ.com Philadelphia Sports on Facebook .", "external_links": ["https://www.facebook.com/philadelphiasports", "https://twitter.com/RandyJMiller"], "published": "2015-10-10T00:36:00.000+03:00", "crawled": "2015-10-10T03:47:57.464+03:00", "highlightTitle": ""}