{"organizations": [], "uuid": "89b9d82130f3eb49716eb539dc32235a85a59a0e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports/nhl", "section_title": "NHL News, Scores, Schedule, Standings, Stats, Photos, Videos - Ice Hockey - MSN Sports", "url": "http://www.msn.com/en-us/sports/nhl/blackhawks-a-work-in-progress-after-opening-loss/ar-AAfdoRe", "country": "US", "title": "Blackhawks 'a work in progress' after opening loss", "performance_score": 0, "site": "msn.com", "participants_count": 1, "title_full": "Blackhawks 'a work in progress' after opening loss", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "89b9d82130f3eb49716eb539dc32235a85a59a0e"}, "author": "Kevin Allen, USA TODAY Sports", "url": "http://www.msn.com/en-us/sports/nhl/blackhawks-a-work-in-progress-after-opening-loss/ar-AAfdoRe", "ord_in_thread": 0, "title": "Blackhawks 'a work in progress' after opening loss", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Blackhawks 'a work in progress' after opening loss USA Today Sports 12 hrs ago by Kevin Allen, USA TODAY Sports © Jerry Lai, USA TODAY Sports Jerry Lai, USA TODAY Sports CHICAGO — The Chicago Blackhawks were reminded in their season opener that chemistry experiments don't always yield desired results in their trial runs.\nAdChoices The Blackhawks have won three Stanley Cups in the last six seasons, and they have won 64 postseason games since 2010. But they weren't quite themselves Wednesday in a 3-2 loss to the New York Rangers on the night they raised their 2015 Stanley Cup banner.\n\"It’s a work in progress,\" Blackhawks defenseman Duncan Keith said. \"It’s no different than any other year.\"\nBut it is different because salary cap woes this summer forced the Blackhawks to shed players they would have preferred to keep. The Blackhawks also revamped their roster after their 2010 championship, but the losses this summer seemed more critical. General manager Stan Bowman had to move rising young star Brandon Saad, plus proven scorer Patrick Sharp. He also didn’t have room to re-sign important defenseman Johnny Oduya. The Blackhawks had no chance re-sign Brad Richards or Antoine Vermette.\nAlong with the change of personnel, the Blackhawks have had to deal with the reality that superstar Patrick Kane has been under investigation after being accused of sexual assault. He hasn’t been arrested, charged or suspended, but the drama is ongoing because the district attorney’s office in Erie County, N.Y., has not decided whether he should be charged.\nBlackhawks fans gave Kane an enthusiastic ovation when he was introduced before the game.\n\"It seemed like the crowd is supportive,\" Kane said. \"And in this situation, you don’t really know which way it’s going to go.\"\nKane’s play with sensational rookie Artemi Panarin and veteran Artem Anisimov was one of the bright spots for the Blackhawks.\nRussian Panarin, 23, who played last season in the Russia-based Kontinental Hockey League, scored his first NHL goal and looked like a player who could challenge Connor McDavid, Jack Eichel and Max Domi in the Calder Trophy race.\n\"Panarin was fun to watch tonight,\" Blackhawks coach Joel Quenneville said. \"I call him the bread man. He looked like he had the puck all night. That line was effective and dangerous.\"\nPanarin has a game-breaking knack that is not so different from the one possessed by Kane.\n\"He is a special player,\" Kane said of Panarin. \"He’s electric.\"\nTeuvo Teravainen also scored. The Blackhawks need both of those younger players to step up this season to help offset the loss of Saad and Sharp.\nIn their opener, the Blackhawks looked like a team that simply needs time to refine their game. They will be judged by what they do next spring, not what they do in October.\nBut it was clear this team wasn’t the same team we saw in June. Trevor Daley came over from the Dallas Stars in the Sharp trade. He is playing in a defensive pairing with Trevor van Riemsdyk. When asked about them, Quenneville said the pairing was \"just OK.\"\nThe Blackhawks fell behind 3-1 in the first period and couldn’t claw their way back like they would have done last spring.\n\"We had a little delay in our switch,\" Quenneville said about the bumpy first period.\nThe lengthy banner-raising ceremony might have left the Blackhawks a bit sluggish. Kane said he didn’t want to make excuses. \"But for whatever reason, the team that is part of the banner raising comes out slow — it seems to happen every time.\"\nThe Blackhawks’ goal is to have a good start. They believe it is important because they have several new faces. Plus, the Central Division has seven teams that think they can make the playoffs. You can’t take the playoffs for granted.\nThat works for the Blackhawks because they don’t take anything for granted. One of their many strengths is that they keep working until they get it right. That’s why they believe they have a true opportunity to be the first team since the 1997 and 1998 Detroit Red Wings to win back-to-back titles.\nOne loss to a quality Rangers team isn’t going to stop them from believing that.\nFollow columnist Kevin Allen on Twitter @ByKevinAllen .\nGo to MSN Home", "external_links": ["http://www.usatoday.com/sports/", "http://go.microsoft.com/fwlink/?LinkID=286759", "http://twitter.com/ByKevinAllen"], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-09T02:44:05.359+03:00", "highlightTitle": ""}