{"organizations": [], "uuid": "ebb89e2e3e8562c9095e4826bbaf444b9d9d94a6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.northjersey.com", "main_image": "http://www.northjersey.com/designimages/NorthJerseyFacebook_377x196.jpg", "site_section": "http://www.northjersey.com/cmlink/high-school-sports-rss.rss", "section_title": "High School Sports on NorthJersey.com", "url": "http://www.northjersey.com/sports/high-school-sports/boys-soccer/perez-helps-key-cards-win-over-hawthorne-1.1435662", "country": "US", "title": "Boys Soccer: Perez helps Pompton Lakes top Hawthorne", "performance_score": 0, "site": "northjersey.com", "participants_count": 0, "title_full": "Boys Soccer: Perez helps Pompton Lakes top Hawthorne", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T07:16:00.000+03:00", "replies_count": 0, "uuid": "ebb89e2e3e8562c9095e4826bbaf444b9d9d94a6"}, "author": "", "url": "http://www.northjersey.com/sports/high-school-sports/boys-soccer/perez-helps-key-cards-win-over-hawthorne-1.1435662", "ord_in_thread": 0, "title": "Boys Soccer: Perez helps Pompton Lakes top Hawthorne", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Print \nHAWTHORNE - With one well-placed header, sophomore Carlo Gonzalez gave the Pompton Lakes Cardinals the goal they needed to come away with a narrow 1-0 victory over the Hawthorne Bears in Hawthorne on Tuesday evening. \n\"I thought it was a great service and I thought Carlo had a nice goal on a difficult cross,\" Cardinals head coach Rob Edgar said following his team's victory. \"It was nice to see a good ball served and nice to see a run made and finished.\" \nHaving earned a free kick outside the penalty box from just about straightaway, Cardinals senior Roberto Perez sent a chipped ball into the box, allowing Gonzalez to latch on for the game winner. \nIn the end, one goal was all the Cardinals needed, as a Cardinals defense led by Perez, in addition to sophomore goalkeeper Jason Durbvich, earned the clean sheet, despite a late push by the Bears. \n\"When it was 1-0 at the end there, obviously there going to push guys forward…Sometimes guys start to panic or they lose their marks, but I thought we did a good job none the less closing out the game,\" Edgar said. \nIn the final minutes, just as he did throughout the game, Perez made several key tackles that allowed the Cardinals to come away with the victory. \n\"Roberto is a four-year starter for us and he's someone I can always count on,\" Edgar said. \"He's as tough as they come and he's reliable. Any time that he's in the back for us I like our chances of competing.\" \nThe Cardinals wasted little time competing, as they created several quality chances in the first half, including two that bounced off the woodwork. \nThe Cardinals first shot to be denied by the woodwork came off the boot of junior Matt Horn, as he fired a shot, only to watch it careen off the top bar of the goal. \nThen, it was Perez and Gonzalez teaming up, with Gonzalez getting his head to a ball sent in by Perez off a free kick, only to watch his shot, just like Horn's, bounce of the top bar of the goal. \nMeanwhile, the Bears were presented with a chance to get on the scoreboard later in the half when sophomore Karim Yakoub bore down on the Cardinals goal and eluded Durbvich, only to see it cleared on the goalmouth. When the first half was all said and done, even with the chances created by both teams, the score still remained 0-0. \n\"I thought we had good chances, we just couldn't finish,\" Edgar said. \"Today we were unlucky, it hit the crossbar twice, and there were a couple others.\" \n\"To our credit, we didn't put our heads down, we just continued to battle and we eventually found a goal,\" he added. \nThe Cardinals would indeed continue to battle, as they possessed and controlled the middle of the pitch coming out of the halftime break. \n\"I thought some of our midfielders were content with where they were rather than making something happen,\" Edgar said. \"In the second half I thought we possessed the ball a little bit better and we made runs from the midfield position.\" \nIn the end the Cardinals did indeed make something happen, as they would get the goal they needed to come away with the win, good for their third consecutive victory. \n\"They keys were just what we we've been trying to do all season and that's possess the ball, finish our opportunities, defend well as a unit, and just be smart within the game, knowing what's happening in the moment,\" Edgar said. \n\"I thought we did all of those today and as we approach the state tournament we'd rather be performing well than cruising into the tournament so I think we have been getting results lately with the last three games being wins and that's pleasing to see,\" he added. © 2015 North Jersey Media Group Tags:", "external_links": [], "published": "2015-10-19T07:16:00.000+03:00", "crawled": "2015-10-20T00:30:30.810+03:00", "highlightTitle": ""}