{"organizations": [], "uuid": "c6d687fb5c0b960d84e905588b81d4fc3b94f3f7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "http://images.tribuneindia.com/cms/gall_content/2015/10/2015_10$largeimg23_Friday_2015_180059613.jpg", "site_section": "http://www.tribuneindia.com/", "section_title": "The Tribune, Chandigarh, India : Latest news, India, Punjab, Chandigarh, Haryana, Himachal, Uttarakhand, J&amp;K, sports, cricket ", "url": "http://www.tribuneindia.com/news/movie-reviews/movie-review-rock-the-kasbah/149635.html", "country": "US", "title": "Rock n roll in Afghanistan", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "Rock n roll in Afghanistan", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "c6d687fb5c0b960d84e905588b81d4fc3b94f3f7"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/movie-reviews/movie-review-rock-the-kasbah/149635.html", "ord_in_thread": 0, "title": "Rock n roll in Afghanistan", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ervell E Menezes\nAt a time, not so long ago, Afghanistan figured prominently in the world news, what with Pakhtoons, Kandahar, Mujahudin and the American influence on it, but few could have imagined a music promoter coming up with an Afghan version of the American Idol. But this is precisely what happens in “Rock the Kasbah,” an off-beat story at times hilarious at others satirical but always absorbing entertainer. This is thanks to an inventive screenplay by Mitch Glazer and adept handing of the subject by veteran Barry Levinson, whose mother Sylvia I had met decades ago. Bill Murray who plays the lead role as Rickie Lenz the music promoter turns in one of his finest performances ever. Ageing, and at first not easily recognizable, he holds the film together and even infuses it with suspense to maintain the flow. Those who have seen him earlier could scarcely have imagined him in this kind of role. There are also other Americans in Kabul like Bombay Brian (Bruce Willis) – not to miss the aside of Bombay or Mumbai ---a hooker (Kate Hudson), Lenz’s first client (Zooey Deschanel) who robs him and runs away. And of course the Pashtoon girl Salima Khan (Leem Lubany), a virtual breath of fresh air. The Afghan ambience is graphically captured. Lenz talking to ignorant Afghans. Phrases like “Allah helps the innocent” and “the Lord works in mysterious ways” being exchanged. There’s much more to provide the right ambience. Marcelo Zarvos’ music also gives the film a further boost with popular numbers like “Oh Baby, Baby...” and “Knocking at Heaven’s Door” which will warm the cockles of some old hearts. And in just 100 minutes the viewer is satiated by an unusual and even thought-provoking take on Afghanistan. Billy Murray of course steals the show to make Rickie Lenz so believable and he is aided by cameos by Bruce Willis, Kate Hudson and Zooey Deschanel. Newcomer Leem Lubany also makes her presence felt in this delightful, not-to-be-missed entertainer.", "external_links": [], "published": "2015-10-23T03:00:00.000+03:00", "crawled": "2015-10-23T22:34:34.574+03:00", "highlightTitle": ""}