{"organizations": [], "uuid": "7d709decfbb113fbc24897440ae330d8eb4112f2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.haaretz.com", "main_image": "http://www.haaretz.com/polopoly_fs/1.584793!/image/625594294.jpg_gen/derivatives/landscape_474/625594294.jpg", "site_section": "http://www.haaretz.com/life/sports", "section_title": "Sports-Israel News - Haaretz Israeli News source", "url": "http://www.haaretz.com/news/israel/.premium-1.680306", "country": "IL", "title": "Population and Immigration Authority inspectors have used vi", "performance_score": 0, "site": "haaretz.com", "participants_count": 1, "title_full": "Population and Immigration Authority inspectors have used vi", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T10:53:00.000+03:00", "replies_count": 0, "uuid": "7d709decfbb113fbc24897440ae330d8eb4112f2"}, "author": "Ilan Lior", "url": "http://www.haaretz.com/news/israel/.premium-1.680306", "ord_in_thread": 0, "title": "Population and Immigration Authority inspectors have used vi", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Population and Immigration Authority inspectors have used violence against asylum seekers, foreign workers and deportees from Israel in a number of cases. This according to a report by human rights groups.\nThe report, by the Hotline for Refugees and Migrants and the Association for Civil Rights in Israel, documents 14 incidents over the past two years in which violence was used during an arrest, at a detention facility, during attempts to place deportees on planes and in enforcement sweeps on city streets. Six of the foreign nationals required medical attention or hospitalization.\nThe report describes two cases in which complainants reported the violence to the hotline, but refused to file an official complaint.\nIn two other cases, complainants changed their minds about filing a complaint for fear of the inspectors’ response, and left the country. Three others were quickly deported from Israel despite a directive from the Custody Tribunal ordering the immigration agency and the police to investigate the complaints. The deportation of three other complainants was halted after the hotline and a private lawyer intervened. Four police investigations remain open, but no inspector has been charged in any of the cases so far.\nBy law, Population and Immigration Authority inspectors are authorized to demand identification and to enter premises, except for homes, if they suspect the presence of an illegal alien. Additional powers, including the use of force, carrying a weapon, arrest of minors and use of handcuffs, are regulated by Interior Ministry protocol.\nIn one of the cases described in the report, a Nigerian citizen said he was taken to Ben-Gurion International Airport against his will in November 2014 and put aboard a plane, handcuffed to a seat and beaten by eight inspectors, who also used a stun gun on him.\nThe pilot heard the man’s screams of pain and refused to transport the man. The man said that on leaving the plane, the inspectors pushed him down the stairs, breaking one of his teeth. He was returned to Saharonim Prison, and in a court hearing he reported the violence. The Hotline for Refugees and Migrants filed a police complaint on the man’s behalf, but seven months later the police closed the investigation. The man is still in custody at Saharonim.\nRecommendations in the report include defining boundaries in the use of force by inspectors and establishing an external oversight body.\nThe report also recommends that injured parties be able to file a complaint without reference to their residency status.\nIn a statement, Population and Immigration Authority spokeswoman Sabine Hadad said the agency was not aware of any unusual cases in recent months and that all allegations of violence by any authority employee are examined and appropriate measures taken.\n“In cases of alleged violence there are clear steps to be taken, and there is no reason for anyone who feels the need to complain not to do so, and we indeed see this. Complainants are accompanied by activists and are not afraid to complain,” Hadad said in the statement.\nIlan Lior\nHaaretz Correspondent\n ", "external_links": ["http://widgets.outbrain.com/outbrain.js"], "published": "2015-10-14T10:53:00.000+03:00", "crawled": "2015-10-14T02:55:42.289+03:00", "highlightTitle": ""}