{"organizations": [], "uuid": "288a5dcdb51da40694a58945e0e52d85917e3d65", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dodgeglobe.com", "main_image": "http://www.dodgeglobe.com/Global/images/head/nameplate/ks-dodgecity_logo.png", "site_section": "http://www.dodgeglobe.com/sports?template=rss&mime=xml", "section_title": "Sports - Dodge City Daily Globe - Dodge City, KS", "url": "http://www.dodgeglobe.com/article/20151015/SPORTS/151019551/2000/NEWS?rssfeed=true", "country": "US", "title": "Demons to face tough test on senior night", "performance_score": 0, "site": "dodgeglobe.com", "participants_count": 1, "title_full": "Demons to face tough test on senior night", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:55:00.000+03:00", "replies_count": 0, "uuid": "288a5dcdb51da40694a58945e0e52d85917e3d65"}, "author": "John Zetmeir / Dodge City Daily Globe", "url": "http://www.dodgeglobe.com/article/20151015/SPORTS/151019551/2000/NEWS?rssfeed=true", "ord_in_thread": 0, "title": "Demons to face tough test on senior night", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Demons to face tough test on senior night Comment By John Zetmeir / Dodge City Daily Globe Dodge   By John Zetmeir / Dodge City Daily Globe Posted Oct. 15, 2015 at 7:55 PM By John Zetmeir / Dodge City Daily Globe Posted Oct. 15, 2015 at 7:55 PM Dodge City, Kan. The Dodge City Red Demons have had their fair share of ups and downs through six games this season. After starting the season with losses in their two of their first three games, Dodge City responded with a dominant three game stretch. During their recent three game stretch, the Red Demons (4-2, 3-0) have outscored their opponents 157-10. On Friday, they will start their quest for a playoff spot against a team that has dominated their opposition all season long in Wichita Northwest (6-0). The Grizzlies enter Friday’s game at Memorial Stadium fresh off of their win over Wichita South which earned Northwest the Wichita city league title. \"Bottom line is that this is a very good football team,\" head coach Dave Foster said. \"They are undefeated and they’ve had lopsided victories week in and week out.\" Northwest has averaged just over 53 points per game this season. Dodge City is not far behind the Grizzlies when it comes to scoring points. The Red Demons having averaged 49.8 points per game through their first six contests. Not only will the start of 6A district-eight play feature two of the most explosive offenses, the matchup will also showcase two of the top quarterbacks in the state. The Dodge City coaching staff entrusted senior quarterback Caden Walters to run the offense coming into the season and he has not let them down. Walters has been the maestro of the Red Demon offense since day one. The senior signal caller has completed nearly 65 percent of his passes this season for 1585 yards and 17 touchdowns. Walters has also rushed for 10 touchdowns. \"We haven’t done that, necessarily, with quarterbacks in the past because we didn’t feel like they were at that level of understanding the feel of the game,\" Foster said. \"There are series that we’ve given Caden complete control because we feel like he has such a good understanding of the flow of the game.\" The Grizzlies quarterback, senior Kevin Folson, has thrown for 1019 yards and 14 touchdowns. Folson has also proven to be a dual-threat quarterback this season with 574 yards and eight touchdowns on the ground. Folson was injured in Northwest’s last game but is expected to play against Dodge City. The game against Northwest could be the last time that the group of 24 seniors will play in their home stadium. It has been a special group for Foster and his staff. The leadership that they have provided has given Foster confidence heading into district play against three teams with a combined record of 17-1. \"They’ve provided us with a single class that provides enough depth to handle the depth that you need for a varsity football team,\" Foster said. \"There is not a large number of underclassmen that are playing as a result of a large senior class. There is a lot to be to be said for that. They only come every now and then in a community like this.\" Page 2 of 2 - Kickoff is scheduled for 7 p.m. at Memorial Stadium. By John Zetmeir / Dodge City Daily Globe Dodge   By John Zetmeir / Dodge City Daily Globe Posted Oct. 15, 2015 at 7:55 PM", "external_links": [], "published": "2015-10-16T03:55:00.000+03:00", "crawled": "2015-10-16T08:35:01.430+03:00", "highlightTitle": ""}