{"organizations": ["Cardinals", "Steelers"], "uuid": "11d56649142480c41d09c0264b477e26d89f3c74", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pendletontimespost.com", "main_image": "", "site_section": "http://pendletontimespost.com//feed/sec/6000/", "section_title": "PendletonTimesPost.com - Sports News", "url": "http://www.pendletontimespost.com/view/story/9280d46c305f402e9e3350007c9b3597/FBN--Cardinals/", "country": "US", "title": "Cardinals wilt in second half of 25-13 loss to Steelers", "performance_score": 0, "site": "pendletontimespost.com", "participants_count": 0, "title_full": "Cardinals wilt in second half of 25-13 loss to Steelers", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T01:20:00.000+03:00", "replies_count": 0, "uuid": "11d56649142480c41d09c0264b477e26d89f3c74"}, "author": "", "url": "http://www.pendletontimespost.com/view/story/9280d46c305f402e9e3350007c9b3597/FBN--Cardinals/", "ord_in_thread": 0, "title": "Cardinals wilt in second half of 25-13 loss to Steelers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Turnovers, missed opportunities cost Cardinals in 25-13 loss to Steelers By WILL GRAVES AP Sports Writer   6:20   6:20   \nPennsylvania (896) \n\nPITTSBURGH — Bruce Arians and the Arizona Cardinals spent a couple days at the posh Greenbrier Resort in the West Virginia mountains last week believing it would better prepare them for Michael Vick and the Pittsburgh Steelers . \nContaining Vick turned out not to be a problem. Landry Jones was another matter entirely. \nPittsburgh's third-string quarterback ignited a second-half rally as the Steelers stunned the Cardinals 25-13 on Sunday, ruining a homecoming of sorts for Arians, who spent nearly a decade with the Steelers before being forced out at the end of the 2011 season in a move jokingly called a \"refirement.\" \nThree-plus seasons and two NFL Coach of the Year awards later, Arians returned to Heinz Field with arguably the best team in the league. Arizona played like it for a half before crumbling under its own mistakes and the stunning play of Jones. \nFilling in after an ineffective Vick left with a right hamstring injury, Jones completed 8 of 12 passes for 168 yards and two touchdowns to Martavis Bryant in his first-ever action during the regular season. \n\"He played very well for a young guy coming into that situation,\" Arians said. \"He won the football game.\" \nAnd the Cardinals (4-2) — somewhat bafflingly — lost it. Arizona outgained Pittsburgh 469-310, punted only three times and spent long stretches moving up and down Heinz Field with relative ease. Yet the NFL's highest scoring team also turned it over three times, scored just one touchdown on four trips in the red zone and let the Steelers (4-2) hang around for far too long. \n\"If we are scoring touchdowns and we put 30 points on the board, we walk out of here with a win,\" wide receiver Larry Fitzgerald said. \"In both games we lost we did not execute in the red zone. So it is not a lot of problems to fix it is just one glaring one.\" \nCarson Palmer threw for 421 yards with a touchdown and two interceptions. John Brown caught 10 balls for 196 yards but also fumbled early in the second half after getting drilled by Steelers linebacker James Harrison. \nBy then Pittsburgh was back in the game after nearly getting run out of its own building in the first half. Yet Arizona only led 10-3 at the break after having a touchdown wiped out on an offensive pass interference penalty, letting a second-and-3 at the Pittsburgh 25 turn into a punt and allowing the Steelers to hang around far too long. \nVick, who dazzled late in a thrilling last-play win at San Diego on Monday night, actually left twice. He exited for a couple of snaps in the second quarter after getting what the team called \"dirt in his eye\" at the end of a 10-yard scramble and was pulled for good in the third quarter after tweaking his right hamstring. \nEnter Jones, who has struggled to distinguish himself in three seasons as the third-stringer behind Ben Roethlisberger. \nThrust into the first meaningful action of his pro career — his last college game at Oklahoma saw the Sooners lose to Johnny Manziel and Texas A&M in the 2013 Cotton Bowl — Jones showed remarkable poise. He hit Bryant for a leaping 8-yard touchdown grab in the back of the end zone to give the Steelers a 12-10 lead. \n\"I didn't expect them to come out throwing the ball,\" Arizona defensive tackle Calais Campbell said. \"I thought when the third-string quarterback came in, they would run the ball. So, that caught us off-guard a little bit. But you've got to play football, no matter who's back there.\" \nJones later hit Bryant for a 23-yard gain and Antonio Brown with a pretty back shoulder throw, both of which set up Chris Boswell field goals, the last of which gave the Steelers a five-point lead with 7:13 to play. \nPittsburgh's resurgent defense made it stand up. Mike Mitchell picked off Palmer in the end zone to end Arizona's last gasp. \nNOTES: Arizona lost tight end Darren Fells with a shoulder injury. ... Fitzgerald finished with eight catches for 93 yards on the same field where he starred collegiately at Pittsburgh. ... The Cardinals were penalized nine times for 111 yards. ... Arizona hosts Baltimore on Oct. 26. \nAP NFL website: http://www.pro32.ap.org and http://www.twitter.com/AP_NFL \n ", "external_links": [], "published": "2015-10-19T01:20:00.000+03:00", "crawled": "2015-10-19T01:31:17.319+03:00", "highlightTitle": ""}