{"organizations": [], "uuid": "a9878a329c5c28f7ccd373f2d1a6a6194a9e2ea7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tnonline.com", "main_image": "", "site_section": "http://tnonline.com//sports/rss", "section_title": "Times News Sports", "url": "http://www.tnonline.com/2015/oct/16/indians-rout-panther-vy", "country": "US", "title": "Indians rout Panther Vy.", "performance_score": 0, "site": "tnonline.com", "participants_count": 1, "title_full": "Indians rout Panther Vy.", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T23:00:00.000+03:00", "replies_count": 0, "uuid": "a9878a329c5c28f7ccd373f2d1a6a6194a9e2ea7"}, "author": "psiwebtn", "url": "http://www.tnonline.com/2015/oct/16/indians-rout-panther-vy", "ord_in_thread": 0, "title": "Indians rout Panther Vy.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By BRAD HURLEYbhurley@tnonline.com \nBig play ability. \nThat statement above has been the secret to success for the Lehighton football team this season. \nOn Thursday, the Indians used big plays en-route to their seventh straight victory of the season. Only this time, the Tribe made huge plays on offense, defense, and special teams to come away with a 62-7 Anthracite Football League victory over Panther Valley. \nEarly on in the first, the Thursday Night Special in support of the Bo Tkach Foundation looked like it was going to be an interesting ball game. \nFor the second straight week Panther Valley was able to move the ball on offense early. After surrendering a touchdown on a 20-yard punt block return, the Panthers didn’t panic, they actually responded, going on a 12 play, 54-yard drive to tie the game. \nSophomore Jonathan Hafer was the work horse on the drive, rushing for 29 of his 56 yards on the night during that span. \n“I think our kids are getting more comfortable and confident in our offense,” said PV head coach Matt Davis. “They understand what we’re trying to do and they’re starting to make some plays. That’s definitely something we can build off. We just didn’t take care of the football tonight. We handed them the ball a lot and when you’re playing a team as talented as Lehighton you certainly can’t do that.” \nThe Panthers early first quarter touchdown was all the motivation the Indians needed to put their foot down on the gas pedal, outscoring PV 55-0 the rest of the way. \nOn the Indians ensuing possession after the Panthers score, it didn’t take long for the Tribe to answer. In fact, it took them one play. Tyler Cann and wide receiver Tegan Durishin hooked up for a 67-yard pitch and catch to give Lehighton a 14-7 lead. \nThe second quarter was when the Indians quickly put the game away, scoring three touchdowns to extend their lead to 35-7. \nThe Lehighton offense ran just 15 total offensive plays in the first half, but still was able to punch it in. \nA punt block return touchdown, 67-yard pass play, Wyatt Clements one-yard plunge, 20-yard Eric Skrinkosy fumble return, and a 28-yard strike equated for all of the Indians scores in the first half. It was simply just another night at the office for Lehighton. \n“I don’t want to sound redundant, but making big plays to win games is something that you’ve been seeing every week from our kids and that’s a credit to them,” said Lehighton coach Tom McCarroll. “Every week someone just goes out there and makes a game-changing play for us. And this isn’t just coach speak, PV is a much better team than their record indicates, they challenged us early, but our playmakers were the difference. Every week our guys just make big plays.” \nLehighton continued to make big plays in the second half as well. \nWyatt Clements got the Indians rush game going a bit in the third quarter, rolling for a 61 yard rush down to the PV 15-yard line. Clements big run set up his 15-yard touchdown scamper up the middle on the next play. \nTurnovers hurt the Panthers once again in the second half as the Indians used two PV interceptions to score touchdowns. A 36-yard interception return by Nick Chambers and a 25-yard interception return by Nick Crum resulted in two Indians scores. \nAfter another solid start it turned out not to be the Panthers night, but for the Indians the momentum train will keeping on chugging along into week eight of the season. \n“It was great to see a lot of different kids make some plays, including some of our younger kids,” said McCarroll. “Because of the flow of the game our offense didn’t really get in a groove, but when you’re making big plays on defense and special teams you’re okay with that. It was just an overall team win tonight and as always we’re proud of our team’s effort.” \nMR. VERSATILITY... The Indians Nick Chambers put together one of the most impressive performances in the Times News area this season. Chambers caught a touchdown, returned a blocked punt for a touchdown, and also returned an interception for a touchdown. \n“Every week Nick gets better and I think now he is somebody that can make a lot of plays anywhere on the field. I don’t think he’s anywhere near reaching his ceiling for the kind-of football player he can be either.” - Lehighton coach Tom McCarroll. \nALL FACETS ... Besides the Indians scores on offense, the Tribe made plays in all facets of the game. Lehighton scored touchdowns on two interception returns, a punt block return, and a fumble recovery return. \nEFFICIENT ... Lehighton QB Tyler Cann continued his efficient play through the air going 4-for-5 in the night for 106 yards and two touchdowns.", "external_links": [], "published": "2015-10-16T23:00:00.000+03:00", "crawled": "2015-10-17T17:12:26.746+03:00", "highlightTitle": ""}