{"organizations": [], "uuid": "284d884ae6946343ee405e3b52c9a08d9dee232a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.torontosun.com", "main_image": "http://storage.torontosun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297758737563_LARGE_BOX.jpg?quality=80&stmp=1444529152052&size=100x", "site_section": "http://www.torontosun.com/sports/football", "section_title": "Football | Sports | Toronto Sun", "url": "http://www.torontosun.com/2015/10/09/blue-bombers-could-be-looking-at-their-future-running-back-today-in-bc", "country": "CA", "title": "Blue Bombers could be looking at their future running back today in B.C. | BLUE", "performance_score": 0, "site": "torontosun.com", "participants_count": 1, "title_full": "Blue Bombers could be looking at their future running back today in B.C. | BLUE", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T09:02:00.000+03:00", "replies_count": 0, "uuid": "284d884ae6946343ee405e3b52c9a08d9dee232a"}, "author": "torontosun.com", "url": "http://www.torontosun.com/2015/10/09/blue-bombers-could-be-looking-at-their-future-running-back-today-in-bc", "ord_in_thread": 0, "title": "Blue Bombers could be looking at their future running back today in B.C. | BLUE", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "VANCOUVER — Could the Winnipeg Blue Bombers be looking at their future running back on Saturday night at BC Place?\nThe Bombers (4-10) have to beat the B.C. Lions (5-8) to keep their playoff hopes alive in the West Division. If they don’t, they will fall four points behind the Lions in the race for the final playoff spot. And if B.C. wins by 10 points or more it would capture the season series as well, which would mean Winnipeg would have to win its three remaining games and B.C. would have to lose its last four.\nSo yes, it’s win or go home for the Blue and Gold, who haven’t had much of a running attack this season and could be playing against the answer to those woes in their do-or-die contest. Lions running back Andrew Harris, who entered Week 15 as the CFL’s rushing leader, just so happens to be a Winnipeg native whose contract expires in February. Not only that, but all of his family is still in the Manitoba capital, including seven-year-old daughter Hazel.\n“I’ve lived with the fact that I’ve been out here for this long and my daughter is getting older,” Harris said Friday at BC Place. “So I do miss her and miss being around her. So that’s something that will weigh into the decision, but ultimately it’s about the right fit and who shows the most interest.”\nThe Bombers rushed for 100 yards as a team in three of their first six games this season, but they have reached the century mark only twice in their last eight. The loss of Paris Cotton to a broken arm in early August coincided with the decline in ground production, but Harris is a ratio buster who entered the week with a league high 819 rushing yards. Cotton was on pace for 689 rushing yards this season.\nWinnipeg finally made a move to fix its stagnant running attack this week, releasing Chevon Walker, and putting Da’Rel Scott back into the lineup after he missed six games with a back injury. That being said, Scott has just three carries for 10 yards this season. Quarterback Matt Nichols could use the help of a better rushing attack if the Bombers are going to make a playoff push.\n“It takes a lot of pressure off the quarterback when you can do that,” Nichols said after the team arrived in overcast Vancouver on Friday. “We have a couple good backs on this team. That’s something we’re committed to doing, and it’s something that’s going to help us down the stretch, being able to run the football better.”\nThe Bombers are also going with a new kicker on Saturday; import Sergio Castillo will take care of field goals and allow the struggling Lirim Hajrullahu to concentrate on punts and kickoffs.\nWinnipeg’s defence, which has been playing well, will need to contain Lions quarterback Jonathan Jennings, who will be making his just third CFL start after torching the Saskatchewan Roughriders last week.\n“We have a lot of respect for Winnipeg,” Lions head coach Jeff Tedford said. “He’s going to be up against a good defence and a good pass rush. So it’s just really important that he makes good decisions. That’s one thing I was really pleased with last week was that he made good decisions and didn’t turn the football over.”\nThe Bombers have talked continually this week about how Jennings doesn’t run from the pocket looking for a first down; he takes off looking for a better place from which to launch the football. Jennings has already thrown eight passes of at least 30 yards, which means he throws for a “big play” once every 6.5 times he unleashes the pigskin.\n“He’s running to throw,” said Bombers defensive end Jamaal Westerman, the CFL sack leader who will be trying to get his mitts on Jennings. “So he’s getting open, but you can see that he keeps his eyes down the field. That allows his receivers to get open and for him to make big passes.”\nIf Jennings can’t get the offence going the Lions can turn to Harris, who has rebounded from a mid-season slump to take a run at his first career rushing title at age 28.\n“For five weeks there I was pretty much a non-contributor on this offence,” Harris said. “To still be the rushing leader, it just shows when I am playing well I’m doing well in those circumstances. For me to see that, realize that, and to still be around that, it’s definitely a tribute to the offence and my hard work. Now it’s just about sealing the deal on that and get us in the playoffs and hopefully get a rushing title for myself.”\nAnd possibly a new contract in Winnipeg?\nBLUE BOMBERS\nBlue Bombers could be looking at their future running back today in B.C.\nBy Kirk Penton , Winnipeg Sun First posted: Friday, October 09, 2015 09:02 PM EDT | Updated: Friday, October 09, 2015 11:42 PM EDT\nVANCOUVER — Could the Winnipeg Blue Bombers be looking at their future running back on Saturday night at BC Place?\nThe Bombers (4-10) have to beat the B.C. Lions (5-8) to keep their playoff hopes alive in the West Division. If they don’t, they will fall four points behind the Lions in the race for the final playoff spot. And if B.C. wins by 10 points or more it would capture the season series as well, which would mean Winnipeg would have to win its three remaining games and B.C. would have to lose its last four.\nSo yes, it’s win or go home for the Blue and Gold, who haven’t had much of a running attack this season and could be playing against the answer to those woes in their do-or-die contest. Lions running back Andrew Harris, who entered Week 15 as the CFL’s rushing leader, just so happens to be a Winnipeg native whose contract expires in February. Not only that, but all of his family is still in the Manitoba capital, including seven-year-old daughter Haze\n Football NFL Week 5 predictions: Broncos look to extend record 0\nKryk's take heading into Week 5 of the NFL 0\nToronto\nRandall the Handle's NFL Week 5 picks 0\nNFL at the quarter mark: top performers ... so far 0\n ", "external_links": ["http://pubads.g.doubleclick.net/gampad/clk?id=182027221&iu=/3081/SMCO_ENUR_TSUN_EN_WEB", "http://pubads.g.doubleclick.net/gampad/clk?id=228633661&iu=/3081/SMCO_ENUR_TSUN_EN_WEB", "http://pubads.g.doubleclick.net/gampad/clk?id=182024221&iu=/3081/SMCO_ENUR_TSUN_EN_WEB", "http://pubads.g.doubleclick.net/gampad/clk?id=183052021&iu=/3081/SMCO_ENUR_TSUN_EN_WEB"], "published": "2015-10-10T09:02:00.000+03:00", "crawled": "2015-10-11T05:16:25.741+03:00", "highlightTitle": ""}