{"organizations": [], "uuid": "fe8d183ac8b6b9b07c29db8e861889bc39b3731b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cheboygannews.com", "main_image": "http://www.cheboygannews.com/storyimage/MI/20151002/SPORTS/151009704/AR/0/AR-151009704.jpg", "site_section": "http://www.cheboygannews.com/sports?template=rss&mime=xml", "section_title": "Sports - Cheboygan Daily Tribune - Cheboygan, MI", "url": "http://www.cheboygannews.com/article/20151002/SPORTS/151009704/2000/NEWS?rssfeed=true", "country": "US", "title": "Chiefs miss out on opportunities in 38-7 homecoming loss to Alpena Wildcats", "performance_score": 0, "site": "cheboygannews.com", "participants_count": 1, "title_full": "Chiefs miss out on opportunities in 38-7 homecoming loss to Alpena Wildcats", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T07:45:00.000+03:00", "replies_count": 0, "uuid": "fe8d183ac8b6b9b07c29db8e861889bc39b3731b"}, "author": "Jared Greenleaf", "url": "http://www.cheboygannews.com/article/20151002/SPORTS/151009704/2000/NEWS?rssfeed=true", "ord_in_thread": 0, "title": "Chiefs miss out on opportunities in 38-7 homecoming loss to Alpena Wildcats", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted Oct. 2, 2015 at 11:45 PM Cheboygan, Mich. By JARED GREENLEAF sports@cheboygantribune.com CHEBOYGAN — Make no mistake about it, the Cheboygan Chiefs had plenty of chances to put up points against the Alpena Wildcats. But time and time again — whether it was failing to convert a big play, turning the ball over, or getting a touchdown called back on a penalty— the Chiefs shot themselves in the foot. And when you do that continuously, you rarely ever come out on top. In a season that’s been a struggle for the Chiefs became even more frustrating as they suffered a 38-7 homecoming loss to the Wildcats on Friday night. “We’d like to finish off a few of the drives we had going, but we’re just not consistent enough in the play execution and getting into the endzone,” said Cheboygan head coach Dave Schulz, whose team dropped to 1-4 on the season following the loss. “As coaches, we’ve got to better, and teach our players how to become better football players for next week.” While the Chiefs were failing to execute, it was the Wildcats who converted most of their chances thanks to a balanced offensive attack (141 yards rushing, 197 yards passing) that finished with 338 total yards. Meanwhile, the Wildcats’ defense held Cheboygan to just 197 yards of total offense. “We executed on offense, we read our keys on defense, played hard, and played with great effort on both sides of the ball,” said first-year Alpena head coach Brad Moughon, whose team improved to 3-3 with the victory. “I credit our kids for focusing on the game plan, executing what that game plan was, and trying as hard as they could on every play. “I can’t be more proud of our kids after tonight. They did an outstanding job and executed.” The mistakes began early for the Chiefs, who fumbled on the first play of the contest, setting the Wildcats up in Cheboygan territory. A few plays later, Alpena junior running back Wade Roznowski scored one of his two touchdowns on the night on a 19-yard run to give the Wildcats an early 7-0 lead. After stopping Cheboygan on its next possession, sophomore quarterback Lars MacArthur capped off a 69-yard Alpena drive with a one-yard TD run to help make it a 14-0 lead. Despite trailing by two scores, the Chiefs battled back to make it a 14-7 contest midway through the second quarter after senior quarterback Zach Socha capped off a 68-yard drive with a five-yard TD pass to senior receiver Dylan Shampine. But just as the Chiefs were building momentum, Alpena snatched it right back when sophomore Alex Arch broke loose down the sidelines with a 94-yard kickoff return that made it a 21-7 Wildcats lead. Page 2 of 3 - “It’s a game of ups and downs and swings, and we had it going, but they (Alpena) took it right back,” Schulz said of the kickoff return. “Our job is to keep our guys in the game ready to play the next play, and we’re going to get better. That’s what we’re working on.” Down but not out, the Chiefs moved the ball right down the field and threatened to score late again in the half. However, three consecutive incomplete passes — two of which could’ve easily resulted in touchdowns — hurt the Chiefs, who turned the ball on downs and trailed by two scores at halftime. The Wildcats struck early in the third quarter when McArthur connected with senior wide receiver Jarid Campbell, who raced 66 yards to lift Alpena’s advantage to 28-7. Later in the quarter, Roznowski put the game out of reach when he scored on a run from 13 yards out, increasing the Alpena lead to 35-7. It appeared the Chiefs were going to cut into Alpena’s advantage, but an illegal substitution penalty negated what would have been a long TD run for senior running back Logan Mills. In the end, the Wildcats received outstanding nights from Roznowski, who finished with 88 yards rushing and two touchdowns, while MacArthur completed 13 of 19 passes for 197 yards and a touchdown. “Wade is extremely quick and fast and has some shiftiness to him as well,” Moughon said of his running back. “I thought our offensive line did a nice job of blocking for him, opening up the holes for him, and he made some great reads and great cuts. “I also credit our quarterback (MacArthur) for making great reads, whether to give him the ball or keep it on the zone. He was extremely poised, very smart with the ball, thought he read the defense extremely well. “Only being a sophomore, he has come a long way, and we expect big things out of him as well.” If there was a bright spot for the Chiefs offensively, it was senior running back Austin Sidelinker, who led his team with 88 yards rushing. “We always knew Austin was a good running back,” Schulz said. “I was just happy he was able to show that, and people get to see it, too, because he’s a hard worker for us. We missed him last week, so we were just happy to have him out there. He’s a good back and we’ll need more of him this year.” Socha finished 7-of-19 passing for 79 yards and a TD, while Mills added 25 yards rushing, and senior Dominic Reese and Shampine added 23 and 21 yards receiving respectively. Page 3 of 3 - Defensively, Dylan Socolovitch led Cheboygan with 10 tackles, while Dan Pearson (sack) had eight, Zane Beydoun had seven, Mike Radle (sack), Mills, Sidelinker and Shampine each had four, Jack Ormsbee had three, Ethan Campeau, Lucas Cronan, Garrett Lindgren (fumble recovery) and Dalton Oikarinen each had two, and Hayden Schneider, Cooper Kelley and Socha each had one. Campbell finished 88 yards receiving to lead Alpena, which will host Traverse City Central (6-0) on homecoming next Friday night. The Trojans came back to claim a 28-27 overtime victory at Petoskey (4-2) on Friday. After a dominating road victory, Moughon and his team have plenty of confidence heading into the big matchup. “Confidence is huge, it creates momentum,” Moughon said. “We’ve worked all year on having the right mindset, and whenever you build that confidence and do create momentum for yourself, it only helps the mindset, and that’s what we’re focusing on.” Next up for Cheboygan will be a trip to Sault Ste. Marie next Friday. Schulz is hoping this time his team will be able to execute better — and it’ll result in scoring. “We’re working hard, but it’s one of those things, as we get closer in one area, sometimes it feels like we lose something somewhere else,” Schulz said. “It’s just a matter with us sticking with it, following our plan, and really helping these kids become better football players so they could win these games.”", "external_links": [], "published": "2015-10-03T07:45:00.000+03:00", "crawled": "2015-10-03T16:12:14.247+03:00", "highlightTitle": ""}