{"organizations": [], "uuid": "b0a1ee9b3afe3ef981cf73ef8a3cbd076a2b6ab2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/Portal/6/Sports.aspx", "section_title": "Sports - Ahram Online ", "url": "http://english.ahram.org.eg/NewsContent/6/55/153840/Sports/World/De-Gea-pushing-hard-for-Spain-keepers-slot.aspx", "country": "EG", "title": "De Gea pushing hard for Spain keeper's slot - World", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "De Gea pushing hard for Spain keeper's slot - World - Sports - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "b0a1ee9b3afe3ef981cf73ef8a3cbd076a2b6ab2"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/6/55/153840/Sports/World/De-Gea-pushing-hard-for-Spain-keepers-slot.aspx", "ord_in_thread": 0, "title": "De Gea pushing hard for Spain keeper's slot - World", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related Spain boss Del Bosque faces selection headache I've never been negative about Spain: Barcelona defender Pique David De Gea's fine performance for Spain in Monday's 1-0 Euro 2016 qualifying win over Ukraine gave plenty of new ammunition to those who believe he should be La Roja's number one goalkeeper instead of Iker Casillas.\nWith the holders already through to the tournament in France next year as Group C winners, De Gea was given a chance to impress as coach Vicente del Bosque fielded an experimental side in Kiev and he did not disappoint.\nThe 24-year-old Manchester United stopper made 10 saves, several of which were out of the top draw, and Spain's sports media were asking on Tuesday whether he should already replace decorated long-term keeper and captain Casillas.\nSpain's most-capped player with 164 appearances -- De Gea has seven -- Casillas led the Iberian nation as they swept to consecutive Euro titles in 2008 and 2012 with a maiden World Cup triumph in between.\nHowever, he was widely criticised after Spain crashed out of last year's World Cup finals in Brazil in the group stage and at 34 appears to be past his prime.\nDe Gea, by contrast, looks to be going from strength to strength and his failed move from United to Real Madrid in the close season does not seem to have affected his form.\nDel Bosque is likely to stick with Casillas at Euro 2016, which would be the Porto keeper's swansong, but some are questioning whether the former Real manager, whose career has been closely tied to that of Casillas, might be thinking with his heart rather than his head.\n\"I will try to be at my best and make things difficult for the coach,\" De Gea told reporters after the Ukraine game, in which his heroics helped Spain reach eight competitive matches in a row without conceding for the first time.\n\"What I want is to maintain the line I had last season, when I think I was at a great level,\" he added.\n\"It's tough to stay at that level, I want to keep growing and improving.\"\nIt's only a matter of time before De Gea replaces Casillas in goal for Spain but many believe it should be sooner rather than later if La Roja are to have the best chance of claiming a third straight continental crown next July.\n ", "external_links": ["https://twitter.com/AO_Sports", "https://www.facebook.com/AhramOnlineSports?fref=ts"], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-13T16:53:20.659+03:00", "highlightTitle": ""}