{"organizations": [], "uuid": "b45c65d601964df09e4c49efc948e6232fead6ab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.timesunion.com", "main_image": "http://www.timesunion.com/img/pages/article/opengraph_default.jpg", "site_section": "http://www.timesunion.com/default/feed/default/feed/Sports-News-64.php", "section_title": "Sports News", "url": "http://www.timesunion.com/sports/article/H-S-roundup-Alexis-Romeyn-scores-three-goals-to-6571555.php", "country": "US", "title": "H.S. roundup: Alexis Romeyn scores three goals to lead St. Johnsville girls' soccer", "performance_score": 0, "site": "timesunion.com", "participants_count": 1, "title_full": "H.S. roundup: Alexis Romeyn scores three goals to lead St. Johnsville girls' soccer - Times Union", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T14:47:00.000+03:00", "replies_count": 0, "uuid": "b45c65d601964df09e4c49efc948e6232fead6ab"}, "author": "Staff reports", "url": "http://www.timesunion.com/sports/article/H-S-roundup-Alexis-Romeyn-scores-three-goals-to-6571555.php", "ord_in_thread": 0, "title": "H.S. roundup: Alexis Romeyn scores three goals to lead St. Johnsville girls' soccer", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Oppenheim-Ephratah/St. Johnsville clinched the Western Athletic Conference North Division with a 3-1 victory over host Galway on Wednesday in a girls' soccer clash.\nAlexis Romeyn scored all three goals for St. Johnsville, which improved to 8-0-2 to seal the division title.\nGriffin Gannon scored the lone goal for Galway, which fell to 5-3-2 with the loss.\nGirls' tennis: Sam Montague , Elizabeth Esker and Sophia Schaub all won their singles matches in straight sets to lead Scotia over Amsterdam, 7-0, in the Class A quarterfinals. ... Greenwich topped Maple Hill, 5-2, in their Class C/D semifinal contest. Casey Hunter, Caitlyn Robertson and Danielle McFee led the Witches with singles wins while the teams of Sophie Manera and Val Bowden, and Maddy Brophy and Sarah Mueller had doubles victories for Greenwich, which advances to the C/D final to take on top-seeded Schoharie.\nBoys' soccer: Brendan Gerrain scored on a penalty kick with 21 minutes left in the game to spark Maple Hill over Cairo-Durham, 1-0, in a Patroon Conference game. Greg Roe made four saves for the Wildcats (15-0). Ethan Yates was solid in net for the Bulldogs with 10 saves. ... Collin Morency scored three goals, including the game winner in overtime, to rally Greenwich, ranked 14th in the state in Class C, to 3-2 win over Hoosick Falls in a Wasaren League game. The Witches trailed 2-0 until Morency scored his first goal early in the second half. He tied the game with five minutes left and netted the winner in the first overtime on a feed from Ken Knapp . Jake Kinney scored on a direct kick in the first half and Tyler Gaines added a second goal in the first half to stake Hoosick Falls to a 2-0 lead.\nBoys' volleyball: Tom Hurley had 31 assists, one block and one dig as Shenendehowa topped Shaker, 3-0, in a Suburban Council match on Senior Night at Shen. Mitch DeBartoli added eight kills for the Plainsmen. ... Cody Pearce had nine assists, seven kills and two blocks to lead Burnt Hills to a straight-sets win (25-13, 25-8, 25-12) win over Saratoga in another Suburban match. Brad Albright had seven kills and two blocks and Lorenzo Kowliek added six kills for the Spartans (14-4, 12-2).\nField hockey: Saratoga nipped Bethlehem, 2-1, in a Suburban Council game at Bethlehem. Lindsay Frank scored twice for Saratoga.", "external_links": [], "published": "2015-10-15T14:47:00.000+03:00", "crawled": "2015-10-15T14:39:08.462+03:00", "highlightTitle": ""}