{"organizations": [], "uuid": "9f283b8f8a3bbc22b48649bf13d04da8fce416f6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nydailynews.com", "main_image": "http://assets.nydailynews.com/polopoly_fs/1.2409225!/img/httpImage/image.jpg_gen/derivatives/landscape_1200/lvpill24n-2-web.jpg", "site_section": "http://www.nydailynews.com/news/index.html", "section_title": "Breaking, Local and National News, Sports &amp; Entertainment - NY Daily News", "url": "http://www.nydailynews.com/news/national/pharmaceutical-offers-1-option-turing-750-aids-drug-article-1.2409227", "country": "US", "title": "Pharmaceutical offers $1 option to Turing’s $750 AIDS drug", "performance_score": 1, "site": "nydailynews.com", "participants_count": 1, "title_full": "Pharmaceutical offers $1 option to Turing’s $750 AIDS drug - NY Daily News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T03:00:00.000+03:00", "replies_count": 0, "uuid": "9f283b8f8a3bbc22b48649bf13d04da8fce416f6"}, "author": "NEW YORK DAILY NEWS", "url": "http://www.nydailynews.com/news/national/pharmaceutical-offers-1-option-turing-750-aids-drug-article-1.2409227", "ord_in_thread": 0, "title": "Pharmaceutical offers $1 option to Turing’s $750 AIDS drug", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "@MartinShkreli/via Twitter Martin Shkreli, CEO of Turing Pharmaceuticals, came under fire last month for raising the price of the drug Daraprim from $13 to $750. Imprimis Pharmaceuticals is now offering a substitute drug for $1 a tablet. A San Diego pharmaceutical company is sticking it to the reviled ex-hedge funder who raised the price of a life-saving drug for AIDS and cancer patients from $13.50 to $750 a tablet.\nImprimis Pharmaceuticals announced Thursday it plans to offer a cheap alternative to the outrageously priced drug sold by Martin Shkreli's Turing Pharmaceuticals.\nLast month, the CEO of Turing raised fury for increasing the price of Daraprim overnight.\nEDITORIAL: ADDICTED TO PROFITS\nBecause Turing Pharmaceuticals is the sole provider of Daraprim — a drug that combats toxoplasmosis — Imprimis set out to create a similar, customized drug that could be sold for as low as $1 per pill.\nThe disease, caused by the gondii parasite, can prove deadly for those whose immune systems have been weakened by AIDS, cancer or pregnancy.\n\"While we respect Turing's right to charge patients and insurance companies whatever it believes is appropriate, there may be more cost-effective compounded options for medications, such as Daraprim, for patients, physicians, insurance companies and pharmacy benefit managers to consider,\" Mark L. Baum, CEO of Imprimis, said in a statement .\nBaum said this wasn't the first time the price of a \"sole supply generic drug\" spiked to unaffordable heights.\nShkreli's move was denounced as greedy, sparking outrage among citizens, politicians and even other pharmaceutical companies.\n\"My salary is zero dollars,\" Shkreli told Fox Business Friday morning . \"The average Big Pharma CEO makes millions of dollars.\"\nThe Turning CEO explained his company was not yet profitable and therefore wasn't being paid a salary. Adding that the criticism he'd been under was unfounded.\nNational Library of Medicine Daraprim combats toxoplasmosis - a disease caused by the gondii parasite that can prove deadly for those whose immune systems have been weakened by AIDS, cancer or pregnancy. Regarding the Imprimis announcement, Shkreli told Fox he \"wasn't too worried\" about his competition.\n\"I think our product is superior and patients will choose to use ours,\" he said.\nHe explained that insurance companies end up picking up most of the tab anyway, so patients don't have to pay hundreds of dollars for the drug.\n\"We care about every single patient,\" Shriekel told Fox. \"Especially the patients who are most in need.\"\nRibarra@nydailynews.com\nRelated Stories Frank Huyler: Pills too bitter to swallow Company accused of 'price gouging' to drop $750 drug cost Drug company raises parasite pill price from $13.50 to $750", "external_links": ["http://video.foxbusiness.com/v/4574821494001/turing-ceo-sanders-is-a-demagogue-hell-say-anything-to-get-a-vote/?#sp=show-clips", "http://imprimispharma.investorroom.com/2015-10-22-Imprimis-Pharmaceuticals-to-Make-Compounded-and-Customizable-Formulation-of-Pyrimethamine-and-Leucovorin-Available-for-Physicians-to-Prescribe-for-their-Patients-as-an-Alternative-to-Daraprim", "http://launch.newsinc.com/js/embed.js"], "published": "2015-10-24T03:00:00.000+03:00", "crawled": "2015-10-24T01:56:40.914+03:00", "highlightTitle": ""}