{"organizations": [], "uuid": "52f0453480f4f964340642d04077dfe55d50f957", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kptv.com", "main_image": "", "site_section": "http://kptv.com/category/208630/sports?clienttype=rss", "section_title": "KPTV.com - Sports", "url": "http://www.kptv.com/story/30188723/priest-accused-of-pointing-musket-at-boy-over-football-teams", "country": "US", "title": "Priest accused of pointing musket at boy over football teams", "performance_score": 0, "site": "kptv.com", "participants_count": 1, "title_full": "Priest accused of pointing musket at boy over football teams - KPTV - FOX 12", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "52f0453480f4f964340642d04077dfe55d50f957"}, "author": "cbs8", "url": "http://www.kptv.com/story/30188723/priest-accused-of-pointing-musket-at-boy-over-football-teams", "ord_in_thread": 0, "title": "Priest accused of pointing musket at boy over football teams", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LITTLE FERRY, N.J. (AP) - A priest accused of pointing a functioning but unloaded musket at an 8-year-old boy in a church's rectory will plead not guilty, his lawyer said, explaining it as a joke spurred by the rivalry between the New York Giants and the Dallas Cowboys.\nThe Rev. Kevin Carter is to be arraigned Tuesday on charges of child endangerment and aggravated assault by pointing a firearm, lawyer Harold Cassidy told The Record ( http://bit.ly/1FSF7yH ).\nThe priest, who was charged last week and is free on $15,000 cash bail, expressed concern on Monday for any \"trauma\" that publicity from the case may have caused the boy and his family. But in a statement issued by his lawyer, the 54-year-old priest said he was \"confident\" he would be vindicated.\nThe charges against Carter stem from a Sept. 13 incident at St. Margaret of Cortona Roman Catholic Church in Little Ferry.\nCarter, an avid Giants fan, and the boy, who roots for the Cowboys, were talking about football. The NFL teams were scheduled to play that night.\nProsecutor John Molinelli said Carter asked the boy to step into one of the rectory's rooms and stand against a wall, where he pointed the musket at him.\nCassidy, the lawyer, said Carter had been wrongfully charged over what happened between him and the boy, calling it \"an innocent banter.\"\n\"So when somebody saw the young fellow with the Cowboy jersey, they thought it was a great opportunity to rib Father about the game that day, between the Cowboys and the Giants,\" Cassidy said. \"So the family initiated the discussion and sought to initiate an exchange, a good-natured ribbing, between the two of them. ... It's incorrect to think the child was in fear. He was not.\"\nA parishioner reported the incident to the Archdiocese of Newark late last month, and officials there notified prosecutors.\nAt Masses on Sunday, parishioners voiced support for Carter and applauded when he began the services by reading a statement maintaining his innocence, the newspaper reported. He told his congregation the charges reflect misinterpreted \"jesting\" between him and the boy.\nMolinelli has said he doesn't consider pointing a gun at someone, especially a child, to be a joke.\nThe Cowboys beat the Giants 27-26.\n___\nInformation from: The Record (Woodland Park, N.J.), http://www.northjersey.com \nCopyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-06T07:38:40.283+03:00", "highlightTitle": ""}