{"organizations": [], "uuid": "a4633a404c7ea2bcb28a9bbb4d7585666ae13f91", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-561bf1fb/turbine/ct-chris-erskine-middle-ages-millennials-pledge-20151012", "site_section": "http://www.chicagotribune.com/", "section_title": "Chicago Tribune: Chicago breaking news, sports, business, entertainment, weather and traffic - Chicago Tribune", "url": "http://www.chicagotribune.com/lifestyles/ct-chris-erskine-middle-ages-millennials-pledge-20151012-story.html", "country": "US", "title": "The Middle Ages: On adulthood&apos;s cusp, take &apos;The Millennial Pledge&apos;", "performance_score": 0, "site": "chicagotribune.com", "participants_count": 1, "title_full": "The Middle Ages: On adulthood&apos;s cusp, take &apos;The Millennial Pledge&apos; - Chicago Tribune", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T20:47:00.000+03:00", "replies_count": 0, "uuid": "a4633a404c7ea2bcb28a9bbb4d7585666ae13f91"}, "author": "Chris Erskine", "url": "http://www.chicagotribune.com/lifestyles/ct-chris-erskine-middle-ages-millennials-pledge-20151012-story.html", "ord_in_thread": 0, "title": "The Middle Ages: On adulthood&apos;s cusp, take &apos;The Millennial Pledge&apos;", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I admire and adore the millennials. Obviously, it's because I am one.\nThat doesn't mean that we millennials, ages 18 to 34, can't do better. Below is a pledge all of us should take publicly, as per a bar mitzvah or a wedding, signifying a ceremonial crossing into adulthood.\nNot that I recommend adulthood. But like broken hearts or hip replacements, we all eventually have one.\n\"The Millennial Pledge\":\n• I am entitled to nothing.\n• I will show up on time.\n• I will not shun comedians or college commencement speakers just because I don't agree with them.\n• Just once, I will try driving without texting.\n• Just once, I will try eating without texting.\n• I will not consider the cilantro on my taco to be a vegetable.\n• I will learn to laugh at everything, especially myself.\n• When meeting someone for the first time, I will always look him or her in the eye.\n• I will not burn bridges.\nWhen I finally move out of my parents' home, I will not take all their vodka and half their towels. - • I will not burn overpasses.\n• Each year, I will pen at least one thank-you note, using what's left of my cursive writing skills.\n• I will be resourceful, creative and authentic.\n• I will vote. Always.\n• I will (mostly) swear off smut.\n• I will not be smut.\n• I will learn all my siblings' names (even the younger ones).\n• I will not spend an entire weekend exploring my own mouth with a coffee straw.\n• I will learn to pick my battles.\n• When I don't get my way, I will learn to roll with it.\n• I will not go on a job interview in shorts and flip-flops, even if \"this job is so beneath me.\"\n• Nothing is beneath me.\n• I promise not to misuse the word \"literally.\" As in \"I am literally dying of hunger\" or \"You are literally being so rude.\"\n• If my first-born is a boy, I promise not to name him Uber.\n• When I finally move out of my parents' home, I will not take all their vodka and half their towels.\n• I will not use crowd-funding to pay for my first car.\n• If I can't afford car insurance, I won't spend $20 a day on coffee.\n• I won't give only gift cards for Christmas.\n• I won't sneak texts during funerals even if it's \"totally boring and the dead guy is just lying there anyway.\"\n• At holiday dinners, I will leave my phone in my room.\n• All those T-shirts? I will wash them.\n• I will not use pepper spray to season a burrito.\n• I will not run up my credit cards.\nYounger adults put financial security ahead of marriage, kids: survey Heidi Stevens Lurching toward the American Dream is harder in just about every way — finding affordable housing, managing finances and debt, finding steady work, supporting a family — than in previous generations, the vast majority of Americans said in a new Heartland Monitor survey .\nThe survey, sponsored by...\nLurching toward the American Dream is harder in just about every way — finding affordable housing, managing finances and debt, finding steady work, supporting a family — than in previous generations, the vast majority of Americans said in a new Heartland Monitor survey .\nThe survey, sponsored by...\n(Heidi Stevens) • I will save 10% of everything I earn.\n• If I hate my new job, I will not fake my own death. I will give a full two weeks' notice like grown-ups usually do.\n• I will force myself to finally make a phone call.\n• In high school or college, I will get a part-time job. Even if it's beneath me.\n• Again, nothing is beneath me.\n• Well, most things are not beneath me.\n• I promise not to text anything of life-changing significance: a marriage proposal, a divorce decree, a positive result.\n• When I get my way, I will be grateful and not assume that I will always get my way.\n• I will always remember Aristotle's Quote: : \"It is the mark of an educated mind to be able to entertain a thought without accepting it.\"\n• At least once a week, I will hug my mom the way I hug my friends every single time I see them.\n• I will do nice things just because.\n• I will live each day.\n• I will sleep each night.\n• I am entitled to nothing but that.\nchris.erskine@latimes.com\nTwitter: @erskinetimes\nMORE FROM THE MIDDLE AGES:\nCutting strangers some slack (but not getting any when it comes to college loans)\nHow to keep your young son from becoming an old man\nAs a new school year begins, this dad laments a culture where 'too soon is never soon enough'\n ", "external_links": ["http://www.latimes.com/home/la-hm-erskine-20150905-column.html", "http://www.latimes.com/home/la-hm-erskine-20150919-column.html", "http://www.trbimg.com/img-557efda3/turbine/ct-delay-marriage-and-kids-heartland-poll-balancing-20150615", "http://www.trbimg.com/img-561bf1fb/turbine/ct-chris-erskine-middle-ages-millennials-pledge-20151012", "http://www.twitter.com/erskinetimes", "http://www.latimes.com/home/la-hm-erskine-20150912-column.html"], "published": "2015-10-12T20:47:00.000+03:00", "crawled": "2015-10-12T22:33:29.199+03:00", "highlightTitle": ""}