{"organizations": [], "uuid": "30542d576ff0e2d59976f428660ba057cb51c5f6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.winnipegfreepress.com", "main_image": "http://media.winnipegfreepress.com/designimages/fb-og-image.png", "site_section": "http://www.winnipegfreepress.com/rss/?path=/sports", "section_title": "Winnipeg Free Press: Sports", "url": "http://www.winnipegfreepress.com/sports/whitecaps-tie-fc-dallas-clinch-mls-playoff-spot-for-second-straight-season-331184631.html", "country": "US", "title": "Whitecaps tie FC Dallas 0-0, clinch MLS playoff spot for second straight season", "performance_score": 0, "site": "winnipegfreepress.com", "participants_count": 1, "title_full": "Whitecaps tie FC Dallas 0-0, clinch MLS playoff spot for second straight season - Winnipeg Free Press", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T02:09:00.000+03:00", "replies_count": 0, "uuid": "30542d576ff0e2d59976f428660ba057cb51c5f6"}, "author": "Joshua Clipperton, The Canadian Press", "url": "http://www.winnipegfreepress.com/sports/whitecaps-tie-fc-dallas-clinch-mls-playoff-spot-for-second-straight-season-331184631.html", "ord_in_thread": 0, "title": "Whitecaps tie FC Dallas 0-0, clinch MLS playoff spot for second straight season", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "VANCOUVER - The Vancouver Whitecaps limped into the playoffs on Wednesday night — both on the field and in the standings.\nDavid Ousted made a couple of big saves in an uninspired 0-0 draw with FC Dallas as the Whitecaps clinched a spot in Major League Soccer's post-season for the second straight year while also losing two more key players to injury.\n\"I'm happy we're in the playoffs,\" said Vancouver head coach Carl Robinson. \"Performance, I think we need to be better. We can be better.\"\nThe Whitecaps were without Pedro Morales and Nicolas Mezquida, and they will likely be joined on the shelf by fellow midfielders Cristian Techera (hamstring) and Mauro Rosales (groin) after both had to be subbed off in the second half.\n\"It's tough right now,\" said Ousted. \"A lot of people are dropping,\"\nThe injury situation is so bad that Robinson jokingly asked a local reporter if he would be willing to suit up next game.\n\"We're down to the bare bones,\" said Robinson. \"But we'll deal with it.\"\nVancouver (15-12-5, 50 points) could have moved into top spot in the Western Conference with a victory in the first game of a crucial home-and-home series with Dallas (15-10-6, 51 points), which hosts the return match on Oct. 14.\nWith the point, Dallas tied the Los Angeles Galaxy atop the West on points with a game in hand.\nVancouver, which has only two wins in the league since the middle of August, plays just once more after next week — at home against the Houston Dynamo on Oct. 25.\nThe top two teams in each conference get byes to the second round of the playoffs, while No. 3 plays No. 6 and No. 4 plays No. 5 in single elimination games, meaning that getting into the top two makes the road a lot easier.\n\"We're in the playoffs, but we're disappointed,\" said Ousted, who was at fault for San Jose's goal in a 1-1 tie with the Earthquakes on Saturday. \"There's still more to come from us and we need to find that these last couple of games.\"\nLooking to break down a Dallas team content to sit back, Vancouver midfielder Kekuta Manneh tested Dallas goalkeeper Jesse Gonzalez with a shot from distance in the 48th minute before Rosales dragged a shot wide moments later.\nDallas forward David Texeira had a great chance in the 64th, but Ousted made a terrific diving save.\nVancouver had a golden opportunity to grab the lead in the 74th minute, but Techera's heavy touch took him out of position before the midfielder fired weak and wide.\nTechera and Morales were replaced 11 minutes apart for their injuries, with Robinson throwing on Darren Mattocks and Robert Earnshaw in an attempt to snag all three points.\nBut it was the visitors who had the best chance to win it when substitute Blaz Perez's shot in the 90th minute just slipped wide.\nApart from the injuries, the Whitecaps were missing half their regular starting backline with Kendall Waston away on international duty and Steven Beitashour suspended for yellow card accumulation.\nVancouver had a couple of chances in the first 15 minutes off two headers from Octavio Rivero, with the second looping effort landing on top of the crossbar and going out for a goal kick.\nOusted stopped Dallas midfielder Mauro Diaz in the 20th before having to make another big save off on-rushing defender Ryan Hollingshead four minutes later.\n\"We know we need to play better,\" said Robinson. \"We're going to try and hit form in the last two games with a smile on our face.\"\nNotes: Vancouver was also minus three Canadian youngsters who could have figured into selection, but were instead away with the national team — defender Sam Adekugbe, and midfielders Kianz Froese and Marco Bustos. ... Attendance was 19,339.\n___\nFollow @JClipperton_CP on Twitter\n ", "external_links": [], "published": "2015-10-08T02:09:00.000+03:00", "crawled": "2015-10-08T09:18:57.401+03:00", "highlightTitle": ""}