{"organizations": ["Diego Costa"], "uuid": "c4d769316846d94caf6c7a553cea5cf29feb78ea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.sky.com", "main_image": "http://media.skynews.com/media/images/generated/2015/10/9/423163/default/v1/gettyimages-488604106-1-1600x900.jpg", "site_section": "http://feeds.skynews.com/feeds/rss/sports.xml", "section_title": "Sports News - Latest Sports and Football News | Sky News", "url": "http://news.sky.com/story/1566654", "country": "IL", "title": "Players To Blame For Chelsea Woes, Says Costa", "performance_score": 0, "site": "sky.com", "participants_count": 0, "title_full": "Players To Blame For Chelsea Woes, Says Costa", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T13:37:00.000+03:00", "replies_count": 0, "uuid": "c4d769316846d94caf6c7a553cea5cf29feb78ea"}, "author": "", "url": "http://news.sky.com/story/1566654", "ord_in_thread": 0, "title": "Players To Blame For Chelsea Woes, Says Costa", "locations": ["UK"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Chelsea"], "text": "Players To Blame For Chelsea Woes, Says Costa 11:37, UK, Friday 09 October 2015 Share by email Diego Costa has admitted he reported for pre-season overweight - and says Chelsea's players are to blame for their poor results. \nChelsea took the unusual step of publicly backing Jose Mourinho this week after a home defeat to Southampton left the champions with just eight points from eight Premier League games. \nMourinho insists he still has the support of his squad, a claim borne out by the public statements of John Terry and Cesc Fabregas in recent days. \nAnd now last season's top scorer Costa has laid the blame for Chelsea's shocking start squarely at the feet of the players - himself included. \n\"We know we're not in the form we were supposed to be at the beginning of the season,\" said Costa, who has scored just twice in eight games. \n\"We need to blame the players because we came back from holiday very confident, thinking we could go back into how it was last season, and then realised the team was already in a bad situation. \n\"I'm going to be very honest - maybe a few weeks ago, five or six weeks ago, I was not on top of my game. At least physically. We talk within the players and we know that, maybe at the beginning, we were not 100% as we were supposed to be when we got here. \n\"I got injured at the end of last season and then I went on holiday. Maybe I got out of my diet and, when I came back, I was not the way I was supposed to be. I was a little bit overweight. That affected my game. \n\"You can be selfish and blame it on the manager, but I'm not going to do that. I'm responsible 100% and so are the other guys. So all we can do now is train very hard and work very hard to try to get back to that level where we were the season before.\" \nCosta also gave his manager a glowing reference, claiming a \"million players\" would want to work with Mourinho, Pep Guardiola or Diego Simeone above any other bosses. \nHe said: \"I'm here because I'm happy with the manager, but I'm not only speaking on my behalf. I am here to speak for everyone, for the group. All that matters at the end of the day is the group. \n\"I have spoken to all of the players and they all feel the same way about Jose. I don't like giving interviews, but I'm speaking for the group. We all feel the same way about Jose.\" \nCosta has served a three-match ban for a clash with Arsenal's Laurent Koscielny and will be available when Chelsea host Aston Villa after the international break. Promoted Stories", "external_links": [], "published": "2015-10-09T13:37:00.000+03:00", "crawled": "2015-10-09T15:01:51.608+03:00", "highlightTitle": ""}