{"organizations": [], "uuid": "168497d7cf4f8b5087c26053a7e6cae3d10d926b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "nypost.com", "main_image": "https://thenypost.files.wordpress.com/2015/10/isles-russian.jpg", "site_section": "http://nypost.com/sports/feed/", "section_title": "| Sports | New York Post", "url": "http://nypost.com/2015/10/01/isles-petrov-stating-his-case-while-making-khl-to-nhl-transition/", "country": "", "title": "Isles’ Petrov stating his case while making KHL to NHL transition", "performance_score": 0, "site": "nypost.com", "participants_count": 1, "title_full": "Isles’ Petrov stating his case while making KHL to NHL transition | New York Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T01:40:00.000+03:00", "replies_count": 0, "uuid": "168497d7cf4f8b5087c26053a7e6cae3d10d926b"}, "author": "Brett Cyrgalis", "url": "http://nypost.com/2015/10/01/isles-petrov-stating-his-case-while-making-khl-to-nhl-transition/", "ord_in_thread": 0, "title": "Isles’ Petrov stating his case while making KHL to NHL transition", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "With the Islanders beginning their tenure in Brooklyn as Mikhail Prokhorov attempts sole ownership of Barclays Center, it’s only appropriate the team adds another Russian, no?\nForward Kirill Petrov is among the last few fighting for an Islanders roster spot. The 25-year-old from Kazan, Russia, came over from the KHL this summer and signed a one-year, entry-level deal to try his hand at the North American game.\nAlthough it would be easy for him to start the season at AHL Bridgeport (in fact the Islanders’ top 12 forwards are pretty well set in stone), the 6-foot-3, 225-pounder is making it difficult for coach Jack Capuano to send him away, even though waivers aren’t required for him to be sent down.\n“It’s going to be tough,” Capuano said after Thursday’s practice, with only one more preseason game, scheduled for Sunday at 5 p.m. in Washington. “We have some competition, and [Petrov] is right there. He’s right there.”\nThe Islanders had a lot of highly touted prospects in camp — along with one of 2014’s first-round picks, Josh Ho-Sang, who never made it to the ice, getting sent back to juniors after oversleeping on the first day of camp. But the likes of Michael Dal Colle (No. 5-overall in 2014) and Anthony Beauvillier (No. 28-overall this year) already have been sent back.\nMathew Barzal (No. 16-overall this year) remains, and is fighting to be that extra forward with Petrov, along with veteran addition Steve Bernier, who practiced fully Thursday for the first time in a couple of days.\n“Some of the other guys that we’ve talked about, the time wasn’t right for them,” Capuano said. “But [Petrov] a little bit older, he’s played in the KHL, he’s got some experience, he’s played against some good players. So he’s real close. To me, we still have the one exhibition game left, then we’ll decide what we’re going to do.”\nWhat has made things easier for Petrov is that the Islanders already have two Russians on the team in Mikhail Grabovski and Nikolay Kulemin. Understanding a little bit of English, but needing an interpreter to speak it, Petrov has leaned on his two countrymen to help him learn Capuano’s system and assimilate to life in New York.\n“He’s always asking [questions],” Grabovski said. “He learns. He knows ‘Yes, no, thank you.’ Also, ‘F—.’”\nThe big difference between the KHL game and the NHL is the size of the ice, with the Russian-based league playing on the larger, international surface. But that is something that Petrov is starting to figure out quickly.\n“First [preseason] game against Philadelphia, the first 10 minutes, it was hard to get used to it,” Petrov’s interpreter said Thursday. “Then, he gets used to it, and guys try to help him. And it’s getting better and better. It’s not a major problem, it just needs a little bit of time. Just needs time and he’s ready to play in the small rink.”\nPlaying parts of nine seasons in Russia’s top division, Petrov has put up 125 points (61 goals, 64 assists) in 318 games with Ak-Bars and Yugra Khanty-Mansiysk. Although that’s a lot different than doing it in the NHL, some of that skill already is shining through.\n“I think he’s a big body, he’s played physical, he’s got a really good scoring touch,” Capuano said. “He’s starting to understand the systems and the way that we want to play. Probably a little different than what he’s used to playing. I’ve been impressed up until this point.”\nStarting goalie Jaroslav Halak participated lightly in practice for about 20 minutes before going off. He has been “day-to-day” with an undisclosed injury, and Capuano said he doesn’t know if Halak will be ready for the regular-season opener Oct. 9 against the Blackhawks in Brooklyn.\nShare this: Facebook Twitter Google Whatsapp Email Filed under new york islanders", "external_links": [], "published": "2015-10-02T01:40:00.000+03:00", "crawled": "2015-10-02T05:47:56.352+03:00", "highlightTitle": ""}