{"organizations": ["Minnesota Lynx", "Facebook Email Twitter Google", "AP", "LinkedIn Pinterest Lynx", "Facebook Lynx"], "uuid": "54b795b0aac46b93659b7ff0f77bc35a1d18af52", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.argusleader.com", "main_image": "http://www.gannett-cdn.com/-mm-/5d5b11a6e48613667c916c8c25a49845e5fc39fb/c=0-113-2120-1311&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/14/USATODAY/USATODAY/635804601651996338-AP-WNBA-FINALS-BASKETBALL-76741182.JPG", "site_section": "http://rssfeeds.argusleader.com/siouxfalls/sports", "section_title": "Sioux Falls - Sports", "url": "http://www.argusleader.com/story/sports/college/south-dakota-state-university/2015/10/14/sdsu-picked-sweep-summit-usds-seekamp-preseason-poy-pick/73962752/", "country": "US", "title": "Lynx capture third title in five years with 69-52 win in Game 5", "performance_score": 0, "site": "argusleader.com", "participants_count": 0, "title_full": "Lynx capture third title in five years with 69-52 win in Game 5", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T06:57:00.000+03:00", "replies_count": 0, "uuid": "54b795b0aac46b93659b7ff0f77bc35a1d18af52"}, "author": "", "url": "http://www.argusleader.com/story/sports/college/south-dakota-state-university/2015/10/14/sdsu-picked-sweep-summit-usds-seekamp-preseason-poy-pick/73962752/", "ord_in_thread": 0, "title": "Lynx capture third title in five years with 69-52 win in Game 5", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Sylvia Fowles", "Augustus", "Jim Mone"], "text": "Facebook Email Twitter Google+ LinkedIn Pinterest Lynx capture third title in five years with 69-52 win in Game 5 Sylvia Fowles had 20 points and 11 rebounds, and the Minnesota Lynx captured their third championship in five years with a 69-52 victory over the Indiana Fever in Game 5 of the WNBA Finals on Wednesday night. Post to Facebook Lynx capture third title in five years with 69-52 win in Game 5 Sylvia Fowles had 20 points and 11 rebounds, and the Minnesota Lynx captured their third championship in five years with a 69-52 victory over the Indiana Fever in Game 5 of the WNBA Finals on Wednesday night. Check out this story on USATODAY.com: http://usat.ly/1RJ7Bg7 Cancel Send A link has been sent to your friend's email address. Posted! A link has been posted to your Facebook feed. Join the Nation's Conversation To find out more about Facebook commenting please read the Conversation Guidelines and FAQs Lynx capture third title in five years with 69-52 win in Game 5 AP 11:57 p.m. EDT October 14, 2015 Minnesota Lynx center Sylvia Fowles celebrates with Seimone Augustus after beating the Indiana Fever 69-52 in Game 5 of the WNBA basketball finals. (Photo: Jim Mone, AP) 28 CONNECT 70 TWEET LINKEDIN COMMENT EMAIL MORE \nMINNEAPOLIS (AP) — With a suffocating defense and a yearning to celebrate in front of their loyal fans, the Minnesota Lynx turned a tense WNBA Finals into a runaway. \nSylvia Fowles had 20 points and 11 rebounds, and the Lynx captured their third championship in five years with a 69-52 victory over the Indiana Fever in Game 5 on Wednesday night. \nSeimone Augustus added 16 points and Rebekkah Brunson grabbed 14 rebounds for the Lynx, who also won it all in 2011 and 2013. Maya Moore scored just five points on 1-for-8 shooting, but the Lynx defense forced 21 turnovers and held Indiana to 35.7 percent shooting in the league's first Game 5 since 2009. Scintillating Fever season ends with tough loss \n\"This never gets old,\" champagne-soaked Lynx coach Cheryl Reeve said. \nTamika Catchings had 18 points and 11 rebounds for the Fever, who were looking for their second championship. \nFinally, the Lynx got to celebrate on their home court. \nThey won their first two titles on the road in Atlanta, forcing the success-starved Twin Cities sports fans to revel from afar. When the final buzzer sounded, a franchise-record 18,933 fans waved white towels while singer Prince watched from a suite above Target Center's lower bowl. \nAnd celebrate they did. \nAugustus shed tears of joy after a throwback performance. Owner Glen Taylor hugged Cheryl Reeve, and Moore leaped on to the scorer's table and pumped her fists toward the crowd. Maya Moore lifts team to 2-1 lead in the WNBA finals with heart-stopping buzzer-beater \n\"We kept grinding and working despite everything that we've been through,\" Augustus said. \nIt was a stunning collapse for the previously unflappable Fever, who had staved off elimination five straight times in these playoffs leading into Game 5. \nJanuary and Catchings helped turn Indiana into a tough, confident bunch that erased an 18-point deficit to beat the New York Liberty in Game 2 of the Eastern Conference finals, but finally ran into a wall they couldn't break through at the boisterous Target Center. \nIn the second and third quarters, the Fever scored 12 points total and turned the ball over 17 times. \nStar guard Briann January scored six points in the first quarter for Indiana, but didn't get her next bucket until six minutes were gone in the third. She finished with 13 points on 6-for-15 shooting. Catchings helps Briann January become a Fever leader \n\"They just outplayed us in every single way,\" Fever coach Stephanie White said. \"They looked like a team that was on a mission and they played like it.\" \nThe game got off to an ugly start, with the Lynx slugging out a 27-21 lead at halftime in the lowest-scoring first half in finals history. Neither team could hit a shot or hold on to the ball, and Moore was held to just three points on 1-for-5 shooting. \nThe Lynx kept the defense set to stifling in the second half, but finally started to generate a little offense in the third to gradually pull away. \nFowles, who was named series MVP, had her way inside as she did for much of the series and finally got some help from Augustus, who chipped in a vintage jumper and drive before Renee Montgomery turned the 20th turnover of the game into a layup just before the third-quarter buzzer that pushed Minnesota's lead to 19 points. \nIn a community that has suffered through so much sports heartache over the last two decades, the Lynx have cemented themselves as a welcome respite. The record crowd that turned out for Game 5 got to watch a star-studded team that has become the league's gold standard finish off one of the most impressive five-year runs in WNBA history. \nFour finals appearances. A championship every other season starting in 2011. And on Wednesday night, a little revenge that was three years in the making. \nThe Fever stunned the heavily favored Lynx in 2012, beating them at home in Game 1 and finishing them off back home in Indiana to dethrone the champions. The Lynx came back to win it in 2013 before losing to Phoenix in the Western Conference finals last year. \nThe march to their third championship was harder than ever, with stars Lindsay Whalen and Augustus missing big chunks of time with injuries and a style-altering trade that brought Fowles to the post midseason. \nReeve said the struggles made her veteran core appreciate this run more than any other, and they partied like it. \n\"Wasn't a perfect year, perfect series or a perfect game,\" Moore said. \"But we're champions.\" \nPHOTOS: BEST OF THE WNBA FINALS A link has been posted to your Facebook feed. Minnesota Lynx players celebrate their championship against the Indiana Fever at Target Center. Brad Rempel, USA TODAY Sports Minnesota Lynx players celebrate their championship against the Indiana Fever at Target Center. Brad Rempel, USA TODAY Sports The Minnesota Lynx celebrate a win in Game Five of the 2015 WNBA Finals against the Indiana Fever. Hannah Foslien, Getty Images Minnesota Lynx players celebrate with the championship trophy after beating the Indiana Fever 69-52 in Game 5 of the WNBA basketball finals. Jim Mone, AP Lindsay Whalen of the Minnesota Lynx celebrates a win in Game Five of the 2015 WNBA Finals against the Indiana Fever. Hannah Foslien, Getty Images Confetti drops from the ceiling after the game between the Minnesota Lynx an Indiana Fever at Target Center. The Minnesota Lynx beat the Indiana Fever 69-52. Brad Rempel, USA TODAY Sports Minnesota Lynx forward Maya Moore picks up head coach Cheryl Reeve after the game against the Indiana Fever at Target Center. Brad Rempel, USA TODAY Sports Lindsay Whalen, Maya Moore and Sylvia Fowles of the Minnesota Lynx celebrate a win in Game Five of the 2015 WNBA Finals against the Indiana Fever. Hannah Foslien, Getty Images Indiana Fever guard Marissa Coleman shoots as Minnesota Lynx forward Devereaux Peters, center Sylvia Fowles and Seimone Augustus defend in the first half of Game 5 of the WNBA basketball finals, Wednesday, Oct. 14, 2015, in Minneapolis. Stacy Bengs, AP Indiana Fever forward Tamika Catchings dives for the ball as Minnesota Lynx forward Maya Moore dribbles in the first half of Game 5 of the WNBA basketball finals. Stacy Bengs, AP Minnesota Lynx forward Maya Moore in the second quarter against the Indiana Fever at Target Center. Brad Rempel, USA TODAY Sports A fan entertains the crowd during a timeout in a game between the Minnesota Lynx and Indiana Fever in the second quarter at Target Center. Brad Rempel, USA TODAY Sports Indiana Fever head coach Stephanie White talks to guard Shavonte Zellous in the first quarter against the Minnesota Lynx at Target Center. Brad Rempel, USA TODAY Sports Minnesota Lynx head coach Cheryl Reeve in the first quarter against the Indiana Fever at Target Center. Brad Rempel, USA TODAY Sports Game 4 in Indianapolis: Fever 75, Lynx 69 — Indiana huddles in celebration after forcing a decisive Game 5. Brian Spurlock, USA TODAY Sports Game 4 in Indianapolis: Fever 75, Lynx 69 — Indiana guard Shavonte Zellous celebrates from the bench after a big second-half bucket. Brian Spurlock, USA TODAY Sports Game 4 in Indianapolis: Fever 75, Lynx 69 — Indiana forward Marissa Coleman (25) tries to back down Minnesota defender Maya Moore (23) during the second half. Brian Spurlock, USA TODAY Sports Game 4 in Indianapolis: Fever 75, Lynx 69 — Minnesota guard Maya Moore (23) looks to pass against Indiana defender Tamika Catchings (24) during the second half. Brian Spurlock, USA TODAY Sports Game 4 in Indianapolis: Fever 75, Lynx 69 — Indiana forward Tamika Catchings (24) tumbles to the floor after drawing a foul on Minnesota defender Sylvia Fowles (34) during the first half. Brian Spurlock, USA TODAY Sports Game 4 in Indianapolis: Fever 75, Lynx 69 — Indiana forward Marissa Coleman (25) looks for a passing lane around Minnesota defender Maya Moore (23) during the first half. Brian Spurlock, USA TODAY Sports Game 4 in Indianapolis: Fever 75, Lynx 69 — Minnesota forward Maya Moore (23) drives to the bucket past Indiana defender Marissa Coleman (25) during the first half. Brian Spurlock, USA TODAY Sports Game 4 in Indianapolis: Fever 75, Lynx 69 — Minnesota guard Anna Cruz (51) drives to the bucket against Indiana defender Tamika Catchings (24) during the first half. Brian Spurlock, USA TODAY Sports Game 3 in Indianapolis: Lynx 80, Fever 77 — Maya Moore (23) celebrates with Rebekkah Brunson (32) after hitting the game-winning shot. Brian Spurlock, USA TODAY Sports Game 3 in Indianapolis: Lynx 80, Fever 77 — Maya Moore (23) sinks a game-winning 3-pointer at the buzzer to give Minnesota the victory. Brian Spurlock, USA TODAY Sports Game 3 in Indianapolis: Lynx 80, Fever 77 — Maya Moore (23) and Renee Montgomery (21) celebrate Minnesota's win. Brian Spurlock, USA TODAY Sports Game 3 in Indianapolis: Lynx 80, Fever 77 — Maya Moore is all smiles after putting Minnesota within one win of the WNBA title. Brian Spurlock, USA TODAY Sports Game 3 in Indianapolis: Lynx 80, Fever 77 — Indiana forward Tamika Catchings (24) tries to shoot over Minnesota defender Sylvia Fowles (34) during the second half. Brian Spurlock, USA TODAY Sports Game 3 in Indianapolis: Lynx 80, Fever 77 — A scramble ensues for a second-half loose ball. Brian Spurlock, USA TODAY Sports Game 3 in Indianapolis: Lynx 80, Fever 77 — Indiana forward Erlana Larkins, center, drives to the bucket between a pair of Minnesota defenders during the second half. Brian Spurlock, USA TODAY Sports Game 3 in Indianapolis: Lynx 80, Fever 77 — Indiana guard Briann January (20) vies for a rebound against Minnesota guard Lindsay Whalen (13) during the first half. Brian Spurlock, USA TODAY Sports Game 3 in Indianapolis: Lynx 80, Fever 77 — Minnesota forward Rebekkah Brunson (32) gets tangled up with Indiana defender Tamika Catchings (24) after a first-half rebound. Brian Spurlock, USA TODAY Sports Game 3 in Indianapolis: Lynx 80, Fever 77 — Minnesota forward Maya Moore (23) shoots over Indiana defender Shenise Johnson (42) during the first half. Brian Spurlock, USA TODAY Sports Game 2 in Minneapolis: Lynx 77, Fever 71 — Indiana guard Shavonte Zellous (1) looks to drive against Minnesota defender Sylvia Fowles (34) during the first half. Brad Rempel, USA TODAY Sports Game 2 in Minneapolis: Lynx 77, Fever 71 — Indiana forward Erlana Larkins (2) vies for a first-half rebound against Minnesota forward Maya Moore. Brad Rempel, USA TODAY Sports Game 2 in Minneapolis: Lynx 77, Fever 71 — Minnesota forward Rebekkah Brunson (32) looks to drive against Indiana defender Marissa Coleman (25) during the first half. Jim Mone, AP Game 2 in Minneapolis: Lynx 77, Fever 71 — Indiana guard Briann January (20) passes around Minnesota defender Sylvia Fowles (34) during the first half. Jim Mone, AP Game 1 in Minneapolis: Fever 75, Lynx 69 — Indiana guard Briann January (20) celebrates a big fourth-quarter bucket. Brad Rempel, USA TODAY Sports Game 1 in Minneapolis: Fever 75, Lynx 69 — Indiana guard Briann January (20) drives to the bucket past Minnesota defender Anna Cruz (51) during the third quarter. Brad Rempel, USA TODAY Sports Game 1 in Minneapolis: Fever 75, Lynx 69 — Indiana guard Shavonte Zellous (1) makes a pass while falling to the court during the third quarter. Brad Rempel, USA TODAY Sports Game 1 in Minneapolis: Fever 75, Lynx 69 — Minnesota center Sylvia Fowles (34) scrambles for a loose ball against Indiana forward Erlana Larkins (2) during the fourth quarter. Brad Rempel, USA TODAY Sports Game 1 in Minneapolis: Fever 75, Lynx 69 — Indiana guard Marissa Coleman (25) jockeys for rebounding position against Minnesota forward Maya Moore (23) during the third quarter. Brad Rempel, USA TODAY Sports Game 1 in Minneapolis: Fever 75, Lynx 69 — Minnesota defender Sylvia Fowles (34) blocks a shot attempt by Indiana forward Tamika Catchings (24) during the fourth quarter. Brad Rempel, USA TODAY Sports Game 1 in Minneapolis: Fever 75, Lynx 69 — Minnesota center Sylvia Fowles (34) scrambles for a loose ball against Indiana Fever Erlana Larkins (2) during the third quarter. Brad Rempel, USA TODAY Sports Game 1 in Minneapolis: Fever 75, Lynx 69 — Indiana guard Briann January (20) drives to the bucket against Lynx defender Lindsay Whalen (13) during the first quarter. Brad Rempel, USA TODAY Sports Game 1 in Minneapolis: Fever 75, Lynx 69 — Indiana guard Shavonte Zellous (1) tries to drive between Minnesota defenders Maya Moore (23) and Rebekkah Brunson (32) during the second quarter. Brad Rempel, USA TODAY Sports Game 1 in Minneapolis: Fever 75, Lynx 69 — Minnesota forward Maya Moore (23) looks to room to work on the perimeter against Indiana defender Marissa Coleman (25) during the first quarter. Brad Rempel, USA TODAY Sports Game 1 in Minneapolis: Fever 75, Lynx 69 — Minnesota center Sylvia Fowles (34) tries to back down Indiana defender Erlana Larkins (2) in the post during the first quarter. Brad Rempel, USA TODAY Sports Game 1 in Minneapolis: Fever 75, Lynx 69 — Indiana defender Tamika Catchings (24) blocks a shot attempt by Minnesota forward Maya Moore (23) during the second quarter. Brad Rempel, USA TODAY Sports Like this topic? You may also like these photo galleries: Replay", "external_links": [], "published": "2015-10-15T06:57:00.000+03:00", "crawled": "2015-10-16T01:45:33.136+03:00", "highlightTitle": ""}