{"organizations": [], "uuid": "c5891347c3f2f1aca11be4bc986b97aa85aad85c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "savannahnow.com", "main_image": "http://savannahnow.com/sites/default/files/14826926.jpg", "site_section": "http://savannahnow.com/", "section_title": "savannahnow.com | Savannah Georgia's source for News, Entertainment, Sports, Weather, Classifieds, Jobs, Autos, Real Estate and St. Patricks Day", "url": "http://savannahnow.com/accent/2015-10-24/celebrity-chef-tour-returns-savannah-food-and-wine-festival-major-celebrities", "country": "US", "title": "Celebrity Chef Tour returns to Savannah Food and Wine Festival with major celebrities, local talent", "performance_score": 0, "site": "savannahnow.com", "participants_count": 1, "title_full": "Celebrity Chef Tour returns to Savannah Food and Wine Festival with major celebrities, local talent | savannahnow.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T18:00:00.000+03:00", "replies_count": 0, "uuid": "c5891347c3f2f1aca11be4bc986b97aa85aad85c"}, "author": "Kim Wade", "url": "http://savannahnow.com/accent/2015-10-24/celebrity-chef-tour-returns-savannah-food-and-wine-festival-major-celebrities", "ord_in_thread": 0, "title": "Celebrity Chef Tour returns to Savannah Food and Wine Festival with major celebrities, local talent", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photos Anthony Lamas By Kim Wade One of the highlights of the Savannah Food and Wine Festival is the James Beard Foundation Celebrity Chef Tour dinner. The event features James Beard award-winning and nominated chefs creating culinary delights paired with world class wines. The event also gives local chefs and culinary students a chance to work side by side with these chef superstars as well as a chance for Savannah to spotlight its unique local cuisine and products.\nThis year’s Celebrity Chef Tour dinner will take place on Nov. 11 at The Mansion on Forsyth Park and will feature four James Beard Foundation nominated and award-winning chefs: Scott Crawford, Jonathan Waxman, Tory McPhail and Anthony Lamas. The dinner will also feature local chefs Roberto Leoci, Patrick McNamara and Jean Vendeville. Host Chef for the evening is Jeff Williams.\nThe dinner begins with the Nicolas Feuillatte Champagne and Stella Artois reception with passed hors d’oeuvres from local chefs at 6 p.m. and the five-course dinner and dessert portion begins at 7 p.m. Tickets are $200 person and $375 for couple. Combo packages are also available. For more information, go to savannahfoodandwinefest.com\nCelebrity chef Anthony Lamas, owner of the Latin-inspired Seviche in Louisville, Ky., said he is excited to return to Savannah for the festival. Lamas gained national attention for Seviche and has cooked at the James Beard House in New York five times and was honored as a semifinalist for the James Beard Foundation’s “Best Chef: Southeast” award three times.\nLamas said his first trip to Savannah took place when he attended the inaugural Savannah Food and Wine Fest and he has returned to Savannah several times since.\n“I fell in love with the city,” he added. “I’m bringing my wife back with me this time so she can enjoy it, too.”\nLamas added that the Savannah food scene reminds him of Louisville’s scene about seven years ago.\n“I can tell people really love food and are excited about their restaurants. Savannah drew large crowds for their first food and wine festival which is impressive. In fact, I’ve had people in my restaurant in Louisville who said they first met me in Savannah.”\nFor the dinner, Lamas will prepare the second course with Open Blue Cobia Tiradito with Bluegrass soy, green apple, crispy quinoa and coriander. He said the cobia fish reminds him a yellowtail.\n“It’s a firmer fish and I will prepare it in kind of the style of ceviche. Tiradito is kind of like what crudo (raw fish) is in Italian cooking.”\nHe says the Bluegrass soy sauce is a favorite of his because it is made in bourbon barrels.\nLamas said he is excited to get in the kitchen with friends and fellow “celebrity chefs” McPhail and Crawford and he’s glad to finally meet Waxman.\nLamas said Waxman recommended him to appear on the debut episode of the Food Network series “Beat Bobby Flay.”\n“I’m always impressed with the crowds that come out for these Savannah events. (Savannah) is definitely a food city.\n“I love it and I’m planning to stay a few extra days to enjoy all the city has to offer.”\nWhile he’s in town, Lamas will also have a book signing for his first book “Southern Heat: New Southern Cooking Latin Style,” which is released on Nov. 3. Aside from a private signing at his restaurant, the Savannah signing will be his very first time to sign books. Lamas will sign books at the Celebrity Chef Tour Dinner, the Artisanal Supper at The Landings on Nov. 13 and at the Taste of Savannah on Nov. 14.\nHe said the book illustrates his journey from growing up in California to moving to Kentucky where he met his wife and up to present day influences.\n“In California, I grew up in the largest agricultural area of the world,” he explained. “I was in FFA (Future Farmers of America) and raised lambs and steers and showed them at fairs. Driving around as a kid, I saw a lot of migrant workers picking fruits and vegetables and I saw kids my age also working in the field. Those experiences made me appreciate ingredients and the work that goes into bringing those ingredients to consumers. People don’t realize how much work goes into putting food on the table.”\nHe said his move to Kentucky opened his eyes to Southern cuisine and he began to incorporate those Southern ingredients, like grits and sorghum, into his Latin-based recipes.\n“This book reflects how you think of true American cuisine. When you think of true American cuisine, it is really the American South.\n“It’s so natural and simple to add my flavors to Southern cuisine — it’s a natural marriage. Southern hospitality is like ‘mi casa es su casa,’ right? It’s the same kind of spirit.\n“… I don’t consider myself a Southern chef, but I cook with those ingredients and make Latin inspired food with what Southern farmers are bringing me.”\nAside from the outside celebrities, the event will also feature three local “celebrity” chefs: Vendeville, department head of the Culinary Institute at Savannah Technical College; Leoci of his own Leoci’s Trattoria; and McNamara, owner and executive chef of Noble Fare.\nMcNamara says he’s planning to prepare ahi tuna snow cones. He said he wanted to make something that would bring a smile to everyone’s face.\n“I wanted to do something fun instead of being so serious about food.”\nHe said he enjoys having fun making his creations and he always has fun in the kitchen with Leoci and Vendeville.\nMcNamara is also excited to represent Savannah at such a high profile dinner and said Savannah has a lot to offer.\n“It keeps getting better with food here and we have so many new restaurants on every socioeconomic scale from fine dining to casual.\n“It’s only going to be better and Charleston is not going to be it.”\nWhile he laughed on the last statement, he was serious about Savannah’s growing food scene.\n“I love this town. I want to raise my children here. I want to retire here…\n“I want to be a part of the next booming food town and I think this is it; we just need more chefs to open restaurants here and get everyone on the same page of taking care of the most important person who is the diner.”\nWhile McNamara and the other chefs will be more than serious about taking care of the diners at the event, he said it’s important for diners to take their time to relax and really enjoy the experience.\n“My advice is to sit down, relax, ask as many questions as you care to and enjoy yourself. These Celebrity Chef Tours are one of the best experiences you will ever have. It’s not pretentious — it’s just people who love food and wine.”\nThe Savannah Food & Wine Festival takes place Nov. 9-15 and includes local and celebrity chefs, winemakers, wine dinners and learning experiences. For more information and tickets go to savannahfoodandwinefest.com.\nIF YOU GO\nWhat: The James Beard Foundation Celebrity Chef Tour Dinner\nWhen: Nov. 11; reception at 6 p.m., dinner at 7 p.m.\nWhere: The Mansion on Forsyth Park\nCost: $200/person; $375/couple\nInfo: savannahfoodandwinefest.com\nMENU\nReception: 6–7 p.m.\nNicolas Feuillatte Champagne and Stella Artois Reception with passed hors d’oeuvres from local chefs Patrick McNamara and Roberto Leoci.\nFIRST COURSE\nSunchoke Salad, Pear, Hazelnuts, Hickory, Spicebush Vinaigrette by Chef Scott Crawford paired with 2013 Phifer Pavitt “Date Night” Sauvignon Blanc - Napa Valley, Calif.\nSECOND COURSE\nOpen Blue Cobia Tiradito with bluegrass soy, green apple, crispy quinoa and coriander by Chef Anthony Lamas paired with 2013 Babylonstoren Chardonnay - Simonsberg Mountains, South Africa\nTHIRD COURSE\nGnocchi with black truffles & Swiss Chard by Jonathan Waxman paired with 2008 Piccini Brunello Di Montalcino “Riserva” - Tuscany, Italy\nFOURTH COURSE\nPan-Roasted Cobia with Haricot Vert, Maple Vinaigrette, and Balsamic Glaze by Host Chef, Jeff Williams paired with 2012 La Crema Pinot Noir - Willamette, Ore.\nFIFTH COURSE\nAssiette of Creekstone Farms Black Angus Beef with barbecued beef bacon, grilled spinalis, fire roasted marrow bone, marrow fat and cow cracklins’, Autumn squash, enoki mushrooms and a sauce made from the smoke house jus by Tory McPhail paired with 2012 Chateau St. Jean, Cinq Cepages, Sonoma County, Calif. and 2012 Jackson Estate “Hawkeye Mountain” Cabernet Sauvignon- Alexander Valley, Calif.\nDESSERT\nChocolate Financier with Mandarine Parfait and Caramel sauce by Chef Jean Vendeville paired with Heitz “Ink Grade” Port- Napa Valley, Calif.", "external_links": ["http://sav-cdn.com/sites/default/files/imagecache/superphoto/14826926.jpg", "http://sav-cdn.com/sites/default/files/imagecache/story_slideshow_thumb/14826926.jpg", "http://sav-cdn.com/sites/all/themes/savannahnow/images/blank.gif"], "published": "2015-10-24T18:00:00.000+03:00", "crawled": "2015-10-25T12:15:38.501+02:00", "highlightTitle": ""}