{"organizations": [], "uuid": "8b64281d9679525c18919c57eb8fa70b39c46ba7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/", "section_title": "Ahram Online - News, Business, Culture, Sports &amp; Multimedia from Egypt ", "url": "http://english.ahram.org.eg/NewsContent/2/8/161072/World/Region/Ankara-bombing-attacks-trail-leads-to-homegrown-ji.aspx", "country": "EG", "title": "Ankara bombing attacks trail leads to homegrown jihadists - Region - World", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "Ankara bombing attacks trail leads to homegrown jihadists - Region - World - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "8b64281d9679525c18919c57eb8fa70b39c46ba7"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/2/8/161072/World/Region/Ankara-bombing-attacks-trail-leads-to-homegrown-ji.aspx", "ord_in_thread": 0, "title": "Ankara bombing attacks trail leads to homegrown jihadists - Region - World", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related ISIS prime suspect in Ankara bombing: Turkey PM Turkey says death toll in Ankara bomb attacks rises to 95 At least 86 dead, 186 injured in Ankara blasts: Turkish minister Turkish police fire in air to disperse protesters from Ankara blast scene Turkey is confronting the uncomfortable prospect the suicide bombers behind the Ankara attack were homegrown jihadists who were radicalised at home and already known to the authorities as a potential menace to society.\nNinety-nine people were killed on October 10 when two suicide bombers detonated their charges in a gathering of union, leftist and Kurdish activists in the heart of the Turkish capital.\nThe government has said ISIS group, which has captured swathes of neighbouring Syria up to the Turkish border, is the prime suspect over the bombing.\nOfficials have also noted similarities between the Ankara attack and the suicide bombing on July 20 in Suruc on the Syrian border that killed 34 and was blamed on ISIS and also targeted peace activists.\nTurkish media have widely named one of the suspected bombers as Yunus Emre Alagoz -- the missing brother of the Suruc bomber Abdurrahman Alagoz.\nThe other is believed to be Omer Deniz Dundar, who had twice been to Syria since 2013.\nThe Ankara bombing was the third targeting Kurdish activists after Suruc and the June 5 attack in Diyarbakir on a rally of the pro-Kurdish Peoples' Democratic Party (HDP) that killed four.\nThe man suspected of carrying out the Diyarbakir attack, in that case not a suicide bombing, named as Orhan Gonder, was later arrested.\nAstonishingly, the main suspects of all three attacks are all natives of the same Turkish city -- Adiyaman a city of over 200,000 in southeast Turkey.\n\"What we are talking about is a Turco-jihadist movement,\" said a western diplomatic source, who asked not to be named.\n\"A small group of Turks who have been radicalised and were with ISIS in Syria and are now staging operations on their own initiative.\"\nSo far no group has claimed any of the three attacks that have rocked Turkey.\nAFP contacted by telephone acquaintances of the family in Adiyaman who revealed that the authorities have already been informed of the suspect tendencies of the two Dundar brothers.\nThe second brother -- named as Mahmut Gazi Dundar -- is still at large and may be in Syria, Turkish press reports have said.\n\"The first complaints from the Dundar family date back to September 2013,\" said Osman Suzen, a lawyer representing the parents. \"Signals sent by the father to the authorities did not count for anything.\"\nHe said the father had even brought the two back after they went to Syria.\n\"They were then living in the family house for many months but no-one deemed it appropriate to come and interrogate them.\"\nSuzen said that the case of the Dundar brothers was far from being isolated with 18 complaints being submitted by families to police fearing their relatives had joined IS.\nTurkish press reports have focused on Adiyaman as a hub for jihadists in the country and in particular a now closed tea house where the Alagoz brothers used to meet.\n\"Adiyaman has not become the capital in Turkey of IS. People here have the same degree of sympathy as elsewhere,\" said Ali Ekin, 46, who knows the Dundar family.\nA security source with knowledge of the issue told AFP that IS was known to have cells in several Turkish cities including Bingol, Konya, Sakarya, Osmaniye as well as Istanbul and Ankara.\nRecruiters find their targets in popular areas where families or religion is hardly present or even absent, the source said.\nEmphasising the complex web of allegiances, Ekin said that the Suruc and Ankara bombers were themselves Kurds even though they had bombed Kurdish targets.\n\"The most difficult thing for these parents whose children blow themselves up is that it is Kurds who have been killing Kurds,\" he added.\nCritics of the government have long accused Ankara of not doing enough to stop the to-and-fro of jihadists across its borders and even outright complicity with ISIS. The authorities deny the claims.\n\"The enemy of my enemies is my friend. ISIS, because it's the enemy of the Kurds in Syria and Iraq, becomes the ally of Turkey,\" said HDP MP for Adiyaman Behcet Yildirm.\n\"Ankara has helped ISIS not because it likes jihadists but simply to work against the Kurds.\"\nAccording to press reports, the Ankara suicide bombers were on a list of 20 people judged particularly dangerous by the police. Turks now fear where the next strike may come from.", "external_links": [], "published": "2015-10-16T03:00:00.000+03:00", "crawled": "2015-10-16T21:02:51.789+03:00", "highlightTitle": ""}