{"organizations": [], "uuid": "1e2531de24addfd185d7212a64539069f776b1b7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/47529300.cms", "site_section": "http://timesofindia.indiatimes.com/sports/racing/top-stories/articlelist/10514745.cms", "section_title": "Top Stories - Racing - Sports - The Times of India", "url": "http://timesofindia.indiatimes.com/sports/racing/top-stories/Formula-One-Sainz-out-of-hospital-determined-to-race/articleshow/49308495.cms", "country": "IL", "title": "Formula One: Sainz out of hospital, determined to race", "performance_score": 0, "site": "indiatimes.com", "participants_count": 1, "title_full": "Formula One: Sainz out of hospital, determined to race - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T03:00:00.000+03:00", "replies_count": 0, "uuid": "1e2531de24addfd185d7212a64539069f776b1b7"}, "author": "timesofindia.indiatimes.com", "url": "http://timesofindia.indiatimes.com/sports/racing/top-stories/Formula-One-Sainz-out-of-hospital-determined-to-race/articleshow/49308495.cms", "ord_in_thread": 0, "title": "Formula One: Sainz out of hospital, determined to race", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SOCHI: Carlos Sainz says he feels sore but still wants to take part in the Russian Grand Prix after he was discharged from hospital following a massive high-speed crash during Saturday's final practice.\nThe 21-year-old, who lost control of his Toro Rosso car braking at more than 300kph and then skewed into the wall at Turn 13, told Spanish TV in a video message that he felt fine and wanted to race.\nThe Spaniard left hospital on Saturday night, a team spokesman confirmed to AFP.\nThe son of former double world rally champion Carlos Sainz Snr will stay in his hotel overnight and is expected to be given the green light by doctors to race on Sunday.\n\"As you can see I'm fine,\" Sainz had said hours earlier from his hospital bed.\n\"It was nothing in the end... It was just a scare. A big scare, but just a scare...\n\"I want you to know I was conscious all the time. I was trying to talk to the team on the radio from underneath the barriers, but they couldn't hear me so I started to worry because I knew people would start thinking it was something more serious than it actually was.\n\"They've done all sorts of tests and I have nothing. A bit of a sore neck and back, but with a bit of rest I'm going to try to race.\n\"I can't give you any guarantees, but I'm going to do all I can to race and if I can't then I'll just rest and think about the next one.\n\"Thanks to everybody for their support and messages, which help a lot in moments like this.\"\nFerrari's Sebastian Vettel led calls for an explanation of the accident and the barriers' failure to prevent Sainz ramming his car beneath them in the collision.\nThe former multiple world champion, who took fourth on the grid behind Mercedes duo Nico Rosberg and Lewis Hamilton said the barriers had failed.\n\"It's great that he's fine,\" said Vettel.\n\"It would be great to have him with us tomorrow It was shocking to see he was so deep in the barriers -- and that he was covered by them.\"\nSainz's team-mate, Dutch teenager Max Verstappen, suffered a similar accident at the Monaco Grand Prix, but climbed from his car unaided.\n\"After Max's accident in Monaco, compared to Carlos's accident today, it's very different the way the barriers work and that's something we need to understand.\n\"The idea is for the barriers not to come on top of you or the car to be going under the barriers. It's something we need to understand.\"\nVerstappen, 18, said: \"It was not ideal. They need to find a solution for that.\"", "external_links": [], "published": "2015-10-11T03:00:00.000+03:00", "crawled": "2015-10-19T23:36:50.608+03:00", "highlightTitle": ""}