{"organizations": [], "uuid": "e2b6f7d578bdad8b3add7aa435215be834568fed", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reporterherald.com", "main_image": "http://extras.mnginteractive.com/live/media/site36/2015/1023/20151023__3f3c72417a67832f850f6a706700ef0c~p1.jpg", "site_section": "http://feeds.reporterherald.com/mngi/rss/CustomRssServlet/47/244125.xml", "section_title": "Pro Sports", "url": "http://www.reporterherald.com/sports/ci_29017647/avalanche-shot-blockers-have-added-protection-less-fear?source=rss", "country": "IL", "title": "Avalanche shot blockers have added protection, less fear with skate fenders", "performance_score": 0, "site": "reporterherald.com", "participants_count": 1, "title_full": "Avalanche shot blockers have added protection, less fear with skate fenders", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T09:03:00.000+03:00", "replies_count": 0, "uuid": "e2b6f7d578bdad8b3add7aa435215be834568fed"}, "author": "Mike Chambers \nThe Denver Post", "url": "http://www.reporterherald.com/sports/ci_29017647/avalanche-shot-blockers-have-added-protection-less-fear?source=rss", "ord_in_thread": 0, "title": "Avalanche shot blockers have added protection, less fear with skate fenders", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Avalanche shot blockers have added protection, less fear with skate fenders Colorado leads the NHL with 141 blocked shots, averaging 23.5 a game The Denver Post Posted: 10/23/2015 11:49:22 PM MDT Colorado Avalanche defenseman Nikita Zadorov, left, of Russia, vies for control of the puck with Carolina Hurricanes center Victor Rask, of Sweden, during the second period of an NHL hockey game, Oct. 21, 2015, in Denver. ( David Zalubowski, Associated Press File ) \nAvalanche defenseman Nikita Zadorov says he feels like Arnold Schwarzenegger in \"The Terminator\" when he stands in front of an opponent's shot these days. Zadorov, a Russian, sounds like the Austrian-born actor too. \n\"I have no fear,\" Zadorov says about blocking shots. \nThe Avs are blocking a record amount of shots this season, and undoubtedly, it stems from the team's decision to make skate fenders mandatory for the first time in club history. \nAll players must place the high-strength plastic moldings over their skate boots for practices and games. Get sports news and updates right in your inbox \nSign up to receive news alerts and a daily roundup of all things Colorado sports delivered to your inbox. \nColorado leads the NHL with 141 blocked shots, averaging 23.5 a game, and individually, Avs defenseman Francois Beauchemin has a league-high 23. Nathan MacKinnon, who broke his foot from a shot in January, leads all Avs forwards with 12. \n\"If you know you have extra protection on your skates and it's not as likely that you're going to break the inside of your foot or the outside of your foot— or your ankle — from blocking shots, it does make you more confident,\" Avs forward John Mitchell said Thursday. \"It's a smart move for anybody, whether it's mandatory or not. It's like a visor. You don't have one and then put one on and the first couple times you don't like it. But then you get used to it.\" Advertisement \nLast season, defenseman Nate Guenin was one of the few Avs players to wear them. \n\"I never wore them until I missed games from a blocked shot,\" Guenin said. \"What's nice to watch as a defenseman is our forwards willing to get in front of shots. MacKinnon has done a great job of getting in lanes. And even if they don't block a shot, it forces the guy to shoot it wide.\" \nSkate fenders reduce excuses. Without them, coaches and teammates understand when a player of MacKinnon's caliber doesn't put himself in harm's way. Now, coaches expect the sacrifice to be made. \n\"The staff is putting a bigger emphasis on it,\" Guenin said, talking specifically about coach Patrick Roy. \"If guys don't block shots, he's letting them know.\" \nThe Avalanche practiced Friday and host 0-8 Columbus on Saturday night at the Pepsi Center. \nMany predicted the Blue Jackets would make the playoffs this season. \n\"They still could be really good,\" MacKinnon said. \"They are a good team. I don't think it really makes sense how they're 0-8. I don't know what's going on, but we're not going to take them lightly.\" \nRELATED: Avalanche sends rookie Mikko Rantanen to minors, recall Dennis Everberg \nColumbus lost 3-2 on Thursday at Minnesota in coach John Tortorella's debut with the Jackets. Tortorella — the winningest American-born NHL coach — replaced Todd Richards, who was fired Wednesday, a day after Columbus lost 4-0 at home against the New York Islanders. \n\"I don't think anyone around the league expected them to start like that,\" Avs defenseman Erik Johnson said. \"Everyone thought they were going to be an up-and-coming team, and they play hard. They're obviously going to be hungry for their first win, so we expect to get their best game. \n\"Torts is a fiery guy, so I'm sure he'll try and figure out what's ailing them right now.\" \nMike Chambers: mchambers@denverpost.com or @mikechambers Columbus at Colorado \nTV/Radio: ALT; 950 AM Spotlight on Brandon Saad: \nThe two-time Stanley Cup winner with the Chicago Blackhawks was the key player in a June 30 trade with the Blue Jackets. Saad, 22, seemed to be a big part of the Blackhawks' future but his pending restricted free-agent status and Chicago's salary cap-related concerns led to his trade. He signed a six-year, $36 million extension with Columbus and is the team's top-paid forward or defenseman. Saad, a Pennsylvania native who was born of Syrian descent, is pointless in his last three games. NOTEBOOK Blue Jackets: \nThey have been outscored 37-15, and they are 0-4 at home and 0-4 on the road. They lost 3-2 at Minnesota on Thursday, scoring both goals in the first period. Young star forward Ryan Johansen was benched late in the game. He leads the Blue Jackets with six points (one goal). Center Brandon Dubinsky, who leads Columbus forwards averaging 21:22 of ice time, was centering Brandon Saad and Nick Foligno at the end of the game. \nGoalie Curtis McElhinney might get the start in net. The former Colorado College standout has better numbers than Sergei Bobrovsky, although McElhinney's save percentage is under .900. Columbus has won two of its last three games in Denver and is 4-2-1 in its last seven at the Pepsi Center. Avalanche: \nRight wing Dennis Everberg practiced Friday after being called up from San Antonio of the American Hockey League. He is replacing rookie Mikko Rantanen, who was sent down to the minors, and will play on the Carl Soderberg-centered line with left wing John Mitchell. Everberg had five points (three goals) in three games for San Antonio. \nGoalie Semyon Varlamov will make his second consecutive start, and the Avs will use the same six defensemen from Wednesday's 1-0 overtime loss to Carolina. Defenseman Tyson Barrie will conclude his three-game suspension Saturday and defenseman Brad Stuart, who did not practice Friday, will be scratched for the fifth time in seven games. Stuart has a back injury and is day to day. \nMike Chambers, The Denver Post", "external_links": [], "published": "2015-10-24T09:03:00.000+03:00", "crawled": "2015-10-24T09:36:41.810+03:00", "highlightTitle": ""}