{"organizations": [], "uuid": "5a4ffc95b972fdf855c1a9e068808674fea1e306", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news.com.au", "main_image": "http://cdn.newsapi.com.au/image/v1/660dd6a47be5472f3d2474c84721861c", "site_section": "http://www.news.com.au/sport/more-sports", "section_title": "More Sports | More Sports | Sports News and Results | News.com.au", "url": "http://www.news.com.au/sport/more-sports/widow-of-boxer-daevy-browne-still-searching-for-answers/story-fndukor0-1227572792167", "country": "AU", "title": "Davey’s loved ones still fighting", "performance_score": 0, "site": "news.com.au", "participants_count": 1, "title_full": "Davey’s loved ones still fighting", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T02:54:00.000+03:00", "replies_count": 0, "uuid": "5a4ffc95b972fdf855c1a9e068808674fea1e306"}, "author": "JAMES HOOPER", "url": "http://www.news.com.au/sport/more-sports/widow-of-boxer-daevy-browne-still-searching-for-answers/story-fndukor0-1227572792167", "ord_in_thread": 0, "title": "Davey’s loved ones still fighting", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Video Image Paul Upham: 'Golovkin an is unbelievable rising star' 3:00 Boxing: Paul Upham discusses Gennady Golovkin's upcoming bout with David Lemieux, which will take place at a sold out Madison Square Garden. Upham says that Golovkin is an unbelievable rising star.\nOctober 17th 2015 4 days ago /video/video.news.com.au/Sport/More Sports/ Amy Browne, wife of boxer Davey Browne who died after he was knocked out during a fight.\nJAMES HOOPER The Sunday Telegraph ONE month on from the death of boxer Davey Browne at Ingleburn RSL and his widow, Amy, is still searching for answers.\nInside the family’s Bradbury home in western Sydney photographs adorn the walls, children’s toys are scattered across the floor and a mother and two sons are putting up the bravest of fights.\nA picture on the dining room table proudly shows Browne, 28, and son Rocklyn grinning, the four-year-old holding his father’s championship belt above his head.\n“That’s the last photograph we have of David. It was taken the night of the fight just before we left home,” Mrs Browne said.\nOn the night of September 12, Browne was ahead on all three judges’ scorecards leading into the last round against Filipino Carlo Magali.\nThe Australian boxer, never previously knocked out in his 25-fight professional career, told referee Charlie Lucas he was OK to continue before becoming the first death inside a NSW boxing ring in 30 years.\nThe Brownes had planned to celebrate Rocklyn’s birthday the day after the fight with a monster truck cake and a visit from Batman.\nSince the night her husband was rushed to Liverpool hospital, there’s been no phone call from the NSW Combat Sports Authority.\nBut others in the boxing community have arranged for some of Australia’s highest- profiled athletes to feature in a charity boxing exhibition with all money raised to be donated to the family.\nAmy Browne with sons Flynn and Rocklyn. Source: News Limited\nGrange Old School Boxing will bring together arch rivals Daniel Geale and Anthony Mundine for a series of exhibition fights in Campbelltown on December 6.\n“I find it hard to accept all these donations and events that are being put on, but at the same time people have said it’s a testament to how much respect Dave had and how many people knew what a good guy he was,” Mrs Browne said.\n“There’s people I don’t even know personally and they’re ringing me and telling me they want to do this for me and the boys.\n“It’s hard to describe how appreciative we are of that. I’m still grieving and I’m still trying to work and then there’s all these people I don’t know trying to help.\n“It’s really is hard to explain all the emotions. I’ve got to worry about our future. I can’t afford to just quit and be financially left in trouble.”\nTriple world champion Geale trained in the same gym as Browne for years and had no hesitation about the prospect of an exhibition bout against his arch rival Mundine. Mundine has also agreed to feature, with the ex-NRL player turned boxer still to decide whether he will enter the ring against Geale or feature in a separate exhibition.\nFriends and family lay Davey Browne to rest. Source: News Corp Australia\nGrange Old School Boxing are aiming to raise $100,000 for Mrs Browne and her two boys, with the gloves of all fighters to be auctioned on the day.\n“Like everybody, I was in shock and disbelief when I heard,” Geale said.\n“Your heart absolutely goes out to his family and as a boxer it definitely makes you take some time to reflect. Hopefully the community will really jump behind this upcoming event, I’m sure they will.\n“Davey left behind two young kids and a wife with a mortgage to pay so if we can offer a little bit of help in a small way then that’s something positive for them.”\nIt’s still a daily battle for Mrs Browne to accept the reasoning why her husband is no longer around. A couple for five years since meeting in St Kilda in Melbourne, they had been married two and a half years.\n“It really is a rollercoaster. Sometimes I’m quite positive and I try to block out all the bad stuff from that night watching the fight,” Mrs Browne said.\n“Then other days you can’t help but think of all the bad stuff. What if this, what if that, he should be here.\n“I am OK and having the boys gives you that extra motivation to be OK. I need to have my cries but I don’t need someone there cuddling me, I just need to let it out.”\n Davey’s loved ones still fighting", "external_links": ["http://cdn.newsapi.com.au/image/v1/external?url=http%3A%2F%2Fcontent4.video.news.com.au%2Ffoxsports%2Fprod%2Farchive%2F2015%2F10%2F17%2FFSD_171015_PAUL_UPHAM_DESK.jpg&width=650&api_key=kq7wnrk4eun47vz9c5xuj3mc", "http://www.sundaytelegraph.com.au/", "http://cdn.newsapi.com.au/image/v1/origin:fatwire.", "http://cdn.newsapi.com.au/image/v1/d9cb75b0c4ed5c7af5b8266da29faff5", "http://cdn.newsapi.com.au/image/v1/660dd6a47be5472f3d2474c84721861c", "http://cdn.newsapi.com.au/image/v1/ea7340019082c2c33730c50067451008", "http://www.dailytelegraph.com.au/sport/more-sports/widow-of-boxer-daevy-browne-still-searching-for-answers/story-fni2frsp-1227572792167", "http://widgets.outbrain.com/outbrain.js"], "published": "2015-10-18T02:54:00.000+03:00", "crawled": "2015-10-20T18:28:19.540+03:00", "highlightTitle": ""}