{"organizations": [], "uuid": "39e838e3ab214fb93a32263ae4d5d3ead04e5528", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tucsonnewsnow.com", "main_image": "http://kold.images.worldnow.com/images/9078150_G.jpg", "site_section": "http://www.tucsonnewsnow.com/Global/category.asp?C=242964&clienttype=rss", "section_title": "Tucson News Now - UA Sports", "url": "http://www.TucsonNewsNow.com/story/30330529/gimino-arizonas-new-sackmaster-offers-banda-aid", "country": "US", "title": "Gimino: Arizona's new 'Sackmaster' offers Banda-Aid", "performance_score": 0, "site": "tucsonnewsnow.com", "participants_count": 1, "title_full": "Gimino: Arizona's new 'Sackmaster' offers Banda-Aid", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T02:25:00.000+03:00", "replies_count": 0, "uuid": "39e838e3ab214fb93a32263ae4d5d3ead04e5528"}, "author": "Anthony Gimino", "url": "http://www.TucsonNewsNow.com/story/30330529/gimino-arizonas-new-sackmaster-offers-banda-aid", "ord_in_thread": 0, "title": "Gimino: Arizona's new 'Sackmaster' offers Banda-Aid", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Gimino: Arizona's new 'Sackmaster' offers Banda-Aid - Tucson News Now Member Center: Gimino: Arizona's new 'Sackmaster' offers Banda-Aid Posted: Jack Banda spent a lot of time around the quarterback in the fourth quarter at Colorado. (Photo by Stan Liu/Arizona Athletics) Jack Banda TUCSON, AZ (Tucson News Now) - \nDefensive lineman Jack Banda was so far removed from Arizona's plans this summer that he wasn't on the 105-man roster entering fall camp. \nFunny how things work out. \nThe Wildcats' hopes of getting immediate impact from a pair of junior college defensive lineman have gone horribly awry, so they really had no choice last week but to turn to Banda, a lightly recruited, sparingly used redshirt sophomore from Georgia who only got noticed by Arizona out of high school because he peppered dozens and dozens of colleges with a self-made highlight video. \nLast week, there was Banda, anonymous in Tucson for two-and-a-half seasons, making two sacks in Arizona's 38-31 win at Colorado. \nWhen the Cats returned to the practice field Sunday evening, someone wondered why Banda wasn't doing up-downs, a form of punishment, like some of his teammates. \nDefensive line coach Bill Kirelawich answered. \n\"The Sackmaster can't get tired for this week,\" he said. \nFrom Grayson, Ga., to Tucson, to afterthought, to Sackmaster. \nIsn't life strange? \n\"I finally got my chance,\" Banda said of last week's two-sack performance, which, stunningly enough, gives him the team lead. \"I was just running around playing some football. It's been fun.\" \nA few months ago, he had to ponder if he had a football future at Arizona. No fall camp? That's officially buried on the depth chart. \n\"I'm a patient guy,\" he said. \nGood thing. Before Banda did anything drastic, junior college defensive end Timmy Hamilton decided after only a few days that Arizona wasn't the place for him. He quit, opening up a spot in camp for Banda. And last week, Anthony Fotu, the other junior college import on the defensive line, was suspended for the rest of the season because of a violation of team rules. \nSo, Banda, who entered last week with five fewer career tackles than kicker Casey Skowron, became the next man up. Both of his sacks, plus a pair of quarterback hurries, came in the fourth quarter after the Wildcats had regained the lead. \n\"We got a little lift from him. Everyone was probably saying, 'Jack who?'\" said coach Rich Rodriguez. \n\"He came in, got a couple of sacks, looked pretty good. I'm proud of him. He's another guy who has been in the program kind of waiting for his opportunity, and he showed some good stuff. \n\"This week, in particular with what we're facing, we have to have all the pass rushers we can find. We're going to search the whole roster.\" \nThe challenge this Saturday at Arizona Stadium is Washington State, which leads the nation with 55.3 pass attempts per game. Banda is listed as a backup to defensive tackle Luca Bruno, but Arizona also will push Banda to an edge-rushing position. \nBruno gave Banda a huge hug after the first sack on Saturday. \n\"I was like, 'Finally, dude,'\" Bruno said. \"And then he did again and almost got three. I was loving it.\" \nUntil last week, Banda's claim to fame was that he played on an absolutely loaded Grayson High School football team, whose wealth of major college talent included defensive end Robert Nkemdiche, considered the nation's top recruit in the 2013 class. Banda was \"the other\" defensive end. \n\"He played with some really good players, some of the most highly recruited guys in the country, and his coach kept saying, 'Hey, the guy everyone is missing on is Jack,'\" Rodriguez said. \nBanda had an offer from Florida International to be a tight end/H-back. He entertained some ideas of pursuing a college baseball career as a pitcher (he could hit 92 mph, he says). \nBut with football and an adventurous spirit in his blood, Banda committed to Arizona before even taking a visit. This was his \"big\" school. \n\"I knew I wanted to go somewhere weird, somewhere crazy, and this is what I wanted,\" Banda said. \nArizona liked what it saw after Matt Dudek, the team's director of on-campus recruiting and player personnel, evaluated the highlight video and passed it along to the coaches. \n\"I came here (on my visit) and Matt was like, 'We saw your highlight tape and watched it and that's how we offered you,'\" said Banda, who was used to being overshadowed at Grayson. \"I was like, 'Awesome! They like me for me.'\" \nBanda is listed at 6-foot-3 and 228 pounds, but Banda says his weight is in the low 240s. He says he has a \"really weak immune system,\" which explains a couple of previous illnesses that have slowed his progress. \nBut, now, he's healthy, happy and hungry for more. \n\"We kind of took a little chance,\" Rodriguez said of recruiting Banda. \"We thought he had to get bigger and stronger, and he has. He has worked his tail off and now he's playing a pretty big role for us.\" - - - \nAnthony Gimino has covered University of Arizona athletics for more than two decades, including as the football beat writer for the Arizona Daily Star and the columnist for the Tucson Citizen.", "external_links": [], "published": "2015-10-23T02:25:00.000+03:00", "crawled": "2015-10-23T05:36:20.665+03:00", "highlightTitle": ""}