{"organizations": ["Penn State", "Ohio State"], "uuid": "0a1510b916859fb1e9dbbcc8be13428353e788c5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcmontana.com", "main_image": "http://www.nbcmontana.com/image/view/-/35907144/highRes/2/-/maxh/640/maxw/640/-/lpibq5/-/Ohio-State-beats-Penn-St--gif.gif", "site_section": "http://www.nbcmontana.com/14595026?format=rss_2.0&view=feed", "section_title": "Sports", "url": "http://www.nbcmontana.com/sports/no-1-ohio-state-38-penn-state-10/35905766", "country": "US", "title": "No. 1 Ohio State knocks off Penn State 38-10", "performance_score": 0, "site": "nbcmontana.com", "participants_count": 0, "title_full": "No. 1 Ohio State knocks off Penn State 38-10", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T11:34:00.000+03:00", "replies_count": 0, "uuid": "0a1510b916859fb1e9dbbcc8be13428353e788c5"}, "author": "", "url": "http://www.nbcmontana.com/sports/no-1-ohio-state-38-penn-state-10/35905766", "ord_in_thread": 0, "title": "No. 1 Ohio State knocks off Penn State 38-10", "locations": ["Memphis", "Ohio"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jamie"], "text": "No. 1 Ohio State knocks off Penn State 38-10 Memphis upsets No. 13 Ole Miss By The Sports Xchange POSTED: 9:56 PM Oct 17 2015 UPDATED: 2:34 AM Oct 18 2015 Text Size: Jamie Sabau/Getty Images COLUMBUS, Ohio - \nQuarterback J.T. Barrett ran for two touchdowns and passed for two more as top-ranked Ohio State beat Penn State 38-10 on Saturday night. More from NBC Montana Royals blank Blue Jays 5-0 \nThe Buckeyes (7-0, 3-0 Big Ten) have won 20 straight overall games and 27 consecutive conference regular-season contests. \nBarrett entered for starter Cardale Jones when the Buckeyes reached the red zone and by the fourth quarter was leading the offense full time. Barrett was for 4-of-4 for 30 passing yards and had 102 yards on 11 carries. \nOhio State running back Ezekiel Elliott ran for a score and had 153 rushing yards to surpass 100 yards for the 12th straight game but was topped by Penn State running back Saquon Barkley, who was questionable because of a foot injury but rushed for 194 yards on 26 carries. \nPenn State quarterback Christian Hackenberg opened the third quarter with an 8-yard TD pass to DaeSean Hamilton after a 56-yarder to Chris Godwin set up the score to make it 21-10. Hackenberg was 6 of 12 for 120 yards. \nThe Nittany Lions (5-2, 2-1) had a chance to pull to within 24-17 after a 56-yard run by Barkley in the fourth quarter but Hackenberg was sacked by Tommy Schutt for a 2-yard loss on fourth down from the Ohio State 13-yard line. \nBarrett made it 31-10 with 6:25 left on a 5-yard jump pass to Braxton Miller and later added a 6-yard scoring pass to Mike Thomas.Barrett took over for Jones in the red zone and directed the Buckeyes to three touchdowns and a 21-3 halftime lead. His second rushing touchdown of the second quarter, from 13 yards, came with three minutes left in the half. \nEarlier, Elliott capped a 45-yard drive with a 10-yard run around the right end, eluding four tacklers, to give Ohio State a 14-3 lead. \nBarrett took over a stagnant offense to start the second quarter at the Nittany Lions' 31 and needed four plays for the Buckeyes to go ahead 7-3 on his 5-yard run. He also rushed for 12 yards during the sequence. \nPrior to the Ohio State scoring drive, the Nittany Lions had a possible 10-0 lead on a 44-yard run by Barkley negated by a holding call. \nA Joey Julius 33-yard field goal on the Nittany Lions first drive of the game gave them a 3-0 lead. The big play was a 45-yard catch and run by Chris Godwin. \nIn other games involving Top 25 teams: \nNo. 2 Baylor 62, West Virginia 38 \nWACO, Texas -- Baylor stiff-armed West Virginia for most of the first three quarters before pulling away in the second half. \nBears quarterback Seth Russell passed for 380 yards and five touchdowns and rushed for 160 yards and a touchdown. Russell's 52-yard touchdown pass to wide receiver Jay Lee with 1:31 left in the third quarter gave Baylor (6-0) separation as the Bears pushed ahead 48-24. \nUntil then, West Virginia (3-3) had done enough to hang around and threaten to make a comeback. Quarterback Skyler Howard passed for 289 yards and four touchdowns, but he gave up an interception in the Baylor end zone as the Mountaineers squandered some key chances. \nNo. 3 TCU 45, Iowa State 21 \nAMES, Iowa -- Third-ranked Texas Christian's defense rose up after an awful first quarter and put an end to what was shaping up as a shootout. \nBlanking Iowa State in the last three quarters, the Horned Frogs improved to 7-0 with a 45-21 Big 12 Conference win on Saturday night at Jack Trice Stadium. After yielding 21 first-quarter points and 308 first-half yards, TCU tightened up considerably in the second half, forcing two turnovers and keeping the Cyclones (2-4, 1-2) off the scoreboard. \nMaking the feat more impressive was that it lost starting strong safety Denzel Johnson in the second quarter after he was ejected for targeting. \nMeanwhile, Horned Frogs quarterback Trevone Boykin did just about anything he wanted. Boykin completed 27 of 32 passes for 436 yards and four touchdowns while running 13 times for 74 yards and another score. \nNo. 5 Clemson 34, Boston College 17 \nCLEMSON, S.C. -- Sophomore quarterback Deshaun Watson passed for a season-high 420 yards and No. 5 Clemson shredded the nation's No. 1 defense for 532 yards in a 34-17 Atlantic Coast Conference victory against Boston College on Saturday night. \nThe Tigers (6-0, 3-0 ACC) posted their school-record 14th consecutive home victory. Clemson hasn't lost a home game since a 51-14 loss to Florida State midway through the 2013 season. \nBoston College (3-4, 0-4) entered the game having allowed just 140.3 yards per game, but the Eagles surrendered 139 to the Tigers in the first quarter. Previous Page", "external_links": [], "published": "2015-10-18T11:34:00.000+03:00", "crawled": "2015-10-18T13:40:49.014+03:00", "highlightTitle": ""}