{"organizations": ["TSN Radio", "TSN Radio network", "Bulls", "Blue Jays"], "uuid": "4ae8a1d45f5f2e1744bfe8bf69e4dac68ff8f868", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.vancouversun.com", "main_image": "http://www.vancouversun.com/cms/binary/9669701.jpg", "site_section": "http://rss.canada.com/get/?F260", "section_title": "Vancouver Sun - Sports", "url": "http://www.vancouversun.com/sports/bulls+bears+blue+jays+national+ratings/11444640/story.html", "country": "CA", "title": "Bulls & Bears: Blue Jays win big in national ratings", "performance_score": 0, "site": "vancouversun.com", "participants_count": 0, "title_full": "Bulls & Bears: Blue Jays win big in national ratings", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T03:36:00.000+03:00", "replies_count": 0, "uuid": "4ae8a1d45f5f2e1744bfe8bf69e4dac68ff8f868"}, "author": "", "url": "http://www.vancouversun.com/sports/bulls+bears+blue+jays+national+ratings/11444640/story.html", "ord_in_thread": 0, "title": "Bulls & Bears: Blue Jays win big in national ratings", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Tom Mayenknecht"], "text": "Bulls & Bears: Blue Jays win big in national ratings Tom Mayenknecht hosts The Sport Market on TSN 1040 and TSN Radio, where he regularly rates and debates the Bulls & By Tom Mayenknecht, Special to the Vancouver Sun Tom Mayenknecht, host of The Sport Market on TSN 1040 and the TSN Radio network, regularly rates and debates the Bulls & Bears of the sports business. Photograph by: Vancouver Sun graphics , . \nSorting out the major winners and losers of this week — with a bottom-line twist — in the world of sports. \nBulls of the Week \nIt would be easy to flip the bat and crown the Toronto Blue Jays as the biggest winners in the business of sport for the seventh time this year. The bull market coming out of the Thanksgiving weekend runs much deeper, though, and it’s the Canadian television numbers for the Jays in particular and baseball in general which earn top honours. \nIf there was any doubt the Blue Jays were a national phenomenon, that was erased this past week as Sportsnet used the five-game American League Divisional Series between Toronto and Texas to post the five biggest audiences in the network’s history. The roller-coaster, best-of-five series averaged 3.61 million Canadian viewers per game, climbing from just over two million in the opening-game loss to a Sportsnet record of 4.85 million in Wednesday’s deciding win. It peaked at 8.1 million on the last out and drew an aggregate of 11.5 million Canadians who tuned in for at least some of the game. That Game 5 is the third most-watched sport television show in Canada over the past year, behind only the Super Bowl on CTV (average audience of 9.2 million) and the IIHF World Junior Hockey Championship final on TSN (6.0 million). \nYet what makes the numbers as over the top and memorable as Jose Bautista’s dramatic three-run homer Wednesday is how they compare to the U.S. audiences. In absolute terms, the average Jays telecast is drawing within a million viewers of the typical Major League Baseball post-season game in the U.S., which has averaged 4.05 million Americans to date on FOX Sports, FS1, TBS and ESPN. On a per capita basis, however, Canadians have been eight times more likely to watch post-season ball as Americans have and that’s truly remarkable considering the engagement of teams from major U.S. media markets New York, Los Angeles, Chicago, Dallas and Houston. Wednesday’s ALDS Game 5 drew 3.199 million Americans and 4.85 million Canadians for a combined total of more than eight million viewers, making it the continent’s most watched game in the history of the MLB divisional series (since 1995). \nBears of the Week \nSo much of the business of sport comes down to return on investment. That’s where the Los Angeles Dodgers fall short yet again this year. Despite a ridiculous payroll of $314 million US — not only a MLB record but a North American and global record for a professional sport franchise — the Dodgers were eliminated at the hands of the much more efficient New York Mets (with a team payroll of $120 million). It shows money can’t always buy you success. Consider this: The pitching-salary investment the Mets made this year in Jacob deGrom ($556,875) earned them two NLDS wins. The only two Dodgers wins cost them $57,571,428 in salaries and bonuses for Clayton Kershaw ($32.5 million) and Zach Greinke ($25 million). That means 103 deGroms could be had for the price of Kershaw and Greinke. \nListen to The Sport Market on TSN 1040 AM Saturdays, 7 a.m. to 11 a.m. Bulls & Bears airs at 9 a.m., followed by Weekend Extra with Sun Sports at 9:30 a.m. Follow Tom Mayenknecht at: Twitter.com/thesportmarket", "external_links": [], "published": "2015-10-17T03:36:00.000+03:00", "crawled": "2015-10-17T11:15:20.527+03:00", "highlightTitle": ""}