{"organizations": ["SUU Thunderbirds", "NFL"], "uuid": "e77332181fea7fc956676cf7b71a8f1338ce3d60", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.deseretnews.com", "main_image": "http://img.deseretnews.com/images/article/hires/1607931/1607931.jpg", "site_section": "http://www.deseretnews.com/sports/suu/index.rss", "section_title": "Southern Utah University sports scores, stats, schedules and SUU news - Deseret News", "url": "http://www.deseretnews.com/article/865638402/Trio-of-projected-NFL-draft-picks-help-SUU-Thunderbirds-to-3-game-winning-streak.html", "country": "US", "title": "Trio of projected NFL draft picks help SUU Thunderbirds to 3-game winning streak", "performance_score": 0, "site": "deseretnews.com", "participants_count": 0, "title_full": "Trio of projected NFL draft picks help SUU Thunderbirds to 3-game winning streak | Deseret News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "e77332181fea7fc956676cf7b71a8f1338ce3d60"}, "author": "", "url": "http://www.deseretnews.com/article/865638402/Trio-of-projected-NFL-draft-picks-help-SUU-Thunderbirds-to-3-game-winning-streak.html", "ord_in_thread": 0, "title": "Trio of projected NFL draft picks help SUU Thunderbirds to 3-game winning streak", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["LeShaun Sims", "Miles Killebrew", "James Cowser"], "text": "James Cowser, Miles Killebrew and LeShaun Sims projected to be drafted in the fourth through seventh rounds.\nMore Coverage Gary Crowton resigns as SUU offensive coordinator “ Their whole goal is right here at SUU, and I think that’s real leadership.”\nSUU head coach Ed Lamb\nCEDAR CITY — The NFL hype surrounding Southern Utah this year is new territory for the Thunderbirds. And it’s quickly proving to be thrilling, new territory as the T-Birds enter their bye week on a 3-game winning streak.\nLast Friday Southern Utah blew out its in-state rival, Weber State, 44-0. A great deal of the shutout is owed to the T-Birds’ defensive projected NFL draft picks James Cowser, Miles Killebrew and LeShaun Sims.\nSouthern Utah head coach Ed Lamb was quick to credit not only the humility of the trio, but the widespread of productive players scattered on the T-Bird roster.\n“They are great leaders because of how talented they are and how humble they are,” Lamb said. “Night in and night out, whether those guys are even our most productive players, is always a question mark. We’ve got a lot of other really productive players on defense.”\nLamb explained that the NFL isn’t something that is frequently talked about. Right now, every split-second of attention is for the T-Birds.\n“Their whole goal is right here at SUU, and I think that’s real leadership,” Lamb said.\nAt defensive end, Cowser explains the recent game-time success is a reflection of the intensity on the practice field.\n“We have improved the intensity and focus at practice,” Cowser said. “We had solid practices in the beginning of the season, but they’ve improved as games have gone by.”\nAlthough the projected NFL draft picks are giving college football their attention, the NFL light at the end of the tunnel provides the trio with an extra shove of motivation.\n“It makes me work hard at the little things,” Cowser said. “Those are the things that fall away the fastest, but the extra motivation keeps me focused.”\nIn the 2012, in the lead-up to Brad Sorensen being drafted by the San Diego Chargers, it wasn’t unusual to see a scout or two at the SUU football games. Now, in the Cowser, Killebrew, Sims era, seeing numerous scouts at a single practice is just another day.\nThe scouts don’t only keep the threesome on their toes, but the entire Thunderbird program.\n“Accountability increases performance. So having them (NFL scouts) around keeps you accountable,” Cowser said. “Same goes for the team.”\nCowser, Killebrew and Sims have made all sorts of transitions since they stepped foot on T-Bird terrain, but with years of determination and trust in the program, the NFL is nearly tangible.\n“One thing they all had from the moment they got onto campus was trust,” Lamb said in a SUU press release. “We started talking about longterm goals and about taking care of business in the classroom and the weight room and these guys trusted that. That trust has helped put them in the position they are in now.”\nThe trust has paid off: the three Southern Utah defensive powerhouses have earned spots on the CBS Sports 2016 NFL Draft Prospects List .\nAt 6-foot-4, 258 pounds, Cowser is ranked 13th at the defensive end position, 125th overall, and is projected to be a fourth-round draft pick.\n“I always hoped that it would come, but it felt so distant,” the Davis High graduate said of reaching his NFL dream. “It’s fun having the opportunity. It makes things different and exciting.”\nAt 6-foot-3, 230 pounds, Killebrew holds a national 12th place ranking at strong safety and is projected to go in the sixth or seventh rounds.\n“I’d be lying to you if I said it wasn’t awesome,” the Henderson, Nevada, native said in a SUU press release. “It’s definitely fun to have that exposure and work to make it to the next level.”\nSims, cornerback at 6-0 and 200 pounds, is a projected seventh round draft pick.\n“Playing in the NFL has always been something I hoped for, but now that it’s finally coming to fruition, it’s definitely surreal,” the Las Vegas native said in a SUU press release.", "external_links": ["http://www.cbssports.com/nfl/draft/prospectrankings/2016/all"], "published": "2015-10-06T03:00:00.000+03:00", "crawled": "2015-10-06T22:58:04.407+03:00", "highlightTitle": ""}