{"organizations": [], "uuid": "8ebd783e6901d5df4f494ddbae009c7b3a6db25a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tucsonnewsnow.com", "main_image": "http://kold.images.worldnow.com/images/8991794_G.jpg", "site_section": "http://www.tucsonnewsnow.com/Global/category.asp?C=5169&clienttype=rss", "section_title": "Tucson News Now - Sports", "url": "http://www.TucsonNewsNow.com/story/30235171/gimino-arizona-coaches-push-right-buttons-in-win", "country": "US", "title": "Gimino: Arizona coaches push right buttons in win", "performance_score": 0, "site": "tucsonnewsnow.com", "participants_count": 1, "title_full": "Gimino: Arizona coaches push right buttons in win", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T22:34:00.000+03:00", "replies_count": 0, "uuid": "8ebd783e6901d5df4f494ddbae009c7b3a6db25a"}, "author": "Anthony Gimino", "url": "http://www.TucsonNewsNow.com/story/30235171/gimino-arizona-coaches-push-right-buttons-in-win", "ord_in_thread": 0, "title": "Gimino: Arizona coaches push right buttons in win", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Gimino: Arizona coaches push right buttons in win - Tucson News Now Member Center: Gimino: Arizona coaches push right buttons in win Posted: Paul Magloire helps bring down Oregon State QB Seth Collins from behind. (Photo courtesy: Colin Prenger/Arizona Athletics) TUCSON, AZ (Tucson News Now) - \nArizona had lost two games by a combined score of 111-47. It was ugly. The defense couldn't tackle anyone. Injuries continued to mount. \nThere was and is no break in the schedule for the team to catch its breath, to rest, to assess and reset. \nBut as the Wildcats reached the midpoint of their season Saturday night against Oregon State, the coaches had to do something. But what? It was easy for one of Rich Rodriguez's quotes from last week to be dismissed and filed under \"Coachspeak, game week, misc.\" but he was telling us the truth when he said this: \n\"We're not going to sit there and give up. We're going to try everything we can.\" \nArizona did a lot of trying and tweaking Saturday night and those efforts looked good in a complete 44-7 victory over the Beavers that pushed the Wildcats to 4-2 overall and painted the rest of the season in a brighter hue. \n\"I don't think we executed greatly all the time but we executed well enough and really played hard,\" Rodriguez said. \n\"It's just important to get a win. ... We needed that for our confidence, and I think our guys needed that for themselves to say, 'Hey, we can be a pretty good football team.'\" \nEverything from Saturday night has to be put in the context of \"Oregon State is a young and not very good football team,\" and there is still no evidence the Wildcats can hang with a team that is Top 25 quality, but some of the personnel changes have a chance to take root and solve previous issues. \nHere are three: \n1. New left side of the line \nTowering left tackle Freddie Tagaloa has been the heir apparent at left tackle since arriving last year as a transfer from Cal. There was no other experienced in-house option. \nDespite the high expectations, Tagaloa hasn't graded out well at left tackle while redshirt freshman Layth Friekh has emerged as a tag-team partner in recent games. Now more comfortable with Friekh, the coaches gave him the starting job Saturday, sliding Tagaloa to left guard, replacing Zach Hemmila. \n\"Freddie is probably more of a natural at guard than tackle,\" Rodriguez said. \"I think playing left guard is a good fit for Freddie.\" \nAs former Arizona tight end (and FOX11 sports contributor) Glenn Howell noted, the move to guard allows Tagaloa (6-8, 316) to use his big body in a tighter blocking window where he doesn't have to worry about the outside pass rush. Howell, observing from the sideline during games, praised the way Tagaloa fired off the ball on running plays and used that size to envelop defenders. \n2. Paul Magloire moves to linebacker \nThe junior college transfer hasn't found a big role at safety, so perhaps the only surprising thing about his move to weakside linebacker is that it hasn't happened earlier, given the injuries ravaging the linebacker position. This is the same move the Arizona coaches have previously made with safeties Marquis Flowers and Tra'Mayne Bondurant. \nMagloire, playing more in the box and often stepping up as the fourth man on the line, made a team-high nine tackles, including two for loss. The Cats got more athletic and adding potential playmaking near the line of scrimmage with Magloire, who more than doubled his season total for tackles. He had eight in the first five games. \n\"It was good. I was excited all week. It was tough for me to keep it in and not tweet about it,\" Magloire said. \"The coaches put their faith in me and coached me up all week.\" \n3. Jake Matthews in the middle \nThe junior wasn't the \"next man up\" at middle linebacker, he was the next-next-next-next man up. \nMatthews became the fourth middle linebacker Arizona has tried in the wake of Scooby Wright's injuries, and we might have a winner. He's moving over from outside linebacker, where has ample experience, and while he doesn't have ideal size for the middle, he is taller and rangier (6-3, 221) than Sir Thomas Jackson, who manned the spot a week ago. \n\"He's a smart kid who can play multiple positions at linebackers,\" Rodriguez said. \nSaid Magloire: \"The one thing about Jake is he's really smart. ... Not just smart, I think he's a nerd to be honest with you. Having him in the middle, he kind of leans over and tells us, 'Hey, watch this, this is going to happen.' ... He's smart. It's good to have him in the middle.\" \nMatthews had five tackles and a sack against Oregon State. \nThe Arizona defense allowed just 249 yards, including 98 through the air, the lowest number of passing yards yielded by the Cats in a conference game since 2008 against UCLA. The Wildcats set an important tone by giving up just one first down and 38 yards in Oregon State's first three possessions. \nAnd Matthews was in the middle of it all. \n\"It was certainly the best we've played defensively all year,\" Rodriguez said. \nThe Wildcats will try to do it again at Colorado this Saturday, hoping that these changes prove to be more than a one-hit wonder.", "external_links": [], "published": "2015-10-11T22:34:00.000+03:00", "crawled": "2015-10-11T22:56:52.315+03:00", "highlightTitle": ""}