{"organizations": ["Oklahoma State", "AP"], "uuid": "1e44d99741ac489c201e4899ffd5cf37c092f480", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stwnewspress.com", "main_image": "http://stwnewspress.com/content/tncms/live/global/resources/images/_site/og_image_stwnewspress.jpg", "site_section": "http://www.stwnewspress.com//search/?q=&t=article&l=100&d=&d1=&d2=&s=start_time&sd=desc&nsa=eedition&c[]=sports,sports/*&f=rss", "section_title": "Stillwater News Press - sports,sports/", "url": "http://www.stwnewspress.com/sports/no-oklahoma-state-looks-to-remain-unbeaten-at-wvu/article_629cd278-6f0f-11e5-b818-1bd5d2e71769.html", "country": "US", "title": "No. 21 Oklahoma State looks to remain unbeaten at WVU", "performance_score": 0, "site": "stwnewspress.com", "participants_count": 0, "title_full": "No. 21 Oklahoma State looks to remain unbeaten at WVU", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T16:00:00.000+03:00", "replies_count": 0, "uuid": "1e44d99741ac489c201e4899ffd5cf37c092f480"}, "author": "", "url": "http://www.stwnewspress.com/sports/no-oklahoma-state-looks-to-remain-unbeaten-at-wvu/article_629cd278-6f0f-11e5-b818-1bd5d2e71769.html", "ord_in_thread": 0, "title": "No. 21 Oklahoma State looks to remain unbeaten at WVU", "locations": ["WVU MORGANTOWN", "West Virginia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Skyler Howard", "Dana Holgorsen"], "text": "MORGANTOWN, W.Va. (AP) — After No. 10 Oklahoma got finished knocking around quarterback Skyler Howard and his running backs, West Virginia coach Dana Holgorsen wanted to improve his team’s pass protection and run blocking. \nThen he found out what No. 21 Oklahoma State has been doing to opposing offenses. \nThe Cowboys head to West Virginia on Saturday night leading the nation in total sacks (22) and tackles for loss (51). \n“I don’t know how I feel about that as a coach,” Holgorsen said. “I prefer a little bit more time to defend against that.” \nAfter he’s done fine-tuning for Oklahoma State (5-0, 2-0 Big 12), it only gets tougher. The Mountaineers (3-1, 0-1) will play at No. 3 Baylor and No. 2 TCU later this month. \n“With some of these offenses coming up, Oklahoma State being one of them, you have to focus on getting some stops,” Holgorsen said. “Obviously, on the other side, you have to score what you have to score in order to win. Some of them, it looks like it has to be 70 points.” \nCowboys coach Mike Gundy might settle for a sliver of that total if it means keeping an unbeaten season going. He’s still looking for a comfortable league win after needing last-minute field goals by Ben Grogan to beat Texas and Kansas State. \nLike Holgorsen, who was his offensive coordinator in 2010, Gundy is trying to tweak his running game. Chris Carson and backup Rennie Childs sat out last week against K-State and the Cowboys were limited to 49 yards on the ground. Gundy expects the pair back on the field Saturday. \n“Offensively, we’ve still got to find a way to run the football and be a more balanced team,” Gundy said. \nGundy likes what he sees from his defense, which is allowing the fewest yards in the Big 12 at 310 per game. But the Cowboys still have yet to play the league’s five top scoring teams. \n“We’ll see where we’re at, but I’m fairly confident that our defense is better than what it has been,” he said. \nHere are some things to know about Oklahoma State and West Virginia in their seventh meeting all-time: \nLONG PASSES \nWest Virginia gave up 10 pass plays of 15 yards or more last week against Oklahoma. “Everyone wants to blame the defensive backs, but it’s either a lack of pass rush or the linebackers doing their job,” said West Virginia defensive coordinator Tony Gibson. “It’s not always the defensive backs.” Things aren’t expected to slow down against Oklahoma State’s Mason Rudolph, who threw 55 times, had 437 yards and three TDs against Kansas State \nSACK ATTACK \nOklahoma State defensive end Emmanuel Ogbah leads the Big 12 with 6.5 sacks and 9.5 tackles for loss. Five other Cowboys have at least two sacks. \nPUNT RETURN FOLLIES \nOklahoma State has the Big 12’s worst average on punt returns at 2.7 yards per try. West Virginia fielded two punts inside its 10-yard line against Oklahoma instead of letting the ball roll into the end zone. K.J. Dillon lost a yard after catching a punt at the 7. Freshman Gary Jennings caught one at the 4 and returned it 6 yards. \nHOLGORSEN RECRUIT \nHolgorsen can only blame himself if Oklahoma State wide receiver David Glidden has a good day against the Mountaineers. In his only season in Stillwater, Holgorsen recruited Glidden in 2010 out of Mustang, Oklahoma. Now a senior, Glidden leads the Cowboys with 23 catches for 407 yards and three scores. \nIN JOSEPH’S PLACE \nEither Jarrod Harper or Jeremy Tyler will start at safety in place of West Virginia senior Karl Joseph, whose career is done after a knee injury in practice Tuesday. Harper would be making his first start, Tyler his second. Joseph was tied for the national lead with five interceptions. Sign Up / Sign In With your existing account from... {* loginWidget *}", "external_links": [], "published": "2015-10-10T16:00:00.000+03:00", "crawled": "2015-10-13T08:09:19.507+03:00", "highlightTitle": ""}