{"organizations": [], "uuid": "f173c318db8bbcc48ad8d9df14c2aac498878979", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kirotv.com", "main_image": "", "site_section": "http://www.kirotv.com/", "section_title": "Seattle News, Weather, Traffic, Video and Sports | KIRO 7... | www.kirotv.com", "url": "http://www.kirotv.com/news/ap/top-news/woman-faces-2nd-degree-murder-charges-in-oklahoma-/nn9GP/", "country": "US", "title": "Woman faces 2nd-degree murder charges in Oklahoma crash", "performance_score": 0, "site": "kirotv.com", "participants_count": 1, "title_full": "Woman faces 2nd-degree murder charges in Oklahoma crash | www.kirotv.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T06:36:00.000+02:00", "replies_count": 0, "uuid": "f173c318db8bbcc48ad8d9df14c2aac498878979"}, "author": "JUSTIN JUOZAPAVICIUS", "url": "http://www.kirotv.com/news/ap/top-news/woman-faces-2nd-degree-murder-charges-in-oklahoma-/nn9GP/", "ord_in_thread": 0, "title": "Woman faces 2nd-degree murder charges in Oklahoma crash", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A 25-year-old woman accused of driving a car into a crowd of people at an Oklahoma State University homecoming parade over the weekend, killing four people and injuring dozens of others, is set to make her first court appearance.\nAdacia Chambers of Stillwater is scheduled to appear Monday in Payne County District Court. Chambers was arrested after the Saturday crash on suspicion of driving while under the influence. Stillwater police said Sunday she was being held on four additional counts of second-degree murder.\nPolice did not elaborate on the new charges in a statement announcing them, and a spokesman did not return repeated messages seeking comment. Officials with the Payne County district attorney's office couldn't immediately be reached.\nTony Coleman, Chambers' attorney, said at a press conference in Oklahoma City that he believed his client suffers from a mental illness but that there was no indication that she was drinking before the crash. Police are awaiting blood tests to determine whether Chambers was impaired by drugs or alcohol.\n\"I absolutely can rule out alcohol,\" Coleman said.\nHe said he spoke with Chambers for about an hour, adding, \"During that entire interview, I was not satisfied at all that I was communicating with a competent individual.\"\nColeman also said Chambers, who had been at work before the crash, doesn't remember much of what happened, only recalling people removing her from the car and being extremely confused.\n\"There was a period where I think ... she could have even blacked out,\" Coleman said.\nMessages to Stillwater police seeking comment on Coleman's statements weren't immediately returned.\nChambers' father, Floyd Chambers of Oologah, told The Oklahoman newspaper Saturday he couldn't believe his daughter was involved and said she was not an alcoholic. Floyd Chambers couldn't be reached for comment Sunday by The Associated Press.\nColeman described the Chambers family during the news conference as \"absolutely devastated.\"\nWitnesses of the crash described a scene of chaos as bodies flew into the air from the impact and landed on the road. Three adults and a 2-year-old boy, who wasn't immediately identified, were killed and at least 46 others were hurt, including at least four critically injured.\nThe dead adults were identified as Nakita Prabhakar Nakal, 23, an MBA student from India at the University of Central Oklahoma in Edmond, and a married couple, Bonnie Jean Stone and Marvin Lyle Stone, both 65, of Stillwater. Marvin Stone was a retired professor of agricultural engineering, who had been popular with students, a colleague said.\n\"He was loved by students and one of the best teachers we had,\" said Ron Elliott, the former head of the Biosystems and Agricultural Engineering Department at OSU. \"He just really had a gift for connecting with students and helping them learn,\" Elliott said in a telephone interview.\nKonda Walker, an OSU graduate who was in Stillwater with her sister to celebrate homecoming, said she was only about 50 feet from the crash scene.\nShe said it took her a few seconds to process what had happened. There were bodies and injured people lying \"all over the place,\" Walker said.\n\"One woman was a crumpled mess on the road. They turned her over and started CPR. We realized she didn't make it,\" she said.\nAmong the injured were nine children 10 years old or younger.\nAt the corner of the intersection where the suspect's car came to a stop, a makeshift memorial grew Sunday with balloons, flowers, stuffed teddy bears and candles with black and orange ribbons tied around them, for the school's colors. A handmade sign read, \"It's always darkest before dawn. Stay strong.\"\nAnthea Lewis had tears in her eyes as she placed a child's hat with an Oklahoma State University logo at the base of the memorial.\nOne of the injured had been a baby sitter of hers, she said.\n\"I've lived here my whole life, and this blows my mind,\" she said.\nHundreds gathered for a vigil at the campus Sunday night.\n___\nAssociated Press writer Ken Miller in Oklahoma City contributed to this report.\nCopyright The Associated Press", "external_links": ["http://w.sharethis.com/button/buttons.js"], "published": "2015-10-26T06:36:00.000+02:00", "crawled": "2015-10-26T22:24:40.295+02:00", "highlightTitle": ""}