{"organizations": [], "uuid": "9d04028889fcfae6b4cd8becbf5f461dd71cee42", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pe.com", "main_image": "http://images.onset.freedom.com/pressenterprise/thumb/nvxg33-001perheat1009kfm.jpg", "site_section": "http://www.pe.com/", "section_title": "Press Enterprise : Riverside County California News, Sports and Entertainment", "url": "http://www.pe.com/articles/heat-782902-degrees-centers.html", "country": "US", "title": "INLAND WEATHER: Organizers hope heat doesn’t put damper on weekend events", "performance_score": 0, "site": "pe.com", "participants_count": 2, "title_full": "INLAND WEATHER: Organizers hope heat doesn’t put damper on weekend events - Press Enterprise", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 1, "uuid": "0586e7674d788dc0040bfa7ef4c61bbaed657d17"}, "author": "CRAIG SHULTZ", "url": "http://www.pe.com/articles/heat-782902-degrees-centers.html#post-0", "ord_in_thread": 0, "title": "INLAND WEATHER: Organizers hope heat doesn’t put damper on weekend events", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BY CRAIG SHULTZ / STAFF WRITER\nPublished: Oct. 8, 2015 Updated: 11:09 p.m. INLAND WEATHER: Organizers hope heat doesn’t put damper on weekend events Print Photo Share Pin It More Galleries ADVERTISEMENT Walkers brave the morning heat as they make their way down Mount Rubidoux in Riverside on Thursday, Oct. 8. Southern California experiences summer-like temperatures as another early autumn heat wave moves in. KURT MILLER, STAFF PHOTOGRAPHER Related article » Autumn has arrived, but don’t tell that to people such as Vera Stamenkovic. She’s hoping that predicted high temperatures around 100 degrees won’t keep people away from a pumpkin patch for preschoolers at Evergreen Memorial Historic Cemetery in Riverside she is helping to organize.\n“Bottom line, I know it’s going to be a hot day,” Stamenkovic said.\nThe National Weather Service issued a heat advisory for 10 a.m. to 8 p.m. Friday in the Inland Empire. The advisory warns that temperatures are expected to be 10 to 20 degrees above normal — up to 100 to 105 degrees.\nHeat is still expected Saturday, when a number of outdoor community events are planned around the region.\nTry as they may, organizers of the pumpkin patch, which raises money for cemetery upkeep, couldn’t escape the heat. Stamenkovic said temperatures topped 100 degrees during the event last year, so they moved it to later in October in hopes of cooler temperatures.\nRendezvous Back to Route 66 in San Bernardino will be Saturday, but Judi Penman, CEO of the San Bernardino Area Chamber of Commerce, isn’t too concerned about the heat.\n“People should wear hats, cooler clothing, find some shade or go to the beer gardens,” she said. “We Californians are used to the hot weather.”\nSeveral cooling centers will be open this weekend for people who need relief from the heat, said Kerri Mabee, a spokeswoman for the Riverside County Public Health Department.\nThe list of cooling centers is available at rivcohealthdata.org and click on “Cool Centers.”\nA simlar list in San Bernardino County can be found at 211sb.org/cooling-centers\nResidents are advised to stay hydrated, not to overdo physical activity in the heat and keep in the shade or an air-conditioned environment, Mabee said.\nThe It’s Not Dead punk festival is expected to attract thousands to the grounds of San Manuel Amphitheater in Devore on Saturday, with bands such as Bad Religion and NOFX performing. Organizers had already planned for shaded areas and water refilling stations, but are looking into adding misting stations as well.\nCalifornia Baptist University has men’s and women’s soccer matches scheduled for Saturday afternoon, and athletic director Micah Parker said trainers monitor the weather to keep participants safe.\n“We’ll look at the temperature, the humidity, and if we feel it would be unsafe for our players we’ll make adjustments,” he said.\nUnscheduled water breaks are common for afternoon soccer games.\n“Anytime it climbs over 100 degrees we look at (making adjustments)” Parker said, adding only one game has been rescheduled because of heat during his six years and one game was postponed due to air quality.\nHemet Fire Chief Scott Brown was a bit amused that it is expected to be so hot on the day the department hosts its annual open house.\n“Murphy’s law,” he said. “Last week we were dealing with rain.”\nStaff writers Vanessa Franko, Stephanie Schulte, Ali Tadayon, Imran Ghori and Allan Steele contributed to this article.\nContact the writer: 951-368-9086 or cshultz@pe.com", "external_links": ["http://common.onset.freedom.com/images/gallery/twitter-ico.jpg", "http://common.onset.freedom.com/images/gallery/fb-ico.jpg", "http://images.onset.freedom.com/pressenterprise/thumb/nvxg33-001perheat1009kfm.jpg", "http://www.rivcohealthdata.org/home/index.php/cool-centers", "http://assets.pinterest.com/js/pinmarklet.js?r=", "http://211sb.org/cooling-centers", "http://s7.addthis.com/js/250/addthis_widget.js#username=YOUR-ACCOUNT-ID", "http://common.onset.freedom.com/images/gallery/mail-ico.jpg", "http://images.onset.freedom.com/pressenterprise/gallery/nvxg33-001perheat1009kfm.jpg"], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-09T18:08:46.416+03:00", "highlightTitle": ""}