{"organizations": ["Associated Press", "Aston Villa", "Bournemouth", "Premier League", "Aston Villa and Arsenal"], "uuid": "3ab3a4c07ada928b08dda293ffa30b9d43de0e07", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theprovince.com", "main_image": "http://www.theprovince.com/cms/binary/11466376.jpg", "site_section": "http://rss.canada.com/get/?F255", "section_title": "The Province - Sports", "url": "http://www.theprovince.com/sports/aston+villa+fires+manager+sherwood+after+only+months+charge/11466375/story.html", "country": "CA", "title": "Aston Villa fires manager Tim Sherwood after only 8 months in charge", "performance_score": 0, "site": "theprovince.com", "participants_count": 0, "title_full": "Aston Villa fires manager Tim Sherwood after only 8 months in charge", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T22:40:00.000+02:00", "replies_count": 0, "uuid": "3ab3a4c07ada928b08dda293ffa30b9d43de0e07"}, "author": "", "url": "http://www.theprovince.com/sports/aston+villa+fires+manager+sherwood+after+only+months+charge/11466375/story.html", "ord_in_thread": 0, "title": "Aston Villa fires manager Tim Sherwood after only 8 months in charge", "locations": ["Swansea", "London", "Wembley"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Villa", "Tim Sherwood"], "text": "By The Associated Press s coach, Tim Sherwood, before the English FA Cup final soccer match between Aston Villa and Arsenal at Wembley stadium in London. Aston Villa fired manager Tim Sherwood on Sunday, Oct. 25, 2015, after eight months in charge of the Premier League club. Villa lost 2-1 at home to Swansea on Saturday, a sixth straight defeat in the league, having not won since the opening day of the season in August against Bournemouth. (AP Photo/Alastair Grant, File) \nBIRMINGHAM, England - Aston Villa fired manager Tim Sherwood on Sunday after eight months in charge of the Premier League club. \nVilla lost 2-1 at home to Swansea on Saturday, a sixth straight defeat in the league, having not won since the opening day of the season in August against Bournemouth. \nThe club, owned by American Randy Lerner, is in the Premier League relegation zone with only four points from 10 matches. \n\"The board has monitored the performances closely all season and believes the results on the pitch were simply not good enough and that a change is imperative,\" Villa said in a statement. \n\"The club would like to place on record its sincere thanks to Tim for all his efforts during a difficult period last season and for the many positive contributions he has made to the entire football setup.\" \nSherwood replaced Paul Lambert as manager in February when the club dropped into the relegation zone. \nBut he led Villa to safety with a finish of 17th last season and also guided the team into the final of the FA Cup, before losing 4-0 to Arsenal at Wembley in May. \nThe 46-year-old Sherwood acknowledged his job was under threat after the loss at Villa Park when Swansea rallied to win with a goal in the 87th minute. \n\"It is not about me personally, it is about the football club and the players,\" Sherwood told Sky Sports after the match. \"We are all in it together and we are in a bit of a mess at the moment. \n\"I can't affect anyone who makes the decisions at the football club,\" Sherwood said. \"I'll keep working as hard as I can.\" \nAssistant manager Ray Wilkins, first-team coach Mark Robson and performance analyst Seamus Brady have also left. \nKevin MacDonald, who has been coaching the under-21s, was placed in temporary charge. \nVilla travels to Southampton for a League Cup match on Wednesday, before an away game against Tottenham in the league on Nov. 2. \nPossible contenders to replace Sherwood include former Liverpool manager Brendan Rodgers, who was fired earlier in October. \nRemi Garde, who left French club Lyon last year, has also been linked with the job. E-mail this Article Print this Article", "external_links": [], "published": "2015-10-25T22:40:00.000+02:00", "crawled": "2015-10-26T09:40:05.279+02:00", "highlightTitle": ""}