{"organizations": [], "uuid": "07d31bdd5db44b6d12a357306f62c27282dc03a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/47529300.cms", "site_section": "http://timesofindia.indiatimes.com/Sports/More-sports/Shooting/articlelist/3413165.cms", "section_title": "Shooting - More sports - Sports - The Times of India", "url": "http://timesofindia.indiatimes.com/sports/more-sports/shooting/India-to-host-2017-Shooting-World-Cup-NRAI-aims-for-World-Cships/articleshow/49168421.cms", "country": "IL", "title": "India to host 2017 Shooting World Cup, NRAI aims for World C'ships", "performance_score": 0, "site": "indiatimes.com", "participants_count": 1, "title_full": "India to host 2017 Shooting World Cup, NRAI aims for World C'ships - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "07d31bdd5db44b6d12a357306f62c27282dc03a3"}, "author": "timesofindia.indiatimes.com", "url": "http://timesofindia.indiatimes.com/sports/more-sports/shooting/India-to-host-2017-Shooting-World-Cup-NRAI-aims-for-World-Cships/articleshow/49168421.cms", "ord_in_thread": 0, "title": "India to host 2017 Shooting World Cup, NRAI aims for World C'ships", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW DELHI: India will be hosting the combined shotgun/rifle/pistol World Cup in 2017 and based on the event's success, the NRAI will contemplate bidding for the 2018 prestigious World Championship, in which 70 Tokyo Olympic quota places will be up for grabs.\nThe combined tournament is the year's one of the four World Cups in the International Shooting Sport Federation's ( ISSF) calendar.\n\"We have got the combined World Cup in 2017 and if all goes well, we will be bidding to host the combined World Championships where there will be 70 quota places for 2020 Olympic Games,\" NRAI president Raninder Singh told PTI.\nThe NRAI is using the ongoing 8th Asian Air Gun Championship as a platform to bid for bigger events in near future.\nThe airgun tournament precedes the Asian Shooting Championship, scheduled to be held in Kuwait in November, and which will be the last qualification event for next year's Olympics. The shooters are using this as preparation for the November event.\nConsidering this, the ongoing tournament at the Karni Singh Shooting Range was expected to be an eventful one, but lack of enough corporate support and the absence of title sponsor is not helping the cause of the sport, which has given India four Olympic individual medals in the last three Olympics.\nIt is no secret that the sport has brought home maximum medals from top international competitions in the last decade and a half.\nThe shooting fraternity is trying its bit to attract audience.\n\"It's unfortunate that the tournament doesn't have a title sponsor and there is not enough corporate support. That's why we have gone the broadcast way for the first time.\n\"We are trying to make it as spectator friendly as possible and we hope this (live telecast of the tournament) will attract the corporate houses,\" Raninder said.\nLeading sports channel Star Sports has acquired the live telecast rights of the Airgun Championship.\nA committed Raninder had said earlier, \"This is the first time that an international shooting event at this level shall be produced and broadcast live. Shooting is a sport with tremendous mass interest and it is also the best medal prospect for India at next year's Rio Games. I am committed to make shooting a household sporting spectacle.\"", "external_links": [], "published": "2015-09-30T03:00:00.000+03:00", "crawled": "2015-10-13T09:45:56.917+03:00", "highlightTitle": ""}