{"organizations": [], "uuid": "43348278c925c1e7db8d181bd3dc0b6eae813deb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.idsnews.com", "main_image": "http://duvq7ua50whdw.cloudfront.net/20150925QJxaKBpvYx/dist/img/IDS-fb-icon.png", "site_section": "http://www.idsnews.com/section/sports", "section_title": "Sports | Indiana Daily Student", "url": "http://www.idsnews.com/article/2015/10/final-iu-27-ohio-state-34", "country": "US", "title": "FINAL: IU 27, Ohio State 34", "performance_score": 0, "site": "idsnews.com", "participants_count": 1, "title_full": "FINAL: IU 27, Ohio State 34 | Indiana Daily Student", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T03:34:00.000+03:00", "replies_count": 0, "uuid": "43348278c925c1e7db8d181bd3dc0b6eae813deb"}, "author": "IDS Reports", "url": "http://www.idsnews.com/article/2015/10/final-iu-27-ohio-state-34", "ord_in_thread": 0, "title": "FINAL: IU 27, Ohio State 34", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "IU lost to No. 1 Ohio State 34-27 despite losing junior quarterback Nate Sudfeld and junior running back Jordan Howard to injuries.\nThe Hoosiers drove to the Ohio State 6-yard line with seconds remaining, but a penalty pushed them back. IU was unable to score and backup quarterback Zander Diamont’s final pass went incomplete as time expired.\nWith a nearly full crowd in attendance, the IU defense shut down the Ohio State offense on three plays to open the game. The Hoosiers were unable to take advantage of the start as they went three and out as well.\nAfter forcing yet another three and out, IU took the ball down to the Ohio State red zone and settled for a 34-yard field goal. Main play on the drive was a 38-yard pass across the middle from Sudfeld to senior tight end Anthony Corsaro.\nContinuing on its momentum, Sudfeld and the offense drove down field and scored on a short touchdown run by sophomore running back Devine Redding. Ohio State then drove to the IU 5-yard line, but IU stopped them on third and short to hold the Buckeyes to a field goal. IU led 10-3.\nJunior running back — and the nation’s leading rusher — Jordan Howard went into the locker room in the second quarter with an unclear leg injury. He soon returned on the next drive.\nAfter a dropped pass by sophomore receiver Simmie Cobbs and a 14-yard punt by Erich Toth, Ohio State quarterback Cardale Jones made several IU defenders miss while scrambling and completed a pass to Jalin Marshall. Marshall then fumbled the ball and IU recovered near its own goal line.\nIU then attempted a fake punt from its own 16 yard line that came up short, giving the ball back to Ohio State at the 13-yard line. Ohio State was unable to convert this into a touchdown and settled for a field goal to make it 10-6 IU.\nTowards the end of the half, Ohio State once again marched down field to the IU 22. A 39-yard field goal attempt went off the crossbar to keep IU up 10-6.\nIn the second half, IU quickly took the lead with a 55-yard Ezekiel Elliot touchdown.\nSoon after, Sudfeld went out an injured foot and Howard reinjured his ankle. Sophomore quarterback Zander Diamont, who filled in for an injured Sudfeld last season, came in.\nAs Ohio State drove in IU territory, sophomore linebacker Tegray Scales intercepted a Jones pass and took it towards midfield. Diamont then led a drive that resulted in another Redding touchdown run to give IU a 17-13 lead.\nAfter forcing Ohio State to 4th and inches at the Buckeye 35-yard line, Elliot broke a 65-yard run up the middle to regain the lead again. 20-17 Buckeyes.\nThe IU offense continued to struggle after that, and Ohio State scored another touchdown on a four-play drive to go up by two scores.\nSophomore cornerback Rashard Fant forced an Ohio State fumble near midfield. IU drove to the Ohio State 17 and scored on a 34-yard field goal from Griffin Oakes to get within seven points.\nElliot broke another big run, this one 75-yards, for his third touchdown. The first play of the next drive, Diamont broke a 79-yard run to bring the game within seven again.\nIU launched one final drive to IU 6-yard line. A false start penalty moved the Hoosiers back to the 10. After several tries, Diamont was unable to score and IU lost.\nBrody Miller", "external_links": [], "published": "2015-10-04T03:34:00.000+03:00", "crawled": "2015-10-05T04:39:57.699+03:00", "highlightTitle": ""}