{"organizations": ["Purdue"], "uuid": "d2bacfd7f0963d31ecd912d3e27ec6481bcb329c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.indystar.com", "main_image": "http://www.gannett-cdn.com/-mm-/92755f419c9a043ae8339608c556fabfade9659f/c=0-0-533-301&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/22/Indianapolis/Indianapolis/635811289591520434-vinceedwards.jpg", "site_section": "http://rssfeeds.indystar.com/indystar/allsports", "section_title": "Indystar - All Sports", "url": "http://www.indystar.com/story/sports/college/2015/10/22/muhammad-ali-shows-support-u-l-amid-scandal/74440588/", "country": "US", "title": "Purdue's Edwards working on quick shot", "performance_score": 0, "site": "indystar.com", "participants_count": 0, "title_full": "Purdue's Edwards working on quick shot", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T03:19:00.000+03:00", "replies_count": 0, "uuid": "d2bacfd7f0963d31ecd912d3e27ec6481bcb329c"}, "author": "", "url": "http://www.indystar.com/story/sports/college/2015/10/22/muhammad-ali-shows-support-u-l-amid-scandal/74440588/", "ord_in_thread": 0, "title": "Purdue's Edwards working on quick shot", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Vince Edwards", "Nathan Baird", "John Terhune", "Edwards"], "text": "Purdue's Edwards working on quick shot Nathan Baird , nbaird@jconline.com 8:19 p.m. EDT October 22, 2015 Purdue sophomore forward Vince Edwards (Photo: John Terhune / Journal & Courier) \nWEST LAFAYETTE — Purdue sophomore forward Vince Edwards shot 41.2 percent from 3-point range in nonconference play last season before slumping to 26.2 percent in Big Ten Conference play. \nIn addition to his offseason improvements in athleticism and agility, Edwards has also worked on tweaking his shooting form. Edwards said he's more conscious about now lowering the ball after receiving passes, and his confidence in shooting off the dribble is growing. \n\"This year I'm working on catching in the pocket and going straight up,\" said Edwards, who made 1-of-4 from 3-point range in last Saturday's scrimmage. \"I didn’t shoot well in the scrimmage, but I felt better. I felt more fluid and I feel like it’s getting there. I've been doing good so far this week as far as making those shots and practicing that repetition.\" \nEdwards said he didn't work on things like the pull-up as a freshman. As he became more comfortable and settled, he began working on developing a broader range of skills. Purdue coach Matt Painter said last week that Edwards has \"morphed\" into more of a guard this offseason. Purdue's Vince Edwards expects to benefit from USA camp \nFellow sophomore Dakota Mathias, who knows a thing or two about perimeter shooting, said Edwards' shot is quicker and more consistent. But he's also just the latest to say Edwards has improved across the board. \n\"At the end of the day, he’s going to have 16 (points), eight (rebounds) and six (assists),\" Mathias said. \"Guys like that are indispensable.\" \nFlick of the wrist \nSophomore center Isaac Haas said he sprained a ligament in his right wrist during an open gym 2½ weeks ago. He said it's more of a nuisance than an actual problem, though it has affected his free throw shooting. \nHaas said he was putting up 200-300 free throws a day in the summer before the injury. He shot 54.7 percent at the stripe as a freshman. \n\"I’ve definitely worked more on my form and what I like to do,\" Haas said. \"I think it will be easier this year when I get over this.\" Purdue's Matt Painter points to seniors at Tip-Off Banquet \nHealing up \nMathias declined to talk about his own recent issues with migraines, except to say he's feeling better now. \n\"There's really no excuses,\" Mathias said. \"It’s Big Ten basketball — there's no reason to cry about it and mope about it and tell people about it. We’re out here to win games.\" \nHe took a similarly stoic stance while fighting through various maladies last season. Today he opened up a bit more about exactly where it affected him. \n\"In our offense, running off screens, I’m a safety,\" said Mathias, who averaged 4.8 points and started down the stretch and into the postseason. \"I've got to get back on defense as the first one back. That’s a lot of running, a lot of conditioning. I felt like I couldn't do that to my potential like I wanted to because I wasn’t able to practice and do all those things. I do think it affected me more than people saw.\" Purdue basketball team expects to rule defensively \nFan Day \nPurdue's Fan Day activities begin with an autograph session at 11 a.m. Saturday. An open practice, including scrimmage sessions, begins at approximately 12:30 p.m. Fans will also be able to purchase discounted tickets to the Jan. 7 men's game vs. Michigan for $10 and the Jan.10 women's game versus Indiana for $5. \nThe event is open to the public and admission is free. 1 CONNECT 2 TWEET LINKEDIN COMMENT EMAIL MORE Read or Share this story: http://indy.st/1LPDUZV TOP VIDEOS", "external_links": [], "published": "2015-10-23T03:19:00.000+03:00", "crawled": "2015-10-23T07:07:37.664+03:00", "highlightTitle": ""}