{"organizations": ["Sunderland"], "uuid": "656ff67a568787e3ad9fc6b578f962e67c8d7069", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sport.co.uk", "main_image": "http://images.sport.co.uk/150x150/5a2d863f7f6a3fcaf93e2858dbd5d0d8.jpg", "site_section": "http://feeds.feedburner.com/SportcoukNewsRssFeed", "section_title": "General Sports News from Sports.co.uk", "url": "http://www.sport.co.uk/football/sam-allardyce-recognises-huge-challenge-ahead-for-sunderland/6943024/", "country": "JE", "title": "Sam Allardyce recognises huge challenge ahead for Sunderland to avoid drop", "performance_score": 0, "site": "sport.co.uk", "participants_count": 0, "title_full": "Sam Allardyce recognises huge challenge ahead for Sunderland to avoid drop", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T13:01:00.000+03:00", "replies_count": 0, "uuid": "656ff67a568787e3ad9fc6b578f962e67c8d7069"}, "author": "", "url": "http://www.sport.co.uk/football/sam-allardyce-recognises-huge-challenge-ahead-for-sunderland/6943024/", "ord_in_thread": 0, "title": "Sam Allardyce recognises huge challenge ahead for Sunderland to avoid drop", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Sam Allardyce"], "text": "Sam Allardyce recognises huge challenge ahead for Sunderland to avoid drop 16 Oct 2015 10:01:56 \ncomments \nSam Allardyce admits it could take three successive wins for Sunderland to start feeling like they can drag themselves out of Barclays Premier League relegation trouble. \nThe 60-year-old will send the team he inherited from Dick Advocaat out for the first time at West Brom on Saturday, when even a victory would only be the start for a team five points adrift of safety and without a win in their opening eight league games. \nAllardyce said: \"Every game is enormous for us. We will have to be consistent, we will have to be resilient, we will have to be mentally tough in terms of believing in ourselves to try to get ourselves out of this position because in all honesty, winning three games on the trot is going to be very difficult for us. \n\"But it would be three games winning on the trot before we would even consider ourselves being able to start to feel a little bit safe. \n\"Even if we win the game at West Brom, it's a nice start, it's a good start, but we are still in that position.\" \nIt has been lost on no-one that, whatever happens this weekend, Allardyce, just like Paolo di Canio, Gus Poyet and Advocaat before him, will go head-to-head with arch-rivals Newcastle in his second game at the helm with each of his immediate predecessors having sampled derby victory after losing their opening fixture. \nBut Allardyce said: \"Looking forward to the Newcastle derby will be a lot easier, a lot better for me, if the lads can go out and get a result at West Brom.\" \nThe former West Ham boss has made little secret of his immediate intention to shore up a defence which has conceded 18 goals in its first eight league games, including two against the Hammers last time out as they surrendered a 2-0 lead to draw. \nAllardyce will be without suspended duo Sebastian Coates and Jeremain Lens for the clash with the Baggies, but a man who both played and coach on Wearside earlier in his career is relishing his first game. \nAsked how he would feel when he heads for the dug-out, Allardyce replied: \"Very proud. For whatever has happened here, there have been 40,000 fans turning up at home - I think it's the seventh-highest attendance in the league and in all fairness, they haven't had too much to cheer about. \n\"But they keep wanting to turn up and they keep wanting to support the team, and obviously I have got to try to make sure they go home happy from now on, make sure they come and look forward to the next game because they have seen us win.\" Related Sport News", "external_links": [], "published": "2015-10-16T13:01:00.000+03:00", "crawled": "2015-10-16T20:11:49.531+03:00", "highlightTitle": ""}