{"organizations": [], "uuid": "97751d50c6b534432e6bfb2e40603d32e51d3168", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.deseretnews.com", "main_image": "http://img.deseretnews.com/images/article/hires/1614087/1614087.jpg", "site_section": "http://www.deseretnews.com/sports/index.rss", "section_title": "Sports news and headlines for the Utah Jazz, BYU Cougars, Utah Utes and high schools, Salt Lake City sports, Utah sports - Deseret News", "url": "http://www.deseretnews.com/article/865639533/Utah-Jazz-Struggles-on-both-ends-of-court-doom-Jazz-to-preseason-defeat-vs-Thunder.html", "country": "US", "title": "Utah Jazz: Struggles on both ends of court doom Jazz to preseason defeat vs. Thunder", "performance_score": 0, "site": "deseretnews.com", "participants_count": 1, "title_full": "Utah Jazz: Struggles on both ends of court doom Jazz to preseason defeat vs. Thunder | Deseret News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "97751d50c6b534432e6bfb2e40603d32e51d3168"}, "author": "Randy Hollis", "url": "http://www.deseretnews.com/article/865639533/Utah-Jazz-Struggles-on-both-ends-of-court-doom-Jazz-to-preseason-defeat-vs-Thunder.html", "ord_in_thread": 0, "title": "Utah Jazz: Struggles on both ends of court doom Jazz to preseason defeat vs. Thunder", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Jazz got a grim reality check in Tuesday night's preseason game against Oklahoma City, as Kevin Durant scored 12 of his game-high 29 points in the fourth quarter. Afterward, Utah coach Quin Snyder sized up his squad honestly and realistically.\nMore Coverage OKC teammate calls Enes Kanter's spat with Utah 'silly' “ Yeah, look, the thing about our team is weve got some good players. And weve got an opportunity to be a good team. Its not like anybody or our team has done anything. Weve played well at times. Our individual players have played well at times.”\nJazz coach Quin Snyder\nSALT LAKE CITY — Like it or not — and most Utah Jazz fans definitely will not — their favorite NBA franchise got a great, grim reality check Tuesday night.\nSure, the Jazz finished last season with a flourish, winning 19 of their last 29 games. And with that entire Utah squad pretty much returning intact for the NBA's 2015-16 campaign, hopes have been running mighty high that this team is ready to turn the corner.\nA return to the NBA playoffs certainly seems like a distinct possibility, and some folks even figure the youthful Jazz are on the verge of doing something special not too far down the road.\nBut following Tuesday night's 113-102 preseason loss to the Oklahoma City Thunder at EnergySolutions Arena, second-year Utah head coach Quin Snyder looked the assembled media squarely in the eye and called it like he sees it.\nAnd what he sees is this: a whole lot of improvement is still necessary before his ballclub can compete with teams like the Thunder and consider themselves a contender for anything other than the grind of an 82-game regular season, which begins one week from tonight.\n“Yeah, look, the thing about our team is we’ve got some good players,\" he said. \"And we’ve got an opportunity to be a good team. It’s not like anybody or our team has done anything. We’ve played well at times. Our individual players have played well at times.\n“But you’re looking at Kevin Durant and Russell Westbrook and guys that have a level that no one, we haven’t touched that. So for us, it’s, hey, look at what that is and what those guys are doing and how hard they practice. You see them before the game? How hard they went? Those are hungry guys that are All-Stars.\n“And if we want to get to that place individually, collectively, that’s what you have to do. You have to say, ‘Look, that’s it.’ And I think (the Thunder) appreciate the opportunity they have. Kevin Durant was hurt for a year. They lost in the NBA Finals. They know that level and they looked unbelievably hungry. They just came out and they came at it,\" Snyder said.\nIndeed, Durant, the former league MVP who missed 55 games last season with a frustrating assortment of foot and ankle injuries, scored 12 of his game-high 29 points in the fourth quarter. He also had eight rebounds and, after drilling back-to-back 3-pointers down the stretch, he yelled \"I'm back! I'm back!\"\nWestbrook, last year's league scoring champion, had a nifty triple-double — 21 points, 10 assists and 10 rebounds — while Serge Ibaka contributed 16 points, Steven Adams added 14 points and 10 rebounds, and Dion Waiters also scored 14 as OKC improved to 5-1 in the preseason. They didn't seem to miss former Jazz big man Enes Kanter, who signed a rich offseason contract but sat this one out due to fatigue.\n“To me, that’s a team that has an appreciation for how difficult it is to win in this league,\" Snyder said. \"They know that you have to do everything, and sometimes that’s still not enough on a given night unless you get a little lucky. We don’t understand that. Why would we? We haven’t been in that situation.\n“So to play a team that’s on that level to me is that’s what you have to do to get there, you have to experience it. You can talk about it all you want until Kevin Durant comes down from 3 feet behind the (3-point) line and you go under on a pick-and-roll and he drills a 3 and you say, ‘No, that’s what he does. That’s what he does.’ That’s a credit to them.", "external_links": ["http://deseretnews.sportsdirectinc.com/basketball/nba-teams.aspx?page=/data/nba/teams/team404316.html", "http://deseretnews.sportsdirectinc.com/basketball/nba-players.aspx?page=/data/nba/players/player739855.html", "http://deseretnews.sportsdirectinc.com/basketball/nba-players.aspx?page=/data/nba/players/player732680.html", "http://deseretnews.sportsdirectinc.com/basketball/nba-players.aspx?page=/data/nba/players/player733294.html"], "published": "2015-10-21T03:00:00.000+03:00", "crawled": "2015-10-21T10:33:43.269+03:00", "highlightTitle": ""}