{"organizations": [], "uuid": "6fe1a57eb52eb8d25a496ede3955574176fe690e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sport.co.uk", "main_image": "http://images.sport.co.uk/150x150/adcfd4c0351b86cc2e0e726cc4034778.jpg", "site_section": "http://feeds.feedburner.com/SportcoukNewsRssFeed", "section_title": "General Sports News from Sports.co.uk", "url": "http://www.sport.co.uk/rugby/japan-boss-jones-wants-to-finish-with-a-flourish-and-see-off/6920368/", "country": "JE", "title": "Japan boss Jones wants to finish with a flourish and see off United States", "performance_score": 0, "site": "sport.co.uk", "participants_count": 0, "title_full": "Japan boss Jones wants to finish with a flourish and see off United States", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T21:16:00.000+03:00", "replies_count": 0, "uuid": "6fe1a57eb52eb8d25a496ede3955574176fe690e"}, "author": "", "url": "http://www.sport.co.uk/rugby/japan-boss-jones-wants-to-finish-with-a-flourish-and-see-off/6920368/", "ord_in_thread": 0, "title": "Japan boss Jones wants to finish with a flourish and see off United States", "locations": ["United States", "United States Japan", "Japan"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jones"], "text": "Japan boss Jones wants to finish with a flourish and see off United States 10 Oct 2015 18:16:57 \ncomments \nJapan head coach Eddie Jones has told his Brave Blossoms they can still be remembered as the nation's greatest ever team despite seeing their dreams of reaching the World Cup quarter-finals end. \nJones' side lit up the competition when they stunned South Africa three weeks ago in their Pool B opener. \nBut Scotland's victory over Samoa in Newcastle means the Japanese will have to settle for third place even if they beat the United States in Gloucester on Sunday. \nHowever, Jones insists his players should be proud of their efforts at England 2015 and urged them to go out on a high by seeing off the Americans. \nHaving gone 21 years without a victory at World Cup finals, they can now end this year's tournament with three wins. \nJones - who will step down after the match to take over at the Cape Town Stormers - said: \"The USA have one chance to redeem themselves in the World Cup and we have one chance to be remembered as the greatest ever Japan team. \n\"The motivation is important in the last game as players are physically tired and there are lots of players with little injuries. \n\"It doesn't matter how we win. We're anticipating a tough game against the USA. They've got to play for pride tomorrow. \n\"Whatever we're going to do tomorrow, we will win the game. As long as we win our scrums and play our running game it doesn't matter. \n\"It is our last game of the tournament too so it will be about pride, and the USA will be no different. \n\"The Scotland-Samoa game doesn't affect us. We have to beat the USA, who play really good rugby. Obviously it would have been nice to play in a quarter-final, but it doesn't affect how we prepare for this game.\" \nHooker Craig Wing also urged his team-mates to maintain the standards set over the past month. \nHe said: \"We're good to go and we're really looking forward to the game tomorrow. As I said to the players, they've set a really high standard of rugby over this tournament and I'm really looking forward to getting in there and maintaining that standard. \n\"In the same way as everyone else I think we have done really well, but for me I see how since we left Japan the squad has become closer. We seem to be functioning on the field and things have been clicking. \n\"I think the win against South Africa added a lot of belief and confidence in the fact that everything we trained for was the right path. When you get a team that believe 100 per cent in what they're doing it's a massive boost.\" \nUnited States defence coach Phil Bailey knows few will back his side for a win at Kingsholm after three straight losses but he retains belief in his side. \nHe said: \"I like to think we are the favourites, but Japan have won two games already including South Africa. The punters will be saying Japan are the favourites, but every underdog has their day.\" Related Sport News", "external_links": [], "published": "2015-10-10T21:16:00.000+03:00", "crawled": "2015-10-11T19:59:20.508+03:00", "highlightTitle": ""}