{"organizations": [], "uuid": "23e2286e69bd9ae96816b820c106b560e05a10b3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.contracostatimes.com", "main_image": "http://extras.mnginteractive.com/live/media/site568/2015/1015/20151015_115912_SJM-STANFBC-1016-028.jpg", "site_section": "http://feeds.contracostatimes.com/mngi/rss/CustomRssServlet/571/200899.xml", "section_title": "Stanford Sports", "url": "http://www.contracostatimes.com/sports/ci_28977911/watch-stanfords-owusu-makes-most-incredible-catch-youll?source=rss", "country": "IL", "title": "Watch: Stanford's Owusu makes most incredible catch you'll see this year", "performance_score": 0, "site": "contracostatimes.com", "participants_count": 1, "title_full": "Watch: Stanford's Owusu makes most incredible catch you'll see this year", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T20:15:00.000+03:00", "replies_count": 0, "uuid": "23e2286e69bd9ae96816b820c106b560e05a10b3"}, "author": "Jon Wilner\nMercury News", "url": "http://www.contracostatimes.com/sports/ci_28977911/watch-stanfords-owusu-makes-most-incredible-catch-youll?source=rss", "ord_in_thread": 0, "title": "Watch: Stanford's Owusu makes most incredible catch you'll see this year", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Watch: Stanford's Owusu makes most incredible catch you'll see this year By Jon Wilner Posted: 10/16/2015 09:39:37 AM PDT Updated: 10/16/2015 10:15:48 AM PDT College Hotline blog \nSTANFORD -- Francis Owusu kept telling himself to squeeze - \"I was squeezing for my life\" - for those interminable nano-seconds as he tumbled to the turf and hauled in one of the greatest catches in Stanford football history. \nOwusu's improbable touchdown grab remained as mind-boggling Friday as it was in real time, in the third quarter of Stanford's 56-35 victory over UCLA the night before. \n\"I didn't believe what I saw,'' said tailback Christian McCaffrey, whose masterful performance (243 yards rushing, a school record) had to share the spotlight with Owusu. \n\"I hope that's on ESPN for the next month.\" \nThe catch, which took place in the dead of night in the Eastern time zone, already had more than 10,000 views on YouTube by Friday morning. Stanford Cardinal's Francis Owusu (6) makes a 41 touchdown catch against UCLA Bruins' Jaleel Wadood (2) in the third quarter at Stanford Stadium in Stanford, Calif, on Thursday, Oct. 15, 2015. (Nhat V. Meyer/Bay Area News Group) (Nhat V. Meyer) \nIt came on a 41-yard flea-flicker from quarterback Kevin Hogan, with Stanford headed to its fifth consecutive win. \nThe pass was slightly underthrown and about to hit UCLA safety Jaleel Wadood in the back as he collided, chest-to-chest, with Owusu. But Owusu reached around Wadood's back with both arms, as if giving him a hug, and somehow snared the ball as they tumbled to the grass. \n\"I couldn't believe he caught it,'' McCaffrey said. \"I sprinted off the field and sat down, because I didn't know how to react. That was one of the most amazing things I've ever seen in my life.'' \nHe wasn't the only Cardinal in disbelief. \n\"I can't describe that catch,'' coach David Shaw said. \"I don't understand what happened, to be honest. Advertisement I was looking at my call sheet for the next call because I thought it was incomplete.\"\nBombarded with questions about the catch, Owusu repeated: \"Just squeeze the ball.\" \nIf Owusu's grab isn't the greatest in school history, it stands alongside Kodi Whitfield's one-handed, arm extended touchdown grab in 2013. The opponent that day: UCLA.", "external_links": [], "published": "2015-10-16T20:15:00.000+03:00", "crawled": "2015-10-16T22:43:51.444+03:00", "highlightTitle": ""}