{"organizations": [], "uuid": "a5951c86398d77fa39a26fc9a528d34d0f734d63", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "wtop.com", "main_image": "http://wtop.com/wp-content/uploads/2015/10/Mavericks-Bulls-Basketball2.jpeg", "site_section": "http://wtop.com/section/sports/feed/", "section_title": "WTOP » Sections » Sports", "url": "http://wtop.com/nba/2015/10/chicago-bulls-open-hoiberg-era-with-derrick-rose-in-lineup/", "country": "US", "title": "Chicago Bulls open Hoiberg era with Derrick Rose in lineup", "performance_score": 0, "site": "wtop.com", "participants_count": 1, "title_full": "Chicago Bulls open Hoiberg era with Derrick Rose in lineup", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T23:47:00.000+02:00", "replies_count": 0, "uuid": "a5951c86398d77fa39a26fc9a528d34d0f734d63"}, "author": "wtopstaff", "url": "http://wtop.com/nba/2015/10/chicago-bulls-open-hoiberg-era-with-derrick-rose-in-lineup/", "ord_in_thread": 0, "title": "Chicago Bulls open Hoiberg era with Derrick Rose in lineup", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Home » News » Sports » NBA » Chicago Bulls open Hoiberg… Chicago Bulls open Hoiberg era with Derrick Rose in lineup By ANDREW SELIGMAN October 26, 2015 5:47 pm Chicago Bulls coach Fred Hoiberg calls instructions during the second half of an NBA preseason basketball game against the Dallas Mavericks in Lincoln, Neb., Friday, Oct. 23, 2015. (AP Photo/Nati Harnik) \nCHICAGO (AP) — When he took the Chicago Bulls’ coaching job last June, Fred Hoiberg saw a chance to compete for a championship. \nNow, it’s time to see if that vision becomes a reality. \nThe Bulls begin a new era under Hoiberg with Rose in the lineup when they host LeBron James and the Cleveland Cavaliers in Tuesday’s opener. \nGone is hard-driving, defensive-oriented coach Tom Thibodeau. In his place is the freewheeling Hoiberg, with a fast-paced offense and an approach that management hopes will preserve the team for the stretch run. \n“I feel very fortunate to be in this position, to come to a team that we feel can be very competitive,” said Hoiberg, who came to Chicago after a five-year run at Iowa State that produced four straight NCAA appearances and back-to-back Big 12 tournament titles. “If we do everything right, we’ll be competing at the highest level.” \nWith stars such as Derrick Rose, Jimmy Butler and Pau Gasol, he sees himself succeeding where other coaches who have made the leap from colleges to the NBA did not. \nThe Bulls made the playoffs all five years under Thibodeau and might have even won a championship had Rose been able to stay healthy. That story has been told and retold, and it is only fitting that as Hoiberg prepares for his NBA coaching debut, Rose is working his way back from yet another operation. \nThis one was to repair a fractured left orbital he suffered on the first day of practice, an injury that was not as serious as the torn ACL in his left knee or the torn meniscus in his right knee that derailed the Bulls in recent seasons. \nThe good news for the Bulls is that Hoiberg said the former MVP point guard will start without any minute restrictions against Cleveland. That was news to Rose, who had not been told. \nEither way, Hoiberg said the Bulls will still be careful with his playing time given that he missed almost the entire preseason. \nRose insists he is ready, even with only one good eye. \n“I was playing with one eye, and you can’t tell that I was playing with one eye,” he said. “In any profession, that’s just like you all with having just one arm or one hand, something like that, and typing. If you’re able to do it, you’re able to do it. If not, you’ve got to sit down.” \nRose, who has been wearing a protective mask, showed that familiar explosiveness during a brief appearance in his lone exhibition against Dallas in Lincoln, Nebraska, on Friday. But he still has some blurred — and double — vision to go with swelling beneath his left eye. \nThe Bulls obviously need a healthy and effective Rose if they are going to supplant James for supremacy in the Eastern Conference after years of coming up short. King James has knocked Chicago out of the playoffs four times the past six seasons, whether he was with Miami or Cleveland, including a lackluster loss in Game 6 of the conference semifinals last year. \nManagement believed part of the problem was Thibodeau wearing down the team. That along with a falling out with the front office led to a coaching switch that many saw coming as last season unfolded. \nHoiberg said Chicago’s depth will allow him to keep players in the 25-minute range. \n“We’ve got as many guys as we do who can play,” he said. “There’s got to be sacrifice. Hopefully, it’s going to keep us fresh as the season goes on, having as many bodies as we do to be able to go out there. It’ll be good for our guys.” \nBut will a lighter load translate to a deeper run? Will it lift the Bulls to heights they did not reach under Thibodeau? \nTeam executives didn’t make many roster changes and they are putting their trust in someone who starred at Iowa State and played for the Bulls during his NBA career. He also worked in Minnesota’s front office and got the itch to try coaching during that time. “The Mayor” then returned to Ames, leading the Cyclones to a 115-56 record. \nHe has a long history with Bulls executives John Paxson and Gar Forman, an assistant under Tim Floyd at Iowa State when Hoiberg played there. \n“It’s been a fun group to be around,” he said. “I think we’ve made strides since we opened up our training camp.” \nNotes: Hoiberg said Nikola Mirotic will start up front, meaning Joakim Noah is expected to come off the bench. Topics:", "external_links": [], "published": "2015-10-26T23:47:00.000+02:00", "crawled": "2015-10-26T23:49:29.037+02:00", "highlightTitle": ""}