{"organizations": [], "uuid": "f1619848f542a87f5ea796afef0544f61c830e18", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.oregonlive.com", "main_image": "http://imgick.oregonlive.com/home/olive-media/width620/img/opinion_impact/photo/2015/10/16/shirtjpg-ec0c0dcad423ffb1.jpg", "site_section": "http://www.oregonlive.com/", "section_title": "Oregon Local News, Breaking News, Sports &amp; Weather - OregonLive.com", "url": "http://www.oregonlive.com/opinion/index.ssf/2015/10/a_toast_for_widmer_tempest_ove.html", "country": "US", "title": "A toast for Widmer; tempest over a T-shirt in Gresham: Editorial Peaks and Valleys", "performance_score": 0, "site": "oregonlive.com", "participants_count": 2, "title_full": "A toast for Widmer; tempest over a T-shirt in Gresham: Editorial Peaks and Valleys | OregonLive.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T21:00:00.000+03:00", "replies_count": 1, "uuid": "f1619848f542a87f5ea796afef0544f61c830e18"}, "author": "The Oregonian Editorial Board", "url": "http://www.oregonlive.com/opinion/index.ssf/2015/10/a_toast_for_widmer_tempest_ove.html", "ord_in_thread": 0, "title": "A toast for Widmer; tempest over a T-shirt in Gresham: Editorial Peaks and Valleys", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Peaks\nProst for a pioneer: In today's craft beer scene, where specialty festivals occur every week and connoisseurs debate the merits of different hop varietals, it seems strange to think back to a time when some of the only homegrown options were those made by the Widmer brothers.\nBut in 1984, when Kurt Widmer and Rob Widmer started their brewery, they didn't have a lot of company beyond Dick and Nancy Ponzi of Bridgeport Brewing. Instead, the brothers, along with the Ponzis and the founders of Portland Brewing a couple years later, laid down the foundation of a new industry that has become as tightly woven into Oregon's identity as rain.\nOregonian editorials Editorials reflect the collective opinion of The Oregonian editorial board, which operates independently of the newsroom. Members of the editorial board are Mark Hester, Helen Jung, Erik Lukens, Steve Moss and Len Reed. To respond to this editorial:\nPost your comment below, submit a commentary piece ,\nor write a letter to the editor . If you have questions about\nthe opinion section, contact Erik Lukens, editorial and commentary editor,\nat elukens@oregonian.com\nor 503-221-8142. Now, 31 years later, Kurt Widmer will be stepping down as chairman of the board of his company, now known as Craft Brew Alliance, at the end of the year. Portland, the state, and even those who turn their noses up at Widmer's flagship hefeweizen beer should raise a toast to the man who helped make the craft beer industry happen.\nKurt, the older of the two brothers, helmed the business and plotted its strategy as it grew exponentially. Rob Widmer was the quality czar who made sure the trains ran on time. But even as they focused on building their company, they fostered the growth of the craft-brewing industry in Oregon. The company helped launch the first Oregon Brewers Festival in 1988, and, a decade later, an annual home-brewing competition with the Oregon Brew Crew. Local breweries have tapped the Widmers' expertise and its lab for analysis to test and improve their own products.\nThe Widmers sold almost a third of their business to Anheuser Busch in 1997, a move that has unfortunately earned them sneers by those who don't know better and excommunication by the Brewers Association, which stopped viewing their beer as \"craft.\"\nBut the move helped build Widmer into a national brand without the brothers sacrificing control. The hefeweizen that beer snobs shun has helped introduce people across the country to craft beer. And the company, which has since acquired RedHook Ale Brewery and Kona Brewing Co., finished 2014 with sales of more than $200 million, the first time in its history to break that barrier. Not a bad accomplishment for a couple Portland boys who just liked to make good beer.\nDemolition tax benched: First, Portland Mayor Charlie Hales wanted to slap a humongous tax - $25,000-plus – on home demolitions. The proposal clearly was aimed at the concerns of homeowners in areas, like Eastmoreland, where infill projects have disturbed neighborhood aesthetics.\nNext, the mayor proposed a mechanism allowing punitively taxed demolition-doers to recover money by providing affordable housing or replacing razed structures with multiple units. A measure aimed at aesthetics was thus recast as a way to preserve affordable housing.\nThen, following a comprehensive evisceration of the Hales Home Tax at Wednesday's City Council meeting, the mayor proclaimed himself \"happy we are where we are,\" The Oregonian/OregonLive's Brad Schmidt reported . \"Where we are\" is, to be exact, nowhere. The tax proposal was towed back to the policy garage, where, if Portlanders are lucky, it will gather dust. Hooray.\nIt's easy to relate to the frustration of homeowners who don't like what their neighbors do with their property – even if it's perfectly legal. But expensive land has a way of demanding commensurate housing, and Oregon's land use laws tend to increase land value by constraining the supply. They also, by design, encourage infill development and greater density.\nThere is value in discussing the effects of the state's land-use system, especially in places, like Portland, that are experiencing a surge in demand for housing. But trotting out a huge and half-baked tax as a way to address the problem is not productive.\nValleys\nCommon sense deficit: The subject of firearms is a sensitive one these days, particularly in schools. Even so, the treatment an eighth-grade student in Gresham's Dexter McCarty Middle School almost beggars belief. Alan Holmes wore a T-shirt to school last week that featured an image of a rifle. No, Holmes wasn't wearing promotional NRA gear . On his shirt, rather, was an arrangement of helmet, boots and rifle widely used to indicate respect for fallen soldiers. Lest anyone mistake the arrangement for anything but a memorial, the shirt also read, \"Standing for those who stood for us.\"\nHolmes was told that his shirt violated the school's dress code, The Oregonian/OregonLive's Laura Frazier wrote . His choices: Change it or go home. He went home, and the district has since promised to review its dress code . We'll see where that goes.\nThe code, as Frazier reported, prohibits clothing with, among other things, \"violence related references.\" To cram Holmes' shirt within this definition is a stretch, to say the least. But if a memorial arrangement that contains a rifle is too disturbing a thing for Gresham's eighth-graders to witness, district officials might want to reconsider Gresham High School's fight song too. It begins as follows: \"March, march on down the field/Fighting for Gresham High/We'll back the blue and white/With the spirit of do or die.\"\nMarch, fight, do or die. That's awfully martial, and talk about \"violence related references.\"\nOregon employment: The Oregon Employment Department reported Monday that the state lost jobs in September, ending a 36-month streak of gains . The unemployment rate inched up from 6.1 to 6.2 percent.\nNo one should read too much into a single month's employment statistics, but the September jobs report, at the least, represents a caution flag. The 5,300 lost jobs were spread across almost all lines of commerce – every business sector except for health care and government. The fourth quarter is the most important time of the year for many businesses, and a hiring slowdown heading into the holiday season is hardly encouraging.\nEconomists generally expect the economic recovery to continue for at least another couple years, barring some type of global crisis. But they concede that the pace is slowing. That's significant since economic growth during this recovery has lagged historical standards – exceeding 4 percent based on gross domestic product in only three quarters.", "external_links": ["http://ghs.gresham.k12.or.us/modules/cms/pages.phtml?pageid=213505&&sessionid=771b8d4cdd94c1069869de753ae9769b", "http://www.kgw.com/story/news/local/2015/10/09/t-shirt-with-image-of-gun-causes-school-controversy/73693492/", "https://www.qualityinfo.org/documents/10182/73818/Employment+in+Oregon/98820442-80ef-4a56-b0ba-70fccfea9228", "http://www.cabelas.com/product/NRA-MENS-RIGHTS-DONT-CHANGE-S-S-TEE/2053981.uts?productVariantId=4151396&srccode=cii_17588969&cpncode=42-88153444-2&WT.tsrc=CSE&WT.mc_id=GoogleProductAds&WT.z_mc_id1=04149792&rid=20", "http://www.statista.com/statistics/188185/percent-chance-from-preceding-period-in-real-gdp-in-the-us/"], "published": "2015-10-16T21:00:00.000+03:00", "crawled": "2015-10-17T05:40:53.706+03:00", "highlightTitle": ""}