{"organizations": ["Chelsea", "Southampton", "Reuters"], "uuid": "7cc55c6d48842571b2ea9c33fe0752bbf634d2a7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "jakartaglobe.beritasatu.com", "main_image": "http://img.thejakartaglobe.com/2015/10/tag-reuters.com0000-binary_MT1ACI14046765-VIEWIMAGE.jpg", "site_section": "http://jakartaglobe.beritasatu.com/rss/sports/", "section_title": "Sports | Jakarta Globe", "url": "http://jakartaglobe.beritasatu.com/football/chelsea-crashes-aguero-hits-five-man-city/", "country": "ID", "title": "Chelsea Crashes Again as Aguero Hits Five for Man City", "performance_score": 0, "site": "beritasatu.com", "participants_count": 0, "title_full": "Chelsea Crashes Again as Aguero Hits Five for Man City", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T03:34:00.000+03:00", "replies_count": 0, "uuid": "7cc55c6d48842571b2ea9c33fe0752bbf634d2a7"}, "author": "", "url": "http://jakartaglobe.beritasatu.com/football/chelsea-crashes-aguero-hits-five-man-city/", "ord_in_thread": 0, "title": "Chelsea Crashes Again as Aguero Hits Five for Man City", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Paul Childs", "Mike Collett", "Cedric Soares", "Cesar Azpilicueta"], "text": "INDEX Chelsea Crashes Again as Aguero Hits Five for Man City i Chelsea's Cesar Azpilicueta, right, in action with Southampton's Cedric Soares during their Barclay's Action Images via Reuters / Paul Childs By : Mike Collett | on 2:34 PM October 04, 2015 Category : Sports , Football \nLondon. Chelsea's early season slump turned into a full-blown crisis on Saturday when they were beaten 3-1 by Southampton while Manchester City went top of the Premier League with Sergio Aguero scoring five in a 6-1 win over Newcastle United. \nSouthampton's win at Stamford Bridge meant Chelsea have made their worst start to a season for 37 years and ended the day in 16th place on eight points, 10 behind City who will be top at least until Manchester United play Arsenal on Sunday. \nCity ended their own mini-slump in style, after two successive league defeats, but Chelsea's dire run continued even though they took an early lead with Willian scoring with a 10th minute free-kick. \nSouthampton hit back with goals from Steven Davis just before halftime, Sadio Mane after 60 minutes and a third from Graziano Pelle 12 minutes later. \nThe defeat prompted an extraordinary response from Chelsea manager Jose Mourinho, who spoke for seven minutes without pause in response to one question from a Sky Sports reporter after the game. \nMourinho insisted Chelsea should have had a penalty before Southampton scored their second goal, and said he was not running away from his responsibilities. \n\"I can imagine what people are thinking about what is going to happen or not going to happen,\" he said. \n\"Let me be clear: One, I do not run away. Two, if the club want to sack me they have to sack me because I am not running away from my responsibility or my team and from my conviction. \n\"Third, even more important than the first and the second, I think this is a crucial moment in the history of this club because if the club sacks me they sack the best manager that this club has had and the message is... that if there are bad results the manager is guilty.\" \nMourinho strongly criticized referee Robert Madley for not awarding Chelsea a penalty when Radamel Falcao appeared to be brought down by Saints goalkeeper Martin Stekelenburg after 53 minutes. \n\"The referees are afraid to give decisions for Chelsea,\" he said, a theme he continued for several more minutes. \nSaints manager Ronald Koeman said the second half made all the difference after a difficult start: \"We were more aggressive than Chelsea and in my opinion we totally deserved the three points today,\" he told Sky. \n\nAguero five \nWhile Chelsea lost an early lead, the side tipped at the start of the season to be their main title challengers came back from an early Newcastle goal to win convincingly. \nAguero scored five times in 20 minutes, including an eight-minute hat-trick, after City appeared to be in danger of a third straight league defeat when Aleksandar Mitrovic headed Newcastle ahead in the 18th minute at the Etihad Stadium. \nThe visitors, without a win so far, looked the better team for much of the first half but imploded as Aguero burst into life with goals after 42, 49, 50, 60 and 62 minutes. \nWith Kevin De Bruyne also on target, five of City's six goals came in a dazzling 13-minute spell. \nAguero became only the fifth player in the Premier League era to score five in a game following Andy Cole, Alan Shearer, Jermain Defoe and Dimitar Berbatov. \nBut he was denied the chance to become the first to score six when coach Manuel Pellegrini substituted him two minutes after his fifth goal. \nIn the other games, Crystal Palace beat West Bromwich Albion 2-0 to go third, Stoke City beat Aston Villa 1-0, Leicester City won 2-1 at Norwich City and Sunderland drew 2-2 with West Ham United. \nReuters", "external_links": [], "published": "2015-10-04T03:34:00.000+03:00", "crawled": "2015-10-04T17:32:51.105+03:00", "highlightTitle": ""}