{"organizations": [], "uuid": "70bd16f75f85ef40f0e7aa0ad5577c375e36cc07", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "http://images.tribuneindia.com/cms/gall_content/2015/10/2015_10$largeimg05_Monday_2015_013354213.jpg", "site_section": "http://www.tribuneindia.com/", "section_title": "The Tribune, Chandigarh, India : Latest news, India, Punjab, Chandigarh, Haryana, Himachal, Uttarakhand, J&amp;K, sports, cricket ", "url": "http://www.tribuneindia.com/news/sport/india-will-come-back-all-guns-blazing-rohit/141830.html", "country": "US", "title": "India will come back all guns blazing: Rohit", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "India will come back all guns blazing: Rohit", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "70bd16f75f85ef40f0e7aa0ad5577c375e36cc07"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/sport/india-will-come-back-all-guns-blazing-rohit/141830.html", "ord_in_thread": 0, "title": "India will come back all guns blazing: Rohit", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Cuttack, October 4\nOpener Rohit Sharma said they would come back with all guns blazing to stay alive in the three-match T20 series against South Africa tomorrow. The Faf du Plessis-led side beat India by seven wickets in Dharamsala to lead the series 1-0. “It was a good knock, but we lost the game,” said Rohit, talking about his fine hundred in the first match. “I am pretty disappointed, it was unfortunate. No matter how much you scored, if you don’t win, your efforts are not counted. I’m sure we will come back strong.” “Overall, there’s a room for improvement, I’m sure the guys have learnt from it and they will come back stronger. We have to do a lot of things right whether it’s batting or bowling, and come out all guns blazing,” he said. India opted for a three-two seam-spin combination for the first game. But barring off-spinner Ravichandran Ashwin, all the other bowlers conceded 10-plus runs an over. Rohit said India opted for a seam attack because of the grass cover on the pitchbut the dew made it tough for the pacers. “There was a little bit of grass on the wicket and we thought there would be a bit of more seam movement but the dew took it away. I know they’re not too experienced, but it’s the same with the South African attack. But when you play these kind of tournaments, you grow as a cricketer,” he said. “Bhuvneshwar has played quite a bit of late, Mohit has been a part of the team for a while now. (Sreenath) Aravind has just come in but he is a proven character in the domestic circuit. The dew made it difficult for them. Overall, there’s a room for improvement, I’m sure the guys will come back stronger.” Replying to a query whether three-spinners attack is the way forward, he said, “These guys know what exactly is expected of them. I’m sure they are trying their best to come out (of the loss), take wickets and be aggressive. Sometimes, things don’t go your way.” — PTI South Africa’s ‘Plan AB’ ahead of World T20 Keeping in mind the next year’s World Twenty20 in India, South Africa are experimenting with AB de Villiers’ batting position by giving him the role of an opener in the current series, Farhaan Behardien said. De Villiers opened the innings in the first T20I and blasted 51 in 32 balls. South African middle order batsman Behardien hoped the latest move by the team thinktank would be successful ahead of the World T20. “The first six overs in a T20 game, when the ball comes on to the bat, are crucial. AB is that good a player that if he bats for 50 to 60 balls, he will end up with a hundred,” Behardien said. “He was mentioning that he has toured India about 25 times. We wanted to test it out before the World Cup next year in March and see how he goes. Let’s hope it proves fruitful for us,” said the 32-year-old. — PTI", "external_links": [], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-05T12:20:59.144+03:00", "highlightTitle": ""}