{"organizations": [], "uuid": "4b6d995c18fa5e1dac8daa5e45fdeb032dd80beb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.si.com", "main_image": "http://cdn-jpg.si.com/sites/default/files/styles/si_gallery_slide/public/images/akrum-wadley-iowa-hawkeyes-beat-northwestern-wildcats.jpg?itok=C2MF4vi6", "site_section": "http://www.si.com/htmlsitemap/2014/02/page-1", "section_title": "The Sports Illustrated HTML Sitemap Index for February, 2014 - SI.com", "url": "http://www.si.com/college-football/2015/10/17/iowa-hawkeyes-beat-northwestern-wildcats", "country": "US", "title": "Iowa beats Northwestern, can eye Big Ten title, playoff berth - College Football", "performance_score": 0, "site": "si.com", "participants_count": 3, "title_full": "Iowa beats Northwestern, can eye Big Ten title, playoff berth - College Football - SI.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T03:00:00.000+03:00", "replies_count": 2, "uuid": "4b6d995c18fa5e1dac8daa5e45fdeb032dd80beb"}, "author": "Chris Johnson", "url": "http://www.si.com/college-football/2015/10/17/iowa-hawkeyes-beat-northwestern-wildcats", "ord_in_thread": 0, "title": "Iowa beats Northwestern, can eye Big Ten title, playoff berth - College Football", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "by Chris Johnson Twitter Email Posted: Sat Oct. 17, 2015 Iowa opened this season amid questions about whether the program had grown stale. Coach Kirk Ferentz appeared on hot seat lists, and there were plenty of jokes about his massive contract buyout.\nIt’s taken the Hawkeyes just seven weeks to turn that negative narrative completely on its head. Iowa thrashed Northwestern 40–10 on Saturday in Evanston to move to 7–0 on the season and 3–0 in the Big Ten. This marks the first time the Hawkeyes have opened 7–0 since 2009.\nIowa’s offensive line dominated up front Saturday, paving the way for 294 yards and five touchdowns on the ground even though top tailback Jordan Canzeri left early with an injury. With Canzeri sidelined, sophomore Akrum Wadley delivered 204 yards on 26 carries. Meanwhile, Iowa’s defense harassed Northwestern quarterback Clayton Thorson and limited the Wildcats to only 51 rushing yards and 2.9 yards per play.\nThis game erased any doubt over who resides atop the Big Ten West pecking order. The Hawkeyes had already notched wins over division foes Illinois and Wisconsin . On Saturday, they trounced their only other ostensible challenger in the West. That the Wildcats were obliterated at Michigan last week removes some luster from Iowa’s win, but it does not diminish its importance to the standings.\nCollege Football Video RB McCaffrey's historic night powers Stanford past UCLA, into playoff mix by Pete Thamel", "external_links": ["http://twitter.com/bychrisjohnson"], "published": "2015-10-17T03:00:00.000+03:00", "crawled": "2015-10-18T08:54:10.867+03:00", "highlightTitle": ""}