{"organizations": [], "uuid": "14ad56e9664def605caa64f763cac52d8d09e504", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wcax.com", "main_image": "", "site_section": "http://www.wcax.com/category/13571/political-news", "section_title": "Political News - WCAX.COM Local Vermont News, Weather and Sports-", "url": "http://www.wcax.com/story/30241068/us-airdrops-small-arms-ammunition-to-syrian-arab-groups", "country": "US", "title": "US airdrops small arms ammunition to Syrian Arab groups", "performance_score": 0, "site": "wcax.com", "participants_count": 1, "title_full": "US airdrops small arms ammunition to Syrian Arab groups - WCAX.COM Local Vermont News, Weather and Sports-", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "14ad56e9664def605caa64f763cac52d8d09e504"}, "author": "wcax.com", "url": "http://www.wcax.com/story/30241068/us-airdrops-small-arms-ammunition-to-syrian-arab-groups", "ord_in_thread": 0, "title": "US airdrops small arms ammunition to Syrian Arab groups", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By ROBERT BURNS\nAP National Security Writer WASHINGTON (AP) - U.S. cargo planes dropped small arms ammunition to Arab groups fighting the Islamic State group in northern Syria, a U.S. military spokesman said Monday.\nCol. Steve Warren, a spokesman in Baghdad for the U.S. military command in charge of the anti-IS campaign in Syria and Iraq, said by email that the airdrop was conducted Sunday by Air Force C-17 cargo planes. He did not identify the Arab groups that received the supplies but said their leaders had been vetted and have been fighting to remove IS from northern Syria.\nThe airdrop is in line with a revamped U.S. approach in Syria. The Obama administration announced last week that instead of trying to build a new Syrian rebel force, it will provide equipment, including ammunition, to existing Syria rebel groups who share the U.S. goal of defeating IS.\nSeparately, a local Kurdish official in the northern Syrian city of Kobani said the U.S. had provided 120 tons of weapons and ammunition to the main Kurdish militia fighting the Islamic State in that area, the People's Protection Units, or YPG. The official, Mustafa Bali, said he did not know whether the supplies had been provided by air or over land.\nThe U.S. military headquarters in charge of the coalition campaign against IS said in an email to The Associated Press that it had made no delivery of weapons or ammunition directly to the Syrian Kurds in the last week.\nSpokesmen for the YPG did not return calls to the AP.\nBali and the Britain-based Syrian Observatory for Human Rights, which relies on a network of activists across Syria, said the YPG and other factions have formed a \"Forces of Democratic Syria\" coalition whose main aim will be to fight IS.\nThe coalition includes Arab, Kurdish and Assyrian rebel factions that have been fighting IS over the past year. The Observatory and Bali said the aim of the coalition in the future will be to march toward the northern city of Raqqa which is the Islamic State's declared capital.\n___\nAssociated Press writer Bassem Mroue contributed to this report from Beirut.\n___\nThis version corrects that Col. Steve Warren is a U.S. military spokesman in Baghdad, not Kuwait.\n ", "external_links": [], "published": "2015-10-12T03:00:00.000+03:00", "crawled": "2015-10-16T07:18:12.211+03:00", "highlightTitle": ""}