{"organizations": ["Indianapolis Colts", "Maya Piper", "MARTHA MICHALAK Fullscreen Eagles", "Livonia Patriots", "MHSAA", "NFL Flag Football National Championships", "Connor Johnston", "Mid American All Star", "Millington Cardinals", "Northville", "South Lyon Lightning", "Michigan Hawks", "Lake Orion", "Yankees", "South Lyon High School", "South Lyon Thunder", "Michigan Raiders", "Northville Mustangs", "Farmington Hills Mercy High School", "Chelsea Collins", "Commerce", "Kensington Valley Baseball-Softball Association’s Community League", "Fullscreen Yankees", "Novi Youth Baseball League", "Davenport University", "KEVIN JENNINGS Fullscreen Mustangs", "Chelsea Amman", "AMY BEERS Fullscreen Blue Jays", "Bloomfield Hills St. Hugo", "Pinto Division of the Novi Youth Baseball League", "Tigers", "Catholic League Youth Organization", "Grosse Pointe", "Plymouth", "Cubs", "Kensington Valley Baseball-Softball Association", "West Coast FC", "Huron Valley Eagles", "Facebook Email Twitter Google", "Stealth Red girls", "Fullscreen Tigers", "Michigan Blue Jays", "Mustangs", "Jacob Michael Davis Foundation"], "uuid": "fd5f6c1d71b565e5f94b9ad2ec69f5fb1d770b9b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.hometownlife.com", "main_image": "http://www.gannett-cdn.com/-mm-/f3ab7b9ba0bab26ee5d5952784e20095294da2a9/c=0-0-944-533&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/10/26/Livonia/B9319425133Z.1_20151026000815_000_G1SCBPP6C.1-0.jpg", "site_section": "http://rssfeeds.hometownlife.com/livonia/sports", "section_title": "Livonia - Sports", "url": "http://www.hometownlife.com/picture-gallery/sports/2015/07/27/team-talk/30750419/", "country": "US", "title": "Team Talk", "performance_score": 0, "site": "hometownlife.com", "participants_count": 0, "title_full": "Team Talk", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T19:56:00.000+02:00", "replies_count": 0, "uuid": "fd5f6c1d71b565e5f94b9ad2ec69f5fb1d770b9b"}, "author": "", "url": "http://www.hometownlife.com/picture-gallery/sports/2015/07/27/team-talk/30750419/", "ord_in_thread": 0, "title": "Team Talk", "locations": ["Bella Brass", "Livonia", "Sierra Kersten", "South Lyon", "Oxford", "Jacob Mass", "Brighton", "Macomb County", "Logan Hoskins", "Walled Lake", "Logan", "Hamburg", "Sandusky", "San Francisco", "South Farmington Blues", "Indiana", "Hartland", "Lauren Spencer", "Calif", "Pittsburgh", "Southfield", "Santa Clara", "Ohio", "Logan Burkert", "Pa", "Illinois", "Ypsilanti", "Texas", "Farmington", "Milford", "Shea Scott", "Ontario", "WaCo Wolves Great Lake", "Kelsey Zampa", "Okemos", "East Lansing", "Michigan", "Canton", "Pennsylvania", "Midland", "Clarkston"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Lauren Savanyu", "Jake Giacobbi", "Ben Raisch", "Jessica Ellis", "Oliver Daniel", "Karlie Moore", "Keegan Litkewycz", "Emma Campbell", "C.J. Banks", "Matthew Miles", "Ethan Burkert", "Chris Sadler", "Connor Davey", "Jim Carson", "Chris Berrelez", "Ethan Gaylor", "Rob Quinn", "Alec Gorman", "Cassidy Ward", "Jon Vondrasek", "Eric Davis", "Bruce Hoskins", "Matt Walker", "Conrad Troyer", "Preston Johnson", "Phil Atwell", "Giuliano Daniel", "Brenden Olesuk", "Joe Pesci", "Ryan Celmer", "Rob Backus", "Ken Swartz", "Joseph Elwell", "Joshua Golab", "Michael Schave", "Lauren Bunker", "Tommy Walsh", "Stephen Freeman", "Bryden Marshall", "Lexie Resnick", "Maggie Murphy", "Janak Mukherji", "Laney Cjakowski", "Maureen Carlson", "Jonathan Michalak", "James Tobis", "Tuggle", "Garret Cox", "Joseph Maruskin", "Anthony Salter", "Alex Roznowski", "Maddy Peters", "Robert Hong", "Alex Cardenas", "Nate Sanko", "Shawn Kelly", "Kyle McCollum", "Zack Swartz", "Kylie Knight", "Shannon Magnan", "Mark Gaylor", "Greg Wiacek", "Chay Halash", "Brock Porter", "Nolan Mohr", "Noah Canales", "Sheryl Kersten", "Bob Medendorp", "Tyler Atwell", "Romulus", "Jake Kelbert", "Lauren Franklin", "Colin Metzler", "Trey Gorman", "Zack Kuzma", "AJ Miller", "Lauren Krill", "Bryan Bolling", "Jake Schutz", "Todd Hoisington", "Caroline Perry", "Jovanny Skrelja", "Justine Lynn", "Lia Krawiec", "Jessica Moody", "Tyler Troyer", "Shane Patzer", "Andrew Giddings", "Molly Nieto", "Shannon Jennings", "Michael Ying", "Todd Porter", "Danique Lewis", "Taylor Vitori", "Dallas Phillips", "Danny Shea", "Doug Smith", "Olivia O'Connell", "Todd Kuzma", "Victor Lee", "Krista Eeley", "Ann Arbor", "Cassidy Brendtke", "Lauren Sciborski", "Brayden Brothers", "Ben Schmidt", "Noah Segerstrom", "Drew Scheuher", "Mikey Bolling", "Drew Backus", "Max Rallis", "Vimesh Patel", "Noah Patenaude", "Dominic Gatson", "Alex Wilson", "Samir Rajani", "Celmer", "Kyle Goodling", "Jack Stegmeyer", "Metzler", "Grace Nieto", "Greg Kopich", "Brittney Zabinski", "Christian Stevens", "Brett Leidal", "Aidan Lukas", "Eric Johnson", "Eric Craft", "Cal Fournier", "Caroline Badrak", "Joey Sellis", "Dan Litkewycz", "Mark Skrelja", "Caitlin Cavicchiolo", "Malia Berkely", "DONNA JAKUBIK", "Matthew Trumpy", "Jack Elowsky", "Collin White", "Matt Stevens", "Jeff Olesuk", "Matt Weber", "Andrew Kent", "Brooke Essenmacher", "Isaac Smith", "Jake Hemker", "Johnny Stepek", "Lucas Buccellato", "Ryan Skvarce", "Matt Abraham", "Barta", "Courtney Petersen", "Jim Pearen", "Angie Schmidt", "Mike Tate", "Ben Ward", "Brandon Bolling", "Liam Young", "James Thunder", "Katie Jakubik", "Cody Walker", "Eric Brodde", "Chris Kelbert", "Molly Thomas", "Levi", "Samantha Shea", "Owen McRoberts", "Andrew Kummer", "Callie Manasco", "Gaby Cummings", "Julian Menser", "Mason McGuire", "Bethany Kopel", "Yu Okochi", "Leah McIlreavy", "BRAD LEIDAL", "Andrew Berg", "Ashton Nowak", "Rob Brothers", "Jake Moody", "Connor Wallis", "John Hollo", "Allison Havrilla", "Evan Simoff", "Evelyn Keller", "Caroline Carlson", "BRAD LEIDAL Fullscreen", "Rachel Jennings", "Doug Landefeld", "Lena Monteith", "Ian Fan", "Erin Doster", "Yannis Bi", "LISA", "Erin Emmanuel", "Ethan Tunney", "Brendan Stewart", "Nick Pearen", "Jenna Galecki", "Olivia Iafrate", "Evan McRoberts", "Torin Graver", "Abigail Raguckas", "Arleene Iafrate", "Scotty Haakenson", "Isabella Cirulis", "Kelsie Schutz", "Jack Morse", "Jon Montie", "Taylor Lambouris", "BRYAN BOLLING", "Ashley Dameworth", "Alyssa Hollo", "Greg Monteith", "Alexis Warner", "Mikey Tate III", "Ben Bolling", "Aidan Turner", "Leah Seery", "Kyle Gilger", "Roy Swartzinski", "Ty Webb", "Matthew Williams", "Shaun Sciborski", "McKenna King", "Chuck Frady", "Gunnar Lombard", "Parker Kent", "Harrison Merrill", "Aiden Quinn", "Bailey Papich", "JOE PESCI Fullscreen South Lyon", "Scott Menser", "Dean Phillips", "Nathan Wicks", "GREG MONTIETH Fullscreen", "Eric Stegmeyer", "James Beers", "Shinyu Imamura", "Reid Van Tiem", "Jimmy Dales", "Keegan Flaherty", "Jack Hubert", "Ryan Gallagher", "Brian Wilson", "Riley Flaherty", "Jacob Gardner", "Riley Patzer", "Jaden Vondrasek", "Sanjeev Swarnam", "Stephen Riesen", "Kevin Beers", "Kylie Millhorn", "Cameron Aramian", "Brad Leidal", "Melissa Finn", "Grace Flynn", "Mike Mockeridge", "Anthony Pesci", "Reggie Spencer", "Erik Sparschu", "Marissa Viggiano", "Tim McCollum", "ANN MARIE", "Olivia Sabin", "Ashley Smith", "Sydney Smith", "Sierra Kersten", "Merrill", "Abbey Barta", "Jenna Potter", "Kayla Errer", "Bobby Porter", "Doc Miller", "Evan Carson", "Raisch", "Jake Dresselhouse", "Rachel Vaughn", "Maxwell Denny", "Matthew Halash", "Johnny DiPonio", "Aidan Burr", "Mason Hoisington", "Gabby Resnick", "Arvind Kalyana", "Ryan Ward", "Danielle Havrilla", "Hunter Elandt", "Dave Schutz", "Jason Burr", "Natalie Perrone", "Adam Mrakitsch", "Ryan Kelly", "Jake Giddings", "Ben Brady", "Tyler Donaldson", "Rachelle Topolewski", "Brenna Lovera", "Mitchell Smith", "Joey Maruskin", "Kevin Jennings", "Jamil Guerrero", "Joey Harris", "Olivia Vitale", "Nick Hoyer", "MICHEL PORTER Fullscreen", "Kayla Choiniere", "Maddi Malecki", "Zoey Morse", "Luke Brodde", "Ryan Medendorp", "RITA PATEL", "Jonathan Bi"], "text": "Facebook Email Twitter Google+ LinkedIn Pinterest Team Talk The Michigan Raiders, an area travel flag football team based in Milford, recently captured the regional title to qualify as one of eight teams for the NFL Flag Football National Championships during 2016 Super Bowl, Feb. 7, at the San Francisco 49ers’ Levi’s Stadium in Santa Clara, Calif. The Raiders, who outlasted teams representing leagues in Indiana, Illinois, Ohio, Texas and Michigan, won the regional title on Oct. 10 at the Indianapolis Colts’ practice facility. Members of the Raiders include (front row, from left): Eric Craft, Johnny Stepek, Adam Mrakitsch, Jake Dresselhouse, Jus'tyz Tuggle; (back row, from left) coach Ken Swartz, Zack Swartz, Brock Porter and coach Todd Porter. Post to Facebook Team Talk The Michigan Raiders, an area travel flag football team based in Milford, recently captured the regional title to qualify as one of eight teams for the NFL Flag Football National Championships during 2016 Super Bowl, Feb. 7, at the San Francisco 49ers’ Levi’s Stadium in Santa Clara, Calif. The Raiders, who outlasted teams representing leagues in Indiana, Illinois, Ohio, Texas and Michigan, won the regional title on Oct. 10 at the Indianapolis Colts’ practice facility. Members of the Raiders include (front row, from left): Eric Craft, Johnny Stepek, Adam Mrakitsch, Jake Dresselhouse, Jus'tyz Tuggle; (back row, from left) coach Ken Swartz, Zack Swartz, Brock Porter and coach Todd Porter.  //www.hometownlife.com/picture-gallery/sports/2015/07/27/team-talk/30750419/   Join the Conversation To   Team Talk The Michigan Raiders, an area travel flag football team based in Milford, recently captured the regional title to qualify as one of eight teams for the NFL Flag Football National Championships during 2016 Super Bowl, Feb. 7, at the San Francisco 49ers’ Levi’s Stadium in Santa Clara, Calif. The Raiders, who outlasted teams representing leagues in Indiana, Illinois, Ohio, Texas and Michigan, won the regional title on Oct. 10 at the Indianapolis Colts’ practice facility. Members of the Raiders include (front row, from left): Eric Craft, Johnny Stepek, Adam Mrakitsch, Jake Dresselhouse, Jus'tyz Tuggle; (back row, from left) coach Ken Swartz, Zack Swartz, Brock Porter and coach Todd Porter. MICHEL PORTER Fullscreen In a battle of the sexes, the South Lyon boys golf team earned a slight victory over the girls squad in a nine-hole benefit held Oct. 19 on their home course, Cattails, while raising money for the Jacob Michael Davis Foundation. In lieu of the greens fee waiver by Cattails, each of the 27 players who participated in the event donated money in honor of South Lyon economics teacher Eric Davis, who lost his son to leukemia. Team members raised a total of $305 toward the foundation to help support families that are affected by childhood cancer. CARRIEANN TOWNE Fullscreen Madness ’02 went 5-0 while outscoring their opponents 35-8 to capture the PGF Qualifer Ren-Fest 14-and-under girls softball title, Oct. 3-4, in Grand Blanc. In the finals, Madness ’02 fell behind 4-0 before rallying for an 8-6 victory over the Millington Cardinals thanks to a two-out, two-run single by Abbey Barta. Team members include (front row, from left): Kylie Millhorn, Grace Nieto; (middle row, from left) Gaby Cummings, McKenna King, Cassidy Brendtke, Shea Scott; (back row, from left) Karlie Moore, Chelsea Collins, Barta, coach Sheryl Kersten, Sierra Kersten and Bella Brass. RICHARD CUMMINGS Fullscreen Thunder Champions: The Novi St. James Thunder Varsity1 girls volleyball team, coached by Kevin Jennings, defeated Bloomfield Hills St. Hugo, 25-13, 25-13, in the finals to win a pre-season tournament at Farmington Hills Mercy High School. The Thunder finished first in pool play without losing a set to reach the gold medal bracket where they also defeated Farmington Our Lady of Sorrows in the semifinals, 25-4, 25-6. Members of the the Thunder, two-time Catholic League Youth Organization champions, include: Abigail Raguckas, Ashley Smith, Grace Flynn, Isabella Cirulis, Jenna Galecki, Lauren Krill, Lia Krawiec, Maddy Peters, Shannon Jennings, Maddi Malecki and Rachel Jennings. KEVIN JENNINGS Fullscreen Mustangs net tri title: Northville opened its boys tennis season Aug. 20 at home by scoring a team-high 16 points followed by Clarkston (11) and Plymouth (1). Among the singles winners included last year’s MHSAA Division 1 runner-up Connor Johnston (No. 1) and Oliver Daniel (No. 4). Janak Mukherji (No. 2) and Stephen Freeman (No. 3) each added seconds. The Mustangs also swept all five doubles led by Ryan Gallagher and Arvind Kalyana (No. 1); Hoon Oh and Jonathan Bi (No. 2); Samir Rajani and Giuliano Daniel (No. 3); Victor Lee and Yannis Bi (No. 4); and Evan Simoff and Michael Ying (No. 5). Northville’s Robert Hong and Jimmy Dales also captured the No. 6 exhibition doubles. RITA PATEL Fullscreen Hartland champs: The Huron Valley Eagles, an 8-and-under tournament team, defeated teams from Commerce, Lake Orion and western Ontario to capture the FAAST Mid-Summer Classic in Hartland during the weekend (July 18-19). Team members include (front row from left): Nate Sanko, Ryan Ward, Ty Webb, Mikey Bolling, Logan Hoskins, Mikey Tate III, batboy Ethan Burkert; (second row, from left) Logan Burkert, Ben Bolling, Brendan Stewart, Matthew Miles, Jack Elowsky, Joseph Maruskin (back row, from left) coaches Brandon Bolling, Bruce Hoskins, Bryan Bolling, Mike Tate and Joey Maruskin. BRYAN BOLLING Fullscreen Livonia Patriots 16U travel team rolls to title: Pictured are (front row from left) Ben Raisch, Trey Gorman, Johnny DiPonio, Alec Gorman, Jake Giacobbi, Chris Berrelez, Nick Hoyer, (back row from left) coach Metzler, Riley Flaherty, coach Merrill, Colin Metzler, Ryan Celmer, Jon Montie, Harrison Merrill, coach Celmer, Keegan Flaherty and coach Raisch. Not pictured is Jacob Mass. SUBMITTED Fullscreen Blues end season on high note:Members of the 13-and-under South Farmington Blues baseball team are (front row, from left) Cal Fournier, Jake Kelbert, Tommy Walsh, Eric Johnson, C.J. Banks and Nick Pearen and (back row, from left) Ben Ward, Parker Kent, Nolan Mohr, Greg Wiacek, Gunnar Lombard and Kyle Goodling. Also on the team are manager Chris Kelbert and coaches Jim Pearen and Eric Johnson. Windows User Fullscreen Lightning runner-up: The 10-and-under South Lyon Lightning, coached by Rob Quinn, recently finished second in the Kensington Valley Baseball-Softball Association’s Community League with a 12-7 record. Team members include: Ethan Gaylor, Aiden Quinn, Jack Hubert, Cameron Aramian, Kevin Beers, Christian Stevens, Brenden Olesuk, Drew Scheuher, Dallas Phillips, Mason Hoisington and Connor Wallis. Assistant coaches include Mark Gaylor, Dean Phillips, Todd Hoisington, Matt Stevens and Jeff Olesuk. AMY BEERS Fullscreen Lightning claims first: The South Lyon Lightning recently defeated the Northville Mustangs, 6-4, to earn in first place with a 10-4 record in the Kensington Valley Baseball-Softball Association’s 15-and-under Advanced Division. Team members include: Kyle McCollum, Maxwell Denny, Ryan Skvarce, Roy Swartzinski, Anthony Salter, Hunter Elandt, Chris Sadler, Bobby Porter, Jake Schutz, James Beers, Logan DeCaluwe and Tyler Atwell. Tim McCollum is the head coach, assisted by Chris Sadler, Phil Atwell, Dave Schutz and Bobby Porter. AMY BEERS Fullscreen Blue Jays win USSSA title: On July 26, the 11-and-under Michigan Blue Jays capped a 7-0 run to capture the USSSA World Series in Canton. The Blue Jays went 21-7 overall in tournament play and finished No. 3-ranked in the USSSA among 2,265 11-and-under teams. They also captured the WaCo Wolves Great Lake Shoot-out and the AA Canton Memorial Day Classic. World Series roster members include: Luke Brodde (Northville), Matthew Williams (Romulus), Isaac Smith (Flat Rock), Alex Cardenas (Northville), Mason McGuire (Hamburg), Connor Apligian (Northville), Drew Backus (Northville), Joshua Golab (South Lyon), Andrew Kent (Livonia), Ashton Nowak (Flat Rock) and Chase Temple (Novi). Chuck Apligian (Northville) is the head coach assisted by Eric Brodde (Northville), Rob Backus (Northville) and Mike Mockeridge (South Lyon). ANN MARIE CARDENAS Fullscreen Firecracker champs: The short-handed Motor City Madness Red-Shea, a 12-and-under girls softball team, used just nine players to win five games during a 14-hour period on July 26 to capture NSA Firecracker Xplosion Championship. The Madness outscored their opponents 48-13 while getting a no-hitter and 1-hitter en route to the title. Team members include (bottom, from left): Jessica Moody, Kayla Errer(second row, from left) Samantha Shea, Lia Krawiec, Caroline Carlson; (third row, from left)Dunya Kizy, Olivia Iafrate, Riley Patzer, Rachel Vaughn (back row, from left) coaches Maureen Carlson, Shane Patzer, Danny Shea and Arleene Iafrate. LISA MOODY Fullscreen Stealth Red fifth in NSA World Series: Team members of the 12-and-under Stealth Red girls softball team include (front row, from left) Cassidy Ward, Laney Cjakowski, Alyssa Hollo, Molly Nieto, Kelsey Zampa; (second row, from left) Lauren Sciborski, Olivia Sabin, Ashley Dameworth, Lauren Franklin, Lena Monteith, Allie Page; (back row, from left) coaches Shaun Sciborski, John Hollo and Greg Monteith. GREG MONTIETH Fullscreen Cubs win Pinto title: The Cubs recently captured the Pinto Division of the Novi Youth Baseball League. Team members include (front row, from left): Cody Walker, Yu Okochi, Sanjeev Swarnam, Joey Harris, Matthew Trumpy, Greg Kopich; (middle row, from left) Chuck Frady, James Tobis, Michael Schave, Keegan Litkewycz, Alex Wilson, Jaden Vondrasek; (back row, from left)coaches Matt Walker, Dan Litkewycz, Brian Wilson and Jon Vondrasek. BRAD LEIDAL Fullscreen Tigers rule division: The Tigers closed out their Novi Youth Baseball League season recently by capturing the Mustang Division title. Team members include (front row, from left): Jack Morse, Andrew Kummer, Bryden Marshall, Ryan Kelly, Aidan Turner; (back row, from left) head coach Brad Leidal, Brett Leidal, Zack Kuzma, assistant coach Todd Kuzma, Preston Johnson, Tyler Donaldson, Matt Abraham, assistant coach Shawn Kelly, Noah Segerstrom, Scotty Haakenson. (Not Pictured is Jacob Gardner.) BRAD LEIDAL Fullscreen Yankees champs: The Yankees were recently crowned champions of the Bronco Division in the Novi Youth Baseball League. Team members include (front row, from left): Aidan Burr, Kyle Gilger, Torin Graver, Ryan Medendorp, Aidan Lukas, assistant coach Jason Burr; (back row, from left); head coach Andrew Giddings, Joseph Elwell, Max Rallis, Ethan Tunney, Alex Roznowski, Jake Giddings and assistant coach Bob Medendorp. (Not pictured are Noah Patenaude and Jamil Guerrero.) BRAD LEIDAL Fullscreen Back-to-back champs: The 15-and-under Northville Mustangs defeated the Novi Heat, 11-1, on July 19, to win the Dearborn Baseball Invitational Tournament. On July 12, the Mustangs also captured the Castalia Duckpond Classic Tournament in Sandusky, Ohio. Team members include: Janak Mukherji, Jonathan Michalak, Lucas Buccellato, Tyler Troyer, Erik Sparschu, Matt Weber, Stephen Riesen, Jake Moody, Mitchell Smith, Evan Carson, Jack Stegmeyer, Jake Moody and Ben Brady. (Not pictured is Ben Schmidt and Stephen Riesen.) The coaching staff includes Eric Stegmeyer, Conrad Troyer, Jim Carson, Doug Smith. MARTHA MICHALAK Fullscreen Eagles swoop to title: The Huron Valley Eagles, an 8-and-under baseball tournament team, captured the Southfield Summer Showdown (July 11-12). Team members include (front row, from left): Nate Sanko, Ryan Ward, Ethan Burkert (batboy); Mikey Bolling; (second from left) Ty Webb, Matthew Miles, Logan Burkert, Brendan Stewart, Ben Bolling, Logan Hoskins, Jack Elowsky, Joseph Maruskin (third row, from left) coaches Brandon Bolling, Bryan Bolling, Bruce Hoskins and Joey Maruskin. (Not pictured is Mikey Tate III and coach Mike Tate. BRYAN BOLLING Fullscreen Boys of summer: The South Lyon Thunder, an under-9 travel baseball team, capped a 28-8 season on July 12 by defeating the Ann Arbor A’s, 17-5, to capture the finals the Adrian Boys of Summer Tournament. Members of the Thunder, who won four of five tourney games, include (front row, from left): Owen McRoberts, Brayden Brothers, Jovanny Skrelja, Julian Menser, Joey Sellis, Jake Hemker; (second row, from left) Andrew Berg, Collin White, Anthony Pesci, AJ Miller, Liam Young, Evan McRoberts, Connor Davey; (back row, from left) coaches Rob Brothers,Scott Menser, Doc Miller,Mark Skrelja and Joe Pesci. JOE PESCI Fullscreen South Lyon pom first: The 2015-16 South Lyon High School varsity pompon team earned a first-place award for their performance at the Mid American competition, June 19-22, at Davenport University in Grand Rapids. South Lyon, coached by Leah Seery and Chelsea Amman, also added seconds for kick line and speed learning routines, while the seniors also finished second in kickline. Named to the Mid American All Star team was senior Caitlin Cavicchiolo, senior captain Melissa Finn and junior Callie Manasco. Other team members include seniors Kelsie Schutz (captain), Caitlin Cavicchiolo, Kayla Choiniere, Krista Eeley, Brooke Essenmacher, Gabby Resnick; juniors Lauren Bunker, Jessica Ellis,Leah McIlreavy, Olivia O'Connell, Natalie Perrone, Caroline Perry, Lauren Savanyu, Sydney Smith, Brittney Zabinski; sophomores Emma Campbell, Allison Havrilla, Danielle Havrilla, Katie Jakubik, Evelyn Keller, Bailey Papich, Jenna Potter, Lexie Resnick; and freshmen Caroline Badrak, Molly Thomas and Taylor Vitori. DONNA JAKUBIK Fullscreen National title: The Michigan Hawks U-18 elite girls soccer team defeated West Coast FC 2-0 to win the national title. Team members include (back row, from left): Lauren Spencer, Oxford; Kylie Knight, Plymouth; Taylor Lambouris, Farmington; Alexis Warner, Ypsilanti; Maya Piper, Midland; Zoey Morse, East Lansing; Brenna Lovera, Milford; Rachelle Topolewski, Waterford; Bethany Kopel, Novi; and head coach Doug Landefeld; and (front row, from left) Justine Lynn, Grosse Pointe; Courtney Petersen, Canton; Erin Emmanuel, Livonia; Malia Berkely, Ohio; Marissa Viggiano, Macomb County; Shannon Magnan, Brighton; and Erin Doster, Okemos. Michigan Hawks Fullscreen Battle of Bats champs: The Novi Heat, a 15-and-under baseball team, scored a total of 30 runs and used solid pitching to go 3-0 and capture the finals of the Battle of the Bats Tournament Champions 2015 hosted by Total Sports, July 11-12, in Walled Lake. Members of the Heat include (front row, from left): Skyler Pitcher, Reid Van Tiem, Dominic Gatson, Shinyu Imamura, Ian Fan; (back row, from left) coach Chay Halash, Matthew Halash, Reggie Spencer, Nathan Wicks, Garret Cox, Danique Lewis, Nilay Patel, Noah Canales and coach Vimesh Patel. CLAY HALASH Fullscreen Tourney champs: The Madness ’02 posted a 9-0 record to outlast a 31-team 12-and-under field over Fourth of July weekend to capture ASA Battle in the Burgh held in Pittsburgh, Pa. Madness ’02, now 22-1 this summer with three straight tournament titles, won all five games Sunday capped by a 12-3 victory over Team Pennsylvania in the finals. Team members of Madness ’02 include (front row, from left): Maggie Murphy, Grace Nieto, Cassidy Brendtke, Gaby Cummings, McKenna King; (back row, from left) Chelsea Collins, Sierra Kersten, Olivia Vitale, Abbey Barta, Kylie Millhorn and Angie Schmidt. RICHARD CUMMINGS Like this topic? You may also like these photo galleries: Replay", "external_links": [], "published": "2015-10-26T19:56:00.000+02:00", "crawled": "2015-10-26T22:25:13.116+02:00", "highlightTitle": ""}