{"organizations": [], "uuid": "c4e272d12e8b277717e61f8d79e06ac632345d5b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/", "section_title": "Ahram Online - News, Business, Culture, Sports &amp; Multimedia from Egypt ", "url": "http://english.ahram.org.eg/NewsContent/6/54/161348/Sports/Africa/African-players-week-in-Europe-Bony-brace-helps-le.aspx", "country": "EG", "title": "African players week in Europe: Bony brace helps leaders City run riot - Africa - Sports", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "African players week in Europe: Bony brace helps leaders City run riot - Africa - Sports - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "c4e272d12e8b277717e61f8d79e06ac632345d5b"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/6/54/161348/Sports/Africa/African-players-week-in-Europe-Bony-brace-helps-le.aspx", "ord_in_thread": 0, "title": "African players week in Europe: Bony brace helps leaders City run riot - Africa - Sports", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related Ivorian Bony scores twice as Man City beat Bournemouth in England England\nWilfried Bony (Manchester City)\nDeputising for Aguero, Bony rose to the challenge with a brace as City crushed promoted Bournemouth 5-1 at the Etihad Stadium. The Ivory Coast striker exploited a mistake by Bournemouth goalkeeper Adam Federici to tap in City's second goal in the 11th minute and completed the scoring a minute from time, gathering a cross from Jesus Navas, turning and slotting home with his left foot.\nDieumerci Mokani (Norwich City)\nMbokani marked his full league debut with a goal at Newcastle, stretching to volley home an inviting left-wing cross from Martin Olsson. It was the on-loan Dynamo Kiev forward's second goal in two games, but he finished on the losing side as Newcastle prevailed 6-2, with Dutch midfielder Georginio Wijnaldum scoring four goals.\nVictor Moses (West Ham United)\nNigeria winger Moses created the goal that set West Ham on their way to an impressive 3-1 win at London rivals Crystal Palace. The on-loan Chelsea attacker crafted the opening goal in the 22nd minute at Selhurst Park with a clever reverse pass inside the full-back that allowed Carl Jenkinson to put West Ham in front.\nRiyad Mahrez (Leicester City)\nMahrez set up an injury-time equaliser for Jamie Vardy as Leicester pulled off yet another comeback by coming from two goals down to draw 2-2 at Southampton. A half-time replacement for Shinji Okazaki, the Algerian winger produced a slide-rule pass that allowed Vardy to run through and blast his second goal of the game past Southampton goalkeeper Kelvin Davis. It was the 24-year-old's fourth assist of the campaign.\nSpain\nEric Bailly (Villarreal)\nIvory Coast defender Bailly was sent off for two bookable offences just two minutes into the second-half as Villarreal fell to a 2-1 home defeat by joint La Liga leaders Celta Vigo.\nItaly\nKalidou Koulibaly (Napoli)\nWith on-form leaders Fiorentina visiting Napoli, Koulibaly's task was to cancel out the attacking threat of Croatian Nikola Kalinic, who hit a hat-trick in a 4-1 thrashing of Inter Milan three weeks ago. In the end, the big Senegalese defender acquitted himself fairly well despite Kalinic hitting La Viola's only goal in between Lorenzo Insigne's opener and Gonzalo Higuain's winner for the hosts.\nKhouma Babacar (Fiorentina)\nBabacar's promising start to the season has stalled since Fiorentina coach Paulo Sousa dropped him to the bench in favour of Nikola Kalinic, meaning the big Senegalese striker made only a cameo appearance in a 2-1 defeat to Napoli, replacing defender Nenad Tomovic for the final 12 minutes.\nMohamed Salah (Roma)\nSalah has become an integral part of Rudi Garcia's squad and hit his fourth goal of the league season in a 3-1 win over Empoli to join Gervinho and Miralem Pjanic as Roma's top scorers. The Egyptian's eye for goal found him in the right place at the right time when Gervinho finished off some great solo work to deliver a pinpoint pass into his path in front of goal on 69 minutes.\nFrance\nStoppila Sunzu (Lille)\nThe Zambia defender started for Lille against Guingamp but was sent off a minute from the end of a game that ended in a 1-1 draw, leaving his club languishing in the bottom half of the Ligue 1 table.\nCheikh Ndoye (Angers)\nGiant Senegal midfielder Ndoye continued his impressive debut season in Ligue 1 with a goal as promoted Angers won 2-1 at Toulouse to stay second, five points behind leaders Paris Saint-Germain.\nBenjamin Moukandjo (Lorient)\nMoukandjo got the better of his Cameroon colleague Nicolas Nkoulou before scoring the equalising goal for Lorient in a 1-1 draw at Marseille. It was Moukandjo's fifth goal of the season.\nGermany\nSerey Die (VfB Stuttgart)\nThe Ivory Coast defensive midfielder was sent off for the final five minutes of his side's 1-0 win at home to Ingolstadt, which lifted Stuttgart off the bottom of the Bundesliga table and up to 15th. Die held back Max Christiansen and was shown a second yellow card after being booked early in the first half for a tactical foul.\nSalomon Kalou (Hertha Berlin)\nThe veteran Ivory Coast striker looked to have rescued a point for the capital club when he headed an equaliser at Schalke before Max Meyer struck a stoppage-time winner to seal the Royal Blues' 2-1 victory. Kalou's 73rd-minute header gave him his fourth goal of the season.", "external_links": [], "published": "2015-10-19T03:00:00.000+03:00", "crawled": "2015-10-20T04:10:10.157+03:00", "highlightTitle": ""}