{"organizations": [], "uuid": "1a133570ac770405433a77ee9df9bbb3829f05b8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.torontosun.com", "main_image": "http://storage.torontosun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297757880428_LARGE_BOX.jpg?quality=80&stmp=1444350675013&size=100x", "site_section": "http://www.torontosun.com/sports/basketball", "section_title": "Basketball | Sports | Toronto Sun", "url": "http://www.torontosun.com/2015/10/07/knicks-coach-derek-fisher-in-alleged-altercation-with-grizzlies-matt-barnes", "country": "CA", "title": "Knicks coach Derek Fisher in alleged altercation with Grizzlies' Matt Barnes | N", "performance_score": 0, "site": "torontosun.com", "participants_count": 1, "title_full": "Knicks coach Derek Fisher in alleged altercation with Grizzlies' Matt Barnes | N", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T08:53:00.000+03:00", "replies_count": 0, "uuid": "1a133570ac770405433a77ee9df9bbb3829f05b8"}, "author": "Brian Mahoney, THE ASSOCIATED PRESS", "url": "http://www.torontosun.com/2015/10/07/knicks-coach-derek-fisher-in-alleged-altercation-with-grizzlies-matt-barnes", "ord_in_thread": 0, "title": "Knicks coach Derek Fisher in alleged altercation with Grizzlies' Matt Barnes | N", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK - Knicks coach Derek Fisher was involved in an altercation with Memphis Grizzlies forward and former teammate Matt Barnes in California on Saturday, a person with knowledge of the details said.\nThe New York Post, citing an anonymous source, reported Wednesday that the altercation was because Fisher is dating Barnes' estranged wife . Fisher filed for divorce from his wife, Candace, in March.\nThe person said Fisher travelled to Los Angeles after practice Saturday to see his children and the altercation happened that night while Fisher was attending a gathering at the home of Gloria Govan, Barnes' estranged wife. The person spoke to The Associated Press on condition of anonymity because no comments were authorized.\nFisher missed practice Monday -- the team announced at the time it was for personal reasons -- and led the Knicks in their exhibition opener Wednesday night against a Brazilian club team.\n\"My state of mind is that we have a game tonight and nothing that I've experienced has anything to do with how we perform tonight,\" Fisher said before the game, adding that he was \"completely focused and committed to the team.\"\n\"I'm not distracted in any way,\" he said.\nFisher and Barnes were teammates with the Los Angeles Lakers from 2010-12. The Grizzlies held training camp last week in Santa Barbara, California, and the Post reported that Barnes drove to Govan's home when he learned that Fisher was there.\n\"We are aware and currently gathering information regarding today's report involving Matt Barnes,\" the Grizzlies said in a statement. \"We have no further comment at this time.\"\nAn NBA spokesman said it would be premature to comment.\nFisher said he told his players about the situation when he gathered them before the game because he wanted them to hear about it from him directly.\n\"I'm here, I'm focused,\" he said. \"It's not something that's going to take me away from who we are or what we're trying to do and I assured them of that.\"\nFisher is in his second season with the Knicks after spending most of his playing career in Los Angeles, where his children remain. He said his family decision should show his commitment to his job in New York.\n\"So as far as that goes, the guys are the ones ultimately who know who I am and what I'm about. They see me every day,\" Fisher said. \"If guys feel like I'm not here or not focused, they'll find that out.\"\n Basketball\nMatt Barnes says NBA looking at incident with Knicks’ Fisher 0\nEx-player suing Globetrotters over alleged sexual harassment 0\nKnicks coach Derek Fisher in alleged altercation with Grizzlies' Matt Barnes ", "external_links": ["http://pubads.g.doubleclick.net/gampad/clk?id=182027221&iu=/3081/SMCO_ENUR_TSUN_EN_WEB", "http://pubads.g.doubleclick.net/gampad/clk?id=228633661&iu=/3081/SMCO_ENUR_TSUN_EN_WEB", "http://nypost.com/2015/10/07/matt-barnes-attacks-knicks-coach-fisher-for-dating-ex-wife/", "http://pubads.g.doubleclick.net/gampad/clk?id=182024221&iu=/3081/SMCO_ENUR_TSUN_EN_WEB", "http://pubads.g.doubleclick.net/gampad/clk?id=183052021&iu=/3081/SMCO_ENUR_TSUN_EN_WEB"], "published": "2015-10-08T08:53:00.000+03:00", "crawled": "2015-10-09T09:41:47.224+03:00", "highlightTitle": ""}