{"organizations": [], "uuid": "ea41cea832273630a13c0142272717d267b699dd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sltrib.com", "main_image": "http://www.sltrib.com/csp/mediapool/sites/dt.common.streams.StreamServer.cls?STREAMOID=$sLG7badMy_oH1UNaYOmLc$daE2N3K4ZzOUsqbU5sYtEV9i8XduiPpW5lIdQV5$$WCsjLu883Ygn4B49Lvm9bPe2QeMKQdVeZmXF$9l$4uCZ8QDXhaHEp3rvzXRJFdy0KqPHLoMevcTLo3h8xh70Y6N_U_CryOsw6FTOdKL_jpQ-&CONTENTTYPE=image/jpeg", "site_section": "http://sltrib.com//csp/cms/sites/sltrib/RSS/rss.csp?cat=Sports", "section_title": "Sports - The Salt Lake Tribune", "url": "http://www.sltrib.com/sports/3063889-155/utah-basketball-lynne-roberts-has-big", "country": "US", "title": "Utah basketball: Lynne Roberts has big plans -- and the patience to see them through", "performance_score": 0, "site": "sltrib.com", "participants_count": 1, "title_full": "Utah basketball: Lynne Roberts has big plans -- and the patience to see them through | The Salt Lake Tribune", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "ea41cea832273630a13c0142272717d267b699dd"}, "author": "KYLE GOON", "url": "http://www.sltrib.com/sports/3063889-155/utah-basketball-lynne-roberts-has-big", "ord_in_thread": 0, "title": "Utah basketball: Lynne Roberts has big plans -- and the patience to see them through", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "San Francisco • Lynne Roberts moves fast. She wants the Utes to play fast. And the speed of her practices are no joke.\nBut not everything can move at her pace. For example: acceptance.\nWhen she was hired in April, Roberts met with her new players — many of whom were still reeling from the firing of Anthony Levrets. She told them she was making changes, and some players would buy into those changes sooner than others.\nBut come fall practices, everybody better be on board.\nRoberts brings a recent history of success from her previous stop in Pacific, and she's enacting a plan that she thinks will win games and re-energize the program. And senior point guard Dani Rodriguez, for one, is all in.\n  \"It wasn't easy for everyone,\" Rodriguez said. \"But she believes in us. Once she believes in us, it's easier to believe in her and what she wants to bring to the table.\"\nThe Utes were picked to finish 11th Wednesday at Pac-12 women's basketball media day. After winning only three conference games last season, it's no surprise that the perception of Utah in the conference is due for a slow reversal.\nAs for last year's many injuries and losses, the Utes aren't interested in talking about the past. As Rodriguez said: \"We like to say we're in the Roberts era now.\"\nThe Roberts era will eventually consist of fast-paced, high-scoring basketball. In nine of Robert's previous 13 seasons as a head coach, her team has led its conference in scoring. In the last two years at Pacific, Roberts earned conference coach of the year honors. In the last four years, she's won at least 18 games with berths in the WNIT.\nThat being said, the style of basketball won't be a total switch. Roberts plans to play to her strengths, which includes a number of stalwart post players including Emily Potter and Joeseta Fatuesi.\n\"We have to be intelligent basketball coaches and coach what we have in terms of the style,\" Roberts said. \"A lot of the players we have were recruited to a different system. But I think eventually we want to recruit to a system that's very different than what was run.\"\nRodriguez is already in tune with what Roberts wants to do: The 5-foot-10 playmaker is a natural uptempo player, and said she prefers to run on offense and pressure on defense. Already 10th in school history in assists (316), Rodriguez will be key to forcing the pace more.\nAnd in a word, Roberts said, her scheme is about \"pace.\" But Rodriguez said it's also giving the team a more free-flowing, fun feel for the game.\n\"Last year was too many sets, too robotic for us,\" she said. \"Now we're just going out there and playing basketball, taking what the defense gives us, and just having fun.\"\nUtah will benefit greatly from a number of players who missed most or all of last season. Potter, a 6-foot-6 center, will give the Utes length they lacked in the paint. Malia Nawahine is a strong two-way wing who can shoot and defend.\nUtah has also gotten a sense of \"swagger,\" Roberts said, from practicing and preparing in Utah basketball's new facility. Adding to the confidence factor of Utah's new home is the recruiting boost: Roberts said she's \"two for two\" on official visits so far.\nBut her vision also includes bringing excitement to Utah's home games, which averaged just 743 fans last year. She wants to add some of the things that worked for men's basketball — court projections, marketing tactics included. And she also wants to bring her players out more often in the community to create interest.\nShe thinks her style of basketball will help bring fans in as well.", "external_links": [], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-16T00:16:08.010+03:00", "highlightTitle": ""}