{"organizations": [], "uuid": "84f4169611176f7ba02ab693af8008c4fc5595f3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nydailynews.com", "main_image": "http://assets.nydailynews.com/polopoly_fs/1.2394515!/img/httpImage/image.jpg_gen/derivatives/landscape_1200/fellsweb13s-1-web.jpg", "site_section": "http://www.nydailynews.com/sports/index.html", "section_title": "Sports News &amp; Articles: Today’s Latest Sports News - NY Daily News", "url": "http://www.nydailynews.com/sports/football/giants/daniel-fells-career-due-mrsa-infection-article-1.2394516", "country": "US", "title": "Daniel Fells' career likely over due to MRSA infection", "performance_score": 1, "site": "nydailynews.com", "participants_count": 1, "title_full": "Daniel Fells' career likely over due to MRSA infection - NY Daily News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "84f4169611176f7ba02ab693af8008c4fc5595f3"}, "author": "NEW YORK DAILY NEWS", "url": "http://www.nydailynews.com/sports/football/giants/daniel-fells-career-due-mrsa-infection-article-1.2394516", "ord_in_thread": 0, "title": "Daniel Fells' career likely over due to MRSA infection", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Howard Simmons/New York Daily News A severe MRSA infection has reportedly done enough damage to Daniel Fells' foot that a source believes his playing days are all but over. The Giants presented tight end Daniel Fells with a game ball from their win over the 49ers when they spoke to him via Skype from their team meeting on Monday morning. Unfortunately, it likely will be the last game ball Fells ever receives.\nThe career of the 32-year-old tight end is almost certainly over thanks to the MRSA infection he's been hospitalized with for more than a week, according to an NFL source familiar with his situation. He has already had five surgeries to help him fight the infection, and is likely to have one or two more before he leaves the hospital, the source said.\nAnd while the source said Fells' foot remains intact -- despite one report that said he had part of his foot removed -- enough damage has been done that the source said \"I would be really surprised\" if he ever plays football again.\nThe bright side is that Fells' condition is apparently improving and even Giants coach Tom Coughlin said he has been led to believe Fells will make a full recovery.\n\"Oh, absolutely,\" Coughlin said on Monday. \"That is my understanding,\" for sure.\nThat wasn't always the case. When Fells was first hospitalized after contracting MRSA -- a methicillin-resistant staphylococcus aureus infection -- there were moments when those close to him felt his life might be in danger. Doctors struggled to find an antibiotic, or combination of antibiotics that worked. There was also concern, the source said, that doctors might have to remove Fells' foot in order to save his life.\nThe scariest moment, though, came when doctors discovered last week that the infection -- which they believed was triggered by a cortisone shot he had in his ankle -- spread to a bone in his leg. He immediately underwent another surgery just to deal with that.\nIn the last few days, though, the source said that the doctors believe they have found an \"antibiotic mixture\" that is successfully fighting the infection. That's part of why Coughlin sounded so optimistic about Fells, saying he's had three good days in a row.\n\"I don't think he's out of the woods,\" Coughlin said. \"I didn't say that. I think these three straight days are really a wonderful sign, but there are more tests to be done. And again the response to the antibiotic is critical.\"\nFells has been in a local hospital since Oct. 2 when the infection was first discovered. According to the source, he is likely to spend at least a few more days there as doctors monitor his condition to make sure the antibiotics are actually doing the job. At the moment they seem to be working. He had been running a high fever, the source said, but his temperature has returned to normal.\nCHECK OUT OUR NEW APP: GET THE DAILY NEWS ON ANDROID OR IOS\nFells will undergo more tests and scans on Tuesday, the source said, before doctors determine their next step.\nThe Giants, meanwhile, dedicated their 30-27 win over the San Francisco 49ers on Sunday night to Fells and his family - which became even more meaningful when one of the Giants' other tight ends, Larry Donnell, caught the game-winning touchdown pass in the final seconds. Giants players cheered loudly in the winning locker room when Coughlin announced they'd be giving the game ball to Fells. And there were more cheers on Monday morning when Coughlin got Fells on Skype from the Giants' team meeting, so everyone could see his reaction when he was told the game ball belonged to him.\n\"Everyone was able to cheer him on and try to make him feel better,\" Coughlin said. \"He was very nice in saying that he watched the game and he was very proud of how we finished it.\"\nRelated Stories Giants award game ball to Daniel Fells Giants' Fells could lose foot due to MRSA infection: report Giants' Fells still in hospital as team meets about MRSA Giants clean locker room after Daniel Fells' MRSA diagnosis Giants place tight end Daniel Fells on injured reserve Tags: daniel fells", "external_links": [], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-13T00:15:15.153+03:00", "highlightTitle": ""}