{"organizations": [], "uuid": "42f82a2bd281cf5e2c9a7e5dcf289bccb61a439c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "http://images.tribuneindia.com/cms/gall_content/2015/10/2015_10$largeimg03_Saturday_2015_012602167.jpg", "site_section": "http://www.tribuneindia.com/", "section_title": "The Tribune, Chandigarh, India : Latest news, India, Punjab, Chandigarh, Haryana, Himachal, Uttarakhand, J&amp;K, sports, cricket ", "url": "http://www.tribuneindia.com/news/nation/india-to-conduct-concurrent-military-drills-with-china-us/140995.html", "country": "US", "title": "India to conduct concurrent military drills with China, US", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "India to conduct concurrent military drills with China, US", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T03:00:00.000+03:00", "replies_count": 0, "uuid": "42f82a2bd281cf5e2c9a7e5dcf289bccb61a439c"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/nation/india-to-conduct-concurrent-military-drills-with-china-us/140995.html", "ord_in_thread": 0, "title": "India to conduct concurrent military drills with China, US", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ajay Banerjee\nTribune News Service\nNew Delhi, October 2\nThe Indian armed forces will conduct simultaneous military exercises with China on one hand and a tri-lateral drill with US and Japan on the other. Both exercises will run concurrently—- one off the Indian east coast and the other in China. From October 11-23, an Army team will participate in a counter-insurgency exercise named ‘Hand-in-Hand’ at Kunming, China. From October 12-19, India, US and Japan will launch a naval exercise “Malabar” in the Bay of Bengal that will include four-day sea-going exercises, including a ‘submarine hunt’. This comes in the backdrop of the first-ever India-US-Japan tri-lateral ministerial dialogue held on the sidelines of the 70th UN General Assembly session in New York on September 30. The three countries have agreed to work together to maintain maritime security through greater collaboration and strengthen regional connectivity. They have spoken about keeping the South China Sea free for navigation. China and five other countries dispute the maritime boundaries in the South China Sea and the dispute is pending in the United Nations. A large volume of Indian trade transits the sea. US Secretary of State John Kerry hosted the dialogue with Indian External Affairs Minister Sushma Swaraj and Japanese Foreign Minister Fumio Kishida. On October 12, top-of-the-line US warships and a nuclear-powered submarine shall be in the Bay of Bengal. A similar convergence of US-India-Japan navies in 2007 had raised the hackles of Beijing which termed it as an ‘anti-China’ grouping. Australia had participated in the 2007 exercise. India and the US have limited the “Malabar” to a bilateral format since 2007. However, the US included Japan when it hosted the same exercise in the Pacific last year. The USS Theodore Roosevelt, a 1 lakh tonne sea-borne aircraft carrier with space for some 90 fighter-jets and helicopters on board, will be leading the US fleet. At present, it is deployed in the Persian Gulf and is used by the US to launch attacks on the Islamic State-controlled areas. The nuclear-powered warship is 332 m long and is one of the most potent US warships from its ‘Nimitz-class’ of carriers. A littoral combat ship USS Fort Worth, a nuclear-powered ‘Los Angeles class’ submarine and a guided-missile carrying cruiser USS Normandy will be part of the fleet for the naval exercise.", "external_links": [], "published": "2015-10-03T03:00:00.000+03:00", "crawled": "2015-10-03T00:20:35.732+03:00", "highlightTitle": ""}