{"organizations": [], "uuid": "c8b65b1c57992d4bf2efd5fb80ceef7c1e02127d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.journalstandard.com", "main_image": "http://www.journalstandard.com/Global/images/head/nameplate/il-freeport_logo.png", "site_section": "http://www.journalstandard.com/sports?template=rss&mime=xml", "section_title": "Sports - Journal Standard", "url": "http://www.journalstandard.com/article/20151002/SPORTS/151009804/2000/NEWS?rssfeed=true", "country": "US", "title": "Aquin steamrolls River Ridge", "performance_score": 0, "site": "journalstandard.com", "participants_count": 1, "title_full": "Aquin steamrolls River Ridge", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T06:56:00.000+03:00", "replies_count": 0, "uuid": "c8b65b1c57992d4bf2efd5fb80ceef7c1e02127d"}, "author": "Todd McKenna Correspondent", "url": "http://www.journalstandard.com/article/20151002/SPORTS/151009804/2000/NEWS?rssfeed=true", "ord_in_thread": 0, "title": "Aquin steamrolls River Ridge", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted Oct. 2, 2015 at 10:56 PM Updated at 10:56 PM Correspondent Posted Oct. 2, 2015 at 10:56 PM FREEPORT — Aquin Coach Troy Barr is a man of his word and he proved it Friday night in the Bulldogs' 53-0 rout of River Ridge. Two weeks ago, Barr told junior fullback Dy'Treon Euell he would not carry the ball again unless he started to block better. \"We told him,. 'Unless you block, you won't get the rock',\" Barr said. Euell took that to heart, opening gaping holes for running back James Gustafson last week in Orangeville. His reward came Friday night, as the bruising fullback got the Bulldogs on the scoreboard quickly. After the Aquin defense stonewalled the Wildcats on the opening drive of the game — which would be a recurring theme throughout the night — Euell took the handoff on the first Bulldogs play of the night and bulldozed through the line and didn't stop until he covered 52 yards into the end zone. \"Dy'Treon's been working on his blocking and we told him he had to improve there, and tonight he got rewarded for that,\" Barr said. It was the first of many touchdowns for Aquin, which overwhelmed River Ridge with its size and speed. James Gustafson got things going from there, scoring on a 3-yard run and a 10-yard sprint to give the Bulldogs a 20-0 cushion. As the Wildcats started blitzing on almost every play to shut down the run, Aquin opened up the passing attack as quarterback Jonah Diemer lofted a pass to Tim Harrington good for 31 yards and a touchdown just before halftime. The only thing left to settle in the game was when the running clock would be established. Gustafson made that happen after two early scores in the third quarter on runs of 57 and 2 yards. Euell would tack on his second TD of the night as the third quarter ended. Sophomore Keegan Koester capped the Bulldogs scoring for his first varsity score in the fourth quarter as the Aquin backups played most of the final period. Barr knows a much stronger test awaits next week as Aquin travels to Polo. \"They'll be tough, but I told our young guys even though they're young, they're varsity players now,\" he said. \"If we play our game, we can hang in there.\" By Todd McKenna", "external_links": [], "published": "2015-10-03T06:56:00.000+03:00", "crawled": "2015-10-03T07:22:33.696+03:00", "highlightTitle": ""}