{"organizations": [], "uuid": "fc00eb19a366ccf82a40945c1fa11fab04249df9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-56268c0a/turbine/ct-board-of-education-lawmakers-hearing-met-20151020", "site_section": "http://www.chicagotribune.com/", "section_title": "Chicago Tribune: Chicago breaking news, sports, business, entertainment, weather and traffic - Chicago Tribune", "url": "http://www.chicagotribune.com/news/ct-board-of-education-lawmakers-hearing-met-20151020-story.html", "country": "US", "title": "Lawmaker miffed after Illinois education leaders skip meeting on perks - Chicago Tribune", "performance_score": 0, "site": "chicagotribune.com", "participants_count": 1, "title_full": "Lawmaker miffed after Illinois education leaders skip meeting on perks - Chicago Tribune", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T21:47:00.000+03:00", "replies_count": 0, "uuid": "fc00eb19a366ccf82a40945c1fa11fab04249df9"}, "author": "Diane Rado", "url": "http://www.chicagotribune.com/news/ct-board-of-education-lawmakers-hearing-met-20151020-story.html", "ord_in_thread": 0, "title": "Lawmaker miffed after Illinois education leaders skip meeting on perks - Chicago Tribune", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Illinois' state school superintendent and the chairman of the Illinois State Board of Education declined to appear before a legislative committee Tuesday morning, escalating tensions between lawmakers and education officials over costly perks given out to ISBE administrators even as public schools were struggling financially.\n\"I think this is a huge show of disrespect,\" said state Rep. Jack Franks, a Marengo Democrat who chairs the State Government Administration Committee in the House. The committee met for about half an hour despite being rebuffed by state Superintendent Tony Smith and ISBE Chairman James Meeks.\n\"I'm not going to back down,\" Franks told his colleagues on the committee. \"They're going to show up or there's going to be consequences.\"\nIn that regard, Franks raised the possibility of taking money away from the state board of education, which sends money to public schools and finances state testing and a number of education programs statewide.\n\"Perhaps our only option then is to zero out some of these perks,\" Franks said.\nIn a letter Oct. 1, Smith and Meeks, or a designee from the board, had been requested to appear before the committee to explain in public why the state board will not remove a special annual stipend from Smith's contract.\nMeeks responded in a brief letter to Franks on Monday — the day before House committee hearing — that neither man would attend.\n\"I intend to discuss your request with the members of the Illinois State Board of Education during the regular meeting scheduled for Wednesday,\" Meeks wrote.\nLawmakers ask state education officials to explain superintendent perk Diane Rado The controversy over a special stipend given to new state school Superintendent Tony Smith isn't over yet.\nLawmakers have asked Illinois State Board of Education officials to appear before a legislative committee later this month to explain why the stipend hasn't been removed from Smith's contract,...\nThe controversy over a special stipend given to new state school Superintendent Tony Smith isn't over yet.\nLawmakers have asked Illinois State Board of Education officials to appear before a legislative committee later this month to explain why the stipend hasn't been removed from Smith's contract,...\n(Diane Rado) The stipend to Smith, first revealed by the Tribune in July, could be worth about $11,000 or more on top of Smith's $225,000 salary and is meant to make up for Smith's reduced pension. Rank-and-file educators don't get the same perk. As a relative newcomer to Illinois, Smith was by law placed in the Tier II pension plan, just like most educators hired after Jan. 1, 2011. The plan has been unpopular because it has lower benefits and stricter retirement rules than traditional systems.\nFranks said the perk for Smith is inconsistent with the spirit of the law and the intent of the Tier II plan, \"and taxpayers deserve to know why\" the board gave it to Smith.\nFranks' committee had earlier pushed the state board to remove the stipend, but the board has thus far not done so.\nWith neither Smith nor Meeks at the committee, the discussion branched out to a number of education spending issues that troubled committee members, including the controversy at College of DuPage over lavish spending, perks given to local school superintendents, and a severance payment and hefty vacation payout given to former State School Superintendent Christopher Koch.\nLawmakers want new state school leader's special perk taken away Diane Rado and Monique Garcia State lawmakers are pushing the Illinois State Board of Education to take away a special stipend given to new state schools Superintendent Tony Smith that was awarded to make up for his reduced pension, a deal that outraged some educators and taxpayers.\nThe annual stipend, which could be worth...\nState lawmakers are pushing the Illinois State Board of Education to take away a special stipend given to new state schools Superintendent Tony Smith that was awarded to make up for his reduced pension, a deal that outraged some educators and taxpayers.\nThe annual stipend, which could be worth...\n(Diane Rado and Monique Garcia) Koch, who left the agency this spring, got $89,000 in severance pay, though his contract had already expired, and about $118,000 in unused vacation days, the Tribune revealed in a story published Monday. Other departing staffers also got payouts that, along with Koch's payments, added up to at least $500,000.\nFranks also questioned why Illinois has a state school superintendent earning $225,000 and an education secretary in Gov. Bruce Rauner's office earning $250,000.\n\"We have a couple of bureaucrats making in excess of a quarter million dollars,\" Franks said.\nState Rep. Robert Pritchard, R-Hinckley, said it may be appropriate to look at compensation for all taxpayer-paid administrators.\nHe also suggested that perhaps the committee could pose specific questions in a letter to the State Board of Education.\nBut Franks balked, saying education officials should show up and speak publicly.\n\"I want people in here answering questions ... and taking this out of the shadows,\" Franks said.\ndrado@tribpub.com\nCopyright © 2015, Chicago Tribune James Meeks Robert W. Pritchard Jack D Franks", "external_links": ["http://www.trbimg.com/img-55b811d4/turbine/ct-state-board-of-education-superintendent-met-20150728", "http://www.trbimg.com/img-56268c0a/turbine/ct-board-of-education-lawmakers-hearing-met-20151020", "http://www.trbimg.com/img-56144f15/turbine/ct-isbe-superintendent-contract-met-20151006"], "published": "2015-10-20T21:47:00.000+03:00", "crawled": "2015-10-20T23:21:10.788+03:00", "highlightTitle": ""}