{"organizations": [], "uuid": "3cb378bd738531ede582666880d1311db4c6603c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "wtop.com", "main_image": "http://wtop.com/wp-content/uploads/2015/10/Pile-Of-Penalties-Football.jpeg", "site_section": "http://wtop.com/section/sports/feed/", "section_title": "WTOP » Sections » Sports", "url": "http://wtop.com/nfl/2015/10/nfl-penalties-flag-increase-due-largely-to-pre-snap-fouls/", "country": "US", "title": "NFL penalties: Flag increase due largely to pre-snap fouls", "performance_score": 0, "site": "wtop.com", "participants_count": 1, "title_full": "NFL penalties: Flag increase due largely to pre-snap fouls", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T10:23:00.000+03:00", "replies_count": 0, "uuid": "3cb378bd738531ede582666880d1311db4c6603c"}, "author": "wtopstaff", "url": "http://wtop.com/nfl/2015/10/nfl-penalties-flag-increase-due-largely-to-pre-snap-fouls/", "ord_in_thread": 0, "title": "NFL penalties: Flag increase due largely to pre-snap fouls", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Home » News » Sports » NFL » NFL penalties: Flag increase… NFL penalties: Flag increase due largely to pre-snap fouls By DAVE CAMPBELL October 2, 2015 3:23 am FILE - In this Sept. 27, 2015, file photo, referee Ed Hochuli (85) talks with umpire Clay Martin during an NFL football game between the Carolina Panthers and the New Orleans Saints in Charlotte, N.C. Three games into the NFL season, yellow flags are flying. And if it seems as if it’s been popping up so far this season more than ever, well, it has. (AP Photo/Mike McCarn, File) \nWatching the NFL is a wildly popular experience, proven by massive ratings and undeterred by constant interruptions. \nCommercial breaks. Replay reviews. And, of course, penalties. \nThere’s nothing like the appearance of that yellow “flag” icon on the bottom of the screen to make the home viewer wince, and if it seems as if it’s been popping up so far this season more than ever, well, it has. \nIn 48 games over the first three weeks, according to STATS research, 878 penalties have been called. That’s an average of 18.3 per game, up from 17.1 per game during the first three weeks of 2014. Over the same span in 2013, the number was 14.8 per game. More flags typically don’t mean more fun for fans, coaches or players around the league. \nBut before the whistle is blown on the NFL for overzealous officiating, or too many striped shirts on the field, let’s take a closer look. \nFirst, consider the types of fouls fueling the increase. \nPre-snap infractions like false starts and illegal formations have risen, comprising 34.2 percent of all penalties through the first three weeks, per STATS data. The number last year over the same span was 30.3 percent. Defensive offside, for example, has jumped from 64 to 84. Offensive delay of game went from 26 to 38. \nAccording to NFL vice president of officiating Dean Blandino, preseason observations identified a pattern of illegal formations, so that foul has been a point of emphasis so far. As for those jumpy defensive ends and left tackles, well, these pre-snap penalties are about as obvious as they come. No special scrutiny required by the refs. \n“You can’t blame anyone except us on that,” said Dallas right guard Zack Martin said, alluding to a sloppy start by an offensive line that has been one of the best in the league. \nThe Cowboys are tied with Oakland for the NFL lead with eight false starts. In their Sept. 20 game against Philadelphia, the offensive line alone accounted for 10 of the franchise-record 18 penalties called. \nThe Raiders are tied with Tampa Bay for the overall league lead with 33 penalties over the first three games. \n“The pre-snap penalties are the ones that just I have very little patience for. I don’t think we should tolerate that as a team. We’re looking to eliminate those as much as possible,” Raiders coach Jack Del Rio said. \nThe big spike in penalties around the league from 2013 to 2014 was anticipated, due to the heightened emphasis on fouls like illegal contact, defensive holding and offensive pass interference. The smaller, albeit clear, increase from 2014 to 2015 is harder to quantify. The per-game number of penalties through three games is less than only the 2005 number, which was 18.5 per game, according to STATS. \n“The fact that there are more fouls … means that we are seeing more fouls,” Blandino said. “We have worked on our mechanics and our positioning, and we are identifying more fouls. We have had less questions from clubs about calls that were not made that should have been made. Historically, the majority of the questions we receive are about calls that were not made, and those questions are down so far this year.” \nShortened weeks of practice because of Monday or Thursday night games don’t help the cause. Neither do all of the injured starters, a trend that will likely never go away in this physically treacherous sport. Because of the fear of key players getting hurt, hardly any of them play in exhibition games anymore, another factor in the rusty performances that are not uncommon throughout September. \nMike Pereira, who once held Blandino’s job and now analyzes officiating for Fox broadcasts, said he’s not bothered by the early penalty spike from a quality-of-play perspective, pointing out that the rise can be almost solely attributed to league-wide sloppiness on the second week of games. The first and third weeks were consistent with past trends. \nPereira said he’s more concerned by the amount and length of replay reviews so far, which is, well, another matter for another story. \n___ \nAP NFL website: http://www.pro32.ap.org and AP NFL Twitter feed: http://www.twitter.com/AP_NFL Topics:", "external_links": [], "published": "2015-10-02T10:23:00.000+03:00", "crawled": "2015-10-02T13:26:35.945+03:00", "highlightTitle": ""}