{"organizations": [], "uuid": "fd5e6ad44a7c220ceb2fc78ce16cb9a670dd97dd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "", "site_section": "http://www.tribuneindia.com/", "section_title": "The Tribune, Chandigarh, India : Latest news, India, Punjab, Chandigarh, Haryana, Himachal, Uttarakhand, J&amp;K, sports, cricket ", "url": "http://www.tribuneindia.com/news/world/oli-expands-cabinet-by-inducting-nine-ministers/147704.html", "country": "US", "title": "Oli expands cabinet by inducting nine ministers", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "Oli expands cabinet by inducting nine ministers", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "fd5e6ad44a7c220ceb2fc78ce16cb9a670dd97dd"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/world/oli-expands-cabinet-by-inducting-nine-ministers/147704.html", "ord_in_thread": 0, "title": "Oli expands cabinet by inducting nine ministers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Kathmandu: Nepal's new Prime Minister K P Oli on Sunday expanded his cabinet by inducting nine ministers including Shakti Basent who will be the Home Minister. With the expansion, the total strength of the cabinet has reached 18. Earlier, last week when Oli formed the cabinet it had eight ministers and one minister of state. President Ram Baran Yadav administered oath of office and secrecy to the newly-appointed ministers amidst a special function at Rastrapati Bhawan, Sheetal Niwas. PTI Durga idols vandalised in Bangladesh Dhaka: Three idols of goddess Durga have been vandalised by unidentified miscreants in southern Bangladesh, the second such incident in the past two weeks as Hindus in the country kicked off their biggest festival, Durga Puja. \"They damaged the idols at a puja site in the darkness of night and fled the scene..the incident took place for the second time in the same district in the past 15 days,\" president of Bangladesh Puja Celebration Council Kajal Debnath said. PTI Kerry to push for US leadership role at UNESCO Paris: US Secretary of State John Kerry has launched a charm offensive against UNESCO in a bid to keep the US' seat on the world cultural agency's executive board. Kerry will make his case for US' re-election to a gathering of UNESCO's 195 member states and nine associate members as he travels between meetings in Italy and Spain. The State Department says it remains determined to resolve the funding issue, and that US leadership at UNESCO remains important. AP Typhoon leaves one dead, 6 missing in Philippines Manila: Slow-moving Typhoon Koppu weakened after blowing ashore with fierce winds in the northeastern Philippines on Sunday leaving at least one person dead and six others missing, while displacing 16,000 villagers, officials said. Army troops and police were deployed to rescue residents trapped in flooded villages in the hard-hit provinces of Aurora. AP", "external_links": [], "published": "2015-10-19T03:00:00.000+03:00", "crawled": "2015-10-19T02:16:30.164+03:00", "highlightTitle": ""}