{"organizations": [], "uuid": "91edb2c675f43ce7d4368bb3ab265cb254930624", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "", "site_section": "http://bostonherald.com/sports", "section_title": "Sports | Boston Herald", "url": "http://bostonherald.com/sports/high_school/2015/10/trojans_pick_off_prep", "country": "US", "title": "Trojans pick off Prep", "performance_score": 0, "site": "bostonherald.com", "participants_count": 1, "title_full": "Trojans pick off Prep | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T13:34:00.000+02:00", "replies_count": 0, "uuid": "91edb2c675f43ce7d4368bb3ab265cb254930624"}, "author": "Matt Feld", "url": "http://bostonherald.com/sports/high_school/2015/10/trojans_pick_off_prep", "ord_in_thread": 0, "title": "Trojans pick off Prep", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Trojans pick off Prep No. 2 Eagles fall in OT Matt Feld Sunday, October 25, 2015 comments Tweet Going into the playoffs, one thing every team hopes to acquire is momentum. It appears, after a 29-27 overtime win over No. 2 St. John’s Prep, that Bridgewater-Raynham has it as the Trojans head into the Division 1 South playoffs.\nThe win gave the Trojans (4-3) their third straight victory, while St. John’s Prep (6-1) suffered its first loss.\nIt looked as though the Prep was going to come away with another dramatic victory. Down 21-14 with 1:59 to go, Ollie Eberth (18-for-28 passing, 208 yards, four touchdowns, four interceptions) led the Eagles on an eight-play, 56-yard drive, capped by a 15-yard game-tying touchdown pass to Wes Rockett (12 receptions, 159 yards, three TDs).\nThe Eagles began with the ball in overtime, and faced a fourth-and-goal from the 15. Eberth rolled right, evaded a defender and found Rockett again in the back corner of the end zone.\nBut Eberth’s pass for the two-point conversion fell incomplete, opening the door for the Trojans. Jensen Vallarelli powered up the middle on second-and-goal from 5 yards out to tie the game at 27.\nOn the ensuing two-point attempt, Trojans quarterback Steve D’Emilia faked the handoff, rolled right, planted and threw across the field to the back left part of the end zone. The pass found tight end Kyle Johnson wide open for the conversion to give the Trojans the victory.\n“I thought our kids showed great resiliency the whole game. (St. John’s Prep) went up 7-0 and then we came back, and then that whole third quarter was field position. I was little disappointed in our coverages toward the end,” said Bridgewater-Raynham coach Dan Buron. “I told our kids going into the game we’re in the playoffs already, all this did was impact our seeding. I told them at halftime, this is a great way for us to get ready for the playoffs, because I think we’re getting better every week.”\nBuron has his defense to thank for this win. True, Eberth threw for four scores, but was also picked off four times — all four of them in B-R territory, including once in the red zone. Cornerback Michael McNaughton had two interceptions, while linebacker Matt Reagan had one and corner back Alex Batista another.\nTwo of those picks allowed B-R to take a 14-7 halftime lead, on a pair of TD runs by Shawn Noel (16 carries, 74 yards).\nEberth found Rockett on a 24-yard scoring strike to tie the game in the third quarter, and B-R could not move offensively. But the Trojans finally got on track, and Vallarelli scored from 5 yards out early in the fourth to give B-R a 21-14 lead.", "external_links": ["http://player.mediabong.net/se/56.js?url=", "https://twitter.com/share?text=Trojans+pick+off+Prep"], "published": "2015-10-25T13:34:00.000+02:00", "crawled": "2015-10-25T12:24:25.698+02:00", "highlightTitle": ""}