{"organizations": [], "uuid": "d5622548a8f72f97461bc78056cb11b546c8db33", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.houstonpress.com", "main_image": "http://images1.houstonpress.com/imager/u/original/7858103/fullsizerender_18_.jpg", "site_section": "http://www.houstonpress.com/news/harden-20-how-james-harden-became-houston-s-biggest-crossover-sports-celebrity-7815671", "section_title": "Harden 2.0: How James Harden Became Houston’s Biggest Crossover Sports Celebrity | Houston Press", "url": "http://www.houstonpress.com/news/faulty-eyewitness-id-put-the-wrong-man-in-jail-for-six-months-7858049", "country": "US", "title": "Faulty Eyewitness ID Put the Wrong Man in Jail for Six Months", "performance_score": 0, "site": "houstonpress.com", "participants_count": 1, "title_full": "Faulty Eyewitness ID Put the Wrong Man in Jail for Six Months | Houston Press", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T17:00:00.000+03:00", "replies_count": 0, "uuid": "d5622548a8f72f97461bc78056cb11b546c8db33"}, "author": "Meagan Flynn", "url": "http://www.houstonpress.com/news/faulty-eyewitness-id-put-the-wrong-man-in-jail-for-six-months-7858049", "ord_in_thread": 0, "title": "Faulty Eyewitness ID Put the Wrong Man in Jail for Six Months", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "EXPAND Jamario Wilson holds his one-year-old son outside of West Oaks Mall as his mom, Tiffany Wilson, looks on. Meagan Flynn Tiffany Wilson was afraid to call her son and tell him that his baby had just had his first haircut. It was yet another milestone that Jamario Wilson missed while he was sitting in the Harris County jail for a crime he did not commit. Already, he'd missed his baby’s first steps. He wasn't there the first time his son said “da-da” in giggly baby language. He missed his son's first birthday. When Tiffany decided to call about the haircut, Jamario told her it felt like he was missing his son’s entire life.\nTiffany was living in a motel at the time, as she has been since February, when supporting six kids and paying rent on her one paycheck got to be too much. She was kicked out of that motel in April and forced to find a new one after police consistently came there looking for then 21-year-old Jamario; once, they'd mistakenly drawn their guns on Jamario's brother Marcus as he ran to his car in the rain. Police were acting on an anonymous Crime Stoppers tip that Jamario was one of the men who had robbed a woman of $30,000 in cash, valuable jewelry and her cell phone around 6 a.m. on Christmas Eve. The men had tied her up and blindfolded her. Police said they had been looking for Jamario for months.\nJamario didn’t know that he'd been put on Houston’s most-wanted list, labeled a gang member, until a friend texted him a picture of his face on the news. Once police tracked him down, they brought him in with a lineup of other men who looked like him, and they asked the victim to pick out her attacker. She pointed at Jamario — and that would become the only piece of evidence police would ever rely on to charge Jamario Wilson with aggravated robbery with a deadly weapon. His trial was set for December. He faced up to 99 years in prison.\nFrom the onset, police had been circulating a picture that had been recovered on the woman’s stolen phone, which showed the face of a man with dreadlocks and little teardrop tattoos on his face. He kind of looked like Jamario, who at the time had long dreads also. The two even had a similar complexion and facial structure. But Jamario didn't have tattoos anywhere on his face. A man named Kevin Smithers, who did have those face tattoos, was shown to the victim in a second lineup. But by that point, she had already made up her mind.\nThe image of Kevin Smithers recovered on the robbery victim's stolen cellphone, which appeared on the news. Police mistook him for Jamario Wilson. Courtesy of Brett Podolsky For reasons that aren't entirely clear, it didn't seem to bother police that the man they charged with a major felony had no teardrop tats, as shown in their one piece of evidence. The DA who approved the charges apparently wasn't bothered by the discrepancy either. Neither was the jury that indicted him.\nIt was all mind-boggling to Tiffany and her son. She knew exactly where he was when the crime was committed. The night before, on December 23, Jamario was at home with her — and so were all her children. They had surprised her when she got home from work that night by prepping all the Christmas dinner food, a huge help since Tiffany had to work much of the day on Christmas Eve. It made the holiday a memorable one for the mom, who said that for the first time in recent memory, her whole family was around the table having a good time and helping her out. She could account for all of her kids for the whole night and whole morning if someone were to ask (such as police or the FBI, who didn't). Around 6 a.m. the next day, she woke up Jamario so he could go pick up his girlfriend from work at Jack in the Box — she had just finished working a long night shift.\nJamario Wilson Harris County Jail Tiffany laid all this out for the attorney she decided to hire. She paid for it with her savings — with all the money she was supposed to use to move into a new home with her kids. The attorney asked for $5,000, and Tiffany paid her first with two $1,400 money orders. “This is every dime I have,” Tiffany told the lawyer. “I need you to make this happen.”\nAll the attorney had to do was go to court and compare Jamario’s face with the face of the tattooed man and it would be over. Tiffany suggested she could also try to pull some video footage at Jack in the Box and talk to his girlfriend and the employees there, and also pull Jamario’s cell phone records from that morning. The lawyer promised everything would work out.\nInstead, she never showed to meet Jamario, and when Tiffany didn’t pay her the rest of the money, the attorney withdrew from the case. Tiffany never saw the money again. In roughly two months, all the attorney really did was inform Jamario that, if he wanted, he could take a plea deal of 25 years and be done — much better than life, of course. The idea sent Tiffany into so much distress that she took a leave from work. She had to start seeing a therapist. She started taking medication, because she couldn't wrap her head around the fact that her grandson could be a grown man, older than Jamario is now, by the time Jamario was free again.\nBut then Brett Podolsky was appointed to the case in August, and he immediately knew that the police had got it wrong. He took one look at the cellphone picture, one look at Jamario and thought, How did no one catch this?\nWithin a month, Podolsky put together a packet of evidence and simple photographs that would set Jamario free and presented it to the prosecutors. It was a risky decision, Podolsky said, because oftentimes, prosecutors will use that information to their advantage to find a way to still convict the person. So Podolsky did his due diligence, interviewing multiple witnesses who confirmed that the man in the cell-phone picture was Kevin Smithers, who was actually sitting in the Galveston County jail for aggravated assault with a deadly weapon at that very moment. “If you're gonna turn stuff over to the prosecution prior to trial, it better be checkmate,” he said.\nKevin Smithers Galveston County Jail It was. Still, Jamario waited in jail for two more weeks before prosecutors even interviewed Smithers in Galveston, who admitted that he was the man in the photograph. Then, right as Podolsky filed a writ, they finally dismissed the case. On October 15, Jamario was released after six months in the Harris County jail, where, Jamario alleges, detention officers would curse him out and threaten to rip up his pictures and mail, just to get under his skin. He says he got thrown in isolation, where he had no blanket and no cot, for mouthing off to a guard after the guard snatched his do rag off his head, just to remind him who was in charge. “I feel like dogs get treated better than we did,\" he said. \"You're just a number to them.”\nWhen Jamario was released, he, his mother and Podolsky all hoped the state would apologize. A letter, a phone call — something. If not that, Jamario said, he is considering filing a civil suit for the pain they put his mother through, the way they put his life on pause, depriving him of some of the most memorable moments of fatherhood. No apology came.\n“That fact alone, the idea that he’s been sitting in a steel cage for six months for a crime he did not commit, seems to be lost on people in the criminal justice system,\" Podolsky said. \"No one really seems to think it’s a big deal. ‘Okay, we’ll dismiss it — bye.’ Not like, ‘Oh my God, that is horrible. I can’t believe we were a part of that injustice.’ Most of my colleagues would just say, ‘Dude, get over it — what are you expecting? A letter of apology?’ Well, you know what? Yes.”\nJamario says he tried to tell them so many times that he didn't do it. When they wouldn’t listen, he started reading the Bible, hoping God would. He went to Christian classes. He started praying.\nIt was a change of pace for Jamario, who is now 22. In high school, he racked up a bad reputation and a criminal record — once spending a few days in jail after hitting the assistant principal. He was once charged with assault with a deadly weapon (the case was ultimately dismissed), and once spent a month in jail for giving a fake name to police. But when his son was born, Jamario was ready to change for good. Working full time at Wendy's, he and his girlfriend had just saved up enough money to move into an apartment, ready to raise their baby together.\nNow that he's been released, Jamario says he feels like he's been granted a second chance at life. He plans to go back to college, to get a job and to work hard to help his family move back into a home soon. Eventually, he wants to become a welder, and he also might try to make some music. He wrote upwards of 50 songs — many of them about missing his baby grow up — while he was sitting in jail.\nThe first thing he did when he was released was rush home to hold his son. And then he watched him walk on his own.", "external_links": [], "published": "2015-10-20T17:00:00.000+03:00", "crawled": "2015-10-20T20:25:18.624+03:00", "highlightTitle": ""}