{"organizations": [], "uuid": "c7200d3793474f85f1dba02885f9e12c504a1947", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "http://www.bostonherald.com/sites/default/files/media/2015/10/12/101215tuftstf02.jpg", "site_section": "http://bostonherald.com/sports", "section_title": "Sports | Boston Herald", "url": "http://bostonherald.com/sports/other/2015/10/huddle_out_of_crowd", "country": "US", "title": "Huddle out of crowd", "performance_score": 0, "site": "bostonherald.com", "participants_count": 1, "title_full": "Huddle out of crowd | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "c7200d3793474f85f1dba02885f9e12c504a1947"}, "author": "Dan Keats , Tufts 10k", "url": "http://bostonherald.com/sports/other/2015/10/huddle_out_of_crowd", "ord_in_thread": 0, "title": "Huddle out of crowd", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Tufts Health Plan 10K for Women annually brings together a top field of runners.\nThat yesterday’s race also served as the USA Track & Field 2015 10K Women’s Championship only upped the quality for the 39th running.\nMolly Huddle quickly got out in front of the field and captured her fourth Tufts title in a time of 31:21, setting a course record and the American 10K road record.\nWith temperatures in the low 70s and nobody to push her, Huddle’s hopes of breaking 31:03 went by the wayside.\n“I was trying to hold a 5:00 pace or under and I just couldn’t do it past two miles and that just made the end feel a lot harder,” said Huddle. “I was kind of trying to follow the truck and grind it out and hope Emily (Sisson) didn’t catch me in the end.”\nHuddle ran the first 2 miles in 9:58 before her pace fell off. Unable to challenge Flanagan’s mark as she had hoped, yet there was no need to look over her shoulder for competitors as she came toward the finish on Charles Street.\nHuddle gained a bit of infamy this summer at the world championships in Beijing when she pulled up just before the finish line in the 10,000 meters and was passed, costing her a bronze medal.\nSince returning from worlds, she has won the national title in the 20K, 5K and last weekend’s 10-mile event.\n“The last two years I feel like, worlds aside, have been really smooth and I feel like if I can keep this going next year I’ll be in a good spot at the Olympics,” Huddle said. “I’m just going to keep doing what I’m doing, try not to get hurt and stack more good months on top of each other until next year.”\nHuddle plans to go for the U.S. national 12K next month in Alexandria, Va.\nSisson, a Providence College graduate who trains in Rhode Island with Huddle, was the runner-up in 32:18.\n“I went out a bit faster than I was probably ready for, but that’s OK, I’m just testing out my fitness now. It’s only my second road race,” Sisson said. “It was good to know even though I could feel it hurting a bit earlier than I wanted to, I could still run strong and not panic and to finish second, which was the goal.”\nSentayehu Ejigu of Ethiopia, whose 2013 winning time of 31:33 stood as the course record until Huddle’s performance, finished third in 32:37.\nRunning legend Joan Benoit Samuelson, a four-time Tufts winner, was among the field of approximately 5,000 runners and greeted finishers after she completed the course, which runs through the Back Bay and over the Mass. Ave. Bridge into Cambridge. Her time was 39:02.\nThe race included a visually impaired category for the first time.\nThe biggest cheers of the day were reserved for 6-year-old Madelyn Wilson, who competed in the wheelchair division and finished in 1:16:36.", "external_links": [], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-13T09:00:45.034+03:00", "highlightTitle": ""}