{"organizations": [], "uuid": "da268dfecebf4b02b0aed92feea2df0e9429a9d3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.brownsvilleherald.com", "main_image": "http://bloximages.newyork1.vip.townnews.com/brownsvilleherald.com/content/tncms/assets/v3/editorial/4/13/41346484-31b1-11e5-a962-4340561ec630/54dd75e0d2bf5.image.jpg", "site_section": "http://www.brownsvilleherald.com/search/?q=&t=article&l=25&d=&d1=&d2=&s=start_time&sd=desc&c[]=sports/local*&f=rss", "section_title": "Brownsville Herald - sports/local", "url": "http://www.brownsvilleherald.com/sports/local/article_94363a06-7552-11e5-8e47-f7dbd0c5a974.html", "country": "US", "title": "UTRGV News: Durham breaks program record in loss to Utah Valley", "performance_score": 0, "site": "brownsvilleherald.com", "participants_count": 1, "title_full": "UTRGV News: Durham breaks program record in loss to Utah Valley", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T06:30:00.000+03:00", "replies_count": 0, "uuid": "da268dfecebf4b02b0aed92feea2df0e9429a9d3"}, "author": "UTRGV SERVICES", "url": "http://www.brownsvilleherald.com/sports/local/article_94363a06-7552-11e5-8e47-f7dbd0c5a974.html", "ord_in_thread": 0, "title": "UTRGV News: Durham breaks program record in loss to Utah Valley", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "UTRGV News: Durham breaks program record in loss to Utah Valley UTRGV SERVICES Brownsville Herald \nEDINBURG — Senior Haley Durham broke the program record for career block assists, but the University of Texas Rio Grande Valley Vaqueros volleyball team lost 25-23, 25-21, 22-25, 25-23 to the Utah Valley University Wolverines on Saturday at the UTRGV Fieldhouse. \nDurham recorded five block assists to bring her career total to 255, passing Danielle Holthe (250, 2002-05) atop the leaderboard. \nDurham broke the record on the third serve of the first set when she combined with sophomore Bojana Mitrovic on a block to make it 2-1 Vaqueros (8-13, 1-6 WAC). \nAlready the program’s all-time leader in blocks per set (0.82), Durham finished with six blocks to increase her career total to 313 and pass Stephanie Redd (310, 2002-05) and Holthe (312) for second place. Lisa Yanez (1993-96) holds the record with 323. \nDurham also had seven kills, five digs and two aces. \nMitrovic led the Vaqueros in kills for the 15th time this season with 18 to go along with eight digs, three blocks and three aces. Junior Alisha Watson had 12 kills with three blocks, and freshman Alexandra Ecker posted with a career-high tying 10 kills on .600 hitting and two blocks. \nAbby Jensen led the Wolverines (9-10, 5-2 WAC) with 16 kills on .297 hitting. Lauren Bakker had 10 kills with eight blocks. Lexi Thompson also had 10 kills. \nThe Vaqueros led early in the first set, going up 8-5 on a Mitrovic kill. Then, after a Jensen kill sparked a 4-0 run to give the Wolverines the lead, an Ecker kill retied the set at 9. After some back-and-forth play, the Vaqueros used a kill and an ace by Mitrovic as well as a Watson kill to break a tie and go up 18-15. The Wolverines, however, used four Jensen kills to power a 9-3 run and pull away for the victory. \nThe Vaqueros led 3-0 out of the gate during the second set, but the Wolverines scored the next three to tie it. Durham responded with a kill and an ace to put the Vaqueros on top before a Mitrovic kill restored their three-point lead at 9-6. The Vaqueros still led 16-14 on an Ecker kill, but a Jensen kill sparked a 6-1 run as the Wolverines took a 2-0 lead. \nAfter going down 0-2 during the third set, the Vaqueros scored four straight points as part of an 8-3 run to go up 10-5 on a kill by junior Megan Dempsey. The Vaqueros extended their lead to seven on a Mitrovic ace that made it 17-10. The Wolverines responded with a 10-4 run to pull within 21-20 on a Sabrina Tanner ace, but a pair of Mitrovic kills helped the Vaqueros stop the run and take the set. \nThe Vaqueros had the early lead during the fourth set as well, going up 4-2 on a Durham kill, 9-6 on a Mitrovic kill, and 13-9 on an error. The Wolverines responded with an 8-1 run to go up 17-14 on Madison Dennison’s kill, but Watson’s kill sparked a 3-0 run as the Vaqueros tied it. The set was still tied at 19 when the Wolverines scored four of the next five points to go up 23-20. The Vaqueros used kills by Mitrovic and Watson followed by a block by Durham and Watson to tie it, but Bakker’s kill and an error ended the match. \nThe Vaqueros are back in action at 7 p.m. Monday when they close out non-conference play at New Orleans. \n— UTRGV Services \nGreenwood, Minc lead women’s tennis \nSAN MARCOS — Senior Reegan Greenwood and sophomore Natacha Minc finished in first and third place, respectively, to the lead the University of Texas Rio Grande Valley Vaqueros women’s tennis team at the Texas State Play Date on Saturday at the Bobcat Tennis Complex. \nAwards were given to the top three players based on if they won all three matches, fewest sets lost and fewest games lost throughout the day. \nThe Vaqueros combined for seven singles victories and two doubles victories Saturday. Greenwood opened the first round with a 6-2, 6-0 win over UTSA’s Sonia Madronal and followed that with a 6-1, 6-0 win over Prairie View A&M’s Maria Lackey during the second round. \nMinc also won both matches on the day after defeating Prairie View A&M’s Dannick Boyogueno 6-2, 6-2 during the first round. In the second round, Minc defeated UTSA’s Caitlyn Resendiz 6-4, 6-4. \nGreenwood and Minc also combined for a doubles win as they teamed up to defeat the team of Prairie View A&M’s Sydney Thomas and Texas State’s Bianca Birkenstcok 8-6. \nSophomore Dominique Esparza added a singles win after recording a 5-7, 6-4, 10-3 win over UTSA’s Charleen Tiwari during the first round. Adding another win was freshman Dominique Ibarra who, after dropping her first-round match, bounced back with a 6-3, 4-6, 10-7 win over Texas State’s Joy Chia Ming Ming in the second round. \nEsparza and Ibarra teamed up for a doubles win after they defeated Prairie View A&M’s Trinity Randolph and Shaddae Findley 8-1. \nFreshman Daria Pentsova notched a first-round win with a 6-4, 6-2 victory over Prairie View A&M’s Timara Maxwell. \nThe Vaqueros will be back in action when they travel to compete in the Intercollegiate Tennis Association Texas Regional on Oct. 22 in College Station. \n— UTRGV Services \nUTRGV men’s tennis sends two teams to title match \nBEAUMONT — The University of Texas Rio Grande Valley Vaqueros men’s tennis team will have two doubles teams in the championship match Sunday after winning their semifinal matches on the second day of the Ron Wesbrooks Invitational on Saturday at the Thompson Family Tennis Center. \nJunior Juan Cruz Soria and sophomore Elliot Johnstone teamed up to defeat Incarnate Word’s Joey Vatanadilok and Francisco Bendana during the semifinal match in Flight 1 doubles. Cruz and Johnstone will face Lamar’s Lucas Grubelnig and Benny Schwizer for the Flight 1 championship. \nThe Vaqueros’ other doubles team of sophomore Ethan Ammon and freshman Yehonathan Kaufman will play for the Flight 2 championship after they defeated Incarnate Word’s Ryan Hoverson and Zachary Vander Heiden 6-0 in a semifinal. Ammon and Kaufman will face Lamar’s Trey Crysel and Jeandre Hoogenboezem for the championship Sunday. \nIn singles, freshman Cosme Jubera recorded a 6-1, 6-0 win over Zachary Vander Heiden in Pool B of Flight 3. \nThe Vaqueros will be back in action on the final day of the Ron Wesbrooks Invitational starting at 9 a.m. Sunday with doubles championship matches. \n— UTRGV Services", "external_links": [], "published": "2015-10-18T06:30:00.000+03:00", "crawled": "2015-10-24T15:26:27.883+03:00", "highlightTitle": ""}