{"organizations": [], "uuid": "ec7001f2d0dc4a4caffbe82882e841b58adaedad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "http://s2.reutersmedia.net/resources/r/?m=02&d=20151015&t=2&i=1087102460&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXNPEB9E03I", "site_section": "http://www.reuters.com/news/sports", "section_title": "Sports News, Highlights &amp; Coverage | Reuters.com", "url": "http://www.reuters.com/article/2015/10/15/us-baseball-playoffs-royals-idUSKCN0S908520151015", "country": "US", "title": "Royals beat Astros in Game 5 to win ALDS", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Royals beat Astros in Game 5 to win ALDS | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T07:48:00.000+03:00", "replies_count": 0, "uuid": "ec7001f2d0dc4a4caffbe82882e841b58adaedad"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/10/15/us-baseball-playoffs-royals-idUSKCN0S908520151015", "ord_in_thread": 0, "title": "Royals beat Astros in Game 5 to win ALDS", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(The Sports Xchange) - Johnny Cueto stepped up big-time on the big stage, holding the Houston Astros to two hits over eight innings as the Kansas City Royals won 7-2 in the fifth and decisive game of the American League Division Series.\nThe Royals advance to the AL Championship Series, where they will meet the Toronto Blue Jays, who eliminated the Texas Rangers earlier on Wednesday. The series begins on Friday at Kauffman Stadium.\nCueto, who was acquired in a July 26 trade with the Cincinnati Reds, retired the final 19 batters he faced after third baseman Luis Valbuena hit a two-run homer in the second inning. It was the only mistake Cueto made.\nThe right-hander walked none and struck out eight, his high in 15 starts with the Royals, including two starts in the ALDS.\nWhile Cueto was brought in to be the staff ace, he was disappointing until Wednesday.\nIn one five-game stretch, all losses, Cueto had an earned-run average higher than 9.00, and overall he was 4-7 with a 4.76 ERA in 13 regular-season starts for Kansas City.\nHowever, when the Royals needed him the most -- win or go home -- Cueto came through. It was his first postseason victory. He was 0-2 with a 5.52 ERA in his four previous playoff starts.\nRoyals right fielder Alex Rios, who had only 32 RBIs in 105 regular-season games, provided the key hit, a two-run double in the three-run fifth inning that gave Kansas City the lead.\nDesignated hitter Kendrys Morales put an exclamation point on the game with a three-run homer off Astros 20-game winner Dallas Keuchel with two outs in the eighth.\nKeuchel, who was brought in to keep Houston's deficit at a manageable 4-2, yielded a leadoff double to Alcides Escobar and intentionally walked Lorenzo Cain before Morales drilled a 2-2 slider over the left field fence.\nMorales, who led the Royals with 106 RBIs in the regular season, hit three home runs in the ALDS.\nKansas City closer Wade Davis worked a flawless ninth to set up a thunderous roar before 40,566 fans.\n(Compiled by Peter Rutherford)", "external_links": [], "published": "2015-10-15T07:48:00.000+03:00", "crawled": "2015-10-15T06:57:18.764+03:00", "highlightTitle": ""}