{"organizations": [], "uuid": "3eca795d0d5a5c01bf7de5ec44648ce4a712db2d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtontimes.com", "main_image": "", "site_section": "http://www.washingtontimes.com/rss/headlines/sports/", "section_title": "www.washingtontimes.com stories: Sports", "url": "http://www.washingtontimes.com/news/2015/oct/9/bills-running-back-mccoy-says-he-could-miss-3-more/", "country": "US", "title": "Bills running back McCoy says he could miss 3 more games", "performance_score": 0, "site": "washingtontimes.com", "participants_count": 1, "title_full": "Bills running back McCoy says he could miss 3 more games", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T23:29:00.000+03:00", "replies_count": 0, "uuid": "3eca795d0d5a5c01bf7de5ec44648ce4a712db2d"}, "author": "JOHN WAWROW", "url": "http://www.washingtontimes.com/news/2015/oct/9/bills-running-back-mccoy-says-he-could-miss-3-more/", "ord_in_thread": 0, "title": "Bills running back McCoy says he could miss 3 more games", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bills running back McCoy says he could miss 3 more games By JOHN WAWROW - Associated Press   \nORCHARD PARK, N.Y. (AP) - LeSean McCoy can’t outrun an injury to his left hamstring that could potentially sideline the star Buffalo running back for another month. \nMcCoy said Friday the medical staff gave him a three- to four-week timetable to recover from the injury he aggravated during practice Sept. 24. That could delay his return until after the Bills come back from their bye week off to host the Dolphins on Nov. 8. \nMcCoy referred to himself as “a quick healer,” but acknowledged he doesn’t want to rush back too soon from what’s been diagnosed as a Grade 2 pull. That’s the mistake McCoy said he made in playing in Buffalo’s season-opener Sept. 13 after he was initially hurt during a joint practice with the Cleveland Browns on Aug. 18. \n“Yeah, I think I just made it worse,” McCoy said, sitting at his locker. “I’d rather come back 100 percent and get the player that everybody was expecting instead of being out there on one leg. That’s truth.” \nMcCoy was limited the first three games of the season, when he was eventually sidelined during a 41-14 win at Miami on Sept. 27. He’s already been ruled out for Sunday, when Buffalo (2-2) plays at Tennessee (1-2). \nThe Bills acquired McCoy in a trade that sent linebacker Kiko Alonso to Philadelphia in March. The NFL’s 2013 yards rushing leader was brought in to become a central figure in a revamped offense that was expected to rely on a run-heavy attack under new coach Rex Ryan. \nMcCoy has instead been used sparingly, and has 43 carries for 146 yards, along with seven catches for 83 yards and a touchdown. \nThe Bills will also be minus rookie running back Karlos Williams, who has been ruled out after a concussion from a 24-10 loss to the New York Giants last weekend. \nThird-stringer Boobie Dixon will lead a patchwork group of running backs rounded out by Dan Herron, who was signed on Tuesday, and Cierre Wood, who was promoted from the Bills practice squad last week. \nSammy Watkins’ status is uncertain because of a strained right calf that forced the receiver to miss last week’s game. Watkins is listed as questionable after he said he took part in only about four snaps in practice Friday. He intends to work out before the game to test the injury. \nWatkins cautioned he might play only in what he called “an emergency,” in the event another receiver is sidelined by injury. Receivers Percy Harvin (hip), Chris Hogan (hamstring) and Marquise Goodwin (ribs) are listed as probable. \nStarting safety Aaron Williams is set to return after missing two games with a neck injury. Starting right guard John Miller is also set to return after missing one game with a groin injury. \nCoach Rex Ryan said he intends to have both kickers active - Dan Carpenter and Billy Cundiff. Cundiff was signed this week after the Bills released kickoff specialist Jordan Gay. Cundiff is also in contention to take over place-kicking duties if Carpenter continues to struggle. \nCarpenter has missed five of seven field-goal attempts, including a 30-yarder last week, and an extra-point try. \nRyan said the Bills will wait until Monday before determining to activate or cut linebacker IK Enemkpali, who finished his four-game suspension for violating the NFL’s player-conduct policy. Enemkpali was suspended for a locker-room punch in August that broke the jaw of New York Jets quarterback Geno Smith. The NFL granted the Bills a one-week exemption for Enemkpali.", "external_links": [], "published": "2015-10-09T23:29:00.000+03:00", "crawled": "2015-10-10T00:28:11.113+03:00", "highlightTitle": ""}