{"organizations": [], "uuid": "83b576f3b23ea502bebb970d0d2b66ffec4c31d7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.startribune.com", "main_image": "http://stmedia.stimg.co/ows_144410170753414.jpg?h=630&amp;w=1200&amp;fit=crop&amp;bg=999&amp;crop=top", "site_section": "http://www.startribune.com/sports/index.rss2", "section_title": "Sports", "url": "http://www.startribune.com/a-solution-to-the-twins-joe-mauer-problem/331496821/", "country": "US", "title": "Souhan: A solution to the Twins' Joe Mauer problem", "performance_score": 1, "site": "startribune.com", "participants_count": 1, "title_full": "Souhan: A solution to the Twins' Joe Mauer problem - StarTribune.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T07:56:00.000+03:00", "replies_count": 0, "uuid": "83b576f3b23ea502bebb970d0d2b66ffec4c31d7"}, "author": "JEFF WHEELER, Star Tribune file", "url": "http://www.startribune.com/a-solution-to-the-twins-joe-mauer-problem/331496821/", "ord_in_thread": 0, "title": "Souhan: A solution to the Twins' Joe Mauer problem", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Paul Molitor, progeny of Cretin-Derham Hall, earned a nickname as a Hall of Fame player:\nThe Ignitor. (Baseball players are not always good spellors.)\nJoe Mauer, progeny of Cretin-Derham Hall, deserves a new nickname as a player once headed to the Hall of Fame:\nThe Obstructor.\nOnce a franchise player, Mauer has become the bottleneck on the Twins’ talent highway.\nMauer not only is no longer what the Twins need him to be, he is the Luddite standing in the way of progress.\nMauer is a first baseman and No. 3 hitter. He is no longer good enough to be either. He isn’t just performing poorly. He is blocking the way of those who would perform better.\nGeneral Manager Terry Ryan said this week he is optimistic that Mauer can hit .300 again. This is based more on hope than logic. If Mauer was ever going to waken the echoes of his glory days, it logically would have happened in 2015.\nHe was healthy enough to play every day. He was relieved of the corrosive effects of catching. He performed like a journeyman.\nIn 2015, Mauer posted career lows in batting average, on-base percentage and OPS. He was average at best as a fielder.\nAs his prime draws to a close, Mauer is the boat you buy when times are good and can’t get rid of when times are bad. He has a no-trade clause. His wife is from St. Paul. His extended family attends his games. He is as unmovable as a redwood.\nIf Mauer were merely performing poorly, he would be a problem. This particular problem is compounded by the Twins’ increasing depth and talent.\nIf the Twins were to draw up a lineup to win today, they would play Trevor Plouffe at third base and Miguel Sano at first. That would leave Mauer two places at which he could possible play: Designated hitter, where his offensive statistics would again make him a liability; or right field, where he would block the re-signing of Torii Hunter, the shifting of Aaron Hicks, or the ascension of Max Kepler, Adam Brett Walker or possibly even a revamped Oswaldo Arcia.\nMauer doesn’t fit in left field, where Eddie Rosario has earned a job, and the Twins can’t conscientiously move Mauer back to catcher after making the case that the position was bad for his long-term health.\nTo review: The Twins don’t have a position for him and can’t trade him. So what do they do?\nMy solution: Make Mauer what he is most suited to be, regardless of his remaining compensation. Make him a super-utility player. Tell him to bring every variety of glove to spring training. Have him prepare to play at third base, first base, left field, right field and DH. Also tell him to prepare to be a pinch hitter when he’s out of the lineup.\nKeep Plouffe at third. Play Sano at first, which might be the best position for their best hitter long-term. Bring back Hunter for one more season. Trade Hicks, now or eventually, if you can get value for him, because there is still no guarantee that he knows what it takes to be a long-term success.\nPlay Mauer once or so a week at third, first, left, right and at DH. Bat him seventh, or maybe second, where long at-bats that lead to singles might be more productive.\nRepurposing Mauer will allow him to fit more sensibly into the Twins’ roster plans for the next three years.\nRepurposing Mauer will also place a firm cleat on his posterior.\nWhether because of the franchise’s personality or because of necessity, the Twins have coddled Mauer. Telling him to bring multiple gloves to spring training might provide the incentive or warning he needs to break out of his career torpor.\nThe Twins might also want to suggest that a modern-era first baseman need to hit the weights and prepare himself to hit baseballs over walls, rather than at infielders.\nMaybe the Twins can salvage something from Mauer’s contract. This much is certain: Wherever they play him, he can’t perform much worse.", "external_links": ["http://www.twitter.com/SouhanStrib"], "published": "2015-10-09T07:56:00.000+03:00", "crawled": "2015-10-09T09:55:32.051+03:00", "highlightTitle": ""}