{"organizations": [], "uuid": "7d44468a8c37466160e83f8b5927f3b48fb7c216", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.newstribune.com", "main_image": "http://jeffcity.media.clients.ellingtoncms.com/static/newstribune/images/news-tribune90x90.jpg", "site_section": "http://newstribune.com//rss/headlines/sports/", "section_title": "newstribune.com stories: Mid-Missouri and National Sports", "url": "http://www.newstribune.com/news/2015/oct/23/prep-football-north-callaway-gets-district-6-remat/", "country": "US", "title": "Prep Football: North Callaway gets District 6 rematch with Van-Far", "performance_score": 0, "site": "newstribune.com", "participants_count": 1, "title_full": "Prep Football: North Callaway gets District 6 rematch with Van-Far", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T10:50:00.000+03:00", "replies_count": 0, "uuid": "7d44468a8c37466160e83f8b5927f3b48fb7c216"}, "author": "Ryan Boland", "url": "http://www.newstribune.com/news/2015/oct/23/prep-football-north-callaway-gets-district-6-remat/", "ord_in_thread": 0, "title": "Prep Football: North Callaway gets District 6 rematch with Van-Far", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Download podcast \nNorth Callaway used a bountiful running attack and a bruising defensive effort to manhandle the Indians. The Thunderbirds — spurred by junior running back Wyatt Branson and senior running back Tyler Mattes — rolled up 328 yards on the ground and the North Callaway defense limited Van-Far to a skimpy 66 yards of total offense in logging the shutout. \n“I think it was the first game where we played all four quarters — solid offensively and defensively,” Thunderbirds head coach Kevin O’Neal said. “I think they (players) felt it, the improvement on Friday night, how they played well together. \n“It’s a good time for them to do that. Hopefully this week we just continue to build upon that and do our best (tonight).” \nO’Neal emphasized how North Callaway ran with authority last week. Branson picked up a game-high 151 yards on only six carries that featured a pair of long touchdown runs, while Mattes finished with 88 yards in 16 attempts and also scored twice. \nJunior quarterback Milo Henry rushed for 52 yards on seven carries and junior running back J.T. Higgins had 32 yards in four attempts before exiting the game with a dislocated finger in the second quarter. O’Neal expects Higgins to be available tonight. \n“No. 1, the offensive line did an excellent job in controlling the line of scrimmage,” O’Neal said. “The second thing is, our running backs, every one of them that touched the ball … were running downhill and they were running for tough yards. \n“Early in the year, they had a tendency to try to run sideline to sideline and bounce things outside. What I really liked on Friday night was our guys were downhill, finding the first hole and getting towards the end zone.” \nIf the Thunderbirds plan to duplicate their success running the ball, it will start again with the blocking. \n“We just need to continue to control the line of scrimmage,” O’Neal said. “There were some assignments that we missed up front on Friday night, that we looked at on film, and we’ll make sure that we get those assignments right. \n“Even when they did miss those assignments, they were still getting on somebody and moving them. That’s what pleased me the most.” \nThe Thunderbirds’ defense limited Van-Far to minus-6 yards rushing by congesting the middle and then not giving the Indians any freedom on the perimeter. Forced to throw the ball, sophomore quarterback Parker Wallace and his freshman backup, Caden Wilburn, were a combined 9-of-24 for 72 yards and were sacked three times. \n“When we play as a unit, we are very solid against the run,” O’Neal said. “They couldn’t get anything going.” \nWith Van-Far’s inability to run the ball with any effectiveness last week, O’Neal won’t be surprised to see more of its passing game tonight. \n“(Indians) Coach (Blake) Logan does a good job of changing things up and trying to adjust with the personnel he has,” O’Neal said. “I know he’s down a lot of guys with injuries and other things going on this year, but he’s always done a good job of game-planning. \n“So I expect him to come up with a solid game plan and we’re going to have to execute to stop.” \nIn tonight’s other District 6 openers, top-seeded and 10th-ranked Palmyra (7-2) hosts No. 8 seed Montgomery County (0-9), No. 2 Clark County (6-3) will be at home against No. 7 Clopton/Elsberry (2-7), and No. 3 Bowling Green (5-4) plays a home game against No. 6 Highland (3-6). \n“We get to play a game at home, which is awesome, especially for our seniors,” O’Neal said. “It’s a home playoff game that I think we can have some success in, so it’s one week at a time now. \n“You do what you can for this week and play your heart out, and hopefully you make it to next week.” \nNorth Callaway hosts Van-Far - Updates on Twitter: @FultonSunSports \nPodcast", "external_links": [], "published": "2015-10-23T10:50:00.000+03:00", "crawled": "2015-10-23T14:36:03.768+03:00", "highlightTitle": ""}