{"organizations": [], "uuid": "8c5c18dab6b1c0b438d66f7786321728f711c0b4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "wtop.com", "main_image": "http://wtop.com/wp-content/uploads/2015/10/Michigan-St-Rutgers-Football4.jpeg", "site_section": "http://wtop.com/section/sports/feed/", "section_title": "WTOP » Sections » Sports", "url": "http://wtop.com/ncaa-football/2015/10/rutgers-carroo-returns-from-suspension-with-3-td-game/", "country": "US", "title": "Rutgers’ Carroo returns from suspension with 3-TD game", "performance_score": 0, "site": "wtop.com", "participants_count": 1, "title_full": "Rutgers’ Carroo returns from suspension with 3-TD game", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T08:24:00.000+03:00", "replies_count": 0, "uuid": "8c5c18dab6b1c0b438d66f7786321728f711c0b4"}, "author": "wtopstaff", "url": "http://wtop.com/ncaa-football/2015/10/rutgers-carroo-returns-from-suspension-with-3-td-game/", "ord_in_thread": 0, "title": "Rutgers’ Carroo returns from suspension with 3-TD game", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Rutgers’ Carroo returns from suspension with 3-TD game By MATT SUGAM October 11, 2015 1:24 am Rutgers interim head coach Norries Wilson talks with Rutgers quarterback Chris Laviano (5) after Laviano spiked the ball on fourth down with seconds left in the second half of an NCAA college football game ageinst Michigan State, Saturday, Oct. 10, 2015, in Piscataway, N.J. Michigan State won 31-24. (AP Photo/Mel Evans) \nPISCATWAY, N.J. (AP) — Leonte Carroo returned from a two-game suspension the same way he came off a half-game suspension to open the season. He was Rutgers’ best player. \nCarroo scored three touchdowns, just as he did in the second half of the season-opener, but it wasn’t enough for Rutgers in a 31-24 loss to No. 4 Michigan State on Saturday night. \n“He added a bunch. He caught some big balls. He did a good job blocking. He did a good job finishing plays,” interim coach Norries Wilson said. “I’m sure he’s going to be very sore tomorrow, just working out a lot different than going out and banging and hitting guys all night and having contested throws, and he brought a lot of energy to the stadium with his play and he brought a lot of energy to the sideline with his play.” \nThis was the final game of a three-game suspension being served by Rutgers coach Kyle Flood, who was penalized for trying to influence a professor on a player’s grade. \nCarroo was just happy to back on the field. He was reinstated Wednesday after simple assault charges were dropped from a Sept. 12 incident outside the stadium \n“I was very excited to get out of there for my team,” said Carroo, who had seven catches for 134 yards. “It’s unfortunate that we lost, but I was just very excited all day. Had a lot of momentum going into this game.” \nUltimately, the pendulum swung in Michigan State’s favor. \nFreshman LJ Scott scored on a 3-yard run with 43 seconds to play and Michigan State won ugly for the second straight week. \nThe win came just a week after the Spartans hung on for a 24-21 victory over a Purdue team that is struggling, and it saw them drop two spots in the poll. \nThis one isn’t going to help. However, Rutgers sees it as a proving ground. \n“We got to come back in on Sunday and lock in and have more attention to details because at the end of the day that’s how you get beat in this league. Obviously we proved today it’s not a talent thing,” Carroo said. “It’s just who can play with better details longer.” \nScott, who did not play in the first half because of a knee injury, also scored on a 1-yard run to help the Spartans (6-0, 2-0 Big Ten) win their 10th straight game. \nConnor Cook completed 23 of 38 passes for a season-high 357 yards — one less than his career best — and two touchdowns. He came up with a 29-yard third-down pass to R.J. Shelton on third down on the winning 76-yard drive. \nShelton made the catch despite blanket coverage by defensive back Andre Hunt. \n“I tried to trust my technique like the coaches tell us, but the other guy made a great catch,” Hunt said. “I tried to do the best I can to get it out and he just came up with a great play.” \nChris Laviano and Carroo combined on TD passes of 5, 39 and 28 for the Scarlet Knights (2-3, 0-2). \n“Carroo made some big plays. Some of it was him and some of it was us.” Michigan State head coach Mark Dantonio said. \nLaviano finished 15 of 24 for 208, but he capped the night by spiking the ball on fourth down, securing the Spartans win. The coaching staff took blame for the play. \n“I got sacked, and then I looked over to the sideline, coaches told me to spike it, I looked over, it was really fast after I got up, I looked over to the sideline, there was still third down on the sticks, told me to spike it and I spiked it,” Laviano said. \nAaron Burbridge had a season-best nine catches for 146 yards for Michigan State, which also got an 8-yard TD catch by Macgarrett Kings Jr. \nTrailing 24-14 with less than 6 minutes left in the third quarter, Rutgers rallied and eventually tied the game with 4:21 left in regulation in a 22-yard field goal by Kyle Federico. \nOn the play before the field goal, Spartans cornerback Arjen Colquhoun knocked a pass out of Carroo’s hands to force the field goal. \nCarroo had closed the gap to three points with his third touchdown catch, a 28-yarder on which he was wide open. \nAfter an error-prone first half by Michigan State, Cook steadied things in the third quarter leading them on scoring drives of 73 and 51 yards. Scott capped the first drive with a 1-yard run and Cook found DeAnthony Arnett from 25-yards out for the second. Topics:", "external_links": [], "published": "2015-10-11T08:24:00.000+03:00", "crawled": "2015-10-11T09:24:11.052+03:00", "highlightTitle": ""}