{"organizations": ["Football Club Barcelona", "FCB Studio", "FCB", "FCB Studio Tawasol", "FC Barcelona", "Google"], "uuid": "c481974a778e41fcaf7ad753f1683c84853743fd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "prmac.com", "main_image": "", "site_section": "http://prmac.com/rss-channel-63.htm", "section_title": "prMac: Sports", "url": "http://prmac.com/release-id-76964.htm", "country": "US", "title": "Tawasol and FC Barcelona officially announce the launch of FCB Studio", "performance_score": 0, "site": "prmac.com", "participants_count": 0, "title_full": "Tawasol and FC Barcelona officially announce the launch of FCB Studio", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T12:30:00.000+03:00", "replies_count": 0, "uuid": "c481974a778e41fcaf7ad753f1683c84853743fd"}, "author": "", "url": "http://prmac.com/release-id-76964.htm", "ord_in_thread": 0, "title": "Tawasol and FC Barcelona officially announce the launch of FCB Studio", "locations": ["California", "Tawasol", "Cupertino", "Santa Clara"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Tawasol", "Levi", "Osama Moustafa", "Laurent Colette"], "text": "Tawasol and FC Barcelona officially announce the launch of FCB Studio October 6, 2015 in Sports [prMac.com] Cupertino, California - Tawasol, the leading mobile application developer, has announced the launch of FCB Studio, a new, official mobile app of Football Club Barcelona (FCB). The launch event took place at Levi's Stadium in Santa Clara, and was attended by Mr. Laurent Colette, Chief Commercial Officer of FCB as well as leaders of Tawasol, the app developer. The app is designed to help the football club engage more deeply with its global multilingual fan base across social and digital spaces.\"FCB Studio allows fans of the club to create custom images with FCB stars, share those images on their own social networks, and connect with FCB fans worldwide,\" said Osama Moustafa, CEO of Tawasol. \"With new content being updated every day, this is the must-have app for any true FC Barcelona supporter, it allows fans access to hundreds of new, constantly updated images of FCB players, and lets them connect with a community of millions of FC Barcelona fans worldwide.\" Moreover, FCB Studio users who create and share the best photos, as decided by other fans, can receive prestigious fan rankings as well as special promotions including free FCB merchandise. The top ten ranked images will be in the running to win a trip of Camp Nou, FC Barcelona's legendary home stadium.\"FCB Studio App raises the bar on fan engagement for FCB - letting fans create their own experiences and share their custom images\" said Mr. Laurent Colette, Chief Commercial officer of Football Club Barcelona. \"Football Club Barcelona has amazing fans all over the world, speaking countless different languages. FCB Studio, which is available in 14 languages, will now offer the fans the opportunity to share their passion through the universal language of photos and images. We are very excited with today's official launch and we are waiting anxiously to witness the creativity and interaction of our fans worldwide.\" Device Requirements: * iPhone, iPad, and iPod touch * Requires iOS 6.0 or later * 39.0 MB Pricing and Availability: FCB Studio 1.4.2, the innovative experience to connect and engage FC Barcelona fans around the globe, is Free and available worldwide through the App Store in the Sports category. There is also an Android version available on Google Play. It will be available for both BlackBerry and Windows as well.", "external_links": [], "published": "2015-10-06T12:30:00.000+03:00", "crawled": "2015-10-06T13:58:43.328+03:00", "highlightTitle": ""}