{"organizations": [], "uuid": "b9f9621a3e89dc8159a14c12339e8daf1f36e80d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostinno.streetwise.co", "main_image": "http://wp.streetwise.co/wp-content/uploads/2015/10/bernie-in-boston-rally-oct-2015-by-kyle-gibson-630x354.jpg", "site_section": "http://bostinno.streetwise.co/feed/", "section_title": "BostInno | Boston News, Tech, Startups, Sports, Lifestyle", "url": "http://bostinno.streetwise.co/2015/10/05/bernie-sanders-in-boston-1st-christmas-decorations/", "country": "US", "title": "Boston Download: Sam's New IPA, Xmas Decoration Sighting, Bernie Doubled Obama's Turnout", "performance_score": 0, "site": "streetwise.co", "participants_count": 1, "title_full": "Boston Download: Sam's New IPA, Xmas Decoration Sighting, Bernie Doubled Obama's Turnout", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T13:02:00.000+03:00", "replies_count": 0, "uuid": "b9f9621a3e89dc8159a14c12339e8daf1f36e80d"}, "author": "BostInno", "url": "http://bostinno.streetwise.co/2015/10/05/bernie-sanders-in-boston-1st-christmas-decorations/", "ord_in_thread": 0, "title": "Boston Download: Sam's New IPA, Xmas Decoration Sighting, Bernie Doubled Obama's Turnout", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bernie Sanders' October 2015 Boston rally (photo by Kyle Gibson). \nBernie Sanders Doubles Obama's Headcount in Boston Rally \nAbout 20,000 Massachusetts residents turned out for a rally with Democratic presidential candidate Bernie Sanders at the Boston Convention and Exhibition Center, Saturday, according to the Boston Globe . In a similar rally in his historic 2008 run for the presidency, POTUS Barack Obama drew 10,000 to Boston Common. Minnesota Rep. Eugene McCarthy appears to hold the record, drawing 45,000 to Fenway Park in 1968 for his anti-Vietnam campaign, according to the Globe. Our own Kyle Gibson snapped the above pic. Read more on the rally . \nSam's New Double IPA Is Making Beer Distributors Nervous \nIn a style that's growing in popularity, Sam Adams' new offering will resemble New England's famed Heady Topper--a double IPA in a 16-oz. can with high alcohol content. Chairman and co-founder Jim Koch told us Rebel Raw IPA is a \"very hoppy, really big IPA\"--but with a freshness policy that for a larger brewer like Sam comes as a twist. Koch said he's figuring out how $SAM can pull its new, unfiltered double from shelves after 35 days, to preserve its hoppy goodness. Beer distributors aren't going to like this. Read the story here . \nYes, the First Christmas Decorations Are Up \nUniversal Hub spotted them at a Star Market in Dedham, Sunday night: A snowman balloon and green garlands in the \"pumpkin-spiced lobby.\" Take a look . A rendering of the proposed construction, from the filing. \nHarvard Business School Wants to Replace Burden Hall \nThe business school filed plans with the Boston Redevelopment Authority on Friday to replace Burden, built in 1971, with two new buildings, an auditorium and a classroom/meeting space building. The two are named, respectively, Klarman Hall and the G2 Pavilion. Klarman is pegged at 81,000 square feet, G2 at 18,000 to 24,000. Both buildings would sit across the parking lot from Western Ave. Read Harvard's filing . \nU.S. AG Shows Up at MassChallenge to Announce Anti-IP Crimes Initiative \nTurns out, U.S. Attorney General Loretta E. Lynch was at MassChallenge in Boston on Friday to announce that the Justice Department is starting a new initiative to fight against intellectual property crimes in collaboration with businesses. She said the DOJ is giving $3.2M in grants to ten jurisdictions across the country, consisting of local and county police departments, a state attorney's office and state police agencies. None of them include jurisdictions in Massachusetts, but hey, it's cool that the the AG showed up at one of our top startup accelerators. Here's her speech . Here's the press release . — Dylan Martin \nA Gold Medalist Explains Why New England Slopes Are World Cup Level \nBoston has the most active ski and snowboard population of any major city in the country. But no FIS World Cup ski racing event has been held in New England (or on the East Coast for that matter) in 25 years. A gold-medal skier wonders, why is that? Read the interview with Mikaela Shiffrin . Don't just live in Boston, experience it.", "external_links": [], "published": "2015-10-05T13:02:00.000+03:00", "crawled": "2015-10-05T14:55:51.302+03:00", "highlightTitle": ""}