{"organizations": ["Peter Abraham Globe", "Boston Globe", "Red Sox"], "uuid": "4c9537bd58b7a4a1f86bbfb9738227eed89ede24", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bostonglobe.com", "main_image": "http://c.o0bg.com/rf/image_585w/Boston/2011-2020/2015/10/23/BostonGlobe.com/Sports/Images/88c95f44e5fa47f2ae2f49cbd78f46ad-7fc61116ce0142beb8d64ec9e27bc01f-0.jpg", "site_section": "http://news.google.com/news?pz=1&cf=all&ned=us&hl=en&topic=s&output=rss", "section_title": "Sports - Google News", "url": "https://www.bostonglobe.com/sports/2015/10/23/john-farrell-says-ready-manage-red-sox-again/xPWzL98OzBJLaoBegTmDIP/story.html", "country": "IL", "title": "John Farrell says he's ready to manage Red Sox again - The Boston Globe", "performance_score": 0, "site": "bostonglobe.com", "participants_count": 0, "title_full": "John Farrell says he's ready to manage Red Sox again - The Boston Globe", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T21:19:00.000+03:00", "replies_count": 0, "uuid": "4c9537bd58b7a4a1f86bbfb9738227eed89ede24"}, "author": "", "url": "https://www.bostonglobe.com/sports/2015/10/23/john-farrell-says-ready-manage-red-sox-again/xPWzL98OzBJLaoBegTmDIP/story.html", "ord_in_thread": 0, "title": "John Farrell says he's ready to manage Red Sox again - The Boston Globe", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["John Farrell"], "text": "Already a subscriber? Members Sign In John Farrell says he’s ready to manage Red Sox again By Peter Abraham Globe Staff October 23, 2015 \nHis voice again strong, Red Sox manager John Farrell described how he often spent 7-10 hours a day receiving chemotherapy at Massachusetts General Hospital to combat an aggressive strain of cancer. \nTreatments normally administered over six months were condensed into eight weeks as a cocktail of seven drugs were poured through an intravenous line. \nHis body weakened but not his spirit. Moments of despair were pushed away. \n“To hell with that,” Farrell said on Friday in a call with writers. \nNow the Stage 1 non-Hodgkin’s Burkitt lymphoma is in remission and Farrell is preparing for the 2016 season without restrictions. Five days of organizational meetings start on Saturday in Arizona and Farrell will be at the table, giving his opinion. \nMore than ever, he is eager for spring training and putting his uniform back on. \n“This has been a unique experience to say the least,” Farrell said during a conference call with reporters. “It’s been humbling . . . A life-changing event.” \nFarrell, 53, learned Thursday about the remission. He will have further tests every three months for at least a year, but all indications are positive. \n“The likelihood and probability of a cure continues to grow,” Farrell said. “There’s a high level of confidence that will be achieved based on history, based on my individual case.” \nFarrell is walking 2 to 3 miles up to five times a week and has a good appetite. His strength is returning and his hair is slowing growing back. \n“It was a very intense and concentrated regimen,” Farrell said. “It beat me up a little bit physically. But honestly right now feeling pretty darn good.” \nHe feels pretty fortunate, too, given the circumstances. \nFarrell suffered a hernia on Aug. 6 in New York and had what he thought would be routine surgery in Detroit on Aug. 10 during a day off. That proved to be potentially life-saving. \nDr. Gary B. Talpos, a surgeon at Henry Ford Hospital, discovered the cancer. After further tests in Boston, the diagnosis was confirmed three days later and Farrell took leave as manager. \n“I was in a little bit of a state of denial. Certainly disbelief. Things were happening way, way too fast,” Farrell said. “I really didn’t feel any symptoms.” \nDuring the initial consultation with Dr. Jeremy Abramson, who directs MGH’s lymphoma center, it became overwhelming. \n“I said, ‘Hey, Doc, time out for a second.’ I needed to take a deep breath,” Farrell said. “There are a lot of quiet moments, a lot of reflection. A lot of the simple things in life begin to gain a greater appreciation. \n“We live in a pretty fast-paced world. What it causes you to do is kind of slow down and take a personal inventory [and] see what is important around you.” \nOnce he recovered from the initial shock, Farrell said the treatment progressed as expected, all the way to Thursday’s relief-inducing PET scan. \n“Dr. Abramson was phenomenal through this,” Farrell said. “There were no surprises. He’s an incredibly intelligent and talented physician.” \nDuring his treatment, Farrell watched every Red Sox game and communicated daily with interim manager Torey Lovullo, helping make decisions about the team. \nLovullo led the Sox to a 28-20 record and was rewarded with a two-year contract extension after agreeing not to pursue managerial openings for at least a year. \n“It says a lot about Torey and his commitment here,” Farrell said. \nThe Red Sox won the 2013 World Series under Farrell but are 149-175 since with two last-place finishes. Farrell is under contract through 2017 but will be under pressure to reverse the team’s slide. \nIf not, the Sox could turn to Lovullo. But Farrell isn’t concerned with perceptions. \n“Some people have asked if this is going to be an awkward situation,” he said. “I would clearly say, ‘No, it’s not.’ He’s a trusted guy; he’s a talented guy. In my mind, and I’m sure in minds of many, [he’s] going to manage his own team when that right opportunity presents itself.” \nLovullo was a constant source of support. But many others stepped forward. \nFormer Red Sox president Larry Lucchino, who survived cancer, visited Farrell in the hospital. Sox owners John Henry and Tom Werner sat with Farrell in his office at Fenway Park and pledged their support. \nIndians manager Terry Francona, a longtime friend, contacted Farrell via phone or text message every day. \n“Every single day!” Farrell said. “I can’t thank him enough.” \nMinnesota Timberwolves coach Flip Saunders, who is fighting lymphoma and stepped away from his position, became a confidante. Oklahoma City Thunder general manager Sam Presti, a Massachusetts native, reached out, as did Indianapolis Colts coach Chuck Pagano, who battled leukemia. \nOne letter writer told Farrell a remarkable story, that their father saw news of the manager’s cancer and decided to get a persistent pain in his groin checked out. It proved to be lymphoma. \n“I know there’s a message in here and an awareness that can be further heightened,” Farrell said. \nEven some Yankee fans sent notes to Fenway Park wishing him well. \n“It has a way of stripping down all those walls,” Farrell said. “When you see the human side of people coming out it certainly gives you a boost.” Peter Abraham can be reached at pabraham@globe.com . Follow him on Twitter @peteabe . Get Today’s Headlines from the Globe in your inbox: Please enter a valid email address Thank you for subscribing to Today's Headlines! Loading comments...", "external_links": [], "published": "2015-10-23T21:19:00.000+03:00", "crawled": "2015-10-24T00:55:20.908+03:00", "highlightTitle": ""}