{"organizations": [], "uuid": "a1323ef9bb78a324aebeb2e91555acbc364899e9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/k/5/y/2/0/image.related.articleLeadwide.620x349.gkatrf.png/1444963591603.jpg", "site_section": "http://www.smh.com.au/sport/us-sports", "section_title": "US Sports | American Football, Baseball, Basketball, NHL, NFL, NBA &amp; MLB", "url": "http://www.smh.com.au/sport/us-sports/jarryd-hayne-could-be-named-firstchoice-running-back-for-san-francisco-49ers-20151016-gkatrf.html", "country": "AU", "title": "Jarryd Hayne could be named first-choice running back for San Francisco 49ers", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "Jarryd Hayne could be named first-choice running back for San Francisco 49ers", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "a1323ef9bb78a324aebeb2e91555acbc364899e9"}, "author": "The Sydney Morning Herald", "url": "http://www.smh.com.au/sport/us-sports/jarryd-hayne-could-be-named-firstchoice-running-back-for-san-francisco-49ers-20151016-gkatrf.html", "ord_in_thread": 0, "title": "Jarryd Hayne could be named first-choice running back for San Francisco 49ers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Return to video Video settings Please Log in to update your video settings\nVideo will begin in 5 seconds.\nDon't play Play now More video Recommended Moody Mourinho makes new media vow\nWellington Phoenix player scores a wonder goal from outside the box\nSky Blues win Sydney Derby\nPhoenix edge Roar\nRWC 2015: Folau, Pocock named to face Pumas\nReplay video Return to video Video settings Please Log in to update your video settings\nHayne takes his chance against NY Giants He didn't get a run until the second half but Jarryd Hayne makes the most of his limited game time against the NY Giants on October 12.\nPT0M50S 620 349 The A to Z of Jarryd Hayne The beginner's guide to NFL Jarryd Hayne could be included as the first-choice running back for the San Francisco 49ers this weekend in just his sixth game in the NFL.\nTwo of Hayne's teammates, Carlos Hyde and Reggie Bush, have been plagued by injury, presenting Hayne with the opportunity to potentially start at running back when the 49ers take on the Baltimore Ravens at home on Sunday (Monday AEDT).\nNFL rookie Jarryd Hayne will be playing in his sixth game on Sunday. Photo: Getty Images\nThe San Jose Mercury News reported that Hyde missed team training on Wednesday due to a foot injury, while Bush continued to suffer from an aggravated calf injury.\nAdvertisement Hayne was taking first hand-offs from quarterback Coli ﻿ n Kaepernick at training, the San Joe Mercury News reported, prompting speculation the rookie could be named as the starting running back.\nHayne has only played five regular season NFL games since converting from rugby league, but during the 49ers' game last week, the former Parramatta Eels star came within just four yards of a touchdown .\nThomas McGaughey, the 49ers' special teams co-ordinator, said after that game that it was just a matter of time before Hayne caught a punt and returned it for a touchdown.\nThe 49ers have a good chance of ending their four-game losing streak on Sunday when they take on the Ravens. Both teams have had one win and four losses this season.\nMeantime, retired 49ers legend Joe Montana said his former team had made a mistake in letting go of former head coach Jim Harbaugh at the start of the year.\nHarbaugh was replaced by Jim Tomsula, who was instrumental in bringing Hayne to the 49ers.\nMontana told Fox Sports Radio that the 49ers' had been struggling since Harbaugh's departure.\n\"Here's a guy who been very successful for you quickly,\" Montana said.\n\"He put a good team together. Now he's gone and they're struggling. Players are leaving. Players are leaving? Is that Harbaugh's fault? I don't think so.\"\nFairfax Media", "external_links": ["http://blogs.mercurynews.com/49ers/2015/10/14/practice-report-rbs-hyde-bush-not-participating-so-hayne-taking-first-team-snaps/", "http://www.foxsports.com/nfl/story/san-francisco-49ers-joe-montana-jim-harbaugh-colin-kaepernick-101515"], "published": "2015-10-16T03:00:00.000+03:00", "crawled": "2015-10-24T20:58:25.156+03:00", "highlightTitle": ""}