{"organizations": [], "uuid": "44e97889591086f913819e3196ebad01124a8023", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news.com.au", "main_image": "http://cdn.newsapi.com.au/image/v1/e57b7b3a285d8f160ba06a181a3869cc", "site_section": "http://www.news.com.au/sport", "section_title": "Sport | Sports News and Results | News.com.au", "url": "http://www.news.com.au/sport/football/leeds-united-owner-sacks-fifth-manager-during-tenure-at-club-then-is-disqualified-himself/story-fndkzvnd-1227575803385", "country": "AU", "title": "Leeds United manager Uwe Rosler sacked, Steve Evans appointed, sixth manager sacked, Massimo Cellino disqualified", "performance_score": 0, "site": "news.com.au", "participants_count": 1, "title_full": "Leeds United manager Uwe Rosler sacked, Steve Evans appointed, sixth manager sacked, Massimo Cellino disqualified", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T22:44:00.000+03:00", "replies_count": 0, "uuid": "44e97889591086f913819e3196ebad01124a8023"}, "author": "Staff writers with Sky Sports’ Adam Bate", "url": "http://www.news.com.au/sport/football/leeds-united-owner-sacks-fifth-manager-during-tenure-at-club-then-is-disqualified-himself/story-fndkzvnd-1227575803385", "ord_in_thread": 0, "title": "Leeds United manager Uwe Rosler sacked, Steve Evans appointed, sixth manager sacked, Massimo Cellino disqualified", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Video Image EPL Goals of the Week: Round nine 2:53 EPL: The top five goals from round nine of the Premier League.\nOctober 20th 2015 13 hours ago /video/video.news.com.au/Sport/Football/EPL/ Massimo Cellino has been disqualified as Leeds United owner just minutes after sacking his fifth manager at the club.\nStaff writers with Sky Sports’ Adam Bate FOX SPORTS IT is football politics at its tantalising best — a club owner sacks his fifth manager in 18 months, before the owner himself is disqualified by the league he is so desperate to win.\nDespite sounding so fanciful it cannot possibly be true, it is in fact a brief summation of the predicament of Leeds United, the club who once flirted with the Premier League summit when represented by stars such as Harry Kewell and Mark Viduka in the early 2000s.\nThe club’s owner Massimo Cellino has, for the second time, failed the Football League’s Owners’ and Directors’ test. A tax conviction in his native Italy was his latest undoing.\nThe disqualification came just minutes after he appointed ex-Rotherham manager Steve Evans as the sixth man to take charge of his football team during his tenure at the club and on the same day he sacked Uwe Rosler on the back of three successive defeats.\nUwe Rosler has been sacked from his post as Leeds United manager.\n“I watched the game on Saturday and in the second half, we were just trying not to lose. We were not trying to win. That is not good enough,” Cellino told the Daily Mirror.\n“I did my best to help Uwe, but in the end, I could not see even a patch of blue in the sky, just cloud, cloud and cloud.”\nThe tumultuous state of affairs has led to calls from Leeds’ fans for Cellino to sell off his controlling share of the club — something he is unlikely to do while mounting a likely challenge to his disqualification.\nBut in the meantime, the task in front of Evans — the man who oversaw Rotherham’s charge from League Two to a mid-table Championship outfit in three years at the helm — appears enormous.\nShould he fail to satisfy Cellino with instant result, he may find himself facing a similar wrath to the five managers — Brian McDermott, Dave Hockaday, Darko Milanic, Neil Redfearn and Rosler — who have been previously dismissed by the Italian from their Elland Road post.\nHarry Kewell in action for Leeds United in the early 2000s.\nWhile such a number may seem extreme, Cellino has form. He came to Leeds with a well-established reputation having gone through 36 coaches during his reign at Cagliari.\nWith the man known as ‘the manager eater’ in his home country having dispensed with yet another manager, we take a look at his Leeds history.\nTHE MANAGER EATER’S LEEDS UNITED BUFFET\nFrom Sky Sports’ Adam Bate\nBrian McDermott (Apr 2013 — May 2014)\nRecord: P55 W21 D9 L25\nCellino sacked his first Leeds boss before he had even taken over at the club. In late January, with speculation linking him with a takeover, the Italian sought to end Brian McDermott’s time as manager. There was considerable confusion because the deal had not gone through and so Cellino was not entitled to make the decision.\nThe League Managers’ Association said: “Brian received a call last night from a solicitor informing him that Leeds United were terminating his contract as manager. This morning Brian received a further phone call from a director of the football club stating the company on whose behalf the solicitor had contacted Brian are not the owners of Leeds United.”\nMcDermott eventually limped through to the end of the 2013/14 season but was criticised for taking a holiday at the end of the campaign — “Who’s managing this club?’ Brian, where’s Brian?” - and finally left by mutual agreement at the end of May. Cellino insisted he wanted a head coach rather than a manager.\nBrian McDermott was Massimo Cellino’s first casualty at Leeds.\nDave Hockaday (Jun 2014 — Aug 2014)\nRecord: P6 W2 D0 L4\nIn June 2014, Cellino appointed Dave Hockaday as the club’s new head coach. It was a surprise decision given that, despite a lengthy coaching career, the then 56-year-old’s only managerial experience had come at non-league Forest Green Rovers. Hockaday signed a two-year contract but survived just six games at the helm.\nAfter a 4-1 defeat at Watford in Hockaday’s fourth league game in charge, Cellino considered sacking the head coach but said he would be a “coward” to do so, arguing that it was “too simple” to axe him. Within a week, the decision was reversed. “I had to change my mind,” said Cellino. He spent only 70 days as Leeds’ head coach.\nDarko Milanic (Sep 2014 — Oct 2014)\nRecord: P6 W0 D3 L3\nDespite Neil Redfearn winning three of his four games as a caretaker, Cellino elected to appoint Slovenian coach Darko Milanic as Hockaday’s replacement. A four-time title winner in his homeland with Maribor, his most recent job had been a fifth-placed finish with Austrian club Sturm Graz. Milanic signed a two-year deal and became Leeds’ first non-British or Irish manager.\nAfter six games in charge, Milanic was sacked. He failed to win a single match as Leeds boss and lasted only 32 days in the job, ‘beating’ the 44-day record set by both Brian Clough and Jock Stein. “I want to apologise to the supporters,” said Cellino. “They deserve better results.”\nDarko Milanic lasted 32 days as Leeds manager.\nNeil Redfearn (Nov 2014 — May 2015)\nRecord: P33 W11 D7 L15\nRedfearn’s success as a caretaker led to Cellino entrusting him with the role on a one-year contract with the option of a further year. The team had been 18th when he was appointed but Redfearn managed a slight improvement — taking them up to a final position of 15th in the Championship. It was not enough for Cellino.\nThe owner had been disqualified by the Football League during Redfearn’s reign, but returned as chairman in May — relieving the coach of his job within a matter of weeks. “He’s like a baby,” Cellino told the Sunday Mirror. “He is not a bad person but he has a weak personality.”\nUwe Rosler (Jul 2015 — Oct 2015)\nRecord: P12 W2 D5 L5\nIn May, former Brentford and Wigan boss Uwe Rosler agreed a two-year deal to take over as Leeds boss with the club highlighting his “strong reputation” in English football. But the German has become the latest managerial casualty at Elland Road, winning only two of his 12 games in charge.\nAs recently as last month, Cellino had publicly backed Rosler and suggested time was on his side. “He’s doing a beautiful job,” said Cellino. “It’s a team that when it’s ready, it’s going to fly. We are starting to build a team and a new mentality. We know that when you want to build something, you need to do the foundations and that takes more time.”\nRead more here: http://www.skysports.com/football/news/11096/10034882/uwe-rosler-just-the-latest-leeds-boss-sacked-by-massimo-cellino\n The catastrophe that has become Leeds United", "external_links": ["http://cdn.newsapi.com.au/image/v1/9eaddf418e9ba1a76d4a14436f0de3c9", "http://cdn.newsapi.com.au/image/v1/c3d57366fa912d695e8d5e1d1bc9748e", "http://cdn.newsapi.com.au/image/v1/origin:fatwire.", "http://cdn.newsapi.com.au/image/v1/cd51793c1ce1c06afceed108c3778a4b", "http://cdn.newsapi.com.au/image/v1/external?url=http%3A%2F%2Fcontent4.video.news.com.au%2Ffoxsports%2Fprod%2Farchive%2F2015%2F10%2F20%2FGOTW09-1_1445288945747_1936.jpg&width=650&api_key=kq7wnrk4eun47vz9c5xuj3mc", "http://www.foxsports.com.au/football/leeds-united-owner-sacks-fifth-manager-during-tenure-at-club-then-is-disqualified-himself/story-e6frf423-1227575803385", "http://cdn.newsapi.com.au/image/v1/4534229f7fe241b16be5e5e90679cd3a", "http://cdn.newsapi.com.au/image/v1/e57b7b3a285d8f160ba06a181a3869cc", "http://www.foxsports.com.au/", "http://www.skysports.com/football/news/11096/10034882/uwe-rosler-just-the-latest-leeds-boss-sacked-by-massimo-cellino", "http://widgets.outbrain.com/outbrain.js"], "published": "2015-10-20T22:44:00.000+03:00", "crawled": "2015-10-20T13:46:38.034+03:00", "highlightTitle": ""}