{"organizations": [], "uuid": "8e41a5c343e57f8f386e81bab0f1d8f193e80198", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.hurriyetdailynews.com", "main_image": "http://www.hurriyetdailynews.com/images/news/201510/n_89896_1.jpg", "site_section": "http://www.hurriyetdailynews.com/sports.aspx?pageID=608", "section_title": "Hürriyet Daily News | SPORTS", "url": "http://www.hurriyetdailynews.com/us-to-continue-its-support-for-the-pyd.aspx?PageID=238&NID=89896&NewsCatID=352", "country": "TR", "title": "US to continue its support for the PYD - MIDEAST", "performance_score": 0, "site": "hurriyetdailynews.com", "participants_count": 1, "title_full": "US to continue its support for the PYD - MIDEAST", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "8e41a5c343e57f8f386e81bab0f1d8f193e80198"}, "author": "NEW YORK – Doğan News Agency", "url": "http://www.hurriyetdailynews.com/us-to-continue-its-support-for-the-pyd.aspx?PageID=238&NID=89896&NewsCatID=352", "ord_in_thread": 0, "title": "US to continue its support for the PYD - MIDEAST", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Russian army informs Turkish military about Oct 3, 4 air space violations\nIraqi forces in major push against ISIL\nFrance says Iran missile test 'worrying' violation of UN resolution The United States will continue its support for groups that are “proving effective against ISIL [the Islamic State of Iraq and the Levant] in Syria,” State Department Spokesperson John Kirby has said in his answer to a question regarding U.S. aid to the Democratic Union Party (PYD).\n“The focus in Syria for the United States and the other 60-plus members of the coalition is counter-ISIL. And we will continue to appropriately support those groups that are proving effective against ISIL inside Syria,” Kirby stated during a press briefing on Oct. 14.\nThe question underlined a contradiction between statements by State Department Deputy Spokesperson Mark Toner and PYD leader Salih Muslim on recipients of U.S. ammunition airdrops.\nWhile Toner argued that the ammunition was provided to Syrian Arabs, Muslim told the Turkish press that the PYD and its allies have been receiving U.S. airdrops.\nMeanwhile, when asked about Turkish Prime Minister Ahmet Davutoğlu’s statement on Oct. 14 that ambassadors from Russia and the U.S. have been summoned regarding their ties with Kurdish forces in Syria, Kirby refrained from an outright confirmation.\n“We continue to talk to the Turkish government about their concerns, specifically with respect to the Syrian Kurds,” he stated.\nA statement from the U.S. Department of Defense confirming airdropping material to the PYD on Oct. 11 had met with a harsh reaction from Turkey.\n“As the ally countries would not tolerate excuses for arms support to al-Qaeda-affiliated groups, Turkey cannot excuse any armed support to groups linked to the PKK. It certainly cannot allow any tolerance in this matter,” Davutoğlu stated during a press conference on Oct. 14.", "external_links": [], "published": "2015-10-15T03:00:00.000+03:00", "crawled": "2015-10-15T22:10:25.260+03:00", "highlightTitle": ""}