{"organizations": [], "uuid": "8ed44fdcc2ead73ee8c9d8c39ca2b363278731c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/47529300.cms", "site_section": "http://timesofindia.indiatimes.com/sports/articlelist/4720866.cms", "section_title": "Top Stories - Tennis - Sports - The Times of India", "url": "http://timesofindia.indiatimes.com/sports/tennis/top-stories/Yuki-Somdev-for-Pune-ATP-Challenger/articleshow/49260613.cms", "country": "IL", "title": "Yuki, Somdev for Pune ATP Challenger", "performance_score": 0, "site": "indiatimes.com", "participants_count": 1, "title_full": "Yuki, Somdev for Pune ATP Challenger - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:57:00.000+03:00", "replies_count": 0, "uuid": "8ed44fdcc2ead73ee8c9d8c39ca2b363278731c9"}, "author": "timesofindia.indiatimes.com", "url": "http://timesofindia.indiatimes.com/sports/tennis/top-stories/Yuki-Somdev-for-Pune-ATP-Challenger/articleshow/49260613.cms", "ord_in_thread": 0, "title": "Yuki, Somdev for Pune ATP Challenger", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "PUNE: Davis Cuppers Yuki Bhambri and Somdev Devvarman would spearhead the Indian charge at the USD 50,000 KPIT ATP Challenger to be held here from October 24-31.\nApart from Yuki and Somdev, Saketh Myneni, Ramkumar Ramnathan, Sanam Singh and Junior Wimbledon doubles champion Sumit Nagal will be among the other Indians who would be seen in action at the MSLTA-organised event.\nTop players and Davis Cuppers from 25 countries, including James Ward of England (who is on the British team for the 2015 Davis Cup finals), Yanick Mertens of Belgium (member of the Belgian Davis Cup team to play in the finals), former world no 65 Evegeny Donskoy of Russia and Adrian Menendez-Maceiras of Spain have entered the fray.\nThe final acceptance list in the tournament, to be held at the Shiv Chattrapathi Mhalunge Balewadi Tennis Complex, would be out two weeks before the event, said tournament director and MSLTA's secretary, Sunder Iyer, in a media release. The event is being jointly organised by the Maharashtra State Lawn Tennis Association (MSLTA), Pune Metropolitan District Tennis Association (PMDTA), in association with the Directorate of Sports and Youth Services of the Maharashtra government.\nThis is the second year running that the tournament is being held here. \"We expect 10 Indian players in the main draw including the wildcards giving Indian players an opportunity to compete at world class level and that too on the home turf,\" said Iyer.\nThe Challenger offers USD 7,200 (Rs 4,71,00) and 80 ATP points to the winner while the runner-up gets USD 4,053 (Rs 2,65,000) and 55 ATP points. The qualifying rounds would be played on October 24 and 25 before the main draw of the event gets underway on October 26.\nItalian Roberto Ranieri, who is also the referee for the Rome ATP, would be the ATP Supervisor for the event, the release added. Stay updated on the go with Times of India News App. Click here to download it for your device.", "external_links": ["https://play.google.com/store/apps/details?id=com.toi.reader.activities"], "published": "2015-10-08T03:57:00.000+03:00", "crawled": "2015-10-08T16:52:00.842+03:00", "highlightTitle": ""}