{"organizations": ["Facebook Royals", "Rogers Centre", "Royals", "LinkedIn Pinterest Royals", "Blue Jays", "Jays Facebook Email Twitter Google"], "uuid": "2ce37aa9290152f1aa37f0861106d0feed16f4cf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usatoday.com", "main_image": "http://www.gannett-cdn.com/-mm-/1473ffec71c4d202b87efe42b10a70455068d531/c=0-24-3960-2261&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/10/20/USATODAY/USATODAY/635809632920459662-USATSI-8872660.jpg", "site_section": "http://rssfeeds.usatoday.com/UsatodaycomSports-TopStories", "section_title": "USATODAY - Sports Top Stories", "url": "http://www.usatoday.com/story/sports/mlb/2015/10/20/royals-batter-blue-jays-again-pull-within-one-game-world-series-alcs/74296276/", "country": "US", "title": "Royals one game from World Series after beating Jays", "performance_score": 0, "site": "usatoday.com", "participants_count": 0, "title_full": "Royals one game from World Series after beating Jays", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T02:47:00.000+03:00", "replies_count": 0, "uuid": "2ce37aa9290152f1aa37f0861106d0feed16f4cf"}, "author": "", "url": "http://www.usatoday.com/story/sports/mlb/2015/10/20/royals-batter-blue-jays-again-pull-within-one-game-world-series-alcs/74296276/", "ord_in_thread": 0, "title": "Royals one game from World Series after beating Jays", "locations": ["USA"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Alcides Escobar", "Ben Zobrist", "John E. Sokolowski"], "text": "Facebook Email Twitter Google+ LinkedIn Pinterest Royals batter Blue Jays again, pull within one game from World Series Breaking down the American League Championship Series Game 4 between the Blue Jays and Royals from Rogers Centre: Post to Facebook Royals batter Blue Jays again, pull within one game from World Series Breaking down the American League Championship Series Game 4 between the Blue Jays and Royals from Rogers Centre: Check out this story on USATODAY.com: http://usat.ly/1LJp0UW Cancel Send A link has been sent to your friend's email address. Posted! A link has been posted to your Facebook feed. Join the Nation's Conversation To find out more about Facebook commenting please read the Conversation Guidelines and FAQs Royals batter Blue Jays again, pull within one game from World Series Steve Gardner , USA TODAY Sports 7:47 p.m. EDT October 20, 2015 Ben Zobrist and Alcides Escobar celebrate after Zobrists two-run home run in the first inning. (Photo: John E. Sokolowski, USA TODAY Sports) CONNECT TWEET LINKEDIN COMMENT EMAIL MORE \nTORONTO – Breaking down the American League Championship Series Game 4 between the Blue Jays and Royals from Rogers Centre: \nRoyals 14, Blue Jays 2 , Royals lead series, 3-1. \n*** \nThe final: The Royals came out swinging against Jays starter R.A. Dickey from the opening pitch. Ben Zobrist hit a two-run homer as the first four Kansas City batters all scored in the first. \nDickey recorded just five outs before being pulled from the game. Although the Blue Jays looked like they might slug their way back, Royals starter Chris Young was effective enough over 4 2/3 innings to turn a three-run lead over to his lock-down bullpen. \nLorenzo Cain extended his postseason hitting streak to 13 games, getting on base four times and driving in three runs as the Kansas City offense never slowed down. \n*** \nState of the Series: The Royals will go for the clincher Wednesday on Toronto’s home turf with right-hander Edinson Volquez on the mound. Volquez baffled the Blue Jays bats in Game 1 in Kansas City, tossing six scoreless innings in a 5-0 victory. He had all three of his pitches working that night and was able to work out of two-on, no-out jam in the sixth after throwing 111 pitches. \nThe Jays will also go back to their Game 1 starter, Marco Estrada. The veteran right-hander gave up three runs on six hits in 5 1/3 innings in the opener. At home during the regular season, Estrada was 6-4 with a 2.95 ERA in 16 games (13 of them starts). \n*** \nGame 4 pivot point: An early 5-0 lead gave Young a little wiggle room – and he used a good portion of it in the bottom of the third. A one-out single by Ryan Goins and a walk to Ben Revere brought Donaldson to the plate with a chance to get the home team back in the game. \nThe white towel-waving fans at Rogers Centre finally came to life with Donaldson at the plate. He lasered a 3-2 Young fastball down the left-field line that just barely hooked foul. On the next pitch, Young threw an 83 mph slider that Donaldson lined fair into the left field corner and over the wall for a double to bring home the first Toronto run. \nAfter an RBI groundout from Jose Bautista made it 5-2, Young escaped the jam by retiring Edwin Encarnacion on a sizzling liner to left. \n*** Blue Jays' R.A. Dickey knocked out of Game 4 in 2nd inning \nMan of the moment: Although just about every member of the Royals contributed in some way, shortstop Alcides Escobar – as he has all series long -- was the one who ignited the offense. \nHis bunt single in the first was the fourth consecutive time in which he led off the game for his team and reached base. He also reached in the second when he was hit by a pitch and drove in two runs with a pair of sacrifice flies. \nAll this from a guy who hit .257/.293/.320 during the regular season. \n*** \nNeeding a mulligan: Blue Jays starter R.A. Dickey was masterful over the second half of the season. After the All-Star Game, the knuckleballer was 8-1 with a 2.80 ERA. One of those wins came when he blanked the Royals for seven innings at Rogers Centre. \nAlthough the closed roof may or may not help the knuckler dance even more, Dickey was especially good at home. But when the Royals scored four runs on him in the opening inning, it marked the first time since May 26 that Dickey had even allowed four runs in an entire game at home. \nAfter using five pitchers in Game 4, the Jays could have used a lengthy outing from a pitcher who doesn’t put a whole lot of stress on his arm. Instead, they were forced to go to the bullpen in the second inning when Dickey was only able to record five outs. \n*** \nManager's special: Ned Yost’s decision to start fly-ball pitcher Chris Young at the homer-friendly Rogers Centre in Game 4 worked out perfectly. Young pitched effectively into the fifth inning despite a fastball that topped out at 89 mph. \nYoung escaped serious damage in the third inning when the Jays scored twice. And Yost went to the bullpen at the perfect time when he lifted Young after a two-out single by leadoff man Ben Revere. \nWith the Royals leading 5-2, the potential tying run in the on-deck circle and the dangerous Josh Donaldson up, reliever Luke Hochevar retired the AL MVP candidate on a foul popup to end the inning. \n*** \nWhat you missed on TV: The Toronto Symphony Orchestra embodied a pair of qualities for which the city is known. \nFirst, culture. The strings, brass and percussion section members combined for a flawless performance of both the U.S. and Canadian national anthems before Game 4. \nSecond, politeness. A simple online commendation of the aforementioned job resulted in a thank you from the TSO twitter account less than an hour later. It's been said before but O Canada is one great national anthem. Especially when it's played by the Toronto Symphony Orchestra. — Steve Gardner (@SteveAGardner) October 20, 2015 \nGALLERY: BLUE JAYS vs. ROYALS Posted! A link has been posted to your Facebook feed. Game 4 in Toronto: Alex Gordon celebrates with Ben Zobrist after scoring in the seventh inning. John E. Sokolowski, USA TODAY Spo Game 4 in Toronto: Royals manager Ned Yost removes starter Chris Young in the fifth inning. He allows two runs over 4 2/3 innings. John E. Sokolowski, USA TODAY Spo Game 4 in Toronto: Jose Bautista singles in the sixth inning. John E. Sokolowski, USA TODAY Spo Game 4 in Toronto: Josh Donaldson hits a ground rule double to score Ryan Goins in the third inning. Harry How, Getty Images Game 4 in Toronto: R.A. Dickey gets shelled for four earned runs in 1 2/3 innings. John E. Sokolowski, USA TODAY Sports Game 4 in Toronto: Alex Rios hits a home run in the second inning. Royals 5-0. John E. Sokolowski, USA TODAY Sports Game 4 in Toronto: Salvador Perez reacts after being hit by a foul ball in the first inning. Harry How, Getty Images Game 4 in Toronto: Lorenzo Cain scores on a pass ball to give the Royals a 3-0 lead in the first inning. Dan Hamilton, USA TODAY Sports Game 4 in Toronto: Mike Moustakas caps theRoyals' four-run first inning with a sacrifice fly. John E. Sokolowski, USA TODAY Spo Game 4 in Toronto: Ben Zobrist, right, hits a two-run home run off R.A. Dickey to give the Royals a 2-0 lead in the first inning. John E. Sokolowski, USA TODAY Sports Game 4 in Toronto: Ben Zobrist connects on a two-run homer in the first inning. Tom Szczerbowski, Getty Images Game 4 in Toronto: Blue Jay fans arrive at the Rogers Centre. Charlie Riedel, AP Game 3 in Toronto: The Blue Jays celebrate their win to cut the series deficit. Peter Llewellyn, USA TODAY Sports Game 3 in Toronto: Royals designated hitter Kendrys Morales hits a two-run home run in the ninth inning. John E. Sokolowski, USA TODAY Sports Game 3 in Toronto: Royals right fielder Alex Rios makes a nice catch in the eighth inning. Nick Turchiaro, USA TODAY Sports Game 3 in Toronto: Blue Jays coach DeMarlo Hale (center) restrains Troy Tulowitzki as he argues with home plate umpire (not pictured) before the eighth inning. Dan Hamilton, USA TODAY Sports Game 3 in Toronto: Kris Medlen reacts after Ryan Goins hits the third home run of the game by a Blue Jay. Dan Hamilton, USA TODAY Sports Game 3 in Toronto: Mike Moustakas hits an RBI single in the fifth inning to cut the lead to 9-4. Dan Hamilton, USA TODAY Sports Game 3 in Toronto: Josh Donaldson adds a two-run homer in the third inning to increase the lead to 9-2. Nick Turchiaro, USA TODAY Sports Game 3 in Toronto: Johnny Cueto is removed from the game in the third inning after he allows eight earned runs over two-plus innings. Darren Calabrese, AP Game 3 in Toronto: Troy Tulowitzki rounds the bases after his three-run home run in the third inning to give Toronto a 6-2 lead. Nathan Denette, AP Game 3 in Toronto: Kevin Pillar, middle, celebrates after scoring on a hit by teammate Ryan Goins. Charlie Riedel, AP Game 3 in Toronto: Ryan Goins hits a go-ahead two-RBI single in the second that gives the Blue Jays a 2-1 lead, Dan Hamilton, USA TODAY Sports Game 3 in Toronto: Center fielder Kevin Pillar makes an incredible catch as he crashes in the wall on a ball hit by Lorenzo Cain. Matt Slocum, AP Game 3 in Toronto: Alcides Escobar, left, gives the Royals a 1-0 lead in the first inning scoring on a Ben Zobrist fielders choice. Matt Slocum, AP Game 3 in Toronto: Blue Jays right fielder Jose Bautista can't get a glove on a triple by Alcides Escobar in the first inning. Nathan Denette, AP Game 3 in Toronto - Johnny Cueto takes the mound for the Royals. Matt Slocum, AP Game 3 in Toronto: The Blue Jays and Royals line for pregame introductions and the national anthems. Paul Sancya, AP Game 3 in Toronto: Blue Jays first baseman Chris Colabello prepares for the game. Paul Sancya, AP Game 3 in Toronto: Fans start to line up to enter the Rogers Centre. Dan Hamilton, USA TODAY Sports Game 2 in Kansas City: Royals closer Wade Davis and center fielder Lorenzo Cain celebrate after taking a 2-0 series lead. Denny Medley, USA TODAY Sports Gane 2 in Kansas City: Salvador Perez celebrates with teammates. Jamie Squire, Getty Images Game 2 in Kansas City: Mike Moustakas adds an insurance run in the eighth inning. Jamie Squire, Getty Images Game 2 in Kansas City: Alex Gordon drives in the go-ahead run with a double in the seventh inning. Nathan Denette, AP Game 2 in Kansas City: David Price gives up five runs in the seventh inning. Denny Medley, USA TODAY Sports Game 2 in Kansas City: Mike Moustakas drives in an RBI single in the seventh inning. Denny Medley, USA TODAY Sports Game 2 in Kansas City: Lorenzo Cain celebrates his single in the seventh inning. Charlie Riedel, AP Game 2 in Kansas City: Ben Zobrist starts the seventh inning off with a fly ball the Jose Bautista misplays. Jamie Squire, Getty Images Game 2 in Kansas City: Blue Jays right fielder Jose Bautista and second baseman Ryan Goins misplay a soft fly ball in the outfield to begin the bottom of the seventh inning. John Rieger, USA TODAY Sports Game 2 in Kansas City: Troy Tulowitzki hits an RBI double during the sixth inning. Denny Medley, USA TODAY Sports Game 2 9 Kansas City: Josh Donaldson slides into home to give the Blue Jays a 2-0 lead in the sixth. Nathan Denette, AP Game 2 in Kansas City: Royals catcher Salvador Perez catches a deadball ball that hit a wire out of bounds in the sixth inning. Denny Medley, USA TODAY Sports Game 2 in Kansas City: Yordano Ventura walks off the field after the fifth inning. Jamie Squire, Getty Images Game 2 in Kansas City: Alex Gordon catches a ball hit by Ben Revere in the fifth inning. Rob Carr, Getty Images Game 2 in Kansas City - Kevin Pillar scores on a Ryan Goins double in the third inning. Jamie Squire, Getty Images Game 2 in Kansas City - Royals starting pitcher Yordano Ventura thanks shortstop Alcides Escobar for a fine play. Denny Medley, USA TODAY Sports Game 2 in Kansas City - David Price pitches in the shadows at Kauffman Stadium. Jamie Squire, Getty Images Game 2 in Kansas City - A Royals fans holds up antlers for Mike Moustakas. Paul Sancya, AP Game 2 in Kansas City - Blue Jays fans show their support for Jose Bautista. Denny Medley, USA TODAY Sports Game 2 in Kansas City - Professional golfer Tom Watson throws out the ceremonial first pitch. John Rieger, USA TODAY Sports Game 2 in Kansas City - Fans tailgate in the parking lot. Jae C. Hong, AP Game 1 in Kansas City: Royals catcher Salvador Perez, left, dumps the water bucket on starting pitcher Edinson Volquez, who earns the win. Charlie Riedel, AP Game 1 in Kansas City: Royals' shortstop Alcides Escobar leaps and fires to second base to force out Dioner Navarro in the ninth inning. Nathan Denette, AP Game 1 in Kansas City: Eric Hosmer hits an RBI double in the eighth inning to extend the lead to 4-0. Denny Medley, USA TODAY Sports Game 1 in Kansas City: Jose Bautista rears back on a close pitch from Royals' Ryan Madson in the eighth inning. Nathan Denette, AP Game 1 Kansas City: Royals catcher Salvador Perez is tended to after he was hit by a foul ball in the eighth inning. Denny Medley, USA TODAY Sports Game 1 of Kansas City: Reliever Kelvin Herrera pitches a 1-2-3 seventh inning. Denny Medley, USA TODAY Sports Game 1 in Kansas City: SS Troy Tulowitzki turns a huge inning-ending double play with 2B Ryan Goins to save a run in the sixth. John Rieger, USA TODAY Sports Game 1 in Kansas City: Royals starter Edinson Volquez tosses six shut out innings before he was removed from the game. John Rieger, USA TODAY Sports Game 1 Kansas City: Left fielder Ben Revere can't get a glove on Salvador Perez's home run in the fourth inning. Denny Medley, USA TODAY Sports Game 1 in Kansas City: Salvador Perez gives the Royals a 3-0 lead with a solo home run in the fourth inning. Peter Aiken, USA TODAY Sports Game 1 in Kansas City: Alcides Escobar scores on an RBI single from Lorenzo Cain in the third inning. Royals 2, Blue Jays 0. Peter Aiken, USA TODAY Sports Game 1 in Kansas City: Alex Gordon high fives Ben Zobrist after scoring on an RBI double by Alcides Escobar. The Royals take a 1-0 lead in the third inning. John Rieger, USA TODAY Sports Game 1 in Kansas City: Alex Gordon leads off the third inning with a double. Peter Aiken, USA TODAY Sports Game 1 in Kansas City: Alcides Escobar is caught in a rundown by Blue Jays third baseman Josh Donaldson in the second inning. John Rieger, USA TODAY Sports Game 1 in Kansas City: Royals center fielder Lorenzo Cain makes a catch in the first inning. Peter Aiken, USA TODAY Sports Game 1 in Kansas City: Marco Estrada gets the nod to start Game 1 for the Blue Jays. Matt Slocum, AP Game 1 in Kansas City: Royals starting pitcher Edinson Volquez (center) and catcher Salvador Perez (right) walk in from the bullpen. Peter Aiken, USA TODAY Sports Game 1 in Kansas City: The Blue Jays, Rays line up for the national anthem. Paul Sancya, AP Game 1 in Kansas City: Royals fan Troy Guesnier watches batting practice from the upper deck of Kauffman Stadium. Jae C. Hong, AP Game 1 in Kansas City: Blue Jays right fielder Jose Bautista shags balls during pregame batting practice. Paul Sancya, AP Game 1 in Kansas City: Members of the Blue Jays prepare for the game against the Royals. Denny Medley, USA TODAY Sports Game 1 in Kansas City: Blue Jays third basemen Josh Donaldson gets loose before the game. Peter Aiken, USA TODAY Sports Game 1 in Kansas City: Blue Jays third basemen Josh Donaldson (right) and Royals outfielder Johnny Gomes are laughs before the game. Peter Aiken, USA TODAY Sports Game 1 in Kansas City: Royals fan Chris Coats tailgates outside Kauffman Stadium. John Rieger, USA TODAY Sports Like this topic? You may also like these photo galleries: Replay", "external_links": [], "published": "2015-10-21T02:47:00.000+03:00", "crawled": "2015-10-21T03:08:44.245+03:00", "highlightTitle": ""}