{"organizations": [], "uuid": "7bc2fa5530b4f1eda1c7526d4dbd8df35cae06dd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.beaumontenterprise.com", "main_image": "http://ww1.hdnux.com/photos/41/30/35/8750928/3/rawImage.jpg", "site_section": "http://www.beaumontenterprise.com/sports/baseball/collectionRss/Sports-Baseball-Heds-7391.php", "section_title": "Sports Baseball Heds", "url": "http://www.beaumontenterprise.com/sports/article/Yankees-a-team-in-transition-feel-downbeat-and-6557089.php", "country": "US", "title": "Yankees, a team in transition, feel downbeat and yet hopeful", "performance_score": 0, "site": "beaumontenterprise.com", "participants_count": 1, "title_full": "Yankees, a team in transition, feel downbeat and yet hopeful", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T01:17:00.000+03:00", "replies_count": 0, "uuid": "7bc2fa5530b4f1eda1c7526d4dbd8df35cae06dd"}, "author": "RONALD BLUM, AP Baseball Writer", "url": "http://www.beaumontenterprise.com/sports/article/Yankees-a-team-in-transition-feel-downbeat-and-6557089.php", "ord_in_thread": 0, "title": "Yankees, a team in transition, feel downbeat and yet hopeful", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Close Image 1 of 3 \nNew York Yankees pitcher Masahiro Tanaka, far left, Dellin Betances, second from left, Brett Gardner, second from right, and Chris Young, right, watch from the dugout against the Houston Astros during the ninth inning of the American League wild card baseball game, Tuesday, Oct. 6, 2015, in New York. The Astros won 3-0 to advance to the American League Division Series. Photo: Julie Jacobson, AP New York Yankees pitcher Masahiro Tanaka, far left, Dellin... Image 2 of 3 \nA Yankees fan holds a CC Sabathia jersey in the ninth inning of the Yankees loss to the Houston Astros in the American League wild card baseball game at Yankee Stadium in New York, Tuesday, Oct. 6, 2015. Photo: Kathy Willens, AP A Yankees fan holds a CC Sabathia jersey in the ninth inning of the... Image 3 of 3 \nBaseball fans watch as New York Yankees' Greg Bird (31) walks back to the dugout after being called out on strikes with a man on base during the seventh inning of the American League wild card baseball game against the Houston Astros, Tuesday, Oct. 6, 2015, in New York. The Astros won 3-0. Photo: Julie Jacobson, AP Baseball fans watch as New York Yankees' Greg Bird (31) walks back... Yankees, a team in transition, feel downbeat and yet hopeful 1 / 3 Back to Gallery NEW YORK (AP) — The quartet leaned against the dugout railing with uniformly glum expressions during the ninth inning, Masahiro Tanaka and Dellin Betances crossing their arms, Brett Gardner dangling his over a railing and Chris Young resting his chin on a hand. The New York Yankees expected better this year than elimination in the AL wild-card game. Many others anticipated worse. \"When the season started, no one thought we would be here,\" manager Joe Girardi said after Houston eliminated New York 3-0 on Tuesday night. In the first year after Derek Jeter 's retirement, the Yankees ended their two-year absence from the postseason but did not reach the Division Series. They had a seven-game AL East lead in late July but played .500 ball after and finished six games behind Toronto. Adding closer Andrew Miller , shortstop Didi Gregorius , pitcher Nathan Eovaldi and reliever Justin Wilson helped, but not enough. In the end, the Yankees could not overcome titanic late-season slumps by Jacoby Ellsbury , Brett Gardner, Alex Rodriguez and Brian McCann . \"The way this team played here down the stretch isn't reflective of what this team looked like for most of the season. That's the frustrating part,\" general manager Brian Cashman said. New York scored 764 runs, second in the major leagues behind Toronto, and the Yankees' 212 homers were up from 147 last year. But they lacked timely hitting for stretches and a slump-busting ace. David Price , Zack Greinke , Jordan Zimmermann and Johnny Cueto will be available on the free-agent market, but do the Yankees want a long-term contract with another high-priced pitcher who will be in his mid-to-late 30s in the deal's latter years? They also could use a right-handed bat with power, preferably at second base. The Yankees were especially vulnerable to left-handers when the switch-hitting Mark Teixeira broke a shin in mid-August and Rodriguez slumped. At 30 years, 31 days, the Yankees began the season with the fifth-oldest roster, according to STATS. Rodriguez returned from a season-long drug suspension to hit 33 homers and Teixeira, 35 years old, rebounded from wrist surgery to hit 31 homers and drive in 79 runs before his injury. \"Our stated goal is to definitely try to get younger,\" Cashman said. With age comes injuries. Will Rodriguez, who turns 41 next summer, stay healthy for a second straight season? \"Depth is very important, no doubt. Guys are going to get banged up,\" Teixeira said. \"Rest helps. Rest is a part of recovery. It's a part of performance.\" All of the Yankees' primary starting pitchers were hurt at some point: Tanaka (wrist, forearm), CC Sabathia (knee), Michael Pineda (forearm), Ivan Nova (recovery from Tommy John surgery) and Nathan Eovaldi (wrist). Sabathia, 35 and three years removed from his last top season, left the team to check into an alcohol rehabilitation center on Monday. As starters got hurt, the bullpen got taxed. And New York's offense pretty much collapsed late in the season. From Sept. 1 on, Rodriguez hit .224. Ellsbury .207, Gardner .198 and McCann .174. The club batting average dropped from .274 in June and July to .236 for the remainder of the season, according to STATS. Changes likely will come from free agents and trades. While Luis Severino (21), first baseman Greg Bird (22) and second baseman Rob Refsnyder (24) showed promise during the second half, Cashman cautioned on expecting additional top pitching help from the minors. \"I don't have anybody coming that is of Severino caliber,\" he said. Additional stars could be used, too. Average attendance in the post-Jeter era slid from 42,520 last year to 39,922, and the average viewership on the YES Network fell from 288,000 to 259,000. With major changes, the Yankees' next game that counts may resemble their last. Their opener is April 4 at home — against the Astros . Players left the clubhouse with a modicum of optimism. \"I like what we're going to have next year,\" Teixeira said. Southeast Texas sports news", "external_links": [], "published": "2015-10-08T01:17:00.000+03:00", "crawled": "2015-10-08T01:36:17.372+03:00", "highlightTitle": ""}