{"organizations": [], "uuid": "c3e92181c32c6da7b568d24b973b06acb24b7702", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "", "site_section": "http://www.tribuneindia.com/", "section_title": "The Tribune, Chandigarh, India : Latest news, India, Punjab, Chandigarh, Haryana, Himachal, Uttarakhand, J&amp;K, sports, cricket ", "url": "http://www.tribuneindia.com/news/editorials/nuisance-of-rail-roko/143038.html", "country": "US", "title": "Nuisance of ‘rail roko’", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "Nuisance of ‘rail roko’", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "c3e92181c32c6da7b568d24b973b06acb24b7702"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/editorials/nuisance-of-rail-roko/143038.html", "ord_in_thread": 0, "title": "Nuisance of ‘rail roko’", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Farmers in Punjab are going through a more-than-usual difficult phase. A poor monsoon, low prices of farm commodities, particularly of Basmati, the whitefly attack on the cotton crop and the sale of fake pesticides have added to their pain. Some farmers in the cotton belt have been driven to suicide. Reports of a pesticide scam have turned their anger against the government. It is their democratic right to protest and put pressure on their elected government to get their demands accepted. However, the protest must be peaceful and within the limits imposed by the law. Some farmer leaders seem to think the only way to make their voice heard is by disrupting train services or/and road traffic. Farmers should decide if they want such anti-people leaders to guide their agitations. By causing inconvenience to a large number of road and train users, they tend to lose public sympathy for their otherwise genuine concerns. Public anger at the disruption of train services is often wrongly targeted at protesters, whereas it is the duty of the government to ensure that no one unlawfully stops traffic. Since farmers are a major vote bank of the Akali Dal, its government would rather allow common people to suffer hardships than make preventive arrests to thwart a “rail roko” or forcibly evict the protesters immediately to clear the tracks. The government passed in 2014 a law against damage to public and private property but uses it when politically convenient. Farmers are spared because they constitute a large vote base but smaller groups of protesters who can cause little political damage are very often dealt with brutally. Fearful of the political cost involved for the ruling parties, the railway authorities too do not act. On such occasions the coalition partner in Punjab, BJP, too chooses to remain a helpless spectator. After its own inquiry the government has proceeded against the Director, Agriculture. If the Director indulged in corruption, how can the minister in charge escape the blame even if the opposition and farmers' allegations against him are ignored?", "external_links": [], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-08T10:04:58.888+03:00", "highlightTitle": ""}