{"organizations": [], "uuid": "4048ef1d64d813fbea65f952d40d4a5bd84a488a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "http://s4.reutersmedia.net/resources/r/?m=02&d=20151016&t=2&i=1087373986&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXNPEB9F03S", "site_section": "http://www.reuters.com/news/sports", "section_title": "Sports News, Highlights &amp; Coverage | Reuters.com", "url": "http://www.reuters.com/article/2015/10/16/us-baseball-highlights-idUSKCN0SA09420151016", "country": "US", "title": "Mets edge Dodgers in decider to reach NLCS", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Mets edge Dodgers in decider to reach NLCS | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T09:05:00.000+03:00", "replies_count": 0, "uuid": "4048ef1d64d813fbea65f952d40d4a5bd84a488a"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/10/16/us-baseball-highlights-idUSKCN0SA09420151016", "ord_in_thread": 0, "title": "Mets edge Dodgers in decider to reach NLCS", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(The Sports Xchange) - Daniel Murphy hit the go-ahead home run as the New York Mets beat the Los Angeles Dodgers 3-2 in the decisive fifth game of the National League Division Series at Dodger Stadium on Thursday.\nMurphy's sixth-inning homer off Dodgers right-hander Zack Greinke was his third of the series and lifted the Mets into the NL Championship Series against the Chicago Cubs.\n\"Daniel was a tough out all series. To me he's always been a tough out,\" Dodgers manager Don Mattingly told reporters. \"You kind of have to get him off stride and get the ball to certain spots (or) you're in trouble.\"\nMets starter Jacob deGrom (2-0) struggled early on but regrouped and finished strong. He gave up two runs in the first but settled and allowed six hits with seven strikeouts and three walks in six innings.\nNoah Syndergaard relieved deGrom and worked a scoreless seventh before closer Jeurys Familia came on in the eighth for the six-out save. Familia retired all six batters he faced.\nGreinke (1-1), who might have pitched his last game for the Dodgers since he can opt out of his contract, gave up three runs on six hits with nine strikeouts and no walks in 6 2/3 innings.\nThe Mets jumped in front 1-0 in the first. With one out, Murphy's double scored right fielder Curtis Granderson, who led off with an infield hit.\nFour consecutive singles in the bottom of the inning allowed the Dodgers to rally. Third baseman Justin Turner and right fielder Andre Ethier brought home shortstop Corey Seager and first baseman Adrian Gonzalez for a 2-1 Los Angeles lead.\nIn the fourth, Murphy opened with a single and advanced to second on a walk to first baseman Lucas Duda.\nMurphy continued running past second and stole third on the walk, as Turner left his position at third prematurely with no one covering as he headed to the right side of the diamond for a shift on the next batter, catcher Travis d'Arnaud.\nD'Arnaud hit a sacrifice fly to left, scoring Murphy and knotting the score at 2-2.\n\"I'm not sure who was supposed to cover (third base), but no one was there,\" Murphy said. \"I'm not the fleetest of foot but I was just fast enough to get there.\"\nTurner, a former Met, doubled in the third and fifth innings to give him a franchise-record six for the series, breaking Hanley Ramirez's mark of four set in the 2013 NLDS against the Atlanta Braves.\n\"Everyone sincerely roots for the guy next to him here,\" Murphy said of a Mets team seeking a first World Series appearance since 2000.\n\"It's a great group of guys and that's what makes this so much more special.\"\nThe opener of the best-of-seven NLCS is at Citi Field in New York on Saturday.\n(Compiled by Peter Rutherford; Additional reporting by Jahmal Corner in Los Angeles)", "external_links": [], "published": "2015-10-16T09:05:00.000+03:00", "crawled": "2015-10-16T08:43:09.981+03:00", "highlightTitle": ""}