{"organizations": ["NFL", "Marshawn Lynch"], "uuid": "fef7a22a364b1fdb7aaa8fad401a2aea0b453c44", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.edmontonsun.com", "main_image": "http://storage.edmontonsun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297758806136_LARGE_BOX.jpg?quality=80&stmp=1444456194213&size=100x", "site_section": "http://www.edmontonsun.com/sports/rss.xml", "section_title": "Top Sports stories", "url": "http://www.edmontonsun.com/2015/10/10/seahawks-wont-have-beastmode-marshawn-lynch-at-cincinnati", "country": "CA", "title": "Seahawks won't have 'Beastmode' Marshawn Lynch at Cincinnati", "performance_score": 0, "site": "edmontonsun.com", "participants_count": 0, "title_full": "Seahawks won't have 'Beastmode' Marshawn Lynch at Cincinnati", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T08:23:00.000+03:00", "replies_count": 0, "uuid": "fef7a22a364b1fdb7aaa8fad401a2aea0b453c44"}, "author": "", "url": "http://www.edmontonsun.com/2015/10/10/seahawks-wont-have-beastmode-marshawn-lynch-at-cincinnati", "ord_in_thread": 0, "title": "Seahawks won't have 'Beastmode' Marshawn Lynch at Cincinnati", "locations": ["Cincinnati"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NFL \nThe Seattle Seahawks won’t have Marshawn Lynch in the lineup when they play at Cincinnati, in Sunday’s marquee NFL game. \nSeattle head coach Pete Carroll announced Friday that his star running back hasn’t recovered enough from a strained hamstring. \n“He actually did get a little bit of work (this week),” Carroll said. “He’s running very well. However, it’s just two weeks now. He’s just getting over it. \n“We’ve seen some guys around the league try to come back. He could try to come back and play, but we think he’d be vulnerable. He needs another weekend to get through it.” \nThe Seahawks (2-2) possess one of the league’s most brutish defences, while the Bengals (4-0) have one of the most prolific offences so far. \nCincinnati’s defence has been stout, too. Without Lynch the Seahawks attack -- behind what’s looking for all the world like one of the league’s worst offensive lines -- will be even less potent. \nBottom line, Seattle needs the Beastmode back, upon his return, to re-energize the offence in the same way safety Kam Chancellor’s return in Week 3 (after he ended his contract holdout) raised the Seahawks defence to its usual elite level \n“He’s just about over the hump,” Carroll said of Lynch. “He’s worked very diligently, like I’ve said, to get it done. So we just have to wait a couple more days … We can’t guarantee that he can make it through the (Cincinnati) game.” \nLynch won’t even make the trip, Carroll said, so club the may add another running back by game time on Sunday. \nAs for Lynch’s veteran backup, former Buffalo Bill Fred Jackson, Carroll said he has made a “fantastic recovery” from an ankle injury suffered just on Monday night against Detroit. \n“He’s listed as questionable,” Carroll said. “He’s going (on the trip) and we’re thinking he’s going to make it. He’ll have to work out on game day but he looks really good, and we think he’s going to be able to play. \n“(Jackson is) way ahead of schedule. You just can’t figure out how he’s doing it, but he looks ready to go. It’s not the first time that we’ve seen it, but it’s a miraculous recovery.” \nThomas Rawls probably would start if Jackson isn’t ready. \nTEXANS ROUNDABOUT: Brian Hoyer is the Houston Texans’ starting quarterback. \nNo, Ryan Mallett is! \nNo, Hoyer is! \nThat’s the short version of head coach Bill O’Brien’s five-week QB carousel. \nHoyer looked good Thursday night in taking over for the ever-scattershot Mallett -- well, until Hoyer’s incredibly dunderheaded, game-killing interception near the end that sealed the Texans’ loss to division rival Indianapolis. \nBefore that, Hoyer was 24-of-30 for 312 yards and a touchdown. \nO’Brien announced Friday that Hoyer is again his No. 1 quarterback, after winning the job in training camp only to lose it to Mallett before the end of the first game last month. \nMallett was mostly miserable, though, in four starts. And inaccurate -- the thing that has been his downfall at every level. \nHoyer’s restart comes a week from Sunday, at Jacksonville. \nONE-YEAR WONDER?: That’s how New York Jets cornerback Antonio Cromartie described New York Giants receiver Odell Beckham Jr. \nSeriously. \nApparently, Cromartie isn’t watching any tape of Beckham play. And I’m not just talking about the highlight-reel one-handers. Beckham is a stud. \nStats back up what the eyes see, too. Beckham has more receiving yards in his first 16 career games (1,612) than any player in NFL history, off 115 catches -- and for 14 touchdowns. \nWhy is Cromartie so critical of Beckham then? \n“’Cause right now he’s a one-year wonder,” the 10th-year player told ESPN on Friday, per NFL.com. “It’s just one year … I need to see it on an every-game basis.” \nUm, Beckham has been doing it on an every-game basis, Antonio. Time you took notice. \nDEJA VU FOR CASSEL: Matt Cassel said Friday he expects to be activated for the Dallas Cowboys’ big home game Sunday against New England. \nIf so, for the second time in four weeks Cassel would be his team’s backup quarterback against the Patriots. \nThat’s because Cassel backed up Tyrod Taylor on Sept. 20, when the Buffalo Bills played host to the Pats. Cassel -- who was dealt to Big-D a few days later -- didn’t play against New England, but certainly must be familiar with its defence, after a week of tape study and after watching it dismantle Taylor and the Bills’ attack for most of three quarters in a 40-32 New England win. \nBrandon Weeden, the current Dallas starter while Tony Romo recovers from a fractured collarbone, had better be more effective after halftime than he’s been in losses the past two weeks. \nOr Cassel probably goes in. \nNew England-Dallas is the marquee 4:25 p.m. EDT game on Sunday. \nEXTRA POINTS: Cowboys LB Sean Lee has completed the NFL’s concussion protocol and is expected to play on Sunday … Winless Detroit won’t have RB Joique Bell (ankle), TE Eric Ebron (knee) and DT Haloti Ngata (calf) against Arizona. All three were ruled out on Friday. Listed as probable are DE Ezekiel Ansah (shoulder), LB DeAndre Levy (hip), WR Lance Moore (ankle), TE Brandon Pettigrew (hamstring) and CB Darius Slay (quad) … The Bills won’t have RB LeSean McCoy (hamstring), S Bacarri Rambo (quad), rookie RB Karlos Williams (concussion) and TE MarQueis Gray (forearm) at Tennessee. WR Sammy Watkins (calf) is questionable … Among other players who won’t play on Sunday: Cleveland S Tashaun Gipson and LB Craig Robertson; Baltimore DE Chris Canty, TE Crockett Gillmore and WR Breshad Perriman; Jacksonville WR Marqise Lee and RB Denard Robinson; Dallas WR Brice Butler and DE Randy Gregory; Philly LB Kiko Alonso, DE Brandon Bair and LB Mychal Kendricks; St. Louis LB Alec Ogletree; Green Bay S Sean Richardson; Washington CB Chris Culliver, CB DeAngelo Hall, WR DeSean Jackson and TE Jordan Reed; Atlanta LB Justin Durant; San Francisco TE Vernon Davis; and New York Giants DE Robert Ayers, WR Victor Cruz and LB Devon Kennard. \njohn.kryk@sunmedia.ca", "external_links": [], "published": "2015-10-10T08:23:00.000+03:00", "crawled": "2015-10-10T15:22:26.570+03:00", "highlightTitle": ""}