{"organizations": [], "uuid": "6ca00137f9600e097e2ed7659327aada8b0d40db", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thenewsstar.com", "main_image": "http://www.gannett-cdn.com/-mm-/a68f0a4b752f5335ea132d47bf60120b13857543/c=0-499-1212-1181&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/10/Monroe/B9319217396Z.1_20151010232401_000_G5AC6TENR.1-0.jpg", "site_section": "http://rssfeeds.thenewsstar.com/monroe/sports", "section_title": "Monroe - Sports", "url": "http://www.thenewsstar.com/story/sports/college/ulm/2015/10/10/ulm-falters-late-tulsa/73763286/", "country": "US", "title": "ULM falters late at Tulsa", "performance_score": 0, "site": "thenewsstar.com", "participants_count": 0, "title_full": "ULM falters late at Tulsa", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T06:24:00.000+03:00", "replies_count": 0, "uuid": "6ca00137f9600e097e2ed7659327aada8b0d40db"}, "author": "", "url": "http://www.thenewsstar.com/story/sports/college/ulm/2015/10/10/ulm-falters-late-tulsa/73763286/", "ord_in_thread": 0, "title": "ULM falters late at Tulsa", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ULM falters late at Tulsa Warhawks can’t hold four-quarter lead at Tulsa. Post to Facebook ULM falters late at Tulsa Warhawks can’t hold four-quarter lead at Tulsa. Check out this story on thenewsstar.com: http://tnsne.ws/1LoKNkJ Cancel Send A link has been sent to your friend's email address. Posted! A link has been posted to your Facebook feed. Join the Conversation Adam Hunsucker, ahunsucker@thenewsstar.com 10:24 p.m. CDT October 10, 2015 ULM coach Todd Berry looks over his play sheet. (Photo: Marvin Gentry/USA TODAY Sports) \nTULSA, Okla. — ULM won’t be singing “Take Me Back to Tulsa” anytime soon. \nNot after another Saturday filled with penalties and costly special teams mistakes that resulted in another loss. \nThe Warhawks (1-4, 0-1) erased a 13-point halftime deficit and led Tulsa in the fourth quarter, but the Golden Hurricane (3-2, 0-1) scored 14 unanswered points to get out of their home stadium with a 34-24 win. \n“We continue to hurt ourselves with silly things,” ULM head coach Todd Berry said. “Some of it has to do with youth and some just us not being disciplined. \n“We’ve talked enough about it and it still isn’t getting fixed so that’s on me.” \nClinging to a 24-20 lead, two fourth-quarter turnovers from ULM led to 14-straight points by Tulsa to end the game. Quarterback Dane Evans threw a 15-yard strike to D’Angelo Brewer that gave the Golden Hurricane the lead with just under 9 minutes to play. \nEvans completed 28 of 44 passes for 341 yards and two touchdowns on the night. Tulsa put up 565 yards of total offense and ran more than 100 plays. \nZack Langer added the second of his two rushing touchdowns after Trey Caldwell fumbled the ensuing kickoff for ULM. \nCraig Ford booted a 22-yard field goal at the start of the third quarter to cut into Tulsa’s 20-7 halftime lead. ULM scored 10 points to close the third quarter and take its first lead of the night. \nFord had the chance to add to ULM’s lead in the fourth quarter but couldn’t hit a 23-yard kick — his second miss of the game. The Warhawks committed eight penalties — they came in averaging 10 — but it cost them 73 yards. \nSmith threw the ball 42 times and completed 24 of them for 224 yards and one touchdown to go along with the interception. Smith, DeVontae McNeal and Kylon Watson combined for 168 yards rushing. \nTulsa came into the game giving up 293 yards per-game on the ground. \nMcNeal’s 43-yard touchdown run through the defense pushed ULM ahead by three points. \n“We needed to run the ball this week with Ceaser out and Kylon and I were able to make some plays,” McNeal said. “Our offensive line believes we can run the ball and it showed today.” \nRedford Jones’ 34-yard field goal on Tulsa’s second offensive possession gave his team a 3-0 lead. The Golden Hurricane would extend it to 10-0 by the end of the first quarter when Zack Langer capped an 11-play, 72-yard drive with a 1-yard touchdown plunge. \nOutside of one scoring drive, ULM’s total yardage at halftime was a mere 137 yards on 34 plays. \nThe Warhawks were able to go 69 yards and put six points on the board on a successful 3-yard keep by Garrett Smith running the zone-read. \nTulsa scored 10 consecutive points to end the half, putting three up on another Jones 28-yard kick. TU then drove 66 yards in only five plays to score with just 26 seconds left until halftime. \nEvans found Justin Hobbs running through the ULM secondary on a crossing route and he did the rest with a 36-yard catch and run to the end zone. \nULM and Tulsa each traded field-goal misses in the first half. \n“I was hoping to see us come out against a good Tulsa team and play to what we’re capable of. Tulsa made the plays when they were there and we didn’t,” Berry said. \n“We’ve got to learn to be the team that makes those plays.” \nFollow Adam on Twitter @adam_hunsucker Read or Share this story: http://tnsne.ws/1LoKNkJ TOP VIDEOS", "external_links": [], "published": "2015-10-11T06:24:00.000+03:00", "crawled": "2015-10-11T16:08:50.097+03:00", "highlightTitle": ""}