{"organizations": [], "uuid": "b709e09d159787d054399f4bf54912488174b2ae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.northjersey.com", "main_image": "http://www.northjersey.com:80/polopoly_fs/1.1437947!/fileImage/httpImage/rachaelbussanich102215.JPG", "site_section": "http://www.northjersey.com/cmlink/sports-rss.rss", "section_title": "Sports News on NorthJersey.com", "url": "http://www.northjersey.com/sports/h-s-gymnastics-rachael-bussanich-golden-in-clutch-leads-wayne-valley-to-passaic-title-1.1437929", "country": "US", "title": "H.S. gymnastics: Rachael Bussanich golden in clutch, leads Wayne Valley to Passaic title", "performance_score": 0, "site": "northjersey.com", "participants_count": 0, "title_full": "H.S. gymnastics: Rachael Bussanich golden in clutch, leads Wayne Valley to Passaic title", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T07:36:00.000+03:00", "replies_count": 0, "uuid": "b709e09d159787d054399f4bf54912488174b2ae"}, "author": "", "url": "http://www.northjersey.com/sports/h-s-gymnastics-rachael-bussanich-golden-in-clutch-leads-wayne-valley-to-passaic-title-1.1437929", "ord_in_thread": 0, "title": "H.S. gymnastics: Rachael Bussanich golden in clutch, leads Wayne Valley to Passaic title", "locations": ["Passaic County", "H.S.", "Wayne Valley"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Rachael Bussanich", "Wayne Valley"], "text": "Buy this photo MARKO GEORGIEV/STAFF PHOTOGRAPHER Wayne Valley’s Rachael Bussanich scored a 36.25 to win the all-around title at Wednesday’s Passaic County gymnastics championships. \nWEST MILFORD — With its gymnasts dressed in Captain America T-shirts, it was easy to marvel at what Wayne Valley accomplished at Wednesday’s Passaic County championship meet. \nFreshman all-around winner Rachael Bussanich helped power the Indians to their second team title in four seasons, 104.125-99.675, over two-time defending champ Wayne Hills. \nBussanich scored 36.25 and added gold medals on the uneven bars (9.2) and floor exercises (9.5). She became the second Wayne Valley ninth-grader to win all-around after Mackiel Dioslaki, who paced the team to its 2012 championship. \n“Our freshman year, we won counties with a score in the 90s,” Indians senior co-captain Angelica Ingham said. “The newer members of the team, like our juniors and obviously Rachael, really motivated the seniors to be even better. \n“All of that combined is the magic formula, I guess.” \nThe Wayne Valley junior class includes Tonia Golam, whose career high on floor (9.125) completed a top-three sweep by the champs. Senior Alexa O’Hanna (9.4) earned silver, trumping her 2014 first-place score by 0.3. \nSenior Alyssa Harden was the fourth Indian to reach the podium, taking bronze on beam (8.45). Golam got the all-around bronze with a 34.15, and junior Katie Hartwig tallied an eighth-place 31.35. \nBussanich completed her medal haul with silvers on vault (8.75) and beam (8.8) in her first major varsity tournament. \n“It’s definitely different from what I’m used to” in club gymnastics, she said. “But I love the team, and it’s so easy to work with them.” \n“The girls were great to begin with,” Indians coach Samantha Colangelo said, “and Rachael was just that missing link that really pulled them together.” \nWayne Hills junior Nikki Sanzari came away with gold for a second straight year, following up her 2014 bars title with a first-place 8.85 on beam. \nShe was second all-around with a 34.925, while senior teammate Courtney Conforth closed her final county meet with a fourth-place 9.1 on floor. \nThe loudest ovation of the evening was for Maggie Coyle of host West Milford. The senior stuck the landing on a Tsukahara vault that earned a gold-medal 9.2 and sent her teammates into a frenzy. \n“When I landed it, that was just an awesome feeling,” Coyle said. “My previous best vault was an 8.6.” \nHer effort gave a big lift to the third-place Highlanders (93.425), who lost junior standouts Linnea Huber – the defending beam champ – and Emily Haid to injuries in the past two weeks. \nClifton twins Samantha Wong (32) and Kristen Wong (31.7) finished fifth and six in the all-around to lead their team to a fourth-place 89.175. The Mustangs’ score was a season high, as was the total for fifth-place Passaic Valley (64.925). \nAll five schools marched in wearing the T-shirts of various super heroes to help draw attention to the Passaic County coaches’ fundraiser at the meet. Proceeds from concessions were donated to children’s cancer research. © 2015 North Jersey Media Group Tags:", "external_links": [], "published": "2015-10-22T07:36:00.000+03:00", "crawled": "2015-10-22T08:03:49.551+03:00", "highlightTitle": ""}