{"organizations": [], "uuid": "406ef9e4b857f19739f05ff4cbf0dc0fdb3f7de9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/49490908.cms", "site_section": "http://timesofindia.indiatimes.com/Sports/Racing/F1-Drivers/articlelist/10514132.cms", "section_title": "F1 Drivers - Racing - Sports - The Times of India", "url": "http://timesofindia.indiatimes.com/india/Isro-to-launch-six-Singapore-made-satellites-in-December/articleshow/49490894.cms", "country": "IL", "title": "Isro to launch six Singapore-made satellites in December -", "performance_score": 0, "site": "indiatimes.com", "participants_count": 6, "title_full": "Isro to launch six Singapore-made satellites in December - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T19:12:00.000+03:00", "replies_count": 5, "uuid": "406ef9e4b857f19739f05ff4cbf0dc0fdb3f7de9"}, "author": "timesofindia.indiatimes.com", "url": "http://timesofindia.indiatimes.com/india/Isro-to-launch-six-Singapore-made-satellites-in-December/articleshow/49490894.cms", "ord_in_thread": 0, "title": "Isro to launch six Singapore-made satellites in December -", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SINGAPORE: India will launch six Singapore-made satellites, including a dedicated 400 kg spacecraft for carrying out surveillance missions for maritime and border security, in mid-December onboard PSLV-C29.\nThe six satellites will be launched on PSLV-C29 from the Satish Dhawan Space Centre in Andhra Pradesh on December 16.\nThe satellites will then hover about 550 km above ground for up to five years.\nThe December 16 launch comes four years after Singapore put its first home-grown micro-satellite in space. Since the launch of the fridge-size X-Sat in 2011, smaller satellites have subsequently been launched by Nanyang Technological University (NTU).\nThis time round, the satellites are being built from scratch by teams from defence manufacturer Singapore Technologies Electronics (ST Electronics), National University of Singapore and NTU.\nThe 400 kg TeLEOS-1 is the biggest and first Singapore-made commercial earth observation satellite to orbit in space, said ST Electronics communication and sensor systems group president Tang Kum Chuen.\nThe satellite will carry a camera that can take pictures at ground resolution of up to 1 metre.\nTang said the TeLEOS-1, expected to last up to five years, will also be able to conduct missions such as disaster monitoring, coastal surveillance, urban planning and homeland security.\nThe other smaller satellites, designed and built by NUS and NTU, will last from between six months and three years.\nNTU, which has put four satellites in space, will add three more at the end of the year to monitor tropical climate and test experimental satellite-based communication.\nNUS's two new satellites will conduct scientific experiments and analyse the earth's surface.\nBesides Singapore, the other countries in the region that have their own satellites in space include Indonesia, Thailand and Malaysia.\nDr Tim Huxley, executive director of the International Institute for Strategic Studies (Asia), said the upcoming satellite launch is a \"significant step\" in Singapore's space programme, which started 20 years ago.\n\"Singapore recognises the importance of using space technology for all sorts of purposes, from tracking maritime traffic or finding forest fires, to military purposes to know what regional countries are doing on land, air and sea,\" Huxley said. Stay ", "external_links": ["https://play.google.com/store/apps/details?id=com.toi.reader.activities"], "published": "2015-10-22T19:12:00.000+03:00", "crawled": "2015-10-22T12:55:44.307+03:00", "highlightTitle": ""}