{"organizations": [], "uuid": "624d666f160457d162a325144fa88c9187324048", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.boston.com", "main_image": "http://p.o0bc.com/rf/image_1200x628/Boston/2011-2020/2015/10/16/Boston.com/Sports/Images/04974381-7791.jpg", "site_section": "http://www.boston.com/sports?p1=Levelone_Nav_sports", "section_title": "Sports - Boston.com", "url": "http://www.boston.com/sports/football/patriots/2015/10/16/unconventional-preview-vengeful-patriots-will-leave-colts-gasping-for-air/v2hzfGL71heLDzlD4XgHUN/story.html", "country": "", "title": "Unconventional Preview: Vengeful Patriots will leave Colts gasping for air - Patriots", "performance_score": 0, "site": "boston.com", "participants_count": 1, "title_full": "Unconventional Preview: Vengeful Patriots will leave Colts gasping for air - Patriots", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "624d666f160457d162a325144fa88c9187324048"}, "author": "boston.com", "url": "http://www.boston.com/sports/football/patriots/2015/10/16/unconventional-preview-vengeful-patriots-will-leave-colts-gasping-for-air/v2hzfGL71heLDzlD4XgHUN/story.html", "ord_in_thread": 0, "title": "Unconventional Preview: Vengeful Patriots will leave Colts gasping for air - Patriots", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Patriots quarterback Tom Brady celebrates a touchdown against the Cowboys. EPA/LARRY W. SMITH COMMENTARY\nWelcome to Season 4, Episode 5 of the Unconventional Preview , a serious-but-lighthearted, occasionally nostalgia-tinted look at the Patriots’ weekly matchup that runs right here every weekend.\nThe Patriots, who improved to 4-0 last Sunday with a systematic 30-6 victory over the Dallas Cowboys, travel to Indianapolis to take on Andrew Luck (or perhaps Matt Hasselbeck) and the Colts. The Colts are 2-2, but as the banner that sways gently in the Lucas Oil Stadium breeze reminds all who visit that precious football Mecca, they were a finalist in the AFC Championship Game last year.\nThe Colts, as you surely know, are a team of extraordinary physical and mental toughness, but also, so admirably, one of great moral discipline and personal accountability, from the time franchise owner Jim Irsay’s father definitely did not steal away the team from another city in the middle of the night to this era when general manager Ryan Grigson is most definitely not a coach-belittling tattle-tale . Also, Luck has a really stylish beard and trading a first-round pick for Trent Richardson was a heist of Herschel Walker-to-Minnesota proportions and ...\nAw, hell, I can’t do that anymore. This is about … REVENGE!\nThat the side seeking revenge—and is wholly justified in doing so—actually won the last meeting between the two teams by 38 points is amazing in itself. But that’s what happens, Grigson. Disgraces get put in their places. (All right, I’ll work on that. But there’s something there, and the point stands. Revenge!)\nKick it off, Gostkowski, and let’s get this vicious lesson in comeuppance started …\nTHREE PLAYERS I’LL BE WATCHING OTHER THAN TOM BRADY\nAndrew Luck: The Colts’ talented young quarterback has been listed as “questionable” on the injury report after missing the last two games with a shoulder injury. He did make it through the full practice Friday, and reports were encouraging if you’re a Colts fan. Even with his injuries, the Colts need him at the helm if they’re going to have any chance of surprising the Patriots. Backup Matt Hasselbeck is 40 years old and was a Boston Globe All-Scholastic roughly the same time as Ronnie Perry (the elder) . Of course, he’s still playing in the NFL while his younger brother, Tim, is out of the league and currently an ESPN analyst and vice president of the Lousy Ex-Quarterbacks Who Hate Tom Brady Club. (Chris Simms is the president. Trent Dilfer is the secretary.) Matt Hasselbeck has added a few plays to the career highlight reel this season. He will not add any more if he plays Sunday. Luck must play.\nJabaal Sheard: And if Luck does play, the Patriots must—and most likely will—punish him from all angles. The Patriots are tied for fourth in the NFL with 16 sacks (the Broncos lead with 22), a reflection of the depth and versatility in their front seven this year. Dont’a Hightower and Jamie Collins—one of the most electrifying defensive players in the league—made significant leaps forward last year in their development. But it is the addition of Sheard in free agency, who reminds me of an amalgam of Willie McGinest and Roman Phifer, that has given the Patriots its most skilled group of linebackers and ends since the back-to-back championship seasons of 2003-04. He had a ferocious sack of Cowboys quarterback Brandon Weeden last week, and it’s reasonable to expect he will be among the Patriots defenders unleashing their wrath on Luck (or Hasselbeck) come Sunday.\nGronk: In Week 11 last year—a 42-20 Patriots victory—Gronkowski power-dribbled Colts defensive back Sergio Brown to the sideline turf while blocking on a Jonas Gray touchdown run, then explained later that he had no choice but to throw the talkative defender “out of the club.” While Brown has moved on to the NFL witness protection program—in other words, he plays for Jacksonville—Gronk the Bouncer will be motivated to remove a few more unruly patrons disguised as Colts defensive backs on Sunday, especially after accumulating just 67 yards last week against Dallas. Unless the Colts somehow have found a way to clone prime-of-career Bob Sanders (and make him about a foot taller in the process), Gronk is going to have his way with the Colts’ soon-to-be-bruised defensive backfield.\nGRIEVANCE OF THE WEEK\nWell, I mean, Deflategate, and the wasted hours of summer we spent following NFL Commissioner Roger Goodell’s shameful and shameless attempt to pander to pretty much every owner who doesn’t answer to Mr. Kraft, isn’t just the grievance of the week, though it is certainly the Patriots’ motivating grievance this week. It’s the grievance of … I don’t know, this era of Patriots football? This decade? All time, in any sport? Deflategate would simply have been laughably absurd if its malicious intentions – particularly in terms of destroying Tom Brady’s reputation – were not so enraging. That’s the grievance of the week, sure. It’s also the grievance of forever, or at least the grievance-until-further-notice.\nWhile we’re at it, call this one a pre-grievance. This Patriots-Colts matchup is an NBC telecast, so there are two guarantees: Play-by-play announcer Al Michaels will drop amusing, barely veiled references to the betting line, and color commentator Cris Collinsworth will blather a lot about Deflategate. A lot. He told me before Super Bowl 49 that it would be something he would mention in passing during the telecast, and then he ended up talking about it so much that even Left Shark was like, “Yo, C.C., enough already with the PSI. Jeepers, bro.” (That’s a direct Quote: . I have it right here in my notes.) I put the over/under on Ideal Gas Law references at four. I imagine Michaels has the over.\nIS IT STILL THERE MORT?\nIt’s still there . And it’s still uncorrected. I hope Bill Belichick brings in James Earl Jones to read this story to the team before kickoff.\nA LITTLE RESPECT FOR THE KICKERS, PLEASE\nIf this game comes down to a swing of the right foot of Adam Vinatieri or Stephen Gostkowski in the closing seconds, well, that would certainly be an outcome that no one among us is expecting. Chances are the kickers will be afterthoughts on Sunday night, which is why we’ll take a moment to acknowledge them now. Vinatieri is the greatest clutch kicker in NFL history, someone who should join Jan Stenerud as the only place kickers in the Pro Football Hall of Fame. He spent 10 years with the Patriots, departed with three Super Bowl rings and the top spot on the list of the franchise’s all-time scoring leaders. He’s now in his 10th season in Indianapolis, collected a fourth Super Bowl ring (probably his least favorite), and shows few signs of slowing down. Yet the Patriots have no regrets in letting him go. Gostkowski has proven a worthy successor to the greatest kicker in history, a savvy fourth-round draft pick by Belichick in 2006 who last season surpassed Vinatieri as the franchise’s all-time leading scorer. It’s downright remarkable that save for the occasional injury, the Patriots have had just two kickers in the past 20 seasons. If the days of Scott “Missin’” Sisson feel like a long time ago, that’s because they were. Vinatieri and Gostkowski have given us that increasingly rare feeling in the NFL—complete faith in the kicker—for two decades now.\nPREDICTION, OR SAY, DOES ANYONE KNOW WHAT THE PATRIOTS’ FRANCHISE RECORD FOR POINTS IN A GAME IS?\nI can answer that, since, you know, I’m the one who asked it. The Patriots record for points in a game is 59, which they scored in a shutout of the apparently allergic-to-snow Tennessee Titans on Oct. 18, 2009. You might notice that Sunday night’s game marks the six-year anniversary of that whitewashing. And you might believe such an occasion would be a perfect time to obliterate the record set in that particular obliteration. Given the nonsense the Colts have put them through off the field, the Patriots might be satisfied by a 59-0 score … at halftime.\nIn all seriousness, though, I don’t think this one is going to be quite the one-sided thumping we’re expecting. Oh, the Patriots will win, and without much, if any, suspense. But perhaps you have noticed that some elements aren’t lining up quite right. Left tackle Nate Solder is out for the year, and thus one of the most important jobs on the Patriots—arguably the most important job other than Tom Brady’s—will be held by someone new. Cornerback Tarrell Brown has a foot injury, which means that we’re probably going to see a lot of the inconsistent Logan Ryan, who started against Dallas. He played well last week, but that won’t prevent him from wearing a bull’s-eye Sunday. Also, running back Dion Lewis, the revelation of the season so far, has an abdominal injury and may be limited against one of the teams that had previously cut him.\nThis is not the perfect scenario. That won’t—or shouldn’t—matter. The Patriots will try to pulverize the Colts, and they will score on them at every opportunity, no matter the circumstances or margin. A ticked-off Patriots team is a Patriots team that fulfills our expectations as well as theirs. Provided that the expectations are reasonable. This is the best we can do. Let the vengeance begin. Patriots 42, Colts 17.\nChad Finn can be reached at finn@globe.com . Follow him on Twitter @GlobeChadFinn .\n Patriots Unconventional Preview: Vengeful Patriots will leave Colts gasping for air 10.16.15 | 11:11 PM Sports The 5 best places to watch Head of the Charles 10.16.15 | 5:06 PM Sports Here Bruins The five biggest problems facing the Bruins 10.16.15 | 4:03 PM Patriots Dion Lewis is a highlight reel waiting to happen 10.16.15 | 3:14 PM Football Here’s Jimmy Fallon with your Patriots and Colts NFL superlatives 10.16.15 | 1:57 PM Patriots Colts player at center of Deflategate still doesn’t know where ‘mystery ball’ is 10.16.15 | 1:10 PM Patriots 5 keys to the Patriots’ matchup against the Colts 10.16.15 | 11:28 AM Patriots Patriots-Colts prediction roundup: Let’s face facts, the Colts just aren’t very good 10.16.15 | 10:42 AM Patriots Wake Up With Wilbur: Pats-Colts Lacks Buzz 10.16.15 | 9:23 AM Sports There’s a Patriots “prayer candle” set available online 10.16.15 | 9:22 AM Sports Morning Sports Update: Lamar Odom still on life support, ‘small improvement’ seen 10.16.15 | 7:36 AM Sports Why do so many people wear funny-looking blazers at Head of the Charles? 10.16.15 | 6:01 AM Patriots Patriots fans are not overconfident about beating Colts—but they have a right to be 10.15.15 | 8:27 PM Music RadioBDC Sports: Pats Prepare to Crush Colts 10.15.15 | 3:11 PM Red Sox Manny Ramirez is the Cubs’ not-so-secret weapon 10.15.15 | 2:14 PM Patriots The first rule of Deflategate: Don’t talk about Deflategate 10.15.15 | 1:50 PM Patriots Tom Brady on Deflategate, Gisele and Donald Trump 10.15.15 | 1:39 PM Red Sox Red Sox fans shouldn’t lament letting Anthony Rizzo get away 10.15.15 | 1:14 PM Patriots All 13 times Tom Brady has beaten the Colts 10.15.15 | 12:34 PM Patriots Colts too embarrassed about blowout loss to dwell on Deflategate 10.15.15 | 12:24 PM Baseball Watch Jonny Gomes take out a kid while celebrating the Royals’ ALCS berth 10.15.15 | 12:00 PM Patriots The more fans know about Deflategate, the more they disagree 10.15.15 | 11:23 AM Basketball Watch Scott Van Pelt set the record straight on Lamar Odom, basketball player not reality TV star 10.15.15 | 10:37 AM Baseball Wake Up With Wilbur: Bat Flip Brings Back Memories 10.15.15 | 9:21 AM Sports Morning Sports Update: Tony Romo tells Tom Brady, ‘See you in February’ 10.15.15 | 8:29 AM Technology Report: Feds questioning legality of daily fantasy sports 10.15.15 | 7:38 AM Baseball #TBT: 50 cent tickets and other things you don’t remember about the 1915 World Series 10.15.15 | 5:51 AM Sports An insider’s guide to Head of the Charles, the essential autumn-in-New-England event 10.15.15 | 5:41 AM Baseball Here’s Don Orsillo’s first day with the San Diego Padres 10.14.15 | 10:34 PM", "external_links": ["http://p.o0bc.com/rf/image_700w/Boston/2011-2020/2015/10/16/Boston.com/Sports/Images/04974381.jpg", "http://profootballtalk.nbcsports.com/2015/03/30/grigson-pagano-relationship-may-have-been-strained-by-deflategate/", "http://www.bdcwire.com/the-5-best-places-to-watch-head-of-the-charles/?p1=stream_", "http://www.bdcwire.com/pats-prayer-candles/?p1=stream_", "http://twitter.com/GlobeChadFinn", "http://www.usatoday.com/story/sports/nfl/colts/2014/03/29/indianapolis-baltimore-move-30-year-anniversary-mayflower/7053553/", "http://espn.go.com/boston/nfl/story/_/id/12202450/nfl-says-new-england-patriots-had-inflated-footballs-afc-championship-game", "http://www.telegram.com/article/20150321/NEWS/303219726", "https://www.youtube.com/embed/5rlqjIYpmIo", "http://horseshoeheroes.com/2015/10/16/andrew-luck-still-questionable-but-as-close-as-hes-ever-been/", "http://www.youtube.com/watch?v=WmcWZ2Bzoho", "http://www.nfl.com/news/story/0ap3000000459824/article/sergio-brown-wants-to-boot-rob-gronkowski-from-club", "http://www.nfl.com/news/story/0ap3000000471992/article/ryan-grigson-colts-alerted-nfl-before-patriots-game", "http://www.bdcwire.com/radiobdc-sports-pats-prepare-to-crush-colts/?p1=stream_"], "published": "2015-10-16T03:00:00.000+03:00", "crawled": "2015-10-17T07:14:12.793+03:00", "highlightTitle": ""}