{"organizations": [], "uuid": "a4d9205e0ab186023ecd9afb32320eea5274de73", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "sports.dailymirror.lk", "main_image": "", "site_section": "http://sports.dailymirror.lk/feed/rss/", "section_title": "Mirror Sports", "url": "http://sports.dailymirror.lk/2015/10/12/germany-albania-romania-and-poland-join-2016-party/", "country": "US", "title": "Germany, Albania, Romania and Poland join 2016 party", "performance_score": 0, "site": "dailymirror.lk", "participants_count": 1, "title_full": "Germany, Albania, Romania and Poland join 2016 party", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T09:59:00.000+03:00", "replies_count": 0, "uuid": "a4d9205e0ab186023ecd9afb32320eea5274de73"}, "author": "navodya", "url": "http://sports.dailymirror.lk/2015/10/12/germany-albania-romania-and-poland-join-2016-party/", "ord_in_thread": 0, "title": "Germany, Albania, Romania and Poland join 2016 party", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Germany, Albania, Romania and Poland join 2016 party Reuters Published : 12:29 pm October 12,   83 reads | \nWorld champions Germany and perennial also-rans Albania do not share much in common in football but both were united in joy on Sunday when they qualified for Euro 2016 in France along with Romania and Poland. \nThe World Cup winners, who have lifted the Henri Delauney trophy three times as European champions, left it late but sealed their spot with a 2-1 win over already-eliminated Georgia which gave them top spot in Group D. \nAlbania, who have never previously reached the World Cup or European Championship since first entering both in the mid-1960s as a secretive state shrouded in hard-line communist aloofness, secured their place with a 3-0 win over Armenia in Yerevan. \nThousands of their supporters in both Albania and Kosovo, where a number of the Albania players were born, took to the streets, letting off fireworks and driving around towns and cities hooting their car horns in celebration. \nPoland finished behind Germany with a 2-1 win over Ireland in Warsaw forcing the Irish into the playoffs. The winner was a stunning diving header by striker Robert Lewandowski who took his tally to a record-equalling 13 for a single Euro campaign. \nRomania also secured their berth in France when they won 3-0 in the wintry Faroe Islands to secure second place in Group F behind already-qualified Northern Ireland. \nRomania’s victory lifted them to 20 points, one behind the Irish who finished on 21 after a 1-1 draw in Finland, leaving Hungary in third spot with a place in the playoffs. \nHungary lost an extraordinary game 4-3 to Greece, the first time the 2004 European champions had won in all 10 qualifiers, and the first time they had scored at home. \nSixteen teams, including hosts France, are now assured of a place in the expanded 24-team finals. \nAlong with the four who qualified on Sunday, Iceland, Czech Republic, Belgium, Wales, holders Spain, England, Switzerland, Northern Ireland, Austria, Italy and Portugal are also through. \nSix teams are sill in contention for automatic qualification: Slovakia and Ukraine from Group C, Russia and Sweden from Group G, and Norway and Croatia from Group H. \nThe marathon week of qualifiers continues on Monday and Tuesday with another 18 matches after which 20 finalists will be known, including the team that has qualified with the best record from the third-placed finishers in he nine groups. \nThe other eight third-placed teams enter the two-legged playoffs to be held in November, with the draw for those matches scheduled for next Sunday.", "external_links": [], "published": "2015-10-12T09:59:00.000+03:00", "crawled": "2015-10-12T10:50:43.552+03:00", "highlightTitle": ""}