{"organizations": [], "uuid": "bc54799c17c67ee1cceb02961fefafbe4c610dac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.boston.com", "main_image": "http://p.o0bc.com/rf/image_1920x1190/Boston/2011-2020/2015/10/18/Boston.com/Sports/Images/chin101815PatriotsatColts_spt5.jpg", "site_section": "http://www.boston.com/", "section_title": "Boston, MA news, breaking news, sports, video | Boston.com", "url": "http://www.boston.com/business/news/2015/10/18/jonathan-kraft-daily-fantasy-sports-think-should-regulated/phkRJ3VPD86TjbVeosQx6J/story.html", "country": "", "title": "Jonathan Kraft on daily fantasy sports: ‘I think it should be regulated’ - Business news", "performance_score": 0, "site": "boston.com", "participants_count": 1, "title_full": "Jonathan Kraft on daily fantasy sports: ‘I think it should be regulated’ - Business news", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T03:00:00.000+03:00", "replies_count": 0, "uuid": "bc54799c17c67ee1cceb02961fefafbe4c610dac"}, "author": "Adam Vaccaro", "url": "http://www.boston.com/business/news/2015/10/18/jonathan-kraft-daily-fantasy-sports-think-should-regulated/phkRJ3VPD86TjbVeosQx6J/story.html", "ord_in_thread": 0, "title": "Jonathan Kraft on daily fantasy sports: ‘I think it should be regulated’ - Business news", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Kraft Group, which owns the New England Patriots, is among the many high-profile investors in the Boston-based daily fantasy sports company DraftKings.\nAlong with its rival FanDuel and other competitors, DraftKings has become a flashpoint this football season. Daily fantasy sports companies have attracted the eye of lawmakers amid questions about their contests’ legality under state and federal laws, and concerns about the fairness and integrity of the games. Attorney general reviews, a reported federal probe , and calls for regulation have come amid a backdrop of seemingly endless advertisements on NFL broadcasts.\nAhead of the Patriots’ Sunday night game against the Colts, Kraft Group President Jonathan Kraft told the Patriots radio pregame show on 98.5 The Sports Hub that the companies should face some regulations.\n “I think both companies ... are both willing, and I think they welcome the oversight,” he said. “And what I’ve read of both companies’ CEOs, they’ve said everything should be transparent, and we’re open to regulation, which is probably the right next step. But I think fantasy sports is pretty much a part of mainstream culture now in our country, and I think it’s a nice element of what we have, and I think it should be regulated as well.”\nFanDuel said a week and a half ago that it would “look forward to speaking with regulators across the nation about how to define the right set of rules for our industry as it continues to grow.” DraftKings CEO Jason Robins told The Boston Globe he would be “open to, and accepting of, regulations put on us,” but that he did not think regulations were necessary.\nQuestions about the right regulations for the games differ from the mounting questions about whether they are legal in the first place, as many consider the big-money games a form of sports betting. The answer can vary state by state based on gambling laws. (Attorney General Maura Healey has said her office believes the games are legal under Massachusetts law.) A federal law, the Unlawful Internet Gambling Enforcement Act of 2006, exempted fantasy sports from an effective ban on most forms of online gambling. Kraft referenced that law in his interview.\n“Congress made it legal,” he said. “It’s interesting to me, over the last month or so with all the yelling out of Washington about how this is an unregulated industry–well, they have the right to regulate it. They chose to make it legal and not pass regulations.”\nThe 2006 law was passed before daily fantasy games had risen to prominence, when fantasy sports almost exclusively referred to the more traditional season-long contests. The coauthor of the law, former U.S. Rep. Jim Leach of Iowa, has said the fantasy sports exemption in the law was favored by the NFL and MLB, and the NFL is widely thought to have played a big role in securing the exemption, according to The New York Times .\nRobert Kraft and Roger Goodell through the years:\nPrevious -- of -- Next August 2006: Kraft strongly supports decision for Roger Goodell to replace Paul Tagliabue as commissioner of the NFL, tells USA Today that “he is ready for this job…Roger becoming commissioner is pretty special.” The Boston Globe/Jim Davis Previous -- of -- Next September 2007: After Goodell fined Bill Belichick and the Patriots for their roles in the Spygate scandal, Kraft declined immediate comment on the penalties. Kraft and Belichick later apologized to the NFL owners for the Patriots’ involvement in the controversy. Getty Images/Jim McIsaac Previous -- of -- Next February 2010: After Goodell was awarded a new contract by the owners, Kraft told the Associated Press “we're confident that he and his team will do what's for the best long-term interest of the league…having stability in our management team is critical.” AP Photo/Stephan Savoia Previous -- of -- Next May 2010: During a commencement speech at UMass Lowell, Goodell praises Kraft, who also spoke, saying the Patriots owner “has given this area and this region a lot to cheer for.” The Boston Globe/Jonathan Wiggs Previous -- of -- Next July 2011: With the 2011 NFL season in jeopardy due to a lockout, Kraft was instrumental in working with Goodell and the NFLPA to create a new collective bargaining agreement both sides could agree upon. Getty Images/Rob Carr Previous -- of -- Next Advertisement Previous -- of -- Next March 2013: Kraft told ESPN’s Outside the Lines in 2013 that “we really lucked out with [Goodell] as commissioner… I think Roger, once he assumed this position, really runs the NFL like he owns it and thinks like an owner.” AP Photo/Brandon Wade Previous -- of -- Next September 2014: Amid widespread criticism of Goodell’s handling of the Ray Rice case, Kraft told CBS that he supported how Goodell had issued a “mea culpa” and said Goodell setting a very clear policy how we conduct ourselves in the NFL “was excellent.” AP Photo/John Raoux Previous -- of -- Next January 2015: Kraft goes on the offensive as Deflategate begins to ramp up, saying in a press conference that he would expect the league to apologize to the Patriots if “the Wells investigation is not able to definitively determine” the team was directly responsible. AP Photo/Mark Humphrey Previous -- of -- Next May 2015: Kraft issues a statement that the Deflategate punishments “far exceeded any reasonable expectation… We recognize our fans’ concerns regarding the NFL’s penalties and share in their disappointment in how this one-sided investigation was handled.” AP Photo/Stephan Savoia Previous -- of -- Next May 2015: Bleacher Report’s Mike Freeman reported that the Deflategate situation had alienated Kraft and Goodell so much that an unnamed NFL owner characterized their relationship as “pretty much dead.” The Boston Globe/Matthew J. Lee Previous -- of -- Next Advertisement Previous -- of -- Next May 2015: On the morning of the NFL owners meetings, ESPN’s Adam Schefter reported that Kraft and Goodell “already have met, spoke and even hugged,” later saying that this could “help cool tensions between the two sides and help lead to truce on Deflategate.” AP Photo/Stephan Savoia Previous -- of -- Next May 2015: Speaking at the NFL owners meetings, Kraft said the team would “reluctantly” accept the NFL’s punishments and would not appeal the $1 million fine and loss of two draft picks, saying “I don’t want to continue the rhetoric that’s gone on for the last four months.” Getty Images/Elsa Previous -- of -- Next May 2015: Roger Goodell tells the media that Robert Kraft’s decision to accept the NFL’s penalties doesn’t have any effect on Tom Brady’s appeal of his four game suspension. AP Photo/Jeff Chiu", "external_links": ["http://www.nytimes.com/interactive/2015/10/15/us/sports-betting-daily-fantasy-games-fanduel-draftkings.html?_r=0", "https://www.bostonglobe.com/business/2015/10/07/draftkings-ceo-says-fantasy-sports-industry-doesn-need-regulation-ensure-fair-play/EHQ08NHXBIMAXVNhWXfxLO/story.html", "https://www.bostonglobe.com/business/2015/10/16/top-nevada-gambling-official-hits-back-draftkings-accusation-casino-influence/9inAokhBhSZKYFLcxRUbyJ/story.html", "http://www.bostonglobe.com/business/2015/10/14/feds-probe-fantasy-sports-business-wall-street-journal-reports/vBOioWgDRxbPBjsJHYdo1N/story.html"], "published": "2015-10-18T03:00:00.000+03:00", "crawled": "2015-10-19T06:08:04.904+03:00", "highlightTitle": ""}