{"organizations": [], "uuid": "9d8c1b54a0cdde1761700ec5b8992ab8f4b7bdfc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "billingsgazette.com", "main_image": "http://bloximages.chicago2.vip.townnews.com/billingsgazette.com/content/tncms/assets/v3/editorial/d/1e/d1eb7f0d-fcf7-5d82-b81a-6427abca1f2b/56270c499164b.image.jpg?resize=620%2C427", "site_section": "http://billingsgazette.com/search/?f=rss&t=article&c=sports/high-school*&l=25&s=start_time&sd=desc", "section_title": "billingsgazette.com - RSS Results in sports/high-school* of type article", "url": "http://billingsgazette.com/sports/high-school/volleyball/packed-in-pink-honors-cancer-survivors-remembers-those-lost/article_2a04085e-f692-5a5d-a76d-acf66857d24a.html", "country": "US", "title": "Packed in Pink honors cancer survivors, remembers those lost", "performance_score": 0, "site": "billingsgazette.com", "participants_count": 1, "title_full": "Packed in Pink honors cancer survivors, remembers those lost", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T08:00:00.000+03:00", "replies_count": 0, "uuid": "9d8c1b54a0cdde1761700ec5b8992ab8f4b7bdfc"}, "author": "MIKE SCHERTING mscherting@billingsgazette.com", "url": "http://billingsgazette.com/sports/high-school/volleyball/packed-in-pink-honors-cancer-survivors-remembers-those-lost/article_2a04085e-f692-5a5d-a76d-acf66857d24a.html", "ord_in_thread": 0, "title": "Packed in Pink honors cancer survivors, remembers those lost", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Buy Now CASEY PAGE/Gazette Staff \nPack the Place in Pink honoree Kerri Kanning gets a hug and a rose from West players Kelly Thomas, left, and Julia Nielson before the game against Skyview on Tuesday. Buy Now CASEY PAGE/Gazette Staff \nWest's Cody Rogers (1) hits against Skyview's Jacey Reiter (13) in the first set at Pack the Place in Pink on Tuesday. Buy Now CASEY PAGE/Gazette Staff \nWearing face paint and a pink mohawk, Haley Droogsma, 13, cheers for Skyview at Pack the Place in Pink night on Tuesday. \nUpon being introduced before the match, most of the players were able to hand off their rose to a cancer survivor standing just off the sidelines of the court. Other players weren’t as fortunate — the 10 roses in the vase at center court represented people who couldn't be there. \nSkyview’s Molly Little, who turned in a terrific match in helping the Falcons sweep West 25-20, 25-15, 25-19, was one of those to take the walk to center court to fill the vase. \n“You need to honor those people who have fought through it,” Little said. “Just going through those emotions and playing for someone is just amazing. I’m humbled by it. It just gets you in the heart.” \nAnd just think. Moments after participating in an opening ceremony like that, the players had to turn around and compete. \n“You can cry about it for a few, then get right back out there,” Little said. “We’ve got a game to play. We’ve got to come out hard and get it done.” \nThe Falcons were definitely on the getting it done side. Led by Little’s 17 kills, 10 from Jedera Liddell and seven from Jacey Reiter, they rarely trailed in any of the three sets. \nBut coach Vicki Carle, who has had her own two battles with breast cancer, was happier with how her kids performed off the court. \n“I’m just proud that our parents and our kids wanted to honor these women,” Carle said, “because they deserve that and more.” \nTo a girl, the Falcons players know what this night has come to mean to Carle and the PPP non-profit, which has handed out more than $150,000 to survivors throughout Montana. And, for the players who participate in it for the duration of the high school years, what it comes to mean to themselves. \n“It’s always been about more than just the volleyball,” said Little, a senior playing in her last PPP. “It’s … it’s a lot. You just get a little bit teary because all those people who have fought and fight and who just couldn’t get through it. A lot of emotions.” \nAnd 10 pink roses in a vase at center court.", "external_links": [], "published": "2015-10-21T08:00:00.000+03:00", "crawled": "2015-10-21T08:35:26.630+03:00", "highlightTitle": ""}