{"organizations": [], "uuid": "8e54243ff04731bfc1e552e74690f45b74d2ea62", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxsports.com", "main_image": "http://www.foxsports.com/content/fsdigital/fscom.img.png", "site_section": "http://api.foxsports.com/v1/rss?partnerKey=zBaFxRyGKCfxBagJG9b8pqLyndmvo7UU&tag=cfb", "section_title": "FOX Sports Digital", "url": "http://www.foxsports.com/college-football/story/auburn-kentucky-preview-101415", "country": "", "title": "Kentucky prepares for first Thursday home game in 76 years", "performance_score": 0, "site": "foxsports.com", "participants_count": 0, "title_full": "Kentucky prepares for first Thursday home game in 76 years", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T01:09:00.000+03:00", "replies_count": 0, "uuid": "8e54243ff04731bfc1e552e74690f45b74d2ea62"}, "author": "", "url": "http://www.foxsports.com/college-football/story/auburn-kentucky-preview-101415", "ord_in_thread": 0, "title": "Kentucky prepares for first Thursday home game in 76 years", "locations": ["Kentucky"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Kentucky prepares for first Thursday home game in 76 years AP \nOct 14, 2015 at 6:09p ET +   6:09p ET \nLEXINGTON, Ky. (AP) Kentucky has not hosted a Thursday football game in 76 years, so Wildcats players have had their nationally televised matchup with Auburn circled on their calendars for a while now. \nWhile Kentucky had a weekend off to get ready the Southeastern Conference showdown, the Wildcats (4-1, 2-1 SEC) haven't beaten the Tigers (3-2, 0-2) at home since 1966. After upsetting then-No. 25 Missouri last month, Kentucky players believe this game can help define the program's quest for respectability. \nThe Wildcats' challenge is avoiding stage fright against an Auburn program unexpectedly facing urgency. \n''We got caught up in the moment against Florida , and that didn't work out for us,'' Kentucky quarterback Patrick Towles said. ''If we take the same mentality that we did against Missouri, we'll have a good time and it'll be a good result.'' \nKentucky seeks a second straight 5-1 start and enters its first Thursday night home game at Commonwealth Stadium with a two-game winning streak. Auburn is also coming off a bye as it seeks its first conference win following losses to LSU and Mississippi State. \nThe Tigers have dominated this series 25-6-1 and won eight straight in Lexington, including a 37-34 victory in 2010. That was the last season the Wildcats went to a bowl game, and they've made it clear their goal is getting back to postseason. \nAuburn has the same mission, but what seemed like a given when the season started is now a must-win situation for the Tigers. \n''I think they understand that it's a big game,'' Auburn coach Gus Malzahn said. ''Our guys understand that we are playing a good team, a team that's played three SEC games and won two of them. We've got to be ready and play good football.'' \n--- \nHere are other things to watch when Kentucky hosts Auburn: \nFROM GOAT TO GO-TO: Since an early end-zone drop quickly switched momentum in Kentucky's loss to Florida, receiver Dorian Baker has become the Wildcats' clutch performer. After his touchdown catch in the back of the end zone forced overtime against Eastern Kentucky, he caught the game-winner to finish with a career bests of eight catches for 86 yards. His three TDs have come in the past two games. \nQB COIN-FLIP: Auburn's choice under center could be a game-time decision between redshirt freshman Sean White - who has started the past two contests - and junior Jeremy Johnson . Malzahn hinted at a package for both QBs, and linebacker Justin Garrett said the team is in good hands either way. ''Whoever gets out there is who we trust and who the team is going to rally behind,'' Garrett said. \nBOOM IS BACK: Leading rusher Stanley ''Boom'' Williams is back atop Kentucky's depth chart after missing the EKU game to deal with personal issues, and the sophomore's mission is improving a ground game that mustered just 55 yards in his absence. Williams leads Kentucky with 343 yards rushing and his return provides a speedy complement to hard-running Jojo Kemp . Coach Mark Stoops looks forward to seeing what Williams can do for the offense following his break and said this week, ''we are a lot better with him out there.'' \nRUN DEFENSE: Both teams rank near the bottom in the SEC against the run, but last-place Auburn has struggled in particular under former Florida coach and first-year defensive coordinator Will Muschamp. The Tigers are yielding nearly 209.6 yards per game, nearly 40 more than the Wildcats (170.6). \nSTILL PERFECT: Kentucky remains one of five teams to convert all of its chances inside the 20, having scored 12 touchdowns on 16 opportunities this season and 27 straight going back to last October. \n--- \nAP Sports Writer John Zenor in Alabama contributed to this report. \n---", "external_links": [], "published": "2015-10-15T01:09:00.000+03:00", "crawled": "2015-10-15T01:22:55.464+03:00", "highlightTitle": ""}