{"organizations": ["All Blacks France Plot Another Famous Upset of the All Blacks", "Reuters"], "uuid": "fe69533dd7fa43c971f7c2e5d7bef6841dddc1e7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "jakartaglobe.beritasatu.com", "main_image": "http://img.thejakartaglobe.com/2015/10/2015-10-11T175149Z_87587509_MT1ACI14069890_RTRMADP_3_RUGU-1024x642.jpg", "site_section": "http://jakartaglobe.beritasatu.com/rss/sports/", "section_title": "Sports | Jakarta Globe", "url": "http://jakartaglobe.beritasatu.com/rugby/france-plot-another-famous-upset-blacks/", "country": "ID", "title": "France Plot Another Famous Upset of the All Blacks", "performance_score": 0, "site": "beritasatu.com", "participants_count": 0, "title_full": "France Plot Another Famous Upset of the All Blacks", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T08:36:00.000+03:00", "replies_count": 0, "uuid": "fe69533dd7fa43c971f7c2e5d7bef6841dddc1e7"}, "author": "", "url": "http://jakartaglobe.beritasatu.com/rugby/france-plot-another-famous-upset-blacks/", "ord_in_thread": 0, "title": "France Plot Another Famous Upset of the All Blacks", "locations": ["France"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Julien Pretot", "Toby Melville", "Thierry Dusautoir"], "text": "France Plot Another Famous Upset of the All Blacks i France's Thierry Dusautoir looks dejected after the game. (Reuters Photo/ Toby Melville) By : Julien Pretot | on 7:36 PM October 12,   Rugby \nCardiff. France are never as dangerous as when they have their backs against the wall and with a Rugby World Cup quarter-final against New Zealand looming they should be in their favorite position. \nLes Bleus were humbled 24-9 by Ireland in their final Pool D game, a dismal performance which cast serious doubts over their ability to beat the All Blacks as they famously did in the 1999 and 2007 tournaments. \n\"We have no time to think about the defeat [against Ireland], we enter another competition, it's the knockout phase now. We will prepare with enthusiasm and appetite,\" coach Philippe Saint-Andre told a news conference on Monday. \n\"Our players are built for this, it's a very long competition. It's a different competition,\" he said. \n\"They have this experience from the French domestic league.\" \nFrance beat the All Blacks 20-18 in the 2007 quarter-finals in Cardiff, eight years after coming from behind to secure a spectacular 43-31 semi-final victory against all the odds. \nThey have, however, lost their last nine tests against the world champions. \n\"We don't play the All Blacks, we play New Zealand,\" Saint-Andre said. \n\"We represent France and they represent New Zealand. The history of the World Cup says everything can happen. When you're French it's not good when you're favorite.\" \nSaint-Andre was asked how previous achievements against the All Blacks could inspire France and he admitted that a few good memories would not be enough to beat New Zealand who cantered through the pool phase. \n\"[Captain] Thierry Dusautoir can talk about it [the 2007 quarter-final win] but we will need other ingredients,\" he said. \n\"New Zealand will go into this game with a lot of confidence, we're going to prepare in order to disrupt that confidence.\" \nFrance struggled against Ireland in their first big test of the tournament, lacking ideas and dominated by the Irish forwards at the breakdown. \n\"We'll need more anger on the rucks,\" Saint-Andre said. \n\"The rucks are about technique but it's also a matter of determination.\" \nThe key for France, however, might just be to relax in the hope of rediscovering the flair that has traditionally made them such an unpredictable team. \n\"If we don't rebel this week, we'll never rebel. We must prepare like a commando unit. We must not think, we must just play rugby,\" Saint-Andre said. \nReuters", "external_links": [], "published": "2015-10-12T08:36:00.000+03:00", "crawled": "2015-10-13T04:12:34.128+03:00", "highlightTitle": ""}