{"organizations": ["Tottenham"], "uuid": "e25e2150dc97d75811bee1a1009bbabdf4ade884", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sport.co.uk", "main_image": "http://images.sport.co.uk/150x150/82746b4e74ca567728d5344973a40fb3.jpg", "site_section": "http://feeds.feedburner.com/SportcoukNewsRssFeed", "section_title": "General Sports News from Sports.co.uk", "url": "http://www.sport.co.uk/football/harry-kane-hits-hattrick-for-tottenham-bournemouths-artur/6989957/", "country": "JE", "title": "Harry Kane hits hat-trick for Tottenham, Bournemouth's Artur Boruc has nightmare", "performance_score": 0, "site": "sport.co.uk", "participants_count": 0, "title_full": "Harry Kane hits hat-trick for Tottenham, Bournemouth's Artur Boruc has nightmare", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T18:16:00.000+02:00", "replies_count": 0, "uuid": "e25e2150dc97d75811bee1a1009bbabdf4ade884"}, "author": "", "url": "http://www.sport.co.uk/football/harry-kane-hits-hattrick-for-tottenham-bournemouths-artur/6989957/", "ord_in_thread": 0, "title": "Harry Kane hits hat-trick for Tottenham, Bournemouth's Artur Boruc has nightmare", "locations": ["Bournemouth"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Harry Kane", "Artur Boruc"], "text": "Harry Kane hits hat-trick for Tottenham, Bournemouth's Artur Boruc has nightmare 25 Oct 2015 16:16:53 \ncomments \nHarry Kane returned to form as he struck a hat-trick to sink sorry Bournemouth. \nThe England international had scored just once for Spurs this season heading into the clash at the Vitality Stadium but showed his finishing touch had not deserted him as he scored three in the 5-1 mauling of Eddie Howe's side. \nThe hosts had raced into a 49-second lead thanks to Matt Ritchie's smart finish but a string of errors from goalkeeper Artur Boruc proved to be Bournemouth's undoing as Kane helped himself to a hat-trick, with Mousa Dembele and Erik Lamela also on the scoresheet. \nBoruc, returning to the starting line-up after missing the 5-1 loss to Manchester City last week due to an injury in the warm-up, had a day to forget while Kane, who was courted by Howe during his tenure at Burnley, has the match-ball as a memento from what he will hope is the turning point of his season. \nIt started so promisingly for the hosts as they took the lead inside the first minute as a cross from Charlie Daniels evaded everyone in the middle, with Ritchie arriving at the back post to score. \nRitchie's early strike was cancelled out by Kane's equaliser from the penalty spot after he had been felled by Boruc. \nTottenham then took the lead as Danny Rose's speculative effort deflected fortuitously into the path of Dembele, who coolly finished past Boruc, picking up a knock in the process. \nBoruc did well to prevent Toby Alderweireld scoring the third when he kept out his near-post header but the experienced Polish stopper's afternoon did not get any better as he was culpable for Tottenham's next goal on the half-hour mark. \nKane wriggled free on the left but could only hit a tame cross into the box. However Boruc failed to hold it and spilt the ball straight into the path of Lamela, who made no mistake. \nBournemouth were still creating chances of their own and were unlucky not to reduce the arrears just before the interval as Marc Pugh saw a scuffed effort cleared off the line by Alderweireld before King hit the inside of the post moments later. \nBoruc almost produced another moment to forget shortly after half-time as he took his time in clearing the ball and Dembele charged down his kick, although thankfully for the goalkeeper it rebounded straight back to him. \nHe could do nothing to stop the fourth Spurs goal as Kane slid in to convert Eriksen's cross and put the result beyond doubt. \nWith Kane in search of his second Premier League hat-trick, the England striker came close with a rasping shot that Boruc turned behind - but the wait would only go on for a few more seconds. \nThe resulting corner was headed towards goal by Alderweireld and again Boruc could not hold on. Kane was on hand to score his third of the afternoon. \nRitchie was the chief goal-threat for the shell-shocked hosts and forced Lloris into action with a long-range strike before Eriksen's fine effort came back off the post for Spurs. \nKane had legitimate calls for a second penalty turned down by referee Roger East as he looked to capitalise on yet another Boruc spill, with the goalkeeper catching Kane's leg as he looked to recover. \nThe striker was taken off with little over five minutes remaining, to be replaced by Clinton Njie. He failed to open his Tottenham account due to a smart stop by Boruc. Related Sport News", "external_links": [], "published": "2015-10-25T18:16:00.000+02:00", "crawled": "2015-10-26T20:23:57.479+02:00", "highlightTitle": ""}