{"organizations": [], "uuid": "b37f4986275125a0e4778e066016b98c210af2a5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pendletontimespost.com", "main_image": "", "site_section": "http://pendletontimespost.com//feed/sec/6000/", "section_title": "PendletonTimesPost.com - Sports News", "url": "http://www.pendletontimespost.com/view/story/2360c9767ca645ae9522f2409dc98657/GYM--Biles-Takes-Charge/", "country": "US", "title": "As Rio nears, gymnastics' Biles is ready to take charge", "performance_score": 0, "site": "pendletontimespost.com", "participants_count": 0, "title_full": "As Rio nears, gymnastics' Biles is ready to take charge", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T09:44:00.000+03:00", "replies_count": 0, "uuid": "b37f4986275125a0e4778e066016b98c210af2a5"}, "author": "", "url": "http://www.pendletontimespost.com/view/story/2360c9767ca645ae9522f2409dc98657/GYM--Biles-Takes-Charge/", "ord_in_thread": 0, "title": "As Rio nears, gymnastics' Biles is ready to take charge", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Simone Biles", "Biles"], "text": "On the cusp of adulthood and stardom, gymnastics' Simone Biles stays grounded By WILL GRAVES AP Sports Writer   2:43   2:44   \nSubjects: \nVideo: \n18-year-old Simone Biles is poised to be the new face of US Gymnastics as the 2016 Olympic Games approach. But first the defending world all-around champion will go for a three-peat at the 2015 championships in Glasgow, Scotland this month. (Oct. 22) Photo Gallery: \nClick to view (9 Photos) \nCONROE, Texas — The little girl had to be in charge. It was her way of taking control. Of protecting her younger sister. Of trying to find order during a time when it was in short supply. \nSo Simone Biles anointed herself the boss, ordering around little sis Adria in their new home to give her something familiar to hold onto. The girls, Adria still in diapers, were living with their grandparents in Texas while their mother struggled with addiction back in Ohio. \n\"She thought she was a little mom in the house,\" Nellie Biles said. \"She made decisions for herself and her sister because this was all they knew.\" \nNellie Biles and husband Ron adopted the girls 15 years ago, providing the structure they needed. They also unknowingly set the foundation that helped produce what could be the greatest gymnast of her generation. \nStardom, the kind that truly changes a life, awaits Simone Biles. The two-time defending world all-around champion will go for a three-peat at the 2015 championships Glasgow, Scotland starting this weekend. The ever-growing speck in the distance that is the 2016 Summer Olympics creeps closer by the day. \n\"It's a little bit scary,\" Biles said. \nYet hardly intimidating. \nBiles has almost everything she'll need for that journey. The infectious smile that already has sponsors writing checks. The accessible personality and the soaring routines that NBC's high definition cameras will beam into millions of homes next summer. The talent to make her the next in a long line of American gymnastics royalty that stretches from Gabby to Nastia to Carly to Mary Lou. \nMost important: the support of a home life that strips away the hype and her own towering expectations and allows her to be just another 18-year-old. \n\"I want her to be normal,\" Nellie Biles said. \"I want her to be able to say, 'I'm tired, I don't want to be bothered.\" \nAt home, she's just a teenager who requested a belly ring after her first world title in 2013. The daughter whose chores include feeding the family's four dogs. The girl who better be at her seat for Sunday dinner regardless of whatever time zone she may have been in the day before. \nIt's a contrast to those difficult early days. \nSimone Biles was born in Columbus, Ohio on March 14, 1997. Her mother, Shanon Biles, struggled off and on with drugs and alcohol. \nAt one point, Ron Biles received a phone call from a social worker telling him all four of his grandchildren were in foster care. He flew to Ohio and brought all of them to Texas only to have them head back with their mother after less than a year. It didn't last. \nHis daughter's parental rights were terminated shortly thereafter, with Ron Biles taking in Simone and Adria while his older sister adopted Shanon's two other children. \nIt wasn't exactly the life Nellie Biles had planned. When the girls arrived for good in late 2000, she was preparing to be an empty nester, with two sons getting ready for college. Now she had a 3-year-old old and a toddler. There were tears and prayer and the kind of soul searching she wasn't expecting at 50 approached. \n\"It was a hard transition for me because they didn't have any connection to me and I didn't have any connection to them,\" Nellie Biles said. \nTwo years of counseling followed, Ron and Nellie figuring out how to make it work. And it did. Maybe that's why the Biles have never felt the need to talk about it. \nEven Simone's coach, Aimee Boorman, didn't know. Biles walked into Bannon's Gymnastix on a daycare field trip and walked out with a bug that transformed into something far more than flipping around. But the Biles didn't share their backstory until years later. They weren't keeping a secret, exactly. It just didn't seem important. \nThough Simone remains in contact with Shanon Biles, she is quick to correct anyone that calls Shanon her mother. Shanon Biles is her biological mother. Nellie Biles is Mom. \nShanon Biles made the drive from Ohio to watch Simone win her second straight national title at the 2014 U.S. Championships in Pittsburgh. It was nice weekend, but it wasn't the beginning of some kind fresh start. There will be no shot of Shanon Biles in the stands at Rio next summer. \n\"It's not something we bring her into because that would just blow it up and make it bigger,\" Simone said. \"We're just trying to keep it small.\" \nAs small as possible anyway. The drumbeat of celebrity is growing louder. There have been random knocks at the hotel room door by well-meaning but overzealous fans. There are major brands lining up to be associated with Biles, something she admits kind of \"freaks me out.\" Mention to her she's still not verified on Twitter and she counters that she is on Instagram. \nShe verbally committed to UCLA, but then signed with an agent this summer. School will always be there. The opportunities that could pop up if she wins Olympic gold will not. \nHer parents offered advice but left the choice up to her, just as they did when she graduated from the eighth grade and had to pick between attending high school or being home schooled, which offered a flexible schedule more amenable to a world-class athlete who spends over 30 hours a week in the gym. \nShe chose to stay home, another important step in a journey that has brought her simultaneously to the cusp of adulthood and stardom. \nIn a way, the Biles have all found a new identity through gymnastics. It is more than something their daughter does. The Biles are in the process of moving into a massive new space for their gym, a 50,000 square foot monolith that will include a taekwondo studio, a fitness center for parents, a study room for siblings and a training facility that will make the Karolyi Ranch — the home of USA Gymnastics located 45 minutes north — look antiquated. \nBiles has no plans to one day join the family business. Her parents are fine with that, for now anyway. Like most 18-year-olds, Biles has no idea what she wants to be when she grows up. For now, she is the Olympics' Next Big Thing. \nThat's a lot of weight to carry on even her well-defined shoulders. Yet if the pressure gets to her, it hardly shows. Blame it on a sense of normalcy provided by a family cobbled together by circumstance and kept together by something far deeper. And blame it on a toughness that simply can't be taught. \n\"She's a survivor,\" Nellie Biles said. \"She's been a survivor from a very, very young age.\" \nAll content copyright ©2015 Pendleton Times-Post, a division of Home News Enterprises unless otherwise noted.", "external_links": [], "published": "2015-10-22T09:44:00.000+03:00", "crawled": "2015-10-22T11:14:09.439+03:00", "highlightTitle": ""}