{"organizations": [], "uuid": "fe14b52f062004254b662b5da6066bbd72b4b5cd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "http://www.bostonherald.com/sites/default/files/media/1985/12/03/05Buck.jpg", "site_section": "http://bostonherald.com/sports", "section_title": "Sports | Boston Herald", "url": "http://bostonherald.com/sports/patriots_nfl/new_england_patriots/2015/10/buckley_why_patriots_wont_go_16_0", "country": "US", "title": "Buckley: Why Patriots won't go 16-0", "performance_score": 0, "site": "bostonherald.com", "participants_count": 4, "title_full": "Buckley: Why Patriots won't go 16-0 | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 3, "uuid": "ea7c3c8938bc6f1a7945cbf636984a5ffb3aafd6"}, "author": "Steve Buckley", "url": "http://bostonherald.com/sports/patriots_nfl/new_england_patriots/2015/10/buckley_why_patriots_wont_go_16_0#post-0", "ord_in_thread": 0, "title": "Buckley: Why Patriots won't go 16-0", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "It wouldn’t be surprising to learn Roger Goodell is behind all this talk about the “revenge-minded” Patriots going 16-0 during the regular season.\nMakes sense, don’t you think? Having seen his double-secret, four-game probation of Tom Brady get sacked for a loss in a Manhattan federal courtroom, Goodell needs to do something to prove to NFL owners, again, that he’s not just a Kraft family lawn ornament, that he really is tough on crime, that he’s all about protecting the honor of “the shield” . . . blah, blah, blah.\nAN OPPOSING VIEW: Guregian: Why Patriots can go 16-0\nSo he starts dialing in to the Boston talk shows — “Roger from Marblehead” has a nice to ring to it — and makes with the non-stop 16-0 whistle-stop campaign. Next thing you know, all the hosts are talking about it, the writers are writing about it, and, on some level, the players are thinking about it.\nAnd here we are.\nOK, I’m just making all that up. It’s nonsense. But it’s no more nonsensical to be talking about the Patriots going 16-0, a discussion that’s wrong on so many levels.\nLet’s start here: It’s not going to happen.\nWhile it’s true that a lot of this year’s NFL looks like a reality TV pilot episode of “Who Wants to Play in the Canadian Football League?” the for-real is that it’s really, really hard to run the board from Labor Day into the new calendar year.\nIn the era of the 16-game schedule, only one team — your 2007 New England Patriots — has gone undefeated in the regular season. And that’s a big part of the problem: The ’07 Patriots are fresh in our minds. We were all there. We saw the weekly beatdowns. And not only do the 2015 Patriots have the same genius coach (Bill Belichick) and the same best-of-all-time quarterback (Brady) as the ’07 Pats, they also have a similar “cause” around which everyone can rally.\nThe ’07 Pats had Spygate. The ’15 Pats have Deflategate. And just as the ’07 Pats roared through the regular season, winning with such ease that critics claimed they were “running it up,” now we have the 3-0 Pats, who last week scored on every possession en route to a 51-17 dismantling of the Jacksonville Jaguars.\nPut it all together — the scrapbook filled with memories of 2007, the retooled quest for revenge, the awareness of how much bad football is being played in other NFL ports — and it’s easy to see the Pats going 16-0.\nExcept that it’s not easy. And it’s a little silly to think it could happen with this season’s Pats.\nThe history books are filled with tales of powerhouse NFL teams that at some point during the regular season stubbed a toe and lost a game or two. Remember the 1985 Chicago Bears? Of course you do, because they rolled to a 46-10 victory over the Patriots in Super Bowl XX. The ’85 Bears went 15-1. Their one loss was to the Miami Dolphins, who later lost to the Patriots in the AFC title game.\nAnd don’t forget the ’89 San Francisco 49ers of Joe Montana, Jerry Rice and Roger Craig. They were 55-10 victors over Denver in Super Bowl XXIV, but they still lost two games during the regular season.\nI could provide so many more examples, but let’s go back to the 2007 Pats. They were lucky to escape Baltimore with a 27-24 victory over the Ravens — lucky because Ravens defensive coordinator Rex Ryan had called a timeout late in the game, just before Brady was snuffed on fourth-and-1 at the Baltimore 30. The Pats eventually got into the end zone and barely held on for the win — with the Ravens receiver Mark Clayton catching a 52-yard Hail Mary from Kyle Boller and getting tackled at the Pats 3 as time ran out.\nTwo weeks later, in what was supposed to be a score-settling showdown with the Jets, whose coach, Eric Mangini, was the Spygate whistleblower, the Pats scored only one offensive touchdown at a freezing, windy, rainy Gillette Stadium. They came out of the game with 20-10 victory over New York.\nAnd don’t forget the regular-season finale in the Meadowlands, where the Pats and New York Football Giants engaged in a shootout. Final score: Pats 38, Jints 35.\nThe lesson here: In order to go 16-0, it’s not just about your own talent, though that’s obviously a big part. And it’s not just about the opposition’s lack of talent.\nSo much has to go right.\nAnd you need a little luck.\nWhich is why it hardly ever happens.", "external_links": [], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-05T15:09:02.128+03:00", "highlightTitle": ""}