{"organizations": ["Bergen Tech"], "uuid": "523e0f3c8257ecb338f5cfdd71f00fa8a910ab37", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.northjersey.com", "main_image": "http://www.northjersey.com/designimages/NorthJerseyFacebook_377x196.jpg", "site_section": "http://www.northjersey.com/cmlink/high-school-sports-rss.rss", "section_title": "High School Sports on NorthJersey.com", "url": "http://www.northjersey.com/sports/high-school-sports/football/bergen-tech-hush-hush-on-football-playoffs-1.1441301", "country": "US", "title": "H.S. football: Bergen Tech hush-hush on playoffs", "performance_score": 0, "site": "northjersey.com", "participants_count": 0, "title_full": "H.S. football: Bergen Tech hush-hush on playoffs", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T07:21:00.000+02:00", "replies_count": 0, "uuid": "523e0f3c8257ecb338f5cfdd71f00fa8a910ab37"}, "author": "", "url": "http://www.northjersey.com/sports/high-school-sports/football/bergen-tech-hush-hush-on-football-playoffs-1.1441301", "ord_in_thread": 0, "title": "H.S. football: Bergen Tech hush-hush on playoffs", "locations": ["H.S."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Print \nWant to talk about the North 1, Group 5 football playoffs? Well, don’t ask Bergen Tech. \nThe Knights (6-1), who play an independent schedule, are on the verge of clinching only the second playoff spot in program history. They go into Thursday night’s game against Immaculate Conception sitting at No. 5 in the North 1, Group 5 power-point standings, and holding much of their fate in their hands. \nBut playoff fever isn’t really sweeping the Tech locker room. Not because the Knights don’t care, but rather because they do. \n\"It’s against the rules,\" coach Brian Meeney said with a laugh. \"We don’t look ahead. We just want to win this week. \n\"Be 1-0 every week. That’s what we say, and that’s what we believe.\" \nThat’s their mantra, and, much to their credit, they’re sticking to it. \nThe school has three campuses, and the players aren’t all together all day. Meeney said folks in the community have tried to talk playoffs with the Knights, but they are true believers in the coach’s approach. \n\"They stay true,\" Meeney said. \"They just say, ‘We don’t talk about that.’ \" \nMeeney does have a little confession. He does sneak a peek at the power-point standings every week. \n\"Of course I do,\" Meeney said. \"I’d be lying if I said I didn’t. But I don’t let it consume me. \n\"I didn’t invent this approach. I think a lot of the successful guys out there have similar attitudes.\" \nPassaic Tech is the undisputed favorite in North 1, Group 5, with Ridgewood and Hackensack as chief contenders. If the playoffs began today, Eastside and Clifton would also be in, so this is a pretty interesting mix. \nBergen Tech has won four straight, and scored 30 or more points in each game. No one is going to mention them in the same breath as PCT, but the Knights have a right to be proud about all they’ve accomplished thus far. \nOnce they are willing to talk about it, of course. \n\"These kids come ready to practice every day,\" Meeney said. \"It’s all about what they do during the week. They know what they have to do to give us a decent opportunity to win.\" \nTech’s success is built around keeping the ball on the ground and playing solid defense. It’s nothing flashy, but it suits that one-game-at-a-time approach to a tee. \nAnd there are Tech players who have performances worth bragging about. Junior fullback Mike Nowak has run for 1,094 yards and 11 touchdowns, while senior running back Roddy Acuna has churned out 487 yards and four touchdowns. \nIt would be cool to see the Knights in the playoffs. New faces, after all, are part of what makes the big dance so much fun.  ", "external_links": [], "published": "2015-10-26T07:21:00.000+02:00", "crawled": "2015-10-26T09:45:36.015+02:00", "highlightTitle": ""}