{"organizations": [], "uuid": "3ff23814a168417f47ca18dceac5d8ccdc67a269", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wcax.com", "main_image": "", "site_section": "http://www.wcax.com/category/13571/political-news", "section_title": "Political News - WCAX.COM Local Vermont News, Weather and Sports-", "url": "http://www.wcax.com/story/30260482/pilot-student-aid-expansion-for-non-traditional-education", "country": "US", "title": "Pilot student aid expansion for non-traditional education", "performance_score": 0, "site": "wcax.com", "participants_count": 1, "title_full": "Pilot student aid expansion for non-traditional education - WCAX.COM Local Vermont News, Weather and Sports-", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "3ff23814a168417f47ca18dceac5d8ccdc67a269"}, "author": "wcax.com", "url": "http://www.wcax.com/story/30260482/pilot-student-aid-expansion-for-non-traditional-education", "ord_in_thread": 0, "title": "Pilot student aid expansion for non-traditional education", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By JENNIFER C. KERR\nAssociated Press WASHINGTON (AP) - Thousands of students could be eligible for federal student aid as part of a new pilot program that will offer certificates and college credit for non-traditional programs like boot-camp style computer science training.\nThe Education Department announced the experimental three-year pilot Wednesday, saying it hopes to reach several thousand people, particularly low-income students who wouldn't otherwise have access to the courses. Currently, only programs offered by accredited schools are eligible to receive federal student aid and loans.\nUnder the pilot, colleges and universities would have to set up partnerships with the non-traditional educational providers, including short-term intensive training programs in subjects like web design, software coding and data science, as well as MOOCs, or massive open online courses.\nIn 2015 alone, the department said, the number of students graduating from coding boot camps is expected to increase by 240 percent, from about 6,700 students last year to over 16,000 this year.\nThese sorts of new partnerships \"should prepare students for jobs that are available in that region at that time, providing the student with a great salary boost,\" said senior department official David Soo.\nStudents could also get academic credit that would help them continue a post-secondary education.\nColleges and universities would work with third-party companies to vet the programs to make sure they meet the schools' standards. The school's accrediting agency also would have to decide whether the program falls within the school's accreditation.\nThe Education Department did not have an estimate on how much the pilot program would cost. It said it hoped to reach several thousand students.\nThe department's pilot program would fall under the experimental sites section of the Higher Education Act of 1965. It gives federal officials the flexibility to test the effectiveness of temporary changes to the way federal student aid is distributed.\n ", "external_links": [], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-16T07:13:52.533+03:00", "highlightTitle": ""}