{"organizations": [], "uuid": "7b39fea80129500fdc9fd4dc2769247cbe2d53f2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/Category/6/55/Sports/World.aspx", "section_title": "World - Sports - Ahram Online ", "url": "http://english.ahram.org.eg/NewsContent/6/55/161452/Sports/World/Bayern-Munich-missing-perfection,-luck-in-seasons-.aspx", "country": "EG", "title": "Bayern Munich missing perfection, luck in season's first defeat", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "Bayern Munich missing perfection, luck in season's first defeat - World - Sports - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "7b39fea80129500fdc9fd4dc2769247cbe2d53f2"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/6/55/161452/Sports/World/Bayern-Munich-missing-perfection,-luck-in-seasons-.aspx", "ord_in_thread": 0, "title": "Bayern Munich missing perfection, luck in season's first defeat", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bayern Munich bosses leapt to the defence of goalkeeper Manuel Neuer after the German champions suffered their first loss of the season, 2-0 at Arsenal on Tuesday, after luck and their usual lethal touch in front of goal deserted them.\nThe German World Cup winner gifted Arsenal the opening goal in a rare moment of uncertainty, when he came out to meet a Santi Cazorla free kick but flapped at the ball and substitute Olivier Giroud bundled it home for the first goal Bayern have conceded in the competition.\n\"In the Champions League you have to be perfect in every aspect of your game and we weren't perfect in some of them,\" Bayern coach Pep Guardiola told reporters.\n\"We did not lose because of Manuel Neuer because he made some superb saves in the first half. We had enough chances to decide the game in our favour,\" the coach said.\n\"We came here to close our qualification and we could not do that so we now have to go to the next game.\"\nThe Germans had won their previous 12 matches in all domestic and European competitions this season in a record-breaking season start but it proved an unlucky 13 as they suffered a rare defeat.\nWith the English side playing an unusually defensive game at the start, Bayern could have scored on several occasions but neither Robert Lewandowski nor Thiago Alcantara could convert their chances before Neuer's blunder.\nInstead it was Arsenal who scored twice, with German Mesut Ozil sealing the win in stoppage time.\n\"Obviously a defeat is never nice but I think it was still a high-level Champions League game,\" said Bayern CEO Karl-Heinz Rummenigge.\n\"The luckier team won but it could equally have been us. But in two weeks time in the game in Munich against Arsenal we will turn it around.\"\nBayern are still top of Group F on six points, as many as Greek champions Olympiakos, with Arsenal on three along with Dinamo Zagreb.\nThe Bavarians, eyeing a record fourth consecutive Bundesliga title, are again considered Champions League contenders, a trophy Guardiola has not won with the club in his previous two seasons.\nWith that title also in their sights, Bayern will get up, dust off and keep working, defender Jerome Boateng promised.\n\"Overall it was just too little from us. We will work to get better now,\" Boateng said.\n ", "external_links": ["https://twitter.com/AO_Sports", "https://www.facebook.com/AhramOnlineSports?fref=ts"], "published": "2015-10-21T03:00:00.000+03:00", "crawled": "2015-10-21T18:58:01.499+03:00", "highlightTitle": ""}