{"organizations": ["Area SE Indiana"], "uuid": "cea07c73d730c685b4732e192a840c1787a67d22", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.local12.com", "main_image": "http://www.local12.com//template/ugc/wkrc/1601/poKjNFVO.jpg", "site_section": "http://www.local12.com/sports/features/local-sports/rss.xml", "section_title": "wkrc LOCAL Sports", "url": "http://www.local12.com/sports/features/local-sports/stories/-Area-SE-Indiana-high-school-football-schedule-for-Oct-2-216671.shtml", "country": "US", "title": "Area SE Indiana high school football schedule for Oct. 9", "performance_score": 0, "site": "local12.com", "participants_count": 0, "title_full": "Area SE Indiana high school football schedule for Oct. 9", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T11:15:00.000+03:00", "replies_count": 0, "uuid": "cea07c73d730c685b4732e192a840c1787a67d22"}, "author": "", "url": "http://www.local12.com/sports/features/local-sports/stories/-Area-SE-Indiana-high-school-football-schedule-for-Oct-2-216671.shtml", "ord_in_thread": 0, "title": "Area SE Indiana high school football schedule for Oct. 9", "locations": ["Indiana"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Area SE Indiana high school football schedule for Oct. 9 \nUpdated: Fri, Oct 09 2015, 09:39 AM \nCINCINNATI (WKRC) -- Here is a look at the high school football schedule involving area Indiana teams for Oct. 9 (note all times 7 p.m. unless noted and games are in alphabetical order by home team) and for updated scores throughout the weekend go here on a desktop and scroll down to the ScoreStream scoreboard: \nFRIDAY'S GAMES \nRushville at South Dearborn \nFollow us on Twitter @Local12 and LIKE us on Facebook for updates! \nTo get \"The Skinny\" on local sports be sure to follow Local12 Digital Sports Columnist/Editor Richard Skinner on Twitter @Local12Skinny and LIKE him on Facebook for updates or email him raskinner@sbgtv.com. Related Stories Entertainment News \nBILL COSBY - DEPOSITION SET FOR TODAY \nLOS ANGELES (AP) -- For the second time in a decade, Bill Cosby will have to answer questions under oath in a sexual assault case. Business News \nMajor business and economic reports today \nWASHINGTON (AP) -- There's only one major government economic report scheduled for release today. The Commerce Department will report on wholesale trade inventories for August. Science/Tech News \nIN THE NEWS: YOU \"LIKE\" THIS -- FACEBOOK CHANGES ON THE WAY \nNEW YORK (AP) -- It's happened to all of us on Facebook: someone says a loved one is ill or that they're going through some other kind of tough time. Stay Connected: \n© 2015 Sinclair Broadcast Group. All Rights Reserved. Local 12 WKRC-TV is the local station for breaking news, The Weather Authority forecast, traffic alerts, community news, Cincinnati Bengals and Reds sports updates, and CBS network news and entertainment programming for the Cincinnati and the Tri-State area of Southwest Ohio, Northern Kentucky and Southeast Indiana, including Anderson Township, Avondale, Blue Ash, Bond Hill, Camp Washington, Cheviot, Cleves, Colerain Township, Columbia-Tusculum, Corryville, Norwood, Delhi, East Price Hill, Golf Manor, Hyde Park, Lebanon, Loveland, Lower Price Hill, Madeira, Mariemont, Mount Adams, Mount Airy, Mount Healthy, Mount Lookout, Mount Washington, Oakley, Over-The-Rhine, Reading, Sedamsville, Sharonville, Springdale, St. Bernard, South Cumminsville, Symmes Township, Mason, Hamilton, Union Township, Walnut Hills, West Chester, Wyoming, West Price Hill, Westwood, Winton Hills, Alexandria, Bellevue, Covington, Crescent Springs, Erlanger, Fort Mitchell, Fort Thomas, Fort Wright, Florence, Hebron, Highland Heights, Newport, Southgate, Villa Hills, Walton, Aurora, Greendale, and Lawrenceburg.", "external_links": [], "published": "2015-10-09T11:15:00.000+03:00", "crawled": "2015-10-09T17:14:20.558+03:00", "highlightTitle": ""}