{"organizations": [], "uuid": "4d389b4a470f623c73b0f35d4eec081127f6b944", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.expressandstar.com", "main_image": "", "site_section": "http://www.expressandstar.com/sport/feed", "section_title": "Midlands Sport News - West Midlands Sport - Sports News Scores « Express & Star", "url": "http://www.expressandstar.com/sport/other-sport/boxing/2015/10/14/you-have-to-hand-it-to-champion-conna-hincks/", "country": "GB", "title": "You have to hand it to champion Conna Hincks", "performance_score": 0, "site": "expressandstar.com", "participants_count": 0, "title_full": "You have to hand it to champion Conna Hincks", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T08:00:00.000+03:00", "replies_count": 0, "uuid": "4d389b4a470f623c73b0f35d4eec081127f6b944"}, "author": "", "url": "http://www.expressandstar.com/sport/other-sport/boxing/2015/10/14/you-have-to-hand-it-to-champion-conna-hincks/", "ord_in_thread": 0, "title": "You have to hand it to champion Conna Hincks", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Conna Hincks Tweet"], "text": "Tweet \nHincks was crowned champion on finals day at Rotherham’s Magna Centre last weekend after four bouts in the competition, writes Craig Birch. \nAnd ‘the Bradley Bullet,’ from Bilston, really had to stick to his boxing this time to get the job done at 66kg in Class A, for fighters born 2000. \nThe 15-year-old, representing Merridale in Wolverhampton, changed tactics after injuring his hand trying to smash through Rotherham’s Josh Brunt in the semi-final. \nThe Moseley Park School pupil operated on the back-foot and tagged frustrated final adversary Callan Phillips, from St Austell in Cornwall, as he tried to wade in. \nHe showed skill to match the power that had led him to two first round stoppages and a knockdown in the competition, his hand raised with a second straight unanimous points victory. Good as gold - Conna Hincks is a new England Junior Development national champion. \nHincks jumped for joy after getting the decision with coach Zabir Ajaz proud as punch of the club’s second national champion, after Schools girls boss Simran Kaur. \nAjaz said: “It was a tough one for Conna, as he’d hurt his hand trying to block a punch in the semi-final. He could still hit, but not as hard as usual. \n“That’s the sort of thing that can lose you a final, so we changed the game-plan and it still paid off. He boxed brilliantly, his movement and timing was excellent. \n“The other lad was getting wound up that Conna was boxing on the back-foot and took shots to the body most times he came forward. That proved to be enough.” \nNow Hincks will be back in national club competition when the National Association of Girls & Boys Clubs event resumes at the end of this month, after a two-year absence. \nAjaz said: “Conna needs time for his hand to heal, but he’s still training hard and he’s the sort of kid that just wants to fight. More on this story:", "external_links": [], "published": "2015-10-14T08:00:00.000+03:00", "crawled": "2015-10-14T16:24:36.606+03:00", "highlightTitle": ""}