{"organizations": [], "uuid": "544dbd97d7fb1f81b2b250c8227614d25437e10a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wcax.com", "main_image": "http://wncontent.images.worldnow.com/images/6360512_G.jpg", "site_section": "http://www.wcax.com/category/38882/latest-health-news", "section_title": "Latest Health News - WCAX.COM Local Vermont News, Weather and Sports-", "url": "http://www.wcax.com/story/30196573/face-to-face-contact-may-beat-email-phone-for-staving-off-depression", "country": "US", "title": "Face-to-face contact may beat email, phone for staving off depre", "performance_score": 0, "site": "wcax.com", "participants_count": 1, "title_full": "Face-to-face contact may beat email, phone for staving off depre - WCAX.COM Local Vermont News, Weather and Sports-", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "544dbd97d7fb1f81b2b250c8227614d25437e10a"}, "author": "wcax.com", "url": "http://www.wcax.com/story/30196573/face-to-face-contact-may-beat-email-phone-for-staving-off-depression", "ord_in_thread": 0, "title": "Face-to-face contact may beat email, phone for staving off depre", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Randy Dotinga\nHealthDay Reporter\n(HealthDay News) -- While your days may be filled with electronic communications, a new study suggests that face-to-face contact might have more power to keep depression at bay -- at least if you're older.\nThe research doesn't prove that personal conversations are more valuable than email and phone calls. Still, study author Dr. Alan Teo, a staff psychiatrist at VA Portland Health Care System in Oregon, is convinced there's a connection.\n\"Meeting friends and family face-to-face is strong preventive medicine for depression,\" said Teo, who's also an assistant professor of psychiatry at Oregon Health & Science University. \"Think of it like taking your vitamins, and make sure you get a regular dose of it,\" he said.\nIt may seem obvious that interacting with other people -- in a positive way -- is good for your health. Indeed, \"from prior studies we know that having social support and staying connected with people is good for your physical and mental health. It even helps you live longer,\" Teo said.\n\"What we didn't know is whether it matters how you stay connected with friends and family,\" he added.\nThe investigators examined the results of a 2004-2010 survey including about 11,000 people aged 50 and older. After adjusting the statistics so they wouldn't be thrown off by factors such as high or low numbers of certain kinds of people, the researchers found an association between the types of interactions people had with others and their likelihood of depression symptoms two years later.\nRates of depression didn't seem to be affected by the level of communication by phone, letters and email. But those who communicated the least with friends and family via in-person meetings -- every few months or less often -- had a higher rate of signs of depression.\nTwo years later, 12 percent of those people showed signs of depression, the study found. By comparison, 8 percent of those who had in-person contact once or twice a month and 7 percent of those who met others once or twice a week showed signs of depression.\nBut the study only showed an association between more personal time spent with family and friends and lower chances of depression, and not a cause-and-effect relationship.\nThe study was published in the Oct. 5 issue of the Journal of the American Geriatrics Society .\nIt's possible that some factor other than in-person contact is causing the differences in depression levels. Caitlin Coyle, a postdoctoral fellow at the Yale School of Public Health in New Haven, Conn., said it's also possible that depression could be the driver: \"Adults experiencing depressive symptoms may be less likely to engage socially,\" she suggested.\nHow is the research useful?\n\"Everyone can relate to the question of whether to call a friend on your smartphone, text them or arrange to meet up,\" Teo said. \"This study is perhaps the first to be able to offer some really concrete evidence that you are probably better off if you make sure to regularly spend quality time together with people.\"\nThe study, which didn't track people past 2010, doesn't account for the rapid rise of Facebook over the past few years and its ability to draw people together. But Teo wants to understand more about it.\n\"In one of my next studies,\" he said, \"I am now trying to measure all different types of social media use to see how that plays out with mental health outcomes, particularly in younger adults.\"\nCoyle cautioned that the rapid evolution of technology will make it tough to study how older people communicate.\nIn the big picture, \"things like Skype, email or Facebook are all wonderful resources to help older adults stay engaged,\" she said.\n\"But by engaging in these types of social contact, older adults could be forgoing opportunities to engage socially in their communities. For example, you can't go to the theater with someone via Skype. Although a variety in the type of social contact is great, there really is no replacement for engaging with others face-to-face,\" Coyle added.\nDr. Carla Perissinotto, an assistant clinical professor in the division of geriatrics at the University of California, San Francisco, put it this way: \"This is a reminder that it is important for all of us to stay connected. The human touch and human contact cannot be replaced.\"\nMore information\nFor more about depression in seniors, visit the National Alliance on Mental Illness ", "external_links": ["http://www.nami.org/Content/NavigationMenu/Mental_Illnesses/Depression/Depression_in_Seniors.htm", "http://images.worldnow.com/Revenue/images/275529_G.jpg", "http://www.healthday.com/"], "published": "2015-10-06T03:00:00.000+03:00", "crawled": "2015-10-26T01:44:42.986+02:00", "highlightTitle": ""}