{"organizations": ["Rangers"], "uuid": "13a366d7402fba812dccb29491dbd800ee5b0e67", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pendletontimespost.com", "main_image": "", "site_section": "http://pendletontimespost.com//feed/sec/6000/", "section_title": "PendletonTimesPost.com - Sports News", "url": "http://www.pendletontimespost.com/view/story/67053b4572454d7296960bdb434f1405/BBA--Angels/", "country": "US", "title": "Angels fall to Rangers 5-3, turn focus to wild-card race", "performance_score": 0, "site": "pendletontimespost.com", "participants_count": 0, "title_full": "Angels fall to Rangers 5-3, turn focus to wild-card race", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T08:08:00.000+03:00", "replies_count": 0, "uuid": "13a366d7402fba812dccb29491dbd800ee5b0e67"}, "author": "", "url": "http://www.pendletontimespost.com/view/story/67053b4572454d7296960bdb434f1405/BBA--Angels/", "ord_in_thread": 0, "title": "Angels fall to Rangers 5-3, turn focus to wild-card race", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["SCHUYLER DIXON"], "text": "Angels can't defend AL West title after 5-3 loss to Rangers, turn focus to wild-card race By SCHUYLER DIXON AP Sports Writer   02, 2015 - 1:08 amLast Updated: October 02, 2015 - 1:08 am   \nPeople: \nTexas (1310) \n\nARLINGTON, Texas — The Los Angeles Angels can quit worrying about defending their AL West championship. It won't happen. \nThe focus now is on the race for the second AL wild card. \nAdrian Beltre had a tiebreaking three-run double to back Derek Holland, and the Texas Rangers wrapped up a wild-card spot while reaching the cusp of the division title with a 5-3 win over the Angels on Thursday night. \n\"We're still scratching and clawing, and trying to get into the playoffs,\" manager Mike Scioscia said. \"Your goal is still there. It might be a little harder route right now, and as of this moment we're going to need a little help.\" \nIn the race for the second wild card, Los Angeles (83-76) is a game behind the Astros and tied with Minnesota, which beat Cleveland 4-2. \nBeltre, who had the second-most RBIs in the majors in September with 29, broke a 1-all tie with a bases-clearing double off Andrew Heaney (6-4) in the fifth. \n\"We obviously knew coming in we needed to win every game,\" said Heaney, who walked a career-high five and has just one win since July 26. \"Obviously, that's frustrating for me to feel like I didn't give the team a chance to win.\" \nThe music was a little louder in the Texas clubhouse, with the faint smell of champagne. Otherwise, the Rangers were still waiting on a bigger celebration — for winning the division. \n\"We had a toast, yes,\" first-year manager Jeff Banister said. \"We still have a mission to accomplish. And something that as a group of players we all talked about in spring training, when nobody else was talking about it but us.\" \nThe Rangers (87-72), in the playoffs for the first time since 2012 after an AL-worst 95 losses last season, are a win or a Houston loss away from their first division title since winning two straight and going to the World Series in 2010-11. \nTexas, which fell to Tampa Bay in a playoff for a wild-card spot in 2013, lost ace Yu Darvish to season-ending elbow surgery in spring training and went 7-14 in April. \nThe Rangers were still eight games out on Aug. 2 but are now on the verge of becoming the fifth team in 40 years — and the first since the Twins in 2006 — to win a division after trailing by that many games in August. \n\"They're a different team,\" Scioscia said. \"They've evolved and they're playing really good baseball.\" \nHolland (4-3), who missed most of the season with a left shoulder strain, allowed three hits and three runs in 6 1-3 innings for his first win since Sept. 5. The left-hander struck out six, including Kole Calhoun three times. \nCalhoun also grounded out to Andrus against reliever Jake Diekman with the tying run at third to end the seventh. \nSam Dyson pitched a perfect eighth with help from two strong defensive plays by Andrus, and closer Shawn Tolleson had a 1-2-3 ninth for his 35th save in 37 chances. \nAlbert Pujols hit his 39th home run off Holland in the sixth. \nHOW ABOUT HAMILTON \nJosh Hamilton, playing against the team that essentially gave him back to the Rangers earlier this season, made a running over-the-shoulder catch in left field as he went to his knees and crashed into the wall. The Texas slugger had arthroscopic surgery to clean up the meniscus in his left knee Sept. 11. It was his third game in the outfield since surgery. \nThe second-inning play turned what looked like an extra-base hit into a sacrifice fly for Shane Victorino. Hamilton scrambled to his feet to get the ball back in as Pujols raced back to the bag to tag up. He barely beat the relay throw. \n\"That was a big catch, a big play in the game,\" Mike Trout said. \nTRAINER'S ROOM \nAngels: Scioscia said closer Huston Street (groin) was still unavailable. \nRangers: Chirinos (left shoulder strain) made his second straight start at catcher for the first time since late July. \nUP NEXT \nAngels: RHP Jered Weaver (7-12, 4.76 ERA) makes his second start of the season against the Rangers. He allowed one run on four hits in six innings in a no-decision when Texas won 2-1 on Sept. 5. \nRangers: LHP Martin Perez (3-6, 4.77) has three straight wins over four starts at home, with a 2.28 ERA in those starts. He gave up two unearned runs in six innings of a 4-2 loss at Houston in his last start. \n ", "external_links": [], "published": "2015-10-02T08:08:00.000+03:00", "crawled": "2015-10-02T09:45:38.992+03:00", "highlightTitle": ""}