{"organizations": [], "uuid": "85ca3369d901d93946f574cf1ba53b05d653b15f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "cobbnewsnetwork.com", "main_image": "http://matchbin-assets.s3.amazonaws.com/public/sites/624/thumbs/AZ1Q_Georgia_Tech_Veteran__Poir.jpg", "site_section": "http://mdjonline.com/rss/rss/Sports?instance=Sports&content_type=article&tags=sports&tag_inclusion=or&offset=0&limit=10&page_name=rss", "section_title": "Sports", "url": "http://cobbnewsnetwork.com/bookmark/26917371", "country": "US", "title": "Transfers should provide new look to Georgia Tech's lineup", "performance_score": 0, "site": "cobbnewsnetwork.com", "participants_count": 1, "title_full": "Transfers should provide new look to Georgia Tech's lineup", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T22:15:00.000+03:00", "replies_count": 0, "uuid": "85ca3369d901d93946f574cf1ba53b05d653b15f"}, "author": "The Marietta Daily Journal (noreply@cobbnewsnetwork.com)", "url": "http://cobbnewsnetwork.com/bookmark/26917371", "ord_in_thread": 0, "title": "Transfers should provide new look to Georgia Tech's lineup", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "October 20, 2015 02:15 PM | 297 views | 0 | 3 | | In this March 10, 2015, file photo, Georgia Tech head coach Brian Gregory reacts to a call during the second half of an NCAA college basketball game against Boston College in the first round of the Atlantic Coast Conference tournament in Greensboro, N.C. Gregory, under a mandate to show progress in his fifth season as Georgia Tech’s coach, is relying on veteran transfers to make the Yellow Jackets relevant again in the ACC. Gregory has only one winning record and no postseason appearances in his first four seasons.. (AP Photo/Bob Leverone, File) slideshow \nATLANTA (AP) — Brian Gregory, under a mandate to show progress in his fifth season as Georgia Tech's coach, is relying on veteran transfers to make the Yellow Jackets relevant again in the ACC. \nGregory has only one winning record and no postseason appearances in his first four seasons. Last year's team finished 12-17 overall and an ugly 3-14 in the Atlantic Coast Conference, one spot from last place. \nAfter the season, athletic director Mike Bobinski said he still believes Gregory is capable of turning the program around. Bobinski said he wanted to see \"clear signs of progress\" this season. \nEven with six of the top eight scorers returning from last year's team, there will be a new look to the lineup. Gregory added Virginia Tech transfer Adam Smith, a 3-point specialist who averaged 13.4 points last season, to boost the Yellow Jackets' poor perimeter game. He also added Alabama transfer Nick Jacobs (6-8, 260) to provide more punch near the basket. \nSmith and forward James White, from Arkansas-Little Rock, are graduate transfers. \nGregory said Jacobs is a \"bona fide low-post scorer.\" Gregory said Smith will take pressure off Marcus Georges-Hunt as another outside shooter who can be looked to in late-game situations. \n\"That's what we're banking on,\" Gregory said earlier this month. \nGeorges-Hunt (13.6) and Smith rank seventh and eighth, respectively, among the ACC's leading returning scorers. Jacobs and Charles Mitchell (6-8, 269) will fill a lot of space on the front line. \nCorey Heyward and Travis Jorgenson are the top options to join Smith in the backcourt. Jorgenson started 27 games last season. \nGeorgia Tech struggled to win close games last season. There were blowout losses to North Carolina and Virginia, but 13 of 16 conference losses were by an average of 3.6 points. \nNow Gregory hopes he'll have more depth and scoring power for better finishes in the close games. \n\"I think having other options is going to make us a much better team down the stretch,\" he said. \"At the same time, what you hope is you're putting yourself in a position where maybe you don't have to make a shot at the end of the game to win the game.\" \nToo often, Georges-Hunt seemed to be Georgia Tech's only scoring option in clutch situations before he suffered a broken foot in the final regular-season game. \nGeorges-Hunt said his foot \"feels great.\" He said he was able to appreciate the impact the additions to the team can make as he watched workouts this summer while still going through rehabilitation. \n\"We do have a lot of pieces we probably never had in the past,\" Georges-Hunt said. \"It's a lot of different pieces. They all bring something different to the team. We are a very athletic team. ... We have a lot of special pieces.\" \nGeorgia Tech's last NCAA tournament appearance came in 2010 under coach Paul Hewitt. The Yellow Jackets have posted eight straight losing records in the conference schedule, with no finish better than 6-12 under Gregory. \nMitchell ran through the list of experienced players on the roster before concluding this team \"is not going to give people games.\" \n\"If we stay locked in ...we'll do something special this season,\" Mitchell said. Copyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Share This Article | similar stories", "external_links": [], "published": "2015-10-20T22:15:00.000+03:00", "crawled": "2015-10-21T05:38:04.789+03:00", "highlightTitle": ""}