{"organizations": [], "uuid": "7e75df35b68cbf6c08b651ae3eeeecedfa81d98b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/Category/6/55/Sports/World.aspx", "section_title": "World - Sports - Ahram Online ", "url": "http://english.ahram.org.eg/NewsContent/6/55/152603/Sports/World/Italy-boss-Conte-coy-but-club-football-beckons.aspx", "country": "EG", "title": "Italy boss Conte coy but club football beckons", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "Italy boss Conte coy but club football beckons - World - Sports - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "7e75df35b68cbf6c08b651ae3eeeecedfa81d98b"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/6/55/152603/Sports/World/Italy-boss-Conte-coy-but-club-football-beckons.aspx", "ord_in_thread": 0, "title": "Italy boss Conte coy but club football beckons", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related Italy forward Balotelli snubbed again despite Berardi injury Italy coach Antonio Conte has given a further indication he could return to club management after again brushing off questions concerning his future commitment to the Azzurri.\nA win away to Group H rivals Azerbaijan later on Saturday will see Italy book their place in the Euro 2016 finals and Italian football federation (FIGC) bosses are already keen for Conte to sign a contract extension until 2018.\nBut Conte looks increasingly unlikely to be at the Azzurri helm beyond next summer's showpiece in France amid reports he has his eye on taking over at Roma, AC Milan or Paris Saint Germain.\n\"Right now is not the time to talk about my contract,\" Conte told reporters on Friday.\n\"The absolute priority is to qualify. The second priority after that is to play well at the European championships.\n\"I want to thank the (FIGC) president and his staff, who have always given me their support and they appreciate the passion and commitment that's required.\n\"There will be a time to talk about everything else later.\"\nFIGC president Carlo Tavecchio has said he is keen for Conte \"to stay after the European championships, but we live in a democracy and everyone is free to decide what he wants to do. If he wants to stay, he will be welcome.\"\nIn terms of results, Conte's tenure has been fruitful. Italy remain unbeaten in 48 World Cup or Euro qualification matches – a statistic they will be hoping to stretch to 50 against Azerbaijan and then Norway on Tuesday.\nBut Conte's position has always looked a fragile one and reports around Italy on Saturday supported pundits claims that the 46-year-old is desperate to return to the cut an thrust of club football.\nAccording to Rome-based daily Il Messaggero, Conte could take over at Roma if their current coach Rudi Garcia, whose deal expires in 2018, does not win the league title this season.\nHe has also been linked with AC Milan, and PSG, according to the report, have followed Conte closely.\nConte took over the Italy helm after Cesare Prandelli resigned in the wake of Italy's failure to get past the first round at the 2014 World Cup in Brazil.\nHaving steered Juventus to three 'scudetto' titles in a record-setting three years with the Turin giants, the move into coaching the national team provided a stark contrast for Conte.\nHe complained about his limited access to players, the lack of regular squad meetings and, after just one year into his contract, said: \"I feel alone.\"\nAn initially tense relationship with the FIGC has since improved, but Conte seems destined to return to club management.\nIn the meantime, Conte called for Italy to seal qualification ahead of their final qualifier at home to Norway on Tuesday by beating Azerbaijan.\n\"We have to be intelligent and take the right approach to this game, because leaving it until the last game to qualify is dangerous,\" he said.\n ", "external_links": ["https://twitter.com/AO_Sports", "https://www.facebook.com/AhramOnlineSports?fref=ts"], "published": "2015-10-10T03:00:00.000+03:00", "crawled": "2015-10-10T21:38:09.389+03:00", "highlightTitle": ""}