{"organizations": [], "uuid": "fca7c4a4e4bb36220322301af1394ee9f66f3a1d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sport.co.uk", "main_image": "http://images.sport.co.uk/150x150/2b7143a3e557cd7e6d4a5ffe021d5427.jpg", "site_section": "http://feeds.feedburner.com/SportcoukNewsRssFeed", "section_title": "General Sports News from Sports.co.uk", "url": "http://www.sport.co.uk/rugby/ben-cohens-thoughts-on-where-england-have-gone-wrong-in-the/6905226/", "country": "JE", "title": "Ben Cohen's thoughts on where England have gone wrong in the World Cup", "performance_score": 0, "site": "sport.co.uk", "participants_count": 0, "title_full": "Ben Cohen's thoughts on where England have gone wrong in the World Cup", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T14:46:00.000+03:00", "replies_count": 0, "uuid": "fca7c4a4e4bb36220322301af1394ee9f66f3a1d"}, "author": "", "url": "http://www.sport.co.uk/rugby/ben-cohens-thoughts-on-where-england-have-gone-wrong-in-the/6905226/", "ord_in_thread": 0, "title": "Ben Cohen's thoughts on where England have gone wrong in the World Cup", "locations": ["England"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ben Cohen"], "text": "Ben Cohen's thoughts on where England have gone wrong in the World Cup 08 Oct 2015 11:46:53 \ncomments \nEngland play the final match of their own World Cup against Uruguay on Saturday after successive defeats to Wales and Australia sealed their demise. Here 2003 World Cup winner Ben Cohen, an ESPN Rugby World Cup columnist, presents his post mortem on the darkest hour in Red Rose history. \nSELECTION MISTAKES AGAINST WALES \nOwen Farrell had an amazing game against Wales and England seemed to feel it when Sam Burgess came off - but my frustration is the way the replacements are made. Stuart Lancaster seems to base his decisions on science, but you cannot account for adrenaline. When you are in a game you know how to dig deep. We are animals, we know how to survive. It was not broken against Wales, so why try to fix it by taking Burgess off? Saying that, I would have preferred George Ford to have started at fly-half because he is more of an attacking player. Our back three were on fire, so you need a fly-half who will pass them the ball and a centre who can create. \nTOO MUCH FAITH SHOWN IN BURGESS \nBurgess is a great player, but at a different code of rugby. He needs time in union and must earn the right to play for England. Luther Burrell had earned his stripes to get into the squad. It was too soon for Burgess to play in the World Cup. On the performance side, Burgess' inclusion has had an impact because Burrell should have been there, but on the morale side I'm not so sure if it would have made a difference. Burrell has been phenomenal for England and it's so frustrating that we did not take someone of his size. And why pick Henry Slade in the squad and not play him? \nLEADERSHIP VOID \nThere were not enough leaders to support captain Chris Robshaw. Watching the games against Wales and Australia, Robshaw looked a little bit isolated. The 2003 team I was in was spoilt by the number of leaders we had. When Martin Johnson was not talking, there was Lawrence Dallaglio, Richard Hill, Will Greenwood and Phil Vickery. There were so many players who could pipe up and offer simple but necessary instructions. \nTAKE THE POINTS \nFor the 77th minute penalty against Wales that we kicked for touch instead of going for the posts to draw the game, I cannot believe that England did not go through that scenario in the team room. A kick for goal takes two minutes, so you have a minimum of one minute to get back down there and snatch another penalty. I do not understand our mindset that night. And then when we go for the line-out, we throw to the front - which is the easiest ball to defend against. \nVERDICT \nEngland should have been good enough to progress from their pool and the knock-on effect for the whole country has been huge, it is a feeling of mourning. No one is going to go to the pubs and clubs to watch the games any more, the feelgood factor has gone. I like Lancaster but never understood why he was given the job in the first place. The man in charge should have been there and done it, although Lancaster did come in and steady the ship - which was needed. We will see what happens to the coaches in the review. \n::ESPN.co.uk is bringing fans extensive coverage of the Rugby World Cup, including in-depth group previews, match reports from every game, detailed stats and the UK's biggest fantasy rugby game. Related Sport News", "external_links": [], "published": "2015-10-08T14:46:00.000+03:00", "crawled": "2015-10-08T19:53:23.844+03:00", "highlightTitle": ""}