{"organizations": [], "uuid": "cd0f2300bcd20dd4fcde553d43a62361962839c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.journalstandard.com", "main_image": "http://www.journalstandard.com/Global/images/head/nameplate/il-freeport_logo.png", "site_section": "http://www.journalstandard.com/sports?template=rss&mime=xml", "section_title": "Sports - Journal Standard", "url": "http://www.journalstandard.com/article/20151021/SPORTS/151029863/2000/NEWS?rssfeed=true", "country": "US", "title": "Pretzels set to run with shot at extending season", "performance_score": 0, "site": "journalstandard.com", "participants_count": 1, "title_full": "Pretzels set to run with shot at extending season", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T23:13:00.000+03:00", "replies_count": 0, "uuid": "cd0f2300bcd20dd4fcde553d43a62361962839c9"}, "author": "Jay Taft", "url": "http://www.journalstandard.com/article/20151021/SPORTS/151029863/2000/NEWS?rssfeed=true", "ord_in_thread": 0, "title": "Pretzels set to run with shot at extending season", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Pretzels set to run with shot at extending season Comment Posted Oct. 21, 2015 at 3:02 PM Updated Oct 21, 2015 at 3:13 PM Posted Oct. 21, 2015 at 3:02 PM Updated Oct 21, 2015 at 3:13 PM BELVIDERE — The Freeport Pretzels cross country teams could see their seasons come to a close on Saturday at the end of the Class 2A Belvidere North Regional. Their head coach Alan Greene doesn’t expect that to happen, however. “These groups have worked too hard for that to happen, at least without a fight,” Greene said. “It’s going to be a pretty tough regional for all of them, and they won’t be holding back.” The Freeport girls took fourth at the NIC-10 meet last week and are looking to climb, especially with teams like Hononegah, Jefferson and Auburn moving up to 3A for the rest of the year. Belvidere North, coming off its fourth straight NIC-10 championship, will be there, however. The top six teams and the the next five runners not on an advancing team will reach sectionals. Boylan's Delaney Appino won the 3-mile race last weekend, while her teammate Grace McLaughlin came in third. The Titans placed third just ahead of Freeport. North’s Jenna Lutzow took second individually, just under seven seconds off the winning pace. A pack of five Freeport girls came across the line in 19th-23rd place, and Greene expects the pack to stick together again this weekend at Belvidere’s Spencer Park. However, he hopes that pack will be higher up the standings. “Like we thought, they stuck together, and did a nice job of it,” Greene said. “But we were hoping that pack was 15-20 seconds faster. Maybe this week. They shouldn’t need their best until sectionals.” Last year the Pretzels made it to sectionals on the girls side. This year, led by freshman Gabby Rodriguez and Sophia Wilks, sophomores Cassidy Grunewald, Allie Kundert and Kyla Wilcox and senior Brianna Kloster, they expect to be back. The area 1A runners will take part in the Winnebago Regional. All the races will begin with a 10 a.m. girls’ race and end with an 11 a.m. boys showdown. Freeport boys The Pretzel boys struggled at last week’s conference meet, finishing last by a wide margin, with Sam Wilks crossing the finish line in 32nd place to top Freeport. Wilks was under the weather, and Greene hoes that better performances across the board will be enough to boost Freeport into the top six in the standings, and on to sectionals. Belvidere North, the favorite at this weekend’s regional, accounted for four of the top six finishers in last week’s NIC-10 meet. Wilks was Freeport’s best, and 20 spots later it was Nathan Skarlupka, but he was diagnosed with a broken leg shortly after the race, ending his season. Page 2 of 2 - The Pretzels will now rely more on Jeff Cutler, Matt Pehl, Josh Warner and others at regionals. “We’re young all over the place, but we’re moving some guys up, and we’ll see what they’ve got,” said Greene of his regionals roster that will have one senior, one junior, two sophomores and three freshmen. “We’ve got a chance for the whole team to get through, but when they’re this young, you just never know.” North Boone’s Skylar Yunk is one of the favorites in the 1A Winnebago Regional as 15 teams battle for the top spots there as well.", "external_links": [], "published": "2015-10-21T23:13:00.000+03:00", "crawled": "2015-10-22T12:38:08.141+03:00", "highlightTitle": ""}