{"organizations": [], "uuid": "7950c162520983433def3e648c9e0d17916fdc46", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sun-sentinel.com", "main_image": "http://www.trbimg.com/img-562ae8bc/turbine/fl-pblakes-forest-hill-recap-1024-20151023", "site_section": "http://www.sun-sentinel.com/sports/highschool/palm-beach", "section_title": "Palm Beach County High School Sports - Sun Sentinel", "url": "http://www.sun-sentinel.com/sports/highschool/football/palm-beach/fl-pblakes-forest-hill-recap-1024-20151023-story.html", "country": "US", "title": "P.B. Lakes ends futility — and Forest Hill playoff hopes", "performance_score": 0, "site": "sun-sentinel.com", "participants_count": 1, "title_full": "P.B. Lakes ends futility — and Forest Hill playoff hopes - Sun Sentinel", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T03:09:00.000+03:00", "replies_count": 0, "uuid": "7950c162520983433def3e648c9e0d17916fdc46"}, "author": "Pat Lammer", "url": "http://www.sun-sentinel.com/sports/highschool/football/palm-beach/fl-pblakes-forest-hill-recap-1024-20151023-story.html", "ord_in_thread": 0, "title": "P.B. Lakes ends futility — and Forest Hill playoff hopes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Palm Beach Lakes came into its District 13-7A game at Forest Hill on Friday with an 0-7 overall record and 0-3 mark in district play.\nBut Forest Hill coach Jude Blessington knew his Falcons were going to have their hands full with the Rams.\n\"So far on film, they're the most skilled team we've played this year,\" Blessington warned prior to the Homecoming matchup.\nAnd was Blessington ever correct.\nLakes pulled out all of the stops -- using a fake punt and an onside kick to set up two third-quarter touchdowns -- en route to a 28-22 victory over Forest Hill.\n\"It feels great,\" first-year Lakes coach Vinny Sutherland said. \"Happy for the staff, happy for the kids.\n\"All year we've told them to keep their head in it, just stay alive and good things will happen,\" the former Purdue standout added.\nThe loss was a huge blow to Forest Hill's playoff hopes. The Falcons were fighting to stay in the hunt for second in the district behind Dwyer, but dropped to 5-3 overall and 2-2 in the district. Last year Blessington led the Falcons to their first winning season (6-4) since 1986.\nUp just 9-8 at halftime, Lakes owned the third quarter to take command. The Rams used a 12-yard run on a fake punt by Noah Curtis to keep a drive alive and Jalen Wright's 5-yard TD run made it 15-8 with 2:56 left in the period. Curtis has been offered by Florida Atlantic.\nLakes would then use a successful onside kick on the ensuing kickoff to go up 22-8. Darryl Oliver caught a 5-yard TD pass from quarterback Armani Edden. Wright would give the Rams a 29-8 lead with 10:22 to play on a 3-yard TD run.\nForest Hill closed to within 28-22 with two late touchdowns but could not totally get over the hump. A Marcus Frazier fumble with 17 seconds left sealed the Falcons' fate.\nFrazier, who has offers from Bowling Green and Idaho, led the Falcons offensively. He rushed for 127 yards on 26 carries.\nEdden was 20-for-27 passing for 224 yards for the Rams.\nForest Hill came out strong and drove 70 yards for a touchdown on the opening possession of the game.\nFrazier connected with senior Vince Hulme from 11 yards out for the touchdown. Jon Jones ran in the two-point conversion for a quick 8-0 lead. Frazier had the key play on the drive, running for 29 yards.\nBut Lakes held Forest Hill off the scoreboard the rest of the half, limiting Frazier to 45 yards the first two quarters on 11 carries.\nLakes struggled to run the ball but found success through the air. Edden was 9-for-14 passing for 100 yards. Edden spread the ball around on the Falcons, finding six different receivers.\nThe Rams cut Forest Hill's lead to 8-3 on a 23-yard field goal by Kevin Mitchell with 5:51 left second quarter. Lakes had taken over at the Falcons' 22 after a 17-yard punt.\nLakes went up 9-8 when Austin Hamlet slammed over from the 1-yard line with 1:02 remaining in the first half. The PAT was no good.\n ", "external_links": ["http://www.trbimg.com/img-562ae8bc/turbine/fl-pblakes-forest-hill-recap-1024-20151023"], "published": "2015-10-24T03:09:00.000+03:00", "crawled": "2015-10-24T06:32:45.809+03:00", "highlightTitle": ""}