{"organizations": [], "uuid": "d1a9b79b8f860857cb84ff3eaccbbceead0a612a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.operationsports.com", "main_image": "", "site_section": "http://www.operationsports.com/rss.xml", "section_title": "Operation Sports", "url": "http://www.operationsports.com/newspost.php?id=860970", "country": "US", "title": "WWE 2K16 Universe Mode Returns With New Advancements", "performance_score": 0, "site": "operationsports.com", "participants_count": 1, "title_full": "WWE 2K16 Universe Mode Returns With New Advancements", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T00:36:00.000+03:00", "replies_count": 0, "uuid": "d1a9b79b8f860857cb84ff3eaccbbceead0a612a"}, "author": "Cowboy008", "url": "http://www.operationsports.com/newspost.php?id=860970", "ord_in_thread": 0, "title": "WWE 2K16 Universe Mode Returns With New Advancements", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WWE 2K16 Universe Mode Returns With New Advancements 04:36 PM - October 22, 2015 by Cowboy008 2K and WWE 2K16 have released details and updates to Universe Mode , where fans get to craft and play out their own version of WWE. In the past, starting match cards were similar across all game copies. Now players shouldnt see the same card when comparing Universes with their friends. From there, players can now assign Superstars to appear on multiple shows, creating more flexibility and customization. Weve added more Universe cutscenes and revamped a large portion of the storylines to focus more on quality over quantity. Between pay-per-views one would traditionally see around two possible story instances for a characters path. Now those branching-instance possibilities jump up to ten, creating far more variety in storylines. Everything will make more sense logically with the Superstars involved based on their personality traits. Status effects are another new element shaking up the flow of Universe Mode. Status effects are temporary bonuses and penalties that are triggered through gameplay or storylines. The most common effects temporarily boost a Superstars attributes, which are triggered by winning streaks and winning big pay-per-view matches in rivalries. Weve also brought back injuries as status effects with big changes. Injuries are inflicted when you deal a huge amount of damage to a specific part of the body, and the level of the injury climbs from minor to major to critical. Superstars can continue to compete with minor and major injuries with penalties to limb health and attributes related to that limb. Once an injury reaches a critical level, the Superstar will be knocked out of commission until their injury heals up. Whenever a rivalry match finishes, a new results screen offers immediate feedback on how it affects everything. Previously, players would have to dig through menus to gather this information and this cuts that down significantly. Keeping tabs on developments and progression has never been easier. WWE 2K16 arrives for Xbox One, PlayStation 4, Xbox 360 and PlayStation 3 on October 27th in North America, the 29th in Australia, and the 30th in Europe. Make sure to read the full article on the details and updates to Universe Mode \"]new advancements to WWE 2K16 Universal Mode here[/url]. # 1 oneamongthefence @ 10/22/15 05:11 PM Sounds like universe is gonna be a blast to play this year and really add longevity to the game itself. Sent from my LG-D850 using Tapatalk # 2 EAGLESFAN10 @ 10/22/15 06:41 PM Quote: https://wwe.2k.com/news/wwe-2k16-uni...w-advancements \"We’ve also brought back injuries as status effects with big changes. Injuries are inflicted when you deal a huge amount of damage to a specific part of the body, and the level of the injury climbs from minor to major to critical. Superstars can continue to compete with minor and major injuries with penalties to limb health and attributes related to that limb. Once an injury reaches a critical level, the Superstar will be knocked out of commission until their injury heals up.\" \"We’ve added more Universe cutscenes and revamped a large portion of the storylines to focus more on quality over quantity.\" \"Now those branching-instance possibilities jump up to ten, creating far more variety in storylines. Everything will make more sense logically with the Superstars involved based on their personality traits.\" I like that cutscenes are tied to personality traits # 3 pmurray20 @ 10/22/15 09:35 PM loved what I heard would b even better for a teaser clip lol # 4 Cowboy008 @ 10/22/15 09:44 PM Quote: Originally Posted by pmurray20 loved what I heard would b even better for a teaser clip lol Yeah it would have been nice. I'm just glad they talked about Universe this year. I know the stuff in the article is not going to work all the time but if it works most of the time this could be a pretty fun year for playing Universe. # 5 Sinner @ 10/22/15 09:50 PM I like what I've seen and heard but really hoping stables matter this year. Don't want members of a stable feuding and fighting. # 6 DBMcGee3 @ 10/23/15 07:52 AM This sounds pretty awesome. I'm actually really excited about this game, hopefully they don't blow it with ****e AI and glitches galore, as per usual. The Universe is my jam. and it actually sounds vastly improved this year. # 7 Junior Moe @ 10/23/15 10:24 AM Man, I am genuinely excited for this game. Can't remember how long its been since I felt that way about a wrestling game. This roster is so comprehensive it's crazy; these new Universe mode additions will only add to it. # 8 wiscowilz @ 10/23/15 10:26 AM I already had fun with Universe Mode in the past with posting it, but this year it sounds like it is going to be even bigger and better and make it even more fun to post. Personality Traits, new cut scenes, everything sounds great. # 9 Cowboy008 @ 10/23/15 10:36 AM Here's another article on Universe mode", "external_links": [], "published": "2015-10-23T00:36:00.000+03:00", "crawled": "2015-10-24T01:36:35.379+03:00", "highlightTitle": ""}