{"organizations": ["NASCAR"], "uuid": "f248e3148a80b0b9d6cffd8dd1bb1046469d7c4c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.torontosun.com", "main_image": "http://storage.torontosun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297763392093_LARGE_BOX.jpg?quality=80&stmp=1445559360548&size=100x", "site_section": "http://www.torontosun.com/sports/rss.xml", "section_title": "Top Sports stories", "url": "http://www.torontosun.com/2015/10/22/kurt-busch-one-monstrous-talent", "country": "CA", "title": "Kurt Busch one monstrous talent", "performance_score": 0, "site": "torontosun.com", "participants_count": 0, "title_full": "Kurt Busch one monstrous talent", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T03:09:00.000+03:00", "replies_count": 0, "uuid": "f248e3148a80b0b9d6cffd8dd1bb1046469d7c4c"}, "author": "", "url": "http://www.torontosun.com/2015/10/22/kurt-busch-one-monstrous-talent", "ord_in_thread": 0, "title": "Kurt Busch one monstrous talent", "locations": ["TALLADEGA", "ALA."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kurt Busch"], "text": "Logano the toast of NASCAR once again TALLADEGA, ALA. - \nTwenty four months ago, Kurt Busch was attempting to reinvent himself for the umpteenth time as a NASCAR Sprint Cup championship driver. \nHe was coming off a season in which he pretty much carried the single-car Furniture Row Racing Chevrolet team into the Chase for the Sprint Cup Championship in 2013. \nIt was a comeback that those who follow stock-car racing closely saw coming because, after all of his shenanigans in his first dozen years in NASCAR, there never was a doubt about his natural talent. \nIt was that natural talent that took him to the pinnacle of the sport, winning a championship driving the No. 97 Roush Racing Ford in 2004, and got him his second big job behind the wheel of the No. 2 Team Penske Racing Dodge. \nIt was his inability to properly harness that talent, however, that cost Busch both of those wondrous opportunities. \nPrior to signing with FRR, Busch appeared to be the very definition of pariah. \nEven after taking that team into its first Chase appearance, there was no line up of team owners looking to take advantage of his skills. \nThere was an even shorter line up of sponsors willing to gamble their good names on Busch. \nIt wasn’t until Gene Haas, himself something of a maverick, reached into his own pockets to sign Busch in 2014 to drive the No. 41 Stewart Haas Racing Chevrolet that Busch got his fourth kick at the can in the world’s top stock-car racing series. \nAnd Haas reportedly had to do it over the objection of just about everybody in the SHR shop in North Carolina. \nFast forward 24 months and Busch has proved, yet again, that his talent trumps just about anything else he brings to the race track. \nHe enters NASCAR’s toughest race — the CampingWorld.com 500 this week at Talladega Superspeedway — ranked third in the Chase, all but assured of moving to the next round. \nBusch, Haas and team co-owner Tony Stewart capped off this most recent renaissance by announcing this week that a primary sponsor had finally been found to share the cost of keeping Busch in Sprint Cup. \nIt helped that Monster Energy isn’t shy about associating itself with professional athletes who are on the edge. \nRegardless, Busch now has a multi-year contract with SHR and Monster. \nHe also appears to be better at handling adversity — there hasn’t been a single screaming or shoving incident this season. \nBusch’s past — one that included drunk driving charges and allegations of domestic abuse — do in fact appear to be in the rearview mirror. \nStewart, who had to be convinced to agree with Haas on Busch’s original signing, is now on board. \nHe now describes Busch as “somebody I really like and believe in as a driver.” \n“He’s a guy you can take anywhere, any track, at any time and he can win races,” Stewart said. \nIf Busch is to be believed he, too, has finally come around to the realization that this time really is his one last chance to carve himself a legacy in NASCAR that is about racing for championships rather than arrests warrants. \n“For me to have the opportunity to drive, I feel very blessed and privileged to have this opportunity,” he said after his new SHR deal was made public. \n“To me, this has been a fantastic year statistics-wise, but behind the scenes there’s been so much support from Stewart-Haas, from Tony, from Gene, from everybody ... to feel the love and camaraderie and also to have this passion and this desire to win, there’s no better place than to have the people at Stewart-Haas, Monster Energy and Kurt Busch together to push for wins and championships at this top level. \n“To me it’s a dream come true to have this opportunity.” \nBusch doesn’t have a lot to prove on the track and his performance over the past two seasons shows he is a force to be reckoned with in NASCAR. \nHe has also said this new commitment to stock-car racing pretty much slams the door shut on as second attempt at racing’s biggest challenge — running both the Indianapolis 500 and the Coca Cola 600 on the same day as he did in 2014 driving a Honda for Andretti Autosport when he finished sixth at Indy and 41st at Charlotte Motor Speedway. \n“I don’t see a need to go back and run Indy, unless Monster wanted to go do something such as that,” Busch told FOXSports.com. \n“The No. 1 focus is Stewart-Haas; No. 2 is Haas Automation and Monster Energy; No. 3 is Chevrolet.” \nIT'S WIN OR GO HOME \nTALLADEGA, Ala. — Matt Kenseth needs a win on Sunday in the CampingWorld.com 500 at Talladega Superspeedway or his chance at a second Chase for the NASCAR Sprint Cup Championship is over. \nNot many would have thought that Kenseth — a five-time race winner this season in the No. 20 Joe Gibbs Racing Toyota — would be in such a precarious position at the halfway point of NASCAR’s version of post-season play. \nHe was the second seed when it all started a month ago at Chicagoland Speedway and he backed that up with a win at New Hampshire a week later. \nIt was a 42nd-place finish at Charlotte Motor Speedway to start the second Chase round and being wrecked last week at Kansas Speedway by Joey Logano that put Kenseth in such a deep hole. \nHe is in 12th place, 35 points out of the final Chase spot, with only eight drivers advancing to the next round after Sunday. \nKenseth, though, is not alone in facing elimination. \nDale Earnhardt Jr., who won at Talladega in the spring, is in 11th position, 31 points back of Martin Truex Jr., who holds on to the prized eighth spot. \nAnd in between Earnhardt and Truex is Ryan Newman and Kyle Busch. \nIt is a combination sure to produce fireworks on Sunday. Sponsored Links", "external_links": [], "published": "2015-10-23T03:09:00.000+03:00", "crawled": "2015-10-23T03:19:39.721+03:00", "highlightTitle": ""}