{"organizations": [], "uuid": "dc02074ede103e1d149bfc5567ea80012a79a07b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "savannahnow.com", "main_image": "http://savannahnow.com/sites/default/files/14816556.jpg", "site_section": "http://savannahnow.com/", "section_title": "savannahnow.com | Savannah Georgia's source for News, Entertainment, Sports, Weather, Classifieds, Jobs, Autos, Real Estate and St. Patricks Day", "url": "http://savannahnow.com/news/2015-10-17/savannahs-district-6-city-council-candidates-talk-issues", "country": "US", "title": "Savannah's District 6 City Council candidates talk issues", "performance_score": 0, "site": "savannahnow.com", "participants_count": 1, "title_full": "Savannah's District 6 City Council candidates talk issues | savannahnow.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T18:43:00.000+03:00", "replies_count": 0, "uuid": "dc02074ede103e1d149bfc5567ea80012a79a07b"}, "author": "Eric Curl", "url": "http://savannahnow.com/news/2015-10-17/savannahs-district-6-city-council-candidates-talk-issues", "ord_in_thread": 0, "title": "Savannah's District 6 City Council candidates talk issues", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photos Back | Next Back | Next Steve Bisson/Savannah Morning News -Stephen McElveen, candidate for the 6nd District. Back | Next Steve Bisson/Savannah Morning News - Tony Thomas, with the 6nd District. Back | Next Steve Bisson/Savannah Morning News - David Self, candidate for the 6nd District. By Eric Curl Incumbent Alderman Tony Thomas is facing three challengers — Zena McClain, Stephen McElveen and David Self — in the race for the District 6 seat on the Savannah City Council.\nAll of the candidates who will be on the Nov. 3 city election ballot recently sat down to discuss their priorities for the districts and the city.\nThe conversations have been edited because of space constraints and for purposes of clarity.\nZENA MCCLAIN\nBIO: McClain has been an attorney since 1996 and graduated from Howard University in Washington, D.C., and the St. Louis University School of Law. She specializes in criminal and employment law with an emphasis on race discrimination, sexual harassment and constitutional litigation.\nSMN: What areas do you feel have not been adequately addressed by the current council?\nM C CLAIN: The crime has gotten really bad on the Southside. I think our alderman is more reactionary as opposed to being proactive. The failure to address the root problems of the crime issue is now affecting the sixth district.\nSMN: What would you do to counteract the increase in crime?\nM C CLAIN: I don’t think there has been effective collaborations between all the elected officials. If there were stronger collaborations between the school board member, the county commissioner, to address the root issues, that would have a positive effect in our neighborhood.\nI know the city has now, on the eve of the election, gone to New York (for End Gun Violence: Step Forward anti-crime initiative) and had the discussion about violence. That is something I talked about eight years ago when I was running for district attorney. The failure to get the district attorney involved in all of this is something that could have happened eight years ago.\nI see a lot of reactionary responses to the crime.\nWhen it comes to police officers’ pay, I believe it was Tony Thomas who suggested we pay a $10,000 sign-on bonus in addition to $2,500 for three years. It was a reactionary response. What’s happening now is you have officers who have been there a long time making less than the new recruits. That creates a morale problem.\nOne of the things I would like to see is children involved in more leadership development courses, conflict resolution classes. I would like to see the neighborhood centers stay open for young children, teenagers to have a place to go.\nSMN: What do you think of the Coffee Bluff Marina for which Alderman Thomas was a big proponent?\nM C CLAIN: That’s another issue. The wasteful spending. I think this current council has spent way too much of the taxpayers’ money. I don’t think decisions are being made that are wise. I’ve gone up to the marina, and each time I go, it’s quite empty. I don’t see a lot of sixth-district people using that marina.\nSMN: What about economic development and poverty?\nM C CLAIN: The poverty issue has not been addressed. I sit on the Historic District Board of Review, and many of the plans we review are hotel developments. Now it’s good for the tourism industry, but they don’t pay good wages at all.\nMy plan is to work closely with the Savannah Economic Development Authority and the Chamber of Commerce and people in those bureaus working hard to bring good paying jobs to the city. Connected to that, you have to have something to attract people here.\nAn industry will bring jobs to a community where they see their workers will benefit. They look for a strong school system, and they look for transportation. We don’t have the transportation here.\nSMN: Anything you want to bring up I did not ask about?\nM C CLAIN: A lot of the districts have neighborhood associations. We don’t have as many neighborhood associations. I would like to hold district-wide meetings to bring everyone together. I want to get them involved and keep them informed on what’s going on.\nAnother thing, I would like to see a strong ethics policy that is going to govern the behavior of anyone we appoint to the city’s boards and commissions because there has been a lot of talk about cronyism and all that. With a strong ethics policy, that will alleviate much of those issues.\nSTEPHEN MCELVEEN\nBIO: McElveen is a Savannah native who graduated from Savannah High School. He has worked for Hyatt Hotels and opened and operated The Paint Store in Richmond Hill for 12 years before selling the business in 2007. He has been working in the security field for SafeTouch Security for the past eight years.\nSMN: Why are you running?\nM C ELVEEN : Something’s got to be done about crime. That’s the concern of everybody here. Whatever is being done is not working properly.\nSMN: So what is your plan to address crime?\nMcElveen: It’s all based on communication as far as I’m concerned. I would be interested when the last time Windsor Forest Neighborhood Association president talked to the Wilshire area neighborhood association president. Facilitating communication between the powers that be, neighborhood associations primarily, seems to me would be the first step in coordinating some kind of effort to get things changed.\nSMN: Are you involved with the neighborhood association here?\nM C ELVEEN : Not currently. It never occurred to me to run for public office until someone approached me about doing this. That was a direct result of the status quo out here. Lack of satisfaction with the way things were.\nSMN: What do you see yourself doing differently?\nM C ELVEEN : There will be different paths. I will have to get involved with it and see, but it’s the type of thing I do for a living. My job is to ask questions and figure out the best way to proceed.\nI’m a sales consultant. I design surveillance systems and that kind of thing. But out of all the candidates out there, who sat there with mom and dad talking about the burglary that happened last week and why mom can’t sleep and about why the kids are terrified? Me.\nThat experience, I’m in the security field already, will help me know which way to go.\nSMN: What do you think about the recent actions the city council took to fill police vacancies such as salary increases and improve public safety by using technologies such as the gunshot detection system. Are they heading in the right direction?\nM C ELVEEN : I think so. Obviously, my mantra is something’s got to be done. A step in the right direction was better pay to get qualified candidates and fill the vacant slots on the police force. But there doesn’t seem to be much urgency to it.\nSMN : What are some other priorities besides crime?\nM C ELVEEN : I’m pro business. I want to do what I can to facilitate sane development. Things that would best benefit the sixth district would be things I do on city council in general. Keep an eye on city spending. It seems to me people are too free with taxpayers money. We need somebody in there to watch the pennies as they flow.\nSMN: How could you help bring businesses here as an alderman?\nM C ELVEEN : Only voting on matters that come up before council such as helping with tax breaks. Part of the reason we are in the shape we are in right now is we are one of the hardest countries in the world to do business in. Be business friendly, and they would come.\nSMN: Do you think there is too much of an emphasis on hospitality type jobs being developed here?\nM C ELVEEN : As long as that’s in the private sector, I’m not concerned about it. Do I want to see a build up of 15 new hotels and seven go out of business? No, I don’t want to see that. I think it should be a very cautious, careful approach to approval of each of those.\nDo I want to open it up and say come build, we will give you a tax break? No. Each one should be handled. For instance, a new start-up company that wants to build their hotel here, I’m not quite sure. But Hilton wants to put another property down here, we may want to support that because they’ve got the wherewithal to do it.\nDAVID SELF\nBIO: Self has lived in southside Savannah for about 10 years after growing up in the suburbs of Washington, D.C.\nHe has a background in management with the New York-based department store Lord & Taylor, was a licensed Realtor for more than 13 years in Virginia and has owned and operated home décor and gift shops in Florida and in Savannah.\nHe currently serves as vice president of operations for a specialty glass designer.\nSMN: Why are you running?\nSELF: I am running to try to make a change in the city. So many things are broken that many districts, including my own, actually do not have a voice, and that’s what aldermen are elected to do, to give voice to the people.\nSMN: What is broken?\nSELF: Our police department. Everybody is talking about the crime in the city. Out of control. Understaffed, overworked. I’ve spoken with many police officers who are not happy with the current situation. It seems like there’s almost a revolving door with officers leaving. We hire them. We train them and they get recruited out to other cities. That’s broken.\nSMN: So what steps would you take to fix it?\nSELF: We need to fully support the chief of police. He needs to be given the resources. Whatever it takes. He came into the city saying he can fix this. It’s progressively gotten worse. I believe he doesn’t have the tools. We don’t have the officers. I question whether he has the finances. We’re taking steps backward, not forward.\nSMN: Do you feel the steps the council recently took are adequate to fill the officer vacancies, such as the pay raises?\nSELF: The pay raise might be a little too little too late. I understand there are a lot of officers who are not happy with it. That it’s a little unfair. It’s not equitable across the board.\nSMN: Besides filling vacancies, what else needs to be done to improve public safety?\nSELF: Part of it is the citizens need to take responsibility. Whether that’s with neighborhood watches. I mean that’s a program that’s been around for years. We don’t need to reinvent the wheel.\nI don’t believe that lock-it or lose-it signs plastered all over a neighborhood really benefit us. It may benefit some, but it has an adverse effect of potential buyers driving into that neighborhood and seeing all these signs and think it’s unsafe.\nSMN: There’s three other candidates running against Alderman Thomas. Why should voters vote for you?\nSELF: I’m a businessman. I’m a thinker. And I’m a voice of reason. Not just a loud voice.\nSMN: As a businessman, what are some of your priorities besides crime?\nSELF: As far as economic development, the first thing I think this city needs to do is put a hold on everything so we can ensure we are not dealing with cronyism. That it’s not some political favor being done and it is in fact the right thing for the city. Buying the fairgrounds for $3 million could have purchased what I believe is roughly 72 police cars.\nSMN: So you’re opposed to that purchase?\nSELF: I’m opposed to it when it’s not a priority. There are bigger priorities than the fairgrounds.\nSMN: What do you think of the Coffee Bluff Marina?\nSELF: It’s a lovely place to visit. The marina has its benefits to a lot of residents in the city. The problem with the marina is not what it is today. It’s what it took to get there with what I believe is poor planning.\nThere were people in the neighborhood, who worked there, that gave their opinions of what you need to do to build a successful marina. And now the city has filed suit against the architects for building the marina the way it is. The cost overruns.\nThere were things in the original plans, taken out, put back in. There is no dry-dock storage, which is needed. That’s a money stream.\nTONY THOMAS-INCUMBENT\nBIO: Thomas is a native of Savannah who was first elected to the council in 1999. He attended Armstrong Atlantic State University and Savannah State University before launching an advertising firm.\nHe also opened and operates a local retail business. He has served on the boards of the United Way, Southside YMCA Board, and the EOA Volunteers & Retirees Advisory Board, in addition to serving as the council liaison for the Savannah Development and Renewal Authority, the Trade Center Authority and the Savannah Convention and Visitors Bureau.\nSMN: What are some of the projects you would like to work on if re-elected?\nTHOMAS: Mohawk Lake, which is right behind the Savannah Mall is one of the main projects. It will be similar to the Joseph Tribble Park we did in Windsor Forest, which provides recreational, walking (facilities). This project will provide canoeing and sailing.\nThere are sidewalk projects also.\nI also believe we have an immediate need to relocate our Golden Age Center, which is located in Windsor Forest Elementary School. The school has crowding issues, and they need it for students. So I am pushing forward for a new Golden Age Center for our seniors.\nSMN: Do you think the city should move forward with the current arts center design?\nTHOMAS: No. I don’t. Based upon what I’ve heard from what I consider experts in the business, I do not feel we need to move forward with the center as currently designed until those experts have been engaged and we can either incorporate their concerns and try to fix what’s wrong or change the plan to make this a structure that will be useful for decades to come.\nSMN: Does the Coffee Bluff Marina have everything it needs now to be a success and satisfy the new operator?\nTHOMAS: I think the new operator is extraordinary. The power is fully functional now on the docks. The gas line is being moved, and that should be finished, I believe, by December. The one other design, and the contractor and I talked about this on Sunday, was the kayak launch area itself. We are going to change our concept to do an on-dock launch. I believe that would be something additional we will be bringing forth.\nSMN: Have you ever seen crime get to the level where it is now during your 16 years as an alderman?\nTHOMAS: I’ve never seen crime as bad as it is right now. And I’ve never seen the perception of crime as bad as it is since I’ve been in office.\nAs for me, this is no surprise. I was the alderman out there on a limb by myself talking about crime issues, talking about the former chief we had. Talking about crime reports and reports that were changed and being reflected as crime not being as bad as it was.\nI feel vindicated to some extent but am also concerned about the rise of crime in this community. We have got to get control of it.\nSMN: Do you feel like the necessary steps are now being taken?\nTHOMAS: First of all, let’s talk about how bad the ship was. We have a former police chief incarcerated. We just recently had a (corruption) suit that was filed that several officers are making substantial claims.\nFrom what (chief) Lumpkin is doing, to turn the ship, is going to take time, and it takes a person of integrity like the current chief. The number that the media has not reported, which makes me feel good about chief Lumpkin, is 45. That’s the number of terminations that have been made.\nThis is a chief who is taking the integrity of the department, and his personal integrity, and applying it to fix a department that has been destroyed by politics and bad leadership.\nSMN: The city has the parental responsibility, curfew and the landlord responsibility ordinance you pushed for? Why aren’t they being enforced?\nTHOMAS: When the new council is seated, the first issue the new council has to decide is whether the policy is being carried out by staff. Are we happy with current staff and do we continue with the current staff?\nOn the web: Go to savannahnow.com/elections for voter tools, an aldermanic districts map, the latest election coverage and more!", "external_links": ["http://sav-cdn.com/sites/all/themes/whitelabel/images/blank.gif", "http://sav-cdn.com/sites/default/files/imagecache/story_slideshow_thumb/14816556.jpg", "http://sav-cdn.com/sites/default/files/imagecache/story_slideshow_thumb/14816554.jpg", "http://sav-cdn.com/sites/default/files/imagecache/superphoto/14816553.jpg", "http://sav-cdn.com/sites/default/files/imagecache/story_slideshow_thumb/14816553.jpg", "http://sav-cdn.com/sites/default/files/imagecache/superphoto/14816554.jpg", "http://sav-cdn.com/sites/default/files/imagecache/superphoto/14816556.jpg", "http://sav-cdn.com/sites/default/files/imagecache/superphoto/14816555.jpg", "http://sav-cdn.com/sites/all/themes/savannahnow/images/blank.gif", "http://sav-cdn.com/sites/default/files/imagecache/story_slideshow_thumb/14816555.jpg"], "published": "2015-10-17T18:43:00.000+03:00", "crawled": "2015-10-18T14:06:45.568+03:00", "highlightTitle": ""}