{"organizations": [], "uuid": "fa5bb6dac98ade5490191b16bd8695ea025baf1e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "http://s4.reutersmedia.net/resources/r/?m=02&d=20151026&t=2&i=1089895229&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXNPEB9P0YV", "site_section": "http://feeds.reuters.com/reuters/sportsNews\r", "section_title": "Reuters: Sports News", "url": "http://www.reuters.com/article/2015/10/26/us-golf-rules-idUSKCN0SK20D20151026?feedType=RSS&feedName=sportsNews", "country": "US", "title": "Updated rules eliminate DQs for some scorecard errors", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "Updated rules eliminate DQs for some scorecard errors", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T18:06:00.000+02:00", "replies_count": 0, "uuid": "fa5bb6dac98ade5490191b16bd8695ea025baf1e"}, "author": "", "url": "http://www.reuters.com/article/2015/10/26/us-golf-rules-idUSKCN0SK20D20151026?feedType=RSS&feedName=sportsNews", "ord_in_thread": 0, "title": "Updated rules eliminate DQs for some scorecard errors", "locations": ["Hong Kong", "China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A course worker cuts the grass at a golf club in Hong Kong, China October 22, 2015. Reuters/Tyrone Siu \nGolfers will no longer be disqualified for failing to include penalty strokes on their scorecards, when unaware of the violation, in one of a number of rule changes announced on Monday by the sport's governing bodies. \nThis limited exception to the 'disqualification penalty for submission of incorrect scorecard' would have saved Padraig Harrington and Camilo Villegas from being disqualified from events during the 2011 season had it applied at the time. \n\"A player is not disqualified for returning a lower score for a hole than actually taken as a result of failing to include penalty strokes that the player did not know were incurred before returning the scorecard,\" the game's rulemakers said in a joint statement. \n\"Instead, the player incurs the penalty under the rule that was breached and must add an additional penalty of two strokes for the scorecard error. \n\"In all other cases in which a player returns a score for any hole lower than actually taken, the penalty will continue to be disqualification.\" \nThis exception was announced by the United States Golf Association and the R&A as part of the updated rules to be ushered in on Jan. 1 as the culmination of a standard four-year review cycle. \nABU DHABI \nIf this rule had applied four years ago, Harrington would not have been disqualified from the Abu Dhabi Championship for signing an incorrect scorecard when a television viewer noticed he had moved his ball a fraction on the seventh green. \nThe viewer contacted European Tour officials to explain that Harrington had marginally knocked his ball forward on a par-three hole while replacing his marker during the opening round. \nThe Irishman was therefore considered guilty of signing an incorrect score as he should have called a two-stroke penalty on himself for moving the ball. \n\"(Under the new rules) Harrington would have received the original penalty, plus an additional two-stroke penalty for signing an incorrect scorecard, but he would still be in the competition and playing golf,\" Thomas Pagel, the USGA's senior director of the rules of golf, said on a conference call. \nIn a similar fashion, Colombian Villegas would have escaped disqualification from the PGA Tour's season-opening Tournament of Champions in 2011 when he was spotted by a viewer to have breached the rules. \nAmong other changes, a golfer will no longer be automatically deemed to have caused the ball to move after address while the long-awaited ban on anchoring long putters to the body will also take effect from Jan. 1. \n(Reporting by Mark Lamport-Stokes in Los Angeles; Editing by Tony Jimenez ) Trending On Reuters", "external_links": [], "published": "2015-10-26T18:06:00.000+02:00", "crawled": "2015-10-26T18:52:59.300+02:00", "highlightTitle": ""}