{"organizations": [], "uuid": "6eaf2a642f393b503dc7e1a79e438e8e8580857f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.azcentral.com", "main_image": "http://www.gannett-cdn.com/-mm-/fde315c4f08cfada906cd46d5eb64bf1378f731c/c=0-0-2994-1691&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/05/USATODAY/USATODAY/635796696685450634-CXX-SYRIA-06-76510216.JPG", "site_section": "http://www.azcentral.com/sports/", "section_title": "azcentral sports - Phoenix Arizona Sports news, scores, schedules, photos, videos", "url": "http://www.azcentral.com/story/sports/soccer/worldcup/2015/10/05/amid-isis-civil-war-syria-national-soccer-team-world-cup-qualify/73402438/", "country": "US", "title": "Amid civil war, Syria pushes to qualify for World Cup for first time", "performance_score": 0, "site": "azcentral.com", "participants_count": 1, "title_full": "Amid civil war, Syria pushes to qualify for World Cup for first time", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T00:37:00.000+03:00", "replies_count": 0, "uuid": "6eaf2a642f393b503dc7e1a79e438e8e8580857f"}, "author": "azcentral.com", "url": "http://www.azcentral.com/story/sports/soccer/worldcup/2015/10/05/amid-isis-civil-war-syria-national-soccer-team-world-cup-qualify/73402438/", "ord_in_thread": 0, "title": "Amid civil war, Syria pushes to qualify for World Cup for first time", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON — Somewhere amid the strife engulfing Syria and the human rights crisis created by its brutal civil war sits a remarkable and complex sporting tale.\nSyria’s national soccer team, a squad that was never able to qualify for the FIFA World Cup in times of peace, is closer than ever to attaining that goal at the exact time upheaval is raging in the land it represents.\nSyria will play its latest World Cup qualifier on Wednesday when it faces Japan, the strongest and most experienced team in the Asian region. Another victory, to add to the three in a row with which it has started its qualifying campaign, would all but assure Syrian progression to the final qualification stage and within reach of the tournament in Russia in the summer of 2018.\nThe Syrians’ success has been achieved despite losing a swath of players who have fled the country for safety reasons while the conflict involving the regime led by Bashar Assad, ISIS and various rebel groups has escalated.\nOn one side, it would appear to portray as a unifying tale of extraordinary hope.\n“We come from all aspects of Syria,” team captain Abdulrazak Al Husein told The Guardian last week. “Whether you are a Christian or a Muslim or any sector of Islam we’re all one family, we’re playing for one team, one country.”\nAbdulrazak al-Husein of Syria celebrates scoring his goal against Afghanistan during their 2018 World Cup qualifying group E football match at Samen stadium in Iran's northeastern city of Mashhad on June 11, 2015. Iran hosts the match for Afghanistan due to the long time unrest in the neighbouring Afghanistan. (Photo: BEHROUZ MEHRI, AFP/Getty Images)\nSuch a narrative sounds uplifting, especially in the midst of political and humanitarian devastation that shows no sign of abating. The reality, however, is far more complicated.\nAccording to James Dorsey, author of The Turbulent World of Middle Eastern Soccer blog , the squad and all top-level soccer in Syria comes under the control of Assad, the notorious leader accused by the U.S. government of atrocities against his own people.\n“There is no question that this is a team of the regime,” Dorsey said. “Syria is a country that is at war with itself. The national team, however you want to play it, is a team that is controlled by the government of Assad, in a place where he controls only a minority of the country. Even if you did not have this current situation in Syria, it’s a total politically controlled sport in that country and always has been.”\nSuch is the conflict faced by Syrian Americans.\n“Any Syrian is going to be happy that there is a Syrian team that is competing on the world stage,” said Kenan Rahmani, a 27-year-old student at American University’s Washington College of Law. “But it is a team that is run by the same government that is killing its own citizens. The Syrian people have suffered every tragedy you could ever imagine. It is hard to think about soccer when there are terrible forces destroying our country.”\nEven so, it is impossible to argue that Syria making the qualifying finals for the first time, in the face of such obstacles, would be an incredible achievement.\nUSA TODAY\nOfficials: ISIL destroys Palmyra's Arch of Triumph\nWednesday’s game is, in theory, a “home” match, but it will be played in Oman, because the conflict makes staging games in Syria impossible.\nSyria is ranked No. 123 in the world but looks to be in good shape to finish in the top two in its qualifying pool, regardless of the result against Japan. That would place it among the final 12 Asian teams left in contention. At least four of those will play in the next World Cup.\nEven the site of that tournament provides a coincidence and paradox interwoven with political upheaval, with Russia and President Vladimir Putin splitting western opinion with its bombing of targets within Syria and its perceived backing of Assad.\nAmid it all, the Syrian players have managed to produce quality performances on the field, thrashing Afghanistan and Cambodia 6-0 on the road and defeating Singapore 1-0 in Oman, in front of an official attendance of 100 spectators.\nSyrian player Omar Kharbin battles with Cambodian player Chhin Chhoeun (C-R) during the FIFA World Cup 2018 qualification match between Cambodia and Syria at the Olympic National Stadium in Phnom Penh, Cambodia, (Photo: MAK REMISSA, EPA)\nProfessional soccer in Syria was once strong, albeit dominated by the military- and police-led teams, who would recruit the best players available. Now, a fully-fledged league is impossible, with vast areas of the country too unstable as warring factions attempt to secure bases of power.\nSeveral former national team members have sought refuge overseas. In Lebanon, former professional players from Syria have founded the Free Syria National Team, which aims to become the official national team if Assad is ousted from power.\n“Our goal is to wipe out the team, which plays in the name of the (Assad) regime,” one player told The Associated Press last year. It is unclear, says Dorsey, whether the individuals on the current team are playing of their own free will or are under governmental pressure.\nComment from present national team players has been limited, although goalkeeper Mosab Belhous and coach Fajr Ibrahim recently spoke out after the heartbreaking scenes of the mass refugee exodus attempting to reach western Europe.\nUSA TODAY\nU.S.-Russia conflict zones reach far beyond Syria\n“The image of the Syrian child that drowned was in circulation,” Belhous said, in reference to the globally distributed photograph of 3-year-old Aylan Kurdi, who died as his family fled from ISIS. “It had a significant effect on us as players.”\nIbrahim said, “Our hearts ache and bleed from watching such scenes.”\nSoccer, even amid the turmoil, is deeply embedded politically. The commonly held belief is that the existence of a Syria national team, especially a successful one, allows Assad to promote the notion that it is still a country under his control.\n“Soccer (is) never distant from Middle Eastern politics,” Dorsey said. “It weaves its own thread through the brutal battle for the future of Syria.”", "external_links": ["http://www.gannett-cdn.com/-mm-/ae8c18203a33be29888b2941e900df4ccd37225c/r=500x352/local/-/media/2015/10/05/USATODAY/USATODAY/635796696687634662-C01-SYRIA-Z-06-76510214.JPG", "http://www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/a8792b4ce2dcfe8475aaace0073169078ee42df9/c=593-0-2856-2263/local/-/media/2015/10/05/USATODAY/USATODAY/635796162679796053-AFP-545033793.jpg", "http://www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/4c4a82896da3c8308e73ebda911468a948e23142/c=541-0-2703-2162/local/-/media/2015/10/01/USATODAY/USATODAY/635793112162030748-AFP-544880603.jpg", "http://www.gannett-cdn.com/media/2015/10/05/USATODAY/USATODAY/635796696687634662-C01-SYRIA-Z-06-76510214.JPG", "http://www.usatoday.com/story/news/world/2015/10/01/us-russia-conflict-zones-reach-far-beyond-syria/73158576/", "http://www.gannett-cdn.com/media/2015/10/05/USATODAY/USATODAY/635796702806345106-EPA-CAMBODIA-SOCCER-FIFA-WORLD-CUP-2018-QUALIFICAT-75699318.JPG", "http://www.gannett-cdn.com/-mm-/3f763a6bee4ff49a4e998d2a4f70f69219fc2394/c=518-229-2771-1923&r=x408&c=540x405/local/-/media/2015/10/05/USATODAY/USATODAY/635796696687634662-C01-SYRIA-Z-06-76510214.JPG", "http://www.usatoday.com/story/news/world/2015/10/05/isil-palmyra-arch-triumph/73364166/", "http://www.gannett-cdn.com/-mm-/4cdb338825c7a8a58ff7bf72c5865c1029d8e018/r=500x327/local/-/media/2015/10/05/USATODAY/USATODAY/635796702806345106-EPA-CAMBODIA-SOCCER-FIFA-WORLD-CUP-2018-QUALIFICAT-75699318.JPG", "http://www.gannett-cdn.com/-mm-/5fd9d3c9017bffa4e1da9454db3add384aad9de4/c=239-0-3487-2442&r=x408&c=540x405/local/-/media/2015/10/05/USATODAY/USATODAY/635796702806345106-EPA-CAMBODIA-SOCCER-FIFA-WORLD-CUP-2018-QUALIFICAT-75699318.JPG"], "published": "2015-10-06T00:37:00.000+03:00", "crawled": "2015-10-06T07:08:49.769+03:00", "highlightTitle": ""}