{"organizations": [], "uuid": "a59ed3ca39c732e0313dc262e2698b15d616249d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.winnipegfreepress.com", "main_image": "http://media.winnipegfreepress.com/images/637*432/VCRD129306518_high.jpg", "site_section": "http://www.winnipegfreepress.com/rss/?path=/sports", "section_title": "Winnipeg Free Press: Sports", "url": "http://www.winnipegfreepress.com/sports/nyquist-scores-in-overtime-as-red-wings-come-back-to-beat-canucks-336768851.html", "country": "US", "title": "Canucks blow another third-period lead, fall 3-2 to Red Wings in overtime", "performance_score": 0, "site": "winnipegfreepress.com", "participants_count": 1, "title_full": "Canucks blow another third-period lead, fall 3-2 to Red Wings in overtime - Winnipeg Free Press", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T01:59:00.000+02:00", "replies_count": 0, "uuid": "a59ed3ca39c732e0313dc262e2698b15d616249d"}, "author": "Joshua Clipperton, The Canadian Press", "url": "http://www.winnipegfreepress.com/sports/nyquist-scores-in-overtime-as-red-wings-come-back-to-beat-canucks-336768851.html", "ord_in_thread": 0, "title": "Canucks blow another third-period lead, fall 3-2 to Red Wings in overtime", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "VANCOUVER - Another late collapse at home has the Vancouver Canucks searching for answers.\nGustav Nyquist scored at 3:50 of 3-on-3 overtime Saturday as the Detroit Red Wings defeated Vancouver 3-2 in a game the Canucks controlled 2-0 after 40 minutes.\n\nDetroit Red Wings' Gustav Nyquist, back, of Sweden, celebrates his game-winning goal against the Vancouver Canucks with teammate Jakub Kindl, of the Czech Republic, during the overtime period of an NHL hockey game in Vancouver, B.C., on Saturday October 24, 2015. THE CANADIAN PRESS/Darryl Dyck \nVancouver also blew a third-period lead in Thursday's 3-2 home loss to the Washington Capitals and has already dropped three games at Rogers Arena this season when leading after two periods.\n\"We've got to figure it out here. We've got to be more prepared going into third period,\" said Canucks defenceman Christopher Tanev. \"I felt we controlled the game the first two periods, we come out flat again and it's 2-2 before you blink.\"\nVancouver (3-2-3) fell to 0-2-3 at home, including 0-2-2 on its current five-game homestand.\n\"If we knew why it would be a lot easier. They came hard and we just didn't have that response,\" said Canucks forward Brandon Sutter. \"It's not fun when you have a homestand like this. You look at the hockey we've played through it all, we've played pretty well. We've just have five- or 10-minute lapses where we're mentally not sharp and not doing things right.\"\nAfter the Canucks killed off a penalty to Daniel Sedin in the extra period to stay alive, Detroit goalie Petr Mrazek caught Vancouver on a bad change. He fed a stretch pass to Nyquist, who moved in alone on Ryan Miller before burying his fourth of the season.\n\"I think everybody is going to be a little bit frustrated after the game,\" said Canucks head coach Willie Desjardins. \"But frustration doesn't get you a lot of things. It's a negative thing. We have to be motivated. We have to find a way to get better. We can't be frustrated. We can't be intimidated. We have to find ways to get better.\"\nTomas Tatar, with a goal and an assist, and Teemu Pulkkinen scored in regulation for Detroit (4-3-1), which snapped a four-game slide.\n\"We weren't good enough in the first two periods,\" said Mrazek, who finished with 30 saves. \"We talked in the dressing room that we had to be better and play smarter.\"\nTanev and Sutter replied for Vancouver, while Miller made 25 saves.\nComing off a 3-2 overtime loss to the Calgary Flames on Friday, the Red Wings cut the Canucks' lead in half when Pulkkinen beat Miller through the five-hole on a breakaway for his fourth at 4:25 of the third.\nDetroit then went to work on the power play and tied the score when Tatar fired shortside on Miller for his second at 6:59.\nThe Canucks led 1-0 after the first period and doubled that advantage at 8:02 of the second on Sutter's third of the season off a pass from Alexandre Burrows, who finished with two assists.\nVancouver's second power-play goal of the night, and third in two games, came after an ugly 1-for-22 stretch with the man advantage that the Canucks finally snapped in Thursday's loss to Washington.\nMiller didn't have a whole lot to do in the first two periods against a team playing its third game in four nights, but he had to be sharp on Nyquist's effort with a minute to go in the second that just trickled wide.\nVancouver opened the scoring with 6:57 left in the period on the power play when Tanev took a pass in the slot and fired a shot past Mrazek's glove for his first.\n\"Through 40 minutes we didn't give them anything to be honest with you,\" said Sutter. \"We just haven't found a way to close one out here.\"\nNotes: Detroit was without defencemen Mike Green and Kyle Quincey after both suffered injuries against the Flames. ... The Canucks conclude their homestand on Tuesday against the Montreal Canadiens.\n---\nFollow @JClipperton_CP on Twitter\n ", "external_links": [], "published": "2015-10-25T01:59:00.000+02:00", "crawled": "2015-10-25T11:13:15.829+02:00", "highlightTitle": ""}