{"organizations": [], "uuid": "94b01692e89ee77d5e935a2a09faced1e908279f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usatoday.com", "main_image": "http://www.gannett-cdn.com/-mm-/e105b9ac1eed83ac41b4cb634740b60b33588b27/c=0-305-4632-2911&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/10/24/USATODAY/usatsports/07a65e24a76fad2f850f6a7067008dc0.jpg", "site_section": "http://www.usatoday.com/sports/", "section_title": "USA Today | Sports", "url": "http://www.usatoday.com/story/sports/motor/formula1/2015/10/24/haas-f1-eyeing-us-grand-prix-as-home-race-in-2016-debut/74522782/", "country": "US", "title": "Haas F1 eyeing US Grand Prix as 'home race' in 2016 debut", "performance_score": 0, "site": "usatoday.com", "participants_count": 0, "title_full": "Haas F1 eyeing US Grand Prix as 'home race' in 2016 debut", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T10:56:00.000+03:00", "replies_count": 0, "uuid": "94b01692e89ee77d5e935a2a09faced1e908279f"}, "author": "", "url": "http://www.usatoday.com/story/sports/motor/formula1/2015/10/24/haas-f1-eyeing-us-grand-prix-as-home-race-in-2016-debut/74522782/", "ord_in_thread": 0, "title": "Haas F1 eyeing US Grand Prix as 'home race' in 2016 debut", "locations": ["US"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Photo: The Associated Press)\n1 CONNECT TWEET LINKEDIN COMMENT EMAIL MORE AUSTIN, Texas (AP) — Guenther Steiner was surrounded by men in red drinking coffee and picking over the lunch buffet between practice sessions at the United States Grand Prix. The name over the door above was Scuderia Ferrari.\nIt won't be long, however, before Steiner sits in a Haas F1 team hospitality tent and directs his own cars around a Formula One race track.\nThe first American-led Formula One team in a generation is set to debut next year, and team principal Steiner was working the paddock Friday at what Haas will consider its \"home race\" next season. His mission: meet with everyone he can, from engine supplier Ferrari down to the caterers who will supply the meals during race weeks.\n\"It's the last race I go to this year,\" Steiner said. \"There's lots of contacts to be made, because the next time we see them we'll be racing.\"\nMake no mistake: Haas is organized and ready to make an impact when it hits the grid in Australia next April.\n\"We are aiming for the middle,\" Steiner said. \"We have to. Nobody aims for last.\"\nMost will assume they start there until proven otherwise. But Steiner and team owner, industrialist Gene Haas, co-owner of NASCARS's Stewart-Haas Racing, have taken every step they can to try to keep their team off the back row.\nThe agreement with Ferrari gives them an established engine, even if it's not quite ready to match Mercedes. For comparison, see Red Bull's struggles this season with Renault and Honda's very difficult return to Formula One with McLaren.\n\"There is no team in Formula One more accomplished than Scuderia Ferrari, and no team with more history,\" Haas said. \"They've been a part of Formula One from the beginning, and now they'll be a part of Haas F1 Team's beginning.\"\nHaas F1 signed veteran Frenchman Romain Grosjean as its first driver, and announcement of a second could still be weeks away.\nBut most importantly, Haas didn't rush into Formula One after receiving its license in April 2014. It initially planned a 2015 start, but determined that waiting a year was a better strategic move for success.\n\"'We sat down and said, 'Whoa, this is too steep of a mountain to be climbed in a year,'\" Steiner said. \"If you had entered in '15, we would have made mistakes others have made.\"\nThe FIA granted entry to an American team in 2009 — the USF1 team — but it collapsed shortly before the start of the 2010 season.\nSteiner and Gene Haas see a \"home race\" link between his team at the U.S. Grand Prix as essential for both his team and the popularity of the sport in America. They have been unfazed by skepticism.\n\"As an American team, having an F1 race on American soil is incredibly important,\" Haas said. \"In four months, we'll be testing our car in Barcelona. In five months, we'll be on the grid in Australia. A year from now, we'll be racing in our home country, hopefully having scored some points and proving that we can hold our own with the established teams of Formula One.\"\nFormula One likes being in the U.S. and will welcome a team that can claim it as its home country, Steiner said.\n\"Now we're coming as a team and more people will come to watch and follow. The momentum is there,\" Steiner said.\n1 CONNECT TWEET LINKEDIN COMMENT EMAIL MORE Copyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.\nTOP VIDEOS", "external_links": ["http://www.linkedin.com/shareArticle?url=http%3A//usat.ly/1S1ZwmA&mini=true", "https://twitter.com/intent/tweet?url=http%3A//usat.ly/1S1ZwmA&text=Haas%20F1%20eyeing%20US%20Grand%20Prix%20as%20%27home%20race%27%20in%202016%20debut&via=usatoday", "http://www.gannett-cdn.com/-mm-/d84347a29e9ded3a5942fe0d34fff66cddc96c59/c=172-0-4460-3216&r=x404&c=534x401/local/-/media/2015/10/24/USATODAY/usatsports/07a65e24a76fad2f850f6a7067008dc0.jpg"], "published": "2015-10-24T10:56:00.000+03:00", "crawled": "2015-10-24T12:03:44.315+03:00", "highlightTitle": ""}