{"organizations": ["SDSU", "Aztecs", "USU", "Aggies"], "uuid": "017ccb6296d07d0c50d7300543caed4ebebf77dd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.deseretnews.com", "main_image": "http://img.deseretnews.com/images/article/hires/1615566/1615566.jpg", "site_section": "http://www.deseretnews.com/sports/index.rss", "section_title": "Sports News | Deseret News", "url": "http://www.deseretnews.com/article/865639825/Saturday-morning-quarterback-Stars-and-stats-from-USUs-creaming-defeat-at-SDSU.html", "country": "US", "title": "Saturday morning quarterback: Stars and stats from USU's creaming defeat at SDSU", "performance_score": 0, "site": "deseretnews.com", "participants_count": 0, "title_full": "Saturday morning quarterback: Stars and stats from USU's creaming defeat at SDSU | Deseret News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T02:00:00.000+02:00", "replies_count": 0, "uuid": "017ccb6296d07d0c50d7300543caed4ebebf77dd"}, "author": "", "url": "http://www.deseretnews.com/article/865639825/Saturday-morning-quarterback-Stars-and-stats-from-USUs-creaming-defeat-at-SDSU.html", "ord_in_thread": 0, "title": "Saturday morning quarterback: Stars and stats from USU's creaming defeat at SDSU", "locations": ["Wyoming"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Aggies suffered a rude awakening from the Aztecs Friday night, USU looks ahead to Wyoming.\nUpcoming Games USU Football USU Wyoming @ USU Merlin Olsen Field at Maverik Stadium, Logan Oct. 30, 8:15 p.m. 6 Days 2 Hrs 10 Mins 5 Secs More Coverage USU football: Aggies suffer first Mountain West loss, fall to SDSU “ Its a college football game, and we got our butt beat. How we respond and how we go back to practice and back to work will determine how far we go. These kids have a lot of resiliency and its embarrassing for me and them.”\nUtah State head coach Matt Wells\nSAN DIEGO — The tables turned for the Utah State Aggies on Friday night.\nAfter knocking the nationally ranked Boise State Broncos right out of the stadium last weekend, San Diego State took its turn, blowing over the Aggies 48-14.\nThe loss handed USU its first Mountain West Conference loss of the season, and SDSU is the lone undefeated team in the conference.\n“It’s a college football game, and we got our butt beat. How we respond and how we go back to practice and back to work will determine how far we go,” Utah State head coach Matt Wells said. “These kids have a lot of resiliency and it’s embarrassing for me and them.”\nScoring recap\nSan Diego State struck first as quarterback Maxwell Smith connected with Mikah Holder on an 18-yard pass. SDSU continued to roll as Chase Price rushed for 13 yards before Smith finished the Aztec drive, bolting in a 1-yard touchdown to extend the lead to 14-0.\nWrapping up the opening 15 minutes of play, SDSU kicked in a 41-yard field goal to build a 17-point lead.\nUtah State’s funk continued as San Diego State rushed in a touchdown with 6:51 to play in the second quarter to lengthen the gap to 24-0.\n“We weren’t ready. We came out and played badly versus a really good team,” senior defensive end Jordan Nielsen said. “I feel like we just got our heads too high after that win (against Boise State), and we just came out like we thought we should win.”\nThe Aggies put their first score on the board late in the half when quarterback Kent Myers connected with Hunter Sharp on a 45-yard pass.\nSan Diego State quickly answered as Donnel Pumphrey rushed for a 62-yard touchdown to regain the 24-point lead.\nDonny Hagemen kicked a 21-yard field goal to increase the lead to 34-7 at the half.\nThe Aggies showed some fight in the third quarter, outscoring the Aztecs 7-0 as Devante Mays punched in a 26-yard touchdown.\nResponding in the final quarter, San Diego State snatched its points back with a rushing touchdown in the fourth to take a 41-14 lead with 8:47 to play.\nThe Aztecs put up the game’s final score with five minutes to play to mark their 34-point win.\n“The bottom line is, hats off to San Diego State. They outplayed us, first of all,” Wells said. “Second of all, we weren’t able to, one bit, stop the ball, one bit, run the football.”\nThree stars\nDevante Mays\nMays rushed for 88 yards in his career-high 15 carries. The junior running back rushed for a touchdown from 26 yards out to mark his fifth touchdown of the season.\nJordan Nielsen\nNielsen earned a career-high nine tackles in the loss.\nHunter Sharp\nSharp led all receivers with 63 yards. The senior wide receiver caught his fourth touchdown of the season on a 45-yard connection from Myers in the second quarter.\nAnalyzing the stats\n— San Diego outplayed Utah State in nearly every statistic. The Aztecs outrushed the Aggies, 336-144. SDSU finished with 429 yards of total offense to USU’s 239, which is its season-low.\n— USU finished the game with four turnovers — three fumbles and an interception — to SDSU’s zero.\n— The loss dropped Myer’s record to 8-2 as starting quarterback.\nA look ahead\nThe Aggies look to shake off the lapse to the Aztecs and look ahead to hosting Wyoming Friday.\n“That’s not Aggie football ,” Wells said. “How we bounce back and respond from this will probably write the story for the rest of the season.”\nAfter starting their season 0-6, the Cowboys picked up their first win of the season over Nevada Friday night.\nWyoming put up 21 points in the second quarter alone to guide the Cowboys to the victory as quarterback Cameron Coffman led the way by completing 18-of-20 for 213 yards and three touchdowns.\n“Last week’s game we were in the driver’s seat, so now we have to put our hard hats on and go to work,” junior center Austin Stephens said. “That’s the biggest for us. We just have to learn from this and move on. That’s all you can really do. You can’t sit back and wait.”\nThe Aggies and the Cowboys kick off at 8:15 p.m. MT in Maverik Stadium.", "external_links": ["http://deseretnews.sportsdirectinc.com/football/ncaaf-teams.aspx?page=/data/ncaaf/teams/team100.html"], "published": "2015-10-25T02:00:00.000+02:00", "crawled": "2015-10-25T02:05:28.425+02:00", "highlightTitle": ""}