{"organizations": [], "uuid": "86602d6560a7d50e23877d5c9aed917470fc8bec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.timesunion.com", "main_image": "http://ww4.hdnux.com/photos/41/47/64/8813855/3/rawImage.jpg", "site_section": "http://timesunion.com//home/collectionRss/Homepage-HCat-Sports-6377.php", "section_title": "Sports news", "url": "http://www.timesunion.com/sports/article/Patriots-own-Colts-again-6576900.php", "country": "US", "title": "Patriots own Colts again", "performance_score": 0, "site": "timesunion.com", "participants_count": 1, "title_full": "Patriots own Colts again - Times Union", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T03:44:00.000+03:00", "replies_count": 0, "uuid": "86602d6560a7d50e23877d5c9aed917470fc8bec"}, "author": "timesunion.com", "url": "http://www.timesunion.com/sports/article/Patriots-own-Colts-again-6576900.php", "ord_in_thread": 0, "title": "Patriots own Colts again", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photo: John Minchillo Image 1 of / 2   2 New England Patriots running back LeGarrette Blount (29) celebrates a touchdown with quarterback Tom Brady (12) in the second half of an NFL football game against the Indianapolis Colts in Indianapolis, Sunday, Oct. 18, 2015. (AP Photo/John Minchillo) ORG XMIT: INMC131 New England Patriots running back LeGarrette Blount (29) celebrates a touchdown with quarterback Tom Brady (12) in the second half of an NFL football game against the Indianapolis Colts in Indianapolis, ... more Photo: John Minchillo Image 2 of 2 Indianapolis Colts strong safety Mike Adams (29) scores a touchdown on an interception on a pass from New England Patriots quarterback Tom Brady in the first half of an NFL football game in Indianapolis, Sunday, Oct. 18, 2015. (AP Photo/AJ Mast) ORG XMIT: INMC119 Indianapolis Colts strong safety Mike Adams (29) scores a touchdown on an interception on a pass from New England Patriots quarterback Tom Brady in the first half of an NFL football game in Indianapolis, ... more Photo: AJ Mast Patriots own Colts again 1  /  2 Back to Gallery Indianapolis \nTom Brady got his revenge — with a little help from the Colts.\nHe exposed holes in the defense, allowed his teammates to do most of the heavy lifting and let Indianapolis take the air out of its own building with a bone-headed fake punt that turned the game.\nBrady threw for 312 yards, three touchdowns and led the Patriots to two second-half scores in a 34-27 victory Sunday night in the \"Deflategate\" rematch.\nIt was a strange night.\nIn a series defined by wild games and crazy plays, Indy's awful punt might have been the worst of the worst. With most of the offensive line set up near the right sideline, Indy snapped the ball to Colt Anderson , who was immediately tackled for a 1-yard loss that gave the Patriots the ball at the Colts' 35.\nSix plays later, Brady got free from the pass rush and hooked up with LeGarrette Blount for an 11-yard touchdown pass to give the Patriots a 34-21 lead early in the fourth quarter.\n\"I saw the formation, and I wasn't sure what was going on,\" New England defensive lineman Chandler Jones said. \"But it was great awareness by our special teams.\"\nIndy (3-3) never recovered.\nNew England has won seven straight over its longtime rival and is 5-0 for the first time since its 16-0 season in 2007.\nWhile Brady wasn't perfect — he threw his first interception of the season — he was pretty darn good again. Brady finished 23-for-37 in the first meeting since January's AFC title game, which ultimately led to allegations of improperly inflated balls, months of investigation and eventually a four-game suspension that was nullified in court.\nHad the suspension been upheld, Brady would have made his season debut in front of a hostile Indianapolis crowd.\nInstead, Colts fans, who booed heartily when Brady first appeared at Lucas Oil Stadium, roared even louder when Indianapolis' Andrew Luck returned after missing two games with an injured right shoulder. Luck was 30-for-50 for 312 yards with three touchdowns and most importantly, no turnovers.\nNew England players didn't care about the crowd or the significance.\n\"I look at it just like any other win,\" Blount said after running for one touchdown and catching the first of his career. \"It feels good no matter who we're playing.\"\nThe game didn't go the way anyone expected, though.\nNew England got away from its strong running game and kept the ball in Brady's hands.\nBut the Colts were more aggressive. They scored a touchdown on the opening series by going for it on fourth-and-1.", "external_links": [], "published": "2015-10-19T03:44:00.000+03:00", "crawled": "2015-10-19T09:43:41.383+03:00", "highlightTitle": ""}