{"organizations": ["NCAA", "AP", "Rutgers"], "uuid": "48881f9a60f97225b54349a69946235ae5e80eb6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mycentraljersey.com", "main_image": "http://www.gannett-cdn.com/-mm-/fbf7391fc4278bd552e6c722f25dd996f0768bb7/c=0-27-512-316&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/18/NJGroup/AsburyPark/635807341018175635-smiles.jpg", "site_section": "http://rssfeeds.mycentraljersey.com/bridgewater/sports", "section_title": "Bridgewater - Sports", "url": "http://www.mycentraljersey.com/story/sports/high-school/football/2015/10/18/coach-borden-analyzes-metuchens-football-win-over-middlesex/74173730/", "country": "US", "title": "Indiana felt 'we got this in the bag' before Rutgers rally", "performance_score": 0, "site": "mycentraljersey.com", "participants_count": 0, "title_full": "Indiana felt 'we got this in the bag' before Rutgers rally", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T16:05:00.000+03:00", "replies_count": 0, "uuid": "48881f9a60f97225b54349a69946235ae5e80eb6"}, "author": "", "url": "http://www.mycentraljersey.com/story/sports/high-school/football/2015/10/18/coach-borden-analyzes-metuchens-football-win-over-middlesex/74173730/", "ord_in_thread": 0, "title": "Indiana felt 'we got this in the bag' before Rutgers rally", "locations": ["Ind.", "Indiana", "Bloomington"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jake Reed", "Doug McSchooler", "Devine Redding", "Ryan Dunleavy"], "text": "Indiana felt 'we got this in the bag' before Rutgers rally Ryan Dunleavy , @rydunleavy 9:05 a.m. EDT October 18, 2015 Indiana running back Devine Redding (34) celebrates with offensive lineman Jake Reed (50) after scoring during the first half of an NCAA college football game against Rutgers, Saturday, Oct. 17, 2015, in Bloomington, Ind. (AP Photo/Doug McSchooler) (Photo: Doug McSchooler, AP) 13 CONNECT 11 TWEET LINKEDIN COMMENT EMAIL MORE \nBLOOMINGTON, Ind. - There probably won't be a lot of smiling around the Indiana football program Sunday. \nNot after there were too many smiles way too soon Saturday night. \nCoach Kevin Wilson and quarterback Nate Sudfeld both admitted that some Indiana players counted out Rutgers in the third quarter after scoring four unanswered touchdowns in a span of 10 minutes to open up a 25-point lead. \nIt wasn't enough of a knockout punch, however, as Rutgers answered back with 28 unanswered points of its own, stealing a 55-52 victory. \n\"I was kind of concerned for a little bit, talking to guys about smiling a little too much because there's a fine line between having swagger and smiling like I want to go make a play, and smiling like we got this in the bag,\" Sudfeld said. \"I think we flirted with that line too much and really went over it.\" Rutgers defense stands tall in comeback win over Indiana \nIndiana can't even blame lack of a warning. \nIn the first half, Indiana led 17-7 and was threatening to pull away when Rutgers ran a fake punt to turn the tide and rally for a 27-24 halftime lead. \n\"You don't want to tell people, 'Hey, wipe the smile off your face,'\" Sudfeld said, \"but there was a lack of focus and kind of a feeling that we had it. So like Coach Wilson said, we got too big for our britches and got exposed at the end.\" \nWilson said Indiana's defense \"got a little vanilla\" and \"just let (Rutgers) off the hook\" in the final 18 minutes. He also criticized the offense for being \"more one-dimensional\" and some play-calling mismanagement, and pointed to some \"special team blunders.\" Chris Laviano, Rutgers QB, quiets critics with comeback win \nIt all added up to a dangerous formula. Or maybe those miscues were the result of dangerous ingredients. \n\"Some things on the sideline I didn't like,\" Wilson said. \"Saw some eyes and attitudes where I think we've got to stay humble and keep playing. We didn't and they did, and congrats to them on a great comeback.\" \nHe added, \"In this day and age of college football, you need to keep playing. You need to keep playing.\" \nSix weeks from now, the game could have a big impact on the Big Ten bowl picture, as Rutgers (3-3, 1-2) and Indiana (4-3, 0-3) both face grueling schedules the rest of the way while trying to reach the six-win eligibility mark. \nRutgers has been to nine bowl games in the last 10 years. Indiana has been to one bowl game since 1993. Leonte Carroo, Rutgers star, 'definitely' playing vs. Ohio St. \n\"Rutgers started making plays,\" Indiana wide receiver Simmie Cobbs Jr. said. \"We made some mental mistakes and gave them more opportunities. Once we gave them the opportunities, they had the momentum. They just took it.\" \nRemarkably, it's the second time in the last eight games that Rutgers has come back from 25 points down to win, including the 2014 regular-season finale against Maryland. \n\"After that one, I didn't think I'd ever see another one,\" coach Kyle Flood said. \"We're certainly not trying to create that situation. To be able to do it again, it starts with having tough-minded people. If you don't have tough-minded people, they never give themselves a chance to make some of those plays.\" \nStaff Writer Ryan Dunleavy: rdunleavy@gannettnj.com 13 CONNECT 11 TWEET LINKEDIN COMMENT EMAIL MORE Read or Share this story: http://on.app.com/1LD029J TOP VIDEOS", "external_links": [], "published": "2015-10-18T16:05:00.000+03:00", "crawled": "2015-10-19T05:16:03.813+03:00", "highlightTitle": ""}