{"organizations": [], "uuid": "4081148437d5c91d73b69a01beb0e6df81ceb7c2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "http://images.tribuneindia.com/cms/gall_content/2015/10/2015_10$largeimg02_Friday_2015_221425627.jpg", "site_section": "http://www.tribuneindia.com/", "section_title": "The Tribune, Chandigarh, India : Latest news, India, Punjab, Chandigarh, Haryana, Himachal, Uttarakhand, J&amp;K, sports, cricket ", "url": "http://www.tribuneindia.com/news/health/story/140722.html", "country": "US", "title": "'Exercise' pills to keep you fit a reality soon", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "'Exercise' pills to keep you fit a reality soon", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "4081148437d5c91d73b69a01beb0e6df81ceb7c2"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/health/story/140722.html", "ord_in_thread": 0, "title": "'Exercise' pills to keep you fit a reality soon", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sydney\nWhat if you could pop an exercise pill daily that mimics the health benefits of running, weight training or endurance exercise to keep you fit and disease-free? It does not seem a far-fetched idea as researchers from the University of Sydney have provided the world's first comprehensive exercise blueprint that may pave the way for drugs that mimic the benefits of exercise in the near future. They exposed 1,000 molecular changes that occur in our muscles when we exercise, opening the door for drug treatments to mirror the health benefits of exercise. \"Exercise is the most powerful therapy for many human diseases, including Type 2 diabetes, cardiovascular disease and neurological disorders,\" said professor David James from the University of Sydney's Charles Perkins Centre. However, for many people, exercise is not a viable treatment option. \"This means it is essential we find ways of developing drugs that mimic the benefits of exercise,\" he added. The team, in collaboration with researchers from the University of Copenhagen in Denmark, analysed human skeletal muscle biopsies from four untrained, healthy males following 10 minutes of high intensity exercise. Using a technique known as mass spectrometry to study a process called protein phosphorylation, they discovered that short, intensive exercise triggers more than 1,000 changes. Most traditional drugs target individual molecules. \"With this exercise blueprint we have proven that any drug that mimics exercise will need to target multiple molecules and possibly even pathways,\" the authors pointed out. The majority of changes they discovered have not previously been associated with exercise, with existing research focusing on just a small number of changes. \"Exercise produces an extremely complex, cascading set of responses within human muscle. It plays an essential role in controlling energy metabolism and insulin sensitivity,\" noted co-author Dr Nolan Hoffman from the Charles Perkins Centre. The researchers have narrowed down the therapeutic possibilities within the blueprint using mathematical and engineering-based analysis. \"This is a major breakthrough, as it allows scientists to use this information to design a drug that mimics the true beneficial changes caused by exercise,\" the team concluded. The research was published in the journal Cell Metabolism. — IANS", "external_links": [], "published": "2015-10-02T03:00:00.000+03:00", "crawled": "2015-10-03T00:28:18.053+03:00", "highlightTitle": ""}