{"organizations": [], "uuid": "179bed72225b97e6267e2112a8e7309ff51824d7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.recordnet.com", "main_image": "http://www.recordnet.com/storyimage/SR/20151009/SPORTS/151009689/AR/0/AR-151009689.jpg", "site_section": "http://www.recordnet.com/sports/pro-sports?template=rss&mime=xml", "section_title": "Pro Sports - recordnet.com", "url": "http://www.recordnet.com/article/20151009/SPORTS/151009689/101020/A_SPORTS?rssfeed=true", "country": "US", "title": "Stockton market, arena enticed Flames", "performance_score": 0, "site": "recordnet.com", "participants_count": 1, "title_full": "Stockton market, arena enticed Flames", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T05:12:00.000+03:00", "replies_count": 0, "uuid": "179bed72225b97e6267e2112a8e7309ff51824d7"}, "author": "Scott Linesburgh Record Staff Writer", "url": "http://www.recordnet.com/article/20151009/SPORTS/151009689/101020/A_SPORTS?rssfeed=true", "ord_in_thread": 0, "title": "Stockton market, arena enticed Flames", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Stockton market, arena enticed Flames Comment Posted Oct. 9, 2015 at 12:01 AM By Scott Linesburgh Posted Oct. 9, 2015 at 12:01 AM » Social News STOCKTON – It took just one trip to Stockton for Brian Burke and the other leaders of the Calgary Flames to realize they had found the new home for their American Hockey League affiliate. The Stockton Heat debuts at 7:30 p.m. Saturday at Stockton Arena against the Rockford IceHogs. It’s the day Stockton becomes a Triple-A sports city and is the result of a plan by several NHL teams in the west to move their AHL teams into the same time zone. The Flames were looking for the perfect spot which they thought would support hockey and had facilities that could be brought up to the NHL and AHL standards. Burke, the Flames’ president of hockey operations, said he was part of a group led by Flames chief executive officer Ken King, who toured Stockton Arena in the fall of 2014 to decide whether to make an offer on the Stockton Thunder of the ECHL and thus buy up the market. And the decision was made before the plan landed back in Calgary. “We came here and looked at Stockton, and as we were flying out of town my boss, Ken King, said, ‘We’re buying this team,’” Burke said. “What struck us was how strong the hockey market was and how good the attendance was.” Heat president Dave Piecuch said the sale moved quickly after the trip by the Calgary officials. “It did move fast after they were here a couple of times. They knew they wanted to be in Stockton,\" Piecuch said. \"They liked the building and they liked the market. And things were more quickly for the other teams involved.\" Calgary bought the Thunder, which had been in Stockton for a decade, and moved it to Glens Falls, N.Y., while bringing the AHL franchise from New York to Stockton. It was all part of a bigger plan to get the AHL on the West Coast. As of the 2014-15 season, there was not an AHL team located west of Texas. And the western NHL organizations were far away from their top affiliates. The Flames’ had their AHL team in upstate New York, the San Jose Sharks’ was in Worcester, Massachusetts, the Los Angeles Kings in Manchester, New Hampshire, the Edmonton Oilers played in Oklahoma City and the Anaheim Ducks were in Norfolk, Virginia. This gave the NHL teams on the East Coast a distinct advantage when it came to the speed and expense of moving players. There had been talk of a western migration for several years, but it was going to take several franchises moving together. In the past two years, the process began seriously, and it was evident the best plan was to move into proven-hockey markets, some of which had ECHL franchises. By the time Calgary bought the Thunder and planned its move, Edmonton owned the Bakersfield Condors and Los Angeles owned the Ontario Reign. Anaheim secured the open market in San Diego, and the Sharks decided to put the new San Jose Barracuda in its building, the SAP Center. These five teams, along with the Texas Stars and San Antonio Rampage, comprise the Pacific Division. The five California teams will play a 68-game schedule, while the Texas franchises play 76, along with the rest of the league. Because of the discrepancy, the standings will be determined by points percentages, not total points. There was plenty of affection among sports fans in the area for the Thunder, who enjoyed a prosperous run and had a loyal fan base. Burke said that fan base is getting a new and improved version of the game. “The ECHL is good hockey. This is better hockey,” Burke said. “There’s higher draft picks and better players. Fans will see that immediately. And they will see a good, exciting brand of hockey.” The Flames invested $250,000 in improvements to the training areas and locker room at Stockton Arena, and vowed the Heat would become a strong member of the community, as the Thunder was before it. Doug Wilhoit, chief executive officer of the Stockton Chamber of Commerce, is impressed by the Heat’s efforts to get involved locally. “So many people were excited for the Thunder, and I think you see the same thing happening with the Heat,” Wilhoit said. “One of the things that has impressed me most is how the Flames are working to get to know the area and get involved in the community. It’s very important to them.” With community ties established and what their coaches feel is a competitive team, the Heat begins the AHL era in Stockton on Saturday. \"We think this is great for our franchise and for the fans here in Stockton,\" Burke said. \"We're excited to get going.\" — Contact reporter Scott Linesburgh at (209) 546-8281 or slinesburgh@recordnet.com. Follow him at recordnet.com/sportsblog By Scott Linesburgh", "external_links": [], "published": "2015-10-09T05:12:00.000+03:00", "crawled": "2015-10-09T21:08:24.416+03:00", "highlightTitle": ""}