{"organizations": [], "uuid": "d56128bbcc5434c5c3d53d8c27b2bb8f4e707e0f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mcall.com", "main_image": "http://www.trbimg.com/img-5610733c/turbine/mc-phillies-2015-report-card-1003-20151003", "site_section": "http://www.mcall.com/sports/rss2.0.xml", "section_title": "Sports - The Morning Call", "url": "http://www.mcall.com/sports/baseball/phillies/mc-phillies-2015-report-card-1003-20151003-story.html", "country": "US", "title": "The grades are in for the 2015 Phillies - they aren't good", "performance_score": 0, "site": "mcall.com", "participants_count": 1, "title_full": "The grades are in for the 2015 Phillies - they aren't good", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T03:27:00.000+03:00", "replies_count": 0, "uuid": "d56128bbcc5434c5c3d53d8c27b2bb8f4e707e0f"}, "author": "Stephen Gross", "url": "http://www.mcall.com/sports/baseball/phillies/mc-phillies-2015-report-card-1003-20151003-story.html", "ord_in_thread": 0, "title": "The grades are in for the 2015 Phillies - they aren't good", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Today is for looking back and grading what was a season that had the lowest winning percentage since 1972. \nOffense: F \nThe Phillies' output offensively this year was comparable to last season and they even hit a few more home runs; but their offense wasn't very good last year either. There were times this year where the offense came out of hibernation, somewhat skewing their run total, which still ranked close to the bottom in all of baseball. Most of the season they didn't produce in the clutch and had a ton of trouble hitting the ball out of the park early on. \nIt also hurt not having many players able to hit for average. Ben Revere did, but he was traded at the end of July, leaving Odubel Herrera as the only regular to hit higher than .277 before this season-ending three-game series with the Marlins. And nobody was able to finish above the .300 mark. \nSure, Maikel Franco staying healthy and his not missing almost two months would have helped in the middle of the lineup, but the team just didn't have enough fire power even with him. Most nights their lineup resembled more of what you'd see in Triple-A than the majors. \nDefense: F \nTheir 114 errors entering the final weekend pretty much sums it up. \nOnly three teams had more in all of baseball. Baseball-Reference also has a stat, \"total zone total fielding runs about average\" which calculates \"the number of runs above or below average the player was worth based on the number of plays made.\" The Phillies had a -58, good for last in the majors. \nAs impressive as Freddy Galvis was defensively at times, he also greatly contributed to the amount of errors. Heading into the final series against Miami, he had 17 errors over 144 games. He had just five in 103 games over his first three years in the league. \nStarting pitching: D \nWhat saves this group from a failing grade is their performance over the last few weeks. Before Alec Asher ended the streak Wednesday, the starters went 10 games in a row allowing two earned runs or less. It was the first time they accomplished that since 1989. \nTheir first half was terrible. They combined for a 5.44 ERA, worst in the majors by almost a half run. The next closest, coming in at 5.00 ERA was the Rockies' starters, who have to deal with that thin, mile-high air in Colorado 81 games a year. Part of the struggles for Philadelphia's starters stemmed from giving up the long ball. During that first half they gave up a major league-high 1.38 home runs per nine innings. That made for some short outings, which put added stress on the … \nBullpen: C \nJonathan Papelbon, who was gone by the time Aug. 1 rolled around, and Ken Giles kept this group from getting a worse mark. Giles followed up his stellar rookie campaign with a 1.59 ERA in 67 appearances before this final series and answered questions of whether he'd be able to step into the closer's role once Papelbon was traded. Papelbon posted the same ERA with the Phillies before heading to Washington and running into some trouble there. \nThe only other positive has been Dalier Hinojosa. Starting the year with the Red Sox organization, he made his Phillies debut July 31 and has given up just two earned runs in his 16 appearances with the team for a 0.79 ERA. \nThere have been some promising flashes here and there but overall, the rest of the relief corps was not nearly as good. Their low point may have been a two-week period in August after Papelbon and Jake Diekman were dealt when the relievers compiled a 5.64 ERA after posting a 3.61 ERA in July. \nJustin De Fratus has posted a career-high 5.61 ERA, Adam Loewen has not had his Triple-A success translate to the majors and no other relief pitcher for the Phillies this season was able to post a sub-3.00 ERA. \nBench: B \nAndres Blanco has impressed manager Pete Mackanin and has really been solid when he receives playing time, whether it's pinch hitting, as a late defensive replacement or spot starts. His .293 average entering this weekend was the highest on the team among position players, starters or off the bench. \nEven though Darin Ruf has had a starting role since Sept. 15, he's included here. He's been a terror against left-handed pitching — his 1.122 on-base plus slugging percentage against lefties led the majors Thursday — and with consistent playing time, he's begun hitting righties as well. \nManager: F/A \nI have to give out two grades here. The F goes to Ryne Sandberg. His lack of communication and loss of the clubhouse was evident. Add that to his in-game management struggles and it's tough to put any positive spin on the job he did before his June 26th resignation. \nOn the other hand, Pete Mackanin has done about as good a job as you can expect with the hand he's been dealt. MacPhail must agree, or he wouldn't have removed the interim label, extending Mackanin through next year with an option for 2017. Taking over a team with little talent and leading them on a major league-best 12-2 run like he did out of the All-Star Break was unbelievable and his communication can't go unnoticed. The players love him, he's been able to handle each situation he's been faced with so far, but he's also not afraid to tell it like it is. There's no reason to believe he won't be able to get the most out of what he's given again next year.", "external_links": [], "published": "2015-10-04T03:27:00.000+03:00", "crawled": "2015-10-04T03:56:42.077+03:00", "highlightTitle": ""}