{"organizations": [], "uuid": "0243de94b2a58a06376a3aec471f2ed0703f1687", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.arcamax.com", "main_image": "http://www.arcamax.com/apple-touch-icon.png", "site_section": "http://www.arcamax.com/sports/", "section_title": "Sports | ArcaMax Publishing", "url": "http://www.arcamax.com/sports/olympics/s-1732621?fs", "country": "US", "title": "Mexico defeats Haiti, 1-0, nears Olympic berth | Olympics", "performance_score": 0, "site": "arcamax.com", "participants_count": 1, "title_full": "Mexico defeats Haiti, 1-0, nears Olympic berth | Olympics | ArcaMax Publishing", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "0243de94b2a58a06376a3aec471f2ed0703f1687"}, "author": "arcamax.com", "url": "http://www.arcamax.com/sports/olympics/s-1732621?fs", "ord_in_thread": 0, "title": "Mexico defeats Haiti, 1-0, nears Olympic berth | Olympics", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CARSON, Calif. -- Defending Olympic champion Mexico is just a win away from a chance at defending its soccer title next summer in Rio de Janeiro after a second-half penalty shot by Raul Lopez beat Haiti, 1-0, in group play of the CONCACAF qualifying tournament Sunday at the StubHub Center.\nWith the win, Mexico joined the U.S. and Honduras in securing a spot in the tournament's final four. The U.S. advanced out of Group A with a win Saturday, and Honduras earned its spot by beating Costa Rica, 2-0, in the opener of Sunday's Group B doubleheader.\nCanada can grab the final spot with a victory over winless Cuba in its final group-play game Tuesday. That would also move the Canadians within a victory of an Olympic berth, since the winners of Saturday's semifinals in Salt Lake City earn automatic invitations to next year's Summer Games.\nMexico, which won its first soccer gold medal three years ago, hasn't played in consecutive Summer Games in two decades. And its reemergence as the region's dominant nation in age-group competitions -- in addition to winning gold in London, the country has won two under-17 world championships and reached the semifinals of a U-20 World Cup since 2005 -- didn't happen by chance.\nBefore the last Olympics, Mexico's domestic league, the Liga MX, scratched a 4-year-old rule requiring teams to reserve more than 1,000 minutes of playing time for players under 21 and adopted an even broader approach to youth development by forcing its teams to fund complete squads in U-17 and U-20 competitions.\nThat investment paid dividends again Sunday.\nFor the first 72 minutes defense-minded Haiti appeared content to keep as many as 10 men behind the ball, failing even to take a shot in the first half. But that tight-marking strategy backfired when defender Severe Verilus was called for a penalty after tripping Erick Gutierrez -- a product of Pachuca's youth program -- on the edge of the 18-yard box.\nLopez, a graduate of the U-17 team at Chivas of Guadalajara, made good on the chance, sending a low shot under Haitian keeper Luis Odelus.\n\"The game went just as we had planned,\" Mexican Coach Raul Gutierrez said in Spanish. \"Our goal was to win the game. And we're happy with the three points.\"\nHonduras, meanwhile, got goals in the final 10 minutes of each half to beat winless Costa Rica. Antony Lozano started the scoring in the 41st minute, deflecting a shot off defender Julio Cascante and around Costa Rican keeper Darryl Parker.\nAlberth Elis got the other score in the 81st minute, shortly after Costa Rica's Luis Sequeira was ejected for drawing two yellow cards in a two-minute span.\nHonduras will close group play against Mexico on Wednesday in suburban Denver in a game determining little more than seeding for the knockout round.\n(c)2015 Los Angeles Times\nVisit the Los Angeles Times at www.latimes.com\nDistributed by Tribune Content Agency, LLC.\nShare Comment", "external_links": ["http://twitter.com/share?url=http://www.arcamax.com/sports/olympics/s-1732621&hashtags=ArcaMax", "http://www.facebook.com/sharer.php?u=http://www.arcamax.com/sports/olympics/s-1732621&h=Mexico+defeats+Haiti%2C+1%2D0%2C+nears+Olympic+berth", "https://plus.google.com/share?url=http://www.arcamax.com/sports/olympics/s-1732621"], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-05T19:09:51.660+03:00", "highlightTitle": ""}