{"organizations": [], "uuid": "91cb84fdfc1b8e3e3868cb29a1029b0cf969b6e6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "", "site_section": "http://www.tribuneindia.com/", "section_title": "The Tribune, Chandigarh, India : Latest news, India, Punjab, Chandigarh, Haryana, Himachal, Uttarakhand, J&amp;K, sports, cricket ", "url": "http://www.tribuneindia.com/news/nation/corbusier-and-after-a-city-defined-by-half/144542.html", "country": "US", "title": "Corbusier and after: A city defined by half", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "Corbusier and after: A city defined by half", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T03:00:00.000+03:00", "replies_count": 0, "uuid": "91cb84fdfc1b8e3e3868cb29a1029b0cf969b6e6"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/nation/corbusier-and-after-a-city-defined-by-half/144542.html", "ord_in_thread": 0, "title": "Corbusier and after: A city defined by half", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Amarjot Kaur\nTribune News Service\nChandigarh, October 10\nHow do you raise the bar from where Le Corbusier left? His city-idea, its quintessential ‘zeitgeist’ — the spirit of its fledgling years — and its aspirations for a full-fledged city-hood thriving in most aspects of aesthetics and discipline offered a challenging task. Ask the experts: where does Corbusier’s Chandigarh belong? Renowned architects, historians and designers congregated at the city’s Tagore Theatre today as a part of the four-day international symposium to celebrate the Corbusier cause and telling effect, 50 years after his death. At hand were historian William JR Curtis, French modernist architect Jacques Sbriglio, architect Raj Rewal and BV Doshi, who sent his video presentation. While sharing the master craftsman’s monochrome pictures that he clicked at the Secretariat and The Capitol Complex, Doshi said: “Working with Corbusier, I realized that he was always willing to add to his buildings, like any artist would. He was always willing to adapt. In fact, he would often juxtapose the physical aspect of his buildings with people’s behaviours with relevance to human psychology, which translates into the functional aspect of his buildings,” he says. However, Doshi, while talking about the Capitol Complex and its detachment from the public says in his understanding, Corbusier wanted the space at the complex to be detached from public, for it is where important judicial decisions are to be made. “How can one be possibly attached and make critical decisions?” he questioned. “Nevertheless, it is a public space and I feel that it should be made available to the people,” he hastened to add. Raj Rewal, best known for designing Asian Games Village, debates over Corbusier’s use of concrete as a skin. But he applauds his tendency to fuse poetic elements with spiritual elements of the facades he designed. “Though Corbusier seems to be influenced by the Mediterranean architecture, most of his buildings remind one of European Cathedrals. Of course, they don’t look exactly physically similar, but the meditative aspect seems to be highlighted in the play of lights,” he says. Rewal said he sought inspiration from Corbusier’s designs that are quite evident in his body of work. “He was playful and sublime, yet he had a different vocabulary of his own. While most Indian architects take to aping western designs I strongly feel that there is a need to understand the evolution of change in our nation’s traditions and culture, thereby establishing a language of architecture that one can call their own,” he said.", "external_links": [], "published": "2015-10-11T03:00:00.000+03:00", "crawled": "2015-10-11T08:39:13.448+03:00", "highlightTitle": ""}