{"organizations": [], "uuid": "3ab0e801e09245bdd6c8822714d62bc36eb7e487", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports/golf", "section_title": "Golf News, Leaderboard, Schedule, Photos, Videos - MSN Sports", "url": "http://www.msn.com/en-us/sports/golf/5-to-watch-at-the-2015-shriners-hospitals-for-children-open/ar-BBmhPzH", "country": "US", "title": "5 to watch at the 2015 Shriners Hospitals for Children Open", "performance_score": 0, "site": "msn.com", "participants_count": 1, "title_full": "5 to watch at the 2015 Shriners Hospitals for Children Open", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "3ab0e801e09245bdd6c8822714d62bc36eb7e487"}, "author": "T.J. Auclair", "url": "http://www.msn.com/en-us/sports/golf/5-to-watch-at-the-2015-shriners-hospitals-for-children-open/ar-BBmhPzH", "ord_in_thread": 0, "title": "5 to watch at the 2015 Shriners Hospitals for Children Open", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "5 to watch at the 2015 Shriners Hospitals for Children Open PGA 1 day ago T.J. Auclair © Ross Kinnaird/Getty Images Rickie Fowler reacts after making a birdie putt on the 14th green during the final round of the Deutsche Bank Championship at TPC Boston on September 7, 2015 in Norton, Mass. The PGA Tour is just outside Las Vegas this week for the Shriners Hospitals for Children Open at TPC Summerlin.\nAdChoices It's the second event of the 2015-16 PGA Tour season and there are plenty of big names teeing it up.\nRELATED: Shriners Open tee times | Weekly schedule | 'Back to the Future' cart\nAn early-season event? Yes, but it can also be a tone-setter for a lot of players. Here's a look at the five players you'll want to keep a close eye on.\n5. Ryan Moore\nBest finish in 2015-16 season: T10 at Frys.com Open\nReason to watch: Though he missed the cut in Vegas a year ago, Moore counts the tournament as one of his four PGA Tour victories, having won in 2012. He also comes into this week on the strength of a T10 in the season-opener a week ago. I'm expecting a strong push to make the U.S. Ryder Cup team by Moore -- a former U.S. Amateur champion and two-time U.S. Publinks champ -- this season, having come up just short a couple of times.\n4. Kevin Na\nBest finish in 2015-16 season: Second at Frys.com Open\nReason to watch: A driver off the deck in a playoff last weke at the Frys.com Open may have cost Na his second PGA Tour title. How will it impact him this week? Is he over it like he said he is? We'll find out over the next several days, but one thing is for sure -- there's no better place for Na to have a bounce-back than at the site of his only PGA Tour win in 2011. That's what he's facing this week.\n3. Brooks Koepka\nBest finish in 2015-16 season: T41 at Frys.com Open\nReason to watch: Do you realize Koepka is the 12th-ranked player in the world? That puts him ahead of the likes of Matt Kuchar, Adam Scott. Louis Oosthuizen, Martin Kaymer and Phil Mickelson to name a few. Koepka will be looking to add to his PGA Tour win total this season and Vegas -- where he finished T4 a year ago -- might be just the place to start.\n2. Jimmy Walker\nBest finish in 2015-16 season: Debut\nReason to watch: Though he has cooled off as of late, Walker has established himself as one of the most rock solid players on the PGA Tour over the last two seasons. At this time two years ago he had just picked up his first PGA Tour win. Now he has five total, as well as several close calls. With a T4 in Vegas last year, it's certainly a course that Walker enjoys.\n1. Rickie Fowler\nBest finish in 2015-16 season: Debut\nReason to watch: Fowler has been a star since he turned professional. Over the last two seasons, however, he's become a legitimate superstar -- someone who you expect to contend each and every time he tees it up. This will be Fowler's first start of the new season -- one in which you can be sure the Ryder Cup and winning a major championship are on the front of the mind.\nHere's how my five to watch fared at last week's Frys.com Open :\n5. Tony Finau -- T32\n4. Brandt Snedeker -- T17\n3. Justin Rose -- T6\n2. Steven Bowditch -- Missed cut\n1. Rory McIlroy -- T26\nGo to MSN Home", "external_links": ["http://www.pga.com/news/golf-leaderboard/pga-tour-leaderboard", "http://www.pga.com/news/golf-buzz/2015-fryscom-open-five-players-watch", "http://www.pga.com/news/golf-buzz/canadian-custom-car-builder-creates-back-future-golf-cart", "http://go.microsoft.com/fwlink/?LinkID=286759", "http://www.pga.com/news/pga-tour/weeks-pro-golf-events-oct-22-25-2015"], "published": "2015-10-21T03:00:00.000+03:00", "crawled": "2015-10-22T19:44:39.085+03:00", "highlightTitle": ""}