{"organizations": [], "uuid": "4c96f2c9d9efe089556974d546b4f9071d3b0d2d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.lohud.com", "main_image": "http://www.gannett-cdn.com/-mm-/31ae4e300504f07c308bdb28dcc25fd0489f331c/c=0-0-4091-2311&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/10/21/USATODAY/USATODAY/635809900778700691-USATSI-8873170.jpg", "site_section": "http://rssfeeds.lohud.com/westchester/sports", "section_title": "West Chester - Sports", "url": "http://www.lohud.com/picture-gallery/sports/high-school/tennis/2015/10/21/day-2-of-section-1-tennis-championships/74360450/", "country": "US", "title": "David Wright: Mets won't 'look past' Game 4", "performance_score": 0, "site": "lohud.com", "participants_count": 0, "title_full": "David Wright: Mets won't 'look past' Game 4", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T15:42:00.000+03:00", "replies_count": 0, "uuid": "4c96f2c9d9efe089556974d546b4f9071d3b0d2d"}, "author": "", "url": "http://www.lohud.com/picture-gallery/sports/high-school/tennis/2015/10/21/day-2-of-section-1-tennis-championships/74360450/", "ord_in_thread": 0, "title": "David Wright: Mets won't 'look past' Game 4", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Facebook Email Twitter Google+ LinkedIn Pinterest David Wright: Mets won't 'look past' Game 4 The Mets at the doorstep of their first trip to the World Series since 2000. The last time they won it was 1986. Post to Facebook David Wright: Mets won't 'look past' Game 4 The Mets at the doorstep of their first trip to the World Series since 2000. The last time they won it was 1986. Check out this story on USATODAY.com: http://usat.ly/1RVgseB Cancel Send A link has been sent to your friend's email address. Posted! A link has been posted to your Facebook feed. 3 To find out more about Facebook commenting please read the Conversation Guidelines and FAQs David Wright: Mets won't 'look past' Game 4 Jorge L. Ortiz , USA TODAY Sports 8:42 a.m. EDT October 21, 2015 David Wright and the Mets are one win away from a World Series berth. (Photo: Jerry Lai, USA TODAY Sports) 15 CONNECT 11 TWEET LINKEDIN 3 COMMENT EMAIL MORE \nCHICAGO – The cramped visitors clubhouse in Wrigley Field contained all the excitement of a funeral parlor late Tuesday night. \nA handful of New York Mets players ate and chatted in low tones. Others checked their cell phone messages in silence. Postseason hitting terror Daniel Murphy, wearing sweat pants and a relaxed look, rubbed in some lip balm as he walked by. \nBy Wednesday, those same tight quarters may be inundated with champagne and a bunch of grown men acting like jubilant second-graders, but not after taking a 3-0 lead in the National League Championship Series with a methodical 5-2 victory over the Chicago Cubs. Nightengale: Cubs add another grim chapter to century of October failure \nBaseball protocol must be observed, of course. But also, the Mets have been succeeding in the playoffs in workmanlike fashion, so there’s no reason to change just because they’re a mere win from the World Series. \nTuesday’s victory showed the Mets at their efficient best. Their starting pitcher, this time Jacob deGrom, stifled the opponents’ hitters. The bullpen wouldn’t even let them come up for air. The offense took advantage of whatever opening was available to score runs. And the Mets unleashed the remarkable Murphy on the world again. \nThe result put the Mets at the doorstep of their first trip to the World Series since 2000. The last time they won it was 1986. Mets pitching continues its relentless postseason dominance \n“That’s what we have going on right now,’’ reliever Tyler Clippard said of the team-wide effort after throwing a scoreless eighth. “Everybody’s contributing and doing the little things right, getting those little runs you need to win postseason games. Right now the momentum is on our side. We have to keep it that way heading into tomorrow.’’ \nThe go-ahead run in the sixth scored on one of those plays that seem to suggest the Mets have karma, momentum and good fortune all going for them. \nWith two outs and Yoenis Cespedes at third in a 2-2 game, reliever Trevor Cahill kept throwing Michael Conforto curveballs in the dirt trying to get him to chase for strike three. Conforto finally did, but the ball bounced away for a wild pitch, allowing Cespedes to score and Conforto to reach base. \nIt was the second time in postseason history the go-ahead run scored on a strikeout. \n“I blocked like three before that,’’ Cubs catcher Miguel Montero said. “It was a tough one. It really hurts. I’ve blocked pitches like that many times and I didn’t block that. It really hurts because it was strike three.’’ \nThe Mets had scored their first two runs on a double by Cespedes, who has now hit safely in 15 of his 18 career playoff games, and of course, a home run by Murphy, who put them ahead 2-1 in the fourth. They scored two insurance runs in the seventh with help from third baseman Kris Bryant’s inability to throw Murphy out on a slow chopper that went for a single. \nThe second baseman became the second player in postseason history to homer in five consecutive games. Carlos Beltran first did it with the Houston Astros in 2004. Murphy’s six home runs altogether this postseason, four coming off Cy Young Award-caliber pitchers, set a Mets record. Mets' Daniel Murphy ties postseason home run record \n“I wish I could explain it; I would have done it like six years ago,’’ said Murphy, who hit a career-high 14 homers in the regular season. “This is just a lot of fun right now. Again, like I said, in between David (Wright) and Yoenis Cespedes right now I think is the best place to be (in the lineup).’’ \nThe Cubs nicked deGrom for solo homers in the first and fourth, the second tying the game 2-2. But much like he did in Game 5 of the Division Series, deGrom battled through a tough first inning, when he threw 29 pitches, then found the command of his fastball that eluded him early on. Once the heater started working, he became untouchable, retiring hid final 11 batters through seven innings. Clippard and closer Jeurys Familia took care of the rest. \nDeGrom is the first Mets pitcher ever to win his first three postseason starts, and all have been on the road. But in a stunning indication of how overwhelming New York’s pitching has been – and what may await the American League entry in the World Series – his seven innings of two-run ball rank as the team’s third-best start in this series based on ERA. Chicago has scored a total of five runs. \n“He’s done that a couple of times throughout the year where he didn’t have his best stuff right away but he found it as the game went on,’’ catcher Travis d’Arnaud said. “Nobody was panicking. We all believed in him.’’ \nNow, if there are still doubters out there, it may be time to start believing the Mets have all the elements of a World Series team. Well, except for any obvious swagger. \nThat may come with one more win. \n“You can't look past tomorrow,’’ Wright said. “You have to continue to put your foot on the gas and try to play good baseball and take advantage of the type of baseball that we're playing and the type of pitching that we're getting.’’ \nIf they do, the visitors clubhouse may have a distinctly different feel on Wednesday. \nGALLERY: TOP MOMENTS IN THE POSTSEASON Posted! A link has been posted to your Facebook feed. NLCS Game 4: Cubs vs. Mets - Daniel Murphy homers for the sixth consecutive game - breaking a record he shared with Carlos Beltran - in the eighth inning. Jerry Lai, USA TODAY Sports NLCS Game 4: Cubs vs. Mets - Lucas Duda quiets the fans with a three-run home run off Jason Hammel in the first inning. Dennis Wierzbicki, USA TODAY Sports Fullscreen ALCS Game: Blue Jays vs. Royals - Blue Jays starter Marco Estrada faces one batter more than the minimum through 7 2/3 innings, at which point he allows a solo homer and a single — only the second and third hits he’d allow all game. He earns the win. John E. Sokolowski, USA TODAY Sports ALCS Game 5: Blue Jays vs. Royals - Troy Tulowitzki breaks the game open with a three-run double in the sixth inning. Matt Slocum, AP NLCS Game 3: Cubs vs. Mets - Mets' Daniel Murphy and Carlos Beltran (Astros 2004) are the only players to homer in five straight postseason games. Dennis Wierzbicki, USA TODAY Sports NLCS Game 3: Cubs vs. Mets -Cubs rookie Kyle Schwarber hits his fifth homer of the playoffs in the first inning, breaking the franchise record for a single postseason. Caylor Arnold, USA TODAY Sports ALCS Game 4: Blue Jays vs. Royals - Ben Zobrist hits a two-run home run off R.A. Dickey to give the Royals a 2-0 lead. Tom Szczerbowski, Getty Images ALCS Game 3: Blue Jays vs. Royals - Josh Donaldson adds a two-run homer in the third inning to give the Blue Jays a 9-2 lead. Peter Llewellyn, USA TODAY Sports ALCS Game 3: Blue Jays vs. Royals - Troy Tulowitzki crushes a three-run home run to give the Blue Jays a 6-2 lead in the third inning. Dan Hamilton, USA TODAY Sports NLCS Game 2: Mets vs. Cubs - Mets right fielder Curtis Granderson robs Chris Coghlan of a home run in the second inning. Anthony Gruppuso, USA TODAY Sports NLCS, Game 2: Mets vs. Cubs - Daniel Murphy hits a two-run home run in the first inning. He has now hit homers of Jake Arrieta, Clayton Kershaw, Zack Greinke and Jon Lester in the postseason. Robert Deutsch, USA TODAY Sports NLCS Game 1: Cubs vs. Mets - Matt Harvey strikes out 9 over 7 2/3 inning to earn the victory. Robert Deutsch, USA TODAY Sports NLCS Game 1: Cubs vs. Mets - Travis d'Arnaud crushes a ball that hits the Big Apple in behind the center field wall. Mike Stobe, Getty Images NLCS Game 1: Cubs vs. Mets - Daniel Murphy hits a solo home run off Jon Lester that gives the Mets a 1-0 lead in the first inning. Robert Deutsch, USA TODAY Sports ALCS Game 2: Blue Jays vs. Royals - Alex Gordon drives in the go-ahead run on a double in the seventh inning. Nathan Denette, AP ALCS Game 2: Blue Jays vs. Royals: Leading 3-0 in the seventh, Blue Jays starter David Price coughs up five earned runs to the Royals. Denny Medley, USA TODAY Sports ALCS Game 2: Blue Jays vs. Royals - A Ben Zobrist soft fly ball lands in between right fielder Jose Bautista and second baseman Ryan Goins in the outfield during the seventh inning. It starts a Royals five-run rally. John Rieger, USA TODAY Sports ALCS Game 1: Royals vs. Blue Jays - SS Troy Tulowitzki turns a huge inning-ending double play with 2B Ryan Goins to save a run in the sixth. Peter Aiken, USA TODAY Sports ALCS Game 1: Royals vs. Blue Jays - Royals starter Edinson Volquez stifles Blue Jays hitters over six innings and allows just two hits. Peter Aiken, USA TODAY Sports NLDS Game 5: Mets vs. Dodgers - Daniel Murphy blasts a solo home run in the sixth inning to give the Mets a 3-2 lead. Richard Mackson, USA TODAY Sports ALDS Game 5: Astros vs. Royals - Johnny Cueto retires the last 19 batters he faces in Game 5 as the Royals advance to the ALCS. Denny Medley, USA TODAY Sports ALDS Game 5: Astros vs. Royals - Alex Rios hits a two-run double in the fifth inning to give the Royals a 4-2 lead. John Rieger, USA TODAY Sports ALDS Game 5: Astros vs. Royals - Lorenzo Cain scores from first on a Eric Hosmer single to center in the fourth inning. Peter Aiken, USA TODAY Sports ALDS Game 5: Rangers vs. Blue Jays - Jose Bautista gives the Blue Jays a 6-3 lead in the seventh inning with a three-run home run. Nick Turchiaro, USA TODAY Sports Fullscreen ALDS Game 5: Rangers vs. Blue Jays - Home plate umpire Dale Scott signals for Rangers' Rougned Odor to score after conferring with the base umpires to confirm an error by Blue Jays catcher Russell Martin on a play in the seventh inning. Martin's toss back to Aaron Sanchez hits Sin-Shoo Choo's bat and Odor scores from third base. Frank Gunn, AP ALDS Game 5: Rangers vs. Rangers: Edwin Encarnacion ties the game 2-2 with a home run in the sixth inning. Tom Szczerbowski, Getty Images ALDS Game 5: Rangers vs. Blue Jays - Center fielder Kevin Pillar makes a diving catch to rob Josh Hamilton of a hit in the fourth inning. Dan Hamilton, USA TODAY Sports ALDS Game 5: Rangers vs. Blue Jays - Pillar shows the ball in front of teammate Ben Revere. Tom Szczerbowski, Getty Images NLDS Game 4: Dodgers vs. Mets - Pitching on only three days’ rest for the third time in his career, Clayton Kershaw allows just three hits over seven innings and strikes out eight in the process. Brad Penner, USA TODAY Sports NLDS Game 4: Cubs vs. Cardinals - Kyle Schwarber crushes his third homer of the series -- this one lands atop the RF video board. David Banks, Getty Images NLDS, Game 4: Cubs vs. Cardinals - Anthony Rizzo hits a solo home run in the sixth inning to give the Cubs a 5-4 lead in the elimination game. Jerry Lai, USA TODAY Sports NLDS Game 4: Cubs vs. Cardinals - Cubs' Javier Baez rounds the bases after a three-run home run in the second inning. Jerry Lai, USA TODAY Sports NLDS Game 3: Mets vs. Dodgers - Yoenis Cespedes hits a moonshot 440 feet to give the Mets a 10-3 lead. Andy Marlin, USA TODAY Sports NLDS Game 3: Mets vs. Dodgers - After suffering a season-ending injury in Game 2, Ruben Tejada takes the field for player introductions to a standing ovation at Citi Field. Anthony Gruppuso, USA TODAY Sports Fullscreen NLDS Game 3: Cubs vs. Cardinals - The Cubs become the first team in baseball history to have four players under the age of 27 with homers in a postseason game. They have five. They are - Kyle Schwarber, who hits a solo home run in the second inning. Jerry Lai, USA TODAY Sports NLDS Game 3: Cubs vs. Cardinals - Starlin Castro hits a homer in the fourth inning. Jerry Lai, USA TODAY Sports NLDS Game 3: Cubs vs. Cardinals - Kris Bryant hits a two-run home run in the fifth inning. Jerry Lai, USA TODAY Sports NLDS Game 3: Cubs vs. Cardinals - Anthony Rizzo hits a homer in the fifth inning. Jerry Lai, USA TODAY Sports NLDS Game 3: Cubs vs. Cardinals - Jorge Soler's hits a two-run homer in the sixth inning. Jerry Lai, USA TODAY Sports NLDS Game 3: Cubs vs. Cardinals - Dexter Fowler hits a homer in the eighth inning. Dennis Wierzbicki, USA TODAY Sports ALDS Game 4: Rangers vs. Blue Jays: Josh Donaldson hits a towering two-run home run in the first inning to give the Jays the lead. Tim Heitman, USA TODAY Sports ALDS Game 4: Astros vs. Royals - The Royals stroke five consecutive singles to spark a five-run rally in the eighth-inning, wiping out a four-run deficit. Thomas Shea, USA TODAY Sports ALDS Game 4: Astros vs. Royals - The Astros dugout can't bear to watch as the Royals score five runs in the eighth inning. Thomas Shea, USA TODAY Sports ALDS Game 4: Astros vs. Royals - Astros' Carlos Correa blasts his second home run -- a two-run homer to give the Astros a 5-2 lead in the 7th inning. Thomas Shea, USA TODAY Sports ALDS, Game 3: Blue Jays vs. Rangers: Troy Tulowitzki smashes a three-run home run in the 6th inning to give the Blue Jays a 5-0 lead. Tim Heitman, USA TODAY Sports ALDS Game 3: Astros vs. Royals -- After setting a record for most wins by pitcher who went unbeaten at home in a season, Astros ace Dallas Keuchel improves on his 15-0 ledger at Minute Maid Park this year. Thomas Shea, USA TODAY Sports NLDS Game 2: Mets vs. Dodgers -- SS Ruben Tejada collides with Chase Utley at second base in the seventh inning. Jayne Kamin-Oncea, USA TODAY Sports NLDS Game 2: Mets vs. Dodgers - Rookie Michael Conforto hits a laser off Zack Greinke for a home run that had an exit velocity of 115 mph. Jayne Kamin-Oncea, USA TODAY Sports NLDS Game 2: Cubs vs. Cardinals. Cubs shortstop Addison Russell squares for a suicide squeeze in the second inning -- the second of the inning. Jeff Curry, \\USA TODAY Sports NLDS Game 2: Cubs vs. Cardinals - Matt Carpenter leads off the game with s solo home run. Jasen Vinlove, USA TODAY Sports NLDS Game 1: Mets vs. Dodgers - David Wright's two-run single in the 7th inning gives the Mets a 3-0 lead. Richard Mackson, USA TODAY Sports NLDS Game 1: Mets vs. Dodgers - Jacob deGrom strikes out 13 batters, which ties Tom Seaver for most strikeouts by a Mets pitcher in postseason history. Jayne Kamin-Oncea, USA TODAY Sports NLDS Game 1: Cubs vs. Cardinals - Cardinals rookie Tommy Pham, a career minor leaguer, homers in his first postseason game, 431 feet. Scott Rovak, USA TODAY Sports NLDS Game 1: Cubs vs. Cardinals - John Lackey, who took a no-hitter into the six inning, allows just two hits over 7 1/3 innings. Scott Rovak, USA TODAY Sports ALDS Game 2: Astros vs. Royals - Astros' Colby Rasmus hits a home run against the Royals -- his third homer in three straight postseason games. Peter Aiken, USA TODAY Sports ALDS Game 2: Rangers vs. Blue Jays - Blue Jays slugger Josh Donaldson get into a shouting match with Rangers reliever Keone Kela in the 13th inning, causing the benches and benches to briefly empty. Nick Turchiaro, USA TODAY Sports ALDS Game 2: Rangers vs. Blue Jays - Hansel Alberto, not pictured, lines a 14th-inning, game-winning single to center, plating Rougned Odor, pictured, as the Rangers take a 2-0 series lead over the Blue Jays. . Nick Turchiaro, USA TODAY Sports ALDS Game 2: Rangers vs. Blue Jays - Rougned Odor makes an elusive slide past the tag of Blue Jays catcher Russell Martin in the second inning to give the Rangers a 3-1 lead. Dan Hamilton, USA TODAY Sports ALDS Game 1: Astros vs. Royals - Center fielder Jake Marisnick makes a diving catch in the fifth inning to rob Royals' Elcides Escobar. John Rieger, USA TODAY Sports ALDS Game 1: Rangers vs. Blue Jays - Rougned Odor (right) celebrates with Delino DeShields after hitting a solo home run in the 7th inning to give the Rangers a deciding 5-3 lead. Nick Turchiaro, USA TODAY Sports NL wild-card game: The Cubs celebrate their first postseason win since the 2003 NLCS after defeating the Pirates 4-0. Charles LeClaire, USA TODAY Sports NL wild-card game: Jake Arrieta becomes the first Cubs pitcher to throw a postseason shutout in 70 years, leading the Cubs to a 4-0 victory. Charles LeClaire, USA TODAY Sports NL wild-card game: Cubs rookie Kyle Schwarber rounds the bases after hitting a majestic 450-foot two-run homer that landed in the Allegheny River in the third inning off Pirates' Gerrit Cole. Charles LeClaire, USA TODAY Sports Fullscreen NL wild-card game: Cubs starter Jake Arrieta reacts after he was hit by a pitch by Pirates' Tony Watson in the seventh inning. \"It’s the playoffs.There’s a lot at stake. Tempers are running hot. It’s just the environment. It breeds that kind of intensity, and sometimes those things happen.\" Charles LeClaire, USA TODAY Sports AL wild-card game: On three days rest, Dallas Keuchel hurls six shutout innings of three-hit, seven-strikeout ball in Houston’s 3-0 victory over the Yankees. Adam Hunger, USA TODAY Sports Fullscreen AL wild-card game: Astros outfielder Carlos Gomez hits a home run on the first pitch of the fourth inning off Yankees' Masahiro Tanaka that sails deep into the left field stands, silencing the capacity crowd. Appropriately, Gomez flips his bat and admires it. Adam Hunger, USA TODAY Sports Like this topic? You may also like these photo galleries: Replay", "external_links": [], "published": "2015-10-21T15:42:00.000+03:00", "crawled": "2015-10-23T00:39:24.005+03:00", "highlightTitle": ""}