{"organizations": [], "uuid": "8b3d1dc7d1e4bfd0b13864d342ed470308085e70", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "http://images.tribuneindia.com/cms/gall_content/2015/10/2015_10$largeimg20_Tuesday_2015_003551905.jpg", "site_section": "http://www.tribuneindia.com/", "section_title": "The Tribune, Chandigarh, India : Latest news, India, Punjab, Chandigarh, Haryana, Himachal, Uttarakhand, J&amp;K, sports, cricket ", "url": "http://www.tribuneindia.com/news/himachal/women-up-in-arms-against-ngt-ban-on-rohtang/148218.html", "country": "US", "title": "Women up in arms against NGT ban on Rohtang", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "Women up in arms against NGT ban on Rohtang", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "8b3d1dc7d1e4bfd0b13864d342ed470308085e70"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/himachal/women-up-in-arms-against-ngt-ban-on-rohtang/148218.html", "ord_in_thread": 0, "title": "Women up in arms against NGT ban on Rohtang", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tribune News Service\nKullu, October 19\nA large number of women affected by the ban on commercial activities at Rohtang Pass staged a dharna outside the office of the Deputy Commissioner here today. The National Green Tribunal (NGT) had imposed a ban on all commercial activities at Rohtang Pass, Solang Nallah, Marhi and other surrounding places to protect the fragile environment of the area. Under the banner of the Aam Aadmi Party (AAP), women beating plates with spoons demanded the revival of commercial activities at the tourist destinations. They took out a protest march from the bus stand up to the DC office and staged a dharna outside the office. They also submitted a memorandum to the Governor through the Deputy Commissioner. The protesters were led by state AAP observer Neha Tyagi and party coordinator at Manali Dinesh Sharma. Sharma said nearly 600 women took part in the protest. They also demanded resettlement if the government failed to revive the commercial activities at Rohtang Pass. The protesters said with the closure of commercial activities, they had lost their source of income and their survival had become tough. Thousands of people have lost their livelihood after the NGT imposed a ban on commercial activities, including, horse riding, snow-biking, paragliding, tyre-tube gaming, snow scooters, skiing, bungi-jumping, traditional and snow dresses, etc at Rohtang, Solang and Marhi in upper Manali region of Kullu district. Nearly 90 per cent of the population of nine villages, including Burwa, Palchan, Kulang, Ruar, Solang, Solang Nullah, Kothi, New Kothi and Machach located in the upper Manali region, were solely dependent on commercial activities. With the ban, the residents of these villages had been rendered jobless and face an uncertain future as most of them were illiterate. The NGT had also restricted the number of vehicles going the Rohtang Pass for tourism purpose to 1,000 per day, including 600 petrol and 400 diesel, per day.", "external_links": [], "published": "2015-10-20T03:00:00.000+03:00", "crawled": "2015-10-20T10:15:22.347+03:00", "highlightTitle": ""}