{"organizations": [], "uuid": "125ec2878e567eb4e60e80ccf0741011e3e5bb06", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kctv5.com", "main_image": "http://kctv.images.worldnow.com/images/9094185_G.jpg", "site_section": "http://kctv5.com/category/208603/sports?clienttype=rss", "section_title": "KCTV Kansas City - Sports", "url": "http://www.kctv5.com/story/30342294/undefeated-oklahoma-state-overpowers-winless-jayhawks", "country": "US", "title": "Undefeated Oklahoma State overpowers winless Jayhawks", "performance_score": 0, "site": "kctv5.com", "participants_count": 1, "title_full": "Undefeated Oklahoma State overpowers winless Jayhawks - KCTV5", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T22:50:00.000+03:00", "replies_count": 0, "uuid": "125ec2878e567eb4e60e80ccf0741011e3e5bb06"}, "author": "Posted by Dave Eckert, Assignment Editor", "url": "http://www.kctv5.com/story/30342294/undefeated-oklahoma-state-overpowers-winless-jayhawks", "ord_in_thread": 0, "title": "Undefeated Oklahoma State overpowers winless Jayhawks", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "STILLWATER, OK (FOOTBALLKC) - Fourteenth ranked Oklahoma State was 33 point favorites heading into Saturday’s game and really proved there dominance from the opening kick against 0-7 Kansas.\nIn the Jayhawks first five drives, they only mustered 29 yards in 20 plays. On the other side, five of Oklahoma State’s first six drives resulted in touchdowns. Coming off of a solid outing last week against Texas Tech, the Jayhawks took a step back on Saturday.\nOklahoma State’s very physical front seven showed up with eight tackles for loss and forced quarterback Ryan Willis into many tough situations. The freshman showed good poise at times and decent mobility outside the pocket but also often missed his target resulting in two interceptions.\nWillis finished the day only 12 for 31 for 191 yards and no touchdowns. He wasn’t able to push the ball down the field with much success, in part due to the line’s inability to pick up the blitz.\nThe Cowboy defense consistently staked claim in the Jayhawk backfield totaling eight tackles for loss, and rarely missed any tackles which prevented Kansas from creating the big play.\nThe running game was not much of a factor as well, as the trio of Mann, Cox, and Kinner only combined for 51 yards on 21 carries. Especially with a freshman quarterback, this area needs to improve for Kansas even against a solid run defense like Oklahoma State.\nThe lone bright spot for Kansas came yet again with wide receiver Tre’ Parmalee, as the senior hauled in six catches for 115 yards. A season high for him on Saturday, Parmalee has been the consistent number one target for Kansas and is closing in on 500 yards for the year.\nThe Jayhawk defense showed flashes this week, but could not put together the sustained success that they found last week. They’d dial up solid pressure at times and force some incompletions, but then be gashed on the outside due to over pursuit. The Cowboys ran for 202 yards on the day and 381 yards in the air.\nThe most frustrating part for David Beatty might have been on the mental side of things, as penalties and mistakes set the team back even more. Costly penalties on both sides of the ball consistently gave the Cowboys second chances, and a bad snap on a second quarter punt resulted in another Oklahoma State score.\nKansas will look to limit the mental mistakes and regain some of their momentum next week, as they take on 19th ranked Oklahoma. The Sooners pay a visit to Lawrence on Saturday with kickoff set for 2:30 p.m.\nCopyright 2015 KCTV (Meredith Corp.) All rights reserved.", "external_links": [], "published": "2015-10-24T22:50:00.000+03:00", "crawled": "2015-10-25T16:51:47.677+02:00", "highlightTitle": ""}