{"organizations": [], "uuid": "0e4c1b984376c227bbc1db7621b8e0d831921e3f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "mt-pleasant-ia.villagesoup.com", "main_image": "http://mt-pleasant-ia.villagesoup.com/media/Common/InlandMedia/2015/9/28/1650286/t600-IMG_1606.jpg", "site_section": "http://mt-pleasant-ia.villagesoup.com//rss/story/sports", "section_title": "Mt Pleasant News Sports Headlines", "url": "http://mt-pleasant-ia.villagesoup.com/p/wesleyan-homecoming-spoiled-in-final-minute/1418860?source=rss", "country": "US", "title": "Wesleyan homecoming spoiled in final minute", "performance_score": 0, "site": "villagesoup.com", "participants_count": 1, "title_full": "Wesleyan homecoming spoiled in final minute", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T19:58:00.000+03:00", "replies_count": 0, "uuid": "0e4c1b984376c227bbc1db7621b8e0d831921e3f"}, "author": "news@mpnews.net (Staff)", "url": "http://mt-pleasant-ia.villagesoup.com/p/wesleyan-homecoming-spoiled-in-final-minute/1418860?source=rss", "ord_in_thread": 0, "title": "Wesleyan homecoming spoiled in final minute", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Wesleyan homecoming spoiled in final minute Sep 28, 2015 Photo by: Andy Krutsinger Iowa Wesleyan’s Ryan Gerleman puts a big hit on a Minnesota-Morris receiver during the Tigers’ homecoming game on Saturday afternoon. The Tigers held a six-point lead in the game, but allowed two touchdowns in the final minute to fall to 0-4. \nBY ANDY KRUTSINGER \nMt. Pleasant News \nIowa Wesleyan was just one minute away from their first win of the season in the Tigers’ homecoming game on Saturday afternoon, but a couple of late scores by Minnesota-Morris helped the Cougars play spoiler, defeating IW 33-25. \nThe Cougars started the game off with a 54-yard drive that ended in a 28-yard field goal, but the Wesleyan offense responded with a long drive. Quarterback Caleb Huss drove the Tigers downfield with big throws and a couple of long scrambles, including a 17-yard run on third and 16, but the drive stalled when Huss fumbled the ball inside the red zone. \nMinnesota-Morris took a 3-0 lead into the second quarter, but Wesleyan capped off a 57-yard drive with a 17-yard touchdown reception by Jeremy Gomez to give the Tigers their first lead. After a cougar punt, IW scored for the second time on a 21-yard field goal by Nick Fencl to make it 10-3. \nLater in the second, a Tiger fumble gave Minnesota-Morris the ball inside the IW red zone, but the Cougars had to settle for a field goal. One drive later, the Cougars re-took the lead on a 22-yard touchdown pass, and UMM led 13-10 at the half. \nThe Tigers got the running game going in the third quarter. Huss continued to burn the UMM defense with timely scrambles, and IW took back the lead with a 19-yard rushing touchdown by Larry Jackson. The Tigers led 17-13 after three quarters of play. \nUMM kicked a 20-yard field goal to jump back on top 19-17 with 8:24 left in the game, but freshman kick-returner Bryson Oliver returned the ensuing kickoff 58 yards to the UMM 32. The great field possession was more than enough for the Tiger offense, which scored on a two-yard rush by Donnie Johnson to jump back in the lead, 25-19 with just 5:43 to go. \nThe Cougars started their game-winning drive at their own 45 yard line and converted on three third downs, including an eight-yard rushing touchdown with just 58 seconds left in the game. The extra point made it 26-25 UMM, and the Tigers needed a big final drive. \nAfter a sack on first down, the Cougars seemingly put an exclamation point on the game, when Huss’ pass was picked off over the middle. The defender, however, ran the ball back to the end zone for a score, and the Tigers had new life. \nTrailing 33-25 after the extra point, Oliver broke loose for another huge return. This time, he went 41 yards, just past midfield to the UMM 48. The return set up a last-second heave three plays later to Gomez in the end zone. Huss’ pass from the 40-yard line had the distance, but sailed out of bounds and the Cougars escaped with an eight-point victory. \nHuss finished the game 15-24 for 124 yards and one touchdown and two interceptions. He had 58 yards rushing which was second on the team. Oliver had 65 yards to lead the Tigers, and Jackson finished with 35 yards and a score. \nGomez had six catches in the game for 65 yards and a touchdown. Oliver had six catches of his own for 28 yards. Trinton Robinson caught two passes for 25 yards and Jackson had one reception for six yards. \nThe Tigers fell to 0-4 this season and 0-3 in the conference. They’ll hit the road next week to play the University of Northwestern in St. Paul, Minn. The Eagles are 3-1 so far this season and have won three straight games, including a 27-0 shut out of UMM. Kickoff for next Saturday is set for 1 p.m.", "external_links": [], "published": "2015-09-28T19:58:00.000+03:00", "crawled": "2015-10-02T05:31:36.655+03:00", "highlightTitle": ""}