{"organizations": [], "uuid": "214d19339e481c298099977bcf681f8f9de82e3d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dispatch.com", "main_image": "http://www.dispatch.com/content/digital/images/FBSharingIcons_dispatch.png", "site_section": "http://dispatch.com//content/syndication/sports_highschools.xml", "section_title": "The Columbus Dispatch High School Sports Feed", "url": "http://www.dispatch.com/content/stories/sports/2015/10/24/central-crossing-freshman-leads-boys-state-golf-tournament.html", "country": "US", "title": "school golf | Central Crossing freshman leads boys state tournament", "performance_score": 0, "site": "dispatch.com", "participants_count": 1, "title_full": "High-school golf | Central Crossing freshman leads boys state tournament | The Columbus Dispatch", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T09:06:00.000+03:00", "replies_count": 0, "uuid": "214d19339e481c298099977bcf681f8f9de82e3d"}, "author": "The Columbus Dispatch", "url": "http://www.dispatch.com/content/stories/sports/2015/10/24/central-crossing-freshman-leads-boys-state-golf-tournament.html", "ord_in_thread": 0, "title": "school golf | Central Crossing freshman leads boys state tournament", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The confidence of freshman Caleb Davern of Central Crossing could have gotten lost in a pile of leaves deep in the woods after a bogey on the fifth hole of his first state tournament.\nDavern isn’t an average 15-year-old, and he rebounded with consecutive birdies on the way to shooting a 1-under-par 70 to lead the boys Division I tournament after Friday’s first round at Ohio State Golf Club’s Scarlet Course.\n“I had a lot of confidence because I had a bunch of great lessons during the week,” Davern said. “I had good touch warming up. I wasn’t nervous at all. I’m happy I got the lead, but I know I can play the course much better.”\nDavern leads senior Domenic Maricocchi of Cincinnati St. Xavier by one stroke, sophomore Trey Rath of Olentangy Liberty by two and senior Grant Godfrey of Delaware by three going into the second round.\nSt. Xavier shot 303 for a 13-shot lead over second place Dublin Jerome in the team standings. Liberty is third at 318.\nIn the girls Division I tournament on the par-70 Gray Course, Centerville shot 310 to lead four-time-defending champion Dublin Jerome by three strokes. Olentangy Orange is seventh at 332 and Dublin Coffman 10th at 339.\nJunior Ashley Flynn of Worthington Kilbourne shot 75 to trail leader Jessica Hahn of Canton GlenOak by four strokes.\nCentral Crossing coach Justin Prati said Davern had a grip on the game mentally and physically.\n“He’s the most confident, under-control golfer I’ve been around,”’ Prati said. “He was on fire today. He had the right touch.”\nIt helped that Davern became an Ohio State Golf Club member and played 15 rounds in the summer.\nThe back-to-back birdies, he said, got him going.\n“I hit one of the longest drives of my life on No. 6 to get into position for an iron shot,” he said. “On No. 7 — a hole I’ve always liked — I put an 8-iron\n2 feet from the hole from 168 yards out.”\nPlaying in the state tournament for a second-straight year aided Rath. Last year, he shot 93-80—1 73.\n“I wasn’t as nervous as last year,” he said. “I started slow but then started making putts. I stuck the ball close with my irons.”\nRath had birdies on Nos. 5, 10 and 14. He started the round on the back nine.\n“On the 10th hole, I had a long putt, about 16 feet, for birdie,” he said. “I felt a lot of adrenaline on that putt. That got me going. I worked on my bunker game after what happened last year, and today I got out of five of them.”\nGodfrey was satisfied to be within striking distance of the lead. He had birdies on Nos. 3, 12 and 13.\n“I’ve put myself in the thick of things,” he said. “I’ve been hitting the ball well. I hit only two fairways, but I had some great iron shots. I was patient. I let things come to me. I’m excited. There are a lot of birdie opportunities here.”\nCoach J.D. Butcher was concerned when the Jerome girls were 12 over par after four holes.\n“I was prepared to give them the let’s-fight-them-tomorrow speech,” he said. “But these girls are so strong mentally. They found a groove and never wavered. I like where their heads are.”\nSophomores Taby Robinson and Abby Kiefer led the Celtics with 77s.\nRobinson said the players thought only about playing the next hole.\n“We’ve trained ourselves not to look back,” she said. “We have to stay calm — stay happy.”\nKiefer said, “We all feel good. We’re confident. I think we’re in a good place. We’ve prepared ourselves for this.”\nSenior Jorie Hodapp led Coffman with a 78. She credited her short game.\n“I got up and down today — I hit only six greens in regulation,” she said. “But it was such an advantage having been here last year. I knew what to expect. I enjoyed it.”\nThe Jerome boys, who were led by senior Cam Solomon with a 78, have work to do to win their seventh championship.\n“We didn’t play terrible,” coach Craig Zesiger said. “We played mediocre for what we’re capable of. We have a little hill to climb, but we’re very capable of doing it. A key is being in the final pairing (with St. Xavier). We can look them in the eye. The bull’s-eye isn’t on us.”\nmznidar@dispatch.com \n@MarkZnidar", "external_links": [], "published": "2015-10-24T09:06:00.000+03:00", "crawled": "2015-10-24T14:28:48.443+03:00", "highlightTitle": ""}