{"organizations": [], "uuid": "7ffb9eb4e90e10bea0c1e68c8e5b3cf9480e3f96", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "http://images.tribuneindia.com/cms/gall_content/2015/10/2015_10$largeimg24_Saturday_2015_193203619.jpg", "site_section": "http://www.tribuneindia.com/", "section_title": "The Tribune, Chandigarh, India : Latest news, India, Punjab, Chandigarh, Haryana, Himachal, Uttarakhand, J&amp;K, sports, cricket ", "url": "http://www.tribuneindia.com/news/nation/75-000-tons-of-pulses-seized-from-hoarders-in-13-states/150037.html", "country": "US", "title": "75,000 tons of pulses seized from hoarders in 13 states", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "75,000 tons of pulses seized from hoarders in 13 states", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T03:00:00.000+03:00", "replies_count": 0, "uuid": "7ffb9eb4e90e10bea0c1e68c8e5b3cf9480e3f96"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/nation/75-000-tons-of-pulses-seized-from-hoarders-in-13-states/150037.html", "ord_in_thread": 0, "title": "75,000 tons of pulses seized from hoarders in 13 states", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "New Delhi, October 24\nNearly 75,000 tonnes of pulses have been seized from hoarders in raids across 13 states as part of the measures to control the skyrocketing retail prices that have touched up to Rs 210 per kg. The Centre has also asked the states to hold discussions with dal millers, whole-sellers and retailers to make pulses available at reasonable prices. “De-hoarding operations across the states continued. “These have resulted in seizure of 74,846.359 tonnes pulses so far. Total 6,077 raids have been conducted by the states after the amendment in the Central Order under Essential Commodities Act,” an official statement said. As a result of the de-hoarding drive, the states have reported declining trends in the prices of pulses, it added. Out of 74,846.35 tonnes of pulses seized so far, the maximum of 46,397 tonnes have been recovered from hoarders in Maharashtra followed by Karnataka at 8,755.34 tonnes, Bihar 4,933.89 tonnes, Chhattisgarh 4,530.39 tonnes, Telangana 2,546 tonnes, Madhya Pradesh 2,295 tonnes and Rajasthan 2,222 tonnes. Dal prices have risen across the country due to a shortfall in domestic output by 2 million tonnes in 2014-15 crop year on account of deficient and unseasonal rains. Moreover, the supply in global markets is also limited. “The Centre has asked the state governments to have meeting with millers, wholesellers and retailers to make pulses available in retail markets at reasonable prices,” the Consumer Affairs Ministry said, adding that few states have already moved in this direction. In a communication to the states/union territories, the Centre said the distribution of pulses at reasonable prices through ration shops by some states has helped stabilising the prices and asked other states to consider this step. As per Consumer Affairs Ministry’s data, retail prices touched as high as Rs 210 per kg on Friday. Urad was selling at Rs 190/kg, moong dal at Rs 130/kg, masoor dal at Rs 110/kg and gram at Rs 85/kg. To check rising prices, the Centre has taken several steps like creating a buffer stock of 40,000 tonnes and sale of imported pulses at cheaper rates. It has brought importers, exporters, departmental stores and licenced food processors under the stock holding limit to check hoarding. “Among several measures taken by the Centre to keep prices under check, certain quantity of tur dal has been imported and states were requested to indicate their requirements for retail distribution to contain price rise of pulses. Some states have responded and also lifted certain quantities of tur dal,” the statement said. To assess the availability and prices of pulses, Finance Minister Arun Jaitley on Saturday held two rounds of meetings, first with importers and later with officials of ministries concerned. The Cabinet Secretary also reviewed the situation. — PTI", "external_links": [], "published": "2015-10-24T03:00:00.000+03:00", "crawled": "2015-10-24T20:04:23.065+03:00", "highlightTitle": ""}