{"organizations": ["Blue Eagles", "Mountain Valley Conference", "Eastern Pennsylvania Conference Golf Tournament", "Brookside Country Club", "Nazareth Area High School", "Woodstone Country Club", "EPC"], "uuid": "e78821da8fd6f6b071a7c2f1182a025be0673f0c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "highschoolsports.lehighvalleylive.com", "main_image": "http://hssn-media.advance.net/PennLive.com/news/db675535eaf52855bcde9d72dd4085d9/LehighValleyJuniorTournamentofChampions2015.jpg", "site_section": "http://blog.lehighvalleylive.com/lehighvalleylive_high_school_sports_homepage_feed/atom.xml", "section_title": "lehighvalleylive.com High School Sports", "url": "http://highschoolsports.lehighvalleylive.com/news/article/-8534111807928756394/nazareth-high-school-golf-program-wins-first-team-title-in-17-years/", "country": "IL", "title": "Nazareth golf team ends long drought, captures first EPC title", "performance_score": 0, "site": "lehighvalleylive.com", "participants_count": 0, "title_full": "Nazareth golf team ends long drought, captures first EPC title", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T04:56:00.000+03:00", "replies_count": 0, "uuid": "e78821da8fd6f6b071a7c2f1182a025be0673f0c"}, "author": "", "url": "http://highschoolsports.lehighvalleylive.com/news/article/-8534111807928756394/nazareth-high-school-golf-program-wins-first-team-title-in-17-years/", "ord_in_thread": 0, "title": "Nazareth golf team ends long drought, captures first EPC title", "locations": ["Emmaus", "Nazareth"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Nick Atherholt", "Karl Gilbert", "Nick Hinkle", "Kevin Scherr", "Don Frederick"], "text": "Kevin Scherr shot an 81 Thursday in helping Nazareth to the EPC title. (lehighvalleylive.com file photo) By Karl Gilbert | lehighvalleylive.com View/Post Comments The long title drought is over for the Nazareth Area High School golf program. Led by senior Nick Atherholt (79), and a pair of 81's from juniors Kevin Scherr and Nick Hinkle , Nazareth edged defending tournament champion Emmaus 326-333 Thursday to win the 2015 Eastern Pennsylvania Conference Golf Tournament team title at Woodstone Country Club. During the regular season, Emmaus (15-0) defeated Nazareth by 23 strokes at its home golf course (Brookside Country Club) en route to an undefeated 15-0 season and its fourth consecutive regular-season league championship. However on Thursday, Nazareth, which enjoyed a fine season (15-1 overall, 14-1 conference), earned the league tournament team title. It is the program's first team championship since the late Don Frederick guided the Blue Eagles to a pair of Mountain Valley Conference titles in 1996 and 1998. \nRELATED : Bethlehem Catholic golfer Nick Maff commits to Monmouth \"They worked so hard for it,\" said Nazareth coach Jarret Hoff, now in his 14th season. \"We set many goals for the season, and this was one of them. We came here determined and focused, and they did it.\" In the boys competition, Pocono Mountain East junior Brian Whelan shot a 4-over-par 37-39--76 to edge Bethlehem Catholic senior Nick Maff (37-40--77) by one stroke. Atherholt was third at 79. Maff, the defending champion, held a big lead over the field at 1-under-par through 14 holes, but had 12 putts over his last four holes to shoot 5-over-par 77. After sinking a pair of 10-foot birdie putts on the 12th and 13th holes, the Monmouth University-bound Maff three-putt the 15th green for a bogey, four-putt the par-3 16th hole for a triple bogey, bogeyed the par-5 17th hole, and three-putt the 18th green for a closing bogey. Maff, a two-time District 11 champion (2012, 2014) said he was pleased with his course management through the first 14 holes. \"I was patient up until that point,\" said Maff, who hit 10 greens in regulation and had 35 putts. \"I was frustrated that I missed some short putts.\" Whelan, who plays out of Buck Hill Falls Golf Club, had birdies on the second and fifth holes. Beginning his round on the 12th hole, Whelan found out that he had the lead before he crossed the course's main entrance road to finish his round on the 10th (bogey) and 11th (par) holes. \"I was just trying to make pars today,\" Whelan said. \"I was trying to get it close to the hole, and if I made a birdie, fine; or a par, that would be good.\" Second place in the girls competition a year ago, Emmaus junior Samantha Fritzinger shot a 46-36--82 to win the girls title by eight strokes over Central Catholic senior Franca Hurtado. Ironically, Fritzinger, the defending District 11 3A girls champion, also shot an 82 in the event last year. Beginning her round on the uphill par-4 sixth hole, Fritzinger made a nine. She recovered by playing even-par golf from the seventh to the 18th hole, before sandwiching a birdie in the par-4 second hole with a pair of double bogeys on the first and third holes. \"I hit it in the pond twice on the sixth hole,\" said Fritzinger, who hit eight greens in regulation and used 31 putts. \"After that I just wanted to get lower. It could have been a bit better. I missed some putts. I had a lot of bad holes on the front nine.\" 2015 Eastern Pennsylvania Conference Golf Tournament \nWoodstone Country Club (par 72) Boys: 76 -- Brian Whelan, Pocono Mountain East77 -- Nick Maff, Bethlehem Catholic79 -- Nick Atherholt, Nazareth81 -- Paul Fedele, Easton; Kevin Scherr, Nazareth; Nick Hinkle, Nazareth83 -- Sean Abel, Freedom; Brian Frey, Stroudsburg84 -- Chris Toleno, East Stroudsburg South; Jacob Siegfried, Liberty85 -- Tom Lakata, CCHS; Kevin Caverly, Emmaus; Collin Seip, Nazareth86 -- Max Harrington, Emmaus; John Yocum, Freedom; Ian McBrairty, Easton; Jack Test, Northampton; Tim Gaudette, Pocono Mountain West87 -- Brett Wagner, Pocono Mountain East88 -- Victor Tavares, Nazareth89 -- Donald Lecompte, East Stroudsburg North; Tom Gaudette, Pocono Mountain West90 -- Mike Mathews, East Stroudsburg South; Nick Kashatri, Parkland91 -- Tom Munshower, CCHS; Alec Cwienkala, Parkland; Taylor Foust, Northampton; Jack Mullally, Stroudsburg; Logan Haser, Pocono Mountain East92 -- Jake Smedley, Bethlehem Catholic; Owen Hawk, Liberty; Mike Kovalchik, Northampton; Andrew Hozza, Northampton; Ben Tetzlaff, Parkland; Patrick Labella, Pocono Mountain West; Ryan Humphries, Stroudsburg93 -- Craig Roberts, Pleasant Valley94 -- Chad Sodl, Bethlehem Catholic; J.P. Balas, Pocono Mountain East95 -- James Dellaria, East Stroudsburg South96 -- Austin Negron, Freedom; Sam Ewing, Stroudsburg; Tanner Franks, Pocono Mountain West; Gabriel Torchia, Pocono Mountain East97 -- Nick Serensits, Northampton98 -- Evan Cartwright, Liberty; Connor Wambold, Emmaus; Austin Stella, Liberty; Patrick Skinner, Whitehall; Adam Moninghoff, Stroudsburg99 -- Justin Kinter, Freedom100 -- Nate Coursey, Pleasant Valley101 -- Ben Antonchak, Whitehall103 -- Sean Costello, Bethlehem Catholic; Jackson Pulley, Becahi; Mike Gobreski, CCHS104 -- Cody Scully, Pleasant Valley; Justin Powell, Pocono Mountain West105 -- Kevin Zimmerman, Parkland; Riley Held, Pleasant Valley107 -- Greg Sales, Easton", "external_links": [], "published": "2015-10-02T04:56:00.000+03:00", "crawled": "2015-10-03T01:52:41.199+03:00", "highlightTitle": ""}