{"organizations": [], "uuid": "075c64a44355dc00866144b6a76907980e6c95e1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "torontosportsmedia.com", "main_image": "", "site_section": "http://torontosportsmedia.com/feed", "section_title": "Toronto Sports Media Blog", "url": "http://torontosportsmedia.com/sports-and-toronto/the-blue-jays-ride-ends/20223", "country": "US", "title": "The Blue Jays Ride Ends", "performance_score": 0, "site": "torontosportsmedia.com", "participants_count": 1, "title_full": "The Blue Jays Ride Ends", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T23:54:00.000+02:00", "replies_count": 0, "uuid": "075c64a44355dc00866144b6a76907980e6c95e1"}, "author": "torontosportsmedia", "url": "http://torontosportsmedia.com/sports-and-toronto/the-blue-jays-ride-ends/20223", "ord_in_thread": 0, "title": "The Blue Jays Ride Ends", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "October 25th, 2015 | by torontosportsmedia sports and toronto 8 \nBy TSM \nWell, the sun did indeed rise Saturday and Sunday morning despite the events of Friday night. \nThe team that has captivated both a city and a country flatlined an joined all but two major league clubs on the sidelines watching the World Series, again. \nMake no mistake, the Blue Jays of 2015 were little less than awesome. \nThey managed to do the impossible,draw all interest away from an undeserving hockey franchise that usual under the microscope 24/7. \nAs this is not the place for traditional sports stories, I will let the pro’s conduct the post mortem. \nAll I will say about Friday night is this, when you go 0-12 (or 13) with runners in scoring position it is going to be hard to win. \nIf we polled Blue Jays fans and players alike on the scenario that ended the game at seasons end, there is not a person alive who wouldn’t have drooled at the prospects: Josh Donaldson, likely the league MVP at bat, 2 outs with runners at 2nd and 3rd and we are down by a run. \nThat’s the stuff dreams are made of. \nIn the hockey world, on the pond or on the driveway we envision being the star in a game 7 on a breakaway, a penalty shot with the game on the line. \nIn baseball it’s the same thing. You want the bat in your hands to win it all. \nThis is NOT an indictment on Donaldson, but truth be told it’s the scenario you would want. \nToo bad. \nKind of odd having all of Saturday and all of Sunday to reflect before the talking heads take to the mics on Monday morning. \nBy then, there will be little left to say about Friday night. \nThe focus will be on “tomorrow”. \nSo what do I think about as the season ends???? \nI think about the wall to wall coverage the Jays benefited from over the last 4-4.5 months. \nAlthough they aren’t supposed to, and although many won’t admit it, many who cover the games we love were rooting for the Blue Jays. \nThat’s something we haven’t seen in a long time. \nBarry Davis’s arms in the air reaction to a homerun was, in a word refreshing. \nFollowing the games on twitter reading positive sentiments, and yes, cheers from media types for the local team was fantastic. \nWhen was the last time you saw raw emotion like this by a member of the MSM: Holy shit \n— Doug Smith: Raptors (@SmithRaps) October 24, 2015 \nKudos to the Doug Smith’s of the world. \nPerhaps it’s not just me, but it’s the first time since I’ve been writing here that the media and the fans were one. \nWe haven’t seen that with the Maple Leafs. \nIt was starting to build with the Raptors but they fizzled out. \nIt was great. \nSo to those in the media who stretched the unwritten rule a little bit, thanks! \nIt’s nice to know some of you actually are fans of the games you cover; it’s great to see that the little boy or girl in you can still exist. \nTo those of you who actually sat in the stands, and I know of several of you who did… an extra hat tip to you. \nSo what about tomorrow? \nWell, I’d put a lot of money on sports radio ratings taking a dip here in Toronto. The morning shows will be especially hard hit. \nMccown has had a ton to talk about during this ride. \nOnce Blue Jay mania runs out? The return of Bored Bob. \nWhat does the fan do with Blair and Brunt? They’ve become must listen to radio. Once baseball is done, are they (for the offseason)? \nThese are the things that I am curious about. \nAs for the Jays themselves, buckle up. Alex Anthopoulos’s deal is set to expire at month’s end. Long time executive Paul Beeston is about to exit. This is going to be fascinating to watch. \nI have no clue what’s going to happen. However I can tell you here’s the word on the street: \nThe Blue Jays, Rogers and new President, Mark Shapiro want Anthopoulos back. \nThe question is does Anthopoulos want to come back. \nEveryone who I have talked to in the know says the same thing, it’s no better than 50-50 that Anthopoulos returns. \nThis is not about money. Rogers would likely pay Anthopoulos as well as anyone else. \nWord is that neither Anthopoulos nor Beeston are all that familiar with Shapiro. That’s not good or bad, it is what it is. \nAnthopoulos has been left to his own devices with a massive business/ownership supporter in Beeston. That’s not likely the role Shapiro (the search for a new President started before the Jays made their deals or went on their run) signed up for. \nSo, you may see articles like the one Steve Simmons wrote yesterday claiming that Anthopoulos is all but certain to return, I am not so sure. Too many people are saying the same thing for them all to be wrong. I am not saying it’s a done deal that he’s leaving, all I am saying is there’s a good a chance he is not returning as there is he is returning. \nThe Simmons story really doesn’t say much, except for this: \n“ But what’s strange is this: Sources also indicate that Anthopoulos has neither signed a contract, negotiated a contract with incoming team president Mark Shapiro, or agreed to anything resembling terms or dollar figures going into next season, which only serves to confuse what appears to be apparent. ” \nThis could be settled in 24-48 hours. Negotiating the deal is not hard. \nThe question is what does Alex want to do; make no mistake he is in the drivers seat. \nHappy Sunday", "external_links": [], "published": "2015-10-25T23:54:00.000+02:00", "crawled": "2015-10-26T03:47:53.544+02:00", "highlightTitle": ""}