{"organizations": [], "uuid": "66d2ce6659cde4be96b8161d20c976ddba3c1d33", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "http://www.bostonherald.com/sites/default/files/blog_posts/101215bruinscs10.jpg", "site_section": "http://bostonherald.com/sports/bruins_nhl", "section_title": "Sports: Bruins &amp; NHL | Boston Herald", "url": "http://bostonherald.com/sports/bruins_nhl/bruins_insider/2015/10/zdeno_charas_return_doesnt_help_winless_bruins_in_6_3_loss", "country": "US", "title": "Zdeno Chara's return doesn't help winless Bruins in 6-3 loss to Lightning | Bruins Insider |", "performance_score": 0, "site": "bostonherald.com", "participants_count": 4, "title_full": "Zdeno Chara's return doesn't help winless Bruins in 6-3 loss to Lightning | Bruins Insider | | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:00:00.000+03:00", "replies_count": 3, "uuid": "0936945242cd4149cf5ac34997897fa04038873a"}, "author": "Steve Conroy", "url": "http://bostonherald.com/sports/bruins_nhl/bruins_insider/2015/10/zdeno_charas_return_doesnt_help_winless_bruins_in_6_3_loss#post-0", "ord_in_thread": 0, "title": "Zdeno Chara's return doesn't help winless Bruins in 6-3 loss to Lightning | Bruins Insider |", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "With the return of captain Zdeno Chara, the Bruins were, predictably, a better team today than they were in their first two games of the season.\nBut they're still not a very good one.\nThe B's dropped a 6-3 decision to the loaded Tampa Bay Lightning at the Garden and will now hit the road for a two-game road swing, still searching for answers at 0-3.\nFor the third straight game, the Bruins had a good first period with little to show for it.\nThey jumped out to a 2-0 lead, their first multiple goal advantage of the season, only to see it evaporate in 1:09 late in the period.\nBoth Bruins goals came on the power play The first one came at 2:59, when David Krejci's shots got through Ben Bishop, courtesy of a little traffic in front from Loui Eriksson.\nEriksson then made it 2-0 at 11:02 when Torey Krug zipped a nice pass across the top of the crease for an open Eriksson.\nThe B's played well through much of the first period, but as soon as the team defense loosened up a bit, the Lightning made them pay. On a Tampa rush, defenseman Victor Hedman took the puck deep and was allowed to sneak a pass back in front of Max Talbot to Brian Boyle, who scored over Tuukka Rask's glove arm.\nSixteen seconds later, Patrice Bergeron took a goalie interference penalty and at, 16:51, Ondrej Palat tied it up on the power play when he redirected a Tyler Johnson shot through Rask's pads.\nThe B's then had another bad start to the second period. After getting an early power play, they failed to generate any scoring chances. And at the tail end of the man advantage, David Pastrnak fanned on a pass at the blue line and it was picked off by Boyle, who went the distance for a backhand goal at 4:50.\nThe B's tied it up on their third power-play goal of the game when Eriksson redirected a Krejci shot that was going wide.\nBut they could not stay even. After Bergeron was called for holding, Steven Stamkos scored one of his patented power-play goals from the left circle, whistling it over Rask's glove arm at 15:17. Coach Claude Julien was incensed after the goal, presumably over a non-call on a possible interference by Tyler Johnson, who wiped out Chris Kelly and allowed the Bolts to keep their attack alive just prior to the goal.\nIn the third, Jonathan Drouin made it 5-3 when his partially blocked shot skittered through Rask's pads. As time began to wind down, and their fate was becoming more and more obvious, the Bruins' play got sloppy again and Valtteri Filppula knocked home another one late.", "external_links": [], "published": "2015-10-12T03:00:00.000+03:00", "crawled": "2015-10-13T01:26:11.544+03:00", "highlightTitle": ""}