{"organizations": ["AP"], "uuid": "c6e18c4ef8e777acd7e2b3a137d7ba16ee0a6d49", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.shanghaidaily.com", "main_image": "http://www.shanghaidaily.com/newsimage/2015/10/08/020151008231519.jpg", "site_section": "http://rss.shanghaidaily.com/portal/mainsite/Sports", "section_title": "Shanghai Daily: Sports", "url": "http://www.shanghaidaily.com/sports/rugby/Habana-ties-Lomu-mark/shdaily.shtml", "country": "", "title": "Habana ties Lomu mark", "performance_score": 0, "site": "shanghaidaily.com", "participants_count": 0, "title_full": "Habana ties Lomu mark", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T19:10:00.000+03:00", "replies_count": 0, "uuid": "c6e18c4ef8e777acd7e2b3a137d7ba16ee0a6d49"}, "author": "", "url": "http://www.shanghaidaily.com/sports/rugby/Habana-ties-Lomu-mark/shdaily.shtml", "ord_in_thread": 0, "title": "Habana ties Lomu mark", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Lomu"], "text": "Source: AP | October 9, 2015, Friday | Print Edition \nBRYAN Habana had never played rugby before the 1995 World Cup, a tournament he remembers vividly for the way blockbusting All Blacks winger Jonah Lomu carved up England’s defense and for the way Nelson Mandela presented the winning trophy to the Springboks. \nHe’d traveled with his father to the opening game, where the Springboks were playing the defending champion Australians, and was one of the 60,000 crammed into Ellis Park when host South Africa held off Lomu’s New Zealand team to claim the title. It was all very inspirational stuff for an impressionable lad, including a chance meeting with Lomu when he was chasing an autograph. \nThe 32-year-old Springboks winger recounted it all on Wednesday after equaling Lomu’s record for career tries at the Rugby World Cup, crossing for his 13th, 14th and 15th tries within a 20-minute span in the second half of a 64-0 win over the US at London’s Olympic Stadium. \n“I don’t think I could equate myself with Jonah and what he was able to do for the game,” Habana said. “For me, he is an inspiration. \n“In 1995, for me in that World Cup to see a guy like Jonah Lomu demolish England all by himself, how he went on to become a global superstar ... I will never forget. I was there targeting signatures.” \nA veteran of 114 tests, Habana said he was humbled and proud to be considered in the same sentence as Lomu. \nLomu, who scored his 15 tries in the ‘95 and ‘99 World Cups and was easily the most identifiable player in the game, was quick to congratulate Habana. \n“Congrats brother your a great ambassador of our great game blessings 2 you n your family,” he posted on Twitter. \nHabana also moved up to equal second on the all-time try-scoring list with Australia great David Campese with his 64th test try.", "external_links": [], "published": "2015-10-08T19:10:00.000+03:00", "crawled": "2015-10-09T00:37:29.769+03:00", "highlightTitle": ""}