{"organizations": ["The Sun Herald"], "uuid": "cb4b16d2bed63c95369e124976ab2872611c82e2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sunherald.com", "main_image": "http://media.sunherald.com/smedia/2015/09/13/12/28/Umyan.AuSt.77.jpeg", "site_section": "http://www.sunherald.com/sports/index.rss", "section_title": "The Sun Herald -- Sports", "url": "http://www.sunherald.com/2015/09/30/6441713/even-after-hot-start-mullens-job.html", "country": "US", "title": "Even after hot start, Mullens' job as Southern Miss' QB isn't secure", "performance_score": 0, "site": "sunherald.com", "participants_count": 0, "title_full": "Even after hot start, Mullens' job as Southern Miss' QB isn't secure", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T21:29:00.000+03:00", "replies_count": 0, "uuid": "cb4b16d2bed63c95369e124976ab2872611c82e2"}, "author": "", "url": "http://www.sunherald.com/2015/09/30/6441713/even-after-hot-start-mullens-job.html", "ord_in_thread": 0, "title": "Even after hot start, Mullens' job as Southern Miss' QB isn't secure", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["ALAN HINTON", "Mullens"], "text": "Even after hot start, Mullens' job as Southern Miss' QB isn't secure By ALAN HINTON Special to The Sun Herald September 30, 2015 Updated 9 hours ago 2015-09-30T18:29:39Z Order a reprint of this story \nTIM ISBELL/SUN HERALDSouthern Miss quarterback Nick Mullens looks is the Golden Eagles' unquestioned starter under center. TIM ISBELL — SUN HERALD | Buy Photo \nHATTIESBURG -- Southern Miss quarterback Nick Mullens passed for 447 yards last week against Nebraska and threw four touchdown passes the previous game against Texas State. \nNo interceptions either game. \nAnd he's fifth in the national rankings in passing. \nSo there is little doubt that he's the man, he's the QB who will be on the M.M. Roberts Stadium field at 6 p.m. Saturday in the Golden Eagles' Conference USA opener against North Texas, he's the one who won the quarterback job and will be in there forever more. \nRight? \nWell… \nWith a straight face, Southern Miss head coach Todd Monken said this at his weekly press conference: \"Nick has played well but it is a week-to-week sport. Yes, Nick played well last week but he needs to play well this week.\" \nIn other words, mess up and you're on the bench. \nIn spring drills and in preseason practices, Mullens -- who first earned his starting position two years ago as a freshman -- battled Tyler Matthews for the first-string spot. \nIt was a real battle, and few knew before the Sept. 5 season opener against Mississippi State who would get the start. \nBut No. 9 hit the field against the Bulldogs and stayed there, although Matthews mopped up against Austin Peay in the second game of the season. \n\"Tyler is a good football player so it was tough,\" Monken said. \"Nick did win it over the course of time that we watched during the spring and fall camp.\" \nMaybe Monken said that Mullens needs to keep playing well to keep from taking it easy. Maybe he said it to keep Matthews sharp. \nBut Mullens -- who studies the game, who is a devoted game film watcher, who may not be as much of a gambler as Monken but who likes to see his head coach take chances -- always takes the high road when talking in public. \n\"I was just trying to do my job,\" he said about last week's big numbers. \"Focus on each play. Realize that we had matchups. It was more just X's and O's than mental. First half was turnovers, penalties, had a big play and find a way to get back. Second half was finding matchups and believing that we could do it.\" \nTeased that Southern Miss fans might insist that the gaudy numbers continue, Mullens stayed true to form. \n\"I try not to worry about the expectations,\" he said. \"Going forward for me, it's about focusing every play. I really don't figure getting caught up in a lot of that stuff.\" \nMullens said his goal is to stay calm, perform as well as he can and win games. \n\"You try not to focus on (statistics),\" he said. \"You want to win so bad. Coach Monken said after the (Nebraska) game he was proud of us, how we played, no matter what the outcome was. \n\"I was proud of me and my teammates, really proud of the O-line in the second half. They've come a long way. Coach (Luke) Meadows has done a great job. They don't get enough credit. I know we threw for a lot of yards and the guys had a lot of catches, but in the second half they stepped up tremendously and that's awesome. \n\"So I was just proud of the team all-around. We showed great effort. We were down by a certain amount in the fourth quarter but we were still as hyped as could be. jumping around at the end of the third quarter, so we still believed. That's one thing I hope people noticed. (Strength and conditioning coach Zac) Woodfin and his whole staff really put confidence in us to go to work.\" \nMullens is excited to be back on the field this season and figures the quarterback position is now his to lose. \n\"The quarterback competition is just another challenge that I had to go through,\" he said. \"A college football career will never be smooth and easy. It's rare if it ever is. So handling the next challenge or the next line of adversity is what a long football career is about and that was just one chapter or one part of it. I still think back to it, how I was able to have success, how I was able to keep my mind straight during camp. That helps me out during the season as well. So I think it was a good thing, a blessing. \n\"The ability to stay calm and focus on the right things, focus on each play. I know I've said it plenty of times this year but that's what it comes down to. Me vs. my opponent, the team vs. our opponent. If you do your job on every single play, then it's hard to fail.\" \nUSM offensive coordinator Chip Lindsey smiled a little when talking about Mullens, something neither Monken or Mullens did. \n\"(The big passing numbers) says that he's a good player,\" Lindsey said. \"Maybe we've got a pretty good guy at that position.\"", "external_links": [], "published": "2015-09-30T21:29:00.000+03:00", "crawled": "2015-10-01T06:41:08.796+03:00", "highlightTitle": ""}