{"organizations": ["Green Bay Packers", "NFL", "Rams Related View Larger St. Louis Rams", "AP"], "uuid": "08b18f0f919638c8d0b1e044ee1fdec44cbb84e5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.journal-news.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/10/11/1a/a7/5d9d1ae6a4374773a538cf87c84a87f9-3167d915baae47388abd0e16c18685ab-0.jpg", "site_section": "http://www.journal-news.com/feeds/categories/sports/", "section_title": "News | Sports", "url": "http://www.journal-news.com/ap/ap/top-news/packers-defense-backs-rodgers-in-24-10-win-over-ra/nnzfP/", "country": "US", "title": "Packers' defense backs Rodgers in 24-10 win over Rams", "performance_score": 0, "site": "journal-news.com", "participants_count": 0, "title_full": "Packers' defense backs Rodgers in 24-10 win over Rams", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T04:20:00.000+03:00", "replies_count": 0, "uuid": "08b18f0f919638c8d0b1e044ee1fdec44cbb84e5"}, "author": "", "url": "http://www.journal-news.com/ap/ap/top-news/packers-defense-backs-rodgers-in-24-10-win-over-ra/nnzfP/", "ord_in_thread": 0, "title": "Packers' defense backs Rodgers in 24-10 win over Rams", "locations": ["Wis.", "Green Bay"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Rodgers", "Mark Barron", "Rodney McLeod", "Ludtke", "James Laurinaitis"], "text": "Updated: 9:20 p.m. Sunday, Oct. 11, 2015 | Posted: 9:20 p.m. Sunday, Oct. 11, 2015 Packers' defense backs Rodgers in 24-10 win over Rams Related View Larger St. Louis Rams' James Laurinaitis (55) celebrates his interception with teammates Mark Barron (26) and Rodney McLeod (23) during the first half an NFL football game against the Green Bay Packers Sunday, Oct. 11, 2015, in Green Bay, Wis. (AP Photo/Matt Ludtke) More News Headlines The Associated Press GREEN BAY, Wis. — \nAaron Rodgers' remarkable run of mistake-free football at home is over. Green Bay, though, is still perfect this season. \nA relentless defense helped the Packers overcome an unusually average day from their MVP quarterback. \nRodgers threw for two touchdowns and 241 yards, and the defense had three sacks and four interceptions to hold off the St. Louis Rams for a 24-10 victory on Sunday. \n\"Good team win today, start with the defense,\" coach Mike McCarthy said. \"I thought they were clearly the key to our victory.\" \nRodgers was 19 of 30 with long scoring strikes to receivers Ty Montgomery and James Jones for the Packers (5-0). \nSince becoming the starting quarterback in 2008, Rodgers has 31 touchdown passes of at least 50 yards, the most in the NFL over that span. \nBut NFL-record streaks of 587 pass attempts and 49 touchdown passes at home without an interception for Rodgers ended in the first quarter on linebacker James Laurinaitis' diving pick of a tipped ball for the Rams (2-3). \nRodgers threw another interception in the second quarter before losing a fumble in the third on a sack. \n\"All of them,\" Rodgers said when asked which turnover bothered him the most. \nThe Rams defense heeded coach Jeff Fisher's advice to get their hands on the football. \n\"How long has it been since Aaron's thrown an interception here? Five-hundred attempts,\" Fisher asked. \nThe Packers defense was still better. \nRelentless pressure on quarterback Nick Foles helped keep the Packers unbeaten. Foles' four interceptions were a career-worst, with two in the fourth quarter inside the Packers 10. \n\"I've got to make better decisions to give my teammates an opportunity to make a play,\" Foles said. \nRookie cornerback Quinten Rollins returned an interception 45 yards for a touchdown for a 14-0 lead in the first quarter, and picked off another pass at the 7 with 23 seconds left. Safety Ha Ha Clinton-Dix intercepted a tipped pass in the end zone on third-and-goal at the 7. \nGreg Zuerlein was 1 for 4 on field-goal tries, hitting from 42 but missing his other three attempts, all coming from at least 50 yards. One kick in the second half was blocked by Datone Jones. \nThe mistakes wasted another strong effort for Rams rookie Todd Gurley, who for the second straight week had his best production, with 159 yards rushing on 30 carries. He dented a defense that had held opposing starting running backs to an average of 36 yards on 11 attempts the previous three games. \n\"We're running the football right now. We're 1-1 since Todd's got his opportunity, so we just need to keep improving,\" Fisher said. \nBut a week after defeating previously unbeaten Arizona, the Rams couldn't repeat the feat on a warm fall afternoon in Green Bay. \nFoles was 11 of 30 for 141 yards and a touchdown. His longest completion came on a 68-yarder to Stedman Bailey late in the fourth quarter. \nOtherwise, the Packers' pass rush overwhelmed an inexperienced offensive line that lost veteran guard Rodger Saffold in the first quarter to a shoulder injury. \nThe defense held up in spite of losing tackle B.J. Raji to a groin injury and linebacker Nick Perry (shoulder). Guard T.J. Lang also left in the first quarter with a knee injury. \nStar linebacker Clay Matthews set the tone with 1 1/2 sacks and several other trips into the backfield. Mike Daniels led the charge on the defensive line with eight tackles. Safeties Clinton-Dix and Micah Hyde more than made up for the loss of Morgan Burnett, who missed a third straight game with a calf injury. \n\"It still is an offensive team, but it's nice when the defense can hold their own, especially in the last couple of weeks when opposition is having a big defense and maybe our offense isn't clicking,\" Matthews said. \nNOTES: James Jones' 65-yard TD catch at 12:41 of the third quarter was Green Bay's longest offensive play of the season and gave the Packers a 21-10 lead. .... The Packers had their first four-interception game since Sept. 13, 2012, in a game against Chicago. ... Laurinaitis finished with a team-high eight tackles. ... CB Trumaine Johnson had the Rams' other interception. \n___ \nAP NFL website: www.pro32.ap.org and http://twitter.com/AP_NFL Copyright The Associated Press", "external_links": [], "published": "2015-10-12T04:20:00.000+03:00", "crawled": "2015-10-12T08:11:04.816+03:00", "highlightTitle": ""}