{"organizations": [], "uuid": "9838b783cae471f1840d70d88768609bd42f8ffa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.philly.com", "main_image": "http://media.philly.com/images/102115-FB-temple-1200.jpg", "site_section": "http://www.philly.com/philly/sports", "section_title": "Philadelphia Sports - Eagles, Phillies, 76ers, Flyers", "url": "http://www.philly.com/philly/sports/colleges/temple/20151022_Temple_s_destinations__bowl_game__new_stadium.html", "country": "US", "title": "Temple's destinations: bowl game, new stadium", "performance_score": 0, "site": "philly.com", "participants_count": 1, "title_full": "Temple's destinations: bowl game, new stadium", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "9838b783cae471f1840d70d88768609bd42f8ffa"}, "author": "Bob Brookover,", "url": "http://www.philly.com/philly/sports/colleges/temple/20151022_Temple_s_destinations__bowl_game__new_stadium.html", "ord_in_thread": 0, "title": "Temple's destinations: bowl game, new stadium", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "To say that Temple football has arrived is to assume that we knew exactly where it was supposed to be headed.\nThis was surely a good week for a university that sacrificed five other sports (gymnastics, baseball, softball and indoor and outdoor track) in an effort to bolster its football program to the point where it will fuel public and trustee support for an on-campus stadium.\nWhen school administrators put head to pillow Sunday night, they did so with a football team that was ranked No. 22 in the Associated Press poll of writers and No. 24 in the coaches poll. It was the first time since 1979 that the Owls had a ranked football team and kudos to coach Matt Rhule and his players for taking the program there.\nAlso to their credit was the way the coach and his players handled the big news as they prepared for Thursday night's road game against an East Carolina team that is a lot better than its 4-3 record might indicate.\nMore coverage Latest college football rankings Latest college sports videos SHOP: Collegiate Sportswear & Merchandise \"Of course history is still out there to be made,\" senior cornerback Tavon Young said after practice Tuesday. \"We still have a long season to go. We just reached the midpoint, so a lot can happen. There are just always things that can be done. We're not really focused on just being ranked. It's always a good thing, but we're moving past that.\"\nPreparing for and beating East Carolina is the thought Rhule attempted to ingrain in his players this week. Narrowing the focus of a ranked football team is something no Temple coach since Wayne Hardin has had to deal with, but the charismatic and energetic Rhule seems to be the right man for the job.\n\"We know we're going down to a great atmosphere,\" the coach said. \"I think I saw they are having a blackout. We know it's going to be 50,000 fans. Someone told me that they canceled classes after 3 o'clock on Thursday.\"\nThe Pirates, like eight of the dozen teams that comprise the underrated American Athletic Conference, have an on-campus facility and an average attendance of 44,763 this season. Temple, by contrast, had 35,179 at its Tulane game and 31,372 at its game against Central Florida. There are those who will tell you that those numbers are exaggerated, but somewhere in the neighborhood of 30,000 is a magic number for the Owls because that is roughly the capacity they'd like to have for their field of dreams in North Philadelphia.\nSome might argue that Lincoln Financial Field was filled for the Owls' milestone win over Penn State to open the season and will be again on Halloween night when Notre Dame comes in for ABC's featured game of the day. Beat East Carolina and remain unbeaten and Temple might even attract Lee Corso and ESPN's College GameDay crew to the Linc.\nBut that does not change the fact that attendance only spikes for the Owls when storied opponents attract their own alumni to the tailgate parties.\nCan Temple on its own merit ever consistently fill an on-campus stadium of half that capacity? That's the destination the administration has in mind and Rhule and his 6-0 football team are doing everything they can to fulfill it even if that's not a goal that enters their mind.\n\"We're a work in progress,\" Rhule said. \"I'm trying to teach these kids how to win and they're trying to teach me how to win. We're just trying to do it together. We're not Baylor. We just have to keep banging away, banging away and banging away.\"\nThe road ahead is a difficult one for the Cherry and White. East Carolina is 3-0 at home, including a win over Virginia Tech. The Pirates only lost to 13th-ranked Florida by seven on the road. The Owls' penultimate game is at home against an 18th-ranked Memphis team that just upset Ole Miss. Attendance at the Linc will be interesting for that one.\nRhule and his players are definitely deserving of more attention and for them the eventual destination should be the bowl game that they were denied as a 6-6 team last season. A conference title would be an amazing accomplishment, but one that is certainly within reach.\nJunior quarterback P.J. Walker has rebounded from a rough sophomore season to put up solid numbers - eight touchdowns, three interceptions and a 60.8 completion percentage. Jahad Thomas, who was Walker's high school teammate at Elizabeth High School in North Jersey, is 13th in the nation with 756 rushing yards and tied for 11th with 10 rushing touchdowns.\nDefensively, the Owls are ranked 13th overall in the country and eighth against the run. They also have an All-American candidate in senior linebacker Tyler Matakevich.\nThis is a team that believes it has a chance to be special and it has earned that belief. Where that will take the Owls this season and where it will take the program in the future remains to be seen.\nbbrookover@phillynews.com\n@brookob", "external_links": ["http://philly.stats.com/cfb/polls.asp", "http://www.avantlink.com/click.php?tt=cl&mi=11081&pw=159355&ctc=collegegearArticle&url=http%3A%2F%2Fwww.fanatics.com%2Fpages%2FCOLLEGE"], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-22T00:22:13.224+03:00", "highlightTitle": ""}