{"organizations": [], "uuid": "438e784488a5cf1e380d8d8d450523a060a83273", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wftv.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/10/08/2d/79/8d42f56ef49e4319981ef95bbede3fa1-52b7ad87e90f4f988c98e5e4e1c8dc57-0.jpg", "site_section": "http://www.wftv.com/feeds/categories/sports/", "section_title": "News | Sports", "url": "http://www.wftv.com/ap/ap/top-news/the-latest-blatters-lawyer-says-procedure-not-foll/nnxwB/", "country": "US", "title": "The Latest: Sheikh Salman calls for FIFA ExCo meeting", "performance_score": 0, "site": "wftv.com", "participants_count": 0, "title_full": "The Latest: Sheikh Salman calls for FIFA ExCo meeting", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T22:25:00.000+03:00", "replies_count": 0, "uuid": "438e784488a5cf1e380d8d8d450523a060a83273"}, "author": "", "url": "http://www.wftv.com/ap/ap/top-news/the-latest-blatters-lawyer-says-procedure-not-foll/nnxwB/", "ord_in_thread": 0, "title": "The Latest: Sheikh Salman calls for FIFA ExCo meeting", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Latest from the FIFA investigation (all time local): \n___ \n9:20 p.m. \nFIFA vice president Sheikh Salman Bin Ebrahim Al Khalifa says he has written to acting president Issa Hayatou to request an urgent meeting of the governing body's executive committee. \n\"These are exceptional circumstances and that is why we need the meeting. Only together will we overcome these difficult times,\" said Sheikh Salman, who also heads the Asian Football Confederation. \nSunil Gulati, a member of the executive committee and head of the United States Soccer Federation, also called for an emergency summit. \n\"A number of us have asked for an emergency executive committee meeting to discuss the way forward over the near term,\" Gulati said. \n___ \n8:05 p. m. \nActing FIFA president Issa Hayatou says Michel Platini \"can very well manage FIFA tomorrow\" if he clears his name. \nSpeaking to RFI radio, Hayatou said the UEFA president has the possibility to fight the FIFA ethics committee's decision to suspend him for 90 days and \"can be cleared by other bodies.\" \nHayatou, who has ruled himself out as a permanent successor to Sepp Blatter, said more people could be targeted by FIFA in the coming weeks. \nHe said \"we are not going to make sensational stories. But If it should happen, it will happen. Everyone who screws up will be suspended. Nobody should be granted protection.\" \n___ \n7:35 p.m. \nMichel Platini says the allegations that led to his 90-day ban are \"astonishingly vague\" and has promised to contest the decision. \nThe UEFA president was banned Thursday by the FIFA ethics committee. But the former France great appears to be defying the order by continuing to work at European soccer's governing body. \nIn a statement released by UEFA hours after the ban was announced, Platini said he will \"of course contest in the appropriate manner at the appropriate time.\" \nPlatini says \"I want everyone to know my state of mind: more than a sense of injustice or a desire for revenge, I am driven by a profound feeling of staunch defiance. I am more determined than ever to defend myself before the relevant judicial bodies.\" \nSeveral European sports leaders have already come out in defense of Platini, who had been favored to replace Sepp Blatter as FIFA president in February's election. The ban, however, seems to have ruled Platini out of the race. \nBlatter was also banned for 90 days after becoming a suspect in a Swiss criminal investigation. \n___ \n7:20 p.m. \nFrench sporting authorities are jumping to the defense of Michel Platini. \nFrench soccer federation president Noel Le Graet said the former Juventus playmaker remains \"the man of the situation,\" while Secretary of State for Sports Thierry Braillard told RTL radio on Thursday that he still believes in Platini's \"honesty, integrity and determination\" to become the next FIFA president. \nLe Graet also said the FIFA ethics committee took \"an extremely hasty decision\" by banning Platini for 90 days. \n___ \n7:05 p.m. \nSepp Blatter has left FIFA headquarters. \nThe FIFA president, who was suspended for 90 days on Thursday, drove out of the compound where FIFA's offices are located on the outskirts of Zurich at about 7 p.m. \nBlatter, who is under criminal investigation in Switzerland, was banned Thursday by the ethics committee. UEFA President Michel Platini, the man who had been favored to succeed Blatter, was also suspended. \n___ \n7 p.m. \nThe UEFA executive committee has expressed \"full confidence\" in Michel Platini despite his 90-day suspension by the FIFA ethics committee. \nDefying FIFA, European soccer's governing body says it is not invoking statues requiring its highest-ranking vice president, Angel Maria Villar, to be appointed acting president. \nUEFA says \"this is because the UEFA executive committee is aware that the UEFA president will immediately take all necessary steps to appeal the decision of the FIFA ethics committee to clear his name.\" \nThe UEFA statement stressed that the executive committee \"expressed its full confidence\" in Platini and will meet next Thursday in Nyon. All 54 UEFA member associations will meet at UEFA headquarters on the same day. \nPlatini was questioned by Swiss investigators last month about a payment of 2 million Swiss francs (about $2 million) he received from FIFA in 2011 for work carried out up to 2002. \nSepp Blatter is being investigated as a suspect in the case, while Platini is being treated \"between a witness and an accused person,\" according to Swiss attorney general Michael Lauber. \nBlatter was also suspended for 90 days on Thursday. \n___ \n6:26 p.m. \nTwitter bio deleted. \nAfter Sepp Blatter was relieved of his duties by FIFA, the governing body edited his Twitter profile (www.twitter.com/SeppBlatter) to remove the reference to being president. \nBlatter started a 90-day suspension on Thursday after the ethics committee acted against its own leader, who is under criminal investigation in Switzerland. \nNo tweet has appeared on Blatter's account since Friday. \n___ \n6:15 p.m. \nChung Mong-joon says he will \"mobilize all legal means available to expose the injustice\" of the FIFA decision to ban him from soccer for six years. \nThe former FIFA vice president from South Korea received the ban Thursday as a result of the ethics committee investigation into 2022 World Cup bidding. South Korea was one of the bidding nations in the contest won by Qatar. \n\"While this decision does not come as a surprise, I am profoundly disappointed at an act that, once again, demonstrates the profoundly irresponsible and unethical nature of FIFA,\" Chung said. \nThe ban will prevent Chung from pursuing plans to stand in the Feb. 26 emergency presidential election. \nChung claims that, contrary to public comments by Sepp Blatter, the 79-year-old FIFA president is angling to stay in power. \nBlatter was handed a 90-day ban on Thursday, as was UEFA President Michel Platini. \n\"International football community is already taking note of the fact that President Blatter plans to come back to his current position after February 26, 2016, by which time the provisional 90-day ban would have expired, and if the emergency FIFA Congress is unable to elect the next president,\" Chung said. \"This decision by the ethics committee has completely undermined the legitimacy and fairness of the next FIFA presidential election.\" \n___ \n4 p.m. \nIOC President Thomas Bach says \"enough is enough\" at FIFA and is calling for a \"credible external presidential candidate\" to take over world soccer's scandal-scarred governing body. \nBach says FIFA \"cannot continue to remain passive\" and \"must act swiftly to regain credibility\" for the organization and the sport. \nThe International Olympic Committee leader says FIFA has a \"structural problem\" that \"will not be solved simply by the election of a new president.\" \nBach says FIFA must \"acccelerate and deepen the reform process\" and \"should also be open for a credible external presidential candidate of high integrity, to accomplish the necessary reforms and bring back stability and credibility to FIFA.\" \n___ \n3:20 p.m. \nFIFA secretary general Jerome Valcke has \"unequivocally denied\" any wrongdoing after being suspended for 90 days over allegations of a deal for black market sales of tickets to 2014 World Cup matches. \nA statement from Valcke's lawyer, Barry Berke, says the Frenchman was the subject of \"false allegations.\" It said Valcke \"is confident that when all the facts come out, it will be clear that he did absolutely nothing wrong or improper in carrying out his duties for the good of FIFA and the sport.\" \nValcke was banned along with FIFA President Sepp Blatter and UEFA President Michel Platini on Thursday, although over separate allegations. \n___ \n3:10 p.m. \nIssa Hayatou has ruled himself out as a permanent successor to Sepp Blatter and says he has taken over as acting president of FIFA \"amid extraordinary circumstances.\" \nSepp Blatter and UEFA President Michel Platini have been suspended for 90 days by FIFA. \nIn a statement released by FIFA, Hayatou says he will only take over the top job on an interim basis and not stand in the emergency presidential election on Feb. 26. \nThat finally ended speculation about Hayatou, a FIFA senior vice president under Blatter and head of the African soccer confederation, becoming a candidate. \nHayatou also says that FIFA will \"continue to cooperate fully with authorities and follow the internal investigation wherever it leads.\" \nHayatou, who is from Cameroon, replaces Blatter temporarily because of his position as the longest-serving current member of FIFA's executive committee. \n___ \n3 p.m. \nFIFA vice president David Gill and fellow executive committee member Wolfgang Niersbach have called for an emergency meeting of FIFA's ruling body to be held. \nAccording to a statement from the English Football Association, of which Gill is vice chairman, the FA says \"there will be a meeting of the 54 UEFA nations as soon as next week.\" \nThe FA was one of the first federations to endorse Michel Platini's candidacy for FIFA president, and the English are not withdrawing that backing yet. \n\"At the FA board meeting last week, we decided that remained our position while inquiries into certain allegations were being investigated,\" the FA said. \"We now await the results of both the ethics committee inquiry and the investigation of the Swiss attorney general.\" \n___ \n2:20 p.m. \nWith Sepp Blatter suspended, African soccer leader Isaa Hayatou will serve as acting president of the governing body for the next 90 days. \nFIFA confirmed Thursday that Hayatou gets automatically elevated to the top job as the longest-serving vice president on its executive committee. \nThe 69-year-old Hayatou has ruled African soccer for 27 years. \n___ \n1:50 p.m. \nSepp Blatter's lawyer says the FIFA ethics committee failed to follow the proper procedure when it decided to ban him for 90 days. \nRichard Cullen says Blatter was \"disappointed that the ethics committee did not follow the code of ethics and disciplinary code, both of which provide for an opportunity to be heard.\" \nCullen also says the ethics committee based its decision on a \"misunderstanding,\" adding that the Swiss attorney general has not charged Blatter with a crime. Copyright The Associated Press Sign up for our WFTV Morning News Headlines Newsletter Sign Up", "external_links": [], "published": "2015-10-08T22:25:00.000+03:00", "crawled": "2015-10-09T02:57:53.020+03:00", "highlightTitle": ""}