{"organizations": [], "uuid": "42cb39617e635df28cc9a02ddcb51f1a2b83e2c4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports/mlb", "section_title": "MLB News, Scores, Schedule, Standings, Stats, Photos, Videos - Baseball - MSN Sports", "url": "http://www.msn.com/en-us/sports/mlb/six-pivotal-players-to-watch-in-the-alcs/ar-AAfvtGu", "country": "US", "title": "Six pivotal players to watch in the ALCS", "performance_score": 0, "site": "msn.com", "participants_count": 1, "title_full": "Six pivotal players to watch in the ALCS", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "42cb39617e635df28cc9a02ddcb51f1a2b83e2c4"}, "author": "Steve Gardner, USA TODAY Sports", "url": "http://www.msn.com/en-us/sports/mlb/six-pivotal-players-to-watch-in-the-alcs/ar-AAfvtGu", "ord_in_thread": 0, "title": "Six pivotal players to watch in the ALCS", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Six pivotal players to watch in the ALCS USA Today Sports 16 hrs ago by Steve Gardner, USA TODAY Sports\n© David Banks, USA TODAY Sports David Banks, USA TODAY Sports KANSAS CITY, Mo. – Every year, it seems there are certain players who are able to raise their games in the playoffs and propel their teams to victory.\nAdChoices Let’s take a look at which members of the Kansas City Royals and Toronto Blue Jays could have a significant impact on the outcome of this year’s American League Championship Series.\nSS Troy Tulowitzki, Blue Jays\n© Kim Klement/USA TODAY Sports Oct 2, 2015; St. Petersburg, FL, USA; Toronto Blue Jays shortstop Troy Tulowitzki (2) singles during the sixth inning against the Tampa Bay Rays at Tropicana Field. One of Toronto’s key acquisitions at the trade deadline, Tulowitzki has battled injuries and struggled at the plate (.239/.317/.380 slash line) since joining the Jays.\nHe was even worse in the Division Series, going 2-for-21 (.095) with a homer and four RBI.\n“I haven’t been (much of) an offensive player since I came back, but at the same time I try to contribute,” the two-time Gold Glove award winner said Thursday. “I said that since I was acquired by the Blue Jays I would help us win any way I can and I think I’ve done that defensively.”\nTulowitzki’s career .297/.369/.504 slash line shows he can be a huge asset on offense. If he starts hitting, it could make the majors’ most potent offense almost unstoppable.\n3B Mike Moustakas, Royals\n© Jon Durr/Getty Images Mike Moustakas of the Kansas City Royals dives to field the ball against the Chicago White Sox during a game on Sept. 29, 2015 in Chicago. The White Sox won 4-2.\nOne of last year’s postseason heroes, Moustakas hit five playoff homers after totaling only 15 during the regular season. The momentum carried over into 2015 as he set career-highs in batting average, home runs, RBI and runs scored in earning his first All-Star berth.\nHowever, things went south in the Division Series as Moose turned from the hunter into the hunted. Against Houston, he had two hits in 18 at-bats (.111).\nThe Royals can’t expect their pitching staff to throttle the Jays’ bats completely, so more production from Moustakas is critical.\nRP Aaron Sanchez, Blue Jays\n© Vaughn Ridley/Getty Images Aaron Sanchez of the Toronto Blue Jays pitches in the seventh inning while taking on the Texas Rangers in game five of the American League Division Series at Rogers Centre on October 14, 2015 in Toronto, Canada. The Royals bullpen was a deadly weapon last postseason – and it’s been just as effective this season (despite the injury to closer Greg Holland).\nOne way for the Jays to prevail is for their bullpen to match zeroes with the Royals in the late innings. But will Sanchez have the stamina to do it, especially with lefty setup man Brett Cecil out for the rest of the playoffs with a torn calf muscle?\nSanchez pitched in all five games of the Division Series vs. Texas and didn’t allow a run over 5 1/3 innings. He usually serves as the bridge to 20-year-old closer Roberto Osuna, who was fantastic during the regular season (2.58 ERA, 20-for-23 in save opportunities) and has tossed 5 2/3 shutout innings in the playoffs.\nSP Yordano Ventura, Royals\n© Orlin Wagner/AP Kansas City Royals starting pitcher Yordano Ventura throws during the first inning in Game 1 of baseball's American League Division Series against the Houston Astros, Thursday, Oct. 8, 2015, in Kansas City.\nIn order for the Royals to be successful against the Jays’ predominantly right-handed hitting lineup, their pitchers need to gain control of the inner half of the plate.\nManager Ned Yost even said as much on Thursday. “We’ll pitch inside aggressively,” he noted. “That’s a power-laden club over there. We’re going to formulate a really good game plan and try to go out and execute.”\nThe pitcher with the best chance to do that is Ventura, who had the highest average fastball velocity of all qualified major league starters this year at 96.3 mph.\nHe also hit nine batters this season, which tied for the most on the team. He’s also very emotional on the mound, which can sometimes get on opponents’ nerves. After a benches-clearing incident the last time these two teams met because of batters getting hit, Ventura may need some help navigating the rough waters.\nC Russell Martin, Blue Jays\n© Tommy Gilligan/USA TODAY Sports Feb 23, 2015; Dunedin, FL, USA; Toronto Blue Jays catcher Russell Martin (55) blocks a pitch during morning work outs at Bobby Mattick Training Center. While Toronto looks to overpower the opposition with extra-base hits, Kansas City prefers to take a small-ball approach. The Royals have by far the lowest strikeout rate in the majors (15.9% of all plate appearances) and they like to steal bases (104, second in the AL).\nIn addition, Royals manager Ned Yost has maximized the speed on his roster in the postseason, including speedsters Terrence Gore, Jarrod Dyson and Paolo Orlando as reserves in the Division Series.\nThat puts the pressure on Martin, who threw out a major league-best 44% of the baserunners attempting to steal on him this season. If Martin can help control the Royals running game, those runs saved could be the difference.\nHowever, the Jays have had success with Game 1 starter Marco Estrada throwing to backup catcher Dioner Navarro. So look for Navarro to get the start in the series opener.\nDH Kendrys Morales, Royals\n© John Rieger/USA TODAY Sports Kansas City Royals designated hitter Kendrys Morales hits a solo home run against the Houston Astros in the second inning in game one of the ALDS at Kauffman Stadium on Oct. 8, 2015 in Kansas City, Mo. His three-run homer in Game 5 of the Division Series was the dagger that sent the upstart Astros packing. It was just another piece of an incredible comeback season for the 32-year-old.\nStaying healthy was the biggest key as Morales drove in 106 runs in a career-high 158 games and gave the Royals some unexpected power from the DH slot. He’s hit both left-handers and right-handers equally well and his home/road splits are almost identical.\nWhile center fielder Lorenzo Cain has been the team’s MVP, Morales has been its most pleasant surprise.\nHowever, he has to be in the lineup to be a difference-maker – and Yost has shown a tendency to remove him late in games for a pinch-runner, even when there seems to be little strategic benefit to i\nGo to MSN Home", "external_links": ["http://www.usatoday.com/sports/", "http://go.microsoft.com/fwlink/?LinkID=286759"], "published": "2015-10-16T03:00:00.000+03:00", "crawled": "2015-10-17T01:25:49.440+03:00", "highlightTitle": ""}