{"organizations": ["Phoenix Suns", "Suns", "Sacramento Kings", "Talking Stick Resort Arena", "Markieff Morris"], "uuid": "74cbe21b8425fe2c6325fadc3138ebf4d58bf5ca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.azcentral.com", "main_image": "http://www.gannett-cdn.com/-mm-/dd2ee2550415aaca380799caf201ebf201ec4677/c=0-215-3400-2136&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/10/07/Phoenix/Phoenix/635798567738489862-Markieff.jpg", "site_section": "http://rssfeeds.azcentral.com/phoenix/sports", "section_title": "Phoenix - Sports", "url": "http://www.azcentral.com/story/sports/nba/suns/2015/10/07/markieff-morris-phoenix-suns-fans-moving/73486564/", "country": "US", "title": "Suns fans greet Markieff Morris with cheers", "performance_score": 0, "site": "azcentral.com", "participants_count": 0, "title_full": "Suns fans greet Markieff Morris with cheers", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T06:40:00.000+03:00", "replies_count": 0, "uuid": "74cbe21b8425fe2c6325fadc3138ebf4d58bf5ca"}, "author": "", "url": "http://www.azcentral.com/story/sports/nba/suns/2015/10/07/markieff-morris-phoenix-suns-fans-moving/73486564/", "ord_in_thread": 0, "title": "Suns fans greet Markieff Morris with cheers", "locations": ["Phoenix"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Paul Coro", "Markieff Morris", "Michael"], "text": "Markieff Morris, Phoenix Suns fans moving on <!--iframe--> Paul Coro , azcentral sports 8:40 p.m. MST October 7, 2015 Phoenix Suns forward Markieff Morris is introduced before playing against the Sacramento Kings in a preseason game at Talking Stick Resort Arena in Phoenix on Oct. 7, 2015. (Photo: Michael Chow/azcentral sports) 6 CONNECT 2 TWEET LINKEDIN COMMENT EMAIL MORE \nMarkieff Morris was willing to earn back the support of Suns fans, but it came easier than expected. \nFor most of the past two months, Markieff Morris fell out of favor with many Suns fans for his media comments and tweets about wanting out of Phoenix, but it did not sound like it Wednesday night when he was introduced in the starting lineup with nary a boo. \nMorris bounded off the bench and body-slammed Archie Goodwin and P.J. Tucker with the same exuberance that he showed with his early-game play in the Suns’ preseason opener against Sacramento at Talking Stick Resort Arena. Phoenix Suns XTRA app: Get latest news, scores, photos \n“I’ll win them back,” Morris said after Wednesday morning’s shootaround as he walked into the locker room. “That’s all I can say about that.” \nMorris had heard some of the fans’ furor Saturday night when he did not play in the team’s intrasquad scrimmage at Veterans Memorial Coliseum but was still introduced. The crowd of about 8,000 delivered a mix of cheers and boos with the cheers eventually winning out. \n“It is what is,” Morris said, “I’ll win them back.” \nFans have been quick to forgive Morris in the past, barely showing any displeasure for when he criticized Suns home crowds after a Feb. 28 loss in which the Suns set a franchise record low for scoring in a half. \nBy the time the Suns returned home again nine days later, he was barely booed and then was cheered normally for the remaining 11 home games. Morris, 26, played all 82 games last season, posting career-high averages for points (15.3), rebounds (6.2), assists (2.3), steals (1.2) and minutes (31.5). Phoenix Suns' Henry Sims 'anxious' to start preseason \n“He’s going to know there’s going to be some cheers, some boos,” Suns coach Jeff Hornacek said. “He’s just going to go out there and show what he can do and play like he always does and not worry about it. \n“He’s been great with the guys. When you get around your teammates and you’re around those guys every day, you’re in there to win. He’s a competitor and that’s what competitors do. The lights will go on and they’ll be ready to go.” \nMorris was engaged early, taking five of the Suns’ first seven shots, chasing down a loose-ball save and strongly stripping Kings star DeMarcus Cousins. \nHornacek noted how Morris was slated to be the starting power forward in 2013 but got suspended for the opener. Channing Frye started in his place and never surrendered the job while Morris embraced the reserve role. Suns' Alex Len helped by Tim Duncan, Tyson Chandler \n“Certain guys are competitors, they want to win and they’ll do whatever it takes and I think he’s one of those guys,” Hornacek said. \nThis summer, Morris sought a trade from Phoenix after being upset that the Suns traded his twin, Marcus, to Detroit in July. The move came at the start of contract extensions that they hoped would keep them together but Marcus was dealt in order to clear salary cap room for pursuing another power forward, LaMarcus Aldridge, who chose San Antonio. \nAfter talking to his hometown newspaper, the Philadelphia Inquirer , and tweeting about not having a future in Phoenix, Morris showed up for the start of training camp saying, “I want to be here ,” and has been a model teammate over the first 10 days. \nBecause he did not join his team over five weeks of voluntary workouts, Morris still needs the preseason to improve his condition but he maintained his strength with his own work. \nWhile it is clear that Morris misses his brother after spending 2 ½ seasons and every summer together, he has been playful with Suns teammates and coaches since camp started and played well. The players, especially returnees like P.J. Tucker, Archie Goodwin and Eric Bledsoe, have embraced his return and characterized it as business as usual, a relief for the Suns after retooling their roster with chemistry more in mind. Former Phoenix Suns center Neal Walk dies at 67 \nPart of those changes included Tyson Chandler, who gives Morris the leader he said the team needed and a different presence alongside him on the frontline. \n“He’s a veteran big and a guy who has been around the league for a long time,” Morris said. “He does what he do great. And that’s being a center and protecting the rim defensively, catching lobs offensively and a finishing force.” \nThe Suns would like Morris to get his 3-point shooting percent to 35 or 36 percent but he should also feel a difference on the block with Chandler nearby. \n“Tyson will really occupy a guy on that weak block,” Hornacek said. “When Tyson’s going for rebounds, they’re not going to be able to come over and help out much. We feel that we have some good shooters out there that if we spaces when he’s in the post, Markieff will basically have his guy one-on-one.” \nFree throws \n* The Suns opened the preseason with a starting lineup of Bledsoe, Brandon Knight, Tucker, Morris and Tyson Chandler. “There might be guys who have earned the right to start, but for the best of the team, we’ll have you come off the bench,” Hornacek said. “We have to see how our mix of guys plays together.” \n* Because there are three reserve shooting guards (Sonny Weems, Devin Booker and Goodwin), Hornacek said Weems and Booker could see preseason time at small forward to balance minutes. On 18-year-old Booker, Hornacek said, “I don’t want to put pressure on the kid but I think he knows how to play. That gives us coaches confidence to put him in the game … I think, as a rookie, he’s going to get time.” \n* Sacramento coach George Karl on the Suns: “They kind of had a crazy year last year. I think you’re going to see a hungry team maybe trying to regroup a little bit.” \n* The Suns’ six-game preseason ties for the franchise’s shortest with 1975 and 1981. The NBA could shorten it more next year to add more off-days to next regular season. Hornacek said it would give teams with returning cores an advantage but added, “Four games is good enough. It might hurt playing some of the young guys that you’re really trying to look at. Maybe summer league becomes more important.” \nReach Paul Coro at paul.coro@arizonarepublic.com or (602) 444-2470. Follow him at twitter.com/paulcoro. \nPhotos from the Suns-Kings preseason game: Phoenix Suns forward Markieff Morris is taken out against the Sacramento Kings in preseason NBA action at Talking Stick Resort Arena in Phoenix October 7, 2015. Michael Chow/azcentral sports Phoenix Suns forward P.J. Tucker drives past Sacramento Kings forward Rudy Gay during preseason NBA action at Talking Stick Resort Arena in Phoenix October 7, 2015. Michael Chow/azcentral sports Phoenix Suns guard Eric Bledsoe looks to pass around Sacramento Kings center DeMarcus Cousins during preseason NBA action at Talking Stick Resort Arena in Phoenix October 7, 2015. Michael Chow/azcentral sports Phoenix Suns guard Brandon Knight pushes the ball up against the Sacramento Kings preseason NBA action at Talking Stick Resort Arena in Phoenix October 7, 2015. Michael Chow/azcentral sports Phoenix Suns center Tyson Chandler puts a shot up past Sacramento Kings DeMarcus Cousins (15) and center Willie Cauley-Stein during preseason NBA action at Talking Stick Resort Arena in Phoenix October 7, 2015. Michael Chow/azcentral sports Phoenix Suns forward T.J. Warren lays the ball in against the Sacramento Kings during preseason NBA action at Talking Stick Resort Arena in Phoenix October 7, 2015. Michael Chow/azcentral sports Phoenix Suns forward T.J. Warren drives around Sacramento Kings forward Omri Casspi during preseason NBA action at Talking Stick Resort Arena in Phoenix October 7, 2015. Michael Chow/azcentral sports Phoenix Suns forward T.J. Warren dunks in front of Sacramento Kings forward Eric Moreland during preseason NBA action at Talking Stick Resort Arena in Phoenix October 7, 2015. Michael Chow/azcentral sports Phoenix Suns guard Eric Bledsoe shoots while defended by Sacramento Kings guard Darren Collison during preseason NBA action at Talking Stick Resort Arena in Phoenix October 7, 2015. Michael Chow/azcentral sports Phoenix Suns center Alex Len is fouled by Sacramento Kings forward/center Eric Moreland during preseason NBA action at Talking Stick Resort Arena in Phoenix October 7, 2015. Michael Chow/azcentral sports Phoenix Suns center Alex Len is fouled by Sacramento Kings forward/center Eric Moreland during preseason NBA action at Talking Stick Resort Arena in Phoenix October 7, 2015. Michael Chow/azcentral sports Phoenix Suns guard Eric Bledsoe puts a shot up against the Sacramento Kings during preseason NBA action at Talking Stick Resort Arena in Phoenix October 7, 2015. Michael Chow/azcentral sports Phoenix Suns players react to a dunk by forward Jon Leuer over Sacramento Kings center DeMarcus Cousins during preseason NBA action at Talking Stick Resort Arena in Phoenix October 7, 2015. Michael Chow/azcentral sports Phoenix Suns forward Jon Leuer goes in for a dunk against Sacramento Kings center DeMarcus Cousins during preseason NBA action at Talking Stick Resort Arena in Phoenix October 7, 2015. Michael Chow/azcentral sports Phoenix Suns forward Markieff Morris is introduced before playing the Sacramento Kings in preseason NBA action at Talking Stick Resort Arena in Phoenix October 7, 2015. Michael Chow/azcentral sports Phoenix Suns forward Markieff Morris is introduced before playing the Sacramento Kings in preseason NBA action at Talking Stick Resort Arena in Phoenix October 7, 2015. Michael Chow/azcentral sports Phoenix Suns forward Markieff Morris is introduced before playing the Sacramento Kings in preseason NBA action at Talking Stick Resort Arena in Phoenix October 7, 2015. Michael Chow/azcentral sports Exterior of Talking Stick Resort Arena, formerly known as US Airways Center, in Phoenix on October 7, 2015. Michael Chow/azcentral sports Like this topic? You may also like these photo galleries: Replay", "external_links": [], "published": "2015-10-08T06:40:00.000+03:00", "crawled": "2015-10-08T07:52:43.934+03:00", "highlightTitle": ""}