{"organizations": ["NATE BARNES Associated Press"], "uuid": "a2aa3c51c47a0fce64b4236f4ea5e5fe02dfa140", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribtown.com", "main_image": "http://cdn1.tribtown.com/st_assets/images/the_tribune_sq.jpg", "site_section": "http://www.tribtown.com//feed/sec/6000", "section_title": "TribTown.com - Sports News", "url": "http://www.tribtown.com/view/story/50bd847394cd4e0eba4394f7dd1c8b88/FBC--T25-Pitt-Pass-Rush", "country": "US", "title": "Sack-happy Pitt off to strong start in first season under Pat Narduzzi", "performance_score": 0, "site": "tribtown.com", "participants_count": 0, "title_full": "Sack-happy Pitt off to strong start in first season under Pat Narduzzi", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T02:05:00.000+03:00", "replies_count": 0, "uuid": "a2aa3c51c47a0fce64b4236f4ea5e5fe02dfa140"}, "author": "", "url": "http://www.tribtown.com/view/story/50bd847394cd4e0eba4394f7dd1c8b88/FBC--T25-Pitt-Pass-Rush", "ord_in_thread": 0, "title": "Sack-happy Pitt off to strong start in first season under Pat Narduzzi", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Pat Narduzzi", "Pat Narduzzi Sack-happy Pitt", "Pitt"], "text": "Sack-happy Pitt off to strong start in first season under Pat Narduzzi By NATE BARNES Associated Press   7:05   7:05   \nPeople: \nPennsylvania (896) \nPITTSBURGH — Pat Narduzzi is off to a fast start at Pittsburgh with his aggressive defensive approach. \nHalfway through Narduzzi's first season as head coach, the Panthers are ranked for the first time in five years and lead the Atlantic Coast Conference's Coastal Division with a 5-1 record. \nNo. 25 Pitt's defense is 17th nationally, allowing 300.8 yards per game behind a pass rush that leads the ACC with 22 sacks \n\"If you're getting tackles for losses and sacks it helps you,\" said Narduzzi, the 2013 Broyles Award winner at Michigan State as the nation's top assistant coach. \"It gets you off the field on third down.\" \nThe Panthers are averaging a conference-best 3.67 sacks. \n\"Anytime you're sacking the quarterback good things are going to happen for you on the next down,\" Narduzzi said, \"because they're behind the sticks and it makes it a little easier for the play-caller to call a defense.\" \nEleven Panthers have at least one sack, led by linebacker Matt Galambos with four. \nEnd Ejuan Price has 3 1/2 and is a player Narduzzi calls \"scary\" when rushing the passer. \nShakir Soto bookends the line with Price and has two sacks. Behind them, outside linebackers Mike Caprara and Nicholas Grigsby each have a pair. \n\"Inside, we've got a group of tackles that can push the pocket,\" Narduzzi said. \"Our four-man pressure's been good and we've been dialing up some zone pressures that have helped us.\" \nTyrique Jarrett is one of those tackles creating pressure on the interior, with 1 1/2 sacks with 5 1/2 tackles for loss this season. He, like many other players, enjoy playing in Narduzzi's simplified system that has allowed many players like himself to excel. \n\"First of all it's just exciting,\" Jarrett said. \"It's the energy we all bring to the table.\" \nCenter Artie Rowell and the rest of Pitt's offensive line face the energetic pass rush that's dominated on Saturdays daily in practice. He says their visibly-arduous work in the middle of the week translates to success on gamedays. \n\"They are non-stop,\" Rowell said. \"Our defensive players are soaked from head-to-toe when they come off the practice field.\" \nCome Saturday, he's glad those defenders wear the same uniform he does. \n\"They are all over the field,\" Rowell said. \"They're getting pressure on the quarterback.\" \nAnd while there is a certain degree of strategy that goes into Pitt's defensive schemes, Jarrett doesn't think there's a secret to the Panthers' success rushing opposing passers. \n\"I think it's our coaches letting us be us,\" Jarrett said. \"Letting us execute and letting us do what we're good at. There's really nothing to it, it's just us doing what we're doing best.\" \nAll content copyright ©2015 The Tribune, a division of Home News Enterprises unless otherwise noted.", "external_links": [], "published": "2015-10-22T02:05:00.000+03:00", "crawled": "2015-10-22T03:52:00.982+03:00", "highlightTitle": ""}