{"organizations": [], "uuid": "6ee18144dae74d1736977c422a49c9eb2dd467b3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports/mlb", "section_title": "MLB News, Scores, Schedule, Standings, Stats, Photos, Videos - Baseball - MSN Sports", "url": "http://www.msn.com/en-us/sports/mlb/neill-sheridan-dies-%e2%80%94-said-to-have-hit-613-foot-homer/ar-AAfvlfa", "country": "US", "title": "Neill Sheridan dies — said to have hit 613-foot homer", "performance_score": 0, "site": "msn.com", "participants_count": 1, "title_full": "Neill Sheridan dies — said to have hit 613-foot homer", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "6ee18144dae74d1736977c422a49c9eb2dd467b3"}, "author": "John Shea", "url": "http://www.msn.com/en-us/sports/mlb/neill-sheridan-dies-%e2%80%94-said-to-have-hit-613-foot-homer/ar-AAfvlfa", "ord_in_thread": 0, "title": "Neill Sheridan dies — said to have hit 613-foot homer", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Neill Sheridan dies — said to have hit 613-foot homer San Francisco Chronicle 6 hrs ago By John Shea © Michael Macor, The Chronicle Former baseball player Neill Sheridan holds the very baseball and bat that he hit a 613 foot home run with back in 1953, as seen on Tuesday Jan. 21, 2014, at the home of his granddaughter in Antioch, Calif. Former professional baseball player Neill Sheridan is credited with hitting the longest home run at the time back in 1953, a measured 613 feet. Neill Sheridan, an outfielder in the old Pacific Coast League who supposedly hit the farthest home run in history, died Thursday in Antioch. He was 93.\nAdChoices Mr. Sheridan died peacefully while surrounded by family members a month after suffering from pneumonia, said his granddaughter Tami Hopkins.\nIn his 12-year pro career in the ‘40s and ‘50s, Mr. Sheridan played mostly in the PCL, including several stints with the San Francisco Seals and one with the Oakland Oaks - and played two games for the 1948 Boston Red Sox, striking out in his only major-league at-bat.\n\"Ted Williams and I were talking, and Joe DiMaggio comes out and asks me if I'd like to meet Babe Ruth,” said Mr. Sheridan, reminiscing about a day in spring training for a Chronicle story published in January 2014.\nA Sacramento native, Mr. Sheridan grew up in Berkeley, played football at USF and joined the Seals in 1943, playing for legendary manager Lefty O’Doul, who Mr. Sheridan called “Mr. San Francisco.”\nHis best PCL season was 1947 when he hit .286 with 16 homers and 95 RBIs, which prompted a trade to the Red Sox. He met Ruth in the spring of 1948, shortly before the Babe died, and got called up late in the season.\n“Regrets? No. Quite a thrill, really,” Mr. Sheridan said of his short big-league experience.\nIn 1953, while playing for the Sacramento Solons, Mr. Sheridan hit a ball 613.8 feet, as legend has it, the longest homer in history up to that point.\nAccording to accounts in the Sacramento Bee and Sacramento Union, a man said he had found the ball in the back seat of his car with the rear window smashed. A parking lot employee claimed to have heard glass break at the time of the homer.\nThe Solons measured the distance at 620 feet and hired a local surveying company for a more precise reading: 613.8 feet.\nMr. Sheridan’s career ended a year later. He worked at an Orinda grocery store and Pleasant Hill liquor store and lived with his wife Irene in Pleasant Hill more than 60 years.\n“He was so humble,” Hopkins said. “He met Joe DiMaggio and so many great ballplayers but wouldn’t go around saying who he was. Two days ago, he got fan mail.\n“When I’d go to Giants games, I’d wear his Seals jersey, and old-timers would come up and talk about the PCL or say he coached their sons’ football team or basketball team or say they worked with him in a grocery store.\n“It’s amazing how small the world is.”\nMr. Sheridan is survived by his wife, one child, three granddaughters and five great grandchildren.\nA service will be at Christ the King Church in Pleasant Hill on Nov. 14.\nJohn Shea is a San Francisco Chronicle staff writer. E-mail: jshea@sfchronicle.com\nGo to MSN Home", "external_links": ["http://go.microsoft.com/fwlink/?LinkID=286759"], "published": "2015-10-16T03:00:00.000+03:00", "crawled": "2015-10-17T01:24:06.710+03:00", "highlightTitle": ""}