{"organizations": [], "uuid": "fbd01927acf9fc3cecca666c15209bfbd2a6d5d5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.fox8live.com", "main_image": "http://WLOX.images.worldnow.com/images/9008204_G.jpg", "site_section": "http://www.fox8live.com/", "section_title": "New Orleans News, Weather, Saints - FOX 8 WVUE New Orleans News, Weather, Sports, Social", "url": "http://www.fox8live.com/story/30254202/dad-of-os-sexual-assault-victim-opens-up-about-shocking-crime", "country": "US", "title": "Father of sexual assault victim opens up about shocking crime", "performance_score": 0, "site": "fox8live.com", "participants_count": 1, "title_full": "Father of sexual assault victim opens up about shocking crime - FOX 8 WVUE New Orleans News, Weather, Sports, Social", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T04:22:00.000+03:00", "replies_count": 0, "uuid": "fbd01927acf9fc3cecca666c15209bfbd2a6d5d5"}, "author": "Trang Pham-Bui", "url": "http://www.fox8live.com/story/30254202/dad-of-os-sexual-assault-victim-opens-up-about-shocking-crime", "ord_in_thread": 0, "title": "Father of sexual assault victim opens up about shocking crime", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "OCEAN SPRINGS, MS (WLOX) - The father of an Ocean Springs woman who was brutally beaten and sexually assaulted is revealing his daughter's identity, and opening up about the crime that shocked the community.\nBarbi Jalanivich was attacked on September 10 while working at the Dominion Apartments on Holcomb Boulevard.\nIt's a WLOX policy to not identify victims of sexual assaults, but in this case, her dad wanted to share her story to put a face to this horrible crime. Her family and friends are also seeking the community's support to help Barbi heal.\n\"Oh, it's every bit of a miracle. This guy left her for dead,\" said Danny Jalanivich.\nJalanivich is living every parent's worst nightmare. Last month, while at work at the Ocean Springs Harbor, Jalanivich's cell phone rang. The voice on the other side was his 33-year old daughter Barbi.\n\"She said, 'Daddy, somebody has beat me up and I'm hurt. I basically lost it,\" said Jalanivich.\nJalanivich rushed to the Dominion Apartments and got there before paramedics arrived. Barbi had been attacked right inside her leasing office. Nothing could prepare Jalanivich for what he was about to see.\n\"You can't consider anybody who does that a human being. I mean, choke somebody out and they pass out and then beat them. She took a beating that most men couldn't take,\" said Jalanivich.\nBarbi suffered extensive injuries: a split left ear, bleeding and swelling in her brain, and her jaw was fractured in at least three places. She was also sexually assaulted.\n\"I just couldn't be there to help her. You know, anybody that's got children...\" That's when Jalanivich choked up.\nHe said Barbi had passed out and all she could remember was waking up and walking to a nearby apartment for help.\n\"I hurt for my daughter. I'm sure it'll always be with her, but she's strong,\" he said.\nBarbi did not have insurance and is not able to go back to work yet. She is also raising her 11-year old daughter Kya. Family and friends are organizing a golf tournament and seeking donations to help offset some of her medical and living expenses.\n\"Just to let her know the community's still behind her, her family's behind her, and her daddy's behind her,\" he said.\nJalanivich said it will take awhile before Barbi can recover physically and emotionally.\n\"Just getting her back to her happy little self is what we're trying to do,\" he said.\nAnd he knows God will always be at his daughter's side.\n\"He protected Barbi, and I thank Him everyday that I could talk to her. That's saving grace right there,\" he said. \"One thing I'll always remember that she told me. She said, 'Daddy, he's not going to get the best of me.'\"\nBarbi still has screws in her jaw and will need a lot of dental work to fix her cracked and chipped teeth. She is also seeing a mental health expert.\nThe golf tournament for Barbi will be held October 24 at Hickory Hills Country Club in Gautier. You can contact Hickory Hills at (228) 497-2372 for more information. You can also send an email to jalanivich@yahoo.com or call him at (228) 219-0325.\nMeanwhile, the suspect, 24-year old Cameron May of Biloxi, remains in a Florida jail. He is charged with aggravated assault. The district attorney's office is still working to extradite May to Mississippi.\nCopyright 2015 WLOX . ", "external_links": [], "published": "2015-10-14T04:22:00.000+03:00", "crawled": "2015-10-14T20:28:19.389+03:00", "highlightTitle": ""}