{"organizations": [], "uuid": "520a4b6016009041c4e28b1c5c1c767b341d1df4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "herald-review.com", "main_image": "http://bloximages.chicago2.vip.townnews.com/herald-review.com/content/tncms/assets/v3/editorial/8/84/88427d1c-0c71-55d9-b07e-4b823b929257/561d89715bbf5.image.jpg?resize=620%2C375", "site_section": "http://herald-review.com/search/?f=rss&c[]=sports/high-school/soccer&sd=desc&s=start_time", "section_title": "herald-review.com - RSS Results in sports/high-school/soccer", "url": "http://herald-review.com/sports/windsor-a-m-squads-have-rough-paths/article_78808fbb-f6cf-531b-8eba-2a3e27a6e3ce.html", "country": "US", "title": "Windsor, A&M squads have rough paths", "performance_score": 0, "site": "herald-review.com", "participants_count": 1, "title_full": "Windsor, A&M squads have rough paths", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T11:30:00.000+03:00", "replies_count": 0, "uuid": "520a4b6016009041c4e28b1c5c1c767b341d1df4"}, "author": "AREN DOW H&amp;R Staff Writer", "url": "http://herald-review.com/sports/windsor-a-m-squads-have-rough-paths/article_78808fbb-f6cf-531b-8eba-2a3e27a6e3ce.html", "ord_in_thread": 0, "title": "Windsor, A&M squads have rough paths", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Buy Now Herald & Review, Jim Bowling \nShelbyville coach Lisa Peifer has pushed the right buttons this season as the Rams have rarely even been taken to three sets. \nVolleyball postseason pairings were released over the weekend, revealing all of the classes' playoff pictures: \nClass 1A -- Windsor/Stew-Stras was named the No. 2 seed in a LSA sub-sectional just after beating Effingham St. Anthony, the 3 seed, in three sets last Tuesday. The two will likely meet again in the National Trail Tournament this weekend that should help fuel a possible postseason matchup. \nW/SS coach Ronda Schlechte hoped the road through the postseason would gradually work its way up in difficulty. Instead, the Hatchets drew another dangerous team in Effingham St. Anthony in their own regional. \n“I was a little disappointed to see St. Anthony in our regional, because I thought we might be split up,” Schlechte said. “So we’ll have to see how it goes.” \nThey might have been in different regionals had W/SS been ranked ahead of Chrisman, who ended up with the one-seed in the sub-sectional. Chrisman had a long undefeated run before a couple of recent losses. \n“We don’t know anything about them, and that’s what makes it tough about seeding all those regional teams,” Schlechte said. “They don’t even play teams that we see.” \nSouth Central picked up the No. 1 seed in the St. Elmo Sectional, which was more of a formality. The Cougars are 19-4 and the soonest they would play someone they've lost to this season is in the super-sectional against New Athens. \nRaymond Lincolnwood edged out Mount Pulaski as the top seed for a Pawnee sub-sectional. The Toppers will rely on Maddy Davis to anchor the offense, but freshman Skylar Hayes has become a reliable second option. Mount Pulaski is looking for its seventh straight regional and 31st in the last 32 years. \nClass 2A -- Pana landed a top seed in what's essentially the South Central conference and a couple of other teams. The Panthers have been strong in conference play so far, and they'll get another reward in playing the regional at home. \nCentral A&M drew a tough postseason run with both Williamsville and Pleasant Plains in its sub-sectional. The 20-win Raiders are the 3-seed, and because the 1 and 4 seeds are hosting, A&M will have to go through Williamsville for a regional title. \nMaroa-Forsyth was rewarded for its play of late, getting a higher seed than St. Thomas More despite the Sabres winning the only match before the seeds were released. \nClass 3A -- Mount Zion looks to have a clear run to the sectional finals, as the top-seeded Braves lead a group that includes Mattoon, Champaign Central and Effingham. The Braves have beaten Mattoon three times this season and look to have the advantage in their half of the sectional. There's a slew of talented teams looming on the sectional's other side, though. \nThat includes Quincy Notre Dame (23-3), the other half's top seed, and Springfield Sacred Heart-Griffin, which upset QND for the regional title last year. First loss \nShelbyville (26-1) lost its first game of the year, a 25-16, 25-20 match to 3A Rochester in the Shebyville/Pana Tournament championship. \nDon’t count coach Lisa Peifer as someone who sees the silver lining in a tough loss, but there was at least consolation knowing they beat Rochester earlier in the day 24-26, 27-25, 15-10. \n“Being tested like that, it’s: Can my kids rise to the occasion? Can we do what’s necessary? It’s a big test for us,” Peifer said. \nThat’s something Shelbyville hasn’t had too much of this season. The first match against Rochester was just the fifth time the Rams were taken to three games. Peifer said she’s happy with seeing how her team responds when they need a point to avoid a loss. \n“It’s good. Most of the time we’ve gone in and winning, I don’t want to say easy, but pretty well controlling things that are happening,” she said. “It’s good when people push back and we see how we respond. “ Spotless Shoes \nTeutopolis fall baseball isn't the only team with a perfect record -- the girls tennis team is 13-0 on the season. Five matches have been 9-0 wins for the Shoes. \nT-Town wrapped up the regular season against Champaign St. Thomas More before sectional play starts on Friday. The Shoes will look to reclaim the sectional title after winning two of the past three years. Doing the dirty work \nShelbyville’s rotation of six solid hitters gives the Rams versatility and there’s depth with having two solid setters as well. \nBut there may be no more important player to the team than senior libero Blair Johnston. \n“She’s our anchor. That’s all there is to it,” Shelbyville coach Lisa Peifer said. “She does everything for us – her service, and her passing has been so solid all season long. \n“Recently, she’s a player that doesn’t get a lot of love as far as that stuff goes because people don’t look at that. They love big swings and putting the ball on the floor.” \nPeifer said Johnston’s done well in reading opposing attacks and knowing where to be on the floor. She’s come a long way in her first full year of starting for the Rams. \n“I think right now, the way she’s playing and what we’re letting her take control of, the kids are like, ‘Blair’s got it, Blair’s got it,’” Peifer said. Switch up \nNot only is Shelbyville’s attack never resting as the Rams have multiple hitters they can sub in, the Rams’ kill leader also brings a wrinkle to the offense. \nClaudia Watson is left-handed, and it sometimes leaves teams unprepared in defending her. \n“It’s a total adjustment on the block. It gives us the opportunity – very few teams attack a whole lot from the right-hand side,” Peifer said, “so defenses a lot of times are not used to seeing that. \n“In her case, she’s pretty special because she can do anything she wants to. I see they’ll be digging seam and she goes line, or they’re digging line and she goes seam.” \nadow@herald-review.com|(217) 421-6978", "external_links": [], "published": "2015-10-14T11:30:00.000+03:00", "crawled": "2015-10-14T12:51:12.743+03:00", "highlightTitle": ""}