{"organizations": ["New York Giants", "USA Today"], "uuid": "27e689e15817f0ba48212765726d90a01bd9aa1e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailyrecord.com", "main_image": "http://www.gannett-cdn.com/-mm-/56cb509070c9f62cc788045a7a3c3115103b3b05/c=0-74-3720-2176&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/10/11/NJGroup/AsburyPark/635801493403304835-giantsniners2.jpg", "site_section": "http://rssfeeds.dailyrecord.com/morristown/sports", "section_title": "Morristown - Sports", "url": "http://www.dailyrecord.com/story/sports/high-school/soccer/2015/10/11/kinnelon-villawalsh-soccer/73534488/", "country": "US", "title": "What were the greatest moments in Giants-49ers rivalry?", "performance_score": 0, "site": "dailyrecord.com", "participants_count": 0, "title_full": "What were the greatest moments in Giants-49ers rivalry?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T15:43:00.000+03:00", "replies_count": 0, "uuid": "27e689e15817f0ba48212765726d90a01bd9aa1e"}, "author": "", "url": "http://www.dailyrecord.com/story/sports/high-school/soccer/2015/10/11/kinnelon-villawalsh-soccer/73534488/", "ord_in_thread": 0, "title": "What were the greatest moments in Giants-49ers rivalry?", "locations": ["San Francisco"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Dashon Goldson", "Stephen Edelson", "Hakeem Nicks"], "text": "What were the greatest moments in Giants-49ers rivalry? Stephen Edelson , @steveedelsonAPP 8:43 a.m. EDT October 11, 2015 New York Giants wide receiver Hakeem Nicks (88) tries break free from San Francisco 49ers free safety Dashon Goldson (38) during second half action at Candlestick Park in the 2011 NFC Championship game in San Francisco. (Photo: USA Today) 4 CONNECT 12 TWEET LINKEDIN COMMENT EMAIL MORE \nEAST RUTHERFORD - So Sunday night’s primetime showdown between the San Francisco 49ers (1-3) and the New York Giants (2-2) at MetLife Stadium isn’t exactly a marquee matchup on the Week 5 schedule. \nThe current circumstances, however, can’t diminish in any way the rich history of the rivalry between these two NFC combatants. \nIn fact, it’s difficult to think of two teams separated by an entire continent that have such a storied past in big games over the last three decades. \nThrough different eras for each organization, there have been numerous showdowns with championship implications, with some of the NFL’s greatest stars taking center stage. \nHere’s a look at seven of the most memorable meetings between the two franchises: \n7. Sept. 5, 2002 - 49ers 16, Giants 13: In a season-opening Thursday night game in front of a national audience at Giants Stadium, the Giants dominated play but turned the ball over three times to give the 49ers life. After Tiki Barber’s touchdown run tied the game at 13-13 with less than two minutes to play, quarterback Jeff Garcia drove the visitors downfield, setting up a 36-yard, game-winning field goal by Jose Cortez with six seconds to play. Middletown Super Bowl alum joins heroin fight \n6. Jan. 15, 1994 – 49ers 44, Giants 3: It was a painful end of an era for the Giants, as linebacker Lawrence Taylor and quarterback Phil Simms played the final games of their careers for Big Blue. Because on this day at Candlestick Park it was all Ricky Watters, with the 49ers’ running back rushing for 118 yards and five touchdowns, while catching five passes. \n5. Dec. 3, 1990 – 49ers 7, Giants 3: This Monday night matchup at Candlestick Park was merely a prelude to their NFC Championship game showdown later that season. But the post-game confrontation in which Simms and 49ers safety Ronnie Lott went face mask-to-face mask showed just how high the level of intensity was. The Giants were 10-1 entering a game everyone thought would be replayed in the postseason. \n4. Jan 5, 2003 – 49ers 39, Giants 38: No loss was more painful for Giants’ fans than NFC Wildcard game in which they had a 38-14 lead late in the third quarter before quarterback Jeff Garcia led the 49ers to 25 unanswered points, including three touchdown drives and a field goal. Still, the Giants had a chance to win when they lined up a 40-yard field goal with six seconds left. But Trey Junkin, in his first game with the team, botched the long snap and the referees missed a blatant pass interference call when holder Matt Allen launched a desperation pass into the end zone. Who are the top 10 Giants quarterbacks of all time? \n3. Jan. 4, 1987 - Giants 49, 49ers 3: After going 14-2 in the regular season, the Giants sent a powerful message as they opened the playoffs on a journey that would end with their first Super Bowl victory. The Giants were up 28-0 in the first half Giants Stadium and were never challenged. The enduring image from the game was the hit Giants nose tackle Jim Burt delivered on 49ers quarterback Joe Montana, knocking him out of the game, with Lawrence Taylor intercepting Montana’s pass and returning it for a touchdown. \n2. Jan. 23, 2012 – Giants 20, 49ers 17 (OT): It became clear the Giants were a team of destiny when they went into Candlestick Park and won the NFC Championship game. David Akers kicked a 25-yard field goal for the 49ers to send the game into overtime. But Giants linebacker Jacquian Williams stripped the ball away from punt returner Kyle Williams, with the Giants recovering before Lawrence Tynes booted the game-winning field goal. \nGiants linebacker Lawrence Taylor (56) recovered a fumble by 49ers running back Roger Craig during the fourth quarter of the NFC Championship in 1991. (Photo: Associated Press) \n1. Jan. 20, 1991 – Giants 15, 49ers 13: The Giants were heavy underdogs against the two-time defending world champions when they made the cross country trip for the NFC Championship game. But with quarterback Jeff Hostetler performing steadily in place of the injured Phil Simms, and a Bill Belichick-orchestrated defense that stymied the high-powered 49ers, they shocked the football world on Matt Bahr’s 42-yard field goal as time expired. \nStaff writer Stephen Edelson is an Asbury Park Press columnist: sedelson@gannettnj.com 4 CONNECT 12 TWEET LINKEDIN COMMENT EMAIL MORE Read or Share this story: http://on.app.com/1RAXJVy TOP VIDEOS", "external_links": [], "published": "2015-10-11T15:43:00.000+03:00", "crawled": "2015-10-13T12:12:06.809+03:00", "highlightTitle": ""}