{"organizations": ["Newcastle"], "uuid": "de0760b2072164be22f16a681bc55355e29ede02", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sport.co.uk", "main_image": "http://images.sport.co.uk/150x150/d7bc0f9818e4ba1e98b4407eec6ffc80.jpg", "site_section": "http://feeds.feedburner.com/SportcoukNewsRssFeed", "section_title": "General Sports News from Sports.co.uk", "url": "http://www.sport.co.uk/football/newcastles-aleksandar-mitrovic-promises-to-keep-his-cool-in/6976242/", "country": "JE", "title": "Newcastle's Aleksandar Mitrovic promises to keep his cool in Wear-Tyne derby", "performance_score": 0, "site": "sport.co.uk", "participants_count": 0, "title_full": "Newcastle's Aleksandar Mitrovic promises to keep his cool in Wear-Tyne derby", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T12:32:00.000+03:00", "replies_count": 0, "uuid": "de0760b2072164be22f16a681bc55355e29ede02"}, "author": "", "url": "http://www.sport.co.uk/football/newcastles-aleksandar-mitrovic-promises-to-keep-his-cool-in/6976242/", "ord_in_thread": 0, "title": "Newcastle's Aleksandar Mitrovic promises to keep his cool in Wear-Tyne derby", "locations": ["Wear-Tyne"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Aleksandar Mitrovic"], "text": "Newcastle's Aleksandar Mitrovic promises to keep his cool in Wear-Tyne derby 23 Oct 2015 09:32:02 \ncomments \nNewcastle striker Aleksandar Mitrovic has vowed not to be drawn into doing \"something stupid\" in the heat of the Wear-Tyne derby. \nThe 21-year-old Serbia international heads into Sunday's clash with Sunderland at the Stadium of Light having collected five yellow cards and one red in just 11 games for club and country so far this season. \nHowever Mitrovic, who was also sent off for former club Anderlecht against Bruges - the biggest clash in Belgian club football - earlier in his career, insists he has learnt his lesson after receiving his marching orders against Arsenal in August and serving a three-game ban. \nHe told the club's official website, www.nufc.co.uk: \"There will be a lot of passion at the next game, but I do not want to make the same mistake that I did against Arsenal and do something stupid. \n\"I want to stay on the level. I know they will try to provoke me, but I will keep my head strong and try to score goals and help my team-mates. \n\"It's a derby. I am only 21 but I have played in a lot of big derbies, big games, and I can say I know how to play these games and score goals in them. \n\"I hope I will continue with my goals and score in my first game against Sunderland.\" \nNewcastle will run out at the Stadium of Light determined to avoid a record sixth successive defeat by their neighbours, but buoyed by last Sunday's 6-2 home victory over Norwich, their first of the new Barclays Premier League campaign. \nThe game will pitch Magpies head coach Steve McClaren against Black Cats counterpart Sam Allardyce - the two were competitors for the England manager's job back in 2006. \nAllardyce will be attempting to follow in the footsteps of his three immediate predecessors at Sunderland and secure a derby victory in just his second game at the helm. \nMcClaren said: \"Whatever manager it is, it's the Premier League, it's the biggest league in the world and you are pitting yourself against some of the biggest managers in the world and in Europe, and Sam is one of them. \n\"He's had an excellent career. He has great experience in the Premier League and every club he goes to, he does a very good job. He will do that at Sunderland.\" Related Sport News", "external_links": [], "published": "2015-10-23T12:32:00.000+03:00", "crawled": "2015-10-23T20:13:58.542+03:00", "highlightTitle": ""}