{"organizations": [], "uuid": "6d2f1c6f74b661759690b73afa3930b9bb1bb257", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sportsnews.com.au", "main_image": "http://sportsnews.com.au/defaultimage.jpg", "site_section": "http://www.sportsnews.com.au/category/rugby-union/feed", "section_title": "Sports News Australia » Rugby Union News", "url": "http://www.sportsnews.com.au/rugby-union/james-oconnor-lets-fly-in-long-statement/159981", "country": "CA", "title": "James O’Connor lets fly in long statement", "performance_score": 0, "site": "sportsnews.com.au", "participants_count": 1, "title_full": "James O’Connor lets fly in long statement", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T13:00:00.000+03:00", "replies_count": 0, "uuid": "6d2f1c6f74b661759690b73afa3930b9bb1bb257"}, "author": "AAP", "url": "http://www.sportsnews.com.au/rugby-union/james-oconnor-lets-fly-in-long-statement/159981", "ord_in_thread": 0, "title": "James O’Connor lets fly in long statement", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "James O’Connor lets fly in long statement   9:00   \nFormer Wallaby James O’Connor has written a long and rambling response to Greg Martin’s pointed criticisms of the fallen rugby star, claiming the commentator had “no interest in the truth”. \nO’Connor was released from his contract with the Queensland Reds to join his former club Toulon, the Australian franchise saying he’d been dealing with a number of personal matters. \nIt followed a series of other problems he had encountered playing Super Rugby and for the national team. \nMartin, himself a former Wallaby, described O’Connor as a “immature twat” and “a little punk” on Wednesday, saying he was one of Australian rugby’s greatest wasted talents. \nO’Connor used his Facebook page to mount a 1523-word defence. \n“Greg did not say these comments while I was present, he offered me no chance to respond and frankly from the position I stand he does not care,” O’Connor wrote. \n“He has no interest in the truth; he has no interest in finding the real story. Greg’s interest is his own opinion and making his own headlines, with no consideration to whom he drags through the mud. \n“I am the first to recognise that my previous behaviour was not one of an upstanding individual but, like all people, I wish to learn from my mistakes and look to improve upon myself. Greg’s comment on ‘everyone else growing up, except for James O’Connor’ implies that I have no recognition of the consequences of my previous actions. \n“I find it ironic that the man accusing me of being immature then preceded to call me an ‘immature twat’, and ‘a little punk’ on live radio. A childish insult at best, from a 50-year-old father.” \nMartin has previously been critical of O’Connor, who slept through the Wallabies’ World Cup announcement in 2011, was released from the Melbourne Rebels in 2013 and was involved in a drunken incident in Perth among other indiscretions. \nThere were hundreds of responses to O’Connor’s open letter on Facebook with one gaining 500 likes. \nIt read simply: “Could have just called him a —- and saved all that time.”  ", "external_links": [], "published": "2015-10-15T13:00:00.000+03:00", "crawled": "2015-10-15T13:54:41.232+03:00", "highlightTitle": ""}