{"organizations": [], "uuid": "5e443ab073f0b3f8ae3829d345ace3df407c8bfb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.commercialappeal.com", "main_image": "http://media.jrn.com/images/626354_3541946_ver1.0_640_480.jpg", "site_section": "http://www.commercialappeal.com/sports/index.rss", "section_title": "Sports", "url": "http://www.commercialappeal.com/sports/John-Bull-Bramlett-Lane-to-be-dedicated-Saturday-at-Tiger-Lane-332404822.html", "country": "US", "title": "\"John 'Bull' Bramlett Lane\" to be dedicated Saturday at Tiger Lane", "performance_score": 0, "site": "commercialappeal.com", "participants_count": 3, "title_full": "\"John 'Bull' Bramlett Lane\" to be dedicated Saturday at Tiger Lane", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T19:00:00.000+03:00", "replies_count": 2, "uuid": "5e443ab073f0b3f8ae3829d345ace3df407c8bfb"}, "author": "Tom Schad", "url": "http://www.commercialappeal.com/sports/John-Bull-Bramlett-Lane-to-be-dedicated-Saturday-at-Tiger-Lane-332404822.html", "ord_in_thread": 0, "title": "\"John 'Bull' Bramlett Lane\" to be dedicated Saturday at Tiger Lane", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The University of Memphis, City of Memphis and city council announced Monday that a portion of Tiger Lane will be dedicated to the memory of then-Memphis State linebacker John Bramlett on Saturday morning.\nStreet signs recognizing \"John 'Bull' Bramlett Lane\" will be unveiled in a ceremony at 8:45 a.m. at the corner of Tiger Lane and Early Maxwell Boulevard outside Liberty Bowl Memorial Stadium. The ceremony will follow Memphis' usual pre-game \"Tiger Walk\" and precede its game against No. 13 Ole Miss.\nBramlett died a year ago this month after a lengthy illness. He was 73.\nTom Bowen said he met Bramlett, who was a star linebacker for Memphis State in the early 1960s, after he took his current position as athletic director at Memphis in 2012. Bowen had heard a lot about Bramlett, the feared, physical linebacker who epitomized the Tigers' hard-nosed defense under coach Billy \"Spook\" Murphy. He was a two-time All-Pro who played six seasons in the NFL.\n\"I would've liked to have seen John play, because I was the kind of football player that would've liked to have been around a football player like that, that played with that heart and that passion and that explosion,\" Bowen said Monday. \"The more I got to know him, the more impressed I was with him and his faith and his commitment and what he did for people as a minister.\"\nBramlett's No. 64 jersey is one of six retired by the Memphis football program, but he is remembered by many for his devout faith. He became a Christian in 1973 and dedicated more than 40 years of his life to the ministry.\nWhen Memphis city councilman Bill Boyd approached Bowen about the possibility of renaming a portion of Tiger Lane in his honor, Bowen said it was a no-brainer.\n\"I said, 'This is perfect. This is a perfect tribute,'\" Bowen said.\nBramlett's widow, Nancy, and sons Andy and Don are expected to attend Saturday's ceremony.\nLiberty Bowl Memorial Stadium is owned by the city, so honoring Bramlett on its grounds required a concerted effort from several parties, including the city and the university.\n\"For (the city) to dedicate a piece of their facility to John Bramlett and his family is quite impressive,\" Bowen said. \"I'm honored and humbled to be a part of it.\"", "external_links": [], "published": "2015-10-13T19:00:00.000+03:00", "crawled": "2015-10-14T10:32:57.814+03:00", "highlightTitle": ""}