{"organizations": ["Doak Campbell Stadium", "Miami Joe Reedy Previous Next Florida State", "Associated Press", "FSU", "Florida State", "Journal Media Group"], "uuid": "d2c4cf26df8abc7ddca841365d9da4e25fa55de4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tcpalm.com", "main_image": "http://mediaassets.tcpalm.com/photo/2015/10/11/SPORTS_FBC-MIAMI-FLAST_13_OS_25074952_ver1.0_640_480.jpg", "site_section": "http://www.tcpalm.com/feeds/rssFeed?obfType=RSS_FEED&siteId=100111&categoryId=10004", "section_title": "Sports | TCP", "url": "http://www.tcpalm.com/sports/college/football/cook-powers-fsu-over-miami_73942198", "country": "US", "title": "Running back rushes for 222 yards, three TDs", "performance_score": 0, "site": "tcpalm.com", "participants_count": 0, "title_full": "Running back rushes for 222 yards, three TDs", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T08:23:00.000+03:00", "replies_count": 0, "uuid": "d2c4cf26df8abc7ddca841365d9da4e25fa55de4"}, "author": "", "url": "http://www.tcpalm.com/sports/college/football/cook-powers-fsu-over-miami_73942198", "ord_in_thread": 0, "title": "Running back rushes for 222 yards, three TDs", "locations": ["Miami", "Tallahassee", "Orlando"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Dalvin Cook", "Chad Thomas", "Stephen M. Dowell", "Cook", "Everett Golson"], "text": "Cook powers FSU over Miami Joe Reedy Previous Next Florida State running back Dalvin Cook (4) runs away from Miami defenders during Saturday’s game at Doak Campbell Stadium in Tallahassee. (Orlando Sentinel/TNS) Stephen M. Dowell Copyright 2015 Journal Media Group. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed. Florida State’s Everett Golson gets a pass off between the hands of Miami defender Chad Thomas during Saturday’s game. (the Associated Press) STEVEN CANNON Copyright 2015 Journal Media Group. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed. Show Caption \nAssociated Press \nTALLAHASSEE — Florida State needed another fourth-quarter rally to beat Miami. \nDalvin Cook ran for 222 yards and three touchdowns, the last a 23-yarder around the right end with 6:44 remaining, to help No. 12 Florida State outlast Miami 29-24 on Saturday night. \nMiami took a 24-23 lead on Brad Kaaya’s 29-yard touchdown pass to Stacy Coley with 10:02 left. \nThe Seminoles (5-0, 3-0 Atlantic Coast Conference) have won six in a row against the Hurricanes (3-2, 0-1), their longest winning streak in the series since winning seven straight from 1963-72. \nCook also scored the go-ahead touchdown last year in Florida State’s victory over the Hurricanes. \nThe sophomore, who didn’t practice the first part of the week due to a strained hamstring, is also the first Florida State back to have two 200-yard games in a season since Greg Allen in 1981. Before this year, Florida State had not had a back run for more than 200 yards in a game since Sammie Smith in 1988. \nAccording to STATS LLC, Cook’s 792 yards after five games are the second-most in the ACC since 1996. Maryland’s Bruce Perry had 821 yards in 2001. Cook had 22 carries against Miami. \nFlorida State’s Everett Golson completed 25 of 33 passes for 291 yards and a touchdown. Kaaya threw for 405 yards and three touchdowns, his fifth 300-yard game and his second against the Seminoles. \nCook opened the scoring on his first carry with a 72-yard run. It was the second straight week that Cook scored a touchdown on his first carry. In a 24-16 victory at Wake Forest, Cook scored from 94 yards, which was the third-longest TD run in school history. \nAfter Michael Badgley’s 30-yard field goal put Miami on the board, Cook extended the Seminoles’ lead to 14-3 when he took Golston’s screen pass 36 yards for a score. \nTrailing 17-3, Miami got back into it on Kaaya’s 58-yard touchdown pass to Rashawn Scott. Scott was able to get separation from cornerback Jalen Ramsey while Lamarcus Brutus tried to go for the interception. \nMiami was able to counter Roberto Aguayo’s field goals with touchdowns. Joe Yearby’s 1-yard reception brought them to 20-17 with 5:26 remaining in the third. After Aguayo’s third field goal, Coley’s touchdown gave the Hurricanes a short-lived lead. Copyright 2015 Journal Media Group. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.", "external_links": [], "published": "2015-10-11T08:23:00.000+03:00", "crawled": "2015-10-11T14:41:19.958+03:00", "highlightTitle": ""}