{"organizations": [], "uuid": "5bcba43ebe6c2c65fcf29cdeb3a8af6be685b7cd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/49295712.cms", "site_section": "http://timesofindia.indiatimes.com/", "section_title": "India News, Latest Sports, Bollywood, World, Business &amp; Politics News - Times of India", "url": "http://timesofindia.indiatimes.com/world/middle-east/Unrest-spreads-to-Gaza-as-Israeli-troops-kill-six-Palestinians/articleshow/49295701.cms", "country": "IL", "title": "Unrest spreads to Gaza as Israeli troops kill six Palestinians", "performance_score": 0, "site": "indiatimes.com", "participants_count": 2, "title_full": "Unrest spreads to Gaza as Israeli troops kill six Palestinians - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T13:31:00.000+03:00", "replies_count": 1, "uuid": "4185ec4998e373a48c40b8bd408a78f9f0884f29"}, "author": "timesofindia.indiatimes.com", "url": "http://timesofindia.indiatimes.com/world/middle-east/Unrest-spreads-to-Gaza-as-Israeli-troops-kill-six-Palestinians/articleshow/49295701.cms#post-0", "ord_in_thread": 0, "title": "Unrest spreads to Gaza as Israeli troops kill six Palestinians", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Gaza City, Palestinian Territories: A week of violence between Israelis and Palestinians spread to the Gaza Strip Saturday, with Israeli troops killing six in clashes on the border and Islamist movement Hamas calling for more unrest. A fresh wave of stabbings also hit Israel and the West Bank, including a revenge attack by a Jewish suspect that wounded two Palestinians and two Arab Israelis.\nThe Gaza Strip had been mainly calm as unrest has shaken annexed east Jerusalem and the occupied West Bank in recent days.\nBut a rocket fired from the Palestinian enclave hit southern Israel early Saturday, causing no damages or injuries, just hours after clashes broke out east of Gaza City and Khan Yunis along the border with the Jewish state.\nThe Israeli army said there had been on Friday \"multiple violent attempts to storm the border fence\" and \"a thousand rioters infiltrated the buffer zone,\" throwing a \"grenade, rocks and rolled burning tyres\" at the soldiers.\"\n\"After firing warning shots, forces on site responded with fire towards main instigators in order to prevent their advance and disperse the riot,\" a statement from the army read.\nSix Palestinians were killed, including a 15-year-old, and 80 wounded, according to medics.\nIt was the deadliest clash in Gaza since the summer 2014 war with Israel.\nPalestine Liberation Organisation secretary general Saeb Erakat accused Netanyahu and his government of \"committing a new massacre of Palestinians\" in Gaza.\nThe clashes came as Hamas's chief in Gaza called the spreading violence an intifada, or uprising, and urged further unrest.\nIn a sermon for weekly Muslim prayers at a mosque in Gaza City, Ismail Haniya said \"we are calling for the strengthening and increasing of the intifada\".\n- Gaza 'ready for confrontation' - \"It is the only path that will lead to liberation,\" he said. \"Gaza will fulfil its role in the Jerusalem intifada and it is more than ready for confrontation.\"\nIn a number of Arab towns in Israel's north, masked youths blocked roads with burning tyres and hurled fire bombs and stones at police, who arrested eight suspects altogether.\nStabbing attacks in the West Bank, Jerusalem and Israel itself along with rioting have raised fears of a third Palestinian intifada, following a first that began in 1987 and a second in 2000.\nThose two conflicts cost the lives of some 5,000 Palestinians and around 1,100 Israelis.\nHamas rules Gaza, squeezed between Egypt and Israel and separated from the West Bank. It remains deeply divided from Palestinian president Mahmud Abbas's Fatah party.\nThe enclave has been hit by three wars with Israel since 2008. A 50-day conflict between Palestinian militants in Gaza and Israel in the summer of 2014 left more than 2,200 people in the territory dead and 100,000 homeless.\nFriday's stabbings included one by a 17-year-old Jew in the southern Israeli city of Dimona that lightly or moderately wounded two Palestinians and two Arab Israelis.\nThis was the first such incident against Palestinians after multiple stabbings that have targeted Jews since Saturday, killing two.\nIsraeli Prime Minister Benjamin Netanyahu quickly condemned the attack by the Jewish youth, a sign of concerns that it could trigger further violence.\n- 'Acts of terror' - Attacks also continued against Israelis and Jews, with a Palestinian stabbing and lightly wounding a policeman near a West Bank settlement before being shot dead by the victim.\nA Jewish 16-year-old was slightly hurt in a stabbing in Jerusalem by an 18-year-old Palestinian suspect, who was arrested.\nAnd an Arab Israeli woman was shot and wounded when she tried to stab a security guard at a bus station in the northern Israeli town of Afula, police said.\nThere have been 13 stabbings since Saturday, including the revenge assault. Five of the alleged attackers have been killed.\nFriday's escalation came as Israeli security forces sought to prevent the further spread of Palestinian unrest.\nAbbas has spoken out against violence and in favour of \"peaceful, popular resistance\", but many youths are frustrated with his leadership as well as Israel's government.\nIn Washington, the US State Department said it regards the stabbings and shootings of Israelis by Palestinians as \"acts of terror\", though spokesman John Kirby would not be drawn on whether the attack by the Jewish teenager was also terrorism.\nFresh clashes between Palestinians and Israeli security forces broke out Friday in various parts of east Jerusalem and the West Bank, including near Ramallah after the funeral of Mohannad Halabi, a 19-year-old killed after allegedly stabbing two Jews to death in Jerusalem's Old City on Saturday.\nDuring clashes in the Shuafat refugee camp near Jerusalem a Palestinian was seriously wounded by police gunfire, after shooting at forces, police said in a statement. He was taken to a nearby hospital.\n\"We're currently in a spiral that appears to be heading toward escalation,\" said Ido Zelkovitz, an expert on Palestinian history at Haifa University.\n\"The current clashes are being led by a young generation with no collective memory of the second intifada, which created very strong deterrence among the Palestinian leadership.\"\nStay updated on the go with Times of India News App. Click here to download it for your device.", "external_links": ["https://play.google.com/store/apps/details?id=com.toi.reader.activities"], "published": "2015-10-10T13:31:00.000+03:00", "crawled": "2015-10-10T05:18:10.637+03:00", "highlightTitle": ""}