{"organizations": [], "uuid": "bf56719400fa30ff1b4299df4bfe121405e1dc66", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nj.com", "main_image": "http://imgick.nj.com/home/njo-media/width620/img/yankees_main/photo/18904547-standard.jpg", "site_section": "http://blog.nj.com/realtimesports_impact/rss.xml", "section_title": "New Jersey Real-Time Sports", "url": "http://www.nj.com/yankees/index.ssf/2015/10/yankees_cc_sabathia_checks_into_alcohol_rehab.html", "country": "IL", "title": "Yankees' CC Sabathia checking into alcohol rehab", "performance_score": 0, "site": "nj.com", "participants_count": 1, "title_full": "Yankees' CC Sabathia checking into alcohol rehab", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T21:12:00.000+03:00", "replies_count": 0, "uuid": "bf56719400fa30ff1b4299df4bfe121405e1dc66"}, "author": "Ryan Hatch | NJ Advance Media for NJ.com", "url": "http://www.nj.com/yankees/index.ssf/2015/10/yankees_cc_sabathia_checks_into_alcohol_rehab.html", "ord_in_thread": 0, "title": "Yankees' CC Sabathia checking into alcohol rehab", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK — Yankees left-hander CC Sabathia released a stunning statement on Monday through the team, announcing that he will check himself into alcohol rehabilitation on the eve of the team's Wild Card Game at Yankee Stadium against the Houston Astros . \nHere is the statement: \n\"Today I am checking myself into an alcohol rehabilitation center to receive the professional care and assistance needed to treat my disease. \"I love baseball and I love my teammates like brothers, and I am also fully aware that I am leaving at a time when we should all be coming together for one last push toward the World Series. It hurts me deeply to do this now, but I owe it to myself and to my family to get myself right. I want to take control of my disease, and I want to be a better man, father and player. \"I want to thank the New York Yankees organization for their encouragement and understanding. Their support gives me great strength and has allowed me to move forward with this decision with a clear mind. \"As difficult as this decision is to share publicly, I don't want to run and hide. But for now please respect my family's need for privacy as we work through this challenge together. \n\"Being an adult means being accountable. Being a baseball player means that others look up to you. I want my kids — and others who may have become fans of mine over the years — to know that I am not too big of a man to ask for help. I want to hold my head up high, have a full heart and be the type of person again that I can be proud of. And that's exactly what I am going to do. \"I am looking forward to being out on the field with my team next season playing the game that brings me so much happiness.\" \nALSO : Yankees' CC Sabathia praised on Twitter for decision to enter alcohol rehab \nThe announcement now sheds a different light on an incident involving Sabathia in August. As he left a Toronto nightclub in the early morning, Sabathia, who admitted he \"flipped out,\" got into a shouting match and had to be restrained from going after fans. He was shoved into a cab and driven away before the heckling turned into a street brawl. \nA few weeks later Sabathia was caught smoking on his hotel balcony . He said what he was holding was only a cigar, and put the photo on his Instagram account before later deleting it. \nSabathia, 35, made 29 starts this season, the most on the Yankees. He finished with a 4.73 ERA, his last start pitching the Yankees into the playoffs with a five-inning, one-run outing over the Boston Red Sox . That was also the Yankees' last victory. \nSabathia is pitching on a \"bum knee,\" as he's called it, missing nearly the entire 2014 season because of surgery on it. \nThe right knee finally wore out this season after 24 starts and he hit the disabled list, only to return fewer three weeks later much better than he has in a while . With a brace strapped to his knee, Sabathia went 2-1 in five starts with a 2.17 ERA. \nSabathia was in line to throw Game 1 of the American League Division Series if the Yankees make it. They are in the AL Wild Card Tuesday night, hosting the Houston Astros at 8 p.m. \nRyan Hatch may be reached at rhatch@njadvancemedia.com . Follow him on Twitter @ryanhatch . Find NJ.com on Facebook .", "external_links": [], "published": "2015-10-05T21:12:00.000+03:00", "crawled": "2015-10-05T22:01:06.154+03:00", "highlightTitle": ""}