{"organizations": [], "uuid": "a7f0eab2a21a4e1dca411eba8a6a889fc2984dc5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.jpost.com", "main_image": "http://www.jpost.com/HttpHandlers/ShowImage.ashx?ID=306556", "site_section": "http://www.jpost.com/Israel-News/Sports", "section_title": "Israel Sports | The Jerusalem Post ", "url": "http://www.jpost.com/Arab-Israeli-Conflict/Southern-command-attempts-to-contain-Gaza-border-riots-without-live-fire-423731", "country": "IL", "title": "IDF units fire tear gas at Gazan rioters who crossed border fence - Arab-Israeli Conflict", "performance_score": 0, "site": "jpost.com", "participants_count": 1, "title_full": "IDF units fire tear gas at Gazan rioters who crossed border fence - Arab-Israeli Conflict - Jerusalem Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T09:21:00.000+03:00", "replies_count": 0, "uuid": "a7f0eab2a21a4e1dca411eba8a6a889fc2984dc5"}, "author": "YAAKOV LAPPIN", "url": "http://www.jpost.com/Arab-Israeli-Conflict/Southern-command-attempts-to-contain-Gaza-border-riots-without-live-fire-423731", "ord_in_thread": 0, "title": "IDF units fire tear gas at Gazan rioters who crossed border fence - Arab-Israeli Conflict", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " A group of Gazan rioters approached the security fence from the center of the Strip and breached the border with Israel on Monday.\nThey were then surrounded by IDF units, which fired tear gas and pushed them back into Gaza, an army spokeswoman said. The rioters breached the border repeatedly, before being moved back by the IDF each time into Gaza.\nThe IDF’s Southern Command is attempting to contain Palestinian riots near the Gaza border fence without the use of live fire, after recent border clashes between Palestinian mobs and the army left nine Gazans dead from gunshot wounds.\nA military source said that while there has been no change in the rules of engagement in cases involving the approach of rioters to the fence, commanders have told ground units to focus on deploying tear gas and to fire warning shots in the air to prevent rioters from trying to damage or breach the border barrier.\n“If those measures are insufficient, then the soldiers will have to fire at the legs [of rioters],” the source added.\nInvestigations from the deadly clashes in the recent days have not yet been completed, and will likely reach their conclusions only after the region becomes calmer.\nContinued unrest along the border carries with it the risk of escalation with Hamas and Islamic Jihad, an increase in rocket attacks on the South, and retaliatory Israel Air Force strikes.\nTwo Palestinian minors aged 12 and 15 were shot dead during border clashes on Saturday, Palestinian medics said, according to a Reuters report, while seven were killed in similar incidents on Friday.\n ", "external_links": [], "published": "2015-10-13T09:21:00.000+03:00", "crawled": "2015-10-13T01:22:57.666+03:00", "highlightTitle": ""}