{"organizations": ["Swansea Mark Hughes", "Swansea"], "uuid": "ac8dfa04fa7d8bed17ec187a326984203e92bf29", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sport.co.uk", "main_image": "http://images.sport.co.uk/150x150/6816d2d679aec7b9d3f8bb1320854975.jpg", "site_section": "http://feeds.feedburner.com/SportcoukNewsRssFeed", "section_title": "General Sports News from Sports.co.uk", "url": "http://www.sport.co.uk/football/mark-hughes-hopes-stoke-can-atone-for-last-defeat-at-swansea/6950477/", "country": "JE", "title": "Mark Hughes hopes Stoke can atone for last defeat at Swansea", "performance_score": 0, "site": "sport.co.uk", "participants_count": 0, "title_full": "Mark Hughes hopes Stoke can atone for last defeat at Swansea", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T15:17:00.000+03:00", "replies_count": 0, "uuid": "ac8dfa04fa7d8bed17ec187a326984203e92bf29"}, "author": "", "url": "http://www.sport.co.uk/football/mark-hughes-hopes-stoke-can-atone-for-last-defeat-at-swansea/6950477/", "ord_in_thread": 0, "title": "Mark Hughes hopes Stoke can atone for last defeat at Swansea", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mark Hughes"], "text": "Mark Hughes hopes Stoke can atone for last defeat at Swansea 17 Oct 2015 12:17:06 \ncomments \nStoke boss Mark Hughes is looking ahead to Monday's game at Swansea still feeling rueful about his side's last trip there - as well as optimistic of a better result this time. \nThe Potters, down to 10 men following Marc Wilson's sending-off, were beaten 2-0 at the Liberty Stadium on May 2, the only defeat in their final seven games of last season. \nThey concluded the campaign in ninth place in the Barclays Premier League, equalling their record-high finish they had achieved under Hughes a year earlier, and with a best-ever points haul of 54. \nHe still reflects, though, that they would have finished eighth had it not been for the loss to Swansea, who ended up one place and two points better off than them. \nHowever, Hughes is in buoyant mood in terms of his team's current form, having seen them pull off their first two league wins of the 2015-16 season in their last two games. \nAs Stoke prepare to go in search of a first victory at Swansea since 1993, he said: \"Our games against them, certainly in Wales, have been difficult, and we didn't play particularly well against them last year. \n\"We are looking to improve on that - looking back, that probably stopped us being in a position above them come the end of the season. \n\"On reflection, we look back on that game and our performance with a little bit of regret. \n\"But we are in good heart now, which is important when you go to places like Swansea, who are very strong at home ordinarily. \n\"We just have to make sure we perform as we can and then I'm sure we will cause them problems.\" \nWith Stoke having recovered from their worst-ever start to a Premier League season by claiming back-to-back wins over Bournemouth and Aston Villa, Hughes admits the disruption to the momentum caused by the recent international break has been frustrating. \nBut he accepts it is something all his fellow top-flight managers have to contend with as well, and is glad the Potters at least went into the break in decent shape. \nHughes, the former Wales boss, said: \"Once you get that rhythm of work at club level, the frustration is that you just start to get a little bit of momentum and then it can be disruptive when the players go away for 10, 12 days with an international group where they do different work and different intensity of work. \n\"But it is frustrating for everyone, not just us, and thankfully we went into this last break in good heart having not been beaten for four games (in all competitions). That was encouraging for us.\" Related Sport News", "external_links": [], "published": "2015-10-17T15:17:00.000+03:00", "crawled": "2015-10-17T20:12:53.754+03:00", "highlightTitle": ""}