{"organizations": [], "uuid": "87ad813ca7de1d276f1b06faf848111eef3446f9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.fox14tv.com", "main_image": "http://KOAM.images.worldnow.com/images/9019872_G.jpg", "site_section": "http://www.fox14tv.com/", "section_title": "Fox 14 News - FOX 14 TV Joplin and Pittsburg News Weather Sports |", "url": "http://www.fox14tv.com/story/30264634/joplin-family-remembers-babies-during-infant-loss-and-awareness-month", "country": "US", "title": "Joplin family remembers babies during Infant Loss and Awareness", "performance_score": 0, "site": "fox14tv.com", "participants_count": 1, "title_full": "Joplin family remembers babies during Infant Loss and Awareness - FOX 14 TV Joplin and Pittsburg News Weather Sports |", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T06:47:00.000+03:00", "replies_count": 0, "uuid": "87ad813ca7de1d276f1b06faf848111eef3446f9"}, "author": "Chloe Leshner, Reporter", "url": "http://www.fox14tv.com/story/30264634/joplin-family-remembers-babies-during-infant-loss-and-awareness-month", "ord_in_thread": 0, "title": "Joplin family remembers babies during Infant Loss and Awareness", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "JOPLIN, MISSOURI - Most people know that October is Breast Cancer Awareness Month. But it's also Infant Loss and Awareness Month, something that also affects families in the four states.\nNo parent imagines having to bury their child. Johnathan and Falecia Waddell lost 2 daughters to Sudden Infant Death Syndrome. The first 12 years ago and again this past August, 7 week old Jaycie Sue.\n“I went in to go in and nurse her and when I went to wake her up I noticed she was turning purple,” says Falecia Waddell.\nJaycie rolled over, grabbing the sheet below her, leading to suffocation. Health experts have several recommendations to decrease the risk of SIDS.\n“You really want to avoid other loose blankets, bumpers, stuffed animals, they're all not safe and can put your infant at risk for suffocating if that is in the crib,” says Dr. Christine Culpepper, a neonatologist at Mercy Hospital.\nAnd while the Waddell’s did follow those recommendations, the bottom sheet still came loose. It only takes anywhere from 2 to 5 minutes for a baby to pass away from suffocation. The family re-filled the crib with things to remember Jaycie by but for their 3 young children, witnessing the loss was difficult.\n“For them it was really hard because it was their baby sister and they don't understand quite really where she went,” says Waddell.\nMost SIDS deaths occur when the baby is between 1 and 4 months old. Last year, over 2,000 babies died from SIDS.\n“We wish we knew an exact cause or something that we really could pinpoint as a cause,” says Dr. Culpepper.\nFalecia created a Facebook page to raise awareness for SIDS and to create a community for other grieving families. The family carries Jaycie's ashes with her everywhere they go.\n“If I could save one more baby by making an awareness I know I did something right. But I will always remember her smile,” says Waddell.\nTomorrow, October 15, is Remembrance Day. At 7 p.m. in all time zones. Families are asked to light a candle in honor of infants lost. The family is looking to raise money to get a special glass urn for their daughter. To donate visit: http://e.gofund.me/JaycieSue7\nTo view Falecia’s Facebook page go to: Https://www.facebook.com/groups/521764841320232/?fref=ts", "external_links": ["http://e.gofund.me/JaycieSue7", "Https://www.facebook.com/groups/521764841320232/?fref=ts"], "published": "2015-10-15T06:47:00.000+03:00", "crawled": "2015-10-15T15:45:59.945+03:00", "highlightTitle": ""}