{"organizations": [], "uuid": "dccd21e5deb413c03bdad552bd38a9dec12701b5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sacbee.com", "main_image": "http://pics.mcclatchyinteractive.com/news/nation-world/national/z8zvtx/picture38721381/ALTERNATES/LANDSCAPE_1140/homecoming%20art", "site_section": "http://www.sacbee.com/?widgetName=rssfeed&widgetContentId=713546&getXmlFeed=true", "section_title": "Breaking News, Sports, Weather & More | Sacbee.com &", "url": "http://www.sacbee.com/news/nation-world/national/article38721405.html", "country": "US", "title": "‘Small-town’ goes ‘Big’ for Tom Hanks-inspired homecoming", "performance_score": 0, "site": "sacbee.com", "participants_count": 1, "title_full": "‘Small-town’ goes ‘Big’ for Tom Hanks-inspired homecoming", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T22:48:00.000+03:00", "replies_count": 0, "uuid": "dccd21e5deb413c03bdad552bd38a9dec12701b5"}, "author": "Megan Ginise \nThe Fresno, Calif., Bee", "url": "http://www.sacbee.com/news/nation-world/national/article38721405.html", "ord_in_thread": 0, "title": "‘Small-town’ goes ‘Big’ for Tom Hanks-inspired homecoming", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "‘Small-town’ goes ‘Big’ for Tom Hanks-inspired homecoming \nAcademy Award-winner shares 7-minute video with high school homecoming crowd \nLargest celebration in years, school officials say \nStudents use Hanks’ movies for float themes and get a visit from a look-alike – an English teacher Kerman High students shoot confetti into the air in front of the “Big” float during their Tom Hanks-themed homecoming Oct. 9. ERIC PAUL ZAMORA ezamora@fresnobee.com Senior class president Taylor Yates sits as Forrest Gump in front of the senior float as Kerman High hosts a Tom Hanks-themed homecoming Oct. 9. Yates said he left his box of chocolates prop at home in the refrigerator. ERIC PAUL ZAMORA ezamora@fresnobee.com Students pose for a photo in front of the junior class “Toy Story” float as Kerman hosted a Tom Hanks-themed homecoming Oct. 9. ERIC PAUL ZAMORA ezamora@fresnobee.com A junior dressed as Buzz Lightyear from the movie “Toy Story” makes his way to the field walking past Tom Hanks-themed homecoming floats Oct. 9. ERIC PAUL ZAMORA ezamora@fresnobee.com Kerman High freshmen portray characters from “A League Of Their Own” on a Tom Hanks-themed homecoming at Kerman High Oct. 9. ERIC PAUL ZAMORA ezamora@fresnobee.com Kerman High sophomores on the “Big” float wore Tom Hanks masks as Kerman hosted a Tom Hanks-themed homecoming Oct. 9. ERIC PAUL ZAMORA ezamora@fresnobee.com Kerman freshmen from the “A League Of Their Own” float watch Tom Hanks address and give a tour of a movie set in a video Hanks provided for Kerman High’s homecoming. ERIC PAUL ZAMORA ezamora@fresnobee.com Tom Hanks look-alike Gregg Deslauriers, a Kerman High English teacher, walks through the crowd Friday night at the homecoming game. Facebook 1 of 8 \nThe Fresno, Calif., Bee KERMAN, Calif. \nThousands gathered in the Kerman High School stadium Friday night to celebrate that longstanding tradition of homecoming, made new again this year with a unique theme drawing national attention: Tom Hanks . \nKerman High used Hanks’ movies as class themes and even invited the Academy Award-winner to join them. \nHe declined because of a project he is working on. But the movie star did the next best thing by sending a seven-minute video. To screaming cheers from eager students, the short film debuted on an inflatable screen set up in the middle of the football field. Hanks gave students a backstage pass into the everyday life of an actor. He took them on the set of his newest film, “The Circle,” with special guest appearances by actress Emma Watson and writer David Eggers. \n“When you look back on this a week from now, a month from now, a year from now, you’re really going to realize how special what we did here was,” said Kerman High leadership coordinator David Bakholdin. “We’re a small town in the middle of nowhere California, and because we came together as a community, we were able to gain the attention of the world’s largest and most popular actor.” \nFormer Kerman High principal Jim Volkoff said the night was a testament to students’ hard work. \n“The atmosphere is crazy,” Bakholdin said. “We had the blimp out here … and it almost brought a tear to my eye.” \nSchool-week activities leading up to the big game against Chowchilla, Calif., High School included dress-up days, building floats with themes based on films starring Hanks: “Forrest Gump” for seniors, “Toy Story” for juniors, “Big” for sophomores and “A League of Their Own” for freshmen. \nAt the game, students had an opportunity to take photos with Hanks look-alike Gregg Deslauriers, a Kerman High English teacher. \nBut the main event was clear: the short video dedicated to Kerman High and made by Hanks himself. \n“Tom Hanks worked for us on so many levels,” Bakholdin said. “A lot of our homecoming themes for the floats ended up being movies anyways, so it was a way for us to give kids a good theme to work with; it allowed us to tie in with social media because a lot of kids are on social media. He’s a very personable guy, just a cool dude. It worked with him and I don’t think it would work with any other celebrity out there.” \nHow cool? Hanks even donated an old typewriter, an Olivetti Lettera 35, that he signed “with respect” to the students of Kerman High. Bakholdin said the school will put it on display in a trophy case. \nBakholdin said that the idea to have a Hanks-themed homecoming came out of left field – just like many of the star’s films. And like a box of chocolates, Bakholdin didn’t know what he was going to get. \n“It was an epiphany,” Bakholdin said. “It was like ‘Doc’ in ‘Back to the Future’; I was hanging the frame and slipped on the toilet thinking of the flux capacitor and it was kind of the same thing. It popped into my head. Ten years I’ve been doing this and this has been the only good idea I’ve ever had. The students bought it from minute one.” \nSenior class president Taylor Yates said he was honored to represent one of Hanks’ most iconic characters, Forrest Gump. “He’s such a good actor, all of his work is amazing, but more than that, he’s a good person. We chose him because we know he would love this kind of stuff, he’s so humble, and even to just make a video for us is amazing.” \nYates acted in character throughout the night – tan suit, white tennis shoes and all. (He said he left his box of chocolates prop at home in the refrigerator.) And he took on Forrest’s Southern drawl: “I ran a lot, I run through a lotta shoes.” \nYates added, “I like to think I’m a little bit like Forrest Gump. I may not be as slow sometimes as him, but I’m a Southern kind of person, I love Southern food, and that movie has always touched home with me.” Related content", "external_links": [], "published": "2015-10-10T22:48:00.000+03:00", "crawled": "2015-10-12T23:18:58.641+03:00", "highlightTitle": ""}