{"organizations": ["Indians", "Drexel", "Catholic", "Chargers", "Blue Tigers", "Wildcats", "Bulldogs", "Parkview", "Lighthouse Christian", "Falcons", "The Chiefs", "Cardinals", "Carthage", "McDonald County", "Pirates", "Picks Lebanon", "Blue Jays", "LaSalle", "Bobcats", "SCA", "The Lakers", "The Wildcats", "Tigers", "Comets", "HS Football Picks Osceola", "Eagles", "Vikings", "Cole Camp Rolla"], "uuid": "f90c7494b1b990f840af9a338f2fe2d69f94d892", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ozarkssportszone.com", "main_image": "http://imgsrv.ozarkssportszone.com/image/DbGraphic/201510/3177933.jpg", "site_section": "http://www.kspr.com/sports/21051914_21051920?format=rss_2.0&view=feed", "section_title": "Sports Top Stories", "url": "http://www.ozarkssportszone.com/pages/22069348.php", "country": "US", "title": "Week 9 HS Football Picks", "performance_score": 0, "site": "ozarkssportszone.com", "participants_count": 0, "title_full": "Week 9 HS Football Picks", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T22:30:00.000+03:00", "replies_count": 0, "uuid": "f90c7494b1b990f840af9a338f2fe2d69f94d892"}, "author": "", "url": "http://www.ozarkssportszone.com/pages/22069348.php", "ord_in_thread": 0, "title": "Week 9 HS Football Picks", "locations": ["Waynesville", "Monett", "Tipton Jordan", "Jordan Dean", "Camdenton Jordan", "Nixa", "Tulsa", "River Phelps", "Aurora", "Jordan", "Mountain Grove Jordan", "Bolivar Jordan", "Willow Springs", "Marionville Jordan", "Sarcoxie Jordan", "Fair Grove Jordan", "Cabool Jordan", "Marshfield Jordan", "Seneca", "Strafford", "Webb City Jordan", "Central Jordan", "Willard Jordan", "Hillcrest", "Liberty Jordan", "Rolla Jordan", "Buffalo", "McDonald County Jordan", "Rogersville Jordan", "Harrisonville", "Joplin Jordan", "Osceola Jordan", "Lebanon", "Memphis Nighthawks Jordan", "Marshfield", "Rich Hill Jordan", "Waynesville Jordan", "Salem", "Neosho Jordan", "Neosho", "Marionville", "Seneca Jordan", "Jasper Jordan", "Pierce City", "Mountain Grove", "Carthage", "Nevada Jordan", "Willow Springs Jordan", "Webb City", "Glendale", "Nevada", "East Newton Jordan", "El Dorado Springs", "Houston", "Camdenton", "Rogersville", "Springfield Central", "West Plains", "Cassville", "Nixa Jordan", "Parkview Jordan", "Osceola"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Colby Cornett", "Lamar Jordan", "Adrian Jordan", "Kerans", "Joboo", "Darrian Guillory", "Ben Friend", "Carl Junction", "Carter", "Webb", "Tipton", "Ava", "Ethan Bates", "Davis", "Willard", "Branson", "Sam Morton", "Darin Acklin", "Hunter Yeargan", "Lamar", "Nate Thomas", "Houston", "Ruskin", "Wright", "Stockton", "Rich Hill", "Joplin", "Alex Huston", "Clinton", "Jasper", "Hillcrest", "Chrisco", "Lockwood", "Carl", "Devin Hames", "Bailey Rettmann", "Chaden Brandt", "Payton Evans", "Sarcoxie", "Thayer", "Scott Bailey"], "text": "Osceola over Cole Camp Rolla over Hillcrest Do over of the week: Republic over Neosho. I was guessing that Neosho would have a post-Webb City drop-off. Instead they got the bounce especially Devin Hames. Whiff of the week: Hollister over Rogersville. Since I made them my tough call last week, I have to give the Wildcats credit for making me look bad. And they did it with a fourth-quarter comeback. Best pick: Glendale over Waynesville – I called this because of Waynesville being vulnerable to the pass. And they did give up 485 yards and 6 TDs. But neither of those numbers are in Alex Huston’s top 3 performances this year. It was the Glendale defense that took a stand late to get the win. VIDEO: Top Plays of Week 9 Week 9 Picks Jordan’s bold prediction: Carl Junction over Lamar. My pick won’t shock people, but the margin will. I would be shocked if Lamar doesn’t win another state championship in Class 2, but this Carl team is just on another level. CJ wins and it’s not as close as its been recently. If Lamar somehow wins, Scott Bailey should send me a gift for the bulletin board material. Joboo’s bold prediction: Parkview over Lebanon. – After a 5-0 start, the Yellowjackets are in a tailspin losing their last three games in convincing fashion. Parkview’s rushing attack could send them to a 4th straight loss. Both teams are trying to grab the No. 2 seed in their respective districts. The Vikings need to take care of the ball, not fall behind early, and grind out the win. Jordan’s toughest call: Lockwood over Jasper. This one is tough for me. Both have been impressive all season and really haven’t been tested. Both are great defensively and both are hungry for a deep postseason run. But, I think Lockwood found something with Ethan Bates last week; most high school kids don’t want to hit a 255-pound back. The Tigers have enough to pull out the win and cap off an unblemished SRVC title run. But, it won’t come easy. Joboo’s toughest call: Thayer over Mountain Grove – Really just going with my gut here. Wins have been tough to come by in Mountain Grove for the Bobcats, and the Panthers have been playing well. But there always seems to be one shocking result each year in the SCA. Something tells me this is a special group of Bobcats that will get a win Friday. Full Week 9 Picks Lebanon at Parkview Jordan’s Pick: Lebanon – If this was last year I would probably go with the Vikings, but this Lebanon team has some grit they lacked last year. I don’t see the skid continuing. They’ll get a big win on the road. Joboo’s Pick: Parkview - See bold prediction Thayer at Mountain Grove Jordan’s Pick: Mountain Grove – Thayer has made me pay every time I’ve picked against them. But, playing up two classes, on the road, against a team with a ton of speed and big-game experience, I can’t go against Trystan Short and Uncle Carter. Joboo’s Pick: Thayer - See toughest call West Plains at Rolla Jordan’s Pick: West Plains – Man, what a run West Plains has been on. We will find out just how good they are in the coming weeks, but can’t argue with an 8-1 regular season, which they’ll have after Friday. On a side note, Brow to Chrisco might give them some problems. Joboo’s Pick: West Plains – The Zizzers will finish out nicely and are looking to make up for last year. Strafford vs. Ash Grove Jordan’s Pick: Strafford – The Indians have found an identity lately and that defense is phenomenal against the run (cough, Sam Morton, cough). Indians ruin Senior Night for Ash Grove. Joboo’s Pick: Ash Grove – With a win, the Pirates could end up in third in the Mid-Lakes Conference. Big district implications too. Right now, they would move up to third. Lose to Strafford , and they could fall to sixth. Stockton at Marionville Jordan’s Pick: Marionville – Senior Night for LaSalle, Wright, Davis and Kerans means it’s time to eat. Stockton won’t make it easy, but playing a Marionville team coming off a loss and trying to tune-up for districts is a tall order. Joboo’s Pick: Marionville – The Comets still have a very real chance to move into the No. 2 spot in their district. Catholic at Marshfield Jordan’s Pick: Marshfield – Jordan Dean has been making it rain over the last few weeks. The Jays will struggle against Catholic’s ground game, but will make enough plays to win. Joboo’s Pick: Marshfield – A third place finish in the COC Small would be a good first year for Nate Thomas as the Blue Jays are in possibly the toughest district in the state. DISTRICT FOOTBALL STANDINGS - CLICK HERE Skyline at Tipton Jordan’s Pick: Skyline – The Tigers have won the last two meetings, but Tipton won the two before that. The Cardinals will have to live in the past because Skyline is just on another level this year. Joboo’s Pick: Skyline – This isn’t your father’s Tipton team. Skyline should have no problem finishing an undefeated regular season. Salem at Cabool Jordan’s Pick: Salem – Playing up one class is tough, playing up two is almost impossible. Salem gets a road win heading into districts. Joboo’s Pick: Salem – The Tigers just can’t seem to get the win to break back into the top half of the SCA standings. But they’re in a good spot for districts. Republic at Nixa Jordan’s Pick: Nixa – I haven’t picked against Nixa yet this year. It’s cost me a few times, but it won’t this week with the No. 1 seed on the line. Joboo’s Pick: Nixa – I’ve missed Republic’s games three weeks in a row. So Tiger fans will be happy to know that on Nixa’s turf, I’m going with the Eagles. Reeds Spring at Bolivar Jordan’s Pick: Bolivar – The Liberators have been itching to play someone good since that loss to Harrisonville. This is their chance, look for Bolivar to make a statement against Reeds Spring. Joboo’s Pick: Bolivar – Again we ask if anyone can beat Bolivar in the COC Small and again the answer is ‘no’. The Liberators are hitting on all cylinders since their loss to Harrisonville. Pleasant Hope at Osceola Jordan’s Pick: Osceola – The Indians need a win after losing to Cole Camp last week. They should get one at home. Joboo’s Pick: Osceola – The up and down year continues for the Indians. This should be an up week. Pierce City at Sarcoxie Jordan’s Pick: Pierce City – Sarcoxie has dropped five straight. Playing a Pierce City team jockeying for district position won’t help anything. Joboo’s Pick: Pierce City – It’s been a rough season for SRVC members with two teams playing 8-man football. Pierce City is trying to hang on to the No. 4 spot in their district and I think they will. WEEK 9 STATEWIDE MEDIA FOOTBALL RANKINGS - CLICK HERE Ozark at Neosho Jordan’s Pick: Neosho – The Wildcats punctuate an incredible turnaround by sending Devin Hames and company out with a Senior Night win. It would be their first win over Ozark since 2010. Joboo’s Pick: Neosho – A win secures a third-place finish in the COC Large for Neosho, and the third spot in their district which matches them up with winless KC Ruskin. Mount Vernon at Central Jordan’s Pick: Central – I’ll be checking this one out in person and I’m expecting an absolute shootout. But, the Bulldogs pull it out late. Joboo’s Pick: Springfield Central - I think this is the game that the athletes of Central make a difference in. At home, I like the Bulldogs to secure a .500 season. Monett at McDonald County Jordan’s Pick: Monett – McDonald County rushed for 300 yards last week. That won’t happen with the Cubbies coming to town. Joboo’s Pick: Monett – A third-place finish in the Big 8 for the Cubs, but they would be happy to console themselves with a run to the state semis or beyond. Lighthouse Christian vs. Memphis Nighthawks Jordan’s Pick: Lighthouse Christian – Assuming Ben Friend is healthy, this should be another Charger win. If he’s out, things could get tricky. Joboo’s Pick: Lighthouse Christian – The Chargers took a hit last week, but they shouldn’t have any problems with a Memphis team that lost big to Tulsa NOAH. Lockwood at Jasper Jordan’s Pick: Lockwood - See toughest call Joboo’s Pick: Lockwood – Both teams put up a lot of points, but I think this one comes down to defense. I think the Tigers can matchup better to the Jasper offense. Should be close, but I think it is Lockwood. Liberal at Rich Hill Jordan’s Pick: Rich Hill – Two teams that have been less than impressive this year. I’ll go with Rich Hill, but Liberal going on the road hasn’t ended well this Joboo’s Pick: Rich Hill – After starting 0-5, Rich Hill has played much better beating Drexel and playing Cass-Midway tough. I think they’ll be too much for Liberal. OCT. 12 FOOTBALL POWER RANKINGS - CLICK HERE Kickapoo at Waynesville Jordan’s Pick: Kickapoo – Last year Waynesville pulled the upset, knocking Kickapoo out of a share of the Ozark Conference crown. I think the Chiefs are ready to dish out some payback. Joboo’s Pick: Kickapoo – The Chiefs should close out their Ozark Conference title and 9-0 regular season. But how do you think they would fare against Webb City? Houston at Liberty Jordan’s Pick: MV-BT/Liberty – Houston has had a great run, but the Eagles have been untouchable. They’ll struggle to matchup with Liberty’s offense, but that defense has been disrespectful to every opponent this season. Joboo’s Pick: Mt. View-Liberty – One trademark of the Darin Acklin era at Liberty is that they beat the teams they’re supposed to. Should be no different here. Hollister at Fair Grove Jordan’s Pick: Fair Grove – I like what Fair Grove has done this season. They struggled last week, but the offense should get back on track this week. Joboo’s Pick: Fair Grove – Fair Grove wants to stay in the No. 3 spot and avoid Mt. View until the district final. Hollister is just .07 behind Seneca for the No. 6 spot. Hillcrest at Joplin Jordan’s Pick: Joplin – Colby Cornett has been going to work since that loss to West Plains, going 43-for-61 for 656 yards with eight touchdowns and just one interception during the three-game streak. It’s no coincidence that it’s also when Darrian Guillory took off. Eagles stay hot. Joboo’s Pick: Joplin – The Eagles will host a district game and should finish third in the Ozark Conference due to defense. Joplin has only allowed over 28 points twice this year and won one of those two games. Glendale at Camdenton Jordan’s Pick: Camdenton – The Lakers’ defense has been suspect this season, but the ground game should help limit Glendale’s possessions. Joboo’s Pick: Camdenton – The Lakers are most likely locked into a return trip to Waynesville in district play, but they need a win over the Falcons to try to avoid a losing season. El Dorado Springs at Adrian Jordan’s Pick: El Dorado Springs – This season hasn’t quite been what the Bulldogs had anticipated, but ending the season with wins in two of their last three will help entering districts. Joboo’s Pick: El Dorado Springs – The Bulldogs can move up to fifth in their district since they beat Stockton. But they could also fall to seventh. They need a win to avoid Butler or Summit Christian in round 1. CLICK HERE TO MAKE YOUR WEEK 9 PICKS FOR A CHANCE TO WIN FREE ANDY'S! Clinton at Nevada Jordan’s Pick: Nevada – I like Chaden Brandt to go out with a bang. Nevada gets the win at home. Joboo’s Pick: Clinton – Clinton has more to play for. Nevada is locked into a meeting with either of two undefeated teams in their district, Harrisonville or KC Center. A win for Clinton could help them avoid state champion Oak Grove in the first round. Cassville at Seneca Jordan’s Pick: Cassville – Seneca has won two of three in the series, but a steady dose of River Phelps will be too much to handle. Joboo’s Pick: Cassville – This is basically the battle for the 5 & 6 spots in their district. A Seneca win would give Aurora a chance to avenge their week 1 loss to Cassville. Carthage at Willard Jordan’s Pick: Carthage – Willard won the regular season meeting last year. Carthage won in districts by one. Hunter Yeargan will get his, but Carthage extends the streak to eight. Joboo’s Pick: Carthage – Can we officially change Carthage’s mascot to the Blue Tigers? It sounds very cool & they deserve to stand out from the COC Large Tiger pack. Carl Junction at Lamar Jordan’s Pick: Carl Junction - See bold prediction Joboo’s Pick: Carl Junction – Barring a big turnover margin, I can’t see Lamar pulling this out. Carl Junction is just that good. Buffalo at Rogersville Jordan’s Pick: Rogersville – Uh, have you heard of Bailey Rettmann? Maybe not, but he’s about to go OBJ on Buffalo this week. Joboo’s Pick: Rogersville – The Wildcats can’t move up in the district rankings, but a two-game winning streak would be nice. Branson at Webb City Jordan’s Pick: Webb City – This is obvious, but Branson will be a tough out come districts. Joboo’s Pick: Webb City – While the Pirates have been feisty the last few weeks, this is all Cardinals. Ava at Willow Springs Jordan’s Pick: Ava – The Bears have won three of four and haven’t lost in Willow Springs since 2010. I like their chances. Joboo’s Pick: Ava – Ava bounced back nicely last week. With most likely Buffalo waiting in districts, Ava could have a full head of steam heading into the district semis. Aurora at East Newton Jordan’s Pick: Aurora – Aurora quarterback Payton Evans looks to continue to establish himself as the best quarterback in the conference. Aurora rolls. Joboo’s Pick: Aurora – The Houn Dawgs could forge a tie for fourth in the Big 8 with a win, but their district seed looks to be set. Filed Under :", "external_links": [], "published": "2015-10-14T22:30:00.000+03:00", "crawled": "2015-10-15T01:22:57.936+03:00", "highlightTitle": ""}