{"organizations": [], "uuid": "d05c85ec55cbffe5e66c950376d1c671710b1bd4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.examiner.net", "main_image": "http://www.examiner.net/storyimage/MO/20151025/SPORTS/151029275/AR/0/AR-151029275.jpg", "site_section": "http://www.examiner.net/sports?template=rss&mime=xml", "section_title": "Sports - Examiner", "url": "http://www.examiner.net/article/20151025/SPORTS/151029275/13809/SPORTS?rssfeed=true", "country": "US", "title": "Blue Springs man becomes part of drama in deciding game", "performance_score": 0, "site": "examiner.net", "participants_count": 1, "title_full": "Blue Springs man becomes part of drama in deciding game", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T02:16:00.000+02:00", "replies_count": 0, "uuid": "d05c85ec55cbffe5e66c950376d1c671710b1bd4"}, "author": "Bill Althaus bill.althaus@examiner.net", "url": "http://www.examiner.net/article/20151025/SPORTS/151029275/13809/SPORTS?rssfeed=true", "ord_in_thread": 0, "title": "Blue Springs man becomes part of drama in deciding game", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Blue Springs man becomes part of drama in deciding game Comment Posted Oct. 25, 2015 at 7:16 PM Updated at 7:16 PM Posted Oct. 25, 2015 at 7:16 PM Independence, Mo. Caleb Humphreys never dreamed he would become part of the drama when he attended Friday night's American League Championship Series game between the Kansas City Royals and Toronto Blue Jays. With one out, and the Royals leading 1-0 in the bottom of the second inning, the 2014 Blue Springs South High School graduate grabbed Mike Moustakas' home run that landed in Humphreys' glove in the front row of the Pepsi Porch. He was able to grab the prized home run ball in front of his brother Haden, a South freshman, as the Royals went on to win 4-3. \"We never sit anywhere where we have the chance to catch a fly ball, so we brought our gloves,\" said Humphreys, a standout pitcher on the South baseball team that finished third in the state in 2014. \"I never dreamed I'd have the chance to catch a home run ball, especially a home run ball from Mike Moustakas.\" That dream suddenly turned into a nightmare as Toronto manager John Gibbons asked for an umpire's challenge, to see if Humphreys had interfered with a ball in play. \"The first thing I thought was, 'Oh no, they're going to call it an out! Where am I going to hide?' Then they ruled it a home run, and I never felt so good. I'd have hated to have been thought of like that guy in Chicago (Steve Bartman) who interfered with the outfielder and everyone said he cost the Cubs a chance to win that playoff game.” Humphreys became in instant celebrity as fans asked to have their photo taken with him, along with the home run baseball. He was even interviewed by Fox Sports’ Erin Andrews. \"I didn't even know who she was,\" Humphreys admitted. Humphreys is now attending MCC-Blue River and said, \"My playing career is over, but I like being able to come to a Royals playoff game and catch a home run ball. This is pretty cool.\" Humphreys hopes to meet Moustakas and have him sign the ultimate playoff souvenir. \"The only thing better than catching the homer would be to meet Mike and have him sign the ball,\" Humphreys said. By Bill Althaus", "external_links": [], "published": "2015-10-26T02:16:00.000+02:00", "crawled": "2015-10-26T04:39:22.092+02:00", "highlightTitle": ""}