{"organizations": [], "uuid": "5a0303b403915804288c5898465ec30431bcb0d5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.keloland.com", "main_image": "http://www.keloland.com/_images/data/800x600/67804.jpg", "site_section": "http://www.keloland.com/_xml/_rss.cfm?cat=sports&tag=high+school", "section_title": "KELOLAND.COM: News, Weather and Sports", "url": "http://www.keloland.com/newsdetail.cfm/ogorman-coach-hits-285-wins/?id=186034", "country": "US", "title": "O'Gorman Coach Hits 285 Wins", "performance_score": 0, "site": "keloland.com", "participants_count": 0, "title_full": "O'Gorman Coach Hits 285 Wins", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T02:09:00.000+03:00", "replies_count": 0, "uuid": "5a0303b403915804288c5898465ec30431bcb0d5"}, "author": "", "url": "http://www.keloland.com/newsdetail.cfm/ogorman-coach-hits-285-wins/?id=186034", "ord_in_thread": 0, "title": "O'Gorman Coach Hits 285 Wins", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["O'Gorman", "Matt Holsen", "Steve Kueter"], "text": "O'Gorman Coach Hits 285 Wins October 12, 2015, 5:09 PM by Matt Holsen Coach Steve Kueter SIOUX FALLS, SD - \nHe's led the O'Gorman Knights onto the football field for more than three decades and now his name will officially go down in history. Head Coach Steve Kueter claimed his 285th victory on Friday. That's good enough to be a record for most all-time wins. \nAfter a dominating victory in Rapid City, Kueter is reaching new heights. Always one for a good joke, he plays off what a record 285 wins mean. \n\"It means I'm getting old. It means I've been doing this a long time,\" Kueter said. \nThe 60 year old gives all credit to his players over the years and his staff. Rick Lynch, O'Gorman's defensive coordinator, has been with Kueter since the beginning. He teared up after Friday's accomplishment. \n\"It was a lot of fun and it was a little emotional. It was for me at least. I feel very good about being a part of this,\" Lynch said. \nFrom playoff appearances to state titles, there's been a lot of success under Kueter. And Lynch says, not much has changed over the years. Blocking well and running the ball are a mainstay in the Knights program. \n\"Football-wise, we are in the shotgun right now, periodically,\" Lynch said. Matt Holsen: You wish you would have thrown the ball more? Kueter: I don't. I think a lot of other people would. We know what we can do and we stick to that and that's been a pretty good formula. \nAs for what's next for Kueter and company, it's not retirement but a game against Huron. Third-ranked, 5-2 O'Gorman hosts the Tigers this Friday. \n\"It'd be hard to say. It's year to year when you're my age. I certainly have enjoyed this year and right now that's where our focus is,\" Kueter said. \nKueter has been the head football coach for 33 seasons. He's also O'Gorman's activities director. He passed Max Hawk to become the winningest high school football coach in South Dakota history. © 2015 KELOLAND TV. All Rights Reserved.", "external_links": [], "published": "2015-10-13T02:09:00.000+03:00", "crawled": "2015-10-13T18:29:31.846+03:00", "highlightTitle": ""}