{"organizations": [], "uuid": "765002c171d73718c40bde64405b95fc3dd54fd2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "savannahnow.com", "main_image": "http://savannahnow.com/sites/default/files/14043559_2_0_0.jpg", "site_section": "http://savannahnow.com/", "section_title": "savannahnow.com | Savannah Georgia's source for News, Entertainment, Sports, Weather, Classifieds, Jobs, Autos, Real Estate and St. Patricks Day", "url": "http://savannahnow.com/news/2015-10-18/savannah-chatham-public-school-board-road-recovery", "country": "US", "title": "Savannah-Chatham Public School Board on the road to recovery", "performance_score": 0, "site": "savannahnow.com", "participants_count": 1, "title_full": "Savannah-Chatham Public School Board on the road to recovery | savannahnow.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T17:32:00.000+03:00", "replies_count": 0, "uuid": "765002c171d73718c40bde64405b95fc3dd54fd2"}, "author": "Jenel Few", "url": "http://savannahnow.com/news/2015-10-18/savannah-chatham-public-school-board-road-recovery", "ord_in_thread": 0, "title": "Savannah-Chatham Public School Board on the road to recovery", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photos By Jenel Few The Savannah-Chatham Public School Board started the first day of its two-day retreat on Jekyll Island by working through frustrating issues that keep leading to embarrassing newspaper headlines.\nDuring a 2-and-a-half hour evening meeting at the historic Jekyll Island Club Hotel, board members and Superintendent Thomas Lockamy split into groups to assess what they do well and what they need to do better. It was their first opportunity to get away from the politics, stress and spotlight in Savannah and team build since School Board President Jolene Byrne took office in January.\nFor months, tensions mounted over accusations that Byrne was interfering in administrative duties and Lockamy was withholding critical information from the board. The result was a nasty email war and ugly outbursts in public meetings that raised the eyebrow of the district’s accrediting agency.\nSunday, facilitator Gordon Maner of the University of Georgia Carl Vinson Institute helped the nine board members and the superintendent develop a code of conduct to increase civility and help them function better.\nBoard members agreed that they should build better personal relationships, be more respectful, stop interrupting one another, attack issues instead of individuals, put an end to mass email debates and respect the gavel.\n“We all have things we respect and like about one another,” said Byrne. “We just need to turn that mutual respect into something we see in meetings.”\nManer suggested that they watch videos of contentious meetings so they can critique their behavior and work on improvements. He also said they should always work out personal differences individually and support one another in public rather than airing dirty laundry.\nAt the end of the session, board members said they had more similarities than differences.\n“We laid out issues on the table and have a chance to make amends and become a better board,” said school board member Irene Hines.\nThe code of conduct they developed sounded very much like kindergarten classroom rules — lighten up, be respectful, assume the best, behave and be positive.\nLockamy said he felt good about the first-day accomplishments.\n“This afternoon I saw the board I’m accustom to seeing,” he said. “We had a revival and a hallelujah moment today and I hope when we get back it will continue.”", "external_links": ["http://sav-cdn.com/sites/all/themes/savannahnow/images/blank.gif", "http://sav-cdn.com/sites/default/files/imagecache/superphoto/14043559_2_0_0.jpg", "http://sav-cdn.com/sites/default/files/imagecache/story_slideshow_thumb/14043559_2_0_0.jpg"], "published": "2015-10-18T17:32:00.000+03:00", "crawled": "2015-10-19T14:13:19.465+03:00", "highlightTitle": ""}