{"organizations": [], "uuid": "50623d0709868529325ef97a4d02b447a6193858", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.newstribune.com", "main_image": "http://jeffcity.media.clients.ellingtoncms.com/static/newstribune/images/news-tribune90x90.jpg", "site_section": "http://newstribune.com//rss/headlines/sports/", "section_title": "newstribune.com stories: Mid-Missouri and National Sports", "url": "http://www.newstribune.com/news/2015/oct/23/prep-football-south-callaway-seeks-edge-unfamiliar/", "country": "US", "title": "Prep Football: South Callaway seeks edge on unfamiliar Cole Camp", "performance_score": 0, "site": "newstribune.com", "participants_count": 1, "title_full": "Prep Football: South Callaway seeks edge on unfamiliar Cole Camp", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T10:50:00.000+03:00", "replies_count": 0, "uuid": "50623d0709868529325ef97a4d02b447a6193858"}, "author": "Ryan Boland", "url": "http://www.newstribune.com/news/2015/oct/23/prep-football-south-callaway-seeks-edge-unfamiliar/", "ord_in_thread": 0, "title": "Prep Football: South Callaway seeks edge on unfamiliar Cole Camp", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Download podcast \n“We got kind of an idea of their system, their offense and defense, but I wouldn’t put too much stock into that,” South Callaway head coach Zack Hess said. “Just the films that we got on them, we broke down, and that’s about what we have. \n“We’re going to make the most of that, and we broke it down to a T, as much as we could.” \nHess said Cole Camp — averaging 19.1 points per game — runs a double-tight end, single-wing offense similar to the one employed by state-ranked and unbeaten Mark Twain. The Bulldogs lost to Mark Twain 18-7 for the Eastern Missouri Conference title Oct. 9 in Mokane. \n“I think it helps, having played Mark Twain a couple of weeks ago, just kind of seeing that offense and now we’re coming back to it,” Hess said. \nHess added junior Kendrick Logan will likely handle the majority of the carries for the Bluebirds. \n“He’s a tough runner, physical, kind of a stocky kid,” Hess said. “He’s a kid that is not going to try to run around you, he’s going to try and run over you. \n“He has pretty good ball skills, pretty good quickness. He sees the hole really well.” \nSouth Callaway’s defense put the squeeze on Bowling Green in the second half last week after allowing all of the Bobcats’ scoring in the second quarter of the Bulldogs’ 45-16 EMO triumph in Mokane. South Callaway surrendered 232 yards of total offense, but only 75 rushing. \nThe Bulldogs are giving up just 132.8 yards on the ground this season. Hess stressed the challenge tonight will be to restrict running lanes for Cole Camp. \n“Our key is just having good run fits and making sure we know where to line up and what gap we have,” Hess said. \nOn the defensive side, Hess said the Bluebirds will move in and out of 5-3 and 4-4 alignments. Cole Camp is giving up 20.2 points per game. \n“Those same guys, they take those skills on offense and transfer them over to defense,” Hess said. “They have very good feet, they get off the ball quick, they do a good job pressuring the quarterback or getting in the backfield. \n“Their linebackers are very aggressive, they work sideline to sideline, and the (defensive backs) do their thing, they do a good job in run support and their coverage.” \nSophomore running back Kaden Helsel picked up a game-high 104 yards on 14 carries and had touchdown runs of 14 and 13 yards last week as South Callaway piled up 406 yards on the ground. Senior running back Patrick Barnard added 98 yards in 16 attempts and scored on runs of 5 and 2 yards, while fellow senior running back Cameron Richardson supplied 42 yards on nine carries and contributed touchdown runs of 3 and 5 yards. \nSophomore quarterback Landon Horstman also gained 98 yards and had a 45-yard touchdown run. The Bulldogs are running the ball at a rate of 291.8 yards per game. \n“They (Bluebirds) have the mentality that they’re very physical, ground-and-pound,” Hess said. “They’re going to run the ball, smash-mouth football, very similar to Mark Twain. \n“That’s our mindset as well. Whoever the most physical team is typically is going to come out on top. We’re just going to send that message that that’s our mentality and whoever wins the line of scrimmage is going to have a better shot.” \nTonight’s winner will face the winner of the game between No. 2 seed Lafayette County (8-1) and No. 7 Holden (3-6). \n“At this point in the season it’s a grind,” Hess said. “We know that the season is very long, especially for 15-, 16-, 17-year-olds. … We have to treat it as a marathon, not a sprint. \n“You have to be very mentally tough, have good mental fortitude to get through this part of the season. We try to keep it as light and loose and fun as possible, but at the same time it’s a fine line. The deeper we go, the teams are going to get harder and tougher.” \nSouth Callaway hosts Cole Camp - Updates on Twitter: @FultonSunSports \nPodcast", "external_links": [], "published": "2015-10-23T10:50:00.000+03:00", "crawled": "2015-10-23T14:37:27.242+03:00", "highlightTitle": ""}