{"organizations": [], "uuid": "6d1ae1d1cfd0e2d8997527d92fade4dfb7b671cf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "juneauempire.com", "main_image": "http://juneauempire.com/sites/default/files/14794259.jpg", "site_section": "http://jun-cdn.com/taxonomy/term/2/2/feed", "section_title": "Sports", "url": "http://juneauempire.com/sports/2015-10-09/falcons-underdogs-overachievers", "country": "US", "title": "Falcons underdogs but overachievers", "performance_score": 0, "site": "juneauempire.com", "participants_count": 1, "title_full": "Falcons underdogs but overachievers", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T11:02:00.000+03:00", "replies_count": 0, "uuid": "6d1ae1d1cfd0e2d8997527d92fade4dfb7b671cf"}, "author": "Klas Stolpe", "url": "http://juneauempire.com/sports/2015-10-09/falcons-underdogs-overachievers", "ord_in_thread": 0, "title": "Falcons underdogs but overachievers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "TMHS will face top ranked Soldotna in state football playoffs Posted: October 9, 2015 - 12:02am Back | Next KLAS STOLPE | JUNEAU EMPIRE Thunder Mountain's Cale Jenkins (3) hands off to senior running back Q'on Bear-Clark (7) during the Glacier Bowl. TMHS defeated JDHS to earn a state playoff semifinal game against Soldotna on Saturday at Anchorage's Dimond High School Alumni Field. Back | Next KLAS STOLPE | JUNEAU EMPIRE Thunder Mountain senior defensive end Naki Latu (56) jumps to challenge a pass against Juneau-Douglas during last weekend's Glacier Bowl. JUNEAU EMPIRE \nOn paper it’s a mismatch. \nAs a matter of fact it has been discussed on radio, television, over bar-room pizza and probably was foreshadowed on cave walls in Mesopotamia. The Soldotna Stars are favored to defeat Thunder Mountain High School on Saturday in the Alaska School Activities Association (ASAA) First National Bowl 2015 state medium school football playoff semifinal and continue a state record 37-game winning streak into the championship. \nJust don’t tell the Falcons. \n“On defense we have to play assignment football and each defender has to do their job,” TMHS assistant coach Jeep Rice via email. “Read their keys, make the tackle, operate as a unit and force them to punt. On offense we have to play our game. We have to play mistake free football, no penalties, make blocks, take the yards they give us and finish with a score.” \nTMHS will face their biggest opponent in the program’s six-year history when they line up opposite Soldotna at Dimond Alumni Field in Anchorage. \nThe Stars are the top ranked team in Alaska and rated 535th among programs across the nation, ahead of Alaska’s top 4A power Bartlett (second in Alaska and 950th across all state lines). TMHS is rated 18th out of 30 teams in Alaska, and 10,478th nationally.” \nFrom what we have seen of Thunder on film we see a team that has improved pretty steadily over the course of the season,” Soldotna head coach Galen Brantley Jr. said. “We think they have played their best ball in the last six quarters, from about half-time of the Nikiski game and into the Juneau game.” \nTMHS senior running back Q’on Bear-Clark finished the regular season with 1,932 yards, a Falcons’ record, and includes four games over 300 yards. The Juneau record is 1,975 set in 2003 by Juneau-Douglas High School’s Brian Felix. \nThat mark could fall in the first four carries of Saturday’s game as Bear-Clark has kept a 10-plus yard carry average through the season according to Rice. \n“He has a rare combination of speed and strength,” Rice said. “Which all offensive coordinators dream about.” \nOFFENSE \nThunder Mountain: \nThe Falcons’ offense all runs through Bear-Clark. He has above average speed and is much harder to tackle than last season. Bear-Clark also only plays offense, which helps save a lot of energy and allows him to carry it 30-plus times a game without fatigue. \nThe TMHS offensive line is solid and seems to have a pretty good understanding of the blocking schemes. Seniors Meki Sikione, Mason Kullander, Jase Lippert Andrew Ringle and junior Dawson Chilton live to open holes for Bear-Clark. Lead senior blocking back Ma’ake Ma’ake, and juniors Shannon Olmstead and Forest Bizzarro are key for Bear-Clark’s runs. \nJunior quarterback Cale Jenkins is doing a good job of managing the game and protecting the football. The Falcons hit a few bumps when junior QB Fletcher Sebens went down with a knee injury in Week 2, but have weathered that storm and the offense appears to be back on track. \nThe Falcons do not throw much but have a real hidden weapon with junior Riley Olsen at wide receiver. Olsen is the one player who could get one-on-one coverage because so many SOHI defenders will be committed to the box to stop the run ... and Olsen can win that match-up against anyone on the SOHI roster. If TMHS gives Olsen some shots down the sideline, he could come up big. \n“Neither team passes a lot, their strategy is to lull you to sleep,” Rice said. “And then spring passes on the defense with effectiveness.” \nSoldotna: \nSOHI has one of the best offensive systems in the entire nation. Yes, the nation. The Stars are tremendous in molding kids to fit their system, and tweaking their system to fit the kids. Their blocking is phenomenal, and they do it with under-sized kids when necessary. This year the Stars are a little undersized at guard, but have still been very efficient. Their coaching staff does an incredible job of self-scouting during the game and making the necessary adjustments to get first downs and points on the board. Very rarely do they lose the second half of a football game. \nWith the Week 1 injury to star senior running back Drew Gibbs (torn ACL), the run game has become a “by committee” philosophy. With that being said, the key guy is senior Kristian Palaniuk who, at 6-foot-1 and 215 pounds, is hard to bring down between the tackles. Palaniuk originally transferred from Wasilla as a linebacker. \nStars’ senior quarterback Dylan Simmons (6-foot-2, 200-lbs) doesn’t run much, but they will use him at key times to get the edge. SOHI doesn’t pass a lot, but will turn to the air if the running game gets stalled or if the opposing defense is stacking the box. All of the passes are slower developing, as they typically come off of a run fake, followed by a roll out or waggle. \nThe aforementioned Gibbs, the only freshman to ever start for Brantley, is testament to their program. \n“Drew serves as an assistant coach for us,” Brantley said. “He is working with our running backs and linebackers. We have done everything we can to keep him involved. He is a team captain and goes out with our guys and calls all our coin tosses. He is such a special player and he has been important to our success over the course of the last four years. He is definitely a Saturday football player. The only thing that kept me from losing my mind when he went down is that I know he has not played his last football. He doesn’t have to say goodbye to the game.” \nDEFENSE \nThunder Mountain: \nThe Falcons defense is a much-improved unit over the second half of the season. They rotate a lot of players, which may have hurt them early in year as they struggled to find a lineup that was most effective. That lineup seems to be in order now with Sikione and senior Naki Lattu in the middle and Kullander and Ma’ake close-by. The defensive line is the strength, and they will benefit from the fact that SOHI is not an up-tempo team. TMHS has some big bodies that could get tired from defending an up-tempo offense. \nThe Falcons’ secondary is fundamentally sound and is keyed by junior Ryan Mayhew. Mayhew likes big games, so look for him to play very well against SOHI. Sophomore Garth Tupou leads the team in tackles, and freshman Hansel Hinkle leads in interceptions. \nAnother plus for the TMHS defense is that a bulk of the team have a lot of years of playing experience with each other in the Juneau Youth Football League. That familiarity and football IQ can come in handy when in-game adjustments have to be made. There are times when you cannot see everything as a coaching staff from the sideline, and it is great to have a group of “extra coaches” on the field. \n“The challenge this week will be to contain a very good power run game, a very good misdirection run game where each defender will have to do their assignment,” Rice said. “And not be lulled to sleep at the corner or safety positions by play action passes.” \nSoldotna: \nWith all the focus on the Stars’ offense, their defensive unit does not get the recognition it deserves. They are VERY solid defensively. They will do a good job of scouting TMHS and devise a game plan that limits big plays. They tackle well and can really lay the lumber. Senior linebacker Trevor Walden (6-foot-1, 210-lbs), who also plays tight end, leads the unit. He will be one of the smartest kids on the field and is very physical. To defend the pass game, the Stars will take their best defender and put him on the best receiver, even if that is their own quarterback. The Stars did that against Juneau-Douglas High School in the medium school state title game in 2013. SOHI took star QB Colton Young and had him cover the Crimson Bears’ Kris Hill. JDHS was impressed and disappointed; they could not wear him out. This is a testament to the Stars’ conditioning. They play lots of kids both ways, but do not get tired. \n“I think that defensively we have made a lot of strides this year,” Brantley said. “Especially in our run defense. That is attributed to our defensive coordinator Eric Pomerleau and all the time he puts into getting those guys ready week in and week out. It is everything. If they don’t score, you can’t lose. It is certainly one of the best defenses we have had. We are pretty stingy inside the box with our front eight. It has been pretty fun to watch these guys improve over the course of the year.” \nSPECIAL TEAMS \nThunder Mountain: \nThe Falcons are very good in the punt game, putting in lots of practice over the past several years under former head coach Rice. They can make a field goal from 40 yards in. Their weakness may be in the kickoffs. If they continue to squib kick instead of kicking deep, they will give up a lot of field position to SOHI. If they squib, and SOHI gets the ball at their own 40, it only takes one first down and they are already in plus territory. The Falcons should try to implement some other types of kicks. Dimond and Palmer were known to use a super high kick off that would come down around the 25-30 yard line. It was so high most teams would be forced to do a fair catch. North Pole used to do a coffin-corner kick that would go down the sideline around the 30 and make it hard for the return team to set up any kind of blocking. Those types of kicks may prove effective and catch SOHI off guard. \nSoldotna: \nSeeing the SOHI punt team on film is like searching for the Loch Ness monster — there is a rumor it exists but you are not really sure. The Stars can kick field goals, extra points and put the ball in the end zone on the kickoffs. That could be a huge swing in field position if TMHS continues to squib kick. It is hard to drive the ball 80 yards in high school. \nINTANGIBLES \nThunder Mountain: \nThe Falcons got over the hump last week by beating Juneau-Douglas and making the playoffs for the first time since 2012. The big challenge will be to bounce back from that emotional victory and re-focus for the Soldotna game. As every team around the state has discovered when facing Soldotna, that is a major challenge. \n“This game looks like a similar match up of the 2010 playoff game where the power run of TM was matched against the same offense that Soldotna continues to play,” Rice said. “TM lost that game. Hopefully we get payback this year.” \nSoldotna: \nWhat impresses football purists most about SOHI is despite the 37 game winning streak and 3 consecutive state titles, they refuse to get complacent and overlook anyone. They have a bullseye on their chest every week and they turn that into motivation. They do their homework, make the most of practice time, and execute their game plan week after week. \n“This is my second family, it really is,” Brantley said. “Away from my own wife and children they are the most important people in my life. We are a small community and a lot of these guys grow up together and play together for years and years and have a tremendous bond that they want to be out there and play for each other.” \nHISTORY \nThe Falcons and Stars have met three times in the past. In the 2010 state small school playoffs, Soldotna eliminated the Thunder Mountain 55-20. In 2013, the Stars came to Falcons Field and won 62-6, and in 2014 Thunder Mountain lost at Soldotna 62-0. \nIn the 2014 game, the score was 0-0 at the end of the first quarter. This shows two things. One, if TMHS can get their running game going, they can eat up clock and shorten the game. Two, SOHI is really explosive and can put points on the board in a hurry. There are several games where the Stars come out slow, like a boxer evaluating an opponent, and then turning it on in the later rounds. \nIf SOHI gets off to a fast start, then the game will be a nightmare for TMHS as the Falcons are not built to come from behind. \nThe number “30” is what TMHS should strive for. Not 30 points, but 30 first downs. Every first down is 2 minutes off the clock and 2 minutes closer to victory. \nIn the few games that SOHI has lost in the past 10 years, that same formula has happened. The winning team was able grind out yards on the ground, control the clock and keep the SOHI offense from getting enough offensive plays in the first half to self scout and make adjustments. Surprisingly, despite SOHI being a ground-oriented team, they thrive in a shootout. It is nearly impossible to outscore them, especially when they get lots of first half possessions and have enough information to evaluate. \nJDHS found that out in the 2013 medium school state championship game. The Crimson Bears’ coaching staff asked themselves, “Are we scoring too fast? Maybe we should be slowing this down to limit their possessions.” \nJDHS jumped out a 28-6 lead, 28-21 at half, 49-42 at the end of three quarters, but ultimately fell in the last minutes 56-49. \n“It was just too much of a shootout,” then JDHS coach Rich Sjoroos said. “We played right into their hands. They dominated the fourth quarter.” \nSOHI’s last four losses were to Palmer (27-7) in 2012, Kenai (28-12) in 2011, Kenai (21-10) in 2010, and Colony (24-17) in 2010. In each game the scores were lower, and SOHI was never able to get their offense rolling. \nFINAL THOUGHTS \nNumbers are kept to highlight an individual or team when the season is over. Statistics will show who rules the scoreboard when the final seconds tick off. At game time, however, there is no formula for heart and passion. The Falcons are not afraid to take a beating and that fearlessness makes them dangerous. The Stars never disrespect an opponent and treat every game like a championship contest. \n“There are no egos or attitudes,” SOHI’S Brantley said. “The thing that I am the most proud of is to have had the opportunity to be a part of the lives of the young men who have come through our program. There have been a ton of really unselfish kids who have put the success of each other in front of any individual success and the result has been an awesome thing to be a part of.” \n• Sports Editor’s note: The Juneau-Empire wishes to thank SOHI coach Galen Brantley Jr., TMHS coach Jeep Rice, and former JDHS head coach Rich Sjoroos (2005 Railbelt Conference & Alaska State Assistant Coach of the Year; 2009 Railbelt & Alaska State Head Coach of the Year) for interview time.", "external_links": [], "published": "2015-10-09T11:02:00.000+03:00", "crawled": "2015-10-09T13:14:42.098+03:00", "highlightTitle": ""}