{"organizations": [], "uuid": "5303645e2a726e467975057b1d4fafb4e579f25b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "sports.gunaxin.com", "main_image": "http://sports.gunaxin.com/wp-content/uploads/2015/10/NBA.jpg", "site_section": "http://sports.gunaxin.com/?feed=rss", "section_title": "Gunaxin Sports » Sports", "url": "http://sports.gunaxin.com/2015-16-nba-season-preview-offseason-winners-losers/186831", "country": "US", "title": "2015-16 NBA Season Preview : Off-Season Winners & Losers", "performance_score": 0, "site": "gunaxin.com", "participants_count": 1, "title_full": "2015-16 NBA Season Preview : Off-Season Winners & Losers", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T07:00:00.000+03:00", "replies_count": 0, "uuid": "5303645e2a726e467975057b1d4fafb4e579f25b"}, "author": "TZ McD", "url": "http://sports.gunaxin.com/2015-16-nba-season-preview-offseason-winners-losers/186831", "ord_in_thread": 0, "title": "2015-16 NBA Season Preview : Off-Season Winners & Losers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By TZ McD ( @ ) on \nLebron James is simply an amazing athlete. He isn’t the greatest NBA player of all-time, neither is Michael Jordan, Magic Johnson, Kobe Bryant, or Bill Russell. No one is. And that is how it should be. Yes, you can make a case for each of the players listed above but the one thing you cannot do is prove it. Unless MJ, Magic, Mr.Russell, and Lebron James played during the same ERA, it is an argument that should make NBA fans sick. \nEnjoy Lebron James while he is still playing in the NBA. Stop hating a man for dominating a sport. The 2015 NBA Finals should have been the moment the World realized just how incredible of a player Lebron James is. He single handily led his team to a 2-1 series lead. He turned guys like Matthew Dellavedova into a 20 point scorer during the NBA Finals. That in itself blows us away. The Dell isn’t a bad player but did you honestly think anyone predicted he would be starting in the NBA Finals let alone drop 20 in a Game 3 victory? \nNow with the 2015-16 NBA Season swiftly approaching, let’s take a look at the NBA teams that won the off-season and those that lost. 2015 Off-Season Winners \nAdditions: LaMarcus Aldridge, David West, Jimmer Fredette \nRe-Signed: Kawahi Leonard, Tim Duncan, Manu Ginoboli, Danny Green \nIncoming Rookies: Nikola Milutinov, Cady LaLanne \nWhen LaMarcus Aldridge made it official, the entire country went nuts. There are a couple things everyone needs to realize now that the Spurs have added two All-Star big men to their lineup. First off, Tim Duncan can basically rest all season long and be ready to go come playoff time. Secondly, and this is the most important, the Spurs can compete against anyone even with all the aging Stars on their roster. Cleveland Cavaliers \nAdditions: Mo Williams, Richard Jefferson \nRe-Signed: Lebron James, Kevin Love, Iman Shumpert, J.R. Smith, Timothy Mozgov \nIncoming Rookies: Cedi Osman, Rakeem Christmas, Sir’Dominic Pointer \nThe one year contract for Lebron James was not much of a shocker but when Kevin Love signed for 5 years and $113 million, the ground began to move. Keeping Kevin Love was one of the best move the Cavs organization has made since, well, Lebron James came back. \nThey also gave Iman Shumpert a long term deal, one that he deserves.   underrated players on the Cavs roster and they made sure that he stayed there. Adding both Mo Williams and Richard Jefferson helps a depth chart that was lacking experience. Toronto Raptors \nAdditions: DeMarre Carroll, Bismack Biyombo, Cory Joseph, Luis Scola \nIncoming Rookies: Delon Wright, Norman Powell \nThey got mean. The Raptors added a bunch of guys that will help them go from one-year wonders to serious contenders in the Eastern Conference. Luis Scola is old but plays hard. DeMarre Carroll is a beast and plays like one. They are going to do exactly what they did last season only this time, they might actually be able to beat the Cavaliers in the playoffs. Dallas Mavericks \nAdditions: Deron Williams, JaVale McGhee, Wesley Matthews, John Jenkins, Jeremy Evans \nRe-Signed: Raymond Felton, J.J. Barea \nIncoming Rookies: Justin Anderson, Satnam Singh \nDeron Williams was once the best scoring PG in the NBA. At some point, the rest of us forgot and his stock dropped. He became a ball hog that shot way too much and no one appreciated his talents. So he got away from Brooklyn and went back home to Dallas. If only they could have convinced DeAndre Jordan to sign. Milwaukee Bucks \nAdditions: Greg Monroe, Chris Copeland, Khris Middleton \nIncoming Rookies: Rashad Vaughn \nLosses: Jared Dudley, Caron Butler \nThe losses in Milwaukee are nothing. Caron Butler is getting up there in age and Jared Dudley was traded away for a reason. So the Bucks decided to go out and sign Greg Monroe to help solidify their front court. They also added Chris Copeland and Khris Middleton. Copeland has been underutilized from day one and Middleton is about to go off in Milwaukee this season. \nThey have a potential starting rotation of Michael Carter-Williams (PG), Khris Middleton (SG), Giannis Antetokounmpo (SF), Jabari Parker (PF), Greg Monroe (C). That is enough to make the playoffs in the Eastern Conference this season, the only question is if they will get there as a 4th or a 5th seed. (Yes sir, you heard that right) 2015 Off-Season Losers", "external_links": [], "published": "2015-10-13T07:00:00.000+03:00", "crawled": "2015-10-13T20:50:31.185+03:00", "highlightTitle": ""}