{"organizations": ["Spartans Bobcats"], "uuid": "bfd751dd97a6bacc66679938e3e4c6bf798adbde", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.brandonsun.com", "main_image": "http://media.brandonsun.com/designimages/squaresun_web.jpg", "site_section": "http://brandonsun.com//rss?path=/sports/local", "section_title": "Local Sports", "url": "http://www.brandonsun.com/sports/local/bobcats-make-mark-vs-spartans-333464461.html", "country": "US", "title": "Bobcats make mark vs. Spartans", "performance_score": 0, "site": "brandonsun.com", "participants_count": 0, "title_full": "Bobcats make mark vs. Spartans", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T11:00:00.000+03:00", "replies_count": 0, "uuid": "bfd751dd97a6bacc66679938e3e4c6bf798adbde"}, "author": "", "url": "http://www.brandonsun.com/sports/local/bobcats-make-mark-vs-spartans-333464461.html", "ord_in_thread": 0, "title": "Bobcats make mark vs. Spartans", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Chris Jaster"], "text": "Bobcats make mark vs. Spartans By: Chris Jaster Report Error \nThe Brandon University Bobcats showed they could play with one of the best women’s volleyball teams in the country on Friday, but they couldn’t find a way to beat them. \nThe Bobcats, who were without fifth-year left side and captain Shanlee McLennan (ankle), were within a point of the visiting Trinity Western Spartans late in each set of their Canada West conference season opener. However, the third-ranked team in the country found a way to close out each set and prevail with a 3-0 (30-28, 25-20, 25-21) victory over BU. \nAlthough the result was a loss, Bobcats head coach Lee Carter was happy with his team’s effort. \n“It’s a good opportunity for our players to believe we have the depth that we were talking about and that we have the opportunity to do something this year,” he said. “It’s a long season. For our first one there were a lot of quirky errors on both sides that hopefully will be cleaned up later on. It’s not the result you’re hoping for, but it’s a good little step in the right direction.” \nThe Bobcats, who will host the Canadian Interuniversity Sport championship in March, dug themselves early deficits in each set but managed to climb out of the holes, partially due to their superb serving. \nBrandon posted six aces in the first set and kept Trinity Western on its toes for much of the match. \n“Our girls have committed to really serving tough and they did a good job of following the service game plan and it kept them off balance,” Carter said. “It’s just unfortunate (the Spartans) got some breaks at the end of the sets where balls just squeaked through blocks. Blocks are there and they just get through. That’s just sport.” \nWith McLennan out, last year’s conference all-rookie team member Nikala Majewski appears like she’s ready to carry the load. Majewski moved to right side this season and posted nine kills, three aces and was involved in a pair of blocks. \n“Not much different. It’s still the outside,” she said. “It’s a bit of a bigger block, but it’s fun. I still get to bang balls.” \nGillian Leech added eight kills, two aces and a block for Brandon, while Courtney Roberts chipped in with six kills, three aces and a block. Regan Dahl also served three aces. Katelyn Devaney paced the Spartans with 11 kills. \nAlthough they were able to keep close in the match, the Bobcats struggled to build their offensive attack. They didn’t get the ball into the middle as much as they would like and Trinity’s front row stood tall with 10 blocks in the match. Carter hopes for a better first touch and a quicker offence in today’s rematch at 5 p.m., and Majewski said her side will be motivated. \n“I think we’ll come together,” she said. \n“We’ll have a lot of fire under us. We don’t want to lose 3-0 again. We’ll have a lot of urgency on the court.” \nMeanwhile, Roy Ching was money for the Bobcats men’s team as they upset the Spartans, who are also ranked third in the CIS, 3-0 (25-17, 25-21, 25-16) in their season opener on Friday. \nChing posted 22 kills and didn’t have any attack errors while posting a .667 attack percentage at left side. He also served up two aces and dug up six balls. \nMatt Powell added 12 kills for Brandon, which finished with a team attack percentage of .507 and committed just six attack errors in the entire match. David Stasica added 36 assists. \nRyan Sclater posted 15 kills for Trinity Western. \nThose two teams will play again today at 6:45 p.m. \nCAT SCRAPS: Brandonite Alison Quiring is on the TWU women’s roster. She dressed but did not play on Friday. \n» cjaster@brandonsun.com", "external_links": [], "published": "2015-10-17T11:00:00.000+03:00", "crawled": "2015-10-17T14:32:10.515+03:00", "highlightTitle": ""}