{"organizations": [], "uuid": "1e478c7d23513ebb26e3cb8465f69ec712105a72", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "http://images.tribuneindia.com/cms/gall_content/2015/10/2015_10$largeimg09_Friday_2015_140548478.jpg", "site_section": "http://www.tribuneindia.com/", "section_title": "The Tribune, Chandigarh, India : Latest news, India, Punjab, Chandigarh, Haryana, Himachal, Uttarakhand, J&amp;K, sports, cricket ", "url": "http://www.tribuneindia.com/news/nation/parrikar-bats-for-combat-role-for-women-in-armed-forces/143759.html", "country": "US", "title": "Parrikar bats for combat role for women in armed forces", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "Parrikar bats for combat role for women in armed forces", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "1e478c7d23513ebb26e3cb8465f69ec712105a72"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/nation/parrikar-bats-for-combat-role-for-women-in-armed-forces/143759.html", "ord_in_thread": 0, "title": "Parrikar bats for combat role for women in armed forces", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "New Delhi, October 9 Defence Minister Manohar Parrikar on Friday batted for combat role for women in the armed forces, but said a policy decision will soon be made after studying the implications as it may have some “operational” or “training difficulties”.\nHis comments came a day after IAF Chief Arup Raha said the Air Force has moved a proposal for inducting women as fighter aircraft pilots.\n“The procedure is on. I am still not aware as to why an in-principle approval should not be given. There could some hurdles, difficulties during the training. Keeping all this mind, we will soon announce a policy. They have recommended women in combat role and there is no reason why we should not accept it. It can be thought upon on how and when they can be used,” Parrikar said.\n“There are some operational difficulties. Barring that, why can’t women participate in the combat operations (of Indian Air Force). I also have some questions related to this and I am discussing with them. This takes time,” he said while interacting with reporters here after a parade to mark the 66 th anniversary of Territorial Army.\nAir Chief Marshal Raha had yesterday said a proposal to induct women as fighter plane pilots has been sent to the Defence Ministry.\nThe proposal to induct women into a fighting arm is a first in the three services which were earlier not open to the idea of women taking part in combat role.\nParrikar had in May ruled out recruiting women for combat operations in the armed forces due to apprehensions about their safety but said they would be encouraged to join other operational areas with their inclusion being stepped up in phases. — PTI", "external_links": [], "published": "2015-10-09T03:00:00.000+03:00", "crawled": "2015-10-09T15:38:47.437+03:00", "highlightTitle": ""}