{"organizations": ["NFL Network", "Cincinnati Bengals Johnny Manziel NFL", "NFL", "Bengals"], "uuid": "047797d3edc05c8efce9489e344e09046908cfb1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.spokesman.com", "main_image": "http://media.spokesman.com/img/logos/sr200.png", "site_section": "http://www.spokesman.com/feeds/stories/sports/", "section_title": "Spokesman.com: Sports stories", "url": "http://www.spokesman.com/stories/2015/oct/19/nfl-network-apologizes-to-naked-bengals/", "country": "US", "title": "NFL notes: NFL Network apologizes to naked Bengals - Mon, 19 Oct 2015 PST", "performance_score": 0, "site": "spokesman.com", "participants_count": 0, "title_full": "NFL notes: NFL Network apologizes to naked Bengals - Mon, 19 Oct 2015 PST", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T00:33:00.000+03:00", "replies_count": 0, "uuid": "047797d3edc05c8efce9489e344e09046908cfb1"}, "author": "", "url": "http://www.spokesman.com/stories/2015/oct/19/nfl-network-apologizes-to-naked-bengals/", "ord_in_thread": 0, "title": "NFL notes: NFL Network apologizes to naked Bengals - Mon, 19 Oct 2015 PST", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tags: Cincinnati Bengals Johnny Manziel NFL \nThe NFL Network has apologized to Bengals players who were shown naked in the locker room during a postgame interview Sunday in Buffalo. \nAlex Riethmiller said a “regrettable mistake by a production team” was behind the video. An NFL Network reporter was interviewing cornerback Adam “Pacman” Jones after a 34-21 … \nThe NFL Network has apologized to Bengals players who were shown naked in the locker room during a postgame interview Sunday in Buffalo. \nAlex Riethmiller said a “regrettable mistake by a production team” was behind the video. An NFL Network reporter was interviewing cornerback Adam “Pacman” Jones after a 34-21 win in Buffalo on Sunday, and the videographer’s angle included several players coming out of the shower in the background. \nLeft tackle Andrew Whitworth was one of those shown. He said on Monday that the league should restrict media access to the locker room to prevent it from happening again. \nRiethmiller says the crew didn’t follow network procedures that would have prevented the mistake. Manziel video released \nPolice have released a dash-cam video and 9-1-1 emergency calls from a roadside incident involving Browns quarterback Johnny Manziel. \nThe former Heisman Trophy winner was questioned by Avon, Ohio, police last week after Manziel got into an argument with his girlfriend, Colleen Crowley. \nWitnesses said Manziel passed cars on the shoulder while driving at a high speed and he later admitted drinking alcohol earlier in the day. \nManziel was not charged and he was active as Cleveland’s backup Sunday during a 26-23 overtime loss to the Denver Broncos. \nThe Browns said they have spoken to Manziel about the incident. Manziel spent 70 days in a rehab facility during the offseason. Jets’ Enunwa suspended \nNew York Jets wide receiver Quincy Enunwa has been suspended four games without pay by the NFL for violating the league’s personal conduct policy. \nThe suspension stems from an incident last year when Enunwa was arrested for simple assault on his girlfriend at a New Jersey hotel. Domestic violence charges were later dropped in the case. \nEnunwa has become a key part of the offense as a blocking receiver after being a sixth-round pick out of Nebraska last year. He has eight catches for 94 yards this season. \nEnunwa is eligible to return to the Jets’ active roster on Nov. 13 following the team’s game against the Buffalo Bills on Nov. 12. Mariota sprains MCL \nAn MRI exam shows Titans quarterback Marcus Mariota sprained his left MCL, and coach Ken Whisenhunt says they will have to see how the rookie’s knee progresses before determining if he can play Sunday against Atlanta. \nWhisenhunt said that Mariota was walking around just fine at the Tennessee headquarters on Monday. \nMariota was injured during the second quarter of Sunday’s 38-10 loss to the Miami Dolphins when hit low by end Olivier Vernon. The rookie stayed on the field and didn’t miss a play. Mariota did put a brace on after the series, and he remained in the game until Whisenhunt sent Zach Mettenberger in for the final series with 1:54 left. Injuries pile up for Bills \nCoach Rex Ryan and the Bills carried plenty of baggage upon flying out of Buffalo and touching down in London on Monday. \nA sudden rash of injuries is a concern for the Bills (3-3), who left town early in preparation to play the Jacksonville Jaguars (1-5) at Wembley Stadium on Sunday. \nReceiver Sammy Watkins (left ankle), defensive tackle Kyle Williams (left knee), offensive tackle Seantrel Henderson (concussion) and receiver Marquise Goodwin (ribs) were hurt in a loss to Cincinnati, and their status is uncertain against Jacksonville. \nThen there are the regulars who were already sidelined on Sunday, including starting quarterback Tyrod Taylor (left knee), receiver Percy Harvin (hip), backup running back Karlos Williams (concussion) and receiver Marcus Easley (shoulder). Lions put Zenner on IR \nDetroit Lions running back Zach Zenner is going on injured reserve with cracked ribs and a partially collapsed lung. \nCoach Jim Caldwell said that Zenner was in the hospital after being injured in Sunday’s overtime win over Chicago. Caldwell said Zenner would go on IR “at some point in time” but that his condition was improving. \nZenner has 60 yards on 17 carries this season. Saints get rid of kicker \nThe New Orleans Saints have decided to make a change at kicker, releasing Zach Hocker and replacing him with Kai Forbath, said a person familiar with the situation. \nHocker missed two field goal attempts during Thursday night’s Saints victory over Atlanta, dropping him to 9 of 13 on the season. Two weeks earlier, Hocker had missed a potential game-winning field goal against Dallas, hitting the left upright. However, the Saints won that game in overtime. \nForbath kicked for the Washington Redskins from 2012 until his release last month and has made 60 of 69 field-goal attempts in his career. He hit 24 of 27 attempts last season.", "external_links": [], "published": "2015-10-20T00:33:00.000+03:00", "crawled": "2015-10-20T10:54:41.688+03:00", "highlightTitle": ""}