{"organizations": [], "uuid": "41d916780b011fe133ec20dfae9df843e3766c47", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "wtop.com", "main_image": "http://wtop.com/wp-content/uploads/2015/10/Bengals-Dalton-Football-.jpeg", "site_section": "http://wtop.com/section/sports/feed/", "section_title": "WTOP » Sections » Sports", "url": "http://wtop.com/nfl/2015/10/bengals-dalton-changing-perceptions-with-his-torrid-start/", "country": "US", "title": "Bengals’ Dalton changing perceptions with his torrid start", "performance_score": 0, "site": "wtop.com", "participants_count": 1, "title_full": "Bengals’ Dalton changing perceptions with his torrid start", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T01:54:00.000+03:00", "replies_count": 0, "uuid": "41d916780b011fe133ec20dfae9df843e3766c47"}, "author": "wtopstaff", "url": "http://wtop.com/nfl/2015/10/bengals-dalton-changing-perceptions-with-his-torrid-start/", "ord_in_thread": 0, "title": "Bengals’ Dalton changing perceptions with his torrid start", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Home » News » Sports » NFL » Bengals' Dalton changing perceptions… Bengals’ Dalton changing perceptions with his torrid start By JOE KAY October 15, 2015 6:54 pm Cincinnati Bengals quarterback Andy Dalton discusses a play during practice outside Paul Brown Stadium, Thursday, Oct. 15, 2015, in Cincinnati. (AP Photo/John Minchillo) \nCINCINNATI (AP) — Andy Dalton got accustomed to hearing boos as he led the Bengals to the playoffs each of his first four seasons. Every interception brought another torrent. Every playoff loss seemed to seal his reputation. \nCan’t win the big one. Not cool under pressure. He’ll never be one of the elites. \nAt the start of training camp last year, he was greeted by a fan banner calling for his backup to start. When he was introduced before the All-Star celebrity softball game at Great American Ball Park last July, he was booed. \nHe was blamed for the Bengals’ inability to get past the first round of the playoffs. \n“He’s been under a lot of pressure here from Day One,” left tackle Andrew Whitworth said. “You look at the top guys in the league right now. A lot of those guys didn’t play from Day One, so they didn’t have to go through the bumps and bruises of being a young player and getting criticized like he’s had to.” \nNot anymore. \nDalton is changing the public’s perception with his torrid start. The fifth-year quarterback has been spectacular during the Bengals’ 5-0 run, ranking among the NFL’s top passers in every category. \nHeading into a game at Buffalo (3-2) on Sunday, Dalton’s passer rating of 115.6 ranks third behind Tom Brady and Aaron Rodgers. He leads the NFL with a passer rating of 154.7 in the fourth quarter — Carson Palmer is next at 137.8. \nThe conversation has changed. \n“When you hear people talking about you, you don’t want them talking negatively about you,” Dalton said. “Obviously I’ve had to bear a lot of it. But we’re 5-0 right now. Hopefully at the end of the year they’re still talking the same way.” \nDalton has provided hints that this start might have staying power. \nHe worked on his throwing in the offseason and has been much more accurate on his long passes. He has a full complement of targets with tight end Tyler Eifert and receiver Marvin Jones recovered from significant injuries. And he has a better understanding of what opposing defenses are doing, allowing him to react quickly. \nThrough five games, he has been sacked only six times and thrown two interceptions. Offensive coordinator Hue Jackson described Dalton as “a different cat. He doesn’t blink, he doesn’t flinch. \n“I think it’s confidence,” Jackson said. “I keep hearing the term ‘swag.’ He’s swagged out. He is playing his tail off.” \nDalton also has taken more of a leadership role in correcting mistakes during practice and leading team meetings. He’s been more vocal about what players need to do in order for the offense to succeed. \n“It’s part of what’s been asked of me and what I feel is necessary, so the receivers are seeing what I’m seeing and we’re all on the same page,” Dalton said. “I think guys understand what I’m seeing and what I expect from them and vice versa. I think it’s definitely helped us.” \nTeammates have noticed the changes in how Dalton plays and how he leads this year. \n“He’s in what I call that constant pursuit of greatness, and that’s what he wants,” Whitworth said. “He wants to be great. He’ll never say that because that’s the kind of person he is, but that’s what he wants. Every week I see him trying to do something to achieve that.” \nNotes: CB Leon Hall (back) was limited in practice on Thursday. Everyone else participated fully. Hall was held out of Wednesday’s practice completely, so his limited participation was an improvement. \n___ \nAP NFL website: www.pro32.ap.org and AP NFL Twitter feed: www.twitter.com/AP_NFL Topics:", "external_links": [], "published": "2015-10-16T01:54:00.000+03:00", "crawled": "2015-10-16T02:11:27.778+03:00", "highlightTitle": ""}