{"organizations": [], "uuid": "ccb8c9e88d5766f88897e4baf03b02582e0cc8ac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports", "section_title": "Sports News, Scores, Schedules, Standings, Stats, Photos, Videos - MSN Sports", "url": "http://www.msn.com/en-us/sports/nfl/browns-manziel-active-for-game-manuel-to-start-for-bills/ar-AAfAvDk", "country": "US", "title": "Browns' Manziel active for game; Manuel to start for Bills", "performance_score": 0, "site": "msn.com", "participants_count": 1, "title_full": "Browns' Manziel active for game; Manuel to start for Bills", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T03:00:00.000+03:00", "replies_count": 0, "uuid": "ccb8c9e88d5766f88897e4baf03b02582e0cc8ac"}, "author": "Odom continues to make progress", "url": "http://www.msn.com/en-us/sports/nfl/browns-manziel-active-for-game-manuel-to-start-for-bills/ar-AAfAvDk", "ord_in_thread": 0, "title": "Browns' Manziel active for game; Manuel to start for Bills", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Browns' Manziel active for game; Manuel to start for Bills Associated Press 53 mins ago © AP Photo/David Richard, File FILE - In this Sunday, Sept. 20, 2015 file photo, Cleveland Browns quarterback Johnny Manziel celebrates after a 60-yard touchdown pass to wide receiver Travis Benjamin in the first half of an NFL football game against the Tennessee Titans in Cleveland. Browns quarterback Johnny Manziel was involved in a domestic dispute with his girlfriend that police say involved alcohol, Friday, Oct. 16, 2015. The latest from NFL games around the league on the sixth Sunday of the season (all times EDT):\nAdChoices 11:55 a.m.\nThe Minnesota Vikings have a surprise scratch from the lineup: defensive end Everson Griffen.\nGriffen was out with an unspecified illness, according to the team, leaving the Vikings without their best pass rusher against Kansas City. The Chiefs allowed 22 sacks over their first five games, tied for most in the NFL with Seattle.\nGriffen has three sacks in four games this season. In his past 20 games since becoming a full-time starter, he has 15 sacks. The Vikings were also without backup defensive end Justin Trattou, who was out for the second straight game because of a foot injury. That left them with only three healthy defensive ends: starter Brian Robison, rookie Danielle Hunter and second-year pro Scott Crichton. Hunter was in the starting lineup for Griffen.\n— Dave Campbell reporting from Minneapolis.\n___\n11:50 a.m.\nBrowns quarterback Johnny Manziel is active for Sunday's game despite being involved in a domestic incident this past week.\nManziel will back up starter Josh McCown as the Browns host the unbeaten Denver Broncos.\nManziel acknowledged to police that he drank alcohol on Monday before the former Heisman Trophy winner and his girlfriend, Colleen Crowley, were questioned after they were involved in a heated argument on the highway. According to a police report, Manziel was driving at a high rate of speed and passed cars on the shoulder before police were called.\nManziel was not arrested.\nThe Browns released a statement Friday saying they had spoken to Manziel about his behavior. However, the team did not exclude him from Sunday's game.\nThe incident raised concerns about Manziel, who spent 70 days in a rehab facility during the offseason for an unspecified condition.\n— Tom Withers reporting from Cleveland.\n___\n11:40 a.m.\nBills starting quarterback Tyrod Taylor is out, and running back LeSean McCoy is returning after missing two weeks for Buffalo's game against the Cincinnati Bengals.\nBackup EJ Manuel will make his first start in a little more than a year in place of Taylor, who sprained his left knee in a 14-13 win over Tennessee last weekend. McCoy returned to practice last week, and will start after being nagged by a pulled left hamstring he initially injured during training camp.\nBuffalo is still without backup running back Karlos Williams, who will miss his second straight game with a concussion.\nStarting receiver Sammy Watkins is active after missing two weeks with a right calf injury. However, receiver Percy Harvin has been ruled out because of a hip injury.\n— John Wawrow reporting from Orchard Park, New York.\n___\nAP NFL websites: http://pro32.ap.org and http://twitter.com/AP_NFL\nGo to MSN Home", "external_links": ["http://twitter.com/AP_NFL", "http://ap.org/", "http://go.microsoft.com/fwlink/?LinkID=286759"], "published": "2015-10-18T03:00:00.000+03:00", "crawled": "2015-10-18T19:50:58.065+03:00", "highlightTitle": ""}