{"organizations": [], "uuid": "3e9939c5b9440da4d278ab22b865c0f9cb9c6540", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/47529300.cms", "site_section": "http://timesofindia.indiatimes.com/rssfeeds/4719148.cms", "section_title": "The Times of India Sports: Extensive sports coverage, key statistics and free downloads", "url": "http://timesofindia.indiatimes.com/sports/badminton/Nagpurs-Lakhani-replaces-Gandhe-as-MBA-president/articleshow/49448159.cms", "country": "IL", "title": "Nagpurs Lakhani replaces Gandhe as MBA president", "performance_score": 0, "site": "indiatimes.com", "participants_count": 1, "title_full": "Nagpurs Lakhani replaces Gandhe as MBA president - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T13:33:00.000+03:00", "replies_count": 0, "uuid": "3e9939c5b9440da4d278ab22b865c0f9cb9c6540"}, "author": "timesofindia.indiatimes.com", "url": "http://timesofindia.indiatimes.com/sports/badminton/Nagpurs-Lakhani-replaces-Gandhe-as-MBA-president/articleshow/49448159.cms", "ord_in_thread": 0, "title": "Nagpurs Lakhani replaces Gandhe as MBA president", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NAGPUR: The Orange City is slowly and surely becoming the power centre. Chief minister Devendra Fadnavis is from city, BCCI chief Shashank Manohar is from city and now Maharashtra Badminton Association (MBA) president is also from the city.\n\nArun Lakhani has been unanimously elected as the MBA president after Pradeep Gandhe decided to step down after 13 years at the helm.\n\nNagpur's Lakhani, who was co-opted as the executive member in MBA few months ago, has been given the responsibility to head the governing badminton body in the state.\n\nGandhe, who is also the vice-president of the Badminton Association of India, has just completed one year of his fourth successive term as the MBA chief. For the remaining three years, Lakhani will be the MBA chief. Gandhe will be the senior vice-president of MBA.\n\nLakhani praised Gandhe for voluntarily stepping down. \"We don't see people leaving their chair these days. It was a very good decision on his part to make for someone new. He will be there with us and we will need his support always,\" said Lakhani, whose younger son Sarang is an international shuttler.\n\n\"Together we will make the difference in the state badminton. Mr Gandhe will basically handle the game part and I will look after the administration and other things. We want to make lot of changes for the betterment of the game in the state,\" said Lakhani.\n\nGandhe's request to step down was agreed to after much reluctance from the executive committee and he would continue to be associated with the MBA in his capacity as a senior vice-president of the committee. Stay updated on the go with Times of India News App. Click here to download it for your device.", "external_links": [], "published": "2015-10-19T13:33:00.000+03:00", "crawled": "2015-10-19T14:08:39.852+03:00", "highlightTitle": ""}