{"organizations": ["Manchester United", "BST Manchester United"], "uuid": "596406c3e544c955ecf1908dfa27fa2a3e903cc1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ibtimes.co.uk", "main_image": "http://d.ibtimes.co.uk/en/full/1456523/marcos-rojo.jpg", "site_section": "http://www.ibtimes.co.uk/rss/sports", "section_title": "IBTimes.co.uk : Sports", "url": "http://www.ibtimes.co.uk/manchester-united-injury-news-marcos-rojo-withdrawn-argentina-squad-amid-transfer-rumours-1522572", "country": "US", "title": "Manchester United injury news: Marcos Rojo withdrawn from Argentina squad amid transfer rumours", "performance_score": 0, "site": "ibtimes.co.uk", "participants_count": 0, "title_full": "Manchester United injury news: Marcos Rojo withdrawn from Argentina squad amid transfer rumours", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T20:19:00.000+03:00", "replies_count": 0, "uuid": "596406c3e544c955ecf1908dfa27fa2a3e903cc1"}, "author": "", "url": "http://www.ibtimes.co.uk/manchester-united-injury-news-marcos-rojo-withdrawn-argentina-squad-amid-transfer-rumours-1522572", "ord_in_thread": 0, "title": "Manchester United injury news: Marcos Rojo withdrawn from Argentina squad amid transfer rumours", "locations": ["Argentina"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Marcos Rojo"], "text": "October 5, 2015 18:19 BST Manchester United defender Marcos Rojo has missed the last four games Getty \nMarcos Rojo has been been withdrawn from the Argentina squad for their upcoming World Cup 2018 qualifiers against Ecuador and Paraguay. Gerardo Martino called the Manchester United defender up to his 26-man squad despite him not playing a match since suffering a hamstring injury in the 3-2 victory over Southampton on 20 September. \nLouis van Gaal voiced then his anger at Rojo after the incident, saying the Argentinian had not let the medical staff know about his injury quickly enough. With Luke Shaw out for much of the season with a double broken leg, this leaves the Red Devils without a proven left-back. \nRojo has so far missed the games against Ipswich Town, Sunderland, Wolfsburg and Arsenal. Van Gaal has played both Matteo Darmian and Ashley Young out of position in his absence, with neither covering themselves in glory in the role. \nTYC Sport reported that Van Gaal had refused to let Rojo join up with his national side, as if he is unfit for club football he should be unfit for international football as well. \nRojo has clarified the position, though, retweeting journalist @ManuOlivari ,who said: \"Rojo has not felt out with Van Gaal. The defender spoke with both Martino and Van Gaal and then agreed [to be withdrawn from the national team].\" . @MarcosRojo5 NO está peleado con van Gaal. El defensor habló con Martino y con van Gaal, y se consensuó esta situación. Twitter @ManuOlivari \nThe same journalist later confirmed that Argentina have withdrawn the player from international duty in order to let him complete his recovery in Manchester. \nThe Mirror recently reported that Rojo could be moved to Zenit Saint Petersburg in the January window, with the ramifications from the injury and the national team call-up causing unrepairable damage to his relationship with LVG. \nRojo, however, later retweeted another journalist to deny that. Marcos Rojo no se recuperó del desgarro y por eso es baja. Aclaración? No tiene ningún problema con Van Gaal ni se está buscando club. — Martin Arevalo (@arevalo_martin) octubre 5, 2015 Twitter @arevalo_martin \n\"Marcos Rojo did not recover from his injury and is therefore out of the Argentina squad. Clarification? He has no problem with Van Gaal and neither is looking for another club\". More about Marcos Rojo", "external_links": [], "published": "2015-10-05T20:19:00.000+03:00", "crawled": "2015-10-05T21:49:22.459+03:00", "highlightTitle": ""}