{"organizations": [], "uuid": "52716e893f1717ebffb8b11ccec7b4d04609029a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sport.co.uk", "main_image": "http://images.sport.co.uk/150x150/c039ced66c2c55afc10b18ef52381d6f.jpg", "site_section": "http://feeds.feedburner.com/SportcoukNewsRssFeed", "section_title": "General Sports News from Sports.co.uk", "url": "http://www.sport.co.uk/football/claudio-ranieri-praises-riyad-mahrezs-part-in-winning-goal/6989459/", "country": "JE", "title": "Claudio Ranieri praises Riyad Mahrez's part in winning goal", "performance_score": 0, "site": "sport.co.uk", "participants_count": 0, "title_full": "Claudio Ranieri praises Riyad Mahrez's part in winning goal", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T16:16:00.000+02:00", "replies_count": 0, "uuid": "52716e893f1717ebffb8b11ccec7b4d04609029a"}, "author": "", "url": "http://www.sport.co.uk/football/claudio-ranieri-praises-riyad-mahrezs-part-in-winning-goal/6989459/", "ord_in_thread": 0, "title": "Claudio Ranieri praises Riyad Mahrez's part in winning goal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Claudio Ranieri", "Riyad Mahrez"], "text": "Claudio Ranieri praises Riyad Mahrez's part in winning goal 25 Oct 2015 14:16:58 \ncomments \nJamie Vardy grabbed the headlines with Leicester's winning goal against Crystal Palace but the contribution of Riyad Mahrez was not lost on City boss Claudio Ranieri. \nVardy's 59th-minute strike, his 10th goal of the season, saw him join Ruud van Nistelrooy, Daniel Sturridge, Mark Stein, Ian Wright, Alan Shearer, Thierry Henry and Emmanuel Adebayor as the only players to score in seven consecutive Barclays Premier League matches. \nBut the striker's place in the history books was made possible by Mahrez. \nAfter a loose defensive header, Brede Hangeland then mis-hit a clearance straight to the Algerian who sent Vardy racing through on goal with a perfectly-weighted first-time pass. \nVardy beat Palace goalkeeper Wayne Hennessey with a lovely lofted finish, although he had to make sure the ball reached the net, blasting it home from inside the six-yard box. \nRanieri said: \"Jamie scored a great goal but i t was amazing how Riyad Mahrez passed the ball for him. It was good skill, one touch, a fantastic ball and Jamie made a very good goal. \n\"They made a mistake and then it was a great pass from Riyad Mahrez. I think 95 per cent of players would control the ball then pass it. He did it with one touch and put the ball in for Jamie in front of the keeper and Jamie scored a great goal. \n\"He is in great form and all of my players have very good stamina until the end. The more important thing is that they believe anything can happen.\" \nSaturday's 1-0 win saw Leicester keep a clean sheet for the first time this season - at the 12th time of asking. \nRanieri added: \"I'm glad because it was a very difficult match. Crystal Palace have big, strong and fit players. It was a battle. \n\"I am Italian, we like the clean sheets. Every time we concede a goal it hurts us.\" \nAfter a rare away defeat for Palace, manager Alan Pardew immediately turned his attention to the next game on the road - Wednesday night's Capital One Cup tie at Manchester City. \n\"It makes a difference to bounce back now,\"said Pardew. \n\"We have a big cup game to look forward to and also for our travelling fans, because they would be frustrated (about Saturday) and disappointed like I am. \n\"Hopefully we can get them a win on the road.\" Related Sport News", "external_links": [], "published": "2015-10-25T16:16:00.000+02:00", "crawled": "2015-10-25T20:20:19.687+02:00", "highlightTitle": ""}