{"organizations": ["The Times Union Center"], "uuid": "089870bf044360c3542a3897ee1878c7918b899d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.northjersey.com", "main_image": "http://www.northjersey.com/designimages/NorthJerseyFacebook_377x196.jpg", "site_section": "http://www.northjersey.com/cmlink/sports-rss.rss", "section_title": "Sports News on NorthJersey.com", "url": "http://www.northjersey.com/sports/basketball/short-handed-nets-lose-hollis-jefferson-1.1430172", "country": "US", "title": "Short-handed Nets lose Hollis-Jefferson", "performance_score": 0, "site": "northjersey.com", "participants_count": 0, "title_full": "Short-handed Nets lose Hollis-Jefferson", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T08:21:00.000+03:00", "replies_count": 0, "uuid": "089870bf044360c3542a3897ee1878c7918b899d"}, "author": "", "url": "http://www.northjersey.com/sports/basketball/short-handed-nets-lose-hollis-jefferson-1.1430172", "ord_in_thread": 0, "title": "Short-handed Nets lose Hollis-Jefferson", "locations": ["N.Y.", "Hollis-Jefferson ALBANY"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Rondae Hollis-Jefferson"], "text": "ALBANY, N.Y. — Rondae Hollis-Jefferson walked deliberately down a hallway at The Times Union Center early Saturday evening. \nHe said he was OK. But he couldn’t hide a slight limp. \nIt’s a scene that’s becoming all too familiar for the Nets this preseason. \nBrooklyn fell to the Sixers, 97-95, but the larger concern is the rash of injuries that is afflicting Brooklyn. \nHollis-Jefferson, the Nets’ rookie forward, was the latest victim. He suffered a sprained right ankle in the fourth quarter and did not return. \nJefferson said he’s \"good\" and that he plans to play again this preseason. That, of course, will be up to the Nets’ medical staff. \nThe Nets were already playing short-handed. \nAndrea Bargnani (tight left hamstring), Bojan Bogdanovic (sore right ankle), Thomas Robinson (right wrist sprain) and Willie Reed (right quad strain) all sat out — the team has given no timetable when any will return. \nCoach Lionel Hollins said \"there’s no concern\" that any of the injured will miss the regular-season opener Oct. 28 against Chicago. \nMarkel Brown also missed the game with a left oblique strain. The Nets have ruled him out for the remainder of the preseason. An update will be issued before the regular season. \nChris McCullough, a rookie out of Syracuse, is still recovering from a torn ACL he suffered in January with the Orange. The Nets said last week the goal for McCullough is to get on the court this season. \nHollis-Jefferson was injured trying to chase down an errant, full-court pass from center Chris Daniels. The rookie tracked the ball down near the corner, planted awkwardly and fell to the floor in pain — clutching his leg before he hit the ground. He exited to the locker room and was ruled out of the game. \nHollis-Jefferson, a 20-year-old out of the University of Arizona, was picked 23rd overall in June’s NBA Draft. The Nets traded for him on draft night, sending Mason Plumlee to Portland as part of the deal. \nNow he must battle an injury as he tries to learn the ways of the NBA. \n\"It’s life. It’s basketball. Things happen,\" Hollis-Jefferson said. \"You just have to keep a focused mind, just keep a straight path and just keep working.\" \nThe Nets kept it close in the final minutes — and Hollins inserted starters Joe Johnson (13 points), Jarrett Jack (20 points), Thaddeus Young (9 points) and Brook Lopez (13 points) in the final minutes. Lopez — who has a lengthy injury history — only stayed on the court for 16 seconds before Hollins thought better of it. \n\"I wanted them to play down the stretch,\" Hollins said. \"They hadn’t played down the stretch in the last game, and I just didn’t want to keep those other guys in there and I wanted to see if they could win. … But obviously the scoreboard showed we didn’t make enough plays.\" © 2015 North Jersey Media Group Tags:", "external_links": [], "published": "2015-10-11T08:21:00.000+03:00", "crawled": "2015-10-11T18:22:11.242+03:00", "highlightTitle": ""}