{"organizations": [], "uuid": "c1697eaa7ac9360dd9df4b3959dea0b16ffe645e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.modernghana.com", "main_image": "http://img.modernghana.com/images/content/johnterry620x400.jpg", "site_section": "http://www.modernghana.com/rssfeed/news.xml?cat_id=2&gender=1", "section_title": "Sports News", "url": "http://www.modernghana.com/sports/646912/2/jose-mourinho-still-has-chelsea-players-support-jo.html", "country": "US", "title": "Jose Mourinho Still Has Chelsea Players Support John Terry", "performance_score": 0, "site": "modernghana.com", "participants_count": 0, "title_full": "Jose Mourinho Still Has Chelsea Players Support John Terry", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T00:04:00.000+03:00", "replies_count": 0, "uuid": "c1697eaa7ac9360dd9df4b3959dea0b16ffe645e"}, "author": "", "url": "http://www.modernghana.com/sports/646912/2/jose-mourinho-still-has-chelsea-players-support-jo.html", "ord_in_thread": 0, "title": "Jose Mourinho Still Has Chelsea Players Support John Terry", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["John Terry", "Jose Mourinho"], "text": "  22:04 CET Jose Mourinho Still Has Chelsea Players’ Support – John Terry By espnfc \nJohn Terry says Jose Mourinho is still “the best manager” and that he retains the backing of the Chelsea players. \nMourinho has come under pressure after a dismal start to the season but, speaking after Saturday’s 3-1 home defeat to Southampton, the Portuguese warned the club not to sack “the best manager this club has ever had.” \nThere have been suggestions that some of the Chelsea players no longer have full faith in Mourinho’s methods , but Terry insists he should receive the support required to turn the club’s season around. \nThe Chelsea captain — who made his first Premier League appearance since Sept. 12 on Saturday — said in the Sunday Mirror : “We have a big group of players and we have the best manager, who we remain behind, and we remain together \n“That is what you do in tough circumstances.” \nThe 34-year-old, who first established himself in the Chelsea side under Claudio Ranieri, has seen owner Roman Abramovich make a number of managerial changes since Mourinho’s first stint at Stamford Bridge came to an end in 2007. \nHe added: “I have been here a long time and I have seen managers come and go and if anyone is going to get us out of this hole it is going to be Jose Mourinho. \n“The players will remain together and fight, and keep fighting for the supporters because they were excellent on Saturday. \n“We are not in the familiar position we are normally in. We find ourselves in it and it is down to the group of players and the manager to get ourselves out of it and we must do that very soon.” \nHe said the senior players must show leadership to ensure Chelsea recover the form that saw them crowned Premier League champions last season. \n“Generally I think we are looking low on confidence but we have a big group of players in that dressing room and we need to stand up, which we will do,” he said. “There is no difference from last season. \n“We need to be hungry like we were. Like many teams find, it is difficult to come back after winning the Premier League, we have seen it with Man City. \n“We are suffering a bit of late but we have big characters in the dressing room and we will remain together along with the manager and get ourselves out of this.” \n-espnfc", "external_links": [], "published": "2015-10-05T00:04:00.000+03:00", "crawled": "2015-10-05T08:49:06.432+03:00", "highlightTitle": ""}