{"organizations": [], "uuid": "5c785fdbc6c8212f36f7fb806631cbb21db3e168", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.odt.co.nz", "main_image": "", "site_section": "http://www.odt.co.nz/sport/other/feed", "section_title": "Otago Daily Times: Other Sports News", "url": "http://www.odt.co.nz/sport/other-sport/360712/surf-life-saving-pair-triumph-over-physical-adversity", "country": "NZ", "title": "Surf life-saving: Pair triumph over physical adversity", "performance_score": 0, "site": "odt.co.nz", "participants_count": 1, "title_full": "Surf life-saving: Pair triumph over physical adversity", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T18:25:00.000+02:00", "replies_count": 0, "uuid": "5c785fdbc6c8212f36f7fb806631cbb21db3e168"}, "author": "Steve Hepburn", "url": "http://www.odt.co.nz/sport/other-sport/360712/surf-life-saving-pair-triumph-over-physical-adversity", "ord_in_thread": 0, "title": "Surf life-saving: Pair triumph over physical adversity", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "It is a tough event, the race to White Island. \nIt was something of a violent trip from a rugged St Clair beach to the island and back on Saturday with torrid surf to overcome. \nBut two placegetters in the annual event overcame more than the high seas and the back-breaking paddle out to the island to feature in the money. \nScott Martlew, of Christchurch, who was second in the surf-ski ranks and third overall, managed to complete the 5km race with just one leg. \nMartlew lost his left leg after taking a hit \nin a rugby match in 2010. Complications set in with a flesh-eating bacteria getting into the leg and eventually it was amputated up to the buttock. \nBut that did not slow the Christchurch man down and he has got back into sport through kayaking. \nHe is aiming for the Paralympics in Rio de Janeiro next year and used the race on Saturday to get some endurance training under his belt. \nRight behind Martlew in the surf-ski was Dunedin man Ryan Shanks. \nShanks had to have a kidney transplant late last year after he contracted a kidney disease. \nHe was expected to be out of the water for a long time but has bounced back, getting right into the thick of the action, and finished a couple of minutes behind Martlew on Saturday. \nFirst home in the surf-ski and first back overall was Zac Quickenden, of Christchurch, in a time of 27min 40sec. \nSecond home overall was the beach boat crew from North Beach from Christchurch. \nThe veteran St Clair team of Graeme Newton, Rob Creasy, Peter Haslemore and Greg Page won the canoe gradeThe crew, with a combined age of 219, managed to pilot their canoe home while 10 of the 45 competitors did not finish the race. \nThe changing nature of the St Clair beach forced the event to be staged north of the St Clair club rooms. \nAn inability to get vehicles down on to the sand made for some tough work shifting the boards and boats on to the beach. »", "external_links": [], "published": "2015-10-25T18:25:00.000+02:00", "crawled": "2015-10-25T20:53:41.844+02:00", "highlightTitle": ""}