{"organizations": [], "uuid": "208c1bca47f15066bf3d519cf2fd4adca4e34c6f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "wtop.com", "main_image": "", "site_section": "http://wtop.com/section/sports/feed/", "section_title": "WTOP » Sections » Sports", "url": "http://wtop.com/nba/2015/10/late-dunk-by-kelly-gives-lakers-win-over-blazers/", "country": "US", "title": "Late dunk by Kelly gives Lakers win over Blazers", "performance_score": 0, "site": "wtop.com", "participants_count": 1, "title_full": "Late dunk by Kelly gives Lakers win over Blazers", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T08:08:00.000+03:00", "replies_count": 0, "uuid": "208c1bca47f15066bf3d519cf2fd4adca4e34c6f"}, "author": "wtopstaff", "url": "http://wtop.com/nba/2015/10/late-dunk-by-kelly-gives-lakers-win-over-blazers/", "ord_in_thread": 0, "title": "Late dunk by Kelly gives Lakers win over Blazers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Home » News » Sports » NBA » Late dunk by Kelly… Late dunk by Kelly gives Lakers win over Blazers By JOE RESNICK October 20, 2015 1:08 am \nLOS ANGELES (AP) — Ryan Kelley drove the lane for a tiebreaking dunk off an inbounds play with 2 seconds remaining, Jordan Clarkson scored 17 points and Lakers No.1 draft pick D’Angelo Russell scored eight of his 12 points in the final 3 1-2 minutes, leading Los Angeles to a 104-102 preseason victory over the Portland Trail Blazers on Monday night. \nRussell, the second overall pick in the draft, hit three jumpers during a 2-minute span — the last one with 1:28 remaining to give the Lakers a 98-89 cushion. \nPortland responded with a 13-4 run, tying the score on a 3-pointer by Pat Connaughton with 4.8 seconds to go. But Kelly took Jabari Brown’s inbounds pass from the left sideline and soared over Noah Vonleh for the winning points. Portland’s last gasp was a missed 20-footer at the buzzer by Vonleh off an inbounds pass from Omari Johnson. \nKOBE BRYANT UPDATE: The NBA’s third all-time leading scorer missed his second straight game because of a bruised left leg. “He’ll come in tomorrow, get treatment and probably get on the court a little bit,” coach Byron Scott said. “He wants to play Thursday, and he’s told me that in our conversations. If he feels a hundred percent, we’ll go from there. If he doesn’t, we’ll wait until next Wednesday (opening night).” \nPOP GOES THE SHOULDER: Lakers rookie F Jonathan Holmes left the game with 10:49 left in the second quarter because of a dislocated right shoulder, which occurred when he dove for a loose ball and Portland G Allen Crabbe fell on him. X-rays were negative for a fracture, but the shoulder will be immobilized for a couple of weeks. \nBACK IN FAMILIAR SURROUNDINGS: Portland F Ed Davis played 17 minutes and had five points in his first game at Staples Center since leaving the Lakers after one season to sign three-year, $20 million contract in July as a free agent. The Blazers are his fourth team in six NBA seasons. “His presence in the paint and his shot-blocking ability was big for us last year,” Scott said. “He’s a very good post defender, and he likes those challenges. He was great in practice — and obviously, in the games, he got better and better for us. But I think we miss Ed in the lockerroom, more than anything. He was just a great guy to be around. So we miss all that from Ed — but you’ve got to move on. He’s moved on, and I’m sure he’s pretty happy in Portland.” \nUP NEXT: The Trail Blazers are back at Staples Center Tuesday night to play the Clippers. The Lakers wrap up their preseason slate Thursday night against the defending NBA champion Golden State Warriors at Anaheim’s Honda Center. Topics:", "external_links": [], "published": "2015-10-20T08:08:00.000+03:00", "crawled": "2015-10-20T08:38:25.159+03:00", "highlightTitle": ""}