{"organizations": ["San Diego State Tubby Smith Tyler Sash Hospitalized", "Aaron Hernandez Cristiano Ronaldo Lamar Odom Minnesota Timberwolves Montain West"], "uuid": "e7a1977894698b6dd3758c3a7d1dfcb0d42a2194", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.spokesman.com", "main_image": "http://media.spokesman.com/img/logos/sr200.png", "site_section": "http://www.spokesman.com/feeds/stories/sports/", "section_title": "Spokesman.com: Sports stories", "url": "http://www.spokesman.com/stories/2015/oct/13/newsmaker-lamar-odom-cristiano-ronaldo-aaron-herna/", "country": "US", "title": "Tuesday’s sports newsmakers - Tue, 13 Oct 2015 PST", "performance_score": 0, "site": "spokesman.com", "participants_count": 0, "title_full": "Tuesday’s sports newsmakers - Tue, 13 Oct 2015 PST", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T06:53:00.000+03:00", "replies_count": 0, "uuid": "e7a1977894698b6dd3758c3a7d1dfcb0d42a2194"}, "author": "", "url": "http://www.spokesman.com/stories/2015/oct/13/newsmaker-lamar-odom-cristiano-ronaldo-aaron-herna/", "ord_in_thread": 0, "title": "Tuesday’s sports newsmakers - Tue, 13 Oct 2015 PST", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Email Tags: Aaron Hernandez Cristiano Ronaldo Lamar Odom Minnesota Timberwolves Montain West basketball San Diego State Tubby Smith Tyler Sash Hospitalized \nFormer NBA and reality TV star Lamar Odom was hospitalized after he was found unconscious Tuesday at a Pahrump, Nevada brothel, authorities said. \nThe Nye County Sheriff’s Department was called at about 3:15 p.m. to Love Ranch in Crystal, Nevada about 70 miles outside of Las … Hospitalized \nFormer NBA and reality TV star Lamar Odom was hospitalized after he was found unconscious Tuesday at a Pahrump, Nevada brothel, authorities said. \nThe Nye County Sheriff’s Department was called at about 3:15 p.m. to Love Ranch in Crystal, Nevada about 70 miles outside of Las Vegas for a report of an unresponsive man needing an ambulance, Sheriff Sharon A. Wehrly said in a statement. \nOdom was stabilized and taken to Desert View Hospital in nearby Pahrump, the statement said. Officials then tried to have him airlifted to Las Vegas, but he was too tall for the helicopter that was available and he was driven by ambulance to Sunrise Hospital and Medical Center. \nThere was no further word on Odom’s condition. \nThe emergency call came from Richard Hunter, media director for Dennis Hof, who owns the Love Ranch and other brothels in Nevada, the sheriff’s statement said. Hof did not immediately reply to a request for comment. \nHis hospitalization was first reported by TMZ. \nThe 35-year-old last played in the NBA in 2013 and saw reality TV fame through his four-year marriage to Khloe Kardashian. Awarded \nCristiano Ronaldo received his record fourth Golden Boot award after leading all scorers in Europe’s domestic leagues last season. \nRonaldo scored 48 goals in 35 Spanish league games to claim his third Golden Boot playing for Real Madrid. His other award came with Manchester United in 2007-08. No other player has won four. \nRonaldo was accompanied at the gala in Madrid by his mother, his son, Madrid coach Rafa Benitez, club president Florentino Perez and the Portuguese ambassador to Spain. \nThe 30-year-old Ronaldo became Madrid’s all-time leading scorer on Sept. 30 with 324 goals, surpassing Raul Gonzalez’s previous mark. Postponed \nA judge on Tuesday agreed to postpone the double murder trial of former New England Patriots player Aaron Hernandez while prosecutors try to get their hands on evidence now held by a law firm that previously represented him. \nThe trial in the 2012 killings of two Boston men was scheduled to begin Dec. 1. Judge Jeffrey Locke moved the start date to Jan. 19 after holding a lengthy closed-door hearing. \nNeither side nor the judge would say what that evidence is. But Locke did say it relates to a defendant’s right to seek confidential legal advice from a lawyer. \nA law enforcement official close to the investigation told The Associated Press that the issue centers on whether prosecutors should be allowed to have access to Hernandez’s cellphone. The official was not authorized to release details and spoke on condition of anonymity. \nHernandez, who was in court Tuesday, gave the cellphone to one of his lawyers in June 2013. \nHernandez was convicted this year in the June 2013 killing of Odin Lloyd, who was dating the sister of Hernandez’s fiancee. He is serving a life sentence. Honored \nTexas Tech’s Tubby Smith will receive the John R. Wooden Award’s Legends of Coaching honor in April. \nThe annual award recognizes coaches who exemplify Wooden’s standards of coaching success and personal integrity. \nSmith will receive the award at the ESPN College Basketball Awards show in Los Angeles on April 8. \nHe is 538-263 in 24 years as a head coach at Texas Tech, Minnesota, Kentucky, Georgia and Tulsa. He won a national championship at Kentucky in 1998, and has made four Elite Eight appearances, had nine Sweet 16 berths and posted 20 or more wins in 19 seasons while making 17 NCAA Tournament appearances. \nAmong previous winners of the award are Tara VanDerveer of Stanford, Roy Williams of Kansas, Mike Krzyzewski of Duke and Dean Smith of North Carolina. Determined \nFormer NFL and Iowa safety Tyler Sash died from an accidental overdose after mixing two powerful pain medications, and a history of painful injuries was a contributing factor, a medical examiner in Iowa City, Iowa, said Tuesday. \nAdditional studies will look at whether Sash, 27, suffered from chronic traumatic encephalopathy, a brain disease caused by repetitive trauma that has been found in several former NFL players. The results will be available in eight to 12 months, according to a statement from the Iowa State Medical Examiner’s office. \nSash, a standout safety at Iowa who won a Super Bowl during his rookie season with the New York Giants in 2012, was found dead at his home in Oskaloosa, Iowa, on Sept. 8. An autopsy was conducted the next day, but the results weren’t clear until laboratory results were completed. \nThe autopsy determined the cause and manner of death was an “accidental mixed drug toxicity involving methadone and hydrocodone,” the office said Tuesday. Both are legal narcotics used to relieve severe pain, but are also highly addictive. \nThe medical examiner said that a recent shoulder dislocation and a history of chronic shoulder pain suffered by Sash were also “significant conditions” in the death. \nOskaloosa Police Chief Jake McGee said investigators learned that Sash had a doctor’s prescription for hydrocodone but are not sure about how he obtained methadone. Renovate \nThe Minnesota Timberwolves have firmed up a timeline for the long-planned renovation of Target Center. \nThe team said Tuesday that the project will begin in the summer of 2016 and be completed in time for the NBA season starting in 2017. It has a budget of $129 million and plans to redo the exterior of the 25-year-old building. It will also add new locker rooms and suites, upgrade the bathrooms and bring a new scoreboard. \nThe Timberwolves will play in the building through the renovation. But the WNBA’s Lynx will have to move out of the building for the 2017 season while renovations are completed. It is not yet known where the Lynx will play. \nThe Wolves also announced an extension of the naming rights deal with Target. Favored \nSan Diego State, coming off its fifth regular-season Mountain West championship, is favored to win the league crown again, according to a media poll. \nThe Aztecs, who lost to eventual champion Duke in last season’s NCAA Tournament, received 22 of a possible 25 first-place votes and 272 points to earn the top spot in the Mountain West poll. \nBoise State, which tied with San Diego State for the regular-season title last season, was picked to finish second, earning two first-place votes and 234 points. \nThe poll was rounded out, in order, by Utah State, UNLV, Fresno State, New Mexico, Colorado State, Wyoming, Nevada, Air Force, and San Jose State.", "external_links": [], "published": "2015-10-14T06:53:00.000+03:00", "crawled": "2015-10-14T21:05:24.067+03:00", "highlightTitle": ""}