{"organizations": [], "uuid": "4666a3811a8979720efd250ab613c08fedee9a81", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.completesportsnigeria.com", "main_image": "http://www.completesportsnigeria.com/wp-content/uploads/2015/10/golden-eaglet1.jpg", "site_section": "http://www.completesportsnigeria.com/comments/feed/", "section_title": "Comments for Complete Sports Nigeria", "url": "http://www.completesportsnigeria.com/minute-by-minute-nigeria-vs-usa-2/", "country": "US", "title": "Comment on Minute by Minute: Nigeria Vs USA by pobolsky", "performance_score": 0, "site": "completesportsnigeria.com", "participants_count": 1, "title_full": "Comment on Minute by Minute: Nigeria Vs USA by pobolsky", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T23:59:00.000+03:00", "replies_count": 0, "uuid": "4666a3811a8979720efd250ab613c08fedee9a81"}, "author": "pobolsky", "url": "http://www.completesportsnigeria.com/minute-by-minute-nigeria-vs-usa-2/", "ord_in_thread": 0, "title": "Comment on Minute by Minute: Nigeria Vs USA by pobolsky", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Nigeria vs USA U17 World Cup Facts \nNigeria have won the U17 World Cup four times (1985, 1993, 2007, 2013), USA have not. \nNigeria have been runners up three times (1987, 2001, 2009). So in total, the Golden Eaglets have made seven appearances at the final of the U17 World Cup. \nUSA have made 15 appearances at the tournament. \n90+3- Nigeria win 2-0 after full time \n90+2- Chukwueze flagged offside. \n90- Three minutes of extra time has been added. \n89- John Lazarus heads the ball away for a corner to USA. \n88- Victor Osimhen fouled by Auston Trusty. The challenge earns him a straight red card. USA coach Ritchie Williams asks the fourth official questions on the decision. \n85- Freekick to Nigeria. Michael fouled. \nFunsho Bamgboye out, Samuel Chukwueze in; Nigeria substitution. \nOsinachi Ebere with the last touch of the ball, Adams for USA truncating his run. Chukwueze is lively and looks promising. \nJoe Gallardo out, Pierre Silva in. USA substitution \n78- Ejike Ukwu concedes a freekick. Udoh Akpan tips the ball across the post for a USa corner. The ball is booted out. Bamgboye is offside. \n76- Victor Osimhen flagged offside. \n75- Anumudu with a fierce shot. Corner for Nigeria \n72- Ejike Ikwu with a clearance. Throw-in to USA. \nThe Eaglets make a clumsy defensive clearance. The USA have been more lively bar the moments that led to Nigeria's goals. \n68- Udochukwu Anumudu's cross into the USA box is poor, it is saved by USA keeper. \nAnumudu is yellow-carded now for a foul. \n66- Akpan Udoh claims the ball from a freekick. \nMatthew Olosunde is down with a cramp. He is attended to by medics. \n64- Tyler Adams in, Matthew Olosunde out; USA substitution \n66- Akpan Udoh claims the ball from a freekick. \nMatthew Olosunde is down with a cramp. He is attended to by medics. \n63- Luca Torre in, Haji Wright out; USA substitution. \n61- Kingsley Michael in, Chukwudi Agbor out; Nigeria substitution \n61-GOAL!! Victor Osimhen scores Nigeria's second goal. The striker receives a pass from midfield and sides home with his left foot. \n59- Nigeria keeper Akpan Udoh saves. from a dangerous move. \n57- Haji Wright twists and turns but gets nothing from a dribbling move. However the Yanks win a freekick but waste the chance presented. \nNigeria win a corner but not utilised. \n55- Ejike Ikwu concedes a corner, but its cleared \n51- Victor Osimhen tries to turn and shoot at goal but his path to goal is blocked. Corner for Nigeria. \n50- GOAL. Chukwudi Agor scores Nigeria's first goal at the U17 World Cup. He pounced from a loose ball chased by Funsho Bamgboye. \n48- John Lazarus wins a throw-in for Nigeria. Osinachi Ebere wins a freekick for Nigeria. \n47- USA thwart a Nigerian move. \n45- Nigeria kick off \nThe Eaglets had 60% of the ball possession, USA. Nigeria had 9 shots on target, USA have 2. \n45- Nigeria kick off \nThe Eaglets had 60% of the ball possession, USA. Nigeria had 9 shots on target, USA have 2. \nHT: Nigeria 0-0 USA \n45- Chukwudi Agbor's shot is off target. \n44- Bamgboye holds onto the ball for too long. His teammates take up good positions but he loses possession. \n42- Nigeria's corner is cleared. \n40- USA forward, Wright, ghosts past Lukman Zakari but the ball taken from him. \n38- USA with a freekick, Kelechi Nwakali conceding that. \n35- Nigeria's Golden Eaglets in possession of the ball but Funsho Bamgboye loses it. Goalkick USA. \n33- Freekick to USA. Lazarus, the guilty party. \n27- Nigeria win a throw-in. The pace of this game has been slow, both sides not really setting the stadium alight but Bamgboye has been okay for Nigeria, Pulisic; the USA captain capable of causing worries for the Eaglets. \n25- Lazarus' cross is disappointing, not on target after what looked like a promising move. \nThe Yanks pass the ball around in their side of the pitch. \n21- Victor Osimhen' shot is out of touch. \n18- The Americans have attacked more, Nigeria okay with careful build-ups. \nA cross shot from Bamgboye goes wide. \n15- Freekick to USA, taken by John Nelson. Nigeria launch a counter now. Chukwudi Agbor's shot goes wide however \n13- A tricky USA move truncated. Bamgboye commits a foul. Freekick to USA \nThe American right is Matthew Olosunde; a Nigerian with American citizenship. \nGoal kick Nigeria. \n11- The Nigerian defence under threat but keeper Udoh gathers at second attempt. Nigeria get a corner now. \n9- Victor Akhimen latches onto a pass but skids his shot wide. Good chance wasted. \n7-Perez's lofted ball goes wide and off target. Ebere wins Nigeria a corner. \n5- Bamgboye wins Nigeria a throw-in. The Americans regain the ball but stopped in their tracks. \n3- Goal kick to USA. The Yanks pass the ball around but Victor Akhimen is fouled. Freekick to Nigeria. Nwakali's effort is caught by USA keeper Piulisic. \n2- A long ball from left back yields a corner for Nigeria \n1- USA kick off at the Estadio Nacional Julio Martinez in Santiago. Deniz Ayteniz is the referee for this game. \nThe weather is 22 degree centigrade \n\nWhat is your rating of the Golden Eaglets' performance? Do they have the promise to defend the title? \nSend in your views and opinions using the Use a Reply column.", "external_links": [], "published": "2015-10-18T23:59:00.000+03:00", "crawled": "2015-10-19T12:07:29.774+03:00", "highlightTitle": ""}