{"organizations": [], "uuid": "4260cb9fe24b7eef60689080217f7b5de384d191", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.al.com", "main_image": "http://imgick.al.com/home/bama-media/width620/img/alphotos/photo/2015/10/25/19050696-large.jpg", "site_section": "http://blog.al.com/sports_huntsville_impact/atom.xml", "section_title": "Sports Huntsville Impact", "url": "http://www.al.com/sports/index.ssf/2015/10/auburn_nfl_roundup_robenson_th_1.html", "country": "US", "title": "Auburn NFL roundup: Robenson Therezie seals Atlanta Falcons' victory", "performance_score": 0, "site": "al.com", "participants_count": 1, "title_full": "Auburn NFL roundup: Robenson Therezie seals Atlanta Falcons' victory | AL.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T11:27:00.000+02:00", "replies_count": 0, "uuid": "4260cb9fe24b7eef60689080217f7b5de384d191"}, "author": "Mark Inabinett | minabinett@al.com", "url": "http://www.al.com/sports/index.ssf/2015/10/auburn_nfl_roundup_robenson_th_1.html", "ord_in_thread": 0, "title": "Auburn NFL roundup: Robenson Therezie seals Atlanta Falcons' victory", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Safety Robenson Therezie 's first NFL interception sealed the Atlanta Falcons' 10-7 victory over the Tennessee Titans on Sunday.\nAfter making the Atlanta roster as an undrafted rookie, Therezie didn't play in the season-opener, but had started the previous two games with regular free safety Ricardo Allen nursing a knee injury. Even though Therezie made seven tackles in Atlanta's previous game, Allen reclaimed his starting spot on Sunday.\nDespite the demotion, Therezie still came through for Atlanta against the Titans. On a second-and-5 snap from the Atlanta 42-yard line, Therezie picked off a pass by quarterback Zach Mettenberger intended for wide receiver Kendall Wright. After his 10-yard return, Atlanta was able to run out the final 1:31 of its three-point victory.\n\"It's just what we talk about in practice,\" Therezie said . \"It's just regular to me. Just have to act like I've been there before. Finishing -- that's what we've been talking about. I was just sticking to the quarterback. We had a zone pressure going on. I know he had to get it out real quick, but I just read the quarterback, and I was right there.\"\nTherezie was among the 19 former Auburn players who got on the field on the seventh Sunday of the NFL's 2015 season.\nOther former Auburn players who started on Sunday included quarterback Cam Newton of the Carolina Panthers, middle linebacker Karlos Dansby of the Cleveland Browns, outside linebacker Josh Bynes of the Detroit Lions, left guard Ben Grubbs of the Kansas City Chiefs, left offensive tackle King Dunlap of the San Diego Chargers and left offensive tackle Greg Robinson of the St. Louis Rams.\nNewton helped the Panthers reach the first 6-0 record in franchise history with a 27-16 victory over the Philadelphia Eagles. Newton completed 14-of-24 passes for 197 yards and a touchdown with three interceptions and ran four times for 20 yards and a touchdown.\nRELATED: IS CAM NEWTON THE NFL'S MVP SO FAR THIS SEASON?\nCam Newton #CARvsPHI pic.twitter.com/tdhx1H7Aan\n— NFL (@NFLIive) October 26, 2015 Bynes led the Lions with eight tackles in their 28-19 loss to the Minnesota Vikings.\nOther former Auburn players seeing action on Sunday included Falcons long snapper Josh Harris, Panthers running back Cameron Artis-Payne, Houston Texans fullback Jay Prosch, Jacksonville Jaguars defensive tackle Sen'Derrick Marks and cornerback Nick Marshall, Chiefs outside linebacker Dee Ford, New England Patriots safety Brandon King, Oakland Raiders cornerback Neiko Thorpe, Pittsburgh Steelers wide receiver Sammie Coates, Rams linebacker Daren Bates and defensive tackle Nick Fairley and Titans defensive tackle Angelo Blackson.\nMarks knocked down two passes and made a key stop in the Jaguars' 34-31 victory over the Buffalo Bills in London. Marks stopped Buffalo quarterback E.J. Manuel for a 1-yard loss on a third-and-1 snap from the Bills 41-yard line in the fourth quarter. When Jacksonville stopped Buffalo on fourth down, the Jaguars ran out the final 57 seconds of their victory.\nFord made two tackles in Kansas City's 23-13 victory over Pittsburgh. One of them came when he stuffed Steelers running back DeAngelo Williams for no gain on a fourth-and-1 snap at the Kansas City 32-yard line. The Chiefs got the ball back with 4:41 left in the second quarter holding a 6-3 lead.\nLions defensive tackle Gabe Wright and Rams running back Tre Mason were designated as inactive. Mason did not practice last week because of an ankle injury.\nFOR MORE OF AL.COM'S COMPREHENSIVE COVERAGE OF THE NFL, GO TO OUR NFL PAGE\nThe Chicago Bears, Cincinnati Bengals, Denver Broncos and Green Bay Packers were on their bye weeks.\nThe seventh week of the NFL season concludes with the Baltimore Ravens visiting the Arizona Cardinals at 7:30 p.m. CDT Monday. ESPN will televise the game.", "external_links": ["https://t.co/tdhx1H7Aan", "https://twitter.com/hashtag/CARvsPHI?src=hash", "http://www.atlantafalcons.com/news/blog/article-1/6-Points-on-Week-7-Victory/7755ebeb-d0d2-4852-bb5e-02b2515d1fb9", "https://twitter.com/NFLIive/status/658461548277604352"], "published": "2015-10-26T11:27:00.000+02:00", "crawled": "2015-10-26T08:00:35.678+02:00", "highlightTitle": ""}