{"organizations": [], "uuid": "2779c4af69c264e2e6154f8432bec3464afddb2c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.miamiherald.com", "main_image": "http://www.miamiherald.com/news/nation-world/world/americas/6z3lz3-Relief-efforts-in-the-Bahamas-following-Hurricane-Joaquin/ALTERNATES/LANDSCAPE_1140/Relief%20efforts%20in%20the%20Bahamas%20following%20Hurricane%20Joaquin", "site_section": "http://www.miamiherald.com/?widgetName=rssfeed&widgetContentId=712015&getXmlFeed=true", "section_title": "Breaking News, Sports, Weather & More | MiamiHerald.com &", "url": "http://www.miamiherald.com/news/nation-world/world/americas/article38767563.html", "country": "US", "title": "In Joaquin-slammed Bahamas, relief still streaming in beyond unblemished tourist zone", "performance_score": 0, "site": "miamiherald.com", "participants_count": 1, "title_full": "In Joaquin-slammed Bahamas, relief still streaming in beyond unblemished tourist zone", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T00:52:00.000+03:00", "replies_count": 0, "uuid": "2779c4af69c264e2e6154f8432bec3464afddb2c"}, "author": "Carol Rosenberg \ncrosenberg@miamiherald.com", "url": "http://www.miamiherald.com/news/nation-world/world/americas/article38767563.html", "ord_in_thread": 0, "title": "In Joaquin-slammed Bahamas, relief still streaming in beyond unblemished tourist zone", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "In Joaquin-slammed Bahamas, relief still streaming in beyond unblemished tourist zone \nA week after hurricane, southernmost islands still suffering \nNo damage reported to most Bahamian tourist destinations, which were not in Joaquin’s path \nThe southern Bahamas relief effort is described as true U.S.-Bahamian collaboration Bahamian Financial Services Minister Hope Strachan describes the efforts of the Red Cross to supply victims of Hurricane Joaquin with water, food, generators and other necessities. Pedro Portal pportal@elnuevoherald.com A car damaged at Pittstown Point landing on Crooked Island, Bahamas, seen Oct. 10, 2015. PEDRO PORTAL pportal@miamiherald.com A car damaged at Pittstown Point landing on Crooked Island by Hurricane Joaquin's winds, seen on Saturday Oct. 10, 2015. PEDRO PORTAL EL Nuevo Herald Bahamas Minister of Financial Services Hope Strachan (third from right in a blue shirt) joins volunteers as they sort out relief aid donated by the Bahamian tourism industry and other sources at Exuma's Mosstown airport on Saturday, Oct. 10, 2015. Relief efforts continued for Hurricane Joaquin's victims along several southern Bahamian islands that were badly damaged or destroyed in the storm. PEDRO PORTAL EL Nuevo Herald Aerial view of a tractor trailer deposited in the middle of a swamp by Hurricane Joaquin on Crooked Island, Bahamas, on Saturday, Oct. 10, 2015. PEDRO PORTAL EL Nuevo Herald Pilot Jimbo Stockton, back, makes space on his plane as Kennethe Scavella, far right, helps him load water and other supplies going to Crooked Island at Exuma's Mosstown airport on Saturday, Oct. 10, 2015. PEDRO PORTAL EL Nuevo Herald Aerial view of buildings damaged at Pittstown on Crooked Island, Bahamas, by Hurricane Joaquin's winds, seen on Saturday, Oct. 10, 2015. PEDRO PORTAL EL Nuevo Herald From left, Red Cross officer Patrice Rotte, Bahamas Minister of Financial Services Hope Strachan, Minister of Tourism Obediah Wilchcombe, and Director General of Tourism Joy Jibrilu join volunteers as they sort out relief aid donated by the Bahamian tourism industry and other sources at Exuma's Mosstown airport on Saturday, Oct. 10, 2015. Relief efforts continued for Hurricane Joaquin's victims along several southern Bahamian islands that were badly damaged or destroyed in the storm. PEDRO PORTAL EL Nuevo Herald Aerial view of buildings damaged at Pittstown on Crooked Island, Bahamas, by Hurricane Joaquin's winds, seen on Saturday, Oct. 10, 2015. PEDRO PORTAL EL Nuevo Herald Volunteers sort out relief aid, donated by the Bahamian tourism industry and other sources, for Hurricane Joaquin's victims at Exuma's Mosstown airport. PEDRO PORTAL EL Nuevo Herald A car and buildings at Pittstown Point landing on Crooked Island, Bahamas, damaged by Hurricane Joaquin, seen on Saturday, Oct. 10, 2015. PEDRO PORTAL EL Nuevo Herald Buildings at Pittstown Point landing on Crooked Island, Bahamas, that were damaged by Hurricane Joaquin, seen on Saturday, Oct. 10, 2015. PEDRO PORTAL EL Nuevo Herald A sign at Pittstown Point landing on Crooked Island, Bahamas, that was knocked down by Hurricane Joaquin, seen on Saturday, Oct. 10, 2015. PEDRO PORTAL EL Nuevo Herald Aerial view of buildings and houses on Crooked Island, Bahamas, that were damaged by Hurricane Joaquin, seen on Saturday, Oct. 10, 2015. PEDRO PORTAL EL Nuevo Herald Aerial view of buildings and houses on Crooked Island, Bahamas, that were damaged by Hurricane Joaquin, seen on Saturday, Oct. 10, 2015. PEDRO PORTAL EL Nuevo Herald The Morley family are evacuated from their home at Colonel Hill on Crooked Island, Bahamas, on Saturday, Oct. 10, 2015, following Hurricane Joaquin. PEDRO PORTAL EL Nuevo Herald Officer Wright of The Royal Bahamas Police Force helps Elizabeth Ferguson as she and other members of her family are evacuated from their home at Colonel Hill on Crooked Island, Bahamas, on Saturday, Oct. 10, 2015, following Hurricane Joaquin. PEDRO PORTAL EL Nuevo Herald A house at Pittstown Point landing on Crooked Island, Bahamas, that was damaged by Hurricane Joaquin, seen on Saturday, Oct. 10, 2015. PEDRO PORTAL EL Nuevo Herald A closet in a house at Pittstown Point landing on Crooked Island, Bahamas, that was damaged by Hurricane Joaquin, seen on Saturday, Oct. 10, 2015. PEDRO PORTAL EL Nuevo Herald A bedroom in a house damaged by Hurricane Joaquin at Pittstown Point landing on Crooked Island, Bahamas, on Saturday, Oct. 10, 2015. PEDRO PORTAL EL Nuevo Herald Windows from a house destroyed by Hurricane Joaquin at Pittstown Point landing on Crooked Island, Bahamas, on Saturday, Oct. 10, 2015. PEDRO PORTAL EL Nuevo Herald A mattress from a house destroyed by Hurricane Joaquin sits on the beach at Pittstown Point landing on Crooked Island, Bahamas, on Saturday Oct. 10, 2015. PEDRO PORTAL EL Nuevo Herald 1 of 22 Order Reprint of this Story EXUMA, Bahamas \nTourists lugging Sandals Resorts bags were piling onto an Atlanta-bound Delta Connection jet Saturday oblivious to the activity in the searing sunshine on another corner of this single-runway airport. \nThree Bahamian government ministers were in a knot of Red Cross workers packing bottled water, generators, diapers and food onto a five-seat prop plane headed south to the zone slammed by Hurricane Joaquin. \nThis emergency resupply effort went on all day — a week after Hurricane Joaquin suddenly grew to a Category 4 storm atop the edge of this 700-island archipelago nation, shredding several southernmost Out Islands, home to about 6,000 Bahamians. \n“That is the peculiarity of an archipelago. It has to be serviced,” said Financial Services Minister Hope Strachan as she was helping pass supplies hand-over-hand from a trailer for one of 10 relief flights that day. \nMiraculously, no Bahamians died in Joaquin, which spared most of the island chain’s vital tourism industry even as the storm sank the American cargo ship El Faro and its 33 crew members. But uncounted homeless residents, health risks and infrastructure damage still plague seven islands known as the Family Islands — Acklins, Crooked, San Salvador, Long Island, Rum Cay, Mayaguana and Ragged Island. So, the supplies, said Strachan, “fulfill an ongoing need until we rebuild these homes.” \nWe’re very fortunate. We’re a praying country. \nObie Wilchcombe, Minster of Tourism \nPublic health concerns on these islands include standing water with sewage and rotting corpses of dead animals — goats, sheep and dogs — as well as salt water contamination on farm land from flooding, said Exuma Fire Chief Bernard Swann, who described the relief effort as a true U.S. and Bahamian collaboration. \nA day after the storm hit, he said, five Palm Beach County firefighters with ties to the local Anglican community arrived to handle logistics for volunteer small-plane pilots ferrying donated relief supplies south and evacuees north. “ Tropic Ocean did most of the flights,” Swann said with a healthy dose of respect for the small Fort Lauderdale firm owned by former U.S. Navy fighter pilot Rob Ceravolo, which halted all commercial business to the northern Bahamas and diverted its small aircraft to southern relief runs. \n7 ‘Family Islands,’ home to about 6,000 Bahamians, suffered the worst of Joaquin’s damage \nIn one instance, Tropic Ocean Airways pilots Kenneth White and Holt Lindenberger made a seaplane landing on the edge of Long Island to carry a Bahamian couple who are in their mid 90s onto the aircraft for a shuttle to Exuma. They were stranded when Joaquin hit, their in-home health aides having fled ahead of the storm, and cut off from a daughter on the other end of the 80-mile island. \n“They were a little shell-shocked more than anything else,” said White. He reported that the couple’s house was torn apart around them, and that they said nothing during the hour-long flight to Exuma. They’re in Nassau now with family, and are reportedly fine, according to Patrice Rolle, the Bahamian Red Cross coordinator at Exuma Airport who met the Tropic Ocean flight. \n“This hurricane sneaked up on the Bahamas; we didn’t have time to prepare,” she said, adding that Exuma and its surrounding luxurious keys got hit with wind but little rain, sparing the private islands of the rich and famous — Tyler Perry, Johnny Depp and David Copperfield among them — even as Long Island, long populated by the Knowles family (singer Beyoncé’s father), got so slammed that sea water sliced it in two. \nTyler Perry, Johnny Depp and David Copperfield’s private homes undamaged. Long Island, long populated by the Knowles family (Beyoncé’s father), got so slammed that sea water sliced it in two. \nPeople around here call them the Family Islands because they are mostly home to Bahamian retirees who returned to family land from Nassau or other big islands to establish small homesteads for fishing and farming. They are populated “by the very young and the very old,” said Swann, the fire chief, because some live there with grandchildren whose parents still work in the north. \nNow, he said, there’s dead animals and sewage in standing water. “You’ve got to provide for them in one way or the other.” \nTourism suffered little, said Joy Jibrilu, director general of the Ministry of Tourism, who was on a rare break from directing supplies onto Saturday’s flights. \n“Fortunately for us it did happen in the southern islands where the tourist destinations were closed, renovating and preparing for the tourism season,” she said. \nThe Club Med at San Salvador has delayed its opening by two months until Dec. 20 to do clean up — repair roofs and landscaping and restore services. Two boutique hotels on Crooked Island that are popular with Europeans — Riding Rock and Tranquility on the Bay — suffered more extensive damage and will require major rebuilds, she said. \nDuring the storm, Jibrilu said, Tranquility Bay owner Bernard Ferguson “just watched it disintegrate” before taking cover for 30 hours inside a truck with five other people until Joaquin left. \nAt Crooked Island on Saturday evening, backhoes that had been brought in before Joaquin to dig a marina were clearing debris at the ruins of a bonefishing lodge, adjacent to the Pittstown Point airstrip, when two Florida-based pilots flew in from Exuma. They unloaded relief supplies — water, crackers, toilet paper and other necessities — onto the dirt, near rubble on the edge of a runway that still had beach sand from the storm scattered about. \nThese were the last of that day’s relief flights that came and went from Exuma, even as the tourists did, too. At one point, the Bahamian government ministers, still reeling at the ferocity of the storm but with equal measure marveling at its magnanimity, gathered in a prayer circle to send the pilots off safely. \n“Thank God nobody died,” said Tourism Minster Obie Wilchcombe, who was pleased by the juxtaposition of relief aide activity with the tourists coming and going. “The central and northern Bahamas are still open for business. People still come and enjoy. We’re very fortunate. We’re a praying country.” \nCarol Rosenberg: 305-376-3179 , @carolrosenberg \nHow to Help: South Florida Relief \n▪ Tropic Ocean Airways of Fort Lauderdale has an online relief page . Owner Rob Ceravolo estimated Sunday that his crews had undertaken more than 70 relief flights, moved about 50,000 pounds of cargo and evacuated more than 30 people. \n▪ In Coconut Creek, Food for the Poor and the South Florida Rick Case Automotive Group have a food drive . \n▪ In Palm Beach County, the Pathfinders Task Force is leading the effort. Related content", "external_links": [], "published": "2015-10-12T00:52:00.000+03:00", "crawled": "2015-10-12T04:38:45.713+03:00", "highlightTitle": ""}