{"organizations": ["USC"], "uuid": "97f85a17604334188c0e3b87bc8ad644d5969593", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.swxrightnow.com", "main_image": "", "site_section": "http://www.swxrightnow.com/category/50896/washington-sports-headlines?clienttype=rss&redirected=true", "section_title": "Sports and Weather Right Now - Washington Sports Headlines", "url": "http://www.swxrightnow.com/story/30222371/washington-gets-defensive-holds-on-to-beat-no-17-usc-17-12", "country": "US", "title": "Washington gets defensive, holds on to beat No. 17 USC 17-12", "performance_score": 0, "site": "swxrightnow.com", "participants_count": 0, "title_full": "Washington gets defensive, holds on to beat No. 17 USC 17-12", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T07:24:00.000+03:00", "replies_count": 0, "uuid": "97f85a17604334188c0e3b87bc8ad644d5969593"}, "author": "", "url": "http://www.swxrightnow.com/story/30222371/washington-gets-defensive-holds-on-to-beat-no-17-usc-17-12", "ord_in_thread": 0, "title": "Washington gets defensive, holds on to beat No. 17 USC 17-12", "locations": ["WA", "Washington", "Tri-Cities", "Spokane"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["GREG"], "text": "Washington gets defensive, holds on to beat No. 17 USC 17-12 - SWX Right Now-Sports for Spokane, CdA, Tri-Cities, WA Member Center: Washington gets defensive, holds on to beat No. 17 USC 17-12 Posted: By GREG BEACHAMAP Sports Writer \nLOS ANGELES (AP) - Myles Gaskin ran for 134 yards and a fourth-quarter touchdown, and Washington shut down No. 17 Southern California's high-powered offense throughout a 17-12 victory over the Trojans on Thursday night. \nReceiver Marvin Hall threw a 27-yard touchdown pass to Joshua Perkins on a trick play early in the second half for the Huskies (3-2, 1-1 Pac-12), who beat former coach Steve Sarkisian in a defense-dominated meeting. Washington beat a ranked team for the first time under second-year coach Chris Petersen. \nCody Kessler had two interceptions while passing for just 156 yards on a disastrous night for the Trojans (3-2, 1-2), the popular preseason pick to win the conference. \nInstead, USC couldn't score a touchdown until Ronald Jones II's short run with 12:02 to play. \nAP college football website: www.collegefootball.ap.org Copyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Local Sports from SWX Local Sports from SWX More>> Bloomsday 2015: Road Closures, Parking and Bus Routes SPOKANE, Wash. - With tens of thousands of people converging on downtown Spokane this weekend for Bloomsday, we wanted to make sure you know about all the road closures you may run into. Check out this story to get all you need to know about road closures and bus information. More >> SPOKANE, Wash. - With tens of thousands of people converging on downtown Spokane this weekend for Bloomsday, we wanted to make sure you know about all the road closures you may run into. Check out this story to get all you need to know about road closures and bus information. More >> Updated: Wednesday, October 7 2015 2:35 AM EDT 2015-10-07 06:35:00 GMT Hudson Elyniuk led the offense with a career high 2 goals as the Chiefs improved their record to 3-1 to take over first place in the U.S. Division with 6 points. Tyson Verhelst turned aside 33 shots, including all 13 in the third period, as the Spokane Chiefs notched their second straight win with a 3-1 victory over the Victoria Royals Tuesday night in Victoria, B.C. Hudson Elyniuk led the offense with a career high 2 goals as the Chiefs improved their record to 3-1 to take over first place in the U.S. Division with 6 points. More >> Tyson Verhelst turned aside 33 shots, including all 13 in the third period, as the Spokane Chiefs notched their second straight win with a 3-1 victory over the Victoria Royals Tuesday night in Victoria, B.C. Hudson Elyniuk led the offense with a career high 2 goals as the Chiefs improved their record to 3-1 to take over first place in the U.S. Division with 6 points. More >> Evergreen High School football player died after being injured in game Friday night SEATTLE, Wash. - Harborview Medical Center in Seattle has confirmed the Evergreen High School football player who was injured in a game last Friday has died. Kenny Bui was injured in the 4th quarter of a game against Highline when he took a hard hit. More >> SEATTLE, Wash. - Harborview Medical Center in Seattle has confirmed the Evergreen High School football player who was injured in a game last Friday has died. Kenny Bui was injured in the 4th quarter of a game against Highline when he took a hard hit. More >> Jerry Dipoto Named Mariners Executive Vice President & General Manager of Baseball Operations SEATTLE, Wash. - Seattle Mariners President Kevin Mather announced Monday that Jerry Dipoto has been named the Mariners new Executive Vice President & General Manager of Baseball Operations. More >> SEATTLE, Wash. - Seattle Mariners President Kevin Mather announced Monday that Jerry Dipoto has been named the Mariners new Executive Vice President & General Manager of Baseball Operations. A news conference introducing Dipoto to the Seattle media will be held Tuesday.“Jerry impressed us at each step of the process,” Mather said. More >> Anderson-Dolan Impresses in Season Opener, Leads Chiefs to 6-4 Win Over Americans Jaret Anderson-Dolan scored a hat-trick in the Chiefs season opener, on the way to a 6-4 win. Rookie forward Jaret Anderson-Dolan picked an opportune time to score the first three goals of his young WHL career, netting a hat trick to lead the Spokane Chiefs to a come-from-behind 6-4 win over the rival Tri-City Americans on Saturday Night at Spokane Arena. Forward Hudson Elynuik earned the distinction of scoring the Chiefs' first goal of the 2015-16 regular season, punching in a rebound opportunity just 1:14 into regulation. More >> Rookie forward Jaret Anderson-Dolan picked an opportune time to score the first three goals of his young WHL career, netting a hat trick to lead the Spokane Chiefs to a come-from-behind 6-4 win over the rival Tri-City Americans on Saturday Night at Spokane Arena. Forward Hudson Elynuik earned the distinction of scoring the Chiefs' first goal of the 2015-16 regular season, punching in a rebound opportunity just 1:14 into regulation. More >> Chiefs Drop Final Preseason Game 4-3 Dominc Zwerger scored twice in Spokane's 4-3 loss to Tri-City on Saturday. Dominic Zwerger scored twice but the Chiefs couldn’t hold on late, falling to the Tri-City Americans 4-3 at Spokane Arena on Saturday afternoon. More >> Dominic Zwerger scored twice but the Chiefs couldn’t hold on late, falling to the Tri-City Americans 4-3 at Spokane Arena on Saturday afternoon. More >> Chiefs Score Five Goals in 3rd to Beat Red Deer 5-3 Chiefs’ forward Markson Bechtold led the way with two power play goals while 16-year-old Jaret Anderson-Dolan chipped in one goal and two assists. The Spokane Chiefs bounced back from a 3-0 deficit with five goals in the third period to defeat the Red Deer Rebels 5-3 in Kennewick on Saturday afternoon. More >> The Spokane Chiefs bounced back from a 3-0 deficit with five goals in the third period to defeat the Red Deer Rebels 5-3 in Kennewick on Saturday afternoon. More >>", "external_links": [], "published": "2015-10-09T07:24:00.000+03:00", "crawled": "2015-10-09T07:43:39.461+03:00", "highlightTitle": ""}