{"organizations": ["AP"], "uuid": "b597d0ce68466420691f788e4aa844f5778ae43c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usatoday.com", "main_image": "", "site_section": "http://www.usatoday.com/sports/", "section_title": "USA Today | Sports", "url": "http://www.usatoday.com/story/sports/tennis/2015/10/14/nishikori-holds-off-kyrgios-to-advance-in-shanghai/73913952/", "country": "US", "title": "Nishikori holds off Kyrgios to advance in Shanghai", "performance_score": 0, "site": "usatoday.com", "participants_count": 0, "title_full": "Nishikori holds off Kyrgios to advance in Shanghai", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T14:25:00.000+03:00", "replies_count": 0, "uuid": "b597d0ce68466420691f788e4aa844f5778ae43c"}, "author": "", "url": "http://www.usatoday.com/story/sports/tennis/2015/10/14/nishikori-holds-off-kyrgios-to-advance-in-shanghai/73913952/", "ord_in_thread": 0, "title": "Nishikori holds off Kyrgios to advance in Shanghai", "locations": ["SHANGHAI", "Shanghai"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kei Nishikori", "Nishikori", "Nick Kyrgios", "Kyrgios"], "text": "CONNECT 1 TWEET LINKEDIN COMMENT EMAIL MORE SHANGHAI (AP) — Kei Nishikori overcame a stiff challenge from an emotional Nick Kyrgios to advance to the third round of the Shanghai Masters with a 1-6, 6-4, 6-4 win on Wednesday.\nAfter winning the first set in 30 minutes, Kyrgios began to unravel at the end of the second set when he smacked a ball in frustration toward the baseline, causing a line judge to bend to avoid being hit.\nThe Australian was assessed a code violation and dropped his serve at love, losing the set. Kyrgios then saved three match points in the third set before Nishikori finally closed it out.\nKyrgios was already fined $1,500 for an \"audible obscenity\" in his first-round match in Shanghai. He faces a 28-day suspension from the ATP tour if he reaches $5,000 in fines before February after being placed on probation for making derogatory comments to Stan Wawrinka during a match in Montreal in August.\n\"I didn't think I behaved bad at all out there today,\" Kyrgios said after Wednesday's loss. \"I thought I was good mentally. I showed emotion, but at the same time I played great.\"\nNishikori said he tried to be more patient after struggling with his serve early in the match, winning just one point on his second serve in the opening set.\n\"I didn't have the best start this match today,\" he said. \"My serve wasn't going in, especially in the beginning. I had three double faults in first game.\"\nIn other matches, Andy Murray overcame five double faults to defeat Steve Johnson of the United States 6-2, 6-4, and Australia's Bernard Tomic saved eight of nine break points he faced to upset seventh-seeded David Ferrer of Spain 6-4, 6-2.\nTomic said he's feeling increasingly more confident than he was at the start of the year when his ranking dipped into the 70s. He reached No. 20 last month and is aiming to finish close to the top 15 by the end of the season.\n\"This is my best year,\" he said. \"I'm working much harder. I'm a bit smarter and wiser.\"\nFifth-seeded Tomas Berdych of the Czech Republic also advanced with a 7-6 (3), 4-6, 6-4 win over Jack Sock of the United States, No. 13-seeded John Isner of the United States defeated Belgium's David Goffin 6-3, 7-6 (5), and No. 12 Kevin Anderson beat Fabio Fognini of Italy 6-3, 7-6 (1).\nCONNECT 1 TWEET LINKEDIN COMMENT EMAIL MORE Copyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.\nTOP VIDEOS", "external_links": ["http://www.linkedin.com/shareArticle?url=http%3A//usat.ly/1RHajmd&mini=true", "https://twitter.com/intent/tweet?url=http%3A//usat.ly/1RHajmd&text=Nishikori%20holds%20off%20Kyrgios%20to%20advance%20in%20Shanghai&via=usatoday"], "published": "2015-10-14T14:25:00.000+03:00", "crawled": "2015-10-14T16:05:30.989+03:00", "highlightTitle": ""}