{"organizations": [], "uuid": "0f6e2098c1df83f2c5785cf83e1c8ac3f79bf9be", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.deseretnews.com", "main_image": "http://img.deseretnews.com/images/article/hires/1615644/1615644.jpg", "site_section": "http://www.deseretnews.com/sports/index.rss", "section_title": "Sports News | Deseret News", "url": "http://www.deseretnews.com/article/865639830/Well-traveled-mighty-Quin-Snyder-forming-bond-of-trust-with-Utah-Jazz-player.html", "country": "US", "title": "Well-traveled, mighty Quin Snyder forming bond of trust with Utah Jazz player", "performance_score": 0, "site": "deseretnews.com", "participants_count": 1, "title_full": "Well-traveled, mighty Quin Snyder forming bond of trust with Utah Jazz player | Deseret News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T02:00:00.000+02:00", "replies_count": 0, "uuid": "0f6e2098c1df83f2c5785cf83e1c8ac3f79bf9be"}, "author": "Jody Genessy", "url": "http://www.deseretnews.com/article/865639830/Well-traveled-mighty-Quin-Snyder-forming-bond-of-trust-with-Utah-Jazz-player.html", "ord_in_thread": 0, "title": "Well-traveled, mighty Quin Snyder forming bond of trust with Utah Jazz player", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Jazz started to benefit from that trust factor — gained from months of intensive work on forming solid habits — the last few months of the 2014-15 NBA season.\nMore Coverage Utah Jazz: Gobert, guard tandems and role players could hold key to success Hayward, Favors are now the veterans, ready to lead young Jazz team “ It’s good to play for a coach like that who emphasizes defense as much as he does because he knows what we can do on the offensive end. He knows that if we’re going to go where we want to go as an organization, it’s going to start on defense. It’s great.”\nJazz point guard Trey Burke\nSALT LAKE CITY — In 2010, Quin Snyder moved from Austin, Texas, to Philadelphia, upgrading from the D-League to becoming a player development coach with the 76ers.\nIn 2011, Snyder moved from Pennsylvania to Los Angeles, upgrading to a full-time assistant position with the Lakers.\nIn 2012, the former Duke player relocated from Tinsel Town to Russia, where he became the head assistant coach to the respected Ettore Messina with European powerhouse CSKA Moscow.\nIn 2013, the well-traveled coach, who’d worked for the Clippers, Mike Krzyzewski's Blue Devils and Missouri before the aforementioned Texas stint, returned to the States to be Mike Budenholzer’s top assistant in Atlanta.\nIn 2014, Jazz fans are well aware of where Snyder moved. On June 6 of that year, he was hired by Utah, becoming just the fifth head coach in the Beehive State portion of the organization’s history.\nGot all that?\nGood.\nHere’s a review: In the past five years, Snyder moved five times — from the Lone Star State to Philly to L.A. to Russia to Atlanta and, finally, to Utah.\nIt’s no wonder Snyder laughed when he was asked if it felt strange to not move this past summer after changing addresses in each of the previous five summers.\nFor the record, the Snyders didn’t buy a new house in Salt Lake City just to keep their moving streak alive, either.\n“My wife and I looked out the window and I didn’t see Atlas Van lines or anything. It was nice,” Snyder said. “I haven’t really unpacked yet. I’m so used to not doing it.”\nEven if he isn’t sure where all of his high school yearbooks are at the moment, Snyder has settled into his current home and job.\nPlayers have noticed a different tone and a more relaxed demeanor from their head coach.\nPower forward Derrick Favors, now in his sixth season, respectfully said Snyder could be “a little uptight” as he tried to get his point across to Jazz players last year. This time around?\nSure, Snyder still raises the volume on his vocal chords at times, but Favors said there’s more “fun” this time around. (Their fun still includes hours of detailed film sessions, individual coaching and grinding practices, by the way.)\n“He’s a lot more, I wouldn’t say relaxed, but he’s a lot more confident in us because when we come in and practice we don’t play around,” second-year shooting guard Rodney Hood said. “We know what to do and we get it done, and we go on to the next thing. I think he trusts us a little more this year.”\nTrust is a huge deal for Snyder, who told former Jazz CEO Greg Miller during his hiring process, “When a team plays defense together well, it’s an indication they trust each other.”\nThe Jazz started to benefit from that trust factor — gained from months of intensive work on forming solid habits — the last few months of the 2014-15 NBA season. Utah went from the worst defensive team in the league to the best in a Snyder-led transformation that pushed the franchise’s rebuilding project into fast forward.\nTo Hood’s point, Snyder said he has more earned confidence in his team during his second camp. As he tinkered with lineup combinations this preseason, the Jazz coach admitted, “We’ve got a number of guys that I trust, which is a good thing to have.” That also creates a bit of a dilemma because he only has so many minutes each game to divvy up.", "external_links": [], "published": "2015-10-25T02:00:00.000+02:00", "crawled": "2015-10-25T17:28:13.509+02:00", "highlightTitle": ""}