{"organizations": ["Rangers"], "uuid": "aab31d95a7b0820734c29217887571bf6ad623ad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxsports.com", "main_image": "http://a.fssta.com/content/dam/fsdigital/fscom/legacy/nhl/images/2011/03/31/GYI0064139179_20110331080126735_1280_1280.vresize.1200.675.high.55.JPG", "site_section": "http://api.foxsports.com/v1/rss?partnerKey=zBaFxRyGKCfxBagJG9b8pqLyndmvo7UU&tag=ohio", "section_title": "FOX Sports Digital", "url": "http://www.foxsports.com/ohio/story/columbus-blue-jackets-new-york-rangers-lundqvist-101015", "country": "", "title": "Lundqvist makes 37 saves; Rangers rout Blue Jackets 5-2", "performance_score": 0, "site": "foxsports.com", "participants_count": 0, "title_full": "Lundqvist makes 37 saves; Rangers rout Blue Jackets 5-2", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T06:30:00.000+03:00", "replies_count": 0, "uuid": "aab31d95a7b0820734c29217887571bf6ad623ad"}, "author": "", "url": "http://www.foxsports.com/ohio/story/columbus-blue-jackets-new-york-rangers-lundqvist-101015", "ord_in_thread": 0, "title": "Lundqvist makes 37 saves; Rangers rout Blue Jackets 5-2", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Lundqvist"], "text": "Lundqvist makes 37 saves; Rangers rout Blue Jackets 5-2 AP \nOct 10, 2015 at 11:30p ET + Updated Oct 11, 2015 at 12:39p ET \nNEW YORK (AP) -- Before they parted for the summer, coach Alain Vigneault authored a challenge to New York Rangers goalie Henrik Lundqvist . \n\"The last thing he told me,\" Lundqvist said, \"was, `You have to be better when we start.'\" \nLundqvist took Vigneault's demand to heart, and the Rangers are the beneficiaries. \nJust what the rest of the NHL wanted to hear. \nLundqvist made 37 saves and Oscar Lindberg scored twice to lead the New York Rangers to a 5-2 win over the Columbus Blue Jackets on Saturday night. \nDominic Moore , Derick Brassard and Derek Stepan added a goal apiece in New York's home opener following two straight road victories to open the season. On Friday night in Columbus, the Rangers rallied to beat the Blue Jackets 4-2. \n\"They didn't throw us any bones to start the season,\" Marc Staal said. \"We knew it was going to be tough, so it's definitely nice to get out a 3-0 lead.\" \nEleven Rangers finished with at least one point. Lindberg, Viktor Stalberg and Keith Yandle led the attack with two points each. \nSergei Bobrovsky made 18 saves while Ryan Johansen and Boone Jenner scored for Columbus, which fell to 0-2 to start the season. \n\"We aren't going to win many games giving up five goals. We dug ourselves an early hole we couldn't get out of. It's really disappointing,\" Columbus coach Todd Richards said. \"Our lack of composure led to mistakes. It was not good hockey.\" \nAn opportunistic Rangers squad led 3-0 at the first intermission, aided by significant breakdowns by Columbus in all three zones. \nLindberg opened the scoring at 1:20 by tapping a rebound from Kevin Hayes ' shot past a sprawled Bobrovsky. Lindberg added his second of the game at the 5:12 mark of the first. New York's rookie center beat Dalton Prout to the top of the crease before redirecting J.T. Miller's cross-ice centering feed. \nLindberg has four goals in New York's first three games. He is the first rookie in franchise history with at least one goal in each a season's first three games. Lindberg also became the first New York rookie since Steven King to score three goals in the first three games of a debut season. King scored in four games in a row between Dec. 6-13, 1992. \nMoore pushed the advantage to 3-0 just 36 seconds after Lindberg's second goal. While the public address announcer was broadcasting the time of Lindberg's second score of the game, Moore tapped Jarret Stoll's goalmouth pass past Bobrovsky. \nAs strong as New York's first period was, it could have been better if not for Bobrovsky. Stepan missed a wide-angled shot on a breakaway, and later, Bobrovsky stopped Rick Nash's penalty shot. Nash was awarded the penalty shot after being hooked by Ryan Murray on a semi-breakaway. \n\"We have a small margin for error,\" Columbus captain Nick Foligno said. \"We had a bad bounce and we couldn't overcome the adversity. That definitely wasn't how we wanted to start the game. \n\"We have to work the right way and be smarter early in games. Tonight it was too little, too late.\" \nLundqvist made the lead hold, allowing Johansen's first goal of the season at 4:35 of the third and Jenner's power-play tally about 10 minutes later. His best save was a diving stop on Johansen in which the puck bounced off of Lundqvist's stick and blocker pad. \n\"He's certainly been our best player since the start of the season,\" Vigneault said of Lundqvist. \"He played a very strong game again and he's doing what a goaltender is supposed to do: Give his team a chance to win.\" \nBrassard's power-play goal with 48 seconds left in the second increased New York's lead to 4-0. Curtis McElhinney replaced Bobrovsky in the third and yielded a goal to Stepan 1:26 into the period. \nMcElhinney finished with six saves on 7 shots. \nColumbus outshot New York, 39-29, and out-attempted the Rangers, 65-41. New York went 1 for 2 on the power play while the Blue Jackets were 1 for 5. \nNOTES: The game was the first of 17 back-to-backs for New York this season. ... William Karlsson replaced Alexander Wennberg in the lineup for Columbus. Wennberg is out indefinitely after suffering a concussion in the first period of Friday's loss to New York. ... Columbus scratched defenseman Cody Goloubef and right wing David Clarkson . ... New York replaced right wing Jesper Fast with Tanner Glass . Defenseman Dylan McIlrath and right wing Emerson Etem were scratched.", "external_links": [], "published": "2015-10-11T06:30:00.000+03:00", "crawled": "2015-10-11T23:11:18.644+03:00", "highlightTitle": ""}