{"organizations": [], "uuid": "b0ec47937de3ee6029ec3dd7fc68b40748224b85", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freep.com", "main_image": "http://www.gannett-cdn.com/-mm-/570c736f39c03522c3954ac4d772bf50cfd1ffd6/c=0-45-2242-1312&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/18/DetroitFreePress/DetroitFreePress/635807378925140663-CassMLKFootball-092615-ES11.jpg", "site_section": "http://rssfeeds.freep.com/freep/sports", "section_title": "Detroit Free Press - Sports", "url": "http://www.freep.com/story/sports/college/michigan-state/spartans/2015/10/18/michigan-state-spartans-michigan-wolverines-recruiting/74168754/", "country": "US", "title": "Michigan State ticker: One game has little effect on recruiting", "performance_score": 0, "site": "freep.com", "participants_count": 1, "title_full": "Michigan State ticker: One game has little effect on recruiting", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T12:08:00.000+03:00", "replies_count": 0, "uuid": "b0ec47937de3ee6029ec3dd7fc68b40748224b85"}, "author": "freep.com", "url": "http://www.freep.com/story/sports/college/michigan-state/spartans/2015/10/18/michigan-state-spartans-michigan-wolverines-recruiting/74168754/", "ord_in_thread": 0, "title": "Michigan State ticker: One game has little effect on recruiting", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MORE\nFor years, there has been talk about the impact of the Michigan-Michigan State football game on recruiting, and Donnie Corley added to it this week.\nThe sought-after receiver from Detroit King is not only one of the top prep players in Michigan but a consensus four-star, top-100 recruit.\nCorley was expected to be at the U-M/MSU game and has offers from both schools, along with Ohio State, LSU, Georgia and others.\n\"If Michigan beats Michigan State, I think it will change the momentum,\" Corley told ESPN.com. \"What I saw when I was real young was that everybody wanted to go to Michigan and Michigan was top dog, but then the tables turned for Michigan State. It's up in the air now, so it's going to be a great game.\"\nIf history is any indication, however, the result of the game unlikely will to have a major immediate impact.\nSince 2004, 25 players with offers from U-M and MSU committed after the teams played each other. To put that number in perspective, MSU and U-M have combined to sign 534 players during that period.\nOf the 25 players with offers from both that committed at some point after the game, 15 went to the winning school.\nMSU gained seven, including current players Malik McDowell, Montae Nicholson, Monty Madaris and Damon Knox, and current NFL players Dion Sims and Kurtis Drummond.\nU-M nabbed eight, with David Dawson being the only player on their current roster. NFL players include Patrick Omameh, Tim Jamison and Marques Slocum.\nRecruiting: Full coverage Signing Day 2016: Feb. 3 U-M football, hoops recruits MSU football, hoops recruits Photos: Michigan's 2016 football recruits Photos: MSU's 2016 football recruits Photos: 2015 Sound Mind Sound Body More recruiting news Although both schools have picked up about the same number of players when they beat their rival, Michigan has had one significant edge. The Wolverines haven't been impacted by losing.\nThe Wolverines gained seven commitments after losing to the Spartans from players with MSU offers, compared to eight when they've won.\nAmong those players are current Wolverines Amarah Darboh and Reuben Jones, as well as current NFL player Frank Clark.\nMSU has signed only three recruits with U-M offers after losing to Michigan since 2004, with the most notable being current NFL player Kellen Davis.\nStill, coach Mark Dantonio doesn't believe the Spartans need the win more for recruiting than Michigan does because the vast majority of recruits have made their decision before the game and few are being pursued by both schools.\nIn fact, Drummond is the only player in the past decade to have offers from both schools and announce his decision the weekend of the game.\n\"I think that recruiting has become so accelerated that a lot of young men for 2016 have already made their decisions, where they're going to school. I do think it has an impact on younger people as they move through the process, but tough to say, I guess,\" Dantonio told ESPN.com. \"It's a very meaningful game, don't get me wrong, but it is one game, and I think that collectively, as a group, people don't decide where to go to college because of one football game.\"", "external_links": ["http://archive.azcentral.com/ic/news/projects/css/linkset.css"], "published": "2015-10-18T12:08:00.000+03:00", "crawled": "2015-10-18T11:31:26.826+03:00", "highlightTitle": ""}