{"organizations": ["Yankees"], "uuid": "ffd5c22841e43a73dd51a1d7273a0f36221e507f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bleacherreport.com", "main_image": "http://img.bleacherreport.net/img/images/photos/003/528/347/hi-res-4cdbc5e8abfe9062563cee19a818f18a_crop_exact.jpg?w=1500&h=1500&q=85", "site_section": "http://news.google.com/news?pz=1&cf=all&ned=us&hl=en&topic=s&output=rss", "section_title": "Sports - Google News", "url": "http://bleacherreport.com/articles/2574294-can-the-yankees-trust-masahiro-tanaka-in-a-wild-card-game-playoff", "country": "IL", "title": "Can the Yankees Trust Masahiro Tanaka in a Wild Card Game Playoff? - Bleacher Report", "performance_score": 0, "site": "bleacherreport.com", "participants_count": 0, "title_full": "Can the Yankees Trust Masahiro Tanaka in a Wild Card Game Playoff? - Bleacher Report", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T14:25:00.000+03:00", "replies_count": 0, "uuid": "ffd5c22841e43a73dd51a1d7273a0f36221e507f"}, "author": "", "url": "http://bleacherreport.com/articles/2574294-can-the-yankees-trust-masahiro-tanaka-in-a-wild-card-game-playoff", "ord_in_thread": 0, "title": "Can the Yankees Trust Masahiro Tanaka in a Wild Card Game Playoff? - Bleacher Report", "locations": ["NEW YORK"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Tommy John", "Masahiro Tanaka"], "text": "0 Comments NEW YORK— Masahiro Tanaka made it through the regular season without needing Tommy John surgery, so that's something. He made it through his final regular-season start without his hamstring intact, another positive. \n\"I feel good about him,\" New York Yankees manager Joe Girardi said Wednesday night, suggesting but not yet announcing that Tanaka will be his starter in next week's American League Wild Card Game (because the Yankees still haven't clinched their spot). \nHe should feel good, but the manager of a team with a $200-plus million payroll really ought to have a guy he feels great about when he's faced with one game he absolutely has to win. Someone like Jake Arrieta or Gerrit Cole, the two guys who figure to start the National League Wild Card Game, or Dallas Keuchel, the guy who would start against Tanaka at Yankee Stadium if the Houston Astros make it to the AL game. \nTanaka was that guy for three months last year, before he got hurt. He's not that guy now. \nHe can be very good. Don't forget that he allowed just three runs in 22 innings in three late-season starts vs. the Toronto Blue Jays , or that his August-September ERA was 2.79 before Wednesday. \nHe's still the best choice the Yankees have to start a must-win game. He just doesn't feel as automatic as you'd like in a game you can't afford to lose. Matt Marton-USA TODAY Sports One scout Wednesday described Tanaka as \"vanilla,\" which no one would say about Jake Arrieta. \n\"Vanilla\" was the way one scout in attendance put it Wednesday, when Tanaka allowed a three-run first-inning home run to Boston's Travis Shaw, and ended up giving up four runs in five innings of the Yankees' 9-5, 11-inning loss to the Red Sox . \n\"Not a disaster, certainly adequate,\" the scout said. \"But he was a pitchability/contact guy with no plus pitches tonight .\" \nGirardi and Tanaka could easily dismiss Wednesday's results, because of an 11-day layoff caused by Tanaka's hamstring strain. He was rusty, he didn't have his good split-finger fastball (he hung the one that Shaw blasted for a home run) and a normal schedule between now and Tuesday will help. \n\"I think it was a good sign I was able to come out of this game strong,\" Tanaka said through his interpreter. \"[The problems with the split] may have had something to do with the layoff. I think it'll be better next time.\" \nThe Yankees could have clinched their playoff spot with a win Wednesday, but they lost to the Red Sox for a third straight night. With Mark Teixeira out for the year and with Alex Rodriguez and others starting to look worn down (although A-Rod homered Wednesday), the Yankees aren't the offensive powerhouse they were earlier in the season. \nThey'll need big performances from some of their starting pitchers, and there's every chance they'll need a big performance from Tanaka next Tuesday. \n\"I don't know if it would be the biggest game I've pitched,\" said Tanaka, who once threw 160 pitches in a Japan Series Game 6 and came back the next day to save Game 7. \"Absolutely, it'll be a big game.\" \nTanaka has a big-game attitude, a toughness that is especially evident on nights like Wednesday, when he is forced to battle. Even with diminished stuff, he's a safer choice for the Wild Card Game than rookie Luis Severino, who looks like a future ace but has started just 10 major league games. He's a safer choice than CC Sabathia, who has the same toughness but even more diminished stuff. Andy Marlin-USA TODAY Sports Luis Severino has better stuff, but Tanaka is still the Yankees' best choice for a Wild Card Game starter. \nTanaka's fastball averaged 92.1 mph Wednesday, according to BrooksBaseball.net . While that's not far off from where it has been for much of this season, it's a tick down from where he was in his exciting first month with the Yankees. \nSince then, of course, Tanaka has had to deal with a partially torn ligament in his right elbow. He has proven that it was a good choice to put off Tommy John surgery, and that he can be a successful pitcher with what he takes to the mound now. \n\"We've been very pleased with the way he's thrown the ball,\" Girardi said Wednesday afternoon. \"I think he's had a very good second year.\" \nHe ends the regular season with a 12-7 record and a 3.51 ERA, and the other numbers aren't bad, either. \nHe's a very good pitcher, but in a game you have to win, you'd rather count on a great pitcher. \nCan the Yankees depend on him? Next week, they'll have little choice. \n\nDanny Knobler covers Major League Baseball as a national columnist for Bleacher Report. \nFollow Danny on Twitter and talk baseball.", "external_links": [], "published": "2015-10-01T14:25:00.000+03:00", "crawled": "2015-10-01T14:46:51.591+03:00", "highlightTitle": ""}