{"organizations": [], "uuid": "29a2133f0f9ee0606d05a76f9af7e880962613c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "http://s4.reutersmedia.net/resources/r/?m=02&d=20151017&t=2&i=1087642141&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXNPEB9G029", "site_section": "http://www.reuters.com/news/sports", "section_title": "Sports News, Highlights &amp; Coverage | Reuters.com", "url": "http://www.reuters.com/article/2015/10/17/us-tennis-australia-norman-idUSKCN0SB06Z20151017", "country": "US", "title": "Former top golfer Norman slams 'stupid' Kyrgios, Tomic", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Former top golfer Norman slams 'stupid' Kyrgios, Tomic | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T11:39:00.000+03:00", "replies_count": 0, "uuid": "29a2133f0f9ee0606d05a76f9af7e880962613c9"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/10/17/us-tennis-australia-norman-idUSKCN0SB06Z20151017", "ord_in_thread": 0, "title": "Former top golfer Norman slams 'stupid' Kyrgios, Tomic", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MELBOURNE Former world number one golfer Greg Norman has lashed young Australian tennis players Nick Kyrgios and Bernard Tomic for behaving \"stupidly\" on tour and offered to lecture them face-to-face on the values of good sportsmanship.\nTomic and Kyrgios have drawn scathing criticism from players and pundits for a raft of transgressions on and off the court.\nWorld number 20 Tomic has clashed with Australian tennis officials over funding and was arrested by Miami police for holding a noisy hotel room party earlier this year.\nKyrgios, ranked 32, was roundly condemned for a lewd slur directed at opponent Stan Wawrinka during a match in Canada and has continued to rack up fines for poor on-court behaviour on the Asian swing of the ATP tour.\nNorman, who remains revered in Australia as a paragon of good sportsmanship, said the pair were letting down the country.\n\"I don't care about the individuals themselves but when you're carrying the Australian flag you don't represent your country like an idiot, you represent the country like the country wants to be represented,\" the 60-year-old said on Brisbane radio.\n\"They have said some stupid things and acted stupidly.\n\"I hope they both become ultra successful because at the end of the day, they will be humbled very quickly. If you become successful you cannot carry on like this.\n\"I haven't seen (Rafa) Nadal or (Novak) Djokovic or the great golfers like Jack Nicklaus, Ben Hogan and Arnold Palmer acting like that.\n\"If you want to act that way, fine, but remember you've got respect for your country and your sport that you have to protect.\n\"I'd like to sit down with them, athlete to athlete and talk about the responsibilities they do carry. They have to make some changes and some sacrifices.\"\nLocal pundits have been quick to compare the bad boy duo of Australian tennis with the country's top golfers in Jason Day and Adam Scott.\nBoth Day and Scott have each won major tournaments and claimed the top ranking of their sport without a whiff of controversy.\nTwo-time major champion Norman said Australian golf was in good hands, describing Day and Scott as \"great, elite, iconic players\".\n(Reporting by Ian Ransom ; Editing by John O'Brien)", "external_links": [], "published": "2015-10-17T11:39:00.000+03:00", "crawled": "2015-10-17T11:33:59.120+03:00", "highlightTitle": ""}