{"organizations": ["Indiana Ohio State"], "uuid": "2ce72737e0e4ecfd7a879c3b8f853d470c464e7c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.local12.com", "main_image": "http://www.local12.com//template/ugc/wkrc/1601/iXzqEUa9.jpg", "site_section": "http://www.local12.com/sports/features/local-sports//rss.xml", "section_title": "wkrc LOCAL Sports", "url": "http://www.local12.com/sports/features/local-sports/stories/Ohio-State-looks-to-extend-Big-Ten-streak-against-Indiana-213101.shtml", "country": "US", "title": "Ohio State looks to extend Big Ten streak against Indiana", "performance_score": 0, "site": "local12.com", "participants_count": 0, "title_full": "Ohio State looks to extend Big Ten streak against Indiana", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T20:25:00.000+03:00", "replies_count": 0, "uuid": "2ce72737e0e4ecfd7a879c3b8f853d470c464e7c"}, "author": "", "url": "http://www.local12.com/sports/features/local-sports/stories/Ohio-State-looks-to-extend-Big-Ten-streak-against-Indiana-213101.shtml", "ord_in_thread": 0, "title": "Ohio State looks to extend Big Ten streak against Indiana", "locations": ["Indiana", "Ohio"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ohio State looks to extend Big Ten streak against Indiana \nUpdated: Thu, Oct 01 2015, 05:25 PM \nCOLUMBUS, Ohio (AP) -- The numbers tell the story for coach Urban Meyer during his time at Ohio State: 24-0. \nThe Buckeyes are the only team in Big Ten history to win every regular-season conference game three straight seasons, although Minnesota was unbeaten at 12-0-4 from 1933-35. Top-ranked Ohio State's first crack at extending the streak is Saturday at Indiana. \n\"That's the big thing, just getting in guys' heads that it's the Big Ten season,\" Ohio State linebacker Joshua Perry said. \"This is where we start to achieve our goals this year.\" \nDespite the unblemished Big Ten record under Meyer, the Buckeyes (4-0) have one conference title during the span. In 2012 they were ineligible for the championship game because of NCAA sanctions for violations by former coach Jim Tressel. The following season Michigan State defeated the Buckeyes in the Big Ten championship game. \nLast season, Ohio State routed Wisconsin 59-0 in the title game and went on to win the College Football Playoff championship. \nOhio State's last regular-season conference defeat was 40-34 at Michigan on Nov. 26, 2011, under interim coach Luke Fickell. \nThe Buckeyes opened this season with victories against Virginia Tech, Hawaii, Northern Illinois and Western Michigan in sometimes erratic fashion, but linebacker Raekwon McMillan said those games were good preparation. \n\"We definitely take more interest in the Big Ten because now we're playing for a championship,\" he said. \nWhile some point to the Nov. 21 game against No. 2 Michigan State as the lone challenge until then, the Hoosiers (4-0) won't be taken lightly. They twice gave Ohio State scares despite Indiana's 6-18 conference record the past three seasons. \nMeyer this week called the 52-49 victory in Bloomington on Oct. 13, 2012, a \"program changer.\" That was in Meyer's first season in Columbus, and it revealed the obstacles he faced. \nThe Buckeyes led 45-27 early in the fourth quarter and secured the victory by recovering an onside kick with a minute left. \n\"That was one of the few times I've ever seen a defense quit playing hard, and that was a problem,\" he said. \"Mistakes are one thing, but when I saw what I saw, that was not a good moment.\" \nOhio State defensive lineman Joel Hale three years later still recalls the game. \n\"I remember that we didn't finish. That's what I remember,\" he said. \"At halftime we were up by a good amount and we let it go.\" \nOhio State last season was 9-1 and seventh-ranked when Indiana, headed for a 4-8 record, led 20-14 late in the third quarter at Ohio Stadium. Then Jalin Marshall took over for the Buckeyes. He scored four touchdowns in the final 17:20, including a 54-yard punt return and three passes from J.T Barrett for the 42-27 victory. \nIndiana coach Kevin Wilson is wary of a repeat performance by Marshall but knows other Buckeyes such Ezekiel Elliott, Cardale Jones, Braxton Miller, Curtis Samuel and Michael Thomas can be equally dangerous. \n\"(Marshall) is dynamic,\" Wilson said. \"The problem is there's a bunch of guys like that.\" Related Stories", "external_links": [], "published": "2015-10-01T20:25:00.000+03:00", "crawled": "2015-10-02T03:13:47.052+03:00", "highlightTitle": ""}