{"organizations": ["Roughriders Alouettes"], "uuid": "36859978877cd95550c924d337d5ad3f4665d53e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.winnipegsun.com", "main_image": "http://storage.winnipegsun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297760143513_LARGE_BOX.jpg?quality=80&stmp=1444866913147&size=100x", "site_section": "http://www.winnipegsun.com/sports/rss.xml", "section_title": "Top Sports stories", "url": "http://www.winnipegsun.com/2015/10/14/alouettes-acquire-veteran-qb-kevin-glenn-from-roughriders", "country": "CA", "title": "Alouettes acquire veteran QB Kevin Glenn from Roughriders", "performance_score": 0, "site": "winnipegsun.com", "participants_count": 0, "title_full": "Alouettes acquire veteran QB Kevin Glenn from Roughriders", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T01:02:00.000+03:00", "replies_count": 0, "uuid": "36859978877cd95550c924d337d5ad3f4665d53e"}, "author": "", "url": "http://www.winnipegsun.com/2015/10/14/alouettes-acquire-veteran-qb-kevin-glenn-from-roughriders", "ord_in_thread": 0, "title": "Alouettes acquire veteran QB Kevin Glenn from Roughriders", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kevin Glenn"], "text": "Alouettes acquire veteran QB Kevin Glenn from Roughriders \nBill Beacon, THE CANADIAN PRESS First posted: Wednesday, October 14, 2015 04:30 PM CDT | Updated: Wednesday, October 14, 2015 05:02 PM CDT Newly-acquired Alouettes quarterback Kevin Glenn poses for the cameras following a news conference in Montreal on Wednesday, Oct. 14, 2015. (Graham Hughes/THE CANADIAN PRESS) Roughriders should purge some parts, stockpile draft picks MONTREAL - \nIt will be up to veteran quarterback Kevin Glenn to try to get the Montreal Alouettes to the Canadian Football League playoffs. \nThe Alouettes, ravaged by injuries at quarterback, acquired the 36-year-old from the last-place Saskatchewan Roughriders for a fifth round draft pick on Wednesday. He got a contract extension through the 2016 season as part of the deal. \nCoach and general manager Jim Popp hopes Glenn can pick up the team's system and terminology in time to start a home game Sunday against the Hamilton Tiger-Cats. \nThe Alouettes (5-9) have four regular season games remaining to try to avoid missing the playoffs for the first time since the team returned to Montreal in 1996. \n\"It's no added pressure,\" said Glenn. \"We play for these opportunities to be in a storybook.\" \nPopp made the deal ahead of the CFL trade deadline after rookie Rakeem Cato suffered a concussion in a 25-17 loss at home to the Toronto Argonauts on Monday. \nQuarterbacks have been a disaster for Montreal this season. Starter Jonathan Crompton and backup Dan LeFevour were injured in the season opener. Cato, Brandon Bridge, Tanner Marsh and Anthony Boone have seen action since then. \nGlenn, who will be their seventh quarterback to take a snap, at least brings a wealth of CFL experience. The 15-year veteran has 3,455 career completions for 45,510 yards. \n\"It's tough sometimes getting traded in the middle of the year, but I beleive Montreal has a great team,\" said Glenn. \"I just want to do my part. \n\"It's all exciting, especially at my time of career. The big thing is being on a team that's a contender. Watching from far, this is a very good team. I'm glad to be here.\" \nGlenn has been nearly everywhere in the CFL. He started in 2001 with Saskatchewan, moved to Winnipeg in 2004, to Hamilton in 2009, Calgary in 2012, B.C. in 2014 and back to Saskatchewan this season. His rights have also been owned by Toronto and Ottawa, so the only team he's never been part of is Edmonton. \nThe Detroit native looks forward to working with the co-offensive co-ordinators Ryan Dinwiddie, his former teammate in Winnipeg, and Anthony Calvillo, the CFL's all-time passing leader and a long-time rival. \nGlenn was also a teammate of receiver Nik Lewis in Calgary and considers S.J. Green the best receiver in the league. \nThe question is how much Glenn has left in his legs. \n\"I think I've got a lot left,\" he said. \"I don't think this would have happened if I didn't.\" \nPopp said he is not giving up on his young quarterbacks, but hopes having Glenn as the starter this year and probably next will give them time to develop. \nAnd by acquiring Glenn, he has shown he is not giving up on the season. \nMontreal is last in the East Division but tied with both B.C. (5-9) and Winnipeg (5-10) for the third playoff spot in the West Division standings. The Alouettes would have to accumulate more points than both clubs in order to become the first Eastern squad to cross over to the West come playoff time. \n\"We're just as much in it as anyone,\" said Popp. \"We're not going to stop what we're doing. \n\"We have too good of a team. We've just had some hard luck.\" \nGlenn completed 171-of-257 passes for 2,174 yards with nine TDs and 10 interceptions this season with the Riders (2-13), who have been eliminated from playoff contention in the West Division. Sponsored Links", "external_links": [], "published": "2015-10-15T01:02:00.000+03:00", "crawled": "2015-10-15T04:21:57.040+03:00", "highlightTitle": ""}