{"organizations": [], "uuid": "cec2affb857ccb196458ddbf35921b00ebdb3e8d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48531/sports", "section_title": "Sports - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30295368/eb-sport-group-announces-relay-a-fitness-tracker-with-caller-id-text-notifications-and-auto-sleep", "country": "US", "title": "EB Sport Group Announces RELAY, A Fitness Tracker With Caller ID/ Text Notifications and Auto Sleep", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "EB Sport Group Announces RELAY, A Fitness Tracker With Caller ID/ Text Notifications and Auto Sleep - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "cec2affb857ccb196458ddbf35921b00ebdb3e8d"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30295368/eb-sport-group-announces-relay-a-fitness-tracker-with-caller-id-text-notifications-and-auto-sleep", "ord_in_thread": 0, "title": "EB Sport Group Announces RELAY, A Fitness Tracker With Caller ID/ Text Notifications and Auto Sleep", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " EB Sport Group\nELMSFORD, N.Y. , Oct. 19, 2015 /PRNewswire/ -- EB Sport Group™, a leading provider of innovative sport and fitness products, is introducing the RELAY, the newest fitness tracker from their WeGo product line. The RELAY is designed for consumers on the go who are looking for a 24/7 activity tracker experience and smart watch like features. In addition to the standard fitness metrics, the RELAY offers caller ID and text right on the display, showing users their most urgent and important messages.\n\"The WeGo line is meant for the everyday consumer, and the RELAY is the perfect fit for this family of products,\" said Herbie Calves, Senior Vice President of Marketing & Product Development at EB Sport Group. \"This thoughtful, smart choice tracker provides consumers with notifications for only the most urgent messages they need to read – calls and texts. Consumers don't want every single email vibrating on their wrist.\"\nDuring the day many people find themselves either away from their phone or in an environment where it would be distracting to take their phone out of their pocket. The RELAY offers consumers a stealthy and non-distracting option. This attractive wrist worn tracker also comes with a new auto sleep feature, where users no longer have to manually place their device into \"sleep mode.\"\nThe WeGo RELAY fitness band measures core metrics such as calories burned, steps taken, and total distance traveled. This wrist-worn fitness band blends functionality and style, with a crisp OLED display, Bluetooth connectivity, and an easy to use interface. Additionally, the WeGo RELAY includes:\nNEW Auto Sleep Feature – Consumers no longer need to remember to put their fitness band in and out of sleep mode Sleep Quality Measurement (Deep vs. Light) Caller ID and Text Notifications Replaceable Straps Unlike traditional phone alerts, the messages and names sent to users' phones are displayed right on the RELAY screen. Knowing that users don't want to be bombarded with emails all day, the WeGo RELAY is feature rich without complexity, offering only caller ID and text.\nIn addition to being connected on their device, WeGo users have access to the Join WeGo app on both Android and iOS supported devices, which makes it easy to track your daily/monthly accomplishments. Users are able to customize their profile within the app in a few short steps, and easily track activity all day to gain insight into how much they move, sleep, and more.\nThe WeGo RELAY will be available at most major retailers this Holiday Season for $89.99 , and is available now on Ebbrands.com\nAbout EB Sport Group\nEB Sport Group is a leading provider of innovative sport and fitness products. The Group manages a number of well-recognized brands, distributed globally through specialty sporting goods and department stores, mass merchants, online and catalogs. EB Sport Group is a division of EB Brands Holdings Inc., a developer, manufacturer and marketer of a comprehensive range of consumer products through numerous retail distribution channels in the U.S and across 70 countries worldwide. Established in 1979, the worldwide headquarters are based in Elmsford, NY .\nFor more information, visit www.ebbrands.com or WeGo's Facebook page.\n releases/eb-sport-group-announces-relay-a-fitness-tracker-with-caller-id-text-notifications-and-auto-sleep-300161371.html\n ", "external_links": ["http://joinwego.com/", "https://ebbrands.com/products/wego/wego-relay-wireless-activity-and-sleep-tracker", "http://www.xmlnews.org/ns/", "http://rt.prnewswire.com/rt.gif?NewsItemId=NE30616&Transmission_Id=201510191147PR_NEWS_USPR_____NE30616&DateId=20151019", "https://www.facebook.com/joinWeGo", "http://www.prnewswire.com/news-releases/eb-sport-group-announces-relay-a-fitness-tracker-with-caller-id-text-notifications-and-auto-sleep-300161371.html", "http://www.ebbrands.com/"], "published": "2015-10-19T03:00:00.000+03:00", "crawled": "2015-10-19T19:44:31.495+03:00", "highlightTitle": ""}