{"organizations": [], "uuid": "92c09f1302609d7a5cd877cc613ebe2529bdd580", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sportsnews.com.au", "main_image": "http://sportsnews.com.au/defaultimage.jpg", "site_section": "http://www.sportsnews.com.au/category/rugby-union/feed", "section_title": "Sports News Australia » Rugby Union News", "url": "http://www.sportsnews.com.au/rugby-union/folau-confident-of-overcoming-rwc-injury/159517", "country": "CA", "title": "Folau confident of overcoming RWC injury", "performance_score": 0, "site": "sportsnews.com.au", "participants_count": 1, "title_full": "Folau confident of overcoming RWC injury", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T09:18:00.000+03:00", "replies_count": 0, "uuid": "92c09f1302609d7a5cd877cc613ebe2529bdd580"}, "author": "AAP", "url": "http://www.sportsnews.com.au/rugby-union/folau-confident-of-overcoming-rwc-injury/159517", "ord_in_thread": 0, "title": "Folau confident of overcoming RWC injury", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Folau confident of overcoming RWC injury   5:18 pm   \nInjured Wallabies fullback Israel Folau says he’ll do everything within his powers to overcome an ankle injury in time for Australia’s World Cup quarter-final with Scotland. \nInjuries to Folau, Matt Giteau (ribs) and star forward David Pocock (calf) took some of the shine off the Wallabies’ brilliant win over Wales on Saturday (Sunday AEDT). \nPocock was unable to finish the 15-6 victory over Wales, leaving the field with 20 minutes remaining having twice been treated for a calf injury. \nThe flanker has been Australia’s best player through the group stage and his absence would leave a huge gap to fill, although the Wallabies will welcome fellow back-rower Michael Hooper from suspension next week. \nFolau was in doubt all week for Australia’s final pool game, having rolled his ankle in last weekend’s win over England. \nDespite passing a fitness test on Thursday, he admitted to not being 100 per cent fit heading into the all-important clash against the Welsh – and that became more evident as the game wore on with the former NRL and AFL player’s movement becoming more laboured. \n“I will do everything I can to make sure I am right for the game,” Folau said. \n“It is a big game, it’s a quarter-final. You don’t want to miss those games. \n“I am pretty confident at this stage now, considering where I was last week.” \nCoach Michael Cheika admitted he would’ve taken the brilliant fullback off had he not already cleared his bench. \n“We did want to bring him off, in a perfect world we would’ve brought him off with maybe 10 or 20 minutes to go because he hadn’t trained all week,” Cheika said. \nFolau said he had no choice but to “dig deep”. \n“For us as a team, it showed how much work we put in together and how much respect we have for each other,” Folau said. \n“We had no option there but to dig really deep at that stage where we had two guys off and only had 13 players. \n“We really had to test ourselves out there. It was obviously hugely satisfying to come out of that without giving up any points. \n“We are happy about that but we want to make sure we keep working hard going into the next game.” \nFolau had a mixed evening against the Welsh, appearing to be playing without much confidence in his ankle and having an uncharacteristically poor game under the high ball. \nBut he came out firing in the second half, making two clean breaks and finishing as the Wallabies’ top metre-earner with 64.  ", "external_links": [], "published": "2015-10-11T09:18:00.000+03:00", "crawled": "2015-10-11T11:47:00.559+03:00", "highlightTitle": ""}