{"organizations": ["Mississippi State", "Troy"], "uuid": "379dd0fd6750da401f0863dfe0efd221e0f882ba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.montgomeryadvertiser.com", "main_image": "http://www.gannett-cdn.com/-mm-/561b0fa0e1eda814a898795486fab36c6403c86f/c=1-151-3001-1846&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/10/Montgomery/B9319001060Z.1_20151010204306_000_GHNC6S7H9.1-0.jpg", "site_section": "http://rssfeeds.montgomeryadvertiser.com/montgomery/sports", "section_title": "Montgomery - Sports", "url": "http://www.montgomeryadvertiser.com/story/sports/college/auburnauthority/2015/10/10/bruce-pearl-producing-historic-recruiting-auburn/73760114/", "country": "US", "title": "Despite loss, Troy sees promise in second-half play", "performance_score": 0, "site": "montgomeryadvertiser.com", "participants_count": 0, "title_full": "Despite loss, Troy sees promise in second-half play", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T07:55:00.000+03:00", "replies_count": 0, "uuid": "379dd0fd6750da401f0863dfe0efd221e0f882ba"}, "author": "", "url": "http://www.montgomeryadvertiser.com/story/sports/college/auburnauthority/2015/10/10/bruce-pearl-producing-historic-recruiting-auburn/73760114/", "ord_in_thread": 0, "title": "Despite loss, Troy sees promise in second-half play", "locations": ["Mississippi", "Davis Wade Stadium", "Starkville"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Brandon Holloway", "A. Stacy Long", "Keith Warren", "Troy", "JaQuadrian Lewis"], "text": "Despite loss, Troy sees promise in second-half play A. Stacy Long , Montgomery Advertiser 11:55 p.m. CDT October 10, 2015 Mississippi State running back Brandon Holloway (10) is hit by Troy's JaQuadrian Lewis (14), Mississippi State played Troy in a college football game on Saturday, October 10, 2015 at Davis Wade Stadium in Starkville. Photo by Keith Warren (Mandatory Photo Credit) (Photo: Keith Warren) CONNECT 4 TWEET LINKEDIN COMMENT EMAIL MORE \nSTARKVILLE, Miss. — What could have been a wilting halftime discussion was considerably calmer and wrapped with a challenge. \nThe Troy Trojans, facing a five-touchdown deficit and potentially epic embarrassment Saturday against Mississippi State, could have answered with surrender. \n“I asked them, ‘What do we want to be about as a program?’” Troy coach Neal Brown said. \nThe Trojans, despite a 45-17 loss to the Bulldogs, feel they responded. Troy coach Neal Brown describes his halftime talk with players during Saturday's game at Mississippi State. The Trojans trailed 38-0 before a 45-17 final. Stacy Long \nSure, it was against MSU’s reserves, but it marked a sharp difference from Troy’s 62-7 loss in Starkville two years ago. \nTroy (1-4) held the Bulldogs to 86 yards and outscored them 17-7 in the second half. \n“Nobody gave up on offense and nobody gave up on defense,” freshman safety Cedarius Rookard said. “We said we have to represent our last name, our team and our university. \n“I feel we did that.” Troy freshman safety Cedarius Rookard says that the Trojans' play in the second half of Saturday's loss at Mississippi State will be a turning point for the program. Stacy Long \nThe Trojans, with their four straight non-winning seasons since their last Sun Belt Conference title, will mark Saturday — at least the second half — as a landmark moment, Brown said. \n“Are we proud of the score? Absolutely not,” Brown said. “But I’m proud of the guys in that locker room. They played with pride. \n“I think this will be a defining moment of where we’re going.” Troy quarterback Dontreal Pruitt describes the halftime talk between the coaches and players during Saturday's game at Mississippi State. Stacy Long \nThe first half, at least for the Trojans, is best forgotten. \nMississippi State (4-2) scored twice in the game’s first two minutes and led 38-0 at halftime. \nStar quarterback/Heisman hopeful Dak Prescott, who was sick, coach Dan Mullen said, left with the Bulldogs up 21-0. \nMSU had yet to run its 10th offensive play. \n“If we had this discussion at halftime, it would be a whole other theme,” Brown said. “We came out and really got overwhelmed.” \nWith Troy starting quarterback Brandon Silvers out with an injury, backup Dontreal Pruitt had a 5-yard TD run in the third quarter. \nSenior running back Brandon Burks added a 74-yard run — Troy’s longest scoring run in eight years. \n“It gives us a lot of confidence,” freshman receiver Deondre Douglas said. “We haven’t faced a team that good, and I don’t see another team on our schedule that good.” Troy freshman receiver Deondre Douglas says Troy's second-half play at Mississippi State will help revive the program. Stacy Long \nTroy, down 38-14 after Burks’ touchdown, uncorked a successful onsides kick, too. \nIt didn’t lead to points, but Brown said the decision will reap benefits. \n“That was a message for our players, first and foremost, but also for our fans,” Brown said. “It also sends a message to our recruits. \n“Compete every day, that’s on a wall in our building and it’s on the shirts we wear every day. We’re not going to quit.” Troy coach Neal Brown says the Trojans \"sooner or later\" will get back to their past \"winning ways.\" Stacy Long Read or Share this story: http://on.mgmadv.com/1LoyoNJ TOP VIDEOS", "external_links": [], "published": "2015-10-11T07:55:00.000+03:00", "crawled": "2015-10-11T09:54:10.346+03:00", "highlightTitle": ""}