{"organizations": [], "uuid": "4d149902df054bb024d483f49eb3ab041917b8de", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sport.co.uk", "main_image": "http://images.sport.co.uk/150x150/c301c2b256595cc006f07e54292bc627.jpg", "site_section": "http://feeds.feedburner.com/SportcoukNewsRssFeed", "section_title": "General Sports News from Sports.co.uk", "url": "http://www.sport.co.uk/football/euro-2016-qualification-everything-you-need-to-know-ahead/6904623/", "country": "JE", "title": "Euro 2016 qualification - everything you need to know ahead of the final two rounds of qualifiers", "performance_score": 0, "site": "sport.co.uk", "participants_count": 0, "title_full": "Euro 2016 qualification - everything you need to know ahead of the final two rounds of qualifiers", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T11:58:00.000+03:00", "replies_count": 0, "uuid": "4d149902df054bb024d483f49eb3ab041917b8de"}, "author": "", "url": "http://www.sport.co.uk/football/euro-2016-qualification-everything-you-need-to-know-ahead/6904623/", "ord_in_thread": 0, "title": "Euro 2016 qualification - everything you need to know ahead of the final two rounds of qualifiers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Euro 2016 qualification - everything you need to know ahead of the final two rounds of qualifiers By The Insider (columnist) 08 Oct 2015 08:58:19 \nreads \nAutomatic qualification for Euro 2016 will be concluded in the coming week with the final two rounds of matches. \nHere we explain everything you might need to know about the competition. \nHow many teams qualify before the play-offs in November? \nEuro 2016 will comprise of 24 teams: hosts France, plus 23 others. The winners and runners-up of each of the nine qualification groups automatically reach the tournament, as does the best third-placed team. Thereafter, the eight remaining third-placed teams proceed to the play-offs, where the final four will be decided. \nWho has already qualified? \nCzech Republic, England, Austria and - unexpectedly - Iceland. \nWho is likely to qualify? \nWales, Belgium, Spain, Slovakia, Germany, Poland, Switzerland, Northern Ireland, Romania, Russia, Italy, Norway, Portugal and Denmark, as each presently occupy the top two places in their groups. Ukraine, with 16 points, are at present the \"best\" third-placed team. \nThat would leave Israel, Turkey, the Republic of Ireland, Slovenia, Hungary, Sweden, Croatia, and Albania to compete in the play-offs. However Israel, Ukraine, Ireland, Slovenia, Hungary, Sweden, Albania, Montenegro, Finland, and Estonia - the latter three currently occupying fourth place in their respective groups - can still mathematically secure a top-two finish. \nHolland, Bosnia and Herzegovina, and Scotland can also yet reach the play-offs by finishing in the top three. \nNorthern Ireland, incidentally, last appeared at a major tournament at the 1986 World Cup, while Wales last did at the European Championships in 1975. \nWho are set to be the biggest casualties? \nHolland, who, despite having reached the World Cup semi-finals little over over a year ago, need to pick up three more points than Turkey in the final two rounds to finish in the top three in Group A. The Dutch finish up against Kazakhstan and the Czech Republic, while Turkey face the Czechs and Iceland. \nGreece, champions in 2004, and Serbia, are already out of contention. \nWhen do the Home Nations play? \nEngland, who impressively have so far won each of their eight qualifiers, host Estonia at Wembley on Friday before travelling to Lithuania on Monday. \nIreland host Germany at the Aviva Stadium on Thursday, and visit Poland on Sunday. \nScotland-Poland is at Hampden Park on Thursday, before they travel to Gibraltar for their final group-stage qualifier on Sunday. \nWales visit Bosnia and Herzegovina on Saturday, and then host Andorra at the Cardiff City Stadium on Tuesday. \nNorthern Ireland face Greece at Windsor Park on Thursday, and Finland in Helsinki on Sunday. \nEach fixture kicks off at 7.45pm, except for Finland-Northern Ireland, which is at 5pm. \nIf the Republic of Ireland only have one fewer point than Ukraine, can they still avoid the play-offs by being the \"best\" third-placed team? \nIn theory, yes, but Martin O'Neill's team, who are only third because of Scotland's disappointing defeat by Georgia, have to amass at least one more point from fixtures with Germany and Poland than Ukraine do in their fixtures away to Macedonia and at home to Spain, which would seem unlikely. \nOnce the group stages conclude, when are the play-offs? \nThe first legs will be staged between November 12-14; the returns between November 15-17. Any ties that cannot be separated after 90 minutes of the second leg will be decided upon by away goals and then penalties. The draw for the play-offs, incidentally, will take place on October 18, in Nyon, Switzerland. \nWhen does the draw for the final tournament take place? \nRepresentatives from the 24 qualifiers will be in Paris on December 12 when the official draw for Euro 2016 takes place. There will be four pots for the draw: in the first will be the reigning European champions Spain, plus four others. Pots 2, 3 and 4 will each have six teams; hosts France will not be included in the pots because they are automatically assigned as team A1. \nOnce all this has concluded, when does the actual tournament finally begin? \nEuro 2016 begins on June 10, and will conclude on July 10. France will have 10 host stadiums. Related Sport News", "external_links": [], "published": "2015-10-08T11:58:00.000+03:00", "crawled": "2015-10-08T19:53:49.827+03:00", "highlightTitle": ""}