{"organizations": [], "uuid": "b5d26df3538d18a52bcfd977b20d9f27cae56f3a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattletimes.com", "main_image": "http://www.seattletimes.com/wp-content/themes/st_refresh/img/st-meta-facebook.png", "site_section": "http://www.seattletimes.com/sports/feed/", "section_title": "The Seattle Times » Sections » Sports", "url": "http://www.seattletimes.com/sports/high-school/20th-annual-curtis-invite-cross-country-results/", "country": "US", "title": "Nationals’ Max Scherzer throws his second no-hitter of the season, blanking Mets", "performance_score": 0, "site": "seattletimes.com", "participants_count": 1, "title_full": "Nationals’ Max Scherzer throws his second no-hitter of the season, blanking Mets", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T06:26:00.000+03:00", "replies_count": 0, "uuid": "b5d26df3538d18a52bcfd977b20d9f27cae56f3a"}, "author": "Seattle Times staff", "url": "http://www.seattletimes.com/sports/high-school/20th-annual-curtis-invite-cross-country-results/", "ord_in_thread": 0, "title": "Nationals’ Max Scherzer throws his second no-hitter of the season, blanking Mets", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Nationals’ Max Scherzer throws his second no-hitter of the season, blanking Mets Originally published October 3, 2015 at 8:26 pm Updated October 3, 2015 at 8:27 pm Max Scherzer pitched his second no-hitter this season for Washington, striking out a team-record 17 and leading the Nationals over the NL East champion New York Mets 2-0 Saturday night for a doubleheader sweep in New York. By Seattle Times staff The Associated Press \nMax Scherzer pitched his second no-hitter this season for Washington, striking out a team-record 17 and leading the Nationals over the NL East champion New York Mets 2-0 Saturday night for a doubleheader sweep in New York. \nOnly one batter reached base against Scherzer, and that came when third baseman Yunel Escobar bounced a throw for an error on Kevin Plawecki’s leadoff grounder in the sixth inning. \nThe All-Star righty became just the sixth pitcher to throw two no-hitters in a year, and the first since Roy Halladay in 2010 — the former Phillies ace had one in the regular season and another in the playoffs. \n“These things are special,” Scherzer said. “To do it twice in one season, my gosh, it doesn’t seem possible.” Most Read Stories Unlimited Digital Access. $1 for 4 weeks. \nScherzer struck out nine straight batters before Curtis Granderson hit an easy popup to Escobar to end it on his 109th pitch. \n“To throw a no-hitter sometimes it takes a little luck,” Scherzer said. “I was able to execute all four of my pitches whether I was behind in the count or ahead in the count.” \nWorking quickly on a brisk, blustery night at Citi Field, Scherzer (14-12) added to the no-hitter he threw against Pittsburgh on June 20, when he came within one strike of a perfect game. \nJohnny Vander Meer, who pitched two in a row, Nolan Ryan, Virgil Trucks and Allie Reynolds also threw a pair in the same season. Rangers can’t clinch AL West \nElvis Andrus remained on the ground with his face in the dirt after sliding past second base and being tagged for the final out. \nThe playoff-bound Texas Rangers again were denied a chance to clinch the AL West title, blowing a four-run lead in the ninth inning in an 11-10 loss Saturday to the wild card-chasing Los Angeles Angels. \n“It’s not over. We still have tomorrow and tonight really. It’s thoroughly disappointing what just transpired,” Rangers starter Colby Lewis said. “We’ve come this far. We’re not going to let anything else get us down.” \nTexas entered with a two-game division lead over Houston, which was one game ahead of the Angels for the AL’s second wild card. \nA loss by Houston at Arizona on Saturday night would give Texas its first division title since 2011 and would drop the Astros into a tie with the Angels going into Sunday, the last scheduled day of the regular season. \nThe Angels trailed 10-6 before consecutive homers by Erick Aybar and Kole Calhoun off Shawn Tolleson, the Texas closer pitching for the fifth straight day. \nRoss Ohlendorf (3-1) relieved and retired Mike Trout out on a grounder, then gave up Albert Pujols’ double on a difficult popup to short right that ricocheted off first baseman Mike Napoli’s glove, whose back was to the plate. \nC.J. Cron, David Freese, Carlos Perez and Giavotella had consecutive two-out singles, with Cron, Perez and Giavotella driving in runs. Before Perez singled on a 2-2 pitch, Texas was one strike from clinching the division. \n“I trust that we bounce back, just like we’ve bounced back all year long,” first-year Rangers manager Jeff Banister said. Seattle Times staff", "external_links": [], "published": "2015-10-04T06:26:00.000+03:00", "crawled": "2015-10-04T06:56:54.535+03:00", "highlightTitle": ""}