{"organizations": [], "uuid": "8a5a37fcb41f77f71087b09882b058fb9d02d1e3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.heraldnews.com", "main_image": "http://www.heraldnews.com/storyimage/WL/20151019/SPORTS/151016025/AR/0/AR-151016025.jpg", "site_section": "http://www.heraldnews.com/sports/pro-sports?template=rss&mime=xml", "section_title": "Professional Sports - The Herald News, Fall River, MA", "url": "http://www.heraldnews.com/article/20151019/SPORTS/151016025/11734/SPORTS?rssfeed=true", "country": "US", "title": "Special teams preparation was key to Pats' success against Colts", "performance_score": 0, "site": "heraldnews.com", "participants_count": 1, "title_full": "Special teams preparation was key to Pats' success against Colts", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T15:49:00.000+03:00", "replies_count": 0, "uuid": "8a5a37fcb41f77f71087b09882b058fb9d02d1e3"}, "author": "Rich Garven @RichGarvenTG", "url": "http://www.heraldnews.com/article/20151019/SPORTS/151016025/11734/SPORTS?rssfeed=true", "ord_in_thread": 0, "title": "Special teams preparation was key to Pats' success against Colts", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Special teams preparation was key to Pats' success against Colts Beyond hoodies and collecting Lombardi Trophies, perhaps nothing is associated with Bill Belichick more than his coaching expertise when it comes to situational football. Comment The Herald News, Fall River, MA By Rich Garven Posted Oct. 19, 2015 at 8:00 PM Updated at 7:49 AM Posted Oct. 19, 2015 at 8:00 PM Updated at 7:49 AM Beyond hoodies and collecting Lombardi Trophies, perhaps nothing is associated with Bill Belichick more than his coaching expertise when it comes to situational football. Belichick is arguably the best coach in NFL history at having his teams prepared for every circumstance, some of which occur every week and others you’ll perhaps see once or twice a year. It was the Patriots’ ability to succeed in three critical special-teams situations in the second half that initially sparked and ultimately secured a 34-27 victory over the Colts on Sunday night in Indianapolis, a result that raised their record to 5-0. The first came with 74 seconds remaining in the third quarter and the Patriots locked in a far more competitive game than most predicted, their lead standing at 27-21. The Colts predictably sent out their punt unit on fourth-and-3 from their own 37-yard line. Then they unpredictably unveiled a gadget play, having receiver Griff Whalen line up at center and safety Colt Anderson at quarterback with the other nine Colts bunched far to their right. The Patriots’ punt coverage unit may not have seen a version of the “swinging gate” play before, but the players didn’t panic because they quickly referred to a simple tenant they had been coached to follow. “I think basically in punt formations like that it’s just a numbers game,” Belichick said during a conference call on Monday. “You want to have enough guys to match to the smaller numbers and as many guys as you can to match to the larger number, where they were overshifted.” So Brandon Bolden, Logan Ryan, and Jonathan Bostic hovered over the ball and ensured the Patriots had the advantage against the two isolated Colts. Belichick said he didn’t know how the play was supposed to work, but his players made sure it didn’t as Bolden tackled Anderson for a loss. “It was a good, alert play by our punt-return unit,” Belichick said, crediting special-teams coach Joe Judge and his assistant, Ray Ventrone, “for having those guys well prepared; it gave us good field position.” It took six plays for the Patriots to capitalize on that field position, LeGarrette Blount scoring on an 11-yard reception to push the lead to 12 points with 12:48 left to play. The Patriots seriously considered going for two points, but opted to kick the extra point after considering how much time remained. That decision didn’t come into full play until the Colts scored to cut the lead to 34-27 with 1:19 left in the game. Suddenly, old friend Adam Vinatieri was lining up for an extra point that, were it successful, would have positioned the Colts to win the game with another touchdown. Page 2 of 2 - Jamie Collins ensured that wouldn’t be the case when the 6-foot-3, 250-pound linebacker cleanly — anything less would have been illegal — hurdled the interior linemen on both teams to block the extra point. It was the first blocked PAT by a Patriot in seven years and one that won’t be forgotten any time soon due to the display of athleticism by Collins. While Collins made the play on his own, he didn’t make the decision to go for it by himself. “I think anytime you run a play like that you need some sort of coordination,” Belichick said. “I don’t think you want a player to do that on his own because you could have one of your interior linemen making a move into a gap where he’s trying to get through and then you run into each other and that kind of thing. So I don’t really think that’s what you’re looking for.” The block ensured Belichick wouldn’t have to second-guess his decision to not go for two points earlier in the quarter. “The blocked extra point led it to be a touchdown game instead of a six-point game, which, as it turned out, didn’t make any difference,” he said. “But had they recovered the onside kick it would have made a world of difference.” The third critical situational play on special teams also ended in the Patriots’ favor as Rob Gronkowski made a basket catch of Pat McAfee’s rainbow boot to clinch the win as the Colts were out of timeouts. Belichick praised Gronkowski for cleanly handling the ball and Jonathan Freeny for his block that cleared out two Colts. While players are taught to fall to the ground in the name of ball security in such a situation, Belichick had no problem with Gronkowski charging down the sideline. And if Gronkowski, who also recovered an onside kick to secure a season-opening win over the Pittsburgh Steelers, hadn’t stepped out of bounds he likely would have scored. Rich Garven writes for the Worcester Telegram & Gazette of GateHouse Media. By Rich Garven The Herald News, Fall River, MA By Rich Garven Posted Oct. 19, 2015 at 8:00 PM Updated at 7:49 AM", "external_links": [], "published": "2015-10-20T15:49:00.000+03:00", "crawled": "2015-10-21T01:56:27.515+03:00", "highlightTitle": ""}