{"organizations": [], "uuid": "ead1d90867c2e2efdd15bc8373c440b14f1eec09", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "onlineathens.com", "main_image": "http://onlineathens.com/sites/default/files/14793602.jpg", "site_section": "http://ath-cdn.com/taxonomy/term/2/feed", "section_title": "Sports", "url": "http://onlineathens.com/mobile/2015-10-08/former-georgia-dc-richard-bell-brings-knowledge-expertise-prince-avenue-christians", "country": "US", "title": "Former Georgia DC Richard Bell brings knowledge to Prince Avenue Christian coaching staff", "performance_score": 0, "site": "onlineathens.com", "participants_count": 1, "title_full": "Former Georgia DC Richard Bell brings knowledge to Prince Avenue Christian coaching staff", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T05:45:00.000+03:00", "replies_count": 0, "uuid": "ead1d90867c2e2efdd15bc8373c440b14f1eec09"}, "author": "Nicole Saavedra", "url": "http://onlineathens.com/mobile/2015-10-08/former-georgia-dc-richard-bell-brings-knowledge-expertise-prince-avenue-christians", "ord_in_thread": 0, "title": "Former Georgia DC Richard Bell brings knowledge to Prince Avenue Christian coaching staff", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Former Georgia DC Richard Bell brings knowledge to Prince Avenue Christian coaching staff \nAs Prince Avenue Christian Head of School Seth Hathaway stood on the sidelines during a Wolverines away game, he heard the lines crew talking about the school’s coaching staff. \nThey commented on the amount of coaching going on in-game on the sidelines and singled out one man in particular — defensive coordinator Richard Bell. \nHathaway chuckled. \n“He has a few games under his belt,” Hathaway remembers telling them. \nAnd he does. Bell, 78, spent 45 seasons as a college coach, including stints as South Carolina’s head coach in 1982 and as Georgia’s defensive coordinator from 1989-93. He also coached at Georgia Tech (linebackers), West Virginia, Texas Tech, Duke, East Carolina, Navy and Air Force. \nThe third-ranked Wolverines (6-0, 4-0 in Region 8-A) host Athens Academy (5-0, 3-0) at 7:30 tonight. \nBell retired from the Air Force \nin 2006. He wrote a book on defensive football. He traveled with his wife, Marilyn. He consulted with high schools and colleges about their programs. Turns out, retirement didn’t suit him. \n“I pretty much thought he might go back if the right opportunity came up,” Marilyn said. “He was just too active to stay retired.” \nBut Bell didn’t think the right opportunity would mean calling games on Friday instead of Saturdays. \nHe consulted with former Prince Avenue coach Mark Farriba a few times. After multiple trips to Bogart, Farriba figured they might as well make Bell’s contributions official. \n“I said, ‘Well, I’m not doing that, I’m not going to coach in high school,’” Bell said. “I said, because you’re asking me and I thought a lot of him, I said I’ll consider it.” \nHe took almost two months to weigh the offer and started at Prince Avenue in 2010. \nBut there was a catch — he’d have to teach, too. He taught middle school P.E., even ran the mile with his students, until retiring last year. And he did it well enough to be voted one of the school’s teachers of the year in 2014. \n“A man that’s been as many places that he has, done as many things that he has. He’s coached with Bobby Dodd when Bear Bryant was coaching against Bobby Dodd. He was the defensive coordinator at West Virginia when Bobby Bowden was the offensive coordinator,” Prince Avenue coach Jeff Herron said. “He’s done all that but he was willing to come up here and teach middle school P.E. and not just go in there but to do it so well he was voted by his peers as teacher of the year. That sums him up, that’s the person he is. He does everything to the best of his God-given ability and God’s given him a lot of ability.” \nHerron has known Bell a long time and coached Bell’s son, Murray, at Cedar Shoals in the early 1990s. When Herron was approached about taking the Prince Avenue job before the 2013 season, he said if Bell wanted it, he wasn’t interested. \n“He said, ‘I’d rather just keep doing what I’m doing,’” Herron said. “That was a big part of me wanting to come here, was knowing that someone like him would be there.” \nThat expertise has been crucial for a staff that includes a variety of young coaches. Herron said Bell’s long career has helped bring some of those coaches to Bogart. \n“He’s just a wealth of knowledge all the time,” Prince Avenue assistant Garrett Hochstetler said. “Just being able to hear from him, be around him, experience listening to him talk and all the knowledge he has about football.” \nBell quickly found some of high school football’s best moments come away from the field. He taught some of his current players when they were in middle school. He gets to spend more time with them now, outside the confines of the practice field. \n“In college, you just didn’t see your guys during the day,” Bell said. “They were in class, they were busy. The only time you saw them was when they came to practice or when you went by their dorm to see them there. You really had to search out where they were going to be to converse with them, but here you see them every day. That’s something I didn’t realize as much. That’s been a real gift.” \nNow, Bell watches the college games on television on Saturdays. He moves a card table into the TV room in his and Marilyn’s house near Prince Avenue’s campus and breaks down film for the Wolverines’ next game. \n“Whether it’s Prince Avenue or Georgia, South Carolina, all the places I went, it’s still competitive and your competitive juices every Friday night, you want to do well. I’m really just doing this for fun, just enjoy every minute of it,” Bell said. “... It’s just something that, hey, it’s a chance to see a bunch of young men get better and each week, not just as players, but as young men. That’s the really kind of unique thing about it. It’s just something that I really, really enjoy.” \n ", "external_links": [], "published": "2015-10-09T05:45:00.000+03:00", "crawled": "2015-10-09T08:20:41.239+03:00", "highlightTitle": ""}