{"organizations": [], "uuid": "4dac8149038fcd8dbdc4b46d9b117dbd3d4257a6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.philly.com", "main_image": "http://media.philly.com/images/baby-pain.jpg", "site_section": "http://www.philly.com/", "section_title": "Philadelphia local news, sports, jobs, cars, homes - Philly.com", "url": "http://www.philly.com/philly/health/kidshealth/20151009_Reuters_Report_KCN0S32C4_Many_babies_exposed_to_unnecessary_pain_in_research.html", "country": "US", "title": "Many babies exposed to unnecessary pain in research", "performance_score": 0, "site": "philly.com", "participants_count": 1, "title_full": "Many babies exposed to unnecessary pain in research", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "4dac8149038fcd8dbdc4b46d9b117dbd3d4257a6"}, "author": "Frederik Joelving,", "url": "http://www.philly.com/philly/health/kidshealth/20151009_Reuters_Report_KCN0S32C4_Many_babies_exposed_to_unnecessary_pain_in_research.html", "ord_in_thread": 0, "title": "Many babies exposed to unnecessary pain in research", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters Health) - Babies often suffer unnecessary pain in clinical studies, potentially breaching international standards for ethical research, according to a new review of the medical literature.\nEven when proven pain relievers existed, nearly two-thirds of studies involving painful procedures in newborns included a group of babies who got no treatment for their discomfort, researchers found.\n“We are urging parents and ethics review boards to refuse studies that do not provide acceptable analgesia to all babies enrolled in studies, if such pain relief exists,” they wrote in Acta Paediatrica, a medical journal, online September 21. “In addition we are calling on medical journals to refuse to publish studies that deny pain relief to control infants undergoing painful procedures.”\nResearch shows babies experience pain more powerfully than adults, according to Celeste Johnston, one of the report’s two authors and an emeritus professor at the Ingram School of Nursing at McGill University in Montreal, Canada.\nMore coverage Ovarian Tissue Transplant Can Help Some Women Have Kids After Cancer Treatment That’s partly because nerve pathways that help block painful sensations are not yet fully developed, and the receptive fields of nerve cells processing sensory input are larger. That means a small prick in the heel might hurt all the way up to the knee, Johnston, past-president of the Canadian Pain Society, told Reuters Health.\nApart from the pain, minor procedures also cause measurable physiological changes in babies - their blood pressure and heart rate go up, their blood oxygen level drops, and potentially harmful molecules called free radicals are released into their bloodstream.\n“If you have a (pain) treatment that is established, then it’s unethical to withhold it even in a clinical trial,” said Johnston. Doing so, she added, goes against the Declaration of Helsinki, a set of ethical principles guiding research worldwide.\nDr. Joe Brierley, who until recently chaired the Bloomsbury Research Ethics Committee in London and was not involved in the new work, agreed with that message.\n“We would not have allowed one of these studies through in our committee,” Brierley, of Great Ormond Street Hospital for Children in London, told Reuters Health. “We would be like, ‘What do you mean you’re not going to give these babies pain killers?’”\nFor their review, Johnston and Dr. Carlo Bellieni, a bioethicist and specialist in newborn care at Siena University Hospital in Italy, combed through clinical trials published between 2013 and June of this year.\nTrial participants are usually divided into two groups, one of which receives the treatment under investigation. The other group, called the control or comparator group, may receive an inactive placebo, an established treatment, or nothing at all. Then researchers compare the outcomes in the two groups.\nBellieni and Johnston looked specifically for studies in newborns examining various methods of pain relief for procedures like heel pokes or needle pricks, which, as they note, are labeled as minor “although the pain they produce is far from minor.”\nThey found that in 32 of 46 trials, or 70 percent, babies in the control groups were exposed to painful procedures while receiving no treatment to ease their discomfort.\nFocusing on the 36 trials involving procedures for which tried-and-tested pain relief exists, 23, or 64 percent, nonetheless used a placebo or no treatment in the control group. For instance, just one out of seven studies where babies had blood drawn provided pain relief to the control group.\nReuters Health emailed the researchers behind three of these studies - one in Australia, one in Brazil and one in Malaysia - for comments, but received no reply.\nWhile a needle prick may seem trifling to many adults, studies show they cause “severe” pain in babies, ranging from 5.4 to 6.4 on the Neonatal Infant Pain Scale, where 0 is no pain and 7 is maximum pain.\nThere are several proven ways to ease that pain: A few drops of sugar water, breast feeding, skin-to-skin contact and analgesic creams all do the trick. “Everybody knows that effective analgesia exists,” Bellieni told Reuters Health.\nExcept in cases where “for compelling and scientifically sound methodological reasons the use of placebo is necessary,” the Declaration of Helsinki requires researchers to use the “best current proven intervention” in the control group.\nThere could many reasons why researchers choose to withhold pain relief in clinical trials. For example, it may be easier to show that a new intervention is better than nothing, whereas showing that it’s as good or better than a proven pain reliever would be harder. And at many hospitals around the world, infants continue to undergo minor procedures without pain relief.\n“Many ethics boards allow placebo-controlled trials using placebo control or usual care (which is nothing) and parents consent because their child has at least a 50-percent chance of receiving a potential pain-relieving treatment in that particular setting,” said Marsha Campbell-Yeo of Dalhousie University in Halifax, Canada, who studies pain in infants and is also a neonatal nurse practitioner.\nBut the fact that clinical practice is lagging behind the science is no excuse for researchers, Campbell-Yeo, who was not involved in the review, told Reuters Health by email.\n“The trouble is that two wrongs do not make a right,” she said.\nSOURCE: Acta Paediatrica , online September 20, 2015.", "external_links": ["http://bit.ly/1Jq6on7"], "published": "2015-10-09T03:00:00.000+03:00", "crawled": "2015-10-13T07:32:48.080+03:00", "highlightTitle": ""}