{"organizations": ["Hodgson England"], "uuid": "51f7a2dc4c38e79bb919b5b9ab8f24f7255edd3f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.shanghaidaily.com", "main_image": "http://www.shanghaidaily.com/images/mzl.dlomxgvi.png", "site_section": "http://rss.shanghaidaily.com/portal/mainsite/Sports", "section_title": "Shanghai Daily: Sports", "url": "http://www.shanghaidaily.com/sports/soccer/Englands-reserves-staked-claim-to-be-Euro-stars-Hodgson/shdaily.shtml", "country": "", "title": "England's reserves staked claim to be Euro stars - Hodgson", "performance_score": 0, "site": "shanghaidaily.com", "participants_count": 0, "title_full": "England's reserves staked claim to be Euro stars - Hodgson", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T10:29:00.000+03:00", "replies_count": 0, "uuid": "51f7a2dc4c38e79bb919b5b9ab8f24f7255edd3f"}, "author": "", "url": "http://www.shanghaidaily.com/sports/soccer/Englands-reserves-staked-claim-to-be-Euro-stars-Hodgson/shdaily.shtml", "ord_in_thread": 0, "title": "England's reserves staked claim to be Euro stars - Hodgson", "locations": ["England"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "England's reserves staked claim to be Euro stars - Hodgson Source: AFP | October 13, 2015, Tuesday | Online Edition \nROY Hodgson insists the England reserves who helped complete his side's perfect Euro 2016 qualification campaign have staked their claims for starring roles in next year's finals. \nHodgson fielded an experimental line-up for England's last Group E fixture against Lithuania on Monday and the stand-ins responded with a convincing 3-0 victory. \nEverton midfielder Ross Barkley opened the scoring and Harry Kane played a major role in Giedrius Arlauskis's own goal before Alex Oxlade-Chamberlain capped England's 10th success in a row on the road to France. \nThe result made England just the sixth team to win all of their matches in a European Championship qualifying campaign. \nWhile the likes of Joe Hart and Wayne Rooney are certain to return to the side by the time Euro 2016 gets underway in June, England manager Hodgson claimed the understudies have made a convincing case to remain in his plans. \n\"The players who represented us tonight did a terrific job and they have got to feel they have strengthened their chances of being considered for France,\" Hodgson said. \n\"We have used a lot of players in the qualifiers due to injury, so everyone who was part of this group has contributed.\" \nAlthough England had nothing to play for having already wrapped up top seeding and qualification as group winners, Hodgson, aware of the generally unflattering perception of his team in the eyes of the sporting public, was delighted to finish an emphatic campaign with a memorable milestone. \n\"I can't fault anyone tonight. It was a good performance, dominant, and a nice way to end the qualifying campaign,\" he said. \n\"It would have been a surprise if we had not qualified. But the upcoming friendlies are better, stronger opposition sides. We'll see how we deal with that.\" \n\n- Realistic ambitions - \n\nGiven the lack of strong opposition England encountered in Group E, Hodgson has wisely lined up testing friendlies against Spain, France and Germany as he fine-tunes his squad for the Euros. \nAnd he conceded England will probably have a better idea of what their realistic ambitions should be in the finals once those matches have been played. \n\"We will use the friendlies to learn, to see where we are. If we concentrate and play properly we can do well,\" he said. \nEverton defender Phil Jagielka, who captained England in the absence of Rooney, Hart and Gary Cahill, is looking forward to the opportunity to see how England measure up to some of Europe's elite in the warm-up matches. \n\"We have chosen some really tough friendlies. It will be hard games but we will try to prove ourselves,\" he said. \n\"The gameplan from day one was to win all 10 games and we have done it. We have good youth coming through and hopefully if we can nurture it we could have something special. \n\"No games are easy, especially in international football. We got momentum early in the qualifying campaign and just kept it going and going. \n\"Fair play to the management and the boys. We saw through the job to the last day.\"", "external_links": [], "published": "2015-10-13T10:29:00.000+03:00", "crawled": "2015-10-14T02:13:26.410+03:00", "highlightTitle": ""}