{"organizations": [], "uuid": "c5ca4913e3f9f3bd759d948a5228ff15f35fdca3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.courier-journal.com", "main_image": "http://www.gannett-cdn.com/-mm-/2077b011039049db6b4b02eee949989bd5cbf674/c=0-441-2422-1810&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/17/Louisville/Louisville/635807072360722836-RedWhite-12.jpg", "site_section": "http://rssfeeds.courier-journal.com/courierjournal/sports", "section_title": "Courier Journal - Sports", "url": "http://www.courier-journal.com/story/sports/college/louisville/2015/10/18/mangok-mathiangs-work-pays-off-role-changes-for-louisville-basketball/74179994/", "country": "US", "title": "Mangok Mathiang's work pays off as role changes", "performance_score": 0, "site": "courier-journal.com", "participants_count": 0, "title_full": "Mangok Mathiang's work pays off as role changes", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T23:18:00.000+03:00", "replies_count": 0, "uuid": "c5ca4913e3f9f3bd759d948a5228ff15f35fdca3"}, "author": "", "url": "http://www.courier-journal.com/story/sports/college/louisville/2015/10/18/mangok-mathiangs-work-pays-off-role-changes-for-louisville-basketball/74179994/", "ord_in_thread": 0, "title": "Mangok Mathiang's work pays off as role changes", "locations": ["Louisville"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mangok Mathiang", "Jeff Greer", "Rick Pitino"], "text": "Mangok Mathiang's work pays off as role changes Jeff Greer , @jeffgreer_cj 4:18 p.m. EDT October 18, 2015 Louisville coach Rick Pitino comments on the team's scrimmage. Louisville's Mangok Mathiang is excited after the ref called a foul against his defender. Oct. 17, 2015 (Photo: Scott Utterback/The C-J ) 1 CONNECT 6 TWEET LINKEDIN COMMENT EMAIL MORE \nNo one is more aware of his struggles last season than Mangok Mathiang. \nThe Louisville basketball team captain and redshirt junior knows he shot 38.8 percent from the field, and he knows that number, especially for a center, is simply too low for a post player logging serious minutes on a perennial NCAA tournament team. \nBut he also knows how hard he worked this offseason on his footwork and his free throws, and he is confident he won't repeat his dismal shooting performance from the 2014-15 campaign. His effort in Saturday's second Red-White intrasquad scrimmage (5 for 9, 15 points) showed his progress on the offensive end, and it prompted U of L coach Rick Pitino to say Mathiang is the team's best frontcourt player. \n\"Everybody goes through ups and downs in this game,\" the 6-foot-10 Mathiang said. \n\"I guess last year was my down. I couldn't just stay down. This year, I knew I had a team that was going to depend on me and was really going to need me to just be that leader and lead by example. I couldn't take no for an answer. I just had to go out there and work on my game and better myself.\" Louisville basketball | Adel, Lee best served together? \nMathiang's quest to improve began right after last season, when he and Pitino met for their exit interview. They talked at length about how Mathiang, the only player left from U of L's 2013 national title squad, had to do more than be a role player this coming season. He could no longer serve as the team's energy guy, a chatterbox who hustled, blocked shots and grabbed offensive rebounds. \nWith Montrezl Harrell, the team's second leading scorer, off to the NBA, Pitino wanted Mathiang to fill the void. Perhaps not entirely, because the power forwards of the future -- sophomores Jaylen Johnson and Anas Mahmoud and freshman Ray Spalding -- will contribute quite a bit this season. But someone had to become The Guy in Louisville's frontcourt. \nAnd even with sophomore Chinanu Onuaku's vast improvement from last season, Mathiang's maturity and experience made him the top candidate. \n\"(Pitino) told me, 'Just work a lot on your footwork. Work a lot on your free throws, and everything else is going to work itself out,'\" Mathiang said. \n\"And surprisingly, it has.\" 5 Red-White scrimmage thoughts: Adel, Lee shine \nMathiang's career-high at Louisville is 13 points against WKU in 2013. He's scored double-digit points four times in the two seasons he's played. \nSo this summer, when he shot 52.5 percent from the field in six games against the Puerto Rican national team and scored 19 points in one U of L win there, it was a foreign sight for Cards fans. But it was also a product of his summer work. The same can be said for his 13.5 points-per-game clip for Australia at the World University Games in July. \nAnd now, this season, Pitino wants Mathiang to continue that upward trend, to make that foreign sight a familiar one, to give Louisville some scoring punch in its frontcourt. \nHe wants Mathiang to come off the bench and be a spark and finish games for the Cards. \n\"You may say, 'Why aren't you starting him?' I want him to come off the bench because we are going to need him to finish the game,\" Pitino said. He's, by far, our best frontcourt player, and I don't want him getting into foul trouble. We will have a tough time winning if he's not on the court offensively and defensively at the end of the game.\" \nThat's a lot different than last season, when Mathiang struggled so much offensively that opposing teams treated Louisville like it was four-on-five. \n\"(Pitino) is going to need a leader on the court who has been in the system and played in the system for a while,\" Mathiang said. \"He's going to need me toward the end of games when it's the most important. Whatever he says, I just nod my head and say, 'Yes, sir,' and move on to the next one.\" \nReach U of L hoops writer Jeff Greer via email at jgreer@courier-journal.com . 1 CONNECT 6 TWEET LINKEDIN COMMENT EMAIL MORE Read or Share this story: http://cjky.it/1LDWNPn TOP VIDEOS", "external_links": [], "published": "2015-10-18T23:18:00.000+03:00", "crawled": "2015-10-19T00:10:07.042+03:00", "highlightTitle": ""}