{"organizations": [], "uuid": "6f2dd0ac5f718dfd520aee0dc75af664296f1526", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.courier-journal.com", "main_image": "http://www.gannett-cdn.com/-mm-/ae1a61f30900b74a8ff945b8b8637389e397a57a/c=0-105-2061-1269&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/14/USATODAY/USATODAY/635804487516048702-USATSI-8855563.jpg", "site_section": "http://www.courier-journal.com/sports/", "section_title": "Louisville Sports | The Courier-Journal", "url": "http://www.courier-journal.com/story/sports/nfl/2015/10/14/qb-rank-week-5-peyton-manning-denver-broncos/73955712/", "country": "US", "title": "QB Rank, Week 5: Peyton Manning and the Broncos are in trouble", "performance_score": 0, "site": "courier-journal.com", "participants_count": 1, "title_full": "QB Rank, Week 5: Peyton Manning and the Broncos are in trouble", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T04:42:00.000+03:00", "replies_count": 0, "uuid": "6f2dd0ac5f718dfd520aee0dc75af664296f1526"}, "author": "courier-journal.com", "url": "http://www.courier-journal.com/story/sports/nfl/2015/10/14/qb-rank-week-5-peyton-manning-denver-broncos/73955712/", "ord_in_thread": 0, "title": "QB Rank, Week 5: Peyton Manning and the Broncos are in trouble", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Peyton Manning’s days as a top-level NFL quarterback are over.\nThe numbers are bad – Manning ranks 30th in the league in passer rating and is one of five starters with more interceptions than touchdowns – but the tape is even worse.\nLet's be clear: This is not a Tom-Brady-after-Kansas-City situation, either. Brady still looked like the same guy that he had always been, even if the numbers did not back that during a rough stretch early last season. Manning looks nothing like the quarterback we’ve seen the last two seasons in Denver.\nSitting at 5-0, the Broncos appear to be in good shape to make the playoffs despite Manning’s struggles. Those Super Bowl aspirations aren’t looking realistic with the offense dragging down an impressive defensive unit.\nManning’s problems, and therefore the offense’s problems, start with his ever-waning arm strength, which has led to issues elsewhere in his game.\nWith Manning overcompensating for a lack of zip on his throws, we’re seeing less precision. He’s been accurate on only 69% of his throws this season, which ranks 26th among qualified quarterbacks per Pro Football Focus. That lack of accuracy makes it difficult to string long drives together.\nWe’re also seeing Manning have to make throws a beat or two earlier than he would in the past to get the ball to a receiver before a defender can break on the ball. Relying more on guesswork – of course, it’s educated guesswork for the studious Manning – creates more opportunities for turnovers.\nThe Broncos' non-existent running game hasn’t helped. The teams is currently 30th in the league in rushing and averages just 3.3 yards per carry.\nSo here’s Kubiak’s mission: Create a competitive offense with a quarterback who struggles to throw the ball downfield or sustain drives with short, accurate passes and do so without a reliable rushing attack.\nDespite the mess on that side of the ball, Denver remains unbeaten. The defense has been the driving force behind the 5-0 start, scoring three touchdowns of the team’s 11 touchdowns.\nIt’s unlikely the defense keep up its scoring ways, which will put even more pressure on Manning and Kubiak.\nThere are no clear answers to fix the offense. And if things don’t improve, starting with No. 18, it won’t be so crazy to consider a different option behind center.\nNow, on to this week’s rankings…\nLAST WEEK vs. DAL: 20/27, 275 yards, 2 touchdowns\nBrady is the clear front-runner for MVP five weeks into the season after (quite literally) picking apart the Cowboys defense. New England’s passing game is bordering on indefensible with Brady getting the ball out so fast. Play zone coverage, and he’ll find a window. Play man, and the Patriots’ rub routes will spring receivers wide open.\nLAST WEEK vs. STL: 19/30, 241 yards, 2 touchdowns, 2 interceptions\nRodgers was the first to blink in the great MVP race of 2015. He finally threw an interception at Lambeau after 587 attempts. The streak-ending interception was a bit unlucky, but his second pick of the day was just a bad decision. Jordy Nelson’s season-ending injury has quietly had an impact on the offense, which hasn’t been as explosive as it was a year ago.\nLAST WEEK vs. DET: 11/14, 161 yards, 3 touchdowns\nEverything is clicking in Arizona. The Cardinals are averaging a league-best 38 points per game with Palmer at the helm. He wasn’t asked to do much in Sunday’s blowout win over Detroit, but he produced 161 yards and three touchdowns on only 14 attempts. That’s efficiency.\nLAST WEEK vs. PIT: 35/48, 365 yards, 2 touchdowns, 1 interception\nHey, Russell Wilson and Andrew Luck, if you want to know how to produce behind bad offensive lines, study Rivers’ tape. Rivers would might not take off for a scramble, but his ability to navigate a pocket while keeping his eyes downfield is nothing short of amazing. The Steelers sacked Rivers only twice despite pressuring him on 46% of his dropbacks Monday night.\nLAST WEEK vs. WSH: 24/42, 254 yards, 0 touchdowns, 2 interceptions\nThe Falcons won in spite of Ryan in Week 5. He turned the ball over twice and was generally inaccurate. The turnovers were not poor decisions, per se, but rather bad throws. Don’t expect this trend to continue. Ryan will bounce back quickly.\nLAST WEEK vs. PHI: 26/43, 335 yards, 2 touchdowns, 1 interception\nThe Saints are a mess, and it’s not just the defense these days. But Brees is not the problem in New Orleans. His deep to medium accuracy – his biggest “weakness” in 2014 – has been on point in 2015 and that was very much the case Sunday in Philadelphia. With that said, he needs to do a better job protecting the football. His two fumbles hurt against the Eagles.\nLAST WEEK vs. SF: 41/54, 441 yards, 3 touchdowns, 1 interception\nEli caught some breaks against the 49ers, who dropped at least three would-be interceptions. But this is the best we’ve ever seen the younger Manning play, and he’s been the driving force behind the league’s eighth-ranked offense.\nLAST WEEK vs. CIN: 15/23, 213 yards, 1 touchdown, 1 interception\nWilson remains the best play-maker at the position but we haven’t seen a lot of progression from Year 3 to Year 4. Sure, you can blame the offensive line for Wilson’s pocket passing deficiencies to a certain degree. But he was given solid pass protection in Cincinnati and still struggled down the stretch against an adjusting Bengals defense. Even if Wilson never develops into a pure pocket passer, he’ll still be a top 10 quarterback thanks to his unmatched improvisational skills.\nLAST WEEK: BYE\nNewton and the Panthers were off in Week 5 and will get the Seahawks in Seattle on Sunday. He’s put together a good start against a favorable schedule, so it will be interesting to see if he can continue to elevate this offense against better competition.\nLAST WEEK vs. SEA: 30/44, 331 yards, 2 touchdowns, 1 interception\nDalton’s production has earned him a spot in the top 10, but he had some shaky moments in the game against in Seattle, including a bad red zone pick and an awful throw dropped by Richard Sherman. His now-healthy supporting cast might be the biggest factor in his improvement this year. Tyler Eifert and A.J. Green have been the best receiving combo in the league by far. You have to ask: Which QB ahead of him on this list would not be thriving in this situation?\n11. Andrew Luck, Colts\n12. Derek Carr, Raiders\n13. Jay Cutler, Bears\nWe continue to play the waiting game with Luck, but he looks on track to play Sunday against the team that has ended the Colts’ season the last two years. If you hadn’t heard, Indianapolis welcomes the Patriots to Lucas Oil Stadium in Week 6 … Carr wasn’t at his best against Denver, but not many QBs will be against that defense. And don’t blame him for the game-sealing pick-six. Carr made the right decision to throw hot against a blitz, but his receiver, Seth Roberts, wasn’t on the same page and never looked for the throw … So maybe Jay Cutler isn’t as bad as he looked in 2014, and his contract isn’t the albatross it was deemed to be in the offseason. Cutler has looked good in Adam Gase’s offense. He’s working the pocket more effectively and has made some impressive throws.\nThe Jaguars are off to another poor start, but there have been some flashes of offensive competence. That’s a big step for a team that averaged 15.6 points a game over the last two seasons. Blake Bortles has been a big part of that improvement, and is on pace to throw for over 4,000 yards after an impressive statistical performance against the Buccaneers. Bortles’ offseason work on his mechanics has paid off and it has helped him operate out of the pocket far better than he did during his rookie campaign. He’s been more patient and willing to go through his progressions.\nThese are encouraging steps in his development, but there’s still plenty of room for him to grow, as he remains a raw passer. Bortles still doesn’t see the field well. He missed several open receivers, opting to throw into coverage when there was a more favorable option readily available elsewhere on the field.\nWordpress\nMatthew Stafford is still the same quarterback he’s been the last few seasons, so maybe “trending down” isn’t the right description of his current state. But being benched for Dan Orlovsky in the third quarter was certainly the low point in his career. The interceptions were bad, but Stafford was also making the same mistakes that have plagued his career: Exhibiting lazy mechanics leading to inconsistent accuracy and sticking on his first read for too long while open receivers go unnoticed . But when you can throw the ball 50 yards downfield with a flick of the wrist, you’re going to get plenty of chances.\nJameis Winston took a more measured approach against the Jaguars than in the previous week, and, by no coincidence, he avoided turning the ball over for the second time in a game this season. One thing he has definitely improved on over the course of the season is disguising his intentions with his eyes more effectively. On this play he uses his eyes to hold the linebacker and keep the throwing lane open.\nMarcus Mariota, meanwhile, continues to do things he wasn’t supposed to be able to do, if you listened to pre-draft chatter. He’s been calm in the pocket and has repeatedly worked through his reads when his first target isn’t open . Mariota will still miss some reads and his deep accuracy hasn’t been good over the first month and a half, but those are small gripes for a rookie QB.\nBEST THROW OF THE WEEK\nNot only did Eli put this in a spot where only his receiver could catch it, but he also had the presence of mind to look hold the safeties with a pump fake before making the game-winning throw.\nWORST THROW OF THE WEEK\nThe Bengals intercepted Russell Wilson in the red zone despite having only 10 players on the field. Somehow, Wilson managed to throw into double coverage despite this numerical advantage. Making matters worse, there were plenty of open receivers elsewhere.\nPHOTOS: Week 6 games ranked by watchability\n14. Bears at Lions: The Bears are surging after a slow start, but the Lions are desperate to get their first win of the season. USA TODAY Sports Fullscreen 13. Texans at Jaguars: Blake Bortles can't feel comfortable going against J.J. Watt after being sacked six times by the Buccaneers last week. USA TODAY Sports Fullscreen 12. Dolphins at Titans: Dan Campbell makes his head-coaching debut in the Dolphins' first test after firing Joe Philbin. USA TODAY Sports Fullscreen 11. Chiefs at Vikings: Kansas City could be in trouble with Jamaal Charles sidelined for the year. USA TODAY Sports Fullscreen 10. Ravens at 49ers: Both of the Super Bowl XLVII participants have fallen on hard times this season. USA TODAY Sports Fullscreen 9. Broncos at Browns: Will Peyton Manning quiet the questions about his abilities despite the team's 5-0 start? USA TODAY Sports Fullscreen 8. Redskins at Jets: The Redskins face a tall task against the well-rested Jets and their stellar defense. USA TODAY Sports Fullscreen 7. Falcons at Saints: Atlanta looks strong headed into Thursday night's matchup, but anything can happen in the NFC East. USA TODAY Sports Fullscreen 6. Giants at Eagles: The Eagles can get back on track in the NFC East, but the Giants' offense is clicking. USA TODAY Sports Fullscreen 5. Chargers at Packers: San Diego will be hard-pressed to keep up with Aaron Rodgers and Green Bay. USA TODAY Sports Fullscreen 4. Cardinals at Steelers: Few have been able to keep up with the Cardinals, so the Steelers will have to control the clock with their offense. USA TODAY Sports Fullscreen 3. Bengals at Bills: Rex Ryan's crew looks to be the first to knock off the Bengals. USA TODAY Sports Fullscreen 2. Panthers at Seahawks: Seattle will really be feeling the heat if they fall to Carolina at home. USA TODAY Sports Fullscreen 1. Patriots at Colts: Even if it's a blowout, the Deflategate rematch is must-see TV. USA TODAY Sports Fullscreen Like this topic? You may also like these photo galleries: Replay Autoplay Show Thumbnails Show Captions Last Slide Next Slide", "external_links": ["http://www.gannett-cdn.com/-mm-/3d5569507733ca056af5edaf0a2a8036c559fb13/r=500x375/local/-/media/2015/10/14/USATODAY/USATODAY/635804412105616868-5chargersgreenbay.jpg", "https://usatq.files.wordpress.com/2015/10/6_brees.png", "http://www.gannett-cdn.com/-mm-/3d5569507733ca056af5edaf0a2a8036c559fb13/r=500x375/local/-/media/2015/10/14/USATODAY/USATODAY/635804412092200696-9broncosbrowns.jpg", "http://sportswire.usatoday.com/2014/10/01/tom-brady-new-england-patriots-offense-nfl-kansas-city-chiefs/", "http://www.gannett-cdn.com/-mm-/2a70de1b58d8e1d2d511921456485bc416161b53/c=1-0-999-750&r=x1443&c=1920x1440/local/-/media/2015/10/14/USATODAY/USATODAY/635804412123869102-13texansjags.jpg", "https://usatq.files.wordpress.com/2015/10/manninginaccurate.gif", "http://www.gannett-cdn.com/-mm-/b6cbd76952925eeade37662ccfe04ff655efb676/c=0-93-1000-658&r=x48&c=80x45/local/-/media/2015/10/14/USATODAY/USATODAY/635804412092200696-12dolphinstitans.jpg", "http://www.gannett-cdn.com/-mm-/3d5569507733ca056af5edaf0a2a8036c559fb13/r=500x375/local/-/media/2015/10/14/USATODAY/USATODAY/635804412131981206-1patscolts.jpg", "http://www.gannett-cdn.com/-mm-/f1bb7facfb1f970ad918c9806c69a592d9c985cc/c=1-0-999-750&r=x513&c=680x510/local/-/media/2015/10/14/USATODAY/USATODAY/635804412090328672-14bearslions.jpg", "http://www.gannett-cdn.com/-mm-/b6cbd76952925eeade37662ccfe04ff655efb676/c=0-93-1000-658&r=x48&c=80x45/local/-/media/2015/10/14/USATODAY/USATODAY/635804412103588842-7falconssaints.jpg", "https://usatq.files.wordpress.com/2015/10/rookiespot.png", "https://usatq.files.wordpress.com/2015/10/bortlespocket.gif", "https://usatq.files.wordpress.com/2015/10/bortlestrend.png", "http://www.gannett-cdn.com/media/2015/10/14/USATODAY/USATODAY/635804412105616868-5chargersgreenbay.jpg", "https://usatq.files.wordpress.com/2015/10/onthecusp41.png", "http://www.gannett-cdn.com/media/2015/10/14/USATODAY/USATODAY/635804412123869102-2panthersseahawks.jpg", "https://usatq.files.wordpress.com/2015/10/bortlespick.gif?w=628", "http://www.gannett-cdn.com/-mm-/3d5569507733ca056af5edaf0a2a8036c559fb13/r=500x375/local/-/media/2015/10/14/USATODAY/USATODAY/635804412113884974-4cardinalssteelers.jpg", "http://www.gannett-cdn.com/-mm-/b6cbd76952925eeade37662ccfe04ff655efb676/c=0-93-1000-658&r=x48&c=80x45/local/-/media/2015/10/14/USATODAY/USATODAY/635804412090952680-10ravensniners.jpg", "http://www.gannett-cdn.com/-mm-/3d5569507733ca056af5edaf0a2a8036c559fb13/r=500x375/local/-/media/2015/10/14/USATODAY/USATODAY/635804412092200696-12dolphinstitans.jpg", "https://usatq.files.wordpress.com/2015/10/wilsonpick.gif", "https://usatq.files.wordpress.com/2015/10/4-rivers.png", "http://www.gannett-cdn.com/media/2015/10/14/USATODAY/USATODAY/635804412113884974-4cardinalssteelers.jpg", "http://www.gannett-cdn.com/-mm-/3d5569507733ca056af5edaf0a2a8036c559fb13/r=500x375/local/-/media/2015/10/14/USATODAY/USATODAY/635804412090328672-14bearslions.jpg", "http://www.gannett-cdn.com/-mm-/f1bb7facfb1f970ad918c9806c69a592d9c985cc/c=1-0-999-750&r=x513&c=680x510/local/-/media/2015/10/14/USATODAY/USATODAY/635804412131981206-1patscolts.jpg", "https://usatq.files.wordpress.com/2015/10/8_wilson.png", "http://www.gannett-cdn.com/media/2015/10/14/USATODAY/USATODAY/635804412090328672-14bearslions.jpg", "http://www.gannett-cdn.com/media/2015/10/14/USATODAY/USATODAY/635804412131357198-3bengalsbills.jpg", "http://www.gannett-cdn.com/-mm-/b6cbd76952925eeade37662ccfe04ff655efb676/c=0-93-1000-658&r=x48&c=80x45/local/-/media/2015/10/14/USATODAY/USATODAY/635804412131357198-3bengalsbills.jpg", "http://www.gannett-cdn.com/-mm-/b6cbd76952925eeade37662ccfe04ff655efb676/c=0-93-1000-658&r=x48&c=80x45/local/-/media/2015/10/14/USATODAY/USATODAY/635804412123869102-13texansjags.jpg", "http://www.gannett-cdn.com/-mm-/f1bb7facfb1f970ad918c9806c69a592d9c985cc/c=1-0-999-750&r=x513&c=680x510/local/-/media/2015/10/14/USATODAY/USATODAY/635804412105460866-6giantseagles.jpg", "http://www.gannett-cdn.com/-mm-/2a70de1b58d8e1d2d511921456485bc416161b53/c=1-0-999-750&r=x1443&c=1920x1440/local/-/media/2015/10/14/USATODAY/USATODAY/635804412131357198-3bengalsbills.jpg", "http://www.gannett-cdn.com/-mm-/2a70de1b58d8e1d2d511921456485bc416161b53/c=1-0-999-750&r=x1443&c=1920x1440/local/-/media/2015/10/14/USATODAY/USATODAY/635804412105460866-6giantseagles.jpg", "https://usatq.files.wordpress.com/2015/10/mariotapocket.gif?w=628", "http://www.gannett-cdn.com/-mm-/b6cbd76952925eeade37662ccfe04ff655efb676/c=0-93-1000-658&r=x48&c=80x45/local/-/media/2015/10/14/USATODAY/USATODAY/635804412105616868-5chargersgreenbay.jpg", "http://www.gannett-cdn.com/-mm-/b6cbd76952925eeade37662ccfe04ff655efb676/c=0-93-1000-658&r=x48&c=80x45/local/-/media/2015/10/14/USATODAY/USATODAY/635804412105460866-6giantseagles.jpg", "http://www.gannett-cdn.com/-mm-/3d5569507733ca056af5edaf0a2a8036c559fb13/r=500x375/local/-/media/2015/10/14/USATODAY/USATODAY/635804412123869102-13texansjags.jpg", "http://www.gannett-cdn.com/media/2015/10/14/USATODAY/USATODAY/635804412102964834-8redskinsjets.jpg", "https://usatq.files.wordpress.com/2015/10/2_rodgers.png", "http://www.gannett-cdn.com/-mm-/f1bb7facfb1f970ad918c9806c69a592d9c985cc/c=1-0-999-750&r=x513&c=680x510/local/-/media/2015/10/14/USATODAY/USATODAY/635804412123869102-11chiefsvikings.jpg", "http://www.gannett-cdn.com/media/2015/10/14/USATODAY/USATODAY/635804412123869102-11chiefsvikings.jpg", "http://www.gannett-cdn.com/-mm-/2a70de1b58d8e1d2d511921456485bc416161b53/c=1-0-999-750&r=x1443&c=1920x1440/local/-/media/2015/10/14/USATODAY/USATODAY/635804412123869102-2panthersseahawks.jpg", "https://usatq.files.wordpress.com/2015/10/10_dalton.png", "http://www.gannett-cdn.com/-mm-/2a70de1b58d8e1d2d511921456485bc416161b53/c=1-0-999-750&r=x1443&c=1920x1440/local/-/media/2015/10/14/USATODAY/USATODAY/635804412131981206-1patscolts.jpg", "http://www.gannett-cdn.com/-mm-/f1bb7facfb1f970ad918c9806c69a592d9c985cc/c=1-0-999-750&r=x513&c=680x510/local/-/media/2015/10/14/USATODAY/USATODAY/635804412131357198-3bengalsbills.jpg", "http://www.gannett-cdn.com/media/", "http://www.gannett-cdn.com/-mm-/b6cbd76952925eeade37662ccfe04ff655efb676/c=0-93-1000-658&r=x48&c=80x45/local/-/media/2015/10/14/USATODAY/USATODAY/635804412102964834-8redskinsjets.jpg", "http://www.gannett-cdn.com/media/2015/10/14/USATODAY/USATODAY/635804412123869102-13texansjags.jpg", "http://www.gannett-cdn.com/-mm-/f1bb7facfb1f970ad918c9806c69a592d9c985cc/c=1-0-999-750&r=x513&c=680x510/local/-/media/2015/10/14/USATODAY/USATODAY/635804412105616868-5chargersgreenbay.jpg", "http://www.gannett-cdn.com/-mm-/f1bb7facfb1f970ad918c9806c69a592d9c985cc/c=1-0-999-750&r=x513&c=680x510/local/-/media/2015/10/14/USATODAY/USATODAY/635804412123869102-2panthersseahawks.jpg", "http://www.gannett-cdn.com/-mm-/1ed2b024ec36c099e912a9d2e43b66c0f6059b4a/c=0-0-999-564&r=x48&c=80x45/local/-/media/2015/10/14/USATODAY/USATODAY/635804412090328672-14bearslions.jpg", "https://usatq.files.wordpress.com/2015/10/9_newton.png", "http://www.gannett-cdn.com/-mm-/3d5569507733ca056af5edaf0a2a8036c559fb13/r=500x375/local/-/media/2015/10/14/USATODAY/USATODAY/635804412090952680-10ravensniners.jpg", "http://www.gannett-cdn.com/media/2015/10/14/USATODAY/USATODAY/635804412090952680-10ravensniners.jpg", "https://usatq.files.wordpress.com/2015/10/manningint.gif", "http://www.gannett-cdn.com/media/2015/10/14/USATODAY/USATODAY/635804412092200696-9broncosbrowns.jpg", "https://usatq.files.wordpress.com/2015/10/5_ryan.png", "https://usatq.files.wordpress.com/2015/10/winstoneyes.gif", "http://www.gannett-cdn.com/-mm-/2a70de1b58d8e1d2d511921456485bc416161b53/c=1-0-999-750&r=x1443&c=1920x1440/local/-/media/2015/10/14/USATODAY/USATODAY/635804412092200696-9broncosbrowns.jpg", "http://www.gannett-cdn.com/-mm-/b6cbd76952925eeade37662ccfe04ff655efb676/c=0-93-1000-658&r=x48&c=80x45/local/-/media/2015/10/14/USATODAY/USATODAY/635804412131981206-1patscolts.jpg", "http://www.gannett-cdn.com/-mm-/f1bb7facfb1f970ad918c9806c69a592d9c985cc/c=1-0-999-750&r=x513&c=680x510/local/-/media/2015/10/14/USATODAY/USATODAY/635804412123869102-13texansjags.jpg", "http://www.gannett-cdn.com/-mm-/3d5569507733ca056af5edaf0a2a8036c559fb13/r=500x375/local/-/media/2015/10/14/USATODAY/USATODAY/635804412105460866-6giantseagles.jpg", "https://usatq.files.wordpress.com/2015/10/staffordmiss.gif?w=628", "http://www.gannett-cdn.com/media/2015/10/14/USATODAY/USATODAY/635804412103588842-7falconssaints.jpg", "https://usatq.files.wordpress.com/2015/10/staffordflick.gif", "http://www.gannett-cdn.com/-mm-/2a70de1b58d8e1d2d511921456485bc416161b53/c=1-0-999-750&r=x1443&c=1920x1440/local/-/media/2015/10/14/USATODAY/USATODAY/635804412090952680-10ravensniners.jpg", "http://www.gannett-cdn.com/-mm-/2a70de1b58d8e1d2d511921456485bc416161b53/c=1-0-999-750&r=x1443&c=1920x1440/local/-/media/2015/10/14/USATODAY/USATODAY/635804412092200696-12dolphinstitans.jpg", "http://www.gannett-cdn.com/-mm-/2a70de1b58d8e1d2d511921456485bc416161b53/c=1-0-999-750&r=x1443&c=1920x1440/local/-/media/2015/10/14/USATODAY/USATODAY/635804412103588842-7falconssaints.jpg", "http://www.gannett-cdn.com/-mm-/2a70de1b58d8e1d2d511921456485bc416161b53/c=1-0-999-750&r=x1443&c=1920x1440/local/-/media/2015/10/14/USATODAY/USATODAY/635804412123869102-11chiefsvikings.jpg", "http://www.gannett-cdn.com/-mm-/f1bb7facfb1f970ad918c9806c69a592d9c985cc/c=1-0-999-750&r=x513&c=680x510/local/-/media/2015/10/14/USATODAY/USATODAY/635804412103588842-7falconssaints.jpg", "http://www.gannett-cdn.com/-mm-/2a70de1b58d8e1d2d511921456485bc416161b53/c=1-0-999-750&r=x1443&c=1920x1440/local/-/media/2015/10/14/USATODAY/USATODAY/635804412105616868-5chargersgreenbay.jpg", "https://usatq.files.wordpress.com/2015/10/3_palmer.png", "http://www.gannett-cdn.com/-mm-/2a70de1b58d8e1d2d511921456485bc416161b53/c=1-0-999-750&r=x1443&c=1920x1440/local/-/media/2015/10/14/USATODAY/USATODAY/635804412113884974-4cardinalssteelers.jpg", "http://www.gannett-cdn.com/-mm-/3d5569507733ca056af5edaf0a2a8036c559fb13/r=500x375/local/-/media/2015/10/14/USATODAY/USATODAY/635804412131357198-3bengalsbills.jpg", "http://s3.postimg.org/joc9gg4pf/1_brady.png", "https://usatq.files.wordpress.com/2015/10/staffordtrend.png", "http://www.gannett-cdn.com/-mm-/3d5569507733ca056af5edaf0a2a8036c559fb13/r=500x375/local/-/media/2015/10/14/USATODAY/USATODAY/635804412102964834-8redskinsjets.jpg", "http://www.gannett-cdn.com/-mm-/f1bb7facfb1f970ad918c9806c69a592d9c985cc/c=1-0-999-750&r=x513&c=680x510/local/-/media/2015/10/14/USATODAY/USATODAY/635804412092200696-12dolphinstitans.jpg", "http://www.gannett-cdn.com/-mm-/b6cbd76952925eeade37662ccfe04ff655efb676/c=0-93-1000-658&r=x48&c=80x45/local/-/media/2015/10/14/USATODAY/USATODAY/635804412092200696-9broncosbrowns.jpg", "http://www.gannett-cdn.com/media/2015/10/14/USATODAY/USATODAY/635804412105460866-6giantseagles.jpg", "https://usatq.files.wordpress.com/2015/10/daltonpick.gif?w=628", "http://www.gannett-cdn.com/-mm-/3d5569507733ca056af5edaf0a2a8036c559fb13/r=500x375/local/-/media/2015/10/14/USATODAY/USATODAY/635804412123869102-11chiefsvikings.jpg", "http://www.gannett-cdn.com/-mm-/2a70de1b58d8e1d2d511921456485bc416161b53/c=1-0-999-750&r=x1443&c=1920x1440/local/-/media/2015/10/14/USATODAY/USATODAY/635804412102964834-8redskinsjets.jpg", "http://www.gannett-cdn.com/-mm-/b6cbd76952925eeade37662ccfe04ff655efb676/c=0-93-1000-658&r=x48&c=80x45/local/-/media/2015/10/14/USATODAY/USATODAY/635804412113884974-4cardinalssteelers.jpg", "http://www.gannett-cdn.com/-mm-/2a70de1b58d8e1d2d511921456485bc416161b53/c=1-0-999-750&r=x1443&c=1920x1440/local/-/media/2015/10/14/USATODAY/USATODAY/635804412090328672-14bearslions.jpg", "http://www.usatoday.com/picture-gallery/sports/2015/10/14/nfl-week-6-games-ranked-by-watchability/73950948/", "http://www.gannett-cdn.com/-mm-/b6cbd76952925eeade37662ccfe04ff655efb676/c=0-93-1000-658&r=x48&c=80x45/local/-/media/2015/10/14/USATODAY/USATODAY/635804412123869102-2panthersseahawks.jpg", "http://www.gannett-cdn.com/-mm-/f1bb7facfb1f970ad918c9806c69a592d9c985cc/c=1-0-999-750&r=x513&c=680x510/local/-/media/2015/10/14/USATODAY/USATODAY/635804412102964834-8redskinsjets.jpg", "https://usatq.files.wordpress.com/2015/10/7e_manning.png", "http://www.gannett-cdn.com/-mm-/f1bb7facfb1f970ad918c9806c69a592d9c985cc/c=1-0-999-750&r=x513&c=680x510/local/-/media/2015/10/14/USATODAY/USATODAY/635804412113884974-4cardinalssteelers.jpg", "https://usatq.files.wordpress.com/2015/10/elitd.gif", "http://www.gannett-cdn.com/-mm-/3d5569507733ca056af5edaf0a2a8036c559fb13/r=500x375/local/-/media/2015/10/14/USATODAY/USATODAY/635804412103588842-7falconssaints.jpg", "http://www.gannett-cdn.com/-mm-/f1bb7facfb1f970ad918c9806c69a592d9c985cc/c=1-0-999-750&r=x513&c=680x510/local/-/media/2015/10/14/USATODAY/USATODAY/635804412090952680-10ravensniners.jpg", "http://www.gannett-cdn.com/media/2015/10/14/USATODAY/USATODAY/635804412092200696-12dolphinstitans.jpg", "http://www.gannett-cdn.com/media/2015/10/14/USATODAY/USATODAY/635804412131981206-1patscolts.jpg", "http://www.gannett-cdn.com/-mm-/3d5569507733ca056af5edaf0a2a8036c559fb13/r=500x375/local/-/media/2015/10/14/USATODAY/USATODAY/635804412123869102-2panthersseahawks.jpg", "http://www.gannett-cdn.com/-mm-/f1bb7facfb1f970ad918c9806c69a592d9c985cc/c=1-0-999-750&r=x513&c=680x510/local/-/media/2015/10/14/USATODAY/USATODAY/635804412092200696-9broncosbrowns.jpg", "http://www.gannett-cdn.com/-mm-/b6cbd76952925eeade37662ccfe04ff655efb676/c=0-93-1000-658&r=x48&c=80x45/local/-/media/2015/10/14/USATODAY/USATODAY/635804412123869102-11chiefsvikings.jpg"], "published": "2015-10-15T04:42:00.000+03:00", "crawled": "2015-10-15T12:27:16.914+03:00", "highlightTitle": ""}