{"organizations": ["Browns", "Browns Related Cleveland Browns", "Broncos", "Associated Press", "NFL", "AP", "Denver Broncos"], "uuid": "17d3512c3c04b634c981cdf8ba07201565c7b6c1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.journal-news.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/10/19/47/33/7f69da2feaed4d49ab8fc7652bc1f2c0-bec99c6c35e345c9a57a031628722ec9-2.jpg", "site_section": "http://www.journal-news.com/feeds/categories/sports/", "section_title": "News | Sports", "url": "http://www.journal-news.com/ap/ap/top-news/broncos-move-to-6-0-with-26-23-overtime-win-agains/nn5ch/", "country": "US", "title": "Broncos move to 6-0 with 26-23 overtime win against Browns", "performance_score": 0, "site": "journal-news.com", "participants_count": 0, "title_full": "Broncos move to 6-0 with 26-23 overtime win against Browns", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T10:22:00.000+03:00", "replies_count": 0, "uuid": "17d3512c3c04b634c981cdf8ba07201565c7b6c1"}, "author": "", "url": "http://www.journal-news.com/ap/ap/top-news/broncos-move-to-6-0-with-26-23-overtime-win-agains/nn5ch/", "ord_in_thread": 0, "title": "Broncos move to 6-0 with 26-23 overtime win against Browns", "locations": ["Cleveland", "CLEVELAND"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["C.J. Anderson", "Chris Kirksey", "TOM WITHERS"], "text": "Updated: 3:22 a.m. Monday, Oct. 19, 2015 | Posted: 3:22 a.m. Monday, Oct. 19, 2015 Broncos move to 6-0 with 26-23 overtime win against Browns Related Cleveland Browns linebacker Chris Kirksey (58) tackles Denver Broncos running back C.J. Anderson (22) during the second half of an NFL football game Sunday, Oct. 18, 2015, in Cleveland. (AP Photo/Aaron Josefczyk) By TOM WITHERS The Associated Press CLEVELAND — \nTheir aging quarterback has thrown 10 interceptions. Their offense is often hard to watch. They commit silly, undisciplined penalties. \nThe Denver Broncos have some flaws. \nTheir record is not one of them. \nOvercoming three picks by Peyton Manning, a few key drops by wide receiver Demaryius Thomas and turning to their top-ranked defense in crunch time, the Broncos remained unbeaten with a 26-23 win in overtime Sunday against the Cleveland Browns, who have lost 11 straight to Denver. \nWith the win, the Broncos moved to 6-0 for the seventh time in franchise history. The fast start could portend a big finish as Denver has advanced to the Super Bowl in five of the seasons it opened with six straight wins. \nNo, they're not dominating, and the Broncos are far from a finished product. But entering their bye week, they're one of the few NFL teams without a loss. \n\"We're not playing as well as we would like but we're playing well enough to win,\" Manning said. \nThe 39-year-old's struggles continued against the Browns (2-4), who had a chance to knock off the Broncos when linebacker Barkevious Mingo picked off Manning early in overtime. But Denver's top-ranked defense, which has had to compensate for the offense's deficiencies, came up with a tackle behind the line and two straight sacks to back Cleveland up. \nManning took it from there, completing 4 of 4 passes for 39 yards while guiding a drive that ended with Brandon McManus kicking a 34-yard field goal with 4:56 left in overtime to keep the Broncos unbeaten. \nManning completed 26 of 48 passes for 290 yards, getting 75 on a quick-strike, laser for a TD in the fourth quarter to Emmanuel Sanders that gave the Broncos a 23-20 lead. The momentum-swinging play came just seconds after Browns linebacker Karlos Dansby grabbed a pass bobbled by Denver running back Ronnie Hillman and returned it 35 yards for a score. \nIt's been that kind of season for Manning, whose small mistakes have been magnified. Nobody has to tell Manning he's not playing well, but it hasn't all been his fault either. \n\"I won't be going to Vegas for my bye weekend,\" said Manning, the only NFL quarterback who has been 6-0 six times. \"I'm not feeling lucky now.\" \nDespite Manning's issues, the Broncos won and coach Gary Kubiak made it clear he has confidence in the iconic QB. \n\"He made the plays that got us in position to win the game, and obviously, he has plays that he wants back,\" Kubiak said. \"That's a continuing process of me working with him and getting him as comfortable as I possibly can. I know he's very capable of getting rid of those mistakes and hanging onto the great plays that he's made until it's over. He's our leader and he'll keep battling.\" \nHere are five other takeaways from Denver's overtime win: \nMCCOWN'S MISTAKE: The Browns had a chance to win in regulation, but quarterback Josh McCown, who had played so magnificently last week in an overtime win at Baltimore, forced a pass that was intercepted with 44 seconds left. \nMcCown was moving Cleveland into position for a possible game-winning field goal when he tried to throw the ball away while being pressured. He was intercepted by safety David Bruton Jr. \n\"I just didn't get enough on the ball when I threw it, so it just makes me sick,\" McCown said. \nORANGE CRUSH: The Broncos had four more sacks, raising their league-leading total to 26. Denver's defense also scored its fourth touchdown as cornerback Agib Talib returned an interception 63 yards for a TD in the second quarter. \nJOHNNY ACTIVE: Browns QB Johnny Manziel served as McCown's backup despite being questioned by police last week following an argument with his girlfriend. Manziel told police he had a couple of drinks prior to the incident. He was not charged and his girlfriend, Colleen Crowley, did not press charges despite telling police Manziel had pushed her head against the car's window. \nCoach Mike Pettine declined to comment on Manziel's incident after the game. \nTOP TANDEM: Thomas (10 catches, 111 yards) and Sanders (4, 109) combined for 14 catches and 220 yards against a Browns secondary missing Pro Bowl cornerback Joe Haden (concussion) and S Tashaun Gipson (ankle). \nINJURIES: Broncos rookie LB Shane Ray hobbled toward the team bus on crutches and with a brace on his right knee. He's expected to undergo an MRI on Monday. Browns rookie RB Duke Johnson was checked for a head injury but returned. Following the game, Pettine said Johnson has a shoulder issue. \n___ \nAP NFL website: www.pro32.ap.org and www.twitter.com/AP_NFL Copyright The Associated Press", "external_links": [], "published": "2015-10-19T10:22:00.000+03:00", "crawled": "2015-10-19T10:47:09.089+03:00", "highlightTitle": ""}