{"organizations": ["MVC Mississippi Gazette", "Hawks"], "uuid": "41acc16abc15fdfd499ff1dc5f53a4f2f99811d5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thegazette.com", "main_image": "http://www.thegazette.com/storyimage/GA/20150930/ARTICLE/150939987/AR/0/AR-150939987.jpg", "site_section": "http://feeds.feedburner.com/~r/GazetteOnlineSports/~6/1", "section_title": "Eastern Iowa Sports News and Information from Gazette Online", "url": "http://www.thegazette.com/subject/sports/prairie-in-position-for-a-piece-of-the-pie-20150930", "country": "US", "title": "Prairie in position for a piece of the pie", "performance_score": 0, "site": "thegazette.com", "participants_count": 0, "title_full": "Prairie in position for a piece of the pie", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T18:21:00.000+03:00", "replies_count": 0, "uuid": "41acc16abc15fdfd499ff1dc5f53a4f2f99811d5"}, "author": "", "url": "http://www.thegazette.com/subject/sports/prairie-in-position-for-a-piece-of-the-pie-20150930", "ord_in_thread": 0, "title": "Prairie in position for a piece of the pie", "locations": ["Iowa City High", "Iowa"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kate Busswitz", "Jenna Wagemester", "Jeff Linder"], "text": "Prairie in position for a piece of the pie Prairie in position for a piece of the pie Volleyball notes: Sweep of City High forces 3-way tie in MVC Mississippi Gazette , Iowa Prep Sports , Prep Sports , Prep Volleyball , Preps Etc. By Jeff Linder , Sports , Sports Rotator , Photos Cedar Rapids Prairie’s Kate Busswitz (8) makes a block as teammate Jenna Wagemester (3) lends a hand earlier this season. The Hawks swept Iowa City High on Tuesday, climbing into a first-place tie in the MVC Mississippi Division. (Andy Abeyta/The Gazette) Iowa Football Data Center \nI've covered Iowa football at The Gazette since 1999 Thursday October 01, 2015 \nColumnist giving commentary and information about sports in Iowa. Tuesday September 29, 2015 \nYour source for Iowa sports and more. Wednesday September 30, 2015 \nCovering Iowa State and central Iowa for Eastern Iowa Wednesday September 30, 2015 \nKernels baseball, RoughRiders hockey and a lot of things in between. Tuesday September 29, 2015 \nI cover high school sports and Iowa women's basketball. Wednesday September 30, 2015 \nIt’s been a while. \nOne championship drought has come \nYour source for all things auto racing in Eastern Iowa. Wednesday September 23, 2015 \nSharing community and high school contributed stories Thursday October 01, 2015 September 30, 2015 | 11:21 am \nIt’s been a while. \nOne championship drought has come to an end in the Mississippi Valley Conference. Another might. \nCedar Rapids Kennedy wrapped up a piece of the MVC Valley Division volleyball title Tuesday night with a sweep of Cedar Rapids Jefferson. The Class 5A fifth-ranked Cougars (17-6 overall, 5-0 Valley) are co-champions for the first time since 2006 and will wear the crown solo if they do the expected and win at Dubuque Senior next Tuesday. \nMeanwhile, Cedar Rapids Prairie has put itself in its own championship position. \nThe third-rated Hawks (15-3, 3-1) forced a three-way tie atop the Mississippi Division on Tuesday by sweeping Iowa City High (8-10, 3-1) on the road, 25-23, 25-15, 25-23. \nIt was Prairie’s first win over City High since 2008. And if the Hawks stay atop the division, it will be their first title since 2008. \n“That was a big win for us,” said Prairie Coach Lynnette Stecklein. “To know that we’re that kind of a team, that we can compete, it was huge from a confidence standpoint.” \nPrairie was able to overcome four-point deficits in the first and third sets. \n“Both times we were able to make a move in the middle of the set, get it tied up, then win it at the end,” Stecklein said. \nKenzie Soeken and Kate Busswitz collected 10 kills apiece, and Busswitz (a UNI recruit) added six blocks. Kendra Gaskill posted 30 assists. \nPrairie will be a solid favorite in both of its final two divisional matches. The Hawks host Waterloo West next Tuesday, then travel to Waterloo East on Oct. 13. \nCity High still travels to both Waterloo schools; Dubuque Hempstead (15-7, 3-1) still has matches remaining with Cedar Rapids Xavier (away) and Cedar Rapids Washington (home). \nPOSTSEASON PAIRINGS: THURSDAY’S THE DAY \nIGHSAU assistant director Lisa Brinkmeyer has confirmed that the Union will release regional pairings Thursday afternoon. \nClass 5A regional finals will be hosted this year by the remaining top seed in each region. In the other four classes, regional finals will be on neutral courts. \nThe postseason series begins Oct. 20 in classes 1A and 2A, Oct. 26 in the larger three classes. Regional finals are Nov. 3 (3A, 4A and 5A) and Nov. 4 (1A and 2A). \nSPOILER ALERT: WESTSIDE’S LOADED \nThe Westside Invitational field has been released, and 17 of the 24 competing teams are ranked. \nCedar Rapids Jefferson will host the Westside on Oct. 10. \nHeadlining the field are West Des Moines Dowling (ranked No. 2 in Class 5A), West Delaware and Marion (Nos. 1 and 2 in 4A), West Liberty (No. 1 in 3A) and Dike-New Hartford (four-time defending state champion in 2A). \nl Comments: (319) 368-8857; jeff.linder@thegazette.com Your Next Articles", "external_links": [], "published": "2015-09-30T18:21:00.000+03:00", "crawled": "2015-10-01T18:44:07.441+03:00", "highlightTitle": ""}