{"organizations": [], "uuid": "dd91dc1d7af43d868e1bd5a64f1a251b577badb3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cp24.com", "main_image": "http://www.cp24.com/polopoly_fs/1.2615694.1445199359!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "site_section": "http://www.cp24.com/", "section_title": "CP24 - Toronto News | Breaking News Headlines | Weather, Traffic, Sports", "url": "http://www.cp24.com/news/federal-election-2015/on-eve-of-election-mulcair-continues-to-slam-trudeau-over-gagnier-scandal-1.2615690", "country": "CA", "title": "On eve of election, Mulcair continues to slam Trudeau over Gagnier scandal", "performance_score": 0, "site": "cp24.com", "participants_count": 1, "title_full": "On eve of election, Mulcair continues to slam Trudeau over Gagnier scandal | CP24.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T00:16:00.000+03:00", "replies_count": 0, "uuid": "dd91dc1d7af43d868e1bd5a64f1a251b577badb3"}, "author": "Codi Wilson, CP24.com", "url": "http://www.cp24.com/news/federal-election-2015/on-eve-of-election-mulcair-continues-to-slam-trudeau-over-gagnier-scandal-1.2615690", "ord_in_thread": 0, "title": "On eve of election, Mulcair continues to slam Trudeau over Gagnier scandal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "On the eve of the federal election, NDP Leader Tom Mulcair continued to take aim at Liberal Leader Justin Trudeau on the recent resignation of campaign co-chair Dan Gagnier.\nSpeaking to CP24 Sunday afternoon, Mulcair said that the Gagnier controversy shows Canadians that they are dealing with “the same old Liberals.”\n“It turned out Dan Gagnier was giving specific advice to TransCanada … from Justin Trudeau’s war room,” he said.\n“Canadians were wondering why Justin Trudeau didn’t have any targets for greenhouse gas emissions. Well I think we are starting to find out why.”\nAccording to Trudeau, immediate action was taken when an email surfaced that showed Gagnier instructing TransCanada Corp, the company involved in the proposed Energy East pipeline, on how to lobby a government to have a pipeline approved.\n“People who are worried about the environment want to have a government who is going to be there to impose targets for greenhouse gas emissions, to get tough so that we can play our role fighting climate change, Mulcair said.\n“That’s what we’ve been talking about.”\nOn Monday, Mulcair says Canadians will have an opportunity to break a “148-year-old habit.”\n“We’ve been told since confederation that we get to vote in the Liberals and when we get tired of their scandals, we get to go back to the Conservatives and when we get tired of their corruption, we go back,” he added.\nMulcair did not directly address a question about what the future will hold for the NDP leader if a minority government is formed, however he said the NDP recognizes the importance of cooperating with other federal parties.\n“We’ve talked straight up about the need to cooperate with other federalist parties. I’ve opened that door to Justin Trudeau any number of times, including last July,” Mulcair said.\n“He always takes it upon himself to slam it shut personally. I don’t get personal with him, but he does with me because he always says he would work with the NDP but not with me.”\nDespite recent polls that suggest the NDP has seen a significant dip in support, Mulcair says he is “confident” Canadians will vote NDP.\n“I’m going to work non-stop until the close of the polls tomorrow,” he said.\n“I have every intention of forming an NDP government. That’s my number one priority.”", "external_links": [], "published": "2015-10-19T00:16:00.000+03:00", "crawled": "2015-10-19T01:00:11.683+03:00", "highlightTitle": ""}