{"organizations": [], "uuid": "763dac86a4ef8e429fd72ae8633b2e6f494b9dba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "wtop.com", "main_image": "http://wtop.com/wp-content/uploads/2015/10/USC-After-Sarkisian-Football1.jpeg", "site_section": "http://wtop.com/section/sports/feed/", "section_title": "WTOP » Sections » Sports", "url": "http://wtop.com/ncaa-football/2015/10/with-helton-in-charge-usc-gets-to-work-on-notre-dame-plan/", "country": "US", "title": "With Helton in charge, USC gets to work on Notre Dame plan", "performance_score": 0, "site": "wtop.com", "participants_count": 1, "title_full": "With Helton in charge, USC gets to work on Notre Dame plan", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T02:34:00.000+03:00", "replies_count": 0, "uuid": "763dac86a4ef8e429fd72ae8633b2e6f494b9dba"}, "author": "wtopstaff", "url": "http://wtop.com/ncaa-football/2015/10/with-helton-in-charge-usc-gets-to-work-on-notre-dame-plan/", "ord_in_thread": 0, "title": "With Helton in charge, USC gets to work on Notre Dame plan", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "With Helton in charge, USC gets to work on Notre Dame plan By DAN GREENSPAN October 14, 2015 7:34 pm Southern California interim head coach Clay Helton conducts an NCAA college football practice in Los Angeles Tuesday, Oct. 13, 2015. The Trojans offensive coordinator, Helton is taking over for head coach Steve Sarkisian, who was fired Monday. (AP Photo/Richard Hartog) \nLOS ANGELES (AP) — Southern California does have a game to play. \nThe turmoil surrounding the firing of coach Steve Sarkisian has largely relegated the Trojans’ rivalry with Notre Dame to second billing this week, but Wednesday’s practice provided a strong indication that USC is eager and ready for the game Saturday night. \nA cameraman for a local television station wore a shirt featuring the Fighting Irish leprechaun mascot to practice Wednesday morning, drawing intense glares from USC receivers. He covered up the offending apparel at the request of school officials. \nEverything else suggested business as usual, and that’s exactly the way quarterback Cody Kessler likes it. He was a redshirt sophomore when Lane Kiffin was fired after five games in 2013, and USC responded by going 6-2 under interim coach Ed Orgeron and winning the Las Vegas Bowl with offensive coordinator Clay Helton in charge. \n“We’ve been through a lot of adversity, and that’s what we do best is move on,” Kessler said. “We have an opportunity to do something great this weekend. Notre Dame is a great football team and we’re excited to get out there. It’s going to be a crazy game out in South Bend and we’re excited. We can’t wait to get back out there and get ready to go play a game.” \nKessler said the 17-12 loss to Washington last Thursday was as big a catalyst for the team as Sarkisian’s termination. The Huskies sacked Kessler five times and forced him into one of the worst performances of his college career, passing for 156 yards with no touchdowns and two interceptions. \nNotre Dame has just 10 sacks through six games, though triple-option opponents Georgia Tech and Navy have limited the Irish’s opportunities to get after the quarterback. However, linebacker Jaylon Smith and defensive lineman Sheldon Day lead an aggressive defense under coordinator Brian VanGorder that will tax a USC offensive line without veteran center Max Tuerk. \nTuerk suffered a season-ending knee injury against Washington, but versatile sophomore Toa Lobendahn worked at center during spring practice and did so again during the bye week before playing the Huskies. Helton, who is taking over for Sarkisian as interim coach, believes Lobendahn is ready for the challenge because of that preparation. \n“You never want to have an injury, but thank goodness we put the investment in earlier in the season to prepare for this,” Helton said. \nUSC is also dealing with injuries to its receiving corps. Steven Mitchell Jr. (ankle) is doubtful, while Darreus Rogers (hamstring) and Isaac Whitney (shoulder) were limited. That could force sophomore cornerback Adoree Jackson to play more often on offense. \nJackson played a season-high 30 snaps at receiver against Washington and 94 total, but said fatigue was not an issue. \n“It was fun for me,” Jackson said. “I was excited being out there on the field, I wanted to make a play. I feel like I wanted to do more, anything possible to get a win.” Topics:", "external_links": [], "published": "2015-10-15T02:34:00.000+03:00", "crawled": "2015-10-15T03:16:18.239+03:00", "highlightTitle": ""}