{"organizations": ["Grading Utah", "Arizona State", "Arizona State Grading Utah"], "uuid": "c867a7f66ef2a1709761bd851483935d4e2d7ff7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ksl.com", "main_image": "http://img.ksl.com/slc/2573/257359/25735950.jpg", "site_section": "http://www.ksl.com/xml/635,840,901.rss", "section_title": "KSL / UofU / sports stories", "url": "http://www.ksl.com/?sid=36999426&nid=635&s_cid=rss-extlink", "country": "US", "title": "Grading Utah's comeback victory over Arizona State", "performance_score": 0, "site": "ksl.com", "participants_count": 0, "title_full": "Grading Utah's comeback victory over Arizona State", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T12:00:00.000+03:00", "replies_count": 0, "uuid": "c867a7f66ef2a1709761bd851483935d4e2d7ff7"}, "author": "", "url": "http://www.ksl.com/?sid=36999426&nid=635&s_cid=rss-extlink", "ord_in_thread": 0, "title": "Grading Utah's comeback victory over Arizona State", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Josh Furlong"], "text": "Grading Utah's comeback victory over Arizona State By Josh Furlong | Posted Oct 18th, 2015 @ 3:00am 0  \nSALT LAKE CITY — Utah remains undefeated on the season after taking down South division rival Arizona State Saturday, 34-18. \nThe following is a grading of the team's performance against the Sun Devils. Offense: B+ \nWith the pressure that Arizona State brings each down, the game plan was to beat the Sun Devils through the air. And Travis Wilson managed that game plan very well, particularly in the first half. Wilson threw for 220 yards in the first half and had only four incompletions on 18 throws. Wilson ended the night throwing 26-of-36 for 297 and two touchdowns. \nAlthough the offense had an above-average night in the passing game, there was too much stalling on offense and leaving points on the board. We're to the point in the season where we should see more consistency out of the offense that we do occasionally. Several drives ended with nothing to show for a decent effort, with four drives ending in a three-and-out situation. \nThe Sun Devils did a great job of stuffing Devontae Booker and keeping him from having an impact for much of the game. But Booker found a way at the end to get his yards and helped Utah pull away for a victory. Defense: A \nThere's not much more you can ask from a defense than what it did Saturday. The defense kept the Sun Devils out of the end zone all game and really made it difficult for Arizona State to gain any momentum. Collectively, the defense has five sacks on opposing quarterback Mike Bercovici, 11 tackles for loss, nine pass breakups, and one interception. \nGionni Paul led the team with 11 total tackles, but Tevin Carter's recovered fumble late in the game was key to giving Utah the momentum it needed to extend its lead for a victory. Special Teams: D- \nSpecial teams was anything but special on Saturday. The coverage unit struggled to contain Arizona State's Tim White and nearly allowed two touchdown returns. Add to that the bizarre trick play in the end zone by Britain Covey and it was clearly not the special teams' night. I still can't reason to myself why a team would run that play at that point in the game. \nThe one redeeming quality to this unit was the ever-consistent Tom Hackett, who punted the ball eight times for a total of 375 yards. Hackett averaged 46.9 yards per punt and had five of his punts downed inside the 20-yard line and two for over 50 yards. Coaching: B+ \nOverall, the game plan was spot on. Bothe the offense and defense were in a position to do some damage. Offensively, the constant attempts to establish a run game seemed pointless considering how little Arizona State was giving up. But ultimately it was the run game that extended the lead for Utah, so we'll call it a wash. \nBut the special teams trick-play call resonates in my mind as a bad, bad, bad decision. Had it been executed properly, we'd probably be talking about how it was a genius play, but it's nonetheless risky. Overall Team: B+ \nThe score does not reflect how well Utah dominated Saturday's game. The offense got things going and put up 34 points on a defense that blitzes every down. The defense stopped Arizona State in everything it tried to do. Save a better special teams effort, Utah would have nearly shut out the Sun Devils. \nThere's definitely areas for Utah to improve upon, but they're continually finding ways to win games, even if not all facets of the game are firing on all cylinders. Josh Furlong", "external_links": [], "published": "2015-10-18T12:00:00.000+03:00", "crawled": "2015-10-18T13:36:10.244+03:00", "highlightTitle": ""}