{"organizations": [], "uuid": "644fb7cecc71f72422414e9c0e238373c2d170e3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "http://www.youtube.com/watch?v=MR78jHMaMgA", "site_section": "http://bostonherald.com/sports/patriots_nfl", "section_title": "Sports: Patriots &amp; NFL | Boston Herald", "url": "http://bostonherald.com/sports/patriots_nfl/new_england_patriots/2015/10/tom_brady_patriots_aim_to_get_back_in_the_groove", "country": "US", "title": "Tom Brady, Patriots aim to get back in the groove", "performance_score": 0, "site": "bostonherald.com", "participants_count": 2, "title_full": "Tom Brady, Patriots aim to get back in the groove | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T03:00:00.000+03:00", "replies_count": 1, "uuid": "c60e2c3aaa44db375b5bca5251ec7c6266bb1a17"}, "author": "Karen Guregian", "url": "http://bostonherald.com/sports/patriots_nfl/new_england_patriots/2015/10/tom_brady_patriots_aim_to_get_back_in_the_groove#post-0", "ord_in_thread": 0, "title": "Tom Brady, Patriots aim to get back in the groove", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ARLINGTON, Texas — There was little to complain about in what Tom Brady and the Patriots offense showed during the first three weeks of the season.\nBrady was ripping it up, and carving up defenses with great precision en route to a 3-0 start. In that regard, having the bye week fall in Week 4 wasn’t optimal, particularly for the red-hot offense.\nWhen you’re executing that well, you never want to disrupt the rhythm and flow with a week off.\nThat said, the goal for Brady, and the Patriots offense in particular, today against the Cowboys is to pick up right where they left off. After being idle for two weeks, the Patriots quarterback would love nothing better than to crank it up, and quickly get back into that sizzling groove.\nThe Patriots want to recapture that mojo and continue to build momentum as they head into a stretch of games that features AFC rival Indianapolis and division foes New York and Miami. The offense surely wants to be at top efficiency when facing the Jets in Week 7, as Gang Green has one of the league’s best defenses, anchored once again by Darrelle Revis.\n“There’s no letdown for us. We’re trying to establish a certain level of play, and we got off to a decent start this year. So we’ve got to keep it going,” Brady said Wednesday in his session with the media. “You know, we’ve got to sustain good practices, good games, good weeks, and see if we can just keep building.”\nDuring Bill Belichick’s regime, the Patriots have been just as hard to beat following a bye as they are overall, having gone 11-4 after sitting a week. With a Dallas team that has been playing without injured stars Tony Romo and Dez Bryant, the task at hand doesn’t seem quite as daunting as it might have been, especially playing at Jerry Jones Palace, otherwise known as AT&T Stadium.\nThe 2-2 Cowboys are getting a couple players back on defense, with end Greg Hardy and linebacker Rolando McClain each returning after serving four-game suspensions to start the season.\n“This team could easily be 4-0,” Brady said. “They’re playing at home. They’ve got a lot of good players, (they’re a) very talented team. Last year they were one of the best teams in football. They could’ve beaten the Saints easily last week in overtime, so they’re a very good football team. I know it’s going to be a big test for our team.”\nHardy, the former Panther, has had some luck getting to Brady in the past, as he made blindside protector Nate Solder look like a turnstile in a 2013 game against Carolina.\nSolder has been doing his homework to try and get back up to speed on Hardy’s tactics.\n“It’s been awhile,” Solder said. “I’ve been doing some research just based on his preseason snaps, trying to refresh my memory on that stuff. He’s long, tall, an exceptional player, physical from what I remember. I remember it being a tough matchup.”\nTo this point, the Pats offensive line has gotten the job done in protecting Brady and keeping him out of harm’s way. Brady, in turn, has gotten rid of the ball extremely quickly, making his reads and delivering the football with exceptional speed.\nAccording to ESPN.com, Brady is averaging 1.95 seconds in the pocket, and 2.04 seconds before passing — the fastest rates in NFL this season.\nCowboys coach Jason Garrett marvelled at how well Brady has been playing at age 38, and what he has seen of him on film during the week.\n“He really is an amazing player. If you think about him playing at that level for the last 15 years, and maybe playing as well as he has ever played right now, it’s amazing,” Garrett told the Dallas media. “He doesn’t show any signs of getting older physically. He moves around as well as he has ever moved around; he throws as well as he has ever thrown it. His understanding of the game has always been really, really, really high and I think it’s probably the highest right now. He has a great command of what they want to do; he has a great command of what opposing defenses are trying to do to him. He makes adjustments within plays, within series, within games always putting their team in situations where they can be successful. I always hold him in the highest regard.”\nLast week, Saints quarterback Drew Brees (33-of-41 for 359 yards, two touchdowns) carved up Garrett’s secondary with an injured rotator cuff. One can only imagine what Brady might do.\nWhich brings us to Rob Gronkowski. Do the Cowboys have any shot of containing the hulking tight end? Like Brady and Julian Edelman (30 catches, 279 yards), Gronk has gotten off to a fast start with 16 catches for 308 yards. And he’s been a beast where it counts, hauling in four touchdown passes.\nSaid Garrett: “That’s going to be a challenge. Gronkowski is a really good football player, and we would never just put one guy on him. We have to try and slow their offense down a lot of different ways. He is a big part of their offense.”\nAll four of Gronkowski’s touchdowns have come in the red zone, where the Patriots offense has been especially hard to defend (76.47 percentage conversion rate). After a week away, Gronk said he is eager to get back on the horse.\n“We’ve had a little time off,” he said Thursday, “but it’s go time now.”\nFor the Pats, it’s time to get back in the groove.", "external_links": [], "published": "2015-10-11T03:00:00.000+03:00", "crawled": "2015-10-11T15:34:11.032+03:00", "highlightTitle": ""}