{"organizations": [], "uuid": "ee4ce77ba6fabe67ca5923cd2568b0f7147c5b58", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sacbee.com", "main_image": "http://pics.mcclatchyinteractive.com/news/nation-world/national/t0r7k2/picture41289765/ALTERNATES/LANDSCAPE_1140/Texas%20Storms", "site_section": "http://www.sacbee.com/?widgetName=rssfeed&widgetContentId=713546&getXmlFeed=true", "section_title": "Breaking News, Sports, Weather & More | Sacbee.com &", "url": "http://www.sacbee.com/latest-news/article41289777.html", "country": "US", "title": "Heavy rains that flooded Texas interstate headed south", "performance_score": 0, "site": "sacbee.com", "participants_count": 1, "title_full": "Heavy rains that flooded Texas interstate headed south", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T07:49:00.000+03:00", "replies_count": 0, "uuid": "ee4ce77ba6fabe67ca5923cd2568b0f7147c5b58"}, "author": "Diana Heidgerd and David Warren \nThe Associated Press", "url": "http://www.sacbee.com/latest-news/article41289777.html", "ord_in_thread": 0, "title": "Heavy rains that flooded Texas interstate headed south", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Heavy rains that flooded Texas interstate headed south \nHeavy daylong rains create traffic havoc \nNo injuries reported but drivers urged to stay off roads \nTorrential rains scramble high school football schedules A Dalls Fire Rescue responder makes his way over to a stalled vehicle to check on the driver still inside on Friday in Dallas. The vehicle stalled after the road quickly flooded during a heavy rain fall. Tony Gutierrez Associated Press A stop sign stands almost completely submerged after heavy rains on a roadway into White Rock Lake on Friday in Dallas. Residents braced for more rain this weekend from other storms that could spin off from massive Hurricane Patricia hitting southwest Mexico. Tony Gutierrez Associated Press A driver navigates their vehicle through high water on Northwest Highway during a heavy rainfall on Friday in Dallas. Tony Gutierrez Associated Press A driver attempts to navigate through high water on Northwest Highway during a heavy rainfall Friday in Dallas. The driver who was unharmed, abandoned the vehicle on the road when emergency responders arrived. Emergency management officials in Texas contending with multiple storm systems are preparing for heavy rains to continue through the weekend and widespread flooding that may follow. Tony Gutierrez Associated Press 1 of 4 \nBy Diana Heidgerd and David Warren \nThe Associated Press DALLAS \nHeavy rains that brought a flood threat to North and Central Texas will spread into South Texas on Sunday as a stalled cold front causing the downpours is reinforced by remnants of Hurricane Patricia. \nMuch of the Texas heartland was under a flash flood watch early Saturday as the National Weather Service expected the Austin-San Antonio area to receive up to a foot of rain while already inundated sections of North Texas were expected to experience up to 7 more inches of rain. \nFlash floods already have closed major highways in parts of North Texas. Floodwaters from more than 13 inches of rain closed Interstate 45 near Corsicana, backing up traffic for 12 miles, and closed parts of heavily traveled Interstate 35 near Waco. \nTexas was contending with multiple storm systems, prompting emergency officials to gear up for heavy rains through the weekend and widespread flooding that may follow. \nThe rains already have scrambled the schedule of high school and college football games, forcing postponement of some games and rescheduling of others for earlier in the day. \nBut for emergency officials, a primary concern is the widespread flooding expected over the weekend. Officials in Hidalgo County planned to hand out free sandbags to help residents prepare for the expected deluge. Heavy rains, gusty winds and tidal rises of up to 5 feet prompted a coastal flood advisory for the upper Texas Gulf Coast. \nThe potential for flooding comes five months after torrential spring storms caused more than 30 deaths and left large swaths of the state underwater. \nThe Memorial Day weekend brought an astonishing amount of rainfall, with some isolated areas receiving more than 20 inches. Homes were either damaged or swept away by river water southwest of Austin, about 1,500 homes in the Houston area alone sustained flood damage, and neighborhoods throughout the state were cut off by rising waters. \nLittle rain had fallen since then. \nMore than half of the state’s 254 counties had outdoor burn bans in effect Friday, due to previous dry conditions, the Texas A&M Forest Service reported. Related content", "external_links": [], "published": "2015-10-24T07:49:00.000+03:00", "crawled": "2015-10-24T08:41:02.444+03:00", "highlightTitle": ""}