{"organizations": [], "uuid": "6ec3ffc3a7ae2159cd120798f0c9abc0e405d1ac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.metrowestdailynews.com", "main_image": "http://www.metrowestdailynews.com/storyimage/WL/20151016/SPORTS/151016645/AR/0/AR-151016645.jpg", "site_section": "http://www.metrowestdailynews.com/sports?template=rss&mime=xml", "section_title": "Sports - MetroWest Daily News, Framingham, MA", "url": "http://www.metrowestdailynews.com/article/20151016/SPORTS/151016645/17208/NEWS?rssfeed=true", "country": "US", "title": "Smith gets nod at QB as Boston College visits mighty Clemson", "performance_score": 0, "site": "metrowestdailynews.com", "participants_count": 1, "title_full": "Smith gets nod at QB as Boston College visits mighty Clemson", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T03:13:00.000+03:00", "replies_count": 0, "uuid": "6ec3ffc3a7ae2159cd120798f0c9abc0e405d1ac"}, "author": "Eric Avidon/Daily News Staff", "url": "http://www.metrowestdailynews.com/article/20151016/SPORTS/151016645/17208/NEWS?rssfeed=true", "ord_in_thread": 0, "title": "Smith gets nod at QB as Boston College visits mighty Clemson", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Smith gets nod at QB as Boston College visits mighty Clemson The task that awaits Boston College is daunting, perhaps more so than any the Eagles will face all season. With freshman Jeff Smith named as the starting QB, BC will travel to play No. 5 Clemson in Death Valley on Saturday night (ESPNU, 7 p.m.). Comment By Eric Avidon/Daily News Staff MetroWest Daily News, Framingham, MA By Eric Avidon/Daily News Staff Posted Oct. 16, 2015 at 7:09 PM Updated at 7:09 PM By Eric Avidon/Daily News Staff Posted Oct. 16, 2015 at 7:09 PM CHESTNUT HILL – The task that awaits Boston College is daunting, perhaps more so than any the Eagles will face all season. With a freshman quarterback playing as a starter – not sharing time with another freshman – for the first time, an offense that wasn’t doing much even before the two freshmen were forced into duty, and a kicking game that’s in shambles, BC will travel to play Clemson, the No. 5 team in the nation, in Death Valley on Saturday night (ESPNU, 7 p.m.). As for that freshman quarterback, it’s true freshman Jeff Smith, who BC announced in a tweet Friday evening around 6:15 had beaten out Natick’s Troy Flutie, a redshirt freshman, for the starting job. The two had split snaps in the three games since sophomore starter Darius Wade was lost for the season with a broken ankle, but this week coach Steve Addazio said he’d decided to name one the new starter. That quarterback practiced as the starter all week, but until just over 24 hours before Saturday night’s game Addazio had chosen to keep his decision private. “There isn’t one of (the quarterbacks) who’s been there and done it,” Addazio said on Wednesday. “This is a fast team we’re playing. They’re physical, and they’re fast; they can run. You have to be able to move. This is going to be a fast game.” In spite of the offense’s inexperience and resulting struggles, BC, which is 3-3 overall and 0-3 in the ACC, could be 5-1 overall and 2-1 in league play with wins over Duke and Wake Forest because of the brilliant play of its defense, and had freshman kicker Colton Lichtenberg not missed field-goal attempts in both games. His 45-yard try against the Blue Devils was well wide of the uprights, and he failed to convert tries of 31 and 26 yards against the Demon Deacons. As a result, sophomore Mike Knoll – who missed an extra point in overtime of the Eagles’ Pinstripe Bowl loss to Penn State – will be the kicker against Clemson. As for the defense, it’s given a team with anemic offensive production opportunities to win when it had no business winning. The Eagles lead the nation in rushing defense, passing defense, and total defense, and rank second in scoring defense. They held Florida State to 14 points, and seven of those were set up by a turnover deep in BC territory. They limited 25th-ranked Duke to just a trio of first-half field goals. And they gave up a mere field goal – after the Eagles fumbled the ball away on their own 4-yard line – to Wake Forest. Page 2 of 2 - This week, however, the BC defense faces a new kind of challenge. It begins with the speed of the Clemson offense, a unit that averages 35.4 points. But BC did just fine against the similar speed of Florida State. The wrinkle is that this is the first time the Eagles will face a dual-threat quarterback. Deshaun Watson is completing 69 percent of his passes and has thrown for 11 touchdowns with five interceptions, and he’s also run for 202 yards and a score. “They’re very explosive,” said senior safety Justin Simmons. “They obviously have a very dynamic quarterback. I think he’s more pass-prone but can definitely get things done with his feet. ... It will be another good challenge this week.” No matter what the defense does, however, it’s the offense, now with Smith alone at the helm, which needs to improve if BC is to pull of an upset. The Eagles are averaging 20.7 points per game, but take away the 100 they scored in wins over Maine and Howard – a pair of FCS teams – and they’ve scored just 24 in four games against FBS foes. And 17 of those were against Northern Illinois. Even with what BC was able to do against Maine and Howard, it ranks a paltry 124th in passing offense and 119th in total offense. The Eagles are a respectable 25th in rushing offense, averaging 214 yards per game, but that drops when the 347 they gained in a 76-0 demolition of Howard are taken away – as the win against a second FCS opponent is taken away when measuring bowl eligibility. The offense simply has to be better against Clemson. Yet the Tigers boast the 13th-ranked total defense in the land. “We have great coaches here and a bunch of guys who work hard,” said senior defensive tackle Connor Wujciak, “and I think (the offense is) going to surprise some people as the season goes down the road.” Meanwhile, Addazio said, “We just have to hang in there and develop. The quarterback position, that’s the hard one. ... It affects everything. Everything is touched by it. It’s the epicenter.” The task facing BC on Saturday is daunting. The offense, now led by the true freshman Smith, will need to show things it hasn’t yet despite facing a strong defense. And the kicking game will need to be reliable in ways it hasn’t been. But you never know. Not when there’s a defense that may be the nation’s best. Eric Avidon can be reached at 508-626-3809 or eavidon@wickedlocal.com. Follow him on Twitter @ericavidon. By Eric Avidon/Daily News Staff MetroWest Daily News, Framingham, MA By Eric Avidon/Daily News Staff Posted Oct. 16, 2015 at 7:09 PM", "external_links": [], "published": "2015-10-17T03:13:00.000+03:00", "crawled": "2015-10-17T03:04:58.971+03:00", "highlightTitle": ""}