{"organizations": [], "uuid": "0303480708cc7d5a7311ee1a036ee27ba11dbed4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbssports.com", "main_image": "http://cbssports.com/images/blogs/Pitino-Knew-Accuser.jpg", "site_section": "http://www.cbssports.com/partners/feeds/rss/home_news", "section_title": "Sports News : CBSSports.com", "url": "http://www.cbssports.com/collegebasketball/eye-on-college-basketball/25328509/louisville-coach-rick-pitino-denies-accuser-claim-that-he-knew-about-escorts", "country": "US", "title": "Rick Pitino denies accuser's claim that he knew about escorts", "performance_score": 0, "site": "cbssports.com", "participants_count": 28, "title_full": "Rick Pitino denies accuser's claim that he knew about escorts - CBSSports.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T22:20:00.000+03:00", "replies_count": 29, "uuid": "20eb41f359b12179995d7760496ff2cf5d874590"}, "author": "Sam Vecenie", "url": "http://www.cbssports.com/collegebasketball/eye-on-college-basketball/25328509/louisville-coach-rick-pitino-denies-accuser-claim-that-he-knew-about-escorts#post-0", "ord_in_thread": 0, "title": "Rick Pitino denies accuser's claim that he knew about escorts", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "On Monday, Louisville coach Rick Pitino again denied that he had any knowledge that a former staffer allegedly paid for recruits and players to have sex with escorts.\n\"Not myself, not one player, not one trainer, not one assistant, not one person knew anything about any of this,\" the Hall of Fame coach told ESPN on Monday . \"If anyone did, it would have been stopped on a dime. Not one person knew anything about it.\"\nThis comes in the face of his accuser, Katina Powell -- the woman who has alleged that she and other escorts had sex with Louisville players and recruits for money, telling the Indianapolis Business Journal that she was told by Andre McGee that Rick Pitino knew of the arrangement. \nWhen asked if Pitino \"knew what was going on,\" Powell responded:\n\"Sure. How can it be going on for four years, that many people be involved and that many people see what's going on and Rick Pitino doesn't know anything about it? You have players that are very, very loyal to Pitino. And if they thought anything was wrong or anyone was going to get in trouble, I'm pretty sure they would have gone back to report to Pitino. When I would ask Andre, \"Does Pitino know about this?\" he would laugh and say, \"Rick knows about everything.\" Source: \"Katina Powell: 'This story is the truth' -- Indianapolis Business Journal \nFor his part, this is now the second time Pitino has denied knowledge of the situation prior to being made aware of it in August.\n\"When this first broke a month ago, I questioned everybody, if anybody has even a little knowledge or hearsay or seen anybody, and everybody, to the person, over 15 people, said they had no knowledge of anything, never seen anything,\" Pitino said. \n\"I don't believe in any form of cheating at all to get any advantage,\" Pitino continued. \"With a recruit, yelling at an official, or anything like that, I'm just totally against it. So it really, really has gotten to me.\"\nPowell's book Breaking Cardinal Rules: Basketball and the Escort Queen , went on sale Friday night (and is published by the same owner as the Indianapolis Business Journal. It's worth noting that in the book, Powell never suggests that Pitino knew about the operation, which was alleged to have occurred over the course of four years with upwards of $10,000 changing hands. Rick Pitino's life isn't going to get easier any time soon. (USATSI) Topics: Louisville Cardinals , NCAAB", "external_links": [], "published": "2015-10-05T22:20:00.000+03:00", "crawled": "2015-10-06T05:10:52.780+03:00", "highlightTitle": ""}