{"organizations": [], "uuid": "a6b2869becdb2214fffaa0d4b4087ec0e2e40003", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "examiner-enterprise.com", "main_image": "http://examiner-enterprise.com/sites/examiner-enterprise.com/files/BEE.gif", "site_section": "http://examiner-enterprise.com/taxonomy/term/3/feed", "section_title": "Sports", "url": "http://examiner-enterprise.com/sports/local-sports/cv-ironmen-gridders-set-collide-friday", "country": "US", "title": "CV, Ironmen gridders set to collide Friday", "performance_score": 0, "site": "examiner-enterprise.com", "participants_count": 0, "title_full": "CV, Ironmen gridders set to collide Friday", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T20:10:00.000+03:00", "replies_count": 0, "uuid": "a6b2869becdb2214fffaa0d4b4087ec0e2e40003"}, "author": "", "url": "http://examiner-enterprise.com/sports/local-sports/cv-ironmen-gridders-set-collide-friday", "ord_in_thread": 0, "title": "CV, Ironmen gridders set to collide Friday", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mike Tupa"], "text": "CV, Ironmen gridders set to collide Friday By Mike Tupa \nPerhaps Nowata High School’s football team couldn’t have suffered a worse time to go to war without rugged senior warrior Petey Knight. \nNext up, the Ironmen (5-2, 3-0) play host to the pass-first-ask-questions-later Caney Valley Trojans (1-5, 1-3). \nDuring the past three weeks, the Trojans are averaging more than 300 yards passing per game and they’ve scored 170 points (28.3 ppg). \n“From an offensive standpoint, they’ve definitely put up some pretty good numbers,” Nowata head coach Matt Hagebusch said. “Their quarterback (Hunter Hines) is a big, strong kid who gets its out of his hands quickly.” \nThat’s where Knight’s absence — as a one-man wrecking crew at noseguard — could hit the Ironmen the hardest. \n“They (the Trojans) threw it around, so we’re going to have to expect from a defensive standup up front to generate some pressure on the quarterback,” Hagebusch said. “The kind of dynamic player he (Knight) was probably makes it unfair to say any one guy has to step up and fill that void. We’re gong to have to get increased production from all those guys.” \nTim Callahan will get most the reps at noseguard, he added. \nBut, despite Caney Valley’s aerial threat, Nowata is still the definitive favorite in the District 2A-8 meeting. \nAfter dropping two straight early in the season — to a pair of opponents from larger classes — Nowata has surged to three straight wins by a combined score of 143-34. \n“Their offense is pretty deceptive,” said Caney Valley head coach Anthony Fogle. “The run a lot of counters and misdirections and try to pull defenders out of position. That’s the strength of their offense — the deceptiveness of it. In order to defend it we have to be position sound.” \nBut, the Trojans’ main hope for what would be a signature upset is in its passing assault. \n“We’re going to continue to do what we’ve been doing,” Fogle said. “We have five guys that usually catch the ball. We’ll continue to spread the ball and make them play defense all over the field.” \n“They’ve got two receivers who make circus-type catches,” said Hagebusch. “Defensively, we’ll have to be on our toes. … They throw it about 80 percent of the time.” \nIn addition to try to ratchet up the pressure on Caney Valley’s signal caller, Hagebusch also is counting on his defensive backs — including starting cornerbacks Cody Smith and Ethan Foster, and starting safeties Wyatt Sanders and Archie Agnew — to answer the challenge, as well as veteran linebackers Tarell Collins and T.J. Donaldson. \nThe weather — if it turns wet — could alter the dynamics drastically, Hagebusch added. \nNowata’s offense is led by its fiery triumvirate of Smith at quarterback, Collins as the primary runningback and Sanders lining up in the backfield or at receiver. \n“We’re going to have to get better at tackling,” Fogle said. “Our guys are reading their keys better, they’ve been in the right position. We’re going to have to improve on tackling.” \nDespite the underdog level, Fogle said his squad is focused on giving its best shot to win. \n“We have all the confidence we’ve can put a good game plan together and give them a contest Friday night,” he said. “Our boys are not conceding anything. They have confidence in what we’re doing. I believe they’ll be ready.” Rules for posting comments \nComments posted below are from readers. In no way do they represent the view of Stephens Media LLC or this newspaper. This is a public forum. \nComments may be monitored for inappropriate content but the newspaper is under no obligation to do so. Comment posters are solely responsible under the Communications Decency Act for comments posted on this Web site. Stephens Media LLC is not liable for messages from third parties. \nIP and email addresses of persons who post are not treated as confidential records and will be disclosed in response to valid legal process. \nDo not post: Potentially libelous statements or damaging innuendo. Obscene, explicit, or racist language. Copyrighted materials of any sort without the express permission of the copyright holder. Personal attacks, insults or threats. The use of another person's real name to disguise your identity.", "external_links": [], "published": "2015-10-22T20:10:00.000+03:00", "crawled": "2015-10-23T00:51:23.457+03:00", "highlightTitle": ""}