{"organizations": [], "uuid": "9084b85aa27eb495f052ab0f8073bc80056adcda", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sport.co.uk", "main_image": "http://images.sport.co.uk/150x150/2462a70e9cbda06e42dcf5ea2286507c.jpg", "site_section": "http://feeds.feedburner.com/SportcoukNewsRssFeed", "section_title": "General Sports News from Sports.co.uk", "url": "http://www.sport.co.uk/football/garry-monk-warns-outofsorts-swans-places-are-under-threat/6878538/", "country": "JE", "title": "Garry Monk warns out-of-sorts Swans places are under threat", "performance_score": 0, "site": "sport.co.uk", "participants_count": 0, "title_full": "Garry Monk warns out-of-sorts Swans places are under threat", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T18:31:00.000+03:00", "replies_count": 0, "uuid": "9084b85aa27eb495f052ab0f8073bc80056adcda"}, "author": "", "url": "http://www.sport.co.uk/football/garry-monk-warns-outofsorts-swans-places-are-under-threat/6878538/", "ord_in_thread": 0, "title": "Garry Monk warns out-of-sorts Swans places are under threat", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Garry Monk"], "text": "Garry Monk warns out-of-sorts Swans places are under threat 02 Oct 2015 15:31:52 \ncomments \nSwansea manager Garry Monk has warned places are at risk as his side seek to end a winless run of three Barclays Premier League games against Tottenham on Sunday. \nMonk has had a settled side in the opening two months of the campaign, with nine players having started every league game. \nBut Swansea's performances have dipped since the international break at the start of September, with a goalless home draw against Everton sandwiched in between defeats at Watford and Southampton. \nThere was also a shock Capital One Cup defeat at Championship club Hull in that period and Monk accepts Swansea must rediscover the consistency which took them to an eighth-placed finish last season and saw them start this campaign so well with eight points from four games. \n\"Of course - everyone's position will be under threat,\" Monk said at his press conference ahead of the Spurs game. \n\"That's why you have competition in the squad. \n\"I have got players who have not had the minutes they would have liked, and the players who have played know they need to perform. \n\"They have to fight every single day for the shirt.\" \nSwansea's limp performance in losing 3-1 at Southampton last weekend dropped them into the bottom half of the table for the first time since the end of 2013-14 campaign. \nYet only four weeks earlier Swansea were in the Champions League places after beating Manchester United 2-1 at the Liberty Stadium. \n\"Players don't go out wanting to play badly, and it wasn't a lack of commitment that was the problem at Southampton,\" Monk said. \n\"It's not that the players are not working or not running. \n\"But we have to make sure our focus is right. For us, it's about getting back to the consistent level we had last season. \n\"Even when we lost games last season, our performances were usually at a consistent level. \n\"That's what we have to get back to.\" \nGylfi Sigurdsson's late penalty at Southampton saw him become only Swansea's third scorer in the current league campaign. \nBafetimbi Gomis and Andre Ayew had contributed Swansea's seven previous goals between them, but Monk says it is the performance of the team and not the lack of goalscorers which is focusing his thoughts right now. \n\"We'd love to spread the goals out more - every team would - but the important thing is we improve as a team right now,\" Monk said. \n\"There's been two games where we haven't performed, last weekend at Southampton and Watford away, in a short space of time so we have to improve. \n\"The chances we've created have fallen to a number of players and it's a case of being clinical and having more composure in those moments. \n\"If we'd done that more players would have scored, but it's not about that for me. It's about being better as a team and improving to a higher level. \n\"You need to get to the 15-game mark before assessing where you are at, and what's achievable going forward from there, because that's when you see it settle down in this league.\" Related Sport News", "external_links": [], "published": "2015-10-02T18:31:00.000+03:00", "crawled": "2015-10-03T17:35:59.510+03:00", "highlightTitle": ""}