{"organizations": [], "uuid": "76712e83c70e2ba68d716a701d7e938bf68abb09", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "http://www.bostonherald.com/sites/default/files/media/2015/10/05/100515redsoxtf05.jpg", "site_section": "http://bostonherald.com/sports/red_sox_mlb", "section_title": "Sports: Red Sox &amp; MLB | Boston Herald", "url": "http://bostonherald.com/sports/red_sox_mlb/boston_red_sox/2015/10/silverman_how_i_was_wrong_about_the_red_sox", "country": "US", "title": "Silverman: How I was wrong about the Red Sox", "performance_score": 0, "site": "bostonherald.com", "participants_count": 1, "title_full": "Silverman: How I was wrong about the Red Sox | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "76712e83c70e2ba68d716a701d7e938bf68abb09"}, "author": "Michael Silverman", "url": "http://bostonherald.com/sports/red_sox_mlb/boston_red_sox/2015/10/silverman_how_i_was_wrong_about_the_red_sox", "ord_in_thread": 0, "title": "Silverman: How I was wrong about the Red Sox", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Even over half-season increments, it’s awfully hard to predict baseball.\nAfter a reasonable effort in my first-half predictions, at the All-Star break I went all swami and all in on the Red Sox’ second half.\nMy crystal-ball skills remain hit-and-miss.\nFROM JULY : Silverman's 2nd-half predictions for Sox\nI was high on the team in mid-July, a believer that a stretch of decent play was a glimpse of an improved team that was going to finish much stronger than it began — not a playoff team, but a respectable team.\nThey did become respectable but they were not as good as I thought. And, I did not have even a clue about the three big stories that came out of the blue: manager John Farrell had to step down because he developed lymphoma, Dave Dombrowski came in to replace Ben Cherington and the Don Orsillo saga overshadowed the final six weeks.\nTo the picks:\n• I picked the Red Sox to finish their final 73 games after the All-Star break with a 40-33 record that would lift them up and out of the AL East cellar and into third place with a final record of 82-80.\nWrong, wrong, wrong: They went 36-37 and they finished in the cellar, finishing at 78-84. I was four wins too optimistic about them.\n• “Rick Porcello is going to start to pitch like the No. 2 pitcher he is” was my first player prediction, with a projected second-half ERA of 3.00 to 3.40. I was a little off on this one. Porcello did pitch a lot better than his first half (5-9, 5.90 ERA) but his bounce-back second half was more like a No. 3 pitcher, not a No. 2. He went 4-6 with a 3.53 ERA.\nSurely the return of catcher Ryan Hanigan helped Porcello’s turnaround, as well as more time for him to get used to a new team and city but those second-half results were not good enough to change everyone’s mind about him. He is signed here for four more years. He will be only 27 years old next season. He is going to have better seasons than this one but as far as first impressions go, he failed to create a good one. And his second half was just a tad too shaky to make this prediction look good.\n• “Clay Buchholz’ injury will linger longer than expected and when he returns, he will be mediocre” was my second prediction.\nI obviously should have kept that sentence much shorter. Buchholz’ injury lingered the entire second half, so he never got a shot to pitch with any mediocrity.\nThat said, the judges have ruled this is a correct prediction, although frankly, it’s like suggesting everyone look to the east each morning for the sunrise when it comes to seeing hitches develop with any Buchholz’ injury. The guy pitches great, the guy gets hurt, the guy heals slowly — it’s who he is. The Red Sox’ rotation already had time to get used to Buchholz’ absence by the time the second half rolled around, so to have him remain completely out of the picture was nothing they needed to adapt to. Even with all the qualifications about Buchholz’ durability, he still likely will be the recipient of his $13 million option for next season. This is a great country and a great game.\n• “Mookie Betts will play his way into the AL MVP discussion” was next.\nI captured the spirit of this pick but not the rule. Betts’ second half was even better than his first but he never caused Josh Donaldson or Mike Trout to look over their shoulders in the Most Valuable Player vote. That said, he and Xander Bogaerts easily outdistanced their teammates in total contributions over the second half. Betts, in particular, continued to improve his defense in center field before finally moving to right for some promising-looking starts there. At the plate, Betts upped his numbers in a big way. He played in only 59 games in the second half compared to the first half’s 82, but he was a much better hitter. He hit eight home runs in the second half, 10 in the first, and managed 20 doubles compared to 22 in the first half. He raised his batting average 34 points to .311 and saw significant increases in his on-base percentage (.359, second half) and slugging percentage (.500) for a second-half OPS of .859 that loomed over his .792 first-half mark.\n• Then, there was “Hanley Ramirez is going to start to see time at first base after Mike Napoli is designated for assignment and traded.”\nI’m chalking this up as a win. Ramirez did start to see time at first base (in batting practice) and Napoli did get traded, although the designated for assignment part of that transaction never occurred and I can’t believe I included it. Cherington traded Napoli but it was Dombrowski who did not want to wait until next spring to see if Ramirez had any shot at playing first base. The jury’s out on that possibility, but the point here is that big changes happened to Ramirez and Napoli in the second half.\n• Lastly: “On the trade front, the Red Sox will tweak here and there but make no blockbusters or deal for superstars.”\nThis happened. Yes, Shane Victorino got traded to the Angels; yes, Jean Machi got picked up off waivers and yes, Ryan Cook came here from Oakland. And yes, none of these constituted big deals. The Red Sox stuck with their guys (in uniform) through the final 73 games and look where it got them: last place and a 78-84 final record.\nSomebody should have seen all of this coming.", "external_links": [], "published": "2015-10-06T03:00:00.000+03:00", "crawled": "2015-10-06T21:25:33.300+03:00", "highlightTitle": ""}