{"organizations": [], "uuid": "21eae4202eafe6471386f130c3a8066760d04bae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "http://www.bostonherald.com/sites/default/files/media/2015/10/03/100315governorspw003.jpg", "site_section": "http://bostonherald.com/sports/high_school", "section_title": "Sports: High School | Boston Herald", "url": "http://bostonherald.com/sports/high_school/2015/10/team_effort_does_it_for_governor_s", "country": "US", "title": "Team effort does it for Governor’s", "performance_score": 0, "site": "bostonherald.com", "participants_count": 1, "title_full": "Team effort does it for Governor’s | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T03:00:00.000+03:00", "replies_count": 0, "uuid": "21eae4202eafe6471386f130c3a8066760d04bae"}, "author": "Bob Albright", "url": "http://bostonherald.com/sports/high_school/2015/10/team_effort_does_it_for_governor_s", "ord_in_thread": 0, "title": "Team effort does it for Governor’s", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BYFIELD — Star Lawrence Academy tailback A.J. Dillon is used to putting his team on his back, and yesterday was no different. The only problem was a good portion of the Governor’s Academy defense went along for the ride as well.\nFeaturing a swarming, gang-tackling defense, the hosts slowed down one of the state’s top backs and capitalized on two big second-half turnovers to prevail, 14-7, over the Spartans in an early season Independent School League showdown.\n“Not a lot of people tackle him one-on-one, so we had to make the tackle and then hold on for help,” Governor’s coach Jim O’Leary said in regards to Lawrence’s 6-foot, 230-pound battering ram. “Today the help was there.”\nComing off a 320-yard, five-touchdown effort against Cheshire Academy, Dillon was held to 144 yards and never found the end zone in blustery Byfield. Trailing 14-0 at the half and facing a stiff wind, the slashing back brought his team all the way to the Governor’s 5, but a fumble recovery by Ben Murtagh ended the drive.\nLawrence (1-1) got on the board when Jake Cassidy rolled to his left on fourth down and found Joe Luchetti from 4 yards out with 5:33 to go. After a quick stop on downs, the visitors had the ball near midfield with the wind at their back and more than three minutes to play. The Governor’s defense rose to the challenge, dropping Dillon for a 7-yard loss on first down, then picking him off to seal it.\n“It’s a huge win,” said a grinning Pat Flaherty after his interception. “Lawrence is the No. 1 ranked team in the ISL and we were picked by everyone to lose.”\nThe points for Governor’s (2-0) all came in the second quarter. Ryan Day’s 5-yard run opened the scoring, and Cameron Macri made an acrobatic leap to thrust the ball inside the pylon off a 28-yard screen pass from Seth Harrell.\nThe win was Governor’s fifth straight against Lawrence. Last year, the Spartans rallied from the loss to run the table and win the Hugh Caldera Bowl.\n“We’ve been down this road before,” Lawrence coach Paul Zukauskas said. “We’ve got a good football team and we still believe that, but give Governor’s a lot of credit.”", "external_links": [], "published": "2015-10-04T03:00:00.000+03:00", "crawled": "2015-10-04T12:58:57.935+03:00", "highlightTitle": ""}