{"organizations": ["NIAA"], "uuid": "4476589ed11be97fd0743de2541b32e83e160f95", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.rgj.com", "main_image": "http://www.gannett-cdn.com/-mm-/179551c1cc158bb284216702069ab28724839a6d/c=0-126-630-482&amp;r=x633&amp;c=1200x630/local/-/media/2015/09/30/RenoGroup/RGJ/635792497564137178-NIAA-tile.jpg", "site_section": "http://rssfeeds.rgj.com/reno/sports", "section_title": "RGJ - Sports", "url": "http://www.rgj.com/story/sports/college/nevada/2015/10/01/coach-polian-leave-profanity-home/73148638/", "country": "US", "title": "NIAA meeting: Wooster to remain in I-A in football", "performance_score": 0, "site": "rgj.com", "participants_count": 0, "title_full": "NIAA meeting: Wooster to remain in I-A in football", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T05:53:00.000+03:00", "replies_count": 0, "uuid": "4476589ed11be97fd0743de2541b32e83e160f95"}, "author": "", "url": "http://www.rgj.com/story/sports/college/nevada/2015/10/01/coach-polian-leave-profanity-home/73148638/", "ord_in_thread": 0, "title": "NIAA meeting: Wooster to remain in I-A in football", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Wooster", "Jim Krajewski"], "text": "NIAA meeting: Wooster to remain in I-A in football Jim Krajewski , jkrajewski@rgj.com 7:53 p.m. PDT September 30, 2015 NIAA logo CONNECT 6 TWEET LINKEDIN 1 COMMENT EMAIL MORE \nIt was not an easy decision, but Wooster football will remain in Division I-A. \nAfter more than an hour of discussion at the NIAA Board of Control meeting on Wednesday, the members voted, 5-3, to allow the Colts to remain in Division I-A for the next four years. Wooster will remain in Division I in all other sports. \nThat prospect raised concerns among many of those in attendance. They fear that several schools, especially in Las Vegas, will want the same deal. \nOthers thought Wooster should move to I-A in all sports. \nWooster principal Leah Keusher spoke to keep Wooster in I-A in football only and addressed the many concerns of the board. She said with Wooster being the only International Baccalaureate school in the area, many students go there from all over Northern Nevada. \nPlaying sports against their former classmates allows them to stay connected. \n“I want to continue to get them to come to Wooster, but not take them away, making them totally solitary by pulling them away,” she said. “It would be a big blow to our school.” \nWooster played as an independent for two years, before moving to I-A four seasons ago. It is the only school in the state that plays football in a different level than the rest of the sports. \nNIAA executive director Bart Thompson said competitive balance is a major issue nationwide as the board debated the vote. He said some states align every sport individually, meaning schools don’t play in certain classes, sports do. \nAlso Wednesday, the first of the two-day meeting, the board voted to return to the previous nomenclature of calling each division classes. The current Division I will be called Class 4A, as it used to be, Division I-A will be 3A, Division III will be 2A and Division IV will be 1A. That change will take effect in the fall of 2016. \nThe switch to calling them Divisions was never changed in the NIAA rule book. The Division nomenclature was made to reflect college athletics, which used to have Division I and Division I-A. \nOther items addressed Wednesday included Rite of Passage moving to Division IV. ROP, which used to have mostly boys and competed in Division III in athletics, now has many more girls than boys and about 80 students total. \nOther schools asked to change divisions including Sage Ridge and Sierra Lutheran, which both requested to remain in Division IV. Both are scheduled to move to Division III, but speakers said they are far below enrollment thresholds and expect to remain at Division IV levels, less than 170 students. \nThe board will decide the two schools' fates Thursday. \nThe Meadows, in Southern Nevada, requested to be kept in Division II. The school is supposed to join Division I-A. That vote was also tabled until Thursday. \nIncline asked that its soccer teams, boys and girls, be allowed to play in Division I-A, instead of their current Division III, saying there is not a state championship in Div. III because of a lack of schools playing the sport. \nBut the board denied that motion. \nLater, assistant director Donnie Nelson brought forth a complete soccer realignment, similar to how European leagues move up or demote teams based on their records. \nHe said Nevada would have two leagues, a big school league with 14 teams, and a smaller school league with 15. Schools would then be able to change leagues. \nBut the board decided to have school superintendents discus the matter at their next meeting before voting on it. \nAnd White Pine asked to play in the Southern Division III, instead of the North. That was approved by the board \nAlso Wednesday, the Thompson recommended having student-athletes register online, instead of with paper as is currently done. One reason is that it would make it easier to track students who change schools. \nThompson also recommended hiring a political consultant/lobbyist to represent the NIAA at the legislature and between state legislative sessions. \nBoth his recommendations will be discussed and/or voted on in January after the budget is approved. \nThe board will need to write a job description for the lobbyist position. \nThe board meets about every three months. CONNECT 6 TWEET LINKEDIN 1 COMMENT EMAIL MORE Read or Share this story: http://on.rgj.com/1KNe6M4 TOP VIDEOS", "external_links": [], "published": "2015-10-01T05:53:00.000+03:00", "crawled": "2015-10-01T21:42:11.262+03:00", "highlightTitle": ""}