{"organizations": [], "uuid": "6ceafddcda73991628ad8f9211a073895fe4d580", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.fayobserver.com", "main_image": "http://www.fayobserver.com/content/tncms/live/global/resources/images/_site/fo_logo_200x200.jpg", "site_section": "http://www.fayobserver.com/search/?q=&t=article&l=25&d=&d1=&d2=&s=start_time&sd=desc&c[]=sports/college_sports*&f=rss", "section_title": "Fayetteville Observer - sports/college sports", "url": "http://www.fayobserver.com/sports/college_sports/appalachian-state-ready-for-battle-with-sun-belt-foe-georgia/article_9b486dcb-4f36-5d5f-a35c-6601980fe907.html", "country": "US", "title": "Appalachian State ready for battle with Sun Belt foe Georgia Southern", "performance_score": 0, "site": "fayobserver.com", "participants_count": 1, "title_full": "Appalachian State ready for battle with Sun Belt foe Georgia Southern", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T01:49:00.000+03:00", "replies_count": 0, "uuid": "6ceafddcda73991628ad8f9211a073895fe4d580"}, "author": "Sammy Batten - Staff writer", "url": "http://www.fayobserver.com/sports/college_sports/appalachian-state-ready-for-battle-with-sun-belt-foe-georgia/article_9b486dcb-4f36-5d5f-a35c-6601980fe907.html", "ord_in_thread": 0, "title": "Appalachian State ready for battle with Sun Belt foe Georgia Southern", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Appalachian State ready for battle with Sun Belt foe Georgia Southern By Sammy Batten - Staff writer \nThe Appalachian State Mountaineers had only an hour-and-a-half to celebrate last Saturday's 59-14 triumph over Louisiana-Monroe. \nThat was about the amount of time it took the Mountaineers to shower, ride to the aiport and board the flight taking them home from Monroe, Louisiana. \nOnce seated, Appalachian State immediately turned its attention to the next foe, Georgia Southern. \n\"As soon as we got on the plane coming home the coaches brought out cards with their (Georgia Southern) plays drawn on them and we started reviewing,'' Appalachian State's All-Sun Belt Conference safety Doug Middleton said. \nThe urgency to start preparing for the Eagles had a lot to with the five-day turnaround for both teams due to a Thursday night kickoff scheduled for 7:30 p.m. at Appalachian State's Kid Brewer Stadium. \nBut the significance of the game was even more of a factor. Georgia Southern (5-1, 3-0) is the defending regular-season champion and preseason favorite to claim the 2015 Sun Belt title. And if that wasn't enough, the Eagles were one of only two Sun Belt teams to beat the Mountaineers last season. \n\"This is only Game 7 and there's a lot of football left to be played this season,'' Appalachian State coach Scott Satterfield said. \"But we're both undefeated this year and playing for a chance to stay ahead in the Sun Belt race. We also have a chance to get to that six-win plateau (for bowl eligibility) and that's something we both want to do. So this is a special game.'' \nMiddleton admits the Mountaineers have revenge on their mind, too, after last year's 34-14 loss in Statesboro, Georgia. \nDue to traffic problems, Appalachian State arrived at Paulson Stadium 45 minutes late. Middleton said the Mountaineers felt rushed and ever really got untracked for the game. \n\"I just remember feeling like we were prepared as we wanted to be,'' he said. \"We rushed through everything, and once the game started everything seemed confused. Then, they popped off a big run on a fourth-down play and we just couldn't catch up.'' \nThe run was a 56-yarder by Matt Breida, who would finish with 135 yards on 12 carries in the game. Quarterback Kevin Ellison led the way with 151 yards rushing in Eagles triple-option offense. \nEllison and Breida, who already has 900 yards rushing this season, are back for another run at the Mountaineers. \n\"You watch film and you see guys popping out at quarterback and running back who are just explosive,'' Middleton said. \"But we have a lot of playmakers on our side of the field, too.'' \nIndeed they do. \nMiddleton is one of three preseason All-Sun Belt Conference picks on that unit along with linebacker John Law and defensive lineman Ronald Blair. Their talent and experience has helped the Mountaineers lead the Sun Belt in virtually every team defensive statistic. \nAppalachian State is first in scoring defense, allowing just 11.8 points, first in total defense (281.2) and first in rushing defense (109.0). \nThe latter will be especially significant today against a Georgia Southern team averaging 399 yards rushing. \n\"We have just gotten better and better (on defense) since the middle of last year,'' Appalachian State coach Scott Satterfield said. \"We have a lot of guys who started for us last year and they have all improved. \n\"But this week is really going to be a great test for us going up against the No. 1 rushing team in the country.'' \nMiddleton believes the Mountaineers are prepared to meet the challenge this time around. \n\"We see this as the conference championship right there on our home field,'' Middleton said. \"This is everything we've worked for. We're better prepared mentally and physically than we were last year. We'll be ready.'' \nStaff writer Sammy Batten can be reached at battens@fayobserver.com or 486-3534.", "external_links": [], "published": "2015-10-22T01:49:00.000+03:00", "crawled": "2015-10-22T02:38:22.333+03:00", "highlightTitle": ""}