{"organizations": [], "uuid": "b4c282f7a67dc40b51f73482972ea98e7d3a83b7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/Category/6/55/Sports/World.aspx", "section_title": "World - Sports - Ahram Online ", "url": "http://english.ahram.org.eg/NewsContent/6/55/152168/Sports/World/Underfire-Chelsea-boss-Mourinho-charged-by-FA.aspx", "country": "EG", "title": "Under-fire Chelsea boss Mourinho charged by FA", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "Under-fire Chelsea boss Mourinho charged by FA - World - Sports - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "b4c282f7a67dc40b51f73482972ea98e7d3a83b7"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/6/55/152168/Sports/World/Underfire-Chelsea-boss-Mourinho-charged-by-FA.aspx", "ord_in_thread": 0, "title": "Under-fire Chelsea boss Mourinho charged by FA", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related Chelsea give under-performing coach Mourinho vote of confidence Mourinho the best man for Chelsea, says captain Terry PHOTO GALLERY: Manchester City win, Chelsea lose in England, Barcelona slump in Spain Chelsea boss Mourinho raises prospect of being fired after 4th loss in 8 Senegal's Mane shines as Southampton stun Chelsea in EPL Jose Mourinho's season went from bad to worse on Monday when the under-fire Chelsea manager was charged by the FA for comments he made about match officials after the 3-1 home defeat by Southampton.\n\"It is alleged his remarks constitute improper conduct in that they allege and/or imply bias on the part of a match official or match officials and/or bring the game into disrepute,\" the FA said in a statement.\n\"He has until 6pm on Thursday to respond to the charge.\"\nMourinho told Sky Sports after Saturday's Premier League game that referees were afraid to give Chelsea penalties.\n\"With the score at 1-1 (there was) a huge penalty and once more we don't get it,\" he said. \"If the FA wants to punish me they can punish me, they do not punish other managers, they punish me.\n\"My players deserve it, the Chelsea fans deserve it, I am a Chelsea fan too, I want to say it again, referees are afraid to give decisions for Chelsea.\"\nEarlier on Monday, the Premier League champions issued a brief statement backing Mourinho despite the team's torrid start to the season.\n\"The club wants to make it clear that Jose continues to have our full support,\" the club said.\n\"As Jose has said himself, results have not been good enough and the team's performances must improve. However, we believe that we have the right manager to turn this season around and that he has the squad with which to do it.\"\nMourinho has faced widespread criticism this season for his public spat with former club doctor Eva Carneiro and for Chelsea's poor displays.\n\"I define this as the worst period in my career,\" he said on Friday. \"It's a fantastic experience, even though I don't want to repeat it again.\"\n ", "external_links": ["https://twitter.com/AO_Sports", "https://www.facebook.com/AhramOnlineSports?fref=ts"], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-05T21:21:37.350+03:00", "highlightTitle": ""}