{"organizations": [], "uuid": "9ce349264c7503531854247b8139ba05050530ce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "", "site_section": "http://mf.feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "http://uk.reuters.com/article/2015/10/19/uk-soccer-asia-champions-idUKKCN0SD27X20151019?feedType=RSS&feedName=sportsNews", "country": "US", "title": "Gulf rivals battle to reach Asian Champions League final", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "Gulf rivals battle to reach Asian Champions League final", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T22:03:00.000+03:00", "replies_count": 0, "uuid": "9ce349264c7503531854247b8139ba05050530ce"}, "author": "", "url": "http://uk.reuters.com/article/2015/10/19/uk-soccer-asia-champions-idUKKCN0SD27X20151019?feedType=RSS&feedName=sportsNews", "ord_in_thread": 0, "title": "Gulf rivals battle to reach Asian Champions League final", "locations": ["DUBAI"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Matt Smith"], "text": "DUBAI | By Matt Smith \nDUBAI Gulf bragging rights are at stake as Dubai's Al Ahli and Saudi Arabia's Al Hilal play the second leg of their Asian Champions League (ACL) semi-final on Tuesday. \nThe likes of World Cup winning captains Fabio Cannavaro and Diego Maradona have been lured to play or coach in the wealthy region in recent years, but sustained continental success has proved elusive with only one Gulf club -- Qatar's Al Sadd --crowned Asian champions in the past decade. \nHoping to put that right are hosts Al Ahli, who will be slight favourites after netting a potentially crucial away goal in drawing the first leg 1-1, and Al Hilal, Asia's second-ranked team and 2014 ACL runners-up. \nAl Ahli coach Cosmin Olăroiu led Al Hilal to the Saudi title in 2008 and also took charge of the kingdom's national team at this year's Asia Cup, but he played down any advantage this experience might provide. \n\"In football everyone has the tendency to believe football is a science, or mathematical,\" the Romanian told a news conference. \"Football is a show, it is made by artists and in any moment they improvise, they can do things that are not expected. \n\"My knowledge of them helps, but it will not be the deciding factor. Whoever has more psychological power, more strength, they will succeed.\" \nFor Al Ahli, much will depend on playmaker Everton Ribeiro. The two-time Brazilian player of the year has dazzled since his surprise move to the United Arab Emirates for a reported fee of 15 million euros last winter. \nThe 26-year-old scored in the final three ACL group games to help Al Ahli scrape into the knock-out phases and has five goals and a clutch of assists in 21 domestic games. \nRibeiro will be ably supported by his compatriot, the striker Rodrigo Lima, 32, who netted home and away against Iran's Naft Tehran in the quarter-finals and bagged the opener in the semi-final first-leg. \n\"We know about Al Ahli, they have good players, not only these two,\" Al Hilal's Greek coach Giorgos Donis said. \n\"They work as a team, but tomorrow it is more important for us to improve some things from the last game.\" \nAl Hilal will also look to two Brazilians for inspiration. Ailton, a journeyman striker recruited from Europe's minor leagues, and muscular midfielder Carlos Eduardo, 25, have scored nine goals in six ACL and Saudi league matches between them since signing in the summer. \nBut the Riyadh outfit will be without key defender Digão, who is suspended, plus goalkeeper Khalid Sharhili who was dropped after skipping training. \n\"If someone continues with amateur behaviour there's no place for him in our club,\" added Donis. \nIn the other semi-final, Japan's Gamba Osaka will attempt to overturn a 2-1 first-leg deficit at home to China's Guangzhou Evergrande on Wednesday. \n(Reporting by Matt Smith; editing by Martyn Herman ) \nOur top photos from the past 24 hours. Slideshow Trending On Reuters", "external_links": [], "published": "2015-10-19T22:03:00.000+03:00", "crawled": "2015-10-19T22:27:42.887+03:00", "highlightTitle": ""}