{"organizations": [], "uuid": "4d3e1a53da790a8ddd74a979111e1c26042de6e6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.newstribune.com", "main_image": "http://jeffcity.media.clients.ellingtoncms.com/static/newstribune/images/news-tribune90x90.jpg", "site_section": "http://newstribune.com//rss/headlines/sports/", "section_title": "newstribune.com stories: Mid-Missouri and National Sports", "url": "http://www.newstribune.com/news/2015/oct/12/nfl-capsules-bengals-remain-undefeated/", "country": "US", "title": "NFL Capsules: Bengals remain undefeated", "performance_score": 0, "site": "newstribune.com", "participants_count": 1, "title_full": "NFL Capsules: Bengals remain undefeated", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T09:29:00.000+03:00", "replies_count": 0, "uuid": "4d3e1a53da790a8ddd74a979111e1c26042de6e6"}, "author": "The Associated Press", "url": "http://www.newstribune.com/news/2015/oct/12/nfl-capsules-bengals-remain-undefeated/", "ord_in_thread": 0, "title": "NFL Capsules: Bengals remain undefeated", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Share \nCINCINNATI — Andy Dalton led the Bengals from a 17-point fourth-quarter deficit to a 27-24 overtime victory Sunday against the Seattle Seahawks, keeping Cincinnati undefeated with the second-biggest comeback in its history. \nTrailing 24-7 as the fourth quarter started, Dalton threw for a touchdown, ran for another and led the Bengals on a 69-yard drive without a timeout. Mike Nugent tied it with a 31-yard field goal on the final play of regulation. \nNugent was good again from 42 yards with 3:36 left in overtime, the ball deflecting off the left upright before going through. It matched the second-biggest comeback in Cincinnati’s history when trailing in the fourth quarter. \nThe Bengals are 5-0 for the first time since 1988, the last time they went to the Super Bowl. \nSeattle (2-3) punted twice in overtime, giving the Bengals a chance to pull it out. \nFalcons 25, Redskins 19 \nATLANTA — Robert Alford returned an interception 59 yards for a touchdown in overtime, keeping the Falcons unbeaten. \nThe Redskins had the first possession of OT, and Kirk Cousins moved the team to midfield. When wide receiver Ryan Grant slipped on a pass route, Alford caught Cousins’ pass and was left with open field down the Falcons’ sideline for the touchdown. \nDevonta Freeman’s apparent 13-yard TD catch in the final minute of regulation was ruled incomplete on a review. Freeman scored on 6-yard run two plays later to give Atlanta a 19-16 lead. Dustin Hopkins’ 52-yard field goal on the final play of regulation forced overtime. \nThe Falcons (5-0) overcame two interceptions and a lost fumble by Matt Ryan. Freeman had 27 carries for 153 yards and the touchdown. \nThe Redskins (2-3) were denied their attempt for their first back-to-back wins in almost a year — since Weeks 7 and 8 in 2014. \nBrowns 33, Ravens 30 \nBALTIMORE — Travis Coons kicked a 32-yard field goal in overtime and Josh McCown threw for a team-record 457 yards. \nCleveland (2-3) had lost 13 of the previous 14 meetings between these AFC North foes, but in this one the Browns rallied from a 12-point deficit to leave the Ravens (1-4) alone in the division cellar. \nPlaying its second straight overtime game, Baltimore went three-and-out on the first possession of the extra session. McCown then used more than seven minutes to move the Browns 51 yards before Coons kicked his fourth field goal with 6:43 left in OT. \nMcCown completed 36-of-51 passes with two touchdowns in becoming the first quarterback in Browns history with three straight 300-yard games. He broke the team record of 444 yards passing set by Brian Sipe on Oct. 25, 1981, against the Baltimore Colts. \nJoe Flacco ran for two 1-yard touchdowns and threw for a score, but fell to 13-2 against Cleveland. \nPatriots 30, Cowboys 6 \nARLINGTON, Texas — Tom Brady threw for two touchdowns, with a 1-yard plunge for another score, and the Patriots pulled away from a powerless Dallas offense missing Tony Romo and Dez Bryant. \nBrady guided two long touchdown drives in the second half after getting sacked five times before halftime, including once each by Greg Hardy and Rolando McClain in their returns from four-game suspensions. \nThe 38-year-old Brady joined Peyton Manning and Fran Tarkenton as the only NFL quarterbacks to get off to 4-0 starts at least four times. The Super Bowl champions won their seventh straight game, including the playoffs last season. \nThe Cowboys (2-3) lost their third straight without Romo and his top receiver, and backup Brandon Weeden lost his 11th in a row as a starter. \nBroncos 16, Raiders 10 \nOAKLAND, Calif. — Chris Harris Jr. returned a fourth-quarter interception 74 yards for a touchdown and the Broncos overcame a shaky day from Peyton Manning. \nManning was intercepted twice by 1998 draft classmate Charles Woodson and failed to lead the Broncos (5-0) to an offensive touchdown for the second time in five games this season. But Denver’s defense made sure it didn’t matter, getting a third defensive touchdown of 2015. \nDerek Carr threw for 249 yards and one touchdown for the Raiders (2-3), but was done in by the interception midway through the fourth quarter with Oakland in position for a possible go-ahead field goal. \nThe Raiders added a late 50-yard field goal by Sebastian Janikowski following a 48-yard pass interference penalty on Bradley Roby, but Denver recovered the onside kick. \nManning finished 22-for-35 for 266 yards, was sacked twice and had two interceptions. Denver ran for only 43 yards. \nThis was Denver’s second-lowest scoring regular season with Manning as quarterback, ahead of only a seven-point effort last year against St. Louis. \nThe Broncos have now won eight straight in this series but the Raiders had plenty of chances in this one. Janikowski missed a pair of field goals before Carr’s late gaffe ended Oakland’s hopes. \nCardinals 42, Lions 17 \nDETROIT — Carson Palmer threw for three touchdowns, while Matthew Stafford was benched after throwing a third interception. \nThe Cardinals (4-1) have a two-game lead in the NFC West. The Lions (0-5) have the dubious distinction of being the NFL’s only winless team and are off to their worst start since becoming the league’s only 0-16 team in 2008. \nPalmer was poised and efficient, completing 11-of-14 passes for 161 yards, with a 14-yard pass to Darren Fells, an 18-yard connection to John Brown, and a 2-yard strike to Larry Fitzgerald for scores. \nStafford simply struggled, getting picked off on passes well short of receivers and missing at least one wide-open option. He was replaced in the third quarter by Dan Orlovsky. Orlovsky played on the 0-16 Lions. \nEagles 39. Saints 17 \nPHILADELPHIA — Sam Bradford overcame two red-zone interceptions and threw for 333 yards and two touchdowns, Fletcher Cox forced two fumbles on sacks. \nRyan Mathews and DeMarco Murray each rushed for touchdowns to help the Eagles (2-3) break out of their offensive slump. They snapped a three-game losing streak at home that dated to last season. \nDrew Brees had three turnovers leading to 17 points for Philadelphia, and the Saints fell to 1-4 a week after an overtime win against Dallas. \nBradford and the rest of the offense struggled through the first quarter of the season. It looked like more of the same after he threw two INTs in the end zone, but he bounced back from the rough start. Philadelphia rushed for 186 yards. \nBills 14, Titans 13 \nNASHVILLE, Tenn. — Tyrod Taylor threw a touchdown pass, ran for another and even caught a pass in rallying the Bills. \nWith their top two running backs and top wide receiver injured, Taylor ran for 77 yards as the Bills (3-2) snapped a five-game skid against Tennessee. \nTaylor ran for a 22-yard TD late in the third quarter after a 26-yard run that was Buffalo’s biggest play of the game. Taylor also scrambled for 24 more on third-and-23 from the Bills 7, jumpstarting an 80-yard drive he capped with a 2-yard TD pass to Chris Hogan. Taylor caught a 4-yard pass from Hogan to set up that TD. \nStephon Gilmore intercepted Marcus Mariota’s pass with 1:32 left to seal the win. \nThe Titans (1-3) blew a second straight double-digit lead at home. \nBuccaneers 38, Jaguars 31 \nTAMPA, Fla. — Doug Martin ran for 123 yards and scored three touchdowns, helping Jameis Winston rebound from his worst pro performance. \nThe Bucs (2-3) snapped an 11-game home losing streak that dated to December 2013, the same month the Jaguars (1-4) began an equally agonizing road skid that now stands at 12. \nWinston threw for 209 yards and one touchdown without an interception, redeeming himself after turning the ball over five times in a 14-point loss to Carolina last week. \nBlake Bortles passed for 303 yards and four TDs, but also threw an interception that set up a Bucs touchdown. \nGiants 30, 49ers 27 \nEAST RUTHERFORD, N.J. — Larry Donnell’s spectacular catch over two 49ers with 21 seconds remaining lifted New York to a win Sunday night. \nManning had a career-best 41 completions and his perfect throw to Donnell finished off an 82-yard drive with a 12-yard touchdown. It made him the winningest quarterback in team history with 102. \nNew York (3-2) has won three straight and leads the NFC East. San Francisco (1-4) has lost four in a row. ﻿", "external_links": [], "published": "2015-10-12T09:29:00.000+03:00", "crawled": "2015-10-12T15:31:14.258+03:00", "highlightTitle": ""}