{"organizations": [], "uuid": "ebea9d016dc11b7cdf5274107345dee8190e9510", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/", "section_title": "Ahram Online - News, Business, Culture, Sports &amp; Multimedia from Egypt ", "url": "http://english.ahram.org.eg/NewsContent/1/64/161030/Egypt/Politics-/BDS-Egypt-calls-for-protest-stand-in-Cairo-to-supp.aspx", "country": "EG", "title": "BDS Egypt calls for protest stand in Cairo to support Palestinian 'intifada' - Politics - Egypt", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "BDS Egypt calls for protest stand in Cairo to support Palestinian 'intifada' - Politics - Egypt - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "ebea9d016dc11b7cdf5274107345dee8190e9510"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/1/64/161030/Egypt/Politics-/BDS-Egypt-calls-for-protest-stand-in-Cairo-to-supp.aspx", "ord_in_thread": 0, "title": "BDS Egypt calls for protest stand in Cairo to support Palestinian 'intifada' - Politics - Egypt", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related Israeli fire kills six Palestinians in clashes on Gaza border Hamas Gaza chief calls unrest a new 'intifada' PHOTO GALLERY: Israeli police clashes with Palestinians in Gaza The Egypt division of the Boycott, Divestment and Sanctions movement will hold a stand outside the Journalists Syndicate in Cairo on Sunday to protest violations made by Israeli occupation forces in recent days.\nThe Egypt branch of the movement, which lobbies for divestment from Israel, was established in April 2015 with the support of several political parties and figures, according to a statement the branch published on Thursday.\nThe campaigners will also hold a press conference on Sunday under the name \"Palestine Our Compass\" in order to support the “struggle and resistance” of the Palestinian people in all possible and effective methods.\n\"Despite Arab weakness and division everywhere, the Palestinian people surprise us, as they always have, with a third intifada that challenges oppression, fragility, and dependency. This comes portrayed as we saw with children, women, and youth fighting with bare hands, stones, and knives not only to defend Al-Aqsa and Palestine, but also to defend a nation that lost its compass,\" BDS added.\nPalestinians have been protesting for weeks against Israel's attempts to build more settlements in east Jerusalem and force out Arab residents of the city.\nPalestinians have also been protesting repeated Israeli and illegal Jewish settler attacks on Al-Aqsa mosque and closing the Muslim holy site on a number of occasions to worshippers.\nThirty-two Palestinians and seven Israelis have been killed during two weeks of bloodshed, Reuters has reported. The Palestinian dead include 10 \"knife-wielding assailants,\" according to Israeli police, as well as children and protesters shot during \"violent\" demonstrations.\nThe crisis started in late July when an 18-month old toddler Ali Dawabsha was burned to death and three other Palestinians were severely injured after their house in the occupied West Bank was set on fire by Israeli settlers.\nThe settlers smashed the windows of two homes in the village of Duma near Nablus and threw Molotov cocktails inside the buildings. Dawabsha died after sustaining serious burns.\nThe parents of the toddler, Riham and Saad, and their other son Ahmad lost their lives after suffering serious injuries as a result of the attack.\nThe five main aims of BDS Egypt as written in the launch statement in April were: bringing Palestine back as a central issue, reviving the popular boycott of Israel and resisting any form of normalisation, revealing Zionist interest networks in Egypt, pressuring Egyptian and international companies to withdraw investment from the Zionist entity, and legally pursue Israeli leaders that have been involved in crimes against the Arab people.", "external_links": [], "published": "2015-10-16T03:00:00.000+03:00", "crawled": "2015-10-16T20:58:45.161+03:00", "highlightTitle": ""}