{"organizations": [], "uuid": "b4aff63e7f7e21ea7dccd85f9094acc939f5744d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.signalscv.com", "main_image": "http://media.morristechnology.com/webmedia/upload/santa_clarita/article/2015/09/30/COCinsider-10.01.15_8201.jpg", "site_section": "http://www.signalscv.com/syndication/feeds/atom/2/", "section_title": "SCV College Sports", "url": "http://www.signalscv.com/section/2/article/143035/", "country": "US", "title": "COC Insider: Women's soccer heats up", "performance_score": 0, "site": "signalscv.com", "participants_count": 1, "title_full": "COC Insider: Women's soccer heats up", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T08:16:00.000+03:00", "replies_count": 0, "uuid": "b4aff63e7f7e21ea7dccd85f9094acc939f5744d"}, "author": "Signal Staff", "url": "http://www.signalscv.com/section/2/article/143035/", "ord_in_thread": 0, "title": "COC Insider: Women's soccer heats up", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "COC Insider: Women's soccer heats up Cougars' back-to-back wins fueled by seven goals Posted: September 30, 2015 10:16   30, 2015 10:16 p.m. COC sophomore forward Marissa Kneisel, seen here vs. Mt. SAC on Sept. 25, has scored 26 goals in her COC career, placing her four back of the all-time individual scoring mark set back in 2013. Photo courtesey of Jesse Munoz/COC Sports Information Office. \nWith back-to-back wins, a 1-0 start to its conference schedule and a high-scoring forward on the verge to becoming the program’s all-time leading scorer, the College of the Canyons women’s soccer team is starting to pick up steam. \nCanyons (3-1-2) has netted a combined seven goals in its last two games. \nThat scoring output has resulted in a 4-1 win over visiting Mt. SAC in the team’s home opener last Friday, and most recently a 3-1 victory at Citrus College on Tuesday. \nThe win against Citrus came in the team’s conference opener, and represented the start of the Cougars’ quest for a fifth straight Western State Conference, South crown. \nLeading the attack thus far for the Cougars has been sophomore forward and reigning WSC Player of the Year Marissa Kneisel, who scored a pair of goals against the Owls to bring her season total to six. \nThe Canyon High School graduate has now scored goals in each of COC’s last three games. She also has three assists during that same span. \nKneisel’s career stat line of 26 goals in 28 games puts her just four goals away from the program’s all-time individual scoring mark of 30, set by forward Stacey Atwater during the 2013 season. \nAlso adding to the Cougars’ attack has been freshmen Hannah Hoskins and Kaily Marquez, who have each tallied two goals apiece on the season. \nCanyons next hosts conference opponent Antelope Valley College Friday, on the college’s upper field at 4 p.m. \nMen’s Soccer \nThe COC men’s soccer team has also been on a roll of late, after a string of five consecutive road games to begin the 2015 campaign. \nCanyons (1-4-2) finally had the chance to see a home crowd back on Sept. 22, as the Cougars played to a 3-3 draw with WSC opponent Santa Barbara City College. \nDespite not getting the win, the Cougar offense was relentless in its attack vs. the Vaqueros, even after falling behind 2-0 in the 12th minute of play. \nThat effort carried over to the next game, as head coach Phil Marcellin and the Cougars were able to lock up a 4-0 victory at Allan Hancock College on Tuesday, to earn their first win of the year. \nCOC sophomore Oscar Sanchez had a pair of goals in the contest, giving him a team-leading three on the season. Also scoring for the Cougars were sophomore midfielder Johnathan Trujillo and freshman forward Iban Alaniz. \nCanyons look to continue its strong play when the Cougars travel to Citrus College at 2 p.m. Friday, for another conference match. \nCross Country \nThe COC men’s and women’s cross country teams continue to try and out-perform each other every week, with both squads continuing to find early season success. \nFriday, both teams ran to second place finishes at the Golden West Invitational held at Central Park in Huntington Beach. \nCOC sophomore Ethan Walker won the men’s individual title with a time of 20:53.9 on the four-mile course. \nUp next for the Cougars was sophomore Jason Hillquist who crossed the finish line at 21:39 to take eighth place. Freshman Alejandro Bernal finished in ninth place at 21:43.2. \nThose scores helped Canyons (66) finish one point ahead of third place Saddleback College (67) and six points back of first place Riverside City College (60). \nThe women’s team had a pair of runners finish in the top five, with freshman Jessica Ruiz finishing in third place with a time of 19:35.1 and sophomore Amanda De Jesus taking fifth at 19:46.0. \nSophomore Alexandra Whitman finished just outside the top 10, with a time of 20:03.5 to take 11th place on the 5K course. \nCOC’s team score of 55 trailed only Glendale College (32). Cerritos College (87) placed third. \nCanyons next competes at the WSC Preview being held Friday at Oxnard College. \nFootball \nCOC linebacker Paul Puebla has been named the Southern California Football Association Northern League Defensive Player of the Week for his performance in the Cougars’ 28-24 win vs. Pasadena City College in week four. \nPuebla finished the contest with nine tackles, a sack, a forced fumble and an interception — a pick-six touchdown with 3:35 to play in the fourth quarter to give Canyons a 28-24 win. \nCOC has now had a player win SCFA Player of the Week Honors in each of the first four games. \nCanyons (4-0, 1-0) is currently the No. 3 ranked team in the state and the No. 11 ranked team in the nation according to the most recent polls, released earlier this week. \nCOC hosts conference opponent Bakersfield College 1 p.m. Saturday at Cougar Stadium.", "external_links": [], "published": "2015-10-01T08:16:00.000+03:00", "crawled": "2015-10-01T18:31:34.627+03:00", "highlightTitle": ""}