{"organizations": [], "uuid": "6970eb65bbf76eb41df43e8575dffaf4c7b8e990", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mcdonoughvoice.com", "main_image": "http://www.mcdonoughvoice.com/storyimage/IO/20151015/SPORTS/151019619/AR/0/AR-151019619.jpg", "site_section": "http://www.mcdonoughvoice.com/wci-sports/fall-sports?template=rss&mime=xml", "section_title": "Fall Sports - The McDonough County Voice", "url": "http://www.mcdonoughvoice.com/article/20151015/SPORTS/151019619/13234/SPORTS?rssfeed=true", "country": "US", "title": "Macomb dominates A-Town, 25-4, 25-18", "performance_score": 0, "site": "mcdonoughvoice.com", "participants_count": 1, "title_full": "Macomb dominates A-Town, 25-4, 25-18", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T04:58:00.000+03:00", "replies_count": 0, "uuid": "6970eb65bbf76eb41df43e8575dffaf4c7b8e990"}, "author": "SHELBY BURGET", "url": "http://www.mcdonoughvoice.com/article/20151015/SPORTS/151019619/13234/SPORTS?rssfeed=true", "ord_in_thread": 0, "title": "Macomb dominates A-Town, 25-4, 25-18", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted Oct. 15, 2015 at 8:00 PM Updated Oct 15, 2015 at 8:58   15, 2015 at 8:00 PM Updated Oct 15, 2015 at 8:58 PM MACOMB Entering the homestretch of the season, the Macomb High volleyball team has been working on scoring points the Smith Barney way. By earning them. The Lady Bombers earned plenty of points Thursday night at Washington Street Gym. Holding its annual “We Dig Pink” night, Macomb rolled to a 25-4, 25-18 victory against Abingdon-Avon. Macomb upped its record to 17-15 on the season, while A-Town dropped to 5-18-1. “We’ve been working really hard at practice lately to earn points,” said MHS coach Briana Rexroat. “Playing to take care of the ball instead of hoping the other team will make an error for us.” The first set took just 12 minutes. Julianna Kessler notched a pair of aces to start the match before Haley Coker would go on a 13-point service run to give the Lady Bombers a 16-1 lead. Jenssen Protsman, who returned to the lineup this week after missing 14 matches due to injury, recorded four kills and a block during the run. Mia Lambert added a six-point service run before a Kalela Stone kill closed out the first set. Set two proved to be a much closer affair. There would be six ties early before MHS used a three-point run that included a Chloe Farr kill to give the home team a 12-9 lead. The Lady Bombers used kills by Alia Stone and Coker as part of a four-point Courtney Thorman serving run that made it 17-10. A-Town would inch back into contention however, getting as close as 21-18 following a Macomb passing error. That forced Rexroat to call a time out. “I said, ‘We need to put the ball up. We need to set it up and everyone is going to get back under control, find that form and take care of it,’” said Rexroat as to her message during the stoppage. “We did that. Put the ball down right away and had a block.” A Protsman kill started the match-ending four-point run that closed out the 35-minute contest. “I thought there were times in the second game where we got a little tentative,” said Rexroat. “But they fought through it. At the beginning of the year, I don’t know if they would have. We are gaining some confidence there.” Protsman recorded seven kills and four blocks for Macomb, while Alia Stone tallied three kills and Kalela Stone two blocks. Lambert chalked up 14 set assists, while Thorman and Katie Gillum finished with nine and six digs respectively. Coker finished with 18   three aces. Karyssa Pedersen recorded three kills for A-Town. Cassy Osborne and Katyn Pica-Johnson had seven digs each with Pica-Johnson also notching two blocks. Alexis Meadows tallied four set assists and two blocks for the Tornadoes. Page 2 of 2 - “We (as coaches) always talk about respecting whoever you’re playing,” said Rexroat. “Everyone is out there to play hard. Everyone practices just as much as we do, so we’ve got to go out there and respect who we’re playing.” Macomb enters the final week of the regular season with a pair of important matches. On Tuesday, the Lady Bombers head to Carthage to face Illini West with the West Central Conference title on the line. On Wednesday, Macomb will host Mendon Unity on Senior Night at Washington Street Gym. “We’ve been talking about next week a lot,” said Rexroat. “Mendon (Unity) and Illini West are going to be some tough competition. It’s going to be a battle. … I think it’s going to be a good way to end the season and get us ready for regionals. “Now is the time where we’ve got to play with confidence and aggressiveness. And take (balls) out of system and go with it.” It would be a clean sweep for Macomb on the evening. The freshman team started the evening with a 25-6, 25-9 victory in a match that took 30 minutes. The Lady Bomber JV team then posted a 25-12, 25-22 win in 38  ", "external_links": [], "published": "2015-10-16T04:58:00.000+03:00", "crawled": "2015-10-19T17:56:24.314+03:00", "highlightTitle": ""}