{"organizations": [], "uuid": "4e82c872fe794080b6d7317931b7bad68c62d6a9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leesvilledailyleader.com", "main_image": "http://www.leesvilledailyleader.com/storyimage/LA/20151025/NEWS/151029789/AR/0/AR-151029789.jpg", "site_section": "http://www.leesvilledailyleader.com/sports?template=rss&mime=xml", "section_title": "Sports - Leesville Daily Leader - Leesville, LA", "url": "http://www.leesvilledailyleader.com/article/20151025/NEWS/151029789/2000/NEWS?rssfeed=true", "country": "US", "title": "Harris' career-high yardage helps No. 5 LSU top WKU 48-20", "performance_score": 0, "site": "leesvilledailyleader.com", "participants_count": 1, "title_full": "Harris' career-high yardage helps No. 5 LSU top WKU 48-20", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T16:35:00.000+02:00", "replies_count": 0, "uuid": "4e82c872fe794080b6d7317931b7bad68c62d6a9"}, "author": "BRETT MARTEL AP Sports Writer", "url": "http://www.leesvilledailyleader.com/article/20151025/NEWS/151029789/2000/NEWS?rssfeed=true", "ord_in_thread": 0, "title": "Harris' career-high yardage helps No. 5 LSU top WKU 48-20", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted Oct. 25, 2015 at 9:30 AM Updated at 9:35 AM BATON ROUGE (AP) — Even in miserable, soggy conditions, LSU quarterback Brandon Harris had enough grip, zip and accuracy to make a defense pay for selling out to stop star running back Leonard Fournette. Harris passed for a career-high 286 yards, with two of his three scoring passes going for more than 50 yards, and No. 5 LSU used a strong second half to pull away from Western Kentucky, 48-20 on Saturday night. \"The biggest thing is, as the season progresses, he is getting more confidence and the coaching staff in turn is starting to get more confidence in him,\" LSU receiver Malachi Dupre said about Harris. \"He is playing great right now. The weather wasn't ideal tonight, but we were still able to make plays.\" Fournette, who has four scoring runs of 40 or more yards this season, didn't have a gain longer than 18 yards against Western Kentucky. He still finished with 150 yards and a short touchdown run, giving him 1,352 yards rushing and 15 TDs this season. Now LSU (7-0), which has next weekend off, can look forward to another pivotal showdown with historical nemesis Alabama (7-1) on Nov. 7 in Tuscaloosa. The eighth-ranked Crimson Tide, which also has next weekend off, beat Tennessee on Saturday. While LSU coach Les Miles complimented Western Kentucky's offensive prowess and overall competitiveness, he also sent an unambiguous message to his players that they will need to play better at Alabama. \"We're a team that is capable, talented. We're not there yet,\" Miles said. \"Hopefully, in a couple weeks.\" Miles placed the normally outspoken Harris off-limits to media after the game. Fournette also was not made available. The Hilltoppers (6-2) were as close to the Tigers as 17-13 on Brandon Doughty's 39-yard touchdown pass to Antwane Grant in the third quarter, but LSU scored the next 17 points. caught a 55-yard scoring pass on LSU's opening series. Tigers freshman Tyron Johnson made a tough downfield catch over defender Wonderful Terry, then scampered about 20 yards for his 61-yard score in the third quarter. Travin Dural, who had five catches for 132 yards, caught a 17-yard touchdown in the fourth quarter. \"Because they run the ball so well, they could hit some play action off of it and they did,\" Western Kentucky coach Jeff Brohm said. Doughty, who came in averaging 387 yards passing, finished 37 of 61 for 325 yards and three TDs. He was intercepted once, by Jamal Adams — the LSU safety's third interception this season. Taywan Taylor had 10 catches for 103 yards and one TD for Western Kentucky. \"It wasn't ideal. We're a throwing team, so when it's raining cats and dogs, it's a little tougher than a light sprinkle,\" Brohm said. \"We couldn't take as many up-the-field shots as we normally do.\" LSU finished with 211 yards rushing, well below its average of 325.5 yards coming in. Derrius Guice wound up with the Tigers' longest run — a late 47-yard touchdown dash. Page 2 of 2 - After opening with four Fournette rushes for 15 yards on its first series, LSU took a 7-0 lead on Harris' deep throw to Dupre. Yet LSU stuck with running plays for most of the first half with less success than usual, gaining just 82 yards on 23 carries. Western Kentucky, which came in averaging 535.4 yards and 44 points, could not move the ball at its usual pace against LSU's defense, but managed to tie the game on its fifth possession. D'Andre Ferby broke loose for a 35-yard run, setting up Anthony Wales' 7-yard touchdown on a shovel pass. Harris attempted only nine passes in the first half, completing four. However, one of those completions went for 67 yards to Dural, setting up Darrel Williams' 2-yard run that gave LSU a 14-7 lead at halftime. LSU place kicker Trent Domingue, who scored a touchdown on a fake against Florida a week earlier, went back to his usual routine, hitting a pair of field goals to make him 9 of 9 this season. His second, from 43 yards made it 20-13. Harris set up Fournette's 1-yard TD by completing a 25-yard pass to Dupre moments before he was leveled by linebacker Dejon Brown. Brown was flagged for targeting and ejected. Western Kentucky finished with 428 yards, more than 100 yards below its average coming in, while LSU racked up 497 yards. LSU's defense, which sacked Doughty just once after recording 17 sacks in its previous six games, wasn't entirely happy with its performance. The Tigers played without starting defensive tackle Christian LaCouture, who was injured in practice (his status against Alabama remains uncertain), but defensive end Lewis Neal asserted, \"Regardless of who is out there, we just have to all keep pushing as a defensive unit. We have to try and continue to create more pressure.\" By BRETT MARTEL Leesville Daily Leader - Leesville, LA By BRETT MARTEL Posted Oct. 25, 2015 at 9:30 AM Updated at 9:35 AM", "external_links": [], "published": "2015-10-25T16:35:00.000+02:00", "crawled": "2015-10-25T21:27:24.056+02:00", "highlightTitle": ""}