{"organizations": [], "uuid": "c5e1677a93551ba276b78c6f79610cc790446d44", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "http://www.bostonherald.com/sites/default/files/media/ap/86da3075beb74f4ea052e903af2a5587.jpg", "site_section": "http://bostonherald.com/sports/patriots_nfl", "section_title": "Sports: Patriots &amp; NFL | Boston Herald", "url": "http://bostonherald.com/sports/patriots_nfl/nfl_coverage/2015/10/rested_cardinals_await_steelers_in_pittsburgh", "country": "US", "title": "Rested Cardinals await Steelers _ in Pittsburgh", "performance_score": 0, "site": "bostonherald.com", "participants_count": 1, "title_full": "Rested Cardinals await Steelers _ in Pittsburgh | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T03:00:00.000+03:00", "replies_count": 0, "uuid": "c5e1677a93551ba276b78c6f79610cc790446d44"}, "author": "Associated Press", "url": "http://bostonherald.com/sports/patriots_nfl/nfl_coverage/2015/10/rested_cardinals_await_steelers_in_pittsburgh", "ord_in_thread": 0, "title": "Rested Cardinals await Steelers _ in Pittsburgh", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "After a rout of the Lions at Detroit, Bruce Arians took his Cardinals to a resort in West Virginia rather than head back to Arizona.\nWith another road game in the East on Sunday at Pittsburgh, the travel itinerary seemed to make plenty of sense.\nAnd with the Steelers coming off a gut-wrenching Monday nighter at San Diego that they won on the final play, well, Arians' bunch might be the more-rested squad.\nArians spent eight seasons in Pittsburgh, mostly as offensive coordinator, winning two Super Bowls before being exiled.\nHe since has won two NFL Coach of the Year awards, in 2012 as an interim in Indianapolis while Chuck Pagano fought leukemia, and last season with the Cardinals. While he insists returning to the Steel City is no big deal and that he has done it before, others know better.\n\"Knowing him and how prepared that he is,\" Steelers star receiver Antonio Brown said, \"I'm sure he's going to want to come in here and put on a show, being how many people counted him out and wanted him out of here.\"\nHe has the team to do it, too. Arizona (4-1) has scored a league-best 190 points and allowed 90; the 100-point differential is by far tops in the NFL.\nThe Steelers also have a potent offense — when Ben Roethlisberger, not Mike Vick, is at quarterback. He returned from a left knee injury to practice this week on a limited basis and is not likely to go Sunday.\n\"It's hard to watch when you really want to be out there,\" Roethlisberger said. \"I'm just trying to be the best on-the-sideline guy I can be. I don't want to be overbearing because Mike's been doing this for a long time and he's a real pro. I'm just here to help him in any way I can.\"\nThe action began Thursday night with New Orleans beat Atlanta 31-21, handing the Falcons their first loss of the season.\nOff this week are Dallas, Oakland, St. Louis and Tampa, all with 2-3 records.\nNew England (4-0) at Indianapolis (3-2)\nAh, \"Deflategate II.\" BORING!\nLet's concentrate on football, not under-inflated footballs.\nIndy should get back starting quarterback Andrew Luck, but it won both games he missed with a shoulder issue.\nNew England has been on a rampage — sure, Tom Brady being ticked off about the whole scandal plays into that.\n\"I'm always pretty motivated regardless of the opponent, regardless of the team or the week, whether it's a preseason game, whether it's a regular-season game,\" Brady said.\n\"They're all important because there are so few of those where you get an opportunity in your life, so I don't take it for granted.\"\nStill, isn't there any human part of you that wants it a little extra this week?\n'I'm a human,\" Brady said. \"There's no doubt. I'm definitely human.\"\nSan Diego (2-3) at Green Bay (5-0)\nGreen Bay's fourth home game already, and with the bye next week, the Packers are sitting in a great spot. Their pass defense has been a revelation, and they have found a diverse rush in which eight players have played a part in getting an NFC-high 20 sacks.\nSan Diego lost in the final second on Monday night against the Steelers and now has to travel to Lambeau Field. The Chargers are 1-9 against Green Bay and Dan Fouts was their quarterback when they took that game in 1984.\nCarolina (4-0) at Seattle (2-3)\nA Panthers win would establish them as a contender in the NFC — and make everyone wonder when the Seahawks will get straightened out. Of course, Seattle was 3-3 in 2014 and wound up in the Super Bowl.\nCarolina should get back star linebacker Luke Kuechly to its solid defense, but it's the rushing game, led by QB Cam Newton and RB Jonathan Stewart, that has been just as impressive.\nSeattle also expects back a key ingredient, RB Marshawn Lynch, though rookie Thomas Rawls filled in well. The Seahawks have gone 16 straight games dating back to last season with at least 100 yards rushing as a team and lead the NFL in rushing with 142.4 yards per game.\nDenver (5-0) at Cleveland (2-3)\nSomehow, Josh McCown is the more prolific quarterback in this matchup, although Peyton Manning is 6-0 lifetime vs. Cleveland and the Broncos have won 10 straight against the Browns. McCown passed for a franchise-record 457 yards last week in leading a comeback win at the Ravens.\nHe's the first QB in NFL history with more than 450 yards passing, two TDs, a TD rushing and no interceptions in the same game and has thrown for 1,154 yards in the past three games.\nThe Broncos are one win from joining New England as the only original American Football League franchises to reach 450 regular-season wins. Their defense ranks first in the league, making up for a pedestrian offense thus far.\nCincinnati (5-0) at Buffalo (3-2)\nThe previous time Cincinnati won its first six games was 1988, when it made the Super Bowl. Andy Dalton is off to the best start of his career with a 115.6 passer rating, highest in team history through five games, as part of the NFL's second-ranked offense.\nLike the Bengals, the Bills barely squeezed out a victory last week and could be without quarterback Tyrod Taylor; EJ Manuel would start. Injuries have damaged Buffalo's offense — top RB LeSean McCoy has been sidelined by a hamstring problem and WR Sammy Watkins is coming back from a calf issue.\nChicago (2-3) at Detroit (0-5)\nAfter a horrific start, the Bears have responded to new coach John Fox with two straight victories, showing more gumption than in recent seasons. A victory at the winless Lions would actually make people in the Windy City stop obsessing on the Cubs. Well, maybe not.\nThe previous time the Lions looked as bad as they did in last Sunday's 42-17 walloping by Arizona was in 2008, when they went 0-16. A lopsided loss to Chicago could make a revival of such thoughts much less outlandish.\nNew York Giants (3-2) at Philadelphia (2-3), Monday night\nThe NFC East is so wide open that when these two meet in the season finale, it could be decisive. Still, the winner in prime time gets a leg up.\nNew York enters short-handed at receiver but on a three-game winning streak. Philadelphia's defense has come alive behind end Fletcher Cox, who had a career-high three sacks with two forced fumbles and one recovery last week vs. the Saints. Rookie LB Jordan Hicks has 25 tackles, a sack, three fumble recoveries, one forced fumble and one interception in the last four games.\nWashington (2-3) at New York Jets (3-1)\nThe Jets have New England next, so looking past this one could be tempting and very counterproductive. Coming off a bye, and with standout defensive lineman Sheldon Richardson returning from a four-game suspension, expect New York's stingy defense to be even more miserly.\nThe Redskins are vastly improved over 2014, Jay Gruden's first season as coach, but they folded late at Atlanta last week. Kirk Cousins, who threw a decisive pick-6 in overtime, usually struggles at the Meadowlands.\nBaltimore (1-4) at San Francisco (1-4)\nHardly the Harbowl with coach Jim Harbaugh having left the dysfunctional 49ers for Michigan and older brother John in the midst of his worst season in Baltimore.\nThe Ravens have won four straight against the Niners, including the 2013 Super Bowl, from which the 49ers have only four starters still around. Both teams fell at the end of their tight Week 4 games.\nKansas City (1-4) at Minnesota (2-2)\nThe outdoors seem to agree with the Vikings, who are in their second and final season at TCF Bank Stadium before heading back inside in their new building. They've won five in a row in their temporary home.\nKansas City is reeling after some devastatingly close defeats and losing star running back Jamaal Charles with a torn right ACL. The Chiefs have allowed a league-worst 14 sacks, but Minnesota has not displayed a potent pass rush.\nMiami (1-3) at Tennessee (1-3)\nMiami's first game since Joe Philbin was fired as coach, replaced by Dan Campbell.\n\"It's only Week (6 and we have) 12 games,\" said DT Ndamukong Suh, a major underachiever after signing the richest free-agent contract in NFL history for a defensive player. \"We put ourselves in a hole, but it's not too late to get us out of it.\"\nThe Titans have the league's top-ranked pass defense, yielding 188 yards a game.\nHouston (1-4) at Jacksonville (1-4)\nAlthough the Texans have won seven of the last nine in this series, five of the past seven meetings have been decided by seven points or less.\nHouston goes back to Brian Hoyer at quarterback, and his top target, DeAndre Hopkins, leads the NFL with 578 yards receiving, looking for a fourth consecutive 100-yard game, which would tie Andre Johnson's franchise record.\nJacksonville expects to get DT Sen'Derrick Marks and RB Denard Robinson back from knee injuries.\n___\nAP NFL website: www.pro32.ap.org and www.twitter.com/AP_NFL", "external_links": [], "published": "2015-10-18T03:00:00.000+03:00", "crawled": "2015-10-18T17:37:19.698+03:00", "highlightTitle": ""}