{"organizations": [], "uuid": "00bbd8d1c051a359da0e750cf9c5a1b1a9258739", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.heraldbulletin.com", "main_image": "http://heraldbulletin/content/tncms/live/global/resources/images/_site/og_image_heraldbulletin.jpg", "site_section": "http://www.heraldbulletin.com/search/?q=&t=article&l=100&d=&d1=&d2=&s=start_time&sd=desc&nsa=eedition&c[]=sports,sports/*&f=rss", "section_title": "Herald Bulletin - sports,sports/", "url": "http://www.heraldbulletin.com/sports/dillander-claims-driver-series-title-hawaii-trip/article_6ac7e136-7536-11e5-af73-03f09ea97139.html", "country": "US", "title": "Dillander claims Driver Series title, Hawaii trip", "performance_score": 0, "site": "heraldbulletin.com", "participants_count": 1, "title_full": "Dillander claims Driver Series title, Hawaii trip", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T04:19:00.000+03:00", "replies_count": 0, "uuid": "00bbd8d1c051a359da0e750cf9c5a1b1a9258739"}, "author": "rick.teverbaugh@heraldbulletin.com(Rick Teverbaugh)", "url": "http://www.heraldbulletin.com/sports/dillander-claims-driver-series-title-hawaii-trip/article_6ac7e136-7536-11e5-af73-03f09ea97139.html", "ord_in_thread": 0, "title": "Dillander claims Driver Series title, Hawaii trip", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Dillander claims Driver Series title, Hawaii trip By Rick Teverbaugh | The Herald Bulletin Herald Bulletin Posted on Oct 17, 2015 \nANDERSON — Usually fifth place means nothing to bettors and very little to horsemen. \nBut on Saturday night, fifth place meant a trip for four to Hawaii for Jason Dillander. \nDillander claimed fifth in the fifth and final race of the Champion Driver Series at Hoosier Park. He guided Greystone Moe to that finish, and it was enough to give him 69 points for the series. \nThat was one better than Sam Widger, who was second with 68. Widger could have won the trip if he had finished eighth or better in the last race, but BC's Bad Cat was dead last in the 10-horse field. \nDillander got seventh pick of horses in three of the races and fourth pick in two and still managed to be the overall winner. \n\"I think the races were pretty wide open,\" said Dillander, who has never been to Hawaii. \"There was a lot of talking (among the drivers) during the night. But we're all doing the best we can. There's no grudges among anyone.\" \nLeWayne Miller, who won last year's inaugural event, was third — just two points behind the winner with 67. His horse in the final race, Krusty The Clown, finished eighth. Tyler Smith was fourth with 66. \nIn the opening race of the series, the lead was shuffled a bit early, but in the middle of the final turn, As Seeley Promised, the heavy favorite, took over and put the field away. \nThe win gave driver Smith the 15 points for the win. The winning time was 1:54 and the payout $3.60, $2.80 and $2.10. It was As Seeley Promised's fifth win of the season. Always Wearable, with Dillander driving, was second and Fat Fannie Annie with Miller in the sulky was third. \nMiller maintained his lead with 47. Smith and Widger were next with 44, and Dillander was fourth with 42. \nIn the second race of the series, Best of Jenna made a big move in the middle of the backstretch, took the lead on the far turn and protected it to the wire. Andy Shetler was the winning driver. He was not involved in the first night of the competition. \nFrontier Sarah was second for driver Rick Plano and Voodoo Mama was third for Miller, increasing his lead in the series points. After two races, Miller had 54 with Widger next with 50. Smith had 49 for third, and Dillander was fourth with 47. \nOn of the night's strongest drives came in the third race in the series as Widger took the lead early with Igraine and held it to the wire. The 1:55.3 time showed the patience he used for the victory and the 15 points. Dan Shetler's horse was second, and Smith's Sugartime Express was third. \nWidger moved into first with those points to give him 65 for the series. Miller was second, five points back. Smith was third and Dillander fourth. \nIn the fourth race, none of the current top three in points fared that well. Pistolpacknshooter gave Dan Shetler a victory in 1:53.4. Dillander's Meersburg was second, and Pipecreek Yankee, piloted by Plano, was third. \nIn the Breeders Crown Elimination race at Woodbine in Toronto, Freaky Feet Pete looked exactly like the favorite he was in winning the race in 1:49.4. Driver Trace Tetrick parked him outside at the end of the backstretch and had him in prime position when he hit the front stretch. \nTetrick moved him to the front immediately, and he won by three lengths. The finals in the Breeders Crown will be next Saturday.  ", "external_links": [], "published": "2015-10-18T04:19:00.000+03:00", "crawled": "2015-10-18T04:39:23.401+03:00", "highlightTitle": ""}