{"organizations": [], "uuid": "d49ebeabbec2e0892b2ade60f58e4ebdaa9f7b86", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pe.com", "main_image": "http://images.onset.freedom.com/pressenterprise/thumb/nw1jmy-b88537358z.120151010223531000gaich2b3.10.jpg", "site_section": "http://www.pe.com/sections/sports/", "section_title": "Sports : Press Enterprise", "url": "http://www.pe.com/articles/dodgers-783127-game-run.html", "country": "US", "title": "Collision sparks Dodgers to 5-2 win over Mets in Game 2", "performance_score": 0, "site": "pe.com", "participants_count": 1, "title_full": "Collision sparks Dodgers to 5-2 win over Mets in Game 2 - Press Enterprise", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "d49ebeabbec2e0892b2ade60f58e4ebdaa9f7b86"}, "author": "BILL PLUNKETT", "url": "http://www.pe.com/articles/dodgers-783127-game-run.html", "ord_in_thread": 0, "title": "Collision sparks Dodgers to 5-2 win over Mets in Game 2", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By BILL PLUNKETT / STAFF WRITER\nPublished: Oct. 10, 2015 Updated: 11:02 p.m. LOS ANGELES – Live in Southern California long enough and you learn the proper strategy in a high-speed chase is to let the speeder burn himself out or run out of gas.\nBut sometimes they end with a spectacular crash.\nStifled by a second night of power pitching from the New York Mets’ high-velocity hurlers, the Dodgers finally broke through with four runs in the seventh inning of Game 2 Saturday night, taking the game 5-2 and evening the series.\nBut the Mets left town smoldering after a borderline – if that – slide by Chase Utley knocked their shortstop, Ruben Tejada, from the game with a fractured right fibula and ignited the winning rally. The tying run scored as Utley’s late, hard slide tipped Tejada heels over head on a play at second base. While Tejada was taken off the field on a cart, the play was reviewed.\nAfter examining the replay, it was ruled that not only had Tejada taken a leg-breaking hit, he had failed to touch second base before Utley arrived. Though Utley made no contact with the base himself, he was ruled safe and scored moments later on a two-run double by Adrian Gonzalez.\n“That's baseball. That's part of the game,” Dodgers second baseman Howie Kendrick said. “He probably did slide late but he didn't want to hurt the guy. We play this game hard. But it's never with the intention of hurting anybody.”\nThe comeback saves the Dodgers from going to New York down 0-2 in the best-of-five series – a hole only eight teams have managed to dig out of in a five-game series (and only two of those after losing the first two games at home as the Dodgers were in danger of doing for most of the night).\n“We needed something to happen for us to be us,” the Dodgers’ Kiké Hernandez said. “It happened to be that play and we took off.\n“We got our mojo back. We got our confidence back and that’s all we need.”\nWith the Dodgers still stinging from Jacob deGrom’s upper-90s arsenal in Game 1, Noah Syndergaard announced his presence with authority. His first five pitches were clocked at 99 mph, 100, 99, 99 and 101. Six of his first 13 pitches hit 100 or 101.\nSyndergaard was every bit as dominant as deGrom early. He started seven of the first nine Dodgers’ batters with 0 and 2 counts and 11 of the first 18.\nBut Syndergaard wasn’t the only one flashing impressive velocity. Yoenis Cespedes took a Zack Greinke pitch that was four inches off the plate (according to StatCast) and drove it over the right-field wall for a solo home run to lead off the second inning. Three batters later, Mets rookie Michael Conforto ripped a line drive down the right-field line and off the foul pole for another home run. His drive registered 114 mph off the bat.\nThings finally began to slow down, though. After hitting 100 or above with 13 of his first 36 pitches, Syndergaard didn’t hit triple-digits again until his 20th pitch of the third inning and not at all after his 57th pitch.\nThe Dodgers finally got to him in the fourth inning when Justin Turner led off with a double and Andre Ethier drove him in with a single.\nIt stayed a one-run game until Kike’ Hernandez walked and stole second with one out in the seventh. Utley pinch-hit and singled on Syndergaard’s final pitch. Hernandez held at the third and came in with the tying run when Howie Kendrick bounced a ground ball to second baseman Daniel Murphy\nMurphy flipped to Tejada who reached for the base with his toe and was turning to throw to first when Utley wiped him out. Tejada had little chance to get Kendrick.\nTejada’s hard fall turned into a windfall for the Dodgers when the replay sent Utley back to second base. Two-out doubles by Gonzalez and Turner gave the Dodgers a three-run lead.\nGreinke’s night was over after seven strong innings, the homers by Cespedes and Conforto the only blemishes.\nWith a lead for the first time in this series, Dodgers relievers Chris Hatcher and Kenley Jansen closed with two hitless innings.\nContact the writer: bplunkett@ocregister.com\nRelated: Miller: Chase Utley wakes up Dodgers with old-school slide Moura: There's no place in baseball for plays such as Chase Utley's slide Dodgers' Seager, Mets' Conforto is a tale of two rookies Dodgers notes: Don Mattingly remains patient with struggling Yasmani Grandal Dodgers-Mets box score", "external_links": ["http://www.ocregister.com/articles/play-687020-utley-game.html", "http://www.ocregister.com/articles/dodgers-687018-seager-game.html", "http://www.ocregister.com/articles/game-687009-grandal-saturday.html", "http://www.ocregister.com/articles/utley-687017-base-game.html", "http://sports.ocregister.com/mlb/boxscore.asp?gamecode=351010119&final=true"], "published": "2015-10-10T03:00:00.000+03:00", "crawled": "2015-10-11T09:27:11.165+03:00", "highlightTitle": ""}