{"organizations": [], "uuid": "d841762f407cac7a1b556d3cff2e8f266cca4020", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.galesburg.com", "main_image": "http://www.galesburg.com/storyimage/LG/20151015/SPORTS/151019850/AR/0/AR-151019850.jpg", "site_section": "http://www.galesburg.com/wci-sports/topstories?template=rss&mime=xml", "section_title": "WCI Sports - The Register-Mail", "url": "http://www.galesburg.com/article/20151015/SPORTS/151019850/13234/SPORTS?rssfeed=true", "country": "US", "title": "Silver Streaks Notebook: Freshman does Galesburg's punting", "performance_score": 0, "site": "galesburg.com", "participants_count": 1, "title_full": "Silver Streaks Notebook: Freshman does Galesburg's punting", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T19:03:00.000+03:00", "replies_count": 0, "uuid": "d841762f407cac7a1b556d3cff2e8f266cca4020"}, "author": "MIKE TRUEBLOOD The Register-Mail", "url": "http://www.galesburg.com/article/20151015/SPORTS/151019850/13234/SPORTS?rssfeed=true", "ord_in_thread": 0, "title": "Silver Streaks Notebook: Freshman does Galesburg's punting", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted Oct. 15, 2015 at 11:03 AM Updated at 11:03 AM The Register-Mail Posted Oct. 15, 2015 at 11:03 AM GALESBURG - Galesburg High School football coach Tim Dougherty didn't need to see he had a young punting prospect during summer camp, he heard it. \"We do a little kicking session and Coach (Mike) Washabaugh came over and said, 'I think we got a guy,' \", said Dougherty of his assistant. \"I just listened for the sound - for the pop. He had that.\" The guy happened to be 6-0, 160-pound freshman James Hayden, who despite his youth, could almost be considered a veteran punter. Since age 11, he's been a regular at the punting and kicking camps held by Jamie Kohl. \"One day I was kicking the football and said to my parents, I want to do that,\" said Hayden. \"My parents said, 'Great, we'll put you in camps' and I've been doing it ever since.\" Hayden didn't actually take the field to kick for a team until he reached eighth grade but despite some nerves in his first varsity game this season against Dunlap, few would guess he's a freshman from his performance. \"He's done well, He's handled his success well,\" said Dougherty. \"He's mature beyond his years. He's handled it well.\" \"I wasn't counting on playing varsity this year,\" admitted Hayden. \"I was thinking next year or the year after that.\" Hayden, who is averaging XXX yards per punt, boomed a 60-yarder against Dunlap and had a key 52-yard boot in a shutout win over Alleman two weeks ago. He also had a punt blocked in the Dunlap game and against Rock Island last week. The true student of punting that he is, Hayden knows exactly why the blocks happened. \"I was nervous against Dunlap,\" he said. \"I just completely dropped the snap. \"Against Rock Island the snap was up and to the left, I shuffled over to get it and I took too long.\" When he's not staying after practice to make extra punts - his parents Jeff and Teresa show up to shag balls for him - Hayden relies on his camp training to improve. \"They teach you at an NFL level so you can get it faster,\" he said. \"They're hard teachers. You get it quicker.\" Hayden also place kicks and will do that in this week's game at Quincy. Senior Joe Anderson usually handles the Streaks' place kicking but also has a commitment with the GHS soccer team this weekend. One of the few freshmen to ever suit up for Galesburg varsity football, Hayden says he's been treated well by his teammates. \"I'm part of the family,\" he said. \"They joke, they call me Freshy but I'm still part of the team.\" And possibly for three more years after this one. Page 2 of 2 - \"I'd like to earn a full ride to a football power like Alabama,\" sai d Hayden. \"And after that the NFL.\"", "external_links": [], "published": "2015-10-15T19:03:00.000+03:00", "crawled": "2015-10-16T00:37:22.712+03:00", "highlightTitle": ""}