{"organizations": [], "uuid": "6f844ff20530bfc602189e861f5566938fe0153c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.deccanchronicle.com", "main_image": "http://www.deccanchronicle.com/sites/default/files/Basit-and-Mirwaiz.jpg", "site_section": "http://www.deccanchronicle.com/sports/other-sports", "section_title": "Other Sports | Deccan Chronicle", "url": "http://www.deccanchronicle.com/151020/nation-current-affairs/article/pak%E2%80%99s-abdul-basit-meet-mirwaiz-denies-inviting-lawmaker-rashid", "country": "US", "title": "Pak’s Abdul Basit meet Mirwaiz, denies inviting lawmaker Rashid for talks | Deccan Chronicle", "performance_score": 0, "site": "deccanchronicle.com", "participants_count": 1, "title_full": "Pak’s Abdul Basit meet Mirwaiz, denies inviting lawmaker Rashid for talks | Deccan Chronicle", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T00:46:00.000+03:00", "replies_count": 0, "uuid": "6f844ff20530bfc602189e861f5566938fe0153c"}, "author": "Deccan", "url": "http://www.deccanchronicle.com/151020/nation-current-affairs/article/pak%E2%80%99s-abdul-basit-meet-mirwaiz-denies-inviting-lawmaker-rashid", "ord_in_thread": 0, "title": "Pak’s Abdul Basit meet Mirwaiz, denies inviting lawmaker Rashid for talks | Deccan Chronicle", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Deccan Chronicle | Yusuf Jameel | October 20, 2015, 16.35 pm Pakistan High Commissioner Abdul Basit with Hurriyat Chairman Mirwaiz Umar Farooq (Photo: Deccan Chronicle) Srinagar: Some TV channels on Tuesday reported that Jammu and Kashmir’s Independent lawmaker Engineer Rashid has been invited by Pakistan High Commissioner, Abdul Basit, for a meeting in New Delhi.\nBut the Pakistan High Commission was quick to deny it. “Indian Channels running news about Pak envoy is baseless. Pakistan considers Hurriyat true representatives of the people of Jammu & Kashmir, \" it wrote on its official twitter account.\nEarlier Mr. Basit's held a meeting with Kashmiri separatist leader, Mirwaiz Umar Farooq, in New Delhi to discuss the issues confronting the people of the state.\nRashid who heads regional Awami Itehad Party (AIP) and represents Langaet (Kupwara) segment in the J&K Assembly also told reporters back home on telephone that the TV news reports were “baseless and false”. Kashmir Life, a news portal, Quote: d him saying, “I didn’t receive any such invitation nor was I contacted by anyone. These are just rumours.”\nHe termed these reports as “a handiwork of the same people who attacked me yesterday. They want to give an impression that I am close to the Pakistan Government.” “This”, he added, “will become a ground for many such communal elements to attack me”.\nRashid was on Monday attacked by Hindu Sena activists who blackened his face with ink and mobil oil at Delhi’s Press Club. This came less than a fortnight after he was attacked by BJP MLAs in the Jammu and Kashmir Assembly for hosting a beef party in Srinagar.\nThe lawmaker while reacting to Sena activists’ act had said, “We will not succumb to threats. Let the world see how India treats Kashmir now”. He had also said \"This no longer is Gandhi’s India. This is Modi’s India.” While expressing concern over the growing “intolerance” by “right-wing forces”, he had said that they were proving Muhammad Ali Jinnah’s two-nation theory correct and asked Prime Minister, Narendra Modi, to apologise for Godhra, Akhlaq and Zahid, the Kashmir trucker killed by Hindu zealots over cow slaughter rumour in J&K’s Udhampur district. Rashid had alleged that the BJP has already divided the entire country and asked it not to divide J&K now.\nBut on Tuesday, he walked to New Delhi's Parliament Street police station to withdraw the case against the assailants. Delhi police had arrested Hindu Sena members, Deepak Sharma (30) and Devendra Upadhyay (33), under Sections 355 (assault or criminal force with intent to dishonour person) of the IPC immediately after the attack.\nBefore visiting the police station, he told reporters that he was withdrawing the cases as he believed they were “misguided by some fringe elements\" and that he had sympathy for them and many more such people present in the country. He also said that the ink attack on him was not a big issue.\nMeanwhile, Kashmir’s chief Muslim cleric and chairman of his faction of separatist Hurriyat Conference, Mirwaiz Umar Farooq, met Pakistan High Commissioner, Mr. Basit, in New Delhi. A statement issued by the amalgam faction here on Tuesday Quote: d Mr. Basit as saying that Islamabad was committed to discuss Kashmir with India with the aim to arrive at a lasting solution on the issue. He reiterated Pakistan’s viewpoint that without taking the Kashmiri leadership on board, the dialogue process will not achieve the desired results.\n Abdul Basit Engineer Rashid ink attack nation Also Read Bring back terrorists from Pak on your plane: Azam Khan to Narendra Modi KPCL bags Golden Peacock award Now, Gujarat cops make dummy ‘terrorists’ shout pro-Islamic slogan Telangana to organise I-Day celebrations inside Golconda fort", "external_links": ["http://platform.twitter.com/widgets.js", "http://static.ak.fbcdn.net/connect.php/js/FB.Share", "http://campaign.bharatmatrimony.com/track/clicktrack.php?trackid=00100326114361", "http://dd508hmafkqws.cloudfront.net/sites/default/files/Basit-and-Mirwaiz.jpg", "https://apis.google.com/js/plusone.js", "http://twitter.com/share?url=http://www.deccanchronicle.com/151020/nation-current-affairs/article/pak’s-abdul-basit-meet-mirwaiz-denies-inviting-lawmaker-rashid", "http://www.facebook.com/sharer.php", "http://vuukle.com/js/vuukle.js", "http://dd508hmafkqws.cloudfront.net/sites/default/files/styles/article_node_view/public/Basit-and-Mirwaiz.jpg", "http://dd508hmafkqws.cloudfront.net/sites/default/files/BharatMatrimony_texlink_banner_620x40px.gif"], "published": "2015-10-21T00:46:00.000+03:00", "crawled": "2015-10-20T14:15:48.434+03:00", "highlightTitle": ""}