{"organizations": [], "uuid": "13747284ae5cb607e167641f58038ea160b3fe6b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "cjonline.com", "main_image": "http://cjonline.com/sites/default/files/images/sms-default-facebook-share.png", "site_section": "http://cjonline.com/taxonomy/term/2/feed", "section_title": "Sports", "url": "http://cjonline.com/sports/2015-10-18/washington-county-abilene-ride-second-half-comebacks-stay-unbeaten", "country": "US", "title": "Washington County, Abilene ride second-half comebacks to stay unbeaten", "performance_score": 0, "site": "cjonline.com", "participants_count": 1, "title_full": "Washington County, Abilene ride second-half comebacks to stay unbeaten", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T04:17:00.000+03:00", "replies_count": 0, "uuid": "13747284ae5cb607e167641f58038ea160b3fe6b"}, "author": "Brent Maycock", "url": "http://cjonline.com/sports/2015-10-18/washington-county-abilene-ride-second-half-comebacks-stay-unbeaten", "ord_in_thread": 0, "title": "Washington County, Abilene ride second-half comebacks to stay unbeaten", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Follow This Article Washington County, Abilene ride second-half comebacks to stay unbeaten Tigers outscore Riley County 22-0 after halftime for 22-18 win; Abilene sparked by quick-strike scores in 26-17 win Posted: October 18, 2015 - 8:17pm By Brent Maycock brent.maycock@cjonline.com \nOne play into Friday night’s Class 3A District 13 showdown with Riley County, Washington County had already taken a pretty big punch. \nOn the opening kickoff, the Falcons came up with a big play. A kick return all the way to the Tiger 3 set up a quick touchdown and just like that, Washington County was down 6-0. \nIf that wasn’t a big enough punch, Washington County committed two first-half turnovers that led to short-field touchdown drives for the Falcons. Despite trailing 18-0 at halftime, the Tigers weren’t discouraged. \n“We just had to keep fighting,” Washington coach Doug Thompson said. “It wasn’t that we were playing bad, but we just had too many mistakes. When the kids came in the lockerroom, they felt that way. We’d shot ourselves in the foot.” \nOnce the Tigers stopped hurting themselves in the second half, the comeback was on. Washington County didn’t allow Riley County to score again and scored 22 straight points in the second half for the 22-18 win to improve to 7-0. \nWashington County didn’t corner the market on second-half comebacks by undefeated teams on Friday. Abilene entered its Class 4A District 8 showdown with McPherson 6-0 as well and like the Tigers, the Cowboys rode a big second half to an even bigger win, rallying for a 26-17 victory. \nIt was only a matter of seconds for Abilene to get two plays to turn the game. \nWith time running out in the first half and Abilene down 17-7, Cowboy coach Steve Simpson put the ball in the hands of senior quarterback Harley Hazlett and told him to make something happen. The dual-threat standout did just that, racing 61 yards for a touchdown with one second left in the half. \nAbilene carried the momentum through halftime and this time Trey Bender provided the bang, starting the second half by returning the kick 85 yards for a go-ahead touchdown. Hazlett caught a 28-yard pass from Ryan Wilson late in the third quarter and the Abilene defense did the rest, posting a second-half shutout of the Bullpups to score a big win in arguably Class 4A Division I’s toughest district, which also includes No. 2 Buhler and Hays \nJust as was the case for Abilene, one big play seemed to spark Washington County’s comeback. Already down 18-6 midway through the fourth quarter after a touchdown pass from Konnor Penning to Cole Thompson in the third, the Tigers needed to make a stand. \nRiley County drove inside the Tiger five and were threatening to put the game away. Instead, the Falcons fumbled a direct snap to a back and Penning scooped up the ball at the 4 and raced 96 yards for a touchdown. \n“That was huge,” Thompson said. “We’re down and they’re getting ready to score. After we got that touchdown, you just got the sense that was all we needed.” \nActually, Washington County needed to get the ball back and the defense came up big again as Jerrod Hoover picked off a pass inside Falcon territory in the closing minutes. With less than a minute to play, Penning found Jae Eaton for a 20-yard score after a touchdown pass to Thompson on the previous play was knocked away at the last second. \n“It’s just a great group of kids,” Thompson said. “They want to work hard and are very motivated.” \nFRIDAY NIGHT STARS \n-- Maur Hill’s Harry Trotter set a school record with 430 yards rushing and four touchdowns in the Ravens’ 62-2 win over Atchison County. \n-- Rossville stayed undefeated with a 63-12 blowout win over Oskaloosa. Tucker Horak continued his huge senior season, completing 14 of 17 passes for 196 yards and three touchdowns and rushing for 158 yards and three scores on just six carries. \n-- Hunter Howerton ran for three touchdowns and Keenan Baird had a rushing and receiving touchdown as Silver Lake handled Osage City 53-9 to stay undefeated. \n-- Colony-Crest scored on a fourth-down play as time expired to beat Chetopa 50-46, erasing an early 20-0 deficit with the furious comeback. Evan Godderz completed 19 of 24 passes for 233 yards and six touchdowns and also ran for 111 yards and a score. \n-- Mission Valley and Northern Heights set up a district-title showdown with big wins. Clay Phillips ran for 175 yards and two scores as the Vikings topped Chase County 42-19 and Tucker Litke threw for 223 yards and three touchdowns as Heights blanked Herington 30-0. JD Johnson caught three passes for 144 yards and two scores for the Wildcats. \n-- Zack Lux ran for 139 yards and two touchdowns and Royal Valley’s special teams produced 16 points as the Panthers rallied past Perry-Lecompton 35-21. \n-- Rock Creek’s Carson Becker rushed for 198 yards and two touchdowns as the Mustangs beat St. Marys 46-21. \n-- Nemaha Central continued its undefeated season, picking up a 43-14 win over Centralia as Ryan Hasenkamp threw for 212 yards and three touchdowns. \n-- Jefferson North’s Bryce Noll completed only six passes, but five of them went for touchdowns as the Chargers beat Valley Falls 44-14. Noll, who only attempted eight passes, threw for 152 yards. Brayden Summers caught two of the scores and had 105 yards on three catches. \n-- Lebo picked up its first win over Madison in nearly a decade as Drew Ott threw for 199 yards and four touchdowns with Peyton Baldwin catching two scores and finishing with 116 receiving yards in the 46-18 win. \n-- Chase Carey and Trevor Schwerdt each ran for more than 100 yards and three touchdowns as Blue Valley-Randolph raced past Southern Cloud 66-20. \n-- Atchison stayed undefeated with a 30-14 win over Tonganoxie as Wykeen Gill threw for 224 yards and three touchdowns and ran for 123 yards and two scores. \nBrent Maycock can be reached at (785) 295-5662 or brent.maycock@cjonline.com .Follow Brent on Twitter @CockyHawk91 .", "external_links": [], "published": "2015-10-19T04:17:00.000+03:00", "crawled": "2015-10-19T06:49:46.117+03:00", "highlightTitle": ""}