{"organizations": [], "uuid": "8b85a93bde18c0a2ab779b05ccf9dd3ef10b495f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theguardian.com", "main_image": "https://i.guim.co.uk/img/media/8c47afe15ac810bba144225381be22acc0b0eab7/376_385_3069_1841/master/3069.jpg?w=1200&amp;q=85&amp;auto=format&amp;sharp=10&amp;s=1d70308737356ac80d43e0afe40e2039", "site_section": "http://www.theguardian.com/us", "section_title": "Latest US news, world news, sports and opinion from the Guardian | theguardian.com | The Guardian", "url": "http://www.theguardian.com/sport/2015/oct/12/chase-utley-may-play-against-mets-despite-two-game-ban", "country": "GB", "title": "Chase Utley left out of Dodgers line-up to face Mets | Sport", "performance_score": 0, "site": "theguardian.com", "participants_count": 3, "title_full": "Chase Utley left out of Dodgers line-up to face Mets | Sport | The Guardian", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:02:00.000+03:00", "replies_count": 2, "uuid": "6ffdda981982e75d69994e128d32ca4926404bd2"}, "author": "Associated Press", "url": "http://www.theguardian.com/sport/2015/oct/12/chase-utley-may-play-against-mets-despite-two-game-ban#post-0", "ord_in_thread": 0, "title": "Chase Utley left out of Dodgers line-up to face Mets | Sport", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Chase Utley was not in the Los Angeles Dodgers’ starting line-up for game three of their NL Division Series against the New York Mets on Monday night.\nInstead of Utley, Los Angeles manager Don Mattingly started Howie Kendrick at second.\nUtley appealed his two-game suspension assessed by Major League Baseball on Sunday night for an illegal slide in game two, which broke the right leg of Mets shortstop Ruben Tejada. The appeal meant the penalty could not start until after a hearing and a decision.\nUtley’s hearing didn’t take place on Monday. The sides were still trying to agree to a schedule.\nRelated: On NYC's sporting victimhood ... and why Chase Utley is an American hero\nKendrick is 1 for 6 against Mets game three starter Matt Harvey, while Utley is 6 for 18. “I’m a little surprised,” Mets manager Terry Collins said. “Don knows his team better than me, but I got the same stats he’s got, and I know he swings the bat pretty good against Matt Harvey.”\nCollins also did not expect any attempts by his players to retaliate. He said Harvey had “been told.”\n“This is too big a game. We need to not worry about retaliating,” he said. “We need to worry about winning. ... The one thing we can’t do is cost ourselves a game, and this particular game, because we’re angry. We can play angry, but we’ve got to play under control.”\nUtley was penalized on Sunday by Joe Torre, MLB’s chief baseball officer, who said Utley’s takeout of Mets shortstop Ruben Tejada in game two of the series was an “illegal slide.”\nThe tying run scored on the play, the first of four runs in the inning, and the Dodgers went on to win 5-2 and tie the series at one game apiece. If umpires had ruled the slide an illegal takeout, they could have called an inning-ending double play, which would have left the Mets ahead 2-1.\nUtley asked the union to appeal the discipline. His agent, Joel Wolfe, said “a two-game suspension for a legal baseball play is outrageous and completely unacceptable.”\n“The players association and my agent are handling the appeals process,” Utley said in a statement Monday. “I have nothing more to say other than to reiterate that I feel terrible about Ruben’s injury. Now my teammates and I are focused on Game 3 and doing everything we can to win this series.”\nUnder the sport’s collective bargaining agreement, the hearing is to start within 14 days of MLB receiving the appeal. Penalties are held in abeyance pending a decision on the appeal.\nThen with Philadelphia, Utley also angered the Mets in 2010 when he slid hard into Tejada. Harvey hit Utley on the back with a 95 mph fastball at Citi Field on 14 Aprilafter Philadelphia’s David Buchanan plunked Wilmer Flores and Michael Cuddyer, both on the left hand.\nMcHale had been MLB’s executive vice president of administration from 2002 until April, when he received his new title. He has continued his role of hearing appeals of on-field discipline.\nBefore joining the commissioner’s office, McHale had been Colorado’s executive vice president of baseball operations, Detroit’s chief executive officer and Tampa Bay’s chief operating officer.", "external_links": [], "published": "2015-10-13T03:02:00.000+03:00", "crawled": "2015-10-13T00:41:29.642+03:00", "highlightTitle": ""}