{"organizations": ["CLEMSON", "Clemson Email", "Clemson Tigers", "Clemson", "Tigers", "Tony Elliott-Jeff Scott", "Boston College"], "uuid": "97849959e3cc1b69266099c864e84c0b7514353c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.postandcourier.com", "main_image": "http://www.postandcourier.com/storyimage/CP/20151016/PC20/151019533/AR/0/AR-151019533.jpg", "site_section": "http://www.postandcourier.com/apps/pbcs.dll/section?Category=PC2007&template=rss", "section_title": "National Sports", "url": "http://www.postandcourier.com/article/20151016/PC20/151019533/1032&ampsource=RSS", "country": "US", "title": "Inside the Game: Boston College at No. 5 Clemson", "performance_score": 0, "site": "postandcourier.com", "participants_count": 0, "title_full": "Inside the Game: Boston College at No. 5 Clemson", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T15:00:00.000+03:00", "replies_count": 0, "uuid": "97849959e3cc1b69266099c864e84c0b7514353c"}, "author": "", "url": "http://www.postandcourier.com/article/20151016/PC20/151019533/1032&ampsource=RSS", "ord_in_thread": 0, "title": "Inside the Game: Boston College at No. 5 Clemson", "locations": ["Florida State", "Georgia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Chad Morris", "Jeff Smith", "Troy Flutie", "Deshaun Watson", "Jordan Leggett", "Aaron Brenner", "GWINN", "Dabo Swinney"], "text": "Email @Aaron_Brenner Oct 16 2015 7:00 am Clemson quarterback Deshaun Watson (4) celebrates the win. The Clemson Tigers played host to the Georgia Tech Yellow Jackets at Memorial Stadium in Clemson Saturday, October 10, 2015.GWINN DAVIS / FOR POST AND COURIER × CLEMSON – Here are the four factors No. 5 Clemson ought to focus on when closing out its three-game homestand, and preparing to embark on a stretch of three road games and a Florida State showdown, with Saturday night’s 7 p.m. kickoff vs. Boston College: Better in the red It seems like Clemson’s offense has been more consistent in the red zone, but that hasn’t necessarily been the case. The Tigers have scored points on 13 of 16 trips inside the 20-yard-line, and just nine touchdowns. Tight end Jordan Leggett’s emergence has helped significantly, and Deshaun Watson continuing to regain strength in his knee should lift the percentages as well. Pick on the rookie Either way, Boston College will have a first-year quarterback at the controls, be it redshirt Troy Flutie or true freshman Jeff Smith. Either way, that quarterback will be facing the daunting challenge of a night game at Memorial Stadium, where the host defense has allowed more than 300 yards just three times in their last 13 games dating to last year. Boston College is completing 46 percent of its passes; Clemson’s opponents so far have completed 46 percent of their passes. Control the clock It’s actually been one of Boston College’s better qualities as an overall team, is winning the time of possession. Meanwhile, Clemson hasn’t greatly improved its lot in this territory – Chad Morris was never concerned with ranking highly the category, but the Tony Elliott-Jeff Scott contingent has been more focused on the run game, which theoretically should mean hogging the ball over the course of 60 minutes. Don’t feed doubters For anyone who’d forgotten how sensitive the “Clemsoning” fabric was around the Tigers’ football complex and fanbase – and how wrong the term is considering Clemson’s remarkable consistency the past four years – Dabo Swinney reminded everybody with his rant last Saturday. Now the Tigers can’t fall on their face in a game they should win easily, provided the defense takes advantage of a massive mismatch. Prediction Clemson 34, Boston College 6 - Aaron Brenner", "external_links": [], "published": "2015-10-16T15:00:00.000+03:00", "crawled": "2015-10-16T15:34:15.701+03:00", "highlightTitle": ""}