{"organizations": [], "uuid": "45f004c0c32d9713d376588f605cfd6a0a261156", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "http://s2.reutersmedia.net/resources/r/?m=02&d=20151008&t=2&i=1085387644&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXNPEB9704G", "site_section": "http://www.reuters.com/news/sports", "section_title": "Sports News, Highlights &amp; Coverage | Reuters.com", "url": "http://www.reuters.com/article/2015/10/08/us-baseball-playoffs-idUSKCN0S209920151008", "country": "US", "title": "Cubs beat Pirates after another Arrieta pitching gem", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Cubs beat Pirates after another Arrieta pitching gem | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T08:23:00.000+03:00", "replies_count": 0, "uuid": "45f004c0c32d9713d376588f605cfd6a0a261156"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/10/08/us-baseball-playoffs-idUSKCN0S209920151008", "ord_in_thread": 0, "title": "Cubs beat Pirates after another Arrieta pitching gem", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Chicago Cubs celebrated their first postseason win in 12 years when they beat the Pittsburgh Pirates 4-0 in the Major League Baseball playoffs on Wednesday.\nChicago pitcher Jake Arrieta struck out 11 in a complete game shutout while Kyle Schwarber and Dexter Fowler both blasted home runs as the Cubs clinched the one-off National League Wild Card game.\nFor the Cubs, who have not won the World Series since 1908 - the longest drought in North American professional sports - their next opponents will be the St. Louis Cardinals, who they meet in a best-of-five division series, starting Friday.\nThe last time the Cubs won a playoff game was in 2003, while the last time they made the World Series was 1945.\nArrieta, who led the majors with 22 regular season wins, continued his brilliant form, giving up only four hits at PNC Park in Pittsburgh in the first postseason game of his career.\nHe outdueled his counterpart Gerrit Cole, who lasted only five innings, as the Pirates bowed out in the Wild Card game for the second successive year.\nArrieta was in trouble only once, in the sixth inning, when Pittsburgh loaded the bases with one out before left fielder Starling Marte grounded out into a double play.\nArrieta's most harrowing moment came at the plate, in the seventh inning, when he was struck in the left hip by Pittsburgh reliever Tony Watson.\nArrieta had previously struck two Pirates -- accidentally, he said - and the incident led to a dugout-clearing melee and the ejection of Pittsburgh first baseman Sean Rodriguez, who appeared to throw a punch.\nArrieta said afterwards that he expected to be hit in retaliation.\n“I hit two guys unintentionally,” Arrieta said afterwards in an on-field interview. “I’m never trying to hurt or hit anybody … I expected that. They’re going to take care of their own guys. It’s understandable.”\nArrieta, 29, came into the game with a mind-boggling 0.75 ERA since the All-Star break, and his regular season form proved no fluke as he focused on keeping the ball in the lower part of the strike zone.\n\"I'm trying to be as aggressive as I can,\" he said. \"I’ve got some good movement on my sinking fastball and I rely on that. I just want to be down (in the strike zone) because I know if I do that I’ll induce some weak contact.\"\nArrieta was backed by a sporadic but dangerous offense, led by Schwarber, whose two-run home run to right field in the third inning sailed out of the park and traveled an estimated 450-feet.\nFowler hit a solo run in the fifth inning.\nThe defeat was another bitter pill for Pittsburgh, eliminated despite posting the second-best regular season record in the majors.\n\"Sport's hard, life's not fair,\" said Pirates manager Clint Hurdle.\n(Reporting by Andrew Both in Cary, North Carolina; Editing by Julian Linden/Amlan Chakraborty)", "external_links": [], "published": "2015-10-08T08:23:00.000+03:00", "crawled": "2015-10-08T07:30:47.413+03:00", "highlightTitle": ""}