{"organizations": [], "uuid": "0b33c0ad6965c4167476daa4a4890992f8181ca6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nytimes.com", "main_image": "http://static01.nyt.com/images/2015/10/09/sports/09FIFAEXPLAIN/09FIFAEXPLAIN-facebookJumbo.jpg", "site_section": "http://www.nytimes.com/services/xml/rss/nyt/InternationalSports.xml", "section_title": "NYT &gt; International Sports", "url": "http://www.nytimes.com/2015/10/09/sports/soccer/the-fifa-scandal-questions-and-answers.html", "country": "US", "title": "The FIFA Scandal: Questions and Answers", "performance_score": 2, "site": "nytimes.com", "participants_count": 1, "title_full": "The FIFA Scandal: Questions and Answers - The New York Times", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T01:06:00.000+03:00", "replies_count": 0, "uuid": "0b33c0ad6965c4167476daa4a4890992f8181ca6"}, "author": "Sam Borden", "url": "http://www.nytimes.com/2015/10/09/sports/soccer/the-fifa-scandal-questions-and-answers.html", "ord_in_thread": 0, "title": "The FIFA Scandal: Questions and Answers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Sepp Blatter, the president of FIFA, world soccer’s governing body, was suspended Thursday. So, too, was Michel Platini, a vice president of FIFA and the head of UEFA, which runs European soccer. Two other soccer executives were suspended as well . The punishments, particularly Mr. Blatter’s, were seen by many as a watershed moment in the continuing global soccer scandal, and that may well be the case. But, as is typical with FIFA, things are more complex than they seem.\nWho suspended Mr. Blatter?\nContinue reading the main story Related Coverage Times Topic: International Federation of Association Football (FIFA) FIFA President Sepp Blatter and Other Top Officials Suspended OCT. 8, 2015 Sports of The Times: Ways Forward for FIFA: A Frank Accounting, and a Fresh Start OCT. 8, 2015 Coca-Cola, Visa, McDonald’s and Anheuser-Busch Call On FIFA’s Sepp Blatter to Resign OCT. 2, 2015 Ending an Albania-Serbia Game and Inciting a Riot, With a Joystick OCT. 7, 2015 Success Is No Longer Foreign to East Timor, but the Players Are OCT. 1, 2015 In 2012, FIFA constructed a two-chambered independent ethics committee to oversee the organization’s governance. Thursday’s suspensions were handed down by Hans-Joachim Eckert, a German judge who heads the adjudicatory chamber of the ethics committee. Mr. Eckert received information from the investigative chamber of the committee before making his decision and said the suspensions were largely based on the fact that Swiss authorities are investigating Mr. Blatter and Mr. Platini for behavior related to at least two financial transactions.\nContinue reading the main story Timeline The Rise and Fall of Sepp Blatter Scandal and accusations have dotted the FIFA reign of Sepp Blatter.\nOPEN Timeline How did Mr. Blatter react?\nAccording to those at FIFA’s headquarters in Zurich, Mr. Blatter was stunned; he had expected Mr. Eckert to deliberate longer. There was no dramatic reveal of the news to Mr. Blatter, either: Shortly after the ethics committee informed Mr. Blatter’s lawyer that he had been suspended, FIFA publicly released the decision on its website and Mr. Blatter read the full text of the decision on his computer.\nWhat does the suspension mean?\nIn short, it means Mr. Blatter cannot do anything with FIFA. His office has been shuttered (but not cleaned out, so the various medals and FIFA-emblazoned sugar packets are not going anywhere yet) and he is not allowed to represent the organization in any capacity. No meetings. No conference calls. No interviews. Mr. Blatter isn’t even allowed to go to a soccer game if it could be construed that he is there in any kind of official capacity. The same ban applies to Mr. Platini and the other suspended officials, the former general secretary Jérôme Valcke and the former FIFA vice president Chung Mong-joon.\nWhat happens next?\nMr. Blatter and the other suspended officials have two days to officially appeal the decision to FIFA’s appeals committee and must submit their actual appeal within seven days. They can also appeal to the Court of Arbitration for Sport. The suspensions are provisional, which means they can last up to 90 days (and then be extended for as long as another 45) while the ethics committee considers its final decision. In other words, they are placeholder suspensions — a very, very rough equivalent to a defendant not being granted bail before his trial begins.\nCould the suspensions be revoked?\nContinue reading the main story Sports Newsletter Get the big sports news, highlights and analysis from Times journalists, with distinctive takes on games and some behind-the-scenes surprises, delivered to your inbox every week.\nThey could. Mr. Eckert and his colleagues, as well as the investigatory chamber, will continue their own inquiries into Mr. Blatter and Mr. Platini and it could ultimately be determined that the evidence is not strong enough to merit an official ban. It is also possible that the criminal investigation by Swiss authorities (or even United States officials) could turn up new information that aids the ethics committee’s review.\n Who will run FIFA in the meantime?\nBy FIFA law, the most senior vice president becomes the interim president. Issa Hayatou of Cameroon, the head of African soccer’s governing body, has assumed the role and is expected to arrive in Zurich early next week. Mr. Hayatou is not expected to work out of Zurich full time — and he will not sit in Mr. Blatter’s office — but he will lead an emergency meeting of FIFA’s executive committee that is expected to take place in the next two weeks. The day-to-day operations of FIFA are handled by Markus Kattner, who has been the acting secretary since Mr. Blatter’s top deputy, Mr. Valcke, was relieved of his duties last month in an unrelated ethics case.\nWill this affect Russia hosting the World Cup in 2018 or Qatar hosting in 2022?\nThe short answer: probably not. These particular charges against Mr. Blatter and Mr. Platini are not related to the voting for those tournaments, though a separate investigation involving the Swiss authorities continues. It is all but certain that the 2018 tournament will go ahead as planned, since qualifying has begun and the draw for Europe — without Russia, which qualifies automatically as host — has been set. The Qatar tournament’s status is less sturdy, but there have been no indications that a new vote is in the offing.\nHow has the global sports community reacted?\nWith a big pile-on, as you might expect. Among other condemnations, Thomas Bach, president of the International Olympic Committee, said “enough is enough” and called for a complete overhaul of FIFA’s governance. Chris Eaton, the executive director of the International Center for Sport Security, said, “Football, not just FIFA, stands on the precipice of disaster.” FIFPro, which is the union for international soccer players, said it had “little or no confidence in the ability of FIFA to reform from within.”\nHow does this affect February’s special election for FIFA’s next president?\nMr. Platini was the leading candidate, but now it is unclear whether he will be allowed to run. The same is true for Mr. Chung. Candidates are supposed to declare by Oct. 26. That deadline could be moved by FIFA’s executive committee and, hypothetically, the election could be delayed, too. Prince Ali bin al-Hussein of Jordan ran against (and lost to) Mr. Blatter in May, and he has said he will run again. The executive committee could, however, also vote to change FIFA’s statutes and allow outsiders — people from outside the soccer community — to enter the race. That could significantly alter the field.\nLoading... Go to Home Page »\nSite Index The New York Times News World U.S. Politics N.Y. Business Tech Science Health Sports Education Obituaries Today's Paper Corrections Opinion Today's Opinion Op-Ed Columnists Editorials Contributing Writers Op-Ed Contributors Opinionator Letters Sunday Review Taking Note Room for Debate Public Editor Video: Opinion Arts Today's Arts Art & Design ArtsBeat Books Dance Movies Music N.Y.C. Events Guide Television Theater Video Games Video: Arts Living Automobiles Crossword Food Education Fashion & Style Health Jobs Magazine N.Y.C. Events Guide Real Estate T Magazine Travel Weddings & Celebrations Listings & More Classifieds Tools & Services Times Topics Public Editor N.Y.C. Events Guide TV Listings Blogs Cartoons Multimedia Photography Video NYT Store Times Journeys Subscribe Manage My Account Subscribe Subscribe Times Insider Home Delivery Digital Subscriptions NYT Opinion Crossword Email Newsletters Alerts Gift Subscriptions Corporate Subscriptions Education Rate Mobile Applications Replica Edition International New York Times", "external_links": ["http://static01.nyt.com/images/2015/10/03/sports/03SOCCERweb/03SOCCERweb-thumbStandard.jpg", "http://static01.nyt.com/images/2015/10/07/sports/07ALBANIAweb1/07ALBANIAweb1-thumbStandard.jpg", "http://static01.nyt.com/images/2015/10/09/sports/09MACURweb1/09MACURweb1-thumbStandard.jpg", "http://a1.nyt.com/assets/article/20151008-165249/images/foundation/logos/", "http://www.fifa.com/governance/news/y=2015/m=10/news=statement-by-issa-hayatou-acting-fifa-president-2709921.html", "http://static01.nyt.com/images/2015/05/25/sports/sepptimeline-1/sepptimeline-1-master495.jpg", "http://static01.nyt.com/images/2015/10/02/sports/02TIMORweb1/02TIMORweb1-thumbStandard.jpg", "http://static01.nyt.com/images/2015/10/09/sports/soccer/09Fifa-web/09Fifa-web-thumbStandard.jpg"], "published": "2015-10-09T01:06:00.000+03:00", "crawled": "2015-10-09T00:46:33.960+03:00", "highlightTitle": ""}