{"organizations": ["Associated Press", "Rutgers", "Ohio State"], "uuid": "72ddb7c743f674f75fea95709e6c06d57a023e42", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.indystar.com", "main_image": "http://www.gannett-cdn.com/-mm-/7b3704eefb01ec42f795bc8d0a31ec88b3faa17e/c=0-105-1992-1230&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/24/Indianapolis/Indianapolis/635813271799855041-USATSI-8882520-114835588-lowres.jpg", "site_section": "http://rssfeeds.indystar.com/indystar/collegesports", "section_title": "Indystar - College Sports", "url": "http://www.indystar.com/story/sports/college/2015/10/24/big-ten-football-roundup-penn-state-edges-maryland/74559786/", "country": "US", "title": "Big Ten football roundup: Ohio State routs Rutgers to remain unbeaten", "performance_score": 0, "site": "indystar.com", "participants_count": 0, "title_full": "Big Ten football roundup: Ohio State routs Rutgers to remain unbeaten", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T05:47:00.000+02:00", "replies_count": 0, "uuid": "72ddb7c743f674f75fea95709e6c06d57a023e42"}, "author": "", "url": "http://www.indystar.com/story/sports/college/2015/10/24/big-ten-football-roundup-penn-state-edges-maryland/74559786/", "ord_in_thread": 0, "title": "Big Ten football roundup: Ohio State routs Rutgers to remain unbeaten", "locations": ["USA"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Big Ten football roundup: Ohio State routs Rutgers to remain unbeaten Associated Press 11:47 p.m. EDT October 24, 2015 Ohio State vs. Rutgers Big Ten football (Photo: USA TODAY Sports) CONNECT 10 TWEET LINKEDIN 1 COMMENT EMAIL MORE No. 1 Ohio State 49, Rutgers 7 \nPISCATAWAY, N.J. - J.T. Barrett threw three touchdown passes and ran for two scores in his first start of the season, leading No. 1 Ohio State to a 49-7 victory against Rutgers on Saturday night and ensuring at least two weeks of quarterback stability for the Buckeyes. \nOhio State (8-0, 4-0 Big Ten) extended its winning streak to 21 games, best in the nation, and heads into its off week with no doubt who the starting QB will be when Minnesota comes to Columbus on Nov. 7. \nIt will be a nice change for coach Urban Meyer, who started Cardale Jones in the first seven games of the season before making the switch to Barrett this week. Facing one of the worst defenses in the Big Ten, Barrett was near flawless. He was 14 for 18 for 223 yards and ran for 101 yards on 13 carries. Jones entered in the fourth quarter when the score was 49-0. \nRutgers (3-4, 1-3) missed a short field goal on its first possession and didn’t get past the Ohio State 40 again until late in the fourth quarter. \nThe next phase of Ohio State’s long-running quarterback soap opera had Barrett as the leading man for the Buckeyes. Meyer made the expected switch this week after the Big Ten player of the year had lost a preseason competition to Jones, who led the Buckeyes to the national championship after Barrett broke his ankle against Michigan last year. \nJones was inconsistent as a starter, but not until the last two games when Barrett accounted for seven touchdowns in relief did he really make a case to reclaim the job. \nBarrett gives the Buckeyes more of a running threat and a better ball-handler on their zone-read plays. He scooted 39 yards with a keeper on his first carry of the game and several times had Rutgers defenders grabbing at Buckeyes who did not have the ball. \nOhio State was run-heavy much of the first half, keeping it on the ground on 16 of its first 20 plays. \nBarrett doesn’t have the powerful arm that Jones brings to the offense, but he is no liability in the passing game. When the Buckeyes did open it up, they found some big plays against Rutgers’ injury depleted secondary. Barrett hooked up with Michael Thomas on short throw that turned into a 50-yard touchdown to make it 14-0 in the second quarter. \nBarrett was a little short on a deep sideline throw to Braxton Miller, but the quarterback-turned receiver made a juggling 45-yard grab. A couple plays later, Barrett scooted in from a yard and it was 21-0. \nThe deep ball looked better from Barrett next time. He found Curtis Samuel, who grew up in nearby Brooklyn, in the end zone for a 30-yard TD to make it 28-0 less than two minutes into the second half. \nThe Buckeyes first trip ever to Rutgers drew a sellout crowd of 53,111 at High Point Solutions Stadium and their scarlet-clad fans blended in nicely with the Rutgers fans — until a corner of the stadium broke into an “O-H! I-O!” chant. By the end, they were pretty much the only ones left. \nBarrett made it 35-0 with his second touchdown run and a 1-yard touch-pass to Jalin Marshall made it 42-0 with 4:34 left in the third quarter. \nIt was the first time since 2002 the Scarlet Knights hosted the No. 1 team in the country and the first time as a member of the Big Ten. The prime time, nationally televised game was exactly what Rutgers hoped for when it joined the Big Ten a couple years ago. The move has no doubt been good for the bottom line, but on the football field the Scarlet Knights are still running a deficit against the Big Ten’s best. \nOhio State has outscored Rutgers 105-24 the past two seasons. Penn State 31, Maryland 30 \nBALTIMORE - Christian Hackenberg threw for 315 yards and three touchdowns, and Penn State beat Maryland 31-30 on Saturday to spoil the debut of interim coach Mike Locksley. \nAlthough Hackenberg completed only 13 passes, many of them were big-gainers. Chris Godwin had four catches for 135 yards and DaeSean Hamilton totaled 96 yards on his five receptions. \nHackenberg became the school career leader in completions (608) and yards passing (7,453), displacing Zach Mills in both categories. \nPenn State (6-2, 3-1 Big Ten) improved to 36-2-1 against the Terps, but Maryland’s determined effort before a spirted crowd of 68,948 could help turn this into a regional rivalry. \nLocksley was promoted from offensive coordinator after head coach Randy Edsall was fired on Oct. 11. Although Maryland (2-5, 0-3) led in the fourth quarter and played its best game in a month, the result was all too familiar. \nEdsall was dismissed after a three-game stretch in which the Terrapins were outscored 122-34. Maryland played well in this one but was undone by five turnovers, including three interceptions by Perry Hills. \nHills ran for 128 yards and completed 19 of 28 passes for 225 yards. His final interception came on a deflected pass with 1:15 remaining. \nPenn State went up 31-27 with 13:39 left when Hackenberg tossed a 27-yard touchdown pass to Geno Lewis. \nMaryland cut the gap with a field goal, and then recovered a fumble on the ensuing kickoff. But Hills fumbled it back as he was hit while throwing. \nThe Terrapins got the ball following a missed field goal try. Locksley opted to go for it on fourth-and-2 from the Maryland 36, and Hills was intercepted by Trevor Williams with 7:51 to go. \nThat wouldn’t be the last turnover for the Terrapins, who wore throwback uniforms patterned after the 1961 team. That was the year in which Maryland earned its lone win over the Nittany Lions at home. \nFor a while, it appeared as if that 44-year drought would end. \nMaryland moved 68 yards on its first possession of the third quarter to take a 20-17 lead. After Hills ran 36 yards to the 10, Brandon Ross scored on third down. \nHackenberg responded by completing a pass to Godwin for 31 yards, then throwing a 20-yarder to Hamilton for a touchdown. Both passes were put up for grabs, and on both occasions the receiver made the play. \nThe back-and-forth duel extended into the next drive, when Hills directed an 88-yard march that ended with a 10-yard touchdown pass to DeAndre Lane, making it 27-24. \nThat laid the groundwork for an intense fourth quarter. \nPenn State led 17-13 at halftime despite being limited to 15 yards rushing and converting only once on third down. \nHackenberg went 7 for 16 before intermission, but his completions went for 196 yards — including a 37-yarder to Godwin, who made an outstanding one-handed catch in the end zone while his defender was being called for pass interference. \nMaryland led 13-7 in the second quarter despite committing two turnovers inside the Penn State 20. Northwestern 30, Nebraska 28 \nLINCOLN, Neb. - This loss didn’t come in the final seconds like the others, but it was just as painful to Nebraska. \nTommy Armstrong Jr.’s two-point conversion pass that would have tied the game was tipped away, and the Cornhuskers couldn’t get the ball back before the clock ran out on a 30-28 loss to Northwestern on Saturday. \nNebraska (3-5, 1-3 Big Ten) has five losses by a total of 13 points in what is trending toward the program’s worst season since Bill Callahan’s 2007 team went 5-7. \n“We’ve got to make sure we keep grinding,” Armstrong Jr. said. “We can either give up or we can keep riding this season out and keep working together.” \nClayton Thorson’s 37-yard touchdown pass to Dan Vitale and Jack Mitchell’s third field goal gave the Wildcats (6-2, 2-2) an eight-point lead in the fourth quarter and they hung on to become bowl eligible for the first time since 2012. \nNebraska won on a Hail Mary the last time Northwestern visited Memorial Stadium. In the teams’ five meetings since the Huskers joined the Big Ten, four have been decided by three points or less. \n“Football is a crazy game,” Nebraska receiver Jordan Westerkamp said. “Lots of ups and downs. It’s kind of a roller coaster ride, and we’re on it right now in full force, but we’ll be OK.” \nThe loss spoiled an afternoon when Tom Osborne and the 1995 national championship team were honored in a pregame ceremony. The ‘95 team, considered one of the greatest in college football history, walked out of the tunnel ahead of the current Huskers and formed a corridor for them to run through. \nThe Wildcats bounced back from consecutive losses of 38-0 to Michigan and 40-10 to Iowa. \nThorson passed for 177 yards and ran for a career-high 126. The Wildcats didn’t do a lot offensively early but led 17-12 at half. Thorson broke runs of 68 and 49 yards to set up scores, and Nick VanHoose returned an interception 72 yards for a touchdown. \nWe stuck together and found a way to make some plays in the first half and make it a game,” Northwestern coach Pat Fitzgerald said. “Great team win, huge team win to get us over the hump.” \nMitchell’s 27-yard field goal put Northwestern up 30-22, but the Huskers drove 75 yards in eight plays to pull within two points. Armstrong’s tipped two-point pass to Stanley Morgan Jr. fell incomplete, and Northwestern was able to run out the final 4:18. \nThe Huskers led 22-20 on Drew Brown’s 48-yard field goal to start the fourth quarter. \nNorthwestern went ahead with a long drive that saw Thorson convert a couple of third-down passes before he hit Vitale with a pass along the sideline for 37 yards. Vitale dived into the end zone, with the play withstanding a video review. \nAfter Nebraska went three-and-out, Mitchell kicked the field goal that put the Wildcats up by eight points. \nArmstrong hit Brandon Reilly for 37 yards on a fourth-and-6 before he ran in from 3 yards to make it a two-point game, but he couldn’t convert on the try for two points. \nNebraska won at Minnesota on the road in its previous game, and first-year coach Mike Riley said he thought the Huskers had overcome the inconsistency they showed on offense earlier in the season. \nThat wasn’t the case. The Huskers were limited to a season-low 82 yards rushing, and Armstrong threw 48 passes, completing 24 for 291 yards. \nNebraska must win three of its last four to play in a bowl. \n“I told them we’re going to coach football and practice football on Monday and we’re going to continue to work to get better,” Riley said. “Everyone who wants to do that will be there. I think this group will be.” Wisconsin 24, Illinois 13 \nCHAMPAIGN, Ill. - Bart Houston came off the bench to throw for 232 yards and two touchdowns, and Wisconsin beat Illinois 24-13 on Saturday. \nWisconsin starting quarterback Joel Stave left the game late in the first quarter with a head injury. But the Badgers (6-2, 3-1 Big Ten) didn’t miss a beat with Houston. \nThe junior found his favorite target, Alex Erickson, for a 9-yard touchdown with 9:42 left in the game to give Wisconsin a 24-13 lead and effectively put the game away. \nErickson led the Badgers in receiving with 10 catches for 96 yards and had four rushes for 81 yards. \nWes Lunt had 278 yards passing with one interception for Illinois (4-3, 1-2). \nThe Badgers also lost starting center Dan Voltz in the second half with a leg injury. \nOn the stat sheet, Wisconsin looked in charge midway through the third quarter. The Badgers had advantages in yards, plays run and possession. \nBut Illinois was still well within range, trailing 17-13. \nThat all changed, though, over the next two possessions. \nWisconsin ground out a 13-play, 65-yard drive that chewed up 7 minutes and 39 seconds, and ended with a 9-yard touchdown pass from Houston to Erickson for a two-score advantage. \nThe Badger defense iced it when Lunt threw a ball that linebacker T.J. Edwards tipped and safety Michael Caputo picked off at the Badger’s 49. \nIllinois never threatened again. \nBefore Saturday, Houston had thrown just nine passes on the season. He quickly found a rhythm, using mostly short passes. \nSix plays after Stave’s exit, Houston threw to Robert Wheelwright, who reached over an Illinois defensive back to pull down a 23-yard touchdown pass. That gave Badgers their first lead at 7-3, less than a minute into the second quarter. \nIllinois was missing starting tailback Josh Ferguson for a second straight game after injuring his right shoulder against Nebraska. \nFreshman Ke’Shawn Vaughn was the only ball carrier for Illinois, finishing with 13 carries for 55 yards. Most of those yards came on Illinois’ only touchdown, a 36-yard burst through the middle with 7:48 left in the third quarter to give the Illini a 13-10 lead. \nThe Badgers stayed within a game of Iowa in the Big Ten West with games left against Rutgers, Maryland, Northwestern and Minnesota. None of those teams has a winning record in the conference. \nThe loss pushes the Illini two games back of Iowa and still looking for two wins to gain bowl eligibility. Illinois plays four of its last five on the road — with a home game against No. 1 Ohio State. CONNECT 10 TWEET LINKEDIN 1 COMMENT EMAIL MORE Read or Share this story: http://indy.st/1MZZDPy TOP VIDEOS", "external_links": [], "published": "2015-10-25T05:47:00.000+02:00", "crawled": "2015-10-25T16:10:52.215+02:00", "highlightTitle": ""}