{"organizations": ["Newcastle Print"], "uuid": "ef90ca206a7d96e35033915f5528835e0c597747", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "ca.news.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/Mzj6B34HN8LvzekYpRpzqg--/YXBwaWQ9eW5ld3NfbGVnbztpbD1wbGFuZTtxPTc1O3c9NjAw/http://media.zenfs.com/en_ca/News/Capress/MJS112-103_2015_160717_high.jpg", "site_section": "https://ca.news.yahoo.com/sports/rss/?format=rss", "section_title": "Yahoo News Canada - Sports Headlines", "url": "https://ca.news.yahoo.com/five-goal-sergio-aguero-halts-man-citys-slump-163500344--sow.html", "country": "US", "title": "Five-goal Sergio Aguero halts Man City's slump with 5-1 thrashing of Newcastle", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Five-goal Sergio Aguero halts Man City's slump with 5-1 thrashing of Newcastle", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T19:47:00.000+03:00", "replies_count": 0, "uuid": "ef90ca206a7d96e35033915f5528835e0c597747"}, "author": "", "url": "https://ca.news.yahoo.com/five-goal-sergio-aguero-halts-man-citys-slump-163500344--sow.html", "ord_in_thread": 0, "title": "Five-goal Sergio Aguero halts Man City's slump with 5-1 thrashing of Newcastle", "locations": ["Man City"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Sergio Aguero"], "text": "Print \nThe Canadian Press - Manchester City's Sergio Aguero celebrates after scoring his third goal during the English Premier League soccer match between Manchester City and Newcastle at the Etihad Stadium, Manchester, … more England, Saturday Oct. 3, 2015. (AP Photo/Jon Super) less LONDON - After yet another scare, Sergio Aguero masterminded a spectacular Manchester City comeback with five goals against Newcastle on Saturday. \nCity's 6-1 thrashing of Newcastle provided a reminder of the team's title credentials after back-to-back Premier League losses and a Champions League setback. \nAleksandar Mitrovic headed Newcastle in front in the 18th minute and it took Aguero until three minutes before half time to equalize. \nBut in a fizzing 13-minute spell at the start of the second half, Aguero added another four goals, while Kevin de Bruyne also got in on the scoring act for the leaders. \nAguero had only scored three goals in the first two months of the season before Saturday and his tally might be have greater had he not been taken off with around 25 minutes remaining. \n\"In other games he was maybe having a lot of chances but not scoring,\" City manager Manuel Pellegrini told the BBC. \"But today he returned to his normal amount of chances he creates but this time he scored. \n\"He was not upset about going off. He was having treatment at half time and it was a risk for him to finish the whole game.\" \nWithout a win after eight games, Newcastle sunk to the bottom of the standings. Northeast rival Sunderland moved ahead on goal difference with a 2-2 draw against West Ham. Sunderland threw away a 2-0 lead to leave Dick Advocaat still searching for his first victory over the campaign. \nIt's similarly bleak for Aston Villa, which is a point further ahead with just one win to its name so far. Marko Arnautovic gave Stoke a 1-0 victory at Villa Park. \nThere were victories for two of the surprise packages of the early season: Crystal Palace and Leicester. \nLeicester quickly bounced back from its first loss of the season last weekend by winning 2-1 at Norwich. Jamie Vardy scored a seventh goal in eight league games for Leicester. \nYohan Cabaye set up Yannick Bolasie's header and then scored from the penalty spot as Palace beat West Bromwich Albion 2-0 to move ahead of Leicester into third place on goal difference. \nA meeting between promoted clubs Bournemouth and Watford ended in a 1-1 stalemate. \nIn the late game, Chelsea was hosting Southampton. \n___ \nThis version corrects Aguero to scoring four not five goals in the second half.  ", "external_links": [], "published": "2015-10-03T19:47:00.000+03:00", "crawled": "2015-10-03T20:03:08.332+03:00", "highlightTitle": ""}