{"organizations": [], "uuid": "f683531874a8618068c76796f85055880ea701b5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thetimesnews.com", "main_image": "http://www.thetimesnews.com/Global/images/head/nameplate/thetimesnews_logo.png", "site_section": "http://www.thetimesnews.com/sports/elon-sports?template=rss&mime=xml", "section_title": "Elon Sports - The Times-News", "url": "http://www.thetimesnews.com/article/20151011/SPORTS/151019894/15218/SPORTS?rssfeed=true", "country": "US", "title": "Unfinished chances leave Elon tangled in Spiders' web", "performance_score": 0, "site": "thetimesnews.com", "participants_count": 1, "title_full": "Unfinished chances leave Elon tangled in Spiders' web", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T08:40:00.000+03:00", "replies_count": 0, "uuid": "f683531874a8618068c76796f85055880ea701b5"}, "author": "Adam Smith Times-News asmith@thetimesnews.com", "url": "http://www.thetimesnews.com/article/20151011/SPORTS/151019894/15218/SPORTS?rssfeed=true", "ord_in_thread": 0, "title": "Unfinished chances leave Elon tangled in Spiders' web", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted Oct. 11, 2015 at 12:37 AM Updated at 12:40 AM RICHMOND, Va. — Moving into potential scoring position wasn’t the problem for Elon. But producing on those various opportunities was, an insufficiency that contributed to the visiting Phoenix’s undoing in its 27-14 loss to nationally ranked Richmond in Colonial Athletic Association football Saturday at Robins Stadium. “We didn’t sustain drives,” Elon quarterback Daniel Thompson said. “That can’t happen if we expect to win a football game.” Elon made six trips into Richmond territory that generated nothing in terms of points, with two of the possibly promising possessions unfolding and then unraveling during the opening seven minutes. By the middle of the fourth quarter, when the Spiders led 27-0 and were in line to secure a shutout, the fruitlessness and unfinished frustration had become hair-pulling for Elon. Or ground-pounding in the case of Thompson. After flinging a pass under pressure, being taken down and watching as the throw toward the end zone turned into Richmond cornerback Ayo Ogunniyi’s second interception of the day, there was Thompson, the true freshman, slapping the FieldTurf surface several times before yanking off his helmet. “Beyond mad,” he said later, reliving that situation in which he tried to find receiver Tre Lennon. “That’s 100 percent my fault. I saw it and I under-threw it, short-armed it. I should’ve thrown it to the back of the end zone and given him a chance.” Meanwhile, Richmond’s balance and precision on offense made for another unyielding task. Seth Fisher (119 yards) and Jacobi Green (101 yards) combined on a rushing performance that allowed quarterback Kyle Lauletta (15 of 19 for 195 yards) to operate selectively with his passes. It was precision from the Spiders, ranked No. 16 in the Football Championship Subdivision, that placed increasing stress on Elon’s defense. “You try to eliminate all of the options before the play by looking at their formations and stuff,” Elon linebacker Corey Mitchell said. “But then when they’re running well and you know they’ve got the play-action pass off of that, it has its challenges.” Lauletta’s 16-yard touchdown keeper on a read play and Green’s 10-yard touchdown run capped efficient drives and helped push Richmond ahead 17-0 in the second quarter. At that juncture with more than 6½ minutes remaining until halftime, the Spiders were spreading the touches, moving briskly and thus having their way, holding a massive 237-18 total yards advantage that included 147 yards on the ground. “That’s the formula,” Elon coach Rich Skrosky said. “That’s a good feeling to have on the offensive side of the ball.” Page 2 of 2 - Early in the fourth quarter, Green scooted through a packed line of scrimmage on third-and-1 and scored from 12 yards out. That marked his second touchdown of the day and put Richmond up 27-0. A week ago, Elon tumbled behind 34-0 at nationally ranked New Hampshire before responding with a pair of scores, in some ways similar to how Saturday played out here. “Different but a lot the same,” Skrosky said. “Built a hole against a very good opponent.” Thompson (14 of 28 for 212 yards), who made his first start since the season opener and quarterbacked all but one of Elon’s 10 series, connected with Demetrius Oliver and Lennon on touchdown passes of 23 and 54 yards, respectively, during the game’s final six minutes. Thompson’s third throw of the game — after zipping a 19-yard dart to Corey Joyner that moved the Phoenix to Richmond’s 31-yard line — was picked off by Ogunniyi. That signified the start of Elon’s unfulfilled chances. Late in the second quarter, a 15-play Elon drive fizzled at the Richmond 15. After calling timeout and considering a medium-range field goal, Skrosky opted to try to convert a fourth-and-2 with 33 seconds left. Thompson misfired for tight end Doug Warrick and the Phoenix trailed 17-0 at the half. “I knew it was going to be tough to get down there (that close) multiple times, so that was really the decision,” Skrosky said. “Hindsight’s 20 / 20, but if you sustain the drive you look good.” Elon’s first two possessions of the second half reached the Richmond 32 and Richmond 30. Those drives resulted in a fourth-and-6 pass that didn’t work and then a Thompson quick-kick punt, leaving Elon still scoreless and down 20-0 at that point. ■ EXTRA POINTS …: Lennon’s four catches for 110 yards marked the best yardage output by an Elon receiver this season. He outfought Richmond cornerback Micah Keels on the deep ball that provided Elon’s second late-game touchdown in a span of 4:30. … Elon’s Oliver, a sophomore, collected the first touchdown of his college career. It was a score that required concentration. He reached up for the catch in the corner of the end zone while keeping his feet inbounds. … Richmond had a pair of 100-yard rushers in the same game for the first time since September 2007. “That’s awesome,” Richmond coach Danny Rocco said. “I think it’s really important to be able to control the ball that way.”… Thompson has been intercepted six times in Elon’s last six quarters. … Richmond’s five sacks were a season high. … The only turnover forced by Elon’s defense became a product of teamwork. Warren Messer pressured Richmond’s Lauletta, whose throw was deflected by John Silas, hustling in coverage. Adrian McClendon was there to intercept the tipped ball. … Elon dropped to 0-14 against ranked FCS opponents since November 2011. … Elon cornerback Greg Liggs Jr., a true freshman out of Southeast Guilford, didn’t return and was on crutches after a left-leg injury in the first quarter. … A dose of bad news arrived before kickoff, with Elon missing starters O’Shane Morris (offensive guard) and Johnathan Jackson (linebacker) due to injuries suffered in practice. Those absences moved offensive lineman Ty Alt and Matt Baker, a true freshman defender, into starting assignments. By Adam Smith", "external_links": [], "published": "2015-10-11T08:40:00.000+03:00", "crawled": "2015-10-11T13:15:49.436+03:00", "highlightTitle": ""}