{"organizations": [], "uuid": "872a620e96803bc272348a46487f429f2bf6609a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mailtribune.com", "main_image": "http://www.mailtribune.com/storyimage/MM/20151019/SPORTS/151019600/AR/0/AR-151019600.jpg", "site_section": "http://www.mailtribune.com/sports/college?template=rss&mime=xml", "section_title": "College Sports - MailTribune.com", "url": "http://www.mailtribune.com/article/20151019/SPORTS/151019600/101040/SPORTS?rssfeed=true", "country": "US", "title": "Happy holdovers", "performance_score": 0, "site": "mailtribune.com", "participants_count": 1, "title_full": "Happy holdovers", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T05:05:00.000+03:00", "replies_count": 0, "uuid": "872a620e96803bc272348a46487f429f2bf6609a"}, "author": "Jesse Sowa Corvallis Gazette-Times", "url": "http://www.mailtribune.com/article/20151019/SPORTS/151019600/101040/SPORTS?rssfeed=true", "ord_in_thread": 0, "title": "Happy holdovers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted Oct. 19, 2015 at 6:58 PM By Jesse Sowa Posted Oct. 19, 2015 at 6:58 PM » Social News CORVALLIS -- Gary Payton II liked what he heard from new coach Wayne Tinkle. Malcolm Duvivier wasn’t afraid of taking some “tough times” head on in rebuilding the Oregon State men’s basketball program. After giving at least some thought to possibly moving on to other opportunities after a coaching change, both ultimately decided that Corvallis was the place for them. A year later, Payton and Duvivier return as the Beavers’ top two players in points and minutes from 2014-15 after leading Oregon State to a 17-14 record. They hope to push their team to even greater heights this winter. Payton, whose father is arguably the best player in OSU history, said he had second thoughts when Craig Robinson, the Beavers coach whom he signed with, was let go in May 2014. He didn’t want to make a rash decision. Payton talked with Tinkle and was happy with the direction the program was headed. Payton learned from his new coach “that he’s not going to take (last) year to rebuild. He was going to get right into it and it’s gonna take defense to do that and have a great year.\" \"Me being a defensive player, that just stood out to me,\" Payton added. \"I just wanted to help him out with that and I chose to stay.” Duvivier saw his former teammate and roommate Hallice Cooke leave the program and transfer to Iowa State a few weeks before Robinson’s departure. Those changes made him think about swtiching schools. But being a person who doesn’t shy away from challenges, he decided to stay. “I like it here as a school in general. I thought I was in a good situation,” Duvivier said. “No matter what happened I felt like this was the right place for me.” Duvivier put a lot of trust in former OSU athletic director Bob De Carolis that it would all work out. “He was really coming to us for a lot of feedback, trying to find the coach,” Duvivier said. “I think he did a good job of listening to the players, finding a guy who’s a players’ coach.” Both Payton and Duvivier settled into their roles under Tinkle and the staff and had breakthrough seasons in 2014-15. Payton, now a senior guard, made the jump from the junior college level to become the Pac-12 Conference’s defensive player of the year and a first-team all-conference selection. Duvivier, a junior guard, evolved from a role player the previous season to a cog counted on game in and game out. Each is praised for their work this past offseason. Payton flirted with the idea of entering the NBA Draft this past June but decided to return to the Beavers. He says it’s not necessarily a goal of his. His primary objective, he says, is to help the program and get better as a player and a person. Whatever happens is meant to be. “Like any other kid growing up, you’ve got dreams. One of my dreams is to play in the league and just play basketball for a living,” he said. Payton spent about two weeks this past summer working out with DeMar DeRozan, a shooting guard with the NBA’s Toronto Raptors, and DeRozan’s longtime trainer and personal coach Chris Farr on shooting and dribbling and “just picking (DeRozan’s) brain from a guard’s perspective in the league.” Payton also attended the Nike Basketball Academy in Southern California, where he competed alongside many of college basketball’s top players and in front of a long list of current and former NBA standouts. He learned what he needed to improve on and put that to work. Duvivier spent most of his summer on the OSU campus, working on his own game and forming bonds with the six true freshmen that arrived throughout the summer. Tinkle is looking for Duvivier to be “a calming force on both ends.” The coach believes Duvivier felt pressure last season to be a scorer, but he wants him to be more of a playmaker for other capable scorers. Tinkle says that will relieve some of that pressure and help Duvivier display his real strengths more consistently. “I don’t think anybody put in as much time as he did this offseason,” Tinkle said. “If we just continue to get him to be really strong mentally through the ups and the downs, which comes with maturity and experience, that could be that force I was talking about. When he’s out there and these young guys are out there, they see his steady sort of demeanor. That’s going to carry us through some ups and downs.” Duvivier says he wants to be a leader the team can depend on to make plays at both ends. He sees his backcourt mate Payton giving 100-percent effort and it rubs off on others. “Just seeing that makes everyone want to go and do the same things he does,” Duvivier said. “He brings that competitive edge. You know that you’re going to put him out there and he’s going to give you everything he’s got on the defensive end and also on offense.” Tinkle has seen Payton’s leadership grow exponentially since he got to campus 15 months ago, particularly with this year’s freshmen. “It’s key. We’ve got to get it from everybody,” the coach said. “(Langston Morris-Walker) is another guy that’s been very vocal, especially defensively helping the young guys out. They know we’re going to need the young fellas. So their leadership is instrumental to getting that confidence going and get this team to jell.” By Jesse Sowa", "external_links": [], "published": "2015-10-20T05:05:00.000+03:00", "crawled": "2015-10-20T08:06:38.763+03:00", "highlightTitle": ""}