{"organizations": [], "uuid": "2970c8c3cfc3ca70084d7799790f8f08659792a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "arkansasnews.com", "main_image": "", "site_section": "http://arkansasnews.com/taxonomy/term/3/feed", "section_title": "Sports", "url": "http://arkansasnews.com/sports/four-downs-brandon-allen-trying-relieve-pressure", "country": "US", "title": "Four Downs: Brandon Allen Trying To Relieve Pressure", "performance_score": 0, "site": "arkansasnews.com", "participants_count": 0, "title_full": "Four Downs: Brandon Allen Trying To Relieve Pressure", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T03:29:00.000+03:00", "replies_count": 0, "uuid": "2970c8c3cfc3ca70084d7799790f8f08659792a3"}, "author": "", "url": "http://arkansasnews.com/sports/four-downs-brandon-allen-trying-relieve-pressure", "ord_in_thread": 0, "title": "Four Downs: Brandon Allen Trying To Relieve Pressure", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Brandon Allen"], "text": "Four Downs: Brandon Allen Trying To Relieve Pressure   \nFAYETTEVILLE – If he takes a step back, Brandon Allen believes the changes will come. \nAllen was putting too much pressure on himself in Arkansas’ first four games. The fifth-year senior quarterback had lost his fellow senior leading rusher Jonathan Williams. He’d lost his senior good friend wide receiver Keon Hatcher. Then lost other primary targets Cody Hollister and Jared Cornelius. \nLike dominoes they fell. Each one after the next, never in the same game or practice. As the most experienced quarterback in the Southeastern Conference, Allen felt the desire and necessity to put the offense on his back. The team is 1-3. \n“I think I was trying to step into a bigger role and trying to do more and more,” Allen said. “(Coach Bret Bielema) talked to me about just going back to having fun and playing my game. I’m working on that and doing the best I can to do everything that I’m able to do to help our team win.” \nAllen has been mostly good. His passing yards are second in the SEC, as is his completion percentage. Allen’s overall passer rating and yards-per-attempt are top five, too. Yet the record remains. His coach has his back, though. \n“I don’t think there has ever been a more misunderstood player that I’ve been around than Brandon,” Arkansas coach Bret Bielema said. “And our goal is to help him close his senior year out right.” \nHopeful Fixes \nArkansas offensive line coach Sam Pittman is trying to do his part to clean up the most penalized team in the SEC. \nOffensive line and tight ends, the latter of which isn’t Pittman but coach Barry Lunney Jr., accounted for nearly three-quarters of the team’s 12 flags in Saturday’s 28-21 overtime loss to Texas A&M. One was especially glaring. \nWith Arkansas head by eight points, late in the fourth quarter, the Razorbacks came out to try to go for a 4th-and-3. They were just beyond midfield and a first down would have, at worst, left the Aggies only about a minute to work with on a comeback. Instead, left tackle Denver Kirkland jumped early. It pushed the down and distance and the Razorbacks punted. Texas A&M scored and tied the game. \nWith the noise expected from 100,000 or so spectators in Knoxville, Tennessee this week for the game against the Volunteers, Pittman is making some changes. \n“We are trying to change our silent-snap count a little bit so we don’t get caught in somebody simulating a snap count on defense,” he said. \nArkansas has committed 31 penalties for 289 yards in four games. \nGetting Better \nPenalties notwithstanding, the Arkansas offensive line has blocked better in each of its last two games. The Razorbacks running game has increased its rushing total each of the last three, capped with a season-high 232 yards against Texas A&M. And against the Aggies vaunted pass rush – Texas A&M led the nation in sacks – the line only allowed one sack. \nCenter Mitch Smothers will have one of his heaviest tests Saturday. Tennessee defensive tackle Khalil McKenzie is 344 pounds. Even for the biggest offensive line in college or pro football, that’s a large opponent. Smothers is 322. \n“After the Toledo game we definitely put more of an emphasis on being more physical and coming off the ball,” Smothers said. “Back-to-back 200-yard rushing games is really helping us out.” \nSome Switchbacks \nArkansas defensive tackles went the opposite way Saturday against Texas A&M. Expect a return to the norm against Tennessee. \nThe Volunteers prefer to run whereas Texas A&M’s most dangerous trait is passing. The Aggies’ approach led to practically nothing from Arkansas defensive linemen Bijhon Jackson, Hjalte Froholdt or Armon Watts. Bielema preferred speed. Those three will significantly more snaps this Saturday. \n“Probably three of our d-linemen that don’t move as fast as the other guys,” Bielema said. “I think (defensive line coach) Rory (Segrest) wanted to go with the guys I think he felt had better athleticism. Nothing against what they’re doing or playing, it just wasn’t their kind of game.”", "external_links": [], "published": "2015-10-01T03:29:00.000+03:00", "crawled": "2015-10-01T06:09:21.463+03:00", "highlightTitle": ""}