{"organizations": [], "uuid": "7b98aa11f8642b6583f886c02f18b665ef5fbed6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nj.com", "main_image": "http://imgick.nj.com/home/njo-media/width620/img/njcom_photos/photo/2015/10/11/18948825-large.jpg", "site_section": "http://blog.nj.com/realtimesports_impact/rss.xml", "section_title": "New Jersey Real-Time Sports", "url": "http://www.nj.com/eagles/index.ssf/2015/10/eagles_turn_attention_to_giants_immediately_after.html", "country": "US", "title": "Eagles turn attention to Giants immediately after toppling New Orleans Saints", "performance_score": 0, "site": "nj.com", "participants_count": 1, "title_full": "Eagles turn attention to Giants immediately after toppling New Orleans Saints | NJ.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T13:08:00.000+03:00", "replies_count": 0, "uuid": "7b98aa11f8642b6583f886c02f18b665ef5fbed6"}, "author": "Matt Lombardo | For NJ Advance Media", "url": "http://www.nj.com/eagles/index.ssf/2015/10/eagles_turn_attention_to_giants_immediately_after.html", "ord_in_thread": 0, "title": "Eagles turn attention to Giants immediately after toppling New Orleans Saints", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "PHILADELPHIA -- The scoreboard hadn't even been turned off from the Eagles resounding victory over the New Orleans Saints on Sunday afternoon at Lincoln Financial Field, but the focus of the players in the locker room had already turned to next Monday's showdown with the Giants .\nWhile some certainly could have foreseen the first game between these bitter NFC East rivals having the early division lead at stake, few likely foresaw the Eagles in position to snatch away the baton from the the Giants entering Week 6 with a 2-3 record.\nBut, those are the battle lines that have been drawn and talk of the opportunity in front of the Eagles dominated the conversation inside the locker room following Sunday's 39-17 victory over the Saint s.\n\"It felt normal today,\" Eagles right tackle Lane Johnson said of the offense's 186 rushing yard outburst after the ground game had previously been stuck in neutral. \"Especially compared to what it had been. It feels good. We'll come back Wednesday. We've got the Giants. That's a must-win for us.\"\nMust-win games have become the norm in South Philadelphia since the Eagles struggled out of the chute to a 1-3 start to the regular season.\nEAGLES: Rookie WR Nelson Agholor to undergo MRI Monday\nHowever, after dropping the first three NFC games -- including two games within the division to the Washington Redskins and Dallas Cowboys -- Johnson's proclamation once again holds water with the Giants coming to town with early season division victories over the Redskins and Cowboys already tucked away for safe keeping.\nMake no mistake about it, from an Eagles standpoint, a loss to the Giants would have colossal consequences when it comes to playoff tiebreakers both in the division and wild card races later in the season.\nThis team was all but left for dead after allowing Kirk Cousins and the Redskins to drive 90 yards down the field for a game winning touchdown in Week 4, but were granted a stay of execution with Sunday's victory over the Saints that included the defense forcing four turnovers and the offense converting them into 20 points.\nIt will take that sort of complete team effort and maybe even more to beat the Giants who will arrive at Lincoln Financial Field riding the high of a three-game winning streak.\nThis might not have been the road the Eagles expected to travel en route to a showdown that could lead to finishing Week 6 atop the division, but they open up as 3.5 point favorites in a game that with a a victory combined with a Redskins loss to the Jets would deliver that exact outcome.\n\"It's always a fun week when you play the Giants,\" Eagles outside linebacker Brandon Graham told NJ Advance Media following Sunday's win. \"We know we have our hands full. They're playing good ball right now. I can't wait to get after them. \"It's a must-win. It's a must-win every week. Shoot, we have to win.\"\nMatt Lombardo may be reached at MDLombardo@yahoo.com . Follow him on Twitter @MattLombardo975 . Find NJ.com Philadelphia Sports on Facebook", "external_links": ["http://goo.gl/sCPvAY", "http://goo.gl/lbIfKW", "https://www.facebook.com/philadelphiasports", "http://goo.gl/OUAkVs", "http://www.twitter.com/MattLombardo975"], "published": "2015-10-12T13:08:00.000+03:00", "crawled": "2015-10-12T13:11:37.054+03:00", "highlightTitle": ""}