{"organizations": [], "uuid": "0661a1f88a1e08edc7cda17bb4d6cfa5f38b37f8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "mdjonline.com", "main_image": "http://matchbin-assets.s3.amazonaws.com/public/sites/624/thumbs/EY5H_rgbHarrison_at_Hillgrove_02.jpg", "site_section": "http://mdjonline.com/rss/rss/Sports?instance=Sports&content_type=article&tags=sports&tag_inclusion=or&offset=0&limit=10&page_name=rss", "section_title": "Sports", "url": "http://mdjonline.com/bookmark/26926069", "country": "US", "title": "Hillgrove uses dominant first half, cruises to victory over Harrison", "performance_score": 0, "site": "mdjonline.com", "participants_count": 1, "title_full": "Hillgrove uses dominant first half, cruises to victory over Harrison", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T10:18:00.000+03:00", "replies_count": 0, "uuid": "0661a1f88a1e08edc7cda17bb4d6cfa5f38b37f8"}, "author": "Adam Carrington acarrington@mdjonline.com (noreply@mdjonline.com)", "url": "http://mdjonline.com/bookmark/26926069", "ord_in_thread": 0, "title": "Hillgrove uses dominant first half, cruises to victory over Harrison", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Hillgrove uses dominant first half, cruises to victory over Harrison by Adam Carringtonacarrington@mdjonline.com The Marietta Daily Journal  18 AM | 644 views | 0 | 3 | | Hillgrove running back Jaylen McCullough beats Harrison’s Adonis Smith into the corner of the end zone Friday. The Hawks showed the power of their offense early and often, keeping pace among the Region 4 leaders. Special photo by John Silas slideshow POWDER SPRINGS — Hillgrove totaled 473 yards against a Harrison defense that was giving up an average of 13 points per game.The Hawks ran and threw the ball at will, scoring five of the six times they had possession in the first half before putting the game out of reach with 14 unanswered points in the second half and winning a convincing 45-14 game Friday at Cobb Energy/Hillgrove Stadium.Hillgrove used its speed on the edge, and Harrison couldn’t adjust.Matt Wilson was 15-of-25 for 257 yards and two touchdowns for the Hawks (6-3, 4-1 Region 4 ). Bingo Long was his main target, with 10 catches for 171 yards and a score. Tavion Walker ended up with a rushing touchdown and a receiving touchdown and finished with 92 all-purpose yards. His 59-yard sweep to the end zone on Hillgrove’s first play of its first drive set the tone. Jaylen McCollough led a committee of running backs with 69 yards on 14 yards. “We’ve played better offensively the last three weeks as we tried to figure some things out. I thought we’ve played outstanding,” Hillgrove coach Phil Ironside said. “We wanted to get the ball on the edge of the perimeter to our playmakers, and we were able to. We also busted some things early and it snowballed on them.”Early in the first quarter, Harrison (5-3, 2-2) answered Walker’s 59-yard touchdown run early in the first quarter on a 13-play drive aided by a Hillgrove muffed punt. The drive ended on C.J Turner’s 2-yard drive.Converting a pair of fourth downs in the first half also helped Hillgrove take command.The Hawks converted a fourth-and-11 late in the first quarter when Wilson hit Jeremiah Bridges for a 20-yard gain. Wilson scrambled for a 9-yard touchdown on the next play. Hillgrove faced fourth-and-3 at the Harrison 22 on its next drive early in the second quarter. After converting on a 5-yard pass, McCollough reached the end zone from 17 yards out on the next play.The Hawks scored again before the half on Trevor Smith’s 2-yard run, and Eirik Abney kicked a 25-yard field goal with 33 seconds left for a 31-7 lead at the half. Harrison failed to get another first down in the first half following its initial scoring drive and was held to 6 yards on four possessions.“They’re explosive on offense, and they run well to the ball on defense,” Harrison coach Matt Dickmann said. “They did all those things (Friday night). You know what, we got beat. They played better than us.”Harrison came out with grit in the second set, getting a quick stop on defense and driving the ball on offense. Starting on their own 22, the Hoyas reached Hillgrove territory before Harrison Frost threw a ball into traffic that was picked off by Omar Dabdoub.Two plays later, Hillgrove distanced itself from Harrison on a 77-yard strike from Wilson to Long, and the Hawks scored again on their next drive when Wilson found Walker for a 27-yard touchdown.Aidan Loucks led Harrison with 60 receiving yards and scored on a 9-yard catch late in the game. Darius Clark had 73 yards on 17 carries.", "external_links": [], "published": "2015-10-24T10:18:00.000+03:00", "crawled": "2015-10-24T16:31:46.352+03:00", "highlightTitle": ""}