{"organizations": [], "uuid": "9f1dd0479993bc49ffb5760800651adb9c1ba522", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/47529300.cms", "site_section": "http://timesofindia.indiatimes.com/sports/football/champions-league/articlelist/40924344.cms", "section_title": "Top Stories - Champions League - Football - Sports - The Times of India", "url": "http://timesofindia.indiatimes.com/sports/football/champions-league/top-stories/Juventus-skipper-Buffon-plays-down-Caceres-crash/articleshow/49162580.cms", "country": "IL", "title": "Juventus skipper Buffon plays down Caceres crash", "performance_score": 0, "site": "indiatimes.com", "participants_count": 1, "title_full": "Juventus skipper Buffon plays down Caceres crash - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "9f1dd0479993bc49ffb5760800651adb9c1ba522"}, "author": "timesofindia.indiatimes.com", "url": "http://timesofindia.indiatimes.com/sports/football/champions-league/top-stories/Juventus-skipper-Buffon-plays-down-Caceres-crash/articleshow/49162580.cms", "ord_in_thread": 0, "title": "Juventus skipper Buffon plays down Caceres crash", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "TURI ( Italy): Juventus captain Gianluigi Buffon on Tuesday played down a car crash which led to the suspension of Martin Caceres and deepened the Italian champions' crisis on the eve of a crucial Champions League clash.\nJuventus host Europa League champions Sevilla in Turin on Wednesday looking to eclipse the poor league form that has seen them languishing in 15th place in Serie A with only five points from six games.\nWhile an injury crisis has been to blame for some of Juve's woes, they deepened on Tuesday when Swiss wing-back/defender Stephan Lichsteiner and defender Martin Caceres were both ruled out of Wednesday's match.\nLichsteiner has failed to recover from a head knock, while Caceres's absence is due to a suspension dealt out by the club after he crashed his Ferrari in the early hours of the morning and was breathalysed by police.\nBuffon was quick to jump to the Uruguayan international's defence, but insisted the incident would have no impact on Juve's preparations to claim their second successive win in Group D.\n\"Martin has the total backing of all the squad,\" said Buffon. \"He's a guy who has always given his best and he is loyal. He knows he's made a mistake.\n\"Obviously it was bad timing, coming two nights before a big game like this, but he's understood and he's sorry.\n\"Hopefully a win will help us all forget what's happened.\"\nThe incident happened on Monday night when Caceres reportedly drove down a one-way street, lost control of his Ferrari, drove into a bus shelter and crashed into two parked cars.\nA Juventus statement issued earlier said: \"Martin Caceres' behaviour on the night of 28 to 29 September is a serious violation of his duty to the club, as well as damaging the club's image.\"\nCaceres' future at the club may now hang in the balance as it is not the first time he has been involved in a car crash while playing for the club.\nHe crashed a Porsche SUV in 2013, suffering head injuries, although on that occasion reports said he had been hit from behind by another car that had run a red light.\nJuventus host Sevilla after a morale-boosting 2-1 win at Manchester City in their Group D opener, and Buffon called for a second win to put Juventus on course for the knockout stages.\n\"We need to play with balance, with intensity and with everyone motivated for every single minute of the game,\" added the Italy goalkeeper.\n\"I think we have a chance to take a serious option on taking the lead of the group.\n\"We all know that a win tomorrow can help cancel out all the negative things that have happened for us this season. We're super motivated to go out and get the three points.\"", "external_links": [], "published": "2015-09-30T03:00:00.000+03:00", "crawled": "2015-10-10T17:14:20.664+03:00", "highlightTitle": ""}