{"organizations": [], "uuid": "7394a15358f9ee603091764e7df2f0d8a633d5f0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.denverpost.com", "main_image": "http://extras.mnginteractive.com/live/media/site36/2015/1023/20151023__mets-ap~p1.jpg", "site_section": "http://www.denverpost.com/sports", "section_title": "Sports - The Denver Post", "url": "http://www.denverpost.com/rockies/ci_29017522/mets-long-layoff-world-series", "country": "US", "title": "Mets' long layoff before World Series has pros and cons", "performance_score": 0, "site": "denverpost.com", "participants_count": 1, "title_full": "Mets' long layoff before World Series has pros and cons - The Denver Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T19:11:00.000+03:00", "replies_count": 0, "uuid": "7394a15358f9ee603091764e7df2f0d8a633d5f0"}, "author": "Mike Fitzpatrick", "url": "http://www.denverpost.com/rockies/ci_29017522/mets-long-layoff-world-series", "ord_in_thread": 0, "title": "Mets' long layoff before World Series has pros and cons", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK — The way the New York Mets were playing, the last thing they needed was five days off.\nNo choice, though. That's exactly what they got.\nRELATED: Daniel Murphy, Alcides Escobar leaving marks in October\nAfter completing a four-game sweep of the Chicago Cubs in the National League Championship Series on Wednesday night, red-hot Daniel Murphy and the Mets must wait until Tuesday night to start the World Series.\nAnd recent history suggests such a long layoff in October can really be detrimental.\nGet sports news and updates right in your inbox Sign up to receive news alerts and a daily roundup of all things Colorado sports delivered to your inbox.\n\"I don't know if every team's the same. You know, we're going to ride that pitching. And by the way, our pitching right now could use a blow because we're pushing them pretty hard,\" manager Terry Collins said Friday. \"I'm glad our starters are going to get an extra day.\"\nNonetheless, baseball is about repetition and timing. So it's a fair question: Will the new National League champions look rested or rusty in the World Series?\nThey will open at Kansas City after the Royals beat the Blue Jays 4-3 in Game 6 of the American League Championship Series on Friday night.\nRELATED: Royals back in World Series\nAdvertisement \"The pros are you can sit back and dig yourself for a couple of days, and that's always fun to know, right?\" Royals manager Ned Yost said this week. \"And the cons are, you just get anxious to go. You've got to throw maybe some simulated games in batting practice to keep guys sharp.\"\nNew York might be best served rooting for Kansas City, the defending AL champion, to finish off the Blue Jays as quickly as possible.\nThe last four times a team coming off an LCS sweep faced a team that went the distance to reach the Fall Classic, the club with the extended layoff got wiped out in the World Series.\nIn fact, the squads with all the extra time off went a combined 2-16 in those World Series games. The last two such World Series were sweeps: Boston over Colorado in 2007 and San Francisco over Detroit in 2012.\nThose Tigers were managed by Jim Leyland, a longtime mentor to Collins. Leyland also piloted the 2006 Tigers, who swept Oakland in the ALCS but lost the World Series 4-1 to a St. Louis team that went seven games with the Mets in the NLCS.\nThat performance was particularly sloppy, with Detroit pitchers struggling over and over to make accurate throws to the bases.\n\"I think he had the better team at that time, but the team that's playing the best is the team that wins and we've got to get ourselves ready to play,\" Collins said. \"That's why I asked him about all the preparation and stuff and he said, 'Listen, play the best players, don't ever take anything for granted, and by the way there's nothing you can do between now and when that game starts that's going to get them ready — except themselves.' \"", "external_links": ["http://denverpostplus.com/app/mailer-rules/www/", "https://fonts.googleapis.com/css?family=Andada|Montserrat:400,700|Open+Sans:400,800,700,400italic"], "published": "2015-10-23T19:11:00.000+03:00", "crawled": "2015-10-24T12:14:18.608+03:00", "highlightTitle": ""}