{"organizations": [], "uuid": "2c0d733eaa257264a9e2d85cff34abf9b2a022bc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "wtop.com", "main_image": "http://wtop.com/wp-content/uploads/2015/10/APTOPIX-Texas-Tech-Kansas-Football.jpeg", "site_section": "http://wtop.com/section/sports/feed/", "section_title": "WTOP » Sections » Sports", "url": "http://wtop.com/ncaa-football/2015/10/kansas-still-winless-after-falling-to-texas-tech-30-20/", "country": "US", "title": "Kansas still winless after falling to Texas Tech 30-20", "performance_score": 0, "site": "wtop.com", "participants_count": 1, "title_full": "Kansas still winless after falling to Texas Tech 30-20", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T00:28:00.000+03:00", "replies_count": 0, "uuid": "2c0d733eaa257264a9e2d85cff34abf9b2a022bc"}, "author": "wtopstaff", "url": "http://wtop.com/ncaa-football/2015/10/kansas-still-winless-after-falling-to-texas-tech-30-20/", "ord_in_thread": 0, "title": "Kansas still winless after falling to Texas Tech 30-20", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Kansas still winless after falling to Texas Tech 30-20 By AMIE JUST October 17, 2015 5:28 pm Kansas wide receiver Darious Crawley reaches the ball across the goal line for a touchdown as he is defended by Texas Tech defensive back J.J. Gaines (3) and defensive lineman Branden Jackson (9) during the second half of an NCAA college football game on Saturday, Oct. 17, 2015, at Memorial Stadium in Lawrence, Kansas. (Nick Kruf/The Journal-World via AP) \nLAWRENCE, Kan. (AP) — Luck looked to be on the Jayhawks’ side during what might be chalked up as one of the strangest plays in Kansas football history. \nWith less than five minutes to go, Kansas was down by 3. Freshman quarterback Ryan Willis was backed up in his own end zone, which would have resulted in a safety, but he fumbled. Two Texas Tech defenders wrestled for the ball, but the ball rolled to running back De’Andre Mann, who ran out of the end zone for a 4-yard gain. \nOne play later, Willis tossed a pick six and the Jayhawks couldn’t bounce back, falling to Texas Tech 30-20. \n“The thing that I know about Ryan (Willis) is he’s young, he’s a freshman,” coach David Beaty said. “I know that screaming at him and not teaching him would be a complete mistake. When he comes off and he makes a mistake, the first thing I do is, myself and coach (Rob) Likens, is we start teaching. We talk about that teaching moment.” \nPatrick Mahomes threw for 359 yards and a score, De’Andre Washington rushed for 160 yards and a TD and Texas Tech held off a late-charging, winless Kansas team. \nThe Red Raiders (5-2, 2-2 Big 12) racked up 225 yards rushing and a touchdown on the ground. Texas Tech’s 30 points were the least amount the team has scored all season. \nFive different Texas Tech offensive playmakers recorded over 50 yards receiving. Zach Austin led the Red Raiders with 80 yards receiving, Jakeem Grant had 76 yards, Devin Lauderdale had 50, Cameron Batson, 58, and Reginald Davis, 57 yards and a score. \nTexas Tech continued its streak of perfection, as the Red Raiders are 9-0 inside Memorial Stadium, a record dating to 1966. \nKansas (0-6, 0-3) is riding a nine-game losing streak and is 0-6 for the first time since 1988. Before this season, Kansas had only started 0-6 three times in program history, in 1954 and 1988. Beaty is still waiting for his first win. \nWillis was 35 of 50 for a career-high 330 yards passing in his second start for the Jayhawks. Willis turned the ball over three times, throwing two picks and dropped a fumble. Mann gained 107 yards on 15 carries. \nKansas had its share of bloopers, most of those coming on special teams. \nMatthew Wyman missed an extra point attempt and two field goals, a 52-yard attempt and a 34-yard attempt, and Nick Bartolotta shanked a 22-yard field goal wide right. \n“We talk about special teams until we’re blue in the face,” Beaty said. “Because we know that’s a hidden third that we’ve got to win. We win that one right there, we win this football game. We didn’t get it done though.” \nWyman said two of the three facets — punting and kickoffs — were pretty good, but the one that mattered most — field goals and PATs — weren’t solid. \n“It sucks when you lose by 10 and we leave 10 points on the field,” Wyman said. “It’s obviously not a good feeling, but we’ll bounce back and we’ll be fine.” \nBut Kansas wasn’t going out without a fight. Kansas had back-to-back touchdowns in the fourth quarter to put them down by 3. \nThe sack-fumble-wrestle-run play electrified Memorial Stadium. The few fans that dotted the stands were going insane. They believed Kansas could pull it off. \n“How about our guys that kept playing,” Beaty said of the play. “What about De’Andre Mann? He picks it up, gets out there and we get an opportunity to extend the sticks. That right there was some great growth for us as a team.” \nBut the momentum quickly shifted. On the next play, Willis threw a pick-six and Kansas’ comeback hopes were dashed. Topics:", "external_links": [], "published": "2015-10-18T00:28:00.000+03:00", "crawled": "2015-10-18T00:33:53.616+03:00", "highlightTitle": ""}