{"organizations": [], "uuid": "7877026e87a285bda5bd849504238af05c7c9e84", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "mt-pleasant-ia.villagesoup.com", "main_image": "http://mt-pleasant-ia.villagesoup.com/media/Common/InlandMedia/2015/10/13/1678766/t600-IMG_3065.jpg", "site_section": "http://mt-pleasant-ia.villagesoup.com//rss/story/sports", "section_title": "Mt Pleasant News Sports Headlines", "url": "http://mt-pleasant-ia.villagesoup.com/p/tigers-panthers-soar-in-mpchs-tourney/1427255?source=rss", "country": "US", "title": "Tigers, Panthers soar in MPCHS tourney", "performance_score": 0, "site": "villagesoup.com", "participants_count": 1, "title_full": "Tigers, Panthers soar in MPCHS tourney", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T20:04:00.000+03:00", "replies_count": 0, "uuid": "7877026e87a285bda5bd849504238af05c7c9e84"}, "author": "news@mpnews.net (Staff)", "url": "http://mt-pleasant-ia.villagesoup.com/p/tigers-panthers-soar-in-mpchs-tourney/1427255?source=rss", "ord_in_thread": 0, "title": "Tigers, Panthers soar in MPCHS tourney", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tigers, Panthers soar in MPCHS tourney Oct 13, 2015 Photo by: Andy Krutsinger Ashlee Menke tallied 52 assists in the MPCHS tournament on Saturday. The Panthers went 3-1 in the tournament with wins over Keokuk, Central Lee and West Burlington. \nThe Mt. Pleasant and New London volleyball teams dominated the MPCHS tournament this Saturday. The Panthers and Tigers each won their first three games of the day before meeting in the de facto championship game, where New London was victorious, 25-16 and 25-21. \nNew London made their way through the bracket with ease, going 8-0 in sets. The Tigers opened the tournament up with Keokuk, winning 25-12 and 25-15. They defeated Lee County, 25-19 and had their best game against Notre Dame, cruising to a 25-8 victory. \nBrandi Allen led the Tigers with 28 kills on the day. Breanna Mettler wasn’t far behind her with 26, including 10 in the Tigers’ final game against Mt. Pleasant. Emma Pry finished with 68 assists on the day to lead the team. Leading in digs was Carson McSorely, who had 44. \nMt. Pleasant started the tournament with conference rival Keokuk, who they defeated 25-20 and 25-19. The Panthers took down Central Lee, 25-12 and 25-20, and then got taken to three sets by Notre Dame, where they pulled out the 2-1 victory (18-25, 25-15, 15-10). \nJulie Lasswell had a big tournament, leading the team in kills with 21. Danielle Coffin had 15 kills, which was good enough for second on the team, and also had the most kills against Central Lee (5). Ashlee Menke had 52 assists on the day, and Haylee Boecker led in digs, with 19. \nThe Tigers picked up wins against Harmony and Maharishi on Monday night to finish their regular season, 33-6. They will host Maharishi on Tuesday, Oct. 20, in their post-season opener, and face the Sigourney vs. Tri-County winner with a win. If New London were to make the regional final, it would be held in Ft. Madison, possibly against SEISC South Division rival Holy Trinity. \nMt. Pleasant moved to 11-19 after the tournament and will close out their regular season against Lee County teams. The Panthers host Ft. Madison tonight and travel to Keokuk on Oct. 22. \nJust four days later, on Oct. 24, the Panthers will host Keokuk in the first round of regionals for the chance to play Ft. Madison on the road in the regional semi-finals on Oct. 29. The other side of the district bracket includes Washington, Clear Creek-Amana and Marion. The regional championship game will be held in Washington.", "external_links": [], "published": "2015-10-13T20:04:00.000+03:00", "crawled": "2015-10-13T20:55:17.576+03:00", "highlightTitle": ""}