{"organizations": [], "uuid": "254400195ace41a2780bcd75e56f5d98a687b0c5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "", "site_section": "http://www.tribuneindia.com/", "section_title": "The Tribune, Chandigarh, India : Latest news, India, Punjab, Chandigarh, Haryana, Himachal, Uttarakhand, J&amp;K, sports, cricket ", "url": "http://www.tribuneindia.com/news/himachal/truckers-strike-affects-transportation-of-goods/142082.html", "country": "US", "title": "Truckers’ strike affects transportation of goods", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "Truckers’ strike affects transportation of goods", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "254400195ace41a2780bcd75e56f5d98a687b0c5"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/himachal/truckers-strike-affects-transportation-of-goods/142082.html", "ord_in_thread": 0, "title": "Truckers’ strike affects transportation of goods", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tribune News Service\nSolan, October 5\nTruck operators’ strike has affected the movement of industrial goods outside the state. The unions have been agitating for the past five days in support of the demands of the All-India Motor Transport Congress (AIMTC). The state’s biggest industrial hub — Baddi-Barotiwala-Nalagarh (BBN) — is the worst sufferer as the movement of 15,000 trucks belonging to Asia’s biggest truck union has been paralysed. Though the All-Himachal Truck Operators Federation had decided not to halt the movement of trucks within the state, transportation of goods and apples outside the state has been hit hard. Federation’s president Naresh Gupta, who was in Delhi to attend the special meeting called by the AIMTC, said they had decided not to ply trucks outside the state till the strike was over. Jatinder Singh, plant head, Kitchen Appliances Manufacturing Company, Baddi, said their export consignments were stuck due to the strike, adding that they not only had to pay for booking space in the port but also had no space in the plant to store finished goods. He said on an average, they dispatched four truck loaded with goods every day, which comprised 6,000 irons and 5,000 juicer mixer grinders. As no goods had been dispatched since October 1, the unit had no space left to store the finished goods. He said as it was the peak season, their orders were falling short of the targets. Gupta lamented that the truckers were reluctant to ply trucks in other states for the fear of facing damage and trucks were being hired now to store the finished goods. They were forced to pay the halting charges every day till the strike continued and this was causing undue expenditure, he said. “Investors are also facing shortage of raw material as the existing stock is shrinking and if the strike continues, they will have to slow down their production,” said Ajay Kumar, senior executive in a pharmaceutical company. He said since a majority of the raw material was transported from outside the state, the strike had slowed down the productivity. With 60,000 trucks in various industrial areas failing to ply out of state, the investors as well as the truckers are eagerly waiting for the strike to end.", "external_links": [], "published": "2015-10-06T03:00:00.000+03:00", "crawled": "2015-10-06T02:01:11.759+03:00", "highlightTitle": ""}