{"organizations": [], "uuid": "53ed2bbcb36e451d0f6174675bac6e157cb7e9cd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mysanantonio.com", "main_image": "http://ww2.hdnux.com/photos/34/32/54/7449361/3/rawImage.jpg", "site_section": "http://www.mysanantonio.com/rss/feed/mySA-Sports-921.php", "section_title": "mySA Sports", "url": "http://www.mysanantonio.com/sports/article/San-Antonio-Spurs-coach-Gregg-Popovich-named-head-6586598.php", "country": "US", "title": "San Antonio Spurs coach Gregg Popovich named head coach of USA Basketball Men's National Team", "performance_score": 0, "site": "mysanantonio.com", "participants_count": 1, "title_full": "San Antonio Spurs coach Gregg Popovich named head coach of USA Basketball Men's National Team - San Antonio Express-News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T21:00:00.000+03:00", "replies_count": 0, "uuid": "53ed2bbcb36e451d0f6174675bac6e157cb7e9cd"}, "author": "Jeff McDonald", "url": "http://www.mysanantonio.com/sports/article/San-Antonio-Spurs-coach-Gregg-Popovich-named-head-6586598.php", "ord_in_thread": 0, "title": "San Antonio Spurs coach Gregg Popovich named head coach of USA Basketball Men's National Team", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photo: Photo Illustration Image 1 of / 42 42 Click through the gallery to see 22 facts you probably didn't know about Gregg Popovich. Click through the gallery to see 22 facts you probably didn't know about Gregg Popovich. Photo: Photo Illustration Image 2 of 42\n1. He is the longest-tenured active coach in North American professional sports\nRead more: Popovich's steel roots built solid foundation for NBA success\n1. He is the longest-tenured active coach in North American professional sports\nRead more: Popovich's steel roots built solid foundation for NBA success\nPhoto: Bob Owen/Express-News Image 3 of 42 2. Popovich will soon become the ninth coach in NBA annals to reach 1,000-victory mark.\nRead more: Popovich's steel roots built solid foundation for NBA success\n2. Popovich will soon become the ninth coach in NBA annals to reach 1,000-victory mark.\nRead more: Popovich's steel roots built solid foundation for NBA success Photo: eaornelas@express-news.net Image 4 of 42 3. He was born Jan. 28, 1949 in the Indiana Harbor section of East Chicago, Indiana to a Serbian father, Raymond and Croatian mother, Katherine.\nRead more: Popovich's steel roots built solid foundation for NBA success\n3. He was born Jan. 28, 1949 in the Indiana Harbor section of East Chicago, Indiana to a Serbian father, Raymond and Croatian mother, Katherine.\nRead more: Popovich's steel roots built solid foundation for\n... more Image 5 of 42 4. His first childhood dream was to play for legendary coach Johnny Baratto at Washington High in East Chicago, where his father was a star in the 1930s.\nRead more: Popovich's steel roots built solid foundation for NBA success\n4. His first childhood dream was to play for legendary coach Johnny Baratto at Washington High in East Chicago, where his father was a star in the 1930s.\nRead more: Popovich's steel roots built solid\n... more Image 6 of 42 5. When Popovich accepted his commission to the Air Force in 1966 after his high school graduation, he became one of the first seniors in Merrillville history to attend a military academy.\nRead more: Popovich's steel roots built solid foundation for NBA success\n5. When Popovich accepted his commission to the Air Force in 1966 after his high school graduation, he became one of the first seniors in Merrillville history to attend a military academy.\nRead more:\n... more Image 7 of 42 6. Before the world knew him as “Pop,” Merrillville peers called him “C.C.” since his high school basketball coach mistakenly and repeatedly referred to Popovich as “Craig” instead of Gregg. Teammates paired the misnomer with his middle name, “Charles,” to create the new nickname.\nRead more: Popovich's steel roots built solid foundation for NBA success\n6. Before the world knew him as “Pop,” Merrillville peers called him “C.C.” since his high school basketball coach mistakenly and repeatedly referred to Popovich as “Craig” instead of Gregg.\n... more Image 8 of 42 7. Popovich was once cut from his high school basketball team during his sophomore year. He spent the summer after practicing relentlessly, it is during this trying time friends believed he learned “to be tough.” He returned to the team his junior year as the starting center, but still “Craig” to his coach.\nRead more: Popovich's steel roots built solid foundation for NBA success\n7. Popovich was once cut from his high school basketball team during his sophomore year. He spent the summer after practicing relentlessly, it is during this trying time friends believed he learned “to be\n... more Image 9 of 42 8. Popovich also played baseball in high school.\nRead more: Popovich's steel roots built solid foundation for NBA success\n8. Popovich also played baseball in high school.\nRead more: Popovich's steel roots built solid foundation for NBA success Photo: San Antonio Express-News Image 10 of 42 9. When he was off the hardwood, he spent his teenage years with friends cruising, eating 14-cent hamburgers at the town’s burger joint called The Mug, watching drive-in movies, listening to Motown tunes, dancing (yes, dancing) and road-tripping to Wrigley Field to catch Cubs games.\nRead more: Popovich's steel roots built solid foundation for NBA success\n9. When he was off the hardwood, he spent his teenage years with friends cruising, eating 14-cent hamburgers at the town’s burger joint called The Mug, watching drive-in movies, listening to Motown tunes,\n... more Image 11 of 42 10. His high school years were well-rounded as he was also an honor student, gaining admiration from both teachers and fellow students.\nRead more: Popovich's steel roots built solid foundation for NBA success\n10. His high school years were well-rounded as he was also an honor student, gaining admiration from both teachers and fellow students.\nRead more: Popovich's steel roots built solid foundation for NBA success Photo: San Antonio Express-News Image 12 of 42 11. Popovich’s dedication to the game went beyond practice; he also wore ankle weights at school in an attempt to increase his leg strength.\nRead more: Popovich's steel roots built solid foundation for NBA success\n11. Popovich’s dedication to the game went beyond practice; he also wore ankle weights at school in an attempt to increase his leg strength.\nRead more: Popovich's steel roots built solid foundation for NBA ... more Image 13 of 42 12. In 2005, shortly after coaching the Spurs to their third championship, Popovich returned to the Merrillville gym where the school retired his No. 21 high school jersey. To the delight of the crowd, Popovich wore his 1966 letterman jacket to the event.\nRead more: Popovich's steel roots built solid foundation for NBA success\n12. In 2005, shortly after coaching the Spurs to their third championship, Popovich returned to the Merrillville gym where the school retired his No. 21 high school jersey. To the delight of the crowd,\n... more Image 14 of 42 13. The Pomona-Pitzer Sagehens, the Division III team Popovich coached in the 80s, referred to him as “Popo.”\nRead more: Relationship building, hard work helped Popovich rise from humble start\n13. The Pomona-Pitzer Sagehens, the Division III team Popovich coached in the 80s, referred to him as “Popo.”\nRead more: Relationship building, hard work helped Popovich rise from humble start\nPhoto: Jerry Lara, San Antonio Express-News Image 15 of 42 14. Popovich led the Sagahens (who were 2-22 in Popovich’s first season as coach) to their first-ever conference title in 1986.\nRead more: Relationship building, hard work helped Popovich rise from humble start\n14. Popovich led the Sagahens (who were 2-22 in Popovich’s first season as coach) to their first-ever conference title in 1986.\nRead more: Relationship building, hard work helped Popovich rise from ... more Image 16 of 42\n15. The Sagahens were not the only team Pop turned around. His inaugural coaching season with the Spurs was the worst in the team’s history, 21-61.\nRead more: Relationship building, hard work helped Popovich rise from humble start\n15. The Sagahens were not the only team Pop turned around. His inaugural coaching season with the Spurs was the worst in the team’s history, 21-61.\nRead more: Relationship building, hard work helped Popovich ... more Image 17 of 42 16. Popovich majored in Soviet studies in the Air Force Academy in Colorado Springs, speaks fluent Russian and trained in military intelligence.\nRead more: Air Force life for Popovich: Spy satellites and basketball\n16. Popovich majored in Soviet studies in the Air Force Academy in Colorado Springs, speaks fluent Russian and trained in military intelligence.\nRead more: Air Force life for Popovich: Spy satellites and\n... more Image 18 of 42\n17. His first assignment after graduation was with the 6594th Support Group in Sunnyvale, California, in the Silicon Valley. The group was part of the top-secret Air Forces Satellite Control Facility, under the command of Space and Missile Systems Organization (SAMSO.)\nRead more: Air Force life for Popovich: Spy satellites and basketball\n17. His first assignment after graduation was with the 6594th Support Group in Sunnyvale, California, in the Silicon Valley. The group was part of the top-secret Air Forces Satellite Control Facility, under\n... more Image 19 of 42 18. Popovich was awarded a small arms marksmanship ribbon in the military, meaning he is a qualified expert with either a military-issue handgun or M-16 rifle.\nRead more: Air Force life for Popovich: Spy satellites and basketball\n18. Popovich was awarded a small arms marksmanship ribbon in the military, meaning he is a qualified expert with either a military-issue handgun or M-16 rifle.\nRead more: Air Force life for Popovich: Spy\n... more Image 20 of 42 19. He was also awarded the National Defense Service Medal, Longevity Service Award Ribbon and the Air Force Commendation Medal.\nRead more: Air Force life for Popovich: Spy satellites and basketball\n19. He was also awarded the National Defense Service Medal, Longevity Service Award Ribbon and the Air Force Commendation Medal.\nRead more: Air Force life for Popovich: Spy satellites and basketball\nPhoto: Jerry Lara, Express-News Image 21 of 42 20. According to Bleacher Report’s Josh Cohen, Pop is part-owner of a winery in Oregon called A to Z Wineworks, which specializes pinot noir.\n20. According to Bleacher Report’s Josh Cohen, Pop is part-owner of a winery in Oregon called A to Z Wineworks, which specializes pinot noir.\nPhoto: Kin Man Hui, Express-News Image 22 of 42 21. His personal above-ground wine cellar stands 12-feet-by-20-feet and is stocked with 3,000 bottles of vino, ESPN reports.\n21. His personal above-ground wine cellar stands 12-feet-by-20-feet and is stocked with 3,000 bottles of vino, ESPN reports.\nPhoto: EDWARD A. ORNELAS, SAN ANTONIO EXPRESS-NEWS Image 23 of 42 22. Popovich’s goals span further than the game of basketball. “My goal is to drink as much of it as I can before I die so my kids don’t use 7-UP and make sangria out of the wine. That’s my goal,” the championship-winning connoisseur told ESPN’S Chris Perkins.\n22. Popovich’s goals span further than the game of basketball. “My goal is to drink as much of it as I can before I die so my kids don’t use 7-UP and make sangria out of the wine. That’s my goal,”\n... more Image 24 of 42 San Antonio Spurs coach Gregg Popovich (right) speaks with the media Monday May 4, 2015 at the Spurs' practice facility about last season and the upcoming offseason. San Antonio Spurs coach Gregg Popovich (right) speaks with the media Monday May 4, 2015 at the Spurs' practice facility about last season and the upcoming offseason. Photo: San Antonio Express-News Image 25 of 42 San Antonio Spurs coach Gregg Popovich (center) speaks with the media Monday May 4, 2015 at the Spurs' practice facility about last season and the upcoming offseason. San Antonio Spurs coach Gregg Popovich (center) speaks with the media Monday May 4, 2015 at the Spurs' practice facility about last season and the upcoming offseason. Photo: San Antonio Express-News Image 26 of 42 LOS ANGELES, CA - APRIL 28: Head coach Gregg Popovich and Kawhi Leonard #2 of the San Antonio Spurs confer as they play the Los Angeles Clippers during Game Five of the Western Conference quarterfinals of the 2015 NBA Playoffs at Staples Center on April 28, 2015 in Los Angeles, California. The Spurs won 111-107. NOTE TO USER: User expressly acknowledges and agrees that, by downloading and or using this photograph, User is consenting to the terms and conditions of the Getty Images License Agreement. (Photo by Stephen Dunn/Getty Images) LOS ANGELES, CA - APRIL 28: Head coach Gregg Popovich and Kawhi Leonard #2 of the San Antonio Spurs confer as they play the Los Angeles Clippers during Game Five of the Western Conference quarterfinals of the ... more Image 27 of 42 Spurs coach Gregg Popovich's first head coaching job was at Pomona-Pitzer in Claremont, California. He coached there from 1979-86 and in 1987-88 after taking a leave of absence to be on Larry Brown's staff at Kansas for a season. Popovich was 76-127 in those eight seasons guiding the Sagehens to their first SCIAC title in 68 years after the 1985-86 season. Spurs coach Gregg Popovich's first head coaching job was at Pomona-Pitzer in Claremont, California. He coached there from 1979-86 and in 1987-88 after taking a leave of absence to be on Larry Brown's staff at ... more Image 28 of 42 Spurs coach Gregg Popovich from his Air Force Academy yearbook Spurs coach Gregg Popovich from his Air Force Academy yearbook Photo: Courtesy Air Force Athletics Image 29 of 42 Spurs coach Gregg Popovich from his Air Force Academy yearbook Spurs coach Gregg Popovich from his Air Force Academy yearbook Photo: Courtesy Air Force Athletics Image 30 of 42 San Antonio Spurs head coach Gregg Popovich, left, puts his head on the shoulder of assistant coach Ettore Messina during the second half of Game 5 of a first-round NBA basketball playoff series against the Los Angeles Clippers, Tuesday, April 28, 2015, in Los Angeles. The Spurs won 111-107. (AP Photo/Mark J. Terrill) San Antonio Spurs head coach Gregg Popovich, left, puts his head on the shoulder of assistant coach Ettore Messina during the second half of Game 5 of a first-round NBA basketball playoff series against the Los ... more Image 31 of 42 San Antonio Spurs coach Gregg Popovich shouts at a referee during the first half of the Spurs' NBA basketball game against the Memphis Grizzlies on Tuesday, Dec. 30, 2014, in Memphis, Tenn. (AP Photo/Brandon Dill) San Antonio Spurs coach Gregg Popovich shouts at a referee during the first half of the Spurs' NBA basketball game against the Memphis Grizzlies on Tuesday, Dec. 30, 2014, in Memphis, Tenn. (AP Photo/Brandon ... more Image 32 of 42 San Antonio Spurs forward Tim Duncan (21) and head coach Gregg Popovich in the first quarter during an NBA basketball game against the Phoenix Suns, Saturday, Feb. 28, 2015, in Phoenix. (AP Photo/Rick Scuteri) San Antonio Spurs forward Tim Duncan (21) and head coach Gregg Popovich in the first quarter during an NBA basketball game against the Phoenix Suns, Saturday, Feb. 28, 2015, in Phoenix. (AP Photo/Rick Scuteri) Photo: Associated Press Image 33 of 42 Head coach Gregg Popovich of the San Antonio Spurs leads his team against the Denver Nuggets at the Pepsi Center on December 18, 2012 in Denver, Colorado. NOTE TO USER: User expressly acknowledges and agrees that, by downloading and or using this photograph, User is consenting to the terms and conditions of the Getty Images License Agreement. (Photo by Doug Pensinger/Getty Images) Head coach Gregg Popovich of the San Antonio Spurs leads his team against the Denver Nuggets at the Pepsi Center on December 18, 2012 in Denver, Colorado. NOTE TO USER: User expressly acknowledges and agrees ... more Image 34 of 42 1988-89 San Antonio Spurs coaching staff, including Gregg Popovich. 1988-89 San Antonio Spurs coaching staff, including Gregg Popovich. Image 35 of 42 San Antonio Spurs coach Gregg Popovich sits with the Red Auerbach trophy during a news conference after he was named NBA basketball coach of the year, Tuesday, April 22, 2014, in San Antonio. Popovich has won the award three times. (AP Photo/Eric Gay) San Antonio Spurs coach Gregg Popovich sits with the Red Auerbach trophy during a news conference after he was named NBA basketball coach of the year, Tuesday, April 22, 2014, in San Antonio. Popovich has won ... more Image 36 of 42 Gregg Popovich, 1990. Original caption reads: \"Spurs practice short players so this guy is practicing.\" Gregg Popovich, 1990. Original caption reads: \"Spurs practice short players so this guy is practicing.\" Photo: Express-News File Photo Image 37 of 42 Gregg Popovich was the head coach of the Pomona-Pitzer College men's basketball team from 1979-1987. Image scanned from student handbook. Gregg Popovich was the head coach of the Pomona-Pitzer College men's basketball team from 1979-1987. Image scanned from student handbook. Photo: Courtesy Photo Image 38 of 42 San Antonio Spurs head coach Gregg Popovich smiles as a question is asked during a news conference for the NBA basketball finals on Saturday, June 14, 2014, in San Antonio. The Spurs play Game 5 against the Miami Heat on Sunday. (AP Photo/Tony Gutierrez) San Antonio Spurs head coach Gregg Popovich smiles as a question is asked during a news conference for the NBA basketball finals on Saturday, June 14, 2014, in San Antonio. The Spurs play Game 5 against the ... more Image 39 of 42 San Antonio Spurs head coach Gregg Popovich talks with Marco Belinelli during practice Wednesday June 11, 2014 at American Airlines Arena in Miami, Fla. San Antonio Spurs head coach Gregg Popovich talks with Marco Belinelli during practice Wednesday June 11, 2014 at American Airlines Arena in Miami, Fla. Photo: San Antonio Express-News Image 40 of 42 San Antonio Spurs head coach Gregg Popovich , third from left, sits on the bench with the Merrillville High School baseball team in this yearbook photo. Popovich was born in East Chicago but grew up in Merrillville, Indiana. To the left with guitar is his best friend Arlie Pierce. They were both best man at their weddings. San Antonio Spurs head coach Gregg Popovich , third from left, sits on the bench with the Merrillville High School baseball team in this yearbook photo. Popovich was born in East Chicago but grew up in ... more Image 41 of 42 Assistant coach Gregg Popovich, head coach Larry Brown and assistant coach R.C. Buford in a 1990 contest. Assistant coach Gregg Popovich, head coach Larry Brown and assistant coach R.C. Buford in a 1990 contest. Photo: Express-News-file Photo Image 42 of 42 San Antonio Spurs coach Gregg Popovich named head coach of USA Basketball Men's National Team 1 / 42 Back to Gallery Add another job title to Gregg Popovich's already impressive coaching resume — Team USA Coach.\nThe Spurs' Popovich has been named the country's national coach for 2017-2020, USA Basketball announced Friday.\nRELATED: Jeff McDonald on the Spurs preseason, Coach Pop and Team USA.\nPopovich, 66, will replace Mike Krzyzewski following the 2016 Olympics in Rio De Janeiro. Krzyzewski is moving to an advisory role alongside Team USA managing director Jerry Colangelo.\nPopovich is set to coach the men's squad for the 2019 FIBA World Cup in China and the 2020 Olympics in Tokyo.\nIn a release from USA Basketball, Popovich — a 1970 graduate of the U.S. Air Force Academy — said he was \"humbled and honored\" to be tabbed for the job.\n\"I will do my utmost to maintain the high standards of success, class and character established by Jerry, Coach K and the many players who have sacrificed their time on behalf of USA Basketball,\" said Popovich, who served Team USA as an assistant under Larry Brown in the 2004 Athens Olympics.\nIn Friday's release, Colangelo said he is pleased to transition the program from \"one of the game's greatest coaches in Mike Krzyzewski to another of basketball's greatest coaches in Gregg Popovich.\"\n\"This progression plan will also help ensure that our National Team will continue to build on the culture and success we have achieved since launching the program,\" Colangelo said.\nThe Express-News will have more on this story as it develops.", "external_links": ["http://ww2.hdnux.com/photos/36/17/71/7929429/3/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/13/00/15/2884447/5/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/07/34/55/1952632/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/36/10/12/7897762/5/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/34/32/33/7448272/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/03/65/06/1003913/4/920x920.jpg", "http://ww1.hdnux.com/photos/36/10/11/7897704/5/920x920.jpg", "http://ww4.hdnux.com/photos/13/36/77/3010511/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/03/53/21/963677/3/920x920.jpg", "http://ww3.hdnux.com/photos/01/67/64/490790/4/920x920.jpg", "http://ww1.hdnux.com/photos/01/37/12/389804/3/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/34/32/33/7448272/3/920x920.jpg", "http://ww3.hdnux.com/photos/01/67/64/490790/4/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/36/10/11/7897698/5/920x920.jpg", "http://ww4.hdnux.com/photos/36/10/12/7897767/5/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/36/10/12/7897768/5/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/13/00/15/2884447/5/920x920.jpg", "http://ww3.hdnux.com/photos/01/57/13/455386/3/920x920.jpg", "http://ww2.hdnux.com/photos/07/05/15/1856365/4/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/03/65/06/1003913/4/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/15/40/71/3542609/3/920x920.jpg", "http://www.expressnews.com/sports/spurs/article/Air-Force-life-for-Popovich-Spy-satellites-and-5848368.php#/0", "http://www.expressnews.com/sports/spurs/article/Popovich-s-steel-roots-built-solid-foundation-for-5848359.php#/0", "http://ww3.hdnux.com/photos/36/10/12/7897762/5/920x920.jpg", "http://ww2.hdnux.com/photos/34/32/54/7449361/3/920x920.jpg", "http://ww2.hdnux.com/photos/15/40/71/3542609/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/36/10/12/7897765/5/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/36/10/12/7897768/5/920x920.jpg", "http://ww3.hdnux.com/photos/34/32/33/7448274/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/15/36/44/3533074/3/920x920.jpg", "http://ww3.hdnux.com/photos/36/10/11/7897698/5/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/36/10/11/7897702/5/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/36/10/11/7897703/5/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/36/10/12/7897763/5/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/36/17/71/7929429/3/920x920.jpg", "http://ww2.hdnux.com/photos/36/10/12/7897769/5/920x920.jpg", "http://ww2.hdnux.com/photos/11/73/23/2602197/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/03/53/21/963677/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/36/10/12/7897766/5/920x920.jpg", "http://ww4.hdnux.com/photos/13/36/77/3010511/3/920x920.jpg", "http://ww2.hdnux.com/photos/07/07/54/1866549/5/920x920.jpg", "http://ww2.hdnux.com/photos/07/07/54/1866549/5/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/36/10/11/7897704/5/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/36/10/11/7897701/5/920x920.jpg", "http://ww2.hdnux.com/photos/01/44/00/409609/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/11/73/23/2602197/3/920x920.jpg", "http://ww2.hdnux.com/photos/02/43/67/671209/3/920x920.jpg", "http://ww3.hdnux.com/photos/36/10/11/7897702/5/920x920.jpg", "http://ww2.hdnux.com/photos/36/10/12/7897769/5/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/02/43/67/671209/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/36/10/12/7897766/5/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/15/65/16/3625914/11/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/11/62/42/2566318/3/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/36/10/12/7897764/5/920x920.jpg", "http://ww1.hdnux.com/photos/01/63/54/473884/7/920x920.jpg", "http://ww2.hdnux.com/photos/34/32/54/7449361/3/square_gallery_thumb.jpg", "http://bleacherreport.com/articles/1656735-an-ode-to-the-most-interesting-man-in-the-nba-gregg-popovich/page/11", "http://ww4.hdnux.com/photos/36/10/11/7897703/5/920x920.jpg", "http://ww4.hdnux.com/photos/36/10/12/7897763/5/920x920.jpg", "http://ww1.hdnux.com/photos/36/10/11/7897700/5/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/01/44/00/409609/3/920x920.jpg", "http://ww3.hdnux.com/photos/36/17/71/7929430/3/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/07/74/07/2081268/3/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/07/34/55/1952632/3/920x920.jpg", "http://ww2.hdnux.com/photos/36/10/11/7897705/5/920x920.jpg", "http://www.expressnews.com/sports/spurs/article/Hard-work-loyalty-5835278.php#/0", "http://ww1.hdnux.com/photos/01/44/73/413416/3/920x920.jpg", "http://ww3.hdnux.com/photos/34/32/33/7448274/3/920x920.jpg", "http://sports.espn.go.com/espn/page2/story?id=5030143&sportCat=nba", "http://ww3.hdnux.com/photos/36/10/12/7897770/5/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/36/10/12/7897765/5/920x920.jpg", "http://ww3.hdnux.com/photos/01/57/13/455386/3/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/07/74/07/2081268/3/920x920.jpg", "http://ww1.hdnux.com/photos/01/44/73/413416/3/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/01/63/54/473884/7/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/36/10/11/7897700/5/920x920.jpg", "http://ww3.hdnux.com/photos/15/65/16/3625914/11/920x920.jpg", "http://ww3.hdnux.com/photos/36/17/71/7929430/3/920x920.jpg", "http://ww2.hdnux.com/photos/07/05/15/1856365/4/920x920.jpg", "http://ww2.hdnux.com/photos/36/10/11/7897701/5/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/15/36/44/3533074/3/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/36/10/12/7897767/5/920x920.jpg", "http://ww2.hdnux.com/photos/36/10/11/7897705/5/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/01/37/12/389804/3/920x920.jpg", "http://ww3.hdnux.com/photos/11/62/42/2566318/3/920x920.jpg", "http://ww1.hdnux.com/photos/36/10/12/7897764/5/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/36/10/12/7897770/5/920x920.jpg"], "published": "2015-10-23T21:00:00.000+03:00", "crawled": "2015-10-23T22:33:27.812+03:00", "highlightTitle": ""}