{"organizations": [], "uuid": "3027abc3762934e78625e3dce55f48eb95bf66c6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.philly.com", "main_image": "http://media.philly.com/images/Barbre.JPG", "site_section": "http://www.philly.com/mld/philly/sports/football/rss.xml", "section_title": "Philly.com Sports Eagles", "url": "http://www.philly.com/r?19=961&43=168381&44=331833231&32=3796&7=195322&40=http%3A%2F%2Fwww.philly.com%2Fphilly%2Fsports%2Feagles%2F20151011_Big__big_Bird_talks_heritage__hot_rods.html", "country": "US", "title": "Big, big Bird talks heritage, hot rods", "performance_score": 0, "site": "philly.com", "participants_count": 0, "title_full": "Big, big Bird talks heritage, hot rods", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T04:22:00.000+03:00", "replies_count": 0, "uuid": "3027abc3762934e78625e3dce55f48eb95bf66c6"}, "author": "", "url": "http://www.philly.com/r?19=961&43=168381&44=331833231&32=3796&7=195322&40=http%3A%2F%2Fwww.philly.com%2Fphilly%2Fsports%2Feagles%2F20151011_Big__big_Bird_talks_heritage__hot_rods.html", "ord_in_thread": 0, "title": "Big, big Bird talks heritage, hot rods", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SHOP: Eagles Training Camp sportswear \nNevertheless, in June the Birds signed Barbre to a 3-year, $4.5 million extension and anointed him their starting left guard - a position he never played before. He is slowly adapting, perhaps the steadiest member of a battered and often beaten unit. He always adapts. \nBarbre's college coach, John Ware, had a heart attack at his desk and died during the 2005 season, when Barbre was a junior. Ware was just 46. \nA straightforward Missourian, Barbre has been shaped by experience into an interesting, complex man. Marcus Hayes spoke recently with the reticent giant about his upbringing, his Native American roots in Louisiana's Tunica-Biloxi Tribe and his hobbies: hunting and hot rods. \nQ So, during a routine genealogy search, your family discovered that you have Native American roots? Does that entitle you to any rights? \nWhen I was about 10, my grandpa, Edward Allen, was going through and finding out what percentage of everything everybody was. I'm one-eighth. \nI hear I could go down on the reservation in Louisiana and maybe get a job there. There's a casino, and you have first dibs on jobs. They'll help you with housing, too. My grandpa lives on the reservation now. \nQ Would that have been an alternative career? Dealing cards? You're a car nut: Maybe a mechanic? \nI didn't really know what I wanted to do coming out of high school. If I didn't get that scholarship offer, I don't think I would have pursued football anymore. Probably I would have gone in the military. I needed structure and discipline coming out of high school. Probably the Marines. \nBut I do love old hot rods. Camaros and Chevelles. I love the '60s, '70s era. I watch the car auction shows and think, \"I'd like to have that car,\" but I'm not going to blow my money on that. . . . \nEight years ago I bought a '69 Camaro that I would love to fix up someday. I've just never decided I wanted to burn $50,000 on it yet. It's kind of taken apart, just sitting in a buddy's body shop back in Missouri. Motor's out of it. Interior's out of it. Never been able to pull the trigger. \nQ Speaking of triggers . . . \nYeah, I love to hunt. If I ever do have to go to work, I'd like to do something in conservation. I look at myself as a conservationist. I like to preserve what we have. I love to hunt, but I don't like to just kill everything - shoot everything just to shoot it. \nI love to trophy hunt, like the mature white-tail deer. That's a challenge in itself, if you know anything about hunting. . . . \nI put out minerals for deer, lots of protein, make sure they get their proper nutrition. You can grow, like, an extra 8 to 15 inches on a deer's rack. That deer at 5, 6 years old might be a 150-inch deer; you might grow him into a 180-inch deer if you manage it right. It's wildlife biology stuff. \nQ It sounds like you are in touch with your Native American heritage. \nI've always been fascinated with the fact that I'm Native American. They've got a museum [on the Tunica-Biloxi reservation.] \nEvery time I go down there, I go through the museum. My great-great grandfather was a chief. I learn about our heritage. \nQ As an NFC East player, you play that Washington team twice a year now. What do you think about their controversial \"Redskins\" name? \nYeah, that probably is a racist term, if you're Native American. I refuse to say that name.", "external_links": [], "published": "2015-10-10T04:22:00.000+03:00", "crawled": "2015-10-10T05:38:04.120+03:00", "highlightTitle": ""}