{"organizations": ["Palmers", "Dunhams Safari"], "uuid": "8fac8527dce366b78eb889ab4ab8c5a5a9d07482", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.artipot.com", "main_image": "", "site_section": "http://rss.artipot.com/category/171", "section_title": "Artipot: Recreation and Sports > Hunting Articles", "url": "http://www.artipot.com/articles/1945024/choose-an-experienced-company-before-going-for-a-lion-hunting-in-south-africa.htm", "country": "US", "title": "Choose an Experienced Company Before Going For A Lion Hunting in South Africa (kenyon marlin)", "performance_score": 0, "site": "artipot.com", "participants_count": 0, "title_full": "Choose an Experienced Company Before Going For A Lion Hunting in South Africa (kenyon marlin)", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T10:03:00.000+03:00", "replies_count": 0, "uuid": "8fac8527dce366b78eb889ab4ab8c5a5a9d07482"}, "author": "", "url": "http://www.artipot.com/articles/1945024/choose-an-experienced-company-before-going-for-a-lion-hunting-in-south-africa.htm", "ord_in_thread": 0, "title": "Choose an Experienced Company Before Going For A Lion Hunting in South Africa (kenyon marlin)", "locations": ["Minnesota", "South Africa", "Zimbabwe"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Palmer", "James Palmer", "Cecil"], "text": "By kenyon marlin Oct 18, 2015 Cecil, The Lion Controversy, is a story that swept across the world was one that filled people with rage. The main question that keeps on popping in lion hunters head is does the story really need such attraction? And, if your answer is yes then why? First of all, let's have a quick review about the controversy that took place in the Jungles of South Africa where trophy hunting is legal as well as ethical. Cecil, a 13-year-old male lion in Zimbabwe was killed in an organized high-dollar game hunt by Dr. Palmer. Dr.Walter James Palmer, a dentist from Minnesota, reportedly paid fifty thousand dollars to hunt and kill a lion in Zimbabwe. Cecil was a major attraction at Hwange National Park in Zimbabwe. The dentist, with the help of local guides, lured it out of the park and injured it with an arrow. Forty hours later, he finally tracked down Cecil where he proceeded to shoot and kill the big cat. Palmer then continued on to decapitate and skin Cecil and leave his headless skeleton where he killed the beast. The case immediately garnered national attention as millions of people expressed the anger towards the seemingly needless killing of such a majestic creature. Comments ranged from calling for Palmers death to saying Palmer did nothing wrong. As we all know that lion hunting is legal in some parts of South Africa.There are several companies like Dunhams Safari, who organise trophy hunting as an adventure activity and the best part is, there is a large number of people who love such kind of outdoor, adventurous activities which allow them to stay active and close to the wildlife. Also, large animals, such lions, are generally seen as dangerous by locals, and if they aren't hunted, their populations could explode and bring on increased attacks of people. After the outrage caused by the death of Cecil, most of the hunters are in a quandary that whether they should go for lion hunting or not. And, if yes then which company to trust so that there would be no legal issues after the hunting. The companies that organise trophy hunting have been debating for years about whether hunting can be justified if the fees collected from it, help fund conservation efforts that their government would not be able to afford otherwise. So, before going for a trophy hunting in this African country, you should select a company who have experienced hunter guides and are fully knowledgeable about every in-and-out of the hunting. About the Author Author is a passionate writer. This article is about lion hunting in South Africa. Get more details: www.dunhams.ca Rating:", "external_links": [], "published": "2015-10-18T10:03:00.000+03:00", "crawled": "2015-10-18T14:34:58.056+03:00", "highlightTitle": ""}