{"organizations": [], "uuid": "64c1858845f793ed3ac4e9a07c2b280fa086f1c8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nydailynews.com", "main_image": "http://assets.nydailynews.com/polopoly_fs/1.2410899!/img/httpImage/image.jpg_gen/derivatives/landscape_1200/cowboys-giants-football.jpg", "site_section": "http://www.nydailynews.com/sports/index.html", "section_title": "Sports News &amp; Articles: Today’s Latest Sports News - NY Daily News", "url": "http://www.nydailynews.com/sports/football/giants/instanat-analysis-giants-cowboys-article-1.2410900", "country": "US", "title": "Instant analysis: Giants defeat Cowboys, 27-20", "performance_score": 0, "site": "nydailynews.com", "participants_count": 1, "title_full": "Instant analysis: Giants defeat Cowboys, 27-20 - NY Daily News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T02:00:00.000+02:00", "replies_count": 0, "uuid": "64c1858845f793ed3ac4e9a07c2b280fa086f1c8"}, "author": "NEW YORK DAILY NEWS", "url": "http://www.nydailynews.com/sports/football/giants/instanat-analysis-giants-cowboys-article-1.2410900", "ord_in_thread": 0, "title": "Instant analysis: Giants defeat Cowboys, 27-20", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Seth Wenig/AP What we learned: The Giants may still be the team to beat in the NFC East.\nMaybe.\nIf nothing else, they definitely aren't nearly the disaster that they seemed to be Monday night in Philadelphia.\nNot that anyone thought they were that bad, but it had to be encouraging for Tom Coughlin to see his team eliminate the stupid penalties and play a much sounder brand of football.\nRELATED: GIANTS GET THEIR REVENGE ON COWBOYS IN 27-20 WIN\nWhat the Giants proved is that they remain good enough to be in most every game they play … We also learned the Giants remain a very flawed team in the trenches.\nTheir offensive line continues to struggle in pass protection and the defensive line continues to struggle with the pass rush. That will be their undoing eventually if they can't get it fixed, some way, somehow. … We also learned something we probably already knew: That Tom Coughlin is willing to put his team at risk to send a message, especially to a young player.\nThird-year DE Damontre Moore was inactive on Sunday afternoon, despite having three of the Giants' eight sacks this season and flashing an ability that has made him look like potentially one of the team's best pass rushers.\nMoore, of course, committed a terrible, costly, roughing-the-passer penalty Monday night in Philadelphia and later blamed it on his \"low football IQ.\"\nThe next day, Coughlin telegraphed this benching by saying he couldn't trust Moore. Granted, this was a low-risk move.\nMoore had become a player limited to passing downs, for the most part. But it's not like anyone else on the Giants' defensive line has been getting close to the quarterback this season.\nGame ball: Split it between CB Dominique Rodgers-Cromartie, who had two interceptions, including one that he returned 58 yards for a touchdown, and KR Dwayne Harris, who had a 100-yard kickoff return for a touchdown in the fourth quarter.\nMake it a 60-40 split, though, because Harris' story is juicier, coming against his old team and finally showing fans why the Giants gave him a very controversial five-year, $17 million contract in the offseason.\nWhat this means: History won't repeat. A year ago the Giants went 0-2, won three straight, then went to Philadelphia and lost a brutal game, and that started a season-killing seven-game losing streak.\nThis year the Giants went 0-2, won three straight, then went to Philadelphia and lost a brutal game, and that … didn't start a losing streak at all.\nNow that the Giants are 4-3 and back on the winning track, all comparisons to last year's disaster are off. Also, the Giants remain in first place in the NFC East, which remains wide, wide open to any team that can get hot.\nGood sign: The Giants' stagnant rushing attack may have found a breakout star in Orleans Darkwa.\nGround yardage has been so hard to come by for this team, behind this offensive line, but Darkwa came in and ran hard, made defenders miss, and consistently picked up up-the-middle yards.\nHe ended up with 48 yards. Really, the way he was playing he probably should've played a lot more. … The Giants' defense continues to be opportunistic, as shown by the 58-yard interception return for a touchdown by Dominique Rodgers-Cromartie. It was his seventh career touchdown and his second of the season against the Cowboys. … Kicker Josh Brown is money. He connected on his 18th consecutive field goal in the second quarter to break his own team record. The way the Giants' offense keeps stalling, sometimes he feels like the MVP of the team.\nBad sign: The safest place in America on Sundays (or sometimes Thursdays or Mondays) is the pocket behind the offensive line of whatever team the Giants are playing. Their ability to generate any sort of a pass rush is startlingly bad. Who knows if Moore could've helped? It's not like they had much of a rush when he was out there. In this game, they again had none and Cowboys QB Matt Cassel had so long to throw his receivers could've run a route, come back and run a second one before he was in danger of being hit on most plays. … Meanwhile, on the opposite end of that spectrum, it continues to be amazing that Eli Manning is riding a consecutive games played streak of 174 because he's not getting much protection.\nThe Giants' quick-pass offense is bailing him out from taking a lot of abuse, but he sure seems to be under duress every time he drops back to throw. … This was never going to be easy against the Cowboys' offensive line, but the Giants gave up an absolutely ridiculous 233 rushing yards.\nThey came into the game giving up only 93.5 per game, seventh best in the league. There were times - especially early - when running up the middle looked far too easy for a Cowboys team that lost starter Joseph Randle to injury in the first half. … Anybody seen Odell Beckham? Just four targets in the first half and only two catches for 19 yards. There were times it looked like he was having trouble getting open, but the Giants weren't overly aggressive in throwing him the ball either. And to be fair, they had very few offensive chances in the second half.\nNext week: As much fun as it might seem to spend Halloween weekend in New Orleans, that hasn't exactly been a hospitable city for the Giants in recent years/decades. The last time the Giants won a game down there was 1993 (though they've only played four games there since then). And they've lost their last three there (since 2003) in big fashion - by an average score of 47-20. The Saints scored 49, 48 and 45 points in those three games. OK, these aren't the same high-flying Saints. They're 3-4 after they barely held on for a 27-21 win in Indianapolis on Sunday (a game they led 27-0 in the third quarter), and they were 17th in the NFL in scoring (22.3 points per game). They can still throw the ball, though (7th overall in offense and 3rd in passing offense) and that could be problematic for the Giants' defense, which still can't rush the quarterback. And unfortunately, as they've learned the hard way, when the Saints' offense gets going in the Superdome, things can very, very quickly get out of hand.\nRelated Stories Giants get their revenge on Cowboys, win key NFC East game Video: Giants support LGBT athletes via You Can Play project Patriots too much for Jets, win AFC East showdown 30-23 Giants’ Damontre Moore inactive for game vs. Dallas Cowboys Tags: dallas cowboys , damontre moore , dominique rodgers-cromartie , dwayne harris , orleans darkwa , josh brown", "external_links": [], "published": "2015-10-26T02:00:00.000+02:00", "crawled": "2015-10-26T02:10:31.022+02:00", "highlightTitle": ""}