{"organizations": [], "uuid": "fec5c963dbbd8363ea16cea90b913476f2356dba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.saudigazette.com.sa", "main_image": "", "site_section": "http://www.saudigazette.com.sa/index.cfm?method=home.cat&categoryid=2015100565339", "section_title": "Sports | Saudi Gazette", "url": "http://www.saudigazette.com.sa/index.cfm?method=home.con&contentid=20151005258724", "country": "US", "title": "Australia eliminates England", "performance_score": 0, "site": "saudigazette.com.sa", "participants_count": 1, "title_full": "Australia eliminates England | Sports | Saudi Gazette", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T05:29:00.000+03:00", "replies_count": 0, "uuid": "fec5c963dbbd8363ea16cea90b913476f2356dba"}, "author": "LONDON", "url": "http://www.saudigazette.com.sa/index.cfm?method=home.con&contentid=20151005258724", "ord_in_thread": 0, "title": "Australia eliminates England", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Australia’s Bernard Foley scores their second try against England during their IRB Rugby World Cup 2015 Pool A match at Twickenham Stadium in London Saturday. — Reuters\nLONDON — Host England was eliminated from the Rugby World Cup at the pool stage for the first time after a humiliating 33-13 defeat against Australia that sends the Wallabies and Wales through to the quarterfinals.\nAustralia and Wales occupy the top two places in Pool A with 13 points each after Saturday’s game, leaving England trailing in third place on six points with one pool match remaining.\nIt was Australia’s highest score and biggest margin of victory over England at Twickenham, where it won the first of its two World Cups by beating the English in the 1991 final.\nThe Wallabies will play Wales at Twickenham for top spot in the pool before England close its tournament against Uruguay in Manchester next Saturday evening.\nEngland’s head coach Stuart Lancaster apologized to the home fans who had packed Twickenham.\n“Sorry we let everyone down. The last five or 10 minutes we came up short. We have young players and I hope everyone stays behind them,” he said.\nFlyhalf Bernard Foley scored two tries and kicked 18 points for Australia, who led 17-3 at halftime, with centre Matt Giteau adding a late third try after wing Anthony Watson had charged over for England.\nAustralia was too fast and mobile for England at the breakdown and its backs pierced gaps in the defense with smart offloads at pace while the home forwards failed to dominate the Wallabies in the scrum.\nEngland flyhalf Owen Farrell kicked eight points but sat out the end of the match in the sin bin.\nEarlier in the day Japan lit up the tournament once again with a 26-5 victory over Samoa in Milton Keynes before South Africa went top of Pool B by beating Scotland 34-16 in Newcastle.\nTwice world champion South Africa, stunned 34-32 by Japan in its opening match, scored first-half tries through flanker Schalk Burger and wing JP Pietersen, his fourth of the tournament, to lead 20-3 at halftime.\nScotland rallied to make the Springboks work hard for a win that was completed by Bryan Habana’s 61st test try, a Springboks’ record, after Tommy Seymour had pulled one back for the Scots.\nJapan, which had won only one match in 24 at previous tournaments, made Samoa pay for indiscipline that resulted in three players being sent to the sin bin during the match.\nFullback Ayumu Goromaru kicked four penalties and two conversions for a 16-point haul to become the tournament’s top scorer with 45 points and keep alive Japan’s hopes of reaching the quarterfinals.\nSouth Africa lead Pool B by one point from the Scots, with Japan two points further back. All three have two wins apiece.\nThe Springboks and Japan both have remaining matches against the United States, which is bottom with no points, while Scotland faces Samoa.\nSouth Africans had more than one reason to celebrate Saturday, however. The late Nelson Mandela, who memorably handed winning captain Francois Pienaar the William Webb Ellis trophy at the 1995 final, was inducted into the Rugby Hall of Fame before their win in Newcastle. — Reuters", "external_links": [], "published": "2015-10-05T05:29:00.000+03:00", "crawled": "2015-10-05T02:56:39.580+03:00", "highlightTitle": ""}