{"organizations": ["Michigan State"], "uuid": "646f303d6b433e91a2a35c3a4cdb2cdd17a2d1d3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cincinnati.com", "main_image": "http://www.gannett-cdn.com/-mm-/546f570b5e25b27f3d3ea18cda0235763c6ea591/c=0-346-2995-2038&amp;r=x633&amp;c=1200x630/local/-/media/2015/03/29/Louisville/Louisville/635632557500934666-UofL15-SAM.jpg", "site_section": "http://rssfeeds.cincinnati.com/cincinnati-sports", "section_title": "Cincinnati - Sports", "url": "http://www.cincinnati.com/story/sports/college/university-of-cincinnati/2015/10/08/tommy-tuberville-salary-ranks-50-among-ncaa-football-coaches/73590378/", "country": "US", "title": "Pitino: Resigning would be 'cowardly way out'", "performance_score": 0, "site": "cincinnati.com", "participants_count": 0, "title_full": "Pitino: Resigning would be 'cowardly way out'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T02:34:00.000+03:00", "replies_count": 0, "uuid": "646f303d6b433e91a2a35c3a4cdb2cdd17a2d1d3"}, "author": "", "url": "http://www.cincinnati.com/story/sports/college/university-of-cincinnati/2015/10/08/tommy-tuberville-salary-ranks-50-among-ncaa-football-coaches/73590378/", "ord_in_thread": 0, "title": "Pitino: Resigning would be 'cowardly way out'", "locations": ["Syracuse", "NY", "Louisville"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Katina Powell", "Jeff Greer", "Rick Pitino", "Sam Upshaw Jr.", "Jeff Faughender", "Chris White"], "text": "Pitino: Resigning would be 'cowardly way out' Jeff Greer , @jeffgreer_cj 7:20 p.m. EDT October 8, 2015 The C-J's Jeff Greer and Chris White discuss the Katina Powell book, head coach Rick Pitino's reaction to it and what it means for basketball recruiting. Video by Jeff Faughender Louisville basketball head coach Rick Pitino instructs his team against Michigan State during the Elite 8 tournament game in Syracuse, NY. March 29, 2015 (Photo: Sam Upshaw Jr.; The C-J) \nLouisville basketball coach Rick Pitino said resigning from his job amid an NCAA and internal investigation would be the \"cowardly way out\" in a radio interview on Thursday evening. \nPitino, in a riveting 20-minute back-and-forth with host Terry Meiners on WHAS-840, said he had received the full backing of Louisville athletic director Tom Jurich after news broke last Friday that a new book filled with major allegations against the U of L hoops program was coming out soon. He also said he had not considered resigning. \n\"I don't know what resigning would accomplish,\" Pitino said. \"I think that's the cowardly way out ... What does it do for the program if the head coach just runs away?\" \nThe book, titled \"Breaking Cardinal Rules: Basketball and the Escort Queen,\" was written by an escort, Katina Powell, who claims former U of L director of basketball operations Andre McGee paid her and other escorts, including her own teenage daughters, thousands of dollars and gave them game tickets in exchange for them dancing for and having sex with players and recruits. U of L book prompts costly investigation \nMcGee, through his lawyer, Scott C. Cox, has denied the allegations. Meanwhile U of L, after learning about the book's claims, hired former NCAA enforcement staffer Chuck Smrt to conduct an investigation. Jurich said Smrt and U of L's compliance office would be working with the NCAA on the inquiry into Powell's claims. \nA CBS Sports report on Thursday said former U of L recruit JaQuan Lyle, now an Ohio State freshman, told NCAA investigators that the \"gist\" of the allegations in the book were true. Reports of several other former U of L recruits speaking to the NCAA have also surfaced. \nIn mentioning the Lyle story to Pitino, Meiners mistakenly said an NCAA source leaked the information to CBS. Meiners corrected himself, saying CBS just mentioned an unnamed source, but Pitino, who was hearing the story for the first time, was livid. \n\"Isn't that great?\" Pitino said. \"That's just terrific.\" \nThen, Pitino added, \"I doubt seriously anybody from the NCAA would leak that type of information. It would mean their job. (It's) more than likely JaQuan Lyle told somebody that ... But I can't doubt anything anymore.\" Report: Lyle confirms gist of book claims \nPitino said he has had one conversation with McGee, who is now an assistant coach at UMKC but currently on administrative leave, since U of L learned of the book's explosive allegations. \nBut after that conversation, Pitino said, Louisville's compliance office advised him to stop seeking out former coaches and players, including McGee about the book, as the internal investigation picks up. \n\"I don't know if he told me the truth or not,\" Pitino said, later saying McGee \"was a great kid here.\" \n\"An educated person can't think he's going to get a recruit by strippers coming in. I don't get it.\" \nHe insisted he wasn't sure why McGee would think allegedly paying strippers and escorts to entertain recruits would help him climb the career ladder, saying that if a recruit committed to U of L, McGee would get \"zero credit\" for it. \nRecruiting players, Pitino said, wasn't in McGee's job description as a program assistant and then director of basketball operations, though in 2012 McGee said he would \"assist in coordinating events and visits for recruiting\" as a program assistant in a copy of his resume obtained through a public records request by The Courier-Journal. \nPitino also seemed upset that a statement put out earlier Thursday by U of L president James Ramsey, who said he \"fully supports\" Jurich, did not mention him by name. When Meiners asked Pitino why Ramsey apparently left him out of his statement, Pitino said he wasn't sure. U of L president Ramsey preaches patience \nHe said he was sorry Ramsey \"didn't think enough to mention me, but that's something I can't control,\" later adding that \"if I get the feeling that he wants (him to resign), I'd pack my bags and leave.\" \nThe Hall of Fame coach, about to begin his 15th season at U of L, said he would leave self-imposed punishments – if U of L's basketball program is found to have committed any NCAA violations – up to Jurich and the administrators. \n\"I'm just going to concentrate on giving these guys the best season they can possibly have,\" Pitino said. 39 CONNECT 36 TWEET LINKEDIN COMMENT EMAIL MORE Read or Share this story: http://cjky.it/1RwK025 TOP VIDEOS", "external_links": [], "published": "2015-10-09T02:34:00.000+03:00", "crawled": "2015-10-09T05:27:07.433+03:00", "highlightTitle": ""}