{"organizations": [], "uuid": "13ece380481cfedd71ffd8ff280f5aefff37de43", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/49272407.cms", "site_section": "http://timesofindia.indiatimes.com/sports/articlelist/4720866.cms", "section_title": "Top Stories - Tennis - Sports - The Times of India", "url": "http://timesofindia.indiatimes.com/sports/tennis/top-stories/Djokovic-ends-Chinese-hopes-in-less-than-an-hour/articleshow/49272285.cms", "country": "IL", "title": "Djokovic ends Chinese hopes in less than an hour", "performance_score": 0, "site": "indiatimes.com", "participants_count": 2, "title_full": "Djokovic ends Chinese hopes in less than an hour - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T23:48:00.000+03:00", "replies_count": 1, "uuid": "a88ebdea9662009db216b325a89ef0bd5d5ce67a"}, "author": "timesofindia.indiatimes.com", "url": "http://timesofindia.indiatimes.com/sports/tennis/top-stories/Djokovic-ends-Chinese-hopes-in-less-than-an-hour/articleshow/49272285.cms#post-0", "ord_in_thread": 0, "title": "Djokovic ends Chinese hopes in less than an hour", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BEIJING: Novak Djokovic emphatically ended home hopes at the China Open on Thursday as he beat Zhang Ze to reach the quarterfinals with his 26th straight win at the tournament.\nThe world number one, unbeaten in five appearances in Beijing, had no room for sentiment for Beijing fans as he won 6-2, 6-1 in just 55 minutes on a bright, chilly day.\nWildcard Zhang, China's number one but ranked 219th in the world, could not contend with the power and precision of Djokovic's ground strokes as he was broken immediately and soon yielded the first set.\nThe result was never in doubt and Djokovic converted his first match point with a dismissive backhand volley as Zhang struggled at the back of the court.\nWith 26 wins and no defeats, Djokovic joins Jimmy Connors in second place on the list of unbeaten starts to a tournament, behind only Rafael Nadal's 31 at the French Open.\nBut the day's most historic achievement came from Ivo Karlovic, who broke Goran Ivanisevic's record for career aces as he went down to Uruguay's Pablo Cuevas.\nThe 6ft 11ins (2.11m) Karlovic hammered 26 aces in his 7-6 (7/5), 7-6 (9/7) defeat, reaching a career total of 10,247 and surpassing compatriot Ivanisevic's 10,237 along the way.\nThe record was consolation for Karlovic after his loss to 37th-ranked Cuevas, who is enjoying a dream run in Beijing after he beat world number five Tomas Berdych in the first round.\nThe thunderous serve of Karlovic, 36, also yielded 45 aces in this year's quarter-final victory over Berdych in Halle -- the most recorded in a three-set match.\nIn the women's draw, last month's US Open finalists both suffered upsets with New York winner Flavia Pennetta, who will retire at the end of the season, going out 3-6, 6-4, 6-3 to Anastasia Pavlyuchenkova.\nPennetta's defeat came after fellow Italian Roberta Vinci was beaten 6-1, 3-6, 6-2 by Bethanie Mattek-Sands, in yet another surprise at the unpredictable Beijing tournament. Stay updated on the go with Times of India News App. Click here to download it for your device.", "external_links": ["https://play.google.com/store/apps/details?id=com.toi.reader.activities"], "published": "2015-10-08T23:48:00.000+03:00", "crawled": "2015-10-08T16:56:08.136+03:00", "highlightTitle": ""}