{"organizations": [], "uuid": "82a8a289aa8bd0a52623d73a78dede30f6039a83", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.timesunion.com", "main_image": "http://ww3.hdnux.com/photos/41/34/36/8767362/3/rawImage.jpg", "site_section": "http://timesunion.com//sports/collectionRss/Sports-Block-States-Homepage-48042.php", "section_title": "Sports Block States Homepage", "url": "http://www.timesunion.com/sports/article/Jets-spoil-Hynes-debut-as-Devils-coach-beat-New-6562489.php", "country": "US", "title": "Jets spoil Hynes' debut as Devils coach, beat New Jersey 3-1", "performance_score": 0, "site": "timesunion.com", "participants_count": 1, "title_full": "Jets spoil Hynes' debut as Devils coach, beat New Jersey 3-1 - Times Union", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T01:00:00.000+03:00", "replies_count": 0, "uuid": "82a8a289aa8bd0a52623d73a78dede30f6039a83"}, "author": "timesunion.com", "url": "http://www.timesunion.com/sports/article/Jets-spoil-Hynes-debut-as-Devils-coach-beat-New-6562489.php", "ord_in_thread": 0, "title": "Jets spoil Hynes' debut as Devils coach, beat New Jersey 3-1", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photo: Rich Schultz, AP Image 1 of / 4   4 Winnipeg Jets forward Andrew Ladd, center, is surrounded by teammates after scoring a goal against the New Jersey Devils during the second period of an NHL hockey game in Newark, N.J., Friday, Oct. 9, 2015.\nPhoto: Rich Schultz, AP Winnipeg Jets forward Andrew Ladd, center, is surrounded by... Image 2 of 4 New Jersey Devils forward Jiri Tlusty, front left, of the Czech Republic, celebrates his goal past Winnipeg Jets goalie Michael Hutchinson as center Alex Burmistrov (6), of Russia, looks back during the second period of an NHL hockey game in Newark, N.J., Friday, Oct. 9, 2015.\nPhoto: Rich Schultz, AP New Jersey Devils forward Jiri Tlusty, front left, of the Czech... Image 3 of 4 Winnipeg Jets forward Andrew Ladd (16) checks New Jersey Devils defensemen Adam Larsson (5), of Sweden, into the boards during the first period of an NHL hockey game in Newark, N.J., Friday, Oct. 9, 2015.\nPhoto: Rich Schultz, AP Winnipeg Jets forward Andrew Ladd (16) checks New Jersey Devils... Image 4 of 4 New Jersey Devils forward Jiri Tlusty (9), of the Czech Republic, shoots the puck past Winnipeg Jets goalie Michael Hutchinson (34) and defensemen Mark Stuart and Jacob Trouba (8) for a goal during the second period of an NHL hockey game in Newark, N.J., Friday, Oct. 9, 2015.\nPhoto: Rich Schultz, AP New Jersey Devils forward Jiri Tlusty (9), of the Czech Republic,... Jets spoil Hynes' debut as Devils coach, beat New Jersey 3-1 1  /  4 Back to Gallery NEWARK, N.J. (AP) — Andrew Ladd and Blake Wheeler each had a goal and an assist in a big second period and the Winnipeg Jets beat the New Jersey Devils 3-1 on Friday night to spoil John Hynes ' NHL coaching debut.\nMathieu Perreault had two assists in the three-goal second period and Michael Hutchinson made 20 saves to help the Jets won for the second time in two nights.\nMark Scheifele ignited the Winnipeg outburst with his second goal of the season. The Jets have scored six goals in the middle period this season.\nJiri Tlusty scored for New Jersey in his debut. It was actually an own goal that Winnipeg defenseman Jacob Trouba fired into his own net trying to clear a puck in front.\nCory Schneider made 27 saves for New Jersey, which has missed the playoffs the past three seasons.\nThe 40-year-old Hynes is the NHL's youngest coach.\nWinnipeg, which beat Boston 6-2 on Thursday night, dominated after being outshot 3-0 in the opening minute.\nScheifele, who got the Jets' first goal against the Bruins, got them started again with a shot from the left circle at 1:13. The puck seemed to fool Schneider and might have been deflected by Devils defenseman David Schlemko.\nLess than 3 minutes later, Wheeler snapped a shot past Schneider from the dot in the same circle. The goal was waved off by one of the referees, but replay clearly showed it hitting the back of the net. Even Schneider knew it.\nTlusty — with Trouba's assistance, cut the lead to a goal at 12:53, but Ladd beat Schneider from the right circle off a nice cross-ice pass by Perreault.\nHutchinson, whose 21 wins last season was second best among rookies, was at his best in the third period, stopping 10 shots.\nNOTES: The Devils named defenseman Andy Greene their captain Friday morning. He replaces Bryce Salvador , who retired. ... Jets goaltender Ondrej Pavelec got the night off after beating Boston. ... John Tortorella , who will coach Team USA at next year's World Cup, was at the game. ... F Kyle Palmieri made his Devils' debut, becoming the second New Jersey native to play for the team. ... Rookie Nikolaj Ehlers picked up his first NHL point with the primary assist on Scheifele goal.", "external_links": [], "published": "2015-10-10T01:00:00.000+03:00", "crawled": "2015-10-10T05:22:36.063+03:00", "highlightTitle": ""}