{"organizations": ["Seattle", "NFC", "Eagles Training Camp"], "uuid": "22ce7b0c1953d1b4701c0e21738ed3f5814d86c0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.philly.com", "main_image": "http://media.philly.com/images/eaglespanthers2-1200.jpg", "site_section": "http://www.philly.com/mld/philly/sports/football/rss.xml", "section_title": "Philly.com Sports Eagles", "url": "http://www.philly.com/philly/sports/eagles/20151025_Eagles-Panthers_scouting_report.html", "country": "US", "title": "Eagles-Panthers scouting report", "performance_score": 0, "site": "philly.com", "participants_count": 0, "title_full": "Eagles-Panthers scouting report", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T06:32:00.000+03:00", "replies_count": 0, "uuid": "22ce7b0c1953d1b4701c0e21738ed3f5814d86c0"}, "author": "", "url": "http://www.philly.com/philly/sports/eagles/20151025_Eagles-Panthers_scouting_report.html", "ord_in_thread": 0, "title": "Eagles-Panthers scouting report", "locations": ["Chicago", "Carolina"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Star Lotulelei", "Kawann Short", "Jared Allen", "Jason Peters", "Allen"], "text": "SHOP: Eagles Training Camp sportswear On Carolina's defensive line, pay attention to tackle Kawann Short. He is the NFC defensive player of the week after recording two sacks against Seattle last Sunday. Short will be a tough assignment for the Eagles' interior linemen. The Panthers' interior line also includes Star Lotulelei, the 2013 first-round pick who provides a stout presence in the middle of the line. Veteran Jared Allen missed last week's game, but he is probable to return on Sunday. Allen has 134 career sacks, but he is still searching for his first 2015 sack after an early-season trade from Chicago. Allen will go up against left tackle Jason Peters.\nPanthers head coach Ron Rivera and defensive coordinator Sean McDermott were Eagles assistants under Andy Reid. When the Panthers have the ball \nThe Eagles are expecting a different version of Panthers quarterback Cam Newton than the one they faced last season, when they sacked him nine times. Newton was coming off an ankle injury, and he's healthier for Sunday. That means Newton is more of a threat to run. \nNewton is an MVP candidate after leading the Panthers to a 5-0 start, and he hasn't done it with eye-popping passing statistics. He averages only 215.6 passing yards per game and completes only 55.4 percent of his passes, but he also has 225 rushing yards and three rushing touchdowns. That changes the way defenses play. The Eagles used Connor Barwin as a spy for part of the game last year, and they can utilize a similar technique this time. It might not be limited to just Barwin, but he has the size and athleticism to fill that role. Inside linebacker Mychal Kendricks is questionable with a hamstring injury that cost him the last two games, and DeMeco Ryans is also questionable. The defense will still feature rookie Jordan Hicks, who has impressed each week in the starting lineup. \nThe Panthers' passing game is limited in part because it lacks top receivers on the edge. After Kelvin Benjamin tore an anterior cruciate ligament in training camp, the Panthers have had to make due with an unheralded group that includes journeymen Ted Ginn and Jerricho Cotchery, rookie Devin Funchess, and Cardinal O'Hara alum Corey \"Philly\" Brown. Their top receiving threat is tight end Greg Olsen, who has 24 catches for 374 yards and three touchdowns. Safety Malcolm Jenkins spends a lot of time in the slot, but he could be tasked with trying to cover Olsen. \nThe Panthers' running game is led by Jonathan Stewart, who starred for Chip Kelly when Kelly was the offensive coordinator at Oregon. Stewart is averaging only 3.8 yards per carry, but the 235-pound runner is a key part of Carolina's offense. \nThe offensive line is in better shape this season than last. Center Ryan Kalil is one of the best players in the league at his position, and guards Trai Turner and Andrew Norwell are playing well in their first seasons as full-time starters. Norwell has a tough assignment against Fletcher Cox, one of the best defensive linemen in the NFL. The defensive line is the main reason the Eagles have allowed only 3.5 yards per carry and one touchdown. \nThe Eagles' defense has carried the team early in the season. It has allowed only three touchdowns in the last two weeks, and it has eight interceptions and eight fumble recoveries in six games. The big number \nPlus-6: That's the Panthers' turnover differential this season, and it is tied for the best margin in the NFL. Carolina has forced 11 turnovers in five games and only given the ball away five times. It's a good indicator of why the Panthers are 5-0 this season. The turnover differential could be the key statistic in Sunday's game. The Eagles defense has 16 takeaways, second most in the NFL. The Panthers' five giveaways are the fourth fewest in the NFL, though they've played one fewer game than most teams. The Eagles must break the Panthers' habits if they want to win the turnover battle. It will also be important for the Eagles to limit turnovers. Even with 16 takeaways, they are only plus-2 on the season because Sam Bradford's interceptions have been an ongoing problem. Bottom line \nZach Berman: Panthers 20, Eagles 17 \nJeff McLane: Panthers 23, Eagles 20", "external_links": [], "published": "2015-10-24T06:32:00.000+03:00", "crawled": "2015-10-24T07:05:52.919+03:00", "highlightTitle": ""}