{"organizations": [], "uuid": "26cc88f309f2f0940da84a98d22f64ca76aed225", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/49269282.cms", "site_section": "http://timesofindia.indiatimes.com/rssfeeds/4719148.cms", "section_title": "The Times of India Sports: Extensive sports coverage, key statistics and free downloads", "url": "http://timesofindia.indiatimes.com/sports/boxing/Mature-Vijender-Singh-ready-to-box-hard/articleshow/49269204.cms", "country": "IL", "title": "Mature Vijender Singh ready to 'box hard'", "performance_score": 0, "site": "indiatimes.com", "participants_count": 4, "title_full": "Mature Vijender Singh ready to 'box hard' - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T14:56:00.000+03:00", "replies_count": 3, "uuid": "f54eb55e36bbd5b5b08864ed2fd1fb5e6806478f"}, "author": "Ritu Sejwal", "url": "http://timesofindia.indiatimes.com/sports/boxing/Mature-Vijender-Singh-ready-to-box-hard/articleshow/49269204.cms#post-0", "ord_in_thread": 0, "title": "Mature Vijender Singh ready to 'box hard'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW DELHI: Having fought in the Indian colours for many years, Vijender Singh is on the verge of an entirely different experience - the cut-throat world of professional boxing when the Olympic medalist takes on Sonny Whiting on Saturday in his debut fight in Manchester.\n\nVijender feels his exposure as an amateur will work to his advantage against Whiting who has a 2-1 pro record with his debut bout being a knockout win. \"People are asking me 'Are you nervous?'. Why would I be nervous? I have done everything in my life - won medal at Olympics (2008) and World Championship (2009). For me, it's the same, I just have to go in the ring and box hard,\" the Indian told TOI on Wednesday.\n\n\"Just that the rules will be different from now on,\" he added.\n\nRecalling his first bout as an amateur back in 2001, the 29-year-old's journey from Bhiwani to Manchester has been a long one which has made him a mature boxer. \"When I started as an amateur, my first international bout was in Germany (2001). At that time I didn't know how to reduce weight or how to prepare for the bout. Now I know what to do, what to eat and how to prepare for the fight. I am mature and experienced now. And I am ready to take on the challenge,\" he said.\n\nOn Wednesday, Vijender met his British opponent for the first time in Manchester. And that brief meeting has given the Indian more than one reason to be ready for the fight. \"I am eager to take to the ring and break his confidence. I met him for the first time to day and on Saturday I will show him an Indian's power,\" Vijender said. \"He looked nervous to me. But we will see in the ring who is a better boxer,\" he said referring to Whiting's body language.\n\nVijender, who is found of Punjabi music, has decided to use 'Singh is King' to pep him as he enters the ring. \"Every boxer has an introductory music and I have chosen 'Singh is King',\" he sang a bit before adding, \"because I am Vijender Singh and Singh is king, and king is bling.\"\n\nFor the last one month, Vijender has been getting a hang of the new training regime under coach Lee Beard and alongside stable mates Jack Catterall, Adrian Gonzalez and Jimmy Kelly. Vijender hopes his decision to turn pro will motivate boxers back home.\n\n\"I am around new people, new coach and new fellow boxers, they are my new life now. I sometimes miss my old group of training mates but I have to be strong. Starting is always difficult but once other Indian boxers start turning pro then we will have our own team here too,\" he said. Stay updated on the go with Times of India News App. Click here to download it for your device.", "external_links": [], "published": "2015-10-08T14:56:00.000+03:00", "crawled": "2015-10-08T15:10:54.946+03:00", "highlightTitle": ""}