{"organizations": [], "uuid": "d0c73e69545299cfec17a82e54292f5abfd47f77", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/", "section_title": "Ahram Online - News, Business, Culture, Sports &amp; Multimedia from Egypt ", "url": "http://english.ahram.org.eg/NewsContent/6/55/161350/Sports/World/Guardiola-warns-Bayern-Munich-to-respect-wounded-A.aspx", "country": "EG", "title": "Guardiola warns Bayern Munich to respect wounded Arsenal - World - Sports", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "Guardiola warns Bayern Munich to respect wounded Arsenal - World - Sports - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "d0c73e69545299cfec17a82e54292f5abfd47f77"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/6/55/161350/Sports/World/Guardiola-warns-Bayern-Munich-to-respect-wounded-A.aspx", "ord_in_thread": 0, "title": "Guardiola warns Bayern Munich to respect wounded Arsenal - World - Sports", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related Preview: Fright night for Arsenal as Bayern Munich comes to town Bayern Munich have weaknesses, says Arsenal boss Wenger Bayern Munich confident coach Guardiola will stay on Wenger confident of Arsenal upset against Bayern Munich Buoyant Bayern wary of winless Arsenal in Champions League Unstoppable Bayern beat Werder for record league start Bayern Munich to open new training centre Pep Guardiola has warned his Bayern Munich players to brace themselves for a ferocious test from an Arsenal side fighting for Champions League survival.\nArsene Wenger's side are in severe danger of failing to reach the knockout stages for the first time in 16 years after two dismal defeats.\nThe Gunners were beaten at Dinamo Zagreb and then suffered the embarrassment of losing at home to Olympiakos, leaving them pointless at the bottom of Group F.\nAnother loss when Bayern visit the Emirates Stadium would put Arsenal on the verge of a stunning exit and Bayern boss Guardiola expects the hosts to fight like wounded animals on Tuesday.\n\"For them, they have an advantage because they have to win, when that happens with these kind of players, and the history of this club, they are going to make the best performance possible,\" Guardiola told reporters on Monday.\n\"I don't expect anything other than a fight for the 90 minutes.\n\"We have to look for another way to compete against them because of the enthusiasm they will have, so we will have to be intelligent and control our game.\n\"Of course I prefer to come here with six points, but I can imagine my team with zero points and playing in Germany against Arsenal.\n\"I can imagine the mentality of my team -- we would be an animal, because it is our last chance, you give everything and that will happen with Arsenal, so you have to be prepared.\n\"We saw what happened with Arsenal against Zagreb and Olympiakos, when no-one expected them (their opponents) to win, and it will be the same for us tomorrow.\"\nGuardiola's team have won all of their opening nine German league matches -– a Bundesliga record -– and have also made a 100 percent start to their Champions League campaign.\nBut Guardiola has no intention of letting his players rest on their laurels.\n\"There are still 12 points up for grabs, we are not qualified yet and have to fight and against one of the best teams in Europe,\" Guardiola added.\n\"They have great quality and are a very technical team.\n\"It is very difficult to play against them and find one Arsenal player who does not have quality.\"\n(For more sports news and updates, follow Ahram Online Sports on Twitter at @AO_Sports and on Facebook at AhramOnlineSports .)", "external_links": ["https://twitter.com/AO_Sports", "https://www.facebook.com/AhramOnlineSports?fref=ts"], "published": "2015-10-19T03:00:00.000+03:00", "crawled": "2015-10-20T04:25:54.463+03:00", "highlightTitle": ""}