{"organizations": ["Watford", "Arsenal"], "uuid": "3ee97e8b9acc1abb012e21af138098143dea0d7d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.sky.com", "main_image": "http://media.skynews.com/media/images/generated/2015/10/18/424768/default/v2/alexis-sanchez-arsenal-premier-league-3365191-1-1600x900.jpg", "site_section": "http://feeds.skynews.com/feeds/rss/sports.xml", "section_title": "Sports News - Latest Sports and Football News | Sky News", "url": "http://news.sky.com/story/1571531", "country": "IL", "title": "Sky Men Predict Arsenal Can Win The League", "performance_score": 0, "site": "sky.com", "participants_count": 0, "title_full": "Sky Men Predict Arsenal Can Win The League", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T07:52:00.000+03:00", "replies_count": 0, "uuid": "3ee97e8b9acc1abb012e21af138098143dea0d7d"}, "author": "", "url": "http://news.sky.com/story/1571531", "ord_in_thread": 0, "title": "Sky Men Predict Arsenal Can Win The League", "locations": ["UK"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jamie Redknapp", "Thierry Henry"], "text": "Sky Men Predict Arsenal Can Win The League 05:52, UK, Sunday 18 October 2015 Share by email Sky Pundits Jamie Redknapp and Thierry Henry debated Arsenal’s title chances following their 3-0 success over Watford - and reckoned the Gunners can become champions again. \nThree goals in a 12-minute second-half spell handed Arsenal the win at Vicarage Road, sending them back to second place in the Premier League table. \nRedknapp thinks Arsenal have as good as chance as anyone of claiming their first title since 2004. \n\"Look at everybody else this season - everybody has had their struggles and Arsenal have more than enough,\" Redknapp told Saturday Night Football. \n\"I also look to January and think they can bring in one or two players. The last window was a really strange one to say the least. They only got Petr Cech and not getting any outfield players, I thought at the time, was a huge mistake. \n\"If they go and win the league, you will say Arsene Wenger was right. I don't think there's a lot to fear. \n\"Manchester United had a brilliant performance today, Man City can turn it on but they can also throw games away. \n\"Arsenal have found some rhythm. They had a hard start to the season when they lost at home to West Ham and Olympiakos and Dinamo Zagreb, but at the moment they look as good as anybody, so why can't they win the league?\" \nHenry agreed with Redknapp but admitted they need to add consistency to their game in order to make title dreams a reality. \n\"They are in the mix for me,\" Henry said. \n\"Today was a massive response knowing everybody had won. Everybody was waiting to see if they were going to back up the win against United. Can they do it and maintain it for more than 15, maybe 20 games? That's what we want to see. \n\"They have to play like that all the time and win games like that sometimes where for an hour they struggle and then come out on top. \n\"Everybody can dream. If you love Arsenal I think they can win the title this season.\" Promoted Stories", "external_links": [], "published": "2015-10-18T07:52:00.000+03:00", "crawled": "2015-10-18T08:32:05.186+03:00", "highlightTitle": ""}