{"organizations": [], "uuid": "54e131bcb2a709750dc9a2b3d39783195507a340", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "wtop.com", "main_image": "http://wtop.com/wp-content/uploads/2015/10/Germany-FIFA-Soccer-World-Cup1.jpeg", "site_section": "http://wtop.com/section/sports/feed/", "section_title": "WTOP » Sections » Sports", "url": "http://wtop.com/sports/2015/10/germany-bid-from-spirit-of-fair-play-to-fifa-bribes-probe/", "country": "US", "title": "Germany bid: From ‘spirit of fair play’ to FIFA bribes probe", "performance_score": 0, "site": "wtop.com", "participants_count": 1, "title_full": "Germany bid: From ‘spirit of fair play’ to FIFA bribes probe", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T20:52:00.000+03:00", "replies_count": 0, "uuid": "54e131bcb2a709750dc9a2b3d39783195507a340"}, "author": "wtopstaff", "url": "http://wtop.com/sports/2015/10/germany-bid-from-spirit-of-fair-play-to-fifa-bribes-probe/", "ord_in_thread": 0, "title": "Germany bid: From ‘spirit of fair play’ to FIFA bribes probe", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Home » News » Sports » Germany bid: From 'spirit… Germany bid: From ‘spirit of fair play’ to FIFA bribes probe By ROB HARRIS October 17, 2015 1:52 pm FILE - In this Aug. 10, 1999 file photo Guenter Netzer, Fedor Radmann, Wolfgang Niersbach, FIFA president Sepp Blatter, Franz Beckenbauer, head of the German bid committee, Horst R. Schmidt, secretary general of the German Football Association (DFB) and Michel Zen-Ruffinen, Fifa secretary general, from left, pose during the presentation of the 2006 FIFA World Cup Bid of Germany at the Fifa headquarters in Zurich, Switzerland. (Christoph Ruckstuhl/Keystone via AP, file) \nBERN, Switzerland (AP) — The verdict from FIFA on Germany’s bid to host the 2006 World Cup was emphatic and gushing with praise. Germany, FIFA’s bid inspectors concluded, “demonstrated a true spirit of fair play.” By contrast, rival bidder England’s “behavior was not always in compliance with the FIFA recommendations.” \nFifteen years after American official Alan Rothenberg delivered his report, FIFA has promised a fresh investigation by lawyers into “very serious allegations” that Germany secured hosting rights to the soccer showpiece by bribing voters. \nThe central claim made by German news magazine Der Spiegel is that a slush fund of 10.3 million Swiss francs (then about $6 million) was used to secure four votes from FIFA’s 24-member executive committee in 2000. \nGerman foreign minister Frank-Walter Steinmeier on Saturday called on the country’s soccer federation “to initiate investigations and clarify the outstanding issues now as soon as possible.” \n“It’s in the interest of sport and football but it’s also in all our interest that nothing is left unclear,” Steinmeier said. \nA fresh denial came from German federation (DFB) president Wolfgang Niersbach in an interview conducted by their own website. \n“The World Cup was not bought,” Niersbach said of Germany’s 12-11 win over South Africa in the 2000 vote. \nThe DFB said it would not make Niersbach available to interviews. \nNiersbach and Franz Beckenbauer, the former Germany great who headed the bidding committee, as well as other high-ranking football officials were accused in the report of being aware of the slush fund by 2005 at the latest. That is when former Adidas chief Robert Louis-Dreyfus, who reportedly provided the funding, asked for the money back before the World Cup began. Louis-Dreyfus died in 2009. \nAlthough the allegations are fresh it is not the first time the finger of suspicion has been pointed at Germany, whose bid has never been found guilty of corruption. \nSepp Blatter, who is currently suspended from the FIFA presidency, hinted that there could have been wrongdoing in an interview in 2012. \n“World Cups being purchased,” Blatter pondered when asked by Swiss paper Blick about allegations surrounding the 2018 and 2022 World Cup votes. “I am reminded of the World Cup vote for 2006 when someone left the room at the last moment … maybe I was too well-meaning and naive.” \nWhen asked if he suspected the World Cup was bought by Germany, Blatter stressed: “I guess not.” \nCharlie Dempsey, then the Oceania president, abstained from voting despite being mandated to support the Nelson Mandela-backed South Africa bid in the final round. Dempsey said he received telephone threats from “influential European interests” the night before voting. He resigned from FIFA one week later and died in 2008. \nQuestions about Germany’s bid had surfaced soon after the winning vote and were highlighted within British parliamentary committee report into England’s bid failure. \nIn the appendix, sports scholar Alan Tomlinson referenced allegations in Germany that “in the run-up to the day of the vote, several new business deals with Asian countries were announced, worth several billion marks.” \n“Germany’s Federal Security Council relaxed its regulations to allow the export of 1,200 bazookas to Saudi Arabia,” Tomlinson wrote in a submission to the committee. “Deals were put in place to aid troubled Korean car manufacturer Hyundai, family business of FIFA executive committee member Dr. Chung (Moon-joon). \n“Further deals with South Korea were done, in plastics and chemicals. Bayer also announced huge investments in Thailand, home of FIFA executive committee member Worawi Makudi, known for his sideline in car dealerships in the Asian market.” \nThe fresh review of Germany’s bid by FIFA will be conducted in conjunction with external lawyers as part of a wider internal investigation into any allegations of wrongdoing at the scandal-battered governing body. \nGermany is not the first World Cup bidder to have its methods questioned. \nWhen former FIFA executive committee member Chuck Blazer pleaded guilty to racketeering and other charges in the United Sates, he said he arranged bribes around 1992 in the 1998 World Cup vote. France beat Morocco. \nAs part of a plea bargain which emerged earlier this year, Blazer also admitted that $10 million was a bribe in return for him and two other FIFA executives backing South Africa in the 2004 vote against Morocco. Three votes were decisive in South Africa beating Morocco. \nSwitzerland’s attorney general, Michael Lauber, is also investigating the bidding contests which sent the 2018 World Cup to Russia and the 2022 tournament to Qatar. \n____ \nAssociated Press Writer Ciaran Fahey in Berlin contributed to this report. \n___ \nFollow Rob Harris at www.twitter.com/RobHarris and www.facebook.com/RobHarrisReports Topics:", "external_links": [], "published": "2015-10-17T20:52:00.000+03:00", "crawled": "2015-10-17T21:59:08.830+03:00", "highlightTitle": ""}