{"organizations": [], "uuid": "054ee0de3622f925b6bd21dabab5beefccbf6bfc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.idahostatesman.com", "main_image": "https://i.ytimg.com/vi/iEiuqtb_te0/mqdefault.jpg", "site_section": "http://www.idahostatesman.com/rss/sports", "section_title": "Idahostatesman.com -- Sports", "url": "http://www.idahostatesman.com/2015/10/10/4030173/boise-state-football-feels-it.html", "country": "US", "title": "Boise State football feels it has more to gain after victory", "performance_score": 0, "site": "idahostatesman.com", "participants_count": 1, "title_full": "Boise State football feels it has more to gain after victory", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T08:59:00.000+03:00", "replies_count": 0, "uuid": "054ee0de3622f925b6bd21dabab5beefccbf6bfc"}, "author": "dsouthorn@idahostatesman.com (Dave Southorn)", "url": "http://www.idahostatesman.com/2015/10/10/4030173/boise-state-football-feels-it.html", "ord_in_thread": 0, "title": "Boise State football feels it has more to gain after victory", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Boise State football feels it has more to gain after victory By Dave Southorn dsouthorn@idahostatesman.com October 10, 2015 Updated 11 hours ago 2015-10-11T06:26:12Z \nBoise State linebacker Ben Weaver talks to the media after the Colorado State game. (Video by Dave Southorn) IDAHO STATESMAN Related Stories: Broncos in the NFL: Jay Ajayi joins Boise State road trip while rehabbing rib injury \nFORT COLLINS, Colo. — Dominant once again Saturday, the No. 25 Boise State football team feels it can do even better. And that’s saying something. \nThe Broncos jumped ahead of Colorado State on their first possession at Hughes Stadium, never letting off the gas in a 41-10 pummeling of the Rams. Its defense again perplexed quarterbacks, its offense racked up yardage and to think, it wasn’t quite perfect. \n“Coach (Bryan) Harsin was just talking about it in the locker room,” junior wide receiver Thomas Sperbeck said. “We left a little out there, but each week, even though the scores are like they are, we have to keep pushing ourselves to get better.” \nBoise State (5-1 overall, 2-0 Mountain West) has treated the Rams’ home field like its own, winning there a combined 146-53 and averaging 592 yards per game in the Broncos’ three visits as Mountain West members. Colorado State (2-4, 0-2) will have new digs completed when Boise State returns in 2017. \nUsing some patented Bronco trickery, Boise State got on the board first thanks to a 53-yard touchdown pass from 5-foot-6 senior wide receiver Shane Williams-Rhodes to Sperbeck, who said he didn’t have to break stride. Williams-Rhodes said it was the first time he had ever thrown a pass in a game. \n“It was also my first touchdown this year,” Williams-Rhodes said. “I’ve been looking for a way to get in the end zone, I’ll take a pass. \n“I told them I’m only good for about 25 yards, but Thomas ran a little further than that and I was able to get it there.” \nThe Broncos scored on their first four possessions, the last an 85-yard touchdown pass from freshman quarterback Brett Rypien to Sperbeck that made it 24-7, tied for the seventh-longest pass in school history. That strike immediately answered a 16-play, 75-yard drive for the Rams in which they converted two fourth downs and capped it off with a 13-yard pass from freshman quarterback Coleman Key to senior receiver Joe Hansley. \n“Thats a great answer by the offense. ... Guys didn’t flinch, and to me, that’s the key ingredient,” Harsin said. \nThe Broncos could have truly put it away early, but their next two drives ended with a missed 55-yard field goal and a failed fourth down in Colorado State territory. Rypien also threw his first career interception on the first drive of the second half, coming on his 94th attempt. That’s the way it is with these Broncos, who have won four straight by a combined 204-24 — a blowout win, yet enough to work on to keep the team motivated. \n“You’re looking for each and every week to get better, I wouldn’t say perfection, but progress,” Harsin said. “... It’s hard to win every week in college football. To do it on the road, I told those guys enjoy it. We’re never in that mindset, ‘this is just what we do.’ Every single week is a challenge.” \nColorado State’s two scoring drives covered 137 yards. Their 11 other possessions totaled just 119 yards, while Boise State racked up 597 yards. Even those two stuck with the Broncos a bit, praising Colorado State despite it scoring only 10 points. \n“We were trying to do anything we could to get off the field and they had those two big drives which is something we don’t like to do,” junior linebacker Ben Weaver said. “We’ll make the corrections so that doesn’t happen again.” \nThe Rams used Key and sophomore Nick Stevens, both to little effect. Stevens played the first series and was relieved by Key until late in the game. The pair combined to complete 13-of-29 passes for 116 yards for a touchdown and two interceptions. In the Broncos’ last three games, opposing quarterbacks have completed 40-of-100 for 437 yards, three touchdowns and nine interceptions. \nRashard Higgins, the Rams’ junior All-American receiver, had three catches for 42 yards, both his lowest since the 2014 season opener. \n“They just came out and were more physical,” Higgins said. “They came out and it was 17-0 right off the bat and that’s hard to come back from, especially against a top-25 team.” \nBoise State got big performances from its big names — McNichols ran for 104 yards and a pair touchdowns, Sperbeck had 178 yards with two touchdowns himself, senior safety Darian Thompson had his 18th career interception and Rypien was 22-of-35 for 339 yards passing (one passing touchdown and one rushing). Williams-Rhodes, who had seven catches, called Rypien “a warrior” after he stood tall when facing pressure. \n“We pretty much got whipped soundly in all three phases,” Colorado State coach Mike Bobo said. “... we had a chance to grab momentum a couple times during the game and couldn’t do it.” \nThough he told his team to enjoy the win, Harsin and company will have a short turnaround, going from one of the league’s most physical teams to perhaps the most when the Broncos travel to Utah State on Friday with no bye for another four weeks. \n“This is uncharted territory ... we’re going to have to find ways to be creative to keep our guys healthy and have them ready to play,” Harsin said. Dave Southorn: 377-6420;Twitter: @IDS_southorn", "external_links": [], "published": "2015-10-11T08:59:00.000+03:00", "crawled": "2015-10-11T20:15:42.170+03:00", "highlightTitle": ""}