{"organizations": ["NFL", "Oakland Raiders"], "uuid": "f023dd1d214b6c49b795f963b3dcd166316e193e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagofootball.com", "main_image": "", "site_section": "http://www.nwherald.com/?rss=sports/nfl/bears", "section_title": "Sports - Bears", "url": "http://www.chicagofootball.com/2015/10/08/in-line-for-first-nfl-start-undersized-chicago-bears-c-hroniss-grasu-can-learn-from-kevin-mawae/axmt6y4/", "country": "US", "title": "In line for first NFL start, undersized Chicago Bears C Hroniss Grasu can learn from Kevin Mawae", "performance_score": 0, "site": "chicagofootball.com", "participants_count": 0, "title_full": "In line for first NFL start, undersized Chicago Bears C Hroniss Grasu can learn from Kevin Mawae", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T08:45:00.000+03:00", "replies_count": 0, "uuid": "f023dd1d214b6c49b795f963b3dcd166316e193e"}, "author": "", "url": "http://www.chicagofootball.com/2015/10/08/in-line-for-first-nfl-start-undersized-chicago-bears-c-hroniss-grasu-can-learn-from-kevin-mawae/axmt6y4/", "ord_in_thread": 0, "title": "In line for first NFL start, undersized Chicago Bears C Hroniss Grasu can learn from Kevin Mawae", "locations": ["Chicago"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["ARTHUR ARKUSH", "Hroniss Grasu", "H. Rick Bamman", "Kevin Mawae Mawae", "Kevin Mawae"], "text": "Search In line for first NFL start, undersized Chicago Bears C Hroniss Grasu can learn from Kevin Mawae Mawae: 'What you lack in size, some guys figure out how to take advantage' By ARTHUR ARKUSH -- aarkush@chicagofootball.com Published: Oct. 8, 2015 — 5:29 p.m. Updated: Oct. 8, 2015 — 9:53 p.m. H. Rick Bamman - hbamman@shawmedia.com Chicago Bears rookie center Hroniss Grasu sits on the bench during the game against the Oakland Raiders on Sunday, Oct. 4, 2015, in Chicago. — H. Rick Bamman \nLAKE FOREST — Third-round rookie Hroniss Grasu was a healthy scratch the first month but he could start Sunday with Will Montgomery done for the year. \nMuch has been made about Grasu’s size: At 6-foot-3, he hovers around 300 pounds, whereas Chiefs Pro Bowl nose guard Dontari Poe is listed at 346. \nBut Matt Slauson, who earned a game ball against Oakland for replacing Montgomery on the fly, noted that his former Jets teammate Kevin Mawae did just fine in spite of sharing the same undersized reputation. \n“I played at 280 pounds,” Mawae, a 16-year veteran, eight-time All-Pro and member of the NFL’s All Decades team, told ChicagoFootball.com on Thursday. “Olin Kreutz was a little bit bigger than I was. I think what you lack in size, some guys figure out how to take advantage. \n“I was never a road grader. I was a different type of player than Olin. He was a bully; he’d push guys around. I was more of a finesse player, a technician; understanding leverage, where my feet need to be, hand placement, stuff like that.” \nThe Bears rave about Grasu’s athleticism and movement skills, putting him more in the latter category. Grasu appeared to have a strength deficiency in the preseason, but John Fox and Adam Gase wouldn’t agree. \n“I know he's not like an overly sized guy but he does have good strength for that position,” Gase said. \nGrasu trained leading up to the draft with former Chargers C Nick Hardwick, who played 11 seasons weighing around 300 pounds. \n“He was an undersized center; we have a lot of the same game,” Grasu said. “The biggest thing I get from those guys is, there’s a lot of guys in the NFL that are my weight. It’s not that big of a deal; you just got to be perfect with your technique … and go out there and be nasty.” \nKyle Long sees the confidence of Grasu, his close friend and teammate dating back to Oregon, growing. \n“He’s a lot louder at the line of scrimmage now,” Long said. “He was a little tentative when he first got here …. \n\"The O-line is one of the toughest places to earn respect as a player. For a young guy coming in at center and trying to be in control of the offense, you need to play with that bravado and macho swagger. He’s got a little bit of that in him now. He’s got his confidence. His technique is getting better.” \nMawae doesn’t think Grasu’s roots in Oregon’s zone system are a limitation. \n“Every NFL team runs the exact same schemes – they just call them different things,” Mawae said. \nThe key, Mawae thinks, is players and coaches knowing how to properly utilize their personnel. \n“Just knowing the angles, understanding the concept of the play, what we’re trying to accomplish as an offensive unit allowed me to use different tools and ways than a lot of other guys,\" he said. \n“Coaches, when they have a smaller guy, now it’s like 295 pounds, they have an understanding of a guy’s physical limitations.” \nIt’s not realistic for Grasu, Mawae said, to be asked to drive defenders 10 yards downfield. Mawae had to block former Bears NT Ted Washington, who exceeded 400 pounds. \n“Sometimes, it’s just getting on the line of scrimmage and hanging on for dear life.” More News: Chicago Bears Sign up for text messages on your mobile phone or PDA with news from the Chicago Bears from ChicagoFootball.com. © 2015 Chicago Football is published by Northwest Herald, a Shaw Media company. All rights reserved.", "external_links": [], "published": "2015-10-09T08:45:00.000+03:00", "crawled": "2015-10-09T09:57:41.961+03:00", "highlightTitle": ""}