{"organizations": [], "uuid": "3d833ea5536f9da73e48c49e6d2fca59ddc575f6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "neighbornewspapers.com", "main_image": "http://matchbin-assets.s3.amazonaws.com/public/sites/2518/thumbs/G1JU_NS_9_30_Sports_North_Springs_VB.JPG", "site_section": "http://neighbornewspapers.com/rss/rss/Sports?instance=Sports&content_type=article&tags=sports&tag_inclusion=or&offset=0&limit=10&page_name=rss", "section_title": "Sports", "url": "http://neighbornewspapers.com/bookmark/26884633", "country": "US", "title": "Spartans volleyball preparing for area tourney", "performance_score": 0, "site": "neighbornewspapers.com", "participants_count": 1, "title_full": "Spartans volleyball preparing for area tourney", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T21:57:00.000+03:00", "replies_count": 0, "uuid": "3d833ea5536f9da73e48c49e6d2fca59ddc575f6"}, "author": "E. Marcel Pourtout mpourtout@neighbornewspapers.com (noreply@neighbornewspapers.com)", "url": "http://neighbornewspapers.com/bookmark/26884633", "ord_in_thread": 0, "title": "Spartans volleyball preparing for area tourney", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Spartans volleyball preparing for area tourney by E. Marcel Pourtout September 30, 2015 01:57 PM | 142 views | 0 | 0 | Staff / E. Marcel PourtoutFrom left, North Springs volleyball players Bethany Holland, Taylor Carroll and Nirelys Rohena before practice on campus earlier this season. slideshow With six wins on the season and several contests left on the schedule, the North Springs volleyball team sits in the middle of the Area 7 standings. With one week left before the area tournament begins to determine the four squads that will advance to the state playoffs, the Spartans are back on the practice court preparing to make a push towards a postseason bid.“We working on eliminating our bad habits going into the postseason,” North Springs coach Kimberly Daniel said. “We want the players to be focused and finish matches. This upcoming week will be very important for us.”The Spartans have already improved from last season which saw them win only seven contests overall. “Our girls have improved over the years. There have been freshman stepping up and playing at the varsity level, players getting more kills than ever before. Every one has worked hard since spring conditioning and it’s shown on the court.”Senior setter Bethany Holland has a team-high 161 assists on the season along with 18 aces. “She has passed well for us and we use her in different spots on the court,” Daniel said. “The season has been going well with a roster of new players,” Holland said.Junior outside hitter Taylor Carroll has averaged more than two kills a set for North Springs which is a team high. “Taylor has worked on the mental aspect of the game and her confidence has grown,” Daniel said.“Our team has done well overcoming adversity from low places this season,” Carroll said.Sophomore outside hitter Nirelys Rohena’s 67 kills, 38 digs and 24 aces are all team-highs for the Spartans. “Last year Nirelys was a defensive specialist but she has grown into a big hitter for us and plays defense,” Daniel said.Daniel came to North Springs last season looking to build the entire program beyond the varsity team. “We’re working on building consistency with our coaching so that the girls understand what we’re doing,” she said. “We’ve implemented two junior varsity programs and putting the girls in a position to build a tradition working together.”The Spartans return to action on Thursday at home against Lakeside. Share This Article | similar stories", "external_links": [], "published": "2015-09-30T21:57:00.000+03:00", "crawled": "2015-10-01T09:08:58.171+03:00", "highlightTitle": ""}