{"organizations": [], "uuid": "77e4532fd3c7e2580c3e5806decdb750f7121bd0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sport.co.uk", "main_image": "http://images.sport.co.uk/150x150/53df0ca4365e6edd113e5cae37e5ffca.jpg", "site_section": "http://feeds.feedburner.com/SportcoukNewsRssFeed", "section_title": "General Sports News from Sports.co.uk", "url": "http://www.sport.co.uk/rugby/gareth-anscombe-ready-to-seize-world-cup-chance-for-wales/6906124/", "country": "JE", "title": "Gareth Anscombe ready to seize World Cup chance for Wales", "performance_score": 0, "site": "sport.co.uk", "participants_count": 0, "title_full": "Gareth Anscombe ready to seize World Cup chance for Wales", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T17:31:00.000+03:00", "replies_count": 0, "uuid": "77e4532fd3c7e2580c3e5806decdb750f7121bd0"}, "author": "", "url": "http://www.sport.co.uk/rugby/gareth-anscombe-ready-to-seize-world-cup-chance-for-wales/6906124/", "ord_in_thread": 0, "title": "Gareth Anscombe ready to seize World Cup chance for Wales", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Gareth Anscombe"], "text": "Gareth Anscombe ready to seize World Cup chance for Wales 08 Oct 2015 14:31:52 \ncomments \nGareth Anscombe has admitted he thought his World Cup dream might have been snatched away due to injury. \nNew Zealand-born Anscombe, whose mother is from Cardiff, suffered an injury during pre-tournament training and then did not make Wales head coach Warren Gatland's 31-man World Cup squad. \nBut injuries to Scott Williams and Hallam Amos during Wales' 28-25 Pool A win against England 12 days ago resulted in him being called up to the World Cup group, along with fellow replacement James Hook. \nAnd Anscombe now gains a huge opportunity after being selected at full-back for Saturday's group decider against Australia. \n\"(Injury) was a tough pill to swallow, particularly after 11 weeks of hard work in Switzerland, Doha and at the Vale (in Wales),\" he said. \n\"It's tough to think your World Cup dream is sort of snatched (away) when so close to selection. \n\"Injuries aren't the best part of sport, and we've had our fair share. \n\"Unfortunately for Scotty and Hallam, they took their bumps, and I guess it opened up a door for me. I am thankful to be here, and hopefully I can add to the cause, come Saturday.\" \nAnscombe's opposite number at Twickenham will be the gifted Wallabies full-back Israel Folau, although it is not a new experience for the Cardiff Blues player, having featured against him in Super Rugby, where Anscombe played for the (Auckland) Blues and Chiefs. \n\"I played 15 against the Waratahs once, and he climbed all over me on the high balls a few times,\" Anscombe added. \n\"We know the dangers we face, but with the back line we've got, hopefully we can cause a few problems. \n\"Aussie sides are very smart in terms of how they play tactically, and they don't miss a beat. \n\"They like to use the ball, and they have looked pretty sharp. We will have to be on our toes defensively to not give them too many opportunities. \n\"It's a big game for this team. We want to finish top of the pool and stamp our authority. The team is confident, and it's a huge occasion on the weekend.\" \nOne of Gatland's eye-catching selections has been a move from wing to outside centre for powerhouse runner George North, who partners Jamie Roberts in midfield. \nNorth said: \"I am just happy to be on the park. As a wing, there is a bit more freedom to roam. At 13 it is a bit more structured, but you get a bit more ball in hand. It's horses for courses. \n\"The last World Cup four years ago, we went in as massive underdogs. Nobody paid much attention to us, and we went about our work. \n\"This World Cup, we've had more coverage with the pool we are in, but to finish on top shows where we are and where we want to go. With the injuries we've had, we've had to dig in on a few occasions. \n\"From our point of view, the mindset from minute one in camp has been to prepare for each game as it comes. Three (wins) from three is brilliant, and we have a chance of four from four on the weekend.\" Related Sport News", "external_links": [], "published": "2015-10-08T17:31:00.000+03:00", "crawled": "2015-10-08T19:53:08.183+03:00", "highlightTitle": ""}