{"organizations": [], "uuid": "ef1aabe32992d6c4ddf17f05e52feb1b52f16d95", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.northjersey.com", "main_image": "http://www.northjersey.com:80/polopoly_fs/1.1426207!/fileImage/httpImage/100615-s-cuddyer80p.jpg", "site_section": "http://www.northjersey.com/cmlink/sports-rss.rss#", "section_title": "Sports News on NorthJersey.com", "url": "http://www.northjersey.com/sports/baseball/identical-routine-1.1426206", "country": "US", "title": "Mets: Preparing as they always do - Baseball", "performance_score": 0, "site": "northjersey.com", "participants_count": 1, "title_full": "Mets: Preparing as they always do - Baseball - NorthJersey.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T04:21:00.000+03:00", "replies_count": 0, "uuid": "ef1aabe32992d6c4ddf17f05e52feb1b52f16d95"}, "author": "MATT EHALT", "url": "http://www.northjersey.com/sports/baseball/identical-routine-1.1426206", "ord_in_thread": 0, "title": "Mets: Preparing as they always do - Baseball", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Buy this photo ASSOCIATED PRESS Michael Cuddyer says the postseason feels the same as a player, but not for TV viewers. Throughout his childhood, Michael Cuddyer watched playoff baseball games on television and was amazed. It all seemed so grand to watch from afar.\nWhen he played his first playoff game Oct. 1, 2002, while with the Twins, that feeling of wonder he had as a kid didn't carry over. \nAfter being wowed year after year by the whole scene, the veteran described it as \"almost a letdown\" to be on the other side of it all. It turned out that game 163 was no different than game 28 in the middle of May aside from the significance of the final score.\n\"You watch on TV and it's this huge production, the interlude and everything into it, and when you're playing you don't see any of it, so it's literally the same thing,\" Cuddyer said. \"You take batting practice, come in and do the same thing you've done for the past 162 games. The biggest thing was it was the exact same as it was in the regular season.\"\nWith a majority of the Mets having never participated in a playoff game, Cuddyer and other team veterans with postseason experience stressed that these upcoming games should be treated no differently than others. New York may have up to eight players with postseason experience on their roster for the NLDS against the Dodgers.\n\"The intensity level is probably higher; the fans get into it and the adrenaline flows a little bit more. Once you have that first at-bat, that first ball hit to you, you kind of settle in and try to treat it like any other game,\" said David Wright, the lone Met on the franchise's last playoff team in 2006.\n\"The days leading up to it will be somewhat of a circus, because you're not used to the kind of gearing up toward the playoff series, but I think once you get there and you get settled in, you try to treat it like anything else.\"\nDue to the team's youthful core, the postseason is new to most and they'll enjoy their first taste of it at 9:45 p.m. Friday at Dodger Stadium.\nCuddyer and outfielder Curtis Granderson compared the playoffs to opening day. The pregame ceremonies make for a spectacle, but once the game begins, it's back to the basics as the team chases its first World Series title since 1986.\nCuddyer and Granderson are two of possibly six position players with postseason experience on the NLDS roster. Juan Uribe (chest), who may not recover in time, leads the team with 157 postseason at-bats. Bartolo Colon, one of two pitchers with experience, has thrown 58 1/3 postseason innings. Tyler Clippard has thrown six.\n\"I think it's good to have a mix of guys that have been there and have that experience and that youthful energy where you feel like a lot of younger guys will go out there and run through walls,\" Wright said. \"I think we have a good mix, and I'll take these young, power arms, when you line them up and throw those guys out there.\"\nWright often has said that he believed 2006 would be the start of a long stretch of playoff runs, but instead he experienced an eight-season drought.\nIt's that drought that had the Mets star third baseman saying the newcomers should take as much out of these moments as they can.\n\"I'm sure there's going to be some butterflies and some anxious, young guys come Friday, but just enjoy it,\" Wright said. \"Don't take it for granted. Try to soak it up as much as you can, live in the moment. Just do what you've done to get you to this point.\"", "external_links": [], "published": "2015-10-06T04:21:00.000+03:00", "crawled": "2015-10-06T11:10:50.048+03:00", "highlightTitle": ""}