{"organizations": [], "uuid": "d8749204929b54b5371c7b2acd389f5f3259476b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports/mlb", "section_title": "MLB News, Scores, Schedule, Standings, Stats, Photos, Videos - Baseball - MSN Sports", "url": "http://www.msn.com/en-us/sports/mlb/nightengale-gms-need-their-guys-at-manager/ar-BBmlmQN", "country": "US", "title": "Nightengale: GMs need 'their guys' at manager", "performance_score": 0, "site": "msn.com", "participants_count": 1, "title_full": "Nightengale: GMs need 'their guys' at manager", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "d8749204929b54b5371c7b2acd389f5f3259476b"}, "author": "Bob Nightengale, USA TODAY Sports", "url": "http://www.msn.com/en-us/sports/mlb/nightengale-gms-need-their-guys-at-manager/ar-BBmlmQN", "ord_in_thread": 0, "title": "Nightengale: GMs need 'their guys' at manager", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Nightengale: GMs need 'their guys' at manager USA Today Sports 13 hrs ago by Bob Nightengale, USA TODAY Sports CHICAGO -- Let's be honest, Andrew Friedman knew he was going to fire Don Mattingly a year ago.\nAdChoices Friedman bolted from the Tampa Bay Rays and became the Los Angeles Dodgers president of baseball operations almost a year ago to the date, receiving the largest front office contract in baseball history.\nMattingly was part of the inheritance when Friedman arrived. He was never his guy. And it became official Thursday that he will never be his guy with the Dodgers announcing in a mutual decision that Mattingly was out.\n\"As we kept talking, it just became clear that this was the right time,\" Mattingly said. \"I think it was best for me and for the club.\"\nMattingly insists he felt accepted by the new regime, but he was an outsider. He belonged to the previous regime, hired by former Dodgers general manager Ned Colletti.\nConsidering most of Colletti's people were pushed aside or fired when Friedman came in, bringing in his own executive council, Mattingly had no chance to survive.\nFriedman kept Mattingly a year ago only out of respect for owner Mark Walter, who thought Mattingly didn't deserve to be fired.\nThis time, Walter let Friedman make the call, and it was an easy one.\n\"I always felt like I was a guy who could work with anyone,\" Mattingly said.\nIt was nothing personal, and Friedman didn't blame Mattingly for having the most expensive team in sports history at $310 million and losing in the National League Division Series to the New York Mets, but he had to go. Simply, Mattingly wasn't his guy.\nHis guy is Gabe Kapler, who played for him with the Tampa Bay Rays, worked for him in Tampa Bay's front office and was hired to be the Dodgers' farm director a year ago.\nNow, with Kapler's only managerial experience consisting of one season in the Class A South Atlantic League, he'll likely be Friedman's guy again.\nEven if Friedman pulls a surprise and goes outside the organization and hires someone such as Bud Black, Dusty Baker, Dave Martinez or Phil Nevin, you can be assured that Kapler will still be his guy and be on that major league staff.\nIt's how baseball works these days.\nIf you're inherited by the new GM and not one of his guys, you're out.\nIt's why Jerry Dipoto fired Lloyd McClendon within two weeks of becoming the Seattle Mariners GM, knowing he would have fired him next year anyway, so why waste time?\nEveryone knows what happened the last time he inherited a manager. Dipoto resigned in disgust, unable to co-exist with manager Mike Scioscia, and cleaned out his office during the summer.\nSo, surprise, surprise, guess who he'll hire as his manager?\nYep, one of his guys, Tim Bogar or Scott Servais, both of whom were hired by Dipoto in the Los Angeles Angels front office.\nServais will be the manager with Bogar as bench coach, or Bogar the manager and Servais as bench coach.\nIt doesn't matter that Servais has zero days of managerial experience or that Bogar's major league managing experience consists of two weeks.\nIt's the way the game is played these days.\nThis is why Friedman should have brought along Joe Maddon as well when he joined the Dodgers.\nGone are the days when general managers and managers bickered and privately feuded, well, except in Maryland, where the marriage of the Baltimore Orioles' Buck Showalter and Dan Duquette might not last until opening day. Showalter, after all, was inherited by Duquette. He was Orioles owner Pete Angelos' guy, not Duquette's.\nThen, of course, there's the bizarre situation in South Florida, where Miami Marlins GM Dan Jennings was owner Jeffrey Loria's guy. Yet once Jennings went down to the field to manage, he no longer was Loria's guy, with arguments over starting lineups. So Jennings is now out as manager and has been asked to return to the GM chair, but with diminished power.\nBut even if Jennings returns as GM, he won't be able to hire his guy as manager. Loria will be hiring his guy.\nAnd his guy figures to be Mattingly.\nThis time, maybe he has a chance to survive.\nLook around at the managerial unemployment rate these days of managers who have been inherited and not hired by their new GMs. The longest-tenured manager is Showalter, whom Duquette inherited four years ago. Walt Weiss of the Colorado Rockies and Fredi Gonzalez of the Atlanta Braves are the only other active managers to have even one full season under a GM who didn't hire him.\nMattingly simply is the latest case study. He was the first manager in Dodgers history to win three consecutive division titles. They never finished below .500. His .551 winning percentage during these five years was superior to any Dodgers manager since Walter Alston.\nBut they never got to the World Series.\nAnd he paid the price.\n\"I'm proud of what we did,\" Mattingly said. \"I'm disappointed we weren't able to accomplish more.\"\nSure, Mattingly could have been a much better strategist. Those in the front office were scratching their heads far too often on questionable decisions and his handling of the bullpen.\nIn their mind, Mattingly was an old-school manager who didn't adjust to their sabermetric game.\nThe truth is Mattingly pledged the wrong fraternity, and, with a new chapter chairman in town, he was looked upon as nothing more than an outcast threatening to crash rush week.\nMattingly will be back managing.\nThis time on his own terms and a boss who wants him.\nNow, he has a chance.\nPHOTOS: Best moments of the postseason\nGo to MSN Home", "external_links": ["http://img-s-msn-com.akamaized.net/tenant/amp/entityid/AAfAo8r.img&quot;}},{&quot;csId&quot;:&quot;BB2D59E&quot;,&quot;description&quot;:&quot;Thursday&#39;s", "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/BBmlb1o.img&quot;}}", "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/BBmljB6.img&quot;}}", "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/BB6qRzt.img&quot;,&quot;title&quot;:&quot;Dodgers,", "http://ui.bamstatic.com/120sports/util/embed/ots.embed.js&quot;}", "http://b.scorecardresearch.com/b?&quot;,&quot;Category&quot;:&quot;baseball_mlb&quot;},&quot;Mute&quot;:&quot;true&quot;,&quot;HomePageLink&quot;:&quot;//www.msn.com/en-us&quot;,&quot;GeofenceUseSps&quot;:&quot;false&quot;,&quot;GeofenceEnabled&quot;:&quot;true&quot;,&quot;AutoPlay&quot;:&quot;true&quot;,&quot;AutoPlay&quot;:true,&quot;Mute&quot;:true,&quot;SwfCacheRefreshTime&quot;:86400,&quot;AdConfig&quot;:{&quot;FWFlashProfile&quot;:&quot;188286:MSN_US_AS3_LIVE&quot;,&quot;FWHtml5Profile&quot;:&quot;188286:MSN_HTML5_Live&", "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/BB6qRzt.img&quot;,&quot;title&quot;:&quot;Top", "http://www.usatoday.com/sports/", "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/BBkyxle.img&quot;,&quot;title&quot;:&quot;Will", "http://c.120sportsstatic.com/gen/client/rss/timeline.xml&quot;},{&quot;ns&quot;:&quot;ignore_this_version&quot;,&quot;value&quot;:&quot;System.Collections.Generic.List`1", "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/BBmkinW.img&quot;}},{&quot;csId&quot;:&quot;BBkkQsl&quot;,&quot;description&quot;:&quot;Despite", "http://ui.bamstatic.com/120sports/util/embed/ots.embed.js&quot;,&quot;tags&quot;:", "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/BB6qRzt.img&quot;,&quot;title&quot;:&quot;Why", "http://go.microsoft.com/fwlink/?LinkID=286759"], "published": "2015-10-23T03:00:00.000+03:00", "crawled": "2015-10-23T17:07:43.423+03:00", "highlightTitle": ""}