{"organizations": ["Maryland Here", "USC"], "uuid": "ee0490949c7cd3506a7f1841759de74f8f6b4b3f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonpost.com", "main_image": "http://www.washingtonpost.com/blogs/early-lead/files/2015/10/Ravens_Steelers_Football-0385d.jpg", "site_section": "http://www.washingtonpost.com/rss/sports", "section_title": "Sports", "url": "https://www.washingtonpost.com/news/early-lead/wp/2015/10/13/here-are-the-perfect-coaching-candidates-for-usc-south-carolina-and-maryland/", "country": "US", "title": "Here are the perfect coaching candidates for USC, South Carolina and Maryland", "performance_score": 0, "site": "washingtonpost.com", "participants_count": 0, "title_full": "Here are the perfect coaching candidates for USC, South Carolina and Maryland", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T19:08:00.000+03:00", "replies_count": 0, "uuid": "ee0490949c7cd3506a7f1841759de74f8f6b4b3f"}, "author": "", "url": "https://www.washingtonpost.com/news/early-lead/wp/2015/10/13/here-are-the-perfect-coaching-candidates-for-usc-south-carolina-and-maryland/", "ord_in_thread": 0, "title": "Here are the perfect coaching candidates for USC, South Carolina and Maryland", "locations": ["South Carolina", "Maryland"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Matt Bonesteel"], "text": "Here are the perfect coaching candidates for USC, South Carolina and Maryland Resize Text By Matt Bonesteel October 13 at 12:03 PM Follow @MattBonesteel Who will be wearing the headset next at these schools? (Gene Puskar/Associated Press) \nThree power-five coaching jobs have opened up since Sunday, a strange October glut of vacancies. The athletic departments at USC, South Carolina and Maryland will now get a jump on the rest of the schools that will wait until November or December to get rid of their coaches or watch them resign. \nBut the thing is, none of the three schools with vacancies are likely to be competing with one another for the same coaches, because each is facing a starkly different situation. Here’s a look at the type of coach each school should realistically target — the perfect fit, if you will. \nUSC \nPerfect candidate: The Big Name. Even if the NFL decides to send one or two teams to Los Angeles in the coming years, the Trojans will still rule the roost when it comes to football in Southern California (sorry UCLA, it’s true). This will have to be a splashy hire. \nIdeal possibilities: Texas A&M Coach Kevin Sumlin, UCLA Coach Jim Mora Jr. ( yep ), Philadelphia Eagles Coach Chip Kelly (even if he loathes everything about college football coaching — recruiting, pandering to boosters, etc. — except the actual coaching part), St. Louis Rams Coach Jeff Fisher (won a national title as a player at USC, and Rams are an NFL non-entity). \nSouth Carolina \nPerfect candidate: The Established Name. There’s a difference between a Big Name and an Established Name. What the Gamecocks should be looking for is a well-credentialed, veteran coach who will get South Carolina back among the SEC’s best, preferably with a high-powered offense and someone on his staff who can recruit the Carolinas, Georgia and Florida. \nIdeal possibilities: Michigan State Coach Mark Dantonio (there are no signs he wants to leave East Lansing , but he’s a South Carolina alum), Arizona Coach Rich Rodriguez (knows the state from his time as Clemson’s offensive coordinator), Texas Coach Charlie Strong (if the Oklahoma win was just a mirage), Louisville Coach Bobby Petrino (becoming less radioactive by the day), Oklahoma State Coach Mike Gundy (thought hard about taking the Tennessee job in 2012, has butted heads with Oklahoma State Athletic Director Mike Holder in the past), Utah Coach Kyle Whittingham (though the other USC may take a run at him, too). \nMaryland \nPerfect candidate: The Up-and-Comer. Yes, Maryland is building a snazzy new practice facility. And yes, there’s the Under Armour connection. But the school’s administrators and fans need to be realistic about their place in the college football pecking order. Chip Kelly ain’t walking through that door. John Harbaugh — a popular choice among the Ravens fans in Maryland’s fan base — ain’t walking through that door. And hiring Greg Schiano would be like hiring a slightly younger Randy Edsall. \nIdeal possibilities: Houston Coach Tom Herman (though he might be able to aim higher than Maryland), Memphis Coach Justin Fuentes (ditto), Bowling Green Coach Dino Babers (he’s 54, but just ask Maryland about his coaching acumen), Toledo Coach Matt Campbell (only 35, but the Rockets are 14-4 since the start of the 2014 season), San Diego Chargers offensive coordinator Frank Reich (has never been a college coach, and has only been an NFL coordinator since 2014). \nAfter spending the first 17 years of his Post career writing and editing, Matt and the printed paper had an amicable divorce in 2014. He's now blogging and editing for the Early Lead and the Post's other Web-based products. sports Success! Check your inbox for details. You might also like: Please enter a valid email address Sign Up", "external_links": [], "published": "2015-10-13T19:08:00.000+03:00", "crawled": "2015-10-13T19:22:09.895+03:00", "highlightTitle": ""}