{"organizations": [], "uuid": "22f7d639fbb7a280719327d76808710b1cd77eaa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bellinghamherald.com", "main_image": "http://pics.mcclatchyinteractive.com/wire_photos/8vpl8v/picture39601491/ALTERNATES/LANDSCAPE_1140/Wildlife%20Trafficking%20Initiative.JPEG", "site_section": "http://www.bellinghamherald.com/?widgetName=rssfeed&widgetContentId=21615405&getXmlFeed=true", "section_title": "Breaking News, Sports, Weather | BellinghamHerald.com &", "url": "http://www.bellinghamherald.com/news/state/washington/article39598467.html", "country": "US", "title": "Initiative seeks state penalties for wildlife trafficking", "performance_score": 0, "site": "bellinghamherald.com", "participants_count": 1, "title_full": "Initiative seeks state penalties for wildlife trafficking", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T19:12:00.000+03:00", "replies_count": 0, "uuid": "22f7d639fbb7a280719327d76808710b1cd77eaa"}, "author": "RACHEL LA CORTE Associated Press", "url": "http://www.bellinghamherald.com/news/state/washington/article39598467.html", "ord_in_thread": 0, "title": "Initiative seeks state penalties for wildlife trafficking", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "October 17, 2015 Initiative seeks state penalties for wildlife trafficking In this photo taken Wednesday, Oct. 14, 2015, an inspector reaches for a packaged animal part during an inspection of the shipment of hunting trophies from South Africa, in SeaTac, Wash. Importing items like elephant ivory or rhino horns into the United States for commercial purposes has been prohibited for decades under federal law and international treaties. In Washington state, voters will weigh in on a ballot measure that would add state penalties to violators and expand the number of animals prohibited. Elaine Thompson AP Photo In this photo taken Wednesday, Oct. 14, 2015, an inspector re-seals horns from a red lechwe killed in South Africa and shipped as a hunting trophy after an inspection in SeaTac, Wash. Importing items like elephant ivory or rhino horns into the United States for commercial purposes has been prohibited for decades under federal law and international treaties. In Washington state, voters will weigh in on a ballot measure that would add state penalties to violators and expand the number of animals prohibited. Elaine Thompson AP Photo In this photo taken Wednesday, Oct. 14, 2015, a U.S. Fish & Wildlife Service inspector checks the listed contents of a shipment of hunting trophies from South Africa, in SeaTac, Wash. The shipment included parts of a zebra, waterbuck, springbuck, black springbuck, fallow deer and blue wildebeest. Importing items like elephant ivory or rhino horns into the United States for commercial purposes has been prohibited for decades under federal law and international treaties. In Washington state, voters will weigh in on a ballot measure that would add state penalties to violators and expand the number of animals prohibited. Elaine Thompson AP Photo In this photo taken Wednesday, Oct. 14, 2015, a horn from a red lechwe killed in South Africa and shipped as a hunting trophy is removed from packaging during an inspection in SeaTac, Wash. Importing items like elephant ivory or rhino horns into the United States for commercial purposes has been prohibited for decades under federal law and international treaties. In Washington state, voters will weigh in on a ballot measure that would add state penalties to violators and expand the number of animals prohibited. Elaine Thompson AP Photo In this photo taken Wednesday, Oct. 14, 2015, inspectors separate a folded zebra skin to confirm its identity during a check of the cargo shipped from South Africa, in SeaTac, Wash. The faint dark stripe inside the white stripe identifies it as a Burchell's zebra, an allowed cargo. Importing items like elephant ivory or rhino horns into the United States for commercial purposes has been prohibited for decades under federal law and international treaties. In Washington state, voters will weigh in on a ballot measure that would add state penalties to violators and expand the number of animals prohibited. Elaine Thompson AP Photo In this photo taken Wednesday, Oct. 14, 2015, a horn from a red Lechwe killed in South Africa and shipped as a hunting trophy is removed from packaging during an inspection in SeaTac, Wash. Importing items like elephant ivory or rhino horns into the United States for commercial purposes has been prohibited for decades under federal law and international treaties. In Washington state, voters will weigh in on a ballot measure that would add state penalties to violators and expand the number of animals prohibited. Elaine Thompson AP Photo In this photo taken Wednesday, Oct. 14, 2015, a packaged animal part, killed on a hunt in South Africa, is inspected on arrival in SeaTac, Wash. Importing items like elephant ivory or rhino horns into the United States for commercial purposes has been prohibited for decades under federal law and international treaties. In Washington state, voters will weigh in on a ballot measure that would add state penalties to violators and expand the number of animals prohibited. Elaine Thompson AP Photo In this photo taken Wednesday, Oct. 14, 2015, U.S. Fish & Wildlife Service Supervisory Wildlife Inspector John Goldman, left, and wildlife inspectors Danielle Abernathy, center, and Ashley Skeen inspect a box containing hunting trophies shipped from South Africa, in SeaTac, Wash. Importing items like elephant ivory or rhino horns into the United States for commercial purposes has been prohibited for decades under federal law and international treaties. In Washington state, voters will weigh in on a ballot measure that would add state penalties to violators and expand the number of animals prohibited. Elaine Thompson AP Photo In this photo taken Wednesday, Oct. 14, 2015, U.S. Fish & Wildlife Service wildlife inspectors Ashley Skeen, left, and Danielle Abernathy, right, follow a warehouse worker in SeaTac, Wash. Importing items like elephant ivory or rhino horns into the United States for commercial purposes has been prohibited for decades under federal law and international treaties. In Washington state, voters will weigh in on a ballot measure that would add state penalties to violators and expand the number of animals prohibited. Elaine Thompson AP Photo In this photo taken Wednesday, Oct. 14, 2015, U.S. Fish & Wildlife Service wildlife inspectors Danielle Abernathy, left, and Ashley Skeen help move a box carrying hunting trophies shipped from South Africa for inspection in SeaTac, Wash. Importing items like elephant ivory or rhino horns into the United States for commercial purposes has been prohibited for decades under federal law and international treaties. In Washington state, voters will weigh in on a ballot measure that would add state penalties to violators and expand the number of animals prohibited. Elaine Thompson AP Photo 1 of 10", "external_links": [], "published": "2015-10-17T19:12:00.000+03:00", "crawled": "2015-10-18T21:04:29.507+03:00", "highlightTitle": ""}