{"organizations": [], "uuid": "a0a274bf20b6c92a144354844dd94268ae5f6d5e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports/soccer", "section_title": "Soccer News, Scores, Schedule, Standings, Stats, Photos, Videos - MSN Sports", "url": "http://www.msn.com/en-us/sports/uefa-euro-2016/international-round-up-pelle-helps-break-norwegian-hearts/ar-AAfpG7x", "country": "US", "title": "International Round-up: Pelle helps break Norwegian hearts", "performance_score": 0, "site": "msn.com", "participants_count": 1, "title_full": "International Round-up: Pelle helps break Norwegian hearts", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "a0a274bf20b6c92a144354844dd94268ae5f6d5e"}, "author": "Jake Hughes", "url": "http://www.msn.com/en-us/sports/uefa-euro-2016/international-round-up-pelle-helps-break-norwegian-hearts/ar-AAfpG7x", "ord_in_thread": 0, "title": "International Round-up: Pelle helps break Norwegian hearts", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "International Round-up: Pelle helps break Norwegian hearts SB Nation 1 hr ago Jake Hughes © Paolo Bruno/Getty Images Graziano Pelle scored the winner as Italy downed Euro 2016 hopefuls Norway 2-1 to secure top spot in their qualifying group.\nAdChoices Norway needed to win to secure an automatic spot at Euro 2016 and took the lead through Norwich City midfielder Alex Tettey inside the first half.\nHowever, Italy never stopped working despite already earning their place in next year's tournament in France. The Azzurri equalised on 73 minutes through Alessandro Florenzi before Pelle volleyed home Italy's winner ten minutes later.\nThe Italy winner meant Norway were leapfrogged by Croatia, who were victorious away to Malta.\nGraziano has impressed as Italy's attacking focal point and looks set to be a regular starter for his country should he stay injury free in time for Euro 2016.\n***\nVirgil van Dijk's Netherlands suffered Euro 2016 heartbreak as they were handily defeated at home to the Czech Republic.\nMaking his second start for Holland, van Dijk's team went 2-0 down in the first half before being substituted.\nRobin van Persie headed home an unfortunate own goal to make it 3-0 to the visitors, though he and Klaas-Jan Huntelaar scored twice to make it 2-3 and provide a glimmer of hope for the Dutch.\nHowever, Danny Blind's men could not find the equaliser - and with Turkey victorious against Iceland, this meant the Netherlands did not even earn a spot in the play-off qualifiers to take place in November.\nThis isn't great news for Southampton fans, given Ronald Koeman's increasing links to take the helm of Holland.\n***\nEngland Under-21s captain James Ward-Prowse led his side to a solid win against Kazakhstan.\nThe young Saints midfielder earned an assist as his free-kick fell to Chelsea youngster Ruben Loftus-Cheek , who buried the opportunity to make it 1-0 at the Ricoh Arena.\nSouthampton left-back Matt Targett also featured in the win as Nathan Redmond and Chuba Akpom added to the goal tally to make it a comfortable evening for Gareth Southgate's men.\nMeanwhile, Maya Yoshida's Japan side drew 1-1 against Iran, while Sam Gallagher and Harrison's England U20 dreams went up in smoke as they lost 1-0 to Germany in the Elite Cup.\nGo to MSN Home", "external_links": ["http://www.sbnation.com/soccer/epl/players/112306/nathan-redmond", "http://www.sbnation.com/soccer/epl/teams/southampton", "http://www.sbnation.com/soccer/epl/players/199195/ruben-loftus-cheek", "http://www.sbnation.com/soccer/epl/players/246427/james-ward-prowse", "http://www.sbnation.com/soccer/epl/players/246435/sam-gallagher", "http://www.sbnation.com/soccer/epl/teams/chelsea", "http://sbnation.com?utm_source=MSNbanner/", "http://go.microsoft.com/fwlink/?LinkID=286759"], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-14T03:56:03.649+03:00", "highlightTitle": ""}