{"organizations": [], "uuid": "e626f196fad04f29312d1c45b44086db7dfd5a9d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.watertowndailytimes.com", "main_image": "http://watertowndailytimes.com/images/ogimage_wdt.png", "site_section": "http://www.watertowndailytimes.com/section/iatom_wdtsports?omniture=0&mime=application%2Fatom%2Bxml", "section_title": "WDT News Feed: Watertown Daily Times: Local Sports", "url": "http://www.watertowndailytimes.com/sports/high-school-roundup-malone-captures-football-title-20151018", "country": "US", "title": "High school roundup: Malone captures football title", "performance_score": 0, "site": "watertowndailytimes.com", "participants_count": 0, "title_full": "High school roundup: Malone captures football title", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T08:31:00.000+03:00", "replies_count": 0, "uuid": "e626f196fad04f29312d1c45b44086db7dfd5a9d"}, "author": "", "url": "http://www.watertowndailytimes.com/sports/high-school-roundup-malone-captures-football-title-20151018", "ord_in_thread": 0, "title": "High school roundup: Malone captures football title", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Malone"], "text": "A A \nCANTON — Zach Raymond scored three touchdowns and recovered three fumbles as Malone defeated Canton 28-6 to win the Northern Athletic Conference football championship Saturday afternoon. \nRaymond finished with 158 yards rushing for the Huskies (7-0). He scored on two 1-yard runs and a 7-yard run as Malone finished with 277 yards rushing against Canton (5-2). \n“This is a great feeling,” Malone coach Greg Marshall said. “These kids have worked extremely hard since the opening practice and all that hard work has paid off with a championship.” \nMalone quarterback Camron Gallagher rushed for 199 yard and threw for 60, including a 5-yard touchdown pass to Jordan Scharf. \nIan Erlichman scored on a 2-yard run for the Golden Bears in the second quarter. \nGOUVERNEUR 49, ST. LAWRENCE 8 \nConnor Fenlong passed for 156 yards and rushed for 89 to lead the Wildcats past St. Lawrence Central (3-4) in Gouverneur. \nThe Wildcats (4-3) opened up a big lead in the second quarter, finishing with four touchdowns. \nJoey Bush caught five passes for 90 yards for Gouverneur. \nIHC 37, PULASKI 14 \nNicholas Draught threw for 218 yards, ran for 113, and accounted for four touchdowns to lead the Cavaliers past the Blue Devils (1-6, 0-5) in a Section 3 Class C North Division game. \nDraught threw a 53-yard touchdown to Vincenzo Alteri, a 35-yard score to Josh Navarra, and ran for touchdowns of 65 and two yards for the Cavaliers (4-3 overall, 3-2 division). \nNavarra caught nine passes for 178 yard and two touchdowns for IHC, which finished third in the Class C North Division. \nAccording to the procedures in the Section 3 handbook, the Cavaliers will be on the outside looking in when Section 3 playoff pairings are released this afternoon. Herkimer and Sherburne-Earlville, the third-place teams from the East and West Divisions, respectively, are expected to receive the two wild card spots in the Class C bracket. \nES-M 51, CARTHAGE 20 \nJeremy Perry piled up 191 rushing yards and four touchdowns on 26 carries, leading the Spartans to a Class A interdivision victory over the Comets in East Syracuse. \nJacob Lillie led the Comets (3-4) with 142 yards on 12 carries, including touchdowns of 61 and three yards. Carthage had already clinched second-place in the Class A National Division, and is expected to host Fulton in a first-round game when Section 3 playoff pairings are released today. \nEast Syracuse-Minoa improved to 6-1 and is expected to receive the top overall seed in the Section 3 Class A playoffs. The Spartans are set to host Watertown in a first-round game to be played either Friday or Saturday. \nBOYS SOCCER \nPARISHVILLE-HOPKINTON 2, MADRID-WADDINGTON 1 (OT) \nJustin Frank scored the game-winner in overtime as the Panthers (13-1-1, 12-0-1) edged Madrid-Waddington in a Northern Athletic Conference East Division game in Parishville. \nAdam Snell also scored for the Panthers. John Lenney scored for Madrid-Waddington (9-6, 8-5). \nCANTON 1, HARRISVILLE 0 \nJake Mattice made nine saves as the Golden Bears shut out Harrisville (11-3-1) in a nonleague game in Canton. \nNick Martinez scored for Canton (10-2-2). \nCHATEAUGAY 3, HEUVELTON 0 \nZach Cowan scored a goal and assisted on another as Chateaugay defeated the Bulldogs (6-9) in a nonleague game at Potsdam High School. \nJordan Martin and Neil Raville also scored for Chateaugay (12-2-1). \nALEXANDRIA 9, SANDY CREEK 1 \nDaegan Jeffers tallied five goals, including four consecutive scores, as the Purple Ghosts rolled to a nonleague victory at Sandy Creek. \nJeffers, who now has 31 tallies on the year, set the single-season school record for goals scored for Alexandria (10-5). Ian Kearns set the previous mark of 30 goals in 2012. \nGiovani Ortiz scored a pair of goals for the Purple Ghosts, and Ryan Tebo contributed three assists. \nGIRLS SOCCER \nHEUVELTON 1, CHATEAUGAY 0 \nKatie Palmer scored the only goal of the game to lead the Bulldogs past Chateaugay (14-1) in a nonleague game at Potsdam High School. \nKristi Donnelly made two saves for Heuvelton (13-4). \nSWIMMING \nCLEMENTS PACES LOWVILLE DIVERS \nAudrey Clements of Lowville set a Frontier League “B” Division record with a winning score of 385.65 points at the league’s diving championships at Carthage. \nClements’ Red Raider teammates Tess Smith (346.55) and Rachel Curry (274.25) finished second and third overall, respectively, in the “B” Division competition. \nIndian River’s Natalie Wicks (377.75) won the “A” Division individual title, with Holland Patent’s Nicole Ball (361.20) and South Jefferson’s Clara Marlowe (320.15) finishing second and third, respectively. \nIn the process, Wicks and Marlowe each set school records. \nWatertown’s Tiffany Willix (311.15) and Vivian Holland (294.20) finished fourth and fifth, respectively.  ", "external_links": [], "published": "2015-10-18T08:31:00.000+03:00", "crawled": "2015-10-18T12:32:30.267+03:00", "highlightTitle": ""}