{"organizations": [], "uuid": "f8aa3b055fb599e00f21e8ea46755dfcb06b2e02", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sltrib.com", "main_image": "http://www.sltrib.com/csp/mediapool/sites/dt.common.streams.StreamServer.cls?STREAMOID=BP3XvyOTOTvnw5A$F2AOx8$daE2N3K4ZzOUsqbU5sYvKGXt_G254bG8hmbRf8mYiWCsjLu883Ygn4B49Lvm9bPe2QeMKQdVeZmXF$9l$4uCZ8QDXhaHEp3rvzXRJFdy0KqPHLoMevcTLo3h8xh70Y6N_U_CryOsw6FTOdKL_jpQ-&CONTENTTYPE=image/jpeg", "site_section": "http://sltrib.com//csp/cms/sites/sltrib/RSS/rss.csp?cat=Sports", "section_title": "Sports - The Salt Lake Tribune", "url": "http://www.sltrib.com/sports/3048324-155/alds-texas-tops-toronto-in-14", "country": "US", "title": "ALDS: Texas tops Toronto in 14 innings for 2-0 series lead", "performance_score": 0, "site": "sltrib.com", "participants_count": 1, "title_full": "ALDS: Texas tops Toronto in 14 innings for 2-0 series lead | The Salt Lake Tribune", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "f8aa3b055fb599e00f21e8ea46755dfcb06b2e02"}, "author": "", "url": "http://www.sltrib.com/sports/3048324-155/alds-texas-tops-toronto-in-14", "ord_in_thread": 0, "title": "ALDS: Texas tops Toronto in 14 innings for 2-0 series lead", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Toronto • Fed up with his own bat, Hanser Alberto grabbed one belonging to teammate Delino DeShields.\nGood choice, rookie.\nAlberto, the seldom-used backup infielder, lined a tiebreaking single to center in the 14th inning, helping the Texas Rangers beat the Toronto Blue Jays 6-4 for a 2-0 lead in the best-of-five American League Division Series.\n\"I didn't even ask him for it,\" Alberto said, smiling at DeShields sitting beside him on the postgame interview podium. \"Good wood, too, you know?\"\nIt sure was. DeShields then picked the bat up and put it to good use, driving in another run with an infield hit after Liam Hendriks replaced La Troy Hawkins (0-1),\n  The underdog Rangers will try to sweep the Blue Jays at home in Game 3 Sunday. Martin Perez will start for Texas against Marco Estrada.\n\"This is an uphill battle but it's been done before,\" Blue Jays catcher Russell Martin said.\nSan Francisco was the last team to do it, coming back to beat Cincinnati three straight times after losing at home in the first two games of their 2012 NL Division Series.\nAlberto, batting last and only in the lineup because star third baseman Adrian Beltre was out with a strained back, made an error that led to Toronto's first two runs but redeemed himself with his big hit in extra innings.\n\"We were pretty confident going into the second game regardless of Adrian getting hurt,\" DeShields said. \"We were kind of bummed out about that, but we kept our heads up.\"\nThe 22-year-old Alberto, who made his big league debut this season, also had a sacrifice fly.\n\"It's extremely special for him,\" Rangers first-year manager Jeff Banister said. \"Really, a guy that has sat at the end of the bench for us, an extra player.\"\nTexas shut out the highest-scoring team in the majors after the fifth inning. The victory for Banister's team made road clubs 5-0 in the playoffs to that point — the only previous time that happened in the postseason was the 1906 all-Chicago World Series, STATS said.\nKansas City snapped that skid a little later Friday with a 5-4 victory over Houston in Game 2 of their Division Series.\nKeone Kela (1-0) worked one inning for the win, staying calm after a dustup with Toronto slugger Josh Donaldson.\nRoss Ohlendorf, with an old-school, double-armed windup, finished for a save. The 33-year-old journeyman picked up the first save of his major league career earlier this year.\nMike Napoli hit a tying single for Texas in the eighth.\nAnother packed crowd at Rogers Centre that made a lot of noise early was quiet at the very end. Toronto, back in the postseason for the first time since winning the 1993 World Series, lost for the second straight day at home.", "external_links": [], "published": "2015-10-09T03:00:00.000+03:00", "crawled": "2015-10-10T23:20:55.735+03:00", "highlightTitle": ""}