{"organizations": [], "uuid": "73c7574eb6938f5ec642b84c6597893adbb8d59b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ibtimes.co.uk", "main_image": "http://d.ibtimes.co.uk/en/full/1462809/devin-toner.jpg", "site_section": "http://www.ibtimes.co.uk/rss/sports", "section_title": "IBTimes.co.uk : Sports", "url": "http://www.ibtimes.co.uk/rugby-world-cup-2015-france-vs-ireland-where-watch-live-preview-team-news-1523280", "country": "US", "title": "Rugby World Cup 2015: France vs Ireland: Where to watch live, preview and team news", "performance_score": 0, "site": "ibtimes.co.uk", "participants_count": 0, "title_full": "Rugby World Cup 2015: France vs Ireland: Where to watch live, preview and team news", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T12:45:00.000+03:00", "replies_count": 0, "uuid": "73c7574eb6938f5ec642b84c6597893adbb8d59b"}, "author": "", "url": "http://www.ibtimes.co.uk/rugby-world-cup-2015-france-vs-ireland-where-watch-live-preview-team-news-1523280", "ord_in_thread": 0, "title": "Rugby World Cup 2015: France vs Ireland: Where to watch live, preview and team news", "locations": ["France", "Ireland"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Iain Henderson", "Devin Toner", "Paul O'Connell"], "text": "October 11, 2015 10:45 BST Devin Toner partners captain Paul O'Connell in the second row as Iain Henderson drops to the bench Getty \nUnbeaten duo France and Ireland square off at the Millennium Stadium in Cardiff in a bid to top Pool D and avoid a formidable quarter-final tie against reigning champions New Zealand next weekend. Where to watch \nFrance vs Ireland kicks off at 4:45pm BST on Sunday 11 October. Live coverage is available on ITV HD and BBC Radio Five Live. Preview \nWith both teams having already qualified for the last eight of the 2015 Rugby World Cup, the desire to avoid a premature meeting with the dominant All Blacks means this eagerly anticipated tie is anything but meaningless. Ireland, significantly aided by their huge contingent of passionate supporters, currently sit top of the pool by virtue of a slightly superior points difference but will have to dramatically improve upon their tame and uninspiring 16-9 victory over Italy on Sunday, which followed rather more routine wins over Canada and Romania . \nHead coach Joe Schmidt, who claims to have expected his side would be brought back down to earth by a desperate tier one outfit scrapping for their tournament lives, has sprung something of a surprise with his team selection by dropping arguably Ireland's player of the tournament so far in Iain Henderson and replacing him with experienced Leinster lock Devin Toner. \nKeith Earls, who bagged a brace against Romania before scoring the only try of a tense match against Italy, retains his place alongside Robbie Henshaw at outside centre as Jared Payne is yet to fully recover from a bruised foot. Rob Kearney starts at full-back ahead of Simon Zebo following a glute injury, while Cian Healy is preferred to Jack McGrath in the front row. \nPhilippe Saint-Andre's tenure in charge of France comes to an end after this World Cup, with Toulouse's Guy Noves set to take the reins from November onwards. Under the 48-year-old's stewardship, Les Bleus have frustrated and excited in equal measure as expectations for what is a very talented group of players have regularly fluctuated. Opening Pool D with a confident win over Italy, they took a while to break into stride against the Romanians and relied upon the magic of Frederic Michalak and tries from Wesley Fofana, Guilhem Guirado, Rabah Slimani, Pascal Pape and debutant Remy Grosso to negotiate the challenge of a plucky Canada outfit in Milton Keynes. Louis Picamoles will earn his 50th cap for France against Ireland in Cardiff Getty \nImpressive number eight Louis Picamoles and Fijian-born wing Noa Nakaitaci are back in the starting XV for this one, with Bernard Le Roux listed among the replacements and Grosso dropping out of the match-day squad altogether. Damien Chouly, who started at the base of the scrum last time out, is shifted to openside flanker. Teams \nFrance: 15. Spedding, 14. Nakaitaci, 13. Bastareaud, 12. Fofana, 11. Dulin, 10. Michalak, 9. Tillous-Borde; 1. Ben Arous, 2. Guirado, 3. Slimani 4. Pape, 5. Maestri, 6. Dusautior (c), 7. Chouly, 8. Picamoles \nReplacements: 16. Kayser, 17. Debaty, 18. Mas, 19. Flanquart, 20. Le Roux, 21. Parra, 22. Tales, 23. Dumoulin \nIreland: 15. R Kearney, 14, Bowe, 13. Earls, 12. Henshaw, 11. D Kearney, 10. Sexton, 9. Murray; 1. Healy, 2. Best, 3. Ross, 4. Toner, 5. O'Connell (c), 6. O'Mahony, 7. O'Brien, 8. Heaslip \nReplacements: 16. Strauss, 17. McGrath, 18. White, 19. Henderson, 20. Henry, 21. Reddan, 22. Madigan, 23. Fitzgerald What the coaches say \nPhilippe Saint-Andre: \" The pressure is all on Ireland. They are Six Nations champions and we haven't beaten them in four times. It is all on their shoulders. We know Ireland's strengths. They have a good carrying game, but they also have an excellent kicking game and are strong in the air. It's important to be disciplined, we will play with passion. Application, determination and concentration will determine the outcome of this match.\" \nJoe Schmidt: \" We thought Keith [Earls] played pretty well last week amidst a pretty flat effort and he played exceptionally well the last time he started in the Millennium Stadium. At the same time, Jared got through training on Wednesday and trained very well. But if we put him back into the game on Sunday it could aggravate the foot. There was a bit of swelling post-training on Wednesday. We felt it was prudent to leave Jared for another week. With the type of the game that is, we want to have a fully fit squad for that. \n\"Dev [Toner] has been a big game player for us and he gives us a little bit more lineout capability. Iain will add value and, again, it is a case of making sure that we have a few things covered for next week as well.\" Jonny Sexton kicked five penalties in February as Ireland beat France 18-11 on their way to Six Nations success Getty Other fixtures \nIn addition to France's showdown with Ireland, Sunday 11 October will also see Japan attempt to secure their third victory of the tournament when they face the United States and minnows Namibia bow out with a final fixture against Argentina. Italy also battle Romania in a Pool D dead rubber in Exeter. More about Rugby World Cup 2015", "external_links": [], "published": "2015-10-11T12:45:00.000+03:00", "crawled": "2015-10-11T12:53:08.216+03:00", "highlightTitle": ""}