{"organizations": [], "uuid": "c9c5c4d899f3ea076e7713d3556f90e0e0edb1b7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/Category/6/51/Sports/Egyptian-Football.aspx", "section_title": "Egyptian Football - Sports - Ahram Online ", "url": "http://english.ahram.org.eg/NewsContent/6/51/152716/Sports/Egyptian-Football/Egyptian-football-duo-Salah-and-Morsi-candidates-f.aspx", "country": "EG", "title": "Egyptian football duo Salah and Morsi candidates for African player of the year", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "Egyptian football duo Salah and Morsi candidates for African player of the year - Egyptian Football - Sports - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T03:00:00.000+03:00", "replies_count": 0, "uuid": "c9c5c4d899f3ea076e7713d3556f90e0e0edb1b7"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/6/51/152716/Sports/Egyptian-Football/Egyptian-football-duo-Salah-and-Morsi-candidates-f.aspx", "ord_in_thread": 0, "title": "Egyptian football duo Salah and Morsi candidates for African player of the year", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related Roma sign Egypt's Salah on permanent basis Egypt's Salah scores to continue perfect run with Roma Egypt's Salah eyes more success after opening Roma account in style Egyptian players abroad: Roma's Salah scores first goal in Serie A Egypt's Salah scores first competitive goal for Roma with superb volley AS Roma's Egyptian winger Mohamed Salah and Zamalek striker Bassem Morsi have been included in the preliminary list for the 2015 African Player of the Year, the Confederation of African Football (CAF) announced on Sunday.\nThe CAF released a 37-player list for the African Player of the Year award that included Ivory Coast's Yaya Toure, who won the title for the last three seasons, Porto's Algerian winger Yacine Brahimi and Dortmund's Gabonese striker Pierre-Emerick Aubameyang.\nThe 23-year-old Salah produced a string of strong displays with Fiorentina where he spent the first six months of the year, before sealing a move to the Serie A giants AS Roma this summer. He produced a similar performance with Roma scoring three goals in seven appearances so far.\nHowever, Zamalek striker Bassem Morsi has been also included in the 24-player list of nominations for the best African-based player award, so were his teammates fullback Hazem Emam and Burkinabe defender Mohamed Koffi.\nMorsi was instrumental in Zamalek's triumphant campaign last season, that saw the club win the double (domestic league and Egypt Cup) for the first time since 1988. He was Zamalek's top scorer on the season with 18 goals, two goals behind league's top scorer Hossam Salama who scored 20 goals.\nAhly's new-signing Malick Evouna features also in the list of candidates for best African-based player award. The Gabonese striker joined Ahly this summer from Moroccan side Wydad.\n ", "external_links": ["https://twitter.com/AO_Sports", "https://www.facebook.com/AhramOnlineSports?fref=ts"], "published": "2015-10-11T03:00:00.000+03:00", "crawled": "2015-10-12T02:35:45.733+03:00", "highlightTitle": ""}