{"organizations": [], "uuid": "708b5be6818bec7b367ab18e3fb455595f741e1e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.websterpost.com", "main_image": "http://www.websterpost.com/storyimage/NU/20151018/SPORTS/151019654/AR/0/AR-151019654.jpg", "site_section": "http://www.websterpost.com/sports?template=rss&mime=xml", "section_title": "Sports - Webster Post", "url": "http://www.websterpost.com/article/20151018/SPORTS/151019654/2000/NEWS?rssfeed=true", "country": "US", "title": "Outdoors: CWD among whitetails gaining steam", "performance_score": 0, "site": "websterpost.com", "participants_count": 1, "title_full": "Outdoors: CWD among whitetails gaining steam", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T17:00:00.000+03:00", "replies_count": 0, "uuid": "708b5be6818bec7b367ab18e3fb455595f741e1e"}, "author": "Len Lisenbee", "url": "http://www.websterpost.com/article/20151018/SPORTS/151019654/2000/NEWS?rssfeed=true", "ord_in_thread": 0, "title": "Outdoors: CWD among whitetails gaining steam", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted Oct. 18, 2015 at 9:00 AM By Len Lisenbee Posted Oct. 18, 2015 at 9:00 AM Canandaigua, N.Y. There is so much outdoor news piling up right now, including items such as the appointment of a new urban-minded DEC commissioner and new Lake Ontario fisheries studies. But there is some really bad news on the whitetail deer front. A disease that has been out of the news lately is now back with a full head of steam. Chronic Wasting Disease (CWD) is now spreading across parts of the U.S. and Canada at a horrific rate. Biologists in Wisconsin have even given the infected deer a name, “droolers and shakers.” But they only see a tiny percentage of the infected deer because most sicken and die in remote areas. That is a major problem because unseen sick and dying deer allow people to remain in denial that there is even a problem. But this problem is not only not going away, it is getting much worse and at faster and higher rates. And make no mistakes on this point. CWD is a brain disorder, and it is always fatal to the deer. Once deer contract CWD, their life expectancy is around 20 months. They may look healthy for the first 15 months or so before showing symptoms, which include tremors, heavy drool, staggering and starkly visible ribs and spinal bones outlined beneath the skin. This disease was first discovered in Wyoming and Colorado, where it infected both mule and whitetail deer and some elk. Then it made its way to Wisconsin and Illinois. In 2005 both New York and West Virginia discovered cases. But, in NY’s case a quick and effective response by the DEC appears to have eradicated it. Now for the really bad news. As of April 2015, this insidious disease has been found in wild deer in Texas, Utah, Colorado, Illinois, Iowa, Kansas, Maryland, Minnesota, Missouri, Nebraska, New Mexico, New York, North Dakota, South Dakota, Virginia, Pennsylvania, West Virginia, Wisconsin and Wyoming, as well as Alberta and Saskatchewan. It has also been found in fenced game farms in most of those states and provinces, as well as Michigan, Montana, Ohio and Oklahoma. The rates of infection are also high. In the past 14 years, Wisconsin has identified 2,840 cases of the disease. Illinois reports 410 positive cases, and WV has found 175. But the really troubling statistic is that infection rates are now climbing rapidly almost everywhere that CWD has been found in recent years. Here is just one example. In 2006, WV’s Division of Natural Resources reported all CWD cases were contained within a 15-square-mile area. The infected area grew to 25 square miles in 2007, 32 in 2008, 49 in 2009, 61 in 2010, 73 in 2011, 85 in 2012, and 108 in 2013. What about the situation in the western states? In Wyoming in 2010, experts called the mule deer herd in southeastern Wyoming the world’s sickest herd. More than 48 percent of all hunter-harvested deer carried the disease. And mule deer numbers in that area fell 50 percent with no antlerless harvest. Is there any hope for controlling this disease? Probably not. Both the U.S. (at Colorado) and Canada have developed experimental preventative vaccines with at least some success. But one glance at the larger picture of this problem reveals another truth. If somebody does develop a vaccine that is 100 percent effective, how does anyone distribute it to wild, free-roaming deer and elk over 20 or more states and the Canadian plains? The bottom line is funding, or a near-total lack of funding available from the federal government or the various states. There simply is little interest in CWD research anywhere. It is a serious problem that no one holding budget strings apparently wants to fund. Which is why most experts familiar with this disease agree that we will probably never get rid of it. And that begs the obvious questions. First, can we keep it at a “manageable” level in areas where it already exists? And, can we keep it out of non-infected areas? Fortunately New York has a plan that seems to be working. Any deer shot outside the state (in CWD-positive states) must have all of the meat completely de-boned (including all of the backbone) before that deer can be transported into this state. There are other restrictions such as possession of a trophy animal that are available in the hunter’s regulation guide. If any hunter shoots a deer that is acting strangely, wobbling, drooling, or that appears emaciated anywhere in this state, immediately contact the DEC for instructions. A replacement tag can be issued if that deer is seized for examination. Because of the potential problems involved, the DEC must be allowed to do whatever is considered necessary to prevent the spread of this terrible disease anywhere in this state. * * * A question from a while back on how to can venison was answered recently when I came across an article on that very topic. And canning deer meat is quite easy, even for us guys. All you need is some empty glass jars with rims and lids, canning salt, a pressure cooker and some venison. Other spices such as onion and/or garlic can also be added. First, cut up the venison into cubes or small pieces. (Remove all fat in this process.) And if you want to add in some onion or vegetables such as celery or carrots, this is the time. Sterilize the jars and add the meat, compacting it as you go to get the air out. Just make sure to leave an inch of space between the meat and the jar’s rim. Add one teaspoon of canning salt per jar. You do not have to add any liquid to the jars because the meat produces its own broth as it cooks. Cooking instructions come with the pressure cooker. And the results are delicious. Len Lisenbee is the Daily Messenger’s Outdoor Writer. Contact him at lisenbee@frontiernet.net. By Len Lisenbee", "external_links": [], "published": "2015-10-18T17:00:00.000+03:00", "crawled": "2015-10-19T03:34:07.931+03:00", "highlightTitle": ""}