{"organizations": [], "uuid": "e0d7a50d52a2dfd3111fa1f88a99129a500e3aa2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "", "site_section": "http://bostonherald.com/sports/red_sox_mlb", "section_title": "Sports: Red Sox &amp; MLB | Boston Herald", "url": "http://bostonherald.com/sports/red_sox_mlb/boston_red_sox/2015/10/red_sox_al_east_rivals_plotting_now", "country": "US", "title": "Red Sox’ AL East rivals plotting now", "performance_score": 0, "site": "bostonherald.com", "participants_count": 2, "title_full": "Red Sox’ AL East rivals plotting now | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T03:00:00.000+03:00", "replies_count": 1, "uuid": "6a4c16b4793331b9dd2423c87f2ed04c4d6eecd0"}, "author": "Michael Silverman", "url": "http://bostonherald.com/sports/red_sox_mlb/boston_red_sox/2015/10/red_sox_al_east_rivals_plotting_now#post-0", "ord_in_thread": 0, "title": "Red Sox’ AL East rivals plotting now", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Blue Jays are the American East’s last team standing, a juggernaut that should play deep into October. While the Blue Jays were the only team in their division against which the Red Sox were able to post a winning record (10-9) the Sox struggled to keep pace with everybody else in the division. Their .460 winning percentage (35-41) against AL East foes was even worse than their overall .481 winning percentage.\nConsidering that the best path into the 2016 postseason is winning the division, the Red Sox face a tall order in seeking to surpass all four teams. And those AL East rivals have their own houses to get in order, each with their own puzzles to solve and holes to fill.\nHere are the issues being discussed in the other four most important war rooms besides the one on Yawkey Way:\nYankees\n•     2015 record: 87-75, .537\n•    Standing: 2nd (AL wild card)\n•    Record vs. Red Sox: 11-8\n•    Record vs. AL East: 38-38\n•    2015 Opening Day payroll: $217.8 million\n•    Key free agents: None\nThe Yankees’ one-and-done showing in the American League wild card game confirmed they were fortunate that bounceback seasons from Alex Rodriguez and Mark Teixeira aligned with a season where all but one of the other teams in the division fielded weak units.\nNext season is likely the last for Teixeira, CC Sabathia (assuming he is able to return from his alcohol rehabilitation program) and Carlos Beltran, while Rodriguez is around for two more seasons. Brian McCann, Brett Gardner, Chase Headley and Andrew Miller are around for three more, and Jacoby Ellsbury and Masahiro Tanaka have just five more to go.\nWith position players, the club really has just one glaring need and that’s at second base. Howie Kendrick is one free agent stopgap solution but the Yankees will have to be creative here. The club needs a power-hitting outfielder — expect the Yankees to be linked with somebody such as free agent Justin Upton for a good portion of the winter.\nRecent comments from ownership hint at the club not being players for an elite starting pitcher because of luxury tax concerns, the same line the Yankees took and mostly stood firm by last offseason. The leading contender for the most natural fit for the Yankees is free agent left-hander David Price. The reason why the Steinbrenner family at least sounds truthful is that their starting rotation does trend on the young side. Tanaka, Luis Severino, Nathan Eovaldi and Michael Pineda are all 26 or younger.\nRays\n•    2015 record: 80-82, .494\n•    Standing: 4th\n•    Record vs. Red Sox: 10-9\n•    Record vs. AL East: 36-40\n•    2015 Opening Day payroll: $75.8 million\n•    Key free agents: SS Asdrubal Cabrera, DH John Jaso\nFor a team that was snakebitten by injuries early, the Rays held on much longer than anybody expected and never played much less than a respectable brand of baseball all season. That’s a credit to new manager Kevin Cash, who likely will be dealt a better hand pitching-wise in 2016 when his rotation becomes fully stocked again with Alex Cobb, Drew Smyly and Matt Moore. They would join Chris Archer and Jake Odorizzi to fill out what should be, once again, the deepest rotation in the division and perhaps the league.\nThe Rays’ problem is scoring runs. They were the only team from the division to finish with a runs-scored-per-game total that was below the league average of 4.39 and they were not even close: 3.98 runs a game, second-lowest in the league.\nThe Rays will likely be looking for replacements at shortstop for Cabrera, who had a nice season and finished with the third-highest WAR for AL shortstops, good enough where he might price himself out of southwest Florida. Jaso was only OK for the Rays, a good on-base guy (.380) but whose five home runs are not nearly enough from that position. The Rays are better on the trade market then they are players in free agency. They have enough pitching depth that they will likely choose to deal from their strength — starters, in particular — in order to address their glaring need for more offense.\nOrioles\n•    2015 record: 81-81, .500\n•    Standing: 3rd\n•    Record vs. Red Sox: 11-8\n•    Record vs. AL East: 39-37\n•    2015 Opening Day payroll: $119 million\n•    Key free agents: 1B Chris Davis, C Matt Wieters, LHP Wei-Yin Chen, RHP Darren O’Day, INF/OF Steve Pearce\nThat’s a long list of potentially departing players, headlined by Davis, representing critical elements of an Orioles team that underperformed this season. It’s difficult to imagine how the Orioles would be able to replace Davis’ production, which is why ownership and GM Dan Duquette face a dilemma. The team could not retain Nelson Cruz last year, yet Davis is going to wind up inking a multi-year deal worth far more — think five to six years for $23-27 million a year — than the mere $57 million Cruz hauled in for four years.\nAnd if they do not or cannot re-sign Davis, their pickings for pure sluggers are not bountiful. Many have thought that Upton, who grew up not too far from Baltimore, would like to play there some day, so he might become the focus.\nLosing Chen could be just as painful. He was the O’s best pitcher (11-8, 3.34 ERA) and given how injuries began to plague the club’s pitching group over the course of the season, the need to keep the rotation strong is pressing. Under owner Peter Angelos, the Orioles have a reputation for getting skittish (some say it’s more like getting cheap) when it comes to bringing in starting pitchers for long-term contracts, so much so that the team always tends to find some health issue that keeps them from pulling the trigger. Price would be such a perfect fit for the Orioles, if only to keep him out of the hands of their divisional foes. Whether or not the Orioles land Upton or Price — and it’s hard to give them the benefit of the doubt that they will indeed be major players for either one of them — this is a big winter in Chesapeake Bay. Coming off a .500 season when expectations were so much higher, the Orioles need to be movers and shakers rather than playing catch-up and reacting to the moves of others.\nBlue Jays\n•    2015 record: 93-69, .574\n•    Standing: 1st\n•    Record vs. Red Sox: 9-10\n•    Record vs. AL East: 42-34\n•    2015 Opening Day payroll: $125.9 million\n•    Key free agents: LHP David Price, LHP Mark Buehrle\nEverything looks just ducky for now north of the border, but sooner rather than later, the team will have to address two big holes — Price and Buehrle — that are going to appear like sinkholes as soon as their season ends. The Blue Jays’ need for an ace was evident before Price, and it’s not going away once he leaves, which is more probable than not. Softening the blow is that Marcus Stroman, who missed nearly all of this season with a knee injury, is back for 2016 and beyond. Even though he certainly appears to be an ace in the making, he is far from a guarantee. And while Buehrle is expected by some to be headed for retirement as soon as the season is over, his 1982⁄3 innings were indispensable to the Blue Jays’ cause. He, too, will be close to impossible to replace. With position players, the Blue Jays are in the sweet spot, with Josh Donaldson, Jose Bautista, Edwin Encarnacion (whose cheap $10 million 2016 option will be snapped up), Troy Tulowitzki and so many others all in place for at least another season.\nWith Toronto, it’s all about keeping its starting rotation respectable. Perhaps the extra postseason revenues will make the Jays more amenable to splurging on a talent like Price. Toronto’s moves on the pitching front bear close scrutiny but for now, its actual pitching, hitting and defense deserves the full attention of its divisional foes.", "external_links": [], "published": "2015-10-11T03:00:00.000+03:00", "crawled": "2015-10-11T13:54:57.566+03:00", "highlightTitle": ""}