{"organizations": [], "uuid": "5874ca2cf1f0a589e7b3496ed1f378877636eea4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "wtop.com", "main_image": "http://wtop.com/wp-content/uploads/2015/10/ALDS-Astros-Royals-Baseball2.jpeg", "site_section": "http://wtop.com/section/sports/feed/", "section_title": "WTOP » Sections » Sports", "url": "http://wtop.com/mlb/2015/10/royals-astros-both-have-penchant-for-playing-at-home/", "country": "US", "title": "Royals, Astros both have penchant for playing at home", "performance_score": 0, "site": "wtop.com", "participants_count": 1, "title_full": "Royals, Astros both have penchant for playing at home", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T10:37:00.000+03:00", "replies_count": 0, "uuid": "5874ca2cf1f0a589e7b3496ed1f378877636eea4"}, "author": "wtopstaff", "url": "http://wtop.com/mlb/2015/10/royals-astros-both-have-penchant-for-playing-at-home/", "ord_in_thread": 0, "title": "Royals, Astros both have penchant for playing at home", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Home » News » Sports » MLB » Royals, Astros both have… Royals, Astros both have penchant for playing at home By DAVE SKRETTA October 8, 2015 3:37 am The Kansas City Royals practice at Kauffman Stadium in Kansas City, Mo., Wednesday, Oct. 7, 2015. The Royals face the Houston Astros in Game 1 of the ALDS Thursday in Kansas City. (AP Photo/Orlin Wagner) \nKANSAS CITY, Mo. (AP) — Astros slugger George Springer attributes the trouble his team had on the road all season to the color of their jerseys, gray and drab, which might seem preposterous except for one thing: His manager, A.J. Hinch, offered up with the exact same reason. \n“I think when we started wearing the orange unis on the road, turned the tide,” Hinch said this week, only somewhat tongue-in-cheek. “I have no idea.” \nThe Astros entered Thursday night’s AL division series opener against the Kansas City Royals after going 33-48 on the road this season, the second-worst winning percentage for any postseason team in history. The 1987 Minnesota Twins went 29-52 away from home, according to STATS. \nIncidentally, the Twins went on to beat the St. Louis Cardinals to win the World Series in seven games, though Minnesota lost three all three on the road. \n“It’s something I haven’t been able to figure out. There’s really no rhyme or reason why we’ve done that,” Hinch said. “We haven’t been uncomfortable on the road. If you’re around our team this series, you’ll notice a very calm vibe, a very even-keel group. \n“We’re not intimidated by the road,” he insisted. “We haven’t backed down. We’ve played some bad baseball at times where we just haven’t pulled out wins. I mean, the facts are the facts.” \nHere is another fact, though: The Astros already proved they can win on the road when it really matters. They beat the New York Yankees 3-0 on Tuesday night in the winner-take-all AL wild-card game, earning the right to open against Kansas City at Kauffman Stadium. \nHouston dropped two of three in Kansas City earlier this season. \nPart of the reason may be that the Astros’ offense is predicated on power. They smashed 230 homers this season, second only (by two) to league-leading Toronto. \nThey were built to take full advantage of their bandbox ballpark, where a 315-foot popup clears the wall in left and a 326-foot blooper is a homer to right. Evan Gattis hit 27 long balls by himself, and Luis Valbuena and Colby Rasmus hit 25 each. Even diminutive second baseman Jose Altuve had 15 homers, more than all but five of the Royals. \n“What I’ve learned about our guys is that we have enough power to hit the ball out of any ballpark,” Hinch said. “We’ve just got to get a good pitch to hit.” \nAway from Minute Maid Park, they’ll be playing the first couple games in a big yard. Kauffman Stadium is 330 feet down the lines, 410 to center, while the massive gaps make the outfield feel like a prairie. \nThe Royals were built with the ballpark in mind. General manager Dayton Moore placed an emphasis on solid starting pitching, a tough bullpen and the kind of speedy, stingy defense that is in many ways a throwback to a bygone era, when teams had to scratch out runs. \nThe Royals had three players win Gold Gloves a year ago in outfielder Alex Gordon, first baseman Eric Hosmer and catcher Salvador Perez, the most in franchise history. They almost had another one in Alcides Escobar, who is a front-runner to earn it at shortstop this year. \nSo while Kansas City had three players belt 20 or more homers this season — three more than last season — the reigning AL champs still win with the same formula they used a year ago. \nIt certainly has worked. They were 51-30 at home this season. \n“We love the long ball too, don’t get me wrong. But we play more of a gap-to-gap style, aggressive-base-running style, solid defense-and-great-bullpen style here, because it fits our park,” Royals manager Ned Yost explained during Wednesday’s workout. “That’s the way Dayton Moore tailored this team, to play in this park.” \nThe Royals have at least been respectable on the road, though. They went 44-37 away from Kauffman Stadium, which included a three-game sweep by the Astros in Houston. \n“I guess we just don’t like our gray jersey. I’m really not quite sure why we play so well at home and then kind of that doesn’t translate on the road,” Springer said. “It’s just one of those things that you see in this game that you kind of don’t understand how it happens, but I guess hopefully that can switch around here.” Topics:", "external_links": [], "published": "2015-10-08T10:37:00.000+03:00", "crawled": "2015-10-08T11:31:31.878+03:00", "highlightTitle": ""}