{"organizations": [], "uuid": "5fc669e3af4880f69fbfa9a57147fc63aca0624c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.newsday.com", "main_image": "http://cdn.newsday.com/polopoly_fs/1.10963694.1444869173!/httpImage/image.JPG_gen/derivatives/display_600/image.JPG", "site_section": "http://www.newsday.com/sports", "section_title": "NY Sports News - Newsday - Scores, Schedules, News &amp; Standings | Newsday", "url": "http://www.newsday.com/sports/high-school/boys-soccer/goalie-chris-spalding-helps-save-the-day-for-glenn-1.10963904", "country": "US", "title": "Goalie Chris Spalding helps save the day for Glenn", "performance_score": 0, "site": "newsday.com", "participants_count": 1, "title_full": "Goalie Chris Spalding helps save the day for Glenn | Newsday", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T04:57:00.000+03:00", "replies_count": 0, "uuid": "5fc669e3af4880f69fbfa9a57147fc63aca0624c"}, "author": "OWEN O'BRIEN", "url": "http://www.newsday.com/sports/high-school/boys-soccer/goalie-chris-spalding-helps-save-the-day-for-glenn-1.10963904", "ord_in_thread": 0, "title": "Goalie Chris Spalding helps save the day for Glenn", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Glenn goalkeeper Chris Spalding may only be a sophomore, but you would expect him to be an upper classman by how he controls himself and the play on the field in front of him.\n\"Usually I put a little more on my shoulders,\" Spalding said, \"zone out the crowd and worry about what we need to do to win.\"\nLatest HS sports stories Esposito's two diving goals boost Miller Place Brentwood to host Alzheimer's All-Star Classic Baseball field to be named for LI coach ESM's Bukzin takes Division IV tennis title Callejas' 'instant' goal holds up for Brentwood Luckily for the Knights, that's exactly what happened as Glenn held on to a 2-1 victory Wednesday at Miller Place High School in Suffolk VI boys soccer. Glenn (12-0-2, 8-0-2 Suffolk VI) moved into first place in the league with the victory and Spalding, who made seven saves and has only allowed six goals all season, proved key in fighting off a late Miller Place rally.\nHunter Allen began the scoring for the Knights, capitalizing on a one-on-one from 5 yards out. Jacob Sherman sent a near-perfect cross from 25 yards into the middle of the field, which Ruben St. Paul fielded and immediately found Allen for the goal with 19 minutes remaining in the first half.\n\"I called for it, I saw the run across the box,\" Allen said. \"Beating the man goal-side . . . I got it and I just placed it in.\"\nBoys Soccer Glenn vs. Miller Place Allen scored again, this time off a cross from Luke Karen 25 yards out, to extend the Knights' lead to 2-0 with 23 minutes remaining. Then Allen admitted, \"We started letting up because we thought it was over. The other team came out with more energy.\"\nIt didn't take long after that for Miller Place to get on the scoreboard. Carter Contreras dazzled with a series of nice moves near midfield and found Alex Moschella streaking down the left sideline, who then beat Spalding to cut Glenn's lead to 2-1 with 19:54 remaining.\nMiller Place (6-4-1) pushed the pace in the final 20 minutes, creating multiple scoring chances, but Spalding kept making one key save after another.\n\"Sometimes I take it for granted,\" said Glenn coach Lou Hanner. \"I forget that we have so many young players out there.\"\nThe Panthers had one final opportunity with 30 seconds left, but their header attempt after Doug Minogue's throw-in sailed over the net.\n\"It's amazing,\" Allen said about the win. \"Trying to stay undefeated, that's the goal. This game was huge for us. We have two more games, win out and we get the league title. We know that each game means everything. This is my last year, I'm trying to make the most out of it.\"\nFind scores, schedules and stats Search Or\nSelect a sport in spring Nassau county schools\nBoys Badminton Coed Badminton Girls Badminton Baseball Crew Boys Golf Girls Golf Hand Ball Boys Lacrosse Girls Lacrosse Softball Boys Tennis Boys Track and Field Girls Track and Field Boys Volleyball Suffolk county schools\nBoys Badminton Girls Badminton Baseball Crew Boys Golf Girls Golf Hand Ball Boys Lacrosse Girls Lacrosse Softball Boys Tennis Boys Track and Field Girls Track and Field Boys Volleyball Private schools\nBoys Badminton Coed Badminton Girls Badminton Baseball Crew Boys Golf Girls Golf Hand Ball Boys Lacrosse Girls Lacrosse Softball Boys Tennis Boys Track and Field Girls Track and Field Boys Volleyball ALS fundraiser. Miller Place held a \"Kick out ALS\" fundraiser for Tristian Verdone's father, who was diagnosed with ALS. After the game, the senior goalkeeper said, \"It's really just great seeing everyone come. I can't say thank you enough and it's really been hard since he was diagnosed and the community has been helping out so much. It really feels great to see all this. It was a rough game but I'm happy this happened.\"\nSubscribe to Newsday’s high school sports weekly newsletter for the latest stories, scores and photos about Long Island high school sports events.", "external_links": [], "published": "2015-10-15T04:57:00.000+03:00", "crawled": "2015-10-15T19:40:01.254+03:00", "highlightTitle": ""}