{"organizations": [], "uuid": "b84528d144109f541d2a551d383cb0bc13fa9396", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.abqjournal.com", "main_image": "http://main.abqjournal.netdna-cdn.com/wp-content/plugins/journal-open-graph/img/albuquerque-journal.jpg", "site_section": "http://www.abqjournal.com/", "section_title": "Albuquerque and New Mexico News, Sports, Business and more | Albuquerque Journal News", "url": "http://www.abqjournal.com/653516/opinion/balloon-fiesta-offers-something-for-everyone.html", "country": "US", "title": "Balloon Fiesta offers something for everyone", "performance_score": 0, "site": "abqjournal.com", "participants_count": 1, "title_full": "Balloon Fiesta offers something for everyone | Albuquerque Journal News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T08:18:00.000+03:00", "replies_count": 0, "uuid": "b84528d144109f541d2a551d383cb0bc13fa9396"}, "author": "Mike and Genie Ryan / For the Journal", "url": "http://www.abqjournal.com/653516/opinion/balloon-fiesta-offers-something-for-everyone.html", "ord_in_thread": 0, "title": "Balloon Fiesta offers something for everyone", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Fall in New Mexico – the smell of roasting chiles, the state fair and, now, the balloon fiesta.\nOne of the most special times of the year here is highlighted by this week’s spectacular balloon show. Not much can beat the assault on our senses that the balloons bring – the sight of the balloons above our heads, the smell of coffee and breakfast burritos at the mass ascensions, the sound of the crowds and their awestruck excitement as the balloons launch and on and on.\nIt’s an awesome experience, and we dare anyone to come up with a much better way to spend the first week in October. And those of us who live here get to have the experience year after year. We are fortunate.\nWe’ve heard from other people – and have had the thought ourselves – who say, in anticipation of balloon fiesta, “Oh, well, been there, done that,” only to be reminded of the fun, the beauty and the excitement once the fiesta actually begins. The cynical been-there-done-that attitude is replaced with the annual awe that is our very own balloon fiesta.\nThe negative disruptions to our daily lives caused by increased traffic and parking problems seem unimportant when compared with the good these disruptions bring.\nWelcome to the Albuquerque International Balloon Fiesta sponsored by Canon, “Where Dreams Take Flight.”\nSurely, newcomers to the fiesta will take the time to attend all the events as they experience their first taste of Albuquerque’s premier event. Old-timers and returning guests have already decided what they like best and may pick and choose which events they attend.\nThe balloon glows are the favorite of many people although the mass ascensions, especially on the first weekend, cannot be beat. The special shape events are magical, both the mass ascension and the glow. It’s fascinating to watch America’s Challenge Gas Balloon Race and the scheduled contests for balloonists.\nThe full effect of the balloon fiesta cannot be felt, however, from a parking space overlooking the park or sitting on your patio watching the balloons fly over. The full effect can only be experienced on the field with the balloonists, the crowds, the vendors and a whole bunch of photographers. It is such a personal experience and so amazing to be right down there in the middle of things. Our balloon fiesta is one of the few events where the spectators are not roped off from the action, and it makes everyone feel as if they are participating.\nBalloon fiesta in Albuquerque is a very personal experience for the locals. We eagerly await new special shape balloons, we have our favorite balloons and get excited to see new ones. We understand roads will be filled with chase crews after the launch, and we must drive cautiously. We watch the weather as closely as the pilots do – or almost as closely. But, most important of all, we love it! The whole fiesta experience, not any one particular part, is what makes October in Albuquerque special.\nNew Mexico, Albuquerque, Rio Rancho – we all welcome the crowds and visitors to our fair state for this extra special event. Enjoy a week of balloons, “ooh” and “awe” with the natives, enjoy our cuisine, shop a little – and come back next year. We enjoy your company and are glad you come.\nContact the Ryans at ryan@abqjournal.com .", "external_links": [], "published": "2015-10-03T08:18:00.000+03:00", "crawled": "2015-10-03T09:56:28.970+03:00", "highlightTitle": ""}