{"organizations": [], "uuid": "0cad49bf7525fd09a3c7a6e9bfe4cfa3535c3e5a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "http://images.tribuneindia.com/cms/gall_content/2015/10/2015_10$largeimg25_Sunday_2015_220200008.jpg", "site_section": "http://www.tribuneindia.com/", "section_title": "The Tribune, Chandigarh, India : Latest news, India, Punjab, Chandigarh, Haryana, Himachal, Uttarakhand, J&amp;K, sports, cricket ", "url": "http://www.tribuneindia.com/news/science-technology/story/150376.html", "country": "US", "title": "Comet releases 500 bottles of alcohol every second", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "Comet releases 500 bottles of alcohol every second", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T02:00:00.000+02:00", "replies_count": 0, "uuid": "0cad49bf7525fd09a3c7a6e9bfe4cfa3535c3e5a"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/science-technology/story/150376.html", "ord_in_thread": 0, "title": "Comet releases 500 bottles of alcohol every second", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Washington\nComet Lovejoy is living up to its name by releasing large amounts of alcohol — as much as 500 bottles of wine every second — into space, scientists have found.\nThe discovery marks the first time ethyl alcohol, the same type in alcoholic beverages, has been observed in a comet, researchers said.\nThe finding adds to the evidence that comets could have been a source of the complex organic molecules necessary for the emergence of life, they said.\n\"We found that comet Lovejoy was releasing as much alcohol as in at least 500 bottles of wine every second during its peak activity,\" said Nicolas Biver of the Paris Observatory, France, lead author of a research paper published in journal Science Advances.\nThe team found 21 different organic molecules in gas from the comet, including ethyl alcohol and glycolaldehyde, a simple sugar.\nComets are frozen remnants from the formation of our solar system. Scientists are interested in them because they are relatively pristine and therefore hold clues to how the solar system was made.\nMost orbit in frigid zones far from the Sun. However, occasionally, a gravitational disturbance sends a comet closer to the Sun, where it heats up and releases gases, allowing scientists to determine its composition.\nComet Lovejoy (formally catalogued as C/2014 Q2) was one of the brightest and most active comets since comet Hale-Bopp in 1997.\nLovejoy passed closest to the Sun on January 30 this year, when it was releasing water at the rate of 20 tonnes per second. The team observed the atmosphere of the comet around this time when it was brightest and most active.\nThey observed a microwave glow from the comet using the 30-meter diameter radio telescope at Pico Veleta in the Sierra Nevada Mountains of Spain.\nThe advanced equipment was capable of analysing a wide range of frequencies simultaneously, allowing the team to determine the types and amounts of many different molecules in the comet despite a short observation period.\nSome researchers think that comet impacts on ancient Earth delivered a supply of organic molecules that could have assisted the origin of life.\nDiscovery of complex organic molecules in Lovejoy and other comets gives support to this hypothesis.\n\"The result definitely promotes the idea the comets carry very complex chemistry,\" said Stefanie Milam of NASA's Goddard Space Flight Centre in Greenbelt, Maryland, a co-author on the paper. — PTI", "external_links": [], "published": "2015-10-25T02:00:00.000+02:00", "crawled": "2015-10-26T06:10:52.240+02:00", "highlightTitle": ""}