{"organizations": [], "uuid": "4d9cf585b2b273db2f602d4433fbaca953db431f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "http://images.tribuneindia.com/cms/gall_content/2015/10/2015_10$largeimg15_Thursday_2015_132617227.jpg", "site_section": "http://www.tribuneindia.com/", "section_title": "The Tribune, Chandigarh, India : Latest news, India, Punjab, Chandigarh, Haryana, Himachal, Uttarakhand, J&amp;K, sports, cricket ", "url": "http://www.tribuneindia.com/news/world/pak-pm-sharif-records-statement-in-1990-poll-corruption-case/146335.html", "country": "US", "title": "Pak PM Sharif records statement in 1990 poll corruption case", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "Pak PM Sharif records statement in 1990 poll corruption case", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "4d9cf585b2b273db2f602d4433fbaca953db431f"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/world/pak-pm-sharif-records-statement-in-1990-poll-corruption-case/146335.html", "ord_in_thread": 0, "title": "Pak PM Sharif records statement in 1990 poll corruption case", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Islamabad, October 15 Pakistan Prime Minister Nawaz Sharif has recorded his statement in a 25-year-old corruption case involving alleged distribution of money by the army among leading politicians to defeat slain ex-premier Benazir Bhutto in the general election of 1990.\nOver Rs 14 crore were doled out to selective politicians allegedly, including Sharif who has rejected getting any money.\nThe Federal Investigation Team (FIA) recorded the statement of Sharif yesterday, according to interior minister Nisar Ali Khan.\nKhan said that the case will be taken to its logical conclusion after years of delay.\nAlso, known as Mehran Bank scandal, as the bank was used to dole out funds, and also as the Asghar Khan case, it came to the fore in 1996 when senior politician Asghar Khan asked the Supreme Court to proceed against former army chief General Mirza Aslam Baig, former ISI chief Lt Gen Asad Durrani and Younis Habib of Mehran Bank for disbursement of public money for political purposes.\nDurrani during hearing of the case provided an affidavit that the army had indeed distributed Rs 14 crore to political candidates against the Pakistan People's Party (PPP) only a few months before the October 1990 general election.\nThe payoffs worked and the PPP led by Bhutto lost the election while arch rival Sharif emerged as prime minister.\nThe Supreme Court started regular hearing of the compliant in 2012 but only partially unfolded it by asking the government to start a proper probe into the scandal.\nAfter wasting another three years, the current government has asked FIA to probe it. The interview of Sharif is part of his government's commitment that the facts behind the case will be revealed and all culprits brought to book. —PTI", "external_links": [], "published": "2015-10-15T03:00:00.000+03:00", "crawled": "2015-10-15T11:34:12.540+03:00", "highlightTitle": ""}