{"organizations": [], "uuid": "634cf91ce021ac921e5c6859c6cea9f007db20d3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "http://images.tribuneindia.com/cms/gall_content/2015/10/2015_10$largeimg08_Thursday_2015_012532431.jpg", "site_section": "http://www.tribuneindia.com/", "section_title": "The Tribune, Chandigarh, India : Latest news, India, Punjab, Chandigarh, Haryana, Himachal, Uttarakhand, J&amp;K, sports, cricket ", "url": "http://www.tribuneindia.com/news/sport/feisty-india-bounce-back-to-level-test-series/143273.html", "country": "US", "title": "Feisty India bounce back to level Test series", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "Feisty India bounce back to level Test series", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "634cf91ce021ac921e5c6859c6cea9f007db20d3"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/sport/feisty-india-bounce-back-to-level-test-series/143273.html", "ord_in_thread": 0, "title": "Feisty India bounce back to level Test series", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "New Delhi, October 7\nThe Indian men’s hockey team bounced back strongly to defeat New Zealand 3-1 in the second Test and level the four-match series 1-1 in Nelson today. Unlike in the opener, which they lost 2-0, the Indians lifted their game by leaps and bounds and displayed attacking hockey from the onset. India went on the attack right from the start and earned a penalty corner in the 10th minute but the effort was wide of the post. India opened their account in the 13th minute through Ramandeep Singh, who scored off a rebound after a save from goalkeeper Devon Manchester. India continued their attacking game in the second quarter but Dharamvir Singh’s brilliant try was blocked by an alert Manchester. Throughout the first half, the hosts had their chances to score, but goalkeeper PR Sreejesh was superb and was well supported by the Indian defenders. “We started poorly, we had the edge in the last game but they had that edge today,” said New Zealand coach Colin Batch. “We did improve as the game went on but the Indian goalkeeper denied us.” In the 23rd minute, New Zealand were awarded a penalty corner but Sreejesh made a brilliant save to deny the Black Sticks. Right at the start of the third quarter, an unmarked Gurjinder Singh had a great chance to double India’s lead but his deflection was wide of the post. New Zealand immediately counter-attacked and won a penalty corner in the 35th minute but Sreejesh again stood tall, leaving the hosts frustrated. New Zealand kept up the pressure and managed to equalise just before the end of the third quarter through Kane Russell, who scored from a cracking penalty corner drag-flick in the 45th minute. India intensified their attack and their efforts paid off in the 52nd minute when Manpreet Singh’s accurate pass found Lalit Upadhyay, whose calm finish gave the visitors a 2-1 lead. With little time left on the clock, the Black Sticks made the call to remove Manchester and add an extra field player. New Zealand held possession and once again looked threatening up-front, but when the ball fell to India, Nikkin Thimmaiah closed out the game with a goal in the final minute. India will now face New Zealand in the third Test match in Christchurch on October 9. — Agencies", "external_links": [], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-08T10:23:19.646+03:00", "highlightTitle": ""}