{"organizations": ["FIFA"], "uuid": "ab0dac6abb203e0300a418c99ffadd17cc38439d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.modernghana.com", "main_image": "http://img.modernghana.com/images/content/p7kw40ymm2_fifa.jpg", "site_section": "http://www.modernghana.com/rssfeed/news.xml?cat_id=2&gender=1", "section_title": "Sports News", "url": "http://www.modernghana.com/sports/649466/2/fifa-bans-south-african-official-for-six-years-in-.html", "country": "US", "title": "FIFA bans South African official for six years in fixing probe", "performance_score": 0, "site": "modernghana.com", "participants_count": 0, "title_full": "FIFA bans South African official for six years in fixing probe", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T17:10:00.000+03:00", "replies_count": 0, "uuid": "ab0dac6abb203e0300a418c99ffadd17cc38439d"}, "author": "", "url": "http://www.modernghana.com/sports/649466/2/fifa-bans-south-african-official-for-six-years-in-.html", "ord_in_thread": 0, "title": "FIFA bans South African official for six years in fixing probe", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  15:10 CET FIFA bans South African official for six years in fixing probe - www.ghanasoccernet.com \nLindile Kika, who was the South African Football Association’s head of national teams at the time, is banned from any soccer-related activities. \nFIFA judge Hans-Joachim Eckert found Kika guilty of breaching five sections of the ethics code: general rules of conduct, commission, conflicts of interest as well as loyalty, duty of disclosure, cooperation and reporting. But an ethics committee statement did not specifically say what Kika’s misdemeanors were. \nKika was among the SAFA officials asked to take a leave of absence in 2012 following a FIFA report into the match-fixing investigation. \nFIFA has previously said there was ”compelling evidence” that at least one of the warm-up games played by South Africa’s national team in May 2010 was fixed. No players are suspected of any wrongdoing. The manipulation is believed to be by referees working for the Singapore-based betting syndicate of Wilson Raj Perumal and Dan Tan. \nNeither FIFA nor SAFA have publicly identified the game or games under suspicion, but South Africa’s 5-0 win over Guatemala and 2-1 win over Colombia in May 2010 – weeks before the World Cup – have long been under suspicion because of the high number of penalties awarded. \nThe case has contributed to the image of South Africa’s World Cup being tarnished, with the bid itself now under suspicion following allegations FIFA votes were secured by more than $10 million in bribes. \nThe suspicion that two unidentified senior South African bid officials – and FIFA officials who supposedly sought bribes and facilitated payments – was contained in the indictment released in May by the U.S. Department of Justice that detailed more than two decades of corruption in world soccer. \nFor more Ghana football news visit www.ghanasoccernet.com", "external_links": [], "published": "2015-10-15T17:10:00.000+03:00", "crawled": "2015-10-15T16:42:24.899+03:00", "highlightTitle": ""}