{"organizations": [], "uuid": "e6e892a24e780559ca5b72baffc8b3006b2cf637", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.baltimoresun.com", "main_image": "http://www.trbimg.com/img-56281a2c/turbine/ph-cc-sp-terps-penn-state-rivalry-1022-20151021", "site_section": "http://www.baltimoresun.com/sports/rss2.0.xml", "section_title": "Sports - Baltimore Sun", "url": "http://www.baltimoresun.com/sports/ph-cc-sp-terps-penn-state-rivalry-1022-20151021-story.html", "country": "US", "title": "Maryland-Penn State a rivalry? Depends on who you ask", "performance_score": 0, "site": "baltimoresun.com", "participants_count": 1, "title_full": "Maryland-Penn State a rivalry? Depends on who you ask", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T01:57:00.000+03:00", "replies_count": 0, "uuid": "e6e892a24e780559ca5b72baffc8b3006b2cf637"}, "author": "Daniel Gallen", "url": "http://www.baltimoresun.com/sports/ph-cc-sp-terps-penn-state-rivalry-1022-20151021-story.html", "ord_in_thread": 0, "title": "Maryland-Penn State a rivalry? Depends on who you ask", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Daniel Gallen) \nWhether Maryland and Penn State view each other with an animosity that rivals an Ohio State-Michigan or Alabama-Auburn grudge match, the two teams are intertwined. Nittany Lions coach James Franklin was an assistant with Locksley in College Park during the early 2000s, and Franklin was the Terps' offensive coordinator under Ralph Friedgen in the late 2000s. \nPenn State has nine players from Maryland, one from Washington and a handful more from Northern Virginia. Maryland has 14 players from Pennsylvania listed on its roster. Historically, Penn State has recruited the Baltimore-Washington area well, getting some top prospect's to venture north for college. Franklin exchanged barbs with Edsall in spring 2014 after he took over the program. \nMaryland's throwback uniforms for the game are modeled after the look the team wore in 1961, the first time the Terps beat the Nittany Lions. \nBut once the players take the field at M&T Bank Stadium, they said they expect most of the talk and hype surrounding the game to dissipate, even if it doesn't for most of the fans watching. \n\"I think it's more of a fan thing because of the close proximity,\" right guard Andrew Zeller said. \"You have a lot of Maryland fans in Pennsylvania and you have a lot of Penn State fans in Maryland. So that's kind of more of a fan-driven thing, not necessarily a player-driven thing.\" \n\"It's another game,\" said Penn State tight end Brent Wilkerson, who attended DeMatha. \"I don't really think it's a rivalry. Maybe it's more of the fans, I'm not sure. I just think it's another game. I don't view them as a rival. I just think we're two teams trying to get a win and trying to reach for the top.\" \nBoth teams have much at stake Saturday. Penn State is trying to put together a decisive victory after some close finishes earlier this season. Maryland is trying to rebound under Locksley after its slow start, and bowl eligibility is still within reach for the Terps. Not to mention it's a Big Ten Conference matchup, and both Maryland and Penn State could play spoiler down the stretch in a tight East division race between Ohio State, Michigan State and Michigan. \n\"It's a bit of a rivalry,\" defensive coordinator Keith Dudzinski said. \"But you know what? You're playing in the Big Ten. Every game's going to feel like that now.\" \nMaryland quarterback Perry Hills is a Pittsburgh native who said he received a few letters from Penn State during the recruiting process. Though he grew up watching Pitt, he knows Penn State's significant presence in the state and the region. Known for his competitive nature as a high school wrestler, Hills' motivation for Saturday goes beyond simply facing another team on the schedule. \n\"It's personal to everyone every single week, no matter who we're playing,\" Hills said. \"It doesn't matter if it's Penn State or someone else. Someone else is trying to take something from you and that has to be personal, especially if they're coming into your town and trying to kind of embarrass you, it's definitely a personal game.\" \nIf the Nittany Lions feel any animosity toward the Terps after last season or if the Terps feel any added motivation to score a second straight victory in the series, neither side is saying anything publicly. They'll let their respective fan bases sort things out after Saturday's result. \n\"People can peg it however they want,\" Hills said. \"It's our next game, so it's the biggest game of the season.\"", "external_links": [], "published": "2015-10-22T01:57:00.000+03:00", "crawled": "2015-10-22T03:04:29.581+03:00", "highlightTitle": ""}