{"organizations": [], "uuid": "e150368914f6b84532a53cd796ed062af30e7837", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.huffingtonpost.com", "main_image": "http://s.huffpost.com/contributors/ken-reed/headshot.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/sports/index.xml", "section_title": "Sports - The Huffington Post", "url": "http://www.huffingtonpost.com/ken-reed/youth-sports-burnout-driv_b_8274078.html", "country": "US", "title": "Youth Sports Burnout Driven by Achievement by Proxy Syndrome", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Youth Sports Burnout Driven by Achievement by Proxy Syndrome", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T19:44:00.000+03:00", "replies_count": 0, "uuid": "e150368914f6b84532a53cd796ed062af30e7837"}, "author": "Ken Reed", "url": "http://www.huffingtonpost.com/ken-reed/youth-sports-burnout-driv_b_8274078.html", "ord_in_thread": 0, "title": "Youth Sports Burnout Driven by Achievement by Proxy Syndrome", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nDr. Chris Stankovich, a sport psychology consultant and advocate for positive youth sports development, has done a nice job summarizing the issues involved with a key youth sports issue today: burnout. \nYouth sports burnout in America is increasing at an alarming rate, and millions of kids nationwide are becoming both mentally and physically fatigued from playing sports too intensely, often year-round. Sadly, this phenomenon seems to be getting worse, and not better. This is probably due in large part to several contributing factors: Our country's great love of sports; increasing numbers of families turning to sports as a means of a free college education (or even an opportunity at professional sports); and parents living vicariously through their children and holding on to the pluralistic ignorant notion that \"more is better\" in terms of their kids playing sports better than they themselves did as kids. \nThe issue of coaches and parents obsessing about high school varsity status, All-League and All-State teams, scholarships and pro contracts has become so commonplace that psychiatrists have dubbed the condition Achievement by Proxy Syndrome - adults living vicariously through the exploits of their children. \nOf course, the issue of overbearing parents and coaches in youth sports isn't a new one. However, things are definitely getting worse. Adults are taking their seriousness about youth sports to new unhealthy extremes. \nThe number of incidents of physical violence and verbal abuse at youth sporting events has increased significantly the last decade. According to the National Alliance for Youth Sports (NAYS), approximately 15% of youth sports games played today involve a confrontation between parents, between parents and officials, between parents and coaches, or between coaches and officials. That's a jump from 5% a decade ago. \nChances of Playing College or Pro Sports Are Slim \nSimply put, when it comes to youth sports, as parents and coaches - as adults -- we need to chill out. Our sons and daughters almost assuredly aren't going to be pro athletes. Statisticians believe that you have a better chance of being murdered than becoming a professional athlete. \nIt's also extremely unlikely our children will receive a college athletic scholarship. Only one-to-two percent of high school senior athletes get a college athletic scholarship - partial or full. The percentage of high school senior athletes receiving \"full-ride\" athletic scholarships (which cover tuition, books, fees and room and board) is well under one percent. \n\"The more we can educate parents to have a realistic idea of what they're trying to accomplish when they put their kid in youth sports - and the more we can help them be more realistic about things like college athletic scholarships -- the better it will be for the kids, and the more fun they'll have,\" says Fred Bowen, a writer who covers youth sports for the Washington Post . \nIt's time for a serious reality check for everyone involved. NCAA research reveals the odds of becoming a college or pro athlete are steep: \nMen's Basketball \n• High school senior basketball players who go on to play NCAA men's basketball (all divisions - I, II & III, including \"walk-ons\"): Less than one in 35, or 2.9 percent. • NCAA seniors drafted by an NBA team: Less than one in 75, or 1.3 percent. • High school seniors eventually drafted by an NBA team: About three in 10,000, or 0.03 percent. \nWomen's Basketball \n• High school senior basketball players who go on to play NCAA women's basketball (all divisions): About three in 100, or 3.1 percent. • NCAA seniors drafted by a WNBA team: About one in 100, or 1.0 percent. • High school seniors eventually drafted by a WNBA team: About one in 5,000, or 0.02 percent. \nFootball \n• High school senior football players who go on to play NCAA football (all divisions): About one in 17, or 5.8 percent. • NCAA seniors drafted by an NFL team: About one in 50, or 2.0 percent. • High school seniors eventually drafted by an NFL team: About nine in 10,000, or 0.09 percent. \nBaseball \n• High school senior baseball players who go on to play NCAA baseball (all divisions): Less than three in 50, or 5.6 percent. • NCAA seniors drafted by a MLB team: Less than eleven in 100, or 10.5 percent. • High school seniors eventually drafted by a MLB team: About one in 200, or 0.5 percent. (However, these players almost always go to the minor leagues, where the odds of making it to the majors remain steep.) \nFor a bigger wakeup call - for young athletes and their parents and coaches -- consider that the numbers above for professional sports leagues refer to those drafted by a pro sports franchise. Actually making a big league roster and playing in a professional game at the highest level is even tougher. \nRest assured, the odds are similar for Major League Soccer (MLS), tennis, golf and other professional sports not listed above. \nThe takeaway: Go ahead and dream big but keep things in perspective. \nFor the sake of our young athletes. \nFollow Ken Reed on Twitter: www.twitter.com/KenReedLofF More:", "external_links": [], "published": "2015-10-10T19:44:00.000+03:00", "crawled": "2015-10-10T20:29:13.841+03:00", "highlightTitle": ""}