{"organizations": ["NBA", "Lakers"], "uuid": "85475cda4b161d1b0f629e5598e83b1a6bff9de5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.si.com", "main_image": "http://cdn-jpg.si.com/sites/default/files/styles/si_gallery_slide/public/2015/10/14/lamar-odom-death-los-angeles-sports-illustrated-lee-jenkins.jpg?itok=FGyiQcVM", "site_section": "http://www.si.com/htmlsitemap/2014/07/page-1", "section_title": "The Sports Illustrated HTML Sitemap Index for July, 2014 - SI.com", "url": "http://www.si.com/nba/2015/10/14/lamar-odom-lakers-clippers-kobe-bryant-phil-jackson", "country": "US", "title": "Lamar Odom's odyssey from wasted talent to heart of the Lakers - NBA -", "performance_score": 0, "site": "si.com", "participants_count": 0, "title_full": "Lamar Odom's odyssey from wasted talent to heart of the Lakers - NBA - SI.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "85475cda4b161d1b0f629e5598e83b1a6bff9de5"}, "author": "", "url": "http://www.si.com/nba/2015/10/14/lamar-odom-lakers-clippers-kobe-bryant-phil-jackson", "ord_in_thread": 0, "title": "Lamar Odom's odyssey from wasted talent to heart of the Lakers - NBA -", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Lee Jenkins", "Lamar Odom"], "text": "by Lee Jenkins Twitter Email Posted: Wed Oct. 14, 2015\n​ Editor's note: This story was originally published in the March 23, 2009 issue of SPORTS ILLUSTRATED. Lamar Odom was reportedly found unconscious on Tuesday at a Nevada brothel. He's currently being treated at a nearby hospital.\nThe happiest Laker is the one whose father was addicted to heroin, whose mother died of colon cancer when he was 12, who attended three high schools, had his first college scholarship revoked before the fall semester of his freshman year, became a subject of three college investigations, declared for the NBA draft, tried unsuccessfully to pull out of the draft, was picked by arguably the worst franchise in sports, violated the league’s antidrug policy twice within eight months and after finally getting his life together, went home to New York City for an aunt’s funeral and wound up burying his 6 1/2-month-old son, then getting robbed at gunpoint.\n“That's my book,” says Lamar Odom . “That’s my movie. It’s a big bowl of gumbo.”\nAs he ponders working titles for his life story—“This is L.A., so you never know,” he says—he is wearing a white sweat suit and driving a white Mercedes down Interstate 405 to an autograph signing in Orange County, one hand on the steering wheel and another deep inside a bag of potato chips. Every few minutes, he turns and glances at the backseat, where his 10-year-old daughter, Destiny, and 7-year-old son, Lamar Jr., are occupied with their own snacks.\n“My grandmother was always upbeat, a naturally happy person,” he says, chomping on the chips. “I think I got that from her.” His grandmother was Mildred Mercer, who raised him when his parents were gone. She died on June 28, 2003, three years to the day before his baby boy.\nNBA Video Lamar Odom in hospital after being found unconscious in Nevada brothel by SI Wire", "external_links": ["http://twitter.com/SI_LeeJenkins"], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-15T13:35:12.554+03:00", "highlightTitle": ""}