{"organizations": ["Lansing State Journal", "MSU"], "uuid": "56c32de5490e5653b1a47f9ed3be33ce805ff5d4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.lansingstatejournal.com", "main_image": "http://www.gannett-cdn.com/-mm-/0ad303a6f35b68c2d2b8884d8fc8953fbe91b392/c=0-301-2851-1912&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/08/MIGroup/Lansing/635799176326270232-USATSI-8813209.jpg", "site_section": "https://feeds.feedblitz.com/lansing/sports", "section_title": "Lansing - Sports", "url": "http://www.lansingstatejournal.com/story/sports/high-school/2015/10/08/el-offense-keeps-humming-caac-cup-semifinal-win/73584012/", "country": "US", "title": "Ex-MSU player Mark Scarpinato a key to Pitt's defense", "performance_score": 0, "site": "lansingstatejournal.com", "participants_count": 0, "title_full": "Ex-MSU player Mark Scarpinato a key to Pitt's defense", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T01:22:00.000+03:00", "replies_count": 0, "uuid": "56c32de5490e5653b1a47f9ed3be33ce805ff5d4"}, "author": "", "url": "http://www.lansingstatejournal.com/story/sports/high-school/2015/10/08/el-offense-keeps-humming-caac-cup-semifinal-win/73584012/", "ord_in_thread": 0, "title": "Ex-MSU player Mark Scarpinato a key to Pitt's defense", "locations": ["Iowa", "Iowa City"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Chris Solari", "Mark Scarpinato", "Pat Narduzzi", "Pitt", "C.J. Beathard", "Scarpinato"], "text": "Ex-MSU player Mark Scarpinato a key to Pitt's defense Chris Solari , Lansing State Journal 6:22 p.m. EDT October 8, 2015 Unheralded player in MSU's Rose Bowl run went to medical school, now back on the field at Pitt and helping Pat Narduzzi's thriving new defense Pitt defensive lineman Mark Scarpinato (97), who left MSU with a season of eligibility left to attend medical school after the 2014 Rose Bowl win, sacks Iowa quarterback C.J. Beathard (16) on Sept. 19 in Iowa City, Iowa. Scarpinato is playing for former MSU defensive coordinator Pat Narduzzi, who is now Pitt's head coach. (Photo: Reese Strickland/USA TODAY Sports) \nPITTSBURGH - Mark Scarpinato played a pivotal and unheralded role in Michigan State’s Rose Bowl win, blasting back the Stanford line at the bottom of the pile as Kyler Elsworth and Darien Harris made the game-winning stop. \nHe thought it would be his last game, his last play. \nGraduation had arrived after three years. Scarpinato, then a redshirt sophomore, decided to give up his final year with the Spartans. Medical school awaited. \nYet an unsettling desire to play remained. \n“He didn’t give his all when he was doing it,” said Pat Narduzzi, in his first year as a head coach with Pitt. “That was the problem. He felt, ‘I didn’t do my best.’” \nScarpinato called Narduzzi. He packed his bags this spring and followed his former defensive coordinator to Pittsburgh. He traded his scrubs and rubber gloves for helmet and football pads again. \nSo far, so good. \nScarpinato, a backup defensive tackle, has been a key translator for Narduzzi’s strategies to the Panthers’ front seven. Through four games, the 6-foot-3, 285-pound senior has five tackles and has helped 3-1 Pitt quickly become the nation’s No. 4 defense both overall and against the run going into its homecoming game Saturday against Virginia. \n“I think it was more mental. But I think it helped in being able to take a year off and realize it’s such a blessing to be out there,” Scarpinato said this week. “Every time I walk out, I’m just so happy. Even if you’re having a bad day, you just keep grinding because it’s not real life – it’s so much more fun.” \nScarpinato played in all 14 games during MSU’s run to the Rose Bowl, helping the Spartans rank No. 2 in the nation in total defense and against the run while finishing individually with 15 tackles and a sack. \nDefensive tackle Mark Scarpinato (97) tackles Minnesota running back David Cobb during the Spartans' win in 2013. (Photo: Mike Carter/USA TODAY Sports) \nHe spent last year as a first-year student at Medical School of Wisconsin. It’s in his hometown of Milwaukee, where his father Len is an internal medicine doctor. Scarpinato still had football flowing through him, however. After talking to Narduzzi and some of his mentors, he opted to take a leave from medical school to pursue his master’s degree in health administration at Pitt. \nHis last game was Jan. 1, 2014. He missed the Panthers' spring practice but was allowed per NCAA rules to play immediately as a graduate transfer, with one year of eligibility remaining. Scarpinato even showed enough to earn a scholarship from Narduzzi this fall. \n“It was tough, because I took a year off. I wasn’t fully training hard the whole year, because I didn’t know I was coming back,” Scarpinato said. “That was tough, getting back in the physical aspect of it. But that’s life, and we kept working.” \nLast week against Virginia Tech, Scarpinato and Pitt’s defense smothered the Hokies in a 17-13 road win. Scarpinato had two tackles, a pass break-up and a quarterback hurry as the Panthers held the Hokies to 9 yards rushing and 100 yards of total offense. \nNarduzzi called Scarpinato “a player-coach” for the Panthers. \n“I don’t think (the year off) has affected him as much as you’d maybe think,” Pitt defensive coordinator Josh Conklin said. “I always think if I got out of football and tried to get back in, it’d be really hard to do. But he’s made that transition really well.” \nScarpinato said, four games into his return, he’s starting to process things faster and get his instincts back to where they were at MSU. \n“That’s where I think it’s going to be on the up and up, when you finally get it to slow down again,” he said. “It wasn’t even the plays or even the technique, it was just the speed. It finally slowed down, and I feel good where I’m at. Just gotta keep improving.” 18 CONNECT 13 TWEET LINKEDIN 3 COMMENT EMAIL MORE Read or Share this story: http://on.lsj.com/1LkF67d TOP VIDEOS", "external_links": [], "published": "2015-10-09T01:22:00.000+03:00", "crawled": "2015-10-09T20:02:31.126+03:00", "highlightTitle": ""}