{"organizations": [], "uuid": "77387342231cc6f7670729f13e28649a24956fcc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "", "site_section": "http://www.tribuneindia.com/", "section_title": "The Tribune, Chandigarh, India : Latest news, India, Punjab, Chandigarh, Haryana, Himachal, Uttarakhand, J&amp;K, sports, cricket ", "url": "http://www.tribuneindia.com/news/haryana/bureaucrats-play-key-role-in-running-the-show/148897.html", "country": "US", "title": "Bureaucrats play key role in running the show", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "Bureaucrats play key role in running the show", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "77387342231cc6f7670729f13e28649a24956fcc"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/haryana/bureaucrats-play-key-role-in-running-the-show/148897.html", "ord_in_thread": 0, "title": "Bureaucrats play key role in running the show", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Naveen S Garewal & Pradeep Sharma Tribune News Service\nChandigarh, October 21\nThe bureaucrats in Haryana have never had it so good. The inexperienced Manohar Lal Khattar-led BJP government has being relying on the civil and police bureaucracy which, in turn, has politicians in a spin. Not only the BJP legislators, but also the ministers have been cribbing over their inability to choose officers of their choice for their departments and constituencies. The office of the Chief Secretary issued a letter in February to all administrative secretaries and heads of departments to ensure proper procedure is followed while dealing with Members of Parliament and state legislature. The office of the Chief Secretary used an earlier letter by the Secretary Personnel, Government of India, highlighting that some MPs had pointed out “district-level officers have not been showing them due regard and courtesy”. In the initial days of the first BJP government in Haryana, led by first-time MLA Khattar, the government had no option but to rely on the well-entrenched bureaucracy which usually has its own petty interests. As bureaucrats realised that they were indispensible, Haryana saw realignment among officers belonging to diverse groups to ensure the politicians did not get better of them. Influence by certain officers is said to be the cause behind the transfer of Gurgaon Joint Commissioner of Police Bharti Arora even before an inquiry into her spat with Gurgaon Commissioner of Police Navdeep Virk was completed by DGP KP Singh. The report has still not seen the light of the day, though it was bound to be completed in a week. Health Minister Anil Vij tried hard to move an officer out of his department, as he did not appreciate the officer’s style of functioning. But he failed, as did other ministers such as Rao Narbir Singh. The perception in the corridors of powers is that the Chief Minister and a majority of his Cabinet colleagues are being led by senior bureaucrats. With “babus” calling the shots, the government’s agenda of good governance and transparency in administration is taking a hit as the bureaucracy works at its own pace and, sometimes, has its own agenda. It is often joked either the Chief Minister, who enjoys a clean image so far, is kept away from other politicians by the bureaucrats or he deliberately prefers to keep the company of bureaucrats who have “ready solutions” for all his administrative challenges. Even at yesterday’ press conference, Khattar chose to remain mum on the role of bureaucracy in his government. Insiders in the BJP conceded “insensitive” attitude of the bureaucracy and police, especially at the district level, had failed to make a desired impact of the flagship programmes such as CM Window and Harsamay police web portal. Several pro-people initiatives failed to reach the people at the grassroots level in spite of government’s best intention. The former Congress government was considered to be “soft” on bureaucracy and Khattar is considered to be no different. Certain “babus” close to the previous government are enjoying good postings, while whistleblower IAS officers Ashok Khemka and Pradeep Kasni continue to languish at inconsequential postings despite the BJP making corruption a big issue in the last year’s Assembly and parliamentary elections. The loose grip of the political establishment over the bureaucracy has repeatedly been demonstrated time and again in the last one year. The first instance was the mishandling of Satlok Ashram head Rampal case. In the absence of no clear instructions to the police from the top, thousands of Rampal supporters were allowed to gather inside the well-fortified ashram in Hisar with a showdown with the police resulting in several deaths and huge embarrassment for the government. But the government’s silence in incidents such as the slugfest between Gurgaon top police officers, apparently at the suggestion of bureaucrats close to the Chief Minister, has resulted in government’s image taking a beating. Even in the Sunped incident, where two children of a Dalit family were burnt, Khattar’s absence from the scene is attributed to the advice of bureaucrats. CII hails BJP Govt’s first year in office Chandigarh: Appreciating initiatives in the first year of the Haryana Government led by Manohar Lal Khattar, the Confederation of Indian Industry (CII) said “the government has exceeded our expectations and has achieved more in the first year than any other state government has achieved in its first year as far as the revival of investor confidence and implementation of new programmes for citizens’ welfare are concerned”. Shreekant Somany, Chairman, CII’s Northern Region, shared that “in its first year, the government has turned around investor sentiments by laying the much-needed thrust on transparency, ease of doing business, effective single-window clearance mechanism, support to MSMEs, skilling, R&D, and rationalisation of labour laws etc besides devising a progressive Industrial Policy”.Sameer Munjal, Chairman, CII Haryana State Council, said the CII was committed to working jointly with the Haryana Government on long-term interventions for gender equality through girls’ education, nutrition, health, protection against violence and exploitation, female literacy, skill development, maternity protection, asset creation and ownership. —TNS", "external_links": [], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-22T04:06:30.603+03:00", "highlightTitle": ""}