{"organizations": ["AP NFL", "Raiders", "NFL", "Dolphins", "Patriots", "Jets", "Boston Globe"], "uuid": "dd12acf974a339898bd6087226bed3a174484ca9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.boston.com", "main_image": "http://p.o0bc.com/rf/image_1200x628/Boston/2011-2020/2015/10/24/Boston.com/BCOM/Images/490295150-5319.jpg", "site_section": "http://syndication.boston.com/sports/news?mode=rss_10", "section_title": "Sports - Boston.com", "url": "http://www.boston.com/sports/football/patriots/2015/10/24/darrelle-revis-switches-sides-again-keep-jets-patriots-rivalry-heated/O1LdiEKUao1URmete2FJkI/story.html", "country": "US", "title": "Darrelle Revis switches sides (again) as Jets-Patriots rivalry remains heated without Rex", "performance_score": 0, "site": "boston.com", "participants_count": 0, "title_full": "Darrelle Revis switches sides (again) as Jets-Patriots rivalry remains heated without Rex", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T17:54:00.000+02:00", "replies_count": 0, "uuid": "dd12acf974a339898bd6087226bed3a174484ca9"}, "author": "", "url": "http://www.boston.com/sports/football/patriots/2015/10/24/darrelle-revis-switches-sides-again-keep-jets-patriots-rivalry-heated/O1LdiEKUao1URmete2FJkI/story.html", "ord_in_thread": 0, "title": "Darrelle Revis switches sides (again) as Jets-Patriots rivalry remains heated without Rex", "locations": ["New York", "New England", "Boston"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Rex Ryan", "Jim Davis/The", "Ridley", "Bill Parcells", "Revis", "Ray Lucas", "Fitzpatrick", "Kenbrell Thompkins", "Brandon Marshall", "Thomas Jones", "Bobby Hamilton", "Brandon", "Rex Previous", "Marshall", "Belichick", "Darrelle Revis", "Todd Bowles", "Thompkins", "Ryan Fitzpatrick", "Don Maynard", "Stevan Ridley", "Michael Robinson-Chavez/The", "Ryan", "Dedric Ward", "Chris Ivory", "Anthony Pleasant"], "text": "Previous -- of -- Next Bobby Hamilton went undrafted in 1994, and eventually signed with the Jets and played with New York through the 1999 season. He signed with the Patriots in 2000, where he amassed 137 tackles in four seasons, winning a pair of Super Bowls. Al Bello/Getty Images Quarterback Ray Lucas spent the 1996 season with the Patriots after going undrafted. He joined the Jets in 1997 and played in New York for four seasons. He finished his career with 18 touchdowns, 17 interceptions, and 3,029 yards. Jim Davis/The Boston Globe Previous -- of -- Next Defensive end Anthony Pleasant spent the 1998 and 1999 seasons with the Jets, where he had 75 tackles and eight sacks. He played with New England from 2001 to 2003, where he won two Super Bowls, had 10 sacks, and recorded 52 tackes. Jim Davis/The Boston Globe Previous -- of -- Next The Jets drafted Dedric Ward in the third round of the 1997 NFL Draft. In his four seasons in New York, he had 1,815 receiving yards and 11 touchdowns. The Super Bowl champion spent two seasons with the Dolphins but played with the Patriots for the 2003 season. Michael Robinson-Chavez/The Boston Globe New York and Boston have been rivals for more than a century — not just in football, and not just in sports. But the NFL ‘‘border wars’’ that flared up between Belichick and mentor Bill Parcells had cooled before Rex Ryan took over the Jets. Still, he couldn’t make much of a dent in a Patriots reign that has earned them 11 AFC East titles in 12 years. Revis switching sides might not be enough to change that, but with a victory the Jets would tie New England atop the division. Here are some more things to look for in Sunday’s game: SMALL TALK: Ryan arrived in New York vowing to challenge the Patriots’ supremacy. Though the Jets did reach the conference championship game in back-to-back seasons (2009-10), they only went through the Patriots once and never won a division title. Under new coach Todd Bowles, the Jets have taken a quieter approach. ‘‘It’s as big as you want it to be,’’ Revis said. ‘‘For us, it’s still early in the season. We’re still trying to get better and better each week. It is a big game because it is a conference game, but at the same time, it’s still early in the season. ... Whoever’s on the schedule that week, that’s who we’ve got to play.’’ IVORY SHINES: Jets running back Chris Ivory is off to the best start of his NFL career. He’s coming off his first back-to-back 100 yards rushing performances, and his 312 yards rushing combined over the last two games are the most by a Jets player since Thomas Jones had 331 in 2009. Ivory leads the NFL with 115 yards per game, ranks second with 5.54 yards per carry, and is third in overall rushing with 460 yards — despite missing one game with a quadriceps injury and having a bye-week break. ‘‘It’s a great scheme and they’re doing a hell of a job up front,’’ Ivory said. ‘‘I’m being very patient, probably the most patient I’ve been throughout my career.’’ MARSHALL LAW: Brandon Marshall has 100 or more yards receiving in four straight games, becoming the Jets’ first player to accomplish the feat since Hall of Famer Don Maynard in 1968 and the third overall. He has 37 catches for 511 yards and four touchdowns, the last score stunning quarterback Ryan Fitzpatrick when Marshall made a terrific fingertips catch just off his shoe tops on a poor throw and then scooted down the sideline for a 35-yard TD. ‘‘How he caught it, I don’t know,’’ Fitzpatrick said. ‘‘How he turned it in to a touchdown, I really don’t know. That’s one of those where you’re very thankful that Brandon is my teammate and very thankful for the opportunity to get to throw to him.’’ EX-PATS: In addition to Revis, wide receiver Kenbrell Thompkins and running back Stevan Ridley could play against their former teammates in New England. Thompkins was promoted this week from the Jets’ practice squad. He was signed by the Patriots as an undrafted free agent in 2013 and also spent time with the Raiders last year before spending this summer with New England again. Ridley, who practiced for the first time this season on Wednesday, is making a return from torn knee ligaments suffered last year with the Patriots. He’s on the physically unable to perform list, and the Jets wanted to see how he got through the week before deciding whether to activate him. ___ AP NFL website: www.pro32.ap.org and www.twitter.com/AP_NFL Most Popular", "external_links": [], "published": "2015-10-25T17:54:00.000+02:00", "crawled": "2015-10-25T18:17:39.636+02:00", "highlightTitle": ""}