{"organizations": [], "uuid": "dce9489532ba81518d94585162da2bf093de121d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports/tennis", "section_title": "Tennis News, Scores, Schedule, Standings, Stats, Photos, Videos - MSN Sports", "url": "http://www.msn.com/en-us/sports/more-sports/serena-could-blow-dollar3-million-by-bailing-on-2015-season/ar-AAfaMfn", "country": "US", "title": "Serena could blow $3 million by bailing on 2015 season", "performance_score": 0, "site": "msn.com", "participants_count": 5, "title_full": "Serena could blow $3 million by bailing on 2015 season", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T03:00:00.000+03:00", "replies_count": 4, "uuid": "dce9489532ba81518d94585162da2bf093de121d"}, "author": "Chris Chase", "url": "http://www.msn.com/en-us/sports/more-sports/serena-could-blow-dollar3-million-by-bailing-on-2015-season/ar-AAfaMfn", "ord_in_thread": 0, "title": "Serena could blow $3 million by bailing on 2015 season", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Serena could blow $3 million by bailing on 2015 season USA Today Sports 6 days ago Chris Chase © USA Today Sports Serena Williams Serena Williams’ decision to rest after her U.S. Open failure is almost certainly a good thing for her tennis game. Her wallet, on the other hand, won’t be as fortunate.\nAdChoices The world No. 1 is facing a hefty fine and the loss of some easy money by bailing on the final two tournaments of the year.\nFirst and foremost, there’s the $2.36 million that will go to the winner of the WTA Finals, an event Serena would have been heavily favored to win, namely because of the quality of the field — the top eight players qualify and Serena only seems to struggle with players ranked No. 15 or below.\nBut there’s more at stake than just the theoretical winnings.\n\"Her fine for missing the WTA Finals in Singapore will be $125,000. […] By skipping the China Open, Williams will have failed to meet the required commitment to play in at least four of the five WTA Premier Mandatory events.\n\"Therefore, she forfeits the $450,000 she would have earned in bonus pool money as the No. 1 player. And because Williams didn’t play all nine of the WTA events that would have qualified her for a “Super Bonus,” she can’t claim that $100,000 either.”\nThat’s around $3 million of which only $125,000 is an actual fine — though Bodo notes she could avoid said fine if she appears in Singapore for the Finals just to make an appearance, which the WTA desperately needs from an attention standpoint. (This is what happens when you hold your marquee event halfway across the world from the tennis hubs of Europe and North America.)\nThe rest — $550,000 — is money Serena will sacrifice after earning it through nine months of hard work and dominance.\nAnd this is an interesting insight into the guarded, private world of Serena Williams. Most players would want to cash those checks, no matter how much money they already have in the bank. (Although Serena should be making plenty by playing in the IPTL, an offseason exhibition league that pays stars big money for a few matches in Asia — Serena is on the Philippine Mavericks).\nBut not Serena. She does what she wants. And whenever there’s a controversy about how Maria Sharapova and Li Na make more money in endorsements, it’s important to remember that moves such as this — giving up easy money simply because she can — could be a factor in why more companies don’t sign deals with the world’s best tennis player. Maybe she just doesn’t want it.\nSharapova is happy to shill all over the world for her sponsors. Serena enjoys going on HSN to sell her clothing line. To each their own. And as this shows, Serena Williams isn’t shy about leaving money on the table.\nGo to MSN Home", "external_links": ["http://www.usatoday.com/sports/", "http://go.microsoft.com/fwlink/?LinkID=286759"], "published": "2015-10-07T03:00:00.000+03:00", "crawled": "2015-10-13T19:36:26.046+03:00", "highlightTitle": ""}