{"organizations": ["NASCAR"], "uuid": "1baca382a6693005e53222f59b7f90f9f4f69156", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxsports.com", "main_image": "http://a.fssta.com/content/dam/fsdigital/fscom/nascar/images/nascarsection/2015/09/30/093015-NASCAR-Driving-Force-MM-PI.vresize.1200.675.high.51.jpg", "site_section": "http://api.foxsports.com/v1/rss?partnerKey=zBaFxRyGKCfxBagJG9b8pqLyndmvo7UU&tag=nascar", "section_title": "FOX Sports Digital", "url": "http://www.foxsports.com/nascar/story/tony-stewart-retirement-announcement-clint-bowyer-stewart-haas-racing-sprint-cup-series-093015", "country": "", "title": "Tony Stewart will be in cockpit after 2016, just not in NASCAR", "performance_score": 1, "site": "foxsports.com", "participants_count": 0, "title_full": "Tony Stewart will be in cockpit after 2016, just not in NASCAR", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T20:41:00.000+03:00", "replies_count": 0, "uuid": "1baca382a6693005e53222f59b7f90f9f4f69156"}, "author": "", "url": "http://www.foxsports.com/nascar/story/tony-stewart-retirement-announcement-clint-bowyer-stewart-haas-racing-sprint-cup-series-093015", "ord_in_thread": 0, "title": "Tony Stewart will be in cockpit after 2016, just not in NASCAR", "locations": ["N.C.", "Kannapolis"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Tom Jensen", "Tony", "Tony Stewart"], "text": "FOXSPORTS Tony Stewart will be in cockpit after 2016, just not in NASCAR If you want to know what Tony Stewart's retirement announcement was like, it can be boiled down to a single sentence: Tony being Tony. By Tom Jensen Sep 30, 2015 at 1:41p ET Kannapolis, N.C. 0Shares \nIf you want to know what Tony Stewart ’s retirement announcement was like, it can be boiled down to a single sentence: Tony being Tony. \nIn announcing that 2016 would be his final season driving the No. 14 Stewart-Haas Racing Chevrolet, Stewart flashed many of the facets of the personality he’s shown since bursting onto the NASCAR Sprint Cup Series scene in 1999. He was by turns gracious, joking, humble, sarcastic, occasionally emotional and generous with praise. \n“NASCAR is probably going to be the most disappointed of everybody today because they aren't getting rid of me,” Stewart said at one point. “They have to deal with me as an owner. There's still the opportunity to get fined and there's still the opportunity to be put on probation, just like always, just from a different capacity than now.” \nHe kidded with SHR co-owner Gene Haas and Stewart’s replacement, Clint Bowyer , who will take over the No. 14 in 2017, at one point saying -- jokingly -- that he would drive the second Haas F1 car. \nHaas had hosted a press conference in the same building a day earlier, announcing Roman Grosjean would drive on the Haas F1 cars next year. “The one variable he left out, I know it was just probably a miscue, but he announced his full-time driver next year in the F1 car,” Stewart said of Haas. “He didn't announce his second driver for the F1 team, and you're looking at him.” \nAnd Stewart made it very clear he wants to win in NASCAR in 2016, specifically mentioning the Daytona 500 and Southern 500 as the two races he most wants to capture. “I can promise you next year is not a coast-and-collect year,” said Stewart. “Just the opposite.” \nAnd for Stewart fans, there was one big and very welcome surprise: He’s not totally retiring from driving after 2016; he’s just not going to race Sprint Cup anymore. The 10 drivers most likely to follow Jeff Gordon, Tony Stewart into retirement \n“Yeah, I'm still going to race,” Stewart said. “I'm not retiring from racing; I'm just retiring from the Cup Series. You know, perfect examples like this past weekend at Loudon (New Hampshire). I've run the modified tour race up there before and loved it. A lot of times since then, I've tried to run it and we've had sponsor obligations and other things. I'm not totally getting away from it, and that's a perfect opportunity on two perfect weekends where I can be there with the Cup side and I still get to race, too. I'm not retiring from racing. I'm just retiring from the Cup Series and focusing on the owner side.” \nAsked by FOXSports.com if he might race in the Rolex 24 or in the dirt cars he loves so much, Stewart smiled and said, “All of the above.” \nHe then added, “There's great racing across the country and there's neat marquee events that you look at in the paper, and you're like, ‘Man, it would be really cool to try that.’ We're now going to have that opportunity in a couple years to do that.” \nAnd Stewart also was queried about running the occasional NASCAR XFINITY or Camping World Truck series race. “I haven't ruled that out at all,” he said. \nOne race Stewart won’t enter again, however, is the Indianapolis 500. Asked about that possibility he would run that one, Stewart had a one-word answer: “No!” he said. 0", "external_links": [], "published": "2015-09-30T20:41:00.000+03:00", "crawled": "2015-10-01T00:46:16.448+03:00", "highlightTitle": ""}