{"organizations": [], "uuid": "0ca2b68c5fb1d00658c6321f13ec1aa1db879f24", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailyherald.com", "main_image": "http://www.dailyherald.com/gfx/site/logos/dailyherald_marble_300.jpg", "site_section": "http://www.dailyherald.com/rss/feed/?feed=sports_all", "section_title": "DailyHerald.com &gt; Sports", "url": "http://www.dailyherald.com/article/20151010/sports/151019831/", "country": "US", "title": "Cubs bullpen comes through in Game 2 win over Cardinals", "performance_score": 0, "site": "dailyherald.com", "participants_count": 1, "title_full": "Cubs bullpen comes through in Game 2 win over Cardinals - DailyHerald.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T07:56:00.000+03:00", "replies_count": 0, "uuid": "0ca2b68c5fb1d00658c6321f13ec1aa1db879f24"}, "author": "Scot Gregor", "url": "http://www.dailyherald.com/article/20151010/sports/151019831/", "ord_in_thread": 0, "title": "Cubs bullpen comes through in Game 2 win over Cardinals", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ST. LOUIS -- Chicago Cubs right-hander Kyle Hendricks was pretty sure about one thing heading into Saturday's start against the St. Louis Cardinals in Game 2 of the National League division series.\n\"I knew going in there was going to be maybe a short leash if there was any trouble,\" Hendricks said.\nrelated advertisement video Relief pitcher Wood on Game 2 There was.\nHendricks put the Cubs in a quick hole when he left a 1-2 pitch up to Matt Carpenter, who led off the first inning with a solo home run.\nAn imaginative Cubs offense and some sloppy play by mound counterpart Jaime Garcia picked up Hendricks with 5 runs in the second inning and 1 in the third, but St. Louis chopped the lead to 6-3 in the fifth inning when Kolten Wong and Randal Grichuk hit back-to-back home runs.\nThat forced Cubs manager Joe Maddon to yank the leash, but Hendricks wasn't overly concerned as he headed off the field.\n\"I think the bullpen is very overlooked,\" Hendricks said. \"There are a ton of quality arms down there, and like you saw today, (Travis) Wood is just fearless. He goes after hitters and gets the job done.\n\"(Trevor) Cahill had unbelievable stuff today, his sinker/changeup combination is unbelievable. And the guys at the back end, (Justin) Grimm, (Pedro) Strop, (Fernando) Rodney, (Hector) Rondon, they are tough.\"\nHendricks put the bullpen in a tough spot in Game 2, but Wood responded with 2⅓ scoreless innings with Cahill and Rondon each contributing 1 scoreless inning in the Cubs' 6-3 victory at Busch Stadium.\nIn the NL Central, the Cardinals and Pirates each rolled out quality bullpens which helped them finish first and second. The Cubs might be third, but getting the job done right now is all that matters, and the bullpen did just that Saturday.\n\"The bullpen was outstanding,\" Wood said. \"I was fortunate enough to come in and get us two-and-a-third, then Cahill came in and did outstanding and Ronnie closed the door. You can't ask for much more.\"\nCahill signed a minor-league contract with the Cubs in August and joined the expanded roster in September. He allowed just 4 runs in 17 innings heading into the playoffs.\n\"I have a history with (catcher Miguel) Montero, and he's done a good job of transitioning me back in the bullpen and getting me ready for every role,\" Cahill said. \"My changeup, I haven't really thrown it much this year.\n\"Coming over here, he knew that was the pitch that would take me to the next level. At first we just started throwing it, keep throwing it. The more you throw it, the more confidence you feel in it.\"\nWith workhorses Jake Arrieta starting the wild-card game Wednesday and Jon Lester pitching Game 1 of the NLDS, the Cubs' bullpen barely came into play.\nMaddon knew he'd need help from his relievers at some point.\n\"The bullpen normally decides a lot of this at this time of the year,\" Maddon said. \"We've been very blessed with Jake's performance, and Jon's performance was outstanding (Friday). We did not really have to test our bullpen, but I anticipate the bullpen's going to play a big role in us winning the series.\"\nGet great articles like this sent to your inbox! Click here to sign up for the Cubs Newsletter No Thanks Sports Chicago MLB Cubs Baseball Members Get More Pro Men", "external_links": ["http://brightcove.vo.llnwd.net/v1/unsecured/media/1659832549/201510/3618/1659832549_4549306496001_4549205064001-vs.jpg?pubId=1659832549&ExactW=280&ExactH=156&ExactFit=crop&Q=100&noborder", "https://twitter.com/share"], "published": "2015-10-11T07:56:00.000+03:00", "crawled": "2015-10-11T20:59:58.365+03:00", "highlightTitle": ""}