{"organizations": [], "uuid": "c463b8f847fb3b005c44222c7beb9b022c7896a2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.vaildaily.com", "main_image": "http://www.vaildaily.com/csp/mediapool/sites/dt.common.streams.StreamServer.cls?STREAMOID=RDO8ucnJbAad4Z8tFFoVjs$daE2N3K4ZzOUsqbU5sYvS4mpXup1d0rr2Tscy4cMaWCsjLu883Ygn4B49Lvm9bPe2QeMKQdVeZmXF$9l$4uCZ8QDXhaHEp3rvzXRJFdy0KqPHLoMevcTLo3h8xh70Y6N_U_CryOsw6FTOdKL_jpQ-&CONTENTTYPE=image/jpeg", "site_section": "http://www.vaildaily.com/csp/mediapool/sites/SwiftShared/assets/csp/rssCategoryFeed.csp?pub=VailDaily&sectionId=1005&sectionLabel=Sports", "section_title": "The VailDaily Section RSS Feed: Sports", "url": "http://www.vaildaily.com/news/sports/18673390-113/huskies-down-demons-clinch-slope-title", "country": "US", "title": "Huskies down Demons; clinch Slope title", "performance_score": 0, "site": "vaildaily.com", "participants_count": 1, "title_full": "Huskies down Demons; clinch Slope title", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T03:38:00.000+03:00", "replies_count": 0, "uuid": "c463b8f847fb3b005c44222c7beb9b022c7896a2"}, "author": "Chris Freud", "url": "http://www.vaildaily.com/news/sports/18673390-113/huskies-down-demons-clinch-slope-title", "ord_in_thread": 0, "title": "Huskies down Demons; clinch Slope title", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related Media EDWARDS — That was not exactly an exuberant clinch, and that’s OK. Battle Mountain soccer knocked of Glenwood Springs, 4-2, on Saturday to wrap the 4A Slope title. But there was no Gatorade dumping or dog-piling. “The celebration was low key,” Huskies coach David Cope said. “We picked up the bags and went inside. That’s good sign of a team that’s not content.” Higher math For the stat geeks, even if the Huskies dropped their finale against Steamboat Springs on Thursday and both teams finished at 10-2, the tiebreakers would come down to goals allowed in league play. The Huskies have nine; the Sailors 20. In the unlikely event that Steamboat were to rout Battle Mountain — and this series has been nip-and-tuck throughout the years — the Sailors could only win by a maximum score of 10-0 because of the mercy rule. So order the sweatshirts for the Huskies’ ninth Slope title in 12 years, “To win the league this year was a real accomplishment,” Cope said. “Glenwood would be top-three team in most leagues, but there are three really good teams in this league — Eagle Valley, Steamboat and Battle Mountain. Look at our teams’ record out of conference. Steamboat’s beaten Palmer Ridge. (In our region), Montrose has beaten Pine Creek, a good 5A team. Eagle Valley, as we saw, is a really good team.” And of course, the Huskies have nonconference wins against both Evergreen and Montrose. More importantly, Battle Mountain wrapped a state-playoff berth with the league crown. Nine in a row But do remember that in September, things were not looking to good for Battle Mountain five games into the season. Having lost to Eagle Valley in Gypsum and then taken to task by The Classical Academy, the Huskies were an uncertain bunch at 3-2. “For this group it took a while to settle into their roles and we had some adversity,” Cope said. “Credit to the boys, they kept working and improving. They realized there was competition for roles and when you can have competition within the group and still stay friendly, that’s a real positive.” The Huskies have run off nine in a row since TCA, so the coach has a point. As is usual, Glenwood did not go down easily. The Demons led 1-0. Miles Joersz to Erik Solis was the equalizer. On a corner kick, defender Chase Keep — good weekend for him — moved up for the set piece. He laid it back to Uriel Lopez, who pulverized it. Lopez struck again, this time to Solis in the second half. Donnie Leavitt from Brandon Rodriguez made it 4-1. Although the league title is settled, it is always a big deal when Steamboat comes to town. Thursday is also Senior Night. With 12 seniors, Cope is going to have a very hard time starting his soon-to-be graduates in 11 spots, but he’ll figure something out. In other news, Creek Kamby, who went down during the Eagle Valley game on Thursday, appears to be on the mend. Were the playoffs to start next week, Cope said, Kamby would probably be able to go, but the coach said he will probably hold the junior out on Thursday as a precaution. VOLLEYBALL Volleyball survives marathon EDWARDS — Battle Mountain volleyball gave its fans their money’s worth this weekend. The Huskies picked up two big wins against Delta, 24-26, 25-17, 11-25, 25-17, 15-10, on Friday, and Palisade, 25-20, 15-25, 25-21, 22-25, 16-14, on Saturday. “The kids got the weekend off from school, so they decided to play a little extra volleyball,” Huskies coach Jason Fitzgerald joked. Delta was the No. 9-ranked team in the state until the Huskies beat the Panthers. But then, Delta did something very nice. The Panthers beat Steamboat Springs on Saturday. Thus, Steamboat, Battle Mountain and Eagle Valley are all tied up atop the Slope. The Huskies are at Summit County on Tuesday. The Sailors visit Gypsum on Thursday, and then it’s Huskies at Devils on Saturday. As for Battle Mountain surviving the weekend, the Huskies showed grit. “We had a little talk about having our heels on the edge of the cliff, no retreat,” Fitzgerald said. “That’s what we did today. Sports Editor Chris Freud can be reached at 970-748-2934, cfreud@vaildaily.com and @cfreud.", "external_links": [], "published": "2015-10-18T03:38:00.000+03:00", "crawled": "2015-10-18T07:51:16.611+03:00", "highlightTitle": ""}