{"organizations": [], "uuid": "62f173ad4e1d03994c71bd9506d18492282dbe13", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kcentv.com", "main_image": "http://KCEN.images.worldnow.com/images/8936311_G.jpg", "site_section": "http://www.kcentv.com/Global/category.asp?C=170051&clienttype=rss", "section_title": "KCEN-TV - Sports", "url": "http://www.kcentv.com/story/30176792/gridiron-player-of-the-week-week-5-cj-mcleain", "country": "US", "title": "Gridiron Player of the Week - Week 5 - C.J. McLeain", "performance_score": 0, "site": "kcentv.com", "participants_count": 1, "title_full": "Gridiron Player of the Week - Week 5 - C.J. McLeain", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T07:57:00.000+03:00", "replies_count": 0, "uuid": "62f173ad4e1d03994c71bd9506d18492282dbe13"}, "author": "Nick Canizales", "url": "http://www.kcentv.com/story/30176792/gridiron-player-of-the-week-week-5-cj-mcleain", "ord_in_thread": 0, "title": "Gridiron Player of the Week - Week 5 - C.J. McLeain", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ncanizales@kcentv.com \nMcGregor, TX - Standing at 5'9, 200 pounds, McGregor's CJ McLeain isn't your standard starting quarterback. \n\"First whenever you think about him, you could think about him as like a linebacker type, or maybe even a lineman from a distance....he's short kind of stocky, he's hard to bring down. But once you see him throw...you know that's where he belongs, once you see him move around the pocket, you know the quarterback position is where he belongs,\" McGregor junior wide receiver/safety James Lane said. \nLast Friday night was only McLeain's fifth game as QB1 for the McGregor Bulldogs, and even though they lost to Grandview 69-41, McLeain played the best game of his young career. \n\"His performance on Friday night...just showed how much he's improved as a passer...to throw for 353 yards and five touchdowns... In a losing effort but always keeping his team going, always keeping them focused... Always keeping them on task...he never lost focus of the game,\" McGregor Head Football Coach Tim Seward said. \n\"I'm still kind of down because we didn't win and I wanted to win real bad but I'm happy that my stats are good. I just try to keep everybody's heads up, I can't put my head down because everyone will follow me, so I just try to make the best out of everything\" McGregor junior quarterback C.J. McLeain said. \nWhat makes McLeian's performance even more impressive is that he was playing on a hurt ankle. \n\"He injured that ankle in the first scrimmage of the year...it's a high ankle sprain and every game he re injures it...but he just fights through it and its that toughness and mentality that he understands that the team needs him there,\" Seward said. \n\"I'm just trying to get the team to where we need to be at and stuff like that and trying to make myself healthy and stuff,\" McLeain said \nJames Lane caught three of McLeain's five touchdown passes and he knows that this is just the beginning of a promising career for his QB. \n\"Me getting the three touchdowns and most of the yards, that's really all him...I'm just the one catching the ball, he's the one putting it there...scrambling out of the pocket, avoiding the defense...after I saw his stats I was just like wow...i don't know what else to say, he's just really good. And as he's getting healthier he's really bringing out his full potential...and I love it and I know there's going to be big things for him in his future,\" Lane said. Sports - Latest News More>>", "external_links": [], "published": "2015-10-03T07:57:00.000+03:00", "crawled": "2015-10-03T08:07:55.817+03:00", "highlightTitle": ""}