{"organizations": [], "uuid": "c0acc89e8b94325b0d155f67a99810c4a0f5a800", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seacoastonline.com", "main_image": "http://www.seacoastonline.com/storyimage/SO/20151022/SPORTS/151029696/AR/0/AR-151029696.jpg", "site_section": "http://www.seacoastonline.com/sports/highschool?template=rss&mime=xml", "section_title": "High School Sports - seacoastonline.com", "url": "http://www.seacoastonline.com/article/20151022/SPORTS/151029696/101032/SPORTS?rssfeed=true", "country": "US", "title": "HS football: Exeter seeks home cooking in playoffs", "performance_score": 0, "site": "seacoastonline.com", "participants_count": 1, "title_full": "HS football: Exeter seeks home cooking in playoffs", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T20:45:00.000+03:00", "replies_count": 0, "uuid": "c0acc89e8b94325b0d155f67a99810c4a0f5a800"}, "author": "Ryan O'Leary roleary@seacoastonline.com", "url": "http://www.seacoastonline.com/article/20151022/SPORTS/151029696/101032/SPORTS?rssfeed=true", "ord_in_thread": 0, "title": "HS football: Exeter seeks home cooking in playoffs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted Oct. 22, 2015 at 12:44 PM Updated at 12:45 PM » Social News EXETER — Playoff scenarios, possible ramifications, they’re not talked about on the practice field at Exeter High School. But the Blue Hawks know all about Merrimack’s situation tonight. The Tomahawks, one of the state’s more surprising football teams this fall, need a win to keep their season alive. Even with their own playoff positioning secured, the Blue Hawks find themselves right in the thick of a captivating, five-team race for the three remaining playoff spots in the Division I East and South. “We know it’s a huge one for them and we’re going over there on Friday night,” Exeter coach Bill Ball said from his office on Wednesday. “So it will be a huge challenge for us.” The formula is simple for Merrimack, which fell to 4-3 with last week’s costly, 37-26 loss at Salem. It needs a win for any hope to fend off Winnacunnet (4-3), which owns a head-to-head tiebreaker, and keep pace with Timberlane, Salem and Pinkerton — the three teams tied at the top of the South Conference with matching 5-2 records. Of those five teams, only Merrimack faces a team with a winning record this week, the Blue Hawks entering undefeated at 7-0. Exeter is a win away from clinching home-field advantage through the semifinals of the Division I tournament. But it hasn’t been — and won’t be — easy. Two of Exeter’s wins came on go-ahead scores in the final 10 seconds, one a 25-yard field goal by Evan Royer against Winnacunnet; the other a 1-yard, fourth-down, second-effort keeper by quarterback Kyle Ball at Salem. Four of Exeter’s wins have been decided by a combined 18 points (the other three a more comfortable 81 points against inferior competition), and this will be the team’s fifth road game in eight weeks. Where the Tomahawks fall tonight is anyone’s guess. Merrimack was a general unknown entering the season under first-year coach Kip Jackson, a former assistant under Scott Knight at Nashua South. He brought an aggressive spread offense to Merrimack that’s producing points — like the 32 the Tomahawks scored in a near-upset of Pinkerton Academy, or the 41 they scored the next week in a rout of Londonderry. “They’ve seen the tape,” Bill Ball said of his players. “So they know this team is extremely explosive offensively.” Scouting Merrimack It starts with junior quarterback Justin Grassini, a second-year starter who will be one of the best passers the Hawks have faced this season. He passed for 249 yards and four touchdowns in last week’s showdown with Salem, but it wasn’t enough. Joe Eichman is a dangerous, multi-threat receiver, announcing his arrival back in Week 1 when he caught 11 passes for 173 yards and ran for a touchdown in Merrimack’s 35-21 win over Portsmouth. “A lot of talk in the summer about their skill and how well they throw-catch,” Bill Ball said. “And I’ve been impressed with their physical play. I thought they’d be very physical. The inside tackles on defense are tough. They run to the ball well. (Kip Jackson’s) done a good job.” The Tomahawks don’t rely heavily on the run, but back Tyler DeNeill is a threat when they do, both as a ball carrier and as a receiver on bubble and jailbreak screens. Merrimack will throw a no-huddle offense at the Blue Hawks and likely try everything from vertical passing to power hand-offs. There’s no room to hold anything back in this game. “It’s their home game,” Ball said. “It’s a big game with ramifications for them and obviously for everybody. You know you’re going to get their best shot, and hopefully they’re going to get our best shot. That’s what it’s all about.” Exeter’s corner It’s another big test for Exeter’s secondary, which has fared well over the last two weeks against spread teams in Portsmouth and Dover. Pass defense has been among the top priorities for the team this week. “We talked about that today,” Ball said. “It’s about communication and believing what you see, and then make the play. The first thing it comes down to is talking to each other and the second part is believe your eyes.” Offensively, Exeter’s linemen and run game has been efficient. Quarterback Kyle Ball leads the ground attack with 415 yards this season. Jackson Allen (68-352), Cam Flanagan (78-355) and Mason Wallace (45-307) have been the leading backs along with Sam Kalish, who missed time early in the season with an illness. Wallace rushed for a 64-yard touchdown last week against Dover and is now averaging over 6.8 yards per carry. The Blue Hawks have featured some balance offensively. Tight end Hunger Long now has 17 receptions for 266 yards and four touchdowns — all from QB Kyle Ball — on the season. His quarterback is now 25 for 49 (51 percent) for 440 yards and six touchdowns, also connecting with Wallace twice for scores. When the Hawks haven't hesitated to turn to their passing game when needed. Prediction Back in Week 2, Merrimack struggled against Winnacunnet’s power game, surrendering 374 yards on the ground, about 200 of that to bruising runner Mike Lewis. The Tomahawks do have an an explosive offense, but they’ll have to show massive improvements defensively to keep Exeter from controlling the game. Slow starts were hurting Exeter earlier in the season. In past weeks, the Hawks have struck fast, played from ahead and unloaded the reserves by the third quarter. It’s another tough road game for Exeter, which has been toughness personified during this 7-0 start. This could be the final bus ride the Blue Hawks take in a while. Exeter 38, Merrimack 21 Ryan O'Leary is a sports editor for Seacoast Media Group. He can be reached at roleary@seacoastonline.com. Follow Ryan on Twitter @RyanOLearySMG. By Ryan O'Leary", "external_links": [], "published": "2015-10-22T20:45:00.000+03:00", "crawled": "2015-10-22T21:08:28.112+03:00", "highlightTitle": ""}