{"organizations": [], "uuid": "2b17c883bd660857d848ad3e98377b307effd840", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.miamiherald.com", "main_image": "http://www.miamiherald.com/news/local/community/miami-dade/w4bnge/picture39411321/ALTERNATES/LANDSCAPE_1140/homeless", "site_section": "http://www.miamiherald.com/?widgetName=rssfeed&widgetContentId=712015&getXmlFeed=true", "section_title": "Breaking News, Sports, Weather & More | MiamiHerald.com &", "url": "http://www.miamiherald.com/news/local/community/miami-dade/article39411324.html", "country": "US", "title": "Miami cops, volunteers come together to help homeless", "performance_score": 0, "site": "miamiherald.com", "participants_count": 1, "title_full": "Miami cops, volunteers come together to help homeless", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T20:44:00.000+03:00", "replies_count": 0, "uuid": "2b17c883bd660857d848ad3e98377b307effd840"}, "author": "JORGE CORRALES \njcorrales@miamiherald.com", "url": "http://www.miamiherald.com/news/local/community/miami-dade/article39411324.html", "ord_in_thread": 0, "title": "Miami cops, volunteers come together to help homeless", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Miami cops, volunteers come together to help homeless \nCity of Miami Homeless Citizen's Stand Down provides services at Lummus Park \nFood, shelter and medical among services \nVeterans do their part to help ‘I’ve been homeless before and I wanted to give something back,’ says barber Lynnward McClyde. Jorge Corrales jcorrales@miamiherald.com i \nIt looked like a typical Miami street festival at a park filled with tents, community leaders and cops. \nBut this event had a greater purpose: offering Miami’s homeless some basic necessities. \nFor 12 hours on Friday, volunteers, outreach organizations and police officers worked together at the event, called Miami’s Homeless Citizen's Stand Down. The mission: to supply food, clothes, medical care and other services to those who made their way to Lummus Park. \n“We want to bring everyone together with their resources to help as many people in need as possible,” said Officer James Bernat, senior executive assistant to the chief of police and the homeless coordinator for the Miami Police Department. “We decided on Lummus Park because our homeless population is concentrated in downtown and this a central location close to Overtown, Allapattah and Little Havana, which makes it convenient for everyone to come out to the park.” \nHundreds did. \nOne of those at the park, 404 NW Third St., in search of help was 71-year-old Sydney Brown. \n“My friend over at Government Center said they were out here doing things to help the homeless people,” Brown said Friday morning. “I made my way out here to sign up for housing cause I’m on the streets.” \nSome didn’t ask for much. \n“I’m just trying to get my hair cut,” said Alison Elmore. \nThe man giving those haircuts was Lynnward McClyde. He was brought off the streets by police last year and given shelter. While homeless, he graduated from barber school and got his license to cut hair. \n“I’ve been homeless before and I wanted to give something back,” McClyde said. “Hopefully I’ll be able to give somebody some hope that there is a way out. This program may not reach everyone, but those that it does reach will hopefully be able to come out and do the same thing that I’m doing.” \nThe 7 a.m.-to-7 p.m. event builds upon the annual Stand Down for homeless veterans every April. With more than 100 volunteers at the park, and hundreds of homeless expected through the day, organizers on Friday predict this version of the Stand Down to become an annual event as well. \nJanette Chandler, a 20-year Navy veteran, now volunteers for the city and helped organize the veteran Stand Down as well as Friday’s event. \n“Some of the people are so appreciative,” Chandler said. “They get a change of clothes, they get something to eat. It’s enormous to me. I love being able to connect with them.” Related content", "external_links": [], "published": "2015-10-16T20:44:00.000+03:00", "crawled": "2015-10-16T21:08:42.521+03:00", "highlightTitle": ""}