{"organizations": [], "uuid": "25359ab1d554ed9f2cb1e8adc584df4179deead3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sfgate.com", "main_image": "http://www.sfgate.com/img/pages/article/opengraph_default.png", "site_section": "http://www.sfgate.com/rss/feed/Top-Sports-Stories-RSS-Feed-487.php", "section_title": "Top Sports Stories RSS Feed", "url": "http://www.sfgate.com/collegesports/article/Cal-beat-Sonny-Dykes-sees-progress-from-RB-6585898.php", "country": "US", "title": "Cal beat: Sonny Dykes sees progress from RB Daniel Lasco", "performance_score": 0, "site": "sfgate.com", "participants_count": 1, "title_full": "Cal beat: Sonny Dykes sees progress from RB Daniel Lasco", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T10:55:00.000+03:00", "replies_count": 0, "uuid": "25359ab1d554ed9f2cb1e8adc584df4179deead3"}, "author": "Connor Letourneau", "url": "http://www.sfgate.com/collegesports/article/Cal-beat-Sonny-Dykes-sees-progress-from-RB-6585898.php", "ord_in_thread": 0, "title": "Cal beat: Sonny Dykes sees progress from RB Daniel Lasco", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published 12:56 am, Friday, October 23, 2015 \nPASADENA — To complement its offense with a potent run game, Cal needs a healthy Daniel Lasco . \nThe running back’s stat line from the Bears’ 40-24 loss at UCLA — nine yards on three carries — hardly marked a monumental breakthrough. Still, head coach Sonny Dykes noticed progress. \n“We’ll look at the film, but I thought it looked like he was moving around better,” Dykes said. “We were anxious to get him back full speed and get him going.” \nIt is the latest development in what has been a trying season for Lasco. In the four games after he strained a muscle in his hip Sept. 12 against San Diego State, the senior totaled 11 carries in two appearances. \nLasco delivered his best practice since the injury Sunday. But given that he looked out of sorts against Washington State and Utah, coaches were intent on easing Lasco back into the rotation at the Rose Bowl. He received a carry in the second, third and fourth quarters, and he took each three yards. \nKeeping Goff in: By the time Devin Fuller’s 21-yard touchdown catch put UCLA up 31-10 early in the third quarter, Cal had likely missed its shot at victory. \nSo why did the Bears leave quarterback Jared Goff in the rest of the game? Had the elite NFL prospect suffered an injury in garbage time, Dykes’ decision making surely would’ve been the topic of sports talk radio rants. \n“We just were trying to play,” Dykes said. “We’ve got to get better. We tell our players all the time, ‘Look, we’re going to play our game for 60 minutes, regardless of the scoreboard.’ If you’re going to tell your players that, you better follow through from a coaching standpoint.” \nFake punt: With Cal down 20-3 in the second quarter, Dykes called converted rugby player Harry Adolphus in for a fake punt on fourth and 10. The junior was stopped well short of the first down, setting up an eventual UCLA field goal. \n“Bad call on my part,” Dykes said. “We had three to block one, and we didn’t get it done. Again, bad call. It didn’t work.” \nInjury update: Linebacker Michael Barton sprained a knee, and safety Stefan McClure left the game with a shoulder injury. Dykes wasn’t sure about the severity of the injuries.", "external_links": [], "published": "2015-10-23T10:55:00.000+03:00", "crawled": "2015-10-23T11:53:25.638+03:00", "highlightTitle": ""}