{"organizations": [], "uuid": "10ac64c4482f2fb87d39701b60ec2949b2bbc7e2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3337804/images/o-DEFAULT-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/sports/index.xml", "section_title": "Sports - The Huffington Post", "url": "http://www.huffingtonpost.com/jonathan-weiler/cardinal-sins_b_8342276.html", "country": "US", "title": "Cardinal Sins", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Cardinal Sins", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T02:02:00.000+03:00", "replies_count": 0, "uuid": "10ac64c4482f2fb87d39701b60ec2949b2bbc7e2"}, "author": "Jonathan Weiler", "url": "http://www.huffingtonpost.com/jonathan-weiler/cardinal-sins_b_8342276.html", "ord_in_thread": 0, "title": "Cardinal Sins", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \n(My new book, Divorce: A Love Story , a joint memoir written with my former wife, is now available. Did I mention it's only $2.99 and that you can't afford *not* to buy it?!) \nLet's clear away some underbrush right upfront. The unfolding scandal at Louisville where, it is alleged, basketball recruits were plied with strippers and sex by a former graduate assistant to the legendary head basketball coach, Rick Pitino, is titillating. Sex sells and all that. \nBut let's try to avoid both silly prudery and dismissive hand-waving -- \"duh, this happens everywhere.\" I am confident that this is neither the only school where something like this has happened and also doubtful that it happens \"everywhere.\" Young, highly regarded male athletes live in a world of sexual opportunity. There's no need to blush at that, or to fan ourselves in shock when we get a glimpse into the reality of that world. Neither do we need to let off the hook the extraordinarily highly-paid and deified men who sit atop these little kingdoms -- the head basketball coaches -- when something like this does happen. Words like \"accountability,\" \"molders of men,\" \"greatness\" and \"integrity\" are attached to these legendary coaches all the time. They run programs that are lucrative, deeply important to their institutions and, when it comes to basketball in particular, intimate. A head basketball coach will have in the neighborhood of a half a dozen assistants, in addition to academic support staff. All of that to preside over a program that, at any one time, has no more than about fifteen young men in its charge. When these legends enter the homes of recruits, they promise the moon -- first rate facilities, top-notch academics, a real shot at the NBA and, most important for many parents, a father figure to look after their baby when he leaves home. \nAll of which makes it hard to take seriously pleas of ignorance when systematic rules violations are revealed. And if Pitino didn't know, given his general power, influence and wherewithal, that doesn't speak very well for him as a leader, a tone-setter, example or a molder of men, does it? \nTo be clear, I'm not interested in litigating here the particular nature of the alleged transgressions. I don't need to, because whatever else they are, they're an obvious violation of NCAA rules. And the coach would never cop to finding the behavior in question acceptable. \nIn sum, I find tiresome the endless talk about \"accountability,\" overwhelmingly directed at the putative \"entitled\" modern athlete, when big time athletic programs are finding ever more creative ways to entice players to come to their campuses, while trying to maintain the patent absurdity that is \"amateurism.\" The NCAA and its member schools insist they can't pay players, lest that compromise the moral purity that college athletic programs and their hosting institutions purport to embody. The defenders of the current model also regularly argue that the players aren't old enough or mature enough or sufficiently socialized to be treated like the kinds of adults who can actually handle getting paid. So, if the leaders of this enterprise are such exemplars of rectitude as well as the only adults in the room, who else should pay the price when the programs they command run afoul of their own claimed principles? \nIt would be nice if we stopped deifying these legends of the sidelines. They're paid a *lot* of money to win games. The other stuff is good for myth-making but not, on the whole, for better understanding the reality of the world in which they operate. \nFollow Jonathan Weiler on Twitter: www.twitter.com/jonweiler More:", "external_links": [], "published": "2015-10-21T02:02:00.000+03:00", "crawled": "2015-10-21T02:42:47.123+03:00", "highlightTitle": ""}