{"organizations": ["FIFA"], "uuid": "2434ca47df022771de6b4957f8d907431959dea7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribtown.com", "main_image": "http://cdn1.tribtown.com/st_assets/images/the_tribune_sq.jpg", "site_section": "http://www.tribtown.com//feed/sec/6000", "section_title": "TribTown.com - Sports News", "url": "http://www.tribtown.com/view/story/da600cb3b74e4ded8fa738c72087dd3d/SOC--FIFA-Thailand", "country": "US", "title": "Challenge expected over FIFA's imposition of new committee at Thailand's FA", "performance_score": 0, "site": "tribtown.com", "participants_count": 0, "title_full": "Challenge expected over FIFA's imposition of new committee at Thailand's FA", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T09:43:00.000+03:00", "replies_count": 0, "uuid": "2434ca47df022771de6b4957f8d907431959dea7"}, "author": "", "url": "http://www.tribtown.com/view/story/da600cb3b74e4ded8fa738c72087dd3d/SOC--FIFA-Thailand", "ord_in_thread": 0, "title": "Challenge expected over FIFA's imposition of new committee at Thailand's FA", "locations": ["Thailand"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Challenge expected over FIFA's imposition of new committee at Thailand's FA THE ASSOCIATED PRESS   2:43   2:43   \nSubjects: \nSoutheast Asia (264) \nBANGKOK — The Football Association of Thailand and its besieged president Worawi Makudi are expected to challenge the scope of powers of a \"normalization committee\" that has been imposed on the national body by FIFA. \nFIFA acted on Friday to address the administrative and legal chaos gripping the FAT by removing the executive committee, and appointing the \"normalization committee\" to review the FAT's electoral code and hold elections by Feb. 15. \nIt was a further major setback for Worawi, who has been the key powerbroker in Thai football since taking the FAT presidency in 2007 and a long-serving former member of FIFA's executive committee. \nHe had been due to contest FAT elections this weekend but they were postponed after FIFA handed Worawi a 90-day suspension from football activities for unspecified breaches of the ethics code. He is facing investigation on those charges. \nWorawi is also appealing against a suspended 16-month jail term for forgery offences surrounding the FAT elections in 2013. \nThe normalization committee's task of reviewing the FAT's electoral system could erode Worawi's powerbase within Thai football. The electoral suffrage in FAT elections had been disputed in the past, as the majority of votes lie with clubs in the top tiers of the local league, many of whom are beholden to the political status quo. \nAdmiral Surawut Maharom, who has been appointed as the head of the normalization committee, said he would consider reforms \"in the best interests of the country.\" \n\"I'm the kind of person who will not let anyone interfere in my job,\" Admiral Surawut was quoted to say by Thai media on Saturday. \"Complying with FIFA is something we need to do, otherwise we would not be a part of the world community.\" \nHowever Narinpong Jinapak, lawyer for the FAT, placed doubt upon the scope of the normalization committee. He was quoted to say the new committee's role was \"only to supervise\" the next election and that it should not \"become involved in or interfere in the FAT's administration.\" \n ", "external_links": [], "published": "2015-10-18T09:43:00.000+03:00", "crawled": "2015-10-18T11:34:08.523+03:00", "highlightTitle": ""}