{"organizations": [], "uuid": "ef8509df6d5de2b8b988cccb84638f1c2532ab35", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "http://s4.reutersmedia.net/resources/r/?m=02&d=20151016&t=2&i=1087329777&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXNPEB9F008", "site_section": "http://www.reuters.com/news/sports", "section_title": "Sports News, Highlights &amp; Coverage | Reuters.com", "url": "http://www.reuters.com/article/2015/10/16/us-dailyfantasysports-idUSKCN0SA00A20151016", "country": "US", "title": "Nevada regulator says daily fantasy sports is gambling, requires license", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Nevada regulator says daily fantasy sports is gambling, requires license | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T04:11:00.000+03:00", "replies_count": 0, "uuid": "ef8509df6d5de2b8b988cccb84638f1c2532ab35"}, "author": "Liana B. Baker", "url": "http://www.reuters.com/article/2015/10/16/us-dailyfantasysports-idUSKCN0SA00A20151016", "ord_in_thread": 0, "title": "Nevada regulator says daily fantasy sports is gambling, requires license", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Nevada's Gaming Control Board, the regulatory body that oversees gambling in the state, said on Thursday that it considers daily fantasy sports to be gambling that requires companies offering it to be licensed if they want to operate in Nevada.\nA.G. Burnett, chairman of the gaming regulator, said in a statement on the board's website that daily fantasy sports contests where players wager money fit the definition of gambling. Any companies that offer daily fantasy sports and are operating without a license in Nevada need to cease and desist, Burnett said.\nThe two largest U.S. fantasy sports companies, FanDuel and DraftKings, both operate in Nevada and also hold large-scale events and tournaments in Las Vegas. FanDuel declined to comment while DraftKings could not immediately be reached.\nDaily fantasy sports, which has exploded in popularity in the past few years, allow players to draft teams and win money in games played in as little as one day. This has allowed fans to spend money on the games with a frequency that some critics argue is akin to sports betting or gambling.\nCasino and gaming companies such as MGM Resorts International and sports book companies such as William Hill Plc have been frustrated that fantasy sports companies are able to offer what they considered unregulated gambling.\nThe American Gaming Association, the trade group for casinos and gaming companies, said in a statement Thursday that the Nevada regulator, which will now require licenses for real-money fantasy sports, has provided a road map for companies and casinos to provide fantasy sports in the state.\n\"We will continue to seek additional clarity in other jurisdictions, as eliminating ambiguity is in the best interests of all parties, including consumers,\" the chief executive officer and president of American Gaming Association, Geoff Freeman, said.\nJoe Asher, CEO of sports book company William Hill US, said in a statement that the notice \"speaks for itself\" and should not come as a surprise.\nNevada's Burnett told Reuters in August that daily fantasy sports contest \"blur the line between skill and chance.\"\nDaily fantasy sports companies now operate in at least 45 U.S. states, though some are mulling reviews on whether the activity should be treated as gambling.\nNew York Attorney General Eric Schneiderman has opened an inquiry into FanDuel and DraftKings after a scandal broke recently that employees at the companies were winning money on their rivals' websites.\nSeparately, the U.S. Justice Department and the Federal Bureau of Investigation are looking into the business model of daily fantasy sports operators and trying to determine whether they violate federal laws, according to media reports.\n(Reporting by Liana B. Baker; Editing by Leslie Adler)", "external_links": [], "published": "2015-10-16T04:11:00.000+03:00", "crawled": "2015-10-16T04:06:15.067+03:00", "highlightTitle": ""}