{"organizations": ["FIFA"], "uuid": "2d7477786e32f5169880a90131e469692e92b97c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pendletontimespost.com", "main_image": "", "site_section": "http://pendletontimespost.com//feed/sec/6000/", "section_title": "PendletonTimesPost.com - Sports News", "url": "http://www.pendletontimespost.com/view/story/fec7fda5e3d04b6d9ad263fc0bccd06d/SOC--FIFA-Blatter/", "country": "US", "title": "Overlooking own crisis, Blatter calls for more women leaders", "performance_score": 0, "site": "pendletontimespost.com", "participants_count": 0, "title_full": "Overlooking own crisis, Blatter calls for more women leaders", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T17:58:00.000+03:00", "replies_count": 0, "uuid": "2d7477786e32f5169880a90131e469692e92b97c"}, "author": "", "url": "http://www.pendletontimespost.com/view/story/fec7fda5e3d04b6d9ad263fc0bccd06d/SOC--FIFA-Blatter/", "ord_in_thread": 0, "title": "Overlooking own crisis, Blatter calls for more women leaders", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["ROB HARRIS", "Blatter"], "text": "Overlooking own crisis at FIFA, Blatter calls for more women in leadership roles in soccer By ROB HARRIS AP Sports Writer   10:58 amLast   10:58 am   \nSubjects: \nPhotos: \nFIFA President Sepp Blatter drives his car into the garage of the FIFA headquarters on his way to work in Zurich, Switzerland, Tuesday, Sept. 29, 2015. Blatter was questioned by Swiss investigators on Friday about why FIFA paid 2 million Swiss francs (about $2 million) to UEFA President Michel Platini in 2011 for work supposedly carried out at least nine years earlier. (AP Photo/Michael Probst) \nFIFA-President Sepp Blatter sits in an office of the FIFA headquarters in Zurich, Switzerland, Tuesday, Sept. 29, 2015. Blatter told his staff on Monday he has done \"nothing illegal or improper\" and has no immediate plans to step down. (AP Photo/Michael Probst) \nZURICH — Sepp Blatter called on soccer officials to start hiring more women for leadership jobs, in written comments Friday that did not address his own embattled presidency. \nBlatter told FIFA staff earlier this week he's determined to remain in power until February's emergency presidential election despite being under criminal investigation for financial wrongdoing. \nBlatter had to speak through his external lawyers, rather than using FIFA's communications machine, to issue that statement on Monday. \nBut it was business as usual for the 79-year-old president on Friday as he retained his column in the in-house magazine where he discussed a program for women hosted by FIFA in Zurich this week. \n\"Football continues to be dominated by men,\" Blatter wrote in FIFA Weekly. \"It is our duty to change this. Women must feel that they have an equal chance of succeeding in football as their male counterparts. \n\"FIFA, the confederations and our member associations have to break the cycle that makes it so much easier for men to ascend to positions of responsibility. This is not just a moral duty.\" \nBlatter said there is \"compelling evidence that gender-balanced organizations make better decisions and produce better results.\" There are currently no female contenders in the race to succeed Blatter in the Feb. 26 election. \n\"Football needs more women in leadership,\" Blatter wrote. \"Those that govern the game must show now that we are all serious about answering that call.\" \nBlatter's own position has been weakened as lawyers oversee key decisions at scandal-battered FIFA and he waits to hear whether he will be suspended by the ethics committee. \nAll content copyright ©2015 Pendleton Times-Post, a division of Home News Enterprises unless otherwise noted.", "external_links": [], "published": "2015-10-02T17:58:00.000+03:00", "crawled": "2015-10-02T19:53:09.908+03:00", "highlightTitle": ""}