{"organizations": [], "uuid": "caa41f717482ab254f7d718140e7d8ff382cb6c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "http://images.tribuneindia.com/cms/gall_content/2015/10/2015_10$largeimg19_Monday_2015_131240519.JPG", "site_section": "http://www.tribuneindia.com/", "section_title": "The Tribune, Chandigarh, India : Latest news, India, Punjab, Chandigarh, Haryana, Himachal, Uttarakhand, J&amp;K, sports, cricket ", "url": "http://www.tribuneindia.com/news/business/china-s-gdp-falls-to-6-9-pc-in-q3-weakest-since-2009/147929.html", "country": "US", "title": "China's GDP falls to 6.9 pc in Q3, weakest since 2009", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "China's GDP falls to 6.9 pc in Q3, weakest since 2009", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "caa41f717482ab254f7d718140e7d8ff382cb6c9"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/business/china-s-gdp-falls-to-6-9-pc-in-q3-weakest-since-2009/147929.html", "ord_in_thread": 0, "title": "China's GDP falls to 6.9 pc in Q3, weakest since 2009", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Beijing, October 19\nChina's GDP decelerated to 6.9 per cent in the third quarter of this year, posting its worst growth since the 2009 global financial crisis which could prompt the Communist giant to roll out a new stimulus package to arrest the slowdown of the world's second largest economy.\nChina's economy slid below the targeted seven per cent in the third quarter this year, the weakest since the global financial crisis in 2009 amid continued fall of exports mounting pressure on the country's economy.\nThe economy posted a 6.9-per cent growth year on year in the third quarter of 2015, lower than 7 per cent in the first half of the year, China's National Bureau of Statistics (NBS) announced today.\nThe government has set seven per cent as the GDP target for this year.\nIn the first three quarters of the year, GDP hit 48.78 trillion yuan (USD 7.68 trillion) up 6.9 per cent year on year, according to the NBS.\nThis is the first time the quarterly growth rate had dropped under 7 per cent since the second quarter of 2009.\nNBS spokesperson Sheng Laiyun said global factors amid the world economic recovery had impacted China.\n\"Expectation of a US interest rate hike prompted volatility in commodity prices, stocks and foreign currency markets. Many countries devaluated their currencies, putting more pressure on Chinese exports, one of the three pillars of China's economic growth,\" Sheng told a media briefing.\nChina's exports growth dropped 7.9 per cent year on year in the first three quarters to 17.87 trillion yuan, according to the NBS.\nDuring the first nine months, industrial output grew 6.2 per cent year on year and fixed-asset investment climbed 10.3 per cent. Property investment grew 2.6 per cent year on year, while retail sales of consumer goods rose 10.5 per cent.\nAs the exports continued to fall, Chinese economy is undergoing transition from an export dependent economy to the one based more on domestic consumption which is causing a painful transformation.\nObservers say while the 6.9 per cent GDP was regarded as slightly above expectations, the continued slowdown was expected to put pressure on the government data and is expected to raise pressure on policymakers to step up monetary policy to halt the slowdown. —PTI", "external_links": [], "published": "2015-10-19T03:00:00.000+03:00", "crawled": "2015-10-19T12:17:28.668+03:00", "highlightTitle": ""}