{"organizations": [], "uuid": "4f6e69562fba77d8a3e7f7b51762c5ec20bf248b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sfgate.com", "main_image": "http://www.sfgate.com/img/pages/article/opengraph_default.png", "site_section": "http://sfgate.com//rss/feed/Top-Sports-Stories-RSS-Feed-487.php", "section_title": "Top Sports Stories RSS Feed", "url": "http://www.sfgate.com/sports/article/Tristan-Thompson-rejects-Cavs-offer-6546795.php", "country": "US", "title": "Tristan Thompson rejects Cavs’ offer", "performance_score": 0, "site": "sfgate.com", "participants_count": 1, "title_full": "Tristan Thompson rejects Cavs’ offer - SFGate", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T20:14:00.000+03:00", "replies_count": 0, "uuid": "4f6e69562fba77d8a3e7f7b51762c5ec20bf248b"}, "author": "sfgate.com", "url": "http://www.sfgate.com/sports/article/Tristan-Thompson-rejects-Cavs-offer-6546795.php", "ord_in_thread": 0, "title": "Tristan Thompson rejects Cavs’ offer", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tristan Thompson has taken his contract standoff with the Cavaliers to another level.\nThe backup power forward declined to sign a one-year, $6.8 million qualifying offer for this season and didn’t report to training camp Friday.\nDespite optimism from the Cavs and LeBron James , who has the same agent, that a deal could be reached, Thompson remains at odds with the team over a long-term deal.\nAn elite rebounder who knows his role, Thompson was a key contributor during Cleveland’s run to the NBA Finals last season, filling in when starter Kevin Love dislocated his shoulder.\n•The Milwaukee Bucks signed John Henson to a four-year, $44 million deal that could reach $48 million if certain incentives are reached. Henson, a 6-foot-11 power forward/center with the ability to guard multiple positions, averaged 7.0 points, 4.7 rebounds and 2.0 blocks in 18 minutes per game last season, his third in the NBA. He shot 56 percent from the field and saw his playing time increase in the playoffs.\nELSEWHERE\nLouisville investigates escort allegations\nThe University of Louisville said it has launched an investigation into allegations that former Cardinals staffer Andre McGee paid an escort service to provide sex for basketball recruits.\nThe allegations by Katina Powell are in an upcoming book, “Breaking Cardinal Rules: Basketball and the Escort Queen,” from a publishing arm of the Indianapolis Business Journal . The book says that McGee hired Powell to provide strippers and prostitutes for recruits and some of their fathers during a four-year period.\nLouisville said it learned of the allegations in August and immediately notified the NCAA . McGee left Louisville in 2014 to become an assistant at Missouri-Kansas City. That school put McGee on paid leave Friday night.\nGolf: Jordan Spieth was voted PGA Tour player of the year, giving him a sweep of all the significant awards. Spieth had five wins this year, including the Masters and U.S. Open. At 22, he is the youngest player since Tiger Woods (21) to win the Jack Nicklaus Award as player of the year. Spieth also won the Arnold Palmer Award by topping the money list with a record $12 million, and the Vardon Trophy for having the lowest adjusted scoring average.\n• Jimmy Mullen and Anthony Wall shared a one-stroke lead after the second round of the Alfred Dunhill Links Championship at St. Andrews, Scotland.\nNHL: The Stanley Cup champion Chicago Blackhawks reportedly have placed high-priced forward Bryan Bickell on waivers, thus freeing up $4 million that Bickell’s contract represents against their salary cap.\n•The Red Wings will start the season without a key defenseman. Detroit said Danny DeKeyser will be out three to four weeks with a sprained ligament in his left foot.\nMotor sports: Matt Kenseth has the pole for the NASCAR Sprint Cup race Sunday in Dover, Del., after rain wiped out qualifying. With the field set on points, Kenseth starts first and is followed by Joe Gibbs Racing teammates Denny Hamlin and Carl Edwards .\nSoccer: Sepp Blatter defied calls from FIFA sponsors Budweiser , Coca-Cola, McDonald’s and Visa to quit immediately as president of world soccer’s governing body rather than clinging on until the emergency election in February. The interventions from the long-standing sponsors come a week after the 79-year-old Blatter was placed under criminal investigation by Swiss authorities for alleged financial wrongdoing at FIFA.", "external_links": [], "published": "2015-10-02T20:14:00.000+03:00", "crawled": "2015-10-03T03:53:52.343+03:00", "highlightTitle": ""}