{"organizations": ["Paladins", "Chattanooga Rolls", "Chattanooga Mocs", "Toyvian Brand", "Furman", "Mocs", "Southern Conference", "UTC"], "uuid": "3d503a3f9b47c91f490141741791bb72f8c29998", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wdef.com", "main_image": "http://www.wdef.com/media/lib/170/b/6/7/b67a5825-6e86-4ef9-ad23-b2d6e21a48c8/Original.jpg", "site_section": "http://www.wdef.com/rss/3479.rss", "section_title": "WDEF News 12 - Local Sports News", "url": "http://www.wdef.com/content/sports/localsports/story/6th-Ranked-Chattanooga-Rolls-to-31-3-Win-over/3XFbrgCZOU2khQ_tzgaqiw.cspx?rss=3479", "country": "US", "title": "6th-Ranked Chattanooga Rolls to 31-3 Win over Furman?", "performance_score": 0, "site": "wdef.com", "participants_count": 0, "title_full": "6th-Ranked Chattanooga Rolls to 31-3 Win over Furman?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T01:42:00.000+03:00", "replies_count": 0, "uuid": "3d503a3f9b47c91f490141741791bb72f8c29998"}, "author": "", "url": "http://www.wdef.com/content/sports/localsports/story/6th-Ranked-Chattanooga-Rolls-to-31-3-Win-over/3XFbrgCZOU2khQ_tzgaqiw.cspx?rss=3479", "ord_in_thread": 0, "title": "6th-Ranked Chattanooga Rolls to 31-3 Win over Furman?", "locations": ["Tenn.", "Furman", "CHATTANOOGA"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jeff Durden", "Russ Huesman", "Triston Luke", "Nakevion Leslie", "Huesman", "Derrick Craine", "Mack", "Keionta Davis", "Jon Croft Hollingsworth", "A.J. Hampton", "Lucas Webb", "Jacob Huesman", "Jordan Snellings", "Kendall", "Reese Hannon", "Isaiah Mack", "Cory Magwood", "Craine", "Ridge Gibson", "James Stovall", "Furman", "Leslie", "John Mackey", "Justin King", "Hannon"], "text": "Share Updated: 6:44 pm CHATTANOOGA, Tenn.(Gomocs.com)---The sixth-ranked Chattanooga Mocs dominated both lines of scrimmage in a 31-3 win over Furman at Finley Stadium today. The win is the fourth in a row for UTC as it moves to 4-1 overall, 2-0 in the Southern Conference. Furman is now 3-3, 1-1 in the league. There was a 186-yard difference in rushing yards between the two schools that both pride themselves on controlling the game on the ground. That's by design according to junior linebacker Nakevion Leslie. \"You don't pay attention to stats during the game,\" Leslie said. \"That's impressive. It was our focus this week (on both sides of the ball).\" The Mocs rolled up 245 rushing yards, 349 total. The Paladins were limited to 235 total yards with 59 in the ground attack. Just two of those running yards came in the second half. \"For us to play that well on all three phases, I'm really proud of our team,\" coach Russ Huesman. \"Great job. Any time you can beat a Furman football team, you know you've prepared well. You've played well because Furman's going to win a bunch of football games this year.\" Furman scored on the very first possession of the game. The Paladins drove 69 yards inside the 10 before settling for a Jon Croft Hollingsworth 25-yard field goal. The Mocs defense allowed just 166 yards the remainder of the contest. Up 3-0 and driving, Furman QB Reese Hannon looked deep but the pass went off his receiver's hands. According to Huesman, that was a momentum changer. \"They threw the double move down there and if they catch that ball and don't drop it, it could be a different game,\" he shared. \"That's sometimes happens. Sometimes you miss one or drop one, and it changes the complexity of the game.\" The offense took advantage of the mistake. It marched 80 yards in 11 plays for a 7-3 lead on Derrick Craine's four-yard run. That drive needed a key decision from the sidelines on fourth-and-1 at the 50. \"You know I thought going for it on fourth down, that's a 3-0 game about midfield and that's a little nerve wrecking. I made the call, but (offensive coordinator) Jeff Durden said 'Hey listen, we have to get some momentum changed.' I agreed with him and fortunately we got the first down and we actually scored on that drive. \"I'm proud of our football team.\" Craine scored on back-to-back possessions from four yards out to make it a 14-3 advantage. On the very next play, Lucas Webb picked off a Reese Hannon offering and returned it 35 yards for the score and a 21-3 lead. Furman responded with a methodical drive. Hannon directed his unit to the Mocs' 9 yard line. On fourth and one, Isaiah Mack led a defensive push that stopped Ridge Gibson for no gain and a 21-3 halftime lead. The Mocs controlled the second half holding a 19:30-10:30 advantage in time of possession. Craine netted 93 of his 138 yards after the break adding another four-yard run tying his career high with a three touchdown game late in the fourth quarter. The visitors managed one sustained drive in the second half. They marched 72 yards to the Mocs 6. On third and three, Toyvian Brand pressured Hannon into forcing a pass into the end zone. Sema'je Kendall intercepted giving his squad the ball at its own 6. Craine started the ensuing possession with a 19-yard run. He ended the 94-yard march 11 plays later with his third touchdown run. \"I really just have to thank the front five for that,\" Craine said of his three TD performance. \"The receivers did a great job giving us extra space on the perimeter. We started getting it clicking on that third drive.\" Jacob Huesman became just the third SoCon performer to top 10,000 yards total offense early in the second half on a 20-yard pass to James Stovall. He ended up with 68 rushing yards and 104 passing completing nine of 15 on the day. Triston Luke had 41 yards on the ground to lead the Paladins. Hannon connected on 19 of 34 passing for 176 yards and two interceptions. Jordan Snellings had eight catches for 87 yards to lead all receivers. A.J. Hampton had a team-high seven stops for the Mocs who recorded four sacks. Leslie, Brand, Keionta Davis and Justin King all reached the quarterback with an additional five hurries with two each for Brand and Mack. Cory Magwood had a game-high 11 tackles for the visitors. John Mackey added the lone sack.", "external_links": [], "published": "2015-10-11T01:42:00.000+03:00", "crawled": "2015-10-11T03:23:15.152+03:00", "highlightTitle": ""}