{"organizations": [], "uuid": "103a3f1f1c567ae5a91f7d6eb3824ed48fda2452", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kptv.com", "main_image": "", "site_section": "http://kptv.com//category/208630/sports?clienttype=rss", "section_title": "KPTV.com - Sports", "url": "http://www.kptv.com/story/30279687/no-9-am-hosts-no-10-alabama-looking-to-remain-undefeated", "country": "US", "title": "No. 9 A&M hosts No. 10 Alabama looking to remain undefeated", "performance_score": 0, "site": "kptv.com", "participants_count": 1, "title_full": "No. 9 A&M hosts No. 10 Alabama looking to remain undefeated - KPTV - FOX 12", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "103a3f1f1c567ae5a91f7d6eb3824ed48fda2452"}, "author": "cbs8", "url": "http://www.kptv.com/story/30279687/no-9-am-hosts-no-10-alabama-looking-to-remain-undefeated", "ord_in_thread": 0, "title": "No. 9 A&M hosts No. 10 Alabama looking to remain undefeated", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By KRISTIE RIEKEN\nAP Sports Writer COLLEGE STATION, Texas (AP) - Texas A&M quarterback Kyle Allen remembers exactly how he felt after year's 59-0 drubbing by Alabama.\n\"It was a feeling of embarrassment to be on a national TV stage and be beaten like that,\" he said. \"It felt like we were a high school team playing a college team, honestly, and it's not a feeling we ever want to feel again.\"\nNo. 9 Texas A&M gets a chance to avenge that blowout Saturday when it hosts No. 10 Alabama. The Aggies will be trying to open a season 6-0 for the first time since 1994 and keep pace with LSU in the SEC West. A loss by Alabama would badly damage its Southeastern Conference title and playoff hopes since they lost to Mississippi on Sept. 19.\nWhile the Aggies (5-0, 2-0 SEC) are thinking about last year's game to help insure that something like that doesn't happen again, the Crimson Tide (5-1, 2-1) is trying to ignore all the talk about it as the team gets ready for another meeting with Texas A&M.\n\"It's just like last week's game against Georgia, we have to block that out to focus for Arkansas,\" running back Kenyan Drake said. \"Every game is a season within itself. Obviously we're not going to focus on last year. That was a whole different year, a whole different team for both sides, so we're just going to focus on this year.\"\nA 19-year-old sophomore, Allen already has a lot of experience and is 8-2 in 10 career starts. He's been extremely accurate this season and has thrown 79 straight passes without an interception.\n\"They've really worked hard to try to create balance on their offense this year, in terms of being able to run the ball a little bit better,\" Alabama coach Nick Saban said. \"But they're still one of the most prolific passing teams in the country. Kyle Allen has done a really good job at quarterback for them. His passing efficiency rating is one of the tops in the country.\"\nSome things to know about the top-10 matchup between Alabama and Texas A&M:\nTWO-PRONGED RUSHING ATTACK: Alabama's offense features two solid running backs in Derrick Henry and Drake. Henry leads the team with 665 yards rushing and 10 touchdowns and Drake has 244 yards rushing with a score. Texas A&M coach Kevin Sumlin and his staff are focused on trying to slow the pair down on Saturday.\n\"One is a bigger bruiser, the other is more a shake-and-bake guy. Certainly complement each other well,\" Sumlin said. \"Bring different styles. See times where they're putting both on the field and able to utilize them ... we have to play good, sound, fundamental football. Gap responsibility. Got to gang tackle. Got to get a lot of people to the ball.\"\nPILING UP SACKS: Texas A&M defensive end Myles Garrett is tied for third in the country with 7 1/2 sacks. He has piled up 19 sacks in his career after breaking Jadeveon Clowney's SEC freshman record by taking down the quarterback 11 1/2 times last season. But he's not the only Aggie getting to the quarterback often as teammate Daeshon Hall has five sacks this year.\n\"I think their defense is playing a lot better,\" Saban said. \"They've got a really good scheme. They've got two really tough pass rushers to single block on the edges, which always can cause issues in the passing game.\"\nRIDLEY'S RECEIVING: Though Alabama relies more on its running game, Calvin Ridley has proven to be a threat in the passing game. He had nine catches for 140 yards - both career-highs - against Arkansas and leads the team with 385 yards receiving and three scores.\nRACING TO 1,000: Texas A&M freshman WR/KR/PR Christian Kirk needs 42 yards to reach 1,000 all-purpose yards. Kirk leads the team with 519 yards receiving with four touchdowns and he's returned a punt for another score.\nCopyright 2015 The Associated Press.   This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-10-16T03:00:00.000+03:00", "crawled": "2015-10-17T05:34:15.023+03:00", "highlightTitle": ""}