{"organizations": [], "uuid": "dbf2007a1f39307d55bd60785f77c1be15ef5bbb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.trivalleycentral.com", "main_image": "http://bloximages.chicago2.vip.townnews.com/trivalleycentral.com/content/tncms/assets/v3/editorial/9/cf/9cf7a114-74ff-11e5-a4e2-f7b2ffd72044/5622981f8bfe1.image.jpg?resize=960%2C614", "site_section": "http://www.trivalleycentral.com//search/?q=&t=article&l=100&d=&d1=&d2=&s=start_time&sd=desc&nsa=eedition&c[]=casa_grande_dispatch/local_sports,casa_grande_dispatch/local_sports/*&f=rss", "section_title": "trivalleycentral.com - casa grande dispatch/local sports,casa grande dispatch/local sports/", "url": "http://www.trivalleycentral.com/casa_grande_dispatch/local_sports/cougars-rally-past-florence/article_8a16f464-74ff-11e5-8e93-83e6985aec75.html", "country": "US", "title": "Cougars rally past Florence", "performance_score": 0, "site": "trivalleycentral.com", "participants_count": 1, "title_full": "Cougars rally past Florence", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T21:47:00.000+03:00", "replies_count": 0, "uuid": "dbf2007a1f39307d55bd60785f77c1be15ef5bbb"}, "author": "ED PETRUSKA Staff Writer", "url": "http://www.trivalleycentral.com/casa_grande_dispatch/local_sports/cougars-rally-past-florence/article_8a16f464-74ff-11e5-8e93-83e6985aec75.html", "ord_in_thread": 0, "title": "Cougars rally past Florence", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Steven King/Dispatch Armando Piñon \nCasa Grande's Armando Piñon runs for a long gain during a game against Florence played Friday evening in Florence. Posted: Saturday, October 17, 2015 11:47 am Cougars rally past Florence By ED PETRUSKA Staff Writer Casa Grande Valley Newspapers Inc. \nFLORENCE — Pulling out a 33-30 victory over Florence required an extraordinary effort from the Casa Grande Union football team on Friday night. \nThe Cougars overcame a 16-0 deficit and three turnovers to defeat the Gophers and edge closer to the Division IV/Section 5 title. \n“These kids don’t quit,” CG Union coach Jake Barro said. “We challenged them at halftime, and they responded.” \nThe best thing about the win, Barro said, is “we control our destiny. It’s been a while since (CG Union) has been able to do that this late in the year.” \nThe No. 14 Cougars (7-1, 3-0 section) trailed 23-13 at halftime after allowing the No. 19 Gophers (3-5, 1-2) to accumulate 282 total yards while scoring on four of seven possessions. CG Union went scoreless on its first five series, losing two fumbles along the way, before reaching the end zone on its final two possessions of the half. \nKoby Charles had two interceptions in the third quarter for the Cougars, swinging the momentum in CG Union’s favor. The first halted a drive at the CG Union 28 with 8:01 remaining, and the second led to a seven-play, 31-yard touchdown drive that narrowed the deficit to 23-20 with 2:13 left. \n“That first interception changed everything,” Barro said. \nThe Cougars took their first lead at 26-23 on the first play of the fourth quarter. Trevor Russell’s 6-yard TD catch capped a four-play drive following Russell’s 30-yard punt return to the Florence 22. \nThe Gophers then marched 79 yards in six plays to go ahead 30-26 with 9:52 remaining. Beau Griego was credited with a 54-yard touchdown run after taking a lateral from Ramazees Severe on a hook-and-ladder play. \nCG Union responded with a nine-play, 61-yard scoring drive, going ahead to stay on Brock Hall’s fourth TD pass of the game — a 10-yarder to Cameron Gardner with 6:28 remaining. \nGardner’s interception with 4:16 to play halted Florence’s next possession. But the drama was far from over. \nThe Cougars picked up two first downs as the Gophers used all of their timeouts and had the ball at the Florence 37 when they called a timeout on fourth and 13 with 1:09 left to avoid a delay of game penalty. Barro made the decision to throw a pass, and the unthinkable happened when George Obitz made an interception and returned it 35 yards to the CG Union 29 with 59.7 seconds left. \nThe Cougars made one last stand, stopping the Gophers on downs at the 29 following an incompletion, a 5-yard tackle for loss by Damien Estrada, another incompletion and a 5-yard run. \nHall now holds the CG Union single-season record with 27 TD passes. He went 15 of 28 for 182 yards, connecting with Armando Pinon for a 17-yard touchdown with 7:07 left in the second quarter to finish a four-play, 63-yard drive and with Russell on a 5-yarder in the third. \nRussell has 15 TD receptions on the season, tying him with Aaron Jones (1994) for the single-season school record. He finished with five catches for 89 yards. \nHunter Bechtel’s 3-yard touchdown run with 33.6 seconds remaining in the first half pulled the Cougars within 23-13. \nThe Gophers were stopped on downs on their first two series, then drove 79 yards in six plays to go up 7-0 with 2:57 remaining in the first quarter. The touchdown came on a 27-yard pass from Jared Wood to Severe. \nFlorence settled for a 30-yard field goal on its next possession after Garrett Mariscal recovered a fumble at the CG Union 22. Wood and Severe hooked up for a 28-yard TD with 8:07 left in the second quarter to give the Gophers a 16-0 lead, and they led 23-6 following Griego’s 4-yard touchdown run with 3:04 remaining in the half that finished a nine-play, 70-yard drive. \nFlorence had 110 total yards in the second half — 40 rushing and 70 passing — and 392 for the game. Wood completed 24 of 38 passes for 249 yards, Joshua Williams had seven receptions for 112 yards, and Griego rushed for 134 yards on 25 carries. \nThe Cougars had 310 total yards, rushing for 128.", "external_links": [], "published": "2015-10-17T21:47:00.000+03:00", "crawled": "2015-10-18T02:54:07.736+03:00", "highlightTitle": ""}