{"organizations": [], "uuid": "29c075e9baba3e0d01c9a36d19c9c9e2eaef7007", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leesvilledailyleader.com", "main_image": "http://www.leesvilledailyleader.com/Global/images/head/nameplate/la-leesville_logo.png", "site_section": "http://www.leesvilledailyleader.com/sports?template=rss&mime=xml", "section_title": "Sports - Leesville Daily Leader - Leesville, LA", "url": "http://www.leesvilledailyleader.com/article/20151015/NEWS/151019869/2000/NEWS?rssfeed=true", "country": "US", "title": "Red Devils on road against much-improved Bunkie", "performance_score": 0, "site": "leesvilledailyleader.com", "participants_count": 1, "title_full": "Red Devils on road against much-improved Bunkie", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T04:00:00.000+03:00", "replies_count": 0, "uuid": "29c075e9baba3e0d01c9a36d19c9c9e2eaef7007"}, "author": "Daniel Green", "url": "http://www.leesvilledailyleader.com/article/20151015/NEWS/151019869/2000/NEWS?rssfeed=true", "ord_in_thread": 0, "title": "Red Devils on road against much-improved Bunkie", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted Oct. 15, 2015 at 8:00 PM BUNKIE — It certainly isn’t getting any easier for the Pickering Red Devils. After breaking a two-game skid last week with a 35-14 victory over the Oakdale Warriors in the District 3-2A opener, the Red Devils (4-2, 1-0) take to the road against upstart Bunkie, which dropped its first game of the year last week against second-ranked Many, 21-10. “Bunkie is playing really good football and they are very athletic,” said Pickering head coach Johnny Cryer. “They fly to the football and are a lot better team this year than last year. We will have to play our best game to win this one.” The Panthers (5-1, 0-1) are under the direction of new head coach Freddie Hallman. Hallman is no rookie coach, however, as he is a veteran who has led numerous programs to the postseason, including a year ago at Lakeview, taking the Gators to the second round. “Freddie is a very, very good football coach,” Cryer said. “He’s been successful everywhere he has been and I’m not surprised at how well he has his kids playing.” Running out of the old Wing-T formation, the Panthers try to utilize their overall team speed and try to get to the edge. Joseph Murray has been their primary threat this year, accounting for 700 yards and 12 touchdowns. Jon’Ques Williams and quarterback Anthony Baronne have played well for the Panthers thus far, combining for nearly 600 yards rushing in support of Murray. As explosive as the Panthers have been offensively this season, Pickering has shown that same ability, especially with a healthy Patrick Hinson calling the signals. Hinson suffered a concussion against DeRidder in Week 4, sitting out the next week, a 36-6 loss to Mangham where the Red Devils gained just over 150 yards of offense. In his return against Oakdale, Hinson rushed for 119 yards on 22 carries, while also completing 10-of-14 passes for 157 yards and two touchdowns. “We are definitely a more versatile team with Patrick on the field,” Cryer said. “He does a great job running and throwing the ball. He makes everyone around him better and we are going to need another big game out of him.” The Red Devils have also seen a vast improvement in their running game, but that will be tested this week as Jermaine Milton will not play after suffering an injury last week. Sophomore Quan Blackwell, who ran for 115 yards and a touchdown last week, will start at tailback, while Dontay Hargrove and Aniyah Spencer have both worked this week in the spot. Hargrove, who is the team’s starting tight end, will also play safety in the absence of Zach Jefferies, who will miss this game due to a death in his family. Page 2 of 2 - According to Cryer, the Red Devil defense will face quite a challenge this week as Bunkie has plenty of speed and athletic ability. “Our defense has its hands full this week,” Cryer said. “We are going to have to play good assignment football and keep them from getting to the edge. And if they get in space, we have to make the tackles in those situations.” The Red Devils return home next week to take on the Rosepine Eagles for its homecoming contest, while the Panthers will face Menard.", "external_links": [], "published": "2015-10-16T04:00:00.000+03:00", "crawled": "2015-10-16T17:24:56.994+03:00", "highlightTitle": ""}