{"organizations": [], "uuid": "1725c028022c713b320c4f867548f289bc5f30ff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thestar.com", "main_image": "http://www.thestar.com/content/dam/thestar/sports/leafs/2015/10/12/leafs-working-on-the-lines-the-angles-and-the-metrics/jb.jpg", "site_section": "http://www.thestar.com/sports/leafs.html", "section_title": "Toronto Maple Leafs | Sports | Toronto Star", "url": "http://www.thestar.com/sports/leafs/2015/10/12/leafs-working-on-the-lines-the-angles-and-the-metrics.html", "country": "CA", "title": "Leafs working on the lines, the angles and the metrics", "performance_score": 0, "site": "thestar.com", "participants_count": 1, "title_full": "Leafs working on the lines, the angles and the metrics | Toronto Star", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "1725c028022c713b320c4f867548f289bc5f30ff"}, "author": "Mark Zwolinski", "url": "http://www.thestar.com/sports/leafs/2015/10/12/leafs-working-on-the-lines-the-angles-and-the-metrics.html", "ord_in_thread": 0, "title": "Leafs working on the lines, the angles and the metrics", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Leafs have a work week ahead of them, with four days of practice before back-to-back road games in Columbus and Pittsburgh, Friday and Saturday, and a first encounter with Phil Kessel since he was traded to the Penguins.\nMike Babcock and his coaching staff continue to work on every facet of the game, but signs of improvement have surfaced, especially with puck possession and shots on goal. But the Leafs are among the worst in the league in goals against — only Boston had allowed more than Toronto’s 11 entering Monday — and that remains a main target as the team gets comfortable with Babcock’s detail-oriented systems.\nHere’s a look at three keys to the Leafs hopes for steady improvement:\nThe energy drive\nBabcock told a coaching conference recently that he likes to deploy an “energy guy” with two skilled players on his top forward lines. He shuffled his lines Saturday to reflect that, with Leo Komarov moving to a line with Tyler Bozak and James Van Riemsdyk, and Michael Grabner joining Nazem Kadri and Brad Boyes.\nBut the coach also had Dan Winnik and Nick Spaling — two solid checkers with penalty killing skills — on a line with Joffrey Lupul. That line had the most ice time, just over 36 per cent.\nThe two skilled players and an energy guy mix may become a more permanent fixture if the right chemistry emerges. “I like someone to be at the net, someone to get them (skill players) the puck,” Babcock said at Monday’s practice. “In Detroit, (Pavel) Datsyuk wanted (Darren) Helm … (Henrik) Zetterberg wanted (Justin) Abdelkader … someone to do the heavy lifting.”\nThe angle on Bernier\nBernier and backup James Reimer worked with goalie coach Steve Briere on their angles Monday. The drill, in part, tried to recreate a goal Bernier allowed Friday in Detroit, as he tries to get rid of old habits.\n“I think I was a bit deep on that goal (in Detroit),” Bernier said of his positioning in his crease. “I have to get to the top of my crease and cut my angles down.”\nThe biggest aid to Toronto’s goaltender could come from the Leafs’ dedication to spending more time in the offensive zone.\n“Overall, (we’re making) a big effort to spend less time in our zone,” Reimer said. “I’ve really noticed it . . . it’s felt different.”\nIt is expected Bernier will start Friday in Columbus, with Reimer playing Saturday in Pittsburgh. Even at this early juncture in the season, Reimer has floated into trade rumors, with Edmonton and, to a lesser extent, Buffalo mentioned as potential fits.\nThe metric system\nToronto’s puck possession metrics have showed improvement, three games in. After an unacceptably low 42-per-cent possession rate last season — 50 per cent or more is considered solid — the Leafs are up around 51 per cent. Their shots on goal numbers have also improved, with Toronto outshooting their opponent in two of their first three games. That has led to a plus-5.3 shot differential so far — seventh overall in the NHL.\nMore on thestar.com\nRoyals mount furious comeback to force ALDS Game 5 against Astros\nArgos break out in fourth quarter to get by Alouettes", "external_links": ["http://static.freeskreen.com/publisher/52/freeskreen.min.js"], "published": "2015-10-12T03:00:00.000+03:00", "crawled": "2015-10-13T01:48:14.889+03:00", "highlightTitle": ""}