{"organizations": ["Browns", "Broncos Browns"], "uuid": "651afbeb697c5dcc81eff8fc40c8ea467a76883a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pendletontimespost.com", "main_image": "", "site_section": "http://pendletontimespost.com//feed/sec/6000/", "section_title": "PendletonTimesPost.com - Sports News", "url": "http://www.pendletontimespost.com/view/story/4f7dd6e1152749878ecdb45b75fe0c7f/FBN--Browns-Manziel/", "country": "US", "title": "Johnny Manziel active as Browns face Broncos", "performance_score": 0, "site": "pendletontimespost.com", "participants_count": 0, "title_full": "Johnny Manziel active as Browns face Broncos", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T19:33:00.000+03:00", "replies_count": 0, "uuid": "651afbeb697c5dcc81eff8fc40c8ea467a76883a"}, "author": "", "url": "http://www.pendletontimespost.com/view/story/4f7dd6e1152749878ecdb45b75fe0c7f/FBN--Browns-Manziel/", "ord_in_thread": 0, "title": "Johnny Manziel active as Browns face Broncos", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Johnny Manziel", "TOM WITHERS"], "text": "Browns quarterback Johnny Manziel active for game despite domestic incident with girlfriend By TOM WITHERS AP Sports Writer   12:33 pmLast   12:33 pm   \nPeople: \nPhotos: \nFILE - In this Sunday, Sept. 20, 2015 file photo, Cleveland Browns quarterback Johnny Manziel celebrates after a 60-yard touchdown pass to wide receiver Travis Benjamin in the first half of an NFL football game against the Tennessee Titans in Cleveland. Browns quarterback Johnny Manziel was involved in a domestic dispute with his girlfriend that police say involved alcohol, Friday, Oct. 16, 2015. (AP Photo/David Richard, File) \nCLEVELAND — Johnny Manziel's domestic dispute didn't cost him a chance to play. \nManziel is active and will back up starter Josh McCown on Sunday against Denver despite being questioned by police earlier in the week following a heated argument with his girlfriend that involved alcohol. \nWith Austin Davis available, the Browns could have made Manziel inactive. But the former Heisman Trophy winner, who won his only start this season against Tennessee, will face the Broncos if McCown struggles or can't finish. \nManziel, who spent 10 weeks during the offseason in a rehab facility, acknowledged to police that he drank alcohol on Monday before he and his girlfriend, Colleen Crowley, got into an argument while he was driving on Interstate 90 west of Cleveland. According to a police report, witnesses said Manziel was driving at a high rate of speed and passed cars on the shoulder before police were called. \nManziel was not arrested, and Crowley, who had an abrasion on her wrist, said she did not want to press charges. \nThe Browns released a statement Friday saying they had spoken to Manziel about his behavior. However, the team did not exclude him from Sunday's game. \nManziel dismissed the incident as a spat with his girlfriend, whom police said was intoxicated. \n\"Colleen and I got into a dumb public argument on the way home Monday afternoon,\" Manziel wrote Friday on Twitter. \"It probably looked more interesting than it was and I know I would stop and check if I saw a couple arguing on the side of the road. It was embarrassing but not serious and when we talked to the police and they realized everything was alright and I was sober, we went home together and everything is fine.\" \nStill, Manziel's actions have to be concerning for the Browns, who drafted him in the first round in 2014 with the hope he can develop into their long-term starter. Manziel had an awful rookie season, which was followed with him checking into a substance treatment center in Pennsylvania. \nAP NFL website: http://www.pro32.ap.org and http://www.twitter.com/AP_NFL \n ", "external_links": [], "published": "2015-10-18T19:33:00.000+03:00", "crawled": "2015-10-18T20:27:36.899+03:00", "highlightTitle": ""}