{"organizations": [], "uuid": "dd4cdbb1e27cc805f8212708fc76afbe399796db", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cleveland.com", "main_image": "http://imgick.cleveland.com/home/cleve-media/width620/img/plain-dealer/photo/2015/07/09/18285225-large.jpg", "site_section": "http://www.cleveland.com/pdsportsinsider/", "section_title": "Sports Insider | Sports Analysis from Northeast Ohio Media Group - cleveland.com ", "url": "http://www.cleveland.com/tribe/index.ssf/2015/10/the_curious_contract_case_of_c.html", "country": "US", "title": "The curious contract case of closer Cody Allen, who is due for a raise this winter", "performance_score": 0, "site": "cleveland.com", "participants_count": 9, "title_full": "The curious contract case of closer Cody Allen, who is due for a raise this winter | cleveland.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T20:45:00.000+03:00", "replies_count": 12, "uuid": "45f0dc335a78fff7c2dec15f86817f91b2c3aeb7"}, "author": "Zack Meisel, Northeast Ohio Media Group", "url": "http://www.cleveland.com/tribe/index.ssf/2015/10/the_curious_contract_case_of_c.html#post-0", "ord_in_thread": 0, "title": "The curious contract case of closer Cody Allen, who is due for a raise this winter", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CLEVELAND, Ohio -- The Indians had avoided arbitration for 23 years before they engaged in the oft-uncomfortable process with reliever Vinnie Pestano in 2014.\nFor years, the organizational strategy has been to lock up core players to affordable, long-term deals that typically cover the arbitration years. In other circumstances, the club has settled with a player before requiring the services of a third party.\nCloser Cody Allen will be eligible for arbitration for the first time this winter. What is a 26-year-old reliever worth? Would the Indians secure him to a long-term deal, as they have with Jason Kipnis, Michael Brantley, Yan Gomes, Corey Kluber and Carlos Carrasco over the last two years?\n\"With relievers, it can be more challenging,\" said General Manager Mike Chernoff. \"You just don't see those contracts out there quite as much in the industry. It's a little bit easier to project out a starting pitcher's role moving forward or a position player's role moving forward. That's harder to do in the bullpen. I think that volatility often leads to the challenge of both sides meeting on what a potential value could be.\"\nMLBTradeRumors.com projects that Allen would earn $3.5 million in his first year of arbitration. Oakland signed closer Sean Doolittle last year to a five-year, $10.5 million pact that includes a pair of team options for $6 million and $6.5 million. Twins closer Glen Perkins signed a four-year, $22 million extension last year. Perkins had accumulated more major-league service time than Doolittle or Allen, though. Atlanta avoided arbitration with former closer Craig Kimbrel in 2014 by reaching an agreement on a four-year, $42 million deal. Kimbrel was arbitration eligible for the first time and had already been named to three All-Star teams.\nAllen totaled a career-high 34 saves in 38 chances in 2015. He posted a 2.99 ERA, though he surrendered nearly half of his earned runs -- 11 of 23 -- in three of his 70 appearances. He allowed only two home runs in 69 1/3 innings, and neither long ball came during a save situation.\nAllen's 1.82 FIP (fielding independent pitching) is the lowest mark of any reliever in franchise history with 30 or more innings. He tallied 99 strikeouts; one more and he would have become the fifth reliever in team history to rack up 100 or more. His strikeout rate -- 12.9 per nine innings -- is the best in Tribe history for any pitcher for a season.\nHe did have his hiccups, however. Allen allowed four runs in the ninth inning of a 9-6 loss to Detroit on April 11. Nine days later, he yielded four runs on six hits to morph a 3-0 advantage into a 4-3 defeat in Chicago. Five weeks into the season, his ERA stood at 9.00 and he had served up a .959 OPS to the opposition.\nYour browser does not support iframes.\nIn late May, Allen began a stretch of 19 consecutive scoreless innings, during which he allowed only nine hits and four walks and he collected 31 strikeouts. Over his final 19 outings -- spanning 20 1/3 innings -- he gave up only one earned run and he struck out 26.\nAllen notched seven saves in which he recorded four or more outs. Manager Terry Francona often turned to the right-hander in dicey situations in the eighth. Against the Cubs on June 18, he even summoned Allen in the fifth, when Chicago loaded the bases before a rain delay.\nAllen was once approached with the idea of \"The Maid\" as a nickname, given his tendency to clean up messy situations in the late innings.\n\"That's stupid,\" Allen said. \"Did Tito come up with that?\"\nNickname or no nickname, should the Indians reward Allen for his high-leverage reliability with a multi-year contract extension? Or should the club let the arbitration process play out?\nHere are MLBTradeRumors' other arbitration projections for the Indians:\nJosh Tomlin: $3.1M\nLonnie Chisenhall: $3.0M\nBryan Shaw: $2.8M\nZach McAllister: $1.0M\nJeff Manship: $700K\nNick Hagadone: $600K", "external_links": ["http://m.mlb.com/shared/video/embed/embed.html?content_id=518959783&topic_id=8878836&width=400&height=224&property=mlb", "http://www.mlbtraderumors.com/2015/10/projected-arbitration-salaries-for-2016.html"], "published": "2015-10-08T20:45:00.000+03:00", "crawled": "2015-10-09T06:22:34.924+03:00", "highlightTitle": ""}