{"organizations": [], "uuid": "8631993488fd4ac5f78cd31696e55de18371a747", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pendletontimespost.com", "main_image": "", "site_section": "http://pendletontimespost.com//feed/sec/6000/", "section_title": "PendletonTimesPost.com - Sports News", "url": "http://www.pendletontimespost.com/view/story/33bcfc7989204773a7b114d10cf02278/BBA--ALCS-MVP/", "country": "US", "title": "Royals' Escobar wins ALCS MVP after clutch series", "performance_score": 0, "site": "pendletontimespost.com", "participants_count": 0, "title_full": "Royals' Escobar wins ALCS MVP after clutch series", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T07:37:00.000+03:00", "replies_count": 0, "uuid": "8631993488fd4ac5f78cd31696e55de18371a747"}, "author": "", "url": "http://www.pendletontimespost.com/view/story/33bcfc7989204773a7b114d10cf02278/BBA--ALCS-MVP/", "ord_in_thread": 0, "title": "Royals' Escobar wins ALCS MVP after clutch series", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Alcides Escobar", "Lorenzo Cain", "DAVE SKRETTA"], "text": "Royals SS Alcides Escobar joins teammate Lorenzo Cain in winning ALCS MVP award By DAVE SKRETTA AP Sports Writer   24, 2015 - 12:36 amLast Updated: October 24, 2015 - 12:37 am   \nPeople: \nMissouri (724) \n\nKANSAS CITY, Missouri — Alcides Escobar caused the Toronto Blue Jays all kinds of trouble from the very first pitch. \nIn just about every game of the AL Championship Series. \nThe leadoff hitter and defensive dynamo was voted MVP of the ALCS on Friday night following a 4-3 victory in Game 6 that put Kansas City in its second straight World Series. \nEscobar set a postseason record by getting a leadoff hit in the first four games of a series — he scored in two of those games. And he wound up going 11 for 23 against the Blue Jays, joining Dustin Pedroia of the Boston Red Sox as the only hitters to have at least 10 hits and five RBIs from the leadoff spot in LCS history. \nNot bad for a career .262 hitter known primarily for his defense. \n\"He's such a talented player,\" Royals manager Ned Yost said. \"But with the grind of a 162-game season, there are little periods where his focus will tend to waver a little bit. But during the playoffs, he just locks in. And when he's focused, he's as good as any player in the league.\" \nEscobar followed teammate Lorenzo Cain in becoming the second straight Royal to earn ALCS MVP honors. Both were part of the 2010 trade that sent pitcher Zack Greinke to the Milwaukee Brewers — a deal that helped set up Kansas City's run of success. \nDespite a lousy on-base percentage, and advance metrics that run against conventional wisdom, Escobar has flourished since returning to the Royals' leadoff spot in late September. \nHis penchant for swinging at the first pitch suddenly made Yost look like a genius when he opened Game 1 with a first-pitch double off Marco Estrada. He singled again the next night in his first at-bat, and tripled under the glove of Jose Bautista leading off Game 3. \nThen, he showed his speed by leading off the Royals' rout in Game 4 with a surprise bunt base hit off knuckleballer R.A. Dickey, eventually jogging home on Ben Zobrist's home run. \nIn all, Escobar saw six pitches in those first four at-bats. \n\"I want to go to home plate and be aggressive, trying to swing at a strike,\" he explained earlier in the series. \"And I'm doing really good right now. Continue to be the same guy.\" \nEscobar grounded out on the first pitch from Estrada in Game 5 on Wednesday, and in his first at-bat against David Price on Friday night. But he extended his postseason hit streak to 10 games with a single in the seventh, and seemed to spark the Royals' bats all series. \n\"He's a bit of a catalyst at the top of the order,\" Yost said. \"More than anything else, he just raises his game this time of year because of his focus. He just intensifies his focus.\" \nHis offensive outbreak hadn't diminished his otherworldly defense, either. \nEscobar's diving catch of Russell Martin's hit with runners on first and second in the second inning of Game 2 has become a postseason highlight-reel staple. He made an equally impressive dive to catch reliever Ryan Madson's throw for a force at second base. \n\"When I'm coming to the field every game in the postseason, my main thing is I want to win the game. I want to do the best I can,\" Escobar said. \"And right now I'm really focused and I feel really good at home plate.\" \n ", "external_links": [], "published": "2015-10-24T07:37:00.000+03:00", "crawled": "2015-10-24T07:42:31.960+03:00", "highlightTitle": ""}