{"organizations": ["Passaic County Tech"], "uuid": "6763e105965dfab9333da8375a4a7d27f558ed51", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.northjersey.com", "main_image": "http://www.northjersey.com:80/polopoly_fs/1.1429290!/fileImage/httpImage/100815-td-perezpct.jpg", "site_section": "http://www.northjersey.com/cmlink/high-school-sports-rss.rss", "section_title": "High School Sports on NorthJersey.com", "url": "http://www.northjersey.com/sports/high-school-sports/boys-soccer/the-right-mix-1.1429289", "country": "US", "title": "Boys' Soccer: PCTI and Clifton highlight county tournament quarterfinals", "performance_score": 0, "site": "northjersey.com", "participants_count": 0, "title_full": "Boys' Soccer: PCTI and Clifton highlight county tournament quarterfinals", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T18:36:00.000+03:00", "replies_count": 0, "uuid": "6763e105965dfab9333da8375a4a7d27f558ed51"}, "author": "", "url": "http://www.northjersey.com/sports/high-school-sports/boys-soccer/the-right-mix-1.1429289", "ord_in_thread": 0, "title": "Boys' Soccer: PCTI and Clifton highlight county tournament quarterfinals", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Manny Montenegro", "Julian Perez", "Clifton"], "text": "Buy this photo photo by kevin r. wexler CONTACT - Passaic County Tech's Julian Perez, left, battles for a loose ball with Clifton's Manny Montenegro in a regular-season boys' soccer matchup last month. The two teams meet up again this weekend in the Passaic County Tournament quarterfinal round. \nWAYNE - The formula is never set in stone, but usually the winner of the Passaic County Coaches' Association boys' soccer tournament is gelling as the season clicks past the midway point. \nAfter an impressive 3-0-1 start to the season, Passaic County Technical Institute entered the week at 3-3-1 following three-consecutive losses in which the Bulldogs have been outscored, 6-0. \nSomehow, the fourth-seeded Bulldogs, who earned one of four double byes in the tournament, need to recapture that winning feeling. It won't be easy with an angry No. 4-seed Clifton visiting Reinhardt Road Saturday morning at 11 o'clock for a quarterfinal matchup. \nPCTI does know Clifton well, having topped the Mustangs, 3-1, on Sept.16. They'll meet again in the Big North Conference Liberty Division on Oct. 20 and perhaps the Group 4 sectionals, but Saturday's contest is the most important to date for these archrivals. \nClifton (6-3) is playing with the self-admitted \"chip on their shoulder.\" The Mustangs put away Hawthorne, 6-0, in the first round with a late barrage - five goals in the last 20 minutes. Bruno Frascolla is the top defender in the county while Mike Algieri and Tommy Miazga are earning more field time. Seniors Frankie Salensky and Matt Miller are the unsung heroes plying their trade on the backline and up front, respectively. The Mustangs have won three-straight, including yesterday's 2-1 victory over Wayne Valley. \nThere is a mutual respect between the two sides, but no love. Clifton last won a title in 2012, while PCTI shared the hardware in 2008 when they tied the Mustangs for the county crown. Clifton is out to prove the seedings were farcical while PCTI looks for a return to the semifinals. Regardless, another El Clasico chapter is about to be scripted. Game time is 11 a.m. \nThere are three other appetizing quarterfinal matches (teams are preceded by their seed, with the higher seeds hosting): \n1-Passaic Valley vs. 9-Wayne Valley 9:30 a.m.: The Indians beat No. 8 Lakeland, 2-0, on Monday, snapping a two-game slide and pushing through to the quarters for the second-straight season. These teams compete in the Big North Independence, so there are no secrets. Passaic Valley's Zachary Fitzgerald and Piero Batarseh are target-men. This is the best shot at an upset especially the way defenders Aneesh Bhave, Matt Bleeker, Scott Sherin and Brandon Vecere are playing in front of senior goalkeeper Matt Mihalik. \n2-Hawthorne Christian vs. 7-Passaic 11 a.m.: Passaic eked into the quarterfinals with a 1-0 win over Pompton Lakes. Diego Ruiz is the primary goal-scoring threat. Passaic is coming off a loss to Bergen Catholic on Tuesday and are 1-5 in their last six games with three shutouts. HCA's Rene White (16 goals) and Will Woodfin (10 goals, 9 assists) should have it their way against keeper Oscar Martinez. HCA (8-1), a state finalist a year ago, will push through to the semis. \n3-DePaul Catholic vs. 6-Wayne Hills 1 p.m.: This is one of two great matchups this weekend. The schools are separated by about a mile, but they have different approaches. Wayne Hills is defensive oriented having allowed three goals in their first six games with goalkeeper Dominick Theophanous. DePaul senior Matthew Gotrell is the county's most exciting player making marauding runs down the center of the pitch. \nThe Patriots won the title in 2013 and will face a tough challenge against the defending county champion Spartans. \n\"Wayne Hills packs the backline and is really playing well,\" DePaul boss Steve Beneventine said. \nHills, Valley open \nThe girls' tournament is also down to the quarterfinals. \n1-Wayne Hills vs. 8-PCTI: Could this be the upset of the tournament? PCTI has gained respectability this season and even played No. 2 Clifton to a 1-0 loss. The Patriots are gunning for their 12th county crown and are nearly unbeatable on their home field especially with Meghan Griffin as the team's engine. \n2-Clifton vs. 7-Pompton Lakes: Clifton is the hottest team in the county and focused - that's a scary combination. The Mustangs have the county's top backline and plenty of scoring options up front. Nicolette MacDonald is Pompton's top scorer and Mary Dougherty the set-up person. \n3-Lakeland vs. 6-Hawthorne: Lakeland's fluid offense is paced by Michelle Furman, Annie Yost, Julia Boccia and Madison Burgner and will propel them into the semifinals. \n4-Wayne Valley vs. 5-DePaul: Clearly it is the best matchup of the bracket. Coach Mark's White's DePaul team is gaining confidence and traction after a slow start with Alyssa Oviedo, Nina Lombardo and Hunter Crespo along with a goalkeeping tandem clicking. Wayne Valley has Randi Smith and Jen Cannarella up front and Brianna DeLuccia in goal. The losing side will consider this tournament a letdown after high preseason expectations. © 2015 North Jersey Media Group Tags:", "external_links": [], "published": "2015-10-09T18:36:00.000+03:00", "crawled": "2015-10-09T23:53:47.395+03:00", "highlightTitle": ""}