{"organizations": ["UConn", "UCF Kiel"], "uuid": "6ea754c2691dd84c39f754fade20f4a8d3e0dc12", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cincinnati.com", "main_image": "http://www.gannett-cdn.com/-mm-/19cb70032f071f62633da83ef9af58403812a471/c=0-63-680-447&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/25/Cincinnati/Cincinnati/635813726565490639-gunnerUconn.jpg", "site_section": "http://rssfeeds.cincinnati.com/cincinnati-sports", "section_title": "Cincinnati - Sports", "url": "http://www.cincinnati.com/story/sports/college/university-of-cincinnati/2015/10/25/kiel-back-saddle-uc-awaits-ucf/74472336/", "country": "US", "title": "Kiel back in saddle as UC awaits UCF", "performance_score": 0, "site": "cincinnati.com", "participants_count": 0, "title_full": "Kiel back in saddle as UC awaits UCF", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T18:48:00.000+02:00", "replies_count": 0, "uuid": "6ea754c2691dd84c39f754fade20f4a8d3e0dc12"}, "author": "", "url": "http://www.cincinnati.com/story/sports/college/university-of-cincinnati/2015/10/25/kiel-back-saddle-uc-awaits-ucf/74472336/", "ord_in_thread": 0, "title": "Kiel back in saddle as UC awaits UCF", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Tom Groeschen", "Kiel"], "text": "Kiel back in saddle as UC awaits UCF Tom Groeschen , tgroeschen@enquirer.com 12:48 p.m. EDT October 25, 2015 Gunner Kiel had a huge game against UConn on Saturday, his first appearance in a month. (Photo: The Enquirer/Sam Greene) \nAll is well again with University of Cincinnati football, at least for another week. \nThe Bearcats continued their win-one, lose-one, win-one season with a 37-13 rout of Connecticut on Saturday. The Bearcats (4-3, 1-2 American Athletic Conference East) have alternated between wins and losses since the season began. \nNext Saturday offers a real chance at UC’s first two-game winning streak of the year, as Central Florida (0-8, 0-4 AAC East) will visit Nippert Stadium for a noon kickoff. \nWrapping up the UConn game, and looking ahead to UCF: \nKiel appears to have won his job back \nGunner Kiel made the most of his first quarterback start in a month , throwing for 327 yards and two touchdowns and also rushing for a score. \nKiel missed all or most of the Bearcats’ three previous games, mainly because of injuries. The nation’s former No. 1-rated prep quarterback was stewing as he watched redshirt freshman Hayden Moore take the reins. \n“It hurt,” Kiel said. “To finally be back out there is the best feeling ever.” UC Bearcats cruise past UConn, 37-13 \nUC coach Tommy Tuberville said the competition will continue in practice, but Tuberville admits it will be hard to bench Kiel now. \n“I think he’s going to be real hard to get that position away from, the No. 1 spot,” Tuberville said. “But again, it’s great for competition. It’s great for everybody involved.” Bearcats quarterback Gunner Kiel won his first UC start in a month in Saturday's Homecoming victory against UConn. \nRunning game cranks up \nUC rushed for 285 yards against UConn, after being held to a season low 121 in the loss at BYU. \nHosey Williams led the committee Saturday with 140 yards and a TD, including an 84-yard run that was second longest in UC history. The record is a 91-yard rush by Joe Miller in 1953, according to the UC media guide. \nMike Boone (117 yards) and Tion Green (71) also played well Saturday. Plus, the offensive line allowed only one sack. The potent UC passing attack is almost always there, but the Bearcats are at their best when the running game also produces. \nYoung defense making strides \nUC started only one senior on defense Saturday, LB/DB Leviticus Payne. The starters included five players who are either redshirt or true freshmen: DE Kimoni Fitz, DE Landon Brazile, MLB Bryce Jenkinson, S Tyrell Gilbert, CB Alex Thomas. \nUC coaches are going with youth, partially because of injuries but mainly because of performance. There is more speed and quickness among some of the young colts, and UC held UConn to 266 total yards. It was the Bearcats’ best defensive showing against FBS competition this season. \nStruggling Central Florida up next \nUCF has collapsed to an 0-8 record this season, after winning or sharing the past two AAC titles. \nThe Knights lost 59-10 at home to Houston on Saturday. Orlando Sentinel coverage included a photo of a UCF fan with a bag over his head, with mostly empty seats around him. Sentinel columnist Mike Bianchi has called for UCF coach George O’Leary to step down. \nThis game seems almost too easy for UC, but the Bearcats are not in position to take anyone for granted. For instance, the 37-33 comeback win last month over the Miami RedHawks , who have been blown out in most other games this year. \n-", "external_links": [], "published": "2015-10-25T18:48:00.000+02:00", "crawled": "2015-10-26T02:12:36.442+02:00", "highlightTitle": ""}