{"organizations": [], "uuid": "bca03af4f06ad54bbfcf1c90f7225d0ba434b287", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www2.ljworld.com", "main_image": "http://worldonline.media.clients.ellingtoncms.com/img/croppedphotos/2015/10/10/McGowanBAYcrop_t800.jpg?90232451fbcadccc64a17de7521d859a8f88077d", "site_section": "http://www2.ljworld.com/rss/headlines/sports/ku/", "section_title": "LJWorld.com stories: KU sports", "url": "http://www2.ljworld.com/news/2015/oct/10/mammoth-baylor-te-laquan-mcgowan-grabs-first-td-se/", "country": "US", "title": "Mammoth Baylor TE LaQuan McGowan grabs first TD of season", "performance_score": 0, "site": "ljworld.com", "participants_count": 1, "title_full": "Mammoth Baylor TE LaQuan McGowan grabs first TD of season", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T03:22:00.000+03:00", "replies_count": 0, "uuid": "bca03af4f06ad54bbfcf1c90f7225d0ba434b287"}, "author": "Tom Keegan", "url": "http://www2.ljworld.com/news/2015/oct/10/mammoth-baylor-te-laquan-mcgowan-grabs-first-td-se/", "ord_in_thread": 0, "title": "Mammoth Baylor TE LaQuan McGowan grabs first TD of season", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "“People think I’m slow,” McGowan said. “Well, compared to smaller guys, yeah, I’m slow. When you put me up against big guys, I’m just as fast as the next guy.” \nJust as fast, and 100-plus pounds heavier. Press Conferences & Post-Game Interviews Postgame: David Beaty on Baylor blowout, Ryan Willis, punting \nFollowing a 66-7 loss to Baylor, first-year Kansas football coach David Beaty meets the media to discuss the rout, the play of KU's true freshman quarterback Ryan Willis, an early decision to punt and much more. \nMcGowan, lined up in the backfield as a blocking back in the second quarter, ran straight ahead after the snap, found himself all alone at the 11, caught the pass and took it into the end zone for an 18-yard touchdown on his first catch of the season. \nKansas senior safety Michael Glatczak, giving up 137 pounds to McGowan, charged from the end zone toward the modern-day Refrigerator Perry and tried to take him out low. McGowan stepped left and was tripped up by Glatczak’s glancing blow that sent the tight end falling forward. McGowan’s momentum from the hit spiraled him into an unintentional summersault. Related document \nBox score: Baylor 66, Kansas 7 ( .PDF ) \n“I told myself if he stays up high, I’d run him over,” said McGowan, a native of Amarillo, Texas. “If he went down low, I’d either hurdle him or side-step him. I’m not very good at hurdling, so I thought I’d side-step him.” \nThe play moved McGowan up the sports-celebrity ladder he first appeared on with an 18-yard TD reception vs. Michigan State in the Cotton Bowl. \nSeveral KU players approached McGowan after the game. \n“They just come up and congratulated me,” McGowan said. ‘(Said) nice touchdown.’ Even some of their fans were calling my name wanting to talk to me. It’s fun. People enjoy seeing somebody who’s not normal do stuff that normal people do. Nobody abnormal’s scoring touchdowns right now, except for me.” \nThe only thing abnormal about the humble, friendly Bear is his size. He said he was getting “anxious” to catch his first pass and added, “you never know when it’s going to come. One play I might be running up hitting you in the face. The next play I might be slipping right past you and catching a touchdown. It always keeps you on your heels. You just never know.” \nMcGowan wears a size 20 shoe, so it shouldn’t be difficult to hear him coming, but by the time KU spotted him, it was too late. \n— See what people were saying about the game during the KUsports.com live blog . More news and notes from Kansas vs. No. 3 Baylor", "external_links": [], "published": "2015-10-11T03:22:00.000+03:00", "crawled": "2015-10-11T05:58:30.252+03:00", "highlightTitle": ""}