{"organizations": [], "uuid": "aab00a03bb6fc2bee4aad9709c6578fd0e8c87e9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.capecodtimes.com", "main_image": "http://www.capecodtimes.com/storyimage/CC/20151022/SPORTS/151029731/AR/0/AR-151029731.jpg", "site_section": "http://www.capecodtimes.com/sports/high-school?template=rss&mime=xml", "section_title": "Local Sports - capecodtimes.com", "url": "http://www.capecodtimes.com/article/20151022/SPORTS/151029731/101036?rssfeed=true", "country": "US", "title": "Potter's goal sends Sharks to field hockey win over Mashpee", "performance_score": 0, "site": "capecodtimes.com", "participants_count": 1, "title_full": "Potter's goal sends Sharks to field hockey win over Mashpee", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T18:12:00.000+03:00", "replies_count": 0, "uuid": "aab00a03bb6fc2bee4aad9709c6578fd0e8c87e9"}, "author": "Cape Cod Times sports@capecodonline.com", "url": "http://www.capecodtimes.com/article/20151022/SPORTS/151029731/101036?rssfeed=true", "ord_in_thread": 0, "title": "Potter's goal sends Sharks to field hockey win over Mashpee", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Potter's goal sends Sharks to field hockey win over Mashpee Comment Posted Oct. 22, 2015 at 9:54 PM Updated at 10:12 AM Posted Oct. 22, 2015 at 9:54 PM Updated at 10:12 AM » Social News HARWICH - Hannah Potter scored an individual effort goal with six minutes to play as the Monomoy Sharks edged the Mashpee Falcons 2-1 in field hockey on Thursday afternoon. Two days after dropping a 3-1 decision at the hands of Cohasset, allowing the Skippers to take the South Shore League title with just one league loss, Monomoy got a battle from Mashpee in its final league match. Chyla Hendricks’ eighth goal in three days came with six minutes to play in the opening half on an assist from CeCe Piermattei, erasing a 1-0 edge for the Sharks. Mashpee (9-7, 5-7 South Shore League) used its speed throughout to stay with Monomoy (12-3-1, 10-2 SSL). “I was impressed with their determination,” Sharks coach Cheryl Poore said. That determination, along with Hendricks’ goal, led to a 1-1 tie deep into the match, with Potter winning it with six minutes to play. The Falcons got a shot off with roughly 3:30 to play, but the ball went out of bounds and into the side of the Monomoy net. Brooke Wrightington scored her 30th goal of the season, 25 minutes into the game on an assist from Marina Small. The Sharks out-cornered Mashpee 15-2 and outshot the Falcons 17-1. “It was just a really good team effort,” Poore said, noting the strong play of Carly Tolley. Sam Fraser made over 10 stops in net for Mashpee (9-7, 5-7 South Shore League). Monomoy travels to South Yarmouth to take on Dennis-Yarmouth (10-3-1) this afternoon while the Falcons are in Yarmouth to take on Sturgis East. Martha’s Vineyard 2, Somerset Berkley 1: Lacey Dinning’s goal with 17:48 to play helped the Vineyarders overtake the Raiders in Eastern Athletic Conference action in Oak Bluffs. After going to the half in a scoreless draw, Somerset Berkley struck just 1:53 into the second. After a quick time out by Martha’s Vineyard coach Lisa Knight, the Vineyarders responded 1:30 later on a goal by Juniper Ezanno. Ezanno knocked home a ball from Genny Kent to knot the game at 1-1. Dinning then blasted home a pass from sister Belle with 17:48 remaining and every player on the field stepped up for the Vineyarders thereafter, according to Knight, to hold of the Raiders for the win. Julia Bettencourt earned the win in net for Martha’s Vineyard, now 10-3-1. GIRLS HIGH SCHOOL VOLLEYBALL Falmouth 3, Nauset 0: The Clippers used a strong overall team affort to beat the Warriors in North Eastham, 27-25, 25-10, 25-23. Junior Kerry Shanahan led the charge for Falmouth (2-13, 2-6 Atlantic Coast League) with 14 digs while sophomore Natalie Gagnon added three blocks and senior captain Kassie Gaudet added 10 assists. Falmouth travels to Bridgewater-Raynham on Tuesday for a non-league match while Nauset (4-12, 0-9 ACL) hosts St. John Paul II on Monday Sturgis West 3, Upper Cape 1: The Navigators limited their mistakes after dropping the opening game to the Rams, going on to a victory at the Hyannis Youth & Community Center, 15-25, 25-13, 25-20, 27-25. Senior Lydia Brox helped settle the team down with consistent all-around play and senior leadership, according to coach Scott Turley. Junior right side hitter Gabi Boucher helped Sturgis West improve to 4-8 with 12 points at the service line while senior middle hitter Shannon Saffle added a pair of blocks and strong net defense. Amelia McFarlane led Upper Cape (9-9) with 14 service points and six hits, while Jillian Lizotte had 13 kills and four blocks, Molly Horn had 12 service points to go along with an ace, five hits, four kills and three blocks. Erika Knell had seven blocks, four hits and a kill. The Navigators travel to Mattapoisett to take on non-league foe Old Rochester next Wednesday while the Rams host Cape Tech on Monday in their Dig Pink game. By Cape Cod Times", "external_links": [], "published": "2015-10-23T18:12:00.000+03:00", "crawled": "2015-10-23T22:23:33.966+03:00", "highlightTitle": ""}