{"organizations": ["Sooners"], "uuid": "2729f267a4f06c6f78ee026a02bc76c2ab6c584a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxsports.com", "main_image": "http://a.fssta.com/content/dam/fsdigital/RSN/Southwest/2015/10/03/100215-SW-CFB-Charlie-Strong-PI.vresize.1200.675.high.94.jpg", "site_section": "http://api.foxsports.com/v1/rss?partnerKey=zBaFxRyGKCfxBagJG9b8pqLyndmvo7UU&tag=southwest", "section_title": "FOX Sports Digital", "url": "http://www.foxsports.com/southwest/story/3-things-we-learned-monday-from-the-sooners-101215", "country": "", "title": "3 things we learned Monday from the Sooners", "performance_score": 0, "site": "foxsports.com", "participants_count": 0, "title_full": "3 things we learned Monday from the Sooners", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T21:53:00.000+03:00", "replies_count": 0, "uuid": "2729f267a4f06c6f78ee026a02bc76c2ab6c584a"}, "author": "", "url": "http://www.foxsports.com/southwest/story/3-things-we-learned-monday-from-the-sooners-101215", "ord_in_thread": 0, "title": "3 things we learned Monday from the Sooners", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Andrew Gilman"], "text": "3 things we learned Monday from the Sooners By Andrew Gilman Oct 12, 2015 at 2:53p ET 0Shares \n1. Bob Stoops said his players were ready on Saturday \nOklahoma had a player fall down and another drop a pass on its first series against Texas Saturday in the Cotton Bowl. \nOU ran for less than 2 yards per carry and gained less than 300 yards of total offense against a team that was allowing more than 500 per game. \nTexas came in to Saturday's game in the Cotton Bowl 1-4 and having lost 50-7 the previous week to TCU. \nCenter Ty Darlington said his team didn't have the edge it needed and quarterback Baker Mayfield said, \"We came out a little flat and didn't execute.\" \nBut coach Bob Stoops said his team was ready to play. \nWhat's going on here? \n\"The bottom line is we got out-executed,\" Stoops said. \"I didn't feel that way (that his team wasn't ready). It appears they (Texas) are excited and we're not. That's young people. I don't buy that they weren't ready to play. I don't (think we came out flat). That's an excuse. I didn't feel that way.\" \n2. Hope is not lost? \nOK, the Sooners were all saying the right things Monday at their weekly media session, suggesting not only that there's plenty of season left, but they still have a shot to accomplish something. \nTo make the case, Mayfield referenced an Oklahoma team he wasn't part of and Stoops referenced a game against Texas in which his team won. \n\"Two years ago we lost this game and went on to win the Sugar Bowl,\" said Mayfield of the 2013 Sooners who lost to Texas, despite being a double-digit favorite, just like this season. \nMayfield joined the Sooners last season as a walk-on. The 2013 Sooners were quarterbacked in that Sugar Bowl win by Trevor Knight . OU lost to Texas and Baylor, but rallied to get a BCS berth after beating Oklahoma State and Kansas State in the last two Big 12 games. \nAs for last year? Well, Stoops said the Sooners beat Texas but didn't go on to greatness. \nMayfield went on to say the captains of the team all spoke after the game and Stoops and offensive coordinator Lincoln Riley both referenced Ohio State from last year. The Buckeyes lost to Virginia Tech, an unranked team, and went on to win the national championship. \nOklahoma plays at two-loss Kansas State on Saturday. \n3. It's time to play 'old' friend Bill Snyder \nBob Stoops has been a head coach since 1999, but there's no way he's going to be coaching as long as his former boss – Bill Snyder at Kansas State. \nSnyder turned 76 last week. Stoops is 55 has won a national title and more than a handful of Big 12 titles. He's also won each of the four BCS bowl games. \nSo why not keep it going for another 20 or so years? \n\"Because of you guys,\" Stoops said pointing toward the media. \nPerhaps Stoops was a bit more confrontational about his future, considering the Sooners are coming off a major disappointment, a 24-17 loss to Texas Saturday in the Cotton Bowl.", "external_links": [], "published": "2015-10-12T21:53:00.000+03:00", "crawled": "2015-10-13T03:14:36.548+03:00", "highlightTitle": ""}