{"organizations": ["Associated Press"], "uuid": "040d68ac6e6ead9ec286ab2f514c1a0b04893fa6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.fox23.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/04/30/04/ea/FOX23com200X200.png", "site_section": "http://www.fox23.com/list/rss/sports/oklahoma-sports/aLWK/", "section_title": "Oklahoma Sports", "url": "http://www.fox23.com/ap/ap/texas/not-much-defending-in-big-12-with-so-many-top-offe/nn3fK/", "country": "US", "title": "Not much defending in Big 12 with so many top offenses", "performance_score": 0, "site": "fox23.com", "participants_count": 0, "title_full": "Not much defending in Big 12 with so many top offenses", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T06:29:00.000+03:00", "replies_count": 0, "uuid": "040d68ac6e6ead9ec286ab2f514c1a0b04893fa6"}, "author": "", "url": "http://www.fox23.com/ap/ap/texas/not-much-defending-in-big-12-with-so-many-top-offe/nn3fK/", "ord_in_thread": 0, "title": "Not much defending in Big 12 with so many top offenses", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["STEPHEN HAWKINS"], "text": "Updated: 10:30 p.m. Wednesday, Oct. 14, 2015 | Posted: 10:29 p.m. Wednesday, Oct. 14, 2015 Not much defending in Big 12 with so many top offenses ﻿ By STEPHEN HAWKINS The Associated Press \nMost people credit Paul \"Bear\" Bryant for coining the phrase: \"Defense wins championships.\" What usually gets overlooked is the rest of what the legendary coach said right before that: \"Offense sells tickets.\" \nIf that's the case, most Big 12 teams should be selling a lot of tickets. Being a defensive coordinator in the Big 12 has to be a headache-inducing experience. The 10-team league is filled with spread formations and it has the three most productive offenses at any level in college football. \nBaylor averages 725 total yards per game, followed by Texas Tech (631.7 ypg) and TCU (615.5 ypg) — and they are the highest-scoring FBS teams, too. West Virginia, Oklahoma and Oklahoma State are also among the top 25 FBS teams for total offense. \nGames involving Big 12 teams this season have averaged 66.1 points and a whopping 906.2 combined total yards — easily the highest among power five conferences, according to STATS. Counting only the games matching Big 12 teams against each other, the numbers are even higher — 72.9 points and 936.1 yards per game. \nOf course, the Big 12 also has four teams ranked near the bottom in FBS when it comes to total defense. Winless Kansas (allows 556.6 yards per game) and Texas Tech (566.7) are in the bottom five, ahead of only New Mexico State, SMU and Texas State. \nThe other power five conferences have a combined total of five teams in that bottom group defensively — four from the Big Ten, one from the Pac-12 and none from either the ACC or SEC, both 14-team leagues. \nIn total offense, here are how the other power five conferences compare to the Big 12 through the first six weeks this season, according to STATS: \nPac 12 — 58.3 points per game and 836.7 yards per game overall; 64.3 points and 885.5 yards in league games. \nSEC — 52.8 ppg and 759.4 ypg overall; 47.9 points and 765.7 yards in league games. \nACC — 51.7 ppg and 717.5 ypg overall; 39.2 points and 636.4 yards in league games. \nBig Ten — 49.7 points and 750.7 ypg overall; 42.0 points and 701.2 yards in league games. \nSince Big 12 play started three weeks ago, the winning team has scored at least 50 points in half of the 12 games that count in the conference standings. There were at least 97 combined points in four of those games. \nSecond-ranked Baylor (5-0) and third-ranked TCU (6-0), the defending Big 12 co-champions, have both scored at least 50 points in five consecutive games for the first time ever. The Bears, also the national leader in total yards and scoring the past two seasons, have surpassed 60 points their last four games. \nTCU opened Big 12 play Sept. 26 with a 55-52 win at Texas Tech, and the Frogs are coming off a 52-45 win at Kansas State. \nWhen the Horned Frogs joined the Big 12 in 2012, they had led the nation in total defense five times — only Alabama has done so more (six). And all of that has come under Gary Patterson, their 15th-year head coach who still oversees the defense like he has since he was the coordinator from 1998-2000. \nThe Frogs were winning Mountain West Conference championships when becoming only the third team to lead the nation in total defense three consecutive seasons, from 2008-10. In its inaugural Big 12 season in 2012, TCU led the league in total defense allowing 323.9 yards per game. \nWhen sharing the conference title last year, the Frogs led the Big 12 again in total defense giving up 341.8 yards per game — over 100 yards more than they had allowed when leading the nation from 2008-10. \nPlagued by injuries on defense this season, TCU is fifth in the Big 12 and 63rd nationally in total defense, giving up 387 yards per game. \nStill, the Frogs are selling plenty of tickets and apparently still have enough defense to compete for another Big 12 championship — and maybe a national title as well. Copyright The Associated Press Sign up for our FOX23 News This Morning Newsletter Sign Up", "external_links": [], "published": "2015-10-15T06:29:00.000+03:00", "crawled": "2015-10-16T10:48:12.775+03:00", "highlightTitle": ""}