{"organizations": [], "uuid": "4690126ca479aefe57098f23bafc0deb03dd2e65", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.winnipegfreepress.com", "main_image": "http://media.winnipegfreepress.com/designimages/fb-og-image.png", "site_section": "http://www.winnipegfreepress.com/rss/?path=/sports", "section_title": "Winnipeg Free Press: Sports", "url": "http://www.winnipegfreepress.com/sports/slimmed-down-lowry-scores-26-points-in-raptors-pre-season-win-over-clippers-330595541.html", "country": "US", "title": "Slimmed-down Lowry scores 26 points in Raptors' pre-season win over Clippers", "performance_score": 0, "site": "winnipegfreepress.com", "participants_count": 1, "title_full": "Slimmed-down Lowry scores 26 points in Raptors' pre-season win over Clippers - Winnipeg Free Press", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T23:43:00.000+03:00", "replies_count": 0, "uuid": "4690126ca479aefe57098f23bafc0deb03dd2e65"}, "author": "Lori Ewing, The Canadian Press", "url": "http://www.winnipegfreepress.com/sports/slimmed-down-lowry-scores-26-points-in-raptors-pre-season-win-over-clippers-330595541.html", "ord_in_thread": 0, "title": "Slimmed-down Lowry scores 26 points in Raptors' pre-season win over Clippers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "VANCOUVER - Kyle Lowry showed what a summer of slimming down can do.\nThe point guard, who turned heads when he showed up at training camp significantly leaner than when he left last season, scored 26 points to lift the Raptors 93-73 over the Los Angeles Clippers in Toronto's pre-season opener on Sunday.\nLowry thoroughly dominated in his 21 minutes, slashing through defenders with ease and moving with a fluidity acquired over a summer of healthy eating and gruelling workouts.\nThe all-star guard, whose play deteriorated over the second half of last season, shot 7-for-10 from the field, and 11-for-12 from the free throw line.\nJonas Valanciunas, who's fresh off a strong EuroBasket performance that saw Lithuania win silver and earn an Olympic berth, grabbed 12 rebounds to go with 10 points. Luis Scola scored 13 points, and DeMar DeRozan finished with 11.\nOff-season acquisitions DeMarre Carroll, Bismack Biyombo, Scola, and Canadian Cory Joseph all had solid debuts.\nJJ Redick led the Clippers with 15 points, while Blake Griffin — who knocked the shot clock off its mooring with a thunderous dunk during warmup — added 14.\nLowry led the way with 11 points in a first quarter that saw the Raptors lead 24-16. Toronto took a 40-34 lead into halftime, and had assembled a 77-62 advantage by the end of the third quarter.\nThe game drew a capacity crowd of 19,000 that included former Vancouver Grizzlies guard Mike Bibby. Fans waved \"We The North\" banners. They booed Toronto's arch-enemy Paul Pierce — who led the Washington Wizards in a sweep of the Raptors in last season's playoffs.\nThe Grizzlies played in Vancouver for six seasons before moving to Memphis, and Sunday's crowd was dotted with the old Grizzlies jersey.\nClippers coach Doc Rivers, who both coached and played in games in Vancouver, said he hopes the NBA returns to the west coast city.\n\"It's an amazing city. Without saying too much, I miss Vancouver. It's just a great city, it really is. It's vibrant, it's just nice. Deserves a team, along with Seattle,\" Rivers said.\nThe pre-season game was the first of four in the NBA's Canada pre-season series.\nAndrew Wiggins and the Minnesota Timberwolves will play the Bulls in Winnipeg next Saturday. The Raptors face the T'Wolves in Ottawa on Oct. 14. And the Raptors cap the series when they play the Washington Wizards in Montreal on Oct. 23.\nThe final three games are expected to sell out as well.\nNOTES: Anthony Bennett (shoulder) and James Johnson (Achilles tendon) both sat out the game. . . The Raptors play the Golden State Warriors in San Jose on Monday.\n ", "external_links": [], "published": "2015-10-04T23:43:00.000+03:00", "crawled": "2015-10-05T05:46:10.297+03:00", "highlightTitle": ""}