{"organizations": [], "uuid": "03c48b028e204a1222cc74e7e5e6c654344df659", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.torontosun.com", "main_image": "http://storage.torontosun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297750180912_LARGE_BOX.jpg?quality=80&stmp=1443837704772&size=100x", "site_section": "http://www.torontosun.com/sports/tennis", "section_title": "Tennis | Sports | Toronto Sun", "url": "http://www.torontosun.com/2015/10/02/baseball-saturday----top-5-toronto-blue-jays-moments-from-regular-season", "country": "CA", "title": "Baseball Saturday -- Top-5 Toronto Blue Jays moments from regular season | Baseb", "performance_score": 0, "site": "torontosun.com", "participants_count": 1, "title_full": "Baseball Saturday -- Top-5 Toronto Blue Jays moments from regular season | Baseb", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T09:35:00.000+03:00", "replies_count": 0, "uuid": "03c48b028e204a1222cc74e7e5e6c654344df659"}, "author": "torontosun.com", "url": "http://www.torontosun.com/2015/10/02/baseball-saturday----top-5-toronto-blue-jays-moments-from-regular-season", "ord_in_thread": 0, "title": "Baseball Saturday -- Top-5 Toronto Blue Jays moments from regular season | Baseb", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Even before the first playoff pitch is thrown out, this has been a season to remember for the Toronto Blue Jays.\nThe Jays 2015 slate — which wraps up with game No. 162 on Sunday in Tampa — has been chock-full of great moments.\nThere was Josh Donaldson’s Superman leap into the stands to nab a foul pop-up during a game against the Tampa Bay Rays back in June. There was Josh Donaldson’s Superman slide to score from third on a pop-up to very shallow centre in a game a month ago against the Cleveland Indians. There was Josh Donaldson’s Superman timing, emerging from a phone booth in the bottom of the ninth at Rogers Centre to save the day with a walk-off home run in the Jays final regular-season home game.\nOK, so we could put together an all-Donaldson top-five list if we wanted, but in the spirit of this team game of ours, the final edition of Baseball Saturday for the season presents its top-five Jays moments from this past regular season.\n1. JUNE 12 -- Comeback for the ages\nIt certainly appeared as though the Jays eight-game win streak was about to end. With Drew Hutchison on the mound at Fenway Park in Boston, the Jays found themselves down 5-0 to the Red Sox after just an inning and then behind 8-1 when Hutchison was finally pulled in the third. The Jays got three runs in the fifth to pull to within four. So you’re tellin’ me there’s a chance?! Indeed, the Jays kicked the door open in the seventh inning when the first six batters all hit safely en route to a nine-run inning and, ultimately, a 13-10 win.\n2. JULY 30 -- The Price was right\n“Am I dreaming? @DAVIDprice14 can’t wait to get you here. Welcome my friend.. It’s getting real in the #6ix #Bluejays #WeOwnTheNorth #Tdot.” Newly-acquired Jays reliever LaTroy Hawkins (@LaTroyHawkins32) tweeted those words at 10:22 a.m. the morning of July 30 in response to the latest blockbuster from GM Alex Athopoulos that plucked David Price from the Detroit Tigers. After the World Series is over — and once we find out whether or not Price re-signs with the Jays — we can debate which was the bigger get: Price or Donaldson.\n3. AUG. 29 -- Hats off to Edwin\nIf you’re a fan of ‘moments,’ and you were watching the Jays 15-1 win over the Tigers on Aug. 29 at Rogers Centre, you were smiling. Edwin Encarnacion’s grand-slam in the seventh inning made history — he joined Roy Howell as the only two Jays players to drive in nine runs in a single game — but what happened afterward was equally memorable and quintessentially Canadian. With Edwin in the dugout, hats rained down onto the field celebrating his third home run of the game. When Encarnacion was informed what a ‘hat-trick’ was, he couldn’t help but smile along with the rest of us.\n4. SEPT. 23 -- Russell Martin's home run\nIt may not be the biggest home run he’s ever hit, but when Jays C Russell Martin hangs up his mitt at the end of his career, it will certainly be in the conversation. When the Blue Jays hooked up with the New York Yankees in the third game of a best-of-three series, the fate of the AL East was still in doubt. The teams had split the first two games, and the Jays sat 21/2 games up on the Yankees. A win by the Yanks would have brought them within striking distance with 10 games left. But Martin’s three-run blast in the seventh inning put what had been a close game up to that point, out of reach.\n5. SEPT. 30 -- Jays clinch AL East\nFocus should never be an issue for a big-league ballplayer, but during the second half of Wednesday’s doubleheader against the host Baltimore Orioles, the Jays could be forgiven if they looked like they had other things on their minds. They had already clinched the division with a win in the opener, and there was champagne waiting for them. Once the final out was recorded in the night-cap, the players retired to the locker room and uncorked the bubbly. During a beer-and-champagne-fuelled post-game interview, Donaldson, for one final time, was serenaded with chants of “MVP! MVP!” — this time by his teammates.\n3Up\n1. 1B Lucas Duda, New York Mets\nPartly fuelled by Tuesday’s two-homer game, Duda hit .375 last week blasting five home runs and collecting 13 RBI along the way.\n2. SP Jerad Eickhoff, Philadelphia Phillies\nPhillies young starter has had a nice end to the season, striking out 20 batters in his last 14 innings over the course of two starts. He won them both, of course.\n3. SP Clayton Kershaw, L.A. Dodgers\nDodgers ace – or one of them, anyway – has been lights-out over the last month: 5-1, 44 IP, 58 SO, 1.84 ERA, 0.82 WHIP.\n3Down\n1. RF Alex Rios, Kansas City Royals\nRoyals outfielder has been battling back stiffness for the last little while, and it’s showed. He has just two hits to show for his last 20 at-bats.\n2. SP Scott Kazmir, Houston Astros\nWith his Astros fighting to keep hold of one of the AL wildcards, Kazmir had a rough go in two starts: 0-2, 8 IP, 17 H, 12 R, 10 ER, 11.25 ERA.\n3. RP Danny Farquhar, Seattle Mariners\nThere were guys who put up worse numbers, but the Mariners reliever made three appearances last week and picked up the loss in all three.\nTweet of the week\n“The whole country is behind you @BlueJays! Congrats on clinching the AL East! #ComeTogether.”\nPrime Minister Stephen Harper (@pmharper) via Twitter.\njoe.langford@sunmedia.ca\nwww.twitter.com/SUNJoeLangford\nSponsored Links See All Sponsored Links\nBaseball Saturday\nBaseball Saturday -- Top-5 Toronto Blue Jays moments from regular season\nBy Joe Langford , Calgary Sun First posted: Friday, October 02, 2015 09:35 PM EDT | Updated: Friday, October 02, 2015 09:59 PM EDT\nEven before the first playoff pitch is thrown out, this has been a season to remember for the Toronto Blue Jays.\nThe Jays 2015 slate — which wraps up with game No. 162 on Sunday in Tampa — has been chock-full of great moments.\nThere was Josh Donaldson’s Superman leap into the stands to nab a foul pop-up during a game against the Tampa Bay Rays back in June. There was Josh Donaldson’s Superman slide to score from third on a pop-up to very shallow centre in a game a month ago against the Cleveland Indians. There was Josh Donaldson’s Superman timing, emerging from a phone booth in the bottom of the ninth at Rogers Centre to save the day with a walk-off home run in the Jays final regular-season home game.\nOK, so we could put together an all-Donaldson top-five list if we wanted, but in the spirit of this team game of ours, the final edition of Baseball Saturday for the season presents its top-five Jays moments from this past regular season.\n1.\nAbout the author Joe Langford Follow Joe Langford on Twitter Other Stories Baseball Saturday -- Big series brewing deep in the heart of Texas\nIf everything truly is bigger in Texas, this could be good.\n0\nBaseball Saturday -- Rookie class of 2015 has been a memorable one\nEvery once in a while a young person comes along who makes me question my own life choices.\n0\nSee more from Joe Langford »\nTop stories Popular Latest Videos NDP focuses on Toronto -- but at what price?\n0\nWill Muzzo 'money' talk?\n0\nLive: Taylor Swift at the Rogers Centre\n0\nRob Ford thrills Ford Nation -- again\n0\nBlue Jays' Game 1 starter David Price 'in good place'\n0\nOregon gunman studied mass shooters\n0\nHurricane Joaquin batters the Bahamas, expected to miss Atlantic Canada\n0\nCouncil orders signs removed for City Hall windows\n0\nRob Ford thrills Ford Nation -- again\n0\nNDP focuses on Toronto -- but at what price?\n0\nZabi Akbari - Witness To Kirby Rd Fatal Crash\nVaughan crash eyewitness\nPlenty Of Work Left For Leafs\nPat Kane Video\nRaptors media day\nMore from Blue Jays Baseball Saturday -- Top-5 Toronto Blue Jays moments from regular season 0\nBlue Jays' Game 1 starter David Price 'in good place' 0\nTroy Tulowitzki returns to Jays' lineup in Tampa 0\nHas Taylor Swift cursed the Toronto Blue Jays? 0\nTampa Bay Rays' tale in 2015: Arm trouble 0\nInside Toronto sun.com News\nHarper-Mercer studied mass shooters 0", "external_links": ["http://twitter.com/@SUNJoeLangford", "http://pubads.g.doubleclick.net/gampad/clk?id=228633661&iu=/3081/SMCO_ENUR_TSUN_EN_WEB", "http://www.twitter.com/SUNJoeLangford", "http://pubads.g.doubleclick.net/gampad/clk?id=182027221&iu=/3081/SMCO_ENUR_TSUN_EN_WEB", "http://pubads.g.doubleclick.net/gampad/clk?id=183052021&iu=/3081/SMCO_ENUR_TSUN_EN_WEB", "http://pubads.g.doubleclick.net/gampad/clk?id=182024221&iu=/3081/SMCO_ENUR_TSUN_EN_WEB"], "published": "2015-10-03T09:35:00.000+03:00", "crawled": "2015-10-03T06:05:57.827+03:00", "highlightTitle": ""}