{"organizations": [], "uuid": "c09d86c410053df202e8a78119ad0c9b1fc290c2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thestar.com", "main_image": "http://www.thestar.com/content/dam/thestar/sports/bluejays/2015/10/08/blue-jays-playoffs-a-roller-coaster-of-memories-perkins/rickey-henderson.jpg", "site_section": "http://www.thestar.com/sports/bluejays.html", "section_title": "Blue Jays | Sports | Toronto Star", "url": "http://www.thestar.com/sports/bluejays/2015/10/08/blue-jays-playoffs-a-roller-coaster-of-memories-perkins.html", "country": "CA", "title": "Blue Jays playoffs a roller coaster of memories: Perkins", "performance_score": 0, "site": "thestar.com", "participants_count": 1, "title_full": "Blue Jays playoffs a roller coaster of memories: Perkins | Toronto Star", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "c09d86c410053df202e8a78119ad0c9b1fc290c2"}, "author": "Dave Perkins", "url": "http://www.thestar.com/sports/bluejays/2015/10/08/blue-jays-playoffs-a-roller-coaster-of-memories-perkins.html", "ord_in_thread": 0, "title": "Blue Jays playoffs a roller coaster of memories: Perkins", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Two things to remember about October baseball: It never gets old and it’s never the same as it was before. Plus this time, for the first time, there’s social media to help wash down all the good times.\nAs in 1985, the first time the Toronto Blue Jays ventured past the regular season, John Gibbons’ crew reaches post-season play with a perfectly clean slate. Unlike the other times, there is zero franchise baggage, nothing for which to atone, no reason for fans to fear skeletons leaping out of closets. (They always could, obviously, but there’s no reason to expect them.) The mood is all about new possibilities among a fan base unencumbered by recent heartache. The customers had sweet rides in the past, to be sure, but this time it seems a little louder, a little more out of control, maybe even a little more fun.\nFor those who don’t mind a history lesson, it’s worth reviewing those past trips to October.\nThe first was taken in 1985, a 99-win team that cleared .500 to stay on April 24, took first place for good by May 12 and led by as many as nine games in August before creeping home to win by two games over the Yankees. The scars of the expansion era had mostly healed by this point in the franchise’s existence. Young, home-grown talent, plus a few budding stars purloined from other teams by Pat Gillick and his sharp-eyed Rule 5 scavenging, had produced a team that appeared capable of such a feat. Still, it was the first time and the party was a blowout that day at Exhibition Stadium.\nDavid Cooper\nIn Oct. 10, 1985, the Blue Jays raced from the dugout to greet a hatless Lloyd Moseby after he had roared home from second with the winning run in the 10th inning. This was the first year the Jays made the post-season.\nAfter that, though, came the deluge. The Blue Jays famously blew their 3-1 lead in the American League Championship Series — we used to simply call them the playoffs — and lost to Kansas City. That collapse was merely the start of the heartbreak to follow.\nBriefly, the 1986 team under new manager Jimy Williams was sluggish from the start, climbed within 3 ½ games on Sept. 1, then fell apart and finished fourth, 9 ½ games back . . . the next year, George Bell’s MVP season ultimately was bloodied by a record-breaking collapse, the 3 ½-game lead with seven to play that disappeared. And enough about all that . . . the 1988 team played poorly and trailed all year before winning nine of their final 10 to finish an artificial third, two games out. Chief heartache here was Dave Stieb losing conecutive no-hitters with two outs in the ninth inning. Oh, the pain.\nWhich brings us to 1989 and the second sip of playoffs, albeit a team that did it like no other Jays club. Cito Gaston took over a 12-24 team from Williams and it laboured until Aug. 15 to crack .500, at 60-59. But it went on a tear, fuelled by 11 walkoff wins — compared to seven this season — and took over first place the final day of August. They held off the Orioles to win by two games, at which point Rickey Henderson showed up in the ALCS. It wasn’t pretty. Rickey stole bases standing up and the Jays folded meekly in the playoffs.\nFrustration was growing among the fan base and it rose again as the team staggered late in 1990. Still in first place through 156 games, the Jays were outfinished by Boston and missed by two games. Clubhouse confidence was demonstrated by the otherwise unspeakable Junior Felix, who in mid-September passed out wedding invitations to teammates to his own nuptials — for an October date the same day a World Series game was scheduled. No one was surprised.\nAll those disappointments caused an enormous trigger to be pulled at the winter meetings, Joe Carter, Roberto Alomar and Devon White coming aboard for 1991. The new-look team started nicely, took over first place by mid-June and led by eight games in mid-July, winning easily. Alas, old problems arose in the ALCS. The Jays ignored Juan Guzman, selected Tom Candiotti and the knuckleballer panicked and threw only fastballs. The Twins teed off. The Jays were 0 for 3 post-seasons and this one hurt the most because they clearly had the better team.\nDick Loek\nBlue Jays celebrate the World Series win in game six against the Philadelphia Phillies in October 1993.\nBy 1992, no more chances were being taken. The free-agent pool was entered with both feet (Jack Morris, Dave Winfield) and a 96-win team (including 10 walkoffs) with the highest payroll in baseball was never more than a half-game out of first place after opening day. They drew clear of the pack in mid-July and despite a shaky rotation that needed bolstering from David Cone in a vital trade, made it safely to the wire, winning by four games. Against old nemesis Oakland, Robbie Alomar hit the monster home run to set the ALCS on its correct path and when they got to Atlanta, everything finally got right side up for the franchise, including all pre-game flags. Yonge St. got a little crowded and all franchise demons were officially declared banished.\nThe 1993 team, vastly different from the 1992 collection but equally as hungry, jetted to 95 wins and occupied first place to stay in late July. The 847-run juggernaut (yes, a little fewer than this year’s bunch) cruised home by seven games, handled the White Sox in the ALCS and gave the Phillies a six-game haircut. This time, the fan base expected to win; any angst involved arose from a national mood change, from “I hope they win” to “they’d better win.” They did. Now, 22 years later, another chance arises.\nMore on thestar.com\nBlue Jays ace David Price ready for another post-season run\nBlue Jays rookie stopper Roberto Osuna unruffled despite recent struggles", "external_links": ["http://static.freeskreen.com/publisher/52/freeskreen.min.js"], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-08T16:10:21.251+03:00", "highlightTitle": ""}