{"organizations": [], "uuid": "3d6d07cec4ff19f3dce2792f777a626e57c53d7b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.grbj.com", "main_image": "http://www.grbj.com/ext/resources/images/Sports-Business/USFL-football-player-image.jpg?1445287777", "site_section": "http://www.grbj.com/rss/topic/158-sports-business", "section_title": "Sports Business", "url": "http://www.grbj.com/articles/83598-pro-football-league-targets-grand-rapids", "country": "US", "title": "Pro football league targets Grand Rapids", "performance_score": 0, "site": "grbj.com", "participants_count": 1, "title_full": "Pro football league targets Grand Rapids", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T23:22:00.000+03:00", "replies_count": 0, "uuid": "3d6d07cec4ff19f3dce2792f777a626e57c53d7b"}, "author": "(Pat Evans)", "url": "http://www.grbj.com/articles/83598-pro-football-league-targets-grand-rapids", "ord_in_thread": 0, "title": "Pro football league targets Grand Rapids", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Pro football league targets Grand Rapids October 19, 2015 <script  //gemini.nui.media/pipeline/1253925/0/vj?z=gemini&dim=1240189&kw=USFL&click=&abr=%24scriptiniframe\"></script><noscript><a href=\"http://gemini.nui.media/pipeline/1253925/0/cc?z=gemini&kw=USFL\"><img src=\"http://gemini.nui.media/pipeline/1253925/0/vc?z=gemini&dim=1240189&kw=USFL&click=&abr=%24imginiframe\"   The San Diego-based United States Football League, or USFL, is a developmental pro football league raising funds to launch eight teams. Photo via google.com \nA startup professional football league is eyeing Grand Rapids. \nThe United States Football League in San Diego, or USFL, said today that it is in the midst of its second phase of fundraising as the league seeks about $5 million to support the placement of teams in eight markets with strong foundations. \n\"Second chance\" at pro football \nInstead of existing as a direct competitor to the National Football League as the original USFL did, this incarnation, which is unrelated to the original USFL, would play a developmental role. \nFive of the USFL’s board members have NFL experience, and the NFL is aware of the USFL's efforts. \nNo official affiliations have been set up, but USFL President and CEO Jim Bailey didn’t rule out a deal in the future. \n“We fully plan on being self-sufficient,” Bailey said. \nThe developmental aspect would allow players who are cut from NFL team training camps to have another shot with the USFL. Bailey added that if a player were signed to an NFL team from a USFL team, they could go right away. \n“Our whole focus is to give guys a second chance,” Bailey said. \n\"Football havens\" \nThe USFL plans for the eight teams to be placed in the largest U.S. markets without an NFL or Major League Baseball franchise, Bailey said. \n“If you took a list of those qualities, you’d end up with a similar list as us, and Grand Rapids falls into that list,” Bailey said, adding the geographic position of Grand Rapids makes it an ideal fit as well. \nA strong high school football, college football and minor league culture are among the attractive attributes of the region. \n“The type of cities we are interested in are those with a strong sense of community, a deep appreciation of sports and a forward-thinking business atmosphere,” Bailey said. “We believe markets such as Salt Lake City, Tulsa or Grand Rapids can develop into football havens, much like Green Bay or Canton.” \nInvestment partners \nBailey said the investment the USFL is seeking isn’t team ownership but a partnership. They also don’t want to commit to a market before ensuring it’s a long-lasting relationship. \nThe league is planning to operate as a single-owned entity, with local management. \nBailey said the money raised could persuade a team to enter a certain market. Further research into markets will be conducted once the second phase of fundraising is complete. \n“If we get the right partner who says the team has to be in city X, that’s very persuasive,” Bailey said. “We would like partners with community connections. Right now, the research is all on paper.” \nGetting league \"in order\" \nBailey noted several leagues have started and failed in the past, primarily because they acted as direct competitors to the NFL or because they launched before being fully ready. \nHe said the USFL will not schedule an opening kickoff date until it’s fully financed and supported. \n“We’re in a catch-22. We don’t want to over hype,” Bailey said. “But we also have to make ourselves known. \n“We won’t kick off until things are in order.”  ", "external_links": [], "published": "2015-10-19T23:22:00.000+03:00", "crawled": "2015-10-20T05:22:59.767+03:00", "highlightTitle": ""}