{"organizations": [], "uuid": "ea69fbc896a312a15d68e67d15c8fa9bcb67b98d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "nypost.com", "main_image": "https://thenypost.files.wordpress.com/2015/10/bussindex.jpg", "site_section": "http://nypost.com/sports/feed/", "section_title": "| Sports | New York Post", "url": "http://nypost.com/2015/10/20/jim-buss-slams-magic-as-clock-ticks-down-on-his-lakers-reign/", "country": "", "title": "Jim Buss slams Magic as clock ticks down on his Lakers reign", "performance_score": 0, "site": "nypost.com", "participants_count": 1, "title_full": "Jim Buss slams Magic as clock ticks down on his Lakers reign | New York Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T15:28:00.000+03:00", "replies_count": 0, "uuid": "ea69fbc896a312a15d68e67d15c8fa9bcb67b98d"}, "author": "Jonathan Lehman", "url": "http://nypost.com/2015/10/20/jim-buss-slams-magic-as-clock-ticks-down-on-his-lakers-reign/", "ord_in_thread": 0, "title": "Jim Buss slams Magic as clock ticks down on his Lakers reign", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The way Jim Buss sees it, he gets all of the blame when the Lakers fail and none of the credit when they succeed.\nNow, as he insists the Lakers’ turnaround — is fully on track, he’s done with modesty — and done taking Magic Johnson’s guff .\n“I was very much part of the final decisions on all of the championships that we’ve won in the last 20 years,” Buss, the executive vice president of basketball operations, told USA Today. “I was extremely involved on both the basketball and the financial side, but there was no point for me to go out and wave my flag. It didn’t make sense to me. Now I understand that I should have, to a certain degree.”\nThe second-eldest child of Lakers patriarch Jerry Buss is forced to fend off charges of nepotism and incompetence as the NBA’s marquee franchise sinks into borderline irrelevance in Kobe Bryant’s golden years. Among the most prominent critics has been Lakers legend Johnson, vocal and disgruntled since Mike D’Antoni was picked as coach over a Phil Jackson reunion in 2012.\nMagic Johnson with Lakers draft pick D’Angelo Russell Photo: Getty Images “If Kobe came out and said, ‘Jim Buss doesn’t know what he’s doing,’ I’d be hurt as hell. He and I have worked together for 20 years,” Buss said. “Magic Johnson going nuts on me? It’s like, ‘Really, dude? My dad made you a billionaire almost. Really? Where are you coming from?’”\nMagic’s succinct response: “It’s all about winning, Jim.”\nThat same mandate guided Buss to say he would step down in the summer of 2017 if the Lakers hadn’t re-arrived as contenders, in part to appease sister Jeanie, who also was aggrieved by the situation with Jackson, her fiance. Jeanie is going to hold Jim to that timeline, even if he tries to fuzzy it.\nHe says three more seasons; Jeanie says two.\nJim: “Two more full seasons, a summer of change and then let that season go. Whatever happens in that third season, that’s fine. I have no problem with that.”\nJeanie: “Not this season, but the end of next season, which will be the summer of 2017.”\nOK, no problem, Jim says. After the embarrassment of being spurned by a parade of free agents in recent years as the LA luster wears off, Buss is bullish on No. 2 draft pick D’Angelo Russell, 2014 lottery pick Julius Randle and a 2016 free agent (Kevin Durant??) to be named later.\n“We’re ahead of [the schedule], so I’m fine with it. I think we’ve turned the corner, exactly like we have [planned]. Get a free agent next [summer], and then I think we compete,” Buss told the paper. “I’m extremely confident. … You hear what Vegas says, that we’re not supposed to make it [to the playoffs this season]. … I think we’ll surprise a lot of people. I really do.”\n  Filed under d'angelo russell ,  jeanie buss ,  kobe bryant ,  los angeles lakers ,  magic johnson", "external_links": [], "published": "2015-10-20T15:28:00.000+03:00", "crawled": "2015-10-20T23:30:58.113+03:00", "highlightTitle": ""}