{"organizations": [], "uuid": "ee91672ba82c9af9db41e6eb59075f090a8fc94e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sltrib.com", "main_image": "http://www.sltrib.com/csp/mediapool/sites/dt.common.streams.StreamServer.cls?STREAMOID=9AO1qkufKEs5XSg6OMILc8$daE2N3K4ZzOUsqbU5sYvhcyhgxq92HPCGnGthwjeBWCsjLu883Ygn4B49Lvm9bPe2QeMKQdVeZmXF$9l$4uCZ8QDXhaHEp3rvzXRJFdy0KqPHLoMevcTLo3h8xh70Y6N_U_CryOsw6FTOdKL_jpQ-&CONTENTTYPE=image/jpeg", "site_section": "http://sltrib.com//csp/cms/sites/sltrib/RSS/rss.csp?cat=Sports", "section_title": "Sports - The Salt Lake Tribune", "url": "http://www.sltrib.com/sports/3088100-155/cross-country-boys-state-titles-decided", "country": "US", "title": "Cross country: Boys state titles decided", "performance_score": 0, "site": "sltrib.com", "participants_count": 1, "title_full": "Cross country: Boys state titles decided | The Salt Lake Tribune", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "ee91672ba82c9af9db41e6eb59075f090a8fc94e"}, "author": "TOM WHARTON", "url": "http://www.sltrib.com/sports/3088100-155/cross-country-boys-state-titles-decided", "ord_in_thread": 0, "title": "Cross country: Boys state titles decided", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "After turning in the fastest time of the day on the tough Sugar House Park three-mile state meet course, American Fork junior Casey Clinger contemplated why Utah ranks among the top distance-running states in the country.\n\"We have a lot of dedicated kids willing to put in the work,\" said the new 5A individual champion after finishing in 14:52.8. \"It is a hard-work thing with great competition. Teams can only excel here.\"\nLong hours of training revealed themselves Wednesday as several hundred of Utah's top boys' runners provided a colorful scene on a beautiful autumn day chasing individual and team championships.\n  Davis, Timpanogos, Desert Hills, Millard and Panguitch claimed team titles in their respective classifications while Ogden's Alek Parsons, Pine View's Nick Hill, North Summit's Jace Richins and Monticello's Tyler Bird joined Clinger as individual champions.\nClinger said he was aware of second-place finisher Talon Hull of Weber as the 5A race came down to the wire.\n\"I knew Talon was right behind me,\" said Clinger, who finished second a year ago. \"He has an amazing kick and is a good runner.\"\nDavis, whose team T-shirt proclaimed \"all for one,\" lived up to that moniker. \nThe Darts top runner, Camred Todd, finished sixth, but teammates Logan Mackay, Colter Blanchard, Colton Rimann and Matt Ward finished in a cluster, coming in no lower than 13th.\nOgden's Alek Parsons won perhaps the most anticipated individual race of the day as he held off Timpanogos' William Handley and East's Garek Bielaczyc as he became one of only two runners to break the 15-minute mark.\nParsons had battled Bielackyc much of the season, just nipping the Leopard runner by a second in the Region Five meet. This time, though, he pulled away from Handley and Bielaczyk in the last 500 meters to win by five seconds.\n\"This season, I had to dig deep a lot,\" said Parsons, a senior, who had never won an individual state title in cross country or track before. \"This was another day and I wanted to make sure it wasn't going to come down to an eighth of a second. I definitely knew I could compete with anybody here. I didn't want that win over Garek a couple of weeks ago to affect me too much. I wanted to come back stronger in this meet.\"\nHandley led a group of five Timpanogos runners who finished in the top 10 as the Timberwolves earned a boys' title to go with their girls' championship. Joe Benson, Gabe Prettypaint, Cameron Benson and Elijah Nimmer led their team to the 4A crown.\nHill turned in perhaps the biggest surprise of the day as he captured the 3A individual title by taking the lead with about a mile left to overcome a strong challenge from Canyon View's McKade Steffensen and a host of runners from powerful Desert Hills.\n\"This is the first time I have beaten them all year,\" said the Pine View senior, who finished 11th a year ago. \"I had my mind in the right spot and my legs felt good.\nDesert Hills easily won its third straight 3A team title behind Jaiden Melendrez, Spencer Ford, Sage Ducote, Joshua Thatcher, Tanner Sharp and Bryson King, who all finished in the top 15.\nRichins, who gave up football after discovering he had a talent for distance running, called the 2A race the most difficult he ever ran due to numerous hills. He credited hard farm work for his endurance.\nCalvin Bell and Parker Stevens finished sixth and eighth, respectively, to lead Millard to the 2A team title.\nBird said Monticello's high elevation makes it much easier to breathe when he comes north to race. The senior improved on his second-place finish from a year ago.", "external_links": [], "published": "2015-10-21T03:00:00.000+03:00", "crawled": "2015-10-22T17:38:15.812+03:00", "highlightTitle": ""}