{"organizations": [], "uuid": "85a4c79526387b54c6f577e01e3ef49f0f23f9f1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reporterherald.com", "main_image": "http://extras.mnginteractive.com/live/media/site47/2015/1011/20151011__12rhscsufbfolow~1.jpg", "site_section": "http://feeds.reporterherald.com/mngi/rss/CustomRssServlet/47/244119.xml", "section_title": "Sports", "url": "http://www.reporterherald.com/sports/csu/ci_28954693/colorado-state-football-mixes-reality-expectations?source=rss", "country": "IL", "title": "Colorado State football mixes reality with expectations", "performance_score": 0, "site": "reporterherald.com", "participants_count": 1, "title_full": "Colorado State football mixes reality with expectations", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T01:23:00.000+03:00", "replies_count": 0, "uuid": "85a4c79526387b54c6f577e01e3ef49f0f23f9f1"}, "author": "Mike Brohard \n\nSports Editor", "url": "http://www.reporterherald.com/sports/csu/ci_28954693/colorado-state-football-mixes-reality-expectations?source=rss", "ord_in_thread": 0, "title": "Colorado State football mixes reality with expectations", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Colorado State football mixes reality with expectations Air Force option a hurdle for CSU By Mike Brohard \nSports Editor Posted: 10/11/2015 04:22:52 PM MDT Colorado State's Deionte Gaines gets pushed out of bounds by a Boise State defender after a gain Saturday. The Rams are still searching for ways to make the offense more explosive and the defense less prone to big plays. ( Trevor L Davis / Loveland Reporter-Herald ) \nFORT COLLINS — Colorado State has reached the halfway point, but nobody in the locker room is suggesting it's a breaking point. \nThe Rams reach the second half of the season at 2-4, 0-2 in Mountain West play. It's not where they expected to be, and first-year coach Mike Bobo has lost all interest in where expectations were and where reality currently sits. \nThere are issues that have to be ironed out in short order, and ifs and buts aren't helping as much as getting in the way. \n\"We're 2-4 and that's what we are and we need to realize that,\" Bobo said after the 41-10 loss to Boise State. \"We just keep saying we shoulda, coulda, woulda. We didn't. We're 2-4, we've got to go back to work and worry about this week and try to get this win instead of talking about what we coulda done, or shoulda done or we shoulda won these games, because we didn't. That's what we need to do.\" \nPart of the reality is the first half of CSU's schedule was the toughest half, with the six foes it has played combining for a 17-17 mark. The two teams the Rams beat are just 2-9, meaning they have played well enough to beat bad teams, not precise enough to knock off a good one. From here forward, the Rams face teams that are a combined 12-23, with the Falcons the only squad with a winning mark at 3-2. \nOnce again, Colorado State's defense gave up big plays in the loss to Boise State. Three in the first half produced touchdowns as the Broncos put the game out of reach by halftime. Offensively, the Rams lacked rhythm and still have yet to completely iron out the question at quarterback. Bobo said film will be watched and a direction decided about who the starter is. Nick Stevens had the better numbers; Coleman Key had a touchdown, but two turnovers. \nThe offense was so out of synch that receiver Joe Hansley threw the longest pass in the game (35 yards) and receiver Jordon Vaden had the longest run (16 yards). The second longest belonged to Key on a scramble, good for 14 yards. \nAfter Saturday's loss, Bobo hinted to the fact the Rams will readdress the entire offense, not just quarterback. Less turnovers are a must, as are explosive plays. How to get them the ball and be effective in doing so must be mapped out. \nFinding that game plan has been elusive, especially when it comes to being consistent with it an entire game, not just spurts. \n\"I expect out of everybody that's involved in the program to come to work. Life's not easy, things aren't handed to you on a time line like you want, change is hard,\" Bobo said. \"Right now we're going through some change and its hard, and the results are not where our players expect it or coaches expect it. We've got to regroup and you've got to play out the season. We've go to figure out what we can do to give ourselves a chance to win, because that wasn't it tonight.\" \nTo some of the players, the early part of this season has the feel of the first one under Jim McElwain, when the team went 4-8. However, that team was coming off a trio of 3-9 seasons, so it was almost viewed as progress. \nThe Rams went 10-3 last year, so they still see promise in the cloudiness of learning the new systems. \n\"It's a lot like my freshman year when we were 4-8,\" linebacker Kevin Davis said. \"We're still a very good team. We've just got to show up for four quarters. We've got to start making plays and stop the big plays from other teams.\" \nWhile Boise State didn't need a running quarterback to get going offensively, running quarterbacks hurt the Rams the two weeks prior, and naturally running the option, the Falcons have one. Same with the speed sweep. Stopping the option requires discipline, and this will be the first test to new defensive coordinator Tyson Summer's theories on how to stop it. \nThough Air Force is not going to be confused with Boise State at this point, the Falcons will bring a similarity to Saturday's game (1:30 p.m.; CBS Sports Network) that should be cause for concern for Colorado State. \nDiscipline. The Falcons are bred on it, and the Rams are lacking in the area at this point. \n\"We're going to have to match them as far as being disciplined,\" CSU receiver Joe Hansley said. \"They don't make a lot of mistakes, kind of like Boise. They're sound in what they do and they're solid. They stick to their game plan and make you play to that. Were going to match how disciplined they are.\" \nThe Rams can only hope the second half represents a fresh start.", "external_links": [], "published": "2015-10-12T01:23:00.000+03:00", "crawled": "2015-10-12T04:25:19.844+03:00", "highlightTitle": ""}