{"organizations": [], "uuid": "5589f181d7ae33fe7cb89a7dd1e8a85b1eb81153", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/", "section_title": "Ahram Online - News, Business, Culture, Sports &amp; Multimedia from Egypt ", "url": "http://english.ahram.org.eg/NewsContent/2/8/161319/World/Region/US-wants-to-avoid-total-destruction-of-Syria-Kerry.aspx", "country": "EG", "title": "US wants to avoid 'total destruction' of Syria: Kerry - Region - World", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "US wants to avoid 'total destruction' of Syria: Kerry - Region - World - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "5589f181d7ae33fe7cb89a7dd1e8a85b1eb81153"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/2/8/161319/World/Region/US-wants-to-avoid-total-destruction-of-Syria-Kerry.aspx", "ord_in_thread": 0, "title": "US wants to avoid 'total destruction' of Syria: Kerry - Region - World", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related Kerry plans trip to Middle East 'soon': State Dept Kerry: Russia, Iran might stop Assad's barrel bombs Kerry, Lavrov discussed possible 'transition' in Syria: US official The United States is working to avoid the \"total destruction\" of Syria, and plans a meeting in the coming days with Russian, Saudi and Turkish leaders to seek an end to the conflict, Secretary of State John Kerry said Monday.\n\"I will be coming back in a few days and I will meet with leaders of Russia, Turkey, Saudi Arabia and Jordan to work through... options that could perhaps reignite the political process and bring about a political transition in Syria,\" he said on a stop in Madrid.\nIn Moscow a source cited by the Ria Novosti news agency said a meeting between Kerry and the foreign ministers of Russia and Saudi Arabia -- who back opposing sides in Syria's war -- could be held \"soon\" in Vienna.\nWashington considers that it bears the responsiblity \"to try and avoid the complete and total destruction of Syria\", fearing the potential fallout across the region and a possible surge in migration, Kerry said in Madrid.\n\"We have a moral interest to try and stop this unfolding catastrophe,\" he said following talks with Spanish Foreign Minister Jose Manuel Garcia-Margallo.\nAlready 12 million Syrians -- half the population -- have been displaced by the conflict.\n\"The level of migration in Europe is dangerous in many regards (because of) the inability of countries to deal with the numbers,\" Kerry said.\n\"The threat of many more (refugees) coming if the violence continues and Syria absolutely implodes is real.\"\nKerry said the implications of that \"in long term security\" for the European Union and Syria's neighbours -- Jordan, Lebanon and Turkey -- would be \"enormous\".\nHe also said he feared the consequences of Russia's air strikes in Syria.\n\"Our fear (is that)... Russia is simply there to prop up (President Bashar al-) Assad,\" he said, warning that Moscow's air campaign might \"attract more jihadists to the fight\".\nIf Moscow is willing to \"help us find a political solution as well as... fight Daesh, then there is a possibility to try to find a way to another path\", he said, using another acronym for the Islamic State group.", "external_links": [], "published": "2015-10-19T03:00:00.000+03:00", "crawled": "2015-10-20T04:23:49.400+03:00", "highlightTitle": ""}