{"organizations": [], "uuid": "b455c0ec7a609fefae4f9ac4c5ea5f7826cbd326", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "http://images.worldnow.com/AP/images/9085064_G.jpg", "site_section": "http://www.cbs8.com/category/149655/sports", "section_title": "Sports - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30337282/nascar-kenseth-adamant-logano-wrecked-him-intentionally", "country": "US", "title": "NASCAR: Kenseth adamant Logano wrecked him intentionally", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "NASCAR: Kenseth adamant Logano wrecked him intentionally - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "b455c0ec7a609fefae4f9ac4c5ea5f7826cbd326"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30337282/nascar-kenseth-adamant-logano-wrecked-him-intentionally", "ord_in_thread": 0, "title": "NASCAR: Kenseth adamant Logano wrecked him intentionally", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By JENNA FRYER\nAP Auto Racing Writer TALLADEGA, Ala. (AP) - Joey Logano chalked up contact with Matt Kenseth as aggressive racing for a win.\nKenseth thinks Logano is a liar.\nThat's where things stood Friday at Talladega Superspeedway, where Kenseth had hardly softened his stance toward Logano after their incident at Kansas Speedway last weekend. Kenseth was racing for a win he needed to advance into the third round of NASCAR's playoffs when contact from behind from Logano caused him to spin.\nLogano went on to win the race and maintained it was accidental contact, a product of hard racing.\n\"Someday he might mature a little bit,\" Kenseth said Friday. \"He should have stopped running his mouth ... and, he's lying when he said he didn't do it on purpose because he lifted (my) tires off the ground. He's too good a race car driver to do that by accident.\"\nLogano has won two consecutive races and had already earned his berth into the third round of the Chase for the Sprint Cup championship. Kenseth had a poor showing in the opening race of the second round, and was in desperate need of the victory last Sunday at Kansas.\nInstead, he finished 14th and is now last in the 12-driver field headed into Sunday's race at Talladega, after which four drivers will be cut from the field.\nA victory Sunday is Kenseth's only guarantee to continue his championship chances, but he could advance depending on how other Chase drivers fare. Even with the stakes so high, he's not conceding anything in his run-in with Logano.\n\"I wouldn't have done anything differently because I didn't do anything wrong,\" Kenseth said. \"I did everything I was supposed to do. I tried to get away. He drove the car in the wall himself twice. I don't know how you can possibly either block someone or put somebody in the wall when they're not up alongside you - it's pretty talented if you can do that when somebody's four feet behind you.\n\"So, no, I did everything I could to win the race. That's the way I'd race to win any race - race as hard as you can and do whatever you can, be clean about it and go as fast as I could go and that's all I was doing. I got hit from behind. I couldn't do anything about that.\"\nKenseth said he's not spoken to Logano - but he indicated at Kansas there was nothing for the two drivers to discuss - and he had no interest in NASCAR chairman Brian France's take on the situation.\nFrance has been pushing for aggressive racing and he referred to Logano's move at Kansas as \"quintessential.\" Kenseth said he needed the definition of \"quintessential.\"\n\"I wasn't very good in high school. I barely made it through Cambridge (Wisconsin) High School, so I'd have to Google that word first to find out,\" he deadpanned. \"Once I learn what that means, then I can probably answer that better.\"\n ", "external_links": [], "published": "2015-10-23T03:00:00.000+03:00", "crawled": "2015-10-24T01:57:36.560+03:00", "highlightTitle": ""}