{"organizations": ["Jets"], "uuid": "6fddcad117147bc1c5683930b3eeb58e6251dead", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pendletontimespost.com", "main_image": "", "site_section": "http://pendletontimespost.com//feed/sec/6000/", "section_title": "PendletonTimesPost.com - Sports News", "url": "http://www.pendletontimespost.com/view/story/ce1c178cea9d489b9b59a25796c09317/HKN--Wild-Jets/", "country": "US", "title": "Stafford scores twice, Jets beat Wild 5-4", "performance_score": 0, "site": "pendletontimespost.com", "participants_count": 0, "title_full": "Stafford scores twice, Jets beat Wild 5-4", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T04:32:00.000+02:00", "replies_count": 0, "uuid": "6fddcad117147bc1c5683930b3eeb58e6251dead"}, "author": "", "url": "http://www.pendletontimespost.com/view/story/ce1c178cea9d489b9b59a25796c09317/HKN--Wild-Jets/", "ord_in_thread": 0, "title": "Stafford scores twice, Jets beat Wild 5-4", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Stafford", "Drew Stafford"], "text": "Drew Stafford scores twice, Jets hold on to beat Wild 5-4 THE ASSOCIATED PRESS   10:31   10:32   \nPeople: \nClick to view (6 Photos) \nWINNIPEG, Manitoba — Drew Stafford's starting to become one of his coach's most relied upon players. \nStafford scored twice, Blake Wheeler had two assists and the Winnipeg Jets held off the Minnesota Wild 5-4 on Sunday. \nMinnesota's Jason Zucker scored 10 seconds into the game, but then Winnipeg got five consecutive goals. \nBryan Little tied it 1:22 into the first, Andrew Ladd scored about 2 minutes later and Nikolaj Ehlers made it 3-1 Jets (5-2-1) midway through the period. \nStafford had a goal 51 seconds into the second, chasing Wild goalie Darcy Kuemper. Stafford scored again on Devan Dubnyk just under 4 minutes later for his team-leading fifth goal this season. \n\"Outstanding,\" coach Paul Maurice said when asked about Stafford's contributions. \"He's found that (quality) that will make a player very, very valuable, a guy who has the ability to put pucks in the net, to play in that role. \n\"He hasn't cheated anything for that (success).\" \nWheeler extended his season-opening point streak to a franchise-record eight games. Michael Hutchinson made 26 saves for Winnipeg. \nMikko Koivu, Justin Fontaine and Zach Parise also scored for Minnesota (5-2-1). \nParise said the Wild just couldn't match Winnipeg's speed in the first 25 minutes of the game. \n\"It felt like they were coming at us 100 mph through the neutral zone and we were flat-footed,\" he said. \"They did a good job of jumping (defensemen) into the rush, too, so it just put us on our heels.\" \nThe up-tempo Jets struggled once they built the four-goal lead. Winnipeg's attack is based on speed, and it struggled once the situation called for a prevent-defense approach. \n\"When they slow the game down and take the life out of it, it's hard as the team in the lead to keep that pace and keep your foot on the gas, especially when the score is that high,\" Stafford said. \n\"We let them off the hook for a little bit and they were able to turn it around on us but at the same time, we were able to finish it off so it's all good.\" \nStafford got his first goal on a snap shot from the top of the circle. His other score came after Dustin Byfuglien powered through two defenders to enter the zone. Stafford ended up with the puck, skated to the slot and flipped it past Dubnyk. \nLittle scored after Kuemper pokechecked the puck and it jumped into the air. The puck bounced off Little, then popped over Kuemper and in. \nLadd put Winnipeg ahead by finding a loose puck at the top of the crease and tapping it past a screened Kuemper. \nEhlers later snapped a quick shot past Kuemper's blocker on a 2-on-1 rush. \nWinnipeg outshot Minnesota 17-9 in the first period. \nKuemper and Dubnyk each had 14 saves. \nKoivu and Fontaine scored 38 seconds apart in the second period. \nNotes: Winnipeg is now 2-1-1 during its season-long six-game homestand. . The Jets host the Los Angeles Kings on Tuesday. . Wheeler's point streak to start the season surpasses the seven-game streak of former Atlanta Thrasher Donald Audette in 2000-01. . Little's assist on Ladd's first-period goal was the 200th of his NHL career. \nAll content copyright ©2015 Pendleton Times-Post, a division of Home News Enterprises unless otherwise noted.", "external_links": [], "published": "2015-10-26T04:32:00.000+02:00", "crawled": "2015-10-26T05:21:25.957+02:00", "highlightTitle": ""}