{"organizations": ["Regain Top Billing Against Scotland INDEX Springboks"], "uuid": "ac1b100cc417764e5a0a964f42593d7b31612745", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "jakartaglobe.beritasatu.com", "main_image": "http://img.thejakartaglobe.com/2015/10/RUGBYU-WC-2015-RSA-TRAINING-143828-01-02-1024x682.jpg", "site_section": "http://jakartaglobe.beritasatu.com/rss/sports/", "section_title": "Sports | Jakarta Globe", "url": "http://jakartaglobe.beritasatu.com/rugby/springboks-regain-top-billing-scotland/", "country": "ID", "title": "Springboks out to Regain Top Billing Against Scotland", "performance_score": 0, "site": "beritasatu.com", "participants_count": 0, "title_full": "Springboks out to Regain Top Billing Against Scotland", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T06:21:00.000+03:00", "replies_count": 0, "uuid": "ac1b100cc417764e5a0a964f42593d7b31612745"}, "author": "", "url": "http://jakartaglobe.beritasatu.com/rugby/springboks-regain-top-billing-scotland/", "ord_in_thread": 0, "title": "Springboks out to Regain Top Billing Against Scotland", "locations": ["Scotland", "Gateshead International Stadium", "Gateshead", "South Africa", "north east England"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Angus MacSwan", "Handre Pollard"], "text": "INDEX Springboks out to Regain Top Billing Against Scotland i South Africa's flyhalf Handre Pollard attends a training session at the Gateshead International Stadium in Gateshead, north east England, on September 30, 2015 during the Rugby World Cup 2015. (AFP Photo/Lionel Bonaventure) By : Angus MacSwan | on 5:21 PM October 02, 2015 Category : Sports , Rugby \nLondon. Twice world champions South Africa seek to reassert their standing as a pre-eminent power when they take on Scotland in their Rugby World Cup crunch game on Saturday. \nA win in Newcastle would put the Springboks comfortably back on track to qualify for the knockout stage of the tournament, continuing their redemption after the shock defeat at the hands of Japan in their opening Pool B match. \nThe Springboks restored a measure of pride with a 46-6 win over Samoa, but the potential for another slip against the Scots and the prospect of an ignominious early exit is not lost on hooker Schalk Brits. \n\"For us, it's our final,\" Brits said this week. \"We are in this position and we're ready to fight and make our country proud.\" \nScotland lead Pool B with maximum points from victories against Japan and the United States, twice overcoming shaky starts with displays of such attacking verve that even Brits was moved to admit his fondness for watching them play. \n\"They're playing some very good rugby,\" the Springbok forward said, adding that the Scots' Kiwi coach Vern Cotter has instilled a compelling combination of discipline and attacking freedom. \nRecent history points to South Africa as firm favourites, with four wins in their past five meetings, the most recent of which was last year's 55-6 drubbing in Port Elizabeth. \nScotland captain Greig Laidlaw is under no illusions about the task facing his team. \n\"It's going to be a hugely physical contest, a tough game,\" he said. \"They blew a physical Samoan team off the park. We understand how tough the challenge is but it's one we're ready to take.\" \nDefeat on Saturday would not be the end of the world for the Scots. Victory in their final game against Samoa would secure a place in the quarter-finals, though that would be no foregone conclusion against the proud Pacific Islanders. Samoa have claimed notable top-tier scalps in the past and could still be in the hunt for a place in the last eight going into that game. \nThe combative nature of the tournament continues to take its toll, meanwhile, with South Africa and Scotland no exception. \nSpringboks captain Jean de Villiers broke his jaw against Samoa and has called time on his international career, while Scotland lock Grant Gilchrist misses the rest of the tournament because of a groin injury. \nAnother blow for Scotland is an ankle injury that keeps flyhalf Finn Russell out of Saturday's side, the 23-year-old playmaker replaced by Duncan Weir among Cotter's 10 changes from the side that beat the United States. \nSouth Africa coach Heyneke Meyer has made three changes from the starting line-up against Samoa. Bismark du Plessis steps in for Adriaan Strauss at hooker, Lodewyk de Jager replaces Victor Matfield in the second row and fit-again Jesse Kriel comes in for De Villiers at outside centre. Scrum-half Fourie du Preez takes over the captaincy. \n\nTeams: \nSouth Africa: 1-Tendai Mtawarira, 2-Bismarck du Plessis, 3-Jannie du Plessis, 4-Eben Etzebeth, 5-Lodewyk de Jager, 6-Francois Louw, 7-Schalk Burger, 8-Duane Vermeulen, 9-Fourie du Preez (captain), 10-Handre Pollard, 11-Bryan Habana, 12-Damian de Allende, 13-Jesse Kriel, 14-JP Pietersen, 15-Willie Le Roux \nReplacements: 16-Adriaan Strauss, 17-Trevor Nyakane, 18-Frans Malherbe, 19-Pieter-Steph du Toit, 20-Willem Alberts, 21-Ruan Pienaar, 22-Pat Lambie, 23-Jan Serfontein \nScotland: 1-Gordon Reid, 2-Fraser Brown, 3-Willem Nel, 4-Richie Gray, 5-Jonny Gray, 6-Josh Strauss, 7-Blair Cowan, 8-David Denton; 9-Greig Laidlaw (captain), 10-Duncan Weir, 11-Tim Visser, 12-Matt Scott, 13-Richie Vernon, 14-Tommy Seymour, 15-Stuart Hogg \nReplacements: 16-Ross Ford, 17-Alasdair Dickinson, 18-Jon Welsh, 19-Tim Swinson, 20-Ryan Wilson, 21-Sam Hidalgo-Clyne, 22-Peter Horne, 23-Sean Lamont \nReuters", "external_links": [], "published": "2015-10-02T06:21:00.000+03:00", "crawled": "2015-10-02T17:47:21.598+03:00", "highlightTitle": ""}