{"organizations": [], "uuid": "6506e3bf5738ff2a37ed378df1c4e4c3373378e8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "http://www.bostonherald.com/sites/default/files/media/ap/b01f045a5ebd404a8a3279763027c486.jpg", "site_section": "http://bostonherald.com/sports/red_sox_mlb", "section_title": "Sports: Red Sox &amp; MLB | Boston Herald", "url": "http://bostonherald.com/sports/red_sox_mlb/mlb_coverage/2015/10/leading_off_both_alds_in_texas_keuchel_up_for_astros", "country": "US", "title": "LEADING OFF: Both ALDS in Texas; Keuchel up for Astros", "performance_score": 0, "site": "bostonherald.com", "participants_count": 1, "title_full": "LEADING OFF: Both ALDS in Texas; Keuchel up for Astros | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T03:00:00.000+03:00", "replies_count": 0, "uuid": "6506e3bf5738ff2a37ed378df1c4e4c3373378e8"}, "author": "Associated Press", "url": "http://bostonherald.com/sports/red_sox_mlb/mlb_coverage/2015/10/leading_off_both_alds_in_texas_keuchel_up_for_astros", "ord_in_thread": 0, "title": "LEADING OFF: Both ALDS in Texas; Keuchel up for Astros", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A look at what's happening around the major leagues today:\n___\nTEXAS TWO-STEP\nBoth AL Division Series travel to Texas, with the Astros hosting the Royals at 4:10 p.m. EDT and the Blue Jays facing the Rangers at 8:10 p.m. EDT. Kansas City and Houston split Games 1 and 2 in Missouri, while Texas takes a 2-0 advantage into Game 3 after a 14-inning 6-4 victory in Game 2 in Toronto.\nTAKEN OUT\nThe Mets will likely play Wilmer Flores at shortstop when their NL Division Series continues Monday after Ruben Tejada broke his right leg on Chase Utley's takeout slide Saturday night. Tejada sustained a fractured right fibula and was placed on a flatbed vehicle with an air cast on his leg, while Utley was ruled safe on a video review as the Dodgers went on to win 5-2. \"Yeah, they're angry,\" Mets manager Terry Collins said of his players. \"You lose in a playoff series to that serious of an injury, yeah, they're not very happy about it.\"\nCLIMATE CONTROL\nAstros ace Dallas Keuchel has been great everywhere this year, but particularly at home, where he was 15-0 with a 1.46 ERA. Keuchel has been asked about his home dominance often, and on Saturday, he jokingly supposed that \"maybe it's the temperature\" set by the Minute Maid Park air conditioner. Royals manager Ned Yost decided to start Keuchel in the All-Star game this year. \"He's just good,\" Yost said Saturday. \"I mean, he's just good. But you look at his home and away record, there's quite a big difference in that. But ... he just pitches good here. And sometimes there's just no reason for it.\"\nMAKING NICE\nEdinson Volquez throws for the Royals, facing George Springer for the first time since Volquez broke Springer's right wrist by hitting him with a pitch on July 1. Springer missed two months with the injury, and Volquez said he \"felt really bad at the time\" and \"reached out to him and I talked to him a little bit and I said sorry about what happened to him. I was really sad about that.\"\nCECIL DONE\nThe Blue Jays are moving on after top left-handed reliever Brett Cecil was ruled out for the postseason after tearing a torn calf muscle in Game 2 — Cecil knew it was a bad injury right away, crying as he walked to the clubhouse after suffering the injury. \"It's not the way I perceived it ending,\" he said. Toronto replaced him on its playoff roster with right-hander Ryan Tepera.\nBELTRE BACK?\nAdrian Beltre's status remains uncertain as he continues to battle a lower back strain that kept him at home while the rest of the Rangers worked out on Saturday. The third baseman was injured during Game 1 of the ALDS and sat out Friday's 14-inning Game 2. \"He's day to day, has made some improvement, continues to get better,\" manager Jeff Banister said, adding \"you can never count Adrian out of anything, and where I think he is right now is probably irrelevant.\" Beltre's replacement, Hanser Alberto, singled in the go-ahead run in Game 2.", "external_links": [], "published": "2015-10-11T03:00:00.000+03:00", "crawled": "2015-10-11T19:21:52.342+03:00", "highlightTitle": ""}