{"organizations": [], "uuid": "8d9e5e7bdc374ad34e78e5dd3c29eb51673fed64", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.denverpost.com", "main_image": "http://extras.mnginteractive.com/live/media/site333/2015/1009/20151009__USGOP2016Trump~1.jpg", "site_section": "http://www.denverpost.com/", "section_title": "Colorado Breaking News, Sports, Weather, Traffic, Jobs - The Denver Post", "url": "http://www.denverpost.com/breakingnews/ci_28945094/donald-trump-says-bowe-bergdahl-should-have-been", "country": "US", "title": "Donald Trump says Bowe Bergdahl should have been executed", "performance_score": 0, "site": "denverpost.com", "participants_count": 1, "title_full": "Donald Trump says Bowe Bergdahl should have been executed - The Denver Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T13:47:00.000+03:00", "replies_count": 0, "uuid": "8d9e5e7bdc374ad34e78e5dd3c29eb51673fed64"}, "author": "Kimberly Pierceall And Jill Colvin  Associated Press", "url": "http://www.denverpost.com/breakingnews/ci_28945094/donald-trump-says-bowe-bergdahl-should-have-been", "ord_in_thread": 0, "title": "Donald Trump says Bowe Bergdahl should have been executed", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LAS VEGAS (AP) — Republican presidential front-runner Donald Trump said Thursday that Army Sgt. Bowe Bergdahl should have been executed for leaving his post in Afghanistan.\n\"We're tired of Sgt. Bergdahl, who's a traitor, a no-good traitor, who should have been executed,\" Trump said to cheers at a rowdy rally inside a packed Las Vegas theater at the casino-hotel Treasure Island.\n\"Thirty years ago,\" Trump added, \"he would have been shot.\"\nIt was practically an aside in a litany of complaints at the end of a more than hourlong, free-wheeling speech that included a large dose of media-bashing and a claim that he was behind Rep. Kevin McCarthy's decision to drop out of the race for House speaker.\nBergdahl was charged in March with desertion and misbehavior before the enemy. The Army conducted a hearing on his case earlier this month. His attorney, Eugene Fidell, said in a statement that Trump \"has become a broken record on this subject.\"\n\"If he took the time to study what actually emerged at the preliminary hearing he would be singing a different tune,\" Fidell said.\nTrump has, in the past, pantomimed a firing squad, Fidell said.\nBergdahl has been accused of leaving his post in southeastern Afghanistan in June 2009. He was held prisoner by the Taliban for five years, then exchanged for five Taliban commanders being held by the U.S. Trump has long railed against the deal.", "external_links": [], "published": "2015-10-09T13:47:00.000+03:00", "crawled": "2015-10-09T18:04:34.815+03:00", "highlightTitle": ""}