{"organizations": [], "uuid": "04faa0ceef822bbae23a212bf7e23e95057f49dc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.sky.com", "main_image": "http://media.skynews.com/media/images/generated/2015/10/26/426302/default/v1/gettyimages-494239876-1-1600x900.jpg", "site_section": "http://feeds.skynews.com/feeds/rss/sports.xml", "section_title": "Sports News - Latest Sports and Football News | Sky News", "url": "http://news.sky.com/story/1576151", "country": "IL", "title": "Hamilton Hails Greatest Moment Of His Life", "performance_score": 0, "site": "sky.com", "participants_count": 0, "title_full": "Hamilton Hails Greatest Moment Of His Life", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T09:02:00.000+02:00", "replies_count": 0, "uuid": "04faa0ceef822bbae23a212bf7e23e95057f49dc"}, "author": "", "url": "http://news.sky.com/story/1576151", "ord_in_thread": 0, "title": "Hamilton Hails Greatest Moment Of His Life", "locations": ["United States Grand Prix", "UK"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hamilton", "Lewis Hamilton"], "text": "Hamilton Hails Greatest Moment Of His Life 07:02, UK, Monday 26 October 2015 Share by email Lewis Hamilton has described securing his third F1 drivers' world championship with his victory in the United States Grand Prix as \"the greatest moment of my life\". \nHamilton is now the 10th driver in the history of the sport to win three or more championships and is the first Briton to have won the title in successive years. \nSir Jackie Stewart is the only other British driver to have won three championships in 1969, 1971 and 1973. \nHamilton, who claimed his first championship in 2008 when he drove for McLaren, has dominated the 2015 season, winning 10 races to wrap up the championship with three grands prix remaining. \n\"It's overwhelming at the moment, difficult for me to find the words,\" said an emotional Hamilton after crossing the line ahead of Nico Rosberg and Sebastian Vettel - his two remaining championship challengers - in Austin, Texas. \n\"I remember my first British championship when my dad and I drove home singing 'We Are The Champions'. It's crazy to think that I'm a three-time Formula One champion.\" \nHamilton secured the title after re-taking the lead of the race with eight laps to go courtesy of an error by Mercedes teammate Rosberg. \n\"I just can't find the right words to express the feeling. It is the greatest feeling I have ever had in my life. I won the championship last year, and now this year, it is just unbelievable,\" Hamilton told Sky Sports News. \n\"Today was such a fun race, so many ups and downs, Nico was ahead by 10 seconds at one point. I was behind, struggling with the car, but then came back with strength.\" \nAfter passing Rosberg at the first corner - a move that pushed the polesitter off the track - Hamilton fell as low as fourth place as he struggled with his car's tyres. \nThe Safety Car came out three times in all during a topsy-turvy race that started in wet conditions and featured six lead changes in all, with Hamilton running second to Rosberg after racing resumed for the last time. \nThat would have meant the title race going to Mexico next weekend, Instead, however, Rosberg ran off the track on lap 48 and gifted his rival the win. \n\"I never for one second believed that I couldn't do it. I pushed and I pushed,\" said Hamilton, who has also equalled the tally of three titles won by his boyhood hero Ayrton Senna. \"The last 10, 15 laps were the tough ones. What an extraordinary race.\" \nHe also defended his move on Rosberg at the first corner - one the latter described as \"very aggressive\". \"That wasn't intentional, we were both very deep into it. He was on the outside, it was wet - there wasn't grip - he was turning and we touched,\" Hamilton said. \n\"After that, [I was] just fighting for position, trying to stay ahead. I was up and down through the race - I was in the lead, but knew I didn't have the car. I was struggling ... sliding all over the place. \n\"I was fourth, the track was drying, it was the trickiest conditions for us and these guys drive fantastically well. I was behind the Safety Car and Nico with 10 laps to go and thinking 'The world championship ... am I going to get it?'.\" \nBut he did and now it's time to celebrate. \"I want to hug lots of people,\" Hamilton added, \"and I definitely need to have a drink after that race!\" Promoted Stories", "external_links": [], "published": "2015-10-26T09:02:00.000+02:00", "crawled": "2015-10-26T11:33:59.427+02:00", "highlightTitle": ""}