{"organizations": [], "uuid": "234d0c2828991c4479ea5aeb90c18bd475e25075", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nola.com", "main_image": "http://imgick.nola.com/home/nola-media/width620/img/tpphotos/photo/2014/12/07/16519541-standard.jpg", "site_section": "http://www.nola.com/sportsflash/", "section_title": "New Orleans &amp; Louisiana Sports | High School, College &amp; Pro Sports News NOLA.com", "url": "http://www.nola.com/saints/index.ssf/2015/09/new_orleans_saints_keenan_lewi_6.html", "country": "US", "title": "New Orleans Saints Keenan Lewis says he'll play against Cowboys", "performance_score": 0, "site": "nola.com", "participants_count": 5, "title_full": "New Orleans Saints Keenan Lewis says he'll play against Cowboys | NOLA.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T02:17:00.000+03:00", "replies_count": 5, "uuid": "d65120f5eef155e404e64dbe88e20afd2da6a1b5"}, "author": "Katherine Terrell, NOLA.com | The Times-Picayune", "url": "http://www.nola.com/saints/index.ssf/2015/09/new_orleans_saints_keenan_lewi_6.html#post-0", "ord_in_thread": 0, "title": "New Orleans Saints Keenan Lewis says he'll play against Cowboys", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "New Orleans Saints cornerback Keenan Lewis hates being on the sidelines.\nWatching others do his job eats at him. He can't stand it.\nWhen he was asked if it had been hard for him to be sidelined for almost five weeks because of hip surgery, he scoffed.\n\"Of course! You know where I'm from,\" he said, referring to the West Bank.\nSo it was no surprise that Lewis, holding court with the media on Wednesday afternoon, confidently stated that he'd be playing this week against the Cowboys.\n\"I'm up,\" he said, when asked. \"I'm definitely going to be out there.\"\nWhen asked how many snaps he'll play, Lewis said that was a coach's decision.\nLewis' passion for the game is well documented. During a 2014 wildcard playoff game against the Eagles, Lewis sustained a concussion and was forced to sit out the rest of the game. He threw a fit.\nLewis pleaded to be let back in and made such a ruckus, all captured on TV, that his mother called him the next day and told him not to embarrass her anymore.\n\"My mom told me don't embarrass her like that no more, cursing on TV and stuff like that,\" Lewis said at the time. \"So if anything happens like that again, I'll just probably go sit down on the bench with my hood on my head or something.\"\nBut even though he hasn't been able to play, he's been quietly proud of the way the revamped secondary has stepped up in his absence, particularly first-year player Delvin Breaux and rookie Damian Swann.\n\"We've got guys who I feel like have stepped in and have done a tremendous job,\" Lewis said. \"You get a guy like Breaux who comes in and plays lockdown football ... Swann is playing at a high level. ... I'm proud to see them grow.\"\n\"It didn't really surprise me,\" Lewis said of Breaux's success. \"That's a guy I've known my whole life. ... That's my guy. ... He's a lockdown corner.\"\nThe Saints will have to make a decision how to best fit Lewis in this weekend when he returns. The Saints have been playing Brandon Browner and Breaux at outside cornerback, and Swann at nickel.\nPayton said the key is to get the best guys on the field, but didn't specify if that means rotating them or if one of them would be out when Lewis returns.\n\"We have to be smart with his first week back. Just with a total pitch count, but it is a good problem to have,\" Payton said. \"We spent about 20 minutes discussing this last night for half an hour in our staff meeting and we have to look, obviously, we will have more than one defensive package and we have to find a way to put our best guys out there and then depending on whether it is first or second down or possibly third down that could change.\"", "external_links": [], "published": "2015-10-01T02:17:00.000+03:00", "crawled": "2015-10-01T09:25:04.871+03:00", "highlightTitle": ""}