{"organizations": ["Los Angeles Lakers", "Martin Rogers", "Los Angeles Clippers"], "uuid": "09432dc3000c8ab53ff88b6324ecbe9b196dddb4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wtsp.com", "main_image": "http://cdn.tegna-tv.com/-mm-/f3abcf40e02f5f3a31b8d479bcab2e325c4ade88/c=0-29-533-330&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/14/WTSP/WTSP/635804555951698210-Lamar-Odom.JPG", "site_section": "http://rssfeeds.wtsp.com/_/20/110156900/wtsp/sportsnews", "section_title": "WTSP - Sports", "url": "http://www.wtsp.com/story/entertainment/2015/10/14/stunning-details-released-lamar-odom-brothel-incident/73964418/", "country": "US", "title": "Stunning details released in Lamar Odom brothel incident", "performance_score": 0, "site": "wtsp.com", "participants_count": 0, "title_full": "Stunning details released in Lamar Odom brothel incident", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T04:42:00.000+03:00", "replies_count": 0, "uuid": "09432dc3000c8ab53ff88b6324ecbe9b196dddb4"}, "author": "", "url": "http://www.wtsp.com/story/entertainment/2015/10/14/stunning-details-released-lamar-odom-brothel-incident/73964418/", "ord_in_thread": 0, "title": "Stunning details released in Lamar Odom brothel incident", "locations": ["USA"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kelvin Kuo", "Lamar Odom"], "text": "Stunning details released in Lamar Odom brothel incident Martin Rogers, USA TODAY Sports 9:42 p.m. EDT October 14, 2015 Los Angeles Lakers forward Lamar Odom during the game against Los Angeles Clippers at the Staples Center. (Photo: Kelvin Kuo, USA TODAY Sports) CONNECT TWEET LINKEDIN COMMENT EMAIL MORE \nPAHRUMP, Nev. – Lamar Odom took cocaine and as many as 10 sexual-performance supplement pills leading up to his hospitalization in Las Vegas, according to a dramatic 911 call released Wednesday by the Nye County Sheriff’s Department. \nOdom, the former NBA player and husband of reality television star Khloe Kardashian, was rushed to a medical facility after being found unresponsive by staff at a brothel known as the Love Ranch in Crystal, Nev., around 70 miles northwest of Las Vegas. \nReports: Khloé Kardashian keeps vigil at Lamar Odom's side \nSheriff Sharon Wehrly said two employees of the Love Ranch stated Odom was unresponsive when they called 911 on Tuesday afternoon at 3:15 p.m. and informed dispatch of his drug use. \n“They confirmed his (cocaine) usage on Saturday but were unsure if it had continued throughout the weekend,” Sheriff Wehrly said at a media conference on Wednesday afternoon. “They also informed dispatch that he had used up to 10 tabs of sexual performance supplements.” \nDetective Michael Eisenloffel has not ruled out that Odom’s actions were a suicide attempt. \nPolice said the sexual-performance supplements ingested by Odom were legal and were obtained from the Love Ranch. Dennis Hof, the owner of the Love Ranch, claimed on Wednesday that the brothel did not offer supplements to its visitors, despite advertising “Viagra” parties on its website. \nThe initial emergency call came from Mitzi John, an employee of the Love Ranch, who described Odom as unconscious and in need of an ambulance. \nJohn called 911 frantically a second time urging dispatchers to hurry, as Odom had “blood coming out of his nose and white stuff coming out of his mouth.” \nThe telephone was later passed to Richard Hunter, media director of the Love Ranch, who described how Odom had taken the sexual-performance enhancer over the course of three days, having arrived at the ranch on Saturday. \nHunter also stated that Odom had taken cocaine on Saturday but that staff members could not confirm whether he had taken the drug since. \nThe sheriff’s department were unable to provide further information on Odom’s condition but revealed contact has been made with one member of the Kardashian family, that the person was “understandably distraught in the circumstances.” \nWehrly said it was “distinctly possible” that Odom could face charges of drug possession pending the results of the investigation. She stated that the actions of Love Ranch employees would also be looked into. \nOdom, 35, last played in the NBA in 2013 and was waived by the New York Knicks in July 2014. He was part of the Los Angeles Lakers championship-winning teams in 2009 and 2010. Odom was visited by former teammate Kobe Bryant at Sunrise Hospital in Las Vegas on Tuesday night. \nHospital officials provided no immediate word on Odom’s condition. Rev. Jesse Jackson was among the visitors on Wednesday and said doctors believe Odom is recovering after being unresponsive. \n“Apparently from what the doctor said, he was much better off today than yesterday. He at least has some responsiveness now,” Jackson said. “He’s got tubes in him now but we felt inspired by his presence. We’re just holding hands and hoping he can bounce back.” \nOdom has had legal and abuse issues. He was arrested by the California Highway Patrol in August of 2013 on suspicion of driving under the influence of alcohol and or drugs, according to the incident report. That happened after weeks of speculation about his well-being. \nIn December of 2011, Odom was traded to the Dallas Mavericks, after a proposed deal that would have sent him to the New Orleans Hornets as part of a package for point guard Chris Paul was nixed by then-Commissioner David Stern. The stint with the Mavericks was rocky, Odom spent some time in the D-League in March. After the season, he was traded to the Los Angeles Clippers. \n“Lamar Odom is a long-time member of the Excel family, and we are keeping him in our thoughts and prayers. We are staying close to the situation but have no additional information or comment at this time,\" Excel Sports Management president Jeff Schwartz said in a statement. \nStory courtesy USA TODAY. Contributing: Sam Amick, Jeff Zillgitt and wire reports Los Angeles Clippers forward Lamar Odom against the Phoenix Suns at the US Airways Center. (Jan 2013) Mark J. Rebilas, USA TODAY Sports Dallas Mavericks power forward Lamar Odom dribbles to the basket against the New York Knicks at Madison Square Garden. (Feb 2012) Debby Wong, USA TODAY Sports Lamar Jr., Lamar Odom, daughter Destiny, Khloe Kardashian, Kendall Jenner, Kim Kardashian, Kylie Jenner and Kourtney Kardashian at the 2011 Teen Choice Awards held at the Gibson Amphitheatre in Aug. 2011. Jason Merritt, Getty Images Los Angeles Lakers' Lamar Odom with his trophy as the winner of the 2010-2011 NBA Sixth Man Award, as the league's top reserve. (Apr 2011) Reed Saxon, AP Lakers Derek Fisher, Lamar Odom and Pau Gasol signal for a tie ball during a play against the Denver Nuggets at Staples Center. (Apr 2011) Robert Hanashiro, USA TODAY Sports Los Angeles Lakers power forward Lamar Odom drives to the basket guarded by Utah Jazz power forward Paul Millsap at the Staples Center. (Oct 2010) Robert Hanashiro, USA TODAY Sports Lamar Odom, Pau Gasol and Andrew Bynum celebrate the Lakers' 83-79 win over Boston in game 7 of the NBA Finals. (Jun 2010) Robert Hanashiro, USA TODAY Sports US Lamar Odom celebrates after winning a point during a World Cup Championship semi final basketball match US versus Lithuania in Istanbul. (Sep 2010) Aris Messinis, AFP/Getty Images From left, Kendall Jenner, Kim Kardashian, Kylie Jenner, Lamar Odom, Khloe Kardashian and Kourtney Kardashian at the Teen Choice Awards in Aug. 2010. Chris Pizzello, AP Lamar Odom and then-wife Khloe Kardashian arrive at the Philippe Restaurant West Hollywood grand opening in Oct. 2009. Jason Merritt, Getty Images Miami Heat's Lamar Odom and Dwayne Wade celebrate their win against the New Orleans Hornets in Game 1 of their NBA first-round playoff series at the American Airlines Arena. (Apr 2004) J.P. Carter, AP Los Angeles' Lamar Odom during the Clippers' game against the Heat at the Staples Center. (Dec 1999) Robert Hanashiro, USA TODAY Sports Lamar Odom at 19 years old playing for the Redemption Christian Academy in Loudonville, NY. Tim Roske, AP Like this topic? You may also like these photo galleries: Replay", "external_links": [], "published": "2015-10-15T04:42:00.000+03:00", "crawled": "2015-10-15T04:53:34.116+03:00", "highlightTitle": ""}