{"organizations": ["Sharks"], "uuid": "1eeeb3e2e0936873ff9899465e4fe0414752345e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usatoday.com", "main_image": "http://www.gannett-cdn.com/-mm-/7e48d40fe2952178950d4a9c1ff435a8929dc047/c=0-468-1290-1194&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/25/USATODAY/usatsports/f4dbdd2df639cc2f850f6a7067002942.jpg", "site_section": "http://www.usatoday.com/sports/", "section_title": "USA Today | Sports", "url": "http://www.usatoday.com/story/sports/nhl/2015/10/25/ward-has-hat-trick-as-sharks-beat-hurricanes-5-2/74578782/", "country": "US", "title": "Ward has hat trick as Sharks beat Hurricanes, 5-2", "performance_score": 0, "site": "usatoday.com", "participants_count": 0, "title_full": "Ward has hat trick as Sharks beat Hurricanes, 5-2", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T08:14:00.000+02:00", "replies_count": 0, "uuid": "1eeeb3e2e0936873ff9899465e4fe0414752345e"}, "author": "", "url": "http://www.usatoday.com/story/sports/nhl/2015/10/25/ward-has-hat-trick-as-sharks-beat-hurricanes-5-2/74578782/", "ord_in_thread": 0, "title": "Ward has hat trick as Sharks beat Hurricanes, 5-2", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ward"], "text": "(Photo: The Associated Press)\n1 CONNECT 1 TWEET LINKEDIN COMMENT EMAIL MORE SAN JOSE, Calif. (AP) — Joel Ward was showered by hats on the ice and once again in the locker room. It felt better than having water dumped on his head or a pie smashed into his face.\nWard had a hat trick to help the San Jose Sharks end a three-game losing streak with a 5-2 victory over the Carolina Hurricanes on Saturday night.\n\"What is important to me is earning the respect of my linemates,\" said Ward, in his first year with the Sharks. \"It's always a great feeling to get on the board and it's good to get the chances and the bounces.\"\nJoe Pavelski and Tommy Wingels also scored for the Sharks, who have not had a power-play goal in five consecutive games and are 0 for 11 with the man advantage in that span.\n\"He's a guy that goes to the net,\" Wingels said of Ward. \"Guys in this locker room can learn from him. When you can get on them early, it makes it tough for them to come back.\"\nThe game drew 15,814 fans — the Sharks' lowest attendance in nine years.\nJustin Faulk and Riley Nash scored for the Hurricanes, who are in the middle of a seven-game road trip.\n\"That team has some new faces but for the most part they're a veteran team and they understand what it takes to shut teams down and finish the game,\" Carolina forward Kris Versteed said. \"I think we're getting shots on net but we need a little more traffic.\"\nMartin Jones stopped 32 shots for the victory.\nCarolina's Eddie Lack allowed four goals on 13 shots before Cam Ward replaced him midway through the second period and stopped all seven shots he faced.\nWard scored San Jose's fastest goal of the season, 81 seconds into the game. He knocked in a loose puck in front of the net after Tomas Hertl's shot and Patrick Marleau's follow bounced off Lack's pads.\nWard scored again seven minutes later, beating Lack to the top left shelf in a 1-on-1 encounter.\n\"It was awesome. It was what we needed,\" Pavelski said of Ward. \"It's important to get off to a good start and he provided it for us.\"\nFaulk scored on a power play, just the Hurricanes' third of the season, matching the Sharks. A series of crisp passes, the last by Nathan Gerbe, gave Faulk a good look.\nPavelski took advantage of an errant shot by Marc-Edouard Vlasic that bounced off the glass and back in front of the net to poke it through an opening.\nWingels was able to tip in a rebound to end Lack's night.\nNash, who missed the last five games, scored with an assist from Noah Hanifan.\n\"It's hard to score goals in this league but we believe we have the team to do it,\" the Hurricanes' Brock McGinn said. \"We started out in the second very strong and we were getting pucks on the net but we weren't able to continue it.\"\nWard completed the hat trick in the final minute with an empty-net goal.\n\"There's always work to be done,\" Ward said. \"There are still things we need to work on.\"\nNOTES: Ward's first goal gave him 100 for his career. ... D Brett Pesce made his NHL debut for the Hurricanes. ... Carolina C Andrej Nestrasil was a scratch one day after leaving the Hurricanes game against the Los Angeles Kings in the second period when he was hit on the inside of his leg by a slap shot. ... San Jose D Paul Martin returned to the lineup after missing three games with a lower body injury. ... The Sharks recalled F John McCarthy from the AHL. ... The Sharks are off until Wednesday, when they host the Nashville Predators. The Hurricanes continue their road trip at Detroit on Tuesday.\n1 CONNECT 1 TWEET LINKEDIN COMMENT EMAIL MORE Copyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.\nTOP VIDEOS", "external_links": ["http://www.gannett-cdn.com/-mm-/bd4fbdaa7fba1e1edc9ac90619376a811e4004da/c=22-0-1268-1662&r=537&c=0-0-534-712/local/-/media/2015/10/25/USATODAY/usatsports/f4dbdd2df639cc2f850f6a7067002942.jpg", "http://www.linkedin.com/shareArticle?url=http%3A//usat.ly/1S3IkgJ&mini=true", "https://twitter.com/intent/tweet?url=http%3A//usat.ly/1S3IkgJ&text=Ward%20has%20hat%20trick%20as%20Sharks%20beat%20Hurricanes%2C%205-2&via=usatoday"], "published": "2015-10-25T08:14:00.000+02:00", "crawled": "2015-10-25T09:07:26.566+02:00", "highlightTitle": ""}