{"organizations": [], "uuid": "ebeea5fa229a6dc312f12cd0d00da081af4a4ccb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "http://s4.reutersmedia.net/resources/r/?m=02&d=20151024&t=2&i=1089351516&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXNPEB9N01U", "site_section": "http://www.reuters.com/news/sports", "section_title": "Sports News, Highlights &amp; Coverage | Reuters.com", "url": "http://www.reuters.com/article/2015/10/24/us-motor-racing-prix-hamilton-idUSKCN0SI02D20151024", "country": "US", "title": "Hamilton ready to scale his own Everest", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Hamilton ready to scale his own Everest | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T06:27:00.000+03:00", "replies_count": 0, "uuid": "ebeea5fa229a6dc312f12cd0d00da081af4a4ccb"}, "author": "Alan Baldwin", "url": "http://www.reuters.com/article/2015/10/24/us-motor-racing-prix-hamilton-idUSKCN0SI02D20151024", "ord_in_thread": 0, "title": "Hamilton ready to scale his own Everest", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "AUSTIN, Texas Lewis Hamilton will achieve the dream of a lifetime if he secures his third Formula One world championship in Austin on Sunday but he will then face a question as big as Texas: What next?\nLike a mountaineer one step away from conquering the highest peak, the Mercedes driver knows he also stands on the edge of uncertainty as he goes into the U.S. Grand Prix.\nWithout wanting to preempt anything, go into 'ifs' and 'buts' or even acknowledge that the weekend felt in any way out of the ordinary, Hamilton recognized that he would have to refocus his career ambitions.\n\"I could imagine that, for me it would be like getting to the top of Mount Everest. I mean, what do you do next?\" he said of the prospect of matching the three titles of his boyhood hero, the late Brazilian Ayrton Senna.\nThe answer for most would simply be win more championships and races, but Senna's triple has a particular resonance for Hamilton.\nThe 30-year-old, who has already overtaken the Brazilian's tally of race wins, has always wanted to win three. Not seven like Michael Schumacher, or four like Sebastian Vettel, but to do what Senna did.\nAs he said in Japan two weeks ago, he never aspired to be like any other driver.\n\"There's no higher mountain but there are equally tough challenges in maybe lower mountains. Things just change, so I really don’t know,\" said the Briton, as he continued to ponder how he might react.\n\"I am going to keep on wanting to win. That is never going to change in me. That competitiveness I have in me is just in my blood.\n\"The other day we were bowling with some people, and we had some girls with us and I could not for the life of me let them win. That competitiveness will always be there. I can't even fathom what's beyond it\n\"I never thought beyond three (titles). I didn't even think I would have two.\"\nHamilton won his first title with McLaren in 2008, with his father present, and took his second with Mercedes last year in the final race -- again with father and family present.\nThis time, he just has his pet bulldog 'Roscoe' for company and he said he was not expecting any family to join him.\n\"At the moment it just feels like another weekend. It really, really does. Which I'm actually happy about,\" he told British reporters.\n\"Last year, the last race was an intense period -- I might have it or might not have it. But now I’m in a good position with four races (to go).\n\"I’ve set up my mind up knowing I’ve got these four races to win the championship. My goal is to cross the line in Abu Dhabi as champion, not cross the line in Austin as champion. If it happens, then great but otherwise no extra pressure.\"\nThe Briton has won nine races in 15 this season and could become the first champion to win 10 or more in successive years, as well as Britain's first back-to-back champion.\nSo will that make him a 'legend', one of the greats who transcends the sport?\n\"I hope at some stage I might be. I think that would be a positive,\" said the sport's first black world champion. \"I mean, I’m doing not too bad.\n\"When you look at those people who have done wonders in their sports and really stood out, I hope at some stage when I come to the end hopefully people will stay I did stood out. I do stick out like a sore thumb compared to the other drivers.\"\n(Editing by Peter Rutherford )", "external_links": [], "published": "2015-10-24T06:27:00.000+03:00", "crawled": "2015-10-24T05:46:59.632+03:00", "highlightTitle": ""}