{"organizations": [], "uuid": "b31b3f6640310d18839f25a9f6a5cb52fe04b4fe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bjsm.bmj.com", "main_image": "", "site_section": "http://bjsm.bmj.com/rss/current.xml", "section_title": "British Journal of Sports Medicine current issue", "url": "http://bjsm.bmj.com/cgi/content/short/49/21/1415-b?rss=1", "country": "US", "title": "ELITE FEMALE RUGBY PLAYERS' (UNION VERSUS TOUCH): COMPARATIVE STUDY OF CERVICAL SPINE FUNCTION", "performance_score": 0, "site": "bmj.com", "participants_count": 1, "title_full": "ELITE FEMALE RUGBY PLAYERS' (UNION VERSUS TOUCH): COMPARATIVE STUDY OF CERVICAL SPINE FUNCTION", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T08:01:00.000+03:00", "replies_count": 0, "uuid": "b31b3f6640310d18839f25a9f6a5cb52fe04b4fe"}, "author": "Zietsman, B., McCarthy, P.", "url": "http://bjsm.bmj.com/cgi/content/short/49/21/1415-b?rss=1", "ord_in_thread": 0, "title": "ELITE FEMALE RUGBY PLAYERS' (UNION VERSUS TOUCH): COMPARATIVE STUDY OF CERVICAL SPINE FUNCTION", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "University of South Wales, Pontypridd, UK Abstract Aim Elite male rugby union players have a decreased active cervical range of motion (ACROM), the severity of which appears to correlate with number of years playing and position. 1 Although the female game has yet to attain full professional status, players are still subjected to the same game related activities and might be expected to similarly accumulate degenerative changes in vertebral joints. 2 This study was designed to determine if playing a contact sport affects ACROM of elite female players, compared with a control of similar level of play in the non-contact equivalent (touch rugby). The presence and degree of such changes might be affected by issues such as BMI, speed and the physiological differences between males and females. Methods Protocol used is similar as that described by Lark and McCarthy, 2007. Briefly, a cervical range of motion device (CROM) 3 was used to measure ACROM following a warm up procedure. From their neutral point to full flexion/extension and full left/right rotation was measured in no set order, (to reduce potential order effects). Ethical approval was granted by The Faculty of HSS Ethics Committee, University of Glamorgan, written informed consent was obtained from all subjects. Results 35 Welsh International Rugby Union players (WRU) volunteered, 29 included. Exclusions: 4 pain on extension, 2 whiplash, split into 15/29 backs (WRU B), 14/29 forwards (WRU F); matched to 22/32 Welsh International Touch Rugby players (WTR), 8 exclusions: 1 whiplash, 7 con-current elite union players ⇓ . View this table: In a new window Table 1 Conclusions The decrease in ACROM for WRU relative to WTR players supports the contention that elite union leads to impaired neck function, regardless of the players' sex. Those in a forward position are particularly affected. This suggests that female elite union players have a similar risk of accelerated degeneration to the vertebral joints as their male counterparts. Further research is needed to determine cause, and whether any protocol can be established to lessen this effect. CiteULike", "external_links": [], "published": "2015-10-17T08:01:00.000+03:00", "crawled": "2015-10-17T14:01:49.357+03:00", "highlightTitle": ""}