{"organizations": [], "uuid": "7b9d4bc1d18241bba20319478e3ae3e5c7926905", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mercurynews.com", "main_image": "http://local.mercurynews.com/common/dfm/assets/logos/1200x627/mercurynews.png", "site_section": "http://feeds.mercurynews.com/mngi/rss/CustomRssServlet/568/200795.xml", "section_title": "College Sports", "url": "http://www.mercurynews.com/sports/ci_28943161/ncaa-has-issues-fanduel-and-draftkings-fantasy-sports?source=rss", "country": "IL", "title": "NCAA has issues with FanDuel and DraftKings fantasy sports sites", "performance_score": 0, "site": "mercurynews.com", "participants_count": 1, "title_full": "NCAA has issues with FanDuel and DraftKings fantasy sports sites", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T05:27:00.000+03:00", "replies_count": 0, "uuid": "7b9d4bc1d18241bba20319478e3ae3e5c7926905"}, "author": "David Brandt\n\nAssociated Press", "url": "http://www.mercurynews.com/sports/ci_28943161/ncaa-has-issues-fanduel-and-draftkings-fantasy-sports?source=rss", "ord_in_thread": 0, "title": "NCAA has issues with FanDuel and DraftKings fantasy sports sites", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NCAA has issues with FanDuel and DraftKings fantasy sports sites By David Brandt Posted: 10/08/2015 07:18:02 PM PDT Updated: 10/08/2015 07:27:24 PM PDT \nBy David Brandt Watch any of the weekend's college football games and it's hard to go even 30 minutes without seeing a commercial for upstart sites DraftKings and FanDuel. \nAs a debate intensifies about whether the loosely regulated industry should be considered gambling, the ads are creating an uncomfortable association for the NCAA, which has strict rules for its players on sports wagering. \nBut the sites -- which allow participants to pay an entry fee for a chance to earn payouts that can top $1 million -- are perfectly legal in 45 states and dumping millions into advertising during college games. \nMany in the NCAA -- including Big 12 commissioner Bob Bowlsby -- have made their position crystal clear. \n\"It's impossible to convince me that it's not gambling,\" Bowlsby said. \nA possible showdown is brewing after the season when NCAA and conference executives are expected to see how -- or even if -- they can curtail the advertising or keep the sites from offering games that focus on college athletics. Mississippi athletic director Ross Bjork said the avalanche of daily fantasy sports advertising has quickly turned the topic into a pressing issue. \n\"My 9-year-old son is asking me every day about it,\" Bjork said. \"It's all over television and even on his iPad. They're obviously doing a great job of marketing, but it's a concern.\" Advertisement \nParticipants on DraftKings and FanDuel can compete in games involving NFL or college players, paying an entry fee that goes into a larger pool. Then they try to assemble teams that earn the most points based on real-life stats in a given period of time with a certain percentage of top finishers earning a payout. \nEntry fees on Draft- Kings range from 25 cents to over $5,000. Some prizes top $1 million. DraftKings and FanDuel say the sites provide games of skill and not of chance and are subsequently protected by the Unlawful Internet Gambling Enforcement Act established in 2006, which has language protecting fantasy sports. \nThe Southeastern Conference has already banned daily fantasy site ads on its network as of Sept. 1. The SEC gets a little more say in its own network even though it's owned by ESPN. \nBut the SEC also has plenty of programming on ESPN's regular network of channels and CBS. Other conferences have other arrangements. \nAsking them to remove the advertising on their stations -- and the ample amount of money that comes with it -- is not nearly as simple. After all, it's legal. \n\"All those games that exist currently don't meet some definition of gambling though intuitively it might seem otherwise,\" SEC commissioner Greg Sankey said. \nSaid ACC commissioner John Swofford: \"It's a complicated issue on all fronts, and it seems to be getting more complicated.\" \nStill, the Football Bowl Subdivision commissioners are trying to apply pressure wherever they can. The 10 conferences have already sent a letter to DraftKings and FanDuel asking that they discontinue using college athletes in their games.", "external_links": [], "published": "2015-10-09T05:27:00.000+03:00", "crawled": "2015-10-09T05:40:34.014+03:00", "highlightTitle": ""}