{"organizations": [], "uuid": "4142a9e02407cb3001970f4479971e8b3bc84208", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "http://images.tribuneindia.com/cms/gall_content/2015/10/2015_10$largeimg13_Tuesday_2015_010912208.jpg", "site_section": "http://www.tribuneindia.com/", "section_title": "The Tribune, Chandigarh, India : Latest news, India, Punjab, Chandigarh, Haryana, Himachal, Uttarakhand, J&amp;K, sports, cricket ", "url": "http://www.tribuneindia.com/news/punjab/aap-backs-farmers/145316.html", "country": "US", "title": "AAP backs farmers", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "AAP backs farmers", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "4142a9e02407cb3001970f4479971e8b3bc84208"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/punjab/aap-backs-farmers/145316.html", "ord_in_thread": 0, "title": "AAP backs farmers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tribune News Service\nSangrur, October 12\nMembers of the Aam Aadmi Party (AAP) took out candle marches in various cities and towns of the Sangrur Lok Sabha constituency to express solidarity with the farming community in the wake of damage to the cotton crop. The protesters were demanding the arrest of state Agriculture Minister Tota Singh for the “pesticide scam”, Rs 40,000 per acre compensation for the damaged cotton crop, a CBI inquiry into the “pesticide scam” and Rs 10 lakh compensation for families of debt-ridden farmers who had committed suicide, etc. However, in Sangrur city, two candle marches were taken out this evening, giving an impression of a split in the local unit of the AAP. One was taken out under the leadership of Gagan Ghagga, party’s sector in charge of Sangrur, Dhuri and Malerkotla. The second march was led by senior party worker Inderpal Singh for the spiritual peace of farmers and farm labourers who had committed suicide. Abjinder Sangha, a senior leader of the party, said this evening that the party workers had taken out candle marches in Sangrur, Sunam, Lehragaga, Dirba, Dhuri and Malerkotla in Sangrur district, and Barnala and Tapa in Barnala district. He said earlier, the party had planned to take out the candle march only in three cities, but the workers compelled the party to organise candle marches in eight cities and towns of the constituency. Moga: Volunteers of the Aam Aadmi Party (AAP) also organised a candle light march in Moga on Monday night. Lashing out at the SAD-BJP government, they alleged that the “apathy” of the government was the basic reason behind the deaths of farmers in the state in the recent days. “The farmers of Punjab provide food to the whole country by giving more than 40 per cent of their food grain share in the central pool. They are hard working and deserve the minimum guarantee for their livelihood,” said a protester. They said the SAD-BJP and the Congress that had been in power for decades were responsible for the miseries of peasants. They further alleged that the government had failed to ensure even the basic Minimum Support Price for basmati variety of the paddy.", "external_links": [], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-13T04:20:50.451+03:00", "highlightTitle": ""}