{"organizations": [], "uuid": "cbf16b752f4da3ce4fae646f69c0634c2de8a660", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.local12.com", "main_image": "http://www.local12.com//template/stories/2015/10/20/images/YzY0ODkwMDFjNmJi.jpg", "site_section": "http://www.local12.com//sports/features/local-sports/rss.xml", "section_title": "wkrc LOCAL Sports", "url": "http://www.local12.com/sports/features/local-sports/stories/Escort-How-could-Cardinals-39-Pitino-not-know-of-sex-parties--221546.shtml", "country": "US", "title": "Escort: How could Cardinals' Pitino not know of sex parties?", "performance_score": 0, "site": "local12.com", "participants_count": 0, "title_full": "Escort: How could Cardinals' Pitino not know of sex parties?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T22:29:00.000+03:00", "replies_count": 0, "uuid": "cbf16b752f4da3ce4fae646f69c0634c2de8a660"}, "author": "", "url": "http://www.local12.com/sports/features/local-sports/stories/Escort-How-could-Cardinals-39-Pitino-not-know-of-sex-parties--221546.shtml", "ord_in_thread": 0, "title": "Escort: How could Cardinals' Pitino not know of sex parties?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Escort: How could Cardinals' Pitino not know of sex parties? \nUpdated: Tue, Oct 20 2015, 07:34 PM \n(AP) -- Escort Katina Powell broke her silence on Tuesday, saying she has no proof that Louisville men's basketball coach Rick Pitino knew that a former Cardinals staffer hired her and other dancers to strip and have sex with former recruits and players.But Powell said in an interview aired on ABC's \"Good Morning America\" that with \"a boatload\" of recruits and dancers, \"loud music, alcohol, security, cameras\" in a campus dormitory, \"how could Rick not know?\"In her first interview since the release of her book earlier this month, \"Breaking Cardinal Rules: Basketball and the Escort Queen,\" Powell spoke with ESPN's \"Outside the Lines,\" which was aired on the ABC morning show. Powell said that the coach had to be aware of some of 22 shows she alleges that former staffer Andre McGee paid her for that took place in Billy Minardi Hall from 2010-14.Pitino has denied knowledge of the activities that Powell alleges in her book.Former Cardinals recruit JaQuan Lyle, now an Ohio State freshman, has confirmed the \"gist of allegations\" detailed in Powell's book during a meeting earlier this month with the NCAA, CBS Sports reported. OSU confirmed that Lyle spoke with the NCAA.Powell alleges that McGee, who played for Louisville before becoming a graduate assistant coach and director of men's basketball operations, paid her $10,000 for the 22 shows. The dancers included Powell, her three daughters and other women, according to the book.\"Andre would come to me and tell me what girl the recruit wanted,\" Powell said Tuesday morning in the broadcast of the ESPN interview, \"and I would tell the girl. She would say her price, I would tell him, he would say, 'OK', give me the money. That was just it.\"He would take them into another room, and her and the recruit would do what they did behind closed doors.\"McGee left Louisville in 2014 to become an assistant at Missouri-Kansas City. The school placed him on paid administrative leave on Oct. 2 when the allegations surfaced and said it is taking them seriously.Louisville men's basketball spokesman Kenny Klein said in a text message Tuesday that \"to preserve the integrity of the review process, the university will withhold comment on any details until the review is concluded.\"Messages left with Powell's attorney, Larry Wilder of Jeffersonville, Indiana, have not been returned. Attempts to reach McGee's Louisville attorney, Scott C. Cox, also have been unsuccessful.The allegations have created a lingering unease and uncertainty over the Hall of Fame coach's program. Pitino has said neither he nor his assistants knew about the alleged activities described in Powell's book, which was initially released online on Oct. 3 before the hardcover version was released in bookstores on Monday.At a season tipoff luncheon Oct. 13 with Cardinals fans and supporters, Pitino said he understood the motivation behind Powell's book but questioned the need for those activities in light of the talent his program has produced in recent years.\"From our end of the thing, I don't get the 'why?' It doesn't make sense,\" Pitino said then, reiterating his adherence to NCAA regulations.\"I know as far as I'm concerned, every coach has had rights and wrongs in their life. But every coach that has sat next to me ... knew what I was about as far as NCAA rules are concerned.\"Pitino later said that if the allegations are true, \"those responsible will pay the price\" and that his program \"will get through this the right way.\"Powell's allegations have led to four separate investigations, the two most recent coming two weeks ago.Campus police chief Wayne Hall announced that his department would work with Louisville Metro Police and the Commonwealth's Attorney's Office to review the allegations for possible criminal charges.Two days later the University of Louisville Foundation announced the hiring of a law firm to review the allegations. Investigations by the athletic department and the NCAA were launched immediately after the school was notified of the book's allegations in late August.© 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Learn more about our Privacy Policy and Terms of Use. \n\nFollow us on Twitter @Local12 and LIKE us on Facebook for updates! Related Stories", "external_links": [], "published": "2015-10-20T22:29:00.000+03:00", "crawled": "2015-10-21T08:37:55.815+03:00", "highlightTitle": ""}