{"organizations": ["The Associated Press", "Kentucky"], "uuid": "6ccfbaa69ca13ebe66a59fedc95184bb93424b02", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wdrb.com", "main_image": "", "site_section": "http://www.wdrb.com/Global/category.asp?C=196632&clienttype=rss", "section_title": "WDRB - Sports Mobile", "url": "http://www.wdrb.com/story/14880107/sports-minute-here-is-the-latest-kentucky-sports-news-from-the-associated-press", "country": "US", "title": "Sports Minute: Here is the latest Kentucky sports news from The Associated Press", "performance_score": 0, "site": "wdrb.com", "participants_count": 0, "title_full": "Sports Minute: Here is the latest Kentucky sports news from The Associated Press", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T10:04:00.000+03:00", "replies_count": 0, "uuid": "6ccfbaa69ca13ebe66a59fedc95184bb93424b02"}, "author": "", "url": "http://www.wdrb.com/story/14880107/sports-minute-here-is-the-latest-kentucky-sports-news-from-the-associated-press", "ord_in_thread": 0, "title": "Sports Minute: Here is the latest Kentucky sports news from The Associated Press", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sports Minute: Here is the latest Kentucky sports news from The Associated Press - WDRB 41 Louisville News Member Center: Sports Minute: Here is the latest Kentucky sports news from The Associated Press Posted: Updated: \nLEXINGTON, Ky. (AP) - Kentucky senior nose guard Melvin Lewis is out for the remainder of the regular season with a broken leg sustained in Thursday's loss to Auburn. Coach Mark Stoops said yesterday the junior will have surgery today for a fractured fibula. The coach says recovery normally takes six weeks. \nCINCINNATI (AP) - The NFL Network has apologized to Bengals players who were shown naked in the locker room during a postgame interview Sunday in Buffalo. Alex Riethmiller said a \"regrettable mistake by a production team\" was behind the video. An NFL Network reporter was interviewing cornerback Adam \"Pacman\" Jones after a 34-21 win in Buffalo on Sunday, and the videographer's angle included several players coming out of the shower in the background. \nPITTSBURGH (AP) - Pittsburgh Steelers wide receiver Martavis Bryant made his 2015 debut a memorable one. Bryant caught six passes for 137 yards and two second-half scores in Sunday's 25-13 win over Arizona in his first action of the season. \nNASHVILLE, Tenn. (AP) - An MRI exam shows Titans quarterback Marcus Mariota sprained his left MCL, and coach Ken Whisenhunt says they'll have to see how the rookie's knee progresses before determining if he can play Sunday against Atlanta. Whisenhunt said Mariota was walking around just fine at the Tennessee headquarters yesterday.  ", "external_links": [], "published": "2015-10-20T10:04:00.000+03:00", "crawled": "2015-10-20T15:21:07.717+03:00", "highlightTitle": ""}