{"organizations": [], "uuid": "af46e4aa8f79f0fc0356a4238e1b35438389e1dd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cleveland.com", "main_image": "http://imgick.cleveland.com/home/cleve-media/width620/img/cavs_impact/photo/19027165-standard.jpg", "site_section": "http://www.cleveland.com/pdsportsinsider/", "section_title": "Sports Insider | Sports Analysis from Northeast Ohio Media Group - cleveland.com ", "url": "http://www.cleveland.com/cavs/index.ssf/2015/10/james_jones_on_tristan_thompso.html", "country": "US", "title": "James Jones on Tristan Thompson: 'We're excited that Tristan is back, we all know what he means to us'", "performance_score": 0, "site": "cleveland.com", "participants_count": 2, "title_full": "James Jones on Tristan Thompson: 'We're excited that Tristan is back, we all know what he means to us' | cleveland.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T00:46:00.000+03:00", "replies_count": 1, "uuid": "af46e4aa8f79f0fc0356a4238e1b35438389e1dd"}, "author": "Chris Fedor, Northeast Ohio Media Group", "url": "http://www.cleveland.com/cavs/index.ssf/2015/10/james_jones_on_tristan_thompso.html", "ord_in_thread": 0, "title": "James Jones on Tristan Thompson: 'We're excited that Tristan is back, we all know what he means to us'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "INDEPENDENCE, Ohio -- There was a different feeling around the Cleveland Cavaliers facility on Thursday. With the regular season opener fast approaching, the team was inching closer to having Tristan Thompson, a key piece to the championship puzzle, rejoin them on the practice floor.\n\"We're excited that Tristan is back,\" James Jones said following Thursday's practice. \"He's a big part of what we do.\"\nThe news came Wednesday evening that the Cavaliers and Thompson ended their lengthy contract stalemate, agreeing to a five-year, $82 million contract.\nNBA rules state Thompson is required to pass a physical and officially ink his contract before he can participate in practice. The official announcement didn't come until Thursday afternoon. By that time, the Cavs had long wrapped up the day's practice and many players had left the facility -- another on-court workout without Thompson.\n\"Unfortunately the business aspect of our game slowed us down a little bit,\" Jones said of Thompson's absence. \"But we have full faith and confidence knowing the way he works that he will get up to speed soon and more importantly knowing that we have that extended depth.\"\nThe Cavs spent all of the preseason and training camp without Thompson, who emerged as a rebounding menace, especially during the postseason following Kevin Love's season-ending shoulder injury. For much of the 2014-15 season, Thompson came off the bench, becoming the most important piece of head coach David Blatt's bench. Given his absence during camp, along with Love's return and Timofey Mozgov's emergence as a defensive anchor a year ago, Thompson will likely slide back into the sixth man role.\nBut how Thompson looks when he takes the floor is anyone's guess. Even Blatt, who couldn't expand much on Thompson's status per league rules, said recently he would need to see Thompson on the practice court before determining his role and potential availability at the start of the season.\nThe contract negotiations started in the early summer, covering about four months. It's logical to expect some rust and early-season struggles. After all, game shape is tough to measure and the necessary chemistry hasn't been built with new players on the roster.\nStill, when asked about Thompson's impending return, Jones didn't speak of any hard feelings. It was only excitement over a valuable piece re-joining the roster in time for the start of the regular season.\n\"Me personally, no,\" Jones responded when asked if teammates took Thompson's holdout personally. \"My teammates here, no. We all understand that this is our livelihood and you really have a lot of factors going when you make decisions regarding your basketball futures. Nothing is made in a bubble. We understand that. We're just happy that Tristan is back because we all know and everyone knows what he means to us. I'm glad he's comfortable with us because we're definitely comfortable with him.\"\nThere were some that scoffed at Thompson's lucrative contract, thinking the Cavs overpaid. But Jones is right. Thompson's value here is tough to fully measure and he was always going to be worth more to his current organization.\nHe will provide rebounding, versatility and depth, a necessity for a team that dealt with injuries during the postseason and will once again be tasked with navigating the early-season schedule shorthanded. The internal goals, however, aren't centered on getting off to a strong start. It's about the big picture, which means a different, cautious approach with any injury. The same plan could be used with Thompson as he works into game shape.\n\"Certainly, you learn from experience and we're also faced with it at a different time than last year,\" Blatt said about his injury plan compared to last year. \"We're kind of in motion and a lot was happening. There was ground to be made up and circumstances. We know we're very much at the beginning and we know the final goal can't be achieved in the first month so we're taking the cautious route. Hopefully we will be able to be good enough initially so we can become great later on.\"", "external_links": [], "published": "2015-10-23T00:46:00.000+03:00", "crawled": "2015-10-23T01:30:41.357+03:00", "highlightTitle": ""}