{"organizations": [], "uuid": "bf3cf0ada94a54bf0cc90ec77bb84a81ce90d631", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.montgomeryadvertiser.com", "main_image": "http://www.gannett-cdn.com/-mm-/891a287a54b5d8e2090741dff8344deccbc87da8/c=0-856-2292-2145&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/17/Montgomery/B9319084365Z.1_20151017215158_000_G3BC97T4F.2-0.jpg", "site_section": "http://rssfeeds.montgomeryadvertiser.com/montgomery/troysports", "section_title": "Montgomery - Troy Sports", "url": "http://www.montgomeryadvertiser.com/story/sports/college/troy-university/2015/10/17/third-string-qb-tidwell-fuels-troys-late-rally/74156352/", "country": "US", "title": "Third-string QB Tidwell fuels Troy’s late rally", "performance_score": 0, "site": "montgomeryadvertiser.com", "participants_count": 0, "title_full": "Third-string QB Tidwell fuels Troy’s late rally", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T06:17:00.000+03:00", "replies_count": 0, "uuid": "bf3cf0ada94a54bf0cc90ec77bb84a81ce90d631"}, "author": "", "url": "http://www.montgomeryadvertiser.com/story/sports/college/troy-university/2015/10/17/third-string-qb-tidwell-fuels-troys-late-rally/74156352/", "ord_in_thread": 0, "title": "Third-string QB Tidwell fuels Troy’s late rally", "locations": ["Idaho", "Ala."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["A. Stacy Long", "Dallas Tidwell", "Tidwell"], "text": "Third-string QB Tidwell fuels Troy’s late rally A. Stacy Long , Montgomery Advertiser 10:17 p.m. CDT October 17, 2015 Troy quarterback Dallas Tidwell (11) throws against Idaho at Veterans Memorial Stadium in Troy, Ala. on Saturday October 17, 2015. (Mickey Welsh / Montgomery Advertiser) (Photo: .Mickey Welsh / Montgomery Advertiser) CONNECT 4 TWEET LINKEDIN COMMENT EMAIL MORE \nTROY — Senior quarterback Dallas Tidwell, third-string on the depth chart, helped spark Troy’s offense in Saturday’s 19-16 loss to Idaho. \nAfter starter Brandon Silvers didn’t dress out due to an injury, backup Dontreal Pruitt was ineffective before the Trojans called on Tidwell late in the third quarter. \n“We did some good things,” Tidwell said, “but we also didn’t do enough to win as a whole team.” \nPruitt was 8-of-14 passing for 70 yards and two interceptions, plus had 41 yards rushing on 13 carries, and Troy trailed 16-3 when Tidwell took over. \nAfter a 24-yard throw on his first play, Tidwell led the Trojans on three scoring drives. \nHe finished 12-of-24 passing for 168 yards, including a 43-yard touchdown pass to Teddy Ruben. \n“We just have to get consistency at that position,” coach Neal Brown said. “I thought (Tidwell) did a nice job. … I’m encouraged by him, but we just have to play better at that position.” \nSilvers left last weekend’s game at Mississippi State and was wearing a walking cast on his left leg before Saturday’s game. Troy senior quarterback Dallas Tidwell led a fourth-quarter rally that helped the Trojans erase a 16-3 deficit before Idaho won 19-16. Stacy Long \nRuben sandwich: Ruben posted a career-high 109 yards receiving on eight catches and drew praise for more than that from Brown. \n“Teddy’s a winner,” Brown said. “he doesn’t just show up on Saturdays. He shows up during the week. Not all of our guys show up during the week, but he’s a good example of one.” \nBrown cited Ruben, running back Brandon Burks, offensive lineman Dalton Bennett, defensive end Tyler Roberts and defensive lineman Lonnie Gosha as key leaders on the team. \n“Those are the guys that are right now that are doing things right, and they’re having success on the field,” Brown said. Troy coach Neal Brown compliments receiver Teddy Ruben and lists him as one of the leaders among the Trojans. Stacy Long \nTough travel: Idaho, due to mechanical issues with its charter flight, went through an arduous journey to play Saturday’s game at Troy. \nThe Vandals, scheduled to fly into Montgomery on Friday, didn’t take off until the wee hours of Saturday. \nThey left at 3:30 a.m. Pacific/5:30 Central and arrived in Montgomery about 9 a.m. They ate a pregame meal at their hotel in Montgomery and drove to Troy for a 2:30 p.m. kickoff. \nThey flew home after their win. \n“I’ve won Sugar Bowls, Cotton Bowls, huge games my whole life,” Idaho coach Paul Petrino said. “I don’t know if any of them are better than that because of everything that our players went through in the last 24 hours.” \nBig Burks: Senior running back Brandon Burks, after a six-carry, no-yard first half, finished with 83 yards on 18 carries Saturday. \nHis 51-yard run on the first play of the second half marked the third run of at least 50 yards this season. \nBurks ended that drive with a fumble at the Idaho 2-yard line. \nDepth of Epps: Idaho receiver Dezmon Epps caught 10 passes for 131 yards, both the most against Troy this year. \nEpps, entering Saturday, was third in the nation in catches per game and fifth in receiving yards per game. \nSuspended: Troy senior receiver Bryan Holmes was suspended for the first quarter Saturday as penance for a vicious block late in last weekend’s loss at Mississippi State. \nFreshman safety Cedarius Rookard was suspended for all of Saturday’s game for what Troy called a “violation of team rules.” \nRoad kill: Idaho’s win at Troy was its first road victory since 2011 when the Vandals won at San Jose State. They had lost 24 straight road games. \nHalftime zero: Troy, after trailing 38-0 at halftime at Mississippi State, trailed 6-0 at halftime Saturday. \nThe Trojans hadn’t been shut out in the first half of consecutive games since October 2003 at Virginia and North Texas. They lost those games 24-0 and 21-0, respectively. \nScoreless: When both teams went scoreless in the first quarter Saturday, it was the first time a Troy game didn’t feature any first-quarter points since a 41-18 loss at Western Kentucky in 2011. \nWhere’s Waldo? Saturday’s game drew an announced crowd of 20,107 Read or Share this story: http://on.mgmadv.com/1ROYn1Q TOP VIDEOS", "external_links": [], "published": "2015-10-18T06:17:00.000+03:00", "crawled": "2015-10-18T17:49:20.414+03:00", "highlightTitle": ""}