{"organizations": ["Sevilla", "Manchester City"], "uuid": "b4f98440bccb275d59df8d46f6cc53d70d6d120e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sport.co.uk", "main_image": "http://images.sport.co.uk/150x150/16917a48889c29013ce5fd77a82ebe2a.jpg", "site_section": "http://feeds.feedburner.com/SportcoukNewsRssFeed", "section_title": "General Sports News from Sports.co.uk", "url": "http://www.sport.co.uk/football/manchester-city-v-sevilla-champions-league-match-preview/6967510/", "country": "JE", "title": "Manchester City v Sevilla: Champions League match preview", "performance_score": 0, "site": "sport.co.uk", "participants_count": 0, "title_full": "Manchester City v Sevilla: Champions League match preview", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T16:30:00.000+03:00", "replies_count": 0, "uuid": "b4f98440bccb275d59df8d46f6cc53d70d6d120e"}, "author": "", "url": "http://www.sport.co.uk/football/manchester-city-v-sevilla-champions-league-match-preview/6967510/", "ord_in_thread": 0, "title": "Manchester City v Sevilla: Champions League match preview", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Manchester City v Sevilla: Champions League match preview By Goose (columnist) 21 Oct 2015 13:30:40 \nreads \ncomments \nManuel Pellegrini insists Yaya Toure is happy at Manchester City. \nToure claimed in an interview this week that he deserves greater recognition from the media for his achievements at the club. \nThe midfielder told French newspaper L'Equipe he was not happy with the situation despite winning titles and earning lots of money, but manager Pellegrini has stressed it is important not to interpret Toure's comments as meaning he is unhappy with life at the club. \nPellegrini, speaking at a press conference to preview Wednesday's Champions League game against Sevilla, said: \"He says he is not happy about (not being) recognised, (so people say) he is not happy here. But he is happy. \n\"It is different to not be happy about the criticism or the recognition than to not be happy. They are different words. You can interpret how you want but I think Yaya is happy here. He doesn't have any problems. \n\"I don't think I have to answer how important Yaya is. The answer is in his performances in the last four years. He always demonstrates it every game he plays.\" \nPellegrini again confirmed injured Sergio Aguero would be sidelined for a month, and added: \"He will be a big loss tomorrow but we have a good enough squad to make up for the losses.\" \nCity go into the game level on three points with Sevilla in Group D, three behind leaders Juventus. The Blues' home record in the competition is not impressive, with just three wins from the last 12 games, but Pellegrini insists that is irrelevant. \nHe said: \"I don't know the exact statistics but they are the numbers and of course we must improve. But we are just thinking about one game, not what happened in the past. We play against a difficult team and we hope we can win.\" \nSevilla coach Unai Emery is focusing only on the success of his side despite the plaudits that continue to come his way. \nEmery is fresh from learning he has made the shortlist for FIFA World Coach of Year, having guided Sevilla last season to a second successive Europa League triumph. \nThe 43-year-old said: \"It is a recognition for everyone at Sevilla, not just me. It is almost a thank you for everyone.\" \nEmery is not reading too much into Aguero's absence for City, saying: \"We judge the XI City are putting out. We don't wait for the players that are missing. \n\"City are a great squad with great individual players. Whether one plays or one doesn't play, they have still got a strong squad. But we also know we are capable of playing well. We can create problems.\" \nFormer Stoke and Blackburn midfielder Steven Nzonzi has been a regular starter in the Sevilla side this season but has struggled to settle since his summer move from the Britannia Stadium. \nIt has also emerged that the 26-year-old is set to stand trial in Cheshire in December having been accused of assaulting his wife. \nEmery said: \"We know he has a lot of quality and he has more to offer. I think he is settling in generally and in a footballing sense but obviously it takes time and we need to protect him and encourage him to work.\" \nOn whether the personal issue may be affecting him, Emery said: \"I see him totally focused on the work in hand.\" Related Sport News", "external_links": [], "published": "2015-10-21T16:30:00.000+03:00", "crawled": "2015-10-21T20:15:56.417+03:00", "highlightTitle": ""}