{"organizations": [], "uuid": "5850d3ec01dd88423a5034a0d7ad2b1ff0f65e65", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.startribune.com", "main_image": "http://stmedia.stimg.co/ows_143891704752875.jpg?h=630&amp;w=1200&amp;fit=crop&amp;bg=999&amp;crop=faces", "site_section": "http://www.startribune.com/sports/index.rss2", "section_title": "Sports", "url": "http://www.startribune.com/diggs-practice-skills-now-helping-vikings-win-games/333945341/", "country": "US", "title": "Hartman: Diggs' practice skills now helping Vikings win games", "performance_score": 0, "site": "startribune.com", "participants_count": 1, "title_full": "Hartman: Diggs' practice skills now helping Vikings win games - StarTribune.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T06:51:00.000+03:00", "replies_count": 0, "uuid": "5850d3ec01dd88423a5034a0d7ad2b1ff0f65e65"}, "author": "Mark Vancleave", "url": "http://www.startribune.com/diggs-practice-skills-now-helping-vikings-win-games/333945341/", "ord_in_thread": 0, "title": "Hartman: Diggs' practice skills now helping Vikings win games", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Stefon Diggs is a rookie from Maryland, but he already has tied a Vikings first-year receiving record last achieved by Randy Moss in 1998 with 80 or more receiving yards in consecutive games.\nDiggs, who wound up with seven receptions for 129 yards in the Vikings’ 16-10 victory over the Kansas City Chiefs on Sunday, was the 10th selection of the fifth round. But he certainly has contributed as much or more than draft choices taken ahead of him.\nDiggs caught a 30-yard pass from quarterback Teddy Bridgewater on a third-and-15 situation, leading to a 45-yard field goal by Blair Walsh to make the score 16-10 with 4 minutes, 46 seconds to play, when the Chiefs were threatening to make it difficult for the Vikings to win. Diggs nearly broke free for a touchdown on the play, but Chiefs safety Eric Berry made a great tackle to stop him.\nIn explaining the key reception, Bridgewater said Kansas City rushed only three defenders, so he knew he would have a little time to make the throw.\n“Stefon did a great job of just staying alive and understanding down and distance,” Bridgewater said. “The offensive line did a great job of protecting on that play and allowing me to move through the pocket. Like I say, Stefon was in the right place at the right time.”\nDiggs was asked if it was in the game plan for him to have such a key role. Minnesota Vikings wide receiver Stefon Diggs at Winter Park.\n“It evolved as the game went on,” he said. “In practice, you don’t know what you are going to get. You know what you’re going to get [from] what you see on film, but you don’t know if they’re going to switch things up. So really, I was on the fly and I was trying to be there for my team.”\nDiggs was also asked if this was the most fun he has had playing the game.\n“Yeah, it’s the most fun I’ve had in a while,” he said.\nVikings safety Harrison Smith , who has to defend against Diggs in practice, said the players have seen these kinds of performances from Diggs in practice since he got here.\n“He is obviously an explosive player,” Smith said. “He has great hands. In my opinion, he already has a great understanding of the game as a rookie wide receiver. He knows how to get that good separation. He is just a ballplayer. He goes up and makes plays. He is incredibly well-rounded for being such a young guy.”\nYou have to give Vikings General Manager Rick Spielman a lot of credit. He keeps coming up with great receivers, and right now, I don’t believe the club’s array of receivers has a match in the league.\nChildress plan for AP?\nIf anybody knows how to stop Adrian Peterson , it would be Brad Childress , who coached the great Vikings running back for 4&frac12; years. Now a Chiefs assistant coach, Childress, as the Vikings head coach, watched miles of film of opposing defenses looking for ways to stop the 2012 NFL MVP.\nPeterson has had some bad games in the past, but I can’t ever remember Peterson finishing one half with 17 carries for 16 yards, a longest run of 6 yards and an 0.9 average.\nHis best quarter was the third, when he had five carries for 25 yards. He wound up with 60 yards on 26 carries, a 2.3 average, with a longest run of 23 yards.\nYes, I know that all of the Vikings experts in town won’t give Childress any credit for forcing the Viking to pass for 237 yards and rush for only 84. but I am willing to give him some credit for the Chiefs’ great defense of Peterson.\nFollowing the game, Peterson agreed that Childress would know about any weakness he had and gave Childress some credit for stopping him.\nAs for Childress, he said Peterson just had a bad day. Overall, Childress was impressed with the Vikings and especially liked the potential of Bridgewater, who didn’t have one of his best days in completing 17 of 31 passes for 249 yards, one touchdown and a poor 65.1 passer rating.\nGreat 2015 draft\nThe 2015 draft for the Vikings is going to go down as one of their best in recent years.\nOne of those choices, third-round pick and LSU defensive end Danielle Hunter , put on a good show Sunday as a surprise starter for Everson Griffen , who was a scratch because of an illness.\nHunter didn’t know he was going to start until before the game, when the position coaches approached him, he said, and told him “ ‘This is what you have been practicing for. Any time can be your time,’ ” Hunter said. “When it came time for me to go out there, I was ready for it. We practiced all week and we always have to be ready for the game.”\nAbout the sack he shared with defensive tackle Sharrif Floyd , Hunter said: “It was something we practiced all week, using our hands and going inside. Sharrif was there to help me out with the sack.”\nHunter also forced a fumble with 4:38 left in the game when it appeared the Chiefs could score and possibly win the game.\n“I was going in and saw [Chiefs running back Charcandrick West ] coming, saw the ball, so I reached for the ball and tried to make the tackle at the same time.”\nWalsh sets record\nBlair Walsh had to be concerned during the preseason when he missed several extra-point and field-goal attempts.\nBut he credited spending a lot of time at TCF Bank Stadium, kicking and testing how the wind affected his kicks. He was perfect against the Chiefs, making an extra point and three field goals, the longest from 45 yards.\nOn Sunday, Walsh became the fifth kicker in Vikings history to surpass 400 points.\nKendricks improved\nNot many rookie draft choices can step in as a starter and do a good job. But linebacker Eric Kendricks is showing improvement every game since replacing Gerald Hodges , who was traded to the 49ers.\nKendricks, one of three 2015 draft choices to see a lot of action Sunday, said: “I feel like I am seeing a lot more things. The game is starting to slow down for me, starting to read things before it’s happening [and] starting to key on what the offense is doing. I am playing more patient for the most part.”\nHow much has former UCLA teammate Anthony Barr helped you?\n“He has been a great help,” Kendricks said. “He went through the same process a year ago … so he gives me little keys here and there. The whole linebacker group as a whole, we learn from each other.”\nYes, it is kind of amazing that three players — Kendricks, Barr and punter Jeff Locke — played on the same UCLA team and now they are together again with the Vikings.\nSid Hartman can be heard weekdays on 830-AM at 7:40 and 8:40 a.m. and on Sundays at 9:30 a.m. shartman@startribune.com", "external_links": ["http://stmedia.stimg.co/ows_143891704752875.jpg?w=263"], "published": "2015-10-19T06:51:00.000+03:00", "crawled": "2015-10-19T13:40:32.392+03:00", "highlightTitle": ""}