{"organizations": [], "uuid": "19c60b20706c3b0f7ea507c150095b35e1b6b577", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mcall.com", "main_image": "http://www.trbimg.com/img-562419bf/turbine/mc-steelers-cardinals-1018-20151018", "site_section": "http://www.mcall.com//sports/rss2.0.xml", "section_title": "Sports - The Morning Call", "url": "http://www.mcall.com/sports/football/mc-steelers-cardinals-1018-20151018-story.html", "country": "US", "title": "Steelers beat Cardinals 25-13", "performance_score": 0, "site": "mcall.com", "participants_count": 1, "title_full": "Steelers beat Cardinals 25-13 - The Morning Call", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T02:12:00.000+03:00", "replies_count": 0, "uuid": "19c60b20706c3b0f7ea507c150095b35e1b6b577"}, "author": "mcall.com", "url": "http://www.mcall.com/sports/football/mc-steelers-cardinals-1018-20151018-story.html", "ord_in_thread": 0, "title": "Steelers beat Cardinals 25-13", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "PITTSBURGH (AP) — Landry Jones spent most of the first two-plus years of his career trying to prove he belonged in the NFL.\nIn one sensible and steady half, he answered them all.\nJones threw two touchdown passes to Martavis Bryant in relief of Michael Vick and the Pittsburgh Steelers rallied for a 25-13 win over the Arizona Cardinals on Sunday.\nVick left in the third quarter with a hamstring injury and Pittsburgh's offense took off when Jones took over. Jones hit Bryant for an 8-yard score to give the Steelers the lead. The two hooked up later for an 88-yard strike as the Steelers (4-2) won their second straight.\nJones completed 8 of 12 passes for 168 yards and the two scores. Bryant caught six passes for 137 yards in his first action of the season. Le'Veon Bell ran for 88 yards and rookie Chris Boswell kicked three long field goals for the Steelers.\nCarson Palmer threw for 421 yards with a touchdown and two interceptions. John Brown caught 10 balls for 196 yards but the Cardinals collapsed in the second half to ruin a homecoming of sorts for coach Bruce Arians.\nArians was pushed out by the Steelers after the 2011 season, something he jokingly called a \"refirement.\" Nearly four years — and two NFL Coach of the Year Awards — later, Arians returned to Heinz Field with one of the best teams in football.\nFor a half, the Cardinals certainly looked like it.\nArizona dominated the opening 30 minutes, outgaining the Steelers 279-59 and doing whatever it wanted. All that dominance, however, only translated into a 10-3 lead.\nThe Cardinals had a touchdown wiped out on an offensive pass interference penalty, saw a second-and-3 at the Pittsburgh 25 turn into a punt and allowed the Steelers to hang around far too long.\nVick, who dazzled late in a thrilling last-play win at San Diego on Monday night, actually left twice. He exited for a couple of snaps in the second quarter after getting what the team called \"dirt in his eye\" at the end of a 10-yard scramble and was pulled for good in the third quarter after tweaking his right hamstring.\nEnter Jones, who has struggled to distinguish himself in three seasons as the third-stringer behind Ben Roethlisberger.\nThrust into the first meaningful action of his pro career — his last college game at Oklahoma saw the Sooners lose to Johnny Manziel and Texas A&M in the 2013 Cotton Bowl — Jones showed remarkable poise. He hit Bryant for a leaping 8-yard touchdown grab in the back of the end zone to give the Steelers a 12-10 lead.\nJones later hit Bryant for a 23-yard gain and Brown with a pretty back shoulder throw, both of which set up Boswell field goals, the last of which gave the Steelers a five-point lead with 7:13 to play.\nPittsburgh's resurgent defense made it stand up. Mike Mitchell picked off Palmer in the end zone to end Arizona's next possession. Rather than play it conservatively to run the clock out, the Steelers instead attacked.\nJones found Bryant over the middle and the wide receiver — who missed the first four games after violating the NFL's substance abuse and sat out the San Diego game with a knee injury — bolted down the sideline on his way to a clincher few saw coming.\n———\nAP NFL website: www.pro32.ap.org and www.twitter.com/AP—NFL", "external_links": ["http://www.twitter.com/AP&#8212;NFL"], "published": "2015-10-19T02:12:00.000+03:00", "crawled": "2015-10-19T03:34:25.212+03:00", "highlightTitle": ""}