{"organizations": [], "uuid": "53f5a446e2bdb2fdbd8af31f28bc30753dca2f45", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.deseretnews.com", "main_image": "http://img.deseretnews.com/images/article/hires/200/200.jpg", "site_section": "http://deseretnews.com/sports/index.rss", "section_title": "Sports news and headlines for the Utah Jazz, BYU Cougars, Utah Utes and high schools, Salt Lake City sports, Utah sports  - Deseret News", "url": "http://www.deseretnews.com/article/865638897/Utah-football-video-No-4-Utes-looking-to-snap-long-losing-streak-to-Arizona-State.html?pg=all", "country": "US", "title": "Utah football video: No. 4 Utes looking to snap long losing streak to Arizona State", "performance_score": 0, "site": "deseretnews.com", "participants_count": 2, "title_full": "Utah football video: No. 4 Utes looking to snap long losing streak to Arizona State | Deseret News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 1, "uuid": "de36dc51ba79e3c1603ff66a691b2f98b341b958"}, "author": "Carter Williams", "url": "http://www.deseretnews.com/article/865638897/Utah-football-video-No-4-Utes-looking-to-snap-long-losing-streak-to-Arizona-State.html?pg=all#post-0", "ord_in_thread": 0, "title": "Utah football video: No. 4 Utes looking to snap long losing streak to Arizona State", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The No. 4 Utes are the last remaining undefeated team in the Pac-12, but face Arizona State on Saturday. Utah is 0-4 against the Sun Devils and haven't beaten ASU since 1976.\nUpcoming Games Utah Football Utah   ASU @ Utah Rice-Eccles Stadium, Salt Lake City Oct. 17, 8:00 p.m. 4  Days   18  Hrs   40  Mins   57  Secs More Coverage Brad Rock: Whittingham looks the part as a natural fit for USC job Utah notebook: Booker, Hackett win weekly Pac-12 awards Utes are the lone undefeated team in the Pac-12 SALT LAKE CITY — The No. 4 Utes are the last remaining undefeated team in the Pac-12, but a difficult task lies ahead with Arizona State this weekend.\nUtah is 0-4 against the Sun Devils since joining conference and hasn’t beaten the Sun Devils since a 31-28 victory on Nov. 13, 1976. Arizona State (4-2, 2-1) will enter the contest with a 20-6 series lead since the two teams first matched up in 1961.\n“They’re well-coached. They’re a good team. They have good athletes,” Utah head coach Kyle Whittingham said, during the Utes’ weekly press conference Monday. “We’ve played them down to the wire last year, and the year before and came up short.”\nThe Utes fell to ASU 19-16 in overtime last year, and the goal this week is to finally win one against the Sun Devils. They know that this is a new year and a chance to do it.\n“We haven’t beaten these guys, and that’s not OK with us, and we’re going do everything we can this week to change that,” said Utah offensive lineman J.J. Dielman, who hails from Ahwatukee, Arizona, and grew up not too far from the ASU campus.\nWhat has made ASU such a difficult matchup for the Utes over the past few years?\n\"They definitely like to bring pressure and make it hard for a QB to get comfortable and everything,\" Utah quarterback Travis Wilson said. Wilson added it puts and extra emphasis on knowing what the Sun Devil defense is doing.\n\"It's my job. I'm just aware of what they're doing and making smart decisions,\" he said.\nWatch the video above for more reaction from Whittingham and players as the Utes prepare to take on the Sun Devils this week.", "external_links": [], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-13T10:20:10.745+03:00", "highlightTitle": ""}