{"organizations": [], "uuid": "6fa704c9722b82601cd52e6f3011209d24148aab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.commercialappeal.com", "main_image": "http://media.jrn.com/images/515337.jpg", "site_section": "http://www.commercialappeal.com/sports/other/index.rss", "section_title": "Other Sports", "url": "http://www.commercialappeal.com/sports/other/2012-gold-medalist-claressa-shields-ready-for-olympic-womens-boxing-trials-22c7b772-5324-70b2-e053-0-336682831.html", "country": "US", "title": "2012 gold medalist Claressa Shields ready for Olympic women’s boxing trials", "performance_score": 0, "site": "commercialappeal.com", "participants_count": 1, "title_full": "2012 gold medalist Claressa Shields ready for Olympic women’s boxing trials", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T01:14:00.000+03:00", "replies_count": 0, "uuid": "6fa704c9722b82601cd52e6f3011209d24148aab"}, "author": "Pete Wickham", "url": "http://www.commercialappeal.com/sports/other/2012-gold-medalist-claressa-shields-ready-for-olympic-womens-boxing-trials-22c7b772-5324-70b2-e053-0-336682831.html", "ord_in_thread": 0, "title": "2012 gold medalist Claressa Shields ready for Olympic women’s boxing trials", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sometime next summer Claressa Shields hopes to add another line to an already heady resume — one that no American boxer, male or female, has ever claimed.\n\"Two-time Olympic gold medalist.\"\nThe confident 20-year-old middleweight from Flint, Michigan, continues the road to Rio de Janeiro 2016 Monday night as the U.S. Women's Olympic Boxing Trials begin a weeklong run at Cook Convention Center. She does so as the reigning World, Pan Am Games and USA Boxing national champion, with a 62-1 record.\n\"She's always been an unusual kind of boxer and competitor,\" said Dr. Christy Halbert, who helped coach Team USA in the 2012 London Games — the Olympic debut for female boxers. \"She comes in at age 16, so young, so explosive with so much potential, but totally untested in international competition. She wins the trials, then loses a qualifying-round match (to Britain's Savannah Graham), goes into the Games unseeded ... then dusts herself off and wins gold against a (Russian) fighter nearly twice her age.\"\nShields has not lost since. \"She's the boxer to beat, and I know she enjoys that kind of pressure,\" Halbert said. \"She does her best when opponents are trying their best to beat her.\"\nTo hear her talk of the journey from her first plane flight to the 2011 Trials to now ... it's like going from caterpillar to cocoon to butterfly — yes, one that stings like a bee. She likes where she is now as she prepares to negotiate the eight-woman middleweight field in Memphis.\n\"It was just me and my former coach (Jason Crutchfield) who trained me from the time I was 11, and darn near raised me,\" she said. \"I was literally in a cocoon, with him making all the decisions. This time my family and boyfriend (USA national welterweight champ Ardreal Holmes) will be here. I'm making more decisions for myself. Financially things are better. Lots of endorsement doors are opening.\"\nAs for Shields the boxer? \"I'm bigger now. I'm at the (165-pound) weight limit instead of boxing at 158. I'm stronger. I'm faster. And I have the experience now to handle situations.\"\nShe said there are many top amateurs \"who don't want to fight small tournaments where they might run up against an unranked boxer and lose. ... Me, I treat every opponent like they're a world champ. They bring their A game, I'll bring my A-plus game.\"\nYear-round workouts at the Olympic Training Center in Colorado make her sure won't be outconditioned. \"You run four miles at altitude, you can run six anywhere else,\" she said, smiling.\nHer current coach, Leon Lawson, said, \"She likes to get in and brawl. We've been working more on hitting and not getting hit, hand speed and movement and making some things a little better. But her instincts and ability to break down an opponent are really good.\"\nRegular sparring with Holmes, who is 6-2, and other male boxers, allow the 5-10 Shields to also deal with the biggest shock she encountered onto the international stage.\n\"I think I'm tall, but I was seeing opponents 6-1, 6-2, 6-4 ... they were huge!\" she said with a smile.\nShe said that long before they started dating, she and Holmes (set for the U.S. Men's Trials in Reno this December) were sparring. \"We grew up doing that,\" she said, adding with a laugh, \"We'd rather beat each other up than let anyone else do it. ... We're trying to make each other a better boxer.\"\nShields looks forward to another stay in the Olympic Village, where she had the chance to hang out the likes of NBA Dream Team members Kevin Durant, Kobe Bryant and Carmelo Anthony. Still heady stuff.\nAfter that? Shields got interested in boxing after her father, Bo, told her stories about Laila Ali (Muhammad's daughter), who is perhaps the most famous pro female boxer in recent memory. But other than Ali and Christy Martin, few women have made even semi-serious money boxing. MMA fighter Ronda Rousey currently has a chokehold on the attention, and dollars.\nBut now that women's boxing has finally been made part of the Olympics, Halbert said the sport's international federation \"may create some opportunities for women that could be very exciting.\"\nShields may be a perfect centerpiece. \"Claressa is an extremely entertaining fighter who always gives 100 percent when the bell rings,\" Halbert said. \"She's got an incredible presence and a winning smile.\"\nThe smile flashes when talking about the future. \"I believe I have the recognition and the ability where people will want to see me on TV,\" she said. \"I don't want to be the next Laila Ali of boxing. I'm the Claressa Shields of boxing — and they haven't seen anyone like me yet.\"\nOLYMPIC BOXING TRIALS\nWhat: U.S. Olympic women’s boxing trials and men’s trials qualifier\nWhen, where: Monday-Friday at Cook Convention Center, Saturday at the Canon Center\nWho: Twenty-four women will compete for three spots on the U.S. Olympic team headed to Rio de Janeiro for the 2016 Summer Games. Meanwhile, 414 men will compete for the final 20 spots at the U.S. Olympic men’s boxing trials Dec. 7-12 at Reno, Nevada.\nReturning Olympians: Claressa Shields (middleweight) of Flint, Michigan, won the gold medal in the inaugural Olympic women’s tournament in London four years ago. Marlen Esparza (featherweight) of Houston took bronze. Both won gold at last year’s World Championships in South Korea.\nDaily sessions: Noon (men) and 6 p.m. (women, men) Monday-Friday; 7 p.m. (finals) Saturday\nTickets: $15 (general admission), $25 (VIP Circle), available at the box office or through Ticketmaster. Portion of the proceeds will go to St. Jude Children’s Research Hospital.\nPromoted by: USA Boxing, Prize Fight Boxing\nPrincipal sponsors: City Gear, Homer Skelton Hyundai\nFor more info: teamusa.org/USA-Boxing", "external_links": [], "published": "2015-10-25T01:14:00.000+03:00", "crawled": "2015-10-25T09:30:08.590+02:00", "highlightTitle": ""}