{"organizations": ["Journal Media Group"], "uuid": "8963f3a6d8e4a03e5adee60f801d42ce5f881e97", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.knoxnews.com", "main_image": "http://mediaassets.knoxnews.com/photo/2015/10/22/PrepXtra_25631648_ver1.0_640_480.jpg", "site_section": "http://www.knoxnews.com/feeds/rssFeed?obfType=RSS_FEED&siteId=100106&categoryId=10004", "section_title": "Sports | KNS", "url": "http://www.knoxnews.com/sports/prepextra/playoff-picture-for-area-football-teams_85167647", "country": "US", "title": "Playoff picture for area football teams", "performance_score": 0, "site": "knoxnews.com", "participants_count": 0, "title_full": "Playoff picture for area football teams", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T05:49:00.000+03:00", "replies_count": 0, "uuid": "8963f3a6d8e4a03e5adee60f801d42ce5f881e97"}, "author": "", "url": "http://www.knoxnews.com/sports/prepextra/playoff-picture-for-area-football-teams_85167647", "ord_in_thread": 0, "title": "Playoff picture for area football teams", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Playoff picture for area football teams 10:49 PM, Oct 22, 2015 Copyright 2015 Journal Media Group. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed. Show Caption Next \nFootball playoff scenarios \nTwo weeks remain in the high school football season. Here's an early look at this year's playoff possibilities: \nRegion 1-6A \n*Moving On: Maryville, Bearden, Hardin Valley, Jefferson County, William Blount, Dobyns-Bennett, Science Hill, Bradley Central \nWhat's at Stake: Maryville clinches top seed in the region with a win over either Bradley Central on Friday or Hardin Valley on Oct. 30 or a Science Hill loss. … Bearden is assured the No. 2 seed in the region if it beats Science Hill and Jefferson County, but earns at least a first-round home playoff game with a win over either team and a Bradley Central or HVA loss. ... HVA will be no worse than a No. 6 seed with a win over William Blount, and can earn a No. 5 seed with a win and two Dobyns-Bennett losses. ... Jefferson County likely is a No. 7 seed unless it upsets either Dobyns-Bennett or Bearden. ... William Blount is assured the No. 8 seed with a loss to Hardin Valley or Bradley Central. \n*All Class 6A teams advance to playoffs. \nRegion 1-5A \nMoving On: Sevier County, Morristown West, Tennessee High \nOn the Bubble: Morristown East, Cocke County \nStaying Home: #Daniel Boone, #David Crockett \nWhat's at Stake: Sevier County clinched a regular-season region title by beating Morristown West on Thursday. Morristown East and Cocke County will play for the region's final playoff spot next Friday. \n#Ineligible for playoffs \nMoving On: West, Heritage, Halls, Gibbs \nStaying Home: South-Doyle, Powell \nWhat's at Stake: West has clinched the top seed in the region, and Heritage and Halls will play for the No. 2 seed during their regular-season finale next Friday. Gibbs will be the No. 4 seed. \nRegion 3-5A \nMoving On: Farragut, Oak Ridge, Campbell County, Clinton \nStaying Home: Lenoir City, Karns \nWhat's at Stake: Campbell County and Oak Ridge will play for a No. 2 seed on Oct. 30. Farragut has clinched the top spot in the region, and Clinton will be the No. 4 seed. \nRegion 1-4A \nOn the Bubble: Sullivan East, Cherokee, Sullivan South, Grainger \nStaying Home: Volunteer, Sullivan Central \nWhat's at Stake: Greeneville clinches a region title with a win and a Seymour loss. Grainger clinches a playoff berth with wins over Cherokee and Sullivan South. \nRegion 2-4A \nMoving On: Fulton, Central, Catholic \nOn the Bubble: Carter, Anderson County \nStaying Home: Union County \nWhat's at Stake: Fulton and Central will play for a region title in their season finale on Oct. 30. Anderson County and Carter will play for the region's final playoff spot on the same day. Catholic is the No. 3 seed. \nRegion 3-4A \nMoving On: Stone Memorial, East Hamilton, Livingston Academy \nOn the Bubble: Cumberland County, Hixson \nStaying Home: Sequoyah, Chattanooga Central \nWhat's at Stake: Cumberland County clinches the region's No. 4 seed with a win over either Stone Memorial or Chattanooga Central during the next two weeks or a Hixson loss to Livingston Academy. \nRegion 1-3A \nMoving On: Elizabethton, Pigeon Forge \nOn the Bubble: Northview Academy, Chuckey-Doak, Unicoi, Johnson County \nStaying Home: Claiborne, West Greene \nWhat's at Stake: Elizabethton can win the region on Friday by beating Chuckey-Doak, which is eliminated with a loss. Pigeon Forge clinches the No. 2 seed with a win over Johnson County. Northview will advance to the playoffs with a win over Unicoi. \nRegion 2-3A \nMoving On: Alcoa, Christian Academy of Knoxville, Kingston \nOn the Bubble: Scott, McMinn Central \nStaying Home: Loudon \nWhat's at Stake: Alcoa and CAK will play for a region title on Oct. 29. The winner of the Scott-McMinn Central game on Friday clinches the region's final playoff spot. Kingston is the No. 3 seed. \nRegion 2-2A \nMoving On: Grace Christian, Rockwood \nOn the Bubble: Austin-East, Sweetwater, Tellico Plains \nStaying Home: Wartburg, Oliver Springs \nWhat's at Stake: Grace Christian clinches a region title with a win over Tellico Plains and an Austin-East loss. The Rams play the Roadrunners next Friday. ... Sweetwater can clinch the No. 3 seed with a win over Austin-East. ... Rockwood wins the region if it wins its final two games and Austin-East beats Sweetwater and Grace Christian. ... Tellico Plains, with games left against Grace and Rockwood, needs to pair two wins with a Sweetwater loss or two Rockwood losses or two Austin-East losses to make the playoffs. \nRegion 1-1A \nMoving On: Cloudland, Oakdale, Hancock County, Unaka \nStaying Home: Concord Christian \nWhat's At Stake: Cloudland has clinched the region's No. 1 seed, and Oakdale will be No. 2. Friday's Hancock County-Unaka game will determine the final two seeds. \nRegion 2-1A \nStaying Home: Jellico, Midway \nOn The Bubble: Oneida, Coalfield, Sunbright \nWhat's At Stake: Greenback and Harriman will play for a region title on Friday. Coalfield clinches a playoff berth and eliminates Sunbright with a win over Jellico. If that happens, the Yellow Jackets will play Oneida for the No. 3 seed next Friday. \nEast/Middle Region District I \nMoving On: Friendship Christian, Donelson Christian, Webb, The King's Academy \nStaying Home: Mt. Juliet Christian \nWhat's At Stake: Webb wins the region with a win over The King's Academy next Friday and a Donelson Christian loss to Mt. Juliet. Friendship Christian will be the No. 1 seed if it wins its final two games and DCA beats Mt. Juliet or Webb loses to TKA. If the latter happens, TKA will be the No. 3 seed as long as DCA wins its region finale. \nChris Thomas Copyright 2015 Journal Media Group. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.", "external_links": [], "published": "2015-10-23T05:49:00.000+03:00", "crawled": "2015-10-23T06:00:38.527+03:00", "highlightTitle": ""}