{"organizations": [], "uuid": "77d02c77cded7661d720afb4207aca61c8294a69", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pendletontimespost.com", "main_image": "", "site_section": "http://pendletontimespost.com//feed/sec/6000/", "section_title": "PendletonTimesPost.com - Sports News", "url": "http://www.pendletontimespost.com/view/story/1c51a94f3a0a48cfafcf02f5f54ebd5c/FBN--Rams-Mistakes/", "country": "US", "title": "Fisher refuses to lay blame at Foles' feet", "performance_score": 0, "site": "pendletontimespost.com", "participants_count": 0, "title_full": "Fisher refuses to lay blame at Foles' feet", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:12:00.000+03:00", "replies_count": 0, "uuid": "77d02c77cded7661d720afb4207aca61c8294a69"}, "author": "", "url": "http://www.pendletontimespost.com/view/story/1c51a94f3a0a48cfafcf02f5f54ebd5c/FBN--Rams-Mistakes/", "ord_in_thread": 0, "title": "Fisher refuses to lay blame at Foles' feet", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["R.B. FALLSTROM", "Fisher"], "text": "Fisher refuses to put all blame for Rams' loss to Packer on Foles By R.B. FALLSTROM AP Sports Writer   8:11   8:12   \nPeople: \n\nST. LOUIS — Jeff Fisher isn't placing all the blame on Nick Foles. \nThe St. Louis Rams quarterback threw a career-worst four interceptions in Sunday's 24-10 loss at Green Bay, one of them returned for a touchdown, and said after the game he had to be a lot better. \nFisher, perhaps trying to let Foles off easy, said Monday there's always extenuating circumstances. \nPass protection has been iffy on a line that has two rookie starters, plus guard Rodger Saffold will probably be out at least a few weeks with a right shoulder injury. Foles was sacked three times and hit often by the Green Bay defense. \n\"You can't put them all on the quarterback,\" Fisher said. \"In our meeting, our message was, 'Everybody has to help the quarterback. Everybody.' And we will. And he'll take charge, too.\" \nHeading into the team's bye week, Fisher said the outcome could have been a lot worse given the Packers (5-0) are unbeaten. \n\"I think anybody that goes into Lambeau (Field), the way they are playing right now, and turns the ball over four times, lucky not to give up 40-50 points,\" Fisher said. \nFoles got a two-year contract extension before taking his first preseason snap for St. Louis (2-3). In addition to the interception returned for a 45-yard touchdown by rookie Quinten Rollins, he was picked off twice in the fourth quarter when the Rams were inside the Green Bay 10. \n\"Those turnovers really cost us,\" Foles said. \"But I'll continue to learn from it.\" \nThere were issues on defense, too with Trumaine Johnson and Lamarcus Joyner burned for touchdown passes by Aaron Rodgers. \n\"You can't give up explosive plays against the best in the business right now,\" Johnson said. \"If we could have eliminated those two explosive plays, there is no telling what the outcome might have been.\" \nGreg Zuerlein missed three field goal attempts, although one was blocked and the other two were from beyond 50 yards. \nThe one thing that really worked was handing off to rookie Todd Gurley. The first-round pick had a career-best 159 yards on 30 carries. \nThe Gurley factor helped the Rams win in time of possession for the first time, and they ran 70 plays to 59 for Green Bay. \nIn retrospect, Fisher said 30 carries is probably too high at this stage for Gurley, who has made two starts since coming off left knee surgery that ended his final college season at Georgia. But the coach couldn't resist going with the hot hand. \n\"It was just the way it went,\" Gurley said. \"If you are having a good game and the coaches keep feeding you, you just have to be prepared for that.\" \nFisher said defensive end Chris Long is week to week with a right knee injury and anticipated guard Rodger Saffold will miss some time with a shoulder injury. Fisher said Long's injury is a result of hyperextension, but that ligament damage has been ruled out, and considered that good news. \n\"It's a little bit more than a sprain,\" Fisher said. \"There's some pain things he has to deal with over the next few weeks.\" \nSaffold injured his right shoulder on the play that resulted in the interception return for a touchdown and was undergoing testing for potential labrum issues. He underwent surgery on the left shoulder in the offseason, and Fisher said the right shoulder was bent back, so doctors are looking for potential tears in the labrum. \nVeteran Garrett Reynolds is likely to start at guard for the time being. Besides taking tackle Rob Havenstein in the second round and guard Jamon Brown in the third, the Rams took Andrew Donnal in the fourth round and Cody Wichmann in the sixth. \nPlus, they're working in another rookie, Darrell Williams, who was undrafted. \nOnline: \nAP NFL website: http://www.pro32.ap.org and http://twitter.com/AP_NFL \nAll content copyright ©2015  ", "external_links": [], "published": "2015-10-13T03:12:00.000+03:00", "crawled": "2015-10-13T03:29:14.618+03:00", "highlightTitle": ""}