{"organizations": [], "uuid": "bb08ff2c57c1c7985111763c32f1befbf8b583bb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nola.com", "main_image": "http://imgick.nola.com/home/brightcove01/width620/img/13/268012958001/201510/396/268012958001_4523753742001_51240fa8-c649-4fca-b79d-1eb54e86d5b8-still.jpg?pubId=268012958001", "site_section": "http://www.nola.com/lsu/index.ssf/2015/07/", "section_title": "LSU Tigers Football, Baseball, Basketball | Sports &amp; Athletics NOLA.com", "url": "http://www.nola.com/lsu/index.ssf/2015/10/leonard_fournette_lsu_eddie_co.html", "country": "US", "title": "Leonard Fournette's extreme workout built a 'once-in-a-lifetime' athlete", "performance_score": 0, "site": "nola.com", "participants_count": 17, "title_full": "Leonard Fournette's extreme workout built a 'once-in-a-lifetime' athlete | NOLA.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T16:00:00.000+03:00", "replies_count": 16, "uuid": "69ee4bdf43694403026abd0e475ec97e08c294cd"}, "author": "Julie Boudwin, NOLA.com | The Times-Picayune", "url": "http://www.nola.com/lsu/index.ssf/2015/10/leonard_fournette_lsu_eddie_co.html#post-0", "ord_in_thread": 0, "title": "Leonard Fournette's extreme workout built a 'once-in-a-lifetime' athlete", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Before Leonard Fournette became a Heisman Trophy hopeful at LSU, the running back spent five years training with Eddie Compass, the former police chief of New Orleans, from eighth to twelfth grade.\nCompass was in a bad place, personally, after Hurricane Katrina, but then Fournette entered his life at a time when he wasn't interested in training a kid, or anyone for that matter.\n\"When I saw Leonard in eighth grade, I put him through a little quick workout that most kids usually tap out after 15 minutes ... not Leonard,\" Compass said. \"I worked him out for an hour and he wasn't even breathing hard.\n\"We clicked right away and he looked at me with that little look and said, 'You gonna be my trainer?' I said, 'I guess I am.' That's how it all started.\"\nFor the next five years, Compass devoted his own time and energy into helping the St. Augustine football team and its bell-cow back, Fournette, as the strength and conditioning coach.\nRoughly three days a week, Compass and Fournette worked out on their own, in addition to regular football practice with the Purple Knights.\nThe number of reps, sets and everything else is quite astonishing.\n\"Between 1,000 and 1,500 sit-ups, 300 and 500 pushups and four to six sets of 10 to 15 pull-ups three days a week,\" Compass said.\nEddie Compass, and his children, with Leonard Fournette during his time at St. Augustine. Photo courtesy of Eddie Compass And that wasn't everything.\n\"When I got him in eighth grade I couldn't believe how athletically talented he was. He was in better shape than most of the seniors. In his junior year I developed this fourth quarter concept, where I simulated a game time situation for his body. So I broke the workouts into four quarters.\n\"I put him on an elliptical machine for 15 minutes on full speed. Then I put him on this inverted sit-up machine I have; it works your deep core and we'd do five sets of 50. Then I'd put him on the pull-up machine and he'd do three sets of 15 pull-ups with 80 percent of his body weight. And I have the perfect pushup bar, so I'd make him do 25 pushups plus 25 pushups with the stabilizing bar. Then I'd make him do 50 regular pushups. All of that would equal one quarter, he'd get three minutes of rest and we'd do the routine three more times.\n\"And all this was all on his own time. The work we did was after practice or on days off. We did this in addition to the regular football workouts.\"\nCompass said people thought he was exaggerating when he described Fournette's workouts because it was so intense and that people would just show up to watch because they wouldn't believe it unless they saw it with their own eyes.\nThe workout only continued to get harder and more intense the older Fournette got.\n\"I had him do Yoga and a lot of the core work we did worked out the smallest muscles in his stomach. We would get deep, deep, deep into his core. When we would do pushups, I'd have him put his hands together in a diamond shape and he would have to go all the way down into the diamond with his chin using muscles you rarely use,\" said Compass, who also called Fournette a \"once-in-a-lifetime\" athlete and a better high school athlete than Marshall Faulk.\nEddie Compass working out in April of 2014 as Leonard Fournette watches and waits his turn. Julie Boudwin, NOLA.com | The Times-Picayune \"I also had him do pushups on his knuckles so he could build up his hands so he wouldn't fumble the ball. I did a lot of things with Leonard that I couldn't do with the average athlete. I got better as a trainer as Leonard got older. I sought help from some of the best in the business; Mackie Shilstone and some others.... Leonard was such a unique athlete I didn't want to mess him up. I studied and really expanded my field-set as a trainer working with an athlete like Leonard.\"\nCompass said Lorenzo Doss, a former Tulane defensive back now with the Denver Broncos, and his brother worked out with Fournette once. So did former LSU star Skylar Green. Compass said Green is the only athlete to start and finish the routine with Leonard, but it wasn't easy.\n\"It was an extremely challenging workout,\" Green recalled. \"That day we ended up doing so many pushups across the gym floor, I don't see how half of these guys actually finished the workout. The workout was fun, but extremely hard. For Leonard to be so young and to be mentally challenged like that speaks volumes for the type of character he has instilled in him. For as great as an athlete as he is, those type of workouts helped get him to the point he's at today.\nAuburn Tigers defensive back Tray Matthews (28) goes over the back of LSU Tigers running back Leonard Fournette (7) as he runs for a touchdown during second half action in Baton Rouge on Saturday, September 19, 2015. (Photo by Brett Duke, Nola.com | The Times-Picayune) BRETT DUKE \"I guarantee you that those workouts prepared him for everything he's doing right now at LSU. I was at LSU, so I know their workouts and how he's feeling; he's in the best shape of his life. It all started back in high school working out with Mr. Compass in that St. Augustine gym.\"\nIn Saturday's win against Eastern Michigan, Fournette became the first player in SEC history to rush for 200-plus yards in three straight games.\nGreen wanted to add something to all the Heisman talk: \"I'm not at all surprised with the success he's having. He's a special athlete. He's strong. He's already fast; been fast. In high school it was a man amongst boys and he's only getting better.\n\"With that being said, I hope he does win the Heisman. It's most definitely well-deserved and we haven't even seen the full Leonard Fournette yet. By the end of this football season I think he's going to have a very special year.\n\"I see it happening for him as for as the Heisman, I do.\"\nFournette was only a sophomore at the time Green joined his workout. And even then, he never complained.\n\"To tell you the God's honest truth, he never moped or moaned,\" Compass said. \"That was what was so unique about him. He was so mature even at 13 years old. He understood who he was at a very young age. He understood his gift from God.\n\"The most unique thing about Leonard to me, most kids that are that athletic don't work as hard because they don't have to. Leonard isn't just the greatest athlete, he's the hardest worker. That's the type of skill-set and quality that Michael Jordan had. When you put that combination together, you get greatness like Leonard.\"\nNeedless to say, Compass did not \"mess him up.\" Currently, Fournette has 864 rushing yards on 99 carries and 11 touchdowns in four games this season for LSU. In his freshman season, Fournette finished with 1,034 yards on 187 carries and 10 TDs.\nAnd as impressive and gaudy as Fournette's numbers are, that's not what impresses Compass the most about the back.\n\"Leonard isn't just the greatest athlete I've ever been around, he's the greatest person I have ever been around,\" he said. \"He's more giving and loving and humble and selfless than any person I've ever been around. My daughter used to swim and he'd come to all her swimming meets to cheer her on because he knew it meant something to her. Now, he'd be tired from practice, but he made a point to be at my kids' games. That's who Leonard Fournette is.\n\"As great as you think he is as a football player, he's 10 times that great as a person. That's the God's honest truth.\"", "external_links": [], "published": "2015-10-06T16:00:00.000+03:00", "crawled": "2015-10-09T23:48:21.447+03:00", "highlightTitle": ""}