{"organizations": [], "uuid": "2f4206a78f0874d28aa786f858802be13e30225b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seacoastonline.com", "main_image": "http://www.seacoastonline.com/storyimage/SO/20151024/SPORTS/151029511/AR/0/AR-151029511.jpg", "site_section": "http://www.seacoastonline.com/sports/highschool?template=rss&mime=xml", "section_title": "High School Sports - seacoastonline.com", "url": "http://www.seacoastonline.com/article/20151024/SPORTS/151029511/101032/SPORTS?rssfeed=true", "country": "US", "title": "Doyon steals show with 6 TDs, fueling Hawks past York", "performance_score": 0, "site": "seacoastonline.com", "participants_count": 1, "title_full": "Doyon steals show with 6 TDs, fueling Hawks past York", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T10:00:00.000+03:00", "replies_count": 0, "uuid": "2f4206a78f0874d28aa786f858802be13e30225b"}, "author": "Jay Pinsonnault jpinsonnault@seacoastonline.com", "url": "http://www.seacoastonline.com/article/20151024/SPORTS/151029511/101032/SPORTS?rssfeed=true", "ord_in_thread": 0, "title": "Doyon steals show with 6 TDs, fueling Hawks past York", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CLASS B SOUTH FOOTBALL: MARSHWOOD 49, YORK 14 Doyon steals show with 6 TDs, fueling Hawks past York Comment Posted Oct. 24, 2015 at 2:00 AM By Jay Pinsonnault Posted Oct. 24, 2015 at 2:00 AM » Social News YORK, Maine — Zach Doyon stood near the 50 yard line with his helmet in his right hand, sweat still rolling down his face, and he was somewhat amazed when a teammate flashed six fingers in his direction. The six fingers represented how many touchdowns the 6-foot-2, 200-pound senior scored as the Marshwood High School football team rolled past York, 49-14, on Friday in their Class B South rivalry game. Marshwood finished the regular season with a 6-2 record, while York closed at 2-6. The Wildcats found out about an hour after the game that they were eliminated from playoff contention when Greely handed Falmouth its first loss of the season, 16-6. Falmouth had clinched the top seed in the Class B South tournament before Friday’s game. Greely moved from 10th place to seventh with the victory, earning a playoff berth. “It’s very disappointing (not getting in),” York head coach Randy Small said. “The perfect storm had to happen for us not to get in, and it did. It would’ve been nice to go another week with these kids.” Doyon, in the first half alone, scored on runs of 30, 8, 46 and 54 — and he also caught a 34-yard touchdown on the final play of the half. Doyon’s sixth and final touchdown of the night came on a 47-yard pass which gave Marshwood a a 49-14 lead with 3:31 left in the third quarter. “I had no idea how many (touchdowns) I scored,” said Doyon, who was Marshwood’s fourth offensive option in last year’s run to the Class B state championship. “The offensive line played great. I thought we had a really strong counter game and we ran some great sweeps. Honestly, everything was working for us. York always plays us hard and we didn’t take them lightly.” Doyon gained 234 yards on just 12 carries in the first half alone, and finished the night with 241 yards on 14 carries. He also caught three passes for 131 yards, giving him 372 all-purpose yards. “(Doyon) is an outstanding athlete,” Marshwood head coach Alex Rotsko said. “He’s a big, rangy kid and has exceptional speed. I think that people don’t realize how fast he is because of his size. “He had some long runs. A couple of them I don’t know if he even got touched.” Rotkso continued: “I think the offensive line did a pretty job upfront and our running backs and wideouts also made their blocks downfield. When you make big plays like that, you have to have people downfield making their blocks.” Both coaches felt the tide of the game took a sharp turn in Marshwood’s favor when Doyon hauled in a 34-yard touchdown pass from junior quarterback Cole McDaniel on the final play of the half, increasing Marshwood’s lead to 35-14. “No question about it, that (touchdown) deflated us,” Small said. “We knew what they were running. We knew how to cover it and we just didn’t get it done. Going into halftime down 21 points is a lot different than 14. We lost the momentum.” York senior Ian Morrison seemed to have forced a fumble on the play before, ripping the ball out of Jack Spear’s hands. However, the officials ruled that Spear’s forward progress had been stopped and whistled the play dead. The Hawks scored on their first possession of the second half as McDaniel and Spear connected on a 6-yard scoring strike. Doyon scored Marshwood’s final touchdown two drives later on a 47-yard pass down the Hawk sideline. “(Doyon) had the game of his life against his rivals, good for him,” Small said. “We just couldn’t tackle tonight.” Senior Cullen McCarty got the Wildcats on the board with a 2-yard run with 8:54 left in the half, cutting Marshwood’s lead to 14-7. The touchdown was set up on a tough 30-yard run by LaBonte, giving the Wildcats a first-and-goal from the Marshwood 3. York scored its second touchdown of the night two drives later as LaBonte connected with a wide-open Andrew Miller in the middle of the field for a 17-yard score. Marshwood 7 28 14 0—49 York 0 14 0 0—14 First quarter Mar—Doyon 30 run (Horton kick), 4:00. Second quarter Mar— Doyon 8 run (Horton kick), 11:54. York— McCarty 2 run (LaBonte kick), 8:54. Mar—Doyon 46 run (Horton kick), 7:14. Mar—Doyon 54 run (Horton kick), 4:53. York—Miller 17 pass from LaBonte (LaBonte kick), 45.5. Mar—Doyon 34 pass from McDaniel (Horton kick), :00. Third quarter Mar—Spear 6 pass from McDaniel (Horton kick), 9:32. Mar—Doyon 47 pass from McDaniel (Horton kick), 3:31. Fourth quarter York—McCarty 4 run (conversion fails), 6:38. Noble—Rogers 21 pass from Keisker (Houston pass from Keiske), 5:55. INDIVIDUAL STATISTICS RUSHING—York, McCarty 18-70, Elsemore 12-54, LaBonte 5-36, Santoro 4-29, Small 1-0, Hogan 4-21. Marshwood, Goodwin 1-0, Taran 2-9, Doyon 14-241, Stacy 3-24, Glidden 4-72, Jackman 4-48, McDaniel 2-12. PASSING—York, LaBonte 7-14-1—60. Marshwood, McDaniel 6-8-0—190. RECEIVING—York, Hogan 2-24, Daley 2-14, Miller 1-17, Miller 1-19, Finitz 1-7, Bricker 1-6, McCarty 1-(minus 1). Marshwood, Doyon 3-131, Rogers 3-52, Houston 3-33, Davis 2-25, Spear 2-10, N. Tice 1-49, Hart 1-14, Pomerleau 1-9. MISSED FIELD GOALS—None.", "external_links": [], "published": "2015-10-24T10:00:00.000+03:00", "crawled": "2015-10-24T13:24:26.121+03:00", "highlightTitle": ""}