{"organizations": [], "uuid": "4add99e1a4b66f47b19edc54dfe314d3eaee6fd4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thetimesnews.com", "main_image": "http://www.thetimesnews.com/storyimage/NC/20151016/SPORTS/151019251/AR/0/AR-151019251.jpg", "site_section": "http://www.thetimesnews.com/sports?template=rss&mime=xml", "section_title": "Sports - The Times-News", "url": "http://www.thetimesnews.com/article/20151016/SPORTS/151019251/15215/SPORTS?rssfeed=true", "country": "US", "title": "Go time: Elon receiver breaks out with big plays, wants more", "performance_score": 0, "site": "thetimesnews.com", "participants_count": 1, "title_full": "Go time: Elon receiver breaks out with big plays, wants more", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T12:37:00.000+03:00", "replies_count": 0, "uuid": "4add99e1a4b66f47b19edc54dfe314d3eaee6fd4"}, "author": "Adam Smith Times-News asmith@thetimesnews.com", "url": "http://www.thetimesnews.com/article/20151016/SPORTS/151019251/15215/SPORTS?rssfeed=true", "ord_in_thread": 0, "title": "Go time: Elon receiver breaks out with big plays, wants more", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted Oct. 16, 2015 at 1:09 AM Updated at 4:37 AM ELON — Six games in, Tre Lennon’s football season might have found its true beginning. That’s the Elon receiver’s hope and goal after his 110-yard performance last week at Richmond, a long-sought eruption that produced both a career day for the sophomore Lennon and the best receiving yardage output for the Phoenix this year. “I say that was a start for the rest of the season,” he said. “It gave me a little bit more confidence about myself. The deep pass and the deep plays are a very important part of the game. They’ve got to be there.” Consistency has been an issue for Lennon, the rangy vertical threat who delivered a breakthrough last year as a true freshman, yet still remains a young and developing piece of Elon’s young and developing offense. He entered last week having failed to surpass 30 yards or score in a game this season, a struggle to get connected with freshman quarterbacks Daniel Thompson and Connor Christiansen that he said created personal disappointment and also prompted supportive text messages from family members and former high school coaches. A low point arrived in the third week of the season, when Lennon, a prep standout at Greensboro Smith, caught just one pass for 5 yards against hometown North Carolina A&T. “That’s like my homecoming game, and that’s not me,” he said. “Just trying to get in a rhythm with the quarterbacks, it’s been a hard process for me to get used to both of them.” Now, with Thompson gaining control as the acknowledged quarterback starter and first-stringer, that figures to be changing for the better. The over-the-top bombs he hauled in for a 54-yard touchdown and a 39-yard gain in the second half at Richmond certainly delivered an encouraging feeling all around. Until then, the 6-foot-4 Lennon had been a deep target without a catch longer than 15 yards this season. “I gave him a shot on two balls and he went and got both of them,” Thompson said. “You’ve got to have those big-chunk plays. You can’t expect to have 16-play drives.” Said Elon coach Rich Skrosky: “He had two big ones, but we need to see that more consistently. That game, Daniel working more with him, hopefully this is that catapult that solidifies him. You hope those guys get to a point where they’re hitting on all cylinders. We’re not there yet, but we definitely made progress against a good team.” Lennon ended an 11-game touchdown drought when he outfought Richmond cornerback Micah Keels on a post route late in the game. That provided relief, he said. Page 2 of 2 - “When I crossed them lines, it felt like a weight just dropped off me,” he said. Last October, a coming-of-age moment seemed to be supplied when Lennon had a breakout of seven catches for 95 yards and two touchdowns at Delaware, the most substantial game for an Elon freshman receiver since 2008. He followed that with four straight games of at least five catches down the stretch of last season. But coming off a promising offseason, with his weight up nearly 20 pounds to a still-thin 185 pounds, Lennon’s slow start extended beyond the N.C. A&T game. Against Gardner-Webb, Towson and New Hampshire, he eclipsed neither four catches nor 27 yards. “He’s been a little bit up and down,” Skrosky said. “It takes time with maturity. It takes time mentally. It takes time with your quarterback.” For Lennon, the time is now. “I’ve told myself, ‘Look, this is it. You’ve got to be the man they want you to be,’” he said. Kickoff Who : No. 5 James Madison (6-0, 3-0) at Elon (2-4, 1-2) When : 3 p.m. Saturday Series : James Madison leads 3-0 By Adam Smith", "external_links": [], "published": "2015-10-16T12:37:00.000+03:00", "crawled": "2015-10-16T15:26:36.885+03:00", "highlightTitle": ""}