{"organizations": [], "uuid": "d9276770c16e34d4371201c70f4b8be4c5848eb6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usatoday.com", "main_image": "http://www.gannett-cdn.com/-mm-/6facf5b3fb8eacd49819d5818103cc0cb5757497/c=0-285-5472-3363&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/10/13/USATODAY/usatsports/1cb31fc7e1b4a22d840f6a706700b5ab.jpg", "site_section": "http://www.usatoday.com/sports/", "section_title": "USA Today | Sports", "url": "http://www.usatoday.com/story/sports/soccer/2015/10/13/swiss-coach-marcel-koller-guides-austria-to-euro-2016/73860582/", "country": "US", "title": "Swiss coach Marcel Koller guides Austria to Euro 2016", "performance_score": 0, "site": "usatoday.com", "participants_count": 0, "title_full": "Swiss coach Marcel Koller guides Austria to Euro 2016", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T18:04:00.000+03:00", "replies_count": 0, "uuid": "d9276770c16e34d4371201c70f4b8be4c5848eb6"}, "author": "", "url": "http://www.usatoday.com/story/sports/soccer/2015/10/13/swiss-coach-marcel-koller-guides-austria-to-euro-2016/73860582/", "ord_in_thread": 0, "title": "Swiss coach Marcel Koller guides Austria to Euro 2016", "locations": ["Austria"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Marcel Koller"], "text": "(Photo: The Associated Press)\n1 CONNECT 1 TWEET LINKEDIN COMMENT EMAIL MORE VIENNA (AP) — For all the sporting rivalry between the neighboring countries, it took a coach from Switzerland to help Austria qualify for a European Championship for the first time.\nWidely greeted with skepticism when he was appointed four years ago, Marcel Koller has become the figurehead of Austria's resurrection, leading the team to its first major event since the 1998 World Cup.\nThe upswing under Koller has created a national buzz around the team, with stadiums selling out weeks in advance regardless of the opponent and fans carrying banners asking the Swiss coach to stay with Austria in years to come.\n\"I am happy, not for myself but for the Austrians, for the fans,\" Koller said Tuesday, a day after Group G winner Austria wrapped up Euro 2016 qualifying with a 3-0 win over Liechtenstein.\nPlayers and Koller stayed on the pitch for more than half an hour after the final whistle, celebrating their success with tens of thousands of fans.\nAfter drawing with Sweden in the opening game 13 months ago, Austria recorded nine straight victories, including two 1-0 wins over Russia. Only England had a better campaign, earning a perfect 30 points from 10 games.\nWhen FIFA rankings are updated, Austria will appear in the top 10 for the first time — coming from 70th place when Koller took over in 2011.\n\"It's nice, of course, but not something we are looking at,\" the coach said. \"It's not important to us.\"\nHowever, it might become important as Austria's progression won't go unnoticed with upcoming opponents. Once an underdog, Austria is now getting to a position where it starts many matches as favorites.\n\"That's what we wanted, we wanted to make this progress,\" Koller said. \"Opponents will take us more seriously now. Maybe that will make things a little bit harder for us. But we are not going to change much. There's not enough time to do that and it could unsettle the players.\"\nThe team's success has also resulted in an increasing demand for tickets.\nThe Austrian football federation said it received 70,000 requests for the Liechtenstein game in the 48,500-capacity Ernst Happel Stadium. And the first 10,000 seats for the Nov. 17 friendly against Switzerland were sold within hours after tickets went on sale Wednesday morning.\nThe euphoric state of the national team is in sharp contrast with October 2011, when Austria had missed out on yet another big event. The team took part in Euro 2008 as a co-host with Switzerland but hadn't qualified for a finals tournament in 13 years.\nCoach Dietmar Constantini stepped down, and while most fans and pundits were expecting a big name, Koller was announced as his replacement.\nA midfielder who spent his entire career as a player with Grasshoppers in Zurich, Koller played for Switzerland 55 times, including at Euro 1996 in England. He had coached FC Wil, St. Gallen, Grasshoppers and Bundesliga sides Cologne and Bochum but was not a household name in Austria.\nFans expressed their disappointment on social media and newspapers questioned whether Koller, a polite man keeping a low profile, could be the right coach to turn the tide.\nOpinions, however, quickly changed. Austria failed to qualify for the 2014 World Cup but signs of improvement were highly visible.\nAnd it wasn't a wonder recipe that helped Austria forward. Koller turned out to be a master in building a team and giving players confidence.\n\"I've always pointed out when something is good because that makes a player stronger,\" Koller said. \"My task is convincing the players of their own strengths and making sure that they take that attitude with them on the field.\"\nKoller hardly experiments and prefers to stick with his first-choice team — no matter if it's away at Sweden or at home against Liechtenstein. In each of its last four matches Austria started with the same lineup.\nAccording to captain Christian Fuchs, the match at Moldova a year ago proved the importance of Koller's team-building work. Austria didn't play well but still led 2-1 when Janko was sent off with a red card in the second half.\n\"In previous years we probably hadn't won that match,\" Fuchs said. \"Now we knew we could hold on to our lead. Everyone gave everything and fought for every ball. It was a true team performance.\"\n1 CONNECT 1 TWEET LINKEDIN COMMENT EMAIL MORE Copyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.\nTOP VIDEOS", "external_links": ["http://www.linkedin.com/shareArticle?url=http%3A//usat.ly/1REGwum&mini=true", "https://twitter.com/intent/tweet?url=http%3A//usat.ly/1REGwum&text=Swiss%20coach%20Marcel%20Koller%20guides%20Austria%20to%20Euro%202016&via=usatoday", "http://www.gannett-cdn.com/-mm-/e9f002cbb0a4fe7004f94522e8956058a4a8cc80/c=304-0-5168-3648&r=x404&c=534x401/local/-/media/2015/10/13/USATODAY/usatsports/1cb31fc7e1b4a22d840f6a706700b5ab.jpg"], "published": "2015-10-13T18:04:00.000+03:00", "crawled": "2015-10-13T19:56:58.971+03:00", "highlightTitle": ""}