{"organizations": ["NBA", "Los Angeles Lakers", "The Lakers", "AP Curry", "Lakers", "Golden State", "AP Image", "AP", "Warriors", "defense of Los Angeles Lakers", "Golden State Warriors"], "uuid": "55a1df1f5224d4b92dcfa477718bd7c472cca21c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.beaumontenterprise.com", "main_image": "http://ww4.hdnux.com/photos/41/46/70/8810027/3/rawImage.jpg", "site_section": "http://www.beaumontenterprise.com/sports/basketball/collectionRss/Sports-Basketball-Heds-7404.php", "section_title": "Sports Basketball Heds", "url": "http://www.beaumontenterprise.com/sports/article/Curry-scores-19-as-Warriors-beat-Lakers-in-6576161.php", "country": "US", "title": "Curry scores 19 as Warriors beat Lakers in shortened game", "performance_score": 0, "site": "beaumontenterprise.com", "participants_count": 0, "title_full": "Curry scores 19 as Warriors beat Lakers in shortened game", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T07:49:00.000+03:00", "replies_count": 0, "uuid": "55a1df1f5224d4b92dcfa477718bd7c472cca21c"}, "author": "", "url": "http://www.beaumontenterprise.com/sports/article/Curry-scores-19-as-Warriors-beat-Lakers-in-6576161.php", "ord_in_thread": 0, "title": "Curry scores 19 as Warriors beat Lakers in shortened game", "locations": ["Southeast Texas", "San Diego", "Los Angeles", "Portland", "SAN DIEGO"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kobe Bryant", "D'Angelo Russell", "Anthony Brown", "Roy Hibbert", "Curry", "Jordan Clarkson", "Nick Young", "Ezeli Festus", "Julius Randle", "Jason Thompson", "Lenny Ignelzi", "Stephen Curry"], "text": "Close Image 1 of 6 Los Angeles Lakers guard Jordan Clarkson drives to the basket as Golden State Warriors guard Stephen Curry attempts to knock the ball away from behind during the first half of a NBA preseason basketball game Saturday, Oct. 17, 2015, in San Diego. Los Angeles Lakers guard Jordan Clarkson drives to the basket as Golden State Warriors guard Stephen Curry attempts to knock the ball away from behind during the first half of a NBA preseason basketball game ... more Photo: Lenny Ignelzi, AP Image 2 of 6 Golden State Warriors guard Stephen Curry makes a three point shot over the defense of Los Angeles Lakers guard Jordan Clarkson in the first half of an NBA preseason basketball game Saturday, Oct. 17, 2015, in San Diego. Golden State Warriors guard Stephen Curry makes a three point shot over the defense of Los Angeles Lakers guard Jordan Clarkson in the first half of an NBA preseason basketball game Saturday, Oct. 17, 2015, ... more Photo: Lenny Ignelzi, AP Image 3 of 6 Golden State Warriors forward Draymond Green drives against Los Angeles Lakers center Roy Hibbert and Jordan Clarkson in the first half of an NBA preseason basketball game Saturday, Oct. 17, 2015, in San Diego. Golden State Warriors forward Draymond Green drives against Los Angeles Lakers center Roy Hibbert and Jordan Clarkson in the first half of an NBA preseason basketball game Saturday, Oct. 17, 2015, in San Diego. Photo: Lenny Ignelzi, AP Image 4 of 6 Golden State Warriors guard Stephen Curry drives around the defense of Los Angeles Lakers forward Anthony Brown in the first half of an NBA preseason basketball game Saturday, Oct. 17, 2015, in San Diego. Golden State Warriors guard Stephen Curry drives around the defense of Los Angeles Lakers forward Anthony Brown in the first half of an NBA preseason basketball game Saturday, Oct. 17, 2015, in San Diego. Photo: Lenny Ignelzi, AP Image 5 of 6 Golden State Warriors guard Stephen Curry splits Los Angeles Lakers' D'Angelo Russell, left, Roy Hibbert, center, and Jordan Clarkson while distributing a pass on a fast break in the first half of a NBA preseason basketball game Saturday, Oct. 17, 2015, in San Diego. Golden State Warriors guard Stephen Curry splits Los Angeles Lakers' D'Angelo Russell, left, Roy Hibbert, center, and Jordan Clarkson while distributing a pass on a fast break in the first half of a NBA ... more Photo: Lenny Ignelzi, AP Image 6 of 6 Golden State Warriors guard Stephen Curry battles for a loose ball with Los Angeles Lakers forward Julius Randle in the first half of an NBA preseason basketball game Saturday, Oct. 17, 2015, in San Diego. Golden State Warriors guard Stephen Curry battles for a loose ball with Los Angeles Lakers forward Julius Randle in the first half of an NBA preseason basketball game Saturday, Oct. 17, 2015, in San Diego. Photo: Lenny Ignelzi, AP Curry scores 19 as Warriors beat Lakers in shortened game 1 / 6 Back to Gallery SAN DIEGO (AP) — Jordan Clarkson scored 17 points and Julius Randle had 14 to lead the Los Angeles Lakers to an 85-70 win over the Golden State Warriors on Saturday night in a preseason game that was stopped late in the third quarter due to unplayable conditions on the court. The game was called with 2:16 left in the third because of moisture spots caused by the ice below the court at the Valley View Casino Center . WARRIORS: Stephen Curry led all scorers with 19 points and had four assists. ... Ezeli Festus had 10 points and nine rebounds. ... Jason Thompson had a game-high 11 rebounds. LAKERS: Rookie guard D'Angelo Russell , the team's top pick, started after missing two games with a bruised glute and had two points. ... Kobe Bryant was out with a bruised left leg. STAR WATCH: Curry had 14 first-half points, included 4-for-8 shooting on 3-pointers. MIDSEASON FORM: The Lakers' Nick Young hit three straight 3-pointers in less than two minutes in the second quarter. On his third one, he was fouled and converted his free throw for a four-point play. UP NEXT: Golden State visits the Los Angeles Clippers on Tuesday. The Lakers host Portland in Los Angeles on Monday. Southeast Texas sports news", "external_links": [], "published": "2015-10-18T07:49:00.000+03:00", "crawled": "2015-10-18T09:09:30.581+03:00", "highlightTitle": ""}