{"organizations": [], "uuid": "9a1d0adb0c1cdf49607a14f11d10dca23dd446fe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.philly.com", "main_image": "http://media.philly.com/images/PE1BUDGET13.jpg", "site_section": "http://www.philly.com/", "section_title": "Philadelphia local news, sports, jobs, cars, homes - Philly.com", "url": "http://www.philly.com/philly/news/politics/20151014_Wolf___I_can_t_cave__in_budget_fight.html", "country": "US", "title": "Wolf: 'I can't cave' in budget fight", "performance_score": 0, "site": "philly.com", "participants_count": 1, "title_full": "Wolf: 'I can't cave' in budget fight", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "9a1d0adb0c1cdf49607a14f11d10dca23dd446fe"}, "author": "Chris Palmer,", "url": "http://www.philly.com/philly/news/politics/20151014_Wolf___I_can_t_cave__in_budget_fight.html", "ord_in_thread": 0, "title": "Wolf: 'I can't cave' in budget fight", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "HARRISBURG - Gov. Wolf is not backing off his stance that major changes are needed to fix the state's multibillion-dollar budget deficit, even after the Republican-controlled legislature voted down his proposal to raise revenues through a tax hike.\n\"I think there's a dawning awareness that I'm not going to cave on this, I can't cave on this,\" Wolf said Tuesday during a radio interview with KDKA-AM in Pittsburgh. \"I'm one of 12.7 million Pennsylvanians, and we've got to have our state on a sound financial basis. That's all I want.\"\nThe first-term governor said that even though every Republican House member and nine of his fellow Democrats rejected his tax proposal, \"there has to be a recognition\" in the Capitol that eliminating the deficit will require more than one-term revenue solutions.\nIn past years' budget negotiations \"both parties have basically been complicit in having a casual approach to our finances in Pennsylvania,\" Wolf said. \"We can't afford to do that anymore.\"\nWolf's plan would increase the state's personal income tax - from 3.07 to 3.57 percent - as well as impose a new tax on natural gas drillers. He has proposed using the funds to close the budget deficit and send more money to schools.\nBut the House soundly rejected that proposal last week, leaving the state's spending plan more than 100 days overdue, and putting Wolf and the legislature back at the bargaining table.\nNon-profits and school districts that rely on state aid have been without disbursements since July.\nRepublicans said after Wednesday's vote that Wolf should take the rejection as a sign that there is no support for significant tax increases to support his agenda.\nStill, Wolf said Tuesday that while he understood many agencies were suffering without cash infusions, he wouldn't settle for a budget just for the sake of time.\n\"I'm holding out for a permanent benefit here, for a long-term gain,\" he said.\nWolf said informal budget talks between staffers took place over the weekend, but he would not predict when the two sides might be able to reach a final accord.\ncpalmer@phillynews.com\n609-217-8305\n@cs_palmer", "external_links": [], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-13T18:43:49.208+03:00", "highlightTitle": ""}