{"organizations": ["USC", "USC AP", "Utah"], "uuid": "67a39596c6c09b27efb97231c6279cabcd87a014", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxsports.com", "main_image": "http://www.foxsports.com/content/fsdigital/fscom.img.png", "site_section": "http://api.foxsports.com/v1/rss?partnerKey=zBaFxRyGKCfxBagJG9b8pqLyndmvo7UU&tag=cfb", "section_title": "FOX Sports Digital", "url": "http://www.foxsports.com/college-football/story/no-3-utah-embraces-underdog-role-at-struggling-usc-102315?cmpid=feed:-sports-CQ-RSS-Feed", "country": "", "title": "No. 3 Utah embraces \"underdog\" role at struggling USC", "performance_score": 0, "site": "foxsports.com", "participants_count": 0, "title_full": "No. 3 Utah embraces \"underdog\" role at struggling USC", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T01:24:00.000+03:00", "replies_count": 0, "uuid": "67a39596c6c09b27efb97231c6279cabcd87a014"}, "author": "", "url": "http://www.foxsports.com/college-football/story/no-3-utah-embraces-underdog-role-at-struggling-usc-102315?cmpid=feed:-sports-CQ-RSS-Feed", "ord_in_thread": 0, "title": "No. 3 Utah embraces \"underdog\" role at struggling USC", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "No. 3 Utah embraces \"underdog\" role at struggling USC AP Oct 23, 2015 at 6:24p ET 0Shares \nLOS ANGELES (AP) Utah is the unbeaten No. 3 team in the nation, riding an eight-game winning streak and a world of confidence. The Utes are on the road this week against a .500 opponent with an interim head coach and three losses in its last four games. \nAnd Utah is still an underdog to Southern California in the odds-makers' eyes. \nEven during a season of utter upheaval for USC , the Trojans' storehouse of top talent still gets everyone's respect, including that of the cautious Utes (6-0, 3-0 Pac-12). \n''I don't think that anyone would argue (against the fact) that year in, year out, they're the most talented team in the Pac-12,'' Utah coach Kyle Whittingham said. ''We've got to be at our absolute best this week to have a chance. ... The Coliseum is a great venue. It's one of the most storied stadiums in the country, but I think it boils down to the talent level they have.'' \nYet the Utes clearly are doing more to turn their comparatively modest talent into winning football, while the Trojans (3-3, 1-2) are desperate for a confidence-boosting win. \nWhile Utah epitomizes the ideal of a non-marquee program reaching great heights under firm coaching guidance and steady growth, USC is becoming the epitome of a resource-rich program undone by inconsistency and weak leadership - but there's still time to save the season. \nInterim coach Clay Helton remained positive after USC gave up 41 points while losing his season debut at Notre Dame last week, and the Trojans have settled down after the tumultuous stretch that led to Steve Sarkisian's firing. \nEven if the odds-makers inexplicably favor USC, the Trojans hold the Utes in the respect they deserve. \n''Utah has been a tough team for the last couple of years, taking us to the fourth quarter every year,'' USC linebacker Su'a Cravens said. ''It's not surprising they're ranked where they are, but it's our job to knock them off. It's going to be a big win, but our season is still on track to win the Pac-12 South and go to the Pac-12 championship. That's still the goal. We're already motivated to play the No. 3 team, and we don't like losing at home, so that's the other motivation.'' \nThe game could be historic for Utah, which has a large alumni base in the Los Angeles area: The Utes haven't won at the Coliseum since 1916, losing twice since joining the Pac-12 a half-decade ago. \nHere are some more things to watch when the Utes try to end that 99-year drought: \nSTREAKING: The Trojans have lost their last two games. They haven't lost three straight since the close of their disastrous 2012 season under coach Lane Kiffin, and they haven't lost three straight regular-season contests since 2001, coach Pete Carroll's debut year. \nHEY COACH: Whittingham is high on many USC fans' wish lists to become the Trojans' next coach after building on Urban Meyer's success and turning Utah into a perennial winner. Whittingham was born in California, and he played for the Los Angeles Rams during the NFL strike season in 1987, but the coach has been a fixture on the Utah staff since 1994. Whittingham has refused to comment on the speculation linking him with the Trojans. \nBOOKER TRAIN: Helton compared Utah running back Devontae Booker to NFL great Roger Craig. ''The leg drive on contact is incredible,'' Helton said. ''He is just a very, very hard man to bring down.'' Defensive coordinator Justin Wilcox agrees: ''Their running back runs angry,'' he said. ''I'm impressed with him. He's got great balance.'' \nCOUSIN SU'A: Cravens has a surprising connection to Whittingham: Cravens' uncle, Ryan, is married to Whittingham's sister. Cravens would love to have bragging rights at the next family reunion. ''My cousin is the head coach, so that should be fun,'' Cravens said. ''He's been there forever. His recruits trust him to not take another job, and he's just done a great job recruiting and running what he wants to run. He's doing a great job over there in Salt Lake.'' \nFILLING GAPS: USC two-way threat Adoree Jackson is likely to play extensively on offense due to the Trojans' injury woes. Receivers Darreus Rogers and Steven Mitchell Jr . seem unlikely to play. Left tackle Chad Wheeler is also out with a concussion, dealing the second major injury blow to USC's offensive line. 0", "external_links": [], "published": "2015-10-24T01:24:00.000+03:00", "crawled": "2015-10-24T01:35:56.157+03:00", "highlightTitle": ""}