{"organizations": [], "uuid": "5236bf04e53a58ddd57a0543e7eace710795fa75", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sport.co.uk", "main_image": "http://images.sport.co.uk/150x150/d90be4da921c48837d06b71870f7512e.jpg", "site_section": "http://feeds.feedburner.com/SportcoukNewsRssFeed", "section_title": "General Sports News from Sports.co.uk", "url": "http://www.sport.co.uk/football/the-republic-of-ireland-a-history-of-playoff-heartache/6926853/", "country": "JE", "title": "The Republic of Ireland - a history of play-off heartache", "performance_score": 0, "site": "sport.co.uk", "participants_count": 0, "title_full": "The Republic of Ireland - a history of play-off heartache", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T12:01:00.000+03:00", "replies_count": 0, "uuid": "5236bf04e53a58ddd57a0543e7eace710795fa75"}, "author": "", "url": "http://www.sport.co.uk/football/the-republic-of-ireland-a-history-of-playoff-heartache/6926853/", "ord_in_thread": 0, "title": "The Republic of Ireland - a history of play-off heartache", "locations": ["Ireland"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Republic of Ireland - a history of play-off heartache By Goose (columnist) 12 Oct 2015 09:01:55 \nreads \ncomments \nThe Republic of Ireland's defeat in Poland on Sunday night means they now face the daunting prospect of tackling a two-legged play-off to qualify for Euro 2016 in France. \nMartin O'Neill's side would have automatically reached next summer's European Championship with a 2-2 draw in Warsaw but could not find a late equaliser and they will now be in next Sunday's play-off draw - with history largely going against them. \nFive of their seven previous attempts at making major finals via the play-off route have ended in heartache and here Press Association Sport looks back on that record for the men in green. \nWORLD CUP 1966 v SPAIN \nSyria's withdrawal from qualification led to a play-off with Spain after both sides had won their respective home fixtures. Jose Ufarte's first international goal for the Spaniards was enough to seal a 1-0 win in Paris, booking their place at the tournament in England. \nEURO 96 v HOLLAND \nAnother chance to feature in England was missed when Jack Charlton's side lost 2-0 to Holland at Anfield. A budding young striker by the name of Patrick Kluivert scored both goals as the Dutch progressed and Charlton's reign as Ireland boss drew to a close. \nWORLD CUP 1998 v BELGIUM \nDenis Irwin's early strike in the home leg was cancelled out by Luc Nilis as the Belgians took a 1-1 draw back to Brussels. \nThere, goals from Luis Oliviera and Nilis were too much for Ireland who succumbed to a 2-1 defeat with Ray Houghton's goal coming in vain as substitute David Connolly was sent off late on. \nEURO 2000 v TURKEY \nAway goals would be the undoing of Mick McCarthy's side this time around as Tayfur Havutcu's late penalty at Landsdowne Road drew Turkey level after Robbie Keane had opened the scoring. \nAgainst a background of anger and recriminations over the training facilities afforded to the respective teams, the second leg in Bursa ended 0-0 to send Turkey on to Belgium and Holland for the finals. \nWORLD CUP 2002 v IRAN \nOnly a superior goal difference saw Portugal top their qualifying group ahead of Ireland, who were plunged into the play-offs again despite taking four points off Holland. \nIran were their opponents and they finally ended years of hurt as Ian Harte and Keane struck to give McCarthy's men a 2-0 lead to take to Tehran. With skipper Roy Keane missing from the squad. Ireland endured a tense night but Yahya Golmohammadi's stoppage-time strike was not enough to deny the visitors their place in Japan and South Korea. \nWORLD CUP 2010 v FRANCE \nUnquestionably the most memorable of Ireland's long history of play-off disappointments. \nGiovanni Trapattoni's side lost 1-0 at home but drew level in the Stade de France courtesy of Keane, only to see William Gallas score a controversial extra-time winner. \nThierry Henry provided the cross for his compatriot but had controlled the ball with his hand before doing so. The offence went unseen by the officials and it was enough for France to qualify for South Africa, leaving the Irish at home once more. \nEURO 2012 v ESTONIA \nUnlike in previous years, Ireland all but sewed up qualification in the opening leg - this time winning 4-0 against nine men in Tallinn. \nKeith Andrews and Jonathan Walters struck for Trapattoni's side before Keane bagged a brace meaning the 1-1 draw at the Aviva Stadium in the return leg was more than enough for them to reach the finals in Poland and Ukraine. Related Sport News", "external_links": [], "published": "2015-10-12T12:01:00.000+03:00", "crawled": "2015-10-12T20:01:34.088+03:00", "highlightTitle": ""}