{"organizations": [], "uuid": "5ae8572758abcc4e3712cc8a10905cb3175ffdfd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mid-day.com", "main_image": "", "site_section": "http://www.mid-day.com/Resources/midday/rss/sports.xml#", "section_title": "sports", "url": "http://www.mid-day.com/articles/bullrun-posts-decisive-victory-in-nanoli-pune-derby/16601153", "country": "IN", "title": "Bullrun posts decisive victory in Nanoli Pune Derby", "performance_score": 0, "site": "mid-day.com", "participants_count": 1, "title_full": "Bullrun posts decisive victory in Nanoli Pune Derby - Sports", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T03:00:00.000+03:00", "replies_count": 0, "uuid": "5ae8572758abcc4e3712cc8a10905cb3175ffdfd"}, "author": "Prakash Gosavi", "url": "http://www.mid-day.com/articles/bullrun-posts-decisive-victory-in-nanoli-pune-derby/16601153", "ord_in_thread": 0, "title": "Bullrun posts decisive victory in Nanoli Pune Derby", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Pune: Cooji Katrak-trained Bullrun, given a very capable ride by jockey P Kamlesh, surged ahead in the last 50 meters to post a decisive victory in the grade 1, Nanoli Stud Pune Derby, the premier event of the on-going Pune monsoon racing season. \n\nReceiving some support in the closing moments before the starter dispatched the ten-horse field over the 2,000-meter trip, Bullrun closed at 9-1 from 10-1, while favourite Rigoletto eased up from 12-10 to 13-10. \n\nIntelligence (Akshay up), carrying the same silks as favourite Rigoletto, set a blistering pace to clock less than 58 seconds for the halfway mark, resulting in all of them, except Bold Appeal (Sandesh up) who stalked her, struggling to cope up with the pace. Intelligence shot her bolt nearing the final turn and Bold Appeal took command of the situation even as Trevor Patel astride favourite Rigoletto quickly changed gears to make his bid, while Bullrun (Kamlesh up) and Continental (Suraj Narredu up) kept each other company. \n\nA stirring duel ensued between Bold Appeal and Rigoletto in the final furlong which tired out both the horses, even as Kamlesh (Bullrun) and Suraj (Continental), racing on the middle of the racetrack, sensed their opportunity and began their final assault. As the winning post drew near, it looked like the two late bidders would finish 1-2 from the tiring Rigoletto and Bold Appeal, but just then, Continental apparently took a misstep and stumbled, throwing off jockey Suraj to the ground. Bullrun and Kamlesh then surged ahead past the warring duo of Rigoletto & Bold Appeal, who finished 2-3 in that order, separated by only a short head.\n\nTragically, Continental, who was driven away in an ambulance after staying motionless for some minutes, was later euthanised, reportedly due to a fracture of the fetlock. Jockey Suraj, however, was lucky to escape nearly unhurt. Immediately after the race the stewards announced an inquiry into the fall of Continental, but after reviewing the video and interviewing the jockeys concerned, decided to keep the judge's order of placings unchanged.\n\nBullrun, the 19th winner of the Nanoli stud Pune Derby, is owned by Jimmy Sarbh, Ms Vandana Desai, Akshay Chudasama & Ashish Kapadia, took home a cool Rs 34,65,000 besides a glittering trophy valued at Rs 1 lakh.", "external_links": [], "published": "2015-10-11T03:00:00.000+03:00", "crawled": "2015-10-11T21:32:21.787+03:00", "highlightTitle": ""}