{"organizations": ["Bari", "Lazio", "AP", "Genoa"], "uuid": "426d0f6b0511552f374c6963a25c5d37d88616ca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usatoday.com", "main_image": "", "site_section": "http://www.usatoday.com/sports/", "section_title": "USA Today | Sports", "url": "http://www.usatoday.com/story/sports/soccer/2015/10/13/report-expanding-tv-rights-scandal-targets-italian-clubs/73856010/", "country": "US", "title": "Report: Expanding TV rights scandal targets Italian clubs", "performance_score": 0, "site": "usatoday.com", "participants_count": 0, "title_full": "Report: Expanding TV rights scandal targets Italian clubs", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T15:05:00.000+03:00", "replies_count": 0, "uuid": "426d0f6b0511552f374c6963a25c5d37d88616ca"}, "author": "", "url": "http://www.usatoday.com/story/sports/soccer/2015/10/13/report-expanding-tv-rights-scandal-targets-italian-clubs/73856010/", "ord_in_thread": 0, "title": "Report: Expanding TV rights scandal targets Italian clubs", "locations": ["MILAN"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CONNECT TWEET LINKEDIN COMMENT EMAIL MORE MILAN (AP) — The presidents of Serie A clubs Lazio and Genoa plus Serie B's Bari are reportedly under investigation as part of an expanding inquiry into alleged collusion over Italian TV rights.\nGenoa owner Enrico Preziosi and Bari president and former referee Gianluca Paparesta are being investigated by prosecutors in Milan for accepting illegal payments from Serie A's TV rights adviser Infront in order to register their clubs with league authorities, Italian daily Corriere della Sera reported Tuesday.\nSwitzerland-based marketing agency Infront Sports and Media is led by Philippe Blatter, the nephew of suspended FIFA president Sepp Blatter.\nLazio president Claudio Lotito was being investigated for obstructing the work of watchdog body Covisoc, Corriere said.\nThe heart of the scandal centers on Infront and the president of its Italian division Marco Bogarelli, who is reportedly under investigation for fixing a deal between Sky, Mediaset and clubs for live domestic rights.\nThe 2015-18 live rights were sold to Rupert Murdoch-controlled Sky and Silvio Berlusconi-controlled Mediaset for a total of 943 million euros (slightly more than $1 billion) per season, 114 million euros ($130 million) more than the previous deal.\nTax and Finance consultant Andrea Baroni, who has Infront as a client, was arrested Friday on charges of criminal association aimed at money laundering and tax evasion.\nPreziosi allegedly accepted a 15-million euro ($17 million) payment that was made through Switzerland and can be traced back to Infront and Tax and Finance.\n\"I added the money needed for our budget,\" Preziosi said, confirming that Genoa's offices were searched by financial police Friday. \"The account is traceable and all of the operations were done simply and clearly, so if needed we are prepared to provide any explanation that authorities request.\"\nInfront paid 500,000 euros (more than $500,000) to sponsor Bari's second shirt.\nLawyer Gian Michele Gentile said Lotito, a member of the Italian football federation's council, has not been officially notified of the inquiry.\nFinancial police also reportedly raided the offices of Mediaset's Reti televisive italiane (Rti).\nMilan prosecutors could not be reached for comment.\nCONNECT TWEET LINKEDIN COMMENT EMAIL MORE Copyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.\nTOP VIDEOS", "external_links": ["http://www.linkedin.com/shareArticle?url=http%3A//usat.ly/1REhGe8&mini=true", "https://twitter.com/intent/tweet?url=http%3A//usat.ly/1REhGe8&text=Report%3A%20Expanding%20TV%20rights%20scandal%20targets%20Italian%20clubs&via=usatoday"], "published": "2015-10-13T15:05:00.000+03:00", "crawled": "2015-10-13T15:53:02.123+03:00", "highlightTitle": ""}