{"organizations": ["Northern Illinois University", "Loyola University Medical Center", "Olivet Nazarene University", "Harper College Submitted by Harper College Harper College", "Illinois Healthcare Action Coalition", "Illinois Emergency Nurses Association", "BSN", "Rainbow Hospice and Palliative Care", "Benedictine University", "Harper College", "Rush University Medical Center", "Illinois Nurses Foundation", "Rosalind Franklin University of Medicine"], "uuid": "bb9d4902bc1bd86e2d69e0b75d4bfd0ac24d8001", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailyherald.com", "main_image": "http://www.dailyherald.com/storyimage/DA/20151013/SUBMITTED/151019581/AR/0/AR-151019581.jpg&amp;updated=201510131335&amp;imageversion=Facebook&amp;exactH=630&amp;exactW=1200&amp;exactfit=crop&amp;noborder", "site_section": "http://www.dailyherald.com/rss/rss.asp?section=sports_pro_football", "section_title": "DailyHerald.com  > sports_pro_football", "url": "http://www.dailyherald.com/article/20151013/submitted/151019581/", "country": "US", "title": "Three Harper nurses land on 40 under 40 list", "performance_score": 0, "site": "dailyherald.com", "participants_count": 0, "title_full": "Three Harper nurses land on 40 under 40 list", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T20:35:00.000+03:00", "replies_count": 0, "uuid": "bb9d4902bc1bd86e2d69e0b75d4bfd0ac24d8001"}, "author": "", "url": "http://www.dailyherald.com/article/20151013/submitted/151019581/", "ord_in_thread": 0, "title": "Three Harper nurses land on 40 under 40 list", "locations": ["Illinois"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Julie D'Agostino", "Nicholas Nelson", "Harper", "Suzanna Kopec", "Nelson", "D'Agostino", "McDowell", "Megan McDowell", "Suzanna Kopek", "Julie"], "text": "Add a message (optional) Success - Article sent! close Recipients of the 40 Under 40 Emerging Nurse Leader Awards, from left, are Nicholas Nelson, Suzanna Kopec and Megan McDowell. The awards were presented by The Illinois Nurses Foundation and the Illinois Healthcare Action Coalition. Courtesy of Harper College Submitted by Harper College Harper College was well represented at a recent event recognizing some of Illinois' most outstanding young nurses. Recipients of the 40 Under 40 Emerging Nurse Leader Awards included clinical supervisor Megan McDowell and alumni Suzanna Kopek and Nicholas Nelson, both graduates from Harper's Class of 2009. The Illinois Nurses Foundation and the Illinois Healthcare Action Coalition sponsored the awards, which were given out at a recognition event last month at Rush University Medical Center. The initiative celebrates nurses under age 40 who have shown dedication to the community, the profession and leadership for the advancement of nursing in Illinois. \"The recipients of this honor will be the voice of nurses in the future,\" said Julie D'Agostino, director of Nursing at Harper. McDowell, who also graduated from Harper in 2003 before earning her bachelor's and master's degrees in nursing from Northern Illinois University, said she benefited from Harper's dedicated faculty. \"The Harper College nursing program has been the foundation for my academic and career success,\" she said. \"I am passionate about being a nurse and couldn't be happier to be teaching at the place where I started my nursing career.\" Nelson, an instructor at Loyola University Medical Center and president-elect of the Illinois Emergency Nurses Association, received a master's degree in health care administration and management from Rosalind Franklin University of Medicine and Science. He similarly credited Harper faculty, such as D'Agostino, for serving as mentors, role models, colleagues and friends. \"Julie has had an enormous impact on my emergency nursing career and development as a leader,\" he said. Kopek, a triage nurse and after-hours supervisor at Rainbow Hospice and Palliative Care, is currently enrolled in the family nurse practitioner master's degree program at Olivet Nazarene University. She said she was able to become a registered nurse at just 20 years old by coming to Harper, which teaches students the value of lifelong learning. \"Nurses need to arm themselves with knowledge, which can be validated through certifications and credentials,\" she said. \"Our patients deserve us to be our best selves.\" Since 2010, 97 percent of Harper nursing students have passed the state licensing exam. The college hosts nursing completion programs on the main campus in partnership with NIU and Benedictine University, and has several articulation agreements with other Bachelor of Science in Nursing completion programs. Students looking to complete their BSN degree are invited to attend a transfer fair from 11:30 a.m. to 2 p.m. Wednesday, Nov. 18, at Harper. For more information, visit harpercollege.edu . • Submit 'Your News' at www.dailyherald.com/share. Share this page", "external_links": [], "published": "2015-10-13T20:35:00.000+03:00", "crawled": "2015-10-13T21:39:34.337+03:00", "highlightTitle": ""}