{"organizations": [], "uuid": "8f24a46c27ef6a487b80cbe208268e6cf0ab4020", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bentoneveningnews.com", "main_image": "http://www.bentoneveningnews.com/storyimage/IO/20151022/SPORTS/151029774/AR/0/AR-151029774.jpg", "site_section": "http://www.bentoneveningnews.com/sports?template=rss&mime=xml", "section_title": "Sports - Benton Evening News - Benton, IL", "url": "http://www.bentoneveningnews.com/article/20151022/SPORTS/151029774/2000/NEWS?rssfeed=true", "country": "US", "title": "Benton spikers win on Senior Night", "performance_score": 0, "site": "bentoneveningnews.com", "participants_count": 1, "title_full": "Benton spikers win on Senior Night", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T07:35:00.000+03:00", "replies_count": 0, "uuid": "8f24a46c27ef6a487b80cbe208268e6cf0ab4020"}, "author": "Justin Walker", "url": "http://www.bentoneveningnews.com/article/20151022/SPORTS/151029774/2000/NEWS?rssfeed=true", "ord_in_thread": 0, "title": "Benton spikers win on Senior Night", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Benton spikers win on Senior Night An all-senior lineup did pretty well for the Benton volleyball team Thursday night Comment Benton Evening News - Benton, IL By Justin Walker Posted Oct. 22, 2015 at 12:01 AM Updated at 11:35 PM Posted Oct. 22, 2015 at 12:01 AM Updated at 11:35 PM BENTON — An all-senior lineup did pretty well for the Benton volleyball team Thursday night. Benton's six seniors started their Senior Night match against Hamilton County and played most of the first game together in a 25-19, 25-12 sweep with a more diverse lineup taking care of business in the second game. The seniors — Haley Ing, Emmy Jay, Kara Krapf, Marcela Mendez, Shay Vick and Sydnie Watkins — found themselves trailing 14-9 in the first game but chipped away and took a 19-18 lead on the fourth kill of the game by Mendez, who is normally a setter. Watkins put down a block to extend the lead and force Hamilton County to call a timeout, then an ace from Sydney Tate and a smash from Watkins capped a 7-0 run that made it 24-18. Tate sent her next serve out of bounds, but Watkins and Mendez combined on a stuff block to provide game point. Tate and fellow juniors Brooklyn Calcaterra and Kaylee Pedigo took over most of the hitting in the second game, which saw Benton jump out to a 14-6 lead with Tate swatting three kills in the opening stretch. Calcaterra then put down three big kills as the lead grew to 19-9. Mendez served and ace to make it 21-12 and Vick pounded a hammer for the next point as Benton closed out on a six-point run. Calcaterra spiked the final point, which came with Mendez at the service line. Benton finishes the regular season Saturday at the Fairfield Invitational and then plays on Tuesday at the Carbondale 3A Regional at 6 p.m. against either Marion or West Frankfort, who face off Monday night. If Benton wins, they'll return Thursday for the regional championship match. The regional also includes Carbondale, which plays either Herrin and Carterville in the other semifinal. By Justin Walker Benton Evening News - Benton, IL By Justin Walker Posted Oct. 22, 2015 at 12:01 AM Updated at 11:35 PM", "external_links": [], "published": "2015-10-23T07:35:00.000+03:00", "crawled": "2015-10-23T17:17:51.484+03:00", "highlightTitle": ""}