{"organizations": [], "uuid": "e271aaeecc51ff23bea5dc277aac3da623949f55", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mansfieldnewsjournal.com", "main_image": "", "site_section": "http://rssfeeds.mansfieldnewsjournal.com/mansfield/highschoolsports", "section_title": "Mansfield - HIgh School Sports", "url": "http://www.mansfieldnewsjournal.com/story/sports/high-school/2015/10/16/lexington-minutemen-schaub-ohsaa/74034220/", "country": "US", "title": "Lex duo clinches All-Ohio; Goldsmith loses tiebreaker", "performance_score": 0, "site": "mansfieldnewsjournal.com", "participants_count": 0, "title_full": "Lex duo clinches All-Ohio; Goldsmith loses tiebreaker", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T02:16:00.000+03:00", "replies_count": 0, "uuid": "e271aaeecc51ff23bea5dc277aac3da623949f55"}, "author": "", "url": "http://www.mansfieldnewsjournal.com/story/sports/high-school/2015/10/16/lexington-minutemen-schaub-ohsaa/74034220/", "ord_in_thread": 0, "title": "Lex duo clinches All-Ohio; Goldsmith loses tiebreaker", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Lex", "Jon Spencer", "Goldsmith"], "text": "Lex duo clinches All-Ohio; Goldsmith loses tiebreaker Jon Spencer , Reporter 7:16 p.m. EDT October 16, 2015 \nMASON -- Jordyn Traxler and Maya Ahmed are headed for The Wall. \nThe Lexington tandem clinched All-Ohio honors Friday by reaching the quarterfinals in Division II doubles at the state tennis tournament, held for the first time at the Linder Family Tennis Center in greater Cincinnati. \nThey opened with a win over some familiar foes before falling 6-2, 6-0 in the quarterfinals to Caroline Andersen and Meredith Breda of Cincinnati Indian Hill. \nTraxler and Ahmed easily handled Natalie Molnar and Kate Rodhe of Ohio Cardinal Conference rival West Holmes 6-1, 6-3 in their opening match to guarantee their spot on the school's Wall of Fame. \nTeammate Sylvia Goldsmith, one of only two freshmen in the 16-girl singles draw, started strong before succumbing 2-6, 6-4, 7-6 (7-1) in the first round to sophomore Taylor Fair of Carrollton. \n\"I'm so happy that Jordyn and Maya are getting their picture on the wall,\" coach Ron Schaub said. \"It's great to see Maya have success after being in our program for four years and making it to state for the first time. \n\"There's only 16 singles players and 16 doubles teams here, so everybody's pretty darn good. I hope they all enjoyed the experience.\" \nSchaub was hoping there would be no time time Saturday to practice for Sunday's state team tournament in Reynoldsburg. Unfortunately, there won't be a second day in Cincy for the Lex contingent, so practice is set for 11 a.m. \nLex, ranked No. 7 in the state coaches poll, will face No. 2 Indian Hill in Sunday's semifinals of the Ohio Tennis Coaches Association state team tournament. The other semi will pit No. 1 Shaker Heights Hathaway Brown vs. No. 8 Columbus Academy. It's Lex's 11th straight appearance in the Final Four. The program has won five state championships and been runner-up four times. \nWith Goldsmith just a ninth-grader and Ahmed the only senior, it doesn't look like Lex's run of state tournament appearances will be ending any time soon. \n\"Sylvia has a big upside,\" Schaub said. \"She's talented and athletic and the only thing holding her back is being a little inconsistent. She'll make the second day (of state) next year.\" \nGoldsmith played an impressive first set in her state debut. But just that quickly she fell behind 0-5 in the second, climbed back to 4-5 and was one point from tying it up before the game and set slipped away. The third set featured 10 service breaks before Fair caught fire in the tiebreaker. \n\"The only thing Sylvia is lacking is that she hasn't played a lot of tournaments,\" Schaub said. \"When things get tight, she tends to over-hit, but as she showed in the second set she almost ran off five games in a row. \n\"Was she more talented than that other girl? Yeah. Was she faster? Yeah. But the other girl was a little more experienced. There's nothing to be down about. There was only one other freshman in the draw. Sylvia's smart and has a great work ethic. She has a lot going for her.\" \njspencer@nncogannett.com", "external_links": [], "published": "2015-10-17T02:16:00.000+03:00", "crawled": "2015-10-17T03:02:47.495+03:00", "highlightTitle": ""}