{"organizations": ["USA Today Preseason Coaches", "Gonzaga"], "uuid": "229214454d311caef8c94eb28c81303a6eba8154", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.swxrightnow.com", "main_image": "http://SWXRN.images.worldnow.com/images/9025000_G.jpg", "site_section": "http://www.swxrightnow.com/category/162314/college?clienttype=rss&redirected=true", "section_title": "Sports and Weather Right Now - College", "url": "http://www.swxrightnow.com/story/30272022/gonzaga-men-ranked-no-11-in-usa-today-preseason-coaches-poll", "country": "US", "title": "Gonzaga Men Ranked No. 11 In USA Today Preseason Coaches' Poll", "performance_score": 0, "site": "swxrightnow.com", "participants_count": 0, "title_full": "Gonzaga Men Ranked No. 11 In USA Today Preseason Coaches' Poll", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T23:38:00.000+03:00", "replies_count": 0, "uuid": "229214454d311caef8c94eb28c81303a6eba8154"}, "author": "", "url": "http://www.swxrightnow.com/story/30272022/gonzaga-men-ranked-no-11-in-usa-today-preseason-coaches-poll", "ord_in_thread": 0, "title": "Gonzaga Men Ranked No. 11 In USA Today Preseason Coaches' Poll", "locations": ["USA"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Gonzaga Men Ranked No. 11 In USA Today Preseason Coaches' Poll Posted: Updated: \nBy Gonzaga Athletics \nSPOKANE, Wash. -- The Gonzaga men's basketball team was ranked No. 11 in the USA Today Preseason Coaches' Poll released Thursday. \nGonzaga is coming off a historic year which featured a school-record 35 wins, second-ever berth in the Elite Eight and school-record 22-game win streak during the season. The Zags also captured their third straight WCC regular season and tournament titles, while advancing to a 17th consecutive NCAA Tournament, the fourth-longest active streak in the nation. \nThe Zags return all three big men who shared significant minutes in 2014-15, including senior Kyle Wiltjer, who led the Zags in scoring at 16.8 points per game. Senior center Przemek Karnowski is back after averaging 10.9 points and then spending the summer with the Polish National Team playing the European Championships. \nSophomore forward Domantas Sabonis is also back for the Zags after a breakout freshman season with 9.7 points and a team-leading 7.1 rebounds per game. Sabonis also played for his national team, Lithuania, helping them earn a spot in the finals of the European Championships and a berth in the 2016 Summer Olympic Games. \nGonzaga had 468 points in the poll, just nine behind Arizona, who was ranked 10th. \nKentucky and North Carolina shared the top spot in the poll with 749 points. UNC had 12 first-place votes and Kentucky had 11. Maryland was third with 723 points and five first-place votes, followed by Duke and Kansas to round out the top five. \nThe season officially gets underway with an exhibition against Eastern Oregon at home on Nov. 7, followed by the regular-season opener in Okinawa, Japan, against Pittsburgh in the Armed Forces Classic on Nov. 13. Updated: Thursday, October 15 2015 4:38 PM EDT 2015-10-15 20:38:39 GMT The Gonzaga men's basketball team was ranked No. 11 in the USA Today Preseason Coaches' Poll released Thursday. Gonzaga is coming off a historic year which featured a school-record 35 wins, second-ever berth in the Elite Eight and school-record 22-game win streak during the season. More >> The Gonzaga men's basketball team was ranked No. 11 in the USA Today Preseason Coaches' Poll released Thursday. Gonzaga is coming off a historic year which featured a school-record 35 wins, second-ever berth in the Elite Eight and school-record 22-game win streak during the season. More >> Press Pass Pullman: Episode Five Hear from Coach Leach and others after their big win over the Oregon Ducks. In this week's show hear interviews from WSU Head Coach Mike Leach, Sophomore Quarterback Luke Falk, and Sophomore Linebacker Peyton Pelluer. Plus, Coach Leach talks about Christopher Columbus for the Student Question of the Week. More >> In this week's show hear interviews from WSU Head Coach Mike Leach, Sophomore Quarterback Luke Falk, and Sophomore Linebacker Peyton Pelluer. Plus, Coach Leach talks about Christopher Columbus for the Student Question of the Week. More >> WSU Beats Oregon for the First-Time Since 2006 For the first-time since 2003, Washington State beat the Oregon Ducks in Eugene. Luke Falk threw for season-high 505 yards and five touchdowns, including a momentary nail-biter that turned out to be the game winner, and the Cougars snapped an eight-game losing streak to the Ducks with a 45-38 victory in double overtime on Saturday. More >> Luke Falk threw for season-high 505 yards and five touchdowns, including a momentary nail-biter that turned out to be the game winner, and the Cougars snapped an eight-game losing streak to the Ducks with a 45-38 victory in double overtime on Saturday. More >> Gonzaga Gears Up for Basketball Season with Kraziness in the Kennel The Zags will be open the 2015-16 season with an exhibition against Eastern Oregon on Saturday, November 7th. The Gonzaga men's basketball team put on a show in front of a packed house at the Kraziness in the Kennel event at the McCarthey Athletic Center on Saturday afternoon. More >> The Gonzaga men's basketball team put on a show in front of a packed house at the Kraziness in the Kennel event at the McCarthey Athletic Center on Saturday afternoon. More >> Eagles Use 4th Quarter Comeback to Edge Cal Poly in OT The seventh-ranked Eastern Washington University football team rallied from a 15-point deficit in the fourth quarter to force overtime and then beat Cal Poly on Saturday. The seventh-ranked Eastern Washington University football team rallied from a 15-point deficit in the fourth quarter to score 22 unanswered points in the final 5:11 of regulation and in overtime to top Cal Poly and the top rushing offense in the nation 42-41 in a Big Sky Conference showdown Saturday. More >> The seventh-ranked Eastern Washington University football team rallied from a 15-point deficit in the fourth quarter to score 22 unanswered points in the final 5:11 of regulation and in overtime to top Cal Poly and the top rushing offense in the nation 42-41 in a Big Sky Conference showdown Saturday. More >> Whitworth Stays Perfect With 24-7 Win Over UPS Whitworth controlled the clock and the field position to improve to 5-0 overall and 2-0 in the NWC this season. Whitworth University controlled the field position and the clock during a 24-7 Northwest Conference football win at Puget Sound on a windy, rainy day at Baker Stadium. More >> Whitworth University controlled the field position and the clock during a 24-7 Northwest Conference football win at Puget Sound on a windy, rainy day at Baker Stadium. More >>", "external_links": [], "published": "2015-10-15T23:38:00.000+03:00", "crawled": "2015-10-16T07:55:21.018+03:00", "highlightTitle": ""}