{"organizations": [], "uuid": "3b9691d23db839c24d2bbbd390a8aa3da73fd6d9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "wtop.com", "main_image": "http://wtop.com/wp-content/uploads/2015/10/MarylandPennState.jpg", "site_section": "http://wtop.com/section/sports/feed/", "section_title": "WTOP » Sections » Sports", "url": "http://wtop.com/ncaa-football/2015/10/prestos-picks-not-our-rival-edition/", "country": "US", "title": "Presto’s Picks: ‘Not our rival!’ edition", "performance_score": 0, "site": "wtop.com", "participants_count": 1, "title_full": "Presto’s Picks: ‘Not our rival!’ edition", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T03:39:00.000+03:00", "replies_count": 0, "uuid": "3b9691d23db839c24d2bbbd390a8aa3da73fd6d9"}, "author": "David Preston", "url": "http://wtop.com/ncaa-football/2015/10/prestos-picks-not-our-rival-edition/", "ord_in_thread": 0, "title": "Presto’s Picks: ‘Not our rival!’ edition", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By David Preston | @davpresto October 23, 2015 8:39 pm Are Maryland and Penn State rivals? Not exactly. (AP Photo/Gene J. Puskar, File) \nWASHINGTON — It’s “Rivalry Weekend!” Or maybe not. \nA true rivalry is more than just nearby schools suiting up. At its best, a rivalry is a fantastic dance. Two schools mark their calendars in anticipation for each matchup, and when one’s rival is playing somebody else, you are rooting for that other team like there’s no tomorrow. Such is the emotion surrounding rivals, that a season can be salvaged with a win over the hated opponent just like it can be ruined with a defeat to the same foe. \nSadly, for every Michigan-Ohio State or Auburn-Alabama there are schools without dance partners. Maryland for years looked to Virginia as its “nearest ACC neighbor,” while the Cavalier faithful shunned College Park. In men’s hoops, they were greeted with similar disdain by Duke. Now that they’re in the Big Ten, Terps fans are looking to their northern neighbor Penn State. \nWhile last year’s win in Happy Valley (the first since 1961 and first-ever up there) certainly spiced things up, the Nittany Lions have a long dance card of historic opponents (their annual rival should be Pitt) that they’ve lost to more than twice in school history. Sometimes it’s wise to settle for a safety school — but that rival should probably be Rutgers, another east coast school that has trouble selling out its “too small for the Big Ten” stadium while regularly losing recruits and games to Pennsylvania State University. \nVirginia has the perfect dance partner, but still likes to give Virginia Tech the cold shoulder…in favor of their natural rival, North Carolina. Yes, there are those who will tell you that the UNC game is the one they get up for each fall. Never mind that the Tar Heels have Duke and NC State on their doorstep (Wake Forest? Puleeze) and can’t be bothered with a Coastal Division pretender they’ve run roughshod over this decade. So the Cavaliers can’t beat the team that won’t dance with them, as well as the school that will. \nThank goodness Navy has Army. \nNavy vs. Tulane, 1 p.m. (CBSSN) \nAfter a week off to get the Notre Dame loss out of their system, the Midshipmen resume American Athletic Conference (of America) play by facing the Green Wave, whose only wins are against FCS school Maine and 0-7 UCF (DO NOT CALL THEM CENTRAL FLORIDA!). Keenan Reynolds is rested and recovered from the injury suffered against Notre Dame…and Tulane is fresh off allowing 239 yards rushing to Houston. \nPresto’s Pick: Midshipmen get in AAC winning mode, 38-13. \nMaryland vs. Penn State at M&T Bank Stadium, 3:30 p.m. (ESPN) \nThe Mike Locksley regime begins with a bang. Can they make it two straight over the Nittany Lions for the first time in school history? Christian Hackenberg is supposed to be a great quarterback, but the junior seems to be less than the sum of his passing parts. How the Terps’ run defense (ranked 13th in the Big Ten) deals with running back Saquon Barkley (8.3 yards per carry) will be just as important. Perry Hills starts again at quarterback and one can imagine he’ll have less running room with Penn State game planning for that threat. A makeshift Terps offensive line also has to contend with the nation’s leading sacker in Carl Nassib (11.5 in 2015). They still wear all-white uniforms, but this Penn State team barely beat Army West Point and lost to Temple (granted, the Owls are unbeaten — but they remain TEMPLE ). \nPresto’s Pick: Terps tumble in the charm city, 29-26. \nVirginia at North Carolina, 3:30 p.m. (ESPN3) \nThe Cavaliers’ season got off the mat last Saturday with a triple-overtime win over Syracuse. But the school hasn’t won conference games on consecutive weekends since 2012. And the Tar Heels lead the ACC in yards and points per game…while the Cavaliers allow the most in both categories. Kippy and Buffy make this their one mandatory tailgating road trip each year — and they’re bringing a Lovingston 2012 Josies Knoll Merlot (spiced red plum with red currant aromas) naturally paired with Colby cheese and Melba Toast. Sadly, their UNC tailgating friends Meredith and Peyton made previous plans to brunch at the Washington Duke Hotel with their Blue Devil buddies Tommy and Cricket. \nPresto’s Pick: Cavaliers come up short, 37-17. \nVirginia Tech vs. #23 Duke, 3:30 p.m. (ESPNU) \nWho would have thought that the research triangle trio (UNC, Duke & NC State) would be off to a combined 14-4 start? And that it’s the Blue Devils who have emerged as Coastal Division favorites? This year’s unit is getting it done on the defensive side of the ball: their 9.3 points allowed per game leads the ACC and they’re tops in stopping the pass. For a Virginia Tech team that’s having trouble running and passing this fall, that can’t be encouraging. Thomas Sirk is just the kind of pass-run quarterback that’s given the Hokie defense headaches this fall…and fans of the 60’s TV show “The Wild, Wild West” recognize that Ross Martin needs no disguise as a kicker who’s perfect (12-12 FG, 19-19 XP) this fall. Not to be confused with Maryland offensive tackle Michael Dunn or former Syracuse fullback Robert Konrad. \nPresto’s Pick: Hokies are humbled, 24-12. \nGeorgetown loses at Bucknell, Howard slips at North Carolina A&T, James Madison beats Richmond , William & Mary edges Hampton, Towson falls to Villanova. \nLast Week: 4-3. \nFollow @WTOP on Twitter and WTOP on Facebook . \n© 2015 WTOP. All Rights Reserved. Topics:", "external_links": [], "published": "2015-10-24T03:39:00.000+03:00", "crawled": "2015-10-24T04:06:30.310+03:00", "highlightTitle": ""}