{"organizations": [], "uuid": "65022596a9f4b3509976ccafd502fa0e545ca6c6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "", "site_section": "http://www.tribuneindia.com/", "section_title": "The Tribune, Chandigarh, India : Latest news, India, Punjab, Chandigarh, Haryana, Himachal, Uttarakhand, J&amp;K, sports, cricket ", "url": "http://www.tribuneindia.com/news/haryana/criminals-have-free-run-at-rewari-brick-kiln-rape-two/145102.html", "country": "US", "title": "Criminals have free run at Rewari brick kiln, rape two", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "Criminals have free run at Rewari brick kiln, rape two", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "65022596a9f4b3509976ccafd502fa0e545ca6c6"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/haryana/criminals-have-free-run-at-rewari-brick-kiln-rape-two/145102.html", "ord_in_thread": 0, "title": "Criminals have free run at Rewari brick kiln, rape two", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ravinder Saini\nTribune News Service\nRewari, October 12\nA group of armed-miscreants created ruckus at a brick kiln in Sulkha village for over three hours on the intervening night of Sunday and Monday. They not only looted Rs 25,000 in cash and two tractor-trailers by holding the kiln cashier and labourers hostage, but also gang-raped two women labourers at gunpoint before fleeing. The police reached the spot in the morning when the cashier made a call to the police helpline number. Though the police have started investigations after booking a criminal case against unidentified miscreants, but no arrests were made till the filing of this report. The incident took place around 12:30 am when the cashier, Sunil Kumar, and 21 labourers, including seven women and children, were sleeping in temporary rooms at Dharam brick kiln. Over 12 miscreants armed with pistols and sticks reached the spot in pick-up jeeps and started thrashing the labourers. Thereafter, they looted Rs 25,000 from the cashier and tied the labourers with a cloth after holding them hostage at gunpoint, sources said. A few of the miscreants then tore the clothes of two women labourers and gang-raped them in front of their family. The miscreants fled the spot around 3:30am after threatening the labourers and the cashier of dire consequences. Later, the cashier, Sunil, informed the police about the crime. Rewari SP Balwan Singh along with other officials rushed to the spot and took stock of the situation. The rape victims were taken to the civil hospital for their medical examination. During preliminary investigations, the police learnt the miscreants belonged to Mewat district, sources said. The SP said, “It is not possible to carry out patrolling on every road in the district, but the police immediately reached the spot after receiving information about the incident. The police teams are conducting raids at possible hideouts of the accused to nab them.” A case under sections 392, 395, 376 and 342 of the IPC has been booked against unidentified miscreants on the complaint of the kiln cashier, Sunil.", "external_links": [], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-13T04:05:20.421+03:00", "highlightTitle": ""}