{"organizations": [], "uuid": "405098485586deef32de6a6086513d08482cec8c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "http://s1.reutersmedia.net/resources/r/?m=02&d=20151025&t=2&i=1089664508&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXNPEB9O0G2", "site_section": "http://www.reuters.com/news/sports", "section_title": "Sports News, Highlights &amp; Coverage | Reuters.com", "url": "http://www.reuters.com/article/2015/10/25/us-tennis-women-finals-sharapova-idUSKCN0SJ0S220151025", "country": "US", "title": "Sharapova delights at gutsy win on return from layoff", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Sharapova delights at gutsy win on return from layoff | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T20:18:00.000+02:00", "replies_count": 0, "uuid": "405098485586deef32de6a6086513d08482cec8c"}, "author": "John O'Brien", "url": "http://www.reuters.com/article/2015/10/25/us-tennis-women-finals-sharapova-idUSKCN0SJ0S220151025", "ord_in_thread": 0, "title": "Sharapova delights at gutsy win on return from layoff", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SINGAPORE Maria Sharapova had not completed a match since losing at Wimbledon in July, so the Russian was naturally thrilled to emerge with a victory at the WTA finals on Sunday after taking time to heal from a number of ailments.\nThe world number three skipped the U.S. Open in September with a leg strain and aborted a comeback bid in Wuhan at the end of last month in the hope of being fit for the elite eight-woman event. Her patience paid off with a typical gritty win.\nShaking off rust took a little time in her opening Red Group encounter against Agnieszka Radwanska and despite dropping the first set, Sharapova raised her intensity levels enough to grind out a gutsy 4-6 6-3 6-4 triumph.\n\"Well, I haven't completed a match since July, so I think it's always challenging to come back from not one injury, but a few,\" Sharapova told reporters after surviving a two hour, 48 minute marathon against the tenacious Pole.\n\"I've had a lot of starts and stops and I was just really thrilled that despite not playing these last few months and not playing my best tennis, I was facing an opponent that obviously deserved a spot in tournament.\n\"I just felt like I was able to take myself to another level physically, which I didn't exactly expect that I would be able to. So I think that was the emotion that I felt out of it.\"\nFacing off against a player renowned for her incredible retrieving skills was always likely to be a stamina-sapping test, so Sharapova was impressed by her ability to stay consistent as the clock ticked towards the three hour mark.\n\"I thought it was a very physical match. I think this court requires all the matches to be. I think it's on the slower side... points are longer,\" the 28-year-old said of the Singapore Indoor Stadium surface.\n\"It suits her game quite well. The ball stays low and she can take it quite early and change direction,\" she added.\n\"We had quite a bit of long rallies. There was a lot of running. Right now I feel good. Toes are a little frozen but other than that I'm fine.\"\nOne facet of her game that Sharapova needs to work on is cutting down unforced errors when the finishing line is in sight after Radwanska fought back from 5-2 down in the decider to almost level the scores as the Russian wobbled.\n\"I felt like my feet were glued on the ground and I wasn't making the small steps to the ball,\" she admitted.\n\"I wanted to get a free point, go for a big first serve, a big first ball and that's just not... obviously I had to learn from the whole match that was just not very possible.\"\n(Editing by Toby Davis )", "external_links": [], "published": "2015-10-25T20:18:00.000+02:00", "crawled": "2015-10-25T20:02:42.857+02:00", "highlightTitle": ""}