{"organizations": ["MarketWatch Toyota Partners With Yahoo", "Toyota Partners With Yahoo", "Yahoo"], "uuid": "b6853528a73e40814ae6d33b6c7be17340dbb5af", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.marketwatch.com", "main_image": "http://s.wsj.net/public/resources/MWimages/MW-DR328_mw_soc_NS_20150801233302.png", "site_section": "http://news.google.com/news?hl=en&gs_rn=0&gs_ri=serp&tok=8AfznjItXar1mg6jgdkyIw&ds=n&pq=facebook&cp=13&gs_id=5j&xhr=t&q=yahoo+-sports&newwindow=1&gl=us&bav=on.2,or.r_gc.r_pw.r_cp.r_qf.&bpcl=39468505&biw=1366&bih=643&um=1&ie=UTF-8&output=rss", "section_title": "yahoo -sports - Google News", "url": "http://www.marketwatch.com/story/toyota-partners-with-yahoo-and-live-nation-to-extend-music-initiatives-2015-10-13", "country": "IL", "title": "Toyota Partners With Yahoo and Live Nation to Extend Music Initiatives - MarketWatch", "performance_score": 0, "site": "marketwatch.com", "participants_count": 0, "title_full": "Toyota Partners With Yahoo and Live Nation to Extend Music Initiatives - MarketWatch", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T16:05:00.000+03:00", "replies_count": 0, "uuid": "b6853528a73e40814ae6d33b6c7be17340dbb5af"}, "author": "", "url": "http://www.marketwatch.com/story/toyota-partners-with-yahoo-and-live-nation-to-extend-music-initiatives-2015-10-13", "ord_in_thread": 0, "title": "Toyota Partners With Yahoo and Live Nation to Extend Music Initiatives - MarketWatch", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Toyota Partners With Yahoo and Live Nation to Extend Music Initiatives By Published: Oct 13, 2015 9:00 a.m. ET Share Highlights Emerging Artists, Music Festival Content and Live Performances on Yahoo \nLOS ANGELES, Oct 13, 2015 (BUSINESS WIRE) -- Toyota, Yahoo! Inc. YHOO, -0.33% and Live Nation LYV, +0.70% have partnered to create original content that highlights new and emerging musicians from Toyota-sponsored music festivals across North America, as well as live streamed concerts on Yahoo. With this collaboration, Toyota will be the exclusive sponsor of Rising ( https://rising.yahoo.com/ ), a new destination on Yahoo Music that gives fans an early look at artists before they become headliners, in addition to sponsoring live streamed concerts on the Live Nation Channel on Yahoo. \n“Through interactive activations at music festivals, the partnership will serve as an opportunity to amplify the onsite experience by maintaining engagement with fans long after the festival ends,” said Dionne Colvin-Lovely, Director, Traditional and New Media, Toyota Motor Sales, U.S.A., Inc. “By bringing music and artists to consumers to view anytime and anywhere, the partnership strengthens Toyota’s effort to connect with fans in a meaningful and relevant way.” \nThis partnership is the newest development in Toyota’s efforts to expand its integrated music initiative, Toyota Music. Music enthusiasts can enjoy reading exclusive editorial features from Yahoo Music editors and curated partners in Rising , presented by Toyota. Rising also features video recaps from the Toyota tent at key music festivals across the country, including new and emerging talent secured by SpinMedia. Fans can witness their favorite artists up close and personal on Rising , with unrivaled artist access through interviews and behind-the-scenes original content such as a new in-studio video series including a performance by Nathaniel Rateliff & The Night Sweats. Toyota is also creating custom content for their Toyota Music Tumblr page, by tapping into popular artists from the Tumblr Creatrs Network. Rising and the brand’s Tumblr page will also feature exciting content from Toyota-sponsored festivals this year such as Lollapalooza, Outside Lands, Nocturnal Wonderland, and Life is Beautiful. \n“Brands like Toyota want to engage audiences through great video content that connects them to artists in authentic, exclusive ways,” said Lisa Utzschneider, Chief Revenue Officer, Yahoo. “By creating music experiences that not only resonate with their consumers but centrally feature the brand, we’re helping Toyota maximize their presence in the music space across digital, mobile and social platforms.” \nAdditionally, Toyota will sponsor upcoming Live Nation music festivals such as Voodoo Music + Arts Experience, which will be live streamed on the Live Nation Channel on Yahoo. Yahoo has become a destination for online live music events. The first year of Live Nation programming on Yahoo received more than 135 million streams worldwide. \n“This collaboration among Toyota, Yahoo and Live Nation exemplifies the type we strive for,” said Kevin Chernett, Live Nation’s Executive Vice President of Strategic Partnerships. “From the Voodoo festival live stream on Yahoo, to the incredible Toyota activation at the event, to Toyota’s advertising support to the Live Nation Channel on Yahoo, we can touch the consumer in so many exciting ways, exponentially expanding Toyota’s reach to music fans.” \nToyota Music aims to connect with a vast audience of music fans by giving consumers a peek into the live entertainment experience. For more information and to view festival content, editorial and video features, visit: https://rising.yahoo.com/ . \nAbout Toyota \nToyota TM, -1.29% the world's top automaker and creator of the Prius and the Mirai fuel cell vehicle, is committed to building vehicles for the way people live through our Toyota, Lexus and Scion brands. Over the past 50 years, we’ve built more than 25 million cars and trucks in North America, where we operate 14 manufacturing plants (10 in the U.S.) and directly employ more than 42,000 people (more than 33,000 in the U.S.). Our 1,800 North American dealerships (1,500 in the U.S.) sold more than 2.67 million cars and trucks (more than 2.35 million in the U.S.) in 2014 – and about 80 percent of all Toyota vehicles sold over the past 20 years are still on the road today. \nToyota partners with philanthropic organizations across the country, with a focus on education, safety and the environment. As part of this commitment, we share the company’s extensive know-how garnered from building great cars and trucks to help community organizations and other nonprofits expand their ability to do good. For more information about Toyota, visit www.toyotanewsroom.com . \nAbout Yahoo \nYahoo is a guide focused on informing, connecting, and entertaining our users. By creating highly personalized experiences for our users, we keep people connected to what matters most to them, across devices and around the world. In turn, we create value for advertisers by connecting them with the audiences that build their businesses. Yahoo is headquartered in Sunnyvale, California, and has offices located throughout the Americas, Asia Pacific (APAC) and the Europe, Middle East and Africa (EMEA) regions. For more information, visit the pressroom (pressroom.yahoo.net) or the Company’s blog (yahoo.tumblr.com). \nAbout Live Nation Entertainment \nLive Nation Entertainment LYV, +0.70% is the world's leading live entertainment company comprised of global market leaders: Ticketmaster, Live Nation Concerts, Live Nation Media & Sponsorship and Artist Nation Management. For additional information, visit www.livenationentertainment.com . \nView source version on businesswire.com: http://www.businesswire.com/news/home/20151013006047/en/ \nSOURCE: Yahoo! Inc.", "external_links": [], "published": "2015-10-13T16:05:00.000+03:00", "crawled": "2015-10-13T17:51:45.427+03:00", "highlightTitle": ""}