{"organizations": [], "uuid": "e86c966d493a2dbfff3daf62a87cd3c117ee32b7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "swtimes.com", "main_image": "http://swtimes.com/sites/swtimes.com/files/field/media/web1_Hunter-Pogue.jpg", "site_section": "http://swtimes.com/taxonomy/term/3/feed", "section_title": "Sports", "url": "http://swtimes.com/sports/football/football-rebels-pogue-enjoying-big-senior-season", "country": "US", "title": "Football: Rebels’ Pogue Enjoying Big Senior Season", "performance_score": 0, "site": "swtimes.com", "participants_count": 0, "title_full": "Football: Rebels’ Pogue Enjoying Big Senior Season", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T04:56:00.000+03:00", "replies_count": 0, "uuid": "e86c966d493a2dbfff3daf62a87cd3c117ee32b7"}, "author": "", "url": "http://swtimes.com/sports/football/football-rebels-pogue-enjoying-big-senior-season", "ord_in_thread": 0, "title": "Football: Rebels’ Pogue Enjoying Big Senior Season", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Times Record • ktaylor@swtimes.com \nSouthside linebacker Hunter Pogue is one of those players that doesn’t come along very often. When they do, coaches can’t afford to miss them. \n“I do remember people telling me about how hard of a hitter he was, which is an accurate account of his play,” Southside defensive coordinator Steven Thessing said. “He still moves a pile when he tackles someone. He has done a good job of getting better at reading his keys, which has allowed him to get to the ball faster and be able to make tackles.” \nPogue has been one of the Rebels’ most steady defenders this season, flying around with a team-high 70 tackles. He has 10 tackles for lost yardage. \nPogue and his defensive teammates limited Rogers to just two touchdowns in last week’s 35-13 victory, the Rebels’ first 7A-West win of the year. \n“He’s had a great year for us,” Southside head coach Jeff Williams said. “He made some plays for us his sophomore year and junior year, too. He’s really a great leader. He gets us lined up; he’s an extremely intelligent player. He’s really anchored our linebackers.” \nPogue says he’s put on “about 35 pounds” and has added two inches to his study 6-foot-2 frame since his ninth grade year at Trinity. \nThree years later, he and the Rebels are in a battle to extend the program’s post-season streak to eight. \n“We’ve got to go out and win,” Pogue said. “We’ve got to keep teams from passing and running on us. I think we’re growing as a program every week, and I believe we can win these last (four) games.” \nPogue is one of several former Trinity Buffs to play out their senior high career with the Rebels. \n“We have a rich tradition especially defensive players that have come from Trinity,” Thessing said. “We have four starting on defense right now that played at Trinity, and Cooper Johnson, our quarterback, played there also. They are usually very coachable and once they get adjusted to the speed of the game they do just fine.” \n“I kind of looked at Northside coming out,” he said. “They had a new coach and a new program, but after that I came over here for the Wednesday morning practices. After that, that made my decision pretty easy.” \nPogue’s progression from backup to starter meant the Rebels had a legitimate leader back in the fold. \n“He played quite a bit last year, but it’s his time this year to play,” Williams said. “He’s really taken ownership and shown great leadership.” \nPogue says following Thessing’s scheme comes down to simple execution. \n“Coach Thessing has a great system going over here,” Pogue said. “Each person has a job to do. If you do that job, you’re going to be successful, and if you don’t, you’re not going to win.” \n“He is a very well spoken kid, he is in charge of getting us lined up each play,” Thessing said. “He is the quarterback of the defense.”", "external_links": [], "published": "2015-10-12T04:56:00.000+03:00", "crawled": "2015-10-12T05:19:11.145+03:00", "highlightTitle": ""}