{"organizations": [], "uuid": "802f3830a71ff732ee0b87a7f3bfafb25b25dec1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dallasnews.com", "main_image": "http://www.dallasnews.com/incoming/20150916-1442425702-ns_04baylorutld12_40132019.jpg.ece/BINARY/original/1442425702-NS_04BAYLORUTLD12_40132019.JPG", "site_section": "http://www.dallasnews.com/sports/college-sports/texas-longhorns/", "section_title": "Texas Longhorns News - Sports News for Dallas, Texas ", "url": "http://www.dallasnews.com/sports/college-sports/headlines/20150916-carlton-concerned-interim-ad-mike-perrin-given-the-reins-to-texas-athletic-department.ece", "country": "US", "title": "Carlton: 'Concerned' interim AD Mike Perrin given the reins to Texas athletic department", "performance_score": 0, "site": "dallasnews.com", "participants_count": 10, "title_full": "Carlton: 'Concerned' interim AD Mike Perrin given the reins to Texas athletic department | Dallas Morning News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T20:49:00.000+03:00", "replies_count": 10, "uuid": "f722bb907aebb200b32a0c8832835cbd5267026e"}, "author": "Chuck Carlton", "url": "http://www.dallasnews.com/sports/college-sports/headlines/20150916-carlton-concerned-interim-ad-mike-perrin-given-the-reins-to-texas-athletic-department.ece#post-0", "ord_in_thread": 0, "title": "Carlton: 'Concerned' interim AD Mike Perrin given the reins to Texas athletic department", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "AUSTIN -- Mike Perrin has no idea how long this interim athletic director duty will last at Texas.He just wants to be around long enough to enact the changes that must be made at his alma mater. While his longevity is open to question, Perrin said his duties aren't as Texas president Greg Fenves introduced him Wednesday as the replacement for Steve Patterson.\n\"President Fenves hasn't limited my authority in that regard,\" Perrin said. \"He doesn't have me on a short leash outside of that which is implied in interim. I'm going to look at everything I can.\"\nPatterson was ousted Tuesday in a firing characterized as a \"mutually agreed upon resignation.\"\nPerrin steps into a situation trying to heal the damage between Patterson's policies and large portions of fans. Last week in the home opener against Rice, Perrin got a first-hand look at the problem with attendance generously announced at about 15,000 under capacity at Royal-Memorial Stadium.\n\"I sat in the stands last week and saw empty seats,\" Perrin said. \"I'm concerned last week that fans voted with their feet.\"\nThat's only part of the problem. Patterson was was viewed as caring about cash more than customers - and pretty much anything else.\nPerrin said he was concerned about accounts of long-time season-ticket holders bailing. He even described it as a \"kind of erosion, that sort of feeds on itself.\"\nHis comments mirrored those of Fenves. While he again declined to go into much detail about the differences that led to Patterson's departure, he said that \"what's very important to me is our relationships with our fans, our season-ticket holders and that they feel good about following Texas athletics.\"\nIf there are concerns about the relation with fans, that doesn't extend to the people in charge.\nPerrin strongly endorsed Texas coaches, including football coach Charlie Strong and men's basketball coach Shaka Smart by name. Early Wednesday morning, he addressed UT head coaches and executive level staff in the athletic department.\n\"I stand firmly behind our coaches,\" Perrin said.\nWhile active in UT organizations, Perrin has never worked full-time in an athletic department. In addition to the unrest with Patterson, he steps into a situation with a lot of moving parts, both within Texas and in the college sports world.\nThere are negotiations with current apparel provider Nike on what could be a blockbuster deal and the Oklahoma State's breach of contract lawsuit with Texas assistant football coach Joe Wickline over the extent of his play-calling duties.\nThe NCAA is facing several high-profile lawsuits that could change the fabric of college athletics.\nEven without the AD experience, Perrin's five decades as a high-profile attorney who has managed two law firms positions him well.\n\"To tell you the truth, where we're at is a lot of litigation,\" women's athletic director Chris Plonsky said. \"And Mike has been in that world.\"\nPlonsky said she has no plans to apply for the AD job. Former Texas coach Mack Brown also took himself out of the running Wednesday in an interview with CBS Sports. The focus for the moment is on Perrin.\n\"He's been a friend for thirty-some years,\" former Texas AD DeLoss Dodds said. \"It's a great decision.\"\nThe appointment has been in the works for more than a week.\nPerrin's attempt to fire up his grill on Labor Day was interrupted by an urgent phone call, two days after Texas lost 38-3 at Notre Dame.\nFenves was on the other end of the line. Would Perrin be interested in replacing Patterson on an interim basis?\nFlash forward to Wednesday.\n\"The seriousness of the job I've been asked to do is very important to me,\" Perrin said. \"I want to reach out to the entire Longhorn nation.\"\nMore on split of Texas, Steve Patterson\n(Eric Gay/AP)\nCarlton: Steve Patterson provided blueprint of what not to do as Texas athletic director\nTexas AD Steve Patterson out after two years with Longhorns\nSherrington: With AD out, no sure things at Texas for Charlie Strong, others\nPossible Texas AD candidates include Mack Brown and Big 12 competitors\nTom Hicks calls Steve Patterson's firing 'a tragedy,' but his own fault due to 'fatal flaw'\nNational reaction: Ex-Longhorns lobby for Mack Brown to replace Steve Patterson as Texas AD\nTexas president Greg Fenves sends email to Longhorn faithful, pledges support for Charlie Strong, Shaka Smart\nNational Analyst: Steve Patterson was 'too arrogant' for Texas\nOn Twitter:\n @ChuckCarltonDMN", "external_links": ["http://beta.sportsdaydfw.com/college-sports/collegesheadlines/2015/09/15/national-analyst-steve-patterson-arrogant-texas", "http://beta.sportsdaydfw.com/college-sports/collegesheadlines/2015/09/15/tom-hicks-calls-steve-pattersons-firing-tragedy-fault-due-fatal-flaw-inability-communicate", "http://beta.sportsdaydfw.com/college-sports/collegesheadlines/2015/09/15/carlton-steve-patterson-provided-blueprint-texas-athletic-director", "http://beta.sportsdaydfw.com/college-sports/texaslonghorns/2015/09/15/possible-candidates-texas-ad-job-include-mack-brown-big-12-competitors", "http://beta.sportsdaydfw.com/college-sports/texaslonghorns/2015/09/15/sherrington-pattersons-legacy-texas-one-acidic-relationships", "http://beta.sportsdaydfw.com/college-sports/texaslonghorns/2015/09/15/texas-ad-steve-patterson-fired", "https://twitter.com/ChuckCarltonDMN", "http://beta.sportsdaydfw.com/college-sports/collegesheadlines/2015/09/15/texas-ad-steve-patterson-resigns-mike-perrin-serve-interim", "http://beta.sportsdaydfw.com/college-sports/collegesheadlines/2015/09/15/longhorn-players-media-react-texas-ad-steve-pattersons-firing"], "published": "2015-09-16T20:49:00.000+03:00", "crawled": "2015-10-08T13:36:37.207+03:00", "highlightTitle": ""}