{"organizations": [], "uuid": "abad96826217443987f5405c3c1050ad6038c31b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports/soccer", "section_title": "Soccer News, Scores, Schedule, Standings, Stats, Photos, Videos - MSN Sports", "url": "http://www.msn.com/en-us/sports/premier-league/advocaat-sunderland-not-good-enough-to-survive-relegation/ar-AAf7GRl", "country": "US", "title": "Advocaat: Sunderland not good enough to survive relegation", "performance_score": 0, "site": "msn.com", "participants_count": 1, "title_full": "Advocaat: Sunderland not good enough to survive relegation", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "abad96826217443987f5405c3c1050ad6038c31b"}, "author": "8 dead as S. Carolina hit by torrential rainfall", "url": "http://www.msn.com/en-us/sports/premier-league/advocaat-sunderland-not-good-enough-to-survive-relegation/ar-AAf7GRl", "ord_in_thread": 0, "title": "Advocaat: Sunderland not good enough to survive relegation", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "\nAdvocaat: Sunderland not good enough to survive relegation FOXSports 3 hrs ago © Provided by Fox Sports\nDick Advocaat has admitted his Sunderland squad were simply not good enough to avoid another scrap for Barclays Premier League survival.\nAdChoices The 68-year-old head coach parted company with the club on Sunday just eight games into the new league season having failed to lead them to victory in any of them.\nHe left following Saturday's 2-2 home draw with West Ham without asking for a penny in settlement and retaining a fondness for the Black Cats, but has since revealed his reasons for doing so.\nAdvocaat told Studio Voetbal: \"I already made my decision last week, but the club asked me to do the match against West Ham and I really wanted to finish this in style.\n\"The struggle against relegation is not my cup of tea. I think it was time for someone else to take over at Sunderland. I became negative and that didn't feel like myself.\n\"I don't regret signing my new contract because it was a great experience. Our squad was simply not good enough. The club knew we had to strengthen ourselves, but the chairman [Ellis Short] never told me how much we could spend.\"\nSpeaking to De Telegraaf, he repeated his insistence that he had no regrets, adding: \"Sunderland is in my view a very beautiful club. What I have seen no one can take away from me and I would not have missed this for anything.\n\"Even on Saturday, there were three or four loud chants for me. The fans supported me until the last day, although they did not know I was leaving.\"\nAdvocaat's departure has created a vacancy Sunderland need to fill as quickly as possible, with first team coach Paul Bracewell and senior professional development coach Robbie Stockdale currently looking after those players not away on international duty.\nThe search for a replacement - which is perhaps further complicated by the fact that sporting director Lee Congerton is understood to be working his period of notice - is under way, although a definitive list of potential targets is yet to be drawn up.\nThere have been mixed messages as to leading candidate Sam Allardyce's readiness to return to the game over the last 24 hours, while Harry Redknapp has distanced himself from the vacancy and Patrick Vieira is not understood to be in the reckoning.\nThe availability of Allardyce following his West Ham exit at the end of last season and former Leicester counterpart Nigel Pearson makes them attractive to the Black Cats, but Sean Dyche too is a man who is held in high regard on Wearside.\nHowever, no appointment is imminent as the club tries to avoid the mistakes of the recent past and find a man who can galvanise a squad Advocaat believes are inadequate, and one which cannot be strengthened further, even if the money is available, until January.\nGo to MSN Home", "external_links": ["http://www.foxsports.com/", "http://go.microsoft.com/fwlink/?LinkID=286759"], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-05T22:18:26.656+03:00", "highlightTitle": ""}