{"organizations": [], "uuid": "811c0c129281b53b0153ada74106e1eb9614c14f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kctv5.com", "main_image": "http://RAYCOMGROUP.images.worldnow.com/images/8947324_G.jpg", "site_section": "http://www.kctv5.com/", "section_title": "Kansas City, Missouri, Kansas News, Weather, Sports - KCTV5", "url": "http://www.kctv5.com/story/30187366/publisher-to-revise-textbook-after-outcry-over-slavery-reference", "country": "US", "title": "Publisher to revise textbook after outcry over slavery reference", "performance_score": 0, "site": "kctv5.com", "participants_count": 1, "title_full": "Publisher to revise textbook after outcry over slavery reference - KCTV5", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T19:09:00.000+03:00", "replies_count": 0, "uuid": "811c0c129281b53b0153ada74106e1eb9614c14f"}, "author": "cbs8", "url": "http://www.kctv5.com/story/30187366/publisher-to-revise-textbook-after-outcry-over-slavery-reference", "ord_in_thread": 0, "title": "Publisher to revise textbook after outcry over slavery reference", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "PEARLAND, TX (KTRK/CNN) - A textbook publishing giant says it will rewrite a section in one of its books after a mother and her son questioned language referring to African slaves as workers and immigrants.\nLast week, Cobi Burren was about to read chapter five of a new world geography textbook in his ninth-grade geography class when he came across a reference to early immigration to the U.S.\n\"As indentured servants,\" Roni Dean-Burren, Cobi Burren's mother, said.\n\"It had Africans ... Africans - not African-Americans - as the Atlantic slave trade as workers implying pay, as if we had come here willingly and were paid to do our job,\" Cobi Burren said.\nHis response was a text picture to his mother \"and a sarcastic comment saying, 'We were real hard workers, weren't we?'\" he said.\n\"It was a little troubling,\" Roni Dean-Burren said.\nShe did some messaging of her own on Facebook, posting a video flipping through the book, detailing what it did and didn't include.\nMany of you asked about my son's textbook. Here it is. Erasure is... \"There is no mention of Africans working as slaves or being slaves,\" Roni Dean-Burren said.\nIt's been shared across the country, and it got the attention of the publisher, McGraw-Hill, which announced Friday it would revamp references in the textbook's digital version to state African slaves arrived as a forced migration and worked as slave labor.\nIt's a step but not adequate for Roni Dean-Burren.\n\"Many schools don't use the digital version, and we know that this textbook is going to set in schools for eight to ten years,\" she said.\nShe spoke with authority because she's a former Pearland teacher herself and is now a doctorate candidate specializing in education curriculum. Should the state need someone with her experience to vet school textbooks, she said she would relish the chance.\n\"All of these stories, I'm really wondering how they're being told outside of world geography,\" Roni Dean-Burren said. \"You know, this is the first step in high school history, so now what does the U.S. history book look like?\"\nMcGraw-Hill said it will also change the questionable language on slavery in the book's next printing, but Roni Dean-Burren and others asked the company to recall the book immediately.\nCopyright 2015 KTRK, Facebook, McGraw-Hill Education via CNN. All rights reserved.", "external_links": ["https://www.facebook.com/roni.deanburren/videos/vb.1423354683/10208248919206996/?type=2&theater"], "published": "2015-10-05T19:09:00.000+03:00", "crawled": "2015-10-05T20:05:13.132+03:00", "highlightTitle": ""}