{"organizations": [], "uuid": "23b0a21cb429efa3485e116e193fdc11d663636d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailynewsegypt.com", "main_image": "http://www.dailynewsegypt.com/app/uploads/2015/10/ChinaTennisShanghaiMasters.jpg", "site_section": "http://www.dailynewsegypt.com/category/sports/feed/", "section_title": "Daily News Egypt » Sports", "url": "http://www.dailynewsegypt.com/2015/10/22/djokovic-tennis-masters-shanghai/", "country": "US", "title": "Djokovic tennis masters Shanghai", "performance_score": 0, "site": "dailynewsegypt.com", "participants_count": 1, "title_full": "Djokovic tennis masters Shanghai", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T14:00:00.000+03:00", "replies_count": 0, "uuid": "23b0a21cb429efa3485e116e193fdc11d663636d"}, "author": "Daily News Egypt", "url": "http://www.dailynewsegypt.com/2015/10/22/djokovic-tennis-masters-shanghai/", "ord_in_thread": 0, "title": "Djokovic tennis masters Shanghai", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Advertising banner Djokovic tennis masters Shanghai Djokovic received his second title this year in China, one week after winning the China Open, defeating his Spanish opponent Rafael Nadal Pin +1 WhatsApp Tweet Share Share Email \nSerbian world number one tennis champion Novak Djokovic is close to achieving the World Championship title for the fifth time in his career and second time in a row, as he managed to win the Shanghai Masters tournament at the expense of his French rival Jo-Wilfried Tsonga, ranked No. 23 globally, by 6-2, 6-4 in the final game. \nDjokovic received his second title this year in China, one week after winning the China Open, defeating his Spanish opponent Rafael Nadal. The Shanghai Championship is part of the ATP world tour Masters 1000, which added to Djokovic’s score points, topping the international ranking of tennis players with 16,785 points that he achieved in the 18 championships in which he participated this year. \nWinning the Shanghai championship for the third time in his professional career increases Djokovic’s control of the solid fields in China, in which he achieved seven titles. \nIt is of note that Djokovic has won three titles in the Grand Slam this year, and came second in the France Open. Since his surprising defeat in the quarter-finals of the Qatar Championship against Ivo Karlović in January, he has reached the final in each of the 13 tournaments he participated in since. \nAlthough French runner-up Tsonga shined in the semi-final against Rafael Nadal, he did not show any resistance in the face of competition champion Djokovic in the final. \nDjokovic was able to achieve the title through five victories; the first of which was against Slovakian Martin Kližan by 6-2, 6-1, in the second round of the tournament, followed by a win over the Spanish player Feliciano López in the third round by 6-2, 6-3. In the quarter-finals, he defeated his Australian rival Bernard Tomic by 7-6, 6-1, and won in the semi-final against British Andy Murray by 6-1, 6-3. \nAs for the doubles competitions of the tournament, South African player Raven Klaasen along with his Brazilian teammate Marcelo Melo were able to win the title after beating the Italian duo, Simone Bolelli and Fabio Fognini with 6-3, 6-3 in the final match of the tournament.", "external_links": [], "published": "2015-10-22T14:00:00.000+03:00", "crawled": "2015-10-22T14:44:06.730+03:00", "highlightTitle": ""}