{"organizations": ["Columbia Centra", "Columbia Centra Tullahoma"], "uuid": "f6db4798d16ca906d20c1e1ed29547b1a2860304", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "columbiadailyherald.com", "main_image": "http://columbiadailyherald.com/sites/columbiadailyherald.com/files/field/media/web1_tssaa-bowling.jpg", "site_section": "http://columbiadailyherald.com/taxonomy/term/3/feed", "section_title": "Sports", "url": "http://columbiadailyherald.com/sports/preps/tullahoma-boys-roll-past-columbia-centra", "country": "US", "title": "Tullahoma boys roll past Columbia Centra", "performance_score": 0, "site": "columbiadailyherald.com", "participants_count": 0, "title_full": "Tullahoma boys roll past Columbia Centra", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T07:50:00.000+03:00", "replies_count": 0, "uuid": "f6db4798d16ca906d20c1e1ed29547b1a2860304"}, "author": "", "url": "http://columbiadailyherald.com/sports/preps/tullahoma-boys-roll-past-columbia-centra", "ord_in_thread": 0, "title": "Tullahoma boys roll past Columbia Centra", "locations": ["Tullahoma"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tullahoma boys roll past Columbia Centra Tullahoma boys roll past Columbia Centra From Staff Reports \nThe TSSAA District 8 bowling season is underway and is highlighted by a win from the host Tullahoma boys over No. 1 ranked and three-time defending state champion Columbia Central. \nThe Wildcats posted a 21-6 win over the Lions despite a sizzling high series of 745 by Central freshman Luke Flatt, who had games of 233, 279 and 233. \nTullahoma’s Kyle Dotson bowled games of 235, 266 and 225 for a 726 series. Dotson has help from his teammates including Austin Duncan with a 234 game, Elijah Manderson a 246 and John Cantrell with a 231. \nThe Lions had a good pin count of 3,295 but the Wildcats knocked down 3,590 as they won each of the three games. \nCentral’s Matthew Bushey rolled a 561 game with a 229 included. The Lions also had 200 plus games from Jay Molasy 238 and Alex Davis 204. \nColumbia Academy 15.5, Spring Hill 11.5: In a complete turnaround from a year ago, the Bulldogs team produced a win as Austin Butterfield and Patrick Hulen led the way with games of 190 and 189 respectively. \nSpring Hill, playing one short of the needed six bowlers, were led by Matt Venable with games of 228, 172 and 188 for the match’s high series of 588. Jarett Tice added games of 182 and 175. \nGIRLS \nSpring Hill 19, Columbia Academy 5: Acelyn Turner had games of 152 and 142 to pace the Lady Raiders, while teammate Kala Pugh aded a pair of 135 games. \nSpring Hill bowled with five and CA with three, therefore not the full 27 point score. \nThe Lady Bulldogs only had participants available with their top bowlers being Danielle Chase with a 150 and Hanna McCustny with a 124. \nColumbia Central 22, Tullahoma 5: The Lady Lions were paced by Zoe Courtemanche and Ashlyn Moyer with series of 586 sand 582 respectively. \nCourtemanche had a high game of 221 while Moyer rolled games of 204 and 201. \nTop games for Tullahoma were Amanda McCray with a 178 game and a 495 series. \n— Monday’s district schedule has Columbia Academy playing at Tullahoma and Spring Hill going to Marshall County. On Thursday, CA will roll meet Santa Fe at Galaxy Lanes in Columbia, and Lawrence County hosts Columbia Central.  ", "external_links": [], "published": "2015-10-19T07:50:00.000+03:00", "crawled": "2015-10-19T15:05:50.478+03:00", "highlightTitle": ""}