{"organizations": ["Wayland Campbell", "Nitto Tire"], "uuid": "64c89e77fd9f079b44c390e834109e73eb1d8934", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "globenewswire.com", "main_image": "http://globenewswire.com/Attachment/LogoDisplay/361801?filename=361801.jpg&amp;size=1", "site_section": "http://globenewswire.com//Rss/subjectcode/38/Sports", "section_title": "GlobeNewswire: Sports", "url": "http://globenewswire.com/news-release/2015/10/21/778470/0/en/Team-Nitto-Tire-Sweeps-the-2015-Ultra4-Season-Championship.html?f=22&fvtc=1&fvtv=Sports", "country": "US", "title": "Team Nitto Tire Sweeps the 2015 Ultra4 Season Championship", "performance_score": 0, "site": "globenewswire.com", "participants_count": 0, "title_full": "Team Nitto Tire Sweeps the 2015 Ultra4 Season Championship", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T14:00:00.000+03:00", "replies_count": 0, "uuid": "64c89e77fd9f079b44c390e834109e73eb1d8934"}, "author": "", "url": "http://globenewswire.com/news-release/2015/10/21/778470/0/en/Team-Nitto-Tire-Sweeps-the-2015-Ultra4-Season-Championship.html?f=22&fvtc=1&fvtv=Sports", "ord_in_thread": 0, "title": "Team Nitto Tire Sweeps the 2015 Ultra4 Season Championship", "locations": ["Nevada"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Eric Miller", "Reno", "Loren Healy", "Derek West", "Jason Scherer"], "text": "Learning & Support Team Nitto Tire Sweeps the 2015 Ultra4 Season Championship Drivers Loren Healy, Jason Scherer, and Eric Miller stand atop the podium after their Ultra4 race win in Reno, Nevada this past weekend while Derek West and Wayland Campbell celebrate their podium finishes in the Ultra4 National Championship Series. ET | Source: Nitto Tire \nCypress, Calif., Oct. 21,   Fast Facts: 2014 Ultra4 champion Loren Healy won the Nitto Tire Ultra4 Championship race in Reno, Nevada as well as the Trail Gear Western Ultra4 Regional Championship. Jason Scherer and Eric Miller round out the Nitto sweep of the Nitto Nationals race. Derek West finished the season second place in points and also won the 4WD Hardware Eastern Regional Championship. Wayland Campbell had his best season ever and finished third in the Ultra4 National Championship. Nitto Trail Grappler M/T 40x13.50R17 tires have continued to dominate the Ultra4 series. \nNitto Tire, a leading manufacturer of off-road and street performance tires, swept the podium at the Ultra4 National Championships on October 17, 2015 at the Wild West Motorsports Park in Reno, Nevada. Team Nitto drivers Loren Healey, Jason Scherer, and Eric Miller dominated the field of 60 cars in the 4400 Unlimited class race and Derek West and Wayland Campbell secured their second and third place finishes in the series. \nIn the final event of the 2015 season, Team Nitto drivers swept the podium at the Ultra4 National Championship event. Defending series champion and 2015 Trail Gear Ultra4 Western Regional champion Loren Healy jumped out to an early lead and remained at the head of the pack throughout the race to take home the win, his 4 th consecutive victory. In second place was Nitto Tire teammate Jason Scherer, who managed to keep the past champion in his sights all race long, but just couldn’t find a way around Healy. Rounding out the all-Nitto podium was Eric Miller, who fought a hard battle for third place, making an amazing pass in the last 100 yards of the track. What makes this victory even more special was that this was the second time this season that Nitto swept the podium and it has been the only tire manufacturer to do so all year. \nSeveral other Team Nitto drivers had strong finishes at the National Championship race. Shannon Campbell and Derek West were part of the group that battled it out for third place and finished in a very close six and seventh place, respectively. Wayland and Bailey Campbell were also in that group and were had been chasing down their father when they finished in a respectable ninth and 11 th places. This meant that seven out of the top 11 drivers were all running on the 40x13.50R17 Nitto Trail Grappler M/T. \nThe 2015 Ultra4 Season Championship points race was neck and neck going into the Nitto Tire National Championship race in Reno, Nevada. When the dust settled, Nitto Tire drivers Derek West and Wayland Campbell claimed two of the three top spots in the Ultra4 National Championship Series. Derek had a great season with a win in Indiana and a podium finish in Arkansas which helped him clinch the number two spot for in the championship. Wayland Campbell, son of recent International Off-Road Motorsports Hall of Fame inductee Shannon Campbell and one of the youngest racers in the series, had his best Ultra4 season ever where he got his first ever 4400 class podium alongside his father at the Ultra4 Stampede in Sacramento, California as well as multiple top-five finishes which helped earn him a third place finish for the season. \n“Everyone at Nitto Tire couldn’t be more excited about the performance of all of the Team Nitto drivers this year,” said Nitto Tire U.S.A. Off-Road and Light-Truck Manager Chris Corbett. “Ultra4 racing is the toughest and most demanding off-road motorsport around and it really validates all of the hard work we put into the development of our Grappler line of tires when our drivers can continually be the dominant racers in the series on the same tires you can buy through your local tire store. This is the best group of drivers we have ever had the privilege to work with and we are very excited to see what they can accomplish when the 2016 season kicks off at the King of the Hammers in February.” \nFor more information about Ultra4 Racing, visit www.ultra4racing.com , learn more about Nitto-sponsored drivers at www.nittoracing.com and complete details on Nitto tires can be found at www.nittotire.com . Join Nitto Tire on Facebook at www.facebook.com/NittoTire and on Twitter at @NittoTire . \nAbout Nitto Tire \nNitto Tire ( www.nittotire.com ) develops performance tires for all uses, including racing, off-road and street. Using state-of-the-art manufacturing and testing facilities in both Japan and the United States, Nitto provides innovative and high-quality performance tires for the most demanding automotive enthusiasts. For more information about Nitto or its products, visit the company's web site or contact the company directly. Nitto is a registered trademark of Nitto Tire U.S.A. Inc., located at 5665 Plaza Drive, Ste. 250, Cypress, CA 90630. \n#NittoTire Jon Barrett – Kahn Media 818/881-5246 Jon@KahnMedia.com Related Articles", "external_links": [], "published": "2015-10-21T14:00:00.000+03:00", "crawled": "2015-10-21T15:45:25.713+03:00", "highlightTitle": ""}