{"organizations": ["NFC East", "Giants", "Cowboys Giants"], "uuid": "5ac7cbff47fa59e38c9d75f35214996cc0568ac9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonpost.com", "main_image": "http://img.washingtonpost.com/rf/image_908w/2010-2019/Wires/Images/2015-10-25/Getty/494263238.jpg", "site_section": "http://www.washingtonpost.com/rss/sports", "section_title": "Sports", "url": "https://www.washingtonpost.com/news/fancy-stats/wp/2015/10/26/giants-in-command-of-nfc-east-after-win-over-cowboys/", "country": "US", "title": "Giants in command of NFC East after win over Cowboys", "performance_score": 0, "site": "washingtonpost.com", "participants_count": 0, "title_full": "Giants in command of NFC East after win over Cowboys", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T19:16:00.000+02:00", "replies_count": 0, "uuid": "5ac7cbff47fa59e38c9d75f35214996cc0568ac9"}, "author": "", "url": "https://www.washingtonpost.com/news/fancy-stats/wp/2015/10/26/giants-in-command-of-nfc-east-after-win-over-cowboys/", "ord_in_thread": 0, "title": "Giants in command of NFC East after win over Cowboys", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Neil Greenberg"], "text": "Giants in command of NFC East after win over Cowboys Resize Text By Neil Greenberg October 26 at 12:38 PM Follow @ngreenberg The Giants are 4-3 and on top of the NFC East. (Photo by Elsa/Getty Images) \nThe Washington Redskins pulled off a comeback for the ages, setting their record at 3-4, putting them right in the thick of an NFC East race that looks too close to call. \nThe Philadelphia Eagles lost to the Carolina Panthers this week and the Dallas Cowboys have lost four straight, most recently to the New York Giants, who are now at the top of the NFC East. And based on the remaining schedule, New York looks poised to stay there. \nBefore the completion of Week 7, the Giants had the 16th easiest remaining set of games , per Football Outsiders. The Redskins, Eagles and Cowboys were 18th, ninth and fourth, respectively. \nOnce quarterback Tony Romo and wideout Dez Bryant come back from injury, this Dallas team should improve, but the damage may already be done, especially in light of one of the toughest schedules remaining: Seattle, Miami, Carolina, Green Bay and the New York Jets are the games that await the Cowboys over the next few weeks, and even with a healthy roster would not be an easy road to travel. \nThe Eagles have New England, Miami and Arizona still to play while the Redskins will face key games against Carolina and New England. But the Giants face a softer schedule and are the best team, giving them the inside track to win the division. \nWe can estimate a team’s true winning percentage by regressing their actual win percentage to the mean by adding eleven games of .500 ball to the team’s current record. For example, the Giants are 4-3, so we would add 5.5 wins to their total (9.5) and divide by the sum of their actual games plus 11 (18), giving them a true win percentage of .528. After doing this for all the NFL teams, we then use the following equation to estimate the probability of one team beating another, adjusting for home-field advantage. \nHere is how often each team wins the NFC East after simulating the season 1,000 times: \nA lot can change between now and the end of the season, but as of right now, the Giants appear to be in complete control of their playoff destiny. Neil Greenberg analyzes advanced sports statistics for the Fancy Stats blog and prefers to be called a geek rather than a nerd. sports Success! Check your inbox for details. You might also like: Please enter a valid email address Sign Up", "external_links": [], "published": "2015-10-26T19:16:00.000+02:00", "crawled": "2015-10-26T19:17:40.632+02:00", "highlightTitle": ""}