{"organizations": [], "uuid": "5014581dfc90c6336ac9e75aeae37346ba833421", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.torontosun.com", "main_image": "http://storage.torontosun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297760986873_ORIGINAL.jpg?quality=80&size=100x", "site_section": "http://www.torontosun.com/sports/football", "section_title": "Football | Sports | Toronto Sun", "url": "http://www.torontosun.com/2015/10/16/eskimos-kick-off-end-of-season-stretch-needing-to-ignore-whats-happening-in-the-rest-of-the-league", "country": "CA", "title": "Eskimos kick off end-of-season stretch needing to ignore what's happening in the", "performance_score": 0, "site": "torontosun.com", "participants_count": 1, "title_full": "Eskimos kick off end-of-season stretch needing to ignore what's happening in the", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T06:23:00.000+03:00", "replies_count": 0, "uuid": "5014581dfc90c6336ac9e75aeae37346ba833421"}, "author": "torontosun.com", "url": "http://www.torontosun.com/2015/10/16/eskimos-kick-off-end-of-season-stretch-needing-to-ignore-whats-happening-in-the-rest-of-the-league", "ord_in_thread": 0, "title": "Eskimos kick off end-of-season stretch needing to ignore what's happening in the", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The letdown factor is the elephant in the Edmonton Eskimos dressing room before tonight’s game against the B.C. Lions.\nAnd it’s a pink elephant. Tonight is CFLPink Night in Edmonton in support of breast cancer.\nThe other thing in the dressing room that may come into play is the TV set.\nThe meaning of the Eskimos-Lions game here changes with the result of the Calgary Stampeders-Toronto Argos game in Hamilton that precedes it.\nA Calgary (11-4) win and this one becomes ‘must-win’ to preserve the same record and remain in first place in the Western Conference. A Calgary loss and the Eskimos (also 11-4 but having won the season series) will be playing with a net and/or become killer instinct time.\nA Stampeders loss followed by an Eskimos win over the Lions would put the defending Grey Cup champions in the rear view mirror and reduce the Edmonton magic number to one. Any combination of an Eskimos win or a Calgary loss in the remaining two games the two teams have on their schedule and Edmonton will play host to the first Western Final since 2003.\n“I would hope that would not affect how we would approach this football game,” said Eskimos’ head coach Chris Jones.\nThe Eskimos, if they win their final three games of the regular season, would prefer to be 14-4 and Calgary can play Toronto in Halifax, Hamburg, Helsinki, Hong Kong or Honolulu for all they care.\n“We have three games left to play, so there’s going to be a lot more football left even after this week that we have to attend to. We just have to attend to the task at hand and that’s the B.C. Lions,” said the head coach.\nJones, who takes a 23-10 record and a five-game winning streak (the Eskimos were 6-4 coming out of Labour Day) into this game, would probably prefer if his players were able to continue to avoid paying attention to any other games or any statistics at all.\nIt’s like when a family is driving through a beautiful stretch of scenery on a treacherous mountain road and the kids tell the driver, “Don’t look. daddy!”\nBut there is one stat that you figure his defence has to have an eye on.\nThe Eskimos need to hold B.C., Saskatchewan and Montreal to a combined 29 points to get the CFL record for fewest points given up in a season (302 points by Edmonton in 1989 for a 16.8 points per game average).\nBut that’s not a focus this week.\nThe big thing is the same thing it should have been after the Eskimos came off the Murderers Row five-game stretch of their schedule, with games against Hamilton-Toronto-Calgary-Calgary-Hamilton.\nThe fear was following the massive wins in the last two of the Murderer’s Row games that the Eskimos would have letdown games. And you could make the case that they did. Edmonton didn’t exactly bring the ‘A’ game against B.C. and Winnipeg, escaping with extremely fortunate come-from-behind wins in both.\nThe Eskimos were down 23-7 to the B.C. Lions with less than five minutes to play in the third quarter and the much-vaunted defence and the much-maligned offence, were stinking out the joint.\nAgainst Winnipeg, Sean Whyte had to make a 53-yard field goal with 0:00 on the clock to win it.\nComing off their biggest win of the season in Calgary last week, having a letdown game in this one has to be a worry. The Eskimos haven’t won anything yet but considering how big the win was last weekend, it felt like they did.\n“We certainly don’t feel that way, I can guarantee that. We’ve moved on,” said middle linebacker J.C. Sherritt.\nThis time, he says, they have it handled.\n“We’re facing a B.C. team that beat us and took us to the wire. We know if we slip up they’ll have our number. We don’t change our approach one bit from last week and we haven’t,” added the leader of the league-leading defence.\n“We can’t focus on anything other than just coming out and playing the very best football. We don’t talk about being too up or too down. We just come out and try to be consistent if we can,” said Jones.\n“We put a good week’s work in. The guys practised really hard and had fun competing against each other on Day 2, and I thought the meetings have gone really well, so we think we’ve done what we can as coaches to get them to the game in a good frame of mind.\n“I know this: most games we show up and play pretty good football and we tend to win a lot of football games.”\nFollow me on Twitter.com/sunterryjones\nterry.jones@sunmedia.ca\nEskimos kick off end-of-season stretch needing to ignore what's happening in the rest of the league\nBy Terry Jones , Edmonton Sun First posted: Friday, October 16, 2015 06:23 PM EDT | Updated: Friday, October 16, 2015 10:16 PM EDT\nThe letdown factor is the elephant in the Edmonton Eskimos dressing room before tonight’s game against the B.C. Lions.\nAnd it’s a pink elephant. Tonight is CFLPink Night in Edmonton in support of breast cancer.\nThe other thing in the dressing room that may come into play is the TV set.\nThe meaning of the Eskimos-Lions game here changes with the result of the Calgary Stampeders-Toronto Argos game in Hamilton that precedes it.\nA Calgary (11-4) win and this one becomes ‘must-win’ to preserve the same record and remain in first place in the Western Conference. A Calgary loss and the Eskimos (also 11-4 but having won the season series) will be playing with a net and/or become killer instinct time.\nA Stampeders loss followed by an Eskimos win over the Lions would put the defending Grey Cup champions in the rear view mirror and reduce the Edmonton magic number to one. Any combination of an Eskimos win or a Calgary loss in the remaining two games the two teams\nAbout the author Terry Jones Follow Terry Jones on Twitter Other Stories Brick furniture chain founder Bill Comrie making most of minority ownership of NLCS Cubs\nCan you imagine being owner of the Chicago Cubs, the baseball franchise that hasn’t won a World Series since 1908, if this turns out to be the year they finally do it?\n0\nIt’s about a first-place bye says Edmonton Eskimos' Almondo Sewell\nThere’s a difference going to Calgary for a Labour Day Classic in September to going back to McMahon Stadium for Game 15 in October.\n0\nSee more from Terry Jones »\n ", "external_links": ["http://pubads.g.doubleclick.net/gampad/clk?id=182027221&iu=/3081/SMCO_ENUR_TSUN_EN_WEB", "http://pubads.g.doubleclick.net/gampad/clk?id=228633661&iu=/3081/SMCO_ENUR_TSUN_EN_WEB", "http://pubads.g.doubleclick.net/gampad/clk?id=182024221&iu=/3081/SMCO_ENUR_TSUN_EN_WEB", "http://twitter.com/sunterryjones", "http://pubads.g.doubleclick.net/gampad/clk?id=183052021&iu=/3081/SMCO_ENUR_TSUN_EN_WEB"], "published": "2015-10-17T06:23:00.000+03:00", "crawled": "2015-10-18T23:58:06.895+03:00", "highlightTitle": ""}