{"organizations": [], "uuid": "9b2b59c0a4b7aef5b83fed25b7c84e0b5000d9c4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/49171173.cms", "site_section": "http://timesofindia.indiatimes.com/sports/more-sports/shooting/articlelist/3413165.cms", "section_title": "Shooting - More sports - Sports - The Times of India", "url": "http://timesofindia.indiatimes.com/sports/more-sports/shooting/Heena-Sidhu-Shweta-Singh-win-gold-and-silver-at-Asian-AirGun-Championship/articleshow/49168545.cms", "country": "IL", "title": "Heena Sidhu, Shweta Singh win gold and silver at Asian AirGun Championship", "performance_score": 0, "site": "indiatimes.com", "participants_count": 6, "title_full": "Heena Sidhu, Shweta Singh win gold and silver at Asian AirGun Championship - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T03:00:00.000+03:00", "replies_count": 5, "uuid": "9b2b59c0a4b7aef5b83fed25b7c84e0b5000d9c4"}, "author": "timesofindia.indiatimes.com", "url": "http://timesofindia.indiatimes.com/sports/more-sports/shooting/Heena-Sidhu-Shweta-Singh-win-gold-and-silver-at-Asian-AirGun-Championship/articleshow/49168545.cms", "ord_in_thread": 0, "title": "Heena Sidhu, Shweta Singh win gold and silver at Asian AirGun Championship", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW DELHI: Former world number one Heena Sidhu lived upto the billing as she clinched the gold medal in women's 10m air pistol to cap off India's campaign at the 8th Asian AirGun Championship on a winning note on Wednesday.\nIndia also had the silver medal in the kitty as Shweta Singh stood second on the podium in the day's marquee event, ahead of bronze medallist Seon A Kim of Korea.\nHaving topped the qualification with a score of 387 alongside another young Indian shooter Yashaswini Singh Deshwal, former world champion Heena shot 197.8 to win the top prize in the final. Shweta aggregated 197.0, while Kim managed 175.8.\nIn her first international final, Yashaswini finished a creditable fourth after shooting 155.3.\nIndia, thus, won an impressive haul of 17 medals, including six gold (two in individual senior), to finish as toppers in the continental event, which lost some sheen after the pull-out of powerhouse China and Korea's decision to not send numero uno pistol shooter Jin Jong-oh.\nIndia bagged five silver and six bronze.\nIn the overall standings, Iran took the second place with 12 podium finishes, including six gold and five silver medals, followed by Taipei, winning one gold, two silver and as many bronze.\nIn the day's much-awaited event -- women's 10m air pistol -- Heena got off to a terrific start firing a 10.7. But it was Shweta who was in lead after the first three shots with 2 10s to modest 9.8, 9.3 by Heena.\nWith 61.3 points, Shweta continued to lead after the next three shots, as Heena followed with 60.7.\nAs Iran's Elham Harijani got eliminated, Heena found her bearings again to topple Shweta from the lead. It was around this time that Korea's Kim started to head north with some consistent scores, including a magnificent 10.9.\nShweta shot to the top for a moment before Heena wrested the position again with a series of mid to high 10s.\nEven as the Korean was eliminated after a brave fight, Heena and Shweta engaged in an intriguing tussle before the Ludhiana-born Mumbai-based shooter prevailed.\nHeena was satisfied with her effort in the qualification but the final was not upto the mark, according to her.\n\"Most of the time there was a lot of delay. I was taking a lot of time, that plays on your mind. Today, I was not happy with the way I shot in the finals, this was a lower finals for me,\" Heena said.\nThe first Indian pistol shooter to be ranked world number one, Heena added, \"My shots were getting fired as the delay makes you a little jittery.\n\"Pressure was there, you shooting at home and everybody watching you. But clapping doesn't matter to me. It's no distraction.\"\nShweta was happy that she could win her first international medal after the Incheon Asian Games last summer.\n\"This medal means after a year I made it to the podium, last time being the Asian Games. I wish I could have shot better in the qualification (383). But definitely, this will help me boost my confidence ahead of the Asian Shooting Championship,\" Shweta said.\nThe Asian Shooting Championship, to be held in Kuwait in November, will be the last qualifying event for next year's Rio Olympics.\nIn the women's 10m air pistol (junior), Nivetha Shri Paramanantham, Gauri Sheoran and Shreya Gawande bagged the top three prizes, respectively.\nIn the youth 10 air pistol (youth), India's Harshada Nithave won the individual bronze medal, while she combined with Malaika Goel and Nayani Bhardwaj to claim the team gold in the event.\nThe trio of Heena, Shweta and Yashaswini won the team gold in women's 10m air pistol ahead of Sri Lanka.", "external_links": [], "published": "2015-09-30T03:00:00.000+03:00", "crawled": "2015-10-14T02:58:34.605+03:00", "highlightTitle": ""}