{"organizations": [], "uuid": "ad5e23decffd9c3552a670b8ae4e897bd6413d9c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "thecabin.net", "main_image": "http://thecabin.net/sites/default/files/14833318.jpg", "site_section": "http://thecabin.net/taxonomy/term/60/2/feed", "section_title": "TheCabin.net - Conway, Arkansas - Sports", "url": "http://thecabin.net/sports/2015-10-24/hendrix-seeking-begin-rowing-club-sport", "country": "US", "title": "Hendrix seeking to begin rowing as a club sport", "performance_score": 0, "site": "thecabin.net", "participants_count": 1, "title_full": "Hendrix seeking to begin rowing as a club sport", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T20:25:00.000+03:00", "replies_count": 0, "uuid": "ad5e23decffd9c3552a670b8ae4e897bd6413d9c"}, "author": "ANDY ROBERTSON", "url": "http://thecabin.net/sports/2015-10-24/hendrix-seeking-begin-rowing-club-sport", "ord_in_thread": 0, "title": "Hendrix seeking to begin rowing as a club sport", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Hendrix seeking to begin rowing as a club sport Posted: October 24, 2015 - 12:25pm \nBy ANDY ROBERTSON \nLOG CABIN STAFF WRITER \nHendrix College is exploring starting a rowing club, with a goal of starting competition during the spring semester. \nBecause the students are not competing under the NCAA jurisdiction, it will be a club sport. \nThe Hendrix club will likely against clubs from Rhodes College (a fellow Southern Athletic Association member), Northwestern State University (Southland Conference), Texas A&M–Galveston and Samford University. \nWhen competition begins next fall fall, the club will compete against other clubs in Louisiana, Oklahoma and Texas. \n“The goal is for students to have a fun recreational experience, learning the fundamentals of rowing, which includes rhythm, teamwork and synchronization,” volunteer and current coach Michelle Teague said. \nTeague has competed with RowAmerica North Little Rock in the Six Bridges Regatta on Sept. 19 on the Arkansas River. She placed fifth in Mixed Masters Double Sculls. She also competed Mixed Masters Single Scull, where she finished third and Mixed Open Eight, where the Arkansas Boathouse Club finished third. \nTeague also worked on the regatta organizing committee to recruit clubs to the second regatta. \nA scull refers to athletes with two oars – one in each hand. For races, there are three sculling events: the single, double and the quad. A race is called a regatta. \nRowAmerica North Little Rock competes under parent organization, US Rowing. \nFor starters, Hendrix will be using a quad scull to an eight-person team called an octuple scull. As the team gets more experience rowing, Teague thinks the team will get single and double scull teams together. \nHendrix alumnus Jim Smith, whom Teague said came up with the idea to bring a rowing club to Hendrix, is helping coach students until a longterm option gets filled. \nTeague said she thinks a Hendrix faculty sponsor was found Wednesday, so the club can start gaining traction. The club is looking to start holding boats at Beaverfork Lake so the team can practice there. However, until this happens, the team is working on land and indoor rowing machines, learning safe rowing techniques. \n“At our first meeting, we had a good amount of students interested in the club,” Teague said. \nAt the first meeting for the club, 18 students showed up with six to 10 people of core leadership signing an agreement to compete.", "external_links": [], "published": "2015-10-24T20:25:00.000+03:00", "crawled": "2015-10-24T20:58:52.515+03:00", "highlightTitle": ""}