{"organizations": [], "uuid": "e86bf23904a3d273812dc8361bbd87a2059378a4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.fox8live.com", "main_image": "http://WVUE.images.worldnow.com/images/9008504_G.jpg", "site_section": "http://www.fox8live.com/", "section_title": "New Orleans News, Weather, Saints - FOX 8 WVUE New Orleans News, Weather, Sports, Social", "url": "http://www.fox8live.com/story/30252861/labruzzo-ordered-to-stop-implying-wrongdoing-by-appel", "country": "US", "title": "LaBruzzo ordered to stop implying wrongdoing by Appel", "performance_score": 0, "site": "fox8live.com", "participants_count": 1, "title_full": "LaBruzzo ordered to stop implying wrongdoing by Appel - FOX 8 WVUE New Orleans News, Weather, Sports, Social", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T01:31:00.000+03:00", "replies_count": 0, "uuid": "e86bf23904a3d273812dc8361bbd87a2059378a4"}, "author": "Written by: Rob Masson", "url": "http://www.fox8live.com/story/30252861/labruzzo-ordered-to-stop-implying-wrongdoing-by-appel", "ord_in_thread": 0, "title": "LaBruzzo ordered to stop implying wrongdoing by Appel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "JEFFERSON PARISH, LA (WVUE) - The battle over a Jefferson Parish Senate district landed in a Gretna courtroom Tuesday.\nA judge signed an order saying that former state Rep. John LaBruzzo must stop implying that Senate incumbent Conrad Appel did anything improper when it comes to the politically hot topic of Common Core.\n\"He's obviously trying to sling mud at me, so today is as good as it gets,\" said Appel as he left court.\nThey are two legislative veterans involved in a political dogfight.\n\"We were never implying there was anything improper or unethical, we just wanted to get the facts out,\" LaBruzzo said.\nMetairie Republican Appel sued LaBruzzo over mailers sent out by his campaign which try to link Appel to the Common Core educational standards.\n\"In any election, people need to know what's happening so they can make an informed decision,\" LaBruzzo said.\nThe fliers allege that Appel profitted from Common Core, a charge Appel flatly denies. The judge agreed, and signed an order saying that LaBruzzo can no longer imply that Appel did anything improper.\n\"When people engage in things like this to hide their past, their own problems with things like pay raises, we have to worry about our Democracy,\" Appel said.\nThe flier has already been mailed out, so today's ruling has no affect on its content.\n\"He agrees that the statements made in the flier are not accurate, so I think we've been vindicated today,\" Appel said.\nThe Tuesday court hearing is just the latest salvo in a race that's becoming increasingly bitter, but LaBruzzo says he didn't start it.\n\"There were things that were said about me that were untrue,\" Labruzzo said.\n\"We had a radio ad which has a dog barking in the background. No one called him a dog,\" Appel said.\n\"We didn't sue, because we have faith in the voters,\" Labruzzo said.\n\"When you decide to file a suit, it's a Catch 22,” said FOX 8 political analyst Mike Sherman. “You can let it go, but when you file, you're bringing more attention to the issue.\"\nBut in spite of that, Sherman calls this campaign cycle the year of the lawsuit, especially in Jefferson Parish.\nLabruzzo says the fliers in question were mailed out last week to thousands of Jefferson parish voters, long before today's court decision. Voters should get them later this week.\nCopyright 2015. WVUE all rights reserved.", "external_links": [], "published": "2015-10-14T01:31:00.000+03:00", "crawled": "2015-10-14T03:31:14.394+03:00", "highlightTitle": ""}