{"organizations": [], "uuid": "6db1a06e6b3926d53e32479ffd783fa2cb3f14f2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.annistonstar.com", "main_image": "http://bloximages.chicago2.vip.townnews.com/annistonstar.com/content/tncms/assets/v3/editorial/4/db/4db13fd6-6f08-11e5-ba3b-f776d784dd18/56189620b9cbb.image.jpg", "site_section": "http://www.annistonstar.com/search/?q=&t=article&l=100&d=&d1=&d2=&s=start_time&sd=desc&nsa=eedition&c%5B%5D=the_daily_home/dh_sports,the_daily_home/dh_sports/*&f=rss", "section_title": "The Anniston Star - the daily home/dh sports,the daily home/dh sports/", "url": "http://www.annistonstar.com/the_daily_home/dh_sports/sylacauga-pulls-off-great-escape-holds-on-for--/article_1c536c3e-6f08-11e5-b0d2-e3d3f4e61b9d.html", "country": "US", "title": "Sylacauga pulls off great escape; holds on for 49-48 win after Shelby County 2-point try fails", "performance_score": 0, "site": "annistonstar.com", "participants_count": 1, "title_full": "Sylacauga pulls off great escape; holds on for 49-48 win after Shelby County 2-point try fails", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T07:30:00.000+03:00", "replies_count": 0, "uuid": "6db1a06e6b3926d53e32479ffd783fa2cb3f14f2"}, "author": "SHANE DUNAWAY, Home sports writer", "url": "http://www.annistonstar.com/the_daily_home/dh_sports/sylacauga-pulls-off-great-escape-holds-on-for--/article_1c536c3e-6f08-11e5-b0d2-e3d3f4e61b9d.html", "ord_in_thread": 0, "title": "Sylacauga pulls off great escape; holds on for 49-48 win after Shelby County 2-point try fails", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  Big night for Ross \nKe'Vion Ross carried 14 times for 151 yards and one touchdown in Sylacauga's victory over Shelby County on Friday night at Legion Stadium. Posted: Friday, October 9, 2015 11:30 pm | Updated: 11:39 pm, Fri Oct 9, 2015. Sylacauga pulls off great escape; holds on for 49-48 win after Shelby County 2-point try fails By SHANE DUNAWAY, Home sports writer Annistonstar.com SYLACAUGA – In a Class 5A, Region 3   game where big plays were bountiful, one play decided a close-fought, 49-48 Sylacauga homecoming victory over Shelby County at Legion Stadium on Friday. Wildcats running back Jamarius Mayfield had just punched in his fourth touchdown from 16 yards out with 1:06 left to play, cutting Sylacauga’s lead to a single point. Shelby County coach Heath Childers opted not to kick the extra point and instead sent his offense onto the field for a two-point conversion attempt. It took four tries to run the play – the first interrupted by an offsides penalty on Sylacauga (5-2, 3-1). On the second attempt, spotted inside the Aggies’ 2-yard line, Mayfield ran the ball in for what appeared to be a game-winning conversion, but a holding penalty took the points off the board. The 10-yard spot-foul pushed the ball back to just beyond the Aggies’ 15, and after a false start penalty on their third try, the Wildcats ended up attempting the two-point try from outside the red zone. Running the wing-T that allowed Shelby County (2-6, 1-4) to churn up 542 yards of offense on the Aggies, Wildcats quarterback Chadwyn Russ faked a handoff and rolled to his right, heaving a desperation pass toward the end zone that was batted down by Sylacauga defensive back Donterrio Story. Sylacauga also success offensively, gaining 462 total yards, but the Aggies found themselves starting with a short field thanks to the Wildcats’ pooch kickoff strategy. Late in the first quarter, the kickoff strategy paid off when Sylacauga fumbled the return. The Wildcats recovered the fumble and scored a few plays later on a 1-yard touchdown run by Buie to give them a 20-7 lead early in the second quarter. “We tell our kids all the time, you handle the ups and downs of a game,” said Sylacauga coach Matt Griffith. “Your games are going to have a huge momentum swing that’s yours and you’re going to have momentum swings that aren’t yours. You’ve got to be able to handle it. Those are the things in the offseason where you have to make your kids mentally tough to be able to handle adversity.” The Aggies regained control of the game courtesy of a pair of 100-yard rushing efforts. Running back Alex Thomason carried the ball 17 times for 100 yards and four touchdowns, while backup running back Ke’Vion Ross added 151 yards and a touchdown. Ross also caught one pass for 16 yards. Quarterback Jackson Walker also gained 83 rushing yards on 15 carries, as well as completing 6 of 11 passes for 80 yards. “They both had good games,” Griffith said. “I thought (Walker) threw the ball well tonight. I thought he managed the offense well. Up front, we’re blocking extremely well.” He added he expected the kind of performance the Wildcats exhibited on the field, giving plenty of credit to the opposition’s effort. “We knew (Mayfield) coming in was going to be really good back to stop,” Griffith said. “Now this group, they’ve struggled with wins and losses, but they’ve moved the football and gone against everything. They were really good offensively and defensively earlier in the year before injuries hurt them. “This team always plays our team very tough. We’ve been saying that all week that it was going to be a physical ball game that came down to four quarters. I don’t know why anyone else didn’t believe that was going to happen. We as a coaching staff knew it.” Griffith said the game highlighted some areas where his team must improve as it moves forward with region play. “This week, we tried to back off our kids a little bit to get healthy,” he said. “We didn’t tackle well. We’ve got to go back right there. We’ve got to tackle every day, or we’re going to give up a lot of points.” Childers praised his squad despite the missed two-point conversion. “It was a tough ending, but first of all, I’m really proud of our kids,” Childers said. “There was a lot of things that happened this week. We lost three or four of our starters in practice due to injury, we lost some guys last week in a game due to injury and we had a lot of guys going in playing hurt tonight. “We had some freshman and sophomores having to play in spots they weren’t used to playing in, but they came out and they fought hard. They’re winners in my book. Their best is good enough, and I got their best tonight.” Mayfield finished the game with 327 yards and four touchdowns on 23 carries. Fellow Wildcat Jacquan Buie added 106 yards and two touchdowns on 16 carries. “He’s a warrior, and we’d be lost without him,” Childers said of Mayfield. “He’s grown up a lot this past year. When I took over as head coach, he and I – our relationship wasn’t the best in the world – but he’s grown up and matured a lot. He’s a warrior. I can’t say enough about the kid. He’s a great football player.” \nContact Shane Dunaway via email at sdunaway@dailyhome.com or on Twitter @DailyHome_Shane.", "external_links": [], "published": "2015-10-10T07:30:00.000+03:00", "crawled": "2015-10-10T20:28:08.324+03:00", "highlightTitle": ""}