{"organizations": [], "uuid": "e8a9860bac1ea00cde60eaab08ac2ca130b16b15", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.al.com", "main_image": "http://imgick.al.com/home/bama-media/width620/img/sports_impact/photo/leonard-fournette-a402d3e76eb4e298.jpg", "site_section": "http://blog.al.com/sports_mobile_impact/atom.xml", "section_title": "Sports Mobile Impact", "url": "http://www.al.com/sports/index.ssf/2015/10/sec_football_by_the_numbers_to_20.html", "country": "US", "title": "SEC Football by the Numbers Top 10 for Week 5: Once-in-a-lifetime occurrence for Tide, Tigers? | AL.com", "performance_score": 0, "site": "al.com", "participants_count": 1, "title_full": "SEC Football by the Numbers Top 10 for Week 5: Once-in-a-lifetime occurrence for Tide, Tigers? | AL.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T03:00:00.000+03:00", "replies_count": 0, "uuid": "e8a9860bac1ea00cde60eaab08ac2ca130b16b15"}, "author": "Mark Inabinett | minabinett@al.com", "url": "http://www.al.com/sports/index.ssf/2015/10/sec_football_by_the_numbers_to_20.html", "ord_in_thread": 0, "title": "SEC Football by the Numbers Top 10 for Week 5: Once-in-a-lifetime occurrence for Tide, Tigers? | AL.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "0 Seasons in SEC football history have had standings showing Alabama and Auburn with 0-2 conference records. The SEC played its first football season in 1933. Auburn has an 0-2 league mark in 2015 after dropping conference contests to LSU and Mississippi State. Alabama enters its Saturday game against No. 8 Georgia with an 0-1 SEC record after a loss by Ole Miss.\n9 Consecutive losses have been suffered by Tennessee in games against SEC West teams. Tennessee will try to snap the streak --its longest against the West -- when it hosts Arkansas on Saturday. The Volunteers' opponents during the streak had a combined record of 59-3 at the time of the game. Arkansas enters the contest at 1-3 this season. The Volunteers haven't beaten a team from the Western Division since topping Ole Miss 52-14 on Nov. 13, 2010 – their most recent game against an unranked SEC West team before Saturday's contest. Arkansas enters the game having lost its past five games against SEC East opponents. After 10 straight games against ranked SEC teams, Arkansas will be playing an unranked conference opponent for the first time since facing Mississippi State on Nov. 23, 2013.\n9 Consecutive Alabama games have included a rushing TD scored by RB Derrick Henry. Henry is one game short of the Tide's school record of 10 consecutive games with a rushing TD set by Terry Davis across the 1971 and 1972 seasons. Since being kept out of the end zone during last year's game against LSU, Henry has run for 15 TDs.\n17 Consecutive Georgia games have featured at least one 100-yard rusher for the Bulldogs. Georgia has had a 100-yard ball-carrier in every game since the start of the 2014 season. Alabama, Georgia's opponent on Saturday, has allowed only 10 players to rush for 100 yards in a game since Nick Saban became the Tide's coach in 2007. Georgia RB Nick Chubb enters the game with a streak of 12 100-yard rushing games.\n50 Year reunion for the 1965 Missouri football team will be held this weekend in Columbia. The team posted an 8-2-1 record and defeated Florida 20-18 in the Sugar Bowl. The Gators' QB in that game was Steve Spurrier, who will be in town as South Carolina's coach when the Gamecocks play Missouri on Saturday. Despite playing for the losing team, Spurrier was voted the Sugar Bowl MVP. Missouri lead 20-0 in the fourth quarter, but Spurrier threw for 198 yards and two TDs and ran for another score in the final period to rally Florida. However, the Gators failed on three 2-point conversions.\nFOR MORE OF OUR COMPREHENSIVE COVERAGE OF THE SEC, GO TO OUR SEC PAGE\n50 Consecutive non-conference regular-season games have been won by LSU, the longest streak in the NCAA Division I-A/FBS era (since 1978). The Tigers haven't lost a non-conference regular-season game since opening 2002 with a 26-8 defeat by Virginia Tech. LSU hosts Eastern Michigan on Saturday night. The Tigers have won 43 consecutive non-conference home games. LSU hasn't lost in Tiger Stadium to a non-conference opponent since a 13-10 defeat by UAB in 2000.\n57 Years since the last time Ole Miss and Florida squared off as ranked teams. On Dec. 27, 1958, No. 11 Ole Miss defeated No. 14 Florida 7-3 in the Gator Bowl. On Saturday, No. 3 Ole Miss visits No. 25 Florida. The Rebels will try to extend their winning streak in Gainesville to three games.\n74 Years since Texas A&M had consecutive 5-0 records. The Aggies won their first five games last season and have won their first four games this season. A victory on Saturday against Mississippi State would give Texas A&M 5-0 starts in back-to-back seasons for the first time since 1940 and 1941. When Ole Miss plays Florida on Saturday, the Rebels will be going for their first back-to-back 5-0 starts since the 1961 and 1962 seasons.\n908 All-purpose yards have been piled up by San Jose State RB Tyler Ervin this season, the most in the nation. Ervin has 641 rushing yards, 137 receiving yards, 128 kickoff-return yards and 2 punt-return yards. Ervin also leads the nation in yards gained from scrimmage with 778. San Jose State visits Auburn on Saturday.\n1,493 Rushing yards have been given up by Eastern Michigan this season, the most in the nation. EMU's average of 373.25 rushing yards yielded per game and 18 rushing TDs allowed also are the worst figures in the nation. On Saturday, the Eagles visit LSU. LSU RB Leonard Fournette leads the nation with an average of 210.33 rushing yards per game this season.\nRELATED: SEC FOOTBALL BY THE NUMBERS: BEST FROM WEEK 4", "external_links": [], "published": "2015-10-03T03:00:00.000+03:00", "crawled": "2015-10-03T08:08:40.718+03:00", "highlightTitle": ""}