{"organizations": [], "uuid": "083445ac28b4ec2fc83216c3e0a999e3ad0417e4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.local12.com", "main_image": "http://www.local12.com//template/stories/2015/10/16/images/OTk5MjhhMjVhZDQ1.jpg", "site_section": "http://www.local12.com/sports/features/local-sports//rss.xml", "section_title": "wkrc LOCAL Sports", "url": "http://www.local12.com/sports/features/local-sports/stories/A-young-man-39-s-long-journey-is-just-the-beginning-220191.shtml", "country": "US", "title": "A young man's long journey is just the beginning", "performance_score": 0, "site": "local12.com", "participants_count": 0, "title_full": "A young man's long journey is just the beginning", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T00:11:00.000+03:00", "replies_count": 0, "uuid": "083445ac28b4ec2fc83216c3e0a999e3ad0417e4"}, "author": "", "url": "http://www.local12.com/sports/features/local-sports/stories/A-young-man-39-s-long-journey-is-just-the-beginning-220191.shtml", "ord_in_thread": 0, "title": "A young man's long journey is just the beginning", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A young man's long journey is just the beginning \nUpdated: Fri, Oct 16 2015, 10:39 PM \nCINCINNATI (Mike Berk) -- When people watch a CHCA football game, one player clearly stands out; he's a six-foot, seven-inch physical specimen named \"Prince.” The young man from Nigeria is quickly becoming royalty on the Eagles' campus. He started out as a basketball player until a football coach got one look at him. They put him on the field, threw some passes and he inhaled the ball with one hand. He learned the ins and outs as a water boy until he was ready to play. Now, rather than carrying water, Prince is carrying the weight of his family's future on his extremely broad shoulders. As a young boy in Nigeria, Prince Michael used to look up at the sky and dream.He said, “Whenever I see the plane fly I was like, 'One day I'll be in that plane going to America.’”Prince made it all the way to Cincinnati via Wisconsin. He left the poverty and despair of his homeland. The father he left behind told him it was his calling in life. When he was gazing at the sky over Africa his mother, as only a mother can, knew exactly what he was thinking. So his arrival in the United States meant keeping a promise to her. “It was hard for me, seeing my mom go under 6 feet,” said Prince. Prince found his mother dead on the floor of their home in Nigeria. Her cause of death was heart failure, there was no further explanation given. But retaliation is not uncommon in that country when word leaks of a family member trying to leave. But Prince did not waiver. He pursued his dreams, came to America and soon after arriving, tragedy struck again.“My brothers told me not to come back. So I was like, ‘Okay, I won't come back.’”Prince didn't go back to Nigeria after his father died. The cause of his death was also somewhat hazy. Prince likes to say, “God gives, and he takes away.”Soon after taking his father God gave th young man a new set of parents here in Cincinnati. Prince Michael is now Prince Sammons; having legally changed his name after being adopted by Brandon and Betsy Sammons of Clinton Massie. Brandon is a faculty member and assistant coach at CHCA where Prince has become a 4-star recruit at defensive end. His grades are just as good as his football. With a 3.4 GPA he's now taking calls from all of the big boys; Auburn, Oregon, Ohio State. Prince didn't even know Nick Saban when the Alabama coach called! Prince shared, “This is just my first year playing football. How am I supposed to know him?”But everyone knows the gentle giant and the young man named Prince became CHCA's 2015 King… Homecoming King! Prince said, “I gotta take care of business in school, out of school, be a good kid, be a role model to others growing up. Some say, ‘I want to be like Prince!' So I have to be example to them and that's what I'm doing now.”That would warm the heart of any parent; the two God took from Prince and the two God gave to him. Prince has made an \"official\" visit to Oregon. Even though he's from Nigeria he told Local 12 News Oregon was too far away! So the ducks might be out of the mix, but Ohio State, Alabama and many others are under consideration.Prince plans to use the opportunities to help his family back in Nigeria. Prince and the CHCA Eagles play Friday night, Oct. 16, against North College Hill. \n\nFollow us on Twitter @Local12 and LIKE us on Facebook for updates! Related Stories", "external_links": [], "published": "2015-10-17T00:11:00.000+03:00", "crawled": "2015-10-17T07:15:48.141+03:00", "highlightTitle": ""}