{"organizations": [], "uuid": "8cc6b9e9684269eee8677f4ed5c6a6799f951e2d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.montgomeryadvertiser.com", "main_image": "http://www.gannett-cdn.com/-mm-/5e00faddf63339fe8b62dfbc5d1d159365052e74/c=213-78-3768-2087&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/10/20/USATODAY/USATODAY/635809078742466678-USP-NFL-Houston-Texans-at-Jacksonville-Jaguars.jpg", "site_section": "http://rssfeeds.montgomeryadvertiser.com/montgomery/alabamastatesports", "section_title": "Montgomery - Alabama State Sports", "url": "http://www.montgomeryadvertiser.com/videos/sports/college/alabama-state/2015/10/13/73908274/", "country": "US", "title": "NFL hot seat coaching index: Jaguars' Gus Bradley stacking losses", "performance_score": 0, "site": "montgomeryadvertiser.com", "participants_count": 0, "title_full": "NFL hot seat coaching index: Jaguars' Gus Bradley stacking losses", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T01:34:00.000+03:00", "replies_count": 0, "uuid": "8cc6b9e9684269eee8677f4ed5c6a6799f951e2d"}, "author": "", "url": "http://www.montgomeryadvertiser.com/videos/sports/college/alabama-state/2015/10/13/73908274/", "ord_in_thread": 0, "title": "NFL hot seat coaching index: Jaguars' Gus Bradley stacking losses", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NFL hot seat coaching index: Jaguars' Gus Bradley stacking losses Jaguars' Bradley looks to be in trouble if he keeps piling up losses. Post to Facebook NFL hot seat coaching index: Jaguars' Gus Bradley stacking losses Jaguars' Bradley looks to be in trouble if he keeps piling up losses. Check out this story on USATODAY.com: http://usat.ly/1LIYueu Cancel Send A link has been sent to your friend's email address. Posted! A link has been posted to your Facebook feed. 2 To find out more about Facebook commenting please read the Conversation Guidelines and FAQs NFL hot seat coaching index: Jaguars' Gus Bradley stacking losses Nate Davis , USA TODAY Sports 6:34 p.m. EDT October 20, 2015 Gus Bradley's Jaguars have dropped four in a row. (Photo: Reinhold Matay, USA TODAY Sports) 78 CONNECT 75 TWEET LINKEDIN 2 COMMENT EMAIL MORE \nAs the temperatures cool, the NFL coaching hot seat is warming up. Here is our weekly ranking of the coaches in most danger of losing their jobs when the season ends: \n1. Gus Bradley, Jacksonville Jaguars : We love your enthusiasm, Gus, but 8-30 ain't gonna cut it ... even in Jacksonville. \nLast week: 4 \n2. Andy Reid, Kansas City Chiefs: Over the last four-plus seasons, Reid's teams have gone 33-38 and haven't won a playoff game. \nLast week: 2 \n3. Jim Caldwell, Detroit Lions: Temporarily benching Matthew Stafford and using fake punts? Looks like Caldwell may be starting to push the right buttons with his team finally finding the win column. \nLast week: 1 \n4. Chuck Pagano, Indianapolis Colts: Your team finally played the Pats tough, but that gets overshadowed by that fake punt thing. Losing high stakes gambles means lowered chances you're back with Indy in 2016. \nLast week: 7 \n5. Jay Gruden, Washington Redskins: With Kirk Cousins plateauing, at best, and Andy Dalton making a quantum leap without him, Gruden's rep as a quarterback whisperer coming under further scrutiny. \nLast week: 6 \n6. Ken Whisenhunt, Tennessee Titans: He shouldn't have exposed Marcus Mariota to further injury. He should look in the mirror after leading the Titans to consecutive 1-4 starts. \nLast week: Not ranked \n7. Lovie Smith, Tampa Bay Buccaneers: The bye cools the hot seat. A matchup with Washington could bring further relief. \nLast week: 3 \nDropped out (for now): Chip Kelly, Philadelphia Eagles \nFollow Nate Davis on Twitter @ByNateDavis \nPHOTOS: Week 6 NFL action Posted! A link has been posted to your Facebook feed. Eagles running back DeMarco Murray (29) is fired up after his second-half touchdown against the Giants. Bill Streicher, USA TODAY Sports New England Patriots running back LeGarrette Blount (29) celebrates after scoring a touchdown against the Indianapolis Colts in the second half during the NFL game at Lucas Oil Stadium. Brian Spurlock, USA TODAY Sports Carolina Panthers running back Jonathan Stewart (28) celebrates with quarterback Cam Newton (1) after scoring a touchdown during the second half against the Seattle Seahawks at CenturyLink Field. Troy Wayrynen, USA TODAY Sports San Diego Chargers quarterback Philip Rivers (17) scrambles for short yards in the third quarter during the game against the Green Bay Packers at Lambeau Field. Benny Sieu, USA TODAY Sports San Francisco 49ers quarterback Colin Kaepernick (7) breaks a tackle during the third quarter of the game against the Baltimore Ravens at Levi's Stadium. Ed Szczepanski, USA TODAY Sports Seattle Seahawks Ricardo Lockette (83) catches a touchdown pass over Carolina Panthers safety Kurt Coleman (20) during the second half at CenturyLink Field. Troy Wayrynen, USA TODAY Sports Pittsburgh Steelers wide receiver Martavis Bryant (10) celebrates his touchdown with tight end eath Miller (83) and tackle Marcus Gilbert (77) against the Arizona Cardinals during the second half at Heinz Field. Jason Bridge, USA TODAY Sports San Francisco 49ers running back Jarryd Hayne (38) fumbles the ball on a punt return between Baltimore Ravens cornerback Anthony Levine (41) and defensive back Brynden Trawick (28) during the first quarter at Levi's Stadium. Kelley L Cox, USA TODAY Sports Seattle Seahawks running back Marshawn Lynch (24) is tackled by Carolina Panthers middle linebacker Luke Kuechly (59) during the first quarter at CenturyLink Field. Joe Nicholson, USA TODAY Sports Giants receiver Odell Beckham (13) dives into the end zone for a touchdown during the first quarter against the Eagles. Bill Streicher, USA TODAY Sports Minnesota Vikings linebacker Eric Kendricks (54) tackles Kansas City Chiefs running back Charcandrick West (35) in the second quarter at TCF Bank Stadium. Bruce Kluckhohn, USA TODAY Sports Kansas City Chiefs wide receiver Jeremy Maclin (19) catches a pass over Minnesota Vikings safety Andrew Sendejo (34) during the third quarter at TCF Bank Stadium. Brace Hemmelgarn, USA TODAY Sports Minnesota Vikings defensive end Brian Robison (96) celebrates his fumble recovery with linebacker Anthony Barr (55) during the fourth quarter against the Kansas City Chiefs at TCF Bank Stadium. Brace Hemmelgarn, USA TODAY Sports Green Bay Packers running back James Starks (44) rushes for a touchdown during the first quarter against the San Diego Chargers at Lambeau Field. Jeff Hanisch, USA TODAY Sports New York Jets wide receiver Brandon Marshall (15) celebrates with wide receiver Eric Decker (87) after scoring a touchdown against the Washington Redskins during the third quarter at MetLife Stadium. Brad Penner, USA TODAY Sports Arizona Cardinals wide receiver Larry Fitzgerald (11) catches a pass against Pittsburgh Steelers safety Robert Golden (21) during the second quarter at Heinz Field. Charles LeClaire, USA TODAY Sports Indianapolis Colts strong safety Mike Adams (29) celebrates with teammates after returning an interception for a touchdown against the New England Patriots in the first half during the NFL game at Lucas Oil Stadium. Brian Spurlock, USA TODAY Sports Buffalo Bills quarterback EJ Manuel (3) is tackled by Cincinnati Bengals defensive tackle Domata Peko (94) during the first half at Ralph Wilson Stadium. Kevin Hoffman, USA TODAY Sports Jacksonville Jaguars defensive end Chris Clemons (91) breaks up a pass to Houston Texans wide receiver DeAndre Hopkins (10) during the first quarter of a football game at EverBank Field. Reinhold Matay, USA TODAY Sports Seattle Seahawks tight end Jimmy Graham (88) reacts after making a reception for a first down against the Carolina Panthers during the second quarter at CenturyLink Field. Joe Nicholson, USA TODAY Sports Jacksonville Jaguars wide receiver Allen Robinson (15) is tackled by Houston Texans inside linebacker Benardrick McKinney (55) and cornerback Johnathan Joseph (24) during the second half of a football game at EverBank Field. Reinhold Matay, USA TODAY Sports Eagles receiver Josh Huff (13) tries to hurdle Giants defender Brandon Meriweather (22) after a first-half catch. Bill Streicher, USA TODAY Sports San Diego Chargers wide receiver Dontrelle Inman (15) catches a touchdown pass in the endzone against Green Bay Packers safety Micah Hyde (33) in the second quarter at Lambeau Field. Benny Sieu, USA TODAY Sports Cincinnati Bengals running back Jeremy Hill (32) runs the ball and jumps to avoid a tackle by Buffalo Bills outside linebacker Nigel Bradham (53) during the first half at Ralph Wilson Stadium. Timothy T. Ludwig, USA TODAY Sports Cleveland Browns running back Duke Johnson (29) is tackled by Denver Broncos cornerback Chris Harris (25) in the first quarter at FirstEnergy Stadium. James Lang, USA TODAY Sports Denver Broncos quarterback Peyton Manning (18) throws a pass during the first half against the Cleveland Browns at FirstEnergy Stadium. Ken Blaze, USA TODAY Sports Cleveland Browns tight end Gary Barnidge (82) catches a touchdown pass as Denver Broncos inside linebacker Danny Trevathan (59) defends in the third quarter at FirstEnergy Stadium. James Lang, USA TODAY Sports Minnesota Vikings linebacker Eric Kendricks (54) tackles Kansas City Chiefs running back Charcandrick West (35) in the second quarter at TCF Bank Stadium. Bruce Kluckhohn, USA TODAY Sports Detroit Lions running back Ameer Abdullah (21) carries the ball as Chicago Bears defensive end Will Sutton (93) defends during the first quarter at Ford Field. Tim Fuller, USA TODAY Sports Chicago Bears wide receiver Eddie Royal (19) carries the ball during the first quarter against the Detroit Lions at Ford Field. Tim Fuller, USA TODAY Sports Miami Dolphins receiver Jarvis Landry (14) celebrates after scoring a touchdown during the first half against the Tennessee Titans at Nissan Stadium. Christopher Hanewinckel, USA TODAY Sports Tennessee Titans running back Dexter McCluster (22) leaps to avoid a tackle against the Miami Dolphins during the first half at Nissan Stadium. Jim Brown, USA TODAY Sports New York Jets wide receiver Eric Decker (87) carries the ball during the first quarter against the Washington Redskins at MetLife Stadium. Vincent Carchietta, USA TODAY Sports New York Jets running back Chris Ivory (33) celebrates with teammates after scoring a touchdown in the first quarter against the Washington Redskins at MetLife Stadium. Vincent Carchietta, USA TODAY Sports New Orleans Saints outside linebacker Kasim Edebali (91) and defensive end Cameron Jordan (94) celebrate after a sack on Atlanta Falcons quarterback Matt Ryan (not pictured) during the first half of a game at the Mercedes-Benz Superdome. Derick E. Hingle,USA TODAY Sports Atlanta Falcons running back Devonta Freeman (24) is tackled by New Orleans Saints defensive end Cameron Jordan (94) in the second half of their game at the Mercedes-Benz Superdome. Chuck Cook, USA TODAY Sports Atlanta Falcons running back Devonta Freeman (24) runs for a touchdown past New Orleans Saints free safety Jairus Byrd (31) during the fourth quarter of a game at the Mercedes-Benz Superdome. Derick E. Hingle, USA TODAY Sports New Orleans Saints cornerback Delvin Breaux (40) breaks up a pass intended for Atlanta Falcons wide receiver Julio Jones (11) in the second quarter of their game at the Mercedes-Benz Superdome. Chuck Cook, USA TODAY Sports Atlanta Falcons wide receiver Roddy White (84) celebrates with wide receiver Julio Jones (11) after his touchdown catch in the second quarter against the New Orleans Saints of their game at the Mercedes-Benz Superdome. Chuck Cook, USA TODAY Sports Atlanta Falcons tight end Levine Toilolo (80) dumps New Orleans Saints middle linebacker Stephone Anthony (50) after a catch in the second quarter of their game at the Mercedes-Benz Superdome. Chuck Cook, USA TODAY Sports New Orleans Saints outside linebacker Kasim Edebali (91) sacks Atlanta Falcons quarterback Matt Ryan (2) during the first quarter of a game at the Mercedes-Benz Superdome. Derick E. Hingle, USA TODAY Sports Fullscreen New Orleans Saints linebacker Michael Mauti (56) celebrates with teammates defensive tackle Kevin Williams (93) and returner Marcus Murphy (23) after recovering a blocked punt for a touchdown against the Atlanta Falcons during the first quarter of a game at the Mercedes-Benz Superdome. Derick E. Hingle, USA TODAY Sports New Orleans Saints linebacker Michael Mauti (56) celebrates after blocking a punt and recovering it for a touchdown against the Atlanta Falcons during the first quarter of a game at the Mercedes-Benz Superdome. Derick E. Hingle, USA TODAY Sports New Orleans Saints cornerback Brandon Browner (39) and strong safety Kenny Vaccaro (32) and defensive end Bobby Richardson (78) stop Atlanta Falcons running back Devonta Freeman (24) during the first quarter of a game at the Mercedes-Benz Superdome. Derick E. Hingle, USA TODAY Sports Atlanta Falcons quarterback Matt Ryan (2) throws as New Orleans Saints defensive end Cameron Jordan (94) pressures during the first quarter of a game at the Mercedes-Benz Superdome. Derick E. Hingle, USA TODAY Sport New Orleans Saints wide receiver Willie Snead (83) runs after a catch while defended by Atlanta Falcons cornerback Robert Alford (23) in the first quarter of their game at the Mercedes-Benz Superdome. Chuck Cook, USA TODAY Sports Like this topic? You may also like these photo galleries: Replay", "external_links": [], "published": "2015-10-21T01:34:00.000+03:00", "crawled": "2015-10-21T03:42:38.614+03:00", "highlightTitle": ""}