{"organizations": [], "uuid": "38db0607f6c0987f5d06e828ce9c1ce905c5d148", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.echo-pilot.com", "main_image": "http://www.echo-pilot.com/storyimage/ZZ/20151007/SHAREABLE/151009920/AR/0/AR-151009920.jpg", "site_section": "http://www.echo-pilot.com/sports?template=rss&mime=xml", "section_title": "Sports - Echo Pilot - Greencastle, PA", "url": "http://www.echo-pilot.com/article/ZZ/20151007/SHAREABLE/151009920/2000/NEWS?rssfeed=true", "country": "US", "title": "Everything you need to know about the fantasy sports cheating scandal", "performance_score": 0, "site": "echo-pilot.com", "participants_count": 1, "title_full": "Everything you need to know about the fantasy sports cheating scandal", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T20:30:00.000+03:00", "replies_count": 0, "uuid": "38db0607f6c0987f5d06e828ce9c1ce905c5d148"}, "author": "Chris Kudialis, reviewjournal.com", "url": "http://www.echo-pilot.com/article/ZZ/20151007/SHAREABLE/151009920/2000/NEWS?rssfeed=true", "ord_in_thread": 0, "title": "Everything you need to know about the fantasy sports cheating scandal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Everything you need to know about the fantasy sports cheating scandal Comment Posted Oct. 7, 2015 at 12:30 PM By Chris Kudialis, reviewjournal.com Posted Oct. 7, 2015 at 12:30 PM Last week, a manager from daily fantasy sports website DraftKings admitted he accessed insider information on NFL fantasy teams, then won $350,000 playing fantasy football on rival site FanDuel. The story, broken by the New York Times, caused national outrage against the relatively new and largely unregulated industry, prompting the two rival companies to \"investigate\" the matter. But the internal investigations found DraftKings written content manager Ethan Haskell guilty of no wrongdoing. The companies claimed Monday that Haskell received DraftKings site information on website player usage 40 minutes after the first waves of NFL Week 3 games started on Sep. 27, according to a release. Since fantasy teams are locked when the games begin, they said, Haskell wouldn't have been able to rig his lineup that day. \"Nothing is more important to DraftKings and FanDuel than the integrity of the games we offer to our customers,\" the release said. \"Employees with access to this data are vigorously monitored by internal fraud controls teams, and we have no evidence anyone misused it.\" Regardless of whether Haskell cheated or not, there's still an amount of good judgement, and luck, that needed to work in his favor. With access to DraftKings data, Haskell saw the quantity of site users picking a select group of NFL players. It would make picking his lineup on FanDuel significantly easier, because the two sites have about the same \"price\" for a given player under an imaginary \"salary cap\" each week. The challenge for Haskell, and the roughly two million daily fantasy users that use FanDuel and DraftKings, is balancing high-performing players with less expensive, high-potential players that won't be chosen by as many other users. If Haskell saw that Cincinnati Bengals quarterback Andy Dalton was owned by a relatively small percent of users in Week 3, Haskell might have been motivated to use Dalton (which he did, and Dalton passed for 383 yards and three touchdowns). But just having site users' information wouldn't guarantee Haskell's success. His quarterback still had to play well, which isn't guaranteed. Haskell just may have won on judgement and good luck that weekend. But he has also had a wave of incredible recent success betting on baseball, according to a report from Larry Brown Sports. The DraftKings employee scored three first-place finishes in the month of August on FanDuel's Major League Baseball daily fantasy games, the report showed, and had a total of eight top-10 finishes. Haskell took home a cash prize on 20 of the month's 31 days, the report said. On 10 of those days, Haskell earned money in at least two separate daily fantasy competitions, and on two August days, won cash in at least three games. Page 2 of 2 - On Aug. 5, Haskell placed in the top-10 of three different contests offering a combined total of $260,000, and also finished in the top-100 of a $150,000 payout game. Haskell, who has played in daily fantasy games since 2013, has recorded 95 of his top 100 daily earnings since he started working for DraftKings in late 2014, the report said. Contact Chris Kudialis at ckudialis@reviewjournal.com or 702-380-4593. Find him on Twitter: @kudialisrj By Chris Kudialis, reviewjournal.com", "external_links": [], "published": "2015-10-07T20:30:00.000+03:00", "crawled": "2015-10-08T06:58:38.131+03:00", "highlightTitle": ""}