{"organizations": ["Bayfield High School", "Colorado High School Activities Association", "Representing Durango High School", "Bayfield", "United States Professional Tennis Association"], "uuid": "9da34d566089176579c3e9c7abbbb0374a589664", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.durangoherald.com", "main_image": "http://durangoherald.com/storyimage/DU/20151012/SPORTS03/151019895/AR/0/AR-151019895.jpg", "site_section": "http://www.durangoherald.com/section/sports?template=RSS&mime=xml", "section_title": "Sports", "url": "http://www.durangoherald.com/article/20151012/SPORTS03/151019895/-1/sports&source=RSS", "country": "US", "title": "Prep Spotlight: Bayfield’s Fred Edwards heading to state tennis to represent Durango once more", "performance_score": 0, "site": "durangoherald.com", "participants_count": 0, "title_full": "Prep Spotlight: Bayfield’s Fred Edwards heading to state tennis to represent Durango once more", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T06:08:00.000+03:00", "replies_count": 0, "uuid": "9da34d566089176579c3e9c7abbbb0374a589664"}, "author": "", "url": "http://www.durangoherald.com/article/20151012/SPORTS03/151019895/-1/sports&source=RSS", "ord_in_thread": 0, "title": "Prep Spotlight: Bayfield’s Fred Edwards heading to state tennis to represent Durango once more", "locations": ["Durango"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Vivian", "Paul", "Weisfeldt", "Shaun", "Fred Edwards", "Fred", "Dave Weisfeldt", "Mavis", "Vivian Edwards", "Edwards"], "text": "With impeccable court vision, Fred Edwards dominated the competition all season. Shaun Stanley/Durango Herald With impeccable court vision, Fred Edwards dominated the competition all season. B ayfield’s Fred Edwards is headed to the Colorado High School Activities Association Class 4A Boys Tennis State Championships for the third time in the three years he’s been a high school student. Representing Durango High School because Bayfield doesn’t have a team, Edwards breezed through the Class 4A Region 8 tournament in the No. 1 singles spot with a 6-0, 6-1 semifinal win and a 6-1, 6-3 final to punch his ticket back to Pueblo. “I was just going for it. I feel like I know my game a bit better now than I did last year,” said Edwards, son of Paul and Vivian Edwards. “I don’t like to play conservative and dink it around. I like to hit it hard, so I might make a few more mistakes than some people but I definitely hit more winners than they do. I just want to get a win there. Any win at state is good.” Edwards has a lot on his side this time around. He has two years of experience on the big stage. As a Western Slope player, he comes in slightly under the radar as his opponents haven’t seen much of him. He also has some serious tennis genes. Fred’s mother, Vivian, is a United States Professional Tennis Association certified professional. His older sister, Eva-Lou, was quite the tennis player before she became a local track and field legend when she won back-to-back state titles in the 3,200-meter run for Bayfield High School. His younger sister Mavis is already making a name for herself on the tennis courts at the elementary school level. “That’s a heck of a talented family, and that competitiveness combined with the natural talent he has gives him a huge leg up,” Durango head coach Dave Weisfeldt said. “He always has someone to practice with and they can give him instant feedback because they know the game so well. He has so many weapons that he can play any style. When you add in the maturity, you get someone who has acquired all the tools to be successful.” Successful he has been. Edwards lost one match this year and that came at the hands of Class 5A Grand Junction’s No. 1 player. A year ago, Edwards was a last-minute replacement at the state tournament. He made the trip to Pueblo the night before play began, but he made his presence felt by winning his opening match. This year, Edwards left no question he would be at state, dominating his opponents all season. “It’s rare that we see this kind of player,” Weisfeldt said. “Anything can happen in these tournaments.”", "external_links": [], "published": "2015-10-13T06:08:00.000+03:00", "crawled": "2015-10-13T11:20:45.697+03:00", "highlightTitle": ""}