{"organizations": [], "uuid": "b7883a3b7a6edb007138088365535be12a578709", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.abqjournal.com", "main_image": "http://main.abqjournal.netdna-cdn.com/wp-content/uploads/2015/10/c01_jd_18oct_lobo1-392x400.jpg", "site_section": "http://www.abqjournal.com/", "section_title": "Albuquerque and New Mexico News, Sports, Business and more | Albuquerque Journal News", "url": "http://www.abqjournal.com/661530/sports/lobos-rally-to-edge-hawaii-28-27.html", "country": "US", "title": "Lobos rally to edge Hawaii 28-27", "performance_score": 0, "site": "abqjournal.com", "participants_count": 3, "title_full": "Lobos rally to edge Hawaii 28-27 | Albuquerque Journal News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T04:39:00.000+03:00", "replies_count": 2, "uuid": "b7883a3b7a6edb007138088365535be12a578709"}, "author": "Rick Wright / Journal Staff Writer", "url": "http://www.abqjournal.com/661530/sports/lobos-rally-to-edge-hawaii-28-27.html", "ord_in_thread": 0, "title": "Lobos rally to edge Hawaii 28-27", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "UNM’s Carlos Wiggins (24) and Jhurell Pressley (6) celebrate after the Lobos rallied in the fourth quarter to defeat Hawaii at University Stadium. (Jim Thompson/Journal)\nSometimes in life and sports, we get lucky. Sometimes we make our own luck.\nThe New Mexico Lobos experienced the best of both those worlds Saturday night.\nAfter Hawaii’s Rigoberto Sanchez missed a 22-yard field goal that likely would have spelled defeat for UNM, backup quarterback Austin Apodaca hit Dameon Gamblin for the game-winning touchdown with 55 seconds left as the Lobos beat the Rainbow Warriors 28-27 at University Stadium.\nThe homecoming victory in front of a crowd announced at 20,541 gives UNM a 4-3 record. The Lobos are 2-1 in Mountain West Conference play.\nHawaii dropped to 2-5 and 0-3.\nIt was a happy, relieved but not at all satisfied coach Bob Davie who addressed the news media after the game.\nThe Lobos made things difficult for themselves with fumbles, penalties and poor first-half defense before Apodaca drove the offense 80 yards — all in the air — in 1 minute, 19 seconds for the winning score.\nJunior safety Lee Crosby’s second interception of the game with three seconds left clinched the comeback victory.\n“My first thought right now is, we have to get better,” Davie said after the game. “We’re gonna enjoy this one tonight, but we have to get better.\n“… With all that said, what a great win.”\nApodaca, a junior transfer from Washington State by way of Mesa (Ariz.) Community College, might well enjoy this victory more than anyone. Replacing starter Lamar Jordan to operate UNM’s 2-minute drill, he was 6-of-10 for 70 yards on the game-winning drive, converting four third downs en route.\n“We prepare for that every day, and we were prepared for it tonight,” Apodaca said. “And we got the win out of it.”\nThe Lobos trailed 24-14 at halftime, in large part because of fumbles by Jordan and slot receiver Chris Davis and despite a 100-yard touchdown kick return by senior Carlos Wiggins. It was Wiggins’ fifth kick-return TD of his career, extending his UNM and Mountain West records.\nThe Lobos cut the Hawaii lead to 24-21 after Crosby’s first interception led to an 11-yard touchdown pass from Jordan to running back David Anaya.\nBut a UNM failure to convert a fourth down near midfield, compounded by a pass interference penalty against Lobo cornerback Cranston Jones, led to a 47-yard Sanchez field goal that made the score 27-21 with 12:59 left in the game.\nHawaii’s Paul Harris (29) is dragged down by a host of New Mexico defenders during the first half Saturday night. (Jim Thompson/Journal)\nThe Lobos couldn’t move on their next two possessions, and the Rainbow Warriors appeared poised to put the game away when a 14-play, 6-minute, 23-second UH drive set up Sanchez with the 22-yarder with barely more than 2 minutes to play.\nBut Sanchez — who had hit a 49-yarder in the first half — pulled the kick wide of the left upright.\nApodaca took it from there.\nA third-and-10 pass to Wiggins was good for 12 yards to the Hawaii 28. Then came the 28-yarder to Gamblin down the middle.\n“I was originally looking for Carlos on the outside,” Apodaca said. “It was kind of a double-move play call, and the corner didn’t really bite that much. … I looked on the inside, and Gambo ran a great route.”\nIn the spring and again in fall camp, the Lobos worked tirelessly on the passing game — only to slip back into their old triple-option, run-first identity when the season started.\nAll that work on the pass, Davie said, came home to roost on that final drive.\nUNM’s Jhurell Pressley breaks away from several Hawaii defenders on his way to scoring a first-half touchdown. (Jim Thompson/Journal)\n“All the time we spent that you really haven’t seen the results of in the passing game paid off,” Davie said. “We won the football game because of the passing game.”\nDavie had recruited Apodaca, a record-setting passer at Silver Creek High School in Longmont, Colo., back in 2012. But Apodaca opted for Washington State before transferring to Mesa and then to UNM — only to be beaten out for the starting job this fall by Jordan, a better runner.\nApodaca was ready when called upon Saturday night.\n“I definitely looked on it as an opportunity,” he said. “I thought we kept our composure the whole drive.\n“… I had no doubt from the first play in the huddle that we were gonna go down and score.”\nThe game was as close on the stat sheet as on the scoreboard. Hawaii had 415 yards total offense, the Lobos 392. Both teams finished with 195 yards in the air, but UNM was outgained on the ground, 220-197.\nBox Score – Game 07 – New Mexico 28, Hawaii 27\n2015 UNM Season Statistics", "external_links": ["http://main.abqjournal.netdna-cdn.com/wp-content/uploads/2015/10/Box-Score-Game-07-New-Mexico-28-Hawaii-271.pdf", "http://main.abqjournal.netdna-cdn.com/wp-content/uploads/2015/10/c01_jd_18oct_lobo1-588x600.jpg", "http://main.abqjournal.netdna-cdn.com/wp-content/uploads/2015/10/2015-Season-Statistics.pdf", "http://main.abqjournal.netdna-cdn.com/wp-content/uploads/2015/10/c01_jd_18oct_lobo3-289x400.jpg", "http://main.abqjournal.netdna-cdn.com/wp-content/uploads/2015/10/c01_jd_18oct_lobo2-400x307.jpg"], "published": "2015-10-18T04:39:00.000+03:00", "crawled": "2015-10-18T13:31:30.705+03:00", "highlightTitle": ""}