{"organizations": [], "uuid": "97005958789584279179cc78e6c2d7df2e79b07e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sport.co.uk", "main_image": "http://images.sport.co.uk/150x150/b606e90c0d9c3b512ae8647297fb53c0.jpg", "site_section": "http://feeds.feedburner.com/SportcoukNewsRssFeed", "section_title": "General Sports News from Sports.co.uk", "url": "http://www.sport.co.uk/football/danny-welbeck-targets-new-year-return-for-arsenal/6930715/", "country": "JE", "title": "Danny Welbeck targets New Year return for Arsenal", "performance_score": 0, "site": "sport.co.uk", "participants_count": 0, "title_full": "Danny Welbeck targets New Year return for Arsenal", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T13:46:00.000+03:00", "replies_count": 0, "uuid": "97005958789584279179cc78e6c2d7df2e79b07e"}, "author": "", "url": "http://www.sport.co.uk/football/danny-welbeck-targets-new-year-return-for-arsenal/6930715/", "ord_in_thread": 0, "title": "Danny Welbeck targets New Year return for Arsenal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Danny Welbeck"], "text": "Danny Welbeck targets New Year return for Arsenal 13 Oct 2015 10:46:56 \ncomments \nDanny Welbeck is targeting a return to action in the new year as his recovery from injury steps up. \nThe Arsenal and England forward has not featured this season having undergone knee surgery in September - just days after the transfer window closed. \nGunners boss Arsene Wenger had to defend himself against claims he knew the former Manchester United man needed an operation but still refused to sign a new striker - saying he had no idea that surgery was required. \nArsenal currently sit second in the Premier League having beaten United 3-0 before the international break - with Welbeck also missing England securing safe passage to next summer's European Championships. \nBut now the 24-year-old has revealed his leg brace has been removed and he wants to be back in contention in early 2016. \n\"It's difficult to put an exact date on it, around the New Year,\" he told Sport 360. \n\"After I had the operation, I was in a leg brace for about four weeks - which wasn't easy. I had to do a lot of machine work, about six hours a day. \n\"Sleeping in a leg brace isn't good. At night it's not comfortable, it's the first time I've slept on my back in years. \n\"It's good to finally be out of the brace now and walking. It feels like I'm getting that little bit closer to getting back out on the pitch.\" \nShould Welbeck be fit and available, the chances are he will be included in Roy Hodgson's England squad for France 2016 having scored six goals in the five qualification games he featured in. \nBut for now Welbeck is instead focusing on getting back to playing for Arsenal before he starts contemplating another major international competition. \n\"I am not looking ahead to the Euros at the moment,\" he added. \n\"I need to get back for Arsenal first, then see what happens. It is never good to get injured at any point. It is frustrating. \n\"I missed the back end of last season, then came back into pre-season training and you go through it all again with the rehab. It is frustrating. \n\"But it is something which is part and parcel of the game. It is something I have to deal with.\" Related Sport News", "external_links": [], "published": "2015-10-13T13:46:00.000+03:00", "crawled": "2015-10-13T20:06:16.216+03:00", "highlightTitle": ""}