{"organizations": [], "uuid": "2fb95659f89da8b641251b93446432d044e7994d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.clickorlando.com", "main_image": "http://www.clickorlando.com/image/view/-/34701530/highRes/1/-/maxh/640/maxw/640/-/7mfqhoz/-/Pings-Things-graphic.jpg", "site_section": "http://www.clickorlando.com/sports?format=rss_2.0&view=feed", "section_title": "Sports", "url": "http://www.clickorlando.com/sports/news-6-presents-pings-things/35601458", "country": "US", "title": "News 6 presents Ping's Things", "performance_score": 0, "site": "clickorlando.com", "participants_count": 0, "title_full": "News 6 presents Ping's Things", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T22:44:00.000+03:00", "replies_count": 0, "uuid": "2fb95659f89da8b641251b93446432d044e7994d"}, "author": "", "url": "http://www.clickorlando.com/sports/news-6-presents-pings-things/35601458", "ord_in_thread": 0, "title": "News 6 presents Ping's Things", "locations": ["Orlando City Tweet"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["David Pingalore", "Ping"], "text": "News 6 presents Ping's Things Sports Director David Pingalore discusses college football, Orlando City Tweet \nGator Nation, I am telling you right now, as much as you want to jump up and down for starting the season 4-0, take a deep breath! Ole Miss is coming to the Swamp on Saturday, and as good as the Gators looked in the comeback last weekend against Tennessee, they looked average at best. 4-0 looks a heck of a lot better than last year at this time. Ole Miss is a pretty good club, and they're loaded at every position. But never say never, with the cardiac kids. \nUCF will travel to Tulane on Saturday for a noon kickoff. Can they please win? I hear from many of you about what on earth has happened with the season. I say, FIU, Furman, Stanford and South Carolina were just better. But as UCF head coach George O'Leary would say, this weekend starts AAC play. His goal from Day 1 was to win the ?conference title -- and the Knights still may! Keep the faith. I will not make another prediction about the Knights because I said before the season that they would win 11 games! Ugh! \nYou want to see some action Saturday night? Orlando City will be at home against Montreal. ALERT! ALERT! It's a must-win game for Kaka and friends. Montreal leads the way for the sixth and final playoff spot. The Lions are 4 points behind them. A win equals 3 points. You get the point. With three games left, including Saturday, a loss would pretty much do them in. Purple Pride will prevail. \nPing's Things likes UCF to finally win its first game of the season. Can they really lose to Tulane? Nope. 15-12 final. Knights win! Gators upset Ole Miss by a field goal: 20-17. The FSU 'Noles are at Wake Forest: 45-12 FSU. It's a trifecta in the state! And Orlando City will be an easy winner against Montreal, 3-nil. \nCopyright 2015 by ClickOrlando.com. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-10-01T22:44:00.000+03:00", "crawled": "2015-10-02T04:34:47.354+03:00", "highlightTitle": ""}