{"organizations": ["Cubs", "Dodgers", "Cubs Tweet Frank Franklin", "Chicago Cubs", "Mets"], "uuid": "12c71f7b7907b88e907f0a23c075180052fde552", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.durangoherald.com", "main_image": "http://durangoherald.com/storyimage/DU/20151018/SPORTS01/151019623/AR/0/AR-151019623.jpg", "site_section": "http://www.durangoherald.com/section/sports?template=RSS&mime=xml", "section_title": "Sports", "url": "http://www.durangoherald.com/article/20151018/SPORTS01/151019623/-1/sports&source=RSS", "country": "US", "title": "Mets take 2-0 lead over Cubs", "performance_score": 0, "site": "durangoherald.com", "participants_count": 0, "title_full": "Mets take 2-0 lead over Cubs", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T07:00:00.000+03:00", "replies_count": 0, "uuid": "12c71f7b7907b88e907f0a23c075180052fde552"}, "author": "", "url": "http://www.durangoherald.com/article/20151018/SPORTS01/151019623/-1/sports&source=RSS", "ord_in_thread": 0, "title": "Mets take 2-0 lead over Cubs", "locations": ["New York", "Citi Field", "Wrigley Field", "Chicago"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Granderson", "Clayton Kershaw", "Syndergaard", "Lester", "Chris Coghlan", "Anthony Rizzo", "Jon Lester", "David Wright", "Frank Franklin", "Daniel Murphy", "Murphy", "Thor", "Arrieta", "Yoenis Cespedes", "Matt Harvey", "Zack Greinke", "Wright", "Kyle Hendricks", "Noah Syndergaard", "Odin", "Kris Byrant", "Dexter Fowler", "Greinke", "Jeurys Familia", "Jacob", "Jon Niese", "Curtis Granderson", "Jake Arrieta", "Kershaw"], "text": "Tweet Frank Franklin II/Associated Press Curtis Granderson soared above the wall to rob the Chicago Cubs’ Chris Coghlan of a home run in Game 2 of the National League Championship Series, helping the Mets to a 2-0 series lead. Frank Franklin II/Associated Press Curtis Granderson soared above the wall to rob the Chicago Cubs’ Chris Coghlan of a home run in Game 2 of the National League Championship Series, helping the Mets to a 2-0 series lead. N EW YORK Daniel Murphy homered off yet another ace. Noah Syndergaard turned in one more outstanding outing from the Mets’ collection of studly young starters. Power, pitching, plus some dazzling defense are falling into place for New York. The Mets breezed past the Chicago Cubs 4-1 Sunday night for a 2-0 lead in a surprisingly one-sided NL Championship Series. Jake Arrieta, baseball’s most dominant pitcher since the All-Star break, had not even settled in when Murphy homered for the fourth consecutive game, a two-run drive just inside the right-field pole in a three-run first inning. Given the quick lead on a chilly night, Syndergaard kept the bats of Chicago’s young sluggers on ice with shutout ball into the sixth inning. Curtis Granderson robbed Chris Coghlan of a likely home run with a leaping grab at the center-field wall, swiped a pair of bases and scored two runs for the Mets. After beating Clayton Kershaw, Zack Greinke, Jon Lester and Arrieta, the Mets are two wins from reaching their first World Series since 2000. New York starts NL Rookie of the Year Jacob deGrom when the series resumes Tuesday night at Wrigley Field. Chicago goes with Kyle Hendricks, part of the less-than-imposing back end of its rotation. If the long-downtrodden Cubs are to reach the World Series for the first time since 1945, they must first force the best-of-seven NLCS back to Citi Field next weekend. After homering off Kershaw, Greinke and Lester, Murphy added his fifth home run of the postseason, giving him eight RBIs in seven games. Long, blond locks flowing out the back of his cap, Syndergaard seems to be taking on a bit of the cockiness of Game 1 winner Matt Harvey. He gained the nickname Thor – the Norse god known for his fierce storms – after he tweeted a photo of himself in costume doing squats on Halloween two years ago. After the Mets beat the Dodgers in the Division Series, the rookie tweeted, “Our enemy has been vanquished Odin is pleased”– a reference to Thor’s father. And ahead of his start against the Cubs, Syndergaard changed the photo atop his Twitter page to a shot featuring lightning striking Chicago’s famous Willis Tower. Having made the first relief appearance of his big league career in Game 5 against the Dodgers, Syndergaard came out throwing 99 mph darts until the the sixth, when Dexter Fowler singled and scored on Kris Byrant’s two-out double off the left-field wall. Jon Niese came in and struck out Anthony Rizzo to end the threat. Syndergaard allowed three hits, struck out nine and walked one. Jeurys Familia’s fourth postseason save finished a five-pitcher five-hitter and sent the Cubs to consecutive losses for the first time since they dropped three in a row from Sept. 23-26. It was 45 degrees at game time with an 18 mph northwest wind – some players wore balaclavas that covered their faces, including Mets outfielder Yoenis Cespedes, who played on his 30th birthday. Chicago skipped batting practice because of the weather, but Arrieta took the mound in short sleeves. He had not given up a first-inning run in 25 consecutive starts since May 29. With his velocity down slightly, he found himself trailing after nine pitches and down 3-0 after 13. Granderson singled through the shift into right field for his ninth hit in 22 postseason at-bats. David Wright, in a 1-for-19 playoff slide, drove a fastball on a hop off the center-field wall with Granderson running on the pitch. Murphy hit an 0-1 pitch about 10 feet to the foul side of the right-field pole, then reached down for a shin-high curveball and with a one-handed swing sent it just inside the pole. Murphy raised his right fist in triumph while rounding first base and took a curtain call after a prolonged ovation. Granderson made his dashing defensive play in the second, leaping to get his glove to the top of the 8-foot wall just to the right of straightaway center. Granderson’s steals then helped the Mets make it 4-0 in the third. He walked leading off and stole second as Wright struck out. Granderson swiped third, too, and came home when Yoenis Cespedes grounded to the shortstop hole for an infield single.", "external_links": [], "published": "2015-10-19T07:00:00.000+03:00", "crawled": "2015-10-19T16:54:54.837+03:00", "highlightTitle": ""}