{"organizations": ["Ocean Heintz", "Poughkeepsie", "Sullivan West", "Liberty", "Tri-Valley", "Monticello", "Roscoe-Downsville-Livingston Manor"], "uuid": "827578fffa7212d29b6421ac4d7da02a35e62c27", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.recordonline.com", "main_image": "http://www.recordonline.com/storyimage/TH/20151010/VARSITY/151019935/AR/0/AR-151019935.jpg", "site_section": "http://www.recordonline.com/sports?template=rss&mime=xml", "section_title": "Sports - recordonline.com", "url": "http://www.recordonline.com/article/20151010/VARSITY/151019935/101009/NEWS?rssfeed=true", "country": "US", "title": "Oct. 10 high school football roundup: Rondout's offense clicks behind QB Hikade", "performance_score": 0, "site": "recordonline.com", "participants_count": 0, "title_full": "Oct. 10 high school football roundup: Rondout's offense clicks behind QB Hikade", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T07:24:00.000+03:00", "replies_count": 0, "uuid": "827578fffa7212d29b6421ac4d7da02a35e62c27"}, "author": "", "url": "http://www.recordonline.com/article/20151010/VARSITY/151019935/101009/NEWS?rssfeed=true", "ord_in_thread": 0, "title": "Oct. 10 high school football roundup: Rondout's offense clicks behind QB Hikade", "locations": ["Poughkeepsie", "Chase Botsford", "Rondout Valley", "Middletown", "Livingston Manor", "Tri-Valley", "Faller Field", "Fallsburg", "Monticello", "Grahamsville", "Roscoe-Downsville-Livingston Manor"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Derrick Moffett", "Allan Ward", "Ranne", "Tom Stauch", "Donovan Hendrickson", "Justin Valentine", "Roy Penn-Cosentino", "Austin Melchick", "Clancy", "Botsford", "Morrison", "Andrew Koonz", "Shane Black", "Nick Hill", "Rondout", "Kevin Morgans", "Kelly Sherman", "Thomas Decker", "Kyle McCreery", "Joe Decker", "Collin Hauschild", "Fred Ahart", "Hill", "Heintz", "Grant Harman", "Austin Shaver", "Sullivan", "Nick Grossman", "Roscoe-Downsville-Livingston Manor", "Dan Clancy", "Jake Hikade", "Eldred", "Nick Skindzier", "Ben Hikade", "Shaver", "Alan Sipple"], "text": "Posted Oct. 10, 2015 at 7:50 PM Updated at 11:24 PM Posted Oct. 10, 2015 at 7:50 PM Updated at 11:24 PM » Social News Jake Hikade was 15-for-24 for 258 yards and two scores, and added 15 rushes for 53 yards and two touchdowns to lead host Rondout Valley to a 54-22 victory over Highland in a Class B Division II game in Accord on Saturday. Kelly Sherman had 17 carries for 171 yards and three scores and caught three passes for 32 yards, one for a touchdown. Andrew Koonz had five catches for 117 yards and a score. Ben Hikade returned an interception for a touchdown for the Ganders (3-3, 1-2 division). Highland (1-5, 0-3 division) was held to 108 total yards of offense. Liberty 55, Fallsburg 0 Roy Penn-Cosentino ran for 40 yards and one touchdown and also returned a kick 76 yards for a touchdown as Liberty won a Class C game at home. Raleigh Ranne rushed for 56 yards and two touchdowns on seven attempts and Kevin Morgans gained 63 yards on seven carries, scoring once. Shane Black caught two passes for 79 yards, both of which were touchdown catches. Joe Decker scored on a 20-yard run for Liberty (6-0, 4-0 Class C). Grant Harman completed 4-of-7 passes for 118 yards and the two touchdowns to Black. Black and Nick Skindzier intercepted one Fallsburg pass apiece. Fallsburg fell to 0-6 overall and is 0-3 in Class C. Liberty clinched the No. 1 seed in the upcoming Section 9 Class C playoffs. Sullivan West 34, Tri-Valley 6 Nick Grossman scored on runs of 3 and 40 yards and also caught a 70-yard touchdown pass in a Class C win in Grahamsville. Austin Melchick ran 18 times for 112 yards and two touchdowns, scoring on runs of 54 and 1 yards, respectively. Collin Hauschild passed for 82 yards and gained 72 rushing yards on nine attempts for Sullivan West (2-4, 2-2 Class C). Defensively, Tom Stauch made nine tackles, including 2.5 for losses. Alan Sipple and Derrick Moffett had one sack apiece. Thomas Decker scored on a 6-yard pass from Chase Botsford for Tri-Valley (1-5, 0-4 Class C). Botsford gained 90 rushing yards on 22 attempts. Roscoe-Downsville-Livingston Manor 39, Eldred 6 Ocean Heintz and Nick Hill scored two touchdowns apiece as Roscoe-Downsville-Livingston Manor clinched the Class D regular season title with a win in Livingston Manor. Heintz scored on a 35-yard run in the first quarter and returned a punt 65 yards for a touchdown in the second. Hill caught a 45-yard touchdown pass from Dan Clancy and later scored on a 24-yard run. Austin Shaver and Allan Ward also scored rushing touchdowns for Roscoe-Downsville-Livingston Manor (4-2, 2-0 Class D). “We received some outstanding blocking that led to our stats and accomplishments today,” said head coach Fred Ahart. “Our line deserves credit for their outstanding blocking today.” Clancy completed 3-of-3 passes for 75 yards. Hill had two receptions for 55 yards and Justin Valentine added one catch for 20 yards. Shaver led the rushing game with 72 yards on four attempts. Hill gained 70 yards on four carries. Donovan Hendrickson made five tackles to lead the Roscoe-Downsville-Livingston Manor defense. Roscoe-Downsville-Livingston Manor and Eldred (0-6, 0-2 Class D) will meet again in the Section 9 Class D championship game at 7 p.m. on Nov. 6 at Middletown’s Faller Field. Poughkeepsie 24, Monticello 20 Sterling Morrison ran for 89 yards, two touchdowns and a 2-point conversion try in Monticello’s non-league loss at home. Kyle McCreery scored on a 4-yard run for Monticello (0-6). Poughkeepsie improved to 3-3.", "external_links": [], "published": "2015-10-11T07:24:00.000+03:00", "crawled": "2015-10-11T12:12:08.952+03:00", "highlightTitle": ""}