{"organizations": [], "uuid": "cfeb06a6997a0eed044ee78bad98ebedef103219", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ocregister.com", "main_image": "http://images.onset.freedom.com/ocregister/gallery/nw4khq-sarkisian2.jpg", "site_section": "http://www.ocregister.com/rss/sports-664474", "section_title": "The Orange County Register - News Headlines : Sports", "url": "http://www.ocregister.com/articles/football-687211-steve-coach.html", "country": "US", "title": "USC fires troubled football coach Steve Sarkisian", "performance_score": 0, "site": "ocregister.com", "participants_count": 1, "title_full": "USC fires troubled football coach Steve Sarkisian", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T23:44:00.000+03:00", "replies_count": 0, "uuid": "cfeb06a6997a0eed044ee78bad98ebedef103219"}, "author": "MICHAEL LEV", "url": "http://www.ocregister.com/articles/football-687211-steve-coach.html", "ord_in_thread": 0, "title": "USC fires troubled football coach Steve Sarkisian", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "USC fires troubled football coach Steve Sarkisian Oct. 12, 2015 Updated 1:50 p.m. 1 of 1 Troubled USC football coach Steve Sarkisian, seen addressing the media at the news conference introducing him as head coach in 2013, has been terminated. ARMANDO BROWN, CONTRIBUTING PHOTOGRAPHER SEND PDF Troubled USC football coach Steve Sarkisian, seen addressing the media at the news conference introducing him as head coach in 2013, has been terminated. ARMANDO BROWN, CONTRIBUTING PHOTOGRAPHER \nOne day after putting him on an indefinite leave of absence, USC has fired football coach Steve Sarkisian. \nAthletic Director Pat Haden made the announcement Monday afternoon through the school’s athletics website . \n“After careful consideration of what is in the best interest of the university and our student-athletes, I have made the decision to terminate Steve Sarkisian, effective immediately,” Haden said. \n“I want to thank Clay Helton for stepping into the interim head coach role, and I want to add how proud I am of our coaching staff and players and the way they are responding to this difficult situation. \n\"Through all of this we remain concerned for Steve and hope that it will give him the opportunity to focus on his personal well being.\" \nSarkisian was put on leave Sunday after Haden determined that he was not healthy enough to continue working. Sarkisian was absent from practice Sunday afternoon after appearing to be off during a team meeting. \nSarkisian’s troubles at USC began in August, when he appeared to be intoxicated at the school’s “Salute to Troy” rally. Sarkisian subsequently apologized, said he had mixed alcohol with prescription medication and would seek treatment. Since then, several reports suggesting Sarkisian has an alcohol problem have surfaced. \nSarkisian, 41, had a 12-6 record in one-plus season as USC coach. \nWe’ll have more on this developing story later today . Most Popular", "external_links": [], "published": "2015-10-12T23:44:00.000+03:00", "crawled": "2015-10-12T23:58:44.521+03:00", "highlightTitle": ""}