{"organizations": [], "uuid": "70a3c96a631b14a1b6c9035897311384f30c7bb9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "http://www.bostonherald.com/sites/default/files/media/2015/10/03/05bcduke.jpg", "site_section": "http://bostonherald.com/sports/college", "section_title": "Sports: College | Boston Herald", "url": "http://bostonherald.com/sports/college/college_football/2015/10/bc_s_d_in_red_zone_nearly_impenetrable", "country": "US", "title": "BC’s ‘D’ in red zone nearly impenetrable", "performance_score": 0, "site": "bostonherald.com", "participants_count": 2, "title_full": "BC’s ‘D’ in red zone nearly impenetrable | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 1, "uuid": "0966eff55030e1a64cdc9ad91ccab359f5186d3e"}, "author": "Rich Thompson", "url": "http://bostonherald.com/sports/college/college_football/2015/10/bc_s_d_in_red_zone_nearly_impenetrable#post-0", "ord_in_thread": 0, "title": "BC’s ‘D’ in red zone nearly impenetrable", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "DURHAM, N.C. — Boston College has a resolute defense that’s been exceptional in the red zone.\nThe Eagles defense did its best work inside their 20-yard line in Saturday’s 9-7 loss at Duke, keeping the Blue Devils out of the end zone — a feat they’ve accomplished three times in five games.\nBC gave up one red zone touchdown in a 14-0 loss to Florida State and another in a 17-14 win over Northern Illinois. Those are the only touchdowns the Eagles defense has allowed this season.\n“The guys are playing hard, that’s all I can say,” defensive coordinator Don Brown said. “Our guys are playing at a high level and playing hard and trying to give ourselves a chance — and that’s all you can ask.”\nThe Blue Devils were inside the red zone three times — twice on lengthy drives — and came away with a pair of Ross Martin field goals. Martin’s third field goal, which provided the game-winnign points, was a 53-yarder into the wind.\n“Our defense is no joke and our front seven is no joke against the run,” sophomore defensive end Harold Landry, who finished the game with six tackles, said. “Our (defensive backs) have been coming up smacking people as well.\n“It is tough for other teams to score in the red zone against us. Our goal is to never let a team cross the end zone, but we still didn’t get the win, so . . .”\nThe Eagles defenders also responded when a special teams’ mishap put them in a predicament down 9-0 in the third quarter. Punt return specialist Sherman Alston mishandled a Will Monday kick and turned the ball over on the BC 15.\nThe Blue Devils got a first-and-goal from the 1-yard line following a 11-yard run by quarterback Thomas Sirk. But the Eagles turned back consecutive runs by Duke tailback Shaquille Powell, and Sirk was stoned on a keeper — setting up a fourth-and-goal at the 1.\nTailback Jela Duncan attacked the right side of the line, but was tossed backward by BC defensive end Kevin Kavalec and middle linebacker Connor Strachan.\n“That was really big, and I thought it sparked the whole team,” Landry said. “I think it’s moments like that that get the whole team going and I felt like it energized the whole team.”\nDuke gained 228 total yards of total offense, with 33 on the ground and 195 in the air. BC exited the fray leading the nation in total defense (140 ypg.), passing defense (96.6) and rushing defense (43.4) and third in points allowed (8.0).\nThe glaring failure of the Eagles defense this season has been the lack of forced turnovers. BC has three interceptions and two fumble recoveries, a total that does not crack the top 50 nationally.\n“The one thing we have to find a way to do is turn people over,” Brown said. “We are just not turning people over, even though we are playing as hard as we can play and as well as we can play.”", "external_links": [], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-05T22:50:46.725+03:00", "highlightTitle": ""}