{"organizations": [], "uuid": "286675fb2793856b3dd0bb4265b6fdb02faa3619", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports/golf", "section_title": "Golf News, Leaderboard, Schedule, Photos, Videos - MSN Sports", "url": "http://www.msn.com/en-us/sports/golf/whos-hot-heading-into-the-presidents-cup/ar-AAf8gJ5", "country": "US", "title": "Who's hot heading into the Presidents Cup?", "performance_score": 0, "site": "msn.com", "participants_count": 1, "title_full": "Who's hot heading into the Presidents Cup?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "286675fb2793856b3dd0bb4265b6fdb02faa3619"}, "author": "Sal Johnson", "url": "http://www.msn.com/en-us/sports/golf/whos-hot-heading-into-the-presidents-cup/ar-AAf8gJ5", "ord_in_thread": 0, "title": "Who's hot heading into the Presidents Cup?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Who's hot heading into the Presidents Cup? Golf 1 day ago Sal Johnson © Golf 1. Jason Day – 535 points\nThe Aussie simply ran out of steam at East Lake, but clearly he has nothing to hang his head about after a season where—under normal circumstances—he easily could have been Player of the Year. Day returns to the Presidents Cup with a 4-4-2 record, but what the International squad will really be looking for is someone to lead them in South Korea. Can Day continue his good play and inspire his teammates? The U.S. squad may be vulnerable playing outside of North America, and if Day can provide some leadership, the Internationals could pull off an upset.\nAdChoices 2. Rickie Fowler – 365.66 points Finishing T-12 at the Tour Championship was a disappointing way to end the season, but East Lake doesn’t really suit his game and Fowler has yet to figure it out. Of course, winning the Players, the Scottish Open and the Deutsche Bank make for a successful year and Fowler has certainly proven that he will be a factor in big events for years to come. Heading into his first Presidents Cup, the good news is he has two Ryder Cups under his belt. The bad news is he hasn’t won a single match, going 0-3-5 in eight outings. On the upside, Fowler’s first professional win came at the 2011 Kolon Korea Open, so he knows a thing or two about playing—and winning—in South Korea.\n3. Bubba Watson – 345.33 points After a T-5 at East Lake, Watson finished the year fifth in the FedEx Cup standings and boasted two wins, three runner-ups and $6.9 million in earnings. This will be his second Presidents Cup, and despite going 3-2 at Royal Melbourne in 2011, his overall record in international competitions is less than stellar, as he has just three wins in 11 Ryder Cup rounds, all in fourball matches. Plus, Watson will be in search of a partner, as the only current teammate he has played with is Matt Kuchar, but they lost in their only outing. Look for Chris Kirk or Bill Haas as potential partners.\n4. Jordan Spieth – 320.17 points There’s no better way to top off a Player of the Year season than winning at East Lake, and Spieth now joins Tiger Woods and Jim Furyk as the only players to pull off the Tour Championship, FedEx Cup and POY trifecta in a single season. The 22-year-old played in his first Presidents Cup two years ago and went 2-2-0. But Spieth’s fresh approach—and dynamite play—could help lead this team to victory. Look for him to be paired with fellow youngster Patrick Reed as they proved a rare bright spot at the 2014 Ryder Cup, going 2-0-1.\n5. Dustin Johnson – 275.17 points Johnson ended the year with a pair of top-10s, including a T-5 at the Tour Championship, but placing 7th in the FedEx Cup race, earning over $5.9 million, and winning the WGC-Cadillac Championship just doesn’t overcome to the U.S. Open loss that defined his season. Johnson returns to team play after missing last year’s Ryder Cup and the 2013 Presidents Cup. His only Presidents Cup came in 2011, when he went 1-3-1. But he did go 3-0 at the 2012 Ryder Cup, his last team competition.\n6. Zach Johnson – 240.33 points The 39-year old enjoyed his most lucrative year on the PGA Tour, finishing sixth in Fed Ex points and taking home some $4.8 million in winnings. More importantly, his British Open victory served to validate his chances of being a Hall-of-Fame caliber player. Adding to that resume is the fact that Johnson has missed just one team competition—the 2011 Presidents Cup—since his debut at the 2006 Ryder Cup and has posted an overall record of 13-12-2. An extremely versatile partner who’s comfortable pairing with just about anyone, look for him to be a key player in the foursome and four-ball matches.\n7. Danny Lee – 226.17 points Lee sneaks into our top-10 thanks to his runner-up finish at East Lake, a fitting finale for what’s clearly been a break-out year. The 25-year old finished ninth in the FedEx Cup with earnings of just under $4 million and secured his first PGA Tour win at the Greenbrier. But his biggest advantage this week is that he’s returning “home” to South Korea where he lived until moving to New Zealand at age 8. We shall see if captain Nick Price looks to excite the home crowd by teaming Lee with South Korean Sang-Moon Bae, a combo that Lee has already dubbed a “dynamic duo.”\n8. Hideki Matsuyama – 210 points Despite topping last season’s earnings by nearly $1 million, Matsuyama has to be disappointed that he didn’t muster a win this year. He will be looking to improve on his results from the 2013 Presidents Cup, where he went 1-3-1 while paired with Adam Scott. Look for him to team up with Thai Thongchai Jaidee, who played full time on the Japanese Tour in 2002.\n9. Matt Kuchar – 178.33 points For just the second time in the last seven years, Kuchar didn’t record a win this season, but he did finish 19th in the FedEx race with over $2.7 million in earnings. He heads to South Korea with plenty of team experience, having played in two Presidents Cups (4-5-1) and three Ryder Cups (4-5-2.) He has proven to be a solid partner, earning 8 1/2 of his 9 points in foursomes and fourball play. Look for him to pair with Dustin Johnson, as they have a 2-1 record together and should be able to play off of each other’s strengths and weaknesses.\n10. Patrick Reed – 178.33 points After winning the Hyundai and then losing in a playoff to Spieth at the Valspar in March, Reed struggled for the rest of the year. But the good news is he was one of the few shining lights in last year’s Ryder Cup, scoring 3 1/2 points, all but one of which came while paired with Spieth. Look for that team to reunite in Thursday’s foursomes.\nInside the rankings: *Off the GOLFstats player rankings, we determine the hottest players based on the last nine weeks on the PGA Tour. Keys to the system:\n*132 points for regular tour win. All finishers in top-50 get points via a declining scale.\n*198 points for a win in WGC events and the Players Championship, 264 points for a major win.\n*Points are lost for missed cuts, DQs or WDs: 10 for regular events, 15 for WGC and Players, 20 for majors\n*All points get degraded 1/3 after weeks 4, 5 & 6, and by 2/3 for weeks 7, 8 & 9\nGo to MSN Home", "external_links": ["http://go.microsoft.com/fwlink/?LinkID=286759", "http://www.golf.com/"], "published": "2015-10-06T03:00:00.000+03:00", "crawled": "2015-10-07T19:43:40.135+03:00", "highlightTitle": ""}