{"organizations": [], "uuid": "248aeabfa0019c59ddac289fe7f1e5b392ae7b8d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.houstonpress.com", "main_image": "http://images1.houstonpress.com/imager/u/original/7860337/feat_img_10_22_courtesytnt.jpg", "site_section": "http://www.houstonpress.com/news/best-of", "section_title": "Houston, Texas News: Politics, Crime, Sports, Marijuana and Education Journalism | Houston Press", "url": "http://www.houstonpress.com/news/unreasonable-doubt-did-kelly-siegler-really-railroad-an-innocent-man-eight-years-ago-7860329", "country": "US", "title": "Unreasonable Doubt: Did Kelly Siegler Railroad an Innocent Man?", "performance_score": 0, "site": "houstonpress.com", "participants_count": 1, "title_full": "Unreasonable Doubt: Did Kelly Siegler Railroad an Innocent Man? | Houston Press", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T14:00:00.000+03:00", "replies_count": 0, "uuid": "248aeabfa0019c59ddac289fe7f1e5b392ae7b8d"}, "author": "Craig Malisow", "url": "http://www.houstonpress.com/news/unreasonable-doubt-did-kelly-siegler-really-railroad-an-innocent-man-eight-years-ago-7860329", "ord_in_thread": 0, "title": "Unreasonable Doubt: Did Kelly Siegler Railroad an Innocent Man?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Courtesy TNT Three days before Christmas 2014, former Harris County prosecutor Kelly Siegler found herself on the witness stand in Houston, defending her work in one of the most high-profile murder cases in Texas history.\nA 21-year veteran of the Harris County Assistant District Attorney’s Office, and a one-time candidate for that office, Siegler was now the star of a reality show, TNT’s Cold Justice , on which she helped law enforcement agencies try to crack unsolved murders.\nBut now Siegler was the one being grilled for how she secured the 2007 conviction of Hastings High School football coach David Temple — a former high school and college football star — for the brutal shotgun slaying of his pregnant wife, Belinda. She was killed in the couple’s Katy home in 1999, and while Temple was questioned extensively by investigators, he wasn’t charged with her murder until 2004.\nIn a highly publicized trial three years later, Siegler faced off against Dick DeGuerin, perhaps the most renowned defense attorney in the state. Local media portrayed the case as a clash of legal titans, a courtroom battle having almost as much to do with the attorneys’ egos as it did with the man on trial.\nDeGuerin was still smarting from two losses to Siegler. But he was a formidable defense attorney. Four years earlier, in a trial that drew national interest, DeGuerin convinced a Galveston jury that an eccentric millionaire named Robert Durst had only chopped up his neighbor and dumped the trash-bagged body parts in the bay, and that he did not murder him.\nThree months after the Durst trial, Siegler got her own taste of the spotlight when she prosecuted a woman named Susan Wright, who was accused of stabbing her husband 193 times and burying his body in the couple’s backyard. Siegler re-created the crime by bringing a bed into the courtroom, kicking off her heels, straddling an associate and pretending to stab him with a nine-inch kitchen knife.\nAfter Temple was found guilty, DeGuerin told a throng of reporters gathered outside court that Siegler had finally done it; she’d convicted an innocent man. For years, DeGuerin and appellate attorney Stanley Schneider accused Siegler of withholding evidence. They accused her of playing dirty, using Temple as a stepping-stone for her failed DA bid, and then for her TV career.\nBut after losing in the appellate courts, Temple’s attorneys were able to secure a rare hearing on the allegations before a visiting judge in late 2014. For two and a half months, DeGuerin, Schneider and appellate attorney Casie Gotro argued that they’d uncovered even more proof that Siegler buried evidence pointing to Temple’s innocence and another suspect’s guilt.\nIn July 2015, visiting Judge Larry Gist issued his damning decree: 36 findings of prosecutorial misconduct in which Siegler either suppressed evidence or disclosed it too late, depriving Temple of a fair trial. He also accused Siegler of interfering with developments in the case four years after she left office, saying she worked in concert with a detective to intimidate a witness who came forward with information pointing to the real killer.\nUltimately, Gist recommended to the Texas Court of Criminal Appeals that Temple’s conviction be overturned and that he receive a new trial. The appeals court decision is pending. When contacted by the Houston Press , Gist declined comment.\nSiegler stands by her work on the case. As she told the Press , “David Temple was convicted by a fair and impartial jury after a long and hard-fought six-week trial. Nothing improper was done by anyone with the Harris County Sheriff’s Office, the DA’s office or by me on this case. Dick DeGuerin and his team have done everything they can to mislead…and manipulate the press and the system in their attempts to blame a 16-year-old teenage boy instead of Temple as being the murderer of Belinda and Erin. We believe in the system and that the truth will prevail.”\nAfter Gist issued his findings, local media pounced on Siegler with a stinging rebuke of her performance in the Temple case. A tough-as-nails former prosecutor with a cable TV show was the perfect target, especially in Texas, which had recently witnessed the exoneration of Michael Morton, an innocent man who, like Temple, was convicted of killing his wife, and who spent 25 years in prison because an overzealous district attorney sat on exculpatory evidence.\nThe Houston Chronicle excoriated Siegler in an editorial: “While Temple has been sitting behind bars for eight years, Siegler has climbed the ladder to D-list celebrity status. That’s not the payoff the public should expect for prosecutors.” The editorial board stated, “For someone who built a career playing to juries, perhaps there should be little surprise that Siegler tried to pull the strings on the entire courtroom.”\nSiegler’s career was tarnished overnight. Held to the highest standards — and rightly so — prosecutors can be accused of nothing worse than railroading an innocent defendant. And the proof seemed to be right there in Gist’s findings, just as Temple’s attorneys had promised.\nBut in the rush to persecute Siegler and make a martyr of Temple, the media neglected to compare Gist’s findings to the trial record. If they had, they would have seen that the findings don’t stand up to scrutiny — they’re a flawed and often contradictory assessment of what actually occurred at trial. A closer look doesn’t suggest proof of a reckless prosecutor caught in her tracks but of shrewd defense attorneys able to kick up enough dust to cloud a judge’s vision.\nGist’s findings state that witnesses said things they never said; they misstate when DeGuerin was given access to certain records; and they mischaracterize dubious statements as material and exculpatory.\nUltimately, the findings tell a misleading story of yet another innocent man sacrificed on the altar of prosecutorial ego. They don’t tell the story of what really happened at trial, or what happened on a January night in 1999, when Belinda Temple was killed with a shotgun blast to the back of her head, on her knees and in cold blood.\nDavid and Belinda Temple, pictured with their son Evan, gave the outward appearance of being happy a year before Belinda's murder. Trial exhibit\nDuring five weeks of testimony in Temple’s 2007 trial, jurors heard from dozens of witnesses — detectives; medical and firearms experts; and friends, family and coworkers of both Temple and Belinda. They even heard from Temple himself, as well as DeGuerin’s alternate suspect, who was called to the stand by Siegler.\nThat suspect was Riley Joe Sanders III, a 16-year-old student at Katy High School who lived next door to Belinda, and whom Belinda sometimes taught for special-education sessions before tests. Detectives spent a great deal of time talking with Sanders and his friends, but they ultimately ruled him out as a suspect. DeGuerin, however, became fixated on Sanders. He believe the kid either broke into Belinda’s home with the intent to kill her, or killed her during a burglary gone wrong. To this day, DeGuerin is still trying to prove that Sanders is the real killer.\nSiegler and fellow prosecutor Craig Goodhart argued that Temple killed his wife because he was having an affair with another teacher and was tired of his marriage. He continued seeing his mistress after Belinda’s death, and eventually married her.\nTemple allegedly discovered Belinda’s body after returning home from running errands and going to the park with the couple’s three-year-old son, Evan. Temple called 911; although he told investigators that he checked her pulse and moved her body, he had no blood on him.\nInside the home, investigators found a grisly sight: Wedged between a laundry basket and shelves containing boots, sneakers and flip-flops was the body of Belinda Temple, lying face down, her left arm stretched out and bent back toward her waist, her hand resting in a pile of macerated brain matter and blood. She was eight months pregnant with a baby girl named Erin Ashley Temple, who weighed six pounds and measured 18 inches from crown to heel. A cordless phone lay nearby, and inches away from her left hand, in the corner against the closet’s back wall, was even more of her brain. Officers collected two and a half pounds of it, in two red plastic bags.\nNo ejected shotgun shell was found at the scene, but remnants of plastic wadding on the floor indicated that the shell was likely a reload; some hunters like to personally fill a shell with shot. Lead fragments recovered at the scene also indicated that the pellets used in the crime were double-aught, a common size.\nAt trial, Judge Doug Shaver barred Siegler from introducing crime lab evidence that found gunshot residue on Temple’s clothing, but jurors heard the following key points from both sides:\n• Siegler argued that Temple killed his wife on the afternoon of January 11, 1999, and then drove with the couple’s three-year-old son to an area near his parents’ home to discard the 12-gauge shotgun used to kill her; DeGuerin argued that Temple’s appearance on two stores’ security cameras that afternoon showed that he wasn’t home when Belinda was killed.\n• Investigators believed the home showed signs of a staged break-in; DeGuerin argued that the burglary was real and that it looked identical to a break-in committed by Sanders’s friends about two weeks before Belinda was killed.\n• Temple’s statements to the investigators the night of the murder showed inconsistencies; he couldn’t remember which park or parks he’d taken Evan to, and he claimed that he’d put Evan in a car seat, even though the car seat was actually in Belinda’s vehicle; DeGuerin said the statements weren’t inconsistent and that detectives bullied and harassed Temple.\n• Investigators couldn’t understand how an intruder could have gotten past the Temples’ aggressive dog, which was in the backyard and had prevented the first responding officers from getting in the house; the officers were close to shooting the dog until Temple emerged from the house and put the dog in the garage; DeGuerin argued that the dog was in the garage at the time of the murder and was let out into the backyard only later.\n• Siegler argued that Temple was the only person with a motive to kill Belinda because he was in love with another woman, a woman he wound up marrying; DeGuerin argued that Temple had already ended the affair before Belinda was killed, and that Sanders had a greater motive to kill Belinda because she told his parents he had missed too many classes and that she was upset that his friends had once thrown beer bottles on her lawn and removed her Christmas decorations.\n• A witness testified that he saw Temple driving south from the vicinity of his parents’ home on the afternoon of the murder, putting him in a location off the route he said he had driven that day; DeGuerin said the witness was mistaken.\n• Two witnesses (a married couple who knew the Temples) testified that Temple had threatened them in 1999 after he found out that they went before the grand jury; Temple said they were lying.\n• DeGuerin argued that Sanders had access to the murder weapon, a shotgun belonging to his father that had a spent shell in the chamber that had been loaded with the same size shot used to kill Belinda; Siegler reminded the jury that DeGuerin’s own firearms expert was unable to match that gun and that shell to the crime scene, nor was the expert able to match 37 other shells recovered from Sanders’s home.\nAfter trial, DeGuerin surveyed the jurors to find out why they convicted. His notes state: “Jurors say that the Temple family testimony was what turned the case.”\nDeGuerin complained that Siegler had relied on character assassination, but Temple didn’t do himself any favors, on the stand or when he was caught lying in a phone conversation tape-recorded by Belinda’s twin sister, Brenda Lucas.\nAs recounted in Shattered: The True Story of a Mother’s Love, a Husband’s Betrayal, and a Cold-Blooded Texas Murder , Kathryn Casey’s in-depth 2010 book about the Temple case, Siegler played these recordings for the jurors, who heard Temple tell Lucas he was wearing his watch and ring the night of the murder, which is why they weren’t stolen. But crime scene photos showed that the jewelry was on top of the bedroom dresser.\nAccording to the book, “When Brenda asked if he wanted the crime solved, David responded, ‘What difference would it make?’ It won’t bring Belinda back.’”\nThen jurors heard something else that probably didn’t sit well. They heard Temple tell Brenda, seven months after his wife’s unsolved murder, “Belinda wouldn’t want all this. She’d want us to leave it alone.”\nIn 2010 and 2013, the 14th Court of Appeals and the Texas Court of Criminal Appeals ruled that the evidence, though circumstantial, was enough to support a conviction.\nBut Gist found in July 2015 that Siegler withheld a witness statement that supported the defense’s theory of the timeline. Belinda’s phone records showed her last call to Temple that day was at 3:32 p.m. Temple testified that she had told him she was on her way home.\nIf she was still on campus when she made that call, it would help the defense, because it would narrow the window of time between when Belinda got home and when Temple was spotted on the security camera, thus giving him less time to kill her and hide the shotgun. And, according to Gist’s finding, an assistant Katy High principal told detectives that she saw Belinda talking on the phone to Temple between 3:20 and 3:30 p.m.\nIn truth, that assistant principal, who was interviewed on tape two days after Belinda’s murder, said no such thing. The tape was played during the habeas hearing, meaning that Gist was able to hear it for himself. Even Schneider told the Press the finding is “inaccurate.”\nWhen asked if he planned on sending a corrected copy to the clerk of the Texas Court of Criminal Appeals, Schneider said he wouldn’t because Gist did not want any amended findings presented.\nSchneider said the inaccuracy is not important, adding, “The essence of the statement is supported by the record.”\nBut it’s not. In the recorded interviews provided to the Press by Temple’s attorneys, no witness states that he or she saw Belinda on the phone with her husband at that time. One of the last teachers to see Belinda, a woman who spoke with her in the parking lot before she drove off, told the same detectives on tape that she and another colleague talked with Belinda about her pregnancy. She said nothing about Belinda being on the phone.\nAt a court hearing seven years after his trial, a judge found that David Temple did not receive a fair trial. Courtesy of KPRC\nAt the 2014-2015 hearings before Judge Gist, Temple’s attorneys argued that Siegler buried or delayed the disclosure of evidence incriminating DeGuerin’s alternate suspect, Belinda’s student and 16-year-old neighbor.\nThey argued that DeGuerin barely knew about investigators’ focus on Riley Joe Sanders III in 1999, and that this prevented him from presenting an “alternate suspect” argument in his opening statements to the jury. An alternate suspect theory is usually more effective than an alibi defense, which, they say, was DeGuerin’s only choice.\nGist’s ruling found that Siegler failed to immediately provide DeGuerin with certain evidence that pointed to the defendant’s innocence, known as “Brady” material. (In order to prove a Brady violation on appeal, a defendant must prove that the suppressed evidence would likely have changed the outcome of the trial.)\nGist also found that Siegler had delayed sharing non-Brady material with DeGuerin until the last minute. But when DeGuerin inherited the case after Temple’s November 2004 arrest, Texas discovery laws were much more limited — for example, prosecutors didn’t have to turn over a detective’s notes until after the detective testified. (During and after trial, DeGuerin claimed that Siegler committed a Brady violation by delaying disclosure of evidence relating to Sanders. In 2010, the 14th Court of Appeals ruled otherwise, stating that DeGuerin had “thoroughly cross-examined” Sanders.)\nAt the time of the Temple trial, the Harris County District Attorney’s Office had a policy giving defense attorneys a break on the discovery rules by allowing access to the case file prior to trial. The case file remained open unless the defense asked for a formal hearing requiring the State to present its evidence in a procedure called an examining trial.\nDeGuerin had taken over the case in November 2004; by the time he sought an examining trial in February 2005, he had had two months of unfettered access to the case. Gist’s findings don’t acknowledge that DeGuerin simply took a legal gamble and lost.\nStill, DeGuerin was ultimately able to present evidence against Sanders at trial. And by that time, his pet suspect was nothing new — the Temple family raised Sanders as a possible suspect in 1999, shortly after the murder.\nInvestigators looked into Sanders after he told a TV news crew the night of the murder that he was in school that day and hadn’t noticed anything unusual. Sanders had, however, skipped his last class, which was hardly unusual — a perpetual pot-smoker, Sanders had skipped 131 classes by the time of the murder.\nA slow learner, Sanders saw Belinda for “content mastery” classes before tests. Belinda talked with Sanders’s parents about his absences, and they punished him by suspending his driving privileges, which were already supposed to be suspended because Sanders had a DWI and was on juvenile probation. He told investigators that he was in the vicinity of Belinda’s home the day of the murder, which would make sense, seeing as how he lived next door.\nSanders told the grand jury he wasn’t mad at Belinda for talking to his parents about missing school. “She’s a teacher and she just cares about me,” he told the grand jury.\nBut DeGuerin argued at trial that Sanders was mad at Belinda and that the teen had reasons to want to get back at her, citing the beer bottles on the lawn and the missing Christmas decorations. If this didn’t make Sanders want to intentionally kill her, it could have made him mad enough to rob her house. Maybe she caught Sanders by surprise, and he shot her in a panic.\nGist’s 2015 findings appear to bolster DeGuerin’s claims that Sanders hated Belinda and that Belinda feared Sanders. But the findings don’t hold up.\nAccording to Gist, Siegler withheld a statement from one of Belinda’s friends, Natalie Scott, who “told investigators that the victim was having problems with a student, and that she was worried that he knew where she lived.”\nBut what Scott actually said, according to a detective’s notes, was that Belinda “had mentioned that she was concerned about some students at her School [sic] knowing where she lived.” Another detective who interviewed Scott reported that Belinda once said, “I don’t like my students knowing where I live,” and added that “Mrs. Scott states Belinda had never mentioned any student by name and had not told her of a particular student she feared.”\nDeGuerin would also argue at trial that Sanders was the only person investigators spoke to who had access to a shotgun that most closely resembled the assumed murder weapon. It was one of six shotguns collected and examined over the course of the investigation — none of which could be tied to the murder.\nPrior to trial, DeGuerin knew about the shotgun, and he knew that, when it was recovered, it was wrapped in a blood-spotted towel. He also knew that the blood on the towel was not a match to David or Belinda Temple.\nDuring the 1999 investigation, deputies examined two shotguns owned by Sanders’s father. Neither gun matched the crime scene. Because of a paperwork error, deputies mistakenly reported that they had collected both shotguns from Sanders’s father. But one of the shotguns was probably given to deputies by Sanders’s friend, Cody Ellis.\nTemple’s attorneys would later argue that this mix-up was a ruse meant to mislead the jury.\nIn 2012, DeGuerin went after Sanders again, this time with testimony from a former Katy High School student who said he overheard Sanders confess his involvement. The witness would eventually recant, but not before triggering a bizarre series of events that also appeared in Gist’s findings as supposed proof that Siegler was trying to protect the real killer, even years after she left office.\nDavid Temple's trial attorney, Dick DeGuerin, told the jury that his client was a loving husband with no motive to kill his wife. Mandy Oaklander\nFor a few months in 2012, DeGuerin and Schneider put great stock in their new witness, a 28-year-old gymnastics teacher named Daniel Glasscock, who in 1999 was a student at Katy High School.\nGlasscock, they argued, was the smoking gun. They got a former Harris County sheriff’s detective and a current DA’s investigator to believe them. Then, when Glasscock’s story fell apart and he was proved to be a liability, DeGuerin and Schneider jettisoned him.\nGlasscock wasn’t the first witness DeGuerin advanced as having knowledge of the real killer. The first was a prisoner, a career criminal named Michael Gene David, who in 2005 claimed to have overheard a 1999 conversation between an unknown prisoner and another inmate whom he knew only as “Gator.” David said the unknown prisoner said he wanted to get back at Temple for an undisclosed affront. He wanted “to cut his nuts out.” So the man concealed a shotgun in Christmas wrapping, knocked on the Temples’ door and Belinda let him inside. He shot her and then “wiped something from the gun on Temple’s clothes.”\nDeGuerin assured KPRC that David’s story was “very believable.” Nothing ever came of it.\nBut with Glasscock, DeGuerin was back on the trail of Riley Joe Sanders III, his pet suspect at trial. Glasscock’s name hadn’t surfaced in the original investigation, but he claimed to have called DeGuerin immediately after seeing a show about the Temple murder on the Investigation Discovery network. Four days later, DeGuerin and Schneider interviewed him. (Glasscock’s phone records show he called DeGuerin’s office the morning of May 25. Later, a Harris County Sheriff’s Detective subpoenaed records from the Investigation Discovery network and found that the show not only didn’t air when Glasscock claimed, it wasn’t broadcast the entire month of May.)\nGlasscock told DeGuerin he overheard a conversation in 1999 between Sanders and a friend named Carlos Corro. Corro had driven Glasscock over to Sanders’s home, and during the drive, he was acting “antsy” and said “shit is fucked up.” Glasscock said he didn’t know what Corro meant, nor did he ask. Also present for the conversation was Cody Ellis.\nLater, Gist would rule in his findings that Siegler “misrepresented the name of Carlos Corro as Gutierrez.” As the Harris County District Attorney’s Office’s response to Gist’s findings pointed out, this is not only false, it gives the impression that Siegler was trying to hide a witness.\nBut DeGuerin, and everyone else at trial, knew who Carlos Corro was. It’s unclear why Gist even included it as a finding: The only reason the name “Gutierrez” came up was that, in a single 1999 statement, Sanders referred to Carlos by that name.\nNow, five years after trial, Corro’s name was resurfacing: Glasscock told DeGuerin that Corro drove him over to Sanders’s house around the time of Belinda’s murder. He told DeGuerin he heard Corro and Sanders “talking about robbing the house next door and how it went wrong.” He told DeGuerin and Schneider he knew at the time that the kids were talking about Belinda.\nGlasscock told DeGuerin that Sanders said, “When he went into the house, they went to try to just steal stuff out of the house, whether it be the TV or whatever, but he said the dog attacked them. As he went upstairs, the dog attacked him. He shot the dog, heard Belinda, put the dog in the closet and they panicked and ran.”\nGlasscock’s story was strange — the Temples’ dog had not been shot, nor was it found in the closet. Belinda’s body was found in the closet. But, to DeGuerin and Schneider, the story was clear: “Dog” was code for “Belinda.”\nGlasscock said he wasn’t sure exactly when this conversation occurred. He told the attorneys it could have been the day of the murder; it was at least “within the week.”\nGlasscock’s story was relayed to a former Harris County sheriff’s lieutenant named John Denholm, who had participated in Siegler’s trial prep for the Temple case in 2007. Siegler had wanted to prepare testifying officers for DeGuerin’s style of sharp and thorough cross-examination, and she picked Denholm for the job.\nBut in 2012, Denholm thought there was something to Glasscock’s story. So he reached out to an old friend, Steve Clappart, an investigator with the Harris County District Attorney’s Office.\nIn June 2012, Clappart watched the video of Glasscock’s interview, and wrote in an interoffice memo that he was impressed with the witness’s “demeanor and presentation.”\nIn order to be thorough, Clappart ran a “cursory” criminal record check and found that Glasscock had a “substantial criminal history…with indicators of a predilection for drugs.”\nClappart didn’t mention the assault conviction from 2008, resulting from an incident in which, according to court records, Glasscock and a friend pulled a man from his vehicle and beat him. Glasscock, who was wearing a medical boot at the time, kicked the man severely enough that the victim “required seven metal plates to be surgically inserted into his face and his head.”\nThen-first assistant district attorney Jim Leitner told Clappart to follow up, and in July 2012, Clappart interviewed Glasscock himself. In that interview, Glasscock changed his story. He told Clappart he didn’t know at the time if the kids were talking about Belinda.\nGlasscock then said something even more strange that Clappart seemed to gloss over: Detectives in 1999 believed that the crime scene showed signs of a staged burglary in part because it seemed unlikely that an intruder could have gotten by the Temples’ aggressive dog. Temple never gave an explanation for this — until the trial, eight years later, when he said for the first time that the dog had been locked in the garage. Detectives never believed it.\nSo it seemed odd when Glasscock told Clappart, “I’m sure you would tell me that I’m not allowed to say it, but, come to find out from Mr. DeGuerin, the dog was in the garage the whole time…”\nBut that wasn’t all that Glasscock said he learned from his interview with DeGuerin. It’s also when he first heard about the murder weapon.\n“I didn’t even know it was a shotgun until Mr. DeGuerin told me,” Glasscock said.\nDespite the fact that Glasscock didn’t seem to have any independent knowledge of the murder, and despite the fact that he claimed DeGuerin fed him key information, Clappart not only believed Glasscock’s story was solid — he believed it was enough to charge Sanders with capital murder.\nBut Clappart figured the best way to get to Sanders was through his friend Cody Ellis. If the prosecutors came down hard on Ellis, he’d flip and give them Sanders.\nNo one in the District Attorney’s Office wanted to sign a capital murder warrant based on such a shaky, 13-year-old memory, but several prosecutors, including Leitner, thought Glasscock at least deserved another look. Leitner brought in outside counsel, defense attorney Brad Beers, for a follow-up.\nBeers also wasn’t crazy about Clappart’s capital murder warrant, so the two decided on another approach: Clappart would arrest Ellis on old traffic warrants and then surprise him with Glasscock’s story.\nBut before Clappart could serve Ellis on the warrants, a Harris County Sheriff’s detective named Dean Holtke beat him to the punch.\nHoltke had processed the Temple crime scene in 1999 and was intimately familiar with the facts of the case. As the detective who subpoenaed the Investigation Discovery network records, he realized Glasscock couldn’t have seen the Temple show when he said he did. As a result, Holtke was highly skeptical of Glasscock’s story.\nHoltke had also contacted Siegler and filled her in on Clappart’s plan to nail Ellis and Sanders. This was a clear violation of the DA’s Office’s intent to keep Siegler out of the investigation. Siegler gave Holtke the names of some top-notch defense attorneys, which Holtke passed along to Ellis and Sanders. By the time Clappart tried to arrest Ellis on the traffic warrants, he had lawyered up.\nInternal DA memos show that Holtke was removed from the case after DeGuerin complained to then-sheriff Adrian Garcia. Garcia assigned two cold-case detectives to interview Glasscock.\nThose detectives, along with Beers and Clappart, interviewed Glasscock in September 2012. Beers apparently didn’t think Glasscock was even worth sticking around for; after two hours, he said he had to leave for a previously scheduled meeting.\nAt the habeas hearing two years later, Temple’s attorneys would say that the cold-case detectives, Robert Minchew and Eric Clegg, bullied and intimidated Glasscock into changing his story. But the interview transcript shows nothing of the sort. Minchew and Clegg treated Glasscock with kid gloves — it’s just that they were the only detectives who tried eliciting actual details from this supposed new witness. For example, when Glasscock said that he might have heard the damning conversation on the day of the murder, Minchew and Clegg pointed out that an active investigation would have been unfolding mere yards away.\nClappart would also write in a memo that Minchew and Clegg “hammered” Glasscock, but it was actually Clappart himself who threatened Glasscock by erroneously describing the state’s perjury law. He told his own star witness that a person who gets caught lying under oath gets charged with the underlying crime he’s lying about.\n“Like if it’s a capital murder and you perjure yourself for a capital murder, you could face life in prison,” Clappart said.\nAsked for actual details for the very first time, Glasscock started to express concern about how DeGuerin interviewed him.\n“I don’t want to throw his name under the bus,” Glasscock said, before explaining that the interview with DeGuerin was “sketchy.” He said he “felt manipulated,” and that “I just felt like words were being put in my mouth.”\nIn the end, Glasscock said he had no first-hand knowledge that Sanders, Ellis or Corro killed Belinda. He was no longer useful to Temple’s attorneys. They didn’t call him to testify at the habeas hearing two years later. Prosecutors did.", "external_links": [], "published": "2015-10-20T14:00:00.000+03:00", "crawled": "2015-10-20T14:03:33.630+03:00", "highlightTitle": ""}