{"organizations": [], "uuid": "7f78cea285c992f3a5d8be0959330d08a2cf7b68", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "", "site_section": "http://www.tribuneindia.com/", "section_title": "The Tribune, Chandigarh, India : Latest news, India, Punjab, Chandigarh, Haryana, Himachal, Uttarakhand, J&amp;K, sports, cricket ", "url": "http://www.tribuneindia.com/news/uttarakhand/volunteers-from-state-up-take-part-in-cleanliness-drive/150454.html", "country": "US", "title": "Volunteers from state, UP take part in cleanliness drive", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "Volunteers from state, UP take part in cleanliness drive", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T02:00:00.000+02:00", "replies_count": 0, "uuid": "7f78cea285c992f3a5d8be0959330d08a2cf7b68"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/uttarakhand/volunteers-from-state-up-take-part-in-cleanliness-drive/150454.html", "ord_in_thread": 0, "title": "Volunteers from state, UP take part in cleanliness drive", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tribune News Service\nHaridwar, October 25\nGayatri Shantikunj and its flagship educational wing Dev Sanskriti University held a cleanliness drive at Ganga ghats here today as part of its Nirmal Ganga Jan Abhiyan. More than 5,000 volunteers from 13 districts of Uttarakhand and 22 Uttar Pradesh took part in the drive, generating awareness on the importance of maintaining sanctity of the holy river. The Har-ki-Pauri-Laltaura bridge was divided into seven sectors. The volunteers collected several tonnes of garbage, plastic material, clothes and other materials. Global World Gayatri Family president Pranav Pandya said such drives should be carried out regularly. He said Shantikunj had completed three phases of the Gangotri-Ganga Sagar cleanliness drive. The fourth phase would begin from Gaumukh on October 27. Spiritual ideologue Shail Jiji said people from across the globe come to Ganga ghats to take a holy dip and perform rituals. However, they were not bothered about maintaining cleanliness in the Ganga. Volunteers from Tehri Garhwal, Dehradun, Haridwar, Gautam Budh Nagar, Hapur, Shamli, Ghaziabad, Saharanpur, Bijnor, Moradabad, Aligarh, Bulandshahr, Baghpat, Muzaffarnagar, Sambhal, JP Nagar, Meerut, Balia, Varanasi, Gazipur, Chandauli, Bhadohi, Mirzapur, Allahabad, Pratapgad ,Kaushambi, Fatehpur, Rabareilly, Badaun and other parts of the state and Uttar Pradesh took part in the drive. Additional District Magistrate Jeevan Singh Nangiyal, Mayor Manoj Garg and councillor Anil Mishra were also present.", "external_links": [], "published": "2015-10-26T02:00:00.000+02:00", "crawled": "2015-10-26T06:03:55.264+02:00", "highlightTitle": ""}