{"organizations": [], "uuid": "a39609e269dc065de1f6d139aeb9258ed3b29191", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.boston.com", "main_image": "http://p.o0bc.com/rf/image_1920x1190/Boston/2011-2020/2015/10/20/Boston.com/BCOM/Images/JFKWHP-KN-24664%20(1).jpg", "site_section": "http://www.boston.com/", "section_title": "Boston, MA news, breaking news, sports, video | Boston.com", "url": "http://www.boston.com/news/nation/2015/10/22/tbt-when-jfk-told-the-world-about-the-threat-nuclear-war/Vh3CEMMkwvVsTK5fjNGxgN/story.html", "country": "", "title": "#TBT: When JFK told the world about the threat of nuclear war - Nation", "performance_score": 0, "site": "boston.com", "participants_count": 1, "title_full": "#TBT: When JFK told the world about the threat of nuclear war - Nation", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "a39609e269dc065de1f6d139aeb9258ed3b29191"}, "author": "boston.com", "url": "http://www.boston.com/news/nation/2015/10/22/tbt-when-jfk-told-the-world-about-the-threat-nuclear-war/Vh3CEMMkwvVsTK5fjNGxgN/story.html", "ord_in_thread": 0, "title": "#TBT: When JFK told the world about the threat of nuclear war - Nation", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "At 7 p.m. on October 22, 1962, President John F. Kennedy delivered an 18-minute televised address to the American people that caused many to fear the country was on the brink of nuclear war.\nKennedy told the world that there was evidence Russia had transformed Cuba into a base “for long-range and clearly offensive weapons,” a development that turned out to be the closest the Cold War would ever escalate into actual nuclear warfare.\n Prior to the speech, Kennedy called Soviet Premier Nikita Khrushchev. Here’s what Kennedy said, according to the John F. Kennedy Presidential Library and Museum :\n“I have not assumed that you or any other sane man would In this nuclear age, deliberately plunge the world into war which it is crystal clear no country could win and which could only result in catastrophic consequences to the whole world, including the aggressor.”\nDuring the speech, Kennedy also called for the removal of the weapons and “announces the establishment of a naval quarantine around the island until the Soviet Union agrees to dismantle the missile sites and to make certain that no additional missiles are shipped to Cuba,” according to the Kennedy Presidential Library .\nFront page of The Boston Globe on October 23, 1962 While Kennedy did not specifically speak of an impending World War III, his warning to the Soviet Union was dire:\n“Let no one doubt that this is a difficult and dangerous effort on which we have set out. No one can foresee precisely what course it will take or what cost or casualties will be incurred.”\nArticle from inside the October 23, 1962 edition of The Boston Globe Kennedy also directed comments at the Cuban people directly:\n“I want to say a few words to the captive people of Cuba, to whom this speech is being directly carried by special radio facilities. I speak to you as a friend, as one who knows of your deep attachment to your fatherland, as one who shares your aspirations for liberty and justice for all.\n... your leaders are no longer Cuban leaders inspired by Cuban ideals. They are puppets and agents of an international conspiracy which has turned Cuba against your friends and neighbors in the Americas ... These new weapons are not in your interest. They contribute nothing to your peace and well-being ... We know that your lives and land are being used as pawns by those who deny your freedom ...\nI have no doubt that most Cubans today look forward to the time when they will be truly free ... And then shall Cuba be welcomed back to the society of free nations and to the associations of this hemisphere.”\nThe most dramatic period of the Cuban Missile Crisis began days ahead of the president’s televised speech, when Kennedy and other officials were briefed on the CIA’s findings. The agency’s analysts examined aerial photographs of Cuba and found “conclusive evidence that a Soviet missile base was under construction near San Cristobal, Cuba; just 90 miles from the coast of Florida,” according to the JFK Library .\nLess than a week after Kennedy’s address, a deal between American and Soviet leaders was reached, ending what remains one of the most tense political standoffs in American history.\nWatch video of the full speech:", "external_links": ["http://microsites.jfklibrary.org/cmc/oct22/", "http://www.youtube.com/embed/rmA9CZqAWO4", "http://microsites.jfklibrary.org/cmc/"], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-22T14:23:04.115+03:00", "highlightTitle": ""}