{"organizations": ["Rogers"], "uuid": "69dbeefd85d347c4f90f0b33ef460ac3fce3a185", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nwaonline.com", "main_image": "http://media.arkansasonline.com/static/nwaonline/redesign/images/nwadg_logo_square.png", "site_section": "http://www.nwaonline.com/rss/headlines/sports/prep/", "section_title": "NWAonline stories: High School Sports - Northwest Arkansas", "url": "http://www.nwaonline.com/news/2015/oct/17/football-northside-pulls-away-from-roge/", "country": "US", "title": "Football: Northside pulls away from Rogers for 30-9 win", "performance_score": 0, "site": "nwaonline.com", "participants_count": 0, "title_full": "Football: Northside pulls away from Rogers for 30-9 win", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T09:00:00.000+03:00", "replies_count": 0, "uuid": "69dbeefd85d347c4f90f0b33ef460ac3fce3a185"}, "author": "", "url": "http://www.nwaonline.com/news/2015/oct/17/football-northside-pulls-away-from-roge/", "ord_in_thread": 0, "title": "Football: Northside pulls away from Rogers for 30-9 win", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Paul Nielsen"], "text": "By Paul Nielsen Posted: October 17, 2015 at 1 a.m. \nFORT SMITH -- Fort Smith Northside scored 24 unanswered points and quarterback Max Frazier rushed for two touchdowns and passed for another as the Grizzlies defeated Rogers High 30-9 in a 7A-West Conference game in Mayo-Thompson Stadium Friday night. \nRogers led 9-6 late in the first half but Northside (3-4, 2-2 7A-West) kicked a field goal before halftime and opened the second half with a touchdown drive for a 16-9 lead. \nFort Smith Northside 30, Rogers High 9 \nRogers^6^3^0^0^—^9 \nNorthside^6^3^14^7^—^30 \nFirst Quarter \nRog — Brummett 3 run (kick failed), 8:23 \nNorth — Lewis 69 pass from Frazier (kick failed), 8:08 \nSecond Quarter \nRog — Lopez 34 FG, 5:52 \nNorth — Parga 19 FG, :03 \nThird Quarter \nNorth — Bolton 1 run (Parga kick), 7:55 \nFourth Quarter \nNorth — Frazier 2 run (Parga kick), 8:06 \nNorth — Frazier 34 run (Parga kick), 6:41 \nFrazier's 69-yard scoring pass to Brennon Lewis tied the game at 6-6 in the first quarter. He rushed for two touchdowns in the fourth quarter, including a 34-yard run that gave the Grizzlies a 30-9 lead. \nFrazier rushed 18 times for 140 yards and he was 6 of 13 passing for 122 yards and one score. He was 5 of 11 passing in the first half for 103 yards. Northside finished with 233 yards rushing. \n\"Max did a great job,\" said Northside coach Mike Falleur. \"He is getting better every week, and he is more confident. He is not turning the ball over, and he is doing the right things.\" \nRogers coach Shawn Flannigan said the Mounties defense had a hard time containing Frazier. \n\"Frazier can run well and running quarterbacks seem to give us trouble,\" Flannigan said. \"It's hard to tackle quarterbacks like that in open space.\" \nRogers manged just 47 yards rushing in the second half after having 142 yards on the ground in the first half. Rogers quarterback Max Horton and slot back Milacio Freeland left the game in the first half with injuries and did not return. Freeland had 64 yards on seven carries before being injured. \nRogers marched 77 yards for a touchdown on the first possession of the game for a 6-0 lead. Freeland had three runs for 48 yards before Christian Brummett scored from the 3 for the early lead. \nBut the lead didn't last long as Northside needed just one play to tie the game at 6-6. Frazier found a wide open Lewis behind the Mounties secondary for a 69-yard catch and run with 8:18 left in the first quarter. \nRogers took a 9-6 lead midway through the second quarter when Chris Lopez hit a 34-yard field goal. But Northside marched from its own 44 down to the Rogers 1 and the Grizzlies tied the game at 9-9 when Cheuy Parga hit a 19-yard field goal with three seconds left in the first half. \n\"We got that score late and we challenged our kids at halftime,\" Falleur said. \"They came out (in the second half) and did a good job.\" \nNorthside then drove 80 yards and took the the lead for good when Luke Bolten scored from the 1 for a 16-9 lead with 7:55 left in the third quarter. \nRogers (1-6, 1-3) returns home Friday when the Mounties host Bentonville. \n ", "external_links": [], "published": "2015-10-17T09:00:00.000+03:00", "crawled": "2015-10-17T12:00:44.764+03:00", "highlightTitle": ""}