{"organizations": [], "uuid": "2e4680a17cb554d60092191235682a4a74481ba0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.huntingtonnews.net", "main_image": "/sites/all/modules/wb/transparent.gif", "site_section": "http://www.huntingtonnews.net/sports?format=rss", "section_title": "Sports", "url": "http://www.huntingtonnews.net/123666", "country": "US", "title": "Marshall Hands Middle Tennessee First C-USA Loss, 3-2", "performance_score": 0, "site": "huntingtonnews.net", "participants_count": 1, "title_full": "Marshall Hands Middle Tennessee First C-USA Loss, 3-2", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T07:48:00.000+03:00", "replies_count": 0, "uuid": "2e4680a17cb554d60092191235682a4a74481ba0"}, "author": "Special to HNN Provided by Herd Zone", "url": "http://www.huntingtonnews.net/123666", "ord_in_thread": 0, "title": "Marshall Hands Middle Tennessee First C-USA Loss, 3-2", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sunday, October 11, 2015 - 23:48 Updated 14 hours ago Special to HNN Provided by Herd Zone MURFREESBORO, Tenn. – Three Marshall women’s soccer players found the net as the Thundering Herd topped Conference USA leader Middle Tennessee, 3-2, on Sunday at Dean A. Hayes Track and Soccer Stadium. Marshall improved to 10-2-3, 3-1-2 in league play. It was the Blue Raiders’ first home loss and first C-USA loss this season, falling to 8-4-1, 4-1-0. The Herd now leads the series with MTSU, 2-1. Just 1:58 into the match, a familiar combination of Jordan Parkhurst (Scottsdale, Ariz.) and Sydney Arnold (Stafford, Va.) put the Herd on the scoreboard first. In the same tandem as Marshall’s fourth-minute goal on Friday at UAB, Arnold found Parkhurst in the 18-yard box who placed a shot in the back left corner of the net. It was the Herd’s fastest score of the season, since a goal at 2:07 against Eastern Kentucky on Sept. 7. The Herd kept its early advantage until the ninth minute when MTSU keeper Kelsey Brower punted a ball three-quarters of the way down the field to Tori Hawkins, who drove through traffic and took a sharp shot left-to-right past Herd keeper Lizzie Kish (Boyertown, Pa.). In the 32nd minute, Tennessee native Ashley Seltzer (Knoxville) broke the 1-1 tie with a shot from 25 yards out, finding top shelf past Brouwer. Marshall took its 2-1 lead into the break. Coming out of halftime, the Herd stayed on the offensive. At the 49-mintue mark, Jenna Dubs (Green Lane, Pa.) sent a free kick into the six-yard box, finding wide-open Erin Simmons (Gahanna, Ohio), who finished to give Marshall a 3-1 advantage. It was Simmons’ team-leading sixth goal of the year, and Dubs’ third assist. Dubs has nine career assists, tied with Simmons and Kassie Hollman (2004-07) for sixth place in the Marshall record book. Marshall’s defense held tough through the majority of the second half, not allowing a Blue Raider shot until the 71st minute. However, Simmons’ insurance goal would prove helpful as MTSU’s Morgan Mauck cut the lead to 3-2 in the 83rd minute. The Herd held off the Blue Raiders’ attack for the remainder of the period and came away with the 3-2 victory. Simmons was credited with the game-winner, marking the sixth of her career and moving into a tie for fourth place all-time at Marshall with Kelly Posey (1999-02). Also of note: Kelly Culicerto (Charlotte, N.C.) took six shots on the day, giving her 210 for her career and breaking the all-time school record of 208 set by Angela DeSumma (2008-11). As a team, the Herd out-shot the Blue Raiders, 29-9. LONG STORY SHORT Quotes by Coach Kevin Long: On bouncing back from Friday’s loss: “After Friday’s game this was a good bounce back for us. It was a very strong offensive performance after a lackluster showing on Friday night and that was important to us. I think the team had something to prove today. They didn’t want to start a trend in the other direction. They came out with more energy and had better production all across the board. It was on the road, against a team that’s atop the conference. It was something we needed to do against a good team; getting the win and getting points on the road. Now, I think everyone’s happy that we get some time at home.” #BEHERD Stay up-to-date on all things Herd women’s soccer via social media: Facebook , Twitter , Instagram , YouTube and Snapchat (username: HerdZone). UP NEXT The Herd will return home to host the Florida C-USA schools, with Florida Atlantic at 7 p.m. on Oct. 16, and FIU at 1 p.m. on Oct. 18 at Veterans Memorial Soccer Complex. For all the latest information about Marshall women’s soccer, follow @HerdWSoccer on Twitter.", "external_links": [], "published": "2015-10-12T07:48:00.000+03:00", "crawled": "2015-10-12T22:04:34.514+03:00", "highlightTitle": ""}