{"organizations": [], "uuid": "53729d859b980af418337cea02b000e84796610d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattlepi.com", "main_image": "http://ww4.hdnux.com/photos/41/24/76/8736675/13/rawImage.jpg", "site_section": "http://www.seattlepi.com/", "section_title": "Seattle news, weather, sports, events, entertainment | seattlepi.com - seattlepi.com", "url": "http://www.seattlepi.com/news/crime/article/The-Latest-Minor-clashes-after-Palestinian-youth-6550495.php", "country": "US", "title": "The Latest: Man killed by Palestinian last week was American", "performance_score": 0, "site": "seattlepi.com", "participants_count": 1, "title_full": "The Latest: Man killed by Palestinian last week was American - seattlepi.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "53729d859b980af418337cea02b000e84796610d"}, "author": "seattlepi.com", "url": "http://www.seattlepi.com/news/crime/article/The-Latest-Minor-clashes-after-Palestinian-youth-6550495.php", "ord_in_thread": 0, "title": "The Latest: Man killed by Palestinian last week was American", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "JERUSALEM (AP) — The latest developments in ongoing tensions between Palestinians and Israel following days of violence in Jerusalem and the West Bank (all times local).\n11.00 p.m.\nA U.S. State Department spokesman says a man killed along with his wife in front of their children by a Palestinian in the West Bank was an American citizen.\nMark Toner said that Eitam Henkin was a U.S citizen.\nHe spoke after Israel announced it had arrested 5 members of a Hamas cell that carried the bloody attack.\nOn Thursday, two of the Palestinians fired multiple shots killing Eitam and Naama Henkin , residents of the West Bank settlement of Neria. Their four young children, including a four-month-old infant, were in the backseat of the car during the shooting but were unharmed.\nIsraeli intelligence said one of the Palestinian gunman had been accidentally shot by his friend as they killed the Israeli couple prompting them to flee the scene without harming the children.\n___\n10:00 p.m.\nPalestinian President Mahmoud Abbas has convened his security advisors to discuss recent violence.\nA statement from his office Monday said he told the meeting that Israel is \"dragging the Palestinians into violence and we must avoid that.\"\nHe spoke after a day where two Palestinian teens were killed in violent confrontations with Israeli forces in the West Bank. The Red Crescent said a Palestinian was hit by live fire late Monday night in clashes in an Arab area of Jerusalem.\nFour Israelis were killed by Palestinians in knife and shooting attacks over the past few days. Palestinians have reported hundreds of protesters injured in clashes with Israeli soldiers over the past three days, with the majority of them being protesters who inhaled tear gas.\nIsraeli Prime Minister Benjamin Netanyahu had earlier convened his security Cabinet to discuss ways to restore calm.\n___\n09:15 p.m.\nIsraeli TV has shown CCTV footage from a Nablus hospital which it says is of Israeli special forces officers extracting a Palestinian gunman who allegedly killed an Israeli couple in front of their children.\nChannel 10 footage broadcast Monday night shows forces in civilian clothing running down a hallway with handguns drawn. A Palestinian gunman allegedly involved in Thursday night's attack was taken away, it said.\nIsraeli intelligence said the Palestinian gunman had been accidentally shot by his friend as they killed the Israeli couple prompting them to flee the scene. Their four children sitting in the back of the car were unharmed.\nA military spokesman confirmed later confirmed the report.\n___\n8:45 p.m.\nPrime Minister Benjamin Netanyahu says Israeli forces will deploy a \"heavy hand against terrorism\" and those that incite to violence.\nNetanyahu made the comments Monday night after it announced Israel's Shin Bet intelligence agency in tandem with the military had arrested a Hamas cell that killed an Israeli settler couple in front of their four children.\nOn Thursday, the assailants fired multiple shots killing Eitam and Naama Henkin, residents of the West Bank settlement of Neria. Their four young children, including a four-month-old infant, were in the backseat of the car during the shooting but were unharmed.\nThere has been speculation in the media as to why the Palestinian attackers didn't shoot the children as kids have not been spared in previous attacks.\nThe intelligence agency said Monday that during the attack, one of the Palestinian shooters accidentally fired a bullet into the arm of his accomplice and they fled the scene.\n___\n3:20 p.m.\nA Palestinian hospital official says a 13-year-old boy was killed during clashes with the Israeli military in the West Bank.\nA doctor at the Beit Jala hospital says Abdel Rahman Shadi was killed by a live bullet to the chest and another Palestinian protester was wounded in clashes that took place on Monday at Rachel's Tomb in Bethlehem.\nThe doctor spoke on condition of anonymity because he was not authorized to talk to the media.\nThe Israeli military said it was checking the report.\nThe death brings to two the number of Palestinian youths killed on Monday in clashes between Palestinian protesters and Israeli troops. An 18-year-old was killed earlier in the day in the northern West Bank town of Tulkarem.\n___\n2 p.m.\nMinor clashes have erupted between Palestinian protesters and Israeli troops in the West Bank city of Ramallah.\nThe clashes follow the death earlier on Monday of an 18-year-old Palestinian who was killed in the northern West Bank town of Tulkarem, also in clashes between Palestinian protesters and Israeli soldiers.\nThe protesters in Ramallah, some of them masked, threw rocks at security forces near an Israeli checkpoint that connects the city to other West Bank areas. The Israeli troops responded with tear gas and stun grenades.\nIsraeli police, meanwhile, arrested a Palestinian man and a woman who attacked officers on duty in Jerusalem. Police said they also arrested a Palestinian involved in recent unrest and an Israeli who threw stones at Palestinian cars.\nIn contrast to previous days, Jerusalem and the West Bank were mostly quiet by early afternoon Monday. On Saturday, a Palestinian stabbed two Israeli men to death and wounded a woman and her toddler in a brutal knife attack in Jerusalem's Old City.", "external_links": ["http://ap.org/schemas/03/2005/apcm", "http://ap.org/schemas/03/2005/apnm"], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-06T00:07:54.565+03:00", "highlightTitle": ""}