{"organizations": ["Penn State", "Buckeyes", "Ohio State", "Penn State Facebook Email Twitter Google"], "uuid": "e1b491b69cb639148d92e68d64a47b3fb93662ab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.indystar.com", "main_image": "http://www.gannett-cdn.com/-mm-/d1d7e3625ec5481896e58dab11ec7caac8cae88a/c=0-0-3213-1815&amp;r=x633&amp;c=1600x630/local/-/media/2015/10/08/Indianapolis/Indianapolis/635798972210574307-USATSI-8848256.jpg", "site_section": "http://rssfeeds.indystar.com/indystar/allsports", "section_title": "Indystar - All Sports", "url": "http://www.indystar.com/story/sports/motor/2015/10/08/pit-pass-antron-brown-perfect-so-far-nhra-playoffs/73580244/", "country": "US", "title": "Getting to know IU's next foe: Penn State", "performance_score": 0, "site": "indystar.com", "participants_count": 0, "title_full": "Getting to know IU's next foe: Penn State", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T17:46:00.000+03:00", "replies_count": 0, "uuid": "e1b491b69cb639148d92e68d64a47b3fb93662ab"}, "author": "", "url": "http://www.indystar.com/story/sports/motor/2015/10/08/pit-pass-antron-brown-perfect-so-far-nhra-playoffs/73580244/", "ord_in_thread": 0, "title": "Getting to know IU's next foe: Penn State", "locations": ["Indiana"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Zach Osterman"], "text": "Facebook Email Twitter Google+ LinkedIn Pinterest Getting to know IU's next foe: Penn State 1) Let's talk strengths first. Indiana had trouble running the ball in particular against Ohio State last weekend, because the Buckeyes were Post to Facebook Getting to know IU's next foe: Penn State 1) Let's talk strengths first. Indiana had trouble running the ball in particular against Ohio State last weekend, because the Buckeyes were Check out this story on IndyStar.com: http://indy.st/1LjVogL Cancel Send A link has been sent to your friend's email address. Posted! A link has been posted to your Facebook feed. Join the Conversation Zach Osterman , zach.osterman@indystar.com 10:46 a.m. EDT October 8, 2015 \nPenn State's Christian Hackenberg is considered one of the most talented QBs in the college game. (Photo: USA TODAY Sports) \nIndiana travels to Penn State this weekend, for its Big Ten road opener. The Nittany Lions play stout defense but have had problems moving the ball through their first five games. \nTo better get to know this weekend's opponent, The Star reached out to Lions247's Jeff Rice, to talk about the matchup: \nTHE STAR: Let's talk strengths first. Indiana had trouble running the ball in particular against Ohio State last weekend, because the Buckeyes were comfortable going one on one outside and stacking the box. What makes Penn State so good against the run? Similar tendencies? \nJEFF RICE: Penn State has been good against the run because its front four are consistently able to shed blocks and disrupt plays as/before they're getting started, and because its linebackers almost always carry out their assignments. The defensive backs have been pretty good in run support, though they've had some tackling issues. The defensive staff has also done a nice job of getting a feel for what the opposing offense is trying to do during the early part of the game and then adjusting to shut it down. IU coach: Sudfeld, Howard will travel to Penn State; status uncertain \nTS: Conversely, Indiana's coaching staff has said Penn State's pass rush isn't just down to forcing passing situations, that the Nits come hard and fast all the time. Where does that start, and with whom? \nJR: I think the answer to that is two-fold. First, there are a lot of \"high-motor\" guys on this defense, who come hard every play regardless of down or distance. The best example is probably senior DE Carl Nassib, a former walk-on who plays like he has a chip on his shoulder. The second part is that coordinator Bob Shoop is, by nature, aggressive. That doesn't mean he sends wave after wave of blitzes but he's always searching for weak spots to probe. It'll be interesting to see how Penn State does against Indiana, though, because it really hasn't seen a strong passing attack yet this season. \nTS: I'm going to presume Anthony Zettel came up in one or both of the answers above. How much is he the anchor of this defense? What other guys make it so tough, and in your mind, is it as good as its stats, or just yet to see its toughest offensive tests yet? \nJR: I think a lot of Penn State people would tell you that Austin Johnson, not Zettel, is the anchor of the defense. Don't get me wrong -- Zettel is a terrific player and, despite an increase of double-teams he's faced this season, has still been productive. But Johnson is a 325-pounder who moves like a 260-pounder, and he and Zettel have learned how to play off of one another. You add in Nassib, who might be playing his way into an early-round draft choice this season, and that's a lot for any line to take. Penn State keeps its top line fresh, too, by rotating subs in liberally. This line has taken over games in the second half because it hasn't had to play as much early. IU's offensive line looks to recover from 'stressful' performance \nTS: OK, offense -- Penn State doesn't look good on paper. Is that deceiving, or are there fundamental concerns here? How much of that might be fixed by Christian Hackenberg coming up against one of the Big Ten's worst pass defenses? And how important is running back Saquon Barkley to this whole equation? \nJR: Penn State's offense hasn't looked much better in person than on paper. In fact, you could argue it's looked worse. It's been a combination of problems; poor line play, conservative play-calling as a result of that play, lack of separation by the wideouts, injuries to running backs and what, even in that context, has been pretty lackluster play from Hackenberg himself. Hackenberg should have some opportunities against Indiana's secondary but I'm betting the Hoosiers will send plenty of pressure, so it'll be important for Penn State to stay on schedule and avoid third-and-longs, which are tough for any offense to handle but real killers for this one. A healthy Barkley is huge for Penn State because he can make defenses respect the run, and this passing game needs that threat to be effective. \nTS: I try not to ask for final score predictions, so let's do it like this instead: If Indiana wins Saturday, ____ will have happened. If Penn State wins, ____ will have happened. \nJR: If Indiana wins Saturday, the Hoosiers will have gotten the ball out of their quarterback's hand quickly to neutralize the Nittany Lions' pass rush, and picked apart Penn State's secondary with short and mid-range passes. It will have avoided turnovers and kept the Nittany Lions' offense off the field by bottling up the run and winning on first and second down. \nIf Penn State wins, the Nittany Lions will have established some offensive balance, been more effective at finishing drives with touchdowns than they've been and forced Indiana's offense into becoming one-dimensional by controlling the line of scrimmage. \nFollow Star reporter Zach Osterman on Twitter: @ZachOsterman. Read or Share this story: http://indy.st/1LjVogL Most Popular", "external_links": [], "published": "2015-10-08T17:46:00.000+03:00", "crawled": "2015-10-09T11:03:45.011+03:00", "highlightTitle": ""}