{"organizations": ["Texas Rangers", "Angels", "Associated Press", "Rangers", "AP", "View Larger Los Angeles Angels", "Los Angeles Angels"], "uuid": "b1573d67964385ed81b10adda7c1aa0ea2197624", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.journal-news.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/10/03/3c/27/533df8d49b194f7bbf049e09e996e41e-c92b630b036f4be9b2a3b4468e5ad9c2-0.jpg", "site_section": "http://www.journal-news.com/feeds/categories/sports/", "section_title": "News | Sports", "url": "http://www.journal-news.com/ap/ap/sports/angels-score-5-in-9th-beat-rangers-11-10/nntNK/", "country": "US", "title": "Angels score 5 in 9th, beat Rangers 11-10", "performance_score": 0, "site": "journal-news.com", "participants_count": 0, "title_full": "Angels score 5 in 9th, beat Rangers 11-10", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T06:48:00.000+03:00", "replies_count": 0, "uuid": "b1573d67964385ed81b10adda7c1aa0ea2197624"}, "author": "", "url": "http://www.journal-news.com/ap/ap/sports/angels-score-5-in-9th-beat-rangers-11-10/nntNK/", "ord_in_thread": 0, "title": "Angels score 5 in 9th, beat Rangers 11-10", "locations": ["Texas", "Los Angeles Angels", "Arlington"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Johnny Giavotella", "Giovatella", "Erick Aybar", "Hamilton", "Albert Pujols", "David DeJesus", "Drew Stubbs", "Quinn Wolcott", "Elvis Andrus", "Kaleb Cowart", "STEPHEN HAWKINS", "Mike Trout", "Otero", "Josh Hamilton"], "text": "Updated: 11:49 p.m. Saturday, Oct. 3, 2015 | Posted: 11:48 p.m. Saturday, Oct. 3, 2015 Angels score 5 in 9th, beat Rangers 11-10 Related View Larger Texas Rangers' Josh Hamilton (32) is congratulated by teammate Elvis Andrus after Hamilton hit a solo home run during the second inning of a baseball game against the Los Angeles Angels in Arlington, Texas, Saturday, Oct. 3, 2015. (AP Photo/LM Otero) View Larger Texas Rangers' Elvis Andrus dives safely in to third base advancing from second on a fly ball out by teammate Rougned Odor during the second inning of a baseball game against the Los Angeles Angels in Arlington, Texas, Saturday, Oct. 3, 2015. (AP Photo/LM Otero) View Larger Texas Rangers' Elvis Andrus, bottom, lays on the ground as Los Angeles Angels shortstop Erick Aybar, top, reacts after the out call on the steal attempt at second base by umpire Quinn Wolcott ending a baseball game in Arlington, Texas, Saturday, Oct. 3, 2015. The Angels won 11-10. (AP Photo/LM Otero) View Larger Texas Rangers' Elvis Andrus lays on the ground after getting called out trying to steal second base for the final out of a baseball game against the Los Angeles Angels in Arlington, Texas, Saturday, Oct. 3, 2015. The Angels won 11-10. (AP Photo/LM Otero) View Larger Los Angeles Angels' Albert Pujols (5) slides into second base for a double as Texas Rangers shortstop Elvis Andrus (1) fields the throw from the outfield during the ninth inning of a baseball game in Arlington, Texas, Saturday, Oct. 3, 2015. The Angels won 11-10. (AP Photo/LM Otero) View Larger Los Angeles Angels' Johnny Giavotella is congratulated in the dugout by teammates during the ninth inning of a baseball game against the Texas Rangers in Arlington, Texas, Saturday, Oct. 3, 2015. Giovatella hit an RBI single scoring Drew Stubbs in the night inning, leading the Angels to an 11-10 win. (AP Photo/LM Otero) Los Angeles Angels center fielder Mike Trout, center, celebrates with teammates David DeJesus (3) and Kaleb Cowart (41) after a baseball game against the Texas Rangers in Arlington, Texas, Saturday, Oct. 3, 2015. The Angels won 11-10. (AP Photo/LM Otero) By STEPHEN HAWKINS The Associated Press ARLINGTON, Texas — \nAfter their biggest rally this season, the Los Angeles Angels are going into the 162nd game still with a chance to reach the playoffs. They need another win, and some help. \n\"It's almost surreal to come back in that situation,\" said Johnny Giavotella, whose tiebreaking RBI single capped a five-run ninth inning for the Angels in an 11-10 victory over the playoff-bound Texas Rangers on Saturday. \"We never lost faith.\" \nErick Aybar and Kole Calhoun started the ninth with consecutive homers off Shawn Tolleson, the Rangers closer appearing in his fifth straight game. The Angels then strung together four consecutive two-out singles off Ross Ohlendorf (3-1). \n\"It's probably the craziest game I've been a part of, with everything we've got on the line,\" Mike Trout said. \"We lose that game, we're in trouble.\" \nThe Angels, who won the AL West last season, go into Sunday a game behind Houston for the AL's second wild card after the Astros won in Arizona late Saturday night. \nTo force a tiebreaker for the final playoff spot, the Angels have to win their series finale at Texas and Houston has to lose in Arizona. \nThe Rangers clinch their first division title since 2011 with a win Sunday, or a loss by Houston. \n\"That is a great comeback. You're not going to get that many hits strung out in the ninth against back-end-of-the-bullpen guys, but we did it,\" manager Mike Scioscia said. \"What I really like is win or lose, the dugout's loose, the guys were playing aggressive.\" \nIt was the Angels' first win when trailing by four runs or more in the ninth inning since July 6, 2013, when they won 9-7 in 11 innings at Boston, according to STATS. \n\"We've got one left. The only thing we can do is win it. We can't control what Houston does,\" Trout said. \"We're just giving ourselves a chance to make the postseason. This group of guys just never quit.\" \nC.J. Cron, David Freese, Carlos Perez and Giavotella had consecutive two-out singles, with Cron, Perez and Giavotella driving in runs. Before Perez singled on a 2-2 pitch, Texas was one strike from clinching the division. \nGiavotella finished with three hits and three RBIs. \nElvis Andrus singled off Joe Smith (fifth save) with two outs in the bottom half, then was caught stealing second by Perez when he overslid the base and Aybar applied the tag, a call upheld on video review. \nAndrus remained on the ground with his face in the dirt with the Rangers denied a chance to clinch the division title for the second straight day. They were guaranteed no worse than a wild card after winning the series opener 5-3 on Thursday. \n\"It's thoroughly disappointing what just transpired,\" Rangers starter Colby Lewis said. \"We've come this far. We're not going to let anything else get us down.\" \nJo-Jo Reyes (1-0) threw one pitch in his first major league outing since Sept. 20, 2011, for Baltimore, retiring Prince Fielder on a liner to end the eighth. \nTexas, after overcoming a 5-1 deficit midway through the game, was up 10-6 in the seventh when former Angel Josh Hamilton hit his second homer of the game and Rougned Odor homered two batters later. \nTolleson, who has all 35 of his saves since May 20, had thrown 63 pitches in the previous four games; in the ninth inning on Friday night he gave up a leadoff triple to Trout and Pujols' go-ahead single in the Angels' 2-1 win. \nTolleson was the first Texas reliever used five days in a row since Tanner Scheppers from Sept. 26-30, 2013. \n\"I thought we had a four-run lead and a guy in the game that had been so good for us,\" manager Jeff Banister said. \"You could tell early on it was going to be a challenge for him so we decided to make the move and get Ohlendorf in there.\" \nUP NEXT \nAngels: Garrett Richards (15-11) will pitch on three days' rest in place of Nick Tropeano. \nRangers: Texas has won the last nine starts by Cole Hamels, the left-hander acquired at the July 31 non-waiver trade deadline. Hamels is 6-0 with a 3.39 in those starts. \nLOT OF PITCHERS \nThe 18 pitchers set an AL record for a nine-inning game and matched the big league mark set Sept. 30, 2007, by St. Louis (10) and Pittsburgh (eight). \nSTUMBLED STARTERS \nBoth starting pitchers gave up five runs and left in the fifth without recording an out. Angels lefty-hander Hector Santiago had gone 3-0 with a 1.85 ERA in five previous starts against Texas this season, and the All-Star lefty was 7-1 with a 2.02 ERA in 16 previous starts vs. AL West teams. Lewis has a career-high 17 wins this season, and is the Rangers' most successful postseason pitcher (4-1, 2.34 ERA in eight such starts). \nTRAINER'S ROOM \nAngels: Giavotella went down briefly, but stayed in the game after Odor's hard late slide on which his foot went into the second baseman's shin in the fifth inning. \nRangers: Texas is still being careful with reliever Keone Kela (tender right elbow). Over his last 18 appearances, he has 21 strikeouts and hasn't allowed a run in 16 1-3 innings. Copyright The Associated Press", "external_links": [], "published": "2015-10-04T06:48:00.000+03:00", "crawled": "2015-10-04T09:13:37.310+03:00", "highlightTitle": ""}