{"organizations": ["University of Illinois", "Oshkosh Northwestern Media"], "uuid": "4a745424404ad1f3710b6c8428fadfa226dcb9ec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thenorthwestern.com", "main_image": "http://www.gannett-cdn.com/-mm-/046f6b03e16e1d27c1588f429096c100ccf2f9a6/c=0-306-3396-2216&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/10/07/Oshkosh/B9319112572Z.1_20151007190634_000_GSDC5GPSE.1-0.jpg", "site_section": "http://rssfeeds.thenorthwestern.com/oshkosh/sports", "section_title": "OshKosh - Sports", "url": "http://www.thenorthwestern.com/story/sports/high-school/volleyball/2015/10/07/hard-work-paid-winneconnes-gereau/73546634/", "country": "US", "title": "Hard work has paid off for Winneconne’s Gereau", "performance_score": 0, "site": "thenorthwestern.com", "participants_count": 0, "title_full": "Hard work has paid off for Winneconne’s Gereau", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T02:10:00.000+03:00", "replies_count": 0, "uuid": "4a745424404ad1f3710b6c8428fadfa226dcb9ec"}, "author": "", "url": "http://www.thenorthwestern.com/story/sports/high-school/volleyball/2015/10/07/hard-work-paid-winneconnes-gereau/73546634/", "ord_in_thread": 0, "title": "Hard work has paid off for Winneconne’s Gereau", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Alex Wolf", "Annika Gereau", "Winneconne"], "text": "Hard work has paid off for Winneconne’s Gereau Alex Wolf, Oshkosh Northwestern Media 6:10 p.m. CDT October 7, 2015 Buy Photo Winneconne’s Annika Gereau will be playing at the University of Illinois next year. (Photo: Joe Sienkiewicz/Oshkosh Northwestern Media) Buy Photo 94 CONNECT 3 TWEET LINKEDIN COMMENT EMAIL MORE \nWINNECONNE —Winneconne volleyball coach Will Brydon wasn’t shy in expressing how he felt about his star player in Annika Gereau. \nIntense, strong-willed and a little stubborn. But in a good way. \nGereau sets goals and she achieves them. Brydon said he has never seen a girl with such a sedulous attitude and it shows on and off the court. \n“I would first and foremost describe Annika’s personality as intense, it’s definitely a driven attitude when she’s on and off the court,” Brydon said of the senior. “I think that’s why she’s been so successful. She’s our workhorse, a leader and she’s been growing into this role ever since she was a freshman and even though I’ve only been here for two years I’ve seen a lot of improvement in that regard and I know we can keep on getting better. She will never quit.” \nDespite being 5-foot-6, Gereau is one of the area’s — and state’s — best outside hitters. A four-year starter on varsity, Gereau has a handful of accolades. She made third-team all-Eastern Valley Conference her first two seasons before being named unanimous first-team all-conference last year after leading the team in kills (351), aces (96) and digs (315). \nWhile she’s listed as an outside hitter, that’s not all she does. In fact, that’s not even what she’ll be doing the next four years at the University of Illinois, where she committed to play volleyball. \nBecause she’s not as tall as most outside hitters, it forced her to develop the other parts of her game. And clearly that paid off because she’ll be playing back row for the Fighting Illini, who are currently ranked No. 13 in the nation right now. \n“I’m so excited, I just went to watch them play Wisconsin,” Gereau said. “It was a fun game, the coaches are so great, the girls are nice and the campus is gorgeous.” \nDespite being undersized for an outside hitter, Gereau continues to play the position in high school because she is so dominant. When she elevates for a hit, she’s just as high as the other, taller, hitters. \nAnd that didn’t come naturally. She worked hard to be able to elevate like that. \n“I just do a lot of workouts (with my trainer) to improve my vertical,” Gereau said. “I do a lot of box jumps and squats but I’ve always learned that being a shorter player you have to have different types of shots, you can’t swing as hard as you can every single time so I try to work on that a lot. When I get the chance I jump faster and I try to hit it off their hands.” Buy Photo \nAnnika Gereau leads the team in kills (192), aces (47) and is second in digs (165) this season. (Photo: Jim Koepnick/for Oshkosh Northwestern Media) \nGereau is proud of her versatility. She’s one of the few six-rotational players to play at such a high level and her coach credits that to her height, as well. \n“The lack of height has made her develop the other parts of her game to a level where she can play six rotations, she can get the ball a lot and be confident in putting it down,” Brydon said. “Just like every other player she’ll have her ups and downs but with Annika with a well-rounded skill set like that, it’s easier to be pushed to the upper level of play when you have such a strong foundation.” \n“It’s nice that I get to play all six rotations because in college I will be playing back row, which will be fun,” Gereau added. “I like it cause it’s like reverse dodgeball they say and in front row if I’m not passing one game I can go and turn it into front row and turn in some points for my team.” \nGereau said she picked Illinois because not only was it the first school to target her, she also fell in love with the coaches and players. \n“I had a few other options, I was talking to UW-Green Bay, UW-Madison a little, some smaller D2 schools,” she said. “Some schools wanted me as a hitter but I wasn’t into that because that’s a lot of work. Talked to Iowa, Marquette, but chose Illinois because the coaches were so great and they were first to reach out to me. I liked the girls in my class and they have a great program.” \nBecause of her motivation, Brydon sees her making an impact at the collegiate level immediately. \n“I think Annika is going to come in and earn that spot (at Illinois), I do,” Brydon added. “I think she has the work ethic where she doesn’t quit until she gets what she wants and I think everyone on our team has come to understand that and I think that next year with a new group of girls that they’ll learn they have quite a force to reckon with on the court.” \nBut before Gereau can start thinking about her college days, she wants to finish her senior year off strong. The Wolves are off to a great start (21-3, 8-0 in East Central Conference) and Gereau likes her team’s chances as it nears the postseason. \n“The year is going pretty well, better than last year,” she said. “I don’t want to jinx it, but I see us winning the conference, which we’re in a good place for and I can see us, and our coaching staff believes it, that we can make it to the Resch Center so hopefully you’ll see us in (Green Bay for state).” \nWinneconne recently beat Plymouth, who was second in the conference entering the matchup with a 4-2 mark. Playing in the new conference is a nice change of pace for Gereau and the Warriors. \n“It’s really fun to play new teams, to have new blood,” Gereau said. “Seeing good competition, (Kettle Moraine Lutheran) we went to five sets with, Plymouth just with them too. Waupun is a good team always, they just lost their setter to a torn ACL and Berlin is doing well so it’s fun to have good competition. EVC was also good but it’s fun to play new competition.” \nAlso a standout softball player, Gereau said volleyball is still her favorite sport. Gereau is the Wolves’ top pitcher and earned second-team all-conference each of the last two years. \nShe carried Winneconne to a 19-9 record last season, and has even bigger expectations this year because the Wolves team didn’t have a senior on its roster a year ago. \n“We’ve always wanted to get further than regionals and we had a tough one with Xavier and New London and Freedom last year,” Gereau said. “We’re hoping this year is the year, we have a lot of young talent and we didn’t have any seniors last year. \n“I like being a pitcher because softball can get a little tedious and boring if you’re in any other positions but as a pitcher you’re always involved and always can pick up teammates in different ways.” \nAlex Wolf: (920) 426-6661; awolf@gannett.com; on Twitter @Wolfa07 94 CONNECT 3 TWEET LINKEDIN COMMENT EMAIL MORE Read or Share this story: http://oshko.sh/1RupAXw TOP VIDEOS", "external_links": [], "published": "2015-10-08T02:10:00.000+03:00", "crawled": "2015-10-08T08:23:26.180+03:00", "highlightTitle": ""}