{"organizations": [], "uuid": "073caead2678060401ec6495afba39dc0076f213", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "muscatdaily.com", "main_image": "http://www.muscatdaily.com/var/muscatdaily/storage/images/archive/sports/the-oman-handball-association-inks-partnership-deal-with-zubair-corporation-4csx/1683554-1-eng-GB/The-Oman-Handball-Association-inks-partnership-deal-with-Zubair-Corporation_StoryPicture.jpg", "site_section": "http://muscatdaily.com/rss/feed/Muscat_Daily_Sports_News", "section_title": "Muscat Daily Sports News", "url": "http://muscatdaily.com/Archive/Sports/The-Oman-Handball-Association-inks-partnership-deal-with-Zubair-Corporation-4csx", "country": "US", "title": "The Oman Handball Association inks partnership deal with Zubair Corporation", "performance_score": 0, "site": "muscatdaily.com", "participants_count": 1, "title_full": "The Oman Handball Association inks partnership deal with Zubair Corporation", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T08:09:00.000+03:00", "replies_count": 0, "uuid": "073caead2678060401ec6495afba39dc0076f213"}, "author": "muscatdaily@apexmedia.co.om (Muscat Daily News)", "url": "http://muscatdaily.com/Archive/Sports/The-Oman-Handball-Association-inks-partnership-deal-with-Zubair-Corporation-4csx", "ord_in_thread": 0, "title": "The Oman Handball Association inks partnership deal with Zubair Corporation", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Oman Handball Association inks partnership deal with Zubair Corporation L-R: Sheikh Sultan al Hosni, Sheikh Saif al Hosni, Mohammed al Hassani Muscat Daily staff writer October 12, 2015 \nThe Oman Handball Association (OHA) became the second beneficiary of the Oman Olympic Committee's (OOC) ambitious project 'Sport for Development' when it signed a one-year partnership deal with Zubair Corporation on Sunday. \nSigned with the support of Sheikh Saif al Hosni, the OOC vice-chairman, the deal was inked by Sheikh Sultan al Hosni, the OHA chairman, and Mohammed al Hassani, the chief communications officer of Zubair Corporation, at the OOC headquarters. \nA file photo of a first-division handball league final match between Muscat and Majees (Muscat Daily) \nSunday's announcement follows the Oman Volleyball Association's recent tie-up with Omantel. Both the deals are part of the OOC's new drive to bring in a clutch of corporate supporters to uplift sports in the country. \nSpeaking on the occasion, Saif al Hosni said, “This is our second partnership after the successful launch of the project last month. We hope the OHA and Zubair Corporation will work towards raising the profile of handball in Oman and also help the handball team produce positive results in international competitions.” \nSultan al Hosni said, “The partnership is beyond sponsorship as it is not just about financial support. The deal will seek greater interaction with Zubair Corporation to enhance the relationship for the betterment of the game. Our national teams - indoor and beach - are doing us proud by performing very well in regional and international competitions and we hope this partnership will boost our efforts in taking care of the players and promoting the game across the sultanate.” \nHassani, who is also a member of the OOC's marketing committee, the architect of the ambitious project, said, \n“This initiative is a result of the marketing committee's hard work over the past two years. We carefully studied the reasons for the lack of interest in sports among Oman's corporate bodies and we came up with the idea of long-term partnerships that will benefit the sports associations and the private sector. \n“The strategy has met with success and we hope to rope in a few more big corporate bodies in the near future. It is a win-win situation for both parties under the new deal where the corporates sort of adopt the sports associations and work hand in hand to develop sports.” \nTaha al Kishry, the OOC secretary-general, who was also present, said the OOC is hopeful of having two more partners on board by the end of the year. \n“We will add a few more corporates early next year, but we are confident of having two deals inked before December. It is our endeavour to strengthen the partnership between the private sector and the national sports associations,” said Kishry. \n“We hope to consolidate the existing relationship between the private sector and the OOC and boost the partnership to new levels for the benefit of sports in Oman.” Similar content", "external_links": [], "published": "2015-10-12T08:09:00.000+03:00", "crawled": "2015-10-12T08:29:55.689+03:00", "highlightTitle": ""}