{"organizations": [], "uuid": "1781923313d6fe3a1d7213149b5a38bef323814b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.newsherald.com", "main_image": "http://www.newsherald.com/storyimage/DA/20151001/SPORTS/151009869/AR/0/AR-151009869.jpg", "site_section": "http://www.newsherald.com/sports?template=rss&mime=xml", "section_title": "Sports - Panama City News Herald", "url": "http://www.newsherald.com/article/20151001/SPORTS/151009869/15769/SPORTS?rssfeed=true", "country": "US", "title": "Marlins try to snap 3-game skid against Mosley", "performance_score": 0, "site": "newsherald.com", "participants_count": 1, "title_full": "Marlins try to snap 3-game skid against Mosley", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T01:34:00.000+03:00", "replies_count": 0, "uuid": "1781923313d6fe3a1d7213149b5a38bef323814b"}, "author": "PAT McCANN", "url": "http://www.newsherald.com/article/20151001/SPORTS/151009869/15769/SPORTS?rssfeed=true", "ord_in_thread": 0, "title": "Marlins try to snap 3-game skid against Mosley", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "• Bay hosts Pensacola in big district clash PANAMA CITY — After Friday night, the District 1-5A football race could have a decided Bay County tilt. Or conceivably it could see Pensacola alone in first place with all other schools in the grouping already having suffered a defeat. Mosley (3-1, 1-0) plays at Arnold (1-4, 0-1) in what must be termed an elimination game for the host Marlins. A defeat would leave Arnold chasing an improbable scenario to even gain a shootout possibility for the district’s runner-up berth in the postseason. Meanwhile, Bay (4-0, 1-0) risks its No. 9 state ranking against visiting Pensacola (3-2, 0-0) at Tommy Oliver Stadium. Both games kick off at 7 p.m., with the Tornadoes celebrating Homecoming. Mosley opened 1-5A with a win on the road against defending district champion West Florida. The Dolphins would like nothing better than to solidify their chance to return to the playoffs by defeating a county rival. The matchup also is crucial to the Dolphins, who are the only local team that has to play two district games in Pensacola during the regular season. Then again, Friday night’s outcomes are critical to every school in the entire district. Mosley at Arnold Some high school teams don’t react favorably coming out of a bye week. For Mosley, head coach Jeremy Brown said, the difference was the Dolphins went into theirs on an emotional high from defeating West Florida. “I think the game before sets the tone,” Brown said. “I think an open week can be good, or can be bad. It’s how you approach it.” Brown said that his staff doesn’t go overboard emphasizing district implications to players. He said he’s more concerned with “playing a really good Arnold football team that probably should have beat us last year.” “We just want to go out there and get a win,” Brown said. “That being said, in a five-team district, if you can get to 2-0 you feel like you’ve got a chance.” Arnold is trying to end a three-game slide, so in many instances Marlin head coach Josh Wright said the focus is more internal, rather than on the upcoming opponent. “We’re more concerned with ourselves,” Wright said. “We know they’re going to have their bag of tricks, but they’ve tended to stumble in games against us with their wrinkles and then gone back to their basics. “We have to get better. More solid. More certain about how to be successful. We’ve got to lock things in and hang our hat on that identity. That’s what we’ve lacked. Being able to protect the passer and defensively take away the big play.” Page 2 of 3 - Both teams should be healthier than in recent weeks. Wright said that left tackle Shaun Kenney is back to 100 percent, and Trentin Lewis will play after being sidelined since early in the Bay game. Defensive end Branson Stuckey remains a game-time decision, however, and Wright said that receiver/defensive back Trever Kilcrease has practiced in pain since suffering a sideline hit against Choctawhatchee last week but is determined to see action. Mosley welcomes the return of running back Jimmy Daniel, who has played sparingly since an ankle injury in Week 2. Also back are Chris Creel and Dylan Rodriguez, who both suffered hand injuries in the kickoff classic. Mosley’s young backfield of sophomores Destin Coates and John Miller, along with veteran Ezra Gray has been more than capable in Daniel’s absence, but the senior was an 1,000-yard rusher in 2014. “Jimmy and Ezra did a great job in the spring with those guys bringing them through,” Brown said. “Destin Coates has run the ball well and John Miller was a guy coming in as a sophomore we weren’t really sure where he fit in. He’s prepared himself in a way he expected to be on the field.” The Dolphins also were buoyed by junior quarterback PeytonCalhoun bouncing back from a rough outing against Leon to pass for 160 yards at West Florida. “It was huge, we converted some third downs and were able to do some stuff on early downs,” Brown said. “What we did a good job with West Florida was our pass protection. It helped give Peyton more time with his reads. Everybody always points a finger at the quarterback or receiver, but when you don’t protect it makes it hard.” Wright is more than familiar with that assessment as quarterback Cody Saunders, despite already passing for more than 1,000 yards, has been forced to improvise all to often. “He’s had to scramble a lot and throw up some maybes,” Wright said. “I think we lack a little bit of size up front and don’t yet have the complementing o-line play. “Our key to success is take away the big play, contain what they do and just string together efficient series. Not depend on the big play, but have efficient series on offense and not make any mistakes.” Brown said that the last high school quarterback he’s coached against who threw the ball as well as Saunders was former FloridaState and West Virginia quarterback Clint Trickett. “What Cody brings to the table is that with a set of legs,” Brown said. “It’s almost like option responsibility where everybody has an assignment. We need to need great eye discipline. The toughest thing is we don’t have anybody to simulate that (running and passing ability) in practice.” Page 3 of 3 - Arnold could say the same about Mosley’s proficiency on onside kicks that has produced five successful recoveries. One way to combat that is prevent the Dolphins from scoring quite as often. “We just have to find four more points,” Wright said, referring to last season’s 13-10 loss to Mosley. News Herald Executive Sports Editor Panama City News Herald News Herald Executive Sports Editor Posted Oct. 1, 2015 at 5:23 PM Updated at 5:34 PM", "external_links": [], "published": "2015-10-02T01:34:00.000+03:00", "crawled": "2015-10-02T04:54:00.946+03:00", "highlightTitle": ""}