{"organizations": [], "uuid": "22d9c0e01ac92a6fcf5b36b2b9f5ee30fb4ec32d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "thecabin.net", "main_image": "", "site_section": "http://thecabin.net/RSS/sports.xml", "section_title": "TheCabin.net - Conway, Arkansas - Sports", "url": "http://thecabin.net/sports/2015-10-12/uca-defense-stingy-43-7-victory", "country": "US", "title": "UCA defense stingy in 43-7 victory", "performance_score": 0, "site": "thecabin.net", "participants_count": 1, "title_full": "UCA defense stingy in 43-7 victory", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:55:00.000+03:00", "replies_count": 0, "uuid": "22d9c0e01ac92a6fcf5b36b2b9f5ee30fb4ec32d"}, "author": "David McCollum", "url": "http://thecabin.net/sports/2015-10-12/uca-defense-stingy-43-7-victory", "ord_in_thread": 0, "title": "UCA defense stingy in 43-7 victory", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "UCA defense stingy in 43-7 victory Posted: October 12, 2015 - 7:55pm By David McCollum LOG CABIN STAFF WRITER \nThe University of Central Arkansas held Houston Baptist to minus-9 yards rushing Saturday and coach Steve Campbell said Monday that was worthy of high praise. \n“The big key (to a 43-7 victory) was stopping their rushing game,” Campbell said at the weekly Bearbacker luncheon. “We felt they had two of the best running backs we have faced. They rushed for 200 yards or more against Southeastern Louisiana and Abilene Christian. Our defense is getting better every week.” \nUCA quarterback Hayden Hildebrand completed 19 of 25 passes for 275 yards and four touchdowns. \n“Our offense was able to create separation early and we were able to play a lot of people,” Campbell said. \nHe noted that backup Kirk Baugh, a freshman, entered the game n a non-mopup situation. \n“He made thre right blitz call on third and eight and checked and fired it to Desmond (Smith) for a first down,” Campbell said. \nBrandon Cox of Conway made the second-longest punt return for a touchdown in school history with a 93-yarder. \n“Dominique Thomas rushed for a lot of yards (119) but the play that stuck out was after we were intercepted, he stripped the ball out of the derfender’s hands and got it back for us,” Campbell said. “Jonathan Woodard (defensive end) played really well. The statistics don’t show how well he is playing because he’s getting a lot of attention. He knocked the quarterback down five times and blocked a field goal. \n“DJ Holland had his best game at linebacker. Der \nek Floyd (tackle) set up both of our interceptions (by Tre Smith and Tyler Williams) with pressure.” \nSaturday night, the Bears (3-2 but 3-0 in conference) return home for a pivotal Southland Conference matchup in the Red Beans & Rice Bowl against undefeated McNeese State (5-0, 4-0). \nThe Cowboys jumped for 22nd t0 15th this week in the STATS FCS poll after a 21-7 victory over Southeastern Louisiana in which neither team scored the second half. They lead the SLC in all defensive categories and are giving up fewer than seven points a game. \n“We will have to have our best effort of the year,” said Campbell, whose team is second in the conference in rushing. “It will be a great challenge to sustain drives. It will be a battle of wills.”", "external_links": [], "published": "2015-10-13T03:55:00.000+03:00", "crawled": "2015-10-13T16:04:43.365+03:00", "highlightTitle": ""}