{"organizations": [], "uuid": "7ec58453f1f69cda811b1ed733017728f15d3b19", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thetimesnews.com", "main_image": "http://www.thetimesnews.com/Global/images/head/nameplate/thetimesnews_logo.png", "site_section": "http://www.thetimesnews.com/sports/high-school-sports?template=rss&mime=xml", "section_title": "High School Sports - The Times-News", "url": "http://www.thetimesnews.com/article/20151001/SPORTS/151009990/15216/SPORTS?rssfeed=true", "country": "US", "title": "Prep football previews: Williams, Eastern Guilford eye league victories in rescheduled games", "performance_score": 0, "site": "thetimesnews.com", "participants_count": 1, "title_full": "Prep football previews: Williams, Eastern Guilford eye league victories in rescheduled games", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T08:42:00.000+03:00", "replies_count": 0, "uuid": "7ec58453f1f69cda811b1ed733017728f15d3b19"}, "author": "Conor O'Neill Times-News coneill@thetimesnews.com", "url": "http://www.thetimesnews.com/article/20151001/SPORTS/151009990/15216/SPORTS?rssfeed=true", "ord_in_thread": 0, "title": "Prep football previews: Williams, Eastern Guilford eye league victories in rescheduled games", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted Oct. 1, 2015 at 12:40 AM Updated at 12:42 AM Rockingham County (3-3, 2-1) at Williams (2-4, 0-3) This Mid-State 3-A Conference matchup was moved up from Friday’s original date, and features two teams playing on regular rest because both played Thursday games last week. … The Bulldogs are trying to snap a three-game losing streak in which they’ve been outscored 132-14. … Williams was also 2-4 last season before winning four of its last five games to close the regular season. … Rockingham County is coming off a 38-13 loss to Eden Morehead, which snapped a three-game winning streak. … The Cougars have already surpassed last season’s win total (one) under coach Derrick Minor, who’s in his first season at Rockingham County. Minor is a Western Alamance graduate who has been an assistant coach for the Warriors and at Graham and Southern Alamance. … Williams beat Rockingham County 21-7 last season. Eastern Guilford (4-1, 2-0) at Eden Morehead (3-3, 1-2) This Mid-State 3-A Conference game was moved up a day, and both teams played last week on Thursday night. … Eastern Guilford likely will be without junior quarterback Bryant Barr, who suffered a shoulder injury last week. Sophomore Dominique Graves, who competed with Barr in preseason for the starting nod, filled in last week and would start if Barr is unable to play. … Last week’s winning margin of 29 against McMichael marked the first victory by more than seven points for Eastern Guilford. … Eden Morehead’s victory against Rockingham County last week ended a three-game losing slide. … In three victories, Eden Morehead has averaged 39.3 points per game. In three losses, Eden Morehead has averaged 16 points. … Eastern Guilford beat Eden Morehead 37-0 last season. Southern Vance (2-3) at Bartlett Yancey (2-2) Bartlett Yancey is playing after an unexpected off week, with last week’s game at Western Harnett cancelled because of rain. … The Buccaneers have lost back-to-back games, falling to Roxboro Person and Granville Central. … This is Bartlett Yancey’s last non-conference game, with a home matchup with Mid-State 2-A Conference foe Jordan-Matthews slated for next week. … Bartlett Yancey has surrendered 75 points in two losses after giving up 21 points in its two victories. … Southern Vance hasn’t played a game this season decided by less than 14 points. Two of Bartlett Yancey’s four games have been decided by less than a touchdown. … Southern Vance is coming off a 56-7 victory against Louisburg, which was played Thursday last week. The Raiders’ game before that was a 47-0 loss to Hertford County. Friday’s game Eastern Alamance (6-0, 3-0) at Northern Guilford (3-2, 1-1) Eastern Alamance travels to Northern Guilford for a clash of contenders in the Mid-State 3-A Conference. … A victory by the Eagles would set up next week’s matchup of unbeaten teams in league play, with Western Alamance visiting Eastern Alamance. … Eastern Alamance is ranked fourth in Class 3-A in The Associated Press state poll for the third straight week. Northern Guilford fell out of the rankings this week. … Eastern Alamance is one of six undefeated teams in Class 3-A in the state. The others are Shelby Crest, Havelock, West Craven, Asheville and Lee County. … The 3-2 start is tied for the worst start in program history for Northern Guilford, which was 1-2 in 2013 after forfeiting two victories. … Northern Guilford has been outscored 47-0 in the second halves of each loss this season. … Eastern Alamance won this matchup 32-28 last season, outscoring the Nighthawks 17-0 in the second half. … Quarterback John Lamot ran for 176 yards in that victory, including touchdowns of 34 and 70 yards in the second half. By Conor O'Neill", "external_links": [], "published": "2015-10-01T08:42:00.000+03:00", "crawled": "2015-10-01T09:40:45.131+03:00", "highlightTitle": ""}