{"organizations": [], "uuid": "185fccf3cd14eccee0bc1c2b40cbc363e76ffab1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.arcamax.com", "main_image": "http://www.arcamax.com/newspics/132/13271/1327112.jpg", "site_section": "http://www.arcamax.com/sports/", "section_title": "Sports | ArcaMax Publishing", "url": "http://www.arcamax.com/sports/hockey/s-1742076?fs", "country": "US", "title": "Wild hangs on for 3-2 victory over winless Blue Jackets | Hockey", "performance_score": 0, "site": "arcamax.com", "participants_count": 1, "title_full": "Wild hangs on for 3-2 victory over winless Blue Jackets | Hockey | ArcaMax Publishing", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "185fccf3cd14eccee0bc1c2b40cbc363e76ffab1"}, "author": "arcamax.com", "url": "http://www.arcamax.com/sports/hockey/s-1742076?fs", "ord_in_thread": 0, "title": "Wild hangs on for 3-2 victory over winless Blue Jackets | Hockey", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ST. PAUL, Minn. -- When you're facing a team that fired its coach the day before and entered winless in seven games, you don't want to be the first in the NHL to serve up a victory.\nThe Wild, beginning a stretch of seven out of nine games at home, gave their fans a scare during a downright drowsy display in the first period Thursday night. But the Wild regrouped between periods, and finally showed some gusto in the second period to become the latest team to hand the now 0-8 Columbus Blue Jackets a defeat.\nIn a microcosm of their albeit brief season thus far, the Wild put forth an uneven performance against the stumbling Jackets but was just good enough to spoil John Tortorella's coaching debut with a 3-2 win to improve to 4-1-1 this season.\nNino Niederreiter and Thomas Vanek sparked the rally with second-period goals, Zach Parise also scored and Devan Dubnyk improved to 4-1 with 37 saves as the Wild played at Xcel Energy Center for only the second time this season and first time in 12 days.\nSergei Bobrovsky, the 2013 Vezina Trophy winner who's off to a shocking 0-6 start this season, wasn't all that better under Tortorella than he was in sealing Todd Richards' fate. Having entered with a 5.07 goals-against average and .835 save percentage, Bobrovsky was serving up scrumptious rebounds.\nThe Wild finally buried one when he couldn't find the puck he gave up to Jared Spurgeon early in the second. Banged-up Nino Niederreiter found the puck, spun around and whipped it behind Bobrovsky for his third goal and second in as many games. Mikko Koivu extended his point streak to four games on the goal.\nLater in the period, after a couple of suffocating forechecks by the Wild, Charlie Coyle and Christian Folin each drew penalties from Cody Goloubef for a double minor. On the second power play, the second power-play unit struck for the first time this season.\nJason Zucker took an intentionally-wide slap pass and Vanek, amazingly with his back to the net and well wide of the net, sliced a perfect redirection inside the post for his third goal this season and 119th career power-play goal.\nDubnyk had to be good in the third period when the Blue Jackets pushed hard and the Wild played sloppily. But his best save came late in the second when he used every bit of his 6-foot-6 frame to make a desperation right pad save to rob Alexander Wennberg to preserve a one-goal lead.\nThe Wild were unclean getting out of their own zone in the first period, slow and deliberate in everything they did, turned pucks over and took careless penalties. All this led to little sustained offensive-zone time.\nThe Wild jumped out to a 1-0 lead 5 minutes, 4 seconds into the game when Ryan Suter picked off Jack Johnson's rim-around, pinched down the left wing and centered a pass for the corner that redirected in off one of Parise's shins. It was Parise's team-leading sixth goal in six games, tied for first in the NHL. Suter has assisted on five of them.\nBut even that elation didn't awaken the Wild. They went back to their clumsy ways and the Blue Jackets rallied on goals by Wennberg and Brandon Dubinsky.\nCam Atkinson made the play on the first goal. He held on to the puck during a Blue Jackets line change, peeled off along the left wing, fed Goloubef at the point and next thing you know a rebound was sent right by Dubnyk. Dubnyk tried to slide over, got tangled with Jared Spurgeon and Wennberg scored from a bad angle.\nLater, one shift after Justin Fontaine took a penalty, Fontaine made a bad pass at the offensive blue line for a giveaway. Vanek reacted with a slash, Marco Scandella failed to clear, then left Dubinsky wide open for a backdoor goal off a rebound.\n(c)2015 Star Tribune (Minneapolis)\nVisit the Star Tribune (Minneapolis) at www.startribune.com\nDistributed by Tribune Content Agency, LLC.\nShare Comment", "external_links": ["http://twitter.com/share?url=http://www.arcamax.com/sports/hockey/s-1742076&hashtags=ArcaMax", "http://www.facebook.com/sharer.php?u=http://www.arcamax.com/sports/hockey/s-1742076&h=Wild+hangs+on+for+3%2D2+victory+over+winless+Blue+Jackets", "https://plus.google.com/share?url=http://www.arcamax.com/sports/hockey/s-1742076"], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-23T13:13:06.541+03:00", "highlightTitle": ""}