{"organizations": [], "uuid": "5500fd8beaf565b2c4268ebad0a51c221501a15d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www2.ljworld.com", "main_image": "http://worldonline.media.clients.ellingtoncms.com/img/croppedphotos/2015/10/25/lightcrop_1_t800.jpg?90232451fbcadccc64a17de7521d859a8f88077d", "site_section": "http://www2.ljworld.com/rss/headlines/sports/", "section_title": "LJWorld.com stories: Sports", "url": "http://www2.ljworld.com/news/2015/oct/26/lightfoots-coach-no-stranger-talent/", "country": "US", "title": "Lightfoot’s coach no stranger to talent", "performance_score": 0, "site": "ljworld.com", "participants_count": 1, "title_full": "Lightfoot’s coach no stranger to talent", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T07:01:00.000+02:00", "replies_count": 0, "uuid": "5500fd8beaf565b2c4268ebad0a51c221501a15d"}, "author": "Gary Bedore", "url": "http://www2.ljworld.com/news/2015/oct/26/lightfoots-coach-no-stranger-talent/", "ord_in_thread": 0, "title": "Lightfoot’s coach no stranger to talent", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Gary Bedore — Lawrence Journal-World October 26, 2015 \nAdvertisement \nThe high school coach of future Kansas University basketball forward Mitch Lightfoot just happens to be Kurt Keener — the same man who won nine state titles in 35 seasons at Detroit Country Day in Michigan. \nKeener — who, like Lightfoot, is starting his second season at Gilbert Christian High in Arizona — is quite the talent developer and evaluator. \nAt Country Day, he tutored NBA players Chris Webber, Shane Battier and Ray McCallum, as well as fellow McDonald’s All American Amir Williams, formerly of Ohio State. \n“I would say Mitch has that same competitive fire. That’s the thing that both Chris and Shane had. They were intense competitors,” Keener said in a Sunday interview with the Journal-World. “I don’t think he (Lightfoot) is as physically gifted as Chris Webber was at this stage, nor do I think he’s quite the cerebral basketball player that Shane was. He’s not far off. \n“He (Lightfoot) works hard, rose to the occasion on the club circuit. The better the competition the better he played. That’s the thing that impressed the schools that were recruiting him. He has that kind of ... it’s almost a little bit of that ‘Christian Laettner swag,’ believing he’s the best and he’s going to go out there and do it,” Keener added. Gilbert Christian High's Mitch Lightfoot slams against Arcadia in the Div. II basketball championship game on March 2, 2015, in Glendale, Ariz. Lightfoot committed to Kansas University on Saturday. \nKeener did identify a player when asked if the 6-foot-9, 210-pound Lightfoot, who announced his commitment to KU on Saturday, reminds him of anybody else. \n“It goes back. I’ve been coaching a long time. The guy from Kansas I remember seeing in high school (was) Raef LaFrentz. His style of play in similar to Raef LaFrentz. That’s a guy I would compare him to,” Keener said. \nLightfoot, who averaged 17.9 points and 9.7 rebounds for state-champion Gilbert (Arizona) Christian last season, is a post player in high school. \nKeener was asked to describe Lightfoot’s role for this season and likely in the future at KU. \n“Mitch is a dominant player in high school because he’s very athletic. He can score in a number of ways. He attacks the basket, tries to block every shot around the hoop and gets up and down the floor,” Keener said. “At the college level, I believe he’ll be able to make the transition from maybe a pure post player to a stretch-4 because he can shoot the ball out on the floor. We just don’t need him to shoot threes, so we don’t ask him to shoot a whole lot. I think he’s a young man that can play for the Jayhawks and help keep their winning tradition going.” \nKeener has already spoken with Lightfoot about not straying too far from the goal during his upcoming senior season. \n“I told him (Lightfoot) when Battier was in high school he took three triples his entire senior year,” Keener said. “Then at the McDonald’s game he (Battier) won the three-point shooting contest making 19 of 25 in the finals. I told him (Mitch), ‘We can work on your perimeter game and do things that will help you into the next level.’ I don’t want him to be too far away from the basket and launching all the time for us. I think he understands that. We’ll be able to work on things to get him ready for the next level and hopefully take care of winning this year for us.” \nIt remains to be seen how much the No. 117-rated (by Rivals.com) Lightfoot plays his college freshman campaign. \n“To say for any freshman to come in and start at KU is a big thing,” Keener said. “I suppose it depends on how many guys at KU left. If they have one and done guys, potentially he could (start). That was one of the things Arizona was impressing upon him. They said, ‘Hey with the kids we’ve got graduating, you have a great opportunity to start.’ I think a lot will depend on getting stronger, getting into the weight room, putting on some weight so he can bang with people. If not the first year, I would think within a very short period of time he’ll be a significant contributor.” \nKeener believes Lightfoot’s all-out effort on the court will make him a fan favorite. \n“He is a great kid, enthusiastic. He is going to smile, play like a puppy dog. He runs to run, bang and compete and challenge,” Keener said. “He’ll play physical. He’s a fun teammate. He’s the type of kid who likes to hunt and fish, relax doing that, the kind of kid fans can relate to.” \nMeanwhile, Jarrett Allen, a 6-9 senior forward from St. Stephens Episcopal in Austin, Texas, visited KU over the weekend. He’s also considering Kentucky, Notre Dame, Texas, Kansas State, Houston, Indiana and North Carolina. He will visit Kentucky next weekend.", "external_links": [], "published": "2015-10-26T07:01:00.000+02:00", "crawled": "2015-10-26T09:50:49.333+02:00", "highlightTitle": ""}