{"organizations": ["Fisher Catholic", "Ohio State"], "uuid": "6973c215768ce509bc9a52d63df30d191b15d619", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.lancastereaglegazette.com", "main_image": "http://www.gannett-cdn.com/-mm-/4a9eb06c15341b5ac58a3b6a34bbb9df8ee6930b/c=0-131-2000-1261&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/14/OHGroup/Lancaster/635804560017509150-Blake-Saffell.jpg", "site_section": "http://rssfeeds.lancastereaglegazette.com/lancaster/highschoolsports", "section_title": "Lancaster - High School Sports", "url": "http://www.lancastereaglegazette.com/story/sports/2015/10/15/high-school-golf/73960790/", "country": "US", "title": "Fisher Catholic set to make run at state golf title", "performance_score": 0, "site": "lancastereaglegazette.com", "participants_count": 0, "title_full": "Fisher Catholic set to make run at state golf title", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T23:55:00.000+03:00", "replies_count": 0, "uuid": "6973c215768ce509bc9a52d63df30d191b15d619"}, "author": "", "url": "http://www.lancastereaglegazette.com/story/sports/2015/10/15/high-school-golf/73960790/", "ord_in_thread": 0, "title": "Fisher Catholic set to make run at state golf title", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Blake Saffell", "Michael", "Tom Wilson"], "text": "Fisher Catholic set to make run at state golf title Tom Wilson , Reporter 4:55 p.m. EDT October 15, 2015 Buy Photo Fisher Catholic senior Blake Saffell will lead the Irish into the Division III state golf tournament at Ohio State's Scarlet Golf Course. (Photo: Michael Lehmkuhle/The Advocate) Buy Photo CONNECT TWEET LINKEDIN COMMENT EMAIL MORE \nLANCASTER — When the Fisher Catholic boys golf team qualified for the Division III state tournament in 2013, they were just happy to be there. \nThe Irish had a solid performance with a sixth-place finish, but when they tee it up Friday at Ohio State’s Scarlet Golf Course, the Irish will have a completely different attitude. \nFisher Catholic is not only happy to be making a return trip, but the Irish have their sights set high, and they feel like they have a great chance of bringing home a state championship. \n“The first time we played at the state tournament, I know our guys felt so much pressure,” Fisher Catholic coach Travis Saffell said. “That part is over because they have been there and felt the pressure. They have a lot of confidence coming off winning the district and beating two of the best teams in Ohio.” \nThe Irish will head into the two-day tournament with the lowest winning district score of all the teams that are playing in the state tournament. \nFisher Catholic won the Division III district title by shooting a scorching 306 to beat out perennial state powers Wellington and Newark Catholic. \nThe Irish return three players from the 2013 state-qualifying team: seniors Blake Saffell, Aaron Wood and Brady Taulbee. \nBlake Saffell led the Irish in their district title with a 74, Wood shot 75 and Taulbee fired a 78. Zach Saffell shot 79 and Tom Sylvester had an 81. \n“Our seniors have done a great job all season, and they have led the way,” Travis Saffell said. “All of our kids are tough and competitive, and what they have accomplished by winning the district is special. \n“Going up to the Scarlet Course should be a little easier this year because they’ve been there. You never know about golf from one day to the next, but all we can do is go give it our best, play all 18 holes and see what happens.” \nFisher Catholic also won the Mid-State League-Cardinal Division title, and the key all season has been steady, consistent play from all five golfers, which Travis Saffell hopes will continue at the state tournament. \n“When you have two guys (Blake Saffell and Wood) at the top that you can count on each time out, that is a good place to start,” Travis Saffell said. “But when you can get next three guys to continually post solid scores, then you have something.” \nIn the district tournament, all five Fisher Catholic golfers broke 40 on at least one nine. \n“The key is to be peaking at the right time, and all of our guys are playing well right now,” Travis Saffell said. “From top to bottom, all of our guys are playing with a lot of confidence.” \ntwilson@lancastereaglegazette.com", "external_links": [], "published": "2015-10-15T23:55:00.000+03:00", "crawled": "2015-10-16T01:09:36.676+03:00", "highlightTitle": ""}