{"organizations": [], "uuid": "fc3a56ccfe261544883e8cfb3bec8d8f92e445c2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wcax.com", "main_image": "http://images.worldnow.com/AP/images/8922681_G.jpg", "site_section": "http://www.wcax.com/category/13537/business-news", "section_title": "Business &amp; economy news - WCAX.COM Local Vermont News, Weather and Sports-", "url": "http://www.wcax.com/story/30165495/apart-from-low-unemployment-just-how-healthy-is-job-market", "country": "US", "title": "Apart from low unemployment, just how healthy is job market?", "performance_score": 0, "site": "wcax.com", "participants_count": 1, "title_full": "Apart from low unemployment, just how healthy is job market? - WCAX.COM Local Vermont News, Weather and Sports-", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "fc3a56ccfe261544883e8cfb3bec8d8f92e445c2"}, "author": "wcax.com", "url": "http://www.wcax.com/story/30165495/apart-from-low-unemployment-just-how-healthy-is-job-market", "ord_in_thread": 0, "title": "Apart from low unemployment, just how healthy is job market?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By CHRISTOPHER S. RUGABER\nAP Economics Writer WASHINGTON (AP) - The U.S. unemployment rate - now just 5.1 percent - grabs a lot of the attention each month when the government issues its jobs data. Yet the rate doesn't come close to sketching a full picture of the job market.\nSo just how healthy is the U.S. labor market?\nIt's a hard question to answer in the aftermath of the Great Recession, which produced only a tepid recovery and left damage that still isn't fully repaired. It's why the Federal Reserve has struggled to determine whether to raise interest rates from record lows: If the job market is back to normal, a rate hike may be justified. If not, the Fed should arguably postpone any increase.\nThe September jobs report coming out Friday will provide clues to the job market's health that go beyond the unemployment rate.\nHere are five things to look for:\n- ARE MORE PEOPLE EITHER WORKING OR SEEKING WORK?\nNot everyone out of work is looking for a job. A historically high number of people who were laid off in recent years failed to find work and stopped looking. Millions more have left the job market to return to school, care for relatives or retire.\nThose trends have helped keep the unemployment rate artificially low: The government doesn't count people as unemployed if they aren't actively looking for a job.\nSince the official start of the recession in December 2007, the proportion of adults who either have a job or are looking for one has fallen from 66 percent to 62.6 percent, a 38-year low. That's equal to roughly 8 million fewer people in the workforce.\nThe Congressional Budget Office says about half that decline is due to an aging population. Roughly 10,000 baby boomers turn 65 every day, and many of them retire.\nBut about one-third of the drop is attributable to the sluggish recovery, the CBO said. Unemployment was stuck above 8 percent as late as 2012 - three full years after the recession officially ended. And pay growth is still meager.\n- HOW LARGE A CHUNK OF AMERICANS ACTUALLY HAVE A JOB?\nEven when you filter out the effects of aging and retirements, American adults as a whole are still less likely to be working than they were before the recession.\nMany analysts focus on the percentage of prime-age Americans - those 25 through 54 - who have jobs. (People in this group are well below retirement age and have usually completed their education.) The percentage fell from 80 percent when the recession began to 74.9 percent in 2011. It's since recovered to 77.2 percent but remains far short of pre-recession levels.\nSome economists, such as Andrew Levin, a former adviser to Janet Yellen and now a professor at Dartmouth, say those figures show that the job market still has plenty of room to heal.\nFaster economic growth and a lower unemployment rate could lead more people to take jobs, even if they're not looking right now, Levin says. Parents who stayed home after losing a job might, for example, be coaxed back to work if their previous employer becomes desperate to meet stronger customer demand.\n\"If their old firm is pleading with them to come back, then they do,\" Levin said. \"But if there are no jobs, they just stay at home longer and work on their garden.\"\n- DOES EVERYONE ON THE SIDELINES WANT A JOB?\nMany people who are out of the workforce don't necessarily want to get in. Presidential candidate Donald Trump and some commentators have asserted that a record 94 million Americans \"aren't working.\"\nYet that figure is misleading. It includes every retired 80-year old grandparent and every 16-year-old high school student - people who aren't looking for work and don't plan to. The figure stands at a record in part simply because of population growth. For the same reason, the number of people with jobs - 149 million - is also a record high.\nOnly a small portion of this group wants a job. How do we know?\nBecause the government asks them. In August, just 5.9 million out of that 94 million said they wanted to work. They aren't counted as unemployed, though, because they aren't actively searching for jobs. This figure has fallen since 2012, even as the overall number of people out of the workforce has grown. That suggests that most people who left the workforce in recent years have retired or no longer want a job for other reasons.\n- IS ANYONE GETTING MUCH OF A RAISE?\nOverall, pay gains are sluggish. Average pay has risen just 2.2 percent over the past 12 months, below its long-run pace of about 3.5 percent.\nBut there are signs that wages are picking up for full-time workers. Robin Anderson, an economist at Principal Global Investors, says annual pay rose 3.8 percent this year from 2014 for employees in the 34,000 retirement plans that Principal manages.\nThat's much higher than the official data. And it marks a big shift from a couple of years ago, Anderson says, when Principal's figures were similar to the government's.\nWhat accounts for the pay acceleration? Principal's data is more heavily skewed to full-time employees, whose pay is rising faster than it is for part-timers, according to government data.\nStill, just 81.9 percent of all jobs are full time now, below the pre-recession level of 83.1 percent. Should full-time employment continue to rise, Anderson says, wages should pick up.\n- DO MANY PART-TIMERS WANT FULL-TIME JOBS?\nNearly 6.5 million people who are working part time want more hours. That is down sharply from a peak of nearly 9.3 million in 2010. But it's still above the 4.6 million figure when the recession began.\nYellen and most economists regard the elevated reading as another sign that the job market isn't fully healed. More economic growth might force employers to offer more hours to these part-timers.\n\"An unusually large number of people are working part time but would prefer full-time employment,\" Yellen said in a speech last week.\n\"We would hope to see some decline\" in that figure, she added at a news conference last month.\nCopyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-10-01T03:00:00.000+03:00", "crawled": "2015-10-05T17:34:51.841+03:00", "highlightTitle": ""}