{"organizations": [], "uuid": "8cacb4d1737755ff71dd8ddcf5f833b67aa90ffe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/", "section_title": "Ahram Online - News, Business, Culture, Sports &amp; Multimedia from Egypt ", "url": "http://english.ahram.org.eg/NewsContent/2/9/155938/World/International/Clinton,-Sanders-clash-on-guns,-economy,-foreign-p.aspx", "country": "EG", "title": "Clinton, Sanders clash on guns, economy, foreign policy - International - World", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "Clinton, Sanders clash on guns, economy, foreign policy - International - World - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "8cacb4d1737755ff71dd8ddcf5f833b67aa90ffe"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/2/9/155938/World/International/Clinton,-Sanders-clash-on-guns,-economy,-foreign-p.aspx", "ord_in_thread": 0, "title": "Clinton, Sanders clash on guns, economy, foreign policy - International - World", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related Clinton, Sanders rivalry in spotlight as Democrats debate Front-runner Hillary Rodham Clinton and her main rival Sen. Bernie Sanders clashed over U.S. involvement in the Middle East, gun control and economic policy in the first Democratic presidential debate, outlining competing visions for a party seeking to keep the White House for a third straight term .\nYet in a moment of political unity — and levity — Sanders leapt to Clinton's defense in Tuesday night's debate on the issue of her controversial email practices as secretary of state .\n\" The American people are sick and tired are hearing about your damn emails,\" Sanders exclaimed as the crowd in Las Vegas roared with applause. A smiling Clinton reached over to shake his hand and said, \"Thank you, Bernie .\"\nWhile the five candidates onstage took issue with each other, they also repeatedly sounded traditional Democratic themes — such as fighting income inequality — that are sure to carry over to the general election campaign against the Republicans. They also sought to cast the Republicans as a party focused on sowing division and denigrating minorities and women .\nThe debate was unlikely to shake up a race in which Clinton leads Sanders by double digits in national polls and remains the overwhelming favorite to win the Democratic nomination due to her financial and organizational advantages. But the Vermont senator has surprisingly emerged as her toughest competition, particularly in the early voting states of Iowa and New Hampshire which kick off the primary process .\nThroughout most of the two-hour debate Clinton played the role of aggressor, an unexpected shift for a candidate who had barely mentioned her Democratic rivals since launching her campaign six months ago .\nAfter Sanders, a self-described democratic socialist, derided \"a casino capitalist process by which so few have so much,\" Clinton said it would be a \"big mistake\" for the U.S. to turn its back on the system that built the American middle class. Asked whether she thought Sanders, who has a mixed record on gun control legislation, had been tough enough on the issue, she said simply,\" No, I do not .\"\nWhile Sanders is drawing big crowds on the campaign trail, he's largely unknown to many Americans. Tuesday's debate offered him a high-profile opportunity to cast himself as an electable alternative to Clinton and appeal for support beyond his liberal base .\nSanders has sought in particular to distinguish himself from Clinton over foreign policy, an issue where she is often more hawkish than others in the Democratic Party. The former secretary of state reiterated her call for more robust U.S. action to stop the Syrian civil war and defended her judgment on international issues, despite having voted for the 2003 invasion of Iraq .\nSanders called the Iraq war \"the worst foreign policy blunder in the history of our country\" and said he would not support sending American combat troops back to the Middle East to fight terrorism .\n\" Nobody does, Senator Sanders,\" Clinton interjected .\nThe only woman on stage, Clinton also highlighted the prospect of becoming the nation's first female president multiple times. When asked how her administration would differ from President Barack Obama's, she said with a smile, \"Being the first woman president would be quite a change .\"\nClinton's confident performance was likely to ease anxiety among supporters who have questioned her campaign's handling of the email controversy. One question still to be answered: how her showing will affect Vice President Joe Biden's decision about making a late entry into the Democratic race. Biden, who is expected to announce his decision within days, watched the debate at his residence in Washington .\nThe Democratic contest has largely been overshadowed by the Republican primary, where more than a dozen candidates are fighting to overtake billionaire Donald Trump. The real estate mogul made his presence known Tuesday night, sending a torrent of Twitter commentary on the Democrats' performances .\n\" Sorry, there is no STAR on the stage tonight!\" he wrote .\nWhile the Republican primary has been roiled by the emotional debate over immigration, the Democratic candidates were largely united in their call for providing a path to legal status for the millions of people currently in the U.S. illegally. The party is counting on general election support from Hispanics, a group that overwhelmingly voted for Obama in 2012\nJoining Clinton and Sanders on stage in Las Vegas was a trio of low-polling candidates looking for a breakthrough moment: former Maryland Gov. Martin O'Malley; Jim Webb, a former Navy secretary and U.S. senator from Virginia, and former senator and governor Lincoln Chafee, the Republican-turned independent-turned Democrat from Rhode Island .\nFor Clinton, the debate was a much-needed opportunity to focus on policy in addition to the controversy over her exclusive use of personal email and a private Internet server during her tenure in the Obama administration. The email issue has shadowed her rollout of numerous policy positions and has hurt her standing with voters .\nClinton said her email use \"wasn't the best choice\" and cast the issue as a politically motivated effort by Republicans to drive down her poll numbers. She highlighted comments from a Republican House leader, Rep. Kevin McCarthy, who bragged about how a House committee investigating Clinton's role in the deadly 2012 attacks in Benghazi, Libya, had hurt her politically .\n\" I am still standing,\" she said .\nThe former secretary of state has also faced criticism that she's shifted her positions on trade, gay marriage and other issues to match the mood of voters — a charge she vigorously denied Tuesday .\n\" Like most human beings, I do absorb new information, I do look at what's happening in the world,\" Clinton said. Pressed specifically on her newly announced opposition to a Pacific Rim trade deal she touted while serving in the Obama administration, Clinton said she had hoped to support it but ultimately decided it did not meet her standards .", "external_links": [], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-14T18:55:38.929+03:00", "highlightTitle": ""}