{"organizations": ["St. Mark", "Wilmington Friends", "Wilmington Friends School"], "uuid": "d2f757c395211be6a0f5219f3b5542008a23beef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.delawareonline.com", "main_image": "http://www.gannett-cdn.com/-mm-/a5df4b095e46fab21f97eb9022090406e54a6271/c=0-36-1989-1160&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/16/Wilmington/Wilmington/635806146076833059-091515-FRIENDS-v-St.-MARKS-wb33535.JPG", "site_section": "http://rssfeeds.delawareonline.com/wilmington-sports", "section_title": "Wilmington - Sports", "url": "http://www.delawareonline.com/story/sports/high-school/2015/10/19/athlete-week-alyssa-nathan/74056128/", "country": "US", "title": "Wilmington Friends setter Nathan keeps powerful offense rolling", "performance_score": 0, "site": "delawareonline.com", "participants_count": 0, "title_full": "Wilmington Friends setter Nathan keeps powerful offense rolling", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T14:14:00.000+03:00", "replies_count": 0, "uuid": "d2f757c395211be6a0f5219f3b5542008a23beef"}, "author": "", "url": "http://www.delawareonline.com/story/sports/high-school/2015/10/19/athlete-week-alyssa-nathan/74056128/", "ord_in_thread": 0, "title": "Wilmington Friends setter Nathan keeps powerful offense rolling", "locations": ["Wilmington"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["ALYSSA NATHAN", "Nathan", "Alyssa Nathan", "Brad Myers"], "text": "Wilmington Friends setter Nathan keeps powerful offense rolling Brad Myers , The News Journal 7:14 a.m. EDT October 20, 2015 Friends volleyball athlete of week Alyssa Nathan. Brad Myers Buy Photo Wilmington Friends' Alyssa Nathan during Friends' 3-0 win against St. Mark's at Wilmington Friends School in September. (Photo: WILLIAM BRETZGER/THE NEWS JOURNAL) Buy Photo 3 CONNECT 4 TWEET LINKEDIN COMMENT EMAIL MORE ALYSSA NATHAN, junior, Wilmington Friends volleyball \nTHE WEEK: Had 27 assists, seven digs, three kills, one ace and two blocks in a 3-0 victory over Tower Hill last Tuesday. Added 29 assists, seven digs, three blocks, a kill and an ace in a 3-0 win over Sanford on Wednesday. \nTHE EFFORT : “I give my 100 percent in every game,” Nathan said. “If one of my skills fails me, then I try to make up for it in just hard work and determination.” \nTHE COACH SAYS: “Alyssa’s work ethic probably makes her one of the most valuable players in the state,” Quakers coach Barb Fitzgerald said. “She never gives up. She works so hard at practice, no matter what drill we are doing.” \nTHE SETS : Nathan’s primary job is to get the ball to hitters Danielle Nathan (her sister), Alexandra Musi and Delaney Martin in the right place for a kill. “Each of the hitters likes it a little different,” she said. “… You’ve got to change your sets to please the hitters, because at the end of the day they are going to smash the ball. I’m just setting them up to do their job.” \nTHE VERSATILITY : Nathan leads the Quakers in assists, but often scores in every category during a match. “She definitely is one of our best servers,” Fitzgerald said. “And she clearly plays a lot of defense, and does not mind getting set once in a while for a kill.” \nTHE GOALS : The Quakers are 9-1, the only loss coming to Padua on Sept. 18. Friends faces a big test against defending state champion Archmere on Tuesday. “Hopefully, we’ll keep progressing through the end of the season and into the state tournament,” Nathan said. “But really, we just try to focus one game at a time, one point at a time really.” \nTHE CLASSROOM : “I like math. That’s what I’m really passionate about,” Nathan said. “It’s really fascinating to me, the complexity of numbers and the way you can manipulate them to explain almost everything.” \nTHE FUTURE: Nathan would like to continue playing volleyball in college, but not at the highest level. She is considering several small colleges on the East Coast. \nSend Athlete of the Week nominations to bmyers@delawareonline.co m 3 CONNECT 4 TWEET LINKEDIN COMMENT EMAIL MORE Read or Share this story: http://delonline.us/1LH5Uih TOP VIDEOS", "external_links": [], "published": "2015-10-20T14:14:00.000+03:00", "crawled": "2015-10-21T01:43:55.874+03:00", "highlightTitle": ""}