{"organizations": [], "uuid": "431ac16f17f90f6bab1504e7aa999c19673b1ae5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48531/sports", "section_title": "Sports - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30248026/oyo-sports-names-scott-healy-new-president-and-chief-executive-officer", "country": "US", "title": "OYO Sports Names Scott Healy new President and Chief Executive Officer", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "OYO Sports Names Scott Healy new President and Chief Executive Officer - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "431ac16f17f90f6bab1504e7aa999c19673b1ae5"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30248026/oyo-sports-names-scott-healy-new-president-and-chief-executive-officer", "ord_in_thread": 0, "title": "OYO Sports Names Scott Healy new President and Chief Executive Officer", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " OYO Sports\nHealy will drive innovation to develop new levels of interactive play and engagement for young sports fans\nBOSTON , Oct. 13, OYO Sports , the leading manufacturer of licensed sports minifigures across the major U.S. sports leagues, today announced the appointment of Scott Healy as President and Chief Executive Officer, effective October 12, 2015 . Healy will help OYO Sports build on its fast-growing minifigure business and create new ways for young sports fans to engage with their favorite teams and players through innovative toys, games, and interactive experiences.\nSince its launch in 2011, OYO Sports has sold over four million minifigures of players from Major League Baseball (MLB), the National Football League (NFL), the National Hockey League (NHL), Major League Soccer (MLS), and more than 60 major colleges and universities. OYO Sports' patented technologies and production processes make it uniquely capable of responding to the rapidly changing landscape of player-team affiliations, and to the quickly shifting trends in player popularity over the course of a sports season. As a result, leagues and players associations have embraced OYO Sports as a new way to connect young sports fans with their favorite teams and athletes.\n\"I'm thrilled to join the OYO Sports team,\" said Scott Healy , President and CEO of OYO Sports. \"As a parent of four children who love sports, I understood the power and potential of the OYO Sports brand as soon as I saw my first OYO Sports minifigure. Until OYO, there hasn't been a compelling option for young kids to build, collect and play with toys related to their favorite athletes and teams. OYO Sports is just scratching the surface of what it can do to foster kids' passion for sports through toys, games, and digital experiences that harness the universal joy and fun of being a sports fan. I'm excited to help the company fulfill that potential.\"\nHealy comes to OYO Sports with more than 20 years of leadership experience at innovative, customer-driven businesses, where he has taken traditional offline products and services into the digital space. Most recently, Scott helped build Care.com into the world's largest online marketplace for care services. As Executive Vice President and General Manager, he managed multiple business units representing the bulk of Care.com's revenues, from shortly after the company's founding through its IPO in 2014. In addition to helping build Care.com's core consumer marketplace in the U.S., he also led the company's international expansion and diversification into new lines of business.\n\"We were thrilled to be able to attract Scott to lead this fast growing company to the next level,\" said Jeff Patterson , Partner at Columbia Capital and OYO Sports Board Member. \"Bringing innovative technologies to the world of sports presents an opportunity to engage fans beyond physical products to a deeper level of immersion and engagement, and Scott's experience building digital businesses will be a big asset to OYO Sports moving forward.\"\nTom Skripps , OYO Sports Founder and former CEO, added, \"As I take my place on the Board of Directors, I know that OYO Sports is in the right hands with Scott leading us into the next generation of fan engagement. There is huge potential for OYO to become the defining brand at the intersection of sports and media with interactive toys and technology for kids.\"\nOYO Sports investors include Accomplice (formally Atlas Venture), Boston Seed Capital, and Mandalay Sports Media. Mandalay Sports Media's investors include Columbia Capital, Rho Ventures, Creative Artists Agency and Peter Guber , Chairman and CEO of Mandalay Entertainment and current owner of three professional sports franchises in the NBA, MLB and MLS.\nTo learn more about OYO Sports and to view the nearly 2,000 unique individual athlete minifigures, please visit the website at: www.oyosports.com .\nABOUT OYO SPORTS\nOYO Sports is a fan engagement company in the sports consumer marketplace, targeting the youth fan and collector markets. The company is the leading manufacturer of buildable mini-figures of athletes in major professional sports leagues including Major League Baseball, the National Football League, the National Hockey League, and Major League Soccer, as well as more than 60 colleges and universities. OYO Sports investors include Accomplice (formally Atlas Venture), Boston Seed Capital, and Mandalay Sports Media. Mandalay Sports Media investors include: Columbia Capital, Creative Arts Agency and Rho Ventures. The company is located in Acton, Massachusetts and all products are designed and built with pride in America from U.S. and globally sourced parts. For more information, visit www.oyosports.com .\nPhoto - http://photos.prnewswire.com/prnh/20151012/276272\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/oyo-sports-names-scott-healy-new-president-and-chief-executive-officer-300158620.html\n ", "external_links": ["http://www.prnewswire.com/news-releases/oyo-sports-names-scott-healy-new-president-and-chief-executive-officer-300158620.html", "http://www.xmlnews.org/ns/", "https://photos.prnewswire.com/prnvar/20151012/276272", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.oyosports.com&esheet=50885118&newsitemid=20140612005612&lan=en-US&anchor=www.oyosports.com&index=1&md5=04827159681d0356a8b23bde3db9bdfb", "http://www.oyosports.com/", "http://rt.prnewswire.com/rt.gif?NewsItemId=NE26388&Transmission_Id=201510130912PR_NEWS_USPR_____NE26388&DateId=20151013", "http://photos.prnewswire.com/prnh/20151012/276272"], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-14T02:08:11.930+03:00", "highlightTitle": ""}