{"organizations": [], "uuid": "eb4718b4857456981b96c46160f28c6b82138349", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "", "site_section": "http://bostonherald.com/sports", "section_title": "Sports | Boston Herald", "url": "http://bostonherald.com/sports/other/tennis/2015/10/nadal_beats_pospisil_to_reach_china_open_quarters", "country": "US", "title": "Nadal beats Pospisil to reach China Open quarters", "performance_score": 0, "site": "bostonherald.com", "participants_count": 1, "title_full": "Nadal beats Pospisil to reach China Open quarters | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "eb4718b4857456981b96c46160f28c6b82138349"}, "author": "Associated Press", "url": "http://bostonherald.com/sports/other/tennis/2015/10/nadal_beats_pospisil_to_reach_china_open_quarters", "ord_in_thread": 0, "title": "Nadal beats Pospisil to reach China Open quarters", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BEIJING — Rafael Nadal moved into the quarterfinals of the China Open with a 7-6 (3), 6-4 victory over Canada's Vasek Pospisil on Wednesday.\nThe third-seeded Spaniard picked up his game considerably following his first-round victory over the 230th-ranked Chinese wild card Wu Di, during which he was broken four times.\nAgainst Pospisil, Nadal only faced one break point — and he saved it.\nAlso Wednesday, second-seeded Tomas Berdych lost 6-4, 6-4 to Pablo Cuevas in the first round, just two days after winning his first title of the year in the rain-delayed Shenzhen final.\nThe second-seeded Berdych, the 2011 China Open champion, will now have to wait at least another week to secure a spot in the eight-player field for the ATP Finals in London.\nHe's currently in fifth place in the standings and has a lead of more than 300 points over his nearest competitor, Kei Nishikori.\nBerdych said the short turn-around after Monday's final in Shenzhen made it difficult to adjust to the conditions in Beijing.\n\"There was not really much time to get used to it,\" he said. \"So it's just really a matter of the day, if you are able to deal with it or not. Definitely I was not able to deal with the conditions.\"\nIn the women's draw, Agnieszka Radwanska of Poland, the fourth seed, advanced to the quarterfinals when Madison Keys retired from their third-round match with a thigh injury. The American lost the firs set 6-3 before calling it quits.\n\"This is not the way that I wanted to end up that match,\" Radwanska said. \"But as we all know the year is ending soon and we can see a couple of retirements.\"\nSeven women have retired or withdrawn from matches this week, including top seed Simona Halep and Eugenie Bouchard. Defending champion Maria Sharapova and Serena Williams also decided to skip the tournament, citing injuries.\nGermany's Angelique Kerber moved a step closer to qualifying for the WTA Finals with a dominant 6-2, 6-3 win over Caroline Wozniacki of Denmark. Kerber, who has won four titles this season, can qualify if she reaches the China Open final.\nWozniacki's loss means she is out of contention for the eight-woman field in Singapore.\nTimea Bacsinszky of Switzerland overcame five double faults to upset seventh-seeded Carla Suarez Navarro 6-4, 4-6, 7-5 to reach the quarterfinals in a nearly 2 1/2 hour match, and Sara Errani of Italy advanced with a 3-6, 6-3, 6-2 win over Germany's Andrea Petkovic.", "external_links": [], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-08T15:29:51.063+03:00", "highlightTitle": ""}