{"organizations": [], "uuid": "61c1ca2cc5239fceb22a39ac99a16008a493c532", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sportsnews.com.au", "main_image": "http://sportsnews.com.au/defaultimage.jpg", "site_section": "http://www.sportsnews.com.au/category/rugby-union/feed", "section_title": "Sports News Australia » Rugby Union News", "url": "http://www.sportsnews.com.au/rugby-union/hansen-to-seek-clarity-on-ref-decisons/161055", "country": "CA", "title": "Hansen to seek clarity on ref decisons", "performance_score": 0, "site": "sportsnews.com.au", "participants_count": 1, "title_full": "Hansen to seek clarity on ref decisons", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T21:28:00.000+02:00", "replies_count": 0, "uuid": "61c1ca2cc5239fceb22a39ac99a16008a493c532"}, "author": "AAP", "url": "http://www.sportsnews.com.au/rugby-union/hansen-to-seek-clarity-on-ref-decisons/161055", "ord_in_thread": 0, "title": "Hansen to seek clarity on ref decisons", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Hansen to seek clarity on ref decisons Posted by AAP + on 26/10/2015 at 6:28 am   \nAll Blacks coach Steve Hansen is to seek clarification on refereeing decisions ahead of the Rugby World Cup final against the Wallabies at Twickenham. \nDefending champions New Zealand battled a 14-6 penalty count before beating South Africa 20-18 to book their place in the title decider next weekend. \nThe Wallabies ensured a first trans-Tasman final in the tournament’s history by downing Argentina 29-15 in the second semi-final on Monday morning (NZT) \nHansen, speaking before Australia’s win, says he intends having a talk with World Rugby referees boss Joel Jutge in a bid to get consistency in rulings. \nHaving reviewed the video of the clash with the Springboks, he says his players were at fault for many of the decisions that referee Jerome Garces whistled against them. \nHis main concern was a call against No.8 Kieran Read for illegal entry to a maul. \nBut Hansen also felt the Springboks got away with incidents that the All Blacks were pulled up for. \n“A lot of the penalties were justified,” Hansen said. \n“The only concern I’ve got is, whilst we’re getting penalised for things, the same things were happening by the opposition and they weren’t, so that will be something else I’ll be talking about. \n“You just want consistency.” \nAustralia’s victory over Argentina means they will match the All Blacks in making a fourth appearance in a final. \nIt also means the winners will become the first to lift the Webb Ellis Cup for the third time. \nA hat-trick of tries to winger Adam Ashley-Cooper, and one to lock Rob Simmons, helped to propel the Wallabies past the Pumas, whose points all came from the boot of Nicolas Sanchez. \nBut there was the worrying sight for Australian fans of fullback Israel Folau leaving the field midway through the second half with a suspected flare-up of an ankle injury. \nMeanwhile, Hansen is expecting the All Blacks to lift their performance in the final. \nThe New Zealanders had gone into their semi-final after crushing France 62-13 and Hansen it was a difficult thing in sport “to go from great to great”. \n“Coming off what was a good performance, but not a great one by any stretch of the imagination, I think we will lift.”  ", "external_links": [], "published": "2015-10-25T21:28:00.000+02:00", "crawled": "2015-10-25T21:34:30.483+02:00", "highlightTitle": ""}