{"organizations": [], "uuid": "c69e30c05d529c95bc366cc3cce3bfd34814c5fb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.boston.com", "main_image": "http://p.o0bc.com/rf/image_1200x628/Boston/2011-2020/2015/10/15/Boston.com/BCOM/Images/Screen%20Shot%202015-10-15%20at%2010.09.13%20AM-4359.png", "site_section": "http://www.boston.com/", "section_title": "Boston, MA news, breaking news, sports, video | Boston.com", "url": "http://www.boston.com/sports/basketball/2015/10/15/watch-scott-van-pelt-set-the-record-straight-lamar-odom-basketball-player-not-reality-star/N2Kjsvg2jyvWCjWKbpCtTK/story.html", "country": "", "title": "Watch Scott Van Pelt set the record straight on Lamar Odom, basketball player not reality TV star - Basketball", "performance_score": 0, "site": "boston.com", "participants_count": 1, "title_full": "Watch Scott Van Pelt set the record straight on Lamar Odom, basketball player not reality TV star - Basketball", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "c69e30c05d529c95bc366cc3cce3bfd34814c5fb"}, "author": "boston.com", "url": "http://www.boston.com/sports/basketball/2015/10/15/watch-scott-van-pelt-set-the-record-straight-lamar-odom-basketball-player-not-reality-star/N2Kjsvg2jyvWCjWKbpCtTK/story.html", "ord_in_thread": 0, "title": "Watch Scott Van Pelt set the record straight on Lamar Odom, basketball player not reality TV star - Basketball", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Lamar Odom’s life is at the intersection of sports and culture.\nSure, he was featured on “Keeping Up with the Kardashian” and “Khloe and Lamar.”\nBut Wednesday night on ESPN’s “SportsCenter,” anchor Scott Van Pelt wanted to set the record straight, noting that Odom earned his fame as a basketball player—not a reality TV star.\nAdvertisement - Continue Reading Below The former NBA Star won two NBA Championships and was the 2011 sixth man of the year. He was the fourth-overall pick of the 1999 NBA Draft, after having a successful college career at University of Rhode Island.\nWhen he was found unresponsive at a legal Nevada brothel on Tuesday , headlines at publications—including this one—highlighted his status as a former reality TV star or his marriage with Khloe Kardashian.\n“Kardashian reality star? No, no, no. Lamar Odom—unlike those whose fame is like oxygen, whose fame comes in the absence of accomplishment—his fame was earned, as sixth man of the year, as a multiple NBA champion, as the result of his significant role with the Los Angeles Lakers team, and being a beloved NBA teammate and peer,” Van Pelt said. “His name is Lamar Odom and we knew it long before he got married on a TV show we don’t watch.”\nListen to his complete thoughts on Odom here .\nThe greatest Boston Celtics of all time\nPrevious -- of -- Next The first great Celtic and one of the best point guards of all time, Bob Cousy won six championships in his 14 seasons with Boston. AP Photo Previous -- of -- Next Bill Sharman (far right) played 11 seasons with the Celtics beginning in 1951, and teamed with Cousy to create one of the more formidable backcourts in NBA history. Sharman won four championships with the Celts and averaged 17.8 points per game in his career en route to the Hall of Fame. Globe File Photo Previous -- of -- Next The greatest champion of all-time, Bill Russell won 11 titles with the Celtics between 1957-1969. AP/Gerald Herbert Previous -- of -- Next Hall of Fame shooting guard Sam Jones won 10 championships as a Celtic, appearing in five All-Star games while scoring15,411 career points. Vernon Biever / Getty Images Previous -- of -- Next Now best known as the voice of the Celtics, Hall of Famer Tommy Heinsohn won eight titles as a player, then two more as a coach in 1974 and 1976. Neil Leifer/Getty Images Previous -- of -- Next Advertisement Previous -- of -- Next K.C. Jones played nine seasons in the NBA - all with the Celtics - and won eight championships. The tenacious defender also coached the Celts to two more titles in the 80s. Chip Somodevilla/Getty Images Previous -- of -- Next John Havlicek is the Celtics all-time leading scorer, an eight-time champion and of course ... stole the ball. O'Brien, Frank Globe Staff Previous -- of -- Next The Celtics first-round pick in 1970, Dave Cowens won two championships, a rookie of the year award and a league MVP while averaging 17.6 points and 13 rebounds per game during his 11 seasons. Ronald C. Modra/Sports Imagery Previous -- of -- Next A defensive specialist who could shoot a little too, Satch Sanders won eight rings with the Celtics in the 1960s and coached the team for a brief stretch in 1978 and 1979. Stephan Savoia/AP Previous -- of -- Next Two-time NBA champion Jo Jo White was the MVP of the Finals in 1976, and played 488 consecutive games across parts of six seasons in the 1970s. Boston Celtics photo Previous -- of -- Next Advertisement Previous -- of -- Next Paul Silas, a strong, tough big man who could rebound and defend with the best of them, played five seasons with the Celtics and won two championships. He made two NBA All-Defensive teams with Boston, and played on two all-star teams. AFP Photo Previous -- of -- Next Bridging the gap from the 1960s (Russell) to the 1970s (Havlicek) into the 1980s, Larry Bird won three championships, two Finals MVPs and three straight league MVP awards from 1984-1986. Tom Landers/The Boston Globe Previous -- of -- Next One of the best post players of all time, Kevin McHale won three championships, made seven All-Star teams, took home two Sixth Man of the Year awards and shot 58 percent in 39 minutes per game in the 1987 playoffs on a broken foot. The Boston Globe/ Wendy Maeda Previous -- of -- Next Robert Parish played the longest of any member of the original Big 3, lasting 21 seasons and 1,611 regular season games and 184 playoff games -- the most in NBA history. Jon Chase/AP Previous -- of -- Next Larry Bird once caled Dennis Johnson the best teammate he's ever had. A high-flying scorer in his early career with Seattle and then Phoenix, DJ made himself into a playmaker and deadly spot-up shooter with the Celtics. Globe file photo Previous -- of -- Next Advertisement Previous -- of -- Next Reggie Lewis was on his way to a potential Hall-of-Fame career before his life was cut so tragically short in July of 1993. Lewis played six seasons for the Celtics, and led the team in minutes and points in his final three. Rocky Widner/Getty Images Previous -- of -- Next Paul Pierce spent 15 seasons with the Celtics, becoming the second leading scorer in franchise history and a champion in the process. He made 10 All-Star teams as a Celtic. Jim Davis/The Boston Globe Previous -- of -- Next Kevin Garnett only played for the Celtics for five years, but they were among the more memorable in team history. Garnett's arrival completed the second Big 3 and led to a championship and another Finals berth two seasons later. Jim Davis/Globe Staff Previous -- of -- Next The third leg of the new Big 3, Ray Allen won his first ring, scored 51 points in a 2009 playoff game, made a record eight 3-pointers in a Finals game and became the all-time leader in 3-poiners made -- all as a Celtic. Mike Ehrmann/Getty Images Previous -- of -- Next Before he was traded to Dallas, Rajon Rondo was the Celtics best point guard since Dennis Johnson. His ability to make extremely tough passes at ridiculous angles made him one the most unique Celtics ever. Mike Lawrie/Getty Images Previous -- of -- Next Advertisement Previous -- of -- Next Arguably the second best coach in Celtics history, Doc Rivers steered his team to a championship in 2008, and within less than a quarter of a second one two seasons later. Doc won 416 games in his nine seasons in Boston. Jim Rogash Previous -- of -- Next The patriarch, Arnold \"Red\" Auerbach has 16 rings and is responsible for just about everyone on this list wearing a Celtics uniform. Phil Jackson may have passed him in most titles won as a coach, but there's never been anyone better than Red. Danny Goshtigiajn/The Boston Globe", "external_links": ["http://www.youtube.com/watch?v=1zlo2bG5vBs"], "published": "2015-10-15T03:00:00.000+03:00", "crawled": "2015-10-16T08:04:47.031+03:00", "highlightTitle": ""}