{"organizations": [], "uuid": "77699e029aa5a823d4e4f1e045f6c06998b2f263", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "", "site_section": "http://www.tribuneindia.com/", "section_title": "The Tribune, Chandigarh, India : Latest news, India, Punjab, Chandigarh, Haryana, Himachal, Uttarakhand, J&amp;K, sports, cricket ", "url": "http://www.tribuneindia.com/news/punjab/tension-in-punjab-as-bandh-follows-kotkapura-firing/146332.html", "country": "US", "title": "Tension in Punjab as bandh follows Kotkapura firing", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "Tension in Punjab as bandh follows Kotkapura firing", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "77699e029aa5a823d4e4f1e045f6c06998b2f263"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/punjab/tension-in-punjab-as-bandh-follows-kotkapura-firing/146332.html", "ord_in_thread": 0, "title": "Tension in Punjab as bandh follows Kotkapura firing", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tribune News Service\nChandigarh, October 15\nA day after two Sikh activists were killed in police firing in Kotkapura during protests over the desecration of a ‘bir’ of Guru Granth Sahib, tension continued in the area on Thursday as members of the community took to the streets on a call for bandh in the state. EARLIER STORY: 2 dead in Kotkapura police firing There is complete bandh in Moga city. All national highways and major link roads have been blocked in the district. In Muktsar, a large number of protesters have gathered on the Malout-Bathinda highway to ensure a block. There was also complete bandh in Gidderbaha town and Lambi village, while the closure was partial in Muktsar and Malout towns. Most private buses were off the roads in Faridkot. Private schools were closed in Faridkot, Kotkapura and Jaitu, while there was thin attendance in government schools. An incident of firing by Sikh activists was reported at Jogewala village, but no injury was reported. In Ferozepur, hundreds of Sikh activists bearing swords and other weapons have blocked the Ferozepur-Moga highway, and most of the schools and commercial establishments were closed in the city. The police were trying to take possession of the bodies the two Sikh activists killed in police firing on Wednesday, for post-mortem. However, the families of the deceased are opposing it and have taken the bodies to their village. There was a large gathering of sympathisers at Sarawan, the village of one the dead, Gurjit Singh. Gurjit Singh's family is awaiting the return of his father and brother from Kenya for the cremation. A large number of residents of Jaitu and Bargari area villages are reaching Sarawan and Niamiwala to pay homage to deceased. Sikh organisations also blocked the Jammu-Pathankot highway. In Jalandhar, protesters jammed PAP Chowk, near which the Deputy Chief Minister's helicopter was scheduled to land. Dharnas were also reported at other intersections in the city. Meanwhile, AAP MP Bhagwant Mann and state Congress president Partap Singh Bajwa also reached Kotkapura to extend support to the protesting Sikhs. — With inputs from Faridkot, Moga, Ferozepur, Jalandhar", "external_links": [], "published": "2015-10-15T03:00:00.000+03:00", "crawled": "2015-10-15T11:47:20.965+03:00", "highlightTitle": ""}