{"organizations": ["Hornets", "Mercedes-Benz Arena", "Los Angeles Clippers", "TWN SHARE Tweet", "Charlotte Hornets"], "uuid": "80691405035338a57be2d811f0d3928d93a661e8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chinapost.com.tw", "main_image": "http://www.chinapost.com.tw/news_images/20151016/p13a.jpg", "site_section": "http://www.chinapost.com.tw/rss/sports.xml", "section_title": "China Post Online - Sports News", "url": "http://www.chinapost.com.tw/sports/basketball/2015/10/16/448442/Jeremy-Lin.htm", "country": "", "title": "Jeremy Lin leads Hornets to victory in Shanghai", "performance_score": 0, "site": "chinapost.com.tw", "participants_count": 0, "title_full": "Jeremy Lin leads Hornets to victory in Shanghai", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T19:02:00.000+03:00", "replies_count": 0, "uuid": "80691405035338a57be2d811f0d3928d93a661e8"}, "author": "", "url": "http://www.chinapost.com.tw/sports/basketball/2015/10/16/448442/Jeremy-Lin.htm", "ord_in_thread": 0, "title": "Jeremy Lin leads Hornets to victory in Shanghai", "locations": ["SHANGHAI", "Shanghai"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jeremy Lin"], "text": "Jeremy Lin leads Hornets to victory in Shanghai AFPOctober 16, 2015, 12:02 am TWN SHARE Tweet SHANGHAI -- Jeremy Lin scored the first 10 points for the Charlotte Hornets as they soundly defeated the Los Angeles Clippers 113-71 in a preseason game in Shanghai's Mercedes-Benz Arena. \n\"After I made my first three pointer, I was in the zone. I felt all my shots would go in,\" Lin said. \nThe 27-year-old guard signed with the Hornets in a free agent deal this summer worth US$4.3 million over two years. He finished the game with 13 points in 16 minutes of play. \nCenter Al Jefferson led the team with 17 points and small forward Nicolas Batum added 14 points, 10 rebounds and five assists. \n\"Our goal was to play better by the end of the trip and we certainly did that,\" said Hornets coach Steve Clifford. \"On offense we wanted more ways to create. We were able to do that with perimeter players who can handle the ball and big guys who can shoot the three.\" \nAll-Star Blake Griffin contributed with 14 points and 12 rebounds for Los Angeles. Point guard Chris Paul returned to action to lead the team with 17 points. \nWhile the crowd briefly serenaded Paul with chants \"MVP,\" — Most Valuable Player — Lin was the most popular player in the game. \nHis reception was only surpassed by brief on-court appearances by retired basketball legends Yao Ming and Michael Jordan. \nOn Sunday, the two teams played the first NBA game in Shenzhen. The Hornets won that game 106-94 with Lin scoring 16 points in 28 minutes. \n\"I wished we had played better, but from a team bonding perspective, this trip was great,\" said Los Angeles Clippers coach Doc Rivers. \nIn 2012, Lin inspired \"Linsanity\" when he came off the bench to spark a winning streak by the injury-riddled New York Knicks. \nDespite praising Lin's performance as a starter, Clifford said he would continue to experiment with the team's lineup in the four remaining preseason games. \nBest known for being a point guard, Lin is confident that he can fit playing alongside current Hornets point guard Kemba Walker. \n\"I'm very comfortable playing off the ball,\" Lin said. \"I played shooting guard growing up and in four years of college. Right now, no one cares who scores as long as we score.\" SHARE", "external_links": [], "published": "2015-10-15T19:02:00.000+03:00", "crawled": "2015-10-16T13:08:27.786+03:00", "highlightTitle": ""}