{"organizations": [], "uuid": "ba36cc0bdbe0332e8c975a512dd979f22b93b339", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nytimes.com", "main_image": "http://static01.nyt.com/images/2015/10/14/nytnow/rugby15/rugby15-facebookJumbo.jpg", "site_section": "http://www.nytimes.com/services/xml/rss/nyt/InternationalSports.xml", "section_title": "NYT &gt; International Sports", "url": "http://www.nytimes.com/2015/10/15/sports/rugby/argentina-rugby-world-cup-pumas-attacking-style.html", "country": "US", "title": "Argentina’s Pumas Impress With New Offensive Flair - The New York Times", "performance_score": 0, "site": "nytimes.com", "participants_count": 1, "title_full": "Argentina’s Pumas Impress With New Offensive Flair - The New York Times", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T14:17:00.000+03:00", "replies_count": 0, "uuid": "ba36cc0bdbe0332e8c975a512dd979f22b93b339"}, "author": "Emma Stoney", "url": "http://www.nytimes.com/2015/10/15/sports/rugby/argentina-rugby-world-cup-pumas-attacking-style.html", "ord_in_thread": 0, "title": "Argentina’s Pumas Impress With New Offensive Flair - The New York Times", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Continue reading the main story Share This Page Continue reading the main story Continue reading the main story WELLINGTON, New Zealand — For those who have not followed Argentina’s development in the Rugby Championship, its ambitious and attacking style of play at the Rugby World Cup might come as a surprise.\nIn fact, it is a style that the Pumas have been developing over the past four years.\n“Last year we started playing more attacking rugby. It was good for us. It’s the type of rugby we have to play in order to develop our team,” Argentina scrumhalf Tomás Cubelli said earlier this year.\nThe need for Argentina to change from its set-piece oriented, conservative style — which many of its players were used to at their clubs in France and England — was highlighted after the Tri-Nations competition was expanded in 2012 to include Argentina and renamed the Rugby Championship. The three Tri-Nations teams — Australia, New Zealand and South Africa — played much more open rugby, and Argentina knew it would have to adapt to stand a chance against its higher-ranked opponents.\nGraham Henry, who led New Zealand to the World Cup title in 2011, was brought in as a technical adviser for the Pumas. His first goal was simple: improving the players’ basic skills so they could play an all-around game mixing both offense and defense.\nThe Pumas have always had a formidable scrum that could match up with the best in the world and a ferocious defense, but they were also a team that struggled to build sustained attacks because their ball-handling skills often were subpar. Quite often instead they relied on individual brilliance.\nBut that is now much less the case.\nThe players’ skill levels improved dramatically under Henry and Argentina’s former coach, Santiago Phelan.\nBut more importantly, under current Argentina Coach Daniel Hourcade, there has also been a shift in mind-set. No longer does Argentina just want to restrict the number of points scored against them — the players seem confident enough to want to challenge defenses by keeping the ball and playing a more wide-open game.\nIt has not always been a smooth transition, something that Cubelli acknowledged in July before a Rugby Championship match against New Zealand in Christchurch.\n“Maybe we were not ready to take the risk in the first two years,” Cubelli said. “Taking the risk we were maybe knowing that some games we were not going to get the results that we want.\n“We were not used to attacking, and we attacked a lot and lost the ball, and that was difficult for us. Now we’re getting a balance in our game.”\nIn those first two years the players, especially those coming from European club rugby, did find it difficult when they faced the more attack-minded teams of New Zealand and Australia and, to a lesser extent, South Africa.\nIn 2012 and 2013 the Pumas did not win a game in the Rugby Championship. Their best result was a 16-16 draw against South Africa in 2012, while the following year they suffered heavy losses to South Africa and Australia as fatigue took its toll on players who were based in Europe but had to play tests in the Southern Hemisphere. (In comparison, nearly all the national team players for Australia, New Zealand and South Africa compete in Super Rugby, so the tests are not at the end of a long domestic season for them and the strain from travel is far less.)\nAdvertisement\nContinue reading the main story Advertisement\nContinue reading the main story After Hourcade replaced Phelan in 2014, Argentina got its breakthrough win on home soil, against Australia in Mendoza, Argentina. Los Pumas were helped by some younger players who came up through the Argentina Rugby Union , along with better management of the team’s Europe-based players.\nThis year, Argentina grabbed its first Rugby Championship victory away from home when it defeated South Africa, 37-25, in Johannesburg with winger Juan Imhoff scoring a hat trick as the Pumas outscored the Springboks four tries to three.\nThe improvement should continue when an Argentine franchise is added next year as Super Rugby expands . Argentina has said it will only select players from Super Rugby for national team duty, which has resulted in several players — including the captain Agustín Creevy, Juan Martín Hernández and Pablo Matera — choosing to leave clubs in Europe to join the new franchise in Buenos Aires.\nThe Pumas’ more expansive style has been widely acclaimed at the Rugby World Cup, although sometimes the accuracy has been lacking when they are attacking. They scored 179 points in the pool stage, more than anyone else, including South Africa (176) and New Zealand (174).\nArgentina has scored 22 tries, just three fewer than New Zealand and one less than South Africa, and it leads several offensive statistical categories: most offloads made (50), most clean breaks (46) and most meters gained (2,687).\nArgentina’s 64-19 win against Namibia was its third consecutive pool match where both wingers scored tries, a clear indication of how much the Pumas’ game has developed.\nCreevy, a hooker, has epitomized Argentina’s progress. He has excelled in his core roles in the scrums and lineout and won turnovers at the breakdown while also showcasing offloading skills that have earned him the nickname “Sonny Bill Creevy” after New Zealand’s master of the offload, Sonny Bill Williams.\nArgentina’s improvement should make Ireland wary heading into their quarterfinal showdown on Sunday at Millennium Stadium in Cardiff, Wales.\nWhile most Irish fans are happy to miss out on facing New Zealand in the quarterfinals, their team will still face a formidable challenge from the Pumas.\nIt is a challenge that got considerably more difficult for Ireland following the loss of loose forwards Peter O’Mahony (knee injury) and Sean O’Brien (suspension) and the world-class lock and captain Paul O’Connell (torn hamstring). Flyhalf Johnny Sexton (groin injury) is also in doubt for Sunday’s match.", "external_links": ["http://www.uar.com.ar/"], "published": "2015-10-14T14:17:00.000+03:00", "crawled": "2015-10-14T13:44:58.184+03:00", "highlightTitle": ""}