{"organizations": [], "uuid": "a37467dbcc9b56cd900ffcec64a7afca0b4a9e9e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports/nfl", "section_title": "NFL News, Scores, Schedule, Standings, Stats, Photos, Videos - Football - MSN Sports", "url": "http://www.msn.com/en-us/sports/nfl/analyst-calls-griffin-iii-a-flat-out-jerk/ar-AAfwetJ", "country": "US", "title": "Analyst calls Griffin III a 'flat-out jerk'", "performance_score": 0, "site": "msn.com", "participants_count": 49, "title_full": "Analyst calls Griffin III a 'flat-out jerk'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T03:00:00.000+03:00", "replies_count": 64, "uuid": "a37467dbcc9b56cd900ffcec64a7afca0b4a9e9e"}, "author": "Dan Steinberg", "url": "http://www.msn.com/en-us/sports/nfl/analyst-calls-griffin-iii-a-flat-out-jerk/ar-AAfwetJ", "ord_in_thread": 0, "title": "Analyst calls Griffin III a 'flat-out jerk'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Analyst calls Griffin III a 'flat-out jerk' The Washington Post 8 hrs ago Dan Steinberg © Provided by Washington Post As we’ve seen, some observers believe that Kirk Cousins is treated differently than Robert Griffin III. Turns out this issue is also a topic in Chicago, where a local radio host brought it up during an interview with NBC Sports’ Rodney Harrison.\n[ Bomani Jones is the world’s biggest Cousins skeptic ]\nAdChoices “I was not a fan of Robert Griffin III the last year and a half, last couple years,” Jason Goff said this week during the Spiegel and Goff show on 670 The Score . “He was hurt, he seemed like he was saying all the wrong things. But Kirk Cousins is bad. And it seems like all the grenades that everyone is trying to fall over — because they were proved right that Robert Griffin III wouldn’t be a lasting, viable option — it seems like nobody is making the same comments about Kirk Cousins, who has been underwhelming at best, and who is getting to the point where he’s going to start losing football games for the Washington Redskins.”\n“Well first and foremost, we see every week that there’s a lot of bad quarterback play, so I think we’re used to that,” Harrison replied. “What we don’t see is guys being jerks at the quarterback position. And Robert Griffin III was a jerk. He was a flat-out jerk. And when you look at Kirk Cousins, he comes and he says all the right things. And he’s trying, he’s fighting, his team is out there supporting him, he’s doing everything he can to win.\n“We understand that you’re not going to be Tom Brady, you’re not a future Hall of Famer,” Harrison went on. “But I think we do respect that a guy’s out there fighting. You look at [Josh] McCown for the Cleveland Browns; he didn’t play particularly well a couple weeks ago, he comes back and throws for [457] yards or whatever it was. But I think we respect guys that work hard and try to do the right thing and stay humble. Robert Griffin didn’t do that, and he lost the respect of his teammates, as well as the guys in the media.”\n[ Aug. 31, 2015: Ryan Clark says RGIII lacks ‘meaningful locker room relationships’ ]\nAs early as last November, Harrison was advocating the Redskins cut ties with Griffin, far before this became a mainstream opinion.\n“I’ve seen enough. I don’t think he fits in the system. I think you have to get rid of him,” Harrison said after Griffin’s poor showing against the Buccaneers. “They’ve surrounded [Griffin] with great weapons. I just think it comes down to RGIII. I don’t think he can read coverages. The offensive line is really bad. Defensively they gave up a lot of plays. They have a lot of issues on this team.”\nBy the way, you’ll recall that a great many folks — present company included — suggested that Griffin would be an unbearable distraction if he remained on Washington’s roster as the third quarterback this season. That seems to have been, um, incorrect.\n(Via @Bearsoutsider )\nGo to MSN Home", "external_links": ["https://twitter.com/Bearsoutsider/status/654801449642135553", "https://www.washingtonpost.com/news/dc-sports-bog/wp/2015/10/16/how-espns-bomani-jones-became-the-worlds-biggest-kirk-cousins-skeptic/", "http://chicago.cbslocal.com/audio/670-the-score-interviews/670-the-score-interview-rodney-harrison-with-spiegel-goff-10132015/?utm_medium=projx&utm_source=projx_latest&utm_campaign=projx_latest-podcasts_podcast-interviews", "https://www.washingtonpost.com/news/dc-sports-bog/wp/2015/08/31/ryan-clark-says-rgiii-lacks-meaningful-locker-room-relationships/", "https://www.washingtonpost.com/news/dc-sports-bog/wp/2014/11/17/rodney-harrison-redskins-have-to-get-rid-of-robert-griffin-iii/", "http://go.microsoft.com/fwlink/?LinkID=286759"], "published": "2015-10-17T03:00:00.000+03:00", "crawled": "2015-10-18T02:26:15.184+03:00", "highlightTitle": ""}