{"organizations": [], "uuid": "6676f16d594493bc2cc48b6890a107703c5cb4a1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sun-sentinel.com", "main_image": "http://www.trbimg.com/img-56298cb6/turbine/fl-lake-worth-atlantic-recap-1023-20151022", "site_section": "http://www.sun-sentinel.com/sports/highschool/palm-beach", "section_title": "Palm Beach County High School Sports - Sun Sentinel", "url": "http://www.sun-sentinel.com/sports/highschool/football/palm-beach/fl-lake-worth-atlantic-recap-1023-20151022-story.html", "country": "US", "title": "Atlantic blanks Lake Worth to clinch postseason", "performance_score": 0, "site": "sun-sentinel.com", "participants_count": 1, "title_full": "Atlantic blanks Lake Worth to clinch postseason - Sun Sentinel", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T02:23:00.000+03:00", "replies_count": 0, "uuid": "6676f16d594493bc2cc48b6890a107703c5cb4a1"}, "author": "Pat Lammer", "url": "http://www.sun-sentinel.com/sports/highschool/football/palm-beach/fl-lake-worth-atlantic-recap-1023-20151022-story.html", "ord_in_thread": 0, "title": "Atlantic blanks Lake Worth to clinch postseason", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "DELRAY BEACH -- Second-ranked Atlantic shook off a slow start and rolled over Lake Worth 37-0 on Thursday in a District 10-8A clash to clinch a spot in the state playoffs.\nWith the victory, the Eagles improved to 8-0 overall and 5-0 in the district, while the Trojans fell to 4-5 and 1-4. Atlantic's win sets up a showdown with unbeaten Boca Raton on Oct. 30 for the district championship.\n\"It's definitely a step in the direction that we had goals, and trying to get better and make the playoffs this year,\" Atlantic coach T.J. Jackson said. \"So I am very proud of our kids.\"\nAtlantic allowed Lake Worth only one first down in the first half, but turnovers and penalties continually killed Eagles drives. Atlantic fumbled the ball away twice, threw an interception and had 50 yards in penalties over the first two quarters, going into halftime with a 14-0 lead.\nJunior receiver Don'Dre Swint put Atlantic up 7-0 in the first quarter with a 79-yard punt return for a touchdown. Atlantic went up 14-0 on a 25-yard TD pass from junior Zavion Thompson to 6-foot-3 sophomore Corey Gammage with 1:50 left in the half.\nIn the second half, it was all Atlantic. The Eagles racked up 23 consecutive points to pull away by 37.\n\"We've got to get in a groove from the beginning,\" Jackson said. \"We started out slow tonight. The fumbles hurt us, the penalties hurt us. But we'll get better. We know what we have to focus on this week.\"\nDontavius Monroe got things rolling for Atlantic in the second half. The senior running back put the Eagles up 21-0 with a 7-yard TD run with 5:20 left in the period.\nFellow senior running back Jerrod Ferguson then made it 28-0 on a 11-yard scoring run on the first play of the fourth quarter. Atlantic would tack on a safety and a 10-yard scoring pass from Thompson to Shawndarrius Phillips in the fourth quarter.\nAtlantic finished with 225 yards rushing on 37 carries. Monroe led the way with 97 yards on 14 carries.\nThompson completed 10 of 18 passes for Atlantic for 119 yards. The Eagles finished with just those three first-half turnovers.\nLake Worth finished with just two first downs. Atlantic made Lake Worth one dimensional with what it did do. The Trojans were 1-of-9 passing in the game for 5 yards and an interception.\n ", "external_links": ["http://www.trbimg.com/img-56298cb6/turbine/fl-lake-worth-atlantic-recap-1023-20151022"], "published": "2015-10-23T02:23:00.000+03:00", "crawled": "2015-10-24T06:43:14.600+03:00", "highlightTitle": ""}