{"organizations": [], "uuid": "0929618a79f7ac32b38ecc48e50288e964bb54c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ctpost.com", "main_image": "http://ww4.hdnux.com/photos/41/55/24/8836399/5/rawImage.jpg", "site_section": "http://www.ctpost.com/home/collectionRss/Homepage-Hcat-Sports-1690.php", "section_title": "Sports news", "url": "http://www.ctpost.com/sports/article/Brian-Koonz-A-mother-for-all-seasons-at-Central-6585586.php", "country": "US", "title": "Brian Koonz: A mother for all seasons at Central High School", "performance_score": 0, "site": "ctpost.com", "participants_count": 1, "title_full": "Brian Koonz: A mother for all seasons at Central High School", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T05:28:00.000+03:00", "replies_count": 0, "uuid": "0929618a79f7ac32b38ecc48e50288e964bb54c9"}, "author": "Brian Koonz", "url": "http://www.ctpost.com/sports/article/Brian-Koonz-A-mother-for-all-seasons-at-Central-6585586.php", "ord_in_thread": 0, "title": "Brian Koonz: A mother for all seasons at Central High School", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Buy photo Central football's \"Team Mom\" Vicki Robinson talks to the kids after their weekly dinner and motivational games at Central High School in Bridgeport, Conn. on Wednesday October 14, 2015. Central football's \"Team Mom\" Vicki Robinson talks to the kids after their weekly dinner and motivational games at Central High School in Bridgeport, Conn. on Wednesday October 14, 2015. Photo: Christian Abraham / Hearst Connecticut Media Brian Koonz: A mother for all seasons at Central High School 1 / 6 Back to Gallery \nBRIDGEPORT — James Eagles , the defensive end with the easy smile and the baritone voice, sat in a circle with 40 other football players from Central High School . \nThink duck-duck-goose, but with some of these boys stretching 6-feet tall with 200 pounds draped over powerful frames. \n“OK, who’s got something good they want to share?” asked Vicki Robinson , who answers to “Team Mom” or “Miss Vicki” when the boys call her cell phone looking for a ride, or maybe, some leftovers from the last team dinner. \nRobinson didn’t have to wait long for her first volunteer. More Information \n‘Pink Out’ at Central \nThe Central High football team will play Trumbull High on Friday at Kennedy Stadium in a “Pink Out” game. Kickoff is 6 p.m. The game is a fundraiser for the Norma Pfriem Breast Care Center and the Witness Project of Connecticut, which promotes awareness of breast cancer and cervical cancer. \nThe “Pink Out” game will feature performances by the University of Bridgeport’s Future Leaders of Hip Hop and United We Step. There will also be local vendors and representatives from Central High’s PTSA and student organizations. \nJames Eagles stood up, suddenly looking very much like a man wearing a boy’s face, and cleared his throat. All around him, heads turned and ears waited. \n“My teacher told me I was going to be one of the worst in the class,” said Eagles, immune to the dark poison of the words. “But today, I got a B-plus and it was the best grade in the class.” \nThe cheers and applause caught Eagles long before anyone could’ve tagged him in a duck-duck-goose game. It was a rapturous and wonderful affirmation in the city’s North End. \nFor too many kids like James Eagles, the bar is set so low you can kick it down the street. And yet, too many kids do just that because they swallow the poison and the slurs and the stereotypes. \nNot on Robinson’s watch. \nThe “Team Mom” without any kids on the team has 40 sons who know she loves them unconditionally. She is the constant for teenagers who crave stability and kindness, not doubts and more reasons to fail. \n“I’ve had kids who didn’t have electricity, kids who have a family life that you don’t even want to know about,” said Robinson, 47. “But even with all this stuff going on in their lives, they’re great kids. They just want to feel loved. They just want to know somebody cares about them.” \nSo Robinson and her husband, Malcolm, a former Central High football player himself, do exactly that. \nDuring the weeks when Central has a home game, Wednesday nights are magical at Kennedy Stadium. A team dinner is followed by team building, and a circle instantly changes when James Eagles and his buddies stand up in defiance of ignorance that exists only because we let it. \nSometimes, the buffet line in the cafeteria boasts Robinson’s homemade baked ziti, or her sausage and peppers. Either way, there’s a pretty good chance some garlic bread is nearby to soak up tiny puddles of sauce. \n“I’ve got kids calling me the next day saying, ‘Thank you so much because I won’t have food to eat for a couple of days until my mom gets her food stamps on Saturday,’ ” Robinson said, wishing there were even more leftovers to share. \n“Or, the kids wait to eat at school because that’s the only time they get to eat. It’s pretty bad for some of them, so I just try do what I can.” \nOther times, like one night last week, a stack of pizza boxes from Little Caesars is all that remains after 40 football players grab slices of so much more than pizza. \nSometimes, the toppings are hope and accountability. Other times, they are success and responsibility. \nBut always, the message is clear and compelling: Empty pizza boxes are disposable. These boys are not. \n“I’ve got kids from Fairchild Wheeler who get bused here. I’ve got kids who are foster kids. I’ve got kids who just got out of correctional facilities,” Robinson said. “One kid had to wear an ankle bracelet and he didn’t have cleats when he started. \n“He just had sneakers that were all loose and raggedy, but he wanted to play. We went to Marshalls and got him a pair of cleats for 20 bucks,” she said. “I’m not their coach, but I coach them off the field. Our coaches — Mike Farrell is our head coach — they’re phenomenal guys. We do it together.” \nVicki Robinson holds down three jobs to pay for the pizza, the sausage and peppers, and the cases of water and granola bars she brings to the games. You won’t find a better deal in the city, she’ll tell you. \nSo will James Eagles and the rest of this roster. \n“Miss Vicki, she’s like a second mom to us. She’s there when nobody else is,” Eagles said. “When we’re down, she picks us up. When we’re happy, she keeps us going.” \nThe team building lets these players check their urban masks by the fence, if only for an hour or two. \nYou don’t need to be a tough guy to build a human pyramid. You don’t need to be a tough guy to fall on the ground and make the letter “K” with 10 friends. \n“The kids love making human pyramids. We break up into teams and the biggest guys have to go on the bottom,” Robinson said. “I count 1-2-3 and yell, ‘Human pyramid!’ and the kids go crazy. \n“I have an 8-year-old son, Skylar, who is autistic, and he comes, too. He’s the team mascot. He picks who made the best pyramid. He loves it and the kids love him. He lights up the room when he walks in. \n“It’s been such a positive experience for everyone. Plus, it’s really helped Sky with his social skills. The guys all high-five him. We’ve really created a family here, and he’s a part of it, too.” \nOn Friday night, the Hilltoppers will play Trumbull High at Kennedy Stadium in a “Pink Out” game to raise money and awareness to fight breast cancer. \nLife is about helping each other, Robinson tells the boys. Football is just an excuse to put it in practice. \n“I was blessed. I grew up in Westport in a nice home and I never had to worry about having enough food or having a roof over my head,” Robinson said. “After my parents passed away, it made me a stronger person. I didn’t have that golden ticket anymore.” \nNow, Vicki Robinson is the golden ticket for 40 boys who sit in a circle and wait for the applause to tap them on the head. \nBrian Koonz is the Group Sports Editor/Content for Hearst Connecticut Media. Contact him at bkoonz@ctpost.com or @briankoonz on Twitter.", "external_links": [], "published": "2015-10-23T05:28:00.000+03:00", "crawled": "2015-10-23T06:06:08.710+03:00", "highlightTitle": ""}