{"organizations": [], "uuid": "38c6b59290024c98f71ada851638a6968923aa27", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sportsnews.com.au", "main_image": "http://sportsnews.com.au/defaultimage.jpg", "site_section": "http://www.sportsnews.com.au/category/afl/feed", "section_title": "Sports News Australia » AFL News", "url": "http://www.sportsnews.com.au/afl/giants-get-simpson-lose-hampton-townsend/160015", "country": "US", "title": "Giants get Simpson, lose Hampton, Townsend", "performance_score": 0, "site": "sportsnews.com.au", "participants_count": 1, "title_full": "Giants get Simpson, lose Hampton, Townsend", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T08:00:00.000+03:00", "replies_count": 0, "uuid": "38c6b59290024c98f71ada851638a6968923aa27"}, "author": "AAP", "url": "http://www.sportsnews.com.au/afl/giants-get-simpson-lose-hampton-townsend/160015", "ord_in_thread": 0, "title": "Giants get Simpson, lose Hampton, Townsend", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Giants get Simpson, lose Hampton, Townsend Posted by AAP + on 16/10/2015 at 4:00 pm   \nThe exit door at the Greater Western Sydney is swinging, with the AFL club losing two youngsters but gaining a ruckman on Friday. \nThe Giants have traded away midfielder Jacob Townsend to Richmond and defender Curtly Hampton to Adelaide, with unwanted Geelong ruck Dawson Simpson heading to GWS. \nThe club is likely to see many more departures during the AFL’s trade window, with Adam Treloar, Cam McCarthy and Tomas Bugg linked with moves away and four players – Liam Sumner, Jed Lamb, Andrew Phillips and Lachie Plowman – suggested to be moving to Carlton in a mega-deal. \nSimpson, who managed just 28 games in eight seasons for the Cats, has been drafted in as support for No.1 ruck Shane Mumford. \nMumford’s season-ending injury suffered in round 11 exposed the Giants, who won just four matches for the rest of the year without their dominant big man. \nGeelong won’t receive compensation for the free agent. \nTownsend comes relatively cheap for the Tigers, exchanged along with pick No.120 for Richmond’s fourth-round selection – No.70. \nThe 22-year-old managed just one game in the Giants’ breakout 2015 season due largely to injuries. \nBut Richmond’s football boss Dan Richardson believes they’ve plucked an unpolished diamond in the powerfully built Townsend, who stands at 186cm and weighs 89kgs. \n“A big-bodied midfielder is something we consider is a real need for us,” he said. \n“We’ve been watching GWS clearly quite closely over the last few years … we recruited Anthony Miles from the Giants a couple of years ago, and we are confident Jacob will make the same sort of impact Anthony has had over the last two seasons.” \nHampton, also 22, heads to the Crows with more AFL experience. \nThe Northern Territorian has managed 51 games for the Giants over four seasons, and makes the switch in exchange for Adelaide’s 2016 second-round draft pick. \nHampton said he’d be living out every footy fan’s dream under new coach Don Pyke. \n“I was a Crows fan as a kid, so I’m really excited to be here,” he said. \n“I really want to come in and cement my place at the club with hard work, I’ll get to know all the boys and build relationships with them and the coaches.” \nWhile Hampton evolved into a defender at the Giants, Adelaide say they believe he could play at half-back, half-forward or as a midfielder.  ", "external_links": [], "published": "2015-10-16T08:00:00.000+03:00", "crawled": "2015-10-16T08:23:07.533+03:00", "highlightTitle": ""}