{"organizations": [], "uuid": "ccfb38bd6fce839627641d10476835bf49d6af0c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.denverpost.com", "main_image": "http://extras.mnginteractive.com/live/media/site36/2015/1015/20151015__20151016_A6_CD16DPSJUMPPIC~p1.jpg", "site_section": "http://www.denverpost.com/", "section_title": "Colorado Breaking News, Sports, Weather, Traffic, Jobs - The Denver Post", "url": "http://www.denverpost.com/news/ci_28977202/charter-open-at-lincoln-high", "country": "US", "title": "Charter middle school to open at Lincoln High in Denver in 2016", "performance_score": 0, "site": "denverpost.com", "participants_count": 2, "title_full": "Charter middle school to open at Lincoln High in Denver in 2016 - The Denver Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T20:01:00.000+03:00", "replies_count": 1, "uuid": "ccfb38bd6fce839627641d10476835bf49d6af0c"}, "author": "Yesenia Robles", "url": "http://www.denverpost.com/news/ci_28977202/charter-open-at-lincoln-high", "ord_in_thread": 0, "title": "Charter middle school to open at Lincoln High in Denver in 2016", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A new charter middle school will open at Lincoln High School next fall, despite weeks of protests from students, parents, community activists and teachers and letters from City Council members.\nThe Board of Education for Denver Public Schools, however, did not approve all the district's original recommendations Thursday night: It voted to put two middle schools — rather than just one — in the Henry Middle School building.\nBoard members who supported the placements, all but Arturo Jimenez, cited the need for more high-achieving schools in the neighborhood.\n\"This is a proposal that is coming from this board,\" said board member Mike Johnson. \"We have a responsibility to use district facilities, to use district money in a way that's best for the greatest number of students. I think this is a fantastic program. I think it's going to work.\"\nSouthwest Denver community activists had started asking the board to create a plan to fix the area's schools last year, after a report showed the only schools in the area with the highest performance rating of \"distinguished\" are three charter schools, which have fewer than 1,000 students combined.\nThe board on Thursday took a different approach than staffers when it came to the district's new policy on school placement decisions.\nAdvertisement Using the policy, the district's staff had ranked the schools in order of priority they should be given at each of the available locations. However, board members questioned the way the staff applied the policy, particularly the way academic records of schools that had not opened were compared with schools such as Denver School of Science and Technology.\nSo while the DPS staff had recommended placing a new DSST at the Lincoln building, board members said it made more sense to place Compass Academy there because of programs for the English learners in that neighborhood. DSST instead will open at the Henry building, along with Bear Valley International.\nCompass provides English learners native language instruction and will give those students the opportunity to earn a seal of bi-literacy . Compass also committed to sharing some resources with Lincoln, such as City Year mentors .\nStudents, teachers and community activists disputed claims that there was room in the Lincoln building for a middle school, citing crowded hallways that made some students late for class, and teachers having to work from pushcarts because they had no assigned classroom.\n\"We have enough issues. How dare you make decisions about us without us,\" Patricia Cardenas, a senior at Lincoln, said at a past board meeting, citing a lack of space for teachers and a lack of books and saying students always run short of toiletries in the restrooms. \"Invest in books, invest in classrooms, and invest in music. Invest in my education in Lincoln, and fix Lincoln first.\"\nThe School Board election for three of seven members, including two incumbents, is weeks away. Some protestors had suggested they wouldn't re-elect board members who supported the middle school placement at Lincoln.\nJust before Thursday's vote, City Council members Paul Lopez, Debbie Ortega and Rafael Espinoza joined the opposition, signing letters asking DPS to abandon the Lincoln plans, in response to the community's concerns.\nThe school board previously approved four new schools for southwest Denver , including two charters and two programs designed by the district.\nCompass, which is one of those charters, opened this fall in a temporary shared space at Kepner Middle School.\nThree other approved schools asking to be placed in district-owned space have not opened. DPS officials believed there was only enough space, and only need, for two middle schools.\nIn other board action, the Denver board also approved the closing of Barrett Elementary School at the end of this school year. The students of Barrett, currently about 150, are going to be absorbed into the Columbine Elementary School next fall.\nThe student population has been declining at both schools. District officials said Barrett did not have enough funding, which is based on number of students, to keep up the program.\nYesenia Robles: 303-954-1372, yrobles@denverpost.com or @yeseniarobles", "external_links": ["http://padresunidos.org/fixlincolnfirst", "http://www.aplusdenver.org/_blog/A_Plus_Denver_News/post/press-release-ya-basta---enough-already/", "http://www.boarddocs.com/co/dpsk12/Board.nsf/files/A35DXH783E9C/$file/Barrett_Columbine_Recommendation_FINAL.pdf"], "published": "2015-10-16T20:01:00.000+03:00", "crawled": "2015-10-16T20:05:40.962+03:00", "highlightTitle": ""}