{"organizations": [], "uuid": "d158cc5e493f8d0ebae0ca4220333a5b1c49e7a8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "hawaiitribune-herald.com", "main_image": "http://hawaiitribune-herald.com/sites/hawaiitribune-herald.com/files/field/image/2326028_web1_white-golf-ball.jpg", "site_section": "http://hawaiitribune-herald.com/taxonomy/term/3/feed", "section_title": "Sports", "url": "http://hawaiitribune-herald.com/sports/local-sports/golf-yabuta-aces-hilo-muni-again-and-again", "country": "US", "title": "Golf: Yabuta aces Hilo Muni again – and again", "performance_score": 0, "site": "hawaiitribune-herald.com", "participants_count": 1, "title_full": "Golf: Yabuta aces Hilo Muni again – and again", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T14:25:00.000+03:00", "replies_count": 0, "uuid": "d158cc5e493f8d0ebae0ca4220333a5b1c49e7a8"}, "author": "nefeeder", "url": "http://hawaiitribune-herald.com/sports/local-sports/golf-yabuta-aces-hilo-muni-again-and-again", "ord_in_thread": 0, "title": "Golf: Yabuta aces Hilo Muni again – and again", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Golf: Yabuta aces Hilo Muni again – and again Published October 14, 2015 - 1:25am By MATT GERHART Hawaii Tribune-Herald \nDuring consecutive years in the mid-1990s, Eric Yabuta advanced to the U.S. Amateur Public Links Championships with qualifying rounds at Hilo Municipal Golf Course. \nYabuta is 62 and retired these days, but he’s a 1.9-handicap and still is accomplishing notable feats at Hilo Muni. \nDuring consecutive days at the end of September, Yabuta stepped up to the par-3 16th hole, gripped a 4-iron and made a hole-in-one, rolling in his sixth and seven aces. \n“I just try to hit the green,” Yabuta said. “That’s the first time I’ve gone back to back like that.” \nYabuta prefers some of the longer holes on the course, but he if needs to lower his score after the turn he can often count on No. 16. He’s aced it four times, has two other holes-in-one at the course – Hilo Muni has five par-3 holes – and he also aced a hole once at Waikoloa Village. \n“I don’t know what it is about No. 16,” Yabuta said. “That hole is actually not one of my favorites.” \nHe was playing with Sumida Golf Club on Sept. 29 when he teed off from the white tees with the pin placed 177 yards away and ended a 12-year ace-less streak. No sooner had he told his playing partner the next day, Mike Nagao, than did he strike again from blue tees, 179 yards away. \nNot to steal Yabuta’s thunder, but Hilo Muni starter Darrell Papalimu has seen more impressive feats than holes-in-one on consecutive days. \n“I knew a guy that once had two in the same round,” Papalimu said. “Eric’s doesn’t surprise me. He’s a (1.9) handicap.” \nYabuta also has a ways to go to catch up to the unofficial leader in holes-in-one among Hilo Muni regulars. Papalimu said Mel Loo owns 11 aces. \nYabuta joked that he’s not chasing Loo, but time is on his side since he retired from Creative Arts Hawaii. \n“I golf about five or six times a week,” he said.  ", "external_links": [], "published": "2015-10-14T14:25:00.000+03:00", "crawled": "2015-10-15T18:34:39.792+03:00", "highlightTitle": ""}