{"organizations": ["St. Louis Cardinals", "Marlins", "Dodgers", "Colorado Rockies Scott Servais", "St. Louis Cardinal", "Philadelphia Phillies", "Cubs", "Getty Images Image", "Texas Rangers", "New Mariners", "Colorado Rockies", "Getty Images Colorado Rockies Scott Servais", "Cardinals", "Detroit Tigers", "Los Angeles Dodgers", "Chicago Cubs", "Cincinnati Reds", "Houston Astros", "Florida Marlins"], "uuid": "db33ca84892f6a672a4ce47b978bc34ed374b6ca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattlepi.com", "main_image": "http://ww4.hdnux.com/photos/41/55/04/8835339/3/rawImage.jpg", "site_section": "http://www.seattlepi.com/sports/collectionRss/Sports-Slidepro-9235.php", "section_title": "Sports Slidepro", "url": "http://www.seattlepi.com/sports/baseball/slideshow/New-Mariners-manager-Scott-Servais-119231.php", "country": "US", "title": "New Mariners manager Scott Servais", "performance_score": 0, "site": "seattlepi.com", "participants_count": 0, "title_full": "New Mariners manager Scott Servais", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T19:28:00.000+03:00", "replies_count": 0, "uuid": "db33ca84892f6a672a4ce47b978bc34ed374b6ca"}, "author": "", "url": "http://www.seattlepi.com/sports/baseball/slideshow/New-Mariners-manager-Scott-Servais-119231.php", "ord_in_thread": 0, "title": "New Mariners manager Scott Servais", "locations": ["Clearwater", "IL", "Clearwater Fla.", "Illinois", "Missouri", "Chicago", "St. Louis", "CHICAGO", "Tucson", "Busch Stadium", "California", "Cincinnati", "AZ.", "seattlepi.com", "Arizona", "Wrigley Field", "Los Angeles"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Daniel LIPPITT", "Delino DeShields", "Trenidad Hubbard", "Jeffrey Hammonds", "Gary Newkirk", "Jonathan Daniel", "Scott Servais", "Jason Wise", "Harry How", "Rod Beck", "Sammy Sosa", "Brian L. Hunter", "Rolando Arrojo", "Hyoung Chang", "Larry Walker"], "text": "New Mariners manager Scott Servais October 23, 2015 9:28 AM Photo: Jason Wise, Getty Images Image 1 of / 12 Close Image 1 of 12 Scott Servais of the Texas Rangers during photo day at Surprise Stadium on February 25, 2007 in Surprise, Arizona. Scott Servais of the Texas Rangers during photo day at Surprise Stadium on February 25, 2007 in Surprise, Arizona. Photo: Jason Wise, Getty Images Scott Servais of the Texas Rangers during photo day at Surprise... Photo-8835339.119231   12 Philadelphia Phillies outfielder Brian L. Hunter, left, greets Detroit Tigers catcher Scott Servais as they walk across the rain-soaked outfield at Jack Russell Stadium, Sunday, March 4, 2001, in Clearwater Fla., shortly before their exhibition baseball game was called because of rain. Philadelphia Phillies outfielder Brian L. Hunter, left, greets Detroit Tigers catcher Scott Servais as they walk across the rain-soaked outfield at Jack Russell Stadium, Sunday, March 4, 2001, in Clearwater ... more Philadelphia Phillies outfielder Brian L. Hunter, left, greets... Photo-8838697.119231   12 Scott Servais of the Houston Astros looks on during the game against the Los Angeles Dodgers at Dodger Stadium on August 18, 1991 in Los Angeles, California. Scott Servais of the Houston Astros looks on during the game against the Los Angeles Dodgers at Dodger Stadium on August 18, 1991 in Los Angeles, California. Photo: Gary Newkirk, Getty Images Scott Servais of the Houston Astros looks on during the game... Photo-8838645.119231   12 8 Apr 1997: Catcher Scott Servais of the Chicago Cubs swings at the ball during a game against the Florida Marlins at Wrigley Field in Chicago, Illinois. The Marlins won the game 5-3. Mandatory Credit: Jonathan Daniel /Allsport 8 Apr 1997: Catcher Scott Servais of the Chicago Cubs swings at the ball during a game against the Florida Marlins at Wrigley Field in Chicago, Illinois. The Marlins won the game 5-3. Mandatory Credit: ... more 8 Apr 1997: Catcher Scott Servais of the Chicago Cubs swings at... Photo-8838649.119231   12 Colorado Rockies center fielder Trenidad Hubbard is tagged out in mid-air over home plate by Chicago Cubs catcher Scott Servais, after Cubs right fielder Sammy Sosa failed to catch a single by Colorado Rockies right fielder Larry Walker, in the 3rd inning September 6 at Wrigley Field in Chicago, IL. Colorado Rockies center fielder Trenidad Hubbard is tagged out in mid-air over home plate by Chicago Cubs catcher Scott Servais, after Cubs right fielder Sammy Sosa failed to catch a single by Colorado Rockies ... more Colorado Rockies center fielder Trenidad Hubbard is tagged out in... Photo-8838648.119231   12 Chicago Cubs catcher Scott Servais (L) tags out St. Louis Cardinals Delino DeShields as he tries to steal home during the first inning of their game 18 August at Wrigley Field in Chicago, IL. The Cubs defeated the Cardinals 4-1. Chicago Cubs catcher Scott Servais (L) tags out St. Louis Cardinals Delino DeShields as he tries to steal home during the first inning of their game 18 August at Wrigley Field in Chicago, IL. The Cubs defeated ... more Chicago Cubs catcher Scott Servais (L) tags out St. Louis Cardinals... Photo-8838646.119231 - seattlepi.com Image 7 of 12 CHICAGO, IL - AUGUST 18: Chicago Cubs reliever Rod Beck (R) gets a pat on the back from catcher Scott Servais after striking out two St. Louis Cardinal batters during the ninth inning of their game 18 August at Wrigley Field in Chicago, IL. The Cubs defeated the Cardinals 4-1. AFP PHOTO Daniel LIPPITT CHICAGO, IL - AUGUST 18: Chicago Cubs reliever Rod Beck (R) gets a pat on the back from catcher Scott Servais after striking out two St. Louis Cardinal batters during the ninth inning of their game 18 August ... more CHICAGO, IL - AUGUST 18: Chicago Cubs reliever Rod Beck (R) gets a... Photo-8838647.119231 - seattlepi.com Image 8 of 12 Catcher Scott Servais of the Chicago Cubs looks on during a game against the Los Angeles Dodgers at Wrigley Field in Chicago, Illinois. The Cubs defeated the Dodgers 2-1. Catcher Scott Servais of the Chicago Cubs looks on during a game against the Los Angeles Dodgers at Wrigley Field in Chicago, Illinois. The Cubs defeated the Dodgers 2-1. Photo: Harry How, Getty Images Catcher Scott Servais of the Chicago Cubs looks on during a game... Photo-8835183.119231 - seattlepi.com Image 9 of 12 Scott Servais of the Chicago Cubs fields against the St. Louis Cardinals at Busch Stadium on August 8, 1998 in St. Louis, Missouri. Scott Servais of the Chicago Cubs fields against the St. Louis Cardinals at Busch Stadium on August 8, 1998 in St. Louis, Missouri. Photo: The Sporting News, Getty Images Scott Servais of the Chicago Cubs fields against the St. Louis... Photo-8838642.119231 - seattlepi.com Image 10 of 12 Colorado Rockies' Jeffrey Hammonds, left, and Scott Servais, right, celebrate after scoring on a base hit by pitcher Rolando Arrojo in the fourth inning against the Cincinnati Reds, Wednesday, June 21, 2000, in Cincinnati. Colorado Rockies' Jeffrey Hammonds, left, and Scott Servais, right, celebrate after scoring on a base hit by pitcher Rolando Arrojo in the fourth inning against the Cincinnati Reds, Wednesday, June 21, 2000, in ... more Colorado Rockies' Jeffrey Hammonds, left, and Scott Servais,... Photo-8838650.119231 - seattlepi.com Image 11 of 12 Colorado Rockies Scott Servais is in the practice of catchers difense at the spring training camp in Tucson, AZ., on Friday. Colorado Rockies Scott Servais is in the practice of catchers difense at the spring training camp in Tucson, AZ., on Friday. Photo: Hyoung Chang, Getty Images Colorado Rockies Scott Servais is in the practice of catchers... Photo-8838643.119231 - seattlepi.com Image 12 of 12 Outbrain AR 6 Item-38490.119231 - seattlepi.com New Mariners manager Scott Servais 1 / 12", "external_links": [], "published": "2015-10-23T19:28:00.000+03:00", "crawled": "2015-10-24T04:47:51.789+03:00", "highlightTitle": ""}