{"organizations": ["LR Catholic", "NWA", "Parker Stearns"], "uuid": "a03be9adeb1adcb69a72f09a6211abafbada7d9b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nwaonline.com", "main_image": "http://media.arkansasonline.com/img/photos/2015/10/21/82109201_AN-TEN-7A-BOYS-10-21_ORIG.JPG", "site_section": "http://www.nwaonline.com/rss/headlines/sports/prep/", "section_title": "NWAonline stories: High School Sports - Northwest Arkansas", "url": "http://www.nwaonline.com/news/2015/oct/21/lr-catholic-boys-bentonville-girls-swee/", "country": "US", "title": "LR Catholic boys, Bentonville girls sweep singles, doubles, team titles", "performance_score": 0, "site": "nwaonline.com", "participants_count": 0, "title_full": "LR Catholic boys, Bentonville girls sweep singles, doubles, team titles", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T10:37:00.000+03:00", "replies_count": 0, "uuid": "a03be9adeb1adcb69a72f09a6211abafbada7d9b"}, "author": "", "url": "http://www.nwaonline.com/news/2015/oct/21/lr-catholic-boys-bentonville-girls-swee/", "ord_in_thread": 0, "title": "LR Catholic boys, Bentonville girls sweep singles, doubles, team titles", "locations": ["Bentonville"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Paul Nielsen"], "text": "By Paul Nielsen Posted: October 21, 2015 at 2:37 a.m. NWA Democrat-Gazette/J.T. WAMPLER Little Rock Central's Parker Stearns returns the ball Tuesday during the finals of the Class 7A state boys tennis tournament in Bentonville. \nBENTONVILLE -- Little Rock Catholic was perfect Tuesday afternoon. \nCatholic's team of freshmen Henry Nolan and Stephen Weeks needed 38 minutes to win the Class 7A boys doubles championship, and Parker Stearns completed the sweep by winning the singles championship in straight sets. \nCatholic, which was tied for second entering the day with four points, finished with 14 points to win the team title over runner-up Fayetteville. Rogers was third. \n\"The kids competed all day,\" Catholic Coach Tim Glancy said. \"We talked with people about how the other teams play and we talked about how to handle the pressure.\" \nThat strategy worked to perfection. \nNolan and Weeks got off to a fast start in the title match against Fayetteville's Hans Corbell and Cannon Kern, breaking serve on their way to a 6-1, 6-0 victory. \nStearns also started in the singles final against Van Buren's Braydon Montgomery en route to a 6-0, 6-1 victory. Stearns advanced to the final by beating Bentonville's Sriker Chikkala 6-2, 6-0 in the semifinals, while Montgomery defeated Michael Zheng of Rogers to advance to the title match. \nStearns lost four games in three matches. \nCLASS 7A GIRLS \nBentonville wins again \nCoach Nick Nersesian had a game plan in place for Bentonville's doubles teams going into their semifinal matches at the Class 7A state tournament. \nThere was only one problem. His two teams wound up on different sides of the bracket, and their opponents were switched. \nThat didn't matter. Both of his doubles teams won to set up an all-Bentonville final as the Lady Tigers won their second consecutive state championship Tuesday at Memorial Park. \n\"These girls really prepared well for this year,\" Nersesian said. \"They worked hard and listened to their coaches, and they put that time in. It's what you do early in the year and through the summer to get yourself ready for high school tennis. It's nice that these girls could put it all together.\" \nBessie Sullivan and Taylor Cheung-Damonte teamed up for a 7-5, 6-1 semifinal victory over Rogers' Addy Lewis and Maddie McKinney, while Bentonville's Avery Hargrove and Emily Gean advanced with a 6-3, 6-2 victory over Fayetteville's Cameron Churchill and Anna Mauromoustakos. \nSullivan and Cheung-Damonte overcame a shaky start to knock off Hargrove and Gean in three sets to claim the doubles title. \n\"It's difficult because it's not just tennis,\" Sullivan said. \"It's friendship, it's teammates and it's also like you want to win. There's a balance between, 'Do I play nice, or do I go after them like I do the other teams?' \" \nBentonville also won the singles title as Adriana Canigova defeated Mount St. Mary's Margaret Lucas 6-3, 6-3 in the final. \nCanigova, an exchange student from Croatia, won the title despite some shoulder issues that caused her to use what looked like an underhanded serve. \nCanigova didn't lose a point throughout her first two matches, including a 6-0, 6-0 victory over Mount St. Mary's Brooke Buckner in a match that lasted 34 minutes. Lucas adjusted to the unorthodox serve and broke it twice in the first set, but Canigova proved to be too much. \nSports on 10/21/2015", "external_links": [], "published": "2015-10-21T10:37:00.000+03:00", "crawled": "2015-10-21T12:17:32.671+03:00", "highlightTitle": ""}