{"organizations": [], "uuid": "e36cf8afb4b02ebd5ece6d12d69bb18c78d045ec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.shanghaidaily.com", "main_image": "http://www.shanghaidaily.com/images/mzl.dlomxgvi.png", "site_section": "http://rss.shanghaidaily.com/portal/mainsite/Sports", "section_title": "Shanghai Daily: Sports", "url": "http://www.shanghaidaily.com/sports/soccer/Mourinho-given-stadium-ban-fined-for-comments/shdaily.shtml", "country": "", "title": "Mourinho given stadium ban, fined for comments", "performance_score": 0, "site": "shanghaidaily.com", "participants_count": 0, "title_full": "Mourinho given stadium ban, fined for comments", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T22:19:00.000+03:00", "replies_count": 0, "uuid": "e36cf8afb4b02ebd5ece6d12d69bb18c78d045ec"}, "author": "", "url": "http://www.shanghaidaily.com/sports/soccer/Mourinho-given-stadium-ban-fined-for-comments/shdaily.shtml", "ord_in_thread": 0, "title": "Mourinho given stadium ban, fined for comments", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mourinho"], "text": "Mourinho given stadium ban, fined for comments Source: AFP | October 15, 2015, Thursday | Online Edition \nCHELSEA manager Jose Mourinho has been handed a suspended one-match stadium ban and fined £50,000 ($77,232; 67,496 euros) by England's Football Association for misconduct following comments made in the wake of his side's recent defeat to Southampton. \nMourinho accused officials of being \"afraid\" to award his team penalties afterChelsea went down 3-1 to the Saints in the Stamford Bridge clash on October 3. \nHe was unhappy that a spot-kick was not awarded to his side when forward Radamel Falcao went down under a challenge by Saints goalkeeper Maarten Stekelenburg. \nBut the FA confirmed on Wednesday that the Blues boss had accepted he had breached regulations and, as well as the fine and ban, warned the Portuguese that he faces further punishment for any more such outbursts within the next 12 months. \n\"Jose Mourinho has been given a suspended one-match stadium ban and fined £50,000 after he admitted a breach of FA Rules in relation to post-match media comments,\" a statement from the governing body read. \n\"The Chelsea manager was charged for misconduct following the game against Southampton on Saturday 3 October 2015. \n\"It was alleged his remarks constituted improper conduct in that they alleged and/or implied bias on the part of a match official or match officials and/or brought the game into disrepute. \n\"Mr Mourinho's suspended stadium ban will be immediately invoked should he be found by an Independent Regulatory Commission to have committed a further breach of FA Rule E3 for any comment or statement to or through the media before 13 October 2016.\" \nChelsea have endured a poor start to the season and sit in 16th place in the Premier League with just eight points from eight games before hosting Aston Villa on Saturday.", "external_links": [], "published": "2015-10-14T22:19:00.000+03:00", "crawled": "2015-10-16T09:23:26.170+03:00", "highlightTitle": ""}