{"organizations": [], "uuid": "9f0ca8ddad0449e8ac78768877ff92e4cf3761b7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-56264e03/turbine/ct-chvrches-interview-ott-1023-20151019", "site_section": "http://www.chicagotribune.com/", "section_title": "Chicago Tribune: Chicago breaking news, sports, business, entertainment, weather and traffic - Chicago Tribune", "url": "http://www.chicagotribune.com/entertainment/music/ct-chvrches-interview-ott-1023-20151019-story.html", "country": "US", "title": "Chvrches interview: Scottish trio slows a bit to gain perspective", "performance_score": 0, "site": "chicagotribune.com", "participants_count": 1, "title_full": "Chvrches interview: Scottish trio slows a bit to gain perspective - Chicago Tribune", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T18:32:00.000+03:00", "replies_count": 0, "uuid": "9f0ca8ddad0449e8ac78768877ff92e4cf3761b7"}, "author": "Steve Knopper", "url": "http://www.chicagotribune.com/entertainment/music/ct-chvrches-interview-ott-1023-20151019-story.html", "ord_in_thread": 0, "title": "Chvrches interview: Scottish trio slows a bit to gain perspective", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "After surging through its debut album in a workaholic basement-studio rush, the 4-year-old Glasgow, Scotland, synth-pop trio Chvrches was determined to slow down for the follow-up. The members sketched a calendar, plotted Monday-through-Friday daytime office hours and organized their weeks into sessions devoted to brainstorming songs, then putting them together. \"In a sense, it's un-rock 'n' roll, and kind of dull. But that was something we did consciously, in a sense of tightening problems we had on the first record,\" says Iain Cook, 40, one of the band's two keyboardists. \"When you're working on something, 10-hour days, three days in a row, you lose perspective and don't have a step back.\"\nThus \"Every Open Eye,\" which came out late last month, is more structured and focused and less prone to meandering keyboard loops than 2013's breakthrough \"The Bones of What You Believe.\" The band's frontwoman, Lauren Mayberry, has become a more powerful voice — Cook says her lyric writing has \"come along leaps and bounds.\" As Cook and Martin Doherty construct a joyful '80s electro-soundscape that recalls Depeche Mode and Erasure, Mayberry vows in \"Never Ending Circles\" that \"the strong red lines that I will draw will come and cover you up\" and sharply declares in \"Leave a Trace\": \"Anything you ever did was strictly by design — but you got it wrong.\"\n\"It didn't take too long to find the sound that defined the record,\" Cook says, by phone from a Portland tour stop. \"It's like the first album, but it's a bit more focused, a bit more refined, a bit leaner, and the songwriting and production has matured a lot.\"\nChvrches, deliberately misspelled to maximize Google-search recognition, formed after Mayberry, Cook and Doherty were slogging through indie-rock bands and day jobs. Mayberry had accumulated graduate degrees in law and journalism but was spending her time in Blue Sky Archives; Doherty was a member of the Twilight Sad; Cook was in Aerogramme and writing TV and movie music, a job he would tell Pitchfork was \"quite soul-chipping, just spending hours on the computer plodding away at the same note.\"\nIn 2007, while touring with Aerogramme, Cook recalls, \"we were having a really bad time. The band was falling apart. There was nobody coming to shows.\" He and Doherty had been friendly through their music endeavors and decided to collaborate.\nA few years later, Cook was on vacation, inspired by an American electronic band called Emeralds, and he decided to buy a Moog Voyager synthesizer — \"playing around with soundscapes and stuff like that ... kind of with a view of doing stuff from the '80s.\" Doherty was of similar mind, and after they'd worked together on new music, they invited Mayberry to join them. Their first single, \"Lies,\" came out in 2012.\nChvrches brings buoyancy to electronic-driven heartache Todd Martens Heartache isn’t necessarily supposed to sound exuberant, and electronics aren’t expected to be as inviting as a hug, but Scotland’s Chvrches consistently defies those conventions on sophomore effort “Every Open Eye.”\n“Light is all over us,” frontwoman Lauren Mayberry sings on album centerpiece...\nHeartache isn’t necessarily supposed to sound exuberant, and electronics aren’t expected to be as inviting as a hug, but Scotland’s Chvrches consistently defies those conventions on sophomore effort “Every Open Eye.”\n“Light is all over us,” frontwoman Lauren Mayberry sings on album centerpiece...\n(Todd Martens) The band first took off online, as Mayberry's high, detached voice, which recalls British rock stars Kate Bush or Harriet Wheeler of the Sundays, began to mesh just right with the band's \"Just Can't Get Enough\"-style synthesizer hooks. But as the band expanded from posting a song on a music blog called Neon Gold to viral social-media clips, Mayberry found herself on the ugly side of Internet fame. One Facebook commenter addressed a comment to Chvrches' \"cute singer\" and requested a dinner date by suggesting \"we'd make superior love together.\" The band reacted to this fan sexism (and far worse) quickly and pointedly, demanding that fans \"stop sending us emails like this.\"\nMayberry has refused to back down from the trolls, writing in London's Guardian two years ago: \"I am incredibly lucky to be doing the job I am doing at the moment. ... Does that mean that I need to accept that it's OK for people to make comments like this, because that's how women in my position are spoken to?\" Last month, at a Central Park show in New York, she dressed down a male fan who'd been shouting, \"Marry me!\" After enduring further abuse on Twitter, she later clarified in an interview: \"All I'm asking for is for my position as a musician and as an artist to be taken as seriously as that of my bandmates, and not to be defined and separated by my gender.\"\n\"Sometimes it rears its ugly head, and we can't not look at it,\" Cook says, in a phone interview. \"It's an enormously stressful thing when that happens. I don't know how Lauren has the strength to shoulder all that stuff because it's so personally directed at her. The best thing we can do as bandmates and friends is support her and give her space.\"\nConstantly on the road, Chvrches has yet to contemplate the next album, although the band more than 20 songs for \"Every Open Eye\" and, Cook says, \"There's certainly a few in the bank.\" He adds: \"I don't think we'll do what we did last time and take six weeks (off) and go back to the studio. As we get time or inspiration to work on an idea, we'll do that, but at the moment it's been really, really grueling. It's a big job, this job. ... I need a lot of head space to be creative, and that's something you have very little of.\"\nSteve Knopper is a freelancer.\nonthetown@tribpub.com\nTwitter @chitribent\nWhen : 9 p.m. Saturday\nWhere : Metro, 3730 N. Clark St.\nTickets : Sold out; 773-549-4140 or www.metrochicago.com\n Entertainment", "external_links": ["http://www.trbimg.com/img-562145c2/turbine/la-et-ms-chvrches-every-open-eye-20151015", "http://www.trbimg.com/img-56264e03/turbine/ct-chvrches-interview-ott-1023-20151019"], "published": "2015-10-22T18:32:00.000+03:00", "crawled": "2015-10-23T00:26:14.392+03:00", "highlightTitle": ""}