{"organizations": [], "uuid": "499337c260db88fe252addf0e88364c8afe3928d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nydailynews.com", "main_image": "http://assets.nydailynews.com/polopoly_fs/1.2393162!/img/httpImage/image.jpg_gen/derivatives/landscape_1200/spl1148937-016.jpg", "site_section": "http://www.nydailynews.com/sports/index.html", "section_title": "Sports News &amp; Articles: Today’s Latest Sports News - NY Daily News", "url": "http://www.nydailynews.com/entertainment/gossip/sean-avery-marries-hilary-rhoda-southampton-article-1.2393167", "country": "US", "title": "Sean Avery marries Hilary Rhoda in Southampton", "performance_score": 0, "site": "nydailynews.com", "participants_count": 1, "title_full": "Sean Avery marries Hilary Rhoda in Southampton - NY Daily News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T03:00:00.000+03:00", "replies_count": 0, "uuid": "499337c260db88fe252addf0e88364c8afe3928d"}, "author": "NEW YORK DAILY NEWS", "url": "http://www.nydailynews.com/entertainment/gossip/sean-avery-marries-hilary-rhoda-southampton-article-1.2393167", "ord_in_thread": 0, "title": "Sean Avery marries Hilary Rhoda in Southampton", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Matt Agudo/INFphoto.com/Matt Agudo/INFphoto.com Former NHL Star Sean Avery and Model Hilary Rhoda got married at the Parrish Art Museum in Southampton, New York on Saturday. Former hockey star Sean Avery scored big Saturday as he married supermodel and longtime girlfriend Hilary Rhoda — less than two weeks after his latest arrest.\nThe ex-New York Ranger and the brunette beauty were joined by friends and family as they exchanged vows in an intimate, outdoor ceremony in Southampton as the sun set around them.\nThe wedding comes nearly two years after they got engaged in November in 2013. The high-profile couple began dating in 2010 after meeting at Avery's bar in Manhattan.\nRhoda, 28, stunned in a sleek, nontraditional white and emerald gown, while Avery, 35, went tie-less in his gray suit.\nMatt Agudo/INFphoto.com/Matt Agudo/INFphoto.com Rhoda stunned in this elegant white, emerald-trimmed dress. The swanky ceremony likely served as a pleasant distraction for the noriously rebellious Avery, who was arrested in Southampton on Sept. 30 after cops found prescription drugs (acetaminophen with oxycodone and Roxicodone) in his car. He was also slapped with a criminal mischief charge for throwing things at cars the day before.\nThe former left wing responded to the arrest on Twitter Tuesday by sharing a list of the medications allegedly prescribed to him, which included oxycodone with acetaminophen.\n\"Pretty disgusting I even have to do this but unfortunately it's the same old story,\" Avery wrote. \"Have fun with this one.\"\nMatt Agudo/INFphoto.com/Matt Agudo/INFphoto.com Sean Avery runs last minute errands on his wedding day in Southampton, New York. He also shared a pair of cop-bashing tweets, including a photo of a police officer ticketing a car.\nThe arrest was the latest in a long line of incidents for the ex-NHL bad boy.\nAvery, who has been flipping house since retiring from pro hockey in 2012, was also arrested in 2011 for shoving a police officer in Los Angeles, although the charges were later dropped.\nHe also regularly infuriated opponents on the ice with his antagonizing antics, including in 2008 when he was suspended six games for making a nasty reference to Calgary Dion Phaneuf, who was dating his ex-girlfriend, actress Elisha Cuthbert. Cuthbert and Phaneuf are now married.\nRelated Stories Sean Avery busted for drugs during Hamptons traffic stop", "external_links": [], "published": "2015-10-11T03:00:00.000+03:00", "crawled": "2015-10-11T20:08:47.711+03:00", "highlightTitle": ""}