{"organizations": [], "uuid": "6ed9147e89419b06b5b5391d82281f47e2d8a314", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nytimes.com", "main_image": "http://static01.nyt.com/images/2015/10/09/sports/09MACURweb1/09MACURweb1-facebookJumbo.jpg", "site_section": "http://www.nytimes.com/services/xml/rss/nyt/InternationalSports.xml", "section_title": "NYT &gt; International Sports", "url": "http://www.nytimes.com/2015/10/09/sports/soccer/ways-forward-for-fifa-a-frank-accounting-and-a-fresh-start.html", "country": "US", "title": "Ways Forward for FIFA: A Frank Accounting, and a Fresh Start", "performance_score": 1, "site": "nytimes.com", "participants_count": 1, "title_full": "Ways Forward for FIFA: A Frank Accounting, and a Fresh Start - The New York Times", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T23:51:00.000+03:00", "replies_count": 0, "uuid": "6ed9147e89419b06b5b5391d82281f47e2d8a314"}, "author": "Juliet Macur", "url": "http://www.nytimes.com/2015/10/09/sports/soccer/ways-forward-for-fifa-a-frank-accounting-and-a-fresh-start.html", "ord_in_thread": 0, "title": "Ways Forward for FIFA: A Frank Accounting, and a Fresh Start", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Sepp Blatter has been suspended from FIFA, but it is not a time to cheer. It is a time to step back and consider the futility of suspending him when the organization, with or without him, is barely standing as it is.\nIf FIFA were a building, it would have been condemned by now. Thursday’s suspensions would have just been the final blow. And if it were torn down, stripped to the ground one corroded beam after another, soccer would be better for it.\nThe problem is there doesn’t seem to be anybody left to oversee the job. Blatter, along with his right-hand man, Jérôme Valcke, and the head of European soccer, Michel Platini, have been suspended while under investigation for financial crimes. Platini, it should be noted, was the front-runner (well, at least until Thursday) to succeed Blatter as FIFA president in a special election in February.\nContinue reading the main story Related Coverage The FIFA Scandal: Questions and Answers OCT. 8, 2015 Times Topic: International Federation of Association Football (FIFA) FIFA President Sepp Blatter and Other Top Officials Suspended OCT. 8, 2015 Coca-Cola, Visa, McDonald’s and Anheuser-Busch Call On FIFA’s Sepp Blatter to Resign OCT. 2, 2015 Ending an Albania-Serbia Game and Inciting a Riot, With a Joystick OCT. 7, 2015 Success Is No Longer Foreign to East Timor, but the Players Are OCT. 1, 2015 But even he can see the writing on the crumbling wall now. In a statement Thursday morning protesting a suspension that had not yet been handed down, he acknowledged that FIFA was now incapable of fixing itself and, incredibly, called for an investigation into the investigation of him.\nPhoto Blatter leaving FIFA headquarters in Zurich on Thursday. Credit Dominic Steinmann/European Pressphoto Agency “A dispassionate, independent and impartial judicial body needs to shine a light on the events that led the FIFA Ethics Committee to open these investigatory proceedings,” he said in a statement.\nPlatini’s statement also helpfully noted that on Thursday morning he had filed the required paperwork to run for the FIFA presidency in February.\nAnother candidate hoping to be Blatter’s successor, the former FIFA vice president Chung Mong-joon of South Korea, will not have any chance at claiming the post. On Thursday, the ethics committee suspended him for six years for past misdeeds.\nSports of The Times A collection of columns offering opinion and analysis from the world of sports. C. C. Sabathia Can Teach Matt Harvey a Lesson in Humility OCT 7 Cycling Leader Vows to Press the Fight Against Doping OCT 4 Yet Another Comeback Attempt for Michael Vick in a Career of Them OCT 2 Fever Follow Tamika Catchings’s Lead, Right Into W.N.B.A. Finals SEP 30 Larry Brown Adds to His List of Transgressions at S.M.U. SEP 29", "external_links": ["http://static01.nyt.com/images/2015/10/03/sports/03SOCCERweb/03SOCCERweb-thumbStandard.jpg", "http://static01.nyt.com/images/2015/10/07/sports/07ALBANIAweb1/07ALBANIAweb1-thumbStandard.jpg", "http://static01.nyt.com/images/2015/10/09/sports/09MACURweb2/09MACURweb2-superJumbo.jpg", "http://static01.nyt.com/images/2015/10/09/sports/09FIFAEXPLAIN/09FIFAEXPLAIN-thumbStandard.jpg", "http://static01.nyt.com/images/2015/10/02/sports/02TIMORweb1/02TIMORweb1-thumbStandard.jpg", "http://static01.nyt.com/images/2015/10/09/sports/09MACURweb2/09MACURweb2-articleLarge.jpg", "http://static01.nyt.com/images/2015/10/09/sports/soccer/09Fifa-web/09Fifa-web-thumbStandard.jpg"], "published": "2015-10-08T23:51:00.000+03:00", "crawled": "2015-10-09T00:44:53.304+03:00", "highlightTitle": ""}