{"organizations": [], "uuid": "eddb483f08dad64f1d2413121d12dbc34219bcd1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.denverpost.com", "main_image": "http://extras.mnginteractive.com/live/media/site36/2015/1015/20151015__20151016_C1_AE11SCMOVIES~p1.jpg", "site_section": "http://www.denverpost.com/", "section_title": "Colorado Breaking News, Sports, Weather, Traffic, Jobs - The Denver Post", "url": "http://www.denverpost.com/movies/ci_28975472/why-do-we-still-go-movies-weve-got", "country": "US", "title": "When it's so easy to stream, or watch on-demand, why still go to the movies?", "performance_score": 0, "site": "denverpost.com", "participants_count": 6, "title_full": "When it's so easy to stream, or watch on-demand, why still go to the movies? - The Denver Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T20:01:00.000+03:00", "replies_count": 6, "uuid": "eddb483f08dad64f1d2413121d12dbc34219bcd1"}, "author": "John Wenzel", "url": "http://www.denverpost.com/movies/ci_28975472/why-do-we-still-go-movies-weve-got", "ord_in_thread": 0, "title": "When it's so easy to stream, or watch on-demand, why still go to the movies?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "No less a voice than Roger Ebert , arguably America's most prolific and best-loved film critic, called the movies \"a machine that generates empathy.\"\nIt's a phrase that has been applied to other art forms , but it has special resonance for the act of going to a movie theater — which these days can be variously equated with courage, curiosity and support for one of the last public forums that equalizes everyone who walks through the door.\nBut with on-demand streaming at home and on our mobile devices, why do we still bother seeing movies in the theater?\nCertainly, it's cheaper and more convenient to make our entertainment come to us. The fidelity of home theaters can, with the right display and speakers, nearly match a traditional movie house. The average movie ticket price reached an all-time high of $8.17 last year, which may explain why movie attendance also hit a 19-year low .\nAnd let's be honest: Although we know the odds are slim, the specter of random shootings still crosses our minds. Between the deadly Aurora theater shooting at a screening of \"The Dark Knight Rises\" in 2012 or a deadly July 23 incident in Louisiana at a \"Trainwreck\" showing or an Aug. 5 incident in Tennessee in which a man with a pellet gun, ax and pepper spray attacked patrons at \"Mad Max: Fury Road,\" we have reasons to be wary.\nBut mass shootings are not unique to the cineplex, and these isolated, recent incidents can't be a deterrent from experiencing what has drawn countless people to gather excitedly in the dark for more than a century.\nFreedom\nGoing to the movies is about more than just escapism. It's an act of choice and freedom, of reclaiming time for ourselves and stepping into another world, where we feel vulnerable, packed into a darkened room as we are, eyes wide but focused. It's a dreamlike state.\nKenny Wells, Jordan Walter, Malinda Ross and Tom Walter leave a movie theater in Columbia, Md. Watching a (preferably good) movie at a theater takes us out of that moment, making us forget where we are and whatever brought us there. ( Jeffrey MacMillan, The Washington Post ) And escapism is nothing to scoff at, as legendary critic Pauline Kael wrote . For her, going to the movies was a refuge from the oppression of \"official\" culture, \"where nothing is asked of us and we are left alone.\"\nThat's harder to find on the couch with our laptops, tablets and phones (and their attendant social media feeds) blinking at us like needy pets.\nEscape — and the feeling that we're getting away with something — is a powerful incentive.\nDespite parents' best efforts, kids still sneak into R-rated movies. Teenagers make out. Longtime couples clasp hands and cry. And those of us who prefer a quieter, more solitary lifestyle can, for a couple hours, feel comfortable in public.\nFor movie lovers, the physical act of going to see a movie also makes a statement. We train studios to feed us the kind of entertainment they think we want, and few things send as loud and clear a message as opening-weekend box office receipts. If we want to see more of one type of movie over another, going to the movies is a form of voting — with instant returns.\n\"Opening weekend box-office is still very important,\" said Britta Erickson , director of the Denver Film Festival . \"That's how studios make decisions about what they push out in the future. It's their make-or-break.\"\nOn the other hand, if we value a diet heavy in local, non-corporate fare — as many organic foodies do — supporting art-house and independent theaters can have added benefits, such as in-person introductions and Q&As with filmmakers, as well as a genuine sense of community.\nThe Sie FilmCenter , which hosts the Denver Film Festival, holds weekly karaoke and trivia nights in addition to its mix of independent and studio titles.\n\"It's curated, so we want to be a hub for film lovers who may not even know what they want to see but just show up,\" Erickson said. \"Some people just want a place to belong.\"\nLarger than life\nOf course, there are more basic reasons people go out to the movies, which will become abundantly clear once \"Star Wars: Episode VII\" is released on Dec. 18. It's the only place we can see certain titles until they hit DVD, Blu-ray or streaming. And we can see them in a larger-than-life format that most home theaters can scarcely duplicate.\nWould 30- and 40-somethings care so deeply about \"Star Wars\" if they hadn't been pummeled by that widescreen opening and John Williams' triumphant, deafening score in 1977?\nTheaters are also an exciting arena for new developments in immersive entertainment, and one that most video games cannot hope to match. Seeing \"The Hobbit: The Battle of the Five Armies\" last year in digital 3-D — and at director Peter Jackson's experimental 48 frames per second — was a jarringly new experience, but one moviegoers may embrace as virtual reality headsets hit the market and display resolutions improve across the board.\nMore theaters are mimicking the relative luxury of the home-viewing experience. Don't like the inane chatter and constant cellphone use of the people seated next to you? Find a place that doesn't tolerate it, like the Alamo Drafthouse chain, which opened a Littleton location in 2013 and has two more outposts planned at Sloan's Lake and in Westminster.\nDowntown's UA Denver Pavilions Stadium 15 recently renovated its theaters, removing about 50 percent of all seating in favor of bigger, comfier chairs and other amenities. And foodie offerings that leave popcorn in the dust, as well as craft brews, wine and mixed drinks, are increasingly on the menu at independents and chains.\nAt its heart, though, going to the movies is unlike any other public leisure experience.\nA shopping trip, a concert or a meal at a restaurant places us in a moment in time. Watching a (preferably good) movie at a theater takes us out of that moment, making us forget where we are and whatever brought us there. After it's over, there's a camaraderie among audience members, however fleeting, and unlike at a sports game, we're far less angry with people who liked the outcome if we didn't.\nGoing to the movies has remained a popular communal ritual because the basics have held firm for decades, despite the advent of phones, TV and computers.\nBuy a ticket, sit down and enjoy, regardless of who you are.\nGeorge Lucas and Steven Spielberg, the architects of the modern blockbuster, warned in 2013 that the movie-going experience may be on the doorstep of death as higher ticket prices and on-demand choices conspire to kill theaters.\nIf that's true, something rare will be lost: a hopeful, renewable, public fantasy in a world that remains desperately short on them.\nJohn Wenzel: 303-954-1642, jwenzel@denverpost.com or @johnwenzel", "external_links": ["http://extras.mnginteractive.com/live/media/site36/2015/1015/20151015__20151016_C1_AE11SCMOVIES~p2.jpg", "http://www.regmovies.com/Theatres/Theatre-Folder/UA-Denver-Pavilions-Stadium-15-2992", "http://www.theguardian.com/film/2001/sep/05/artsfeatures.arts", "https://www.denverfilm.org/filmcenter/denverfilmcenter/", "http://www.hollywoodreporter.com/news/box-office-2014-moviegoing-hits-760766?", "http://drafthouse.com/denver/littleton", "http://www.cinemablend.com/new/Steven-Spielberg-George-Lucas-Predict-Movie-Industry-Implosion-38049.html", "http://time.com/3675462/movie-ticket-prices/", "http://www.rogerebert.com/balder-and-dash/moving-through-empathy-on-life-itself", "http://denverfilmfestival.denverfilm.org/about/festival-staff/"], "published": "2015-10-16T20:01:00.000+03:00", "crawled": "2015-10-16T20:04:24.990+03:00", "highlightTitle": ""}