{"organizations": [], "uuid": "e550461c083f5ab45e1ae261beeebdfc0b37695d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/47529300.cms", "site_section": "http://timesofindia.indiatimes.com/sports/more-sports/athletics/articlelist/3413198.cms", "section_title": "Athletics - More sports - Sports - The Times of India", "url": "http://timesofindia.indiatimes.com/sports/more-sports/athletics/AFI-says-Turkey-training-tour-will-go-ahead-nobody-skipping/articleshow/49185032.cms", "country": "IL", "title": "AFI says Turkey training tour will go ahead, nobody skipping", "performance_score": 0, "site": "indiatimes.com", "participants_count": 1, "title_full": "AFI says Turkey training tour will go ahead, nobody skipping - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:58:00.000+03:00", "replies_count": 0, "uuid": "e550461c083f5ab45e1ae261beeebdfc0b37695d"}, "author": "timesofindia.indiatimes.com", "url": "http://timesofindia.indiatimes.com/sports/more-sports/athletics/AFI-says-Turkey-training-tour-will-go-ahead-nobody-skipping/articleshow/49185032.cms", "ord_in_thread": 0, "title": "AFI says Turkey training tour will go ahead, nobody skipping", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW DELHI: Athletics Federation of India on Thursday said that the 90-day training stint of its athletes in Turkey will go ahead if the government clears it and nobody has officially communicated to the AFI to skip the tour.\nAFI said that the tour to Turkey has been sanctioned by the Sports Ministry and is only waiting the final formalities, while refuting a media report which had claimed that some women athletes were reluctant to accompany Ukrainian coach Yuri Ogorodnik for the training stint because of his alleged involvement in 2011 doping scandal.\nIt said that the 90-day intensive training in Turkey will attract far more international attention and scrutiny, and athletes will not be able to \"escape the attention of the global anti-doping bodies, as compared to training in remote places in India\".\n\"AFI is aware of its responsibilities to ensure a clean and drug-free environment for athletes and the sport itself,\" the AFI said in a release, adding that the media report was \"false\" and \"misleading\".\nAFI also justified the choice of Turkey -- one of the worst doping-hit countries according to a WADA report -- for the training stint, saying that it offers state-of-the-art facilities, along with right combination of climatic conditions.\nA top AFI official said that the ministry has cleared the training stint in Turkey for 12 athletes and seven support staff.\n\"The ministry has sanctioned the Turkey tour for 12 athletes and seven support staff. The formalities and the final go-ahead is expected to be done on Monday,\" the official said.\nAsked about any communication from any of the athletes to skip the tour, he said, \"Nobody has so far communicated to the AFI that he or she wants to skip the training in Turkey.\" ", "external_links": ["https://play.google.com/store/apps/details?id=com.toi.reader.activities"], "published": "2015-10-02T03:58:00.000+03:00", "crawled": "2015-10-02T15:50:28.219+03:00", "highlightTitle": ""}