{"organizations": [], "uuid": "af3cfe929f43ede450fc5f1ba9e0a61eeaae4590", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/Category/6/55/Sports/World.aspx", "section_title": "World - Sports - Ahram Online ", "url": "http://english.ahram.org.eg/NewsContent/6/55/161590/Sports/World/Dutch-great-Cruyff-diagnosed-with-lung-cancer-.aspx", "country": "EG", "title": "Dutch great Cruyff diagnosed with lung cancer", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "Dutch great Cruyff diagnosed with lung cancer - World - Sports - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "af3cfe929f43ede450fc5f1ba9e0a61eeaae4590"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/6/55/161590/Sports/World/Dutch-great-Cruyff-diagnosed-with-lung-cancer-.aspx", "ord_in_thread": 0, "title": "Dutch great Cruyff diagnosed with lung cancer", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Johan Cruyff, one of soccer's greatest ever players and most influential coaches, has been diagnosed with lung cancer.\nA statement on his official website (www.cruyff.com) on Thursday said the cancer had been discovered following recent tests in Barcelona.\n\"Over the past weeks, Johan Cruyff has been undergoing medical examinations at a hospital in Barcelona. During these examinations, lung cancer has been uncovered. The examinations are still ongoing,\" the statement said.\n\"To respect the privacy of Johan and his family, and the fact that the examinations have not been finalised, further announcements cannot be made at the moment.\"\nAn ex-smoker who had heart surgery in 1991, Cruyff emerged as one of the world's greats in the early 1970s when he helped Ajax Amsterdam win three European Cups in a row from 1971-73 and also named European Footballer of the Year in 1971, 1973 and 1974.\nHe joined Barcelona for a then world record transfer fee of $2.0 million, and it was Barcelona that would later define his coaching career, helping the Catalan club to win their first La Liga title in nearly 15 years in 1974.\nHe was also a key player in the great Netherlands team that reached the 1974 World Cup final when, for the first time, during the tournament a global audience saw him perform the now-famous \"Cruyff turn\" the movement in which the ​player with the ball plays it behind their own leg before swerving away in the ​direction of the ​ball.\nThe Dutch also got to the World Cup final but lost again in 1978, this time without Cruyff who had quit the national side.\nFollowing stints at Los Angeles Aztecs and Washington Diplomats in the old NASL, then Levante in Spain, Cruyff returned to Ajax before ending his playing career at their bitter rivals Feyenoord in 1984.\nIn 1999, he was voted European Player of the Century.\nThe Barca 'Dream Team' Cruyff coached won four straight La Liga titles between 1991 and 1994 and beat Sampdoria 1-0 for the club's maiden European Cup triumph in 1992.\nThe possession-based playing style Cruyff promoted, with an emphasis on relentless attack, has been widely copied and is credited with underpinning Barca's subsequent successes, as well as those of the Spanish national team.\n(For more sports news and updates, follow Ahram Online Sports on Twitter at @AO_Sports and on Facebook at AhramOnlineSports .)", "external_links": ["https://twitter.com/AO_Sports", "https://www.facebook.com/AhramOnlineSports?fref=ts"], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-23T09:15:49.136+03:00", "highlightTitle": ""}