{"organizations": [], "uuid": "629d78beaacfa24afaaea6856040f5dd672a5a31", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.oregonlive.com", "main_image": "http://www.oregonlive.com/static/aff/static/img/logos/logo_fb.jpg", "site_section": "http://www.oregonlive.com/", "section_title": "Oregon Local News, Breaking News, Sports &amp; Weather - OregonLive.com", "url": "http://www.oregonlive.com/finance/index.ssf/2015/10/medicare_2015_all_the_basics_y.html", "country": "US", "title": "Medicare 2015: All the basics you need to know", "performance_score": 0, "site": "oregonlive.com", "participants_count": 1, "title_full": "Medicare 2015: All the basics you need to know | OregonLive.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T19:15:00.000+03:00", "replies_count": 0, "uuid": "629d78beaacfa24afaaea6856040f5dd672a5a31"}, "author": "Brent Hunsberger | For The Oregonian/OregonLive", "url": "http://www.oregonlive.com/finance/index.ssf/2015/10/medicare_2015_all_the_basics_y.html", "ord_in_thread": 0, "title": "Medicare 2015: All the basics you need to know", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Open-enrollment season for Medicare health and drug plans runs between Oct. 15 and Dec. 7. That's when people 65 and older can switch their comprehensive health and drug plan providers. Other Medicare enrollees can also make changes.\nHere's a guide to some of the basic choices enrollees face.\nBasic Medicare\nAt least 725,000 Oregonians are eligible for basic Medicare insurance, known as Parts A and B, according to U.S. Centers for Medicare and Medicaid Services data.\nPremium: Likely $104.90 a month for the fourth consecutive year for most enrollees. Higher income enrollees (singles making $85,000 or more or $170,000 for joint filers) pay considerably more. In 2015, they paid between $146.90 and $335.70 a month. However, 30 percent of Medicare recipients, including all high-income beneficiaries, could see premiums increase to at least $159.30 for 2016; more for high-income recipients, federal officials say.\nEnrollment periods: There's a seven-month enrollment window starting three months before the month you turn 65. Those who miss this initial enrollment period can sign up between Jan. 1 and March 31 each year. Those who are 65 and older and still working have eight months after employment or group insurance coverage ends to enroll.\nMedicare Advantage\nAbout 320,000 Oregon Medicare recipients, or 44 percent, choose to pay a bit extra for private insurers to deliver their doctor and hospital coverage, according to Centers for Medicare and Medicaid Services data. That's the third-highest rate of any state in the nation. Nationwide, 31 percent of Medicare patients enroll in Medicare Advantage plans. Some plans also offer prescription drug insurance known as Part D.\nPremiums: $0 to $242 per month in 2016, according to The Oregonian/OregonLive's analysis of federal data.\nEnrollment period: Oct. 15 to Dec. 7\nPrescription drug plans\nAnother 246,250 buy stand-alone prescription drug plans, federal data show. Part D plans cover only medications, not care.\nPremiums: $18.40 to $154.20 a month in 2016, according to The Oregonian/OregonLive's analysis of federal data.\nEnrollment period: Oct. 15 to Dec. 7\nMedigap\nMore than 147,000 choose Medicare supplements known as Medigap plans, up 14 percent from last year, according to the Oregon Insurance Division. These policies cover Part A and B deductibles, copays and other cost-sharing requirements.\nPremiums: $47 to $247 a month, according to the Oregon Insurance Division.\nEnrollment period: Only for six months beginning the month a senior turns 65 or otherwise becomes eligible. After that, seniors can still buy a policy, but an insurer can deny coverage or price it based on an existing health condition, with some exceptions.\n— Brent Hunsberger", "external_links": [], "published": "2015-10-10T19:15:00.000+03:00", "crawled": "2015-10-10T22:20:41.481+03:00", "highlightTitle": ""}