{"organizations": ["NC Despite", "Newark Catholic", "NC Defensive", "Facebook Defensive"], "uuid": "3709830713ad13d1ffebd9a8f25194ec029be990", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.newarkadvocate.com", "main_image": "http://www.gannett-cdn.com/-mm-/11cb76d7496b4feb9f2b993ac156e76925033594/c=0-90-393-311&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/13/Newark/B9319247726Z.1_20151013174351_000_GN0C7MK3F.1-0.jpg", "site_section": "http://rssfeeds.newarkadvocate.com/newark/sports", "section_title": "Newark - Sports", "url": "http://www.newarkadvocate.com/story/sports/high-school/football/2015/10/13/defensive-line-depth-pays-nc/73890532/", "country": "US", "title": "Defensive line depth pays off for NC", "performance_score": 0, "site": "newarkadvocate.com", "participants_count": 0, "title_full": "Defensive line depth pays off for NC", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:06:00.000+03:00", "replies_count": 0, "uuid": "3709830713ad13d1ffebd9a8f25194ec029be990"}, "author": "", "url": "http://www.newarkadvocate.com/story/sports/high-school/football/2015/10/13/defensive-line-depth-pays-nc/73890532/", "ord_in_thread": 0, "title": "Defensive line depth pays off for NC", "locations": ["White Field"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Nick Cavinee", "Dave Weidig", "Jessica", "Aaron Latiolais"], "text": "Defensive line depth pays off for NC Despite being a small school, NC has developed depth at most positions Post to Facebook Defensive line depth pays off for NC Despite being a small school, NC has developed depth at most positions Check out this story on newarkadvocate.com: http://ohne.ws/1RG9eel Cancel Send A link has been sent to your friend's email address. Posted! A link has been posted to your Facebook feed. Join the Conversation Dave Weidig, Reporter 8:06 p.m. EDT October 13, 2015 Newark Catholic’s defensive line, including Tyke Wilson (53) and Nick Cavinee (50) wrap up Heath quarterback Aaron Latiolais at White Field. (Photo: Jessica Phelps/The Advocate) 8 CONNECT TWEET LINKEDIN COMMENT EMAIL MORE \nNEWARK — It’s tough to develop depth, especially in a Division VI program. But Newark Catholic isn’t like most Division VI programs. \nThe injury bug has bitten the Green Wave’s defensive line badly this fall, but there hasn’t been much drop-off. It still remains a strong point on a 5-2 team still right in the thick of the playoff picture. \n“We have two more out this week,” said senior defensive tackle Nate McNabb, who returned just a couple of weeks ago himself from a knee injury. “But we try to stay ahead of the game and try to develop depth at every position.” \n“We try to get the kids game-ready in the off-season,” coach Bill Franks said. “We have to get them ready to play fast, to reach our Week 15 goals. The game is not played in a phone booth anymore at a slow pace. We have to play fast, and be gap sound.” \nNC has used senior Nick Cavinee and juniors Connor Sheehan and Riley Whitaker at defensive end. McNabb, classmates Ian Harper and Ryan Allyn, and juniors Tyke Wilson and Nick Gialdini have played defensive tackle. \n“Coach (Ted) Londot prepares us pretty well,” said Gialdini, who also plays center and is a bit of an under-sized defensive tackle at 195. “We’ve faced a lot of adversity with the injuries, but a lot of guys have chipped in. It’s a good brotherhood and we stay together in hard times. I’m not the biggest, and we have a lot of smaller guys, but we’re taught good technique. We thrive on technique.” \nThe defensive line does the dirty work for NC, allowing the Green Wave linebackers and secondary to clean up behind them. It was especially tough in the trenches last week against Johnstown and its 320-pound pair of tackles. \n“It’s a fun challenge. I love playing against a line like that,” McNabb said. “We all believe in each other and lean on each other. We don’t have the size, but we have the grit to overcome it. We’re taught different ways to go at different challenges.” \nNC can’t let down this week against Utica, which just beat Heath and nearly upset Granville. Gialdini said that’s not an option. \n“This is a big week for us,” he said. “We’ve been working towards this since (last) November. We didn’t work all this time, to not make the playoffs again.” \ndweidig@newarkadvocate.com", "external_links": [], "published": "2015-10-14T03:06:00.000+03:00", "crawled": "2015-10-14T08:03:35.594+03:00", "highlightTitle": ""}