{"organizations": [], "uuid": "bbb2d3688b8380f54a44d7901982820bb2172840", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.timesunion.com", "main_image": "http://ww3.hdnux.com/photos/41/47/45/8812898/3/rawImage.jpg", "site_section": "http://timesunion.com//home/collectionRss/Homepage-HCat-Sports-6377.php", "section_title": "Sports news", "url": "http://www.timesunion.com/sports/article/Packers-hold-off-pass-happy-Chargers-for-27-20-win-6576721.php", "country": "US", "title": "Packers hold off pass-happy Chargers for 27-20 win", "performance_score": 0, "site": "timesunion.com", "participants_count": 1, "title_full": "Packers hold off pass-happy Chargers for 27-20 win - Times Union", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T00:50:00.000+03:00", "replies_count": 0, "uuid": "bbb2d3688b8380f54a44d7901982820bb2172840"}, "author": "timesunion.com", "url": "http://www.timesunion.com/sports/article/Packers-hold-off-pass-happy-Chargers-for-27-20-win-6576721.php", "ord_in_thread": 0, "title": "Packers hold off pass-happy Chargers for 27-20 win", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photo: Jeffrey Phelps, AP Image 1 of / 8   8 Green Bay Packers' Damarious Randall (23) deflects a pass intended for San Diego Chargers' Danny Woodhead on the final play of an NFL football game, Sunday, Oct. 18, 2015, in Green Bay, Wis. The Packers won the game 27-20. Green Bay Packers' Damarious Randall (23) deflects a pass intended for San Diego Chargers' Danny Woodhead on the final play of an NFL football game, Sunday, Oct. 18, 2015, in Green Bay, Wis. The Packers won ... more Photo: Jeffrey Phelps, AP Image 2 of 8 San Diego Chargers quarterback Philip Rivers (17) throws during the first half of an NFL football game against the Green Bay Packers, Sunday, Oct. 18, 2015, in Green Bay, Wis. San Diego Chargers quarterback Philip Rivers (17) throws during the first half of an NFL football game against the Green Bay Packers, Sunday, Oct. 18, 2015, in Green Bay, Wis. Photo: Darron Cummings, AP Image 3 of 8 San Diego Chargers' Keenan Allen (13) makes a reception against Green Bay Packers' Sam Shields during the first half of an NFL football game, Sunday, Oct. 18, 2015, in Green Bay, Wis. San Diego Chargers' Keenan Allen (13) makes a reception against Green Bay Packers' Sam Shields during the first half of an NFL football game, Sunday, Oct. 18, 2015, in Green Bay, Wis. Photo: Jeffrey Phelps, AP Image 4 of 8 Green Bay Packers' James Starks (44) goes in for a five-yard touchdown reception as he is tackled by San Diego Chargers' Denzel Perryman during the first half of an NFL football game Sunday, Oct. 18, 2015, in Green Bay, Wis. Green Bay Packers' James Starks (44) goes in for a five-yard touchdown reception as he is tackled by San Diego Chargers' Denzel Perryman during the first half of an NFL football game Sunday, Oct. 18, 2015, ... more Photo: Jeffrey Phelps, AP Image 5 of 8 Green Bay Packers quarterback Aaron Rodgers (12) reacts after James Starks ran 65-yards for a touchdown during the first half of an NFL football game against the San Diego Chargers, Sunday, Oct. 18, 2015, in Green Bay, Wis. Green Bay Packers quarterback Aaron Rodgers (12) reacts after James Starks ran 65-yards for a touchdown during the first half of an NFL football game against the San Diego Chargers, Sunday, Oct. 18, 2015, in ... more Photo: Mike Roemer, AP Image 6 of 8 San Diego Chargers running back Melvin Gordon (28) is tackled by Green Bay Packers' Micah Hyde, front right, during the first half of an NFL football game Sunday, Oct. 18, 2015, in Green Bay, Wis. San Diego Chargers running back Melvin Gordon (28) is tackled by Green Bay Packers' Micah Hyde, front right, during the first half of an NFL football game Sunday, Oct. 18, 2015, in Green Bay, Wis. Photo: Jeffrey Phelps, AP Image 7 of 8 Green Bay Packers' Damarious Randall (23) celebrates after breaking up a pass intended for San Diego Chargers' Danny Woodhead on the final play of an NFL football game Sunday, Oct. 18, 2015, in Green Bay, Wis. The Packers won the game 27-20. Green Bay Packers' Damarious Randall (23) celebrates after breaking up a pass intended for San Diego Chargers' Danny Woodhead on the final play of an NFL football game Sunday, Oct. 18, 2015, in Green Bay, ... more Photo: Jeffrey Phelps, AP Image 8 of 8 Packers hold off pass-happy Chargers for 27-20 win 1  /  8 Back to Gallery GREEN BAY, Wis. (AP) — Rookie cornerback Damarious Randall had a feeling that Philip Rivers ' final pass might be headed his way.\nFourth-and-goal from the 3 with 15 seconds left, and the San Diego Chargers needed a touchdown to tie the Green Bay Packers and possibly force overtime.\nRandall had to keep tabs on both Antonio Gates and Danny Woodhead lined up on the right side of the formation.\nThe first-round draft pick lunged to poke away Rivers' short throw to Woodhead near the front right pylon in the final seconds to preserve the Packers' 27-20 victory on Sunday, overcoming a career performance by Rivers.\n\"Biggest play of the game,\" coach Mike McCarthy said. \"Damarious is off to a great start.\"\nThe fans inside Lambeau Field erupted with a collective sigh of relief. Green Bay (6-0) survived its biggest scare of the season to stay unbeaten.\nRivers set franchise marks with career highs of 43 completions, 65 attempts and 503 yards passing. He threw for two touchdowns for the Chargers (2-4). His 43 completions were the most in NFL history in a loss; he needed one more, at least.\nBut as the fourth-down play developed, Randall remembered that San Diego ran the same play on second down, but tried to get the ball to Gates.\nThis time, linebacker Clay Matthews covered Gates inside. Woodhead broke outside, with Randall trailing from behind.\n\"I was acting like I really wasn't seeing him, but honestly, I was just trying to bait him a little bit,\" Randall said.\nOn his back after being knocked down by linebacker Julius Peppers , Rivers arched his neck up, then went back down in frustration and flailed his arms.\nAnother Chargers loss occurred in the final seconds. San Diego lost to Pittsburgh on the last play on Monday night.\n\"Brutal loss, obviously, losing the way we did,\" coach Mike McCoy said.\nThe ending overshadowed Rivers' milestone performance.\nThe 12-year veteran tied Pittsburgh's Ben Roethlisberger (2009) for second on the list for most yards passing against the Packers. Only Detroit's Matthew Stafford had more, 520 on Jan. 1, 2012.\nRivers walked to the microphone at his postgame news conference and sighed.\n\"Gosh, I don't know. I just made a comment, 'Hey, you've got to laugh to keep from crying,'\" Rivers said. \"Another one, another one that's tough.\"\nIt was the most porous outing of the season for the Packers' defense.\nBut the stout pass rush finally caught up to Rivers in the second half. Datone Jones sacked Rivers on third-and-7 from the Packers 40 to end one drive.\nUntil then, a Chargers line missing three starters held up well, with Rivers orchestrating a quick-strike offense and finding holes in the secondary.\n\"We just didn't win the one-on-one matchups today,\" safety Micah Hyde said. \"Thank God for our red zone defense.\"\nThe Packers started strong and finished barely in front. Running back James Starks had touchdowns on a 65-yard run and a 5-yard pass in the first quarter.\nGreen Bay went up for good after quarterback Aaron Rodgers found James Jones for an 8-yard pass in the corner of the end zone for a 24-17 lead with 40 seconds left in the third quarter.\nThe defense allowed Josh Lambo 's 32-yard field goal with 11:14 left.\nBut the Packers came up with their most important stop at the end.\nThe battered Packers offense did just enough.\n\"We don't need to win pretty every week. We'd like to,\" Rodgers said.\nHe was 16 of 29 for 255 yards. At one point, Rodgers had as many completions as Keenan Allen had receptions midway through the fourth quarter.\n\"We should have scored 40, we should have. And that's what's frustrating, because our defense played their tail off,\" Rivers said.\nBut a hip injury kept Allen sidelined for much of the second half. He wound up with 14 receptions for 157 yards.\nRookie running back Melvin Gordon was benched in the second half after two fumbles. He finished with seven carries for 29 yards in a disappointing return to the state where he set records in college with the Wisconsin Badgers.\nNOTES: Starks finished with 112 yards rushing on 10 carries. He started for Eddie Lacy , who had 3 yards on four attempts. Lacy, who sprained his right ankle earlier this season, played with his right foot heavily taped. ... S Eric Weddle left in the second half with an unspecified injury.\n___\nAP NFL website: www.pro32.ap.org and www.twitter.com/AP_NFL", "external_links": [], "published": "2015-10-19T00:50:00.000+03:00", "crawled": "2015-10-19T05:03:13.582+03:00", "highlightTitle": ""}