{"organizations": [], "uuid": "9e7ff5716b19c2c21d32dd875a716219d222ce1d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dallasnews.com", "main_image": "http://www.dallasnews.com/incoming/20151002-1443818926-ns_13cowboysny16gm.jpg.ece/BINARY/original/1443818926-ns_13cowboysNY16gm.jpg", "site_section": "http://www.dallasnews.com/sports/dallas-cowboys/", "section_title": "Dallas Cowboys News - Sports News for Dallas, Texas ", "url": "http://www.dallasnews.com/sports/dallas-cowboys/20151002-jerry-jones-best-answer-for-not-having-dez-bryant-includes-more-gavin-escobar.ece", "country": "US", "title": "Jerry Jones: Best answer for not having Dez Bryant includes more Gavin Escobar", "performance_score": 0, "site": "dallasnews.com", "participants_count": 5, "title_full": "Jerry Jones: Best answer for not having Dez Bryant includes more Gavin Escobar | Dallas Morning News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T23:50:00.000+03:00", "replies_count": 4, "uuid": "e658560baaad72608837a2af7b6d658b85a03114"}, "author": "Jon Machota", "url": "http://www.dallasnews.com/sports/dallas-cowboys/20151002-jerry-jones-best-answer-for-not-having-dez-bryant-includes-more-gavin-escobar.ece#post-0", "ord_in_thread": 0, "title": "Jerry Jones: Best answer for not having Dez Bryant includes more Gavin Escobar", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Brandon Weeden was efficient against the Atlanta Falcons, completing 22 of 26 passes for 232 yards and one interception. He took what the Falcons were giving him and that led to mostly short and intermediate throws.\nBut Cowboys executive vice president Stephen Jones believes the team's starting quarterback will need to go downfield more often to loosen up defensive coverage underneath.\n\"I think Brandon is going to have to step up and show them that he'll go downfield with it and go to the outside receivers,\" Jones said during an interview on the Cowboys' Special Edition show. \"I think there were some opportunities there for him in the second half [vs. Atlanta] that he conservatively decided to pass on that we're probably going to need to start going to as we move forward or we're going to continue to see it get tighter inside that box.\n\"He's got the skill set to do it. Brandon's got a really live arm. He's definitely got the skills to do it.\"\nOnly four players caught passes from Weeden during the 39-28 loss to Atlanta. Wide receiver Terrance Williams and tight end Gavin Escobar were not part of that group. Both will play larger roles if the Cowboys intend on opening up their passing game in New Orleans.\nCowboys owner Jerry Jones discussed both players' involvement during a Friday radio interview.\nWilliams was targeted twice against Atlanta, but finished without a catch for the first time in eight games, including playoffs.\n\"I know how driven he is,\" Jerry Jones said on 105.3 The Fan's G-Bag Nation show [KRLD-FM]. \"I know Michael Irvin, and [Williams] is Michael Irvin-driven. He's Michael Irvin-work ethic. He can really compete. I expect him to compete. I know what was bothering him, that he didn't feel like he got a chance or didn't compete. I think we should expect to see him get some balls. He knows how to compete.\"\nEscobar, who wasn't targeted, was on the field for only eight offensive snaps. The Cowboys owner and general manager is looking for the former second-round pick to take on a larger role with Dez Bryant out.\n\"Escobar does it differently, but he's got a huge [catch] radius, which means a wide way to throw it,\" Jerry Jones said. \"Escobar, at 6-7, with a significant leaping ability and those arms should be able to contest balls right and left. That answers your question right there.\n\"He's certainly got the speed to get in the routes, so yes, I've always thought the real best answer for not having Dez out there is a combination of things, but included Escobar.\"\nMORE MUST-READ COWBOYS Is Brandon Weeden the answer at QB?\nCowboys VP: Brandon Weeden needs to step up, missed opportunities in Atlanta game\nMoore: The truth about Cowboys QB Brandon Weeden's ability to throw\nCowlishaw: Cowboys must test Brandon Weeden soon, because Patriots sure will\n10 things to know about Cowboys QB Brandon Weeden, including the first impression he made on Dez Bryant\nDo the Dallas Cowboys have a quarterback controversy? Â\nMeet new Cowboys QB Matt Cassel Â How quickly can Matt Cassel pick up the Cowboys playbook? He does have one advantage\nCassel fulfills childhood dream, becomes Dallas Cowboy after pregnant wife approves Â\n10 things you might not know about new Cowboys quarterback Matt Cassel\nSherrington: Trading for Matt Cassel more proof Cowboys are all in for 2015; will he eventually beat out Weeden? Â\nLatest news/analysis Â Cowboys' Morris Claiborne: Seeing how coaches study film has paid off\nJerry Jones: Best answer for not having Dez Bryant includes more Gavin Escobar Â\nCowboys send RB Joseph Randle message after his career day\nGeorge: Lance Dunbar, Cowboys' Darren Sproles starter kit, will return to play in hometown New Orleans\nChristine Michael in the mix to be on Cowboys' active roster\nSaints vs. Cowboys analysis/predictions Â Cowboys-Saints GameDay: Analysis, matchups and why three pick New Orleans\nSaints planning to start Drew Brees against Cowboys\nSabin: Why Rod Marinelli's Cowboys defense has succeeded where Rob Ryan's failed\nSportsDay experts, more give their Week 4 NFL picks\nWhat Dallas Morning News columnists are saying Â Cowlishaw: Need 3 more wins before Romo returns? Here are Dallas' best chances Â\nGosselin: Why Cowboys' underdog status could help them vs. Saints ... and it better\nRick Gosselin's NFL rankings: How far have Cowboys dropped behind ... the Raiders?\nGosselin: Cowboys need to quickly figure out what they have in new RB Christine Michael\nSherrington: I'm not so sure Tony Romo will be back after 8 games Â\nBob Sturm and Babe Laufenberg exclusive analysis Â Sturm: What kind of impact Greg Hardy will have when he returns; is Terrance Williams a No. 2 WR?\nSturm's Marinelli Report: Cowboys defense was kicked in the teeth\nSturm: Cowboys' offensive line shockingly mediocre -- this cannot happen\nLaufenberg: It's become clear that Cowboys miss DeMarco Murray in run game\nLaufenberg: On if Cowboys should look to Matt Cassel as an answer at QB Â\nFun stuff\nCowboys Q&A: Tyler Clutts explains rookie songs, being in chess club, the weird things his son eats and more\nCowboys fans tear into Brandon Weeden in Top 25 fan-made memes\nCowboys' Jason Witten admits he hasn't tasted 'Witten's Lucky Stars' cereal Â\nThe 15 funniest memes from Cowboys' loss; does the Pope hate Dallas?\nVideo: 'Dallas Cowboys No. 1 fan' Miss Price talks Saints, flirts with Travis Frederick Â\nOn Twitter:\n @jonmachota", "external_links": ["http://beta.sportsdaydfw.com/dallas-cowboys/cowboys/2015/09/28/funniest-15-memes-cowboys-loss-pope-hate-dallas", "https://twitter.com/jonmachota", "http://beta.sportsdaydfw.com/dallas-cowboys/cowboysheadlines/2015/10/01/sportsday-experts-give-week-4-nfl-picks", "http://beta.sportsdaydfw.com/dallas-cowboys/cowboys/2015/10/01/cowboys-qa-tyler-clutts-explains-rookie-songs-being-in-chess-club-the-weird-things-his-son-eats-and-more", "http://beta.sportsdaydfw.com/dallas-cowboys/cowboysheadlines/2015/09/22/10-things-might-know-new-cowboys-quarterback-matt-cassel", "http://beta.sportsdaydfw.com/dallas-cowboys/cowboysheadlines/2015/09/29/cowboys-fans-tear-brandon-weeden-top-25-fan-made-memes"], "published": "2015-10-02T23:50:00.000+03:00", "crawled": "2015-10-03T11:36:45.846+03:00", "highlightTitle": ""}