{"organizations": ["AP"], "uuid": "ef4f58a64a38a758b8ae8036f12e70c007debfd4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.courier-journal.com", "main_image": "http://www.gannett-cdn.com/-mm-/1f9cae5bb01fa16654bf1117025171f98c6638c3/c=0-169-4926-2952&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/06/19/Louisville/Louisville/635703191727173281-AP273661143247.jpg", "site_section": "http://rssfeeds.courier-journal.com/courierjournal/sports", "section_title": "Courier Journal - Sports", "url": "http://www.courier-journal.com/story/sports/2015/10/24/iu-hangs-michigan-state-until-4th-quarter-loses-52-26/74245052/", "country": "US", "title": "Churchill Downs to bid for 2018 Breeders' Cup", "performance_score": 0, "site": "courier-journal.com", "participants_count": 0, "title_full": "Churchill Downs to bid for 2018 Breeders' Cup", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T01:09:00.000+03:00", "replies_count": 0, "uuid": "ef4f58a64a38a758b8ae8036f12e70c007debfd4"}, "author": "", "url": "http://www.courier-journal.com/story/sports/2015/10/24/iu-hangs-michigan-state-until-4th-quarter-loses-52-26/74245052/", "ord_in_thread": 0, "title": "Churchill Downs to bid for 2018 Breeders' Cup", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jonathan Lintner", "Charlie Riedel"], "text": "Churchill Downs to bid for 2018 Breeders' Cup Jonathan Lintner , @JonathanLintner 6:09 p.m. EDT October 24, 2015 Spectators watch the eighth race from under the Churchill Downs' Twin Spires before the 2013 Oaks. (Photo: Charlie Riedel, AP) 8 CONNECT 12 TWEET LINKEDIN COMMENT EMAIL MORE \nChurchill Downs wants the Breeders' Cup back in Louisville. \nThe home of the Kentucky Derby, which last hosted the championships in 2011, is preparing to bid for the event's return in 2018, a track spokesman said Saturday. \n\"We've had a great relationship with the Breeders' Cup over the years,\" said Churchill's Darren Rogers. \"Some of the most successful Breeders' Cups when it comes to attendance and handle have been conducted at Churchill Downs. We look forward to submitting a bid.\" \nAfter next weekend's races at Keeneland, the Breeders' Cup will go to California's Santa Anita Park in 2016 and Del Mar in 2017. Both Keeneland and Del Mar are first-time hosts of the championships, which include the $5 million Classic, North America's richest race. \nChurchill is tied with Santa Anita having hosted a record eight Breeders' Cups. If the Lexington-based organization awards the 2018 date to another track, Churchill will then shoot for 2019. \nBreeders' Cup COO Bob Elliston told BloodHorse.com his board of directors will meet in December about a 2018 host site. Last year marked the first time the Breeders' Cup announced its track lineup three years in advance, a trend Elliston hopes to continue. \nThat the event will go at least six years between stops in Louisville created a perceived rift between the two parties, but Rogers said there's no hostility. \nHe noted that Churchill Downs hosted the Breeders' Cup's board of directors last June in its upstairs mansion on Stephen Foster Handicap night. The track also stages a pair of \"Win and You're In\" events for the Juvenile (Iroquois) and Juvenile Fillies (Pocahontas) in September. \n\"For whatever reason, they made decisions a few years ago to go other routes,\" Rogers said. \"But we look forward to continue working with them and welcome them back with open arms down the road.\" \nThis year, Churchill doubled points awarded on its Road to the Kentucky Derby for the $2 million Juvenile, a top spot for promising 2-year-olds hoping to run on the first Saturday in May. Rogers said that was not so much a goodwill gesture to the Breeders' Cup but rather a response to thee years of experience with its points system. \n\"That's a separate issue where we look and analyze each year of different ways we can make it better, and that was a common critique over the first few years,\" Rogers said. \"That race needed to be worth more.\" \nNext weekend, the Juvenile winner will receive 20 Derby qualifying points - enough to typically earn a spot in the first Triple Crown race. 8 CONNECT 12 TWEET LINKEDIN COMMENT EMAIL MORE Read or Share this story: http://cjky.it/1S2JlWi TOP VIDEOS", "external_links": [], "published": "2015-10-25T01:09:00.000+03:00", "crawled": "2015-10-25T03:28:20.166+02:00", "highlightTitle": ""}