{"organizations": [], "uuid": "65b3aac0e33704a6aabe387dff6f428890e26c60", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.philly.com", "main_image": "http://media.philly.com/images/20151024_inq_recruit24-a.JPG", "site_section": "http://www.philly.com/philly_sports.rss", "section_title": "Philly.com Sports", "url": "http://www.philly.com/r?19=961&43=168426&44=336418841&32=3796&7=195227&40=http%3A%2F%2Fwww.philly.com%2Fphilly%2Fsports%2Fhigh_school%2Fpennsylvania%2F20151024_Recruiting__Football_suits_Imhotep_s_Johnson__second_time_around.html", "country": "US", "title": "Recruiting: Football suits Imhotep's Johnson, second time around", "performance_score": 0, "site": "philly.com", "participants_count": 0, "title_full": "Recruiting: Football suits Imhotep's Johnson, second time around", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T06:32:00.000+03:00", "replies_count": 0, "uuid": "65b3aac0e33704a6aabe387dff6f428890e26c60"}, "author": "", "url": "http://www.philly.com/r?19=961&43=168426&44=336418841&32=3796&7=195227&40=http%3A%2F%2Fwww.philly.com%2Fphilly%2Fsports%2Fhigh_school%2Fpennsylvania%2F20151024_Recruiting__Football_suits_Imhotep_s_Johnson__second_time_around.html", "ord_in_thread": 0, "title": "Recruiting: Football suits Imhotep's Johnson, second time around", "locations": ["Southeastern Pa."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Imhotep", "Johnson"], "text": "More coverage: Southeastern Pa. high school sports \"A teammate did a little rip-through move and punched me right in my tooth and my tooth got a little loose,\" Johnson said, smiling. \"I was like, 'I'm done!' It's still loose right now.\"\nJohnson didn't come back after that day. Instead, he returned his focus to junior varsity basketball, despite prodding from his football teammates and coaches. \nHe stayed off the football field until five games into last season, when he realized his JV basketball career wouldn't lead to a college scholarship. \nIn that short period of time, he has earned offers from Temple, Villanova, Monmouth, Delaware, Towson and Rhode Island with Illinois and others in pursuit. He was also named a team captain this season for the Panthers, who are undefeated overall and in Public League AAA play (7-0, 4-0). \n\"He's just a young man that embraces adults and the guidance from adults,\" Imhotep coach Albie Crosby said. \"He's not a young person that fights with adults, and that has helped him.\" \nCrosby credited former offensive line coach Greg Little (now at Mastbaum) with \"showing (Johnson) the way.\" \nCrosby said the Panthers current line coach, former Neshaminy boss Mark Schmidt, \"taught (Johnson) the game.\" \nAnd don't think that first shot to his chompers weakened Johnson's physical resolve. \n\"I love it,\" he said. \"My third day of practice last year, I popped one of my teammates real good. After that feeling, I just wanted to play and hit somebody every day.\" \nJohnson's blend of physicality, brains and leadership have also made him a leader on the team and made someone at home very proud. \n\"Since I'm one of the captains of the football team, I have a purpose now,\" he said. \"Now that I know I have a role to play, I'm doing well. I have A's, and I got student of the month in school (October). I have two B's but those two B's will come up in two weeks, I promise you that. I promised all my teachers that.\" \nThat pledge may also have been made to his aunt, Rhonda Johnson, who raised her nephew since he was three months old. She also raised his two brothers, Tamir and Amir, who graduated from Imhotep in 2007 and 2013, respectively. \nTamir played basketball at Central Connecticut State. Amir plays football at Delaware Valley University. \n\"I'm very proud of (Jahmir),\" Rhonda said in a phone interview. \"I'm very proud of the three boys that I raised.\" \nThere is one thing for certain: Rhonda no longer needs to worry about mouthpieces. \n\"I wear my mouthpiece everywhere now,\" Johnson said. \"Even at camps and stuff in the summer, I had my mouthpiece in all the time.\" \n@AceCarterINQ Offers/Interest \nJameer Bryson , West Catholic, senior WR/DB. Offers: New Hampshire, Maine, Stony Brook, Rhode Island, and Towson. \nCraig Jones , West Catholic, senior WR/DB. Offers: Maine, Stony Brook, Rhode Island, and Central Connecticut. \nCharlie Timite , Simon Gratz, senior OL/DL. Offers: Massachusets, Maine, and Towson. \nYeedee Thaenrat, Father Judge, senior RB/DB. Offers: Boston College, Rutgers, Army, and Navy \nGianni Cruel , Archbishop Wood, senior WR/DB. Offer: Delaware State. \nPrince Smith , Imhotep, senior DB. \nOffer: Delaware State. \nNasir Lewis , Imhotep, senior WR. \nOffer: Youngstown State. \nIsheem Young , Imhotep, sophomore, ATH. Offers: Temple, Wisconsin \nJustin Harris , Imhotep, sophomore, WR. Offer: Monmouth \n- Aaron Carter", "external_links": [], "published": "2015-10-24T06:32:00.000+03:00", "crawled": "2015-10-24T06:56:26.021+03:00", "highlightTitle": ""}