{"organizations": [], "uuid": "4e0cc30b45be608edd602782dc9d246573ca3221", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.fox8live.com", "main_image": "http://WVUE.images.worldnow.com/images/5760879_G.jpg", "site_section": "http://www.fox8live.com/", "section_title": "New Orleans News, Weather, Saints - FOX 8 WVUE New Orleans News, Weather, Sports, Social", "url": "http://www.fox8live.com/story/30284301/city-expected-to-ask-taxpayers-to-help-with-fire-fighters-settlement", "country": "US", "title": "City expected to ask taxpayers to help with fire fighter's settl", "performance_score": 0, "site": "fox8live.com", "participants_count": 1, "title_full": "City expected to ask taxpayers to help with fire fighter's settl - FOX 8 WVUE New Orleans News, Weather, Sports, Social", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T07:26:00.000+03:00", "replies_count": 0, "uuid": "4e0cc30b45be608edd602782dc9d246573ca3221"}, "author": "Written by: Kimberly Curth, Reporter", "url": "http://www.fox8live.com/story/30284301/city-expected-to-ask-taxpayers-to-help-with-fire-fighters-settlement", "ord_in_thread": 0, "title": "City expected to ask taxpayers to help with fire fighter's settl", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW ORLEANS, LA (WVUE) - A decades-long fight between the city and the firefighters' union has come to an end. The two sides reached a multi-million dollar settlement over backpay and the firefighters' pension. But, the city is now asking taxpayers to help foot the bill.\nIt's been one ugly fight over the years. Mayor Mitch Landrieu even faced house arrest at one point for refusing a judge's order to pay firefighters. Landrieu has long argued the city couldn't afford to do that because it could bankrupt the budget and cripple city services. But, Friday, the mayor and the firefighters' union announced they've finally reached a deal. A $75 million settlement to pay firefighters back pay dating back to the 1980s and fix their pension system.\n\"This settlement also reduces the city's potential legal liabilities by an estimated $160 million plus the pension reforms will save the taxpayers an estimated $275 million over 40 years,\" said Landrieu.\nThe mayor says the deal will keep the city on a positive fiscal track. And, the firefighters' union says the agreement is much needed and a step in the right direction, \"your firefighters, they're out there manning those rigs today, they have put up with this through Hurricane Katrina, through all the ups and downs they have never missed a beat, never missed a roll, never stepped backwards one time and the city owes them a debt of gratitude,\" said Nick Felton, president of the New Orleans Firefighters Association.\nHere's how the deal breaks down. 20 of the 75 million will be paid in the first two years, the remainder of that settlement will be paid over the next 13 to 14 years. A portion of that will come from the general fund, but, in April, the city plans to ask taxpayers to agree to a 2.5 property millage increase. The mayor says the deal will still work even if taxpayers don't approve that millage increase. But, he says it will be alot harder to do, \"this agreement fixes the firefighters' broken pension system, after decades of gridlock, court battles, and uncertainty for our firefighters and for taxpayers together we have solved this problem, hopefully, once and for all,\" said Landrieu.\nThe deal will also require changes to state legislation and city ordinances to go through. The city says if that 2.5 property millage increase is approved by voters in April, taxpayers could expect to see their bill go up $25 a year for a home valued at $100,000 or $50 a year for a $200,000 home. If the millage is not approved, the city says the timetable for paying the $75 million settlement will take longer. The mayor also expects to have additional money in the 2016 budget to hire 50 new firefighters and buy 20 new fire trucks.\nCopyright WVUE 2015. ", "external_links": [], "published": "2015-10-17T07:26:00.000+03:00", "crawled": "2015-10-17T09:43:08.838+03:00", "highlightTitle": ""}