{"organizations": [], "uuid": "0c9278ab5b62caceceff5f2af8e5ee9fd7479b5d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.arizonasportsfans.com", "main_image": "", "site_section": "http://feeds.feedburner.com/ASFNForum", "section_title": "Arizona Sports Fans Network", "url": "http://www.arizonasportsfans.com/vb/showthread.php?t=226922", "country": "US", "title": "What's the deal with DJ Humphries?", "performance_score": 0, "site": "arizonasportsfans.com", "participants_count": 1, "title_full": "What's the deal with DJ Humphries?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T01:32:00.000+03:00", "replies_count": 0, "uuid": "0c9278ab5b62caceceff5f2af8e5ee9fd7479b5d"}, "author": "eastcoastSUN", "url": "http://www.arizonasportsfans.com/vb/showthread.php?t=226922", "ord_in_thread": 0, "title": "What's the deal with DJ Humphries?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posts: 183 What's the deal with DJ Humphries? IMO, the only reason the guy is getting a pass right now is because we have a solid frontline with Massie back and Watford being able to step up in his absence. The discussion of \"he's a developmental project that will be ready by year 2-3\" is moot because first rounders are expected to make an impact immediately. If we drafted for depth and he couldn't beat out Watford (a traditional G) in preseason, this kid is really not ready... A small sample size - take a look at his twitter. Not one mention/retweets about the organization or his teammates, and it's all focused on his glory days at UF. This is expected from a kid who's 21 and still has some time to mature, but am I the only one seeing a lack of connection with the team? I've been thinking about this lately since we are seriously lacking any sort of pass rush and this pick really hampered our D (Stephone Anthony, anyone?). Any word from local press about his development (I don't live in AZ)? Age: 37 Posts: 15,101 Every year at draft time the battle cry here is always, \"draft BPA no matter what instead of drafting for need.\" The team does that this year and the board is full of posts saying that they should have addressed needs with the first pick. He's not ready for prime time! Hopefully he will get there at some point. . . \"...fools and fanatics are always so certain of themselves, but wiser people so full of doubts.\" - Bertrand Russell \"Get your facts first, and then you can distort them as much as you please.\" -Samuel Langhorne Clemens Join Date: Oct 2008 Posts: 10 The only OT I remember playing the position liked he belonged there in his first year was Walter Jones of the Seahawks. Others take more time, the position takes athleticism and intelligence to be successful. Humphries may take more time because he is a little rawer than others who have been drafted there in the first round. Posts: 25,115 Huge, Huge disappointment. To be fair, I didn't think he was the BPA at the point, and now it looks like that is becoming more true as time goes on. Not only is he costing the Cardinals a roster spot, and money, but he is actually costing the team two roster spots since he should be able to beat our Sowell or Massie or Watford. Right now this is Brandon Keith all over again. Inactive cheerleader, hyped to be a OT of the future, most likely will bust out, but instead of it being a 7th round pick, it is a 1st round pick. Horrible. Humphries is the biggest downer about this team outside of Daryl Washington. Location: Tucson Posts: 1,464 I see no problems, Goodwin demands precision, good technique and good communication - Humphries is raw and they stated they he would likely not play this year unless he can beat out a vet. All these articles about how OLinemen coming out in the last decade take longer to transition to the pro game, and we are crying about our last OT when Watford and Massie are playing decent. Age: 53 Posts: 2,993 There were 4 offensive linemen taken before Humphries in the 1st round. How are they doing so far this year? Join Date: Jun 2014 Posts: 518 We saw happens last year when Carson Palmer goes down with injury. We saw what happens last Sunday when Palmer gets beat up. The Cardinals took a \"not ready to play on Sundays\" right tackle in the first round because by the time they drafted in second round they were going to be choosing a \"not good enough to play on Sundays\" right tackle. It's not only quarterbacks who aren't being developed in these one read and chuck it spread offenses. Quote: Originally Posted by CardinalMan The only OT I remember playing the position liked he belonged there in his first year was Walter Jones of the Seahawks. Others take more time, the position takes athleticism and intelligence to be successful. Humphries may take more time because he is a little rawer than others who have been drafted there in the first round. Staley jumped in right away. Joe Thomas stepped in right away. Sure it is rare, but not once in a generation rare. 'Just to reiterate, Derek Anderson isn't hurt.... he has just been benched.' -Sam Rosen Quote: Originally Posted by dreamcastrocks Staley jumped in right away. Joe Thomas stepped in right away. Sure it is rare, but not once in a generation rare. Jake Long stepped right in and was a Pro Bowler (IIRC). It's somewhat rare to be a monster right out of the gate, but I don't think it's too much to wonder out loud why your #1 pick could be a healthy inactive for 12+ games. Quote: Originally Posted by Assface Every year at draft time the battle cry here is always, \"draft BPA no matter what instead of drafting for need.\" The team does that this year and the board is full of posts saying that they should have addressed needs with the first pick. I agree. Quote: Originally Posted by b8rtm8nn I see no problems, Goodwin demands precision, good technique and good communication - Humphries is raw and they stated they he would likely not play this year unless he can beat out a vet. All these articles about how OLinemen coming out in the last decade take longer to transition to the pro game, and we are crying about our last OT when Watford and Massie are playing decent. Yep yep yep. Plus Massie is a FA this coming offseason and has a drinking problem. Watford's ability to move to RT comes as a nice surprise as he has developed nicely for a 4th rd pick from a small school. Veldheer has been a fantastic acquisition but he isn't an elite LT, a very good one but not elite. What if Humphries has the skill set to become an elite LT? If Jared goes down for any length of time who fills in for him? Sowell (shudders at the thought) or Massie moves over?", "external_links": [], "published": "2015-10-09T01:32:00.000+03:00", "crawled": "2015-10-09T17:39:12.822+03:00", "highlightTitle": ""}