{"organizations": [], "uuid": "f7a4d92e3d2986e3dd666628c797c1c979250930", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.timesunion.com", "main_image": "http://www.timesunion.com/img/pages/article/opengraph_default.jpg", "site_section": "http://www.timesunion.com/default/feed/default/feed/Sports-News-64.php", "section_title": "Sports News", "url": "http://www.timesunion.com/sports/article/High-school-football-roundup-6575288.php", "country": "US", "title": "High school football roundup", "performance_score": 0, "site": "timesunion.com", "participants_count": 1, "title_full": "High school football roundup - Times Union", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T08:21:00.000+03:00", "replies_count": 0, "uuid": "f7a4d92e3d2986e3dd666628c797c1c979250930"}, "author": "timesunion.com", "url": "http://www.timesunion.com/sports/article/High-school-football-roundup-6575288.php", "ord_in_thread": 0, "title": "High school football roundup", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CLASS B\nRavena 33, Schalmont 28\nPlayer of the game: Ravena receiver Logan Frangella hauled in four passes for 143 yards and three touchdowns, including the game winner.\nPlay of the game: Frangella gave the Indians the win with a 30-yard touchdown reception with only 48 seconds remaining in the final quarter.\nStat of the game: Ravena quarterback Brady Hughes completed 8 of 11 passes for 216 yards and three scores.\nNotable: Schalmont receiver Zac O'Dell caught eight passes for 130 yards and two touchdowns. ... Sabres quarterback Jake Defayette threw for 156 yards and two scores and ran for 123 yards and another score. ... Ravena kept its perfect record intact and climbed to 7-0 with the win. ... Schalmont suffered its first loss of the year and falls to 6-1.\nJohnstown 20, Broadalbin-Perth 13\nPlayer of the game: Johnstown's Pete Wilson rushed 15 times for 155 yard for the Sir Bills.\nStat of the game: Johnstown quarterback Jack Fitzgerald rushed for 66 yards, scored a TD and threw for 124 yards.\nPlay of the game: Johnstown's Pete Wilson's 53-yard run led to a third-quarter score to keep Johnstown in front.\nTurning point of the game: Johnstown's Fitzgerald came up with a sack in the fourth quarter.\nNotable: Johnstown clinches a playoff spot with the win.\nSchuylerville 54, Lansingburgh 14\nPlayer of the game: Schuylerville running back Joseph Vanderhoof had nine carries for 175 yards and three touchdowns.\nPlay of the game: Vanderhoof's 59-yard touchdown run in the first quarter gave the Black Horses a 7-0 lead.\nStat of the game: Schuylerville piled up 485 yards of offense.\nIchabod Crane 28, Cohoes 14\nPlayer of the game: Zach Herbst rushed for 247 yards and three scores to lead Ichabod Crane to the victory.\nStat of the game: Herbst averaged 19 yards per carry for the Riders.\nNotable: Sean Daly had seven tackles to lead the defense and also hauled in a touchdown catch for Ichabod Crane. ... Tobi Zucco and Alden Bilinski had interceptions for the Riders.\nCLASS AA\nBethlehem 14, Columbia 7\nPlayer of the game: Bethlehem running back Ben Tietjen rushed 21 times for 129 yards and a touchdown.\nPlay of the game: With two minutes left in the game and Columbia driving, Chris Harvey intercepted Columbia quarterback Steve Lindemann to seal the win.\nStat of the game: Bethlehem had 245 rushing yards. Dylan Dubuque had 24 rushes for 115 yards to lead the Blue Devils' ground game.\nSaratoga Springs 47, Ballston Spa 13\nPlayer of the game: Saratoga's Dakota Harvey ran for 227 yards (on just 10 carries) and three touchdowns, as well as turning in a touchdown-saving tackle on defense.\nStat of the game: The teams combined for 544 rushing yards.\nPlay of the game: Late in the third period, Harvey turned a simple dive play into a 76-yard touchdown, breaking numerous tackles.\nTurning point of the game: After Ballston Spa pulled within 14-7 midway through the second period, Saratoga's Brandon Hipsley grabbed a short kickoff, broke through a throng of tacklers and rambled 70 yards for a TD.\nNotable: Saratoga closed the regular season with a 5-0 Empire Division record (7-0 overall) and will be, along with Shaker, one of the top co-seeds in the Class AA sectionals, which open next Friday. ... Ballston Spa (2-3, 3-4) finished fourth in the Empire Division and will travel to Shaker next week.\nLa Salle 15, Schenectady 6\nPlayer of the game: Jack Field completed 7 of 15 passes for 137 yards and two TDs.\nPlay of the game: La Salle's Daniel Desharnais recovered an onside kick which set up the Cadets' second touchdown.\nNotables: Tyler Harwood had 102 yards rushing for La Salle.\nShaker 56, Colonie 8\nPlayers of the game: Shaker's offensive and defensive linemen dominated Colonie for most of the game. The offensive linemen opened up huge holes and allowed Shaker to rush for 381 yards and the defensive linemen held Colonie to only 137 yards of rushing for the game.\nTurning point of the game: After struggling on its first offensive possession, Shaker scored on the first play from scrimmage the next time they had the ball on a 60-yard fullback dive by Ryan Duda .\nPlay of the game: Mikael Brown took the ball around the right end for a 90-yard rushing touchdown to close the third quarter and give Shaker a commanding 49-8 lead.\nStat of the game: Shaker had the ball for just more than three minutes in the first half and ran 14 plays, but managed to score three touchdowns.\nCLASS A\nMohonasen 36, Averill Park 34\nPlayer of the game: Ryan Deguire had a touchdown on a kick return and a rushing touchdown to lead Mohonasen.\nPlay of the game: Nate Stillson scored on a five-yard touchdown run with 1 minute, 40 seconds left to seal the victory for the Mighty Warriors.\nBurnt Hills 47, Scotia 8\nPlayer of the game: John Clayton connected on 8 of 10 passes for three touchdowns to lead Burnt Hills.\nPlay of the game: In the third quarter, on 4th and 15, Clayton lofted a pass to the corner of the end zone, where Jacob Shippey dove and hauled in the 22-yard touchdown strike.\nStat of the game: Rickey Woodley had 213 total yards of offense to lead Scotia.\nQueensbury 40, Green Tech 0\nPlayer of the game: Brett Rodriguez had 23 carries for 230 yards and five touchdowns to lead Queensbury.\nStat of the game: Queensbury rushed for 461 yards.\nNotable: Patrick Conway added 153 yards and one touchdown on the ground for Queensbury. ... Green Tech lost three fumbles.\nCLASS C\nCorinth 61, Chatham 22\nPlayer of the game: Kory Bennett rushed for 159 yards and two touchdowns on just nine carries to lead Corinth.\nNotable: Corinth also got 140 yards from Alex Jenkins and finished with 470 yards rushing for the game.\nStillwater 37, Tamarac 7\nPlayers of the game: Stillwater got a balanced rushing attack with 81 yards from Tyler Reyome and 80 yards each from Dan Morris and Jordan Rychik. All three also scored touchdowns.\nLake George 20, Taconic Hills 14\nPlayer of the game: Lake George QB Nick Motta passed for a touchdown in the first overtime and ran for the game-winning score in the third overtime.\nPlay of the game: Lake George was facing a fourth and 26 when Motta connected with Brett Parsons on a 36-yard screen pass and a touchdown in the first overtime.\nGreenwich 28, Hoosick Falls 18\nPlayer of the game: Mike Brandow of Greenwich rushed 27 times for 155 yards and two TDs.\nPlay of the game: With Greenwich up 21-18 with three minutes left, Brandow broke a 44-yard run to set up his own TD two plays later to seal the win.\nMechanicville 33, Watervliet 14\nPlayer of the game: Mark Debates had 29 carries for 257 yards and four touchdowns to lead Mechanicville.\nCLASS D\nRensselaer 24, Canajoharie 20\nPlayer of the game: Rensselaer quarterback Christopher Spath accounted for 194 yards of total offense with four TDs.\nPlay of the game: Quinton Foust's 40-yard touchdown reception early in the second quarter gave the Rams a 6-0 lead.\nStat of the game: Rensselaer's run defense held Canajoharie to minus 11 yards.\nNONLEAGUE\nTroy 50, Niskayuna 0\nPlayer of the game: Damani Soares rushed for three touchdowns, two in the first quarter, and caught another to lead Troy.\nPlay of the game: Soares gave Troy a 21-0 lead with a 62-yard TD catch in the first quarter.", "external_links": [], "published": "2015-10-17T08:21:00.000+03:00", "crawled": "2015-10-17T08:22:44.964+03:00", "highlightTitle": ""}