{"organizations": [], "uuid": "8c74547e9438523c49a9616e9b55f705e6448881", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sun-sentinel.com", "main_image": "http://www.trbimg.com/img-5619e20e/turbine/fl-miami-hurricanes-fsu-game-1011-20151010", "site_section": "http://www.sun-sentinel.com/sports/fau-owls", "section_title": "FAU Owls Sports News - Sun Sentinel", "url": "http://www.sun-sentinel.com/sports/miami-hurricanes/fl-miami-hurricanes-fsu-game-1011-20151010-story.html", "country": "US", "title": "Miami falls to Florida State 29-24", "performance_score": 0, "site": "sun-sentinel.com", "participants_count": 1, "title_full": "Miami falls to Florida State 29-24 - Sun Sentinel", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T05:13:00.000+03:00", "replies_count": 0, "uuid": "8c74547e9438523c49a9616e9b55f705e6448881"}, "author": "Christy Cabrera Chirinos", "url": "http://www.sun-sentinel.com/sports/miami-hurricanes/fl-miami-hurricanes-fsu-game-1011-20151010-story.html", "ord_in_thread": 0, "title": "Miami falls to Florida State 29-24", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Every year, in South Florida, it's one of the most anticipated games on the schedule.\nBut ahead of Saturday's matchup — the 60th between Miami and Florida State — many across the state and the nation couldn't help but wonder if this rivalry, one of the most storied in college football, had lost some of its luster.\nFSU came into the game having won the previous five matchups. And the Hurricanes, reeling after an embarrassing loss to Cincinnati last week, have been frustratingly inconsistent all season.\nYet on Saturday night at Doak Campbell Stadium, Miami and FSU delivered yet another classic, one that Miami came tantalizingly close to winning before Dalvin Cook scored the eventual game-winning score on a 23-yard touchdown run that lifted the Seminoles to a 29-24 win in front of a frenzied crowd of 82,329.\nCook finished with a game-high 222 rushing yards on 22 carries with three touchdowns, two rushing and one through the air.\n\"We did a lot of things right. But they made a few more plays than we did...,\" UM coach Al Golden said. \"We had opportunities; we didn't do it.\"\nPerhaps no yearly matchup in college football has spawned a greater collection of NFL-caliber talent--certainly over the past three decades--than the annual Miami Hurricanes-Florida State Seminoles game. Here are a collection of the series' standout performances----throughout a game, or even in a crucial moment of a win.\n(Steve Svekis) Cook's go-ahead touchdown came one drive after Miami took its lone lead of the game, when quarterback Brad Kaaya connected with Stacy Coley on a 29-yard touchdown pass with 10:02 left.\nAnd though the Hurricanes had a last-minute chance to try to regain the lead, Kaaya — who had a career-high 405 passing yards — had three passes batted down on the final drive. Miami's bid at the upset of the 12th-ranked Seminoles fell just short.\nMiami has lost six straight to its rival, and now, the Hurricanes have to regroup to avoid the kind of letdown they've had after their last two losses to the Seminoles.\nDave Hyde: Miami can't close out comeback against FSU Dave Hyde For a moment Saturday night, for one teasing moment, everything shimmered in front of Miami in a way it never quite had before in the Al Golden Era.\nRedemption? Rejuvenation? And, who knows, maybe even the grounding of a certain banner-toting airplane at games?\nA magical pass-and-catch from Brad...\nFor a moment Saturday night, for one teasing moment, everything shimmered in front of Miami in a way it never quite had before in the Al Golden Era.\nRedemption? Rejuvenation? And, who knows, maybe even the grounding of a certain banner-toting airplane at games?\nA magical pass-and-catch from Brad...\n(Dave Hyde) \"We did a lot of things right. But they made a few more plays than we did...,\" UM coach Al Golden said. \"We had opportunities; we didn't do it.\"\nFor the Hurricanes, the first few minutes looked eerily similar to last week's loss at Cincinnati.\nAgain, Miami saw an opponent get off to a quick start. Again, the Hurricanes looked to be in serious trouble. And yet again, the offense found a little bit of a spark, and the defense made a few key stops to keep the game from getting completely out of reach before the half.\nWhat was slightly different though was how this time, Miami's opponent dominated on the ground.\nIn the Cincinnati game it was quarterback Hayden Moore that shone for the Bearcats, here in Tallahassee it was a player the Hurricanes know well — Cook.\nThe former Miami Central star and teammate of Miami running back Joe Yearby missed time this week in practice while dealing with a hamstring injury suffered against Wake Forest last week, but he showed no ill-effects of that or anything else in the first half Saturday.\nFor the second straight week, Cook scored a long touchdown run on his first carry of the game.\nAgainst Wake it was a 94-yarder, against Miami it was a 72-yard run, during which he sprinted past multiple Miami defenders who couldn't catch the speedy sophomore as he got into the end zone.\nWhile the Hurricanes answered with an 11-play, 62-yard drive that culminated with a 30-yard field goal from Michael Badgley, Cook made his presence felt again on FSU's ensuing drive.\nThis time, it was Cook catching a pass from Everett Golson and going 36 yards for a touchdown that extended FSU's lead to 14-3 after Roberto Aguayo's extra point.\nGolson, who has struggled this season, was a force Saturday. He completed 9 of his first 10 passes for 124 yards before going on to finish the night 25 of 33 for 291 yards.\nThe Seminoles pushed their lead to 17-3 after a 22-yard field goal from Aguayo, and it was after that that Miami's offense found a little bit of life thanks to Kaaya and Rashawn Scott.\nThe duo connected three times on the drive, including on a beauty of a 58-yard catch from Scott that seemed a precursor for what was to come late from the Hurricanes offense.\nScott finished with six catches for 108 yards, while Coley had a career-high 139 yards on seven catches.\n Miami Hurricanes Florida State Seminoles Cincinnati Bearcats", "external_links": ["http://www.trbimg.com/img-546791d9/turbine/sfl-miami-hurricanes-fsu-great-performances-20-003", "http://www.trbimg.com/img-54679549/turbine/sfl-miami-hurricanes-fsu-great-performances-20-001", "http://www.trbimg.com/img-5619dbad/turbine/fl-hyde-miami-florida-state-column-1011-20151010", "http://www.trbimg.com/img-5619e20e/turbine/fl-miami-hurricanes-fsu-game-1011-20151010", "http://www.trbimg.com/img-546793e9/turbine/sfl-miami-hurricanes-fsu-great-performances-20141115"], "published": "2015-10-11T05:13:00.000+03:00", "crawled": "2015-10-11T07:27:48.213+03:00", "highlightTitle": ""}