{"organizations": [], "uuid": "3233439e1390cad6dd2ebf7a4542b9fbf91ba002", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sportsnews.com.au", "main_image": "http://sportsnews.com.au/defaultimage.jpg", "site_section": "http://www.sportsnews.com.au/category/tennis/feed", "section_title": "Sports News Australia » Tennis News", "url": "http://www.sportsnews.com.au/tennis/tomic-stuns-gasquet-in-shanghai/159995", "country": "CA", "title": "Tomic stuns Gasquet in Shanghai", "performance_score": 0, "site": "sportsnews.com.au", "participants_count": 1, "title_full": "Tomic stuns Gasquet in Shanghai", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T23:56:00.000+03:00", "replies_count": 0, "uuid": "3233439e1390cad6dd2ebf7a4542b9fbf91ba002"}, "author": "AAP", "url": "http://www.sportsnews.com.au/tennis/tomic-stuns-gasquet-in-shanghai/159995", "ord_in_thread": 0, "title": "Tomic stuns Gasquet in Shanghai", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tomic stuns Gasquet in Shanghai Posted by AAP + on 16/10/2015 at 7:56 am   \nBernard Tomic has continued his surge up the world tennis rankings with an impressive three-set victory over Frenchman Richard Gasquet that propelled him into the quarter-finals of the Shanghai Masters. \nTomic beat Gasquet 6-3 6-7 (7-1) 6-4 to set up a last eight encounter on Friday against world No.1 Novak Djokovic, who sped through the third round with a 6-2 6-3 win over Feliciano Lopez in just 71 minutes as he continued his magical run in China. \nTomic’s victory over Gasquet holds the 22-year-old in good stead for the Australian Open in January as he chases a higher seeding for the first grand slam tournament of the new season. \nThe gifted Queenslander, who cracked the top 20 ranking for the first time last week, appears to have turned his life around and it is showing in his performances. \n“It’s not easy playing a guy you’ve lost to six times from the seven times you’ve played,” Tomic told Fairfax Media. “I had to go out there changing my game. I served very good today and I kept on the baseline; normally against him I get pushed back and it’s the worst thing to allow myself against him. \n“I’m attacking on the right points and I’m aggressive on the baseline, and that’s what’s causing me to play very good and I’m serving very well on top of that. So there’s a few areas I’d like to work on over the next few weeks, but for now it’s been pretty good and I have to go for it against Novak.” \nDjokovic’s current unbeaten run dates back to the Cincinnati Masters final in August and with his win in Beijing, he became the first man to top $US15 million ($A20.5 million) in prize money in a single year. \nThe No.1 said there was still room for improvement despite putting together what he calls his best season yet, after winning three out of four Grand Slam finals to reach a career total of 10. \nBut while Djokovic has been flying through his matches, Tomic’s late-night win over Gasquet in little over two hours will give him less time to prepare and recover for their big clash. \n“Obviously it’s the worst time to finish, so I have to try as best as I can,” Tomic said. “I’m playing Novak, the worst thing now for me is I don’t have much recovery (time), but I try my best. \n“The last eight matches, nine matches, he hasn’t gone worse than 6-3 in a set … it’s amazing the way he’s playing. I know in Wimbledon in the third round I played well but I had no chances and maybe my chances will come this time.” \nDjokovic admitted his confidence was sky high as he remained in the form that took him to his sixth China Open title last week. \n“There is no secret. I guess it depends how do you feel on a given day, depends how well your opponent is playing, how well you’re playing. It’s a combination of things,” said the two-time Shanghai champion. \n“You can’t just expect to win all the time very comfortably, but I’ve been doing so for the last week-and-a-half. \n“Obviously it’s giving me more confidence.” \nThe winner of the Djokovic-Tomic clash will meet either Andy Murray or Tomas Berdych in the semi-finals.  ", "external_links": [], "published": "2015-10-15T23:56:00.000+03:00", "crawled": "2015-10-16T06:23:54.705+03:00", "highlightTitle": ""}