{"organizations": [], "uuid": "e9e6db6ea81a40e2832548687f27aa86b96f88d6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "http://si.wsj.net/public/resources/images/BN-KX505_NYMETS_G_20151023164231.jpg", "site_section": "http://www.wsj.com/public/page/news-sports-scores.html", "section_title": "Sports News - The Wall Street Journal - Wsj.com", "url": "http://www.wsj.com/articles/the-mets-make-a-run-playing-small-ball-1445636098", "country": "US", "title": "The Mets Make a Run Playing Small Ball", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "The Mets Make a Run Playing Small Ball - WSJ", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T01:34:00.000+03:00", "replies_count": 0, "uuid": "e9e6db6ea81a40e2832548687f27aa86b96f88d6"}, "author": "Jared Diamond", "url": "http://www.wsj.com/articles/the-mets-make-a-run-playing-small-ball-1445636098", "ord_in_thread": 0, "title": "The Mets Make a Run Playing Small Ball", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "0 COMMENTS Mets manager Terry Collins likes to point out that his team’s offense revolves around power, not speed.\nFollowing the acquisition of slugger Yoenis Cespedes on July 31, the Mets hit more home runs than anybody in the National League, a surge that propelled them to their first division championship since 2006. Meanwhile, they stole just 51 bases during the regular season, a total that ranked last in the NL and 29th in all of baseball.\nBut suddenly, in the postseason, the Mets have reinvented themselves, transforming into a unit that uses their legs as an integral part of their attack. They lead all teams with nine stolen bases this postseason, including seven in eight attempts during their sweep of the Cubs in the NL Championship Series.\nThat aggressiveness on the bases has played a key role in bringing them to this point, preparing for the World Series for the first time in 15 years. Though the Mets won’t say whether they intend to continue utilizing this strategy in the next round, their recent success in the running game has fundamentally changed their arsenal.\n“Those things become magnified when you get to the postseason,” said outfield coach Tom Goodwin, who oversees the Mets’ baserunning. “If you don’t do them, then you never really notice. We didn’t do it during the year, anyway, so what’s the big deal if we did it now? But I think we’ve proven to ourselves that the result ends up pretty good when we could do it.”\nDespite their NLCS base-stealing frenzy, Collins emphasized that how the Mets approached the Cubs might not apply to their foe in the World Series. In a news conference Friday, as a handful of players participated in a voluntary workout here at Citi Field ahead of Tuesday’s Game 1, Collins reiterated that the Mets “are a team that’s based on power.”\nNonetheless, the Mets viewed the Cubs as an easy target, and they took advantage, instructing their players in their pre-series scouting meetings to look for chances to run. Chicago caught prospective base-stealers just 21.7% of the time, the worst clip in the NL.\nThe Cubs’ reputation for letting teams run wild held true in the NLCS. Cespedes’s steal of third in the sixth inning of Game 3 led directly to the winning run, as he scored on a wild pitch. Outfielder Curtis Granderson gave the Mets a key run in Game 2 in similar fashion, swiping third and subsequently coming home on an infield single.\n“It’s worked out perfectly,” bench coach Bob Geren said. “Now, will that be the same next series? I don’t know. But baserunning is about opportunities. If there are opportunities, take them.”\nThis time of year, those opportunities loom even larger.\nTeams historically strike out more frequently in the playoffs and connect on fewer extra-base hits, making it especially important to advance into scoring position. The quality of the pitching in the postseason often prevents lineups from stringing hits together, heightening the significance of each individual base runner. (Then again, no other team ever had Daniel “Babe Ruth” Murphy in the middle of their lineup, but never mind.)\nThat doesn’t mean the Mets will keep this level of running up in the World Series. But for the first time all year, their opponents must at least honor the possibility of the Mets trying to steal bases.\nIn the Mets’ mind, that alone makes their base-stealing bonanza against the Cubs a worthwhile endeavor. Pitchers concerning themselves with runners tend to throw more fastballs, potentially leading to a more hittable pitch for the batter.\nOr, as Geren put it, “A stolen base is great, but sometimes just the threat of a stolen base is a benefit.”\n“Just the thought is going to be something that’s big,” said utility infielder Kelly Johnson. “Whether it’s making the pitcher think about the runner a little bit, or the bench coach or the manager thinking a little bit about putting a slide-step on—something that’s going to help the hitter out in the long run.”\nThe Mets have long stressed that they have players capable of stealing more bases than they showed during the season. Granderson, who stole 25 as recently as 2011, only attempted 17 this year. Murphy stole 23 in 2013, but tried four times in 2015. Third baseman David Wright once stole 34 bases in a season, but injuries have largely stripped away that component of his game.\nStealing bases doesn’t mesh with a team that relies on home runs, and for the most part, the Mets set up their offense to avoid giving away outs on the bases. But at the very least, this postseason has demonstrated that when the Mets want to run, they can.\n“It’s important to be aggressive on the base paths if you’re going to make it,” Geren said. “You don’t run just to run to try to change your style.”", "external_links": [], "published": "2015-10-24T01:34:00.000+03:00", "crawled": "2015-10-24T03:33:25.296+03:00", "highlightTitle": ""}