{"organizations": ["Cincinnati Bengals"], "uuid": "a7a5f4a758bcaa5053af06b1f7e40a85dcc7c2db", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cincinnati.com", "main_image": "http://www.gannett-cdn.com/-mm-/767e801f5e2c1cbc95495495e360a186ca2e9590/c=0-21-3009-1721&amp;r=x633&amp;c=1200x630/local/-/media/2015/08/04/Cincinnati/Cincinnati/635743073732275710-080415-BENGALS-CAMP-0195.jpg", "site_section": "http://rssfeeds.cincinnati.com/cincinnati-sports", "section_title": "Cincinnati - Sports", "url": "http://www.cincinnati.com/story/sports/nfl/bengals/2015/09/30/bengals-notes-dennard-could-see-field/73105470/", "country": "US", "title": "Bengals notes: Dennard could see the field", "performance_score": 0, "site": "cincinnati.com", "participants_count": 0, "title_full": "Bengals notes: Dennard could see the field", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T00:02:00.000+03:00", "replies_count": 0, "uuid": "a7a5f4a758bcaa5053af06b1f7e40a85dcc7c2db"}, "author": "", "url": "http://www.cincinnati.com/story/sports/nfl/bengals/2015/09/30/bengals-notes-dennard-could-see-field/73105470/", "ord_in_thread": 0, "title": "Bengals notes: Dennard could see the field", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Adam Jones", "Paul Dehner Jr.", "Paul Brown", "Dennard", "Darqueze Dennard", "Wallace Gilberry", "Jamaal Charles", "Mario Alford"], "text": "Bengals notes: Dennard could see the field Paul Dehner Jr. , pdehnerjr@enquirer.com 5:02 p.m. EDT September 30, 2015 An injury to Adam Jones opens up the chance Darqueze Dennard plays on defense Sunday, Wallace Gilberry gushes about friend Jamaal Charles and updating Bengals injuries. Cincinnati Bengals cornerback Darqueze Dennard, right, defends wide receiver Mario Alford during Cincinnati Bengals training camp, Tuesday, Aug. 4, 2015, on the practice fields adjacent to Paul Brown Stadium (Photo: The Enquirer/Kareem Elgazzar) \nBengals cornerback Darqueze Dennard waits. Twenty games into his professional career, the 2014 first-round pick has been forced to perfect patience. \nDue to an injury in the preseason, he lost out on the battle for the starting cornerback position and instead found himself fourth on the depth chart behind Adam Jones, Dre Kirkpatrick and Leon Hall. No matter how much he wants to be part of a cornerback rotation, it's not happening at this point. \n\"The cards have been dealt,\" Dennard said. \nHe could receive a new hand this weekend, though. Jones is battling an elbow injury and appears questionable to play Sunday against Kansas City. Kirkpatrick hurt his shoulder against Baltimore and wore a sling earlier this week before returning to practice Wednesday. He looks probable to play. Still, if Jones can't go, eyes will turn to Dennard to fill in for the first significant action of his career. It's a Cincinnati homecoming for Chiefs tight end Travis Kelce \nUnderstanding the process, Dennard knows not to let any possibility alter his approach. \n\"I go in every week the same: Hopeful,\" Dennard said. \"If they play they play, I just do what I do on special teams. I just do whatever I can to help the team. Kind of just go with the flow.\" \nThe flow thus far has meant 22 snaps during the blowout against Oakland but otherwise watching Jones, Kirkpatrick and Hall man the secondary in front of George Iloka and Reggie Nelson. \nLast season, Dennard managed but 41 defensive snaps, the fewest of any first-round pick, despite drawing high praise from coaches. \nMarvin Lewis insists Dennard plays on the same level as those in front of him and could be interchangeable. \n\"His time will come,\" Lewis said. \"We need all these guys. His production in other areas is great. We got to keep it up. He's had a great couple weeks of practice since coming back from the injury he suffered in training camp. That's what you got to do. You got to go and be ready. That's the hardest part of the NFL is staying ready and working on your craft all the time every day and when your number is called being ready to go and respond.\" \nUnfortunately for Dennard, but fortunately for the Bengals Jones enjoyed arguably his best season as a professional, Kirkpatrick's been solid and Hall repeatedly made critical stops on quick hits to the outside, including a key two-point conversion tackle against San Diego. \nWith safety George Iloka also fighting an ankle injury that could mean snaps for Shawn WIlliams at safety, or in certain situations Leon Hall could drop back. That could provide another entry point for Dennard. \nThe Bengals depth at the corner position serves as a clear luxury in a league where third and fourth corners are exploited weekly. And who knows, depending on how this week goes, it could be a chance for Dennard to make his defensive impact. \n\"Come in each week, get better at playing corner and come Sundays do whatever to help the team on special teams to win,\" Dennard said. \"And just when you get your shot make the best of it.\" Walkthru: Revisionist history on Carson Palmer \nGILBERRY GUSHES OVER CHARLES: Few know Chiefs running back Jamaal Charles like Wallace Gilberry. The Bengals defensive end came into the league the same year as Charles and they were teammates for all four years Gilberry played for the Chiefs. More than that, they ended up roommates. \nThe two still are close friends and that's why he'll be spreading the word to his defensive teammates about how Charles can ruin a day in a hurry. Actually, in about 4.36 seconds, the same as his Combine 40-yard-dash time. \n\"He's the best in the business,\" Gilberry said. \"I'm not saying that because he's my friend. He has numbers to prove what I'm saying and everyone else is saying. You give a guy like that a glimpse of daylight he's going to take advantage of it.\" \nCharles, 29, averaged 1,683 yards from scrimmage each of the past three seasons. This year, he's averaging 4.8 yards per attempt to go with 81 yards receiving. The most memorable moment, however, came against Denver when he fumbled twice, including an improbable fumble in the waning moments which Bradley Roby returned for the game-winning touchdown. \n\"He's put it on the ground this year so I'm sure that's in the back of his mind also,\" Gilberry said. \"We just got to hit him. He's a track star. You let him run that's what he's going to do, he's going to run.\" Bengals' A.J. Green wins NFL award \nINJURY REPORT: Jones and Iloka (ankle) both sat out Wednesday's practice. Iloka pulled himself out of this past Sunday's game against the Ravens. \nAndrew Whitworth also didn't practice Wednesday, but that wasn't injury related as a veteran's rest day. Elsewhere, cornerback Leon Hall (not injury related) was limited along with Kirkpatrick and OT Andre Smith (hip). \nOn a positive note, defensive tackle Pat Sims (hip) returned to practice after missing all of last week and the game. Rookie Marcus Hardison (knee) also was a full participant for the first time this season. 3 CONNECT 1 TWEET LINKEDIN COMMENT EMAIL MORE Read or Share this story: http://cin.ci/1KMpwjq TOP VIDEOS", "external_links": [], "published": "2015-10-01T00:02:00.000+03:00", "crawled": "2015-10-01T00:40:56.364+03:00", "highlightTitle": ""}