{"organizations": ["TWN"], "uuid": "4a6d4d3073769c1f12ef71a323bae4cecf46cc11", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chinapost.com.tw", "main_image": "http://www.chinapost.com.tw/news_images/20151026/p09d.jpg", "site_section": "http://www.chinapost.com.tw/rss/sports.xml", "section_title": "China Post Online - Sports News", "url": "http://www.chinapost.com.tw/sports/golf/2015/10/26/449260/Rose-holds.htm", "country": "", "title": "Rose holds off Bjerregaard to win HK Open", "performance_score": 0, "site": "chinapost.com.tw", "participants_count": 0, "title_full": "Rose holds off Bjerregaard to win HK Open", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T18:12:00.000+02:00", "replies_count": 0, "uuid": "4a6d4d3073769c1f12ef71a323bae4cecf46cc11"}, "author": "", "url": "http://www.chinapost.com.tw/sports/golf/2015/10/26/449260/Rose-holds.htm", "ord_in_thread": 0, "title": "Rose holds off Bjerregaard to win HK Open", "locations": ["HONG KONG", "Denmark"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Lucas Bjerregaard", "Bjerregaard", "Rose", "Justin Rose"], "text": "Rose holds off Bjerregaard to win HK Open APOctober 26, 2015, 12:12 am TWN SHARE Tweet HONG KONG -- Justin Rose won his first European Tour title in 15 months Sunday, warding off a stubborn challenge from Lucas Bjerregaard of Denmark to win the Hong Kong Open by one shot. \nThe Englishman, who started the final round even with Bjerregaard on 15 under and a four-shot lead over the field, carded an impressive two-under-par 68 for a 17-under 263. It was his eighth career title on the European Tour. \n\"I'm very happy to get the job done. Last week I had a chance to win in Napa when I was tied for the lead but I let that one flitter away. I wanted to hang on to this one,\" said Rose, the 2013 US Open champion whose last victory on the European Tour came at the 2014 Scottish Open. \n\"Lucas played incredible golf and I was thoroughly impressed. When you separate yourself from the field like we did, it's probably a tough one for him to lose. But he didn't lose it, it's just that both of us played incredibly well,\" added Rose, who has now won in every European Tour season dating back to 2012. \nBjerregaard's attempt to win his first title was blown away at the 14th hole at the Hong Kong Golf Club when he made a double-bogey to let slip a one-stroke lead over Rose who then took over the lead by one. \nRose, 31, went two shots ahead at the 16th and despite a bogey at the final hole, only his third dropped shot all week, it was enough to ensure victory as the 24-year-old Bjerregaard failed to force a playoff and finished with 69 for a 16-under 264. \nBjerregaard, who had thrived on the back nine in the first three rounds collecting 15 birdies, failed to conjure up that same magic as he cracked under the pressure to make a bogey and a double bogey coming home. \nRose, however, showed his class and continued his remarkable knack for staying out of trouble with only two bogeys all day. \nThe last time Rose appeared at the Hong Kong Open, in 2011, he missed the cut but it was a very different scenario this week with the Englishman leading from the second round. \nEuropean Tour rookie Matt Fitzpatrick of England shot a final-round 69 to finish in a four-way tie for third with Lee Soo-min of South Korea (64), American Patrick Reed (67) and Australian Jason Scrivener (68) — all on 11 under and a massive seven shots behind Rose. \nIndian youngster Anirban Lahiri who had started in second place, four shots behind, struggled to a 71 to finish tied for seventh. Also falling from contention was fellow-countryman Jeev Milka Singh who began five shots behind the leaders but could only finish with a four over 74 to be tied for 24th. SHARE", "external_links": [], "published": "2015-10-25T18:12:00.000+02:00", "crawled": "2015-10-26T04:48:36.906+02:00", "highlightTitle": ""}