{"organizations": ["Galatasaray", "Benfica"], "uuid": "6fa9922f030f51359857b99d99754379a6a70f91", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailysabah.com", "main_image": "http://i.tmgrup.com.tr/dailysabah/2015/10/21/HaberDetay/1445461494448.jpg", "site_section": "http://dailysabah.com//rss/sports", "section_title": "Daily Sabah - Sports", "url": "http://www.dailysabah.com/football/2015/10/21/galatasaray-defeats-benfica-picks-up-first-win-in-champions-league", "country": "TR", "title": "Galatasaray defeats Benfica, picks up first win in Champions League", "performance_score": 0, "site": "dailysabah.com", "participants_count": 0, "title_full": "Galatasaray defeats Benfica, picks up first win in Champions League", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T22:01:00.000+03:00", "replies_count": 0, "uuid": "6fa9922f030f51359857b99d99754379a6a70f91"}, "author": "", "url": "http://www.dailysabah.com/football/2015/10/21/galatasaray-defeats-benfica-picks-up-first-win-in-champions-league", "ord_in_thread": 0, "title": "Galatasaray defeats Benfica, picks up first win in Champions League", "locations": ["Istanbul", "Europe"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ali Sami"], "text": "Galatasaray defeats Benfica, picks up first win in Champions League DAILY SABAH WITH ANADOLU AGENCY ANKARA ADD A MESSAGE YOUR E-MAIL Galatasaray's players celebrate winning their Champions League Group C match against Benfica at the Ali Sami Yen stadium in Istanbul, October 21, 2015. (REUTERS Photo) Galatasaray picks up its first Champions League win, after a 10-game winless run in Europe and having finished bottom of their group last season \nTurkish club Galatasaray defeated their Portuguese opponents Benfica, 2-1, in their third UEFA Champions League Group stage game at the Turk Telekom Arena in Istanbul on Wednesday. The game had a quick start with Nicolas Gaitan scoring the fastest Champions League goal of the season in the second minute, giving visitors Benfica a big advantage. Galatasaray turned the tables around when Selçuk İnan scored the equalizer from the penalty spot in the 19th minute. This was followed by German Lukas Podolski's goal in the 33rd minute. There could have been more for the Turkish side in the second half but for a great save from Julio Cesar which denied Umut Bulut and a Wesley Sneijder strike that was deflected onto the post, but two goals proved to be enough for the Group C points. In the second half, Galatasaray's Umut Bulut and Wesley Sneijder grabbed some chances to strike however they were fended off by Julio Cesar. Wednesday's victory against the Portuguese club also marked Galatasaray's first win in the league since the win against Juventus in December 2013, as last year's campaign ended without a success. The Istanbul club had lost to Spain's Atletico Madrid and drawn against Kazakhstan's Astana in their first two Group C matches. In the other Group C game played Wednesday, Atletico de Madrid beat Astana 4-0. Galatasaray and Benfica will play against each other again on Nov. 3 in Spain.", "external_links": [], "published": "2015-10-21T22:01:00.000+03:00", "crawled": "2015-10-22T09:01:05.837+03:00", "highlightTitle": ""}