{"organizations": [], "uuid": "a93ce2a90dbca0d13f8bc772f5fced1f100ad48f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ibtimes.co.uk", "main_image": "http://d.ibtimes.co.uk/en/full/1464016/dan-biggar.jpg", "site_section": "http://ibtimes.co.uk//rss/sports", "section_title": "IBTimes.co.uk : Sports", "url": "http://www.ibtimes.co.uk/rugby-world-cup-2015-south-africa-vs-wales-where-watch-live-preview-team-news-1524355", "country": "US", "title": "Rugby World Cup 2015: South Africa vs Wales: Where to watch live, preview and team news", "performance_score": 0, "site": "ibtimes.co.uk", "participants_count": 0, "title_full": "Rugby World Cup 2015: South Africa vs Wales: Where to watch live, preview and team news", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T12:00:00.000+03:00", "replies_count": 0, "uuid": "a93ce2a90dbca0d13f8bc772f5fced1f100ad48f"}, "author": "", "url": "http://www.ibtimes.co.uk/rugby-world-cup-2015-south-africa-vs-wales-where-watch-live-preview-team-news-1524355", "ord_in_thread": 0, "title": "Rugby World Cup 2015: South Africa vs Wales: Where to watch live, preview and team news", "locations": ["South Africa"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Nick Howson", "Biggar"], "text": "By Nick Howson October 17, 2015 10:00 BST Biggar has been imperious with the boot but will need to repeat his brilliance against South Africa Getty Images \nThe first quarter-final of the Rugby World Cup sees two-time winners South Africa face Wales at Twickenham, for the right to face New Zealand or France in the semi-final. Where to watch \nSouth Africa vs Wales kicks off at 4pm BST on 17 October. Live coverage is available on ITV HD and BBC Radio 5 Live. Preview \nSouth Africa and Wales may have taken varying routes into this year's quarter-finals but the reality is the last-eight clash of the competition is as close a call as any in the competition's history. Neither team have reached the knockout phase without alarm, but those struggles have worked to galvanise them into inspiring displays in the knockout stage. \nThe Springboks have had things far from their own way. Japan produced the shock of the tournament in defeating the twice world champions on the opening weekend as Heyneke Meyer's side showed a ring-rustiness after a disrupted preparation due to injury. The retirement of Jean de Villiers then followed and though South Africa have cruised into the last eight, they remain vulnerable to another surprise. \nInjury has again damaged South Africa in the lead up to their fifth quarter-final appearance, with Victor Matfield, who had come out of retirement to play in the tournament, out with a hamstring problem, leaving his international career hangs by a thread. JP Pietersen's recall is therefore the only change made by Meyer. Pietersen will look to add to his four tries already in the tournament Getty Images \nHowever, spare a thought for Wales who have suffered a host of injury problems both before and during the showcase event. Liam Williams became the latest player to withdraw following the defeat to Australia, with the inevitable question being who will follow? \nIn many ways, Wales have already defied the odds in reaching the quarter-finals, having ousted hosts England, but the mentality of coach Warren Gatland means they will not accept a tame exit. But they have won just one of their last 17 meetings with the Springboks stretching back 16 years, though their solitary win in that time did come in their last clash back in November 2014. \nDan Lydiate is back in the fold ahead of Justin Tipuric, while Tyler Morgan comes into a much-change centre partnership alongside Jamie Roberts. Alun-Wyn Jones meanwhile makes his 100th international appearance but Wales will need all of his experience to conquer their latest challenge. Rugby World Cup 2015: South Africa vs Wales kick off time, prediction and preview IBTimes UK Teams \nSouth Africa: 15. Willie le Roux, 14. JP Pietersen, 13. Jesse Kriel, 12. Damian De Allende, 11. Bryan Habana, 10. Handré Pollard 9. Fourie du Preez; 1. Tendai Mtawarira, 2. Bismarck du Plessis, 3. Frans Malherbe, 4. Eben Etzebeth, 5. Lood de Jager, 6. Francois Louw, 7. Schalk Burger , 8. Duane Vermeulen \nReplacements: 16. Adriaan Strauss, 17. Trevor Nyakane, 18. Jannie du Plessis, 19. Pieter-Steph du Toit, 20. Willem Alberts, 21. Ruan Pienaar, 22. Pat Lambie, 23. Jan Serfontein \nWales: 15. Gareth Anscombe, 14. Alex Cuthbert, 13. Tyler Morgan, 12. Jamie Roberts, 11. George North, 10. Dan Biggar, 9. Gareth Davies; 1. Gethin Jenkins, 2. Scott Baldwin, 3. Samson Lee, 4. Luke Charteris, 5. Alun-Wyn Jones, 6. Dan Lydiate, 7. Sam Warburton, 8. Taulupe Faletau \nReplacements: 16. Ken Owens, 17. Paul James, 18. Tom Francis, 19. Bradley Davies, 20. Justin Tipuric, 21. Lloyd Williams, 22. Rhys Priestland, 23. James Hook What the coaches say \nHeyneke Meyer: \"Victor was very close to selection but there was still some soreness and tightness and we just felt this was a too important game for us, we weren't going to risk him for the long term. It's going to be a gruelling battle out there and you can't put somebody up that isn't 100% fit. Victor was professional enough to come to me and say he wasn't able to give his best, he wanted to play but thought he should withdraw. \n\"It's tough losing both captains, especially going into this match, but the youngsters have done well and we're going to back them. We probably have two of the best locks at the moment so I'm confident. \n\"In my eyes there has not been leaders in times of peace, you only see leaders come out at times of war. That's when you see a person's character and when you are most tested. It's easy to coach when times are good because everything clicks. \n\"When people write you off and the players are having doubts you fall back on your experiences, and we had to take it on the chin and bounce back. No excuses.\" Meyer had made just one change for the game against Wales but is without Victor Matfield Getty Images \nWarren Gatland: \"They are an incredibly physical team up front. We have got to match them at scrum time and in the driving line-out. I like the mix of their two young midfielders. They are exciting for the future. They have a good mix and a nice balance. \n\"They have got over the shock of losing to Japan [in the pool stages] and that has galvanised them as a team and a squad. They are going to be a tough proposition. \"We have to scrummage well. With South Africa, they go back to what works for them: A strong scrum and an attacking line-out. The set piece is going to be pretty important for us. \n\"At this stage you have to back yourself. We are a bit thin on numbers in the backline. But we have coped with that well. We have freshened up this week. \n\"It was a tough pool [A] we have come through. We haven't done a lot of training [this week]. We had yesterday off and didn't train on Tuesday afternoon and had recovery on Monday. We haven't done a lot. But mentally and physically we must make sure we are right.\" Other fixtures \n8pm: New Zealand vs France (Millennium Stadium) More about Rugby World Cup 2015", "external_links": [], "published": "2015-10-17T12:00:00.000+03:00", "crawled": "2015-10-17T12:02:57.572+03:00", "highlightTitle": ""}