{"organizations": [], "uuid": "7ca48cc9b8ffbd237b064165db7ca6ea20e3b264", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "http://www.bostonherald.com/sites/default/files/media/2015/04/17/041715celticstf10.jpg", "site_section": "http://bostonherald.com/sports/celtics_nba", "section_title": "Sports: Celtics &amp; NBA | Boston Herald", "url": "http://bostonherald.com/sports/celtics_nba/boston_celtics/2015/10/bulpett_real_celts_nets_games_still_to_come", "country": "US", "title": "Bulpett: Real Celts-Nets games still to come", "performance_score": 0, "site": "bostonherald.com", "participants_count": 1, "title_full": "Bulpett: Real Celts-Nets games still to come | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "7ca48cc9b8ffbd237b064165db7ca6ea20e3b264"}, "author": "Steve Bulpett", "url": "http://bostonherald.com/sports/celtics_nba/boston_celtics/2015/10/bulpett_real_celts_nets_games_still_to_come", "ord_in_thread": 0, "title": "Bulpett: Real Celts-Nets games still to come", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The outcome won’t really matter when the Celtics take on the Nets tonight in Brooklyn.\n“Don’t say that,” Avery Bradley interrupted. “Preseason games matter. Every time we get on the court, it matters. All I know is that every game we play is important to us.”\nDuly noted, Avery, but if you’ll allow us to get to our larger point here . . . thank you.\nWhat we’re getting at is that this evening’s final tally will carry no weight once the electricity that feeds the scoreboard in Barclays Center is switched off — and the same for Monday’s preseason meeting between the clubs at the Garden.\nThe case will be just the opposite, however, when the Celts and Nets meet Nov. 20 in Boston and Nov. 22 in New York, and Jan. 2 here and Jan. 4 there. Because of the circumstances, those games will be a bit heavier than some others on the Celtic schedule.\nWith the C’s owning the Nets’ first-round pick next June, the meetings between the clubs are opportunities to both improve the Green’s playoff chances and strengthen their draft position. In hockey terms, these games will be four-pointers.\nThe Celts also can have Dallas’ first-rounder in 2016, but the Mavericks keep it if it’s in the top seven. And the C’s can switch picks with Brooklyn in 2017, while getting its No. 1 unencumbered again in 2018 — but that’s a matter for another season or more.\nFor this season, Greenhearts will first check the Celtics’ score on any given night. They also will glance at the Nets’ outcome, hoping for different results from each.\nBut they shouldn’t expect that Celtics players will be checking the Brooklyn scores along with them. The C’s are strikingly oblivious to the fact that Brooklyn’s 2015-16 could affect their own 2016-17 and beyond.\nThese guys are taking the concept of living in the moment quite seriously.\n“We get the Nets’ first-round pick next year?” Marcus Smart said. “Really? I didn’t know.”\nHis backcourt partner was of a similar mind.\n“I honestly didn’t know that,” Bradley said later. “I don’t pay attention to that.\n“The only thing that I pay attention to is the team that we have next and what I have to do.”\nThe Celtics would rather not cloud their heads with what-ifs and hypotheticals — especially not during training camp when they’re trying to get their offense and defense in place.\nThere is also the fact some of the Celts might not be Celts next season. Trades can be made. Contracts run out.\nJared Sullinger is in the last guaranteed season of his rookie deal, and while the club has had discussions with his agent about an extension, it’s possible he could play out the year and, if the Celtics give him the qualifying offer, become a restricted free agent next summer — or an unrestricted free agent if they don’t.\nBut Sullinger isn’t even thinking about his own situation and how it might play out. He’s just looking at the here and now. First-round picks? Not in his line of sight.\n“We’re just out here to play basketball, you know?” he said. “If we’re already thinking about the next draft . . . we might as well tank our season if we’re thinking like that. Our main focus is to just win basketball games.”\nDavid Lee, an offseason acquisition from the Golden State Warriors, played the new guy card when asked about the Celts owning the Nets’ pick.\n“I didn’t know that,” Lee said. “I just got here. I didn’t know any of that.\n“That’s the business of basketball stuff. Our job is to try to win games. No other conversations take place about stuff like that.\n“(The Celtics) ended the season great last year and, of course, made the playoffs. Now I think we’ve made some good additions, and the younger guys have gotten a year older, and the most important thing is to improve on last year. What that means, I don’t know yet, but that’s the overall thing.”\nHey, Brad Stevens is part of management, and even he’s not going to keep tabs on the status of future draft positions.\n“I just leave it to them,” the coach said, referring to Danny Ainge and the basketball ops office. “I can’t keep up with everything. There’s a lot of things to keep up with. I don’t even worry about it. I haven’t worried anything in that regard since I’ve been here. I just focus on coaching the guys on the court.”\nIt will therefore be left to you and Ainge to keep track of Brooklyn. The Celtics will be paying attention only on the four aforementioned dates.", "external_links": [], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-14T07:53:25.975+03:00", "highlightTitle": ""}