{"organizations": ["Milton Navarre"], "uuid": "c4588c87539e4ad5f531642a8058bfd82af49cec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pnj.com", "main_image": "http://www.gannett-cdn.com/-mm-/286d25d58a05d50727f267439f2859c1f85ece25/c=0-364-1368-1137&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/17/Pensacola/Pensacola/635806427974887811-FootballHC1501-M-150-C-R.jpg", "site_section": "http://rssfeeds.pnj.com/pensacola/sports", "section_title": "Pensacola - Sports", "url": "http://www.pnj.com/story/sports/high-school/football/2015/10/17/navarre-milton-gamer/74112336/", "country": "US", "title": "Navarre shows great defense in win over Milton", "performance_score": 0, "site": "pnj.com", "participants_count": 0, "title_full": "Navarre shows great defense in win over Milton", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T08:41:00.000+03:00", "replies_count": 0, "uuid": "c4588c87539e4ad5f531642a8058bfd82af49cec"}, "author": "", "url": "http://www.pnj.com/story/sports/high-school/football/2015/10/17/navarre-milton-gamer/74112336/", "ord_in_thread": 0, "title": "Navarre shows great defense in win over Milton", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Milton BRIAN ACHATZ", "Navarre", "Milton"], "text": "Navarre shows great defense in win over Milton BRIAN ACHATZ, bachatz@pnj.com 12:41 a.m. CDT October 17, 2015 Navarre turns in shut out win over Milton in key District 2-6A win (Photo: Stock) CONNECT TWEET LINKEDIN COMMENT EMAIL MORE \nIt has been a stellar season for the Navarre Raiders and coach Jay Walls. \nThe Raiders are off to the best start in program history and seem to outdo themselves each week. \nFriday night, the Raiders rolled to a 35-0 win over Milton, highlighted by the play of a lifetime for one of the Raiders. \nTrailing 28-0, the Milton Panthers began a drive into Navarre territory with less than one minute until halftime. \nThe Panthers made their way into field goal range in an effort to put points on the board. \nMilton elected to pass one last time, but Navarre linebacker Jay Klosisnki made the Panthers pay. \nKlosinski made the interception, and showed some deceptive speed as he burst through for a pick-six to give Navarre a 35-0 lead. \n“That was the best play of my life, no, the best moment of my life,” Klosinski said. “We come out and play hard every game. We treat every opponent the same. That’s how our coaches prepare us. \nThe lead yielded a running clock in the second half as the final two quarters flew by with no scoring. \nNavarre saw two touchdowns from running back Hasaan Williams and a explosive catch-and-run score from Michael Sandle. \n“We got momentum early thanks to some big offensive plays ... that was key,” Walls said. “Defense did an outstanding job. Scoring right before the half, that was really a great job by our defense. \n“It was a great district (2-6A win). I’m proud of the kids and the way they prepared.” \nNavarre is now 2-0 in the district and will seek a district sweep at Gulf Breeze on Oct. 30. \nMilton is winless in district play, and will eye their first win against Pace in two weeks. \n“We just play more physical than anyone else. That is what we hang our hat on,” Klosinski said. “It’s all the hard work we put in the off season. We work harder than anyone else in the Panhandle. I promise that. That is how we get it done.” Read or Share this story: http://on.pnj.com/1Lz65Mq TOP VIDEOS", "external_links": [], "published": "2015-10-17T08:41:00.000+03:00", "crawled": "2015-10-17T08:56:38.779+03:00", "highlightTitle": ""}