{"organizations": [], "uuid": "6a63d93243009f4e5815c5dcccb29ab231c2d678", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "juneauempire.com", "main_image": "http://juneauempire.com/sites/default/files/14831717.jpg", "site_section": "http://jun-cdn.com/taxonomy/term/2/2/feed", "section_title": "Sports", "url": "http://juneauempire.com/sports/2015-10-23/grapplers-gather-memorial-tournament", "country": "US", "title": "Grapplers gather for memorial tournament", "performance_score": 0, "site": "juneauempire.com", "participants_count": 1, "title_full": "Grapplers gather for memorial tournament", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T11:06:00.000+03:00", "replies_count": 0, "uuid": "6a63d93243009f4e5815c5dcccb29ab231c2d678"}, "author": "Klas Stolpe", "url": "http://juneauempire.com/sports/2015-10-23/grapplers-gather-memorial-tournament", "ord_in_thread": 0, "title": "Grapplers gather for memorial tournament", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Grapplers gather for memorial tournament Brandon Pilot Invitational to feature over 100 Southeast athletes Posted: October 23, 2015 - 12:06am Back | Next KLAS STOLPE | JUNEAU EMPIRE Hoonah's Manny Budke works a cradle on Ketchikan's Nate Eisenhower in a 132-pound match during last year's Brandon Pilot Invitational. Back | Next KLAS STOLPE | JUNEAU EMPIRE Wrangell's Alisa Heller grapples with Thunder Mountain's Juan Fisher in a 106-pound match during last year's Brandon Pilot Invitational. Back | Next KLAS STOLPE | JUNEAU EMPIRE Thunder Mountain's Hunter Boyer pins Mt. Edgecumbe's Stephen Guy in last year's 145-pound match at the Brandon Pilot Wrestling Invitational. By Klas Stolpe JUNEAU EMPIRE \nStormy nights in Juneau may as well be enjoyed inside, and tonight’s Brandon Pilot Invitational will still have all the thunder and lightning, minus the wet chill, as over 100 wrestlers gather at Thunder Mountain High School. \nWith action starting at 5 p.m. and continuing through Saturday night, this may be local grappling fans’ only opportunity to get a taste of this season’s Region V competitors who are conditioning for December’s championships in Wrangell. \n“The big advantage is to put more matches under their belt,” TMHS coach Jason Boyer said. “Because when they get to Anchorage, whether they are small school or 4A, they have got to prepare. Those kids up north are getting 40-60 matches a year. Our kids are probably getting in the 30s, so we have to work twice as hard to get the same experience. \n“Last weekend’s tournament was kind of an indicator to us as to were our kids would be,” Boyer continued. “It is a stormy weekend, so it is a good time to come sit in the gym and watch wrestling.” \nSaturday night will also feature the Falcons’ senior night before the 7 p.m. championship rounds begin. \nThe tournament is named in honor of Brandon Pilot, a Crimson Bears freshman who died in a car accident on Fish Creek Road on Nov. 18, 2000. A week later, the wrestling team went on with the scheduled Thanksgiving Classic wrestling meet, dedicating it to Pilot’s memory and won the team title. The following year the tournament was renamed in his honor, and each year since it has showcased the wrestling talent from across Southeast. \nOne of this weekend’s feature matches could be 152-pound TMHS senior Hunter Boyer getting a second crack at Craig’s Wyatt Patten. Patten defeated Boyer in the championship at Wrangell last weekend. In the closing seconds of the bout, Boyer tried a takedown to break a tie and in the roll-a-round Patten ended up on top. \n“I am hoping that Hunter and Wyatt will meet in the finals again,” said the elder Boyer, who is also Hunter’s father. “I think we have a different game plan for that one. We won’t throw anything in the last five seconds and we’ll take it to overtime and set something up.” \nBoyer said Falcons 220-pounder Carl Tupou could have a solid first tournament. Tupou is wrestling up from his normal 196-pound weight. \n“I am hoping he has enough in his arsenal that he can make it to the podium,” Boyer said. “I think his athletic ability is going to take him there. I told him not to worry about losing weight and he was pretty happy about that.” \nThe 195-pound class will have returning small school state champion and BPI titleholder Nate Fousel, a Ketchikan senior, looking to regain his composure from last weekend’s loss to JDHS junior Cody Weldon. \n“More likely it will be a rematch of that championship at 195 pounds,” JDHS coach John Joeright said. “That might be a highlight of the evening.” \nJoeright is looking for JDHS junior Ethan Goebel and senior Taylor Sutak to make noise at 160 and 182 pounds, respectively. \n“I am expecting our guys to go out and give 115 percent,” Joeright said. “We will just have to see about the others. We have to apply some of the things we have been practicing.” \nKetchikan’s Max Collins, at 138 pounds, will be one to watch as he takes on the Falcons’ Deven Mason or Craig’s Bryan Castle. TMHS’ Sam Nolan is looking to get out of the third-place rut at 145 pounds and will have a weight class of 15 grapplers to contend with, including Thorne Bay’s Tell Tripple. The Panther’s will also feature Titus Tripple at 160 pounds, a key opponent for JDHS’ Goebel. TMHS’ Tyler Cole will get some challenges from JDHS’ Seth Machakos, Lance Fenumiai and Jaiden Kohler at 170-pounds. \n“What is nice is that this brings the sport to Juneau,” Joeright said of the tournament. “It showcases the sport and shows what a challenging sport it is and gives the athletes a chance to get some recognition for all the work they do.” \nLocal wrestlers will head to Colony on Nov. 6 and to the Lancer Smith Invitational on Nov. 20. The Lancer Smith features 32-man brackets. \n“That is going to be the first time we see who are going to be the competitors this year at state,” Boyer said. “Both of those tournaments are really well attended. It will be the biggest tournament these kids see all year, and maybe in their careers.” \nFollowing are weight classes to be expected this weekend: \n• 98 pounds — Jonathon Barratt, Jonathon (WRG), Payton Stewart (KTN), Connor Norman (TMHS), Rianon Padro (JDHS), Connor McCormick (KTN), Matthew Rodriguez (KTN). \n• 106 pounds — Curt Bartlett (SIT), Nelson Jackson (MtE), Brayden Linne (KTN), Patrick Rauwolf (KTN). \n• 113 pounds — Paul Amendinger (KTN), Nathan Andrew (MtE), Brandal Arnold (MtE), Juan Fisher (TMHS), Jacob Gagner (SIT), Royale Lowe (MtE), Adam Murphy (JDHS), Vince Tenebro (KTN). \n• 120 pounds — Alexandriana Andrews (MtE), Cameron Bauer (HNS), Charlie Bower (HNS), Caleb Deer (TMHS), Laura Ekada (MtE), Orion Heller (WRG), Ketch Jacobson (HNS), Seth Packer (CRG), Daniel Peters (JDHS), Jacob Tapia (TMHS), Sean Tavares (KTN), Luke Reynolds (KTN). \n• 126 pounds — Troy Harris (KTN), Harry Hartzog (SIT), Mori Hays (HNS), Mark Jasper (KTN), Isaiah Records (CRG), Wayne Young (SIT). \n• 132 pounds — Hayley Akerelrea (MtE), Trevor Cox (HNS), Kadin Hodges (KTN), Jacob Jametski (MET), Ian Jenson (WRG), Tucker Joeright (JDHS), Elizabeth Johnson (WRG), Joey Karlik (KTN), Festus LaChester (JDHS), Drew Marker (CRG), DJ Scott (TMHS), Mikel Smith (WRG), Caleb Suarez (SIT). \n• 138 pounds — Trevor Akelkok (MtE), Justin Albecker (KTN), Bryan Castle (CRG), Max Collins (KTN), Merrick Dundas (MET), Orlin Gologergen (MtE), Theron Grant (TMHS), Deven Mason (TMHS), Guy Sanderson (HYD), Robert (Warren-Edenshaw HYD). \n• 145 pounds — Sam Armstrong (WRG), Maverick Ballard (CRG), Drake Carabajal (TMHS), Grant Collins (KTN), Sig Decker (WRG), Nate Eisenhower (KTN), Dawson Entwit (KTN), Zane Durr (HNS), Stephen Guy (MtE), Erick Heaggans (SIT), Steven Ireland Haight (JDHS), Samuel McCarty (MET), Sam Nolan (TMHS), Dillon Rooney (WRG), Tell Tripple (TB), Royce Whitehead (JDHS). \n• 152 pounds — Hunter Boyer (TMHS), Kai Hays (HNS), Aiden Hildebrand (TMHS), Travis Kemp-Davis (TMHS), Sydnee Kimber (MtE), Nolan Meyer (KTN), Roger Miller (WRG), Alex Ocana (TMHS), Wyatt Patten (CRG), Caden Peterson (MtE), Tim Rodriguez (KTN), Kyler Samauang (SIT), Reilly Sutak (JDHS), Robert Tolson (HYD), Eric Ulery (TB). \n• 160 pounds — Ulric Aloysius (MtE), Abraham Booth (MET), Noah Castle (CRG), Ethan Goebel (JDHS), Johnathon Schmitz (JDHS), Darren Shilts (WRG), Titus Tripple (TB), Damion Wallace (KTN), Brandon Wieber (KTN), John Williams (JDHS), Joshua Young (SIT), Zack Zenge (KTN). \n• 170 pounds — Agatha Andrews (MtE), Micah Eichner (KTN), Tyler Cole (TMHS), Lance Fenumiai (JDHS), Jaiden Kohler (JDHS), Seth Machakos (JDHS), Victor Quintana (SIT), Makenzie Reeves (SIT), Gerik Sherrill (KTN). \n• 182 pounds — Chet Armstrong (WRG), Arthur `Colin` Freitas (MtE), Joshua Goeden (SIT), Zavier Ghormley (MET), Cameron Harris (KTN), Alonzo Leisholmn (MET), Derek Mason (TMHS), Tyler Murphy (HNS), Josh Quinto (TMHS), Wesley Scott (WRG), Taylor Sutak (JDHS). \n• 195 pounds — Nate Fousel (KTN), Devin Locke (TMHS), Brayden Schwab (TB), Cody Weldon (JDHS). \n• 220 pounds — Conrad Hudson (MET), Kamakana Kanahele (HNS), Gabriel Nathan (MET), Sean Orsborn (MtE), Kobe Rutherford (MtE), Chris Seddon (WRG), Carl Tupou (TMHS). \n• 285 pounds — Brayden Blandov (MET), Chris Coulson (JDHS), Jared Huntington (MtE), August Leask (MET), Brian McClennan (KTN), Liam Price (CRG), Timothy Williams (MET).", "external_links": [], "published": "2015-10-23T11:06:00.000+03:00", "crawled": "2015-10-24T05:34:29.373+03:00", "highlightTitle": ""}