{"organizations": [], "uuid": "e4f1350d21cf3dd5712967b938b69ea995b41ce2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mercurynews.com", "main_image": "http://local.mercurynews.com/common/dfm/assets/logos/1200x627/mercurynews.png", "site_section": "http://feeds.mercurynews.com/mngi/rss/CustomRssServlet/568/200223.xml", "section_title": "Sports", "url": "http://www.mercurynews.com/sports/ci_28948872/college-football-northwestern-at-michigan-clash-elite-defenses?source=rss", "country": "IL", "title": "College football: Northwestern at Michigan a clash of elite defenses", "performance_score": 0, "site": "mercurynews.com", "participants_count": 1, "title_full": "College football: Northwestern at Michigan a clash of elite defenses", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T06:17:00.000+03:00", "replies_count": 0, "uuid": "e4f1350d21cf3dd5712967b938b69ea995b41ce2"}, "author": "Associated Press", "url": "http://www.mercurynews.com/sports/ci_28948872/college-football-northwestern-at-michigan-clash-elite-defenses?source=rss", "ord_in_thread": 0, "title": "College football: Northwestern at Michigan a clash of elite defenses", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "College football: Northwestern at Michigan a clash of elite defenses Associated Press Posted: 10/09/2015 08:10:42 PM PDT Updated: 10/09/2015 08:17:46 PM PDT Northwestern and Michigan have made steady climbs up The Associated Press poll because of their defenses. \nThe 13th-ranked Wildcats have shut out two teams and are giving up a nation-low seven points a game. That has helped Northwestern (5-0, 1-0 Big Ten) equal its total number of victories in each of the previous two years. If the Wildcats win Saturday at the Big House, they will be 6-0 for the first time since 1962 when Ara Parseghian was their coach. \n\"Everyone's gonna give us their best shot now,\" Northwestern offensive guard Matt Frazier said. \"But we like that. We accept the challenge.\" \nNo. 18 Michigan (4-1, 1-0), meanwhile, is a win away from matching the number of victories it had last year. \nThe Wolverines have blanked consecutive opponents, rank first in third-down defense and second in points allowed under Jim Harbaugh. \nEntering the battle of stingy units, Harbaugh refused to add to the hype. \"The two defenses won't go against each other in the game,\" he deadpanned. \nMichigan defensive tackle Ryan Glasgow, though, added to the anticipation. \"Our goal is to be the best defense in the country,\" he said. \"We don't shy away from talking about that.\" Washington State-Oregon: The weekly quarterback mystery is becoming something of a theme for Oregon this season. Oregon wasn't saying which quarterback -- or how many -- it plans to play on Saturday afternoon when the Ducks (3-2, 1-1 Pac-12) host Washington State (2-2, 0-1). Advertisement \nVernon Adams Jr., who was named the starter just before the beginning of the season but then broke the index finger on his throwing hand in the opener and sat out last weekend's 41-24 victory at Colorado. \nIn his place, the Ducks rotated Jeff Lockie, Adams' backup, and Taylor Alie, a former walk-on. Neither quarterback had a particularly spectacular outing, but the Ducks were able to run the ball effectively for the win. \nEarlier in the week, Adams said he didn't want to play until he could give 100 percent, which seemed to indicate he wasn't going to be ready to go. \nOregon's depth chart wasn't giving anything away, either. Adams, Lockie and Alie were all separated by an \"or\" on it. It also could be said that there's a competitive advantage in not revealing the choice. \n\"I think we know what is going to happen, and what we're going to do,\" Ducks coach Mark Helfrich told reporters Thursday. \"But it's not set in granite right now.\" UCLA: A walk-on punter for No. 20 UCLA has been arrested for investigation of rape, police and school officials said. Los Angeles police said Adam Searl's arrest came after an investigation lasting nearly a year. Searl, 20, was released from jail after posting $300,000 bail on Thursday night. UCLA coach Jim Mora said in a statement that Searl has been suspended indefinitely while the legal process plays out.", "external_links": [], "published": "2015-10-10T06:17:00.000+03:00", "crawled": "2015-10-10T06:25:44.120+03:00", "highlightTitle": ""}