{"organizations": [], "uuid": "a7f7fede70e5e5c265505b38378e0dd20db44e56", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/49355466.cms", "site_section": "http://timesofindia.indiatimes.com/sports/racing/indian-gp/articlelist/10403224.cms", "section_title": "Indian GP - Racing - Sports - The Times of India", "url": "http://timesofindia.indiatimes.com/india/Virbhadra-says-oust-Dhumal-to-save-BJP/articleshow/49355385.cms", "country": "IL", "title": "Virbhadra says oust Dhumal to save BJP", "performance_score": 0, "site": "indiatimes.com", "participants_count": 5, "title_full": "Virbhadra says oust Dhumal to save BJP - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:07:00.000+03:00", "replies_count": 5, "uuid": "a7f7fede70e5e5c265505b38378e0dd20db44e56"}, "author": "Anand Bodh", "url": "http://timesofindia.indiatimes.com/india/Virbhadra-says-oust-Dhumal-to-save-BJP/articleshow/49355385.cms", "ord_in_thread": 0, "title": "Virbhadra says oust Dhumal to save BJP", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SHIMLA: Himachal Pradesh chief minister Virbhadra Singh said that only way of saving BJP was by way of removing former chief minister Prem Kumar Dhumal from the party. While addressing a public meeting at Parsa in gram panchayat Shekhal in Rohru tehsil of district Shimla, he said that he would not get moved by the false propaganda of opposition.\nHe said that he became chief minister not because of the mercy of former chief minister Prem Kumar Dhumal, but Congress Party came to power in the state in a democratic manner. He said that with full love and support the people of the State chose him as chief minister of the state for sixth time.\n\"Twice false cases were framed against me by BJP government and both time I came out clean and now the Compact Disc (CD) case filed in the court against me was turned down by the Supreme Court sending shock waves in the opposition camp,\" he said.\nHe said that though there existed difference of opinions with Shanta Kumar but he was a man of principles. \"Blaming me of unaccounted income by Dhumals was witch hunting and unfortunate, as I have nothing to hide and all I have has been inherited from my ancestors,\" he said.\nHe said that he believes in visiting the people at their door-steps to better understand their problems and grievances and moreover he gets a chance to monitor the progress of development schemes and take action accordingly if the work was not being done.\nHe said that Rohru and its suburbs were well connected with roads and now the need of the hour was to mettle and maintain them and appreciated the efforts of PWD to complete the work of Rohru by-pass road in time bound manner. Stay updated on the go with Times of India News App. Click here to download it for your device.", "external_links": ["https://play.google.com/store/apps/details?id=com.toi.reader.activities"], "published": "2015-10-15T03:07:00.000+03:00", "crawled": "2015-10-14T21:07:59.925+03:00", "highlightTitle": ""}