{"organizations": [], "uuid": "faa0ba9fa160d321f2f1d94cd3a15f4fea42ea84", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.local21news.com", "main_image": "http://local21news.com//template/ugc/whp/1641/mJN5sPCA.PNG", "site_section": "http://local21news.com/sports/features/local-sports/rss.xml", "section_title": "whp Local Sports", "url": "http://www.local21news.com/sports/features/local-sports/stories/Northeastern-and-Spring-Grove-look-to-face-off-in-week-8-battle-222519.shtml", "country": "US", "title": "Northeastern and Spring Grove look to face off in week 8 battle", "performance_score": 0, "site": "local21news.com", "participants_count": 0, "title_full": "Northeastern and Spring Grove look to face off in week 8 battle", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T19:09:00.000+03:00", "replies_count": 0, "uuid": "faa0ba9fa160d321f2f1d94cd3a15f4fea42ea84"}, "author": "", "url": "http://www.local21news.com/sports/features/local-sports/stories/Northeastern-and-Spring-Grove-look-to-face-off-in-week-8-battle-222519.shtml", "ord_in_thread": 0, "title": "Northeastern and Spring Grove look to face off in week 8 battle", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Northeastern and Spring Grove look to face off in week 8 battle \nUpdated: \nPosted by: Shannel Douglas \n\nSPRING GROVE -- With only three games left in the regular season the battle is on for a spot in the post season. Spring Grove and Northeastern football programs are both looking to play in week 11. \n\n\"I think it comes with timing,\" said Northeastern running back, Kody Resser. \"They definitely have to win for playoffs. We still want to lock up our playoff spot. Any game at the end of the year it's big.\" \n\n\"We're just here to finish,\" explains Spring Grove head football coach Kyle Sprenkle. \"We got three games left. We're going to take it one game at a time and it starts with Northeastern on Friday. We plan to finish every game.\" \n\nFor Spring Grove, it's a year of change. With a new head coach coming into a tough schedule, the team got off to a rough start. But the Rockets are on a three-game winning streak. They'll have to keep the momentum going if they want a shot at the playoffs. \n\n\"As the season progresses, especially these last couple of weeks, the kids are becoming more comfortable with the playbook on both sides of the ball,\" said Sprenkle. \"I think it's showing.\" \n\n\"We are a strong team,\" said Spring Grove running back, Nick Erickson. \"We just need to come out and show people we are because we haven't really proven anything yet.\" \n\nThey're looking to do so against a strong Northeastern team. The Bobcats are currently 6-1. Even with their record, their spot in the post season is not solidified. \n\n\"The rest of the season is important to us,\" said Reeser. \"The division is not locked up yet but the playoffs is looming.\" \n\n\"We're excited to get these last few wins in and get into the playoffs,\" said Northeastern wide receiver, David Ankney. \"It's something we've never experienced before and it's something that our program is not used to.\" \n\nMoving forward the stakes are only getting higher. \n\n\"They know that every game has a meaning and we can't overlook anybody,\" explains Northeastern head football coach, Jon Scepanski. \"To keep these guys focused has not been a big challenge for us. As we get later in the season their focus is increasing which is good. \n\n\"We want to win,\" said Spring Grove tackle, Andrew Lawson. \"We want to do good now.\" \n\nKick off is set for 7 pm on Friday at Spring Grove High School.", "external_links": [], "published": "2015-10-22T19:09:00.000+03:00", "crawled": "2015-10-23T03:59:27.697+03:00", "highlightTitle": ""}