{"organizations": ["Shaw Media", "Lions", "Coal City High School"], "uuid": "6c068434549ba5af7e77f33a6cdde56148149693", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.morrisherald-news.com", "main_image": "http://www.morrisherald-news.com/_internal/cimg!0/c0jgage9skujw8wj0br4r508i3u3hml", "site_section": "http://www.morrisherald-news.com/?rss=sports", "section_title": "MDH Sports", "url": "http://www.morrisherald-news.com/2015/10/17/coalers-suffer-tough-loss-in-defensive-struggle/a19kk52/", "country": "US", "title": "Coalers suffer tough loss in defensive struggle", "performance_score": 0, "site": "morrisherald-news.com", "participants_count": 0, "title_full": "Coalers suffer tough loss in defensive struggle", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T07:22:00.000+03:00", "replies_count": 0, "uuid": "6c068434549ba5af7e77f33a6cdde56148149693"}, "author": "", "url": "http://www.morrisherald-news.com/2015/10/17/coalers-suffer-tough-loss-in-defensive-struggle/a19kk52/", "ord_in_thread": 0, "title": "Coalers suffer tough loss in defensive struggle", "locations": ["Coal City", "Lisle"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["John Patsch", "Junior Arias", "ROB OESTERLE", "Mark McGrath", "Matt Norto"], "text": "Coalers suffer tough loss in defensive struggle Published: Saturday, Oct. 17, 2015 11:22 p.m. CDT Caption (John Patsch for Shaw Media) Coal City's Matt Norto and Junior Arias charge at Lisle's Mark McGrath on Friday at Coal City High School. The Coalers fell to the Lions, 7-3. By ROB OESTERLE roesterle @shawmedia.com \nCOAL CITY – Coming into Friday night’s game against Lisle with a 4-3 record, Coal City football coach Lenny Onsen wanted his team to pick up its fifth win, then win next week at Seneca to secure a sixth victory and have no doubt about making the playoffs. Related Links Defense, running game power Coal City \nUnfortunately, Lisle had different ideas, as the Lions won a defensive struggle, 7-3. It put Lisle at 6-2, ending a six-year playoff drought. \nBoth teams played strong defense all night. Lisle forced Coal City to punt on the opening possession of the game and was able to drive to the Coalers’ 14 on the resultant possession. A field-goal attempt of 30 yards by Mark McGrath was good, but Lisle was whistled for illegal procedure, and the ball was moved back 5 yards. This time, Coal City’s Mike Chiarappa broke through the line and blocked McGrath’s attempt, leaving the game scoreless. \nAfter another Coaler punt, Lisle fumbled, and Coal City’s Mike Pampuch recovered at the Lions’ 39. The Coalers (4-4) got as far as the Lisle 11 before stalling, and Brad Littleton kicked a 34-yard field goal to give his team a 3-0 lead with 10:57 to play until halftime. \nThat lead stood for the rest of the half, as the Coalers blocked another field goal attempt, this time by Alec Leasure, to go to intermission with a 3-0 lead. \n“This was a frustrating game,” Onsen said. “On one hand, it is hard to fault our defense. We only gave up seven points, and a lot of those kids worked their tails off. \n“On the other hand, we had some situations that the defense could have gotten the offense the ball in better shape, but we would give up a first down or two and the field position would change. In a game like this, field position was huge, and Lisle won that battle tonight.” \nLisle received the second-half kickoff and put together a 12-play, 80-yard drive, capped by a 4-yard run by quarterback McGrath. His kick then gave the Lions a 7-3 lead. \nLate in the fourth quarter, Coal City forced a punt and took over on its 26. The Coalers reached into their bag of tricks and threw a lateral to receiver Christian Johnson. \nJohnson, who also is the backup quarterback, stopped and threw deep to Littleton, who caught the ball for a 61-yard gain to the Lisle 13. On third down, though, a pass into the end zone was intercepted by Lisle and returned to the 48. \nA punt went into the end zone, and Coal City took over at its own 20 with 22 seconds left. Four straight incompletions followed the game ended. \n“We just couldn’t get much going offensively,” Onsen said. “Lisle wasn’t that big, but they were very quick to the ball. \n“We still have a game left, and we will get back to work. If we don’t have the playoff points, we still want to finish the year on a high note, so we are far from done.”", "external_links": [], "published": "2015-10-18T07:22:00.000+03:00", "crawled": "2015-10-18T11:47:23.806+03:00", "highlightTitle": ""}