{"organizations": [], "uuid": "037e429cfe6c1f4ea1f9bc1c630bf0d040fefc77", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.torontosun.com", "main_image": "http://storage.torontosun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297761039309_ORIGINAL.jpg?quality=80&size=100x", "site_section": "http://www.torontosun.com/sports/hockey", "section_title": "Hockey | Sports | Toronto Sun", "url": "http://www.torontosun.com/2015/10/16/oilers-early-season-struggle-not-a-surprise-players-say-good-things-are-happening", "country": "CA", "title": "Oilers early season struggle not a surprise, players say good things are happeni", "performance_score": 0, "site": "torontosun.com", "participants_count": 1, "title_full": "Oilers early season struggle not a surprise, players say good things are happeni", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T08:11:00.000+03:00", "replies_count": 0, "uuid": "037e429cfe6c1f4ea1f9bc1c630bf0d040fefc77"}, "author": "torontosun.com", "url": "http://www.torontosun.com/2015/10/16/oilers-early-season-struggle-not-a-surprise-players-say-good-things-are-happening", "ord_in_thread": 0, "title": "Oilers early season struggle not a surprise, players say good things are happeni", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "You can’t turn a ship around on a dime.\nEspecially when it’s been sitting at the bottom of the ocean for nine years.\nSo it should come as no surprise that the massive reclamation project assigned to Peter Chiarelli, Todd McLellan and Connor McDavid is going slower than most fans hoped.\nDespite all of the off-season excitement and pre-season hype, the Oilers are actually off to a worse start than last year. They are 0-4 and still losing games because of their trademark weaknesses and bad habits.\nIn other words, they’re pretty much right on schedule for what the new regime promised when it inherited this bloody mess: No Quick Fix.\n“We talked about it from Day 1 of training camp, that this wasn’t going to be a quick fix,” said winger Matt Hendricks, who can always be counted on for an honest assessment of how this team is playing.\n“It’s going to take some time for the culture in the room to change and the strategy for our games to change and the way we play hockey to change.\n“We saw some quick hits in exhibition games where we were playing pretty well and feeling pretty good about ourselves in here, but when you look back over the course of the year and a half that I’ve been here, we haven’t played very good hockey. There’s a lot of bad habits that are continuing to get better but it’s going to take some time.”\nThat’s tough to hear given that the Oilers rebuild has already been going on for so long you’d think the City of Edmonton was in charge of it, but you don’t take a team that spent almost an entire decade in the bottom 10% of the NHL and turn it into a winner in two weeks.\nDespite finally changing their management structure, hiring a proven coach, winning the draft lottery and upgrading their goaltending, the Oilers still can’t fast-track the process.\n“The excitement around town and through Edmonton is great, we want that from our fans and from everyone in Oil Country, but at the same time we have to be realistic and remember that this is a process and we weren’t a very good hockey team,” said Hendricks. “We’re not a great hockey team (now) by any means, but we want to be, and it’s a process in getting there and improving.”\nAnd anyone who expected they’d be fixed in a matter of weeks was dreaming, not that that’s a bad thing.\n“I think when you have big changes and big pieces come to a team there is obviously excitement, you can’t help yourself from getting excited about it and thinking that it’s going to turn around right from the get-go,” added Nugent-Hopkins\n“It’s going to be a process. Right now it’s new everything, new guys coming together, new coaches, it’s a learning process for sure.”\nAt the same time, while nobody expected the Edmonton Oilers to be a playoff team this year, nobody expected it would be another one of those years where they were out of it by Halloween, either. That’s why 0-4 has a lot of people kind of freaked out.\nBut Nugent-Hopkins assures everyone the Oilers are not headed down their usual path again, and that they’ll be better before they’re worse.\n“We’ve seen a lot of good things in the last four games, we’ve played good, just not good enough to get that other goal or keep them from scoring it,” he said. “We have to find a way to do that. I don’t know if we have that feeling that we know we’re going to win yet. We have to get that feeling, where you have confidence that you can get the next goal.”\nNow that he’s had a chance to look at the Oilers from the inside, McLellan was asked if this is a bigger job that he anticipated.\nHe said no.\n“I’m not surprised,” he said of the winless but not entirely hopeless, start. “I’m a little disappointed, but I’m not surprised. We know that we had a lot of work to do here and that hasn’t changed.”\nNO PLACE TO PANIC\nWith the Edmonton Oilers 0-4, head coach Todd McLellan wants to limit the panic to outside the dressing room.\nThat’s why he says it’s crucial that veterans of the rebuild, players like Taylor Hall, Ryan Nugent-Hopkins and Justin Schultz, steady the atmosphere inside.\n“We’re watching those guys,” he said. “Are they going to let their shoulders slump and their heads go down? If that happens then we’ve got a bigger task ahead of us.\n“If they respond appropriately and hold their heads high and play it will eventually get better.\n“The players who haven’t been here very long are wondering and they’re not sure (how to react). The players who’ve been here for a while, they’re going to be the ones who dictate where we go by how they react to the four losses.”\nFollow me on twitter.com/sun_tychkowski\nrobert.tychkowski@sunmedia.ca\nSponsored Links See All Sponsored Links\nOilers early season struggle not a surprise, players say good things are happening\nBy Robert Tychkowski , Edmonton Sun First posted: Friday, October 16, 2015 08:11 PM EDT | Updated: Friday, October 16, 2015 09:39 PM EDT\nYou can’t turn a ship around on a dime.\nEspecially when it’s been sitting at the bottom of the ocean for nine years.\nSo it should come as no surprise that the massive reclamation project assigned to Peter Chiarelli, Todd McLellan and Connor McDavid is going slower than most fans hoped.\nDespite all of the off-season excitement and pre-season hype, the Oilers are actually off to a worse start than last year. They are 0-4 and still losing games because of their trademark weaknesses and bad habits.\nIn other words, they’re pretty much right on schedule for what the new regime promised when it inherited this bloody mess: No Quick Fix.\n“We talked about it from Day 1 of training camp, that this wasn’t going to be a quick fix,” said winger Matt Hendricks, who can always be counted on for an honest assessment of how this team is playing.\n“It’s going to take some time for the culture in the room to change and the strategy for our games to change and the way\nAbout the author Robert Tychkowski Other Stories Oilers drop second game to Blues this season in home opener loss\nIf this keeps up, those Farewell Season signs at Rexall Place will take on an entirely new meaning.\n0\nAfter a winless season-opening road trip, the Oilers look to turn game around for home opener\nThe Edmonton Oilers won’t be home for long, but they’re definitely longing for home.\n0\nSee more from Robert Tychkowski »\nTop stories Popular Latest Videos Election primer: Where the party leaders stand on issues\n0\nWorld media on Canada's election: Pierre Trudeau in the news again\n0\nAttack on TPP is attack on all trade\n0\n'Star Wars: The Force Awakens' poster revealed\n0\nPaul McCartney's boyish enthusiasm shines in Toronto show\n0\nElection primer: Where the party leaders stand on issues\n0\nAttack on TPP is attack on all trade\n0\nFederal party leaders rally voters as election enters final stretch\n0\n'Goosebumps' tops 'The Martian,' at box office while 'Crimson Peak' falls flat\n0\nWorld media on Canada's election: Pierre Trudeau in the news again\n0\nSun Reporters Ganter & Longley on Blue Jays Win\nAndrea Christidis remembered\nJays get ready for Game 5\nBob Elliott and Steve Buffery on the Blue Jays win\nGame 5 will be The Stroman Show\nMore from Hockey Kessel, Crosby quiet as Penguins defeat Maple Leafs 0\nLeafs' Bozak misses game against Penguins 0\nWith Domi and Duclair, Coyotes doing player development right 0\nFantasy Fare: It's all so pointless 0\nThe Phil Kessel Quote: book 0\nInside Toronto sun.com News\nWhere the party leaders stand 0", "external_links": ["http://pubads.g.doubleclick.net/gampad/clk?id=182027221&iu=/3081/SMCO_ENUR_TSUN_EN_WEB", "http://pubads.g.doubleclick.net/gampad/clk?id=228633661&iu=/3081/SMCO_ENUR_TSUN_EN_WEB", "http://pubads.g.doubleclick.net/gampad/clk?id=182024221&iu=/3081/SMCO_ENUR_TSUN_EN_WEB", "http://pubads.g.doubleclick.net/gampad/clk?id=183052021&iu=/3081/SMCO_ENUR_TSUN_EN_WEB"], "published": "2015-10-17T08:11:00.000+03:00", "crawled": "2015-10-18T22:19:19.000+03:00", "highlightTitle": ""}