{"organizations": [], "uuid": "71b3a9a3231939802f76745916d5b5b5339eb893", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.fox8live.com", "main_image": "", "site_section": "http://www.fox8live.com/", "section_title": "New Orleans News, Weather, Saints - FOX 8 WVUE New Orleans News, Weather, Sports, Social", "url": "http://www.fox8live.com/story/30347211/florida-ends-bear-hunt-after-2nd-day-limit-nearly-reached", "country": "US", "title": "Florida ends bear hunt after 2nd day; limit nearly reached", "performance_score": 0, "site": "fox8live.com", "participants_count": 1, "title_full": "Florida ends bear hunt after 2nd day; limit nearly reached - FOX 8 WVUE New Orleans News, Weather, Sports, Social", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T02:00:00.000+02:00", "replies_count": 0, "uuid": "71b3a9a3231939802f76745916d5b5b5339eb893"}, "author": "cbs8", "url": "http://www.fox8live.com/story/30347211/florida-ends-bear-hunt-after-2nd-day-limit-nearly-reached", "ord_in_thread": 0, "title": "Florida ends bear hunt after 2nd day; limit nearly reached", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By KELLI KENNEDY\nAssociated Press FORT LAUDERDALE, Fla. (AP) - After just two days, Florida ended its controversial black bear hunt because a higher than expected number of bears had been killed.\nWildlife authorities said late Sunday that 295 bears taken overall, nearing the official limit.\nThe Florida Fish and Wildlife Conservation Commission posted a statement on its website saying it had closed the 2015 hunt because it was approaching an agency \"objective\" of 320 bears overall.\n\"The 2015 bear hunt is officially over,\" the statement said.\nWildlife officials had already shut down hunting in designated central and east Panhandle regions of Florida after the first day Saturday. The statement late Sunday said additional North and South units were closed to hunting after the second day, meaning hunting had ended in all four \"bear management units\" were it was allowed.\nAuthorities say they weren't alarmed by the numbers, saying the figures suggest the bear population is higher than they thought. The hunt was approved earlier this year after considerable and contentious debate. Backers estimated Florida's black bear population had grown to 3,500 - from a few hundred in the 1970s. But opponents challenged those numbers.\nMore than 30 states allow bear hunting in some form, officials said.\nEarlier Sunday, the agency's executive director, Nick Wiley, told The Associated Press the agency closely monitors the numbers of bears taken and was already leaning toward ending the hunt after two days.\nThe agency's subsequent statement late Sunday said the agency \"took a conservative approach ... building in buffers so the number of bears harvested would stabilize growing populations while ensuring a continuation of healthy bear numbers.\"\nOfficials shut down the central and east Panhandle regions after the hunt's first day Saturday. They said 112 bears were killed in the Panhandle region at last count, nearly triple the 40 kill limit for that area. In the central region, 139 bears were killed, it said. The agency's statement added that 23 bears were taken in the North unit at last count and 21 bears in the South unit before those final two areas were closed Sunday to hunting.\n\"From a biological sustainable population perspective, none of these numbers are worrisome to us, we have large growing bear populations,\" said FWC's Thomas Eason, speaking Sunday before the overall hunt had ended.\nMore than 3,200 hunters purchased permits to participate, including 1970s rocker Ted Nugent and Liesa Priddy, a rancher and Florida Fish and Wildlife Commission member who voted to approve the new hunts.\nBackers of the hunt said growing numbers of bears presented a safety problem, as close encounters with bears made headlines in recent months. Activists have argued that the state should instead focus through other means on curbing nuisance bears and assuring safety through trash management and other means. Opponents of the hunt staged protests around the state over the weekend.\nOfficials set up 33 stations where hunters were required to record each kill within 12 hours, with some of the last stations to remain open until noon Monday. Hunters were prohibited from using dogs or bait to lure the bears, and could only kill bears weighing more than 100 pounds, among other restrictions. Among the weapons allowed: shotguns, bows, pistols, revolvers and crossbows.\nCopyright 2015 The Associated Press. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-10-26T02:00:00.000+02:00", "crawled": "2015-10-26T17:53:23.586+02:00", "highlightTitle": ""}