{"organizations": ["U-M", "Lansing State Journal", "MSU", "Detroit Free Press"], "uuid": "eb5a4d500b388fb36ecf3d3620b62690dbb21581", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.lansingstatejournal.com", "main_image": "http://www.gannett-cdn.com/-mm-/697648ba89f37393ad6249887890fb015cd967ec/c=0-218-3466-2168&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/10/06/Lansing/B9319153008Z.1_20151006114649_000_GD6C5GHBS.1-0.jpg", "site_section": "https://feeds.feedblitz.com/lansing/sports", "section_title": "Lansing - Sports", "url": "http://www.lansingstatejournal.com/story/sports/college/msu/football/2015/10/15/high-stakes-shadow-doubt-msu-readies-u-m/73820738/", "country": "US", "title": "High stakes, shadow of a doubt as MSU readies for U-M", "performance_score": 0, "site": "lansingstatejournal.com", "participants_count": 0, "title_full": "High stakes, shadow of a doubt as MSU readies for U-M", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T06:35:00.000+03:00", "replies_count": 0, "uuid": "eb5a4d500b388fb36ecf3d3620b62690dbb21581"}, "author": "", "url": "http://www.lansingstatejournal.com/story/sports/college/msu/football/2015/10/15/high-stakes-shadow-doubt-msu-readies-u-m/73820738/", "ord_in_thread": 0, "title": "High stakes, shadow of a doubt as MSU readies for U-M", "locations": ["Oregon", "Michigan"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mark Dantonio", "Joe Rexrode"], "text": "High stakes, shadow of a doubt as MSU readies for U-M Joe Rexrode, Detroit Free Press 11:35 p.m. EDT October 15, 2015 Buy Photo Michigan State coach Mark Dantonio leads his team onto the field to battle Oregon Sept. 12 at Spartan Stadium. The winner of the evening’s 50/50 raffle has yet to claim their prize of more than $30,000. (Photo: Lansing State Journal file photo) Buy Photo \nEAST LANSING – Imagine in 1978, after Michigan State beat Michigan 24-15 in Ann Arbor, someone saying that the first nine seasons of Bo Schembechler had been nice and all, but the in-state rival that dominated for multiple decades before his arrival was ending the Wolverines’ little party and reclaiming its throne. \nThat’s an imperfect analogy for the MSU-Michigan situation of today, of course. But the comparison point is that it was obvious Schembechler had built something that would last a long time by then. \nThat may be less obvious to some when it comes to MSU coach Mark Dantonio, who would lose for the fourth time in 36 games and the third time in nine tries against Michigan if he can’t pull an upset Saturday at Michigan Stadium. And the perception of a critical moment at hand for MSU seems to have more to do with the new guy coaching the Wolverines than anything. \nIt’s clear the No. 12 Wolverines (5-1, 2-0 Big Ten) are on the rise under Jim Harbaugh, after seven mostly forgettable seasons under Rich Rodriguez and Brady Hoke. The No. 7 Spartans (6-0, 2-0) have been on top, in the state and beyond. So the question is being asked again: Can MSU and U-M enjoy sustained football excellence at the same time? Couch: MSU's 1995 win over U-M a euphoric false start \nThe next few years should deliver an answer, because conditions can’t be much more prime than this. For now, the outside expectations vary. \nUSA Today’s Dan Wolken wrote this week of Saturday’s stakes: “This is the year Michigan State had to make good on being the big dog in the state before Jim Harbaugh’s influence started to tip the balance in recruiting and on the field. Hardly anyone expected that Michigan might actually be the better team this year. But that’s a very possible scenario right now … If Michigan wins this game, effectively ending the Spartans’ hopes of making the College Football Playoff, it may be years before Michigan State fans recover from the gut-punch.” \nThat’s a grim forecast for an MSU program that has been recruiting at a higher level, in expanding areas, since finishing the 2013 season 13-1 with a Big Ten championship win over Ohio State and Rose Bowl win over Stanford. Most of the 32 wins in the past 35 games can be credited to players from less-heralded classes. \nSaturday’s stakes are different for the two teams, though, based on preseason expectations. This was to be a national title contender in East Lansing and a first step in the Harbaugh rebuild in Ann Arbor. Who ya got? National analysts pick Michigan vs. MSU \nMichigan has looked like the better team and is a significant favorite. That can easily lead to the question: What’s going to happen when Harbaugh really gets it going? \n“One loss wouldn’t crumble what Mark Dantonio’s built in East Lansing – which he’s done while Michigan generated more headlines through three coaching changes after Lloyd Carr retired,” said Bill Bender of Sporting News. “It’s nothing new. The Spartans continue to recruit well and develop NFL-ready talent. But the stakes are higher than they’ve ever been for the Spartans now. They have to slow down Jim Harbaugh's momentum.\" \nAn MSU loss could “return the outside perception back to what it once was, that Michigan State always plays second fiddle to Michigan,” said USA Today’s Nicole Auerbach, who wrote a story this week about the “seesaw effect” history of these programs. \nTo quickly review, U-M is the older university and football program, with the most wins in the sport’s history and a decided advantage in the first half of the 20th century. Michigan State was a pest then, not a rival – with six wins and five home games in the first 42 meetings. \nBiggie Munn turned MSU into the better program in the 1950s, which saw MSU join the Big Ten despite well-documented opposition from U-M, and the Spartans kept winning big under Duffy Daugherty. The Spartans were 14-4-2 against the Wolverines in those two decades with claims to six national titles. MSU may represent biggest challenge yet for U-M defense \nSchembechler took over in 1969, Daugherty retired in 1972, and the Schembechler coaching family – assistants Gary Moeller and Lloyd Carr followed him – went 30-8 against the Spartans. Those four decades of stability on one side and frequent changing with occasional surges on the other built the massive perception wall Dantonio encountered when he took the MSU job. \nAnd it’s not just perception. Michigan has a significant edge in resources and fans. But Dantonio has two Big Ten titles, two straight top-5 finishes, four straight bowl wins and a 6-1 record in his past seven games against the Wolverines. \n“Mark Dantonio and (Kansas State’s) Bill Snyder are the top two program builders in the country,” said Dennis Dodd of CBSSports.com. “Michigan State will endure, Michigan State won’t slip up, not as long as Mark Dantonio is there.” Read or Share this story: http://on.lsj.com/1RLpYkh TOP VIDEOS", "external_links": [], "published": "2015-10-16T06:35:00.000+03:00", "crawled": "2015-10-16T12:44:22.623+03:00", "highlightTitle": ""}