{"organizations": ["Associated Press", "Seahawks"], "uuid": "b9cc344fa66e350ba002dec53dff3fc0f397dc31", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usatoday.com", "main_image": "http://www.gannett-cdn.com/-mm-/f26406a5f9b2137752a5af0f6d129b02c4bb92e0/c=0-240-4176-2589&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/10/23/USATODAY/usatsports/6a057a42a3419a2f850f6a7067004cf2.jpg", "site_section": "http://www.usatoday.com/sports/", "section_title": "USA Today | Sports", "url": "http://www.usatoday.com/story/sports/nfl/2015/10/23/wilson-seahawks-rule-rivalry-with-49ers-again-in-20-3-win/74444260/", "country": "US", "title": "Wilson, Seahawks rule rivalry with 49ers again in 20-3 win", "performance_score": 0, "site": "usatoday.com", "participants_count": 0, "title_full": "Wilson, Seahawks rule rivalry with 49ers again in 20-3 win", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T09:13:00.000+03:00", "replies_count": 0, "uuid": "b9cc344fa66e350ba002dec53dff3fc0f397dc31"}, "author": "", "url": "http://www.usatoday.com/story/sports/nfl/2015/10/23/wilson-seahawks-rule-rivalry-with-49ers-again-in-20-3-win/74444260/", "ord_in_thread": 0, "title": "Wilson, Seahawks rule rivalry with 49ers again in 20-3 win", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Wilson"], "text": "(Photo: The Associated Press)\n1 CONNECT TWEET LINKEDIN COMMENT EMAIL MORE SANTA CLARA, Calif. (AP) — More often than not, Colin Kaepernick has been at his worst against Seattle. Russell Wilson and the Seahawks are ruling this one-sided rivalry with San Francisco.\nThe 49ers produced another prime-time dud, on Thursday night against the Seahawks just like last year for Thanksgiving when Richard Sherman chomped turkey on the Levi's Stadium field.\nKaepernick completed 13 of 24 passes of 124 yards while taking six sacks in the 20-3 loss Thursday, San Francisco's fourth straight defeat to its NFC West rival and sixth in the last seven meetings.\n\"We've had our struggles with Seattle,\" said 49ers tight end Vernon Davis, who had his first catches since Week 2. \"It's pretty hard to get by this.\"\nKaepernick's errant passes sailed into both sidelines, one ball even hitting a 49ers staff member in the head early in the game and requiring him to be checked. The 49ers had more punts — nine — than first downs (eight).\n\"I'm not going to force a ball into a window and take a chance on a turnover,\" said Kaepernick, his right hand taped after the game because of a swollen thumb. \"We just didn't make plays when we needed to. I do know we didn't play well enough to win.\"\nPhil Dawson kicked a 35-yard field goal late in the third, and the 49ers have been held to single digits in their past three losses to Seattle with just one touchdown, outscored 56-13.\nSan Francisco's 55 yards in the first half were the fewest allowed by the Seahawks defense in an opening half since Week 17 of the 2013 season against St. Louis. The 49ers (2-5) finished with 142, fewer than the 164 they managed on Thanksgiving and their worst total since 133 yards against the Vikings on Nov. 5, 2006.\nIt was Seattle's second-lowest total allowed under coach Pete Carroll.\n\"Offensively today it was just not acceptable all the way around,\" 49ers left tackle Joe Staley said.\nKaepernick fell to 1-6 in seven starts against the Seahawks with three touchdown passes to nine interceptions and 24 sacks and San Francisco flopped four days after ending a four-game losing streak by beating Baltimore.\nFans left early again in an eerily similar scene to Thanksgiving night, when 49ers CEO Jed York apologized on Twitter in the waning moments by saying: \"This performance wasn't acceptable. I apologize for that.\"\nThis time, it was former 49ers wideout Kassim Osgood weighing in on Twitter with: \"'Something ain't right in SF.\"\nThis game lacked its usual intrigue with both teams trying to save their seasons and Carroll missing former nemesis and now-Michigan coach Jim Harbaugh.\n\"That game today was not what we want. It was not acceptable,\" first-year coach Jim Tomsula said. \"We did not play well. We don't have an excuse. Again, that lies right here and we need to do a better job.\"\nThe Seahawks (3-4), meanwhile, rediscovered their tried-and-true formula to get back in the win column. Wilson threw a 43-yard touchdown pass to Tyler Lockett late in the first half and Marshawn Lynch added a leaping 1-yard score on the way to 122 yards after vomiting early in the game after becoming winded.\n\"It felt like a really normal Seahawk night tonight,\" Carroll said.\nWilson completed 10 of his first 12 passes and finished with 235 yards passing as Seattle won for the first time in four road games this season, avoiding another fourth-quarter collapse.\nSteven Hauschka sent dirt flying when he kicked a 49-yard field goal in the second quarter four days after Ravens kicker Justin Tucker slipped on the turf and shanked one off the right upright and slipped to the ground on the field that will host the Super Bowl in early February.\nWilson was sacked five times to push his NFL-leading total to 31 and threw a pair of interceptions, but still made plenty of big plays for another lopsided result against the Niners.\nThe Seahawks' winning streak in the series started with the NFC championship game in January 2014 that propelled them to a Super Bowl victory. Seattle has won six out of seven overall against San Francisco.\nJermaine Kearse caught a 21-yard pass over a leaping NaVorro Bowman, facing Seattle for the first time since a frightening left knee injury in the NFC title game. He needed surgery and was sidelined all of last season.\nThe Seahawks needed six plays once they reached the 3 on their opening drive before Lynch's leaping touchdown, just the team's second TD of the season on the initial drive.\nNotes: Davis' 14-yard catch in the second quarter was his first reception since Week 2. ... San Francisco S Antoine Bethea injured his shoulder in the first half and didn't return. ... LB Gerald Hodges made his 49ers debut. ... Kaepernick went without a carry for the first time in his 46 career starts.\n___\nOnline: http://pro32.ap.org/poll and http://twitter.com/AP_NFL\n1 CONNECT TWEET LINKEDIN COMMENT EMAIL MORE Copyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.\nTOP VIDEOS", "external_links": ["https://twitter.com/intent/tweet?url=http%3A//usat.ly/1S0bqh0&text=Wilson%2C%20Seahawks%20rule%20rivalry%20with%2049ers%20again%20in%2020-3%20win&via=usatoday", "http://www.gannett-cdn.com/-mm-/6a7061684cdd8d2f2801ab674ca82b82a65d8780/c=202-0-3975-2830&r=x404&c=534x401/local/-/media/2015/10/23/USATODAY/usatsports/6a057a42a3419a2f850f6a7067004cf2.jpg", "http://twitter.com/AP_NFL", "http://www.linkedin.com/shareArticle?url=http%3A//usat.ly/1S0bqh0&mini=true", "http://pro32.ap.org/poll"], "published": "2015-10-23T09:13:00.000+03:00", "crawled": "2015-10-23T08:43:13.199+03:00", "highlightTitle": ""}