{"organizations": ["Pittsburgh Steelers", "Baltimore Ravens"], "uuid": "def0411089f5371b8e4a5ed36577aec790113e98", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.allmediany.com", "main_image": "", "site_section": "http://www.allmediany.com/rssService/Sports.xml", "section_title": "Sports", "url": "http://www.allmediany.com/news/55655-nfl-thursday-night-football-preview-baltimore-ravens-pittsburgh-steelers", "country": "US", "title": "NFL Thursday Night Football Preview: Baltimore Ravens @ Pittsburgh Steelers", "performance_score": 0, "site": "allmediany.com", "participants_count": 0, "title_full": "NFL Thursday Night Football Preview: Baltimore Ravens @ Pittsburgh Steelers", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T07:27:00.000+03:00", "replies_count": 0, "uuid": "def0411089f5371b8e4a5ed36577aec790113e98"}, "author": "", "url": "http://www.allmediany.com/news/55655-nfl-thursday-night-football-preview-baltimore-ravens-pittsburgh-steelers", "ord_in_thread": 0, "title": "NFL Thursday Night Football Preview: Baltimore Ravens @ Pittsburgh Steelers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Get Sports Alerts \n1 Oct 2015 04:27 PM EST \n-by Daniel Mogollon, Staff Writer; Image: Baltimore Ravens quarterback Joe Flacco. (Image Source: Mitch Stringer/USA TODAY Sports) \nHere’s a look at the Thursday Night Football matchup between the Pittsburgh Steelers and the Baltimore Ravens: \nSeries: Steelers Lead 21-17; Streaks: Steelers won 3 of past 5; Last Meeting: Steelers 43, Ravens 23 (11.2.14) \nTime: 8:30 PM ET; TV: CBS (Jim Nantz, Phil Simms & Tracy Wolfson) \nSpread: Ravens 2 ½; O/U 44 \nInjury Report: Ravens: Out: DE Chris Canty (calf), TE Crockett Gillmore (calf), T Eugene Monroe (concussion), WR Breshad Perriman (knee) \nSteelers : Out: DT Daniel McCullers (knee), QB Ben Roethlisberger (knee), LB Ryan Shazier (shoulder), TE Matt Spaeth (hand); Questionable: CB Cortez Allen (knee); Probable: LB James Harrison (thumb), C Cody Wallace (illness) \nWhere They Stand: In one of the biggest surprises of the season, the Baltimore Ravens are one of four winless clubs heading into Week 4, the only team in the AFC. They were expected to compete for the AFC North…instead they are already three games behind the Cincinnati Bengals (including a head-to-head home loss). At 2-1, the Pittsburgh Steelers are just one game in back of Cincy, having won their past two. However, they will be without QB Ben Roethlisberger for the next four to six weeks, which could put their playoff chances in jeopardy. \nThe Ravens: In his past five games against the Steelers, including a Wildcard Weekend win last season, QB Joe Flacco has crushed it against the division rival: 1,194 yards, eight TDs, one INT, 68 percent, 100.8 rating. He’s also good on Thursday nights, winning his past five (1,296 & seven TDs), as well as divisional games with a 27-16 record against the AFC North. Veteran WR Steve Smith Sr. is still making plays, becoming the first Raven with back-to-back 150-yard receiving games in the past two weeks. With 13 receptions for 186 yards and two TDs last Sunday, he had the second-biggest receiving game for a player 36 years or older. Since the start of last season, RB Justin Forsett leads the NFL with his 5.1 YPC and has rushed for 1,390 yards. OLB Elvis Dumervil has 10 sacks and two FFs in his past 10 against Pittsburgh, while ILBs C.J. Mosley and Daryl Smith lead the team with 21 tackles. Smith is one of three players with 25 sacks (27.5) and 10 INTs (10) since 2004. Holding down the back end of the D is coverman Jimmy Smith , who has an INT in two of three games this season. \nThe Steelers: Filling in for Ben Roethlisberger is southpaw Michael Vick , the all-time leading rushing quarterback (6,005 yards). The last time Vick played the Ravens he put up 405 total yards (371 passing) and two TDs, however that was Vick circa 2012 and he’s not the same player. A key for the Steelers is Vick’s ability to make use of Antonio Brown’s skills. Brown leads the NFL in receptions (268) and receiving yards (3,633) since 2013. He has reached the century mark in six of the past seven games, needing one more for 20 100-yard games in his career, with 14-straight games of at least seven receptions, an NFL record. The man the Steelers will lean on with Big Ben on the mend is RB Le’Veon Bell , who made his season debut last week in St. Louis. A double threat, Bell is averaging 162 yards from scrimmage in his past seven games (676 rushing yards, 458 receiving yards, nine TDs). There are new names emerging as playmakers in Pittsburgh’s front seven, including DE Stephon Tuitt and OLB Arthur Moats . Tuitt has 2.5 sacks in the past two games, while Moats also looks to get to the QB for the third-straight game. \nPrediction: Unlike many of their head-to-head matchups over the years, this one probably won’t impact the AFC North title, but that doesn’t mean you shouldn’t tune in. The last time the Ravens won in Pittsburgh in the regular season was in 2012, but the last time they played was last postseason and Baltimore pulled off the upset. This time the Ravens, despite their winless record, are the favorite on the road. That’s because of the loss of Big Ben, probably the most valuable player in the division. His absence is also why the desperate-for-a-W Ravens will win their first game of the season on Thursday Night. \nScore: Ravens 23, Steelers 13 \nDaniel Mogollon is a member of the Pro Football Writers of America and the Football Writers Association of America. He is also a voter for the Thorpe and the Rotary Lombardi Award, as well as the Latino Sports MVP Awards. You can reach him via email: danmogollon@gmail.com .", "external_links": [], "published": "2015-10-01T07:27:00.000+03:00", "crawled": "2015-10-03T08:16:08.383+03:00", "highlightTitle": ""}