{"organizations": [], "uuid": "65f5fccaea4a7dd15bf4eee0c501865feac56b2a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sportsonearth.com", "main_image": "http://www.sportsonearth.com/assets/images/8/2/4/154088824/cuts/broncos_raiders1980x1100_edqxpfbv_f1scs7h6.jpg", "site_section": "http://www.sportsonearth.com/gen/hb/rss/writers.xml", "section_title": "Sports on Earth Writers", "url": "http://www.sportsonearth.com/article/154086950/broncos-defense-pick-six-beats-raiders", "country": "US", "title": "'D' Saves Manning and Broncos (Again)", "performance_score": 0, "site": "sportsonearth.com", "participants_count": 1, "title_full": "'D' Saves Manning and Broncos (Again)", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:07:00.000+03:00", "replies_count": 0, "uuid": "65f5fccaea4a7dd15bf4eee0c501865feac56b2a"}, "author": "Knox Bardeen", "url": "http://www.sportsonearth.com/article/154086950/broncos-defense-pick-six-beats-raiders", "ord_in_thread": 0, "title": "'D' Saves Manning and Broncos (Again)", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments Peyton Manning was 22 for 35 with only 266 yards and threw two interceptions, but the Broncos still outlasted the Raiders, 16-10. (Getty Images) \nWith seven minutes to play in the game, why were the Raiders rushing to get plays off? Yes, Oakland was down two points at home against the mighty Broncos and needed to score to pull off the upset, but it had all the time in the world. Instead of a smooth and steady march down the field, Derek Carr might have become a little antsy. And then he threw a pick that pretty much sealed the game for Denver. Final score: 16-10. \nChris Harris Jr.'s 74-yard pick-six gave the Broncos a late-game cushion. But outside of its defense and still-perfect record, there were more questions than answers for the fightin' Peytons. Three Takeaways \n1. Denver's defense is still pulling most of the weight \nIt's no secret that this Broncos defense is the team's strength. In fact, the Denver defense is so good it could likely carry the team into the playoffs even without a future Hall of Fame quarterback under center. Broncos defense is like having 1.5 × a normal D on your side under Phillips. 75 yd pick 6 here 4 Harris Jr. #Raiders pic.twitter.com/iX7kHDaQRS &mdash; Will Reeve (@WillReeveJr) October 11, 2015 \nBut while Peyton Manning has a gold jacket waiting for him in the future, he hasn't shown anything in 2015 remotely close to being able to put a team on his back and carry it. Sunday's effort against the Raiders was more proof. Manning was 22 for 35 with 266 yards and couldn't punch the football into the end zone. He also was picked off twice and failed to provide any kind of offensive spark. Never fear, however, as Harris saved the day, showing the franchise and its fan base that no matter what the offense does, the defense is going to push Denver into the playoffs. \n2. 7's are better than 3's \nOne of the knocks against a Gary Kubiak-led offense is the fact that not every trip inside the red zone pays off. It's a little more complicated than that, though. Kubiak's teams have always had trouble converting touchdowns from inside the 20-yard line. \nWith Manning under center, however, that shouldn't be an issue. \nThe Broncos made three trips inside the red zone and never came away with a touchdown. Manning threw a pick, and the Broncos settled for two field goals on the other occasions. On 3 red zone trips, Broncos have just 6 points. They average 5.1 points per red zone trip this season #Raiders &mdash; Josh Dubow (@JoshDubowAP) October 11, 2015 \nWith a rushing attack that doesn't always work, and a quarterback who's definitely on his way toward riding off into the sunset, teams like the Raiders can definitely hang with this team if they don't get in the end zone more often. \n3. Charles Woodson is an ageless wonder \nWith age comes wisdom and a lot of times patience, and Charles Woodson definitely showed he could wait a long while before a payoff. \nWoodson, who entered the league the same year as Manning, played 17 years (242 games) without picking off a pass from the QB. He put that streak to bed Sunday with not one, but two interceptions of Manning. A photo posted by SportsCenter (@sportscenter) on Oct 11, 2015 at 2:47pm PDT \nWoodson entered Sunday's action with 62 interceptions against 23 different NFL teams in his illustrious career. The wait was long to finally get a few from Manning, but definitely worth it. Stats Amazing \nNo quarterback in the history of the NFL has started seasons as well as Manning. Peyton Manning: starts a season 5-0 for 7th time in career (most for a starting QB in NFL history) &mdash; ESPN Stats & Info (@ESPNStatsInfo) October 11, 2015 Fantasy Focus \nThe Broncos had trouble getting the football into the end zone, but Manning did not have any issues whatsoever targeting Emmanuel Sanders , who had nine catches for 111 yards. If you own Sanders in a PPR league, he may have made your day. \nDenver and Oakland combined for 23 points and the eight players that tallied a rushing attempt only cleared 108 yards on the ground. A low-scoring affair with very few rushing yards meant fantasy owners were disappointed in this one. \nCarr did throw a touchdown pass and log 249 passing yards. Marcel Reece paced the Raiders with a touchdown grab and seven catches for 49 yards. \nOutside of those limited stars, and possibly Demaryius Thomas' five grabs for 55 yards or Michael Crabtree 's four for 54 yards, this game was a fantasy dud.", "external_links": [], "published": "2015-10-12T03:07:00.000+03:00", "crawled": "2015-10-12T10:36:20.659+03:00", "highlightTitle": ""}