{"organizations": [], "uuid": "f51921399e7fac829f15c488a0cb97198b135109", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.heraldnews.com", "main_image": "http://www.heraldnews.com/Global/images/head/nameplate/fallriver_logo.png", "site_section": "http://www.heraldnews.com/sports/pro-sports?template=rss&mime=xml", "section_title": "Professional Sports - The Herald News, Fall River, MA", "url": "http://www.heraldnews.com/article/20151008/SPORTS/151006352/11734/SPORTS?rssfeed=true", "country": "US", "title": "BRUINS PREVIEW: It may take time to determine how much change was good", "performance_score": 0, "site": "heraldnews.com", "participants_count": 1, "title_full": "BRUINS PREVIEW: It may take time to determine how much change was good", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T11:34:00.000+03:00", "replies_count": 0, "uuid": "f51921399e7fac829f15c488a0cb97198b135109"}, "author": "Mike Loftus", "url": "http://www.heraldnews.com/article/20151008/SPORTS/151006352/11734/SPORTS?rssfeed=true", "ord_in_thread": 0, "title": "BRUINS PREVIEW: It may take time to determine how much change was good", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted Oct. 8, 2015 at 3:30 AM Updated at 3:34 AM BOSTON – So are they back in, or are they out again? Many Bruins aren’t accustomed to the question. For the past five or six years, they’ve been asked more often about contending for the Stanley Cup, and which teams they considered their primary competition. A more realistic question for the 2015-16 Bruins is whether they can return to the playoffs after missing last season for the first time since 2007, and there’s not an easy answer. The B’s didn’t quite blow up what, at this time last year, was thought to be a contending team. CEO Charlie Jacobs said “it hasn’t been necessarily a reboot, maybe just a refresh,’’ but offseason changes were hardly cosmetic, either. Don Sweeney, who replaced fired general manager Peter Chiarelli, cut ties with everything from first-line forwards (Milan Lucic) and first-pairing defensemen (Dougie Hamilton) to fourth-liners and backups, plus players in between. Those changes will be evident in Thursday night’s season opener against the Jets (7:05, NESN, WBZ-FM/98.5), but what’s not yet clear is whether those changes make the Bruins a better team. Is former Anaheim Duck Matt Beleskey a first-line upgrade over Lucic? Is Ryan Spooner a bona fide NHLer, and as capable a No. 3 center as Carl Soderberg? Will the Bruins’ array of right wings perform well enough on their assigned lines to allow Loui Eriksson the long-awaited opportunity to skate with Brad Marchand and Patrice Bergeron, where Reilly Smith got to play for two years? Does anyone on the roster even remotely resemble Hamilton? Those are just the big questions. The B’s also have to figure out if some newcomers can effectively replace the fourth-line/penalty-killing duo of Daniel Paille and Gregory Campbell, determine if NHL veteran Jonas Gustavsson will be a more suitable backup to No. 1 goalie Tuukka Rask, even come up with an on-site spare defenseman who can step into the lineup, like Matt Bartkowski did for the better part of three years. Despite the continued presence of head coach Claude Julien and his staff, top-tier core pieces such as Rask, centers Bergeron and David Krejci, and defenseman Zdeno Chara, and other longtimers like winger Marchand and defenseman Adam McQuaid, too much is new for the B’s to make bold, “We shall return“ statements – at least not in the first week of October. “We do have a bigger turnover than in a number of years,’’ said team president Cam Neely, “so we want to see how everybody plays together, what kind of group we’re going to ice here, and see how they develop over the course of the year.’’ Page 2 of 2 - The potential to return to the playoffs hinges mainly, but not exclusively, on if and how well the Bruins come together. The competition has a say, too, and the B’s might have an advantage playing in the Atlantic Division. Stanley Cup finalist Tampa Bay and Montreal, 1-2 in the divison last season, may be out of the Bruins’ reach, but that’s necessarily not the case with the teams they’d likely have to pass to finish third and guarantee a berth. The Red Wings (100 points), four points better than the B’s, are no longer led by coaching guru Mike Babcock. The still-young Senators, who finished three points up, have to prove that last season’s epic 23-4-4 charge to am Eastern Conference wild-card slot wasn’t a fluke. The B’s were actually closer to a wild-card berth last season, finishing only two points behind the Metropolitan Division’s Penguins, but with that division considered the stronger of the two in the Eastern Conference – and with everyone expecting the Columbus Blue Jackets to emerge as another playoff contender – the Bruins’ easier path to the playoffs would be through their division. A strong, confidence-boosting start to the season would help, but fits and start might be more likely. The Bruins would take that, albeit grudgingly, as long as they see everyone working – hard – toward progress. “We have expectations to do well,“ Neely said. “We want our players to know that those are the expectations that not only we have, but our fan base has. Most importantly, it’s competing every night. “We brought in guys that do want to compete. They want to win. … With the group that we have that’s new, and the group we have that’s coming back, I’m excited to see us get going.’’ Around the boards: Chara, still day-to-day and on injured reserve with an upper body injury, practiced for the second straight day on Wednesday, but his status for the opener remained uncertain. “I know he’s feeling a lot better,“ Julien said. “Early in the season, we have to make a decision whether he’s well enough that we can take risk, or whether we want to be a little more cautious.’’", "external_links": [], "published": "2015-10-08T11:34:00.000+03:00", "crawled": "2015-10-08T20:47:47.986+03:00", "highlightTitle": ""}