{"organizations": ["Society", "Talladega Superspeedway A Chevrolet", "NASCAR", "American Cancer Society", "Chevrolet SS Mobil", "Talladega Superspeedway", "Chevrolet NASCAR", "General Motors", "Auto-Owners Insurance", "CATERPILLAR", "Corvette Stingray", "Talladega", "TALLADEGA", "3M Chevrolet SS", "Cessna Chevrolet SS", "Equinox LTZ", "Sirius NASCAR Radio Channel", "Team Chevy", "Chevrolet", "MRN", "Martinsville Speedway", "NSCS", "Hendrick Motorsports"], "uuid": "dde2e5d46d86535350a8ec3ccc964fbe392c40f1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.google.com", "main_image": "", "site_section": "http://news.google.com/news?pz=1&cf=all&ned=us&hl=en&topic=s&output=rss", "section_title": "Sports - Google News", "url": "http://news.google.com/news/url?sa=t&fd=R&ct2=us&usg=AFQjCNH4xUwXK_WZb2MHet6YW7xfoHbz0Q&clid=c3a7d30bb8a4878e06b80cf16b898331&cid=52778974372037&ei=qoYnVqCJMaOJa-LkrbgF&url=http://paddocktalk.com/news/html/story-291884.html", "country": "IL", "title": "2015 Talladega II: Chevrolet NASCAR Sprint Cup Race Preview - PaddockTalk", "performance_score": 0, "site": "google.com", "participants_count": 0, "title_full": "2015 Talladega II: Chevrolet NASCAR Sprint Cup Race Preview - PaddockTalk", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T13:46:00.000+03:00", "replies_count": 0, "uuid": "dde2e5d46d86535350a8ec3ccc964fbe392c40f1"}, "author": "", "url": "http://news.google.com/news/url?sa=t&fd=R&ct2=us&usg=AFQjCNH4xUwXK_WZb2MHet6YW7xfoHbz0Q&clid=c3a7d30bb8a4878e06b80cf16b898331&cid=52778974372037&ei=qoYnVqCJMaOJa-LkrbgF&url=http://paddocktalk.com/news/html/story-291884.html", "ord_in_thread": 0, "title": "2015 Talladega II: Chevrolet NASCAR Sprint Cup Race Preview - PaddockTalk", "locations": ["TALLADEGA", "Malibu Limited", "Daytona", "Hendrick Motorsports", "Talladega"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Paul Menard", "DALE EARNHARDT", "Ryan Newman", "KEVIN HARVICK", "Kurt Busch", "JAMIE MCMURRAY", "RYAN NEWMAN", "LOWE", "John", "Jeff Gordon", "Jimmie Johnson", "Kevin Harvick", "Jamie", "Martin Truex", "PAUL MENARD", "JUSTIN ALLGAIER", "PATRICK", "Lowe", "Daniel Hemric", "TONY STEWART", "Tony Stewart", "Joey Logano", "Gordon", "Ray Black", "JEFF GORDON", "JIMMIE JOHNSON", "MARTIN TRUEX", "Jamie McMurray", "Spencer Gallagher", "Dega", "Jr.", "Dale Earnhardt", "KURT BUSCH", "AJ ALLMENDINGER", "KYLE LARSON", "KASEY KAHNE", "Earnhardt", "JOHN", "Harvick"], "text": "Posted by: newsla on Oct 21, 2015 - 06:35 AM 2015 Talladega II: Chevrolet NASCAR Sprint Cup Race Preview This weekend, the stars of the NASCAR Sprint Cup Series travel to the 2.66-mile Talladega Superspeedway for the sixth round of the 10-race Chase playoff. Talladega is the second cutoff race in the Chase for the NASCAR Sprint Cup, the final event in the Challenger Round. Twelve drivers are currently in contention for this years title, but after 500 miles of racing at the final Superspeedway on the schedule, only eight will still have a shot at this seasons championship. At Talladega, you give more mentally than you do physically, said Dale Earnhardt, Jr., a six-time Talladega winner. In a plate race, you need to make decisions with confidence and make them quickly. If you have any kind of hesitation, someone makes that decision for you and takes away that opportunity. Were taking the same car we won with earlier this year, so its got great speed and we feel confident. It really helps when you have a great car. Weve had a fast car at the last couple of plate tracks - weve won at Talladega and Daytona, so it really helps when your car is that dominant. It makes it a lot easier on the driver to do his job and fend off challenges, and get the car to the front in the first place. Earnhardt, Jr. and his No. 88 Chevrolet SS team are still in the mix as championship contenders, but he is in a must-win situation this weekend in order to move on to the third round of the Chase. He was victorious at Talladega last May, and is the most recent Chevrolet winner at the 2.66-mile venue. Earnhardt, Jr.s Hendrick Motorsports teammate, Jeff Gordon, is also a six-time winner at Talladega; and is currently in the hunt to win a fifth championship title. Of the current six Chevy Chasers that have visited Victory Lane at the longest track on the NASCAR Sprint Cup Series schedule is the defending champion, Kevin Harvick, who earned his sole win at Talladega in 2010. No driver is really safe when it comes to restrictor plate racing at Talladega. The twists and turns that can happen are vast. The opportunity for calamity and carnage lurks around every corner. However, the pilots of Chevrolet branded cars have been the most successful over the years at taming the Talladega dragon by winning 41 of 92 races, the most of any manufacturer. This weekends race results could shake-up the Chase picture significantly. Six Chevy SS drivers will be on a quest to survive. Three (Earnhardt, Jr., Gordon and Harvick) will be seeking return trips to Victory Lane, while three others (Martin Truex, Jr., Ryan Newman and Kurt Busch) will be looking to make this weekends first win at Talladega one of the biggest of their careers. The only way to assure a spot in the Eliminator Round of the Chase will be to win. Drivers and teams that are able to avoid the elusive Big One that the track is known for, will have an opportunity on the final lap to make one last ditch effort to push through to the penultimate round of the Chase. There are 31 other drivers who hope to spoil the Chasers parade and take home a victory of their own this weekend. It is said, anyone can win at Talladega; and those who are winless this season hope to turn things around and take momentum into the off-season with a restrictor plate trophy from Dega. One thing is for sure there will be no lack of action or drama. No matter who you are cheering for as a fan, you will be on the edge of your seat during all 188 laps round the 2.66-mile Superspeedway. Before fans make their way to their seats, they are encouraged to visit the Team Chevy display located in the fan midway area. The display will open on Friday October 23 at 9 a.m. Fans can check out the great lineup of Chevrolet cars, trucks and SUV's on display as well as talk with knowledgeable product specialist about all of Team Chevy's new arrivals. Throughout the weekend fans will have the opportunity to ask questions of their favorite Chevy drivers. Paul Menard, Ryan Newman, Kurt Busch and Jimmie Johnson are scheduled to make appearances during the weekend. The 188-lap/500-mile CampingWorld.com 500 at Talladega Superspeedway is scheduled to begin at 2:30 p.m., ET on Sunday October 25. Live coverage will be available on NBCSN, MRN, Sirius NASCAR Radio Channel 90 and NASCAR.com. TEAM CHEVY IN NASCAR SPRINT CUP SERIES (NSCS) COMPETITION: · Chevrolet has won 38 NASCAR Sprint Cup Series (NSCS) Manufacturers Championships · Team Chevy drivers have scored 750 wins and 676 poles in NSCS competition CHEVROLET ON THE TRACKTALLADEGA SUPERSPEEDWAY: Chevrolet drivers have won 41 of 92 races at Talladega Superspeedway. Victories by current Team Chevy drivers are: Jeff Gordon, No. 24 3M Chevrolet SS, has six wins at Talladega Superspeedway (96,00,04,05 & 07 - TWICE) Dale Earnhardt, Jr., No. 88 Diet Mountain Dew Chevrolet SS, has six victories at Talladega Superspeedway (01, 02  TWICE, 03 & 04) Jimmie Johnson, No. 48 Lowes Chevrolet SS, has gone to Victory Lane at Talladega Superspeedway twice (06 & 11) Jamie McMurray, No. 1 Cessna Chevrolet SS, has two wins at Talladega Superspeedway (09 & 13) Kevin Harvick, No. 4 Budweiser/Jimmy Johns Chevrolet SS, has taken the checkered flag at Talladega Superspeedway once (10) Tony Stewart, No. 14 Bass Pro Shops/Mobil 1 Chevrolet SS, has one victory at Talladega Superspeedway (08) A Chevrolet driver has won two of the last four races at Talladega Superspeedway A Chevrolet driver has sat on the pole at Talladega Superspeedway 31 times Team Chevy drivers have scored 184 top-five and 343 top-10 finishes at Talladega Superspeedway A Chevrolet has led 7,937 laps (45.5% of possible 17,425 laps) at Talladega Superspeedway TEAM CHEVY FOR THE FANS AT TALLADEGA SUPERSPEEDWAY: · Fans can check out great Chevrolet vehicles including: Malibu Limited, Impala 2LZ, Corvette Stingray, Equinox LTZ, Traverse LTZ, the 2015 Motor Trend Truck of the Year  Colorado Crew Z71, Silverado 1500 Z71, Silverado 2500 High Country and Suburban LTZ · At the display fans can see a variety of specialty vehicles including: The No. 14 Chevrolet SS Mobil 1 Show Car and a production Chevrolet SS just like what Team Chevy drivers compete with on the track Fans can see a sample of engines, parts and accessories in the Team Chevy Display available for purchase from Chevrolet at their local Chevrolet dealer · Other activities at the Team Chevy Racing Display include a variety of interactive games for adults and kids DRIVER FAN Q/A APPEARANCES: o 10:00 a.m.  Daniel Hemric o 11:45 a.m.  Paul Menard o 1:15 p.m.  Ray Black, Jr. · Saturday, October 24th: o 8:25 a.m.  Spencer Gallagher · Sunday, October 25th: o 9:40 a.m.  Ryan Newman o 10:05 a.m.  Kurt Busch o 11:00 a.m.  Jimmie Johnson · Hours of operation: Fri: October 23rd  9:00 a.m.  5:00 pm., Sat. October 24th  8:00 a.m.  5:00 p.m. and Sun. October 25th  8:00 a.m.  2:00 p.m. DID YOU KNOW? Chevrolet and General Motors employees, dealers and customers are uniting to fight breast cancer this October for the fifth consecutive year. The goal is to exceed the $1.2 million raised for the American Cancer Society in 2014 through Chevrolets nationwide grassroots support for the Societys Making Strides Against Breast Cancer® walks. Chevrolet will make a $350 contribution (up to $50,000) for each caution lap taken in the pink Chevy SS pace car at the NASCAR Sprint Cup Series races at Talladega Superspeedway on October 25 and Martinsville Speedway on November 1. The American Cancer Society and Chevrolet will host breast cancer survivor events where survivors and caregivers are treated to once-in-a-lifetime experiences on the tracks. TEAM CHEVY FROM THE DRIVERS SEAT: KURT BUSCH, NO. 41 HAAS AUTOMATION CHEVROLET SS  3RD IN STANDINGS Its so difficult to predict Talladega. You can ride around in the back or charge up front all day and, either way, your day can end with your car on the hook. You just hope to have Lady Luck guide you to a good finish. Restrictor-plate races have turned into this pattern that it is hard to have any type of advantage over any other team. It just comes down to being in the right place at the right time. I have never won a restrictor-plate race that paid points. I won the Shootout (Sprint Unlimited) before, Ive won a qualifying race in Daytona, but Ive never won a points-paying race. KEVIN HARVICK, NO. 4 BUDWEISER/JIMMY JOHNS CHEVROLET SS  5TH STANDINGS ON THE MOST ANTICIPATED RACE IN THE CHASE: Talladega for sure. There are so many things out of your control and you want to control as many things as possible on a week to week basis. Sure, there have been a lot of circumstances that have taken wins out of our hands throughout the regular season. But, I think as you look at the things that can be taken out of your hands and circumstances you expect those things. But there are so many more things that can happen at Talladega with the odds of getting in an accident are way higher. They are usually big accidents and take out multiple cars. Talladega is the one that you dont want to have to deal with. JEFF GORDON, NO. 24 3M CHEVROLET SS  6TH IN STANDINGS Talladega is such a wildcard. Im confident in our race cars and our race team  we have led laps and run well at Daytona and Talladega this year  but theres always the chance of being in a wreck. We are going to be aggressive and race hard and see where the points end up. MARTIN TRUEX, JR., NO. 78 FURNITURE ROW/VISSER PRECISION CHEVROLET SS  8TH IN STANDINGS Outside of Joey Logano nobody feels safe about advancing to the next round. We have a six-point cushion but that's nothing because Talladega is Talladega where anybody can win and anybody can crash. In fact there's a high percentage that you will crash. When you approach Talladega you have to do everything you can to finish the race. This is the wildcard race that everybody has talked about since the start of the Chase. It's a nail-biter. The only consistent winner at Talladega is the entertainment value the race brings to the fans in the stands and to the folks at home watching the drama unfold. RYAN NEWMAN, NO. 31 CATERPILLAR CHEVROLET SS  10TH IN STANDINGS\"You can have three different strategies. You can have a strategy where you know you have a car that can stay up front. You can think you have a car that can stay up front, stay in the middle all day and race and get crashed or cause a crash. Or you can watch everybody from the back and try and learn and go at the end. It all depends. The third strategy is probably the hardest one because you have to figure out when to go because you don't know if there is going to be cautions or if you are going to have a green-flag stop. You can put yourself right out of the race doing that as well. I think you can do it easier in my opinion racing in the middle versus racing in the back and biding your time.\" DALE EARNHARDT, JR., NO. 88 DIET MOUNTAIN DEW CHEVROLET SS  11TH IN STANDINGS At Talladega, you give more mentally than you do physically. In a plate race, you need to make decisions with confidence and make them quickly. If you have any kind of hesitation, someone makes that decision for you and takes away that opportunity. Were taking the same car we won with earlier this year, so its got great speed and we feel confident. It really helps when you have a great car. Weve had a fast car at the last couple of plate tracks - weve won at Talladega and Daytona, so it really helps when your car is that dominant. It makes it a lot easier on the driver to do his job and fend off challenges, and get the car to the front in the first place. JAMIE MCMURRAY, NO. 1 CESSNA CHEVROLET SS  13TH IN STANDINGS Talladega never seems to lack in excitement and I expect this weekend to be no different, especially with this being a critical Chase cutoff race for several guys. I think you will see a lot of differing strategies with some guys racing to the front and other hanging back trying to avoid The Big One. These restrictor plate races are about being in the right place at the right time and getting a lot of luck to go your way. Hopefully some of that will come our way this weekend. Cessna will be running their Pink Car this weekend to honor Breast Cancer Awareness Month, so I hope that garners a lot of attention for such a worthy cause. JIMMIE JOHNSON, NO. 48 LOWES CHEVROLET SS  14TH IN STANDINGS This time at Talladega Im in a way different situation than I have been in years past. We have nothing to lose. So we are going to go down there with a focus on being fast, smart and there at the end. Last year I had to win that race to stay in the chase. We led a ton of laps and came up short. There are four guys in the Chase that have to win  its going to be interesting and a great race for the fans. PAUL MENARD, NO. 27 TARKETT/MENARDS CHEVROLET SS  15TH IN STANDINGS\"Talladega is the biggest, fastest track on the circuit. We run small restrictor plates there so we can't get away from each other, which makes the racing unique. You're stuck in a box riding around with 42 other drivers that, for the most part, you trust but you're willing them to not make a mistake and willing yourself to not make a mistake and take out half the field. It's like being bottled up on the interstate during rush hour, but at 200 mph inches away from each other. It's not very physical racing, but extremely mental. There is a lot of anticipation as to what people are doing around you and trying to put your car in position to stay one step ahead.\" KASEY KAHNE, NO. 5 TIME WARNER CABLE CHEVROLET SS  18TH IN STANDINGS We have good, fast cars for these types of tracks. Results are kind of all over the board, but I would say that is for a lot of people. Sometimes you are in other peoples wrecks there and things like that. I think Talladega is a track I have always liked and look forward to. Sometimes you cant control everything and that is something that will be the same for all of us at Talladega. It will be interesting how it all works out. KYLE LARSON, NO. 42 TARGET PLAID CHEVROLET SS  19TH IN STANDINGS Talladega is one of those races thats really exciting for the fans, but kind of nerve-racking for the teams. Its one of those places where anything can happen at almost any point in the race. I havent had the best finishes at superspeedways, so this is the type of track where Ill look to get some tips from Jamie, who has a pretty good record. This weekend, the team will be looking to keep the Target Chevy in the race until the end and be in a position to have a good finish. AUSTIN DILLON, NO. 3 WEATHERTECH CHEVROLET SS  21ST IN STANDINGS\"Yeah, the last restrictor plate race I was in wasn't the prettiest sight. Hopefully we'll be able to turn that around this weekend and have a good finish at Talladega. It would be awesome to get my first win in the NASCAR Sprint Cup Series at a restrictor plate track. You don't always know what to expect when you go to those kinds of places, but I'll be prepared and ready to go.\" AJ ALLMENDINGER, NO. 47 KROGER/BUSHS BEANS CHEVROLET SS  23RD IN STANDINGS Its just one of those races you have just got to get through. You hope coming down to the end that you are still running. Its all about making the right moves with No. 47 Kroger/BUSHS Beans Chevrolet SS, being extremely lucky and hoping you are not in the Big One. So, its not a lot of fun mentally. Its draining. You are you are riding around for a while, but mentally you are just wore out by the end of the race. DANICA PATRICK, NO. 10 GODADDY CHEVROLET SS  24TH IN STANDINGS Its super easy to drive around the track flat-out by yourself. Its not hard at all. When you put all of the other cars around you, its not necessarily about how the car feels on the track, although that can be an issue, for sure, at times. But, its more about what everyone else is doing around you. Youre constantly looking at whats happening in front of you. Youre also looking at whats behind you. Probably more important than whats happening in front of you is whats happening behind you  whos coming, whos following you, whos helping you move forward. There have been plenty of times that Ive gone to the bottom and complained, Wheres my help? It seems like Ill slot in on the bottom line and then everyone behind me disappears. You really have to have people behind you, pushing you. The race is constantly evolving and you and your spotter have to be on it. Its a big race for spotters, so having a really good one that you trust is very important. TONY STEWART, NO. 14 BASS PRO SHOPS/MOBIL 1 CHEVROLET SS  27TH IN STANDINGS Someone described racing on the superspeedways as being a combination of a science project and the luck of a casino, and its exactly that way. You do everything in your power to take care of the science or technology side. You do everything you can to build the fastest car. If you dont have the luck to go with it  even if you dont have any drama with getting the car touched, nothing happens to the car  if youre just in the wrong spot at the wrong time, it can take you out of the opportunity to take the best racecar in the field and win. JUSTIN ALLGAIER, NO. 51 AUTO OWNERS INSURANCE CHEVROLET SS  30TH IN STANDINGS Talladega [Superspeedway] is really the last big unknown race of the season. Theres a lot on the line with it being a cutoff race in the Chase, so there will definitely be a lot of different agendas. The green-white-checkered attempt rule change that NASCAR just made for this weekend, will make things a little bit different. Hopefully, we will still have a great finish, but not a lot of torn up racecars. We have a great superspeedway car built by Hendrick Motorsports and Auto-Owners Insurance is on the car this weekend. Theyre a great group of people and Im looking forward to making them proud this weekend.\" PaddockTalk Perspective", "external_links": [], "published": "2015-10-21T13:46:00.000+03:00", "crawled": "2015-10-21T15:37:10.037+03:00", "highlightTitle": ""}