{"organizations": ["Dolphins"], "uuid": "d635b21a76222bfbe6908bd2780b7fe87dac6aaf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sun-sentinel.com", "main_image": "http://www.trbimg.com/img-5625538a/turbine/sfl-omar-kelly-grades-the-dolphins-performance-vs-titans-20151019", "site_section": "http://www.sun-sentinel.com/sports/rss2.0.xml", "section_title": "Sports - Sun Sentinel", "url": "http://www.sun-sentinel.com/sports/miami-dolphins/sfl-omar-kelly-grades-the-dolphins-performance-vs-titans-20151019-photogallery.html", "country": "US", "title": "Omar Kelly grades the Dolphins' performance vs. Titans", "performance_score": 0, "site": "sun-sentinel.com", "participants_count": 0, "title_full": "Omar Kelly grades the Dolphins' performance vs. Titans", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T22:53:00.000+03:00", "replies_count": 0, "uuid": "d635b21a76222bfbe6908bd2780b7fe87dac6aaf"}, "author": "", "url": "http://www.sun-sentinel.com/sports/miami-dolphins/sfl-omar-kelly-grades-the-dolphins-performance-vs-titans-20151019-photogallery.html", "ord_in_thread": 0, "title": "Omar Kelly grades the Dolphins' performance vs. Titans", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Omar Kelly", "Jim Rassol"], "text": "Omar Kelly grades the Dolphins' performance vs. Titans Caption PASSING GAME: B Jim Rassol / Sun Sentinel \nQuarterback Ryan Tannehill rebounded from two disastrous performances against the Bills and Jets to have an efficient game (97.8 passer rating) against a good Titans pass defense. Tannehill threw two touchdown passes to his tight ends, and both interceptions he threw weren’t his fault (one was off of a tip, and the other was a miscommunication with Jordan Cameron). Most importantly, Tannehill was aggressive with his throws (9.17 yards per attempt). \nQuarterback Ryan Tannehill rebounded from two disastrous performances against the Bills and Jets to have an efficient game (97.8 passer rating) against a good Titans pass defense. Tannehill threw two touchdown passes to his tight ends, and both interceptions he threw weren’t his fault (one was off of a tip, and the other was a miscommunication with Jordan Cameron). Most importantly, Tannehill was aggressive with his throws (9.17 yards per attempt). (Jim Rassol / Sun Sentinel) Caption RUNNING GAME: A Jim Rassol / Sun Sentinel \nThe Dolphins pounded the Titans on the ground, gaining 124 of the team’s 180 rushing yards in the first half. Jarvis Landry’s 22-yard touchdown run was a work of art, and Lamar Miller (113 rushing yards and a touchdown on 19 carries) proved he’s still a dangerous NFL starter. The Dolphins’ offensive line -- especially new starting right guard Billy Turner -- deserves plenty of credit for opening up respectable holes. \nThe Dolphins pounded the Titans on the ground, gaining 124 of the team’s 180 rushing yards in the first half. Jarvis Landry’s 22-yard touchdown run was a work of art, and Lamar Miller (113 rushing yards and a touchdown on 19 carries) proved he’s still a dangerous NFL starter. The Dolphins’ offensive line -- especially new starting right guard Billy Turner -- deserves plenty of credit for opening up respectable holes. (Jim Rassol / Sun Sentinel) \nOmar Kelly hands out superlative grades for the first time this season after the Dolphins' spirited 38-10 rout of the Tennessee Titans on Sunday. Loading", "external_links": [], "published": "2015-10-19T22:53:00.000+03:00", "crawled": "2015-10-19T23:53:36.000+03:00", "highlightTitle": ""}