{"organizations": [], "uuid": "eac57d1df0e44dc36391905e075dc35051e6a6f2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nj.com", "main_image": "http://imgick.nj.com/home/njo-media/width620/img/eagles_main/photo/19002862-standard.jpg", "site_section": "http://blog.nj.com/realtimesports_impact/rss.xml", "section_title": "New Jersey Real-Time Sports", "url": "http://www.nj.com/eagles/index.ssf/2015/10/giants_odell_beckham_jr_expected_to_play_monday_ni.html", "country": "US", "title": "Giants' Odell Beckham Jr. expected to play Monday night vs. Eagles, per sources", "performance_score": 0, "site": "nj.com", "participants_count": 1, "title_full": "Giants' Odell Beckham Jr. expected to play Monday night vs. Eagles, per sources | NJ.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T19:15:00.000+03:00", "replies_count": 0, "uuid": "eac57d1df0e44dc36391905e075dc35051e6a6f2"}, "author": "Mark Eckel | For NJ Advance Media", "url": "http://www.nj.com/eagles/index.ssf/2015/10/giants_odell_beckham_jr_expected_to_play_monday_ni.html", "ord_in_thread": 0, "title": "Giants' Odell Beckham Jr. expected to play Monday night vs. Eagles, per sources", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "PHILADELPHIA ‐ The Giants expect to have their most explosive playmaker Monday night .\nDespite a hamstring injury that kept Odell Beckham Jr. out of practice most of the week, the star wide receiver is expected to play against the Eagles barring a pregame setback, two individuals with knowledge of the situation told NJ Advance Media. Beckham is officially listed as questionable for the contest.\nMORE : With Odell Beckham Jr. expected to play, how can Eagles stop Giants' top playmaker?\nIt's a huge boost for the Giants, who are already without wide receiver Victor Cruz. Rueben Randle is also dealing with a hamstring injury but is expected to play. He's listed as probable.\nBeckham injured his hamstring in the second half of last Sunday's 30-27 victory over the San Francisco 49ers. He missed most of the fourth quarter, but put himself back in the contest for part of the game-winning drive. He forced a crucial pass interference call to set up the game-winning touchdown by tight end Larry Donnell with 21 seconds remaining.\nRELATED : The full Giants injury report Treatment on his hamstring began immediately after the game. Beckham underwent an MRI last Monday and had some swelling in the area. He remained optimistic throughout the week and worked tirelessly to be ready for the key divisional matchup, which is for first place in the NFC East. \"Treatments, treatments, treatment,\" Beckham said of his plan to get healthy during the week. \"Just make sure you stay on top of it all. Come out and prepare for Monday.\" Giants WR Odell Beckham Jr. at practice Giants wide receiver Odell Beckham Jr. works on the side as he rehabs a hamstring injury. (Video by James Kratch | NJ Advance Media for NJ.com)\nBeckham has a history of hamstring injuries with the Giants. He missed almost all of last summer and the first four games of the regular season because of hamstring tears. He missed some time this spring with a hamstring strain.\nThe Giants need to be careful with last year's Offensive Rookie of the Year. He's a key part of their offense and they can't afford for this to blossom into something bigger, especially given the current state of their decimated roster.\nBeckham, 22, is the Giants leading receiver. He has 31 catches for 428 yards and three touchdowns this season.\n(Giants' beat writer Jordan Raanan contributed to this story)\nMark Eckel may be reached at mjeck04@verizon.net . Follow him on Twitter @MarkEckel08 . Find NJ.com Sports on Facebook .\nTHE NO-HUDDLE SHOW: Mega Eagles-Giants preview We bring in Jordan Raanan from the Giants beat to help break down every angle of the huge showdown between the NFC East rivals. Subscribe to the podcast on iTunes or Stitcher .", "external_links": ["http://www.stitcher.com/s?fid=70915&refid=stpr", "https://www.facebook.com/philadelphiasports", "https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/228542506&color=ff5500&auto_play=false&hide_related=false&show_comments=true&show_user=true&show_reposts=false", "http://www.twitter.com/MarkEckel08", "https://itunes.apple.com/us/podcast/no-huddle-show-philadelphia/id1024590924?mt=2"], "published": "2015-10-19T19:15:00.000+03:00", "crawled": "2015-10-19T20:13:29.819+03:00", "highlightTitle": ""}