{"organizations": [], "uuid": "bdb01d5bdabc0432e9358388dbce28aad0ea1b50", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.fox8live.com", "main_image": "http://kplc.images.worldnow.com/images/9012558_G.jpg", "site_section": "http://www.fox8live.com/", "section_title": "New Orleans News, Weather, Saints - FOX 8 WVUE New Orleans News, Weather, Sports, Social", "url": "http://www.fox8live.com/story/30256618/mcneese-parachuters-get-courage-from-heartbeat-of-fallen-state-trooper", "country": "US", "title": "McNeese parachuters get courage from heartbeat of fallen State T", "performance_score": 0, "site": "fox8live.com", "participants_count": 1, "title_full": "McNeese parachuters get courage from heartbeat of fallen State T - FOX 8 WVUE New Orleans News, Weather, Sports, Social", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T15:00:00.000+03:00", "replies_count": 0, "uuid": "bdb01d5bdabc0432e9358388dbce28aad0ea1b50"}, "author": "John Bridges", "url": "http://www.fox8live.com/story/30256618/mcneese-parachuters-get-courage-from-heartbeat-of-fallen-state-trooper", "ord_in_thread": 0, "title": "McNeese parachuters get courage from heartbeat of fallen State T", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "McNeese Cowboy football fans may have noticed a new crew member with this year's Parapokes Skydiving Team. He's Ethan Vincent, son of the late State Trooper Steven Vincent, who was killed in the line of duty in August.\n\"Ethan is now a part of the Parapokes Skydiving Team,\" said Steve Thompson, a former State Trooper and member of the Parapokes. \"He helps retrieve the flag when we land on the ground. He gets to come out on the field and we really need him to be fast on his feet.\"\nThe Parapokes main job is to deliver the U.S. Flag to Cowboy Stadium.\n\"My job is to catch the flag,\" said Ethan. \"So, whenever the last parachute comes down, I have to go catch the flag.\"\nRecently, a new skydiver went along for the ride and he's special to Ethan.\n\"His name is Bear Bear. His heartbeat... he has my dad's heart beat in it from the last few heart beats he had. So yeah, it's very cool to listen to.\"\nThe Louisiana Organ Procurement Agency says it recorded the heart beats of Trooper Vincent just before he died to allow Ethan to have his father's heart with him forever. Trooper Vincent was an organ donor.\n\"Bear Bear is our courage bear,\" said Thompson. \"When we need help getting out of our plane, he helps us. Bear is a certified skydiver now. He made the last jump with me. It was an honor for us to do that for Ethan. We respect him and his family and all the great things his father did for our community.\"\nDeWayne Bruette, who has made over 4200 jumps, approves of Ethan's job performance.\n\"I feel warm and fuzzy about it, not unlike the bear,\" said Bruette. \"I just think it's the right thing to do. He obviously has warmed up to it. I don't know. I think it's just part of the community.\"\n\"He gives the best high fives of any flag catcher we've ever had,\" said Thompson.\nThe Parapokes say as long as Ethan's interested, he'll always have a job with them in Cowboy stadium.\nCopyright 2015 KPLC-TV . ", "external_links": [], "published": "2015-10-14T15:00:00.000+03:00", "crawled": "2015-10-14T20:28:28.349+03:00", "highlightTitle": ""}