{"organizations": [], "uuid": "57193e3a313e03834be659807c17ce42aa048df1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/", "section_title": "Ahram Online - News, Business, Culture, Sports &amp; Multimedia from Egypt ", "url": "http://english.ahram.org.eg/NewsContent/6/55/161497/Sports/World/FIFA-investigates-Beckenbauer,-Spanish-football-ch.aspx", "country": "EG", "title": "FIFA investigates Beckenbauer, Spanish football chief - World - Sports", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "FIFA investigates Beckenbauer, Spanish football chief - World - Sports - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "57193e3a313e03834be659807c17ce42aa048df1"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/6/55/161497/Sports/World/FIFA-investigates-Beckenbauer,-Spanish-football-ch.aspx", "ord_in_thread": 0, "title": "FIFA investigates Beckenbauer, Spanish football chief - World - Sports", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "FIFA lifted a new corner of its veil of secrecy Wednesday by revealing that German football great Franz Beckenbauer and the current most senior UEFA official Angel Maria Villar Llona have been investigated.\nIt said inquiries for alleged misconduct by the two were now in the hands of the FIFA ethics committee's main court for a decision.\nThe ethics committee did not say why the two had been investigated.\nBut Beckenbauer and Villar Llona were on the FIFA executive committee when Russia and Qatar were awarded the 2018 and 2022 World Cups.\nBeckenbauer was briefly suspended by FIFA last year for refusing to cooperate with a corruption inquiry into World Cup votes by former US federal prosecutor Michael Garcia.\nBeckenbauer, 70, and one of only two people to have won the World Cup as a player and coach, led Germany's successful bid for the 2006 World Cup. This week he denied a report that a 6.7 million euro fund was used to buy votes.\nVillar Llona has been head of the Spanish football federation for 27 years and a FIFA executive member since 1998. He is also currently the most senior official in the European body UEFA after the 90-day suspension of its president Michel Platini.\nThe world body's executive decided on Tuesday to ease restrictions on details that ethics investigators could make public.\nThe committee released a long list of names under investigation, including for the first time confirming that suspended president Sepp Blatter and Platini face formal proceedings.\n\"The investigatory chamber will do everything in its power to ensure that a decision\" on Blatter and Platini can be made before the end of their current 90 day suspensions.\nBoth have been banned over a two million dollar (1.8 million euros) payment made by FIFA to Platini in 2011. The suspension threatens to derail the Frenchman's bid to take over from Blatter when an election is held in February.\nThe committee also confirmed that suspended FIFA secretary general Jerome Valcke is being probed under \"suspicion of misuse of expenses and other infringements of FIFA’s rules and regulations.\"\nAmong other names revealed for the first time are former Brazilian football federation chief Ricardo Teixeira, and tainted Nigerian official Amos Adamu.\nAlso on the list was Thai football baron Worawi Makudi, who was suspended for 90 days last week.\nJeffrey Webb, Eugenio Figueredo and Nicolas Leoz were among seven FIFA officials detained in Zurich in May as part of a US investigation into more than $150 million of bribes for soccer deals.\nUS authorities have named 14 people over the case and said that more charges are likely.\nThe ethics committee said it was also \"carrying out a moderate number of preliminary investigations against a number of football officials.\" These could be named later if there is \"concrete suspicion of wrongdoing.\"\n(For more sports news and updates, follow Ahram Online Sports on Twitter at @AO_Sports and on Facebook at AhramOnlineSports .)", "external_links": ["https://twitter.com/AO_Sports", "https://www.facebook.com/AhramOnlineSports?fref=ts"], "published": "2015-10-21T03:00:00.000+03:00", "crawled": "2015-10-22T04:30:04.039+03:00", "highlightTitle": ""}