{"organizations": [], "uuid": "12f65463e8cac9335587fcf99077e1c4afe907a5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "savannahnow.com", "main_image": "http://savannahnow.com/sites/default/files/14803966.jpg", "site_section": "http://savannahnow.com/", "section_title": "savannahnow.com | Savannah Georgia's source for News, Entertainment, Sports, Weather, Classifieds, Jobs, Autos, Real Estate and St. Patricks Day", "url": "http://savannahnow.com/do/2015-10-14/cedric-entertainer-returns-savannah-comedy-get-down-tour", "country": "US", "title": "Cedric the Entertainer returns to Savannah with the Comedy Get Down tour", "performance_score": 0, "site": "savannahnow.com", "participants_count": 1, "title_full": "Cedric the Entertainer returns to Savannah with the Comedy Get Down tour | savannahnow.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T18:58:00.000+03:00", "replies_count": 0, "uuid": "12f65463e8cac9335587fcf99077e1c4afe907a5"}, "author": "Linda Sickler", "url": "http://savannahnow.com/do/2015-10-14/cedric-entertainer-returns-savannah-comedy-get-down-tour", "ord_in_thread": 0, "title": "Cedric the Entertainer returns to Savannah with the Comedy Get Down tour", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photos Cedric the Entertainer\nBy Linda Sickler Cedric the Entertainer likes performing in Savannah.\n“It’s feels like a down-home audience,” he says. “It’s people who want to get out and have a good time, like doing comedy at a family reunion.”\nThe stand-up comedian, actor, director, producer, voice-over artist and philanthropist returns to Savannah on Oct. 22 at Johnny Mercer Theatre. Opening for Cedric are special guests Jeremiah “J.J.” Williamson and Malik S.\n“I’ll be talking about everything from Donald Trump and the Republicans to the music scene that’s going on,” Cedric says. “I love to talk about my family and kids.\n“J.J. and Malik S. have been opening for me for years,” Cedric says. “They’ll be crowd pleasers.\n“They’re young writers and these guys are always innovating,” he says. “They really push me, which is why I like having young comedians on my shows.”\nFrom the age of 5, Cedric has liked to make people laugh.\n“I started to own it as a craft probably in high school, in the 10th grade,” he says. “My friends would come get me, saying ‘We’re going to get Ced!’”\nAlthough he majored in mass communication in college with the intention of doing television news, Cedric went to work for State Farm Insurance as an adjuster after graduation. He also did some substitute teaching.\n“My mom was an educator, a reading specialist and elementary school teacher,” Cedric says. “Education was a big part of our house.\n“I started working for corporate America, but tried comedy as a dare,” he says. “So many people dared me to go up and I did it.”\nThe very first time Cedric was on stage, he won $500. He still remembers his winning routine.\n“I used to do impressions of preachers,” Cedric says. “I did one bit about a preacher going to McDonald’s and ordering.\n“I was saying the whole ingredients of a Big Mac as a preacher with a congregation,” he says. “I remember I had a coupon for free fries.”\nBorn as Cedric Antonio Kyles, Cedric got his stage name serendipitously.\n“They were doing a show honoring comedians at the time,” he says. “People wanted me to come and be at the show.\n“The emcee was introducing everybody as a comedian. I told him, ‘I sing, I do poems and I don’t have enough jokes,’ and asked him to introduce me as an ‘entertainer.’\n“When it was my turn, he called me ‘Cedric the Entertainer,’” Cedric says. “I had a great show.”\nFor Cedric, his big break was being the host of BET’s “ComicView” for the 1993-94 season. He made his first television appearance on “It’s Showtime at the Apollo.”\n“I had done HBO’s ‘Def Comedy Jam’ and was starting to have national recognition,” he says. “I was doing most of my jokes in St. Louis, but I’d written a lot of new material and wanted be on television.\n“When I went on ‘ComicView,’ whoever won was going to be the new host,” Cedric says. “I was basically on TV every night. It made me a household name, especially among African Americans.”\nCedric was one of the headliners of “The Original Kings of Comedy” with Steve Harvey, D.L. Hughley and Bernie Mac.\n“We had seen people go out and do arena tours,” Cedric says. “We had seen guys go and take comedy to rock-star status.\n“This was an opportunity to do comedy in a Beatles-type manner. Having four different personalities was great.\n“We got to do arenas all across the country and fly around in private jets,” he says. “Steve and I were great friends and Bernie was everybody’s go-to comic. It was an awesome time to do comedy.”\nAt the time, Cedric had a regular role as Cedric Jackie Robinson on “The Steve Harvey Show.”\n“It was my first time doing situational comedy,” Cedric says. “I had all the freedom to be funny.”\nSeveral movie roles followed, including Cedric’s wildly popular turn as Eddie, the cranky, garrulous old barber in “Barbershop.”\n“That character was a combination of a couple of different people,” he says. “I had an old Boy Scout leader I remember as a kid who was a strong-willed man.”\nAn uncle also provided a model for Eddie.\n“I grew up in a single-parent house,” Cedric says. “I remember this man as being very bold.\n“He ran the town without being the mayor,” he says. “He made people think he was the most important person there without owning the shop.”\nAlthough Cedric was selected to play a different part in “Barbershop,” he wanted to play Eddie.\n“I actually went in and asked for that role,” Cedric says. “I discovered the voice and the real tone of the character on the day we were about to shoot.”\nCedric played the role so well, people who met him for the first time afterward told him they thought he was older than he actually was. He’s also played other memorable roles, including Sin LaSalle in “Be Cool.”\n“I loved my character in ‘Be Cool’ with John Travolta,” Cedric says. “This was kind of a mixture of a gangster and a music producer, a really fun role to play.”\nHe’s also added the theater to his resume. Cedric starred in the Broadway revival of David Mamet’s “American Buffalo,” a play about three crooks who are plotting to steal a valuable coin collection.\n“It was a really great experience,” he says. “As a comedian, I love improv, and this was the opportunity to jump off the page and do something perfectly different for the moment.\n“It was the hardest thing for me, but it was a great experience doing David Mamet,” Cedric says. “It was a really serious role, and I’ve grown as an actor.”\nIt also got great reviews.\n“Cedric’s part was singled out as being quite stellar,” says his publicist, Marla Winston, the president and owner of Entertainment Enterprises in Los Angeles.\nAt times, Cedric has done some game shows.\n“‘Who Wants to Be a Millionaire’ was a lot of fun,” he says. “I was getting to know answers to all of the crazy questions.\n“I used to be the smartest guy in the room for about 10 minutes every night,” Cedric says. “But once I said it, it was gone out of my head.”\nAmong the more unusual things Cedric has done are his 2003 appearance with the Korean rap artists Drunken Tiger on their album, “Foundation” and, that same year, his appearance in the PlayStation 2 video game, “Tiger Woods PGA Tour 2004.”\nAs the special guest host of WWE Raw in Little Rock, Ark., in 2009, Cedric participated in a wrestling match, defeating Chavo Guerrero. He also tussled with The Sledge Hammer and Hornswoggle.\nIn addition to performing, Cedric is a philanthropist. Through his Cedric the Entertainer Charitable Foundation, started in St. Louis in 1996 with his sister, Sharita Kyles Wilson, an instructor at the University of Missouri in Columbia, he helps disadvantaged students by providing scholarships.\nA father of three, Cedric is married to Lorna Wells. They have a son, Croix, and a daughter, Lucky Rose, and he also has a daughter, Tiara, from a previous relationship.\nAfter the tour, Cedric is going to do some producing and development.\n“I’m writing a couple of TV show ideas,” he says. “This is going to be the final season of ‘Soul Man,’ and I’m developing a show for after that.\n“It’s going to be a combination of comedic and dramatic nuances. I’m trying to get something different.\n“I’ve also got a reality show coming up,” Cedric says. “That’s me — always something new and different.”\nIn the meantime, Cedric has a message for his fans in Savannah.\n“We’re going to rock,” he says. “Cedric the Entertainer is coming to town!”\nIF YOU GO\nWhat: Cedric the Entertainer’s The Comedy Get Down tour with special guests J.J. and Malik S.\nWhen: 8 p.m. Oct. 22\nWhere: Johnny Mercer Theatre, Savannah Civic Center, 301 W. Oglethorpe Ave.\nCost: $34.50-$56.50\nInfo: 912-651-6550, www.savannahcivic.com/events/ , www.etix.com", "external_links": ["http://sav-cdn.com/sites/default/files/imagecache/superphoto/14803966.jpg", "https://bit.ly/ZyZ8mc)", "http://www.savannahcivic.com/events/", "https://bit.ly/ZyZaur", "https://itunes.apple.com/us/app/dosavannah/id626862925?ls=1&mt=8", "https://play.google.com/store/apps/details?id=hr.apps.n53744379", "http://sav-cdn.com/sites/all/themes/savannahnow/images/blank.gif", "http://i.imgur.com/2Ix6dHF.png", "https://bit.ly/Ke006c", "http://sav-cdn.com/sites/default/files/imagecache/story_slideshow_thumb/14803966.jpg"], "published": "2015-10-14T18:58:00.000+03:00", "crawled": "2015-10-15T08:11:42.494+03:00", "highlightTitle": ""}