{"organizations": [], "uuid": "3e574b6a0466d8cdad39f5c73c72327170cd51d3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bellinghamherald.com", "main_image": "http://www.bellinghamherald.com/news/local/hwj83b/picture40991388/ALTERNATES/LANDSCAPE_1140/Noonchester2", "site_section": "http://www.bellinghamherald.com/?widgetName=rssfeed&widgetContentId=21615405&getXmlFeed=true", "section_title": "Breaking News, Sports, Weather | BellinghamHerald.com &", "url": "http://www.bellinghamherald.com/news/local/article40991391.html", "country": "US", "title": "Bellingham inventor group adding marketing program", "performance_score": 0, "site": "bellinghamherald.com", "participants_count": 1, "title_full": "Bellingham inventor group adding marketing program", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T18:00:00.000+03:00", "replies_count": 0, "uuid": "3e574b6a0466d8cdad39f5c73c72327170cd51d3"}, "author": "Dave Gallagher \nThe Bellingham Herald", "url": "http://www.bellinghamherald.com/news/local/article40991391.html", "ord_in_thread": 0, "title": "Bellingham inventor group adding marketing program", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bellingham inventor group adding marketing program \nSlingshot would promote products to potential customers \nRewards offered for contributors to Indiegogo effort North Whatcom Fire & Rescue Capt. Joe Noonchester shows his Rescue Ride System product, which involves putting a wheel and clamp on the breathing apparatus to make it easier when rescuing people. Noonchester is one inventor who has used the NW Innovation Resource Center to launch new products. NW Innovation Resource Center Courtesy The Bellingham Herald i Order Reprint of this Story BELLINGHAM \nA local group that helps inventors turn ideas into a business now plans to add a marketing program to help spread the word about new products. \nThe NW Innovation Resource Center is starting a crowdfunding campaign to create Slingshot, a program that is expected to help inventors more quickly get products into stores. \nMarketing a product is crucial to the success of the idea, according to the NWIRC. \n“The biggest roadblock for an inventor is getting their product the last step — getting it into the hands of an individual who will benefit from it,” said Diane Kamionka, of the NWIRC. “Slingshot provides an essential option for the inventor who doesn’t have the interest or skill to take this step themselves. Without Slingshot, we would lose the benefit from our local inventors’ creative efforts.” \nThe organization has focused on getting inventors through the early stage of an idea and turning it into a business. The new marketing program would help with that next step of reaching potential customers. \nOne example of the NWIRC helping an inventor is Joe Noonchester and his Rescue Ride System . Noonchester, a professional firefighter with North Whatcom Fire and Rescue, invented a device that quickly clamps wheels onto the air tank of an injured firefighter, allowing other firefighters to roll the person to safety. \nThe fundraising campaign will offer perks for donors, including a private tour of CenturyLink Field in Seattle and a discussion with businesspeople, including Howard Behar, retired president of Starbucks. \nThe campaign through Indiegogo started Thursday, Oct. 22. Further details about the campaign can be found at GiveIdeasLife.org . Details about the organization can be found at nwirc.com . \nReach Dave Gallagher at 360-715-2269 or dave.gallagher@bellinghamherald.com . Follow him on Twitter at @BhamHeraldBiz and on Facebook at BellinghamHeraldBusiness . Related content", "external_links": [], "published": "2015-10-22T18:00:00.000+03:00", "crawled": "2015-10-23T01:18:21.514+03:00", "highlightTitle": ""}