{"organizations": [], "uuid": "55e2f6d7ecafd30b23bdcd2b897ff929bcb405cf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wcti12.com", "main_image": "http://www.wcti12.com/image/view/-/8599596/highRes/2/-/maxh/640/maxw/640/-/15imb43z/-/Football-Generic.jpg", "site_section": "http://www.wcti12.com/14413328?format=rss_2.0&view=feed", "section_title": "Sports", "url": "http://www.wcti12.com/sports/deaths-mar-high-school-football-season/35759592", "country": "US", "title": "Deaths mar high school football season", "performance_score": 0, "site": "wcti12.com", "participants_count": 0, "title_full": "Deaths mar high school football season", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T06:59:00.000+03:00", "replies_count": 0, "uuid": "55e2f6d7ecafd30b23bdcd2b897ff929bcb405cf"}, "author": "", "url": "http://www.wcti12.com/sports/deaths-mar-high-school-football-season/35759592", "ord_in_thread": 0, "title": "Deaths mar high school football season", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ray Sanchez CNN"], "text": "Deaths mar high school football season Gridiron deaths vary from year to year, averaging about 3 By Ray Sanchez CNN POSTED: 9:17 PM Oct 09 2015 UPDATED 8 mins Text Size: Tweet (CNN) - \nRoddrick \"Rod\" Williams was a popular offensive lineman and tuba player at Georgia's Burke County High School. On the football field, the bespectacled 17-year-old was known for his hard play and lighthearted song and dance numbers that made teammates laugh. Related Top tennis stars choke on smog at... \nSaturday, one day after the Burke County High School Bears take the field without their beloved No. 71, the Pride of Burke County symphonic band will play his favorite songs as part of his funeral. His tuba will rest on the 50-yard line in the school stadium. \nWilliams' death Monday night was the fifth of a high school football player since early September. \nThe 5-foot-11-inch, 300-pound junior collapsed September 22 shortly after football practice began, CNN affiliate WSB reported. The school trainer performed CPR until an ambulance arrived, the station reported. \nHis death was heart-related, Burke County Coroner Susan Salemi told CNN, declining to elaborate. \nAbout 3 high football deaths a year \nThe number of young athletes whose deaths are related to high school football fluctuates from year to year. \nIn 2014, five high school players died of causes directly related to football, such as head and spine injuries, according to the annual survey by National Center for Catastrophic Sports Injury Research (NCCSIR) at the University of North Carolina. Another six died of indirect causes: Three were heart-related, one was from heat stroke and two were hypernatremia and water intoxication, according to the survey. \n\"Certainly this is not going to be one of the low years,\" said Robert Cantu, medical director for the NCCSIR and a professor at the Boston University School of Medicine. \nThe past decade has seen an average of three fatalities each year directly attributable to high school football, according to the survey. \nIn 2013, there were eight deaths directly linked to high school football. \nBetween 2005 and 2014, the deaths of 92 other high school football players were indirectly related to the sport, according to the NCCSIR survey. \n\"These events are incredibly tragic,\" said Dawn Comstock, an associate professor at the University of Colorado's Colorado School of Public Health. \"I would love to never see another high school athlete die while they play their game but the positive benefits of playing sports in terms of lifelong health are greater.\" \nThe benefits, however, will be of little solace to the families and friends of Williams and the other four high school football players who have died this season. \nKenney Bui \nKenney Bui, 17, a wide receiver and defensive back for Evergreen High School near Seattle, died Monday after suffering a traumatic brain injury during a game the previous Friday. Video shows Bui taking a hard shot to the head and getting back up, according to CNN affiliate KIRO. He was taken away in an ambulance after taking another shot to the head later in the game. \nBui died from blunt force injuries to the head, according to the King County medical examiner's office. \nHis father, Ngon, a janitor in the Seattle public school system, told KIRO he learned of his son's death via text message. \n\"I love my son,\" he said, close to tears. \"I don't want nothing to happen to ... kids. And a parent to have to worry.\" \nBui's father asked his son to quit the game after a previous injury, but the teen's mother and Bui overruled him, the station reported. \nBui suffered a mild concussion in early September and the school referred him to a doctor, Highline School District spokeswoman Catherine Carbone Rogers told CNN on Friday. He was cleared to play after a few days and returned to the field two weeks later, she said. \nEvan Murray \nEvan Murray, a senior at Warren Hills Regional High School in northwest New Jersey, died September 25 after leaving the game with an injury, according to the school. \nA GoFundMe page to assist Murray's family said the quarterback and captain -- a popular student who also played baseball and basketball -- \"felt woozy\" after getting hit in the backfield. \n\"He was always there for all of his teammates. Played hard, all the time. He's going to be sorely missed by everybody,\" baseball coach Michael Quinto told CNN affiliate News 12 New Jersey. « previous", "external_links": [], "published": "2015-10-10T06:59:00.000+03:00", "crawled": "2015-10-10T07:08:17.588+03:00", "highlightTitle": ""}