{"organizations": [], "uuid": "e320bf8a20984b625563a3aadcebddff4d49be0a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.fox8live.com", "main_image": "http://APMOBILE.images.worldnow.com/images/9058721_G.jpg", "site_section": "http://www.fox8live.com/", "section_title": "New Orleans News, Weather, Saints - FOX 8 WVUE New Orleans News, Weather, Sports, Social", "url": "http://www.fox8live.com/story/30306437/white-house-threatens-to-veto-sanctuary-cities-bill", "country": "US", "title": "White House threatens to veto 'sanctuary cities' bill", "performance_score": 0, "site": "fox8live.com", "participants_count": 1, "title_full": "White House threatens to veto 'sanctuary cities' bill - FOX 8 WVUE New Orleans News, Weather, Sports, Social", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T19:34:00.000+03:00", "replies_count": 0, "uuid": "e320bf8a20984b625563a3aadcebddff4d49be0a"}, "author": "cbs8", "url": "http://www.fox8live.com/story/30306437/white-house-threatens-to-veto-sanctuary-cities-bill", "ord_in_thread": 0, "title": "White House threatens to veto 'sanctuary cities' bill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By MARY CLARE JALONICK\nAssociated Press WASHINGTON (AP) - The White House is threatening to veto Senate legislation cracking down on \"sanctuary cities\" that shield residents from federal immigration authorities.\nThe Senate is holding a procedural vote on the legislation Tuesday. The bill by Louisiana Sen. David Vitter would punish jurisdictions that prohibit the collection of immigration information or don't cooperate with federal requests, blocking them from receiving certain grants and funds.\nRepublicans have pushed the bill since the July 1 shooting of Kathryn Steinle in San Francisco. The man charged in the killing was in the country illegally despite a long criminal record and multiple prior deportations. The man, Juan Francisco Lopez Sanchez, had been released by San Francisco authorities despite a request from federal immigration authorities to keep him detained.\n\"Rather than reward cities, we must start enforcing our current immigration laws and strengthen our borders to keep Americans here safe at home,\" Vitter said.\nAngry Democrats accused Republicans of aligning themselves with Donald Trump and his anti-immigrant views.\nSenate Democratic Leader Harry Reid said the bill would threaten cities' ability to police and compared it to Republican presidential candidate Trump's comments earlier this year that some immigrants in the country illegally are \"criminals\" and \"rapists.\"\n\"This vile legislation might as well be called 'The Donald Trump Act,'\" Reid said.\nSan Francisco and hundreds of other jurisdictions nationally have adopted policies of disregarding federal immigration requests, or \"detainers,\" which advocates say can unfairly target innocent immigrants and hurt relations between immigrant communities and law enforcement authorities.\nThe House passed legislation similar to Vitter's bill this summer, which the White House also threatened to veto. In its veto threat of the Senate legislation, the White House said the bill could lead to mistrust between the federal government and local governments.\nThe Obama administration has said that the best way to get at the problem is comprehensive immigration overhaul, something House Republicans have blocked for years.\nFind Mary Clare Jalonick on Twitter at http://twitter.com/MCJalonick\nCopyright 2015 The Associated Press. This material may not be published, broadcast, rewritten or redistributed.", "external_links": ["http://twitter.com/MCJalonick"], "published": "2015-10-20T19:34:00.000+03:00", "crawled": "2015-10-20T23:02:34.886+03:00", "highlightTitle": ""}