{"organizations": ["Dallas Cowboys", "New England Patriots", "NFL", "Cowboys", "Pats"], "uuid": "2543fe9df25ffb6bd435c6ad9a82d570cf2036b8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ksat.com", "main_image": "http://media.ksat.com/photo/2015/10/22/cassel2_1445517693918_176501_ver1.0_1280_720.jpg", "site_section": "http://www.ksat.com/content/pns/ksat.topstories.sports.rss", "section_title": "Sports | KSAT", "url": "http://www.ksat.com/sports/nfl/cowboys/cowboys-cassel-replacing-franchise-qb-again-7-years-later_", "country": "US", "title": "Cassel replacing franchise QB again, 7 years later", "performance_score": 0, "site": "ksat.com", "participants_count": 0, "title_full": "Cassel replacing franchise QB again, 7 years later", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T15:44:00.000+03:00", "replies_count": 0, "uuid": "2543fe9df25ffb6bd435c6ad9a82d570cf2036b8"}, "author": "", "url": "http://www.ksat.com/sports/nfl/cowboys/cowboys-cassel-replacing-franchise-qb-again-7-years-later_", "ord_in_thread": 0, "title": "Cassel replacing franchise QB again, 7 years later", "locations": ["Texas", "Arlington"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Matt Cassel", "SCHUYLER DIXON", "Cassel", "Tony Romo", "Tom Brady"], "text": "Cassel replacing franchise QB again, 7 years later Previously started in place of Tom Brady, now for Tony Romo By SCHUYLER DIXON, AP Sports Writer Posted: 7:44 AM, October 22, 2015 Updated: 7:44 AM, October 22, 2015 Dallas Cowboys' Matt Cassel (16) throws before an NFL football game against the New England Patriots, Sunday, Oct. 11, 2015, in Arlington, Texas. (AP Photo/Brandon Wade) More Cowboys Headlines Brady, Pats leave Cowboys with QB question after 30-6 win \nIRVING, Texas - The previous time Matt Cassel filled in for a franchise quarterback, he was a first-time starter who unexpectedly won 10 games for New England after Tom Brady's season-ending knee injury in the 2008 opener. \nSeven years later, he's filling in for Tony Romo, needing a fraction of that victory total to keep defending NFC East champion Dallas (2-3) in contention for the division title until Romo is ready to return from a broken left collarbone. \nCassel is likely to get at least four games, beginning Sunday against the New York Giants (3-3). \nBut the 33-year-old isn't the same player who hadn't even started in college when he replaced Brady and the Patriots and went 11-5, shared the AFC East title with Miami and missed the playoffs on a tiebreaker. \n\"I think it was the start of helping me be equipped for a situation like this,\" said Cassel, acquired in a trade with Buffalo two days after Romo's injury in Week 2 at Philadelphia. \"This is my 11th year. I've been through all different types of situations at this point in my career.\" \nFor instance, he started 47 games over four seasons with Kansas City after the Chiefs traded for him following the surprising 2008 season. But he lost the starting job each of his last two seasons there, and was gone for good after throwing six touchdowns with 12 interceptions in 2012. \nCassel was essentially a spot starter for two years in Minnesota before signing with Buffalo this past offseason and losing a three-way battle for quarterback with Tyrod Taylor, who won the job, and EJ Manuel. \nThe job as Romo's replacement solidly belonged to Brandon Weeden when the Cowboys traded for Cassel. But coach Jason Garrett didn't take long to make a switch after three straight losses punctuated by Dallas' first game without a touchdown in four years — a 30-6 loss to the Patriots. \nCassel's last start was for the Vikings in Week 3 last season — not counting the opener this year when he took the first snap for the Bills with Taylor lined up at receiver. \n\"I think there's a lot to like about him,\" Garrett said. \"He's physically capable of doing anything we ask him to do. You can tell he's been in a lot of different offenses. He understands offensive football. He understands defensive football.\" \nCassel's wife had their fourth child Saturday, clearing the way for him to be available against the Giants after he all but guaranteed — while smiling, of course — that he would make sure the baby's delivery didn't interfere with his Dallas debut. \nAfter two weeks of learning the offense enough to serve as Weeden's backup against New England, Cassel has two weeks to prepare for the Giants since the change came during the bye. \nAlthough Cassel said right after the trade that he was there to support Weeden, he also said he's always had the mentality that he wanted to start. \n\"I think you have to,\" he said Wednesday. \"I think that's why I had longevity in this league is that if you perceive yourself as somebody who's just in a backup role and happy to be there, then I don't think you ever strive to get better. You always have to push yourself.\" \nWhile Cassel has 33 wins to five for Weeden and nearly three times as many starts, he shares two things with the deposed Dallas starter: a losing record and a penchant for interceptions. \nAnd Cassel has been erratic at times. He started last season with two touchdowns and a 113.8 rating in Minnesota's season-opening win over St. Louis, then had four interceptions and a 39.1 rating in a Week 2 loss to the Patriots. He has 96 touchdowns with 70 interceptions in 91 games, with 71 starts not counting this year's Buffalo opener. \nThe Cowboys are counting on the lessons he learned through experience. \n\"When you have success, how do you handle it?\" Garrett said. \"When you have adversity, how do you handle it? How do you fight through situations in a game? I think he's demonstrated that really throughout his career, playing different spots, in different roles.\" \nNOTES: WR Dez Bryant did not participate in practice Wednesday. Unlike the final practice of the bye week last Thursday, he was not seen doing conditioning work on the side in the portion of practice that was open to reporters. Copyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-10-22T15:44:00.000+03:00", "crawled": "2015-10-22T16:48:13.589+03:00", "highlightTitle": ""}