{"organizations": [], "uuid": "42ec651c86d4176cf57b78152652efa5124bea7b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.greenvilleonline.com", "main_image": "http://www.gannett-cdn.com/-mm-/68d71c4b3150cd063ba1de8e66afd42e1661043b/c=0-178-1920-1263&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/15/CarolinaGroup/Greenville/635805302410278467-river1.jpg", "site_section": "http://rssfeeds.greenvilleonline.com/greenville/sports", "section_title": "Greenville - Sports", "url": "http://www.greenvilleonline.com/story/sports/high-school/2015/10/16/live-mauldin-takes-riverside/73975276/", "country": "US", "title": "Mauldin takes on Riverside", "performance_score": 0, "site": "greenvilleonline.com", "participants_count": 0, "title_full": "Mauldin takes on Riverside", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T15:42:00.000+03:00", "replies_count": 0, "uuid": "42ec651c86d4176cf57b78152652efa5124bea7b"}, "author": "", "url": "http://www.greenvilleonline.com/story/sports/high-school/2015/10/16/live-mauldin-takes-riverside/73975276/", "ord_in_thread": 0, "title": "Mauldin takes on Riverside", "locations": ["Riverside Riverside"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mauldin"], "text": "Riverside hosts Mauldin in a Thursday night game at The Reservation. (Photo: DAVID GROOMS) 1 CONNECT 2 TWEET LINKEDIN COMMENT EMAIL MORE \nGREER – Junior quarterback Dre Harris threw four touchdown passes and ran for another, and Mauldin cruised to a 49-14 victory over Riverside in a Region 2-AAAA game at The Reservation on Thursday night. Harris played through the first possession of the third quarter and led the Mavericks to touchdowns on seven of eight possessions. He completed touchdown passes of 28, 34 and 46 yards to Hunter Dawsey and 22 yards to Matt Atkins and also ran 5 yards for a touchdown. Mauldin, which led 42-7 at halftime, improved to 5-3 overall and 3-1 in the region. \"We play hard, and we've improved every week,\" Mauldin coach Lee Taylor said. \"We've run the ball pretty good. Our offensive line has improved. Our defense has improved tremendously from the spring, to the summer, to where we are right now. \"We've got three tough games coming up (Byrnes at home, at Spartanburg, at Boiling Springs), a tough stretch right here at the end of the season, and we wanted our kids to improve up to this point, and we want to keep on improving next week. Byrnes is a very good team. We're going to prepare just like we prepare for everybody next week and see what happens.\" Riverside (0-8, 0-4) scored on the first play of the second quarter on a 71-yard pass from Aaron Odom to Braxton Collins. Mauldin responded to the Warriors' score with a 15-play, 65-yard drive. The Warriors had the Mavericks in a fourth-and-three situation, and Mauldin set up in punt formation, but the Mavs faked the punt, and the up-back, Grant Weston, gained 5 yards. Harris eventually capped the drive with a 5-yard touchdown run that made it 28-7. The next time the Mavs had the ball, they ran a double handoff and a pitch back to Harris, who threw his third touchdown pass of the night to Dawsey. The senior wide receiver out-jumped a defender just outside of the end zone and then dove in for the score. The play covered 46 yards. Mauldin's Winston Howard picks off a pass, leading to Harris' 22-yard touchdown pass to Atkins, and Mauldin led 42-7 at halftime. The Mavs scored on their first possession of the second half on a 2-yard run by Averius Blakely. Logan DiBenedetto directed a late Riverside scoring drive. He connected with Hunter Faulk for 32 yards, taking the ball to the Mauldin 3-yard line, and Robert Wang ran it in on the next play. Read or Share this story: http://grnol.co/1RMh0mY TOP VIDEOS", "external_links": [], "published": "2015-10-16T15:42:00.000+03:00", "crawled": "2015-10-16T17:11:58.502+03:00", "highlightTitle": ""}