{"organizations": ["Neenah", "Appleton North Lightning", "Facebook Appleton North", "Appleton North"], "uuid": "1e60d25f6e24c3ce8c06942a5104d33294f3338f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.postcrescent.com", "main_image": "http://www.gannett-cdn.com/-mm-/1edf064cf7e6fc421f19ea8d3ffb30a9b0498af0/c=0-442-3250-2270&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/10/14/Appleton/B9319248438Z.1_20151014000800_000_GVSC82MNI.1-0.jpg", "site_section": "http://rssfeeds.postcrescent.com/appleton/sports", "section_title": "Appleton - Sports", "url": "http://www.postcrescent.com/story/sports/high-school/soccer/2015/10/14/appleton-north-inches-closer-fva-title/73910548/", "country": "US", "title": "Appleton North inches closer to FVA title", "performance_score": 0, "site": "postcrescent.com", "participants_count": 0, "title_full": "Appleton North inches closer to FVA title", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T07:08:00.000+03:00", "replies_count": 0, "uuid": "1e60d25f6e24c3ce8c06942a5104d33294f3338f"}, "author": "", "url": "http://www.postcrescent.com/story/sports/high-school/soccer/2015/10/14/appleton-north-inches-closer-fva-title/73910548/", "ord_in_thread": 0, "title": "Appleton North inches closer to FVA title", "locations": ["Neenah"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jacob Teunas", "Brendan Daines", "Ricardo Arguello", "Flater"], "text": "Appleton North inches closer to FVA title Appleton North Lightning inches closer to FVA soccer title. Post to Facebook Appleton North inches closer to FVA title Appleton North Lightning inches closer to FVA soccer title. Check out this story on postcrescent.com: http://post.cr/1RGBihI Cancel Send A link has been sent to your friend's email address. Posted! A link has been posted to your Facebook feed. Join the Conversation Ricardo Arguello, Post-Crescent Media 11:08 p.m. CDT October 13, 2015 Appleton North’s Camden Flater (20) celebrates scoring a goal against Neenah with teammates Jacob Teunas (18) and Brendan Daines on Tuesday in Neenah. (Photo: Dan Powers/Post-Crescent Media) \nAPPLETON — Noah Ganzen was just 4 years old the last time the Appleton North boys’ soccer team won the Fox Valley Association title. \nBut after the Lightning’s 5-2 victory over rival Neenah on Tuesday, the senior defender knows his team is in position to secure the league crown for the first time since 2001 with a win over Appleton East on Thursday. \n“It’s going to be really great,” Ganzen said. “(The 2001 title) is on the banner in the gym, so the soccer one is looking a little bare right now, so it’ll be nice to get a couple more numbers up there.” \nAppleton North upped its record to 13-2-1 overall and 7-0-1 in the FVA. The loss dropped Neenah’s record to 5-1-2 in the conference and 9-4-2 overall. \nKimberly (10-2-3, 6-0-2), which tied Appleton North 0-0 on Sept. 29, can still clinch the title if North loses to Appleton East and the Papermakers win against Fond du Lac in the regular-season finale. A victory by both teams would give Appleton North the title outright. \n“We got a lot of seniors this year, so we definitely want to make a run this year,” Ganzen said. “We’re definitely in position to do that and we have to stay focused next Thursday.” \nGanzen scored Appleton North’s first goal in the 12th minute and North held a 1-0 advantage at the half. \nThe Lightning poured it on in the second half, with Camden Flater and Osman Bajraktarevic scoring two goals apiece. \n“It took a lot,” Bajraktarevic said of his team being in position to win the conference title. “We just trained hard this season. We just gave it our all tonight and we got the results that we expected.” \nNeenah got goals from Marco Ruiz and Hunter Mitchell in the second half, but coach Harry Kelderman thought the night belonged to Appleton North. \n“We had certain areas that worked on the field and most of the areas that didn’t,” he said. “And I thought Appleton North was by far the superior team tonight. By far. They were very good tonight. They finished everything well. They play well together. They communicated well together and we didn’t do those things.” \nAppleton North coach Cody Schnese said the win was important for his team. \n“This was our first time beating Neenah in a while, so they’re pretty excited about that,” Schnese said. “But we have such a smart and talented group of guys that they handle it on the field. They know what they have to do and they take care of business. \n“We had good games over the weekend and we beat the No. 2 team (Hudson) in the state. Coming in, we knew it was going to be a tough game and knew we would have to fight for it and earn every bit of the success that we got and I think we did.” \nNeenah …", "external_links": [], "published": "2015-10-14T07:08:00.000+03:00", "crawled": "2015-10-14T16:12:16.407+03:00", "highlightTitle": ""}