{"organizations": [], "uuid": "4010c217a88a30be7169c60adf304d6585d59073", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theglobeandmail.com", "main_image": "http://static.theglobeandmail.ca/b33/sports/hockey/article26733668.ece/ALTERNATES/w620/hk-prospect08sp1A.JPG", "site_section": "http://www.theglobeandmail.com/sports/", "section_title": "Sports - The Globe and Mail", "url": "http://www.theglobeandmail.com/sports/hockey/connor-mcdavid-keeps-cool-heading-into-national-hockey-league-debut/article26733669", "country": "CA", "title": "Connor McDavid keeps cool ahead of National Hockey League debut", "performance_score": 0, "site": "theglobeandmail.com", "participants_count": 6, "title_full": "Connor McDavid keeps cool ahead of National Hockey League debut - The Globe and Mail", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T06:14:00.000+03:00", "replies_count": 15, "uuid": "4010c217a88a30be7169c60adf304d6585d59073"}, "author": "MARTY KLINKENBERG", "url": "http://www.theglobeandmail.com/sports/hockey/connor-mcdavid-keeps-cool-heading-into-national-hockey-league-debut/article26733669", "ord_in_thread": 0, "title": "Connor McDavid keeps cool ahead of National Hockey League debut", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A A The morning skate complete, Lauri Korpikoski headed down a tunnel beneath the stands at the Scottrade Center. Spying a pack of newshounds outside the Edmonton Oilers dressing room, the Finnish winger stopped and flashed a smile.\n“I know you guys are waiting for me,” Korpikoski said. “It happens like this everywhere I go.”\nCP Video Oct. 08 2015, 5:53 PM EDT Video: Connor McDavid calls NHL debut a 'dream' A team of little consequence in recent seasons, the Oilers are in the spotlight this year for one reason only: an 18-year-old whiz kid named Connor McDavid, who made his professional debut against the St. Louis Blues on Thursday night.\nA few months removed from high school, McDavid seemed unruffled in his preparation in the hours before his first regular-season NHL game. Sitting on the bench before skating, he chatted casually with teammates. Taking to the rink, he circled slowly, juggling a puck on the blade of his stick. After practising faceoffs with Ryan Nugent-Hopkins, he took part in a few light drills, accepting a sweet pass across the goalmouth from Taylor Hall and burying it in the net.\nAppreciating the effort and nifty skill, fellow players banged their sticks against the ice.\n“There is a bit of a wow factor when you watch him,” said Matt Hendricks, a 34-year-old Edmonton forward.\nA prodigy likened to Sidney Crosby and Wayne Gretzky, McDavid has been a brilliant playmaker. He sparked the Oilers by recording a team-leading five assists in preseason contests. After arriving in St. Louis with his teammates after a 3 1/2-hour flight, he slept like a log Wednesday night.\n“When I woke up this morning, it hit me that I was playing in my first NHL game,” McDavid said. “Certainly, I am a little nervous. You only get to do this once. But I am excited, too. I am living out my dream. There is nothing better than that.”\nRaised in the Toronto suburbs, McDavid received special permission to enter the OHL as a 15-year-old and became the circuit’s most dominant player. After three remarkable seasons with the Erie Otters, the Oilers selected him with the first overall pick in this summer’s NHL draft.\nHis first official game was played before a full house, on a warm night a few blocks from the Mississippi River. The catfish weren’t jumping, but the crowd was.\nBefore the game, thousands of Blues fans gathered in the shadows of the arena for a pep rally, with a smattering of spectators dressed in Oilers gear.\nWearing a Connor McDavid shirt, Kyle Levicki of Edmonton stood in a line inside waiting to get through a security checkpoint. A paving superintendent, Levicki was part of a group of seven friends who travelled from Alberta for the game, with plans to go to Nashville as well.\n“I came because of McDavid, but I am excited because we got [general manager] Peter Chiarelli and made coaching changes as well,” Levicki said.\nOn the April night the Oilers won the NHL draft lottery he was in a small hotel room in Banff with 15 of his gentleman’s league hockey teammates.\n“It was about 10 days after the Oilers had finished third-worst in the league, but all but two of us were jumping around and screaming,” Levicki, 31, said. “The other two guys are Leafs fans.”\nMcDavid centred a line with Hall and Anton Slepyshev, a 21-year-old Russian who played in the KHL last year, on the wings.\n“We are about as prepared as we can be, and have high hopes for this team,” Hall said at his dressing stall after the skate. “This is going to be a really good test for us.\n“The Blues are tough, and this is a difficult place to play. I’m not really sure it could be any tougher than this. We are going to see what we are made of.”\nHall was not concerned McDavid would wilt under the pressure of his first game.\n“We’ve all seen what he can do,” he said.\nAfter the morning skate, Todd McLellan, the Oilers’ new head coach, said he was not sure what to expect.\n“This is new for me and it’s new for all of us,” said McLellan, who admitted that he had sought out Sidney Crosby to talk about his own rookie season with the Pittsburgh Penguins a decade ago. “I’ve never had a player whose arrival has been anticipated like this and things have changed even since then.”\nMcLellan said McDavid has worked hard to fit in with his teammates, and doesn’t see himself as any different than them. He is different though, a teenager with remarkable skills and the great expectations that go along with them.\n“There is pressure that he puts on himself, and there is pressure that he feels from his teammates, coaching staff and fans,” McLellan said. “Where it is really different here and everything changes is from the national, international and world eyes that are on him.”\nMcLellan, who came to the Oilers after seven winning seasons in San Jose, was curious about how McDavid would fare on opening night, and curious about his team as a whole. The Oilers went 6-1-1 in the preseason, but start with games in St. Louis, Nashville and Dallas, cities where they have not played especially well in recent years.\n“We know we are going to get tested,” he said. “It will be a good measuring stick. But right now, when you compare us to my teams in San Jose, we are in diapers. We are in the infancy stages.\n“Right now what we are going to do is try to establish our game and get our feet wet. Sometimes playing in a simple game is all you need.”\nAgainst St. Louis, McDavid logged 18 minutes 7 seconds of ice time in a game in which momentum shifted back and forth. He struggled to win faceoffs, but generally played well. At times, he looked dangerous – once missing a breakaway because of an offside. Defensively, he stripped an opponent once, poked the puck away from the man he was covering another time.\nHe had two chances denied to start the third, the second a great save by Brian Elliott after McDavid spun around and tried to tuck the puck backhanded into the net.\nThe Blues took a 2-1 lead midway through the third period on a goal by Robby Fabri. The Oilers had taken a goal in the first on a goal by Ryan Nugent-Hopkins; Vladimir Tarasenko responded for the Blues to tie the game 1-1 in the second.\nThe final score was 3-1 for St. Louis. Robby Fabri, who scored the winning goal, is a childhood friend of McDavid’s, also playing in his first NHL game.\nMcDavid looked sullen as he silently packed his bag after the game.\n“It’s a tough place to play but I generally think he played well,” Hall said. “I think you saw a lot of push back from him and that’s good to see.”\nFrom here, McDavid will work to keep things simple, and focused on hockey, as these days he has dreamed of begin to unfold. A week from now, there is another beginning, when the Oilers play their first home game at Rexall Place, also against the Blues. However big Wednesday was, that evening could well eclipse it. The old sports cliché rings true: One game at a time. Small strides toward big dreams.\nFollow us on Twitter: @GlobeHockey\n What other NHLers say about McDavid\nThe Prospect Hall of Fame awaits pieces of hockey history with Connor McDavid’s debut\nTHE PROSPECT McDavid’s debut is just the beginning of the prodigy’s dream coming true\nPatrick Kane, Connor McDavid lead storylines ahead of 2015-16 season\nConnor McDavid has long-suffering Oilers poised for a revival\nTopics: Edmonton Oilers National Hockey League Connor McDavid St. Louis Blues Comments Print /\nLicense A A", "external_links": ["http://admin.brightcove.com/js/BrightcoveExperiences.js", "http://license.icopyright.net/g2/3.8425?icx_id=26733669", "https://accounts.brightcove.com/en/terms-and-conditions/.", "https://twitter.com/@GlobeHockey", "http://license.icopyright.net/3.8425?icx_id=26733669"], "published": "2015-10-09T06:14:00.000+03:00", "crawled": "2015-10-15T02:02:20.973+03:00", "highlightTitle": ""}