{"organizations": [], "uuid": "513b1e20f109035822d6f1abc1bfcfec300a8cc3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mcall.com", "main_image": "http://www.trbimg.com/img-56131f44/turbine/mc-phillies-looking-ahead-2016-20151005", "site_section": "http://www.mcall.com/sports/rss2.0.xml", "section_title": "Sports - The Morning Call", "url": "http://www.mcall.com/sports/baseball/phillies/mc-phillies-looking-ahead-2016-20151005-column.html", "country": "US", "title": "Phillies know where their focus lies in offseason and should be better in 2016", "performance_score": 0, "site": "mcall.com", "participants_count": 1, "title_full": "Phillies know where their focus lies in offseason and should be better in 2016", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T04:06:00.000+03:00", "replies_count": 0, "uuid": "513b1e20f109035822d6f1abc1bfcfec300a8cc3"}, "author": "Stephen Gross", "url": "http://www.mcall.com/sports/baseball/phillies/mc-phillies-looking-ahead-2016-20151005-column.html", "ord_in_thread": 0, "title": "Phillies know where their focus lies in offseason and should be better in 2016", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Phillies know where their focus lies in offseason and should be better in 2016 Washington Nationals v Philadelphia Phillies GETTY IMAGES FILE PHOTO With manager Pete Mackanin in place and young talent starting to arrive, the Phillies' future could be bright. With manager Pete Mackanin in place and young talent starting to arrive, the Phillies' future could be bright. (GETTY IMAGES FILE PHOTO) Stephen Gross Contact Reporter What will make the Phillies better in 2016? \nHeading into the final week of the season, Phillies manager Pete Mackanin was still focused on closing out 2015 strong, but he was also starting to look ahead. \nFor a playoff-bound team, that might not have been a great idea, but the Phillies had been eliminated for some time and almost everything they're doing is with the future in mind. \nAs he sat in his office at Citizens Bank Park before the start of the season's final homestand, a week after the Phillies announced he would be the manager for 2016 with an option for 2017, Mackanin admitted he was ready for February. \n\"I'm anxious for spring training already,\" Mackanin said. \"I've got a ton of notes on what we're going to do in the spring, how we're going to attack everything.\" \nCan you blame him? \nAfter three interim stints, the 64-year-old is getting his first crack at a full-time managing job in the majors, and for a team that was improving under his watch — it went 29-62 before the All-Star Break versus 34-37 after. \nAvoiding 100 losses was a big positive, but it wasn't the only one. The run Double-A Reading made in the playoffs shows there is talent on its way to the majors, Rule 5 pick Odubel Herrera was a hidden treasure and flirted with .300 most of the season, Aaron Altherr proved he's a serious candidate for an outfield spot going forward while providing pop at the plate and another rookie, Maikel Franco, showed when he's healthy, he can provide some of the offense this team desperately needs. \nA full season for Franco — he wasn't called up until May 15 and missed about a month and a half with a fractured wrist — will give him even more opportunities to contribute. And his defense is just as good as his bat. \nThere's also Aaron Nola and Jerad Eickhoff, who were a major part of the reason the starting rotation did a complete 180 the final weeks of the season. Most of the season the starters put added stress on the bullpen, not being able to go deep into outings. Those two were part of a group that compiled a 2.69 ERA over the season's final 15 games. While that was a plus, there are still many holes in the starting rotation. \nSo what's Mackanin going to focus on to continue moving in the right direction? Fundamentals. \n\"If we're not the best hitting team in the league and we're not the best pitching team in the league, we can be the best at fundamentals,\" said Mackanin, who took over on June 26 after Ryne Sandberg resigned. \"So we're going to strive for real solid defense and solid baserunning. … We're going to work hard at being the best in those areas. Of course hitting is important, but I don't want to lose games because of poor defense, or poor baserunning or mental mistakes.\" \nSound familiar? \nIt should, because we've heard that before. And it didn't exactly work out too well for the last manager. \n\"I'm planning on attacking maybe three or four areas — instead of going from A to Z on the basics of fundamentals of playing the outfield or playing the infield, I want to go … maybe A to D,\" Mackanin said. \"Little by little, increments, eliminating one area of concern and then next going to the next area of concern little by little. I find if you do that, you can conquer those deficiencies a lot better than trying to do the whole thing and make a guy an all-around great player.\" \nThe team is younger. Gone are many veterans who might be set in their ways like Jimmy Rollins, Chase Utley and Cole Hamels. Ryan Howard and Carlos Ruiz are the two veterans left that have made careers here although, as Mackanin said, \"a lot of things can happen in the offseason.\" \n\"When you're winning, a lot of things can be overlooked,\" Mackanin said. \"Now you're forced to, with lesser talent than the heyday of the Phillies, [get back to basics]. Those things add up and are under a microscope and a they show up more because you don't have six guys hitting 30 home runs.\" \nIn theory, it sounds great. Now Mackanin has to do what Sandberg couldn't and make sure his players execute. \nThere will be even more young talent in big league camp at spring training than you saw this season in Philadelphia. A number of players will just be there for experience, giving fans a preview of what's to come, but it's possible some could stick with an impressive February and March. \nThe Phillies aren't ruling out making a big jump and skipping Triple-A with some of their prospects. Players like Zach Efflin, Jake Thompson and Nick Williams might be in Philadelphia sooner than you think. \n\"Possibly. … I think it's important for us, if we feel that we recognize a guy's major league ready, even if it's out of A-ball or Double-A, I think it behooves us to make that decision,\" Mackanin said. \nBefore the team gets to spring training, the focus will be on offseason moves. Obviously, the team will hire a general manager in the coming weeks and possibly before that, decide which players whose contracts are up, such as Jeff Francoeur, they'd like to bring back. \nThere aren't many capable bodies to fill the starting rotation and the Phillies know it. That's why they'll be looking at both starters, and relievers, when free agency begins. \n\"Pitching is first and foremost,\" interim general manager Scott Proefrock said. \"I think the other thing is we have some position player prospects in the organization, [but] you never have enough pitching. Both starting and in the bullpen. We'll be looking to add some depth in both of those areas, especially some veteran depth.\" \nProefrock wouldn't go into detail on if the Phillies will go after an ace to slot at the top of the rotation so someone like Nola doesn't have to throw against the opponent's No. 1 every fifth day in his first full season, but he did say the organization has set \"general parameters\" on a budget. \n\"I think we'll be active in pursuing pitching,\" Proefrock said. \"It has to be the right fit for us, though.\" \nThere are still many question marks for 2016, and the Phillies will need a miracle to make the playoffs next season, but 2015 was rock bottom and it looks as though they are moving in the right direction.", "external_links": [], "published": "2015-10-06T04:06:00.000+03:00", "crawled": "2015-10-06T04:58:58.981+03:00", "highlightTitle": ""}