{"organizations": [], "uuid": "5845fd795030c41bbab7e6770eb4eabbf48e984b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266381/sports-general", "section_title": "Sports: General - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30353373/match-fit-academy-football-club-names-atlantic-health-system-official-sports-medicine-provider", "country": "US", "title": "Match Fit Academy Football Club Names Atlantic Health System Official Sports Medicine Provider", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Match Fit Academy Football Club Names Atlantic Health System Official Sports Medicine Provider - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T22:11:00.000+02:00", "replies_count": 0, "uuid": "5845fd795030c41bbab7e6770eb4eabbf48e984b"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30353373/match-fit-academy-football-club-names-atlantic-health-system-official-sports-medicine-provider", "ord_in_thread": 0, "title": "Match Fit Academy Football Club Names Atlantic Health System Official Sports Medicine Provider", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Match Fit Academy Football Club today announced it has named Atlantic Health System as its official sports medicine provider\nMorristown, NJ (PRWEB) October 26, 2015\nMatch Fit Academy Football Club, founded in 2000 to foster the development of soccer in the United States through the young players of New Jersey, today announced it has named Atlantic Health System as its official sports medicine provider. Under this agreement, Atlantic Health System, one of the largest non-profit health care organizations in New Jersey, will manage the Club’s orthopedic and sports medicine needs, as well as provide other medical services when necessary.\n“We are pleased to have been named as Match Fit Academy Football Club’s official sports medicine provider,” said Dr. Damion Martins, Director of Sports Medicine and Orthopedics for Atlantic Health System. “With the expertise of pediatric and adolescent sports medicine specialists, our sports medicine team brings a new level of care to the Atlantic Health System community. We look forward to working closely with these elite up-and-coming young athletes as they advance the sport of soccer in the United States.”\n\"The health and well-being of our players is our utmost priority, and Match Fit Academy is pleased to partner with Atlantic Health System,” said Dominick Bucci, Girls Director of Coaching and Player Development, Match Fit Academy Football Club. “We believe we provide one of the best training and playing environments in the country at Match Fit Academy. With this significant partnership, we can ensure our players have the best education, guidance, and care to maintain their fitness, diet, and health throughout the year.\"\nAtlantic Health System owns and operates a hospital system, including four acute care hospitals and related health care facilities staffed by physicians and other medical professionals that provide emergency room, inpatient, outpatient, physical therapy and other medical services, including sports medicine services.\nFor more information, visit Sports Health at Atlantic Health System .\nABOUT ATLANTIC SPORTS HEALTH\nAtlantic Sports Health is New Jersey’s leader in the diagnosis and treatment of sports injuries, and offers a wide range of world-class care using a comprehensive approach to injury prevention and treatment. Beginners, amateurs, and advanced or professional athletes receive the same attention to detail and expert care from our talented team of clinicians, nurses and physician assistants. Services include sports performance physicals, which are all-inclusive exams, utilizing electrocardiograph (EKG) testing, lab work, imaging and evaluation of muscular balances to develop a complete health and training history. Atlantic Sports Health has highly-trained and experienced physicians, who are experts at diagnosing and treating orthopedic and sports medicine problems. Atlantic Sports Health serves as the flagship Clinical Sports Performance site for Cybex and the Cybex Research Institute, is the official health care partner of the New York Jets, and an official health provider of the New Jersey Devils.\nFor more information, visit Sports Health at Atlantic Health System.\nABOUT ATLANTIC HEALTH SYSTEM\nAtlantic Health System ( http://www.atlantichealth.org ), headquartered in Morristown, New Jersey, is one of the largest non-profit health care systems in New Jersey. As a trusted network of caring, our promise to our communities is that anyone who enters Atlantic Health System will receive the right care and the right quality at the right place, at the right time and the right cost. Atlantic Health System includes Morristown Medical Center in Morristown, NJ; Overlook Medical Center in Summit, NJ; Newton Medical Center in Newton, NJ; Chilton Medical Center in Pompton Plains, NJ; and Goryeb Children’s Hospital in Morristown, NJ, as well as Atlantic Rehabilitation, and Atlantic Home Care and Hospice. It also includes its subsidiary, Atlantic Ambulance Corporation. Atlantic Health System comprises 1,599 licensed beds, more than 14,000 employees and more than 4,000 physicians. Atlantic Health System has a medical school affiliation with the Sidney Kimmel Medical College at Thomas Jefferson University; a Major Clinical Affiliate of Rutgers Cancer Institute of New Jersey; part of Atlantic Accountable Care Organization, one of the largest ACOs in the nation, and is a member of AllSpire Health Partners.\n###\n //www.prweb.com/releases/2015/10/prweb13043460.htm\n ", "external_links": ["http://www.prweb.com/releases/2015/10/prweb13043460.htm", "http://www.atlantichealth.org/morristown/our+services/sports+health/?utm_source=media&utm_medium=press%20release&utm_campaign=Match%20Fit"], "published": "2015-10-26T22:11:00.000+02:00", "crawled": "2015-10-26T21:31:01.089+02:00", "highlightTitle": ""}