{"organizations": [], "uuid": "1fd00f265a851a45c79af85a348e02c81e96b6f1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.contracostatimes.com", "main_image": "http://local.contracostatimes.com/common/dfm/assets/logos/1200x627/contracostatimes.png", "site_section": "http://feeds.contracostatimes.com/mngi/rss/CustomRssServlet/571/225005.xml", "section_title": "Sports", "url": "http://www.contracostatimes.com/high-school-sports/ci_28915816/high-school-football-bellarmine-college-prep-outlasts-serra?source=rss", "country": "IL", "title": "High school football: Bellarmine College Prep outlasts Serra to win WCAL opener", "performance_score": 0, "site": "contracostatimes.com", "participants_count": 1, "title_full": "High school football: Bellarmine College Prep outlasts Serra to win WCAL opener", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T08:49:00.000+03:00", "replies_count": 0, "uuid": "1fd00f265a851a45c79af85a348e02c81e96b6f1"}, "author": "Darren Sabedra\n\ndsabedra@mercurynews.com", "url": "http://www.contracostatimes.com/high-school-sports/ci_28915816/high-school-football-bellarmine-college-prep-outlasts-serra?source=rss", "ord_in_thread": 0, "title": "High school football: Bellarmine College Prep outlasts Serra to win WCAL opener", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted: 10/02/2015 10:33:03 PM PDT Updated: 10/02/2015 10:38:49 PM PDT SAN JOSE -- Bellarmine College Prep took Serra's best punch Friday night, an electrifying run down the sideline by Kelepi Lataimua that gave the Padres the lead just seconds into the third quarter. \nAnd the Bells responded like a budding champion. \nThey scored the next three touchdowns, capitalizing on every Serra mistake, and went on to win the West Catholic Athletic League opener 36-28 at San Jose City College. \n\"We really came out and played hard all night,\" Bellarmine coach Mike Janda said. \"That's what it was going to take against a great team.\" \nBellarmine quarterback Troy Martig was sensational again, answering Lataimua's 52-yard touchdown run with a 51-yard dash that reclaimed the lead for Bellarmine -- and the Bells did not relinquish it. \nMartig later scored on a 13-yard run and seemingly finished off Serra with a 52-yard strike to Kyle Macauley to push the lead to 36-20 midway through the fourth quarter. \nSerra made it interesting, scoring on its second two-play drive of the half, this one capped by Nikolao Vaefago's 18-yard reception from Sitaleki Nunn with 3:05 left. Nunn's run on the two-point play made it 36-28. \nAn onside kick followed, and Bellarmine recovered. The Bells, the Mercury News' top-ranked team, then ran out the clock to keep their unbeaten record intact. \nBellarmine (4-0, 1-0 WCAL) got four turnovers from its defense, steady play from its four running backs and game-changing plays from its quarterback, who had accounted for nine touchdowns entering the game. Advertisement \n\"It was just a great team effort by us,\" said Martig, who had 150 yards on the ground and 132 through the air. \"Fortunately our defense got more turnovers than we had. It worked out well for us.\" \nAfter a scoreless first quarter, Lataimua's 2-yard run gave Serra a 7-0 lead. \nBellarmine answered with a big kickoff return from Macauley and two clutch passes from Martig. Antonio Garcia finished off the drive with a 1-yard run to tie the score 7-7. \nSerra (2-2, 0-1) fumbled on its next series, and Bellarmine got a 42-yard field goal from Jack Geiger to take a 10-7 lead. \nBellarmine had a great chance to extend its lead late in the first half when Martig scrambled 40 yards through the middle of the field to the Serra 2, a play reminiscent of his big run last season against Valley Christian. \nBut on the next play, Bellarmine brought back flashbacks of Russell Wilson and the Seahawks at the end of last season's Super Bowl against Serra alum Tom Brady. \nWith 22 seconds left in the half, Martig threw a quick slant pass to the right side. Jovon Johnson broke early on the ball and easily intercepted it, keeping Serra within three points of the lead at the break. \n\"To end that first half with a turnover brought us down a little bit,\" Martig said. \"But we don't let that get in our heads. Coming out in the second half, we knew they were going to come out fast. We know it's going to be a fight all game with them.\" \nIt took two plays for Serra to reach the end zone to start the second half. \nBut Bellarmine responded. \n\"We had all the momentum,\" Serra coach Patrick Walsh said, \"and they stole it back. They being particularly No. 7.\" \nAsked what makes Martig so tough to contain, Walsh said, \"They get behind those pullers. They pull many guys. He finds creases and he hits his spots.\" For more on high school sports, see the Varsity Extra blog at blogs.mercurynews.com/highschools . Follow Darren Sabedra on Twitter at twitter.com/DarrenSabedra .", "external_links": [], "published": "2015-10-03T08:49:00.000+03:00", "crawled": "2015-10-03T09:01:00.899+03:00", "highlightTitle": ""}