{"organizations": ["Oakland Athletics", "Seattle Mariners", "Detroit Tigers", "Boston Red Sox", "New York Yankees", "AP", "Mariners", "Kansas City Royals"], "uuid": "dd98c37c5929c6609277bc23baa22193a9f19696", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.whio.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/10/09/c6/ba/19df72698e9e477a991dfb432f060877-966e2305b36749c28fc2b1a67632922c-0.jpg", "site_section": "http://www.whio.com/feeds/categories/sports/", "section_title": "News | Sports", "url": "http://www.whio.com/ap/ap/sports/mariners-fire-lloyd-mcclendon-after-2-seasons/nnymk/", "country": "US", "title": "Mariners fire Lloyd McClendon after 2 seasons", "performance_score": 0, "site": "whio.com", "participants_count": 0, "title_full": "Mariners fire Lloyd McClendon after 2 seasons", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T22:31:00.000+03:00", "replies_count": 0, "uuid": "dd98c37c5929c6609277bc23baa22193a9f19696"}, "author": "", "url": "http://www.whio.com/ap/ap/sports/mariners-fire-lloyd-mcclendon-after-2-seasons/nnymk/", "ord_in_thread": 0, "title": "Mariners fire Lloyd McClendon after 2 seasons", "locations": ["Burleson", "Detroit", "SEATTLE", "Seattle"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["S. Warren", "Will Little", "Lloyd McClendon"], "text": "Updated: 3:31 p.m. Friday, Oct. 9, 2015 | Posted: 3:31 p.m. Friday, Oct. 9, 2015 Mariners fire Lloyd McClendon after 2 seasons Related View Larger FILE - In this May 15, 2015, file photo, Seattle Mariners' Lloyd McClendon leans on the dugout rail before a baseball game against the Boston Red Sox in Seattle. The Mariners have fired manager Lloyd McClendon after two seasons, Friday, Oct. 9, 2015, less than a week after the Mariners concluded a disappointing 76-86 season. (AP Photo/Ted S. Warren, File) View Larger FILE - In this June 24, 2015, file photo, Seattle Mariners manager Lloyd McClendon rubs his eyes after a run by the Kansas City Royals during the fourth inning of a baseball game in Seattle. The Mariners have fired manager Lloyd McClendon after two seasons, Friday, Oct. 9, 2015, less than a week after the Mariners concluded a disappointing 76-86 season. (AP Photo/Elaine Thompson, File) View Larger FILE - In this June 2, 2015, file photo, Seattle Mariners manager Lloyd McClendon, left, yells as he talks with umpire Will Little after being ejected from the baseball game against the New York Yankees during the third inning, in Seattle. The Mariners have fired manager Lloyd McClendon after two seasons, Friday, Oct. 9, 2015, less than a week after the Mariners concluded a disappointing 76-86 season.(AP Photo/Elaine Thompson, File) View Larger FILE - In this July 23, 2015, file photo, Seattle Mariners manager Lloyd McClendon watches from the dugout during a baseball game against the Detroit Tigers in Detroit. The Mariners have fired manager Lloyd McClendon after two seasons, Friday, Oct. 9, 2015, less than a week after the Mariners concluded a disappointing 76-86 season.(AP Photo/Duane Burleson, File) View Larger FILE - In this Oct. 3, 2015, file photo, Seattle Mariners manager Lloyd McClendon points towards first base while questioning an umpire's call in the first inning of a baseball game against the Oakland Athletics in Seattle. The Mariners have fired manager Lloyd McClendon after two seasons, Friday, Oct. 9, 2015, less than a week after the Mariners concluded a disappointing 76-86 season.(AP Photo/Ted S. Warren, File) Sponsored Links The Associated Press SEATTLE — \nGiven the opportunity that he didn't get in his previous stop as a general manager, Jerry Dipoto decided the best move for the Seattle Mariners was to bring in his own field boss from the start. \nThat was reasoning behind Dipoto's decision to fire manager Lloyd McClendon on Friday after two seasons. Instead of moving forward with someone who had differing baseball views, Dipoto will start his tenure in Seattle with someone he chooses. \n\"Everything we do is as a group,\" Dipoto said. \"This isn't an indictment of Lloyd. This is a representation of what we would like to build going forward. That is what we'll do.\" \nMcClendon's firing was far from a surprise and came less than a week after the Mariners concluded a disappointing 76-86 season. Seattle started the year with expectations of contending in the AL West and reaching the postseason, but instead finished in fourth place in the division. \nDipoto was hired during the final week of the regular season to replace Jack Zduriencik and said he would take his time evaluating whether McClendon would return. McClendon was under contract for the 2016 season. \nDipoto said he has great respect for McClendon but realized in meetings this week and last that their baseball philosophies would not be the best match going forward. \n\"This was an opportunity to come into an organization and create a vision and I feel like this is the best way to do that,\" Dipoto said. \nDipoto came to Seattle after leaving behind a rocky relationship with the Angels and manager Mike Scioscia over the summer. Scioscia was already entrenched when Dipoto was hired in Los Angeles. \nRather than try to force a relationship in Seattle, Dipoto will now be able to bring in someone he wants to work with, although he said the situation with the Angels didn't play heavily into his decision with McClendon. \n\"I thought through all the different angles, the way the clubhouse would be affected, the way the organization would be affected,\" Dipoto said. \"I incorporated a number of people in making the decision and I'm comfortable with it.\" \nDipoto said he wants a manager who is energetic, a good teacher and has experience in a major league clubhouse but previous coaching or managing experience isn't necessary. And he has a list in mind. \n\"Leadership will be an important element to me and energy will be an important element to me. Players need to be energized, to be inspired to do something,\" Dipoto said. \nThe Mariners said hitting coach Edgar Martinez and infield coach Chris Woodward have been invited to remain with the Mariners staff and Dipoto was hopeful both would accept. Pitching coach Rick Waits and coach Chris Prieto have been invited to remain with the organization in different roles. All other coaches on the major league staff will not return. \nMartinez joined the club as hitting coach in June. \n\"Listening to him break down hitting and how clearly invested he was in making the players better, really excited,\" Dipoto said. \"I'm very excited about the opportunity to bring him back and I think he is. This is where he wants to be.\" \nSeattle was McClendon's second chance as a manager and he raised hopes of a turnaround after the Mariners went 87-75 in his first season and missed the playoffs by one game. But Seattle could not sustain the success from the first season and, combined with Zduriencik's firing, McClendon's status was in doubt once Dipoto took charge. \nMcClendon was 163-161 in his two seasons with the Mariners and was the only black manager in baseball. Dipoto's decision means Seattle will have its 10th manager — full-time and interim — since the club's last playoff appearance in 2001. \nMcClendon was well-liked by his players in Seattle, specifically Robinson Cano. But the success of the first season — when Seattle had a lackluster offense but outstanding pitching — couldn't carry into the second year. Seattle's bullpen regressed significantly, the offense slogged through the first half of the season led by the struggles of Cano, and the Mariners could never recover from a 2-9 homestand in late May and early June. \n\"I look in the mirror every night and I know I gave it everything I had every day,\" McClendon said on the final day of the regular season. \"And, I said this earlier, my players gave me everything they had every day. Some nights it was good enough, some nights it wasn't very good. But, the effort was always there.\" Copyright The Associated Press Sign up for our WHIO-TV Daily Headlines Newsletter Sign Up", "external_links": [], "published": "2015-10-09T22:31:00.000+03:00", "crawled": "2015-10-09T22:51:59.715+03:00", "highlightTitle": ""}