{"organizations": ["Charlotte Motor Speedway"], "uuid": "19b12e2d510a1f70e0c973cf08a098eb65ba6dfe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.journal-news.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/10/09/26/4b/0bc3d2ebad1d463c91b14b9e647aca39-c4a6aa4dca87450a8f0c49e5eb5f09ef-0.jpg", "site_section": "http://www.journal-news.com/feeds/categories/sports/", "section_title": "News | Sports", "url": "http://www.journal-news.com/ap/ap/north-carolina/title-contenders-eyeing-win-at-charlotte-to-ease-p/nny3B/", "country": "US", "title": "Title contenders eyeing win at Charlotte to ease pressure", "performance_score": 0, "site": "journal-news.com", "participants_count": 0, "title_full": "Title contenders eyeing win at Charlotte to ease pressure", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T01:49:00.000+03:00", "replies_count": 0, "uuid": "19b12e2d510a1f70e0c973cf08a098eb65ba6dfe"}, "author": "", "url": "http://www.journal-news.com/ap/ap/north-carolina/title-contenders-eyeing-win-at-charlotte-to-ease-p/nny3B/", "ord_in_thread": 0, "title": "Title contenders eyeing win at Charlotte to ease pressure", "locations": ["Concord", "N.C.", "Charlotte"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["McCarn", "JENNA FRYER", "Brad Keselowski"], "text": "Updated: 6:49 p.m. Friday, Oct. 9, 2015 | Posted: 6:49 p.m. Friday, Oct. 9, 2015 Title contenders eyeing win at Charlotte to ease pressure Related Brad Keselowski, center, talks to crew members during practice for Saturday's NASCAR Sprint Cup Series auto race at Charlotte Motor Speedway in Concord, N.C., Friday, Oct. 9, 2015. (AP Photo/Mike McCarn) By JENNA FRYER The Associated Press CONCORD, N.C. — \nExpect the intensity to pick up a tick in the opening race of the second round of NASCAR's playoffs. The event at Charlotte Motor Speedway ended last year with mild-mannered Matt Kenseth jumping Brad Keselowski, who had already drawn the ire of Denny Hamlin. \nWhy will drivers be more amped than usual Saturday night? Because a win will earn a championship contender an automatic berth into the third round and relieve the pressure for ominous races at Kansas and Talladega. \n\"I think if you can win in a first round situation, you can definitely put yourself in a position to get those guys on the team that mental break that they're going to need just because of the detail and things that it takes on a weekly basis when you have to run all three weeks at that level,\" reigning Sprint Cup champion Kevin Harvick said. \nHarvick had a grueling first round of the Chase for the Sprint Cup championship, which began when he crashed after contact with Jimmie Johnson in the first race. It dropped him to last in the Chase field and pushed him into a must-win situation to keep his title defense alive. \nBut an almost-certain victory the next week at New Hampshire slipped away when he ran out of gas in the closing laps, and it was make-or-break Sunday at Dover. He got the win he needed to advance into the second round, but it was a draining stretch for Harvick and his Stewart-Haas Racing team. \n\"When you get in those types of situations, when you see everybody overachieve in every department of the car, because they're just so focused on all the little things, and when you start taking those crumbs and you start adding them up ... you can't race like this all year because it's just so draining and so hard on everybody,\" Harvick said. \nHe won at Charlotte last October to coast into the third round of the Chase. It's a critical victory to get because Kansas has proven over the years to ruin many title hopes, and Talladega is the crapshoot of the Chase. \nKyle Busch for years struggled at Kansas to cripple his championship chances, and tire issues last season dumped Keselowski and Dale Earnhardt Jr. to the back of the standings. Keselowski pulled out the must-win at Talladega to advance into the third round, but Earnhardt was eliminated. \nSo was Busch, even though he sailed through Kansas with a career-best third-place finish. He was wrecked the next week at Talladega to end his Chase. \n\"We were a little worried about Kansas and we made it through there free and clear,\" Busch said. \"It's not all that fun when you go into an elimination race, you don't have a win, but yet anything can happen and anything that can happen is 99.9 percent of the time out of your control. You hate that pressure being put on you like that.\" \nAfter Harvick won at Charlotte last year, SHR teammate Kurt Busch congratulated crew chief Rodney Childers on giving his team two weeks of breathing room. Busch had been eliminated one week earlier, and he recognized that Harvick and his team could focus on the third round and not worry about having to dodge the unknowns at Kansas and Talladega. \n\"I basically went into Rodney Childers' office and I said, 'This is yours to lose now. You have a hall pass through Talladega, you don't even have to sweat it,'\" Busch said. \"And then they start working on their Martinsville setup, their Texas setup, they start working on other things, and you're more relaxed. You don't even have the anxiety level at that top level that you will if you go to Talladega needing a good finish.\" \nJeff Gordon, who scored his first career victory at Charlotte in 1994, goes into his final race at the track still seeking his first win of the season. He's not focused on victories, but rather advancing to the final round of the Chase as he tries to win a fifth championship in his last season before retirement. Gordon will take whatever road is necessary to get to the finale at Homestead, but the emotion of potentially grabbing one last win at Charlotte isn't lost on the four-time champion. \n\"That could possibly be one of the biggest moments I've ever had at Charlotte if we do that,\" he said. \"We know that if you get a victory here this weekend, the relief that you're going to feel and to not have to go to Talladega and not have to worry about Kansas, is huge. It's absolutely huge. \n\"I've been saying all year long that if we can make it to round three, I think our chances of making it to Homestead are actually very, very good.\" Copyright The Associated Press", "external_links": [], "published": "2015-10-10T01:49:00.000+03:00", "crawled": "2015-10-10T02:25:00.915+03:00", "highlightTitle": ""}