{"organizations": [], "uuid": "3e8c1515ed8882da12e8d0ade79b16c5f1f15ef9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports/motorsports", "section_title": "NASCAR / Motors News, Race Results, Schedule, Standings, Photos, Videos - MSN Sports", "url": "http://www.msn.com/en-us/sports/motorsports/nascar-announces-rules-package-for-2016-season/ar-AAfsyEh", "country": "US", "title": "NASCAR announces rules package for 2016 season", "performance_score": 0, "site": "msn.com", "participants_count": 1, "title_full": "NASCAR announces rules package for 2016 season", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "3e8c1515ed8882da12e8d0ade79b16c5f1f15ef9"}, "author": "Jeff Gluck, USA TODAY Sports", "url": "http://www.msn.com/en-us/sports/motorsports/nascar-announces-rules-package-for-2016-season/ar-AAfsyEh", "ord_in_thread": 0, "title": "NASCAR announces rules package for 2016 season", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NASCAR announces rules package for 2016 season USA Today Sports 1 day ago by Jeff Gluck, USA TODAY Sports © Chris Trotman, Getty Images Chris Trotman, Getty Images NASCAR will use a lower downforce aerodynamic rules package on its cars for the 2016 season, the sanctioning body announced Wednesday.\nAdChoices The reduced downforce package is similar to the one used this summer at Kentucky Speedway and Darlington Raceway, where it earned positive reviews for the quality of racing. Lower downforce means the cars have less grip in the corners, making it more difficult for drivers to stay in the gas.\nIn turn, that opens the opportunity for more side-by-side racing and passing.\n“NASCAR has worked tirelessly with our teams, drivers, manufacturers and Goodyear to develop a rules package that provides fans with the best racing possible,” said Steve O’Donnell, NASCAR executive vice president and chief racing development officer. “The success of the races at Kentucky and Darlington in similar trim proved extremely valuable in accelerating rules development for 2016. Now, as teams have even more time to prepare and a strong baseline of data, we anticipate the racing to be even better.”\nNASCAR had originally wanted to test the 2016 rules package at the All-Star Race in May, with the goal of finalizing the package shortly thereafter so teams could get a head start on next season.\nBut in the spring, NASCAR seemed to suddenly back off from changing the rules at all. The racing was competitive and the races were being won by different drivers, so there perhaps would be no tweaks from the 2015 package. If so, that would have the added benefit of saving money for race teams who wouldn’t have to invest extra in research and development.\nOnce word of NASCAR’s thinking began to filter, however, the drivers pushed back. They campaigned for a lower downforce package while NASCAR thought a high drag concept would be the way to go.\nAs it turned out, the drivers were correct: Kentucky and Darlington were great races while the high-drag races (Indianapolis Motor Speedway and Michigan International Raceway) were duds.\nFollow Gluck on Twitter @jeff_gluck\nGo to MSN Home", "external_links": ["http://twitter.com/jeff_gluck", "http://www.usatoday.com/story/sports/nascar/2015/07/12/new-rules-package-kentucky-nascar/30041165/", "http://www.usatoday.com/sports/", "http://go.microsoft.com/fwlink/?LinkID=286759"], "published": "2015-10-15T03:00:00.000+03:00", "crawled": "2015-10-16T04:01:15.536+03:00", "highlightTitle": ""}