{"organizations": [], "uuid": "87e6da2038121efeb4998ad7fbf2b60558a78f9b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dallasnews.com", "main_image": "http://www.dallasnews.com/incoming/20151009-dyson.jpg.ece/BINARY/original/Dyson.jpg", "site_section": "http://www.dallasnews.com/sports/columnists/kevin-sherrington/", "section_title": "Kevin Sherrington Sports Columns - Sports News for Dallas, Texas ", "url": "http://www.dallasnews.com/sports/columnists/kevin-sherrington/20151008-sherrington-banister-gives-tradition-the-thumb-goes-with-no-role-bullpen-in-victory-over-blue-jays.ece", "country": "US", "title": "Banister gives tradition the thumb, goes with no-role bullpen in victory over Blue Jays", "performance_score": 0, "site": "dallasnews.com", "participants_count": 7, "title_full": "Sherrington: Banister gives tradition the thumb, goes with no-role bullpen in victory over Blue Jays | Dallas Morning News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T05:20:00.000+03:00", "replies_count": 11, "uuid": "87e6da2038121efeb4998ad7fbf2b60558a78f9b"}, "author": "Sherrington", "url": "http://www.dallasnews.com/sports/columnists/kevin-sherrington/20151008-sherrington-banister-gives-tradition-the-thumb-goes-with-no-role-bullpen-in-victory-over-blue-jays.ece", "ord_in_thread": 0, "title": "Banister gives tradition the thumb, goes with no-role bullpen in victory over Blue Jays", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "TORONTO -- Baseball players are creatures of habit, sometimes notoriously so. Wade Boggs ate chicken every pre-game meal. Larry Walker did everything in threes. Cal Ripken Jr. played every day for more than a decade, until it got to be monotonous.\nAnd yet here Jeff Banister is, in the first game of his first postseason his first year as a big-league manager, and he gives tradition the thumb.\nThe Rangers now have what could be loosely termed a \"situational bullpen.\" Also a 5-3 win Thursday over the Blue Jays in the best-of-5 AL Division Series.\nHey, whatever works, right?\nShawn Tolleson, the closer since mid-May, didn't get into the biggest game of the season at all before 49,834 at the Rogers Centre. Jake Diekman worked two innings.\nAnd Sam Dyson got his first save in two months.\nWhat happened to time-honored roles?\n\"It's not about ninth, eighth, seventh inning,\" Banister said. \"It's about those guys coming in when we feel it's the best opportunity for those guys to get the run of outs that we need.\"\nWhat this means is that, from here on out, apparently, the Rangers will call the bullpen according to matchups instead of observing the structure that basically got them this far.\nOnce Yovani Gallardo worked his typical five innings, limiting the Blue Jays to just two runs, the baton passed to Keone Kela. Back when the Rangers had established roles, Kela was more of a seventh-inning guy. Came in before the seventh just six times in 68 appearances. But Banister wanted him for Jose Bautista, Edwin Encarnacion and Troy Tulowitzki, which seemed like a reasonable proposition until Bautista hit a pitch off the back of the dome.\nAnd then on Kela's very next pitch, Encarnacion whacked a ball a few feet wide left of the left field foul pole.\nHaving given up, oh, 800 feet of fly balls on the previous two offerings, Kela then managed to get Encarnacion to ground to third and struck out Justin Smoak.\nBecause Kela got three outs from only four hitters, Diekman, a left-hander, was available to face a pair of lefties in Ryan Goins and Ben Revere. Never mind that they batted in two different innings. Diekman pitched both the seventh and eighth because he was uncommonly efficient. Needed only 16 high-octane pitches for six outs, fewest he'd thrown in an outing of more than one inning this year. All but two of them strikes, too.\nThen came the ninth, once the province of Tolleson in a save situation; now the role for the man of the moment.\nThe deciding factors Thursday? Tolleson blew only two saves in 37 chances this year, but the last came against Toronto on Aug. 25. You might also recall his five-game marathon last week, which ended with him giving up three runs over one inning in his final two appearances as the fate of the West title wound down to the last day.\nSo Dyson, the most dynamic reliever in the Rangers' bullpen this season, got the call Thursday. After a leadoff single by Encarnacion, Dyson struck out Tulowitzki, then coaxed a couple of ground balls from Smoak and Russell Martin to end it.\nGetting ground balls is what Dyson does. Martin Perez, too. That's why Perez is down to start Game 3 instead of Derek Holland or Colby Lewis. When facing a lineup that launches as many rockets as the Blue Jays do, it makes sense that you'd like to minimize the odds that anyone gets a ball up in the air.\nOf course, there's a little psychological matter of shaking people out of their comfort zones, a proposition that frightens most managers, including the Rangers' previous one. Ron Washington stuck with veterans to the bitter end. Banister said he called in Kela, Diekman, Dyson and Tolleson after Wednesday's workout and told them about the new world order. Though he said Thursday that Tolleson would still be in the mix at the end of games, Banister made no promises about returning the bullpen to form anytime soon.\nNo offense taken, the former closer said.\n\"You have no choice but to be OK with it,\" Tolleson said. \"I'm in no position to have a sense of entitlement about anything. I want to win. If that means that we do it with Dyson closing, that's fine.\n\"I just want to be out there and able to help.\"\nFunny thing is, I suppose we should have seen this shuffle coming. The first question for Banister at Wednesday's news conference was about how he might manage his bullpen differently in the postseason. Banister smiled, which is not always the case with reporters, and said, \"That's a good question, right out of the gate.\"\nBetter question: How does the bullpen react to its new no-role approach?\n\"Just pitch when your name is called, and try to throw up zeroes,\" Diekman said. \"If you look at it that way, it makes it a lot easier.\n\"And it helps if you win Game 1.\"\nNothing like a winning track record to get everyone to buy in.\nRANGERS RETURN TO THE POSTSEASON The Rangers are back in the postseason as the AL West Champs.\nThe Texas Rangers will play the No. 2 seed -- the Toronto Blue Jays -- in the playoffs.\nFULL PLAYOFF SCHEDULE HERE\nRangers' ALDS schedule set: Day games in Toronto, busy night in Arlington\nLatest news Grant: Playoff experience just a number for Rangers who carried team in win over Blue Jays\nSherrington: Banister gives tradition the thumb, goes with no-role bullpen in victory over Blue Jays\nFraley: New team, same result for David Price in another postseason loss to Rangers\nThree thoughts on Game 1 of the ALDS: Expectations ramped up after Rangers win\nRangers win with unexpected sources, 5-3, in ALDS Game 1\nNational reaction: Adrian Beltre 'one of toughest' athletes in all of sports; Pete Rose calls out Jose Bautista, Josh Donaldson\nMartin Perez's ability to get the ground ball means lefty gets Game 3 nod\nGallardo vexes Blue Jays once again; Banister: Rangers 'really needed' that from him\nDoes Banister go with Chirinos' offense or Gimenez's relationship with Hamels in Game 2?\nBlue Jays notebook: Jose Bautista says Josh Donaldson's collision was 'a little scary'\nFive storylines that could determine Rangers vs. Blue Jays, including how to attack David Price\n10 things every Texas fan needs to know about Rangers-Blue Jays, including how $20,000 could come back to bite Toronto\nThe SportsDay staff's official ALDS predictions, who still rides with the Rangers?\nNational prediction roundup: Does anybody want to pick the Rangers to win the World Series?\nGame 1 could loom large over Yovani Gallardo's free agency prospects, but he's staying focused\nFun\nTexas vs. Toronto: We have Chuck Norris, you have crybaby Drake\nFive excuses to get out of work/school to watch the Rangers, plus a doctor's note\nWhich Texas Ranger are you? Take our fun quiz!\nBanned in Arlington: The Texas Rangers championship T-shirt you can't get at the stadium\nRangers' Derek Holland does great Arnold Schwarzenegger impression on SportsCenter\nThe backstory behind the Rangers' new 'Never Ever Quit' T-shirt\nGet to know the players Townsend: The 'double comeback' that started the Shawn Tolleson homecoming with the Rangers he wouldn't trade for anything\n10 things to know about Rangers 3B Adrian Beltre: For your own good, stay away from his head\n10 things you might not know about the Rangers' Prince Fielder, including his four-hour workouts\n10 things you might not know about Derek Holland, including his top-notch impressions\n10 Texas Rangers you should know (or know better)\nHistoric look-back Flashback: Cliff Lee made Rangers playoff debut 5 years ago, dominated David Price and the Tigers\nWhere are they now? The members of the 2011 Texas Rangers World Series team\nThe history of the Texas Rangers' postseason appearances\nThe best pitching performances in Rangers history\nPhotos: 40 faces, 40 seasons of Texas Rangers baseball\nPhotos: Actors, athletes, presidents among Rangers' first-pitch celebrities\nJon Daniels' five best and worst moves as Rangers GM\n ", "external_links": ["http://beta.sportsdaydfw.com/texas-rangers/rangers/2015/10/07/5-excuses-get-workschool-watch-rangers-plus-doctors-note", "http://beta.sportsdaydfw.com/texas-rangers/rangersheadlines/2015/10/06/flashback-cliff-lee-made-rangers-playoff-debut-5-years-ago-dominated-david-price-tigers", "http://beta.sportsdaydfw.com/texas-rangers/rangersheadlines/2015/10/08/gallardo-vexes-blue-jays-banister-rangers-really-needed", "http://beta.sportsdaydfw.com/texas-rangers/rangersheadlines/2015/09/30/now-members-2011-texas-rangers-world-series-team", "http://beta.sportsdaydfw.com/texas-rangers/rangers/2015/10/04/banned-arlington-texas-rangers-championship-t-shirt-get-stadium", "http://beta.sportsdaydfw.com/texas-rangers/rangersheadlines/2015/10/07/five-storylines-determine-rangers-vs-blue-jays-including-attack-david-price", "http://beta.sportsdaydfw.com/texas-rangers/rangersheadlines/2015/10/07/national-prediction-roundup-anybody-want-pick-rangers-win-world-series", "http://beta.sportsdaydfw.com/texas-rangers/rangersheadlines/2015/10/08/fraley-new-team-result-david-price-another-postseason-loss-rangers", "http://beta.sportsdaydfw.com/texas-rangers/rangersheadlines/2015/10/07/townsend-double-comeback-started-shawn-tolleson-homecoming-rangers", "http://beta.sportsdaydfw.com/texas-rangers/rangersheadlines/2015/09/29/looking-back-history-texas-rangers-postseason-appearances", "http://beta.sportsdaydfw.com/texas-rangers/rangers/2015/10/05/texas-rangers-will-play-day-games-toronto", "http://beta.sportsdaydfw.com/texas-rangers/rangersheadlines/2015/10/07/texas-vs-toronto-sorry-canada-chuck-norris-crybaby-drake", "http://beta.sportsdaydfw.com/texas-rangers/rangers/2015/10/08/texas-rangers-alds-game-report", "http://beta.sportsdaydfw.com/texas-rangers/rangersheadlines/2015/10/08/grant-playoff-experience-just-number-youngsters-carried-rangers-win-jays", "https://twitter.com/KSherringtonDMN", "http://beta.sportsdaydfw.com/texas-rangers/rangersheadlines/2015/10/07/game-1-loom-large-yovani-gallardos-free-agency-prospects-staying-focused", "http://beta.sportsdaydfw.com/texas-rangers/kevinsherrington/2015/10/08/sherrington-banister-gives-tradition-thumb-goes-role-bullpen-victory-blue-jays", "http://beta.sportsdaydfw.com/texas-rangers/rangersheadlines/2015/10/07/10-things-every-texas-fan-needs-know-rangers-blue-jays-including-20000-come-back-bite-toronto", "http://beta.sportsdaydfw.com/texas-rangers/rangersheadlines/2015/10/08/banister-go-chirinos-offense-gimenezs-relationship-hamels-game-2", "http://beta.sportsdaydfw.com/texas-rangers/rangersheadlines/2015/10/08/national-reaction-adrian-beltre-one-toughest-athletes-sports-pete-rose-calls-jose-bautista-josh-donaldson", "http://beta.sportsdaydfw.com/texas-rangers/rangersheadlines/2015/10/07/sportsday-staffs-official-alds-predictions-still-rides-rangers", "http://beta.sportsdaydfw.com/texas-rangers/kevinsherrington/2015/10/08/three-thoughts-game-1-alds-rangers-win", "http://beta.sportsdaydfw.com/texas-rangers/rangersheadlines/2015/10/08/martin-perezs-ability-get-ground-ball-means-lefty-gets-game-3-nod", "http://beta.sportsdaydfw.com/texas-rangers/rangersheadlines/2015/10/08/blue-jays-notebook-jose-bautista-says-josh-donaldsons-collision-little-scary"], "published": "2015-10-09T05:20:00.000+03:00", "crawled": "2015-10-16T14:40:25.089+03:00", "highlightTitle": ""}