{"organizations": ["Eagles", "Sunnyside Christian", "Bulldogs", "Dayton", "St. John-Endicott"], "uuid": "3acec38dafe4ab4902b78a6cd004a9c147a63bb9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "union-bulletin.com", "main_image": "http://unionbulletin.media.clients.ellingtoncms.com/img/photos/2013/08/29/UB_logo.png", "site_section": "http://union-bulletin.com/rss/headlines/sports/", "section_title": "union-bulletin.com stories: Sports", "url": "http://union-bulletin.com/news/2015/oct/20/bulldogs-manhandle-eagles-68-6/", "country": "US", "title": "Bulldogs manhandle Eagles, 68-6", "performance_score": 0, "site": "union-bulletin.com", "participants_count": 0, "title_full": "Bulldogs manhandle Eagles, 68-6", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T19:31:00.000+03:00", "replies_count": 0, "uuid": "3acec38dafe4ab4902b78a6cd004a9c147a63bb9"}, "author": "", "url": "http://union-bulletin.com/news/2015/oct/20/bulldogs-manhandle-eagles-68-6/", "ord_in_thread": 0, "title": "Bulldogs manhandle Eagles, 68-6", "locations": ["Sunderland-Herrin", "Wash.", "Bren", "Dayton"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["James Duncan", "Williams", "James", "Zonie", "Touchet", "Jerry Dedloff", "Hayden Wooldrich", "Dayton", "Mike", "Tate", "Dedloff", "Mike Posey", "St. John-Endicott", "Wooldrich", "Eli Williams", "Tanner Bren", "Zonie Dedloff", "Kobie Sunderland-Herrin", "Jeff Tate", "Bren", "Willis"], "text": "Contact us Bulldogs manhandle Eagles, 68-6 Dayton picks up its first football victory of the season with a thorough rout of St. John-Endicott in 8-man play. Print this article Advertisement ST. JOHN, Wash. — In a battle of two teams still seeking their first victory of the season, Dayton was dominant here Friday as the Bulldogs overwhelmed St. John-Endicott 68-6 in a non-league 8-man prep football game. Both teams entered the game with 0-6 season records. “We knew going into this game that one of us was going to get our first win,” Dayton coach Jerry Dedloff said. “And I really have to hand it to my assistant coaches for teaching our players what needed to be done for us to be successful.” Mike Posey and James Duncan run the defense for the Bulldogs and Zonie Dedloff is Dayton’s offensive coordinator. “Mike literally wore out his DVD player making sure he didn’t miss anything, and James had the D-line coached up,” Dedloff said. “And Zonie was confident that his game play would work, and he didn’t disappoint me.” The Bulldogs bolted to a 36-6 lead in the first quarter and tacked on 26 more points in the second period for a 62-6 lead at the intermission. The only score of the second half came on a third-quarter gadget play when quarterback Tanner Bren tossed a pass to wide receiver Kobie Sunderland-Herrin, who in turn passed to Hayden Wooldrich for a 72-yard touchdown. Dayton drew first blood when Eli Williams broke a 54-yard touchdown on the Bulldogs’ first play from scrimmage. Bren connected with Sunderland-Herrin for the two-pointer. However, on the ensuing kickoff Dayton attempted an onside kick that blew up in the Bulldogs’ faces. Kicker Tristan Willis barely grazed the ball causing it to fall off the tee, and a St. John-Endicott player scooped it up and ran 41 yards for a touchdown. “Our guys didn’t want to get penalized for touching the ball before it went 10 yards, so everyone just stood around and their guy picked it up and ran with it,” Dedloff said. Not to worry, Bren and Jeff Tate quickly to control of matters. Bren returned St. John-Endicott’s ensuing kickoff 95 yards for a TD and later added touchdown runs of 63 and 35 yards. Tate scored three times on runs of 32, 50 and 3 yards, and he also intercepted an Eagles pass and returned in 36 yards for six points. Willis added Dayton’s final touchdown of the first half on a 75-yard run. “We had a comfortable lead at halftime and discussed how we had been on the losing end of lopsided games like this,” Dedloff said. “So we just wanted to control the clock in the second half and not run up the score. “I’m not sure why we called that double pass with that kind of a lead, but we did and it worked.” Dayton entertains Sunnyside Christian Friday for a non-league game while St. John-Endicott travels to Touchet to take on the unbeaten Indians in a Southeast 1B-8 League counter. Bulldogs 68, Eagles 6 Dayton 36 26 6 0 — 68 St. John-Endicott 6 0 0 0 — 6 Day — Williams 54 run (Sunderland-Herrin pass from Bren). SJE — 58 kickoff return (PAT failed. Day — Bren 95 kickoff return (PAT failed). Day — Tate 32 run (Tate run). Day — Tate 50 run (Tate run). Day — Bren 63 run (PAT failed). Day — Tate 3 run (PAT failed). Day — Tate 36 pass intercetion return (Tate run). Day — Bren 35 run (PAT failed). Day — Willis 75 run (PAT failed). Day — Wooldrich 72 pass from Sunderland-Herrin (PAT failed). More like this story", "external_links": [], "published": "2015-10-20T19:31:00.000+03:00", "crawled": "2015-10-21T10:57:30.884+03:00", "highlightTitle": ""}