{"organizations": ["White Plains High School", "North Rockland High School"], "uuid": "11a26375284d78e1a1a9298a4fba51feddd47efe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.lohud.com", "main_image": "http://www.gannett-cdn.com/-mm-/f5edf74777d43d29a0cc3f47045fcd41fcd18496/c=0-191-3874-2380&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/10/14/Westchester/Westchester/635804429937425478-mv101415conftennis01.jpg", "site_section": "http://rssfeeds.lohud.com/westchester/sports", "section_title": "West Chester - Sports", "url": "http://www.lohud.com/story/sports/high-school/tennis/2015/10/14/dwyer-sisters-push-through-conference-quarterfinals/73930836/", "country": "US", "title": "Dwyer sisters push through in conference quarterfinals", "performance_score": 0, "site": "lohud.com", "participants_count": 0, "title_full": "Dwyer sisters push through in conference quarterfinals", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T04:04:00.000+03:00", "replies_count": 0, "uuid": "11a26375284d78e1a1a9298a4fba51feddd47efe"}, "author": "", "url": "http://www.lohud.com/story/sports/high-school/tennis/2015/10/14/dwyer-sisters-push-through-conference-quarterfinals/73930836/", "ord_in_thread": 0, "title": "Dwyer sisters push through in conference quarterfinals", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Anika Dwyer", "Akemi Dwyer", "Dwyer", "Brittany Sedlak", "Marisa Magliato", "Adrian Szkolar"], "text": "Dwyer sisters push through in conference quarterfinals Adrian Szkolar , aszkolar@lohud.com 9:04 p.m. EDT October 14, 2015 North Rockland senior duo struggle in first set, but win easily win out second set to advance to semifinals. Buy Photo Anika Dwyer and Akemi Dwyer from North Rockland High School tap racquets as they battle Brittany Sedlak and Marisa Magliato from Ursuline, at the Conference II tennis tournament at White Plains High School, Oct. 14, 2015. (Photo: Mark Vergari/The Journal News) Buy Photo 2 CONNECT 1 TWEET LINKEDIN COMMENT EMAIL MORE \nWHITE PLAINS After handily winning their first-round match on Tuesday, Anika and Akemi Dwyer ran into a bit of a snafu against Ursuline's Brittany Sedlak and Marisa Magliato in the quarterfinals of Section 1's Conference II tournament at White Plains High School on Wednesday. \nThe senior duo from North Rockland, who are the first No. 1 seed the school has had since Margaret Iliev and Diana Lorentz in 2008, struggled in the first set and barely came away with a 7-6 win. The pair re-focused and handily won the second set 6-1. \n\"We weren't used to their pace and playing the baseline, so we had to think smart,\" Akemi Dwyer said. \"We had to adapt quickly.\" \nOne adjustment that worked was their unconventional formation changes to give their opponents a different look. One of them saw the sister line up directly in the center instead of staggering themselves in the orthodox manner. \n\"Every year, we're the only ones in the section who do it,\" Anika Dwyer said of their formation changes. \"It's intimidating, and it's one of our best weapons.\" \nUrsuline did have one doubles group survive into the next day; freshman pairing Laina Campos and Vanessa Ciano , the second seed of the bracket, defeated Harrison's Jess and Sydney Saviano in the quarterfinals. \n\"We wanted to play to our full potential,\" Campos said. \"We wanted to rally a lot, get every shot in instead of making unforced errors.\" \n\"We want to get as far as we can,\" Ciano added. \"We want to try to get to states.\" \nThe singles bracket of the tournament also started. Suffern sophomore Sydney Kaplan, the top seed in the bracket, handily won her two matches, defeating Clarkstown South's Sydney Harfenist 6-0, 6-0 and Scarsdale's Jessica Tsai 6-1, 6-1 to clinch an appearance in the semifinals. \nLast year Kaplan, along with senior Courtney Ollis, won the doubles title, but theduo decided to give the singles bracket a try this year. \n\"We wanted to try singles this year because this is (Courtney's) last year, so we wanted to go our own ways and see how we would do in singles,\" Kaplan said. \"I was making my shots and my serves were really good. I love playing with Courtney, but I like singles, too.\" \nSeveral of the semifinal matches for both singles and doubles were suspended due to the sunlight fading. Campos and Ciano were down to Mamaroneck's Alison Zerbib and Catherine Drgielewicz 6-5 in the first set, while the Dwyer sisters were up on Byram Hills' Devon Wolfe and Dana D'Onofrio by one set and were tied 1-1 in the second set. \nPlay will resume on Thursday at 3 p.m. \n\"We're going to play like we did in the first set,\" Akemi Dwyer said of Thursday. \n\"We'll dominate, hopefully,\" her sister Anika said. \nTwitter: @Szkolar_Lohud Buy Photo Anika Dwyer and Akemi Dwyer from North Rockland High School tap racquets as they battle Brittany Sedlak and Marisa Magliato from Ursuline, at the Conference II tennis tournament at White Plains High School, Oct. 14, 2015. Mark Vergari/The Journal News Fullscreen Buy Photo Anika Dwyer from North Rockland High School returns a shot as her sister Akemi watches, as they battle Brittany Sedlak and Marisa Magliato from Ursuline, at the Conference II tennis tournament at White Plains High School, Oct. 14, 2015. Mark Vergari/The Journal News Fullscreen Buy Photo Akemi and Anika Dwyer from North Rockland High School chat with their coach Jennifer LaBier during a break, as they battle Brittany Sedlak and Marisa Magliato from Ursuline, at the Conference II tennis tournament at White Plains High School, Oct. 14, 2015. Mark Vergari/The Journal News Fullscreen Buy Photo Sydney Harfenist from Clarkstown South returns a shot to Sydney Kaplan from Suffern High School, during the Conference II tennis tournament at White Plains High School, Oct. 14, 2015. Mark Vergari/The Journal News Fullscreen Buy Photo Sydney Kaplan from Suffern High School returns a shot to Sydney Harfenist from Clarkstown South, during the Conference II tennis tournament at White Plains High School, Oct. 14, 2015. Mark Vergari/The Journal News Fullscreen Buy Photo Emma Lella from Mamaroneck returns a shot to Sydney Barest from White Plains during the Conference II tennis tournament at White Plains High School, Oct. 14, 2015. Mark Vergari/The Journal News Fullscreen Buy Photo Sydney Barest from White Plains returns a shot to Emma Lella from Mamaroneck during their Conference II tennis tournament at White Plains High School, Oct. 14, 2015. Mark Vergari/The Journal News Fullscreen Buy Photo Kiera Tobia from Ursuline returns a shot to Phebe Denison from Scarsdale, during their Conference II tennis tournament at White Plains High School, Oct. 14, 2015. Mark Vergari/The Journal News Fullscreen Buy Photo Phebe Denison from Scarsdale returns a shot to Kiera Tobia from Ursuline during their Conference II tennis tournament at White Plains High School, Oct. 14, 2015. Mark Vergari/The Journal News Fullscreen Buy Photo Maya O'Brien from Tappan Zee returns a shot to Courtney Ollis from Suffern during their Conference II tennis tournament at White Plains High School, Oct. 14, 2015. Mark Vergari/The Journal News Fullscreen Buy Photo Courtney Ollis from Suffern returns a shot to Maya O'Brien from Tappan Zee during their Conference II tennis tournament at White Plains High School, Oct. 14, 2015. Mark Vergari/The Journal News Fullscreen Buy Photo Anika Dwyer and Akemi Dwyer from North Rockland High School slap hands as they battle Brittany Sedlak and Marisa Magliato from Ursuline, at the Conference II tennis tournament at White Plains High School, Oct. 14, 2015. Mark Vergari/The Journal News Fullscreen Buy Photo Akemi Dwyer and Anika Dwyer from North Rockland High School slap hands as they battle Brittany Sedlak and Marisa Magliato from Ursuline, at the Conference II tennis tournament at White Plains High School, Oct. 14, 2015. Mark Vergari/The Journal News", "external_links": [], "published": "2015-10-15T04:04:00.000+03:00", "crawled": "2015-10-15T07:59:10.457+03:00", "highlightTitle": ""}