{"organizations": [], "uuid": "5d4fe1d02eecdbb4819ab94abcef3f22f206ef7c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "nypost.com", "main_image": "https://thenypost.files.wordpress.com/2015/10/ld.jpg", "site_section": "http://nypost.com/sports/feed/", "section_title": "| Sports | New York Post", "url": "http://nypost.com/2015/10/12/larry-donnell-rescues-giants-from-disaster-with-miracle-grab/", "country": "", "title": "Larry Donnell rescues Giants from disaster with miracle grab", "performance_score": 0, "site": "nypost.com", "participants_count": 1, "title_full": "Larry Donnell rescues Giants from disaster with miracle grab | New York Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T04:29:00.000+03:00", "replies_count": 0, "uuid": "5d4fe1d02eecdbb4819ab94abcef3f22f206ef7c"}, "author": "Bart Hubbuch", "url": "http://nypost.com/2015/10/12/larry-donnell-rescues-giants-from-disaster-with-miracle-grab/", "ord_in_thread": 0, "title": "Larry Donnell rescues Giants from disaster with miracle grab", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Larry Donnell rode to the Giants’ rescue Sunday night with the type of catch that won them a couple of Super Bowls recently.\nWith Big Blue staring at an embarrassing home loss to the lowly 49ers, Donnell helped them avert disaster with an acrobatic, 12-yard touchdown catch with 26 seconds left that resulted in a 30-27 win at MetLife Stadium.\n“Once I had it, I had to hold that thing,” Donnell said. “You know, the game was on the line and I had to make a play.”\nDonnell capped a furious final five minutes, which featured three lead changes, by hauling in the pass from Eli Manning between linebacker NaVorro Bowman and safety Antoine Bethea.\n“To watch that ball go up and Larry go up and know that he’s going to catch it, literally watch the ball go all the way down into his hands and him hold onto it … it was great,” Odell Beckham Jr. said.\nThe degree of difficulty couldn’t have been much higher for Donnell, who somehow held on despite having to reach over Bowman as the tight end was falling backwards into the back of the end zone.\n“I thought I played it pretty good,” Bowman said. “It was just a great pass and great catch.”\nManning was running out of targets on the game-winning drive, as Rueben Randle was sidelined by a hamstring injury and Beckham was absent at the start due to a hamstring problem of his own.\nDonnell, though, said he wasn’t thinking about whom the Giants did and didn’t have on the field.\n“With that amount of time on the clock, all I’m thinking about is my job and the ways I can help the team,” said Donnell, whose catch, his second TD of the season, ended an eight-play, 82-yard march. “They were not there, but we were happy to get great guys and great plays.”\nDonnell had been mostly quiet up to that point, catching five passes for just 23 yards before his clutch reception kept the Giants alone in first place in the NFC East.\nDonnell hadn’t done much despite the Giants missing their other top tight end, Daniel Fells, to a scary MRSA infection that has left Fells hospitalized and reportedly fighting to save his foot.\n“That’s my boy,” Donnell said. “I did this for him.”\nCoach Tom Coughlin, who said Fells had “two very good days in a row,” echoed Donnell by saying the Giants dedicated the victory to the ailing tight end and his family.\nShare this: Facebook Twitter Google Whatsapp Email Filed under larry donnell ,  new york giants", "external_links": [], "published": "2015-10-12T04:29:00.000+03:00", "crawled": "2015-10-12T09:20:07.930+03:00", "highlightTitle": ""}