{"organizations": [], "uuid": "b3d2abbd6977d4c143dde426da9ea6e94de173dc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thedailyjournal.com", "main_image": "http://www.gannett-cdn.com/-mm-/a430a0907e8869882875d76a56b6170fc6555176/c=0-307-2095-1490&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/23/SNJGroup/Vineland/635812229157973359-sideline-3452.jpg", "site_section": "http://rssfeeds.thedailyjournal.com/vineland/sports", "section_title": "Vineland Sports", "url": "http://www.thedailyjournal.com/story/sports/2015/10/23/scott-adds-energy-thunderbolts-run-game/74470634/", "country": "US", "title": "Scott adds energy to Thunderbolts' run game", "performance_score": 0, "site": "thedailyjournal.com", "participants_count": 0, "title_full": "Scott adds energy to Thunderbolts' run game", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T01:54:00.000+03:00", "replies_count": 0, "uuid": "b3d2abbd6977d4c143dde426da9ea6e94de173dc"}, "author": "", "url": "http://www.thedailyjournal.com/story/sports/2015/10/23/scott-adds-energy-thunderbolts-run-game/74470634/", "ord_in_thread": 0, "title": "Scott adds energy to Thunderbolts' run game", "locations": ["Bridgeton", "Millville"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Clayton Scott", "MATT SILVA", "Scott"], "text": "Scott adds energy to Thunderbolts' run game MATT SILVA, @mattysilv 6:54 p.m. EDT October 23, 2015 Buy Photo Millville running back Clayton Scott (28), Friday, Oct. 23 in Bridgeton. (Photo: Sean M. Fitzgerald/Staff Photographer) Buy Photo Story Highlights Millville ground game is picking up the pace in recent weeks Scott has rushed for 253 yards over the last two weeks CONNECT 5 TWEET LINKEDIN COMMENT EMAIL MORE \nIt took some time to work things out, but the Millville High School football team may have found its running game. \nAfter not having a player rush for more than 50 yards in any of the season's first four games, sophomore running back Clayton Scott has amassed 253 yards over the Bolts’ last two contests. \nLittle tweaks along the front have made a big difference. \n“Since the beginning of the season, we have been shuffling our offensive linemen,” Millville coach Dennis Thomas said. “We were just trying to see what actually works for our guys. After shuffling and juggling around, we have a group of guys that grasp the concept of what we’re trying to do.” Millville football: Bolts rush to win over Absegami \nAnd with the recent string of good showings, including a 180-yard performance against Absegami, Scott has the chance to not only impress on the field, but also help Millville rack up victories. \n“We have been working on the line, changing some things. During practice, I’m playing more attention to the offensive line assignments,” Scott said. “If I know what assignments they’ll have on a play, it helps me know where the hole is, find it and make something happen.” \n“He has the ability to be a big-time running back at the next level (college),” Thomas said. “You get even a decent line around Clayton and he’ll make you look good. With this good line, it will allow him to be great.” Millville football defeats Ocean City \nRunning the ball with effectiveness is a great thing, but the second part of the equation comes with protecting the ball. \n“You want to lean on the running game and we have it,” Thomas said. “But in our last three games, we have turned the ball over six times, with five fumbles in the red zone. That is totally unacceptable. \n“We came out with two victories, but the one loss, the 13-7 defeat at St. Joseph. … If we don’t turn the ball over there, I believe we win that ball game. The offense has to do a lot better.” \nImproving will hinge on the hopes that the young Thunderbolts continue to learn and get better in practice. All that is needed is an offense that can compliment an already ferocious defensive unit. Millville Football vs. Absegami High School \n“The more we do it the better we are. … Not just for me, but for the whole offense,” Scott said. “The line and running backs just need to work together and to keep things going. \n“At some point we like to run the ball, but we plan on doing both (running and passing). We just have to keep them second guessing when we line up.” \nWith the changes made and the success that has followed offensively, it could be the start of a nice run towards the end of the season. \n“The offense has to take care of the football and we have to be extremely efficient,” Thomas said. “The only way we’re going to be efficient is if we keep the repetitions in practice. We need our quarterback and running back to mesh solidly. \n“The best thing I can do is keep helping those guys by giving them that repetition and getting those guys more comfortable with what we’re doing offensively.”", "external_links": [], "published": "2015-10-24T01:54:00.000+03:00", "crawled": "2015-10-24T02:51:52.139+03:00", "highlightTitle": ""}