{"organizations": ["Ravens", "Chiefs and Lions", "NFL", "Giants", "Steelers", "Carolina", "Denver Broncos", "Broncos and Packers", "Green Bay Packers", "Broncos", "Arnie Stapleton Tweet Aaron Josefczyk/Associated Press Denver Broncos", "Press Denver Broncos", "New York Jets", "Buffalo", "Seahawks"], "uuid": "abf8e9b9fe1c252c2a8b74603c87967449b2faf0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "m.durangoherald.com", "main_image": "http://durangoherald.com/storyimage/DU/20151020/SPORTS01/151029951/AR/0/AR-151029951.jpg", "site_section": "http://www.durangoherald.com/section/sports?template=RSS&mime=xml", "section_title": "Sports", "url": "http://m.durangoherald.com/article/20151020/SPORTS01/151029951/-1/sports&source=RSS", "country": "US", "title": "Denver Broncos, Green Bay Packers unbeaten but untested", "performance_score": 0, "site": "durangoherald.com", "participants_count": 0, "title_full": "Denver Broncos, Green Bay Packers unbeaten but untested", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T05:03:00.000+03:00", "replies_count": 0, "uuid": "abf8e9b9fe1c252c2a8b74603c87967449b2faf0"}, "author": "", "url": "http://m.durangoherald.com/article/20151020/SPORTS01/151029951/-1/sports&source=RSS", "ord_in_thread": 0, "title": "Denver Broncos, Green Bay Packers unbeaten but untested", "locations": ["Cincinnati", "Minnesota", "Seattle", "Cleveland", "Dallas", "Green Bay", "New England", "Denver", "Indianapolis", "Pittsburgh"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ronnie Hillman", "Chris Harris Jr.", "Brandon McManus", "David Richard/Associated", "Peyton Manning", "Ryan Harris", "Carolina", "Emmanuel Sanders", "Dez Bryant", "Denver", "Terrell Suggs", "Tony Romo", "Aaron Josefczyk/Associated", "Miller", "Von Miller"], "text": "Denver Broncos, Green Bay Packers unbeaten but untested Denver Broncos, Green Bay Packers unbeaten but untested NFL’s undefeated teams face plenty of big tests over the next two weeks By Arnie Stapleton Tweet Aaron Josefczyk/Associated Press Denver Broncos wide receiver Emmanuel Sanders streaked to the end zone for a 75-yard touchdown that snapped a streak of 25 consecutive drives without a touchdown for Denver. Despite being 6-0, the Broncos’ offense and weak schedule is a big reason the team is still drawing criticism. Aaron Josefczyk/Associated Press Denver Broncos wide receiver Emmanuel Sanders streaked to the end zone for a 75-yard touchdown that snapped a streak of 25 consecutive drives without a touchdown for Denver. Despite being 6-0, the Broncos’ offense and weak schedule is a big reason the team is still drawing criticism. E NGLEWOOD The knock on both the Broncos and Packers, 6-0 teams with byes this weekend before their showdown Nov. 1 in Denver, is that they’ve fattened up on the league’s bottom-feeders. That argument could be made about any of the NFL’s five unbeaten teams, really – and that’s about to change over the next two weeks. The league’s two 5-0 teams, Carolina and New England, have big tests this weekend. The Panthers will host the Eagles (3-3), who are tied atop the NFC East after their big win over the Giants, and the Patriots will host the New York Jets (4-1). The league’s trio of 6-0 teams all have this weekend off and will take unbeaten records into November. The Bengals will visit Pittsburgh (4-2) on Nov. 1 before the Broncos and Packers will meet on Sunday Night Football. “It’s a huge game,” Broncos cornerback Chris Harris Jr. said. “People keep thinking that our team is just a fluke and we haven’t played anybody. It’s a good game to kind of see where we’re at.” And show everyone else, added Denver linebacker Von Miller. “I still don’t think that we’re getting all the love that we should get,” Miller said, even though Denver’s No. 1-ranked defense has collected 26 sacks and 18 takeaways. “We play Green Bay, Sunday Night Football, we’ll be able to prove our point.” The Fab Five all have skeptics to win over, apparently. The combined records of all five unbeaten teams’ opponents are below .500, and only the Broncos and Patriots have beaten a team with a winning record. The Patriots beat the Steelers in the season opener, and two other opponents, the Bills and Colts, are right at .500. Overall, New England’s opponents are a respectable 13-16. That’s by far the best mark by opponents for any of the five teams who have yet to lose. The Broncos beat Minnesota (3-2) but also count three of the league’s 1-5 teams among their victims, and their opponents are 10-24 overall. The Packers’ opponents are 11-24 and none of them have won more than twice. Neither have Carolina’s, whose opponents are a combined 9-20, although you can put their last-minute win at Seattle (2-4) last week in the impressive category no matter the Seahawks’ record. Cincinnati’s opponents are 11-24, with Buffalo (3-3) the only team not currently under .500. So, yes, they’ve all fattened up a little on the also-rans. But that’s the nature of the NFL. Before losing Dez Bryant and Tony Romo to injury, Dallas sure didn’t have the look of a sub-.500 team heading into Week 7. Neither did the Ravens before losing Terrell Suggs or the Seahawks before misplacing their mojo. And Denver’s first three games were against the Ravens, Chiefs and Lions, a trio that averaged 10 wins last year and didn’t look like they’d be a combined 3-15 at this point. Still, the Broncos are getting the most scrutiny of the unbeaten clubs even though they’re the first team since Indianapolis in 2009 to win four road games in the first six weeks of a season. They own the league’s best defense and the game’s best kicker in Brandon McManus. It’s their offense that has so many so skeptical. Peyton Manning leads the league with 10 interceptions and presided over an injury-riddled unit that went 25 drives without sniffing the end zone before he hit Emmanuel Sanders in stride for a 75-yard touchdown at Cleveland on Sunday. “Whatever stats people are looking for, we’ve got a great stat and that’s 6-0,” Denver left tackle Ryan Harris said before thinking of another number: “And No. 1 in the division.” The Broncos’ lead in the AFC West is an astonishing 3½ games, but they understand the skepticism and even the anger from fans and fantasy owners who are kicking themselves for drafting so many Broncos who are underachieving. “That’s just the world we live in,” Miller said. “If we were scoring 45 points on offense and had the No. 1 defense and B-Mac was missing every field goal, they’d be like, ‘OK, we got to get the kicker straight or we’re not going to win.’ It’s always going to be something. So, I’m glad it’s something and we’re 6-0.” Tweet David Richard/Associated Press Denver Broncos running back Ronnie Hillman cracked the 100-yard barrier Sunday at Cleveland to help a struggling offense remain 6-0 to open the season. David Richard/Associated Press Denver Broncos running back Ronnie Hillman cracked the 100-yard barrier Sunday at Cleveland to help a struggling offense remain 6-0 to open the season.", "external_links": [], "published": "2015-10-21T05:03:00.000+03:00", "crawled": "2015-10-21T13:46:13.216+03:00", "highlightTitle": ""}