{"organizations": ["Winnipeg Jets", "Blues", "Associated Press", "NHL"], "uuid": "f457b5fb327eb94369dc41503412e5e6486a0245", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtontimes.com", "main_image": "http://media.washtimes.com.s3.amazonaws.com/media/image/2015/10/18/92ce97d5d9ab362e850f6a70670036fd.jpg", "site_section": "http://feeds.feedburner.com/Sports-TheWashingtonTimesAmericasNewspaper", "section_title": "www.washingtontimes.com stories: Sports", "url": "http://www.washingtontimes.com/news/2015/oct/18/tarasenko-scores-twice-blues-beat-jets-4-2/", "country": "US", "title": "Tarasenko scores twice, Blues beat Jets 4-2", "performance_score": 0, "site": "washingtontimes.com", "participants_count": 0, "title_full": "Tarasenko scores twice, Blues beat Jets 4-2", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T02:44:00.000+03:00", "replies_count": 0, "uuid": "f457b5fb327eb94369dc41503412e5e6486a0245"}, "author": "", "url": "http://www.washingtontimes.com/news/2015/oct/18/tarasenko-scores-twice-blues-beat-jets-4-2/", "ord_in_thread": 0, "title": "Tarasenko scores twice, Blues beat Jets 4-2", "locations": ["St. Louis Blues", "Winnipeg"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Upshall", "Dustin Byfuglien", "Toby Enstrom", "Tarasenko", "Jay Bouwmeester"], "text": "Sports Tarasenko scores twice, Blues beat Jets 4-2 Winnipeg Jets’ Dustin Byfuglien (33) scrums with St. Louis Blues’ Scottie Upshall (10) and Jay Bouwmeester (19) as Jets’ Toby Enstrom (39) gets involved during third period NHL hockey action in Winnipeg, Sunday, Oct. 18, 2015. (Trevor Hagan/The Canadian Press ... more > By - Associated Press   \nWINNIPEG, Manitoba (AP) - Vladimir Tarasenko delivered the knockout punch for the St. Louis Blues \nTarasenko scored twice and Brian Elliott made 26 saves in the streaking Blues’ 4-2 victory over the Winnipeg Jets on Sunday. \n“We won the street fight. That was a good, old-fashioned street fight,” St. Louis coach Ken Hitchcock said. “It was a lot of fun and we won the street fight. It was close, hard fought. The teams really get after each other.” \nTarasenko gave the Blues a 3-2 lead on a delayed penalty midway through the third period, firing a shot past goalie Ondrej Pavelec and into the corner of the net for his fifth goal of the season. \nThe Blues have won four straight to improve to 5-1-0. They will finish their six-game trip at Montreal on Tuesday night. \n“It’s a tough road trip. We had something like three games in 72 hours,” Tarasenko said. “We have one more game against an unbeaten team. We have some time to rest right now and then go home after.” \nScottie Upshall and Carl Gunnarsson also scored for St. Louis. \n“I think we’ve shown we can play with anybody,” Hitchcock said. “We’ve sustained very significant injuries here already and yet we’ve still found ways to score goals, which is a good sign.” \nNikolaj Ehlers and Mathieu Perreault scored for Winnipeg, and Pavelec stopped 37 shots. The Jets dropped to 4-2-0. \n“I like our start. I thought our first period we were on top of it. Our pace was just off a little bit,” Jets captain Andrew Ladd said. “We weren’t able to sustain as much pressure as we’d like in the last two periods.” \nTarasenko opened the scoring at 3:27 of the second with a nifty move and a perfectly placed shot over Pavelec’s glove hand. \nThe Jets responded 1:04 later on a power play with Upshall in the box for high-sticking. Blake Wheeler, working down below the red line behind Elliott, found a wide-open Perreault for a one-timer. \nThe Blues regained the lead at 9:42 on Upshall’s goal. Pavelec made the initial stop on Dmitrij Jaskin, who flipped his own rebound through the crease to Upshall. \nThe Jets struck again on the power play with 7:33 left in the period. Ehlers shot from the point deflected off Drew Stafford’s elbow and into the top corner of the net. \nTarasenko broke the tied at 9:50 of the third, and Gunnarsson added a power-play goal with 1:07 left.", "external_links": [], "published": "2015-10-19T02:44:00.000+03:00", "crawled": "2015-10-19T04:34:42.838+03:00", "highlightTitle": ""}