{"organizations": [], "uuid": "2bcd9c2ed99400d6723756df01378482ba77ddaa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "cjonline.com", "main_image": "http://cjonline.com/sites/default/files/14782204_0.jpg", "site_section": "http://cjonline.com/taxonomy/term/2/2/feed", "section_title": "Sports", "url": "http://cjonline.com/sports/catzone/2015-10-05/k-state-football-bill-snyder-lauds-kody-cooks-adaptability-recall", "country": "US", "title": "K-State football: Bill Snyder lauds Kody Cook's adaptability, recall", "performance_score": 0, "site": "cjonline.com", "participants_count": 1, "title_full": "K-State football: Bill Snyder lauds Kody Cook's adaptability, recall", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T22:45:00.000+03:00", "replies_count": 0, "uuid": "2bcd9c2ed99400d6723756df01378482ba77ddaa"}, "author": "Ken Corbitt", "url": "http://cjonline.com/sports/catzone/2015-10-05/k-state-football-bill-snyder-lauds-kody-cooks-adaptability-recall", "ord_in_thread": 0, "title": "K-State football: Bill Snyder lauds Kody Cook's adaptability, recall", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Ken Corbitt ken.corbitt@cjonline.com \nWith injuries and illness to the back-up quarterbacks, Kansas State implemented an emergency plan during practice last week. \nKody Cook, the Wildcats’ leading receiver, began taking snaps behind Joe Hubener and was called into action when Hubener was injured on the opening series at Oklahoma State. Cook had experience in a similar situation, moving from receiver to quarterback to lead Hutchinson Community College to a victory in the 2012 Salt City Bowl. \nCook couldn’t deliver a victory this time at Oklahoma State, knocked out of the game with an injury early in the fourth quarter of the Wildcats’ 36-34 loss. But the former Louisburg High School quarterback — who worked at the position when he first came to K-State — deftly directed the offense by completing 10 of 16 passes for 122 yards and two touchdowns while rushing 21 times for 87 yards. \n“He adapted so very well,” K-State coach Bill Snyder said Monday on the Big 12 Conference teleconference. “I was awfully proud of him. He had a short week of practice in that capacity. He has great recall and I thought he did a marvelous job of picking things up. He’s experienced a little bit of it in the past but it’s the recall that was impressive to me, the fact he could bring so many of those things back to reality and do it from a little different position. \n“Having been a starting wide receiver was beneficial for him, as well, because he has a lot of interaction with quarterbacks. The right hand knows what the left hand is doing so he had a good feel for it, but to put it on the field in that kind of environment is not the easiest thing in the world and I thought he did it with great composure.” \nSnyder said Cook will continue to “play both spots,” but the severity of his injury is unknown, putting his availability in doubt beginning Saturday when K-State (3-1, 0-1 Big 12) plays No. 2 TCU (5-0, 2-0) at 6:30 p.m. at Bill Snyder Family Stadium. With Game 1 starter Jesse Ertz and freshman Alex Delton injured and Jonathan Banks questionable due to illness, the back-up to Hubener could be Zach Davidson, a redshirt freshman walk-on. \n“Joe should be able to go,” Snyder said. “We’re confident about that, but outside of that there’s some uncertainty.” \nCHAIN-GATE FALLOUT — The Big 12 issued an apology and said the game officials and chain crew would be disciplined after an error in spotting the down marker that shorted Oklahoma State five yards after a holding penalty. \nThe down marker gave the Cowboys first-and-15 rather than first-and-20, and OSU ultimately gained a first down and drove in for a touchdown just before halftime to cut K-State’s lead to 28-20. \nSnyder and Cowboys coach Mike Gundy said they were unaware of the error at the time. \n“When the situation took place it just didn’t seem as though they had made enough yardage, but I was way down at the other end and didn’t see it,” Snyder said. “I certainly didn’t question it and I had no idea anything had happened in regards to the chains. That’s something you can’t control. That’s beyond us now.” \nSaid Gundy: “We were aware of it after it happened but we were not aware of it when it happened. The game was moving too fast.” \nOKLAHOMA TIME SET — The Wildcats’ home game Oct. 17 against Oklahoma will kick off at 2:30 p.m. and will be televised on either ABC, ESPN or ESPN2. \nKen Corbitt can be reached at (785) 295-1123 or ken.corbitt@cjonline.com .Follow Ken on Twitter @KenCorbitt .", "external_links": [], "published": "2015-10-05T22:45:00.000+03:00", "crawled": "2015-10-06T00:06:57.927+03:00", "highlightTitle": ""}