{"organizations": [], "uuid": "c64e15c6ac960685931da7255af0643b18514ee6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "http://s3.reutersmedia.net/resources/r/?m=02&d=20151012&t=2&i=1086316524&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXNPEB9B03J", "site_section": "http://www.reuters.com/news/sports", "section_title": "Sports News, Highlights &amp; Coverage | Reuters.com", "url": "http://www.reuters.com/article/2015/10/12/us-baseball-mlb-tulowitzki-idUSKCN0S607T20151012", "country": "US", "title": "Tulowitzki helps keep Blue Jays alive with three-run homer", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Tulowitzki helps keep Blue Jays alive with three-run homer | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T08:13:00.000+03:00", "replies_count": 0, "uuid": "c64e15c6ac960685931da7255af0643b18514ee6"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/10/12/us-baseball-mlb-tulowitzki-idUSKCN0S607T20151012", "ord_in_thread": 0, "title": "Tulowitzki helps keep Blue Jays alive with three-run homer", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Toronto Blue Jays shortstop Troy Tulowitzki snapped out of a postseason slump with a three-run home run to keep his team alive with a 5-1 win against the Texas Rangers on Sunday.\nTulowitzki had gone 0-for-11 with a walk before his home run to left field busted a 2-0 game wide open in the top of the sixth inning. The Rangers now lead the best-of-five American League Division Series 2-1 with Game Four back in Arlington, Texas on Monday.\n\"I haven’t been swinging the bat the greatest,” Tulowitzki said. \"I was trying to put a good swing on it and obviously had the count in my favor and got a good pitch (change up) to hit.\"\nTulowitzki joined the Blue Jays in a trade with the Colorado Rockies in late July. But he missed three weeks last month after he suffered a shoulder injury in an on-field collision with teammate Kevin Pillar. He returned for a few games at the end of the regular season.\n\"I’m still battling it,\" he said afterwards with a huge ice pack on his left shoulder. \"I said that at the beginning of the series. I’m not at my best, but I’m good enough to go out there and today it was good enough to win the game.\"\nTulowitzki singled in his next at-bat with a sharp single to left field.\n\"(Tulowitzki) needed that, he really did,” Blue Jays manager John Gibbons said. \"He had that long layoff with the injury. It’s been a battle for him this year, offensively.\n\"He’s had some key hits along the way, but not like he normally does. If he catches fire, we’re real dangerous.”\nThis was the Blue Jays' first postseason win since they won the second of their back-to-back World Series championships in 1993.\n\"This was huge,\" Tulowitzki said. \"If we can get another win tomorrow we go back to Toronto (for Game Five).\"\n(Reporting by Tim Wharnsby; Editing by Amlan Chakraborty )", "external_links": [], "published": "2015-10-12T08:13:00.000+03:00", "crawled": "2015-10-12T07:31:05.502+03:00", "highlightTitle": ""}