{"organizations": [], "uuid": "24bc0812b316cae1a60449338135268129c8e772", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "", "site_section": "http://bostonherald.com/sports/college", "section_title": "Sports: College | Boston Herald", "url": "http://bostonherald.com/sports/college/college_football/2015/10/tufts_set_for_big_test", "country": "US", "title": "Tufts set for big test", "performance_score": 0, "site": "bostonherald.com", "participants_count": 1, "title_full": "Tufts set for big test | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T03:00:00.000+03:00", "replies_count": 0, "uuid": "24bc0812b316cae1a60449338135268129c8e772"}, "author": "John Connolly", "url": "http://bostonherald.com/sports/college/college_football/2015/10/tufts_set_for_big_test", "ord_in_thread": 0, "title": "Tufts set for big test", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Don’t look now, but those are football players masquerading as prancing pachyderms over on the Tufts campus these days. And why not? The Jumbos have plenty to roar about when it comes to their sparkling unbeaten ledger.\nTufts is off to a 3-0 start for the first time since 2007 and the Jumbos’ 43-24 win over Bowdoin last week marked their fifth straight home victory. It’s all pretty heady stuff for a program that had struggled through 24 straight losses earlier this decade.\nTufts faces its sternest test today when it entertains fellow unbeaten Trinity (3-0 NESCAC) at Zimman Field in Somerville. The visiting Bantams have taken seven straight in the series, with Tufts’ last win a 16-10 victory in 2007.\n“We wanted to win the league (our) first year here, but I’d still get on the bus knowing what I know now,” said Tufts coach Jay Civetti. “I don’t think anyone of us would have anticipated it would take this long, but it was well worth the wait thus far.”\nThe rivalry provides a little spice for Civetti, a 2000 Trinity grad. Civetti, a former Bantams stalwart on the offensive line, watched his Jumbos take it out on his former Trinity offensive line coach J.B. Wells, who became the new coach at Bowdoin this season.\n“I’ll always be a proud alum of Trinity. It’s a great school, It was a great place for me. But at the end of the day, I’ve had more games on the Tufts sideline with the Jumbos than I’ve had as a Bantam. I’m rooting for the brown-and-blue this weekend,” Civetti said.\n“We’re excited to be at home again. Family Weekend. It’s a 1:30 (p.m.) kick. It’s the way you want it. We’re 3-0, bringing Trinity, 3-0. We’ve made some great strides as a program and now it’s a great challenge to continue to work hard for each other. We have a great challenge this weekend.\n“This week, Trinity comes to town as advertised. They’re exceptional. No one has scored on their defense. They’ve given up a safety and they’ve given up a blocked PAT for a two-point conversion,” Civetti said. “So four points have been scored against them all year. They are as well coached and as poised as anybody. As Trinity does, they plug and play. They graduated four or five guys from the front seven and they replace them with four or five really good guys, as well. Their quarterback, Sonny Puzzo, is back and returns after a year away from school and is a really talented quarterback. One of the unique things about Trinity right now is that they’ve been throwing the ball more than they have been running it, and I think that’s a tribute to Sonny’s ability and his arm.”\nCivetti would be wise to counsel the schedule maker. The Jumbos annually face a three-game stumbling block of games against traditional powerhouses Trinity, Williams and Amherst.\n“I think it’s a conversation that all of us as coaches have. It’s not just Tufts that has to line up and go play Trinity, Williams and Amherst in a row. If you look across the board I think, based on how the schedule works, we all have to be prepared every week because there is quite a bit of parity in the league that way, and you need to be as ready and as locked-in for every game. You can’t get ahead of yourself,” said Civetti. “I think it also shows just how difficult it is to win in our league, because there are teams that can run the table or go undefeated in NESCAC because it’s pretty special. We have no choice. The schedule never changes. It hasn’t since the mid-’90s. I think you get to preach the true, one-game-at-a-time mentality.”\nCivetti credited his staff for recruiting quality building block players like seniors Akene Farmer-Michos. Justin Roberts of Milton, Corey Burns of Whitman, and Ife Adebayo of Medfield.\n“From the top down, football is important at Tufts,” Civetti said. “It’s a community effort, and in my position, I’m thankful the school stuck with me, I think it’s taught the kids a lot about commitment and a lot about believing in the cause and believing in me and the staff, and then our kids doing the work and buying in. It’s a bigger thing than just Tufts football.”", "external_links": [], "published": "2015-10-17T03:00:00.000+03:00", "crawled": "2015-10-17T10:51:47.410+03:00", "highlightTitle": ""}