{"organizations": [], "uuid": "677d74b028b15e75053c502efb6c225d70b6a213", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.winnipegfreepress.com", "main_image": "http://media.winnipegfreepress.com/images/648*432/CPT115301747_high.jpg", "site_section": "http://www.winnipegfreepress.com/rss/?path=/sports", "section_title": "Winnipeg Free Press: Sports", "url": "http://www.winnipegfreepress.com/sports/queens-park-rangers-winger-junior-hoilett-commits-to-canada-soccer-330118501.html", "country": "US", "title": "Queens Park Rangers winger Junior Hoilett commits to Canada Soccer", "performance_score": 0, "site": "winnipegfreepress.com", "participants_count": 1, "title_full": "Queens Park Rangers winger Junior Hoilett commits to Canada Soccer - Winnipeg Free Press", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T15:04:00.000+03:00", "replies_count": 0, "uuid": "677d74b028b15e75053c502efb6c225d70b6a213"}, "author": "Neil Davidson, The Canadian Press", "url": "http://www.winnipegfreepress.com/sports/queens-park-rangers-winger-junior-hoilett-commits-to-canada-soccer-330118501.html", "ord_in_thread": 0, "title": "Queens Park Rangers winger Junior Hoilett commits to Canada Soccer", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "TORONTO - David (Junior) Hoilett has committed to play for Canada.\nThe 25-year-old midfielder from Brampton, Ont., plays his club soccer for Queens Park Rangers in England's second tier. But his international future has been a question mark until now.\n\nWest Bromwich Albion's Silvestre Varela, left, and Queens Park Rangers' David Hoilett battle for the ball, during the English Premier League soccer match at Loftus Road, in London, Saturday Dec. 20, 2014. Hoilett has committed to play for Canada.The 25-year-old midfielder from Brampton, Ont., plays his club soccer for Queens Park Rangers in England's second tier. But his international future has been a question mark until now.THE CANADIAN PRESS/AP/PA, Adam Davy UNITED KINGDOM OUT NO SALES NO ARCHIVE \n\"I can't wait to play, put on the Canada jersey for the first time, and help the team achieve better things and progress as a nation,\" Hoilett said in a video interview provided by the Canadian Soccer Association.\nHoilett is also eligible to play for Jamaica by virtue of his parents. England was also a possibility by virtue of his time spent there.\nThe speedy winger is expected to join the Canadian national team next week in Florida in advance of an a friendly against Ghana in Washington, D.C.\nBenito Floro's team is preparing for the November start of the fourth round of World Cup qualifying in the CONCACAF region. Canada hosts Honduras on Nov. 13 in Vancouver before playing in El Salvador on Nov. 17.\nHoilett said he made his decision to join the Canadian fold after meeting with Floro.\n\"He (Floro) sat down prior to the decision and he was just giving me confidence, telling me to just be out there, be happy, play your game, we already know what you can do and just be comfortable when you are out there,\" Hoilett said. \"We have a good team, good structure behind it, and we're looking forward to be out there, create chances and help the team win games.\"\nHoilett has seen limited action for QPR this season, appearing in just two cup games. British reports have linked him to a move away from the London club in recent months.\nHe played for Blackburn Rovers previously in England and had earlier stints with Paderborn and St. Pauli in Germany.\nHoilett and younger brother Janiel have both trained with Toronto FC in the off-season.\nHoilett joins FC Dallas forward Tesho Akindele in choosing Canada over another country. The Calgary-born Akindele, who also has U.S. citizenship, committed to Canada in June.\nOthers in the past have gone the other way, including Owen Hargreaves (England), Teal Bunbury (U.S.) and Asmir Begovic (Bosnia and Herzegovina).\n ", "external_links": [], "published": "2015-09-30T15:04:00.000+03:00", "crawled": "2015-10-01T04:22:46.342+03:00", "highlightTitle": ""}