{"organizations": [], "uuid": "8273a89137b769f0a9f9d4df467994aea70cd12b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.timesreporter.com", "main_image": "http://www.timesreporter.com/storyimage/OH/20151011/SPORTS/151019934/AR/0/AR-151019934.jpg", "site_section": "http://www.timesreporter.com/sports?template=rss&mime=xml", "section_title": "Sports - Times Reporter", "url": "http://www.timesreporter.com/article/20151011/SPORTS/151019934/2000/NEWS?rssfeed=true", "country": "US", "title": "Barnidge saves Browns' backside in OT win at Baltimore", "performance_score": 0, "site": "timesreporter.com", "participants_count": 1, "title_full": "Barnidge saves Browns' backside in OT win at Baltimore", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T00:59:00.000+03:00", "replies_count": 0, "uuid": "8273a89137b769f0a9f9d4df467994aea70cd12b"}, "author": "Steve Doerschuk", "url": "http://www.timesreporter.com/article/20151011/SPORTS/151019934/2000/NEWS?rssfeed=true", "ord_in_thread": 0, "title": "Barnidge saves Browns' backside in OT win at Baltimore", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Barnidge saves Browns' backside in OT win at Baltimore Gary Barnidge is the toast of the locker room after foot-tonging a football off his backside for the touchdown that could save the Browns season. Comment Posted Oct. 11, 2015 at 4:59 PM BALTIMORE When you get around the joke that the Browns really pulled one out of their … Well, did you see Gary Barnidge’s catch? “One they’ll talk about years from now,” Browns quarterback Josh McCown said after a 33-30 overtime win inspired by Barnidge. “I’m laughing now,” Barnidge said. “I wasn’t laughing at the time.” The Browns lagged behind Baltimore all afternoon and faced a 21-16 deficit in the early seconds of the fourth quarter. McCown was under pressure when he planted his back foot and launched toward the right corner of the end zone. Free safety Kendrick Lewis engaged Barnidge near the goal line. “It was a contested catch,” McCown said of what turned into an 18-yard touchdown. “Obviously, extremely contested.” The ball glanced off Barnidge’s hands and onto his backside, literally suspending for a moment on Barnidge’s butt. Using the sides of his cleats as tongs, Barnidge quickly and carefully lifted the ball without letting it touch the field, weirdly transferred it to his hands, and rolled into the end zone. Here’s how Barnidge saw it. “Josh threw the ball up while he was under pressure. I came back and tried to get the ball. “I jumped up and the guy (Lewis) tried to knock it down, but I tried to grab it, too. I saw it hit his foot, and it landed right on my leg, so I was trying to curl it and tap it on my leg and get my hands on it.” McCown only had a view of the sky over M&T Bank Stadium. He had been decked as he threw. The 36-year-old quarterback ran to the 30-year-old tight end after he got up. McCown: “Gary said, ‘I caught it. Not with my hands, but I caught it.’” Much happened after the catch, leading to Travis Coon’s 32-yard field goal in overtime. The Browns could not have won without the Barnidge play. But they did win, improving to 2-3 rather than falling into the chasm of 1-4, where the Ravens find themselves. Head coach Mike Pettine got choked up in his postgame news conference. Yet, the former Baltimore assistant also was having the time of his life, sounding ready to buy a round for Barnidge. “Just another day at the office for big-play Gary,” Pettine said. It was a joke, and it wasn’t. Barnidge had career highs with eight catches and 139 yards. Since replacing departed free agent Jordan Cameron, he has caught 24 passes for 374 yards and three touchdowns. Page 2 of 2 - Tramon Williams, a former Green Bay Packer who was enjoying his biggest day with the Browns, walked by Barnidge wearing a million-dollar grin. “That guy?” said Williams, pointing to No. 82. “No. 1 fantasy-league tight end.” Speaking of which, McCown was out of sight, passing for a franchise-record 457 yards and boosting his season passer rating to 102.8. McCown needed 56 passes to get there, eclipsing the 444 yards passing set by Brian Sipe on Oct. 25, 1981, against the Baltimore Colts. “They were blitzing to stop the run,” left tackle Joe Thomas said. “That left a lot of things open in the passing game, and Josh took advantage.” Thomas was in a playful mood after the Browns’ first victory at Baltimore since 2007 — also by a 33-30 score in overtime. His sarcastic take: “I don’t know how to put it in perspective,” he said. “Put in Johnny is all I can say.” McCown broke out of a 1-13 slump as a starting QB. He smiled every time somebody brought up Barnidge’s “butt catch.” It was befitting of the famous Phil Dawson bank-shot field goal that led to the 33-30 OT win in 2007. This will be a cool thing to look back on when my career is over,” McCown said. Browns fans hope the season is just starting. Reach Steve at 330-580-8347 or steve.doerschuk @cantonrep.com On Twitter: @sdoerschukREP", "external_links": [], "published": "2015-10-12T00:59:00.000+03:00", "crawled": "2015-10-12T04:55:19.692+03:00", "highlightTitle": ""}