{"organizations": [], "uuid": "578792cea57b8a78993e1af3916a00b51fe4b3e4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wcax.com", "main_image": "http://images.worldnow.com/AP/images/8945618_G.jpg", "site_section": "http://www.wcax.com/category/13537/business-news", "section_title": "Business &amp; economy news - WCAX.COM Local Vermont News, Weather and Sports-", "url": "http://www.wcax.com/story/30184676/new-minority-govt-brings-political-tension-in-portugal", "country": "US", "title": "New minority gov't brings political tension in Portugal", "performance_score": 0, "site": "wcax.com", "participants_count": 1, "title_full": "New minority gov't brings political tension in Portugal - WCAX.COM Local Vermont News, Weather and Sports-", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "578792cea57b8a78993e1af3916a00b51fe4b3e4"}, "author": "wcax.com", "url": "http://www.wcax.com/story/30184676/new-minority-govt-brings-political-tension-in-portugal", "ord_in_thread": 0, "title": "New minority gov't brings political tension in Portugal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By BARRY HATTON\nAssociated Press LISBON, Portugal (AP) - Stormy political times likely lay ahead for Portugal after a general election delivered a minority government.\nMinority governments struggle to survive in the bickering atmosphere of Portuguese politics, and only one has ever completed its four-year term. Their average life span is 14 months.\nThe center-right coalition government won Sunday's ballot despite its unpopular austerity policies and on the back of an improving economy. The Social Democratic Party and junior Popular Party collected almost 37 percent and 99 seats in Parliament, with four seats from votes abroad still to be allocated.\nBut the coalition will be outnumbered by left-of-center parties in the 230-seat Parliament where it is shy of a 116-seat outright majority. That means its planned financial austerity measures, including more pension cuts, and economic reforms risk being blocked.\nWith Portugal still recovering from its 78 billion-euro ($88 billion) bailout in 2011, the uncertainty could consign the country to a period of political paralysis and spell another bout of market jitters over the debt-heavy eurozone country.\n\"The challenge begins now,\" daily paper Diario de Noticias wrote in an editorial Monday. Another paper, Publico, said the ballot \"left the country in an impasse.\"\nThe main opposition Socialist Party, a moderate center-left force that supports eurozone financial rules, came second just over 32 percent and 85 seats and could hold the key to the government's success.\nPresident Anibal Cavaco Silva was due in coming days to invite the party with most votes to form a government. The head of state could potentially ask the left-of-center parties to take power, because together they have more seats than the incumbent government.\nBut there is a political gulf between the Socialists and the others. The Left Bloc, which got 19 seats, wants to renegotiate the national debt, demand better repayment terms from the country's creditors, and end austerity measures while increasing corporate tax. The Communist Party, which captured 17 seats, wants Portugal out of the eurozone.\nOn top of that, Socialist leader Antonio Costa said during the election campaign he would enter into a grand coalition with the incumbent government \"only if aliens land on earth.\"\nThe first major test of the new political climate will come within weeks when Parliament will have to discuss the 2016 state budget.\nCopyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-05T17:13:22.997+03:00", "highlightTitle": ""}