{"organizations": [], "uuid": "b2c23b4d95cf62ed99ec7e25d604358f1def8f38", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/", "section_title": "Ahram Online - News, Business, Culture, Sports &amp; Multimedia from Egypt ", "url": "http://english.ahram.org.eg/NewsContent/9/40/161598/Heritage/Ancient-Egypt/INTERVIEW-At-least--months-to-reattach-King-Tuts-m.aspx", "country": "EG", "title": "INTERVIEW: At least 2 months to re-attach King Tut's mask, Eckmann tells Ahram Online - Ancient Egypt - Heritage", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "INTERVIEW: At least 2 months to re-attach King Tut's mask, Eckmann tells Ahram Online - Ancient Egypt - Heritage - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "b2c23b4d95cf62ed99ec7e25d604358f1def8f38"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/9/40/161598/Heritage/Ancient-Egypt/INTERVIEW-At-least--months-to-reattach-King-Tuts-m.aspx", "ord_in_thread": 0, "title": "INTERVIEW: At least 2 months to re-attach King Tut's mask, Eckmann tells Ahram Online - Ancient Egypt - Heritage", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related VIDEO: Restoration of Tutankhamun mask underway at Egyptian Museum Egyptian Museum boss rubbishes reports of Tutankhamun gold mask damage Tutankhamun's mask leaves display for restoration at Egyptian museum In room 55 of the Egyptian Museum’s second floor, German restorer Christian Eckmann is sitting in peace examining the iconic gold mask of king Tutankhamun which lays on a wooden table like those found in operation rooms.\nWhat is the current condition of Tutankhamun’s mask?\nThe mask is in a quite stable condition and is not in any kind of danger except for the beard and its botched restoration. The mask is made of gold metal that is not corroding.\nWhat kind of study are you carrying out on the mask now before starting the restoration process?\nWe are using the chance now to gain a detailed microscopic study of the mask’s ancient manufacture technique, which has never been carried out since its discovery in 1922, to determine what materials and techniques were used. Studies to find a method to guarantee a safe removal of the epoxy resin as well as a new concept to re-attach the beard to the chin of the mask will also be carried out.\nWhat is the most critical phase of such a restoration work? And how will you remove the rigid epoxy?\nThere are some uncertainties now, we don't know how deep the epoxy resin went inside the beard, and so we don't know how long it will take to remove the beard. We are trying to do all the work by mechanical means by using wooden sticks, which work quite well at the moment. Then there is another strategy we could implement to slightly warm up the epoxy in glass to facilitate its removal as it is not soluble in anything.\nWhat is the material that the team will use to professionally re-attach the beard?\nWe don’t know yet unless we remove the beard and see exactly what the situation is inside and to what extent the epoxy resin has reached inside the beard. During the examination I realised the existence of a small gold frame at the end of the chin that could be used to attach the beard, but the frame has only a small space to support a 2.5-kg gold beard. Then a new concept is to be created to re-attach the beard.\nUpon its discovery inside the tomb, Tutankhamun’s mask was found in two pieces (the mask of the king’s face and the protruding beard), resting on the mummy’s face. The mask and beard were transported to the Egyptian Museum in Cairo, where they were exhibited as two pieces in one showcase for almost two decades. In 1946, the objects were glued together as one piece.\nHow long will the restoration project take?\nI don’t know exactly how long it will take to remove and re-attach the mask but I expect that it would take no less than two months. I am working with a skillful joint team of Egyptian and German scholars as well as from the University College in London (UCL). We must find out a professional and safe concept to restore the beard and to re-attach it in a proper way.\nWhat is your opinion concerning Egyptologist Nicholas Reeves’ theory that the mask of Tutanakhamun originally belonged to Queen Nefertiti and it is shown in the face, the earrings holes and the cartouche?\nThis hypothesis was suggested long ago but has never been profoundly investigated. We are taking this opportunity to study the technique used to manufacture the mask as well as investigating the controversial areas mentioned by Reeves (face, the holes of the ears and the cartouche) to gain more knowledge about it. Hence, until this moment, I cannot comment on this suggestion or theory until the completion of our investigations and examination.\nAncient Egyptian kings do not wear earrings. Is this why the mask belongs to Queen Nefertiti as Reeves’s theory suggested?\nI am not an Egyptologist to confirm that, but as a professional restorer I can confirm that the mummy of king Tutankhamun has holes in both of his ears and if you look in Amarna depictions you will see depressions in the ears of all males. So I cannot say definitely but I would not be surprised if you found ear holes on other depictions. This has to be cleared by a study in itself. Where do we find ear holes- on royal statues of males or females or both? I am a technician and such a study should be supported by Egyptologists.", "external_links": [], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-25T09:35:05.927+02:00", "highlightTitle": ""}