{"organizations": [], "uuid": "e363293356cae0004e67bb16c7bdf5b97db89987", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "jacksonville.com", "main_image": "http://jacksonville.com/sites/default/files/mustangs.jpg", "site_section": "http://feeds.jacksonville.com/JacksonvillecomSports#", "section_title": "Jacksonville sports news - Jacksonville.com and The Florida Times-Union", "url": "http://jacksonville.com/sports/high-schools/2015-10-15/story/high-school-football-three-week-8-games-watch", "country": "US", "title": "High school football: Three Week 8 games to watch", "performance_score": 0, "site": "jacksonville.com", "participants_count": 1, "title_full": "High school football: Three Week 8 games to watch", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T02:34:00.000+03:00", "replies_count": 0, "uuid": "e363293356cae0004e67bb16c7bdf5b97db89987"}, "author": "Times-Union", "url": "http://jacksonville.com/sports/high-schools/2015-10-15/story/high-school-football-three-week-8-games-watch", "ord_in_thread": 0, "title": "High school football: Three Week 8 games to watch", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "One of the best Gateway Conference matchups of the season is potentially for the district title. \nHIGH SCHOOL FOOTBALL \nAll games Friday at 7 p.m. unless indicated \nMANDARIN (6-0, 1-0) AT SANDALWOOD (6-1, 2-0), 1-8A \nOne of the best Gateway Conference matchups of the season is potentially for the district title, especially in the Saints’ case. Mandarin has been very consistent with backs Mekhi Jackson and Aundre Kearney supplementing a strong passing game. Sandalwood has a dual-threat QB in Eli Peters, and two good WRs in Philip Benker and RZ McCorker. With all of those vertical weapons, RB Logan Wright has been the catalyst. A Saints win would clinch no worse than a district shootout berth. Mandarin has one less district win, although a victory would put it control of its district championship destiny. \nBARTRAM TRAIL (5-2, 2-0) AT GAINES. BUCHHOLZ (5-1, 1-0), 3-7A, 7:30 \nThe Bobcats shook up the district race with a 20-14 win over Oakleaf in Week 4. Now, it’s the Bears’ turn to see if they have what it takes to contain QB Jackson White and Buchholz. There are quite a few playoff scenarios still remaining here, but Bartram can clinch no worse than a district shootout berth with a victory. A Buchholz win would almost assure the winner of the Bears’ Oct. 30 game against Oakleaf the district runner-up spot unless either Creekside or Fleming Island play a spoiler role. \n\nEPISCOPAL (4-2, 1-0) AT PROVIDENCE (1-5, 0-1), 2-3A \nDon’t let the Stallions’ record let you think this is a mismatch. Providence has loaded up on the schedule to prepare for this stretch. The winner will go to the state playoffs as the district runner-up, provided the Eagles don’t pull off a titanic upset against Trinity Christian on Oct. 29, and the Stallions don’t lose to winless Duval Charter on Oct. 30. The Eagles couldn’t stop Providence RB Jamauri Wakefield a season ago. Episcopal has more options now. The emergence of Adam Boselli catching passes has been big, while AJ Wooten and Scott Dollison have been a nice backfield complement.", "external_links": [], "published": "2015-10-16T02:34:00.000+03:00", "crawled": "2015-10-16T18:12:53.607+03:00", "highlightTitle": ""}