{"organizations": [], "uuid": "f313e4aae5fd6f190e171fc4bb543be0be275fcb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.themalaymailonline.com", "main_image": "http://www.themalaymailonline.com/uploads/articles/2015-10/engrug0410.jpg", "site_section": "http://www.themalaymailonline.com/feed/rss/sports", "section_title": "The Malay Mail Online | Sports", "url": "http://www.themalaymailonline.com/sports/article/australia-send-hosts-england-crashing-out-of-the-rugby-world-cup", "country": "MY", "title": "Australia send hosts England crashing out of the Rugby World Cup", "performance_score": 0, "site": "themalaymailonline.com", "participants_count": 0, "title_full": "Australia send hosts England crashing out of the Rugby World Cup", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T02:50:00.000+03:00", "replies_count": 0, "uuid": "f313e4aae5fd6f190e171fc4bb543be0be275fcb"}, "author": "", "url": "http://www.themalaymailonline.com/sports/article/australia-send-hosts-england-crashing-out-of-the-rugby-world-cup", "ord_in_thread": 0, "title": "Australia send hosts England crashing out of the Rugby World Cup", "locations": ["England", "Australia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Australia send hosts England crashing out of the Rugby World Cup Sunday October 4, 2015 Print Article \nEngland's Chris Robshaw (centre) looks dejected at the end of the Rugby World Cup match against Australia at Twickenham, London October 3, 2015. — Reuters pic LONDON, Oct 4 — Australia sent England tumbling into the Rugby World Cup abyss yesterday when they demolished the hosts 33-13 at Twickenham to ensure the 2003 champions would take no further part in their own tournament after the pool stage. \nFlyhalf Bernard Foley did most to break English hearts by racking up 28 points, including two sparkling tries, as Australia booked a place in the quarter-finals and took Wales through with them from Pool A. \nAustralia were well worth their win, taking a 17-3 lead in the first half and defending resolutely when a desperate England threw everything at them in the second, trying to avoid a first ever pool-stage exit. \nThe mobility of the Wallabies, epitomised by the outstanding David Pocock at number eight, always gave them an edge and while England had hoped their traditional dominance at the scrum would give them a foothold, they were bullied, battered and beaten in a remarkable turnaround in Australian set-piece technique. \n“Obviously we're very pleased,” Australia coach Michael Cheika said. “It wasn't perfect and it's just another step along the way but the commitment was very good and we'll be looking for more of that going forward.” \nWinger Anthony Watson gave England a sniff of hope with a second-half try and Owen Farrell kicked eight points as they briefly got within seven, but the flyhalf finished the match in the sin bin for a dangerous tackle on centre Matt Giteau. \nGiteau had the last laugh when he put a gloss on the score with a last-minute try, which Foley converted to take his tally with the boot to 18 points. \n“Absolutely gutted to be going out of the World Cup, words can't express how disappointed we are,” said England coach Stuart Lancaster, whose long term future will now become a daily topic of speculation. \n“Credit to Australia, they are probably one of the best sides we have played in the last 12 to 18 months.” \nRoared on by the majority of the 81,000 crowd, England had to come out firing, but it was Australia who looked faster and sharper from the whistle. \nFoley and Farrell exchanged early penalties, the Englishman squaring up the scores after 12 minutes when Australia collapsed a scrum, but while the crowd roared in anticipation of more scrum domination, it proved a false dawn. \nThe Wallabies worked their way back into the contest and after 20 minutes Foley silenced the crowd when he brushed off a tackler and shimmied his way to the line for a converted try. \nEngland's problems deepened five minutes before the break when Australia conjured up the best move of the night to score their second. \nScrumhalf Will Genia switched his pass at the last moment from a ruck 30 metres out to find Foley coming around behind him on the reverse, with Kurtley Beale on his shoulder. \nThe New South Wales Waratahs team mates exchanged passes at a pace England could only dream of to cut through the defence and Foley touched down before converting his own try. \nMatters worsened for England 10 minutes after halftime, when prop Joe Marler was penalised at the scrum and given a lecture by referee Romain Poite. \nEngland replaced him immediately but their scum was in disarray and Foley slotted the penalty to give the visitors a 20-3 lead. \nWith their tournament hopes hanging by a thread, the hosts had to strike back and six minutes later they did when winger Watson turned a half-chance into a try by accelerating through a non-existent gap. \nFarrell converted and cut the deficit still further with his second penalty after 65 minutes and with seven points in it, Twickenham ramped up the noise. \nHowever, it was Australia who regained control, stretching the lead through two more Foley penalties and Giteau's coup de grace. \nEngland now go on to a dead rubber against Uruguay in Manchester next week, while Australia and Wales will face off back at Twickenham to decide who tops Pool A. \nThey are both on 13 points with the group winners playing the runners-up in pool, probably avoiding pool B favourites South Africa and a potential semi-final against holders New Zealand. \nA draw would probably favour Australia, who have a superior points difference, though an unlikely bonus-point draw scenario could still allow Wales to top the group. — Reuters", "external_links": [], "published": "2015-10-04T02:50:00.000+03:00", "crawled": "2015-10-04T03:04:38.800+03:00", "highlightTitle": ""}