{"organizations": ["Nazarene Church", "Baker City Herald Editorial Board", "Northeast Oregon Compassion Center", "Graco Co", "Birth Center", "St. Alphonsus Medical Center-Baker City"], "uuid": "b49fe93f6d988455949a69a60bcae1aceb2a3c60", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bakercityherald.com", "main_image": "", "site_section": "http://feeds.feedburner.com/bakercityherald/LeEi", "section_title": "Baker City Herald, Baker County, OR News, Sports, &amp; Weather", "url": "http://www.bakercityherald.com/Editorials/Saving-Bakers-babies", "country": "US", "title": "Saving Baker’s babies", "performance_score": 0, "site": "bakercityherald.com", "participants_count": 0, "title_full": "Saving Baker’s babies", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T13:40:00.000+02:00", "replies_count": 0, "uuid": "b49fe93f6d988455949a69a60bcae1aceb2a3c60"}, "author": "", "url": "http://www.bakercityherald.com/Editorials/Saving-Bakers-babies", "ord_in_thread": 0, "title": "Saving Baker’s babies", "locations": ["Baker City", "Baker County", "Baker County District", "Pittsburgh"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Matt Shirtcliff", "Judith Bannon", "Shirtcliff", "Wade Swiger", "Baker"], "text": "By Baker City Herald Editorial Board October 26, 2015 12:40 pm The death of any baby is tragic. But it seems to us that there is something uniquely terrible about an infant dying not because of a malicious act but because a parent, who perhaps wanted only to cuddle the child to sleep, made a mistake. We’re writing here about co-sleeping. In 2009 three Baker County babies died from what doctors call “positional asphyxiation” that resulted from the babies sleeping near an adult. This year two other infants have died, and doctors said co-sleeping was a factor in both cases. Co-sleeping deaths not only are unintentional, they’re avoidable. In many cases, experts say, a single, relatively inexpensive item likely would have saved a life that had barely begun. A crib. That’s the basis for the Cribs for Kids program, a national campaign that, thanks to the efforts of many local residents and agencies, is coming to Baker City. The program aims to ensure that every baby born in Baker City goes home with a crib that’s safe to sleep in. Judith Bannon of Pittsburgh, Cribs for Kids founder and executive director, meet earlier this month with Baker County District Attorney Matt Shirtcliff and Wade Swiger, an investigator in Shirtcliff’s office. Cribs will be distributed at the Northeast Oregon Compassion Center at the Nazarene Church. Local groups are already collecting donations to pay for the cribs, which are available for $49.99 through Cribs for Kids’ deal with Graco Co. The cribs program is a natural complement to the existing local campaign to protect babies from co-sleeping. St. Alphonsus Medical Center-Baker City’s Birth Center explains to parents of newborns how to put their babies to sleep safely. That means in a crib with no blankets, stuffed animals or other items that can potentially cause an infant to suffocate. The hospital also sends home a free sleep sack — a garment that keeps an infant warm but doesn’t present the suffocation risk that a blanket does. We’re gratified by the response, and the sense of urgency, behind the Baker County campaign to prevent co-sleeping deaths. Unlike so many other things that threaten innocent lives, this is one that we absolutely can defeat.", "external_links": [], "published": "2015-10-26T13:40:00.000+02:00", "crawled": "2015-10-26T23:40:09.104+02:00", "highlightTitle": ""}