{"organizations": [], "uuid": "fb54de30545213a6f5d3894a5b5157715db16070", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wcax.com", "main_image": "http://WCAX.images.worldnow.com/images/9036402_G.jpg", "site_section": "http://www.wcax.com/category/283720/wildlife-watch", "section_title": "Wildlife Watch - WCAX.COM Local Vermont News, Weather and Sports-", "url": "http://www.wcax.com/story/30282571/report-shows-increase-in-rape-crimes-at-uvm-dartmouth-college", "country": "US", "title": "Report shows increase in rape crimes at UVM, Dartmouth College", "performance_score": 0, "site": "wcax.com", "participants_count": 1, "title_full": "Report shows increase in rape crimes at UVM, Dartmouth College - WCAX.COM Local Vermont News, Weather and Sports-", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "fb54de30545213a6f5d3894a5b5157715db16070"}, "author": "Jennifer Costa", "url": "http://www.wcax.com/story/30282571/report-shows-increase-in-rape-crimes-at-uvm-dartmouth-college", "ord_in_thread": 0, "title": "Report shows increase in rape crimes at UVM, Dartmouth College", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BURLINGTON, Vt. - At the University of Vermont and Dartmouth College, on campus rape reports have increased, but officials say that's a positive sign.\n\"I feel really safe on this campus,\" said Emma Waters, UVM senior.\nWaters has spent four years at UVM. The Norwich native says it's a safe place to go to school.\nThe 2015 Clery Report shows drug arrests and liquor offenses are down on UVM's campus. But reports of rape have more than doubled in a year.\n\"That's pretty scary. That makes me afraid and nervous,\" said Sarah Feiglman, UVM sophomore.\nThe annual report looks at three calendar years. Incidents are counted in the year they were reported versus when they happened.\nIn the past, sex crimes like rape, fondling and sodomy were lumped together as \"forcible sex offenses.\" But last year the category narrowed to rape alone.\nAccording to the latest numbers, there were 12 forcible sex offenses reported on campus in 2012 and 11 in 2013. That compares to 27 rapes reported in 2014.\n\"I am always concerned about the numbers. The safety of our students is our number one priority. So one is too many,\" said Annie Stevens, vice provost of student affairs at UVM.\nDartmouth College experienced a similar trend with 11 forcible sex offenses reported in 2012. That number more than doubled in 2013 and continued to rise last year with 42 rapes reported on campus.\nDartmouth officials do not believe more people are being sexually assaulted, but say the school is doing more to make victims feel comfortable coming forward.\n\"From my perspective, it's positive that we're seeing an increase in incidents that are being reported and documented in the Clery Report because it reflects more access to reporting avenues,\" said Heather Lindkvist, Dartmouth College Title IX coordinator.\nMiddlebury College, on the other hand, has seen its numbers go down with five forcible sex offenses reported on campus in 2012. That number more than tripled in 2013, then dropped to nine reported rapes last year.\nThe college released a statement saying: \"We continue to educate our campus about our sexual misconduct policies and to encourage reporting of sex offenses... It is our goal, as I think it should be for every institution, to drive those numbers down to zero.\"\n\"Rape is such an underreported crime that I believe now that we certainly have more support better awareness,\" said Stevens.\nStevens says more students are disclosing than ever before. But students seem divided on that stance.\n\"I'm sure that's part of it, but I'd be surprised if that was the only reason why they doubled,\" said Jeremy Trott, UVM senior.\n\"I hope that that's not coming from an increase in aggression and actual assault on campus. I hope that that's coming from a place people feel finally open and able to communicate these things,\" said Waters.\nThe Clery Reports strives to fill students in on how schools handle crime and resources available to victims.\nUVM 2015 Clery Report\nDartmouth College 2015 Clery Report\nMiddlebury College 2015 Clery Report", "external_links": ["http://www.middlebury.edu/system/files/media/2015_annual_security_fire_safety_report.pdf", "http://www.dartmouth.edu/sexualrespect/clery/2015_dartmouth_annual_security_report.pdf", "http://www.uvm.edu/police/reports/clery/public-safety-report.pdf"], "published": "2015-10-16T03:00:00.000+03:00", "crawled": "2015-10-17T23:36:16.437+03:00", "highlightTitle": ""}