{"organizations": ["Associated Press", "Jack Nicklaus Golf Club Korea"], "uuid": "dbdfaa2d6d27b0317579b7fc8a930e1df200501b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wpxi.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/10/08/35/ff/c57dfd4c9fb248c5a052b37789a3ed19-9586b1fd8db845658be13a2bff624ef9-0.jpg", "site_section": "http://www.wpxi.com/feeds/categories/sports/", "section_title": "News | Sports", "url": "http://www.wpxi.com/ap/ap/top-news/americans-jump-out-to-another-lead-in-presidents-c/nnxpn/", "country": "US", "title": "Americans jump out to another lead in Presidents Cup", "performance_score": 0, "site": "wpxi.com", "participants_count": 0, "title_full": "Americans jump out to another lead in Presidents Cup", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T12:14:00.000+03:00", "replies_count": 0, "uuid": "dbdfaa2d6d27b0317579b7fc8a930e1df200501b"}, "author": "", "url": "http://www.wpxi.com/ap/ap/top-news/americans-jump-out-to-another-lead-in-presidents-c/nnxpn/", "ord_in_thread": 0, "title": "Americans jump out to another lead in Presidents Cup", "locations": ["Incheon", "Australia", "INCHEON", "Japan", "South Korea"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jason Day", "Adam Scott", "Hedeki Matsuyama"], "text": "Updated: 3:19 a.m. Thursday, Oct. 8, 2015 | Posted: 3:19 a.m. Thursday, Oct. 8, 2015 Americans jump out to another lead in Presidents Cup Related View Larger International team player Hedeki Matsuyama, right, of Japan and teammate Adam Scott of Australia prepare to putt during their foursome match at the Presidents Cup golf tournament at the Jack Nicklaus Golf Club Korea, in Incheon, South Korea, Thursday, Oct. 8, 2015.(AP Photo/Woohae Cho) View Larger International team player Adam Scott of Australia watches his tee shot on the par three fifth hole during his foursome match at the Presidents Cup golf tournament at the Jack Nicklaus Golf Club Korea, in Incheon, South Korea, Thursday, Oct. 8, 2015.(AP Photo/Woohae Cho) View Larger International team player Jason Day of Australia plays a chip shot onto the sixth green during his foursome match at the Presidents Cup golf tournament at the Jack Nicklaus Golf Club Korea, in Incheon, South Korea, Thursday, Oct. 8, 2015.(AP Photo/Lee Jin-man) Sponsored Links The Associated Press INCHEON, South Korea — \nPhil Mickelson and Zach Johnson won the only match that reached the 18th hole Thursday, the final touch on another dominant day for the Americans in the Presidents Cup. \nThe rest of the foursomes matches were not much of a contest as the Americans built a 4-1 lead after the opening session. \nIt was the fifth straight time the Americans have taken the lead in the opening round of this one-sided contest, and the three-point lead was their largest margin since they had a four-point lead in 2007 in Canada. \nThe Americans are going for their sixth straight victory, and after one day at the Jack Nicklaus Golf Club Korea, there was a familiar feel to the event. \nThe South African duo of Louis Oosthuizen and Branden Grace won the only match for the International side, taking advantage of a few poor shots by Matt Kuchar to seize control on the back nine for a 3-and-2 win over Kuchar and Patrick Reed. \nIt was the first point for Grace, who went 0-4 two years ago at Muirfield Village in Ohio. \n\"I know we're behind,\" Grace said. \"But one point is better than none.\" \nEven so, this was another strong display by the U.S., which never trailed in the other four matches and has lost only one time in the Presidents Cup since it began in 1994. \nRickie Fowler and Jimmy Walker, who halved all three of their team matches at the Ryder Cup last year, finally got their first full point in the shortest match of a short day. They ran off three straight birdies early and had three more on the back nine to win, 5 and 4, over Anirban Lahiri of India and Thongchai Jaidee of Thailand. \nJordan Spieth, the No. 1 player in the world, and Dustin Johnson proved as formidable as advertised in a 4-and-3 win over New Zealand's Danny Lee and Marc Leishman of Australia. \nPerhaps the most pivotal match was the first one. Bubba Watson and J.B. Holmes, two of the longest hitters in golf, never trailed after a birdie on the second hole, though it was tight on the back nine against Australia's Adam Scott and Japan's Hideki Matsuyama. \nBy then, the Americans were ahead in three other matches, and the International team could have used a win to at least keep it close. The Americans were 1 up when Scott missed a putt to win the hole, and the U.S. pulled ahead 2 up when Matsuyama left a downhill birdie attempt short and Holmes rolled in an 8-foot birdie on No. 15. Holmes rolled in a birdie on the 16th from about 15 feet to close out a 3-and-2 win. \nJason Day tried to give the International side at least a little momentum going into Friday. Day and Australian compatriot Steven Bowditch were 2 down to Mickelson and Johnson with two holes to play when Day poured in a 40-foot birdie putt to send the match to the 18th. Bowditch hit a long iron to about 18 feet for an eagle chance, though Mickelson pounded his tee shot so far that Johnson was able to stick his approach to 10 feet. Day narrowly missed the eagle putt, and conceded the eagle to the Americans for a 2-up win. \nMickelson, who has never missed a Presidents Cup, tied a tournament record with his 11th foursomes victory. Tiger Woods also has 11 foursomes wins. \nThe format was changed this year to eliminate one match a day and reduce the total points from 34 to 30. That didn't help the International side. The way Thursday went, it might have kept the score from being worse. Copyright The Associated Press Sign up for our WPXI-TV Daily Headlines Newsletter Sign Up", "external_links": [], "published": "2015-10-08T12:14:00.000+03:00", "crawled": "2015-10-08T12:22:12.007+03:00", "highlightTitle": ""}