{"organizations": [], "uuid": "421fcdcca796810d6d6ae65e79fbdae7cc1a481f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "cjonline.com", "main_image": "http://cjonline.com/sites/default/files/images/sms-default-facebook-share.png", "site_section": "http://cjonline.com/taxonomy/term/2/feed", "section_title": "Sports", "url": "http://cjonline.com/sports/2015-10-08/expectations-elevated-royals-fans-ahead-teams-second-straight-postseason", "country": "US", "title": "Expectations elevated for Royals fans ahead of team's second straight postseason appearance", "performance_score": 0, "site": "cjonline.com", "participants_count": 1, "title_full": "Expectations elevated for Royals fans ahead of team's second straight postseason appearance", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T23:54:00.000+03:00", "replies_count": 0, "uuid": "421fcdcca796810d6d6ae65e79fbdae7cc1a481f"}, "author": "Jeremy Deckard", "url": "http://cjonline.com/sports/2015-10-08/expectations-elevated-royals-fans-ahead-teams-second-straight-postseason", "ord_in_thread": 0, "title": "Expectations elevated for Royals fans ahead of team's second straight postseason appearance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Expectations elevated for Royals fans ahead of team's second straight postseason appearance Kansas City hosts Houston in Game 1 of AL Division Series Posted: October 8, 2015 - 3:54pm By Jeremy Deckard The Capital-Journal \nKANSAS CITY, Mo. — Five hours before the first pitch of the American League Division Series opener Thursday at Kauffman Stadium, beer was on ice, charcoal was preheating and expectations for the Kansas City Royals were flying high at tailgate tents. \nRyan Land, of Lee’s Summit, Mo., perhaps summed up best the Royals’ fans feelings of excitement. \n“My expectations for them are that they win it all,” Land said. “We were one game short last season, so we have to finish it out this year.” \nAfter breaking a season attendance record — more than 2.7 million fans passed through the turnstiles at The K — and posting a 95-67 record that was tops in the American League, the Royals already have fans dreaming of potential playoff series to come. \n“We’re the best team in the American League,” said Sean Wille, a Topeka native and current Overland Park resident. “Now can (the Royals) beat the Cardinals or the Cubs? I don’t know.” \nFirst, the Royals must survive the best-of-five ALDS clash with Houston that begins at 6:37 p.m. Thursday. Kansas City also would need to beat either Toronto or Texas in the American League Championship Series before worrying about St. Louis, Chicago or the National League’s other World Series contenders. \nThe Astros, fresh off a 3-0 wild-card win against the New York Yankees, are reminiscent of the 2014 Royals — a young team excited to return to the postseason with a nothing-to-lose attitude. \n“Houston is an example of what the Royals were last year,” said Robert Cross, of Independence, Mo. “The Astros are coming in hot, but the Royals being more experienced and having better pitching will make the difference.” \nWille, a season ticket holder, shared his key to success if the Royals are to advance to the ALCS. \n“We have to score early and pitch well,” Wille said. \nTailgate partner and fellow season ticket-holder Rick Evans took Wille’s opinion a step further. \n“Nothing really scares me about Houston,” Evans said, “but I think (Royals starting pitcher Yordano) Ventura’s first inning will tell us a lot about how things are going to go.” \nHouston won four of six games against Kansas City during the regular season, outscoring the Royals 23-13 and slugging three more home runs (6-3). The Astros ranked second in the majors this season with 230 homers, only two fewer than Toronto. \n“Home runs scare me,” Topeka resident Tanner Burns said. “They hit with power and that was (what) they came here to do. I think the Royals win it in five. They are a tough team, and it should be a good series.” \nTanner’s brother Conor said home-field advantage and the Royals’ fan base in the Midwest would be the difference in the five-game series. \n“Home field means everything for this team and is what is going to pull the Royals through this series,” Conor Burns said. “I’m sure fans from all the surrounding states will be pulled in for the game. Missouri and Nebraska fans follow the Royals, and in Kansas the Royals are all we have.” \nThe difference between this year’s Royals team and the squad that made the World Series last year in its first playoff appearance in 29 years could come down to home-run pop. The Royals hit 44 more home runs in 2015 than they did in ’14 (139-95). The extra power translated to more runs as Kansas City plated 41 more runs than a season ago. \n“Last year they didn’t have the power that we have this year,” Evans said. “We had power in the playoffs last year, but this year the power has been consistent all season.” \nJeff Lippert, of Kansas City, Mo., agreed. \n“The bullpen is probably not as strong this year,” Lippert said, “but our power hitting is different from the small ball that we were playing last season.” \nTopeka native Amanda Cross, Robert Cross’ wife, suggested the experience gained from last year’s postseason run will serve as the biggest difference this year. \n“I think this team will be less nervous going into the postseason,” she said, “because they now know what to expect.” \nThe fans do, too. And make no mistake, their expectations — like those of the Royals — are soaring. \n“I think they (the Royals) have more of a chip on their shoulder this year,” Land said. “This team is more confident and they’re playing a little cockier.”", "external_links": [], "published": "2015-10-08T23:54:00.000+03:00", "crawled": "2015-10-09T03:57:55.440+03:00", "highlightTitle": ""}