{"organizations": ["Sunderland"], "uuid": "e3a983b1142b546b97da1d483c657559c2b8670a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sport.co.uk", "main_image": "http://images.sport.co.uk/150x150/3f9a29ac53b1dbe424964698db8ecef1.jpg", "site_section": "http://feeds.feedburner.com/SportcoukNewsRssFeed", "section_title": "General Sports News from Sports.co.uk", "url": "http://www.sport.co.uk/football/fabio-borini-seeks-weartyne-derby-tonic-for-sunderlands-il/6983130/", "country": "JE", "title": "Fabio Borini seeks Wear-Tyne derby tonic for Sunderland's ills", "performance_score": 0, "site": "sport.co.uk", "participants_count": 0, "title_full": "Fabio Borini seeks Wear-Tyne derby tonic for Sunderland's ills", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T13:16:00.000+03:00", "replies_count": 0, "uuid": "e3a983b1142b546b97da1d483c657559c2b8670a"}, "author": "", "url": "http://www.sport.co.uk/football/fabio-borini-seeks-weartyne-derby-tonic-for-sunderlands-il/6983130/", "ord_in_thread": 0, "title": "Fabio Borini seeks Wear-Tyne derby tonic for Sunderland's ills", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Fabio Borini"], "text": "Fabio Borini seeks Wear-Tyne derby tonic for Sunderland's ills 24 Oct 2015 10:16:57 \ncomments \nFabio Borini is hoping derby victory over Newcastle can belatedly kick-start Sunderland's season. \nThe 24-year-old Italian knows only too well how much of an impact a win against the club's arch-rivals can have, having fired them to a 2-1 success over the Magpies in October 2013 during his season-long loan spell on Wearside. \nThat was the Black Cats' first win of that Barclays Premier League campaign at the ninth attempt and two years on, they are in a similar position, winless after nine matches following last weekend's 1-0 defeat at West Brom. \nAhead of Newcastle's visit on Sunday, Borini - who must overcome an ankle problem to keep his place in the side - said: \"The three points are always important every week because that's what we need to get up the league. The first time I was here, it was an even worse situation. \n\"Obviously, we need to worry because we haven't won yet, but to have a derby in this situation and to have the possibility to win the derby is a great chance to take.\" \nSam Allardyce accepted chairman Ellis Short's offer of employment earlier this month partly because he had 30 games in which to turn the season around. \nBut while the new manager has only been in charge for one match, Borini knows the pressure is on with the season already nine matches old. \n\"It's not early days because we have played already nine games,\" he said. \"We now have 29 games to go, but if we think it is always early days, we will get to the end and we won't have many more games to recover, so the early days are finished.\" \nNewcastle ended their own wait for a first league win of the campaign with a 6-2 thrashing of Norwich last weekend, but with Sunderland having triumphed in each of the last five derbies, Allardyce believes they will have a psychological advantage. \nThe 61-year-old said: \"Yes, I would say that, but I would say there's a big boost of confidence to Newcastle's team based on last week's performance against Norwich and we still haven't managed to secure our first win. \n\"But in the past, poor form hasn't counted for anything. I don't think Sunderland were in the best of form, certainly the last three times they played Newcastle and still managed to pull off a famous victory.\" Related Sport News", "external_links": [], "published": "2015-10-24T13:16:00.000+03:00", "crawled": "2015-10-24T20:22:44.861+03:00", "highlightTitle": ""}