{"organizations": ["Phoenix Suns", "NBA", "Houston Rockets", "AP Photo/Matt York", "Markieff Morris"], "uuid": "48d8514e5def2fc8994fde8f63aa060b40ea91a7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.whio.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/10/16/93/11/08bc5d0919db41cb9d2ca6a6119ebd31-16d0bcb0859241dd90da4afa3db50999-0_1.jpg", "site_section": "http://www.whio.com/feeds/categories/sports/", "section_title": "News | Sports", "url": "http://www.whio.com/ap/ap/sports/harden-believes-houston-rockets-will-be-better-in-/nn4mN/", "country": "US", "title": "Harden believes Houston Rockets will be better in 2015", "performance_score": 0, "site": "whio.com", "participants_count": 0, "title_full": "Harden believes Houston Rockets will be better in 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T22:48:00.000+03:00", "replies_count": 0, "uuid": "48d8514e5def2fc8994fde8f63aa060b40ea91a7"}, "author": "", "url": "http://www.whio.com/ap/ap/sports/harden-believes-houston-rockets-will-be-better-in-/nn4mN/", "ord_in_thread": 0, "title": "Harden believes Houston Rockets will be better in 2015", "locations": ["HOUSTON", "Phoenix"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Terrence Jones"], "text": "Updated: 3:48 p.m. Friday, Oct. 16, 2015 | Posted: 3:48 p.m. Friday, Oct. 16, 2015 Harden believes Houston Rockets will be better in 2015 Related Houston Rockets' Terrence Jones (6) shoots over Phoenix Suns' Markieff Morris (11) during the first half of an NBA preseason basketball game, Tuesday, Oct. 13, 2015, in Phoenix. (AP Photo/Matt York) Sponsored Links The Associated Press HOUSTON — \nThe Houston Rockets reached the Western Conference finals last year for the first time since 1997 despite injuries to several key players. \nJames Harden believes they can do even more this season. \n\"If we stay healthy I think we have a pretty good shot to win it all,\" Harden said. \nHarden was a major reason for Houston's success in a season where Dwight Howard missed half the regular season with injuries, and Terrence Jones and Patrick Beverley also sat out big chunks while hurt. Harden was second in the NBA with 27.4 points a game and was the MVP runner-up to Golden State's Stephen Curry. \nHarden said he always feels like he's the best player, but that won't stop him from trying to improve. \n\"I can always grow,\" Harden said. \"I can always grow as a basketball player and as a leader. Just wanting to be the best and that comes with hard work and making sure I'm focused.\" \nThe Rockets went 56-26 to earn the second seed in the Western Conference. They won their first playoffs series since 2009 by eliminating Dallas in the first round and beat the Los Angeles Clippers in the conference semifinals. Eventual champion Golden State beat them in five games to advance to the NBA Finals. \nHarden had what was arguably his worst game of the season in Game 5 when he committed a playoff-record 13 turnovers. That performance stuck with him and he said a focus for him this season will be to limit turnovers. \nHarden's play and his beard have made him one of the NBA's most recognizable and popular players. He's reached another level of fame recently with his new $200 million contract with Adidas and rumored relationship with reality star Khloe Kardashian, who attended Houston's first home preseason game. \nHe shrugged it off when asked about the increased attention on his personal life, but he did acknowledge that he enjoys seeing fans wearing fake beards — even on the road. \n\"It's pretty dope to me,\" he said. \"It's growing every single year. It's a credit to what we built here in Houston. The winning ways.\" \nSome things to know about the Rockets as they prepare for their season-opener on Oct. 28 against Denver: \nHOWARD HEALTHY: Howard is healthy and ready to go after missing 41 games last season because of knee problems. But the center turns 30 in December and he and the Rockets know they'll have to manage his minutes to keep him fresh throughout the season. \n\"The main thing is that when I'm out there on the floor I can give the best effort for my team,\" Howard said. \nLAWSON'S CHANCE: Houston added point guard Ty Lawson in a July trade with Denver while he was in a 30-day residential treatment program following his second DUI arrest. Lawson is out of treatment now and focused on making the most of his chance with the Rockets. They're hoping he can help take some pressure off Harden with his ball-handling skills. \n\"I don't want to let my teammates down,\" Lawson said. \nBEVERLEY'S DRIVE: Beverley signed a four-year, $25 million contract to stay with the Rockets in July. Beverley started 55 games at point guard last season before having season-ending wrist surgery. He's recovered from the procedure and is eager to play again. When asked about how difficult it was to sit out so long, Beverley recounted the exact time it took for him to get healthy. \n\"Six months, nine days,\" he said. \"The longest I've ever been out. The longest basketball has ever been taken from me. So ... I'm ready to get back. I'm ready to play.\" \nTHEY'RE BACK: Houston returns almost all of its key players from last year's team aside from Josh Smith, who was signed as a free agent in December and joined the Clippers in the offseason. \nAGELESS TERRY: The Rockets re-signed 38-year-old point guard Jason Terry in the offseason after he appeared in 77 games in the regular season and started 17 games in the playoffs with Beverley injured last year. Terry, whose first NBA season was 1999, is proud to have lasted this long in the league. \n\"I am very fortunate to be headed into my 17th year. And it is great to do it here,\" he said. \"I know what I can contribute, I know what my role is and I believe that this team can do something special.\" Copyright The Associated Press Sign up for our WHIO-TV Daily Headlines Newsletter Sign Up", "external_links": [], "published": "2015-10-16T22:48:00.000+03:00", "crawled": "2015-10-16T23:14:51.238+03:00", "highlightTitle": ""}