{"organizations": [], "uuid": "d49d6b8b79d47b140240acc5596104cd867a03d9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.minnpost.com", "main_image": "http://www.minnpost.com/sites/default/files/images/articles/sano-batting_main.jpg", "site_section": "http://www.minnpost.com/section/171/rss.xml", "section_title": "Sports", "url": "http://www.minnpost.com/sports/2015/10/eight-big-positives-take-twins-half-full-half-empty-season", "country": "US", "title": "Eight big positives to take from the Twins' half-full, half-empty season", "performance_score": 0, "site": "minnpost.com", "participants_count": 1, "title_full": "Eight big positives to take from the Twins' half-full, half-empty season", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T16:18:00.000+03:00", "replies_count": 0, "uuid": "d49d6b8b79d47b140240acc5596104cd867a03d9"}, "author": "Aaron Gleeman", "url": "http://www.minnpost.com/sports/2015/10/eight-big-positives-take-twins-half-full-half-empty-season", "ord_in_thread": 0, "title": "Eight big positives to take from the Twins' half-full, half-empty season", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Aaron Gleeman | 08:18 am REUTERS/USA Today Sports/Bruce Kluckhohn He's not without flaws, including a strikeout rate that will make posting decent batting averages difficult, but Sano's power and patience are both 99th percentile skills and his debut was one of the best in Twins history. \nThere are half-full and half-empty ways to view the Twins' season. On the half-full side they won 83 games compared to a Las Vegas over/under of 72.5 and local optimism topping out around 78, emerging as a contender ahead of schedule. On the half-empty side they made plenty of decisions on playing time, player evaluation, and call-ups that seemed iffy at the time and now stand out as especially damaging within the context of missing out on a Wild Card spot by just three games. \nWhichever side you lean toward from a team-wide perspective, there's no doubt that looking at the Twins’ season from a player-by-player view leads to an abundance of half-full glasses and a few that are overflowing. I've identified eight players whose 2015 performance stood out in a very positive way, both for this season and for the Twins' long-term plans. There are more, of course, but these eight made me feel the best about what happened this season on the way to 83-79. \n• Miguel Sano : I've spent the past three months obsessively posting Sano statistical porn on Twitter , so I'll try to keep this #SanoPorn somewhat brief. Sano arrived from Double-A on July 2 as a fully formed middle-of-the-order monster and one of the most extreme Three True Outcomes bats of all time, hitting .269/.385/.530 with 18 homers, 17 doubles, 53 walks, and 119 strikeouts in 80 games at age 22. He was a revelation, shattering the typical Twins hitting mold. \nHe's not without flaws, including a strikeout rate that will make posting decent batting averages difficult, but Sano's power and patience are both 99th percentile skills and his debut was one of the best in Twins history. Actually, that's underselling it. Sano had the 12th-highest OPS (.915) in MLB history among 22-year-old right-handed hitters, taking his spot on the list directly after Hank Aaron (.923) and Alex Rodriguez (.919). His long-term potential is drool-inducing. \n• Eddie Rosario : Despite little in his 2013 or 2014 performance to suggest he was ready for the majors Rosario was the first outfielder called up when reinforcements were needed in early May and never went back to the minors. He swung at everything on the way to 118 strikeouts and 15 walks in 122 games to match the idea that he wasn't ready, but Rosario also batted .267 with 46 extra-base hits and plus defense to show Paul Molitor was right to believe in his raw talent. \nThere's no doubting Rosario's tools, which include an extremely quick bat, very good speed on the bases and in the outfield, and a strong arm that killed 16 runners when stubborn teams refused to stop testing him. None of that will mean much if Rosario can't develop some semblance of strike zone control, but in terms of debuts for 23-year-olds there was a ton to like and even with the undisciplined approach at the plate he was an above-average player as a rookie. \n• Trevor May : May was sent down to Triple-A at the end of spring training, but Ricky Nolasco immediately getting hurt opened up a rotation spot and he had the best strikeout rate, swinging strike rate, and xFIP among Twins starters through mid-July. And then the Twins moved May to the bullpen, where he took the unwanted and undeserved role change in stride and thrived as a reliever with a 2.87 ERA and 37 strikeouts in 31 innings. \nLike most starters May's velocity and raw stuff went up a tick or two as a reliever, giving him the potential to be a late-inning setup man or closer. However, he's also shown enough as a starter to think he can help the Twins more logging 200 innings in the rotation instead of 70 innings in the bullpen and May has made it clear he wants to start. Whatever happens, May took a huge step forward this season at age 25 and gives the Twins' pitching staff a much-needed building block. \n• Eduardo Escobar : For whatever reason the Twins were very hesitant to trust Escobar as their starting shortstop despite a strong 2014 in that role, first handing the Opening Day job to Danny Santana and then waiting three months to give it back to Escobar when Santana flopped. Escobar ended up starting 71 games at shortstop — along with way too many games miscast as a left fielder and designated hitter — and batted .262/.309/.445 with 12 homers and 47 total extra-base hits. \nFor his Twins career Escobar has started 187 games at shortstop and hit .281/.328/.480 in those games, which is the best shortstop production in team history and should be more than enough to make him the 2016 starter. Escobar is a free-swinger, but he's got rare power for the position and offers solid, sure-handed defense too. At age 26 he's under team control through 2018, so they may have stumbled into a shortstop solution after two decades of unsuccessful searching. \n• Tyler Duffey : Entering the year as a mid-level prospect with questions about his durability and bat-missing ability, Duffey finished it as arguably the Twins' best starter. Called up in early August as a short-term rotation patch, Duffey got knocked around by the Blue Jays in his debut and then went 5-0 with a 2.25 ERA and 52/18 K/BB ratio in 56 innings over his final nine starts while giving up just two homers in 229 plate appearances. \nDuffey was even stingier with the long ball in the minors this season, giving up just one homer in 138 innings and 559 plate appearances at Double-A and Triple-A before the call-up. Because he's not an extreme ground-ball pitcher those low homer totals figure to be somewhat of a fluke long term, but Duffey has good command of a low-90s fastball and his curveball is a swing-and-miss weapon. At age 25 he deserves a full-time shot in the Twins' rotation next season. \n• Aaron Hicks : All but left for dead as a prospect after back-to-back awful seasons in the majors, Hicks earned his way back to Minnesota by dominating Triple-A for six weeks and finally showed the skills that made him a first-round draft pick and four-time Baseball America top-100 prospect. With a revamped approach at the plate that dialed up aggression and converted passiveness into patience, he hit .256/.323/.398 with 11 homers in 97 games. \nHicks also looked much better defensively in center field, making his usual assortment of standout plays without mixing in as much shaky route-running, and went 13-for-16 stealing bases too. He slumped down the stretch and it remains to be seen if the switch-hitting Hicks can handle right-handers well enough to thrive as an everyday player, but he was an above-average all-around center fielder at age 25 and that's a remarkable turnaround given how far his stock had fallen. \n• Jose Berrios : Setting aside whether or not the Twins should have called up Berrios to the big leagues this season--in July or August would have been my preference--his performance while spending the entire year in the minors firmly established the 21-year-old right-hander as the organization's best pitching prospect since Matt Garza in 2006. Berrios began the season at Double-A, moved up to Triple-A in early July, and was one of the best pitchers in both leagues. \nOverall he threw 166 innings with a 2.87 ERA and 175/38 K/BB ratio while limiting opponents to a .223 batting average and 12 homers. His handling may have been frustrating to Twins fans, but it was a fantastic season for an excellent prospect and one that would have gotten Berrios to the big leagues in most organizations. Pitching prospects fail at a remarkably high rate, but Berrios looks MLB-ready and projects as a potential front-line starter. His development in 2015 was impressive. \n• Max Kepler : Prior to this season Kepler's prospect status was based more on his physical tools and youth than actual production, which was mostly mediocre thanks in part to a bunch of injuries keeping him off the field. That all changed in a huge way this year, as Kepler stayed healthy and crushed Double-A, hitting .322/.416/.531 with 54 extra-base hits, more walks (67) than strikeouts (63), and 18 steals to be named MVP of the Southern League at age 22. \nKepler is 6-foot-4 and significantly stronger than when the Twins signed him out of Germany as a 16-year-old in 2009, but still has enough range to occasionally play center field and figures to be a plus defender in a corner spot. Much like with Berrios, in most organizations Kepler likely would have been called up to the big leagues for more than a September cup of coffee, but regardless of that his season was a true breakout and thrusts him into the Twins' long-term plans. \nFor a lengthy discussion of the highs and lows of the Twins' season and Paul Molitor's first year as manager, check out this week's \"Gleeman and The Geek\" episode .  ", "external_links": [], "published": "2015-10-08T16:18:00.000+03:00", "crawled": "2015-10-08T22:44:19.058+03:00", "highlightTitle": ""}