{"organizations": ["Lansing State Journal"], "uuid": "d8c748b518d6e56f7be325c81bbec903da02af91", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.lansingstatejournal.com", "main_image": "http://www.gannett-cdn.com/-mm-/41fe6ae09d21e093032327224add51a841a440cc/c=0-219-4256-2613&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/10/07/Lansing/B9319170361Z.1_20151007195713_000_GI4C5RR8O.1-0.jpg", "site_section": "https://feeds.feedblitz.com/lansing/sports", "section_title": "Lansing - Sports", "url": "http://www.lansingstatejournal.com/story/sports/college/msu/2015/10/08/msu-volleyball-falls-after-fast-start-no-4-nebraska/73578300/", "country": "US", "title": "Couch: Time to bring sports betting out of the shadows", "performance_score": 0, "site": "lansingstatejournal.com", "participants_count": 0, "title_full": "Couch: Time to bring sports betting out of the shadows", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T21:56:00.000+03:00", "replies_count": 0, "uuid": "d8c748b518d6e56f7be325c81bbec903da02af91"}, "author": "", "url": "http://www.lansingstatejournal.com/story/sports/college/msu/2015/10/08/msu-volleyball-falls-after-fast-start-no-4-nebraska/73578300/", "ord_in_thread": 0, "title": "Couch: Time to bring sports betting out of the shadows", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Graham Couch"], "text": "Couch: Time to bring sports betting out of the shadows Graham Couch , Lansing State Journal 2:56 p.m. EDT October 8, 2015 Legalize it, regulate it, tax it, embrace it – it pays for so much Without gambling, interest in pro and college football within the general public would greatly diminish. (Photo: Reno Gazette-Journal file) \nNext time you attend a football or basketball game, college or pro, take a glance at the betting line before you go. And then keep an eye on the fans around you. \nNot everyone is watching the same game. \nThat seemingly meaningless fourth-quarter drive to cut the margin to 14, those two free throws in the final seconds of a 10-point game … \nLook around. There will be more than a few attentive souls, hands on heads, calculating possibilities, nervously watching. \nVictory, for more of your brethren than you probably realize, is also in covering the point spread. \nAnd college coaches and college administrators, team executives and owners, and even players — especially at the professional level — should quietly embrace it. Not take part in it. But understand the value of sports betting to their lives. \nIt’s part of what feeds them. \n“Millions and millions of dollars is being funneled to the leagues through the media companies because of people’s ability bet on the games,” said Joe Asher , CEO of William Hill US, among the world’s largest sports betting and gaming companies. \n“People are watching games because they’re able to bet on the games. Whether they’re betting legally or illegally. Therefore viewership is higher, the networks are able to get more for advertising and, in turn, they pay more for the rights to broadcast those games.” \nResearch supports this. Recent findings by Illinois professor Scott Tainsky and Texas A&M professor Steve Salaga — published in July’s Economic Letters — showed a correlation between television ratings (and revenues) and “contests where late in the game the scoring margin moves closer to the point spread.” \nIn other words, when the next Big Ten television contract helps to pay Michigan State football coach Mark Dantonio and his staff their market value, and add a few luxuries for athletes and recruits, or even pick up the tab on MSU’s wrestling program — your local bookie, who risks freedom to attend to your neighbor’s vices, deserves a pat on the back. So, too, does that offshore website that keeps your friends clearing their browser histories at work. \nIt doesn’t have to be this way. It shouldn’t. And it won’t much longer. \nSports gambling, at some point, will be legal beyond Las Vegas. It actually already is in one very bold and hypocritical form. \nWhen professional sports leagues and television networks began partnering with daily fantasy sports websites — which slither through a legal loophole by allowing betting on players instead of games — the ethical argument against legalized sports betting died on the spot. \nSomeday, it’ll be a new revenue stream for states, both in taxes and possibly tourism. Perhaps even here in Michigan. \nMSU’s football team — playing at Rutgers this weekend — is heading into a state mired in a long fight over the legalization of sports gambling. \nIn New Jersey, there is overwhelming support for sports betting — evidenced by a 2011 statewide referendum — primarily as a way to rescue Atlantic City and the state’s race tracks. Gov. Chris Christie signed a bill decriminalizing sports gambling at casinos and tracks, though still prohibiting betting on New Jersey college teams and college sporting events taking place in state. New Jersey, Monmouth Park continue sports betting fight \nBut the NFL and NCAA spearheaded an opposition. And in late August, the U.S. Court of Appeals for the 3rd Circuit ruled 2 to 1 against the state law, upholding an earlier lower-court injunction, and siding with the federal law, the Professional Amateur Sports Protection Act, on the books since 1992. \nThat law — in place before online gambling was ever imagined — gave Las Vegas a monopoly, though it did allow several existing state sports lotteries to continue. \n“During the NCAA tournament, the Super Bowl, any major sporting event, you cannot get a room in Las Vegas, and Atlantic City is a ghost town,” said New Jersey State Sen. Raymond Lesniak, who sponsored the bill Christie signed. “That’s just wrong. And that’s something we want for our tourism and our jobs and our state, as well.” \nThe economic impact could be enormous — estimated at more than $1 billion in revenue in the first year alone. \nThe argument from the NFL and NCAA is about the possibility of corruption, the threat to the integrity of their sports through point shaving. \nIt’s an asinine argument. If it’s not a problem now (as far as we pretend to know), why would it be an issue if sports gambling was legal? \n“Just like insider trading, the way to detect any any corruption is by detecting unusual betting patterns,” Lesniak said. “And the only way you can do that is bring the betting above ground and have information available to the authorities.” \nTo his point, daily fantasy sites FanDuel and DraftKings just this week banned employees from playing each other’s sites for money, after a DraftKings employee won $350,000 on FanDuel. Armour: Long-overdue, changes coming to daily fantasy sports industry \n“The NFL I believe has been driven by greed,” Lesniak continued. “They want a piece of the action. They have no problems playing four games a year at Wembley Stadium in London, where people are betting right in the stands. I think the NFL is holding out until they can try to make money on sports betting. And it seems like they’ve found their niche teaming up with fantasy sports operations.” \nAsher concurs. \n“If you’re going to do something nefarious with a sporting event, the last place you want to be placing bets is at a Nevada casino or with a legal bookmaker,” Asher said. “Because you know if we catch on, we’re going to report it. We have fairly robust procedures in place.” \nBookmakers, too, have an interest in the integrity of the event. \nAs long as most sports betting is done secretly, it’s easier to keep secrets. \nNBA commissioner Adam Silver gets it. He wrote an op-ed in the New York Times in November of last year calling for sports gambling to be legalized for many of the previously stated reasons, acknowledging that it’s a “thriving underground business that operates free from regulation or oversight.” \nHe cited an estimated $400 billion being illegally wagered annually. N.B.A. Commissioner Adam Silver: Allow Gambling on Pro Games \nGoogle “online sport books” and you’ll find plenty of options a credit card away. All offshore. None of it technically legal for U.S. residents. Barely ever enforced. \n“I believe that sports betting should be brought out of the underground and into the sunlight where it can be appropriately monitored and regulated,” Silver wrote. \nGambling — be it sports, state lotteries, online poker, riverboat or reservation casinos — all of it is dangerous to an addict or an idiot. No more potentially destructive than alcohol or smoking, or Facebook to 13-year-old. \nIt’s an adult behavior. No worse than many other adult behaviors. \nAnd it isn’t going anywhere. It’s the reason Mid-American Conference football can draw 1 million television viewers on a Tuesday in November for a game in Oxford, Ohio, with only 200 people in the stands. \nIt’s partly why Monday Night Football has been so popular since its inception — one last chance to pay off the weekend’s debts. \n“Let’s say they really get their wish,” Asher said, “that Nevada stops offering sports betting, every offshore bookmaker, every street bookmaker in Detroit or Lansing or wherever was put out of business and you really could not bet on a football game, that would be a complete disaster for the NFL. Because viewership would plummet.” \nSame for college football and basketball, which rely on television revenue more than ever. \nThis is the collision of a vice and an obsession. All at one’s fingertips. There’s no slowing it down. Might as well own it. \n“There’s lot more discussion about it from a broader community of people than you’ve ever had before,” Asher said. “Whether that translates into this year, next year, the year after that ...” \nContact Graham Couch at gcouch@lsj.com. Follow him on Twitter @Graham_Couch 27 CONNECT 41 TWEET LINKEDIN 1 COMMENT EMAIL MORE Read or Share this story: http://on.lsj.com/1Ruxpwj TOP VIDEOS", "external_links": [], "published": "2015-10-08T21:56:00.000+03:00", "crawled": "2015-10-09T09:33:50.440+03:00", "highlightTitle": ""}