{"organizations": ["Oilers"], "uuid": "147b1fef3b0db25e3aedaecb322506b02bf2f5c2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribtown.com", "main_image": "http://d1bdhkmqqz901h.cloudfront.net/1200x630/smart/s3.amazonaws.com/hne-smedia/2/c/2c4e1144568041ceb96a6fed3fbb1c2b/web_full_612773156298.jpg", "site_section": "http://www.tribtown.com//feed/sec/6000", "section_title": "TribTown.com - Sports News", "url": "http://www.tribtown.com/view/story/2c4e1144568041ceb96a6fed3fbb1c2b/HKN--Oilers-Flames", "country": "US", "title": "Connor McDavid gets first multipoint game, Oilers beat Flames 5-2", "performance_score": 0, "site": "tribtown.com", "participants_count": 0, "title_full": "Connor McDavid gets first multipoint game, Oilers beat Flames 5-2", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T09:34:00.000+03:00", "replies_count": 0, "uuid": "147b1fef3b0db25e3aedaecb322506b02bf2f5c2"}, "author": "", "url": "http://www.tribtown.com/view/story/2c4e1144568041ceb96a6fed3fbb1c2b/HKN--Oilers-Flames", "ord_in_thread": 0, "title": "Connor McDavid gets first multipoint game, Oilers beat Flames 5-2", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Connor McDavid"], "text": "Connor McDavid gets first multipoint game, Oilers beat Flames 5-2 THE ASSOCIATED PRESS   2:34   2:34   \nPeople: \nClick to view (5 Photos) \nCALGARY, Alberta — Connor McDavid showed on Saturday night what all the hype has been about. \nThis year's first-overall draft pick had two goals and an assist for the first multipoint game of his young career, and all four of Edmonton's No. 1 picks scored as the Oilers won their first game of the season, beating the Calgary Flames 5-2. \n\"Best game yet from Connor. He made an impact throughout the night,\" said Edmonton coach Todd McClellan. \"He finally let himself go and gave himself permission. Sometimes you have to do that to get after it. You don't have to, as a young player, give way to the veterans all the time. You're allowed to go out and take charge and I thought he did that tonight.\" \nMcDavid broke a 1-1 tie with 3:29 left in the second. Using Kris Russell as a screen, he beat Jonas Hiller with a long wrist shot. \nMcDavid capped the scoring with 3:40 left in the third, neatly converting Taylor Hall's pass for a power-play goal that brought boos from Flames fans and loud cheers from the many Oilers fans in attendance. \n\"First and foremost, the team played very well. When the team has success, that's when individuals start to have success,\" said McDavid, who had one goal in his first four games. \"I'm just getting more and more comfortable. It's only been five games but I'm starting to feel better about it.\" \nHall had a goal and two assists, and Ryan Nugent-Hopkins and Nail Yakupov also scored for Edmonton (1-4-0), the first time all four top picks have scored in the same game. \n\"For everyone to get on the board, to have the music playing after the game, that's what it's all about,\" Hall said. \"We can have games where we think we played well and we're close but at the end of the day, it's about wins and we need more of them.\" \nDavid Jones scored both goals for Calgary (1-4-0). The Flames had won seven in a row against their provincial rival. \n\"That was a team hungry for a win and they showed that tonight. We just got outplayed, plain and simple,\" said Jones, who leads the team with three goals. \"I don't think we took them lightly. I just don't think the effort was there.\" \nHall made it 3-1 just 25 seconds into the third period, and shortly after, Yakupov scored on a play that began with McDavid stripping the puck from Flames captain Mark Giordano. \n\"It starts with myself and it goes down the line. We just have to be better,\" Giordano said. \"They won a lot of battles, they put pucks to the net and they basically deserved to win that game and we didn't.\" \nCalgary coach Bob Hartley expressed his frustration after the game. \n\"We didn't even show up,\" Hartley said. \"Our compete level is not there. Our game right now is not there. Tonight we got outplayed, we got outworked, we got outhustled. You have no chance to win in this league when you're like this.\" \nEdmonton had averaged 34.5 shots against, but on this night, Cam Talbot only had to make 22 stops to win his first game as an Oiler. \nHiller had 23 saves for the Flames. \nNotes: McDavid's parents were in attendance. ... The last time Calgary lost its first three games at home was 2000-01. ... Calgary's Sam Bennett (upper body) did not play. Markus Granlund made his season debut in his place. ... The Oilers made one line-up change at forward with Rob Klinkhammer drawing in for Russian rookie Anton Slepyshev. ... The Oilers play Sunday night in Vancouver. \n ", "external_links": [], "published": "2015-10-18T09:34:00.000+03:00", "crawled": "2015-10-18T11:36:12.788+03:00", "highlightTitle": ""}