{"organizations": [], "uuid": "ea38b4805a182c1e500e6e61317fb35c41c2ea43", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "wtop.com", "main_image": "http://wtop.com/wp-content/uploads/2015/10/Italy-Soccer-Champions-League.jpeg", "site_section": "http://wtop.com/section/sports/feed/", "section_title": "WTOP » Sections » Sports", "url": "http://wtop.com/sports/2015/10/fiorentina-stays-top-despite-loss-to-napoli-as-inter-draws/", "country": "US", "title": "Fiorentina stays top despite loss to Napoli as Inter draws", "performance_score": 0, "site": "wtop.com", "participants_count": 1, "title_full": "Fiorentina stays top despite loss to Napoli as Inter draws", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T00:26:00.000+03:00", "replies_count": 0, "uuid": "ea38b4805a182c1e500e6e61317fb35c41c2ea43"}, "author": "wtopstaff", "url": "http://wtop.com/sports/2015/10/fiorentina-stays-top-despite-loss-to-napoli-as-inter-draws/", "ord_in_thread": 0, "title": "Fiorentina stays top despite loss to Napoli as Inter draws", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Home » News » Sports » Fiorentina stays top despite… Fiorentina stays top despite loss to Napoli as Inter draws By DANIELLA MATAR October 18, 2015 5:26 pm Inter Milan's Mauro Icardi reacts as Juventus' Andrea Barzagli stands in background, during their Serie A soccer match at the San Siro stadium in Milan, Italy, Sunday, Oct. 18, 2015. (AP Photo/Luca Bruno) \nMILAN (AP) — Fiorentina stayed top of Serie A despite losing 2-1 at Napoli on Sunday, after title rival Inter Milan was held to a 0-0 draw by Juventus. \nBoth Inter and Juventus hit the woodwork and had several other chances in an entertaining match at a packed San Siro. It was only the second match of the 80 games played in Serie A this season to finish goalless. \nIn Naples, Lorenzo Insigne’s stellar start to the season continued as the forward — who had to pull out of the Italy squad last week through injury — opened the scoring in the first minute of the second half with his sixth goal of the campaign, setting a new personal record. \nInter is third, a point behind Fiorentina and below Roma on goal difference. \nNapoli moved into fourth place, three points behind Fiorentina, and above Lazio on goal difference after the capital side lost 2-1 at Sassuolo — which also now has 15 points. \nAtalanta was a point further back after easing past Carpi 3-0. \nElsewhere, substitute Panagiotis Tachtstidis — who had only just come off the bench — scored a stoppage-time winner as 10-man Genoa snatched a 3-2 win over Chievo Verona. \nNewly-promoted Frosinone beat Sampdoria 2-0 and Hellas Verona drew 1-1 against Udinese, while Palermo won 1-0 at bottom side Bologna in the lunchtime kickoff. \nThere was a heated atmosphere at a sold-out San Siro, with almost 80,000 vociferous fans packing the stadium for the eagerly-anticipated match. \nThere is no love lost between the two clubs and the bitter rivalry among fans is longstanding. \nJuventus came agonizingly close last season to joining Inter as the only Italian clubs to have won the treble of the league, cup and Champions League trophies, but it failed with the last piece of the puzzle as it lost to Barcelona in Berlin. \nInter fans taunted Juventus about that in their pre-match choreography as they unfurled a giant cutout of the Champions League trophy above a banner with the words “Berlin, 06.06.2015 … you almost did it.” \nThey then depicted all three trophies below a banner saying “keep dreaming” and above a giant picture of three cartoon thieves. \nThe intensity of the rivalry off the pitch was reflected on it as four players were booked inside the first 16 minutes. \nJuventus had the first chance of the match when Inter goalkeeper Samir Handanovic denied Juan Cuadrado at the near post. \nBut it was Inter that went closest in the first half in a fierce five-minute spell. The home fans clamored for a penalty when a cross struck Leonardo Bonucci on the arm — but Ivan Perisic had nodded it onto the Juventus defender from point-blank range. \nStevan Jovetic and Mauro Icardi also went close, while Juventus goalkeeper Gianluigi Buffon tipped Marcelo Brozovic’s curler onto the crossbar. \nCuadrado and Jovetic had further shots after the break, while Sami Khedira had the best chance of the match when he was played in by Alvaro Morata and should have given Juventus the lead — only for his effort to hit the left upright. \nFiorentina was two points clear at the top of the table coming into the match, having won six of its seven games. But Napoli was also full of confidence after a 4-0 victory at AC Milan last time out. \nFiorentina started brightly and went close to taking the lead in the 17th minute but Pepe Reina did well to deny Jakub Blaszczykowski with a one-handed diving save. \nNapoli could have gone in front on the stroke of halftime as Gonzalo Higuain’s header from Insigne’s cross flew just wide of the right-hand post. \nIt did take the lead just 43 seconds after the break, when Insigne burst past Nenad Tomovic down the left and ran onto Marek Hamsik’s deep ball before cutting in to fire a low shot into the bottom right corner. \nNikola Kalinic leveled with a similar goal in the 73rd minute, outsprinting the Napoli defenders and running onto a brilliant Josip Ilicic ball over the top, to score his fifth goal in eight Serie A matches. \nBut Napoli was back in front just two minutes later when Higuain beat Ilicic to the ball, played a swift one-two with Dries Mertens and fired past Fiorentina goalkeeper Ciprian Tatarusanu. \n___ \n(An earlier version of this story gave an incorrect figure for the number of goalless matches in Serie A this season. The correct figure is two.) Topics:", "external_links": [], "published": "2015-10-19T00:26:00.000+03:00", "crawled": "2015-10-19T01:06:23.426+03:00", "highlightTitle": ""}