{"organizations": [], "uuid": "9910b3be49c090587d7d3470e5bccd75bd4d5861", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thestar.com", "main_image": "http://www.thestar.com/content/dam/thestar/sports/raptors/2015/10/26/hosting-all-star-game-proof-raptors-have-arrived/nba-all-star-wiggins.jpg", "site_section": "http://www.thestar.com/sports/raptors.html", "section_title": "Raptors | Sports | Toronto Star", "url": "http://www.thestar.com/sports/raptors/2015/10/26/hosting-all-star-game-proof-raptors-have-arrived.html", "country": "CA", "title": "Hosting all-star game proof Raptors have arrived", "performance_score": 0, "site": "thestar.com", "participants_count": 1, "title_full": "Hosting all-star game proof Raptors have arrived | Toronto Star", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T02:00:00.000+02:00", "replies_count": 0, "uuid": "9910b3be49c090587d7d3470e5bccd75bd4d5861"}, "author": "Chris O’Leary", "url": "http://www.thestar.com/sports/raptors/2015/10/26/hosting-all-star-game-proof-raptors-have-arrived.html", "ord_in_thread": 0, "title": "Hosting all-star game proof Raptors have arrived", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "It’s taken 20 years for Toronto to get the chance to host the NBA all-star game, but David Hopkinson thinks the timing is perfect.\nThe chief commercial officer for Maple Leaf Sports and Entertainment, Hopkinson has been a Raptors’ employee from day one. It’s been a generational wait, but February’s showcase comes at the perfect time, he said.\nThe all-star game will be play on Sun. Feb. 14 at the Air Canada Centre.\n“From our launch in 1995, it took longer for the Raptors to arrive than I would have liked, or any of us would have liked,” he told the Star recently. “With back-to-back seasons of franchise-record wins, back-to-back Atlantic Division championships and a team we believe is only going to get better, this year is the right time for the all-star game to come in here.”\nThe first all-star game played outside of the United States won’t be a celebration of the kitschy Canadiana you might find in tourist stores. The weekend will show Toronto as a leader in basketball, the game’s culture and how it has become a trendsetting city in North America.\n“It’s going to be reflective of what Toronto is now — which is a very large, very diverse, very global city,” Hopkinson said. “When you look at where culture is being generated in North America right now, a lot of the experts will say it’s being generated principally in three locations: Toronto, L.A. and New York.\n“The top names in music right now, there are a lot of Canadians there, and not only Canadians, a lot of Torontonians. Drake is from here, (Justin) Bieber is from here, the Weeknd is from here,” he said. “It’s an unbelievable amount of talent we’re producing, and I think it’d be a great opportunity to celebrate music and local talent has playing on a global stage.”\nCanadians also are increasingly spreading through NBA rosters as well.\nHopkinson sees the 13 Canadians in the league as a tie-in with the Raptors’ arrival.\nThere are two on the Raptors’ roster: guard Cory Joseph and forward Anthony Bennett.\n“When we founded the franchise . . . we had a dream that one day the kids that were coming to our games at 7 and 8 years old would one day be NBA stars,” he said. “It took a long time, and yet here we are.”\nIt’s a no-brainer for the NBA to include Thornhill’s Andrew Wiggins in the weekend’s festivities. The reigning rookie of the year is at the start of his second season with the Minnesota Timberwolves and is the leader of Canada’s wave of next-generation basketball talent.\n“I think we’re seeing the growth of the game from coast to coast, and not only the popularity of the game but the growth of the talent to heights we’ve never conceived of,” Hopkinson said.\n“It’s part of why I think we’ve arrived.”\nSumo wrestlers run the 100 meter dash", "external_links": ["http://static.freeskreen.com/publisher/52/freeskreen.min.js"], "published": "2015-10-26T02:00:00.000+02:00", "crawled": "2015-10-26T18:08:44.292+02:00", "highlightTitle": ""}