{"organizations": [], "uuid": "6818073b47c78970c2b1aea0a937d4069780e9e7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "accesswdun.com", "main_image": "http://bf19d0142b960c98204c-6849f9022b05f72b83236695aa4e9a0a.r50.cf2.rackcdn.com/uploads/articles/2015/341287/roddy-white-texans-2015_p3.jpg", "site_section": "http://accesswdun.com/rss/3/rss.xml", "section_title": "AccessWDUN.com Sports", "url": "http://accesswdun.com/article/2015/10/341287/falcons-roddy-white-upbeat-after-meeting-with-quinn", "country": "US", "title": "Falcons' Roddy White upbeat after meeting with Quinn", "performance_score": 0, "site": "accesswdun.com", "participants_count": 1, "title_full": "Falcons' Roddy White upbeat after meeting with Quinn", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T18:32:00.000+03:00", "replies_count": 0, "uuid": "6818073b47c78970c2b1aea0a937d4069780e9e7"}, "author": "The Associated Press", "url": "http://accesswdun.com/article/2015/10/341287/falcons-roddy-white-upbeat-after-meeting-with-quinn", "ord_in_thread": 0, "title": "Falcons' Roddy White upbeat after meeting with Quinn", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Friday October 9th, 2015 4:01AM Posted 10:32AM on Friday 9th October 2015 ( 6 hours from now ) Falcons' Roddy White upbeat after meeting with Quinn Atlanta Falcons wide receiver Roddy White (84) makes the catch against Houston Texans cornerback A.J. Bouye (34) during the first half of an NFL football game, Sunday, Oct. 4, 2015, in Atlanta. photo: Associated Press Related Articles \nFLOWERY BRANCH (AP) — Atlanta Falcons receiver Roddy White returned to the team Thursday and said he was encouraged about his role following a meeting with coach Dan Quinn. \nThe receiver said he missed Wednesday's practice to be with his mother, who had surgery. \nWhite, the Falcons' all-time leading receiver, is only fifth on the team with six catches this season. He complained about his diminished role earlier in the week but downplayed those comments on Thursday. \n\"It's really not a controversy,\" White said. \"My role is what it is. I've talked to DQ and we've gotten past that.\" \nThe Falcons (4-0) have relied on receiver Julio Jones, who leads the NFL with 38 catches, and dual-threat running back Devonta Freeman. White has only two catches the last three games. \nWhite, 33, said he's taking a positive outlook into Sunday's game against the Washington Redskins. He said he expects more opportunities as defenses key on Jones. He also said he understands he must be patient for the first time in his 11 seasons. \n\"Certain times you've got to sit back and just be patient and I haven't been very patient around here for the time I've been around here ... because I've been getting a lot of passes thrown to me,\" White said. \nOn Wednesday, Quinn said \"the opportunities will be there going forward\" for White. \nWhite met with Quinn before Thursday's practice. White said the two talked \"about football and my role in the offense and what it's going to be.\" \n\"It was a much-needed conversation and I walked out of there with my head up,\" White said. \"It went well. It went really, really well.\" \nWhite holds franchise records for career catches, yards receiving and touchdown catches. \nJones, Leonard Hankerson, Freeman and tight end Jacob Tamme have more catches than White. Running back Tevin Coleman is expected to return from a rib injury this week, giving quarterback Matt Ryan yet another target. \n\"We've only got one football around here and we've got a lot of play-makers,\" White said. \"We've got to find a way to get the ball to everybody.\" \nJones said Thursday he believes White's criticism of his role in the offense was taken out of context. \n\"He's going to do what he needs to do to help the team win,\" Jones said. \nRyan said Wednesday White has \"always been professional, and one of the best teammates I've been around.\" \nWhite said his mother's surgery went well. \n\"She played such a big role in me being where I am today, so it was important for me to be there with her,\" he said. \nNOTES : LB Justin Durant (elbow) was the only player to miss practice. Quinn said he is fully confident Coleman is ready to play and \"was chomping at the bit\" to get back in a game. Asked about Freeman sharing carries with Coleman, Quinn said \"I think that was the plan\" since the team drafted Coleman this year. The Associated Press The Associated Press is an American multinational nonprofit news agency headquartered in New York City. The AP is owned by its contributing newspapers, radio, and television stations in the United States, all of which contribute stories to the AP and use material written by its staff journalists.", "external_links": [], "published": "2015-10-09T18:32:00.000+03:00", "crawled": "2015-10-09T11:05:02.328+03:00", "highlightTitle": ""}