{"organizations": [], "uuid": "d60e58b91e6c701c6df84feeebcbd907562aa804", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kctv5.com", "main_image": "http://kctv.images.worldnow.com/images/470335_G.JPG", "site_section": "http://kctv5.com/category/208603/sports?clienttype=rss", "section_title": "KCTV Kansas City - Sports", "url": "http://www.kctv5.com/story/30329386/chiefs-celebrating-american-indian-heritage-month-on-sunday", "country": "US", "title": "Chiefs celebrating American Indian Heritage Month on Sunday", "performance_score": 0, "site": "kctv5.com", "participants_count": 1, "title_full": "Chiefs celebrating American Indian Heritage Month on Sunday - KCTV5", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T20:16:00.000+03:00", "replies_count": 0, "uuid": "d60e58b91e6c701c6df84feeebcbd907562aa804"}, "author": "Melonne Mack, Intern", "url": "http://www.kctv5.com/story/30329386/chiefs-celebrating-american-indian-heritage-month-on-sunday", "ord_in_thread": 0, "title": "Chiefs celebrating American Indian Heritage Month on Sunday", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "KANSAS CITY, MO (KCTV) - The Kansas City Chiefs and the American Indian Community Working Group are celebrating American Indian Heritage Month on Sunday at Arrowhead Stadium.\nThere will be events before the Chiefs take on Pittsburgh.\nThe Chiefs and the American Indian group initially partnered last year in an effort to raise awareness of American Indian heritage and history.\n\"With their help and guidance, we are continuing to build on our goal of educating our fans and creating awareness of American Indian history and within the Chiefs kingdom,\" Chiefs president Mark Donovan said.\nThe group will have a table outside of Gate G in the Ford Fan Experience area. A representative will provide all information and cultural awareness. \n\"This is an ongoing journey and we believe we are moving in a positive direction,\" said Gena Timberman, member of the Choctaw Nation of Oklahoma and American Indian Community Working Group liaison to the Chiefs.\nAmerican-Indian members will participate in a number of moments before the game including the presentation of the colors.\nThe national anthem will be performed by members of the Chicksaw Nation Youth Choir. A drum mallet will be presented to former Chiefs player, Tony Gonzalez, and an honor song will be performed during the pregame. \nTribes attending the game include Citizen Potawatomi Nation, Chickasaw Nation, Kaw Nation, Modoc Tribe, Peoria Tribe, Quapaw Tribe, Shawnee Tribe and Wyandotte Nation. \nCopyright 2015 KCTV (Meredith Corp.) All rights reserved", "external_links": [], "published": "2015-10-22T20:16:00.000+03:00", "crawled": "2015-10-24T05:12:48.942+03:00", "highlightTitle": ""}