{"organizations": ["Atlanta Braves"], "uuid": "8387ab1e5c1973ac3d4f23c71f4d2461217521b0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.citizen-times.com", "main_image": "http://www.gannett-cdn.com/-mm-/c67ba9f4ad7747b407dc364370c64972128df9e2/c=0-142-404-370&amp;r=x633&amp;c=1200x630/local/-/media/2015/07/23/CarolinaGroup/Asheville/635732377904934740-maybin.jpg", "site_section": "http://rssfeeds.citizen-times.com/asheville/sports", "section_title": "Asheville - Sports", "url": "http://www.citizen-times.com/story/sports/baseball/2015/09/30/despite-2nd-half-slump-maybin-revived-career-2015/73089282/", "country": "US", "title": "Despite 2nd-half slump, Maybin revived career in 2015", "performance_score": 0, "site": "citizen-times.com", "participants_count": 0, "title_full": "Despite 2nd-half slump, Maybin revived career in 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T19:54:00.000+03:00", "replies_count": 0, "uuid": "8387ab1e5c1973ac3d4f23c71f4d2461217521b0"}, "author": "", "url": "http://www.citizen-times.com/story/sports/baseball/2015/09/30/despite-2nd-half-slump-maybin-revived-career-2015/73089282/", "ord_in_thread": 0, "title": "Despite 2nd-half slump, Maybin revived career in 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Roberson", "Cameron Maybin", "Maybin", "Bob Berghaus"], "text": "Despite 2nd-half slump, Maybin revived career in 2015 Bob Berghaus , bberghaus@citizen-times.com 8 p.m. EDT September 30, 2015 Roberson alum Cameron Maybin is the starting center fielder for the Atlanta Braves. (Photo: ASSOCIATED PRESS) 3 CONNECT 5 TWEET LINKEDIN COMMENT EMAIL MORE \nEvaluating Cameron Maybin’s first season with the Atlanta Braves comes down to this: \nHe was very, very good in the first half and had a dramatic decline after the All-Star break. \nThe former Roberson High standout, the 10th overall pick in the 2005 MLB Draft, was acquired by Atlanta from San Diego a day before the start of the regular season. After struggling for the first month when he was platooning in center field, he got the everyday job and took off. \nDuring the first half Maybin had a .289 average with eight home runs and 44 runs batted in. \nThe second half has been a considerably different story. \nThrough Tuesday Maybin, 28, was hitting .235 since the All-Star break with two homers and 14 RBIs. That’s disappointing until you look at the Braves as a whole for the second half. \nAtlanta had a 42-47 record at the break and scored 337 runs, or nearly 4 runs per game. \nSince the All-Star break Atlanta has gone 21-47 and has scored an MLB-low 212 runs, or just 3 per game. Since the break, they have scored three or fewer runs in 45 of 67 games and two or fewer runs 33 times. They will likely be the only team to finish with fewer than 600 runs for the season. \nThe Braves’ overall record of 53-94 is very disappointing, especially after they played close to .500 in the first half. \nThat Maybin went through a prolonged slump was not a surprise since he has done so almost every year since he arrived in the majors in 2007. \nDespite that, there are reasons to be optimistic about his future. \nHe’s hitting .266, 16 points above his career average of .250 and slightly higher than his average of .264 in 2011 with the Padres, his best in a season in which he played 50 or more games. \nMaybin’s 10 home runs and 58 RBIs are career highs. He also has a career-high 45 walks. \nPerhaps the most impressive number is the lack of strikeouts. Maybin has 98 in 493 at-bats, just under one for every five at-bats (19.88 percent). \nBefore this season he had averaged slightly more than one in every four at-bats, or 25.2 percent. \nThat’s a big difference and a credit to Maybin’s ability to change and the guidance he received from Braves hitting coach Kevin Seitzer. \nIt will be interesting to see what the Braves do with Maybin during the off-season. He’s scheduled to make $8 million next season, relatively cheap by today’s standards. Maybin could draw interest on the trade market. The Braves also could decide to stick with him, knowing they have stability in the center of the outfield. \nRegardless, Maybin showed again that he can be a productive player. He just needs more consistency. \nThis is the opinion of Citizen-Times sportswriter Bob Berghaus. Follow him on Twitter @Bob_Berghaus 3 CONNECT 5 TWEET LINKEDIN COMMENT EMAIL MORE Read or Share this story: http://avlne.ws/1KLxfOw TOP VIDEOS", "external_links": [], "published": "2015-09-30T19:54:00.000+03:00", "crawled": "2015-10-01T03:56:30.213+03:00", "highlightTitle": ""}