{"organizations": [], "uuid": "0b96b93df6ea15acc2008f7ad3b916c2ce1d93de", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "mdjonline.com", "main_image": "http://matchbin-assets.s3.amazonaws.com/public/sites/624/thumbs/B4T6_rgbMHS_vs_MCE_04.jpg", "site_section": "http://mdjonline.com/rss/rss/Sports?instance=Sports&content_type=article&tags=sports&tag_inclusion=or&offset=0&limit=10&page_name=rss", "section_title": "Sports", "url": "http://mdjonline.com/bookmark/26890417", "country": "US", "title": "Marietta's bid for upset of McEachern falters after halftime break", "performance_score": 0, "site": "mdjonline.com", "participants_count": 1, "title_full": "Marietta's bid for upset of McEachern falters after halftime break", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T10:21:00.000+03:00", "replies_count": 0, "uuid": "0b96b93df6ea15acc2008f7ad3b916c2ce1d93de"}, "author": "Greg Oshust MDJ Sports Correspondent (noreply@mdjonline.com)", "url": "http://mdjonline.com/bookmark/26890417", "ord_in_thread": 0, "title": "Marietta's bid for upset of McEachern falters after halftime break", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Marietta's bid for upset of McEachern falters after halftime break by Greg OshustMDJ Sports Correspondent The Marietta Daily Journal  21 AM | 90 views | 0 | 3 | | Marietta’s Josh Stewart, front, gets stuffed by McEachern’s Courtney Mills after making a catch in Friday’s game at Northcutt Stadium. After a tight first half, the Indians pulled away in the second to remain within striking distance of the Region 4 lead. Staff photo by Kelly J. Huff slideshow MARIETTA — Marietta stayed within striking range of McEachern in the first half, but the sixth-ranked Indians used their superior firepower to pull away in the second half for a 27-10 Region 4 victory at Northcutt Stadium.McEachern (4-1, 1-0) drove into the red zone a number of times, but it couldn’t convert those opportunities into touchdowns. Instead it was held to two field goals in the first half on a rain-soaked field.The Indians began to assert their control in the second half, however, as Courtney Mills’ 40-yard interception return for a touchdown helping to put the finishing touches to their win.“We couldn’t convert in the red zone,” McEachern coach Kyle Hockman said. “We moved the ball up and down the field and just couldn’t finish in the red zone. But our kids played their butts off, as they have all year, and that’s what spurred us in the second half.”The Indians remained one of two unbeaten teams in region play, along with North Cobb, who they host next week.Marietta coach Scott Burton was proud of his team’s effort.“I’m proud of our character, but we’re not into moral victories,” Burton said. “I told the kids, ‘You’ve got to keep chopping, keep swinging the axe and, sooner or later, the tree will fall. You quit swinging when you see what looks like a big tree and you’ll never know how many more swings it will take to cut the tree down.’ We put up and good effort in a tough situation, but I’m also encouraged that they never put their axe down. They kept swinging.”After McEachern started its first offensive series on its own 41-yard line, a 30-yard pass from Bailey Hockman to Jamaan Brown moved the ball to the Marietta 29, and a 14-yard run by Tyler Simmons brought the ball to the Blue Devils’ 15.McEachern, however, couldn’t advance the ball any further and was forced to settle for a 28-yard field goal by Cesar Dominguez with 8:24 remaining in the first quarter.McEachern recovered a fumbled snap by Marietta quarterback Malachi Diggs on the next series and recovered the ball at its own 24-yard line with 5:34 left in the first quarter.The Indians proceeded to march down the field to the Marietta 19, but their drive stalled once again, and Dominguez missed a 29-yard field goal attempt with 1:32 left in the first quarter.McEachern appeared to have another golden opportunity to reach the end zone on its next offensive series as it drove down to the Marietta 15, but the Indians were again stopped and settled for a 29-yard Dominguez field goal with 8:07 remaining in the first half to increase their lead to 6-0.McEachern made yet another drive deep into Marietta territory on its last play of the first half when it reached the Blue Devil 23, but Marietta (1-5, 0-2) again held off the Indians as Dominguez missed a 40-yard field goal attempt with 45 seconds left in the half.Marietta appeared on the verge of turning the game around on the first series of the second half, when Terrell Myers intercepted Hockman and the Blue Devils took the ball over at their own 24 with 11:11 remaining in the third quarter.But Mills returned the favor when he intercepted Diggs and ran it back 40 yards for the touchdown. Dominguez added the extra point to make it 13-0 with 10:16 left in the third quarter.Marietta closed the gap to 13-7 as Diggs threw a 37-yard pass to Jordan Dukes to set up a 1-yard touchdown run by Michael Spencer, followed by Luke Mozley’s kick.McEachern, however, pulled away in the fourth quarter on a 10-yard touchdown run by Simmons with 10:09 remaining in the game and a 2-yard scoring scamper by Sam Jackson with 4:59 left. Share This Article | similar stories McEachern rolls with Marietta in region battle at new Northcutt | 1 day 2 hrs ago by Adam Carrington acarrington@mdjonline.com", "external_links": [], "published": "2015-10-03T10:21:00.000+03:00", "crawled": "2015-10-03T09:51:58.991+03:00", "highlightTitle": ""}