{"organizations": [], "uuid": "505a4801e12fdebb0d6ee2ce44ba60128abe0cd5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.local8now.com", "main_image": "http://media.graytvinc.com/images/560*315/Dobbs3.jpg", "site_section": "http://www.local8now.com/sports/headlines/index.rss2", "section_title": "WVLT Sports Overtime", "url": "http://www.local8now.com/sports/headlines/Josh-Dobbs-named-Davey-OBrien-Quarterback-of-the-Week-332573042.html", "country": "US", "title": "Josh Dobbs named Davey O'Brien Quarterback of the Week", "performance_score": 0, "site": "local8now.com", "participants_count": 0, "title_full": "Josh Dobbs named Davey O'Brien Quarterback of the Week", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T01:58:00.000+03:00", "replies_count": 0, "uuid": "505a4801e12fdebb0d6ee2ce44ba60128abe0cd5"}, "author": "", "url": "http://www.local8now.com/sports/headlines/Josh-Dobbs-named-Davey-OBrien-Quarterback-of-the-Week-332573042.html", "ord_in_thread": 0, "title": "Josh Dobbs named Davey O'Brien Quarterback of the Week", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Davey O'Brien", "Josh Dobbs"], "text": "Josh Dobbs named Davey O'Brien Quarterback of the Week Posted: Tue 6:58 PM, Oct 13, 2015 / Headlines List / Article \nKNOXVILLE, Tenn. (UTSports.com)-- After steering Tennessee to one of the largest comeback wins in school history, junior Joshua Dobbs has been named the Davey O'Brien Quarterback of the Week for week six of the college football season. \nDobbs has received numerous honors this week for his outstanding play in Tennessee's 38-31 comeback win over No. 19/16 Georgia on Saturday when he accounted for 430 yards and five touchdowns (three passing, two rushing). On Monday he was named the SEC Offensive Player of the Week. Dobbs was also named the Offensive Player of the Week by Athlon Sports, picked as a nominee for the Capital One Impact Performance of the Week and named one of eight quarterbacks to receive the Manning Award \"Stars of the Week.\" \nAdditionally, he was named the Tennessee Sports Writers Association Offensive Player of the Week. \nFans can vote for Dobbs as the Capital One Impact Performance of the Week here. Dobbs' competition in the polling includes TCU's Trevone Boykin, Florida State's Dalvin Cook, and Washington State's Luke Falk.The Volunteers trailed 24-3 in the first half before rallying to upend the Bulldogs and equal the third-largest comeback in program history. \nDobbs went 25-for-42 for a career-high 312 passing yards and three touchdowns and also ran for 118 yards and two scores to lead Tennessee to a 38-31 comeback win over No. 19/16 Georgia on Saturday at Neyland Stadium. His performance marked just the second time in UT history that a Vols quarterback had thrown for 300 yards and rushed for 100 yards (he previously accomplished the feat last year against South Carolina). \nHis 430 total yards was the fifth-best total yards mark in Tennessee history. Dobbs now holds the fourth and fifth-best performances in program history. Tyler Bray holds the school record with 530 total yards against Troy in 2012. Peyton Manning has a hold on second and third spots on the list with 508 against Kentucky in 1997 and 475 against Florida in 1996. Dobbs' performances are the only ones to include positive rushing yards, as Manning was in the negative in both games and Bray had no rushes and no sacks in his record day. \nThe native of Alpharetta, Ga., currently ranks 20th nationally with 84 points responsible for. In six games, he has totaled 13 touchdowns (eight passing, five rushing and one receiving). \nA member of the Davey O'Brien Award's preseason watch list, he is the second consecutive SEC quarterback to take home the weekly honor and the fourth winner from the league in the past 13 weeks dating back to last year. \nAll 128 FBS quarterbacks are eligible for the weekly award, which is determined by a subset of the Davey O'Brien National Selection Committee. The other \"Great 8\" quarterbacks in week six were: Trevone Boykin of TCU, Michigan State's Connor Cook, Brandon Doughty of Western Kentucky, Luke Falk of Washington State, Northern Illinois' Drew Hare, Bowling Green's Matt Johnson and Patrick Mahomes of Texas Tech.The Davey O'Brien National Quarterback Award winner will be announced on Dec. 10 during ESPN's The Home Depot College Football Awards. The winner is not required to have won a weekly award during the season. A list of 16 semifinalists for the award will be announced on Nov. 2, while the three finalists will be named on Nov. 24. \n2015 Week-by-Week WinnersSept. 9 - Josh Rosen (UCLA) Sept. 15 - Matt Johnson (Bowling Green) >Sept. 22 - Baker Mayfield (Oklahoma) Sept. 29 - Trevone Boykin (TCU) Oct. 6 - Will Grier (Florida) Oct. 13 - Joshua Dobbs (Tennessee)", "external_links": [], "published": "2015-10-14T01:58:00.000+03:00", "crawled": "2015-10-17T05:16:47.480+03:00", "highlightTitle": ""}