{"organizations": [], "uuid": "915fb589f8a08169a06b03fa1c9445f952ca387e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.brownsvilleherald.com", "main_image": "http://bloximages.newyork1.vip.townnews.com/brownsvilleherald.com/content/tncms/assets/v3/editorial/4/13/41346484-31b1-11e5-a962-4340561ec630/54dd75e0d2bf5.image.jpg", "site_section": "http://www.brownsvilleherald.com/search/?q=&t=article&l=25&d=&d1=&d2=&s=start_time&sd=desc&c[]=sports*&f=rss", "section_title": "Brownsville Herald - sports", "url": "http://www.brownsvilleherald.com/sports/local/article_355d4538-6b1b-11e5-b15f-ab75f73901e8.html", "country": "US", "title": "UTRGV women's soccer allows three late goals in loss", "performance_score": 0, "site": "brownsvilleherald.com", "participants_count": 1, "title_full": "UTRGV women's soccer allows three late goals in loss", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T07:00:00.000+03:00", "replies_count": 0, "uuid": "915fb589f8a08169a06b03fa1c9445f952ca387e"}, "author": "DENNIS SILVA II, Staff Writer", "url": "http://www.brownsvilleherald.com/sports/local/article_355d4538-6b1b-11e5-b15f-ab75f73901e8.html", "ord_in_thread": 0, "title": "UTRGV women's soccer allows three late goals in loss", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ST0CK UTRGV Posted: Sunday, October 4, 2015 11:00 pm UTRGV women's soccer allows three late goals in loss By DENNIS SILVA II, Staff Writer Brownsville Herald \nEDINBURG — The University of Texas Rio Grande Valley women’s soccer team suffered another defeat Sunday. \nThough CSU Bakersfield won 3-0 to send the Vaqueros to 0-3 in WAC play at the UTRGV Soccer and Track & Field Complex, the game was not dictated by a powerful Bakersfield offense or a poor UTRGV defense as the score might suggest. \nOn the contrary, it was another match in which UTRGV’s defense starred until the final minutes, unable to withstand another porous effort from the Vaqueros’ attack. \nAll three Bakersfield strikes came during the final 10 minutes of the match. Once Alexa Orrante got the scoring started with a penalty kick during the 80th minute, Bakersfield (4-6-2, 2-0-1 WAC) had the win in the bag since UTRGV either struggled to produce enough chances or played timid when it did have opportunities near the net. \n“We never put the ball on target,” coach Glad Bugariu said. “Until we can do that on a consistent basis or get some players who can do that, we won’t be scoring any goals.” \nAfter scoring eight goals during its first six matches this season, UTRGV has produced two in its last six. On Sunday, UTRGV (2-7-3, 0-3 WAC) was outshot 18-7, including 8-2 on goal. This season, UTRGV has been outshot 186-131, 81-55 on goal. \n“We can do better. We can improve,” said midfielder Elisa Espino, the lone Vaqueros player to create much of anything Sunday with three shots, two on goal. “We obviously don’t score enough to win. It’s a challenge because this is a great conference, and we just need to work harder.” \nDefensively, UTRGV was solid once again. Sophomore goalkeeper Erica Gonzalez, a Harlingen native, was terrific in net. She made five saves, many of the highlight variety, to keep her team competitive. But once Orrante got the penalty kick to drop, the floodgates opened. \nFive minutes later, Madi Giammona drilled a shot to the top left corner, beyond Gonzalez’s reach, after a steal, and 39 seconds after that Aminah Settles struck to the right side of the box. \nFor more on this story, visit MyBrownsvilleHerald.com .", "external_links": [], "published": "2015-10-05T07:00:00.000+03:00", "crawled": "2015-10-05T07:49:32.859+03:00", "highlightTitle": ""}