{"organizations": [], "uuid": "3e222bb9fd40bc03786d8efaba14ff23989d3ae7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com/asset/1200_630/5628e6dd1400002200c7a8c0.jpeg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/sports/index.xml", "section_title": "Sports - The Huffington Post", "url": "http://www.huffingtonpost.com/entry/richard-sherman-thursday-night-football-comments_5628e611e4b0aac0b8fbc348", "country": "US", "title": "Richard Sherman Explains A Weekly Contradiction In NFL Player Safety", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Richard Sherman Explains A Weekly Contradiction In NFL Player Safety", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T18:31:00.000+03:00", "replies_count": 0, "uuid": "3e222bb9fd40bc03786d8efaba14ff23989d3ae7"}, "author": "Juliet Spies-Gans", "url": "http://www.huffingtonpost.com/entry/richard-sherman-thursday-night-football-comments_5628e611e4b0aac0b8fbc348", "ord_in_thread": 0, "title": "Richard Sherman Explains A Weekly Contradiction In NFL Player Safety", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Richard Sherman Explains A Weekly Contradiction In NFL Player Safety Well, he has a point. Juliet Spies-Gans Editorial Fellow, HuffPost Sports Posted: 10/22/2015 11:31 AM EDT Maddie Meyer via Getty Images Richard Sherman looks on during the Seattle Seahawks' game against the Green Bay Packers at Lambeau Field on Sept. 20, 2015. \nNever one to keep his opinions to himself, Seattle Seahawks cornerback Richard Sherman effectively accused the NFL of prioritizing revenue over players’ rest and recuperation on Wednesday when he was asked how difficult it is to have only the “ four-day turnaround ” between games necessitated by Thursday Night Football. \n\" I mean, it's rough ,\" Sherman responded. \"It's rough on the body. Any time you play a football game and play another one a few days later, it's going to be tough on the body. But it's just another one of those things. Another one of those simple contradictions of the league, because they care about us.\" \nThe half-week between the Seahawks’ Week 6 and 7 contests means that players will have three fewer days than normal to rest and rehab their injuries, with many being thrown back into the fire before their bodies have properly recovered from the previous matchup’s beating. \nSherman is not the first to call the NFL on what SBNation deemed the “hypocritical” nature of Thursday Night Football . In a league whose party line is seemingly we do care about player safety, players from Green Bay to Houston have all pointed out the tension between the NFL’s PR-conscious statements on safety and the grind of suiting up two times in five days. While Packers offensive lineman Josh Sitton said last year that Thursday Night Football is “ all about money ,” Houston Texan running back Arian Foster announced just weeks later that it puts “ every player on the field in danger. ” \nThis is hardly the only time that the discussion at Sherman’s press conference has shifted from strategy to safety, as just two Wednesdays ago, his comments on the NFL’s recommended tackling technique largely undermined the league’s platform on proper head trauma prevention. \nAlso on HuffPost:", "external_links": [], "published": "2015-10-22T18:31:00.000+03:00", "crawled": "2015-10-22T19:11:16.645+03:00", "highlightTitle": ""}