{"organizations": [], "uuid": "aa5ae0eb61e1bfdf40a5280e12e9575721bee03e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kentucky.com", "main_image": "http://media.kentucky.com/smedia/2015/09/26/21/51/11bwN0.AuSt.79.jpeg", "site_section": "http://www.kentucky.com/232/index.rss", "section_title": "Kentucky.com -- Sports Update", "url": "http://www.kentucky.com/welcome_page/?shf=/2015/10/02/4067192_recently-deemed-kentucky-bound.html", "country": "US", "title": "Kentucky jokester Johnson starting to reveal his serious on-field talents", "performance_score": 0, "site": "kentucky.com", "participants_count": 1, "title_full": "Kentucky jokester Johnson starting to reveal his serious on-field talents", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T01:51:00.000+03:00", "replies_count": 0, "uuid": "aa5ae0eb61e1bfdf40a5280e12e9575721bee03e"}, "author": "broberts@herald-leader.com (Ben Roberts)", "url": "http://www.kentucky.com/welcome_page/?shf=/2015/10/02/4067192_recently-deemed-kentucky-bound.html", "ord_in_thread": 0, "title": "Kentucky jokester Johnson starting to reveal his serious on-field talents", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Kentucky jokester Johnson starting to reveal his serious on-field talents By Ben Roberts broberts@herald-leader.com October 1, 2015 Updated 3 hours ago 2015-10-02T10:27:34Z \nUK DT C.J. Johnson sacks Missouri backup QB Drew Lock during the 2nd quarter of the University of Kentucky-Missouri football game at Commonwealth Stadium in Lexington, Ky., on Saturday, September 26, 2015. Photo by Ken Weaver KEN WEAVER — Ken Weaver EKU at Kentucky \nWhen: 7:30 p.m. Oct. 3 \nTV: SEC Network alternate \nRadio: WLAP-AM 630, WBUL-FM 98.1, XM Channel 204, Sirius Channel 126 \nRecords: EKU 2-1 (1-0 Ohio Valley Conference); Kentucky 3-1 (2-1 SEC) \nEleven tackles in Kentucky's 21-13 victory over Missouri last week earned senior defensive tackle C.J. Johnson praise from his coaches and teammates. \nIt also earned him the Southeastern Conference defensive lineman of the week award from the league office. \n\"It was a great honor,\" Johnson said, before adding: \"I didn't know about it until like a day later though, because I don't get on the Internet.\" \nJohnson — a jokester on and off the field — wasn't kidding about this one, but his claim that he rarely goes online should come as no surprise. \nThe 300-pound lineman came to UK from a junior college in New York last year with plenty of quirks. \nIn his first meeting with the local media, he broke out a Jackie Chan impersonation. Shortly after that, he proudly explained the origin of his nickname — which is \"Poop\" — in a humorous video that later showed up on late-night talk shows. On Wednesday, he held court with stories about trading trash talk with quarterback Patrick Towles in practice. \nThere are usually lots of laughs whenever Johnson is around, but he also came to UK with high expectations, and those weren't realized during his junior season. \nThe Columbia, S.C., native was one of the top 25 junior-college players in his class, and comparisons to Za'Darius Smith — another junior college defensive lineman who found great success at UK — were common leading up to last year's signing day. \nJohnson tallied just 10 tackles in 2014, one less than his total last Saturday. \n\"You never know when a junior-college player comes in, when it all comes together for him,\" Coach Mark Stoops said this week. \"There's a lot of things. There's a lot of change, whether it's schematically or technique and speed of the game, there's many issues. It's not a lot of fun playing defensive line at times in the SEC.\" \nBefore he got to UK, Johnson got by on his athleticism and explosiveness. \nOnce he arrived in Lexington, it became clear there was much he needed to learn. \n\"They put him in the gap and said go get the football,\" said UK defensive line coach Jimmy Brumbaugh. \"You can't do that in college.\" \nInstead of shooting to the top of the depth chart, Johnson had to sit back and watch. \nHe didn't get as much playing time as he was hoping for during that first season, but he did get the opportunity to soak in the game from the sideline. \n\"It was a lot of learning,\" Johnson said. \"You learn a lot sitting on the bench. I learned that I didn't want to sit there no more. I had to figure out how to get up off of there.\" \nHe laughed as he said that — Johnson laughs when he says most things — but, once again, he was serious. \nThe newfound knowledge gave Johnson more confidence on the field, and that led to a more serious approach to the game and a more serious investment in his own college career. \nJohnson spent extra time working with Brumbaugh, and the results were clear. Stoops noticed, the other defensive coaches noticed, his teammates noticed and — on Saturday against Missouri — UK fans noticed. \nWith Regie Meant sidelined by an injury, Johnson was inserted into the starting lineup. Those who have watched him on the practice field this fall weren't surprised by the results. \n\"I've seen him in practice make those same kind of plays that he made on Saturday against our offense, where he just strikes a blocker, shucks them, runs down the line and makes the tackle,\" said defensive coordinator D.J. Eliot. \"We knew he had the ability. We just had been working with him to put it all together, and on Saturday he played as good a game as he could.\" \nJohnson has now shown his ability to be a disruptive force for the Wildcats on the interior of the defensive line, and UK's coaches are expecting more of the same as the season continues. \nJohnson's expectations for himself? Just keep getting better. \n\"I always just think about trying to have a big game next game,\" he said. \"So if I had 11 tackles this game, I'm trying to have at least 13 the next. \n\"I came a long way. It basically was just learning my technique and plays. And now that I got that down, I feel confident when I get out on the field.\" Ben Roberts: (859) 231-3216. Twitter: @NextCats. Blog: ukrecruiting.bloginky.com.", "external_links": [], "published": "2015-10-02T01:51:00.000+03:00", "crawled": "2015-10-02T16:18:30.337+03:00", "highlightTitle": ""}