{"organizations": [], "uuid": "78e18056ddee4a620724c69e29cc3820cc0c7a94", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "accesswdun.com", "main_image": "http://images.accesswdun.com/uploads/articles/2015/343933/buf-ma-brandon-marsh-dmc_p3.jpg", "site_section": "http://accesswdun.com/rss/3/rss.xml", "section_title": "AccessWDUN.com Sports", "url": "http://accesswdun.com/article/2015/10/343933/simpson-adversity-strengthening-not-diminishing-wolves", "country": "US", "title": "Simpson: Adversity strengthening, not diminishing, Wolves", "performance_score": 0, "site": "accesswdun.com", "participants_count": 1, "title_full": "Simpson: Adversity strengthening, not diminishing, Wolves", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T02:25:00.000+03:00", "replies_count": 0, "uuid": "78e18056ddee4a620724c69e29cc3820cc0c7a94"}, "author": "Jeff Hart", "url": "http://accesswdun.com/article/2015/10/343933/simpson-adversity-strengthening-not-diminishing-wolves", "ord_in_thread": 0, "title": "Simpson: Adversity strengthening, not diminishing, Wolves", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Jeff Hart Sports Reporter Buford's Brandon Marsh, left, runs away from Monroe Area defenders in the Wolves' win on Friday in Buford. photo: David McGregor Related Articles 2015 High school football rankings 2015 High School Football region standings Region title, playoff races stay at the forefront in Week 9 (VIDEO) Player of the Week: Bacus tears through Madison, helping Trojans into playoff contention \nBUFORD — Buford football is 6-1 and tied with Stephens County atop the Region 8-AAAA standings with a perfect 4-0 record. That’s nothing new for a program that is accustomed to being at the top. \nHowever, the 2015 season has been anything but typical for the Class AAAA third-ranked Wolves. A new starting quarterback, the nation's top tight end prospect having moved away and a roster ravaged by injuries and key suspensions have thrown up significant speed bumps. (In their only loss of the season -- 37-14 to then-Class -No. 3 ranked McEachern -- the Wolves were missing more half of their defensive starters.) \nBut Buford coach Jess Simpson, who is never one to make excuses, said despite what has been one of the most tumultuous seasons in his 20 years at Buford as an assistant and or head coach, there have been more than a fair share of positives to go around. \nWe caught up with coach Simpson this week to get an insight on the state of the Wolves as they prepare to take on North Oconee on Friday at home in the first of two key showdowns for first place in Region 8-AAAA. \nQ: You had some early-season adversity (injuries and suspensions). How did that affect y’all early on? \nA: Today you know it is about depth and a numbers game at some point, and I think a lot of it is how do you choose to see your adversities, and I think what happened with us in August and September was just we chose to view it as an opportunity to develop that depth. Certainly some guys have to probably carry a really heavy load for our team and we didn't maybe have some help with some positions that we normally would have, but that's football. It’s cliche to say the next man up but that's truly what it was for us. Someone at a position as a 3 becomes a 2 and a 2 becomes a 1, and you have a lot of different scenarios, but in the end you try to get your best players on the field. But you find out a lot about people. We’ve really improved the last four weeks, which is a testament to the competition we had at so many positions on our team. Nobody can relax, which makes it very competitive in practice, and I think that’s a good thing for us. \nQ: Who have become some of the emerging leaders, expected or unexpected, on this team, and are y’all finally at full-strength now -- or as much as you can be at this point in the season? \nA: I think there's been numerous guys to step up just because there's just been so many different injuries. I mean we have been littered with injury after injury and we still don't have everybody back. We're still waiting on Xavier (Gantt); Holland Frazier got his cast off (Tuesday) -- he’s been playing with a cast on the last two weeks after surgery -- so it's going to be nice to get those guys hopefully full speed at some point in the next few weeks. As far as leaders, you know that I'd say (senior) Brandon Marshall has been a great surprise. He has really found a role in in every phase of the game. He’s doing a good job covering kicks, he's a good wide receiver, he's played a good corner for us. \nQ: About the defense. Y’all have been as dominant so far as you probably have been over the last few years. How do you see this particular defensive group, especially having to be without Shugg Frazier for the first four games? Is it shaping out to be one of the better units and did you expect that coming into the season? \n[The defense is allowing just 8.6 ppg, has produced 43 3-and-outs, 45 TFL, and 20 sacks so far.] \nA: Statistically we haven’t a had bad night, although we did give up a bunch more yards against McEachern than we wanted, but I think we just ran out of gas in the fourth quarter against a great team (while we were) missing a lot of guys. I’m not a big stats guy. I think there is a lot you can learn about yourself when you face adversity and we always expect to play championship-level defense. These guys have played with a lot of heart, and I think we’ve made strides the last few weeks. But we still have miles to go to be where we want to be. Shugg has come in ready to go and playing well. He is a dominant force for us. But it’s more than just one person and they showed that at the beginning of the season. \nQ: What have you noticed about this team that has maybe surprised you to a certain degree? A particular person or group, perhaps? \nA: We have seen some of the juniors that have just steadily gotten better and better in small increments every week, and we know those guys are critical for us to be able to win. We’re real excited about how our linebacker group, which was really raw coming into the year and then we lost probably our best linebacker in TD (Roof) with a dislocated elbow (in the first game against Eastern Christian), has come around. As a group they have all improved. It was an area that we were worried about at the beginning, especially after TD got hurt, but now it has turned into a strength for us, which makes it fun as a coach to watch the progress being made on the field. \nQ: Despite graduation losses and impending suspensions before the start of the season, most experts still considered y’all to be the favorites in Region 8-AAAA coming into the 2015 season. However, those same experts at the start of the season also felt the Wolves may not be a lock to reach the Georgia Dome for the first time in many seasons. How have y’all handled that as a team? Has it lent for some extra motivation? \nA: You know, nothing is ever easy to do, and certainly not every year. We talked to the team about that at the start of the season and that they were going to have do whatever it took to meet their expectations. Some years we’ve had the most talented teams and not won (the state title) and other years we weren’t the most talented but we out-worked everyone else and were the best team. I would rather have a team like that. This is kind of one of those teams. Our goal every year is to be the best team in November and December. Hopefully we’ll have a shot to find out again this year. \nQ: In region play you still have two tough games at home against North Oconee, which has had an up-and-down season but is big up front and talented, and Stephens County, whose only loss was to Class AAA-ranked Elbert County on the road. The region title is probably going to come down to those three weeks. How do you see things shaking out? \nA: Both of those teams are talented and have different styles so it’s going to be a challenge for us. North Hall may still have a say in things as well. Being at home is always special to us so hopefully that is an advantage for us. But we’re going to have to play sound defense. Our goal is to win the region title so we’re just going to focus on North Oconee this week and then take it one at a time after that. \nQ: It’s hard to believe but this year marks your 11th season as head coach at Buford, which is one year longer than coach (Dexter) Wood was at the helm. What does that mean to you, and is it still fun and challenging for you to come in here every day realizing that you're basically competing against the standards that you and coach Wood have set over the last 20 seasons? \nA: I haven’t really thought much about the fact I’ve been here that long as the head coach. I still have fun so it doesn’t seem that long to me. Fortunately we hadn't had a lot of hiccups over the years, and I hope we don't start having too many, but it’s just fun to see how prepared you can be in every phase with your coaches and your kids mentally, emotionally, physically, spiritually, the whole thing, and see if you can do it one more week. I couldn’t imagine coaching and not having high expectations to meet every year so I don’t feel a lot of pressure to keep things going. We prepare every year to do better than we did the year before. The past couple of years have been especially fun because my two sons have been on the team and to be able to share that as a dad as well as a coach means a lot to me. The experiences are what you make of them, whether you're winning or losing or going through a hard time or not. I love just having the opportunity of getting to compete in the playoffs against the best coaches and teams. I get excited about the tournament atmosphere. To me, that’s the most fun part of the job.", "external_links": [], "published": "2015-10-22T02:25:00.000+03:00", "crawled": "2015-10-21T14:23:06.010+03:00", "highlightTitle": ""}