{"organizations": ["Rutgers"], "uuid": "5d719aeead1842223024f84c30e6adaa3e0b185d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailyrecord.com", "main_image": "http://www.gannett-cdn.com/-mm-/f22be62de16c0120c4c2b7dc5ff1be37bbd4d695/c=0-91-5177-3016&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/10/12/NJGroup/AsburyPark/635802489327633500-IMG-1125.JPG", "site_section": "http://rssfeeds.dailyrecord.com/morristown/sports", "section_title": "Morristown - Sports", "url": "http://www.dailyrecord.com/story/sports/nfl/jets/2015/10/12/new-york-jets-de-sheldon-richardson-back-following-suspension/73842266/", "country": "US", "title": "Kyle Flood returns at Rutgers, but B1G questions remain", "performance_score": 0, "site": "dailyrecord.com", "participants_count": 0, "title_full": "Kyle Flood returns at Rutgers, but B1G questions remain", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T00:10:00.000+03:00", "replies_count": 0, "uuid": "5d719aeead1842223024f84c30e6adaa3e0b185d"}, "author": "", "url": "http://www.dailyrecord.com/story/sports/nfl/jets/2015/10/12/new-york-jets-de-sheldon-richardson-back-following-suspension/73842266/", "ord_in_thread": 0, "title": "Kyle Flood returns at Rutgers, but B1G questions remain", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Tanya Breen/Staff", "Kyle Flood", "Stephen Edelson"], "text": "Kyle Flood returns at Rutgers, but B1G questions remain Stephen Edelson , @steveedelsonAPP 5:10 p.m. EDT October 12, 2015 Kyle Flood speaks to the media Monday for the first time since he was suspended and fined by Rutgers. (Photo: Tanya Breen/Staff photographer) 4 CONNECT 5 TWEET LINKEDIN 1 COMMENT EMAIL MORE \nPISCATAWAY Kyle Flood stepped to the podium inside the Hale Center at the appointed hour for the first time in three weeks and apologized publicly to the Rutgers community in general, while thanking school president Robert Barchi, who chose not to fire him, and assistant head coach Norries Wilson, who took his place the past three gamedays. \nBut what Flood failed to do in a press conference that lasted just over 12 minutes was dispel the perception that his three week suspension was simply the backlash from a college football coach getting caught putting athletics ahead of academics. \nThat the top man in the Scarlet Knights’ football organization, flush with power after a successful first season in the Big Ten that included a Bowl victory, thought he could circumvent the rules and use his influence on behalf of an impact defensive player. \nAnd now the question moving forward is how that will resonate within the school’s administrative and academic hierarchy, as well as within a locker room where accountability is part of the daily message. Kyle Flood off suspension at Rutgers, starts with apology \nThere’s still no plausible reason as to why Flood ignored school rules prohibiting contact between coaches and professors regarding the grades of student-athletes, and used his private email account to do so regarding the grade of cornerback Nadir Barnwell. \nAs to using a personal email account, Flood indicated it had to do with respecting the player’s privacy, although it’s unclear how private email account would protect that more than his school account. \nFlood also offered no explanation as to why he chose to meet face-to-face with the professor. \nHe said several times that it was his responsibility to know the rules, making it seem as though maybe he didn’t know the rule. But in Barchi’s letter to the Rutgers community after handing down the suspension, he indicates that Flood was warned by the athletic department’s academic support staff about it. For Rutgers football, moral victories count \nYou’re still left with the impression that Flood wasn’t taking these extraordinary measures if it involved some redshirt freshman who wasn’t going to see the field for two years. Flood said in his press conference that he had never done this before, which begs the question why he would suddenly try to pull strings to get Barnwell, who happened to be his top coverman. \nBarnwell has since been dismissed from the team, part of a group of six players arrested for incidents that happened in April and May. Kyle Flood confident no wrongs in Rutgers drug testing, recruiting \nIf there were rational explanations for how all this could have happened, this was the time to tell Scarlet Nation. Otherwise, simply admit that your judgement got clouded, and that the pressure to win can be so intense in big-time college football that it overshadows the real mission. \nMaybe he's being advised not to say anything more on the subject. \nWhatever the reason, there are still questions to be answered, including the one concerning Flood's future as the leader of this program. \nStaff writer Stephen Edelson is an Asbury Park Press columnist: sedelson@gannettnj.com 4 CONNECT 5 TWEET LINKEDIN 1 COMMENT EMAIL MORE Read or Share this story: http://on.app.com/1RCXLMH TOP VIDEOS", "external_links": [], "published": "2015-10-13T00:10:00.000+03:00", "crawled": "2015-10-14T19:46:34.690+03:00", "highlightTitle": ""}