{"organizations": [], "uuid": "080287f97421b29139456d430191d09ec12f0686", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.newstribune.com", "main_image": "http://jeffcity.media.clients.ellingtoncms.com/static/newstribune/images/news-tribune90x90.jpg", "site_section": "http://newstribune.com//rss/headlines/sports/", "section_title": "newstribune.com stories: Mid-Missouri and National Sports", "url": "http://www.newstribune.com/news/2015/oct/21/tcus-boykin-takes-time-greet-young-fan-wheelchair/", "country": "US", "title": "TCU's Boykin takes time to greet young fan in wheelchair", "performance_score": 0, "site": "newstribune.com", "participants_count": 1, "title_full": "TCU's Boykin takes time to greet young fan in wheelchair", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T10:00:00.000+03:00", "replies_count": 0, "uuid": "080287f97421b29139456d430191d09ec12f0686"}, "author": "The Associated Press", "url": "http://www.newstribune.com/news/2015/oct/21/tcus-boykin-takes-time-greet-young-fan-wheelchair/", "ord_in_thread": 0, "title": "TCU's Boykin takes time to greet young fan in wheelchair", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Share \nFORT WORTH, Texas (AP) — TCU quarterback Trevone Boykin gets plenty of praise for his standout play. He is winning new fans with something he did before kickoff. \nMoments before No. 3 TCU played Saturday at Iowa State Boykin greeted a disabled 7-year-old Cyclones fan watching from a wheelchair. \nAbby Faber was chosen to be a “Kid Captain” for the game from Blank Children’s Hospital in Des Moines, Iowa, where she has physical therapy. \n“She usually uses a walker,” her mother, Jenny Faber, told the Fort Worth Star-Telegram from her home in Ankeny, near Des Moines. \nHowever, Jenny and Steve Faber thought it would be easier for Abby, who has a form of cerebral palsy, to use a wheelchair for the pregame ceremony and coin toss at the game in Ames. \nAs the Horned Frogs ran onto the field for the coin toss, Boykin stopped at Abby’s wheelchair, where she sat wearing an Iowa State jersey. Boykin leaned down and asked, “What’s your name?” \n“Abby,” the girl replied as Star-Telegram photographer Paul Moseley took their picture. TCU beat Iowa State 45-21. \nJenny Faber said she was unfamiliar with Boykin but now her family will be following him “the rest of the season.” Faber said her daughter was so excited to get to shake a player’s hand. \n“It’s really cool that he would take the time to do that before a big game,” the mother said. \nWhen she woke up Sunday morning, Abby was still excited by her encounter with Boykin, her mother said. Even Monday at school, teachers and others said Abby was wearing “a big smile” because of her brush with a sports celebrity who is considered among the contenders for the Heisman Trophy. \n“She’s heard us talking about it and says, ‘I’m famous,’” Jenny Faber said. ﻿", "external_links": [], "published": "2015-10-21T10:00:00.000+03:00", "crawled": "2015-10-21T18:32:37.483+03:00", "highlightTitle": ""}