{"organizations": [], "uuid": "5430c1e81fd1f3f99f7a300a86ce619179aafe15", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.southcoasttoday.com", "main_image": "http://www.southcoasttoday.com/storyimage/NB/20151009/SPORTS/151009345/AR/0/AR-151009345.jpg", "site_section": "http://www.southcoasttoday.com/sports/professional?template=rss&mime=xml", "section_title": "Pro sports - southcoasttoday.com", "url": "http://www.southcoasttoday.com/article/20151009/SPORTS/151009345/101091?rssfeed=true", "country": "US", "title": "Patriots Notebook: Tarell Brown heads back home to Dallas", "performance_score": 0, "site": "southcoasttoday.com", "participants_count": 1, "title_full": "Patriots Notebook: Tarell Brown heads back home to Dallas", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T07:03:00.000+03:00", "replies_count": 0, "uuid": "5430c1e81fd1f3f99f7a300a86ce619179aafe15"}, "author": "Kevin McNamara and Mark Daniels @KevinMcNamara33 @MarkDanielsPJ", "url": "http://www.southcoasttoday.com/article/20151009/SPORTS/151009345/101091?rssfeed=true", "ord_in_thread": 0, "title": "Patriots Notebook: Tarell Brown heads back home to Dallas", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Kevin McNamara and Mark Daniels@KevinMcNamara33 Posted Oct. 9, 2015 at 11:03 PM By Kevin McNamara and Mark Daniels@KevinMcNamara33 Posted Oct. 9, 2015 at 11:03 PM » Social News FOXBORO — A trip to Dallas is always special for Tarell Brown. The Patriots cornerback grew up 14 miles outside the city, but it was in the old home of the Cowboys where Brown first started to dream about playing football. When he was 9 years old, he won the Dallas-area punt, pass and kick competition inside Texas Stadium, in Irving. He went on to finish third in the national competition in San Diego. “It meant a lot. A childhood dream, just to be able to step on the field where professional players play, back then,” Brown said. “It was a great experience.” When the Patriots face the Cowboys in Week 5 on Sunday, it will be inside AT&T Stadium in Arlington. Regardless, the area will always hold a special place in Brown’s heart. “Just being able to get that experience, being able to be there, feel the energy and the atmosphere, it was something special,” Brown said. “Something I’ll always remember.” Brown has been listed as probable for Sunday’s game with a foot injury. After being limited in practices on Wednesday and Thursday, he was a full participant on Friday, helping the Pats finish the week with perfect practice attendance. The biggest addition to the lineup on Sunday could be offensive lineman Ryan Wendell, who has yet to appear in a game this season due to an undisclosed illness. Coach Bill Belichick was asked earlier in the week what it would take for Wendell to appear in a game and he answered: \"We'll evaluate it. That's what practice is for. That's what preparation is for.\" Bradley Fletcher (hamstring) and Trey Flowers (knee/shoulder) are listed as questionable. Both were the only limited players on Friday. The Patriots can downgrade players to out on Saturday before their flight to Dallas. The Cowboys are riddled with injury problems as starting quarterback Tony Romo (shoulder), receivers Dez Bryant (foot) and Brice Butler (hamstring), running back Lance Dunbar (knee) and defensive end Randy Gregory (ankle) are all out. The Patriots made a small roster move on Friday by signing guard Chris Barker to the practice squad and releasing offensive tackle Sean Hickey. Explaining the extension A day after a rare mid-season contract extension was awarded to first-year running back Dion Lewis, Belichick praised the 25-year old as someone “you love to coach.” The coach said Lewis’ ability to pick up the team’s offensive system and display a versatile skill set has made him a valued addition to the roster. “He’s shown value in the kicking game, shown value on all three downs on offense,” he said. “He does a good job of learning. He’s learned a lot of different spots, a lot of different adjustments, all the different blitz pickups in the passing game. He works hard. He’s tough. He’s here every day, is very coachable and just really tries to do what you ask him to do, whatever it is. He doesn’t ask any questions, he just works hard to get it right. You love to coach guys like that.” Lewis, who is listed at 5-foot-8 and 195 pounds, leads the Patriots with 30 carries for 146 rushing yards and also has 15 catches out of the backfield. He signed a two-year contract extension on Thursday. “I think for his size he’s got good power,” Belichick said. “He’s never going to be a 240-pound power back, but for his size he’s got good power and explosiveness. You see him put his shoulder down and pick up a couple of extra yards or run through those light tackles, as well as his ability to make guys miss in space and change direction. He makes the most out of what he’s got. “ This is an explanation? Cowboys' owner Jerry Jones attempted to defuse some of the heat that defensive end Greg Hardy brought on himself in his weekly appearance on a Dallas radio show. According to the Dallas Morning News, Jones said he didn't think Hardy meant anything when he said that Patriots' quarterback Tom Brady should bring his super model wife, Gisele Bundchen, and other women to Sunday's game. Hardy is making his season debut in the game after serving a suspension for domestic violence issues. \"I want everybody to understand that I do understand the sensitivity that's going on,\" Jones began, \"but did anybody think this wasn't going to be the case when (Hardy) came back for the first ball game, that this wasn't going to be a featured point by the country? So the hand-writing was on the wall.\" Jones continued in a somewhat rambling manner and tried to justify Hardy bringing up Bundchen's name because of her career choice, similar to how Elizabeth Taylor was always discussed when the actor Richard Burton career was talked about. \"I can remember when they would talk about Richard and you'd say, 'I don't know about Richard Burton, but anybody good enough to be married to Elizabeth Taylor has got to be all right,'\" Jones said. \"Elizabeth Taylor made her life wanting people to say she was pretty. ... When you talked about Elizabeth Taylor and Richard Burton, you talked about how pretty she was. Nobody thought that you were being disrespectful of women or the workplace. \"Well Tom (Brady) just happens to be married to a lady that's absolutely one of the premier people in the world of working and making people say she's beautiful. Do you agree with me? That's what they do. They get up in the morning and go to bed at night having people say she's beautiful. So a lot of people, when they talk about Tom Brady, they talk about how beautiful she is.\" By Kevin McNamara and Mark Daniels@KevinMcNamara33", "external_links": [], "published": "2015-10-10T07:03:00.000+03:00", "crawled": "2015-10-10T08:13:14.057+03:00", "highlightTitle": ""}