{"organizations": [], "uuid": "12ae20705100db629a4edee2bd9479bf3181cc14", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.denverpost.com", "main_image": "http://extras.mnginteractive.com/live/media/site36/2015/1015/20151015__20151018_E1_AE18FAENGINEERS~p1.jpg", "site_section": "http://www.denverpost.com/", "section_title": "Colorado Breaking News, Sports, Weather, Traffic, Jobs - The Denver Post", "url": "http://www.denverpost.com/entertainment/ci_28976033/engineering-design-forward-denver", "country": "US", "title": "Engineering a design-forward Denver -", "performance_score": 0, "site": "denverpost.com", "participants_count": 1, "title_full": "Engineering a design-forward Denver - The Denver Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T20:01:00.000+03:00", "replies_count": 0, "uuid": "12ae20705100db629a4edee2bd9479bf3181cc14"}, "author": "Ray Mark Rinaldi", "url": "http://www.denverpost.com/entertainment/ci_28976033/engineering-design-forward-denver", "ord_in_thread": 0, "title": "Engineering a design-forward Denver -", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Engineers are the enablers of the building business. They can make an architect's dream come true, figuring out the physics that will allow a proposed structure to stand up.\nOr they can crush it, determining that a concept is too fanciful to be turned into actual steel and glass, and forcing its creator to compromise his best ideas.\nChris O'Hara and Julian Lineham work a different way. They don't reject plans — because, most often, they see them before they're finished, working with architects prior to the first sketch and solving structural challenges as a project takes shape. The two think of themselves as designers, really, going so far as to name their Boulder engineering firm Studio NYL , appropriating the word \"studio\" from artists' lexicon.\nChris O'Hara and Julian Lineham, principals at the Boulder engineering firm Studio NYL, have been running the company for the past 11 years and have done projects from Denver to Mexico City. ( Brent Lewis, The Denver Post ) \"We don't say, 'No,' often,\" said O'Hara. \"We do say, 'Yes, ... but,' quite a bit. But very, very rarely 'No.' \"\nThere's still a game of tug of war going on; buildings have to withstand wind, earthquakes, fire and gravity, and engineers are responsible for safety. But the collaborative process has both teams pulling rope from the same side, resulting in some remarkable buildings recently.\nStudio NYL is the math behind the multisided Science Pyramid at the Denver Botanic Gardens , the colorful Corky Gonzales Library on West Colfax Avenue and Marquez Hall at the Colorado School of Mines in Golden, with its impossibly cantilevered roof.\nThe firm worked on the cylinder-shaped stair at the Longmont Museum; the folding glass façade of the Lindsey Flanagan Courthouse downtown; and Our Lady of Loreto School in Foxfield, with its light-filled, pop-out classrooms.\nIt's no coincidence that these are among either Colorado's best new buildings, or its most difficult to make, or some of its most budget-conscious. In a region where expectations are low, Studio NYL is raising the bar by mixing a belief in design with a skill for economy.\n\"They understand architectural ideas as well as the physics of structure,\" said architect Ron Faleide , who worked with Studio NYL on the Loreto school. \"That's unusual.\"\nAnd it has put the firm in high demand here and across the globe — and suddenly, too. Studio NYL's clients now include eight of the country's top 16 firms listed this year by Architect magazine. It says its revenues have doubled since 2012, with a 50 percent increase over the past 18 months alone. The staff has grown to 17, forcing it to move to larger offices.\nNew uses for materials\nHighPark is a mixed-use development in Monterrey, Mexico. Studio NYL developed a structural plan that allowed for expansive interior open spaces. ( Provided by Studio NYL ) Its tactic: having the technology, experience and knack for finding new uses for materials already employed in many buildings and consumer products. The pair has worked magic with carbon fiber polymers, plastic materials most often used for golf clubs and mountain bikes.\n\"There are so many products that we use in the construction industry that have inherent strength and have capabilities of doing more things,\" said O'Hara. \"But we don't make them do it.\"\nFor the new Lory Student Center at Colorado State University, a project that called for the rehab of an existing building, they actually clad load-bearing walls in sheets of the polymer, strengthening the exterior so that holes could be punched through the existing steel frame to let light in. For another project in Fort Lupton, turning an old school into a library, they applied the same panels horizontally, increasing the load capacity of the floors.\nThe more traditional approach for both renovations would be to insert an entire new steel frame inside the building. Polymers are cheaper, lighter, easy to install and more energy-efficient because they don't conduct heat or cold.\nThe Science Pyramid presented special challenges, according to its architect, Ben Niamthet of Burkett Design . Studio NYL figured out how to support walls and ceilings that zig and zag at odd angles.\nTo cover the unusual roof shape, they suggested using fiber-cement panels, manufactured for use on walls. The material was cut into octagonal shapes that kept the buildings aesthetics while acting as an efficient rain shield.\nThe Liverpool flagship department store, just outside of Mexico City, is clad in stainless steel bands and has a public park on the roof. Studio NYL worked with Rojkind Architects on the project. ( Provided by Studio NYL ) \"Most engineers like to get rid of things in a design. It makes their job easier,\" said Niamthet. \"These guys don't do that, and it adds so much value.\"\nThe Studio NYL team was able to come up with the extreme cantilevered roof at Marquez Hall — it stretches a dazzling 60 feet without the support of columns — by turning the roof into a giant lever that's weighted in the back. The long box girders that support the roof horizontally double as vents that mechanical systems run through. The delicate glass curtain wall that serves as the building's face is simply hung from the roof and anchored gently to the ground.\nSaving money\nThe tricks can save money. For example, if a building cantilevers out to one side, that side doesn't need to be supported by a foundation, lowering foundation costs, which are a major part of construction budgets.\nStudio NYL opened in 2004 when the pair, who had worked together for other firms, branched off. Lineham, with a background in historic preservation, had established his career in London. (That's the L in the company's name), and O'Hara made his mark working at the forefront of the structural glass movement in New York (providing the NY).\nThey shared fearlessness, as well as a patient nature, that allows them to explain complicated notions to folks intimidated by science and math. Instead of keeping them in the background like most consultants, architects are happy to bring them to meetings with big developers or the many residential clients they've made dwellings for.\nThey also embrace rapidly changing technology and like to experiment with new products on the market. In the same way that Studio NYL teams with architects, the firm gathers knowledge through close associations with suppliers, technicians and other engineers.\nMore recently, it has expanded its in-house capabilities, using its growing reputation to lure a talented staff. The firm has spun off a side business, The Skins Group, which specializes in developing creative outer shells for buildings.\nThe newer endeavor relies on the same kind of thinking, which combines computer power and creative use of common material. The best example might be its contribution to the recent Liverpool flagship department store in Interlomas, Mexico. The circular building is clad in a shell of lightweight, stainless steel applied in horizontal bands that cut in at multiple angles and appear to change with the light. There's a park on the roof that's open to the public.\nThe firm has other impressive projects in Mexico, working with adventurous Rojkind Architects . The Cineteca National Film Center in Mexico City is topped by a giant webbed shell providing cover for, among other things, popular outdoor movie screenings.\nFor the HighPark mixed-use development in Monterrey, it devised a way to use plate-steel panels, a material commonly used to cover open trenches on roads, as the actual walls of the eight-story structure. The building's exterior walls are so strong that many interior columns could be eliminated, allowing spaces to open up, uninterrupted, to as much as 7,000 square feet.\n\"Everybody sees these projects and thinks they have huge budgets, but they don't,\" said Lineham.\nO'Hara and Lineham talk a lot about budgets, and that might be the thing that makes them most attractive as consultants. But they revel in making things possible, and if an engineer adds cost to a project, possibilities quickly shrink and those architectural dreams turn into client nightmares.\nSo their goal is to make budget one of the first parameters, then to solve problems as simply as they can. An engineer can't get anymore basic than employing lever principals in a design, as the pair did in at the School of Mines.\nEven very old ideas, reconsidered, can make for fresh additions to the landscape. \"The projects with less budget need more design,\" said O'Hara. \"Those are the ones that need extra effort to make them special or dignified.\"", "external_links": ["http://www.burkettdesign.com/", "http://extras.mnginteractive.com/live/media/site36/2015/1015/20151015__20151018_E1_AE18FAENGINEERS~p3.jpg", "http://studionyl.com/index.html", "http://www.faleide.com/", "http://extras.mnginteractive.com/live/media/site36/2015/1015/20151015__20151018_E1_AE18FAENGINEERS~p4.jpg", "http://extras.mnginteractive.com/live/media/site36/2015/1015/20151015__20151018_E1_AE18FAENGINEERS~p2_200.jpg", "http://www.rojkindarquitectos.com/", "http://www.azahner.com/portfolio/liverpool-mexico"], "published": "2015-10-18T20:01:00.000+03:00", "crawled": "2015-10-18T14:05:55.932+03:00", "highlightTitle": ""}