{"organizations": [], "uuid": "cb1f1f37c8af2f14da195fc6a6107611521e4e8a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.boston.com", "main_image": "http://p.o0bc.com/rf/image_1920x1190/Boston/2011-2020/2015/10/13/Boston.com/BCOM/Images/homeless1.jpg", "site_section": "http://www.boston.com/", "section_title": "Boston, MA news, breaking news, sports, video | Boston.com", "url": "http://www.boston.com/news/local/massachusetts/2015/10/13/how-mayor-walsh-plans-end-veteran-homelessness/nppnr1a4Yy6BkR6LH97HmO/story.html", "country": "", "title": "How Mayor Walsh plans to end veteran homelessness - Massachusetts news", "performance_score": 0, "site": "boston.com", "participants_count": 1, "title_full": "How Mayor Walsh plans to end veteran homelessness - Massachusetts news", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "cb1f1f37c8af2f14da195fc6a6107611521e4e8a"}, "author": "boston.com", "url": "http://www.boston.com/news/local/massachusetts/2015/10/13/how-mayor-walsh-plans-end-veteran-homelessness/nppnr1a4Yy6BkR6LH97HmO/story.html", "ord_in_thread": 0, "title": "How Mayor Walsh plans to end veteran homelessness - Massachusetts news", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Last October, approximately 700 homeless people were displaced when the bridge connecting the mainland to the Long Island Shelter was declared unsafe. It’s since been demolished, and the system meant to help these homeless people has crumbled along with it.\nThey’ve had to sleep on floors when shelters were too crowded . They’ve had to face a brutal winter with less beds. Their struggle showed that the system was flawed. The shelter closing is what really inspired Boston Mayor Marty Walsh to create a homelessness task force, said Ryan Moser, a managing director with Corporation for Supportive Housing and a task force member.\nRelated Links Mayor Walsh aims to end homelessness among Boston’s veterans by 2015 Year after Long Island’s close, homeless services are still lacking in Boston Boston’s homeless rely on each other to survive record winter “When those things happen, you have a moment of opportunity for good or for bad,” he said. “That’s what’s interesting about this task force. It’s not just, ‘How do I appease people today?,’ but, ‘How do I prevent the next crisis from happening?’”\n In Walsh’s Action Plan to End Veteran and Chronic Homelessness , released in June, the Long Island closing was described as having “brought into focus the fragility of the shelter system in Boston” and showed that “on any given day, we are one shelter closure away from a crisis.”\nWalsh set out to rehaul the whole system. In the summer of 2014, he made a goal to house all of Boston’s homeless veterans by the end of 2015. Since then, 367 homeless veterans have been placed in homes, according to his office.\nAt the time he made the announcement, there were 414 homeless veterans. Unfortunately, the action plan also noted that “over the course of that same period [in which veterans were placed in homes], a significant number of new veterans became homeless.” Still, Moser thinks it’s an attainable goal.\n“If you [plan] to end chronic homelessness by 2015, you can’t see the end of that. That takes long term leadership and guidance,” he said, meaning chronic homelessness is currently too expansive to see a light at the end of the tunnel so quickly. “With veteran homelessness, they’re within spitting distance.” (The mayor’s plan is to end chronic homelessness by 2018.)\nBut this doesn’t mean there won’t be any more homeless vets. As detailed in his plan, Walsh has aimed to reach a “functional zero.” That means no veteran will be forced to sleep on the streets, that an individual veteran’s time on the street is “rare and brief,” and that all currently homeless veterans will be housed—or on a pathway to stable housing—by the end of 2015.\n“I don’t believe that there are people who need to be in shelter for several years,” Moser said. “I want to see people have that change that happens when they move out of crisis and have a house to live in, and see dramatic changes in their lives. This kind of approach makes that possible.”\nTo make that happen, the city has had to change how homeless services work with each other—to switch from “fragmented programs to one single integrated system.”\nThis can be worrisome for homelessness service providers, like shelter staff, Moser said.\n“A lot of times, there’s a lot of money building up crisis systems and not enough building long-term solutions,” he said. “There’s some nervousness from providers around that issue, the push to move people out [of shelters] faster, if they don’t see the resources at the other end.”\nShelter employees work hard, he said, and see how much effort it takes to ensure that homeless people do well in their care.\n“It takes a while to get there,” he said. “There will always be a role for shelters, but how do you do best for people? You create better long-term housing solutions than shelters.”\nWalsh’s initiative “Boston Homes for the Brave” is part of a federal initiative, the Mayors Challenge to End Veterans Homelessness , announced by First Lady Michelle Obama in 2014.\nThat challenge encourages the “housing first” approach, which offers those experiencing homelessness immediate access to permanent affordable or supportive housing. Without clinical prerequisites like treatment courses or evidence of sobriety, the U.S. Department of Housing and Urban Development site explains, there are higher housing retention rates, lower returns to homelessness, and less individual need for crisis services.\nThe mayor’s office said that the city is also working with those in the provider and advocacy communities to decrease the amount of time veterans remain in homeless shelters.\nA year ago, 50 percent of homeless veterans were able to leave in less than six months. Now, 70 percent of all homeless veterans who have used these services leave shelter within six months and, of those, 45 percent leave in less than two months.", "external_links": ["http://www.cityofboston.gov/dnd/PDFs/An%20Action%20Plan%20to%20End%20Veteran%20and%20Chronic%20Homelessness%20in%20Boston%202015-2018.pdf"], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-13T20:04:39.008+03:00", "highlightTitle": ""}