{"organizations": [], "uuid": "7c6c4ad912c41927ab0c4624c2ab310226be37d5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.palmbeachpost.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/10/05/2b/8f/Dolphins_Philbin_Fired.2.JPG", "site_section": "http://www.palmbeachpost.com/s/sports/", "section_title": "Sports: Dolphins, High Schools, Hurricanes, Marlins, Heat, FAU | www.palmbeachpost.com", "url": "http://www.palmbeachpost.com/news/sports/football/dan-campbell-plans-to-bring-intensity-passion-to-m/nnwGd/", "country": "US", "title": "Dan Campbell will push players as Miami Dolphins interim coach", "performance_score": 0, "site": "palmbeachpost.com", "participants_count": 1, "title_full": "Dan Campbell will push players as Miami Dolphins interim coach | www.palmbeachpost.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T00:43:00.000+03:00", "replies_count": 0, "uuid": "7c6c4ad912c41927ab0c4624c2ab310226be37d5"}, "author": "Adam Lichtenstein", "url": "http://www.palmbeachpost.com/news/sports/football/dan-campbell-plans-to-bring-intensity-passion-to-m/nnwGd/", "ord_in_thread": 0, "title": "Dan Campbell will push players as Miami Dolphins interim coach", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Dan Campbell walked into his first press conference as Dolphins interim head coach Monday afternoon, looking like he just could have come off the practice field.\nCampbell, 39, who had been coaching Miami’s tight ends, gave off the appearance of someone still ready to strap on pads, and the former NFL player wants to bring that aggressive energy to the team that will be under his control for the near future.\nWilfredo Lee Former Miami Dolphins tight ends coach Dan Campbell speaks during a news conference after being promoted to interim head coach, Monday, Oct. 5, 2015 in Davie, Fla. Joe Philbin has been fired four games into his fourth season as coach of the Dolphins, and one day after a flop on an international stage that helped to seal his fate. (AP Photo/Wilfredo Lee) “I want us pulling the trigger,” Campbell said. “I don’t want us playing conservative and playing on our heels. I want us playing on our toes, and we’re going forward and we’re going through you.”\n(RELATED: Five things to know about Dolphins interim coach Dan Campbell )\nCampbell takes over a 1-3 team that was widely criticized for appearing to give up during its latest three-game skid. The Dolphins fell behind early to the Jets in Sunday’s 27-14 loss in London, ultimately costing former coach Joe Philbin his job Monday. Campbell wants to be the guy who changes that.\nBill Ingram Miami Dolphins guard Richie Incognito (68), celebrates with tight ends coach Dan Campbell after defeating the Atlanta Falcons during their NFL game Sunday afternoon, Sept. 22, 2013, at Sun Life stadium in Miami Gardens.(Bill Ingram/Palm Beach Post) “The best teams that I’ve been a part of are the ones that, during the week, they go after each other,” he said. “It gets heated, and it’s intense. It’s people that are fighting to win. They want to get noticed or they want to do their job. They’re not just going through the motions.”\nCampbell had the opportunity to learn how to build a winner during his playing career. Drafted by the Giants out of Texas A&M in the third round of the 1999 NFL draft, he spent 11 years in the NFL with the Giants, Cowboys, Lions and Saints. He appeared in the Super Bowl with the Giants in 2001 and spent the 2009 season with the Saints as they made a championship run, although he spent the latter on injured reserve.\nCampbell said his time as a player will help him relate to the players, but he emphasized that he is not going to be their friend.\nPhotos: Joe Philbin through the years 2012-2015 “I’ve been at the top. I’ve been at the bottom,” he said. “I understand what it’s like to hit that roller coaster. I understand what it’s like when things start going not the way that you want them to go and what it takes to bring people back.”\nFollowing his retirement after the 2009 season, Campbell spent a season as a Dolphins coaching intern before being promoted to the tight ends coach in 2011. That is the position he stuck at for the past four years before his promotion Monday.\nWhat type of coach Campbell turns out to be will be decided in the coming weeks and months. He said he has not considered the team’s strategy going forward, but he does have a vision for what his team will look like.\n“My vision is a bunch of hard-nosed guys that go out every day for practice, and they are ultra-competitive,” he said.\n“Competitiveness” may as well have been the title of Campbell’s introductory press conference, and it earned him at least one fan who was watching from afar.\n“I was watching on the interview … and saw the way he answered those questions and the confidence he has,” Dolphins owner Stephen Ross said. “Just his whole demeanor and what he represents is something that I have a lot of respect for. That came out when I spent quite some time this morning on the phone with him and it made me feel very confident.”\nCampbell did not name players who he thinks have been lacking motivation this year, but he said he knows how to approach all of them.\n“Some players, they do, they need a kick in the rear. Some players need to be patted on the back,” he said. “Some need to be challenged. They need to be told that they’re not good enough because that’s when they really rise to the top.\n“Those are going to be the things that I have to do, and I feel like that is my strength. I understand people very well and I understand players. And to me, that’s what I do well. That’s one of the things I do well.”\nCampbell projects confidence when he speaks. If that can mesh with the rest of the team and they start winning, Campbell may earn the right to remove the “interim” label when the season ends.\n“I’m ready for this. I can do this,” he said. “I understand this league. I understand these players. I know what it takes to win in this league.\n“I’ve been around some really good coaches, now. I know what it needs to look like. I know how I want it to look like.”", "external_links": ["http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/10/05/bc/dc/092213-spt-fins-wi-21.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/10/05/2b/8f/Dolphins_Philbin_Fired.2.JPG", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/275/img/photos/2015/10/05/c4/1d/Joe_Philbin001.JPG"], "published": "2015-10-06T00:43:00.000+03:00", "crawled": "2015-10-06T01:30:02.778+03:00", "highlightTitle": ""}