{"organizations": [], "uuid": "71020d4e96229ba583bf278e19ec5cc90900da1d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailytribune.net", "main_image": "http://bloximages.chicago2.vip.townnews.com/dailytribune.net/content/tncms/assets/v3/editorial/3/64/364049c4-6f11-11e5-a6d0-774546a73971/5618a49b43b40.image.jpg", "site_section": "http://www.dailytribune.net//search/?q=&t=article&l=100&d=&d1=&d2=&s=start_time&sd=desc&nsa=eedition&c[]=sports,sports/*&f=rss", "section_title": "The Daily Tribune  - sports,sports/", "url": "http://www.dailytribune.net/news/ntcc-rodeo-underway-in-pittsburg/article_08a7e314-6f11-11e5-9f4e-87738e3f3c5d.html", "country": "US", "title": "NTCC Rodeo underway in Pittsburg", "performance_score": 0, "site": "dailytribune.net", "participants_count": 1, "title_full": "NTCC Rodeo underway in Pittsburg", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T08:37:00.000+03:00", "replies_count": 0, "uuid": "71020d4e96229ba583bf278e19ec5cc90900da1d"}, "author": "From NTCC reports", "url": "http://www.dailytribune.net/news/ntcc-rodeo-underway-in-pittsburg/article_08a7e314-6f11-11e5-9f4e-87738e3f3c5d.html", "ord_in_thread": 0, "title": "NTCC Rodeo underway in Pittsburg", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NTCC file photo NTCC rodeo The Northeast Texas Community College rodeo this weekend provides excitement at every turn. Pictured, a saddle bronc rider comes out of the chute for the ride of his life.  37 am NTCC Rodeo underway in Pittsburg From NTCC reports dailytribune.net | 0 comments It’s NTCC rodeo weekend! Rodeo fans will get to see more than 300 athletes from throughout the Southern Region of the National Intercollegiate Rodeo Association (NIRA) compete for points and prizes this weekend as Northeast Texas Community College puts on its 26th annual rodeo. Rodeo action started Friday night and continues at 7:30 p.m. today (Saturday) at the Pittsburg Rodeo Arena. “This is the first year that we will be hosting our rodeo in Pittsburg. We hope the community will come out to join us and watch our Eagles compete against top rodeo athletes from across the region,” NTCC head rodeo coach Skylar Hunnicutt said. In addition to NTCC athletes, the colleges and universities competing this weekend include: Texas A&M University, McNeese State University, Sam Houston State University, Stephen F. Austin University, Texas A&M University-Kingsville, Hill College, Wharton County Junior College, Southwest Texas Junior College, Panola College, Trinity Valley Community College, Blinn College and Texas State University. The NTCC Rodeo is one of 10 NIRA Southern Region rodeos. The men will compete in bull riding, calf roping, steer wrestling, bareback riding, and saddle bronc riding. The women will compete in barrel racing, breakaway roping, and goat tying with men and women competing in team roping. The students will be vying for points for their chance to compete at the College National Finals Rodeo (CNFR) held in Casper, Wyo. in June. At the conclusion of the ten Southern Region Rodeos, the top three contestants in each event go onto the CNFR to compete for a national title. Tickets are $7 for adults; $5 for children 12 and under, and NTCC students with ID and children under seven are free. The Pittsburg Rodeo Arena is located on Highway 271 North in Pittsburg. Fans can follow the results at www.collegerodeo.com .", "external_links": [], "published": "2015-10-10T08:37:00.000+03:00", "crawled": "2015-10-12T00:56:06.610+03:00", "highlightTitle": ""}