{"organizations": [], "uuid": "2cab265fd7ca7a27ca3f51c1e82fb92f2280a7c1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailynews.com", "main_image": "http://www.dailynews.com/apps/pbcsi.dll/storyimage/LA/20151015/SPORTS/151019654/AR/0/AR-151019654.jpg?Maxh=1500&Maxw=1500", "site_section": "http://www.dailynews.com/usc-sports", "section_title": "USC sports: USC football, USC baseball: Los Angeles Daily News", "url": "http://www.dailynews.com/sports/20151015/usc-fires-football-coaches-like-no-one-else", "country": "US", "title": "USC fires football coaches like no one else", "performance_score": 0, "site": "dailynews.com", "participants_count": 1, "title_full": "USC fires football coaches like no one else", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "2cab265fd7ca7a27ca3f51c1e82fb92f2280a7c1"}, "author": "Scott Wolf", "url": "http://www.dailynews.com/sports/20151015/usc-fires-football-coaches-like-no-one-else", "ord_in_thread": 0, "title": "USC fires football coaches like no one else", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "When USC athletic director Pat Haden said he was unable to reach Trojans coach Steve Sarkisian to tell him he was fired, it barely caused a stir this week.\nSarkisian was flying to a treatment center as Haden repeatedly tried to inform him his tenure as the Trojans’ coach ended after just 18 games.\nBy USC standards, it was a routine dismissal.\nAlong with the national titles, numerous Rose Bowl appearances and NCAA sanctions in the past 20 years, unorthodox firings are also a trademark of USC football.\nIt’s hard to remember how most coaches get fired across the country, but USC seems to always generate attention because of its prestige and dramatic methods of getting rid of coaches.\nIn 2013, Haden fired Lane Kiffin by pulling him off a bus at Los Angeles International Airport in the middle of the night. An administrator literally jumped in front of the bus to stop it from going back to USC. Kiffin was so surprised he left his briefcase on the bus as it left.\nMaybe worse was John Robinson’s dismissal in 1997. Athletic director Mike Garrett left a message on his answering machine. The oddest part was one when one of Garrett’s administrators asked a reporter for Robinson’s home number so he could fire him.\nGarrett also had a weird policy at the time where he wanted to hire the new coach before he fired Robinson. So he flew to Kansas City and interviewed Chiefs assistant coach Paul Hackett — a former USC assistant under Robinson — while Robinson was still working at USC.\nA reporter asked Robinson if he heard about the meeting between Garrett and Hackett?\n“Paul wouldn’t do that to me without telling me first,” Robinson said.\nHackett did do it and met Robinson at a coffee shop in Los Angeles right before he was introduced as the coach to try to smooth over any hard feelings.\nIf parting ways is awkward, so are the ways each coach handled it.\nRobinson held his own press conference at a downtown Los Angeles hotel but refused to take questions after he got fired.\nWhen Pete Carroll resigned in 2010 to become the Seattle Seahawks coach, he was allowed a press conference at Heritage Hall, but even he refused to answer questions for the first time in his USC career.\nKiffin, uncooperative until the end, never commented after his tarmac termination.\nSarkisian tweeted his response Wednesday night and even took the time to change his Twitter profile to erase any references to USC.\nAdvertisement\nWhen Hackett got fired, he bitterly told the team in a meeting, “(Garrett) is your coach now!”\nThe lingering image was how his secretary was forced to carry a mini-jukebox to Hackett’s car before he left, perhaps a sign of how little others were concerned over his departure.\nInterim coach Ed Orgeron was not fired after stepping up to replace Kiffin, but angrily resigned when Sarkisian was hired two years ago. He held a tearful team meeting then stormed off in his SUV and has not set foot on campus since that day.\nAre USC firings strange simply because there is more media to cover them? Maybe, but the university seems to produce enough craziness on its own. Because of the stature of USC, the egos might be bigger and the stakes higher, which produces these incidents.\nIs it because neither Garrett nor Haden was an athletic director before USC hired them? Haden has now fired three coaches — basketball coach Kevin O’Neill, Kiffin and Sarkisian — in midseason while most schools wait until after a season.\nIf USC goes to a bowl game, interim football coaches will have coached 17 of 40 games since 2013.\nAnother factor could be that USC’s Board of Trustees, to whom the president reports, rarely does anything when it comes to football decisions.\nBesides, why should firings be normal if hirings aren’t? Where USC really distinguishes itself is for its lack of search committees.\nThe athletic director always makes the decision with a small circle of advisers, usually no more than one to two people.\nMaybe that explains why Jack Del Rio was sent a contract in 2010 but was never actually offered the USC job.\nOr better yet, when USC brought Carroll in for an interview in 2000, an administrator told a reporter, “Don’t make it seem important, it’s just a courtesy interview.”\nAbout scott.wolf@dailynews.com or follow Scott on Twitter: @insideusc Scott Wolf Back to top", "external_links": ["http://twitter.com/insideusc", "http://mn1-laweb.newscyclecloud.com/apps/pbcsi.dll/persbilde?Avis=LA&ID=39"], "published": "2015-10-15T03:00:00.000+03:00", "crawled": "2015-10-16T02:08:26.482+03:00", "highlightTitle": ""}