{"organizations": ["SDSU", "NDSU", "AP"], "uuid": "c1cca111ddde8bdf07c7fbced44b8bd29dedb9c3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.argusleader.com", "main_image": "http://www.gannett-cdn.com/-mm-/736faccc80ef3a13139bd02013f66e1b8db87b32/c=0-50-4472-2566&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/09/30/SiouxFalls/B9319071859Z.1_20150930223654_000_G7LC3NB13.1-0.jpg", "site_section": "http://rssfeeds.argusleader.com/siouxfalls/sports", "section_title": "Sioux Falls - Sports", "url": "http://www.argusleader.com/story/sports/college/south-dakota-state-university/2015/09/30/rivalry-clash-similar-paths-shaped-dakota-marker-battle/73128198/", "country": "US", "title": "Rivalry clash: Similar paths have shaped Dakota Marker battle", "performance_score": 0, "site": "argusleader.com", "participants_count": 0, "title_full": "Rivalry clash: Similar paths have shaped Dakota Marker battle", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T05:50:00.000+03:00", "replies_count": 0, "uuid": "c1cca111ddde8bdf07c7fbced44b8bd29dedb9c3"}, "author": "", "url": "http://www.argusleader.com/story/sports/college/south-dakota-state-university/2015/09/30/rivalry-clash-similar-paths-shaped-dakota-marker-battle/73128198/", "ord_in_thread": 0, "title": "Rivalry clash: Similar paths have shaped Dakota Marker battle", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Matt Zimmer", "Austin Sumner"], "text": "Rivalry clash: Similar paths have shaped Dakota Marker battle Matt Zimmer , mzimmer@argusleader.com 9:50 p.m. CDT September 30, 2015 SDSU quarterback Austin Sumner rolls out against NDSU last season. After winning four of the first six meetings, the Jackrabbits have dropped seven straight to the Bison. (Photo: AP) 5 CONNECT 4 TWEET LINKEDIN COMMENT EMAIL MORE \nBROOKINGS – When the old North Central Conference began to disintegrate in 2003 with the departure of North Dakota State and South Dakota State to the Division I level, it left schools on both sides of the breakup scrambling for dance partners. \nThe Bison had long battled the University of North Dakota for Division II supremacy, and the Jackrabbits had shared a heated conflict with the South Dakota Coyotes, and, to a slightly lesser extent, Augustana Vikings. \nOnce the State schools went D1, USD and Augie awkwardly joined hands for a few years, and the Bison and Jackrabbits shacked up together as partners in transition. On the football side of things, they created the Dakota Marker traveling trophy to consummate the rivalry. \nBoth of those new-old rivalries felt, to a degree, forced. Opponent Report: NDSU Bison \nThat was in 2004, and a lot has happened since. USD eventually followed their old mates to Division I and gained acceptance to the Summit League and the Missouri Valley Football Conference. UND also made the jump, then promptly spun off into outer space (as far as their ex-NCC foes are concerned). \nThe Bison and UND rekindled their rivalry on the football field for the first time in over a decade just two weeks ago, and the Jacks and Coyotes are once again sharing a conference. Being just 100 miles apart on I-29, the South Dakota schools resuming their rivalry was important to the state. \nBut there’s no rule that says you can only have one rivalry, and with the Dakota Marker battle now more than a decade old and both teams currently ranked in the top 10 of the FCS Top 25 poll, Jacks/Bison has certainly emerged as one of the premier faceoffs in FCS football. The teams square off Saturday night at Coughlin-Alumni Stadium. \n“It’s more exciting because it’s not just a football game,” said SDSU coach John Stiegelmeier, whose 3-0 team is ranked 7th in the nation. “This game is the for the Dakota Marker, it’s a rivalry, it’s the start of Missouri Valley conference play – it’s a game where if you put one in the win column there’s more that follows it. We want our guys to be excited about the opportunity.” \nFor the Bison, it’s a similar story. While reacquainting themselves with UND was a big deal to the state, this game has much more at stake. They lead the Dakota Marker series 7-4. North Dakota State Bison still team to beat in the FCS “If you were a player here in the 70s, 80s or 90s you’d say UND was the top rival,” said Bison coach Chris Klieman, whose 2-1 team is ranked 2nd in the nation. “But (two weeks ago) was my first time playing them, and the guys on our roster had never played them. It was a big game, make no mistake, it was in our state and meant a lot to our alums, but it was not a conference game. SDSU is a big game. The Marker is the only trophy we play for, and I know that makes this really important.” \nIf there’s one thing that separates this rivalry from others past and present, it’s the relative civility within. SDSU and NDSU had to lean on one another to a great degree when they transitioned to Division I, and their similarly strong profiles as institutions were instrumental in turning both the Summit League and the MVFC into what they are today. \nThat’s not to say both teams won’t be looking to punish their opponent Saturday, but there seems to be a limit to how much bad blood can be mustered between the two programs (between the fans may be another story). \n“It’s not horribly chippy,” says Jacks senior linebacker TJ Lally. “There’s some of that, but it’s relatively respectful, as much as it probably could be, all things considered. These games are a ton of fun to play in. You can just sort of feel it in the air when it’s a rivalry game. Your senses are heightened and the blood really gets flowing. There’s no sense in denying that, but we do have to treat it like business, too.” \nSDSU controlled the series early in the transition to Division I, winning four of the first six meetings. But while the Jacks were developing into a quality Division I team, the Bison were building a juggernaut, and they’ve dominated the Jacks (and everyone else) in recent years. The four-time defending national champions have won seven straight games over SDSU, two of which came in the playoffs. That includes their most recent meeting, a 27-24 NDSU win at the FargoDome in which SDSU led late but couldn’t hold on. Opponent Report: NDSU Bison \nThat means the Jacks’ seniors have never beaten the Bison. In much the same way SDSU finally got its first win over an FBS team after a handful of close calls by beating Kansas in the season opener, the Jacks feel the time is now to cross a win over NDSU off the bucket list. \n“We feel like it’s our time to get it done,” said senior defensive end JR Plote. “They’ve been there, they know what it takes and they obviously want to keep that going. We’re all confident – last year we were right there, we had ‘em. It’ll be nice this time to have them at home with a big crowd. Hopefully that can be the difference.” 5 CONNECT 4 TWEET LINKEDIN COMMENT EMAIL MORE Read or Share this story: http://argusne.ws/1FGot5L TOP VIDEOS", "external_links": [], "published": "2015-10-01T05:50:00.000+03:00", "crawled": "2015-10-01T07:25:54.675+03:00", "highlightTitle": ""}