{"organizations": [], "uuid": "d127c261c20a68f9f362a808f62e567657c19c99", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.denverpost.com", "main_image": "http://extras.mnginteractive.com/live/media/site36/2015/1015/20151015__20151016_A10_BZ16VAILCLIMATE~p1.jpg", "site_section": "http://www.denverpost.com/", "section_title": "Colorado Breaking News, Sports, Weather, Traffic, Jobs - The Denver Post", "url": "http://www.denverpost.com/business/ci_28977007/researcher-warming-trend-trouble-vail-value-despite-summer", "country": "US", "title": "Researcher: Warming trend trouble for Vail value, despite summer hedge", "performance_score": 0, "site": "denverpost.com", "participants_count": 1, "title_full": "Researcher: Warming trend trouble for Vail value, despite summer hedge - The Denver Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T20:01:00.000+03:00", "replies_count": 0, "uuid": "d127c261c20a68f9f362a808f62e567657c19c99"}, "author": "Jason Blevins", "url": "http://www.denverpost.com/business/ci_28977007/researcher-warming-trend-trouble-vail-value-despite-summer", "ord_in_thread": 0, "title": "Researcher: Warming trend trouble for Vail value, despite summer hedge", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Climate exposure. At first glance, that can mean getting a sunburn. Or frostbite. But it can also mean risking dollars.\nFor investors in snow-reliant companies such as Vail Resorts, climate exposure means potential financial losses as warming trends decimate winter resort revenue, according to researchers at the Steyer-Taylor Center for Energy Policy and Finance at Stanford University.\nResearch fellow Donna Bebb recently analyzed how winter temperature variations and declining snowfall in the West impact the equity valuation of the continent's largest resort operator.\nBebb's climate-exposure model uses the financial burden of increased snowmaking, water scarcity, rising energy prices and energy-efficiency upgrades and the impacts of declining snowfall to assess Vail Resorts' valuation over the next three to five years.\nWorking around weather is nothing new for ski resorts. But the sustained drought in California has amplified resort strategies.\nVail Resorts is leading the charge in developing warm-weather activities that, ideally, could offset potential changes in winter business. (Although the company assures analysts that its expansive summer-development plans are a growth strategy, not a hedge.)\nAdvertisement The company, with nine major resorts in Colorado, California and Utah, also leads the industry in pass sales, selling more than 300,000 Epic Passes every season. That season-pass revenue — which climbed 22 percent in the company's fiscal 2015 year , fueling its highest-ever annual revenue of $1.4 billion — irons out the seasonal flow of its largely winter-based businesses.\nVail Resorts also has increased the efficiency of its snowmaking equipment, which saved the company $2 million in energy costs last year.\nBut those strategies are working against a 20-year trend of declining seasonal snow totals across its network of resorts.\nSo is Vail — which traded at about $109 a share Thursday — a risky investment due to its climate exposure?\nNot quite. The Stanford study concluded that its climate exposure model lowered Vail Resorts' stock valuation by a mere 2.2 percent.\nStill, Bebb wrote, the model is a viable tool for investors — if only to remind them that climate change must be addressed in current valuations and that its financial impact can be measured.\n\"Despite efforts by Vail Resorts to offset the impact of lower snowfall on its valuation (by selling Epic Passes, increasing summer resort offerings, investing more in higher efficiency snowmaking equipment and other methods),\" she wrote, \"climate change negatively affects its financial performance.\"", "external_links": ["http://media.law.stanford.edu/organizations/programs-and-centers/steyer-taylor/Vail_Final.pdf"], "published": "2015-10-16T20:01:00.000+03:00", "crawled": "2015-10-16T20:05:07.145+03:00", "highlightTitle": ""}