{"organizations": [], "uuid": "445b3684bb7d927fd71404fd7cb576646a21439b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kctv5.com", "main_image": "", "site_section": "http://kctv5.com/category/208603/sports?clienttype=rss", "section_title": "KCTV Kansas City - Sports", "url": "http://www.kctv5.com/story/30323038/latest-mid-america-sports", "country": "US", "title": "Latest Mid-America sports", "performance_score": 0, "site": "kctv5.com", "participants_count": 1, "title_full": "Latest Mid-America sports - KCTV5", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T07:42:00.000+03:00", "replies_count": 0, "uuid": "445b3684bb7d927fd71404fd7cb576646a21439b"}, "author": "cbs8", "url": "http://www.kctv5.com/story/30323038/latest-mid-america-sports", "ord_in_thread": 0, "title": "Latest Mid-America sports", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BBA-ALCS \nEstrada leads Blue Jays over Royals 7-1 to force ALCS Game 6\nTORONTO (AP) - Marco Estrada pitched one-hit ball into the eighth inning, giving Toronto's tattered bullpen a rest and leading the Blue Jays over the Kansas City Royals 7-1 Wednesday to close to 3-2 in the American League Championship Series.\nTroy Tulowitzki broke open the game with a three-run double off Kelvin Herrera in the sixth, giving him seven RBIs in the series. Edwin Encarnacion had walked with the bases loaded against Edinson Volquez, who seemed flustered by close calls against the Royals.\nEstrada faced the minimum 20 batters before Lorenzo Cain walked with two outs in the sixth. Closer Roberto Osuna was perfect in the ninth.\nToronto forced the series back to Kansas City, where Yordano Ventura will start for the defending AL champions on Friday against David Price.\nMLS-RAPIDS-SPORTING KC \nPowers, Sarvas score in 2nd half; Rapids beat Sporting KC\nKANSAS CITY, Kan. (AP) - Dillon Powers and Marcelo Sarvas scored late goals and the Colorado Rapids beat Sporting Kansas City 2-0 on Wednesday night for their first road victory in the series since 2002.\nPowers chipped goalkeeper Tim Melia at the end of a counter attack in the 78th minute and, after Colorado was reduced to 10 men, Sarvas powered in a shot on another breakaway in the 86th.\nColorado (9-14-10) snapped a six-game winless streak, which included four straight losses. Sporting KC (13-11-9) needs to beat Los Angeles on Sunday to secure a playoff spot.\nZac MacMath made his second start of the season for Colorado and got his first shutout. Sam Cronin picked up his second yellow card in the 84th on a high challenge of Jordi Quintilla.\nSporting KC's best scoring chance came when Dominic Dwyer played a through ball inside the box in the 71st, but Graham Zusi's shot hit off the crossbar. Two minutes later, MacMath made a kick save of Soni Mustivar's deflected shot.\nRAMS-GURLEY'S CEILING \nGurley rolling for Rams - even if not quite 100 percent\nST. LOUIS (AP) - The last two games, Todd Gurley has 305 yards rushing. Just wait, St. Louis Rams coach Jeff Fisher says, till the rookie is 100 percent.\nThe 10th pick of the draft appears ahead of schedule coming off left knee surgery that cut short his final college season at Georgia. He's wearing a brace in games to protect the knee, but that hasn't been a hindrance, judging from the production.\n\"I mean, I'm fine,\" Gurley said after practice Wednesday. \"I'm pretty sure 100 percent of the guys in the NFL are not 100 percent and I've been doing fine so far. Just got to stay on top of things.\"\nIn a conference call with reporters in Cleveland, this week's opponent, Gurley said he can do everything he could before getting hurt. He said there was plenty of room for improvement across the board.\n\"I've seen plenty of guys come back from this injury,\" Gurley said. \"I felt like I didn't have any problems, that I should be able to come back and play.\"\nFisher wouldn't place a percentage on Gurley's health, but said it was prudent to protect the ACL.\nBLUES-STASTNY OUT \nBlues forward Stastny out at least 5 weeks with broken foot\nST. LOUIS (AP) - St. Louis Blues forward Paul Stastny will be sidelined at least five weeks with a broken right foot.\nThe 29-year-old Stastny was injured in the second period of a 4-3 victory in Vancouver on Friday. He has a goal, four assists and a plus-four rating in five games.\nThe team placed Stastny on injured reserve Wednesday and said the injury will be re-evaluated in five weeks.\nStastny was hampered by a shoulder injury last season, his first with the Blues. He had 46 points in 74 games.\nSEC-MEDIA DAY-PRESEASON FAVORITES \nKentucky picked to win SEC men's title again on media day\nCHARLOTTE, N.C. (AP) - Kentucky has been picked to win the Southeastern Conference men's basketball crown, even if the Wildcats won't have much of the roster from their Final Four run last year.\nKentucky received 406 points from the panel of SEC and national media. The poll was released Wednesday. It's the 11th time since 1998-99 the Wildcats were voted preseason favorites.\nKentucky forward Skal Labissiere, among six freshmen on its roster, was picked for the preseason all-conference team along with teammate Tyler Ulis. Another freshman, LSU forward Ben Simmons, was chosen as SEC player of the year. He joins former Kentucky forward Julius Randle as the only players picked to win the award before playing their first college game.\nVanderbilt was second in the poll, followed by Texas A&M, LSU, Georgia and Florida.\nCopyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-10-22T07:42:00.000+03:00", "crawled": "2015-10-22T12:52:08.457+03:00", "highlightTitle": ""}