{"organizations": [], "uuid": "c108560964a72aea4363a315b40dd3ab8b67c2dc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.baltimoresun.com", "main_image": "http://www.trbimg.com/img-5625736c/turbine/ph-cc-sp-terps-cockerille-1019", "site_section": "http://www.baltimoresun.com/sports/rss2.0.xml", "section_title": "Sports - Baltimore Sun", "url": "http://www.baltimoresun.com/sports/ph-cc-sp-terps-cockerille-1019-story.html", "country": "US", "title": "Maryland moves Shane Cockerille back to quarterback", "performance_score": 0, "site": "baltimoresun.com", "participants_count": 1, "title_full": "Maryland moves Shane Cockerille back to quarterback", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T01:38:00.000+03:00", "replies_count": 0, "uuid": "c108560964a72aea4363a315b40dd3ab8b67c2dc"}, "author": "Daniel Gallen", "url": "http://www.baltimoresun.com/sports/ph-cc-sp-terps-cockerille-1019-story.html", "ord_in_thread": 0, "title": "Maryland moves Shane Cockerille back to quarterback", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "var ssaUrl = ('https:' == document.location.protocol ? 'https://' : 'http://') + 'pixel.sitescout.com/iap/0ea84626951144d2';new Image().src = ssaUrl;\"/> Tracking the Terps Maryland moves Shane Cockerille back to quarterback Shane Cockerille Lloyd Fox / Baltimore Sun \nMaryland's Shane Cockerille, who switched from quarterback to fullback before the season began, is returning to quarterback. \nMaryland's Shane Cockerille, who switched from quarterback to fullback before the season began, is returning to quarterback. (Lloyd Fox / Baltimore Sun) Daniel Gallen Contact Reporter Maryland moves Shane Cockerille (Gilman) back to quarterback in depth chart tweaks. \nWhen he took over as Maryland’s interim coach just more than a week ago, Mike Locksley promised that there would be some “tweaks” around the Terps. Last week, that included more music and competition periods in practice. And with the release of Maryland’s depth chart for this Saturday’s game against Penn State at M&T Bank Stadium, Locksley provided the first glimpse at what some of the in-game changes might be. \nRedshirt sophomore Shane Cockerille, who was converted from quarterback to fullback before the season started, is listed as the co-backup at quarterback with redshirt junior Caleb Rowe behind junior Perry Hills. \nCockerille has appeared in all six games this season with one start, and he’s caught one pass for seven yards in those appearances. Cockerille is a former Gilman standout and All-Metro Player of the Year who was rated a three-star recruit and the No. 16 dual-threat quarterback in the Class of 2013 by Rivals. He hasn’t appeared in a regular season game as a quarterback for Maryland. \nAfter Hills rushed 25 times for 170 yards and two touchdowns in a 49-28 loss to No. 1 Ohio State, Locksley said Maryland’s game plan will cater to Hills’ strengths, which means more emphasis on the quarterback running the ball. Cockerille, who’s listed at 6-foot-2, 235 pounds, plays to those strengths more than Rowe, senior Daxx Garman or freshman Gage Shaffer. Rowe has thrown 12 interceptions in five appearances (three starts) this season. \nOther changes on the depth chart include sophomore Jesse Aniebonam’s elevation to starter at defensive end. Aniebonam started in place of junior Roman Braglio (mono) at Ohio State, and sophomore Chandler Burkett is his backup.", "external_links": [], "published": "2015-10-20T01:38:00.000+03:00", "crawled": "2015-10-21T07:44:47.914+03:00", "highlightTitle": ""}