{"organizations": ["Tribune Media Co.", "Chicago Public Schools", "Eastdil Secured", "Indiana University", "Ex-Chicago Public Schools", "Eau Claire", "Tribune Tower"], "uuid": "b2262cd757fa4020758e4828b7f41dc92e8b974b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wqow.com", "main_image": "", "site_section": "http://www.WQOW.com/Global/category.asp?C=13566&clienttype=rss", "section_title": "WQOW TV News 18 - National Sports - Headline", "url": "http://www.wqow.com/story/30219008/uofl-foundation-hires-firm-to-review-escort-allegations", "country": "US", "title": "UofL foundation hires firm to review escort allegations", "performance_score": 0, "site": "wqow.com", "participants_count": 0, "title_full": "UofL foundation hires firm to review escort allegations", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T04:03:00.000+03:00", "replies_count": 0, "uuid": "b2262cd757fa4020758e4828b7f41dc92e8b974b"}, "author": "", "url": "http://www.wqow.com/story/30219008/uofl-foundation-hires-firm-to-review-escort-allegations", "ord_in_thread": 0, "title": "UofL foundation hires firm to review escort allegations", "locations": ["Oregon", "American", "Chicago", "Louisiana", "Northern California"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Paul Prudhomme", "An   Prudhomme"], "text": "UofL foundation hires firm to review escort allegations - WQOW TV: Eau Claire, WI NEWS18 News, Weather, and Sports Member Center: A look at Chicago's Tribune Tower as it goes up for sale A 36-story Chicago landmark, the Tribune Tower, is up for sale. Tribune Media Co. announced Thursday that it has hired real estate investment banking firm Eastdil Secured to explore a sale or find a partner to help... More >> A 36-story Chicago landmark, the Tribune Tower, is up for sale. Tribune Media Co. announced Thursday that it has hired real estate investment banking firm Eastdil Secured to explore a sale or find a partner to help... More >> After     An   Prudhomme, Louisiana chef who popularized Cajun food, dies Paul Prudhomme, the Cajun who popularized spicy Louisiana cuisine and became one of the first American restaurant chefs to achieve worldwide fame, died Thursday. He was 75. More >> Paul Prudhomme, the Cajun who popularized spicy Louisiana cuisine and became one of the first American restaurant chefs to achieve worldwide fame, died Thursday. He was 75. More >> In     Lawsuit   Indiana U. fraternity charter revoked over explicit video Indiana University said Thursday it has suspended the local chapter of the Alpha Tau Omega fraternity while it investigates a video purportedly showing a pledge performing a sex act on a woman during an apparent... More >> Alpha Tau Omega revoked the charter and closed its Indiana University chapter Thursday following the release of a video purportedly showing a fraternity member performing a sex act on a woman. More >> Gun found during arrest of 3 in tantra teacher's death A tantra teacher who made DVDs on yoga for lovers and taught classes at a clothing-optional retreat was found shot to death on a hiking trail in Northern California, still holding onto the leash of his wounded dog,... More >> Authorities have recovered the gun believed to be the one used to kill a popular tantra yoga teacher when they arrested three young people in Oregon traveling in the victim's car, a sheriff's spokesman said Thursday. More >> Ex-Chicago Public Schools leader charged with corruption The former CEO of Chicago Public Schools will plead guilty in an indictment that alleges she was involved in a scheme to steer $20 million worth of no-bid contracts to education companies in exchange for bribes and... More >> The former CEO of Chicago Public Schools will plead guilty in an indictment that alleges she was involved in a scheme to steer $20 million worth of no-bid contracts to education companies in exchange for bribes and... More >>", "external_links": [], "published": "2015-10-09T04:03:00.000+03:00", "crawled": "2015-10-09T04:12:44.249+03:00", "highlightTitle": ""}