{"organizations": ["UMBC", "BU"], "uuid": "58027245da7cf01a194a3aec177377b95fc36275", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wbng.com", "main_image": "http://media.wbng.com/images/bu+wsoc+102215.jpg", "site_section": "http://wbng.com//sports/index.rss2", "section_title": "WBNG - Sports", "url": "http://www.wbng.com/sports/BU-edges-UMBC-for-second-straight-win-336119561.html", "country": "US", "title": "BU edges UMBC for second straight win", "performance_score": 0, "site": "wbng.com", "participants_count": 0, "title_full": "BU edges UMBC for second straight win", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T06:11:00.000+03:00", "replies_count": 0, "uuid": "58027245da7cf01a194a3aec177377b95fc36275"}, "author": "", "url": "http://www.wbng.com/sports/BU-edges-UMBC-for-second-straight-win-336119561.html", "ord_in_thread": 0, "title": "BU edges UMBC for second straight win", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BU edges UMBC for second straight win \nBy wbng sports October 22, 2015 Updated Oct 22, 2015 at 11:11 PM EDT \nVestal, NY (WBNG Binghamton) Senior midfielder Katherine Corcoran finished off a great setup by freshman Julianne Johnston in the 57th minute and Binghamton women's soccer (3-11-2, 2-4-1 America East) made the goal stand up in a 1-0 win over visiting UMBC (4-10-3, 2-3-2 AE) Thursday night at the Bearcats Sports Complex. The win extended BU's unbeaten string to three games and kept the team's playoff hopes alive heading into the regular-season finale on Sunday. \n\"We wanted to play with heart and leave our guts out there tonight and everyone did a great job,\" head coach Sarah McClellan said. \"We've started to build some momentum now. It's tough when you're losing games and your confidence goes down but we had to keep staying positive and the players have responded and have done a great job to push their envelope in what they're able to do. To still be alive right now for a playoff spot ... it wasn't looking good earlier in the season but we've clawed back and that's a real testament to the team staying committed to the process.\" \nWBNG E-News - Sign Up For Our Newsletter! \nOn the scoring play, Johnston made a hard challenge and stripped a Retrievers' defender of the ball on the BU side of midfield. She then began a run into the offensive third and threaded a through ball behind a pair of defenders to a streaking Corcoran. The speedy senior took two dribbles and sent a low, right-footed shot that banked in off the left post to snap a scoreless tie. It was Corcoran's second goal of the season and Johnston's first career assist. \n\"It was a beautiful combination goal and an excellent finish from Kat ... she couldn't have placed it any better,\" McClellan said. \"We're getting more chances now and feeling confident that one or more will go in.\" \nBinghamton enjoyed a 17-8 advantage in shots and had several high-quality strikes go wide, especially in the game's first 20 minutes. \nSophomore keeper Katie Hatziyianis made six saves to register her second straight shutout and third of the season. \nWith the win, BU (7 pts.) moves into a tie for seventh place with Albany and closes to within one point of UMBC in the standings. Six teams, however, were in action later Thursday night and those outcomes will affect Binghamton's playoff scenarios heading into Sunday's 1 p.m. home tilt with Vermont. The Bearcats' five seniors will be honored before the game. \n(Courtesy: Binghamton University Athletics)", "external_links": [], "published": "2015-10-23T06:11:00.000+03:00", "crawled": "2015-10-23T08:41:07.098+03:00", "highlightTitle": ""}