{"organizations": [], "uuid": "8271ecf4bbd2f81f31bb97483171b0a7c60a6fd1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "wtop.com", "main_image": "http://wtop.com/wp-content/uploads/2015/10/Azerbaijan-Italy-Euro-Soccer.jpeg", "site_section": "http://wtop.com/section/sports/feed/", "section_title": "WTOP » Sections » Sports", "url": "http://wtop.com/sports/2015/10/el-shaarawy-ends-drought-as-italy-qualifies-for-euro-2016/", "country": "US", "title": "El Shaarawy ends drought as Italy qualifies for Euro 2016", "performance_score": 0, "site": "wtop.com", "participants_count": 1, "title_full": "El Shaarawy ends drought as Italy qualifies for Euro 2016", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T21:29:00.000+03:00", "replies_count": 0, "uuid": "8271ecf4bbd2f81f31bb97483171b0a7c60a6fd1"}, "author": "wtopstaff", "url": "http://wtop.com/sports/2015/10/el-shaarawy-ends-drought-as-italy-qualifies-for-euro-2016/", "ord_in_thread": 0, "title": "El Shaarawy ends drought as Italy qualifies for Euro 2016", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Home » News » Sports » El Shaarawy ends drought… El Shaarawy ends drought as Italy qualifies for Euro 2016 By ANDREW DAMPF October 10, 2015 2:29 pm Italy's players celebrate after scoring goal during the Euro 2016 group H qualifying soccer match between the Azerbaijan and Italy at the Olympic stadium in Baku, Azerbaijan, Saturday, Oct. 10, 2015. (AP Photo/Mindaugas Kulbis) \nStephan El Shaarawy ended a three-year drought by scoring the winning goal as Italy beat Azerbaijan 3-1 Saturday to qualify for next year’s European Championship. \nAfter Eder’s opener and an equalizer from Dmitri Nazarov, El Shaarawy finished off a counterattack in the 43rd for his first national team goal since November 2012. \nManchester United’s Matteo Darmian added another for Italy in the second half. \nNorway also took a big step toward qualifying for the tournament in France with a 2-0 win over Malta. \nAlexander Tettey and Alexander Soderlund scored either side of halftime for Norway in Oslo. \nNorway is seeking its second tournament appearance after exiting from the group stage in 2000. \nItaly has 21 points in Group H, Norway is next with 19 and Croatia, which hosts Bulgaria later, is third with 14. Bulgaria has eight points, Azerbaijan six and Malta two. \nThe top two finishers from the nine groups qualify automatically. The best third-place finisher also qualifies automatically, while the eight other third-place teams can reach the tournament through a playoff. \nNorway is guaranteed at least a playoff spot, although Croatia holds the tiebreaker with a better head-to-head record. \nItaly can secure first place against Norway in Rome on Tuesday. \nThe Azzurri are under pressure to perform after getting eliminated from the group stage at the last two World Cups. Since winning the 2006 World Cup, Italy’s only highlight was reaching the final of Euro 2012. \nOn a rainy evening in Baku, Azerbaijan played its first match in the new Olimpiya stadium, while Italy had to overcome the absence of injured playmaker Andrea Pirlo. \nEleven minutes in, Pirlo’s replacement Marco Verratti launched a long, vertical pass for Eder that gave the Brazilian-born forward plenty of room to glide past the defense and easily beat goalkeeper Kamran Agayev. \nIt was Eder’s second goal in five matches for Italy. He also has six goals in seven Serie A matches this season for Sampdoria. \nMinutes later, Eder turned provider for Graziano Pelle, who shot on target and had Agayev tip his effort over the bar. \nJust after the half-hour mark, a defensive lapse allowed Nazarov to score from the edge of the area, with Giorgio Chiellini and Leonardo Bonucci sharing the blame. \nEl Shaarawy restored Italy’s lead by redirecting a cross from Antonio Candreva into an empty net on a play that began with Pelle. \nThe son of an Egyptian father and an Italian mother, the 22-year-old El Shaarawy has been hailed as one of Italy’s best young players for years but he struggled with injuries and confidence in recent seasons. After failing to make Italy’s squad for last year’s World Cup, El Shaarawy transferred from AC Milan to Monaco. \nIn the 61st, a lob effort from an outstanding Eder was cleared off the line by Azerbaijan captain Rashad Sadygov, who was celebrating his 100th national team appearance. \nFour minutes later, Darmian got his first goal for Italy with a long, powerful effort after taking a loose ball beyond the area. \nAzerbaijan defender Badavi Huseynov was shown a direct red card for a last-man foul on substitute Sebastian Giovinco in the 88th and Giovinco’s ensuing free kick hit the crossbar. \n___ \nAndrew Dampf can be followed at www.twitter.com/asdampf Topics:", "external_links": [], "published": "2015-10-10T21:29:00.000+03:00", "crawled": "2015-10-10T21:53:03.936+03:00", "highlightTitle": ""}