{"organizations": [], "uuid": "1b498f78ecd0a29c55ca5c739f8741dedb0d43b9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chronicle-express.com", "main_image": "http://www.chronicle-express.com/Global/images/head/nameplate/pennyanchronicleexpress_logo.png", "site_section": "http://www.chronicle-express.com/sports?template=rss&mime=xml", "section_title": "Sports - The Chronicle Express", "url": "http://www.chronicle-express.com/article/20151017/SPORTS/151019769/2000/NEWS?rssfeed=true", "country": "US", "title": "Mustangs lose regular season finale to ER/Gananda 41-18", "performance_score": 0, "site": "chronicle-express.com", "participants_count": 1, "title_full": "Mustangs lose regular season finale to ER/Gananda 41-18", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T19:03:00.000+03:00", "replies_count": 0, "uuid": "1b498f78ecd0a29c55ca5c739f8741dedb0d43b9"}, "author": "Gary Pinneo", "url": "http://www.chronicle-express.com/article/20151017/SPORTS/151019769/2000/NEWS?rssfeed=true", "ord_in_thread": 0, "title": "Mustangs lose regular season finale to ER/Gananda 41-18", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted Oct. 17, 2015 at 11:03 AM By Gary Pinneo Posted Oct. 17, 2015 at 11:03 AM East Rochester The 2015 regular season football schedule came to an end for the Penn Yan Mustang football team Friday night in East Rochester. Unfortunately for the local 11, it ended on a sour note. After starting the season on a high note, winning their first four games, the Orange and Blue gridiron forces ended the campaign with 3 straight losses. Penn Yan ended their regular season schedule with a disappointing 41-18 loss to a very talented East Rochester/Gananda team on a rainy, chilly night in East Rochester. The loss dropped the Mustang's record to 4-3. the victorious ER Bombers finished the regular season with a perfect 7-0 record and claimed the Finger Lakes East crown with the win. The ER Brown Bombers jumped out to a quick 7-0 lead in the first quarter. The visiting Mustangs answered with a tally of their own. Senior Quarterback Tanner Irwin ran the ball in from 1 yard out and Penn Yan trailed 7-6. This would be as close as the Yates County gridiron forces would get in this game. East Rochester scored two more times before Penn Yan could cross the goal line again. Sophomore Dylan Stape grabbed a 47-yard scoring strike from Tanner Irwin and the Mustangs trailed 22-12. But this game would belong totally to the high flying East Rochester hosts. They would pile on two more touchdown to build up a 41-12 lead. The Bomber defense stonewalled the Mustangs the rest of the way. Penn Yan did score one final time, but it was their defense that delivered this 6 points. Drew Starkey recovered a fumble in the Bomber end zone, but it would prove to be too little, too late for the Orange and Blue youngsters. The clock ran out in this game and also on the regular season. Final score East Rochester/Gananda 41, Penn Yan 18. As mentioned earlier, Penn Yan finishes their regular campaign with a 4-3 record. A red hot start finished with a stone cold finish. Up next for Penn Yan will be the Section V tournament. The Mustangs will most likely be paired with a difficult opponent on the road in this tournament. But hope always springs eternal. Maybe the Penn Yan eleven will be up to starting another 4 game winning streak. Mynderse 22 Marcus Whitman 12 The Marcus Whitman Wildcat concluded their regular season Friday night in Rushville against Mynderse Academy. The Blue Devils defeated the hometown Wildcats 22-12 in this Finger Lakes West match up. Whitman finishes their regular season with a 0-7 record. More details on this game will follow. By Gary Pinneo", "external_links": [], "published": "2015-10-17T19:03:00.000+03:00", "crawled": "2015-10-17T18:32:31.389+03:00", "highlightTitle": ""}