{"organizations": [], "uuid": "792937604096751a643151938ef20416ff7e3b2b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "http://www.bostonherald.com/sites/default/files/media/2015/10/24/25UMASS.1.jpg", "site_section": "http://bostonherald.com/sports", "section_title": "Sports | Boston Herald", "url": "http://bostonherald.com/sports/college/college_football/2015/10/no_19_rockets_rally_back_on_minutemen", "country": "US", "title": "No. 19 Rockets rally back on Minutemen", "performance_score": 0, "site": "bostonherald.com", "participants_count": 1, "title_full": "No. 19 Rockets rally back on Minutemen | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T11:45:00.000+02:00", "replies_count": 0, "uuid": "792937604096751a643151938ef20416ff7e3b2b"}, "author": "Bob McGovern", "url": "http://bostonherald.com/sports/college/college_football/2015/10/no_19_rockets_rally_back_on_minutemen", "ord_in_thread": 0, "title": "No. 19 Rockets rally back on Minutemen", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "No. 19 Rockets rally back on Minutemen Bob McGovern Sunday, October 25, 2015 DOWNCAST: UMass coach Mark Whipple reacts on the sideline during his team’s third-quarter meltdown against No.  19 Toledo at Gillette Stadium in Foxboro. comments Tweet FOXBORO — UMass shocked the college football world . . . for a half.\nBut then Toledo — an undefeated team with its sights set on a New Year’s bowl game — lived up to its billing.\nAfter jumping out to an 18-point lead at the half, the Minutemen capsized.\nThe No. 19 Rockets scored 38 unanswered points — paced by three touchdowns on three drives in the third quarter — and shut down a UMass offense that had been humming. Toledo ran away from the Minutemen, 51-35, in front of 12,793 at Gillette Stadium.\n“It’s a tale of two halves,” said UMass receiver Tajae Sharpe, who finished the day with 159 receiving yards and two touchdowns. “They played better than we did in the second half.”\nRockets quarterback Phillip Ely, who tossed three interceptions in the first half, threw three touchdowns in the third quarter. He hit tight end Michael Roberts with a 4-yard touchdown toss with 1:56 left in the quarter, and a Jameson Vest extra point put Toledo (6-0, 3-0 MAC) ahead 31-28.\nRunning back Terry Swanson barreled in from a yard out to start the fourth quarter, and an extra point gave the Rockets a 38-28 lead. Ely, who finished the game with five touchdown passes, hit wide receiver Cody Thompson for a 31-yard touchdown pass with 10:59 remaining to push the Toledo lead to 45-28.\nA Vest field goal with 6:31 left padded the Rockets’ lead, 48-28. Quarterback Blake Frohnapfel found Sharpe for a short touchdown toss on the next drive for UMass (1-6, 0-3 MAC).\nBut Vest responded with another field goal, finishing up the scoring.\n“They showed why they’re ranked where they are — why they’re 7-0,” UMass coach Mark Whipple said. “We’re still looking to play a complete game.”\nUMass took what appeared to be a commanding 28-10 lead with 8:23 left in the first half when running back Marquis Young bolted between the tackles, untouched, for a 50-yard touchdown run. Logan Laurent’s extra point gave the Minutemen a 28-10 lead with 8:23 left in the half.\n“There was no miracle speech. It was just — regroup,” Toledo coach Matt Campbell said. “I thought our kids were poised and I thought we did an unbelievable job in the second half.”\nThe final score was set up after Ely tossed his third interception of the half and defensive back Trey Dudley-Giles returned the pick to the UMass 47-yard line, but fumbled. Defensive back Joey Colton recovered for the Minutemen at the 50.\nThe Minutemen jumped ahead 21-10 as Frohnapfel hit Sharpe with a 35-yard touchdown pass with 11:10 left in the half. Frohnapfel completed all four of his passes on the drive to Sharpe — an NFL-level talent who has been rewriting UMass’ record books this season.\nFrohnapfel had two other touchdown passes in the first half, one to tight end Rodney Mills and the other to wide receiver Shakur Nesmith, who has been silent for most of the season.\n“That was definitely our best half of football,” UMass cornerback Randall Jette said.\nToledo’s only touchdown in the half was a 20-yard Ely toss to wide receiver Corey Jones with 13:10 left in the half. Other than that, the Minutemen held the Rockets to a field goal on its first drive of the game.", "external_links": ["http://player.mediabong.net/se/56.js?url=", "https://twitter.com/share?text=No.%E2%80%8919+Rockets+rally+back+on+Minutemen"], "published": "2015-10-25T11:45:00.000+02:00", "crawled": "2015-10-25T12:25:41.274+02:00", "highlightTitle": ""}