{"organizations": [], "uuid": "1a0a40e8df6bea6748b8162a5bf4384436fe05d8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "http://images.tribuneindia.com/cms/gall_content/2015/10/2015_10$largeimg19_Monday_2015_233507978.jpg", "site_section": "http://www.tribuneindia.com/", "section_title": "The Tribune, Chandigarh, India : Latest news, India, Punjab, Chandigarh, Haryana, Himachal, Uttarakhand, J&amp;K, sports, cricket ", "url": "http://www.tribuneindia.com/news/haryana/government-must-move-beyond-white-paper/148103.html", "country": "US", "title": "Government must move beyond ‘white paper’", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "Government must move beyond ‘white paper’", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "1a0a40e8df6bea6748b8162a5bf4384436fe05d8"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/haryana/government-must-move-beyond-white-paper/148103.html", "ord_in_thread": 0, "title": "Government must move beyond ‘white paper’", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Geetanjali Gayatri\nTribune News Service\nChandigarh, October 19\nHaryana Finance Minister Capt Abhimanyu weighs every single word he mouths much like a shrewd businessman — he knows exactly which investment can send his profits soaring or drown even the seed money. Unlike his “loud-mouthed” Cabinet collegues, he exercises restraint and pauses frequently when he speaks, realising fully that sound and fury seldom translate into any benefit. He “manages” weighty ministries, while his constituency and people seem to be begging for greater attention and time. This essentially sums up Capt Abhimanyu’s one year as a minister in the Manohar Lal Khattar government. A chief ministerial candidate during the Assembly elections last year, he has settled for ministership. And he has emerged as a “heavyweight” minister with 12 weighty ministries, including Finance, Industries, and Excise and Taxation. Known to “operate” without making too much noise, he is among the few who have direct access to the BJP top brass. With a finger in every pie, he plays a “juggler” — dividing his days to balance his assignment as a minister, his constituency and the “higher-ups” who matter in the larger scheme of things, though he is quick to point out that he does not visit Delhi more than twice a month. In the last one year, his departments have come out with a “White Paper” on the state’s finances to castigate the previous Congress government, while the new industrial policy announced recently has been showcased as the “big business-getter”. Besides, the prime mover behind a 10-day “business” trip to the US and Canada to market Haryana, Capt Abhimanyu has been made a constant and consistent intervention in the Assembly debates. That, then, accounts for most of his “achievements” which are way more that those compared with his colleagues. That, incidentally, is exactly what Capt Abhimanyu, a first-time legislator, is out to prove as he learns the ropes of government’s functioning. He is in the state’s capital for four days in a week on an average, while meetings of his departments keep him occupied. This makes accessibility an issue, though he meets the public every afternoon at his residence. Most other meetings happen only through appointments. The “over-burdened” minister, obviously, has no option but to devote greater time to some departments at the cost of ignoring others. Similarly, his official work takes up so much of his time that he is able to devote only one day in a week to his constituency Narnaund, where he is busy with programmes most of the time. Though he has pushed through an ITI and a college for his constituency, besides a few other projects, it does not seem enough to do justice to the reputation of one of the “most powerful” ministers in the Cabinet.", "external_links": [], "published": "2015-10-20T03:00:00.000+03:00", "crawled": "2015-10-20T10:07:02.272+03:00", "highlightTitle": ""}