{"organizations": [], "uuid": "25a2b8b623963f9935d87d5fe35ce90389eb8bfa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/47529300.cms", "site_section": "http://timesofindia.indiatimes.com/sports/football/champions-league/articlelist/40924344.cms", "section_title": "Top Stories - Champions League - Football - Sports - The Times of India", "url": "http://timesofindia.indiatimes.com/sports/football/champions-league/top-stories/Smalling-pleased-with-win-but-not-performance/articleshow/49180565.cms", "country": "IL", "title": "Smalling pleased with win, but not performance", "performance_score": 0, "site": "indiatimes.com", "participants_count": 1, "title_full": "Smalling pleased with win, but not performance - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "25a2b8b623963f9935d87d5fe35ce90389eb8bfa"}, "author": "timesofindia.indiatimes.com", "url": "http://timesofindia.indiatimes.com/sports/football/champions-league/top-stories/Smalling-pleased-with-win-but-not-performance/articleshow/49180565.cms", "ord_in_thread": 0, "title": "Smalling pleased with win, but not performance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Manchester United made life difficult for themselves by dropping off and inviting pressure in the closing minutes of their 2-1 win over VfL Wolfsburg in the Champions League on Wednesday, defender Chris Smalling has said.\nThe England international scored the winner in the 53rd minute after Juan Mata won and converted a penalty that tied the game up for United, who went behind just four minutes into the tie.\n\"I think we ... could probably learn to manage and control games a little bit better in those last 10 minutes,\" Smalling told the club website (www.manutd.com).\n\"If you drop 10 yards deeper you invite that pressure. We held on and we deserved the three points.\n\"We started up against it after conceding a goal, but we created a lot of chances and deserved the win,\" the 25-year-old added.\nSmalling was delighted to secure his team's first win in the competition and praised Mata's display against the Bundesliga side.\n\"It was a great feeling (to score) and, with Juan, you never know what he's going to do with those tricks and flicks. He does them every day in training. You just have to gamble,\" Smalling said.\nHowever, manager Louis van Gaal insisted the diminutive Spaniard had much more to offer.\n\"I don't speak about individual performances, but I have seen Mata playing better than today,\" Van Gaal, who was far more effusive in his praise of Smalling, replied when asked by reporters about Mata's impact on the tie.\nThe Dutchman said Smalling's goal would give the player the confidence to find the back of the net more often.\n\"He played a very good match, especially defensively. The way he scored the goal was outstanding, especially for a defender and especially for him because he is not doing that so much,\" the manager said.\n\"Now he has the confidence to do that. I'm very pleased with his performance,\" he added.\nUnited, who top the Premier League table, have lost just twice in 12 games this season but must overcome fatigue if they are to see off fourth-placed Arsenal when they travel to the Emirates Stadium on Sunday, despite having 24 hours less to recover than their rivals.\n\"It was a very tough game because we were physically tired at the end,\" Mata said.\n\"We knew we had to win today. We are happy,\" he added.", "external_links": [], "published": "2015-10-01T03:00:00.000+03:00", "crawled": "2015-10-10T17:28:09.120+03:00", "highlightTitle": ""}