{"organizations": [], "uuid": "d7bbe6476665a5ff80c0e15dbe53124639c6c5f5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tigernet.com", "main_image": "http://i3.tigernet.com/stories/15/football/reader_d.j_miami_carl_700.jpg", "site_section": "http://feeds.feedburner.com/tigernet", "section_title": "TigerNet.com - Clemson Tigers Sports News", "url": "http://www.tigernet.com/story/football/Refreshed-Reader-ready-difference-14203", "country": "US", "title": "Refreshed: Reader ready to make a difference", "performance_score": 0, "site": "tigernet.com", "participants_count": 0, "title_full": "Refreshed: Reader ready to make a difference", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T19:01:00.000+02:00", "replies_count": 0, "uuid": "d7bbe6476665a5ff80c0e15dbe53124639c6c5f5"}, "author": "", "url": "http://www.tigernet.com/story/football/Refreshed-Reader-ready-difference-14203", "ord_in_thread": 0, "title": "Refreshed: Reader ready to make a difference", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Reader tackles Malik Rosier early in the fourth quarter Saturday \nMIAMI GARDENS, FL – Welcome back, D.J. Reader . \nClemson’s senior defensive tackle made his presence known early in the fourth quarter of Saturday’s 58-0 throttling of Miami, chasing down Miami quarterback Malik Rosier near the sideline. Reader’s jarring third-down tackle stopped Rosier a yard short of a first down, and Reader felt a wave a peace override the adrenaline. \nIt was good to be back. \nReader missed the first six games of the season while dealing with a personal issue, but practiced with the team last Monday and played in the win over Miami. He told the media after the game that he was just happy to be back with his teammates. \n“It was a good time out there today. I am thankful for the opportunity,” Reader said. “I think the team did really well, and I am proud of my guys. I am just happy to be out there with them. We played good as a defense and everybody was out there flying around. It was good to be back.” \nReader admitted that the death of his father, David, was something he was still dealing with and that he needed time away from the game to cope. \n“I felt like I wasn’t mentally ready to come into the season, had some things I needed to take care of,” Reader said. “I had a mental issue I needed to take care of, and I was given the opportunity to take care of it.” \nHe stayed in school and worked out with strength and conditioning coach Rendrick Taylor in Fike. \n“Most of the time I was by myself. Sometimes I would have a G.A. with me, but most of the time I was alone,” he said. “I was still in school and still working out. It just gave me time to think.” \nReader said his goal for the last half of the season is to contribute not only on the field, but as a leader. \n“Just come in here and add leadership to this team. Just fit in where I can,” he said. “They have done a great job, and all of those guys have played really well. Albert (Huggins) is coming along. I couldn't have asked for any more from them. I am just glad I am able to join those guys. It was really tough, and it's hard when you aren't living your normal life. I had something I needed to take care of and it's good to be back.” \nClemson head coach Dabo Swinney mentioned Reader in his postgame comments. \n“How about that guy, running over there and making that play on the sideline there on the third down? That’s a big load, man, he had some fresh legs, I’ll tell you that,” Swinney said. “It was good to see him back. I’m happy for him.” \nHis mind is refreshed, and so is his body, and Reader said he thinks the fact that he doesn’t have the pounding of half a season on his body will pay dividends in the long run. \n“I think so. I feel fresh,” he said. “But I am just going to take it one day at a time and I'm not going to push anything.” Rate this Story: Send Feedback to David Hood: Email | Comment", "external_links": [], "published": "2015-10-25T19:01:00.000+02:00", "crawled": "2015-10-26T10:33:17.992+02:00", "highlightTitle": ""}