{"organizations": [], "uuid": "8891d6a35ac09fa46af94614b3ba7dc524630685", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sun-sentinel.com", "main_image": "http://www.trbimg.com/img-561438b7/turbine/fl-miami-marlins-changes-1007-20151006", "site_section": "http://www.sun-sentinel.com/sports/rss2.0.xml", "section_title": "Sports - Sun Sentinel", "url": "http://www.sun-sentinel.com/sports/miami-marlins/fl-miami-marlins-changes-1007-20151006-story.html", "country": "US", "title": "Marlins' Samson regrets having GM as manager", "performance_score": 0, "site": "sun-sentinel.com", "participants_count": 1, "title_full": "Marlins' Samson regrets having GM as manager", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T00:12:00.000+03:00", "replies_count": 0, "uuid": "8891d6a35ac09fa46af94614b3ba7dc524630685"}, "author": "Craig Davis", "url": "http://www.sun-sentinel.com/sports/miami-marlins/fl-miami-marlins-changes-1007-20151006-story.html", "ord_in_thread": 0, "title": "Marlins' Samson regrets having GM as manager", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Marlins' Samson regrets having GM as manager Marlins' Samson admits mistake in making Jennings manager. \nMarlins president David Samson, left, said varoius factors worked against Dan Jennings in his switch from the front office to the dugout. \n\nMarlins president David Samson, left, said varoius factors worked against Dan Jennings in his switch from the front office to the dugout. \nCraig Davis Contact Reporter South Florida Sun-Sentinel Marlins' president Samson regrets unorthodox move of GM as manager; Jennings asked to return as general manage \nWith the Marlins' search already underway for a traditional manager, a top team official conceded Tuesday that the unorthodox move of installing general manager Dan Jennings as manager was a mistake. \nThe choice of Jennings, who is highly respected as a talent evaluator but had never managed above the high school level, to take over when Mike Redmond was fired May 17 following the Marlins' 16-22 start, was criticized throughout baseball. \nJennings has been asked to return to his former post in the front office. \nThe Marlins went 55-69 under him to finish 71-91 in third place in the National League East. The club came together in the final month, going 19-12 after Aug.31, the league's second-best record behind the Chicago Cubs. \nMarlins President David Samson said he now regrets the move. \n\"Do I regret doing what we did? I think it's hard to say that I don't because it did not have the desired result on the field, it did not accomplish what we expected it to accomplish,\" Samson said. \"So, do I regret coming to that conclusion? Yes, I do. I regret everything that doesn't work. \n\"I think he did the best he could given the fact that he was put in a less than ideal situation.\" \nAs to why Jennings didn't succeed in turning the season around, Samson said: \"I think there were a lot of factors. I think the fact he was coming from the front office, the fact it had never been done, the fact that he came in the middle of the season, the fact he was responsible for both putting players on the field and then what he did with them on the field — it's why you don't see a general manager/manager combination because that's very difficult. \n\"The reason we put Dan in there was we thought it was the right move. It wasn't.\" \nThe club reportedly has already interviewed three candidates (Manny Acta, Bo Porter, Larry Bowa) for the next manager and intends to talk to as many as 20, not necessarily confining the search to individuals who previously managed in the major leagues. \n\"We just want the right person,\" Michael Hill, Marlins president of Baseball Operations, said, adding the search \"will be extensive, it will be exhaustive. \n\"I'm not going to say whoever our next manager is will fit any mold. We want a leader that will help this talented young core to the next level.\" \nThe club also announced Tuesday that Ichiro Suzuki has been re-signed for 2016 and will pursue the 65 hits he needs for 3,000 in the major leagues with the Marlins at 42. \nSamson said the club will move the fences next season, and is working on a plan to bring them closer to the plate in some areas and lower them to a level that would enable outfielders to make leaping catches and on potential home run balls. \n\"The thought of a left fielder jumping in the Clevelander [nightclub] is sort of awesome to me,\" Samson said. \nConfusion remained as to whether Jennings wants to return to the front office or seek a job outside the organization. Samson and Hill said Jennings remains under contract (through 2018) as the general manager, and the club wants him to resume those duties. \nJennings did not attend the season-ending news conference, having returned to his home in Alabama. \n\"The fairest thing to say is he is tired and he is resting, trying to clear his head, because it was a long year,\" Hill said. \"But the expectation is that he'll be back as GM. We've asked him to come back. I expect him to be by my side as we start the offseason and start making decisions.\" \nThe next manager, who will be the fourth since 2012, will have control over shaping the coaching staff. The current coaches have been told they can pursue jobs elsewhere, except for first-base coach Perry Hill, who is under contract for next season and is highly regarded as an infield instructor. \nAs to the type of manager they are seeking, Samson said the club isn't set on a particular style of leadership. \n\"We're not saying we want someone fiery, we want someone old, we want someone young. That's how we'd done it in the past. We'd always gone exactly opposite,\" he said, \"That's generally how many organizations do it, and it has not worked for us doing that.\" \nThe Marlins have made changes in the front office, with Jeff McAvoy promoted to vice president of player personnel, Brian Chattin to assistant general manager and David Keller to director of pro scouting. \nMike Berger remains assistant general manager. There have been media reports of Berger possibly ascending to GM with Jennings falling out of favor. \n\"All this stuff that is being talked about isn't the case,\" Samson said. \"There is no power struggle, there is no division, there is nobody angling to take the general manager title away from Dan. \n\"Everything is the same. Dan has no authority to make decisions, and I would say that Mike Hill doesn't and I don't. Jeffrey [Loria] as the owner has all the power, but Jeffrey hears from his group and decisions are made. That's how it's always been.\" \nDuring his stint as manager, Jennings, always a loyal lieutenant to Loria, clashed with the owner. It is speculated that will have to be repaired before he returns to the front office. \nLast weekend in Philadelphia, Jennings said, \"From a standpoint of if I'm asked to go back upstairs, then there's conversations that are going to have to take place because I want to understand where things are — because I've been removed for 4 1/2 months.\"", "external_links": [], "published": "2015-10-07T00:12:00.000+03:00", "crawled": "2015-10-07T00:49:08.797+03:00", "highlightTitle": ""}