{"organizations": [], "uuid": "f8f75fe19101c7957deaa405d88004918314e676", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattlepi.com", "main_image": "http://ww4.hdnux.com/photos/41/07/34/8681271/5/rawImage.jpg", "site_section": "http://www.seattlepi.com/sports/more/", "section_title": "More Seattle Sports News / NBA, NHL, Golf, Tennis - seattlepi.com", "url": "http://www.seattlepi.com/local/article/Bursting-at-the-seams-Seattle-is-booming-but-6543852.php", "country": "US", "title": "Thanks to an influx of tech jobs, Seattle is booming -- but it's not easy to deal with", "performance_score": 0, "site": "seattlepi.com", "participants_count": 1, "title_full": "Thanks to an influx of tech jobs, Seattle is booming -- but it's not easy to deal with - seattlepi.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "f8f75fe19101c7957deaa405d88004918314e676"}, "author": "DANIEL DEMAY, SEATTLEPI.COM STAFF", "url": "http://www.seattlepi.com/local/article/Bursting-at-the-seams-Seattle-is-booming-but-6543852.php", "ord_in_thread": 0, "title": "Thanks to an influx of tech jobs, Seattle is booming -- but it's not easy to deal with", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "For Seattle, the road to recovery from the Great Recession has been much shorter than a lot of other places.\nWhile some regions are still struggling, Seattle's economy and population have skyrocketed in the last few years, largely thanks to a bustling tech sector.\nBut in the background, some important pieces have fallen behind.\nHousing stock hasn't yet responded to the influx of new residents, leading to an affordable-housing crisis. Rental vacancies are dangerously low and rents are skyrocketing, pushing many people to live outside the city or use most of their income for housing. And the city's transportation woes are larger than ever; a slight blip in traffic flow can lead to gridlock in the city for hours.\nWhile it's certainly possible to conclude that the city's economic boom is good, many are pointing fingers at the problems that come with such growth.\nPlenty of Seattleites are ready to blame Amazon and its stupendous growth for crowding the city and driving up costs. Others say city officials are too cozy with developers and have allowed short-term gains to drive growth at the cost of long-term planning. And still others argue that Seattle voters are to blame because they have stopped more sweeping approaches to development at the ballot box.\nBoom town\nThe gist of it is, Seattle is outgrowing itself -- it is bursting at the seams. And now everybody is scrambling to deal with that.\n\"We as a city government and as a region have not kept pace with that growth, and we have seen, especially in the area of transportation, our infrastructure be surpassed by all of that growth,\" said City Councilman Tim Burgess, who is vice-chair of the council's Planning, Land Use and Sustainability Committee.\nSeattle's population surged from 2010 to 2014, when more than 60,000 people moved to the city in what may be the biggest population boom in its history, according to U.S. Census Bureau statistics.\nAt the same time, the economy has also been on the upswing, with unemployment in the area rebounding from a 2010 high of roughly 9 percent to just 3.6 percent last year, according to the state Employment Security Department.\nBy most economists' measures, that's essentially full employment.\nBurgess pointed out that a recent revenue forecast showed that 43 percent of recent job growth in the region was due to the influence of two companies: Boeing and Amazon.\n\"We can understand Boeing, but Amazon has taken us all by surprise,\" Burgess said.\nAmazon alone employs more than 20,000 people in Seattle and its expansion in South Lake Union is pushing up skyscrapers all over the place.\nPhoto: CITY OF SEATTLE DEPARTMENT OF PLANNING AND DEVELOPMENT This 40-story building with 447 residential units over 7,367 square feet of retail and 382 parking spaces below ground is planned for 2202 Eighth Ave. But it's only one of many tower projects in the works in the city. This 40-story building with 447 residential units over 7,367 square... Click here to see some of the monster towers planned for Seattle.\nWhat's more, the company estimates it has created roughly 28,000 jobs through its presence in the area, leading to more than $5 billion in earnings for Washingtonians last year, according to statistics provided by Sam Kennedy with Amazon corporate communications.\nMany have criticized city officials for not predicting the growth, but that may not have been possible, at least according to one economist.\n\"I would say that some growth would be forecastable,\" said Elaina Rose, an associate professor of economics at the University of Washington, who specializes in labor economics. \"The magnitude, I don't think anybody would have seen that in advance.\"\nBut Amazon and fellow tech companies' staggering growth and its wider impacts on the city -- despite the economic boon to the Seattle -- have spurred more than a few negative reactions from locals who feel the growth has created a city that's unlivable.\nA changing town\nSeattle hasn't been a cheap place to live for a long time.\nThe '90s saw Microsoft and Boeing drive growth that pushed property values and most other costs of living higher than ever -- that is, until the housing bubble that drove real estate costs even higher before bursting in 2007 (or '08, depending on which factor you measure).\nToday, the housing market in the region is on fire again, with housing prices nearly back to 2007 heights.\nOnly this time, experts think it's unlikely that prices will take a dive anytime soon.\n\"Are we going to see the market fall off? I don't see that,\" said Don Zender, vice president of Evergreen Home Loans. \"I see Seattle transitioning into a bigger city.\"\nBut that promise also means that those who are already struggling to find affordable housing will continue to do so.\nMedian home prices have surged up, from a 2011 low of $358,000 to $516,000 last month, according to data from Zillow.com. Seattle-area rents are going through the roof as well.\nMany aging rental buildings are being remodeled or demolished in favor of upscale condos too pricey for low- and middle-income earners.\nAlready, the city estimates that more than 45,000 households are spending more than half their income on housing. Another 2,800 people are simply homeless on a given night in Seattle.\nTo deal with this, Mayor Ed Murray and the City Council created the Housing Affordability and Livability Agenda Committee. Recommendations from that committee shaped a plan by Murray to add 50,000 new homes in the next decade , with 20,000 of them affordable for people earning up to 80 percent of the area's median income.\nWhile low housing stock is one problem, the uptick in high-paying tech jobs is a major contributor to the rising costs of rentals and real estate, and some argue that the companies hiring those tech workers aren't doing enough for the people who aren't getting those high-paying jobs.\n\"When we were in the depths of the housing crunch, people said, man, when this turns around, we're going to be in a lot of trouble. And now we have nothing in the pipeline,\" said City Councilman Mike O'Brien, who chairs the Planning, Land Use and Sustainability Committee. \"And we have a lot of high wage earners coming to Seattle, and people who are lower on the wage totem pole are getting priced out.\"\nAmazon, for its part, has contributed more than $20 million to affordable-housing programs in Seattle, according to Kennedy.\nWhile those funds were required as part of developments Amazon has built in South Lake Union, Kennedy said the company actively chose to build there.\n\"Many years ago, Amazon had a choice. We needed more space,\" Kennedy said. \"We could move to the suburbs or stay downtown. We knew the city would be more expensive but we chose to commit to Seattle because we knew it was right for our employees and for the city.\"\nThe expense of building in the city is likely to go up as the city expands programs that would require fees or includes affordable units in exchange for added density, whether builders use the density or not.\nBut housing isn't the only woe facing Seattleites as the city expands.\nTraffic, long a problem in a city choked by water on both sides and in the middle, is worse than ever.\nSeattle ranked sixth-worst for rush hour traffic nationally in the 2015 Urban Mobility Scorecard published by Texas A&M Transportation Institute and INRIX. Drivers here were delayed an average of 63 hours for the whole of 2014, the study found.\nPhoto: JOSHUA TRUJILLO, SEATTLEPI.COM Traffic in Seattle has gone from bad to worse, and with nowhere to build more highways, it seems unlikely to ease. No small part of that increase in traffic is thanks to more people commuting in and out of the city, or simply around the city, as the tech industry booms, spurring secondary industries to do the same. Traffic in Seattle has gone from bad to worse, and with nowhere to... See the worst cities in the nation for traffic.\nTo counter this, the city last fall expanded Metro service dramatically. Plans for the future march slowly forward on expansion of streetcar service, on First Hill, then up Broadway on Capitol Hill, and later connecting with South Lake Union along First Avenue.\nThe City Council also recently approved sending the $930 million Move Seattle levy to voters this November, a proposal aimed at planning for Seattle's transportation needs over the next 10 years.\nBut is it too little, too late?\n\"Some of us have been saying for a long time that we have under-invested in transit and getting around the city,\" O'Brien said. \"But there's a huge lag (in getting transit infrastructure in place). The reality is, it will continue to challenge us.\"\nTech town\nWith Amazon's stunning influence, as well as other tech companies springing up or adding offices in the area, Seattle has become a tech hub on par with San Francisco or Silicon Valley.\nThat's doing wonders for raising Seattle's median income (King County's median income for 2014 was $75,834, compared to a statewide median of $61,366) and it's driving a burst of construction in the region.\nBut that might be just the problem for those who don't want to see the city they know disappear.\nA recent New York Times report questioned whether Seattle is losing it soul. And others have questioned whether all the growth is worth the changes in culture that seem to be reshaping parts of the city.\nChristopher Morris-Lent went on the attack against his hometown in August with a lengthy essay in Gawker that accused Amazon of killing Seattle, through and through.\n\"Seattle is dead and Amazon killed it,\" the piece began.\nRead our take on his essay here.\nThe 27-year-old clearly lacked the historical perspective to back up the charges he lodged at the retailer -- which he freely admitted in an interview -- but he brought up a cultural shift that's evident at least in South Lake Union, where a once mostly industrial neighborhood has become a bustling, upscale grid of fine restaurants, new apartments and condos and office space for Amazon and its high-tech brethren.\nAmazon's Sam Kennedy agreed that Seattle is a changing city, but he pointed out that most cities that are growing are changing -- culturally and otherwise. And would the alternative, a stagnating economy still fighting its way out of recession, be better?\nUnlikely.\n\"I have some challenges with Amazon but they're doing a lot of what we, as society, are asking them to do, which is pay good wages,\" O'Brien said.\nThey've also drawn a burst of similar companies to the area, further boosting the economy and pushing more growth in the area, O'Brien noted.\nSo, for now, Seattle remains crowded.\nTraffic is worse than ever. Housing is incredibly expensive (though still less than half what you'd pay in San Francisco). And the city is chock full of new people.\nBut business is good, unemployment is almost nil and the city is scrambling to get more affordable housing built.\n\"In the short run, there are going to be some adjustments,\" UW economist Elaina Rose said. \"But in the long run, there are going to be some huge advantages.\"\nDaniel DeMay covers Seattle culture, business and transportation for seattlepi.com. He can be reached at 206-448-8362 or danieldemay@seattlepi.com. Follow him on Twitter: @Daniel_DeMay.", "external_links": ["http://bit.ly/1G3CP0b", "http://www.nytimes.com/2015/10/09/technology/seattle-in-midst-of-tech-boom-tries-to-keep-its-soul.html?_r=0", "http://ww4.hdnux.com/photos/41/07/34/8681271/5/920x1240.jpg", "http://gawker.com/how-amazon-swallowed-seattle-1724795265", "http://www.twitter.com/daniel_demay", "http://bit.ly/1MLqD6f", "http://bit.ly/1TNm0sI", "http://ww2.hdnux.com/photos/34/15/42/7395481/3/920x1240.jpg", "http://d2dtl5nnlpfr0r.cloudfront.net/tti.tamu.edu/documents/mobility-scorecard-2015.pdf"], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-14T21:16:39.716+03:00", "highlightTitle": ""}