{"organizations": ["NFL", "Buffalo Bills", "Jaguars", "Jacksonville Jaguars", "AP"], "uuid": "e1168c1351e0683965aa6387722eda75d919a974", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.democratandchronicle.com", "main_image": "http://www.gannett-cdn.com/-mm-/1c0c45956bb37549db2db4f9648e741cc3dfc465/c=0-295-4734-2970&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/10/25/Rochester/Rochester/635813658074707132-AP-573514212503.jpg", "site_section": "http://rssfeeds.wgrz.com/_/20/108822016/WGRZ/sports", "section_title": "WGRZ - Sports", "url": "http://www.democratandchronicle.com/story/sports/football/nfl/bills/2015/10/25/manuel-implosion-kills-bills-london/74579740/", "country": "US", "title": "Manuel implosion kills Bills in London", "performance_score": 0, "site": "democratandchronicle.com", "participants_count": 0, "title_full": "Manuel implosion kills Bills in London", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T18:54:00.000+02:00", "replies_count": 0, "uuid": "e1168c1351e0683965aa6387722eda75d919a974"}, "author": "", "url": "http://www.democratandchronicle.com/story/sports/football/nfl/bills/2015/10/25/manuel-implosion-kills-bills-london/74579740/", "ord_in_thread": 0, "title": "Manuel implosion kills Bills in London", "locations": ["Jacksonville", "Wembley Stadium", "London Sal Maiorana", "London"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["EJ Manuel", "Tyson Alualu", "Matt Dunham"], "text": "Manuel implosion kills Bills in London Sal Maiorana , @salmaiorana 12:54 p.m. EDT October 25, 2015 Jacksonville Jaguars defensive tackle Tyson Alualu (93) sacks Buffalo Bills quarterback EJ Manuel (3) during the NFL game between Buffalo Bills and Jacksonville Jaguars at Wembley Stadium in London, Sunday, Oct. 25, 2015. (Photo: Matt Dunham, AP) The Jaguars scored four touchdowns in a span of 5:40 early in the second quarter. Jacksonville snapped a four-game losing streak and the Bills fell to 3-4. \nLONDON - In what can only be described as absolute football chaos, the Bills and Jaguars gave the fine blokes of London a game they won't soon forget. \nThis old venue, which has been completely modernized in recent years, has played host to hundreds and hundreds of magnificent sporting events and concerts, but Jacksonville's 34-31 victory over Buffalo will jump up the list of tremendous games, as 84,021 thoroughly entertained fans would attest. \nAfter rallying from 24 points down to take a fourth-quarter lead, the Bills allowed Jacksonville to drive 84 yards in seven plays to the game-winning score, a 31-yard Blake Bortles TD pass to Allen Hurns with 2:16 left to play. \nThe Bills looked completely out of it after a disastrous stretch of five minutes and 40 seconds early in the second quarter. Jacksonville scored four touchdowns, and Buffalo quarterback EJ Manuel literally handed the Jaguars 20 of those points as he turned the ball over three times, and Jacksonville scored a touchdown on every one. \nManuel's struggles started even before the calamitous second quarter. On Buffalo's second possession he had the Bills on the move, but threw two poor passes to Chris Gragg. On the first, Gragg might have scored on a 40-yard play if he didn't have to change direction to make the catch. Gragg was then wide open in the end zone on third down and Manuel threw it almost into the crowd, so Buffalo settled for a field goal. \nThe Jaguars grabbed the lead 55 seconds into the second quarter as quarterback Blake Bortles beat a safety blitz with a 10-yard TD strike to Allen Robinson who beat Stephon Gilmore on a sight adjust quick slant. \nAnd then the meltdown began. Four plays after the kickoff Manuel was sacked on a blitz by cornerback Aaron Colvin, fumbled, and defensive end Chris Clemson scooped it at the six and scored to make it 14-3. \nOn the first play after the next kickoff, Manuel threw one right to Jaguars linebacker Telvin Smith who returned it 26 yards for a touchdown. It was almost inconceivable that Manuel threw the ball, but he did. \nFour plays later, it was ex-Bill Paul Posluszny's turn to get in on the fun as he picked Manuel at the Buffalo 36. Three plays later, T.J. Yeldon burst through some missed tackled for a 26-yard TD and though the extra point was shanked, the Jaguars were up 27-3. \nManuel did respond by directing two scoring drives before the end of the half as he hit Robert Woods with a nicely-thrown 16-yard TD pass, and then produced a 38-yard field goal with a solid two-minute drill. \nJacksonville chewed up the first 9:30 of the third quarter but came away empty when the Bills defense put up a superb goal line stand, and Manuel turned around and marched Buffalo 91 yards in 14 plays to Carpenter's 26-yard field goal 10 seconds into the final period to cut the deficit to 27-16. \nThe Bills then made another colossal mistake. They drove smartly downfield and looked like they were going to score a touchdown as LeSean McCoy took a dump off and made a couple nice moves to break free. However, in trying to get to the goal line he lost the ball and Josh Evans recovered at the Jaguars 4. \nUndaunted the Bills forced a punt, and Manuel threw a gorgeous 57-yard TD pass to a streaking Marcus Easley, and McCoy banged in for the two-point conversion to get Buffalo within 27-24 with 6:33 left. And then 1:12 later, Bortles threw a terrible pass that Corey Graham intercepted and returned 44 yards for the go-ahead touchdown with 5:21 left. \nBut just when the Bills seemed on their way to pulling out a miraculous victory, here came the heartbreaker, a terrible pass interference penalty on Nickell Robey that dug the Jaguars out of a third-and-15 hole, and two plays later Hurns made a diving catch at the pylon $findto rescue the victory for Jacksonville. \nThe 3-4 injury-depleted Bills now head to their bye week, and it could not come at a better time. \nMAIORANA@Gannett.com 48 CONNECT 7 TWEET LINKEDIN 1 COMMENT EMAIL MORE Read or Share this story: http://on.rocne.ws/1S4n0aT TOP VIDEOS", "external_links": [], "published": "2015-10-25T18:54:00.000+02:00", "crawled": "2015-10-25T19:28:14.128+02:00", "highlightTitle": ""}