{"organizations": ["Barca", "Barcelona"], "uuid": "e3580d42fe30fd630b433ed25e671bd8aa5606ec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "jakartaglobe.beritasatu.com", "main_image": "http://img.thejakartaglobe.com/2015/10/599058-01-02-1024x682.jpg", "site_section": "http://jakartaglobe.beritasatu.com/rss/sports/", "section_title": "Sports | Jakarta Globe", "url": "http://jakartaglobe.beritasatu.com/football/barcas-suarez-foresees-competitive-title-race/", "country": "ID", "title": "Barca's Suarez Foresees Competitive Title Race", "performance_score": 0, "site": "beritasatu.com", "participants_count": 0, "title_full": "Barca's Suarez Foresees Competitive Title Race", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T06:26:00.000+03:00", "replies_count": 0, "uuid": "e3580d42fe30fd630b433ed25e671bd8aa5606ec"}, "author": "", "url": "http://jakartaglobe.beritasatu.com/football/barcas-suarez-foresees-competitive-title-race/", "ord_in_thread": 0, "title": "Barca's Suarez Foresees Competitive Title Race", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Tim Hanlon", "Luis Suarez"], "text": "INDEX Barca's Suarez Foresees Competitive Title Race i Barcelona striker Luis Suarez believes a cluster of teams will be vying for this season's La Liga crown. (AFP Photo/Josep Lago) By : Tim Hanlon | on 5:26 PM October 15, 2015 Category : Sports , Football \nBarcelona. Barcelona striker Luis Suarez believes a cluster of teams will be vying for this season's La Liga crown with surprise early leaders Villarreal offering proof of a more competitive title race than in previous years. \nA few seasons ago, the Spanish league was criticised for essentially playing out as an annual two-horse race between the star-player laden Barcelona and Real Madrid. \nAtletico Madrid were first to muscle their way into the title fight and after seven games, the El Clasico rivals have dropped more points than expected and are in a three-way tie for second place on 15 points, one point off the pace. \nDiego Simeone's Atletico, league champions in 2014, are also in the hunt on 13 points. \nBarca, winners of the treble last season, will be aiming to bounce back after losing two of their last three La Liga matches, including a 4-1 thrashing at Celta Vigo, with a home win over Rayo Vallecano on Saturday. \n\"The league is more competitive than other years and I think it will be exciting and very even all the way. Our rivals along with us have dropped points,\" Suarez told reporters. \n\"It is going to be a championship where no one knows what the results are going to be. The fact that we have five teams in the Champions League, I think for the first time, shows the situation,\" the Uruguayan marksman added. \n\"We know how strong the other sides are and we need to keep believing in ourselves. We are aware that we have made mistakes, which are for a reason, but it is the same team that won three titles.\" \nReal have drawn their last two league matches and face Levante at home on Saturday with Cristiano Ronaldo needing one more goal to become the club's all-time leading scorer. \nThe Portuguese striker has 323 goals from 309 games and is level with Raul, who took 741 matches to reach the total. \nMeanwhile, coach Rafa Benitez has rejected criticism of adopting a defensive tactical approach which intensified after a draw against local rivals Atletico in their last outing before the international break. \n\"Defensive and ordered are not the same thing,\" he told reporters. \n\"Madrid has an attacking mentality but if you are ordered then you concede fewer goals. We are not conceding many and we are scoring a lot but still we need to be more efficient.\" \nReuters", "external_links": [], "published": "2015-10-15T06:26:00.000+03:00", "crawled": "2015-10-16T09:33:50.626+03:00", "highlightTitle": ""}