{"organizations": [], "uuid": "700d6bff2d81f06bb9964fdbbffe4e40f0254157", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.oregonlive.com", "main_image": "http://imgick.oregonlive.com/home/olive-media/width620/img/oregonian/photo/2015/09/17/18777463-large.jpeg", "site_section": "http://www.oregonlive.com/", "section_title": "Oregon Local News, Breaking News, Sports &amp; Weather - OregonLive.com", "url": "http://www.oregonlive.com/hg/index.ssf/2015/10/small_house_summit_an_extra_ho.html", "country": "US", "title": "Small house summit: Learn what cities allow, how to design, build (photos)", "performance_score": 0, "site": "oregonlive.com", "participants_count": 12, "title_full": "Small house summit: Learn what cities allow, how to design, build (photos) | OregonLive.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T16:43:00.000+03:00", "replies_count": 12, "uuid": "700d6bff2d81f06bb9964fdbbffe4e40f0254157"}, "author": "Janet Eastman | The Oregonian/OregonLive", "url": "http://www.oregonlive.com/hg/index.ssf/2015/10/small_house_summit_an_extra_ho.html", "ord_in_thread": 0, "title": "Small house summit: Learn what cities allow, how to design, build (photos)", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Is Portland the epicenter of tiny houses?\nThe number of permits to build small accessory dwellings on residential lots has spiked. More than 2,400 people registered for a May tour to go inside basements and garages converted in apartments and backyard cottages . And in April, hundreds of tiny house fans gathered at a conference here .\nIn November, there's a weekend of small house fact-finding events designed to inform people thinking about building a house to live in or adding another one for family, office or studio workspace or renting it out for additional income.\nThe Build Small Live Large Summit 2015 on Friday, Nov. 6, at Portland State University's Smith Center, promises to provide practical information from experienced small house designers, builders and property owners as well as thoughts from policy makers and tips from lenders on how to finance a house that's less than 600 square feet.\nThere will also be inspirational -- and funny -- presentations from the tiny house movement's earliest advocates, including author and builder Dee Williams .\nIn Williams' book, \"The Big Tiny: A Built-It-Myself Memoir,\" the self-taught carpenter describes the mechanics of erecting a sturdy, rainproof, 84-square-foot house on a trailer and the bliss of living simply since 2004.\nWilliams, who co-founded with Joan Grimm PAD Tiny Houses (Portland Alternative Dwellings) , a resource for tiny house building, calls the Build Small Live Large Summit 2015 \"the 'big tent' of small housing.\"\nHome seekers will hear about the cost and environmental benefits of adding a space- and energy-efficient accessory dwelling, from a freestanding tiny house in the backyard or carving out space from inside an existing house.\nParticipants will also be able to listen to a presentation by Alan Durning , author of \"Unlocking Home: Three Keys to Affordable Communities\" and founder of Sightline Institute , a Seattle-based sustainability think tank.\nAlso speaking will be Andrew Heben , an urban planner who helped set up Opportunity Village Eugene and wrote \"Tent City Urbanism: From Self Organized Camps to Tiny House Villages.\"\nThere will be discussions on tiny houses on wheels and small home communities, also known as cottage clusters.\nRoss Chapin Architects During what's called the Best of Small Design Slam, experts from Ross Chapin Architects , who created the \"pocket neighborhood\" Third Avenue Cottages and Greenwood Avenue Cottages in Washington, and others will show off their creative, space-efficient dwellings.\nAnd there will be an opportunity to go inside the Escape Traveler , a converted shipping container and other mobile small homes parked on the South Park Blocks outside the Summit venue.\nTickets to attend the sessions, exhibit hall, beverage breaks and lunch are $175. Register at buildsmall-livelarge.com\n\"I can't think of another place where people can get both the long view and solid, brass tacks information on how building small is good for their wallets, their communities, their planet and their whole life,\" says Williams. \"I'm really excited to be involved.\"\nOther small house events:\nTen accessory dwelling units, not seen on previous tours, can be explored on the self-guided, self-paced Build Small, Live Large: Portland's Accessory Dwelling Unit Tour Fall 2015 from 10 a.m.-4 p.m. on Saturday, Nov. 7.\nTickets are $35, with a $5 discount until Oct. 24 and can be picked up Nov. 7 at Caravan-The Tiny House Hotel , 5009 NE 11th Ave., Portland.\nTour organizer, tiny house hotel owner and Portland ADU expert Kol Peterson , who had more than 2,400 people register for his spring tour , will also teach a class on costs, zoning regulations, small space design, building and managing an accessory dwelling in Portland from 10 a.m.-4 p.m. on Sunday, Nov. 15 ($95) . The Nov. 8 class has sold out.\nWilliams and Grimm of PAD Tiny Houses will hold a Tiny House Basics entry-level workshop detailing building principles for a compact -- about 100 square foot -- house on wheels on Saturday and Sunday, Nov. 7-8 (discounts on the $350 fee expire after Oct. 23).\n-- Janet Eastman\njeastman@oregonian.com\n503-799-8739\n@janeteastman", "external_links": ["http://www.sightline.org/research/unlocking-home/", "http://rosschapin.com/", "https://twitter.com/janeteastman", "http://www.thevillagecollaborative.net/", "http://padtinyhouses.com/the-big-tiny/", "http://www.eventbrite.com/e/build-small-live-large-portlands-accessory-dwelling-unit-tour-fall-2015-tickets-17986896291", "https://tinyhousehotel.com/", "http://buildsmall-livelarge.com/blog/", "http://www.sightline.org/about/staff/alanbio/", "http://www.squareonevillages.org/", "http://buildsmall-livelarge.com/register/", "http://pdxadu.blogspot.com/", "http://buildsmall-livelarge.com/", "https://padtinyhouses.com/tiny-house-basics/", "http://www.escapetraveler.net/", "http://www.eventbrite.com/e/building-an-accessory-dwelling-unit-on-your-property-in-portland-tickets-18813686242"], "published": "2015-10-20T16:43:00.000+03:00", "crawled": "2015-10-20T20:47:37.186+03:00", "highlightTitle": ""}