{"organizations": [], "uuid": "c36205d912d914d2a1bf8406ac99e0a202f20bc0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-562857d7/turbine/ct-kane-cubs-sider-spt-1022-20151021", "site_section": "http://www.chicagotribune.com/", "section_title": "Chicago Tribune: Chicago breaking news, sports, business, entertainment, weather and traffic - Chicago Tribune", "url": "http://www.chicagotribune.com/sports/baseball/cubs/ct-kane-cubs-sider-spt-1022-20151021-story.html", "country": "US", "title": "Cubs glad young stars gained valuable postseason experience - Chicago Tribune", "performance_score": 0, "site": "chicagotribune.com", "participants_count": 1, "title_full": "Cubs glad young stars gained valuable postseason experience - Chicago Tribune", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T07:44:00.000+03:00", "replies_count": 0, "uuid": "c36205d912d914d2a1bf8406ac99e0a202f20bc0"}, "author": "Colleen Kane", "url": "http://www.chicagotribune.com/sports/baseball/cubs/ct-kane-cubs-sider-spt-1022-20151021-story.html", "ord_in_thread": 0, "title": "Cubs glad young stars gained valuable postseason experience - Chicago Tribune", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "As the Mets celebrated their sweep of the Cubs in the National League Championship Series on Wednesday night, young Cubs players' reflections on the stinging loss were delivered with an undercurrent of hope.\nGiven the crop of 25-and-under players that helped the Cubs reach the NLCS for the first time since 2003, the wait-till-next-year talk wasn't quite a hollow refrain.\n\"You learn from everything you do, and next year I'm pretty sure it's going to be easier for us,\" shortstop Javier Baez said. \"We've got a young team that has a lot of talent, and all of us know what we can do. That's why didn't give up. We didn't do it this year, but we just have to come in next year and do the same things.\"\nThe Cubs started four players 23 or younger Wednesday — right fielder Jorge Soler, third baseman Kris Bryant, left fielder Kyle Schwarber and Baez. Another potential starter, Addison Russell, 21, sat out only because of a hamstring injury.\nSuch youngsters injected a little life into Wednesday night's game, even after finding themselves in a 6-0 hole through two innings.\nSoler hit a leadoff double in the fourth off Mets left-hander Steven Matz and scored the Cubs' only run through the first six innings, on Schwarber's RBI groundout. Soler finished 3-for-4 with two runs scored. Bryant added a two-run homer in the eighth.\n\"This is just the beginning for these guys,\" Cubs manager Joe Maddon said. \"With good health, everybody's looking for (more). As our guys offensively learn the game better, just knowing what they're doing at the plate, what the pitcher's trying to do to them, adjustments to be made, that's going to be really exciting to watch over the next couple of years.\nPhotos from Game 4 of the NLCS at Wrigley Field.\n\"Beyond that, defensively, I think they're all going to be high-end, high-caliber defensive players. They're very skillful. They're very athletic. Their work ethic is spectacular. They're highly accountable, and they're not looking for any kind of entitlements. They're really a different set of cats.\"\nOf course, it wasn't all great.\nFaced with excellent young Mets pitching, the Cubs hitters weren't nearly as electric as they were in the NL Division Series against the Cardinals.\nThere were also defensive mistakes, including Schwarber missing catches Wednesday on two hits by Mets shortstop Wilmer Flores, a single in the first and a triple in the sixth.\nBut good or bad, the Cubs feel great that their kids gained the experience of playing late in October this early in their careers.\n\"A phenomenal, special year — now we know what to look forward to as we go into this offseason,\" Schwarber said. \"It wouldn't be fun if we made it to the World Series the first year. Then we're disappointed after that. Obviously upsetting, but a lot to look forward to.\"\nckane@tribpub.com\nTwitter @ChiTribKane\nPrivacy Policy Copyright © 2015, Chicago Tribune Major League Baseball Baseball Chicago Cubs Kyle Schwarber Jorge Soler Kris Bryant Javier Baez", "external_links": ["http://www.tribpub.com/privacy-policy-and-your-privacy-rights/", "http://www.trbimg.com/img-562857d7/turbine/ct-kane-cubs-sider-spt-1022-20151021", "http://www.trbimg.com/img-56286b84/turbine/ct-nlcs-game-4-photos-cubs-vs-mets-20151021"], "published": "2015-10-22T07:44:00.000+03:00", "crawled": "2015-10-22T08:05:36.695+03:00", "highlightTitle": ""}