{"organizations": [], "uuid": "22f4db859ef52545dfdf6b6b27dfe7800cdad2c8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.arcamax.com", "main_image": "http://www.arcamax.com/apple-touch-icon.png", "site_section": "http://www.arcamax.com/sports/", "section_title": "Sports | ArcaMax Publishing", "url": "http://www.arcamax.com/sports/basketball/s-1738317?fs", "country": "US", "title": "Heat rookie Winslow willing to take what is given as NBA journey begins | Basketball", "performance_score": 0, "site": "arcamax.com", "participants_count": 1, "title_full": "Heat rookie Winslow willing to take what is given as NBA journey begins | Basketball | ArcaMax Publishing", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "22f4db859ef52545dfdf6b6b27dfe7800cdad2c8"}, "author": "arcamax.com", "url": "http://www.arcamax.com/sports/basketball/s-1738317?fs", "ord_in_thread": 0, "title": "Heat rookie Winslow willing to take what is given as NBA journey begins | Basketball", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "From the moment he fell to the Miami Heat at No. 10 pick in the NBA draft, it became apparent that Justise Winslow's journey was going to be different than most NBA lottery picks.\nThe opportunities behind the proven veterans would be limited. Not only would he not be asked to dominate offensively, but his touches would be rationed. And regularly playing as a starter was a concept that ended at the conclusion of summer league.\nThat made Tuesday's overtime exhibition loss in Orlando different. With the starters given the night off, he again could probe, bypass shots, work into a rhythm. In the extra period there even was an opportunity for a clear-out possession, when his driving layup tied it with 33.4 seconds to play.\nBy the weekend, when the Heat resume their preseason with a Saturday road exhibition against the Houston Rockets, Dwyane Wade, Luol Deng and Goran Dragic will be back. And so will a more complementary role for Winslow. So, for now, the game in Orlando remains a mere sampling of what one day -- but likely not any time soon -- could be his pro reality.\n\"I mean it's definitely an adjustment, especially coming off the bench, that's something that's new,\" Winslow said of his preseason nights other than Tuesday. \"But it's a lot of adjustment. So that's something I just got to get used to.\"\nThe shooting stroke remains a work in progress, this time 4 of 11 against the Magic. But there still were 12 points and 10 rebounds, as well as three assists, in his 35 minutes. And he still leads all Heat players in minutes, with half of the eight-game preseason schedule now concluded.\n\"You saw in the overtime, all the plays going down the stretch, the ball in Justise's hands,\" coach Erik Spoelstra said. \"So when he's playing with veterans, he's not normally getting those type of opportunities.\"\nSo, no, Winslow might not be prime real estate when it comes to NBA fantasy leagues. And Spoelstra said even the type of numbers NBA insiders covet could lie when it comes to the swingman out of Duke.\n\"He's not a guy that you can probably evaluate through, necessarily, analytics,\" he said. \"He's a basketball player. He makes winning plays. He does a lot of the little things. And he has a great pace to him.\n\"Again, for a young player, he plays with a veteran poise, but he plays with a youthful intensity, particularly on the defensive end.\"\nGetting away from numbers has been an emphasis among those attempting to guide the 19-year-old through these impending rookie challenges.\n\"Obviously a lot of people are talking to him,\" Wade said. \"But as I told him, 'You've got to simplify the game for yourself.' And he's doing a job of understanding when to attack.\n\"That outside shot will be there as he keeps getting more comfortable with it. But he's just got to understand when to shoot it.\"\n(c)2015 Sun Sentinel (Fort Lauderdale, Fla.)\nVisit the Sun Sentinel (Fort Lauderdale, Fla.) at www.sun-sentinel.com\n ", "external_links": ["http://twitter.com/share?url=http://www.arcamax.com/sports/basketball/s-1738317&hashtags=ArcaMax", "https://plus.google.com/share?url=http://www.arcamax.com/sports/basketball/s-1738317", "http://www.facebook.com/sharer.php?u=http://www.arcamax.com/sports/basketball/s-1738317&h=Heat+rookie+Winslow+willing+to+take+what+is+given+as+NBA+journey+begins"], "published": "2015-10-15T03:00:00.000+03:00", "crawled": "2015-10-16T08:09:50.290+03:00", "highlightTitle": ""}