{"organizations": [], "uuid": "2ab328322276862774b80525bb067c33c0e63209", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-561ee9e1/turbine/ct-preckwinkle-tax-cook-county-edit-1015-jm-20151014", "site_section": "http://www.chicagotribune.com/", "section_title": "Chicago Tribune: Chicago breaking news, sports, business, entertainment, weather and traffic - Chicago Tribune", "url": "http://www.chicagotribune.com/news/opinion/editorials/ct-preckwinkle-tax-cook-county-edit-1015-jm-20151014-story.html", "country": "US", "title": "Don&apos;t have fun. Toni Preckwinkle wants to tax it. - Chicago Tribune", "performance_score": 0, "site": "chicagotribune.com", "participants_count": 1, "title_full": "Don&apos;t have fun. Toni Preckwinkle wants to tax it. - Chicago Tribune", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T02:37:00.000+03:00", "replies_count": 0, "uuid": "2ab328322276862774b80525bb067c33c0e63209"}, "author": "chicagotribune.com", "url": "http://www.chicagotribune.com/news/opinion/editorials/ct-preckwinkle-tax-cook-county-edit-1015-jm-20151014-story.html", "ord_in_thread": 0, "title": "Don&apos;t have fun. Toni Preckwinkle wants to tax it. - Chicago Tribune", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Cook County Board President Toni Preckwinkle wants to tax golf, bowling, ice skating — recreational activities already taxed by the city of Chicago — to help balance next year's county budget.\nAmusement parks, kayaking, fishing, billiards, you name it. If her budget passes, participants of sports activities and amusements throughout Cook County would pay a special tax on top of what the operators, and the city or a suburb, already charge.\nBeing a couch potato will cost you too. Preckwinkle is counting on a new cable TV tax to bring in more than $18 million annually to help balance her budget, which goes before the Cook County Board for a vote mid-November.\nBut wait. There's more.\nThe new taxes are in addition to the 1 percentage point hike in the county's sales tax that Preckwinkle muscled through the County Board in July, making Chicago's overall sales tax rate of 10.25 percent one of the highest in the country.\nFor Preckwinkle, raising taxes is an awkward reversal. She won her job in 2010 by explaining to voters how her predecessor Todd Stroger's damaging sales tax hike had made Cook County more expensive for businesses and residents. She oversaw the death of the Stroger Tax. Yet after her re-election in 2014, she's now leading the charge for ... tax hikes that will make Cook County more expensive for businesses and residents.\nPreckwinkle plans to tax cable TV, bowling and golf Hal Dardick Months after winning approval for a controversial penny-on-the-dollar sales tax increase, Cook County Board President Toni Preckwinkle now wants to extend the county's 3 percent amusement tax to cable TV and recreational activities such as bowling, golf and many for-profit sports leagues.\nThe additional...\nMonths after winning approval for a controversial penny-on-the-dollar sales tax increase, Cook County Board President Toni Preckwinkle now wants to extend the county's 3 percent amusement tax to cable TV and recreational activities such as bowling, golf and many for-profit sports leagues.\nThe additional...\n(Hal Dardick) And remember, she's only leading the charge:\nWe don't want Chicago residents' heads to explode, but remember: The county's approved and proposed taxes are on top of the property tax hike Mayor Rahm Emanuel has proposed for city residents, along with a garbage fee and likely additional taxes for Chicago Public Schools.\nWe haven't even mentioned the taxes paid to other governmental bodies, such as libraries and park districts, most of which also face alarming unfunded pension liabilities.\nIt's a scary proposition to hit the \"total\" button in and around Chicago these days. Never forget, as you pay all these higher taxes, that in most cases the blame goes to runaway Illinois pension costs and the politicians who created them.\n\"The city and county in the past did not address all of our structural problems, and now the chickens have come home to roost,\" Preckwinkle said Wednesday to the Tribune Editorial Board.\nExpensive chickens. Demanding chickens. Chickens bolstered by Illinois Supreme Court decisions that seem to be locking in retirement benefits obligations at all levels of government, without requiring more of the workers who earn them.\nCook County's bowling for dollars? This is some state we're in Phil Rosenthal Bowling for dollars? Really? It's come to this in Cook County?\nAs if it weren't bad enough that their sport recently was eliminated from consideration to be an Olympic sport in Tokyo in 2020, bowlers would be taxed under Cook County Board President Toni Preckwinkle's proposed 2016 budget.\nThe county...\nBowling for dollars? Really? It's come to this in Cook County?\nAs if it weren't bad enough that their sport recently was eliminated from consideration to be an Olympic sport in Tokyo in 2020, bowlers would be taxed under Cook County Board President Toni Preckwinkle's proposed 2016 budget.\nThe county...\n(Phil Rosenthal) The Supreme Court in May ruled against a pension reform law that would have required state employees, teachers outside Chicago, university workers and General Assembly members to retire later and pay more toward their pension accounts.\nBut the justices declared it unconstitutional. They wrote that the Illinois Constitution \"was clear that the promised benefits would therefore have to be paid, and that the responsibility for providing the State's share of the necessary funding fell squarely on the legislature's shoulders. Accordingly, the funding problems which developed were entirely foreseeable.\"\nEntirely foreseeable and now entirely past due.\nPreckwinkle for several years has tried to get a county pension bill through Springfield. But her fellow Democrats didn't send it to Gov. Bruce Rauner. The May court decision also raises questions about its constitutionality.\nSo rather than sit on her hands, Preckwinkle pushed the sales tax hike in order to dedicate more money toward her workers' underfunded pensions. Most of the county sales tax generated in 2016 will go toward pension funds. The county will pay more than what is minimally required; instead of paying that $195 million next year, Preckwinkle's budget would pump an additional $270.5 million into the pension funds. She projects another above-minimum payment of $340.7 million in 2017.\nThat's the sort-of good news. The county would address its pension fiasco — though on the backs of taxpaying consumers.\nTo Preckwinkle's credit, her budget also reduces the county's head count, mostly through attrition, by more than 280 positions. She plans to lay off 26 people from offices she controls.\nIn the packet Preckwinkle handed out, one of the gloomiest charts showed the county's legacy debt rising. Cook County's long history of borrowing to pay for operations, to fund a new Stroger Hospital, to rehab courthouses and acquire property will end up costing taxpayers hundreds of millions of dollars more next year in debt payments.\nPreckwinkle's proposed 2016 budget does not raise property taxes. She was mostly correct when she described her plan as \"a very responsible and modest budget.\"\nBut it's no comfort to taxpayers in Chicago who live in a constant state of whack-a-mole: Pay your higher taxes to the city and the schools and the parks, and another mole pops up with its paw out.\nWednesday was Cook County's day. Expect more paws.\n Toni Preckwinkle Pensions Todd H. Stroger Opinion Editorials Illinois General Assembly", "external_links": ["http://www.trbimg.com/img-561ed930/turbine/ct-rosenthal-bowling-tax-1015-biz-20151014", "http://www.trbimg.com/img-561ee9e1/turbine/ct-preckwinkle-tax-cook-county-edit-1015-jm-20151014", "http://www.trbimg.com/img-561e070c/turbine/ct-cook-county-budget-met-1015-20151014"], "published": "2015-10-15T02:37:00.000+03:00", "crawled": "2015-10-15T03:13:42.911+03:00", "highlightTitle": ""}