{"organizations": [], "uuid": "1c8d086ca41d327f3b8134b3764f01e5a03a9a86", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.torontosun.com", "main_image": "http://storage.torontosun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297761273269_LARGE_BOX.jpg?quality=80&stmp=1445126014583&size=100x", "site_section": "http://www.torontosun.com/sports/horse-racing", "section_title": "Horse Racing | Sports | Toronto Sun", "url": "http://www.torontosun.com/2015/10/17/second-step-aims-for-first-at-pattison-canadian", "country": "CA", "title": "Second Step aims for first at Pattison Canadian | Horse Racing | Sports | Toront", "performance_score": 0, "site": "torontosun.com", "participants_count": 1, "title_full": "Second Step aims for first at Pattison Canadian | Horse Racing | Sports | Toront", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T07:04:00.000+03:00", "replies_count": 0, "uuid": "1c8d086ca41d327f3b8134b3764f01e5a03a9a86"}, "author": "torontosun.com", "url": "http://www.torontosun.com/2015/10/17/second-step-aims-for-first-at-pattison-canadian", "ord_in_thread": 0, "title": "Second Step aims for first at Pattison Canadian | Horse Racing | Sports | Toront", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "As a three-year-old, Second Step was rather modest.\nHe won three races out of five, but with only $54,000 earned, he was just a face in the crowd.\nBut 2015 has been much different, and now the Irish-bred has favourite status for Sunday’s $1-million Canadian International at Woodbine.\nUnraced at two, Second Step ended that three-year-old season with a win at The Curragh. To start this season, he charged to a neck victory in a Group 2 at Newmarket, then he finished second in another group two at that course.\nSensing he was sitting on a Grade 1 score, trainer Luca Cumani sent him to Germany and the Berlin Grand Prix where he turned on the jets in the final part of the race to win.\n“He ran very well,” Emthe Kuhle-Hansen, an assistant to Cumani, said. “Initially we thought he wasn’t going anywhere. He was just plodding along and then all of a sudden (jockey Jamie Spencer) picked him up and he came on absolutely flying.”\nHis most recent start was a bit of a downer, finishing 11 lengths back in fourth in the Irish St. Leger at The Curragh.\nCumani saddled Infamy to win the International in 1988. Andrea Atzeni, who was third in the 2013 International aboard Seismos, gets the mount.\nCHASING THE PRIZE\nIf there is a main challenger to Second Step, it is Cannock Chase, mainly because his pilot is chasing history.\nRyan Moore will be looking for his third consecutive score in the race, having won it in 2013 aboard Joshua Tree and last year aboard Hillstar.\nTrainer Sir Michael Stoute brought Hillstar to Woodbine for one of his two wins in the International. He previously won the race with Singspiel in 1996.\nAfter finishing second in his lone two-year-old start, Cannock Chase broke his maiden at Windsor Racecourse and followed that up with a Group 3 score at Ascot in an abbreviated three-year-old season hampered by foot problems.\nThis year, after a couple of placings in Group 3 races, he made his first Grade 1 appearance at Ascot where he was seventh of nine. After finishing second in another Group 3 race, he was given a confidence builder last time out at Newmarket where he captured a minor stake by nearly four lengths. That race was also the first time he had run a mile and a half, the International’s distance.\n“I’m happy with his condition and he proved that he got a mile and a half,” Stoute said. “He’s in with a shot.”\nHis breeder, Newmarket-based Hascombe Stud, also bred Golden Horn, the recent Arc de Triomphe winner who is pointed for the Breeders’ Cup Turf.\nEUROPEAN INVASION\nHow much do the Europeans love the E.P. Taylor Stakes? No fewer than six of the 12 fillies and mares contesting the $500,000 turf test shipped from overseas. Curvy, a Group 2 race winner who debuted in North America by finishing fifth in the Flower Bowl at Belmont is the 3-1 morning-line choice. Devonshire, who won her most recent start is Ireland has a shot as well but one to watch is Yaazy, a lightly-raced three-year-old from France. Heading this continent’s contingent is Strut The course, a double stakes winner on the turf course taking the Dance Smartly and the Canadian Stakes for trainer Barb Minshall. Former British runner Eastern Belle has been in the money in all five North American starts for trainer Graham Motion but still has yet to find the winner’s circle.\nTERROR COMES OVER\nThere’s only one European in the field for the $300,000 Nearctic Stakes. A two-time winner as a two-year-old, Terror was a non-factor in major three-year-old races in the spring but has improved steadily for trainer David Simcock and could peak in this spot.\nThe Great War and Cyclogenesis comes off good runs in the Quick Call at Saratoga. Summation Time and Sweet Luca also head north. Excaper carries the local hopes.\nQUICK GIRLS\nThe $150,000 Ontario Fashion Stakes is a difficult one to decipher. Endless Light, who won the Sweet Briar Too Stakes and narrowly missed in the Seaway last time out, is a lukewarm favourite over Tahnee, who took the Rainbow Connection Stakes at Fort Erie in July. Harp N Halo and Unspurned also have a shot in the six-furlong polytrack sprint.\nSponsored Links See All Sponsored Links\nSecond Step aims for first at Pattison Canadian\nBy Richard Mauntah , Toronto Sun First posted: Saturday, October 17, 2015 07:04 PM EDT | Updated: Saturday, October 17, 2015 07:09 PM EDT\nAs a three-year-old, Second Step was rather modest.\nHe won three races out of five, but with only $54,000 earned, he was just a face in the crowd.\nBut 2015 has been much different, and now the Irish-bred has favourite status for Sunday’s $1-million Canadian International at Woodbine.\nUnraced at two, Second Step ended that three-year-old season with a win at The Curragh. To start this season, he charged to a neck victory in a Group 2 at Newmarket, then he finished second in another group two at that course.\nSensing he was sitting on a Grade 1 score, trainer Luca Cumani sent him to Germany and the Berlin Grand Prix where he turned on the jets in the final part of the race to win.\n“He ran very well,” Emthe Kuhle-Hansen, an assistant to Cumani, said. “Initially we thought he wasn’t going anywhere. He was just plodding along and then all of a sudden (jockey Jamie Spencer) picked him up and he came on absolutely flying.”\nAbout the author Richard Mauntah Other Stories Sheikzayedroad travels back to Woodbine\nAt Thursday’s post-position draw for Sunday’s Canadian International, a lot was made of a horse named for a major thoroughfare in the United Arab Emirates.\n0\nHabibi takes International path to race\nThe Canadian International will again live up to its name on Sunday, with horses from Britain, Ireland, the U.S., Canada, and even a transplanted Kiwi ready to do battle at Woodbine.\n0\nSee more from Richard Mauntah »\nTop stories Popular Latest Videos Poll workers ordered to remove Maple Leaf pins\n0\n'No. 1 Jays fan' gets Bautista bat flip tattoo\n0\nMan in UK arrested after Laurier University lockdown due to online threat\n0\nPeel cop shot while in cruiser\n0\nLIVE CHAT: Game 2 of ALCS, Blue Jays vs. Royals\n0\nPeel cop shot while in cruiser\n0\nRandall The Handle's NFL Week 6 picks\n0\nTFC falls to division rival Columbus\n0\nLeafs' Bozak misses game against Penguins\n0\nArgos drop 'home game' against Stampeders\n0\nSun Reporters Ganter & Longley on Blue Jays Win\nAndrea Christidis remembered\nJays get ready for Game 5\nGame 5 will be The Stroman Show\nBob Elliott and Steve Buffery on the Blue Jays win\nMore from Horse Racing Second Step aims for first at Pattison Canadian 0\nSheikzayedroad travels back to Woodbine 0\nHabibi takes International path to race 0\nCanadian International could attract a dozen 0\nSix-pack of potential for trainer Casse 0\nInside Toronto sun.com Sports\nBozak misses game against Penguins 0", "external_links": ["http://pubads.g.doubleclick.net/gampad/clk?id=182027221&iu=/3081/SMCO_ENUR_TSUN_EN_WEB", "http://pubads.g.doubleclick.net/gampad/clk?id=228633661&iu=/3081/SMCO_ENUR_TSUN_EN_WEB", "http://pubads.g.doubleclick.net/gampad/clk?id=182024221&iu=/3081/SMCO_ENUR_TSUN_EN_WEB", "http://pubads.g.doubleclick.net/gampad/clk?id=183052021&iu=/3081/SMCO_ENUR_TSUN_EN_WEB"], "published": "2015-10-18T07:04:00.000+03:00", "crawled": "2015-10-18T03:36:44.733+03:00", "highlightTitle": ""}