{"organizations": [], "uuid": "bcf2d53b043b63e4d5b359127eebec42225709f3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nola.com", "main_image": "http://imgick.nola.com/home/nola-media/width620/img/tpphotos/photo/2015/10/20/19008643-large.jpg", "site_section": "http://www.nola.com/baton-rouge/", "section_title": "Baton Rouge, LA Local News, Breaking News, Sports &amp; Weather - NOLA.com", "url": "http://www.nola.com/movies/index.ssf/2015/10/open_letter_to_marty_mcfly.html", "country": "US", "title": "On 'Back to the Future' Day, an open letter to Marty McFly", "performance_score": 0, "site": "nola.com", "participants_count": 1, "title_full": "On 'Back to the Future' Day, an open letter to Marty McFly | NOLA.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T11:00:00.000+03:00", "replies_count": 0, "uuid": "bcf2d53b043b63e4d5b359127eebec42225709f3"}, "author": "Mike Scott, NOLA.com | The Times-Picayune", "url": "http://www.nola.com/movies/index.ssf/2015/10/open_letter_to_marty_mcfly.html", "ord_in_thread": 0, "title": "On 'Back to the Future' Day, an open letter to Marty McFly", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Oct. 21, 2015\nDear Marty McFly,\nGreetings, and welcome to 2015! I hope your trip from 1985 was a comfortable one. We've been waiting for you ever since the Prophet Zemeckis predicted in his 1989 documentary \"Back to the Future Part II\" that you would be arriving in our time today -- Wednesday, Oct. 21, 2015.\nWe've even come up with a name for your long-awaited arrival: \" Back to the Future Day .\" Not very creative, I know, but it stuck -- and people are really getting excited about it for some reason.\nAnyway, I'm betting DeLorean lag can be a real doozy, or whatever the time-travel equivalent of jet lag is. That's probably especially true when you're careening 30 years into the future cooped up with a dog and what would appear to be a barely washed Doc Brown in a vehicle that runs on garbage.\nNow that I think about it, those exhaust fumes must be a doozy, too. (I was talking about the car's exhaust, but I'm betting Doc is no perfume factory, either)\nI also realize that receiving a letter from your future must strike you as strange, and from New Orleans, no less. Just ask Doc about the Internet. He'll fill you in on how this communiqué is even possible.\nIn the meantime, bear with me here. I've got some important information you must hear. \"Your very future could depend on it,\" as Doc would shout. And before you say anything, I know he's always warning about the danger inherent in tinkering with the space-time continuum while on one of your little temporal excursions. But the fact of the matter is, that particular horse has already left the barn, and somebody needs to set it right.\nThat somebody, I'm hoping, is you.\nYou see, while you are here in 2015, Biff Tannen -- yes, that Biff Tannen -- is going to steal Doc's DeLorean and your sports almanac and go back in time to wreak havoc as only Biff can. (Which, as you know, can be considerable, indeed.) While he was admirably careful not to disturb what Zemeckis correctly predicted will be a memorable run for the Chicago Cubs (crazy, right?), he clearly screwed some thing up.\nThat's the only reason I can think of as to why things here in 2015 are -- again, as Doc would put it -- \"completely haywire.\"\n More: \"Back to the Future Day\" flashback - New Orleans in 1985\nFirst off, we don't have hoverboards. Or flying cars (fueled by garbage or anything else). And believe me, we need them. While you're here, I invite you to take a side trip to New Orleans. Have you ever even driven on a street in Gentilly? Mid-City? God forbid, Uptown?\nRoads? Where you're going we only barely have roads.\nAlso, before you stray too far from the DeLorean, those self-lacing Nikes and that self-adjusting jacket Doc gave you aren't going to cut it in this version of 2015 unless you plan on taking in a Lady Gaga or Miley Cyrus concert. I happen to know you're more of a Huey Lewis and the News sort of guy, so I'm guessing you're not thinking about getting your Gaga on.\nOn a related note: The rainbow cap Doc provided is positively on fleek. (Again, ask Doc.) In fact, and this will surprise you, the U.S. Supreme Court has made all things rainbow not just acceptable but legally so. You'll know why I mention that when you meet your older son \" Marlene \" -- the one who looks just like the actor Michael J. Fox but with a long, fabulous wig and voice that apparently has yet to benefit from the hormone therapy.\nThat's just the tip of the iceberg as far as things that will blow your mind about 2015. For example: Weed is legal for recreational use in four states, with more lining up to join the party. A sentient block of wood named Vin Diesel is a bona fide movie star. A black guy is president. Americans enjoy soccer. Matt Damon's stuck on Mars.\nWho would have thunk it? But I digress.\nWhile you're here in our time, I know you'll have your hands full keeping your other son -- the loser with the greasy hair -- out of jail. If, however, you can find time to fix a couple of other minor things that have clearly become all Biffed up thanks to Doc's time machine, we future-dwellers will be enormously grateful.\nFirst off, the New Orleans Saints. Granted, they're not doing so great this year. But last week their young defense and sputtering offense finally showed signs of finally gelling with a heartwarming trouncing of the Atlanta Falcons , so there's a chance they might be able to fight through it without your intervention. (Unless you have experience kicking field goals, in which case you should report to Airline Drive tout suite.)\nMAY 1985: Tom Benson, left, dons a New Orleans Saints cap as Gov. Edwin Edwards, right, applauds, during a press conference announcing Benson's purchase of the NFL team, which became official on May 31, 1985. (Eliot Kamentiz / The Times-Picayune archive) There is some thing else you can do for the Who Dat Nation, though. When you get back to October 1985, find Saints owner Tom Benson, who bought the team just a few months before you left to come here. When you do, deliver this vital message, one that will have an enduring impact on all Saintsdom:\nAvoid Mike Ditka. Avoid Mike Ditka at all costs. That hire has Biff's fingerprints allll over it.\nI know Ditka is hugely successful in 1985, but believe me, that success is fleeting. Jim Haslett's no world-beater, either, but Ditka -- jeesh. Even if Biff had nothing to do with it, some things are worth the risk of disturbing the space-time continuum over.\nWhile you're at it, if you can figure out a way to expose Bobby Jindal's myopic presidential aspirations to Louisiana's voting public before his re-election as governor in 2011, that would be swell. Not sure how that crafty Biff managed that one, but by golly he really got us good.\nSpeaking of presidential ambitions, go ahead and click on over to one of our 24-hour cable news channels when you get a chance. Check out the status of the current presidential campaign that Washington, D.C., is inflicting upon us. No, that's not a WWE battle royale you're watching. It's a debate. At last count, there are 15 GOP hopefuls and four Democrats -- although things are changing by the minute. (Minus one Webb, plus one Biden ...)\nLike I said: \"completely haywire.\"\nBut it gets haywire-ier. Chance are, while watching the news, you'll see Donald Trump, who is easily the most colorful of the GOP candidates. (The same Donald Trump, and the same hair, from 1985.) What's more, he's polling like a winner.\nIn principal, that shouldn't be a problem. After all, if the people want him, the people want him. But pay attention to his campaign style. (Again, that won't be difficult. Our ratings-obsessed national media tend to go live with his every bloviation.) He insults people, he bullies people, he spews whatever wackiness comes to mind, raw and unfiltered, and he seems to think he owns everything and everyone.\nIn this Oct. 7, 2015 file photo, Republican presidential candidate Donald Trump speaks during a campaign stop in Waterloo, Iowa. Trump has agreed to host 'Saturday Night Live' next month. NBC said its former 'Celebrity Apprentice' host will be the headliner of the Nov. 7 show. (AP Photo/Charlie Neibergall, File) Sound familiar? Clearly, during Biff's travels though time, he supplied Trump with a detailed campaign strategy. Either that, or he gave him \"The Biff Tannen Guide to Winning Friends and Influencing People.\" Heck, I'm starting to think maybe he is Biff, in disguise.\nIs there anyway you can make the whole Trump candidacy not happen? It was fun at first, but now it's getting a tad concerning.\nPlus, I'm pretty sure I remember Trump calling you a chicken. You're not going to let him get away with that, are you?\nI could go on, but I know your time is short, so I won't add to your already considerable to-do list. Just for your benefit, though, here's a quick list of things the past 30 years have taught us we should avoid. While you're here, you should avoid them, too:\nCarbs, the \"Entourage\" movie, Jared the Subway guy, use of the term \"totally tubular,\" Tebowing, using your own independent e-mail server while Secretary of State, texting and driving, sexting and driving, sexting while running for office, investing in Enron, Confederate flags, slackers, Burger King's black \"Halloween\" Whopper, blood diamonds, Google Glass, Volkswagen \"clean diesel\" vehicles, happy hour with Bill Cosby, adjustable-rate mortgages, cilantro and vacationing in Iran. (OK, those last two were dicey in 1985, too, but you can never be too safe.)\nHope that helps -- and save travels.\nSincerely yours in time,\nMike \"Great\" Scott\nP.S. -- No biggie, but if you get a chance, you should get the ear of the writers of \"Seinfeld,\" \"Lost\" and \"The Sopranos\" at some point after you get back to your time. Tell them they might want to rethink their plans for their finales. It shouldn't change the trajectory of world history if they do, but it'll sure make the rest of us happier.\nP.P.S. -- You've got great timing. If I could do it all over again, I'd use a time machine to leapfrog the whole lamentable \"Star Wars\" prequel trilogy and fast-forward to J.J. Abrams' reboot, too. May the Force be with you!", "external_links": ["http://backtothefuture.wikia.com/wiki/Marlene_McFly", "https://en.wikipedia.org/wiki/Back_to_the_Future_Part_II#Back_to_the_Future_Day", "http://www.youtube.com/watch?v=tM4044bh4FU"], "published": "2015-10-21T11:00:00.000+03:00", "crawled": "2015-10-21T11:26:24.468+03:00", "highlightTitle": ""}