{"organizations": [], "uuid": "93460eba859881d081d26e08227d274cfd38f5ee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.torontosun.com", "main_image": "http://storage.torontosun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297759360268_LARGE_BOX.jpg?quality=80&stmp=1444869369702&size=100x", "site_section": "http://www.torontosun.com/sports/hockey", "section_title": "Hockey | Sports | Toronto Sun", "url": "http://www.torontosun.com/2015/10/12/ottawa-senators-seem-to-relish-time-on-the-road", "country": "CA", "title": "Ottawa Senators seem to relish time on the road Brennan | Hockey | Sports | To", "performance_score": 0, "site": "torontosun.com", "participants_count": 1, "title_full": "Ottawa Senators seem to relish time on the road | Brennan | Hockey | Sports | To", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:29:00.000+03:00", "replies_count": 0, "uuid": "93460eba859881d081d26e08227d274cfd38f5ee"}, "author": "torontosun.com", "url": "http://www.torontosun.com/2015/10/12/ottawa-senators-seem-to-relish-time-on-the-road", "ord_in_thread": 0, "title": "Ottawa Senators seem to relish time on the road Brennan | Hockey | Sports | To", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "As much as they enjoyed being home for Thanksgiving dinner, there's no place like the road for the Ottawa Senators.\nIt is in their most recent games as the visitors, dating back to last season, that they've feasted on opponents.\nFollowing Sunday's uninspired 3-1 loss to the Montreal Canadiens at Canadian Tire Centre, the Senators had a day off to sit back, eat some turkey, and cheer on the Toronto Blue Jays.\nThey'll be back at practice Tuesday morning and, after a celebration of life for the late Max Keeping, they'll head out for a two-stop trip that sees back-to-back games in Columbus and Pittsburgh. And while both the Blue Jackets and Penguins have started this season at 0-2, the Senators believe they are best served focusing mainly on their own game.\nOn the road, the game they play has produced positive results since Feb. 3, when they last failed to leave another team's building with at least a point on a run that has seen them compile a record of 13-0-3.\nBack in the days before overtime, that would be 16 games without a defeat. The NHL record for one season is 23 games, set by the 1974-75 Habs who won 14 and tied nine.\n\"For the past 15 road games or so, obviously tying into last year, we've been pretty good,\" Senators defenceman Marc Methot said late Sunday night. \"I think for us the biggest thing (on the road) is just making sure our legs are under us and we've got that jump, because the skill set is in the room. So I think over the next couple of games, we just have to take care of ourselves ... we're going to get a good practice in on Tuesday, and then I think (it's about) just sticking to our structure.\"\nFor whatever reason, the Senators didn't play hard enough against the Habs in Sunday's loss, a point made clear by coach Dave Cameron. They also didn't play at their best while squeaking out victories in Buffalo and Toronto to start this season.\nBut with a busy schedule out of the gate, they're not fretting over their standing.\n\"I think we should be happy, four out of six points,\" said captain Erik Karlsson. \"If you would have said that before, we'd go three in four (nights) and get four points, we would have been happy with that. That's where we are right now, and we're satisfied with that.\"\nAnother stretch of three games in four nights begins Wednesday. Following the quick road trip, they'll have a one day break before hosting Nashville Saturday night.\nAgain, they hope to garner some momentum in the out-of-town tilts before trying to put on a better show for their fans against the Predators.\n\"We've felt pretty good on the road the last two,\" said Methot, adding that he was only made aware of the 13-0-3 run while reading Twitter on the weekend. \"Buffalo and Toronto was a little back and forth, but I mean we're starting the season playing three (games) in four (nights) and that's not an easy thing to do. That's not easy in February, let alone your first three games.\n\"One good thing, you get them out of the way, especially if you can pot a couple of wins. Managing your body and fatigue is something you've got to get accustomed to again. It's not the summer where you're going to bed at 9:30 anymore at night, or 10:30 and you're on your couch melting. It's being primed and ready to play, and I think that will come.\n\"Now that we've got a bunch of games under our belt, we're going to feel better and better. Guys are going to get their hands back, their legs back. That takes times.\"\nThe Senators will also get Craig Anderson back between the pipes, at least for the Columbus game but quite likely Thursday in Pittsburgh too. Rookie backup Matt O'Connor played well enough against the Habs Sunday, aside from giving up a weak first goal, but that one mistake should remind them they need to go with their best in all-important inter-conference games.\nEspecially when they're played on the road.\nBrennan\nOttawa Senators seem to relish time on the road Club making sure to manage body and fatigue\nBy Don Brennan , Ottawa Sun First posted: Monday, October 12, 2015 03:29 PM EDT | Updated: Monday, October 12, 2015 05:55 PM EDT\nAs much as they enjoyed being home for Thanksgiving dinner, there's no place like the road for the Ottawa Senators.\nIt is in their most recent games as the visitors, dating back to last season, that they've have feasted on opponents.\nFollowing Sunday's uninspired 3-1 loss to the Montreal Canadiens at Canadian Tire Centre, the Senators had a day off to sit back, eat some turkey, and cheer on the Toronto Blue Jays.\nAlso in this article Ottawa Senators vs Montreal Canadiens, Oct. 11, 2015 About the author Don Brennan Don Brennan's Blog Follow Don Brennan on Twitter Other Stories Hammond back with Senators, ahead of schedule\nThe Senators did some goalie shuffling before heading off to Columbus Tuesday afternoon.\n0\nSens winger MacArthur insists 'he's fine' and ready to go\nInsisting he does not have another concussion, Clarke MacArthur was his old self Tuesday -- he practiced with the rest of the Senators, then laughed off concerns over the head injury he sustained in Saturday's final exhibition game against the Habs.\n0\nSee more from Don Brennan »\nTop stories Popular Latest Videos Blue Jays complete comeback in crazy Game 5 win over Rangers\n0\nLittle oversight over city's LTD claims\n0\nHazel McCallion slams Harper in Liberal ad\n0\nTFC clinches first-ever post-season berth\n0\n‘Shy Tories’ among poll oddities\n0\nTFC clinches first-ever post-season berth\n0\nJays, fans make statement with Game 5 win\n0\nLamar Odom on life support after being found in brothel\n0\nBlue Jays complete comeback in crazy Game 5 win over Rangers\n0\nIowa teacher takes his 'McDonald's diet' to schools, irking critics\n0\nWhitby Crash\nNorth Korean Yeonmi Park's View of Canadian Freedoms\nParking enforcement blitz in Toronto\nPredictions for the Jays in ALDS\nBlue Jays playoff excitement unprecedented\nMore from Hockey Babcock\n'Personal reasons'? Ovechkin benched for sleeping in 0\nStars place forward Patrick Eaves on injured reserve 0\nInside Toronto sun.com News\nYoung daughters abused for years 0", "external_links": ["http://twitter.com/@sundonib", "http://pubads.g.doubleclick.net/gampad/clk?id=228633661&iu=/3081/SMCO_ENUR_TSUN_EN_WEB", "http://pubads.g.doubleclick.net/gampad/clk?id=182027221&iu=/3081/SMCO_ENUR_TSUN_EN_WEB", "http://pubads.g.doubleclick.net/gampad/clk?id=183052021&iu=/3081/SMCO_ENUR_TSUN_EN_WEB", "http://pubads.g.doubleclick.net/gampad/clk?id=182024221&iu=/3081/SMCO_ENUR_TSUN_EN_WEB", "http://blogs.canoe.ca/offtheposts"], "published": "2015-10-13T03:29:00.000+03:00", "crawled": "2015-10-15T04:42:10.972+03:00", "highlightTitle": ""}