{"organizations": [], "uuid": "ed585be4dabeb50305462f92a875d93d03a61c07", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kansan.com", "main_image": "http://kansan.com/content/tncms/live/global/resources/images/_site/kansan-logo4_1024.png", "site_section": "http://www.kansan.com//search/?q=&t=article&l=100&d=&d1=&d2=&s=start_time&sd=desc&nsa=eedition&c[]=sports,sports/*&f=rss", "section_title": "The University Daily Kansan - sports,sports/", "url": "http://www.kansan.com/sports/kansas-mens-basketball-media-day-takeaways/article_a59140fa-6898-11e5-9008-6f557f49ed19.html", "country": "US", "title": "Kansas mens' basketball media day takeaways", "performance_score": 0, "site": "kansan.com", "participants_count": 1, "title_full": "Kansas mens' basketball media day takeaways", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:07:00.000+03:00", "replies_count": 0, "uuid": "ed585be4dabeb50305462f92a875d93d03a61c07"}, "author": "By: Scott Chasen, Shane Jackson, Evan Riggs | @KansanSports", "url": "http://www.kansan.com/sports/kansas-mens-basketball-media-day-takeaways/article_a59140fa-6898-11e5-9008-6f557f49ed19.html", "ord_in_thread": 0, "title": "Kansas mens' basketball media day takeaways", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Kansas mens' basketball media day takeaways By: Scott Chasen, Shane Jackson, Evan Riggs | @KansanSports kansan.com \nWith Late Night in the Phog right around the corner, Kansas men's basketball hosted its media day from Allen Fieldhouse on Thursday. These are some of the notes from the event. \nFrank Mason III \nLast year, Frank Mason III really surprised some people, stepping up as the leader of the Jayhawks. For that, he earned a spot on the All-Big 12 Second Team, and with another year of experience under his belt, he said an older Kansas Jayhawks basketball team should fare well this year. \n“We know what coach wants from us. Everyone knows the offense except the younger guys, [and] they’re getting used to it,” Mason said. “We want to be No. 1, but we have to work hard to get there. “ \nJunior shooting guard Wayne Selden Jr. added that Mason has become the unquestioned leader of the team, stepping up as the point guard. Mason, Selden and sophomore Devonte’ Graham are all expected to be a big part of Kansas’ backcourt this year. \nPerry Ellis \nWhen senior forward Perry Ellis decided to come back to Kansas for his senior season, he cited unfinished business as a big reason why. After a full offseason of work, he said he feels a lot stronger and praised the job that strength and conditioning coach Andrea Hudy is doing. \n“Unfortunately injuries happen,” Ellis said. “I’m just thankful, I praise God that it wasn’t anything bad. I’m back, I feel great and I’m ready to get started.” \nEllis also said that he’s completely over his knee injury that ailed him down the stretch of last season. Ellis said he is currently 100 percent and looking forward to the first game of the year. \nLanden Lucas \nLast summer at the World University Games, the Jayhawks were given the opportunity to participate in an extra month of practice and games, the latter of which was experience that nobody else in the country could mirror. Junior forward Landen Lucas said that experience should pay dividends in the 2015-16 season. \n“It’s something that, come tournament time, small things like that become a big factor,” Lucas said. “You might not see it early on. We might look like the same team we would have been. But I think when it really gets going and it gets to the games that matter, we’ll be better as a team.” \nThe Jayhawks still have a ways to go before their regular season starts. The team’s home opener is still over a month away — November 13. The first “big game,” to use Lucas’ words, will come four days later against Michigan State. \nHunter Mickelson \nMickelson seemed upbeat about his role on the team, especially after a productive summer at the World University Games. As he starts his senior year, he said he knows what the coaches want from him, and he knows how he can continue to be productive. \n“[I just have to] stay mentally tough,” Mickelson said. “I’ll do whatever I have to do to help out.” \nMickelson averaged just 2.4 points and 1.8 rebounds per game last year, but there is some room for that role to increase, especially with Cheick Diallo’s eligibility still up in the air. \nCarlton Bragg \nLate Night is a special experience for the players, particularly for the freshmen. Freshman forward Carlton Bragg got a sneak peek of how special Late Night can be, as a recruit last year. \n“Coming in as a recruit I was blown away,” Bragg said. “Having the fans cheer me on, it felt like home. At that moment, I knew I was in the right place.” \nLate Night is just one week away. Kansas coach Bill Self said he expects a full house, unlike last year, where a couple of factors left some open seats in Allen Fieldhouse. \nLaGerald Vick \nBoth Vick and Bragg got the luxury of playing with Kansas overseas in the World University Games in South Korea. While many freshmen struggle to adapt to the college level, Vick feels more confident due to the experience he got this past summer. \n“This summer gave me an advantage over all the other freshman,” Vick said. “Being able to go to South Korea helped me build chemistry with the team, it was really important.” \nWhile Vick didn’t play a tremendous amount of minutes this summer, he did have the benefit of playing in actual games with the team, rather than just scrimmaging. Self mentioned that Vick showed promise in practice on the defensive end, although minutes could be hard to come by this year given how deep the team is.", "external_links": [], "published": "2015-10-02T03:07:00.000+03:00", "crawled": "2015-10-02T17:23:01.105+03:00", "highlightTitle": ""}