{"organizations": [], "uuid": "e3f6786a9edbae9a3d5f6ebe32e63ade489e5283", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattletimes.com", "main_image": "http://www.seattletimes.com/wp-content/themes/st_refresh/img/st-meta-facebook.png", "site_section": "http://seattletimes.com/rss/pac12confidential.xml", "section_title": "The Seattle Times » Sections » Sports", "url": "http://www.seattletimes.com/sports/seahawks/explaining-seattle-seahawk-receiver-paul-richardsons-situation/?utm_source=RSS&utm_medium=Referral&utm_campaign=RSS_sports", "country": "US", "title": "Explaining Seattle Seahawk receiver Paul Richardson’s situation", "performance_score": 0, "site": "seattletimes.com", "participants_count": 1, "title_full": "Explaining Seattle Seahawk receiver Paul Richardson’s situation | The Seattle Times", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T18:01:00.000+03:00", "replies_count": 0, "uuid": "2a1dbce3b021282cc852eeecc69cb8474091fa0d"}, "author": "Bob Condotta", "url": "http://www.seattletimes.com/sports/seahawks/explaining-seattle-seahawk-receiver-paul-richardsons-situation/", "ord_in_thread": 0, "title": "Explaining Seattle Seahawk receiver Paul Richardson’s situation", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "There have been continued questions about how things work with Seattle receiver Paul Richardson, as well as cornerback Jeremy Lane, who were each eligible to come off the PUP (Physically Unable to Perform) list.\nAs detailed here players on the PUP cannot be activated until after the sixth week, which was this week. After that time, as explained in the link: ”A 21-day window is given to allow the player on reserve/PUP to practice between the end of week six (October 20 th ), and before the conclusion of week eleven (November 24). Once activated to practice the player can be placed on the 53-man active roster at any point during the 21-day window period. If the window runs out or the player is not permitted to practice by the end of week 11, he’ll stay on PUP for the remainder of the season. While on reserve/PUP players receive their salary and count on the salary cap.”\nThe Seahawks could have brought both players off the PUP list this week but decided not to because with the short week of practice — which also meant nothing basically but walk-throughs — the team would not have gotten much work for Richardson, who is trying to come back from an ACL injury suffered last January in the divisional playoff game against Carolina.\nCoach Pete Carroll has said several times that Richardson is ready to go. But as he explained Wednesday, it simply didn’t make sense to pull him off the PUP list this week.\nMost Read Stories Fugitive felon, linked to motorcycle gang, captured in Lynnwood after 4-month hunt Files for lawsuit against CIA stolen in 'suspicious' break-in at UW Bill the Butcher workers still seeking CEO who vanished with their pay 5 ways CaliBurger is better than In-N-Out Seahawks’ Fred Jackson crashes car; Cops say no evidence of drag racing Unlimited Digital Access. $1 for 4 weeks. “Yeah, we’re going to get him a full week so he can practice,” Carroll said. “This is not a week to really test a guy and check him out, because we have to go so light in terms of the tempo of practice.”\nSo expect Richardson to come off the list next week.\nLane is attempting to recover from both an ACL injury and a broken arm suffered in the Super Bowl and Carroll says Lane may need a few more weeks to be ready to return.\nAs explained above, the team will have to pull Lane off the list by Nov. 24.\nOnce the team decides to activate the players to the 53-man roster, another player will have to be waived or released to make room.\n \nBob Condotta : 206-515-5699 or bcondotta@seattletimes.com ; on Twitter: @bcondotta . Bob Condotta covers the Seahawks for the Seattle Times. He provides daily coverage of the team throughout the year.", "external_links": [], "published": "2015-10-22T18:01:00.000+03:00", "crawled": "2015-10-23T01:43:07.083+03:00", "highlightTitle": ""}