{"organizations": [], "uuid": "495b8878f01955382be19f6a791ccf2a3398bcef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-5612fb48/turbine/ct-spt-1006-prep--fb-week-7-recruiting-notes-20151005", "site_section": "http://www.chicagotribune.com/sports/highschool", "section_title": "Illinois High School Sports News - Preps Plus - Chicago Tribune", "url": "http://www.chicagotribune.com/sports/sports/highschool/ct-spt-1006-prep--fb-week-7-recruiting-notes-20151005-story.html", "country": "US", "title": "Football recruiting: Conant WR/DB Palmer Graham has eyes on Big Ten schools - Chicago Tribune", "performance_score": 0, "site": "chicagotribune.com", "participants_count": 1, "title_full": "Football recruiting: Conant WR/DB Palmer Graham has eyes on Big Ten schools - Chicago Tribune", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T01:35:00.000+03:00", "replies_count": 0, "uuid": "495b8878f01955382be19f6a791ccf2a3398bcef"}, "author": "Bob Narang", "url": "http://www.chicagotribune.com/sports/sports/highschool/ct-spt-1006-prep--fb-week-7-recruiting-notes-20151005-story.html", "ord_in_thread": 0, "title": "Football recruiting: Conant WR/DB Palmer Graham has eyes on Big Ten schools - Chicago Tribune", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Palmer Graham can provide a detailed scouting report on one of best two-way players in the Mid-Suburban League.\nBut the Conant senior wide receiver and defensive back prefers to keep most of his trade secrets to himself.\nAs the only two-way starter for the 5-1 Cougars, Palmer has in-depth knowledge how to beat defensive backs or stop talented wide receivers — including himself.\n\"If I was a defensive back, I would take some steps back and not press myself,\" Graham said. \"If I was a receiver, I would try and take advantage of my physicality. I'm real physical off the line and try to press people.\"\nAny knowledge how to stop, or slow down, Graham on offense would be helpful for the remaining teams on the Cougars' schedule. Graham torched undefeated Barrington for 11 receptions and 223 yards and three touchdowns in Saturday's 40-34 loss.\nDespite Barrington decision to shade a safety toward Graham's side, Conant quarterback Kyle Bradley kept dialing Graham's number in key situations. Graham caught touchdown passes of 53, 2 and 71 yards. He also had a 29-yard touchdown reception in the second quarter called back because of a holding penalty.\nWeek 6 recruiting notes: Deerfield's Johnny Fisher hopes pillage of Vikings aids recruitment Bob Narang Deerfield senior running back Johnny Fisher's intentions were to follow his coaches' instructions.\nDeerfield coach Steve Winiecki told Fisher to secure a first down late in Friday night's game against Niles North.\nNothing more. Nothing less.\n\"I told the team before that final drive, 'If we break...\nDeerfield senior running back Johnny Fisher's intentions were to follow his coaches' instructions.\nDeerfield coach Steve Winiecki told Fisher to secure a first down late in Friday night's game against Niles North.\nNothing more. Nothing less.\n\"I told the team before that final drive, 'If we break...\n(Bob Narang) Graham said his performance against the No. 11 Broncos should merit more attention from colleges.\n\"It was really good for me,\" Graham said. \"It was pretty much testing the waters to show what I could do. I had to really show up and show what I could do in a prime-time situation for my team.\n\"I'm one of the best players on the team and had to make plays for my team to keep us in the game. It was a real showing of my skills. Coming into the Barrington game, I had some good games, but I hadn't had a breakout game like I did against Barrington.\"\nGraham now has 37 receptions for 693 yards and six touchdowns this season. Speedy and elusive with good hands, Graham is hampered by a numbers game that defines football players almost more than their statistics.\nListed as 5-foot-9 and 165 pounds, Graham is on the shorter side height-wise for a Division I recruit. His scholarship offers — Army, Alabama State, North Carolina Central, Butler, Drake and Lincoln University — aren't from schools that regularly step into the national spotlight.\nIn addition to his handful of offers, Graham has interest from Northern Illinois, Illinois, North Carolina, North Carolina and Georgia State, he said.\n\"I knew going into this season that I had to have a really strong year because I talked to a whole lot of colleges,\" Graham said. \"They knew I had a whole lot of talent but were always concerned with my height. Even with the height, it was a question if my talent was enough and better than someone who was two inches taller than me who they could offer to.\n\"I came into the season with a chip on my shoulder to show and prove that I was one of the best players in the state.\"\nPalmer said some of the schools are recruiting him as a defensive back, though he's being classified as an athlete. With no visits planned yet, Palmer is gearing toward a strong finish, personally and team-wise.\n\"I want at least a Big Ten offer or two,\" he said. \"I've been talking to a lot of schools, from ACC to Big Ten schools. I really like NIU. That's one of my favorite Mid-American Conference schools. I've been talking to them since my sophomore year.\n\"I want to get all the coaches' attention and get far into the playoffs. The coaches want to see the teams that get far in the playoffs.\"\nThe right tackle for the job: Barrington senior right tackle Alex Serrano hopes his aspirations match his size. At 6-3 and 285 pounds, Serrano is a key cog in Barrington's offensive line.\nA three-year starter, Serrano has practiced taking snaps at center, but he would prefer to play tackle.\nHis main interest is from Northern Illinois and Indiana.\n\"I have done a lot of visits, been around quite a bit to a lot of (summer) camps,\" Serrano said. \"I want to play at the highest level: Division I.\"\nIn his eighth-grade season, Serrano watched former Barrington offensive lineman Dan Voltz become one of the top recruits in the country. Voltz, now a redshirt junior at Wisconsin, is a 2012 Barrington graduate.\n\"I learned more from watching Voltz on the field and I've talked to him,\" Serrano said. \"His effort is amazing. He has a drive in him that you don't see in a lot of people. His work ethic and natural skill is great, just everything about him.\"\nBob Narang is a freelance reporter for the Chicago Tribune.\nPrivacy Policy College Sports Barrington Northern Illinois Huskies North Carolina Tar Heels Illinois Fighting Illini Mid-American Conference Sports", "external_links": ["http://www.tribpub.com/privacy-policy-and-your-privacy-rights/", "http://www.trbimg.com/img-5609c592/turbine/ct-spt-0929-prep-fb-week-6-recruiting-notes-20150928", "http://www.trbimg.com/img-5612fb48/turbine/ct-spt-1006-prep--fb-week-7-recruiting-notes-20151005"], "published": "2015-10-06T01:35:00.000+03:00", "crawled": "2015-10-06T20:21:25.459+03:00", "highlightTitle": ""}