{"organizations": ["Fremantle Dockers"], "uuid": "d212731a5fc59df5e5a1271582f0bae44abdc0d7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.perthnow.com.au", "main_image": "http://cdn.newsapi.com.au/image/v1/fbbad02610d67548acb6b54b1557eb60", "site_section": "http://feeds.news.com.au/public/rss/2.0/pnow_sport_173.xml", "section_title": "PerthNow | Sports News", "url": "http://www.perthnow.com.au/sport/afl/teams/fremantle/ruckman-aaron-sandilands-wins-fremantle-dockers-club-champion-award-doig-medal/news-story/cba0918ced33f9bbb428f03712b1c02a?from=public_rss&nk=004572e1c54e78776352b67b88b6be81-1444547277", "country": "IL", "title": "Sandi beats Fyfe for Dockers club champion", "performance_score": 0, "site": "perthnow.com.au", "participants_count": 0, "title_full": "Sandi beats Fyfe for Dockers club champion", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T18:38:00.000+03:00", "replies_count": 0, "uuid": "d212731a5fc59df5e5a1271582f0bae44abdc0d7"}, "author": "", "url": "http://www.perthnow.com.au/sport/afl/teams/fremantle/ruckman-aaron-sandilands-wins-fremantle-dockers-club-champion-award-doig-medal/news-story/cba0918ced33f9bbb428f03712b1c02a?from=public_rss&nk=004572e1c54e78776352b67b88b6be81-1444547277", "ord_in_thread": 0, "title": "Sandi beats Fyfe for Dockers club champion", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Aaron Sandilands", "Sandi", "Justin Benson-Cooper", "Fyfe", "Ruckman Aaron Sandilands", "Doig Medal BRADEN QUARTERMAINE"], "text": "Ruckman Aaron Sandilands wins Fremantle Dockers club champion award Doig Medal BRADEN QUARTERMAINE PerthNow Ruckman Aaron Sandilands wins Fremantle Dockers club champion award Doig Medal BRADEN QUARTERMAINE PerthNow Aaron Sandilands has won the Fremantle Dockers’ club champion award, the Doig Medal. Picture: Justin Benson-Cooper \nCHAMPION Fremantle ruckman Aaron Sandilands claimed his second Doig Medal as Brownlow Medal winner Nat Fyfe was relegated to fourth in a dramatic count at Crown Perth. \nFyfe’s four games missed through injury proved costly, as 32-year-old Sandilands cemented his reputation as one of the club’s greats by becoming the fourth multiple winner of the Doig Medal. \nSandilands joined skipper Matthew Pavlich, former captain Peter Bell and Fyfe in that elite club. \nHaving finished second to Fyfe last season, Sandilands won with 282 votes, edging out midfielder David Mundy by five votes. \nStephen Hill finished third on 261 votes, one ahead of Fyfe, with Michael Walters rounding out the top five. Doig Medal: Purple carpet glamour Previous Next Fremantle Dockers’ 2015 Doig Medal dinner at Crown Perth. David and Sally Mundy. Picture: Justin Benson-Cooper 1 of 22 Fremantle Dockers’ 2015 Doig Medal dinner at Crown Perth. Hayden Ballantyne and Alyssa Hennessy. Picture: Justin Benson-Cooper 2 of 22 Fremantle Dockers’ 2015 Doig Medal dinner at Crown Perth. Lauren and Matthew Pavlich. Picture: Justin Benson-Cooper 3 of 22 Fremantle Dockers’ 2015 Doig Medal dinner at Crown Perth. Melissa and Steve Rosich. Picture: Justin Benson-Cooper 4 of 22 Fremantle Dockers’ 2015 Doig Medal dinner at Crown Perth. Zac Clarke and Amy Goodall. Picture: Justin Benson-Cooper 5 of 22 Fremantle Dockers’ 2015 Doig Medal dinner at Crown Perth. Nick Suban and Bianca Monaco. Picture: Justin Benson-Cooper 6 of 22 Fremantle Dockers’ 2015 Doig Medal dinner at Crown Perth. Ethan Hughes and Jessica Bessell. Picture: Justin Benson-Cooper 7 of 22 Fremantle Dockers’ 2015 Doig Medal dinner at Crown Perth. Kalinz and Luke McPharlin. Picture: Justin Benson-Cooper 8 of 22 Fremantle Dockers’ 2015 Doig Medal dinner at Crown Perth. Tendai Mzungu and Jessica Duncan. Picture: Justin Benson-Cooper 9 of 22 Fremantle Dockers’ 2015 Doig Medal dinner at Crown Perth. Aaron and Jenny Sandilands. Picture: Justin Benson-Cooper 10 of 22", "external_links": [], "published": "2015-10-10T18:38:00.000+03:00", "crawled": "2015-10-11T10:08:25.280+03:00", "highlightTitle": ""}