{"organizations": [], "uuid": "94003fc21faf417620f372548cfbe1aa9e8b21ac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.local12.com", "main_image": "http://www.local12.com//template/ugc/wkrc/1601/0q8GD2ez.png", "site_section": "http://www.local12.com/sports/features/local-sports/rss.xml", "section_title": "wkrc LOCAL Sports", "url": "http://www.local12.com/sports/features/local-sports/stories/Pirates-clinch-home-field-in-wild-card-game-with-win-4-0-214312.shtml", "country": "US", "title": "Pirates clinch home field in wild-card game with win 4-0", "performance_score": 0, "site": "local12.com", "participants_count": 0, "title_full": "Pirates clinch home field in wild-card game with win 4-0", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T21:52:00.000+03:00", "replies_count": 0, "uuid": "94003fc21faf417620f372548cfbe1aa9e8b21ac"}, "author": "", "url": "http://www.local12.com/sports/features/local-sports/stories/Pirates-clinch-home-field-in-wild-card-game-with-win-4-0-214312.shtml", "ord_in_thread": 0, "title": "Pirates clinch home field in wild-card game with win 4-0", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Pirates clinch home field in wild-card game with win 4-0 \nUpdated: Sun, Oct 04 2015, 06:52 PM \nPITTSBURGH (AP) -- The Pittsburgh Pirates clinched the home field in the NL wild card-game, beating the Cincinnati Reds on Sunday behind J.A. Happ's stellar outing and Pedro Alvarez's long homer.The Pirates (98-64) locked up the right to host the Chicago Cubs (97-65) Wednesday night in a winner-take-all playoff, with a victory on the final day of the regular season.Despite having the second-best record in the major leagues, the Pirates finished second to the St. Louis Cardinals in the NL Central. Pittsburgh will host the wild-card game for the third straight year after beating Cincinnati in 2013 and losing to the San Francisco Giants last season.The Pirates had 20 straight losing seasons, the longest streak in major North American professional sports history, before their current run of postseason appearances.The Reds, who snapped a 13-game losing streak on Saturday night, finished 64-98 and last in the Central. That is their most losses since 1937 when they went 56-98, and their first last-place finish since 1983.Happ (11-8) gave up three hits in six innings. He struck out seven and walked two while improving to 7-2 in 11 starts since being acquired July 31 from the Seattle Mariners.Joakim Soria, Tony Watson and Mark Melancon finished the six-hitter with one scoreless inning each.Alvarez's 479-foot leadoff home run to center field in the fourth inning, his team-high 27th, made it 2-0 after Josh Harrison doubled in the first and scored on Neil Walker's single.Harrison and Francisco Cervelli each had three of the Pirates' 13 hits and Jordy Mercer had two.Back-to-back doubles by Cervelli and Mercer in the sixth and Gregory Polanco and Harrison in the seventh padded the Pirates' lead.Rookie Josh Smith (0-4) remained winless in seven career starts as he gave up two runs and seven hits in four innings with four strikeouts and no walks. Rookies started each of the Reds' last 64 games and 112 overall, both major league records.Reds third baseman Todd Frazier had two hits.RAMIREZ, BURNETT FETEDPirates third baseman Aramis Ramirez and right-hander A.J. Burnett, who are both retiring at the end of the season, were honored in pregame ceremonies. Ramirez is finishing his 18th season and Burnett is a 17-year veteran.ATTENDANCE RECORDThe Pirates set a single-season attendance record for a second straight year with a total of 2,498,596, up 56,032 from last season, and an average of 30,847 a game.UP NEXTReds: Open the 2016 season against the Philadelphia Phlllies on April 4 at home. The Phillies (63-99) and Reds had the two worst records in the major leagues this year.Pirates: RHP Gerrit Cole (19-9, 2.60 ERA in the regular season) will start the wild card game and face RHP Jake Arrieta (22-6, 1.77).(AP Photo/Keith Srakocic)Follow us on Twitter @Local12 and LIKE us on Facebook for updates! Related Stories", "external_links": [], "published": "2015-10-04T21:52:00.000+03:00", "crawled": "2015-10-05T10:41:23.936+03:00", "highlightTitle": ""}