{"organizations": [], "uuid": "78d4101c235094e8f7a7d08585fb88e58b9f6f5f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.signalscv.com", "main_image": "http://media.morristechnology.com/webmedia/upload/santa_clarita/article/2015/10/23/1024_sports_Val_WR_fball_dw_01A.jpg", "site_section": "http://www.the-signal.com/syndication/feeds/rss/19/", "section_title": "SCV Prep Sports", "url": "http://www.signalscv.com/section/19/article/143984/", "country": "US", "title": "Valencia football's balanced attack beats Wildcats", "performance_score": 0, "site": "signalscv.com", "participants_count": 1, "title_full": "Valencia football's balanced attack beats Wildcats", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T09:03:00.000+03:00", "replies_count": 0, "uuid": "78d4101c235094e8f7a7d08585fb88e58b9f6f5f"}, "author": "Lorrie Reyes", "url": "http://www.signalscv.com/section/19/article/143984/", "ord_in_thread": 0, "title": "Valencia football's balanced attack beats Wildcats", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Valencia football's balanced attack beats Wildcats Valencia improves to 3-0 in league play Posted: October 23, 2015 11:03   23, 2015 11:03 p.m. Valencia’s Effie Davalos (25) fights for extra yardage near the goal line in the first quarter against West Ranch on Friday night at Valencia High School. Signal photo by Dan Watson. \nValencia football wanted to show its offensive firepower this week. \nThe Vikings stressed playing well from the very beginning. They emphasized balance. \nAnd Valencia did both of those things in its 44-6 win over West Ranch Friday night at Valencia High School. \n“Last week, offensively we sputtered a lot and we didn’t do that tonight. We were sharp. I thought we were crisp,” said Valencia head coach Larry Muir. “I thought we did a good job of playing well from the very beginning. It was really important for us and we worked that way all week.” \nThe Vikings had seven possessions in the first half and they scored on every one of them. \nSix of those possessions went into the end zone and the other still went on the scoreboard on a 36-yard field goal. \nFour of those touchdowns came on the ground, two from senior running back Jahmar Berkley — who carried the ball five times for 34 yards on the night — one from Andres Alday, from 1 yard out, and one from senior quarterback Cole Parkinson. \nParkinson ran the ball from 7 yards out on a draw play to the left side. The Valencia signal caller went in untouched as he was all alone when everyone else went to the right. \nThe Vikings quarterback, who only threw for 40 yards in last week’s win over Saugus, passed for 213 yards with two touchdowns and zero interceptions on 13-for-18 against the Wildcats. \n“Parkinson did a great job distributing the ball. He was on time and on target early,” Muir said. “I thought he did a really good job and the receivers did a really good job running routes and reading the coverage.” \nParkinson hit Ely Doyle for the first score of the night from 26 yards out in the middle of the first quarter. Doyle finished the night with 43 yards on two receptions. \nDrew Rivello was Parkinson’s main target on the night, pulling in a 72-yard TD with just 31 seconds left in the first half. Rivello caught four passes for 104 yards. \n“We’re always looking for balance,” said Muir, whose team moves to 5-3 overall and 3-0 in Foothill League. “You can not be good at one. You have to be balanced.” \nWest Ranch, which drops to 3-5 overall, 0-3 in league, had a hard time getting anything going offensively, except for its first drive. \nJackson Clark, who returned this week from a concussion, went 6-for-16 with a pick and was sacked twice by Valencia’s Jermaine Brown. \n“Valencia is who they are,” said West Ranch head coach Jan Miller. “We came into this week ,we knew Valencia had only given up seven points to the first two teams they played. We wanted to take it one play at a time. We moved the ball … but we have a lot of stuff to work on.”", "external_links": [], "published": "2015-10-24T09:03:00.000+03:00", "crawled": "2015-10-24T18:03:23.491+03:00", "highlightTitle": ""}