{"organizations": [], "uuid": "1146b4ee23f6f088984641996d766823586eaf21", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/49450820.cms", "site_section": "http://timesofindia.indiatimes.com/rssfeeds/4719148.cms", "section_title": "The Times of India Sports: Extensive sports coverage, key statistics and free downloads", "url": "http://timesofindia.indiatimes.com/sports/boxing/I-want-young-boxers-to-follow-pro-boxing-Vijender-Singh/articleshow/49450817.cms", "country": "IL", "title": "‘I want young boxers to follow pro boxing’: Vijender Singh", "performance_score": 0, "site": "indiatimes.com", "participants_count": 2, "title_full": "‘I want young boxers to follow pro boxing’: Vijender Singh - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T16:28:00.000+03:00", "replies_count": 1, "uuid": "1146b4ee23f6f088984641996d766823586eaf21"}, "author": "Rohit E David", "url": "http://timesofindia.indiatimes.com/sports/boxing/I-want-young-boxers-to-follow-pro-boxing-Vijender-Singh/articleshow/49450817.cms", "ord_in_thread": 0, "title": "‘I want young boxers to follow pro boxing’: Vijender Singh", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW DELHI: All pumped up for his second bout after a knockout professional debut, boxer Vijender Singh is all set for his next match on October 30 at the Harrow Leisure Centre. He spoke to TOI on the reactions people gave him on turning pro, how he's gearing up for his second fight and what critics told him before turning pro.\nCan you tell us about some of the reactions you've got after turning pro? \nThe response I have received from my fans, friends and fellow boxers from India and in UK was fabulous. Many Indians have come here at Manchester Arena to support me. Also on Twitter #vijendersingh was trending at No 1 for some time so you can imagine the response from people. I have received good luck and congratulatory messages from Bollywood stars, sportspersons, friends, fans and politicians. So overall it was amazing response.\n\nHow difficult is it to become a professional boxer? \nIt's very difficult to become a professional boxer but nothing is impossible. With hard work and dedication you can make everything possible. I only have one thing in my mind as of now that I want to do something in professional boxing for my country and young boxers, so I am working hard for the same.\n\nHow hard was your first professional fight? \nI was bit nervous before getting into the ring but the moment I started it, I was getting more and more confident and I gave my 100 percent in the ring. One thing I can say that my amateur experience is helping me a lot.\nHow are you gearing up for your second fight on October 30? \nMy training for the second fight started just 24 hours after my debut fight and I am working hard again. My trainer Lee Beard is working hard on me. Spending six hours daily training and working on physical and mental fitness. I want to continue the winning momentum.\nHow strict is the training in the pro circuit? \nIt's a very hard training. Pro is not easy thing, daily I am training minimum for six hours and thereafter also I am watching some professional boxing videos to learn new and new things. Training involves lot of physical workout.\nWhat have you learnt from Lee Beard? \nI have learnt a lot from Lee Beard and he is successfully changing me from amateur to professional. My technique is changing, ways of defence are changing as there is no headgear in professional.so good to learn new thing every day.\nWhat do you have to say about people who were critical before you turned pro? \nI just say that I want India to be known for professional boxing and just working hard to achieve this target. I know people criticise but I believe in giving results.\nWould you recommend pro boxing to other boxers? \nYes why not, I want young boxers to follow professional boxing and make career in it.\nStay updated on the go with Times of India News App. Click here to download it for your device.", "external_links": [], "published": "2015-10-19T16:28:00.000+03:00", "crawled": "2015-10-19T14:08:09.177+03:00", "highlightTitle": ""}