{"organizations": [], "uuid": "77ac25de5a8ad318301c933edbbcb15e841b74cd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nytimes.com", "main_image": "http://static01.nyt.com/images/icons/t_logo_291_black.png", "site_section": "http://www.nytimes.com/services/xml/rss/nyt/Sports.xml", "section_title": "NYT &gt; Sports", "url": "http://www.nytimes.com/2015/10/03/sports/football/pittsburgh-steelers-four-fourth-down-failures-lead-to-second-guessing.html", "country": "US", "title": "Steelers’ Four Fourth-Down Failures Lead to Second-Guessing", "performance_score": 0, "site": "nytimes.com", "participants_count": 1, "title_full": "Steelers’ Four Fourth-Down Failures Lead to Second-Guessing - The New York Times", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T18:12:00.000+03:00", "replies_count": 0, "uuid": "77ac25de5a8ad318301c933edbbcb15e841b74cd"}, "author": "Victor Mather", "url": "http://www.nytimes.com/2015/10/03/sports/football/pittsburgh-steelers-four-fourth-down-failures-lead-to-second-guessing.html", "ord_in_thread": 0, "title": "Steelers’ Four Fourth-Down Failures Lead to Second-Guessing", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " The Pittsburgh Steelers faced a crucial fourth down four times in the last three minutes and overtime of Thursday night’s game against the Baltimore Ravens. Success on even one of them might have locked up the win. All four times they failed.\nThe Steelers got a solid performance by quarterback Michael Vick , subbing for the injured Ben Roethlisberger, and a strong one from running back Le’Veon Bell. With 2 minutes 30 seconds to play, the Steelers had a 20-17 lead and the ball in Ravens territory.\nThat’s when it started to turn sour.\nAfter a failed short pass on third-and-5, the Steelers sent out Josh Scobee to try a 49-yard field goal. Scobee was two for two, having made kicks of 45 and 36 yards in the first half. He was six for eight on the year. But he missed this one, wide left.\nThe Ravens went four-and-out quickly, and the Steelers took over again at the Baltimore 29 with 2:11 left. Pittsburgh was 93.8 percent likely to win the game at that point, according to Football-Reference.\n N.F.L. Week 4 Previews and Picks OCT. 1, 2015 Fantasy Football Week 4: Rankings and Matchup Analysis OCT. 1, 2015 The Steelers gave the ball to Bell three times, for gains of 1, 4 and 1 yard. On fourth-and-4, Scobee came out again, this time to try a 41-yarder. Again he was wide left.\nThere was some grumbling online about Coach Mike Tomlin’s decisions to kick and try to increase his lead to 6 points, from 3, rather than go for it. The New York Times Fourth Down Bot did approve of both decisions .\nGiven another chance, Joe Flacco led the Ravens downfield in less than a minute, and they got a game-tying field goal.\nIn overtime, the second-guessing of Tomlin swelled.\nThe Steelers won the toss and opted for the ball. A 22-yard run by Bell took them past midfield, but the offense stalled again. Bell ran twice more to set up third-and-2, and Vick tried a short pass that fell incomplete.\nOn fourth-and-2, the Steelers were looking at a 56-yard field goal attempt. After the two regulation misses by Scobee, Tomlin went for it, calling an end around by Vick. He fell short.\nThe Ravens failed too, though, and the Steelers had one more chance to win. Again they crossed midfield. Again they stalled. Again they faced a fourth down, this time fourth-and-1 with a 50-yard field goal attempt as an option. Again Tomlin decided to go for it. Vick’s pass was a little too high, and incomplete.\nTomlin was hit by critics from two directions. Some felt Scobee should have been given the chance to kick the winning field goal. More agreed with the decision to go for it, but wondered why Tomlin did not call Bell’s number on fourth down, after his impressive 129-yard game.\n Two fourth-down plays in overtime, and the Steelers don’t give the ball to Le’Veon Bell either time. How?\n— CoachingSearch.com (@coachingsearch) Oct. 2, 2015 The Ravens kicked the winning field goal on the next series.\n“When you lose you’re open to criticism,” Tomlin said after the game. “Anything we did, I take responsibility for.”\nVick, who was 19 for 26 for 124 yards, said, “That fourth-and-1 pass has got to be made somehow, some way.”\nThe press was scathing.\n“Blown Fourth-Down Call Dooms Steelers as Le’Veon Bell Doesn’t Get Ball,” was ESPN’s headline .\nDeadspin was even tougher : “The Steelers Faced Four Important Fourth Downs and Blew Them All.”\nOthers opted to blast Scobee for his misses, including the rapper Snoop Dogg, who denounced the kicker on Instagram with colorful language . Many called for Scobee to be cut.\n Every time a Josh Scobee field goal attempt is in the air, I think about his future in drywall repair.\n— Norman Chad (@NormanChad) Oct. 2, 2015 It was an improbable and huge victory for the Ravens, who have made the playoffs six of the last seven years and avoided slipping to 0-4.\nFor the Steelers, who fell to 2-2, it was a missed opportunity to bury a division rival. And a game that will be remembered queasily for some time.\n ", "external_links": ["http://static01.nyt.com/images/2015/10/01/sports/01fantasy1/01fantasy1-thumbStandard.jpg", "http://nyt4thdownbot.com/game/20151001/ravens-steelers", "http://static01.nyt.com/images/2015/10/02/sports/04matchups1/04matchups1-thumbStandard.jpg", "https://instagram.com/p/8Ud4Ifv9GR/", "http://deadspin.com/the-steelers-faced-four-important-4th-downs-and-blew-th-1734202225", "http://espn.go.com/blog/pittsburgh-steelers/post/_/id/15518/blown-fourth-down-call-dooms-steelers-as-leveon-bell-doesnt-get-the-ball", "http://www.pro-football-reference.com/boxscores/201510010pit.htm", "https://twitter.com/NormanChad/statuses/649746141039325184", "https://twitter.com/coachingsearch/statuses/649791750123450368", "http://a1.nyt.com/assets/article/20150928-155824/images/foundation/logos/"], "published": "2015-10-02T18:12:00.000+03:00", "crawled": "2015-10-02T17:24:27.498+03:00", "highlightTitle": ""}