{"organizations": [], "uuid": "be0af1ed1ce9dbc3ef337c076dee8c35b1ed9622", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wvva.com", "main_image": "", "site_section": "http://www.wvva.com/Global/category.asp?C=123736&clienttype=rss\r", "section_title": "WVVA TV - Sports", "url": "http://www.wvva.com/story/30168708/2015/10/01/concord-loses-at-tough-one-at-charleston", "country": "US", "title": "Concord loses at tough one at Charleston", "performance_score": 0, "site": "wvva.com", "participants_count": 1, "title_full": "Concord loses at tough one at Charleston", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T06:56:00.000+03:00", "replies_count": 0, "uuid": "be0af1ed1ce9dbc3ef337c076dee8c35b1ed9622"}, "author": "A.J. Good", "url": "http://www.wvva.com/story/30168708/2015/10/01/concord-loses-at-tough-one-at-charleston", "ord_in_thread": 0, "title": "Concord loses at tough one at Charleston", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Concord loses at tough one at Charleston Charleston, WVWVVA-TVConcord lost its 2nd game of the season on the road at Charleston on Thursday night 29-21. The loss drops the Mountain Lions to 3-2 on the season and 3-2 in the Mountain East Conference.Calvinaugh Jones led the Mountain Lions with 125 yards on 19 carries with 1 toucdown. But Concord couldn't stop UC's Jeremy Johnson who had 293 yards total offense with 4 touchdowns.Concord will host UVA-Wise next Saturday for homecoming. More >> Charleston, WVWVVA-TVConcord lost its 2nd game of the season on the road at Charleston on Thursday night 29-21. The loss drops the Mountain Lions to 3-2 on the season and 3-2 in the Mountain East Conference.Calvinaugh Jones led the Mountain Lions with 125 yards on 19 carries with 1 toucdown. But Concord couldn't stop UC's Jeremy Johnson who had 293 yards total offense with 4 touchdowns.Concord will host UVA-Wise next Saturday for homecoming. More >> Game of the Week: Lots of points to be scored between Richlands and Bluefield Bluefield, WVWVVA-TVFor Richlands and Bluefield. the 2015 season is off to a nice start. \"We are getting better as a football team we are playing really good defense but we haven't giving up 50 yards rushing in a game besides one\" said Richlands head coach Greg Mance. \"Yeah we are very pleased and fortunante to be 5 and o, very happy with that\" said Bluefield head coach Fred Simon.Both Coach Mance and Coach Simon think this is the time where they really are fi... More >> Bluefield, WVWVVA-TVFor Richlands and Bluefield. the 2015 season is off to a nice start. \"We are getting better as a football team we are playing really good defense but we haven't giving up 50 yards rushing in a game besides one\" said Richlands head coach Greg Mance. \"Yeah we are very pleased and fortunante to be 5 and o, very happy with that\" said Bluefield head coach Fred Simon.Both Coach Mance and Coach Simon think this is the time where they really are fi... More >> NASCAR driver Tony Stewart will retire at the end of the 2016 season. KANNAPOLIS, N.C. (AP) -- Tony Stewart says he will retire following the 2016 season. More >> KANNAPOLIS, N.C. (AP) -- Tony Stewart says he will retire following the 2016 season. More >> WVSSAC Football Ratings 9/29 Parkersburg, WVWVVA-TVWVSSAC Football Ratings 9.291. Cabell Midland2. Huntington3. Pt Pleasant4. Morgantown5. Capital6. Jefferson7. George Washington8. Martinsburg9. Parkersburg South10. Brooke11. Wheeling Park12. Musselman13. Spring Valley14. John Marshall15. Preston16. HurricaneAA1. Fairmont Senior2. Bluefield3. Bridgeport4. Chapmanville5. James Monroe6. Keyser7. Tolisa8. Lincoln9. Roane Co10. Independence11. Mingo Central12. Liberty Raleigh13. Summers Co14. Weir15. North Marion16. N... More >> Parkersburg, WVWVVA-TVWVSSAC Football Ratings 9.291. Cabell Midland2. Huntington3. Pt Pleasant4. Morgantown5. Capital6. Jefferson7. George Washington8. Martinsburg9. Parkersburg South10. Brooke11. Wheeling Park12. Musselman13. Spring Valley14. John Marshall15. Preston16. HurricaneAA1. Fairmont Senior2. Bluefield3. Bridgeport4. Chapmanville5. James Monroe6. Keyser7. Tolisa8. Lincoln9. Roane Co10. Independence11. Mingo Central12. Liberty Raleigh13. Summers Co14. Weir15. North Marion16. N... More >> Bluefield College prepares for Reinhardt and the weather Bluefield, VAWVVA-TVIts no secret that the Bluefield College football schedule is very tough. Looking at it top to bottom and there are several of the top teams in the country dotted along it and another one of those will make their way to southern West Virginia.The weather does not look like its going to cooperate on Saturday. The Rams will host 14th ranked Reinhardt on what should be a rainy Mitchell Stadium. This will be the 4th ranked team in a row the Rams will f... More >> Bluefield, VAWVVA-TVIts no secret that the Bluefield College football schedule is very tough. Looking at it top to bottom and there are several of the top teams in the country dotted along it and another one of those will make their way to southern West Virginia.The weather does not look like its going to cooperate on Saturday. The Rams will host 14th ranked Reinhardt on what should be a rainy Mitchell Stadium. This will be the 4th ranked team in a row the Rams will f... More >> Concord prepares for critical game at Charleston Athens, WVWVVA-TVThere will be a huge game in the Mountain East Conference tomorrow night. Concord will hit the road to take on Charleston in a game that could decide who takes home the league crown.In the last 4 seasons Concord, Charleston, and Shepherd have been 1, 2 or 3 each year. These two teams are very similar in many ways. both love to run the football and both have a very aggressive defense. This matchup has produced several great games over the years. ... More >> Athens, WVWVVA-TVThere will be a huge game in the Mountain East Conference tomorrow night. Concord will hit the road to take on Charleston in a game that could decide who takes home the league crown.In the last 4 seasons Concord, Charleston, and Shepherd have been 1, 2 or 3 each year. These two teams are very similar in many ways. both love to run the football and both have a very aggressive defense. This matchup has produced several great games over the years. ... More >> Marshall's Johnson Questionable for Saturday Huntington, WVWVVA-TVMarshall RB Devon Johnson is listed as day to day for the Herd's C-USA home opener against Old Dominion on Saturday. It was reported that Johnson had a fractured disc in his back, but head coach Doc Holliday denied those reports on Tuesday. Johnson has 390 yards and 3 touchdowns during 4 games this season. More >> Huntington, WVWVVA-TVMarshall RB Devon Johnson is listed as day to day for the Herd's C-USA home opener against Old Dominion on Saturday. It was reported that Johnson had a fractured disc in his back, but head coach Doc Holliday denied those reports on Tuesday. Johnson has 390 yards and 3 touchdowns during 4 games this season. More >> Hokies to lose Fuller for the season Blacksburg, VAWVVA-TVVirginia CB Kendall Fuller will be out for the rest of the season after undergoing surgery on his right knee of Tuesday. Fuller tore his meniscus in preseason camp and tried to play on it for the first 3 games. Fuller was named to several watch lists during the preseason. Fuller had just 7 tackles, 1 sack, and 1 forced fumble so far in 2015. More >> Blacksburg, VAWVVA-TVVirginia CB Kendall Fuller will be out for the rest of the season after undergoing surgery on his right knee of Tuesday. Fuller tore his meniscus in preseason camp and tried to play on it for the first 3 games. Fuller was named to several watch lists during the preseason. Fuller had just 7 tackles, 1 sack, and 1 forced fumble so far in 2015. More >> New Orleans Pelicans come to The Greenbrier White Sulphur Springs, WVWVVA-TVToday was the first of 5 days the Pelicans will be spending at America's resort. This morning was their first workout in the tennis center. Anthony Davis led his team in the first of 8 workouts that will happen. The pelicans went 45-27 in the 2014-15 season before being swept by the eventual champions in the Golden State Warriors.\"It's different. My first time in West Virginia ever and i wasn't expecting it to look like Santa... More >> White Sulphur Springs, WVWVVA-TVToday was the first of 5 days the Pelicans will be spending at America's resort. This morning was their first workout in the tennis center. Anthony Davis led his team in the first of 8 workouts that will happen. The pelicans went 45-27 in the 2014-15 season before being swept by the eventual champions in the Golden State Warriors.\"It's different. My first time in West Virginia ever and i wasn't expecting it to look like Santa... More >> Princeton and Liberty to play pivotal game on Friday Glen Daniel, WVWVVA-TVBoth Liberty and Princeton will come into Friday's contest on fire, and neither wants that flame to burn out. \"Its all about momentum and you start thinking you can win and we should by into the program then\" said Liberty head coach Jeff Alexander. \"We ended up 1-2 and now we are on a little bit of a roll because we are focused and we are doing things the right way. I think that's what's happening to us\" said Princeton head coach We... More >> Glen Daniel, WVWVVA-TVBoth Liberty and Princeton will come into Friday's contest on fire, and neither wants that flame to burn out. \"Its all about momentum and you start thinking you can win and we should by into the program then\" said Liberty head coach Jeff Alexander. \"We ended up 1-2 and now we are on a little bit of a roll because we are focused and we are doing things the right way. I think that's what's happening to us\" said Princeton head coach We... More >> All content © Copyright 2000 - 2015 WorldNow and WVVA. All Rights Reserved. For more information on this site, please read our Privacy Policy , Terms of Service and Mobile Privacy Policy & Terms of Service . Persons with disabilities who need assistance with issues relating to the content of this station's public inspection file should contact Administrative Assistant Audrey Sluss at (304) 324-0659. Questions or concerns relating to the accessibility of the FCC's online public file system should be directed to the FCC at 888-225-5322, at 888-835-5322 (TTY) or at fccinfo@fcc.gov .", "external_links": [], "published": "2015-10-02T06:56:00.000+03:00", "crawled": "2015-10-02T09:17:50.783+03:00", "highlightTitle": ""}