{"organizations": [], "uuid": "e7b95862f4e93094a6f8e832dd4809cd1d4d8155", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sltrib.com", "main_image": "http://www.sltrib.com/csp/mediapool/sites/dt.common.streams.StreamServer.cls?STREAMOID=kEyT0KIrbnI5eiJpQhtyBM$daE2N3K4ZzOUsqbU5sYtxAdR_ghnP8YmX7plTaemQWCsjLu883Ygn4B49Lvm9bPe2QeMKQdVeZmXF$9l$4uCZ8QDXhaHEp3rvzXRJFdy0KqPHLoMevcTLo3h8xh70Y6N_U_CryOsw6FTOdKL_jpQ-&CONTENTTYPE=image/jpeg", "site_section": "http://sltrib.com//csp/cms/sites/sltrib/RSS/rss.csp?cat=Sports", "section_title": "Sports - The Salt Lake Tribune", "url": "http://www.sltrib.com/sports/3020385-155/college-football-defense-special-teams-carry", "country": "US", "title": "College football: Defense, special teams carry Southern Utah over Weber State, 44-0", "performance_score": 0, "site": "sltrib.com", "participants_count": 1, "title_full": "College football: Defense, special teams carry Southern Utah over Weber State, 44-0 | The Salt Lake Tribune", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "e7b95862f4e93094a6f8e832dd4809cd1d4d8155"}, "author": "STEVE LUHM", "url": "http://www.sltrib.com/sports/3020385-155/college-football-defense-special-teams-carry", "ord_in_thread": 0, "title": "College football: Defense, special teams carry Southern Utah over Weber State, 44-0", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ogden • It was expected to be early-season showdown in the Big Sky Conference.\nIt turned into a show of force by Southern Utah's defense.\nThe Thunderbirds forced six Weber State turnovers Friday night, helping SUU cruise to a 44-0 victory over the Wildcats at stunned Stewart Stadium.\nSouthern Utah returned two interceptions for touchdowns, ran a punt back for another score and improved its record to 3-2 overall and 2-0 in the Big Sky.\nWeber, which gained only 98 yards in the second half, slipped to 2-3 and 1-1.\n\"The turnovers led to the shutout,\" said Thunderbird coach Ed Lamb. \"… It was a great 60 minutes of football by the defense. Very opportunistic.\"\n  Did Southern Utah make a statement to the rest of the conference by blanking the Wildcats?\n\"Oh, I don't know,\" Lamb said. \"My gut feeling is people don't think Weber is as good as they are. Weber has a really good football team. They're doing a great job building the program from the ground level. … I hope, at the end of the season, people will look back and say, 'Weber was a good football team and Southern Utah handled them pretty well — that night, at least.' \"\nSouthern Utah took a 17-0 halftime lead without scoring an offensive touchdown.\nWith 1:30 left in the first quarter, Naia Ursua returned a punt 68 yards for a score. The play was reminiscent of a trick return used by the University of Utah in last week's 62-20 win at Oregon.\nUrsua was all alone when he fielded the ball in front of the Weber State bench because Southern Utah's other returner, Brady Measom, acted like the punt was coming to him in the middle of the field. Weber State's coverage team reacted to Measom's fake and Ursua had little difficulty getting to the end zone.\n\"What was going through my head,\" Ursua said, \"was don't get caught and secure the ball.\"\nThe Thunderbirds made it 14-0 with 7:44 left in the half.\nAfter a drive to midfield stopped by the Wildcat defense, Southern Utah punter Tate Lewis pinned Weber State back at its own 7-yard line. \nOn the first play, freshman quarterback Justin Shaw threw into coverage along the sideline. Thunderbird cornerback LaShaun Sims intercepted the pass and returned it 26 yards for a touchdown.\nSouthern Utah added to its lead in the final play of the first half, after kicker Keita Calhoun capped a drive in the final 47 seconds by drilling a 33-yard field goal as time expired.\nAt halftime, Southern Utah owned a modest 168-133 advantage in total yards. Lewis helped the Thunderbirds control field position, however, by averaging 49.2 yards on five punts. His 81-yarder in the second quarter is the second-longest in school history.\nWeber State received the second half kickoff, but the Wildcats managed only one first down before being forced to punt for the sixth time.", "external_links": [], "published": "2015-10-02T03:00:00.000+03:00", "crawled": "2015-10-03T16:55:57.717+03:00", "highlightTitle": ""}