{"organizations": [], "uuid": "5566bb39e00c17b0ffac696189f64ec9f854b3a6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "http://images.tribuneindia.com/cms/gall_content/2015/10/2015_10$largeimg12_Monday_2015_232334147.jpg", "site_section": "http://www.tribuneindia.com/", "section_title": "The Tribune, Chandigarh, India : Latest news, India, Punjab, Chandigarh, Haryana, Himachal, Uttarakhand, J&amp;K, sports, cricket ", "url": "http://www.tribuneindia.com/news/uttarakhand/traffic-to-be-streamlined-ahead-of-festive-season/145156.html", "country": "US", "title": "Traffic to be streamlined ahead of festive season", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "Traffic to be streamlined ahead of festive season", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "5566bb39e00c17b0ffac696189f64ec9f854b3a6"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/uttarakhand/traffic-to-be-streamlined-ahead-of-festive-season/145156.html", "ord_in_thread": 0, "title": "Traffic to be streamlined ahead of festive season", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tribune News Service\nDehradun, October 12\nThe city police have imposed an elaborate traffic management plan considering festive season in the city. The police removed encroachments in the Paltan Bazaar and other parts of the city. The parking of two wheelers and four wheelers were strictly restricted between Ashley Hall and Clock Tower today. The new traffic plan faced the wrath of residents as they were forced to complete long distance to reach to the city main bazaar, Paltan bazaar. The city police put a restriction of two wheelers entering into the Paltan Bazaar. The barricades were placed at all entry points to the Paltan Bazaar. The police laid special focus to decongest traffic jams at and around inter-crossings in the city. Speaking to The Tribune, SSP Dehradun, Sadanand Datte said the new traffic management was imposed considering festive season in the city. He said instructions were given to SHOs and police posts in charge to deploy additional force to overcome traffic congestion on arterial roads in the city. Datte said the traffic police were instructed to heavily challan traffic offenders to streamline traffic in the city. He said the department would hold meeting with the civic administration to put up signboards, and signals to streamline traffic in the city. The problem of traffic jams on the Rajpur road, Survey Chowk, Dharampur, Saharanpur Chowk, Prince Chowk, Railway road, Araghar, ISBT crossing and Ashley Hall Chowk has become a perennial problem and it increases manifold during the festive season. Plans to redevelop congested Indira Market The Department of Urban Development is planning to redevelop the congested Indira Market on the lines of the Chakrata road market redevelopment plan. The market adjacent to the new MDDA shopping complex at the Clock Tower comprises of more than 50 odd temporary kiosks occupied by vendors selling clothes, shoes, mobile phone covers and other utility items at cheap rates. The department plans to build a multi-storied building with two-level basement parking. “We have already carried a survey for eliciting views about shifting shopkeepers from the market to the shopping complex. Around 95 per cent of the shopkeepers have agreed. We will be able to legalise freehold land for the benefit of shopkeepers,” said DS Garbyal, secretary, Department of Urban Development.", "external_links": [], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-13T04:05:47.090+03:00", "highlightTitle": ""}