{"organizations": [], "uuid": "b1a404e3427fb80fe32102d8fa95de911898529d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "", "site_section": "http://bostonherald.com/sports", "section_title": "Sports | Boston Herald", "url": "http://bostonherald.com/sports/high_school/2015/10/wayland_looks_ripe_for_repeat", "country": "US", "title": "Wayland looks ripe for repeat", "performance_score": 0, "site": "bostonherald.com", "participants_count": 1, "title_full": "Wayland looks ripe for repeat | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T13:45:00.000+02:00", "replies_count": 0, "uuid": "b1a404e3427fb80fe32102d8fa95de911898529d"}, "author": "Sean Brennan", "url": "http://bostonherald.com/sports/high_school/2015/10/wayland_looks_ripe_for_repeat", "ord_in_thread": 0, "title": "Wayland looks ripe for repeat", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Wayland looks ripe for repeat Sean Brennan Sunday, October 25, 2015 comments Tweet It is almost that time of year when the Wayland boys team really begins to make headlines.\nA year removed from winning the Division 3 state championship with a 1-0 overtime victory against Belchertown, the Warriors are lined up for another crack at immortality after having started the fall with an impressive 9-2-3 record, while playing the majority of their games in the ultra-competitive Dual County League.\nBut looking back is off the table. What happens moving forward the rest of the season will be a brand new story.\n“There are many players returning from last year’s state champs and they’ve really done a good job of integrating the new players into our team,” Wayland coach Dave Gavron said. “Ultimately, the biggest goal is to get back and have an opportunity to defend our championship, but the boys are especially focused on what is going on right at that moment. As (team captain) Daniel Keating says, ‘If we take care of what we need to right now the big picture will take care of itself.’ ”\nWayland’s strength lies in its defense. Led by the return of Keating and fellow senior captain Jamie Carver, as well as the improved play of junior Cam Gordon, and a solid first-year performance from junior goalkeeper Curran Murphy, the Warriors are tough to score against. Offensively, senior captain and midfielder Daniel D’Amico leads the way with balanced contributions from sophomores Michael Jones, Marco Melero and Joe Lyons, as well as senior Ethan Stavisky.\n“The boys know that last year is last year and we are only as good as the game we are about to play,” Gavron said. “It has really been a great season to watch the development of the young guys under the leadership of those guys who have already been to the championship.”\nA winning culture is embedded at Wayland. Playing for the school and the community is as important to the players as wins and losses, and the results speak for themselves.\n“We have to always work hard and be as prepared as possible in order to compete because there is no league in the state as competitive as the DCL,” Gavron said. “But what makes us successful is that there are young men willing to put something or someone else before them. That’s the key to all of our success and the fact that I can count on the boys putting others before themselves is really why we are as successful as we’ve been the last couple of years.”\nRaiders’ work pays\nThere may not be a program more suited to its community than the North Quincy girls team.\nBuilt on the characteristics of playing hard and being hard to play against, the Red Raiders last week qualified for the state tournament for the 16th time in 21 years under the guidance of coach Paul Bregoli, and enter the final stretch of the regular season with a 9-3-3 record and an outside chance at winning the Patriot League Fisher Division title.\n“These kids certainly have the talent and they are having a phenomenal year,” Bregoli said of this year’s team, which features 11 seniors. “There are no easy teams in the Patriot League with Whitman-Hanson , Hingham , Duxbury and Silver Lake , among others.”\nLed defensively by Molly Kate Cannon and Julia O’Donnell, North Quincy has allowed just six goals in 15 games, while junior goalkeeper Shannan Kennedy has already broken the school record for career shutouts with 24.\n“Our defense is clearly the backbone of this team,” Bregoli said.\nSenior midfielder Merissa McGue paces an offense that has also received production from senior Hailey Houlihan and junior Sinead Hanley, but as it has been for more than two decades, North Quincy continues to play a brand of soccer that is both blue-collar and workmanlike.\n“There is only one game that we’ve given up more than two goals,” Bregoli said, pointing to the Silver Lake game. “John Calipari said if you work hard good things happen, and I think we earn everything that we get. Our kids play hard and I don’t think anybody likes playing us because we do battle. We try and outwork other teams. It is all about our intensity and Quincy is a blue-collar community, so that is how we have to play.”\nVlachos passes 100\nCongratulations are in order for East Bridgewater junior Mackenzie Vlachos. Through 14 games, the Syracuse University recruit had posted 24 goals and nine assists for 33 points, giving her a career total and counting of 74 goals and 108 points.", "external_links": ["http://player.mediabong.net/se/56.js?url=", "https://twitter.com/share?text=Wayland+looks+ripe+for+repeat"], "published": "2015-10-25T13:45:00.000+02:00", "crawled": "2015-10-25T12:24:37.072+02:00", "highlightTitle": ""}