{"organizations": [], "uuid": "5c9916ea4285b327d27d6d8c83263f85e52b22c8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "cherokeetribune.com", "main_image": "http://cherokeetribune.com/images/article.jpg", "site_section": "http://cherokeetribune.com/rss/rss/Sports?instance=Sports&content_type=article&tags=sports&tag_inclusion=or&offset=0&limit=10&page_name=rss", "section_title": "Sports", "url": "http://cherokeetribune.com/bookmark/26902979", "country": "US", "title": "Week 8 largely a positive for county", "performance_score": 0, "site": "cherokeetribune.com", "participants_count": 1, "title_full": "Week 8 largely a positive for county", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T08:45:00.000+03:00", "replies_count": 0, "uuid": "5c9916ea4285b327d27d6d8c83263f85e52b22c8"}, "author": "Alex Resnak aresnak@cherokeetribune.com (noreply@cherokeetribune.com)", "url": "http://cherokeetribune.com/bookmark/26902979", "ord_in_thread": 0, "title": "Week 8 largely a positive for county", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Week 8 largely a positive for county by Alex Resnak October 11, 2015 12:45 AM | 422 views | 0 | 2 | | Week 8 was good to Cherokee County teams, as four of the five teams in action came away with wins. Cherokee, the only team to lose, fell to county rival Woodstock 37-22, while Creekview, Etowah and Sequoyah beat out-of-county opponents.The team that needed the win the most was Sequoyah, and the Chiefs rose to the occasion in a 24-3 win over Region 7 (A) rival Cass.“It was a big win for a lot of reasons,” Sequoyah coach James Teter said. “First of all, it keeps us in the race in the region, but I think it was really big mentally for us, too.”Leading 7-0 at halftime, Sequoyah (2-4, 2-1) played a sound second half to outscore Cass 17-3 after the break. That surge was led by a defense that held the Colonels to 41 rushing yards and forced 19 incompletions and an interception.Teter said what impressed him most was his team’s execution coming off a bye week.“We played mistake-free football,” he said. “We didn’t have any turnovers or any missed assignments on special teams. Those are things that have been plaguing us all season, but we played a clean game Friday night. The bye week helped us step back, look at some of our mistakes, and fix those.”Also picking up a key win in Region 7 (A) was Creekview, which beat Woodland 42-17 to stay atop the subregion standings.“It was a huge win for us,” Creekview coach Terry Crowder said. “I think Woodland is a lot better than most people think. We had to go down there and play well, and I think we did. It was big for us.” The Grizzlies (4-3, 3-1) rode quarterback Kyle Wilkie’s 420 passing yards to bounce back from a loss to Dalton. The senior threw for three touchdowns and ran for two more in the game, in which the Grizzlies only rushed for 51 yards.“It’s not so much that the run wasn’t working as much as we saw some things we thought we could take advantage of in the passing game,” Crowder said. “Kyle is a special guy and, when he and is receivers are on, we can be really hard to stop.” Brian Davis and Trevor Kolb both had big games, with 363 receiving yards between them. The defense also played well, holding Woodland’s option attack to just 104 yards on the ground.In Region 5 , Etowah stayed a game back of region-leading Roswell with a 38-20 defeat of defending region champion Milton.A 31-yard Cameron Allen field goal at the end of the first half gave Etowah (6-1, 4-1) a 17-14 lead at the break, but a strong running attack and efficient quarterback play propelled the Eagles to a 21-6 advantage in the second half.Tyray Devezin led the way with 19 carries for 129 yards, but it was the balance in the passing game that was most impressive. Patrick Ferris completed 12 of 14 passes for 210 yards and touchdown passes to Jackson Sisk, Blake Jones and Bronson Rechsteiner.In perhaps the most surprising win of the week, Woodstock bounced back from a close loss to Lassiter to upset Cherokee 37-22. The game was not that close for most of the night though, as the Wolverines led 30-0 at one point in the fourth quarter.Woodstock (4-3, 2-3) was led by Liam Byrne, who was 24-of-33 for 340 yards and three touchdowns. Ethan Chamberlin caught seven passes for 100 yards and two scores, while Louis Hall caught five passes for 97 yards and a touchdown.The Wolverines’ defense played just as well as the offense, holding Brittain Brown to a season-low 61 yards on 15 carries, blocking a punt and returning an interception for a touchdown.All six county teams will be back in Week 9. Cherokee (4-2, 2-2) and Etowah will be back at home, hosting Milton and Lassiter, respectively. Woodstock will travel to Walton.River Ridge (0-6, 0-3) will resume play in Region 7 (A) as Dalton comes to town, while Sequoyah will host Creekview in the teams’ annual rivalry game. Share This Article | similar stories", "external_links": [], "published": "2015-10-11T08:45:00.000+03:00", "crawled": "2015-10-11T20:20:19.126+03:00", "highlightTitle": ""}