{"organizations": [], "uuid": "7610d801ac756cf2fb17a84c024bf21385d93b0f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dallasnews.com", "main_image": "http://www.dallasnews.com/incoming/20151008-1444331685-mark-crouser.jpg.ece/BINARY/original/1444331685-Mark-Crouser.JPG", "site_section": "http://www.dallasnews.com/sports/more-sports/running/", "section_title": "Dallas-Fort Worth Running News - Sports News for Dallas, Texas ", "url": "http://www.dallasnews.com/sports/more-sports/running/headlines/20151008-north-texas-ironman-world-championship-participants-the-executives.ece", "country": "US", "title": "North Texas' Ironman World Championship Participants: The Executives", "performance_score": 0, "site": "dallasnews.com", "participants_count": 1, "title_full": "North Texas' Ironman World Championship Participants: The Executives | Dallas Morning News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T02:00:00.000+03:00", "replies_count": 0, "uuid": "7610d801ac756cf2fb17a84c024bf21385d93b0f"}, "author": "Debbie Fetterman", "url": "http://www.dallasnews.com/sports/more-sports/running/headlines/20151008-north-texas-ironman-world-championship-participants-the-executives.ece", "ord_in_thread": 0, "title": "North Texas' Ironman World Championship Participants: The Executives", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Mark Crouser, the vice president of finance for Balfour Beatty Construction, and Wyman Roberts, Brinker International CEO and president, qualified for Saturday's Ironman World Championship by racing against other corporate executives at designated Ironman Executive Challenge races.\nFor Crouser, 50, of Colleyville, secured his Kona slot at Ironman Florida, where the swim was cancelled due to low temperatures and high winds. Those cool temps enabled Crouser to complete the marathon in a personal best time of 3 hours, 59 minutes, which helped him earn his Kona slot.\nHe said Kona is the culmination of four years of going from âœinterested to fully invested in a sport that has transformed my life.â\nEndurance races have presented him with challenges, expected and unexpected, that have tested his limits, physically and mentally.\nâœWhat many call 'dark moment' descend on triathletes on the bike and/or run that create an overwhelming temptation either to slow down or downright stop as the pain sets in and feels like it will never end,\" Crouser explained in an e-mail. âœPushing past that moment and finding more in my tank to continue is a moment of both self-discovery and success that I havenâ™t found anywhere else in life.â\nRoberts, 56, of Colleyville qualified for his second Kona appearance at Ironman Arizona in 2014. He finished the 2013 Ironman World Championships in 11 hours, 19 minutes.\n\"There's nothing like Kona, the environment, the atmosphere, the quality of athletes, excluding myself, is impressive,\" said Roberts, 56, who grew up in Hawaii. \"It's surreal to compete on that course (with the pros). It all comes together for me in a special way.\"\nRoberts was introduced to triathlon by his trainer, Harold Wilson, when he moved to Dallas. One of his first triathlon experiences was a training camp led by seven-time Ironman champion Chris McDonald, aka Big Sexy.\nRoberts is now a member of Team Big Sexy Racing .\nHe says his swims are terrible, so his mission is to \"get through the swim, then after I get out of the water, to have a great experience.\"\nOn Twitter:\n @DFWRunning", "external_links": ["https://twitter.com/DFWRunning", "http://www.chris-mcdonald.net/team-bsr-2015-applications-are-open-join-the-fun"], "published": "2015-10-09T02:00:00.000+03:00", "crawled": "2015-10-24T03:47:44.232+03:00", "highlightTitle": ""}