{"organizations": [], "uuid": "a3e1bd9e7029d78fa663e641a842473ccbd5adfc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/", "section_title": "Ahram Online - News, Business, Culture, Sports &amp; Multimedia from Egypt ", "url": "http://english.ahram.org.eg/NewsContent/6/55/161091/Sports/World/Van-Gaal-says-Manchester-United-should-behave-like.aspx", "country": "EG", "title": "Van Gaal says Manchester United should 'behave like champions' - World - Sports", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "Van Gaal says Manchester United should 'behave like champions' - World - Sports - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "a3e1bd9e7029d78fa663e641a842473ccbd5adfc"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/6/55/161091/Sports/World/Van-Gaal-says-Manchester-United-should-behave-like.aspx", "ord_in_thread": 0, "title": "Van Gaal says Manchester United should 'behave like champions' - World - Sports", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related PHOTO GALLERY: Arsenal beat Manchester United, Real Madrid draw in derby, Roma win in Italy Match facts: Arsenal v Manchester United (English Premier League) Manchester United manager Louis van Gaal has warned his players a repeat of their display against Arsenal will be unacceptable if they want to be Premier League title challengers.\nUnited suffered a 3-0 defeat to Arsenal at the Emirates Stadium last time out as they were blown away in the first 20 minutes of the game by two goals from Alexis Sanchez and one from Mesut Ozil.\nThe Red Devils return to action after the international break on Saturday with a clash against Everton at Goodison Park.\nVan Gaal admitted it has been a difficult fortnight for him following such a disappointing result and has demanded his players start acting like a team near the top of the table.\n\"It has been an awful two weeks,\" said the Dutchman,\n\"Before the last international break in September we lost against Swansea, these are awful weeks. You are constantly thinking about how it happened.\n\"We are always evaluating ourselves and we cannot accept that. Not I cannot accept it, we cannot. Not only my members of staff but also the players cannot accept it.\n\"We cannot accept it from each other. We want to be the champion, then you have to behave like a champion.\n\"Also to improve yourself, to be, in the future, the champion. You have to improve every time. That is what I am saying.\"\nUnited captain Wayne Rooney will be available to face former club Everton having recovered from an ankle injury.\nRooney missed England's Euro 2016 qualifiers against Estonia and Lithuania but has resumed training and Van Gaal confirmed he will feature \"if I select him\".\nPaddy McNair is absent with an abdominal injury while Ashley Young is also struggling with a calf problem.\nMarcos Rojo (hamstring) is doubtful while Luke Shaw is a long-term absentee with a broken leg.\nVan Gaal revealed that because a number of his players have been away on international duty it has been hard to recover from the hangover of their defeat Arsenal for their game against Everton.\n“You cannot manage it with your players, that is what you have to do as a manager, but all the players are flying out,” Van Gaal added.\n“They fly out direct after the match. Then the players come back Wednesday and also yesterday, when Romero and Valencia came, after the training session\n“They could not participate in our meetings before the game against Everton. It is difficult for me. Then I have to speak about the Arsenal game because you have to analyse.\n“You have to learn from it and improve. I have to evaluate myself how I have prepared this game with my players.\n“We have spoken about that. It cannot happen again. That is important but it is also difficult.”\nVan Gaal also acknowledged he will have to lift the spirits of compatriots Daley Blind and Memphis Depay after their failure to qualify for the European Championships with the Netherlands.\n“You know that I have a philosophy and the main aspect of that philosophy is the total human being principle so I have to see how they come from that defeat of course,” said Van Gaal, who left as Netherlands coach to take over at Old Trafford following the 2014 World Cup.\n\"I have to see that in the few days that I have but I have to make a decision, it's not easy.\n\"What can I say about the Netherlands? It's disappointing, of course, but I can't judge. A lot of people can judge over 2,000 miles, I cannot judge.\n\"I don't have the experience. I don’t see the training sessions, I don't see the preparation. I don't see all the players that my colleague can select, so I don't have any opinion.\"", "external_links": [], "published": "2015-10-16T03:00:00.000+03:00", "crawled": "2015-10-16T21:11:59.342+03:00", "highlightTitle": ""}