{"organizations": [], "uuid": "b3130c8c05feb83c4edfe3eeef05502e0f4ba13a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/49223805.cms", "site_section": "http://timesofindia.indiatimes.com/rssfeeds/4720867.cms", "section_title": "Top Stories - Golf - Sports - The Times of India", "url": "http://timesofindia.indiatimes.com/sports/golf/top-stories/Anirban-Lahiri-aims-for-Malaysian-double-at-CIMB-Classic/articleshow/49223792.cms", "country": "IL", "title": "Anirban Lahiri aims for Malaysian double at CIMB Classic", "performance_score": 0, "site": "indiatimes.com", "participants_count": 1, "title_full": "Anirban Lahiri aims for Malaysian double at CIMB Classic - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T14:02:00.000+03:00", "replies_count": 0, "uuid": "b3130c8c05feb83c4edfe3eeef05502e0f4ba13a"}, "author": "timesofindia.indiatimes.com", "url": "http://timesofindia.indiatimes.com/sports/golf/top-stories/Anirban-Lahiri-aims-for-Malaysian-double-at-CIMB-Classic/articleshow/49223792.cms", "ord_in_thread": 0, "title": "Anirban Lahiri aims for Malaysian double at CIMB Classic", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "KUALA LUMPUR: Current Asian Tour number one Anirban Lahiri will be aiming to clinch a magical Malaysian double when he tees up at the USD 7 million CIMB Classic later this month.\n\nThe 28-year-old Indian star is enjoying the season of his life where he has claimed two victories, enjoyed a career high tied fifth place finish in a Major and earned a debut appearance at the Presidents Cup.\n\nBut Lahiri is certainly not finished yet with his stellar 2015 campaign and hopes a return to Kuala Lumpur Golf and Country Club's West course from October 29 to November 1 will see him standing victorious again on the 18th green, as was the scene during the Malaysian Open in February.\n\nA strong outing at the CIMB Classic, which is sanctioned by the Asian Tour and PGA TOUR, will also all but clinch him a first Asian Tour Order of Merit crown where he currently holds a commanding lead of over US$548,000 from Australian Andrew Dodt.\n\n\"It's probably going to be one of the most important events of the year for me,\" said Lahiri, who is ranked 40th in the world and has finished third and second on the Asian Tour rankings in the past two seasons.\n\n\"Going to back to Malaysia for the CIMB Classic will be great especially after what happened at the Malaysian Open. It'll be an opportunity for me to challenge again. I remember I didn't score well in the first two rounds and then I shot a third round 62 which stood out and put me right back in the hunt. I played really solid on the back nine on Sunday and making the putt on 17 (for birdie and the lead) was a magic moment.\"\n\nWith the CIMB Classic returning for a sixth edition next month, Lahiri hopes to capitalise on the opportunity to trump the stars from the PGA Tour.\n\nTwo months ago, the Indian enjoyed a standout performance at the PGA Championship, the year's final Major, which he said has given him an added dose of confidence in his quest to win a PGA TOUR-sanctioned tournament.\n\n\"Coming in joint fifth at the PGA Championship, it's been fantastic. There was so much that I took away from the week. The confidence and self-belief that I gained and earning the respect of the best players in the world ... that's not easily done,\" said Lahiri, who has seven wins on the Asian Tour.\n\n\"When you can do that, you want to snowball it and play better consistently. That's going to be my next effort. You have work on the game and maintain the high level of play. You're not scared.\"\n\nHe believes the 10 Asian Tour players who will feature in the CIMB Classic, the only PGA TOUR and Asian Tour sanctioned event in Southeast Asia, will have every opportunity to challenge for the title at the West course.\n\n\"It's a great opportunity for all of us and you're exposed to a different level of golf. Cameron Smith did great by finishing fifth last year while Prom Meesawat and Angelo Que also had top-10 finishes. It was a great sign and fantastic for us to see. They matched the PGA TOUR players shot for shot. We have the talent and ability in Asia. We don't get overwhelmed anymore,\" said Lahiri.  ", "external_links": [], "published": "2015-10-05T14:02:00.000+03:00", "crawled": "2015-10-05T13:52:09.951+03:00", "highlightTitle": ""}