{"organizations": [], "uuid": "428ea2a08b8d5ec7b51bcbd00c36ef7b9389a353", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theepochtimes.com", "main_image": "http://www.theepochtimes.com/n3/eet-content/uploads/2015/10/26/DSC_8428r-674x449.jpg", "site_section": "http://www.theepochtimes.com/n3/c/sports/feed/", "section_title": "The Epoch Times » Sports", "url": "http://www.theepochtimes.com/n3/1885079-rose-edges-bjerregaard-in-battle-for-ubs-hong-kong-open-crown/", "country": "US", "title": "Rose Edges Bjerregaard in Battle for UBS Hong Kong Open Crown", "performance_score": 0, "site": "theepochtimes.com", "participants_count": 1, "title_full": "Rose Edges Bjerregaard in Battle for UBS Hong Kong Open Crown", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T07:09:00.000+02:00", "replies_count": 0, "uuid": "428ea2a08b8d5ec7b51bcbd00c36ef7b9389a353"}, "author": "Eddie So", "url": "http://www.theepochtimes.com/n3/1885079-rose-edges-bjerregaard-in-battle-for-ubs-hong-kong-open-crown/", "ord_in_thread": 0, "title": "Rose Edges Bjerregaard in Battle for UBS Hong Kong Open Crown", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Rose Edges Bjerregaard in Battle for UBS Hong Kong Open Crown UBS Hong Kong Open 2015—Day-4 By Eddie So | October 26,   26, 2015 1:39 am < > \nJustin Rose of England holding the trophy after winning the UBS Hong Kong Open 2015 at Fanling on Sunday Oct 25, 2015. (Eddie So) \nHONG KONG—Starting the final round 4-shots clear of the rest of the field, the tit for tat battle between Justin Rose and Lucas Bjerregaard of Denmark continued on Sunday Oct 25 as they fought to win the UBS Hong Kong Open at Fanling. A tight neck and neck contest with both players jockeying for the lead, underdog Dane Bjerregaard was well in contention, often in the lead position and it was not clear until late in the round which player was likely to win, bringing huge gallery attention to the duelling. \nBjerregaard proved a worthy adversary but it was a double bogey on the 14th hole that was the deciding factor. Even after that slip by Bjerregaard, Englishman Rose only just had his nose in front and it wasn’t until he birdied the 16th hole did he gain breathing space to be confident of taking his first UBS Hong Kong Open title at Fanling. \nThe Dane’s tee shot on the 14th hole ended in trees, his 2nd shot struck a branch and although he hit the green with his 3rd shot, he 3-putted losing two strokes on the par-4 allowing Rose to take a one shot lead. \nBoth took par on the 15th hole but Rose birdied the 16th to give him a 2-shot cushion going down the last 2-holes. Although Rose 3-putted the tricky18th green he won by 1-stroke, carding 68 for the day and a total of 263, 17 under par for the tournament. \nRose’s Sunday victory is likely to see him climb from his current No.7 world ranking to a possible No.5 delighting him ahead of the season ending Road to Dubai encounter. \nAt the presentation ceremony Rose praised his opponent and main rival for the final two rounds of the tournament. \n“Lucas played incredible golf. It was the first time I had the chance to play with him, was thoroughly impressed, not just his game but with his temperament and how he is as a person. When you separate yourself from the field like we did, it’s probably a tough one for him to lose. But he didn’t lose it; just both of us played incredibly well and separated from the field,” he said. \nWinning at Fanling he is hoping to make a return trip here to defend his title. \n“For sure!” he said about returning for a title defense. “Fanling has a lot of history, you just look at the names (past winners) on the trophy. It’s a fantastic tournament and depending on the event’s dates (yet to be confirmed) Rose would try and confirm his appearance here,” he said. \nHe was especially delighted with the crowd, with the weather helping with no rain, a lot of sunshine with organisers claiming more than over 40,000 spectators over the four days with estimates on today’s crowd average seemly to surpass the daily attendance of 10,000. \n“It was a good crowd (today) and a good tournament and players tend to feed off that kind of energy,” Rose said. “We were the group for the fans to watch and they truly enjoyed it.” \nBjerregaard was just as adamant that he enjoyed his day despite coming out on the losing end to Rose. \n“It was fun to battle with Justin these last two days. Its guys like him that I want to go out and compete against, and at least I gave him a little bit of a scare. Early on today, that double-bogey on 14 really cost me. Got a lucky break there on 13 and made birdie, which was nice,” he said. \n“And then just, yeah, that double-bogey on 14 really ruined it for me. But all in all, happy the way I’ve played. Happy how I played this weekend, especially, since the last time I was out in the final group on a Sunday, I shot 89. So 20 shots better today, I’ll take that,” he said. \nEven when he trailed Rose by two strokes he knew he was still up in title contention with some superb golfing. \n“Yeah, I was aware of, (being two strokes behind Rose) I think we were both in our little bubble going head-to- head. I didn’t really look much at the leader-boards, but I knew exactly where he was, and yeah, I missed a short putt there on 8th and we [both] got to, I think it was minus 16,” said the Dane. \n“Then I hit a great shot into 9th, probably the best shot I’ve hit all week. I made a great birdie there and then unfortunately I had a 3-putt on the 11th. But got two ahead, and yeah, of course I’m not thrilled with the way I played on the back nine. Had a couple of loose shots, but all in all, I’m happy with the way I’ve handled myself this week,” said Bjerregaard. \nWhile all the attention was centred on the leading pair, England’s Matthew Fitzerpatrick did well to end the day 1-under par and the tournament at11 under but his score over the past three days was not good enough for him to mount a strong challenge. \n“Yeah! definitely. I got off to a fairly decent start. I was hitting it fairly nice to start with and hit a bad one on 7 and then just went on a stretch where I didn’t really hit it that great and never really gave myself chances but picked up a birdie—picked up one birdie on 11 and had a chance on 10, as well. \n“But no, just wasn’t quite there today to really get it going. But good result in the end. Still managed to get around under par,” said Fitzpatrick, whose day saw him in equal third place on 11 under par for a total score of 269. \nSouth Korean Lee Soon Min and American Patrick Reed and Australian Jason Scrivener also finished the tournament on -11. \nEddie So is a seasoned sports reporter and photographer that has worked for a number of media companies over the last 20 years.", "external_links": [], "published": "2015-10-26T07:09:00.000+02:00", "crawled": "2015-10-26T08:26:50.666+02:00", "highlightTitle": ""}