{"organizations": [], "uuid": "d004eadfddb5d2cb23100ca6239ee7b2dd9e9800", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.baltimoresun.com", "main_image": "http://www.trbimg.com/img-561dbea9/turbine/la-sp-ucla-football-20151014", "site_section": "http://feeds.baltimoresun.com/baltimoresun/sports/college/rss2.0.xml", "section_title": "College Sports - Baltimore Sun", "url": "http://www.baltimoresun.com/sports/college/la-sp-ucla-football-20151014-story.html", "country": "US", "title": "Jim Mora confident UCLA can go nose to nose with tough Stanford", "performance_score": 0, "site": "baltimoresun.com", "participants_count": 1, "title_full": "Jim Mora confident UCLA can go nose to nose with tough Stanford", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T05:32:00.000+03:00", "replies_count": 0, "uuid": "d004eadfddb5d2cb23100ca6239ee7b2dd9e9800"}, "author": "Chris Foster", "url": "http://www.baltimoresun.com/sports/college/la-sp-ucla-football-20151014-story.html", "ord_in_thread": 0, "title": "Jim Mora confident UCLA can go nose to nose with tough Stanford", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "var ssaUrl = ('https:' == document.location.protocol ? 'https://' : 'http://') + 'pixel.sitescout.com/iap/0ea84626951144d2';new Image().src = ssaUrl;\"/> College Football Jim Mora confident UCLA can go nose to nose with tough Stanford Kevin Hogan Robert Gauthier / Los Angeles Times \nStanford quarterback Kevin Hogan wiggles out of the grasp of UCLA defensive lineman Eli Ankou late in the first half of the Bruins' 31-10 loss to the Cardinal on Nov. 28. \nStanford quarterback Kevin Hogan wiggles out of the grasp of UCLA defensive lineman Eli Ankou late in the first half of the Bruins' 31-10 loss to the Cardinal on Nov. 28. (Robert Gauthier / Los Angeles Times) Chris Foster Contact Reporter \nUCLA plays Stanford in football Thursday night, so the lead-up around Westwood has been the annual probing about whether the Bruins are tough enough to match up with a Cardinal team that generally kicks sand in the face of opponents. \n\"This is a good measuring stick for our offensive line,\" UCLA tackle Caleb Benenoch said. \"Stanford is a hard-nosed football team. They wait for you to make mistakes. You know you're only going to get seven or eight drives on offense, and if you don't make them count, you're going to have problems beating them.\" \nThe macho factor has tilted Stanford's way in three of the Cardinal's last four games against UCLA. \nThe Bruins had 100 yards rushing, averaging 3.8 per carry, in a 31-10 loss last season. They had 74 yards rushing, averaging 2.7 per carry, in a 24-10 loss in 2013. In the 2012 regular-season finale, UCLA had 73 yards on the ground, averaging 2.2 per carry in a 35-17 loss. \nCoach Jim Mora expressed confidence that the Bruins can go nose to nose with the Cardinal at this point. \n\"We are more physical as a program,\" Mora said. \"We have become more equipped to deal with the bigger, more physical teams. That started after the Baylor game a few years ago, where we felt like we were physically outmatched.\" \nBaylor crushed the Bruins, 49-26, in the 2012 Holiday Bowl. \n\"We're a more physical team now,\" Mora said. \"Our guys are geared up to play well.\" \nSenior center Jake Brendel said UCLA is a different kind of physical than Stanford. \n\"They have bigger bodies, stronger bodies,\" Brendel said. \"We have more skill, more speed. We just have to exploit where we think we have the strengths and we have to make sure our strengths show on Thursday.\" \nThe flip side \nThings are equally rough when the Cardinal's offense is on the field. \n\"When you play a team like Stanford, you've got to be able to tackle,\" UCLA defensive coordinator Tom Bradley said. \"You can't miss your opportunities.\" \nThe Bruins have missed a few the last two games. The UCLA defense has gone through radical changes since losing linebacker Myles Jack, defensive tackle Eddie Vanderdoes and cornerback Fabian Moreau to season-ending injuries. \nWith Jack out, sophomore linebacker Kenny Young moved from one linebacker position to another. \"That seems like it would be an easy thing to do, switching those positions,\" Mora said. \"But it changes your reads and alignments. I think we're reorganized now and have settled in and will continue to get better.\" \nMora said that linebacker Jayon Brown and cornerback Marcus Rios would play against Stanford. Both sat out the Arizona State game Oct. 3 but practiced the past three days. \nFriend and foe \nMora has had a close relationship with Steve Sarkisian, who was fired as USC's coach Monday. \n\"He is a friend of mine,\" Mora said. \"Certainly my heart goes out to him and I wish the best for him. I care about him.\" \nWhile working for the NFL Network in 2010 and 2011, Mora lived in the Seattle area and underwent rehabilitation on an injured knee at Washington, where Sarkisian was the head coach. Mora hung around the Huskies' program, observing, during that time. \nGoines retires \nTackle Simon Goines has retired because of an undisclosed medical issue, Mora said. \nGoines started 19 games during injury-plagued 2012 and 2013 seasons. \nThis summer, the medical issue was discovered and doctors recommended that he not play. \nCardinal rules? \nA Stanford victory Thursday would give the Cardinal a Los Angeles sweep for the fifth time in the last seven seasons. Stanford defeated USC, 41-31, on Sept. 19. \nThe Cardinal swept UCLA and USC only seven times from 1959 to 2008. \nFollow Chris Foster on Twitter @cfosterlatimes", "external_links": [], "published": "2015-10-14T05:32:00.000+03:00", "crawled": "2015-10-14T19:44:39.445+03:00", "highlightTitle": ""}