{"organizations": [], "uuid": "3cd2225838f8b3e6f9b663d62a115eda64bb6a6e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "couriernews.com", "main_image": "http://matchbin-assets.s3.amazonaws.com/public/sites/2218/thumbs/HJCA_web_SPT_Arkansas_Tech_Homecoming_Court_10_10_2015.jpg", "site_section": "http://couriernews.com/rss/rss/Sports?instance=Sports&content_type=article&tags=sports_high_school+sports_collegiate+sports_professional+sports_scoreboard+sports_other&tag_inclusion=or&offset=0&limit=25&page_name=rss", "section_title": "Sports", "url": "http://couriernews.com/bookmark/26905163", "country": "US", "title": "Carter named ATU Homecoming queen", "performance_score": 0, "site": "couriernews.com", "participants_count": 1, "title_full": "Carter named ATU Homecoming queen", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T17:47:00.000+03:00", "replies_count": 0, "uuid": "3cd2225838f8b3e6f9b663d62a115eda64bb6a6e"}, "author": "ATU Athletic Communications (noreply@couriernews.com)", "url": "http://couriernews.com/bookmark/26905163", "ord_in_thread": 0, "title": "Carter named ATU Homecoming queen", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "slideshow Stephanie Carter of Van Buren was crowned Arkansas Tech University Homecoming queen 2015 during a pre-game ceremony at Thone Stadium at Buerkle Field in Russellville on Saturday, Oct. 10.Carter is a senior rehabilitation science major. She is a member of Zeta Tau Alpha, National Society of Collegiate Scholars and Greek Programming Board. Carter has served the campus community as a resident assistant, orientation leader and summer student ambassador. Her parents are Sherri and Tony Carter.Also selected for the 2015 Arkansas Tech Homecoming court were senior Toni Cody of Sulphur Springs, Texas, junior Haley Owen of Subiaco, senior Hailey Robinson of Okmulgee, Okla., and senior Bailey Taylor of Rogers.Cody is majoring in middle level education with a specialization in math and science. She is active in Collegiate Middle Level Association, CRU and intramural sports. She has served as an orientation leader. Cody’s parents are Amber and Stuart Cody.Owen is majoring in management and marketing. She is a member of the Arkansas Tech volleyball team. Her parents are Jennifer and David Owen.Robinson is majoring in sociology and communication. She is active in the African-American Student Association. She has served as an orientation leader and assisted in planning for International Women’s Week and Martin Luther King Jr. Day celebrations on campus. Robinson’s parents are Marsha and James Robinson.Taylor holds membership in Delta Zeta, Presidential Leadership Cabinet, Order of Omega and the College of Business Dean’s Leadership Class. She has served as a resident assistant. Her parents are Felicia and Jim Taylor.Arkansas Tech won its 2015 Homecoming football game, defeating nationally 20th-ranked Ouachita Baptist University 30-12 in front of a crowd of 6,976 fans.  ", "external_links": [], "published": "2015-10-13T17:47:00.000+03:00", "crawled": "2015-10-13T19:08:53.267+03:00", "highlightTitle": ""}