{"organizations": [], "uuid": "e72e5eb68dbddafb2768608ff6321d5b673c8922", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "savannahnow.com", "main_image": "http://savannahnow.com/sites/default/files/images/sms-default-facebook-share.jpg", "site_section": "http://savannahnow.com/", "section_title": "savannahnow.com | Savannah Georgia's source for News, Entertainment, Sports, Weather, Classifieds, Jobs, Autos, Real Estate and St. Patricks Day", "url": "http://savannahnow.com/opinion/2015-10-16/letters-editor-saturday", "country": "US", "title": "Letters to the editor Saturday |", "performance_score": 0, "site": "savannahnow.com", "participants_count": 1, "title_full": "Letters to the editor Saturday | savannahnow.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T19:34:00.000+03:00", "replies_count": 0, "uuid": "e72e5eb68dbddafb2768608ff6321d5b673c8922"}, "author": "DispatchDaemon", "url": "http://savannahnow.com/opinion/2015-10-16/letters-editor-saturday", "ord_in_thread": 0, "title": "Letters to the editor Saturday |", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "In response to Mr. Richard Leech’s letter (“A solution to Tybee’s deadly sandbar,” Oct. 12): I applaud the author’s attempt to find a workable solution. Our hearts go out to the families whose loved ones were lost. Everyone I know on Tybee is deeply saddened by this tragedy. We wish we knew how to prevent such things from happening.\nThe problem with building a warning tower on the highest point of the exposed bar is that any such point would be constantly changing and that such a structure would likely hasten the change.\nThe bottom structure of a sand-based river mouth is in constant flux. The shape of the sand bars and the channels that flow through them change daily. Wave height, current speed and water depth are among the many things that influence the rate of change.\nAdd to this list any structure that obstructs or diverts the flow of water, creating eddies behind it and thus erosive forces down-current. In fact, previous attempts to warn people using signposts below the south end waterline resulted in deep trenches between the signposts, directing and increasing current flow along shore in a dangerous way.\nThe city of Tybee wisely moved away from off-shore signposts in favor of portable warning signs that could be positioned above the changing water line. Perhaps a more comprehensible and effective message could be used on these signs, something similar to the rip tide warnings placed at our over-walks.\nDALE WILLIAMS\nTybee Island\nTybee candidate\nno-shows: ‘No guts\nno glory’\nTybee Island City Council candidates Stephen Friedman, Wanda Doyle and Barry Brown boycotted the Forever Tybee-hosted political forum on Oct. 12 because, in Mr. Friedman’s words, “they were afraid they would be treated unfairly” because of a perceived bias against them.\nWell guys and ladies, no gut no glory. They should have come and then challenged the questions or fielded them to their advantage. If they can’t participate in a possibly hostile environment, they certainly don’t belong on council.\nThey showed cowardice and disrespect to all the citizens who showed up to hear their views.\nAlso, moderator Tom Barton was a good sport.\nMARY DOYLE\nTybee Island\nWriter bets candidates don’t like baseball,\napple pie, kittens\nI should not cast doubt upon the patriotism of Savannah’s mayoral candidates. However, I feel it is my civic duty to do so.\nAfter last week’s debate at Armstrong State University, it is painfully apparent that none of the candidates are even slightly inclined to make a serious attempt to bring back America’s Favorite Past Time, (i.e., baseball) to the Hostess City. Three of the candidates mumbled something about Historic Grayson Stadium and money and land that we may or may not own.\nThe fourth candidate, Murray Silver, seemed personally offended by the notion. He unfolded his hands, sat up straight in his chair, leaned forward, his face red (his face was often red during the debate) and dramatically held up his two index fingers.\nHe was trying to make a point.\nMr. Silver then sputtered something about his only attending one Sand Gnats game in, well, he didn’t know how long (why he held up two fingers, then, was somewhat confusing, perhaps he meant to say that he had attended two games). Trying to bring professional baseball back to Savannah was, therefore, an idea beneath his contempt.\nIf I were a betting man, I’d bet none of the mayoral candidates like apple pie or kittens, either.\nJEFF HARRIS\nSavannah\nSocial Security should get a reasonable increase\nHere we go again.\nIn 2009 and 2010, Social Security recipients did not receive cost of living increases even though their actual living costs — especially medical — increased. During this same time, our beloved Congress received 3 percent cost of living increases.\nI asked my senators and congressman how could there be inflation increases and COLA’s for Congress, but not for Social Security recipients. I was told their COLA’s were based on a different method initiated in 1996 to figure inflation for them.\nThe CPI used in determining inflation and COLA’s for Social Security recipients includes energy costs like gasoline (a small part of seniors’ living costs), the main reason for the recent zero inflation. However, it does not include increases in medical and other real costs affecting seniors.\nCongress and the administration continues to increase spending for welfare recipients and illegal immigrants, while warning of a looming bankrupt Social Security system and the need to increase retirement ages and reduce cost of living increases.\nWhen have you heard anyone in Congress warn of a bankrupt welfare or illegal immigration system? You won’t because that’s politically incorrect.\nThose affected by the lack of an increase should write their senators and congressmen and demand a change to the methodology in figuring COLA’s for Social Security, federal retirees and disabled veterans benefits, and provide a realistic increase for 2016.\nBILL STAVRO\nSuwanee", "external_links": ["http://sav-cdn.com/sites/all/themes/savannahnow/images/blank.gif"], "published": "2015-10-16T19:34:00.000+03:00", "crawled": "2015-10-17T12:13:14.852+03:00", "highlightTitle": ""}