{"organizations": [], "uuid": "fb318ca564d3313467acd8d6e982864a1bc72625", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.haaretz.com", "main_image": "http://www.haaretz.com/polopoly_fs/1.680728!/image/3468509880.jpg_gen/derivatives/landscape_474/3468509880.jpg", "site_section": "http://www.haaretz.com/life/sports", "section_title": "Sports-Israel News - Haaretz Israeli News source", "url": "http://www.haaretz.com/news/diplomacy-defense/.premium-1.680716", "country": "IL", "title": "Jerusalem this week on phone and television screens was very", "performance_score": 0, "site": "haaretz.com", "participants_count": 1, "title_full": "Jerusalem this week on phone and television screens was very", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T09:36:00.000+03:00", "replies_count": 0, "uuid": "fb318ca564d3313467acd8d6e982864a1bc72625"}, "author": "Nir Hasson", "url": "http://www.haaretz.com/news/diplomacy-defense/.premium-1.680716", "ord_in_thread": 0, "title": "Jerusalem this week on phone and television screens was very", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Jerusalem this week on phone and television screens was very flat — a one-dimensional story of terrorists in an ecstasy of violence attacking with knives and being shot by police or civilians, usually to death. It was a city painted in black, white and red.\nPoliticians also talked about it one-dimensionally. For example, they said East Jerusalem can be separated from the west, that East Jerusalem neighborhoods can be cordoned off. But the Jerusalem reality is much more complex and multidimensional.\nFor 48 years Israel put enormous efforts into unifying the city. As the occupation continued, even distant villages connected to the city by one road became densely packed urban neighborhoods, surrounded on all sides by Jewish neighborhoods, crossed by highways and train tracks. In most of them Jews live in certain houses, usually linked to a right-wing NGO.\nThus a situation has been created in which a closure of East Jerusalem requires a chain of police and concrete barriers along dozens of kilometers.\nBut decision-makers haven’t understood this, so Thursday morning the inhabitants of East Jerusalem woke up to a new reality. Every neighborhood was surrounded by concrete barriers.\nIn most neighborhoods, all the entrances were blocked but one, where what’s called a “breathing checkpoint” was set up where cars and pedestrians were checked. People wishing to leave by car had to wait in a long traffic jam. According to a number of witnesses, the police provided plenty of shouts and threats.\nBut despite this, in every neighborhood people could easily leave by foot to West Jerusalem without being checked. It seemed that in the main neighborhoods, including the ones where many settlers live, it wasn’t a problem to drive out without being checked, even if a detour was necessary.\nIndeed, on Thursday most Palestinian workers reached their jobs in the west of the city. They were late and a bit frightened, but they got there. Mahmoud Mohammed of Isawiyah was pushing a baby carriage Thursday morning from the lower part of the village — one of the steepest places in Jerusalem to a checkpoint, in this case on the way to the Jewish neighborhood of French Hill. The baby was going for a checkup at Shaare Zedek Medical Center.\n“We’ve been waiting four months for this appointment. You can’t get out, there’s a two-hour traffic jam at the checkpoint,” he said. “The only thing that will help us is if none of the Palestinians go to work, not drivers, not municipal workers. Only then will they listen to us.”\nA tour along the seam line Thursday showed the great gap between the simplicity of weapons and politicians’ declarations on the one hand and reality on the other. Take the scene, which no movie director could invent, at the checkpoint between Jabal Mukkaber and Armon Hanatziv, just a few meters from the attack on the bus in which Haviv Haim and Ilan Guverg were killed.\nA cluster of foreign journalists had gathered there as an audience for the encounter between Dror Ben-Arvon of Armon Hanatziv and Awad Rabiaa, a taxi driver from Jabal Mukkaber. Ben-Arvon came wearing body armor and a helmet; he also had a baton and a nunchaku. Two kitchen knives were jammed into his dashboard, ready to be pulled out. “That’s how you have to go around today,” he explained to a policeman, who lifted an eyebrow.\n“I’m scared. I didn’t send the kids to school today. My house isn’t even worth a shekel. No one would buy it because we have no security,” he said.\n“When [far-right Rabbi Meir] Kahane talked about transfer he was outlawed; [Prime Minister Ariel] Sharon transferred 10,000 families out of Gush Katif. I’m saying if you already threw out 10,000 families, take the people in Jabal Mukkaber and throw them into Gaza.”\nRabiaa answered him: “You’re afraid for your children, I’m afraid for mine. I’m afraid they’re going to be shot. They beat them when they search them. Why is it that they don’t find the ones who burned a family to death?”\nRabiaa was referring to an arson attack on the home of the Dawabsheh family in the West Bank, widely believed to have been committed by Jewish extremists.\nPerhaps because of the heat, perhaps because the foreign reporters had left, Ben-Arvon took off his body armor and threw the helmet, the nunchaku and the baton in his car. He then came back to continue the argument.\n“We’re neighbors, we don’t quarrel. I’m not afraid of him. I have lots of friends in the village,” Ben-Arvon said.\nGazi Hassan, also a taxi driver from Jabal Mukkaber, answered.\n“You think Jabal Mukkaber is two houses? There are 30,000 people living here. The checkpoint won’t help. Anybody who wants to do something, this won’t bother him, and meanwhile you blame all the rest, like pouring oil on a fire.”\nFor a long time Armon Hanatziv residents have complained about harassment by young Palestinian men, those who come to the neighborhood to drink alcohol. And then there’s the noisy call to prayer.\nBut there have been those two attacks — the bus attack and the one in which Alexander Levlovich was killed when stones were thrown at his car and he lost control. So new fears have mixed with the old.\n“We’re under curfew here. When it gets dark you can’t go out. I don’t let my kids go out alone because of harassment. The neighborhood high school held a karaoke contest in the front plaza — that’s to get the kids to come. The parents are afraid,” said Yehuda Ben-Yosef, chairman of the neighborhood administration. He adds that about 20 percent of the students didn’t show up for school Thursday.\nAt the checkpoint on the other side of Jabal Mukkaber, a Border Police member with a Russian accent said the problem was easy to solve. “Give them the money for their houses and let them leave but without being able to come back,” he said. “This is a Jewish state. I don’t see anything else here.”\nNir Hasson\nHaaretz Correspondent\n ", "external_links": ["https://twitter.com/nirhasson", "https://www.facebook.com/nir.hasson.9?fref=ts", "http://widgets.outbrain.com/outbrain.js"], "published": "2015-10-16T09:36:00.000+03:00", "crawled": "2015-10-16T01:47:31.514+03:00", "highlightTitle": ""}