{"organizations": [], "uuid": "8204a5fa2bcba495bf20c1f5bcf49887d672b602", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266381/sports-general", "section_title": "Sports: General - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30213626/california-casualty-urges-others-to-support-firefighters", "country": "US", "title": "California Casualty Urges Others to Support Firefighters", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "California Casualty Urges Others to Support Firefighters - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T13:01:00.000+03:00", "replies_count": 0, "uuid": "8204a5fa2bcba495bf20c1f5bcf49887d672b602"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30213626/california-casualty-urges-others-to-support-firefighters", "ord_in_thread": 0, "title": "California Casualty Urges Others to Support Firefighters", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "California Casualty is honoring firefighters during Fire Prevention Month and the National Fallen Firefighters Foundation Memorial. Learn more at http://www.calcas.com/firefighters .\nSan Mateo, CA (PRWEB) October 08, 2015\nOctober is an important month for firefighters across the country. Not only is it Fire Prevention Month, but it’s also when they pause to remember fellow comrades at the National Fallen Firefighters Foundation Memorial in Maryland.\nIn 2014, 84 men and women in the United States lost their lives in the line of duty. Despite that, thousands of dedicated fire personnel continue to put on the uniform and charge into dangerous situations to help others.\nToo often, their heroics and sacrifice go unnoticed. That’s why California Casualty created Nominate A Hero, a program to encourage others to highlight those who make our communities better. First responder Heroes of the Month include California fireman Joe Benton who suffered serious injuries fighting an outbreak of wildfires and is now a fire inspector, and firefighter/CPR instructor Robert Stevens who volunteers at the local school district and also helps aspiring firefighters apply and study for the firefighter exam. To honor a hero, go to http://www.nominatemyhero.com .\nCalifornia Casualty is also encouraging the public to join them in donating to relief funds aimed at helping firefighters who lost homes while selflessly protecting their communities during the disastrous California fires. Information can be found at http://www.csfa.net/CSFA/CalFF/articles/California_Casualty__NVFC_team_up_to_support_firefighters_who_lost_homes.aspx .\n“We think it’s important to say thank you and support the courageous men and women who protect us,” said Mike McCormick, California Casualty Sr. Vice President.\nLearn more about California Casualty and its 40 year partnership with firefighters at http://www.calcas.com/firefighters .\nHeadquartered in San Mateo, California, with Service Centers in Arizona, Colorado and Kansas, California Casualty provides auto and home insurance to firefighters, law enforcement, educators and nurses across the country. Celebrating 100 years of service, California Casualty has been led by four generations of the Brown family. To learn more about California Casualty, or to request an auto insurance Quote: , please visit http://www.calcas.com or call 1.800.800.9410.\n //www.prweb.com/releases/CaliforniaCasualty/SupportsFirefighters/prweb13010403.htm\n ", "external_links": ["http://www.prweb.com/releases/CaliforniaCasualty/SupportsFirefighters/prweb13010403.htm", "http://www.calcas.com/firefighters", "http://www.csfa.net/CSFA/CalFF/articles/California_Casualty__NVFC_team_up_to_support_firefighters_who_lost_homes.aspx"], "published": "2015-10-08T13:01:00.000+03:00", "crawled": "2015-10-08T12:28:23.634+03:00", "highlightTitle": ""}