{"organizations": ["Smith Image"], "uuid": "5f05c7a107ff390cfe7f7beb4588ce9b78329721", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.newsnet5.com", "main_image": "http://media2.newsnet5.com/photo/2015/10/12/josh-mccown_1444641795735_25103432_ver1.0_640_480.jpg", "site_section": "http://www.newsnet5.com/feeds/rssFeed?obfType=RSS_FEED&siteId=10003&categoryId=10004", "section_title": "Sports | newsnet5", "url": "http://www.newsnet5.com/sports/browns/johnny-who-browns-josh-mccown-silencing-push-for-manziel", "country": "US", "title": "Johnny Who? McCown silencing push for Manziel", "performance_score": 0, "site": "newsnet5.com", "participants_count": 0, "title_full": "Johnny Who? McCown silencing push for Manziel", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T16:05:00.000+03:00", "replies_count": 0, "uuid": "5f05c7a107ff390cfe7f7beb4588ce9b78329721"}, "author": "", "url": "http://www.newsnet5.com/sports/browns/johnny-who-browns-josh-mccown-silencing-push-for-manziel", "ord_in_thread": 0, "title": "Johnny Who? McCown silencing push for Manziel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["McCown", "Johnny Who", "Josh McCown"], "text": "Johnny Who? Browns' Josh McCown silencing push for Manziel TOM WITHERS 9:05 AM, Oct 13, 2015 Getty/Patrick Smith Image copyright 2015 Getty Images. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed. Show Caption Next \nCLEVELAND - Those booming shouts for Johnny Manziel have quieted to a murmur. \nWith his third straight strong performance, and a regular-season game like no Browns quarterback has ever had, Josh McCown has ended any controversy in Cleveland. \nWell, at least for a week. \nMcCown, the everyman's journeyman who just five years ago was out of the NFL and slinging passes for the Hartford Colonials in the United Football League, passed for 457 yards and two touchdowns in Sunday's 33-30 win at Baltimore. On top of setting a franchise regular-season record for yards, the 36-year-old ran for a score, converted a 2-point conversion and led the Browns on a winning drive in overtime despite playing with a sprained left ankle. \nHe's the first QB in team history to surpass 300 yards passing in three straight games, and McCown has given the Browns (2-3) hope this season might be salvaged. \nJohnny Who? \nJust three weeks ago, McCown, who sustained a concussion on the opening series this season, faced Oakland at home with some Browns fans chanting, \"John-ny, John-ny\" after every one of his incompletions. But while McCown may still not win a popularity contest, he has provided Cleveland with much needed stability at its most problematic position. \n\"It's been tremendous,\" Browns coach Mike Pettine said of a three-game stint in which McCown has passed for 1,154 yards, six touchdowns and one interception. \"He's a guy you root for, but a big thing to talk about is understanding how well we're playing around him. The backs have stepped their game up. The offensive line is improving. The receivers are playing well. Just to have a guy that can be that calming influence. He doesn't get too up. He doesn't get too down. \n\"His success, while on the outside of the building is surprising, the people that were here in the spring with him and watched him through training camp and just how he handed his business — we knew if we played well around him that he was capable of this.\" \nIt's some personal redemption for McCown, who went 1-11 as the starter for a bad Tampa Bay team last season. He had played so well during a fill-in stint with Chicago in 2013 — 13 TDs, one interception — only to face the same criticism that he wasn't good enough to start for a quality team. \nThen, after leading the Browns on a 17-play drive in the opener, McCown foolishly launched himself in the air near the end zone and was knocked from the game with a concussion. Manziel started the following week and led the Browns to a win over Tennessee, prompting a public outcry for Cleveland to start the polarizing backup. \nPettine stuck with McCown has been rewarded for his faith in him. Pettine consulted with coordinator John DeFilippo and quarterbacks coach Kevin O'Connell before deciding to stay the course. \n\"I didn't get caught up in the external debate about it,\" he said. \"It was a decision that we thought was best for our football team and the way Josh has played certainly looks to have validated it.\" \nFor his part, McCown isn't getting caught up in his recent success. Just as he distributes the ball to all his receivers, McCown spread the praise for Cleveland's bounce-back win a week after a heartbreaking loss in San Diego. And, always the perfectionist, McCown found plenty of flaws in his game. \n\"There's a ton of stuff that I'm not pleased with,\" he said. \"Just looking over the last few weeks, starting from the way we finished against Oakland and the different spots throughout the San Diego game and yesterday, I just feel like the execution could be better. I don't know if it's ever possible to throw a perfect game, but you want to get as close as you can. \n\"I felt really good about yesterday, but I still feel like we left some things out there. I know I left some things out there that could've been a lot better, need to be tightened up for sure.\" \nNOTES: McCown said his ankle feels better, he will continue to receive treatment and is hoping to play Sunday against Denver. Pettine said it's possible McCown could be kept out of a practice. ... Two-time Pro Bowl CB Joe Haden is in the NFL's concussion protocol after sustaining a head injury against the Ravens and will likely sit out against the Broncos. ... Outside LB Scott Solomon sustained a knee injury and could be sidelined for some time, Pettine said. Solomon recently returned from an ankle injury. Copyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-10-13T16:05:00.000+03:00", "crawled": "2015-10-13T16:38:56.042+03:00", "highlightTitle": ""}