{"organizations": [], "uuid": "03ca7db36c6d66f3ab10fb4bcc146472b5bf30f9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/47529300.cms", "site_section": "http://timesofindia.indiatimes.com/sports/football/champions-league/articlelist/40924344.cms", "section_title": "Top Stories - Champions League - Football - Sports - The Times of India", "url": "http://timesofindia.indiatimes.com/sports/football/champions-league/top-stories/English-teams-will-do-better-in-Champions-League-Ozil/articleshow/49154101.cms", "country": "IL", "title": "English teams will do better in Champions League: Ozil", "performance_score": 0, "site": "indiatimes.com", "participants_count": 1, "title_full": "English teams will do better in Champions League: Ozil - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T03:00:00.000+03:00", "replies_count": 0, "uuid": "03ca7db36c6d66f3ab10fb4bcc146472b5bf30f9"}, "author": "timesofindia.indiatimes.com", "url": "http://timesofindia.indiatimes.com/sports/football/champions-league/top-stories/English-teams-will-do-better-in-Champions-League-Ozil/articleshow/49154101.cms", "ord_in_thread": 0, "title": "English teams will do better in Champions League: Ozil", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Arsenal midfielder Mesut Ozil believes English teams were unlucky in the Champions League last season and is expecting a much stronger showing this time round.\nChelsea and Arsenal were knocked out on the away goals rule while Manchester City lost to eventual champions Barcelona in the last 16 and Liverpool failed to make it past the group stages.\nA repeat of last season's performances in Europe from English and Italian clubs would see the Premier League lose its fourth Champions League qualifying spot to Serie A in 2017-18.\n\"I think there was a lot of misfortune last year,\" Ozil told the club's website (www.arsenal.com) ahead of Tuesday's Group F tie with Greek national champions Olympiakos Piraeus.\n\"When you look at the English teams you see they are strong...they have a lot of players in their ranks who have a lot of quality.\n\"In the knockout rounds sometimes one goal or the away goals ruling can decide ties, like with us against Monaco,\" added Germany's 2014 World Cup winner Ozil.\n\"We had some bad luck and as a team you need more fortune. I think it will be different this year, the English sides are well equipped and will go far.\"\nEngland's teams have also made a poor start this season with Chelsea the only side to win their opening Champions League game.\nNo English side has reached the semi-finals since Chelsea lifted the trophy in 2012.\nOzil said Arsenal's 2-1 Champions League defeat by Dinamo Zagreb had prompted a reaction from the squad.\n\"Defeats always rouse the team more and our aim this season is to go as far as possible and, if possible, to win it because we have the potential,\" said the 26-year-old.\n\"Anything is possible and that's what we want to show this year. With a bit of luck we can reach our target.\"", "external_links": [], "published": "2015-09-29T03:00:00.000+03:00", "crawled": "2015-10-10T17:23:27.135+03:00", "highlightTitle": ""}