{"organizations": [], "uuid": "ecf2d507c7293a0bee25221f23ee8490c339a75d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.postindependent.com", "main_image": "http://www.PostIndependent.com/csp/mediapool/sites/dt.common.streams.StreamServer.cls?STREAMOID=fR9cWhfo6QdWPOtkbjkIaM$daE2N3K4ZzOUsqbU5sYujJkTTPK4ixYeJWpPRGyjcWCsjLu883Ygn4B49Lvm9bPe2QeMKQdVeZmXF$9l$4uCZ8QDXhaHEp3rvzXRJFdy0KqPHLoMevcTLo3h8xh70Y6N_U_CryOsw6FTOdKL_jpQ-&CONTENTTYPE=image/jpeg", "site_section": "http://www.postindependent.com/csp/mediapool/sites/SwiftShared/assets/csp/rssCategoryFeed.csp?pub=GlenwoodSprings&sectionId=986&sectionLabel=Sports", "section_title": "The Post Independent Section RSS Feed: Sports", "url": "http://www.PostIndependent.com/sports/18751997-113/bears-sink-sailors-in-41-0-shutout", "country": "US", "title": "Bears sink Sailors in 41-0 shutout", "performance_score": 0, "site": "postindependent.com", "participants_count": 1, "title_full": "Bears sink Sailors in 41-0 shutout", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T09:56:00.000+03:00", "replies_count": 0, "uuid": "ecf2d507c7293a0bee25221f23ee8490c339a75d"}, "author": "jcarney", "url": "http://www.PostIndependent.com/sports/18751997-113/bears-sink-sailors-in-41-0-shutout", "ord_in_thread": 0, "title": "Bears sink Sailors in 41-0 shutout", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Expand Photo Austin Colbert / Steamboat Today | Rifle's Tyler Bosshardt fights off Steamboat tacklers in the first quarter to score one of his three touchdowns on the day. Rifle won the game, 41-0. Expand Photo Austin Colbert / Steamboat Today | Rifle's Blaine Vance fights off tacklers in the first quarter of Friday's game in Steamboat Springs. Rifle won, 41-0. « » Related Media STEAMBOAT SPRINGS — Ranked No. 4 in Class 3A with only one loss, everyone already knew the Rifle High School football team was better than Steamboat Springs. So, Rifle’s 41-0 win on Friday at Gardner Field wasn’t surprising. However, the Sailors wanted to find more positives playing against another highly-ranked league opponent, and did just that in a game they refused to give up on. “I am incredibly proud of our football players. They did what they could and they played hard, they played well,” SSHS coach Lonn Clementson said. “The top three or four teams in our league are ranked very highly for a reason. What I hope our players understand is those teams made us better. And the reason they made us better is because our kids went into the games with a great attitude.” Rifle (7-1 overall, 4-1 Western Slope) was never threatened in Friday’s game, taking an early 7-0 lead after one possession on a 16-yard touchdown run by senior Tyler Bosshardt. Steamboat senior quarterback Zach Holm was intercepted by Bear defender Blaine Vance on the Sailors’ first possession, and a 12-yard run by Bosshardt made it 13-0 Rifle after a quarter. “We made a few mistakes early,” Clementson said. “Those top three teams, top four teams in our league, they are all in a league by themselves. They are just so good. But our kids have been improving.” Rifle extended its lead to 19-0 early in the second quarter on a 33-yard touchdown pass from quarterback Ethan Strouse to Bosshardt. The Bears led 27-0 at halftime after a 1-yard run by Vance with about five minutes remaining in the quarter. The Sailors had a chance to put some points on the board before the break, but a 41-yard field goal attempt by senior Joe DeLine missed right. “I think all the credit goes to the effort and the execution of our kids,” Rifle coach Damon Wells said of his team’s efficient running game, which amassed more than 300 yards on the ground. “This is always a difficult place to play. This one means a lot and we are proud of our kids.” The Sailors opened the third quarter with another nice drive, which included a 41-yard connection from Holm to receiver T.J. Doogan. However, the drive stalled inside Rifle’s 10-yard line, and a 31-yard field goal attempt by DeLine missed left. “I do think the offense is doing a great job. It’s starting to come together,” Clementson said. “I feel like we are improving and getting healthier. Our kids are playing for each other; they are playing as a team. It’s really been fun. Nobody likes to lose, but it’s really been fun with these kids.” Rifle put the game away with a 56-yard touchdown run by Ty Leyba, and a 5-yard TD run by Strouse to start the running clock and end the third quarter. The Bears will host Glenwood Springs (1-7, 1-4) next week for senior night, before finishing the regular season at Summit on Nov. 6. Rifle remains a game behind Delta (7-1, 5-0) in the Western Slope. Delta remains Rifle’s only loss. “We are very proud of our kids and their effort. Steamboat is an incredibly tough place to come play,” Wells said. “Lonn always does a great job with his kids and always has them prepared. They had a solid plan and I thought their kids played hard until the very end of the game. It’s always special to get a win in our league, especially on the road.” Steamboat (2-6, 0-5) will finally get a respite from the elite teams when it hosts Summit (1-7, 0-5) on Friday for senior night. The Sailors wrap up their season the week after at Glenwood Springs. “There is nobody hanging their heads here,” Clementson said. “If the players are improving and they are having fun and they are playing as hard as they can, we are ecstatic as coaches. So we are really quite happy with our kiddos right now.”", "external_links": [], "published": "2015-10-24T09:56:00.000+03:00", "crawled": "2015-10-24T17:30:04.575+03:00", "highlightTitle": ""}