{"organizations": ["Sevilla"], "uuid": "b8b15e043d49efe7bd031efe3ef41498bba8dcee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ibtimes.co.uk", "main_image": "http://d.ibtimes.co.uk/en/full/1464702/raheem-sterling.jpg", "site_section": "http://ibtimes.co.uk//rss/sports", "section_title": "IBTimes.co.uk : Sports", "url": "http://www.ibtimes.co.uk/manchester-city-vs-sevilla-champions-league-2015-16-where-watch-live-preview-betting-odds-1524953", "country": "US", "title": "Manchester City vs Sevilla, Champions League 2015/16: Where to watch live, preview, betting odds and possible XI", "performance_score": 0, "site": "ibtimes.co.uk", "participants_count": 0, "title_full": "Manchester City vs Sevilla, Champions League 2015/16: Where to watch live, preview, betting odds and possible XI", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T08:51:00.000+03:00", "replies_count": 0, "uuid": "b8b15e043d49efe7bd031efe3ef41498bba8dcee"}, "author": "", "url": "http://www.ibtimes.co.uk/manchester-city-vs-sevilla-champions-league-2015-16-where-watch-live-preview-betting-odds-1524953", "ord_in_thread": 0, "title": "Manchester City vs Sevilla, Champions League 2015/16: Where to watch live, preview, betting odds and possible XI", "locations": ["Manchester City"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Raheem Sterling", "Sergio Aguero Getty"], "text": "October 21, 2015 06:51 BST Raheem Sterling will be key for Manchester City in the absence of the injured Sergio Aguero Getty \nManchester City host Sevilla in their third group game of the Champions League on Wednesday 21 October, as the Premier League toppers look to top their group for the first time since making it into the competition. \nWhere to Watch Live \nKick-off is set for 7.45pm BST . Live coverage of the game will be on BT Sport 2 and BT Sport 2 HD. Live Radio commentary will be available on BBC Radio 5 Live. \nOverview \nManchester City come into this game in fine form after getting back to winning ways in the Premier League. They dismantled Bournemouth 5-1 on Saturday (17 October) and will be keen to continue their momentum in the Champions League when Sevilla visit the Etihad Stadium. Manuel Pellegrini is aware of his side's poor home form in the elite European competition and will be keen to get their first home win of the competition. The Citizens are currently in third place in the group level on points with Wednesday night's opponents with Juventus currently on top of the group with six points. \nThe Chilean manager is without his main forward Sergio Aguero, who is facing a lengthy spell on the sidelines after picking up an injury while on international duty with Argentina. Raheem Sterling and Wilfried Bony stepped up in the Argentinean's absence and scored the goals for City in the Premier League and Pellegrini will hope the duo continue their goal scoring form in the Champions League. \nMeanwhile, Sevilla come into this game on the back of a disappointing draw against Eibar, as they continue to struggle in the La Liga. Unai Emery's side are currently in 13 th place in the league as they continue to struggle with their away form. \nThe Spanish club are yet to win a match in England and have failed in their previous three attempts. They will come into the match as the underdogs, but a win could give them much needed confidence for the Spanish league and boost their chances of qualifying from the group, which also includes Juventus. \nWhat Managers Say \nManuel Pellgrini: \"I don't know the exact statistics but we must improve [our home form in the UEFA Champions League]. We are just thinking about this game, not the past. I hope we are just thinking about the game tomorrow. All the other things are statistics or history that will not help us to win or lose.\" \nUnai Emery: \"We are level for the moment, City and ourselves. I see tomorrow's game as being just as important as previous matches. City are a great team, a great squad – they have some great individuals. Whether one plays or not, they are still strong. We are aware of the dangers they can create but we also know we are capable of playing well – we can cause problems ourselves.\" \nBetting Odds (By 888sport.com)", "external_links": [], "published": "2015-10-21T08:51:00.000+03:00", "crawled": "2015-10-21T08:54:20.556+03:00", "highlightTitle": ""}