{"organizations": [], "uuid": "c12446ef1186082db04b547764fe7b8a326b3b08", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.local12.com", "main_image": "http://www.local12.com//template/ugc/wkrc/1601/cwBHr26t.jpg", "site_section": "http://www.local12.com/sports/features/local-sports//rss.xml", "section_title": "wkrc LOCAL Sports", "url": "http://www.local12.com/sports/features/local-sports/stories/Comparing-the-three-Bengals-teams-that-started-6-0-223421.shtml", "country": "US", "title": "Comparing the three Bengals teams that started 6-0", "performance_score": 0, "site": "local12.com", "participants_count": 0, "title_full": "Comparing the three Bengals teams that started 6-0", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T18:01:00.000+03:00", "replies_count": 0, "uuid": "c12446ef1186082db04b547764fe7b8a326b3b08"}, "author": "", "url": "http://www.local12.com/sports/features/local-sports/stories/Comparing-the-three-Bengals-teams-that-started-6-0-223421.shtml", "ord_in_thread": 0, "title": "Comparing the three Bengals teams that started 6-0", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comparing the three Bengals teams that started 6-0 \nUpdated: Sat, Oct 24 2015, 03:24 PM \nCINCINNATI (Richard Skinnner) -- This year's Bengals team joined the 1975 and 1988 Bengals teams as the only ones in franchise history to start a season with a 6-0 record, but where does it compare with those two teams? \nThe 1988 team went on to reach the Super Bowl, while the 1975 team lost in the divisional playoffs at Oakland, 31-28, when only four teams qualified for the playoffs in each division. \nHere's a position-by-position comparison of each with a rating system in which the best of the three earns three points, the next earns two and the worst of the three earns one (number in parentheses): \nQuarterback 1988 (2): Boomer Esiason. 1975 (1): Ken Anderson. The Skinny: It's hard to believe Dalton can keep up his ridiculously good start (a passer rating of 116.1), but if he does he would clearly better either of the seasons of Esiason (97.4 rating, 28 TDs, 14 interceptions), who was selected NFL MVP that season, and Anderson (93.9 rating, 21 TDs, 11 interceptions). Dalton is on pace to throw 37 touchdowns and only five interceptions \nRunning Backs 1988 (3): Ickey Woods, James Brooks, Stanley Wilson. 2015 (2): Jeremy Hill, Giovani Bernard. 1975 (1): Boobie Clark, Stan Fritts, Lenvil Elliott, Essex Johnson. The Skinny: Woods, Brooks and Wilson combined to rush for 2,395 yards and 25 touchdowns and added another 596 yards and seven touchdowns receiving. Hill and Bernard are on pace to rush for 1,757 yards and 19 touchdowns. The 1975 group was very much by committee, but averaged just 3.6 yards per carry combined. \nWide Receivers 1975 (3): Isaac Curtis, Charlie Joiner, Chip Myers. 2015 (2): A.J. Green, Marvin Jones, Mohamed Sanu. 1988 (1): Eddie Brown, Tim McGee, Cris Collinsworth. The Skinny: The 1975 group didn't have a lot of flash, but they were extremely productive. Curtis averaged 21.2 yards per reception, Joiner averaged 19.6 per catch and Myers was the consummate possession receiver. This year's group has a potential Hall of Famer in Green, while Jones and Sanu provide a perfect complement to him in different ways: Jones as the deep threat and Sanu as the possession receiver. Brown was superb in 1988 averaging 24.0 yards per reception and McGee was solid, while Collinsworth's career was winding down. \nTight Ends 1988 (2): Rodney Holman. 1975 (1): Bob Trumpy, Bruce Coslet. The Skinny: Eifert is on pace to have 75 receptions for 912 yards and 16 touchdowns, which would be more than what Holman, Trumpy and Coslet had combined. Holman was solid with 39 catches for 527 yards and three touchdowns, while Trumpy's career was winding down. \nOffensive Line 1988 (3): LT Anthony Munoz, LG Bruce Reimers, C Bruce Kozerski, RG Max Montoya, RT Joe Walter. 2015 (2): LT Andrew Whitworth, LG Clint Boling, C Russell Bodine, RG Kevin Zeitler, RT Andre Smith. 1975 (1): LT Rufus Mayes, LG Howard Fest, C Bob Johnson, RG Dave Lapham, RT Vernon Holland. The Skinny: As well as this year's line has played, and it might be the best in the NFL, the 1988 was among the best of all-time for a single season. Munoz and Montoya were both selected to the Pro Bowl and Walter was the best right tackle in the league. The 1975 line was a solid group, but none of them made the Pro Bowl. \nDefensive Line 2015 (3): LE Carlos Dunlap, NT Domata Peko, DT Geno Atkins, RE Michael Johnson. 1988 (2): LE Skip McClendon, NT Tim Krumrie, RE Jim Skow. 1975 (1): LE Ken Johnson, LT Bob Brown, RT Ron Carpenter, RE Sherman White. The Skinny: Teams have run the ball in big chunks at time against this year's line, but Dunlap is on pace for 17 sacks and Atkins is on pace for 11. Combined that would be more than the entire 1975 defense had, which was 27 (individual sack totals were not logged that season). The 1988 team used a 3-4 defense, but that line is a close second as Krumrie was a Pro Bowl selection and McClendon, Skow and Jason Buck combined for 17.5 sacks. \nLinebackers 1975 (3): LLB Al Beauchamp, MLB Jim LeClair, RLB Ron Pritchard. 1988 (2): LOLB Leon White, LILB Carl Zander, RILB Joe Kelly, ROLB Reggie Williams. 2015 (1): SLB A.J. Hawk or Emmanuel Lamur, MLB Rey Maualuga, WLB Vinny Rey. The Skinny: The 1975 defense was very strong in the back seven, especially in coverage as opposing quarterbacks completed just 45.0 percent of their passes against the Bengals that season and the linebackers were a big part of that. The 1988 group was solid enough against the run (opponents averaged 4.2 yards per carry), decent against the pass and White and Williams combined for 5.5 sacks. This year's unit is clearly the weak link on the defense, although Rey has been outstanding, especially when the team goes to the nickel defense. \nSecondary 1975 (3): LCB Lemar Parrish, RCB Ken Riley, LS Tommy Casanova, RS Bernard Jackson, S Marvin Cobb, S Lyle Blackwood. 1988 (2): LCB Lewis Billups, RCB Eric Thomas, FS Solomon Wilcots, SS David Fulcher, S Barney Bussey. 2015 (1): LCB Dre Kirkpatrick, RCB Adam Jones, FS George Iloka, SS Reggie Nelson, NICKEL Leon Hall. The Skinny: The 1975 team held opposing quarterbacks to a 46.9 rating and had twice as many interceptions (22) as touchdown passes allowed. Parrish and Riley really should have been considered for the Hall of Fame and Casanova might have been headed there if he hadn't retired early to become a doctor. Casanova and Parrish were both selected to the Pro Bowl team. The 1988 secondary held opposing quarterbacks to a 69.6 rating and had more interceptions (22) than TD passes allowed (19). Thomas and Fulcher were each selected to the Pro Bowl. This year's secondary is very good, but not quite as good as those other two units \nKicker 1988 (2): Jim Breech. 1975 (1): Dave Green. The Skinny: Nugent is 7 for 9 this season on field goal attempts and 12 of his 29 kickoffs have been touchbacks. Breech was very solid inside 40 yards (9 of 10), but from 40 and beyond he was just 2 of 6. Green was simply brutal even in an era where kickers weren't all that good. He made just 10 of 21 attempts, including 1 of 7 between 30-39 yards. \nPunter 1988 (2): Scott Fulhage and Lee Johnson. 1975 (1): Dave Green. The Skinny: Huber is as good as there is in the NFL. He is averaging 47.9 yards per punt gross and only eight of his 23 punts have been returned. Fulhage was bad, averaging just 38.0 yards per punt, which is why he was canned in favor of Johnson, who averaged 42.4 yards per punt. Believe it or not Green pulled double duty and he wasn't much better as a punter averaging 39.0 yards per punt. \nKick Returners 2015 (3): Adam Jones and Brandon Tate. 1988 (2): Ira Hillary and Stanford Jennings 1975 (1): Bernard Jackson, Lenvil Elliott, Lemar Parrish, Lyle Blackwood and Tommy Casanova. The Skinny: Jones is averaging 27.6 yards per kickoff return and 12.1 per punt return, and while Tate has struggled as a kickoff returner he is averaging 10.3 yards per punt return. Hillary was solid, averaging 9.8 yards per punt return, while Jennings returned a kickoff for a touchdown in both the regular season and Super Bowl. Jackson and Elliott were very average kickoff returners and the trio of Parrish, Blackwood and Casanova struggled as punt returners, although earlier in his career Parrish was as good as anyone in the NFL. \nTotal Points/Summary 1988: 23 points. 1975: 17 points. The Skinny: The 2015 team barely edges the 1988 team with the 1975 team far behind. The 2015 team finished first in six of the 11 categories, including all three special teams categories - and was third in only two spots: linebacker and secondary. The 1988 team finished first in only two categories, while the 1975 team actually finished first in three, but the 1988 team was third in only one position group - wide receiver. The 1975 team finished third in eight of the 11 categories. Both the 1988 team and 1975 team lost their seventh game of the season and this year's team has a chance to make franchise history on Nov. 1 at Pittsburgh. \nFollow us on Twitter @Local12 and LIKE us on Facebook for updates! \nTo get \"The Skinny\" on local sports be sure to follow Local12 Digital Sports Columnist/Editor Richard Skinner on Twitter @Local12Skinny and LIKE him on Facebook for updates or email him raskinner@sbgtv.com. Related Stories", "external_links": [], "published": "2015-10-24T18:01:00.000+03:00", "crawled": "2015-10-25T00:18:45.590+03:00", "highlightTitle": ""}