{"organizations": [], "uuid": "02830ddff102a901566210dcbcc936768ae2d2c1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kplctv.com", "main_image": "http://WVUE.images.worldnow.com/images/8943579_G.jpg", "site_section": "http://www.kplctv.com/Global/category.asp?C=4385&nav=menu66_4&clienttype=rss", "section_title": "KPLC-TV - Sports", "url": "http://www.kplctv.com/story/30183056/lsu-keeps-feeding-the-hot-hand-fournette-keeps-breaking-records", "country": "US", "title": "LSU keeps feeding the hot hand, Fournette keeps breaking records", "performance_score": 0, "site": "kplctv.com", "participants_count": 1, "title_full": "LSU keeps feeding the hot hand, Fournette keeps breaking records", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T02:06:00.000+03:00", "replies_count": 0, "uuid": "02830ddff102a901566210dcbcc936768ae2d2c1"}, "author": "Garland Gillen", "url": "http://www.kplctv.com/story/30183056/lsu-keeps-feeding-the-hot-hand-fournette-keeps-breaking-records", "ord_in_thread": 0, "title": "LSU keeps feeding the hot hand, Fournette keeps breaking records", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LSU keeps feeding the hot hand, Fournette keeps breaking records Updated: LSU Running Back Leonard Fournette greets fans at halftime during LSU's 44-22 win over Eastern Michigan. (Photo by John Korduner) BATON ROUGE (WAFB) - \nLSU led at half by only six points over lowly Eastern Michigan. The Tigers were 45-point favorites coming into the contest, so a big lead was expected by this point. First play from scrimmage in the third quarter normalcy finally returned. Do-everything running back Leonard Fournette popped a 75-yard touchdown run cooling the Tiger fans anxiety. \n\"Leonard's liable to do that at any time,\" said Head Coach Les Miles. \"There's not a time where you hand him a ball that he doesn't have an opportunity to hit a home run. We certainly don't want to get him tired going into South Carolina. Hey listen, we broke Alley's record. But we want him to be really, really fresh for South Carolina. I promise you I am not going to stop a back once he's in flow and feel of the game. I'm not going to commit to taking him out until I feel like victory is assured.\" \n\"Coach Miles was on us in here. So is coach Frank (Wilson). He said whoever gets the ball in their hands has to make a play. You have to be special. That's what us young guys came to LSU for. That's the only thing going through my mind, and when I got the ball, the line did an outstanding job blocking for me. The wide receivers blocked the safeties, and it was off,\" said running back Leonard Fournette. \nThis was supposed to be the game Fournette would get a little break with two SEC games coming up. Coach Miles blew that theory out the water feeling the hot hand stays in. \n\"I promise you, I'm not going to stop a running back when he's in flow and feel of the game. Sometimes it takes some time to wear a defense down. Find that backside cut, explosively jump to the front side. I'm not going to commit to taking him out until I feel victory is assured,\" Miles said. \nThe St. Augustine alum also made some history against Eastern Michigan. His 233 yards rushing gave him three straight 200 yard efforts, an SEC record. A feat well deserved in the eyes of his teammates. \n\"Leonard is one of the most humbling guys I've ever met. He's a humble leader, a humble superstar. It was only a matter of time before he would get this attention. He's always had it actually, but national attention. Our job as the offensive line is to get him to the second level and get untouched. He's not going to lose most of the time against safeties and cornerbacks,\" said offensive lineman Vadal Alexander. \nOne record Fournette still doesn't own is most rushing in a game at LSU. Alley Broussard still holds that record with 250 yards. \nCopyright 2015 WVUE . All rights reserved. Can't Find Something?", "external_links": [], "published": "2015-10-05T02:06:00.000+03:00", "crawled": "2015-10-05T07:36:57.120+03:00", "highlightTitle": ""}