{"organizations": [], "uuid": "c68e6eee3c6472a051f5cb4539645d8483ff1f41", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/47529300.cms", "site_section": "http://timesofindia.indiatimes.com/rssfeeds/4720867.cms", "section_title": "Top Stories - Golf - Sports - The Times of India", "url": "http://timesofindia.indiatimes.com/sports/golf/top-stories/Jin-champion-after-rain-prevents-play/articleshow/49224742.cms", "country": "IL", "title": "Jin champion after rain prevents play", "performance_score": 0, "site": "indiatimes.com", "participants_count": 1, "title_full": "Jin champion after rain prevents play - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T15:10:00.000+03:00", "replies_count": 0, "uuid": "c68e6eee3c6472a051f5cb4539645d8483ff1f41"}, "author": "Ajit Bezbaruah", "url": "http://timesofindia.indiatimes.com/sports/golf/top-stories/Jin-champion-after-rain-prevents-play/articleshow/49224742.cms", "ord_in_thread": 0, "title": "Jin champion after rain prevents play", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "HONG KONG: One shot, on the 18th hole during the third round made all the difference. Cheng Jin of China was 10-under while Cameron Davis and Ryan Ruffels of Australia were 10-under and 9-under respectively at that stage. Davis finished his round with a par on the last hole but Ruffels had the opportunity to get an eagle and missed. \n\nThat put the duo level with Jin, who was in the next group. So, both Ruffels and Davis were hoping that Jin did not get a birdie on the final hole. When Jin's second shot in the par-5 hole hit the rough of the greens and went downhill it looked pretty ominous for the Chinese.But his chip from more than 18 yards away ended barely a foot away from the pin. And he closed it out without a fuss. \n\nJin, the 54-hole leader at 11-underpar, was crowned the 2015 Asia-Pacific Amateur Championship (AAC) at the Clearwater Bay Golf & Country Club here on Sunday after conditions did not improve by midday. Ruffels and Davis were joint runners-up. Obviously both of them were gutted, especially Ruffels, because he had an opportunity, which he let it slip. The two Indians--Samarth Dwivedi and Aman Raj--who made the cut finished tied-42 and tied-47 respectively. Dwivedi finished at 3-over-213 while Raj was 5-over-215. \n\n\"I guess it's not hard to tell that we are both pretty gutted. Obviously there's nothing we can do about the situation,\" Ruffels managed to speak keeping his emotions in check during the press briefing later in the day . \"It's really disappointing to see that we came close to something so big,\" said Davis. \n\nThe winner Jin, received an invitation to the Augusta Masters while runners-up, Ruffels and Davis, gained entry to The Open Qualifying Series at Royal Troon along with Jin. \n\n\"While weather regrettably shortened the event, we have identified a very worthy and talented champion in Jin,\" said Billy Payne, chairman of Augusta National Golf Club and the Masters Tournament. \n\nHe further added: \"This is a moment of celebration. He showed tremendous skill during the championship and we look forward to welcoming him to Augusta next April. We know Jin will proudly represent the AsiaPacific Amateur Championship and everyone who loves the game from this region of the world.\" \n\n ", "external_links": [], "published": "2015-10-05T15:10:00.000+03:00", "crawled": "2015-10-05T13:53:19.741+03:00", "highlightTitle": ""}