{"organizations": [], "uuid": "560059261961080bb9236dd3acc4b4d586cd710a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wopular.com", "main_image": "", "site_section": "http://www.wopular.com/rss/sections/11332", "section_title": "RSS: sports", "url": "http://www.wopular.com/serena-williams-withdraws-wta-finals-and-china-open-2", "country": "US", "title": "Serena Williams withdraws from WTA Finals and China Open", "performance_score": 0, "site": "wopular.com", "participants_count": 1, "title_full": "Serena Williams withdraws from WTA Finals and China Open", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T12:53:00.000+03:00", "replies_count": 0, "uuid": "560059261961080bb9236dd3acc4b4d586cd710a"}, "author": "senh", "url": "http://www.wopular.com/serena-williams-withdraws-wta-finals-and-china-open-2", "ord_in_thread": 0, "title": "Serena Williams withdraws from WTA Finals and China Open", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BING NEWS: Serena Williams Withdraws From WTA Finals and China Open Serena Williams says she is withdrawing from the season-ending WTA Finals and the China Open to take time to heal after playing through injuries all year. Williams, who was two wins from completing a calendar-year Grand Slam at the U.S. Open, says she is ... 09/30/2015 - 10:59 pm | View Link Serena Williams Ends 2015 Season, Withdraws from China Open and WTA Finals Serena Williams has called an end to her 2015 season and withdrawn from the China Open and WTA Finals in order to address her fitness issues. The world No. 1 has not played a competitive match since her shock defeat in the U.S. Open semi-finals to Italian ... 09/30/2015 - 10:57 pm | View Link Serena Williams withdraws from final two tournaments to bring her season to an early end after failing in calendar Grand Slam bid Serena Williams has called time on her 2015 season after withdrawing from the China Open and the WTA Finals in Singapore. The world No 1, who saw her bid to land the calendar year Grand Slam ended by a semi-final defeat to Roberta Vinci at the US Open at ... 09/30/2015 - 10:53 pm | View Link Serena Williams withdraws from China Open and WTA Finals Singapore to recover from US Open defeat Serena Williams waves goodbye to the remainder of the 2015 season (Photo by Mike Stobe/Getty Images for the USTA) World no. 1 Serena Williams has ended her 2015 season to ‘properly address her health and take time to heal’. In a statement released via ... 09/30/2015 - 10:43 pm | View Link Serena withdraws from China Open and WTA Finals Wuhan (China) (AFP) - World number one Serena Williams announced Thursday her withdrawal from next week's China Open in Beijing and the WTA Finals in Singapore, ending her season. \"I am taking a proactive step and withdrawing from tournaments in Beijing ...", "external_links": [], "published": "2015-10-01T12:53:00.000+03:00", "crawled": "2015-10-02T03:05:19.184+03:00", "highlightTitle": ""}