{"organizations": ["Hamilton Return", "Hamilton With", "Facebook Return", "Angels Post", "Texas Rangers Texas Rangers", "Rangers", "WFAA", "Los Angeles Angels"], "uuid": "31e1d36946caeaab1a408fe2924dcb1cb3e7624f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wfaa.com", "main_image": "http://www.gannett-cdn.com/-mm-/489efad1142179deef9ce5ef3cf126cd99e1a3f1/r=x633&amp;c=1200x630/http/cdn.tegna-tv.com/-mm-/aceb422b28a237b49380a4beba12d9c4f782fde8/c=0-0-2154-1217/local/-/media/2015/10/02/WFAA/WFAA/635793928545422853-usa-today-8836827.0.jpg", "site_section": "http://rssfeeds.wfaa.com/_/20/109849988/wfaa/sports", "section_title": "WFAA - Sports", "url": "http://www.wfaa.com/story/sports/mlb/rangers/2015/10/02/texas-rangers-josh-hamilton-redemption-playoffs/73217862/", "country": "US", "title": "Return to playoffs a redemption for Rangers, Hamilton", "performance_score": 0, "site": "wfaa.com", "participants_count": 0, "title_full": "Return to playoffs a redemption for Rangers, Hamilton", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T21:39:00.000+03:00", "replies_count": 0, "uuid": "31e1d36946caeaab1a408fe2924dcb1cb3e7624f"}, "author": "", "url": "http://www.wfaa.com/story/sports/mlb/rangers/2015/10/02/texas-rangers-josh-hamilton-redemption-playoffs/73217862/", "ord_in_thread": 0, "title": "Return to playoffs a redemption for Rangers, Hamilton", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jerome", "Hamilton Levi Weaver", "Jerome Miron", "Josh Hamilton"], "text": "Return to playoffs a redemption for Rangers, Hamilton With a playoff spot on the line, the Rangers and Josh Hamilton found redemption against the Angels Post to Facebook Return to playoffs a redemption for Rangers, Hamilton With a playoff spot on the line, the Rangers and Josh Hamilton found redemption against the Angels   WFAA.com: http://on.wfaa.com/1RkIXCd   Join the Conversation To   Return to playoffs a redemption for Rangers, Hamilton Levi Weaver, WFAA Sports 2:07 p.m. CDT October 2, 2015 With the chance to once again reach the postseason, Josh Hamilton delivered for the Texas Rangers Texas Rangers left fielder Josh Hamilton (32) hits a double during the second inning against the Los Angeles Angels (Photo: Jerome Miron, Jerome Miron-USA TODAY Sports) CONNECT 3 TWEET LINKEDIN COMMENT EMAIL MORE \nOctober 3rd, 2012: \nThe Rangers and Oakland Athletics have identical 93-68 records, and it's the last day of the regular season. The teams are headed in opposite directions, but the Rangers acquired Ryan Dempster at the trade deadline for just this moment. One win, and the Rangers will take the division. After a quick one-run bottom of the first, Oakland's starter A.J. Griffin cracks in the third inning, and the Rangers score five. \nMaybe everything will be okay after all. \nBut in the fourth inning, Dempster doesn't retire a single batter. \nBrandon Moss: walk \nJosh Reddick: double (1 run scored) \nJosh Donaldson: single \nSeth Smith: single (1 run scored) \nDempster is removed from the game and will never throw another pitch for the Texas Rangers. Derek Holland is summoned from the bullpen... \nDerek Norris: groundout \nOne more out, and the Rangers would escape the inning with a 5-3 lead. \nCoco Crisp: double (2 runs scored) \nStephen Drew: walk \nYoenis Cespedes: an easy, easy pop fly to center field. \nAnd that should have been that. a frustrating but new ballgame, five innings to determine a division winner. But you need no reminders about what would come next. Josh Hamilton did not bail out Derek Holland. He inexplicably whiffed completely, and the ball landed on the grass behind him. \nFor a second, not one of us breathed; mouths agape in disbelief as Coco Crisp scored to give the A's a 1-run lead. A deflated Texas team never scored again. By the end of the day, Oakland would score six more times. The A's were the division champions, and the Rangers, still reeling from the late-season collapse, would lose to Joe Saunders and the Orioles in the Wild-Card game. Texas has not played a post-season game since. \n(Intermission) \nIn the months following that disastrous day, Josh Hamilton signed with the Anaheim Angels, and, feeling that the dropped fly ball was just the rotten cherry atop a sundae whipped up from the putrid dugout water of O.co stadium, Ranger fans were happy to see him go. In 2013, Texas again blew a tire in the fourth turn, and used the 2014 season as an opportunity to break an MLB record for most players used in a season. Hamilton's fate was not much kinder. Injuries, personal turmoil, and just bad baseball marked his time in Anaheim. When they reunited in late April, it seemed like a sentimental reunion, more than anything: two lost souls, returning to each other as a refuge from devastating rejection: Hamilton by the entire Angels organization, and the Rangers by the baseball gods. \nOctober 1st, 2015: \nIt has been almost precisely three years since the incident in Oakland, but despite some otherwise compelling parallels, there has been no late-season slide for Texas this year. In fact, the Rangers have come back from seemingly insurmountable odds to take the division lead, and now it comes down to this: a four-game series against the very Anaheim Angels who, for all intents and purposes, banished Josh Hamilton back to Texas, agreeing to pay most of his substantial salary if he would just get out of their sight. With a win, the Rangers can eliminate the Angels from division contention. \nIt is the 2nd inning, and because baseball is so often stitched together from pure poetry, Derek Holland is again on the mound. \nAlbert Pujols: double \nDavid Freese: walk (oh how this poetry could have ended on a sour line.) \nShane Victorino: a hard line drive to the left field warning track \nAnd that should have been that. Shane Victorino, acquired by the Angels because, ironically, the absence of Josh Hamilton created the need for a left fielder, hit the ball well enough to be a hero. But Josh Hamilton, oft-injured this year, and just 20 days removed from surgery on his right meniscus, turned and sprinted towards the wall, flinging his right glove hand up at just the last minute, and falling, hard, first into the warning track and then into the base of the wall. \nFor a second, not one of us breathed, mouths agape, as we watched a fragile superman risk his health and well-being, crashing hard into the dirt beneath a Budweiser sign, as if to underscore the context of the moment. \nAnd then, as he has done so many times before, he drew himself upright from the cloud of dust, and fired a majestic rocket back to Elvis Andrus, whose relay throw just barely trailed Albert Pujols. \nAnother one-run deficit, but an entirely different feeling. \nIn the bottom of the 5th, Delino DeShields, only a Ranger because he was left unprotected by the Astros organization (whose elimination number would be down to one should the Rangers win), doubled home Elvis Andrus to tie the game. Two batters later, Adrian Beltre, who only signed with Texas after this very Anaheim organization refused to offer him a competitive contract, hit a three-run double to take the lead, a lead with Texas would never relinquish. Each stitch another line. \nIn the bottom of the 7th, Josh Hamilton, Texas' prodigal son, again stood upright, knees slightly bent in the batter's box. He took a ball, then lofted the second pitch to deep centerfield. Adrian Beltre, Anaheim's jilted lover, trotted home to score the last run of the ballgame. \nBy the time Shawn Tolleson struck out Carlos Perez to finish a 1-2-3 9th inning (which included groundouts by former Ranger David Murphy and Permanent Ranger Enemy David Freese), the Texas Rangers, with a 5-3 victory, had clinched at least a playoff spot, with eyes on a division title to shortly follow. The Angels were eliminated from the divisional race, left to hope for a Wild-Card berth. \nExcommunication of men is an invention of man, and so there is a distinct irony in the \"The Angels\" Angels of Anaheim's divisional hopes being dashed while their own personal Martin Luther was across the stadium tunnels, a table of Ginger Ale set aside for him, celebrating the thing that angels are traditionally said to celebrate the most: Redemption. \nLevi is available on Twitter @ThreeTwoEephus to discuss the Texas Rangers and Prince Fielder's foot speed. Read or Share this story: http://on.wfaa.com/1RkIXCd TOP VIDEOS", "external_links": [], "published": "2015-10-02T21:39:00.000+03:00", "crawled": "2015-10-02T22:20:17.450+03:00", "highlightTitle": ""}