{"organizations": ["Liverpool"], "uuid": "e609a1483d28fd7d7d708202a18db38b5aa780be", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sport.co.uk", "main_image": "http://images.sport.co.uk/150x150/46c68087aa21b1c49a7e10d1a5ff11ed.jpg", "site_section": "http://feeds.feedburner.com/SportcoukNewsRssFeed", "section_title": "General Sports News from Sports.co.uk", "url": "http://www.sport.co.uk/football/jurgen-klopp-acknowledges-liverpool-must-improve-in-front-of/6983390/", "country": "JE", "title": "Jurgen Klopp acknowledges Liverpool must improve in front of goal", "performance_score": 0, "site": "sport.co.uk", "participants_count": 0, "title_full": "Jurgen Klopp acknowledges Liverpool must improve in front of goal", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T15:17:00.000+03:00", "replies_count": 0, "uuid": "e609a1483d28fd7d7d708202a18db38b5aa780be"}, "author": "", "url": "http://www.sport.co.uk/football/jurgen-klopp-acknowledges-liverpool-must-improve-in-front-of/6983390/", "ord_in_thread": 0, "title": "Jurgen Klopp acknowledges Liverpool must improve in front of goal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jurgen Klopp"], "text": "Jurgen Klopp acknowledges Liverpool must improve in front of goal 24 Oct 2015 12:17:00 \ncomments \nLiverpool manager Jurgen Klopp believes many of his players have become too anxious about scoring and are making poor decisions as a result. \nGoals have been hard to come by for the Reds, with their two main strikers Daniel Sturridge and Christian Benteke both suffering with injuries this season. \nSeptember's 3-2 win over Aston Villa was the only time since February they have registered more than one in a game and similar problems were evident in Thursday's 1-1 draw against 10-man Rubin Kazan in the Europa League. \nKlopp insists only time - and more coaching from him - will improve the situation. \n\"It is important to get more stable but I saw the pressure on the players when they missed a chance,\" he said. \n\"I saw some players they were so stiff in their minds... 'Now we have to shoot'... we have to decide better (when it comes to) shooting, passing. When we go in the box we have to be better. \n\"It is only important you are always able to make the right decision at the right time because they have the quality to finish and create chances. \n\"We created chances against a deep defending opponent (Rubin) and we had many situations where we were close - and close is better than far away. \n\"This is, after this short time (working with him), is pretty normal. \n\"Sometimes you have to show them when to shoot and where the other options are and then the boys have to decide by themselves. \n\"I am still cool with the situation. If they stay healthy these guys then we can work.\" \nKlopp's attacking options for Sunday's visit of Southampton will at least be boosted by the returns of Christian Benteke and Roberto Firmino, who both came off the bench in midweek after month-long lay-offs. \nTwo draws in his opening matches have helped quell the raging expectation which raced across Merseyside at his appointment, but that does not mean Klopp is content. \n\"It is really not easy to compare completely different things but in my first season at Dortmund we had 15 draws and we only lost four games and finished sixth. \n\"I want the result with all my body gives me but I have seen many things we have done in training in the games. \n\"I didn't expect that we would run through the league from the moment I started here. \n\"This league is too strong, the opponents are too strong. We don't have enough time between the games to always be 20 per cent better in the next game. \n\"But I have seen many things. I see it in set-plays, in the defensive play. \n\"I trust in the qualities of the players.\" \nKlopp will make a late decision on whether Sturridge is fit to return from a knee injury, which has kept him out of the last two games, after assessing his participation on Saturday's training session. Related Sport News", "external_links": [], "published": "2015-10-24T15:17:00.000+03:00", "crawled": "2015-10-24T20:21:06.404+03:00", "highlightTitle": ""}