{"organizations": [], "uuid": "d7133eea456b2cc3a8b61e8bac4c27e1b11c6fca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cleveland.com", "main_image": "http://imgick.cleveland.com/home/cleve-media/width620/img/plain-dealer/photo/2015/07/09/18285780-large.jpg", "site_section": "http://www.cleveland.com/outdoors/", "section_title": "Ohio Hunting, Fishing, Outdoor Sports | The Great Outdoors - cleveland.com ", "url": "http://www.cleveland.com/tribe/index.ssf/2015/10/jason_kipnis_in_a_much_better.html", "country": "US", "title": "Cleveland Indians second baseman Jason Kipnis in a much better place than a year ago", "performance_score": 0, "site": "cleveland.com", "participants_count": 1, "title_full": "Cleveland Indians second baseman Jason Kipnis in a much better place than a year ago | cleveland.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T14:00:00.000+03:00", "replies_count": 0, "uuid": "d7133eea456b2cc3a8b61e8bac4c27e1b11c6fca"}, "author": "Zack Meisel, Northeast Ohio Media Group", "url": "http://www.cleveland.com/tribe/index.ssf/2015/10/jason_kipnis_in_a_much_better.html", "ord_in_thread": 0, "title": "Cleveland Indians second baseman Jason Kipnis in a much better place than a year ago", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CLEVELAND, Ohio -- Jason Kipnis no longer sees a wildfire when he peeks at his rear-view mirror.\nThe Indians' second baseman suffered through a miserable 2014 campaign. Then, when the off-season arrived, Kipnis couldn't catch a break.\nFirst, he dropped a 45-pound weight on his left ring finger, a mishap that required surgery. Later, he ate some bad sushi and was stricken with food poisoning at the end of a vacation to Punta Cana and on his flight back to the U.S. Then, he was summoned for jury duty.\nAll of that came after he posted a .240/.310/.330 slash line while he dealt with a balky hamstring and a barking oblique muscle.\nKipnis is much more energized and upbeat now than he was a year ago at this time. It helps that he set the league ablaze in May, when he compiled a .429/.511/.706 clip and captured the American League Player of the Month award. That set the tone for his season, during which he hit .303 with an .823 OPS and served as the primary catalyst for a lineup that could have used a couple of Kipnis clones.\n\"When he's going, we're a different team,\" said Tribe manager Terry Francona. \"And it was fun to watch him this year because he came back with a vengeance. I think that's probably the best way to put it. And he did that. And when we needed a leadoff hitter, he jumped in and took it and ran with it.\"\nThe Indians can't afford to watch Kipnis endure another season that bears resemblance to his 2014 showing. They need more of the 2015 version, the offensive spark plug and clubhouse captain.\n\"In our exit meeting with him,\" Francona said, \"we told him, 'We need you to be that player.' And he understands that. I think he relishes it.\"\nKipnis battled a shoulder ailment toward the end of the summer, so the Indians have designed a training regimen to target that area. He'll work with a trainer in his hometown of Chicago to keep the region strong and capable of lasting through eight months of daily wear and tear.\n\"You can't downplay how important being healthy is,\" Kipnis said. \"To not be compensating for anything, whether it's a leg injury or an oblique or whatever it is -- that'll be in the back of your mind the whole time if it's there.\"\nKipnis clubbed only nine home runs in 641 plate appearances in 2015. Last year, he socked only six long balls. Two years ago, he tallied a career-high 17 homers. Power is far from his top priority now, especially since Francona slotted him into the leadoff spot. Therefore, Kipnis said he isn't looking to bulk up over the winter.\n\"I'm not trying to become a different player over the winter. I'm not trying to put on weight to hit home runs. I'm trying to get ready for a season, and I think that's the best way to go about things. I'm working on flexibility, agility work. That's the type of player I need to be in order to be successful, so I'm not fighting it anymore, I guess.\"\nYour browser does not support iframes.\nIt worked in 2015. Kipnis led the Tribe in runs, hits and triples. He totaled 43 doubles, the third-highest total in the majors.\n\"In the big picture, I'm happy the way the season went,\" Kipnis said. \"I kind of feel like it's going through 2013 again, where you had a good season, and now, how are you going to build on that? The injuries last year, it just wasn't a good year last year. Things didn't go my way, but now I get a second chance to do something like that, and I can train a little smarter and harder, and hopefully I've learned some things from that time and get better for next year.\"\nThe Indians inked Kipnis to a six-year, $52.5 million pact in April 2014. He'll earn $6.2 million next year, $9.2 million in 2017, $13.7 million in 2018, $14.7 million in 2019 and, potentially, $16.5 million in 2020 -- the Indians hold a team option for the final year, or they can pay him a $2.5 buyout.\nNo longer is Kipnis one of the young, inexpensive up-and-comers. The Indians need him to play like a franchise cornerstone. It helps that he replaced memories of aching muscles, harmless grounders to second, a throbbing finger, a nauseous stomach and the sound of a courtroom gavel with his second career All-Star season.\nFinally, he has something to build upon.\n\"I'm healthy going into the off-season,\" Kipnis said. \"That's what I'm excited about. Hopefully no re-racking-a-weight injury or anything like that -- knock on wood. I'm excited to get a rest here for a little bit, then have a full, healthy off-season.\"", "external_links": ["http://m.mlb.com/shared/video/embed/embed.html?content_id=499611983&topic_id=8878836&width=400&height=224&property=mlb"], "published": "2015-10-16T14:00:00.000+03:00", "crawled": "2015-10-16T13:54:24.467+03:00", "highlightTitle": ""}