{"organizations": ["Tigers Head Coach Rich Morgan", "NFL", "Western Branch", "Chicago Bears", "Tigers", "Oscar Smith Tigers", "Cameron Luster", "Philadelphia Eagles", "Western Branch Bruins", "Hickory High School", "Lake Taylor", "Oscar Smith Wins Another Thriller Oscar Smith Wins Another Thriller Matthew Hatfield VirginiaPreps.com Senior Writer Tigers Top Bruins", "Bruins"], "uuid": "1eba4ee920468d9dfcb6173248d4b71ce31aadca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "virginiapreps.rivals.com", "main_image": "", "site_section": "http://www.rivals.com/rss2feed.asp?type=HS&state=VA", "section_title": "Virginia High School Sports Headlines", "url": "https://virginiapreps.rivals.com/content.asp?CID=1814982", "country": "US", "title": "Oscar Smith Wins Another Thriller", "performance_score": 0, "site": "rivals.com", "participants_count": 0, "title_full": "Oscar Smith Wins Another Thriller", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T22:36:00.000+03:00", "replies_count": 0, "uuid": "1eba4ee920468d9dfcb6173248d4b71ce31aadca"}, "author": "", "url": "https://virginiapreps.rivals.com/content.asp?CID=1814982", "ord_in_thread": 0, "title": "Oscar Smith Wins Another Thriller", "locations": ["Chesapeake", "Beard-DeLong-Easley Field", "Nansemond River", "Indian River"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Tommy Powell", "Smith", "Bryant", "Oscar Smith", "Artis", "Keith Bryant", "Josh Gray", "Keshon", "Larry Chapel", "Junior Larry Chapel", "Keyvone Bruton", "Jahmeek Jones", "PAT Dudek Mitchell", "Mitchell", "Kourtney Johnson", "PAT Dudek Bryant", "Clint Marshall", "Shon Mitchell", "Deshawn Freeman", "DeAngelo White", "V. I. P.", "D.J. Lanier", "Morgan", "PAT Dudek Byrd", "Brandon Byrd", "Greg Gibson", "Byrd", "Keshon Artis", "Ben Dancy", "Gibson", "Grassfield", "Tavante Beckett", "Dedrion Bacote"], "text": "Oscar Smith Wins Another Thriller Matthew Hatfield VirginiaPreps.com Senior Writer Tigers Top Bruins in the Fog: It has been a hectic past week for the Oscar Smith Tigers. Last Saturday, they scored 13 points in the game's final four minutes to stun Indian River, 15-14, in front of a packed house at Hickory High School in Chesapeake. Related Links: Talk about it in V. I. P. - 'MEMBERS ONLY' CLUB On Friday night, it was Homecoming at Beard-DeLong-Easley Field, and the visiting Western Branch Bruins had ideas of spoiling the festivities. Once again, the Tigers rallied in the fourth quarter, scoring the go-ahead touchdown with under five minutes to play to edge the Bruins, 23-21. Amidst fog reminiscent of the crazy playoff game between the NFL's Philadelphia Eagles and Chicago Bears, Oscar Smith pushed its record to 6-0 overall on the season while extending their Southeastern District winning streak to 79 games. \"I was going to tell my kids about it, but they wouldn't know what the heck I was talking about,\" quipped Tigers Head Coach Rich Morgan about the playoff game on New Year's Eve in 1988. \"Their parents would know, but they wouldn't know what it was.\" With 9:45 to play in regulation, Western Branch took the lead on junior Brandon Byrd 's five-yard touchdown run. That had the Tigers trailing 21-17, and they would end up punting on their next series, but would soon get the ball back after the defense forced a three-and-out. Oscar Smith took advantage, going ahead on junior Shon Mitchell 's 17-yard touchdown pass to senior receiver Josh Gray . However, the Tigers couldn't tack on an extra point, leaving them with a two-point lead. Western Branch proceeded to drive down the field, all the way to the Oscar Smith 14-yard line with under two minutes to play. That's when sophomore linebacker Keshon Artis made a tackle on Byrd for no gain. \"We were just trying to stop them and hold them without getting a first down. My other linebacker, Dekireon [ Turner ], was calling out all the plays they were going to run, left or right,\" said Artis following his 11th - and clearly biggest - stop of the night.\" \"This win shows a lot about Smith. We came out and executed. We don't give up and we fight until there are zeros on the scoreboard.\" Prior to the stop, Western Branch converted all three of their fourth down tries. \"There aren't any moral victories in football. We had a chance. We're moving down and we either score or I set it right in the middle of the field for a chip shot field goal. Maybe he makes it, maybe he misses it. We've been moving the ball all night. We pride ourselves on we're going to go for it any chance we get,\" stated Bruins Head Coach Greg Gibson , whose team has suffered three losses by eight points or less this year. \"I'm the Head Coach and I make the decision. I looked at it as that gives us the best opportunity. If we blocked #2 ( Artis ) on the back-side, he probably scores right there. We missed a blocking assignment because we had the front-side all blocked up and he ran in the backfield and made a tackle.\" With two thrilling finishes against quality foes this month, the Tigers have shown their mettle. While they still have tests before closing out the regular season against playoff hopefuls King's Fork and Grassfield , it has been a defining stretch for a team full of sophomores and juniors starting for the first time on the varsity level. \"My guys, tremendous toughness and resiliency to come back, keep going and getting some key stops in the second half when we needed them,\" Morgan added. \"We made some adjustments at half-time with the defense. The kids took those adjustments, put them into action and we gave up only one touchdown in the second half. I'm very proud of them and the way we won. Bryant 3-yard run, PAT Dudek Bryant 4-yard run, PAT Dudek Byrd 5-yard run, PAT Dudek Mitchell Directs Quick Strikes: As Western Branch used a grind-it-out, methodical approach, Oscar Smith didn't take long to score its first two touchdowns, doing so in 2:34 and 2:46. The three-year starting signal caller began 8-of-8 on the night before finishing 17 of 27 for 196 yards with a pair of touchdowns. Maybe best of all, no interceptions and clutch down the stretch. \"Shon Mitchell was on the money with everything he threw. He's a really good quarterback and now it's time for him to be able to put the offense on his back and drive the field like he did tonight. \"The offense really came through for us. We dropped a couple that we should've caught. Junior Larry Chapel was Mitchell's main target with seven receptions for 94 yards and a score. \"We felt our offense would have a great opportunity to put some points up on the board,\" Mitchell said. \"We also knew with their offense, that type of Wing-T, that they're going to milk the offense. Bruins Answer Back: Oscar Smith opened with a seven-play, 57-yard drive capped by Kourtney Johnson 's five-yard touchdown run. But Western Branch wouldn't be daunted, piecing together two extremely long, time-consuming scoring drives that saw junior running back Keith Bryant get in the end zone. The first was a 19-play, 79-yard drive that took 9:41 off the clock. On the night, the Bruins ran for 263 yards on 54 attempts with five different ball carriers. Bryant led the way with 24 attempts for 152 yards and a pair of scores, while Byrd chipped in 73 yards and a score on 20 touches. Their offensive line with junior Clint Marshall , senior D.J. Lanier , junior Ben Dancy , senior Deshawn Freeman and junior Tommy Powell \"Western Branch, great effort on their part. It's hard to simulate their physicality in practice. \"They lost two games in the mud and the rain. When you're running that offense and you're tossing the ball around, you're going to have fumbles. Western Branch committed 14 turnovers, 10 lost fumbles and four interceptions, through the first six games. Delivering on Special Teams: One of the aspects that was instrumental in Oscar Smith's win over Indian River was special teams, getting a blocked punt for a safety from Jahmeek Jones and the amazing 59-yard punt return for a touchdown from DeAngelo White . Yet again, special teams aided a Tigers victory. White, a speedy sophomore, racked up 91 yards on three kickoff returns in the first half, plus had a 28-yard return in the third period. \"Deangelo's special teams effort really put us in great position to score quick ,\" acknowledged Morgan. \"People might start pooch kicking or things like that, but Larry Chapel is back there too, and he's fast. And Sky'Keem Hussey is fast. There are a lot of weapons back there. Whatever people do, we've got to adjust and counteract.\" In the second half, Oscar Smith broke a 14-all tie with Cameron Luster 's 22-yard field goal. New Stars at LB: Much was made about the Oscar Smith defensive departures in the off-season, primarily linebacker Tavante Beckett (Indian River), safety Keyvone Bruton (Lake Taylor) and defensive end Dedrion Bacote (Ocean Lakes). However, new faces are emerging as names to know in the Tigers' starting lineup, performing at a high level under the bright lights. Artis is one of them, for example. The tenth grader missed three straight games after suffering a broken leg in the opener vs. Nansemond River, according to Morgan. Though clearly limited in his return against Indian River, Artis made his presence felt against the Bruins. \" Keshon's a beast. Tonight, he came out and proved, 'when I'm healthy, look out.' He's awesome,\" Morgan said of Artis . \"Last week, Dekireon Turnerwas the leading tackler in the game with 12 tackles. Great players, they're really coming into their own, getting to that Oscar Smith legacy now and they'll be back.\" Tough Finish: Now 3-4 overall, Western Branch's playoff hopes are very much in doubt in 6A-South. They've qualified for the postseason in each of the previous three seasons under Gibson, advancing to the second round twice. How the Bruins respond will be pivotal. Even though they out-gained Oscar Smith 263-260, the final margin is what will be remembered most. \"We pushed them all up and down the field and I told them that tonight you saw what type of football team you are,\" Gibson remarked. \"They showed grit and #2 made a great play. But at the end of the day, we didn't get the job done on fourth-and-2. It was a fantastic football game. Hats off to them.\"", "external_links": [], "published": "2015-10-17T22:36:00.000+03:00", "crawled": "2015-10-18T12:06:52.013+03:00", "highlightTitle": ""}