{"organizations": ["Columbia", "Tuolumne County Board of Supervisors", "Integrated Regional Water Management"], "uuid": "cb5f0a715dfb801bf4671a5897cb9b8bcf039a2c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.uniondemocrat.com", "main_image": "", "site_section": "http://feeds.feedburner.com/UnionDemocrat", "section_title": "The Union Democrat, Sonora, CA News, Sports, & Weather", "url": "http://www.uniondemocrat.com/index.php?option=com_content&task=view&id=117811&Itemid=199", "country": "US", "title": "TUD makes case for rate increase", "performance_score": 0, "site": "uniondemocrat.com", "participants_count": 0, "title_full": "TUD makes case for rate increase", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T04:00:00.000+03:00", "replies_count": 0, "uuid": "cb5f0a715dfb801bf4671a5897cb9b8bcf039a2c"}, "author": "", "url": "http://www.uniondemocrat.com/index.php?option=com_content&task=view&id=117811&Itemid=199", "ord_in_thread": 0, "title": "TUD makes case for rate increase", "locations": ["Sonora", "Cuesta Heights", "Jamestown", "Phoenix Reservoir", "Phoenix Lake Reservoir"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Erik Johnson", "Ron Ringen", "Guy McCarthy", "Lisa Westbrook", "Rodefer", "Karl Rodefer", "Alex MacLean", "Dave Andres", "Andres"], "text": "TUD makes case for rate increase TUD makes case for rate increase By Alex MacLean, The Union Democrat October 09, 2015 01:00 am A photo from July 2015 shows reeds and other vegetation crowding an edge of Phoenix Reservoir, a key water storage facility for Tuolumne Utilities District. A proposed TUD rate increase would help pay for a project to expand storage capacity at the reservoir by 300 acre-feet. Guy McCarthy / Union Democrat, Copyright 2015. Some of Tuolumne Utilities District’s water pipelines are 80 years old, its water tanks serving Columbia and Sonora are falling apart, and the total backlog of needed projects has reached an estimated $70 million. However, the cash-strapped district this year budgeted nothing for projects to upgrade the aging infrastructure. District officials say one problem is that the service rates — which are among the lowest in the region — have not kept up over the years with rising maintenance and operating costs, inflation and changing regulations imposed by the state. “If we don’t get our rates increased, we won’t be able to do any of the project’s we’re currently proposing to do,” Interim TUD General Manager Dave Andres told the Tuolumne County Board of Supervisors on Tuesday. A series of community forums beginning next week will give the public a chance to weigh in on TUD’s plan for raising water and sewer rates over the next five years to help cover operating costs and pay for capital improvements. The district has put together a detailed, five-year plan to invest a total of about $21 million into TUD’s water and sewer systems. It marks the first time the district has prepared such a plan to address the infrastructure, according to TUD board member Ron Ringen. The district is proposing to increase rates to generate an additional $4.5 million per year. Andres said revenues are generally about $9.8 million per year with the existing rates, though the district is struggling to keep up with operating costs alone. Most of TUD’s residential water customers — about 9,000 of the district’s 14,000 connections — would see their monthly bill increase by about $14 in 2016, or about 50 cents more per day. An average residential customer’s monthly water bill would increase by about $5 each year after 2016 under the proposed five-year rate plan. In other words, a customer currently paying $45.38 per month for water would be paying $81.50 per month by 2020. The district’s approximately 6,000 sewer customers would see their monthly bills go up about $4 by 2016, and $3 each year thereafter through 2020. The current monthly rate is $35.59, which would go up to $51 by 2020. “We’ve looked at trying to structure our rates over a five-year period so our customers won’t be hit all up front with the immediate high rate increase,” Andres said. “Although, it’s still a robust rate increase.” The district will still need to seek additional funding through state grants or loans to accomplish all of its goals. TUD has obtained about $15 million in grants over the past 10 years. However, the district’s existing rates are too low to qualify for many state funding programs. Most require a district to charge at least 1.5 percent of the area’s median income. Andres said the proposed rates would allow TUD to qualify for the programs. District 5 Supervisor Karl Rodefer said the rate increase is needed, if for no other reason, to qualify for the outside funding, which would bring tax money back to the area. “That’s a way all of us government agencies get to fund some of our higher-ticket items,” he said. One of the projects outlined in the proposed five-year capital improvement plan is to expand the capacity of Phoenix Lake Reservoir, which serves as the primary source of drinking water for Sonora, Jamestown, Scenic View and Mono Vista. Currently, the reservoir can only hold about 600 acre-feet of water. The plan is to remove 435,000 cubic yards of sediment and dirt that would expand the capacity to 900 acre-feet. A single acre-foot can serve about two households on average for an entire year. The project has received $5 million in funding through the state’s Integrated Regional Water Management program, but TUD would need to come up with $1.1 million in matching funds for it to proceed. Other projects include a $2.7 million water tank in Cuesta Heights to replace three tanks in poor condition that serve the Columbia and Sonora water systems. Another $1 million project would replace nearly one mile of old water pipelines in the City of Sonora, some sections of which are 40 years overdue for replacement. In 2014, the district responded to more than 672 water line breaks throughout the system. District Engineer Erik Johnson said the upcoming community forums will be tailored to address specific projects that will benefit each area. “If people could see your pipes like they could see our roads, people would stop calling me about potholes and they’d start calling your board about rust and corrosion,” Rodefer said. “This rate increase is necessary … I sure hope the public gets behind this, or at least gets out of the way of it.” Under state law, public agencies that charge rates for services are required to go through a process to notify all customers in their coverage area of a proposed increase. A proposed rate increase cannot be implemented if a majority of customers file a formal written protest. TUD spokeswoman Lisa Westbrook said the notices have been mailed out to customers, but they are also available online at www.tudwater.com.  ", "external_links": [], "published": "2015-10-09T04:00:00.000+03:00", "crawled": "2015-10-10T08:03:53.638+03:00", "highlightTitle": ""}