{"organizations": [], "uuid": "6190fd7769782a30469d86efd689e649668b90da", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.abqjournal.com", "main_image": "http://main.abqjournal.netdna-cdn.com/wp-content/uploads/2014/04/a01_jd_30apr_shocknew1-400x275.jpg", "site_section": "http://www.abqjournal.com/", "section_title": "Albuquerque and New Mexico News, Sports, Business and more | Albuquerque Journal News", "url": "http://www.abqjournal.com/659313/biz/biz-most-recent/new-hearing-on-san-juan-begins.html", "country": "US", "title": "New hearing on San Juan begins", "performance_score": 0, "site": "abqjournal.com", "participants_count": 1, "title_full": "New hearing on San Juan begins | Albuquerque Journal News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T23:46:00.000+03:00", "replies_count": 0, "uuid": "6190fd7769782a30469d86efd689e649668b90da"}, "author": "Kevin Robinson-Avila / Journal Staff Writer", "url": "http://www.abqjournal.com/659313/biz/biz-most-recent/new-hearing-on-san-juan-begins.html", "ord_in_thread": 0, "title": "New hearing on San Juan begins", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A new hearing on the future of the coal-fired San Juan Generating Station near Farmington began at the New Mexico Public Regulation Commission on Tuesday and could last up to two weeks.\nThe hearing will examine the costs and benefits of an agreement that plant co-owner and operator Public Service Co. of New Mexico signed in August with environmental groups, the Attorney General’s Office and the PRC’s utility division staff. That agreement calls for PNM to shut down two of the plant’s four generating units and install pollution controls on the remaining ones to meet federal mandates to reduce haze from the plant. It also allows PNM to absorb more capacity from departing plant co-owners in one of the units that will remain operating, something most environmentalists and clean energy advocates had previously opposed.\nTo win their support, PNM agreed to a new PRC review of San Juan in 2018 to determine whether more or all of it should be shut down after 2022. That’s when the current partnership among plant co-owners expires and PNM’s coal supply contract for the facility comes to an end. PNM also agreed to lower ratepayer costs for nuclear energy to replace lost coal generation and to support more renewable energy development in the next few years.\nBut one environmental group, New Energy Economy, remains opposed, advocating instead for the immediate closure of more, if not all, of San Juan, and procurement of more solar and wind generation to replace lost coal. At the hearing, New Energy will question PNM executives about the costs and benefits of its plan.\n“The question is, is the plan cost effective and in the public interest? We say ‘no,'” said New Energy Executive Director Mariel Nanasi. “We believe there are much better alternatives for ratepayers, the environment, public health and jobs.”\nPNM estimates its plan would raise customer rates by 2 to 3 percent starting in 2018, or about $2 per month more for the average residential consumer.\n“We are grateful to have this opportunity to further demonstrate to the commission that the PNM plan is the best, most cost-effective way to address federal environmental regulations while protecting the economy of the Four Corners region and the state,” PNM spokesman Pahl Shipley said.\nSteve Michel of Western Resource Advocates, which supports the plan, said the agreement provides the best path forward for now on San Juan, since half the plant is closing and more units could be shut in a few years.\n“Environmentalists are not always in lock-step on how to best achieve the environmental goals we all agree on,” Michel said regarding New Energy’s opposition. “This is a situation of tremendous importance with a strong difference of opinion on how to get the best environmental outcome.”\nStill, notwithstanding the hearing, it’s unclear when, or even if, the PRC can make a final decision on San Juan. The New Mexico Supreme Court ordered commissioners on Friday to temporarily refrain from new proceedings in the case until the court reviews New Energy allegations that four of the five commissioners have demonstrated bias in PNM’s favor and should be recused. The current hearing is proceeding because it’s a lower-level function presided over by a hearing examiner, who will later make a recommendation to commissioners about San Juan.", "external_links": [], "published": "2015-10-13T23:46:00.000+03:00", "crawled": "2015-10-14T07:43:35.343+03:00", "highlightTitle": ""}