{"organizations": ["Norfolk State", "Rutgers"], "uuid": "5f99ba4ce5b609ba94d55cd63d8d5e58a7fdc028", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mycentraljersey.com", "main_image": "http://www.gannett-cdn.com/-mm-/eae89120dd9979ff647cc32f8545c76df8d51b89/c=0-9-2811-1597&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/07/NJGroup/AsburyPark/635798586441257638-Carroo.jpg", "site_section": "http://rssfeeds.mycentraljersey.com/bridgewater/sports", "section_title": "Bridgewater - Sports", "url": "http://www.mycentraljersey.com/story/sports/college/scarlet-scuttlebutt/2015/10/08/rutgers-star-leonte-carroo-speaks-for-first-time-since-assault-charge-later-dropped/73597848/", "country": "US", "title": "Carroo 'blessed' to be back with Rutgers, points to character", "performance_score": 0, "site": "mycentraljersey.com", "participants_count": 0, "title_full": "Carroo 'blessed' to be back with Rutgers, points to character", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T00:31:00.000+03:00", "replies_count": 0, "uuid": "5f99ba4ce5b609ba94d55cd63d8d5e58a7fdc028"}, "author": "", "url": "http://www.mycentraljersey.com/story/sports/college/scarlet-scuttlebutt/2015/10/08/rutgers-star-leonte-carroo-speaks-for-first-time-since-assault-charge-later-dropped/73597848/", "ord_in_thread": 0, "title": "Carroo 'blessed' to be back with Rutgers, points to character", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Leonte Carroo", "Ryan Dunleavy", "Noah K. Murray-USA"], "text": "Carroo 'blessed' to be back with Rutgers, points to character Ryan Dunleavy , @rydunleavy 5:31 p.m. EDT October 8, 2015 Rutgers wide receiver Leonte Carroo scored three touchdowns in the season-opener against Norfolk State. (Photo: Noah K. Murray-USA TODAY Sports) 28 CONNECT 6 TWEET LINKEDIN COMMENT EMAIL MORE \nPISCATAWAY As Leonte Carroo tries to move beyond a simple-assault domestic violence charge, he will rely on what he believes is a track record of good character. \nThat was the theme of the message from the Rutgers football star Thursday as he spoke to media for the first time since he was arrested and charged following a Sept. 12 incident allegedly involving his mother, his girlfriend and a woman with whom he formerly was romantically involved. \nThe charge was dismissed Tuesda y after he and the woman who accused him of slamming her into concrete reached an agreement of mutual restraint. \n“This was a very serious matter, and I don’t take any of this for granted,\" Carroo said after his first time back on the practice field. \"I’m just blessed to be back out here. After speaking with my family and friends and teammates, I understand that this is a blessing. \n\"I am very lucky and fortunate, but like I said, this was a very unfortunate event. For me to be able to be back out here practicing today and play in an eight-game stretch, I’m very excited about it.” Leonte Carroo reinstated by Rutgers football \nCarroo, who was reinstated to the program on Wednesday, declined to discuss his actions or line of thinking leading up to the incident. \n“Respectfully, I don’t want to get into details of what happened that night,\" Carroo said. \"I’m just happy it’s behind me, and I’m happy I’m back out here with my teammates.” \nRutgers' career leader in touchdown receptions (22) missed two games while on indefinite suspension but is cleared to return to action Saturday against No. 4 Michigan State. \nCoach Kyle Flood reinstated Carroo after he \"agreed to the conditions of his reinstatement and after he accepted the responsibility that comes with his return to the team,\" according to a statement from Rutgers athletics. \nFlood is prohibited from speaking to media while serving his own unrelated three-game suspension. Carroo declined to address the conditions of his reinstatement but said he would take them \"seriously to make sure they are well in effect\" and use the second chance as an opportunity to get better. \n“I knew I was going to play again,\" Carroo said. \"The type of character I have, and me knowing this event and how unfortunate it was, I just knew I had to be patient and wait. \n\"But Coach Flood is a great guy. I just knew one day I would be back on this team. I had to be patient, and unfortunately the legal process is slow.\" Fight involving Rutgers' Carroo caught on camera \nCarroo participated in a walk-through Thursday, then changed out of his practice gear and into a scarlet Rutgers polo shirt. The normally outspoken star stood in front of cameras and about a dozen reporters and spoke for about six minutes, including making an opening statement. \n“First, I would like to thank Coach Flood, my family and friends for my opportunity to be back on the team,\" Carroo said. \"I’m relieved that the case is behind me and it’s dismissed. I’m just happy to be back out here with my teammates and ready to go.” \nA highly regarded NFL Draft prospect, Carroo now has a domestic violence charge attached to his name as he builds toward a league forced to take such issues very seriously . \nCarroo's attorneys said he never touched the woman, who worked as a recruiting ambassador for Rutgers athletics at the time. \n“I’m just hoping that the NFL scouts and coaches know what type of character I have,\" Carroo said. \"They can speak to my elementary school teacher, middle school teacher. I’ve been a really good kid growing up. They can talk to my family and friends. \n\"Those people know what type of character I have. Since I’ve been out, Facebook, any type of social media, people have been making comments and really supporting me. They know what type of guy I am, and hopefully the NFL scouts will know, too.” \nIt is not known how big a role Carroo will play Saturday after missing the early stages of game planning, though he is the team's best playmaker. He had 1,000-yard season as a junior and scored three touchdowns in the season opener. \n\"This is the game that I love, that I’ve been playing since I was a little kid,\" Carroo said. \"Me just not being here with my teammates is what hurt me the most.\" Suspended Rutgers star Leonte Carroo: I will never make this mistake again \nCarroo also missed the first half of the season opener when he was suspended for a violation of team curfew, his first known misstep. \n\"I'm very confident in his ability to lead,\" interim head coach Norries Wilson said. \"He’s made some mistakes. He’s not perfect. And he’s stepped up and owned up to his mistakes. That’s behind him now, and we’re going to go forward now and just take it day by day.’’ \nIn order to stay in shape, Carroo said, he worked out with friends during his absence from team activities, and he had his iPad with him at home so he could watch game film and stay mentally sharp. \n\"I felt pretty comfortable out here,\" Carroo said. \"Some of my coaches said it looks like I didn’t lose a step.” \nWhat did his teammates say about the return of one of their four co-captains? \n\"What made me the most happy was the comfort from my teammates,\" Carroo said. \"As soon as I got back in the locker room they were going crazy, they were happy, showing me nothing but support out here on the field today, making sure I lined up correctly and little things like that.\" \nStaff Writer Ryan Dunleavy: rdunleavy@gannettnj.com 28 CONNECT 6 TWEET LINKEDIN COMMENT EMAIL MORE Read or Share this story: http://on.app.com/1Lk8ieI TOP VIDEOS", "external_links": [], "published": "2015-10-09T00:31:00.000+03:00", "crawled": "2015-10-09T01:48:44.330+03:00", "highlightTitle": ""}