{"organizations": [], "uuid": "95150571199e3786a927c4c162601f7329964861", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.operationsports.com", "main_image": "", "site_section": "http://www.operationsports.com/rss.xml", "section_title": "Operation Sports", "url": "http://www.operationsports.com/feature.php?id=2355", "country": "US", "title": "NBA 2K16: Throwback Thursday Card Reviews", "performance_score": 0, "site": "operationsports.com", "participants_count": 1, "title_full": "NBA 2K16: Throwback Thursday Card Reviews", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T17:05:00.000+03:00", "replies_count": 0, "uuid": "95150571199e3786a927c4c162601f7329964861"}, "author": "MMChrisS", "url": "http://www.operationsports.com/feature.php?id=2355", "ord_in_thread": 0, "title": "NBA 2K16: Throwback Thursday Card Reviews", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Guest Post By Robby Haught, Two Brothers Gaming \nEvery week in NBA 2K16’s My Team mode, there are Throwback Thursday cards released with specific players’ highlight seasons. Each week here on Operation Sports, I’ll be highlighting these players and showing you stats, badges, individual attributes, and everything related to each player. If you pull one of these cards, you’ll know what to do with them! \n***NOTE*** The two videos reviewing the players are: NBA 2K16 My Team Throwback Player Quick Reviews - Ray Allen Luis Scola Joe Johnson Shawn Marion: https://www.youtube.com/watch?v=9CeO5uNCsQo NBA 2K16 My Team Throwback Player Quick Reviews - Steve Nash David Lee Al Jefferson Raymond Felton : https://www.youtube.com/watch?v=JGiM-0uBfVg \n2003 Steve Nash, Dallas Mavericks \nNash comes in at an 85 overall in-game, having averaged 17 points and 7 assists per game on the way to an All-Star berth. His Phoenix Suns card will come out later in the year and be better, but this isn’t a bad one to start. There are other point guards rated better overall in the game, but Nash specializes in playmaking and shooting. Defensively, you’ll need to hide him. Wait until his value goes down, then snatch him up. He’ll help you run your fast break, but sub him out or switch his matchups accordingly if you’re going against an athletic point guard. \n2010 David Lee, New York Knicks \nLee’s All-Star season came in 2010 with the Knicks, where he averaged 20 points and 11 rebounds per game in a lost season for New York. Lee wouldn’t make a bad Domination player with his post skills and rebounding, but I’d shy away from using him in Road to the Playoffs. He’ll have defensive issues. \n2009 Al Jefferson, Minnesota Timberwolves \nJefferson has never been an All-Star in the league, but he was close with the Timberwolves in 2009, putting up 17 points and 9 rebounds per game. This is another good player to grab off the auction block for Domination. Jefferson possesses one of the best post games in the league today, and he’ll get you plenty of MT because of it . \n2007 Raymond Felton, New York Knicks \nFelton’s best season as a pro came with the Knicks during the 2007 campaign. He put up 14 points and 7 assists per night in one of his better seasons. Felton won’t get used much in My Team. Those that do use him will do so at a discount, though, as his price is likely to drop because of his current NBA situation as a backup. \n2013 Ray Allen, Miami Heat \nAllen’s last two seasons in the NBA showed he still had plenty in the tank, but his percentages from beyond the arc did dip slightly. That’s reflected in the 2013 card, but it may work to your advantage. Since Allen is a Silver player, he’ll be useful in Challenges and the early seeds of Road to the Playoffs. Pick him up for what he does best –shooting! \n2008 Luis Scola, Houston Rockets \nLuis Scola has always brought toughness and grit to the teams he’s played on, but that doesn’t necessarily translate into NBA 2K16. He averaged nearly a double double in the season reflected on the card, but he’s another player that won’t be used much due to his style of play. He’s got a solid low post game, but will be outmatched by bigger, more athletic power forwards when online in Road to the Playoffs. \n2005 Joe Johnson, Phoenix Suns \nJoe Johnson had an outstanding 2005 season for the Suns, and he shot better from the three point line than inside it. With shooting ability like this, fans may forgive his notoriously slow jump shot in game and give him a shot, as his 47% three point percentage in 2005 translates into a 92 standing shot three rating. Spot Johnson up and let him knock it down. He’ll be able to get his shot off too as an oversized shooting guard with playmaking ability . \n2005 Shawn Marion, Phoenix Suns \nShawn Marion put up ridiculous numbers as a member of the Suns, registering 21 points and 11 rebounds per night while making 52% of his field goal attempts. Don’t let his funky shot release scare you. When he’s open, he’ll knock down a three pointer as well, and is an above-average finisher. All in all, Marion may not be the star of your team, but he will do a little bit of everything and help you win games on both sides of the ball. \n2012 Marcus Thornton, Sacramento Kings \nThornton had one season to shine, and it was in Sacramento. He was a scorer, and did his job well in 2012 with 17 points per game. It’s really that simple with him. He’s sixth man material on some teams but will likely get passed up in favor of better overall players quickly. \n\nThat’s it for this week. If you’d like to see the players in-game, be on the lookout for more videos, and if you have any questions I can be reached on Twitter @twobrosgaming .", "external_links": [], "published": "2015-10-12T17:05:00.000+03:00", "crawled": "2015-10-13T04:11:10.033+03:00", "highlightTitle": ""}