{"organizations": [], "uuid": "6771466d72997888600a741fd5f223680d8989d3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattletimes.com", "main_image": "http://www.seattletimes.com/wp-content/themes/st_refresh/img/st-meta-facebook.png", "site_section": "http://seattletimes.com/rss/collegesports.xml", "section_title": "The Seattle Times » Sections » Sports", "url": "http://www.seattletimes.com/sports/uw-husky-football/uw-receiver-jaydon-mickens-cant-watch-the-game-on-pac-12-networks-either/?utm_source=RSS&utm_medium=Referral&utm_campaign=RSS_sports", "country": "CH", "title": "UW receiver Jaydon Mickens can’t watch the game on Pac-12 Networks either", "performance_score": 0, "site": "seattletimes.com", "participants_count": 1, "title_full": "UW receiver Jaydon Mickens can’t watch the game on Pac-12 Networks either | The Seattle Times", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T17:04:00.000+03:00", "replies_count": 0, "uuid": "cb8386ae95597cd5b2f464251de7338f497822a6"}, "author": "Adam Jude", "url": "http://www.seattletimes.com/sports/uw-husky-football/uw-receiver-jaydon-mickens-cant-watch-the-game-on-pac-12-networks-either/", "ord_in_thread": 0, "title": "UW receiver Jaydon Mickens can’t watch the game on Pac-12 Networks either", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Most Saturdays, Washington receiver Jaydon Mickens has his own football game to worry about. He doesn’t usually bother with recording other Pac-12 games on TV.\nBut this weekend, with the Huskies on their bye week, Mickens was hoping to watch Washington State’s game at California. One problem: The game was broadcast on the Pac-12 Networks.\nMickens has DirecTV, which doesn’t carry Pac-12 Networks … which was news to Mickens. So he called his cable carrier Saturday, hoping for an answer.\n“I called Direct and was like, ‘What’s going on? You’re supposed to have all the channels and I’m paying this and what’s going on?’” Mickens said after practice Sunday.”\nMost Read Stories Roads could be a mess this weekend — and Monday Our state’s greatest gift to the nation just got canceled New GM Jerry Dipoto provides more insight into how he’ll turn Mariners around Seven things to know about Seahawks rookie Tyler Lockett Survivor: Gunman spared 'lucky one' to give police message Unlimited Digital Access. $1 for 4 weeks. The Pac-12 and DirecTV hit another snag in negotiations last month and it appears Pac-12 games won’t be broadcast on that carrier any time soon.\n“So I gotta get another cable box … just to watch Pac-12. So that sucks,” Mickens said. “Direct needs to step it up. … I got SEC Network (laughs). I don’t want to watch Georgia! I want to watch Arizona vs. UCLA. I want to watch the teams we’re going to play.”\nAt least he will be able to record his own game Thursday night.\nThe gregarious senior from Dorsey High in Los Angeles will be playing at Los Angeles Memorial Coliseum for the first time Thursday, when the Huskies (2-2, 0-1 Pac-12) play USC (3-1, 1-1) before an ESPN audience.\nMickens grew up a big USC fan — Reggie Bush was his idol — and he was committed to USC for more than a year before ultimately winding up at UW.\n“A lot of stuff happened and it wasn’t for me, at all,” he said of his recruitment.\nA small army of Mickens supporters will attend Thursday night. Each player is allotted four tickets, and he said he’s trying to procure about 80 tickets from teammates. As trade bait, he’s willing to swap his tickets for UW’s Oct. 17 home game against Oregon, among others.\n“Especially with the guys from Washington (who) don’t know anybody in Los Angeles. They even come up to you and are like, ‘Tickets?’ I can give them my Oregon State tickets because it’s like, I don’t think nobody from Los Angeles is coming to Corvallis, Oregon, in late November. You know?” Mickens said. “Hey man, I got much respect for Oregon State, but I don’t think nobody’s coming to that game. We probably gotta be ranked 1 and 2 to get people there. Because that’s going to be cold.”\nThe Trojans, who have opened as a 17-point betting favorite over UW, are doing a lot of the same things Steve Sarkisian ran while coaching the Huskies from 2009-13.\n“Everything they do is familiar to me — returns to blocking schemes to you name it,” Mickens said. “But knowing Coach Sark and knowing his coaching staff, they’re going to throw some curveballs at us. And that’s what type of guy he is and that’s what type of football team he created at that university right now.\n“He’s going to play hard-nosed football; he’s not going to change anything up. Like I said, he might throw some curveballs at you, but they’re going to be ready to play. And they feel that they have something to prove; they feel that they should be a playoff-contender team and we gotta go in there and prove that for ourselves. Because we know we want to be a playoff-conteder team — everybody does. We just can’t let them feel like we’re the underdogs and they’re over us. We gotta go in there and make it a game.”\nAdam Jude : 206-464-2364 or ajude@seattletimes.com ; on Twitter: @A_Jude . Adam Jude is the UW football beat writer for The Seattle Times.", "external_links": [], "published": "2015-10-04T17:04:00.000+03:00", "crawled": "2015-10-05T00:14:20.629+03:00", "highlightTitle": ""}