{"organizations": [], "uuid": "d9a0a8d68aabce75d79f26f991fd87e664158b43", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pendletontimespost.com", "main_image": "", "site_section": "http://pendletontimespost.com//feed/sec/6000/", "section_title": "PendletonTimesPost.com - Sports News", "url": "http://www.pendletontimespost.com/view/story/8cfb8b46ec3a4e33aab472cf00515077/FBC--T25-Utah-Erickson/", "country": "US", "title": "2-time national champ Erickson quietly assisting No. 10 Utah", "performance_score": 0, "site": "pendletontimespost.com", "participants_count": 0, "title_full": "2-time national champ Erickson quietly assisting No. 10 Utah", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T10:18:00.000+03:00", "replies_count": 0, "uuid": "d9a0a8d68aabce75d79f26f991fd87e664158b43"}, "author": "", "url": "http://www.pendletontimespost.com/view/story/8cfb8b46ec3a4e33aab472cf00515077/FBC--T25-Utah-Erickson/", "ord_in_thread": 0, "title": "2-time national champ Erickson quietly assisting No. 10 Utah", "locations": ["Utah"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Dennis Erickson", "KAREEM COPELAND", "Erickson"], "text": "2-time national champion Dennis Erickson quietly working as RB coach for No. 10 Utah By KAREEM COPELAND AP Sports Writer   3:18   3:18   \nPeople: \nFlorida (987) \n\nSALT LAKE CITY — Winning a national championship puts a coach in an exclusive group. Winning multiple titles moves a coach into an entirely different realm. \nTen coaches have won multiple AP national championships since 1970. Nine of those never worked on a staff as anything less than a head coach afterward, according to STATS. \nThe 10th is Dennis Erickson — who is quietly toiling in relative obscurity as the running backs coach for No. 10 Utah. \nThe 68-year-old Erickson is perfectly content despite those on the outside wondering why a man who won two titles at Miami, is the only person named Pac-10 coach of the year at three schools and led two NFL teams would coach running backs at a growing program. \n\"I'm not big on titles or anything like that,\" Erickson said. \"I don't have an ego, basically. I never got into the game or played the game or coached to win a national championship. ... My goal when I was in college was to be a high school coach and that's where I started. I could have been happy doing that all my life because I like being around the players.\" \nErickson's career seemed to be at an end after being fired from Arizona State in 2011. He was named conference coach of the year after going 10-3 in 2007, but that was his lone winning season with the Sun Devils. Erickson used the year after his dismissal to travel and play golf, but that got old in, \"probably about two days.\" So, when Utah's Kyle Whittingham called, Erickson was ready. \nThe two had formed a relationship as fellow Pac-12 coaches, but Erickson didn't make his desire to return known. \n\"I just thought, you know what, I'm going to give Dennis a call and take his temperature and feel it out and see what his mindset would be to get back in,\" Whittingham said. \nErickson certainly was interested. And Utah isn't an odd location for Erickson. He's known for his time in Miami, but is a Seattle native who coached at Montana State, Idaho, Wyoming, Washington State and Oregon State. Erickson was familiar with this part of the country and the league. \nThe original title was co-offensive coordinator along with Brian Johnson, also in charge of running backs. Both were demoted to position coaches after one season when Dave Christensen was named offensive coordinator. \nAgain, it goes back to ego with Erickson — or the lack thereof. He just wanted to coach and be a mentor-type to young coaches. \nErickson's resume speaks for itself, but he was a relative unknown when he replaced Jimmy Johnson at Miami. He had no ties to the area and people wondered how this outsider would recruit Miami and the deep South. Former Hurricane and current North Texas defensive line coach Kevin Patrick said humility is what made Erickson successful. \nMiami musician Luther Campbell remembers looking for a young act he was managing named No Good But So Good during Hurricane Andrew in 1994. Campbell eventually found them living with Erickson because they went to the same school as Erickson's son. \n\"Now he has this house full of black kids out the neighborhood,\" Campbell said. \"I'm like, this is some amazing (expletive). \n\"Coach Erickson will have a conversation with a homeless person. He's just a beautiful person. ... He wasn't no Hollywood guy. No egotistical maniac. He connected with everybody. You know what kind of guy he is? His son probably could have gone to any private school in the city and probably went for free. But his son was at the public school. That's the type of guy he is.\" \nThe 1992 Heisman Trophy-winning quarterback Gino Torretta explained that Erickson had the self-confidence to implement his offensive system at Miami, but also accept input from players who had enormous success under Jimmy Johnson. He even kept Tommy Tuberville as defensive coordinator. \nFormer Florida State coach Bobby Bowden said he's not surprised Erickson is still going. \n\"It's in his blood,\" Bowden said. \"And as you get older, I think there's a tendency to kind of fall back and relax and enjoy life. Do something that you love to do. He's kind of getting up there where you can look back and enjoy what you did and finish up by not having all the pressure you did when you were younger.\" \nThe pressure is gone, but Erickson remains an invaluable member of the Utah staff. He helped develop Devontae Booker into one of the best running backs in the nation and has a bank of knowledge and experience that no other coach on the staff has. \nErickson simply looks at the future one season at a time. He feels healthy and is on a workout regimen, but another head coaching position is out of the question. \n\"Been there, done that,\" Erickson said. \"I've been at the top of the mountain and been at the bottom of the mountain. Long as I have energy and as long as I can do some good things for the University of Utah, I plan on coaching. Who knows? We'll see what happens.\" \n ", "external_links": [], "published": "2015-10-02T10:18:00.000+03:00", "crawled": "2015-10-02T11:52:02.350+03:00", "highlightTitle": ""}