{"organizations": [], "uuid": "171dbde25978d6dbebec1c4361a75d681251f6a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.newtondailynews.com", "main_image": "http://www.newtondailynews.com/images/avatar.png", "site_section": "http://www.newtondailynews.com/?rss=sports", "section_title": "NDN Sports", "url": "http://www.newtondailynews.com/2015/10/22/playing-nhs-sports-is-all-about-character/afp14ix/", "country": "US", "title": "Playing NHS sports is all about character", "performance_score": 0, "site": "newtondailynews.com", "participants_count": 0, "title_full": "Playing NHS sports is all about character", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T19:18:00.000+03:00", "replies_count": 0, "uuid": "171dbde25978d6dbebec1c4361a75d681251f6a3"}, "author": "", "url": "http://www.newtondailynews.com/2015/10/22/playing-nhs-sports-is-all-about-character/afp14ix/", "ord_in_thread": 0, "title": "Playing NHS sports is all about character", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Playing NHS sports is all about character The Pressbox Published: Friday, Oct. 23, 2015 11:18 a.m. CDT • Updated: Friday, Oct. 23, 2015 11:20 a.m. CDT By Jocelyn Sheets Newton Daily News Sports Editor \nCharacter: first, last and always. \nThose words are emblazoned across the wall over the trophy case in the Newton High School football locker room building. \nNo matter what happens Friday night at H.A. Lynn Stadium, the players on the 2015 NHS Cardinal football team and their coaches have embodied those words. They have shown character in the face of adversity this season. \nNot many teams have to work through and around the injuries to starters and backups like Newton has had to this season. A year ago, when everyone was on the Cardinal football bandwagon as the team started 4-0 and made a run into the playoffs, the team was pretty injury-free. \nWhat contributed to the rash of injuries this season? Who knows? \nHas it been just a string of bad luck to a team with many inexperienced varsity players? Is it because the district’s strength and conditioning coach, who many of last year’s athletes pointed to as a strong link to their individual successes, was not retained for the season? Did our players not drink enough milk, eat the right foods or whatever the other schools’ players did? Who knows? \nOne factor we do know — the Newton football players and their coaches never gave up no matter what the score was in a game, no matter what team they were playing against and no matter what their record was this season. That goes from the 16 seniors right through to the freshmen team. There was no dissension in the ranks of the Cardinals as the losses kept coming. \n“There’s been the frustration of the close losses and the couple not-so-close losses, but these kids never quit. They’ve stayed together as a team,” Newton head coach Ed Ergenbright said. “They have shown up and given us maximum effort in practices and in games.” \nErgenbright pointed out this year’s seniors were a big part of Newton’s playoff team in 2014. Bryce Tish and Joseph Banfield have been three-year starters. Dalton Nevels has been a three-year starter on special teams and is this year’s second-leading rusher. \n“Dalton, much like Duncan Lee, plays almost every snap in a game. They don’t come off the field much. Parker Schuster is a senior, who doesn’t get to play much on Friday nights, but comes to practice and does the work to help his team. Andrew Weiland has been asked to play multiple positions for us this season because of the injuries and never complains when we move him,” Ergenbright said. \nErgenbright said these were just examples of how the entire senior class of players has led by example this season. Other seniors on the team are Jacob Smith, Clay Hansen, Jwan Roush, Michael McKinney, Jake Bennett, Cole Peters, Austin James, Grant Nook, Harley Walker and Nick Geerlings. \nA year ago, the Newton High volleyball team only won seven matches and went winless in Little Hawkeye Conference play. In 2015, the Cardinals doubled their match win total and broke through for a win in a conference with two Class 4A ranked teams. \nThe Cardinal volleyball team of 2014 had one senior on its roster. This season there were six seniors on the squad — Fran Lucas, Emily Fitzgerald, Stephanie Hoebelheinrich, Allison Ergenbright, Jessie Smith and Adrienne Bergman — helping the Cardinals move forward. \nMonday, the NHS volleyball team opens Class 4A regional tournament play at home against Grinnell. The Cardinals and Tigers begin play at 7 p.m. in the NHS upper gym. The winner advances to the second round of the postseason. We need to pack the gym with red and black to cheer on the Cardinals. \nNCMP’s Aquagirls go after their third straight North Central Iowa Conference swimming championship Saturday at Grinnell College. Diving competition begins at 10 a.m. and the swimming events begin at 1 p.m. in Grinnell. \nContact Jocelyn Sheets at 641-792-3121 ext. 6535 or jsheets@newtondailynews.com", "external_links": [], "published": "2015-10-23T19:18:00.000+03:00", "crawled": "2015-10-24T07:29:37.224+03:00", "highlightTitle": ""}