{"organizations": [], "uuid": "ccc5382c35a05e0de40de4a725e45cfb001ab9f9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.13abc.com", "main_image": "http://media.graytvinc.com/images/PreciousLIssa.jpg", "site_section": "http://www.13abc.com/", "section_title": "Toledo, Ohio | News, Weather, &amp; Sports | 13abc", "url": "http://www.13abc.com/home/headlines/Complete-strangers-help-a-Toledo-woman-and-her-dogs--330319491.html", "country": "US", "title": "Complete strangers help a Toledo woman and her dogs", "performance_score": 0, "site": "13abc.com", "participants_count": 1, "title_full": "Complete strangers help a Toledo woman and her dogs", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "ccc5382c35a05e0de40de4a725e45cfb001ab9f9"}, "author": "13abc", "url": "http://www.13abc.com/home/headlines/Complete-strangers-help-a-Toledo-woman-and-her-dogs--330319491.html", "ord_in_thread": 0, "title": "Complete strangers help a Toledo woman and her dogs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "TOLEDO (13abc Action News) - A group of volunteers and workers from the Toledo Area Humane Society spent several hours today helping keep a woman and her dogs together.\nAn investigator from the humane society was originally called out to check on the welfare of the dogs ten days ago. The investigator found the dogs were extremely well cared for, all the owner needed was help fixing the backyard fence.\nThis is a great example of people spending just a little time to make a huge difference in someone's world. All it took was a few hours, some power tools and several dedicated volunteers. The two Toledo dogs can now enjoy plenty of playtime outside, without their owner having to worry about their safety\nPrecious and Beauty obviously enjoy running free in the backyard.. Until today, LaShunda Reeves-el says time outside wasn't safe for the two because of problems with the fence, \"The dogs are safe now, they can play and I can go do something else for a little bit . Before I had to stand there and watch them while they were outside to make sure they didn't get over the fence.\"\nLaShunda is disabled and says there was no way for her to make the repairs but she knew how important it was to fix the fence, \"They are my doggie daughters, I talk to them just like kids.\"\nThat's where this group of volunteers and humane society workers comes in. Gary Willoughby is the Executive Director, \"We pulled weeds, trimmed trees, cleaned up the fence, repaired some holes and reinforced and made the fence taller where the dogs could jump out, we just made the area safe for them.\"\nKarin Doriot is one of the volunteers who stepped in to help.,\"It is mission work and it makes me feel good to help someone else, it brings me joy to keep all of them together as a family.\"\nWilloughby says it was rewarding for everyone involved,\"We'd love to see things like this happen more often and not just through the humane society. Neighbors should be helping neighbors, social groups and churches. If everybody looked out for their neighbors in need the world would sure be a better place.\" The yard is now a better place for Precious, Beauty and LaShunda, \"They did all of this out of the kindness of their hearts they didn't get paid. I am so glad they helped me out, this looks very beautiful. It looks like a professional job and I truly appreciate that!\"\nThe entire project took about 3 hours to finish and all the volunteers says seeing the dogs run and play in the yard made it all worth it. By the way, both Precious and Beauty were rescued by LaShunda.", "external_links": ["http://media.graytvinc.com/images/PreciousLIssa.jpg", "http://media.graytvinc.com/images/353*264/PreciousLIssa.jpg"], "published": "2015-10-01T03:00:00.000+03:00", "crawled": "2015-10-02T03:21:32.149+03:00", "highlightTitle": ""}