{"organizations": [], "uuid": "0b10336c636588008d83783300494cf7929bac0f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thedailyjournal.com", "main_image": "http://www.gannett-cdn.com/-mm-/24750a7b7fff2e66ba1822e145ea81c64606d03d/c=0-82-2223-1338&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/02/SNJGroup/CherryHill/635794220069188077-AP-400896870758.jpg", "site_section": "http://rssfeeds.thedailyjournal.com/vineland/sports", "section_title": "Vineland Sports", "url": "http://www.thedailyjournal.com/picture-gallery/sports/2015/10/02/buena-regional-wins-in-the-rain-over-oakcrest-high-school-football/73264602/", "country": "US", "title": "Ending preseason in loss, Flyers have plenty to work on", "performance_score": 0, "site": "thedailyjournal.com", "participants_count": 0, "title_full": "Ending preseason in loss, Flyers have plenty to work on", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T05:37:00.000+03:00", "replies_count": 0, "uuid": "0b10336c636588008d83783300494cf7929bac0f"}, "author": "", "url": "http://www.thedailyjournal.com/picture-gallery/sports/2015/10/02/buena-regional-wins-in-the-rain-over-oakcrest-high-school-football/73264602/", "ord_in_thread": 0, "title": "Ending preseason in loss, Flyers have plenty to work on", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Rich Schultz", "Dave Hakstol", "Dave Isaac"], "text": "Ending preseason in loss, Flyers have plenty to work on Dave Isaac , @davegisaac 10:37 p.m. EDT October 2, 2015 Flyers coach Dave Hakstol has a lot of work to do before the regular season starts next Thursday. (Photo: Rich Schultz, AP) \nNEWARK Unlike the NFL, hockey players actually kind of, sort of like the preseason. \nGame speeds and intensities can’t be replicated in a hockey practice like they can in football. \n“For me it’s better to play as many games as possible,” Flyers right wing Jake Voracek said. \nIt took him five games to score his first goal, which he did on the power play Friday night in a 3-2 shootout loss to the New Jersey Devils in the Flyers’ preseason finale. \nThe work isn’t done, either. There’s a lot to hone in on before the games start counting next Thursday in Tampa. \n“Just the system,” said Voracek, who also had four assists in his five exhibition games. “You always can get better system-wise. It’s always tough games against the Devils, but since the second period, I think we skated a little better and we didn’t play a bad hockey game. I thought we played pretty good. It’s always tough against them. Just gotta make sure we dig in system-wise.” \nEven as the Flyers tried to master rookie coach Dave Hakstol’s new system, their rivalry with the Devils appeared in midseason form early with little action at either side for most of the first two periods. \n“They play good in the defensive zone. They are very tight in the neutral zone,” Voracek said. “I’ve got to be honest, it’s an annoying game. Really, you’ve got to be patient against them. It’s been like that since I got into the league.” \nRyan White got the scoring started with a shorthanded goal, the Flyers’ first of the preseason. He deflected Evgeny Medvedev’s point shot at 11:03 of the second period. \nNew Jersey tied the score with Jiri Tlusty’s rebound goal early in the third period. Jake Voracek untied it 83 seconds later with a nifty move on the power play. Jacob Josefson tied it with 3:31 left on a back-door goal. \n“We had numbers, but we backed off right from the tops of their circles,” Hakstol said. “We gave up too much time and space. Rather than being a little bit more in attack mode inside their blue line not with risky play, but with a good, smart up-ice angle. I thought we gave away too much time and space 120 feet from our net. That makes it tough to defend sometimes when you get back to your end with speed coming at you.” \nThe tying goal was an issue last season, too. Too many times the Flyers gave up late leads and ended up losing in either regulation, overtime or the dreaded shootout, in which Sam Gagner, Voracek and Claude Giroux went 0-for-3 Friday night. \n“We’ve got to bear down,” said goalie Steve Mason, who made 29 saves in defeat. “It’s something that, to a man, we have to be better at and we’re fortunate that it’s preseason. It didn’t cost us any points in the actual standings, but we have to be a better team in the regular season to close the hockey games that we have leads late in the third.” \nAnother thing that handcuffed the Flyers all preseason was faceoffs. They were only 47 percent against the Devils and haven’t been 50 percent in any games in the last two weeks. \n“I feel like our team needs to do better,” Hakstol said. “A faceoff isn’t a 1-on-1 battle. It’s 5-on-5 or 4-on-4 or whatever. It’s not just centermen vs. centermen. It’s something we’re going to put a focus on and it’s not just one guy. As a group we have to be better there.” \nThe last three games were the ones that the opponents had something at least close to their regular lineup and the Flyers went 0-1-2. Hakstol said he’d give his team a ‘C’ grade for the preseason, but identified positives to build off of. \n“These last two nights, there’s a lot of good in these nights,” Hakstol said. “When they end the way they did, even in a shootout loss, you tend to look past a lot of the good. We need to make sure we don’t do that. We’ll look at the good, fix some of the things that need to be fixed and go back to work (Saturday).” \nDave Isaac; (856) 486-2479; disaac@gannettnj.com . Read or Share this story: http://on.cpsj.com/1RlGO9b TOP VIDEOS", "external_links": [], "published": "2015-10-03T05:37:00.000+03:00", "crawled": "2015-10-03T08:15:30.889+03:00", "highlightTitle": ""}