{"organizations": [], "uuid": "dbd25e7d5e70dfa8611fae832a3f1f32222e7026", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.khmertimeskh.com", "main_image": "http://www.khmertimeskh.com/files/news/16612/1444227868.jpg", "site_section": "http://www.khmertimeskh.com/news-list/6/sports/", "section_title": "Sports | Khmer Times | News Portal Cambodia |", "url": "http://www.khmertimeskh.com/news/16612/fiji-romp-to-victory-amid-historic-uruguay-tries/", "country": "AU", "title": "Fiji Romp To Victory Amid Historic Uruguay Tries", "performance_score": 0, "site": "khmertimeskh.com", "participants_count": 1, "title_full": "Fiji Romp To Victory Amid Historic Uruguay Tries | Khmer Times | News Portal Cambodia |", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T03:00:00.000+03:00", "replies_count": 0, "uuid": "dbd25e7d5e70dfa8611fae832a3f1f32222e7026"}, "author": "AFP", "url": "http://www.khmertimeskh.com/news/16612/fiji-romp-to-victory-amid-historic-uruguay-tries/", "ord_in_thread": 0, "title": "Fiji Romp To Victory Amid Historic Uruguay Tries", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (AFP) – Uruguay scored their first World Cup tries for 12 years on Tuesday but could not stop Nemani Nadolo leading Fiji to a rampaging 47-15 victory to end their campaign.\nCarlos Arboleya claimed Uruguay’s first try in the tournament since Pablo Lemoine, now team coach, crossed the whitewash against England at the 2003 World Cup.\nAgustin Ormaechea scored a second, sparking more wild celebrations by the South American underdogs. But he also became the first player sent off at the tournament as tempers flared.\nFiji claimed seven tries in a mainly flowing display of the running rugby they love. Nadolo, coming back from a one match suspension, scored the final try and also kicked six conversions.\nFiji claimed their first Pool A win after being beaten by England, Wales and Australia in one of the toughest 13 days any team could have known at the World Cup.\nBut it was the Pacific islanders who formed a guard of honour for Uruguay as they left the pitch at the end.\n“I am very proud, it was fantastic that they finally got the tries,” said Lemoine, now grey haired, who banged his fists on the window of the coach’s lookout after Arboleya went over.\nFiji pushed ahead from the first whistle and got a penalty try after just 140 seconds.\nLeone Nakarawa offloaded the ball to Lepani Botia who powered to the line but was upended by Ormaechea diving in with all shoulders but no arms.\nReferee JP Doyle ordered the first of two penalty tries against Uruguay and sent Ormaechea off for 10 minutes.\nThe weakened South Americans fell further behind when Nemia Kentale escaped down the right wing from a scrum to dot down.\nNadolo missed the conversion and Uruguay forced their way back into the game when Ormaechea came back.\nAlejo Duran hit a penalty and in the 17th minute blue shirts poured forward. Ormaechea put the ball through to hooker Arboleya, who pushed over near the Fiji posts sparking wild celebrations.\nThe Uruguayan wives and girlfriends screamed with joy.\nThe South Americans looked threatening at times but made crucial errors against the bigger Fijians.\nDoyle awarded a second penalty try for a scrum offence in the 27th minute which Nadolo converted for 19-10.\nIn a Fijian moment of magic, Nadolo broke away to the left drawing Uruguay players with him before slipping the ball inside to Leone Nakarawa, who sold a dummy and headed straight for the posts for the bonus point try.\nUruguay fans used football chants to encourage their team and Ormaechea’s clever kick launched the offensive in which he eventually touched down for his side’s second try. That made it 26-15 to Fiji and the game was not yet won.\nJust after the hour Tevita Cavubati went over for Fiji but a punch was landed on the ground and fists flew for a while until Doyle could calm the players so Nadolo could convert.\nTwo minutes later, Kini Murimurivalu powered over after a spectacular show of Fiji running. But there was more tension and Doyle showed yellow cards to Ormaechea and Fiji’s Campese Ma’afu.\nOrmaechea’s second yellow meant he was sent off definitively -- the first red card shown in the 2015 tournament.\nNadolo picked up a decoy pass and powered past three Uruguayans unable to stop the Fiji giant for the final try with seconds to go.\n“I let my nation down, I let myself down,” he said of the one match suspension which cost him his place against Australia. “I came out wanting to make amends.”", "external_links": [], "published": "2015-10-07T03:00:00.000+03:00", "crawled": "2015-10-08T02:53:47.747+03:00", "highlightTitle": ""}