{"organizations": ["Big House", "ESPN The Ohio State", "Penn State", "Buckeyes"], "uuid": "2ec4b152ce745382c063f5d3d3016e2c1dd6c83d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "espn.go.com", "main_image": "http://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2015%2F1017%2Fr17793_1296x1296_1%2D1.jpg", "site_section": "http://news.google.com/news?pz=1&cf=all&ned=us&hl=en&topic=s&output=rss", "section_title": "Sports - Google News", "url": "http://espn.go.com/college-football/story/_/page/gamedayfinal101715/michigan-state-spartans-relish-win-michigan-wolverines-big-house-botched-punt", "country": "IL", "title": "A finish for the ages at the Big House - ESPN", "performance_score": 2, "site": "go.com", "participants_count": 0, "title_full": "A finish for the ages at the Big House - ESPN", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T09:15:00.000+03:00", "replies_count": 0, "uuid": "2ec4b152ce745382c063f5d3d3016e2c1dd6c83d"}, "author": "", "url": "http://espn.go.com/college-football/story/_/page/gamedayfinal101715/michigan-state-spartans-relish-win-michigan-wolverines-big-house-botched-punt", "ord_in_thread": 0, "title": "A finish for the ages at the Big House - ESPN", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["J.T. Barrett"], "text": "The Ohio State quarterback carousel continues to spin and might now be favoring J.T. Barrett after the top-ranked Buckeyes beat Penn State 38-10. 2 Related \nWith only 10 seconds left, Michigan punter Blake O'Neill bobbled a low snap. O'Neill tried to regain control of the ball and punt it, but he was hit by Spartans safety Grayson Miller and the ball popped into the air. The ball fell right into the arms of Michigan State's Jalen Watts-Jackson , who caught the ball and ran for the end zone. \nMichigan State's Jermaine Edmonson delivered a couple of key blocks, and then Watts-Jackson barreled through Michigan tight end Jake Butt near the goal line to score a 38-yard touchdown to win the game. \nJust like that, \"Little Brother\" kicked \"Big Brother\" you-know-where. \n\"This is why football is loved so much in America,\" Spartans coach Mark Dantonio said. \"It's because things like this happen. Every now and then, they happen.\" \nNo one could have imagined it happening in this game. In fact, after Spartans quarterback Connor Cook's pass fell incomplete on fourth-and-19 with 1:47 to go, the game seemed over. But Michigan State's defense stood up, and Dantonio used his three timeouts to set up the final crazy play. \n\"You go from 10 seconds, a guy punting the ball, you're thinking, 'OK this is done,'\" Dantonio said. \"And then all of a sudden, life gets flipped upside down.\" Michigan State's win probability was 0.2 percent prior to the final snap, according to ESPN Stats and Info. ESPN Stats and Info \nHow improbable was Michigan State's victory? ESPN's Stats & Info estimated the Spartans had a 0.2 percent chance to win before the final play. According to Stats LLC, it was the first time an FBS game ended with a game-winning touchdown scored by a defensive or special-teams player with no time left since Auburn's Chris Davis returned a missed 57-yard field goal for a 100-yard touchdown on the final play to upset No. 1 Alabama 34-28 in the 2013 Iron Bowl. \nEven more unbelievable: Watts-Jackson spent Saturday night in a hospital after dislocating his hip. A Michigan State official told ESPN.com that he was injured after several players piled on top of him during a celebration in the end zone. It was the first touchdown of his college career. \n\"This is something you tell your grandkids about,\" Miller said. \"I'm at a loss for words.\" So was Harbaugh, whose team lost to its bitter in-state rival in his first meeting against the Spartans as his alma mater's coach. \n\"A mistake was made,\" Harbaugh said. \"Mistakes were made. It's very unfortunate circumstances.\" \nThe Wolverines have suffered plenty of heartache at the Big House in the past. In 1994, Colorado's Kordell Stewart threw a 64-yard Hail Mary pass to Michael Westbrook for a touchdown on the final play to give the Buffaloes a 27-26 victory. In the 2007 opener, FCS member Appalachian State blocked Michigan's last-second field goal to secure a 34-32 victory, which was one of the biggest upsets in college football history. \nBut the way Saturday's game ended was worse. It was more painful because of how the Wolverines controlled the game until the end and, more importantly, because of whom it was against. It was Michigan's seventh loss in its last eight meetings against the Spartans. \n\"Football is a crazy, crazy game,\" Dantonio said. \"You can't hardly explain it.\" \nThe Spartans and Wolverines (and the rest of us) will spend the remainder of their lives trying to fathom exactly what happened in the final 10 seconds on Saturday. Playoff teams after Week 7 Seth Russell is settling in just fine as Baylor's quarterback -- he's helped the Bears score at least 60 points in five straight games. Jerome Miron/USA TODAY Sports \n1. Utah : There were sloppy moments for the Utes against Arizona State, but Devontae Booker scored two fourth-quarter touchdowns to secure a 34-18 win, ending an 11-game losing streak against the Sun Devils. The Utes are the Pac-12's sole remaining unbeaten team. They travel to play USC Week 8. \n2. Baylor : Bears quarterback Seth Russell has been responsible for 32 touchdowns this season, the most by any FBS player through six games over the last 10 seasons. He had five touchdown passes and one scoring run in a 62-38 win over West Virginia. \n3. LSU : The Tigers survived a 35-28 win over Florida at Death Valley to move to 6-0. LSU plays Western Kentucky next week and then gets a week off before its Nov. 7 showdown at Alabama. \n4. Ohio State : J.T. Barrett isn't making it easy for Urban Meyer to keep him as the Buckeyes' No. 2 quarterback. He may have finally unseated Cardale Jones after providing the spark in a 38-10 win over Penn State. Barrett scored two red-zone touchdowns in the first half and passed for two touchdowns in the fourth quarter after taking over for Jones in the third quarter. Next four in contention \n1. Clemson : Quarterback Deshaun Watson threw for 420 yards with three touchdowns on 27-for-41 passing, leading the Tigers to a 34-17 win over Boston College. The Eagles had surrendered only two offensive touchdowns this season. \n2. TCU : After giving up three touchdowns to Iowa State in the first quarter, the Horned Frogs threw a shutout in the final three quarters of a 45-21 victory on the road. The teams combined for 617 yards of offense in the first half. \n3. Alabama : The Crimson Tide's defense nearly outscored Texas A&M in their 41-23 victory, becoming the first FBS team since 2012 to return three interceptions for touchdowns in a game. Freshman defensive back Minkah Fitzpatrick became the first Alabama player to have two pick-sixes in a game. \n4. Michigan State : Spartans head coach Mark Dantonio admitted he was numb -- \"But a good numb, like putting ice on it\" -- following his team's improbable win over Michigan. Michigan State will have to avoid slipping up against some of the Big Ten's weaker opposition before visiting Ohio State on Nov. 21. Heisman candidates Leonard Fournette didn't eclipse 200 yards rushing, but he did lead LSU to a win over Florida with 180 yards and two touchdowns. Chris Graythen/Getty Images \n1. Leonard Fournette , RB, LSU : Fournette didn't get 200 rushing yards against the Gators, but he piled up 180 yards with two touchdowns on 31 carries against one of the country's best run defenses. He has 1,202 rushing yards through six games. \n2. Trevone Boykin , QB, TCU : The Horned Frogs didn't need any late-game magic against Iowa State. Boykin was spectacular again, completing 27 of 32 passes for 436 yards with four touchdowns. He also ran for 74 yards with one score. \n3. Corey Coleman , WR, Baylor : Coleman is quickly putting together one of the best statistical seasons by a receiver in FBS history. He had 10 catches for 199 yards with three touchdowns in the Bears' win over West Virginia. He has 16 touchdown catches in six games, already a school record for an entire season. \n4. Derrick Henry , RB, Alabama : Texas A&M's defense had no answer for Henry, who ran 32 times for a career-high 236 yards with two touchdowns. He ran for 153 yards in the first quarter and averaged 7.4 yards per carry. Tweets of the night", "external_links": [], "published": "2015-10-18T09:15:00.000+03:00", "crawled": "2015-10-18T09:40:04.455+03:00", "highlightTitle": ""}