{"organizations": [], "uuid": "bf5bd9b3772db13b196e4a06680ace3db93d9985", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www2.ljworld.com", "main_image": "http://worldonline.media.clients.ellingtoncms.com/img/croppedphotos/2015/10/10/XavienHowardTDcropLJW_t800.jpg?90232451fbcadccc64a17de7521d859a8f88077d", "site_section": "http://www2.ljworld.com/rss/headlines/sports/", "section_title": "LJWorld.com stories: Sports", "url": "http://www2.ljworld.com/news/2015/oct/10/baylor-offense-scores-will-rout-kansas/", "country": "US", "title": "Baylor offense scores at will in rout of Kansas", "performance_score": 0, "site": "ljworld.com", "participants_count": 1, "title_full": "Baylor offense scores at will in rout of Kansas", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T22:25:00.000+03:00", "replies_count": 0, "uuid": "bf5bd9b3772db13b196e4a06680ace3db93d9985"}, "author": "J-W Staff Reports", "url": "http://www2.ljworld.com/news/2015/oct/10/baylor-offense-scores-will-rout-kansas/", "ord_in_thread": 0, "title": "Baylor offense scores at will in rout of Kansas", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Junior running back Shock Linwood averaged a first down per carry, going for 135 yards on 13 runs. Linwood’s 1-yard TD put Baylor up 31-7 less than two minutes into the second quarter. \nThe Bears, able to ease up in the second half, finished with 644 yards of total offense. \nKU got off to a nice start on offense, as true freshman quarterback Ryan Willis led a nine-play, 74-yard drive. Willis, in his first career start, capped the series with a perfectly-thrown 36-yard deep pass to fellow freshman Steven Sims Jr. Press Conferences & Post-Game Interviews Postgame: David Beaty on Baylor blowout, Ryan Willis, punting \nFollowing a 66-7 loss to Baylor, first-year Kansas football coach David Beaty meets the media to discuss the rout, the play of KU's true freshman quarterback Ryan Willis, an early decision to punt and much more. \nThat connection with 9:27 left in the first quarter allowed KU (0-5, 0-2) to tie high-powered Baylor at 7. \nHowever, the Jayhawks wouldn’t score again, and finished with just 227 yards of offense. \nWillis, who showed poise in the pocket and on the move, handled the stage better than his stats — 20 of 36, 158 yards — would indicate. Though he threw an interception and lost a fumble that led to a Xavien Howard defensive touchdown, Willis kept plugging away and making strong throws as the deficit grew. \nSenior KU running back Taylor Cox made his first appearance of the season, and rushed for 45 yards on 19 carries. \nDerrick Neal had a team-best four receptions, for 26 yards. \nKU returns to Memorial Stadium next Saturday for a matchup with Texas Tech. \n— See what people were saying about the game during the KUsports.com live blog . HOW THEY SCORED \nFirst Quarter \n12:44 — Corey Coleman 11 pass from Seth Russell. Chris Callahan kick. After losing the opening coin toss and electing to receive the opening kick, Baylor marched 75 yards in 11 plays and 2:16 to take the early lead. The Bears averaged more than 9 yards per gain on their first scoring drive and Russell completed four of seven passes to start the Baylor offensive machine rolling. (Baylor 7, KU 0). \n9:27 — Steven Sims Jr. 36 pass from Ryan Willis. Nick Bartolotta kick. KU's freshman QB made several big time throws on KU's first scoring drive, including a strike to Jeremiah Booker on third-and-17 for a 22-yard gain that set up the deep ball to Sims, who got behind the BU defense and caught the ball in perfect stride as he cruised into the end zone. (KU 7, Baylor 7). Related document \nBox score: Baylor 66, Kansas 7 ( .PDF ) \n7:33 — Coleman 11 pass from Russell. Callahan kick. It took the Bears just eight plays to pick up their second touchdown of the day, this one aided by a 40-yard run by tailback Shock Linwood. Russell was 3-for-4 passing on the drive and he continued to look Coleman's way often. (Baylor 14, KU 7). \n4:42 — Russell 5 run. Callahan kick. After a curious decision by Kansas to give the ball back to Baylor on fourth-and-short instead of electing to go for it, the Bears marched 80 yards in seven plays and 1:14 to score for the third time in three possessions. (Baylor 21, KU 7). \n1:43 — Chris Callahan 31 field goal. An interception by Xavien Howard near midfield set up the Bears' fourth score of the game, which netted just three points instead of seven after the KU defense stiffened in the red zone and forced Baylor to kick. The drive covered 36 yards in five plays and 2:06. (Baylor 24, KU 7). \nSecond Quarter \n13:58 — Shock Linwood 1 run. Callahan kick. Another Kansas turnover spring-boarded another Baylor touchdown, as the Bears rode Linwood to a four-play, 42-yard scoring drive that took 1:32. Linwood ran for all 42 yards on the drive. (Baylor 31, KU 7). \n11:41 — LaQuan McGowan 18 pass from Russell. Callahan kick. A big punt return set the Bears up inside Kansas territory, and five plays later, the Bears added to their lead, this time with the 6-foot-7, 410-pound tight end catching a quick pass over the middle and then scooting into the end zone. The drive, which featured a fourth-down conversion, covered 32 yards in 1:16 and was Baylor's sixth score in six possessions. (Baylor 38, KU 7). \n5:46 — Johnny Jefferson 5 run. Callahan kick. After KU picked up a couple of first downs on its second offensive possession of the second quarter, the Bears benefited from another poor KU punt and marched 52 yards in eight plays and 1:40 to eclipse the 40-point mark. Baylor also cruised past 400 yards of total offense on the drive. (Baylor 45, KU 7). \n3:45 — Xavien Howard 30 fumble return. Callahan kick. After KU ripped off couple of decent gains on the ground, Willis fumbled under heavy pressure from the Baylor D and Howard scooped it up along the Kansas sideline and raced untouched into the end zone to push BU past 50 points. (Baylor 52, KU 7). \nThird Quarter \n8:03 — Ishmael Zamora 37 pass from Jarrett Stidham. Callahan kick. New quarterback, new half, no problem for the Bears, who opened the second half by stuffing the Kansas offense and following that up with an eight-play, 89-yard scoring drive that took 2:05 and featured a perfectly thrown deep ball from Baylor's true freshman, second-stringer on the touchdown. (Baylor 59, KU 7). \n6:16 — Davion Hall 30 pass from Stidham. Callahan kick. Another poor punt by Kansas put the Bears in great starting position — not that it matters with this offense — and six seconds later the Bears added to their lead with an easy, over-the-top scoring strike from Stidham to a wide-open Hall. (Baylor 66, KU 7).", "external_links": [], "published": "2015-10-10T22:25:00.000+03:00", "crawled": "2015-10-11T00:18:15.193+03:00", "highlightTitle": ""}