{"organizations": [], "uuid": "3850ea7531dbf786858ed6570fb6883c5aa6580e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "theolympicssports.com", "main_image": "", "site_section": "http://theolympicssports.com/feed/rss", "section_title": "The Olympics Sports", "url": "http://theolympicssports.com/football/media-accreditation-opens-for-the-fifa-club-world-cup-japan-2015.html", "country": "US", "title": "Media accreditation opens for the FIFA Club World Cup Japan 2015", "performance_score": 0, "site": "theolympicssports.com", "participants_count": 1, "title_full": "Media accreditation opens for the FIFA Club World Cup Japan 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T10:39:00.000+03:00", "replies_count": 0, "uuid": "3850ea7531dbf786858ed6570fb6883c5aa6580e"}, "author": "Abdul Rahim", "url": "http://theolympicssports.com/football/media-accreditation-opens-for-the-fifa-club-world-cup-japan-2015.html", "ord_in_thread": 0, "title": "Media accreditation opens for the FIFA Club World Cup Japan 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Home » FOOTBALL » Media accreditation opens for the FIFA Club World Cup Japan 2015 Media accreditation opens for the FIFA Club World Cup Japan 2015 Posted on October 16,   FOOTBALL No Comments Zurich, Oct 15, 2015: FIFA is pleased to announce that the accreditation process for media representatives wishing to cover the FIFA Club World Cup Japan 2015 has been launched via the FIFA Media Channel. The competition will be held in Yokohama and Osaka from 10 to 20 December 2015. The deadline for applications is Sunday, 22 November 2015. The competition will feature Auckland City of New Zealand, Club América of Mexico, FC Barcelona of Spain and CA River Plate of Argentina. These four clubs will be joined by the respective winners of the AFC Champions League, CAF Champions League and the host country’s J-League. Media Accreditation Media accreditation for written press, websites and photographers will be managed through the FIFA Media Channel. Please note that the media accreditation process for any FIFA competition involves two steps: 1. Register for access to the FIFA Media Channel You will then receive confirmation that you have been granted access to the FIFA Media Channel. 2. Once you have received your username and password, or if you are already registered, log on to: http://media.fifa.com Select “FIFA Club World Cup Japan 2015” and complete the online media accreditation form. Broadcasters There is a separate accreditation process for TV and radio broadcasters, including non-rights holders (NRH). Please contact: [email protected] . All applications are subject to confirmation, which will not be on a first-come, first-served basis. Successful applicants will be notified and provided with further information in due course. FIFA Media Channel The FIFA Media Channel is FIFA’s online media centre, a password-protected website that is updated constantly. It is designed to provide media professionals with information on the latest event activities, including press conferences, team training sessions, details about competition media facilities and stadium media centres (SMCs), and media ticketing. You will also find useful contacts and other media resources on the FIFA Media Channel. Visa information Media representatives visiting Japan are advised that they may require a visa to enter the country and are responsible for making their own arrangements. For more information on the FIFA Club World Cup Japan 2015, please visit: www.fifa.com/clubworldcup —- FIFA \nRelated posts:", "external_links": [], "published": "2015-10-16T10:39:00.000+03:00", "crawled": "2015-10-16T10:53:32.391+03:00", "highlightTitle": ""}