{"organizations": [], "uuid": "0b27b500899b922222fccc6df503710a3997895d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "wtop.com", "main_image": "http://wtop.com/wp-content/uploads/2015/10/USC-Sarkisian-Football3.jpeg", "site_section": "http://wtop.com/section/sports/feed/", "section_title": "WTOP » Sections » Sports", "url": "http://wtop.com/ncaa-football/2015/10/usc-ad-sarkisian-fired-for-failing-to-meet-school-standards/", "country": "US", "title": "USC AD: Sarkisian fired for failing to meet school standards", "performance_score": 0, "site": "wtop.com", "participants_count": 1, "title_full": "USC AD: Sarkisian fired for failing to meet school standards", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T00:40:00.000+03:00", "replies_count": 0, "uuid": "0b27b500899b922222fccc6df503710a3997895d"}, "author": "wtopstaff", "url": "http://wtop.com/ncaa-football/2015/10/usc-ad-sarkisian-fired-for-failing-to-meet-school-standards/", "ord_in_thread": 0, "title": "USC AD: Sarkisian fired for failing to meet school standards", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "USC AD: Sarkisian fired for failing to meet school standards By GREG BEACHAM October 13, 2015 5:40 pm FILE - In this Sept. 26, 2015, file photo, Southern California coach Steve Sarkisian, front, hugs USC athletic director Pat Haden prior to the team's NCAA college football game against Arizona State in Tempe, Ariz. USC fired Sarkisian one day after the troubled coach was put on leave. Athletic director Pat Haden announced his decision Monday, Oct. 12, 2015, in a brief statement. (AP Photo/Ross D. Franklin, File) \nLOS ANGELES (AP) — Southern California athletic director Pat Haden defended both his hiring and firing of Steve Sarkisian on Tuesday, saying the troubled football coach passed a thorough background check and had no behavioral missteps until the last two months. \nHaden said he sent a letter of termination to Sarkisian when he was unable to contact the coach personally, one day after Sarkisian showed up to work “unwell.” Interim coach Clay Helton will lead the Trojans (3-2, 1-2 Pac-12) against No. 14 Notre Dame on Saturday. \n“I was able to gather facts and determine that Steve’s conduct did not meet USC standards and expectations of a head coach,” Haden said. “He knew those expectations and failed to meet them, so we made a decision in the best interest of our student-athletes, and that was to terminate Steve.” \nUSC President Max Nikias issued a statement in strong support of Haden, who is under scrutiny for his handling of Sarkisian’s problems and the football team’s struggles. \nHaden allowed Sarkisian to keep working after an embarrassing alcohol-related incident at a pep rally in August because he decided the coach “deserved a second chance,” he said. \n“I felt at that time, it was in the best interests of our players, who had been through an incredible amount of adversity during the (NCAA) sanctions and the coaching changes they had gone through, and to Steve, not to suspend or fire him,” Haden said. “Based on the input of trusted medical professionals and staff, it was determined he could continue coaching while seeking treatment. I felt a great deal of compassion for Steve Sarkisian.” \nHaden initially placed Sarkisian on an indefinite leave of absence Sunday, but echoed similarly vague recent statements about the reasons for the decision Tuesday. Haden said his investigation over the next day revealed that Sarkisian had violated those unspecified “expectations” for his behavior following the August incident, persuading Haden to fire the coach just 18 games into his tenure. \nHaden said an unnamed national search firm helped with Sarkisian’s hiring despite his anecdotal history of boisterous alcohol-related behavior during his time at the University of Washington, but the AD couldn’t explain why USC saw nothing wrong with the public records obtained by the AP, the Los Angeles Times and other outlets that demonstrated Sarkisian’s enthusiasm for hefty alcohol purchases while traveling for the Huskies. Haden said Sarkisian also had background checks done by USC and the NCAA. \n“At the time of Steve’s hire, I firmly believed he was the right choice and fit for USC,” Haden said. “The decision didn’t work out, and I own that.” \nSarkisian, the Trojans’ fourth head coach in just over two years, went 12-6 with a talent-stacked roster, losing four games to double-digit underdogs. He lost two of his last three games, both to unranked Pac-12 opponents. \nHaden and Nikias, who are close friends, have stressed the positive aspects of Haden’s tenure, including strong success in smaller sports and the football program’s successful navigation of heavy NCAA sanctions predating their time in charge. \n“(Haden) is a man of true character and integrity,” Nikias said. “He cares deeply for our student-athletes, and he always makes their well-being his highest priority. Pat Haden has been doing an outstanding job in leading Trojan athletics in the past five years, and I want to take this opportunity to reiterate my unwavering support for him. I look forward to working with Pat Haden as our USC AD for many years to come.” \nWhile Helton prepares his players for their trip to South Bend, former Trojans around the nation have been watching the USC circus with dismay and hope. \n“It’s just unfortunate (to be) looking for a coach,” Buffalo Bills receiver Robert Woods told The Associated Press. \n“It just seems like after (Pete) Carroll left, up and down years ever since,” added Woods, USC’s career leader in receptions. “But too much off-the-field drama, seems like, a lot going on with the head coach, who’s supposed to be a leader of your team. I know Pat Haden is probably really frustrated with his coaches right now, but he’ll definitely turn it around. He’s a great guy, and it’s a great program that can definitely turn around.” \nHaden’s unusual dismissal of Sarkisian by letter joins a strange history of USC football firings. \nLane Kiffin was fired by Haden at the Los Angeles airport in 2013 after the team returned from a blowout loss at Arizona State, with Kiffin trying desperately to talk Haden out of the move in the dead of night. Former athletic director Mike Garrett fired famed USC coach John Robinson in 1997 with a message left on his answering machine, followed by a news conference to announce the hiring of Paul Hackett — who wasn’t there. \n“I really do look forward to talking to Steve at some point, I really do,” Haden said. \n___ \nAP Sports Writer John Wawrow in Buffalo contributed to this report. Topics:", "external_links": [], "published": "2015-10-14T00:40:00.000+03:00", "crawled": "2015-10-14T00:56:47.691+03:00", "highlightTitle": ""}