{"organizations": [], "uuid": "6ef2db4af7acb4cd7ab713bc02eadff7c4fd95c8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.fox8live.com", "main_image": "http://WVUE.images.worldnow.com/images/5149330_G.jpg", "site_section": "http://www.fox8live.com/", "section_title": "New Orleans News, Weather, Saints - FOX 8 WVUE New Orleans News, Weather, Sports, Social", "url": "http://www.fox8live.com/story/30168398/north-shore-residents-urged-to-take-precautions-after-west-nile-death", "country": "US", "title": "North shore residents urged to take precautions after West Nile", "performance_score": 0, "site": "fox8live.com", "participants_count": 1, "title_full": "North shore residents urged to take precautions after West Nile - FOX 8 WVUE New Orleans News, Weather, Sports, Social", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T06:55:00.000+03:00", "replies_count": 0, "uuid": "6ef2db4af7acb4cd7ab713bc02eadff7c4fd95c8"}, "author": "Written by: Kimberly Curth, Reporter", "url": "http://www.fox8live.com/story/30168398/north-shore-residents-urged-to-take-precautions-after-west-nile-death", "ord_in_thread": 0, "title": "North shore residents urged to take precautions after West Nile", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MANDEVILLE, LA (WVUE) - Doctors say West Nile virus claimed the life of a north shore man. The 70-year-old, who lived in Slidell, died Thursday morning after he was diagnosed Sept. 14. Now, some neighbors aren't taking any chances after hearing the news.\nLauren and Josh Simpson enjoy spending several nights a week on the lakefront, but they tell us they'll now be taking extra precautions.\n\"We were down here last night and like right now its not too bad, but once the sun goes down and all the dragon flies go away, you're just slapping yourself crazy. They're pretty much all over you,\" said Josh Simpson.\n\"I'm always kind of covered with bites at least two or three times a week I have them,\" said Lauren Simpson.\nSt. Tammany Parish Coroner Dr. Charles Preston says despite the cooler weather, neighbors still need to protect themselves.\n\"The highest risk is at dusk and dawn, and of course, this beautiful weather brings us out at dusk and dawn. [But] you want to wear long sleeves, long pants,and most importantly use insect repellent containing DEET,\" Preston said.\nThat's exactly what the Simpsons plan to do.\n\"I think we are going to go and invest in some stronger repellent,\" said Josh Simpson.\n\"That is a terrible tragedy and I feel so sorry for that family that they had to go through that. I am definitely going to take precautions and spray as much as I can so we don't get infected,\" said Lauren Simpson.\nAccording to the St. Tammany Parish Mosquito Abatement District website, \"the district continues to place an emphasis on controlling the southern house mosquito, the primary vector for West Nile virus by spraying the roadside ditches where they breed and conducting aerial and ground adulticiding operations.\"\n\"I spoke with President Brister today, and she affirmed that they have been having a very aggressive mosquito abatement effort. But again, you know, trying to kill all the mosquitoes in Louisiana is just an unrealistic goal,\" Preston said.\nThere have been 54 people infected with West Nile Virus across the state, and three have died from it, not including the latest victim.\nCopyright WVUE 2015. ", "external_links": [], "published": "2015-10-02T06:55:00.000+03:00", "crawled": "2015-10-02T08:42:28.281+03:00", "highlightTitle": ""}