{"organizations": [], "uuid": "e2161ed427c25bfc30c2f68e9d0857edfaa869c3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.philly.com", "main_image": "http://media.philly.com/images/hs1bigheart25z-d.JPG", "site_section": "http://www.philly.com/", "section_title": "Philadelphia local news, sports, jobs, cars, homes - Philly.com", "url": "http://www.philly.com/philly/health/20151025_Heart_failing__480-pound_man_takes_big_risk_to_get_better.html", "country": "US", "title": "Heart failing, 480-pound man takes big risk to get better", "performance_score": 0, "site": "philly.com", "participants_count": 1, "title_full": "Heart failing, 480-pound man takes big risk to get better", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T02:00:00.000+02:00", "replies_count": 0, "uuid": "e2161ed427c25bfc30c2f68e9d0857edfaa869c3"}, "author": "Tom Avril,", "url": "http://www.philly.com/philly/health/20151025_Heart_failing__480-pound_man_takes_big_risk_to_get_better.html", "ord_in_thread": 0, "title": "Heart failing, 480-pound man takes big risk to get better", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "James Wagstaff-Duncan's heart was about to give up.\nThe organ was dangerously enlarged and surrounded with extra fluid. It pumped about one-tenth as efficiently as the heart of a healthy person. At age 28, he was unable to take four steps without feeling short of breath.\nBut physicians at Temple University Hospital said he could not get a new heart for one of the very reasons his old one was failing:\nHe weighed 480 pounds.\nMore coverage Obese fare better against chronic ills? His case presents a vexing dilemma from the frontier of the U.S. obesity epidemic.\nThough he was too big to get a new heart, Wagstaff-Duncan's own heart was too weak for a conventional diet-exercise regimen. Physicians considered bariatric surgery to help him take off some of the excess pounds but decided against it for the same reason. His heart was too weak for surgery.\nIn September, with perhaps months to live, the North Philadelphia man went with what he and his physicians saw as his last option. He underwent surgery to get a ventricular-assist device: an implanted, mechanical pump that would help his heart deliver blood to his 5-foot-8-inch frame.\nBut even that approach was risky. And on Temple's committee that evaluates which patients are candidates for these devices, not everyone was sure it was a good idea.\nHigh risk Wagstaff-Duncan has been a big man for a long time, but as recently as 2008, he weighed 320 pounds, he said - still obese, but far from unusual in this country.\nThat year, he was in a car accident and broke a thigh bone. While recovering, he was less active yet continued to eat.\n\"I got bigger,\" he said.\nEventually, he developed dilated cardiomyopathy, in which the ventricle wall becomes stretched, thinner, and \"floppy,\" said Eman Hamad, medical director of Temple's mechanical circulatory support program.\nThe disease has a variety of possible causes, from genetics to infection. Diabetes and obesity can play a role, and Wagstaff-Duncan suffered from both.\n\"Me being so big, I'm putting a lot of stress and pressure on my heart,\" he said.\nBy 2011, his heart had deteriorated to the point where he was no longer able to continue his work as a security guard, and he had a defibrillator implanted.\nHe kept getting worse, and in August, barely able to walk, he was admitted to Temple's hospital on North Broad Street.\nHe was not eligible for a transplant, both because the surgery was risky at his size, and because a donor heart would be too small for him.\nWhen the hospital's interdisciplinary committee met to discuss his case, Hamad and colleague Rene J. Alvarez Jr. pushed for a ventricular assist device - a VAD.\nIt was risky for several reasons. Obese patients who get one of these pumps have a higher chance of infection. Some patients even gain weight. And in any kind of surgery on a very large person, incisions are slower to heal.\nBut without the device, cardiologists Alvarez and Hamad reasoned, he would soon be dead.\n\"Even though it's high risk, unfortunately he has no other options,\" Hamad said.\nAnd if it worked, he would have many years in front of him, said Alvarez, medical director of Temple's heart failure and transplant program.\n\"He's a young man,\" said Alvarez, a professor at Temple's Lewis Katz School of Medicine. \"We argued very strongly for him.\"\nWith a VAD, they told colleagues, he could exercise and lose some weight. If he gets below 400 pounds, he would be a candidate for bariatric surgery, allowing him to lose even more, Alvarez said.\nAnd then, if he gets to below 260 pounds, or a body mass index of 40, he could be considered for a heart transplant.\nA few other centers have tried that approach with super-obese patients, including several at the University of Pittsburgh Medical Center.\nOne patient lost more than 120 pounds and was able to get a heart transplant, said Robert Kormos, director of the hospital's artificial-heart program.\n\"First thing we want to see is if they do well on the LVAD,\" Kormos said, referring to a left-sided VAD, the most common type. \"Do they follow the rules? Do they manage their health? If we see that, we're encouraged to then refer them on for gastric bypass.\"\nBut the largest Pitt patient had a body-mass index in the 50s (more than 25 is considered overweight; 30 marks obesity). Wagstaff-Duncan was even bigger, with a body-mass index above 70 at his peak. After several weeks at Temple, his weight dipped to less than 450 pounds, for a BMI of 68.\nThe device manufacturer, Thoratec Corp. of Pleasanton, Calif., told Temple that was still the second-highest BMI of any U.S. patient to get the implant, after an Arkansas hospital that operated on a patient with a BMI of 72.\nBaptist Health Medical Center in Little Rock declined to comment, citing patient privacy rules.\nLying in his hospital bed, Wagstaff-Duncan read about the VAD procedure and watched a video. Before the surgery, Temple insisted he sign a contract in which he committed to take care of himself afterward.\nAmong other challenges, that meant continuing the diet he started in the hospital: 1,500 calories a day.\nThe surgery The procedure was performed Sept. 11 by Temple surgeons Yoshiya Toyoda and Jesus Gomez-Abraham.\nAlthough Wagstaff-Duncan has a big chest, his enlarged heart left little room for the device, a HeartMate II, Gomez-Abraham said.\nBut all went well. Afterward, with a breathing tube down his throat, the patient snapped selfies with a cellphone, Gomez-Abraham recalled.\n\"Never any anxiety, just quiet and relaxed,\" the surgeon said.\nTemple declined to say what the procedure cost, but generally at a teaching hospital, for patients with major co-morbidities such as obesity and diabetes, Medicare, which covers disabled people such as Wagstaff-Duncan, reimburses more than $200,000.\nWagstaff-Duncan was discharged four weeks later. He felt substantially better, and by the end of his stay, he was walking the hospital halls with ease.\nNow he has to do his part.\nHamad, the cardiologist, said her patient suffered from a food addiction, enabled in the past by family members who gave him more to eat when he asked.\nHe is getting counseling at Temple to overcome the problem, and his great aunt Edith Bond is supervising his care, helping him to stick to his diet and take care of the VAD.\nLiving with the devices can be a challenge. They are powered by an external battery, connected through the skin by a drive line, which requires frequent cleaning. Bond is strict.\n\"We argue. We fuss,\" she said. \"I tell him this is how it's got to be.\"\nHer great-nephew, now 29 and below 440 pounds, knows she means business.\n\"She's a general,\" he said.\nWagstaff-Duncan tries to stay active, and he reported no ill effects recently after walking the corridors of the Cheltenham Mall. He said he was being careful with his diet, reading calorie counts on package labels. He chews a lot of sugar-free, pineapple-flavored gum to quell cravings.\n\"At times it is hard, when you're used to eating whatever you want,\" he said one day last week, a few hours after downing a bowl of Raisin Bran for breakfast.\nIt is a big adjustment. But he said he had no reservations, given the alternative.\n\"It means that I can put my life together and do better,\" Wagstaff-Duncan said. \"I've got a chance.\"\ntavril@phillynews.com\n215-854-2430@TomAvril1", "external_links": [], "published": "2015-10-25T02:00:00.000+02:00", "crawled": "2015-10-24T01:14:29.576+03:00", "highlightTitle": ""}