{"organizations": [], "uuid": "ad3ea2defe93390447445cc95532da2a5a1db9e3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.baltimoresun.com", "main_image": "http://www.trbimg.com/img-560e9195/turbine/hc-geno-auriemma-uconn-women-basketball-grantland-1003-20151002", "site_section": "http://feeds.baltimoresun.com/baltimoresun/sports/college/rss2.0.xml", "section_title": "College Sports - Baltimore Sun", "url": "http://www.baltimoresun.com/sports/college/hc-geno-auriemma-uconn-women-basketball-grantland-1003-20151002-story.html", "country": "US", "title": "Geno Auriemma Says Some UConn Fans 'Are So Stupid It's Unbelievable'", "performance_score": 0, "site": "baltimoresun.com", "participants_count": 1, "title_full": "Geno Auriemma Says Some UConn Fans 'Are So Stupid It's Unbelievable'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T05:33:00.000+03:00", "replies_count": 0, "uuid": "ad3ea2defe93390447445cc95532da2a5a1db9e3"}, "author": "JOHN ALTAVILLA", "url": "http://www.baltimoresun.com/sports/college/hc-geno-auriemma-uconn-women-basketball-grantland-1003-20151002-story.html", "ord_in_thread": 0, "title": "Geno Auriemma Says Some UConn Fans 'Are So Stupid It's Unbelievable'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Geno Auriemma Says Some UConn Fans 'Are So Stupid It's Unbelievable' Geno Auriemma Cloe Poisson / Hartford Courant \nUConn coach Geno Auriemma had some candid things to say about a number of topics - including the Huskies fan base - during an interview this week with grantland.com. \nUConn coach Geno Auriemma had some candid things to say about a number of topics - including the Huskies fan base - during an interview this week with grantland.com. (Cloe Poisson / Hartford Courant) John Altavilla Contact Reporter UConn women's coach Geno Auriemma insults some Husky fans in interview \nGeno Auriemma has made history coaching women's basketball by winning 10 national championships for UConn and an Olympic gold medal for the United States. Along the journey, he has crafted a reputation for saying what's on his mind, usually in a pointed, demonstrative way. \nIt was the case again early this week during a 71-minute appearance on a Grantland podcast moderated by host Zach Lowe, a declared UConn women's basketball fan. During the wide-ranging interview, Auriemma was asked about a number of things, some as routine as Diana Taurasi, some as off-topic as Deflategate and the Patriots. \nBut what quickly grabbed headlines and surged to message boards was a comment he made about some fans who follow his program. \n\"Some of our fans are so [g-damn] stupid it's unbelievable,\" Auriemma told Lowe, who early in the interview said the ESPN podcast allowed for the use of profanity, if the moment struck Auriemma, which is different than many mediums. \"They complain a lot of times that we have no competition and it's boring. Then if we play a really good team and don't play our A-game, they bitch that something's wrong with UConn: 'This kid's not any good. That kid's not any good. Geno Auriemma got outcoached by this coach.' It's unbelievable.\" \nRichard Hanley, an associate professor of journalism at Quinnipiac University, characterized the remarks as Auriemma projecting authenticity. \n\"I believe there is a sense, certainly within his fan base, that Geno projects a certain authenticity,\" Hanley said. \"This specific remark is authentic and may actually play well for him because it is something people within his fan base may have expected him to say. \n\"Perhaps outside of Connecticut, it may not play as well, because people may not know him as well. But in this age of Donald Trump, who says pretty much whatever he wants to say as he runs for the highest office in the land, Geno's remarks are molded to the moment we are in [as a world].\" \nUConn athletic director Warde Manuel said Friday he understands the frustration that might have prompted Auriemma's comments. \n\"While I would have said it differently, let me say that the majority of our fans are great. I don't want that misunderstood,\" Manuel said. \"They are supportive of Geno, his staff, the young women who play for them and the success they have all enjoyed. But it is frustrating to hear things from a few people among the fan base, such as the insinuation that we are too good and therefore some [fans] don't want to support us by coming to games, even though they still love the team, because we blow people out. \n\"In sports, that kind of mind-set is virtually unheard of. When teams have success, usually the fans are more engaged and more willing to support. In this specific case, I believe Geno was just expressing his frustration, as we all feel when people, even if it's just a few, make comments like that. \n\"Our players are on the verge of doing something no [women's] team has ever done [win four national titles in a row]. They deserve the support of our fans no matter who we play. \n\"Knowing how hard everyone in his program works, it frustrates me that people blow off his success by saying it's only because we get the best players. There's a lot that goes into getting the results these young ladies get and to dismiss it and minimize it, without acknowledging the hard work, is not right.\" \nAuriemma, 61, also said \"women who bitch and moan all the time about not getting any respect do a horrible job of supporting women's sports at the gate with their money.\" \nSaid Manuel: \"Nobody understands how powerful words are more than Geno, how he uses them or how people will likely react. At some point we will talk about [the use of profanity in a public forum]. But at the same time, I understand his frustration.\" \nMichelle Smith, a columnist for ESPNW, said of Auriemma, \"I don't know if he's trying to deliver a message or he just feels like he can just say what he wants. He's always been like that, but I think at various times of his career he's paid a price for [candor]. \n\"Given the resume he has now, given the number of championships he has now, maybe he feels he can say things and not pay a price for it — and he might be right.\" \nIn the interview, Auriemma also took on coaches, fans and critics who feel his program is bad for the sport. \n\"I heard a WNBA coach say, 'I don't like UConn. They're bad for the game because they dominate so much. They get the best players and they kill everybody,'\" Auriemma said. \"And I'm like, 'That's the most idiotic statement I ever heard.' That just goes to show you how ignorant some people are. \n\"Let's say we get two high school All-Americans every year. The people we beat also get two. So there's 20 kids that may play in the McDonald's All-American Game and we get two — or three. What happens to the other 17 guys? \n\"So obviously we're doing something a little different than just getting the best players. No. 1, we get the right players, and we try to do the right thing by them.\" \nHanley said he believes Auriemma's status fuels his confidence to say things and contributes to the willingness many people show to accept them. In addition, Hanley also said he feels Auriemma understands the nature of what media outlet he is addressing — and is able to exaggerate or temper his comments to fit the moment. \n\"Someone without all those national championships, without the credibility that he has established over several decades of excellence, couldn't say what he has said,\" Hanley said. \"But if you have what amounts to a brand, you can pretty much say what you want with the confidence that it will be interpreted as authentic, which he is.\" \nAuriemma, a five-time national coach of the year, has five undefeated seasons and will attempt to win his fourth straight title this season. \n\"He knows exactly what he is saying at all times,\" Hanley said. \"He seems to be the type of coach that he knows he will be listened to. … I'm not saying he said [these particular things] for publicity; again, I believe him to be authentic. He was just telling his audience to have more respect for his players.\" \nJudy Vicek, 74, of Niantic, attends many UConn and WNBA games. She said that many of her friends, as Auriemma suspects, do not attend because of the lack of competition in some games. \n\"I don't care about that,\" Vicek said. \"I just like to go there and see [UConn] play. They play a very good game. But a lot of my friends are like that. They say, 'It's boring.' ... I agree with a lot of what [Auriemma] said. I hear a lot of my friends talking about it. I hear what they are saying. They have this idea in their heads. I try to tell them, 'Don't you want to see them play, cheer them on?' [The players] love seeing people in the crowd, it gives them a big boost to see their fans there. ... Geez, think of the practicing they do, give them a break.\"", "external_links": [], "published": "2015-10-03T05:33:00.000+03:00", "crawled": "2015-10-03T18:56:08.418+03:00", "highlightTitle": ""}