{"organizations": ["North Texas"], "uuid": "5ce077837767627b5017c153310e2ad92776e3e7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.hattiesburgamerican.com", "main_image": "http://www.gannett-cdn.com/-mm-/ac4adcf094a420cc047edcaa5527445f1b877fbc/c=0-596-2392-1947&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/03/Hattiesburg/Hattiesburg/635795107549199541-USM-vs-North-Texas-20.jpg", "site_section": "http://rssfeeds.hattiesburgamerican.com/hattiesburgamerican/sports", "section_title": "Hattiesburg - Sports", "url": "http://www.hattiesburgamerican.com/story/sports/college/southern-miss/football/2015/10/08/changed-southern-miss-marshall-squads-set-battle/73362874/", "country": "US", "title": "Changed Southern Miss, Marshall squads set to battle", "performance_score": 0, "site": "hattiesburgamerican.com", "participants_count": 0, "title_full": "Changed Southern Miss, Marshall squads set to battle", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T23:21:00.000+03:00", "replies_count": 0, "uuid": "5ce077837767627b5017c153310e2ad92776e3e7"}, "author": "", "url": "http://www.hattiesburgamerican.com/story/sports/college/southern-miss/football/2015/10/08/changed-southern-miss-marshall-squads-set-battle/73362874/", "ord_in_thread": 0, "title": "Changed Southern Miss, Marshall squads set to battle", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Todd Monken", "Marshall", "Jason Munz"], "text": "Changed Southern Miss, Marshall squads set to battle Jason Munz, Southern Miss Sports Writer 3:21 p.m. CDT October 8, 2015 Buy Photo Southern Miss head coach Todd Monken speaks to his players during a game against North Texas on Saturday at M.M. Roberts Stadium. (Photo: SUSAN BROADBRIDGE/HATTIESBURG AMERICAN) Buy Photo CONNECT 9 TWEET LINKEDIN COMMENT EMAIL MORE \nMarshall has been Conference USA’s model of consistency for the last half-decade. \nThe Thundering Herd are 27-6 since 2013, and have appeared in the league’s title game in back-to-back seasons, winning it in 2014. \nSouthern Miss travels to Huntington, West Virginia, for a 6 p.m. kickoff today against Marshall, a team that has scored no less than 59 points in games versus the Golden Eagles since 2012. \n“If you want to be the best, you have to go up against the best and see where you’re at,” third-year Southern Miss head coach Todd Monken said. “They’ve set the bar the last couple of years. They’ve been at the top of the hill. But we’re a different team than we’ve been.” \nAs is Marshall. Rakeem Cato, the versatile, athletic quarterback who won C-USA’s Offensive Player of the Year award last season, is gone. So too are leading receiver Tommy Shuler (nine touchdowns in 2014), receiver Eric Frohnappel (five scores in 2014), running back Steward Butler (who scored three times versus the Golden Eagles last season) and defenders Neville Hewitt and Jermaine Holmes (227 combined tackles a year ago). \n“It’s hard to replace a Rakeem Cato and the Shuler kid,” Monken said. “They had a great rapport. But they’re working through that. You just can’t replace good players (though). It takes time. But they’re still athletic on the perimeter. Their quarterback (Chase Litton) is a good player. They just haven’t hit that spark yet like in the last few years where they could roll up 50 (points) on you in a heartbeat.” \nThe Thundering Herd (4-1, 1-0 in C-USA) offense has struggled to live up to Cato and company’s production in recent years, scoring 31.8 points per game and averaging 351.2 yards per game. But Southern Miss understands Marshall is as sound defensively as it ever was, as it has given up just 19 points per game this season. \n“They’re very athletic, very physical,” Golden Eagle offensive coordinator Chip Lindsey said. “They play a different style of defense schematically. I think we’re going to have to do a nice job of getting our guys to understand that this is a different animal. \n“There’s a reason they’ve been pretty good the last few years in this league. We’ve got our hands full.” \nMarshall head coach Doc Holliday believes the same thing about Southern Miss. \n“Turn the film on, it’s obvious that they’re an excellent team and we have to be prepared to play or we won’t win,” he said. “When you look at them on tape right now, they look like they did five years ago. They’re one of the premier programs in our league, so I’ve always felt like it wouldn’t take them very long to get back and now they’re close.” Read or Share this story: http://hatne.ws/1Rwud32 TOP VIDEOS", "external_links": [], "published": "2015-10-08T23:21:00.000+03:00", "crawled": "2015-10-09T03:27:06.597+03:00", "highlightTitle": ""}