{"organizations": ["Liverpool", "Rubin Kazan Liverpool"], "uuid": "bbe2bedbade7669973059522cb7f79104b21ee97", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.sky.com", "main_image": "http://media.skynews.com/media/images/generated/2015/10/23/425728/default/v1/jurgen-klopp-applauds-fans-applause-liverpool-anfield-rubin-kazan-europa-league-3367210-1-1600x900.jpg", "site_section": "http://feeds.skynews.com/feeds/rss/sports.xml", "section_title": "Sports News - Latest Sports and Football News | Sky News", "url": "http://news.sky.com/story/1574727", "country": "IL", "title": "Liverpool Scrape A Draw With Rubin Kazan", "performance_score": 0, "site": "sky.com", "participants_count": 0, "title_full": "Liverpool Scrape A Draw With Rubin Kazan", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T07:22:00.000+03:00", "replies_count": 0, "uuid": "bbe2bedbade7669973059522cb7f79104b21ee97"}, "author": "", "url": "http://news.sky.com/story/1574727", "ord_in_thread": 0, "title": "Liverpool Scrape A Draw With Rubin Kazan", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Rubin Kazan", "Jurgen Klopp"], "text": "Liverpool Scrape A Draw With Rubin Kazan 05:22,   Share by email Jurgen Klopp was left frustrated on his Anfield debut as Rubin Kazan held his Liverpool side to a 1-1 draw in Europa League Group B. \nMarko Devic gave Rubin a surprise lead on 15 minutes, holding off the challenge of Nathaniel Clyne to expertly finish past Liverpool 'keeper Simon Mignolet. \nThe Russian side had opportunities to double their lead before captain Oleg Kuzmin was sent off after receiving his second yellow card for a foul on Emre Can on 36 minutes. Seconds later, Liverpool were level, as the Germany midfielder bundled home an equaliser from the resulting free-kick. \nLiverpool had chances to win the game through substitute Christian Benteke and the impressive Adam Lallana, but failed to break down a stubborn Rubin defence as Vately Chaly's side held on for more than 55 minutes with 10 men. \nThe Reds had 35 shots on Sergey Ryzhikov's goal, but just six were on target as Rubin forced Liverpool to shoot from distance. \nA third consecutive Europa League draw leaves the Reds in second place with three points in Group B, four points behind FC Sion after the Swiss side's 1-0 win in Bordeaux. \nRubin Kazan, who had failed to win on their previous three trips to England, took the lead after good work by Kuzmin. The right-back was allowed to travel forward and clipped towards Devic, who controlled on his chest and brilliantly finished past Mignolet with the outside of his right foot. \nLiverpool defender Clyne was caught on the wrong side of Devic at the back post, but the Rubin striker still had plenty to do, controlling and finishing in one swift movement. \nThe Reds have kept just one clean sheet in their last eight European games at Anfield, and Rubin nearly doubled their advantage after more lax marking on 32 minutes. \nBlagoy Georgiev drifted into the Liverpool box unattended and forced an acrobatic save from Mignolet after a smart chest and volley on the turn. The effort was heading in, and the Belgium 'keeper did well to flick the ball over the bar. \nKlopp's side then went close through Philippe Coutinho and Lallana before Can's equaliser on 37 minutes. \nKuzmin, who had gone into the book for a wild lunge on Alberto Moreno inside the opening 20 minutes, stepped across Can and blocked him off, earning a second yellow card and his marching orders from referee Robert Schorgenhofer. \nFrom the resulting free-kick, Liverpool levelled. Coutinho floated the ball in, and Rubin made a mess of the clearance, the ball dropping to Can, who swept home the first goal of the Klopp era from two yards. \nAfter the interval, Liverpool laboured to break down the 10 men of Rubin from open play, although Lallana and Clyne were bright down the right flank. \nIt was the former who created the best chance of the second half, sending substitute Benteke through on 79 minutes only for the forward to strike the base of the post with his first-time effort. \nBenteke, who replaced Coutinho on the hour, had earlier volleyed over from 10 yards. \nKlopp tried to influence proceedings with his substitutions, bringing on Roberto Firmino shortly after the arrival of Benteke, but the Brazil international struggled to make an impact during his 16-minute cameo. \nThe Reds were restricted to 21 shots from outside the box as Rubin dropped deep to defend the edge of their own 18-yard area, and Chaly's side even had the opportunity to steal the three points late on through substitute Igor Portnyagin. \nAfter forcing a rare corner with five minutes to play, the striker rose well only to fail to make proper contact after he was left unmarked eight yards out. \nLiverpool host Southampton in the Premier League on Super Sunday, live on Sky Sports, and continue their Europa League campaign away to Rubin on Thursday, November 5. Promoted Stories", "external_links": [], "published": "2015-10-23T07:22:00.000+03:00", "crawled": "2015-10-23T19:38:50.970+03:00", "highlightTitle": ""}