{"organizations": [], "uuid": "d397d53ccbc818d12ba2348b183ab21ef4971ecd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.heraldbulletin.com", "main_image": "http://bloximages.chicago2.vip.townnews.com/heraldbulletin.com/content/tncms/assets/v3/editorial/6/40/6408f6cc-7852-11e5-bdbd-73b719985681/56282ba47fca2.image.jpg?resize=479%2C760", "site_section": "http://www.heraldbulletin.com/search/?q=&t=article&l=100&d=&d1=&d2=&s=start_time&sd=desc&nsa=eedition&c[]=sports,sports/*&f=rss", "section_title": "Herald Bulletin - sports,sports/", "url": "http://www.heraldbulletin.com/sports/local_sports/close-knit-tribe-blazing-new-trails-in-cross-country/article_3c45255c-7852-11e5-85bf-ab2d0935199e.html", "country": "US", "title": "Close-knit Tribe blazing new trails in cross country", "performance_score": 0, "site": "heraldbulletin.com", "participants_count": 1, "title_full": "Close-knit Tribe blazing new trails in cross country", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:15:00.000+03:00", "replies_count": 0, "uuid": "d397d53ccbc818d12ba2348b183ab21ef4971ecd"}, "author": "Bill Cross | For The Herald Bulletin", "url": "http://www.heraldbulletin.com/sports/local_sports/close-knit-tribe-blazing-new-trails-in-cross-country/article_3c45255c-7852-11e5-85bf-ab2d0935199e.html", "ord_in_thread": 0, "title": "Close-knit Tribe blazing new trails in cross country", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "David Humphrey | For The Herald Bulletin Jason Kabir \nAnderson's Jason Kabir runs to a fifth-place finish during the regional last week in Muncie. Posted: Wednesday, October 21, 2015 8:15 pm Close-knit Tribe blazing new trails in cross country By Bill Cross | For The Herald Bulletin Herald Bulletin \nANDERSON — There is a fine line in sports between staying competitive to achieve your next goal and taking time to enjoy each accomplishment. \nThe Anderson boys cross country team is doing a fine job of both. \nOn Saturday, the Indians will compete as a team in the New Haven semistate in Fort Wayne for the first time in several years. The last Indians team to win a regional title was in 1987, and prior to Austin Stevens last year, the last individual runners to compete in semistate were Andrew Prieshoff and Jeremy Knox in 2005. \n“This is big for our school,” said coach Cary House. “We needed something like this for our school.” \nGetting to know each of the competitors reveals a loose group that enjoys being together but also has big goals in mind. House had the team write out their goals prior to the year, and they are sealed in individual envelopes in his desk. The envelopes will remain sealed until the team’s banquet after the season, although House admitted the team has already surpassed his goal for them. \nThe team started practice July 6, and the group that came out included Jason Kabir. \nKabir, who had played tennis for his first three years, decided to come out for cross country to help with his distance running during the spring track season. \n“It’s been my goal to get to the state meet for track,” said Kabir. “So this year I decided to run cross country because I knew it would be one of those things to get me to that next level in track.” \nKabir has been strong for the Indians, winning the City Meet at Davis Park to go along with a third in the Madison County meet and fifth-place finishes at the sectional and regional. \n“I’ve been really pleased with my results,” said Kabir. “I didn’t really know what to expect with times or placings so I didn’t want to set my goals too high. But, from the first meet, I saw what I did and thought this could be something.” \nStevens is returning to the semistate and plans to help his team with his experience of the course. \n“I know the course and where the tough spots are,” said Stevens, who finished 125th last year at IPFW. “I can also tell my teammates where they can make moves.” \nThe youngest runner of the group is freshman Aaron Ditsworth, who finished 27th in the regional last week at Muncie. \n“It’s been really good,” said Ditsworth. “I’ve never been on a team as good as this one. I’ve never had friends push me as hard as I should go and a coach that works hard to make us better.” \nThe team is rounded out by sophomore Eddie Amalfitano, senior Xavier Jones and juniors Roy Thomas and James Brandon. Amalfitano has dropped his times as a freshman from the 18-minute range to 17 minutes. \n“I feel my teammates help me, they push me,” said Amalfitano. \nBrandon has used his first year in cross country to get in shape for swimming season. \n“I used to hate running, but at this point I can’t imagine living without it,” said Brandon. “It’s so much fun and relaxing, and it’s a great team to be with.” \nNo matter where the runner may place, the team carries the attitude that the individual result is not as important as the team result. \n“It’s not how I do, it’s about how the team does,” said Jones. “We compete all the time. We keep each other accountable.” \nThe success of the Indians tends to be overshadowed by area teams like Mount Vernon and Pendleton Heights, who battled it out for sectional and regional titles. \nAdding to it, the area has seen a growth in the competitive level thanks to freshmen such as Negesse Kishpaugh at Liberty Christian and Michael Taylor at Anderson Prep. \n“Cross country is flat becoming one of the most competitive sports in our area,” said House, who also coaches wrestling and track at Anderson. “We had a great season, but we are overshadowed by Pendleton and Mount Vernon. We’re a great team, but very super teams have been outscoring us.” \nThe team stays loose and likes to have fun on the bus trips, including singing the theme to the “Love Boat” (although House said the team changes it to the Love Bus) and rap battles between Jones and Thomas. Thomas is looking forward to Saturday and at least one more trip on the bus. \n“I’m sure Saturday is going to be the best time we’ve had all season,” he said. \nWith all of the fun in mind, the team knows a good showing will give it a chance to run one more Saturday in the state finals. \n“Our goal for Saturday is to run our best,” said House. “If we do that, who knows what our fate will be?” Sign Up / Sign In With your existing account from... {* loginWidget *}", "external_links": [], "published": "2015-10-22T03:15:00.000+03:00", "crawled": "2015-10-22T06:31:45.483+03:00", "highlightTitle": ""}