{"organizations": ["Manchester United"], "uuid": "a4c5e76cdab90cb3738aaeae469d1b6ecdf8fe81", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sport.co.uk", "main_image": "http://images.sport.co.uk/150x150/9f4198b6beb7dd4b54068a725b9d03a2.jpg", "site_section": "http://feeds.feedburner.com/SportcoukNewsRssFeed", "section_title": "General Sports News from Sports.co.uk", "url": "http://www.sport.co.uk/football/wayne-rooney-backs-manchester-united-to-be-major-force-once/6967594/", "country": "JE", "title": "Wayne Rooney backs Manchester United to be major force once again", "performance_score": 0, "site": "sport.co.uk", "participants_count": 0, "title_full": "Wayne Rooney backs Manchester United to be major force once again", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T12:05:00.000+03:00", "replies_count": 0, "uuid": "a4c5e76cdab90cb3738aaeae469d1b6ecdf8fe81"}, "author": "", "url": "http://www.sport.co.uk/football/wayne-rooney-backs-manchester-united-to-be-major-force-once/6967594/", "ord_in_thread": 0, "title": "Wayne Rooney backs Manchester United to be major force once again", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Wayne Rooney"], "text": "Wayne Rooney backs Manchester United to be major force once again 21 Oct 2015 09:05:40 \nWayne Rooney has backed Manchester United to become a major force at home and in Europe again. \nRooney heads back to the city where he enjoyed the best night of his career this week. \nFor the United and England captain, Moscow is synonymous with glory. On a sodden night in the Russian capital seven years ago, Rooney and his team-mates defeated Chelsea on penalties to clinch United's third European Cup. \nThe venue may be different - CSKA Moscow play in the Khimki Arena, not the Luzhniki Stadium - but the feeling of going back to Moscow remains the same for Rooney ahead of Wednesday's Champions League group stage encounter. \nThe 29-year-old, speaking to the English press aboard United's chartered flight east, recalled that night in Moscow with a warm smile. \n\"It was the highlight of my career,\" the striker said. \n\"It is a massive competition to play in, to win the trophy it's obviously great memories.\" \nIt was not such an enjoyable experience at the time. Substituted in the second half, the forward had to watch on from the halfway line, arm in arm with his team-mates, as the penalty shootout unfolded 50 yards downfield. \nMichael Carrick could bring himself to watch. Rooney did, but he did not enjoy it. \nHe said: \"I have been involved in a few penalty shootouts, but it was worse watching it rather than actually knowing you were taking a penalty because when you take one you are focusing on it. \n\"When you are on the sideline and you have no influence. It's quite difficult to watch, but it obviously ended great.\" \nThe Champions League has brought Rooney pain in his career too. \nHe has been on the losing team on two occasions. Last year he had to watch it from the sidelines because of United's failure to qualify under David Moyes. \nRooney believes those days of disappointment are a thing of the past now. \nThe former Everton forward is convinced United are starting to become a force to be reckoned with once more under Louis van Gaal. \n\"We want to get back to winning trophies, of course. That is why you play football - to try and be successful, certainly at this club,\" Rooney said. \n\"In the last few years we haven't been good enough. \n\"There has been a big change in the club over the last few years and it's now starting to settle back down into a good rhythm with what the manager wants from us and we are improving. \n\"If we keep going the way we are, keep improving the way we are, then we will have a good chance of being successful.\" \nRooney, who turns 30 on Saturday, has won five Premier Leagues, two League Cups and the Champions League during a successful 13-year professional career. \nThere will be a tinge of disappointment when Rooney's career ends if he has not won Europe's top club competition once more. \nHe said: \"It's a tough competition to play in and obviously I am delighted to have won it in my time here, but obviously it is disappointing to lose two finals, so it would be nice if we go on a good run in the competition and try and get success in the competition again. \n\"But that's in the future. We have to focus now on the game tomorrow and try and get ourselves in a good position in the group.\" \nRooney does not see his 30th birthday as the start of his decline. \n\"I physically feel good and obviously it's a big birthday in anyone's life, your 30th birthday, but in terms of me and football I still feel I am still young enough, and that I have a lot of years ahead of me,\" said Rooney, who will draw level with Denis Law on 237 United goals if he scores in Wednesday's Group B match. \n\"I have had no major muscle injuries and I think, with all the support we get, it's still a fairly young age and hopefully I have got a lot of years to come.\" Related Sport News", "external_links": [], "published": "2015-10-21T12:05:00.000+03:00", "crawled": "2015-10-21T20:16:23.236+03:00", "highlightTitle": ""}