{"organizations": [], "uuid": "261fbb93ca135568e3e045516adc48e6331ca0c3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bellinghamherald.com", "main_image": "http://pics.mcclatchyinteractive.com/wire_photos/1vv2ip/picture39660249/ALTERNATES/LANDSCAPE_1140/Oregon%20Washington%20Football.JPEG", "site_section": "http://www.bellinghamherald.com/sports/college/?widgetName=rssfeed&widgetContentId=712015&getXmlFeed=true", "section_title": "College Sports News | BellinghamHerald.com &", "url": "http://www.bellinghamherald.com/sports/college/pac-12/university-of-washington/article39663459.html", "country": "US", "title": "Adams leads Ducks to 12th straight over Huskies 26-20", "performance_score": 0, "site": "bellinghamherald.com", "participants_count": 1, "title_full": "Adams leads Ducks to 12th straight over Huskies 26-20", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T10:21:00.000+03:00", "replies_count": 0, "uuid": "261fbb93ca135568e3e045516adc48e6331ca0c3"}, "author": "TIM BOOTH AP Sports Writer", "url": "http://www.bellinghamherald.com/sports/college/pac-12/university-of-washington/article39663459.html", "ord_in_thread": 0, "title": "Adams leads Ducks to 12th straight over Huskies 26-20", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "October 18, 2015 Adams leads Ducks to 12th straight over Huskies 26-20 Oregon quarterback Vernon Adams Jr., left, passes around his blockers in the first half of an NCAA college football game against Washington, Saturday, Oct. 17, 2015, in Seattle. Ted S. Warren AP Photo Washington quarterback Jake Browning (3) goes down on a keeper play as Oregon linebacker Danny Mattingly (46) pursues in the first half of an NCAA college football game, Saturday, Oct. 17, 2015, in Seattle. Ted S. Warren AP Photo Oregon wide receiver Darren Carrington, right, comes down with a touchdown catch over the defense of Washington defensive back Sidney Jones, left, in the first half of an NCAA college football game, Saturday, Oct. 17, 2015, in Seattle. Ted S. Warren AP Photo 1 of 3 Order Reprint of this Story SEATTLE \nFor the 12th straight season, Washington is left waiting for the next opportunity to get the better of Oregon. \nNot that the Huskies seemed in much of a hurry in the closing minutes on Saturday night to try and end their losing streak to the Ducks. \n\"Twelve years is disappointing,\" Washington defensive lineman Elijah Qualls said. \nOregon quarterback Vernon Adams Jr. returned after missing the previous two games to throw for 272 yards and two touchdowns, and the Ducks held off the Huskies 26-20 for their 12th straight win in the series. \nThe Huskies were unable to build off their big win at USC last week and watched Adams put on another show after being a thorn for Washington a year ago when he threw for seven touchdowns in a loss while still playing for Eastern Washington. \nUnder center for the first time since making a brief appearance against Utah on Sept. 26, Adams was back to tormenting the Huskies. \nAdams threw two touchdown passes to Darren Carrington, returning after missing the first six games of the season after failing an NCAA-administered drug test during the football playoffs last season. Adams hit Carrington for 36 yards on Oregon's first possession then capped the Ducks first drive of the second half with a 9-yard strike and a 23-6 lead. \nAdams finished 14 of 25 passing. Royce Freeman added 138 yards rushing and Bralon Addison added an 8-yard TD run. \n\"It's always fun playing here. I'm glad I got over that hump and got a win against them. It was fun,\" Adams said. \nWashington was playing catch-up from the start, falling behind 13-3 and 23-6 before making the fourth quarter uncomfortable for the Ducks. The lead was trimmed to 26-20 on Jake Browning's 3-yard TD pass to Jaydon Mickens with 3:35 remaining but the drive took nearly 5 ½ minutes and the Huskies had only one timeout remaining having to use one late in the scoring drive because players were out of position. \nThe pace seemed pedestrian considering the situation, but the Huskies didn't have issue with how the scoring drive went. \n\"We were trying to get the best plays we could get,\" Washington coach Chris Petersen said. \"And we could have had a little more urgency, but I think ... we'll go back and analyze that as well.\" \nOregon converted one first down but Adams was incomplete on third down and the Ducks punted back to Washington at its 20 with 1:11 left. K.J. Carta-Samuels was forced into duty at quarterback after Browning suffered a shoulder injury. After he got the Huskies to the 42, his pass was intercepted by Ugo Amadi with 24 seconds left. \n\"Clutch situations where we came up short before, we were able to step up this game,\" Oregon linebacker Christian French said. \nWashington's Myles Gaskin broke free for a 72-yard touchdown run late in the third quarter and finished with 155 yards rushing. But his long TD run was the only big play against an Oregon defense that had given up 530 yards to Utah and 641 last week to Washington State. Washington finished with 385 total yards and committed seven penalties in the first \nMeanwhile, Adams continually made big plays, especially on third down and making up for Washington's ability to keep Freeman relatively under control. Adams was 5 of 6 for 182 yards and a touchdown in the first half on third downs. It started immediately when he found Dwayne Stanford for 48 yards on third-and-7 on Oregon's first possession. Adams capped that drive with another third-down gem, hitting Carrington for 36 yards and a 6-0 Ducks lead. \nAdams added another third-down conversion to Carrington for 29 yards that led to Addison's 8-yard TD run. Adams' best throw came on the final drive of the first half when he escaped the sack attempt of Qualls and hit Addison for 44 yards after cornerback Kevin King tripped. That conversion led to Aidan Schneider's 28-yard field goal and a 16-3 Oregon lead at halftime. \n\"The dude is an athlete. We don't have a quarterback on our scout team that can simulate what he can do,\" Qualls said. \"The dude is a hell of a quarterback.\" Related content", "external_links": [], "published": "2015-10-18T10:21:00.000+03:00", "crawled": "2015-10-18T19:49:51.053+03:00", "highlightTitle": ""}