{"organizations": [], "uuid": "ed1c0b7b33f16a3af082195d6c5dc43a3d43139b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports/mlb", "section_title": "MLB News, Scores, Schedule, Standings, Stats, Photos, Videos - Baseball - MSN Sports", "url": "http://www.msn.com/en-us/sports/mlb/jays-put-playoff-fate-in-marcus-stromans-hands/ar-AAfnXj0", "country": "US", "title": "Jays Put Playoff Fate in Marcus Stroman's Hands", "performance_score": 0, "site": "msn.com", "participants_count": 1, "title_full": "Jays Put Playoff Fate in Marcus Stroman's Hands", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "ed1c0b7b33f16a3af082195d6c5dc43a3d43139b"}, "author": "Jacob Shafer", "url": "http://www.msn.com/en-us/sports/mlb/jays-put-playoff-fate-in-marcus-stromans-hands/ar-AAfnXj0", "ord_in_thread": 0, "title": "Jays Put Playoff Fate in Marcus Stroman's Hands", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Jays Put Playoff Fate in Marcus Stroman's Hands Bleacher Report 21 hrs ago Jacob Shafer Almost exactly seven months ago, Marcus Stroman lay crumpled on the ground after tearing his ACL during spring training fielding drills.\nAdChoices On Wednesday, he'll pitch the biggest game of his young career and easily the most important contest of the season for the Toronto Blue Jays .\nThere are a lot of storylines heading into Game 5 of the American League Division Series between the Jays and Texas Rangers . There's Toronto's offense, which looked sluggish through the first two games but plated five runs in a Game 3 victory and erupted for eight runs and three dingers in Game 4.\nThen there are the Rangers, who were riding high after taking a 2-0 series lead and pushing the powerful, favored Blue Jays to the brink. Now, suddenly, it's the Rangers who will be fighting for their lives north of the border.\nBut Stroman's incredible comeback stands above the rest. Game 5 will be his, quite literally, from the first pitch.\nIt's a leap of faith for Toronto, handing the ball to a 24-year-old kid who made a scant four regular season starts. They have David Price, after all, the former AL Cy Young winner they acquired at the trade deadline, presumably for just such an occasion.\nInstead, skipper John Gibbons summoned Price from the bullpen in Game 4, with the Jays leading 7-1. Price held the lead for three innings, though he surrendered three runs on six hits. In all, Price owns a 7.20 ERA in this ALDS and took the loss in Game 1.\nMany questioned the decision to use Price in that situation, including CBS Sports' Mike Axisa :\nI understand it's a lose or go home situation, but I still don't really understand using Price in relief with a six-run lead when he could instead start Game 5. That's why the Blue Jays traded for him, right? To start Games 1 and 5? I'd have no questions whatsoever if it was a one- or two-run game. But a six-run game?\nIt's a fair point. Price, who threw 50 pitches, insisted during postgame comments to Fox Sports' Ken Rosenthal that he'd be ready if called upon in Game 5. How much he'll have in the tank, however, is an open question.\n\"It wasn't an easy decision,\" Gibbons said after the game , per Brendan Kennedy of the Toronto Star . “It was hard for me to do, but I thought that was the best way to win the game, keep them from coming back.\"\nFor now, here's what we know: Game 5 belongs to Stroman, who immediately took to Twitter to express his excitement:\nCan't wait to be on the mound in the 6 on Wednesday. Going to be electric! #HDMH @BlueJays\n— Marcus Stroman (@MStrooo6) October 12, 2015\nIt's that exuberance, in part, that helped Stroman defy the odds and return ahead of schedule from his busted ACL.\n“I know they're saying I'm going to be out the whole year, but I still have hope,\" Stroman told Sportsnet.ca's Arden Zwelling in April. \"My thought process is I'm going to be ready for September.\"\nHe was ready, and he threw like he'd never left, allowing five runs and six walks and striking out 18 in 27 innings. Still, as the calendar flipped to October, no one knew exactly how Stroman would react. He'd been out so long, and this was his first dip into the postseason crucible.\nYes, the 2012 first-round pick teased ace-level potential in his rookie campaign in 2014, posting a 3.65 ERA with 111 strikeouts in 130.2 innings.\nBut this is the playoffs, when everything changes. The lights get brighter, the pressure ratchets up and even big talents are frequently humbled.\nStroman acquitted himself capably in his Game 2 debut, yielding three earned runs over seven frames and taking a no-decision as the Jays lost in extras. The Rangers inflicted most of their damage against him in the first two innings, suggesting nerves were likely a factor.\nOn Monday, Fox Sports 1 commentator Tom Verducci addressed that very question during his postgame remarks.\n\"After that first start, his feet will be on the ground from the first pitch,\" Verducci predicted. \"He'll be locked in, he won't be over-hyped.\"\nHe also may not need to be perfect. The Blue Jays' potent bats, which paced baseball in runs scored and a host of other categories, have apparently awoken.\nYes, they'll face Rangers ace Cole Hamels in Game 5, per Jeff Wilson of the Fort Worth Star-Telegram . But Toronto tagged the Texas southpaw for four runs in Game 2, and mashed lefties to the tune of an MLB -leading .818 OPS this season.\nStroman should get at least some support. All he needs to do is keep the Jays in the game and get the ball to the late innings, where Price could possibly be available along with 20-year-old closer Roberto Osuna, who is unscored upon in three impressive postseason appearances.\nIt should be added that Stroman and the Jays are attempting to complete a difficult, historically rare feat. As Sportsnet.ca's Shi Davidi pointed out prior to Game 3, of the 47 teams that have fallen behind 2-0 in the best-of-five division series, only five have lifted themselves off the mat and won the next three.\nNow, Toronto is a single victory away from becoming No. 6.\nSeven months ago, it looked like Marcus Stroman's season would never start. Now, improbably, he can ensure Toronto's doesn't end just yet.\nWelcome to October, kid.\nAll statistics current as of Oct. 12 and courtesy of MLB.com unless otherwise noted.\nGo to MSN Home", "external_links": ["http://www.sportsnet.ca/baseball/mlb/jays-stroman-want-back-september/", "http://ui.bamstatic.com/120sports/util/embed/ots.embed.js&quot;}", "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/AAfoeQ0.img&quot;}}", "https://twitter.com/hashtag/HDMH?src=hash", "http://ui.bamstatic.com/120sports/util/embed/ots.embed.js&quot;,&quot;tags&quot;:", "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/BB6qRzt.img&quot;,&quot;title&quot;:&quot;Will", "http://bleacherreport.com/", "https://twitter.com/JeffWilson_FWST/status/653687810486984704", "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/BB6qRzt.img&quot;,&quot;title&quot;:&quot;Blue", "http://www.thestar.com/sports/bluejays/2015/10/12/blue-jays-bash-their-way-back-into-alds-tie-with-rangers.html", "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/AAfnUWz.img&quot;}},{&quot;csId&quot;:&quot;BB2D59E&quot;,&quot;description&quot;:&quot;The", "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/AAfoVzl.img&quot;}},{&quot;csId&quot;:&quot;BB2D59E&quot;,&quot;description&quot;:&quot;John", "http://b.scorecardresearch.com/b?&quot;,&quot;Category&quot;:&quot;baseball_mlb&quot;},&quot;Mute&quot;:&quot;true&quot;,&quot;HomePageLink&quot;:&quot;//www.msn.com/en-us&quot;,&quot;GeofenceUseSps&quot;:&quot;false&quot;,&quot;GeofenceEnabled&quot;:&quot;true&quot;,&quot;AutoPlay&quot;:&quot;true&quot;,&quot;AutoPlay&quot;:true,&quot;Mute&quot;:true,&quot;SwfCacheRefreshTime&quot;:86400,&quot;AdConfig&quot;:{&quot;FWFlashProfile&quot;:&quot;188286:MSN_US_AS3_LIVE&quot;,&quot;FWHtml5Profile&quot;:&quot;188286:MSN_HTML5_Live&", "http://mlb.mlb.com/home", "http://bleacherreport.com/toronto-blue-jays", "https://twitter.com/BlueJays", "http://www.cbssports.com/mlb/eye-on-baseball/25337234/price-pitches-in-relief-in-game-4-setting-stroman-up-for-game-5-start", "http://go.microsoft.com/fwlink/?LinkID=286759", "http://bleacherreport.com/texas-rangers", "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/BB6qRzt.img&quot;,&quot;title&quot;:&quot;Why", "https://twitter.com/MStrooo6/status/653715580940214272", "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/AAfnUqD.img&quot;}}", "http://bleacherreport.com/mlb", "http://www.sportsnet.ca/baseball/mlb/blue-jays-hoping-return-of-offence-can-ensure-theres-a-tomorrow/", "http://c.120sportsstatic.com/gen/client/rss/timeline.xml&quot;},{&quot;ns&quot;:&quot;ignore_this_version&quot;,&quot;value&quot;:&quot;System.Collections.Generic.List`1"], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-14T03:54:12.889+03:00", "highlightTitle": ""}