{"organizations": [], "uuid": "ba56365f1eee7e79ea057fbe0569fdf7760cf734", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sport.co.uk", "main_image": "http://images.sport.co.uk/150x150/d08fe94127bca2c9e8a941c94551bc47.jpg", "site_section": "http://feeds.feedburner.com/SportcoukNewsRssFeed", "section_title": "General Sports News from Sports.co.uk", "url": "http://www.sport.co.uk/rugby/sean-obrien-ireland-must-shut-down-mathieu-bastareaud-to-b/6892733/", "country": "JE", "title": "Sean O'Brien: Ireland must shut down Mathieu Bastareaud to beat France", "performance_score": 0, "site": "sport.co.uk", "participants_count": 0, "title_full": "Sean O'Brien: Ireland must shut down Mathieu Bastareaud to beat France", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T06:46:00.000+03:00", "replies_count": 0, "uuid": "ba56365f1eee7e79ea057fbe0569fdf7760cf734"}, "author": "", "url": "http://www.sport.co.uk/rugby/sean-obrien-ireland-must-shut-down-mathieu-bastareaud-to-b/6892733/", "ord_in_thread": 0, "title": "Sean O'Brien: Ireland must shut down Mathieu Bastareaud to beat France", "locations": ["France", "Ireland"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["France Sean O'Brien", "Sean O'Brien", "Mathieu Bastareaud"], "text": "Sean O'Brien: Ireland must shut down Mathieu Bastareaud to beat France 05 Oct 2015 03:46:53 \ncomments \nIreland must shut down powerhouse Mathieu Bastareaud to beat France and avoid New Zealand in the World Cup quarter-finals, according to Sean O'Brien. \nToulon centre Bastareaud will attempt to terrorise Ireland's defence in Sunday's Pool D decider in Cardiff, with flanker O'Brien accepting Joe Schmidt's men must deny the 27-year-old any room to run. \nIreland edged past Italy 16-9 at London's Olympic Stadium on Sunday, securing their last-eight berth, but their patchy showing left coaches and players targeting comprehensive improvement in order to beat France. \n\"France are very physical, they pride themselves on that and it will be no different when they play us,\" said O'Brien. \n\"We have to expect huge physicality, at international level you're going to be in for a battle. \n\"So you've got to prepare yourself for that in the week and make sure you're ready to rock at the weekend. \n\"Bastareuad is always someone who will lead that charge for them. \n\"You've got to take his space away, he's an intelligent rugby player, he's obviously very, very strong and he's a leader for France. \n\"He's a very, very dangerous player and one we've got to keep an eye out for.\" \nKeith Earls set a new Irish record with his eighth World Cup try but head coach Schmidt's men rode their luck at times against Italy. \nPeter O'Mahony's try-saving tackle on Josh Furno proved pivotal, as Ireland held on, then immediately turned attention to France. \n\"It's a timely reminder of where we need to be,\" said Ireland captain Paul O'Connell of the below-par performance against Italy. \n\"France are an incredible side with incredible talent. They have size, physicality, skill and they play with a lot of passion as well. \n\"In recent years we've done well, we've had to produce massive performances to make those games tight. It's a mountain of a challenge.\" \nIreland boss Schmidt was equally circumspect at progression to the quarter-finals. \nHis side will most likely face Argentina if they beat France and top Pool D, while finishing second would yield a meeting with New Zealand - the only Test nation Ireland have never beaten. \n\"I said last week I'd take a one-point win - I'd rather not though, even a one-score game is tough on the heart,\" said Schmidt. \n\"Sometimes it's not your day and in the context of that, we are delighted to have got the result and qualified for the quarter-finals.\" Related Sport News", "external_links": [], "published": "2015-10-05T06:46:00.000+03:00", "crawled": "2015-10-05T18:50:04.071+03:00", "highlightTitle": ""}