{"organizations": [], "uuid": "0a199ca28091ec535a844e4a1944dfeed1e8f88b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.abccolumbia.com", "main_image": "http://media.abccolumbia.com/images/Elliott+Visor.jpeg", "site_section": "http://www.abccolumbia.com/sports/index.rss2", "section_title": "WOLO - Sports", "url": "http://www.abccolumbia.com/sports/Gamecocks-Get-19-10-Win-In-Elliotts-Debut-333695661.html", "country": "US", "title": "Gamecocks Get 19-10 Win In Elliott's Debut", "performance_score": 0, "site": "abccolumbia.com", "participants_count": 0, "title_full": "Gamecocks Get 19-10 Win In Elliott's Debut", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T03:36:00.000+03:00", "replies_count": 0, "uuid": "0a199ca28091ec535a844e4a1944dfeed1e8f88b"}, "author": "", "url": "http://www.abccolumbia.com/sports/Gamecocks-Get-19-10-Win-In-Elliotts-Debut-333695661.html", "ord_in_thread": 0, "title": "Gamecocks Get 19-10 Win In Elliott's Debut", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Elliott"], "text": "Gamecocks Get 19-10 Win In Elliott's Debut Tools \nStory Created: Oct 17, 2015 at 8:36 PM   17, 2015 at 8:36 PM EDT COLUMBIA, S.C. (AP) -- Pharoh Cooper caught seven passes for 160 yards, including South Carolina's only touchdown, and the Gamecocks won interim coach Shawn Elliott's first game 19-10 over Vanderbilt on Saturday.Former walk-on Perry Orth was 17 of 28 for 272 yards, and Brandon Wilds ran 24 times for 119 yards for South Carolina (3-4, 1-4 Southeastern), which won just its second league game since September 2014.The Commodores (2-4, 0-3) turned it over five times and lost their 11th straight SEC game.Skai Moore had an interception, a sack, recovered a fumble and led the Gamecocks with 11 tackles.Vanderbilt led 10-6 and appeared to be in control when Orth hit Cooper on a 78-yard touchdown pass. South Carolina turned it over on its next two possessions, but mistakes kept the Commodores from getting back on track.Elliott took over as coach Tuesday after Steve Spurrier resigned during his 11th season on the sidelines.Elliott Fry made four field goals of 19, 22, 31 and 47 yards and missed two from 39 and 55 yards for South Carolina.Darrius Sims ran six times for 104 yards, and Johnny McCrary went 21-of-42 for 177 yards, a touchdown and three interceptions for the Commodores.For the first time since 1999, South Carolina started a game without a coach who won a national championship on the sidelines; Steve Spurrier resigned Tuesday during his 11th season after he had taken over for Lou Holtz. Spurrier spent his Saturday at the Michigan State-Michigan game, hanging out with ESPN.The Gamecocks turned to their offensive line coach to finish the season as head coach.The team responded with its best offensive performance of the season, gaining 424 yards. And the defense, which came into the game last in the SEC, held Vanderbilt to 332 yards, 96 yards below the unit's average.But there aren't a lot of easy games left on South Carolina's schedule. The Gamecocks play three teams -- Texas A&M, Florida and Clemson -- who all started Saturday in the top 10. They have to win one of those to be eligible for an eighth straight bowl game.South Carolina has trailed at half every game this season. The Gamecocks led for most of the first 30 minutes, but a 14-play, 79-yard drive that took up nearly half the second quarter ended with a 4-yard touchdown pass from McCrary to Caleb Scott that put Vanderbilt up 7-6 at the break.South Carolina failed to get a first down in its next possession, and Vanderbilt put together a 10-play drive, but the Gamecocks defense stopped the Commodores on third-and-2 from the 5, forcing a 23-yard field goal.Cooper caught his touchdown pass three plays later.Vanderbilt would turn it over four more times, and South Carolina gave the ball away twice the rest of the way.Second-year Vanderbilt coach Derek Mason has yet to win an SEC game after taking over for James Franklin who went 9-7 in the conference in his final two seasons with the Commodores.", "external_links": [], "published": "2015-10-18T03:36:00.000+03:00", "crawled": "2015-10-18T05:21:10.607+03:00", "highlightTitle": ""}