{"organizations": ["Diamondbacks Facebook Email Twitter Google", "Conversation To   Astros", "Diamondbacks", "Arizona Diamondbacks", "Facebook Astros", "Astros", "AP", "LinkedIn Pinterest Astros", "Houston Astros"], "uuid": "2e91caa8e9536b00cd941e434d2d24da776754db", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usatoday.com", "main_image": "http://www.gannett-cdn.com/-mm-/f2969f2e530b9825a5d30c516d7a682b39179683/c=0-0-2992-1690&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/04/USATODAY/USATODAY/635795820354514305-AP-ASTROS-DIAMONDBACKS-BASEBALL-76486674.JPG", "site_section": "http://rssfeeds.khou.com/_/20/109892768/khou/sports", "section_title": "KHOU - Sports", "url": "http://www.usatoday.com/story/sports/mlb/2015/10/04/houston-headed-to-playoffs-despite-5-3-loss-to-arizona/73350964/", "country": "US", "title": "Astros headed to playoffs despite loss to Diamondbacks", "performance_score": 0, "site": "usatoday.com", "participants_count": 0, "title_full": "Astros headed to playoffs despite loss to Diamondbacks", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T02:08:00.000+03:00", "replies_count": 0, "uuid": "2e91caa8e9536b00cd941e434d2d24da776754db"}, "author": "", "url": "http://www.usatoday.com/story/sports/mlb/2015/10/04/houston-headed-to-playoffs-despite-5-3-loss-to-arizona/73350964/", "ord_in_thread": 0, "title": "Astros headed to playoffs despite loss to Diamondbacks", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jake Marisnick", "Ralph Freso", "Trey Hillman"], "text": "Facebook Email Twitter Google+ LinkedIn Pinterest Astros headed to playoffs despite loss to Diamondbacks The Houston Astros are going to the playoffs for the first time in a decade despite ending the regular season with a 5-3 loss to the Arizona Diamondbacks on Sunday. Post to Facebook Astros headed to playoffs despite loss to Diamondbacks The Houston Astros are going to the playoffs for the first time in a decade despite ending the regular season with a 5-3 loss to the Arizona Diamondbacks on Sunday.   USATODAY.com: http://usat.ly/1LcBQuD   Join the Nation's Conversation To   Astros headed to playoffs despite loss to Diamondbacks AP 7:08 p.m. EDT October 4, 2015 Astros outfielder Jake Marisnick, right, embraces bench coach Trey Hillman in the dugout. (Photo: Ralph Freso, AP) 1 CONNECT TWEET LINKEDIN COMMENT EMAIL MORE \nPHOENIX (AP) — The Houston Astros are going to the playoffs for the first time in a decade despite ending the regular season with a 5-3 loss to the Arizona Diamondbacks on Sunday. \nThe Astros led the AL wild-card race by a game heading into Sunday. They shared a few high fives in the dugout in the eighth inning after clinching it when the Los Angeles Angels lost to Texas. \nHouston finished 86-76 to reach the postseason for the first time since playing the Chicago White Sox in the 2005 World Series. The Astros will play their first American League playoff game Tuesday night, against the New York Yankees at Yankee Stadium. \nNot bad for a team that had three 100-loss seasons before going 70-92 in 2014. \nArizona went 79-83 in its first season under general manager Dave Stewart and manager Chip Hale, a 15-game improvement from finishing with baseball's worst record in 2014. \nPaul Goldschmidt hit a two-run homer off Chad Qualls (3-5) and A.J. Pollock had a solo shot among his three hits for Arizona. Daniel Hudson (4-3) got the final two outs of the seventh inning and Brad Ziegler recorded six outs for his 28th straight save, matching the team record set by J.J. Putz from 2011-12. \nThe Astros entered Sunday's game knowing they would play at least one more time this season. \nWhere, when and against whom were still up in the air. \nHouston had a chance to play Texas in a one-game playoff for the AL West title, a one-game playoff against the Angels to determine the second AL wild-card team or go straight to the wild-card game. Astros earn playoff berth thanks to Rangers \nThe Astros were hoping to take care of their end of things by sending out Lance McCullers, the 22-year-old who leads all AL rookies with 3.19 ERA. \nHouston dug a hole right away, with Pollock hitting a long solo homer to center in the first inning. It was Pollock's 20th of the season, making him and Goldschmidt the first Arizona teammates to have 20 homers and 20 steals in the same season since Justin Upton and Chris Young in 2011. \nBut with Los Angeles leading Texas on the scoreboard, the Astros pulled even in the third inning on George Springer's run-scoring double. \nMcCullers escaped a bases-loaded jam in the third inning, but hurt himself in the inning by dropping a toss from first baseman Chris Carter for an error, then balking in a run to put Arizona up 2-1 as Texas took the lead over the Angels. \nHouston tied it in the fifth on a fielder's choice by pinch-hitter Evan Gattis, but Arizona went back up on Jarrod Saltalamacchia's run-scoring double in the bottom half. \nMcCullers allowed three runs — two earned — on six hits and struck out six in five innings. \nThe Astros tied it at 3-all in the seventh inning on a wild pitch by Daniel Hudson, but Goldschmidt put the Diamondbacks up 5-3 with a towering two-run homer to left in the bottom half. \nIt didn't really matter to the Astros at that point; the Rangers were up 9-2 over the Angels in the eighth. \nUP NEXT \nAstros: Houston will face the Yankees in the AL wild card Tuesday in New York. \nTRAINER'S ROOM \nAstros: OF Carlos Gomez sat out his third straight game with sore ribs. \nDiamondbacks: RHP Evan Marshall, who has been out since being struck in the head by a line drive on Aug. 4, rejoined the team on the bench for the season finale. \nPHOTOS: TEAMS CELEBRATE POSTSEASON BERTHS", "external_links": [], "published": "2015-10-05T02:08:00.000+03:00", "crawled": "2015-10-05T02:15:51.776+03:00", "highlightTitle": ""}