{"organizations": [], "uuid": "2e46ec19e057ba11b6ad1234dc931f56c128db4f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/", "section_title": "Ahram Online - News, Business, Culture, Sports &amp; Multimedia from Egypt ", "url": "http://english.ahram.org.eg/NewsContent/2/9/161401/World/International/Shock,-hugs-and-tears-as-wardivided-Koreans-reunit.aspx", "country": "EG", "title": "Shock, hugs and tears as war-divided Koreans reunite - International - World", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "Shock, hugs and tears as war-divided Koreans reunite - International - World - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "2e46ec19e057ba11b6ad1234dc931f56c128db4f"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/2/9/161401/World/International/Shock,-hugs-and-tears-as-wardivided-Koreans-reunit.aspx", "ord_in_thread": 0, "title": "Shock, hugs and tears as war-divided Koreans reunite - International - World", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related North, South Korea to hold family reunion in October North, South Korea begin family reunion talks N. Korea threatens to renege on reunions with South North and S.Korea discuss reunions under shadow of war drills Nearly 400 mostly elderly and frail South Koreans held a tearful, emotionally fraught reunion Tuesday with family members in North Korea, more than 60 years after they were separated by the Korean War.\nAfter crossing the heavily militarised border in a convoy of buses, the families from the South were driven to meet their relatives in North Korea's Mount Kumgang resort.\nMoving video footage broadcast on South Korean TV showed divided brothers, sisters, uncles, aunts, step-siblings and in-laws seeking each other out among numbered tables in the resort's main hall and then collapsing into each others' arms.\nFor Lee Jeong-Sook, 68, the moment brought her face-to-face with her 88-year-old father, Ri Hong-Jong, who she was separated from when she was just two years old.\nRi was brought into the meeting room in a wheelchair and promptly burst into tears at the sight of his younger sister, Lee's aunt, who rushed towards him shouting: \"Brother!\"\n\"This is your daughter. This is your daughter,\" his sister said, pointing to Lee.\nSeemingly overcome by the moment, Ri just nodded and squeezed his sister's hand before asking for news of other family members in the South.\n\"Almost all died in the war,\" she answered.\nMillions of people were displaced by the sweep of the 1950-53 Korean conflict, which saw the front line yo-yo from the south of the Korean peninsula to the northern border with China and back again.\nThe chaos and devastation separated brothers and sisters, parents and children, husbands and wives.\nWith more than 65,000 South Koreans currently on the waiting list for a reunion spot, those who made it on Tuesday represented a very fortunate minority.\nThe two ambulances following the South Korean buses on Tuesday testified to the advanced age and, in many cases, poor health, of those making the journey.\nMore than 20 required wheelchairs for mobility and four dropped out of the trip altogether, saying they felt too unwell.\nThe eldest South Korean taking part in the event, 96-year-old Kim Nam-Kyu, was supported by his two daughters as he met his younger sister for the first time in more than six decades.\nAt first they simply sat in silence, holding hands, and then Kim's sister produced photos of her family in the North -- her son, daughter-in-law and granddaughter.\nKim and others of his generation had hearing difficulties, and some clearly struggled to communicate verbally.\nOne woman simply knelt before her North Korean uncle and buried her face in his lap, weeping uncontrollably.\nMost of the women wore traditional hanbok dresses while the men were in suits and ties, with all the North Korean participants also sporting the obligatory badges with the faces of late leaders Kim Il-Sung and Kim Jong-Il.\nPhotographs were piled on nearly every table -- crumpled, black and white prints of families once together, and colour pictures of new families raised apart.\nThe reunion -- only the second in the past five years -- was organised as part of an agreement the two Koreas reached in August to ease tensions that had pushed them to the brink of armed conflict.\nThe reunion programme began in earnest after a historic North-South summit in 2000, but the numbers clamouring for a chance to take part have always far outstripped those actually selected.\nAmong the generation that actually experienced the division of their families, the vast majority died without ever having any contact with their relatives in the North.\nAfter so many years of waiting, the reunions are cruelly short.\nOver three days, the South Koreans will sit down with their North Korean relatives six times.\nEach interaction only lasts two hours, meaning a total of just 12 hours to mitigate the trauma of more than six decades of separation.\nIn a reflection of the stark economic divide between the two Koreas, all the South Korean families had brought gift packages, including winter clothing, watches, cosmetics and -- in most cases -- several thousand US dollars in cash.\nSouth Korean officials had warned in advance that a substantial slice of any money handed over would be \"appropriated\" by the authorities in the North.", "external_links": [], "published": "2015-10-20T03:00:00.000+03:00", "crawled": "2015-10-20T23:23:39.379+03:00", "highlightTitle": ""}