{"organizations": [], "uuid": "fae6d797c544e18d63fc6c082e9245eb191f518a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.medicalnewstoday.com", "main_image": "http://cdn1.medicalnewstoday.com/content/images/articles/301/301369/man-lifting-a-weight.jpg", "site_section": "http://www.medicalnewstoday.com/rss/sports_medicine.xml", "section_title": "Sports Medicine / Fitness News From Medical News Today", "url": "http://www.medicalnewstoday.com/articles/301369.php", "country": "US", "title": "Study sheds light on body's varied response to exercise", "performance_score": 1, "site": "medicalnewstoday.com", "participants_count": 0, "title_full": "Study sheds light on body's varied response to exercise", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T10:00:00.000+03:00", "replies_count": 0, "uuid": "fae6d797c544e18d63fc6c082e9245eb191f518a"}, "author": "", "url": "http://www.medicalnewstoday.com/articles/301369.php", "ord_in_thread": 0, "title": "Study sheds light on body's varied response to exercise", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Study sheds light on body's varied response to exercise Published: Saturday 24 October 2015 at 12am PST Published: Sat 24 Oct 2015 at 12am PST email MNT featured Academic journal Resistance exercise is the way to go for people who want to increase their muscle size and strength, while endurance exercise is key for boosting stamina. But what are the mechanisms that drive the body's response to these different forms of exercise? A new study has identified one gene that plays a key role. Researchers find that a gene called PGC-1α plays an important role in the body's response to difference forms of exercise. \nStudy coauthor Heikki Kainulainen, of the University of Jyväskylä in Finland, and colleagues publish their findings in the journal Physiological Reports . \nResistance exercise is defined as any activity that causes the skeletal muscles to contract, such as weightlifting, push-ups and squats. Endurance exercise, or aerobic exercise, is any activity that maintains an increase in heart rate and breathing, such as walking, cycling and swimming. \nBoth forms of exercise have a different impact on the body. While resistance exercise can improve strength of skeletal muscles, endurance exercise can improve overall functional capacity. \nBecause the effects of resistance and endurance exercise are so diverse, researchers speculate that there are numerous different processes involved in how the body responds to each form of physical activity. \n\"Yet,\" Kainulainen and colleagues note, \"there have been attempts to identify single signaling cascades or molecules that could work as a master regulator for controlling exercise-specific adaptations.\" \nPrevious research has indicated that a gene called peroxisome proliferator-activated receptor-gamma coactivator 1α (PGC-1α) may be involved in how the body responds to certain forms of exercise. The team set out to investigate the role of this gene further in this latest study. PGC-1α isoform production differs by type of exercise \nThe researchers enrolled 19 physically active men to their study and divided them into two groups. One group performed 50 minutes of endurance exercise in the form of walking on a treadmill, while the other group performed 50 minutes of leg press exercises, representing resistance activity. \nBiopsies were taken from the thigh muscles of the men just before exercise, as well as 30 and 180 minutes after, which the researchers analyzed in order to assess PGC-1α activity. \nThe team found that both endurance and resistance exercise stimulated the PGC-1α gene, causing it to produce isoforms known as PGC-1α exon 1b, PGC-1α exon 1b' and truncated PGC-1α. Isoforms are different types of a protein that are produced from the same gene or produced from different genes if only a part of a gene's code is identified. \nHowever, the researchers noticed that only endurance exercise triggered the production of an isoform called PGC-1α exon 1a. \nWhat is more, the team found that endurance exercise activated genes that encouraged new blood vessel growth and increased stamina. While resistance exercise also stimulated a gene that boosted blood vessel growth, it also activated a gene that stimulated muscle growth. \nExplaining what their findings show, the authors say: \n\"Our results improve the understanding of exercise-type specific early signaling events and support the idea that gene expression responses of PGC-1α isoforms may have an important role in exercise-induced muscle adaptations.\" \nThe researchers note, however, that further studies are warranted to confirm the different roles of PGC-1α isoforms in the body's response to different types of exercise. Earlier this month, Medical News Today reported on a study suggesting a pill to replace exercise could soon be a feasible option.", "external_links": [], "published": "2015-10-24T10:00:00.000+03:00", "crawled": "2015-10-24T12:29:23.054+03:00", "highlightTitle": ""}